{"id": 1140520, "updated": "2023-09-27 03:40:06.189", "metadata": {"title": "A model for the homotopy theory of homotopy theory", "authors": "[{\"first\":\"Charles\",\"last\":\"Rezk\",\"middle\":[]}]", "venue": "Trans. Amer. Math. Soc. 353 (2001), 973-1007", "journal": null, "publication_date": {"year": 1998, "month": null, "day": null}, "abstract": "We describe a category, the objects of which may be viewed as models for homotopy theories. We show that for such models, ``functors between two homotopy theories form a homotopy theory'', or more precisely that the category of such models has a well-behaved internal hom-object.", "fields_of_study": "[\"Mathematics\"]", "external_ids": {"arxiv": "math/9811037", "mag": "2952558250", "acl": null, "pubmed": null, "pubmedcentral": null, "dblp": null, "doi": "10.1090/s0002-9947-00-02653-2"}}, "content": {"source": {"pdf_hash": "2ad8bc9b2248a452c6af0dc841994fe501d3bc04", "pdf_src": "Arxiv", "pdf_uri": "[\"https://arxiv.org/pdf/math/9811037v3.pdf\"]", "oa_url_match": false, "oa_info": {"license": null, "open_access_url": "https://www.ams.org/tran/2001-353-03/S0002-9947-00-02653-2/S0002-9947-00-02653-2.pdf", "status": "HYBRID"}}, "grobid": {"id": "678f4ebd29fae05022030a5c1789bef0e3ef7684", "type": "plain-text", "url": "s3://ai2-s2-pdf-extraction-prod/parse-results/s2orc_worker/2ad8bc9b2248a452c6af0dc841994fe501d3bc04.txt", "contents": "\nA MODEL FOR THE HOMOTOPY THEORY OF HOMOTOPY THEORY\n10 Mar 2000\n\nCharles Rezk \nA MODEL FOR THE HOMOTOPY THEORY OF HOMOTOPY THEORY\n\nTRANSACTIONS OF THE AMERICAN MATHEMATICAL SOCIETY\n0010 Mar 2000arXiv:math/9811037v3 [math.AT]\nWe describe a category, the objects of which may be viewed as models for homotopy theories. We show that for such models, \"functors between two homotopy theories form a homotopy theory\", or more precisely that the category of such models has a well-behaved internal hom-object.Received by the editors whenever they got it, maybe October 18, 1999 or thereabouts.\n\nIntroduction\n\nQuillen introduced the notion of a closed model category [Qui67], which is a category together with a distinguished subcategory of \"weak equivalences\", along with additional structure which allows one to do homotopy theory. Examples of closed model categories include the category of topological spaces with the usual notion of weak equivalence, and the category of bounded-below chain complexes, with quasi-isomorphisms as the weak equivalences. A model category has an associated homotopy category. More strikingly, a model category has \"higher homotopy\" structure. For instance, Quillen observed that one can define homotopy groups and Toda brackets in a closed model category. Dwyer and Kan later showed [DK80] that for any two objects in a model category one can define a function complex.\n\nQuillen's motivation for developing the machinery of closed model categories was to give criteria which would imply that two models give rise to \"equivalent\" homotopy theories, in an appropriate sense; his criterion is now referred to as a \"Quillen equivalence\" of closed model categories. For example, the categories of topological spaces and simplicial sets, which both admit closed model category structures, should be viewed as alternate models for the same homotopy theory, since any \"homotopy-theoretic\" result in one model translates into a similar result for the other. This is similar to the distinction one makes between the notion of a \"space\" and a \"homotopy type\". (In Quillen's case, the problem at hand was that of algebraic models for rational homotopy theory [Qui69].)\n\nThus it is convenient to distinguish between a \"model\" for a homotopy theory and the homotopy theory itself. A \"model\" could be a closed model category, though one might want to consider other kinds of models. This notion of an abstract homotopy theory, as opposed to a model for a homotopy theory, was clarified by Dwyer and Kan [DK80]. Their work consists of several parts. First, in their theory, the minimal data needed to specify a homotopy theory is merely a category equipped with a distinguished subcategory of \"weak equivalences\". Second, they show that any such data naturally gives rise to a simplicial localization, which is a category enriched over simplicial sets. If the initial data came from a model category, then one can recover its homotopy category and higher composition structure from the simplicial localization.\n\nFurthermore, Dwyer and Kan define a notion of equivalence of simplicial localizations, which provides an answer to the question posed by Quillen on the equivalence of homotopy theories. In fact, the category of simplicial localizations together with this notion of equivalence gives rise to a \"homotopy theory of homotopy theory\". A brief discussion of this point of view may be found in [DS95,§11.6].\n\nOn the other hand, one can approach abstract homotopy theory from the study of diagrams in a homotopy theory. For instance, a category of functors from a fixed domain category which takes values in a closed model category is itself (under mild hypotheses) a closed model category. In particular, the domain category may itself be a closed model category, (or a subcategory of a closed model category). Thus, just as functors from one category to another form a category, one expects that functors from one homotopy theory to another should form a new homotopy theory. Such functor categories are of significant practical interest; applications include models for spectra, simplicial sheaf theory, and the \"Goodwillie calculus\" of functors.\n\nIn this paper we study a particular model for a homotopy theory, called a complete Segal space, to be described in more detail below. The advantage of this model is that a complete Segal space is itself an object in a certain Quillen closed model category, and that the category of complete Segal spaces has internal hom-objects. Our main results are the following:\n\n(0) A complete Segal space has invariants such as a \"homotopy category\" and \"function complexes\", together with additional \"higher composition\" structure ( §5). (1) There exists a simplicial closed model category in which the fibrant objects are precisely the complete Segal spaces (7.2). (I.e., there is a \"homotopy theory of homotopy theories\".) (2) This category is cartesian closed, and the cartesian closure is compatible with the model category structure. In particular, if X is any object and W is a complete Segal space, then the internal hom-object W X is also a complete Segal space (7.3). (I.e., the functors between two homotopy theories form another homotopy theory.)\n\nIn fact, the category in question is just the category of simplicial spaces supplied with an appropriate closed model category structure. The definition of a complete Segal space is a modification of Graeme Segal's notion of a ∆-space, which is a particular kind of simplicial space which serves as a model for loop spaces. The definition of \"complete Segal space\", given in Section 6, is a special case of that of a \"Segal space\", which is defined in Section 4.\n\n1.1. Natural examples. Complete Segal spaces arise naturally in situations where one can do homotopy theory. Any category gives rise to a complete Segal space by means of a classifying diagram construction, to be described below. A Quillen closed model category can give rise to a complete Segal space by means of a classification diagram construction, which is a generalization of the classifying diagram. More generally, a pair (C, W ) consisting of a category C and a subcategory W gives rise to a complete Segal space by means of a localization of the classification diagram. Given a closed model category M and a small category C, it is often the case that the category M C of functors from C to M is again a closed model category.\n\nIn this case, one can ask whether the classification diagram of M C is equivalent to the complete Segal space obtained as the internal hom-object of maps from the classifying diagram of C to the classification diagram of M. A consequence (8.12) of a result of Dwyer and Kan tells us that this equivalence holds at least when M is the category of simplicial sets, or more generally a category of diagrams of simplicial sets; it presumably holds for a general closed model category, but we do not prove that here.\n\n1.2. Classifying diagrams and classification diagrams. We give a brief description of the classifying diagram and classification diagram constructions here, in order to motivate the definition of a complete Segal space. These constructions are discussed in detail in Section 3.\n\nTo any category C one may associate its classifying space BC; this is a space obtained by taking a vertex for each object of C, attaching a 1-simplex for each morphism of C, attaching a 2-simplex for each commutative triangle in C, and so forth. It is well-known that if the category C is in fact a groupoid, then it is characterized (up to equivalence of categories) by its classifying space; for a groupoid C the classifying space BC has the homotopy type of a disjoint union of spaces K(π X , 1), where X ranges over the representatives of isomorphism classes of objects in C and each π X is the group of automorphisms of the object X in C.\n\nA general category cannot be recovered from its classifying space. Instead, let iso C denote the subcategory of C consisting of all objects and all isomorphisms between them; thus iso C is just the maximal subgroupoid of the category C. From the homotopy type of the classifying space B(iso C) of this groupoid one can recover some information about the category C, namely the set of isomorphism classes of objects in C and the group of automorphisms of any object. For this reason one may view B(iso C) as a kind of \"moduli space\" for the category C.\n\nAlthough a category C is not determined by its classification space, it turns out (3.7) that it is determined, up to equivalence, by a simplicial diagram of spaces [n] → B iso(C [n] ) which we call the classifying diagram of C; here [n] denotes the category consisting of a sequence of (n + 1) objects and n composable arrows, and C [n] denotes the category of functors from [n] → C. The classifying diagram of a category is in fact a complete Segal space.\n\nThe homotopy theoretic analogue of B(iso C) is Dwyer and Kan's notion of the classification space of a model category. Given a closed model category M, let we M ⊂ M denote the subcategory consisting of all objects and all weak equivalences between them. The classification space of M is denoted class(M), and is defined to be B(we M), the classifying space of the category of weak equivalences of M. The classification space of a model category is in many ways analogous to the space B(iso C) considered above. For example, class(M) has the homotopy type of a disjoint union of spaces B(haut X), where X ranges over appropriate representatives of weak equivalence classes of objects in M, and haut X denotes the simplicial monoid of self-homotopy equivalences of X (8.7). Classification spaces arise naturally in the study of realization problems, e.g., the problem of realizing a diagram in the homotopy category of spaces by an actual diagram of spaces; see [DK84b], [DK84a]. Given a closed model category M, form a simplicial space [n] → class(M [n] ), called the classification diagram of M. We show (8.3) that the classification diagram of a closed model category is essentially a complete Segal space. (\"Essentially\" means up to an easy fibrant replacement.) 1.3. Applications. We believe that the most interesting feature of the theory of complete Segal spaces described above is that constructions of new homotopy theories from old ones can be made entirely inside the setting of the theory. We have already described one example: diagrams categories in a model category can be modeled as the internal function complex in the category of simplicial spaces. (We only give the proof here for the case where the model category is simplicial sets, however.)\n\nA related construction is that of homotopy inverse limits of homotopy theories. We give one example here, without proof, to illustrate the ideas. Let W = class(T * ), the classification diagram of the category of pointed topological spaces; W is a complete Segal space. Let ω : W → W be the self-map associated to the loop-space functor Ω : T * → T * . Then we can form the homotopy inverse limit W ∞ , in the category of simplicial spaces, of the tower:\n. . . → W ω − → W ω − → W ω − → W .\nOne discovers that W ∞ is again a complete Segal space, and that it is weakly equivalent to the classification space of the category of spectra! One should understand this example as a reinterpretation of the definition of the notion of Ω-spectra.\n\nAnother example is that of sheaves of homotopy theories. There is a model category for sheaves of spaces (= sheaves of simplicial sets) over a base space (or more generally a Grothendieck topology) [Jar87], [Jar96]. Thus there is a model category structure for sheaves of simplicial spaces. Say a sheaf of simplicial spaces W is a complete Segal sheaf if each stalk is a complete Segal space in the sense of this paper. This would appear to provide an adequate notion of \"sheaves of homotopy theories\", and is worth investigation.\n\n1.4. Other models. We note that several other abstract models of homotopy theory have been proposed. One has been proposed by W. Dwyer and D. Kan, as was noted above. Since the complete Segal spaces described in our work are themselves objects in a certain closed model category, our construction gives another model for a homotopy theory of homotopy theory. We believe that our model is \"equivalent\" to that of Dwyer and Kan, via a suitable notion of equivalence; in particular, there should be constructions which take complete Segal spaces to simplicially enriched categories and vice versa, and these constructions should be inverses to each other (modulo appropriate notions of equivalence.) We hope to give a proof of this in the future.\n\nAnother model has been proposed by A. Heller [Hel88]. He suggests that a homotopy theory be modeled by a certain type of contravariant 2-functor from the category of small categories to the category of large categories. For example, from a closed model category M there is a construction which assigns to each small category C the homotopy category Ho(M C ) of the category of C-diagrams in M, and which associates to each functor C → D restriction functors Ho(M D ) → Ho(M C ) which themselves admit both left and right adjoints, arising from \"homotopy Kan extensions\". Because Heller's models require the existence of such homotopy Kan extensions, they seem to be less general than the models considered in this paper, and we do not know the proper relationship between his theory and the others.\n\n1.5. Organization of the paper. In Section 2 we set up notation for simplicial spaces and discuss the Reedy model category structure for simplicial spaces. In Section 3 we define the classification diagram construction, which produces a simplicial space from category theoretic data. In Section 4 we define the notion of a Segal space, and in Section 5 we discuss in elementary terms how one can view a Segal space as a model for a homotopy theory. In Section 6 we define the notion of a complete Segal space. In Section 7 we present our main theorems. In Section 8 we show how the classification diagram of a simplicial closed model category gives rise to a complete Segal space.\n\nIn Sections 9 through 14 we give proofs for the more technical results from earlier sections.\n\n1.6. Acknowledgments. I would like to thank Dan Kan for his encouragement and hospitality, and Bill Dwyer for his beautiful talk at the 1993Čech conference, where I first learned about the homotopy theory of homotopy theory. I would also like to thank Phil Hirschhorn, Mark Johnson, and Brooke Shipley for their helpful comments on the manuscript.\n\n\nSimplicial spaces\n\nIn this section we establish notation for spaces and simplicial spaces, and describe the Reedy model category structure for simplicial spaces.\n\n2.1. Spaces. By space we always mean \"simplicial set\" unless otherwise indicated; the category of spaces is denoted by S. Particular examples of spaces which we shall need are ∆[n], the standard n-simplex,∆[n], the boundary of the standard n-simplex, and Λ k [n], the boundary of the standard n-simplex with the k-th face removed. If X and Y are spaces we write Map S (X, Y ) for the space of maps from X to Y ; the n-simplices of Map S (X, Y ) correspond to maps X × ∆[n] → Y .\n\nWe will sometimes speak of a \"point\" in a space, by which is meant a 0-simplex, or of a \"path\" in a space, by which is meant a 1-simplex.\n\n2.2. The simplicial indexing category. For n ≥ 0 let [n] denote the category consisting of n + 1 objects and a sequence of n composable arrows: {0 → 1 → . . . → n}. Let ∆ denote the full subcategory of the category of categories consisting of the objects [n]. We write ι : [n] → [n] for the identity map in this category.\n\nAs is customary, we let d i : [n] → [n + 1] for i = 0, . . . , n denote the injective functor which omits the ith object, and we let s i : [n] → [n − 1] for i = 0, . . . , n − 1 denote the surjective functor which maps the ith and (i + 1)st objects to the same object. Additionally, we introduce the following notation: let α i : [m] → [n] for i = 0, . . . , n − m denote the functor defined on on objects by α i (k) = k + i.\n\n\nSimplicial spaces.\n\nLet sS denote the category of simplicial spaces. An object in this category is a functor X : ∆ op → S, sending [n] → X n . We write d i : X n → X n−1 , s i : X n → X n+1 and α i : X n → X m for the maps corresponding respectively to the morphisms The category sS is enriched over spaces. We denote the mapping space by Map sS (X, Y ) ∈ S. It is convenient to identify S with the full subcategory of sS consisting of constant simplicial objects (i.e., those K ∈ sS such that K n = K 0 for all n), whence for a space K and simplicial spaces X and Y ,\nMap sS (X × K, Y ) ≈ Map S (K, Map sS (X, Y )).\nIn particular, the n-simplices of Map sS (X, Y ) correspond precisely to the set of maps X × ∆[n] → Y of simplicial spaces.\n\nLet F (k) ∈ sS denote the simplicial space defined by\n[n] → ∆([n], [k]),\nwhere the set ∆([n], [k]) is regarded as a discrete space. The F (k)'s represent the k-th space functor, i.e., Map sS (F (k), X) ≈ X k . We write d i : F (n) → F (n + 1), s i : F (n) → F (n − 1), and α i : F (m) → F (n) for the maps of simplicial spaces corresponding to the maps d i , s i , and α i in ∆.\n\nThe category of simplicial spaces is cartesian closed; for X, Y ∈ sS there is an internal hom-object Y X ∈ sS characterized by the natural isomorphism\nsS(X × Y, Z) ≈ sS(X, Z Y ). In particular, (Y X ) 0 ≈ Map sS (X, Y ), and (Y X ) k ≈ Map sS (X × F (k), Y ). Furthermore, if K ∈ S is regarded as a constant simplicial space, then (X K ) n ≈ Map sS (K, X n ).\nFinally, we note the existence of a diagonal functor diag : sS → S, defined so that the n-simplices of diag X are the n-simplices of X n .\n\n2.4. Reedy model category. In this paper we will consider several distinct closed model category structures on sS. If the model category structure is not named in a discussion, assume that the Reedy model category structure is intended.\n\nThe Reedy model category structure [Ree], [DKS93, 2.4-6] on sS has as its weak equivalences maps which are degree-wise weak equivalences. A fibration (resp. trivial fibration) in sS is a map X → Y such that each k ≥ 0 the induced map\nMap sS (F (k), Y ) → Map sS (F (k), X) × Map sS (Ḟ (k),X) Map(Ḟ (k), Y )\nis a fibration (resp. trivial fibration) of simplicial sets, whereḞ (k) denotes the largest subobject of F (k) which does not contain ι :\n[k] → [k] ∈ ∆([k], [k]\n). It follows that the cofibrations are exactly the inclusions.\n\nWith the above definitions, all objects are cofibrant, and the fibrant objects are precisely those X for which each map ℓ k : Map sS (F (k), X) → Map sS (Ḟ (k), X) is a fibration of spaces. We note here the fact that discrete simplicial spaces (i.e., simplicial spaces X such that each X n is a discrete space) are Reedy fibrant. This Reedy model category structure is cofibrantly generated [DHK]; i.e., there exist sets of generating cofibrations and generating trivial cofibrations which have small domains, and trivial fibrations (resp. fibrations) are characterized as having the right lifting property with respect to the generating cofibrations (resp. generating trivial cofibrations). The generating cofibrations are the mapṡ \nF (k) × ∆[ℓ] Ḟ (k)×∆[ℓ] F (k) ×∆[ℓ] → F (k) × ∆[ℓ], k, ℓ ≥ 0,F (k) × ∆[ℓ] Ḟ (k)×Λ t [ℓ] F (k) × Λ t [ℓ] → F (k) × ∆[ℓ], k ≥ 0, ℓ ≥ t ≥ 0.\n2.5. Compatibility with cartesian closure. Given a model category structure on sS, we say that it is compatible with the cartesian closure if for any cofibrations i : A → B and j : C → D and any fibration k : X → Y , either (and hence both) of the following two equivalent assertions hold:\n\n(1) The induced map A×D∐ A×C B×C → B×D is a cofibration, and additionally is a weak equivalence if either i or j is.\n(2) The induced map Y B → Y A × X A X B\nis a fibration, and additionally is a weak equivalence if either i or k is. (A closed symmetric monoidal category together with a Quillen closed model category structure which satisfies the above properties is sometimes also called a \"Quillen ring\".) Assuming (as will always be the case for us) that a weak equivalence or a fibration X → Y in our model category structure induces a weak equivalence or a fibration X 0 → Y 0 on the degree 0 spaces, then it follows that such a model category structure makes sS into a simplicial model category in the sense of [Qui67], since Map sS (X, Y ) ≈ (Y X ) 0 for any simplicial spaces X and Y .\n\nThe Reedy model category structure on sS is compatible with the cartesian closure; to prove (1) in this case, it suffices to recall that cofibrations are exactly inclusions, and that weak equivalences are degree-wise.\n\n2.6. Proper model categories. A closed model category is said to be proper if 1. the pushout of a weak equivalence along a cofibration is a weak equivalence, and 2. the pullback of a weak equivalence along a fibration is a weak equivalence. The Reedy model category structure is proper, because cofibrations and fibrations are in particular cofibrations and fibrations in each degree, and S is proper.\n\n\nNerve constructions and classification diagrams\n\nIn this section we discuss a construction called the classification diagram, which produces a simplicial space from a pair of categories. A special case of this construction of particular interest is the classifying diagram of a category, which produces a full embedding N : Cat → sS of the category of small categories into the category of simplicial spaces, which has the property that N takes equivalences of categories, and only equivalences of categories, to weak equivalences of simplicial spaces. Another special case of this construction is the application of the classification diagram to model categories, which will be considered in Section 8.\n\nIn what follows we write D C for the category of functors from C to D.\n\n3.1. The nerve of a category. Given a category C, let nerve C denote the nerve of C; that is, nerve C is a simplicial set whose n-simplices consist of the set of functors [n] → C. (The classifying space BC of a category is a topological space which is the geometric realization of the nerve.) The following is well-known. \n\n\nCHARLES REZK\n\nThe functor nerve: Cat → S is a full embedding of categories. Furthermore, if C is a groupoid then nerve(C) is a Kan complex.\n\nAlthough the nerve functor is a full embedding, it is awkward from our point of view, since non-equivalent categories may give rise to weakly equivalent nerves.\n\n3.3. The classification diagram of a pair of categories. Consider a pair (C, W ) consisting of a category C together with a subcategory W such that obW = obC; we refer to a morphism of C as a weak equivalence if it is contained in W . More generally, given a natural transformation α : f → g of functors f, g : D → C, we say that α is a weak equivalence if αd ∈ W for each d ∈ obD, and write we(C D ) for the category consisting of all functors from D to C and all weak equivalences between them; thus we(C) = W .\n\nFor any such pair (C, W ) of categories we define a simplicial space N (C, W ), called the classification diagram of (C, W ), by setting\nN (C, W ) m = nerve we(C [m] ).\nIf we view the category [m] × [n] as an m-by-n grid of objects with rows of m composable horizontal arrows and columns of n composable vertical arrows, then the set of n-simplices of the mth space of N (C, W ) corresponds to the set of functors\n[m] × [n] → C in which the vertical arrows are sent into W ⊂ C.\nWe consider several special cases of this construction.\n\n3.4. Discrete nerve construction. A special case of the classification diagram is the discrete nerve. Let C 0 ⊂ C denote the subcategory of C consisting of all its objects and only identity maps between them, and let discnerve C = N (C, C 0 ). Note that nerve C = diag(discnerve C), and that discnerve([n]) = F (n). It is not hard to see that the functor discnerve: Cat → sS embeds the category of small categories as a full subcategory of simplicial spaces. The discrete nerve functor is awkward from our point of view, since equivalent categories can have non-weakly equivalent discrete nerves.\n\n3.5. The classifying diagram of a category. We give a construction which embeds the category of categories inside the category of simplicial spaces and which carries equivalences of categories (and only equivalences) to weak equivalences of simplicial spaces.\n\nGiven a category C, define a simplicial space\nN C = N (C, iso C), where iso C ⊂ C denotes the maximal subgroupoid. Thus, the mth space of N C is (N C) m = nerve iso(C [m] ). We call N C the classifying diagram of C.\nLet I[n] denote the category having n + 1 distinct objects, and such that there exists a unique isomorphism between any two objects. We suppose further that there is a chosen inclusion [n] → I[n]. Then the set of n-simplices of the mth space of N C corresponds to the set of functors [m] × I[n] → C. Note that there is a natural isomorphism\n(N C) m ≈ (N C) 1 × (N C)0 · · · × (N C)0 (N C) 1 (3.6)\n(where the right-hand side is an m-fold fiber-product), and that the natural map (d 1 , d 0 ) : (N C) 1 → (N C) 0 × (N C) 0 is a simplicial covering space, with fiber over any vertex (x, y) ∈ (N C) 2 0 naturally isomorphic to the set hom C (x, y). If the category C is a groupoid, then the natural map nerve C → N C, where nerve C is viewed as a constant simplicial space, is a weak equivalence; this follows from the fact that for C a groupoid, iso(C [m] ), C [m] , and C, are equivalent categories. It is therefore natural to regard the classifying diagram construction as a generalization of the notion of a classifying space of a groupoid.\n\nThe following theorem says that N : Cat → sS is a full embedding of categories which preserves internal hom-objects, and furthermore takes a functor to a weak equivalence if and only if it is an equivalence of categories.\n\nTheorem 3.7. Let C and D be categories. There are natural isomorphisms Proof. That N preserves products is clear.\nN (C × D) ≈ N C × N D and N (D C ) ≈ (N D) N C ofTo show that N (D C ) → (N D) N C\nis an isomorphism, we must show that for each m, n ≥ 0 this map induces a one-to-one correspondence between functors [m] × I[n] → D C and maps F (m) × ∆[n] → (N D) N C . By (3.8) it will suffice to show this for the case m = n = 0; that is, to show that functors C → D are in oneto-one correspondence with maps N C → N D, or in other words, that N : Cat → sS is a full embedding of categories.\n\nTo see that N is a full embedding, note that any map N C → N D is determined by how it acts on the 0th and 1st spaces of N C. The result follows from a straightforward argument using (3.2) and the fact that\n(d 1 , d 0 ) is a simplicial covering map such that d 1 s 0 = 1 = d 0 s 0 for both N C and N D.\nIt is immediate that naturally isomorphic functors induce simplicially homotopic maps of simplicial spaces since N (C I[1] ) ≈ (N C) ∆[1] by (3.8), and thus an equivalence of categories induces a weak equivalence of simplicial spaces. To prove the converse, note that (3.9) will show that (N D) N C ≈ N (D C ) is Reedy fibrant, and in particular Map S (N C, N D) ≈ (N D N C ) 0 is a Kan complex. Therefore, if N f : N C → N D is a weak equivalence of simplicial spaces it must be a simplicial homotopy equivalence. Furthermore, the homotopy inverse is a 0-simplex of N (C D ) 0 and the simplicial homotopies are 1-simplices of N (D C ) 0 and N (C D ) 0 ; by what we have already shown these correspond precisely to a functor g : D → C and natural isomorphisms f g ∼ 1 D and gf ∼ 1 C , as desired.\n\nLemma 3.8. Let C be a category. Then there are natural isomorphisms\nN ([m] × C) ≈ F (m) × N C and N (C I[n] ) ≈ (N C) ∆[n]\nof simplicial spaces.\n\nProof. The first isomorphism follows from the fact that N preserves products and that N ([m]) ≈ F (m). The second isomorphism may be derived from the fact that\niso(D I[n] ) ≈ (iso D) I[n] ≈ (iso D) [n]\nfor any category D, and thus in particular when\nD = C [m] .\nLemma 3.9. If C is a category, then N C is a Reedy fibrant simplicial space.\n\nProof. We must show that\nℓ n : (N C) n ≈ Map sS (F (n), N C) → Map sS (Ḟ (n), N C)\nis a fibration for each n ≥ 0. We have the following cases:\nn = 0: (N C) 0 = nerve(iso C) is a Kan complex by (3.2). n = 1: ℓ 1 : (N C) 1 → (N C) 0 × (N C) 0\nis a simplicial covering space with discrete fiber, and thus is a fibration. n = 2: ℓ 2 is isomorphic to an inclusion of path-components, and so is a fibration. n ≥ 3: ℓ n is an isomorphism, and thus a fibration.\n\n3.10. Classification diagrams of functor categories. The following generalizes one of the statements of (3.7), and we note it for future reference.\n\nProposition 3.11. Let C and D be categories, and W ⊂ D a subcategory such that iso D ⊂ W . Then there are natural isomorphisms\nN (D C , we(D C )) ≈ N (D, W ) N C ≈ N (D, W ) discnerve C .\nProof. We must show that for each m, n ≥ 0 the natural maps N (\nD C , we(D C )) → N (D, W ) N C → N (D, W ) discnerve C induce one-to-one correspondences amongst the sets of 1. functors [m] × [n] → D C which carry \"vertical\" maps into we(D C ), 2. maps F (m) × ∆[n] → N (D, W ) N C of simplicial spaces, and 3. maps F (m) × ∆[n] → N (D, W ) discnerve C of simplicial spaces.\nBy (3.8) and (3.12) it will suffice to show this in the case m = n = 0, in which case the result becomes a straightforward computation.\n\nLemma 3.12. Let C a category, and W a subcategory with obW = obC. Then there is a natural isomorphism\nN ( C [n] , we( C [n] )) ≈ (N C) ∆[n] ,\nwhere C [n] ⊂ C [n] denotes the full subcategory whose objects are those functors [n] → C which factor through W ⊂ C, and we(\nC [n] ) = we(C [n] ) ∩ C [n] .\nProof. For any pair (D, W ) of category D and subcategory W , we have that we( D [n] ) = W [n] , and that nerve(\nW [n] ) = (nerve W ) ∆[n]\n. We obtain the result by substituting C [m] for D.\n\n\nSegal spaces\n\nIn this section we define the notion of a Segal space. This is a modification of the notion of a ∆-space as defined by Graeme Segal; a ∆-space is a simplicial space X such that X n is weakly equivalent (via a natural map) to the n-fold product (X 1 ) n . It was proposed as a model for loop spaces, and is closely related to Segal's Γ-space model for infinite loop spaces, as in [Seg74]. (To my knowledge, Segal never published anything about ∆-spaces. The first reference in the literature appears to be by Anderson [And71]. The fact that ∆-spaces model loop spaces was proved by Thomason [Tho79].)\n\nOur definition of a \"Segal space\" introduces two minor modifications to that of a ∆-space: we allow the 0th space of the simplicial space to be other than a point, and we add a fibrancy condition.\n4.1. Definition of a Segal space. Let G(k) ⊆ F (k) denote the smallest subobject having G(k) 0 = F (k) 0 and such that G(k) 1 contains the elements α i ∈ F (k) 1 = ∆([1], [k]) defined in (2.2).\nIn other words,\nG(k) = k−1 i=0 α i F (1) ⊂ F (k), where α i F (1) denotes the image of the inclusion map α i : F (1) → F (k). Let ϕ k : G(k) → F (k) denote the inclusion map. It is straight-forward to check that Map sS (G(k), X) ≈ X 1 × X0 · · · × X0 X 1 ,\nwhere the right-hand side denotes the limit of a diagram\nX 1 d0 −→ X 0 d1 ← − − X 1 d0 −→ X 0 d1 ← − − · · · d0 −→ X 0 d1 ← − − X 1 (4.2) with k copies of X 1 .\nWe define a Segal space to be a simplicial space W which is Reedy fibrant, and such that the map\nϕ k = Map sS (ϕ k , W ) : Map sS (F (k), W ) → Map sS (G(k), W )\nis a weak equivalence. In plain language, this means that W is a Reedy fibrant simplicial space such that the maps\nϕ k : W k → W 1 × W0 · · · × W0 W 1 (4.3)\nare weak equivalences for k ≥ 2. Because the maps ϕ k are inclusions and W is Reedy fibrant, the maps ϕ k acting on a Segal space are trivial fibrations. Note also that the maps d 0 , d 1 : W 1 → W 0 are fibrations as well, so that the fiber-product of (4.2) is in fact a homotopy fiber-product.\n\n\nExamples.\n\nRecall that every discrete simplicial space is Reedy fibrant. A discrete simplicial space W is a Segal space if and only if the maps in (4.3) are isomorphisms. Thus, W is a discrete Segal space if and only if it is isomorphic to the discrete nerve of some small category. In particular, the objects F (k) are Segal spaces.\n\nIf C is a category, then its classifying diagram N C (as defined in (3.5)) is a Segal space, by (3.6) and (3.9).\n\n\nHomotopy theory in a Segal space\n\nIn this section we describe how to obtain certain invariants of a Segal space, including its set of objects, the mapping spaces between such objects, homotopy equivalences between such objects, and the homotopy category of the Segal space. 5.1. \"Objects\" and \"mapping spaces\". Fix a Segal space W . We define the set of objects of a Segal space W to be the set of 0-simplices of W 0 , and we denote the set of objects by obW .\n\nGiven two objects x, y ∈ obW we define the mapping space map W (x, y) between them to be the fiber of the morphism (d 1 , d 0 ) :\nW 1 → W 0 × W 0 over the point (x, y) ∈ W 0 ×W 0 . Note that since W is Reedy fibrant the map (d 1 , d 0 )\nis a fibration, and thus the homotopy type of map W (x, y) depends only on the equivalence classes of x and y in π 0 W 0 . We will sometimes write map(x, y) when W is clear from the context.\n\nGiven a vertex x ∈ W 0 we have that d 0 s 0 x = d 1 s 0 x = x. Thus for each object x ∈ obW the point s 0 x ∈ W 1 defines a point in map W (x, x), called the identity map of x, and denoted id x . Given (n + 1) objects x 0 , . . . , x n in obW we write map W (x 0 , x 1 , . . . , x n ) for the fiber of the map (α 0 , . . . , α n ) :\nW n → W 0 n+1 over (x 0 , . . . , x n ) ∈ W 0 n+1 . The commutative triangle Map sS (F (n), W ) ∼ ϕ k G G 9 9 O O O O O O O O O O O Map sS (G(n), W ) w w o o o o o o o o o o o W 0 n+1 induces trivial fibrations ϕ k : map(x 0 , x 1 , . . . , x n ) ∼ − → map(x n−1 , x n ) × · · · × map(x 0 , x 1 )\nbetween the fibers of the slanted maps over (x 0 , . . . , x n ).\n\nRemark 5.2. As an example, if C is a category and either W = discnerve C or W = N C, then obW ≈ obC and map W (x, y) ≈ hom C (x, y). 5.3. \"Homotopies\" and \"compositions\" of \"maps\". Let W be a Segal space, and suppose x, y ∈ obW . Given points f, g ∈ map(x, y), we say that f and g are homotopic if they lie in the same component of map(x, y). We write f ∼ g if f and g are homotopic.\n\nA Segal space is not a category, so we cannot compose maps in the usual way. Nonetheless, given f ∈ map(x, y) and g ∈ map(y, z), we define a composition to be a lift of (g, f ) ∈ map(y, z) × map(x, y) along ϕ 2 to a point k ∈ map(x, y, z). The result of the composition k is the point d 1 (k) ∈ map(x, z). Since ϕ 2 is a trivial fibration the results of any two compositions of f and g are homotopic. Sometimes we write g • f ∈ map(x, z) to represent the result of some composition of f and g.\n\nProposition 5.4. Given points f ∈ map(w, x), g ∈ map(x, y), and h ∈ map(y, x),\nwe have that (h • g) • f ∼ h • (g • f ) and that f • id w ∼ f ∼ id x •f .\nProof. We prove the proposition by producing particular choices of compositions which give equal (not just homotopic) results.\n\nTo\nconstruct h • (g • f ) consider the diagram map(w, x, y, z) ∼ d0d0×d3 d1 G G map(w, y, z) ∼ ϕ2 d1 G G map(w, z) map(y, z) × map(w, x, y) ∼ 1×ϕ2 1×d1 G G map(y, z) × map(w, y) map(y, z) × map(x, y) × map(w, x)\nNote that the composite of the vertical maps in the left-hand column is ϕ 3 . Any choice of k ∈ map(w, x, y, z) such that ϕ 3 (k) = (h, g, f ) determines compositions d 3 k ∈ map(w, x, y) and d 1 k ∈ map(w, y, z) with results g • f and h • (g • f ) respectively. By considering an analogous diagram we see that such a k also determines compositions d 0 k ∈ map(x, y, z) and d 2 k ∈ map(w, x, z) with results h • g and (h • g) • f respectively, and that for this choice of compositions there is an equality\nh • (g • f ) = (h • g) • f of results, as desired. To show that f • id w ∼ f for f ∈ map(w, x), let k = s 0 (f ) ∈ map(w, w, x). Then ϕ 2 (k) = (f, id w ) and d 1 (k) = f , showing that f • id w = f . The proof that id z •f ∼ f is similar.\n5.5. Homotopy category and homotopy equivalences. In view of (5.4) we define the homotopy category of a Segal space W , denoted by Ho W , to be the category having as objects obW , and having as maps hom Ho W (x, y) = π 0 map W (x, y). For any f ∈ map W (x, y) we can write [f ] ∈ hom Ho W (x, y) for its associated equivalence class.\n\nRemark 5.6. Recall (3.5) in which we defined an embedding N : Cat → sS via the classifying diagram construction (which by (4.4) in fact lands in the subcategory of Segal spaces). By (5.2) we see that Ho N C ≈ C. It is possible to show that the functor N admits a left adjoint L : sS → Cat, and that L(W ) ≈ Ho W whenever W is a Segal space.\nA homotopy equivalence g ∈ map(x, y) is a point for which [g] admits an inverse on each side in Ho W . That is, there exist points f, h ∈ map(y, x) such that g • f ∼ id y and h • g ∼ id x . Note that this implies by (5.4) that h ∼ h • g • f ∼ f . Furthermore, for each x ∈ obW the map id x ∈ map(x, x) is a homotopy equivalence by (5.4).\nWe give another characterization of homotopy equivalences in a Segal space. Let\nZ(3) = discnerve(0 → 2 ← 1 → 3) ⊂ F (3) be the discrete nerve of a \"zig-zag\" cate- gory; it follows that there is a fibration W 3 = Map sS (F (3), W ) → Map sS (Z(3), W ), and an isomorphism Map sS (Z(3), W ) ≈ lim(W 1 d1 −→ W 0 d1 ← − − W 1 d0 −→ W 0 d0 ← − − W 1 ) ≈ W 1 × W0 W 1 × W0 W 1 .\n(We can thus write simplices of Map sS (Z(3), W ) as certain ordered triples of simplices of W 1 .) Then a point g ∈ map(x, y) ⊂ W 1 is a homotopy equivalence if and only if the element (id x , g, id y ) ∈ Map sS (Z(3), W ) admits a lift to an element H ∈ W 3 ; note that if g ∈ map(x, y) then s 0 d 1 g = id x and s 0 d 0 g = id y . 5.7. The space of homotopy equivalences. Clearly, any point in map(x, y) which is homotopic to a homotopy equivalence is itself a homotopy equivalence. More generally, we have the following.\n\nLemma 5.8. If g ∈ W 1 is a vertex which can be connected by a path in W 1 to a homotopy equivalence g ′ ∈ W 1 , then g is itself a homotopy equivalence.\n\nProof. Let G : ∆[1] → W 1 denote the path connecting g and g ′ . Then it suffices to note that a dotted arrow exists in\n∆[0] H G G W 3 ∆[1] (s0d1G,G,s0d0G) G G R R Map sS (Z(3), W )\nwhere H is a lift of (s 0 d 1 g ′ , g ′ , s 0 d 0 g ′ ) = (id x ′ , g ′ , id y ′ ) to W 3 , since the right-hand vertical map is a fibration.\n\nThus, we define the space of homotopy equivalences of W to be the subspace W hoequiv ⊆ W 1 consisting of exactly those components whose points are homotopy equivalences. Note that the map s 0 : W 0 → W 1 necessarily factors through W hoequiv , since s 0 x = id x is a homotopy equivalence for any vertex x ∈ W 0 .\n\n\nComplete Segal spaces\n\nA complete Segal space is defined to be a Segal space W for which the map s 0 : W 0 → W hoequiv is a weak equivalence, where W hoequiv is the space of homotopy equivalences defined in (5.7).\n\nProposition 6.1. If C is a small category, then the classifying diagram N C of (3.5) is a complete Segal space.\n\nProof. This follows from (3.6) and (3.9), together with the fact that (N C) hoequiv is isomorphic to nerve iso(C I[1] ) and the fact that the natural inclusion iso C → iso(C I[1] ) is an equivalence of categories.\n\nNote that the discrete nerve of C is not in general a complete Segal space. Let E denote the Segal space which is the discrete nerve of the category I[1] which consists of exactly two objects x and y, and two non-identity maps x → y and y → x which are inverses of each other.\n\nThere is an inclusion i : F (1) → E associated to the arrow x → y, inducing a map Map sS (E, W ) → Map sS (F (1), W ) ≈ W 1 . The following is crucial.\n\nTheorem 6.2. If W is a Segal space, then Map sS (E, W ) → W 1 factors through W hoequiv ⊆ W 1 , and induces a weak equivalence Map sS (E, W ) → W hoequiv .\n\nThe proof of (6.2) is technical, and we defer it to Section 11. Suppose that W is a Segal space, and let x, y ∈ W 0 be objects, and consider the diagram\nW 0 ∆ Ð Ð hoequiv(x, y) G G W hoequiv (d1,d0) {(x, y)} G G W 0 × W 0 (6.3)\nHere hoequiv(x, y) ⊆ map(x, y) denotes the subspace of map(x, y) consisting of those components which contain homotopy equivalences. This square is a pullback square, and also is a homotopy pullback since (d 1 , d 0 ) is a fibration. We have the following result.\n\nProposition 6.4. Let W be a Segal space. The following are equivalent.\n\n(1) W is a complete Segal space.\n\n(\n2) The map W 0 → Map sS (E, W ) induced by E → F (0) is a weak equivalence.\n(3) Either of the maps Map sS (E, W ) → W 0 induced by a map F (0) → E is a weak equivalence. (4) For each pair x, y ∈ obW , the space hoequiv(x, y) is naturally weakly equivalent to the space of paths in W 0 from x to y.\n\n\nProof.\n\n(1) ⇒ (2): This follows from (6.2).\n\n(2) ⇔ (3): Straightforward.\n\n(2) ⇒ (4): Part (2) and (6.2) imply that W 0 → W hoequiv is a weak equivalence, whence the result follows from the fact that the space of paths in W 0 with endpoints x and y is equivalent to the homotopy fiber of the map ∆ in (6.3). (4) ⇒ (1): Immediate from the diagram (6.3).\n\nCorollary 6.5. Let obW/∼ denote the set of homotopy equivalence classes of objects in Ho W . If W is a complete Segal space, then π 0 W 0 ≈ obW/∼.\n\nProof. This is immediate from (6.4, (4)). We will prove (7.1) in Section 10. We will prove (7.2) in Section 12. These theorems have the following important corollary.\n\nCorollary 7.3. If W is a complete Segal space (resp. a Segal space) and X is any simplicial space, then W X is a complete Segal space (resp. a Segal space).\n\nProof. This is a direct consequence of the compatibility of these model category structures with the cartesian closure, since any object is cofibrant in either of these model category structures. \n(x, x ′ ) → map V (f x, f x ′ )\nis a weak equivalence. For a Segal space W let obW/∼ denote the set of objects of W modulo the equivalence relation of homotopy equivalence (or equivalently, the set of isomorphism classes in Ho W ). If we define a condition 1' by 1'. the induced map obU/∼ → obV /∼ on equivalence classes of objects is a bijection, then it is not hard to see that conditions 1' and 2 together are equivalent to conditions 1 and 2. Proof. It is clear that a Reedy weak equivalence between any two Segal spaces is a Dwyer-Kan equivalence.\n\nConversely, suppose f : U → V is a Dwyer-Kan equivalence between complete Segal spaces. Then π 0 U 0 ≈ obU/∼ and π 0 V 0 ≈ obV /∼ by (6.5), so that π 0 U 0 → π 0 V 0 is a bijection. In the commutative diagram\nU 0 s0 G G U 1 (d1,d0) G G U 0 × U 0 V 0 s0 G G V 1 (d1,d0) G G V 0 × V 0\nthe right-hand square is a homotopy pullback (since the induced maps of fibers are of the form map U (x, y) → map V (f x, f y), which is assumed to be a weak equivalence), and the large rectangle is a homotopy pullback (since by (6.4) the induced maps of fibers are of the form hoequiv U (x, y) → hoequiv V (f x, f y), which is also a weak equivalence). We conclude that U 0 → V 0 is a weak equivalence, and therefore that U 1 → V 1 is a weak equivalence. Since both U and V are Segal spaces, it follows that the map f : U → V is a Reedy weak equivalence as desired. We will prove (7.7) in Section 14.\n\nRemark 7.8. Note that if C is a category, then the natural inclusion discnerve(C) → N (C) of simplicial spaces is a Dwyer-Kan equivalence; thus by (7.7) this map is a weak equivalence in the complete Segal space model category structure.\n\nCorollary 7.9. The homotopy category of complete Segal spaces may be obtained by formally inverting the Dwyer-Kan equivalences in the homotopy category of Segal spaces.\n\n\nComplete Segal spaces from model categories\n\nIn this section we show that complete Segal spaces arise naturally from closed model categories.\n\nRecall from Section 3 that given a category C and a subcategory W we can construct a simplicial space N (C, W ). If the category C = M is a closed model category with weak equivalences W, we will usually write N (M) for N (M, W), assuming that W is clear from the context. (This notation potentially conflicts with that of (3.5), but note (8.5) below.) Let N f (M) denote a functorial Reedy fibrant replacement of N (M).\n\nGiven such a pair (C, W ) we can always construct a complete Segal space by taking the fibrant replacement of N (C, W ) in the complete Segal space model category structure. Because this fibrant replacement is a localization functor, it seems to be difficult to compute anything about it. Our purpose in this section is to show that if we start with an appropriate closed model category M, then we obtain a complete Segal space by taking a Reedy fibrant replacement of N (M), which is easy to understand since Reedy fibrant replacement does not change the homotopy type of the spaces which make up N (M). 8.1. Universes. Because the usual examples of closed model categories are not small categories, their classification diagrams are not bisimplicial sets. We may elude this difficulty by positing, after Grothendieck, the existence of a universe U (a model for set theory) in which M is defined. Then N (M, W) is an honest simplicial space (though not modeled in the universe U , but rather in some higher universe U ′ ).\n\nAlternately, we note that there is no difficulty if the model category M is a small category, and that such exist in practise. As an example, choose an uncountable cardinal γ, and let S γ denote a skeleton of the category of all simplicial sets which have fewer than γ simplices. Then S γ is a small category, and is in fact a simplicial closed model category. (Of course, the category S γ is not suitable for all purposes; for example, it is not cartesian closed.) 8.2. The classification space of a closed model category. If M is a simplicial model category, and X and Y objects in M, we write map M (X, Y ) for the function complex from X to Y . We prove (8.3) below.\n\nRemark 8.4. This result (8.3) presumably generalizes to an arbitrary closed model category, not necessarily simplicial; the function complex map V (X, Y ) would be taken to be one of those described by Dwyer and Kan in [DK80].\n\nRemark 8.5. Note that any category C having finite limits and colimits can be made into a closed model category in which the weak equivalences are precisely the isomorphisms (and all maps are fibrations and cofibrations). In this case N (C) = N (C, iso C) coincides with the classifying diagram construction described in (3.5), and we have noted (6.1) that this is already a complete Segal space.  . Given a simplicial closed model category M, and an object X ∈ M which is both fibrant and cofibrant, let haut X ⊂ map M (X, X) be its simplicial monoid of weak equivalences. Then the classifying complexW haut X is weakly equivalent to sc X; in fact,W haut X and sc X can be connected by a finite string of weak equivalences which is natural with respect to simplicial functors f : M → N between closed model categories which preserve weak equivalences and are such that f X ∈ N is both fibrant and cofibrant.\n\nRemark 8.8. We can interpret (8.7) as saying that for any two fibrant-and-cofibrant objects X, Y ∈ M, the space of paths from X to Y in class(M) is naturally weakly equivalent to the space hoequiv M (X, Y ) ⊂ map M (X, Y ) of homotopy equivalences from X to Y . \nM [n] Y →W haut M [n−1] Y ′ ×W haut M Y (n)\nis weakly equivalent the union of those components of map M (Y (n − 1), Y (n)) containing conjugates of the given map Y n−1 : Y (n − 1) → Y (n); by conjugate we mean maps of the form j • Y n−1 • i where i and j are self-homotopy equivalences of Y (n − 1) and Y (n) respectively. HereW denotes the classifying complex as in [May67,p. 87]. Applying this fibration iteratively shows that the homotopy fiber of the mapW\nhaut M [n] Y →W haut M Y (0) × · · · ×W haut M Y (n)\nis naturally weakly equivalent to the union of those components of\nmap M (Y (0), Y (1)) × · · · × map M (Y (n − 1), Y (n))\ncontaining \"conjugates\" of the given sequence of maps Y i : Y (i) → Y (i + 1).\n\nProof of (8.3). Let U = N (M), so that U n = nerve we(M [n] ) and U n → V n is a weak equivalence of spaces. For each n ≥ 0 there is a map π n : U n → U n+1 0 which \"remembers\" only objects. The remarks above together with (8.7) show that for each (n + 1)-tuple of objects (X 0 , . . . , X n ) in M the homotopy fiber of π n over the point corresponding to (X 0 , . . . , X n ) is in a natural way weakly equivalent to a product\nmap M (X ′ n−1 , X ′ n ) × · · · × map M (X ′ 0 , X ′ 1 ), where X ′\ni is a fibrant-and-cofibrant object of M which is weakly equivalent to X i . Note that it is an immediate consequence of the above that V is a Segal space. Since π 0 U 0 is just the set of weak homotopy types in M, and since Ho M(X, Y ) ≈ π 0 map M (X ′ , Y ′ ) where X ′ and Y ′ are fibrant-and-cofibrant replacements of X and Y respectively, we see that Ho M ≈ Ho V .\n\nLet U hoequiv ⊂ U 1 denote the subspace of U 1 which corresponds to the subspace V hoequiv ⊂ V 1 . By the equivalence of homotopy categories above, we see that U hoequiv consists of precisely the components of U 1 whose points go to isomorphisms in Ho M. Since M is a closed model category, this means that the 0-simplices of U hoequiv are precisely the objects of M [1] which are weak equivalences, so U hoequiv = nerve we((we M) [1] ). There is an adjoint functor pair F : M [1] ⇆ M : G in which the right adjoint takes G(X) = id X , and the left adjoint takes F (X → Y ) = X; this pair restricts to an adjoint pair we((we M) [1] ) ⇆ we M and thus induces a weak equivalence U hoequiv ≈ U 0 of the nerves. Thus V is a complete Segal space. 8.9. Categories of diagrams. Let M be a closed model category, and let I denote a small indexing category; recall that the weak equivalences in the category M I of functors are the object-wise weak equivalences. Consider\nf : N (M I ) ≈ N (M) discnerve I → N f (M) discnerve I , (8.10)\nwhere the isomorphism on the left-hand side is that described in (3.11), and the map on the right-hand side is that induced by the Reedy fibrant replacement of N (M). If f can be shown to be a weak equivalence, then this means we can compute the homotopy type of the classification diagram associated to I-diagrams in M knowing only the homotopy type of the classification diagram of M itself.\n\nIn particular, knowing N (M) determines the homotopy category Ho(M I ) of the category of I-diagrams in M for every small category I.\n\nA result of Dwyer and Kan shows that this holds at least for certain cases of M.\n\nTheorem 8.11. The map f of (8.10) is a Reedy weak equivalence when M = S J , where S denotes the category of simplicial sets and J is a small indexing category.\n\nTaken together with (3.11) we obtain the following corollary. We prove (8.11) below.\n\nRemark 8.13. It seems that the theorem of Dwyer and Kan, and hence the statements of (8.11) and (8.12) should hold for any \"reasonable\" model category M, where the class of \"reasonable\" closed model categories includes at least the \"cofibrantly generated\" simplicial closed model categories. We hope that future work will provide a generalization of these theorems to arbitrary closed model categories. \nclass(S I ) ≈ lim ([k]→I)∈∆ op I class(S [k] ) → holim ([k]→I)∈∆ op I class(S [k] ) f\nis a weak equivalence, where X f denotes the fibrant replacement of a space X, and holim is the homotopy inverse limit construction of [BK72].\n\nProof. That this map is a weak equivalence from each component of class(S I ) to the corresponding component of the homotopy limit follows from [DK84a, 3.4(iii)]. That the map is surjective on path components is a consequence of Proposition 3.4 and Theorem 3.7 of [DK84b].\n\nTo derive (8.11) from (8.14) we use the following lemma.\n\nLemma 8.15. Let I be a small category and let W be a Reedy fibrant simplicial space. Then the natural map\nMap sS (discnerve I, W ) ≈ lim ([k]→I)∈∆ op I W k → holim ([k]→I)∈∆ op I W k is a weak equivalence.\nProof. Let A be an object in s(sS) (i.e., a simplicial object in sS) defined by\nA(m) = [k0]→...→[km]∈I F (k 0 ) ∈ sS.\nThere is an augmentation map A(0) → discnerve I, and the induced map diag ′ A → discnerve I is a Reedy weak equivalence in sS, where diag ′ : s(sS) → sS denotes the prolongation of the diagonal functor, in this case defined by (diag ′ A) n ≈ diag ( Proof of (8.11). Using (8.15) we can reinterpret (8.14) as stating that there is a weak equivalence\nclass(S I ) ∼ − → Map sS (discnerve I, N f (S)).\nSubstituting [m] × I for I in the above for all m ≥ 0 leads to a Reedy weak equivalence\nN (S I ) ∼ − → N f (S) discnerve I ,\nwhich is the special case of (8.10) with M = S. To obtain the case of M = S J , note that by what we have just shown the maps in\nN (S I×J ) ∼ − → N f (S) discnerve(I×J) ≈ N f (S) discnerve I×discnerve J ∼ ←− N f (S J ) discnerve I\nmust be Reedy weak equivalences.\n\n\nLocalization model category\n\nIn this section we state the properties of localization model category structures which we will need in order to prove (7.1) and (7.2).\n\nGiven an inclusion f : A → B ∈ sS, we can construct a localization model category structure on sS. More precisely, is a weak equivalence, and (4) a Reedy weak equivalence between two objects is an f -local weak equivalence, and if both objects are f -local then the converse holds.\n\nProof. The proposition is just a statement of the theory of localization with respect to a given map f , applied to the category of simplicial spaces. Although localization is now considered a standard technique, it seems that no treatment at the level of generality which we require has yet appeared in print. Goerss and Jardine [GJ, Ch. 9, Thm. 2.3] give a complete proof for localization of simplicial sets with respect to a map; the generalization to simplicial spaces is relatively straightforward. A complete proof is given by Hirschhorn [Hir]. We give a brief sketch of the proof here. Since the desired classes of cofibrations and f -local weak equivalences have been characterized, the class of f -local fibrations must be determined by these choices. To construct the localization model category structure, we must find a cofibration j : A → B which is also an f -local weak equivalence with the property that a map is an f -local fibration if and only if it has the right lifting property with respect to j. The proof of the model category structure follows using the \"small object argument\" to prove the factorization axiom. (That such a small object argument works here makes use of the fact that simplicial spaces is a left proper model category.) It is still necessary to choose a j. Given an uncountable cardinal γ, take j = α i α , where i α : A α → B α ranges over isomorphism classes of maps which are cofibrations, f -local weak equivalences, and such that B α has fewer than γ simplices in each degree. That a sufficiently large γ produces a map j with the desired properties follows from the \"Bousfield-Smith cardinality argument\". Such a localization model category structure need not be compatible (in the sense of (2.5)) with the cartesian closure of sS. However, there is a simple criterion for this to happen.\n\nProposition 9.2. Suppose that for each f -local object W , the simplicial space W F (1) is also f -local. Then the f -local model category structure on sS is compatible with the cartesian closure.\n\nProof. The proof proceeds in several stages. Suppose that W is an f -local object. Then it follows by hypothesis that W (F (1)) k is f -local for all k, where (F (1)) k denotes the k-fold product. Next one observes by elementary computation that F (k) is a retract of (F (1)) k ; thus it follows that W F (k) is a retract of W (F (1)) k and hence is also f -local.\n\nSince the f -local model category is a simplicial model category, we see that for any K ∈ S we have that (W F (n) ) K = W F (n)×K is f -local (recall that we regard K as a constant simplicial space). Since any simplicial space X is a homotopy colimit (in the Reedy model category structure) of a diagram of simplicial spaces of the form F (k) × K where K is a space, it follows that W X is a homotopy limit (again in the Reedy model category structure, assuming W is Reedy fibrant) of a diagram of simplicial spaces of the form W F (k)×K . Since a homotopy limit of f -local objects is f -local, we see that W X is f -local for arbitrary X. Now, to show that the f -local model category is compatible with the enrichment, it suffices to show that for a cofibration i : X → Y and an f -local trivial cofibration j : U → V , the induced map\nU × Y U×X V × X → V × Y\nis an f -local equivalence. Equivalently, we must show that for every f -local object W the square\nMap sS (V × Y, W ) G G Map sS (V × X, W ) Map sS (U × Y, W ) G G Map sS (U × X, W )\nis a homotopy pull-back of spaces. But this diagram is isomorphic to\nMap sS (V, W Y ) G G Map sS (V, W X ) Map sS (U, W Y ) G G Map sS (U, W X )\nand since W X and W Y are f -local, the columns are weak equivalences, whence the square is in fact a homotopy pull-back.\n\n\nSegal space model category structure\n\nIn this section we prove (7.1). The Segal space closed model category structure on sS is defined using (9.1) to be the localization of simplicial spaces with respect to the map ϕ = i≥0 ϕ i , where ϕ n : G(n) → F (n) is the map defined in (4.1). Parts (1)-(4) of (7.1) follow immediately from (9.1). The only thing left to prove is the compatibility of this model category structure with the cartesian closure.\n\nTo prove this, we need the notion of a cover of F (n). Let α i : [k] → [n] for i = 0, . . . , n−k denote the maps defined by α i (j) = i+j; we also write α i : F (k) → F (n) for the corresponding map of simplicial spaces. We say that a subobject G ⊆ F (n) is a cover of F (n) if 1. G and F (n) have the same 0-space, i.e., G 0 = F (n) 0 , and 2. G has the form\nG = λ α i λ F (k λ )\nwhere k λ ≥ 1 and i λ = 0, . . . , k λ − 1.\n\nIn particular, F (n) covers itself, and G(n) ⊂ F (n) is the smallest cover of F (n). Proof. In this proof, weak equivalence will mean weak equivalence in the Segal space model category structure. The composite map ji is a weak equivalence by construction, so it suffices to show that i is also a weak equivalence. Given any α i1 F (k 1 ), α i2 F (k 2 ) ⊂ F (n), we see that the intersection α i1 F (k 1 ) ∩ α i2 F (k 2 ) is either empty, or is equal to α i3 F (k 3 ) for some i 3 and k 3 . Thus G can be written as a colimit over a partially ordered set of subcomplexes of the form α i F (k). Since G(n) ∩ α i F (k) = α i G(k), we see that G(n) is obtained as a colimit over the same indexing category of subobjects of the form α i G(k). Since by hypothesis the map Map sS (α i F (k), W ) → Map sS (α i G(k), W ) is a weak equivalence for any Segal space W , we conclude that Map sS (G, W ) → Map sS (G(n), W ) is also a weak equivalence for any Segal space W , and hence i is a weak equivalence in the Segal space model category, as desired.\n\nRemark 10.2. The class of subobjects which are weakly equivalent to F (n) is not exhausted by the coverings. For example, one can show that for 0 < i < n the subobjectḞ (n) \\ d i F (n − 1) (the \"boundary\" of F (n) with a \"face\" removed which is neither the first nor the last face) is weakly equivalent to F (n) in the Segal space model category structure, but is not a cover.\n\nTo finish the proof of (7.1), we note that by (9.2) it suffices to show that for a Segal space W , the simplicial space W F (1) is also a Segal space; i.e., that the induced maps ϕ k : (W F (1) ) k ≈ Map sS (F (k), W F (1) ) → Map sS (G(k), W F (1) ) are weak equivalences. This follows immediately from (10.3) below.  \nγ i (j) = (0, j) if j ≤ i, (1, j − 1) if j > i. Likewise, let δ i : [n] → [1] × [n] denote the map defined by δ i (j) = (0, j) if j ≤ i, (1, j) if j > i.\nThen one can write F (1) × F (n) as a colimit of the diagram\nγ 0 F (n + 1) ← δ 0 F (n) → γ 1 F (n + 1) ← δ 1 F (n) → . . . → γ n F (n + 1) (10.4)\nof subobjects. (This is analogous to the decomposition of the simplicial set ∆[1] × ∆[n] into a union of (n + 1) copies of ∆[n + 1], attached along faces.) A straightforward computation shows that the maps γ i F (n + 1) ∩ (F (1) × G(n)) → γ i F (n + 1) and δ i F (n) ∩ (F (1) × G(n)) → δ i F (n) are covers, and hence by (10.1) are weak equivalences. Thus the result follows by comparing diagram (10.4) with the diagram obtained by intersecting each object of (10.4) with F (1) × G(n).\n\n\nEquivalences in Segal spaces\n\nIn this section we give a proof of (6.2). We use the Reedy model category structure in what follows.\n\nWe make use of an explicit filtration of E = discnerve(I[1]). Note that the category I[1] has two objects, which we call x and y, and exactly four morphisms:\n\nx → x, x → y, y → x, y → y. Thus the morphisms are in one-to-one correspondence with the \"words\" xx, xy, yx, yy. In general the points of E k are in one-to-one correspondence with words of length k + 1 in the letters {x, y}. The \"non-degenerate\" points correspond to the words which alternate the letters x and y; there are exactly two such non-degenerate points in E k for each k.\n\nWe define a filtration\nF (1) ≈ E (1) ⊆ E (2) ⊆ E (3) ⊆ · · · ⊆ E of E where E (k)\nis the smallest subobject containing the word xyxyx · · · of length (k + 1). Note that E = k E (k) , and so Map sS (E, W ) ≈ lim n Map sS(E (n) , W ). We will prove (6.2) by actually proving the following stronger result.\n\nProposition 11.1. If W is a Segal space and n ≥ 3, the map Map sS (E (n) , W ) → W 1 factors through the subspace W hoequiv ⊆ W 1 , and induces a weak equivalence Map sS (E (n) , W ) → W hoequiv .\n\nWe prove (11.1) in (11.7).\n\nProof of (6.2) from (11.1). Since E is the colimit of the E (n) along a sequence of cofibrations, it follows by (11.1) that Map sS (E, W ) is the inverse limit of the Map sS (E (n) , W ) along a tower of trivial fibrations. The proposition follows.\n\n\nMorphisms induced by compositions.\n\nLet W be a Segal space. Given g ∈ map(y, z), consider the zig-zag\nmap(x, y) {g}×1 − −−− → map(y, z) × map(x, y) ϕ2 ← − − ∼ map(x, y, z) d1 −→ map(x, z);\nthis induces a morphism g * : map(x, y) → map(x, z) in the homotopy category of spaces. Likewise, given f ∈ map(x, y), consider the zig-zag\nmap(y, z) 1×{f } − −−− → map(y, z) × map(x, y) ϕ2 ← − − ∼ map(x, y, z) d1 −→ map(x, z);\nthis induces a morphism f * : map(y, z) → map(x, z) in the homotopy category of spaces. Note that if f ∈ map(x, y) and g ∈ map(y, z), then g * ([f ]) = f * (g) = [g • f ] (using the notation of §5). We have the following.\n\nProposition 11.3.\n\n(1) Given f ∈ map(x, y) and g ∈ map(y, z), and g • f the result of a composition,\nthen (g • f ) * ∼ g * • f * and (g • f ) * ∼ f * • g * . (2) Given x ∈ obW then (id x ) * ∼ (id x ) * ∼ id map(x,x) .\nProof. To prove (1), let k ∈ map(x, y, z) be a composition of f and g which results in a composite g • f . To show that (g • f ) * ∼ g * • f * , it suffices to show that both sides of the equation are equal (in the homotopy category of spaces) to the zig-zag\nmap(w, x) {k}×1 − −−− → map(x, y, z) × map(w, x) ∼ ←− map(w, x, y, z) → map(w, z). The proof that (g • f ) * ∼ f * • g * is similar.\nThe proof of (2) is straightforward. Proof. The only if direction is straightforward. To prove the if direction, suppose that f * and g * are homotopic for all w ∈ obW . Then in particular they are homotopic for w = x. The following commutative diagram demonstrates that\nf * (id x ) ∼ f . map(x, x) {f }×1 pt {idx} o o {f } map(x, y) × map(x, x) map(x, y) 1×{idx} o o s0\nu u l l l l l l l l l l l l l\n1 map(x, x, y) ∼ (d0,d2) y y d1 G G map(x, y)\nSimilarly g * (id x ) ∼ g, whence f ∼ g using (11.3), as desired.\n\nCorollary 11.5. If f ∈ map(x, y) is a homotopy equivalence (in the sense of (5.5)) then f * and f * are weak equivalences of spaces.\n\nIt is convenient to write map(x, y) f to denote the component of map(x, y) containing f . More generally, we write map(x 0 , . . . , x k ) f1,...,f k for the component of map(x 0 , . . . , x k ) corresponding to the component of (f 1 , . . . , f k ) in map(x 0 , x 1 ) × · · · × map(x k−1 , x k ). The following lemma will be used in the proof of (11.1).\n\nLemma 11.6. Given a Segal space W and f ∈ map(x, y) and g ∈ map(y, z) such that f is a homotopy equivalence, the induced map\nmap(x, y, z) f,g (d1,d2) −−−−→ map(x, z) g•f × map(x, y) f is a weak equivalence.\nProof. This follows from the diagram\nmap(y, z) g × map(x, y) f 1×∆ map(y, z) g × map(x, y) f × map(x, y) f map(x, y, z) f,g (d0,d2) (d0,d2,d2) h h h h h h h Q Q h h h h h h h (1,d2) G G (d1,d2) E E map(x, y, z) f,g × map(x, y) f (d0,d2)×1 ∼ y y d1×1 map(x, z) g•f × map(x, y) f\nHere the vertical column is a weak equivalence since f is a homotopy equivalence (restricting to the fiber over f ∈ map(x, y) f of the projections to map(x, y) f gives exactly the zig-zag which defines f * : map(y, z) g → map(x, z) g•f ). Since (d 0 , d 2 ) is a weak equivalence, the lemma follows. 11.7. Proof of (11.1). For k ≥ 2 there are push-out diagrams\nH(k) G G F (k) σ k E (k−1) G G E (k) (11.8)\nwhere σ k is the map corresponding to the word xyx · · · of length (k + 1), and where H(k) denotes the largest subobject of F (k) not containing d 0 ι. We next note that H(k) can itself be decomposed. Thus let C(k) ⊆ F (k) denote the largest subobject of F (k) not containing d 0 d 0 ι. If we let d 1 : F (k − 1) → F (k) denote the inclusion of the \"face\" d 1 ι, then we have that d 1 F (k − 1) ∩ C(k) = d 1 H(k − 1), and thus an isomorphism\nH(k) ≈ C(k) ∪ d 1 H(k−1) d 1 F (k − 1). (11.9)\nLet X be a simplicial space and W a Segal space. Then each map γ : F (1) → X induces a map γ * : Map sS (X, W ) → Map sS (F (1), W ) ≈ W 1 of spaces. We introduce the following notation. Let Map sS (X, W ) hoequiv denote the subspace of Map sS (X, W ) consisting of all simplices x such that γ * (x) ∈ W hoequiv ⊂ W 1 for all γ : F (1) → X. Then Map sS (X, W ) hoequiv is isomorphic to a union of some of the path components of Map sS (X, W ). In particular, Map sS (F (1), W ) hoequiv ≈ W hoequiv by definition, and so Map sS (F (k), W ) hoequiv ≈ W hoequiv × W0 · · · × W0 W hoequiv .\n\nLemma 11.10. Let W be a Segal space. Then for k ≥ 2 the induced map\nMap sS (F (k), W ) hoequiv → Map sS (H(k), W ) hoequiv is a weak equivalence.\nProof. The proof is by induction on k. The case k = 2 is immediate from (11.6). Now suppose the lemma is proved for the map Map sS (F (k − 1), W ) hoequiv → Map sS (H(k − 1), W ) hoequiv . From (11.9) we get a commutative square\nMap sS (H(k), W ) hoequiv G G Map sS (C(k), W ) hoequiv Map sS (F (k − 1), W ) hoequiv G G Map sS (H(k − 1), W ) hoequiv\nThis square would be a pullback square if we left off the \"hoequiv\" decorations. Even with these decorations the square is a pullback (and hence a homotopy pullback), as can be seen by recalling that\nH(k) 1 = C(k) 1 ∪ d 1 F (k − 1) 1 .\nThus by induction we see that the map\na : Map sS (H(k), W ) hoequiv → Map sS (C(k), W ) hoequiv\nis a weak equivalence. The proof now follows from (11.11) and the fact that the map\nW k ≈ W k−1 × W0 W 1 a×W 0 1 −−−−→ Map sS (C(k), W ) ≈ Map sS (d 1 H(k − 1), W ) × W0 W 1\nis a weak equivalence after restricting to the \"hoequiv\" components.\n\nLemma 11.11. There is a natural weak equivalence\nMap sS (C(k), W ) ≈ Map(d 1 H(k − 1), W ) × W0 W 1 . Proof. Let d 0 H(k − 1) ⊂ C(k) denote the image of H(k − 1) in C(k) induced by the map d 0 : F (k − 1) → F (k).\nThere is a square\nα 1 F (0) G G α 0 F (1) d 0 H(k − 1) G G C(k)\nof subobjects of C(k); we need to show that the inclusion map d 0 H(k − 1) ∪ α 0 F (1) → C(k) of the union of these subobjects is a weak equivalence in the Segal space model category structure. Now C(k) can be written as a colimit of the poset of subcomplexes each of which 1. are isomorphic to F (ℓ) for some ℓ < k, and 2. include 0, 1 ∈ F (k) 0 . Straightforward calculation shows that the intersection of d 0 H(k − 1)∪α 0 F (1) with each of the objects F (ℓ) in the above diagram is a cover of F (ℓ).\n\nProof of (11.1). It is clear that for k ≥ 3 every map\nMap sS (E (k) , W ) → Map sS (F (1), W ) ≈ W 1\ninduced by an inclusion F (1) → E (k) must factor through W hoequiv ⊆ W 1 , since each point of the mapping space maps to a homotopy equivalence in the sense of 28 CHARLES REZK (5.5). Let r k denote the map Map sS (E (k) , W ) → W 1 associated to the inclusion F (1) → E (k) classifying the point xy ∈ E (k) 1 . We have that Map sS (E (k) , W ) = Map sS (E (k) , W ) hoequiv for k ≥ 3, and even when k = 2 we have that\nMap sS (E (2) , W ) hoequiv ≈ Map sS (E (2) , W ) × W1 W hoequiv .\nThen we must show that for each k ≥ 2 the fiber of r k over any point in the subspace W hoequiv ⊂ W 1 is contractible. The result now follows from (11.10) applied to the pushout diagrams (11.8).\n\n\nComplete Segal space closed model category structure\n\nIn this section we prove (7.2). The complete Segal space closed model category structure is defined using (9.1) to be the localization of the Reedy model category of simplicial spaces with respect to the map g obtained as a coproduct of the maps ϕ i of Section 4 and the map x : F (0) → E which corresponds to the object x ∈ I[1]. Parts (1)-(4) of (7.2) follow immediately from (9.1). The only thing left to prove is the compatibility of this model category structure with the cartesian closure.\n\nBy (9.2) it suffices to show that if W is a complete Segal space, then so is W F (1) . In (7.1) we have already proved that W F (1) is a Segal space; thus it suffices to show Proposition 12.1. If W is a complete Segal space, then the map g : (W F (1) ) 0 → (W F (1) ) hoequiv is a weak equivalence.\n\n12.2. Homotopy monomorphisms. Say a map f : X → Y of spaces is a homotopy monomorphism if 1. it is injective on π 0 , and 2. it is a weak equivalence of each component of X to the corresponding component of Y . Equivalently, f is a homotopy monomorphism if the square\nX 1 G G 1 X f X f G G Y\nis a homotopy pullback square. Since homotopy limits commute, the homotopy limit functor applied to a homotopy monomorphism between two diagrams yields a homotopy monomorphism.\n\n12.3. Proof of (12.1). The map s 0 : (W F (1) ) 0 → (W F (1) ) 1 is obtained by taking limits of the rows in the diagram:\nW 1 s0 W 1 1 W 1 s1 W 2 d1 G G W 1 W 2 d1 o o\nBy hypothesis, s 0 : W 0 → W 1 is a homotopy monomorphism. Thus the maps s 0 , s 1 : W 1 → W 2 are homotopy monomorphisms, since they are weakly equivalent to W 1 × W0 s 0 : W 1 × W0 W 0 → W 1 × W0 W 1 and s 0 × W0 W 1 : W 0 × W0 W 1 → W 1 × W0 W 1 . It follows that s 0 : (W F (1) ) 0 → (W F (1) ) 1 is a homotopy monomorphism.\n\nThus both s 0 : (W F (1) ) 0 → (W F (1) ) 1 and (W F (1) ) hoequiv → (W F (1) ) 1 are homotopy monomorphisms. So to prove the proposition it suffices to show that both these maps hit the same components. As we already know that (W F (1) ) 0 → (W F (1) ) 1 factors through a map (W F (1) ) 0 → (W F (1) ) hoequiv , it suffices to show that this last map is surjective on π 0 .\n\nUsing the part of the proof already completed and (12.4), one observes that a point x ∈ (W F (1) ) hoequiv lies in a component hit by (W F (1) ) 0 → (W F (1) ) hoequiv if and only if the images f x, gx ∈ (W F (0) ) 1 ≈ W 1 are homotopy equivalences in W , where f, g : W F (1) → W F (0) are the maps induced by the two inclusions d 0 , d 1 : F (0) → F (1). But if x ∈ (W F (1) ) 1 is a homotopy equivalence of W F (1) then certainly its images under f and g are homotopy equivalences. Thus the result is proved.\n\nLemma 12.4. Let W be a Segal space. Then the squares\nW 0 s0 W 1 s0 d1 o o W 1 s1 d0 G G W 0 s0 W 1 W 2 d2 o o W 2 d0 G G W 1\nare homotopy pullback squares.\n\nProof. Recall that for a Segal space\n(d 0 , d 2 ) : W 2 ∼ − → W 1 × W0 W 1 , so that W 2 × W1 W 0 ∼ − → (W 1 × W0 W 1 ) × W1 W 0 ≈ W 1 and W 0 × W1 W 2 ∼ − → W 0 × W1 (W 1 × W0 W 1 ) ≈ W 1 .\n\nCategorical equivalences\n\nIn this section we provide a generalization to Segal spaces of the category theoretic concepts of \"natural isomorphism of functors\" and \"equivalence of categories\", and show that for the complete Segal spaces, these concepts correspond precisely to those of \"homotopy between maps\" and \"(weak) homotopy equivalence\".\n\nNote that, by the results of §9 through §12, statements (7.1) through (7.6) of §7 are now available to us.\n\n13.1. Categorical homotopies. Let E denote, as in §6, the discrete nerve of I[1]. We define a categorical homotopy between maps f, g : U ⇉ V of Segal spaces to be any one of the following equivalent data: a map H : U × E → V , a map H ′ : U → V E , or a map H ′′ : E → V U , making the appropriate diagram commute: If U and V are discrete nerves of categories C and D, then the categorical homotopies of maps between U and V correspond exactly to natural isomorphisms of functors between C and D. Proof. The maps W i0 , W i1 : W E → W are Reedy trivial fibrations if W is a complete Segal space. This is because of parts (2) and (3) of (6.4), together with the observation that \nV i 1 E H ′′ G G V U U g`ỳ(W E ) n ≈ Map sS (E, W F (n) ) ≈ (W F (n) ) 0 since W F (n) isU g G G 1 K 9 9 P P P P P P P P P P P P P P V h G G U U U E V i 0 y y V i 1 o o and V f G G 1 H 9 9 P P P P P P P P P P P P P P U g G G V V V E V i 0 y y V i 1 o o\nwill show that gf and hg are Dwyer-Kan equivalences, and hence g is a Dwyer-Kan equivalence using (7.5).\n\nLemma 13.9. If W is a Segal space, the map W → W E and both maps W E → W are Dwyer-Kan equivalences.\n\nProof. By (7.5) it suffices to show that the map j : W → W E induced by E → F (0) is a Dwyer-Kan equivalence. We have already noted in the first part of the proof of (13.8) that categorically equivalent Segal spaces have equivalent homotopy categories, whence Ho(W E ) → Ho W is an equivalence of categories. Thus it suffices to show that the induced map map W (x, y) → map W E (j(x), j(y)) is a weak equivalence for each x, y ∈ obW . We consider the diagram\nW 1 j * G G (d1,d0) (W E ) 1 (d1,d0) i * G G (W F (1) ) 1 (d1,d0) W 0 × W 0 j * G G (W E ) 0 × (W E ) 0 i * G G (W F (1) ) 0 × (W F (1) ) 0\nwhere the horizontal arrows are induced by maps F (1) i − → E j − → F (0); note that ji = s 0 . We will show that the two horizontal maps marked i * are homotopy monomorphisms (12.2), and that the large rectangle is a homotopy pullback; this will imply that for each pair x, y ∈ obW the maps of fibers\nmap W (x, y) j * −→ map W E (jx, jy) i * − → map W F (1) (s 0 x, s 0 y)\nare such that i * j * is a weak equivalence and i * is a homotopy monomorphism, whence j * is a weak equivalence, as desired.\n\nThat the map W i : W E → W F (1) is a homotopy monomorphism of spaces in each simplicial degree (and thus also the i * 's) follows since (W E ) n = Map sS (E, W F (n) ), (W F (1) ) n = Map sS (F (1), W F (n) ) = (W F (n) ) 1 , and since W F (n) is a Segal space, using (6.2).\n\nThe large rectangle is isomorphic to the square\nW 1 (s0,s1) G G (d1,d0) W 2 × W1 W 2 (d2π1,d0π2) W 0 × W 0 s0×s0 G G W 1 × W 1 32\n\nCHARLES REZK\n\n(where W 2 × W1 W 2 denotes the limit of the diagram W 2 d1 −→ W 1 d1 ← − − W 2 ) which is shown to be a homotopy pull-back by a straightforward computation using (12.4).\n\n\nA completion functor\n\nIn this section we prove (7.7). We do this by constructing functorially for each Segal space W a map i W : W → W called the completion map, such that (1) the completion W is a complete Segal space, (2) the completion map i W is a weak equivalence in the complete Segal space model category, and (3) the completion map i W is a Dwyer-Kan equivalence. Statement (2) implies that a map f : U → V between Segal spaces is a weak equivalence in the complete Segal space model category structure if and only if f is. Likewise, statement (3) together with (7.5) imply that f is a Dwyer-Kan equivalence if and only if f is. Thus (7.7) will follow from statement (1) together with (7.6), which shows that the Dwyer-Kan equivalences between complete Segal spaces are precisely the Reedy weak equivalences between such, which are precisely the weak equivalences between fibrant objects in the complete Segal space model category structure.\n\nWe should note that it is easy to demonstrate statements (1) and (2) alone. In fact, (7.2) implies that there exists for each simplicial space W a fibrant replacement map i : W → W f , in which i is a weak equivalence in the complete Segal space model category structure, and W f is a complete Segal space. However, we need a different construction to prove all three statements.\n\nSuppose Then the spaces W n taken together form a simplicial space W , and there is a natural map W → W . Since Map sS (E(m), W F (n) ) = (W E(m) ) n , we can write W = diag ′ ([m] → W E(m) ), where diag ′ : s(sS) → sS denotes the prolongation of the diag functor to simplicial objects in sS.\n\nLet W → W denote the functorial Reedy fibrant replacement of W . The composite map i W : W → W is called the completion map of W , and the functor which sends W to W is called the completion functor.\n\nRemark 14.1. This completion is a generalization of the classifying space construction. In fact, suppose W is a Segal space such that Ho W is a groupoid; equivalently, that W 1 = W hoequiv . Then the arguments below show that W is weakly equivalent to a constant simplicial space, which in each degree is the realization diag W . For instance, if W is a \"∆-space\" (i.e., W 0 = * ) and thus a model for a loop space with underlying space equivalent to W 1 , then W is equivalent to the constant object which is BW 1 , the classifying space of the \"loop space\" W 1 , in each degree.\n\nLemma 14.2. If C is a category, then discnerve C is isomorphic to N C. In particular, N E ≈ E and E are weakly equivalent to the terminal object in sS.\n\nProof. The first statement is straightforward from the definitions. Since E is equivalent to the terminal object in Cat, and N takes equivalences to weak equivalences by (3.7), the second statement follows.\n\nLemma 14.3. If U → V is a categorical equivalence between Segal spaces, then U → V is a Reedy weak equivalence.\n\nProof. It is clear from the definition that U × E ≈ U × E, and E is contractible by (14.2). Thus categorically homotopic maps are taken to homotopic maps by the completion operator, and hence completion takes categorical equivalences to homotopy equivalences.\n\nProof of statement (2). By (13.5) the natural maps W → W E(m) are categorical equivalences, and hence weak equivalences in the complete Segal space model category structure by (13.6). Thus the induced map on homotopy colimits\nW = diag ′ ([m] → W ) → diag ′ ([m] → W E(m) ) = W\nis a weak equivalence in the complete Segal space model category structure.\n\n\nProof of statements (1) and (3). For each simplicial map\nδ : [n] → [m] ∈ ∆ there is a diagram (W E(m) ) k G G\n(W E(n) ) k (W E(m) ) ×k 0 G G (W E(n) ) ×k 0 By (13.8) the maps W E(m) → W E(n) are Dwyer-Kan equivalences, so for each set of objects x 0 , . . . , x k ∈ obW the morphism map W E(m) (x 0 , . . . , x k ) → map W E(n) (δx 0 , . . . , δx k ) between the fibers of the vertical maps in the above diagram is a weak equivalence. Thus, the square is a homotopy pullback, with fibers which are weakly equivalent to the products of mapping spaces.\n\nThus, the induced map of realizations diag ′ (W E(−) ) k → diag ′ (W E(−) ) ×k 0 has its homotopy fibers weakly equivalent to a k-fold product of mapping spaces, and thus we have shown that W is a Segal space, and that map W (x, y) → map W (i(x), i(y)) are weak equivalences for all x, y ∈ obW .\n\nBy construction the map π 0 W 0 → π 0 W 0 is surjective; it follows that Ho W → Ho W is surjective on isomorphism classes of objects. Therefore we have shown that W → W is a Dwyer-Kan equivalence, proving statement (3).\n\nIt remains to show that W is a complete Segal space. Consider the square (W E(m) ) hoequiv (W j ) hoequiv G G\n\n(W E(n) ) hoequiv (W E(m) ) 0 × (W E(m) ) 0 (W j )0×(W j )0 G G (W E(n) ) 0 × (W E(n) ) 0 induced by a map j : E(n) → E(m). Since W E(m) → W E(n) is a categorical equivalence by (13.5) and thus a Dwyer-Kan equivalence by (13.8), we may conclude that the induced map hoequiv W E(m) (x, y) → hoequiv W E(n) (j(x), j(y)) is a weak equivalence for each pair (x, y) ∈ (W E(m) ) 0 × (W E(m) ) 0 . Thus the above square is a homotopy pullback, and so the induced map diag ′ (W E(−) ) hoequiv → diag ′ (W E(−) ) ×2 0 has its homotopy fibers weakly equivalent to the spaces hoequiv W (x, y). That is, ( W ) hoequiv ≈ diag([m] → (W E(m) ) hoequiv ).\n\nSince (W E(m) ) hoequiv ≈ (W E(m)×E(1) ) 0 by (6.2), the above really says that there is an equivalence ( W ) hoequiv ≈ ( W E(1) ) 0 . Now (14.3) shows that since W E(1)\n\nis categorically equivalent to W , we have that ( W ) hoequiv ≈ ( W E(1) ) 0 ≈ ( W ) 0 ; in other words, W is a complete Segal space. This proves statement (1), and completes the proof.\n\n\nd i : [n + 1] → [n], s i : [n − 1] → [n], and α i : [m] → [n] in ∆.\n\nProposition 3. 2 .\n2The nerve of [n] is ∆[n]. For categories C and D there are natural isomorphisms nerve(C × D) ≈ nerve C × nerve D and nerve(D C ) ≈ nerve(D) nerve(C) .\n\n\nsimplicial spaces. The functor N : Cat → sS is a full embedding of categories. Furthermore, a functor f : C → D is an equivalence of categories if and only if N f is a weak equivalence of simplicial spaces.\n\n\nW are maps of Segal spaces such that f and g are Dwyer-Kan equivalences, then gf is a Dwyer-Kan equivalence. X are maps of Segal spaces such that gf and hg are Dwyer-Kan equivalences, then each of the maps f , g, and h is a Dwyer-Kan equivalence. Proof. Straightforward. Proposition 7.6. A map f : U → V of complete Segal spaces is a Dwyer-Kan equivalence if and only if it is a Reedy weak equivalence.\n\nTheorem 7. 7 .\n7Let f : U → V be a map between Segal spaces. Then f is a Dwyer-Kan equivalence if and only if it becomes a weak equivalence in the complete Segal space model category structure.\n\nTheorem 8. 3 .\n3Let M be simplicial closed model category, and let W ⊂ M denote the subcategory of weak equivalences. Then V = N f (M, W) is a complete Segal space. Furthermore, there is an equivalence of categories Ho V ≈ Ho M and there are weak equivalences of spaces map V (X, Y ) ≈ map M (X, Y ).\n\n8. 6 .\n6Results about classification spaces. Recall that the classification space class M of a model category is defined to be nerve we(M). Given a closed model category M and an object X ∈ M, write sc X for the component of class(M) containing X.\n\n\n(The notation class(M) was defined in (1.2).) Compare with (6.4, 4).Let M be a simplicial closed model category. Then M [n] also admits a simplicial closed model category structure, in which a map f :X → Y in M [n] is 1. a weak equivalence if f i : Xi → Y i is a weak equivalence in M for each 0 ≤ i ≤ n, 2. a fibration if f i : Xi → Y i is a fibration in M for each 0 ≤ i ≤ n,and 3. a cofibration if the induced maps Xi ∐ X(i−1) Y (i − 1) → Y i are cofibrations in M for each 0 ≤ i ≤ n, and we let X(−1) = Y (−1) denote the initial object in M. Furthermore, a map δ : [m] → [n] induces a functor δ * : M [n] → M [m] which is simplicial and which preserves fibrations, cofibrations, and weak equivalences. If Y is a fibrant-and-cofibrant object in M [n] , with restriction Y ′ ∈ M [n−1] formed from the first n objects and (n − 1) maps in [n], then the homotopy fiber of the mapW haut\n\nCorollary 8 . 12 .\n812There is a natural weak equivalence N (M I ) ∼ − → N f (M) N (I) of complete Segal spaces if M = S J and I and J are small categories.\n\n\nLet ∆ op I denote the category of simplices of I. This is a category in which the objects are functors f : [m] → I, and the morphisms (f : [m] → I) → (g : [n] → I) consist of functors δ : [n] → [m] making f • δ = g. The actual theorem of Dwyer and Kan [DK84a], [DK84b] is the following: Theorem 8.14 (Dwyer-Kan). Let I be a small category. The natural map\n\n\n[m] → A(m) n ). The result follows from isomorphismsMap sS (diag ′ A, W ) ≈ Tot(Map sS (A(−), W )) ≈ holim [k]→I∈∆ op I W k ,and the fact that Map sS (discnerve I, W ) → Map sS (diag ′ A, W ) is a weak equivalence since W is Reedy fibrant.\n\nProposition 9 . 1 .\n91Given a inclusion f : A → B ∈ sS, there exists a cofibrantly generated, simplicial model category structure on sS with the following properties:(1) the cofibrations are exactly the inclusions,(2) the fibrant objects (called f -local objects) are exactly the Reedy fibrant W ∈ sS such that Map sS (B, W ) → Map sS (A, W ) is a weak equivalence of spaces, (3) the weak equivalences (called f -local weak equivalences) are exactly the maps g : X → Y such that for every f -local object W , the induced map Map sS (Y, W ) → Map sS (X, W )\n\nLemma 10 . 1 .F\n101Let G ⊂ F (n) be a cover. Then the inclusion maps G((n) are weak equivalences in the Segal space model category structure.\n\nLemma 10 . 3 .\n103The inclusion F (1) × G(n) → F (1) × F (n)is a weak equivalence in the Segal space model category structure.\n\n\nLet γ i : [n + 1] → [1] × [n] denote the map defined by\n\nProposition 11. 4 .\n4Let f, g ∈ map(x, y). Then f ∼ g if and only if the maps f * , g * : map(w, x) → map(w, y) are homotopic for all w ∈ obW , if and only if the maps f * , g * : map(y, z) → map(x, z) are homotopic for all z ∈ obW .\n\n\nW is a Segal space. Let E(m) = discnerve I[m]. For each n ≥ 0 we can define a simplicial space by [m] → Map sS (E(m), W F (n) ). Let W n = diag [m] → Map sS (E(m), W F (n) ) = diag [m] → (W E(m) ) n .\n\n\nCorollary 6.6. Let W be a complete Segal space. Then Ho W is a groupoid if and only if W is Reedy weakly equivalent to a constant simplicial space. Proof. The category Ho W is a groupoid if and only if hoequiv(x, y) = map(x, y) for all x, y ∈ obW , if and only if W hoequiv = W 1 , if and only if s 0 : W 0 → W 1 is a weak equivalence (since W is complete). A simplicial space W is weakly equivalent to a constant simplicial space if and only if s 0 : W 0 → W 1 is a weak equivalence. 7. Closed model category structures Our main results deal with the existence of certain closed model category structures on sS related to Segal spaces and complete Segal spaces. Theorem 7.1. There exists a simplicial closed model category structure on the category sS of simplicial spaces, called the Segal space model category structure, with the following properties. 1. The cofibrations are precisely the monomorphisms. 2. The fibrant objects are precisely the Segal spaces. 3. The weak equivalences are precisely the maps f such that Map sS (f, W ) is a weak equivalence of spaces for every Segal space W . 4. A Reedy weak equivalence between any two objects is a weak equivalence in the Segal space model category structure, and if both objects are themselves Segal spaces then the converse holds. Moreover, this model category structure is compatible with the cartesian closed structure on sSet in the sense of Section 2.\n\n\nTheorem 7.2. There exists a simplicial closed model category structure on the category sS of simplicial spaces, called the complete Segal space model category structure, with the following properties.1. The cofibrations are precisely the monomorphisms. \n2. The fibrant objects are precisely the complete Segal spaces. \n3. The weak equivalences are precisely the maps f such that Map sS (f, W ) is a \nweak equivalence of spaces for every complete Segal space W . \n4. A Reedy weak equivalence between any two objects is a weak equivalence in \nthe complete Segal space model category structure, and if both objects are \nthemselves complete Segal spaces then the converse holds. \nMoreover, this model category structure is compatible with the cartesian closed struc-\nture on sSet in the sense of Section 2. \n\n\n\n\nfor each pair of objects x, x ′ ∈ U the induced function on mapping spaces map U7.4. Dwyer-Kan equivalences. We would like to understand the relationship \nbetween the model category structures for Segal spaces and for complete Segal \nspaces. \nWe say a map f : U → V of Segal spaces is a Dwyer-Kan equivalence if \n1. the induced map Ho f : Ho U → Ho V on homotopy categories is an equiva-\nlence of categories, and \n2. \n\n\nProposition 13.2. If U is a Segal space and W is a complete Segal space, then a pair of maps f, g : U ⇉ W are categorically homotopic if and only if they are homotopic in the usual sense; i.e., if there exists a map K : U × ∆[1] → W which restricts to f and g on the endpoints of ∆[1].\n\n\na complete Segal space by (7.3). Thus, categorically homotopic maps coincide in the Reedy homotopy category, and hence are simplicially homotopic since W is Reedy fibrant. 13.3. Categorical equivalences. We say that a map g : U → V of Segal spaces is a categorical equivalence if there exist maps f, h : V → U and categorical homotopies gf ∼ 1 V and hg ∼ 1 U . Note that if U and V are discrete nerves of categories, then the categorical equivalences correspond exactly to equivalences of categories. Proposition 13.4. A map g : U → V between complete Segal spaces is a categorical equivalence if and only if it is a simplicial homotopy equivalence, if and only if it is a Reedy weak equivalence. Proof. The first \"if and only if\" is immediate from (13.2), while the second follows from the fact that complete Segal spaces are cofibrant and fibrant in the Reedy simplicial model category. Proposition 13.5. Let A, B, and W be Segal spaces. If f, g : A ⇉ B are categorically homotopic maps, then the induced maps W B ⇉ W A are categorically homotopic. If f : A → B is a categorical equivalence, then the induced map W B → W A is a categorical equivalence. Proof. If a categorical homotopy between f and g is given by H : A × E → B, then W H : W B → W A×E ≈ (W A ) E is a categorical homotopy of W f and W g . The statement about categorical equivalences follows. Proposition 13.6. If f : U → V is a categorical equivalence between Segal spaces, then it is a weak equivalence in the complete Segal space model category structure.Proof. Recall from (7.2) that f is a weak equivalence in the complete Segal space model category if and only if Map sS (f, W ) is a weak equivalence of spaces for each complete Segal space W . This is equivalent to supposing that W f : W V → W U is a Reedy weak equivalence for each complete Segal space W , since (W f ) n ≈ Map sS (f, W F (n) ) and since W F (n) is a complete Segal space by(7.3). The result now follows by noting that W f is a categorical equivalence between complete Segal spaces by (13.5) and (7.3), and thus is a Reedy weak equivalence by (13.4). 13.7. Categorical equivalences are Dwyer-Kan equivalences. In the remainder of this section, we prove the following result.Proposition 13.8. If g : U → V is a categorical equivalence of Segal spaces, then it is a Dwyer-Kan equivalence.Proof. We first note that since Ho(U ×E) = Ho U ×Ho E = Ho U ×I[1], we see that categorically homotopic maps of Segal spaces induce naturally isomorphic functors between their homotopy categories, and thus a categorical equivalence induces an equivalence between homotopy categories.If f, h : V → U are maps together with categorical homotopies H : gf ∼ 1 V and K : hg ∼ 1 U , then (13.9) applied to the diagrams\n\nSpectra and γ-sets, Algebraic Topology. D W Anderson, Proceedings of symposia in pure mathematics. A. Liuleviciussymposia in pure mathematicsXXII, Amer. Math. SocD. W. Anderson, Spectra and γ-sets, Algebraic Topology (A. Liulevicius, ed.), Proceed- ings of symposia in pure mathematics, no. XXII, Amer. Math. Soc., 1971, pp. 23-30.\n\nA K Bousfield, D M Kan, Homotopy limits, completions and localizations. Springer-Verlag304A. K. Bousfield and D. M. Kan, Homotopy limits, completions and localizations, Lecture Notes in Mathematics 304, Springer-Verlag, 1972.\n\nW G Dwyer, P Hirschhorn, D M Kan, General abstract homotopy theory. in preperationW. G. Dwyer, P. Hirschhorn, and D. M. Kan, General abstract homotopy theory, in preperation.\n\nFunction complexes in homotopical algebra. W G Dwyer, D M Kan, Topology. 19W. G. Dwyer and D. M. Kan, Function complexes in homotopical algebra, Topology 19 (1980), 427-440.\n\nA classification theorem for diagrams of simplicial sets. W G Dwyer, D M Kan, Topology. 23W. G. Dwyer and D. M. Kan, A classification theorem for diagrams of simplicial sets, Topology 23 (1984), 139-155.\n\nRealizing diagrams in the homotopy category by means of diagrams of simplicial sets. W G Dwyer, D M Kan, Proc. Amer. Math. Soc. 91W. G. Dwyer and D. M. Kan, Realizing diagrams in the homotopy category by means of diagrams of simplicial sets, Proc. Amer. Math. Soc. 91 (1984), 456-460.\n\nAn E 2 model category structure for pointed simplicial spaces. W G Dwyer, D M Kan, C R Stover, Journal of Pure and Applied Algebra. 90W. G. Dwyer, D. M. Kan, and C. R. Stover, An E 2 model category structure for pointed simplicial spaces, Journal of Pure and Applied Algebra 90 (1993), 137-152.\n\nHomotopy theories and model categories. W G Dwyer, J Spalinski, Handbook of algebraic topology (I. M. James. Elsevier Science B. VW. G. Dwyer and J. Spalinski, Homotopy theories and model categories, Handbook of algebraic topology (I. M. James, ed.), Elsevier Science B. V., 1995.\n\nP G Goerss, J F Jardine, Simplicial homotopy theory. to appearP. G. Goerss and J. F. Jardine, Simplicial homotopy theory, to appear.\n\nHomotopy theories, Memoirs of the Amer. A Heller, Math. Soc. 383Amer. Math. SocA. Heller, Homotopy theories, Memoirs of the Amer. Math. Soc., no. 383, Amer. Math. Soc., 1988.\n\nP Hirschhorn, Localization in model categories. P. Hirschhorn, Localization in model categories, http://www-math.mit.edu/∼psh.\n\nSimplicial presheaves. J F Jardine, J. Pure Appl. Algebra. 471J. F. Jardine, Simplicial presheaves, J. Pure Appl. Algebra 47 (1987), no. 1, 35-87.\n\nBoolean localization, in practice. J F Jardine, Doc. Math. 113electronicJ. F. Jardine, Boolean localization, in practice, Doc. Math. 1 (1996), No. 13, 245-275 (electronic).\n\nJ P May, Simplicial objects in algebraic topology. University of Chicago PressJ. P. May, Simplicial objects in algebraic topology, University of Chicago Press, 1967.\n\nHomotopical algebra. D G Quillen, Lecture Notes in Mathematics. 43Springer-VerlagD. G. Quillen, Homotopical algebra, Lecture Notes in Mathematics 43, Springer-Verlag, 1967.\n\nRational homotopy theory. D G Quillen, Annals of Math. 90D. G. Quillen, Rational homotopy theory, Annals of Math 90 (1969), 65-87.\n\nHomotopy theory of model categories. C L Reedy, unpublished manuscriptC. L. Reedy, Homotopy theory of model categories, unpublished manuscript.\n\nCategories and cohomology theories. G Segal, Topology. 13G. Segal, Categories and cohomology theories, Topology 13 (1974), 293-312.\n\nUniqueness of delooping machines. R W Thomason, Duke Math. J. 46R. W. Thomason, Uniqueness of delooping machines, Duke Math. J. 46 (1979), 217-252.\n", "annotations": {"author": "[{\"end\":78,\"start\":65}]", "publisher": null, "author_last_name": "[{\"end\":77,\"start\":73}]", "author_first_name": "[{\"end\":72,\"start\":65}]", "author_affiliation": null, "title": "[{\"end\":51,\"start\":1},{\"end\":129,\"start\":79}]", "venue": "[{\"end\":180,\"start\":131}]", "abstract": "[{\"end\":586,\"start\":225}]", "bib_ref": "[{\"attributes\":{\"ref_id\":\"b14\"},\"end\":666,\"start\":659},{\"attributes\":{\"ref_id\":\"b3\"},\"end\":1316,\"start\":1310},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":2181,\"start\":2174},{\"attributes\":{\"ref_id\":\"b3\"},\"end\":2521,\"start\":2515},{\"attributes\":{\"ref_id\":\"b7\"},\"end\":3417,\"start\":3411},{\"end\":3422,\"start\":3417},{\"attributes\":{\"ref_id\":\"b5\"},\"end\":9833,\"start\":9826},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":9842,\"start\":9835},{\"attributes\":{\"ref_id\":\"b11\"},\"end\":11574,\"start\":11567},{\"attributes\":{\"ref_id\":\"b12\"},\"end\":11583,\"start\":11576},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":12698,\"start\":12691},{\"end\":18006,\"start\":18001},{\"end\":18895,\"start\":18890},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":20386,\"start\":20379},{\"end\":25471,\"start\":25468},{\"end\":29751,\"start\":29748},{\"attributes\":{\"ref_id\":\"b17\"},\"end\":30250,\"start\":30243},{\"attributes\":{\"ref_id\":\"b0\"},\"end\":30388,\"start\":30381},{\"end\":30461,\"start\":30445},{\"attributes\":{\"ref_id\":\"b3\"},\"end\":46150,\"start\":46144},{\"attributes\":{\"ref_id\":\"b13\"},\"end\":47700,\"start\":47693},{\"end\":47706,\"start\":47700},{\"end\":49345,\"start\":49342},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":51429,\"start\":51423},{\"attributes\":{\"ref_id\":\"b5\"},\"end\":51703,\"start\":51696},{\"end\":53875,\"start\":53870}]", "figure": "[{\"attributes\":{\"id\":\"fig_0\"},\"end\":80858,\"start\":80789},{\"attributes\":{\"id\":\"fig_2\"},\"end\":81030,\"start\":80859},{\"attributes\":{\"id\":\"fig_3\"},\"end\":81239,\"start\":81031},{\"attributes\":{\"id\":\"fig_4\"},\"end\":81644,\"start\":81240},{\"attributes\":{\"id\":\"fig_5\"},\"end\":81839,\"start\":81645},{\"attributes\":{\"id\":\"fig_6\"},\"end\":82141,\"start\":81840},{\"attributes\":{\"id\":\"fig_7\"},\"end\":82390,\"start\":82142},{\"attributes\":{\"id\":\"fig_9\"},\"end\":83277,\"start\":82391},{\"attributes\":{\"id\":\"fig_10\"},\"end\":83435,\"start\":83278},{\"attributes\":{\"id\":\"fig_11\"},\"end\":83793,\"start\":83436},{\"attributes\":{\"id\":\"fig_12\"},\"end\":84035,\"start\":83794},{\"attributes\":{\"id\":\"fig_13\"},\"end\":84593,\"start\":84036},{\"attributes\":{\"id\":\"fig_14\"},\"end\":84736,\"start\":84594},{\"attributes\":{\"id\":\"fig_15\"},\"end\":84864,\"start\":84737},{\"attributes\":{\"id\":\"fig_16\"},\"end\":84922,\"start\":84865},{\"attributes\":{\"id\":\"fig_17\"},\"end\":85157,\"start\":84923},{\"attributes\":{\"id\":\"fig_19\"},\"end\":85360,\"start\":85158},{\"attributes\":{\"id\":\"tab_0\",\"type\":\"table\"},\"end\":86775,\"start\":85361},{\"attributes\":{\"id\":\"tab_1\",\"type\":\"table\"},\"end\":87583,\"start\":86776},{\"attributes\":{\"id\":\"tab_2\",\"type\":\"table\"},\"end\":88003,\"start\":87584},{\"attributes\":{\"id\":\"tab_3\",\"type\":\"table\"},\"end\":88291,\"start\":88004},{\"attributes\":{\"id\":\"tab_4\",\"type\":\"table\"},\"end\":91037,\"start\":88292}]", "paragraph": "[{\"end\":1396,\"start\":602},{\"end\":2183,\"start\":1398},{\"end\":3021,\"start\":2185},{\"end\":3424,\"start\":3023},{\"end\":4165,\"start\":3426},{\"end\":4532,\"start\":4167},{\"end\":5214,\"start\":4534},{\"end\":5678,\"start\":5216},{\"end\":6416,\"start\":5680},{\"end\":6929,\"start\":6418},{\"end\":7208,\"start\":6931},{\"end\":7853,\"start\":7210},{\"end\":8406,\"start\":7855},{\"end\":8864,\"start\":8408},{\"end\":10627,\"start\":8866},{\"end\":11083,\"start\":10629},{\"end\":11367,\"start\":11120},{\"end\":11899,\"start\":11369},{\"end\":12644,\"start\":11901},{\"end\":13444,\"start\":12646},{\"end\":14126,\"start\":13446},{\"end\":14221,\"start\":14128},{\"end\":14570,\"start\":14223},{\"end\":14734,\"start\":14592},{\"end\":15214,\"start\":14736},{\"end\":15353,\"start\":15216},{\"end\":15676,\"start\":15355},{\"end\":16103,\"start\":15678},{\"end\":16674,\"start\":16126},{\"end\":16846,\"start\":16723},{\"end\":16901,\"start\":16848},{\"end\":17226,\"start\":16921},{\"end\":17378,\"start\":17228},{\"end\":17726,\"start\":17588},{\"end\":17964,\"start\":17728},{\"end\":18199,\"start\":17966},{\"end\":18410,\"start\":18273},{\"end\":18497,\"start\":18434},{\"end\":19232,\"start\":18499},{\"end\":19660,\"start\":19371},{\"end\":19778,\"start\":19662},{\"end\":20455,\"start\":19819},{\"end\":20674,\"start\":20457},{\"end\":21077,\"start\":20676},{\"end\":21783,\"start\":21129},{\"end\":21855,\"start\":21785},{\"end\":22179,\"start\":21857},{\"end\":22321,\"start\":22196},{\"end\":22483,\"start\":22323},{\"end\":22998,\"start\":22485},{\"end\":23136,\"start\":23000},{\"end\":23413,\"start\":23169},{\"end\":23533,\"start\":23478},{\"end\":24131,\"start\":23535},{\"end\":24392,\"start\":24133},{\"end\":24439,\"start\":24394},{\"end\":24950,\"start\":24610},{\"end\":25650,\"start\":25007},{\"end\":25873,\"start\":25652},{\"end\":25988,\"start\":25875},{\"end\":26465,\"start\":26072},{\"end\":26673,\"start\":26467},{\"end\":27566,\"start\":26770},{\"end\":27635,\"start\":27568},{\"end\":27712,\"start\":27691},{\"end\":27873,\"start\":27714},{\"end\":27963,\"start\":27916},{\"end\":28052,\"start\":27976},{\"end\":28078,\"start\":28054},{\"end\":28196,\"start\":28137},{\"end\":28507,\"start\":28295},{\"end\":28656,\"start\":28509},{\"end\":28784,\"start\":28658},{\"end\":28909,\"start\":28846},{\"end\":29356,\"start\":29221},{\"end\":29459,\"start\":29358},{\"end\":29625,\"start\":29500},{\"end\":29769,\"start\":29657},{\"end\":29847,\"start\":29796},{\"end\":30463,\"start\":29864},{\"end\":30661,\"start\":30465},{\"end\":30871,\"start\":30856},{\"end\":31169,\"start\":31113},{\"end\":31370,\"start\":31274},{\"end\":31550,\"start\":31436},{\"end\":31888,\"start\":31593},{\"end\":32224,\"start\":31902},{\"end\":32338,\"start\":32226},{\"end\":32801,\"start\":32375},{\"end\":32932,\"start\":32803},{\"end\":33230,\"start\":33040},{\"end\":33564,\"start\":33232},{\"end\":33927,\"start\":33862},{\"end\":34312,\"start\":33929},{\"end\":34807,\"start\":34314},{\"end\":34887,\"start\":34809},{\"end\":35088,\"start\":34962},{\"end\":35092,\"start\":35090},{\"end\":35807,\"start\":35302},{\"end\":36382,\"start\":36048},{\"end\":36724,\"start\":36384},{\"end\":37142,\"start\":37063},{\"end\":37960,\"start\":37436},{\"end\":38114,\"start\":37962},{\"end\":38235,\"start\":38116},{\"end\":38439,\"start\":38298},{\"end\":38754,\"start\":38441},{\"end\":38970,\"start\":38780},{\"end\":39083,\"start\":38972},{\"end\":39298,\"start\":39085},{\"end\":39576,\"start\":39300},{\"end\":39729,\"start\":39578},{\"end\":39886,\"start\":39731},{\"end\":40040,\"start\":39888},{\"end\":40379,\"start\":40116},{\"end\":40451,\"start\":40381},{\"end\":40485,\"start\":40453},{\"end\":40488,\"start\":40487},{\"end\":40786,\"start\":40565},{\"end\":40832,\"start\":40797},{\"end\":40861,\"start\":40834},{\"end\":41140,\"start\":40863},{\"end\":41288,\"start\":41142},{\"end\":41456,\"start\":41290},{\"end\":41614,\"start\":41458},{\"end\":41812,\"start\":41616},{\"end\":42365,\"start\":41845},{\"end\":42575,\"start\":42367},{\"end\":43251,\"start\":42650},{\"end\":43490,\"start\":43253},{\"end\":43660,\"start\":43492},{\"end\":43804,\"start\":43708},{\"end\":44226,\"start\":43806},{\"end\":45251,\"start\":44228},{\"end\":45923,\"start\":45253},{\"end\":46151,\"start\":45925},{\"end\":47061,\"start\":46153},{\"end\":47325,\"start\":47063},{\"end\":47785,\"start\":47370},{\"end\":47905,\"start\":47839},{\"end\":48040,\"start\":47962},{\"end\":48470,\"start\":48042},{\"end\":48909,\"start\":48540},{\"end\":49873,\"start\":48911},{\"end\":50331,\"start\":49938},{\"end\":50466,\"start\":50333},{\"end\":50548,\"start\":50468},{\"end\":50710,\"start\":50550},{\"end\":50796,\"start\":50712},{\"end\":51201,\"start\":50798},{\"end\":51430,\"start\":51288},{\"end\":51704,\"start\":51432},{\"end\":51762,\"start\":51706},{\"end\":51869,\"start\":51764},{\"end\":52049,\"start\":51970},{\"end\":52436,\"start\":52088},{\"end\":52573,\"start\":52486},{\"end\":52739,\"start\":52611},{\"end\":52874,\"start\":52842},{\"end\":53041,\"start\":52906},{\"end\":53324,\"start\":53043},{\"end\":55162,\"start\":53326},{\"end\":55360,\"start\":55164},{\"end\":55726,\"start\":55362},{\"end\":56566,\"start\":55728},{\"end\":56689,\"start\":56591},{\"end\":56842,\"start\":56774},{\"end\":57040,\"start\":56919},{\"end\":57490,\"start\":57081},{\"end\":57852,\"start\":57492},{\"end\":57917,\"start\":57874},{\"end\":58961,\"start\":57919},{\"end\":59339,\"start\":58963},{\"end\":59660,\"start\":59341},{\"end\":59875,\"start\":59815},{\"end\":60446,\"start\":59961},{\"end\":60579,\"start\":60479},{\"end\":60738,\"start\":60581},{\"end\":61121,\"start\":60740},{\"end\":61145,\"start\":61123},{\"end\":61426,\"start\":61205},{\"end\":61624,\"start\":61428},{\"end\":61652,\"start\":61626},{\"end\":61902,\"start\":61654},{\"end\":62006,\"start\":61941},{\"end\":62233,\"start\":62094},{\"end\":62543,\"start\":62322},{\"end\":62562,\"start\":62545},{\"end\":62645,\"start\":62564},{\"end\":63022,\"start\":62764},{\"end\":63426,\"start\":63156},{\"end\":63556,\"start\":63527},{\"end\":63668,\"start\":63603},{\"end\":63802,\"start\":63670},{\"end\":64158,\"start\":63804},{\"end\":64284,\"start\":64160},{\"end\":64403,\"start\":64367},{\"end\":65005,\"start\":64645},{\"end\":65491,\"start\":65050},{\"end\":66125,\"start\":65539},{\"end\":66194,\"start\":66127},{\"end\":66501,\"start\":66273},{\"end\":66822,\"start\":66623},{\"end\":66896,\"start\":66859},{\"end\":67038,\"start\":66955},{\"end\":67197,\"start\":67129},{\"end\":67247,\"start\":67199},{\"end\":67430,\"start\":67413},{\"end\":67980,\"start\":67477},{\"end\":68035,\"start\":67982},{\"end\":68501,\"start\":68083},{\"end\":68763,\"start\":68569},{\"end\":69315,\"start\":68820},{\"end\":69615,\"start\":69317},{\"end\":69884,\"start\":69617},{\"end\":70085,\"start\":69909},{\"end\":70208,\"start\":70087},{\"end\":70583,\"start\":70255},{\"end\":70960,\"start\":70585},{\"end\":71473,\"start\":70962},{\"end\":71527,\"start\":71475},{\"end\":71630,\"start\":71600},{\"end\":71668,\"start\":71632},{\"end\":72166,\"start\":71850},{\"end\":72274,\"start\":72168},{\"end\":72954,\"start\":72276},{\"end\":73312,\"start\":73208},{\"end\":73414,\"start\":73314},{\"end\":73874,\"start\":73416},{\"end\":74316,\"start\":74015},{\"end\":74514,\"start\":74389},{\"end\":74791,\"start\":74516},{\"end\":74840,\"start\":74793},{\"end\":75108,\"start\":74938},{\"end\":76060,\"start\":75133},{\"end\":76441,\"start\":76062},{\"end\":76735,\"start\":76443},{\"end\":76936,\"start\":76737},{\"end\":77518,\"start\":76938},{\"end\":77671,\"start\":77520},{\"end\":77879,\"start\":77673},{\"end\":77992,\"start\":77881},{\"end\":78253,\"start\":77994},{\"end\":78480,\"start\":78255},{\"end\":78607,\"start\":78532},{\"end\":79160,\"start\":78720},{\"end\":79457,\"start\":79162},{\"end\":79678,\"start\":79459},{\"end\":79789,\"start\":79680},{\"end\":80430,\"start\":79791},{\"end\":80601,\"start\":80432},{\"end\":80788,\"start\":80603}]", "formula": "[{\"attributes\":{\"id\":\"formula_0\"},\"end\":11119,\"start\":11084},{\"attributes\":{\"id\":\"formula_1\"},\"end\":16722,\"start\":16675},{\"attributes\":{\"id\":\"formula_2\"},\"end\":16920,\"start\":16902},{\"attributes\":{\"id\":\"formula_3\"},\"end\":17587,\"start\":17379},{\"attributes\":{\"id\":\"formula_4\"},\"end\":18272,\"start\":18200},{\"attributes\":{\"id\":\"formula_5\"},\"end\":18433,\"start\":18411},{\"attributes\":{\"id\":\"formula_6\"},\"end\":19294,\"start\":19233},{\"attributes\":{\"id\":\"formula_7\"},\"end\":19370,\"start\":19294},{\"attributes\":{\"id\":\"formula_8\"},\"end\":19818,\"start\":19779},{\"attributes\":{\"id\":\"formula_9\"},\"end\":23168,\"start\":23137},{\"attributes\":{\"id\":\"formula_10\"},\"end\":23477,\"start\":23414},{\"attributes\":{\"id\":\"formula_11\"},\"end\":24609,\"start\":24440},{\"attributes\":{\"id\":\"formula_12\"},\"end\":25006,\"start\":24951},{\"attributes\":{\"id\":\"formula_13\"},\"end\":26038,\"start\":25989},{\"attributes\":{\"id\":\"formula_14\"},\"end\":26071,\"start\":26038},{\"attributes\":{\"id\":\"formula_15\"},\"end\":26769,\"start\":26674},{\"attributes\":{\"id\":\"formula_16\"},\"end\":27690,\"start\":27636},{\"attributes\":{\"id\":\"formula_17\"},\"end\":27915,\"start\":27874},{\"attributes\":{\"id\":\"formula_18\"},\"end\":27975,\"start\":27964},{\"attributes\":{\"id\":\"formula_19\"},\"end\":28136,\"start\":28079},{\"attributes\":{\"id\":\"formula_20\"},\"end\":28294,\"start\":28197},{\"attributes\":{\"id\":\"formula_21\"},\"end\":28845,\"start\":28785},{\"attributes\":{\"id\":\"formula_22\"},\"end\":29220,\"start\":28910},{\"attributes\":{\"id\":\"formula_23\"},\"end\":29499,\"start\":29460},{\"attributes\":{\"id\":\"formula_24\"},\"end\":29656,\"start\":29626},{\"attributes\":{\"id\":\"formula_25\"},\"end\":29795,\"start\":29770},{\"attributes\":{\"id\":\"formula_26\"},\"end\":30855,\"start\":30662},{\"attributes\":{\"id\":\"formula_27\"},\"end\":31112,\"start\":30872},{\"attributes\":{\"id\":\"formula_28\"},\"end\":31273,\"start\":31170},{\"attributes\":{\"id\":\"formula_29\"},\"end\":31435,\"start\":31371},{\"attributes\":{\"id\":\"formula_30\"},\"end\":31592,\"start\":31551},{\"attributes\":{\"id\":\"formula_31\"},\"end\":33039,\"start\":32933},{\"attributes\":{\"id\":\"formula_32\"},\"end\":33861,\"start\":33565},{\"attributes\":{\"id\":\"formula_33\"},\"end\":34961,\"start\":34888},{\"attributes\":{\"id\":\"formula_34\"},\"end\":35301,\"start\":35093},{\"attributes\":{\"id\":\"formula_35\"},\"end\":36047,\"start\":35808},{\"attributes\":{\"id\":\"formula_36\"},\"end\":37062,\"start\":36725},{\"attributes\":{\"id\":\"formula_37\"},\"end\":37435,\"start\":37143},{\"attributes\":{\"id\":\"formula_38\"},\"end\":38297,\"start\":38236},{\"attributes\":{\"id\":\"formula_39\"},\"end\":40115,\"start\":40041},{\"attributes\":{\"id\":\"formula_40\"},\"end\":40564,\"start\":40489},{\"attributes\":{\"id\":\"formula_41\"},\"end\":41844,\"start\":41813},{\"attributes\":{\"id\":\"formula_42\"},\"end\":42649,\"start\":42576},{\"attributes\":{\"id\":\"formula_43\"},\"end\":47369,\"start\":47326},{\"attributes\":{\"id\":\"formula_44\"},\"end\":47838,\"start\":47786},{\"attributes\":{\"id\":\"formula_45\"},\"end\":47961,\"start\":47906},{\"attributes\":{\"id\":\"formula_46\"},\"end\":48539,\"start\":48471},{\"attributes\":{\"id\":\"formula_47\"},\"end\":49937,\"start\":49874},{\"attributes\":{\"id\":\"formula_48\"},\"end\":51287,\"start\":51202},{\"attributes\":{\"id\":\"formula_49\"},\"end\":51969,\"start\":51870},{\"attributes\":{\"id\":\"formula_50\"},\"end\":52087,\"start\":52050},{\"attributes\":{\"id\":\"formula_51\"},\"end\":52485,\"start\":52437},{\"attributes\":{\"id\":\"formula_52\"},\"end\":52610,\"start\":52574},{\"attributes\":{\"id\":\"formula_53\"},\"end\":52841,\"start\":52740},{\"attributes\":{\"id\":\"formula_54\"},\"end\":56590,\"start\":56567},{\"attributes\":{\"id\":\"formula_55\"},\"end\":56773,\"start\":56690},{\"attributes\":{\"id\":\"formula_56\"},\"end\":56918,\"start\":56843},{\"attributes\":{\"id\":\"formula_57\"},\"end\":57873,\"start\":57853},{\"attributes\":{\"id\":\"formula_58\"},\"end\":59814,\"start\":59661},{\"attributes\":{\"id\":\"formula_59\"},\"end\":59960,\"start\":59876},{\"attributes\":{\"id\":\"formula_60\"},\"end\":61204,\"start\":61146},{\"attributes\":{\"id\":\"formula_61\"},\"end\":62093,\"start\":62007},{\"attributes\":{\"id\":\"formula_62\"},\"end\":62321,\"start\":62234},{\"attributes\":{\"id\":\"formula_63\"},\"end\":62763,\"start\":62646},{\"attributes\":{\"id\":\"formula_64\"},\"end\":63155,\"start\":63023},{\"attributes\":{\"id\":\"formula_65\"},\"end\":63526,\"start\":63427},{\"attributes\":{\"id\":\"formula_66\"},\"end\":63602,\"start\":63557},{\"attributes\":{\"id\":\"formula_67\"},\"end\":64366,\"start\":64285},{\"attributes\":{\"id\":\"formula_68\"},\"end\":64644,\"start\":64404},{\"attributes\":{\"id\":\"formula_69\"},\"end\":65049,\"start\":65006},{\"attributes\":{\"id\":\"formula_70\"},\"end\":65538,\"start\":65492},{\"attributes\":{\"id\":\"formula_71\"},\"end\":66272,\"start\":66195},{\"attributes\":{\"id\":\"formula_72\"},\"end\":66622,\"start\":66502},{\"attributes\":{\"id\":\"formula_73\"},\"end\":66858,\"start\":66823},{\"attributes\":{\"id\":\"formula_74\"},\"end\":66954,\"start\":66897},{\"attributes\":{\"id\":\"formula_75\"},\"end\":67128,\"start\":67039},{\"attributes\":{\"id\":\"formula_76\"},\"end\":67412,\"start\":67248},{\"attributes\":{\"id\":\"formula_77\"},\"end\":67476,\"start\":67431},{\"attributes\":{\"id\":\"formula_78\"},\"end\":68082,\"start\":68036},{\"attributes\":{\"id\":\"formula_79\"},\"end\":68568,\"start\":68502},{\"attributes\":{\"id\":\"formula_80\"},\"end\":69908,\"start\":69885},{\"attributes\":{\"id\":\"formula_81\"},\"end\":70254,\"start\":70209},{\"attributes\":{\"id\":\"formula_82\"},\"end\":71599,\"start\":71528},{\"attributes\":{\"id\":\"formula_83\"},\"end\":71822,\"start\":71669},{\"attributes\":{\"id\":\"formula_84\"},\"end\":72981,\"start\":72955},{\"attributes\":{\"id\":\"formula_85\"},\"end\":73044,\"start\":72981},{\"attributes\":{\"id\":\"formula_86\"},\"end\":73207,\"start\":73044},{\"attributes\":{\"id\":\"formula_87\"},\"end\":74014,\"start\":73875},{\"attributes\":{\"id\":\"formula_88\"},\"end\":74388,\"start\":74317},{\"attributes\":{\"id\":\"formula_89\"},\"end\":74922,\"start\":74841},{\"attributes\":{\"id\":\"formula_90\"},\"end\":78531,\"start\":78481},{\"attributes\":{\"id\":\"formula_91\"},\"end\":78719,\"start\":78667}]", "table_ref": null, "section_header": "[{\"attributes\":{\"n\":\"1.\"},\"end\":600,\"start\":588},{\"attributes\":{\"n\":\"2.\"},\"end\":14590,\"start\":14573},{\"attributes\":{\"n\":\"2.3.\"},\"end\":16124,\"start\":16106},{\"attributes\":{\"n\":\"3.\"},\"end\":21127,\"start\":21080},{\"attributes\":{\"n\":\"8\"},\"end\":22194,\"start\":22182},{\"attributes\":{\"n\":\"4.\"},\"end\":29862,\"start\":29850},{\"attributes\":{\"n\":\"4.4.\"},\"end\":31900,\"start\":31891},{\"attributes\":{\"n\":\"5.\"},\"end\":32373,\"start\":32341},{\"attributes\":{\"n\":\"6.\"},\"end\":38778,\"start\":38757},{\"end\":40795,\"start\":40789},{\"attributes\":{\"n\":\"8.\"},\"end\":43706,\"start\":43663},{\"attributes\":{\"n\":\"9.\"},\"end\":52904,\"start\":52877},{\"attributes\":{\"n\":\"10.\"},\"end\":57079,\"start\":57043},{\"attributes\":{\"n\":\"11.\"},\"end\":60477,\"start\":60449},{\"attributes\":{\"n\":\"11.2.\"},\"end\":61939,\"start\":61905},{\"attributes\":{\"n\":\"12.\"},\"end\":68818,\"start\":68766},{\"attributes\":{\"n\":\"13.\"},\"end\":71848,\"start\":71824},{\"end\":74936,\"start\":74924},{\"attributes\":{\"n\":\"14.\"},\"end\":75131,\"start\":75111},{\"end\":78666,\"start\":78610},{\"end\":80878,\"start\":80860},{\"end\":81660,\"start\":81646},{\"end\":81855,\"start\":81841},{\"end\":82149,\"start\":82143},{\"end\":83297,\"start\":83279},{\"end\":84056,\"start\":84037},{\"end\":84610,\"start\":84595},{\"end\":84752,\"start\":84738},{\"end\":84943,\"start\":84924}]", "table": "[{\"end\":87583,\"start\":86978},{\"end\":88003,\"start\":87666}]", "figure_caption": "[{\"end\":80858,\"start\":80791},{\"end\":81030,\"start\":80880},{\"end\":81239,\"start\":81033},{\"end\":81644,\"start\":81242},{\"end\":81839,\"start\":81662},{\"end\":82141,\"start\":81857},{\"end\":82390,\"start\":82151},{\"end\":83277,\"start\":82393},{\"end\":83435,\"start\":83301},{\"end\":83793,\"start\":83438},{\"end\":84035,\"start\":83796},{\"end\":84593,\"start\":84059},{\"end\":84736,\"start\":84614},{\"end\":84864,\"start\":84756},{\"end\":84922,\"start\":84867},{\"end\":85157,\"start\":84945},{\"end\":85360,\"start\":85160},{\"end\":86775,\"start\":85363},{\"end\":86978,\"start\":86778},{\"end\":87666,\"start\":87586},{\"end\":88291,\"start\":88006},{\"end\":91037,\"start\":88294}]", "figure_ref": "[{\"end\":45139,\"start\":45126},{\"end\":66446,\"start\":66437}]", "bib_author_first_name": "[{\"end\":91080,\"start\":91079},{\"end\":91082,\"start\":91081},{\"end\":91373,\"start\":91372},{\"end\":91375,\"start\":91374},{\"end\":91388,\"start\":91387},{\"end\":91390,\"start\":91389},{\"end\":91600,\"start\":91599},{\"end\":91602,\"start\":91601},{\"end\":91611,\"start\":91610},{\"end\":91625,\"start\":91624},{\"end\":91627,\"start\":91626},{\"end\":91819,\"start\":91818},{\"end\":91821,\"start\":91820},{\"end\":91830,\"start\":91829},{\"end\":91832,\"start\":91831},{\"end\":92009,\"start\":92008},{\"end\":92011,\"start\":92010},{\"end\":92020,\"start\":92019},{\"end\":92022,\"start\":92021},{\"end\":92241,\"start\":92240},{\"end\":92243,\"start\":92242},{\"end\":92252,\"start\":92251},{\"end\":92254,\"start\":92253},{\"end\":92505,\"start\":92504},{\"end\":92507,\"start\":92506},{\"end\":92516,\"start\":92515},{\"end\":92518,\"start\":92517},{\"end\":92525,\"start\":92524},{\"end\":92527,\"start\":92526},{\"end\":92778,\"start\":92777},{\"end\":92780,\"start\":92779},{\"end\":92789,\"start\":92788},{\"end\":93020,\"start\":93019},{\"end\":93022,\"start\":93021},{\"end\":93032,\"start\":93031},{\"end\":93034,\"start\":93033},{\"end\":93194,\"start\":93193},{\"end\":93330,\"start\":93329},{\"end\":93481,\"start\":93480},{\"end\":93483,\"start\":93482},{\"end\":93641,\"start\":93640},{\"end\":93643,\"start\":93642},{\"end\":93780,\"start\":93779},{\"end\":93782,\"start\":93781},{\"end\":93968,\"start\":93967},{\"end\":93970,\"start\":93969},{\"end\":94147,\"start\":94146},{\"end\":94149,\"start\":94148},{\"end\":94290,\"start\":94289},{\"end\":94292,\"start\":94291},{\"end\":94434,\"start\":94433},{\"end\":94565,\"start\":94564},{\"end\":94567,\"start\":94566}]", "bib_author_last_name": "[{\"end\":91091,\"start\":91083},{\"end\":91385,\"start\":91376},{\"end\":91394,\"start\":91391},{\"end\":91608,\"start\":91603},{\"end\":91622,\"start\":91612},{\"end\":91631,\"start\":91628},{\"end\":91827,\"start\":91822},{\"end\":91836,\"start\":91833},{\"end\":92017,\"start\":92012},{\"end\":92026,\"start\":92023},{\"end\":92249,\"start\":92244},{\"end\":92258,\"start\":92255},{\"end\":92513,\"start\":92508},{\"end\":92522,\"start\":92519},{\"end\":92534,\"start\":92528},{\"end\":92786,\"start\":92781},{\"end\":92799,\"start\":92790},{\"end\":93029,\"start\":93023},{\"end\":93042,\"start\":93035},{\"end\":93201,\"start\":93195},{\"end\":93341,\"start\":93331},{\"end\":93491,\"start\":93484},{\"end\":93651,\"start\":93644},{\"end\":93786,\"start\":93783},{\"end\":93978,\"start\":93971},{\"end\":94157,\"start\":94150},{\"end\":94298,\"start\":94293},{\"end\":94440,\"start\":94435},{\"end\":94576,\"start\":94568}]", "bib_entry": "[{\"attributes\":{\"id\":\"b0\"},\"end\":91370,\"start\":91039},{\"attributes\":{\"id\":\"b1\"},\"end\":91597,\"start\":91372},{\"attributes\":{\"id\":\"b2\"},\"end\":91773,\"start\":91599},{\"attributes\":{\"id\":\"b3\",\"matched_paper_id\":50248128},\"end\":91948,\"start\":91775},{\"attributes\":{\"id\":\"b4\",\"matched_paper_id\":122235030},\"end\":92153,\"start\":91950},{\"attributes\":{\"id\":\"b5\",\"matched_paper_id\":119107189},\"end\":92439,\"start\":92155},{\"attributes\":{\"id\":\"b6\",\"matched_paper_id\":121582667},\"end\":92735,\"start\":92441},{\"attributes\":{\"id\":\"b7\",\"matched_paper_id\":226211168},\"end\":93017,\"start\":92737},{\"attributes\":{\"id\":\"b8\"},\"end\":93151,\"start\":93019},{\"attributes\":{\"id\":\"b9\"},\"end\":93327,\"start\":93153},{\"attributes\":{\"id\":\"b10\"},\"end\":93455,\"start\":93329},{\"attributes\":{\"id\":\"b11\"},\"end\":93603,\"start\":93457},{\"attributes\":{\"id\":\"b12\",\"matched_paper_id\":13511088},\"end\":93777,\"start\":93605},{\"attributes\":{\"id\":\"b13\"},\"end\":93944,\"start\":93779},{\"attributes\":{\"id\":\"b14\",\"matched_paper_id\":242506270},\"end\":94118,\"start\":93946},{\"attributes\":{\"id\":\"b15\",\"matched_paper_id\":15525641},\"end\":94250,\"start\":94120},{\"attributes\":{\"id\":\"b16\"},\"end\":94395,\"start\":94252},{\"attributes\":{\"id\":\"b17\",\"matched_paper_id\":119490176},\"end\":94528,\"start\":94397},{\"attributes\":{\"id\":\"b18\",\"matched_paper_id\":122558925},\"end\":94677,\"start\":94530}]", "bib_title": "[{\"end\":91077,\"start\":91039},{\"end\":91816,\"start\":91775},{\"end\":92006,\"start\":91950},{\"end\":92238,\"start\":92155},{\"end\":92502,\"start\":92441},{\"end\":92775,\"start\":92737},{\"end\":93191,\"start\":93153},{\"end\":93478,\"start\":93457},{\"end\":93638,\"start\":93605},{\"end\":93965,\"start\":93946},{\"end\":94144,\"start\":94120},{\"end\":94431,\"start\":94397},{\"end\":94562,\"start\":94530}]", "bib_author": "[{\"end\":91093,\"start\":91079},{\"end\":91387,\"start\":91372},{\"end\":91396,\"start\":91387},{\"end\":91610,\"start\":91599},{\"end\":91624,\"start\":91610},{\"end\":91633,\"start\":91624},{\"end\":91829,\"start\":91818},{\"end\":91838,\"start\":91829},{\"end\":92019,\"start\":92008},{\"end\":92028,\"start\":92019},{\"end\":92251,\"start\":92240},{\"end\":92260,\"start\":92251},{\"end\":92515,\"start\":92504},{\"end\":92524,\"start\":92515},{\"end\":92536,\"start\":92524},{\"end\":92788,\"start\":92777},{\"end\":92801,\"start\":92788},{\"end\":93031,\"start\":93019},{\"end\":93044,\"start\":93031},{\"end\":93203,\"start\":93193},{\"end\":93343,\"start\":93329},{\"end\":93493,\"start\":93480},{\"end\":93653,\"start\":93640},{\"end\":93788,\"start\":93779},{\"end\":93980,\"start\":93967},{\"end\":94159,\"start\":94146},{\"end\":94300,\"start\":94289},{\"end\":94442,\"start\":94433},{\"end\":94578,\"start\":94564}]", "bib_venue": "[{\"end\":91180,\"start\":91152},{\"end\":91136,\"start\":91093},{\"end\":91442,\"start\":91396},{\"end\":91665,\"start\":91633},{\"end\":91846,\"start\":91838},{\"end\":92036,\"start\":92028},{\"end\":92281,\"start\":92260},{\"end\":92571,\"start\":92536},{\"end\":92844,\"start\":92801},{\"end\":93070,\"start\":93044},{\"end\":93212,\"start\":93203},{\"end\":93375,\"start\":93343},{\"end\":93514,\"start\":93493},{\"end\":93662,\"start\":93653},{\"end\":93828,\"start\":93788},{\"end\":94008,\"start\":93980},{\"end\":94173,\"start\":94159},{\"end\":94287,\"start\":94252},{\"end\":94450,\"start\":94442},{\"end\":94590,\"start\":94578}]"}}}, "year": 2023, "month": 12, "day": 17}