{"id": 11469104, "updated": "2023-09-27 05:39:17.614", "metadata": {"title": "Parcellating Cortical Functional Networks in Individuals", "authors": "[{\"first\":\"Danhong\",\"last\":\"Wang\",\"middle\":[]},{\"first\":\"Randy\",\"last\":\"Buckner\",\"middle\":[\"L.\"]},{\"first\":\"Michael\",\"last\":\"Fox\",\"middle\":[\"D.\"]},{\"first\":\"Daphne\",\"last\":\"Holt\",\"middle\":[\"J.\"]},{\"first\":\"Avram\",\"last\":\"Holmes\",\"middle\":[\"J.\"]},{\"first\":\"Sophia\",\"last\":\"Stoecklein\",\"middle\":[]},{\"first\":\"Georg\",\"last\":\"Langs\",\"middle\":[]},{\"first\":\"Ruiqi\",\"last\":\"Pan\",\"middle\":[]},{\"first\":\"Tianyi\",\"last\":\"Qian\",\"middle\":[]},{\"first\":\"Kuncheng\",\"last\":\"Li\",\"middle\":[]},{\"first\":\"Justin\",\"last\":\"Baker\",\"middle\":[\"T.\"]},{\"first\":\"Steven\",\"last\":\"Stufflebeam\",\"middle\":[\"M.\"]},{\"first\":\"Kai\",\"last\":\"Wang\",\"middle\":[]},{\"first\":\"Xiaomin\",\"last\":\"Wang\",\"middle\":[]},{\"first\":\"Bo\",\"last\":\"Hong\",\"middle\":[]},{\"first\":\"Hesheng\",\"last\":\"Liu\",\"middle\":[]}]", "venue": "Nature neuroscience", "journal": "Nature neuroscience", "publication_date": {"year": 2015, "month": 10, "day": 23}, "abstract": "The capacity to identify the unique functional architecture of an individual’s brain is a critical step towards personalized medicine and understanding the neural basis of variations in human cognition and behavior. Here, we developed a novel cortical parcellation approach to accurately map functional organization at the individual level using resting-state fMRI. A population-based functional atlas and a map of inter-individual variability were employed to guide the iterative search for functional networks in individual subjects. Functional networks mapped by this approach were highly reproducible within subjects and effectively captured the variability across subjects, including individual differences in brain lateralization. The algorithm performed well across different subject populations and data types including task fMRI data. The approach was then validated by invasive cortical stimulation mapping in surgical patients, suggesting great potential for use in clinical applications.", "fields_of_study": "[\"Medicine\"]", "external_ids": {"arxiv": null, "mag": "2212967118", "acl": null, "pubmed": "26551545", "pubmedcentral": "4661084", "dblp": null, "doi": "10.1038/nn.4164"}}, "content": {"source": {"pdf_hash": "28b007a2eaf2ba3e496493d72f9e88ff1127b69f", "pdf_src": "PubMedCentral", "pdf_uri": null, "oa_url_match": false, "oa_info": {"license": "implied-oa", "open_access_url": "https://europepmc.org/articles/pmc4661084?pdf=render", "status": "GREEN"}}, "grobid": {"id": "c23d5a9ce822f363f6904bfca84f460fd9ad0090", "type": "plain-text", "url": "s3://ai2-s2-pdf-extraction-prod/parse-results/s2orc_worker/28b007a2eaf2ba3e496493d72f9e88ff1127b69f.txt", "contents": "\nParcellating Cortical Functional Networks in Individuals\n\n\nDanhong Wang \nAthinoula A. Martinos Center for Biomedical Imaging\nDepartment of Radiology\nMassachusetts General Hospital\nHarvard Medical School\nCharlestownMAUSA\n\nDepartment of Psychiatry\nMassachusetts General Hospital\nHarvard Medical School\nBostonMAUSA\n\nRandy L Buckner \nAthinoula A. Martinos Center for Biomedical Imaging\nDepartment of Radiology\nMassachusetts General Hospital\nHarvard Medical School\nCharlestownMAUSA\n\nDepartment of Psychiatry\nMassachusetts General Hospital\nHarvard Medical School\nBostonMAUSA\n\nDepartment of Psychology\nCenter for Brain Science\nHarvard University\nCambridgeMAUSA\n\nMichael D Fox \nAthinoula A. Martinos Center for Biomedical Imaging\nDepartment of Radiology\nMassachusetts General Hospital\nHarvard Medical School\nCharlestownMAUSA\n\nBerenson-Allen Center for Noninvasive Brain Stimulation\nDepartment of Neurology\nBeth Israel Deaconess Medical Center\nHarvard Medical School\nBostonMAUSA\n\nDepartment of Neurology\nMassachusetts General Hospital\nHarvard Medical School\nBostonMAUSA\n\nDaphne J Holt \nAthinoula A. Martinos Center for Biomedical Imaging\nDepartment of Radiology\nMassachusetts General Hospital\nHarvard Medical School\nCharlestownMAUSA\n\nDepartment of Psychiatry\nMassachusetts General Hospital\nHarvard Medical School\nBostonMAUSA\n\nAvram J Holmes \nDepartment of Psychiatry\nMassachusetts General Hospital\nHarvard Medical School\nBostonMAUSA\n\nDepartment of Psychology\nYale University\nNew HavenCTUSA\n\nSophia Stoecklein \nAthinoula A. Martinos Center for Biomedical Imaging\nDepartment of Radiology\nMassachusetts General Hospital\nHarvard Medical School\nCharlestownMAUSA\n\nInstitute of Clinical Radiology\nLudwig Maximilians University Munich\nMunichGermany\n\nGeorg Langs \nComputational Imaging Research Lab\nDepartment of Biomedical Imaging and Image-guided Therapy\nMedical University of Vienna\nAustria\n\nComputer Science and Artificial Intelligence Lab\nMassachusetts Institute of Technology\nCambridgeMAUSA\n\nRuiqi Pan \nAthinoula A. Martinos Center for Biomedical Imaging\nDepartment of Radiology\nMassachusetts General Hospital\nHarvard Medical School\nCharlestownMAUSA\n\nTianyi Qian \nAthinoula A. Martinos Center for Biomedical Imaging\nDepartment of Radiology\nMassachusetts General Hospital\nHarvard Medical School\nCharlestownMAUSA\n\nDepartment of Biomedical Engineering\nSchool of Medicine\nTsinghua University\nBeijingChina\n\nSiemens Healthcare\nMR Collaboration NE Asia\nBeijingChina\n\nKuncheng Li \nDepartment of Radiology\nXuanwu Hospital\nCapital Medical University\nBeijingChina\n\nJustin T Baker \nDepartment of Psychiatry\nMassachusetts General Hospital\nHarvard Medical School\nBostonMAUSA\n\nPsychotic Disorders Division\nth St\nAthinoula A. Martinos Center for Biomedical Imaging\nMcLean Hospital\nBelmontMAUSA\n\nDepartment of Biomedical Engineering\nSchool of Medicine\nMassachusetts General Hospital\n02129CharlestownMA\n\nCOMPETING FINANCIAL INTERESTS\nTsinghua University\n100084BeijingChina\n\nSteven M Stufflebeam \nAthinoula A. Martinos Center for Biomedical Imaging\nDepartment of Radiology\nMassachusetts General Hospital\nHarvard Medical School\nCharlestownMAUSA\n\nInstitute for Medical Engineering and Science\nHarvard-MIT Health Sciences and Technology\nCambridgeMAUSA\n\nKai Wang \nDepartment of Neurology, the First Affiliated Hospital of Anhui Medical University\nHefeiChina\n\nXiaomin Wang \nBeijing Institute for Brain Disorders\nCapital Medical University\nBeijingChina\n\nBo Hong hongbo@tsinghua.edu.cn \nDepartment of Biomedical Engineering\nSchool of Medicine\nTsinghua University\nBeijingChina\n\nHesheng Liu hesheng@nmr.mgh.harvard.edu \nAthinoula A. Martinos Center for Biomedical Imaging\nDepartment of Radiology\nMassachusetts General Hospital\nHarvard Medical School\nCharlestownMAUSA\n\nDepartment of Psychiatry\nMassachusetts General Hospital\nHarvard Medical School\nBostonMAUSA\n\nDrBo Hong \nH L \nD W \nR L B \nM D F \nParcellating Cortical Functional Networks in Individuals\n10.1038/nn.4164Users may view, print, copy, and download text and data-mine the content in such documents, for the purposes of academic research, subject always to the full Conditions of use: Address Correspondence To: Dr. Hesheng Liu, Suite 2301, 149 13\n\n\nINTRODUCTION\n\nThe human cerebral cortex is organized into areas based on distinct features such as cytoarchitecture or topography (e.g., 1 -4 ). These brain areas contribute specialized functions that interact as part of distributed networks 1 , 5 -7 . Recent advances in non-invasive neuroimaging techniques, especially the emergence of functional connectivity MRI 8 , 9 , have made it possible to explore the functional organization of regions and networks in the living human brain 10 -15 . Initial work has revealed a number of complexities including aspects of organization that respect traditional notions of brain areas, as well as network organization that has organizational properties that span and split areas. Further, there are individual differences in organization that are distributed non-uniformly across the cortex. Obtaining functional atlases at the level of the individual person is a critical step towards understanding the anatomy-function association in the human brain and the stability of this relationship across individuals 16 .\n\nThe capacity to identify the unique functional architecture of an individual's brain is particularly important for personalized medicine. Clinical and imaging studies, including those employing invasive functional mapping techniques, have demonstrated marked interindividual variability in the organization of different functional systems of the brain 17 -19 .\n\nLocalizing functional architecture in a particular subject is therefore a fundamental requirement in clinical procedures such as surgical planning 20 and brain stimulation therapies 21 , 22 . However, non-invasive functional mapping techniques are generally limited in accuracy and reliability at the single-subject level 23 . To date, precise functional mapping in individual patients still heavily relies on invasive measures.\n\nIndividual-level functional mapping is also essential for the investigation of variations in human behavior and cognition. Functional imaging studies of individual differences commonly use regions of interest (ROIs) defined by anatomy or by population-averaged fMRI studies 24 . To improve specificity, individual-level ROIs can be defined using a taskbased functional localizer 25 (see 26 ). Recently, increased effort has been devoted to developing methods for parcellating functional networks in individual subjects based on resting-state connectivity 14 , 16 , 27 -30 . An individual-level functional parcellation can be used not only as the \"localizer\" for specific functions, but can also provide a basis for crosssubject alignment according to functional characteristics, instead of macroscopic anatomical landmarks, to improve group-level analyses.\n\nAchieving individual-level precision is thus a major goal of neuroimaging. Specifically, to be clinically useful, a non-invasive functional mapping technology must fulfill the following criteria: 1) it should have high reproducibility within subjects; 2) it should be sensitive to functional differences between subjects; and 3) it should match results derived from invasive cortical stimulation, currently considered the gold standard for individual-level functional mapping. Based on these criteria, here we develop a novel approach for individual-level functional parcellation based on functional connectivity, which can be applied to either resting-state fMRI data or spontaneous activity extracted from task fMRI data. Test-retest reliability of the parcellation and its sensitivity to individual differences were evaluated on multiple datasets. Validity of the network parcellation was then examined in a group of surgical patients who underwent invasive cortical stimulation.\n\nThe parcellation strategy is described below (see Figure 1).\n\nStep 1-A functional cortical atlas consisting of 18 networks was first estimated based on 1,000 healthy subjects 10 and projected onto the individual subject's cortical surface using the FreeSurfer software (see ONLINE METHODS). The individual subject's blood oxygenation level-dependent (BOLD) fMRI signal time courses were then averaged across the vertices that fell within each network. These atlas-based network time courses were used as the \"reference signals\" for the subsequent optimization procedure.\n\nStep 2-The individual subject's functional MRI signal at each vertex was then correlated to the 18 \"reference signals\" derived from the previous step. Each vertex was reassigned to one of the 18 networks according to its maximal correlation to the \"reference signals\". A confidence value was also computed as the ratio between the largest and the second largest correlation values. For example, if a vertex had the strongest correlation with the \"reference signal\" of network A with a correlation coefficient of 0.8, and had the second strongest correlation with the network B with a correlation coefficient of 0.4, then the confidence that this vertex belongs to network A was 0.8/0.4=2. After all vertices were reassigned to one of the 18 networks with a certain confidence level, in each network the BOLD signals of vertices with a confidence value greater than a preselected threshold (e.g., >1.1) were averaged and termed the \"core signal\". Several parameters were computed for each network, including the pre-estimated inter-subject variability in functional connectivity 31 and temporal signal-to-noise ratio (SNR), which were normalized and averaged across the vertices where the confidence values exceeded the given threshold.\n\nStep 3-For each network, the \"core signal\" derived from Step 2 and the original \"reference signals \" derived from Step 1 were averaged in a weighted manner. Before averaging, the \"core signal\" was multiplied by the weighting parameters computed in Step 2, including inter-subject variability, SNR, and the number of iterations. The resulting signal estimate was used as the new \"reference signal\" for the next iteration. This weighting strategy ensured that the original atlas-based \"reference signal\" was weighted less compared to the \"core signal\" in regions of high inter-subject variability and regions of high SNR, and gradually reduced its weight as the iteration proceeded. Using these new \"reference signals\" which incorporated both the individual subject's information and the information of the population atlas, the brain vertices were further reassigned to one of the 18 networks.\n\nStep 4-Steps 2 & 3 were iterated until the algorithm reached a pre-defined stopping criterion, e.g., the procedure was stopped if network membership remained the same for 98% of the vertices in two consecutive iterations or if it reached a predetermined number of iterations.\n\n\nRESULTS\n\n\nMaps are Reliable and Capture Inter-subject Variability\n\nThe parcellation technique was first applied to a longitudinal dataset consisting of 23 subjects who were scanned five times within a period of six months (Dataset I). During the iterative search, the boundaries of the functional networks were gradually refined according to the connectivity patterns estimated in individual data but guided by the population-atlas (see Supplementary Fig. 1 for an example showing the intermediate results after each iteration). In general, vertices in the primary visual and sensorimotor regions showed relatively stable network membership assignment over the iterations. However, vertices in the association cortices showed greater adjustment during the optimization process.\n\nWithin each subject, the resulting functional atlases converged to be visually consistent across the five sessions, both in the primary sensorimotor regions and the higher order association regions ( Figure 2). Quantitative analyses indicated high intra-subject reproducibility across the five sessions (mean Dice coefficient = 83%). At the same time, functional maps varied substantially across different individuals (mean Dice coefficient = 67%), especially in the higher-order association regions. These results indicate that the iterative parcellation technique is able to obtain reliable functional networks within the same person, and can reflect the network distribution differences between individuals (see also Supplementary Fig. 2 for the maps of three subjects who demonstrated high, median, and low reproducibility across sessions). Most critically, each individual brain had unique features.\n\n\nParcellation Is Widely Applicable to Different Data Types\n\nTo objectively examine the performance of the iterative parcellation, quantitative analyses of the test-retest reliability and sensitivity to individual differences were performed in a population independent from Dataset I that was involved in the algorithm development. MRI data of 100 unrelated subjects publicly available from the Human Connectome Project (HCP; Dataset II) were used for this replication purpose. This cohort was substantially different from Dataset I in terms of age, data acquisition length, ethnicity, scanner type and scanning protocol. Each subject performed two resting-state fMRI (rs-fMRI) sessions and seven task fMRI (tfMRI) sessions (see ONLINE METHODS). The two rs-fMRI sessions of each subject were conducted on two separate days; thus, they could be employed to evaluate the test-retest reliability of the network parcellation.\n\nIntra-subject reliability and inter-subject variability were both measured using the Dice coefficient after each iteration (Figure 3a). Because the algorithm was initialized with the population-based atlas, intra-subject reliability was 1 and inter-subject variability was 0 at the beginning. As the iterative procedure progressed, inter-subject variability increased while intra-subject reliability decreased, but both stabilized after several iterations (see also Supplementary Fig. 3 for the spatial distributions of vertex-wise reliability and variability after different numbers of iteration).\n\nThe iterative parcellation technique showed good generalizability in this independent dataset. Functional maps derived from the two rs-fMRI sessions were highly consistent within subjects (see Figure 3b for the maps of three randomly selected subjects, results of the 100 subjects can be downloaded from: http://nmr.mgh.harvard.edu/bid/download.html).\n\nComparing two rs-fMRI sessions of the same subject, the Dice coefficient was 82.4% ± 3.2%. Critically, the maps also demonstrated substantial inter-subject variability. Between any two individuals, the Dice coefficient was only 60.5% ± 2.8% (corresponding to intersubject variability of 39.5%). The intra-subject consistency of network membership was significantly higher than the inter-subject consistency (unpaired two-tailed t-test, t(5048) = 91.0, p < 0.001, Figure 3c).\n\nAn important question is whether the iterative parcellation technique can be applied to the task fMRI data that are widely available. Given that numerous task fMRI datasets already exist 32 and task fMRI is routinely performed for preoperative mapping in many hospitals, the practical value of this iterative parcellation technique will be greatly enhanced if this technique can be directly applied to task data. To test this possibility, the task-based fMRI data of the 100 HCP subjects were bandpass filtered (0.01 -0.08 Hz) and processed in the same way as the resting-state data. Parcellation can be derived from the data of a single task but is less reliable due to limited data acquisition length (see Supplementary Fig. 4 for the parcellation maps derived from single-task data, see ONLINE METHODS for the data acquisition length of each task). The data of different tasks were therefore concatenated within each subject to increase the amount of data per subject and to minimize the impact of any specific task design on the connectivity estimates 33 , 34 . For each individual subject, iterative parcellation was performed on the concatenated task fMRI data, as well as on the concatenated resting-state data (see Figure 3d for the maps of three exemplary subjects). Parcellation results based on the task fMRI data and the resting-state data were similar (Dice coefficient = 81.7% ± 4.0%). The consistency between the rest-and task-based parcellation maps was as high as the reproducibility between two resting-state sessions (paired two-tailed t-test, t(99) =1.76, p = 0.08; see Figure 3c). These results suggest the feasibility of obtaining whole-brain functional atlases of individual subjects from task fMRI data.\n\n\nBrain Lateralization Is Reflected in Network Parcellation\n\nHemispheric lateralization is an important organizational principle of the human brain and a potential marker of individual differences in brain development 35 . Here we quantified the laterality of network distribution in individual subjects. For each network, a laterality index (LI) was computed based on the count of vertices in the left hemisphere and the count in the right hemisphere (see ONLINE METHODS for the definition of LI). Among the 18 networks that resulted from the iterative parcellation, we identified two networks that demonstrated strong asymmetry. The most left-lateralized network (LI = 0.22 ± 0.08, positive LI values indicate left-lateralization) included the inferior frontal gyrus and the temporal parietal junction -traditional language regions (Figure 4a). Among the 100 subjects, only a few subjects demonstrated atypical right lateralization of this network (see Figure 4a for the histogram of LI). The most right-lateralized network (LI = −0.13 ± 0.09) included the insula and the angular gyrus -traditional ventral attention regions 36 . Lateralization of these two networks showed moderate test-retest reliability (see Supplementary Fig. 5). To directly examine the relationship between the left-lateralized parcellation network and language function, we mapped the regions showing activation (at a z-threshold of Z > 1.96, corresponding to uncorrected, two-tailed p-threshold of p < 0.05) during a story comprehension task 37 . At the group level, 71.2% of the vertices in the leftlateralized parcellation network fell within the regions showing language-related activation (Figure 4b), suggesting that this left-lateralized network is related to language function.\n\nFinally, we investigated the effect of handedness on functional network laterality in 52 lefthanded and 52 matched right-handed individuals (Dataset III). These subjects were matched in terms of age, gender, ethnicity, education, fMRI data acquisition, data quality and other parameters (see Supplemental Table S1 for the matching criteria and participant demographics). Iterative parcellation was applied to each individual subject to identify the 18 networks. Again, the language-related network and the ventral attention-related network showed the strongest lateralization in both groups. Compared to left-handed subjects, righthanded subjects showed a trend for stronger lateralization in the language-related network (mean LI 0.20 vs 0.16, unpaired two-tailed t-test, t(102) = 1.9, p = 0.057), and significantly stronger lateralization in the ventral attention-related network (mean LI −0.14 vs −0.07, unpaired two-tailed t-test, t(102) = 3.1, p = 0.003, Figure 4c).\n\n\nComparing Parcellation Networks with Task fMRI\n\nThe reliability of task-evoked response in individual subjects is affected by many factors some of which extend to analysis of resting-state networks as well as other factors that are preferential to task fMRI 38 . Many studies have used task fMRI activation maps to validate or evaluate the accuracy of results derived from resting-state fMRI. Here, we quantified the intra-subject reliability of task fMRI activation maps and the functional networks derived from the iterative parcellation. For this investigation, two brain functions that are routinely examined in preoperative mapping, motor and language functions, were assessed in the 100 HCP subjects. The hand motor network and the language network of each individual subject were localized by conventional task-evoked responses and by iterative network parcellation.\n\nTask-evoked responses were estimated using single task runs and showed a range of low to high reliability across two runs within the same subject. Reliability was evaluated using the Dice coefficient across a variety of thresholds (from Z = 1.96 to Z = 10.0 in 0.1 increments). The maximum reliability was 40.4% (when Z = 6.76) for the motor task and 34.4% (when Z = 1.96) for the language task. Iterative parcellation was then performed on short resting-state data segments, with length matched to the motor and language task runs (i.e., 3m 34s and 3m 57s, respectively). Compared to the task-evoked responses, the iterative parcellation yielded higher reproducibility across two runs (paired two-tailed t-test, t(99) = 11.2, p < 0.001, for the hand motor network; paired two-tailed t-test, t(99) = 21.9, p < 0.001 for the language network), with a Dice coefficient of 66.6% ± 10.2% for the hand motor network and a Dice coefficient of 61.5% ± 9.1% for the language networks. While the task data analyzed here reflect only a subset of possible tasks and range of data quality that could be explored, it is notable that the present iterative parcellation approach performed comparably and in many individuals better than traditional task-based analysis.\n\n\nValidation Using Electrical Cortical Stimulation (ECS)\n\nTo further validate the results derived from the iterative parcellation approach, we employed a clinical dataset consisting of eight surgical patients who performed a battery of motor tasks in MRI prior to surgery (Dataset IV). Resting-state data were also collected in six of the eight patients. Their hand and tongue sensorimotor regions were localized using ECS, which is the current gold standard for preoperative functional mapping. This unique dataset provided an opportunity to evaluate the clinical applicability of the iterative parcellation technique. Parcellation was performed in each individual patient based on the motor task fMRI data that were bandpass filtered (0.01-0.08 Hz) and processed in the same way as in the 100 HCP subjects. The hand and tongue regions were also mapped using the traditional task activation approach for comparison.\n\nSensorimotor regions identified by ECS were used as references (Figure 5a), where the red dots on the ECS maps indicated negative electrodes (no symptoms related to the sensorimotor cortex were reported when stimulated) and the yellow dots indicated positive electrodes. Motor and sensory regions identified by traditional task activation showed low consistency with the ECS maps ( Figure 5b). In contrast, the sensorimotor regions identified by iterative parcellation were more consistent with the ECS maps (Figure 5c), suggesting that the iterative parcellation technique was valid and could serve as a prescreening method for ECS (see Supplementary Fig. 6 for the results of all eight subjects; the subject shown in Figure 5a was Patient 2 in Supplementary Fig. 6). In addition, a parcellation map of multiple functional networks with confidence values greater than a predetermined threshold (e.g., 1.1) can provide a rough estimate of the regions of interest for invasive cortical stimulation (Figure 5d), potentially shortening the stimulation procedure.\n\nTo objectively assess the potential of our parcellation technique in preoperative mapping, the sensitivity and specificity of the hand and tongue sensorimotor maps in 8 surgical patients were statistically measured across different confidence thresholds. Sensitivity and specificity of the task fMRI were also computed by varying the t-value thresholds of the task activation.\n\nIn addition, we masked the task activation maps using the pre-central and post-central gyri labels generated by FreeSurfer to improve specificity. This operation mimics the procedure of human experts, who usually disregard the noisy activation responses outside of the regions of interest. Receiver operating characteristic (ROC) curves were then plotted for the iterative parcellation algorithm (Figure 5e, green curve), traditional task-activation mapping alone (purple curve) and task-activation masked with anatomical labels (red curve). The iterative parcellation technique significantly outperformed the other two task-based methods and showed significantly larger area under the curve (AUC, p = 0.008 and p = 0.015, Wilcoxon rank sum test; AUC of iterative parcellation = 0.91, AUC of task fMRI = 0.76, AUC of task fMRI masked with anatomical labels = 0.78).\n\nThe iterative parcellation was then applied to the pure resting-state data in six patients \n\n\nDISCUSSION\n\nIn this study we present a novel approach for parcellating functional networks across the cerebral cortex in individuals based on functional connectivity. Each individual brain had unique features. Parcellation networks were reproducible within subjects across multiple scans and could capture inter-individual differences in functional organization, including variability in brain lateralization. We found that this approach can be applied to various populations and can be extended to task fMRI data. Using invasive cortical stimulation as the gold standard, the sensitivity and specificity of iterative functional parcellation were evaluated in surgical patients and compared to that of conventional task fMRI. Our results indicate that the individual cortical parcellation technique can correctly localize functional networks in individual subjects and has potential for use in clinical applications.\n\n\nRevealing Individual Variability in Brain Organization\n\nInter-individual variability in human brain organization has long been studied 39 . However, systematic in vivo research on the variability in the functional organization of the human brain, especially in the patterns of connectivity, has just begun. Variability in functional connectivity has been related to individual differences in human behavior and cognition, such as IQ, musical ability and reading ability 24 . Brain changes associated with neurological and psychiatric disorders are also reflected by variations in functional connectivity 40 .\n\nRecent explorations of resting-state functional connectivity in healthy humans have suggested that association regions (including the language, executive control, and attention networks) present with particularly strong variability that may relate to individual differences in behavior 31 , 41 . Substantial inter-individual variability in functional organization calls for imaging techniques that can precisely capture the functional characteristics of each subject. To enable functional analyses at the individual-level, Carddock et al. parcellated rs-fMRI data into functionally and spatially coherent regions-ofinterest (ROIs) that tended to be equally sized 30 . Arslan et al. proposed a cortical parcellation method based on spectral graph theory and were able to obtain reliable results at the group level. However, inter-subject variability was underestimated and the method aimed to identify a group-wise parcellation that can represent each subject in the group 42 . Goulas et al. parcellated the lateral frontal cortex using a module detection algorithm and demonstrated inter-subject variability in these modules; however, intra-subject reliability was not evaluated at the same time 29 . Using a region growing method, Blumensath et al.\n\nmapped functional networks in individual subjects with high reproducibility 28 and found that functional connectivity network boundaries might overlap with task activations. These technical developments are important and merit future validation, especially based on invasive measures. A precise parcellation technique with high sensitivity to individual variations will facilitate discovery of meaningful biomarkers for cognitive ability or disease states, and will provide increased statistical power for investigating behavioral or genetic associations.\n\n\nImplications for Clinical Intervention\n\nAn individual-level functional atlas has strong implications for clinical practice, especially for surgical planning and brain stimulation that depend on precise functional localization. Current preoperative mapping with task-based fMRI suffers from poor signal-to-noise ratios, limited test-retest reliability and limited overlap with analogous maps derived from invasive cortical stimulation 43 , 44 , causing many to question its clinical utility. For example, based on a meta-analysis of 63 published studies, task fMRI has only a moderate (~50%) withinsubject test-retest reproducibility 38 . In the present study, limited reproducibility was also observed between the two runs of task fMRI data in the HCP subjects. Whereas this was partially due to the limited acquisition length of the task runs and variability in data quality, the iterative parcellation based on the same amount of data were significantly more reliable. In addition, the iterative parcellation can be directly applied to the bandpass filtered task fMRI data and produce functional maps comparable to maps based on pure resting-state data (see Figure 3d & Figure 5e). In a small group of surgical patients, we found that sensorimotor networks could be localized with higher accuracy by the iterative parcellation than using conventional task fMRI.\n\nThe advantage of the iterative parcellation over conventional task fMRI may be explained by the different amount of variance in the BOLD signal they use for mapping. Task-evoked activity accounts for only a small percentage of the total variance in the functional MRI signal and therefore provides less stability, as the practical limits of scanning burden constrain the amount of task data that can be acquired, especially in patient populations. Variance utilized in task activation mapping can be estimated based on the variance explained by the hemodynamic task model. In the eight surgical patients reported in the present study, task-related activity in the motor regions of interest defined by ECS accounted for only 32.5% of the total variance in the functional MRI signal. Prior work has shown that coherent spontaneous activity does not disappear during task paradigms, but continues 45 .\n\nOur parcellation approach utilizes the spontaneous activity for mapping, which may account for the major portion of the variance in task fMRI BOLD signal 45 .\n\nTo render this parcellation strategy useful in mapping the language and memory networks in patients, further optimization and validation are necessary. Nevertheless, our preliminary observations indicate that parcellation can reliably identify a strongly left-lateralized network overlapping with the regions activated by a language task, and a right-lateralized network that is located in traditional ventral attention regions. Additionally, lateralization of these networks may relate to handedness. These observations suggest that this iterative individually-tailored parcellation captures a large portion of the individual variability present in the organization of cerebral networks.\n\n\nImproving Cross-subject Alignment for Group Analysis\n\nEstablishing the functional correspondence between subjects is a prerequisite for group-level functional imaging analyses. Although the association between brain anatomy and function is not fully understood and can vary across individuals, most fMRI processing tools align individual subjects to a common template based on anatomical features such as global morphology or landmarks identified by structural MRI 46 , 47 . Functional networks are likely to be misaligned if they are not tightly linked to the macroscopic anatomy. For example, aligning subjects for the investigation of language function can be particularly challenging because the distribution of the language network is known to be highly variable and can even be found in different hemispheres in different individuals. Substantial inter-subject variability in functional regions was found even after carefully aligning the data based on curvature which largely removed macro-anatomical variability 19 . Some recent studies have attempted to align subjects based on functional characteristics. By incorporating the intersubject signal correlations into a cortical registration algorithm, Subuncu et al. brought functionally similar regions into correspondence during a movie-watching task 48 . However, this strategy relies on consistent task activations across subjects. Robinson et al. developed a novel method that is capable of aligning subjects using a wide variety of characteristics including both structure and function 49 . They demonstrated strong increases in the cluster mass of task activations when subjects were aligned based on resting-state functional connectivity compared to curvature-based registration. The development of functional network parcellation using resting-state connectivity 10 , 11 , especially parcellation at the individual level 14 , 27 , may offer a complementary connectivity-based functional localizer for group-level analyses. A parcellation as described in the present study can provide a set of functional landmarks for cross-subject registration and lead to novel strategies of brain image alignment.\n\n\nLimitations and Future Directions\n\nThere are several technical limitations of this study that deserve mention. First, the number of networks was selected according to specific technical criteria instead of relying on biological considerations 10 . The fixed number of networks may not be appropriate for all individuals, especially for patients who have experienced functional reorganization due to diseases. In some patients certain networks may become completely absent. For example, dramatic reorganization of the tongue motor area was observed in one of our patients due to encephalomalacia (see Patient 5 in Supplementary Fig. 6). This change in functional organization has led to misalignment of the hand motor networks in the parcellation, where the hand network spread to lower portions of the post-central gyrus. Thus, additional improvement and validation of this iterative functional parcellation method are required in order to apply it to patients with distorted anatomy. For example, in patients with localized lesions (limited to one hemisphere), the iterative functional parcellation could be performed in the healthy hemisphere without distortion, as well as in the cerebellum if no lesions are observed. The functional properties in the affected hemisphere could then be estimated based on its functional connectivity to the healthy cerebral hemisphere or the unaffected cerebellum.\n\nSecondly, we parcellated the cortex into a relatively small number of networks, which can reduce the sensitivity to subtle changes of functional networks, such as those due to learning or other experiences. Future development of the parcellation technology should aim at mapping functional networks with finer spatial resolution and determining the number of networks more flexibly in different subjects. A possible strategy is to initiate the iterative parcellation from a population-based atlas with large number of networks, and gradually adjusting the number of networks by merging networks with similar time courses (e.g., r > 0.5). Once a merger occurs, the iterative parcellation can be restarted with the reduced number of networks. This strategy flexibly adjusts the number of networks based on an individual subject's data and can accommodate the need for identifying small networks. Iterative parcellation with this flexible strategy can also achieve high reproducibility (see Supplementary Fig. 7 for an example). Alternative strategies are also possible such as estimation of regions based on local transitions in connectivity properties 13 -15 .\n\nFinally, functional maps derived from fMRI can be influenced by various confounding factors. For example, spatial specificity of the functional connectivity maps can be influenced by the signal in macroscopic veins, and signal correlations can be overstated within or between highly vascularized regions 50 . Thus, inter-subject variability observed in functional connectivity patterns can also be confounded by variations in vascular anatomy. While it is difficult to quantify the exact contribution of vascular variation, the high intersubject variability in functional connectivity observed in the association cortex, especially the variability in hemispheric lateralization, is unlikely to be dominated by vascular variations, but contributions of vascular anatomy to the topographical maps studied here will be critical.\n\n\nONLINE METHODS\n\n\nParticipants and Data Collection\n\nFour separate fMRI datasets obtained with different imaging parameters were employed in the current study.\n\nDataset I-The first dataset consists of twenty-five healthy subjects (age 51.8 ± 6.99, nine female, two left handed) enrolled as a control dataset in a longitudinal fMRI study on stroke recovery. Participants were screened to exclude individuals with a history of neurologic or psychiatric conditions, as well as those using psychoactive medications. Each subject underwent five scanning sessions within 6 months (7, 14, 30, 90 and 180 days from enrollment). All participants performed two or three resting-state runs per session (6 m 12 s per run) to estimate intrinsic functional connectivity. After quality control, 23 subjects who had at least two good runs (tSNR > 100) in each session were included in this study (mean = 2.02 runs). This dataset has been previously reported 31 . MRI data were acquired on a 3 Tesla Siemens TimTrio system (Erlangen, Germany) using the 12-channel phased-array coil supplied by the vendor. Structural images were acquired using a sagittal MP-RAGE threedimensional T1-weighted sequence (TR All HCP subjects were scanned on a customized Siemens 3T \"Connectome Skyra\" scanner. Structural images were acquired using the 3D MPRAGE T1-weighted sequence with 0.7 mm isotropic resolution (FOV = 224 mm, matrix = 320, 256 sagittal slices in a single slab, TR = 2,400 ms, TE = 2.14 ms, TI = 1000 ms, flip angle = 8°). The scan parameters of the rs-fMRI data were: TR = 720 ms; TE = 33.1 ms; flip angle = 52°; FOV = 208 × 180 mm; slice thickness = 2.0 mm; 72 slices; 2 mm isotropic voxels, multiband factor = 8; echo spacing = 0.58 ms; Bandwidth (BW) = 2290 Hz/Px; time points = 1200. The task acquisitions were identical to the resting-state fMRI acquisitions in order to provide maximal compatibility between task and resting data.  12 s per run). All data were collected on matched 3T Tim Trio scanners (Siemens, Erlangen, Germany) using a 12-channel phased-array head coil. Images were acquired using the gradient-echo echo-planar pulse sequence (TR = 3,000 ms, TE = 30 ms, flip angle = 85°, 3 × 3 × 3 mm voxels, FOV = 216 and 47 slices collected with interleaved acquisition with no gap between slices). Whole brain coverage including the entire cerebellum was achieved with slices aligned to the anterior commissure-posterior commissure plane using an automated alignment procedure, ensuring consistency among subjects 54 Table S1.\nDataset\nDataset IV-The fourth dataset included eight surgical candidates (age 19.5 ± 5.0; five female; one left handed) with intractable epilepsy. This was a subset of patients from a recently published study of cortical mapping using gamma activity recorded from subdural electrode grids 56 . The experiment included a preoperative fMRI scan, surgical implantation of subdural electrode grids and direct electrical cortical stimulation (ECS) using these grids.\n\nNo seizures were observed one hour before or after the fMRI or ECS in all patients. The locations of the electrodes and how long they would stay implanted were determined solely by clinical criteria. Written consent was obtained from each patient or their guardians and the experiments were approved by the Ethics Committees of the Second Affiliated Hospital of Tsinghua University. MRI data were collected on a Philips Achieva 3.0 Tesla TX whole body MR scanner using an 8-channel SENSE head coil. Structural images were acquired using a sagittal magnetization-prepared rapid gradient echo T1-weighted sequence (TR = 8. Two types of functional runs were collected from the epilepsy patients: task activation runs (all eight subjects) and resting state runs (six of eight subjects). All eight subjects performed five motor task activation runs. Each run consisted of one type of self-paced movement (left hand, right hand, left foot, right foot, or tongue) consistent with standard preoperative mapping paradigms. Each run was 144 seconds long and consisted of six 12-second task blocks interleaved with six 12-second rest intervals. Patients performed motor tasks according to the instructions presented on the computer screen using the Psychophysics Toolbox in MATLAB (MathWorks, Inc.). Six subjects also underwent two resting-state runs (360 s each run), during which they were asked to fixate on a crosshair in the center of the screen. These pure resting state runs were collected for comparison purposes with the maps created based on the task runs.\n\nAfter an adequate number of seizures had been recorded, bedside ECS mapping was performed to identify the sensorimotor cortices 56 . Using an Ojemann Cortical Stimulator (Integra Life-Sciences), trains of 60-Hz biphasic pulses lasting for 2 -5 seconds were delivered to selected pairs of electrodes. The current intensity of the stimulation started at 2 mA and was gradually increased until patients showed or reported symptoms related to the sensorimotor cortex or the stimulus strength reached 15 mA. Each stimulation involved a pair of electrodes; thus, both electrodes were considered positive when a hand or tongue movement or sensory was produced.\n\n\nData Processing\n\nDataset I-Resting-state fMRI data of the 23 subjects in this longitudinal dataset were processed using the procedures previously described 10 , which were adapted from 8 and 57 .\n\nThe following steps were performed: (1) slice timing correction (SPM2; Wellcome Department of Cognitive Neurology, London, UK), (2) rigid body correction for head motion with the FSL package 58 , 59 , (3) normalization for global mean signal intensity across runs, and (4) bandpass temporal filtering (0.01-0.08 Hz), head-motion regression, whole-brain signal regression, and ventricular and white-matter signal regression. The BOLD frames were not censored based on head motion but all runs included in the present study showed temporal SNR > 100.\n\nStructural data were processed using the FreeSurfer version 4.5.0 software package. Surface mesh representations of the cortex from each individual subject's structural images were reconstructed and registered to a common spherical coordinate system 46 . The structural and functional images were aligned using boundary-based registration 60 within the FsFast software package (http://surfer.nmr.mgh.harvard.edu/fswiki/FsFast). The preprocessed resting-state BOLD fMRI data were then aligned to the common spherical coordinate system via sampling from the middle of the cortical ribbon in a single interpolation step 10 .\n\nFMRI data of each individual were first registered to the FreeSurfer template which consisted of 40,962 vertices in each hemisphere. A 6-mm full-width half-maximum (FWHM) smoothing kernel was then applied to the fMRI data in the surface space. The smoothed data were then down-sampled to a mesh of 2,562 vertices in each hemisphere using the mri_surf2surf function in FreeSurfer software.\n\nDataset II-The \"minimally processed\" fMRI data of the HCP subjects were used, which had been preprocessed in the HCP pipeline using FSL (FMRIB Software Library), FreeSurfer, and the Connectome Workbench software 37 , 61 -63 . The preprocessed data were projected to the FreeSurfer template with a mesh of 40,962 vertices in each hemisphere. The following steps were then performed: 1) demeaning and detrending across each run, 2) bandpass filtering (0.01-0.08Hz), 3) head-motion regression and whole-brain signal regression and 4) smoothing with a 6 mm FWHM smoothing kernel in the surface space. The data were then down-sampled to a mesh of 2,562 vertices in each hemisphere using the mri_surf2surf function provided by FreeSurfer. For connectivity analyses, the task fMRI data were processed in the same way as the resting-state data. To map the brain regions activated by the seven tasks, fixed-effects analyses were performed using FEAT 61 ; see 37 for details.\n\nDataset III-Resting-state fMRI data of the 52 pairs of left handed and right handed subjects were preprocessed identically to the first dataset.\n\nDataset IV-For parcellation analysis, bandpass filtered task fMRI and pure resting-state fMRI data of the surgical patients were preprocessed identically to the first dataset. Conventional task-evoked activation maps in this dataset were estimated using the general linear model. Regressors of no interest included motion correction parameters and low frequency drift. The task-induced BOLD response was modeled by convolving the hemodynamic response function with the experimental design. Intracranial electrodes were registered to the cortical surface using our in-house software 56 to enable the comparison between the ECS maps and the functional parcellation. A post-implantation CT scan was obtained within 24 -48 h after the implant surgery for localization of the electrodes. The post-implantation CT images were registered to T1-weighted MRI images using a mutualinformation-based linear transform 56 . Due to postoperative edema, electrodes extracted from the post-implantation CT images may appear off the surface reconstructed from the pre-surgical MRI. Our in-house tool allows us to manually adjust the locations of electrodes according to the 3D shape of the cortical surface. MRI surface vertices within a 6 mm radius of the positive electrodes were defined as positive. This resulted in an ECS map on the surface that can be directly compared to the map obtained from the functional parcellation.\n\n\nPopulation-based Functional Atlas\n\nA functional network atlas was estimated based on 1,000 healthy subjects 10 and projected onto the individual subject's cortical surface using the FreeSurfer software. The original atlas included 17 networks where hand sensorimotor areas were not separated from other areas. Given the common need to map hand areas in surgical patients, we identified the hand sensorimotor areas from this atlas based on activations in a hand motor task 64 . As a result, this population atlas consisted of 18 networks and would serve as the initial guess of the functional network organization in an individual subject's brain.\n\n\nEvaluating Test-retest Reliability and Inter-subject Variability of the Maps Derived from the Iterative Parcellation\n\nIntra-subject test-retest reliability of the parcellation results was computed using the Dice coefficient after projecting the parcellation results back to each individual subject's cortical surface. This can be simply computed as the percentage of vertices that were assigned to the same network in two sessions. To assess the reliability of the parcellation technique at the group level, Dice coefficients were then averaged across all subjects. Inter-subject variability was computed on the FreeSurfer surface template (2,562 vertices in each hemisphere) based on the Dice coefficient between any pair of subjects and then averaged across all pairs.\n\n\nComparing the Task fMRI and Iterative Parcellation with the ECS Findings\n\nFor the patient dataset (Dataset IV), the results of different mapping modalities were projected to each patient's cortical surface for comparison with the ECS findings. Taking the ECS findings as references, the sensitivity and specificity of the activation map and the network parcellation were quantified. Sensitivity was computed by dividing the number of true positives (fMRI positive vertices that were also positive in the ECS maps) by the number of true positives plus false negatives (i.e. total vertices positive in the ECS maps). The specificity was computed by the number of true negatives (fMRI negative vertices that were also negative in the ECS maps) divided by the number of true negatives plus false positives (i.e. total vertices negative in the ECS maps). ROC curves were obtained by calculating the sensitivity and specificity across a wide range of different thresholds. The area under the curve was computed for each subject and compared across methods using a Wilcoxon paired non-parametric test.\n\n\nEstimating Functional Lateralization\n\nLateralization was computed for each network derived from the iterative parcellation.\n\nVertices that belonged to a specific network were separated into left-hemisphere and righthemisphere portions. A lateralization index was then computed based on the following equation:\n\n(1)\n\nWhere V L is the count of vertices in the left hemisphere, V R is the count of vertices in the right hemisphere.\n\n\nVisualization and Statistics\n\nThe iterative parcellation was performed on the FreeSurfer fsaverage4 template and the resulting network labels were upsampled to each individual subject's own cortical surface using the mri_surf2surf function. The labels were then merged into a single \"annotation\" file using the write_annotation function provided by FreeSurfer. The parcellation results were visualized in each individual's cortical surface using FreeSurfer.\n\nNo statistical methods were used to pre-determine sample sizes but our sample sizes are larger than or similar to those reported in previous publications 31 , 37 , 65 , 66 . Within each dataset, no randomization or blinding was employed to separate subjects into different groups. Two-tailed t-test was used for all comparisons in this study except for the experiment shown in Figure 5, which used Wilcoxon rank sum test. For the t-tests, data distribution was assumed to be normal but this was not formally tested.\n\n\nCode Availability\n\nThe code of the iterative parcellation algorithm is available from the corresponding authors upon request.\n\nA supplementary methods checklist is available.\n\n\nSupplementary Material\n\nRefer to Web version on PubMed Central for supplementary material. Parcellating the functional networks in an individual subject's brain using an iterative adjusting approach. The technique includes the following steps: 1) A population-based functional brain atlas was registered onto the individual subject's cortical surface using FreeSurfer. The individual subject's BOLD signal time courses were then averaged across the vertices that fall within each network. These atlas-based network time courses were used as the \"reference signals\" for the subsequent optimization procedure.\n\n2) The individual subject's BOLD signal at each vertex was then correlated to the 18 \"reference signals\". Each vertex was reassigned to one of the 18 networks according to its maximal correlation to the \"reference signals\". A confidence value was also computed as the ratio between the largest and the second largest correlation values. After each vertex was reassigned, the BOLD signals of the high confidence vertices (e.g., >1.1) in each network were then averaged and termed the \"core signal\". 3) For each network, the \"core signal\" derived from Step 2 and the original \"reference signals \" derived from Step 1 were averaged in a weighted manner. Specifically, the \"core signal\" was multiplied by the weighting parameters derived from inter-subject variability and SNR, as well as the number of iterations. The averaged signal was used as the new \"reference signal\" for the next iteration. Using these new \"reference signals\", the brain vertices were further reassigned to one of the 18 networks. 4) Steps 2 & 3 were repeated until the algorithm reached a pre-defined stopping criterion.\n\n\nFigure 2.\n\nIterative brain parcellation is highly reproducible within subjects and captures differences across subjects. Twenty-three healthy subjects underwent five resting-state scanning sessions within six months. The functional organization of the individual subject's brain was parcellated into 18 networks using the data of each scanning session. The parcellation networks of three subjects that showed the highest reproducibility across sessions are displayed so that inter-subject variability can be appreciated. The functional maps of different subjects differed substantially, especially in the higher-order association areas (see also Supplementary Fig. 2 for maps of three subjects that showed the highest, median, and lowest reproducibility. Maps of all 23 subjects can be downloaded at: http:// nmr.mgh.harvard.edu/bid/download.html). Quantitative analyses of intra-subject reliability and inter-subject variability based on the HCP subjects. (a) One hundred subjects from the Human Connectome Project (the \"Unrelated 100\") were employed for validation purposes. Intra-subject reliability and intersubject variability of the parcellation maps after each iteration are plotted. Standard deviations are represented as shaded regions around the curves. As the iteration progressed, inter-subject variability increased, while intra-subject reliability decreased (see also Supplementary Fig. 3 for spatial distributions of reliability and variability after each iteration). (b) The networks of three exemplary subjects are displayed. Maps of all 100 subjects can be downloaded at: http://nmr.mgh.harvard.edu/bid/download.html. (c) Parcellation based on the resting-state fMRI demonstrated high intra-subject reliability and high inter-subject variability. Comparing two rs-fMRI sessions of the same subject, on average 82.4% ± 3.2% of the vertices were assigned to the same networks. Between any two individuals, on average only 60.5% ± 2.8% of the brain vertices were assigned to the same networks. Error bars are mean ± SD. The intra-subject consistency of network membership was significantly higher than the inter-subject consistency (unpaired two-tailed t-test, p<0.001). The iterative parcellation technique was also applied to the concatenated task data of the 100 HCP subjects. Parcellation results based on task data and resting-state data demonstrated an overlap of 81.7% ± 4.0%, suggesting that whole-brain network parcellation could also be obtained from an individual subject's task data. (d) Networks derived from the concatenated task data are shown for three exemplary subjects. Compared to left handed subjects, right handed subjects showed a trend for stronger lateralization in the languagerelated network (p=0.057, unpaired two-tailed t-test) and significantly stronger lateralization in the ventral attention-related network (p = 0.003, unpaired two-tailed t-test). Error bars are mean ± SEM. Sensorimotor networks identified by individual brain parcellation showed good correspondence with functional regions localized by invasive cortical stimulation. (a) The hand and tongue sensorimotor regions of eight surgical candidates were mapped using multiple approaches for comparison. Sensorimotor regions identified by ECS were used as the gold standard. The red dots on the ECS maps indicate negative electrodes, while the yellow dots indicate positive electrodes. (b) Sensory and motor areas identified by traditional task activation showed low consistency with the ECS maps. (c) The hand sensorimotor regions identified by iterative parcellation based on the concatenated task fMRI data were consistent with the ECS maps. The map shows the vertices with high confidence values (>1.2). (d) Individual brain parcellation may serve as a prescreening method for ECS. The map shows the network membership of vertices with high confidence values (>1.1). Iterative parcellation can provide a rough estimate of the regions of interest for cortical stimulation, potentially shortening the stimulation procedure. (e) The sensitivity and specificity of the hand and tongue sensorimotor maps in 8 surgical patients were statistically measured across a wide range of thresholds for five different mapping approaches. The results are displayed in ROC curves, including the iterative parcellation technique using task fMRI of eight subjects (green), the iterative parcellation technique using pure resting-state fMRI of six subjects (black), directly projecting the populationbased atlas to each individual subject (blue), traditional task-activation mapping alone (purple) and task activation masked with anatomical labels generated by FreeSurfer (red).\n\n(\nFigure 5e, black curve). The ROC curve was not significantly different from the original parcellation results based on the task fMRI data (AUC 0.91 vs 0.89, p = 0.22, Wilcoxon rank sum test). Finally, we examined whether the iterative parcellation was truly advantageous over simply using the population-based atlas for each individual subject(Figure 5e, blue curve; also see Supplementary Fig. 6 for the atlas mapped on individual subjects). The iterative parcellation technique significantly outperformed the population atlas (AUC 0.91 vs. 0.78, p = 0.015, Wilcoxon rank sum test) in motor mapping.\n\n= 1 ,\n1600 ms; TE = 2.15 ms; flip angle = 9°; 1.0 mm isotropic voxels; FOV = 256 × 256). Functional data were obtained using a gradient echoplanar pulse sequence (TR = 3,000 ms; TE = 30 ms; flip angle = 90°; 3 mm isotropic voxels, transverse orientation, 47 slices fully covering cerebral cortex and cerebellum). Subjects were instructed to stay awake and keep their eyes open. Participants provided written informed consent in accordance with guidelines set by the institutional review boards of Xuanwu Hospital. Dataset II-The second dataset included 100 young healthy subjects (the \" Unrelated 100\" group, 54 female, age range 22 -35 years except one subject was over 36 years) made publicly available by the Human Connectome Project, supported by the WU-Minn Consortium 51 . Written informed consent was obtained from each participant in accordance with relevant guidelines and regulations approved by the local institutional review board at Washington University in St. Louis (IRB # 201204036). For each participant, two restingstate fMRI sessions (each session consisted of one run with left-to-right direction phase encoding and one run with right-to-left direction) and seven task fMRI sessions (each session consisted of one run with left-to-right direction phase encoding and one run with right-to-left direction) were obtained. The tasks included working memory (5 m 1 s per run), gambling (3 m 12 s per run), motor (3 m 34 s per run), language (3 m 57 s per run), social cognition (3 m 27 s per run), relational processing (2 m 56 s per run) and emotional processing (2 m 16 s per run). For a complete description of the dataset, please see 51 , 52 .\n\n\n. Structural data included a high-resolution multi-echo T1-weighted magnetization-prepared gradient-echo image (TR = 2,200 ms, TI = 1100 ms, TE = 1.54 ms for image 1 to 7.01 ms for image 4, flip angle = 7°, 1.2 × 1.2 × 1.2 mm and FOV = 230). Subjects were instructed to stay awake, keep their eyes open, and minimize head movement; no other task instruction was provided. The handedness of each subject was assessed via the Edinburgh handedness inventory55 . The demographic information of the 52 pairs of subjects and the matching criteria are listed in\n\n\n1 ms, TE = 3.7 ms, TI = 1,000 ms, flip angle = 8°, FOV = 230 mm × 230 mm, matrix size =230 × 230, slices = 180, voxel size = 1×1×1 mm). Functional data was collected using an echo planar imaging sequence (TR = 3,000 ms, TE = 30 ms, flip angle = 90°, FOV = 192 mm × 192 mm, matrix size = 64× 64, slices = 47, voxel size = 3× 3 × 3 mm).\n\nFigure 1 .\n1Figure 1.\n\nFigure 3 .\n3Figure 3.\n\nFigure 4 .\n4Brain lateralization is reflected in the network parcellation. (a) A laterality index was computed for each parcellation network. Histograms of LIs were plotted for the two networks that demonstrated strongest lateralization in the 100 HCP subjects, where positive values indicate left lateralization. The strongest left-lateralized network was located in the traditional language area and the strongest right-lateralized network was located in the traditional ventral attention area. (b) The strongest left-lateralized parcellation network also overlapped with the regions showing activation during a language task. The maps display the percentage of subjects showing overlap in the left-lateralized network and the percentage of subjects showing language activation (Z>1.96, corresponding to uncorrected, two-tailed p<0.05). Activation maps were estimated using the general linear model. At the group level, 71.2% of the vertices in the left-lateralized network fell within the regions activated by the language task. (c) Handedness has an effect on functional network lateralization. The lateralization indices of the language-related and ventral attention-related networks were computed in 52 left handed and 52 matched right handed subjects.\n\nFigure 5 .\n5Figure 5.\nAcknowledgmentsThe authors thank Xiaolong Peng and Meiling Li for technical assistance. This work was supported by NIH grants\nLocalisation in the cerebral cortex. Garey, LJ., translator. K Brodmann, SpringerNew YorkBrodmann, K. Localisation in the cerebral cortex. Garey, LJ., translator. New York: Springer; 1909/2006.\n\nAllgemeinere Ergebnisse unserer Hirnforschung. C Vogt, O Vogt, J Psychol Neurol. 25Vogt C, Vogt O. Allgemeinere Ergebnisse unserer Hirnforschung. J Psychol Neurol. 1919; 25:292- 398.\n\nTowards multimodal atlases of the human brain. A W Toga, P M Thompson, S Mori, K Amunts, K Zilles, Nat Rev Neurosci. 7PubMed: 17115077Toga AW, Thompson PM, Mori S, Amunts K, Zilles K. Towards multimodal atlases of the human brain. Nat Rev Neurosci. 2006; 7:952-966. [PubMed: 17115077]\n\nCentenary of Brodmann's map-conception and fate. K Zilles, K Amunts, Nat Rev Neurosci. 11PubMed: 20046193Zilles K, Amunts K. Centenary of Brodmann's map-conception and fate. Nat Rev Neurosci. 2010; 11:139-145. [PubMed: 20046193]\n\nBroca's region revisited: cytoarchitecture and intersubject variability. K Amunts, J Comp Neurol. 412PubMed: 10441759Amunts K, et al. Broca's region revisited: cytoarchitecture and intersubject variability. J Comp Neurol. 1999; 412:319-341. [PubMed: 10441759]\n\nThe organization of neocortex in mammals: implications for theories of brain function. J H Kaas, Annu Rev Psychol. 38PubMed: 3548573Kaas JH. The organization of neocortex in mammals: implications for theories of brain function. Annu Rev Psychol. 1987; 38:129-151. [PubMed: 3548573]\n\nStructure and function of visual area MT. R T Born, D C Bradley, Annu Rev Neurosci. 28PubMed: 16022593Born RT, Bradley DC. Structure and function of visual area MT. Annu Rev Neurosci. 2005; 28:157- 189. [PubMed: 16022593]\n\nFunctional connectivity in the motor cortex of resting human brain using echo-planar MRI. B Biswal, F Z Yetkin, V M Haughton, J S Hyde, Magn Reson Med. 34PubMed: 8524021Biswal B, Yetkin FZ, Haughton VM, Hyde JS. Functional connectivity in the motor cortex of resting human brain using echo-planar MRI. Magn Reson Med. 1995; 34:537-541. [PubMed: 8524021]\n\nSpontaneous fluctuations in brain activity observed with functional magnetic resonance imaging. M D Fox, M E Raichle, Nat Rev Neurosci. 8PubMed: 17704812Fox MD, Raichle ME. Spontaneous fluctuations in brain activity observed with functional magnetic resonance imaging. Nat Rev Neurosci. 2007; 8:700-711. [PubMed: 17704812]\n\nThe organization of the human cerebral cortex estimated by intrinsic functional connectivity. B T Yeo, J Neurophysiol. 106PubMed: 21653723Yeo BT, et al. The organization of the human cerebral cortex estimated by intrinsic functional connectivity. J Neurophysiol. 2011; 106:1125-1165. [PubMed: 21653723]\n\nFunctional network organization of the human brain. J D Power, Neuron. 72PubMed: 22099467Power JD, et al. Functional network organization of the human brain. Neuron. 2011; 72:665-678. [PubMed: 22099467]\n\nGroupwise whole-brain parcellation from resting-state fMRI data for network node identification. X Shen, F Tokoglu, X Papademetris, R T Constable, Neuroimage. 82PubMed: 23747961Shen X, Tokoglu F, Papademetris X, Constable RT. Groupwise whole-brain parcellation from resting-state fMRI data for network node identification. Neuroimage. 2013; 82:403-415. [PubMed: 23747961]\n\nGeneration and evaluation of a cortical area parcellation from resting-state correlations. E M Gordon, Cereb Cortex. 239PubMed: 25316338Gordon EM, et al. Generation and evaluation of a cortical area parcellation from resting-state correlations. Cereb Cortex. 2014:bhu239. [PubMed: 25316338]\n\nParcellating an individual subject's cortical and subcortical brain structures using snowball sampling of resting-state correlations. G S Wig, Cereb Cortex. 56Wig GS, et al. Parcellating an individual subject's cortical and subcortical brain structures using snowball sampling of resting-state correlations. Cereb Cortex. 2013:bht056.\n\nAn approach for parcellating human cortical areas using resting-state correlations. G S Wig, T O Laumann, S E Petersen, Neuroimage. 93PubMed: 23876247Wig GS, Laumann TO, Petersen SE. An approach for parcellating human cortical areas using resting-state correlations. Neuroimage. 2014; 93:276-291. [PubMed: 23876247]\n\nFunctional system and areal organization of a highly sampled individual human brain. T O Laumann, Neuron. 87PubMed: 26212711Laumann TO, et al. Functional system and areal organization of a highly sampled individual human brain. Neuron. 2015; 87:657-670. [PubMed: 26212711]\n\nEpilepsy and the functional anatomy of the human brain. W Penfield, H H Jasper, Little; BostonPenfield, W.; Jasper, HH. Epilepsy and the functional anatomy of the human brain. Little; Boston: 1954.\n\nCortical language localization in left, dominant hemisphere. An electrical stimulation mapping investigation in 117 patients. G Ojemann, J Ojemann, E Lettich, M Berger, J Neurosurg. 71PubMed: 2769383Ojemann G, Ojemann J, Lettich E, Berger M. Cortical language localization in left, dominant hemisphere. An electrical stimulation mapping investigation in 117 patients. J Neurosurg. 1989; 71:316-326. [PubMed: 2769383]\n\nMeasuring structural-functional correspondence: spatial variability of specialised brain regions after macro-anatomical alignment. M A Frost, R Goebel, Neuroimage. 59PubMed: 21875671Frost MA, Goebel R. Measuring structural-functional correspondence: spatial variability of specialised brain regions after macro-anatomical alignment. Neuroimage. 2012; 59:1369-1381. [PubMed: 21875671]\n\nHuman brain language areas identified by functional magnetic resonance imaging. J R Binder, J Neurosci. 17PubMed: 8987760Binder JR, et al. Human brain language areas identified by functional magnetic resonance imaging. J Neurosci. 1997; 17:353-362. [PubMed: 8987760]\n\nIdentification of reproducible individualized targets for treatment of depression with TMS based on intrinsic connectivity. M D Fox, H Liu, A Pascual-Leone, Neuroimage. 66PubMed: 23142067Fox MD, Liu H, Pascual-Leone A. Identification of reproducible individualized targets for treatment of depression with TMS based on intrinsic connectivity. Neuroimage. 2013; 66:151-160. [PubMed: 23142067]\n\nResting state networks link invasive and noninvasive brain stimulation across diverse psychiatric and neurological diseases. M D Fox, Proc Natl Acad Sci USA. 111PubMed: 25267639Fox MD, et al. Resting state networks link invasive and noninvasive brain stimulation across diverse psychiatric and neurological diseases. Proc Natl Acad Sci USA. 2014; 111:E4367-E4375. [PubMed: 25267639]\n\nFunctional MRI is a valid noninvasive alternative to Wada testing. J R Binder, Epilepsy Behav. 20PubMed: 20850386Binder JR. Functional MRI is a valid noninvasive alternative to Wada testing. Epilepsy Behav. 2011; 20:214-222. [PubMed: 20850386]\n\nFunctional connectivity architecture of the human brain: not all the same. D Wang, H Liu, Neuroscientist. 20PubMed: 25030990Wang D, Liu H. Functional connectivity architecture of the human brain: not all the same. Neuroscientist. 2014; 20:432-438. [PubMed: 25030990]\n\nNew method for fMRI investigations of language: defining ROIs functionally in individual subjects. E Fedorenko, P J Hsieh, A Nieto-Castanon, S Whitfield-Gabrieli, N Kanwisher, J Neurophysiol. 104PubMed: 20410363Fedorenko E, Hsieh PJ, Nieto-Castanon A, Whitfield-Gabrieli S, Kanwisher N. New method for fMRI investigations of language: defining ROIs functionally in individual subjects. J Neurophysiol. 2010; 104:1177-1194. [PubMed: 20410363]\n\nIs region-of-interest overlap comparison a reliable measure of category specificity?. C C Kung, J J Peissig, M J Tarr, J Cogn Neurosci. 19PubMed: 17892386Kung CC, Peissig JJ, Tarr MJ. Is region-of-interest overlap comparison a reliable measure of category specificity? J Cogn Neurosci. 2007; 19:2019-2034. [PubMed: 17892386]\n\nResting state network estimation in individual subjects. C D Hacker, Neuroimage. 82PubMed: 23735260Hacker CD, et al. Resting state network estimation in individual subjects. Neuroimage. 2013; 82:616-633. [PubMed: 23735260]\n\nSpatially constrained hierarchical parcellation of the brain with resting-state fMRI. T Blumensath, Neuroimage. 76PubMed: 23523803Blumensath T, et al. Spatially constrained hierarchical parcellation of the brain with resting-state fMRI. Neuroimage. 2013; 76:313-324. [PubMed: 23523803]\n\nUnravelling the intrinsic functional organization of the human lateral frontal cortex: a parcellation scheme based on resting state fMRI. A Goulas, H B Uylings, P Stiers, J Neurosci. 32PubMed: 22836258Goulas A, Uylings HB, Stiers P. Unravelling the intrinsic functional organization of the human lateral frontal cortex: a parcellation scheme based on resting state fMRI. J Neurosci. 2012; 32:10238-10252. [PubMed: 22836258]\n\nA whole brain fMRI atlas generated via spatially constrained spectral clustering. R C Craddock, G A James, P E Holtzheimer, X P Hu, H S Mayberg, Hum Brain Mapp. 33PubMed: 21769991Craddock RC, James GA, Holtzheimer PE 3rd, Hu XP, Mayberg HS. A whole brain fMRI atlas generated via spatially constrained spectral clustering. Hum Brain Mapp. 2012; 33:1914-1928. [PubMed: 21769991]\n\nIndividual variability in functional connectivity architecture of the human brain. S Mueller, Neuron. 77PubMed: 23395382Mueller S, et al. Individual variability in functional connectivity architecture of the human brain. Neuron. 2013; 77:586-595. [PubMed: 23395382]\n\nMaking big data open: data sharing in neuroimaging. R A Poldrack, K J Gorgolewski, Nat Neurosci. 17PubMed: 25349916Poldrack RA, Gorgolewski KJ. Making big data open: data sharing in neuroimaging. Nat Neurosci. 2014; 17:1510-1517. [PubMed: 25349916]\n\nReconfigurable task-dependent functional coupling modes cluster around a core functional architecture. F M Krienen, B T Yeo, R L Buckner, Philos Trans R Soc Lond B Biol Sci. 369Krienen FM, Yeo BT, Buckner RL. Reconfigurable task-dependent functional coupling modes cluster around a core functional architecture. Philos Trans R Soc Lond B Biol Sci. 2014; 369\n\nIntrinsic and task-evoked network architectures of the human brain. M W Cole, D S Bassett, J D Power, T S Braver, S E Petersen, Neuron. 83PubMed: 24991964Cole MW, Bassett DS, Power JD, Braver TS, Petersen SE. Intrinsic and task-evoked network architectures of the human brain. Neuron. 2014; 83:238-251. [PubMed: 24991964]\n\nFunctional specialization in the human brain estimated by intrinsic hemispheric interaction. D Wang, R L Buckner, H Liu, J Neurosci. 34PubMed: 25209275Wang D, Buckner RL, Liu H. Functional specialization in the human brain estimated by intrinsic hemispheric interaction. J Neurosci. 2014; 34:12341-12352. [PubMed: 25209275]\n\nControl of goal-directed and stimulus-driven attention in the brain. M Corbetta, G L Shulman, Nat Rev Neurosci. 3PubMed: 11994752Corbetta M, Shulman GL. Control of goal-directed and stimulus-driven attention in the brain. Nat Rev Neurosci. 2002; 3:201-215. [PubMed: 11994752]\n\nFunction in the human connectome: task-fMRI and individual differences in behavior. D M Barch, Neuroimage. 80PubMed: 23684877Barch DM, et al. Function in the human connectome: task-fMRI and individual differences in behavior. Neuroimage. 2013; 80:169-189. [PubMed: 23684877]\n\nHow reliable are the results from functional magnetic resonance imaging?. C M Bennett, M B Miller, Ann N Y Acad Sci. 1191PubMed: 20392279Bennett CM, Miller MB. How reliable are the results from functional magnetic resonance imaging? Ann N Y Acad Sci. 2010; 1191:133-155. [PubMed: 20392279]\n\nSexual differentiation of the human brain. A historical perspective. D F Swaab, M A Hofman, Prog Brain Res. 61PubMed: 6396708Swaab DF, Hofman MA. Sexual differentiation of the human brain. A historical perspective. Prog Brain Res. 1984; 61:361-374. [PubMed: 6396708]\n\nClinical applications of resting state functional connectivity. Frontiers in systems neuroscience. M D Fox, M Greicius, 419PubMed: 20592951Fox MD, Greicius M. Clinical applications of resting state functional connectivity. Frontiers in systems neuroscience. 2010; 4:19. [PubMed: 20592951]\n\nIntersubject variability of and genetic effects on the brain's functional connectivity during infancy. W Gao, J Neurosci. 34PubMed: 25143609Gao W, et al. Intersubject variability of and genetic effects on the brain's functional connectivity during infancy. J Neurosci. 2014; 34:11288-11296. [PubMed: 25143609]\n\nJoint spectral decomposition for the parcellation of the human cerebral cortex using resting-state fMRI. S Arslan, S Parisot, D Rueckert, Inf Process Med Imaging. 24PubMed: 26221668Arslan S, Parisot S, Rueckert D. Joint spectral decomposition for the parcellation of the human cerebral cortex using resting-state fMRI. Inf Process Med Imaging. 2015; 24:85-97. [PubMed: 26221668]\n\nIs preoperative functional magnetic resonance imaging reliable for language areas mapping in brain tumor surgery? Review of language functional magnetic resonance imaging and direct cortical stimulation correlation studies. C Giussani, Neurosurgery. 66PubMed: 19935438Giussani C, et al. Is preoperative functional magnetic resonance imaging reliable for language areas mapping in brain tumor surgery? Review of language functional magnetic resonance imaging and direct cortical stimulation correlation studies. Neurosurgery. 2010; 66:113-120. [PubMed: 19935438]\n\nA comparison of five fMRI protocols for mapping speech comprehension systems. J R Binder, S J Swanson, T A Hammeke, D S Sabsevitz, Epilepsia. 49PubMed: 18513352Binder JR, Swanson SJ, Hammeke TA, Sabsevitz DS. A comparison of five fMRI protocols for mapping speech comprehension systems. Epilepsia. 2008; 49:1980-1997. [PubMed: 18513352]\n\nCoherent spontaneous activity accounts for trial-totrial variability in human evoked brain responses. M D Fox, A Z Snyder, J M Zacks, M E Raichle, Nat Neurosci. 9PubMed: 16341210Fox MD, Snyder AZ, Zacks JM, Raichle ME. Coherent spontaneous activity accounts for trial-to- trial variability in human evoked brain responses. Nat Neurosci. 2006; 9:23-25. [PubMed: 16341210]\n\nCortical surface-based analysis. II: Inflation, flattening, and a surface-based coordinate system. B Fischl, M I Sereno, A M Dale, Neuroimage. 9PubMed: 9931269Fischl B, Sereno MI, Dale AM. Cortical surface-based analysis. II: Inflation, flattening, and a surface-based coordinate system. Neuroimage. 1999; 9:195-207. [PubMed: 9931269]\n\nBayesian analysis of neuroimaging data in FSL. M W Woolrich, Neuroimage. 45PubMed: 19059349Woolrich MW, et al. Bayesian analysis of neuroimaging data in FSL. Neuroimage. 2009; 45:S173- 186. [PubMed: 19059349]\n\nFunction-based intersubject alignment of human cortical anatomy. M R Sabuncu, Cereb Cortex. 20PubMed: 19420007Sabuncu MR, et al. Function-based intersubject alignment of human cortical anatomy. Cereb Cortex. 2010; 20:130-140. [PubMed: 19420007]\n\nMSM: a new flexible framework for Multimodal Surface Matching. E C Robinson, Neuroimage. 100PubMed: 24939340Robinson EC, et al. MSM: a new flexible framework for Multimodal Surface Matching. Neuroimage. 2014; 100:414-426. [PubMed: 24939340]\n\nPhase based venous suppression in resting-state BOLD GE-fMRI. A T Curtis, R M Hutchison, R S Menon, Neuroimage. 100PubMed: 24907484Curtis AT, Hutchison RM, Menon RS. Phase based venous suppression in resting-state BOLD GE- fMRI. Neuroimage. 2014; 100:51-59. [PubMed: 24907484]\n\nThe WU-Minn Human Connectome Project: an overview. D C Van Essen, Neuroimage. 80PubMed: 23684880Van Essen DC, et al. The WU-Minn Human Connectome Project: an overview. Neuroimage. 2013; 80:62-79. [PubMed: 23684880]\n\nThe Human Connectome Project: a data acquisition perspective. D C Van Essen, Neuroimage. 62PubMed: 22366334Van Essen DC, et al. The Human Connectome Project: a data acquisition perspective. Neuroimage. 2012; 62:2222-2231. [PubMed: 22366334]\n\nBrain Genomics Superstruct Project initial data release with structural, functional, and behavioral measures. A J Holmes, Sci Data. 2150031PubMed: 26175908Holmes AJ, et al. Brain Genomics Superstruct Project initial data release with structural, functional, and behavioral measures. Sci Data. 2015; 2:150031. [PubMed: 26175908]\n\nBrain morphometry with multiecho MPRAGE. A J Van Der Kouwe, T Benner, D H Salat, B Fischl, Neuroimage. 40PubMed: 18242102van der Kouwe AJ, Benner T, Salat DH, Fischl B. Brain morphometry with multiecho MPRAGE. Neuroimage. 2008; 40:559-569. [PubMed: 18242102]\n\nThe assessment and analysis of handedness: the Edinburgh inventory. R C Oldfield, Neuropsychologia. 9PubMed: 5146491Oldfield RC. The assessment and analysis of handedness: the Edinburgh inventory. Neuropsychologia. 1971; 9:97-113. [PubMed: 5146491]\n\nFast presurgical functional mapping using task-related intracranial high gamma activity. T Qian, J Neurosurg. 119PubMed: 23600935Qian T, et al. Fast presurgical functional mapping using task-related intracranial high gamma activity. J Neurosurg. 2013; 119:26-36. [PubMed: 23600935]\n\nThe human brain is intrinsically organized into dynamic, anticorrelated functional networks. M D Fox, Proc Natl Acad Sci USA. 102PubMed: 15976020Fox MD, et al. The human brain is intrinsically organized into dynamic, anticorrelated functional networks. Proc Natl Acad Sci USA. 2005; 102:9673-9678. [PubMed: 15976020]\n\nImproved optimization for the robust and accurate linear registration and motion correction of brain images. M Jenkinson, P Bannister, M Brady, S Smith, Neuroimage. 17PubMed: 12377157Jenkinson M, Bannister P, Brady M, Smith S. Improved optimization for the robust and accurate linear registration and motion correction of brain images. Neuroimage. 2002; 17:825-841. [PubMed: 12377157]\n\nAdvances in functional and structural MR image analysis and implementation as FSL. S M Smith, Neuroimage. 231Suppl. PubMed: 15501092Smith SM, et al. Advances in functional and structural MR image analysis and implementation as FSL. Neuroimage. 2004; 23(Suppl 1):S208-219. [PubMed: 15501092]\n\nAccurate and robust brain image alignment using boundary-based registration. D N Greve, B Fischl, Neuroimage. 48PubMed: 19573611Greve DN, Fischl B. Accurate and robust brain image alignment using boundary-based registration. Neuroimage. 2009; 48:63-72. [PubMed: 19573611]\n\nTemporal autocorrelation in univariate linear modeling of FMRI data. M W Woolrich, B D Ripley, M Brady, S M Smith, Neuroimage. 14PubMed: 11707093Woolrich MW, Ripley BD, Brady M, Smith SM. Temporal autocorrelation in univariate linear modeling of FMRI data. Neuroimage. 2001; 14:1370-1386. [PubMed: 11707093]\n\nThe minimal preprocessing pipelines for the Human Connectome Project. M F Glasser, Neuroimage. 80PubMed: 23668970Glasser MF, et al. The minimal preprocessing pipelines for the Human Connectome Project. Neuroimage. 2013; 80:105-124. [PubMed: 23668970]\n\nHuman Connectome Project informatics: quality control, database services, and data visualization. D S Marcus, Neuroimage. 80PubMed: 23707591Marcus DS, et al. Human Connectome Project informatics: quality control, database services, and data visualization. Neuroimage. 2013; 80:202-219. [PubMed: 23707591]\n\nThe organization of the human cerebellum estimated by intrinsic functional connectivity. R L Buckner, F M Krienen, A Castellanos, J C Diaz, B T Yeo, J Neurophysiol. 106PubMed: 21795627Buckner RL, Krienen FM, Castellanos A, Diaz JC, Yeo BT. The organization of the human cerebellum estimated by intrinsic functional connectivity. J Neurophysiol. 2011; 106:2322-2345. [PubMed: 21795627]\n\nCerebellar asymmetry and its relation to cerebral asymmetry estimated by intrinsic functional connectivity. D Wang, R L Buckner, H Liu, J Neurophysiol. 109PubMed: 23076113Wang D, Buckner RL, Liu H. Cerebellar asymmetry and its relation to cerebral asymmetry estimated by intrinsic functional connectivity. J Neurophysiol. 2013; 109:46-57. [PubMed: 23076113]\n\nCombining task-evoked and spontaneous activity to improve pre-operative brain mapping with fMRI. M D Fox, Neuroimage. 124PubMed: 26408860Fox MD, et al. Combining task-evoked and spontaneous activity to improve pre-operative brain mapping with fMRI. Neuroimage. 2015; 124:714-723. [PubMed: 26408860]\n", "annotations": {"author": "[{\"end\":313,\"start\":60},{\"end\":655,\"start\":314},{\"end\":1062,\"start\":656},{\"end\":1317,\"start\":1063},{\"end\":1482,\"start\":1318},{\"end\":1733,\"start\":1483},{\"end\":1980,\"start\":1734},{\"end\":2139,\"start\":1981},{\"end\":2448,\"start\":2140},{\"end\":2542,\"start\":2449},{\"end\":2944,\"start\":2543},{\"end\":3219,\"start\":2945},{\"end\":3324,\"start\":3220},{\"end\":3417,\"start\":3325},{\"end\":3539,\"start\":3418},{\"end\":3820,\"start\":3540},{\"end\":3831,\"start\":3821},{\"end\":3836,\"start\":3832},{\"end\":3841,\"start\":3837},{\"end\":3848,\"start\":3842},{\"end\":3855,\"start\":3849}]", "publisher": null, "author_last_name": "[{\"end\":72,\"start\":68},{\"end\":329,\"start\":322},{\"end\":669,\"start\":666},{\"end\":1076,\"start\":1072},{\"end\":1332,\"start\":1326},{\"end\":1500,\"start\":1490},{\"end\":1745,\"start\":1740},{\"end\":1990,\"start\":1987},{\"end\":2151,\"start\":2147},{\"end\":2460,\"start\":2458},{\"end\":2557,\"start\":2552},{\"end\":2965,\"start\":2954},{\"end\":3228,\"start\":3224},{\"end\":3337,\"start\":3333},{\"end\":3425,\"start\":3421},{\"end\":3551,\"start\":3548},{\"end\":3830,\"start\":3826}]", "author_first_name": "[{\"end\":67,\"start\":60},{\"end\":319,\"start\":314},{\"end\":321,\"start\":320},{\"end\":663,\"start\":656},{\"end\":665,\"start\":664},{\"end\":1069,\"start\":1063},{\"end\":1071,\"start\":1070},{\"end\":1323,\"start\":1318},{\"end\":1325,\"start\":1324},{\"end\":1489,\"start\":1483},{\"end\":1739,\"start\":1734},{\"end\":1986,\"start\":1981},{\"end\":2146,\"start\":2140},{\"end\":2457,\"start\":2449},{\"end\":2549,\"start\":2543},{\"end\":2551,\"start\":2550},{\"end\":2951,\"start\":2945},{\"end\":2953,\"start\":2952},{\"end\":3223,\"start\":3220},{\"end\":3332,\"start\":3325},{\"end\":3420,\"start\":3418},{\"end\":3547,\"start\":3540},{\"end\":3825,\"start\":3823},{\"end\":3833,\"start\":3832},{\"end\":3835,\"start\":3834},{\"end\":3838,\"start\":3837},{\"end\":3840,\"start\":3839},{\"end\":3843,\"start\":3842},{\"end\":3847,\"start\":3844},{\"end\":3850,\"start\":3849},{\"end\":3854,\"start\":3851}]", "author_affiliation": "[{\"end\":220,\"start\":74},{\"end\":312,\"start\":222},{\"end\":477,\"start\":331},{\"end\":569,\"start\":479},{\"end\":654,\"start\":571},{\"end\":817,\"start\":671},{\"end\":970,\"start\":819},{\"end\":1061,\"start\":972},{\"end\":1224,\"start\":1078},{\"end\":1316,\"start\":1226},{\"end\":1424,\"start\":1334},{\"end\":1481,\"start\":1426},{\"end\":1648,\"start\":1502},{\"end\":1732,\"start\":1650},{\"end\":1876,\"start\":1747},{\"end\":1979,\"start\":1878},{\"end\":2138,\"start\":1992},{\"end\":2299,\"start\":2153},{\"end\":2389,\"start\":2301},{\"end\":2447,\"start\":2391},{\"end\":2541,\"start\":2462},{\"end\":2649,\"start\":2559},{\"end\":2766,\"start\":2651},{\"end\":2873,\"start\":2768},{\"end\":2943,\"start\":2875},{\"end\":3113,\"start\":2967},{\"end\":3218,\"start\":3115},{\"end\":3323,\"start\":3230},{\"end\":3416,\"start\":3339},{\"end\":3538,\"start\":3450},{\"end\":3727,\"start\":3581},{\"end\":3819,\"start\":3729}]", "title": "[{\"end\":57,\"start\":1},{\"end\":3912,\"start\":3856}]", "venue": null, "abstract": null, "bib_ref": "[{\"end\":4311,\"start\":4307},{\"end\":4420,\"start\":4412},{\"end\":4541,\"start\":4536},{\"end\":4661,\"start\":4655},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":5224,\"start\":5222},{\"end\":5586,\"start\":5580},{\"attributes\":{\"ref_id\":\"b19\"},\"end\":5739,\"start\":5737},{\"end\":5779,\"start\":5772},{\"attributes\":{\"ref_id\":\"b22\"},\"end\":5914,\"start\":5912},{\"attributes\":{\"ref_id\":\"b23\"},\"end\":6296,\"start\":6294},{\"attributes\":{\"ref_id\":\"b24\"},\"end\":6401,\"start\":6399},{\"attributes\":{\"ref_id\":\"b25\"},\"end\":6411,\"start\":6407},{\"end\":6591,\"start\":6575},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":8039,\"start\":8037},{\"attributes\":{\"ref_id\":\"b30\"},\"end\":9514,\"start\":9512},{\"attributes\":{\"ref_id\":\"b31\"},\"end\":15068,\"start\":15066},{\"end\":15942,\"start\":15935},{\"attributes\":{\"ref_id\":\"b34\"},\"end\":16827,\"start\":16825},{\"attributes\":{\"ref_id\":\"b35\"},\"end\":17736,\"start\":17734},{\"attributes\":{\"ref_id\":\"b36\"},\"end\":18128,\"start\":18126},{\"attributes\":{\"ref_id\":\"b37\"},\"end\":19604,\"start\":19602},{\"attributes\":{\"ref_id\":\"b38\"},\"end\":25847,\"start\":25845},{\"attributes\":{\"ref_id\":\"b23\"},\"end\":26182,\"start\":26180},{\"attributes\":{\"ref_id\":\"b39\"},\"end\":26316,\"start\":26314},{\"end\":26613,\"start\":26606},{\"attributes\":{\"ref_id\":\"b29\"},\"end\":26985,\"start\":26983},{\"attributes\":{\"ref_id\":\"b41\"},\"end\":27294,\"start\":27292},{\"attributes\":{\"ref_id\":\"b28\"},\"end\":27518,\"start\":27516},{\"attributes\":{\"ref_id\":\"b27\"},\"end\":27649,\"start\":27647},{\"end\":28570,\"start\":28563},{\"attributes\":{\"ref_id\":\"b37\"},\"end\":28764,\"start\":28762},{\"attributes\":{\"ref_id\":\"b44\"},\"end\":30550,\"start\":30548},{\"end\":31717,\"start\":31710},{\"attributes\":{\"ref_id\":\"b18\"},\"end\":32267,\"start\":32265},{\"attributes\":{\"ref_id\":\"b47\"},\"end\":32557,\"start\":32555},{\"attributes\":{\"ref_id\":\"b48\"},\"end\":32796,\"start\":32794},{\"end\":33081,\"start\":33074},{\"end\":33139,\"start\":33132},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":33658,\"start\":33656},{\"end\":35972,\"start\":35966},{\"attributes\":{\"ref_id\":\"b49\"},\"end\":36282,\"start\":36280},{\"attributes\":{\"ref_id\":\"b30\"},\"end\":37746,\"start\":37744},{\"attributes\":{\"ref_id\":\"b53\"},\"end\":39317,\"start\":39315},{\"attributes\":{\"ref_id\":\"b55\"},\"end\":39619,\"start\":39617},{\"attributes\":{\"ref_id\":\"b55\"},\"end\":41478,\"start\":41476},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":42162,\"start\":42160},{\"attributes\":{\"ref_id\":\"b45\"},\"end\":43003,\"start\":43001},{\"attributes\":{\"ref_id\":\"b59\"},\"end\":43092,\"start\":43090},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":43370,\"start\":43368},{\"end\":43987,\"start\":43976},{\"attributes\":{\"ref_id\":\"b55\"},\"end\":45461,\"start\":45459},{\"attributes\":{\"ref_id\":\"b55\"},\"end\":45785,\"start\":45783},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":46402,\"start\":46400},{\"attributes\":{\"ref_id\":\"b63\"},\"end\":46766,\"start\":46764},{\"end\":49872,\"start\":49855},{\"attributes\":{\"ref_id\":\"b54\"},\"end\":59496,\"start\":59494}]", "figure": "[{\"attributes\":{\"id\":\"fig_0\"},\"end\":57373,\"start\":56770},{\"attributes\":{\"id\":\"fig_1\"},\"end\":59037,\"start\":57374},{\"attributes\":{\"id\":\"fig_2\"},\"end\":59594,\"start\":59038},{\"attributes\":{\"id\":\"fig_3\"},\"end\":59931,\"start\":59595},{\"attributes\":{\"id\":\"fig_4\"},\"end\":59954,\"start\":59932},{\"attributes\":{\"id\":\"fig_5\"},\"end\":59977,\"start\":59955},{\"attributes\":{\"id\":\"fig_6\"},\"end\":61237,\"start\":59978},{\"attributes\":{\"id\":\"fig_7\"},\"end\":61260,\"start\":61238}]", "paragraph": "[{\"end\":5226,\"start\":4184},{\"end\":5588,\"start\":5228},{\"end\":6018,\"start\":5590},{\"end\":6876,\"start\":6020},{\"end\":7860,\"start\":6878},{\"end\":7922,\"start\":7862},{\"end\":8432,\"start\":7924},{\"end\":9669,\"start\":8434},{\"end\":10563,\"start\":9671},{\"end\":10840,\"start\":10565},{\"end\":11620,\"start\":10910},{\"end\":12526,\"start\":11622},{\"end\":13448,\"start\":12588},{\"end\":14048,\"start\":13450},{\"end\":14401,\"start\":14050},{\"end\":14877,\"start\":14403},{\"end\":16606,\"start\":14879},{\"end\":18368,\"start\":16668},{\"end\":19341,\"start\":18370},{\"end\":20217,\"start\":19392},{\"end\":21472,\"start\":20219},{\"end\":22389,\"start\":21531},{\"end\":23450,\"start\":22391},{\"end\":23828,\"start\":23452},{\"end\":24695,\"start\":23830},{\"end\":24788,\"start\":24697},{\"end\":25707,\"start\":24803},{\"end\":26318,\"start\":25766},{\"end\":27569,\"start\":26320},{\"end\":28126,\"start\":27571},{\"end\":29492,\"start\":28169},{\"end\":30392,\"start\":29494},{\"end\":30552,\"start\":30394},{\"end\":31242,\"start\":30554},{\"end\":33410,\"start\":31299},{\"end\":34813,\"start\":33448},{\"end\":35974,\"start\":34815},{\"end\":36801,\"start\":35976},{\"end\":36961,\"start\":36855},{\"end\":39327,\"start\":36963},{\"end\":39789,\"start\":39336},{\"end\":41346,\"start\":39791},{\"end\":42001,\"start\":41348},{\"end\":42199,\"start\":42021},{\"end\":42749,\"start\":42201},{\"end\":43372,\"start\":42751},{\"end\":43762,\"start\":43374},{\"end\":44729,\"start\":43764},{\"end\":44875,\"start\":44731},{\"end\":46289,\"start\":44877},{\"end\":46938,\"start\":46327},{\"end\":47711,\"start\":47059},{\"end\":48808,\"start\":47788},{\"end\":48934,\"start\":48849},{\"end\":49120,\"start\":48936},{\"end\":49125,\"start\":49122},{\"end\":49239,\"start\":49127},{\"end\":49699,\"start\":49272},{\"end\":50216,\"start\":49701},{\"end\":50344,\"start\":50238},{\"end\":50393,\"start\":50346},{\"end\":51003,\"start\":50420},{\"end\":52096,\"start\":51005},{\"end\":56769,\"start\":52110}]", "formula": "[{\"attributes\":{\"id\":\"formula_0\"},\"end\":39335,\"start\":39328}]", "table_ref": "[{\"end\":18683,\"start\":18662},{\"end\":39326,\"start\":39318}]", "section_header": "[{\"end\":4182,\"start\":4170},{\"end\":10850,\"start\":10843},{\"end\":10908,\"start\":10853},{\"end\":12586,\"start\":12529},{\"end\":16666,\"start\":16609},{\"end\":19390,\"start\":19344},{\"end\":21529,\"start\":21475},{\"end\":24801,\"start\":24791},{\"end\":25764,\"start\":25710},{\"end\":28167,\"start\":28129},{\"end\":31297,\"start\":31245},{\"end\":33446,\"start\":33413},{\"end\":36818,\"start\":36804},{\"end\":36853,\"start\":36821},{\"end\":42019,\"start\":42004},{\"end\":46325,\"start\":46292},{\"end\":47057,\"start\":46941},{\"end\":47786,\"start\":47714},{\"end\":48847,\"start\":48811},{\"end\":49270,\"start\":49242},{\"end\":50236,\"start\":50219},{\"end\":50418,\"start\":50396},{\"end\":52108,\"start\":52099},{\"end\":56772,\"start\":56771},{\"end\":57380,\"start\":57375},{\"end\":59943,\"start\":59933},{\"end\":59966,\"start\":59956},{\"end\":59989,\"start\":59979},{\"end\":61249,\"start\":61239}]", "table": null, "figure_caption": "[{\"end\":57373,\"start\":56773},{\"end\":59037,\"start\":57382},{\"end\":59594,\"start\":59040},{\"end\":59931,\"start\":59597},{\"end\":59954,\"start\":59945},{\"end\":59977,\"start\":59968},{\"end\":61237,\"start\":59991},{\"end\":61260,\"start\":61251}]", "figure_ref": "[{\"attributes\":{\"ref_id\":\"fig_1\"},\"end\":7920,\"start\":7912},{\"attributes\":{\"ref_id\":\"fig_1\"},\"end\":11300,\"start\":11280},{\"end\":11830,\"start\":11822},{\"end\":12362,\"start\":12342},{\"attributes\":{\"ref_id\":\"fig_5\"},\"end\":13583,\"start\":13573},{\"attributes\":{\"ref_id\":\"fig_5\"},\"end\":13936,\"start\":13916},{\"attributes\":{\"ref_id\":\"fig_5\"},\"end\":14252,\"start\":14243},{\"attributes\":{\"ref_id\":\"fig_5\"},\"end\":14875,\"start\":14866},{\"attributes\":{\"ref_id\":\"fig_6\"},\"end\":15607,\"start\":15587},{\"attributes\":{\"ref_id\":\"fig_5\"},\"end\":16111,\"start\":16102},{\"attributes\":{\"ref_id\":\"fig_5\"},\"end\":16478,\"start\":16469},{\"attributes\":{\"ref_id\":\"fig_6\"},\"end\":17451,\"start\":17441},{\"attributes\":{\"ref_id\":\"fig_6\"},\"end\":17571,\"start\":17562},{\"attributes\":{\"ref_id\":\"fig_7\"},\"end\":17841,\"start\":17821},{\"attributes\":{\"ref_id\":\"fig_6\"},\"end\":18287,\"start\":18277},{\"attributes\":{\"ref_id\":\"fig_6\"},\"end\":19339,\"start\":19330},{\"attributes\":{\"ref_id\":\"fig_7\"},\"end\":22465,\"start\":22454},{\"attributes\":{\"ref_id\":\"fig_7\"},\"end\":22782,\"start\":22773},{\"attributes\":{\"ref_id\":\"fig_7\"},\"end\":22909,\"start\":22899},{\"end\":23049,\"start\":23029},{\"attributes\":{\"ref_id\":\"fig_7\"},\"end\":23119,\"start\":23110},{\"end\":23157,\"start\":23137},{\"attributes\":{\"ref_id\":\"fig_7\"},\"end\":23398,\"start\":23388},{\"attributes\":{\"ref_id\":\"fig_7\"},\"end\":24236,\"start\":24226},{\"attributes\":{\"ref_id\":\"fig_5\"},\"end\":29298,\"start\":29289},{\"attributes\":{\"ref_id\":\"fig_7\"},\"end\":29310,\"start\":29301},{\"end\":34046,\"start\":34026},{\"end\":35823,\"start\":35803},{\"attributes\":{\"ref_id\":\"fig_1\"},\"end\":38738,\"start\":38725},{\"attributes\":{\"ref_id\":\"fig_7\"},\"end\":50086,\"start\":50078},{\"end\":52765,\"start\":52745},{\"attributes\":{\"ref_id\":\"fig_5\"},\"end\":53501,\"start\":53481}]", "bib_author_first_name": "[{\"end\":61449,\"start\":61448},{\"end\":61630,\"start\":61629},{\"end\":61638,\"start\":61637},{\"end\":61814,\"start\":61813},{\"end\":61816,\"start\":61815},{\"end\":61824,\"start\":61823},{\"end\":61826,\"start\":61825},{\"end\":61838,\"start\":61837},{\"end\":61846,\"start\":61845},{\"end\":61856,\"start\":61855},{\"end\":62102,\"start\":62101},{\"end\":62112,\"start\":62111},{\"end\":62356,\"start\":62355},{\"end\":62631,\"start\":62630},{\"end\":62633,\"start\":62632},{\"end\":62869,\"start\":62868},{\"end\":62871,\"start\":62870},{\"end\":62879,\"start\":62878},{\"end\":62881,\"start\":62880},{\"end\":63140,\"start\":63139},{\"end\":63150,\"start\":63149},{\"end\":63152,\"start\":63151},{\"end\":63162,\"start\":63161},{\"end\":63164,\"start\":63163},{\"end\":63176,\"start\":63175},{\"end\":63178,\"start\":63177},{\"end\":63501,\"start\":63500},{\"end\":63503,\"start\":63502},{\"end\":63510,\"start\":63509},{\"end\":63512,\"start\":63511},{\"end\":63823,\"start\":63822},{\"end\":63825,\"start\":63824},{\"end\":64085,\"start\":64084},{\"end\":64087,\"start\":64086},{\"end\":64334,\"start\":64333},{\"end\":64342,\"start\":64341},{\"end\":64353,\"start\":64352},{\"end\":64369,\"start\":64368},{\"end\":64371,\"start\":64370},{\"end\":64701,\"start\":64700},{\"end\":64703,\"start\":64702},{\"end\":65036,\"start\":65035},{\"end\":65038,\"start\":65037},{\"end\":65322,\"start\":65321},{\"end\":65324,\"start\":65323},{\"end\":65331,\"start\":65330},{\"end\":65333,\"start\":65332},{\"end\":65344,\"start\":65343},{\"end\":65346,\"start\":65345},{\"end\":65640,\"start\":65639},{\"end\":65642,\"start\":65641},{\"end\":65885,\"start\":65884},{\"end\":65897,\"start\":65896},{\"end\":65899,\"start\":65898},{\"end\":66154,\"start\":66153},{\"end\":66165,\"start\":66164},{\"end\":66176,\"start\":66175},{\"end\":66187,\"start\":66186},{\"end\":66577,\"start\":66576},{\"end\":66579,\"start\":66578},{\"end\":66588,\"start\":66587},{\"end\":66911,\"start\":66910},{\"end\":66913,\"start\":66912},{\"end\":67223,\"start\":67222},{\"end\":67225,\"start\":67224},{\"end\":67232,\"start\":67231},{\"end\":67239,\"start\":67238},{\"end\":67617,\"start\":67616},{\"end\":67619,\"start\":67618},{\"end\":67943,\"start\":67942},{\"end\":67945,\"start\":67944},{\"end\":68196,\"start\":68195},{\"end\":68204,\"start\":68203},{\"end\":68488,\"start\":68487},{\"end\":68501,\"start\":68500},{\"end\":68503,\"start\":68502},{\"end\":68512,\"start\":68511},{\"end\":68530,\"start\":68529},{\"end\":68552,\"start\":68551},{\"end\":68918,\"start\":68917},{\"end\":68920,\"start\":68919},{\"end\":68928,\"start\":68927},{\"end\":68930,\"start\":68929},{\"end\":68941,\"start\":68940},{\"end\":68943,\"start\":68942},{\"end\":69215,\"start\":69214},{\"end\":69217,\"start\":69216},{\"end\":69468,\"start\":69467},{\"end\":69807,\"start\":69806},{\"end\":69817,\"start\":69816},{\"end\":69819,\"start\":69818},{\"end\":69830,\"start\":69829},{\"end\":70176,\"start\":70175},{\"end\":70178,\"start\":70177},{\"end\":70190,\"start\":70189},{\"end\":70192,\"start\":70191},{\"end\":70201,\"start\":70200},{\"end\":70203,\"start\":70202},{\"end\":70218,\"start\":70217},{\"end\":70220,\"start\":70219},{\"end\":70226,\"start\":70225},{\"end\":70228,\"start\":70227},{\"end\":70556,\"start\":70555},{\"end\":70792,\"start\":70791},{\"end\":70794,\"start\":70793},{\"end\":70806,\"start\":70805},{\"end\":70808,\"start\":70807},{\"end\":71093,\"start\":71092},{\"end\":71095,\"start\":71094},{\"end\":71106,\"start\":71105},{\"end\":71108,\"start\":71107},{\"end\":71115,\"start\":71114},{\"end\":71117,\"start\":71116},{\"end\":71417,\"start\":71416},{\"end\":71419,\"start\":71418},{\"end\":71427,\"start\":71426},{\"end\":71429,\"start\":71428},{\"end\":71440,\"start\":71439},{\"end\":71442,\"start\":71441},{\"end\":71451,\"start\":71450},{\"end\":71453,\"start\":71452},{\"end\":71463,\"start\":71462},{\"end\":71465,\"start\":71464},{\"end\":71765,\"start\":71764},{\"end\":71773,\"start\":71772},{\"end\":71775,\"start\":71774},{\"end\":71786,\"start\":71785},{\"end\":72066,\"start\":72065},{\"end\":72078,\"start\":72077},{\"end\":72080,\"start\":72079},{\"end\":72358,\"start\":72357},{\"end\":72360,\"start\":72359},{\"end\":72624,\"start\":72623},{\"end\":72626,\"start\":72625},{\"end\":72637,\"start\":72636},{\"end\":72639,\"start\":72638},{\"end\":72910,\"start\":72909},{\"end\":72912,\"start\":72911},{\"end\":72921,\"start\":72920},{\"end\":72923,\"start\":72922},{\"end\":73208,\"start\":73207},{\"end\":73210,\"start\":73209},{\"end\":73217,\"start\":73216},{\"end\":73502,\"start\":73501},{\"end\":73815,\"start\":73814},{\"end\":73825,\"start\":73824},{\"end\":73836,\"start\":73835},{\"end\":74314,\"start\":74313},{\"end\":74731,\"start\":74730},{\"end\":74733,\"start\":74732},{\"end\":74743,\"start\":74742},{\"end\":74745,\"start\":74744},{\"end\":74756,\"start\":74755},{\"end\":74758,\"start\":74757},{\"end\":74769,\"start\":74768},{\"end\":74771,\"start\":74770},{\"end\":75093,\"start\":75092},{\"end\":75095,\"start\":75094},{\"end\":75102,\"start\":75101},{\"end\":75104,\"start\":75103},{\"end\":75114,\"start\":75113},{\"end\":75116,\"start\":75115},{\"end\":75125,\"start\":75124},{\"end\":75127,\"start\":75126},{\"end\":75462,\"start\":75461},{\"end\":75472,\"start\":75471},{\"end\":75474,\"start\":75473},{\"end\":75484,\"start\":75483},{\"end\":75486,\"start\":75485},{\"end\":75746,\"start\":75745},{\"end\":75748,\"start\":75747},{\"end\":75974,\"start\":75973},{\"end\":75976,\"start\":75975},{\"end\":76218,\"start\":76217},{\"end\":76220,\"start\":76219},{\"end\":76459,\"start\":76458},{\"end\":76461,\"start\":76460},{\"end\":76471,\"start\":76470},{\"end\":76473,\"start\":76472},{\"end\":76486,\"start\":76485},{\"end\":76488,\"start\":76487},{\"end\":76726,\"start\":76725},{\"end\":76728,\"start\":76727},{\"end\":76953,\"start\":76952},{\"end\":76955,\"start\":76954},{\"end\":77243,\"start\":77242},{\"end\":77245,\"start\":77244},{\"end\":77503,\"start\":77502},{\"end\":77505,\"start\":77504},{\"end\":77522,\"start\":77521},{\"end\":77532,\"start\":77531},{\"end\":77534,\"start\":77533},{\"end\":77543,\"start\":77542},{\"end\":77790,\"start\":77789},{\"end\":77792,\"start\":77791},{\"end\":78061,\"start\":78060},{\"end\":78348,\"start\":78347},{\"end\":78350,\"start\":78349},{\"end\":78682,\"start\":78681},{\"end\":78695,\"start\":78694},{\"end\":78708,\"start\":78707},{\"end\":78717,\"start\":78716},{\"end\":79042,\"start\":79041},{\"end\":79044,\"start\":79043},{\"end\":79328,\"start\":79327},{\"end\":79330,\"start\":79329},{\"end\":79339,\"start\":79338},{\"end\":79593,\"start\":79592},{\"end\":79595,\"start\":79594},{\"end\":79607,\"start\":79606},{\"end\":79609,\"start\":79608},{\"end\":79619,\"start\":79618},{\"end\":79628,\"start\":79627},{\"end\":79630,\"start\":79629},{\"end\":79903,\"start\":79902},{\"end\":79905,\"start\":79904},{\"end\":80183,\"start\":80182},{\"end\":80185,\"start\":80184},{\"end\":80480,\"start\":80479},{\"end\":80482,\"start\":80481},{\"end\":80493,\"start\":80492},{\"end\":80495,\"start\":80494},{\"end\":80506,\"start\":80505},{\"end\":80521,\"start\":80520},{\"end\":80523,\"start\":80522},{\"end\":80531,\"start\":80530},{\"end\":80533,\"start\":80532},{\"end\":80885,\"start\":80884},{\"end\":80893,\"start\":80892},{\"end\":80895,\"start\":80894},{\"end\":80906,\"start\":80905},{\"end\":81233,\"start\":81232},{\"end\":81235,\"start\":81234}]", "bib_author_last_name": "[{\"end\":61458,\"start\":61450},{\"end\":61635,\"start\":61631},{\"end\":61643,\"start\":61639},{\"end\":61821,\"start\":61817},{\"end\":61835,\"start\":61827},{\"end\":61843,\"start\":61839},{\"end\":61853,\"start\":61847},{\"end\":61863,\"start\":61857},{\"end\":62109,\"start\":62103},{\"end\":62119,\"start\":62113},{\"end\":62363,\"start\":62357},{\"end\":62638,\"start\":62634},{\"end\":62876,\"start\":62872},{\"end\":62889,\"start\":62882},{\"end\":63147,\"start\":63141},{\"end\":63159,\"start\":63153},{\"end\":63173,\"start\":63165},{\"end\":63183,\"start\":63179},{\"end\":63507,\"start\":63504},{\"end\":63520,\"start\":63513},{\"end\":63829,\"start\":63826},{\"end\":64093,\"start\":64088},{\"end\":64339,\"start\":64335},{\"end\":64350,\"start\":64343},{\"end\":64366,\"start\":64354},{\"end\":64381,\"start\":64372},{\"end\":64710,\"start\":64704},{\"end\":65042,\"start\":65039},{\"end\":65328,\"start\":65325},{\"end\":65341,\"start\":65334},{\"end\":65355,\"start\":65347},{\"end\":65650,\"start\":65643},{\"end\":65894,\"start\":65886},{\"end\":65906,\"start\":65900},{\"end\":66162,\"start\":66155},{\"end\":66173,\"start\":66166},{\"end\":66184,\"start\":66177},{\"end\":66194,\"start\":66188},{\"end\":66585,\"start\":66580},{\"end\":66595,\"start\":66589},{\"end\":66920,\"start\":66914},{\"end\":67229,\"start\":67226},{\"end\":67236,\"start\":67233},{\"end\":67253,\"start\":67240},{\"end\":67623,\"start\":67620},{\"end\":67952,\"start\":67946},{\"end\":68201,\"start\":68197},{\"end\":68208,\"start\":68205},{\"end\":68498,\"start\":68489},{\"end\":68509,\"start\":68504},{\"end\":68527,\"start\":68513},{\"end\":68549,\"start\":68531},{\"end\":68562,\"start\":68553},{\"end\":68925,\"start\":68921},{\"end\":68938,\"start\":68931},{\"end\":68948,\"start\":68944},{\"end\":69224,\"start\":69218},{\"end\":69479,\"start\":69469},{\"end\":69814,\"start\":69808},{\"end\":69827,\"start\":69820},{\"end\":69837,\"start\":69831},{\"end\":70187,\"start\":70179},{\"end\":70198,\"start\":70193},{\"end\":70215,\"start\":70204},{\"end\":70223,\"start\":70221},{\"end\":70236,\"start\":70229},{\"end\":70564,\"start\":70557},{\"end\":70803,\"start\":70795},{\"end\":70820,\"start\":70809},{\"end\":71103,\"start\":71096},{\"end\":71112,\"start\":71109},{\"end\":71125,\"start\":71118},{\"end\":71424,\"start\":71420},{\"end\":71437,\"start\":71430},{\"end\":71448,\"start\":71443},{\"end\":71460,\"start\":71454},{\"end\":71474,\"start\":71466},{\"end\":71770,\"start\":71766},{\"end\":71783,\"start\":71776},{\"end\":71790,\"start\":71787},{\"end\":72075,\"start\":72067},{\"end\":72088,\"start\":72081},{\"end\":72366,\"start\":72361},{\"end\":72634,\"start\":72627},{\"end\":72646,\"start\":72640},{\"end\":72918,\"start\":72913},{\"end\":72930,\"start\":72924},{\"end\":73214,\"start\":73211},{\"end\":73226,\"start\":73218},{\"end\":73506,\"start\":73503},{\"end\":73822,\"start\":73816},{\"end\":73833,\"start\":73826},{\"end\":73845,\"start\":73837},{\"end\":74323,\"start\":74315},{\"end\":74740,\"start\":74734},{\"end\":74753,\"start\":74746},{\"end\":74766,\"start\":74759},{\"end\":74781,\"start\":74772},{\"end\":75099,\"start\":75096},{\"end\":75111,\"start\":75105},{\"end\":75122,\"start\":75117},{\"end\":75135,\"start\":75128},{\"end\":75469,\"start\":75463},{\"end\":75481,\"start\":75475},{\"end\":75491,\"start\":75487},{\"end\":75757,\"start\":75749},{\"end\":75984,\"start\":75977},{\"end\":76229,\"start\":76221},{\"end\":76468,\"start\":76462},{\"end\":76483,\"start\":76474},{\"end\":76494,\"start\":76489},{\"end\":76738,\"start\":76729},{\"end\":76965,\"start\":76956},{\"end\":77252,\"start\":77246},{\"end\":77519,\"start\":77506},{\"end\":77529,\"start\":77523},{\"end\":77540,\"start\":77535},{\"end\":77550,\"start\":77544},{\"end\":77801,\"start\":77793},{\"end\":78066,\"start\":78062},{\"end\":78354,\"start\":78351},{\"end\":78692,\"start\":78683},{\"end\":78705,\"start\":78696},{\"end\":78714,\"start\":78709},{\"end\":78723,\"start\":78718},{\"end\":79050,\"start\":79045},{\"end\":79336,\"start\":79331},{\"end\":79346,\"start\":79340},{\"end\":79604,\"start\":79596},{\"end\":79616,\"start\":79610},{\"end\":79625,\"start\":79620},{\"end\":79636,\"start\":79631},{\"end\":79913,\"start\":79906},{\"end\":80192,\"start\":80186},{\"end\":80490,\"start\":80483},{\"end\":80503,\"start\":80496},{\"end\":80518,\"start\":80507},{\"end\":80528,\"start\":80524},{\"end\":80537,\"start\":80534},{\"end\":80890,\"start\":80886},{\"end\":80903,\"start\":80896},{\"end\":80910,\"start\":80907},{\"end\":81239,\"start\":81236}]", "bib_entry": "[{\"attributes\":{\"id\":\"b0\"},\"end\":61580,\"start\":61387},{\"attributes\":{\"id\":\"b1\"},\"end\":61764,\"start\":61582},{\"attributes\":{\"id\":\"b2\",\"matched_paper_id\":5222581},\"end\":62050,\"start\":61766},{\"attributes\":{\"id\":\"b3\",\"matched_paper_id\":5278040},\"end\":62280,\"start\":62052},{\"attributes\":{\"id\":\"b4\",\"matched_paper_id\":25371624},\"end\":62541,\"start\":62282},{\"attributes\":{\"id\":\"b5\",\"matched_paper_id\":12534290},\"end\":62824,\"start\":62543},{\"attributes\":{\"id\":\"b6\",\"matched_paper_id\":11924421},\"end\":63047,\"start\":62826},{\"attributes\":{\"id\":\"b7\",\"matched_paper_id\":775793},\"end\":63402,\"start\":63049},{\"attributes\":{\"id\":\"b8\",\"matched_paper_id\":15979590},\"end\":63726,\"start\":63404},{\"attributes\":{\"id\":\"b9\",\"matched_paper_id\":211041},\"end\":64030,\"start\":63728},{\"attributes\":{\"id\":\"b10\",\"matched_paper_id\":10833296},\"end\":64234,\"start\":64032},{\"attributes\":{\"id\":\"b11\",\"matched_paper_id\":33718048},\"end\":64607,\"start\":64236},{\"attributes\":{\"id\":\"b12\",\"matched_paper_id\":1982658},\"end\":64899,\"start\":64609},{\"attributes\":{\"id\":\"b13\",\"matched_paper_id\":8291950},\"end\":65235,\"start\":64901},{\"attributes\":{\"id\":\"b14\",\"matched_paper_id\":14946623},\"end\":65552,\"start\":65237},{\"attributes\":{\"id\":\"b15\",\"matched_paper_id\":382404},\"end\":65826,\"start\":65554},{\"attributes\":{\"id\":\"b16\"},\"end\":66025,\"start\":65828},{\"attributes\":{\"id\":\"b17\",\"matched_paper_id\":13472127},\"end\":66443,\"start\":66027},{\"attributes\":{\"id\":\"b18\",\"matched_paper_id\":19677258},\"end\":66828,\"start\":66445},{\"attributes\":{\"id\":\"b19\",\"matched_paper_id\":16617609},\"end\":67096,\"start\":66830},{\"attributes\":{\"id\":\"b20\",\"matched_paper_id\":5661759},\"end\":67489,\"start\":67098},{\"attributes\":{\"id\":\"b21\",\"matched_paper_id\":16612693},\"end\":67873,\"start\":67491},{\"attributes\":{\"id\":\"b22\",\"matched_paper_id\":6678757},\"end\":68118,\"start\":67875},{\"attributes\":{\"id\":\"b23\",\"matched_paper_id\":5316941},\"end\":68386,\"start\":68120},{\"attributes\":{\"id\":\"b24\",\"matched_paper_id\":740913},\"end\":68829,\"start\":68388},{\"attributes\":{\"id\":\"b25\",\"matched_paper_id\":7864360},\"end\":69155,\"start\":68831},{\"attributes\":{\"id\":\"b26\",\"matched_paper_id\":24606031},\"end\":69379,\"start\":69157},{\"attributes\":{\"id\":\"b27\",\"matched_paper_id\":11775998},\"end\":69666,\"start\":69381},{\"attributes\":{\"id\":\"b28\",\"matched_paper_id\":15229780},\"end\":70091,\"start\":69668},{\"attributes\":{\"id\":\"b29\",\"matched_paper_id\":15209146},\"end\":70470,\"start\":70093},{\"attributes\":{\"id\":\"b30\",\"matched_paper_id\":14691526},\"end\":70737,\"start\":70472},{\"attributes\":{\"id\":\"b31\",\"matched_paper_id\":5539313},\"end\":70987,\"start\":70739},{\"attributes\":{\"id\":\"b32\",\"matched_paper_id\":16128451},\"end\":71346,\"start\":70989},{\"attributes\":{\"id\":\"b33\",\"matched_paper_id\":13369488},\"end\":71669,\"start\":71348},{\"attributes\":{\"id\":\"b34\",\"matched_paper_id\":7541619},\"end\":71994,\"start\":71671},{\"attributes\":{\"id\":\"b35\",\"matched_paper_id\":1540678},\"end\":72271,\"start\":71996},{\"attributes\":{\"id\":\"b36\",\"matched_paper_id\":9561988},\"end\":72547,\"start\":72273},{\"attributes\":{\"id\":\"b37\",\"matched_paper_id\":791838},\"end\":72838,\"start\":72549},{\"attributes\":{\"id\":\"b38\",\"matched_paper_id\":43020208},\"end\":73106,\"start\":72840},{\"attributes\":{\"id\":\"b39\"},\"end\":73396,\"start\":73108},{\"attributes\":{\"id\":\"b40\",\"matched_paper_id\":6822827},\"end\":73707,\"start\":73398},{\"attributes\":{\"id\":\"b41\",\"matched_paper_id\":22955178},\"end\":74087,\"start\":73709},{\"attributes\":{\"id\":\"b42\",\"matched_paper_id\":207142804},\"end\":74650,\"start\":74089},{\"attributes\":{\"id\":\"b43\",\"matched_paper_id\":17511663},\"end\":74988,\"start\":74652},{\"attributes\":{\"id\":\"b44\",\"matched_paper_id\":15840903},\"end\":75360,\"start\":74990},{\"attributes\":{\"id\":\"b45\",\"matched_paper_id\":3100335},\"end\":75696,\"start\":75362},{\"attributes\":{\"id\":\"b46\",\"matched_paper_id\":15592121},\"end\":75906,\"start\":75698},{\"attributes\":{\"id\":\"b47\",\"matched_paper_id\":989784},\"end\":76152,\"start\":75908},{\"attributes\":{\"id\":\"b48\",\"matched_paper_id\":6182773},\"end\":76394,\"start\":76154},{\"attributes\":{\"id\":\"b49\",\"matched_paper_id\":27307613},\"end\":76672,\"start\":76396},{\"attributes\":{\"id\":\"b50\",\"matched_paper_id\":3207782},\"end\":76888,\"start\":76674},{\"attributes\":{\"id\":\"b51\",\"matched_paper_id\":33357464},\"end\":77130,\"start\":76890},{\"attributes\":{\"id\":\"b52\",\"matched_paper_id\":428300},\"end\":77459,\"start\":77132},{\"attributes\":{\"id\":\"b53\",\"matched_paper_id\":5819390},\"end\":77719,\"start\":77461},{\"attributes\":{\"id\":\"b54\",\"matched_paper_id\":11161047},\"end\":77969,\"start\":77721},{\"attributes\":{\"id\":\"b55\",\"matched_paper_id\":20713721},\"end\":78252,\"start\":77971},{\"attributes\":{\"id\":\"b56\",\"matched_paper_id\":512175},\"end\":78570,\"start\":78254},{\"attributes\":{\"id\":\"b57\",\"matched_paper_id\":14396189},\"end\":78956,\"start\":78572},{\"attributes\":{\"id\":\"b58\",\"matched_paper_id\":13466517},\"end\":79248,\"start\":78958},{\"attributes\":{\"id\":\"b59\",\"matched_paper_id\":18237627},\"end\":79521,\"start\":79250},{\"attributes\":{\"id\":\"b60\",\"matched_paper_id\":10367962},\"end\":79830,\"start\":79523},{\"attributes\":{\"id\":\"b61\",\"matched_paper_id\":7652329},\"end\":80082,\"start\":79832},{\"attributes\":{\"id\":\"b62\",\"matched_paper_id\":2334567},\"end\":80388,\"start\":80084},{\"attributes\":{\"id\":\"b63\",\"matched_paper_id\":1165000},\"end\":80774,\"start\":80390},{\"attributes\":{\"id\":\"b64\",\"matched_paper_id\":9160108},\"end\":81133,\"start\":80776},{\"attributes\":{\"id\":\"b65\",\"matched_paper_id\":17672338},\"end\":81433,\"start\":81135}]", "bib_title": "[{\"end\":61627,\"start\":61582},{\"end\":61811,\"start\":61766},{\"end\":62099,\"start\":62052},{\"end\":62353,\"start\":62282},{\"end\":62628,\"start\":62543},{\"end\":62866,\"start\":62826},{\"end\":63137,\"start\":63049},{\"end\":63498,\"start\":63404},{\"end\":63820,\"start\":63728},{\"end\":64082,\"start\":64032},{\"end\":64331,\"start\":64236},{\"end\":64698,\"start\":64609},{\"end\":65033,\"start\":64901},{\"end\":65319,\"start\":65237},{\"end\":65637,\"start\":65554},{\"end\":66151,\"start\":66027},{\"end\":66574,\"start\":66445},{\"end\":66908,\"start\":66830},{\"end\":67220,\"start\":67098},{\"end\":67614,\"start\":67491},{\"end\":67940,\"start\":67875},{\"end\":68193,\"start\":68120},{\"end\":68485,\"start\":68388},{\"end\":68915,\"start\":68831},{\"end\":69212,\"start\":69157},{\"end\":69465,\"start\":69381},{\"end\":69804,\"start\":69668},{\"end\":70173,\"start\":70093},{\"end\":70553,\"start\":70472},{\"end\":70789,\"start\":70739},{\"end\":71090,\"start\":70989},{\"end\":71414,\"start\":71348},{\"end\":71762,\"start\":71671},{\"end\":72063,\"start\":71996},{\"end\":72355,\"start\":72273},{\"end\":72621,\"start\":72549},{\"end\":72907,\"start\":72840},{\"end\":73499,\"start\":73398},{\"end\":73812,\"start\":73709},{\"end\":74311,\"start\":74089},{\"end\":74728,\"start\":74652},{\"end\":75090,\"start\":74990},{\"end\":75459,\"start\":75362},{\"end\":75743,\"start\":75698},{\"end\":75971,\"start\":75908},{\"end\":76215,\"start\":76154},{\"end\":76456,\"start\":76396},{\"end\":76723,\"start\":76674},{\"end\":76950,\"start\":76890},{\"end\":77240,\"start\":77132},{\"end\":77500,\"start\":77461},{\"end\":77787,\"start\":77721},{\"end\":78058,\"start\":77971},{\"end\":78345,\"start\":78254},{\"end\":78679,\"start\":78572},{\"end\":79039,\"start\":78958},{\"end\":79325,\"start\":79250},{\"end\":79590,\"start\":79523},{\"end\":79900,\"start\":79832},{\"end\":80180,\"start\":80084},{\"end\":80477,\"start\":80390},{\"end\":80882,\"start\":80776},{\"end\":81230,\"start\":81135}]", "bib_author": "[{\"end\":61460,\"start\":61448},{\"end\":61637,\"start\":61629},{\"end\":61645,\"start\":61637},{\"end\":61823,\"start\":61813},{\"end\":61837,\"start\":61823},{\"end\":61845,\"start\":61837},{\"end\":61855,\"start\":61845},{\"end\":61865,\"start\":61855},{\"end\":62111,\"start\":62101},{\"end\":62121,\"start\":62111},{\"end\":62365,\"start\":62355},{\"end\":62640,\"start\":62630},{\"end\":62878,\"start\":62868},{\"end\":62891,\"start\":62878},{\"end\":63149,\"start\":63139},{\"end\":63161,\"start\":63149},{\"end\":63175,\"start\":63161},{\"end\":63185,\"start\":63175},{\"end\":63509,\"start\":63500},{\"end\":63522,\"start\":63509},{\"end\":63831,\"start\":63822},{\"end\":64095,\"start\":64084},{\"end\":64341,\"start\":64333},{\"end\":64352,\"start\":64341},{\"end\":64368,\"start\":64352},{\"end\":64383,\"start\":64368},{\"end\":64712,\"start\":64700},{\"end\":65044,\"start\":65035},{\"end\":65330,\"start\":65321},{\"end\":65343,\"start\":65330},{\"end\":65357,\"start\":65343},{\"end\":65652,\"start\":65639},{\"end\":65896,\"start\":65884},{\"end\":65908,\"start\":65896},{\"end\":66164,\"start\":66153},{\"end\":66175,\"start\":66164},{\"end\":66186,\"start\":66175},{\"end\":66196,\"start\":66186},{\"end\":66587,\"start\":66576},{\"end\":66597,\"start\":66587},{\"end\":66922,\"start\":66910},{\"end\":67231,\"start\":67222},{\"end\":67238,\"start\":67231},{\"end\":67255,\"start\":67238},{\"end\":67625,\"start\":67616},{\"end\":67954,\"start\":67942},{\"end\":68203,\"start\":68195},{\"end\":68210,\"start\":68203},{\"end\":68500,\"start\":68487},{\"end\":68511,\"start\":68500},{\"end\":68529,\"start\":68511},{\"end\":68551,\"start\":68529},{\"end\":68564,\"start\":68551},{\"end\":68927,\"start\":68917},{\"end\":68940,\"start\":68927},{\"end\":68950,\"start\":68940},{\"end\":69226,\"start\":69214},{\"end\":69481,\"start\":69467},{\"end\":69816,\"start\":69806},{\"end\":69829,\"start\":69816},{\"end\":69839,\"start\":69829},{\"end\":70189,\"start\":70175},{\"end\":70200,\"start\":70189},{\"end\":70217,\"start\":70200},{\"end\":70225,\"start\":70217},{\"end\":70238,\"start\":70225},{\"end\":70566,\"start\":70555},{\"end\":70805,\"start\":70791},{\"end\":70822,\"start\":70805},{\"end\":71105,\"start\":71092},{\"end\":71114,\"start\":71105},{\"end\":71127,\"start\":71114},{\"end\":71426,\"start\":71416},{\"end\":71439,\"start\":71426},{\"end\":71450,\"start\":71439},{\"end\":71462,\"start\":71450},{\"end\":71476,\"start\":71462},{\"end\":71772,\"start\":71764},{\"end\":71785,\"start\":71772},{\"end\":71792,\"start\":71785},{\"end\":72077,\"start\":72065},{\"end\":72090,\"start\":72077},{\"end\":72368,\"start\":72357},{\"end\":72636,\"start\":72623},{\"end\":72648,\"start\":72636},{\"end\":72920,\"start\":72909},{\"end\":72932,\"start\":72920},{\"end\":73216,\"start\":73207},{\"end\":73228,\"start\":73216},{\"end\":73508,\"start\":73501},{\"end\":73824,\"start\":73814},{\"end\":73835,\"start\":73824},{\"end\":73847,\"start\":73835},{\"end\":74325,\"start\":74313},{\"end\":74742,\"start\":74730},{\"end\":74755,\"start\":74742},{\"end\":74768,\"start\":74755},{\"end\":74783,\"start\":74768},{\"end\":75101,\"start\":75092},{\"end\":75113,\"start\":75101},{\"end\":75124,\"start\":75113},{\"end\":75137,\"start\":75124},{\"end\":75471,\"start\":75461},{\"end\":75483,\"start\":75471},{\"end\":75493,\"start\":75483},{\"end\":75759,\"start\":75745},{\"end\":75986,\"start\":75973},{\"end\":76231,\"start\":76217},{\"end\":76470,\"start\":76458},{\"end\":76485,\"start\":76470},{\"end\":76496,\"start\":76485},{\"end\":76740,\"start\":76725},{\"end\":76967,\"start\":76952},{\"end\":77254,\"start\":77242},{\"end\":77521,\"start\":77502},{\"end\":77531,\"start\":77521},{\"end\":77542,\"start\":77531},{\"end\":77552,\"start\":77542},{\"end\":77803,\"start\":77789},{\"end\":78068,\"start\":78060},{\"end\":78356,\"start\":78347},{\"end\":78694,\"start\":78681},{\"end\":78707,\"start\":78694},{\"end\":78716,\"start\":78707},{\"end\":78725,\"start\":78716},{\"end\":79052,\"start\":79041},{\"end\":79338,\"start\":79327},{\"end\":79348,\"start\":79338},{\"end\":79606,\"start\":79592},{\"end\":79618,\"start\":79606},{\"end\":79627,\"start\":79618},{\"end\":79638,\"start\":79627},{\"end\":79915,\"start\":79902},{\"end\":80194,\"start\":80182},{\"end\":80492,\"start\":80479},{\"end\":80505,\"start\":80492},{\"end\":80520,\"start\":80505},{\"end\":80530,\"start\":80520},{\"end\":80539,\"start\":80530},{\"end\":80892,\"start\":80884},{\"end\":80905,\"start\":80892},{\"end\":80912,\"start\":80905},{\"end\":81241,\"start\":81232}]", "bib_venue": "[{\"end\":61446,\"start\":61387},{\"end\":61661,\"start\":61645},{\"end\":61881,\"start\":61865},{\"end\":62137,\"start\":62121},{\"end\":62378,\"start\":62365},{\"end\":62656,\"start\":62640},{\"end\":62908,\"start\":62891},{\"end\":63199,\"start\":63185},{\"end\":63538,\"start\":63522},{\"end\":63845,\"start\":63831},{\"end\":64101,\"start\":64095},{\"end\":64393,\"start\":64383},{\"end\":64724,\"start\":64712},{\"end\":65056,\"start\":65044},{\"end\":65367,\"start\":65357},{\"end\":65658,\"start\":65652},{\"end\":65882,\"start\":65828},{\"end\":66207,\"start\":66196},{\"end\":66607,\"start\":66597},{\"end\":66932,\"start\":66922},{\"end\":67265,\"start\":67255},{\"end\":67647,\"start\":67625},{\"end\":67968,\"start\":67954},{\"end\":68224,\"start\":68210},{\"end\":68578,\"start\":68564},{\"end\":68965,\"start\":68950},{\"end\":69236,\"start\":69226},{\"end\":69491,\"start\":69481},{\"end\":69849,\"start\":69839},{\"end\":70252,\"start\":70238},{\"end\":70572,\"start\":70566},{\"end\":70834,\"start\":70822},{\"end\":71161,\"start\":71127},{\"end\":71482,\"start\":71476},{\"end\":71802,\"start\":71792},{\"end\":72106,\"start\":72090},{\"end\":72378,\"start\":72368},{\"end\":72664,\"start\":72648},{\"end\":72946,\"start\":72932},{\"end\":73205,\"start\":73108},{\"end\":73518,\"start\":73508},{\"end\":73870,\"start\":73847},{\"end\":74337,\"start\":74325},{\"end\":74792,\"start\":74783},{\"end\":75149,\"start\":75137},{\"end\":75503,\"start\":75493},{\"end\":75769,\"start\":75759},{\"end\":75998,\"start\":75986},{\"end\":76241,\"start\":76231},{\"end\":76506,\"start\":76496},{\"end\":76750,\"start\":76740},{\"end\":76977,\"start\":76967},{\"end\":77262,\"start\":77254},{\"end\":77562,\"start\":77552},{\"end\":77819,\"start\":77803},{\"end\":78079,\"start\":78068},{\"end\":78378,\"start\":78356},{\"end\":78735,\"start\":78725},{\"end\":79062,\"start\":79052},{\"end\":79358,\"start\":79348},{\"end\":79648,\"start\":79638},{\"end\":79925,\"start\":79915},{\"end\":80204,\"start\":80194},{\"end\":80553,\"start\":80539},{\"end\":80926,\"start\":80912},{\"end\":81251,\"start\":81241}]"}}}, "year": 2023, "month": 12, "day": 17}