{"id": 115174238, "updated": "2023-09-27 03:51:50.949", "metadata": {"title": "The trigonometric Casimir connection of a simple Lie algebra", "authors": "[{\"first\":\"Valerio\",\"last\":\"Toledano-Laredo\",\"middle\":[]}]", "venue": "Journal of Algebra 329 (2011), 286-327", "journal": null, "publication_date": {"year": 2010, "month": null, "day": null}, "abstract": "Let g be a complex, semisimple Lie algebra, G the corresponding simply-connected Lie group and H a maximal torus in G. We construct a flat connection on H with logarithmic singularities on the root hypertori and values in the Yangian Y(g) of g. By analogy with the rational Casimir connection of g, we conjecture that the monodromy of this trigonometric connection is described by the quantum Weyl group operators of the quantum loop algebra U_h(Lg).", "fields_of_study": "[\"Mathematics\"]", "external_ids": {"arxiv": "1003.2017", "mag": null, "acl": null, "pubmed": null, "pubmedcentral": null, "dblp": null, "doi": "10.1016/j.jalgebra.2010.05.025"}}, "content": {"source": {"pdf_hash": "4e307ba7f282382191ef68ea32bb0db8667a8336", "pdf_src": "Arxiv", "pdf_uri": "[\"https://arxiv.org/pdf/1003.2017v2.pdf\"]", "oa_url_match": false, "oa_info": {"license": "elsevier-specific: oa user license", "open_access_url": "https://doi.org/10.1016/j.jalgebra.2010.05.025", "status": "BRONZE"}}, "grobid": {"id": "c800ddcdf19f93bf1297666167f67728263d4ef3", "type": "plain-text", "url": "s3://ai2-s2-pdf-extraction-prod/parse-results/s2orc_worker/4e307ba7f282382191ef68ea32bb0db8667a8336.txt", "contents": "\nTHE TRIGONOMETRIC CASIMIR CONNECTION OF A SIMPLE LIE ALGEBRA\n2 Jul 2010\n\nToledano Valerio \nLaredo \nTHE TRIGONOMETRIC CASIMIR CONNECTION OF A SIMPLE LIE ALGEBRA\n2 Jul 2010To Corrado De Concini, on his 60th birthday Contents\nLet g be a complex, semisimple Lie algebra, G the corresponding simply-connected Lie group and H ⊂ G a maximal torus. We construct a flat connection on H with logarithmic singularities on the root hypertori and values in the Yangian Y (g) of g. By analogy with the rational Casimir connection of g, we conjecture that the monodromy of this trigonometric connection is described by the quantum Weyl group operators of the quantum loop algebra U (Lg).\n\n1. Introduction 1.1. Let g be a complex, simple Lie algebra, h ⊂ g a Cartan subalgebra, Φ ⊂ h * the corresponding root system and W its Weyl group. For each α ∈ Φ, let sl α 2 = e α , f α , h α ⊂ g be the corresponding three-dimensional subalgebra and denote by κ α = (α, α) 2 (e α f α + f α e α ) Supported in part by NSF grants DMS-0707212 and DMS-0854792. 1 its truncated Casimir operator with respect to the restriction to sl α 2 of a fixed non-degenerate, ad-invariant bilinear form (·, ·) on g. Let\nh reg = h \\ α∈Φ Ker(α)\nbe the set of regular elements in h, V a finite-dimensional g-module, and V the holomorphically trivial vector bundle over h reg with fibre V . Recall that the Casimir connection of g is the holomorphic connection on V given by\n∇ κ = d − α∈Φ + dα α κ α (1.1)\nwhere d is the de Rham differential, Φ + ⊂ Φ is a system of positive roots and is a complex number. This connection was discovered independently by C. De Concini around 1995 (unpublished), by J. Millson and the author [MTL,TL1] and Felder et al. [FMTV], and shown to be flat for any ∈ C.\n\nThe monodromy of ∇ κ gives representations of the generalised braid group B = π 1 (h reg /W ) which are described by the quantum Weyl group operators of the quantum group U g, a fact which was conjectured by De Concini (unpublished) and independently in [TL1,TL2] and proved in [TL1,TL3].\n\n1.2. Let P ⊂ h * be the weight lattice of g and H = Hom Z (P, C * ) the dual algebraic torus with Lie algebra h and coordinate ring given by the group algebra CP . We denote the function corresponding to λ ∈ P by e λ ∈ C [H]. The main goal of the present paper is to define a trigonometric version of the connection (1.1), that is a connection defined on H with the logarithmic forms dα/α replaced by dα/(e α − 1).\n\nAs is well known from the study of Cherednik's affine KZ (AKZ) connection (see, e.g. [Ch3]), both the flatness and W -equivariance of such a connection require that it possess a 'tail', that is be of the form\n∇ κ = d − α∈Φ + dα e α − 1 κ α − A (1.2)\nwhere A is a translation-invariant one-form on H. The analogy with the AKZ equations further suggests that A should take values in a suitable extension of the enveloping algebra U g, which is to U g what the degenerate affine Hecke algebra H ′ is to the group algebra CW .\n\n1.3. The correct extension turns out to be the Yangian Y (g), which is a deformation of the enveloping algebra U (g [t]) over the ring C[ ]. Let ν : h → h * be the isomorphism determined by the inner product (·, ·), set t i = ν −1 (α i ), where α 1 , . . . , α n are the simple roots of g relative to Φ + and let t i = λ ∨ i be the dual basis of h given by the fundamental coweights. Let T (u) r , u ∈ h, r ∈ N be the Cartan loop generators of Y (g) in Drinfeld's new realisation (see [Dr2] and §3 for definitions). Let {u i } be a basis of h, {u i } the dual basis of h * and regard the differentials du i as translation-invariant one-forms on H. The main result of this paper is the following Theorem. The Y (g)-valued connection on H given by\n∇ κ = d − α∈Φ + dα e α − 1 κ α + du i 2T (u i ) 1 − 2 (u i , t j )t 2 j\nis flat and W -equivariant 1 .\n\n1.4. We call ∇ κ the trigonometric Casimir connection of g. Its monodromy defines representations of the affine braid group B = π 1 (H reg /W ) on any finite-dimensional module over Y (g), where\nH reg = H \\ α∈Φ {e α = 1}\nis the set of regular elements in H. By analogy with the rational case, we conjecture that these representations are equivalent to the quantum Weyl group action of B on finite-dimensional modules over the quantum loop algebra U (g[z, z −1 ]).\n\n1.5. We turn now to a detailed description of the paper. In Section 2 we obtain a necessary and sufficient condition for a connection of the form (1.2) to be flat and equivariant under the Weyl group W (Theorem 2.5 and Proposition 2.22), thus effectively determining the Lie algebras of the fundamental groups π 1 (H reg ) and π 1 (H reg /W ). Consistently with Cherednik's study of the AKZ connection, the quadratic equations giving the flatness and equivariance of ∇ κ specialise, when κ α is replaced by the orthogonal reflection s α ∈ W to the defining relations of the degenerate affine Hecke algebra corresponding to W .\n\nIn Section 3 we review Drinfeld's two presentations of the Yangian Y (g) of a simple Lie algebra g. We then use their interplay to solve the above quadratic equations in Y (g), thereby obtaining the trigonometric Casimir connection of g (Theorem 3.8).\n\nIn Section 4, we explain how to define monodromy representations of the affine braid group from ∇ κ and conjecture that these are described by the quantum Weyl group operators of the quantum loop algebra U (g[z, z −1 ]).\n\nIn Section 5, we define a trigonometric connection with values in the Yangian of gl n by using the interplay between its loop and RTT presentations (Theorem 5.7). We then relate it to the trigonometric Casimir connection of sl n . We also check that, when computed in a tensor product of m evaluation modules, it coincides with the trigonometric dynamical differential equations [TV] which are differential equations on (C × ) n with values in U gl ⊗m n . In Section 6, we show that the trigonometric Casimir connection commutes with qKZ difference equations of Frenkel-Reshetikhin determined by the rational R-matrix of Y (g) (Theorem 6.6), a fact which was checked in [TV] for the trigonometric dynamical differential equations.\n\nIn Section 7, we review the definition of the degenerate affine Hecke algebra H ′ of W [Lu] and of the corresponding H ′ -valued AKZ connection [Ch3]. We then show that if V is a Y (g)-module whose restriction to g is small, that is such that 2α is not a weight for any root α [Br, Re], the zero weight space V [0] carries a natural action of H ′ . Moreover, the trigonometric Casimir connection with coefficients in V [0] coincides with the AKZ connection with values in this H ′ -module (Theorem 7.5).\n\nThe final appendix, Section 8 contains a discussion of the Tits extensions of affine Weyl groups which is needed for Section 4.\n\n2. The trigonometric connection of a root system 2.1. General form. Let E be a Euclidean vector space, Φ ⊂ E * a reduced, crystallographic root system. Let Q ∨ ⊂ E be the lattice generated by the coroots α ∨ , α ∈ Φ and P ⊂ E * the dual weight lattice. Let H = Hom Z (P, C * ) be the complex algebraic torus with Lie algebra h = Hom Z (P, C) and coordinate ring given by the group algebra CP . We denote the function corresponding to λ ∈ P by e λ ∈ C[H] and set\nH reg = H \\ α∈Φ {e α = 1} (2.1)\nLet A be an algebra endowed with the following data:\n• a set of elements {t α } α∈Φ ⊂ A such that t −α = t α • a linear map τ : h → A\nConsider the A-valued connection on H reg given by\n∇ = d − α∈Φ + dα e α − 1 t α − du i τ (u i ) (2.2)\nwhere Φ + ⊂ Φ is a chosen system of positive roots, {u i } and {u i } are dual bases of h * and h respectively, the differentials du i are regarded as translation-invariant one-forms on H and the summation over i is implicit.\n\n2.2. Positive roots. The form of the connection (2.2) depends upon the choice of the system of positive roots Φ + ⊂ Φ. Let however Φ ′ + ⊂ Φ be another such system, then\n\nProposition. The connection (2.2) may be rewritten as\n∇ = d − α∈Φ ′ + dα e α − 1 t α − du i τ ′ (u i ) where τ ′ : h → A is given by τ ′ (v) = τ (v) − α∈Φ + ∩Φ ′ − α(v) t α (2.3)\nProof. Write the second summand in (2.2) as\nα∈Φ + ∩Φ ′ + dα e α − 1 t α − α∈Φ − ∩Φ ′ + dα e −α − 1 t −α where Φ − = −Φ + . Since 1 1 − e −α = e α e α − 1 = 1 e α − 1 + 1 (2.4)\nand t −α = t α , the above is equal to\nα∈Φ ′ + dα e α − 1 t α + α∈Φ − ∩Φ ′ + dα t α which yields the required result since α = u i α(u i ).\nDefinition. If W is the Weyl group of Φ and w ∈ W the unique element such that Φ ′ + = wΦ + , we denote τ ′ by τ w . Thus,\nτ w (v) = τ (v) − α∈Φ + ∩wΦ − α(v) t α (2.5) 2.3. Delta form. Choose Φ ′ + = Φ − in Proposition 2.2.\nComparing the corresponding expressions for ∇ shows that it may be more invariantly rewritten as\n∇ = d − 1 2 α∈Φ dα e α − 1 t α − du i δ(u i )\nwhere δ : h → A is given by\nδ(v) = τ (v) − 1 2 α∈Φ + α(v) t α (2.6)\nAlternatively, substituting (2.6) into (2.2) yields\n∇ = d − 1 2 α∈Φ + e α + 1 e α − 1 dα t α − du i δ(u i ) (2.7)\nWe shall occasionally refer to (2.2) and (2.7) as the τ and δ-forms of the connection ∇ respectively. Note that the latter does not depend upon the choice of Φ + ⊂ Φ.\n\n2.4. Root subsystems. For a subset Ψ ⊂ Φ and subring R ⊂ R, let Ψ R ⊂ E * be the R-span of Ψ.\nDefinition. A root subsystem of Φ is a subset Ψ ⊂ Φ such that Ψ Z ∩Φ = Ψ. Ψ is complete if Ψ R ∩ Φ = Ψ. If Ψ ⊂ Φ is a root subsystem, we set Ψ + = Ψ ∩ Φ + .\nRemark. According to the above definition, the short roots of the root system B 2 (resp. G 2 ) are not a root subsystem, but the long ones constitute a root subsystem of type A 1 × A 1 (resp. A 2 ) which is not complete. Another root subsystem of Φ = G 2 is given by {±α, ±β} where α, β are two orthogonal roots (necessarily of different lengths).\n\n2.5. Integrability. The following is the main result of this section.\n\nTheorem.\n\n(1) The connection ∇ is flat if, and only if the following relations hold\n\n• For any rank 2 root subsystem Ψ ⊂ Φ and α ∈ Ψ,\n[t α , β∈Ψ + t β ] = 0 (tt) • For any u, v ∈ h, [τ (u), τ (v)] = 0 (τ τ ) • For any α ∈ Φ + , w ∈ W such that w −1 α is a simple root and u ∈ h such that α(u) = 0, [t α , τ w (u)] = 0(tτ )\n(2) Modulo the relations (tt), the relations (tτ ) are equivalent to\n[t α , δ(v)] = 0 (tδ)\nfor any α ∈ Φ and v ∈ h such that α(v) = 0, where δ : h → A is given by (2.6).\n\nThe proof of Theorem 2.5 occupies the paragraphs 2.7-2.19.\n\n2.6. We spell out below the relations (tt) in the case when Φ is of rank 2. For Ψ = Φ, they read\n[t α , β∈Φ + t β ] = 0 for any α ∈ Φ (Φ) In particular, if Φ = {±α, ±β} is of type A 1 × A 1 then [t α , t β ] = 0 (A 1 × A 1 ) For Φ = B 2 , the long roots {±β 1 , ±β 2 } form an A 1 × A 1 subsystem so that [t β 1 , t β 2 ] = 0 (A 1 × A 1 ⊂ B 2 )\nFor Φ = G 2 , there are two types of root subsystems: that formed by the A 2 configuration of long roots {±β 1 , ±β 2 , ±β 3 }, leading to\n[t β i , t β j + t β k ] = 0 for any i, j, k ∈ {1, 2, 3} distinct (A 2 ⊂ G 2 )\nand the A 1 configurations {±β, ±γ} formed by a long root and an orthogonal short one, leading to [t β , t γ ] = 0\n(A 1 × A 1 ⊂ G 2 )\nCombining relations (Φ), (A 2 ⊂ G 2 ) and (A 1 × A 1 ⊂ G 2 ) yields in particular the following relations\n[t β , t γ ′ + t γ ′′ ] = 0 (2.8)\nwhere β ∈ G 2 is long and γ ′ , γ ′′ are the short positive roots which are not orthogonal to β.\n\nRemark. If Φ is not simply-laced, the relations (tt) are stronger than those yielding the flatness of the rational connection\n∇ = d − α∈Φ + dα α t α\nIndeed, the latter involve two dimensional subspaces of h * spanned by elements of Φ [Ko] and therefore only those rank 2 subsystems of Φ which are complete. The relevance of additional relations corresponding to noncomplete subsystems was first pointed out in the closely related context of the Yang-Baxter equations by Cherednik [Ch3, §6.1].\n\n2.7. Let Q ⊂ P be the root lattice generated by Φ and T = Hom Z (Q, C * ) the corresponding complex algebraic torus of adjoint type. T has coordinate ring CQ and is biregularly isomorphic to the standard torus (C * ) n by sending p ∈ T to the point with coordinates z i = e −α i (p), where α i varies over the simple roots of Φ relative to Φ + .\n\n2.8. The torus T is a quotient of H and the form of ∇ shows that it may be regarded as a connection on the trivial vector bundle with fibre A over T . As such, ∇ has singularities on the codimension one subtori\nT α = {e α = 1} ⊂ T\nwhere α ∈ Φ. Given a subset Ψ ⊂ Φ, we shall be interested in the connectedness of the intersection α∈Ψ T α . Let Ψ Z ⊂ Q be the Z-span of Ψ and set [DCP,§3.1]\nΨ Z = {γ ∈ Q| mγ ∈ Ψ Z for some m ∈ Z * } Since C[ α∈Ψ T α ] = C Q/ Ψ Z ∼ = C Q/ Ψ Z ⊗ C Ψ Z / Ψ Z\nthe connected components of α∈Ψ T α are tori labelled by the characters of the finite abelian group Ψ Z / Ψ Z . In particular, if Ψ = {α}, we see that each T α is connected since α is indivisible in Q.\n\n2.9. The necessity of relations (tt)-(tτ ) follows from the computation of the residues of the curvature Ω of ∇ to be carried out in §2.10- §2.14.\nSpecifically, write ∇ = d − A. Since dA = 0, Ω is equal to A ∧ A = Ω 1 + Ω 2 + Ω 3 , where Ω 1 = 1 2 α,β dα e α − 1 ∧ dβ e β − 1 [t α , t β ] (2.9) Ω 2 = α,i dα e α − 1 ∧ du i [t α , τ (u i )]\n(2.10)\nΩ 3 = 1 2 i,j du i ∧ du j [τ (u i ), τ (u j )]\n(2.11) 2.10. Let α ∈ Φ and denote the inclusion T α ֒→ T by ı α . Then\nres Tα Ω 1 = ı * α β =α dβ e β − 1 [t α , t β ]\nres Tα Ω 2 = ı * α du i [t α , τ (u i )] and res Tα Ω 3 = 0 since Ω 3 is regular on T α .\n\n2.11. Let Ψ ⊂ Φ be a rank 2 root subsystem and set\nT Ψ = β∈Ψ T β\nBy §2.8, T Ψ is a codimension two subtorus of T with group of components Hom( Ψ Z / Ψ Z , C * ).\n\nSince Ψ Z / Ψ Z is cyclic (of order 1, 2 or 3 depending on the type of Ψ and Ψ Z ∩ Φ), there exists a character χ of Ψ Z / Ψ Z with trivial kernel. It follows that the corresponding component T χ Ψ of T Ψ is contained in some T γ if, and only if, γ ∈ Ψ.\n\nTogether with §2.10, this implies that for any α ∈ Ψ,\nres T γ Ψ res Tα Ω = [t α , β∈Ψ + t β ]\nthus showing the necessity of (tt).\n\n2.12. Let T ∼ = C n be the partial compactification determined by the embedding T ֒→ (C * ) n given by sending p ∈ T to the point with coordinates z i = e −α i (p). We wish to determine the residues of Ω on the divisors\nT i = {z i = 0} ⊂ T\nTo this end, we first rewrite ∇ in the coordinates z i . Choosing u i = α i as basis of h * , so that the dual basis {u i } of h is given by the fundamental coweights {λ ∨ i } yields du i = −dz i /z i and\ndu i τ (u i ) = − dz i z i τ (λ ∨ i ) Further, if α = i m i α α i is a positive root, then e α = i z −m i α i so that dα e α − 1 = e −α 1 − e −α dα = − i m i α z m i α −1 i j =i z m j α j 1 − j z m j α j dz i\nwhich is a regular on each T i . It follows that res T i Ω 1 = 0 and\nres T i Ω 2 = ı * i α dα e α − 1 [t α , τ (λ ∨ i )] res T i Ω 3 = ı * i j =i dz j z j [τ (λ ∨ i ), τ (λ ∨ j )]\nwhere ı i is the inclusion T i ֒→ T .\n\n2.13. Thus, for any j = i,\nres T j ∩T i res T i Ω = [τ (λ ∨ j ), τ (λ ∨ i )]\nwhich shows the necessity of the relations (τ τ ).\n\n2.14. Let now α = i m i α α i be a positive root and let\nT α = { i z m i α i = 1} be the closure of T α in T . The intersection T α,i = T α ∩ T i ⊂ T\nis clearly nonempty if, and only if α(λ ∨ i ) = m i α = 0. When that is the case, T α,i is connected and contained in no other T β , β = j or T j for j = i.\n\nIt follows that whenever α(λ ∨ i ) = 0,\nres T α,i res Tα Ω = [t α , τ (λ ∨ i )]\nthus showing the necessity of (tτ ) for α simple and w = 1. The general case follows by repeating the computations of the last two subsections in the compactification of T corresponding to a different basis w∆ of simple roots and using the alternative form of the connection ∇ given by Proposition 2.2.\n\n2.15. We next turn to the sufficiency of the relations (tt)-(τ τ ). This may be proved by embedding T in the toric variety corresponding to the fan determined by the chambers of Φ in E and using a general integrability criterion of E. Looijenga as in [Lo,[1][2] 2 . We prefer a more direct approach which will occupy §2.16-2.19.\n\n2.16. Since the relations (τ τ ) imply that Ω 3 = 0, we need to show that the relations (tt)-(tτ ) imply that Ω 1 + Ω 2 = 0. To this end, we rewrite Ω 2 in a different form below and, in §2.17 rewrite Ω 1 .\n\nLemma. Modulo the relations (tτ ), the curvature term\nΩ α 2 = i dα e α − 1 ∧ du i [t α , τ (u i )]\ncorresponding to α ∈ Φ + is equal to\nβ∈Φ + ∩wΦ − dα e α − 1 ∧ dβ [t α , t β ]\nfor any w ∈ W such that w −1 α is a simple root.\n\nProof. Let w ∈ W be such that w −1 α is a simple root α i . By (2.5),\nΩ α 2 = j dα e α − 1 ∧ du j [t α , τ w (u j ) + β∈Φ + ∩wΦ − β(u j ) t β ] Choosing u j = wα j yields a commutator [t α , τ w (u j )] = [t α , τ w (wλ ∨ j )] which is zero for all j = i by (tτ ). Since dα ∧ wα i = 0, this yields Ω α 2 = j dα e α − 1 ∧du j [t α , β∈Φ + ∩wΦ − β(u j ) t β ] = β∈Φ + ∩wΦ − dα e α − 1 ∧dβ [t α , t β ] since β = β(u i )u i 2.\n17. For any a ∈ Q, let η a be the meromorphic one-form on T given by\nη a = da e a − 1\nLemma. Let Ψ ⊂ Φ be a rank 2 root subsystem and consider the curvature term\nΩ Ψ 1 = 1 2 α,β∈Ψ + η α ∧ η β [t α , t β ]\nAssume that the relations (tt) hold. Then, if Ψ is of type A 1 × A 1 ,\nΩ Ψ 1 = 0 (2.12) If Ψ is of type A 2 with Ψ + = {α, β, α + β} Ω Ψ 1 = −η α+β ∧ dβ [t α+β , t β ] (2.13) If Ψ is of type B 2 with Ψ + = {α, β, α ± β} Ω Ψ 1 = −η α+β ∧ dβ [t α+β , t β ] − η α ∧ d(α − β) [t α , t α−β ]\n(2.14)\n\nIf Ψ is of type G 2 , with Ψ + = {α 1 , α 2 , α 1 + α 2 , α 1 + 2α 2 , α 1 + 3α 2 , 2α 1 + 3α 2 }\nΩ Ψ 1 = − η α 1 +α 2 ∧ dα 1 [t α 1 +α 2 , t α 1 ] (2.15) − η α 1 +2α 2 ∧ (dα 2 [t α 1 +2α 2 , t α 2 ] + d(α 1 + 3α 2 ) [t α 1 +2α 2 , t α 1 +3α 2 ]) − η α 1 +3α 2 ∧ dα 2 [t α 1 +3α 2 , t α 2 ] − η 2α 1 +3α 2 ∧ (dα 1 [t 2α 1 +3α 2 , t α 1 ] + d(α 1 + α 2 ) [t 2α 1 +3α 2 , t α 1 +α 2 ])\nProof. If Ψ is of type A 1 × A 1 , the result follows from (A 1 × A 1 ). For other types, we shall need the following easily verified identity. For a, b ∈ Q, set\nη a,b = da ∧ db e a+b − 1\nThen,\nη a ∧ η b = η a ∧ η a+b + η a+b ∧ η b + η a,b (2.16)\nWe shall apply (2.16) to Ω Ψ 1 repeatedly, specifically to terms of the form η α ∧ η β with α + β ∈ Φ + , until no such terms are left.\n\nFor Ψ + = {α, β, α + β} of type A 2 , this yields\nΩ Ψ 1 = η α+β ∧ η α [t α+β + t β , t α ] + η α+β ∧ η β [t α+β + t α , t β ] + η α,β [t α , t β ]\nBy (Φ), the first two commutators are 0 and the third is equal to [t α , t β ] = [t α + t β , t β ] = −[t α+β , t β ]. This yields the required answer since\nη a,b = η a+b ∧ db = −η a+b ∧ da (2.17)\nTo keep track of the repeated applications of (2.16) for Ψ ot type B 2 , G 2 , we proceed as follows. Recall that the height of α = i m i α α i ∈ Φ + is defined by ht(α) = i m i α . Arrange pairs of distinct roots (α, β) on consecutive rows according to the value of ht(α) + ht(β): each (α, β) stands for a term η α ∧ η β . From each pair (α, β) such that α + β ∈ Φ + draw an arrow to (α, α + β) and (α + β, β) to signify that (2.16) has been applied with a = α and b = β.\n\nFor Ψ + = {α, β, α ± β} of type B 2 with simple roots α 1 = α − β, α 2 = β, the corresponding graph is\n(α − β, β) x x q q q q q 6 6 s s s s s (α − β, α) (α, β) 6 6 s s s s s Ô Ô Ø Ø Ø Ø Ø Ø Ø Ø Ø Ø (α − β, α + β) (α + β, β) (α, α + β)\nThis yields an \"η a ∧ η b \" component of Ω Ψ 1 equal to\nη α−β ∧ η α [t α−β , t α + t β ] + η α−β ∧ η α+β [t α−β , t α+β ] + η α+β ∧ η β [t α+β + t α + t α−β , t β ] + η α ∧ η α+β ([t α , t α+β + t β ] + [t α−β , t β ])\nThe second commutator is equal to zero by (A 1 × A 1 ⊂ B 2 ), the first by (Φ) and (A 1 × A 1 ⊂ B 2 ) and the third by (Φ). By (Φ), the coefficient of\nη α ∧η α+β is equal to −[t α , t α−β ] + [t α−β , t β ] = [t α−β , t α + t β ] = 0. Ω Ψ 1 is therefore equal to its \"η a,b \" component, namely η α−β,β [t α−β , t β ] + η α,β [t α + t α−β , t β ]\nwhich yields the required answer since, by (Φ)\n[t α + t α−β , t β ] = −[t α+β , t β ]\nand by (Φ) and (\nA 1 × A 1 ⊂ B 2 ) [t α−β , t β ] = −[t α−β , t α + t α+β ] = −[t α−β , t α ]\nwhile, as previously noted\nη a,b = η a+b ∧ db = −η a+b ∧ da\nAssume now that Ψ is of type G 2 and has simple roots α 1 , α 2 , with α 1 long. The sets of long and short positive roots are, respectively Ψ ℓ + = {α 1 , 2α 1 + 3α 2 , α 1 + 3α 2 } and Ψ s + = {α 1 + α 2 , α 1 + 2α 2 , α 2 } and the pairs (β, γ) of orthogonal positive roots are\n(α 1 , α 1 + 2α 2 ), (2α 1 + 3α 2 , α 2 ), (α 1 + 3α 2 , α 1 + α 2 )\nThe corresponding graph reads\n(α 1 , α 2 ) s s h h h h h h h h h h h h C C (α 1 , α 1 + α 2 ) (α 1 + α 2 , α 2 ) This yields an η a,b component of Ω Ψ 1 equal to η α 1 ,α 2 [t α 1 , t α 2 ] + η α 1 +α 2 ,α 2 [t α 1 +α 2 + t α 1 , t α 2 ] + η α 1 +2α 2 ,α 2 [t α 1 +2α 2 + t α 1 +α 2 + t α 1 , t α 2 ] + η α 1 ,α 1 +3α 2 [t α 1 , t α 1 +3α 2 ] + η α 1 +α 2 ,α 1 +2α 2 ([t α 1 +α 2 , t α 1 +2α 2 + t α 2 ] + [t α 1 , t α 2 ]) By (2.8), the first commutator is equal to −[t α 1 , t α 1 +α 2 ]. By (Φ) and (A 1 × A 1 ⊂ G 2 ), the third commutator is equal to −[t α 1 +3α 2 , t α 2 ]. The sec- ond commutator is therefore equal to −[t α 1 +3α 2 + t α 1 +2α 2 , t α 2 ] = −[t α 1 +2α 2 , t α 2 + t α 1 +3α 2 ]\nwhere we used (2.8). By (A 2 ⊂ G 2 ), the fourth commutator is equal to\n−[t α 1 , t 2α 1 +3α 2 ]. Finally, the coefficient of η α 1 +α 2 ,α 1 +2α 2 is equal to −[t α 1 +α 2 , t α 1 + t 2α 1 +3α 2 ] + [t α 1 , t α 2 ] = [t 2α 1 +3α 2 , t α 1 +α 2 ]\nwhere we used (2.8). Using (2.17) shows that the right-hand side of (2.15) is\nequal to the η a,b -component of Ω Ψ 1 . A similar use of relations (Φ), (A 2 ⊂ G 2 ) and (A 1 × A 1 ⊂ G 2 ) shows that the η a ∧ η b component of Ω Ψ\n1 is zero and therefore completes the proof 2.18.\n\nCorollary. Assume that the relations (tt) and (tτ ) hold. Then, for any rank 2 root subsystem Ψ ⊂ Φ, the curvature term Ω Ψ 1 is equal to\nΩ Ψ 1 = − α∈Ψ + β∈Ψ + ∩wαΨ − η α ∧ dβ [t α , t β ]\nwhere w α is any element of the Weyl group of Ψ such that w −1 α α is simple in Ψ.\n\nProof. Lemma 2.17 and a simple case-by-case inspection show that Ω Ψ 1 does indeed have the above form for well-chosen elements w α (specifically, w α should be an element of shortest length such that w −1 α α is simple in Ψ). But Lemma 2.16 applied to Ψ implies that the expression\nβ∈Ψ + ∩wαΦ − η α ∧ dβ [t α , t β ]\nis independent of the choice of w α , hence the conclusion.\n\n2.19. Completion of the proof of (1) of Theorem 2.5. Fix α ∈ Φ + and let R 2 (α) be the set of complete, rank 2 subsystems Ψ ⊂ Φ containing α as a non-simple root. For Ψ ∈ R 2 (α), denote the corresponding Weyl group by W (Ψ).\n\nFor any w ∈ W , denote by N (w) ⊂ Φ + the set\nN (w) = {β ∈ Φ + | wβ ∈ Φ − } and define similarly N Ψ (w) ⊂ Ψ + for any w ∈ W (Ψ).\nThe following result, together with Lemma 2.16 and Corollary 2.18 show that Ω 1 + Ω 2 = 0 and therefore that the connection (2.2) is flat.\nProposition. Let w ∈ W be such that w −1 α is simple in Φ.\n(1) For any Ψ ∈ R 2 (α), the intersection N (w −1 ) ∩ Ψ is non-empty.\n\n(2) The following holds\nN (w −1 ) = Ψ∈R 2 (α) N (w −1 ) ∩ Ψ (3) For any Ψ ∈ R 2 (α), there exists a unique w Ψ ∈ W (Ψ) such that N (w −1 ) ∩ Ψ = N Ψ (w −1 Ψ ) Proof.\nFor any pair of non-proportional roots β, γ ∈ Φ, let β, γ ⊂ Φ be the complete, rank 2 subsystem generated by β and γ. We claim that the map β → α, β induces a bijection\nρ : N (w −1 ) ∼ −→ R 2 (α) where ∼ is the equivalence relation defined by β ∼ β ′ if α, β = α, β ′ .\nThis clearly proves (1) and (2) \nsince ρ −1 (Ψ) = Ψ ∩ N (w −1 ).\nTo see this, we shall need some notation. For any complete subsystem Ψ ⊂ Φ, let Ψ ⊥ = β∈Ψ H β ⊂ E, where H β = Ker(β). Set E Ψ = E/Ψ ⊥ so that Ψ may be regarded as a root system in E * Ψ , and let π Ψ : E → E Ψ be the corresponding projection. If β ∈ N (w −1 ), the wall H β separates the fundamental chamber C ⊂ E of Φ and C ′ = w(C). Thus, if Ψ = α, β , π Ψ (H β ) separates the fundamental chamber π Ψ (C) of Ψ and π Ψ (C ′ ). It follows that π Ψ (C) = π Ψ (C ′ ) so that α is not simple in Ψ since π Ψ (H α ) is a wall of π Ψ (C ′ ), whence α, β ∈ R 2 (α) and ρ is a well-defined embedding.\n\nIt is also surjective since if Ψ ∈ R 2 (α), there exists a β ∈ Ψ + such that π Ψ (H β ) separates π Ψ (C) and π Ψ (C ′ ) so that H β separates C and C ′ and therefore lies in N (w −1 ).\n\nFinally, for a given Ψ ∈ R 2 (α), the set N (w −1 ) ∩ Ψ consists of those β ∈ Ψ + which separate C and C ′ and therefore π Ψ (C) and π Ψ (C ′ ). It is\ntherefore equal to Ψ + ∩ w Ψ Ψ − where w Ψ ∈ W (Ψ) is the unique element such that π Ψ (C ′ ) = w Ψ π Ψ (C).\n2.20. We now turn to part (2) of Theorem 2.5. We shall need the following Lemma. The relations (tt) imply that the following holds for any\nα ∈ Φ + , w ∈ W such that w −1 α is simple and v ∈ h such that α(v) = 0 [t α , β∈Φ + sign(w −1 β)β(v)t β ] = 0 (t w t)\nwhere sign(γ) = ±1 depending on whether γ ∈ ±Φ + .\n\nProof. Let T be the algebra generated by symbols t α , α ∈ Φ subject to the relations t −α = t α and (tt). The Weyl group acts on T by wt α = t wα and it is easy to check that the above relation holds for a triple (α, w, v) if, and only if, it holds for (w −1 α, 1, w −1 v). We may therefore assume that α is simple and that w = 1. Since the left-hand side of (t w t) may be written as\nΨ β∈Ψ + [t α , β(v)t β ]\nwhere Ψ ranges over the complete, rank 2 subsystems of Φ containing α, it is sufficient to prove (t w t) when Φ is of rank 2. In this case, it follows by a simple case-by-case verification.\nFor example, if Φ + = {α 1 , α 2 , α 1 + α 2 , α 1 + 2α 2 , α 1 + 3α 2 , 2α 1 + 3α 2 } is of type G 2 , we have [t α 2 , β∈Φ + β(λ ∨ 1 )t β ] = [t α 2 , β∈Φ + t β ] + [t α 2 , t 2α 1 +3α 2 ] = 0 by (Φ) and (A 1 × A 1 ⊂ G 2 ), while [t α 1 , β∈Φ + β(λ ∨ 2 )t β ] = [t α 1 , β∈Φ + t β ] + [t α 1 , t α 1 +2α 2 ] + 2[t α 1 , t 2α 1 +3α 2 + t α 1 +3α 2 ] which is equal to zero by (Φ), (A 1 × A 1 ⊂ G 2 ) and (A 2 ⊂ G 2 ) 2.21. Recall from §2.3 that δ : h → A is defined by δ(v) = τ (v) − 1 2 α∈Φ + α(v)t α\nThe following proves part (2) of Theorem 2.5\n\nProposition. Modulo the relations (tt), the relations (tτ ) are equivalent to\n[t α , δ(v)] = 0 (tδ) for any α ∈ Φ and v ∈ h such that α(v) = 0.\nProof. For any w ∈ W (2.5), yields\nτ w (v) = τ (v) − α∈Φ + ∩wΦ − α(v)t α = δ(v) + 1 2 β∈Φ + sign(w −1 β)β(v)t β (v)\nThe result now follows from Lemma 2.20.\n\n\n2.22.\n\nEquivariance under W . Assume now that the algebra A is acted upon by the Weyl group W of Φ.\n\nProposition.\n\n(1) The connection ∇ is W -equivariant if, and only if\ns i (t α ) = t s i α (2.18) s i (τ (x)) − τ (s i x) = (α i , x)t α i (2.19)\nfor any α ∈ Φ, simple reflection s i ∈ W and x ∈ h.\n\n(2) Modulo (2.18), the relation (2.19) is equivalent to the W -equivariance of the linear map δ : h → A defined by (2.6).\n\nProof.\n\n(1) Since s i permutes the set Φ + \\ {α i } and, by (2.4)\n1 1 − e −α i = 1 e α i − 1 + 1 we get s * i ∇ = d − α∈Φ + dα e α − 1 s i (t α ) − dα i s i (t α i ) − s i (τ (u j ))d(s i u j )\nRequiring that s * i ∇ = ∇ and taking residues along each subtorus {e α = 1} yields (2.18). To proceed, note that\ns i (τ (u j ))d(s i u j ) = s i (τ (s i u j ))d(u j ) since τ (u j )du j is independent of the choice of the dual bases {u j }, {u j }. Thus, s * i ∇ = ∇ reduces to τ (u j )du j = s i (τ (s i u j ))du j + t α i dα i which, upon being contracted along the tangent vector u k yields (2.19) with x = s i u j .\n(2) It is easy to check that the map τ (x) = 1/2 α∈Φ + (x, α)t α satisfies (2.19). The result now follows since any two maps τ i : h → A satisfying (2.19) differ by a W -equivariant map.\n\n2.23. Flatness and equivariance. The following is a direct corollary of Theorem 2.5 and Proposition 2.22\n\nTheorem. The trigonometric connection\n∇ = d − α∈Φ + dα e α − 1 t α − d(u i ) τ (u i )\nis flat and W -equivariant if, and only if the following relations hold • For any rank 2 root subsystem Ψ ⊂ Φ and α ∈ Ψ,\n[t α , β∈Ψ + t β ] = 0 • For any u, v ∈ h, [τ (u), τ (v)] = 0 • For any simple root α i and u ∈ Ker(α i ), [t α i , τ (u)] = 0 • For any α ∈ Φ and simple reflection s i ∈ W , s i (t α ) = t s i α • For any α ∈ Φ and u ∈ h, s i (τ (u)) − τ (s i u) = (α i , u)t α i\nRemark. Theorem 2.23 was first proved by Cherednik in the special case when t α is equal to the orthogonal reflection s α ∈ W and shown to lead to the definition of the degenerate affine Hecke algebra of W [Ch1,Ch2].\n\n3. The trigonometric Casimir connection 3.1. The Yangian Y (g) [Dr1]. Let g be a finite-dimensional, simple Lie algebra over C and (·, ·) a non-degenerate, invariant bilinear form on g. Let be a formal variable. The Yangian Y (g) is the associative algebra over C[ ] generated by elements x, J(x), x ∈ g subject to the relations\nλx + µy (in Y (g)) = λx + µy (in g) xy − yx = [x, y] J(λx + µy) = λJ(x) + µJ(y) [x, J(y)] = J([x, y]) [J(x), J([y, z])] + [J(z), J([x, y])] + [J(y), J([z, x])] = 2 ([x, x a ], [[y, x b ], [z, x c ]]){x a , x b , x c } [[J(x), J(y)], [z, J(w)]] + [[J(z), J(w)], [x, J(y)]] = 2 ([x, x a ], [[y, x b ], [[z, w], x c ]]){x a , x b , J(x c )}\nfor any x, y, z, w ∈ g and λ, µ ∈ C, where {x a }, {x a } are dual bases of g with respect to (·, ·) and 3.2. Drinfeld's new realisation of Y (g) [Dr2]. Let h ⊂ g be a Cartan subalgebra of g, Φ = {α} ⊂ h * the corresponding root system. Let {α i } i∈I be a basis of simple roots of Φ and\n{z 1 , z 2 , z 3 } = 1 24 σ∈S 3 z σ(1) z σ(2) z σ(3) Y (g) is an N-graded C[ ]-a ij = 2(α i , α j )/(α i , α i ) the entries of the Cartan matrix A of g. Set d i = (α i , α i )/2, so that d i a ij = d j a ji for any i, j ∈ I. Let ν : h → h * be the isomorphism determined by the inner product (·, ·) and set t i = ν −1 (α i ) = d i α ∨ i . For any i ∈ I, choose root vectors x ± i ∈ g ±α i such that [x + i , x − i ] = t i .\nRecall that g has a (slightly nonstandard) presentation in terms of the generators t\ni , x ± i with relations [t i , t j ] = 0 [t i , x ± j ] = ±d i a ij x ± j [x + i , x − j ] = δ ij t i ad(x ± i ) 1−a ij x ± j = 0 The Yangian Y (A) is the associative algebra over C[ ] with generators X ± i,r , T i,r , i ∈ I, r ∈ N and relations [T i,r , T j,s ] = 0 [T i,0 , X ± j,s ] = ±d i a ij X ± j,s [T i,r+1 , X ± j,s ] − [T i,r , X ± j,s+1 ] = ± 2 d i a ij (T i,r X ± j,s + X ± j,s T i,r ) [X + i,r , X − j,s ] = δ ij T i,r+s [X ± i,r+1 , X ± j,s ] − [X ± i,r , X ± j,s+1 ] = ± 2 d i a ij (X ± i,r X ± j,s + X ± j,s X ± i,r ) π [X ± i,r π(1) , [X ± i,r π(2) , [· · · , [X ± i,r π(m) , X ± j,s ] · · · ]] = 0\nwhere i = j in the last relation, m = 1−a ij , r 1 , . . . , r m ∈ N is any sequence of non-negative integers, and the sum is over all permutations\nπ of {1, . . . , m}. Y (A) is N-graded by deg(T i,r ) = r = deg(X ± i,r ) and deg( ) = 1. 3.3.\nIsomorphism between the two presentations [Dr2]. Choose root vectors x α ∈ g α for any α ∈ Φ such that (x α , x −α ) = 1 and let\nκ α = x α x −α + x −α x α (3.1)\nbe the truncated Casimir operator of the sl 2 -subalgebra of g corresponding to α. Then, the assignment\nϕ(t i ) = T i,0 , ϕ(x ± i ) = X ± i,0 ϕ(J(t i )) = T i,1 + ϕ(v i ) ϕ(J(x ± i )) = X ± i + ϕ(w ± i ) extends to an isomorphism ϕ : Y (g) → Y (A), where v i = 1 4 β∈Φ + (α i , β)κ α − t 2 i /2 w ± i = ± 1 4 β∈Φ + [x ± i , x ±β ]x ∓β + x ∓β [x ± i , x ±β ] − 1 4 (x ± i t i + t i x ± i ) 3.4. The W -equivariant embedding δ a,b : h → Y (g). The Yangian Y (g)\nis acted upon by the Lie algebra spanned by the elements x ∈ g and is an integrable g-module under this action. In particular, the zero-weight subalgebra Y (g) h is acted upon by the Weyl group W of g. Moreover, for any a, b ∈ C, the linear map\nδ a,b : h → Y (g) h , δ a,b (t) = at + bJ(t) (3.2) is W -equivariant.\nIn terms of the new realisation of Y (g), the map δ a,b becomes\nδ a,b = ϕ • δ a,b : h → Y (A) h δ a,b (t) = at + b   T (t) 1 + 4 β∈Φ + β(t)κ β − 2 i (t, t i )t 2 i   (3.3) where {t i = λ ∨ i } is the basis of h dual to {t i } given by the fundamental coweights, T (−) 1 : h → Y (A) is the embedding t → (t, t i )T i,1 and, devi- ating slightly from the notation of §3.2, we identify g ⊂ Y (g) with the Lie subalgebra of Y (A) spanned by T i,0 , X ± i,0 . 3.5. The linear map τ a,b : h → Y (g). Let ǫ ∈ C.\nFor any root α, set\nK α = κ α + ǫq α where q α = ν −1 (α) (α, α) 2 (3.4)\nand κ α is the truncated Casimir given by (3.1). For any a\n, b ∈ C, define a map τ a,b : h → Y (g) h by τ a,b (t) = 2 α∈Φ + (t, α)K α + δ a,b (t)\nwhere δ a,b is given by (3.2).\n\nProposition.\n\n(1) The elements K α satisfy K −α = K α and w(K α ) = K wα for any w ∈ W .\n\n(2) The following holds for any t ∈ h\ns i (τ a,b (t)) − τ a,b (s i t) = (α i , t)K α i (3) If b = −2, then τ a,b = ϕ • τ a,b : h → Y (A) h is given by τ a,−2 (t) = at − 2 T (t) 1 − 2 i (t, t i )t 2 i + ǫ 2 α∈Φ + α(t)q α\nand satisfies in addition\n[ τ a,−2 (t), τ a,−2 (t ′ )] = 0\nfor any t, t ′ ∈ h. (4) For any α ∈ Φ + and t ∈ h such that α(t) = 0\n[K α , δ a,b (t)] = 0 Proof.\n(1) is obvious. (2) follows from the second part of Proposition 2.22, (1) and the W -equivariance of δ a,b . For (3), we have by (3.3)\nτ a,b (t) = 2 α∈Φ + α(t)K α + at + b   T (t) 1 + 4 β∈Φ + β(t)κ β − 2 i (t, t i )t 2 i   = at + 2 α∈Φ + α(t)(K α + b 2 κ α ) + b(T (t) 1 − 2 i (t, t i )t 2 i )\nwhich, for b = −2 reduces to the claimed expression. The commutativity of τ a,−2 (t) and τ a,−2 (t ′ ) then follows from that of of the T i,1 . (4) follows easily from the defining relations of Y (g).\n\n3.6. For simplicity, we henceforth set ǫ = 0 = a and b = −2 in equations (3.2) and (3.4), although Theorem 3.8 below is true for any values of a, ǫ.\nThus, K α = κ α , δ = δ 0,−2 : h → Y (g) is given by δ(t) = −2J(t) and the corresponding map τ = τ 0,−2 : h → Y (A) h by τ (t) = −2T (t) 1 + (t, t i )t 2 i 3.7.\nThe trigonometric Casimir connection of g. Let H reg ⊂ H be given by (2.1) and Y h the trivial bundle over\nH reg with fibre Y (g) h ∼ = Y (A) h .\nDefinition. The trigonometric Casimir connection of g is the connection ∇ on Y h given by either of the following forms\n∇ = d − 2 α∈Φ + e α + 1 e α − 1 dα κ α + 2du i J(u i ) (3.5) = d − α∈Φ + dα e α − 1 κ α + 2du i T (u i ) 1 − 2 (u i , t j )t 2 j\n(3.6) whose equality follows from §2.3 and §3.6.\n\n\n3.8.\n\nTheorem. The trigonometric Casimir connection is flat and W -equivariant.\n\nProof. By Theorem 2.5, Proposition 2.22 and Proposition 3.5, we need only check that the elements t α = κ α satisfy the relations (tt). This follows as in [MTL,Thm. 2.3] and [TL1, Thm 2.2]. Specifically, if Ψ ⊂ Φ is a rank 2 root subsystem, the sum α∈Φ + κ α is, up to Cartan terms, the Casimir operator for the rank 2 subalgebra g Ψ ⊂ g determined by Ψ and therefore commutes with each summand κ α , α ∈ Φ + .\n\nRemark. Since the relations of Theorem 2.5 and Proposition 2.22 are homogeneous, Theorem 3.8 proves in fact the flatness and W -equivariance of the one-parameter family of connections\n∇ = d − λ −1   2 α∈Φ + e α + 1 e α − 1 dα κ α − 2du i J(u i )   = d − λ −1   α∈Φ + dα e α − 1 κ α − 2du i T (u i ) 1 − 2 (u i , t j )t 2 j   where λ varies in C × .\n\nThe monodromy conjecture\n\nWe show in this section that the monodromy of the trigonometric Casimir connection ∇ gives rise to representations of the affine braid group B corresponding to g and give a conjectural description of it in terms of the quantum Weyl group operators of the quantum loop algebra U (Lg).\n\n\nMonodromy representation.\n\nSince H is of simply-connected type, the Weyl group W acts freely on H reg and the fundamental group of the quotient H reg /W is isomorphic to the affine braid group B [NVD, vdL].\n\nLet V be a finite-dimensional Y (g)-module and V the holomorphically trivial vector bundle over H reg with fibre V . The connection ∇ induces a flat connection on V. To push it down to the quotient by W we use the 'up and down' trick of [MTL,p. 224] to circumvent the fact that W does not in general act on V . To this end, we shall need a few basic results about Tits extensions of (affine) Weyl groups which are gathered in §8.\n\nSpecifically, since V is an integrable g-module, the triple exponentials\nexp(e α i ) exp(−f α i ) exp(e α i )\ndefined by a choice of simple root vectors e α i ∈ g α i , f α i ∈ g −α i are welldefined elements of GL(V ). They give rise to an action on V of an extension of W by the sign group Z dim h 2 called the Tits extension W of W (Definition 8.2 and Prop. 8.3). By Theorem 8.10, W is a quotient of the affine braid group B which may therefore be made to act on V . It is then easy to check that the pull-back of the flat vector bundle (V, ∇) to the universal cover of H reg is equivariant under B acting by deck transformations on the base and through the W -action on the fibres. . Such a V is integrable and therefore endowed with a quantum Weyl group action of the affine braid group B [Lu, KR, So]. This action is given by letting the generator corresponding to i ∈ I act by\nS i v = a,b,c∈Z: a−b+c=−λ(α ∨ i ) (−1) b q b−ac i E (a) i F (b) i E (c) i v where v ∈ V if of weight λ ∈ h * and X (a) i is the divided power X a /[a] i ! with q = e , q i = q (α i ,α i )/2 [n] i = q n i − q −n i q i − q −1 i and [n] i ! = [n] i [n − 1] i · · · [1] i 4.4. Monodromy conjecture.\nIt is known that the Yangian Y (g) and the quantum loop algebra U (Lg) have the same finite-dimensional representation theory (see [Va] and [GTL1]). By analogy with the quantum Weyl group description of the monodromy of the (rational) Casimir connection of g conjectured by De Concini (unpublished) and independently in [TL1,TL2], and proved in [TL1,TL3], we make the following Conjecture. The monodromy of the trigonometric Casimir connection is equivalent to the quantum Weyl group action of the affine braid group B on finite-dimensional U (Lg)-modules.\n\nWe will return to this conjecture in forthcoming work in collaboration with S. Gautam [GTL2].\n\n\nThe trigonometric Casimir connection of gl n\n\nWe consider in this section the Yangian Y (gl n ) of the Lie algebra gl n . The latter does not possess a presentation of the form given in §3.1 but may be defined via a ternary, or RT T presentation. By exploiting the interplay between the latter and its loop presentation, we construct a flat, trigonometric connection with values in Y (gl n ). We then relate it to the corresponding connection for sl n and show that, when it is taken with values in a tensor product of evaluation modules, it coincides with the trigonometric dynamical equations [TV]. 5.1. The RT T presentation of Y (gl n ). The Yangian Y (gl n ) is the unital, associative algebra over C generated by elements t\n(r) ij , 1 ≤ i, j ≤ n, r ≥ 1, subject to the relations 3 [t (r+1) ij , t (s) kl ] − [t (r) ij , t (s+1) kl ] = t (r) kj t (s) il − t (s) kj t (r) il (5.1)\nwhere r, s ∈ N and t (0) ij = δ ij . Let V = C n with standard basis e 1 , . . . , e n and let E ij e k = δ jk e i be the corresponding basis of elementary matrices of gl n . The map ı : E ij → t (1) ij defines an embedding of gl n into Y (gl n ) and we will often identify gl n with its image under ı. Moreover, for every s ≥ 1, the subspace spanned by the elements t (s) ij transforms like the adjoint representation under the commutator action of gl n .\n\nThe above relations may be more compactly rewritten as follows. For any r ≥ 0, let T (r) be the n × n matrix with values in Y (gl n ) given by\nT (r) = 1≤i,j≤n E V ij ⊗ t (r) ij\nwhere E V ij are again elementary matrices and the superscript V is used to stress the fact that they should be thought of as elements of the algebra End(V ) rather than the underlying Lie algebra gl n .\n\nLet u be a formal variable and set\nT = r≥0 T (r) u −r ∈ End(V ) ⊗ Y (gl n )[[u −1 ]] Finally, let R(u) = 1 − P u −1 ∈ End(V ⊗ V )[[u −1 ]]\nbe Yang's R-matrix, where P ∈ End(V ⊗ V ) acts as the permutation of the two tensor factors. Then the relations (5.1) are equivalent to\nR(u − v)T 1 (u)T 2 (v) = T 2 (v)T 1 (u)R(u − v) where T 1 (u), T 2 (u) ∈ End(V ⊗ V ) ⊗ Y (gl n )[[u −1 ]] are given by T 1 (u) = i,j,r E V ij ⊗ 1 ⊗ t (r) ij u −r and T 2 (v) = i,j,r 1 ⊗ E V ij ⊗ t (r) ij v −r 5.2.\nThe loop presentation of Y (gl n ). Let E(u), H(u), F (u) be the factors of the Gauss decomposition of T (u). Specifically,\nF (u) = 1 + i>j E V ij ⊗ f ij (u) E(u) = 1 + i<j E V ij ⊗ e ij (u) H(u) = i E V ii ⊗ h i (u),\nare, respectively, the unique lower unipotent, upper unipotent and diagonal matrices with coefficients in Y (gl n )[[u −1 ]] such that\nT (u) = F (u)H(u)E(u) (5.2)\nNoting that H(u), E(u), F (u) = 1 mod u −1 , write\nh i (u) = 1 + r≥1 h (r) i u −r , f ij (u) = r≥1 f (r) ij u −r , e ij (u) = r≥1 e (r) ij u −r\nThe coefficients of e ii+1 (u), f ii+1 (u) and h i (u) give another system of generators of Y (gl n ). Moreover, The elements h i (u) commute and their coefficients generate a maximal commutative subalgebra of Y (gl n ) called the Gelfand-Zetlin subalgebra H n .\n\n\nThe Gauss decomposition (5.2) yields in particular\nt (1) ij =        e (1) ij if i < j h (1) i if i = j f (1) ij if i > j\nwhich we will use to identify the copies of gl n inside each presentation. Moreover,\nt (2) ii = h (2) i + j<i E ij E ji = h (2) i + 1 2 j<i κ θ j −θ i − (E jj − E ii ) (5.3)\nwhere θ a is the linear form given by θ a (E bb ) = δ ab and κ θa−θ b = E ab E ba + E ba E ab is the truncated Casimir operator corresponding to the root θ a − θ b .\n\n\nDefine the elements D i ∈ H n by\nD i = 2h (2) i − j<i (E jj − E ii ) − E 2 ii (5.4) = 2t (2) ii − j<i κ θ j −θ i − E 2 ii (5.5)\nThe symmetric group S n acts by algebra automorphisms on Y (gl n ) by\nσ(t (r) ij ) = t (r) σ(i)σ(j) (5.6) Lemma. The following holds (1) [D i , D j ] = 0. (2) (i i + 1)D j = D j if j / ∈ {i, i + 1}. (3) (i i + 1)D i − D i+1 = κ θ i −θ i+1 .\nProof. (1) follows from (5.4) and the fact that the h (r) i commute. (2) and (3) follows from (5.5).\n\n\nThe following is a direct consequence of (5.5) and (5.3)\n\nLemma. The element D = D 1 + · · · + D n is given by\nD = 2 i t (2) ii − C gl n = 2 i h (2) i − 2ρ ∨ − i E 2 ii where C gl n = i<j κ θ i −θ j + i E 2 ii and 2ρ ∨ = i<j (E ii − E jj )\nare the Casimir operator and sum of the positive coroots of gl n .\n\n5.6. The trigonometric Casimir connection of gl n . Let D i be given by (5.5) and define elements ∆ i ∈ H n by (cf. §2.3)\n∆ i = D i − 1 2 a<b (θ a − θ b )(E ii ) κ θa−θ b = 2t (2) ii − 1 2 j =i κ θ i −θ j − E 2 ii\nLet H ⊂ GL n be the maximal torus consisting of diagonal matrices, H reg its set of regular elements and Y(gl n ) the trivial Y (gl n )-bundle over H reg .\n\nDefinition. The trigonometric Casimir connection of gl n is the connection on Y(gl n ) given by either of the following forms\n∇ = d − i<j d(θ i − θ j ) e θ i −θ j − 1 κ θ i −θ j − n i=1 dθ i D i = d − 1 2 i<j e θ i −θ j + 1 e θ i −θ j − 1 d(θ i − θ j ) κ θ i −θ j − n i=1 dθ i ∆ i 5.7.\nLet the symmetric group S n act on the vector bundle Y(gl n ) by permutations of the base and automorphisms (5.6) of the fibre.\n\nTheorem. The trigonometric Casimir connection of gl n is flat and equivariant under S n .\n\nProof. Let H, U ⊂ H be the subtori consisting respectively of diagonal matrices of determinant 1 and multiples of the identity, and let h, u = C1 n and h be their Lie algebras, where\n1 n = n i=1 E ii . Thus h = h ⊕ C1 n and h * ∼ = h * ⊕ C tr\nwhere tr : h → C is the trace. Clearly, H ∼ = H × U and the connection ∇ decomposes as the product of the following Y (gl n )-valued connections on H reg and U respectively \n∇ = d − i<j d(θ i − θ j ) e θ i −θ j − 1 κ θ i −θ j − du a D(u a ) (5.7) ∇ U = d − 1 n d tr D (5.8) where D : h → Y (gl n ) is∈ Ker(θ i − θ i+1 ), [κ θ i −θ i+1 , D(u)] = 0. This reduces to checking that [κ θ i −θ i+1 , D j ] = 0 for j / ∈ {i, i + 1} and that [κ θ i −θ i+1 , D i + D i+1 ]\n= 0 which follows easily from (5.5).\n\n\nRational form.\n\nIt is well known that trigonometric connections of type GL n may be put into a rational form, thus expressing them as KZ type connections on n + 1 points, with one frozen to 0. We carry this step below for the connection 5.6.\n\nLet z i = e θ i , i = 1, . . . , n be the standard coordinates on the torus H ∼ = (C * ) n of GL n . 4 Since dθ i = dz i /z i and\nd(θ i − θ j ) e θ i −θ j − 1 = d(z i − z j ) z i − z j − dz i z i\nthe connection 5.6 is equal to\n∇ = d − i<j d(z i − z j ) z i − z j κ θ i −θ j − i dz i z i D i where D i = D i − j>i κ θ i −θ j = 2t (2) ii − j =i κ θ i −θ j − E 2\nii 5.9. Relation to Y (sl n ). Following Olshanski and Drinfeld, we realise the Yangian Y (sl n ) as a Hopf subalgebra of Y (gl n ) as follows (see [Mo,§1.8]).\nLet A = 1 + u −1 C[[u −1 ]\n] be the abelian group of formal power series in u −1 with constant term 1. A ∋ f acts on Y (gl n ) by Hopf algebra automorphisms given by T (u) → f (u)T (u) The Hopf subalgebra Y (gl n ) A ⊂ Y (gl n ) of elements fixed by A is isomorphic to Y (sl n ). 5.10. The generators T i,r of the presentation of Y (sl n ) described in §3.2 may be obtained within the RTT realisation of Y (gl n ) as follows [BK,Rk. 5.12]. Consider their generating function T i (u) = 1+ r≥0 T i,r u −r−1 . Then,\nT i (u) = h i (u − i − 1 2 ) −1 · h i+1 (u − i − 1 2 )\nTo spell this out, consider a formal power series a(u) = 1 + a 1 u −1 + a 2 u −2 + · · · . Then, for any λ ∈ C one has\na(u − λ) = 1 + a 1 u −1 (1 − λ u ) −1 + a 2 u −2 (1 − λ u ) −2 + · · · = 1 + a 1 u −1 + (a 2 + λa 1 )u −2 + · · · and therefore a(u − λ) −1 = 1 − a 1 u −1 − (a 2 + λa 1 − a 2 1 )u −2 + · · · It follows that T i,0 = −(E ii − E i+1,i+1 ) and T i,1 = −(h (2) i − h (2) i+1 ) − i − 1 2 (E ii − E i+1,i+1 ) + E 2 ii − E ii E i+1,i+1 (5.9)\n5.11. Let H ⊂ H be the torus of SL n consisting of diagonal matrices with determinant 1.\n\nProposition. The restriction of the trigonometric Casimir connection of gl n to H reg takes values in Y (sl n ) and is equal to the sum of the trigonometric Casimir connection of sl n with the h ⊂ Y (sl n )-valued, closed one-form\n− n i=1 dλ i (E ii − E i+1,i+1 )\nwhere {λ i } are the fundamental weights of sl n .\n\nProof. The restriction of the trigonometric Casimir connecton of gl n to H reg is given by (5.7), namely\n∇ = d − i<j d(θ i − θ j ) e θ i −θ j − 1 κ θ i −θ j − du i D(u i ) where D : h → Y (gl n ) is given by D(E ii ) = D i and {u i }, {u i } are dual bases of h * and h respectively. Choosing u i = λ i so that u i = E ii − E i+1,i+1 , i = 1, .\n. . , n − 1 and comparing with the form (3.6) we need to show that\nD i − D i+1 = −2T i,1 + (E ii − E i+1,i+1 ) 2 + (E ii − E i+1,i+1 )\nBy (5.4), the left-hand side is equal to\n2(h (2) i − h (2) i+1 ) + i (E ii − E i+1,i+1 ) − E 2 ii + E 2 i+1,i+1\nand the result follows from (5.9) 5.12. Evaluation homomorphism. The Yangian Y (gl n ) possesses an evaluation homomorphism ev : Y (gl n ) → U gl n defined by\nev(t ij (u)) = δ ij + E ij u −1 where t ij (u) = r≥0 t (r)\nij u −r . When composed with the translation automorphisms τ a , a ∈ C given by τ a T (u) = T (u − a), that is\nτ a T (r) = δ r0 + r s=1 T (s) r − 1 r − s a r−s\nthis yields a one-parameter family of evaluation homomorphisms ev a = ev •τ a given by ev a (t (r) ij ) = δ r0 δ ij + E ij a r−1 (5.10) 5.13. Hopf algebra structure. Y (gl n ) is a Hopf algebra with coproduct\n∆(t ij (u)) = n k=1 t ik (u) ⊗ t kj (u)\nFor any m ≥ 2, let ∆ (m) : Y (gl n ) → Y (gl n ) ⊗m denote the corresponding iterated coproduct. Then,\n∆ (m) (t (2) ij ) = m p=1 (t (2) ij ) p + 1≤k≤n 1≤p<q≤m (E ik ) p (E kj ) q (5.11) where X p = 1 ⊗(p−1) ⊗ X ⊗ 1 ⊗(m−p) .\n5.14. Evaluation modules. For any a = (a 1 , . . . , a m ) ∈ C m define ev a : Y (gl n ) → U gl ⊗m n by ev a = ev a 1 ⊗ · · · ⊗ ev am •∆ (m)\n\nProposition. The image of the trigonometric Casimir connection of gl n under the homomorphism ev a is the U gl ⊗m n -valued connection given by\n∇ a = d − i<j d(θ i − θ j ) e θ i −θ j − 1 ∆ (m) (κ θ i −θ j ) − n i=1 dθ i D i,a where D i,a = 2 m p=1 a p (E ii ) p + 2 1≤j≤n 1≤p<q≤m (E ij ) p (E ji ) q − j<i ∆ (m) (κ θ j −θ i ) − ∆ (m) (E 2 ii )\nProof. By construction D i,a = ev a (D i ) and is given by the above expression by (5.5), (5.11) and (5.10).\n\n5.15. The trigonometric dynamical differential equations for gl n . In [TV], Tarasov and Varchenko considered differential operators D 1 , . . . , D n in the variables z 1 , . . . , z n ∈ C × with coefficients in U gl ⊗m n given by\nD i = z i ∂ z i + λL i (a, z)\nwhere λ ∈ C, a = (a 1 , . . . , a m ) ∈ C m , z = (z 1 , . . . , z n ) and\nL i (a, z) = ∆ (m) (E 2 ii ) 2 − m p=1 a p (E ii ) p − 1≤j≤n 1≤p<q≤m (E ij ) p (E jk ) q − j =i z j z i − z j ∆ (m) (E ij E ji − E ii ) Set z i = e θ i so that z i ∂ z i = ∂ θ i and z j z i − z j = 1 e θ i −θ j − 1 = − 1 e θ j −θ i − 1 + 1 Since E ij E ji − E ii = 1 2 (κ θ i −θ j − (E ii + E jj ))\nthe operators D i are the covariant derivatives for the connection\n∇ ′ a = d − λ 2   i<j d(θ i − θ j ) e θ i −θ j − 1 ∆ (m) (κ θ i −θ j − (E ii + E jj )) + n i=1 dθ i D ′ i,a   where D ′ i,a = −∆ (m) (E 2 ii ) + 2 m p=1 a p (E ii ) p + 2 1≤j≤n 1≤p<q≤m (E ij ) p (E ji ) q − j<i ∆ (m) (κ θ j −θ i − (E ii + E jj ))\nBy Proposition 5.14, ∇ ′ a is the image of the trigonometric Casimir connection for gl n 5 under the homomorphism ev a : Y (gl n ) → (U gl n ) ⊗m plus the hvalued, closed one-form\nλ 2 ∆ (m)   i<j d(θ i − θ j ) e θ i −θ j − 1 (E ii + E jj ) − i dθ i j<i (E ii + E jj )   5\nwhen the latter is scaled by a factor of λ/2, as in Remark 3.8.\n\n\nBispectrality\n\nWe show in this section that the trigonometric Casimir connection with values in a tensor product of Y (g)-modules commutes with the qKZ difference equations of Frenkel-Reshetikhin determined by the rational R-matrix of Y (g). This was checked by Tarasov-Varchenko for g = gl n in the case where all representations are evaluation modules [TV].\n\n6.1. Hopf algebra structure [Dr1]. If g is simple, Y (g) is a Hopf algebra with coproduct ∆ : Y (g) → Y (g) ⊗ Y (g) given on generators by\n∆(x) = x ⊗ 1 + 1 ⊗ x ∆(J(x)) = J(x) ⊗ 1 + 1 ⊗ J(x) + 2 [x ⊗ 1, t]\nwhere t = a x a ⊗x a ∈ (g⊗g) g , with {x a }, {x a } dual bases of g with respect to the given inner product. Thus, if ∆ (n) : Y (g) → Y (g) ⊗n is the iterated coproduct, then\n∆ (n) (x) = n i=1 x (i) (6.1) ∆ (n) (J(x)) = n i=1 J(x) (i) + 2 1≤i<j≤n [x (i) , t ij ] (6.2) where x (i) = 1 ⊗(i−1) ⊗ x ⊗ 1 ⊗(n−i) and t ij = a x (i)\na (x a ) (j) .\n\n6.2. Translation automorphisms [Dr1]. Y (g) possesses a one-parameter group of Hopf algebra automorphisms T v , v ∈ C given by\nT v x = x and T v J(x) = J(x) + vx\nIf v 1 , . . . , v n ∈ C, we set T v 1 ,...,vn = T v 1 ⊗ · · · ⊗ T vn ∈ Aut(Y (g) ⊗n ) and\n∆ v 1 ,...,vn = T v 1 ,...,vn • ∆ (n) : Y (g) → Y (g) ⊗n (6.3) 6.3. The universal R-matrix of Y (g) [Dr1]. Let R(u) ∈ Y (g)⊗Y (g)[[u −1 ]] be the universal R-matrix of Y (g). R(u) satisfies ∆ ⊗ id(R(u)) = R 13 (u)R 23 (u) (6.4) id ⊗∆(R(u)) = R 13 (u)R 12 (u) (6.5) ∆ 21 (x) = R(u)∆(x)R(u) −1 (6.6) T v,w R(u) = R(u + v − w) (6.7)\nThe above relations imply that R satisfies the quantum Yang-Baxter equations (QYBE) with spectral parameter\nR 12 (u)R 13 (u + v)R 23 (v) = R 23 (v)R 13 (u + v)R 12 (u)\nand the more general form of (6.6)\nR(u)(T v,w ∆(x))R(u) −1 = T v,w ∆ 21 (x)\n6.4. The rational qKZ equations [FR]. Let V 1 , . . . , V n be Y (g)-modules and d i ∈ GL(V i ) be such that d i d j R ij (u) = R ij (u)d i d j for any 1 ≤ i < j ≤ n. Fix a step κ ∈ C × , let a 1 , . . . , a n ∈ C be distinct and define operators a 1 , . . . , a n ) ∈ End(V 1 ⊗ · · · ⊗ V n ) for i = 1, . . . , n by\nA i = A i (A i = R i−1 i (a i−1 − a i − κ) −1 R i−2 i (a i−2 − a i − κ) −1 · · · R 1 i (a 1 − a i − κ) −1 · d i · R i n (a i − a n )R i n−1 (a i − a n−1 ) · · · R i i+1 (a i − a i+1 )\nThe (rational) qKZ equations of Frenkel-Reshetikhin are the system of difference equations T i f = A i f where f takes values in V 1 ⊗ · · · ⊗ V n and T i f (a 1 , . . . , a n ) = f (a 1 , . . . , a i−1 , a i + κ, a i+1 , . . . , a n )\n\nThey are a consistent system in that [ T i , T j ] = 0, where T i = A −1 i T i are the covariant difference operators.\n\n\n6.5.\n\nLemma. The following holds for any i = 1, . . . , n a 1 , . . . , a n ) is given by A i = d 1 · · · d i R 1 n (a 1 − a n ) · · · R i n (a i − a n ) R 1 n−1 (a 1 − a n−1 ) · · · R i n−1 (a i − a n−1 ) · · · · · · (R 1 i+1 (a 1 − a i+1 ) · · · R i i+1 (a i − a i+1 )) (6.8) Thus, A n = d 1 · · · d n and for any i ≤ n − 1\nT 1 T 2 · · · T i = ( A i ) −1 T 1 · · · T i where A i = A i (A i = d 1 · · · d i ∆ (i) a 1 −a i ,...,a i−1 −a i ,0 ⊗ ∆ (n−i)\na i+1 −an,...,a n−1 −an,0 (R(a i − a n )) (6.9) Proof. Clearly,\nT 1 T 2 · · · T i = (T 1 · · · T i−1 (A i ) · · · T 1 (A 2 )A 1 ) −1 T 1 · · · T i\nand, for any j ≤ i,\nT 1 · · · T j−1 (A j ) = (R i−1 i ) −1 (R i−2 i ) −1 · · · (R 1 i ) −1 · d i · R i n R i n−1 · · · R i i+1\nwhere R kl is shorthand for R kl (a k − a l ). The first claimed identity now follows by induction on i using the QYBE. The second follows from the relations (6.4)-(6.5) and (6.7). 6.6. Bispectrality. To couple the qKZ and trigonometric Casimir connection equations with values in the tensor product V 1 ⊗ · · · ⊗ V n , assume that each V i is an integrable g-module and that d i is the GL(V i )-valued function on the torus H given by d i (e u ) = (e −u ) (i) (6.10) Let also ∇ a be the trigonometric Casimir connection with values in the Y (g)-module T * −a 1 ,...,−an V 1 ⊗ · · · ⊗ V n and scaled by a factor of 2κ as in Remark 3.8. Thus, ∇ a is the End(V 1 ⊗ · · · ⊗ V n )-valued connection given by\n∇ a = d − 1 2κ ∆ (n) a 1 ,...,an (B) where B = 2 α∈Φ + e α + 1 e α − 1 dα κ α − 2du i J(u i )\nTheorem. The qKZ operators T i commute with the trigonometric Casimir connection ∇ a .\n\nProof. It suffices to prove that [∇ a , T 1 · · · T i ] = 0 for any i = 1, . . . , n. Since\n[d − (2κ) −1 ∆ (n) a 1 ,...,an (B), ( A i ) −1 T 1 · · · T i ] (T 1 · · · T i ) −1 = d A −1 i − (2κ) −1 A −1 i (id − Ad(T 1 · · · T i ))∆ (n) a 1 ,...,an (B) − (2κ) −1 [∆ (n)\na 1 ,...,an (B), ( A i ) −1 ] the claim follows from the two lemmas below.\n\n\n6.7.\n\nLemma.\n(d A i ) A −1 i = (2κ) −1 (Ad(T 1 · · · T i ) − id)∆ (n) a 1 ,.\n..,an (B) (6.11)\n\nProof. By (6.8), the left-hand side of (6.11) is equal to\nd(d 1 · · · d i ) (d 1 · · · d i ) −1 = − i j=1 du a (u a ) (j)\nwhere we used (6.10). Write B = B 1 + B 2 where\nB 1 = 2 α∈Φ + dα e α + 1 e α − 1 κ α and B 2 = −2du i J(u i )\nSince B 1 takes values in U g, ∆ a 1 ,...,an (B 1 ) (n) is independent of a 1 , . . . , a n and the right-hand side of (6.11) is equal to (2κ) −1 (Ad(T 1 · · · T i )−id)∆ (n) a 1 ,...,an (B 2 ). By (6.2), for any x ∈ g, (Ad(T 1 · · · T i ) − id)∆ (n) a 1 ,...,an (J(x)) = i j=1 κx (i) so that the right-hand side of (6.11) is equal to − i j=1 du a (u a ) (j) . 6.8.\n\n\nLemma.\n\n[ A i , ∆ (n) a 1 ,...,an (B)] = 0 Proof. For any x ∈ Y (g) and 1 ≤ i ≤ n,\n∆ (n) a 1 ,...,an (x) = ∆ (i) a 1 −a i ,...,a i−1 −a i ,0 ⊗ ∆ (n−i)\na i+1 −an,...,a n−1 −an,0 • ∆ a i ,an (x) so that, by (6.9) and the fact that d 1 · · · d i = ∆ (i) (d 1 ), it suffices to prove the claimed identity for n = 2 and i = 1. We have\nd −1 1 [d 1 R(a 1 − a 2 ), ∆ a 1 ,a 2 (B)] R(a 1 − a 2 ) −1 = (id − Ad(d −1 1 ))∆ a 1 ,a 2 (B) + (Ad(R(a 1 − a 2 )) − id)∆ a 1 ,a 2 (B) (6.12) Let u ∈ h. By (6.2), (id − Ad(d −1 1 ))∆ a 1 ,a 2 (J(u)) = 2 (id − Ad(d −1 1 ))[u (1) , t]\nand, by (6.6),\n(Ad(R(a 1 − a 2 )) − id)∆ a 1 ,a 2 (J(u)) = 2 [u (2) − u (1) , t] = − [u (1) , t]\nThus, the right-hand side of (6.12) with B replaced by B 2 = −2du a J(u a ) is equal to du a (id + Ad(d −1 1 ))[u a(1) , t] Since R(a 1 − a 2 ) commutes with ∆ a 1 ,a 2 (B 1 ), we have left to compute\n(id − Ad(d −1 1 ))∆ a 1 ,a 2 (B 1 ) = α∈Φ + dα e α + 1 e α − 1 (id − Ad(d −1 1 ))t α where t α = x α ⊗ x −α + x −α ⊗ x α\n, with x ±α ∈ g ±α such that (x α , x −α ) = 1, so that ∆(κ α ) = κ α ⊗ 1 + 1 ⊗ κ α + 2t α . By (6.10),\n(id − Ad(d −1 1 ))t α = (1 − e α )(x α ⊗ x −α − e −α x −α ⊗ x α ) so that, for any α ∈ Φ + and u ∈ h, α(u) e α + 1 e α − 1 (id − Ad(d −1 1 ))t α = −α(u) (e α + 1)x α ⊗ x −α − (e −α + 1)x −α ⊗ x α = −[u (1) , (id + Ad(d −1 1 ))t α ] whence the claimed result.\nRemark. The proof of Theorem 6.6 works almost verbatim for g = gl n and gives the commutation of the rational qKZ connection and trigonometric Casimir connections for Y (gl n ).\n\n\nThe affine KZ connection\n\nWe show in this section that the degenerate affine Hecke algebra H ′ of W is, very roughly speaking, the 'Weyl group' of the Yangian Y (g). More precisely, we show that if V is a Y (g)-module whose restriction to g is small, the canonical action of W on the zero weight space V [0] extends to one of H ′ . Moreover, the trigonometric Casimir connection with values in V [0] coincides with Cherednik's affine KZ connection with values in this H ′ -module.\n\n7.1. The degenerate affine Hecke algebra. Let K be the vector space of W -invariant functions Φ → C and denote the natural linear coordinates on K by k α , α ∈ Φ/W . Recall [Lu] that the degenerate affine Hecke algebra H ′ associated to W is the algebra over C[K] generated by the group algebra CW and the symmetric algebra Sh subject to the relations\ns i x u − x s i (u) s i = k α i α i (u) (7.1)\nfor any simple reflection s i ∈ W and linear generator x u , u ∈ h, of Sh.\n\n7.2. The affine KZ connection. The AKZ connection is the trigonometric, H ′ -valued connection given by\n∇ = d − α∈Φ + dα e α − 1 k α s α − du i x u i (7.2)\nwhere {u i }, {u i } are dual bases of h * , h respectively. This connection was defined by Cherednik in [Ch1,Ch2] and proved to be flat and W -equivariant. This may also be obtained as a consequence of Theorem 2.23. Indeed, the relations (tt), with t α = k α s α are easily verified and, as pointed out by Cherednik, the remaining relations are precisely those defining H ′ .\n\nRemark. The δ-form (2.7) of the AKZ connection corresponds to Drinfeld's presentation of H ′ in terms of CW and non-commuting elements y u which transform like the reflection representation of W (see [Dr3] and [RS]). 6 Indeed, it is given by\n∇ = d − 1 2 α∈Φ + e α − 1 e α − 1 dα k α s α − du i y u i\nwhere the elements y u are defined by (2.6) as\ny u = x u − 1 2 α∈Φ + α(u)k α s α (7.3)\nand therefore satisfy s i y u s i = y s i (u) by Proposition 2.22.\n\n6 I owe this observation to Pavel Etingof. Recall that a g-module V is small if 2α is not a weight of V for any root α [Br,Re,Re2]. If V is a small g-module with a non-trivial zero weight space V [0], the restriction to V [0] of the square e 2 α of a raising operator maps to the weight space V [2α] and is therefore zero. This implies the following result [TL2,Prop. 9.1] Lemma. If V is an integrable, small g-module, the following holds on the zero weight space\nV [0] κ α = (α, α)(1 − s α )\nwhere the right-hand side refers to the action of the reflection s α ∈ W on V [0]. 7.5. Let H ′ be the degenerate affine Hecke algebra of W with parameters\nk α = − (α, α) (7.4)\nTheorem. Let V be a finite-dimensional Y (g)-module whose restriction to g is small.\n\n(1) The canonical W -action on the zero weight space V [0] together with either of the equivalent assignments \nx u → −2T (u) 1 + 1 2 α∈Φ + k α α(u) (7.5) y u → −2J(u)(∇ = d − α∈Φ + dα e α − 1 (α, α)(1 − s α ) + 2du i T (u i ) 1 = d − α∈Φ + dα e α − 1 k α s α + 2du i T (u i ) 1 + α∈Φ + k α dα e α − 1\nwhere the weights k α are given by (7.4). By (2.4)\nα∈Φ (α, α) dα e α − 1 = 2 α∈Φ + (α, α) dα e α − 1 + α∈Φ + (α, α)dα\nso that if A is given by (7.7), then\n∇ − A = d − α∈Φ + k α dα e α − 1 s α + du i   2T (u i ) 1 − 1 2 α∈Φ + k α α(u i )  \nApplying Proposition 2.22 to ∇ − A which is W -equivariant since ∇ and A are, shows that the map (7.5) gives an action of H ′ on V [0]. This proves (1) and (2). The equivalence of (7.5) and (7.6) follows easily from §3.3 and (7.3).\n\nRemark. Theorem 7.5 extends to the trigonometric setting the relation between the rational Casimir and KZ connections proved in [TL2,Prop. 9.1].\n\n7.6. The adjoint representation. Drinfeld proved that, for any simple g, the direct sum g = g ⊕ C of the adjoint and trivial representations of g admits an extension to an action of Y (g) on g [Dr2,Thm. 8]. It is easy to check that the corresponding action of H ′ on g[0] = h ⊕ C given by Theorem 7.5 coincides with its action on affine linear functions on h * given by rational Dunkl operators (see, e.g. [Ki]). 7.7. The case of sl n . Let g = sl n and V = C n its vector representation. A simple inspection shows that V ⊗n is a small [Re2]. The zero weight space V ⊗n [0] possesses two actions of the symmetric group: one arising from the Weyl group action of S n , the other from the permutation of the tensor factors, under which it identifies with the group algebra CS n . The sl n -module V ⊗n may be endowed with an action of Y (g) depending on a 1 , . . . , a n ∈ C obtained by composing the coproduct ∆ (n) : Y (g) → Y (g) ⊗n with the evaluation homomorphisms ev a i : Y (g) → U g. It is easy to check that the action of H ′ on V ⊗n [0] given by Theorem 7.5 coincides with that on the induced representation ind H ′ Sh C a 1 ,...,an .\n\n\nAppendix: Tits extensions of affine Weyl groups\n\nIn this appendix, we review the definition of the Tits extension W of a Weyl group W . We then define the reduced Tits extension W red of W and show that, when W is an affine Weyl group, W red is isomorphic to the semidirect product of the Tits extension of the finite Weyl group underlying W by the corresponding coroot lattice (Theorem 8.10). 8.1. Weyl groups and braid groups. Let A = (a ij ) i,j∈I be a generalised Cartan matrix and (h, ∆, ∆ ∨ ) its unique realisation. Thus, h is a complex vector space of dimension 2|I| − rank(A), ∆ = {α i } i∈I ⊂ h * and ∆ ∨ = {α ∨ i } i∈I ⊂ h are linearly independent sets and α ∨ i , α j = a ij Recall that the Weyl group W = W (A) attached to A is the subgroup of GL(h * ) generated by the reflections [Ka,§3.7] s i (λ) = λ − λ, α ∨ i α i or, equivalently, the subgroup of GL(h) generated by the dual reflections\ns ∨ i (t) = t − t, α i α ∨ i\nBy [Ka,Prop. 3.13], the defining relations of W are\ns 2 i = 1 (s i s j ) m ij = 1\nwhere for any i = j, m ij is equal to 2, 3, 4, 6 or ∞ according to whether a ij a ji is equal to 0, 1, 2, 3 or ≥ 4.\n\nThe braid group B = B(A) attached to A is the group with generators S i , i ∈ I and relations\nS i S j · · · m ij = S j S i · · · m ij\nfor any i = j.\n\n\nTits extensions of Weyl groups.\n\nDefinition ( [Ti]). The Tits extension of W is the group W with generators s i , i ∈ I and relations\ns i s j · · · m ij = s j s i · · · m ij (8.1) s 4 i = 1 (8.2) s 2 i s 2 j = s 2 j s 2 i (8.3) s i s 2 j s −1 i = s 2 j ( s 2 i ) −a ji (8.4)\n8.3. Let g = g(A) be the Kac-Moody algebra corresponding to the Cartan matrix A with generators t ∈ h and e i , f i , i ∈ I. Recall that a representation of g is integrable if h ⊂ g acts semi-simply with finite-dimensional eigenspaces and e i , f i act locally nilpotently. The next two results explain the relevance and structure of the Tits extension W .\n\nProposition. Let V be an integrable representation of g. Then, the triple exponentials\nr i = exp(e i ) exp(−f i ) exp(e i )\nare well-defined elements of GL(V ) and the assignment s i → r i yields a representation of W on V mapping s 2 i to exp(π √ −1α ∨ i ). Proof. The r i are clearly well defined and satisfy [Ka,§3.8], from which (8.2)-(8.4) readily follow. Let now i = j be such that m ij < ∞. Then, the Lie subalgebra g ij of g generated by e i , f i , α ∨ i and e j , f j , α ∨ j is finite-dimensional and semi-simple and V integrates to a representation of the complex, connected and simply-connected Lie group G ij with Lie algebra g ij . By [Ti], r i and r j satisfy the braid relations (8.1) when regarded as elements of G ij 7 , and these therefore hold in GL(V ).\nr i · t · r −1 i = s ∨ i (t) for any t ∈ h and r 2 i = exp(π √ −1α ∨ i )\n8.4. Let Q ∨ ⊂ h be the lattice spanned by the coroots α ∨ i , i ∈ I.\n\nProposition ( [Ti]). W is an extension of W by the abelian group Z generated by the elements\ns 2 i . Z is isomorphic, as W -module to Q ∨ /2Q ∨ ∼ = Z |I| 2 .\nProof. Let K ⊃ Z the kernel of the canonical projection W → W . By (8.4), Z is a normal subgroup of W and W /Z is generated by the images s i of s i which, in addition to the braid relations (8.1), satisfy s 2 i = 1. Thus, W /Z is a quotient of W , K = Z and W /Z ∼ = W . Note next that, by (8.2)-(8.4), the assignment α ∨ i → s 2 i extends to a W -equivariant surjection Q ∨ /2Q ∨ → Z. To prove that this is an isomorphism it suffices to exhibit, for any i ∈ I a Z 2 -valued character χ i of Z such that χ i ( s 2 j ) = (−1) δ ij . Let λ i be the ith fundamental weight of g, so that λ i , α ∨ j = δ ij , V i the irreducible gmodule with highest weight λ i and v i ∈ V i a nonzero highest weight vector. V i is integrable and since r 2\nj = exp( √ −1πα ∨ j ), we have r 2 j v i = (−1) δ ij v i .\n\nReduced Tits extensions. For any\nv = i m i α ∨ i ∈ Q ∨ , set s 2 v = i ( s 2 i ) m i ∈ Z\nso that for any w ∈ W and lift w ∈ W , w s 2 v w −1 = s 2 wv . By [Ka,Prop. 1.6], the center c of g is equal to c = {t ∈ h| t, α i = 0 for any i ∈ I} (8.5)\n\nThe Weyl group operates trivially on c ⊂ h and it follows from (8.4) that the subgroup Z c ⊂ Z generated by the elements s 2 v , with v ∈ c ∩ Q ∨ lies in the centre of W .\n\nDefinition. The reduced Tits extension W red of W is the quotient\nW red = W /Z c 7\nTits' argument is reproduced in the proof of (i) of Proposition 8.9.\n\n\nBy Proposition 8.4, W red is an extension of\nW by Q ∨ /(2Q ∨ + c ∩ Q ∨ ) ∼ = Z rank(A) 2 .\n8.6. Reduced Tits extensions of affine Weyl groups. Assume henceforth that A = (a ij ) 0≤i,j≤n is an affine Cartan matrix of untwisted type. Altering our notations, we denote by g the underlying complex, semi-simple Lie algebra and by h,\n{α i } n i=1 , {α ∨ i } n i=1\n, W and Q ∨ its Cartan subalgebra, simple roots, simple coroots, Weyl group and coroot lattice respectively. Thus, for any 1 ≤ i, j ≤ n, a ij = α ∨ i , α j , a 0j = − θ ∨ , α j and a j0 = − α ∨ j , θ where θ ∈ h * is the highest root of g. It is well known that the (affine) Weyl group W a attached to A is isomorphic to the semi-direct product W ⋉ Q ∨ [Ka,prop. 6.5]. The isomorphism is given by mapping s i to (s i , 0) for i ≥ 1 and s 0 to (s θ , −θ ∨ ).\n\nThe subspace c defined by (8.5) is spanned by the element Ka,Prop. 6.2]. It follows that the reduced Tits extension W a red of W a is the quotient of W a by the relation\nK = α ∨ 0 + n i=1 m i α ∨ i where the m i are the positive integers such that θ ∨ = n i=1 m i α ∨ i [s 2 0 · n i=1\n( s 2 i ) m i = 1 (8.6) 8.7. Loop groups. The structure of the reduced Tits extension of W a will be determined in §8.7- §8.10 by embedding W a red into the loop group corresponding to g. Let Lg = g[z, z −1 ] be the loop algebra of g and d the derivation of Lg defined by dx(m) = mx(m), where x(m) = x ⊗ z m . Then, Lg ⋊ Cd is the quotient of the Kac-Moody algebra corresponding to A by the central element K defined above. Let G be the complex, connected and simply connected Lie group with Lie algebra g and LG = G(C[z, z −1 ]) the group of polynomial loops into G. Let H ⊂ G be the maximal torus with Lie algebra h. The group C * acts on LG by reparametrisation fixing G ⊃ H and H × C * is a maximal abelian subgroup of the semi-direct product LG⋊C * . By [PS], Prop. 5.2, the normaliser of H ×C * in LG⋊C * is equal to (N (H)⋉H ∨ )⋊C * where N (H) is the normaliser of H in G and H ∨ = Hom Z (C * , H) ⊂ LG is isomorphic to the coroot lattice Q ∨ by\nλ ∈ Q ∨ −→ z → z λ = exp H (− ln(z)λ)\nThe quotient N (H × C * )/H × C * is therefore isomorphic to the affine Weyl group W a = W ⋉ H ∨ . 8.8. For each real root α = (α, n) of LG, the subalgebra sl α 2 of Lg spanned by e α = e α (n), f α = f α (−n) and h α is the Lie algebra of a closed subgroup of LG isomorphic to SL 2 (C). This is obvious if n = 0 and follows in the general case from the fact that sl \nα i , f i ∈ (Lg) −α i such that [e i , f i ] = α ∨ i if i ≥ 1 and −θ ∨ if i = 0.\nLet B a be the (affine) braid group corresponding to A and S 0 , S 1 , . . . , S n its generators.\n\n\nProposition.\n\n(1) For any choice of σ i ∈ N i \\ H i , i = 0 . . . n, the assignment S i → σ i extends uniquely to a homomorphism σ : B a → N (H) ⋉ H ∨ .\n\n(2) σ factors through an isomorphism of the reduced Tits extension W a red onto its image in N (H) ⋉ H ∨ .\n\n(3) If σ, σ ′ : W a red → N (H)⋉ H ∨ are the homomorphisms corresponding to the choices {σ i } and {σ ′ i } respectively, there exists t ∈ H ×C * such that, for any s ∈ W a red , σ( s) = tσ ′ ( s)t −1 .\n\nProof.\n\n(1) the following argument is due to Tits [Ti]. Let i = j be such that m ij is finite and set s ij = s i s j · · · ∈ W a and σ ij = σ i σ j · · · ∈ N (H)⋉H ∨ where each product has m ij − 1 factors. The braid relations in W a may be written as s ij s j ′ = s j s ij where j ′ = j or i according to whether m ij is even or odd. Thus, s −1 ij s j s ij = s j ′ and therefore,\n∆ ij = σ −1 j ′ σ −1 ij σ j σ ij ∈ H ∩ σ −1 j ′ σ −1 ij N j σ ij = H ∩ σ −1 j ′ N j ′ = H j ′\nRepeating the argument with i and j permuted, we find that ∆ ji ∈ H i ′ with i ′ = i or j according to whether m ij is even or odd. Thus, ∆ ij = ∆ −1 ji ∈ H i ′ ∩ H j ′ = {1} where the latter assertion follows by follows from the simple connectedness of G.\n\n(2) The σ i satisfy (8.2)-(8.4) and (8.6) since, for any x j ∈ N j \\ H j , x 2 j = exp(iπα ∨ j ) for j ≥ 1 and x 2 0 = exp(−iπθ ∨ ). Thus σ descends to W a red .\n\nSince the diagram\nW a red A A G G N (H) ⋉ H ∨ W a\nis commutative, the kernel of σ is contained in Z/Z c ∼ = Z n 2 and is therefore trivial since, due to the simple-connectedness of G, the subgroup of G generated by σ 2 j = exp(πiα ∨ j ), j = 1 . . . n is isomorphic to Z n 2 .\n\n(3) For i = 1, . . . , n, let t i ∈ H i be such that σ i = t i σ ′ i and choose c i ∈ C such that t i = exp(c i h α i ). Since s i λ ∨ j = λ ∨ j − δ ij α ∨ i , where the λ ∨ j ∈ h are the fundamental coweights of g, we find, with t = exp( n j=1 c j λ ∨ j ) ∈ H, t · σ ′ i · t −1 exp(c i h α i ) · σ ′ i = σ i Let now t 0 = exp(c 0 h θ ) ∈ H 0 be such that σ 0 = t 0 σ ′ 0 . Since for any x ∈ C, exp(xd)σ ′ 0 exp(−xd) = exp(−xh θ )σ ′ 0 we find, with y = j c j λ ∨ j , θ − c 0 , that t exp(yd)σ ′ 0 exp(−yd)t −1 = exp((−y + j c j λ ∨ j , θ )h θ )σ ′ 0 = σ 0 so that t = t exp(yd) is the required element.\n\n8.10. The following is the main result of this appendix.\n\nTheorem. The inclusion W ֒→ W a red extends to an isomorphism W ⋉Q ∨ → W a red making the following a commutative diagram\nW ⋉ Q ∨ G G W a red W ⋉ Q ∨ W a\nProof. We wish to construct a W -equivariant section s to the restriction to Q ∨ of the extension\n1 → Z/Z c → W a red → W a → 1\nIdentify for this purpose W a red with its image inside N (H × C * ) ∩ LG by using Proposition 8.9. We claim that there exists x ∈ C such that, for any λ ∈ Q ∨ , exp H (xλ)·z λ lies in W a red . It is then clear that s(λ) = exp H (xλ)·z λ yields the required section. Let α ∨ i be a short simple coroot and w ∈ W an element such that θ ∨ = wα ∨ i . Let w ∈ W be a lift of w and lift θ ∨ ∈ Q ∨ to τ θ ∨ = s 0 w s i w −1 ∈ W a red Let e θ ∈ g θ , f θ ∈ g −θ be root vectors such that [e θ , f θ ] = θ ∨ and denote by ρ θ ∨ : SL 2 → G the embedding whose differential maps e, f, h ∈ sl 2 to e θ , f θ , θ ∨ . We may assume e θ , f θ chosen so that s 0 is of the form\nexp(f θ ⊗ z) exp(−e θ ⊗ z −1 ) exp(f θ ⊗ z) = ρ θ ∨ ( 0 −z −1 z 0 )\nSince w s i w −1 ∈ N θ \\ H θ is necessarily of the form exp(te θ ) exp(−t −1 f θ ) exp(te θ ) = ρ θ ∨ ( 0 t −t −1 0 ) for some t ∈ C * , we find that τ θ ∨ = ρ θ ∨ ( (tz) −1 0 0 tz ) = exp(xθ ∨ ) · z θ ∨ with x = − ln(t) which proves our claim for λ = θ ∨ . Let now w ∈ W with lift w ∈ W , then wτ θ ∨ w −1 = exp(xw(θ ∨ )) · z wθ ∨ so that that exp(xα ∨ i ) · z α ∨ i ∈ W a red for any short coroot α ∨ i . Since the short coroots span Q ∨ , the claim holds for any λ ∈ Q ∨ .\n\nSince s(Q ∨ ) is free abelian and W is finite, their intersection is trivial and the map W ⋉ Q ∨ → W a red , ( w, λ) → ws(λ) is injective. It is moreover surjective since Z/Z c is generated by s 2 i , i = 1 . . . n and therefore lies in W 8.11.\n\nRemark. Unlike W a red , the (non-reduced) Tits extension W a of W a is not a semi-direct product in general. For example, for g = sl 2 , with affine Cartan matrix A = 2 −2 −2 2 W a is generated by s 0 , s 1 with relations s 4 i = 1, s 0 s 2 1 s −1 0 = s 2 1 ( s 2 0 ) 2 = s 2 1 and s 1 s 2 0 s −1 1 = s 2 0\n\nIn particular, the group Z ∼ = Z 2 2 generated by s 2 0 , s 2 1 lies in the centre of W a . Any lift in W a of the generator of Q ∨ ∼ = Z is of the form τ = z s 0 s 1 , for some z ∈ Z and gives rise a W -equivariant section Q ∨ → W a if, and only if, s 1 τ s −1 1 = τ −1 . Since z = z −1 is central, such a section exists iff s 1 ( s 0 s 1 ) s −1 1 = s −1 1 s −1 0 and therefore iff s 2 1 s 2 0 = 1 which holds in W a red but not in W a .\n\nRemark. The section Q ∨ → W a red constructed in Theorem 8.10 does not in general coincide with that obtained from the canonical section Q ∨ → B a [Mc,]. For example, for g = sl 3 , the canonical lift of θ ∨ ∈ Q ∨ in B a is T θ ∨ = S 0 S 1 S 2 S 1 . When regarded as an element τ θ ∨ of W a red this does not give rise to a W -equivariant section since Ad( s θ )τ θ ∨ = (τ θ ∨ ) −1 where s θ = s 1 s 2 s 1 is a lift in W of the reflection s θ . Indeed, Ad( s 2 ) s 2 1 = s 2 1 s 2 2 in W , so that s 2 θ = s 1 Ad( s 2 )( s 2 1 ) s 2 2 s 1 = s 3 1 s 4 2 s 1 = 1 Thus, since τ θ ∨ = s 0 s θ , Ad( s θ )τ θ ∨ = s θ s 0 while (τ θ ∨ ) −1 = s θ s −1 0 which are different elements of W a red by (8.6).\n\n\nalgebra provided one sets deg(x) = 0, deg(J(x)) = 1 and deg( ) = 1.\n\n4. 2 .\n2Let Lg = g[t, t −1 ] be the loop algebra of g and U (Lg) the corresponding quantum loop algebra, viewed as a topological Hopf algebra over the ring of formal power series C[[ ]]. Thus, U (Lg) has Chevalley generators E i , F i , where i ranges over the set I = I ⊔ {0} of nodes of the affine Dynkin diagram of g and a Cartan subalgebra isomorphic to h and spanned by H i , i ∈ I and H 0 = −H θ = − i∈I a i H i , where θ ∈ h * is the highest root and the integers a i are given by θ ∨ = i a i α ∨ i . 4.3. By a finite-dimensional representation of U (Lg) we shall mean a module V which is topologically free and finitely-generated over C[[ ]]\n\n\ngiven by D(E ii ) = D i and {u a }, {u a } are dual bases of h * and h respectively. ∇ U is clearly flat and equivariant under the action of S n since the latter acts trivially on U and, by Lemma 5.5 on D. Since the latter commutes with the coefficients of ∇, the flatness and equivariance of ∇ reduces to that of ∇ which, in turn is determined by Theorem 2.5 and Proposition 2.22. The relations (tt) have already been checked in the proof of the flatness of the trigonometric Casimir connection for sl n in Theorem 3.8. The relations (τ τ ) and the equivariance relations (2.19) follow from Lemma 5.4. There remains to check that, for any i = 1, . . . , n − 1 and u\n\n7. 3 .\n3W -action on zero weight spaces of g-modules. Let G be the complex, simply-connected Lie group with Lie algebra g, H the maximal torus with Lie algebra h and N (H) ⊂ G its normaliser. If V is an integrable g-module, the action of N (H) on V permutes the weight spaces compatibly with the action of N (H) on H. In particular, it acts on the zero weight space V [0] and this action factors through W = N (H)/H. 7.4. Small g-modules.\n\n\naction of H ′ on V [0]. (2) The trigonometric Casimir connection of g with values in End(V [0]) is equal to the sum of the AKZ connection with values in the H ′module V [0] and the scalar valued one-form The trigonometric Casimir connection with values in End(V [0]) reads, by Lemma 7.4\n\n.\nIndeed, any element γ λ of the coweight lattice Hom(C * , H/Z) ⊂ L(G/Z) induces by conjugation an automorphism of LG such thatAd(γ λ )e α (n) = e α (n − λ, α )andAd(γ λ )f α (n) = f α (n + λ, α ) 8.9. Let now α i = (α i , 0), i = 1 .. . n and α 0 = (−θ, 1) be the simple roots of LG. For each i = 0 . . . n, let SL 2 (C) ∼ = G i ⊂ LG be the corresponding subgroup, H i ⊂ G i its torus and N i the normaliser of H i in G i . Note that any element of N i \\ H i is of the form exp(e i ) exp(−f i ) exp(e i ) = exp(−f i ) exp(e i ) exp(−f i ) for some choice of root vectors e i ∈ (Lg)\nwe follow the standard convention that in any expression involving ui and u i , or t i and ti, summation over i is implicit.\nnote however that line 2 of the statement of Corollary 1.3 in[Lo]  should read \"for every irreducible component I of a codimension two intersection\", the words in bold are missing in[Lo].\nx x q q q q q q q q q q q q q q q q q q(α 1 , α 1 + 2α 2 ) (α 1 + 2α 2 , α 2 ) x x (α 1 , α 1 + 3α 2 ) ! ! (α 1 + α 2 , α 1 + 2α 2 ) w w (α 1 + 3α 2 , α 2 )(α 1 , 2α 1 + 3α 2 ) (α 1 + α 2 , α 1 + 3α 2 ) (2α 1 + 3α 2 , α 2 ) (α 1 + α 2 , 2α 1 + 3α 2 ) (α 1 + 2α 2 , α 1 + 3α 2 ) (α 1 + 2α 2 , 2α 1 + 3α 2 ) (α 1 + 3α 2 , 2α 1 + 3α 2 )\nwe follow here the conventions of[Mo]  and[NO].\nnote that these differ from the coordinates zi = e α i = e θ i −θ i+1 used in §2.12.\nAcknowledgmentsI am grateful to Raphaël Rouquier for pointing me towards the Yangian at the early stages of this project. I am also grateful to Sachin Gautam for spotting a gap in my initial proof of Theorem 2.5 and to the referee for a very careful reading of this manuscript. This paper was begun at the summer home of Pénélope Riboud and Romain Graziani. It is a pleasure to thank them for their warm and friendly hospitality, and their daughter Léonore for a number of inspiring comments.\nThe sum of generalized exponents and Chevalley's restriction theorem for modules of covariants. A Broer, Indag. Math. (N.S.). 6A. Broer, The sum of generalized exponents and Chevalley's restriction theorem for modules of covariants, Indag. Math. (N.S.) 6 (1995), 385-396.\n\nParabolic presentations of the Yangian Y (gl n ). J Brundan, A Kleshchev, Comm. Math. Phys. 254J. Brundan, A. Kleshchev, Parabolic presentations of the Yangian Y (gl n ), Comm. Math. Phys. 254 (2005), 191-220.\n\nAffine extensions of Knizhnik-Zamolodchikov equations and Lusztig's isomorphisms, Special functions. I Cherednik, ICM-90 Satell. Conf. Proc. OkayamaSpringerI. Cherednik, Affine extensions of Knizhnik-Zamolodchikov equations and Lusztig's isomorphisms, Special functions (Okayama, 1990), 63-77, ICM-90 Satell. Conf. Proc., Springer, 1991.\n\nA unification of Knizhnik-Zamolodchikov and Dunkl operators via affine Hecke algebras. I Cherednik, Invent. Math. 1062I. Cherednik, A unification of Knizhnik-Zamolodchikov and Dunkl operators via affine Hecke algebras, Invent. Math. 106 (1991), no. 2, 411-431.\n\nQuantum many-body problems and representation theory. I Cherednik, Lectures on Knizhnik-Zamolodchikov equations and Hecke algebras. Math. Soc. Japan1I. Cherednik, Lectures on Knizhnik-Zamolodchikov equations and Hecke algebras, Quantum many-body problems and representation theory, 1-96, MSJ Mem., 1, Math. Soc. Japan, 1998.\n\nOn the geometry of toric arrangements. C De Concini, C Procesi, Transform. Groups. 10C. De Concini, C. Procesi, On the geometry of toric arrangements, Transform. Groups 10 (2005), 387-422.\n\nHopf algebras and the quantum Yang-Baxter equation. V G Drinfeld, Soviet Math. Dokl. 32V. G. Drinfeld, Hopf algebras and the quantum Yang-Baxter equation, Soviet Math. Dokl. 32 (1985), 254-258.\n\nA new realization of Yangians and of quantum affine algebras. V G Drinfeld, Soviet Math. Dokl. 36V. G. Drinfeld, A new realization of Yangians and of quantum affine algebras, Soviet Math. Dokl. 36 (1988), 212-216.\n\nDegenerate affine Hecke algebras and Yangians. V G Drinfeld, Functional Anal. Appl. 20V. G. Drinfeld, Degenerate affine Hecke algebras and Yangians, Functional Anal. Appl. 20 (1986), 62-64.\n\nDifferential Equations Compatible with KZ Equations. G Felder, Y Markov, V Tarasov, A Varchenko, Math. Phys. Anal. Geom. 3G. Felder, Y. Markov, V. Tarasov, and A. Varchenko, Differential Equations Compatible with KZ Equations, Math. Phys. Anal. Geom. 3 (2000) 139-177.\n\nQuantum affine algebras and holonomic difference equations. I B Frenkel, N Yu, Reshetikhin, Comm. Math. Phys. 146I. B. Frenkel, N. Yu. Reshetikhin, Quantum affine algebras and holonomic difference equations, Comm. Math. Phys. 146 (1992), 1-60.\n\nYangians and quantum affine algebras. S Gautam, V Toledano Laredo, in preparationS. Gautam, V. Toledano Laredo, Yangians and quantum affine algebras, in prepa- ration.\n\n. S Gautam, V Toledano Laredo, in preparationS. Gautam, V. Toledano Laredo, in preparation.\n\nInfinite-Dimensional Lie Algebras. V G Kac, Cambridge University Press3rd EditionV. G. Kac, Infinite-Dimensional Lie Algebras, 3rd Edition, Cambridge University Press, 1990.\n\nA A KirillovJr, Lectures on affine Hecke algebras and Macdonald's conjectures. 34A. A. Kirillov Jr., Lectures on affine Hecke algebras and Macdonald's conjectures, Bull. Amer. Math. Soc. (N.S.) 34 (1997), 251-292.\n\nReshetikhin, q-Weyl Group and a Multiplicative Formula for Universal R-Matrices. A N Kirillov, N , Comm. Math. Phys. 134A. N. Kirillov, N. Reshetikhin, q-Weyl Group and a Multiplicative Formula for Universal R-Matrices, Comm. Math. Phys. 134 (1990), 421-431.\n\nIntegrable connections related to Manin and Schechtman's higher braid groups. T Kohno, Illinois J. Math. 34T. Kohno, Integrable connections related to Manin and Schechtman's higher braid groups, Illinois J. Math. 34 (1990), 476-484.\n\nE Looijenga, Arrangements, KZ systems and Lie algebra homology, Singularity theory. LiverpoolCambridge Univ. Press263E. Looijenga, Arrangements, KZ systems and Lie algebra homology, Singularity theory (Liverpool, 1996), 109-130, London Math. Soc. Lecture Note Ser., 263, Cambridge Univ. Press, 1999.\n\nAffine Hecke algebras and their graded version. G Lusztig, J. Amer. Math. Soc. 2G. Lusztig, Affine Hecke algebras and their graded version, J. Amer. Math. Soc. 2 (1989), 599-635.\n\nI G Macdonald, Affine Hecke algebras and orthogonal polynomials. CambridgeCambridge University Press157I. G. Macdonald, Affine Hecke algebras and orthogonal polynomials. Cambridge Tracts in Mathematics, 157. Cambridge University Press, Cambridge, 2003.\n\nMathematical Surveys and Monographs, 143. A Molev, American Mathematical SocietyYangians and classical Lie algebrasA. Molev, Yangians and classical Lie algebras. Mathematical Surveys and Mono- graphs, 143. American Mathematical Society, 2007.\n\nCasimir operators and monodromy representations of generalised braid groups. J J Millson, V Toledano Laredo, Transform. Groups. 10J. J. Millson, V. Toledano Laredo, Casimir operators and monodromy representa- tions of generalised braid groups, Transform. Groups 10 (2005) 217-254.\n\nBethe subalgebras in twisted Yangians. M Nazarov, G Olshanski, Comm. Math. Phys. 178M. Nazarov, G. Olshanski, Bethe subalgebras in twisted Yangians, Comm. Math. Phys. 178 (1996), 483-506.\n\nThe fundamental groups of the spaces of regular orbits of the affine Weyl groups. Nguyêñ Viêt, Dũng , Topology. 22Nguyêñ Viêt Dũng, The fundamental groups of the spaces of regular orbits of the affine Weyl groups, Topology 22 (1983), 425-435.\n\nA Pressley, G Segal, Loop groups. Oxford Mathematical Monographs. Oxford University PressA. Pressley, G. Segal, Loop groups. Oxford Mathematical Monographs. Oxford Uni- versity Press, 1986.\n\nExterior powers of the adjoint representation. M Reeder, Canad. J. Math. 49M. Reeder, Exterior powers of the adjoint representation, Canad. J. Math. 49 (1997), 133-159.\n\nZero weight spaces and the Springer correspondence. M Reeder, Indag. Math. (N.S.). 9M. Reeder, Zero weight spaces and the Springer correspondence, Indag. Math. (N.S.) 9 (1998), 431-441.\n\nClassification of graded Hecke algebras for complex reflection groups. A Ram, A Shepler, Comment. Math. Helv. 78A. Ram, A. Shepler, Classification of graded Hecke algebras for complex reflection groups, Comment. Math. Helv. 78 (2003), 308-334.\n\nAlgebra of Functions on a Compact Quantum Group and its Representations. Y S Soibelman, Leningrad Math. J. 2Y. S. Soibelman, Algebra of Functions on a Compact Quantum Group and its Rep- resentations, Leningrad Math. J. 2 (1991), 161-178.\n\nQuiver varieties and Yangians. M Varagnolo, Lett. Math. Phys. 53M. Varagnolo, Quiver varieties and Yangians, Lett. Math. Phys. 53 (2000), 273- 283.\n\nDynamical differential equations compatible with rational qKZ equations. V Tarasov, A Varchenko, Lett. Math. Phys. 71V. Tarasov, A. Varchenko, Dynamical differential equations compatible with rational qKZ equations, Lett. Math. Phys. 71 (2005), 101-108.\n\nNormalisateurs de tores. I. Groupes de Coxeterétendus. J Tits, J. Algebra. 4J. Tits, Normalisateurs de tores. I. Groupes de Coxeterétendus, J. Algebra 4 (1966), 96-116.\n\nA Kohno-Drinfeld theorem for quantum Weyl groups. V , Toledano Laredo, Duke Math. J. 112V. Toledano Laredo, A Kohno-Drinfeld theorem for quantum Weyl groups, Duke Math. J. 112 (2002), 421-451.\n\nFlat Connections and Quantum Groups. V , Toledano Laredo, Acta Appl. Math. 73V. Toledano Laredo, Flat Connections and Quantum Groups, Acta Appl. Math. 73 (2002), 155-173.\n\nQuasi-Coxeter algebras, Dynkin diagram cohomology and quantum groups. V , Toledano Laredo, Int. Math. Res. Pap. 167ppV. Toledano Laredo, Quasi-Coxeter algebras, Dynkin diagram cohomology and quantum groups, Int. Math. Res. Pap. 2008, Art. ID rpn009, 167 pp.\n\n. H Van Der Lek, Extended Artin groups. Singularities, Part. 2360Amer. Math. SocDepartment of Mathematics, Northeastern University, 567 Lake HallProc. Sympos. Pure Math.H. van der Lek, Extended Artin groups. Singularities, Part 2 (Arcata, Calif., 1981), 117-121, Proc. Sympos. Pure Math., 40, Amer. Math. Soc., 1983. Department of Mathematics, Northeastern University, 567 Lake Hall, 360\n\n. Huntington Avenue, Boston, E-mail address: V.ToledanoLaredo@neu.eduHuntington Avenue, Boston, MA 02115. E-mail address: V.ToledanoLaredo@neu.edu\n", "annotations": {"author": "[{\"end\":91,\"start\":74},{\"end\":99,\"start\":92}]", "publisher": null, "author_last_name": "[{\"end\":90,\"start\":83},{\"end\":98,\"start\":92}]", "author_first_name": "[{\"end\":82,\"start\":74}]", "author_affiliation": null, "title": "[{\"end\":61,\"start\":1},{\"end\":160,\"start\":100}]", "venue": null, "abstract": "[{\"end\":673,\"start\":224}]", "bib_ref": "[{\"end\":1648,\"start\":1615},{\"attributes\":{\"ref_id\":\"b21\"},\"end\":1684,\"start\":1679},{\"attributes\":{\"ref_id\":\"b32\"},\"end\":1688,\"start\":1684},{\"end\":1713,\"start\":1707},{\"end\":1982,\"start\":1969},{\"attributes\":{\"ref_id\":\"b32\"},\"end\":2009,\"start\":2004},{\"attributes\":{\"ref_id\":\"b33\"},\"end\":2013,\"start\":2009},{\"attributes\":{\"ref_id\":\"b32\"},\"end\":2033,\"start\":2028},{\"attributes\":{\"ref_id\":\"b34\"},\"end\":2037,\"start\":2033},{\"end\":2264,\"start\":2261},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":2546,\"start\":2541},{\"end\":3099,\"start\":3096},{\"attributes\":{\"ref_id\":\"b7\"},\"end\":3470,\"start\":3465},{\"end\":5781,\"start\":5777},{\"end\":6072,\"start\":6068},{\"end\":6221,\"start\":6217},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":6279,\"start\":6274},{\"end\":6415,\"start\":6407},{\"end\":11502,\"start\":11498},{\"attributes\":{\"ref_id\":\"b5\"},\"end\":12489,\"start\":12484},{\"end\":12493,\"start\":12489},{\"attributes\":{\"ref_id\":\"b17\"},\"end\":15899,\"start\":15895},{\"end\":15902,\"start\":15899},{\"end\":15905,\"start\":15902},{\"attributes\":{\"ref_id\":\"b2\"},\"end\":28139,\"start\":28134},{\"attributes\":{\"ref_id\":\"b3\"},\"end\":28143,\"start\":28139},{\"attributes\":{\"ref_id\":\"b6\"},\"end\":28214,\"start\":28209},{\"attributes\":{\"ref_id\":\"b7\"},\"end\":28964,\"start\":28959},{\"attributes\":{\"ref_id\":\"b7\"},\"end\":30518,\"start\":30513},{\"attributes\":{\"ref_id\":\"b21\"},\"end\":34131,\"start\":34126},{\"end\":34137,\"start\":34131},{\"end\":35258,\"start\":35248},{\"attributes\":{\"ref_id\":\"b21\"},\"end\":35503,\"start\":35498},{\"end\":35509,\"start\":35503},{\"end\":36498,\"start\":36486},{\"end\":37006,\"start\":37002},{\"attributes\":{\"ref_id\":\"b11\"},\"end\":37017,\"start\":37011},{\"attributes\":{\"ref_id\":\"b32\"},\"end\":37196,\"start\":37191},{\"attributes\":{\"ref_id\":\"b33\"},\"end\":37200,\"start\":37196},{\"attributes\":{\"ref_id\":\"b32\"},\"end\":37221,\"start\":37216},{\"attributes\":{\"ref_id\":\"b34\"},\"end\":37225,\"start\":37221},{\"attributes\":{\"ref_id\":\"b12\"},\"end\":37521,\"start\":37515},{\"end\":38124,\"start\":38120},{\"attributes\":{\"ref_id\":\"b20\"},\"end\":44158,\"start\":44154},{\"end\":44164,\"start\":44158},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":44595,\"start\":44591},{\"end\":44604,\"start\":44595},{\"end\":47707,\"start\":47703},{\"end\":49286,\"start\":49282},{\"attributes\":{\"ref_id\":\"b6\"},\"end\":49322,\"start\":49317},{\"attributes\":{\"ref_id\":\"b6\"},\"end\":49873,\"start\":49868},{\"end\":50700,\"start\":50696},{\"end\":54090,\"start\":54087},{\"end\":56359,\"start\":56355},{\"attributes\":{\"ref_id\":\"b2\"},\"end\":56922,\"start\":56917},{\"attributes\":{\"ref_id\":\"b3\"},\"end\":56926,\"start\":56922},{\"attributes\":{\"ref_id\":\"b8\"},\"end\":57395,\"start\":57390},{\"end\":57404,\"start\":57400},{\"attributes\":{\"ref_id\":\"b0\"},\"end\":57768,\"start\":57764},{\"attributes\":{\"ref_id\":\"b25\"},\"end\":57771,\"start\":57768},{\"attributes\":{\"ref_id\":\"b26\"},\"end\":57775,\"start\":57771},{\"attributes\":{\"ref_id\":\"b33\"},\"end\":58007,\"start\":58002},{\"end\":58017,\"start\":58007},{\"attributes\":{\"ref_id\":\"b33\"},\"end\":59311,\"start\":59306},{\"end\":59318,\"start\":59311},{\"attributes\":{\"ref_id\":\"b7\"},\"end\":59522,\"start\":59517},{\"end\":59529,\"start\":59522},{\"end\":59734,\"start\":59730},{\"attributes\":{\"ref_id\":\"b26\"},\"end\":59865,\"start\":59860},{\"attributes\":{\"ref_id\":\"b13\"},\"end\":61269,\"start\":61265},{\"end\":61274,\"start\":61269},{\"attributes\":{\"ref_id\":\"b13\"},\"end\":61412,\"start\":61408},{\"end\":61423,\"start\":61412},{\"end\":61805,\"start\":61801},{\"attributes\":{\"ref_id\":\"b13\"},\"end\":62703,\"start\":62699},{\"end\":62708,\"start\":62703},{\"end\":63042,\"start\":63038},{\"end\":63326,\"start\":63322},{\"attributes\":{\"ref_id\":\"b13\"},\"end\":64422,\"start\":64418},{\"end\":64431,\"start\":64422},{\"attributes\":{\"ref_id\":\"b13\"},\"end\":65552,\"start\":65548},{\"end\":65561,\"start\":65552},{\"attributes\":{\"ref_id\":\"b13\"},\"end\":65715,\"start\":65712},{\"end\":65725,\"start\":65715},{\"end\":66702,\"start\":66698},{\"end\":68001,\"start\":67997},{\"attributes\":{\"ref_id\":\"b19\"},\"end\":72421,\"start\":72417}]", "figure": "[{\"attributes\":{\"id\":\"fig_0\"},\"end\":73036,\"start\":72967},{\"attributes\":{\"id\":\"fig_1\"},\"end\":73687,\"start\":73037},{\"attributes\":{\"id\":\"fig_2\"},\"end\":74356,\"start\":73688},{\"attributes\":{\"id\":\"fig_3\"},\"end\":74796,\"start\":74357},{\"attributes\":{\"id\":\"fig_4\"},\"end\":75085,\"start\":74797},{\"attributes\":{\"id\":\"fig_5\"},\"end\":75670,\"start\":75086}]", "paragraph": "[{\"end\":1178,\"start\":675},{\"end\":1429,\"start\":1202},{\"end\":1748,\"start\":1461},{\"end\":2038,\"start\":1750},{\"end\":2454,\"start\":2040},{\"end\":2664,\"start\":2456},{\"end\":2978,\"start\":2706},{\"end\":3725,\"start\":2980},{\"end\":3828,\"start\":3798},{\"end\":4024,\"start\":3830},{\"end\":4293,\"start\":4051},{\"end\":4921,\"start\":4295},{\"end\":5174,\"start\":4923},{\"end\":5396,\"start\":5176},{\"end\":6128,\"start\":5398},{\"end\":6633,\"start\":6130},{\"end\":6762,\"start\":6635},{\"end\":7225,\"start\":6764},{\"end\":7310,\"start\":7258},{\"end\":7442,\"start\":7392},{\"end\":7719,\"start\":7494},{\"end\":7890,\"start\":7721},{\"end\":7945,\"start\":7892},{\"end\":8114,\"start\":8071},{\"end\":8285,\"start\":8247},{\"end\":8509,\"start\":8387},{\"end\":8707,\"start\":8611},{\"end\":8781,\"start\":8754},{\"end\":8873,\"start\":8822},{\"end\":9102,\"start\":8936},{\"end\":9197,\"start\":9104},{\"end\":9702,\"start\":9355},{\"end\":9773,\"start\":9704},{\"end\":9783,\"start\":9775},{\"end\":9858,\"start\":9785},{\"end\":9908,\"start\":9860},{\"end\":10166,\"start\":10098},{\"end\":10267,\"start\":10189},{\"end\":10327,\"start\":10269},{\"end\":10425,\"start\":10329},{\"end\":10812,\"start\":10674},{\"end\":11006,\"start\":10892},{\"end\":11131,\"start\":11026},{\"end\":11262,\"start\":11166},{\"end\":11389,\"start\":11264},{\"end\":11756,\"start\":11413},{\"end\":12103,\"start\":11758},{\"end\":12315,\"start\":12105},{\"end\":12494,\"start\":12336},{\"end\":12795,\"start\":12594},{\"end\":12943,\"start\":12797},{\"end\":13143,\"start\":13137},{\"end\":13261,\"start\":13191},{\"end\":13399,\"start\":13310},{\"end\":13451,\"start\":13401},{\"end\":13562,\"start\":13466},{\"end\":13817,\"start\":13564},{\"end\":13872,\"start\":13819},{\"end\":13948,\"start\":13913},{\"end\":14169,\"start\":13950},{\"end\":14394,\"start\":14190},{\"end\":14672,\"start\":14604},{\"end\":14821,\"start\":14784},{\"end\":14849,\"start\":14823},{\"end\":14950,\"start\":14900},{\"end\":15008,\"start\":14952},{\"end\":15258,\"start\":15102},{\"end\":15299,\"start\":15260},{\"end\":15642,\"start\":15340},{\"end\":15972,\"start\":15644},{\"end\":16180,\"start\":15974},{\"end\":16235,\"start\":16182},{\"end\":16317,\"start\":16281},{\"end\":16407,\"start\":16359},{\"end\":16478,\"start\":16409},{\"end\":16901,\"start\":16833},{\"end\":16994,\"start\":16919},{\"end\":17108,\"start\":17038},{\"end\":17331,\"start\":17325},{\"end\":17430,\"start\":17333},{\"end\":17878,\"start\":17717},{\"end\":17910,\"start\":17905},{\"end\":18099,\"start\":17964},{\"end\":18150,\"start\":18101},{\"end\":18404,\"start\":18248},{\"end\":18917,\"start\":18445},{\"end\":19021,\"start\":18919},{\"end\":19209,\"start\":19154},{\"end\":19523,\"start\":19373},{\"end\":19765,\"start\":19719},{\"end\":19821,\"start\":19805},{\"end\":19925,\"start\":19899},{\"end\":20239,\"start\":19959},{\"end\":20338,\"start\":20309},{\"end\":21084,\"start\":21013},{\"end\":21338,\"start\":21261},{\"end\":21539,\"start\":21490},{\"end\":21678,\"start\":21541},{\"end\":21812,\"start\":21730},{\"end\":22096,\"start\":21814},{\"end\":22191,\"start\":22132},{\"end\":22419,\"start\":22193},{\"end\":22466,\"start\":22421},{\"end\":22689,\"start\":22551},{\"end\":22818,\"start\":22749},{\"end\":22843,\"start\":22820},{\"end\":23154,\"start\":22986},{\"end\":23288,\"start\":23256},{\"end\":23915,\"start\":23321},{\"end\":24102,\"start\":23917},{\"end\":24254,\"start\":24104},{\"end\":24502,\"start\":24364},{\"end\":24672,\"start\":24622},{\"end\":25059,\"start\":24674},{\"end\":25274,\"start\":25085},{\"end\":25822,\"start\":25778},{\"end\":25901,\"start\":25824},{\"end\":26002,\"start\":25968},{\"end\":26123,\"start\":26084},{\"end\":26225,\"start\":26133},{\"end\":26239,\"start\":26227},{\"end\":26295,\"start\":26241},{\"end\":26423,\"start\":26372},{\"end\":26546,\"start\":26425},{\"end\":26554,\"start\":26548},{\"end\":26613,\"start\":26556},{\"end\":26855,\"start\":26742},{\"end\":27349,\"start\":27163},{\"end\":27455,\"start\":27351},{\"end\":27494,\"start\":27457},{\"end\":27663,\"start\":27543},{\"end\":28144,\"start\":27928},{\"end\":28474,\"start\":28146},{\"end\":29100,\"start\":28813},{\"end\":29610,\"start\":29526},{\"end\":30375,\"start\":30228},{\"end\":30599,\"start\":30471},{\"end\":30735,\"start\":30632},{\"end\":31336,\"start\":31092},{\"end\":31470,\"start\":31407},{\"end\":31935,\"start\":31916},{\"end\":32047,\"start\":31989},{\"end\":32165,\"start\":32135},{\"end\":32179,\"start\":32167},{\"end\":32255,\"start\":32181},{\"end\":32294,\"start\":32257},{\"end\":32502,\"start\":32477},{\"end\":32604,\"start\":32536},{\"end\":32768,\"start\":32634},{\"end\":33132,\"start\":32932},{\"end\":33282,\"start\":33134},{\"end\":33550,\"start\":33444},{\"end\":33709,\"start\":33590},{\"end\":33887,\"start\":33839},{\"end\":33969,\"start\":33896},{\"end\":34381,\"start\":33971},{\"end\":34566,\"start\":34383},{\"end\":35050,\"start\":34767},{\"end\":35259,\"start\":35080},{\"end\":35690,\"start\":35261},{\"end\":35764,\"start\":35692},{\"end\":36575,\"start\":35802},{\"end\":37427,\"start\":36871},{\"end\":37522,\"start\":37429},{\"end\":38254,\"start\":37571},{\"end\":38866,\"start\":38410},{\"end\":39010,\"start\":38868},{\"end\":39248,\"start\":39045},{\"end\":39284,\"start\":39250},{\"end\":39524,\"start\":39389},{\"end\":39862,\"start\":39739},{\"end\":40091,\"start\":39957},{\"end\":40170,\"start\":40120},{\"end\":40526,\"start\":40264},{\"end\":40742,\"start\":40658},{\"end\":40997,\"start\":40832},{\"end\":41197,\"start\":41128},{\"end\":41469,\"start\":41369},{\"end\":41582,\"start\":41530},{\"end\":41778,\"start\":41712},{\"end\":41901,\"start\":41780},{\"end\":42149,\"start\":41994},{\"end\":42276,\"start\":42151},{\"end\":42564,\"start\":42437},{\"end\":42655,\"start\":42566},{\"end\":42839,\"start\":42657},{\"end\":43073,\"start\":42900},{\"end\":43400,\"start\":43364},{\"end\":43644,\"start\":43419},{\"end\":43775,\"start\":43646},{\"end\":43872,\"start\":43842},{\"end\":44165,\"start\":44006},{\"end\":44678,\"start\":44193},{\"end\":44852,\"start\":44734},{\"end\":45275,\"start\":45187},{\"end\":45507,\"start\":45277},{\"end\":45591,\"start\":45541},{\"end\":45697,\"start\":45593},{\"end\":46004,\"start\":45938},{\"end\":46113,\"start\":46073},{\"end\":46343,\"start\":46185},{\"end\":46513,\"start\":46403},{\"end\":46771,\"start\":46563},{\"end\":46914,\"start\":46812},{\"end\":47176,\"start\":47036},{\"end\":47321,\"start\":47178},{\"end\":47630,\"start\":47522},{\"end\":47863,\"start\":47632},{\"end\":47968,\"start\":47894},{\"end\":48334,\"start\":48268},{\"end\":48765,\"start\":48586},{\"end\":48925,\"start\":48862},{\"end\":49287,\"start\":48943},{\"end\":49427,\"start\":49289},{\"end\":49669,\"start\":49494},{\"end\":49835,\"start\":49821},{\"end\":49963,\"start\":49837},{\"end\":50089,\"start\":49999},{\"end\":50527,\"start\":50420},{\"end\":50622,\"start\":50588},{\"end\":50980,\"start\":50664},{\"end\":51400,\"start\":51165},{\"end\":51520,\"start\":51402},{\"end\":51848,\"start\":51529},{\"end\":52038,\"start\":51975},{\"end\":52141,\"start\":52122},{\"end\":52952,\"start\":52249},{\"end\":53133,\"start\":53047},{\"end\":53226,\"start\":53135},{\"end\":53476,\"start\":53402},{\"end\":53491,\"start\":53485},{\"end\":53572,\"start\":53556},{\"end\":53631,\"start\":53574},{\"end\":53743,\"start\":53696},{\"end\":54171,\"start\":53806},{\"end\":54256,\"start\":54182},{\"end\":54503,\"start\":54325},{\"end\":54752,\"start\":54738},{\"end\":55035,\"start\":54835},{\"end\":55260,\"start\":55157},{\"end\":55697,\"start\":55520},{\"end\":56180,\"start\":55726},{\"end\":56533,\"start\":56182},{\"end\":56654,\"start\":56580},{\"end\":56759,\"start\":56656},{\"end\":57188,\"start\":56812},{\"end\":57431,\"start\":57190},{\"end\":57536,\"start\":57490},{\"end\":57643,\"start\":57577},{\"end\":58108,\"start\":57645},{\"end\":58293,\"start\":58138},{\"end\":58399,\"start\":58315},{\"end\":58511,\"start\":58401},{\"end\":58752,\"start\":58702},{\"end\":58856,\"start\":58820},{\"end\":59176,\"start\":58945},{\"end\":59322,\"start\":59178},{\"end\":60467,\"start\":59324},{\"end\":61375,\"start\":60519},{\"end\":61456,\"start\":61405},{\"end\":61602,\"start\":61487},{\"end\":61697,\"start\":61604},{\"end\":61752,\"start\":61738},{\"end\":61888,\"start\":61788},{\"end\":62386,\"start\":62030},{\"end\":62474,\"start\":62388},{\"end\":63163,\"start\":62512},{\"end\":63306,\"start\":63237},{\"end\":63400,\"start\":63308},{\"end\":64202,\"start\":63466},{\"end\":64507,\"start\":64352},{\"end\":64680,\"start\":64509},{\"end\":64747,\"start\":64682},{\"end\":64833,\"start\":64765},{\"end\":65164,\"start\":64927},{\"end\":65652,\"start\":65195},{\"end\":65823,\"start\":65654},{\"end\":66892,\"start\":65939},{\"end\":67298,\"start\":66931},{\"end\":67478,\"start\":67380},{\"end\":67633,\"start\":67495},{\"end\":67741,\"start\":67635},{\"end\":67945,\"start\":67743},{\"end\":67953,\"start\":67947},{\"end\":68327,\"start\":67955},{\"end\":68678,\"start\":68422},{\"end\":68841,\"start\":68680},{\"end\":68860,\"start\":68843},{\"end\":69119,\"start\":68893},{\"end\":69724,\"start\":69121},{\"end\":69782,\"start\":69726},{\"end\":69905,\"start\":69784},{\"end\":70035,\"start\":69938},{\"end\":70729,\"start\":70066},{\"end\":71273,\"start\":70798},{\"end\":71519,\"start\":71275},{\"end\":71828,\"start\":71521},{\"end\":72268,\"start\":71830},{\"end\":72966,\"start\":72270}]", "formula": "[{\"attributes\":{\"id\":\"formula_0\"},\"end\":1201,\"start\":1179},{\"attributes\":{\"id\":\"formula_1\"},\"end\":1460,\"start\":1430},{\"attributes\":{\"id\":\"formula_2\"},\"end\":2705,\"start\":2665},{\"attributes\":{\"id\":\"formula_3\"},\"end\":3797,\"start\":3726},{\"attributes\":{\"id\":\"formula_4\"},\"end\":4050,\"start\":4025},{\"attributes\":{\"id\":\"formula_5\"},\"end\":7257,\"start\":7226},{\"attributes\":{\"id\":\"formula_6\"},\"end\":7391,\"start\":7311},{\"attributes\":{\"id\":\"formula_7\"},\"end\":7493,\"start\":7443},{\"attributes\":{\"id\":\"formula_8\"},\"end\":8070,\"start\":7946},{\"attributes\":{\"id\":\"formula_9\"},\"end\":8246,\"start\":8115},{\"attributes\":{\"id\":\"formula_10\"},\"end\":8386,\"start\":8286},{\"attributes\":{\"id\":\"formula_11\"},\"end\":8610,\"start\":8510},{\"attributes\":{\"id\":\"formula_12\"},\"end\":8753,\"start\":8708},{\"attributes\":{\"id\":\"formula_13\"},\"end\":8821,\"start\":8782},{\"attributes\":{\"id\":\"formula_14\"},\"end\":8935,\"start\":8874},{\"attributes\":{\"id\":\"formula_15\"},\"end\":9354,\"start\":9198},{\"attributes\":{\"id\":\"formula_16\"},\"end\":10097,\"start\":9909},{\"attributes\":{\"id\":\"formula_17\"},\"end\":10188,\"start\":10167},{\"attributes\":{\"id\":\"formula_18\"},\"end\":10673,\"start\":10426},{\"attributes\":{\"id\":\"formula_19\"},\"end\":10891,\"start\":10813},{\"attributes\":{\"id\":\"formula_20\"},\"end\":11025,\"start\":11007},{\"attributes\":{\"id\":\"formula_21\"},\"end\":11165,\"start\":11132},{\"attributes\":{\"id\":\"formula_22\"},\"end\":11412,\"start\":11390},{\"attributes\":{\"id\":\"formula_23\"},\"end\":12335,\"start\":12316},{\"attributes\":{\"id\":\"formula_24\"},\"end\":12593,\"start\":12495},{\"attributes\":{\"id\":\"formula_25\"},\"end\":13136,\"start\":12944},{\"attributes\":{\"id\":\"formula_26\"},\"end\":13190,\"start\":13144},{\"attributes\":{\"id\":\"formula_27\"},\"end\":13309,\"start\":13262},{\"attributes\":{\"id\":\"formula_28\"},\"end\":13465,\"start\":13452},{\"attributes\":{\"id\":\"formula_29\"},\"end\":13912,\"start\":13873},{\"attributes\":{\"id\":\"formula_30\"},\"end\":14189,\"start\":14170},{\"attributes\":{\"id\":\"formula_31\"},\"end\":14603,\"start\":14395},{\"attributes\":{\"id\":\"formula_32\"},\"end\":14783,\"start\":14673},{\"attributes\":{\"id\":\"formula_33\"},\"end\":14899,\"start\":14850},{\"attributes\":{\"id\":\"formula_34\"},\"end\":15101,\"start\":15009},{\"attributes\":{\"id\":\"formula_35\"},\"end\":15339,\"start\":15300},{\"attributes\":{\"id\":\"formula_36\"},\"end\":16280,\"start\":16236},{\"attributes\":{\"id\":\"formula_37\"},\"end\":16358,\"start\":16318},{\"attributes\":{\"id\":\"formula_38\"},\"end\":16832,\"start\":16479},{\"attributes\":{\"id\":\"formula_39\"},\"end\":16918,\"start\":16902},{\"attributes\":{\"id\":\"formula_40\"},\"end\":17037,\"start\":16995},{\"attributes\":{\"id\":\"formula_41\"},\"end\":17324,\"start\":17109},{\"attributes\":{\"id\":\"formula_42\"},\"end\":17716,\"start\":17431},{\"attributes\":{\"id\":\"formula_43\"},\"end\":17904,\"start\":17879},{\"attributes\":{\"id\":\"formula_44\"},\"end\":17963,\"start\":17911},{\"attributes\":{\"id\":\"formula_45\"},\"end\":18247,\"start\":18151},{\"attributes\":{\"id\":\"formula_46\"},\"end\":18444,\"start\":18405},{\"attributes\":{\"id\":\"formula_47\"},\"end\":19153,\"start\":19022},{\"attributes\":{\"id\":\"formula_48\"},\"end\":19372,\"start\":19210},{\"attributes\":{\"id\":\"formula_49\"},\"end\":19718,\"start\":19524},{\"attributes\":{\"id\":\"formula_50\"},\"end\":19804,\"start\":19766},{\"attributes\":{\"id\":\"formula_51\"},\"end\":19898,\"start\":19822},{\"attributes\":{\"id\":\"formula_52\"},\"end\":19958,\"start\":19926},{\"attributes\":{\"id\":\"formula_53\"},\"end\":20308,\"start\":20240},{\"attributes\":{\"id\":\"formula_54\"},\"end\":21012,\"start\":20339},{\"attributes\":{\"id\":\"formula_55\"},\"end\":21260,\"start\":21085},{\"attributes\":{\"id\":\"formula_56\"},\"end\":21489,\"start\":21339},{\"attributes\":{\"id\":\"formula_57\"},\"end\":21729,\"start\":21679},{\"attributes\":{\"id\":\"formula_58\"},\"end\":22131,\"start\":22097},{\"attributes\":{\"id\":\"formula_59\"},\"end\":22550,\"start\":22467},{\"attributes\":{\"id\":\"formula_60\"},\"end\":22748,\"start\":22690},{\"attributes\":{\"id\":\"formula_61\"},\"end\":22985,\"start\":22844},{\"attributes\":{\"id\":\"formula_62\"},\"end\":23255,\"start\":23155},{\"attributes\":{\"id\":\"formula_63\"},\"end\":23320,\"start\":23289},{\"attributes\":{\"id\":\"formula_64\"},\"end\":24363,\"start\":24255},{\"attributes\":{\"id\":\"formula_65\"},\"end\":24621,\"start\":24503},{\"attributes\":{\"id\":\"formula_66\"},\"end\":25084,\"start\":25060},{\"attributes\":{\"id\":\"formula_67\"},\"end\":25777,\"start\":25275},{\"attributes\":{\"id\":\"formula_68\"},\"end\":25967,\"start\":25902},{\"attributes\":{\"id\":\"formula_69\"},\"end\":26083,\"start\":26003},{\"attributes\":{\"id\":\"formula_70\"},\"end\":26371,\"start\":26296},{\"attributes\":{\"id\":\"formula_71\"},\"end\":26741,\"start\":26614},{\"attributes\":{\"id\":\"formula_72\"},\"end\":27162,\"start\":26856},{\"attributes\":{\"id\":\"formula_73\"},\"end\":27542,\"start\":27495},{\"attributes\":{\"id\":\"formula_74\"},\"end\":27927,\"start\":27664},{\"attributes\":{\"id\":\"formula_75\"},\"end\":28812,\"start\":28475},{\"attributes\":{\"id\":\"formula_76\"},\"end\":29180,\"start\":29101},{\"attributes\":{\"id\":\"formula_77\"},\"end\":29525,\"start\":29180},{\"attributes\":{\"id\":\"formula_78\"},\"end\":30227,\"start\":29611},{\"attributes\":{\"id\":\"formula_79\"},\"end\":30470,\"start\":30376},{\"attributes\":{\"id\":\"formula_80\"},\"end\":30631,\"start\":30600},{\"attributes\":{\"id\":\"formula_81\"},\"end\":31091,\"start\":30736},{\"attributes\":{\"id\":\"formula_82\"},\"end\":31406,\"start\":31337},{\"attributes\":{\"id\":\"formula_83\"},\"end\":31915,\"start\":31471},{\"attributes\":{\"id\":\"formula_84\"},\"end\":31988,\"start\":31936},{\"attributes\":{\"id\":\"formula_85\"},\"end\":32134,\"start\":32048},{\"attributes\":{\"id\":\"formula_86\"},\"end\":32476,\"start\":32295},{\"attributes\":{\"id\":\"formula_87\"},\"end\":32535,\"start\":32503},{\"attributes\":{\"id\":\"formula_88\"},\"end\":32633,\"start\":32605},{\"attributes\":{\"id\":\"formula_89\"},\"end\":32931,\"start\":32769},{\"attributes\":{\"id\":\"formula_90\"},\"end\":33443,\"start\":33283},{\"attributes\":{\"id\":\"formula_91\"},\"end\":33589,\"start\":33551},{\"attributes\":{\"id\":\"formula_92\"},\"end\":33838,\"start\":33710},{\"attributes\":{\"id\":\"formula_93\"},\"end\":34739,\"start\":34567},{\"attributes\":{\"id\":\"formula_94\"},\"end\":35801,\"start\":35765},{\"attributes\":{\"id\":\"formula_95\"},\"end\":36870,\"start\":36576},{\"attributes\":{\"id\":\"formula_96\"},\"end\":38409,\"start\":38255},{\"attributes\":{\"id\":\"formula_97\"},\"end\":39044,\"start\":39011},{\"attributes\":{\"id\":\"formula_98\"},\"end\":39388,\"start\":39285},{\"attributes\":{\"id\":\"formula_99\"},\"end\":39738,\"start\":39525},{\"attributes\":{\"id\":\"formula_100\"},\"end\":39956,\"start\":39863},{\"attributes\":{\"id\":\"formula_101\"},\"end\":40119,\"start\":40092},{\"attributes\":{\"id\":\"formula_102\"},\"end\":40263,\"start\":40171},{\"attributes\":{\"id\":\"formula_103\"},\"end\":40657,\"start\":40580},{\"attributes\":{\"id\":\"formula_104\"},\"end\":40831,\"start\":40743},{\"attributes\":{\"id\":\"formula_105\"},\"end\":41127,\"start\":41033},{\"attributes\":{\"id\":\"formula_106\"},\"end\":41368,\"start\":41198},{\"attributes\":{\"id\":\"formula_107\"},\"end\":41711,\"start\":41583},{\"attributes\":{\"id\":\"formula_108\"},\"end\":41993,\"start\":41902},{\"attributes\":{\"id\":\"formula_109\"},\"end\":42436,\"start\":42277},{\"attributes\":{\"id\":\"formula_110\"},\"end\":42899,\"start\":42840},{\"attributes\":{\"id\":\"formula_111\"},\"end\":43200,\"start\":43074},{\"attributes\":{\"id\":\"formula_112\"},\"end\":43363,\"start\":43200},{\"attributes\":{\"id\":\"formula_113\"},\"end\":43841,\"start\":43776},{\"attributes\":{\"id\":\"formula_114\"},\"end\":44005,\"start\":43873},{\"attributes\":{\"id\":\"formula_115\"},\"end\":44192,\"start\":44166},{\"attributes\":{\"id\":\"formula_116\"},\"end\":44733,\"start\":44679},{\"attributes\":{\"id\":\"formula_117\"},\"end\":45186,\"start\":44853},{\"attributes\":{\"id\":\"formula_118\"},\"end\":45540,\"start\":45508},{\"attributes\":{\"id\":\"formula_119\"},\"end\":45937,\"start\":45698},{\"attributes\":{\"id\":\"formula_120\"},\"end\":46072,\"start\":46005},{\"attributes\":{\"id\":\"formula_121\"},\"end\":46184,\"start\":46114},{\"attributes\":{\"id\":\"formula_122\"},\"end\":46402,\"start\":46344},{\"attributes\":{\"id\":\"formula_123\"},\"end\":46562,\"start\":46514},{\"attributes\":{\"id\":\"formula_124\"},\"end\":46811,\"start\":46772},{\"attributes\":{\"id\":\"formula_125\"},\"end\":47035,\"start\":46915},{\"attributes\":{\"id\":\"formula_126\"},\"end\":47521,\"start\":47322},{\"attributes\":{\"id\":\"formula_127\"},\"end\":47893,\"start\":47864},{\"attributes\":{\"id\":\"formula_128\"},\"end\":48267,\"start\":47969},{\"attributes\":{\"id\":\"formula_129\"},\"end\":48585,\"start\":48335},{\"attributes\":{\"id\":\"formula_130\"},\"end\":48861,\"start\":48766},{\"attributes\":{\"id\":\"formula_131\"},\"end\":49493,\"start\":49428},{\"attributes\":{\"id\":\"formula_132\"},\"end\":49820,\"start\":49670},{\"attributes\":{\"id\":\"formula_133\"},\"end\":49998,\"start\":49964},{\"attributes\":{\"id\":\"formula_134\"},\"end\":50419,\"start\":50090},{\"attributes\":{\"id\":\"formula_135\"},\"end\":50587,\"start\":50528},{\"attributes\":{\"id\":\"formula_136\"},\"end\":50663,\"start\":50623},{\"attributes\":{\"id\":\"formula_137\"},\"end\":50992,\"start\":50981},{\"attributes\":{\"id\":\"formula_138\"},\"end\":51164,\"start\":50992},{\"attributes\":{\"id\":\"formula_139\"},\"end\":51911,\"start\":51849},{\"attributes\":{\"id\":\"formula_140\"},\"end\":51974,\"start\":51911},{\"attributes\":{\"id\":\"formula_141\"},\"end\":52121,\"start\":52039},{\"attributes\":{\"id\":\"formula_142\"},\"end\":52248,\"start\":52142},{\"attributes\":{\"id\":\"formula_143\"},\"end\":53046,\"start\":52953},{\"attributes\":{\"id\":\"formula_144\"},\"end\":53401,\"start\":53227},{\"attributes\":{\"id\":\"formula_145\"},\"end\":53555,\"start\":53492},{\"attributes\":{\"id\":\"formula_146\"},\"end\":53695,\"start\":53632},{\"attributes\":{\"id\":\"formula_147\"},\"end\":53805,\"start\":53744},{\"attributes\":{\"id\":\"formula_148\"},\"end\":54324,\"start\":54257},{\"attributes\":{\"id\":\"formula_149\"},\"end\":54737,\"start\":54504},{\"attributes\":{\"id\":\"formula_150\"},\"end\":54834,\"start\":54753},{\"attributes\":{\"id\":\"formula_151\"},\"end\":55156,\"start\":55036},{\"attributes\":{\"id\":\"formula_152\"},\"end\":55519,\"start\":55261},{\"attributes\":{\"id\":\"formula_153\"},\"end\":56579,\"start\":56534},{\"attributes\":{\"id\":\"formula_154\"},\"end\":56811,\"start\":56760},{\"attributes\":{\"id\":\"formula_155\"},\"end\":57489,\"start\":57432},{\"attributes\":{\"id\":\"formula_156\"},\"end\":57576,\"start\":57537},{\"attributes\":{\"id\":\"formula_157\"},\"end\":58137,\"start\":58109},{\"attributes\":{\"id\":\"formula_158\"},\"end\":58314,\"start\":58294},{\"attributes\":{\"id\":\"formula_159\"},\"end\":58568,\"start\":58512},{\"attributes\":{\"id\":\"formula_160\"},\"end\":58701,\"start\":58568},{\"attributes\":{\"id\":\"formula_161\"},\"end\":58819,\"start\":58753},{\"attributes\":{\"id\":\"formula_162\"},\"end\":58944,\"start\":58857},{\"attributes\":{\"id\":\"formula_163\"},\"end\":61404,\"start\":61376},{\"attributes\":{\"id\":\"formula_164\"},\"end\":61486,\"start\":61457},{\"attributes\":{\"id\":\"formula_165\"},\"end\":61737,\"start\":61698},{\"attributes\":{\"id\":\"formula_166\"},\"end\":62029,\"start\":61889},{\"attributes\":{\"id\":\"formula_167\"},\"end\":62511,\"start\":62475},{\"attributes\":{\"id\":\"formula_168\"},\"end\":63236,\"start\":63164},{\"attributes\":{\"id\":\"formula_169\"},\"end\":63465,\"start\":63401},{\"attributes\":{\"id\":\"formula_170\"},\"end\":64261,\"start\":64203},{\"attributes\":{\"id\":\"formula_171\"},\"end\":64351,\"start\":64296},{\"attributes\":{\"id\":\"formula_172\"},\"end\":64764,\"start\":64748},{\"attributes\":{\"id\":\"formula_173\"},\"end\":64926,\"start\":64881},{\"attributes\":{\"id\":\"formula_174\"},\"end\":65194,\"start\":65165},{\"attributes\":{\"id\":\"formula_175\"},\"end\":65925,\"start\":65824},{\"attributes\":{\"id\":\"formula_176\"},\"end\":65938,\"start\":65925},{\"attributes\":{\"id\":\"formula_177\"},\"end\":66930,\"start\":66893},{\"attributes\":{\"id\":\"formula_178\"},\"end\":67379,\"start\":67299},{\"attributes\":{\"id\":\"formula_179\"},\"end\":68421,\"start\":68328},{\"attributes\":{\"id\":\"formula_180\"},\"end\":68892,\"start\":68861},{\"attributes\":{\"id\":\"formula_181\"},\"end\":69937,\"start\":69906},{\"attributes\":{\"id\":\"formula_182\"},\"end\":70065,\"start\":70036},{\"attributes\":{\"id\":\"formula_183\"},\"end\":70797,\"start\":70730}]", "table_ref": null, "section_header": "[{\"end\":26131,\"start\":26126},{\"end\":33894,\"start\":33890},{\"attributes\":{\"n\":\"4.\"},\"end\":34765,\"start\":34741},{\"attributes\":{\"n\":\"4.1.\"},\"end\":35078,\"start\":35053},{\"attributes\":{\"n\":\"5.\"},\"end\":37569,\"start\":37525},{\"attributes\":{\"n\":\"5.3.\"},\"end\":40579,\"start\":40529},{\"attributes\":{\"n\":\"5.4.\"},\"end\":41032,\"start\":41000},{\"attributes\":{\"n\":\"5.5.\"},\"end\":41528,\"start\":41472},{\"attributes\":{\"n\":\"5.8.\"},\"end\":43417,\"start\":43403},{\"attributes\":{\"n\":\"6.\"},\"end\":48941,\"start\":48928},{\"end\":51527,\"start\":51523},{\"end\":53483,\"start\":53479},{\"end\":54180,\"start\":54174},{\"attributes\":{\"n\":\"7.\"},\"end\":55724,\"start\":55700},{\"attributes\":{\"n\":\"8.\"},\"end\":60517,\"start\":60470},{\"attributes\":{\"n\":\"8.2.\"},\"end\":61786,\"start\":61755},{\"attributes\":{\"n\":\"8.5.\"},\"end\":64295,\"start\":64263},{\"end\":64880,\"start\":64836},{\"end\":67493,\"start\":67481},{\"end\":73044,\"start\":73038},{\"end\":74364,\"start\":74358},{\"end\":75088,\"start\":75087}]", "table": null, "figure_caption": "[{\"end\":73036,\"start\":72969},{\"end\":73687,\"start\":73046},{\"end\":74356,\"start\":73690},{\"end\":74796,\"start\":74366},{\"end\":75085,\"start\":74799},{\"end\":75670,\"start\":75089}]", "figure_ref": "[{\"end\":50918,\"start\":50911},{\"end\":51588,\"start\":51581}]", "bib_author_first_name": "[{\"end\":77041,\"start\":77040},{\"end\":77268,\"start\":77267},{\"end\":77279,\"start\":77278},{\"end\":77530,\"start\":77529},{\"end\":77855,\"start\":77854},{\"end\":78084,\"start\":78083},{\"end\":78395,\"start\":78394},{\"end\":78409,\"start\":78408},{\"end\":78598,\"start\":78597},{\"end\":78600,\"start\":78599},{\"end\":78803,\"start\":78802},{\"end\":78805,\"start\":78804},{\"end\":79003,\"start\":79002},{\"end\":79005,\"start\":79004},{\"end\":79200,\"start\":79199},{\"end\":79210,\"start\":79209},{\"end\":79220,\"start\":79219},{\"end\":79231,\"start\":79230},{\"end\":79477,\"start\":79476},{\"end\":79479,\"start\":79478},{\"end\":79490,\"start\":79489},{\"end\":79700,\"start\":79699},{\"end\":79710,\"start\":79709},{\"end\":79719,\"start\":79711},{\"end\":79833,\"start\":79832},{\"end\":79843,\"start\":79842},{\"end\":79852,\"start\":79844},{\"end\":79959,\"start\":79958},{\"end\":79961,\"start\":79960},{\"end\":80099,\"start\":80098},{\"end\":80101,\"start\":80100},{\"end\":80395,\"start\":80394},{\"end\":80397,\"start\":80396},{\"end\":80409,\"start\":80408},{\"end\":80652,\"start\":80651},{\"end\":80808,\"start\":80807},{\"end\":81157,\"start\":81156},{\"end\":81289,\"start\":81288},{\"end\":81291,\"start\":81290},{\"end\":81585,\"start\":81584},{\"end\":81864,\"start\":81863},{\"end\":81866,\"start\":81865},{\"end\":81877,\"start\":81876},{\"end\":81886,\"start\":81878},{\"end\":82108,\"start\":82107},{\"end\":82119,\"start\":82118},{\"end\":82345,\"start\":82339},{\"end\":82356,\"start\":82352},{\"end\":82502,\"start\":82501},{\"end\":82514,\"start\":82513},{\"end\":82740,\"start\":82739},{\"end\":82915,\"start\":82914},{\"end\":83121,\"start\":83120},{\"end\":83128,\"start\":83127},{\"end\":83368,\"start\":83367},{\"end\":83370,\"start\":83369},{\"end\":83565,\"start\":83564},{\"end\":83756,\"start\":83755},{\"end\":83767,\"start\":83766},{\"end\":83993,\"start\":83992},{\"end\":84158,\"start\":84157},{\"end\":84169,\"start\":84161},{\"end\":84339,\"start\":84338},{\"end\":84350,\"start\":84342},{\"end\":84544,\"start\":84543},{\"end\":84555,\"start\":84547},{\"end\":84735,\"start\":84734},{\"end\":85133,\"start\":85123}]", "bib_author_last_name": "[{\"end\":77047,\"start\":77042},{\"end\":77276,\"start\":77269},{\"end\":77289,\"start\":77280},{\"end\":77540,\"start\":77531},{\"end\":77865,\"start\":77856},{\"end\":78094,\"start\":78085},{\"end\":78406,\"start\":78396},{\"end\":78417,\"start\":78410},{\"end\":78609,\"start\":78601},{\"end\":78814,\"start\":78806},{\"end\":79014,\"start\":79006},{\"end\":79207,\"start\":79201},{\"end\":79217,\"start\":79211},{\"end\":79228,\"start\":79221},{\"end\":79241,\"start\":79232},{\"end\":79487,\"start\":79480},{\"end\":79493,\"start\":79491},{\"end\":79506,\"start\":79495},{\"end\":79707,\"start\":79701},{\"end\":79726,\"start\":79720},{\"end\":79840,\"start\":79834},{\"end\":79859,\"start\":79853},{\"end\":79965,\"start\":79962},{\"end\":80110,\"start\":80102},{\"end\":80406,\"start\":80398},{\"end\":80658,\"start\":80653},{\"end\":80818,\"start\":80809},{\"end\":81165,\"start\":81158},{\"end\":81301,\"start\":81292},{\"end\":81591,\"start\":81586},{\"end\":81874,\"start\":81867},{\"end\":81893,\"start\":81887},{\"end\":82116,\"start\":82109},{\"end\":82129,\"start\":82120},{\"end\":82350,\"start\":82346},{\"end\":82511,\"start\":82503},{\"end\":82520,\"start\":82515},{\"end\":82747,\"start\":82741},{\"end\":82922,\"start\":82916},{\"end\":83125,\"start\":83122},{\"end\":83136,\"start\":83129},{\"end\":83380,\"start\":83371},{\"end\":83575,\"start\":83566},{\"end\":83764,\"start\":83757},{\"end\":83777,\"start\":83768},{\"end\":83998,\"start\":83994},{\"end\":84176,\"start\":84170},{\"end\":84357,\"start\":84351},{\"end\":84562,\"start\":84556},{\"end\":84747,\"start\":84736},{\"end\":85140,\"start\":85134},{\"end\":85148,\"start\":85142}]", "bib_entry": "[{\"attributes\":{\"id\":\"b0\",\"matched_paper_id\":121155579},\"end\":77215,\"start\":76944},{\"attributes\":{\"id\":\"b1\"},\"end\":77426,\"start\":77217},{\"attributes\":{\"id\":\"b2\",\"matched_paper_id\":124262212},\"end\":77765,\"start\":77428},{\"attributes\":{\"id\":\"b3\",\"matched_paper_id\":122931188},\"end\":78027,\"start\":77767},{\"attributes\":{\"id\":\"b4\",\"matched_paper_id\":118860305},\"end\":78353,\"start\":78029},{\"attributes\":{\"id\":\"b5\",\"matched_paper_id\":14507657},\"end\":78543,\"start\":78355},{\"attributes\":{\"id\":\"b6\",\"matched_paper_id\":83370599},\"end\":78738,\"start\":78545},{\"attributes\":{\"id\":\"b7\"},\"end\":78953,\"start\":78740},{\"attributes\":{\"id\":\"b8\",\"matched_paper_id\":119659066},\"end\":79144,\"start\":78955},{\"attributes\":{\"id\":\"b9\",\"matched_paper_id\":119590296},\"end\":79414,\"start\":79146},{\"attributes\":{\"id\":\"b10\",\"matched_paper_id\":119818318},\"end\":79659,\"start\":79416},{\"attributes\":{\"id\":\"b11\"},\"end\":79828,\"start\":79661},{\"attributes\":{\"id\":\"b12\"},\"end\":79921,\"start\":79830},{\"attributes\":{\"id\":\"b13\"},\"end\":80096,\"start\":79923},{\"attributes\":{\"id\":\"b14\"},\"end\":80311,\"start\":80098},{\"attributes\":{\"id\":\"b15\"},\"end\":80571,\"start\":80313},{\"attributes\":{\"id\":\"b16\",\"matched_paper_id\":117709686},\"end\":80805,\"start\":80573},{\"attributes\":{\"id\":\"b17\"},\"end\":81106,\"start\":80807},{\"attributes\":{\"id\":\"b18\",\"matched_paper_id\":121133856},\"end\":81286,\"start\":81108},{\"attributes\":{\"id\":\"b19\"},\"end\":81540,\"start\":81288},{\"attributes\":{\"id\":\"b20\"},\"end\":81784,\"start\":81542},{\"attributes\":{\"id\":\"b21\",\"matched_paper_id\":12284829},\"end\":82066,\"start\":81786},{\"attributes\":{\"id\":\"b22\",\"matched_paper_id\":16009965},\"end\":82255,\"start\":82068},{\"attributes\":{\"id\":\"b23\",\"matched_paper_id\":122006390},\"end\":82499,\"start\":82257},{\"attributes\":{\"id\":\"b24\"},\"end\":82690,\"start\":82501},{\"attributes\":{\"id\":\"b25\",\"matched_paper_id\":120426295},\"end\":82860,\"start\":82692},{\"attributes\":{\"id\":\"b26\",\"matched_paper_id\":122185932},\"end\":83047,\"start\":82862},{\"attributes\":{\"id\":\"b27\",\"matched_paper_id\":5913146},\"end\":83292,\"start\":83049},{\"attributes\":{\"id\":\"b28\"},\"end\":83531,\"start\":83294},{\"attributes\":{\"id\":\"b29\",\"matched_paper_id\":119595057},\"end\":83680,\"start\":83533},{\"attributes\":{\"id\":\"b30\",\"matched_paper_id\":14788476},\"end\":83935,\"start\":83682},{\"attributes\":{\"id\":\"b31\",\"matched_paper_id\":121195695},\"end\":84105,\"start\":83937},{\"attributes\":{\"id\":\"b32\",\"matched_paper_id\":11291485},\"end\":84299,\"start\":84107},{\"attributes\":{\"id\":\"b33\",\"matched_paper_id\":16251582},\"end\":84471,\"start\":84301},{\"attributes\":{\"id\":\"b34\",\"matched_paper_id\":115315009},\"end\":84730,\"start\":84473},{\"attributes\":{\"id\":\"b35\"},\"end\":85119,\"start\":84732},{\"attributes\":{\"id\":\"b36\"},\"end\":85267,\"start\":85121}]", "bib_title": "[{\"end\":77038,\"start\":76944},{\"end\":77265,\"start\":77217},{\"end\":77527,\"start\":77428},{\"end\":77852,\"start\":77767},{\"end\":78081,\"start\":78029},{\"end\":78392,\"start\":78355},{\"end\":78595,\"start\":78545},{\"end\":78800,\"start\":78740},{\"end\":79000,\"start\":78955},{\"end\":79197,\"start\":79146},{\"end\":79474,\"start\":79416},{\"end\":80392,\"start\":80313},{\"end\":80649,\"start\":80573},{\"end\":81154,\"start\":81108},{\"end\":81861,\"start\":81786},{\"end\":82105,\"start\":82068},{\"end\":82337,\"start\":82257},{\"end\":82737,\"start\":82692},{\"end\":82912,\"start\":82862},{\"end\":83118,\"start\":83049},{\"end\":83365,\"start\":83294},{\"end\":83562,\"start\":83533},{\"end\":83753,\"start\":83682},{\"end\":83990,\"start\":83937},{\"end\":84155,\"start\":84107},{\"end\":84336,\"start\":84301},{\"end\":84541,\"start\":84473}]", "bib_author": "[{\"end\":77049,\"start\":77040},{\"end\":77278,\"start\":77267},{\"end\":77291,\"start\":77278},{\"end\":77542,\"start\":77529},{\"end\":77867,\"start\":77854},{\"end\":78096,\"start\":78083},{\"end\":78408,\"start\":78394},{\"end\":78419,\"start\":78408},{\"end\":78611,\"start\":78597},{\"end\":78816,\"start\":78802},{\"end\":79016,\"start\":79002},{\"end\":79209,\"start\":79199},{\"end\":79219,\"start\":79209},{\"end\":79230,\"start\":79219},{\"end\":79243,\"start\":79230},{\"end\":79489,\"start\":79476},{\"end\":79495,\"start\":79489},{\"end\":79508,\"start\":79495},{\"end\":79709,\"start\":79699},{\"end\":79728,\"start\":79709},{\"end\":79842,\"start\":79832},{\"end\":79861,\"start\":79842},{\"end\":79967,\"start\":79958},{\"end\":80114,\"start\":80098},{\"end\":80408,\"start\":80394},{\"end\":80412,\"start\":80408},{\"end\":80660,\"start\":80651},{\"end\":80820,\"start\":80807},{\"end\":81167,\"start\":81156},{\"end\":81303,\"start\":81288},{\"end\":81593,\"start\":81584},{\"end\":81876,\"start\":81863},{\"end\":81895,\"start\":81876},{\"end\":82118,\"start\":82107},{\"end\":82131,\"start\":82118},{\"end\":82352,\"start\":82339},{\"end\":82359,\"start\":82352},{\"end\":82513,\"start\":82501},{\"end\":82522,\"start\":82513},{\"end\":82749,\"start\":82739},{\"end\":82924,\"start\":82914},{\"end\":83127,\"start\":83120},{\"end\":83138,\"start\":83127},{\"end\":83382,\"start\":83367},{\"end\":83577,\"start\":83564},{\"end\":83766,\"start\":83755},{\"end\":83779,\"start\":83766},{\"end\":84000,\"start\":83992},{\"end\":84161,\"start\":84157},{\"end\":84178,\"start\":84161},{\"end\":84342,\"start\":84338},{\"end\":84359,\"start\":84342},{\"end\":84547,\"start\":84543},{\"end\":84564,\"start\":84547},{\"end\":84749,\"start\":84734},{\"end\":85142,\"start\":85123},{\"end\":85150,\"start\":85142}]", "bib_venue": "[{\"end\":77576,\"start\":77569},{\"end\":80900,\"start\":80891},{\"end\":81362,\"start\":81353},{\"end\":77068,\"start\":77049},{\"end\":77307,\"start\":77291},{\"end\":77567,\"start\":77542},{\"end\":77879,\"start\":77867},{\"end\":78159,\"start\":78096},{\"end\":78436,\"start\":78419},{\"end\":78628,\"start\":78611},{\"end\":78833,\"start\":78816},{\"end\":79037,\"start\":79016},{\"end\":79265,\"start\":79243},{\"end\":79524,\"start\":79508},{\"end\":79697,\"start\":79661},{\"end\":79956,\"start\":79923},{\"end\":80175,\"start\":80114},{\"end\":80428,\"start\":80412},{\"end\":80676,\"start\":80660},{\"end\":80889,\"start\":80820},{\"end\":81185,\"start\":81167},{\"end\":81351,\"start\":81303},{\"end\":81582,\"start\":81542},{\"end\":81912,\"start\":81895},{\"end\":82147,\"start\":82131},{\"end\":82367,\"start\":82359},{\"end\":82565,\"start\":82522},{\"end\":82763,\"start\":82749},{\"end\":82943,\"start\":82924},{\"end\":83157,\"start\":83138},{\"end\":83399,\"start\":83382},{\"end\":83593,\"start\":83577},{\"end\":83795,\"start\":83779},{\"end\":84010,\"start\":84000},{\"end\":84190,\"start\":84178},{\"end\":84374,\"start\":84359},{\"end\":84583,\"start\":84564},{\"end\":84791,\"start\":84749}]"}}}, "year": 2023, "month": 12, "day": 17}