{"id": 119585388, "updated": "2023-09-27 06:53:23.047", "metadata": {"title": "Conservation Laws of Random Matrix Theory", "authors": "[{\"first\":\"Nicholas\",\"last\":\"Ercolani\",\"middle\":[\"M.\"]}]", "venue": null, "journal": "arXiv: Mathematical Physics", "publication_date": {"year": 2012, "month": null, "day": null}, "abstract": "This paper presents an overview of the derivation and significance of recently derived conservation laws for the matrix moments of Hermitean random matrices with dominant exponential weights that may be either even or odd. This is based on a detailed asymptotic analysis of the partition function for these unitary ensembles and their scaling limits. As a particular application we derive closed form expressions for the coefficients of the genus expansion for the associated free energy in a particular class of dominant even weights. These coefficients are generating functions for enumerating g-maps, related to graphical combinatorics on Riemann surfaces. This generalizes and resolves a 30+ year old conjecture in the physics literature related to quantum gravity.", "fields_of_study": "[\"Physics\",\"Mathematics\"]", "external_ids": {"arxiv": "1203.6123", "mag": "1860407597", "acl": null, "pubmed": null, "pubmedcentral": null, "dblp": null, "doi": null}}, "content": {"source": {"pdf_hash": "4297dbd0b2185a661842637e34c94f418ff02859", "pdf_src": "Arxiv", "pdf_uri": "[\"https://arxiv.org/pdf/1203.6123v1.pdf\"]", "oa_url_match": false, "oa_info": null}, "grobid": {"id": "57fb34b8485effdfdbebd750ce91fdf22d550b74", "type": "plain-text", "url": "s3://ai2-s2-pdf-extraction-prod/parse-results/s2orc_worker/4297dbd0b2185a661842637e34c94f418ff02859.txt", "contents": "\nCONSERVATION LAWS OF RANDOM MATRIX THEORY\n\n\nNicholas M Ercolani \nCONSERVATION LAWS OF RANDOM MATRIX THEORY\n\nThis paper presents an overview of the derivation and significance of recently derived conservation laws for the matrix moments of Hermitean random matrices with dominant exponential weights that may be either even or odd. This is based on a detailed asymptotic analysis of the partition function for these unitary ensembles and their scaling limits. As a particular application we derive closed form expressions for the coefficients of the genus expansion for the associated free energy in a particular class of dominant even weights. These coefficients are generating functions for enumerating g-maps, related to graphical combinatorics on Riemann surfaces. This generalizes and resolves a 30+ year old conjecture in the physics literature related to quantum gravity.\n\nIntroduction\n\nThis paper will present an overview of some recent developments in the application of random matrix analysis to the topological combinatorics of surfaces. Such applications have a long history about which we should say a few words at the outset. The combinatorial objects of interest here are maps. A map is an embedding of a graph into a compact, oriented and connected surface X with the requirement that the complement of the graph in X should be a disjoint union of simply connected open sets. If the genus of X is g, this object is referred to as a g-map. The notion of g-maps was introduced by Tutte and his collaborators in the '60s [37] as part of their investigations of the four color conjecture.\n\nIn the early '80s Bessis, Itzykson and Zuber, a group of physicists studying 't Hooft's diagrammatic approaches to large N expansions in quantum field theory, discovered a profound connection between the problem of enumerating g-maps and random matrix theory [4]. That seminal work was the basis for bringing asymptotic analytical methods into the study of maps and other related combinatorial problems.\n\nSubsequently, in the early '90s, other physicists [11,22] realized that the matrix model diagrammatics described in [4] provide a natural means for discretizing the Einstein-Hilbert action in two dimensions. From that and a formal double scaling limit, they were able to put forward a candidate for so-called 2D Quantum Gravity. This generated a great deal of interest in the emerging field of string theory. We refer to [10] for a systematic review of this activity and to [30] for a description of more recent developments related to topological string theory.\n\nAll of these applications were based on the postulated existence of a 1/n 2 asymptotic expansion of the free energy associated to the random matrix partition function, where n denotes the size of the matrix, as n becomes large. The combinatorial significance of this expansion is that the coefficient of 1/n 2g should be the generating function for the enumeration of g-maps (ordered by the cardinality of the map's vertices). In [14] the existence of this asymptotic expansion and several of its important analytical properties were rigorously established. This analysis was based on a Riemann-Hilbert problem originally introduced by Fokas, Its and Kitaev [20] to study the 2D gravity problem.\n\nThe aim of this paper is to outline how the results of [14] and its sequel [16] have been used to gain new insights into the map enumeration problem. In particular, we will be able to prove and significantly extend a conjecture made in [4] about the closed form structure of the generating functions for map enumeration.\n\nOver time combinatorialists have made novel use of many tools from analysis including contour integrals and differential equations. In this work we also introduce nonlinear partial diferential equations, in particular a hierarchy of conservation laws reminiscent of the shallow water wave equations [38] (see (6.7)). This appears to make contact with the class of differential posets introduced by Stanley [35] (see Remark 4.9).\n\n\nBackground\n\nThe general class of matrix ensembles we analyze has probability measures of the form\ndµ tj = 1 Z (n) (g s ,t j ) exp − 1 g s Tr[V j (M,t j )] dM, where (2.1) V j (λ; t j ) = 1 2 λ 2 + t j j λ j (2.2)\ndefined on the space H n of n × n Hermitean matrices, M , and with g s a positive parameter, referred to as the string coefficient. The normalization factor Z (n) (g s ,t j ), which serves to make µ t a probability measure, is called the partition function of this unitary ensemble. Remark 2.1. In previous treatments, [14,16,12,17], we have used the parameter 1/N instead of g s . This was in keeping with notational usages in some areas of random matrix theory; however, since here we are trying to make a connection to some applications in quatum gravity, we have adopted the notation traditionally used in that context. This also is why we have scaled the time parameter t j by 1/j in this paper.\n\nFor general polynomial weights V it is possible to establish the following fundamental asymptotic expansion [14], [16] of the logarithm of the free energy associated to the partition function. More precisely, those papers consider weights of the form\nV (λ) = 1 2 λ 2 + j =1 t λ . (2.3)\nwith j even. We introduce a renormalized partition function, which we refer to as a tau function representation, τ 2 n,gs ( t ) = Z (n) ( t ) Z (n) (g s ,0) , (2.4) where t = (t 1 ,...t j ) ∈ R j . The principal object of interest is the large n asymptotic expansion of this representation for which one has the result [14,16] logτ 2 n,gs ( t ) = n 2 e 0 (x, t ) + e 1 (x, t ) + 1 n 2 e 2 (x, t ) + ··· + 1 n 2g−2 e g (x, t ) + ... (2.5) as n → ∞ while g s → 0 with x = ng s , called the 't Hooft parameter, held fixed. Moreover, for T = (1 − ,1 + ) × {| t | < δ} ∩ {t j > 0} for some > 0,δ > 0, (i) the expansion is uniformly valid on compact subsets of T ; (ii) e g (x, t ) extends to be complex analytic in T C = (x, t ) ∈ C j+1 |x − 1| < ,| t| < δ ;\n\n(iii) the expansion may be differentiated term by term in (x, t ) with uniform error estimates as in (i)\n\nThe meaning of (i) is that for each g there is a constant, K g , depending only on T and g such that\nlogτ 2 n,gs t − n 2 e 0 (x, t ) − ··· − 1 n 2g−2 e g (x, t ) ≤ K g n 2g\nfor (x, t ) in a compact subset of T . The estimates referred to in (iii) have a similar form with τ 2 n,gs and e j (x, t ) replaced by their mixed derivatives (the same derivatives in each term) and with a possibly different set of constants K g . Remark 2.2. Recently these results were extended to the case where j is odd [17]. In this case one should replace the normalized partiiton function (2.4) by its Szegö representation in terms of eignevalues (3.7).\n\nTo explain the topological significance of the e g (x, t) as generating functions, we begin with a precise definition of the objects they enumerate. A map Σ on a compact, oriented and connected surface X is a pair Σ\n= (K(Σ),[ı]) where • K(Σ) is a connected 1-complex; • [ı] is an isotopical class of inclusions ı : K(Σ) → X; • the complement of K(Σ) in X is a disjoint\n\nunion of open cells (faces);\n\n• the complement of the vertices in K(Σ) is a disjoint union of open segments (edges). When the genus of X is g one refers to the map as a g − map. What [4] effectively showed was that the partial derivatives of e g (1, t) evaluated at t = 0 \"count\" a geometric quotient of a certain class of labelled g-maps.\n\nAs a means to reduce from enumerating these labelled g-maps to enumerating g-maps, it is natural to try taking a geometric quotient by a \"relabelling group\" more properly referred to as a cartographic group [2]. This labelling has two parts; first the vertices of the same valence, have an order labelling 1,...n and second at each vertex one of the edges is distinguished. Given that X is oriented, this second labelling gives a unique ordering of the edges around each vertex. The fact that the coefficients of the free energy expansion (2.5) enumerate this class of labelled g-maps is a consequence of (2.5) (i) which enables one to evaluate a mixed partial derivative of e g in terms of the Gaussian Unitary Ensemble (GUE) where correlation functions of matrix coefficients all reduce to two point functions. (A precise description of this correspondence may be found in [14]).\n\nTo help fix these ideas we consider the case of a j-regular g-map (i.e., every vertex has the same valence, j) of size m (i.e., the map has m vertices) which is the main interest of this paper. The cartographic group in this case is generated by the symmmetric group S m which permutes the vertex labels and m factors of the cyclic group C j , which rotates the distinguished edge at a given vertex in the direction of the holomorphic (counter-clockwise) orientation on X. The order of the cartographic group here is the same as that of the product of its factors which is m!j m . On the other hand the generating function for g-maps in this setting is given by\ne g (t j ) = e g x = 1, t = (0,...,0,t j ) (2.6) = m≥1 1 m!j m (−t j ) m κ (g) j (m) (2.7)\nwhere κ (g) j (m) = the number of labelled j-regular g-maps on m vertices. The factor 1 m!j m perfectly cancels the order of the cartographic group, making this series appear to indeed be the ordinary generating function for pure g-maps. However, for some g-maps the cartographic action may have non-trivial isotropy and this can create an \"over-cancellation\" of the labelling. This happens when a particular relabelling of a given map can be transformed back to the original labelling by a diffeomorphism of the underlying Riemann surface X. In this event the two labellings are indistinguishable and the diffeomorphism induces an automorphism of the underlying map. In addition, the element of the cartographic group giving rise to this situation is an element of the isotropy group of the given map. Hence, as a generating function for the geometric quotient, (2.6) is expressible as\ne g (t j ) = g−maps Σ 1 |Aut(Σ)| (−t j ) m(Σ) (2.8) E g (x,t j ) = e g x, t = (0,...,0,t j ) (2.9) = g−maps Σ 1 |Aut(Σ)| (−t j ) m(Σ) x f (Σ) = x 2−2g e g (x j/2−1 t j )\nwhere m(Σ) = the number of vertices of Σ, f (Σ) = the number of faces of Σ and Aut(Σ) = the automorphism group of the map Σ. We have included the x-dependent form, (2.9), of e g since that will play an important role later on and also to observe that this is in fact a bivariate generating function for enumerating g-maps with a fised number of vertices and faces. Moreover, in this j-regular setting, one sees that the bivariate function is self-similar. This is a direct consequence of Euler's relation:\n2 − 2g = #vertices − #edges + #faces = m(Σ) − j 2 m(Σ) + f (Σ). t m(Σ) j x f (Σ) = x 2−2g (t j x j/2−1 ) m(Σ) . (2.10)\nThe presence of geometric factors such as 1 |Aut(Σ)| is not uncommon in enumerative graph theory, a classical example being that of Erdös-Rényi graphs [23]. In the quantum gravity setting these factors also have a natural interpretation in terms of the discretization of the reduction to conformal structures via a quotient of metrics by the action of the diffeomorphism group. We refer to [10,2] for further details on this attractive set of ideas.\n\nIn [4], e 0 ,e 1 and e 2 were explicitly computed for the case of valence j = 4. We quote, from the same paper, the following conjecture (some notation has been changed to be consistent with ours):\n\n\"It would of course be very interesting to obtain e g (t 4 ) in closed form for any value of g. The method of this paper enabled us to do so up to g = 2, but works in the general case, although it requires an incresing amount of work. We conjecture a general expression of the form\ne g = (1 − z 0 ) 2g−1 (2 − z 0 ) 5(g−1) P (g) (z 0 ), g ≥ 2\nwith P (g) a polynomial in z 0 , the degree of which could be obtained by a careful analysis of the above procedure.\"\n\nHere z 0 = z 0 (t 4 ) is equal, up to a scaling, to the generating function for the Catalan numbers; below it will signify z 0 (t 2ν ) which is similarly related to the generating function for the higher Catalan numbers (4.24). Over the years there have been a number of attempts to systematically address this question by studying the resolvent of the random matrix and associated Schwinger-Dyson equations [1,19]. Our methods take a different approach.\n\nThe main purpose of this paper is to show how this conjecture can be verified and significantly extended. In particular, we will show that for the case of even valence, j = 2ν, Theorem 2.3. For g ≥ 2,\ne g (z 0 ) = C (g) + c (g) 0 (ν) (ν − (ν − 1)z 0 ) 2g−2 + ··· + c (g) 3g−3 (ν) (ν − (ν − 1)z 0 ) 5g−5 (2.11) = (z 0 − 1) r Q 5g−5−r (z 0 ) (ν − (ν − 1)z 0 ) 5g−5 , (2.12) r = max 1, 2g − 1 ν − 1 ,\nfor all ν ≥ 2. The top coefficient and the constant term are respectively given by\nc (g) 3g−3 (ν) = g! (5g − 5)(5g − 3)ν 2 a (g) 3g−1 (ν) = 0, (2.13) C (g) = − 2(2g − 3)! 1 (2g + 2)! − 1 (2g)!12 + (1 − δ 2,g ) (2g − 1)! g−1 k=2 (2 − 2k) 2g−2k+2 (2g − 2k + 2)! C (k) (2.14)\nwhere a (g) 3g−1 (ν) (see Thm 4.8) is proportional to the g th coefficient in the asymptotic expansion at infinity of the ν th equation in the Painlevé I hierarchy [12] and (r) m = r(r − 1)...(r − m + 1). Our methods can be extended to the case of j odd and the derivation of the analogue to Theorem 2.3 is in progress (see section 6).\n\nThe route to getting these results passes through nonlinear PDE, in particular a class of nonlinear evolution equations known as conservation laws which come from studying scaling limits of the recursion operators for orthogonal polynomials whose weights match those of the matrix models.\n\nThis appeal to orthogonal polynomials also motivated the approaches of [4] and [11]. However to give a rigorous and effective treatment to the problem of finding closed form expressions for the coefficients of the asymptotic free energy, (2.5), requires essential use of Riemann-Hilbert analysis on the Riemann Hilbert Problem for orthogonal polynomials that was introduced in [20]. Though we will not review this analysis here, we will state the consequences of it needed for our applications and reference their sources.\n\nIn section 3 we present the necessary background on orthogonal polynomials and introduce the main equations governing their recurrences operators: the difference string equations and the Toda lattice equations. In section 4 we describe how (2.5) can be used to derive and solve (in the case of even valence) the continuum limits of these equations which relates to the nonlinear evolution equations alluded to earlier.\n\nIn section 5 we outline the proof Theorem 2.3 and in section 6 we describe the extension of this program to the case of odd valence and briefly mention what has been accomplished in that case thus far. This will also help to illuminate the full picture behind the idea of conservation laws for random matrices.\n\n\nThe Role of Orthogonal Polynomials and their Asymptotics\n\nLet us recall the classical relation between orthogonal polynomials and the space of square-integrable functions on the real line, R, with respect to exponentially weighted measures. In particular, we want to focus attention on weights that correspond to the random matrix weights, V (λ), (2.2) with j even. (Recently this relation has been extended to the cases of j odd [5,17], with the orthogonal polynomials generalised to the class of so-called non-Hermitean orthogonal polynomials; however, for this exposition we will stick primarily with the even case.) To that end we consider the\nHilbert space H = L 2 R,e −g −1 s V (λ)\nof weighted square integrable functions. This space has a natural polynomial basis, {π n (λ)}, determined by the conditions that π n (λ) = λ n + lower order terms\nπ n (λ)π m (λ)e −g −1 s V (λ) dλ = 0 for n = m.\nFor the construction of this basis and related details we refer the reader to [8].\n\nWith respect to this basis, the operator of multiplication by λ is representable as a semi-infinite tri-diagonal matrix,\nL =       a 0 1 b 2 1 a 1 1 b 2 2 a 2 . . . . . . . . .       . (3.1)\nL is commonly referred as the recursion operator for the orthogonal polynomials and its entries as recursion coefficients. (When V is an even potential, it follows from symmetry that a j = 0 for all j.) We remark that often a basis of orthonormal, rather than monic orthogonal, polynomials is used to make this representation. In that case the analogue of (3.1) is a symmetric tri-diagonal matrix. As long as the coefficients {b n } do not vanish, these two matrix representations can be related through conjugation by a semi-infinite diagonal matrix of the form diag(1,b −1\n1 ,(b 1 b 2 ) −1 ,(b 1 b 2 b 3 ) −1 ,...)\n. Similarly, the operator of differentiation with respect to λ, which is densely defined on H, has a semi-infinite matrix representation, D, that can be expressed in terms of L as\nD = 1 g s L + tL j−1 − (3.2)\nwhere the \"minus\" subscript denotes projection onto the strictly lower part of the matrix. From the canonical (Heisenberg) relation on H, one sees that\n[∂ λ ,λ] = 1,\nwhere here λ in the bracket and 1 on the right hand side are regarded as multiplication operators. With respect to the basis of orthogonal polynomials this may be re-expressed as\nL, L + tL j−1 − = g s I. (3.3)\nThe relations implicit in (3.3) have been referred to as string equations in the physics literature. In fact the relations that one has, row by row, in (3.3) are actually successive differences of consecutive string equations in the usual sense. However, by continuing back to the first row one may recursively de-couple these differences to get the usual equations. To make this distinction clear we will refer to the row by row equations that one has directly from (3.3) as difference string equations. L depends smoothly on the coupling parameter t j in the weight V (λ) (see 2.2). The explicit dependence can be determined from the fact that multiplication by λ commutes with differentiation by t j . This yields our second fundamental relation on the recurrence coefficients,\ng s ∂ ∂t j L = L j − ,L , (3.4)\nwhich is equivalent to the j th equation of the semi-infinite Toda Lattice hierarchy. The Toda equations for j = 1 are\n− g s da n,gs dt 1 = b 2 n+1,gs − b 2 n,gs (3.5) −g s db 2\nn,gs dt 1 = b 2 n,gs (a n,gs − a n−1,gs ).\n\n(3.6)\n\n\nHirota Equations\n\nOne may apply standard methods of orthogonal polynomial theory [36] to deduce the existence of a semi-infinite lower unipotent matrix A such that\nL = A −1 A where =       0 1 0 0 1 0 0 . . . . . . . . .       .\n(For a description of the construction of such a unipotent matrix we refer to Proposition 1 of [13].) This is related to the Hankel matrix\nH =      m 0 m 1 m 2 ... m 1 m 2 m 3 ... m 2 m 3 m 4 ... . . . . . . . . . . . .      , where m k = R λ k e −g −1 s V (λ) dλ\nis the k th moment of the measure, by\nADA † = H D = diag {d 0 ,d 1 ...} with d n = detH n+1 detH n\nwhere H n denotes the n × n principal sub-matrix of H whose determinant may be expressed as (see Szegö's classical text [36]),\ndetH n = n!Ẑ (n) (t 1 ,t 2ν ) Z (n) (t 1 ,t 2ν ) = R ··· R exp −g −2 s g s n m=1 V (λ m ;t 1 , t 2ν )− g 2 s m = log|λ m − λ |      d n λ, (3.7) where V (λ;t 1 , t 2ν+1 ) = 1 2 λ 2 + t 1 λ + t2ν 2ν λ 2ν .\nWe set detH 0 = 1. Remark 3.1. We sometimes need to extend the domain of the tau functions to include other parameters, such as t 1 , as we have done here. Doing this presents no difficulties in the prior constructions.\n\nThe diagonal elements may in fact be expressed as\nd n = τ 2 n+1,gs τ 2 n,gs d n (0) where τ 2 n,gs =Ẑ (n) (t 1 ,t 2ν ) Z (n) (0,0) (3.8) = Z (n) (t 1 ,t 2ν ) Z (n) (0,0) (3.9)\nwhich agrees with the definition of the tau function given in (2.4). The second equality follows by reducing the unitarily invariant matrix integrals in (3.9) to their diagonalizations which yields (3.8) [14]. Tracing through these connections, from L to D, one may derive the fundamental identity relating the random matrix partition function to the recurrence coefficients,\nb 2 n,gs = d n d n−1 = τ 2 n+1,gs τ 2 n−1,gs τ 4 n,gs b 2 n,gs (0) (3.10)\nwhich is the basis for our analysis of continuum limits in the next section. (Note that b 2 0,gs (0) = 0 and therefore b 2 0,gs ≡ 0.) We will also need a differential version of this relation:\nLemma 3.2. (Hirota) a n,gs = −g s ∂ ∂t 1 log τ 2 n+1,gs τ 2 n,gs = −g s ∂ ∂t 1 log Z (n+1) (t 1 ,t 2ν ) Z (n) (t 1 ,t 2ν ) (3.11) b 2 n,gs = g 2 s ∂ 2 ∂t 2 1 logτ 2 n,gs = g 2 s ∂ 2 ∂t 2 1 logZ (n) (t 1 ,t 2ν ),(3.12)\n(A derivation of this lemma may be found in [3].) It follows from (3.12) and (2.5) that\nCorollary 3.3. b 2 n,gs (x;t 2ν ) = x 2 z 0 (x;t 2ν ) + ··· + 1 n 2g z g (x;t 2ν ) + ... (3.13) z g (x;t 2ν ) = d 2 dt 2 1 e g (x;t 1 ,t 2ν )| t1=0 (3.14)\nis a uniformly valid asymptotic asymptotic expansion in the sense of (2.5 iii).\n\n\nPath Weights and Recurrence Coefficients\n\nIn order to effectively utilize the relations (3.3, 3.4) it will be essential to keep track of how the matrix entries of powers of the recurrence operator, L j , depend on the original recurrence coefficients. That is best done via the combinatorics of weighted walks on the index lattice of the orthogonal polynomials. For the case of even potentials, the relevant walks are Dyck paths which are walks, P , on Z which, at each step, can either increase by 1 or decrease by 1. Set P j (m 1 ,m 2 ) = the set of all Dyck paths of length j from m 1 to m 2 .\n\n(3.15)\n\nThen step weights, path weights and the (m 1 ,m 2 )-entry of L j are, respectively, given by ω(p) = 1 if the p th step moves from n to n + 1 on the lattice b 2 n if the p th step moves from n to n − 1\nω(P ) = steps p∈P ω(p) L j m1,m2 = P ∈P j (m1,m2) ω(P ). (3.16)\n\nDyck Representation of the Difference String equations\n\nThe difference string equations are given (for the 2ν-valent case) by (3.3):\nL, L + tL 2ν−1 − = g s I . (3.17)\nBy parity considerations, when the potential V is even, the only non-tautological equations come from the diagonal entries of (3.18): the (n,n) entry gives\ng s = L + tL 2ν−1 n+1,n − L + tL 2ν−1 n,n−1 . (3.18)\nIn terms of Dyck paths this becomes\nx n = b 2 n+1 − b 2 n + t P ∈P 2ν−1 (1,0) ν m=1 b 2 n+ m(P )+1 − ν m=1 b 2 n+ m(P ) (3.19)\nwhere m (P ) denotes the lattice location of the path P after the m th downstep and we have used the relation x = ng s on the left hand side of the equation.\n\nWe illustrate this more concretely for the case of j = 2ν = 4. Referring to (3.15), the relevant path classes here are P 1 (1,0) = a descent by one step Note that the structure of the path classes does not actually depend upon n. This is a reflection of the underlying spatial homogeneity of these equations. Thus, for the purpose of describing the path classes, one can translate n to 0. Now applying (3.16) the difference string equation becomes, for n > 0,\n1 n = b 2 n+1 − b 2 n + t b 2 n+1 b 2 n + b 2 n+1 + b 2 n+2 − b 2 n b 2 n−1 + b 2 n + b 2 n+1\nwhere, for this example, we have set the parameter x equal to 1.\n\n\nDyck Representation of the Toda equations\n\nWe now pass to a more explicit form of of the Toda equations (3.4) in the case j = 2ν:\n− x n db 2 n dt 2ν = L 2ν n+1,n−1 − L 2ν n,n−2 = P ∈P 2ν (2,0) ν+1 m=1 b 2 n+ m(P )+1 − ν+1 m=1 b 2 n+ m(P ) .\nOnce agian we illustrate these equations in the tetravalent case (ν = 2). The relevant path class is: P 4 (2,0) = paths with exactly one upstep and three downsteps.\n\nApplying (3.16), the tetravalent Toda equations become\n− 1 n db 2 n dt =b 2 n+1 b 2 n b 2 n−1 + b 2 n + b 2 n+1 + b 2 n+2 − b 2 n b 2 n−1 b 2 n−2 + b 2 n−1 + b 2 n + b 2 n+1 (3.20)\nwhere we have again used the relation x = ng s and then set the parameter x = 1.\n\n\nContinuum Limits\n\nThe continuum limits of the difference string and Toda equations will be described in terms of certain scalings of the independent variables, both discrete and continuous. As indicated at the outset, the positive parameter g s sets the scale for the potential in the random matrix partition function and is taken to be small. The discrete variable n labels the lattice position on Z ≥0 that marks, for instance, the n th orthogonal polynomial and recurrence coefficients. We also always take n to be large and in fact to be of the same order as 1 gs ; i.e., as n and g s tend to ∞ and 0 respectively, they do so in such a way that their product\nx . = g s n (4.1)\nremains fixed at a value close to 1.\n\nIn addition to the global or absolute lattice variable n, we also introduce a local or relative lattice variable denoted by k. It varies over integers but will always be taken to be small in comparison to n and independent of n. The Dyck lattice paths naturally introduce the composite discrete variable n + k into the formulation of the difference string and Toda equations which we think of as a small discrete variation around a large value of n. The spatial homogeneity of those equations manifests itself in their all having the same form, independent of what n is, while k in those equations varies over {−ν − 1,...,−1,0,1,...,ν + 1}, the bandwidth of the (2ν) th Toda/Difference String equations. Taking ν + 1 << n will insure the necessary separation of scales between k and n. We define\nw . = (n + k)g s (4.2) = x + g s k = x 1 + k n . (4.3)\nas a spatial variation close to x which will serve as a continuous analogue of the lattice location along a Dyck path relative to the starting location of the path. We also introduce the self-similar scalings:\ns 1 . = x − 1 2 t 1 (4.4) s 2ν . = x ν−1 t 2ν 2ν (4.5)\nthat are natural given (2.10). In terms of these scalings, (3.13) may be rewritten [16] as\nb 2 n,gs (s 2ν ) = x z 0 (s 2ν ) + ··· + 1 n 2g z g (s 2ν ) + ... (4.6) z g (s 2ν ) = d 2 ds 2 1 e g (s 1 ,s 2ν )| s1=0 (4.7) (4.8)\nand, by [12] App. A,\nb 2 n+k,gs (s 2ν ) = x f 0 (s 2ν ,w) + ··· + 1 n 2g f g (s 2ν ,w) + ... (4.9) f g (s 2ν ,w) = w 1−2g z g (s 2ν w ν−1 ). (4.10)\nRemark 4.1. We mention here that the variables s j as defined above differ slightly from their usage in related works [16,12] where s j = −α j t j for appropriate parameters α j > 0. We also introduce a shorthand notation to denote the expansion of the coefficients of f (s 1 ,s 2ν+1 ,w) around w = x.\nDefinition 4.2. For w = x + g s k, f (s 1 ,s 2ν ,w) = ∞ j=0 f w (j) | w=x j! kx n j (4.11)\nwhere the subscript w (j) denotes the operation of taking the j th derivative with respect to w of each coefficient of f :\nf w (j) = g≥0 ∂ j ∂w j f g (s 1 ,s 2ν ,w) 1 n 2g\nAs valid asymptotic expansions these representations denote the asymptotic series whose successive terms are gotten by collecting all terms with a common power of 1/n in (4.11).\n\nIn what follows we will frequently abuse notation and drop the evaluation at w = x. In particular, we will write\nb 2 n+k,gs = ∞ j=0 f w (j) j! (g s k) j = ∞ j=0 1 j! g≥0 ∂ j ∂w j f g (s 2ν ,w) 1 n 2g (g s k) j (4.12)\nIn doing this these series must now be regarded as formal but whose orders are still defined by collecting all terms in 1/n and g s of a common order. (Recall that g s ∼ 1 n so that n −α g β s = O(n −(α+β) )). They will be substituted into the difference string and the Toda equations to derive the respective continuum equations. At any point in this process, if one evaluates these expressions at w = x and g s = x n one may recover valid asymptotic expansions in which the a n+k,gs and b 2 n+k,gs have their original significance as valid asymptotic expansions of the recursion coefficients.\n\n\nThe Continuum Limit of the Toda equations\n\nWe are now in a position to study the Toda lattice equations (3.20) expanded on the formal asymptotic series (4.12):\n− 1 n d ds f (s,w) = P ∈P 2ν (1,−1)   ν+1 m=1 ∞ j=0 f w (j) j! (g s ( m (P ) + 1)) j − ν+1 m=1 ∞ j=0 f w (j) j! (g s m (P )) j   .\nFrom now on we will take s 1 = 0, since its role in determining the structure of the asymptotic expansions of the b n+k is now completed, and set s 2ν = s. Collecting terms in these equations order by order in orders of 1/n we will have a hierarchy of equations that, in principle, allows one to recursively determine the coefficients of (4.6). We will refer to this hierarchy as the Continuum Toda equations. (Note that one has such a hierarchy for each value of ν.) Of course this is a standard procedure in perturbation theory. The equations we will derive are pdes in the form of evolution equations in which w, now regarded as a continuous variable, is the independent spatial variable and s 2ν is the temporal variable. One must still determine, at each level of the hierarchy, which solution of the ode is the one that corresponds to the expressions given for f g in (4.10). This amounts to a kind of solvability condition. This process was carried out fully in [16] and [12]. We will now state the results of that analysis. Theorem 4.3. [16] The continuum limit, to all orders, of the Toda Lattice equations as n → ∞ is given by the following infinite order partial differential equation for f (s,w):\ndf ds = F (ν) (g s ;f,f w ,...,f w (j) ,...) . = g≥0 g 2g s F (ν) g (f,f w ,f w (2) ,··· ,f w (2g+1) ) = c ν f ν f w + g 2 s F (ν) 1 (f,f w ,f ww ,f www ) + ··· (4.13)\nfor (s,w) near (0,1) and initial data given by f (0,w) = w.\n\n(4.14) (In this we ignore, for now, the powers of 1/n that are internal to the asymptotic series f and its w-derivatives.) The other type of partition relates to how the Dyck paths enter our equations. We have already seen that a Dyck path is completely determined by specifying when its downsteps occur. The Toda equations depend explicitly on where these downsteps (the m (P ) appearing in the equations as stated at the start of this subsection). However these two specifications can be related and the downstep times are encoded in terms of a partition that measures deviation of the path from a standard zig-zag path. The following proposition gives an explicit closed form expression for the coefficients d \nF (ν) g = λ:|λ|=2g+1 (λ)≤ν+1 d (ν,g) λ j r j (λ)! f ν− (λ)+1 j f w (j) j! rj (λ) (4.15) where λ = (λ 1 ,λ 2 ,...) is a partition, with λ 1 ≥ λ 2 ≥ λ 3 ≥ ···, of 2g + 1; r j (λ) = #{λ i |λ i = j}; (λ) = j r j (λ) isd (ν,g) λ = (ν + 1,ν,...,2,1) ⊆ µ ⊆ (2ν,2ν − 1,...,ν) µ ∈ R 2 m λ (µ 1 − η 1 ,...,µ ν+1 − η ν+1 )\nwhere R is the set of restricted partitions (meaning that µ 1 > µ 2 > ··· > µ ν+1 ), (η 1 ,...,η ν+1 ) = (2ν,2ν − 2,...,2,0), and m λ (x 1 ,...,x ν+1 ) is the monomial symmetric polynomial associated to λ [29]. The relation of inclusion between partitions, ρ ⊆ µ means that µ j ≥ ρ j for all j.\n\nThe right panel of Figure 4.1 exemplifies, in the case when ν = 4, a geometric realization of the partitions µ being summed over in the above formula. Such a partition corresponds to a zig-zag path contained in the ν × ν + 1 rectangle which starts at the leftmost corner with the 0 th step being a up-step and terminates at the rightmost corner with the (2ν) th step. The red path corresponds to the distinguished partition η which records the downsteps at times 2ν,2ν − 2,...,0 so that in this case the initial (0 th ) step is a downstep. The green path illustrates a typical µ which, in this case, takes downsteps at times (7,6,5,3,2). Given such a partition-path, one may project the initial point of each of its downsteps to the horizontal axis as indicated in the figure for the red and green paths. Then µ i − η i equals the signed separation between the i th green point and the i th red point, reading from right to left. The symmetric polynomial m λ then gets evaluated at these separation values in the above formula for d (ν,g) λ . This description could also have been formulated in terms of the border strips associated to the skew tableaux µ/(ν + 1,ν,...,2,1) but we will not elaborate on that here. One is now in a position to deduce the form of the Toda hierarchy. This is done by setting x = 1 so that g s = 1/n. One then collects all terms of order n −2g in the resulting expansion of (4.13) and this will be a partial differential equation in s and w that we refer to as the g th equation in the continuum Toda hierarchy.\n\nAt leading order in the hierarchy one observes that, for general ν, the continuum Toda equation is an inviscid Burgers equation [38] \nd ds f 0 = − c ν ν + 1 ∂ w (f 0 ) ν+1 (4.16)\nwith initial data f 0 = w. A solution exists and is unique for sufficiently small values of s. It may be explicitly calculated by the method of characteristics, also known as the hodograph method in the version we now present. Consider the (hodograph) relation among the independent variables (s,w,f 0 ), Proof. The annihilator of the differential of (4.17)\nw = f 0 + c ν sf ν 0 .\n1 + νc ν sf ν−1 0 df 0 − dw + c ν f ν 0 ds is a two-dimensional distribution locally on the space (s,w,f 0 ). An initial curve over the w-axis (parametrized as the graph of a function f 0 (w)), transverse to the locus where 1 + νc ν sf ν−1 0 = 0 locally determines a unique integral surface foliated by the integral curves of the vector field of the characteristic vector field When ν = 2, ζ j is the j th Catalan number. For general ν these are the higher Catalan numbers which play a role in a wide variety of enumerative combinatorial problems.\ndf 0 ds = 0 (4.18) dw ds = c ν f ν 0 (4.19) f 0 (0,w) = f 0 (w).\n\nContinuum Limits of the Difference String Equations\n\nThe Continuum Difference String hierarchies may be derived from the difference string equations (3.19) in a manner completely analogous to what was done with the Toda equations in the previous subsection.\n\nExpanding (3.19) on the asymptotic series (4.12) we arrive at the following asymptotic equations.\n1 n = ∞ j=1 f w (j) j! 1 n j + 2νs P ∈P 2ν−1 (0,−1)   ν m=1 ∞ j=0 f w (j) j! m (P ) + 1 n j − ν m=1 ∞ j=0 f w (j) j! m (P ) n j   .\nThe equations at leading order, O(n −1 ), are\n1 = ∂ w f 0 + 2νs P ∈P 2ν−1 (1,0) νf ν−1 0 ∂ w f 0 = ∂ w f 0 + 2ν 2ν − 1 ν sνf ν−1 0 ∂ w f 0 or, equivalently, ∂ w (w − f 0 − c ν sf ν 0 ) = 0 (4.25)\nwhich one directly recognizes as the spatial derivative of the hodograph solution (4.17).\n\nEvaluating that solution at w = 1 yields\nc ν sz ν 0 + z 0 − 1 = 0 (4.26)\nwhich is the functional equation for the generating function of the ν th higher Catalan numbers, mentioned in the previous subsection.\n\nThe terms of the equations at O(n −2g−1 ) can be computed directly and are found to have the form\n∂ w f g + c ν sνf ν−1 0 f g + 2s        c ν ∂ w 0 ≤ k j < g k 1 + ··· + k ν = g f k1 ···f kν        (4.27) +∂ w g−1 k=0 f kw (2g−2k) (2g − 2k + 1)! + 2νs F (ν−1) 1 [2g − 2] + F (ν−1) 2 [2g − 4] + ··· + F (ν−1) g [0] = 0, where F (ν−1) g [2m] denotes the coefficient of n −2m in F (ν−1) g = λ:|λ|=2g+1 (λ)≤ν δ (ν−1,g) λ j r j (λ)! f ν− (λ) j f w (j) j! rj (λ) ; (4.28) δ (ν−1,g) λ = (ν,...,2,1) ⊆ µ ⊆ (2ν − 1,...,ν) µ ∈ R 2 m λ (µ 1 −η 1 ,...,µ ν −η ν ) (η 1 ,...,η ν ) = (2ν − 1,2ν − 3,...,1)\nIn fact this equation is also w-exact! To see this we introduce indeterminates x i and define\nf (i) w (j) (s,w) = f w (j) (s,x i w).\n(4.29)\n\nWe also recall that the monomial symmetric function associated to the partition λ is given by\nm λ (x 1 ,...,x ν ) = x λ1 1 ···x λν ν + ... (4.30)\nwhere +... on the right hand side denotes adding the (minimal) number of terms which are gotten by permuting the variables x i in the first term such that the resulting polynomial is symmetric with respect to S ν . Finally, define\nF (ν−1) g = 2 2g + 1 (4.31) × (ν,...,2,1) ⊆ µ ⊆ (2ν − 1,...,ν − 1) µ ∈ R |λ| = 2g (λ) ≤ ν 1 j r j (λ)! σ∈Sν   ν i=1 f (σ(i)) w (λ σ(i) ) λ σ(i) !   x=µ−η .\nThe following proposition shows that the O n 2k−2g terms ofF\n(ν−1) k\nare an antiderivative for the terms F (4.27). Proposition 4.7.\n(ν−1) k [2g − 2k] appearing inF (ν−1) g = ∂ w F (ν−1) g\nProof. By symmetry under the action of the symmetric group, it will suffice to check this identity for the single monomial term corresponding to x λ1 1 ··· ,x λν ν . We directly calculate\n∂ w ν i=1 f (i) w (λ i ) λ i ! = ν i =1 λ i + 1   i =i f (i) w (λ i ) λ i !   f (i ) w (λ i +1) λ i + 1 ! = ν i =1 λ i + 1   i =i xλ i i f w (λ i ) λ i !   xλ i +1 i f w (λ i +1) λ i + 1 !\nwhere in the second line we have made changes of variables replacing x i w by w. Using this we observe that the inner summands of ∂ w F (ν−1) g have the form\n|λ| = 2g (λ) ≤ ν ∂ w j r j (λ)! ν i=1 f (i) w (λ i ) λ i ! = |λ| = 2g (λ) ≤ ν 1 j r j (λ)! ν i =1 λ i + 1   i =i f (i) w (λ i ) λ i !   f (i ) w (λ i +1) λ i + 1 ! = |λ| = 2g + 1 (λ) ≤ ν + 1 1 j r j (λ)! j≥1 jr j (λ)x λ1 1 ··· ,x λν ν ν i=1 f w (λ i ) λ i ! = (2g + 1) |λ| = 2g + 1 (λ) ≤ ν + 1 1 j r j (λ)! x λ1 1 ··· ,x λν ν j≥1 f w (j) j! rj (λ)\n.\n\nIn the second line the two inner summations of the first line have been rewritten in terms of clusters of partitions adjacent to a given partition of size 2g + 1. To get the last line we use the fact that j≥1 jr j (λ) = |λ| = 2g + 1. The proposition now follows from this observation, (4.31) and (4.28).\n\nAs a consequence of this result one sees that the continuum difference string equation is directly integrable:\nf g = −2s 1 + c ν sνf ν−1 0                     c ν 0 ≤ k j < g k 1 + ··· + k ν = g f k1 ···f kν        + ν F (ν−1) 1 [2g − 2] + F (ν−1) 2 [2g − 4] + ··· + F (ν−1) g [0] + 1 2s g−1 k=0 f kw (2g−2k) (2g − 2k + 1)! .\nSetting w = 1 and applying (4.26) to eliminate s this reduces to\nz g = 2z 0 (z 0 − 1) (ν − (ν − 1)z 0 )                     0 ≤ k j < g k 1 + ··· + k ν = g z k1 z 0 ··· z kν z 0        + 1 2(1 − z 0 ) g−1 k=0 f kw (2g−2k) | w=1 (2g − 2k + 1)! + ν c ν z ν 0 F (ν−1) 1 [2g − 2] + F (ν−1) 2 [2g − 4] + ··· + F (ν−1) g [0] w=1 .\nIt is immediate from this representation that z g is a rational function of z 0 . Apriori this anti-derivative should also include a constant term (in w; it could depend on s). This would lead to a term of the form c(s)/(ν − (ν − 1)z 0 ). However, in [12] it is shown, by an independent argument, that the pole order in z 0 at ν/(ν − 1) is always greater than one. Hence the constant of integration must be zero. With further effort this can be refined to \nz g (z 0 ) = z 0 (z 0 − 1)P 3g−2 (z 0 ) (ν − (ν − 1)z 0 ) 5g−1 (4.32) = z 0 a (g) 0 (ν) (ν − (ν − 1)z 0 ) 2g + a (g) 1 (ν) (ν − (ν − 1)z 0 ) 2g+1 + ··· + a (g) 3g−1 (ν) (ν − (ν − 1)z 0 ) 5g−1 ,\nwhere P 3g−2 is a polynomial of degree 3g − 2 in z 0 whose coefficients are rational functions of ν over the rational numbers Q and a (g) 3g−1 (ν) = 0.\n\n\nRemark 4.9.\n\nA key element in the proof of Proposition 4.7 is the observation that differentiation with respect to w adjusts the multinomial labelling of partial derivatives in the expansion according to the edges of the Hasse-Young graph (Fig 4.1). This graph describes the adjacency relations between Young diagrams of differing sizes. The edges describe which partitions of size 2g + 1 are covered by a given partition of size 2g. Conversely it describes which partitions of size 2g cover a partition of size 2g + 1 which in the setting described here acts as an anti-differentiation operator. This kind of structure was called a differential poset by Stanley and systematically examined in [35].\n\n\nDetermining e g\n\nRecalling the basic identity (3.10)\nb 2 n = τ 2 n+1 τ 2 n−1 τ 4 n b 2 n (0),(5.1)\nwe have, by taking logarithms,\nlogτ 2 n+1 − 2logτ 2 n + logτ 2 n−1 = log(b 2 n ) − log(b 2 n )(0),(5.2)\nwhere the initial value b 2 n (0) = x is given by the recursion relations of the Hermite polynomials. As in [16], we can use formula (5.2) to recursively determine e g in terms of solutions to the continuum equations. We use the asymptotic expansion of b 2 n which has the form (4.6):\nb 2 n = x ∞ g=0 z g (s)n −2g ,\nNote that the left hand side of equation (5.2) has the form of a centered second difference, ∆ 1 τ 2 n,n − ∆ −1 τ 2 n.n . It follows [16] that this expression has an expansion for large n involving only even derivatives of the spatial variable w. We have, at order n −2g ,\n∂ 2 ∂w 2 E g (s,w) = − g =1 2 (2 + 2)! ∂ 2 +2 ∂w 2 +2 E g− (s,w) (5.3) + the n −2g terms of log ∞ m=0 1 n 2m f m (s)\nwhere E h (s,w) = w 2−2h e h (w ν−1 s). In [12] it was shown that e g is rational in z 0 with poles located only at z 0 = ν ν−1 . However we will now prove the more refined result stated in Theorem 2.3.\n\nThe proof of this result is by induction on g. (The base case of g = 2 is established by direct calculation [16].) We assume that (2.11) holds for all k < g. We state here, without proof, some straightforward lemmas and propositions describing the derivatives of (2.11) (details may be found in [12] where similar lemmas are proved for the z g ). Set E k (w,s) = w 2−2k e k (w ν−1 s)\nLemma 5.1. (E k ) w (p) (s,w) = p j=0 (ν − 1) j Q (p,k) j (ν)w 2−2k+(ν−1)j−p s j e (j) k where e (j) k = d j e k /ds j ;s = sw ν−1 Q (p,k) j (ν) = Q (p−1,k) j−1 (ν) + {(ν − 1)j − (2k − 3 + p)}Q (p−1,k) j (ν) 0 < j < p Q (p,k) 0 (ν) = (2 − 2k) p p > 0 Q (p,k) p (ν) = 1 Q (p,k) j (ν) = 0 j > p, j < 0.\nLemma 5.2. For 1 < k < g and j > 0, e (j)\nk = (−1) j c j ν z jν+1 0 3k−4+j =0 c (k,j) (ν) (ν − (ν − 1)z 0 ) 2k+ +j−1 c (k,j) (ν) = [(j − 1)ν − (2k + + (j − 3))]c k,j−1 (ν) + ν(2k + + (j − 3))c k,j−1 −1 (ν) c (k,j) (ν) = 0 < 0, ≥ 3k − 3 + j c (k,0) (ν) = c (k) (ν).\nLemma 5.3. For 1 < k < g and j > 0\ns j e (j) k = z 0 (ν − 1) j j r=0 3k−4+j+r m=r (−1) j−r j r c (k,j) m−r (ν − (ν − 1)z 0 ) 2k+m−1\nwhere m = + r.\n\nProposition 5.1. For 1 < k < g and p > 0\n(E k ) w (p) (s,1) = (2 − 2k) p C (k) + z 0 3k+2p−4 m=0 p j=0 Q (p,k) j (ν) m r=0 (−1) j−r j r c (k,j) m−r (ν) (ν − (ν − 1)z 0 ) 2k+m−1 .\nBut in fact, by the following vanishing lemma for m = 0,1,...,p − 1, the minimal pole order of the expansion in Proposition 5.1 is ≥ 2k − 2 + p. In particular the minimal pole orders coming from terms involving E k on the right-hand side of (5.3) are all greater than 2k − 2 + (2g + 2 − 2k) = 2g.\nProposition 5.2. The n −2g terms of log ∞ m=0 1 n 2m f m (s) w=1 = |λ|=g g! j≥1 r j (λ)! j≥1 z j z 0 rj (λ) = |λ|=g g! j≥1 r j (λ)! j≥1 a (j) 0 (ν) (ν − (ν − 1)z 0 ) 2j + ··· + a (j) 3j−1 (ν) (ν − (ν − 1)z 0 ) 5j−1 rj (λ)\nby (4.32). This result shows that the minimal pole order coming from the log terms in (5.3) is once again greater than j≥1 2jr j = 2g.\n\nThe preceding lemmas and propositions provide explicit Laurent expansions (in\n\n\nProof. (of Theorem 2.3) In [12] (Theorem 1.3) it was shown that\ne g (z 0 ) = (z 0 − 1)q d(g) (z 0 ) (ν − (ν − 1)z 0 ) o(g) (5.7)\nwhere q d(g) (z 0 ) denotes a polynomial of degree d(g) in z 0 . We first want to determine the relation between this degree and the pole order o(g). To this end we observe from Propositions 5.1, 5.2, 5.3, and 5.4 that the right hand side of (5.3), evaluated at w = 1, is a rational function in z 0 which approaches a finite constant value as z 0 → ∞. From the form of the left hand side of (5.3) evaluated at w = 1 one also sees that its asymptotic order (as z 0 → ∞) is the same as that of e g . Hence, d(g) = o(g) − 1 and this shows that (2.11) is valid up to the determination of the minimal and maximal pole orders at z 0 = ν/(ν − 1). In the preceding lemmas and proposiitons we have seen that, for all terms on the right hand side of (5.3), the minimal pole order is ≥ 2g. Furthermore, from these same representations together with Proposition 3.1(iii) of [12] one sees that, with the possible exception of the genus 0 terms in (5.6), the maximal pole order of the terms on the right hand side of (5.3) is 5g − 1. The apparent maximal pole order in (5.6) is 4g + 3 which exceeds the stated bound when g = 2,3. This maximal order comes from terms containing the factor f 0w (2g+2) which are, specifically,\n1 2 f 0w (2g+2) f 0 − (2ν + 1)(ν − 1) 2ν(ν + 1) f 0w (2g+2) + (ν − 1) 2 2ν(ν + 1) (f 0 f 0w (2g+2) ) w=1 = f 0w (2g+2) 2f 0 | w=1 1 − (2ν + 1)(ν − 1) 2ν(ν + 1) z 0 + (ν − 1) 2 2ν(ν + 1) z 2 0 = f 0w (2g+2) 2f 0 | w=1 O(ν − (ν − 1)z 0 ).\nHence the maximal pole order contributed by the genus 0 terms is, in fact, 4g + 2 which is ≤ 5g − 1 for g > 2 and < 5g − 1 for g > 3. This establishes that, for g > 2, the pole orders on the right hand side of (5.3) are bounded between 2g and 5g − 1. Moreover, for g > 3, the case by case checking of terms on the right hand side of (5.3) that has been carried out in this subsection, shows that the maximal pole order is realized by the term in Proposition 5.2 corresponding to the partition λ of 2g having minimal length (=1); i.e., the partition whose Young diagram is a single row. This implies that the residue of the maximal order pole is g!a (g) 3g−1 (ν) which is non-vanishing by Theorem 4.8. Hence the maximal order pole is realized. Now, given that e g has the form (5.7) with d(g) = o(g) − 1, it follows from direct calculation that ∂ 2 ∂w 2 E g (s,1) raises the minimum pole degree by 2 and the maximum pole degree by 4 with the coefficient at this order given by (2.13). This establishes (2.11) for g > 3. The cases of g = 2,3 may be established separately by direct calculation (see, for example, section 1.4.2 of [12]).\n\nTo establish (2.14) first note that by Euler's relation, 2 − 2g = m − νm + F for a g-map where m is the number of (2ν-valent) vertices and F is the number of faces. Since F ≥ 1, one immediately sees that the number of vertices of such a map must satisfy the inequality\nm ≥ 2g − 1 ν − 1 .\nIt follows that e (j) g (s = 0) = 0 for j ≤ r = max 1, 2g−1 ν−1 . (e g must vanish at least simply at s = 0 since since τ 2 n (s = 0) ≡ 1.) Via Cauchy's theorem these conditions may be reexpressed as\n0 = 1 2πi s∼0 e g (s) s j+1 ds = −1 2πi z∼1 z νj−1 q 5g−6 (z) (ν − (ν − 1)z) 5g−6 (z − 1) j dz\nfor j ≤ r where in the second line we have rewritten e g as a rational function of z (5.7) and employed the change of variables ds\ndz = − ν−(ν−1)z z ν+1\nwhich may be deduced from the string equation (4.26). This yields a contour integral in z centerd at 1. Now one can see that these vanishing conditions are satisfied if and only if q (j) 5g−6 (z = 1) = 0 for j ≤ r which in turn proves (2.14).\n\nFinally we turn to the determination of the constant C (g) . By Proposition 5.2, contributions to the constant term of e g come only from the first sum on the right hand side of (5.3). The parts of this coming from g = 0 and g = 1 are, by Propositions 5.4 and 5.3 respectively, −2 (2g−1)! (2g+2)! and 2 (2g−1)! (2g)! 1 12 . At higher genus, k < g, the contribution to the constant term is determined by Lemma 5.1 to be −2\n(2−2k) 2g−2k+2 (2g−2k+2)! C (k) . Hence, by (5.3) we have (2 − 2g)(1 − 2g)C (g) = −2 (2g − 1)! (2g + 2)! + 2 (2g − 1)! (2g)! 1 12 − 2 g−1 k=2 (2 − 2k) 2g−2k+2 (2g − 2k + 2)! C (k) ,\nfrom which (2.14) immediately follows.\n\n\nThe Case of Odd Valence\n\nIn the case when j is odd in the weight (2.3) for V , there is clearly a problem in applying the method of orthogonal polynomials as it was outlined in Section 3. Very recently, however, a generalization of the equilibrium measure (which governs the leading order behavior of the free energy associated to (2.1)) was developed and applied to this problem, [5]. It is based on generalizing to a class of complex valued non-Hermitean orthogonal polynomials on a contour in the complex plane other than the real axis. These extensions were motivated by new ideas in approximation theory related to complex Gaussian quadrature of integrals with high order stationary points [7].\n\nBut even when the issue of existence of appropriate orthogonal polynomials has been resolved, there are still a number of significant obstacles to deriving results like Theorem 2.3 that are not present when the valence j is even. For odd valence there is an additional string of recurrence coefficients, the diagonal coefficients a n of L, whose asymptotics needs to be analyzed. This in turn requires that the lattice paths used to define and analyze the Toda and difference string equations must be generalized to the class of Motzkin paths which can have segments where the lattice site remains fixed rather than always taking a step (either up or down) as was the case for Dyck paths.\n\nNevertheless, all these constructions have been carried out in [17] to derive the hierarchies of continuum Toda and difference string equations when the valence j is odd.\n\nThe recurrence coefficients again have asymptotic expansions with continuum representations given by\na n+k,N = h(s 1 ,s 2ν+1 ,w) = x 1/2 g≥0 h g (s 1 ,s 2ν+1 ,w)n −g (6.1) h g (s 1 ,s 2ν+1 ,w) = −w 1−g × 2g 1 + j = g + 1 g 1 ≥ 0,j > 0 1 j! ∂ j+1 ∂s 1 ∂w j w 2−2g1 e g1 (ww) −1/2 s 1 ,(ww) ν−1/2 s 2ν+1 w=1 (6.2)\nThe off-diagonal coefficients have corresponding representations which are much as they were in the even valence case,\nb 2 n+k,N = f (s 1 ,s 2ν+1 ,w) = x g≥0 f g (s 1 ,s 2ν+1 ,w)n −2g (6.3) f g (s 1 ,s 2ν+1 ,w) = w 2−2g ∂ 2 ∂s 2 1 e g (w −1/2 s 1 ,w ν−1/2 s 2ν+1 ). (6.4)\nThe coefficients in these expansions have a self-similar structure given by\nh g (s 1 ,s 2ν+1 ,w) = w 1 2 −g u g (s 1 w −1/2 ,s 2ν+1 w ν− 1 2 ) (6.5) f g (s 1 ,s 2ν+1 ,w) = w 1−2g z g (s 1 w −1/2 ,s 2ν+1 w ν− 1 2 ). (6.6)\nAt leading order the continuum Toda equations are ∂ ∂s\nh 0 f 0 + (2ν + 1) B 11 B 12 f 0 B 12 B 11 ∂ ∂w h 0 f 0 = 0 (6.7)\nand the leading order continuum difference string equations are\ns 0 1 = A 11 A 12 f 0 A 12 A 11 ∂ ∂w h 0 f 0 (6.8)\nwhere the coefficients of the matrix B in (6.7) are specified by\nB 11 = ν µ=1 2ν 2µ − 1,ν − µ,ν − µ + 1 h 2µ−1 0 f ν−µ+1 0 (6.9) B 12 = ν µ=1 2ν 2µ,ν − µ,ν − µ h 2µ 0 f ν−µ 0 ,(6.10)\nand those of the matrix A in (6.8) by\nA 11 = 1 + (2ν + 1)s ν−1 µ=0 2ν 2µ + 1,ν − µ − 1,ν − µ (ν − µ)h 2µ+1 0 f ν−µ−1 0 (6.11) A 12 = (2ν + 1)s ν−1 µ=0 2ν 2µ,ν − µ − 1,ν − µ + 1 (ν − µ + 1)h 2µ 0 f ν−µ−1 0 . (6.12)\nRemark 6.1. The index µ appearing in the trinomial coefficients corresponds to the number of flat steps in the Motzkin paths giving rise to that term. It is straightforward to see that (6.7) may be rewritten in conservation law form as ∂ ∂s\nh 0 f 0 + 1 2 h 2 0 + ∂ ∂w Ψ 1 Ψ 2 + h 0 Ψ 1 = 0 (6.13)\nwhere the coefficients in the flux vector are given by\nΨ 1 = ν µ=0 2ν + 1 2µ,ν − µ,ν − µ + 1\nh 2µ 0 f ν−µ+1 0 (6.14)\nΨ 2 = ν µ=0 2ν + 1 2µ + 1,ν − µ − 1,ν − µ + 1 h 2µ+1 0 f ν−µ+1 0 . (6.15)\nRecently, [18], we have determined that the equations (6.8) are in fact a differentiated form of the generalized hodograph solution of the conservation law (6.13). This hodograph solution is given by\nΦ 1 . = h 0 + (2ν + 1)sB 12 = 0 (6.16) Φ 2 . = f 0 + (2ν + 1)sB 11 = w. (6.17)\nAnalogous to what was done in Theorem 2.3 we expect to determine closed form expressions for all the coefficients in the topological expansion with odd weights. The first few of these, for the trivalent case, are [17] e 0 (t 3 ) = 1 2 log(z 0 ) + 1 12\n(z 0 − 1)(z 2 0 − 6z 0 − 3) (z 0 + 1) , e 1 (t 3 ) = − 1 24 log 3 2 − z 2 0 2 , (6.18) e 2 (t 3 ) = 1 960 (z 2 0 − 1) 3 (4z 4 0 − 93z 2 0 − 261) (z 2 0 − 3) 5 ,\nwhere z 0 is implicitly related to t 3 by the polynomial equation\n1 = z 2 0 − 72t 2 3 z 3 0 . z 0 (t 3 )\nis in fact the generating function for a fractional generalization of the Catalan numbers. Its m th coefficient counts the number of connected, non-crossing symmetric graphs on 2m + 1 equi-distributed vertices on the unit circle [33].\n\n7. Concluding Remarks 7.1. Spectrum Nothing has been said, in this article, about the eigenvalues of the random matrix M although this is at the heart of the Riemann Hilbert analysis underlying all of our results. The essential link comes through the equilibrium measure [14,16], or density of states, for these eigenvalues. When t j = 0 in (2.2), this equilibrium measure reduces to the well-known Wigner semi-circle law. As t j changes this measure deforms; but, for t j satisfying the bounds implicit in (2.5) (i), its support remains a single interval, [α,β]. The edge of the spectrum α(t j ),β(t j ) evolves dynamically with t j . In fact we have determined [18] that α and β are the Riemann invariants of the hyperbolic system (6.7). In the case of even valence these invariants collapse to ±2 √ z 0 where z 0 is the generating function upon which all the e g are built, as described in Theorem 2.3. So the edge of the spectrum is indeed directly related to the genus expansion (2.5).\n\n\nRandom Surfaces\n\nIt follows from Corollary 3.3 and the map-theoretic interpretation of e g given by (2.8) that z g (t j ) is a generating function for enumerating j-regular g-maps with, in addition, two legs. A leg is a univalent vertex; i.e., a vertex with just one adjacent edge, that is connected to some other vertex of the map. In particular z 0 (t) enumerates such maps on the Riemann sphere or what are more commonly referred to as two-legged planar maps. In a remarkable paper, [34], building on prior work of Cori and Vauquelin [6], Schaeffer found a constructive correspondence between two-legged 2ν-regular planar maps and 2ν valent blossom trees. A 2ν valent blossom tree is a rooted 2ν valent tree, with each external vertex taken to be a leaf that is colored either black or white and such that each internal (non-root) vertex is adjacent to exactly ν − 1 black leaves. This gives another interpretation of z 0 (t 2ν ) as the generating function for the enumeration of blossom trees. It seems reasonable to hope that the arithmetic data implicit in the coefficients a (g) m (ν) in Theorem 4.8 (resp. c (g) m (ν) in Theorem 2.3) might provide a means, such as sewing rules, for constructing two-legged 2ν-regular g-maps (resp. pure 2ν-regular g-maps) from blossom trees.\n\nIn another direction Bouttier, Di Francesco and Guitter [9] have studied the combinatorics of geodesic distance for planar maps. They define the geodesic distance of a two-legged graph to be the minimum number of edges crossed by a continuous path between the two legs and study r d (t 2ν ), the generating function for enumerating all two-legged 2ν valent planar maps whose geodesic distance is ≤ d. They find surprising and elegant closed form expressions for the r d (t 2ν ). The statisitcs of planar maps is a natural stepping off point for the study of random surfaces. There has been a lot of recent activity in this direction by Le Gall and his collaborators related to the work of Schaeffer and Bouttier et al. See for example [28].\n\n\nEnumerative Geometry of Moduli Spaces\n\nA different (from matrix models) representation of 2D Quantum Gravity may be given in terms of intersection theory on the moduli space of stable curves (Riemann surfaces), M g,n and from this alternate perspective Witten conjectured that a generating function for the intersection numbers of tautological bundles on M g,n should be \"given by\" a double-scaling limit of the differentiated free energy (3.13) for matrix models. (A precise description of this double-scaling limit may be found in [12].) He further conjectured that this intersection theoretic generating function should, with repect to appropriate choices of parameter vatriables, satisfy the Korteweg-deVries (KdV) equation. Subsequently, Kontsevich [27] was able to outline a proof of Witten's KdV conjecture based on a combinatorial model of intersection theory on M g,n . This model expresses tautological intersections in terms of sums over tri-valent graphs on a genus g Riemann surface. He was then able to recast this sum in terms of a special matrix integral involving cubic weights on which the proof of Witten's KdV conjecture is based. For a readable overview on the above circle of ideas we refer to [32].\n\nHowever, the first Witten conjecture, on relating the intersection-theoretic free energy to the matrix model free energy, (2.5), remains open. With the results described in this paper it may now be possible to determine if, and in precisely what sense, this conjecture might be true and to see if this leads to connections between the KdV equation in the Witten-Kontsevich model and the conservation laws given by (6.7). In addition, given the recent results on matrix models with odd dominant weights, [5,17], it may now be possible to give a rigorous treatment of Kontsevich's matrix integral which, up to now, has been formal.\n\nMore recently there have been other, perhaps more natural, approaches to the proof of Witten's KdV conjecture, [25,31,21], in terms of coverings of the Riemann sphere and Hurwitz numbers for which the generating functions specified in Theorem 2.3 should also have a natural interpetation.\n\n\nAnalytical Deformations and Critical Parameters\n\nIn [12] it was observed that the equilibrium measure (see 7.1) for the weight V , with j = 2ν in (2.2), may be re-expressed as µ Vt (λ) = z 0 µ 0 (λ) + (1 − z 0 )µ ∞ (λ) (7.1) where µ 0 is the equilibrium measure for V = 1/2λ 2 (the semicircle law) and µ ∞ is the equilibrium measure for V = λ 2ν ; i.e., the general measure is a linear combination, over z 0 , of two extremal monomial equilibrium measures. For z 0 ∈ [0,1] (which corresponds to t 2ν ∈ [0,∞]), this combination is convex and (7.1) is indeed a measure with a single interval of support in λ ∈ R. This may be analytically continued to a complex z 0 neighborhood of [0,1] so that (7.1) remains a positive measure along an appropriate connected contour (\"single interval\") in the complex λ-plane. For ν = 2 this continuation may be made up to a boundary curve in the complex z 0 -plane passing through z 0 = 2 (with a corresponding image in the complex t 4 plane). Extension of this to more general values of ν is in progress [15]. The mechanism for carrying out this continuation is to regard (7.1) as a z 0 -parametrized family of holomorphic quadratic differentials. The candidate for the measure's support is then an appropriate bounded real trajectory of the quadratic differential. Outside the boundary curve, the Riemann-Hilbert analysis used in this paper may be analytically deformed and our results extended. The boundary may be regarded as a curve of critical parameters for this deformation. This curve is precisely the locus where the Riemann invariants, that determine the edge of the spectrum (as described in 7.1) exhibit a shock. This scenario is reminiscent of that for the small -limit of the nonlinear Schrödinger equation [24,26] in which the analogue of our boundary curve is the envelope of dispersive shocks. In that setting it is the Zakharov-Shabat inverse scattering problem that shows one how to pass through the dispersive shocks and describe a continuation of measure-valued solutions with so-called multi-gap support. It is our expectation that coupling gravity to an appropriate conformal field theory (to thus arrive at a bona fide string theory) [30] will play a similar role in our setting to determine a unique continuation through the boundary curve of critical parameters to a unique equilibrium measure with multi-cut support. We also hope that this will help bring powerful methods from the study of dispersive limits of nonlinear PDE into the realm of random matrix theory.\n\n\nFig. 3.1. Elements of P 3 (1,0)\n\n\nthe length of λ; and |λ| = i λ i is the size of λ; and d (ν,g) λ are coefficients to be described in the next proposition. By (4.13), d(ν,0) 2 = c ν .The above result effectively reduces the determination of the hierarchy to an enumeration in terms of a pair of partitions. The first class of partitions is fairly straightforward and amounts to keeping track of the partial derivatives that enter into the expressions at a given level. Thus at O(g 2g+1 s ) the terms are products of partial derivatives of various orders (the parts) which must add up to 2g + 1. These terms correspond to the tableaux at the (2g + 1) st level of the Hasse-Young graph shown in the left panel ofFigure 4.1.\n\n\nof both classes of partitions. Proposition 4.4. [12] (App. A.3)\n\nFig. 4 .\n41. left: λ Hasse-Young graph (courtesy D. Eppstein); right: µ partition walks\n\n( 4 . 17 )\n417Lemma 4.5. A local solution of (4.16) is implicitly defined by(4.17).\n\n\nrequires that along an integral curve of the characteristic vector field, f 0 is constant; i.by(4.19)  which is equivalent to(4.16). Using(4.20)  to set f 0 (0,w) = w pins down our solution uniquely. Remark 4.6. We note that the numerical coefficients appearing in these Burgers equations depend only on the total number of Dyck paths in P 2ν (2,0).One finds[16] from (4.17) and the self similar form of f 0 , f 0 (s,w) = wz 0 (sw ν−1\nAcknowledgement. The author wishes to thank MSRI for its hospitality and the organizers for the excellent Fall 2010 program on Random Matrix Theory. Most of the new results described here had their inception during that happy period.z 0 ) for all terms on the right hand side of (5.3) with two exceptions: ∂ 2g ∂w 2g E 1 (s,w) = ∂ 2g ∂w 2g e 1 (w ν−1 s);(5.4)With a small modification (5.4) may be brought in line with Proposition 5.1, Proposition 5.3.12 . All other coefficients are then specified by the corresponding recursions stated in Lemmas 5.1 -5.3 with k set to 1. A variant of the vanishing Lemma 5.4 also holds for (E 1 ) w (p) (s,1): Lemma 5.5. Finally we observe that for p ≥ 3, ∂ p ∂w p E 0 (s,w) is a rational function of f 0 and its w-derivatives, Proposition 5.4.Each line of the above proposition can be established directly by induction starting with the base case for p = 3. It then follows from Proposition 3.1(iii) of[12]that the minimal pole order contributed by (5.5) is ≥ 2g.We are now in a position to outline the\nMatrix Model Calculations Beyond the Spherical Limit. J Ambjorn, L Chekov, C F Kristjansen, Yu Makeenko, Nucl. Phys. B. 404J. Ambjorn, L. Chekov, C.F. Kristjansen, and Yu. Makeenko. Matrix Model Calculations Be- yond the Spherical Limit. Nucl. Phys. B 404, 127-172, 1993\n\n. M Bauer, C Itzykson, Triangulations, Discrete Mathematics. 156M. Bauer and C. Itzykson, Triangulations, Discrete Mathematics, 156, 29-81, 1996.\n\nAsymptotics of the partition function of a random matrix model. P Bleher, A Its, Ann. Inst. Fourier (Grenoble). 55P. Bleher and A. Its. Asymptotics of the partition function of a random matrix model. Ann. Inst. Fourier (Grenoble) 55, 1943-2000, 2005\n\nQuantum field theory techniques in graphical enumeration. D Bessis, C Itzykson, J B Zuber, Advances in Applied Mathematics. 1D. Bessis, C. Itzykson, and J. B. Zuber, Quantum field theory techniques in graphical enumer- ation, Advances in Applied Mathematics, 1 109-157, 1980.\n\nP Bleher, Deaño , arXiv:1011.6338v2Topological Expansion in the Cubic Random Matrix Model. P. Bleher, and Deaño, Topological Expansion in the Cubic Random Matrix Model, arXiv:1011.6338v2, 2010.\n\nPlanar Maps are Well Labeled Trees. R Cori, B Vauquelin, Canadian Journal of Mathematics. 31R. Cori and B. Vauquelin, Planar Maps are Well Labeled Trees, Canadian Journal of Mathe- matics, 31, 1023-1042, 1981.\n\nAsymptotic zero distribution of complex orthogonal polynomials associated with Gaussian quadrature. A Deaño, D Huybrechts, A B J Kuijlaars, J. Approx. Theory. 162A. Deaño, D. Huybrechts, and A. B. J. Kuijlaars, Asymptotic zero distribution of complex or- thogonal polynomials associated with Gaussian quadrature, J. Approx. Theory 162, 2202- 2224, 2010.\n\nOrthogonal Polynomials and Random Matrices: A Riemann-Hilbert Approach. P Deift, Courant Lecture Notes in Mathematics. 3P. Deift. Orthogonal Polynomials and Random Matrices: A Riemann-Hilbert Approach. Courant Lecture Notes in Mathematics 3 NYU 1999.\n\n2D Quantum Gravity, Matrix Models and Graph Combinatorics in Applications of Random Matrices in Physics. P , Di Francesco, E. Brezin et alSpringerP. Di Francesco, 2D Quantum Gravity, Matrix Models and Graph Combinatorics in Applica- tions of Random Matrices in Physics, Ed. E. Brezin et al, Springer, 33-88, 2006.\n\nP Di Francesco, P Ginsparg, J Zinn-Justin, 2D Gravity and Random Matrices. 254P. Di Francesco, P. Ginsparg and J. Zinn-Justin, 2D Gravity and Random Matrices, Physics Reports 254, 1 -133, 1995.\n\nStrings in less than one dimension. M Douglas, S Shenker, Nucl. Phys. B. 335M. Douglas and S. Shenker. Strings in less than one dimension, Nucl. Phys. B 335, 635-654, 1990.\n\nCaustics, counting maps and semi-classical asymptotics. N M Ercolani, Nonlinearity. 24N. M. Ercolani, Caustics, counting maps and semi-classical asymptotics, Nonlinearity, 24, 481-526, 2011.\n\nAsymptotics and integrable structures for biorthogonal polynomials associated to a random two-matrix model. N M Ercolani, K D , T.-R Mclaughlin, Physica D. N. M. Ercolani and K. D. T.-R. McLaughlin, Asymptotics and integrable structures for biorthog- onal polynomials associated to a random two-matrix model, Physica D. 152 -153, 232-268, 2001.\n\nAsymptotics of the partition function for random matrices via Riemann Hilbert techniques, and applications to graphical enumeration. N M Ercolani, K D , T.-R Mclaughlin, Int. Math. Res. Not. 14N. M. Ercolani and K. D. T.-R. McLaughlin, Asymptotics of the partition function for random matrices via Riemann Hilbert techniques, and applications to graphical enumeration, Int. Math. Res. Not. 14, 755-820, 2003.\n\nAnalysis Situs for Equilibriium Measures in Random Matrix Theory. N M Ercolani, K D , T.-R Mclaughlin, in preparationN. M. Ercolani and K. D. T.-R. McLaughlin, Analysis Situs for Equilibriium Measures in Random Matrix Theory, in preparation.\n\nRandom matrices, graphical enumeration and the continuum limit of Toda lattices. N M Ercolani, K D , T.-R Mclaughlin, V U Pierce, Commun. Math. Phys. 278N. M. Ercolani, K. D. T.-R. McLaughlin, and V. U. Pierce, Random matrices, graphical enu- meration and the continuum limit of Toda lattices, Commun. Math. Phys., 278, 31-81, 2008.\n\nThe continuum limit of Toda lattices for random matrices with odd weights. N M Ercolani, V U Pierce, Commun. Math. Sci. 10N. M. Ercolani and V. U. Pierce, The continuum limit of Toda lattices for random matrices with odd weights , Commun. Math. Sci., 10, 267-305, 2012.\n\nThe fine structure of the topological expansion for random matrices with odd weights. N M Ercolani, P Waters, in preparationN.M. Ercolani and P. Waters, The fine structure of the topological expansion for random ma- trices with odd weights, in preparation.\n\nB Eynard, arXiv:math-ph/0611087Formal matrix integrals and combinatorics of maps. B. Eynard. Formal matrix integrals and combinatorics of maps. arXiv:math-ph/0611087, 2006.\n\nThe isomonodromy approach to matrix models in 2D quantum gravity. A S Fokas, A R Its, A V Kitaev, Commun. Math. Phys. 147A. S. Fokas, A. R. Its, and A.V. Kitaev, The isomonodromy approach to matrix models in 2D quantum gravity, Commun. Math. Phys. 147, 395-430, 1992.\n\nA short proof of the λg-conjecture without Gromov-Witten theory: Hurwitz theory and the moduli of curves. I P Goulden, D M Jackson, R Vakil, J. Reine Angew. Math. 637I.P. Goulden, D.M. Jackson and R. Vakil, A short proof of the λg-conjecture without Gromov- Witten theory: Hurwitz theory and the moduli of curves, J. Reine Angew. Math. 637 175-191, 2009.\n\nA nonperturbative treatment of two-dimensional quantum gravity. D Gross, A , Nucl. Phys. 340D. Gross and A. Migdal, A nonperturbative treatment of two-dimensional quantum gravity, Nucl. Phys. B340, 333-365, 1990.\n\nThe birth of the giant component. S Janson, D Knuth, T Luczak, B Pittel, Random Structures and Algorithms. 4S. Janson, D. Knuth, T. Luczak and B. Pittel, The birth of the giant component, Random Structures and Algorithms 4, 233-359, 1993.\n\nS Jin, C D Levermore, D W Mclaughlin, Semiclassical limit of the defocusing NLS hierarchy, CPAM. 52S. Jin, C.D. Levermore and D.W. McLaughlin, Semiclassical limit of the defocusing NLS hier- archy, CPAM, 52 613-654, 1999.\n\nAn Algebro-Geometric Proof of Witten's Conjecture. M E Kazarian, S K Lando, J. Amer. Math. Soc. 20M.E. Kazarian and S.K. Lando, An Algebro-Geometric Proof of Witten's Conjecture, J. Amer. Math. Soc., 20 1079 -1089, 2007.\n\nSemiclassical soliton ensembles for the focusing nonlinear Schrödinger equation. S Kamvissis, K D , T.-R Mclaughlin, P D Miller, Annals of Mathematics Studies. 154Princeton University PressS. Kamvissis, K. D. T.-R. McLaughlin and P. D. Miller, Semiclassical soliton ensembles for the focusing nonlinear Schrödinger equation. Annals of Mathematics Studies, 154 Princeton University Press, Princeton, NJ, 2003.\n\nIntersection theory on the moduli space of curves and the Airy function. M Kontsevich, Comm. Math. Phys. 147123M. Kontsevich, Intersection theory on the moduli space of curves and the Airy function, Comm. Math. Phys., 147 123, 1992.\n\nJ.-F. Le Gall, Geodesics in large planar maps and in the Brownian map Acta Mathematica. 205J.-F. Le Gall, Geodesics in large planar maps and in the Brownian map Acta Mathematica, 205, 287-360, 2010.\n\nSymmetric Functions and Hall Polynomials. I G Macdonald, Oxford Math. Monogr. The Clarendon Press2d ed.I. G. Macdonald. Symmetric Functions and Hall Polynomials. 2d ed., Oxford Math. Monogr., The Clarendon Press;\n\nM Mariño, hep-th/0410165Les Houches lectures on matrix models and topological strings. M. Mariño, Les Houches lectures on matrix models and topological strings, hep-th/0410165, 2005.\n\nWeil-Petersson volumes and intersection theory on the moduli space of curves. M Mirzakhani, J. Amer. Math. Soc. 20M. Mirzakhani, Weil-Petersson volumes and intersection theory on the moduli space of curves, J. Amer. Math. Soc., 20 1-23, 2007.\n\nGromov-Witten theory, Hurwitz numbers, and matrix models, I. A Okounkov, R Pandharipande, Proc. Symposia Pure Math. Symposia Pure Math80A. Okounkov and R. Pandharipande, Gromov-Witten theory, Hurwitz numbers, and matrix models, I, Proc. Symposia Pure Math. 80 325-414, 2009.\n\n. V U Pierce, private communicationV. U. Pierce, private communication\n\nBijective census and random generation of Eulerian planar maps. G Schaeffer, Electronic Journal of Combinatorics. 420G. Schaeffer, Bijective census and random generation of Eulerian planar maps, Electronic Journal of Combinatorics, 4 R20, 1997.\n\nR Stanley, Differential Posets. 1R. Stanley, Differential Posets, Journal of the American Mathematical Society, 1, 919-961, 1988.\n\n. G Szegö, Orthogonal Polynomials. 23AMS Colloquium PublicationsG. Szegö, Orthogonal Polynomials, AMS Colloquium Publications, 23, 1939.\n\nOn the enumeration of planar maps. W T Tutte, Bull. Amer. Math. Soc. 74W. T. Tutte, On the enumeration of planar maps, Bull. Amer. Math. Soc. 74, 64-74, 1968.\n\nG B Whitham, Linear and Nonlinear Waves. John Wiley & SonsG. B. Whitham, Linear and Nonlinear Waves, John Wiley & Sons, 1974.\n", "annotations": {"author": "[{\"end\":65,\"start\":45}]", "publisher": null, "author_last_name": "[{\"end\":64,\"start\":56}]", "author_first_name": "[{\"end\":53,\"start\":45},{\"end\":55,\"start\":54}]", "author_affiliation": null, "title": "[{\"end\":42,\"start\":1},{\"end\":107,\"start\":66}]", "venue": null, "abstract": "[{\"end\":878,\"start\":109}]", "bib_ref": "[{\"attributes\":{\"ref_id\":\"b36\"},\"end\":1538,\"start\":1534},{\"attributes\":{\"ref_id\":\"b3\"},\"end\":1864,\"start\":1861},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":2061,\"start\":2057},{\"attributes\":{\"ref_id\":\"b21\"},\"end\":2064,\"start\":2061},{\"attributes\":{\"ref_id\":\"b3\"},\"end\":2126,\"start\":2123},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":2432,\"start\":2428},{\"attributes\":{\"ref_id\":\"b29\"},\"end\":2485,\"start\":2481},{\"attributes\":{\"ref_id\":\"b13\"},\"end\":3005,\"start\":3001},{\"attributes\":{\"ref_id\":\"b19\"},\"end\":3233,\"start\":3229},{\"attributes\":{\"ref_id\":\"b13\"},\"end\":3327,\"start\":3323},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":3347,\"start\":3343},{\"attributes\":{\"ref_id\":\"b3\"},\"end\":3507,\"start\":3504},{\"attributes\":{\"ref_id\":\"b37\"},\"end\":3893,\"start\":3889},{\"end\":3904,\"start\":3899},{\"attributes\":{\"ref_id\":\"b34\"},\"end\":4000,\"start\":3996},{\"end\":4016,\"start\":4006},{\"attributes\":{\"ref_id\":\"b13\"},\"end\":4557,\"start\":4553},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":4560,\"start\":4557},{\"attributes\":{\"ref_id\":\"b11\"},\"end\":4563,\"start\":4560},{\"attributes\":{\"ref_id\":\"b16\"},\"end\":4566,\"start\":4563},{\"attributes\":{\"ref_id\":\"b13\"},\"end\":5048,\"start\":5044},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":5054,\"start\":5050},{\"end\":5386,\"start\":5381},{\"attributes\":{\"ref_id\":\"b13\"},\"end\":5545,\"start\":5541},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":5548,\"start\":5545},{\"end\":5659,\"start\":5654},{\"attributes\":{\"ref_id\":\"b16\"},\"end\":6585,\"start\":6581},{\"attributes\":{\"ref_id\":\"b3\"},\"end\":7275,\"start\":7272},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":7640,\"start\":7637},{\"attributes\":{\"ref_id\":\"b13\"},\"end\":8309,\"start\":8305},{\"attributes\":{\"ref_id\":\"b22\"},\"end\":10903,\"start\":10899},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":11142,\"start\":11138},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":11144,\"start\":11142},{\"attributes\":{\"ref_id\":\"b3\"},\"end\":11205,\"start\":11202},{\"attributes\":{\"ref_id\":\"b0\"},\"end\":12270,\"start\":12267},{\"attributes\":{\"ref_id\":\"b18\"},\"end\":12273,\"start\":12270},{\"attributes\":{\"ref_id\":\"b11\"},\"end\":13154,\"start\":13150},{\"attributes\":{\"ref_id\":\"b3\"},\"end\":13687,\"start\":13684},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":13696,\"start\":13692},{\"attributes\":{\"ref_id\":\"b19\"},\"end\":13994,\"start\":13990},{\"end\":14382,\"start\":14377},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":15303,\"start\":15300},{\"attributes\":{\"ref_id\":\"b16\"},\"end\":15306,\"start\":15303},{\"attributes\":{\"ref_id\":\"b7\"},\"end\":15850,\"start\":15847},{\"attributes\":{\"ref_id\":\"b35\"},\"end\":18386,\"start\":18382},{\"attributes\":{\"ref_id\":\"b12\"},\"end\":18641,\"start\":18637},{\"attributes\":{\"ref_id\":\"b35\"},\"end\":19039,\"start\":19035},{\"end\":19716,\"start\":19711},{\"attributes\":{\"ref_id\":\"b13\"},\"end\":19857,\"start\":19853},{\"attributes\":{\"ref_id\":\"b2\"},\"end\":20557,\"start\":20554},{\"end\":21838,\"start\":21833},{\"end\":23412,\"start\":23406},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":25583,\"start\":25579},{\"attributes\":{\"ref_id\":\"b11\"},\"end\":25731,\"start\":25727},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":25989,\"start\":25985},{\"attributes\":{\"ref_id\":\"b11\"},\"end\":25992,\"start\":25989},{\"end\":26608,\"start\":26602},{\"end\":28600,\"start\":28594},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":28693,\"start\":28689},{\"attributes\":{\"ref_id\":\"b11\"},\"end\":28702,\"start\":28698},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":28769,\"start\":28765},{\"attributes\":{\"ref_id\":\"b28\"},\"end\":30393,\"start\":30389},{\"attributes\":{\"ref_id\":\"b37\"},\"end\":32154,\"start\":32150},{\"end\":33351,\"start\":33345},{\"end\":33471,\"start\":33465},{\"end\":35581,\"start\":35575},{\"attributes\":{\"ref_id\":\"b11\"},\"end\":37819,\"start\":37815},{\"attributes\":{\"ref_id\":\"b34\"},\"end\":39067,\"start\":39063},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":39386,\"start\":39382},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":39727,\"start\":39723},{\"attributes\":{\"ref_id\":\"b11\"},\"end\":40027,\"start\":40023},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":40296,\"start\":40292},{\"attributes\":{\"ref_id\":\"b11\"},\"end\":40483,\"start\":40479},{\"end\":41989,\"start\":41983},{\"attributes\":{\"ref_id\":\"b11\"},\"end\":43191,\"start\":43187},{\"end\":44755,\"start\":44749},{\"attributes\":{\"ref_id\":\"b11\"},\"end\":44905,\"start\":44901},{\"end\":45697,\"start\":45691},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":46918,\"start\":46915},{\"attributes\":{\"ref_id\":\"b6\"},\"end\":47232,\"start\":47229},{\"attributes\":{\"ref_id\":\"b16\"},\"end\":47992,\"start\":47988},{\"attributes\":{\"ref_id\":\"b17\"},\"end\":50037,\"start\":50033},{\"attributes\":{\"ref_id\":\"b16\"},\"end\":50519,\"start\":50515},{\"attributes\":{\"ref_id\":\"b32\"},\"end\":51053,\"start\":51049},{\"attributes\":{\"ref_id\":\"b13\"},\"end\":51331,\"start\":51327},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":51334,\"start\":51331},{\"end\":51618,\"start\":51613},{\"attributes\":{\"ref_id\":\"b17\"},\"end\":51723,\"start\":51719},{\"attributes\":{\"ref_id\":\"b33\"},\"end\":52539,\"start\":52535},{\"attributes\":{\"ref_id\":\"b5\"},\"end\":52589,\"start\":52586},{\"attributes\":{\"ref_id\":\"b8\"},\"end\":53393,\"start\":53390},{\"attributes\":{\"ref_id\":\"b27\"},\"end\":54073,\"start\":54069},{\"attributes\":{\"ref_id\":\"b11\"},\"end\":54614,\"start\":54610},{\"attributes\":{\"ref_id\":\"b26\"},\"end\":54835,\"start\":54831},{\"attributes\":{\"ref_id\":\"b31\"},\"end\":55297,\"start\":55293},{\"end\":55427,\"start\":55422},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":55806,\"start\":55803},{\"attributes\":{\"ref_id\":\"b16\"},\"end\":55809,\"start\":55806},{\"attributes\":{\"ref_id\":\"b24\"},\"end\":56046,\"start\":56042},{\"attributes\":{\"ref_id\":\"b30\"},\"end\":56049,\"start\":56046},{\"attributes\":{\"ref_id\":\"b20\"},\"end\":56052,\"start\":56049},{\"attributes\":{\"ref_id\":\"b11\"},\"end\":56278,\"start\":56274},{\"end\":56446,\"start\":56441},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":57264,\"start\":57260},{\"attributes\":{\"ref_id\":\"b23\"},\"end\":57981,\"start\":57977},{\"attributes\":{\"ref_id\":\"b25\"},\"end\":57984,\"start\":57981},{\"attributes\":{\"ref_id\":\"b29\"},\"end\":58418,\"start\":58414},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":60078,\"start\":60074}]", "figure": "[{\"attributes\":{\"id\":\"fig_0\"},\"end\":58782,\"start\":58749},{\"attributes\":{\"id\":\"fig_1\"},\"end\":59473,\"start\":58783},{\"attributes\":{\"id\":\"fig_2\"},\"end\":59539,\"start\":59474},{\"attributes\":{\"id\":\"fig_3\"},\"end\":59628,\"start\":59540},{\"attributes\":{\"id\":\"fig_4\"},\"end\":59713,\"start\":59629},{\"attributes\":{\"id\":\"fig_5\"},\"end\":60150,\"start\":59714}]", "paragraph": "[{\"end\":1600,\"start\":894},{\"end\":2005,\"start\":1602},{\"end\":2569,\"start\":2007},{\"end\":3266,\"start\":2571},{\"end\":3588,\"start\":3268},{\"end\":4018,\"start\":3590},{\"end\":4118,\"start\":4033},{\"end\":4934,\"start\":4234},{\"end\":5186,\"start\":4936},{\"end\":5975,\"start\":5222},{\"end\":6081,\"start\":5977},{\"end\":6183,\"start\":6083},{\"end\":6717,\"start\":6256},{\"end\":6934,\"start\":6719},{\"end\":7428,\"start\":7119},{\"end\":8311,\"start\":7430},{\"end\":8974,\"start\":8313},{\"end\":9952,\"start\":9066},{\"end\":10628,\"start\":10123},{\"end\":11197,\"start\":10748},{\"end\":11396,\"start\":11199},{\"end\":11679,\"start\":11398},{\"end\":11857,\"start\":11740},{\"end\":12313,\"start\":11859},{\"end\":12515,\"start\":12315},{\"end\":12795,\"start\":12713},{\"end\":13321,\"start\":12986},{\"end\":13611,\"start\":13323},{\"end\":14135,\"start\":13613},{\"end\":14555,\"start\":14137},{\"end\":14867,\"start\":14557},{\"end\":15517,\"start\":14928},{\"end\":15720,\"start\":15558},{\"end\":15851,\"start\":15769},{\"end\":15973,\"start\":15853},{\"end\":16630,\"start\":16056},{\"end\":16852,\"start\":16673},{\"end\":17033,\"start\":16882},{\"end\":17226,\"start\":17048},{\"end\":18038,\"start\":17258},{\"end\":18189,\"start\":18071},{\"end\":18291,\"start\":18249},{\"end\":18298,\"start\":18293},{\"end\":18464,\"start\":18319},{\"end\":18680,\"start\":18542},{\"end\":18853,\"start\":18816},{\"end\":19041,\"start\":18915},{\"end\":19471,\"start\":19252},{\"end\":19522,\"start\":19473},{\"end\":20024,\"start\":19649},{\"end\":20291,\"start\":20099},{\"end\":20597,\"start\":20510},{\"end\":20832,\"start\":20753},{\"end\":21431,\"start\":20877},{\"end\":21439,\"start\":21433},{\"end\":21641,\"start\":21441},{\"end\":21839,\"start\":21763},{\"end\":22029,\"start\":21874},{\"end\":22118,\"start\":22083},{\"end\":22367,\"start\":22210},{\"end\":22828,\"start\":22369},{\"end\":22987,\"start\":22923},{\"end\":23119,\"start\":23033},{\"end\":23395,\"start\":23231},{\"end\":23451,\"start\":23397},{\"end\":23658,\"start\":23578},{\"end\":24323,\"start\":23679},{\"end\":24378,\"start\":24342},{\"end\":25175,\"start\":24380},{\"end\":25440,\"start\":25231},{\"end\":25586,\"start\":25496},{\"end\":25739,\"start\":25719},{\"end\":26168,\"start\":25867},{\"end\":26382,\"start\":26260},{\"end\":26609,\"start\":26432},{\"end\":26723,\"start\":26611},{\"end\":27422,\"start\":26828},{\"end\":27584,\"start\":27468},{\"end\":28928,\"start\":27720},{\"end\":29156,\"start\":29097},{\"end\":29871,\"start\":29158},{\"end\":30478,\"start\":30184},{\"end\":32020,\"start\":30480},{\"end\":32155,\"start\":32022},{\"end\":32558,\"start\":32201},{\"end\":33129,\"start\":32582},{\"end\":33453,\"start\":33249},{\"end\":33552,\"start\":33455},{\"end\":33734,\"start\":33689},{\"end\":33974,\"start\":33885},{\"end\":34016,\"start\":33976},{\"end\":34183,\"start\":34049},{\"end\":34282,\"start\":34185},{\"end\":34883,\"start\":34790},{\"end\":34929,\"start\":34923},{\"end\":35024,\"start\":34931},{\"end\":35307,\"start\":35077},{\"end\":35528,\"start\":35468},{\"end\":35599,\"start\":35537},{\"end\":35843,\"start\":35656},{\"end\":36198,\"start\":36041},{\"end\":36552,\"start\":36551},{\"end\":36857,\"start\":36554},{\"end\":36969,\"start\":36859},{\"end\":37276,\"start\":37212},{\"end\":38020,\"start\":37564},{\"end\":38366,\"start\":38215},{\"end\":39068,\"start\":38382},{\"end\":39123,\"start\":39088},{\"end\":39200,\"start\":39170},{\"end\":39558,\"start\":39274},{\"end\":39862,\"start\":39590},{\"end\":40182,\"start\":39980},{\"end\":40567,\"start\":40184},{\"end\":40910,\"start\":40869},{\"end\":41168,\"start\":41134},{\"end\":41280,\"start\":41266},{\"end\":41322,\"start\":41282},{\"end\":41757,\"start\":41461},{\"end\":42114,\"start\":41980},{\"end\":42193,\"start\":42116},{\"end\":43535,\"start\":42325},{\"end\":44907,\"start\":43773},{\"end\":45177,\"start\":44909},{\"end\":45396,\"start\":45197},{\"end\":45622,\"start\":45492},{\"end\":45887,\"start\":45645},{\"end\":46310,\"start\":45889},{\"end\":46531,\"start\":46493},{\"end\":47233,\"start\":46559},{\"end\":47923,\"start\":47235},{\"end\":48095,\"start\":47925},{\"end\":48197,\"start\":48097},{\"end\":48527,\"start\":48409},{\"end\":48756,\"start\":48681},{\"end\":48956,\"start\":48902},{\"end\":49086,\"start\":49023},{\"end\":49202,\"start\":49138},{\"end\":49358,\"start\":49321},{\"end\":49775,\"start\":49535},{\"end\":49886,\"start\":49832},{\"end\":49948,\"start\":49925},{\"end\":50222,\"start\":50023},{\"end\":50553,\"start\":50302},{\"end\":50780,\"start\":50715},{\"end\":51054,\"start\":50820},{\"end\":52046,\"start\":51056},{\"end\":53332,\"start\":52066},{\"end\":54074,\"start\":53334},{\"end\":55298,\"start\":54116},{\"end\":55929,\"start\":55300},{\"end\":56219,\"start\":55931},{\"end\":58748,\"start\":56271}]", "formula": "[{\"attributes\":{\"id\":\"formula_0\"},\"end\":4233,\"start\":4119},{\"attributes\":{\"id\":\"formula_1\"},\"end\":5221,\"start\":5187},{\"attributes\":{\"id\":\"formula_2\"},\"end\":6255,\"start\":6184},{\"attributes\":{\"id\":\"formula_3\"},\"end\":7087,\"start\":6935},{\"attributes\":{\"id\":\"formula_4\"},\"end\":9065,\"start\":8975},{\"attributes\":{\"id\":\"formula_5\"},\"end\":10122,\"start\":9953},{\"attributes\":{\"id\":\"formula_6\"},\"end\":10747,\"start\":10629},{\"attributes\":{\"id\":\"formula_7\"},\"end\":11739,\"start\":11680},{\"attributes\":{\"id\":\"formula_8\"},\"end\":12712,\"start\":12516},{\"attributes\":{\"id\":\"formula_9\"},\"end\":12985,\"start\":12796},{\"attributes\":{\"id\":\"formula_10\"},\"end\":15557,\"start\":15518},{\"attributes\":{\"id\":\"formula_11\"},\"end\":15768,\"start\":15721},{\"attributes\":{\"id\":\"formula_12\"},\"end\":16055,\"start\":15974},{\"attributes\":{\"id\":\"formula_13\"},\"end\":16672,\"start\":16631},{\"attributes\":{\"id\":\"formula_14\"},\"end\":16881,\"start\":16853},{\"attributes\":{\"id\":\"formula_15\"},\"end\":17047,\"start\":17034},{\"attributes\":{\"id\":\"formula_16\"},\"end\":17257,\"start\":17227},{\"attributes\":{\"id\":\"formula_17\"},\"end\":18070,\"start\":18039},{\"attributes\":{\"id\":\"formula_18\"},\"end\":18248,\"start\":18190},{\"attributes\":{\"id\":\"formula_19\"},\"end\":18541,\"start\":18465},{\"attributes\":{\"id\":\"formula_20\"},\"end\":18815,\"start\":18681},{\"attributes\":{\"id\":\"formula_21\"},\"end\":18914,\"start\":18854},{\"attributes\":{\"id\":\"formula_22\"},\"end\":19251,\"start\":19042},{\"attributes\":{\"id\":\"formula_23\"},\"end\":19648,\"start\":19523},{\"attributes\":{\"id\":\"formula_24\"},\"end\":20098,\"start\":20025},{\"attributes\":{\"id\":\"formula_25\"},\"end\":20509,\"start\":20292},{\"attributes\":{\"id\":\"formula_26\"},\"end\":20752,\"start\":20598},{\"attributes\":{\"id\":\"formula_27\"},\"end\":21705,\"start\":21642},{\"attributes\":{\"id\":\"formula_28\"},\"end\":21873,\"start\":21840},{\"attributes\":{\"id\":\"formula_29\"},\"end\":22082,\"start\":22030},{\"attributes\":{\"id\":\"formula_30\"},\"end\":22209,\"start\":22119},{\"attributes\":{\"id\":\"formula_31\"},\"end\":22922,\"start\":22829},{\"attributes\":{\"id\":\"formula_32\"},\"end\":23230,\"start\":23120},{\"attributes\":{\"id\":\"formula_33\"},\"end\":23577,\"start\":23452},{\"attributes\":{\"id\":\"formula_34\"},\"end\":24341,\"start\":24324},{\"attributes\":{\"id\":\"formula_35\"},\"end\":25230,\"start\":25176},{\"attributes\":{\"id\":\"formula_36\"},\"end\":25495,\"start\":25441},{\"attributes\":{\"id\":\"formula_37\"},\"end\":25718,\"start\":25587},{\"attributes\":{\"id\":\"formula_38\"},\"end\":25866,\"start\":25740},{\"attributes\":{\"id\":\"formula_39\"},\"end\":26259,\"start\":26169},{\"attributes\":{\"id\":\"formula_40\"},\"end\":26431,\"start\":26383},{\"attributes\":{\"id\":\"formula_41\"},\"end\":26827,\"start\":26724},{\"attributes\":{\"id\":\"formula_42\"},\"end\":27719,\"start\":27585},{\"attributes\":{\"id\":\"formula_43\"},\"end\":29096,\"start\":28929},{\"attributes\":{\"id\":\"formula_44\"},\"end\":30086,\"start\":29872},{\"attributes\":{\"id\":\"formula_45\"},\"end\":30183,\"start\":30086},{\"attributes\":{\"id\":\"formula_46\"},\"end\":32200,\"start\":32156},{\"attributes\":{\"id\":\"formula_47\"},\"end\":32581,\"start\":32559},{\"attributes\":{\"id\":\"formula_48\"},\"end\":33194,\"start\":33130},{\"attributes\":{\"id\":\"formula_49\"},\"end\":33688,\"start\":33553},{\"attributes\":{\"id\":\"formula_50\"},\"end\":33884,\"start\":33735},{\"attributes\":{\"id\":\"formula_51\"},\"end\":34048,\"start\":34017},{\"attributes\":{\"id\":\"formula_52\"},\"end\":34789,\"start\":34283},{\"attributes\":{\"id\":\"formula_53\"},\"end\":34922,\"start\":34884},{\"attributes\":{\"id\":\"formula_54\"},\"end\":35076,\"start\":35025},{\"attributes\":{\"id\":\"formula_55\"},\"end\":35467,\"start\":35308},{\"attributes\":{\"id\":\"formula_56\"},\"end\":35536,\"start\":35529},{\"attributes\":{\"id\":\"formula_57\"},\"end\":35630,\"start\":35600},{\"attributes\":{\"id\":\"formula_58\"},\"end\":35655,\"start\":35630},{\"attributes\":{\"id\":\"formula_59\"},\"end\":36040,\"start\":35844},{\"attributes\":{\"id\":\"formula_60\"},\"end\":36550,\"start\":36199},{\"attributes\":{\"id\":\"formula_61\"},\"end\":37211,\"start\":36970},{\"attributes\":{\"id\":\"formula_62\"},\"end\":37563,\"start\":37277},{\"attributes\":{\"id\":\"formula_63\"},\"end\":38214,\"start\":38021},{\"attributes\":{\"id\":\"formula_64\"},\"end\":39169,\"start\":39124},{\"attributes\":{\"id\":\"formula_65\"},\"end\":39273,\"start\":39201},{\"attributes\":{\"id\":\"formula_66\"},\"end\":39589,\"start\":39559},{\"attributes\":{\"id\":\"formula_67\"},\"end\":39979,\"start\":39863},{\"attributes\":{\"id\":\"formula_68\"},\"end\":40868,\"start\":40568},{\"attributes\":{\"id\":\"formula_69\"},\"end\":41133,\"start\":40911},{\"attributes\":{\"id\":\"formula_70\"},\"end\":41265,\"start\":41169},{\"attributes\":{\"id\":\"formula_71\"},\"end\":41460,\"start\":41323},{\"attributes\":{\"id\":\"formula_72\"},\"end\":41979,\"start\":41758},{\"attributes\":{\"id\":\"formula_73\"},\"end\":42324,\"start\":42260},{\"attributes\":{\"id\":\"formula_74\"},\"end\":43772,\"start\":43536},{\"attributes\":{\"id\":\"formula_75\"},\"end\":45196,\"start\":45178},{\"attributes\":{\"id\":\"formula_76\"},\"end\":45491,\"start\":45397},{\"attributes\":{\"id\":\"formula_77\"},\"end\":45644,\"start\":45623},{\"attributes\":{\"id\":\"formula_78\"},\"end\":46492,\"start\":46311},{\"attributes\":{\"id\":\"formula_79\"},\"end\":48408,\"start\":48198},{\"attributes\":{\"id\":\"formula_80\"},\"end\":48680,\"start\":48528},{\"attributes\":{\"id\":\"formula_81\"},\"end\":48901,\"start\":48757},{\"attributes\":{\"id\":\"formula_82\"},\"end\":49022,\"start\":48957},{\"attributes\":{\"id\":\"formula_83\"},\"end\":49137,\"start\":49087},{\"attributes\":{\"id\":\"formula_84\"},\"end\":49320,\"start\":49203},{\"attributes\":{\"id\":\"formula_85\"},\"end\":49534,\"start\":49359},{\"attributes\":{\"id\":\"formula_86\"},\"end\":49831,\"start\":49776},{\"attributes\":{\"id\":\"formula_87\"},\"end\":49924,\"start\":49887},{\"attributes\":{\"id\":\"formula_88\"},\"end\":50022,\"start\":49949},{\"attributes\":{\"id\":\"formula_89\"},\"end\":50301,\"start\":50223},{\"attributes\":{\"id\":\"formula_90\"},\"end\":50714,\"start\":50554},{\"attributes\":{\"id\":\"formula_91\"},\"end\":50819,\"start\":50781}]", "table_ref": null, "section_header": "[{\"attributes\":{\"n\":\"1.\"},\"end\":892,\"start\":880},{\"attributes\":{\"n\":\"2.\"},\"end\":4031,\"start\":4021},{\"end\":7117,\"start\":7089},{\"attributes\":{\"n\":\"3.\"},\"end\":14926,\"start\":14870},{\"attributes\":{\"n\":\"3.1.\"},\"end\":18317,\"start\":18301},{\"attributes\":{\"n\":\"3.1.1.\"},\"end\":20875,\"start\":20835},{\"attributes\":{\"n\":\"3.2.\"},\"end\":21761,\"start\":21707},{\"attributes\":{\"n\":\"3.3.\"},\"end\":23031,\"start\":22990},{\"attributes\":{\"n\":\"4.\"},\"end\":23677,\"start\":23661},{\"attributes\":{\"n\":\"4.1.\"},\"end\":27466,\"start\":27425},{\"attributes\":{\"n\":\"4.2.\"},\"end\":33247,\"start\":33196},{\"end\":38380,\"start\":38369},{\"attributes\":{\"n\":\"5.\"},\"end\":39086,\"start\":39071},{\"end\":42259,\"start\":42196},{\"attributes\":{\"n\":\"6.\"},\"end\":46557,\"start\":46534},{\"attributes\":{\"n\":\"7.2.\"},\"end\":52064,\"start\":52049},{\"attributes\":{\"n\":\"7.3.\"},\"end\":54114,\"start\":54077},{\"attributes\":{\"n\":\"7.4.\"},\"end\":56269,\"start\":56222},{\"end\":59549,\"start\":59541},{\"end\":59640,\"start\":59630}]", "table": null, "figure_caption": "[{\"end\":58782,\"start\":58751},{\"end\":59473,\"start\":58785},{\"end\":59539,\"start\":59476},{\"end\":59628,\"start\":59551},{\"end\":59713,\"start\":59644},{\"end\":60150,\"start\":59716}]", "figure_ref": "[{\"attributes\":{\"ref_id\":\"fig_3\"},\"end\":30507,\"start\":30499},{\"attributes\":{\"ref_id\":\"fig_3\"},\"end\":38617,\"start\":38608}]", "bib_author_first_name": "[{\"end\":61246,\"start\":61245},{\"end\":61257,\"start\":61256},{\"end\":61267,\"start\":61266},{\"end\":61269,\"start\":61268},{\"end\":61285,\"start\":61283},{\"end\":61466,\"start\":61465},{\"end\":61475,\"start\":61474},{\"end\":61675,\"start\":61674},{\"end\":61685,\"start\":61684},{\"end\":61920,\"start\":61919},{\"end\":61930,\"start\":61929},{\"end\":61942,\"start\":61941},{\"end\":61944,\"start\":61943},{\"end\":62139,\"start\":62138},{\"end\":62153,\"start\":62148},{\"end\":62370,\"start\":62369},{\"end\":62378,\"start\":62377},{\"end\":62645,\"start\":62644},{\"end\":62654,\"start\":62653},{\"end\":62668,\"start\":62667},{\"end\":62672,\"start\":62669},{\"end\":62972,\"start\":62971},{\"end\":63257,\"start\":63256},{\"end\":63262,\"start\":63260},{\"end\":63467,\"start\":63466},{\"end\":63470,\"start\":63468},{\"end\":63483,\"start\":63482},{\"end\":63495,\"start\":63494},{\"end\":63698,\"start\":63697},{\"end\":63709,\"start\":63708},{\"end\":63892,\"start\":63891},{\"end\":63894,\"start\":63893},{\"end\":64136,\"start\":64135},{\"end\":64138,\"start\":64137},{\"end\":64150,\"start\":64149},{\"end\":64152,\"start\":64151},{\"end\":64159,\"start\":64155},{\"end\":64507,\"start\":64506},{\"end\":64509,\"start\":64508},{\"end\":64521,\"start\":64520},{\"end\":64523,\"start\":64522},{\"end\":64530,\"start\":64526},{\"end\":64850,\"start\":64849},{\"end\":64852,\"start\":64851},{\"end\":64864,\"start\":64863},{\"end\":64866,\"start\":64865},{\"end\":64873,\"start\":64869},{\"end\":65108,\"start\":65107},{\"end\":65110,\"start\":65109},{\"end\":65122,\"start\":65121},{\"end\":65124,\"start\":65123},{\"end\":65131,\"start\":65127},{\"end\":65145,\"start\":65144},{\"end\":65147,\"start\":65146},{\"end\":65436,\"start\":65435},{\"end\":65438,\"start\":65437},{\"end\":65450,\"start\":65449},{\"end\":65452,\"start\":65451},{\"end\":65718,\"start\":65717},{\"end\":65720,\"start\":65719},{\"end\":65732,\"start\":65731},{\"end\":65890,\"start\":65889},{\"end\":66130,\"start\":66129},{\"end\":66132,\"start\":66131},{\"end\":66141,\"start\":66140},{\"end\":66143,\"start\":66142},{\"end\":66150,\"start\":66149},{\"end\":66152,\"start\":66151},{\"end\":66439,\"start\":66438},{\"end\":66441,\"start\":66440},{\"end\":66452,\"start\":66451},{\"end\":66454,\"start\":66453},{\"end\":66465,\"start\":66464},{\"end\":66753,\"start\":66752},{\"end\":66762,\"start\":66761},{\"end\":66937,\"start\":66936},{\"end\":66947,\"start\":66946},{\"end\":66956,\"start\":66955},{\"end\":66966,\"start\":66965},{\"end\":67143,\"start\":67142},{\"end\":67150,\"start\":67149},{\"end\":67152,\"start\":67151},{\"end\":67165,\"start\":67164},{\"end\":67167,\"start\":67166},{\"end\":67417,\"start\":67416},{\"end\":67419,\"start\":67418},{\"end\":67431,\"start\":67430},{\"end\":67433,\"start\":67432},{\"end\":67669,\"start\":67668},{\"end\":67682,\"start\":67681},{\"end\":67684,\"start\":67683},{\"end\":67691,\"start\":67687},{\"end\":67705,\"start\":67704},{\"end\":67707,\"start\":67706},{\"end\":68071,\"start\":68070},{\"end\":68239,\"start\":68231},{\"end\":68474,\"start\":68473},{\"end\":68476,\"start\":68475},{\"end\":68646,\"start\":68645},{\"end\":68908,\"start\":68907},{\"end\":69135,\"start\":69134},{\"end\":69147,\"start\":69146},{\"end\":69352,\"start\":69351},{\"end\":69354,\"start\":69353},{\"end\":69486,\"start\":69485},{\"end\":69668,\"start\":69667},{\"end\":69801,\"start\":69800},{\"end\":69972,\"start\":69971},{\"end\":69974,\"start\":69973},{\"end\":70097,\"start\":70096},{\"end\":70099,\"start\":70098}]", "bib_author_last_name": "[{\"end\":61254,\"start\":61247},{\"end\":61264,\"start\":61258},{\"end\":61281,\"start\":61270},{\"end\":61294,\"start\":61286},{\"end\":61472,\"start\":61467},{\"end\":61484,\"start\":61476},{\"end\":61682,\"start\":61676},{\"end\":61689,\"start\":61686},{\"end\":61927,\"start\":61921},{\"end\":61939,\"start\":61931},{\"end\":61950,\"start\":61945},{\"end\":62146,\"start\":62140},{\"end\":62375,\"start\":62371},{\"end\":62388,\"start\":62379},{\"end\":62651,\"start\":62646},{\"end\":62665,\"start\":62655},{\"end\":62682,\"start\":62673},{\"end\":62978,\"start\":62973},{\"end\":63272,\"start\":63263},{\"end\":63480,\"start\":63471},{\"end\":63492,\"start\":63484},{\"end\":63507,\"start\":63496},{\"end\":63706,\"start\":63699},{\"end\":63717,\"start\":63710},{\"end\":63903,\"start\":63895},{\"end\":64147,\"start\":64139},{\"end\":64170,\"start\":64160},{\"end\":64518,\"start\":64510},{\"end\":64541,\"start\":64531},{\"end\":64861,\"start\":64853},{\"end\":64884,\"start\":64874},{\"end\":65119,\"start\":65111},{\"end\":65142,\"start\":65132},{\"end\":65154,\"start\":65148},{\"end\":65447,\"start\":65439},{\"end\":65459,\"start\":65453},{\"end\":65729,\"start\":65721},{\"end\":65739,\"start\":65733},{\"end\":65897,\"start\":65891},{\"end\":66138,\"start\":66133},{\"end\":66147,\"start\":66144},{\"end\":66159,\"start\":66153},{\"end\":66449,\"start\":66442},{\"end\":66462,\"start\":66455},{\"end\":66471,\"start\":66466},{\"end\":66759,\"start\":66754},{\"end\":66944,\"start\":66938},{\"end\":66953,\"start\":66948},{\"end\":66963,\"start\":66957},{\"end\":66973,\"start\":66967},{\"end\":67147,\"start\":67144},{\"end\":67162,\"start\":67153},{\"end\":67178,\"start\":67168},{\"end\":67428,\"start\":67420},{\"end\":67439,\"start\":67434},{\"end\":67679,\"start\":67670},{\"end\":67702,\"start\":67692},{\"end\":67714,\"start\":67708},{\"end\":68082,\"start\":68072},{\"end\":68244,\"start\":68240},{\"end\":68486,\"start\":68477},{\"end\":68653,\"start\":68647},{\"end\":68919,\"start\":68909},{\"end\":69144,\"start\":69136},{\"end\":69161,\"start\":69148},{\"end\":69361,\"start\":69355},{\"end\":69496,\"start\":69487},{\"end\":69676,\"start\":69669},{\"end\":69807,\"start\":69802},{\"end\":69980,\"start\":69975},{\"end\":70107,\"start\":70100}]", "bib_entry": "[{\"attributes\":{\"id\":\"b0\",\"matched_paper_id\":14577032},\"end\":61461,\"start\":61191},{\"attributes\":{\"id\":\"b1\"},\"end\":61608,\"start\":61463},{\"attributes\":{\"id\":\"b2\",\"matched_paper_id\":15057291},\"end\":61859,\"start\":61610},{\"attributes\":{\"id\":\"b3\",\"matched_paper_id\":31392310},\"end\":62136,\"start\":61861},{\"attributes\":{\"doi\":\"arXiv:1011.6338v2\",\"id\":\"b4\"},\"end\":62331,\"start\":62138},{\"attributes\":{\"id\":\"b5\",\"matched_paper_id\":121770527},\"end\":62542,\"start\":62333},{\"attributes\":{\"id\":\"b6\",\"matched_paper_id\":45418049},\"end\":62897,\"start\":62544},{\"attributes\":{\"id\":\"b7\",\"matched_paper_id\":117984101},\"end\":63149,\"start\":62899},{\"attributes\":{\"id\":\"b8\"},\"end\":63464,\"start\":63151},{\"attributes\":{\"id\":\"b9\"},\"end\":63659,\"start\":63466},{\"attributes\":{\"id\":\"b10\",\"matched_paper_id\":119376409},\"end\":63833,\"start\":63661},{\"attributes\":{\"id\":\"b11\",\"matched_paper_id\":115155554},\"end\":64025,\"start\":63835},{\"attributes\":{\"id\":\"b12\",\"matched_paper_id\":120717041},\"end\":64371,\"start\":64027},{\"attributes\":{\"id\":\"b13\",\"matched_paper_id\":18325470},\"end\":64781,\"start\":64373},{\"attributes\":{\"id\":\"b14\"},\"end\":65024,\"start\":64783},{\"attributes\":{\"id\":\"b15\",\"matched_paper_id\":15079635},\"end\":65358,\"start\":65026},{\"attributes\":{\"id\":\"b16\",\"matched_paper_id\":55582112},\"end\":65629,\"start\":65360},{\"attributes\":{\"id\":\"b17\"},\"end\":65887,\"start\":65631},{\"attributes\":{\"doi\":\"arXiv:math-ph/0611087\",\"id\":\"b18\"},\"end\":66061,\"start\":65889},{\"attributes\":{\"id\":\"b19\",\"matched_paper_id\":67842176},\"end\":66330,\"start\":66063},{\"attributes\":{\"id\":\"b20\",\"matched_paper_id\":7336803},\"end\":66686,\"start\":66332},{\"attributes\":{\"id\":\"b21\",\"matched_paper_id\":56339358},\"end\":66900,\"start\":66688},{\"attributes\":{\"id\":\"b22\",\"matched_paper_id\":206454812},\"end\":67140,\"start\":66902},{\"attributes\":{\"id\":\"b23\"},\"end\":67363,\"start\":67142},{\"attributes\":{\"id\":\"b24\",\"matched_paper_id\":18515349},\"end\":67585,\"start\":67365},{\"attributes\":{\"id\":\"b25\",\"matched_paper_id\":8692316},\"end\":67995,\"start\":67587},{\"attributes\":{\"id\":\"b26\",\"matched_paper_id\":16144537},\"end\":68229,\"start\":67997},{\"attributes\":{\"id\":\"b27\"},\"end\":68429,\"start\":68231},{\"attributes\":{\"id\":\"b28\",\"matched_paper_id\":122648908},\"end\":68643,\"start\":68431},{\"attributes\":{\"doi\":\"hep-th/0410165\",\"id\":\"b29\"},\"end\":68827,\"start\":68645},{\"attributes\":{\"id\":\"b30\",\"matched_paper_id\":28255159},\"end\":69071,\"start\":68829},{\"attributes\":{\"id\":\"b31\",\"matched_paper_id\":118138758},\"end\":69347,\"start\":69073},{\"attributes\":{\"id\":\"b32\"},\"end\":69419,\"start\":69349},{\"attributes\":{\"id\":\"b33\",\"matched_paper_id\":7180358},\"end\":69665,\"start\":69421},{\"attributes\":{\"id\":\"b34\"},\"end\":69796,\"start\":69667},{\"attributes\":{\"id\":\"b35\"},\"end\":69934,\"start\":69798},{\"attributes\":{\"id\":\"b36\",\"matched_paper_id\":120529362},\"end\":70094,\"start\":69936},{\"attributes\":{\"id\":\"b37\"},\"end\":70221,\"start\":70096}]", "bib_title": "[{\"end\":61243,\"start\":61191},{\"end\":61672,\"start\":61610},{\"end\":61917,\"start\":61861},{\"end\":62367,\"start\":62333},{\"end\":62642,\"start\":62544},{\"end\":62969,\"start\":62899},{\"end\":63695,\"start\":63661},{\"end\":63889,\"start\":63835},{\"end\":64133,\"start\":64027},{\"end\":64504,\"start\":64373},{\"end\":65105,\"start\":65026},{\"end\":65433,\"start\":65360},{\"end\":66127,\"start\":66063},{\"end\":66436,\"start\":66332},{\"end\":66750,\"start\":66688},{\"end\":66934,\"start\":66902},{\"end\":67414,\"start\":67365},{\"end\":67666,\"start\":67587},{\"end\":68068,\"start\":67997},{\"end\":68471,\"start\":68431},{\"end\":68905,\"start\":68829},{\"end\":69132,\"start\":69073},{\"end\":69483,\"start\":69421},{\"end\":69969,\"start\":69936}]", "bib_author": "[{\"end\":61256,\"start\":61245},{\"end\":61266,\"start\":61256},{\"end\":61283,\"start\":61266},{\"end\":61296,\"start\":61283},{\"end\":61474,\"start\":61465},{\"end\":61486,\"start\":61474},{\"end\":61684,\"start\":61674},{\"end\":61691,\"start\":61684},{\"end\":61929,\"start\":61919},{\"end\":61941,\"start\":61929},{\"end\":61952,\"start\":61941},{\"end\":62148,\"start\":62138},{\"end\":62156,\"start\":62148},{\"end\":62377,\"start\":62369},{\"end\":62390,\"start\":62377},{\"end\":62653,\"start\":62644},{\"end\":62667,\"start\":62653},{\"end\":62684,\"start\":62667},{\"end\":62980,\"start\":62971},{\"end\":63260,\"start\":63256},{\"end\":63274,\"start\":63260},{\"end\":63482,\"start\":63466},{\"end\":63494,\"start\":63482},{\"end\":63509,\"start\":63494},{\"end\":63708,\"start\":63697},{\"end\":63719,\"start\":63708},{\"end\":63905,\"start\":63891},{\"end\":64149,\"start\":64135},{\"end\":64155,\"start\":64149},{\"end\":64172,\"start\":64155},{\"end\":64520,\"start\":64506},{\"end\":64526,\"start\":64520},{\"end\":64543,\"start\":64526},{\"end\":64863,\"start\":64849},{\"end\":64869,\"start\":64863},{\"end\":64886,\"start\":64869},{\"end\":65121,\"start\":65107},{\"end\":65127,\"start\":65121},{\"end\":65144,\"start\":65127},{\"end\":65156,\"start\":65144},{\"end\":65449,\"start\":65435},{\"end\":65461,\"start\":65449},{\"end\":65731,\"start\":65717},{\"end\":65741,\"start\":65731},{\"end\":65899,\"start\":65889},{\"end\":66140,\"start\":66129},{\"end\":66149,\"start\":66140},{\"end\":66161,\"start\":66149},{\"end\":66451,\"start\":66438},{\"end\":66464,\"start\":66451},{\"end\":66473,\"start\":66464},{\"end\":66761,\"start\":66752},{\"end\":66765,\"start\":66761},{\"end\":66946,\"start\":66936},{\"end\":66955,\"start\":66946},{\"end\":66965,\"start\":66955},{\"end\":66975,\"start\":66965},{\"end\":67149,\"start\":67142},{\"end\":67164,\"start\":67149},{\"end\":67180,\"start\":67164},{\"end\":67430,\"start\":67416},{\"end\":67441,\"start\":67430},{\"end\":67681,\"start\":67668},{\"end\":67687,\"start\":67681},{\"end\":67704,\"start\":67687},{\"end\":67716,\"start\":67704},{\"end\":68084,\"start\":68070},{\"end\":68246,\"start\":68231},{\"end\":68488,\"start\":68473},{\"end\":68655,\"start\":68645},{\"end\":68921,\"start\":68907},{\"end\":69146,\"start\":69134},{\"end\":69163,\"start\":69146},{\"end\":69363,\"start\":69351},{\"end\":69498,\"start\":69485},{\"end\":69678,\"start\":69667},{\"end\":69809,\"start\":69800},{\"end\":69982,\"start\":69971},{\"end\":70109,\"start\":70096}]", "bib_venue": "[{\"end\":69207,\"start\":69189},{\"end\":61309,\"start\":61296},{\"end\":61522,\"start\":61486},{\"end\":61720,\"start\":61691},{\"end\":61983,\"start\":61952},{\"end\":62227,\"start\":62173},{\"end\":62421,\"start\":62390},{\"end\":62701,\"start\":62684},{\"end\":63016,\"start\":62980},{\"end\":63254,\"start\":63151},{\"end\":63539,\"start\":63509},{\"end\":63732,\"start\":63719},{\"end\":63917,\"start\":63905},{\"end\":64181,\"start\":64172},{\"end\":64562,\"start\":64543},{\"end\":64847,\"start\":64783},{\"end\":65174,\"start\":65156},{\"end\":65478,\"start\":65461},{\"end\":65715,\"start\":65631},{\"end\":65969,\"start\":65920},{\"end\":66179,\"start\":66161},{\"end\":66493,\"start\":66473},{\"end\":66775,\"start\":66765},{\"end\":67007,\"start\":66975},{\"end\":67237,\"start\":67180},{\"end\":67459,\"start\":67441},{\"end\":67745,\"start\":67716},{\"end\":68100,\"start\":68084},{\"end\":68317,\"start\":68246},{\"end\":68507,\"start\":68488},{\"end\":68730,\"start\":68669},{\"end\":68939,\"start\":68921},{\"end\":69187,\"start\":69163},{\"end\":69533,\"start\":69498},{\"end\":69697,\"start\":69678},{\"end\":69831,\"start\":69809},{\"end\":70003,\"start\":69982},{\"end\":70135,\"start\":70109}]"}}}, "year": 2023, "month": 12, "day": 17}