{"id": 120607894, "updated": "2022-02-20 19:45:59.054", "metadata": {"title": "Estimation of Causal Effects via Principal Stratification When Some Outcomes are Truncated by “Death”", "authors": "[{\"first\":\"Junni\",\"last\":\"Zhang\",\"middle\":[\"L.\"]},{\"first\":\"Donald\",\"last\":\"Rubin\",\"middle\":[\"B.\"]}]", "venue": null, "journal": "Journal of Educational and Behavioral Statistics", "publication_date": {"year": 2003, "month": null, "day": null}, "abstract": "The topic of “truncation by death” in randomized experiments arises in many fields, such as medicine, economics and education. Traditional approaches addressing this issue ignore the fact that the outcome after the truncation is neither “censored” nor “missing,” but should be treated as being defined on an extended sample space. Using an educational example to illustrate, we will outline here a formulation for tackling this issue, where we call the outcome “truncated by death” because there is no hidden value of the outcome variable masked by the truncating event. We first formulate the principal stratification (Frangakis & Rubin, 2002) approach, and we then derive large sample bounds for causal effects within the principal strata, with or without various identification assumptions. Extensions are then briefly discussed.", "fields_of_study": "[\"Mathematics\"]", "external_ids": {"arxiv": null, "mag": "2064556123", "acl": null, "pubmed": null, "pubmedcentral": null, "dblp": null, "doi": "10.3102/10769986028004353"}}, "content": {"source": {"pdf_hash": "2f74f4badc1e34a27e00b645ff91ac5332575f38", "pdf_src": "Sage", "pdf_uri": null, "oa_url_match": false, "oa_info": null}, "grobid": {"id": "b9eca5528b3fe02c48beb703f73a87ed79e61ca4", "type": "plain-text", "url": "s3://ai2-s2-pdf-extraction-prod/parse-results/s2orc_worker/2f74f4badc1e34a27e00b645ff91ac5332575f38.txt", "contents": "\nEstimation of Causal Effects via Principal Stratification When Some Outcomes are Truncated by \"Death\"\n\n\nJunni L Zhang \nPeking University\nHarvard University\n\n\nDonald B Rubin \nPeking University\nHarvard University\n\n\nEstimation of Causal Effects via Principal Stratification When Some Outcomes are Truncated by \"Death\"\nboundscausal effectcensoring by deathprincipal stratificationRubin Causal Model\nThe topic of \"truncation by death\" in randomized experiments arises in many fields, such as medicine, economics and education. Traditional approaches addressing this issue ignore the fact that the outcome after the truncation is neither \"censored\" nor \"missing,\" but should be treated as being defined on an extended sample space. Using an educational example to illustrate, we will outline here a formulation for tackling this issue, where we call the outcome \"truncated by death\" because there is no hidden value of the outcome variable masked by the truncating event. We first formulate the principal stratification  approach, and we then derive large sample bounds for causal effects within the principal strata, with or without various identification assumptions. Extensions are then briefly discussed.\n\nIntroduction\n\nData truncated by death arise in many situations, but the simplest motivation occurs with medical studies. Following the example in Rubin (1998Rubin ( , 2000, consider a randomized clinical trial with two drug treatment conditions, a new drug and a traditional drug. The outcome of primary interest is quality of life (QOL) at one year after assignment. The patients in the study are quite ill, and some will die before completion of the study. We are interested in evaluating the causal effects of the drug on QOL as well as on survival. The QOL for those who die is not defined on R (the space of real number), but can be defined as * on the extended space {R, *}, although sometimes it is treated as \"missing\" or \"censored,\" which would imply a hidden value on R. Therefore, we need to \"account for\" survival status (i.e., the possible occurrence of an observed *) when addressing the causal effects on QOL. Since death has often been treated as a censoring mechanism that causes missing data, this problem is often referred to as \"censoring by death\" (e.g., Lin, Robins, & Wei, 1996), although this is not an appropriate way to conceptualize the problem because of censoring implies the masking of a hidden value in the usual sample space.\n\nThe same issue also arises in fields other than medicine, such as in economics and education. Consider a randomized experiment evaluating a job-training program (Lalonde, 1995). To evaluate the social benefit of the training, we want to evaluate the causal effects on the employment rate as well as on wages. Wages, however, are only defined on R for those who are employed, so we need to \"account for\" employment status when addressing the causal effects of the program on wages. Or consider an example in education, where we have an experiment with students randomized into two high school educational programs. We are interested in evaluating the causal effects on final test scores for those who graduate. But some students drop out, and so their final test scores are truncated by death.\n\nTraditional approaches to address the problem of such truncation by death include: (a) comparing those that are not truncated (the survivors) under the two treatment arms, either by direct comparison of means or after regression adjusted for covariates (Decker & Corson, 1995, Kodrzycki, 1997; (b) assuming ignorability (i.e., the missing-data mechanism only depends on the observed data and the parameter for the missing-data mechanism is independent of the parameter for the missing outcomes; see Rubin, 1976) and imputing the outcomes in R that would have been observed if the data for the truncated units had not been truncated by death (McMahon & Harrell Jr., 2001, Lin, McCulloch, & Mayne, 2002; or (c) modeling a nonignorable missing-data mechanism due to \"censoring,\" meaning that the missingness process depends on the values of the \"censored\" outcomes (Wu & Carroll, 1988, Fairclough, Peterson, & Chang, 1998. None of these approaches can address the fundamental difference between truncation by death and these missing data situations-the primary outcome after such truncation is not really censored or missing, it is simply not defined on R; see also, Little and Rubin (2002, Example 1.7). We describe these outcomes as \"truncated by death\" rather than \"censored\" or \"missing,\" because they are \"cut off\" for those who are \"dead.\"\n\nThis article outlines an innovative structure for tackling the problem of causal inference when some outcomes are truncated by death, first suggested in Rubin (1998) and developed first in Zhang (2002). We use the comparison of two high school educational programs as an example, but the same ideas can be applied to comparing two drugs or two job-training programs. Our organization is as follows. In Section 2, we present the main framework. In Section 3, we discuss the various assumptions that can be made to generate tighter inferences about the causal effects. Derivation of large sample bounds is provided in Section 4 without assumptions and in Section 5 with assumptions. Calculation of these bounds is then illustrated in Section 6 for a numerical example. In Section 7, we briefly address extensions, such as when covariates are observed, Bayesian analysis, and clustered randomization (which is likely to be an issue with schools and students, our working example).\n\n\nThe Principal Stratification Framework\n\nConsider the case of two educational programs conducted in a school, called Treatment (T) and Control (C). Assume that no pretreatment covariates are recorded (or we are already within cells defined by a specific value of such covariates). Let N denote the total number of students. For student i, let z i denote the treatment assignment indicator (z i = T if student i would be assigned Treatment and z i for Control). Let z denote the vector of treatment assignment indicators for all N students. Let S i (z) denote the graduation indicator for student i given z [S i (z) = G if student i would graduate from high school given z, and S i (z) = D if student i would drop out given z]. Let Y i (z) denote the final test score for student i given z.\n\nThe outcomes S and Y are called potential outcomes because only one version of them can ever be observed, the version under the assigned treatment vector, Z; the other versions, under unassigned treatments, z ≠ Z, cannot be observed. This problem has been called the fundamental problem of casual interference by Holland (1986), where this framework was called the Rubin Causal Model for a series of articles starting with Rubin (1974).\n\nFor simplicity, we assume that there are no versions of Treatment or Control with different potential S or Y outcomes, otherwise we would have to define potential outcomes corresponding to each version. Also, we assume that there is no interference between the students, which implies that each potential outcome for the ith unit is determined by knowing the treatment that unit received.\n\nAssumption 1 Stable Unit Treatment Value Assumption (SUTVA, see Rubin, 1980).\n• If z i = z′ i , then S i (z) = S i (z′). • If z i = z′ i , then Y i (z) = Y i (z′).\nSUTVA allows us to write S i (z) as S i (z i ), and Y i (z) as Y i (z i ). Therefore, for student i, there are two potential graduation indicators: S i (T ) = G or D denotes the graduation indicator if assigned Treatment, and S i (C) = G or D denotes the analogous graduation indicator if assigned Control. Analogously, for student i, there are two potential final test scores Y i (T ) and Y i (C). Since the final test score is truncated for those who drop out, we let Y i (T ) = * when S i (T ) = D, and Y i (C) = * when S i (C) = D.\n\nThe students can be classified into four groups according to the joint values of the two potential graduation indicators:\n• GG = {i S i (T ) = S i (C ) = G},\nthe students who would graduate under both treatment arms, which comprise a proportion π GG of all students;\n\n• GD = {i  S i (T) = G,S i (C) = D}, the students who would graduate under Treatment but would drop out under Control, which comprise a proportion π GD of all students;\n\n• DG = {i  S i (T) = D, S i (C) = G}, the students who would drop out under Treatment but would graduate under Control, which comprise a proportion π DG of all students;\n\n• DD = {i  S i (T ) = S i (C) = D}, the students who would drop out under both treatment arms, which comprise a proportion π DD of all students. This partition of the students is a direct application of the idea of principal stratification  using the framework of the \"Rubin Causal Model.\"\n\nFor a specific example, suppose Table 1 summarizes the principal strata among the students. The first row indicates that 20% of the students belong to the GG group, and they would graduate with average score 900 under both treatment arms; the second row indicates that 40% of the students belong to the GD group, and they would graduate with average score 600 under Treatment, but they would drop out under Control; etc.\n\nFrom Table 1, we can see that if everyone were assigned Treatment, 60% (= 20% + 40%) would graduate, whereas if everyone were assigned Control, 40% (= 20% + 20%) would graduate. Thus, with respect to graduation, Treatment is superior to Control. For the always-graduates (i.e., the GG group), the Treatment minus Control effect is nil. For members of the GD group or the DG group who would graduate under only one treatment arm, the Treatment minus Control causal effect is undefined on R. Notice, however, that the average score for the GD group under treatment is lower than the average score for the DG group under control, possibly suggesting that the members of the DG group are more talented than those in the GD group, but the Treatment offends them and so they drop out. Now suppose a randomized experiment is conducted with 50% assigned to each program. Then for each principal stratum, 50% will be assigned to Treatment and the other 50% will be assigned to Control. Table 2 summarizes the principal strata, each split by the two values of observed treatment assignment indicator Z i . Now we permute the rows of Table 2, so that they are grouped according to observed treatment assignment indicator Z i and the graduation indicator under the assigned treatment arm S i (Z i ), thereby obtaining Table 3. Notice, however, that we can only observe the outcomes for the participants under the assigned treatment arm-S obs i = S i (Z i ) and Y obs i = Y i (Z i ); we do not observe the principal strata. Table 4 summarizes the observed data. The first row indicates that 30% of the participants are observed to be assigned to Treatment and that they graduate with average score 700. But these subjects are actually a mixture of the GG group and the GD group, as shown in the first two rows of Table 3. Similar explanations apply to the observed data displayed in the other rows of Table 4. \n% Participant Principal stratum S i (T ) - Y i (T) S i (C) - Y i (C) TE on score 20 GG G 900 G 900 0 40 GD G 600 D * * 20 DG D * G 800 * 20 DD D * D * *\nThe naive comparison of those who graduate under Treatment with those who graduate under Control indicates that Treatment decreases the average score by 150 (700 − 850 = −150), despite increasing graduation rate, but this paradoxical result is contradicted by what we see from the reality shown in the first row of Table 1.\n\nTo see better what is going on, it helps to have some more notation. Let I denote the general 0/1 indicator function, I(α) = 1 if α is true and 0 if α is false, where α is any statement. The naive comparison of the average score for the group observed to graduate under Treatment,   \nY T I Z T I S G Y I Z T I S G obs i i obs i obs i i obs ( ) = = ( ) = ( ) = ( ) = ( ) ∑ ∑ , 357\n\nEstimation of Causal Effects via Principal Stratification\nZ i S i (T) - Y i (T) S i (C) - Y i (C) TE on score 10 GG T G 900 G 900 0 10 GG C G 900 G 900 0 20 GD T G 600 D * * 20 GD C G 600 D * * 10 DG T D * G 800 * 10 DG C D * G 800 * 10 DD T D * D * * 10 DD C D * D * * Note. TE =Z i S i (T) - Y i (T) S i (C) - Y i (C ) TE on score 10 GG T G 900 G 900 0 20 GD T G 600 D * * 10 DG T D * G 800 * 10 DD T D * D * * 10 GG C G 900 G 900 0 10 DG C D * G 800 * 20 GD C G 600 D * * 10 DD C D * D * * Note. TE = Treatment effect on final test score.\nwith the average score for the group observed to graduate under Control,\n\nis misleading for inferences about the average causal effects on the final test score if either the GD group or the DG group exists. The reason is that the graduating group under Treatment is a mixture of the GG group and the GD group, and the graduating group under Control is a mixture of the GG group and the DG group, and these therefore involve different combinations of principal strata, and thus different groups of students. Hence, instead of comparing the outcomes under Treatment and under Control for a common set of students, which is a causal inference, we are comparing Treatment outcomes for one set of students and Control outcomes for a different set of students-a descriptive statement but not a causal inference. This same issue of comparing different subgroup of subjects arises with Simpson's paradox (Simpson, 1951, Wainer, 1999. For example, suppose an educational intervention was randomly assigned within males and female students, but with different probabilities so almost all the males were assigned treatment and almost all the females were assigned control. Then a comparison of all observed treatment outcomes with all observed control outcomes is a descriptive, not a causal comparison, essentially of treatment outcomes for males with control outcomes for females. This descriptive comparison could give results opposite to the causal comparisons of treatment and control outcomes within males and females, which would be an example of Simpson's paradox.\n\nIn other words, the naive comparison of -Y obs (T ) with -Y obs (C ) tries to adjust for the observed graduation indicator S obs i = S i (Z i ), which encodes characteristics of student i (e.g., ability) as well as treatment assignment Z i . When estimating causal effects, however, we must adjust only for characteristics of the students that are not affected by treatment assignment (i.e., gender, age, etc). The pair of graduation indicators (S i (T), S i (C)) is not affected by treatment assignment Z i , so the principal strata encode only characteristics of the students, and thus, for causal inference, we may adjust for the principal strata even though we may not adjust for the observed graduation indicator.   Example of Tables 1-3 Treatment Control\n% Participant Z i S i (T ) - Y i (T) S i (C) - Y i (C) 30 T G 700 ? ? 20 T D * ? ? 20 C ? ? G 850 30 C ? ? D *\nAs was suggested in Rubin (1998Rubin ( , 2000, the most meaningful inferences about the causal effects on Y can be drawn only for the GG group, because both Y i (T) and Y i (C) are defined on R only for this group. Thus, the primary causal effect on test scores is formally defined by a comparison of {Y i (T): i ∈ GG} and {Y i (C): i ∈ GG}; the mean causal effect is -Y GG (T) − -Y GG (C), the average difference between Y i (T) and Y i (C) in the GG group.\n\n\nAssumptions That Sharpen Inferences-Monotonicity and Ranked Average Score\n\nAs stated previously, we cannot directly observe the principal strata for the participants. What we can observe are the following four groups based on the observed treatment assignment and the observed graduation indicator: Each student is observed to fall into one of these four groups but also belongs to a latent (unobserved) principal stratum. The data pattern and latent principal strata associated with each observed group are shown in Table 5. We will show in Section 4 that from the observed data, bounds can be found for large sample estimates of the causal effect on Y for the GG group without imposing a parametric model. However, under assumptions that are often plausible in practice, these bounds can be sharpened, as we show in Section 5. We now describe two such assumptions.\n• OBS(T,G ) = {i Z i = T,\nThe first such assumption is monotonicity, analogous to that typically exploited in IV (Instrumental Variables) analyses (e.g., Angrist, Imbens, & Rubin, 1996). This assumption formalizes the notion that the new educational program (or the old one) is not harming any student in the following sense: no student would graduate under 359 \n\n\nEstimation of Causal Effects via Principal Stratification\nOBS(T,G) T G ∈ R GG, GD OBS(T,D) T D * DG, DD OBS(C,G) C G ∈ R GG, DG OBS(C,D) C D * GD, DD\nControl but drop out under Treatment. This assumption can also be formulated the other way around, but usually it is stated in terms of Treatment only improving graduation rate. Notice that it is not satisfied in our example displayed in Table 1.\n\n\nAssumption 1 Monotonicity. There is no DG group.\n\nHowever, in the truncation by death situation, as implied by our choice of example, it is plausible that there are students who would graduate under Treatment but drop out under Control, and students who would drop out under Treatment but graduate under Control. If the GD group exists, OBS(T,G) is a mixture of the GG group and the GD group, and the observed distribution of scores for the OBS(T,G) group is thus a mixture of two distributions. Similarly, if the DG group exists, the observed distribution of scores for the OBS(C,G) group is a mixture of two distributions. The second assumption, which is satisfied by our example, was first proposed in Zhang (2002) and also can help tighten the bounds.\n\nAssumption 2 Ranked average score. When assigned Treatment, the average score for the GG group is no less than that for the GD group, and when assigned Control, the average score for the GG group is no less than that for the DG group.\n\nThis assumption formalizes the notion that the GG group is more capable or has higher motivation than either the GD group or the DG group; the GG group would graduate under either treatment arm, whereas the GD group or the DG group would drop out under one treatment arm. Because ability or motivation may tend to be positively correlated with test scores, Assumption 2 may be plausible in many situations where there exists truncation by death.\n\n\nLarge-Sample Bounds With No Assumptions\n\nWe first consider the situation when neither of the two assumptions in Section 3 is made, and thus the large sample bounds are the widest. The bounds are first obtained for the proportions in each principal stratum.\n\nRecall that among those randomly assigned to Treatment, the OBS(T,G) group graduates, and it is a mixture of the GG group and the GD group. Therefore in large samples we know that The π's also need to add to one, so π GD = 1 − π GG − π DD − π DG . Suppose we knew π DG ; then from Equation 3, and from Equation 2\n\nFrom Equations 5, 6, and 7 we have or From Equations 6 and 7, π DG must be no larger than the smaller of P CG and 1 − P TG . From Equation 8, π DG must be at least as large as (P CG − P TG ) (note that P TG − P CG is the causal effect of Treatment on graduation). Thus Equations 6, 7, and 8 hold for any π DG such that max(0, P CG − P TG ) ≤ π DG ≤ min(P CG , 1 − P TG ). Now consider the means in the observed groups who possibly could be in the GG principal stratum. We begin by assuming that the π's are known; that is, we assume a fixed value of π DG .\n\nLet the observed mean in OBS(T,G) group be -Y TG ; this group is the π GG /(π GG + π GD ) and π GD /(π GG + π GD ) mixture of the GG and GD principal strata. Thus, in large samples, the maximum value of -Y GG (T) is the average value of Y in the π GG /(π GG + π GD ) fraction of the OBS(T,G) group with the largest value of Y. Because from Equations 6 and 8, we can denote this mean of these largest values in OBS(T,G) as -Y TG (max P CG /P TG − π DG /P TG ). Analogously, the minimum value of -Y GG (T ) is the average value of Y in the π GG /(π GG + π GD ) fraction of the OBS(T,G) group with the smallest values of Y, say -Y TG (min P CG /P TG − π DG /P TG ). Analogously, let the mean in the OBS(C,G) group π π π π GG GG GD CG TG DG TG P P P\n+ ( )= − , π π GD TG CG DG P P = − + . ( ) 8 π π π π GD CG GD TG DG DG P P = − − ( )− − − ( )− 1 1 , π π DD TG DG P = − − 1 7 . ( ) π π GG CG DG P = − ,( ) 6\nπ π π π GG GD DG DD\n+ + + = 1 5 ( ) π π GD DD i i obs i i CG I Z C I S D I Z C OBS C D Z C P + = = ( ) = ( ) = ( ) = ( ) = = − ∑ ∑ # , # . ( ) in Assigned 1 4\nbe -Y CG ; this group is the π GG /(π GG + π DG ) and π DG /(π GG + π DG ) mixture of the GG and DG principal strata. Because from Equation 6, in large samples, the maximum value of -Y GG (C) is the average value of Y in the 1 − π DG / P CG fraction of the OBS(C,G) group with the largest values of Y, say -Y CG (max 1 − π DG /P CG ); analogously, the minimum value of -\nY GG (C) is - Y CG (min 1 − π DG /P CG ).\nThus, the average causal effect, where max(0, P CG − P TG ) ≤ π DG ≤ min(P CG , 1 − P TG ).\n- Y GG (T ) − - Y GG (C),\n\nLarge-Sample Bounds With Assumptions\n\nFirst, assume only monotonicity: π DG = 0. This assumption can be made in large samples when P CG ≤ P TG , in which case the lower bound of π DG is 0. From Equations 6, 7 and 8:\n\nand Thus the bounds for the average causal effect on Y in the GG principal stratum are given by expressions (9) and (10) with π DG = 0 . These bounds are given in the second row of Table 6, and are tighter than those given in the first row of Table 6, which apply without monotonicity. \nmin min max , ( ) π π π DG Y P P P Y P TG CG TG DG TG CG DG CG − ( ) − − ( ) [ ] 1 1 1 Y P P P Y P TG CG TG DG TG CG DG CG max min . ( ) − ( ) − − ( ) π π 1 1 0 Y P P P Y P TG CG TG DG TG CG DG CG min max , ( ) − ( ) − − ( ) π π 1 9 π π π π GG GG DG DG CG P + ( )= − 1 ,\nNow consider the ranked average score assumption. Under this assumption, -Y GG (T) achieves its minimum when it equals -Y GD (T); recall that the OBS(T,G) group is a mixture of the GG and GD principal strata; so in this case -\nY TG = - Y GG (T) = - Y GD (T ). Analogously,\n-Y GG (C) achieves its minimum when it equals -Y DG (C) and thus equals -Y CG . Therefore, the average causal effect, -Y GG (T) − -Y GG (C), given π DG is at least and at most\n\nThe third row of Table 6 gives the large sample bounds when assuming only ranked average score. The fourth row of Table 6 gives the bounds when both identifying assumptions in Section 3 are made.\n\n\nLarge Sample Bounds for The Numerical Example\n\nFor illustration, we produce large sample bounds for the numerical example in Section 2. Assume the average values in Table 1 are exact values (i.e., no variance within any cell), and assume there are an infinite number of students. From the observed data in Table 4, we immediately have P TG = 0.6, P CG = 0.4 so if the monotonicity assumption is not made, the bounds for π DG are max(0, P CG − P TG ) ≤ π DG ≤ min(P CG , 1 − P TG ), i.e., 0 ≤ π DG ≤ 0.4. Notice that when π DG = 0.4, π GG = 0, i.e., the GG group may not exist, and if so, neither does a causal effect on Y. We will calculate the bounds assuming the GG group exists. \nY P P P Y TG CG TG DG TG CG max . ( ) − ( ) − π 10 Y Y P TG CG DG CG − − ( ) max , ( ) 1 9 π 363\n\nEstimation of Causal Effects via Principal Stratification\n\n\nYes Yes\n\nNote. The first column shows whether the monotonicity assumption (A1) is made, and the second column shows whether the ranked average score assumption (A2) is made. The last column shows the large sample bounds. In the first and third rows, the maximization and minimization are over max(0, P CG − P TG ) ≤ π DG ≤ min(P CG , 1 − P TG ). In the second and fourth rows, the monotinicity assumption can be made in large samples when P CG ≤ P TG . \n− ( ) − − ( ) [ ] { − ( ) − − ( ) [ ] } { ( ) − ( ) − } { − − ( ) [ ] 1 1 1 π π π DG Y P P P Y Y Y Y P P Y TG CG TG DG CG CG TG CG TG CG TG CG max , max − ( ) [ ] − } − ( ) − { }\nFor any 0 ≤ π DG < 0.4, from the observed data, the mixing proportion of the GG group in the OBS(T,G) group is P CG / P TG − π DG / P TG = −π DG / 0.6. In reality, the OBS(T,G) group is a 1/3 [= 20%/(20% + 40%)] and 2/3 [= 40%/(20% + 40%)] mixture of the GG group with Y i (T ) = 900 and the GD group with Y i (T) = 600. When 0 ≤ π DG < 0.4, the value of − π DG / 0.6 ranges from 0 to , so the − π DG / 0.6 fraction of the OBS(T,G) group with the smallest value of Y all has Y i (T) = 600, and thus\n\nAt the same time, if − π DG / 0.6 ≤ , the − π DG / 0.6 fraction of the OBS(T,G) group with the smallest value of Y all has Y i (T ) = 900; otherwise, this group is a /( − π DG / 0.6) and ( − π DG / 0.6)/( − π DG / 0.6) mixture of those with Y i (T ) = 900 and those with Y i (T ) = 600. So\n\nAnalogously, for any 0 ≤ π DG < 0.4, from the observed data, the mixing proportion of the GG group in the OBS(C,G) group is 1 − π DG /P CG = 1 − π DG / 0.4; in reality, the OBS(C,G) group is a 1/2 and 1/2 mixture of the GG group with Y i (C) = 900 and the DG group with Y i (C) = 800. So we have\n\nWe also have -Y TG = 700 and -Y CG = 850. The bounds shown in Table 6 can then be calculated for the numerical example. Table 7 summarizes these bounds in the four situations according to whether the two assumptions in Section 3 are made. We can see that either assumption sharpens the bounds: the monotonicity assumption sharpens the bounds from [−300, 100] to [−250, −100], the ranked average score assumption sharpens the bounds to [−200, 50], and making both assumptions sharpens the bounds to [−150, −100].\n\nNotice, however, that the monotonicity assumption does not hold in our numerical example, yet we still can obtain bounds making this assumption. In particular, under monotonicity, the bounds imply a negative causal effect in the GG principal stratum, at most −100, even though in fact, the causal effect is zero. This illustrates the danger of making such assumptions when they do not hold. Now we illustrate how our bounds give an answer different from the answer found by a naive analysis that assumes the test scores for those who are observed to drop out are zero rather than *. When zeroes are filled in for the * values in Table 4, the average score under treatment is and the average score under control is and the causal effect for the whole population is estimated to be 420 − 340 = 80. This positive point estimate of causal effect completely misrepresents the reality in the last column of Table 1, where the causal effect is zero for the GG group, and is undefined for the GD, DG, and DD groups. However, our bounds without making incorrectly the monotonicity assumption (i.e., [−300, 100] when the ranked average score assumption is not made, and [−200, 50] when the ranked average score assumption is made), contain the actual causal effect for the GG group.\n\n\nExtensions\n\nIn real studies, covariates are typically recorded. In a completely randomized experiment, although covariates do not enter the treatment assignment mechanism, they can be used to improve efficiency of estimation for two reasons. First, covariates improve prediction of the missing potential outcome test scores, that is, scores under Treatment for those who are assigned Control, and scores under Control for those who are assigned Treatment. Also, covariates can improve prediction of principal strata through prediction of the missing graduation indicators. Thus, covariates allow for more efficient estimation of the causal effect in the GG principal stratum, and can help sharpen the large sample bounds because the bounds as derived are appropriate within each level of the covariates.\n\nFor example, suppose the covariate \"sex of student\" was recorded for everyone in our hypothetical study summarized in Table 1. Then there would be a male and  a female table underlying Table 1  Note. The first column shows whether the monotonicity assumption (A1) is made, and the second column shows whether the ranked average score assumption (A2) is made. The last column shows the bounds for the numerical example of Tables 1-4. bounds could be obtained separately for the male and females and then combined to create bounds for both. Depending on the differences between males and females, these bounds could be substantially sharper than the bounds ignoring sex. Further sharpening of the bounds, beyond that corresponding to the assumptions in Section 3 or that accrues with covariates, comes from Bayesian analysis with specific parametric models. Also, when the number of covariates is large or when we have continuous covariates, the derived bounds with limited sample size are typically not satisfactory, and our preference is to turn to Bayesian analysis.\n\nWith Bayesian analysis, we can obtain posterior intervals for the causal effect in the GG principal stratum even when unique point estimates are not available, in analogy with the approach in Imbens and Rubin (1997) and Hirano, Imbens, Rubin and Zhou (2000). Parametric models, however, are best developed within the context of specific applications, where their approximate validity can be properly assessed scientifically. This activity will be done in other publications. In fact, we have conducted Bayesian analysis for a medical example (Zhang and Rubin, 2003a) and an economics example (Zhang and Rubin, 2003b) with success.\n\nAnother direction for extensions is to allow for clustered randomization, as when the unit of the randomization is the school rather than the student, but truncation by death occurs at the student level. We can deal with clustered designs in a Bayesian way analogous to the approach in Frangakis, Rubin and Zhou (2002) for noncompliance. This extension is the topic of current work.\n\nStill another direction for extensions is to consider some alternatives to the ranked average score assumption, since this assumption is not invariant to monotone transformations of the scores. A stronger assumption, stochastic dominance of the GG group over the GD group and the DG group 1 , leads to the same bounds for the mean causal effect. This will be explored with other definitions of causal effect, such as median causal effect, in future work.\n\nNotes 1 A random variable A is said to be stochastically dominant over another random variable B, if for any real number t, Pr(A ≤ t) ≤ Pr(B ≤ t). This assumption thus assumes that when assigned to Treatment, the score for the GG group is stochastically dominant over the score for the GD group, and when assigned to Control, the score for the GG group is stochastically dominant over the score for the DG group.\n\n=\nG}, the students who are assigned to Treatment and graduate; • OBS(T,D) = {i Z i = T, S obs i = D}, the students who are assigned to Treatment and drop out; • OBS(C,G) = {i  Z i = C, S obs i = G}, the students who are assigned to Control and graduate; • OBS(C,D) = {i Z i = C, S obs i = D}, the students who are assigned to Control and drop out.\n\n\nSimilarly, in the OBS(T,D) group, the OBS(C,G) group and the OBS(C,D) group we have:\n\n\ngiven π DG is at least and at most Thus, the lower bound for -Y GG (T ) − -Y GG (C) is and the upper bound is\n\nTABLE 1\n1Principal Strata among the StudentsTreatment \nControl \n\n\n\nTABLE 2\n2Principal Strata Among the Participants, Each Split by Treatment AssignmentTreatment \nControl \n\n% Participant \nPrincipal stratum \n\n\n\nTreatment effect on final test score for each principal stratum.\n\nTABLE 3\n3Permuted Table for Principal Strata Among the Participants, Each Split by Treatment AssignmentTreatment \nControl \n\n% Participant \nPrincipal stratum \n\n\nTABLE 4\n4Observed Data for the\n\nTABLE 5\n5Group Classification Based on Observed Treatment Assignment and Observed Graduation Indicator OBS(Z, S obs ), and Associated Data Pattern and Possible Latent Principal StrataObserved group, OBS(Z, S obs ) \nZ \nS obs \nY obs \nPossible latent principal strata \n\n\n\nTABLE 6\n6Large Sample Bounds for the Average Causal Effect on Y in the GG Principal StratumA1 \nA2 \n{Lower Bound}, {Upper Bound} \n\nNo \nNo \n\nYes \nNo \n\nNo \nYes \n\n\n\n\n, where these two would total Table 1. However,Estimation of Causal Effects via Principal Stratification340 \n20 \n850 30 \n0 \n20 \n30 \n340 \n% \n% \n% \n% \n, \n× \n+ \n× \n+ \n= \n \n \n \n \n\n420 \n30 \n700 20 \n0 \n30 \n20 \n420 \n% \n% \n% \n% \n, \n× \n+ \n× \n+ \n= \n \n \n \n \n\n365 \n\n\n\nTABLE 7\n7Large Sample Bounds for the Average Causal Effect on Y in the GG Principal Stratum for the NumericalExample of Tables 1-4A1 \nA2 \n[Lower Bound, Upper Bound] \n\nNo \nNo \n[−300, 100] \nYes \nNo \n[−250, −100] \nNo \nYes \n[−200, 50] \nYes \nYes \n[−150, −100] \n\n\nManuscriptReceived June, 2003  Revision Received August, 2003  Accepted August, 2003 \nAuthors\nIdentification of causal effects using instrumental variables (with Discussion). J Angrist, G W Imbens, D B Rubin, Journal of the American Statistical Association. 91Angrist, J., Imbens, G. W., & Rubin, D. B. (1995). Identification of causal effects using instrumental variables (with Discussion). Journal of the American Statistical Association, 91, 444-472.\n\nInternational trade and worker displacement: Evaluation of the trade adjustment assistance program. P T Decker, W Corson, Industrial and Labor Relations Review. 48Decker, P. T., & Corson, W. (1995). International trade and worker displacement: Evalua- tion of the trade adjustment assistance program. Industrial and Labor Relations Review, 48, 758-774.\n\nWhy are missing quality of life data a problem in clinical trials of cancer therapy. D L Fairclough, H F Peterson, V Chang, Statistics in Medicine. 17Fairclough, D. L., Peterson, H. F., & Chang, V. (1998). Why are missing quality of life data a problem in clinical trials of cancer therapy. Statistics in Medicine, 17, 667-677.\n\nThe defining role of principal stratification and effects for comparing treatments adjusted for post-treatment variables: From treatment noncompliance to surrogate endpoints. C E Frangakis, D B Rubin, Biometrics. 58Frangakis, C. E., & Rubin, D. B. (2002). The defining role of principal stratification and effects for comparing treatments adjusted for post-treatment variables: From treatment noncompliance to surrogate endpoints. Biometrics, 58, 191-199.\n\nClustered encouragement designs with individual noncompliance: Bayesian inference with randomization, and application to advanced directive forms. C E Frangakis, D B Rubin, X H Zhou, Biostatistics. 3Frangakis, C. E., Rubin, D. B., & Zhou, X. H. (2002). Clustered encouragement designs with individual noncompliance: Bayesian inference with randomization, and application to advanced directive forms. Biostatistics, 3, 147-164.\n\nAssessing the effect of an influenza vaccine in an encouragement design with covariates. K Hirano, G Imbens, D B Rubin, X H Zhou, Biostatistics. 1Hirano, K., Imbens, G., Rubin, D. B., & Zhou, X. H. (2000). Assessing the effect of an influenza vaccine in an encouragement design with covariates. Biostatistics 1, 69-88.\n\nStatistics and causal inference. P Holland, Journal of the American Statistical Association. 81Holland, P. (1986). Statistics and causal inference. Journal of the American Statistical Asso- ciation, 81, 945-960.\n\nBayesian inference for causal effects in randomized experiments with noncompliance. G Imbens, D B Rubin, The Annals of Statistics. 25Imbens, G., & Rubin, D. B. (1997). Bayesian inference for causal effects in randomized experiments with noncompliance. The Annals of Statistics, 25, 305-327.\n\nTraining programs for displaced workers: What do they accomplish?. Y K Kodrzycki, New England Economic Review. 3Kodrzycki, Y. K. (1997). Training programs for displaced workers: What do they accom- plish? New England Economic Review, 3, 39-59.\n\nThe promise of public sector-sponsored training programs. The Journal of Economic Perspective. R J Lalonde, 9Lalonde, R. J. (1995). The promise of public sector-sponsored training programs. The Jour- nal of Economic Perspective, 9, 149-168.\n\nComparing two failure time distributions in the presence of dependent censoring. D Y Lin, J M Robins, L J Wei, Biometrika. 83Lin, D. Y., Robins, J. M., & Wei L. J. (1996). Comparing two failure time distributions in the presence of dependent censoring. Biometrika, 83, 381-393.\n\nMaximum likelihood estimation in the joint analysis of time-to-event and multiple longitudinal variables. H Lin, C E Mcculloch, S T Mayne, Statistics in Medicine. 21Lin, H., McCulloch, C. E., & Mayne, S. T. (2002). Maximum likelihood estimation in the joint analysis of time-to-event and multiple longitudinal variables. Statistics in Medicine, 21, 2369-2382.\n\nStatistical analysis with missing data. R J A Little, D B Rubin, China Statistics PressNew York; People's Republic of China2nd edLittle, R. J. A., & Rubin, D. B. (2002). Statistical analysis with missing data, 2nd ed. New York: John Wiley and Sons. Translated into Chinese in 2003: China Statistics Press, People's Republic of China.\n\nJoint testing of mortality and a non-fatal outcome in clinical trials. R P Mcmahon, F E HarrellJr, Statistics in Medicine. 20McMahon, R. P., & Harrell Jr., F. E. (2001). Joint testing of mortality and a non-fatal outcome in clinical trials. Statistics in Medicine, 20, 1165-1172.\n\nOn the application of probability theory to agricultural experiments: Essay on principles. J Neyman, Translated in Statistical Science. 5Neyman, J. (1923). On the application of probability theory to agricultural experiments: Essay on principles. Translated in Statistical Science, 5, 465-480.\n\nEstimating causal effects of Treatments in randomized and nonrandomized studies. D B Rubin, Journal of Educational Psychology. 66Rubin, D. B. (1974). Estimating causal effects of Treatments in randomized and non- randomized studies. Journal of Educational Psychology, 66, 688-701.\n\nInference and missing data. D B Rubin, Biometrika. 63Rubin, D. B. (1976). Inference and missing data. Biometrika, 63, 581-592.\n\nBayesian inference for causal effects. D B Rubin, Annals of Statistics. 6Rubin, D. B. (1978). Bayesian inference for causal effects. Annals of Statistics, 6, 34-58.\n\nComment on Randomization analysis of experimental data: The Fisher randomization test by D. D B Rubin, Basu. Journal of the American Statistical Association. 75Rubin, D. B. (1980). Comment on Randomization analysis of experimental data: The Fisher randomization test by D. Basu. Journal of the American Statistical Association, 75, 591-593.\n\nMore powerful randomization-based p-values in double-blind trials with noncompliance. D B Rubin, Statistics in Medicine. D. R. Cox17Rubin, D. B. (1998). More powerful randomization-based p-values in double-blind trials with noncompliance. Statistics in Medicine, 17, 371-385, with discussion by D. R. Cox, 387-389.\n\nDiscussion of Causal inference with counterfactuals by A. P. Dawid. D B Rubin, Journal of the American Statistical Association. 95Rubin, D. B. (2000). Discussion of Causal inference with counterfactuals by A. P. Dawid. Journal of the American Statistical Association, 95, 435-437.\n\nThe interpretation of interaction in contingency tables. E H Simpson, Journal of the Royal Statistical Society B. 13Simpson, E. H. (1951). The interpretation of interaction in contingency tables. Journal of the Royal Statistical Society B, 13, 238-241.\n\nSimpson's paradox. H Wainer, Chance. 122Wainer, H. (1999). Simpson's paradox. Chance, 12(2), 43-44.\n\nEstimation and comparison of changes in the presence of informative right censoring by modeling the censoring process. M C Wu, R J Carroll, Biometrics. 44Wu, M. C., & Carroll, R. J. (1988). Estimation and comparison of changes in the presence of informative right censoring by modeling the censoring process. Biometrics, 44, 175-188.\n\nCausal inference with principal stratification: some theory and applications. Unpublished doctoral dissertation. J L Zhang, Cambridge, MADepartment of Statistics, Harvard UniversityZhang, J. L. (2002). Causal inference with principal stratification: some theory and appli- cations. Unpublished doctoral dissertation, Department of Statistics, Harvard University, Cambridge, MA.\n\nEstimating the causal effects of intervention on quality of life measures. J L Zhang, D B Rubin, 2003-ZR-1Harvard Statistics Department Working Technical ReportZhang, J. L., & Rubin, D. B. (2003a). Estimating the causal effects of intervention on quality of life measures. Harvard Statistics Department Working Technical Report 2003-ZR-1.\n\nEvaluating the effects of training programs on wages with experimental data. J L Zhang, D B Rubin, 2003-ZR-2Harvard Statistics Department Working Technical ReportZhang, J. L., & Rubin, D. B. (2003b). Evaluating the effects of training programs on wages with experimental data. Harvard Statistics Department Working Technical Report 2003-ZR-2.\n", "annotations": {"author": "[{\"end\":158,\"start\":105},{\"end\":213,\"start\":159}]", "publisher": null, "author_last_name": "[{\"end\":118,\"start\":113},{\"end\":173,\"start\":168}]", "author_first_name": "[{\"end\":110,\"start\":105},{\"end\":112,\"start\":111},{\"end\":165,\"start\":159},{\"end\":167,\"start\":166}]", "author_affiliation": "[{\"end\":157,\"start\":120},{\"end\":212,\"start\":175}]", "title": "[{\"end\":102,\"start\":1},{\"end\":315,\"start\":214}]", "venue": null, "abstract": "[{\"end\":1203,\"start\":396}]", "bib_ref": "[{\"attributes\":{\"ref_id\":\"b19\"},\"end\":1362,\"start\":1351},{\"attributes\":{\"ref_id\":\"b20\"},\"end\":1376,\"start\":1362},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":2306,\"start\":2281},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":2640,\"start\":2625},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":3533,\"start\":3511},{\"attributes\":{\"ref_id\":\"b8\"},\"end\":3550,\"start\":3533},{\"attributes\":{\"ref_id\":\"b16\"},\"end\":3769,\"start\":3757},{\"attributes\":{\"ref_id\":\"b13\"},\"end\":3927,\"start\":3899},{\"attributes\":{\"ref_id\":\"b11\"},\"end\":3958,\"start\":3927},{\"attributes\":{\"ref_id\":\"b23\"},\"end\":4139,\"start\":4120},{\"attributes\":{\"ref_id\":\"b2\"},\"end\":4176,\"start\":4139},{\"end\":4458,\"start\":4422},{\"attributes\":{\"ref_id\":\"b19\"},\"end\":4767,\"start\":4755},{\"attributes\":{\"ref_id\":\"b24\"},\"end\":4803,\"start\":4791},{\"attributes\":{\"ref_id\":\"b6\"},\"end\":6699,\"start\":6685},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":6807,\"start\":6795},{\"attributes\":{\"ref_id\":\"b18\"},\"end\":7276,\"start\":7264},{\"attributes\":{\"ref_id\":\"b21\"},\"end\":13436,\"start\":13422},{\"attributes\":{\"ref_id\":\"b22\"},\"end\":13450,\"start\":13436},{\"attributes\":{\"ref_id\":\"b19\"},\"end\":14992,\"start\":14981},{\"attributes\":{\"ref_id\":\"b20\"},\"end\":15006,\"start\":14992},{\"end\":16475,\"start\":16444},{\"attributes\":{\"ref_id\":\"b24\"},\"end\":17771,\"start\":17759},{\"end\":25583,\"start\":25571},{\"end\":25654,\"start\":25644},{\"end\":25719,\"start\":25707},{\"end\":26892,\"start\":26882},{\"attributes\":{\"ref_id\":\"b7\"},\"end\":29086,\"start\":29063},{\"attributes\":{\"ref_id\":\"b5\"},\"end\":29128,\"start\":29091},{\"attributes\":{\"ref_id\":\"b25\"},\"end\":29437,\"start\":29413},{\"attributes\":{\"ref_id\":\"b26\"},\"end\":29487,\"start\":29463},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":29821,\"start\":29800}]", "figure": "[{\"attributes\":{\"id\":\"fig_1\"},\"end\":31107,\"start\":30756},{\"attributes\":{\"id\":\"fig_2\"},\"end\":31194,\"start\":31108},{\"attributes\":{\"id\":\"fig_3\"},\"end\":31306,\"start\":31195},{\"attributes\":{\"id\":\"tab_0\",\"type\":\"table\"},\"end\":31373,\"start\":31307},{\"attributes\":{\"id\":\"tab_1\",\"type\":\"table\"},\"end\":31514,\"start\":31374},{\"attributes\":{\"id\":\"tab_2\",\"type\":\"table\"},\"end\":31581,\"start\":31515},{\"attributes\":{\"id\":\"tab_3\",\"type\":\"table\"},\"end\":31741,\"start\":31582},{\"attributes\":{\"id\":\"tab_4\",\"type\":\"table\"},\"end\":31773,\"start\":31742},{\"attributes\":{\"id\":\"tab_5\",\"type\":\"table\"},\"end\":32042,\"start\":31774},{\"attributes\":{\"id\":\"tab_6\",\"type\":\"table\"},\"end\":32203,\"start\":32043},{\"attributes\":{\"id\":\"tab_8\",\"type\":\"table\"},\"end\":32468,\"start\":32204},{\"attributes\":{\"id\":\"tab_9\",\"type\":\"table\"},\"end\":32727,\"start\":32469}]", "paragraph": "[{\"end\":2462,\"start\":1219},{\"end\":3256,\"start\":2464},{\"end\":4600,\"start\":3258},{\"end\":5579,\"start\":4602},{\"end\":6370,\"start\":5622},{\"end\":6808,\"start\":6372},{\"end\":7198,\"start\":6810},{\"end\":7277,\"start\":7200},{\"end\":7899,\"start\":7364},{\"end\":8022,\"start\":7901},{\"end\":8168,\"start\":8060},{\"end\":8339,\"start\":8170},{\"end\":8511,\"start\":8341},{\"end\":8803,\"start\":8513},{\"end\":9225,\"start\":8805},{\"end\":11124,\"start\":9227},{\"end\":11601,\"start\":11278},{\"end\":11886,\"start\":11603},{\"end\":12598,\"start\":12526},{\"end\":14087,\"start\":12600},{\"end\":14849,\"start\":14089},{\"end\":15419,\"start\":14961},{\"end\":16288,\"start\":15497},{\"end\":16652,\"start\":16316},{\"end\":17051,\"start\":16805},{\"end\":17809,\"start\":17104},{\"end\":18045,\"start\":17811},{\"end\":18492,\"start\":18047},{\"end\":18751,\"start\":18536},{\"end\":19065,\"start\":18753},{\"end\":19623,\"start\":19067},{\"end\":20372,\"start\":19625},{\"end\":20550,\"start\":20531},{\"end\":21061,\"start\":20690},{\"end\":21196,\"start\":21105},{\"end\":21439,\"start\":21262},{\"end\":21727,\"start\":21441},{\"end\":22225,\"start\":21999},{\"end\":22447,\"start\":22272},{\"end\":22644,\"start\":22449},{\"end\":23329,\"start\":22694},{\"end\":23941,\"start\":23497},{\"end\":24619,\"start\":24121},{\"end\":24910,\"start\":24621},{\"end\":25207,\"start\":24912},{\"end\":25720,\"start\":25209},{\"end\":26994,\"start\":25722},{\"end\":27800,\"start\":27009},{\"end\":28869,\"start\":27802},{\"end\":29501,\"start\":28871},{\"end\":29885,\"start\":29503},{\"end\":30341,\"start\":29887},{\"end\":30755,\"start\":30343}]", "formula": "[{\"attributes\":{\"id\":\"formula_0\"},\"end\":7363,\"start\":7278},{\"attributes\":{\"id\":\"formula_1\"},\"end\":8059,\"start\":8023},{\"attributes\":{\"id\":\"formula_2\"},\"end\":11277,\"start\":11125},{\"attributes\":{\"id\":\"formula_3\"},\"end\":11982,\"start\":11887},{\"attributes\":{\"id\":\"formula_4\"},\"end\":12264,\"start\":12042},{\"attributes\":{\"id\":\"formula_5\"},\"end\":12525,\"start\":12264},{\"attributes\":{\"id\":\"formula_6\"},\"end\":14960,\"start\":14850},{\"attributes\":{\"id\":\"formula_7\"},\"end\":16315,\"start\":16289},{\"attributes\":{\"id\":\"formula_8\"},\"end\":16804,\"start\":16713},{\"attributes\":{\"id\":\"formula_9\"},\"end\":20530,\"start\":20373},{\"attributes\":{\"id\":\"formula_10\"},\"end\":20689,\"start\":20551},{\"attributes\":{\"id\":\"formula_11\"},\"end\":21104,\"start\":21062},{\"attributes\":{\"id\":\"formula_12\"},\"end\":21222,\"start\":21197},{\"attributes\":{\"id\":\"formula_13\"},\"end\":21998,\"start\":21728},{\"attributes\":{\"id\":\"formula_14\"},\"end\":22271,\"start\":22226},{\"attributes\":{\"id\":\"formula_15\"},\"end\":23426,\"start\":23330},{\"attributes\":{\"id\":\"formula_16\"},\"end\":24120,\"start\":23942}]", "table_ref": "[{\"attributes\":{\"ref_id\":\"tab_0\"},\"end\":8844,\"start\":8837},{\"attributes\":{\"ref_id\":\"tab_0\"},\"end\":9239,\"start\":9232},{\"attributes\":{\"ref_id\":\"tab_1\"},\"end\":10211,\"start\":10204},{\"attributes\":{\"ref_id\":\"tab_1\"},\"end\":10357,\"start\":10350},{\"attributes\":{\"ref_id\":\"tab_3\"},\"end\":10540,\"start\":10533},{\"attributes\":{\"ref_id\":\"tab_4\"},\"end\":10745,\"start\":10738},{\"attributes\":{\"ref_id\":\"tab_3\"},\"end\":11034,\"start\":11027},{\"attributes\":{\"ref_id\":\"tab_4\"},\"end\":11122,\"start\":11115},{\"attributes\":{\"ref_id\":\"tab_0\"},\"end\":11600,\"start\":11593},{\"attributes\":{\"ref_id\":\"tab_0\"},\"end\":14831,\"start\":14810},{\"attributes\":{\"ref_id\":\"tab_5\"},\"end\":15946,\"start\":15939},{\"attributes\":{\"ref_id\":\"tab_0\"},\"end\":17050,\"start\":17043},{\"attributes\":{\"ref_id\":\"tab_6\"},\"end\":21629,\"start\":21622},{\"attributes\":{\"ref_id\":\"tab_6\"},\"end\":21691,\"start\":21684},{\"attributes\":{\"ref_id\":\"tab_6\"},\"end\":22473,\"start\":22466},{\"attributes\":{\"ref_id\":\"tab_6\"},\"end\":22570,\"start\":22563},{\"attributes\":{\"ref_id\":\"tab_0\"},\"end\":22819,\"start\":22812},{\"attributes\":{\"ref_id\":\"tab_4\"},\"end\":22960,\"start\":22953},{\"attributes\":{\"ref_id\":\"tab_6\"},\"end\":25278,\"start\":25271},{\"attributes\":{\"ref_id\":\"tab_9\"},\"end\":25336,\"start\":25329},{\"attributes\":{\"ref_id\":\"tab_4\"},\"end\":26358,\"start\":26351},{\"attributes\":{\"ref_id\":\"tab_0\"},\"end\":26630,\"start\":26623},{\"attributes\":{\"ref_id\":\"tab_0\"},\"end\":27994,\"start\":27920},{\"attributes\":{\"ref_id\":\"tab_0\"},\"end\":28234,\"start\":28223}]", "section_header": "[{\"attributes\":{\"n\":\"1.\"},\"end\":1217,\"start\":1205},{\"attributes\":{\"n\":\"2.\"},\"end\":5620,\"start\":5582},{\"end\":12041,\"start\":11984},{\"attributes\":{\"n\":\"3.\"},\"end\":15495,\"start\":15422},{\"end\":16712,\"start\":16655},{\"end\":17102,\"start\":17054},{\"attributes\":{\"n\":\"4.\"},\"end\":18534,\"start\":18495},{\"attributes\":{\"n\":\"5.\"},\"end\":21260,\"start\":21224},{\"attributes\":{\"n\":\"6.\"},\"end\":22692,\"start\":22647},{\"end\":23485,\"start\":23428},{\"end\":23495,\"start\":23488},{\"attributes\":{\"n\":\"7.\"},\"end\":27007,\"start\":26997},{\"end\":30758,\"start\":30757},{\"end\":31315,\"start\":31308},{\"end\":31382,\"start\":31375},{\"end\":31590,\"start\":31583},{\"end\":31750,\"start\":31743},{\"end\":31782,\"start\":31775},{\"end\":32051,\"start\":32044},{\"end\":32477,\"start\":32470}]", "table": "[{\"end\":31373,\"start\":31352},{\"end\":31514,\"start\":31459},{\"end\":31741,\"start\":31686},{\"end\":32042,\"start\":31958},{\"end\":32203,\"start\":32135},{\"end\":32468,\"start\":32310},{\"end\":32727,\"start\":32600}]", "figure_caption": "[{\"end\":31107,\"start\":30759},{\"end\":31194,\"start\":31110},{\"end\":31306,\"start\":31197},{\"end\":31352,\"start\":31317},{\"end\":31459,\"start\":31384},{\"end\":31581,\"start\":31517},{\"end\":31686,\"start\":31592},{\"end\":31773,\"start\":31752},{\"end\":31958,\"start\":31784},{\"end\":32135,\"start\":32053},{\"end\":32310,\"start\":32206},{\"end\":32600,\"start\":32479}]", "figure_ref": null, "bib_author_first_name": "[{\"end\":32904,\"start\":32903},{\"end\":32915,\"start\":32914},{\"end\":32917,\"start\":32916},{\"end\":32927,\"start\":32926},{\"end\":32929,\"start\":32928},{\"end\":33284,\"start\":33283},{\"end\":33286,\"start\":33285},{\"end\":33296,\"start\":33295},{\"end\":33623,\"start\":33622},{\"end\":33625,\"start\":33624},{\"end\":33639,\"start\":33638},{\"end\":33641,\"start\":33640},{\"end\":33653,\"start\":33652},{\"end\":34042,\"start\":34041},{\"end\":34044,\"start\":34043},{\"end\":34057,\"start\":34056},{\"end\":34059,\"start\":34058},{\"end\":34471,\"start\":34470},{\"end\":34473,\"start\":34472},{\"end\":34486,\"start\":34485},{\"end\":34488,\"start\":34487},{\"end\":34497,\"start\":34496},{\"end\":34499,\"start\":34498},{\"end\":34841,\"start\":34840},{\"end\":34851,\"start\":34850},{\"end\":34861,\"start\":34860},{\"end\":34863,\"start\":34862},{\"end\":34872,\"start\":34871},{\"end\":34874,\"start\":34873},{\"end\":35105,\"start\":35104},{\"end\":35369,\"start\":35368},{\"end\":35379,\"start\":35378},{\"end\":35381,\"start\":35380},{\"end\":35644,\"start\":35643},{\"end\":35646,\"start\":35645},{\"end\":35917,\"start\":35916},{\"end\":35919,\"start\":35918},{\"end\":36145,\"start\":36144},{\"end\":36147,\"start\":36146},{\"end\":36154,\"start\":36153},{\"end\":36156,\"start\":36155},{\"end\":36166,\"start\":36165},{\"end\":36168,\"start\":36167},{\"end\":36449,\"start\":36448},{\"end\":36456,\"start\":36455},{\"end\":36458,\"start\":36457},{\"end\":36471,\"start\":36470},{\"end\":36473,\"start\":36472},{\"end\":36744,\"start\":36743},{\"end\":36748,\"start\":36745},{\"end\":36758,\"start\":36757},{\"end\":36760,\"start\":36759},{\"end\":37110,\"start\":37109},{\"end\":37112,\"start\":37111},{\"end\":37123,\"start\":37122},{\"end\":37125,\"start\":37124},{\"end\":37411,\"start\":37410},{\"end\":37696,\"start\":37695},{\"end\":37698,\"start\":37697},{\"end\":37925,\"start\":37924},{\"end\":37927,\"start\":37926},{\"end\":38064,\"start\":38063},{\"end\":38066,\"start\":38065},{\"end\":38283,\"start\":38282},{\"end\":38285,\"start\":38284},{\"end\":38619,\"start\":38618},{\"end\":38621,\"start\":38620},{\"end\":38917,\"start\":38916},{\"end\":38919,\"start\":38918},{\"end\":39188,\"start\":39187},{\"end\":39190,\"start\":39189},{\"end\":39404,\"start\":39403},{\"end\":39605,\"start\":39604},{\"end\":39607,\"start\":39606},{\"end\":39613,\"start\":39612},{\"end\":39615,\"start\":39614},{\"end\":39934,\"start\":39933},{\"end\":39936,\"start\":39935},{\"end\":40275,\"start\":40274},{\"end\":40277,\"start\":40276},{\"end\":40286,\"start\":40285},{\"end\":40288,\"start\":40287},{\"end\":40617,\"start\":40616},{\"end\":40619,\"start\":40618},{\"end\":40628,\"start\":40627},{\"end\":40630,\"start\":40629}]", "bib_author_last_name": "[{\"end\":32912,\"start\":32905},{\"end\":32924,\"start\":32918},{\"end\":32935,\"start\":32930},{\"end\":33293,\"start\":33287},{\"end\":33303,\"start\":33297},{\"end\":33636,\"start\":33626},{\"end\":33650,\"start\":33642},{\"end\":33659,\"start\":33654},{\"end\":34054,\"start\":34045},{\"end\":34065,\"start\":34060},{\"end\":34483,\"start\":34474},{\"end\":34494,\"start\":34489},{\"end\":34504,\"start\":34500},{\"end\":34848,\"start\":34842},{\"end\":34858,\"start\":34852},{\"end\":34869,\"start\":34864},{\"end\":34879,\"start\":34875},{\"end\":35113,\"start\":35106},{\"end\":35376,\"start\":35370},{\"end\":35387,\"start\":35382},{\"end\":35656,\"start\":35647},{\"end\":35927,\"start\":35920},{\"end\":36151,\"start\":36148},{\"end\":36163,\"start\":36157},{\"end\":36172,\"start\":36169},{\"end\":36453,\"start\":36450},{\"end\":36468,\"start\":36459},{\"end\":36479,\"start\":36474},{\"end\":36755,\"start\":36749},{\"end\":36766,\"start\":36761},{\"end\":37120,\"start\":37113},{\"end\":37133,\"start\":37126},{\"end\":37418,\"start\":37412},{\"end\":37704,\"start\":37699},{\"end\":37933,\"start\":37928},{\"end\":38072,\"start\":38067},{\"end\":38291,\"start\":38286},{\"end\":38627,\"start\":38622},{\"end\":38925,\"start\":38920},{\"end\":39198,\"start\":39191},{\"end\":39411,\"start\":39405},{\"end\":39610,\"start\":39608},{\"end\":39623,\"start\":39616},{\"end\":39942,\"start\":39937},{\"end\":40283,\"start\":40278},{\"end\":40294,\"start\":40289},{\"end\":40625,\"start\":40620},{\"end\":40636,\"start\":40631}]", "bib_entry": "[{\"attributes\":{\"id\":\"b0\",\"matched_paper_id\":8705497},\"end\":33181,\"start\":32822},{\"attributes\":{\"id\":\"b1\",\"matched_paper_id\":154560293},\"end\":33535,\"start\":33183},{\"attributes\":{\"id\":\"b2\",\"matched_paper_id\":44308164},\"end\":33864,\"start\":33537},{\"attributes\":{\"id\":\"b3\"},\"end\":34321,\"start\":33866},{\"attributes\":{\"id\":\"b4\",\"matched_paper_id\":18856666},\"end\":34749,\"start\":34323},{\"attributes\":{\"id\":\"b5\",\"matched_paper_id\":37548306},\"end\":35069,\"start\":34751},{\"attributes\":{\"id\":\"b6\",\"matched_paper_id\":14377504},\"end\":35282,\"start\":35071},{\"attributes\":{\"id\":\"b7\",\"matched_paper_id\":121884636},\"end\":35574,\"start\":35284},{\"attributes\":{\"id\":\"b8\",\"matched_paper_id\":15501252},\"end\":35819,\"start\":35576},{\"attributes\":{\"id\":\"b9\"},\"end\":36061,\"start\":35821},{\"attributes\":{\"id\":\"b10\",\"matched_paper_id\":123682126},\"end\":36340,\"start\":36063},{\"attributes\":{\"id\":\"b11\",\"matched_paper_id\":42746169},\"end\":36701,\"start\":36342},{\"attributes\":{\"id\":\"b12\"},\"end\":37036,\"start\":36703},{\"attributes\":{\"id\":\"b13\",\"matched_paper_id\":10219962},\"end\":37317,\"start\":37038},{\"attributes\":{\"id\":\"b14\",\"matched_paper_id\":117499250},\"end\":37612,\"start\":37319},{\"attributes\":{\"id\":\"b15\",\"matched_paper_id\":52832751},\"end\":37894,\"start\":37614},{\"attributes\":{\"id\":\"b16\",\"matched_paper_id\":120971461},\"end\":38022,\"start\":37896},{\"attributes\":{\"id\":\"b17\",\"matched_paper_id\":118441719},\"end\":38188,\"start\":38024},{\"attributes\":{\"id\":\"b18\"},\"end\":38530,\"start\":38190},{\"attributes\":{\"id\":\"b19\",\"matched_paper_id\":24473151},\"end\":38846,\"start\":38532},{\"attributes\":{\"id\":\"b20\",\"matched_paper_id\":124724995},\"end\":39128,\"start\":38848},{\"attributes\":{\"id\":\"b21\",\"matched_paper_id\":125419902},\"end\":39382,\"start\":39130},{\"attributes\":{\"id\":\"b22\",\"matched_paper_id\":5201902},\"end\":39483,\"start\":39384},{\"attributes\":{\"id\":\"b23\",\"matched_paper_id\":121710598},\"end\":39818,\"start\":39485},{\"attributes\":{\"id\":\"b24\"},\"end\":40197,\"start\":39820},{\"attributes\":{\"doi\":\"2003-ZR-1\",\"id\":\"b25\"},\"end\":40537,\"start\":40199},{\"attributes\":{\"doi\":\"2003-ZR-2\",\"id\":\"b26\"},\"end\":40881,\"start\":40539}]", "bib_title": "[{\"end\":32901,\"start\":32822},{\"end\":33281,\"start\":33183},{\"end\":33620,\"start\":33537},{\"end\":34039,\"start\":33866},{\"end\":34468,\"start\":34323},{\"end\":34838,\"start\":34751},{\"end\":35102,\"start\":35071},{\"end\":35366,\"start\":35284},{\"end\":35641,\"start\":35576},{\"end\":36142,\"start\":36063},{\"end\":36446,\"start\":36342},{\"end\":37107,\"start\":37038},{\"end\":37408,\"start\":37319},{\"end\":37693,\"start\":37614},{\"end\":37922,\"start\":37896},{\"end\":38061,\"start\":38024},{\"end\":38280,\"start\":38190},{\"end\":38616,\"start\":38532},{\"end\":38914,\"start\":38848},{\"end\":39185,\"start\":39130},{\"end\":39401,\"start\":39384},{\"end\":39602,\"start\":39485}]", "bib_author": "[{\"end\":32914,\"start\":32903},{\"end\":32926,\"start\":32914},{\"end\":32937,\"start\":32926},{\"end\":33295,\"start\":33283},{\"end\":33305,\"start\":33295},{\"end\":33638,\"start\":33622},{\"end\":33652,\"start\":33638},{\"end\":33661,\"start\":33652},{\"end\":34056,\"start\":34041},{\"end\":34067,\"start\":34056},{\"end\":34485,\"start\":34470},{\"end\":34496,\"start\":34485},{\"end\":34506,\"start\":34496},{\"end\":34850,\"start\":34840},{\"end\":34860,\"start\":34850},{\"end\":34871,\"start\":34860},{\"end\":34881,\"start\":34871},{\"end\":35115,\"start\":35104},{\"end\":35378,\"start\":35368},{\"end\":35389,\"start\":35378},{\"end\":35658,\"start\":35643},{\"end\":35929,\"start\":35916},{\"end\":36153,\"start\":36144},{\"end\":36165,\"start\":36153},{\"end\":36174,\"start\":36165},{\"end\":36455,\"start\":36448},{\"end\":36470,\"start\":36455},{\"end\":36481,\"start\":36470},{\"end\":36757,\"start\":36743},{\"end\":36768,\"start\":36757},{\"end\":37122,\"start\":37109},{\"end\":37137,\"start\":37122},{\"end\":37420,\"start\":37410},{\"end\":37706,\"start\":37695},{\"end\":37935,\"start\":37924},{\"end\":38074,\"start\":38063},{\"end\":38293,\"start\":38282},{\"end\":38629,\"start\":38618},{\"end\":38927,\"start\":38916},{\"end\":39200,\"start\":39187},{\"end\":39413,\"start\":39403},{\"end\":39612,\"start\":39604},{\"end\":39625,\"start\":39612},{\"end\":39944,\"start\":39933},{\"end\":40285,\"start\":40274},{\"end\":40296,\"start\":40285},{\"end\":40627,\"start\":40616},{\"end\":40638,\"start\":40627}]", "bib_venue": "[{\"end\":32984,\"start\":32937},{\"end\":33342,\"start\":33305},{\"end\":33683,\"start\":33661},{\"end\":34077,\"start\":34067},{\"end\":34519,\"start\":34506},{\"end\":34894,\"start\":34881},{\"end\":35162,\"start\":35115},{\"end\":35413,\"start\":35389},{\"end\":35685,\"start\":35658},{\"end\":35914,\"start\":35821},{\"end\":36184,\"start\":36174},{\"end\":36503,\"start\":36481},{\"end\":36741,\"start\":36703},{\"end\":37159,\"start\":37137},{\"end\":37453,\"start\":37420},{\"end\":37739,\"start\":37706},{\"end\":37945,\"start\":37935},{\"end\":38094,\"start\":38074},{\"end\":38346,\"start\":38293},{\"end\":38651,\"start\":38629},{\"end\":38974,\"start\":38927},{\"end\":39242,\"start\":39200},{\"end\":39419,\"start\":39413},{\"end\":39635,\"start\":39625},{\"end\":39931,\"start\":39820},{\"end\":40272,\"start\":40199},{\"end\":40614,\"start\":40539}]"}}}, "year": 2023, "month": 12, "day": 17}