{"id": 14293406, "updated": "2023-10-24 16:34:49.267", "metadata": {"title": "The Geography of Transport Systems", "authors": "[{\"first\":\"Jean-Paul\",\"last\":\"Rodrigue\",\"middle\":[]},{\"first\":\"Claude\",\"last\":\"Comtois\",\"middle\":[]}]", "venue": "Choice Reviews Online", "journal": "Choice Reviews Online", "publication_date": {"year": 2006, "month": null, "day": null}, "abstract": "This book is a nice synthesis of concepts, methods, conventional as well as contemporary issues related to transport geography. The companion website of the book \" Transport Geography on the Web \" was initiated in 1997 to provide online educational materials of this discipline. Based on the impressive popularity this online tutorial has gained over the last ten years, the authors continued to develop it into the present book. The book's ten chapters are well illustrated with informative data, figures, and tables, which can be further organized in four parts. Chapters 1-3 comprising the first part discuss the spatial and economic nature of transport systems, setting out background and framework for the book. Chapter 1 takes a holistic view of transport geography as related to other disciplines, and introduces the definition, concepts and dimensions of this interdisciplinary field. A retrospect of the evolution of transport systems is also provided. Chapter 2 examines transportation systems as networks in their commercial environment, and elaborates the relationship between transport supply and demand. Chapter 3 investigates how transport systems are related to economic development, spatial organization and location factors. The second part introduces two essential components of transport systems: transportation modes and terminals. Based on an overview of major transport modes, Chapter 4 discusses both modal competition and cooperation (\" intermodalism \").", "fields_of_study": "[\"Geography\"]", "external_ids": {"arxiv": null, "mag": "1485881041", "acl": null, "pubmed": null, "pubmedcentral": null, "dblp": null, "doi": "10.5860/choice.44-1075"}}, "content": {"source": {"pdf_hash": "5d358c1721a69da37ccb34e4219bdf80f50c7fb6", "pdf_src": "MergedPDFExtraction", "pdf_uri": null, "oa_url_match": false, "oa_info": {"license": null, "open_access_url": null, "status": "CLOSED"}}, "grobid": {"id": "acab4e83e0844cb16b3eda6745f28217158fe205", "type": "plain-text", "url": "s3://ai2-s2-pdf-extraction-prod/parse-results/s2orc_worker/5d358c1721a69da37ccb34e4219bdf80f50c7fb6.txt", "contents": "\nCross-cultural variations in predictors of life satisfaction: perspectives from needs and values\nPrinceton University PressCopyright Princeton University Press1968. 1977. 1999\n\nG Hardin \nS Oishi \nE F Diener \nR E Lucas \nE M Suh \nCross-cultural variations in predictors of life satisfaction: perspectives from needs and values\n\nPersonality and Social Psychology Bulletin\nPrinceton, NJPrinceton University Press1621968. 1977. 1999BOOK REVIEWS 999 Eurobarometer (2007) Attitudes on issues related to EU Energy Policy. European Commission, Brussels.\n\n\nReferences\n\nEurobarometer (2007)  Transport geography is in the ascendant, both as a specialist topic and as a research area informing wider policy concerns. The advent of globalisation has emphasised the role of transport as a driver of the world economy as never before, whilst the quest for sustainable development has brought a growing awareness of the environmental and social implications of our efforts to overcome space. It is little wonder that transport geography occupies increasing attention on academic curricula. From one perspective, The Geography of Transport Systems is very much a textbook. Its origins can be seen in the accompanying Internet resource of the same name, which supplies datasets and maps that can be used to supplement the book. This website has been iteratively revised and expanded over the 10 years of its existence. The book The Geography of Transport Systems is therefore not simply based on the website: it is based on an appreciation of the learning process resulting from the authors' interactions with a wide range of students, educators, practitioners and policy-makers.\n\nThe distinctive language of 'public transit' and 'the automobile' shows that, as with many transport geography materials, both the book and the website originate in North America. However, this does not weigh heavily on the reader or limit the accessibility of the content. Examples are drawn readily from Europe and Asia, and the authors succeed in their ambition to refl ect global as well as regional and local issues. Another striking characteristic of The Geography of Transport Systems is that absolutely no assumptions are made about the reader's familiarity with technical terminology. In addition to the thorough glossary at the end of the book, knowledge is never taken for granted within the body of the text and the language of fl ows, chains, connectivity and accessibility is precisely defi ned. Similarly, although each of the 10 chapters covers an impressive range of information within a short space, structure and presentation are so well considered that dense content can be easily absorbed. The written matrial is further reinforced by the effective and frequent use of diagrams.\n\nHowever, the most distinctive feature of the book is the considerable effort made in marrying theoretical and practical learning. The balance between the two is carefully maintained throughout. With the exception of the conclusion, each chapter takes a twintrack approach, including both conceptual and methodological sub-sections relating to its theme. The methods introduced range from basic tools such as linear programming or supply and demand functions, to more complex ideas including gravity modelling and geographical information systems for technology applications (GIS-T).\n\nThe specifically urban component of the book is presented in chapter 7, which deals with urban transport. One of the longer chapters, its theoretical component comprises four different concepts. First, the relationship between transport and urban form is explored, looking at how the spatial imprint of trans-port shapes the city, given varying geographical, historical and socioeconomic circumstances. A typology of urban spatial structures links to discussions of travel time, sprawl, core and peripheral activities. This leads smoothly on to the second concept, which covers urban land use and transport. Here, familiarity with a range of urban land use models is established before the discussion moves on to the role of movements and transport networks as signifi cant components in urban dynamics. The third concept, that of urban mobility, integrates socioeconomics with the practicalities of the accessibility, convergence and integration of different transit systems. The fi nal concept in this section concerns urban transport problems. As before, social, environmental and economic issues are integrated with logistical concerns as the authors summarise the transport problems which freight, consumer and commuter traffi c present for urban areas-along with the frank statement that the dominance of the automobile is linked with most dimensions of the urban transport problem.\n\nTwo sections on methods accompany the urban transport conceptual track. The first focuses upon traffi c counts and traffi c surveys, including notes on sample size, bias and underreporting of trips. The second introduces various types of transport/land use models and gives an insight into the availability and limitations of data needed for the modelling process.\n\nHowever, this particular chapter does not exhaust the appeal of the book to the urban geographer. The opening chapters provide essential background on the signifi cance and analysis of spatial networks and systems. Acknowledging the origins of transport geography as a sub-discipline of economics, the economic ramifications of connectivity are woven into the text from the beginning.\n\nThese links between urbanisation and the economy are more clearly drawn in chapter 3, which discusses the economic and spatial structures of transport systems. Gentrifi cation appears along with suburbanisation and the 'edge cities' of exurbanisation, in a classifi cation of the significant forces shaping urban development. The negative socioeconomic impacts of transport-which often loom largest in an urban context-are also raised; cost differences due to poor accessibility are discussed along with mobility gaps, congestion and accidents. The introduction of the city as a regional economic driver is particularly relevant to contemporary concern with globalisation and city-competitiveness. Central place theory, growth poles and transport corridors are presented as conceptual models explaining transport urban systems and regional development and the chapter notes socioeconomic environment along with site and accessibility as important locational factors.\n\nReaders interested in the role of the city within wider structures will also fi nd chapter 6 relevant. It concentrates on international and regional transport, grounding the reader in the concepts of nodes, fl ows and networks. As always, the logistical aspects of transport are not dealt with in isolation. Later in the book, chapter 8 is devoted to the environmental impacts of mobility, raising issues including climate change and sustainability, whilst providing an introduction to environmental impact assessment in the relevant methods section.\n\nThe penultimate chapter focuses on transport planning and policy-vital background for those concerned with improving the liveability of cities. Necessarily, this section has a strongly rationalist perspective, although the significance of problem defi nition in the policy process and the challenges of implementation are presented for consideration. In particular, the diffi culty of pricing externalities, the practical problems with collecting these costs and, perhaps most importantly, the issue of political risk inherent in imposing charges receive attention.\n\nFinally, the conclusion reviews some of the major issues facing transport geography. Having spent nine chapters providing the reader with tools, here the authors leave open the questions they raise. Instead, we are invited to survey the extent of research methods, both qualitative and quantitative, which can be brought to bear on today's transport problems and consider the role of the geographer.\n\nContemporary urbanism is as much outwardas inward-looking: the city is positioned within regional, national and global contexts. The Geography of Transport Systems successfully reflects this diversity of perspectives. The authors' understanding of connectivity in its most inclusive sense is demonstrated by the integration of socioeconomic and environmental awareness with their topic-one which could easily be diminished by a purely technocratic approach. Rodrigue, Comtois and Slack have produced a valuable overview of the challenges facing contemporary transport systems suitable for practitioners in a range of related fi elds as well as a concise and comprehensive introduction to transport geography for an undergraduate audience.\n\n\nJulie Clark\n\n\nDepartment of Urban Studies\n\nUniversity of Glasgow\n\n\nAttitudes on issues related to EU Energy Policy. European Commission, Brussels. Hardin, G. (1968) The tragedy of the commons, Science, 162, pp. 1243-1248. Inglehart, R. (1977) The Silent Revolution: Changing Values and Political Styles among Western Publics. Princeton, NJ: Princeton University Press. Oishi, S., Diener, E. F., Lucas, R. E. and Suh, E. M.(1999) Cross-cultural variations in predictors \nof life satisfaction: perspectives from needs and \nvalues, Personality and Social Psychology Bulletin, \n25, pp. 980-990. \n\nThe Geography of Transport Systems \nJean-Paul Rodrigue, Claude Comtois and \nBrian Slack, 2006 \nLondon: Routledge \n284 pp. £24.99 paperback; no price given, \nhardback; no price given, ebook \nISBN 0 415 35441 2 paperback; \n0 415 35440 4 hardback; 0 203 00111 7 ebook \n\n\n", "annotations": {"author": "[{\"end\":187,\"start\":178},{\"end\":196,\"start\":188},{\"end\":208,\"start\":197},{\"end\":219,\"start\":209},{\"end\":228,\"start\":220}]", "publisher": "[{\"end\":124,\"start\":98},{\"end\":409,\"start\":383}]", "author_last_name": "[{\"end\":186,\"start\":180},{\"end\":195,\"start\":190},{\"end\":207,\"start\":201},{\"end\":218,\"start\":213},{\"end\":227,\"start\":224}]", "author_first_name": "[{\"end\":179,\"start\":178},{\"end\":189,\"start\":188},{\"end\":198,\"start\":197},{\"end\":200,\"start\":199},{\"end\":210,\"start\":209},{\"end\":212,\"start\":211},{\"end\":221,\"start\":220},{\"end\":223,\"start\":222}]", "author_affiliation": null, "title": "[{\"end\":97,\"start\":1},{\"end\":325,\"start\":229}]", "venue": "[{\"end\":369,\"start\":327}]", "abstract": null, "bib_ref": null, "figure": "[{\"attributes\":{\"id\":\"tab_0\",\"type\":\"table\"},\"end\":9580,\"start\":8785}]", "paragraph": "[{\"end\":1662,\"start\":560},{\"end\":2763,\"start\":1664},{\"end\":3347,\"start\":2765},{\"end\":4737,\"start\":3349},{\"end\":5103,\"start\":4739},{\"end\":5489,\"start\":5105},{\"end\":6457,\"start\":5491},{\"end\":7009,\"start\":6459},{\"end\":7576,\"start\":7011},{\"end\":7977,\"start\":7578},{\"end\":8717,\"start\":7979},{\"end\":8784,\"start\":8763}]", "formula": null, "table_ref": null, "section_header": "[{\"end\":558,\"start\":548},{\"end\":8731,\"start\":8720},{\"end\":8761,\"start\":8734}]", "table": "[{\"end\":9580,\"start\":9142}]", "figure_caption": "[{\"end\":9142,\"start\":8787}]", "figure_ref": null, "bib_author_first_name": null, "bib_author_last_name": null, "bib_entry": null, "bib_title": null, "bib_author": null, "bib_venue": null}}}, "year": 2023, "month": 12, "day": 17}