{"id": 143653771, "updated": "2022-02-17 22:24:57.311", "metadata": {"title": "The Effect of Race/Ethnicity on Sentencing: Examining Sentence Type, Jail Length, and Prison Length", "authors": "[{\"first\":\"Kareem\",\"last\":\"Jordan\",\"middle\":[\"L.\"]},{\"first\":\"Tina\",\"last\":\"Freiburger\",\"middle\":[\"L.\"]}]", "venue": null, "journal": "Journal of Ethnicity in Criminal Justice", "publication_date": {"year": 2015, "month": null, "day": null}, "abstract": "The purpose of this research was to examine the impact of race/ethnicity on criminal sentencing outcomes. The findings from prior studies tend to be mixed on this issue. Using 4 years of data from the State Court Processing Statistics (2000, 2002, 2004, and 2006) and propensity score matching, we examined the impact of race/ethnicity on sentencing outcomes among Blacks, Hispanics, and Whites. The findings suggest that racial/ethnic biases occur in the sentence type (community sanction, jail, or prison) and jail length decisions though not in the prison length decision. It is important to separate jail length and prison length when examining incarceration time. Combining the 2 distinct sentences may confound the true impact of factors on these outcomes.", "fields_of_study": "[\"Psychology\"]", "external_ids": {"arxiv": null, "mag": "1975982181", "acl": null, "pubmed": null, "pubmedcentral": null, "dblp": null, "doi": "10.1080/15377938.2014.984045"}}, "content": {"source": {"pdf_hash": "6f084d790bb27224bd237a1b464ea8696b15ed9a", "pdf_src": "TaylorAndFrancis", "pdf_uri": null, "oa_url_match": false, "oa_info": null}, "grobid": {"id": "87d511d8338e9da31492ccc7391e68416918f28f", "type": "plain-text", "url": "s3://ai2-s2-pdf-extraction-prod/parse-results/s2orc_worker/6f084d790bb27224bd237a1b464ea8696b15ed9a.txt", "contents": "\nThe Effect of Race/Ethnicity on Sentencing: Examining Sentence Type, Jail Length, and Prison Length\n2015\n\nKareem L Jordan \nTina L Freiburger \n\nSchool of Criminology and Justice Studies\nDepartment of Criminal Justice\nUniversity of Massachusetts Lowell\nLowellMassachusettsUSA\n\n\nSchool of Criminology and Justice Studies\nUniversity of Wisconsin-Milwaukee\nMilwaukeeWisconsinUSA\n\n\nUniversity of Massachusetts Lowell\n113 Wilder Street, HSSB 4th Floor01854LowellMA\n\nThe Effect of Race/Ethnicity on Sentencing: Examining Sentence Type, Jail Length, and Prison Length\n\nJournal of Ethnicity in Criminal Justice\n13201510.1080/15377938.2014.984045\n\n\nTHEORETICAL FOUNDATION\n\nThe focal concerns perspective, developed by Steffensmeier and colleagues (Steffensmeier, 1980;Steffensmeier et al., 1998), offers a theoretical understanding of how race and ethnicity affect sentencing decisions. This perspective contends that when making decisions, judges consider the three focal concerns of blameworthiness, dangerousness to the community, and practical constraints and concerns. Blameworthiness is assessed through such legal variables as offense severity and prior record. Variables such as type of offense (e.g., personal or property), employment status, and use of a weapon are used to signify a defendant's level of dangerousness to the community. Practical constraints and concerns include both organizational and individual factors. Organizational factors include such things as adequate correctional space and court case flow. Individual factors include factors that determine a defendant's ability to serve time incarcerated, such as family and community responsibilities.\n\nBecause judges must often make decisions with limited time and lacking the complete information necessary to accurately assess an offender's dangerousness, they develop a \"perceptual shorthand\" to make decisions (Hawkins, 1981, p. 230). This perceptual shorthand is based on stereotypes that are evoked from extralegal factors such as race, ethnicity, gender, and age. This leads to defendants who meet the stereotypical image of a dangerous offender being sentenced more harshly. This particularly disadvantages males, Blacks, Hispanics, and younger offenders, as they are more often associated with crime-prone groups (Kennedy, 1997;Steffensmeier et al., 1998). Prior research finding that Black and Hispanic young men are treated more harshly has attributed this finding to the focal concerns perspectives and to judges viewing Black and Hispanic defendants as more dangerous and blameworthy (e.g., Spohn & Sample, 2013;Steffensmeier & Demuth, 2000).\n\n\nLITERATURE REVIEW\n\nIn/Out Decision Spohn and Holleran (2000) examined the effects of race and ethnicity in Chicago, Miami, and Kansas City. In Chicago, Black and Hispanic defendants had significantly higher odds of incarceration than White defendants. Hispanic defendants had significantly higher odds of incarceration than White defendants in Miami. No difference was found in odds of incarceration for White and Black defendants. Similarly, Black and White defendants' odds of incarceration were not significantly different in Kansas City (Hispanics were not included in the Kansas City analysis). Steffensmeier and Demuth (2006) utilized State Court Processing Statistics data from 1990-1996 to examine the effects of race and ethnicity on sentencing decisions. Their analysis indicated that Black and Hispanic defendants were more likely than White defendants to be incarcerated. There was no significant difference in odds of incarceration between Black and Hispanic defendants. Steffensmeier andDemuth (2000, 2001) found similar findings in early studies with federal sentencing data (Steffensmeier & Demuth, 2000) and with Pennsylvania state court data from 1991-1994(Steffensmeier & Demuth, 2001 in regard to the treatment of Whites relative to Hispanic defendants; both studies found that Hispanic defendants had higher odds of incarceration than White defendants. With both of these studies, however, Hispanics also had higher odds of incarceration than Black defendants.\n\nIn their examination of felony drug offenders in North Carolina, Brennan and Spohn (2008) examined the effects of race and ethnicity on a defendant's odds of receiving a community sanction, an intermediate sanction, or incarceration. They found that Hispanic defendants were treated more harshly than White and Black defendants. White defendants were the most likely to receive a community sanction. When comparing the odds of receiving a community sanction versus an intermediate sanction and the odds of receiving a community sanction versus incarceration, they found no difference between Black and Hispanic defendants. Hispanic defendants did, however, have significantly higher odds of receiving a sentence of incarceration versus an intermediate sanction than White and Black defendants.\n\n\nProbation, Jail, or Prison\n\nThe majority of research on the effects of race and ethnicity on sentencing utilizes the in/out decision to examine disparities between defendants who are sentenced to a punishment that does not include incarceration and defendants who are sentenced to terms of incarceration. Other studies, however, have shown that racial and ethnic variations exist across probation, jail, and prison (Freiburger & Hilinski, 2013;Harrington & Spohn, 2007;Holleran & Spohn, 2004). Holleran and Spohn (2004) found that White defendants were more likely than Hispanic defendants to receive a sentence of probation than jail. When comparing Black and Hispanic defendants, they found that Black defendants were more likely to receive probation than prison. There were no differences between Black and Hispanic defendants in the decision between probation and jail. Harrington and Spohn (2007) also found that the effects of race varied by probation, jail, and prison. Their analysis from a midwestern court found that compared to Whites, Black defendants were more likely to receive jail than probation. In an urban Michigan county, Freiburger and Hilinski (2013) found similar results for probation and jail, with Black defendants having greater odds of receiving jail over probation than White defendants. When examining the decision to sentence a defendant to jail or prison, Harrington and Spohn found that White defendants were more likely than Black defendants to receive a prison sentence, although Freiburger and Hilinski found that race did not have a significant impact. Neither study (Freiburger & Hilinski, 2013;Harrington & Spohn, 2007) examined the treatment of Hispanic defendants.\n\n\nSentence Length\n\nThe effect of race and ethnicity on the sentence length decision has produced mixed findings. For race, some researchers have found that Black defendants are incarcerated for longer periods than White defendants (Feldmeyer & Ulmer, 2011;Spohn & Holleran, 2000;Steffensmeier et al., 1998). Steffensmeier and Demuth (2006), however, did not find a significant difference between the sentence lengths White and Black defendants received, but they found that Hispanic defendants received significantly longer sentences than White defendants. Contrary to their findings, Feldmeyer and Ulmer (2011) found that in federal court White and Hispanic defendants received sentences that were similar in length. Spohn and Holleran (2000) did not find a significant difference across all three groups (Hispanic, White, and Black defendants) in the length of the sentence defendants received in the three jurisdictions examined (Chicago, Miami, and Kansas City).\n\nRecent research has also separately examined lengths of sentences for jail and prison. Using State Court Processing Statistics data, Wang, Mears, Spohn, and Dario (2013) found that race did not impact the length of the sentence to either jail or prison regardless of whether a state had nonguideline, voluntary guideline, or presumptive sentencing guidelines. Freiburger and Hilinski (2013) similarly found no race differences in the length of incarceration term in either jail or prison for felony defendants in Michigan.\n\n\nRace/Ethnicity and Selection Bias\n\nRecently, Bales and Piquero (2012) utilized matching methods to compare those who received sentences of incarceration and those who did not receive sentences of incarceration to overcome sample selection bias. Their analysis of criminal cases in Florida examined whether racial and ethnic disparities existed in the decision to incarcerate an offender. Racial and ethnic effects on odds of incarceration were first assessed using standard logistic regression models. The data were then reanalyzed to examine the effects of race and ethnicity using precision modeling.\n\nThe results from the logistic regression models indicated that Black defendants were significantly more likely to receive a sentence of incarceration than White defendants. This effect remained after all controls were added to the model. Hispanic defendants, however, had significantly lower odds of receiving a sentence of incarceration than White defendants. Once controls for the court circuit in which the case was sentenced were included, however, the effect changed direction, and Hispanic defendants had higher odds of incarceration than White defendants.\n\nWhen precision modeling was used, the finding that Black defendants were more likely to be incarcerated than White defendants was sustained, with Black defendants 8.5% more likely to be incarcerated than White defendants. Once all of the variables were added to the precision model, Hispanic defendants were 10.2% less likely to be incarcerated than White defendants. Although Bales and Piquero's (2012) results indicated that standard regression models and precision matching models yield the same results, their study was limited to Florida. As they mentioned, these results may not be representative of other states. They also suggested that future research consider differences for the jail versus prison decision and for the sentence length decision. The current study responds to these suggestions by examining data from 57 counties and examining the probation/jail/prison decision as well as the sentence length decision.\n\n\nCONTRIBUTIONS OF THE CURRENT STUDY\n\nSeveral limitations of prior research were addressed in the current study. First, most studies have examined sentencing decisions in a single state or jurisdiction (e.g., Freiburger & Hilinski, 2013;Harrington & Spohn, 2007;Holleran & Spohn, 2004;Brennan & Spohn, 2008;Steffensmeier & Demuth, 2001). This limits the generalizability of the results to other settings outside of the samples' geographies. Second, most studies have included a total incarceration dependent variable (see Freiburger & Hilinski, 2013;Harrington, 2008;Wang et al., 2013, for exceptions). Prior research has found that combining jail and prison into an overall measure of incarceration length may mask (or create) significant effects, given that the two sanctions are substantively distinct sentences (Harrington, 2008). The current study addressed this limitation by treating jail and prison incarceration lengths as their own dependent variables. Finally, most studies have used traditional methods of controlling for extraneous factors through entering those variables in multivariate models (see Bales & Piquero, 2012, for a notable exception). Traditional regression assumes linearity between the covariates and the outcome. However, several factors (e.g., age) have been shown to have a nonlinear effect on sentencing outcomes (e.g., Steffensmeier et al., 1998). In addition, estimating race effects in sentencing research using traditional regression models may introduce significant bias into the results (Baumer, 2013). Therefore, to minimize the impact of these potential issues, we used PSM. This matching procedure addressed this concern because it created pairs that were matched on observed covariates, meaning that it did not rely on the linearity assumption (Zanutto, 2006).\n\n\nMETHOD\n\nThe data for this study were obtained from the Inter-University Consortium for Political and Social Research as part of State Court Processing Statistics: Felony Defendants in Large Urban Counties (study 2038), collected by the Bureau of Justice Statistics. The data for this study comprised 4 years, 2000, 2002, 2004, and 2006, representing 57 counties. 1 In selecting the counties to be included in the sample, a two-stage design was used. During Stage 1, the nation's largest counties were selected. During Stage 2, a systematic sample of state court felony filings within each county was selected. The data included felony court filings in each year during the month of May. The data set included a weighting variable (included in the subsequent analyses) that allowed the data to represent all felony filings in the month of May for the counties. Each defendant charged with murder was tracked for a maximum of 2 years, whereas the remaining offenders were tracked for a maximum of 1 year. Because we examined sentencing decisions, only convicted offenders were part of the analysis. The final initial sample size of convicted offenders was 34,364 (10,884 Whites, 14,444 Blacks, and 9,036 Hispanics). There were some data missing within this data set, ranging from 0.1% to 11.7%. 2 Consistent with prior research, multiple imputation was utilized to address this issue (Fox & Swatt, 2009;Rubin, 1987;Schafer & Graham, 2002). PSM PSM is a procedure that minimizes the effect of group differences. Observed characteristics are used to create a score (ranging from 0 to 1) that indicates each person's probability of being included in a particular group. The propensity score is then used to create a matched sample. In essence, the propensity score is a balancing score of observed covariates, meaning the distribution of the covariates is the same for the treatment and comparison groups. Direct comparisons can then be made between the two groups on particular outcomes central to the research. PSM is one method of improving on the biases that can result from utilizing traditional regression modeling of case-level race and sentencing data (Baumer, 2013;Berk, Li, & Hickman, 2005).\n\nIn order to obtain the propensity score, the first step was to include variables in the models that have been shown to empirically and/or theoretically distinguish between races/ethnicities in sentencing outcomes. Ten covariates were included in the model. The covariates were age at arrest, gender (male = 1, female = 0), number of prior convictions, number of prior felony convictions, number of prior misdemeanor convictions, pretrial release (released = 1, not released = 0), type of attorney (public defender = 1, non-public defender = 0), plea bargain (plea bargain = 1, trial = 0), conviction offense (measured by 16 dummy-coded conviction offenses), 3 and year of the case. All covariates have been shown to be theoretically and/or empirically related to sentencing outcomes, and each was measured in ways consistent with prior research, especially those using State Court Processing Statistics data (Bushway & Piehl, 2007;Demuth & Steffensmeier, 2004;Fearn, 2005;Steffensmeier & Demuth, 2006;Wang & Mears, 2010).\n\nIt is common to use t-tests to establish balance in the covariates between two groups. However, research strongly suggests that t-test scores alone can be misleading because of statistical significance being partially influenced by the sample size (Austin, 2008;Loughran et al., 2010;Rosenbaum & Rubin, 1985). Therefore, an additional step in determining covariate imbalance is to calculate the average difference in means as a percentage of the average standard deviation. The standardized absolute percentage difference is based on the means and is not influenced by the unit of measurement or the sample size. The following formula is used to calculate standardized absolute differences in percentages (Loughran et al., 2010;Rosenbaum & Rubin, 1985):\n100(X t − X c S 2 t +S 2 c 2 1/2,\nwhere X t and X c are the means for the treatment and control groups, respectively; and S 2 t and S 2 c are the variances. Rosenbaum and Rubin (1985) stated that a standardized absolute bias equal to or greater than 20% is an indication of imbalance.\n\nThe psmatch2 command in Stata 12.0 was utilized with nonreplacement and a caliper of .01 to create the matched pairs. The result of this procedure allowed for propensity scores to be used as a way of matching two racial/ethnic groups at a 1:1 ratio. PSM was effective in this study because it successfully created matched pairs for each set of analyses. In other words, the matching procedure resulted in all of the observed covariates being balanced.\n\n\nDependent Variables\n\nThere were three dependent variables in this research, with each representing a different aspect of sentencing. The first dependent variable was sentence type. Judges have multiple sentencing options available regarding convicted offenders. They can sentence offenders to a community sentence (e.g., probation, fine, restitution), county jail, or state prison. Therefore, these options were captured in the measure of sentence type: jail (39.1%), prison (31.6%), and a community sentence (29.3%), with jail being used as the reference category in the analyses. The second and third dependent variables referred to the sentence lengths of the incarcerated offenders. Although some research measures incarceration length by including both jail and prison offenders in one overall measure (e.g., Ulmer & Johnson, 2004), given that jail and prison are two distinct sentences, they should be separated in examining confinement time (e.g., Freiburger & Hilinski, 2013;Harrington, 2008). Therefore, the second dependent variable was jail sentence length among those offenders who were sentenced to jail. The third dependent variable was prison sentence length among those offenders who were sentenced to prison. For both jail and prison, incarceration length was measured continuously in months. Because the final two variables were skewed, they were transformed through taking their natural logs.\n\n\nANALYSIS\n\nAlthough there were two levels of data (i.e., county and individual), multilevel analyses were not appropriate. The Heckman two-step procedure was used for two dependent variables (jail length and prison length) in order to correct for the selection bias in examining only incarcerated offenders. When this procedure is used, ordinary least squares (OLS; individual level) is the appropriate analysis (Bushway, Johnson, & Slocum, 2007). Therefore, instead of incorrectly using the correction term with multilevel analyses, we appropriately utilized OLS regression as the appropriate method of estimation. Using OLS for data with multiple levels has been done in prior research (e.g., Crow & Bales, 2006;Steffensmeier et al., 1998) when using the selection bias correction, including when using State Court Processing Statistics data (Steffensmeier & Demuth, 2006). In order to be consistent across levels of analyses (i.e., individual-level analyses), we used multinomial logistic regression for the first dependent variable because it was categorical (Mernard, 2002). The tables detailing the descriptive statistics and matching results for each sample and dependent variable are not included here because of space considerations, but they are available on request.\n\n\nRESULTS\n\n\nSentence Type\n\nThe initial sample sizes for the Black/White sample were 10,884 White offenders and 14,444 Black offenders. However, the PSM procedure resulted in a matched sample of 10,023 in each group. Although no covariates had a standardized percentage bias of at least 20% prior to the matching, the matching procedure further reduced the bias, resulting in a sample that was balanced on the observed covariates.\n\nThe initial sample sizes for the Hispanic/White sample were 10,884 White offenders and 9,036 Hispanic offenders. Following the PSM process, a matched sample of 7,407 for each group was created. Two variables were out of balance before matching: gender and age. However, after PSM, balance was achieved with all of the variables.\n\nThe initial sample sizes for the Black/Hispanic sample were 14,444 Black offenders and 9,036 Hispanic offenders. The PSM procedure resulted in 8,288 matched pairs. Two variables were out of balance before matching: number of prior convictions and number of prior felony convictions. After the matching procedure, balance was fully achieved.\n\nThe impact of race/ethnicity on sentence type is presented in Table 1. Black offenders were less likely than White offenders to be sentenced to a community sanction but significantly more likely to be sentenced to prison. In other words, Black offenders were more likely than White offenders to be sentenced to jail rather than probation and prison rather than jail. In addition, Hispanic offenders were less likely than White offenders to be sentenced to a community sanction than jail, but there was no significant difference between these two groups in the prison versus jail decision. Finally, Hispanic offenders were less likely than Black offenders to be sentenced to both a community sanction and prison (compared to jail). In other words, it appears that when judges were making the decision between jail and community sanctions, there was a negative bias against Hispanic offenders. However, when they were making the decision between jail and prison, the harsher sanction was toward Black offenders. 4\n\n\nIncarceration Length\n\nAs mentioned earlier, it is important to separate both jail and prison in terms of incarceration length because they are two substantively distinct sentences.\n\nIn the original White/Black sample, there were 4,142 White offenders sentenced to jail and 5,221 Black offenders. After the matching procedure, there were 3,663 in each group. In the prematched sample, one variable was out of balance: number of prior felony convictions. After the PSM procedure, each variable had a reduction in the standardized bias, resulting in a balanced sample. In the initial White/Hispanic sample, there were 4,142 White offenders and 4,027 Hispanic offenders. The PSM procedure created a matched sample of 2,993 offenders in each group. Prior to the matching process, gender and age were not in balance for this sample. However, the PSM procedure achieved balance for all of the variables.\n\nIn the initial Black/Hispanic sample, there were 5,221 Black offenders and 4,027 Hispanic offenders. The PSM procedure resulted in 3,162 successfully matched pairs. Prior to matching, four covariates were not in balance: age, number of prior convictions, number of prior felony convictions, and number of prior misdemeanor convictions. However, the matching procedure was able to balance all covariates by reducing the standardized biases.\n\nThe results for jail confinement time are presented in Table 2. The findings indicated that there was no significant difference in jail incarceration length between Black and White offenders. 5 In other words, there was similar jail confinement time between these two groups. However, Hispanic offenders were sentenced to less confinement time than White offenders. In other words, there appears to have been a favorable view toward Hispanic offenders regarding this specific sentencing decision. Finally, Hispanic offenders were sentenced to shorter jail time than Black offenders.\n\nThe final analyses included only those offenders who were sentenced to prison. In the initial White/Black sample of those sentenced to prison, there were 3,073 White offenders and 5,011 Black offenders. After matching, there were 2,925 offenders in each group. Although no variables had standardized biases above 20%, the PSM procedure further reduced the biases, resulting in groups that are balanced on observed covariates.\n\nIn the initial White/Hispanic sample of those sentenced to prison, there were 3,073 White offenders and 2,857 Hispanic offenders. Following PSM, there were 2,187 offenders in each group. Prior to matching, several covariates were out of balance: gender, age, and the number of prior felony convictions. Following the matching procedure, though, all variables were balanced on the observed covariates. Finally, in the original Black/Hispanic sample, there were 5,011 Black offenders and 2,857 Hispanic offenders. The PSM procedure produced 2,586 successfully matched pairs. Prior to matching, there were two covariates that were out of balance: number of felony convictions and motor vehicle theft. After the matching procedure, all covariates were successfully balanced. Table 3 shows the impact of race/ethnicity on prison incarceration length. The results indicated that Black offenders and White offenders did not differ significantly in terms of confinement time. 6 In addition, there was no significant difference between Hispanic offenders and White offenders. Stated differently, Black offenders and Hispanic offenders were sentenced to similar prison confinement time as White offenders. Finally, there was no significant difference in prison sentence length between Black offenders and Hispanic offenders. In other words, all racial/ethnic groups were treated similarly regarding prison lengths.\n\n\nDISCUSSION AND CONCLUSION\n\nThe findings from this study are consistent with some research but not fully consistent with other studies. Contrary to Freiburger and Hilinski (2013) and Harrington and Spohn (2007), Black offenders were not more likely than White offenders to receive jail versus a community sanction. Black offenders did, however, receive more punitive sentencing outcomes in the decision to sentence defendants to jail or prison. This finding is also inconsistent with Freiburger and Hilinski, who found no racial difference in the jail versus prison decision; and Harrington and Spohn, who found that White offenders were more likely to receive prison versus jail than Black offenders. This finding is consistent, however, with the focal concerns perspective, which suggests that Black offenders are viewed as more blameworthy and dangerous than other groups, resulting in the harsher sentencing (Steffensmeier, 1980;Steffensmeier et al., 1998).\n\nThe findings also suggest adverse sentencing outcomes for Hispanic offenders in the decision to sentence a defendant to jail as opposed to probation. This is consistent with prior arguments that Hispanic offenders, like Black offenders, are viewed as more threatening and dangerous to communities (e.g., Spohn & Holleran, 2000;Steffensmeier & Demuth, 2000). It is further possible that this finding can be explained by the practical constraints focal concern. Depending on the communities in which courts are located, views on defendants' abilities to serve time incarcerated might vary. At the individual level, variations might also exist with a defendant's ties to the community. If defendants are of Hispanic origin, they may be viewed as having less informal social controls in place, which can decrease their chances of being successful on community supervision. This may be especially true if the defendant is not a legal citizen and is unable to provide documentation of employment. Although this information was not available in the data used for the current study, future research should examine these possibilities.\n\nThe results from this research strongly point to the need to separate jail and prison incarceration lengths. Although prior research found racial differences in the total incarceration variable (combined jail and prison; Feldmeyer & Ulmer, 2011;Spohn & Holleran, 2000;Steffensmeier et al., 1998), the research suggests that those findings may not hold when each sanction is examined separately (e.g., Freiburger & Hilinski, 2013;Harrington, 2008;Wang et al., 2013). We, however, found some racial influence when examining jail incarceration length, resulting in a bias against both Black and White offenders compared to Hispanic offenders. Although White offenders are generally sentenced less harshly than the other two racial/ethnic groups, those who are sentenced to jail are given longer confinement times than Hispanic offenders. It is possible that judges are sentencing White offenders to longer periods of incarceration to jail to correct for the leniency they receive during the community sanction versus jail decision. In other words, judges may sentence White offenders to community sanctions when possible, but when a sentence of jail is necessary for a White defendant, they punish that defendant with a harsher sentence.\n\nIn terms of prison time, all racial/ethnic groups were treated similarly. Again, if this research had examined total incarceration time, as opposed to separating jail and prison, we would not have been able to conclude the potential bias against Black and White offenders (compared to Hispanic offenders) in terms of jail time and the apparent similarity in treatment with prison time. Therefore, although the jail length findings are not consistent with the limited prior research that separated the sentences, the prison length findings are consistent with those same studies (Freiburger & Hilinski, 2013;Wang et al., 2013).\n\nThe findings from this study suggest that at least one extralegal factor (i.e., race/ethnicity) influences sentencing decisions. Although sentencing is presumed to be based on legal factors (e.g., offense severity and type, prior record), it seems that biases continue to exist, resulting in negative outcomes for various racial/ethnic groups. Many state legislatures have made attempts to reduce biases in sentencing through incorporating written guidelines (Engen, Gainey, Crutchfield, & Weis, 2003). However, in spite of those guidelines, disparities continue to exist even after legal factors are statistically controlled.\n\nMany sentencing guidelines are focused more on state prison sentences but less on local sanctions (e.g., community sentences and jail; Engen et al., 2003). Therefore, it makes sense that racial/ethnic differences do not appear to be present for prison length. It may be, then, that judges are allowing biases to influence their decision making at the local level where they have more discretion (e.g., jail length or sentence type). Although sentencing guidelines limit the ability of judges to tailor sentences to specific offenders and circumstances, the findings from the current study suggest that race/ethnic neutrality has been achieved regarding prison confinement time. It may be worth considering for states to provide similar written guidelines for all sentencing, including sentence type and jail confinement time. One barrier, however, to this implication is that judges must be sensitive to issues at the local level that greatly impact jail and community sentencing decisions, such as jail overcrowding, availability of community resources, and so on.\n\n\nLimitations\n\nAlthough PSM balances on observed covariates, there were a number of covariates that were not accounted for in this study (e.g., victim injury, defendants' ties to the community) that likely influenced sentencing outcomes. It is possible that including these variables may have influenced the race/ethnicity effects that were observed in the analyses. Subsequent research should address this issue through incorporating these variables.\n\nAnother limitation of this study is that only three racial/ethnic groups were included because of sample sizes. Although this limitation tends to be consistent in the literature, there is a fairly small knowledge base regarding the sentencing experiences (or possible biases) of other groups (e.g., Native Americans, Asians). Future research should make a strong attempt to include additional racial/ethnic groups among the samples examined.\n\nThe study is also limited in that it did not contain controls for possible differences across the different court jurisdictions. Mixed findings across previous studies may be due to the social and community context in which sentencing decisions are being made. It is important, therefore, that future research also consider the stereotypical images and biases that are present in the community in which the court resides.\n\n\nConclusions and Future Research\n\nThe current study examined racial and ethnic disparities in the decision to sentence defendants to probation, jail, or prison using the focal concerns perspective. The findings suggest that subsequent research should continue separating jail and prison sentences when examining incarceration length, given that a total incarceration measure may confound the true impact of race on these outcomes. Findings of racial disparity also indicate that past efforts to eliminate these disparities have not been successful, and additional efforts are needed. NOTES 1. Because of space limitations, we do not list the 57 counties in this article. However, the names of the counties are available on request.\n\n2. The following 10 variables had missing values at these percentages: age (1.1%), gender (0.1%), race/ethnicity (2.5%), prior convictions (3.4%), prior felony convictions (3.2%), pretrial release (2.3%), attorney type (11.7%), conviction offense (0.4%), jail incarceration length (1%), and prison incarceration length (0.2%).\n\n3. The 16 conviction offenses were drug sales (reference category), murder, rape, robbery, assault, other violent offense, burglary, larceny/theft, motor vehicle theft, forgery, fraud, other property, other drug, weapon, drive related, and other public order.\n\n4. It should be remembered that the sample was balanced on all of the covariates in the final matched pairs. Therefore, there was no need to include the covariates in the multinomial regression analyses. However, we did enter the covariates into the models in order to ensure that the race/ethnicity results were similar. The race/ethnicity findings were similar, and those full models can be obtained on request.\n\n5. Similar to the first model, because the covariates were balanced in the final matched pairs, there was no need to include them in the OLS regression model. However, we did so to ensure similarity of the race/ethnicity finding. The effects of Black and Hispanic in the current models were the same as in the full models. In addition, the results from this model included a selection bias correction using the Heckman two-step command in STATA. All of the covariates (including race/ethnicity) were used to model the incarceration decision, and the subsequent Mills ratio was used as an independent variable in the subsequent OLS regression analyses. All of these findings are available on request.\n\n6. Similar to the prior two models, because the covariates were balanced in the final matched pairs, there was no need to include them in the OLS regression model. However, we did so to ensure similarity of the race/ethnicity finding. The effects of Black and Hispanic in the current models were the same as in the full models. In addition, the results from this model included a selection bias correction using the Heckman two-step command in STATA. All of the covariates (including race/ethnicity) were used to model the incarceration decision, and the subsequent Mills ratio was used as an independent variable in the subsequent OLS regression analyses. All of these findings are available on request.\n\nTABLE 1\n1Multinomial Logistic Regression Estimates for the Effect of Race/Ethnicity on Sentence TypeNote. The reference group is jail. LL = log likelihood. * p < .05, * * p < .01.Community Sentence \nPrison \n\nVariable \nB \nS E \nWald \nExp(B) \nB \nS E \nWald \nExp(B) \n\nBlack vs. White sample \nBlack \n-0.10 \n0.03 \n8.26  *  *  \n0.91 \n0.07 \n0.04 \n4.58  *  \n1.08 \nConstant \n-0.11 \n0.02 \n21.79  *  *  \n-0.26 \n0.03 \n108.13  *  *  \n-2 LL \n60.75 \nModel χ 2 \n23.17  *  *  \n\nHispanic vs. White sample \nHispanic \n-0.39 \n0.04 \n92.91  *  *  \n0.68 \n-0.03 \n0.04 \n0.51 \n0.97 \nConstant \n0.17 \n0.03 \n35.75  *  *  \n-0.30 \n0.03 \n106.73  *  *  \n-2 LL \n143.09 \nModel χ 2 \n106.79  *  *  \n\nHispanic vs. Black sample \nHispanic \n-0.35 \n0.04 \n80.62  *  *  \n0.70 \n-0.13 \n0.04 \n13.21  *  *  \n0.88 \nConstant \n-0.23 \n0.03 \n71.86  *  *  \n-0.17 \n0.03 \n41.56  *  *  \n-2 LL \n117.74 \nModel χ 2 \n80.98  *  *  \n\n\n\nTABLE 2\n2Ordinary Least Squares Regression Estimates of the Effect of Race/Ethnicity on JailIncarceration Length \n\nVariable \nB \nS E \nβ \n\nBlack vs. White sample \nBlack \n-0.03 \n0.04 \n0.01 \nConstant \n1.97  *  *  \n0.06 \n\nHispanic vs. White sample \nHispanic \n-0.24  *  *  \n0.05 \n0.07 \nConstant \n2.09  *  *  \n0.07 \n\nHispanic vs. Black sample \nHispanic \n-0.30  *  *  \n0.04 \n0.10 \nConstant \n2.12  *  *  \n0.07 \n\n *  *  p ≤ .01 \n\n\n\nTABLE 3\n3Ordinary Least Squares Regression Estimates of the Effect of Race/Ethnicity on Prison Incarceration LengthVariable \nB \nS E \nβ \n\nBlack vs. White sample \nBlack \n-0.02 \n0.04 \n0.01 \nConstant \n3.87  *  *  \n0.05 \n\nHispanic vs. White sample \nHispanic \n-0.05 \n0.05 \n0.02 \nConstant \n3.86  *  *  \n0.06 \nHispanic vs. Black sample \nHispanic \n-0.03 \n0.03 \n0.02 \nConstant \n3.90  *  *  \n0.03 \n\n *  *  p ≤ .01 \n\n\n\nA critical appraisal of propensity score matching in the medical literature between. P C Austin, Statistics in Medicine. 27Austin, P. C. (2008). A critical appraisal of propensity score matching in the medical literature between 1996 and 2003. Statistics in Medicine, 27, 2037-2049.\n\nRacial/ethnic differentials in sentencing to incarceration. W D Bales, A R Piquero, Justice Quarterly. 29Bales, W. D., & Piquero, A. R. (2012). Racial/ethnic differentials in sentencing to incarceration. Justice Quarterly, 29, 742-773.\n\nReassessing and redirecting research on race and sentencing. E P Baumer, Justice Quarterly. 30Baumer, E. P. (2013). Reassessing and redirecting research on race and sentencing. Justice Quarterly, 30, 231-261.\n\nStatistical difficulties in determining the role of race in capital cases: A re-analysis of data from the state of Maryland. R Berk, A Li, L J Hickman, Journal of Quantitative Criminology. 21Berk, R., Li, A., & Hickman, L. J. (2005). Statistical difficulties in determining the role of race in capital cases: A re-analysis of data from the state of Maryland. Journal of Quantitative Criminology, 21, 365-390.\n\nRace/ethnicity and sentencing outcomes among drug offenders in North Carolina. P K Brennan, C Spohn, Journal of Contemporary Criminal Justice. 24Brennan, P. K., & Spohn, C. (2008). Race/ethnicity and sentencing outcomes among drug offenders in North Carolina. Journal of Contemporary Criminal Justice, 24, 371-398.\n\nIs the magic still there? The use of the Heckman two-step correction for selection bias in criminology. S Bushway, B D Johnson, L A Slocum, Journal of Quantitative Criminology. 23Bushway, S., Johnson, B. D., & Slocum, L. A. (2007). Is the magic still there? The use of the Heckman two-step correction for selection bias in criminology. Journal of Quantitative Criminology, 23, 151-178.\n\nThe social science contribution to the policy debate surrounding the legal threat to presumptive sentencing guidelines. S Bushway, A Piehl, Criminology and Public Policy. 6Bushway, S., & Piehl, A. (2007). The social science contribution to the policy debate surrounding the legal threat to presumptive sentencing guidelines. Criminology and Public Policy, 6, 461-482.\n\nRace and imprisonment: A contextual assessment of the evidence. T G Chiricos, C Crawford, Ethnicity, race, and crime: Perspectives across time and place. D. F. HawkinsAlbanyState University of New York PressChiricos, T. G., & Crawford, C. (1995). Race and imprisonment: A contextual as- sessment of the evidence. In D. F. Hawkins (Ed.), Ethnicity, race, and crime: Perspectives across time and place (pp. 281-309). Albany: State University of New York Press.\n\nSentencing guidelines and focal concerns: The effect of sentencing policy as a practical constraint on sentencing decisions. M S Crow, W Bales, American Journal of Criminal Justice. 30Crow, M. S., & Bales, W. (2006). Sentencing guidelines and focal concerns: The effect of sentencing policy as a practical constraint on sentencing decisions. American Journal of Criminal Justice, 30, 285-304.\n\nEthnicity effects on sentence outcomes in felony cases: Comparisons among White, Black, and Hispanic defendants. S Demuth, D Steffensmeier, Social Science Quarterly. 85Demuth, S., & Steffensmeier, D. (2004). Ethnicity effects on sentence outcomes in felony cases: Comparisons among White, Black, and Hispanic defendants. Social Science Quarterly, 85, 994-1011.\n\nModeling the effects of legal and extralegal factors under sentencing guidelines: The rules have changed. R L Engen, R Gainey, Criminology. 38Engen, R. L., & Gainey, R. (2000). Modeling the effects of legal and extralegal factors under sentencing guidelines: The rules have changed. Criminology, 38, 1245-1252.\n\nDiscretion and disparity under sentencing guidelines: The role of departures and structured sentencing alternatives. R L Engen, R R Gainey, R D Crutchfield, J G Weis, Criminology. 41Engen, R. L., Gainey, R. R., Crutchfield, R. D., & Weis, J. G. (2003). Discretion and disparity under sentencing guidelines: The role of departures and structured sentencing alternatives. Criminology, 41, 99-130.\n\nA multilevel analyses of community effects on criminal sentencing. N E Fearn, Justice Quarterly. 22Fearn, N. E. (2005). A multilevel analyses of community effects on criminal sentenc- ing. Justice Quarterly, 22, 452-487.\n\nRacial/ethnic threat and federal sentencing. B Feldmeyer, J T Ulmer, Journal of Research in Crime and Delinquency. 48Feldmeyer, B., & Ulmer, J. T. (2011). Racial/ethnic threat and federal sentencing. Journal of Research in Crime and Delinquency, 48, 238-270.\n\nMultiple imputation of the supplementary homicide reports. J A Fox, M L Swatt, Journal of Quantitative Criminology. 25Fox, J. A., & Swatt, M. L. (2009). Multiple imputation of the supplementary homicide reports, 1976-2005. Journal of Quantitative Criminology, 25, 51-77.\n\nAn examination of the interactions of race and gender on sentencing decisions using a trichotomous dependent variable. T L Freiburger, C M Hilinski, Crime & Delinquency. 59Freiburger, T. L., & Hilinski, C. M. (2013). An examination of the interactions of race and gender on sentencing decisions using a trichotomous dependent variable. Crime & Delinquency, 59, 59-86.\n\nRevisiting the total incarceration variable: Should researchers separate jail from prison sentences in sentencing research?. M P Harrington, Journal of Contemporary Criminal Justice. 24Harrington, M. P. (2008). Revisiting the total incarceration variable: Should re- searchers separate jail from prison sentences in sentencing research? Journal of Contemporary Criminal Justice, 24, 462-478.\n\nThe Effect of Race/Ethnicity on Sentencing 195. The Effect of Race/Ethnicity on Sentencing 195\n\nDefining sentence type: Further evidence against use of the total incarceration variable. M P Harrington, C Spohn, Journal of Research in Crime and Delinquency. 44Harrington, M. P., & Spohn, C. (2007). Defining sentence type: Further evidence against use of the total incarceration variable. Journal of Research in Crime and Delinquency, 44, 36-63.\n\nCausal attribution and punishment for crime. D F Hawkins, Deviant Behavior. 1Hawkins, D. F. (1981). Causal attribution and punishment for crime. Deviant Behav- ior, 1, 207-230.\n\nOn the use of the total incarceration variable in sentencing research. D Holleran, C Spohn, Criminology. 42Holleran, D., & Spohn, C. (2004). On the use of the total incarceration variable in sentencing research. Criminology, 42, 211-240.\n\nRace, crime and the law. R Kennedy, Vintage BooksNew York, NYKennedy, R. (1997). Race, crime and the law. New York, NY: Vintage Books.\n\nRace and imprisonment decisions. J Kramer, D Steffensmeier, The Sociological Quarterly. 34Kramer, J., & Steffensmeier, D. (1993). Race and imprisonment decisions. The Soci- ological Quarterly, 34, 357-376.\n\nDifferential effects of adult court transfer on juvenile offender recidivism. T A Loughran, E P Mulvey, C A Schubert, L A Chassin, L Steinberg, A R Piquero, . . Losoya, S , Law and Human Behavior. 34Loughran, T. A., Mulvey, E. P., Schubert, C. A., Chassin, L. A., Steinberg, L., Piquero, A. R., . . . Losoya, S. (2010). Differential effects of adult court transfer on juvenile offender recidivism. Law and Human Behavior, 34, 476-488.\n\nApplied logistic regression. S Mernard, SageThousand Oaks, CA2nd ed.Mernard, S. (2002). Applied logistic regression (2nd ed.). Thousand Oaks, CA: Sage.\n\nConstructing a control group using multivariate matches sampling methods that incorporate the propensity score. P R Rosenbaum, D B Rubin, American Statistician. 39Rosenbaum, P. R., & Rubin, D. B. (1985). Constructing a control group using multi- variate matches sampling methods that incorporate the propensity score. Amer- ican Statistician, 39, 33-38.\n\nMultiple imputation for nonresponse in surveys. D Rubin, WileyNew York, NYRubin, D. (1987). Multiple imputation for nonresponse in surveys. New York, NY: Wiley.\n\nMissing data: Our view of the state of the art. J L Schafer, J W Graham, Psychological Methods. 7Schafer, J. L., & Graham, J. W. (2002). Missing data: Our view of the state of the art. Psychological Methods, 7, 147-177.\n\nThe imprisonment penalty paid by young unemployed Black and Hispanic male offenders. C Spohn, D Holleran, Criminology. 38Spohn, C., & Holleran, D. (2000). The imprisonment penalty paid by young unemployed Black and Hispanic male offenders. Criminology, 38, 281- 306.\n\nThe dangerous drug offender in federal court: Intersections of race, ethnicity, and culpability. C Spohn, L L Sample, Crime & Delinquency. 593Spohn, C., & Sample, L. L. (2013). The dangerous drug offender in federal court: Intersections of race, ethnicity, and culpability. Crime & Delinquency, 59(3), 3-31.\n\nAssessing the impact of the women's movement on sexbased differences in the handling of adult criminal defendants. D Steffensmeier, Crime & Delinquency. 26Steffensmeier, D. (1980). Assessing the impact of the women's movement on sex- based differences in the handling of adult criminal defendants. Crime & Delin- quency, 26, 344-358.\n\nEthnicity and sentencing in U.S. federal courts: Who is punished more harshly?. D Steffensmeier, S Demuth, American Sociological Review. 65Steffensmeier, D., & Demuth, S. (2000). Ethnicity and sentencing in U.S. federal courts: Who is punished more harshly? American Sociological Review, 65, 705-729.\n\nEthnicity and judges' sentencing decisions: Hispanic-Black-White comparisons. D Steffensmeier, S Demuth, Criminology. 39Steffensmeier, D., & Demuth, S. (2001). Ethnicity and judges' sen- tencing decisions: Hispanic-Black-White comparisons. Criminology, 39, 145-178.\n\nDoes gender modify the effects of race-ethnicity on criminal sanctions? Sentences for male and female, White, Black, and Hispanic defendants. D Steffensmeier, S Demuth, Journal of Quantitative Criminology. 22Steffensmeier, D., & Demuth, S. (2006). Does gender modify the effects of race-ethnicity on criminal sanctions? Sentences for male and female, White, Black, and Hispanic defendants. Journal of Quantitative Criminology, 22, 241-261.\n\nThe interaction of race, gender, and age in criminal sentencing: The punishment cost of being young, Black, and male. D Steffensmeier, J Ulmer, J Kramer, Criminology. 36Steffensmeier, D., Ulmer, J., & Kramer, J. (1998). The interaction of race, gender, and age in criminal sentencing: The punishment cost of being young, Black, and male. Criminology, 36, 763-797.\n\nSentencing in context: A multilevel analysis. J T Ulmer, B Johnson, Criminology. 42Ulmer, J. T., & Johnson, B. (2004). Sentencing in context: A multilevel analysis. Criminology, 42, 137-178.\n\nExamining the direct and interactive effects of changes in racial and ethnic threat on sentencing decisions. X Wang, D P Mears, Journal of Research in Crime and Delinquency. 47Wang, X., & Mears, D. P. (2010). Examining the direct and interactive effects of changes in racial and ethnic threat on sentencing decisions. Journal of Research in Crime and Delinquency, 47, 522-557.\n\n. K L Jordan, T L Freiburger, K. L. Jordan and T. L. Freiburger\n\nAssessing the differential effects of race and ethnicity on sentence outcomes under different sentencing systems. X Wang, D P Mears, C Spohn, L Dario, Crime & Delinquency. 59Wang, X., Mears, D. P., Spohn, C., & Dario, L. (2013). Assessing the differential effects of race and ethnicity on sentence outcomes under different sentencing systems. Crime & Delinquency, 59, 87-114.\n\nA comparison of propensity score and linear regression analysis of complex survey data. E L Zanutto, Journal of Data Science. 4Zanutto, E. L. (2006). A comparison of propensity score and linear regression analysis of complex survey data. Journal of Data Science, 4, 67-91.\n\nThe convergence of race, ethnicity, gender, and class in court decisionmaking: Looking toward the 21st century. M S Zatz, Criminal justice 2000. J. HorneyWashington, DC3U.S. Department of JusticeZatz, M. S. (2000). The convergence of race, ethnicity, gender, and class in court decisionmaking: Looking toward the 21st century. In J. Horney (Ed.), Criminal justice 2000 (Vol. 3, pp. 503-552). Washington, DC: U.S. Department of Justice.\n\nJordan is an Associate Professor in the School of Criminology and Justice Studies at the University of Massachusetts Lowell. His primary research interests are juvenile delinquency and racial disparities in sentencing. His most recent publications include articles in the. L Kareem, Journal of Crime and Justice. Criminal Justice Policy ReviewKareem L. Jordan is an Associate Professor in the School of Criminology and Justice Studies at the University of Massachusetts Lowell. His primary research interests are juvenile delinquency and racial disparities in sentencing. His most recent publications include articles in the Journal of Crime and Justice, Youth Violence and Juvenile Justice, and Criminal Justice Policy Review.\n\nFreiburger is an Associate Professor at the University of Wisconsin-Milwaukee. Her primary research interests are gender and racial disparities in sentencing and juvenile justice. Her recent publications include articles in Crime & Delinquency, the Journal of Crime and Justice. L Tina, and Police QuarterlyTina L. Freiburger is an Associate Professor at the University of Wisconsin-Milwaukee. Her primary research interests are gender and racial disparities in sentencing and juvenile justice. Her recent publications include articles in Crime & Delinquency, the Journal of Crime and Justice, Youth Violence and Juvenile Justice, and Police Quarterly.\n", "annotations": {"author": "[{\"end\":123,\"start\":107},{\"end\":142,\"start\":124},{\"end\":275,\"start\":143},{\"end\":375,\"start\":276},{\"end\":459,\"start\":376}]", "publisher": null, "author_last_name": "[{\"end\":122,\"start\":116},{\"end\":141,\"start\":131}]", "author_first_name": "[{\"end\":113,\"start\":107},{\"end\":115,\"start\":114},{\"end\":128,\"start\":124},{\"end\":130,\"start\":129}]", "author_affiliation": "[{\"end\":274,\"start\":144},{\"end\":374,\"start\":277},{\"end\":458,\"start\":377}]", "title": "[{\"end\":100,\"start\":1},{\"end\":559,\"start\":460}]", "venue": "[{\"end\":601,\"start\":561}]", "abstract": null, "bib_ref": "[{\"attributes\":{\"ref_id\":\"b30\"},\"end\":758,\"start\":737},{\"attributes\":{\"ref_id\":\"b34\"},\"end\":785,\"start\":758},{\"end\":1902,\"start\":1879},{\"attributes\":{\"ref_id\":\"b21\"},\"end\":2302,\"start\":2287},{\"attributes\":{\"ref_id\":\"b34\"},\"end\":2329,\"start\":2302},{\"attributes\":{\"ref_id\":\"b29\"},\"end\":2590,\"start\":2569},{\"attributes\":{\"ref_id\":\"b31\"},\"end\":2619,\"start\":2590},{\"attributes\":{\"ref_id\":\"b28\"},\"end\":2683,\"start\":2658},{\"attributes\":{\"ref_id\":\"b33\"},\"end\":3254,\"start\":3223},{\"attributes\":{\"ref_id\":\"b30\"},\"end\":3624,\"start\":3607},{\"end\":3643,\"start\":3624},{\"attributes\":{\"ref_id\":\"b31\"},\"end\":3743,\"start\":3713},{\"end\":3792,\"start\":3788},{\"end\":3797,\"start\":3792},{\"attributes\":{\"ref_id\":\"b32\"},\"end\":3826,\"start\":3797},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":4195,\"start\":4171},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":5346,\"start\":5317},{\"attributes\":{\"ref_id\":\"b18\"},\"end\":5371,\"start\":5346},{\"attributes\":{\"ref_id\":\"b20\"},\"end\":5394,\"start\":5371},{\"attributes\":{\"ref_id\":\"b20\"},\"end\":5421,\"start\":5396},{\"attributes\":{\"ref_id\":\"b18\"},\"end\":5803,\"start\":5776},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":6074,\"start\":6044},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":6535,\"start\":6506},{\"attributes\":{\"ref_id\":\"b18\"},\"end\":6560,\"start\":6535},{\"attributes\":{\"ref_id\":\"b13\"},\"end\":6864,\"start\":6839},{\"attributes\":{\"ref_id\":\"b28\"},\"end\":6887,\"start\":6864},{\"attributes\":{\"ref_id\":\"b34\"},\"end\":6914,\"start\":6887},{\"attributes\":{\"ref_id\":\"b33\"},\"end\":6947,\"start\":6916},{\"attributes\":{\"ref_id\":\"b13\"},\"end\":7219,\"start\":7207},{\"attributes\":{\"ref_id\":\"b28\"},\"end\":7351,\"start\":7326},{\"end\":7573,\"start\":7540},{\"attributes\":{\"ref_id\":\"b38\"},\"end\":7745,\"start\":7709},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":7966,\"start\":7936},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":8170,\"start\":8146},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":9672,\"start\":9646},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":10435,\"start\":10407},{\"attributes\":{\"ref_id\":\"b18\"},\"end\":10460,\"start\":10435},{\"attributes\":{\"ref_id\":\"b20\"},\"end\":10483,\"start\":10460},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":10505,\"start\":10483},{\"attributes\":{\"ref_id\":\"b32\"},\"end\":10534,\"start\":10505},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":10748,\"start\":10720},{\"attributes\":{\"ref_id\":\"b16\"},\"end\":10765,\"start\":10748},{\"end\":10799,\"start\":10765},{\"attributes\":{\"ref_id\":\"b16\"},\"end\":11031,\"start\":11013},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":11333,\"start\":11312},{\"attributes\":{\"ref_id\":\"b34\"},\"end\":11579,\"start\":11552},{\"attributes\":{\"ref_id\":\"b2\"},\"end\":11739,\"start\":11725},{\"attributes\":{\"ref_id\":\"b39\"},\"end\":12001,\"start\":11986},{\"end\":12369,\"start\":12314},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":13406,\"start\":13387},{\"attributes\":{\"ref_id\":\"b26\"},\"end\":13418,\"start\":13406},{\"attributes\":{\"ref_id\":\"b27\"},\"end\":13441,\"start\":13418},{\"attributes\":{\"ref_id\":\"b2\"},\"end\":14174,\"start\":14160},{\"attributes\":{\"ref_id\":\"b3\"},\"end\":14200,\"start\":14174},{\"attributes\":{\"ref_id\":\"b6\"},\"end\":15134,\"start\":15111},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":15163,\"start\":15134},{\"attributes\":{\"ref_id\":\"b12\"},\"end\":15175,\"start\":15163},{\"attributes\":{\"ref_id\":\"b33\"},\"end\":15204,\"start\":15175},{\"attributes\":{\"ref_id\":\"b36\"},\"end\":15223,\"start\":15204},{\"attributes\":{\"ref_id\":\"b0\"},\"end\":15488,\"start\":15474},{\"attributes\":{\"ref_id\":\"b23\"},\"end\":15510,\"start\":15488},{\"attributes\":{\"ref_id\":\"b25\"},\"end\":15534,\"start\":15510},{\"attributes\":{\"ref_id\":\"b23\"},\"end\":15954,\"start\":15931},{\"attributes\":{\"ref_id\":\"b25\"},\"end\":15978,\"start\":15954},{\"attributes\":{\"ref_id\":\"b25\"},\"end\":16163,\"start\":16137},{\"attributes\":{\"ref_id\":\"b35\"},\"end\":17556,\"start\":17534},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":17703,\"start\":17675},{\"attributes\":{\"ref_id\":\"b16\"},\"end\":17720,\"start\":17703},{\"attributes\":{\"ref_id\":\"b5\"},\"end\":18579,\"start\":18545},{\"attributes\":{\"ref_id\":\"b8\"},\"end\":18847,\"start\":18828},{\"attributes\":{\"ref_id\":\"b34\"},\"end\":18874,\"start\":18847},{\"attributes\":{\"ref_id\":\"b33\"},\"end\":19007,\"start\":18977},{\"attributes\":{\"ref_id\":\"b24\"},\"end\":19211,\"start\":19196},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":25462,\"start\":25432},{\"attributes\":{\"ref_id\":\"b18\"},\"end\":25494,\"start\":25467},{\"attributes\":{\"ref_id\":\"b30\"},\"end\":26217,\"start\":26196},{\"attributes\":{\"ref_id\":\"b34\"},\"end\":26244,\"start\":26217},{\"attributes\":{\"ref_id\":\"b28\"},\"end\":26574,\"start\":26551},{\"attributes\":{\"ref_id\":\"b31\"},\"end\":26603,\"start\":26574},{\"attributes\":{\"ref_id\":\"b13\"},\"end\":27620,\"start\":27596},{\"attributes\":{\"ref_id\":\"b28\"},\"end\":27643,\"start\":27620},{\"attributes\":{\"ref_id\":\"b34\"},\"end\":27670,\"start\":27643},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":27804,\"start\":27776},{\"attributes\":{\"ref_id\":\"b16\"},\"end\":27821,\"start\":27804},{\"attributes\":{\"ref_id\":\"b38\"},\"end\":27839,\"start\":27821},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":29218,\"start\":29189},{\"attributes\":{\"ref_id\":\"b38\"},\"end\":29236,\"start\":29218},{\"attributes\":{\"ref_id\":\"b11\"},\"end\":29740,\"start\":29698},{\"attributes\":{\"ref_id\":\"b11\"},\"end\":30021,\"start\":30002}]", "figure": "[{\"attributes\":{\"id\":\"tab_0\",\"type\":\"table\"},\"end\":36264,\"start\":35395},{\"attributes\":{\"id\":\"tab_1\",\"type\":\"table\"},\"end\":36686,\"start\":36265},{\"attributes\":{\"id\":\"tab_2\",\"type\":\"table\"},\"end\":37093,\"start\":36687}]", "paragraph": "[{\"end\":1665,\"start\":663},{\"end\":2620,\"start\":1667},{\"end\":4104,\"start\":2642},{\"end\":4899,\"start\":4106},{\"end\":6607,\"start\":4930},{\"end\":7574,\"start\":6627},{\"end\":8098,\"start\":7576},{\"end\":8703,\"start\":8136},{\"end\":9267,\"start\":8705},{\"end\":10197,\"start\":9269},{\"end\":12002,\"start\":10236},{\"end\":14201,\"start\":12013},{\"end\":15224,\"start\":14203},{\"end\":15979,\"start\":15226},{\"end\":16264,\"start\":16014},{\"end\":16717,\"start\":16266},{\"end\":18131,\"start\":16741},{\"end\":19410,\"start\":18144},{\"end\":19840,\"start\":19438},{\"end\":20170,\"start\":19842},{\"end\":20512,\"start\":20172},{\"end\":21525,\"start\":20514},{\"end\":21708,\"start\":21550},{\"end\":22424,\"start\":21710},{\"end\":22865,\"start\":22426},{\"end\":23449,\"start\":22867},{\"end\":23876,\"start\":23451},{\"end\":25282,\"start\":23878},{\"end\":26245,\"start\":25312},{\"end\":27373,\"start\":26247},{\"end\":28609,\"start\":27375},{\"end\":29237,\"start\":28611},{\"end\":29865,\"start\":29239},{\"end\":30932,\"start\":29867},{\"end\":31384,\"start\":30948},{\"end\":31827,\"start\":31386},{\"end\":32250,\"start\":31829},{\"end\":32983,\"start\":32286},{\"end\":33311,\"start\":32985},{\"end\":33572,\"start\":33313},{\"end\":33987,\"start\":33574},{\"end\":34688,\"start\":33989},{\"end\":35394,\"start\":34690}]", "formula": "[{\"attributes\":{\"id\":\"formula_0\"},\"end\":16013,\"start\":15980}]", "table_ref": "[{\"attributes\":{\"ref_id\":\"tab_0\"},\"end\":20583,\"start\":20576},{\"attributes\":{\"ref_id\":\"tab_1\"},\"end\":22929,\"start\":22922},{\"attributes\":{\"ref_id\":\"tab_2\"},\"end\":24656,\"start\":24649}]", "section_header": "[{\"end\":661,\"start\":639},{\"end\":2640,\"start\":2623},{\"end\":4928,\"start\":4902},{\"end\":6625,\"start\":6610},{\"end\":8134,\"start\":8101},{\"end\":10234,\"start\":10200},{\"end\":12011,\"start\":12005},{\"end\":16739,\"start\":16720},{\"end\":18142,\"start\":18134},{\"end\":19420,\"start\":19413},{\"end\":19436,\"start\":19423},{\"end\":21548,\"start\":21528},{\"end\":25310,\"start\":25285},{\"end\":30946,\"start\":30935},{\"end\":32284,\"start\":32253},{\"end\":35403,\"start\":35396},{\"end\":36273,\"start\":36266},{\"end\":36695,\"start\":36688}]", "table": "[{\"end\":36264,\"start\":35575},{\"end\":36686,\"start\":36358},{\"end\":37093,\"start\":36803}]", "figure_caption": "[{\"end\":35575,\"start\":35405},{\"end\":36358,\"start\":36275},{\"end\":36803,\"start\":36697}]", "figure_ref": null, "bib_author_first_name": "[{\"end\":37181,\"start\":37180},{\"end\":37183,\"start\":37182},{\"end\":37440,\"start\":37439},{\"end\":37442,\"start\":37441},{\"end\":37451,\"start\":37450},{\"end\":37453,\"start\":37452},{\"end\":37678,\"start\":37677},{\"end\":37680,\"start\":37679},{\"end\":37952,\"start\":37951},{\"end\":37960,\"start\":37959},{\"end\":37966,\"start\":37965},{\"end\":37968,\"start\":37967},{\"end\":38316,\"start\":38315},{\"end\":38318,\"start\":38317},{\"end\":38329,\"start\":38328},{\"end\":38657,\"start\":38656},{\"end\":38668,\"start\":38667},{\"end\":38670,\"start\":38669},{\"end\":38681,\"start\":38680},{\"end\":38683,\"start\":38682},{\"end\":39060,\"start\":39059},{\"end\":39071,\"start\":39070},{\"end\":39373,\"start\":39372},{\"end\":39375,\"start\":39374},{\"end\":39387,\"start\":39386},{\"end\":39894,\"start\":39893},{\"end\":39896,\"start\":39895},{\"end\":39904,\"start\":39903},{\"end\":40276,\"start\":40275},{\"end\":40286,\"start\":40285},{\"end\":40631,\"start\":40630},{\"end\":40633,\"start\":40632},{\"end\":40642,\"start\":40641},{\"end\":40954,\"start\":40953},{\"end\":40956,\"start\":40955},{\"end\":40965,\"start\":40964},{\"end\":40967,\"start\":40966},{\"end\":40977,\"start\":40976},{\"end\":40979,\"start\":40978},{\"end\":40994,\"start\":40993},{\"end\":40996,\"start\":40995},{\"end\":41300,\"start\":41299},{\"end\":41302,\"start\":41301},{\"end\":41500,\"start\":41499},{\"end\":41513,\"start\":41512},{\"end\":41515,\"start\":41514},{\"end\":41774,\"start\":41773},{\"end\":41776,\"start\":41775},{\"end\":41783,\"start\":41782},{\"end\":41785,\"start\":41784},{\"end\":42106,\"start\":42105},{\"end\":42108,\"start\":42107},{\"end\":42122,\"start\":42121},{\"end\":42124,\"start\":42123},{\"end\":42481,\"start\":42480},{\"end\":42483,\"start\":42482},{\"end\":42935,\"start\":42934},{\"end\":42937,\"start\":42936},{\"end\":42951,\"start\":42950},{\"end\":43240,\"start\":43239},{\"end\":43242,\"start\":43241},{\"end\":43444,\"start\":43443},{\"end\":43456,\"start\":43455},{\"end\":43637,\"start\":43636},{\"end\":43781,\"start\":43780},{\"end\":43791,\"start\":43790},{\"end\":44033,\"start\":44032},{\"end\":44035,\"start\":44034},{\"end\":44047,\"start\":44046},{\"end\":44049,\"start\":44048},{\"end\":44059,\"start\":44058},{\"end\":44061,\"start\":44060},{\"end\":44073,\"start\":44072},{\"end\":44075,\"start\":44074},{\"end\":44086,\"start\":44085},{\"end\":44099,\"start\":44098},{\"end\":44101,\"start\":44100},{\"end\":44112,\"start\":44111},{\"end\":44114,\"start\":44113},{\"end\":44124,\"start\":44123},{\"end\":44420,\"start\":44419},{\"end\":44656,\"start\":44655},{\"end\":44658,\"start\":44657},{\"end\":44671,\"start\":44670},{\"end\":44673,\"start\":44672},{\"end\":44947,\"start\":44946},{\"end\":45109,\"start\":45108},{\"end\":45111,\"start\":45110},{\"end\":45122,\"start\":45121},{\"end\":45124,\"start\":45123},{\"end\":45367,\"start\":45366},{\"end\":45376,\"start\":45375},{\"end\":45647,\"start\":45646},{\"end\":45656,\"start\":45655},{\"end\":45658,\"start\":45657},{\"end\":45974,\"start\":45973},{\"end\":46274,\"start\":46273},{\"end\":46291,\"start\":46290},{\"end\":46574,\"start\":46573},{\"end\":46591,\"start\":46590},{\"end\":46905,\"start\":46904},{\"end\":46922,\"start\":46921},{\"end\":47322,\"start\":47321},{\"end\":47339,\"start\":47338},{\"end\":47348,\"start\":47347},{\"end\":47615,\"start\":47614},{\"end\":47617,\"start\":47616},{\"end\":47626,\"start\":47625},{\"end\":47870,\"start\":47869},{\"end\":47878,\"start\":47877},{\"end\":47880,\"start\":47879},{\"end\":48141,\"start\":48140},{\"end\":48143,\"start\":48142},{\"end\":48153,\"start\":48152},{\"end\":48155,\"start\":48154},{\"end\":48318,\"start\":48317},{\"end\":48326,\"start\":48325},{\"end\":48328,\"start\":48327},{\"end\":48337,\"start\":48336},{\"end\":48346,\"start\":48345},{\"end\":48669,\"start\":48668},{\"end\":48671,\"start\":48670},{\"end\":48967,\"start\":48966},{\"end\":48969,\"start\":48968},{\"end\":49565,\"start\":49564},{\"end\":50300,\"start\":50299}]", "bib_author_last_name": "[{\"end\":37190,\"start\":37184},{\"end\":37448,\"start\":37443},{\"end\":37461,\"start\":37454},{\"end\":37687,\"start\":37681},{\"end\":37957,\"start\":37953},{\"end\":37963,\"start\":37961},{\"end\":37976,\"start\":37969},{\"end\":38326,\"start\":38319},{\"end\":38335,\"start\":38330},{\"end\":38665,\"start\":38658},{\"end\":38678,\"start\":38671},{\"end\":38690,\"start\":38684},{\"end\":39068,\"start\":39061},{\"end\":39077,\"start\":39072},{\"end\":39384,\"start\":39376},{\"end\":39396,\"start\":39388},{\"end\":39901,\"start\":39897},{\"end\":39910,\"start\":39905},{\"end\":40283,\"start\":40277},{\"end\":40300,\"start\":40287},{\"end\":40639,\"start\":40634},{\"end\":40649,\"start\":40643},{\"end\":40962,\"start\":40957},{\"end\":40974,\"start\":40968},{\"end\":40991,\"start\":40980},{\"end\":41001,\"start\":40997},{\"end\":41308,\"start\":41303},{\"end\":41510,\"start\":41501},{\"end\":41521,\"start\":41516},{\"end\":41780,\"start\":41777},{\"end\":41791,\"start\":41786},{\"end\":42119,\"start\":42109},{\"end\":42133,\"start\":42125},{\"end\":42494,\"start\":42484},{\"end\":42948,\"start\":42938},{\"end\":42957,\"start\":42952},{\"end\":43250,\"start\":43243},{\"end\":43453,\"start\":43445},{\"end\":43462,\"start\":43457},{\"end\":43645,\"start\":43638},{\"end\":43788,\"start\":43782},{\"end\":43805,\"start\":43792},{\"end\":44044,\"start\":44036},{\"end\":44056,\"start\":44050},{\"end\":44070,\"start\":44062},{\"end\":44083,\"start\":44076},{\"end\":44096,\"start\":44087},{\"end\":44109,\"start\":44102},{\"end\":44121,\"start\":44115},{\"end\":44428,\"start\":44421},{\"end\":44668,\"start\":44659},{\"end\":44679,\"start\":44674},{\"end\":44953,\"start\":44948},{\"end\":45119,\"start\":45112},{\"end\":45131,\"start\":45125},{\"end\":45373,\"start\":45368},{\"end\":45385,\"start\":45377},{\"end\":45653,\"start\":45648},{\"end\":45665,\"start\":45659},{\"end\":45988,\"start\":45975},{\"end\":46288,\"start\":46275},{\"end\":46298,\"start\":46292},{\"end\":46588,\"start\":46575},{\"end\":46598,\"start\":46592},{\"end\":46919,\"start\":46906},{\"end\":46929,\"start\":46923},{\"end\":47336,\"start\":47323},{\"end\":47345,\"start\":47340},{\"end\":47355,\"start\":47349},{\"end\":47623,\"start\":47618},{\"end\":47634,\"start\":47627},{\"end\":47875,\"start\":47871},{\"end\":47886,\"start\":47881},{\"end\":48150,\"start\":48144},{\"end\":48166,\"start\":48156},{\"end\":48323,\"start\":48319},{\"end\":48334,\"start\":48329},{\"end\":48343,\"start\":48338},{\"end\":48352,\"start\":48347},{\"end\":48679,\"start\":48672},{\"end\":48974,\"start\":48970},{\"end\":49572,\"start\":49566},{\"end\":50305,\"start\":50301}]", "bib_entry": "[{\"attributes\":{\"id\":\"b0\",\"matched_paper_id\":24691624},\"end\":37377,\"start\":37095},{\"attributes\":{\"id\":\"b1\",\"matched_paper_id\":146166473},\"end\":37614,\"start\":37379},{\"attributes\":{\"id\":\"b2\",\"matched_paper_id\":1641967},\"end\":37824,\"start\":37616},{\"attributes\":{\"id\":\"b3\",\"matched_paper_id\":56063612},\"end\":38234,\"start\":37826},{\"attributes\":{\"id\":\"b4\",\"matched_paper_id\":143590764},\"end\":38550,\"start\":38236},{\"attributes\":{\"id\":\"b5\",\"matched_paper_id\":16344588},\"end\":38937,\"start\":38552},{\"attributes\":{\"id\":\"b6\"},\"end\":39306,\"start\":38939},{\"attributes\":{\"id\":\"b7\"},\"end\":39766,\"start\":39308},{\"attributes\":{\"id\":\"b8\",\"matched_paper_id\":144339227},\"end\":40160,\"start\":39768},{\"attributes\":{\"id\":\"b9\"},\"end\":40522,\"start\":40162},{\"attributes\":{\"id\":\"b10\"},\"end\":40834,\"start\":40524},{\"attributes\":{\"id\":\"b11\",\"matched_paper_id\":143701802},\"end\":41230,\"start\":40836},{\"attributes\":{\"id\":\"b12\",\"matched_paper_id\":143868061},\"end\":41452,\"start\":41232},{\"attributes\":{\"id\":\"b13\",\"matched_paper_id\":145631067},\"end\":41712,\"start\":41454},{\"attributes\":{\"id\":\"b14\",\"matched_paper_id\":144696206},\"end\":41984,\"start\":41714},{\"attributes\":{\"id\":\"b15\",\"matched_paper_id\":55576496},\"end\":42353,\"start\":41986},{\"attributes\":{\"id\":\"b16\"},\"end\":42746,\"start\":42355},{\"attributes\":{\"id\":\"b17\"},\"end\":42842,\"start\":42748},{\"attributes\":{\"id\":\"b18\"},\"end\":43192,\"start\":42844},{\"attributes\":{\"id\":\"b19\",\"matched_paper_id\":144670030},\"end\":43370,\"start\":43194},{\"attributes\":{\"id\":\"b20\",\"matched_paper_id\":143932701},\"end\":43609,\"start\":43372},{\"attributes\":{\"id\":\"b21\"},\"end\":43745,\"start\":43611},{\"attributes\":{\"id\":\"b22\",\"matched_paper_id\":144142188},\"end\":43952,\"start\":43747},{\"attributes\":{\"id\":\"b23\",\"matched_paper_id\":40863147},\"end\":44388,\"start\":43954},{\"attributes\":{\"id\":\"b24\"},\"end\":44541,\"start\":44390},{\"attributes\":{\"id\":\"b25\",\"matched_paper_id\":122906171},\"end\":44896,\"start\":44543},{\"attributes\":{\"id\":\"b26\"},\"end\":45058,\"start\":44898},{\"attributes\":{\"id\":\"b27\",\"matched_paper_id\":7745507},\"end\":45279,\"start\":45060},{\"attributes\":{\"id\":\"b28\",\"matched_paper_id\":144654684},\"end\":45547,\"start\":45281},{\"attributes\":{\"id\":\"b29\",\"matched_paper_id\":145246232},\"end\":45856,\"start\":45549},{\"attributes\":{\"id\":\"b30\",\"matched_paper_id\":146346122},\"end\":46191,\"start\":45858},{\"attributes\":{\"id\":\"b31\"},\"end\":46493,\"start\":46193},{\"attributes\":{\"id\":\"b32\",\"matched_paper_id\":144201277},\"end\":46760,\"start\":46495},{\"attributes\":{\"id\":\"b33\",\"matched_paper_id\":145714054},\"end\":47201,\"start\":46762},{\"attributes\":{\"id\":\"b34\",\"matched_paper_id\":13671563},\"end\":47566,\"start\":47203},{\"attributes\":{\"id\":\"b35\",\"matched_paper_id\":145575567},\"end\":47758,\"start\":47568},{\"attributes\":{\"id\":\"b36\",\"matched_paper_id\":145111091},\"end\":48136,\"start\":47760},{\"attributes\":{\"id\":\"b37\"},\"end\":48201,\"start\":48138},{\"attributes\":{\"id\":\"b38\",\"matched_paper_id\":92983161},\"end\":48578,\"start\":48203},{\"attributes\":{\"id\":\"b39\",\"matched_paper_id\":59145193},\"end\":48852,\"start\":48580},{\"attributes\":{\"id\":\"b40\",\"matched_paper_id\":16796529},\"end\":49289,\"start\":48854},{\"attributes\":{\"id\":\"b41\"},\"end\":50018,\"start\":49291},{\"attributes\":{\"id\":\"b42\"},\"end\":50672,\"start\":50020}]", "bib_title": "[{\"end\":37178,\"start\":37095},{\"end\":37437,\"start\":37379},{\"end\":37675,\"start\":37616},{\"end\":37949,\"start\":37826},{\"end\":38313,\"start\":38236},{\"end\":38654,\"start\":38552},{\"end\":39057,\"start\":38939},{\"end\":39370,\"start\":39308},{\"end\":39891,\"start\":39768},{\"end\":40273,\"start\":40162},{\"end\":40628,\"start\":40524},{\"end\":40951,\"start\":40836},{\"end\":41297,\"start\":41232},{\"end\":41497,\"start\":41454},{\"end\":41771,\"start\":41714},{\"end\":42103,\"start\":41986},{\"end\":42478,\"start\":42355},{\"end\":42932,\"start\":42844},{\"end\":43237,\"start\":43194},{\"end\":43441,\"start\":43372},{\"end\":43778,\"start\":43747},{\"end\":44030,\"start\":43954},{\"end\":44653,\"start\":44543},{\"end\":45106,\"start\":45060},{\"end\":45364,\"start\":45281},{\"end\":45644,\"start\":45549},{\"end\":45971,\"start\":45858},{\"end\":46271,\"start\":46193},{\"end\":46571,\"start\":46495},{\"end\":46902,\"start\":46762},{\"end\":47319,\"start\":47203},{\"end\":47612,\"start\":47568},{\"end\":47867,\"start\":47760},{\"end\":48315,\"start\":48203},{\"end\":48666,\"start\":48580},{\"end\":48964,\"start\":48854},{\"end\":49562,\"start\":49291}]", "bib_author": "[{\"end\":37192,\"start\":37180},{\"end\":37450,\"start\":37439},{\"end\":37463,\"start\":37450},{\"end\":37689,\"start\":37677},{\"end\":37959,\"start\":37951},{\"end\":37965,\"start\":37959},{\"end\":37978,\"start\":37965},{\"end\":38328,\"start\":38315},{\"end\":38337,\"start\":38328},{\"end\":38667,\"start\":38656},{\"end\":38680,\"start\":38667},{\"end\":38692,\"start\":38680},{\"end\":39070,\"start\":39059},{\"end\":39079,\"start\":39070},{\"end\":39386,\"start\":39372},{\"end\":39398,\"start\":39386},{\"end\":39903,\"start\":39893},{\"end\":39912,\"start\":39903},{\"end\":40285,\"start\":40275},{\"end\":40302,\"start\":40285},{\"end\":40641,\"start\":40630},{\"end\":40651,\"start\":40641},{\"end\":40964,\"start\":40953},{\"end\":40976,\"start\":40964},{\"end\":40993,\"start\":40976},{\"end\":41003,\"start\":40993},{\"end\":41310,\"start\":41299},{\"end\":41512,\"start\":41499},{\"end\":41523,\"start\":41512},{\"end\":41782,\"start\":41773},{\"end\":41793,\"start\":41782},{\"end\":42121,\"start\":42105},{\"end\":42135,\"start\":42121},{\"end\":42496,\"start\":42480},{\"end\":42950,\"start\":42934},{\"end\":42959,\"start\":42950},{\"end\":43252,\"start\":43239},{\"end\":43455,\"start\":43443},{\"end\":43464,\"start\":43455},{\"end\":43647,\"start\":43636},{\"end\":43790,\"start\":43780},{\"end\":43807,\"start\":43790},{\"end\":44046,\"start\":44032},{\"end\":44058,\"start\":44046},{\"end\":44072,\"start\":44058},{\"end\":44085,\"start\":44072},{\"end\":44098,\"start\":44085},{\"end\":44111,\"start\":44098},{\"end\":44123,\"start\":44111},{\"end\":44127,\"start\":44123},{\"end\":44430,\"start\":44419},{\"end\":44670,\"start\":44655},{\"end\":44681,\"start\":44670},{\"end\":44955,\"start\":44946},{\"end\":45121,\"start\":45108},{\"end\":45133,\"start\":45121},{\"end\":45375,\"start\":45366},{\"end\":45387,\"start\":45375},{\"end\":45655,\"start\":45646},{\"end\":45667,\"start\":45655},{\"end\":45990,\"start\":45973},{\"end\":46290,\"start\":46273},{\"end\":46300,\"start\":46290},{\"end\":46590,\"start\":46573},{\"end\":46600,\"start\":46590},{\"end\":46921,\"start\":46904},{\"end\":46931,\"start\":46921},{\"end\":47338,\"start\":47321},{\"end\":47347,\"start\":47338},{\"end\":47357,\"start\":47347},{\"end\":47625,\"start\":47614},{\"end\":47636,\"start\":47625},{\"end\":47877,\"start\":47869},{\"end\":47888,\"start\":47877},{\"end\":48152,\"start\":48140},{\"end\":48168,\"start\":48152},{\"end\":48325,\"start\":48317},{\"end\":48336,\"start\":48325},{\"end\":48345,\"start\":48336},{\"end\":48354,\"start\":48345},{\"end\":48681,\"start\":48668},{\"end\":48976,\"start\":48966},{\"end\":49574,\"start\":49564},{\"end\":50307,\"start\":50299}]", "bib_venue": "[{\"end\":37214,\"start\":37192},{\"end\":37480,\"start\":37463},{\"end\":37706,\"start\":37689},{\"end\":38013,\"start\":37978},{\"end\":38377,\"start\":38337},{\"end\":38727,\"start\":38692},{\"end\":39108,\"start\":39079},{\"end\":39460,\"start\":39398},{\"end\":39948,\"start\":39912},{\"end\":40326,\"start\":40302},{\"end\":40662,\"start\":40651},{\"end\":41014,\"start\":41003},{\"end\":41327,\"start\":41310},{\"end\":41567,\"start\":41523},{\"end\":41828,\"start\":41793},{\"end\":42154,\"start\":42135},{\"end\":42536,\"start\":42496},{\"end\":42794,\"start\":42748},{\"end\":43003,\"start\":42959},{\"end\":43268,\"start\":43252},{\"end\":43475,\"start\":43464},{\"end\":43634,\"start\":43611},{\"end\":43833,\"start\":43807},{\"end\":44149,\"start\":44127},{\"end\":44417,\"start\":44390},{\"end\":44702,\"start\":44681},{\"end\":44944,\"start\":44898},{\"end\":45154,\"start\":45133},{\"end\":45398,\"start\":45387},{\"end\":45686,\"start\":45667},{\"end\":46009,\"start\":45990},{\"end\":46328,\"start\":46300},{\"end\":46611,\"start\":46600},{\"end\":46966,\"start\":46931},{\"end\":47368,\"start\":47357},{\"end\":47647,\"start\":47636},{\"end\":47932,\"start\":47888},{\"end\":48373,\"start\":48354},{\"end\":48704,\"start\":48681},{\"end\":48997,\"start\":48976},{\"end\":49602,\"start\":49574},{\"end\":50297,\"start\":50020},{\"end\":39481,\"start\":39475},{\"end\":49022,\"start\":49008}]"}}}, "year": 2023, "month": 12, "day": 17}