{"id": 15600925, "updated": "2023-11-07 21:07:05.755", "metadata": {"title": "Improving Neural Machine Translation Models with Monolingual Data", "authors": "[{\"first\":\"Rico\",\"last\":\"Sennrich\",\"middle\":[]},{\"first\":\"Barry\",\"last\":\"Haddow\",\"middle\":[]},{\"first\":\"Alexandra\",\"last\":\"Birch\",\"middle\":[]}]", "venue": "ArXiv", "journal": "ArXiv", "publication_date": {"year": 2015, "month": 11, "day": 20}, "abstract": "Neural Machine Translation (NMT) has obtained state-of-the art performance for several language pairs, while only using parallel data for training. Target-side monolingual data plays an important role in boosting fluency for phrase-based statistical machine translation, and we investigate the use of monolingual data for NMT. In contrast to previous work, which combines NMT models with separately trained language models, we note that encoder-decoder NMT architectures already have the capacity to learn the same information as a language model, and we explore strategies to train with monolingual data without changing the neural network architecture. By pairing monolingual training data with an automatic back-translation, we can treat it as additional parallel training data, and we obtain substantial improvements on the WMT 15 task English<->German (+2.8-3.7 BLEU), and for the low-resourced IWSLT 14 task Turkish->English (+2.1-3.4 BLEU), obtaining new state-of-the-art results. We also show that fine-tuning on in-domain monolingual and parallel data gives substantial improvements for the IWSLT 15 task English->German.", "fields_of_study": "[\"Computer Science\"]", "external_ids": {"arxiv": "1511.06709", "mag": "2963216553", "acl": "P16-1009", "pubmed": null, "pubmedcentral": null, "dblp": "journals/corr/SennrichHB15a", "doi": "10.18653/v1/p16-1009"}}, "content": {"source": {"pdf_hash": "e5bf3c3b1bc9ebb68c636425458490d90f9d20a1", "pdf_src": "Arxiv", "pdf_uri": "[\"https://arxiv.org/pdf/1511.06709v4.pdf\"]", "oa_url_match": false, "oa_info": {"license": null, "open_access_url": "https://doi.org/10.18653/v1/p16-1009", "status": "BRONZE"}}, "grobid": {"id": "b062b5623a31263a73d43b54427063ec7131534d", "type": "plain-text", "url": "s3://ai2-s2-science-parse-plus-prod/parse-results/s2orc_worker/e5bf3c3b1bc9ebb68c636425458490d90f9d20a1.txt", "contents": "\nImproving Neural Machine Translation Models with Monolingual Data\n3 Jun 2016\n\nRico Sennrich rico.sennrich@ed.ac.uk \nSchool of Informatics\nUniversity of Edinburgh\n\n\nBarry Haddow bhaddow@inf.ed.ac.uk \nSchool of Informatics\nUniversity of Edinburgh\n\n\nAlexandra Birch a.birch@ed.ac.uk \nSchool of Informatics\nUniversity of Edinburgh\n\n\nImproving Neural Machine Translation Models with Monolingual Data\n3 Jun 20166A003B4DDCBED52E7CDC475759C04E0DarXiv:1511.06709v4[cs.CL]\nNeural Machine Translation (NMT) has obtained state-of-the art performance for several language pairs, while only using parallel data for training.Targetside monolingual data plays an important role in boosting fluency for phrasebased statistical machine translation, and we investigate the use of monolingual data for NMT.In contrast to previous work, which combines NMT models with separately trained language models, we note that encoder-decoder NMT architectures already have the capacity to learn the same information as a language model, and we explore strategies to train with monolingual data without changing the neural network architecture.By pairing monolingual training data with an automatic backtranslation, we can treat it as additional parallel training data, and we obtain substantial improvements on the WMT 15 task English↔German (+2.8-3.7 BLEU), and for the low-resourced IWSLT 14 task Turkish→English (+2.1-3.4BLEU), obtaining new state-of-the-art results.We also show that fine-tuning on in-domain monolingual and parallel data gives substantial improvements for the IWSLT 15 task English→German.\n\nIntroduction\n\nNeural Machine Translation (NMT) has obtained state-of-the art performance for several language pairs, while only using parallel data for training.Target-side monolingual data plays an important role in boosting fluency for phrase-based statisti-\n\nThe research presented in this publication was conducted in cooperation with Samsung Electronics Polska sp.z o.o.-Samsung R&D Institute Poland.cal machine translation, and we investigate the use of monolingual data for NMT.\n\nLanguage models trained on monolingual data have played a central role in statistical machine translation since the first IBM models (Brown et al., 1990).There are two major reasons for their importance.Firstly, word-based and phrase-based translation models make strong independence assumptions, with the probability of translation units estimated independently from context, and language models, by making different independence assumptions, can model how well these translation units fit together.Secondly, the amount of available monolingual data in the target language typically far exceeds the amount of parallel data, and models typically improve when trained on more data, or data more similar to the translation task.\n\nIn (attentional) encoder-decoder architectures for neural machine translation (Sutskever et al., 2014;Bahdanau et al., 2015), the decoder is essentially an RNN language model that is also conditioned on source context, so the first rationale, adding a language model to compensate for the independence assumptions of the translation model, does not apply.However, the data argument is still valid in NMT, and we expect monolingual data to be especially helpful if parallel data is sparse, or a poor fit for the translation task, for instance because of a domain mismatch.\n\nIn contrast to previous work, which integrates a separately trained RNN language model into the NMT model (Gülçehre et al., 2015), we explore strategies to include monolingual training data in the training process without changing the neural network architecture.This makes our approach applicable to different NMT architectures.\n\nThe main contributions of this paper are as follows:\n\n• we show that we can improve the machine translation quality of NMT systems by mixing monolingual target sentences into the training set.\n\n• we investigate two different methods to fill the source side of monolingual training instances: using a dummy source sentence, and using a source sentence obtained via backtranslation, which we call synthetic.We find that the latter is more effective.\n\n• we successfully adapt NMT models to a new domain by fine-tuning with either monolingual or parallel in-domain data.\n\n\nNeural Machine Translation\n\nWe follow the neural machine translation architecture by Bahdanau et al. (2015), which we will briefly summarize here.However, we note that our approach is not specific to this architecture.The neural machine translation system is implemented as an encoder-decoder network with recurrent neural networks.\n\nThe encoder is a bidirectional neural network with gated recurrent units (Cho et al., 2014) that reads an input sequence x = (x 1 , ..., x m ) and calculates a forward sequence of hidden states ( − → h 1 , ..., − → h m ), and a backward sequence\n( ← − h 1 , ..., ← − h m ).\nThe hidden states − → h j and ← − h j are concatenated to obtain the annotation vector h j .\n\nThe decoder is a recurrent neural network that predicts a target sequence y = (y 1 , ..., y n ).Each word y i is predicted based on a recurrent hidden state s i , the previously predicted word y i−1 , and a context vector c i .c i is computed as a weighted sum of the annotations h j .The weight of each annotation h j is computed through an alignment model α ij , which models the probability that y i is aligned to x j .The alignment model is a singlelayer feedforward neural network that is learned jointly with the rest of the network through backpropagation.\n\nA detailed description can be found in (Bahdanau et al., 2015).Training is performed on a parallel corpus with stochastic gradient descent.For translation, a beam search with small beam size is employed.\n\n\nNMT Training with Monolingual Training Data\n\nIn machine translation, more monolingual data (or monolingual data more similar to the test set)\n\nserves to improve the estimate of the prior probability p(T ) of the target sentence T , before taking the source sentence S into account.In contrast to (Gülçehre et al., 2015), who train separate language models on monolingual training data and incorporate them into the neural network through shallow or deep fusion, we propose techniques to train the main NMT model with monolingual data, exploiting the fact that encoder-decoder neural networks already condition the probability distribution of the next target word on the previous target words.We describe two strategies to do this: providing monolingual training examples with an empty (or dummy) source sentence, or providing monolingual training data with a synthetic source sentence that is obtained from automatically translating the target sentence into the source language, which we will refer to as back-translation.\n\n\nDummy Source Sentences\n\nThe first technique we employ is to treat monolingual training examples as parallel examples with empty source side, essentially adding training examples whose context vector c i is uninformative, and for which the network has to fully rely on the previous target words for its prediction.This could be conceived as a form of dropout (Hinton et al., 2012), with the difference that the training instances that have the context vector dropped out constitute novel training data.We can also conceive of this setup as multi-task learning, with the two tasks being translation when the source is known, and language modelling when it is unknown.\n\nDuring training, we use both parallel and monolingual training examples in the ratio 1-to-1, and randomly shuffle them.We define an epoch as one iteration through the parallel data set, and resample from the monolingual data set for every epoch.We pair monolingual sentences with a single-word dummy source side <null> to allow processing of both parallel and monolingual training examples with the same network graph.1For monolingual minibatches2 , we freeze the network parameters of the encoder and the attention model.\n\nOne problem with this integration of monolin-gual data is that we cannot arbitrarily increase the ratio of monolingual training instances, or finetune a model with only monolingual training data, because different output layer parameters are optimal for the two tasks, and the network 'unlearns' its conditioning on the source context if the ratio of monolingual training instances is too high.\n\n\nSynthetic Source Sentences\n\nTo ensure that the output layer remains sensitive to the source context, and that good parameters are not unlearned from monolingual data, we propose to pair monolingual training instances with a synthetic source sentence from which a context vector can be approximated.We obtain these through back-translation, i.e. an automatic translation of the monolingual target text into the source language.\n\nDuring training, we mix synthetic parallel text into the original (human-translated) parallel text and do not distinguish between the two: no network parameters are frozen.Importantly, only the source side of these additional training examples is synthetic, and the target side comes from the monolingual corpus.\n\n\nEvaluation\n\nWe evaluate NMT training on parallel text, and with additional monolingual data, on English↔German and Turkish→English, using training and test data from WMT 15 for English↔German, IWSLT 15 for English→German, and IWSLT 14 for Turkish→English.\n\n\nData and Methods\n\nWe use Groundhog 3 as the implementation of the NMT system for all experiments (Bahdanau et al., 2015;Jean et al., 2015a).We generally follow the settings and training procedure described by Sennrich et al. (2016).\n\nFor English↔German, we report case-sensitive BLEU on detokenized text with mteval-v13a.plfor comparison to official WMT and IWSLT results.For Turkish→English, we report case-sensitive BLEU on tokenized text with multi-bleu.perl for comparison to results by Gülçehre et al. (2015).\n\nGülçehre and replace out-of-vocabulary words with a special UNK symbol.They remove monolingual sentences with more than 10% UNK symbols.In contrast, we represent unseen words as sequences of subword units (Sennrich et al., 2016), and can represent any additional training data with the existing network vocabulary that was learned on the parallel data.In all experiments, the network vocabulary remains fixed.\n\n\nEnglish↔German\n\nWe use all parallel training data provided by WMT 2015(Bojar et al., 2015) 4 .We use the News Crawl corpora as additional training data for the experiments with monolingual data.The amount of training data is shown in Table 1.Baseline models are trained for a week.Ensembles are sampled from the last 4 saved models of training (saved at 12h-intervals).Each model is fine-tuned with fixed embeddings for 12 hours.\n\nFor the experiments with synthetic parallel data, we back-translate a random sample of 3 600 000 sentences from the German monolingual data set into English.The German→English system used for this is the baseline system (parallel).Translation took about a week on an NVIDIA Titan Black GPU.For experiments in German→English, we back-translate 4 200 000 monolingual English sentences into German, using the English→German system +synthetic.Note that we always use single models for backtranslation, not ensembles.We leave it to future work to explore how sensitive NMT training with synthetic data is to the quality of the backtranslation.\n\nWe tokenize and truecase the training data, and represent rare words via BPE (Sennrich et al., 2016).\n\nSpecifically, we follow Sennrich et al. (2016)  The network vocabulary size is 90 000.We also perform experiments on the IWSLT 15 test sets to investigate a cross-domain setting. 5he test sets consist of TED talk transcripts.As indomain training data, IWSLT provides the WIT 3 parallel corpus (Cettolo et al., 2012), which also consists of TED talks.\n\n\nTurkish→English\n\nWe use data provided for the IWSLT 14 machine translation track (Cettolo et al., 2014), namely the WIT 3 parallel corpus (Cettolo et al., 2012), which consists of TED talks, and the SETimes corpus (Tyers and Alperen, 2010). 6After removal of sentence pairs which contain empty lines or lines with a length ratio above 9, we retain 320 000 sentence pairs of training data.For the experiments with monolingual training data, we use the English LDC Gigaword corpus (Fifth Edition).The amount of training data is shown in Table 2.With only 320 000 sentences of parallel data available for training, this is a much lower-resourced translation setting than English↔German.Gülçehre et al. (2015) segment the Turkish text with the morphology tool Zemberek, followed by a disambiguation of the morphological analysis (Sak et al., 2007), and removal of non-surface tokens produced by the analysis.We use the same preprocessing7 .For both Turkish and English, we represent rare words (or morphemes in the case of Turkish) as character bigram sequences (Sennrich et al., 2016).The 20 000 most frequent words (morphemes) are left unsegmented.The networks have a vocabulary size of 23 000 symbols.\n\nTo obtain a synthetic parallel training set, we back-translate a random sample of 3 200 000 sentences from Gigaword.We use an English→Turkish NMT system trained with the same settings as the Turkish→English baseline system.\n\nWe found overfitting to be a bigger problem than with the larger English↔German data set, and follow Gülçehre et al. (2015) in using Gaussian noise (stddev 0.01) (Graves, 2011), and dropout on the output layer (p=0.5)(Hinton et al., 2012).We also use early stopping, based on BLEU measured every three hours on tst2010, which we treat as development set.For Turkish→English, we use gradient clipping with threshold 5, following Gülçehre et al. (2015), in contrast to the threshold 1 that we use for English↔German, following Jean et al. (2015a).\n\n\nResults\n\n\nEnglish→German WMT 15\n\nTable 3 shows English→German results with WMT training and test data.We find that mixing parallel training data with monolingual data with a dummy source side in a ratio of 1-1 improves quality by 0.4-0.5 BLEU for the single system, 1 BLEU for the ensemble.We train the system for twice as long as the baseline to provide the training algorithm with a similar amount of parallel training instances.To ensure that the quality improvement is due to the monolingual training instances, and not just increased training time, we also continued training our baseline system for another week, but saw no improvements in BLEU.\n\nIncluding synthetic data during training is very effective, and yields an improvement over our baseline by 2.8-3.4BLEU.\n\nOur best ensemble system also outperforms a syntaxbased baseline (Sennrich and Haddow, 2015) by 1.2-2.1 BLEU.We also substantially outperform NMT results reported by Jean et al. (2015a) and Luong et al. (2015), who previously reported SOTA result. 8We note that the difference is particularly large for single systems, since our ensemble is not as diverse as that of Luong et al. (2015), who used 8 independently trained ensemble components, whereas we sampled 4 ensemble components from the same training run.3, trained only on WMT data.System 2, trained on parallel and synthetic WMT data, obtains a BLEU score of 25.5 on tst2015.We observe that even a small amount of fine-tuning 9 , i.e. continued training of an existing model, on WIT data can adapt a system trained on WMT data to the TED domain.By back-translating the monolingual WIT corpus (using a German→English system trained on WMT data, i.e. without in-domain knowledge), we obtain the synthetic data set WIT synth .A single epoch of fine-tuning on WIT synth (system 4) results in a BLEU score of 26.7 on tst2015, or an improvement of 1.2 BLEU.We observed no improvement from fine-tuning on WIT mono , the monolingual TED corpus with dummy input (system 3).\n\n\nEnglish→German IWSLT 15\n\nThese adaptation experiments with monolingual data are slightly artificial in that parallel training data is available.System 5, which is finetuned with the original WIT training data, obtains a BLEU of 28.4 on tst2015, which is an improve- 9 We leave the word embeddings fixed for fine-tuning.BLEU name 2014 2015 PBSMT (Haddow et al., 2015) 28.8 29.3 NMT (Gülçehre et al., 2015) 23.6 -+shallow fusion 23.7 -+deep fusion 24.0 parallel 25.9 26.7 +synthetic 29.5 30.4 +synthetic (ensemble of 4) 30.8 31.6\n\nTable 5: German→English translation performance (BLEU) on WMT training/test sets (new-stest2014; newstest2015).ment of 2.9 BLEU.While it is unsurprising that in-domain parallel data is most valuable, we find it encouraging that NMT domain adaptation with monolingual data is also possible, and effective, since there are settings where only monolingual in-domain data is available.\n\nThe best results published on this dataset are by Luong and Manning (2015), obtained with an ensemble of 8 independently trained models.In a comparison of single-model results, we outperform their model on tst2013 by 1 BLEU.\n\n\nGerman→English WMT 15\n\nResults for German→English on the WMT 15 data sets are shown in Table 5.Like for the reverse translation direction, we see substantial improvements (3.6-3.7 BLEU) from adding monolingual training data with synthetic source sentences, which is substantially bigger than the improvement observed with deep fusion (Gülçehre et al., 2015); our ensemble outperforms the previous state of the art on newstest2015 by 2.3 BLEU.\n\n\nTurkish→English IWSLT 14\n\nTable 6 shows results for Turkish→English.On average, we see an improvement of 0.6 BLEU on the test sets from adding monolingual data with a dummy source side in a 1-1 ratio10 , although we note a high variance between different test sets.\n\nWith synthetic training data (Gigaword synth ), we outperform the baseline by 2.7 BLEU on average, and also outperform results obtained via shallow or deep fusion by Gülçehre et al. ( 2015) by 0.5 BLEU on average.To compare to what extent synthetic data has a regularization effect, even without novel training data, we also back-translate the target side of the parallel training text to obtain the training corpus parallel synth .Mixing the original parallel corpus with parallel synth (ratio 1-1) gives some improvement over the baseline (1.7 BLEU on average), but the novel monolingual training data (Gigaword mono ) gives higher improvements, despite being out-of-domain in relation to the test sets.We speculate that novel in-domain monolingual data would lead to even higher improvements.\n\n\nBack-translation Quality for Synthetic Data\n\nOne question that our previous experiments leave open is how the quality of the automatic backtranslation affects training with synthetic data.To investigate this question, we back-translate the same German monolingual corpus with three different German→English systems:\n\n• with our baseline system and greedy decoding\n\n• with our baseline system and beam search (beam size 12).This is the same system used for the experiments in • with the German→English system that was itself trained with synthetic data (beam size 12).\n\nBLEU scores of the German→English systems, and of the resulting English→German systems that are trained on the different backtranslations, are shown in Table 7.The quality of the German→English back-translation differs substantially, with a difference of 6 BLEU on new-stest2015.Regarding the English→German systems trained on the different synthetic corpora, we find that the 6 BLEU difference in back-translation quality leads to a 0.6-0.7 BLEU difference in translation quality.This is balanced by the fact that we can increase the speed of back-translation by trading off some quality, for instance by reducing beam size, and we leave it to future research to explore how much the amount of synthetic data affects translation quality.\n\nWe also show results for an ensemble of 3 models (the best single model of each training run), and 12 models (all 4 models of each training run).Thanks to the increased diversity of the ensemble components, these ensembles outperform the ensembles of 4 models that were all sampled from the same training run, and we obtain another improvement of 0.8-1.0BLEU.\n\n\nContrast to Phrase-based SMT\n\nThe back-translation of monolingual target data into the source language to produce synthetic parallel text has been previously explored for phrase-based SMT (Bertoldi and Federico, 2009;Lambert et al., 2011) To explore the relative effectiveness of backtranslated data for phrase-based SMT and NMT, we train two phrase-based SMT systems with Moses (Koehn et al., 2007), using only WMT parallel , or both WMT parallel and WMT synth_de for training the translation and reordering model.Both systems contain the same language model, a 5-gram Kneser-Ney model trained on all available WMT data.We use the baseline features described by Haddow et al. (2015).\n\nResults are shown in Table 8.In phrasebased SMT, we find that the use of back-translated training data has a moderate positive effect on the WMT test sets (+0.7 BLEU), but not on the IWSLT test sets.This is in line with the expectation that the main effect of back-translated data for phrase-based SMT is domain adaptation (Bertoldi and Federico, 2009).Both the WMT test sets and the News Crawl corpora which we used as monolingual data come from the same source, a web crawl of newspaper articles. 11In contrast, News Crawl is out-of-domain for the IWSLT test sets. 11The WMT test sets are held-out from News Crawl.In contrast to phrase-based SMT, which can make use of monolingual data via the language model, NMT has so far not been able to use monolingual data to great effect, and without requiring architectural changes.We find that the effect of synthetic parallel data is not limited to domain adaptation, and that even out-of-domain synthetic data improves NMT quality, as in our evaluation on IWSLT.The fact that the synthetic data is more effective on the WMT test sets (+2.9 BLEU) than on the IWSLT test sets (+1.2 BLEU) supports the hypothesis that domain adaptation contributes to the effectiveness of adding synthetic data to NMT training.\n\nIt is an important finding that back-translated data, which is mainly effective for domain adaptation in phrase-based SMT, is more generally useful in NMT, and has positive effects that go beyond domain adaptation.In the next section, we will investigate further reasons for its effectiveness.\n\n\nAnalysis\n\nWe previously indicated that overfitting is a concern with our baseline system, especially on small data sets of several hundred thousand training sentences, despite the regularization employed.This overfitting is illustrated in Figure 1, which plots training and development set cross-entropy by training time for Turkish→English models.For comparability, we measure training set crossentropy for all models on the same random sample of the parallel training set.We can see that the model trained on only parallel training data quickly overfits, while all three monolingual data sets (parallel synth , Gigaword mono , or Gigaword synth ) delay overfitting, and give better perplexity on the development set.The best development set cross-entropy is reached by Gigaword synth .\n\nFigure 2 shows cross-entropy for English→German, comparing the system trained on only parallel data and the system that includes synthetic training data.Since more training data is available for English→German, there is no indication that overfitting happens during the first 40 million training instances (or 7 days of training); while both systems obtain comparable training set cross-entropies, the system with synthetic data reaches a lower cross-entropy on the development set.One explanation for this is the domain effect discussed in the previous section.\n\nA central theoretical expectation is that monolingual target-side data improves the model's flu- ency, its ability to produce natural target-language sentences.As a proxy to sentence-level fluency, we investigate word-level fluency, specifically words produced as sequences of subword units, and whether NMT systems trained with additional monolingual data produce more natural words.For instance, the English→German systems translate the English phrase civil rights protections as a single compound, composed of three subword units: Bürger|rechts|schutzes12 , and we analyze how many of these multi-unit words that the translation systems produce are well-formed German words.\n\nWe compare the number of words in the system output for the newstest2015 test set which are produced via subword units, and that do not occur in the parallel training corpus.We also count how many of them are attested in the full monolingual corpus or the reference translation, which we all consider 'natural'.Additionally, the main authors, a native speaker of German, annotated a random subset (n = 100) of unattested words of each system according to their naturalness13 , distinguishing between natural German words (or names) such as Literatur|klassen 'literature classes', and nonsensical ones such as *As|best|atten (a missspelling of Astbestmatten 'asbestos mats').\n\nIn the results (Table 9), we see that the systems trained with additional monolingual or synthetic data have a higher proportion of novel words attested in the non-parallel data, and a higher proportion that is deemed natural by our annotator.This supports our expectation that additional monolingual data improves the (word-level) fluency of the NMT system.\n\nTo our knowledge, the integration of monolingual data for pure neural machine translation architectures was first investigated by (Gülçehre et al., 2015), who train monolingual language models independently, and then integrate them during decoding through rescoring of the beam (shallow fusion), or by adding the recurrent hidden state of the language model to the decoder state of the encoder-decoder network, with an additional controller mechanism that controls the magnitude of the LM signal (deep fusion).In deep fusion, the controller parameters and output parameters are tuned on further parallel training data, but the language model parameters are fixed during the finetuning stage.Jean et al. (2015b) also report on experiments with reranking of NMT output with a 5-gram language model, but improvements are small (between 0.1-0.5 BLEU).\n\nThe production of synthetic parallel texts bears resemblance to data augmentation techniques used in computer vision, where datasets are often augmented with rotated, scaled, or otherwise distorted variants of the (limited) training set (Rowley et al., 1996).\n\nAnother similar avenue of research is selftraining (McClosky et al., 2006;Schwenk, 2008).The main difference is that self-training typically refers to scenario where the training set is enhanced with training instances with artificially produced output labels, whereas we start with human-produced output (i.e. the translation), and artificially produce an input.We expect that this is more robust towards noise in the automatic translation.Improving NMT with monolingual source data, following similar work on phrasebased SMT (Schwenk, 2008), remains possible future work.\n\nDomain adaptation of neural networks via continued training has been shown to be effective for neural language models by (Ter-Sarkisov et al., 2015), and in work parallel to ours, for neural translation models (Luong and Manning, 2015).We are the first to show that we can effectively adapt neural translation models with monolingual data.\n\n\nConclusion\n\nIn this paper, we propose two simple methods to use monolingual training data during training of NMT systems, with no changes to the network architecture.Providing training examples with dummy source context was successful to some extent, but we achieve substantial gains in all tasks, and new SOTA results, via back-translation of monolingual target data into the source language, and treating this synthetic data as additional training data.We also show that small amounts of indomain monolingual data, back-translated into the source language, can be effectively used for domain adaptation.In our analysis, we identified domain adaptation effects, a reduction of overfitting, and improved fluency as reasons for the effectiveness of using monolingual data for training.\n\nWhile our experiments did make use of monolingual training data, we only used a small random sample of the available data, especially for the experiments with synthetic parallel data.It is conceivable that larger synthetic data sets, or data sets obtained via data selection, will provide bigger performance benefits.\n\nBecause we do not change the neural network architecture to integrate monolingual training data, our approach can be easily applied to other NMT systems.We expect that the effectiveness of our approach not only varies with the quality of the MT system used for back-translation, but also depends on the amount (and similarity to the test set) of available parallel and monolingual data, and the extent of overfitting of the baseline model.Future work will explore the effectiveness of our approach in more settings.\n\nFigure 1 :\n1\nFigure 1: Turkish→English training and development set (tst2010) cross-entropy as a function of training time (number of training instances) for different systems.\n\n\nFigure 2 :\n2\nFigure 2: English→German training and development set (newstest2013) cross-entropy as a function of training time (number of training instances) for different systems.\n\n\nTable 1 :\n1\nEnglish↔German training data.\ndatasetsentencesWMT parallel4 200 000WIT parallel200 000WMT mono_de 160 000 000WMT synth_de3 600 000WMT mono_en 118 000 000WMT synth_en4 200 000\net al. (2015) determine the network vocabulary based on the parallel training data, 3 github.com/sebastien-j/LV_groundhog\n\n\nTable 2 :\n2\nin performing BPE on the joint vocabulary with 89 500 merge operations.Turkish→English training data.\ndatasetsentencesWIT160 000SETimes160 000Gigaword mono 177 000 000Gigaword synth3 200 000\n\nTable 4 shows\n4\nEnglish→German results on IWSLT test sets.IWSLT test sets consist of TED talks, and are thus very dissimilar from the WMT\nBLEU\n\nTable 3 :\n3\nEnglish→German translation performance (BLEU) on WMT training/test sets.Ens-4: ensemble of 4 models.Number of training instances varies due to differences in training time and speed.\nnamefine-tuningBLEUdatainstances tst2013 tst2014 tst2015NMT (Luong and Manning, 2015) (single model)29.4--NMT (Luong and Manning, 2015) (ensemble of 8)31.427.630.11 parallel--25.222.624.02 +synthetic--26.523.525.53 2+WIT mono_de WMT parallel / WIT mono 200k/200k26.623.625.44 2+WIT synth_de WIT synth200k28.224.426.75 2+WIT parallelWIT200k30.425.928.4\n\nTable 4 :\n4\nEnglish→German translation performance (BLEU) on IWSLT test sets (TED talks).Single models.\n\ntest sets, which are news texts.We investigate if monolingual training data is especially valuable if it can be used to adapt a model to a new genre or domain, specifically adapting a system trained on WMT data to translating TED talks.Systems 1 and 2 correspond to systems in Table\n\n\nTable 3\n3.\n\nTable 6 :\n6\nTurkish→English translation performance (tokenized BLEU) on IWSLT test sets (TED talks).Single models.Number of training instances varies due to early stopping.\n. While our approach is tech-nically similar, synthetic parallel data fulfills novel\nOne could force the context vector ci to be 0 for monolingual training instances, but we found that this does not solve the main problem with this approach, discussed below.\n2 For efficiency,Bahdanau et al. (2015) sort sets of 20 minibatches according to length. This also groups monolingual training instances together.\nhttp://www.statmt.org/wmt15/\nhttp://workshop2015.iwslt.org/\nhttp://workshop2014.iwslt.org/\ngithub.com/orhanf/zemberekMorphTR\nLuong et al. (2015) report 20.9 BLEU (tokenized) on newstest2014 with a single model, and 23.0 BLEU with an ensemble of 8 models. Our best single system achieves a tokenized BLEU (as opposed to untokenized scores reported in Table3) of 23.8, and our ensemble reaches 25.0 BLEU.\nWe also experimented with higher ratios of monolingual data, but this led to decreased BLEU scores.\nSubword boundaries are marked with '|'.\nFor the annotation, the words were blinded regarding the system that produced them.\nAcknowledgmentsThe research presented in this publication was conducted in cooperation with Samsung Electronics Polska sp.z o.o.-Samsung R&D Institute Poland.This project received funding from the European Union's Horizon 2020 research and innovation programme under grant agreement 645452 (QT21).\nNeural Machine Translation by Jointly Learning to Align and Translate. Bahdanau, Proceedings of the International Conference on Learning Representations (ICLR). the International Conference on Learning Representations (ICLR)2015. 2015Dzmitry Bahdanau, Kyunghyun Cho, and Yoshua Bengio\n\nDomain adaptation for statistical machine translation with monolingual resources. Federico2009 Bertoldi, Nicola Bertoldi, Marcello Federico, ; Ondřej Bojar, Rajen Chatterjee, Christian Federmann, Barry Haddow, Matthias Huck, Chris Hokamp, Philipp Koehn, Varvara Logacheva, Christof Monz, Matteo Negri, Matt Post, Carolina Scarton, Lucia Specia, Marco Turchi, Proceedings of the Fourth Workshop on Statistical Machine Translation StatMT 09. the Fourth Workshop on Statistical Machine Translation StatMT 09Lisbon, PortugalAssociation for Computational Linguistics2009. 2015Proceedings of the Tenth Workshop on Statistical Machine Translation\n\nA Statistical Approach to Machine Translation. Brown, Computational Linguistics. 1621990. 1990\n\nWIT 3 : Web Inventory of Transcribed and Translated Talks. Cettolo, Proceedings of the 16 th Conference of the European Association for Machine Translation (EAMT). the 16 th Conference of the European Association for Machine Translation (EAMT)Trento, Italy; Lake Tahoe, CA, USA2012. 2012. Jan Niehues. 2014. 2014Proceedings of the 11th Workshop on Spoken Language Translation\n\nLearning Phrase Representations using RNN Encoder-Decoder for Statistical Machine Translation. Cho, Proceedings of the 2014 Conference on Empirical Methods in Natural Language Processing (EMNLP). the 2014 Conference on Empirical Methods in Natural Language Processing (EMNLP)Doha, QatarAssociation for Computational Linguistics2014. 2014\n\nPractical Variational Inference for Neural Networks. Alex Graves, CoRR, abs/1503.03535On Using Monolingual Corpora in Neural Machine Translation. Orhan Firat, Kelvin Xu, Kyunghyun Cho, Loïc Barrault, Huei-Chi Lin, Fethi Bougares, Holger Schwenk, Yoshua Bengio, Curran Associates, Inc2011. 201524Advances in Neural Information Processing Systems\n\nImproving neural networks by preventing co-adaptation of feature detectors. Haddow, CoRR, abs/1207.0580Nitish Srivastava, Alex Krizhevsky, Ilya Sutskever, and Ruslan Salakhutdinov. LisbonAssociation for Computational Linguistics2015. 2015. 2015. 2012The Edinburgh/JHU Phrase-based Machine Translation Systems for WMT\n\nOn Using Very Large Target Vocabulary for Neural Machine Translation. Jean , Proceedings of the 53rd Annual Meeting of the Association for Computational Linguistics and the 7th International Joint Conference on Natural Language Processing. Long Papers. the 53rd Annual Meeting of the Association for Computational Linguistics and the 7th International Joint Conference on Natural Language ProcessingBeijing, ChinaAssociation for Computational Linguistics2015a. 2015a1\n\nMoses: Open Source Toolkit for Statistical Machine Translation. Jean , Proceedings of the Tenth Workshop on Statistical Machine Translation. Ondřej Bojar, Alexandra Constantin, Evan Herbst, the Tenth Workshop on Statistical Machine TranslationLisbon, Portugal; Prague, Czech RepublicAssociation for Computational Linguistics2015b. 2015b. 2007Proceedings of the ACL-2007 Demo and Poster Sessions\n\nInvestigations on Translation Model Adaptation Using Monolingual Data. Lambert , Proceedings of the Sixth Workshop on Statistical Machine Translation. the Sixth Workshop on Statistical Machine TranslationEdinburgh, ScotlandAssociation for Computational Linguistics2011. 2011\n\nStanford Neural Machine Translation Systems for Spoken Language Domains. Manning2015] Minh-Thang Luong, Christopher D Luong, Manning, Proceedings of the International Workshop on Spoken Language Translation. the International Workshop on Spoken Language TranslationDa Nang, Vietnam2015. 2015\n\nEffective Approaches to Attention-based Neural Machine Translation. Luong, Proceedings of the 2015 Conference on Empirical Methods in Natural Language Processing. the 2015 Conference on Empirical Methods in Natural Language ProcessingLisbon, PortugalAssociation for Computational Linguistics2015. 2015\n\nEffective Selftraining for Parsing. Mcclosky, Proceedings of the Main Conference on Human Language Technology Conference of the North American Chapter of the Association of Computational Linguistics, HLT-NAACL '06. the Main Conference on Human Language Technology Conference of the North American Chapter of the Association of Computational Linguistics, HLT-NAACL '06New YorkAssociation for Computational Linguistics2006. 2006\n\nNeural Network-Based Face Detection. Rowley, Computer Vision and Pattern Recognition '96. 1996. 1996\n\nMorphological Disambiguation of Turkish Text with Perceptron Algorithm. Sak, CI-CLing 2007. 2007. 2007Haşim Sak, Tunga Güngör, and Murat Saraçlar\n\nInvestigations on Large-Scale Lightly-Supervised Training for Statistical Machine Translation. Holger Schwenk, International Workshop on Spoken Language Translation. 2008\n\nA Joint Dependency Model of Morphological and Syntactic Structure for Statistical Machine Translation. Haddow2015 Sennrich, Rico Sennrich, Barry Haddow, Proceedings of the 2015 Conference on Empirical Methods in Natural Language Processing. the 2015 Conference on Empirical Methods in Natural Language ProcessingLisbonPortugal. Association for Computational Linguistics2015\n\nNeural Machine Translation of Rare Words with Subword Units. Sennrich, Proceedings of the 54th Annual Meeting of the Association for Computational Linguistics (ACL 2016). the 54th Annual Meeting of the Association for Computational Linguistics (ACL 2016)Berlin, Germany2016. 2016\n\nSequence to Sequence Learning with Neural Networks. Sutskever, Advances in Neural Information Processing Systems 27: Annual Conference on Neural Information Processing Systems. Montreal, Quebec, Canada2014. 2014. 2014\n\nIncremental Adaptation Strategies for Neural Network Language Models. Ter-Sarkisov, Workshop on Exploitation of multilingual resources and tools for Central and (South) Eastern European Languages at the Language Resources and Evaluation Conference. Beijing, ChinaAssociation for Computational Linguistics2015. 2015. 2010Proceedings of the 3rd Workshop on Continuous Vector Space Models and their Compositionality\n", "annotations": {"author": "[{\"end\":164,\"start\":79},{\"end\":247,\"start\":165},{\"end\":329,\"start\":248}]", "publisher": null, "author_last_name": "[{\"end\":92,\"start\":84},{\"end\":177,\"start\":171},{\"end\":263,\"start\":258}]", "author_first_name": "[{\"end\":83,\"start\":79},{\"end\":170,\"start\":165},{\"end\":257,\"start\":248}]", "author_affiliation": "[{\"end\":163,\"start\":117},{\"end\":246,\"start\":200},{\"end\":328,\"start\":282}]", "title": "[{\"end\":66,\"start\":1},{\"end\":395,\"start\":330}]", "venue": null, "abstract": "[{\"end\":1582,\"start\":464}]", "bib_ref": "[{\"attributes\":{\"ref_id\":\"b2\"},\"end\":2224,\"start\":2204},{\"attributes\":{\"ref_id\":\"b18\"},\"end\":2901,\"start\":2877},{\"attributes\":{\"ref_id\":\"b0\"},\"end\":2923,\"start\":2901},{\"end\":3501,\"start\":3478},{\"attributes\":{\"ref_id\":\"b0\"},\"end\":4379,\"start\":4357},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":4697,\"start\":4679},{\"attributes\":{\"ref_id\":\"b0\"},\"end\":5601,\"start\":5578},{\"end\":6064,\"start\":6041},{\"end\":7149,\"start\":7128},{\"attributes\":{\"ref_id\":\"b0\"},\"end\":9479,\"start\":9456},{\"attributes\":{\"ref_id\":\"b7\"},\"end\":9498,\"start\":9479},{\"attributes\":{\"ref_id\":\"b17\"},\"end\":9590,\"start\":9568},{\"end\":9872,\"start\":9850},{\"attributes\":{\"ref_id\":\"b17\"},\"end\":10103,\"start\":10080},{\"end\":10357,\"start\":10349},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":10377,\"start\":10357},{\"attributes\":{\"ref_id\":\"b17\"},\"end\":11458,\"start\":11435},{\"attributes\":{\"ref_id\":\"b17\"},\"end\":11507,\"start\":11485},{\"attributes\":{\"ref_id\":\"b3\"},\"end\":11776,\"start\":11754},{\"attributes\":{\"ref_id\":\"b3\"},\"end\":11917,\"start\":11895},{\"attributes\":{\"ref_id\":\"b3\"},\"end\":11974,\"start\":11952},{\"end\":12519,\"start\":12497},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":12657,\"start\":12639},{\"attributes\":{\"ref_id\":\"b17\"},\"end\":12895,\"start\":12872},{\"end\":13364,\"start\":13342},{\"attributes\":{\"ref_id\":\"b5\"},\"end\":13417,\"start\":13403},{\"end\":13479,\"start\":13458},{\"end\":13691,\"start\":13669},{\"attributes\":{\"ref_id\":\"b16\"},\"end\":14655,\"start\":14628},{\"attributes\":{\"ref_id\":\"b7\"},\"end\":14748,\"start\":14729},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":14772,\"start\":14753},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":14949,\"start\":14930},{\"attributes\":{\"ref_id\":\"b6\"},\"end\":16153,\"start\":16132},{\"end\":16191,\"start\":16168},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":16773,\"start\":16749},{\"end\":17283,\"start\":17260},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":20324,\"start\":20295},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":20345,\"start\":20324},{\"end\":20506,\"start\":20480},{\"attributes\":{\"ref_id\":\"b6\"},\"end\":20790,\"start\":20770},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":21145,\"start\":21116},{\"end\":25566,\"start\":25543},{\"attributes\":{\"ref_id\":\"b13\"},\"end\":26520,\"start\":26499},{\"attributes\":{\"ref_id\":\"b12\"},\"end\":26597,\"start\":26574},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":26611,\"start\":26597},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":27065,\"start\":27050},{\"attributes\":{\"ref_id\":\"b19\"},\"end\":27246,\"start\":27219},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":27333,\"start\":27308},{\"attributes\":{\"ref_id\":\"b0\"},\"end\":31504,\"start\":31482},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":31756,\"start\":31737}]", "figure": "[{\"attributes\":{\"id\":\"fig_0\"},\"end\":29239,\"start\":29061},{\"attributes\":{\"id\":\"fig_1\"},\"end\":29422,\"start\":29240},{\"attributes\":{\"id\":\"tab_0\",\"type\":\"table\"},\"end\":29733,\"start\":29423},{\"attributes\":{\"id\":\"tab_1\",\"type\":\"table\"},\"end\":29937,\"start\":29734},{\"attributes\":{\"id\":\"tab_2\",\"type\":\"table\"},\"end\":30081,\"start\":29938},{\"attributes\":{\"id\":\"tab_3\",\"type\":\"table\"},\"end\":30629,\"start\":30082},{\"attributes\":{\"id\":\"tab_4\",\"type\":\"table\"},\"end\":31019,\"start\":30630},{\"attributes\":{\"id\":\"tab_5\",\"type\":\"table\"},\"end\":31031,\"start\":31020},{\"attributes\":{\"id\":\"tab_6\",\"type\":\"table\"},\"end\":31290,\"start\":31032}]", "paragraph": "[{\"end\":1844,\"start\":1598},{\"end\":2069,\"start\":1846},{\"end\":2797,\"start\":2071},{\"end\":3370,\"start\":2799},{\"end\":3701,\"start\":3372},{\"end\":3755,\"start\":3703},{\"end\":3895,\"start\":3757},{\"end\":4150,\"start\":3897},{\"end\":4269,\"start\":4152},{\"end\":4604,\"start\":4300},{\"end\":4851,\"start\":4606},{\"end\":4972,\"start\":4880},{\"end\":5537,\"start\":4974},{\"end\":5742,\"start\":5539},{\"end\":5886,\"start\":5790},{\"end\":6767,\"start\":5888},{\"end\":7435,\"start\":6794},{\"end\":7959,\"start\":7437},{\"end\":8355,\"start\":7961},{\"end\":8784,\"start\":8386},{\"end\":9098,\"start\":8786},{\"end\":9356,\"start\":9113},{\"end\":9591,\"start\":9377},{\"end\":9873,\"start\":9593},{\"end\":10284,\"start\":9875},{\"end\":10716,\"start\":10303},{\"end\":11356,\"start\":10718},{\"end\":11459,\"start\":11358},{\"end\":11811,\"start\":11461},{\"end\":13014,\"start\":11831},{\"end\":13239,\"start\":13016},{\"end\":13786,\"start\":13241},{\"end\":14440,\"start\":13822},{\"end\":14561,\"start\":14442},{\"end\":15784,\"start\":14563},{\"end\":16314,\"start\":15812},{\"end\":16697,\"start\":16316},{\"end\":16923,\"start\":16699},{\"end\":17368,\"start\":16949},{\"end\":17636,\"start\":17397},{\"end\":18433,\"start\":17638},{\"end\":18751,\"start\":18481},{\"end\":18799,\"start\":18753},{\"end\":19003,\"start\":18801},{\"end\":19743,\"start\":19005},{\"end\":20104,\"start\":19745},{\"end\":20791,\"start\":20137},{\"end\":22047,\"start\":20793},{\"end\":22342,\"start\":22049},{\"end\":23132,\"start\":22355},{\"end\":23696,\"start\":23134},{\"end\":24375,\"start\":23698},{\"end\":25051,\"start\":24377},{\"end\":25411,\"start\":25053},{\"end\":26260,\"start\":25413},{\"end\":26521,\"start\":26262},{\"end\":27096,\"start\":26523},{\"end\":27437,\"start\":27098},{\"end\":28224,\"start\":27452},{\"end\":28543,\"start\":28226},{\"end\":29060,\"start\":28545},{\"end\":29238,\"start\":29075},{\"end\":29421,\"start\":29254},{\"end\":29465,\"start\":29436},{\"end\":29732,\"start\":29611},{\"end\":29848,\"start\":29747},{\"end\":30076,\"start\":29955},{\"end\":30277,\"start\":30095},{\"end\":30734,\"start\":30643},{\"end\":31018,\"start\":30736},{\"end\":31205,\"start\":31045}]", "formula": "[{\"attributes\":{\"id\":\"formula_0\"},\"end\":4879,\"start\":4852}]", "table_ref": "[{\"attributes\":{\"ref_id\":\"tab_0\"},\"end\":10528,\"start\":10527},{\"attributes\":{\"ref_id\":\"tab_1\"},\"end\":12356,\"start\":12355},{\"attributes\":{\"ref_id\":\"tab_3\"},\"end\":13829,\"start\":13828},{\"attributes\":{\"ref_id\":\"tab_3\"},\"end\":15074,\"start\":15073},{\"end\":16323,\"start\":16322},{\"end\":17020,\"start\":17019},{\"attributes\":{\"ref_id\":\"tab_6\"},\"end\":17404,\"start\":17403},{\"end\":19164,\"start\":19163},{\"end\":20821,\"start\":20820},{\"end\":25076,\"start\":25075}]", "section_header": "[{\"attributes\":{\"n\":\"1\"},\"end\":1596,\"start\":1584},{\"attributes\":{\"n\":\"2\"},\"end\":4298,\"start\":4272},{\"attributes\":{\"n\":\"3\"},\"end\":5788,\"start\":5745},{\"attributes\":{\"n\":\"3.1\"},\"end\":6792,\"start\":6770},{\"attributes\":{\"n\":\"3.2\"},\"end\":8384,\"start\":8358},{\"attributes\":{\"n\":\"4\"},\"end\":9111,\"start\":9101},{\"attributes\":{\"n\":\"4.1\"},\"end\":9375,\"start\":9359},{\"attributes\":{\"n\":\"4.1.1\"},\"end\":10301,\"start\":10287},{\"attributes\":{\"n\":\"4.1.2\"},\"end\":11829,\"start\":11814},{\"attributes\":{\"n\":\"4.2\"},\"end\":13796,\"start\":13789},{\"attributes\":{\"n\":\"4.2.1\"},\"end\":13820,\"start\":13799},{\"attributes\":{\"n\":\"4.2.2\"},\"end\":15810,\"start\":15787},{\"attributes\":{\"n\":\"4.2.3\"},\"end\":16947,\"start\":16926},{\"attributes\":{\"n\":\"4.2.4\"},\"end\":17395,\"start\":17371},{\"attributes\":{\"n\":\"4.2.5\"},\"end\":18479,\"start\":18436},{\"attributes\":{\"n\":\"4.3\"},\"end\":20135,\"start\":20107},{\"attributes\":{\"n\":\"4.4\"},\"end\":22353,\"start\":22345},{\"attributes\":{\"n\":\"6\"},\"end\":27450,\"start\":27440},{\"end\":29072,\"start\":29062},{\"end\":29251,\"start\":29241},{\"end\":29433,\"start\":29424},{\"end\":29744,\"start\":29735},{\"end\":29952,\"start\":29939},{\"end\":30092,\"start\":30083},{\"end\":30640,\"start\":30631},{\"end\":31028,\"start\":31021},{\"end\":31042,\"start\":31033}]", "table": "[{\"end\":29610,\"start\":29466},{\"end\":29937,\"start\":29849},{\"end\":30081,\"start\":30077},{\"end\":30629,\"start\":30278},{\"end\":31031,\"start\":31030},{\"end\":31290,\"start\":31206}]", "figure_caption": "[{\"end\":29239,\"start\":29074},{\"end\":29422,\"start\":29253},{\"end\":29466,\"start\":29435},{\"end\":29849,\"start\":29746},{\"end\":30077,\"start\":29954},{\"end\":30278,\"start\":30094},{\"end\":30735,\"start\":30642},{\"end\":31206,\"start\":31044}]", "figure_ref": "[{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":22592,\"start\":22591},{\"attributes\":{\"ref_id\":\"fig_1\"},\"end\":23142,\"start\":23141}]", "bib_author_first_name": "[{\"end\":32917,\"start\":32905},{\"end\":32934,\"start\":32928},{\"end\":32953,\"start\":32945},{\"end\":32972,\"start\":32964},{\"end\":32985,\"start\":32980},{\"end\":33007,\"start\":32998},{\"end\":33024,\"start\":33019},{\"end\":33041,\"start\":33033},{\"end\":33053,\"start\":33048},{\"end\":33069,\"start\":33062},{\"end\":33084,\"start\":33077},{\"end\":33104,\"start\":33096},{\"end\":33117,\"start\":33111},{\"end\":33129,\"start\":33125},{\"end\":33144,\"start\":33136},{\"end\":33159,\"start\":33154},{\"end\":33173,\"start\":33168},{\"end\":34333,\"start\":34329},{\"end\":34427,\"start\":34422},{\"end\":34441,\"start\":34435},{\"end\":34455,\"start\":34446},{\"end\":34465,\"start\":34461},{\"end\":34484,\"start\":34476},{\"end\":34495,\"start\":34490},{\"end\":34512,\"start\":34506},{\"end\":34528,\"start\":34522},{\"end\":35014,\"start\":35010},{\"end\":35477,\"start\":35473},{\"end\":35556,\"start\":35550},{\"end\":35573,\"start\":35564},{\"end\":35590,\"start\":35586},{\"end\":35883,\"start\":35876},{\"end\":36177,\"start\":36154},{\"end\":36196,\"start\":36185},{\"end\":36198,\"start\":36197},{\"end\":37455,\"start\":37449},{\"end\":37639,\"start\":37629},{\"end\":37654,\"start\":37650},{\"end\":37670,\"start\":37665}]", "bib_author_last_name": "[{\"end\":32616,\"start\":32608},{\"end\":32926,\"start\":32918},{\"end\":32943,\"start\":32935},{\"end\":32962,\"start\":32954},{\"end\":32978,\"start\":32973},{\"end\":32996,\"start\":32986},{\"end\":33017,\"start\":33008},{\"end\":33031,\"start\":33025},{\"end\":33046,\"start\":33042},{\"end\":33060,\"start\":33054},{\"end\":33075,\"start\":33070},{\"end\":33094,\"start\":33085},{\"end\":33109,\"start\":33105},{\"end\":33123,\"start\":33118},{\"end\":33134,\"start\":33130},{\"end\":33152,\"start\":33145},{\"end\":33166,\"start\":33160},{\"end\":33180,\"start\":33174},{\"end\":33516,\"start\":33511},{\"end\":33626,\"start\":33619},{\"end\":34035,\"start\":34032},{\"end\":34340,\"start\":34334},{\"end\":34433,\"start\":34428},{\"end\":34444,\"start\":34442},{\"end\":34459,\"start\":34456},{\"end\":34474,\"start\":34466},{\"end\":34488,\"start\":34485},{\"end\":34504,\"start\":34496},{\"end\":34520,\"start\":34513},{\"end\":34535,\"start\":34529},{\"end\":34704,\"start\":34698},{\"end\":35562,\"start\":35557},{\"end\":35584,\"start\":35574},{\"end\":35597,\"start\":35591},{\"end\":36183,\"start\":36178},{\"end\":36204,\"start\":36199},{\"end\":36213,\"start\":36206},{\"end\":36447,\"start\":36442},{\"end\":36721,\"start\":36713},{\"end\":37148,\"start\":37142},{\"end\":37282,\"start\":37279},{\"end\":37463,\"start\":37456},{\"end\":37648,\"start\":37640},{\"end\":37663,\"start\":37655},{\"end\":37677,\"start\":37671},{\"end\":37970,\"start\":37962},{\"end\":38243,\"start\":38234},{\"end\":38483,\"start\":38471}]", "bib_entry": "[{\"attributes\":{\"id\":\"b0\",\"matched_paper_id\":11212020},\"end\":32821,\"start\":32537},{\"attributes\":{\"id\":\"b1\",\"matched_paper_id\":3034327},\"end\":33462,\"start\":32823},{\"attributes\":{\"id\":\"b2\",\"matched_paper_id\":14386564},\"end\":33558,\"start\":33464},{\"attributes\":{\"id\":\"b3\",\"matched_paper_id\":26275404},\"end\":33935,\"start\":33560},{\"attributes\":{\"id\":\"b4\",\"matched_paper_id\":5590763},\"end\":34274,\"start\":33937},{\"attributes\":{\"doi\":\"CoRR, abs/1503.03535\",\"id\":\"b5\",\"matched_paper_id\":14885866},\"end\":34620,\"start\":34276},{\"attributes\":{\"doi\":\"CoRR, abs/1207.0580\",\"id\":\"b6\",\"matched_paper_id\":14832074},\"end\":34938,\"start\":34622},{\"attributes\":{\"id\":\"b7\",\"matched_paper_id\":2863491},\"end\":35407,\"start\":34940},{\"attributes\":{\"id\":\"b8\",\"matched_paper_id\":794019},\"end\":35803,\"start\":35409},{\"attributes\":{\"id\":\"b9\",\"matched_paper_id\":11120415},\"end\":36079,\"start\":35805},{\"attributes\":{\"id\":\"b10\",\"matched_paper_id\":14646537},\"end\":36372,\"start\":36081},{\"attributes\":{\"id\":\"b11\",\"matched_paper_id\":1998416},\"end\":36675,\"start\":36374},{\"attributes\":{\"id\":\"b12\"},\"end\":37103,\"start\":36677},{\"attributes\":{\"id\":\"b13\",\"matched_paper_id\":40120983},\"end\":37205,\"start\":37105},{\"attributes\":{\"id\":\"b14\",\"matched_paper_id\":6064026},\"end\":37352,\"start\":37207},{\"attributes\":{\"id\":\"b15\",\"matched_paper_id\":10849474},\"end\":37524,\"start\":37354},{\"attributes\":{\"id\":\"b16\",\"matched_paper_id\":13963988},\"end\":37899,\"start\":37526},{\"attributes\":{\"id\":\"b17\",\"matched_paper_id\":1114678},\"end\":38180,\"start\":37901},{\"attributes\":{\"id\":\"b18\",\"matched_paper_id\":7961699},\"end\":38399,\"start\":38182},{\"attributes\":{\"id\":\"b19\",\"matched_paper_id\":5270848},\"end\":38813,\"start\":38401}]", "bib_title": "[{\"end\":32606,\"start\":32537},{\"end\":32903,\"start\":32823},{\"end\":33509,\"start\":33464},{\"end\":33617,\"start\":33560},{\"end\":34030,\"start\":33937},{\"end\":34327,\"start\":34276},{\"end\":34696,\"start\":34622},{\"end\":35008,\"start\":34940},{\"end\":35471,\"start\":35409},{\"end\":35874,\"start\":35805},{\"end\":36152,\"start\":36081},{\"end\":36440,\"start\":36374},{\"end\":36711,\"start\":36677},{\"end\":37140,\"start\":37105},{\"end\":37277,\"start\":37207},{\"end\":37447,\"start\":37354},{\"end\":37627,\"start\":37526},{\"end\":37960,\"start\":37901},{\"end\":38232,\"start\":38182},{\"end\":38469,\"start\":38401}]", "bib_author": "[{\"end\":32618,\"start\":32608},{\"end\":32928,\"start\":32905},{\"end\":32945,\"start\":32928},{\"end\":32964,\"start\":32945},{\"end\":32980,\"start\":32964},{\"end\":32998,\"start\":32980},{\"end\":33019,\"start\":32998},{\"end\":33033,\"start\":33019},{\"end\":33048,\"start\":33033},{\"end\":33062,\"start\":33048},{\"end\":33077,\"start\":33062},{\"end\":33096,\"start\":33077},{\"end\":33111,\"start\":33096},{\"end\":33125,\"start\":33111},{\"end\":33136,\"start\":33125},{\"end\":33154,\"start\":33136},{\"end\":33168,\"start\":33154},{\"end\":33182,\"start\":33168},{\"end\":33518,\"start\":33511},{\"end\":33628,\"start\":33619},{\"end\":34037,\"start\":34032},{\"end\":34342,\"start\":34329},{\"end\":34706,\"start\":34698},{\"end\":35017,\"start\":35010},{\"end\":35480,\"start\":35473},{\"end\":35886,\"start\":35876},{\"end\":36185,\"start\":36154},{\"end\":36206,\"start\":36185},{\"end\":36215,\"start\":36206},{\"end\":36449,\"start\":36442},{\"end\":36723,\"start\":36713},{\"end\":37150,\"start\":37142},{\"end\":37284,\"start\":37279},{\"end\":37465,\"start\":37449},{\"end\":37650,\"start\":37629},{\"end\":37665,\"start\":37650},{\"end\":37679,\"start\":37665},{\"end\":37972,\"start\":37962},{\"end\":38245,\"start\":38234},{\"end\":38485,\"start\":38471}]", "bib_venue": "[{\"end\":32761,\"start\":32698},{\"end\":33343,\"start\":33263},{\"end\":33837,\"start\":33724},{\"end\":34223,\"start\":34133},{\"end\":34809,\"start\":34803},{\"end\":35353,\"start\":35193},{\"end\":35692,\"start\":35599},{\"end\":36028,\"start\":35956},{\"end\":36362,\"start\":36289},{\"end\":36624,\"start\":36537},{\"end\":37052,\"start\":36892},{\"end\":37844,\"start\":37767},{\"end\":38170,\"start\":38072},{\"end\":38383,\"start\":38359},{\"end\":38664,\"start\":38650},{\"end\":32696,\"start\":32618},{\"end\":33261,\"start\":33182},{\"end\":33543,\"start\":33518},{\"end\":33722,\"start\":33628},{\"end\":34131,\"start\":34037},{\"end\":34420,\"start\":34362},{\"end\":34801,\"start\":34725},{\"end\":35178,\"start\":35017},{\"end\":35191,\"start\":35180},{\"end\":35548,\"start\":35480},{\"end\":35954,\"start\":35886},{\"end\":36287,\"start\":36215},{\"end\":36535,\"start\":36449},{\"end\":36890,\"start\":36723},{\"end\":37193,\"start\":37150},{\"end\":37297,\"start\":37284},{\"end\":37518,\"start\":37465},{\"end\":37765,\"start\":37679},{\"end\":38070,\"start\":37972},{\"end\":38357,\"start\":38245},{\"end\":38648,\"start\":38485}]"}}}, "year": 2023, "month": 12, "day": 17}