{"id": 16326763, "updated": "2023-09-27 22:59:50.375", "metadata": {"title": "Continuous control with deep reinforcement learning", "authors": "[{\"first\":\"Timothy\",\"last\":\"Lillicrap\",\"middle\":[\"P.\"]},{\"first\":\"Jonathan\",\"last\":\"Hunt\",\"middle\":[\"J.\"]},{\"first\":\"Alexander\",\"last\":\"Pritzel\",\"middle\":[]},{\"first\":\"Nicolas\",\"last\":\"Heess\",\"middle\":[]},{\"first\":\"Tom\",\"last\":\"Erez\",\"middle\":[]},{\"first\":\"Yuval\",\"last\":\"Tassa\",\"middle\":[]},{\"first\":\"David\",\"last\":\"Silver\",\"middle\":[]},{\"first\":\"Daan\",\"last\":\"Wierstra\",\"middle\":[]}]", "venue": "ICLR", "journal": "arXiv: Learning", "publication_date": {"year": 2015, "month": 9, "day": 9}, "abstract": "We adapt the ideas underlying the success of Deep Q-Learning to the continuous action domain. We present an actor-critic, model-free algorithm based on the deterministic policy gradient that can operate over continuous action spaces. Using the same learning algorithm, network architecture and hyper-parameters, our algorithm robustly solves more than 20 simulated physics tasks, including classic problems such as cartpole swing-up, dexterous manipulation, legged locomotion and car driving. Our algorithm is able to find policies whose performance is competitive with those found by a planning algorithm with full access to the dynamics of the domain and its derivatives. We further demonstrate that for many of the tasks the algorithm can learn policies end-to-end: directly from raw pixel inputs.", "fields_of_study": "[\"Computer Science\",\"Mathematics\"]", "external_ids": {"arxiv": "1509.02971", "mag": "2963864421", "acl": null, "pubmed": null, "pubmedcentral": null, "dblp": "journals/corr/LillicrapHPHETS15", "doi": null}}, "content": {"source": {"pdf_hash": "0af0c64c991a2f01e06421705d45e46759908f45", "pdf_src": "Arxiv", "pdf_uri": "[\"https://arxiv.org/pdf/1509.02971v5.pdf\"]", "oa_url_match": false, "oa_info": null}, "grobid": {"id": "7a0a8f1172fcba815c787e8bea81341a250caf62", "type": "plain-text", "url": "s3://ai2-s2-pdf-extraction-prod/parse-results/s2orc_worker/0af0c64c991a2f01e06421705d45e46759908f45.txt", "contents": "\nCONTINUOUS CONTROL WITH DEEP REINFORCEMENT LEARNING\n\n\nTimothy P Lillicrap \nGoogle Deepmind London\nUK\n\nJonathan J Hunt jjhunt@google.com \nGoogle Deepmind London\nUK\n\nAlexander Pritzel apritzel@google.com \nGoogle Deepmind London\nUK\n\nNicolas Heess heess@google.com \nGoogle Deepmind London\nUK\n\nTom Erez \nGoogle Deepmind London\nUK\n\nYuval Tassa tassa@google.com \nGoogle Deepmind London\nUK\n\nDavid Silver davidsilver@google.com \nGoogle Deepmind London\nUK\n\nDaan Wierstra wierstra@google.com \nGoogle Deepmind London\nUK\n\nCONTINUOUS CONTROL WITH DEEP REINFORCEMENT LEARNING\nPublished as a conference paper at ICLR 2016\nWe adapt the ideas underlying the success of Deep Q-Learning to the continuous action domain. We present an actor-critic, model-free algorithm based on the deterministic policy gradient that can operate over continuous action spaces. Using the same learning algorithm, network architecture and hyper-parameters, our algorithm robustly solves more than 20 simulated physics tasks, including classic problems such as cartpole swing-up, dexterous manipulation, legged locomotion and car driving. Our algorithm is able to find policies whose performance is competitive with those found by a planning algorithm with full access to the dynamics of the domain and its derivatives. We further demonstrate that for many of the tasks the algorithm can learn policies \"end-to-end\": directly from raw pixel inputs. * These authors contributed equally.\n\nINTRODUCTION\n\nOne of the primary goals of the field of artificial intelligence is to solve complex tasks from unprocessed, high-dimensional, sensory input. Recently, significant progress has been made by combining advances in deep learning for sensory processing (Krizhevsky et al., 2012) with reinforcement learning, resulting in the \"Deep Q Network\" (DQN) algorithm (Mnih et al., 2015) that is capable of human level performance on many Atari video games using unprocessed pixels for input. To do so, deep neural network function approximators were used to estimate the action-value function.\n\nHowever, while DQN solves problems with high-dimensional observation spaces, it can only handle discrete and low-dimensional action spaces. Many tasks of interest, most notably physical control tasks, have continuous (real valued) and high dimensional action spaces. DQN cannot be straightforwardly applied to continuous domains since it relies on a finding the action that maximizes the action-value function, which in the continuous valued case requires an iterative optimization process at every step.\n\nAn obvious approach to adapting deep reinforcement learning methods such as DQN to continuous domains is to to simply discretize the action space. However, this has many limitations, most notably the curse of dimensionality: the number of actions increases exponentially with the number of degrees of freedom. For example, a 7 degree of freedom system (as in the human arm) with the coarsest discretization a i ∈ {−k, 0, k} for each joint leads to an action space with dimensionality: 3 7 = 2187. The situation is even worse for tasks that require fine control of actions as they require a correspondingly finer grained discretization, leading to an explosion of the number of discrete actions. Such large action spaces are difficult to explore efficiently, and thus successfully training DQN-like networks in this context is likely intractable. Additionally, naive discretization of action spaces needlessly throws away information about the structure of the action domain, which may be essential for solving many problems.\n\nIn this work we present a model-free, off-policy actor-critic algorithm using deep function approximators that can learn policies in high-dimensional, continuous action spaces. Our work is based on the deterministic policy gradient (DPG) algorithm (Silver et al., 2014) (itself similar to NFQCA (Hafner & Riedmiller, 2011), and similar ideas can be found in (Prokhorov et al., 1997)). However, as we show below, a naive application of this actor-critic method with neural function approximators is unstable for challenging problems.\n\nHere we combine the actor-critic approach with insights from the recent success of Deep Q Network (DQN) (Mnih et al., 2013;2015). Prior to DQN, it was generally believed that learning value functions using large, non-linear function approximators was difficult and unstable. DQN is able to learn value functions using such function approximators in a stable and robust way due to two innovations: 1. the network is trained off-policy with samples from a replay buffer to minimize correlations between samples; 2. the network is trained with a target Q network to give consistent targets during temporal difference backups. In this work we make use of the same ideas, along with batch normalization (Ioffe & Szegedy, 2015), a recent advance in deep learning.\n\nIn order to evaluate our method we constructed a variety of challenging physical control problems that involve complex multi-joint movements, unstable and rich contact dynamics, and gait behavior. Among these are classic problems such as the cartpole swing-up problem, as well as many new domains. A long-standing challenge of robotic control is to learn an action policy directly from raw sensory input such as video. Accordingly, we place a fixed viewpoint camera in the simulator and attempted all tasks using both low-dimensional observations (e.g. joint angles) and directly from pixels.\n\nOur model-free approach which we call Deep DPG (DDPG) can learn competitive policies for all of our tasks using low-dimensional observations (e.g. cartesian coordinates or joint angles) using the same hyper-parameters and network structure. In many cases, we are also able to learn good policies directly from pixels, again keeping hyperparameters and network structure constant 1 .\n\nA key feature of the approach is its simplicity: it requires only a straightforward actor-critic architecture and learning algorithm with very few \"moving parts\", making it easy to implement and scale to more difficult problems and larger networks. For the physical control problems we compare our results to a baseline computed by a planner  that has full access to the underlying simulated dynamics and its derivatives (see supplementary information). Interestingly, DDPG can sometimes find policies that exceed the performance of the planner, in some cases even when learning from pixels (the planner always plans over the underlying low-dimensional state space).\n\n\nBACKGROUND\n\nWe consider a standard reinforcement learning setup consisting of an agent interacting with an environment E in discrete timesteps. At each timestep t the agent receives an observation x t , takes an action a t and receives a scalar reward r t . In all the environments considered here the actions are real-valued a t ∈ IR N . In general, the environment may be partially observed so that the entire history of the observation, action pairs s t = (x 1 , a 1 , ..., a t−1 , x t ) may be required to describe the state. Here, we assumed the environment is fully-observed so s t = x t .\n\nAn agent's behavior is defined by a policy, π, which maps states to a probability distribution over the actions π : S → P(A). The environment, E, may also be stochastic. We model it as a Markov decision process with a state space S, action space A = IR N , an initial state distribution p(s 1 ), transition dynamics p(s t+1 |s t , a t ), and reward function r(s t , a t ).\n\nThe return from a state is defined as the sum of discounted future reward R t = T i=t γ (i−t) r(s i , a i ) with a discounting factor γ ∈ [0, 1]. Note that the return depends on the actions chosen, and therefore on the policy π, and may be stochastic. The goal in reinforcement learning is to learn a policy which maximizes the expected return from the start distribution J = E ri,si∼E,ai∼π [R 1 ]. We denote the discounted state visitation distribution for a policy π as ρ π .\n\nThe action-value function is used in many reinforcement learning algorithms. It describes the expected return after taking an action a t in state s t and thereafter following policy π:\nQ π (s t , a t ) = E r i≥t ,si>t∼E,ai>t∼π [R t |s t , a t ](1)\nMany approaches in reinforcement learning make use of the recursive relationship known as the Bellman equation:\nQ π (s t , a t ) = E rt,st+1∼E r(s t , a t ) + γ E at+1∼π [Q π (s t+1 , a t+1 )](2)\nIf the target policy is deterministic we can describe it as a function µ : S ← A and avoid the inner expectation:\nQ µ (s t , a t ) = E rt,st+1∼E [r(s t , a t ) + γQ µ (s t+1 , µ(s t+1 ))](3)\nThe expectation depends only on the environment. This means that it is possible to learn Q µ offpolicy, using transitions which are generated from a different stochastic behavior policy β.\n\nQ-learning (Watkins & Dayan, 1992), a commonly used off-policy algorithm, uses the greedy policy µ(s) = arg max a Q(s, a). We consider function approximators parameterized by θ Q , which we optimize by minimizing the loss:\nL(θ Q ) = E st∼ρ β ,at∼β,rt∼E Q(s t , a t |θ Q ) − y t 2(4)\nwhere\ny t = r(s t , a t ) + γQ(s t+1 , µ(s t+1 )|θ Q ).(5)\nWhile y t is also dependent on θ Q , this is typically ignored.\n\nThe use of large, non-linear function approximators for learning value or action-value functions has often been avoided in the past since theoretical performance guarantees are impossible, and practically learning tends to be unstable. Recently, (Mnih et al., 2013;2015) adapted the Q-learning algorithm in order to make effective use of large neural networks as function approximators. Their algorithm was able to learn to play Atari games from pixels. In order to scale Q-learning they introduced two major changes: the use of a replay buffer, and a separate target network for calculating y t . We employ these in the context of DDPG and explain their implementation in the next section.\n\n\nALGORITHM\n\nIt is not possible to straightforwardly apply Q-learning to continuous action spaces, because in continuous spaces finding the greedy policy requires an optimization of a t at every timestep; this optimization is too slow to be practical with large, unconstrained function approximators and nontrivial action spaces. Instead, here we used an actor-critic approach based on the DPG algorithm (Silver et al., 2014).\n\nThe DPG algorithm maintains a parameterized actor function µ(s|θ µ ) which specifies the current policy by deterministically mapping states to a specific action. The critic Q(s, a) is learned using the Bellman equation as in Q-learning. The actor is updated by following the applying the chain rule to the expected return from the start distribution J with respect to the actor parameters: Silver et al. (2014) proved that this is the policy gradient, the gradient of the policy's performance 2 .\n∇ θ µ J ≈ E st∼ρ β ∇ θ µ Q(s, a|θ Q )| s=st,a=µ(st|θ µ ) = E st∼ρ β ∇ a Q(s, a|θ Q )| s=st,a=µ(st) ∇ θµ µ(s|θ µ )| s=st(6)\nAs with Q learning, introducing non-linear function approximators means that convergence is no longer guaranteed. However, such approximators appear essential in order to learn and generalize on large state spaces. NFQCA (Hafner & Riedmiller, 2011), which uses the same update rules as DPG but with neural network function approximators, uses batch learning for stability, which is intractable for large networks. A minibatch version of NFQCA which does not reset the policy at each update, as would be required to scale to large networks, is equivalent to the original DPG, which we compare to here. Our contribution here is to provide modifications to DPG, inspired by the success of DQN, which allow it to use neural network function approximators to learn in large state and action spaces online. We refer to our algorithm as Deep DPG (DDPG, Algorithm 1).\n\nOne challenge when using neural networks for reinforcement learning is that most optimization algorithms assume that the samples are independently and identically distributed. Obviously, when the samples are generated from exploring sequentially in an environment this assumption no longer holds. Additionally, to make efficient use of hardware optimizations, it is essential to learn in minibatches, rather than online.\n\nAs in DQN, we used a replay buffer to address these issues. The replay buffer is a finite sized cache R. Transitions were sampled from the environment according to the exploration policy and the tuple (s t , a t , r t , s t+1 ) was stored in the replay buffer. When the replay buffer was full the oldest samples were discarded. At each timestep the actor and critic are updated by sampling a minibatch uniformly from the buffer. Because DDPG is an off-policy algorithm, the replay buffer can be large, allowing the algorithm to benefit from learning across a set of uncorrelated transitions.\n\nDirectly implementing Q learning (equation 4) with neural networks proved to be unstable in many environments. Since the network Q(s, a|θ Q ) being updated is also used in calculating the target value (equation 5), the Q update is prone to divergence. Our solution is similar to the target network used in (Mnih et al., 2013) but modified for actor-critic and using \"soft\" target updates, rather than directly copying the weights. We create a copy of the actor and critic networks, Q (s, a|θ Q ) and µ (s|θ µ ) respectively, that are used for calculating the target values. The weights of these target networks are then updated by having them slowly track the learned networks: θ ← τ θ + (1 − τ )θ with τ 1. This means that the target values are constrained to change slowly, greatly improving the stability of learning. This simple change moves the relatively unstable problem of learning the action-value function closer to the case of supervised learning, a problem for which robust solutions exist. We found that having both a target µ and Q was required to have stable targets y i in order to consistently train the critic without divergence. This may slow learning, since the target network delays the propagation of value estimations. However, in practice we found this was greatly outweighed by the stability of learning.\n\nWhen learning from low dimensional feature vector observations, the different components of the observation may have different physical units (for example, positions versus velocities) and the ranges may vary across environments. This can make it difficult for the network to learn effectively and may make it difficult to find hyper-parameters which generalise across environments with different scales of state values.\n\nOne approach to this problem is to manually scale the features so they are in similar ranges across environments and units. We address this issue by adapting a recent technique from deep learning called batch normalization (Ioffe & Szegedy, 2015). This technique normalizes each dimension across the samples in a minibatch to have unit mean and variance. In addition, it maintains a running average of the mean and variance to use for normalization during testing (in our case, during exploration or evaluation). In deep networks, it is used to minimize covariance shift during training, by ensuring that each layer receives whitened input. In the low-dimensional case, we used batch normalization on the state input and all layers of the µ network and all layers of the Q network prior to the action input (details of the networks are given in the supplementary material). With batch normalization, we were able to learn effectively across many different tasks with differing types of units, without needing to manually ensure the units were within a set range.\n\nA major challenge of learning in continuous action spaces is exploration. An advantage of offpolicies algorithms such as DDPG is that we can treat the problem of exploration independently from the learning algorithm. We constructed an exploration policy µ by adding noise sampled from a noise process N to our actor policy µ (s t ) = µ(s t |θ µ t ) + N (7) N can be chosen to chosen to suit the environment. As detailed in the supplementary materials we used an Ornstein-Uhlenbeck process (Uhlenbeck & Ornstein, 1930) to generate temporally correlated exploration for exploration efficiency in physical control problems with inertia (similar use of autocorrelated noise was introduced in (Wawrzyński, 2015)).\n\n\nRESULTS\n\nWe constructed simulated physical environments of varying levels of difficulty to test our algorithm. This included classic reinforcement learning environments such as cartpole, as well as difficult,\n\n\nAlgorithm 1 DDPG algorithm\n\nRandomly initialize critic network Q(s, a|θ Q ) and actor µ(s|θ µ ) with weights θ Q and θ µ . Initialize target network Q and µ with weights θ Q ← θ Q , θ µ ← θ µ Initialize replay buffer R for episode = 1, M do Initialize a random process N for action exploration Receive initial observation state s 1 for t = 1, T do Select action a t = µ(s t |θ µ ) + N t according to the current policy and exploration noise Execute action a t and observe reward r t and observe new state\ns t+1 Store transition (s t , a t , r t , s t+1 ) in R Sample a random minibatch of N transitions (s i , a i , r i , s i+1 ) from R Set y i = r i + γQ (s i+1 , µ (s i+1 |θ µ )|θ Q )\nUpdate critic by minimizing the loss:\nL = 1 N i (y i − Q(s i , a i |θ Q )\n) 2 Update the actor policy using the sampled policy gradient:\n∇ θ µ J ≈ 1 N i ∇ a Q(s, a|θ Q )| s=si,a=µ(si) ∇ θ µ µ(s|θ µ )| si\nUpdate the target networks:\nθ Q ← τ θ Q + (1 − τ )θ Q θ µ ← τ θ µ + (1 − τ )θ µ end for end for\nhigh dimensional tasks such as gripper, tasks involving contacts such as puck striking (canada) and locomotion tasks such as cheetah (Wawrzyński, 2009). In all domains but cheetah the actions were torques applied to the actuated joints. These environments were simulated using MuJoCo . Figure 1 shows renderings of some of the environments used in the task (the supplementary contains details of the environments and you can view some of the learned policies at https://goo.gl/J4PIAz).\n\nIn all tasks, we ran experiments using both a low-dimensional state description (such as joint angles and positions) and high-dimensional renderings of the environment. As in DQN (Mnih et al., 2013;2015), in order to make the problems approximately fully observable in the high dimensional environment we used action repeats. For each timestep of the agent, we step the simulation 3 timesteps, repeating the agent's action and rendering each time. Thus the observation reported to the agent contains 9 feature maps (the RGB of each of the 3 renderings) which allows the agent to infer velocities using the differences between frames. The frames were downsampled to 64x64 pixels and the 8-bit RGB values were converted to floating point scaled to [0, 1]. See supplementary information for details of our network structure and hyperparameters.\n\nWe evaluated the policy periodically during training by testing it without exploration noise. Figure  2 shows the performance curve for a selection of environments. We also report results with components of our algorithm (i.e. the target network or batch normalization) removed. In order to perform well across all tasks, both of these additions are necessary. In particular, learning without a target network, as in the original work with DPG, is very poor in many environments.\n\nSurprisingly, in some simpler tasks, learning policies from pixels is just as fast as learning using the low-dimensional state descriptor. This may be due to the action repeats making the problem simpler. It may also be that the convolutional layers provide an easily separable representation of state space, which is straightforward for the higher layers to learn on quickly. Table 1 summarizes DDPG's performance across all of the environments (results are averaged over 5 replicas). We normalized the scores using two baselines. The first baseline is the mean return from a naive policy which samples actions from a uniform distribution over the valid action space. The second baseline is iLQG (Todorov & Li, 2005), a planning based solver with full access to the underlying physical model and its derivatives. We normalize scores so that the naive policy has a mean score of 0 and iLQG has a mean score of 1. DDPG is able to learn good policies on many of the tasks, and in many cases some of the replicas learn policies which are superior to those found by iLQG, even when learning directly from pixels.\n\nIt can be challenging to learn accurate value estimates. Q-learning, for example, is prone to overestimating values (Hasselt, 2010). We examined DDPG's estimates empirically by comparing the values estimated by Q after training with the true returns seen on test episodes. Figure 3 shows that in simple tasks DDPG estimates returns accurately without systematic biases. For harder tasks the Q estimates are worse, but DDPG is still able learn good policies.\n\nTo demonstrate the generality of our approach we also include Torcs, a racing game where the actions are acceleration, braking and steering. Torcs has previously been used as a testbed in other policy learning approaches (Koutník et al., 2014b). We used an identical network architecture and learning algorithm hyper-parameters to the physics tasks but altered the noise process for exploration because of the very different time scales involved. On both low-dimensional and from pixels, some replicas were able to learn reasonable policies that are able to complete a circuit around the track though other replicas failed to learn a sensible policy. Figure 1: Example screenshots of a sample of environments we attempt to solve with DDPG. In order from the left: the cartpole swing-up task, a reaching task, a gasp and move task, a puck-hitting task, a monoped balancing task, two locomotion tasks and Torcs (driving simulator). We tackle all tasks using both low-dimensional feature vector and high-dimensional pixel inputs. Detailed descriptions of the environments are provided in the supplementary. Movies of some of the learned policies are available at https://goo.gl/J4PIAz. \n\n\nRELATED WORK\n\nThe original DPG paper evaluated the algorithm with toy problems using tile-coding and linear function approximators. It demonstrated data efficiency advantages for off-policy DPG over both on-and off-policy stochastic actor critic. It also solved one more challenging task in which a multijointed octopus arm had to strike a target with any part of the limb. However, that paper did not demonstrate scaling the approach to large, high-dimensional observation spaces as we have here.\n\nIt has often been assumed that standard policy search methods such as those explored in the present work are simply too fragile to scale to difficult problems (Levine et al., 2015). Standard policy search  Figure 3: Density plot showing estimated Q values versus observed returns sampled from test episodes on 5 replicas. In simple domains such as pendulum and cartpole the Q values are quite accurate. In more complex tasks, the Q estimates are less accurate, but can still be used to learn competent policies. Dotted line indicates unity, units are arbitrary. Table 1: Performance after training across all environments for at most 2.5 million steps. We report both the average and best observed (across 5 runs). All scores, except Torcs, are normalized so that a random agent receives 0 and a planning algorithm 1; for Torcs we present the raw reward score. We include results from the DDPG algorithn in the low-dimensional (lowd) version of the environment and high-dimensional (pix). For comparision we also include results from the original DPG algorithm with a replay buffer and batch normalization (cntrl). is thought to be difficult because it deals simultaneously with complex environmental dynamics and a complex policy. Indeed, most past work with actor-critic and policy optimization approaches have had difficulty scaling up to more challenging problems (Deisenroth et al., 2013). Typically, this is due to instability in learning wherein progress on a problem is either destroyed by subsequent learning updates, or else learning is too slow to be practical.\n\nRecent work with model-free policy search has demonstrated that it may not be as fragile as previously supposed. Wawrzyński (2009) ;Wawrzyński & Tanwani (2013) has trained stochastic policies in an actor-critic framework with a replay buffer. Concurrent with our work, Balduzzi & Ghifary (2015) extended the DPG algorithm with a \"deviator\" network which explicitly learns ∂Q/∂a. However, they only train on two low-dimensional domains.  introduced SVG(0) which also uses a Q-critic but learns a stochastic policy. DPG can be considered the deterministic limit of SVG(0). The techniques we described here for scaling DPG are also applicable to stochastic policies by using the reparametrization trick Schulman et al., 2015a).\n\nAnother approach, trust region policy optimization (TRPO) (Schulman et al., 2015b), directly constructs stochastic neural network policies without decomposing problems into optimal control and supervised phases. This method produces near monotonic improvements in return by making carefully chosen updates to the policy parameters, constraining updates to prevent the new policy from diverging too far from the existing policy. This approach does not require learning an action-value function, and (perhaps as a result) appears to be significantly less data efficient.\n\nTo combat the challenges of the actor-critic approach, recent work with guided policy search (GPS) algorithms (e.g., (Levine et al., 2015)) decomposes the problem into three phases that are relatively easy to solve: first, it uses full-state observations to create locally-linear approximations of the dynamics around one or more nominal trajectories, and then uses optimal control to find the locally-linear optimal policy along these trajectories; finally, it uses supervised learning to train a complex, non-linear policy (e.g. a deep neural network) to reproduce the state-to-action mapping of the optimized trajectories.\n\nThis approach has several benefits, including data efficiency, and has been applied successfully to a variety of real-world robotic manipulation tasks using vision. In these tasks GPS uses a similar convolutional policy network to ours with 2 notable exceptions: 1. it uses a spatial softmax to reduce the dimensionality of visual features into a single (x, y) coordinate for each feature map, and 2. the policy also receives direct low-dimensional state information about the configuration of the robot at the first fully connected layer in the network. Both likely increase the power and data efficiency of the algorithm and could easily be exploited within the DDPG framework.\n\nPILCO (Deisenroth & Rasmussen, 2011) uses Gaussian processes to learn a non-parametric, probabilistic model of the dynamics. Using this learned model, PILCO calculates analytic policy gradients and achieves impressive data efficiency in a number of control problems. However, due to the high computational demand, PILCO is \"impractical for high-dimensional problems\" (Wahlström et al., 2015). It seems that deep function approximators are the most promising approach for scaling reinforcement learning to large, high-dimensional domains. Wahlström et al. (2015) used a deep dynamical model network along with model predictive control to solve the pendulum swing-up task from pixel input. They trained a differentiable forward model and encoded the goal state into the learned latent space. They use model-predictive control over the learned model to find a policy for reaching the target. However, this approach is only applicable to domains with goal states that can be demonstrated to the algorithm.\n\nRecently, evolutionary approaches have been used to learn competitive policies for Torcs from pixels using compressed weight parametrizations (Koutník et al., 2014a) or unsupervised learning (Koutník et al., 2014b) to reduce the dimensionality of the evolved weights. It is unclear how well these approaches generalize to other problems.\n\n\nCONCLUSION\n\nThe work combines insights from recent advances in deep learning and reinforcement learning, resulting in an algorithm that robustly solves challenging problems across a variety of domains with continuous action spaces, even when using raw pixels for observations. As with most reinforcement learning algorithms, the use of non-linear function approximators nullifies any convergence guarantees; however, our experimental results demonstrate that stable learning without the need for any modifications between environments.\n\nInterestingly, all of our experiments used substantially fewer steps of experience than was used by DQN learning to find solutions in the Atari domain. Nearly all of the problems we looked at were solved within 2.5 million steps of experience (and usually far fewer), a factor of 20 fewer steps than DQN requires for good Atari solutions. This suggests that, given more simulation time, DDPG may solve even more difficult problems than those considered here.\n\nA few limitations to our approach remain. Most notably, as with most model-free reinforcement approaches, DDPG requires a large number of training episodes to find solutions. However, we believe that a robust model-free approach may be an important component of larger systems which may attack these limitations (Gläscher et al., 2010).\n\n\nSupplementary Information: Continuous control with deep reinforcement learning\n\n\nEXPERIMENT DETAILS\n\nWe used Adam (Kingma & Ba, 2014) for learning the neural network parameters with a learning rate of 10 −4 and 10 −3 for the actor and critic respectively. For Q we included L 2 weight decay of 10 −2 and used a discount factor of γ = 0.99. For the soft target updates we used τ = 0.001. The neural networks used the rectified non-linearity (Glorot et al., 2011) for all hidden layers. The final output layer of the actor was a tanh layer, to bound the actions. The low-dimensional networks had 2 hidden layers with 400 and 300 units respectively (≈ 130,000 parameters). Actions were not included until the 2nd hidden layer of Q. When learning from pixels we used 3 convolutional layers (no pooling) with 32 filters at each layer. This was followed by two fully connected layers with 200 units (≈ 430,000 parameters). The final layer weights and biases of both the actor and critic were initialized from a uniform distribution [−3 × 10 −3 , 3 × 10 −3 ] and [3 × 10 −4 , 3 × 10 −4 ] for the low dimensional and pixel cases respectively. This was to ensure the initial outputs for the policy and value estimates were near zero. The other layers were initialized from uniform distributions\n[− 1 √ f , 1 √ f ]\nwhere f is the fan-in of the layer. The actions were not included until the fully-connected layers. We trained with minibatch sizes of 64 for the low dimensional problems and 16 on pixels. We used a replay buffer size of 10 6 .\n\nFor the exploration noise process we used temporally correlated noise in order to explore well in physical environments that have momentum. We used an Ornstein-Uhlenbeck process (Uhlenbeck & Ornstein, 1930) with θ = 0.15 and σ = 0.2. The Ornstein-Uhlenbeck process models the velocity of a Brownian particle with friction, which results in temporally correlated values centered around 0.\n\n\nPLANNING ALGORITHM\n\nOur planner is implemented as a model-predictive controller : at every time step we run a single iteration of trajectory optimization (using iLQG, (Todorov & Li, 2005)), starting from the true state of the system. Every single trajectory optimization is planned over a horizon between 250ms and 600ms, and this planning horizon recedes as the simulation of the world unfolds, as is the case in model-predictive control.\n\nThe iLQG iteration begins with an initial rollout of the previous policy, which determines the nominal trajectory. We use repeated samples of simulated dynamics to approximate a linear expansion of the dynamics around every step of the trajectory, as well as a quadratic expansion of the cost function. We use this sequence of locally-linear-quadratic models to integrate the value function backwards in time along the nominal trajectory. This back-pass results in a putative modification to the action sequence that will decrease the total cost. We perform a derivative-free line-search over this direction in the space of action sequences by integrating the dynamics forward (the forwardpass), and choose the best trajectory. We store this action sequence in order to warm-start the next iLQG iteration, and execute the first action in the simulator. This results in a new state, which is used as the initial state in the next iteration of trajectory optimization. 9 ENVIRONMENT DETAILS 9.1 TORCS ENVIRONMENT For the Torcs environment we used a reward function which provides a positive reward at each step for the velocity of the car projected along the track direction and a penalty of −1 for collisions. Episodes were terminated if progress was not made along the track after 500 frames.\n\n\nMUJOCO ENVIRONMENTS\n\nFor physical control tasks we used reward functions which provide feedback at every step. In all tasks, the reward contained a small action cost. For all tasks that have a static goal state (e.g. pendulum swingup and reaching) we provide a smoothly varying reward based on distance to a goal state, and in some cases an additional positive reward when within a small radius of the target state. For grasping and manipulation tasks we used a reward with a term which encourages movement towards the payload and a second component which encourages moving the payload to the target. In locomotion tasks we reward forward action and penalize hard impacts to encourage smooth rather than hopping gaits (Schulman et al., 2015b). In addition, we used a negative reward and early termination for falls which were determined by simple threshholds on the height and torso angle (in the case of walker2d). Table 2 states the dimensionality of the problems and below is a summary of all the physics environments.\n\nblockworld3da\n\nAgent is required to use a human-like arm with 7-DOF and a simple gripper to grab a block and lift it against gravity to a fixed target position.\n\ncanada Agent is required to use a 7-DOF arm with hockey-stick like appendage to hit a ball to a target.\n\ncanada2d Agent is required to use an arm with hockey-stick like appendage to hit a ball initialzed to a random start location to a random target location.\n\ncart Agent must move a simple mass to rest at 0. The mass begins each trial in random positions and with random velocities.\n\ncartpole\n\nThe classic cart-pole swing-up task. Agent must balance a pole attached to a cart by applying forces to the cart alone. The pole starts each episode hanging upside-down.\n\ncartpoleBalance\n\nThe classic cart-pole balance task. Agent must balance a pole attached to a cart by applying forces to the cart alone. The pole starts in the upright positions at the beginning of each episode.\n\ncartpoleParallelDouble Variant on the classic cart-pole. Two poles, both attached to the cart, should be kept upright as much as possible.\n\ncartpoleSerialDouble Variant on the classic cart-pole. Two poles, one attached to the cart and the second attached to the end of the first, should be kept upright as much as possible.\n\ncartpoleSerialTriple Variant on the classic cart-pole. Three poles, one attached to the cart, the second attached to the end of the first, and the third attached to the end of the second, should be kept upright as much as possible.\n\ncheetah\n\nThe agent should move forward as quickly as possible with a cheetahlike body that is constrained to the plane. This environment is based very closely on the one introduced by Wawrzyński (2009) ;Wawrzyński & Tanwani (2013).\n\nfixedReacher Agent is required to move a 3-DOF arm to a fixed target position.\n\nfixedReacherDouble Agent is required to move a 2-DOF arm to a fixed target position.\n\nfixedReacherSingle Agent is required to move a simple 1-DOF arm to a fixed target position.\n\ngripper Agent must use an arm with gripper appendage to grasp an object and manuver the object to a fixed target.\n\ngripperRandom The same task as gripper except that the arm object and target position are initialized in random locations.\n\nhardCheetah\n\nThe agent should move forward as quickly as possible with a cheetahlike body that is constrained to the plane. This environment is based very closely on the one introduced by Wawrzyński (2009); Wawrzyński & Tanwani (2013), but has been made much more difficult by removing the stabalizing joint stiffness from the model.\n\nhopper Agent must balance a multiple degree of freedom monoped to keep it from falling.\n\nhyq Agent is required to keep a quadroped model based on the hyq robot from falling. movingGripper Agent must use an arm with gripper attached to a moveable platform to grasp an object and move it to a fixed target.\n\n\nmovingGripperRandom\n\nThe same as the movingGripper environment except that the object position, target position, and arm state are initialized randomly.\n\npendulum\n\nThe classic pendulum swing-up problem. The pendulum should be brought to the upright position and balanced. Torque limits prevent the agent from swinging the pendulum up directly.\n\nreacher3daFixedTarget Agent is required to move a 7-DOF human-like arm to a fixed target position.\n\nreacher3daRandomTarget Agent is required to move a 7-DOF human-like arm from random starting locations to random target positions.\n\nreacher Agent is required to move a 3-DOF arm from random starting locations to random target positions.\n\nreacherSingle Agent is required to move a simple 1-DOF arm from random starting locations to random target positions.\n\nreacherObstacle Agent is required to move a 5-DOF arm around an obstacle to a randomized target position.\n\nwalker2d Agent should move forward as quickly as possible with a bipedal walker constrained to the plane without falling down or pitching the torso too far forward or backward.\n\nFigure 2 :\n2Performance curves for a selection of domains using variants of DPG: original DPG algorithm (minibatch NFQCA) with batch normalization (light grey), with target network (dark grey), with target networks and batch normalization (green), with target networks from pixel-only inputs (blue). Target networks are crucial.\nYou can view a movie of some of the learned policies at https://goo.gl/J4PIAz\nIn practice, as in commonly done in policy gradient implementations, we ignored the discount in the statevisitation distribution ρ β .\n185  43  blockworld3da  31  9  102  canada  22  7  62  canada2d  14  3  29  cart  2  1  3  cartpole  4  1  14  cartpoleBalance  4  1  14  cartpoleParallelDouble  6  1  16  cartpoleParallelTriple  8  1  23  cartpoleSerialDouble  6  1  14  cartpoleSerialTriple  8  1  23  cheetah  18  6  17  fixedReacher  10  3  23  fixedReacherDouble  8  2  18  fixedReacherSingle  6  1  13  gripper  18  5  43  gripperRandom  18  5  43  hardCheetah  18  6  17  hardCheetahNice  18  6  17  hopper  14  4  14  hyq  37  12  37  hyqKick  37  12  37  movingGripper  22  7  49  movingGripperRandom  22  7  49  pendulum  2  1  3  reacher  10  3  23  reacher3daFixedTarget  20  7  61  reacher3daRandomTarget  20  7  61  reacherDouble  6  1  13  reacherObstacle  18  5  38  reacherSingle  6  1  13  walker2d18 6 41 Agent is required to use an arm with gripper constrained to the 2D plane to grab a falling block and lift it against gravity to a fixed target position.\nCompatible value gradients for reinforcement learning of continuous deep policies. David Balduzzi, Muhammad Ghifary, arXiv:1509.03005arXiv preprintBalduzzi, David and Ghifary, Muhammad. Compatible value gradients for reinforcement learning of continuous deep policies. arXiv preprint arXiv:1509.03005, 2015.\n\nA model-based and data-efficient approach to policy search. Marc Deisenroth, Carl E Rasmussen, Pilco, Proceedings of the 28th International Conference on machine learning (ICML-11). the 28th International Conference on machine learning (ICML-11)Deisenroth, Marc and Rasmussen, Carl E. Pilco: A model-based and data-efficient approach to policy search. In Proceedings of the 28th International Conference on machine learning (ICML- 11), pp. 465-472, 2011.\n\nA survey on policy search for robotics. Foundations and Trends in Robotics. Marc Deisenroth, Peter, Gerhard Neumann, Jan Peters, 2Deisenroth, Marc Peter, Neumann, Gerhard, Peters, Jan, et al. A survey on policy search for robotics. Foundations and Trends in Robotics, 2(1-2):1-142, 2013.\n\nStates versus rewards: dissociable neural prediction error signals underlying model-based and model-free reinforcement learning. Jan Gläscher, Daw, Nathaniel, Peter Dayan, O&apos; Doherty, John P , Neuron. 664Gläscher, Jan, Daw, Nathaniel, Dayan, Peter, and O'Doherty, John P. States versus rewards: dis- sociable neural prediction error signals underlying model-based and model-free reinforcement learning. Neuron, 66(4):585-595, 2010.\n\nDeep sparse rectifier networks. Xavier Glorot, Antoine Bordes, Yoshua Bengio, Proceedings of the 14th International Conference on Artificial Intelligence and Statistics. JMLR W&CP Volume. the 14th International Conference on Artificial Intelligence and Statistics. JMLR W&CP Volume15Glorot, Xavier, Bordes, Antoine, and Bengio, Yoshua. Deep sparse rectifier networks. In Proceed- ings of the 14th International Conference on Artificial Intelligence and Statistics. JMLR W&CP Volume, volume 15, pp. 315-323, 2011.\n\nReinforcement learning in feedback control. Roland Hafner, Martin Riedmiller, Machine learning. 841-2Hafner, Roland and Riedmiller, Martin. Reinforcement learning in feedback control. Machine learning, 84(1-2):137-169, 2011.\n\nDouble q-learning. Hado V Hasselt, Advances in Neural Information Processing Systems. Hasselt, Hado V. Double q-learning. In Advances in Neural Information Processing Systems, pp. 2613-2621, 2010.\n\nMemory-based control with recurrent neural networks. N Heess, J J Hunt, T P Lillicrap, D Silver, arXiv:1512.04455NIPS Deep Reinforcement Learning Workshop. Heess, N., Hunt, J. J, Lillicrap, T. P, and Silver, D. Memory-based control with recurrent neural networks. NIPS Deep Reinforcement Learning Workshop (arXiv:1512.04455), 2015.\n\nLearning continuous control policies by stochastic value gradients. Nicolas Heess, Wayne, Gregory, Silver, David, Lillicrap, Tim, Tom Erez, Yuval Tassa, Advances in Neural Information Processing Systems. Heess, Nicolas, Wayne, Gregory, Silver, David, Lillicrap, Tim, Erez, Tom, and Tassa, Yuval. Learn- ing continuous control policies by stochastic value gradients. In Advances in Neural Information Processing Systems, pp. 2926-2934, 2015.\n\nBatch normalization: Accelerating deep network training by reducing internal covariate shift. Sergey Ioffe, Christian Szegedy, arXiv:1502.03167arXiv preprintIoffe, Sergey and Szegedy, Christian. Batch normalization: Accelerating deep network training by reducing internal covariate shift. arXiv preprint arXiv:1502.03167, 2015.\n\nDiederik Kingma, Jimmy Ba, Adam, arXiv:1412.6980A method for stochastic optimization. arXiv preprintKingma, Diederik and Ba, Jimmy. Adam: A method for stochastic optimization. arXiv preprint arXiv:1412.6980, 2014.\n\nEvolving deep unsupervised convolutional networks for vision-based reinforcement learning. Jan Koutník, Jürgen Schmidhuber, Faustino Gomez, Proceedings of the 2014 conference on Genetic and evolutionary computation. the 2014 conference on Genetic and evolutionary computationACMKoutník, Jan, Schmidhuber, Jürgen, and Gomez, Faustino. Evolving deep unsupervised convolu- tional networks for vision-based reinforcement learning. In Proceedings of the 2014 conference on Genetic and evolutionary computation, pp. 541-548. ACM, 2014a.\n\nOnline evolution of deep convolutional network for vision-based reinforcement learning. Jan Koutník, Jürgen Schmidhuber, Faustino Gomez, From Animals to Animats 13. SpringerKoutník, Jan, Schmidhuber, Jürgen, and Gomez, Faustino. Online evolution of deep convolutional network for vision-based reinforcement learning. In From Animals to Animats 13, pp. 260-269. Springer, 2014b.\n\nImagenet classification with deep convolutional neural networks. Alex Krizhevsky, Ilya Sutskever, Geoffrey E Hinton, Advances in neural information processing systems. Krizhevsky, Alex, Sutskever, Ilya, and Hinton, Geoffrey E. Imagenet classification with deep convo- lutional neural networks. In Advances in neural information processing systems, pp. 1097-1105, 2012.\n\nEnd-to-end training of deep visuomotor policies. Levine, Sergey, Chelsea Finn, Trevor Darrell, Pieter Abbeel, arXiv:1504.00702arXiv preprintLevine, Sergey, Finn, Chelsea, Darrell, Trevor, and Abbeel, Pieter. End-to-end training of deep visuomotor policies. arXiv preprint arXiv:1504.00702, 2015.\n\nPlaying atari with deep reinforcement learning. Mnih, Volodymyr, Kavukcuoglu, Koray, Silver, David, Alex Graves, Antonoglou, Ioannis, Daan Wierstra, Martin Riedmiller, arXiv:1312.5602arXiv preprintMnih, Volodymyr, Kavukcuoglu, Koray, Silver, David, Graves, Alex, Antonoglou, Ioannis, Wier- stra, Daan, and Riedmiller, Martin. Playing atari with deep reinforcement learning. arXiv preprint arXiv:1312.5602, 2013.\n\nHumanlevel control through deep reinforcement learning. Mnih, Volodymyr, Kavukcuoglu, Koray, Silver, David, Andrei A Rusu, Joel Veness, Marc G Bellemare, Alex Graves, Riedmiller, Martin, Andreas K Fidjeland, Georg Ostrovski, Nature. 5187540Mnih, Volodymyr, Kavukcuoglu, Koray, Silver, David, Rusu, Andrei A, Veness, Joel, Bellemare, Marc G, Graves, Alex, Riedmiller, Martin, Fidjeland, Andreas K, Ostrovski, Georg, et al. Human- level control through deep reinforcement learning. Nature, 518(7540):529-533, 2015.\n\nAdaptive critic designs. Danil V Prokhorov, Wunsch, C Donald, IEEE Transactions on. 85Neural NetworksProkhorov, Danil V, Wunsch, Donald C, et al. Adaptive critic designs. Neural Networks, IEEE Transactions on, 8(5):997-1007, 1997.\n\nGradient estimation using stochastic computation graphs. John Schulman, Heess, Nicolas, Theophane Weber, Pieter Abbeel, Advances in Neural Information Processing Systems. Schulman, John, Heess, Nicolas, Weber, Theophane, and Abbeel, Pieter. Gradient estimation using stochastic computation graphs. In Advances in Neural Information Processing Systems, pp. 3510- 3522, 2015a.\n\nJohn Schulman, Levine, Sergey, Moritz, Jordan Philipp, I Michael, Pieter Abbeel, arXiv:1502.05477Trust region policy optimization. arXiv preprintSchulman, John, Levine, Sergey, Moritz, Philipp, Jordan, Michael I, and Abbeel, Pieter. Trust region policy optimization. arXiv preprint arXiv:1502.05477, 2015b.\n\nDeterministic policy gradient algorithms. David Silver, Lever, Guy, Heess, Nicolas, Degris, Thomas, Daan Wierstra, Martin Riedmiller, ICML. Silver, David, Lever, Guy, Heess, Nicolas, Degris, Thomas, Wierstra, Daan, and Riedmiller, Martin. Deterministic policy gradient algorithms. In ICML, 2014.\n\nSynthesis and stabilization of complex behaviors through online trajectory optimization. Yuval Tassa, Tom Erez, Emanuel Todorov, Intelligent Robots and Systems (IROS), 2012 IEEE/RSJ International Conference on. IEEETassa, Yuval, Erez, Tom, and Todorov, Emanuel. Synthesis and stabilization of complex behaviors through online trajectory optimization. In Intelligent Robots and Systems (IROS), 2012 IEEE/RSJ International Conference on, pp. 4906-4913. IEEE, 2012.\n\nA generalized iterative lqg method for locally-optimal feedback control of constrained nonlinear stochastic systems. Emanuel Todorov, Weiwei Li, American Control Conference. IEEEProceedings of the 2005Todorov, Emanuel and Li, Weiwei. A generalized iterative lqg method for locally-optimal feed- back control of constrained nonlinear stochastic systems. In American Control Conference, 2005. Proceedings of the 2005, pp. 300-306. IEEE, 2005.\n\nMujoco: A physics engine for model-based control. Emanuel Todorov, Tom Erez, Yuval Tassa, Intelligent Robots and Systems (IROS), 2012 IEEE/RSJ International Conference on. IEEETodorov, Emanuel, Erez, Tom, and Tassa, Yuval. Mujoco: A physics engine for model-based control. In Intelligent Robots and Systems (IROS), 2012 IEEE/RSJ International Conference on, pp. 5026- 5033. IEEE, 2012.\n\nOn the theory of the brownian motion. George E Uhlenbeck, Leonard S Ornstein, Physical review. 365823Uhlenbeck, George E and Ornstein, Leonard S. On the theory of the brownian motion. Physical review, 36(5):823, 1930.\n\nFrom pixels to torques: Policy learning with deep dynamical models. Niklas Wahlström, Schön, B Thomas, Deisenroth , Marc Peter, arXiv:1502.02251arXiv preprintWahlström, Niklas, Schön, Thomas B, and Deisenroth, Marc Peter. From pixels to torques: Policy learning with deep dynamical models. arXiv preprint arXiv:1502.02251, 2015.\n\n. Christopher Watkins, Peter Dayan, Machine learning. 83-4Watkins, Christopher JCH and Dayan, Peter. Q-learning. Machine learning, 8(3-4):279-292, 1992.\n\nReal-time reinforcement learning by sequential actor-critics and experience replay. Paweł Wawrzyński, Neural Networks. 2210Wawrzyński, Paweł. Real-time reinforcement learning by sequential actor-critics and experience replay. Neural Networks, 22(10):1484-1497, 2009.\n\nControl policy with autocorrelated noise in reinforcement learning for robotics. Paweł Wawrzyński, International Journal of Machine Learning and Computing. 5Wawrzyński, Paweł. Control policy with autocorrelated noise in reinforcement learning for robotics. International Journal of Machine Learning and Computing, 5:91-95, 2015.\n\nAutonomous reinforcement learning with experience replay. Paweł Wawrzyński, Ajay Tanwani, Kumar, Neural Networks. 41Wawrzyński, Paweł and Tanwani, Ajay Kumar. Autonomous reinforcement learning with experience replay. Neural Networks, 41:156-167, 2013.\n", "annotations": {"author": "[{\"end\":102,\"start\":55},{\"end\":164,\"start\":103},{\"end\":230,\"start\":165},{\"end\":289,\"start\":231},{\"end\":326,\"start\":290},{\"end\":383,\"start\":327},{\"end\":447,\"start\":384},{\"end\":509,\"start\":448}]", "publisher": null, "author_last_name": "[{\"end\":74,\"start\":65},{\"end\":118,\"start\":114},{\"end\":182,\"start\":175},{\"end\":244,\"start\":239},{\"end\":298,\"start\":294},{\"end\":338,\"start\":333},{\"end\":396,\"start\":390},{\"end\":461,\"start\":453}]", "author_first_name": "[{\"end\":62,\"start\":55},{\"end\":64,\"start\":63},{\"end\":111,\"start\":103},{\"end\":113,\"start\":112},{\"end\":174,\"start\":165},{\"end\":238,\"start\":231},{\"end\":293,\"start\":290},{\"end\":332,\"start\":327},{\"end\":389,\"start\":384},{\"end\":452,\"start\":448}]", "author_affiliation": "[{\"end\":101,\"start\":76},{\"end\":163,\"start\":138},{\"end\":229,\"start\":204},{\"end\":288,\"start\":263},{\"end\":325,\"start\":300},{\"end\":382,\"start\":357},{\"end\":446,\"start\":421},{\"end\":508,\"start\":483}]", "title": "[{\"end\":52,\"start\":1},{\"end\":561,\"start\":510}]", "venue": null, "abstract": "[{\"end\":1446,\"start\":607}]", "bib_ref": "[{\"attributes\":{\"ref_id\":\"b13\"},\"end\":1736,\"start\":1711},{\"attributes\":{\"ref_id\":\"b16\"},\"end\":1834,\"start\":1816},{\"attributes\":{\"ref_id\":\"b20\"},\"end\":3845,\"start\":3824},{\"attributes\":{\"ref_id\":\"b5\"},\"end\":3898,\"start\":3871},{\"attributes\":{\"ref_id\":\"b17\"},\"end\":3958,\"start\":3934},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":4233,\"start\":4214},{\"attributes\":{\"ref_id\":\"b28\"},\"end\":4238,\"start\":4233},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":4831,\"start\":4808},{\"attributes\":{\"ref_id\":\"b26\"},\"end\":8825,\"start\":8802},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":9463,\"start\":9444},{\"attributes\":{\"ref_id\":\"b28\"},\"end\":9468,\"start\":9463},{\"attributes\":{\"ref_id\":\"b20\"},\"end\":10314,\"start\":10293},{\"attributes\":{\"ref_id\":\"b20\"},\"end\":10727,\"start\":10707},{\"attributes\":{\"ref_id\":\"b5\"},\"end\":11185,\"start\":11158},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":13138,\"start\":13119},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":14812,\"start\":14789},{\"attributes\":{\"ref_id\":\"b24\"},\"end\":16147,\"start\":16119},{\"attributes\":{\"ref_id\":\"b28\"},\"end\":16336,\"start\":16318},{\"attributes\":{\"ref_id\":\"b27\"},\"end\":17690,\"start\":17672},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":18224,\"start\":18205},{\"attributes\":{\"ref_id\":\"b28\"},\"end\":18229,\"start\":18224},{\"attributes\":{\"ref_id\":\"b22\"},\"end\":20067,\"start\":20047},{\"attributes\":{\"ref_id\":\"b6\"},\"end\":20591,\"start\":20576},{\"attributes\":{\"ref_id\":\"b12\"},\"end\":21163,\"start\":21140},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":22784,\"start\":22763},{\"attributes\":{\"ref_id\":\"b2\"},\"end\":23997,\"start\":23972},{\"attributes\":{\"ref_id\":\"b27\"},\"end\":24308,\"start\":24291},{\"end\":24310,\"start\":24309},{\"attributes\":{\"ref_id\":\"b29\"},\"end\":24337,\"start\":24310},{\"attributes\":{\"ref_id\":\"b0\"},\"end\":24472,\"start\":24447},{\"attributes\":{\"ref_id\":\"b18\"},\"end\":24901,\"start\":24878},{\"attributes\":{\"ref_id\":\"b19\"},\"end\":24986,\"start\":24962},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":25612,\"start\":25591},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":26818,\"start\":26788},{\"attributes\":{\"ref_id\":\"b25\"},\"end\":27173,\"start\":27149},{\"attributes\":{\"ref_id\":\"b25\"},\"end\":27343,\"start\":27320},{\"attributes\":{\"ref_id\":\"b11\"},\"end\":27950,\"start\":27927},{\"attributes\":{\"ref_id\":\"b12\"},\"end\":27999,\"start\":27976},{\"attributes\":{\"ref_id\":\"b3\"},\"end\":29457,\"start\":29434},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":29594,\"start\":29575},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":29922,\"start\":29901},{\"attributes\":{\"ref_id\":\"b24\"},\"end\":31201,\"start\":31173},{\"attributes\":{\"ref_id\":\"b22\"},\"end\":31572,\"start\":31552},{\"attributes\":{\"ref_id\":\"b19\"},\"end\":33863,\"start\":33839},{\"end\":35846,\"start\":35845},{\"attributes\":{\"ref_id\":\"b29\"},\"end\":35873,\"start\":35846},{\"attributes\":{\"ref_id\":\"b29\"},\"end\":36608,\"start\":36581}]", "figure": "[{\"attributes\":{\"id\":\"fig_0\"},\"end\":38431,\"start\":38102}]", "paragraph": "[{\"end\":2042,\"start\":1462},{\"end\":2548,\"start\":2044},{\"end\":3574,\"start\":2550},{\"end\":4108,\"start\":3576},{\"end\":4867,\"start\":4110},{\"end\":5461,\"start\":4869},{\"end\":5845,\"start\":5463},{\"end\":6513,\"start\":5847},{\"end\":7111,\"start\":6528},{\"end\":7485,\"start\":7113},{\"end\":7964,\"start\":7487},{\"end\":8150,\"start\":7966},{\"end\":8325,\"start\":8214},{\"end\":8523,\"start\":8410},{\"end\":8789,\"start\":8601},{\"end\":9013,\"start\":8791},{\"end\":9079,\"start\":9074},{\"end\":9196,\"start\":9133},{\"end\":9888,\"start\":9198},{\"end\":10315,\"start\":9902},{\"end\":10813,\"start\":10317},{\"end\":11796,\"start\":10937},{\"end\":12218,\"start\":11798},{\"end\":12811,\"start\":12220},{\"end\":14142,\"start\":12813},{\"end\":14564,\"start\":14144},{\"end\":15628,\"start\":14566},{\"end\":16338,\"start\":15630},{\"end\":16549,\"start\":16350},{\"end\":17056,\"start\":16580},{\"end\":17276,\"start\":17239},{\"end\":17375,\"start\":17313},{\"end\":17470,\"start\":17443},{\"end\":18024,\"start\":17539},{\"end\":18867,\"start\":18026},{\"end\":19348,\"start\":18869},{\"end\":20458,\"start\":19350},{\"end\":20917,\"start\":20460},{\"end\":22102,\"start\":20919},{\"end\":22602,\"start\":22119},{\"end\":24176,\"start\":22604},{\"end\":24902,\"start\":24178},{\"end\":25472,\"start\":24904},{\"end\":26099,\"start\":25474},{\"end\":26780,\"start\":26101},{\"end\":27783,\"start\":26782},{\"end\":28122,\"start\":27785},{\"end\":28660,\"start\":28137},{\"end\":29120,\"start\":28662},{\"end\":29458,\"start\":29122},{\"end\":30746,\"start\":29562},{\"end\":30993,\"start\":30766},{\"end\":31382,\"start\":30995},{\"end\":31824,\"start\":31405},{\"end\":33118,\"start\":31826},{\"end\":34142,\"start\":33142},{\"end\":34157,\"start\":34144},{\"end\":34304,\"start\":34159},{\"end\":34409,\"start\":34306},{\"end\":34565,\"start\":34411},{\"end\":34690,\"start\":34567},{\"end\":34700,\"start\":34692},{\"end\":34871,\"start\":34702},{\"end\":34888,\"start\":34873},{\"end\":35083,\"start\":34890},{\"end\":35223,\"start\":35085},{\"end\":35408,\"start\":35225},{\"end\":35641,\"start\":35410},{\"end\":35650,\"start\":35643},{\"end\":35874,\"start\":35652},{\"end\":35954,\"start\":35876},{\"end\":36040,\"start\":35956},{\"end\":36133,\"start\":36042},{\"end\":36248,\"start\":36135},{\"end\":36372,\"start\":36250},{\"end\":36385,\"start\":36374},{\"end\":36707,\"start\":36387},{\"end\":36796,\"start\":36709},{\"end\":37013,\"start\":36798},{\"end\":37168,\"start\":37037},{\"end\":37178,\"start\":37170},{\"end\":37359,\"start\":37180},{\"end\":37459,\"start\":37361},{\"end\":37591,\"start\":37461},{\"end\":37697,\"start\":37593},{\"end\":37816,\"start\":37699},{\"end\":37923,\"start\":37818},{\"end\":38101,\"start\":37925}]", "formula": "[{\"attributes\":{\"id\":\"formula_0\"},\"end\":8213,\"start\":8151},{\"attributes\":{\"id\":\"formula_1\"},\"end\":8409,\"start\":8326},{\"attributes\":{\"id\":\"formula_2\"},\"end\":8600,\"start\":8524},{\"attributes\":{\"id\":\"formula_3\"},\"end\":9073,\"start\":9014},{\"attributes\":{\"id\":\"formula_4\"},\"end\":9132,\"start\":9080},{\"attributes\":{\"id\":\"formula_5\"},\"end\":10936,\"start\":10814},{\"attributes\":{\"id\":\"formula_6\"},\"end\":17238,\"start\":17057},{\"attributes\":{\"id\":\"formula_7\"},\"end\":17312,\"start\":17277},{\"attributes\":{\"id\":\"formula_8\"},\"end\":17442,\"start\":17376},{\"attributes\":{\"id\":\"formula_9\"},\"end\":17538,\"start\":17471},{\"attributes\":{\"id\":\"formula_10\"},\"end\":30765,\"start\":30747}]", "table_ref": "[{\"end\":19734,\"start\":19727},{\"end\":23173,\"start\":23166},{\"end\":34044,\"start\":34037}]", "section_header": "[{\"attributes\":{\"n\":\"1\"},\"end\":1460,\"start\":1448},{\"attributes\":{\"n\":\"2\"},\"end\":6526,\"start\":6516},{\"attributes\":{\"n\":\"3\"},\"end\":9900,\"start\":9891},{\"attributes\":{\"n\":\"4\"},\"end\":16348,\"start\":16341},{\"end\":16578,\"start\":16552},{\"attributes\":{\"n\":\"5\"},\"end\":22117,\"start\":22105},{\"attributes\":{\"n\":\"6\"},\"end\":28135,\"start\":28125},{\"end\":29539,\"start\":29461},{\"attributes\":{\"n\":\"7\"},\"end\":29560,\"start\":29542},{\"attributes\":{\"n\":\"8\"},\"end\":31403,\"start\":31385},{\"attributes\":{\"n\":\"9.2\"},\"end\":33140,\"start\":33121},{\"end\":37035,\"start\":37016},{\"end\":38113,\"start\":38103}]", "table": null, "figure_caption": "[{\"end\":38431,\"start\":38115}]", "figure_ref": "[{\"end\":17833,\"start\":17825},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":18972,\"start\":18963},{\"end\":20741,\"start\":20733},{\"end\":21578,\"start\":21570},{\"end\":22818,\"start\":22810}]", "bib_author_first_name": "[{\"end\":39676,\"start\":39671},{\"end\":39695,\"start\":39687},{\"end\":39961,\"start\":39957},{\"end\":39978,\"start\":39974},{\"end\":39980,\"start\":39979},{\"end\":40433,\"start\":40429},{\"end\":40460,\"start\":40453},{\"end\":40473,\"start\":40470},{\"end\":40774,\"start\":40771},{\"end\":40806,\"start\":40801},{\"end\":40821,\"start\":40814},{\"end\":40835,\"start\":40831},{\"end\":40837,\"start\":40836},{\"end\":41118,\"start\":41112},{\"end\":41134,\"start\":41127},{\"end\":41149,\"start\":41143},{\"end\":41644,\"start\":41638},{\"end\":41659,\"start\":41653},{\"end\":41843,\"start\":41839},{\"end\":41845,\"start\":41844},{\"end\":42072,\"start\":42071},{\"end\":42081,\"start\":42080},{\"end\":42083,\"start\":42082},{\"end\":42091,\"start\":42090},{\"end\":42093,\"start\":42092},{\"end\":42106,\"start\":42105},{\"end\":42426,\"start\":42419},{\"end\":42484,\"start\":42481},{\"end\":42496,\"start\":42491},{\"end\":42893,\"start\":42887},{\"end\":42910,\"start\":42901},{\"end\":43130,\"start\":43122},{\"end\":43144,\"start\":43139},{\"end\":43431,\"start\":43428},{\"end\":43447,\"start\":43441},{\"end\":43469,\"start\":43461},{\"end\":43960,\"start\":43957},{\"end\":43976,\"start\":43970},{\"end\":43998,\"start\":43990},{\"end\":44317,\"start\":44313},{\"end\":44334,\"start\":44330},{\"end\":44354,\"start\":44346},{\"end\":44356,\"start\":44355},{\"end\":44690,\"start\":44683},{\"end\":44703,\"start\":44697},{\"end\":44719,\"start\":44713},{\"end\":45019,\"start\":45015},{\"end\":45053,\"start\":45049},{\"end\":45070,\"start\":45064},{\"end\":45442,\"start\":45436},{\"end\":45444,\"start\":45443},{\"end\":45455,\"start\":45451},{\"end\":45468,\"start\":45464},{\"end\":45470,\"start\":45469},{\"end\":45486,\"start\":45482},{\"end\":45522,\"start\":45515},{\"end\":45524,\"start\":45523},{\"end\":45541,\"start\":45536},{\"end\":45872,\"start\":45867},{\"end\":45874,\"start\":45873},{\"end\":45895,\"start\":45894},{\"end\":46135,\"start\":46131},{\"end\":46171,\"start\":46162},{\"end\":46185,\"start\":46179},{\"end\":46454,\"start\":46450},{\"end\":46495,\"start\":46489},{\"end\":46506,\"start\":46505},{\"end\":46522,\"start\":46516},{\"end\":46805,\"start\":46800},{\"end\":46862,\"start\":46858},{\"end\":46879,\"start\":46873},{\"end\":47149,\"start\":47144},{\"end\":47160,\"start\":47157},{\"end\":47174,\"start\":47167},{\"end\":47643,\"start\":47636},{\"end\":47659,\"start\":47653},{\"end\":48018,\"start\":48011},{\"end\":48031,\"start\":48028},{\"end\":48043,\"start\":48038},{\"end\":48392,\"start\":48386},{\"end\":48394,\"start\":48393},{\"end\":48413,\"start\":48406},{\"end\":48415,\"start\":48414},{\"end\":48641,\"start\":48635},{\"end\":48661,\"start\":48660},{\"end\":48680,\"start\":48670},{\"end\":48687,\"start\":48683},{\"end\":48910,\"start\":48899},{\"end\":48925,\"start\":48920},{\"end\":49140,\"start\":49135},{\"end\":49405,\"start\":49400},{\"end\":49712,\"start\":49707},{\"end\":49729,\"start\":49725}]", "bib_author_last_name": "[{\"end\":39685,\"start\":39677},{\"end\":39703,\"start\":39696},{\"end\":39972,\"start\":39962},{\"end\":39990,\"start\":39981},{\"end\":39997,\"start\":39992},{\"end\":40444,\"start\":40434},{\"end\":40451,\"start\":40446},{\"end\":40468,\"start\":40461},{\"end\":40480,\"start\":40474},{\"end\":40783,\"start\":40775},{\"end\":40788,\"start\":40785},{\"end\":40799,\"start\":40790},{\"end\":40812,\"start\":40807},{\"end\":40829,\"start\":40822},{\"end\":41125,\"start\":41119},{\"end\":41141,\"start\":41135},{\"end\":41156,\"start\":41150},{\"end\":41651,\"start\":41645},{\"end\":41670,\"start\":41660},{\"end\":41853,\"start\":41846},{\"end\":42078,\"start\":42073},{\"end\":42088,\"start\":42084},{\"end\":42103,\"start\":42094},{\"end\":42113,\"start\":42107},{\"end\":42432,\"start\":42427},{\"end\":42439,\"start\":42434},{\"end\":42448,\"start\":42441},{\"end\":42456,\"start\":42450},{\"end\":42463,\"start\":42458},{\"end\":42474,\"start\":42465},{\"end\":42479,\"start\":42476},{\"end\":42489,\"start\":42485},{\"end\":42502,\"start\":42497},{\"end\":42899,\"start\":42894},{\"end\":42918,\"start\":42911},{\"end\":43137,\"start\":43131},{\"end\":43147,\"start\":43145},{\"end\":43153,\"start\":43149},{\"end\":43439,\"start\":43432},{\"end\":43459,\"start\":43448},{\"end\":43475,\"start\":43470},{\"end\":43968,\"start\":43961},{\"end\":43988,\"start\":43977},{\"end\":44004,\"start\":43999},{\"end\":44328,\"start\":44318},{\"end\":44344,\"start\":44335},{\"end\":44363,\"start\":44357},{\"end\":44673,\"start\":44667},{\"end\":44681,\"start\":44675},{\"end\":44695,\"start\":44691},{\"end\":44711,\"start\":44704},{\"end\":44726,\"start\":44720},{\"end\":44967,\"start\":44963},{\"end\":44978,\"start\":44969},{\"end\":44991,\"start\":44980},{\"end\":44998,\"start\":44993},{\"end\":45006,\"start\":45000},{\"end\":45013,\"start\":45008},{\"end\":45026,\"start\":45020},{\"end\":45038,\"start\":45028},{\"end\":45047,\"start\":45040},{\"end\":45062,\"start\":45054},{\"end\":45081,\"start\":45071},{\"end\":45388,\"start\":45384},{\"end\":45399,\"start\":45390},{\"end\":45412,\"start\":45401},{\"end\":45419,\"start\":45414},{\"end\":45427,\"start\":45421},{\"end\":45434,\"start\":45429},{\"end\":45449,\"start\":45445},{\"end\":45462,\"start\":45456},{\"end\":45480,\"start\":45471},{\"end\":45493,\"start\":45487},{\"end\":45505,\"start\":45495},{\"end\":45513,\"start\":45507},{\"end\":45534,\"start\":45525},{\"end\":45551,\"start\":45542},{\"end\":45884,\"start\":45875},{\"end\":45892,\"start\":45886},{\"end\":45902,\"start\":45896},{\"end\":46144,\"start\":46136},{\"end\":46151,\"start\":46146},{\"end\":46160,\"start\":46153},{\"end\":46177,\"start\":46172},{\"end\":46192,\"start\":46186},{\"end\":46463,\"start\":46455},{\"end\":46471,\"start\":46465},{\"end\":46479,\"start\":46473},{\"end\":46487,\"start\":46481},{\"end\":46503,\"start\":46496},{\"end\":46514,\"start\":46507},{\"end\":46529,\"start\":46523},{\"end\":46812,\"start\":46806},{\"end\":46819,\"start\":46814},{\"end\":46824,\"start\":46821},{\"end\":46831,\"start\":46826},{\"end\":46840,\"start\":46833},{\"end\":46848,\"start\":46842},{\"end\":46856,\"start\":46850},{\"end\":46871,\"start\":46863},{\"end\":46890,\"start\":46880},{\"end\":47155,\"start\":47150},{\"end\":47165,\"start\":47161},{\"end\":47182,\"start\":47175},{\"end\":47651,\"start\":47644},{\"end\":47662,\"start\":47660},{\"end\":48026,\"start\":48019},{\"end\":48036,\"start\":48032},{\"end\":48049,\"start\":48044},{\"end\":48404,\"start\":48395},{\"end\":48424,\"start\":48416},{\"end\":48651,\"start\":48642},{\"end\":48658,\"start\":48653},{\"end\":48668,\"start\":48662},{\"end\":48693,\"start\":48688},{\"end\":48918,\"start\":48911},{\"end\":48931,\"start\":48926},{\"end\":49151,\"start\":49141},{\"end\":49416,\"start\":49406},{\"end\":49723,\"start\":49713},{\"end\":49737,\"start\":49730},{\"end\":49744,\"start\":49739}]", "bib_entry": "[{\"attributes\":{\"doi\":\"arXiv:1509.03005\",\"id\":\"b0\"},\"end\":39895,\"start\":39588},{\"attributes\":{\"id\":\"b1\",\"matched_paper_id\":14273320},\"end\":40351,\"start\":39897},{\"attributes\":{\"id\":\"b2\"},\"end\":40640,\"start\":40353},{\"attributes\":{\"id\":\"b3\",\"matched_paper_id\":218874},\"end\":41078,\"start\":40642},{\"attributes\":{\"id\":\"b4\"},\"end\":41592,\"start\":41080},{\"attributes\":{\"id\":\"b5\",\"matched_paper_id\":207211627},\"end\":41818,\"start\":41594},{\"attributes\":{\"id\":\"b6\",\"matched_paper_id\":5155799},\"end\":42016,\"start\":41820},{\"attributes\":{\"doi\":\"arXiv:1512.04455\",\"id\":\"b7\",\"matched_paper_id\":7399885},\"end\":42349,\"start\":42018},{\"attributes\":{\"id\":\"b8\",\"matched_paper_id\":53604},\"end\":42791,\"start\":42351},{\"attributes\":{\"doi\":\"arXiv:1502.03167\",\"id\":\"b9\"},\"end\":43120,\"start\":42793},{\"attributes\":{\"doi\":\"arXiv:1412.6980\",\"id\":\"b10\"},\"end\":43335,\"start\":43122},{\"attributes\":{\"id\":\"b11\",\"matched_paper_id\":16475533},\"end\":43867,\"start\":43337},{\"attributes\":{\"id\":\"b12\",\"matched_paper_id\":12958868},\"end\":44246,\"start\":43869},{\"attributes\":{\"id\":\"b13\",\"matched_paper_id\":195908774},\"end\":44616,\"start\":44248},{\"attributes\":{\"doi\":\"arXiv:1504.00702\",\"id\":\"b14\"},\"end\":44913,\"start\":44618},{\"attributes\":{\"doi\":\"arXiv:1312.5602\",\"id\":\"b15\"},\"end\":45326,\"start\":44915},{\"attributes\":{\"id\":\"b16\"},\"end\":45840,\"start\":45328},{\"attributes\":{\"id\":\"b17\",\"matched_paper_id\":51840631},\"end\":46072,\"start\":45842},{\"attributes\":{\"id\":\"b18\",\"matched_paper_id\":7125379},\"end\":46448,\"start\":46074},{\"attributes\":{\"doi\":\"arXiv:1502.05477\",\"id\":\"b19\"},\"end\":46756,\"start\":46450},{\"attributes\":{\"id\":\"b20\",\"matched_paper_id\":13928442},\"end\":47053,\"start\":46758},{\"attributes\":{\"id\":\"b21\",\"matched_paper_id\":6652724},\"end\":47517,\"start\":47055},{\"attributes\":{\"id\":\"b22\",\"matched_paper_id\":14762932},\"end\":47959,\"start\":47519},{\"attributes\":{\"id\":\"b23\",\"matched_paper_id\":5230692},\"end\":48346,\"start\":47961},{\"attributes\":{\"id\":\"b24\",\"matched_paper_id\":93073745},\"end\":48565,\"start\":48348},{\"attributes\":{\"doi\":\"arXiv:1502.02251\",\"id\":\"b25\"},\"end\":48895,\"start\":48567},{\"attributes\":{\"id\":\"b26\"},\"end\":49049,\"start\":48897},{\"attributes\":{\"id\":\"b27\",\"matched_paper_id\":15177617},\"end\":49317,\"start\":49051},{\"attributes\":{\"id\":\"b28\"},\"end\":49647,\"start\":49319},{\"attributes\":{\"id\":\"b29\",\"matched_paper_id\":12420641},\"end\":49900,\"start\":49649}]", "bib_title": "[{\"end\":39955,\"start\":39897},{\"end\":40769,\"start\":40642},{\"end\":41110,\"start\":41080},{\"end\":41636,\"start\":41594},{\"end\":41837,\"start\":41820},{\"end\":42069,\"start\":42018},{\"end\":42417,\"start\":42351},{\"end\":43426,\"start\":43337},{\"end\":43955,\"start\":43869},{\"end\":44311,\"start\":44248},{\"end\":45382,\"start\":45328},{\"end\":45865,\"start\":45842},{\"end\":46129,\"start\":46074},{\"end\":46798,\"start\":46758},{\"end\":47142,\"start\":47055},{\"end\":47634,\"start\":47519},{\"end\":48009,\"start\":47961},{\"end\":48384,\"start\":48348},{\"end\":49133,\"start\":49051},{\"end\":49398,\"start\":49319},{\"end\":49705,\"start\":49649}]", "bib_author": "[{\"end\":39687,\"start\":39671},{\"end\":39705,\"start\":39687},{\"end\":39974,\"start\":39957},{\"end\":39992,\"start\":39974},{\"end\":39999,\"start\":39992},{\"end\":40446,\"start\":40429},{\"end\":40453,\"start\":40446},{\"end\":40470,\"start\":40453},{\"end\":40482,\"start\":40470},{\"end\":40785,\"start\":40771},{\"end\":40790,\"start\":40785},{\"end\":40801,\"start\":40790},{\"end\":40814,\"start\":40801},{\"end\":40831,\"start\":40814},{\"end\":40840,\"start\":40831},{\"end\":41127,\"start\":41112},{\"end\":41143,\"start\":41127},{\"end\":41158,\"start\":41143},{\"end\":41653,\"start\":41638},{\"end\":41672,\"start\":41653},{\"end\":41855,\"start\":41839},{\"end\":42080,\"start\":42071},{\"end\":42090,\"start\":42080},{\"end\":42105,\"start\":42090},{\"end\":42115,\"start\":42105},{\"end\":42434,\"start\":42419},{\"end\":42441,\"start\":42434},{\"end\":42450,\"start\":42441},{\"end\":42458,\"start\":42450},{\"end\":42465,\"start\":42458},{\"end\":42476,\"start\":42465},{\"end\":42481,\"start\":42476},{\"end\":42491,\"start\":42481},{\"end\":42504,\"start\":42491},{\"end\":42901,\"start\":42887},{\"end\":42920,\"start\":42901},{\"end\":43139,\"start\":43122},{\"end\":43149,\"start\":43139},{\"end\":43155,\"start\":43149},{\"end\":43441,\"start\":43428},{\"end\":43461,\"start\":43441},{\"end\":43477,\"start\":43461},{\"end\":43970,\"start\":43957},{\"end\":43990,\"start\":43970},{\"end\":44006,\"start\":43990},{\"end\":44330,\"start\":44313},{\"end\":44346,\"start\":44330},{\"end\":44365,\"start\":44346},{\"end\":44675,\"start\":44667},{\"end\":44683,\"start\":44675},{\"end\":44697,\"start\":44683},{\"end\":44713,\"start\":44697},{\"end\":44728,\"start\":44713},{\"end\":44969,\"start\":44963},{\"end\":44980,\"start\":44969},{\"end\":44993,\"start\":44980},{\"end\":45000,\"start\":44993},{\"end\":45008,\"start\":45000},{\"end\":45015,\"start\":45008},{\"end\":45028,\"start\":45015},{\"end\":45040,\"start\":45028},{\"end\":45049,\"start\":45040},{\"end\":45064,\"start\":45049},{\"end\":45083,\"start\":45064},{\"end\":45390,\"start\":45384},{\"end\":45401,\"start\":45390},{\"end\":45414,\"start\":45401},{\"end\":45421,\"start\":45414},{\"end\":45429,\"start\":45421},{\"end\":45436,\"start\":45429},{\"end\":45451,\"start\":45436},{\"end\":45464,\"start\":45451},{\"end\":45482,\"start\":45464},{\"end\":45495,\"start\":45482},{\"end\":45507,\"start\":45495},{\"end\":45515,\"start\":45507},{\"end\":45536,\"start\":45515},{\"end\":45553,\"start\":45536},{\"end\":45886,\"start\":45867},{\"end\":45894,\"start\":45886},{\"end\":45904,\"start\":45894},{\"end\":46146,\"start\":46131},{\"end\":46153,\"start\":46146},{\"end\":46162,\"start\":46153},{\"end\":46179,\"start\":46162},{\"end\":46194,\"start\":46179},{\"end\":46465,\"start\":46450},{\"end\":46473,\"start\":46465},{\"end\":46481,\"start\":46473},{\"end\":46489,\"start\":46481},{\"end\":46505,\"start\":46489},{\"end\":46516,\"start\":46505},{\"end\":46531,\"start\":46516},{\"end\":46814,\"start\":46800},{\"end\":46821,\"start\":46814},{\"end\":46826,\"start\":46821},{\"end\":46833,\"start\":46826},{\"end\":46842,\"start\":46833},{\"end\":46850,\"start\":46842},{\"end\":46858,\"start\":46850},{\"end\":46873,\"start\":46858},{\"end\":46892,\"start\":46873},{\"end\":47157,\"start\":47144},{\"end\":47167,\"start\":47157},{\"end\":47184,\"start\":47167},{\"end\":47653,\"start\":47636},{\"end\":47664,\"start\":47653},{\"end\":48028,\"start\":48011},{\"end\":48038,\"start\":48028},{\"end\":48051,\"start\":48038},{\"end\":48406,\"start\":48386},{\"end\":48426,\"start\":48406},{\"end\":48653,\"start\":48635},{\"end\":48660,\"start\":48653},{\"end\":48670,\"start\":48660},{\"end\":48683,\"start\":48670},{\"end\":48695,\"start\":48683},{\"end\":48920,\"start\":48899},{\"end\":48933,\"start\":48920},{\"end\":49153,\"start\":49135},{\"end\":49418,\"start\":49400},{\"end\":49725,\"start\":49707},{\"end\":49739,\"start\":49725},{\"end\":49746,\"start\":49739}]", "bib_venue": "[{\"end\":39669,\"start\":39588},{\"end\":40077,\"start\":39999},{\"end\":40427,\"start\":40353},{\"end\":40846,\"start\":40840},{\"end\":41266,\"start\":41158},{\"end\":41688,\"start\":41672},{\"end\":41904,\"start\":41855},{\"end\":42172,\"start\":42131},{\"end\":42553,\"start\":42504},{\"end\":42885,\"start\":42793},{\"end\":43206,\"start\":43170},{\"end\":43551,\"start\":43477},{\"end\":44032,\"start\":44006},{\"end\":44414,\"start\":44365},{\"end\":44665,\"start\":44618},{\"end\":44961,\"start\":44915},{\"end\":45559,\"start\":45553},{\"end\":45924,\"start\":45904},{\"end\":46243,\"start\":46194},{\"end\":46579,\"start\":46547},{\"end\":46896,\"start\":46892},{\"end\":47264,\"start\":47184},{\"end\":47691,\"start\":47664},{\"end\":48131,\"start\":48051},{\"end\":48441,\"start\":48426},{\"end\":48633,\"start\":48567},{\"end\":48949,\"start\":48933},{\"end\":49168,\"start\":49153},{\"end\":49473,\"start\":49418},{\"end\":49761,\"start\":49746},{\"end\":40142,\"start\":40079},{\"end\":41361,\"start\":41268},{\"end\":43612,\"start\":43553}]"}}}, "year": 2023, "month": 12, "day": 17}