{"id": 17525937, "updated": "2022-03-14 21:13:17.562", "metadata": {"title": "Point registration via efficient convex relaxation", "authors": "[{\"first\":\"Haggai\",\"last\":\"Maron\",\"middle\":[]},{\"first\":\"Nadav\",\"last\":\"Dym\",\"middle\":[]},{\"first\":\"Itay\",\"last\":\"Kezurer\",\"middle\":[]},{\"first\":\"Shahar\",\"last\":\"Kovalsky\",\"middle\":[]},{\"first\":\"Yaron\",\"last\":\"Lipman\",\"middle\":[]}]", "venue": null, "journal": "ACM Transactions on Graphics (TOG)", "publication_date": {"year": 2016, "month": null, "day": null}, "abstract": "Point cloud registration is a fundamental task in computer graphics, and more specifically, in rigid and non-rigid shape matching. The rigid shape matching problem can be formulated as the problem of simultaneously aligning and labelling two point clouds in 3D so that they are as similar as possible. We name this problem the Procrustes matching (PM) problem. The non-rigid shape matching problem can be formulated as a higher dimensional PM problem using the functional maps method. High dimensional PM problems are difficult non-convex problems which currently can only be solved locally using iterative closest point (ICP) algorithms or similar methods. Good initialization is crucial for obtaining a good solution. We introduce a novel and efficient convex SDP (semidefinite programming) relaxation for the PM problem. The algorithm is guaranteed to return a correct global solution of the problem when matching two isometric shapes which are either asymmetric or bilaterally symmetric. We show our algorithm gives state of the art results on popular shape matching datasets. We also show that our algorithm gives state of the art results for anatomical classification of shapes. Finally we demonstrate the power of our method in aligning shape collections.", "fields_of_study": "[\"Computer Science\"]", "external_ids": {"arxiv": null, "mag": "2472414548", "acl": null, "pubmed": null, "pubmedcentral": null, "dblp": "journals/tog/MaronDKKL16", "doi": "10.1145/2897824.2925913"}}, "content": {"source": {"pdf_hash": "ef373c46a0b064ce018b3a8c59b931479447cea9", "pdf_src": "ACM", "pdf_uri": null, "oa_url_match": false, "oa_info": null}, "grobid": {"id": "9766514418b5068b59b64ed0c251fc03b5618092", "type": "plain-text", "url": "s3://ai2-s2-pdf-extraction-prod/parse-results/s2orc_worker/ef373c46a0b064ce018b3a8c59b931479447cea9.txt", "contents": "\nPoint Registration via Effi cient Convex Relaxation\n2016. July 2016. July 24-28, 2016\n\nH Acm Reference Format Maron \nN Dym \nI Kezurer \nS Kovalsky \nY Lipman \nPoint Registration via Effi cient Convex Relaxation\n\nACM Trans. Graph\nAnaheim, CA35732016. July 2016. July 24-28, 201610.1145/2897824.2925913Point registrationShape matchingConvex relaxation Concepts: •Computing methodologies → Shape analysis;\nFigure 1: Initializing high-dimensional ICP for non-rigid registration of two human surfaces using different methods: (a) input shape; (b) random initialization; (c) initialization using Wave Kernel Signatures (four examples are shown to its left); (d) initialization with segment correspondence (four examples are shown to its left). The initialization is crucial for good matching; in (e) we show the result of initialization using PM-SDP which provides comparable result to (d).AbstractPoint cloud registration is a fundamental task in computer graphics, and more specifically, in rigid and non-rigid shape matching. The rigid shape matching problem can be formulated as the problem of simultaneously aligning and labelling two point clouds in 3D so that they are as similar as possible. We name this problem the Procrustes matching (PM) problem. The non-rigid shape matching problem can be formulated as a higher dimensional PM problem using the functional maps method. High dimensional PM problems are difficult non-convex problems which currently can only be solved locally using iterative closest point (ICP) algorithms or similar methods. Good initialization is crucial for obtaining a good solution.We introduce a novel and efficient convex SDP (semidefinite programming) relaxation for the PM problem. The algorithm is guaranteed to return a correct global solution of the problem when matching two isometric shapes which are either asymmetric or bilaterally symmetric.We show our algorithm gives state of the art results on popular shape matching datasets. We also show that our algorithm gives state of the art results for anatomical classification of shapes. Finally we demonstrate the power of our method in aligning shape collections.\n\nIntroduction\n\nRegistration of point sets is a central problem in computer graphics with many applications including shape analysis, shape retrieval, statistical shape inference, and shape reconstruction.\n\nAmong the different formulations of the point set registration problem, the Procrustes matching (PM) formulation is very common: Given two d-dimensional point sets of n points each, P, Q ∈ R d×n , which are neither aligned nor consistently labeled, the task is to find a linear isometry (i.e., an orthogonal transformation) R ∈ O(d) and a permutation X ∈ Πn minimizing the distance between the point sets:\nd(P, Q) = min X,R RP − QX 2 F (1a) s.t. X ∈ Πn (1b) R ∈ O(d)(1c)\nProcrustes matching arises naturally in two and three dimensions (d = 2, 3) for rigid matching problems. Non-rigid matching problems are also often formulated in this way, wherein linear isometries in higher dimension (d 3) approximate non-rigid isometries of the shapes; this idea is advocated in Functional Maps [Ovsjanikov et al., 2012] where the Laplace-Beltrami eigenfunctions are used for the high-dimensional embedding.\n\nThe optimization problem (1) is non-convex and globally optimizing it is difficult. In fact, even the subproblem of finding an exact solution for PM when such a solution exists (i.e., when d(P, Q) = 0) is difficult. It can be shown that this subproblem can be solved in polynomial time iff there is a polynomial time algorithm for the exact graph matching problem. The latter is a well researched problem for which no polynomial time algorithm is known.\n\nThe iterative closest point (ICP) [Besl and McKay, 1992] algorithm is a popular algorithm for locally minimizing (1), based on the fact that when either R or X are held constant, (1) can be solved globally. As we will demonstrate, (1) has a vast amount of local minima, so that the success of ICP depends heavily on a good initialization.\n\nPrevious methods relied on shape features/signatures and/or prior knowledge to initialize ICP. For example, Figure 1 depicts different initializations for solving (1) in the context of Functional Maps for surface matching; a source model (a) is matched to a target model using different initialization for R: (b) shows results achieved from random initialization; (c) demonstrates an initialization of R using Wave Kernel Signatures [Aubry et al., 2011]; and (d) demonstrates initialization using matched segments. Both (c) and (d) are common initializations used in Functional Maps papers [Ovsjanikov et al., 2012;Pokrass et al., 2013]. In this case, all initializations aside from the segmentation correspondence resulted in suboptimal matching (in (c), for instance, the left hand of the model in (a) is incorrectly matched to the chest).\n\nThe goal of this work is to approximate the global minimum of (1). To accomplish this, we present a novel convex relaxation of PM using semidefinite programming (SDP), which we name PM-SDP . Standard SDP relaxations are known to give very accurate approximations, at the price of high time complexity. For example, [Kezurer et al., 2015] give an extremely accurate relaxation for the quadratic matching problem, but their algorithm can only run on a handful of points. We formulate a similar SDP relaxation for PM, and use results on semidefinite completion problems to significantly reduce the size of the semidefinite constraints while remaining equivalent to the original relaxation. As a result, our relaxation has significantly improved time complexity.\n\nOur relaxation is applicable to point sets consisting of around 100 points of a reasonably high dimension (15)(16)(17)(18)(19)(20). Applying our algorithm to initialize the Functional Maps ICP as shown in Figure 1(e) provides results which compare favorably with matchings achieved with random and WKS initializations, and are comparable to results achieved with matched segmentation initialization.\n\nWe demonstrate the accuracy of the suggested relaxation both theoretically and experimentally. We prove that for problems without noise, the relaxation returns a correct global minimum of PM. Up to technical details, this analysis is valid for asymmetric shapes, as well as shapes with bilateral symmetries. The latter include many important instances of the shape matching problem, such as matching human bodies. We also show our algorithm achieves the global optimum for perturbed asymmetric shapes. Experimentally we show that at low noise levels our algorithm still returns the global minimum, and at high noise levels it returns a close-tooptimal local minimum.\n\nWe demonstrate the strength and applicability of the PM-SDP relaxation by achieving state of the art results on standard non-rigid shape matching benchmarks such as SCAPE [Anguelov et al., 2005] and the more recent FAUST [Bogo et al., 2014]. We also demonstrate applications to collective matching and biological shape classification.\n\n\nPrevious work\n\nPoint cloud registration is a basic building block in computer graphics and geometry processing. We mention works that are most relevant to this paper. For detailed survey see [Tam et al., 2013].\n\nFor input shapes or point clouds which are close to being aligned, the ICP algorithm and its many variants [Rusinkiewicz and Levoy, 2001] are a popular choice. For shapes that are not roughly aligned the ICP algorithm can be easily stuck in local minimum. A widely used method for matching shapes in a general position is RANSAC [Fischler and Bolles, 1981], which exhaustively samples the space of possible transformations. Being essentially a brute-force algorithm, its drawback is the high complexity which results in poor scalability to higher dimensions.\n\nAnother way to deal with shapes that are not roughly aligned is to try to find a good initialization for ICP. Representative works in this direction are the works of [Gelfand et al., 2005;Yang et al., 2013] which use combinatorial optimization techniques in order to find the optimal solution in 3D.\n\nNon-rigid shape matching is a central task in geometry processing. We discuss relevant work and refer to relevant surveys for more details [Wand et al., 2011;Van Kaick et al., 2011;Tam et al., 2013]. One approach is to formulate the non-rigid problem as a version of the quadratic assignment problem called quadratic matching. [Mémoli and Sapiro, 2004;Bronstein et al., 2006] suggest to minimize the Gromov-Hausdorff distance where [Bronstein et al., 2006] also introduce the generalized multidimensional scaling variant on point metric spaces; [Leordeanu and Hebert, 2005;Berg et al., 2005] relax the quadratic matching problem using linear programming and spectral techniques; [Kezurer et al., 2015] suggest a convex SDP relaxation to the quadratic matching problem; and [Chen and Koltun, 2015] suggest a linear programming relaxation solved using MRF (Markov Random Fields) techniques.\n\nAnother approach is to restrict the mapping search space to a smaller, more tractable space such as: low dimensional deformation space [Brown and Rusinkiewicz, 2007], conformal mappings [Lipman and Funkhouser, 2009;Zeng et al., 2010;Kim et al., 2011]; or isometries [Ovsjanikov et al., 2010;Tevs et al., 2009]. Some works try to adapt the 3D ICP algorithm to the non-rigid case [Li et al., 2008], whereby typically a deformation model is chosen (e.g., piecewise affine) and the algorithm iterates between finding correspondences and solving for the optimal deformation. Non-rigid shape matching can also be tackled using supervised machine learning techniques, where typically the algorithm is focused on a specific type of data. For instance, [Zuffi and Black, 2015;Wei et al., 2015] train a model that matches human bodies.\n\nThe most relevant methods to this paper pose the non-rigid shape matching problem as a high dimensional rigid shape matching problem [Jain et al., 2007;Ovsjanikov et al., 2008;Ovsjanikov et al., 2012;Pokrass et al., 2013]. These methods map each point of the input point cloud to a vector containing the values of the eigenfunctions of the Laplace-Beltrami operator [Rustamov, 2007]. The central observation is that if the input shapes are isometric, the intrinsic isometry between them becomes an extrinsic isometry in the high dimensional space [Ovsjanikov et al., 2008]. This opens the door for using rigid matching algorithms such as ICP in the context of the more complicated non-rigid matching problem. The problem is that finding a good initialization is difficult for high dimensional problems. Current methods partly employ prior knowledge, such as correspondence between pre-computed segments, to initialize the ICP algorithm [Ovsjanikov et al., 2012].\n\nProcrustes analysis is a tool used to perform statistical study of shapes by canceling transformations that are not shape-altering [Kendall, 1984]. It has many applications in various fields of science [Gower and Dijksterhuis, 2004] and in particular anatomical shape analysis and morphometrics [Mitteroecker and Gunz, 2009;Boyer et al., 2011]. There are many variants to the Procrustes problem, maybe the most general is the one addressed in this paper -PM, for which no closed-form solution is known [Gower and Dijksterhuis, 2004]. To our knowledge, we provide the first closed-form convex formulation guaranteeing a globally optimal solution for the exact and near-exact cases (under mild assumptions).\n\nSemidefinite relaxation and polynomial optimization. Convex relaxations of quadratic optimization problems are often (e.g., [Poljak et al., 1995;Luo et al., 2010]) preformed by replacing quadratic terms with new variables. All quadratic terms then become linear, and a convex semidefinite constraint is added to couple between the original variables and the new variables. A significant drawback of these relaxations is that they are computationally tractable only for very small polynomial problems. [Fukuda et al., 2000;Waki et al., 2006] show that for problems with certain structure, a positive semidefinite constraint on a large matrix can be replaced by constraining certain principal submatrices to be positive semidefinite, resulting in an equivalent problem with significantly improved time complexity. In this paper we devise a quadratic formulation of PM which has this structure, and as a result obtain a relaxation which is tractable for medium sized problems.\n\n\nApproach and Formulation\n\nWe present our convex relaxation of PM. We first discuss the general quadratic optimization problem and present a novel strategy for replacing its \"standard\" time consuming SDP relaxations with an equivalent, but significantly more efficient SDP relaxation. In this context, we then instantiate our relaxation for the PM problem.\n\nFull SDP relaxation of quadratic problems. Quadratic optimization problems are problems of the form\nmin x∈R N f0(x) (2a) s.t. fs(x) = 0, s = 1, . . . , S (2b) ft(x) ≥ 0, t = S + 1 . . . T (2c)\nwhere fi are quadratic multivariate polynomials.\n\nA typical relaxation procedure includes two steps (see [Luo et al., 2010] for a survey on SDP quadratic relaxations): First, the quadratic polynomials fi are linearized by introducing new variables Yij, 1 ≤ i, j ≤ N , which replace quadratic monomials xixj, so that fj(x) becomes a linear polynomial in the variables x, Y denoted L[fj](x, Y ). This gives an equivalent formulation of (2):\nmin x,Y L [f0] (x, Y ) (3a) s.t. L [fs] (x, Y ) = 0, s = 1 . . . S (3b) L [ft] (x, Y ) ≥ 0, t = S + 1 . . . T (3c) Y = xx T (3d)\nWith the exception of constraint (3d), Problem (3) is a convex problem (in fact a linear program). Therefore, the second step in this relaxation procedure is replacing (3d) with a convex constraint. The convex hull of the set defined by (3d) is the set defined by the convex constraint Y xx T , which is equivalent to the semidefinite constraint\n1 x T x Y 0.(4)\nA natural relaxation of (3) is therefore given by replacing (3d) with (4). [Zhao et al., 1998] and more recently [Kezurer et al., 2015] used this approach to relax the quadratic matching and quadratic assignment problems. The obtained relaxation is significantly more accurate than prevalent relaxations for quadratic matching, but its scalability is poor; in fact, it cannot handle more than a handful of points to be matched, completely hindering some applications.\n\n\nEfficient SDP relaxation.\n\nThe key to a useful and efficient relaxation of (2) and consequently our problem (1) is to reduce the dimension of the semi-definite constraint (4) which is the main factor determining time efficiency of the semidefinite program.\n\nTo obtain a more efficient SDP relaxation, we make the observation that for some problems not all terms in the matrix xx T appear in the polynomials fj. This is, for example, the case in the PM problem, as will soon be shown. In such cases, we can find a collection J of subsets of {1, . . . , N } so that all polynomials fj include only expressions from xJ x T J , J ∈ J . An equivalent formulation for (3) can therefore be obtained by replacing (3d) with YJ = xJ x T J , for all J ∈ J . In turn, replacing these with the convex constraints\n1 x T J xJ YJ 0, J ∈ J(5)\nwe obtain a convex relaxation for (2). If all subsets J ∈ J satisfy |J| N , the obtained relaxation is considerably more efficient than the original (full) relaxation.\n\nThere is no unique way to apply this more efficient relaxation; a given instance of a quadratic optimization problem may have several different possible decompositions J . Those that use small semidefinite constraints will be more efficient, but not necessarily as accurate as those using larger semidefinite constraints; the latter, however, can quickly become intractable for certain problems. Nevertheless, if J is chosen so that it satisfies the chordality condition we will soon describe, the obtained relaxation is in fact equivalent to the full relaxation.\n\nIn general, any solution for the full relaxation also satisfies (5). For equivalency, we need to ensure that a solution for the efficient relaxation (5) can always be completed to a solution of the full relaxation. For that end we need to show there is a solution for the following matrix completion problem: We are given entries of xJ , YJ satisfying (5), and we are searching for a completion of Y that satisfies (4). Since the objective and linear constraints depend only on the coordinates which were determined before the completion, the full solution will also fulfill the linear constraints, and the objective will not be affected by the completion.\n\nThe condition that allows solving the completion problem is related to the structure of the known coordinates of the matrix. The collection J defines an undirected graph G = (V, E) whose vertices are V = {1, x1, . . . , xN }. Two distinct vertices are connected by an edge iff they both appear in one of the matrices (5) defined by some J ∈ J . A graph G is chordal if every (simple) cycle with more than three vertices contains a chord, i.e., an edge between two non-adjacent members of the cycle. For example the graph in the top of the inset has a cycle which does not contain a chord and thus is not a chordal graph. The bottom graph is chordal.\n\nIf G is chordal, the following theorem from [Grone et al., 1984] guarantees that the matrix completion problem has a solution, and therefore that the two relaxations are equivalent: Theorem 1. If G is chordal, and (xJ , YJ )J∈J satisfy (5), then the missing coordinates of Y can be chosen so that the full semidefinite constraint (4) holds.\n\n\nPM-SDP Formulation.\n\nWe now return to the PM problem and instantiate the strategy presented above. First, we note that PM can be formulated as the following quadratic problem: where we denote by 1 ∈ R n×1 the all-ones vector, by Xj the j-th column of X, and by diag(Xj) the diagonal matrix whose diagonal entries are Xj.\nmin X,R RP − QX 2 F (6a) X1 = 1, 1 T X = 1 T (6b) XjX T j = diag(Xj), j = 1 . . . n (6c) RR T = R T R = I(\nTo see this is indeed an equivalent formulation of PM, note that if (R, X) is a feasible solution of (6), then R is orthogonal by definition. The constraint (6c) implies that X 2 ij = Xij for all i, j, so that all elements of X are in {0, 1}. By (6b) the rows and columns of X sum to one, which implies that X is a permutation matrix.\n\nIn the other direction, note that if (R, X) ∈ O(d) × Πn, then since each column of X has only one non-zero element, XjX T j is diagonal. Since all elements of X are in {0, 1}, X 2 ij = Xij for all i, j so that (6c) holds. It is straightforward to check that (6b),(6d) hold as well.\n\nAll polynomials in (6) are quadratic in the entries of R and X. The full SDP relaxation for quadratic problems described above can then be applied; this will result in a vector x, consisting of the elements of R and X, of dimension d 2 + n 2 ; the SDP constraint will be of size (d 2 + n 2 + 1) × (d 2 + n 2 + 1).\n\nWe obtain an equivalent, more efficient, relaxation by utilizing the efficient SDP relaxation approach; the key observation here is that all the quadratic polynomials participating in the formulation (6) of the PM problem can be expressed using linear polynomials in the\nentries of XjX T j , Xj [R] T , and [R] [R] T , where [R] ∈ R d 2 ×1\nis the column stack of the matrix R and j = 1 . . . n. We therefore introduce new matrix variables Zj, constrained to satisfy\nZj = Xj [R] Xj [R] T , j = 1 . . . n(7)\nLet us next see how the objective and constraints of Problem (6) are linear in the variables X, R, Zj. First, the objective of (6) can be rewritten as\nRP − QX 2 F = j RPj − QXj 2 2 = j tr (WjZj)+const\nfor some constant matrices Wj since RPj − QXj 2 2 is linear in the entries of Zj. Denoting (8) the constraint (6c) can be rewritten as Aj = diag(Xj). Finally, the constraints (6d) are affine functions of C and can be rewritten as\nZj = Aj B T j Bj C , Aj ∈ R n×n , C ∈ R d 2 ×d 2 , Bj ∈ R d 2 ×ntr(H C) + b = 0, = 1 . . . 2d 2\nfor some constant matrices H . Replacing the non-convex equality constraint of (7) with convex semidefinite constraints of type (4), we obtain our relaxation for the PM problem, PM-SDP:\nmin Z j ,X,R j tr (WjZj) (9a) X1 = 1, 1 T X = 1 T (9b) Aj = diag(Xj), j = 1 . . . n (9c) tr(H C) + b = 0, = 1 . . . 2d 2 (9d) Zj Xj [R] Xj [R] T , j = 1 . . . n(9e)\nwhere Aj and C are defined as in (8).\n\n\nFigure 2:\n\nThe graph corresponding to the Procrustes Problem (right, each disk represents a clique) is chordal, that is, has no minimal cycles of length at-least four. The adjacency matrix is shown on the left.\n\nChordality of the relaxation. To show that (9) is equivalent to the full relaxation of the PM problem, we need to show that the graph G induced by J = {Jj} is chordal, where Jj is the set containing the variables [R] and Xj. The adjacency matrix of G for this case is illustrated in Figure 2 (left) where each gray square represents a full block of ones; on the right, we illustrate the corresponding graph G where each disk represents a clique which corresponds to a diagonal block in the adjacency matrix. To show G is chordal it is enough to show every cycle of length at-least 4 has a chord: Indeed, if a cycle is completely contained in one of the sets Jj (represented as triangles in Figure 2, right) then any two vertices are connected by an edge; otherwise there are two non consecutive visits to vertices in the 1, [R] cliques (top disks), and these vertices are connected by an edge.\n\nDimension and complexity. We note that (9e) includes n semidefinite constraints involving N × N matrices, where N = d 2 + n + 1, as opposed to the full relaxation which in this case would involve a square matrix with N = d 2 + n 2 + 1. When the number of points in the sets n is significantly larger than the dimension d of the space the point reside in (i.e., n d), which is often the case in point registration problems, PM-SDP will be significantly more efficient than the full SDP relaxation.\n\nRelaxation properties. The PM-SDP relaxation has the following natural theoretical properties:\n\n1. Rotation and relabeling invariance: Rotating or relabeling the input shapes will not affect the solution provided by the relaxation. More precisely, if P is replaced with a point cloudP obtained from P by relabeling and applying an orthogonal transformation, then the objective of PM-SDP remains unchanged, and X, R transform accordingly.\n\n\nLower bound:\n\nSince PM-SDP is a relaxation its optimal objective is less or equal to the PM optimal objective. We denote the objective of PM-SDP by d.\n\n\nPositivity:\n\nThe objective of PM-SDP is always non-negative. This is natural since this is the case for the objective of PM .\n\n4. Convex-hull of R, X: The R, X coordinates of a feasible solution for PM-SDP are in the convex hull of O(d) × Πn.\n\nThe proof of the these properties as well as the theorems presented below are given in [Dym and Lipman, 2016].\n\nExact recovery refers to the problem of finding R, X ∈ O(d) × Πn which solve the equation RP = QX, when such solutions exists, i.e., when d(P, Q) = 0. We call such solutions exact solutions. From the computational perspective, exact recovery for PM is equivalent to exact graph matching. The latter is a well-researched problem, not known to be polynomial. Accordingly, proving exact recovery in full generality is not likely. However, under the assumption that the covariance d × d matrix P P T of the point cloud P has a simple spectrum, and an additional weak assumption, we are able to prove exact recovery. This too is analogous to the graph matching problem where finding exact solutions for graphs with simple spectrum affinity matrices is solvable in polynomial time [Babai et al., 1982].\n\nThe assumption that P P T has a simple spectrum implies that the symmetries of P are all reflections along the principle axes of the point set P . In particular, it implies that all symmetries of P are bilateral. The class of bilateral symmetric shapes includes many important instances of the shape matching problem. Note however, that not all reflections along principle axes are necessarily symmetries of P . The additional weak assumption required for our exact recovery with symmetries result formulated below is that there exists a point Pj in P such that its reflections along principle axes belongs to P only for symmetries of P . The inset figure demonstrates a shape with point having this property (blue); Applying a horizontal flip, which is a symmetry, maps the point to another point on the shape, while applying a (non-symmetry) vertical flip maps it outside of the shape (red). We are not aware of bilateral symmetric shapes of practical interest that do not satisfy this condition.\n\nThe exactness argument starts with assuming we are given P, Q with d(P, Q) = 0 and showing that when d(P, Q) = 0 also d(P, Q) = 0. This follows from relaxation properties 2 and 3 described above: from the lower bound property we know that the objective d of PM-SDP is a lower bound of the objective d of PM. From the positivity property, d is always non-negative. It follows that when d(P, Q) = 0 also d(P, Q) = 0, and the set of feasible solutions of PM-SDP with zero objective, which we call the exact convex solution set, is a superset of the set of exact solutions. When the shapes are asymmetric, the exact convex solution set consists of only one point -the exact solution, Theorem 2. Let P, Q be asymmetric shapes with d(P, Q) = 0 satisfying the simple spectrum and weak conditions. Then PM-SDP has a unique exact convex solution, which is also the unique exact solution of PM.\n\nWhen P, Q are bilateral symmetric, there are several exact solutions. All convex combinations of these solutions will be in the exact convex solution set, so that generally exact convex solutions will not be exact solutions. However, by restricting ourselves to the R coordinate of both the exact solutions and the convex exact solutions, which we refer to as exact orthogonal solutions and exact convex orthogonal solutions, we are able to show: Theorem (Full version of theorem 2). Let P, Q be shapes with d(P, Q) = 0 satisfying the simple spectrum and weak conditions. Then the exact orthogonal solutions of PM are the extreme points of the set of exact convex orthogonal solutions.\n\nThe set of exact convex orthogonal solutions is a convex set and therefore its extreme points can be found by simply optimizing linear energies over this set (a convex problem again). One simple algorithm for obtaining all exact solutions is repeatedly solving a variation of our convex relaxation: minimize a random linear energy tr(W R), where W ∈ R d×d is a random matrix drawn from the uniform measure on the unit sphere, under the set of constraints of (9), and adding the linear constraint that the objective (9a) is zero. We prove, Theorem 3. The random algorithm returns an extreme point of the set of exact convex orthogonal solutions (i.e., an exact orthogonal solution) with probability one. Moreover, all extreme points are found with the same probability.\n\nOnce an exact orthogonal solution is found it can be shown that the X coordinate of the solution is guaranteed to be a permutation. The inset demonstrates the output of the probabilistic algorithm described in theorem 3 on two point sets with perfect bilateral symmetries sampled from a model of a chair and a picnic table. The random algorithm retrieves the two bilateral symmetries of the chair, and the four bilateral symmetries of the picnic table.\n\n\nImplementation details\n\nWe discuss implementation details of the PM-SDP algorithm.\n\nInjective matching. We consider a slight variation of PM where we allow the point cloud P to have fewer points than Q, and search for the correspondence between P and a subset of the points of Q. This formulation is useful to account for the inherent noise caused from samplings of different shapes. Furthermore, in case the shapes we wish to compare are not isometric, certain points on one shape might not have a good match on the second one.\n\nWe denote the number of points of P by k ≤ n. The formulation of PM in (1) remains unchanged, except now X ∈ R n×k is constrained to be a matrix with entries in {0, 1} such that all columns of X have exactly one non-zero entry. The only necessary modification for PM-SDP is that the constraint X1 = 1 in (9) should be replaced with the constraint X1 ≤ 1.\n\nUtilizing priors for computational efficiency. The PM-SDP framework allows incorporating priors to improve computational complexity by further reducing the size of the SDP constraint. This is done by noting that if we know or assume the points Pj and Qi should not correspond then setting Xij = 0 reduces the size of the SDP constraint by one. Indeed, returning to (7) we see that when Xij = 0 we may also assume that the i-th row and column of Zj are also zero. Similarly, if Rst = 0 we can eliminate a row and column of Zj.\n\nLet us demonstrate where this can be used for near-isometric matching. We rule out unlikely correspondences using the average geodesic distance (AGD) descriptor [Kim et al., 2011]. Corresponding points on nearly isometric shapes should have roughly the same AGD value since this descriptor is isometry-invariant. For close to isometric shapes, we can safely rule out correspondences between points whose AGD value is significantly different. If the possibility of Qi corresponding to Pj, is ruled out, we set Xij = 0.\n\nFor isometric shapes, the Laplace-Beltrami operator of both shapes has the same eigenvalues, and the linear isometry R takes eigenfunctions of the first shape with eigenvalue λ to eigenfunctions of the second shape with the same eigenvalue λ. In the most common simple spectrum case, this means that R is a diagonal matrix, if the maximal eigenvalue multiplicity of the shapes is two then R is tridiagonal, etc. For near-isometric shapes, we make the assumption that R is m-diagonal, that is, has m non-zero diagonals symmetrically around the main diagonal.\n\nIn practice, we use the AGD descriptor to rule-out 50-70% of the correspondences, and constrain R to be 1,3, or 5-diagonal. Fortunately, the effect of incorporating these priors on the quality of the relaxation is negligible: Figure 3 demonstrates that using PM-SDP to match shapes from SCAPE dataset (using the protocol that will be described in Section 6) produces essentially equivalent results with and without using the AGD descriptor to rule out unlikely matches; the former, however, has the advantage of significantly improved computational efficiency.  Figure 3: Ruling out matches with the AGD descriptor has a negligible effect on the quality of the relaxation: (a) depicts the results of PM-SDP on SCAPE dataset [Anguelov et al., 2005] with and without AGD to rule out unlikely matches; (b) the objective after local minimization; and (c) objective value achieved by PM-SDP. The PM-SDP objective is lower for the unpruned version while the rest of the results are equivalent for both versions.\n\nLocal minimization. Since the feasible set of PM-SDP is larger than the feasible set of PM, the solution of PM-SDP in general may not contain orthogonal and permutation matrices. We therefore project the solution onto the feasible set of PM. We do this by locally minimizing PM using the output of PM-SDP to initialize the algorithm. The local minimization is done using an ICP-like algorithm which interleaves between minimizing over one of the matrices R, X while holding the other constant: fixing R results in a linear program, while for a fixed X there exists a closed-form solution [Gower and Dijksterhuis, 2004]. In Figure 4 we illustrate the doubly-stochastic matrix X as outputted from the PM-SDP relaxation and the permutation achieved after the projection. As shown, the PM-SDP output is already very similar to the projection result demonstrating the tightness of the PM-SDP relaxation. More details are in Appendix A.\n\nThe local minimization following the PM-SDP relaxation allows generalizing Theorem 2 to the inexact case: Corollary 1. Let P, Q be point clouds satisfying the conditions of Theorem 2, and let P , Q be sufficiently small perturbations of P, Q. Then PM-SDP followed by the local minimization returns the unique (global) solution of PM for P , Q .\n\n\nEvaluation\n\nWe test the tightness of the PM-SDP relaxation by comparing it to the ground truth obtained from an exhaustive brute-force sampling algorithm. The latter is only tractable for low dimensional d, and we choose d = 3: The exhaustive algorithm densely samples ∼ 10k points from a uniform distribution over O(3) and uses each sample Rj as an initialization for the local minimization algorithm described above.\n\nIn Figure 5 we compare the histograms of optimal values achieved by the exhaustive sampling algorithm (in red) to the energy achieved by PM-SDP (in blue). The data for this experiment was created by randomizing Q ∈ R 3×50 according to a uniform distribution on [0, 1], and setting P = R T QX + ε, with X ∈ Π50, R ∈ O(3) and noise ε ∼ N d×n (0, σ 2 ). (a-d) show the results of a few typical runs with increasing amount of noise σ = 0, 0.05, 0.1, 0.2. We note that the number of local (sub-optimal) minima for the exhaustive sampling is surprisingly high; for example, for noise level σ = 0.1 we found more than 1000 local energy minima. Additionally, the experiment in (a) verifies our theoretical exactness result as can be seen by the fact that the blue point achieves the left most value of the red histogram. When the noise level is low to Figure 4: Visualization of the doubly-stochastic map X as generated by the PM-SDP relaxation when comparing two SCAPE models; each pair of surfaces depicts a column of X by coloring the point set Q according to the corresponding value in X; the X matrix before and after projection on the permutations is shown at the bottom-right.\n\nmedium (σ = 0.05, 0.1) the PM-SDP relaxation usually produces optimal result, see (b-c). When noise level is high (σ = 0.2 in (d)) the relaxation does not provide an optimal solution but nevertheless produces a close to optimal result.\n\nA quantitative evaluation of the optimality of PM-SDP is given in Figure 5, (e-f). We ran 80 random experiments for d = 3 and d = 5 with noise level σ = 0.1 and measured the optimal objective value achieved by PM-SDP in comparison to the global minimum and median value of the objective values found by the exhaustive algorithm. For visualization, we subtracted the value of the optimal value from all of the results. PM-SDP (black line) usually returns the optimal value (green) and always returns a better result than the median objective value (blue) of the exhaustive algorithm.\n\n\nApplications\n\n\nFunctional maps\n\nThe main application of our algorithm is non-rigid shape matching of pairs of surfaces P, Q. Following [Ovsjanikov et al., 2012] we pose this problem as a high dimensional PM problem, replacing non-rigid isometries with linear isometries (orthogonal transformations) in higher dimensional space. More specifically, we sample k points on the first shape and n points on the second shape uniformly using farthest point sampling [Eldar et al., 1997] initialized with extrema of average geodesic distance (AGD) [Kim et al., 2011], and embed P, Q in R d . The embedding is done by first computing the first d eigenfunctions of the cot-weight Laplace-Beltrami (LB) operator [Pinkall and Polthier, 1993] on each of the surfaces,\n{Φ P i }, {Φ Q i }, i = 1 .\n. . d and then assigning the d coordinates (Φ P 1 (p), .., Φ P d (p)) to each point p ∈ P , and similarly to every point q ∈ Q.\n\nCurrent approaches using this formulation, solve the resulting high dimensional PM problem using an ICP-type iterative algorithm; as this problem is shown to have a vast number of local minima even for d = 3 (see Figure 5 (a-d)), initialization is crucial. Using standard shape signatures or features often does not provide a satisfactory initialization (e.g., Figure 1, (b-c)), and previously this ICP procedure was initialized with matched segments for successful results [Ovsjanikov et al., 2012;Pokrass et al., 2013]. In the experiments of this subsection we use PM-SDP followed by local minimization to initialize the ICP of [Ovsjanikov et al., 2012] that uses the entire embedded models. In comparisons to previous works we used code supplied by the authors with their default parameters.\n\n\nSCAPE dataset.\n\nWe evaluated the performance of PM-SDP for non-rigid isometric matching using the SCAPE dataset [Anguelov et al., 2005]. We used n = 100 sampled points, d = 17 eigenfunctions, and injective mapping of k = 50 out of n = 100 . For better efficiency we allowed each point in P to be matched only to the 30% of the points in Q that have the closest AGD, and selected m = 5 (5 non-zero diagonals in R). The SDP optimization was performed using Mosek [MOSEK, 2015]. We extended our results to a full correspondence of all the vertices by solving ICP in dimension d = 30. The average running time for a pair with these settings is 30-35 minutes on an Intel Xeon E5 CPU. We also tested a faster version by taking d = 30 and using diagonal R, that is m = 1; this gave only slightly inferior results with running time of 2.5 minutes per pair.  Figure 6: Results of our algorithm and state of the art algorithms on the SCAPE [Anguelov et al., 2005] non-rigid shape matching benchmark. Figure 6 shows a comparison of our algorithm with several state of the art algorithms. The comparison was done according to the protocol of [Kim et al., 2011] accepting symmetries. Our method compares favorably to functional maps (FM) when initialized with matched segments [Ovsjanikov et al., 2012] and improves upon FM with automatic shape signature initialization. We also show in green the results of the faster, less accurate, variant of our algorithm described in the previous paragraph. Figure 7 shows typical results of our algorithm from this experiment.\n\nFAUST dataset. We evaluated the performance of PM-SDP for non-rigid non-isometric matching on the FAUST dataset [Bogo et al., 2014]. We used a similar setup as in the previous experiment, with the following differences: We generated the LB operator directly on the point cloud sampling generated by [Chen and Koltun, 2015] using a similar construction to [Belkin and Niyogi, 2003] (weights based on geodesic distances instead of Euclidean distances). We also used two versions of the PM-SDP: For the first we chose d = 17, m = 5 and we allowed each point in P to be matched only to the 40% points in Q that have the closest AGD; the running time of this parameters set is about 40 minutes per pair. For the second, faster parameter set, we used n = 40, k = 30, an embedding with d = 10, m = 5, and kept 80% of Q for each point in P ; the running time with these parameters is less than 4 minutes per pair. Figure 8 compares PM-SDP with the recent method of [Chen and Koltun, 2015] which demonstrated superb state of the art results on this dataset. However, they rely on the assumption that the shapes are initially aligned in 3D and indeed use this alignment by adding a regularization term. In order to make a fair comparison we disabled this regularization term. When this term is removed, intrinsic symmetries might be found by the algorithm. In order to account for that we sampled a set of 52 ground truth points in each mesh, and added the symmetric flip to the ground truth map. Aside from that, we followed Chen and Koltun's evaluation protocol (including using their point clouds as stated above). As can be read from the graphs, our algorithm (blue) compares favorably in both the inter and intra class matching scenarios in terms of cumulative error distribution and average error. We also show here a faster version of our algorithm (green), which provides good results in a shorter computation time. Figure 9 shows some typical results of our algorithm for both inter and intra class matching. Figure 7: Examples of typical maps obtained with PM-SDP on the SCAPE dataset [Anguelov et al., 2005]. In all pairs: left mesh is colored using a predefined color map; right mesh is colored according to the correspondence. Bottom right: a failure case.\n\n\n73:7 • Point Registration via Efficient Convex Relaxation\n\n\nSCAPE dataset (raw scans).\n\nWe further tested our algorithm on the SCAPE original raw scans dataset [Anguelov et al., 2005] that contain missing data, holes and noise. We used the same preprocessing method of [Chen and Koltun, 2015] and ran our algorithm with exactly the same parameters as on the FAUST dataset on the 71 pairs as defined in the benchmark of [Kim et al., 2011]. Figure 10 shows the cumulative error graph and a few typical results. We note that also here we ran [Chen and Koltun, 2015] without the extrinsic regularization term (in addition to the reasons stated above, for the SCAPE dataset this prior is inappropriate due to its pose diversity).\n\n\nSHREC07 dataset.\n\nWe also ran PM-SDP (n = 100, k = 40) on the highly non-isometric SHREC07 dataset [Giorgi et al., 2007]. On this dataset, PM-SDP achieved good results only on some of the classes; Figure 11 demonstrates typical results from these classes: the Ant, Teddy and Glasses.\n\n\nAnatomical classification\n\nThe Procrustes distance with labeled points (i.e., when X is known) is a well-known measure of shape similarity in fields such as statistical shape analysis [Kendall, 1984;Boyer et al., 2011]. The sampling and labeling of points in a collection of shapes is tedious work that requires the attention of an expert for several months [Boyer et al., 2011]. The possibility of solving Procrustes matching with unlabeled points (i.e., the PM problem in this paper) using PM-SDP makes the task of finding meaningful landmarks unnecessary.  [Bogo et al., 2014] by PM-SDP compared to [Chen and Koltun, 2015] without the global extrinsic regularization term.\n\nWe took three anatomical bone datasets containing 116, 61 and 45 models respectively from [Boyer et al., 2011]. We sampled n = k = 120 points of each shape using farthest point sampling, ran PM-SDP and used its output to initialize ICP that matches 400 farthest points on the shapes. This computation takes about 7 minutes for each pair.\n\nWe followed the classification protocol suggested in [Boyer et al., 2011] where each shape is classified according to its nearest (in Procrustes distance) neighbor; each shape in the datasets has three biological tags: Genera, Family and Above Family, and we tested classification of all three categories. Table 1 presents classification success rates (what fraction of shapes were correctly classified in each classification test) and shows PM-SDP compares favorably to Boyer's method [Boyer et al., 2011], and is remarkably comparable to the results achieved using human expert labeled landmarks. Figure 12 shows a few examples of maps that were found by PM-SDP.\n\n\nShape collection alignment\n\nWe demonstrate another application of PM-SDP to consistent alignment of shapes. The task we would like to solve here is the following: given a set of semantically similar shapes -apply an orthogonal transformation per shape so that the shapes are aligned. We solve this problem by using PM-SDP to solve for pairwise orthogonal transformations and permutations over the entire dataset and then modifying the ICP procedure we mentioned in section 4 to project onto the set of consistent orthogonal transformations; The details of the projection procedure and definition of consistency are given in appendix B. To demonstrate the flexibility of our approach, we use a variation of the high dimensional embedding used above. We embedded the shapes into a seven-dimensional space, the first three coordinates being the euclidian x, y, z coordinates, and the other 4 were eigenfunctions of the LB operator (as was done for isometric matching above). Since the Euclidian coordinates should not mix with the eigenfunction coordinates we constrain R to be block diagonal.\n\nI n t r a -s u b j e c t I n t e r -s u b j e c t Figure 9: Examples of typical maps obtained with PM-SDP on the FAUST dataset [Bogo et al., 2014]. Top row: intra-subject. Bottom rows: inter-subject. Bottom right: a failure case.\n\nAs demonstrated in Figure 13 PM-SDP with d = 7 (second row) yielded a better consistent alignment in comparison with the method for d = 3. The shapes for this experiment are taken from three classes of the SHREC07 [Giorgi et al., 2007] dataset. We made sure the shapes are arbitrarily rotated, sampled n = k = 20 farthest points on each shape and solved for all pairwise matchings; for d = 3 each pair is computed in 2-3 seconds and for d = 7 each pair takes 15-20 seconds.\n\n\nTiming.\n\nTiming of experiments that appear in the paper have already been stated. Here we provide quantitative timing experiments. Figure 14 shows typical run times as a function of dimension or number of points. The experiments were conducted on random and noisy synthetic data. In experiment (a) the dimension d varies from 3 to 20 and we match k = 50 points to n = 100 points. Experiment (b) compares runtime versus the number of points: in each experiment we match a k point point cloud to a n = 2k point point cloud (up to k = 50, n = 100) and the dimension is constant d = 10. In both cases, R was constrained to be 5-diagonal and we allowed each point to be matched to 30% of the points in the other point cloud based on prior knowledge (in this case these points were selected randomly). (c) Shows comparison of the running time of PM-SDP and the full SDP relaxation discussed in section 3. In this case we use d = 10, k = n = 5 . . . 25. Notably, the full relaxation becomes intractable for more than 17 point, whereas the equivalent PM-SDP formulation solves these problems in just seconds.   [Giorgi et al., 2007]. Bottom right: a failure case (incorrect corresponding legs).\n\n\nConclusions\n\nSummary. We have developed an algorithm that approximates the global minimum of the PM problem with a proven exact recovery property in presence of bilateral symmetries, as well as several other theoretical properties of the algorithm. We demonstrated state of the art results for non-rigid isometric and near-isometric shape matching problems solved using our convex relaxation. We also showed that PM-SDP is useful for anatomical classification of shapes and for aligning shape collections.\n\n\nLimitations.\n\nIn contrast to previous SDP relaxations of similar problems, we are able to deal with the registration of around one hundred points. Nonetheless, in comparison with non-SDP based approaches, the main limitation of this algorithm remains its time complexity, which we predict will improve as research on SDP optimization progresses; another limitation of our shape matching framework is the fact that spectral embedding is aimed at nearisometric matching, and is not a good model of the problem for non-isometric shapes.\n\nFuture work. One direction we intend to pursue is applying our technique for constructing efficient relaxations for quadratic optimization to different problems other than PM. An interesting theoretical problem which we intend to pursue is proving that PM-SDP (or similar relaxations) give a good approximation of the solution in the general (noisy, far from exact) case, in contrast with our theoretical analysis here which applies only for isometric or near-isometric shapes. Extending to two-way partial matching is also interesting.  Table 1: Classification results (accuracy) achieved by PM-SDP on three anatomical shape data sets compared with [Boyer et al., 2011] and a human expert. Figure 12: Examples of typical maps that were obtained by PM-SDP on the anatomical datasets of [Boyer et al., 2011]. First row: Teeth; second row: Metatarsal bone; third row: Radius bone. Figure 13: Finding consistent orthogonal transformations between non-isometric shapes. The figure shows three classes from the SHREC07 dataset [Giorgi et al., 2007]. The first row of each class shows the alignment obtained by PM-SDP in 3D. The second row shows the alignment achieved using a 7-dimensional embedding with PM-SDP. Rectangles show corrected orthogonal transformations. \n\nFigure 5 :\n5PM-SDP tightness evaluation: (a-d) show the histograms of the objective values achieved by the exhaustive sampling algorithm compared to the optimal PM-SDP objective on a few typical runs. When the noise level is low to medium, our algorithm usually finds the global minimum. On higher noise levels it returns an objective value close to optimal. (e-f) show illustrations of the deviation of the optimal PM-SDP objective value from the global optimum and the median value computed by the exhaustive algorithm when σ = 0.1, d = 3 and d = 5.\n\nFigure 8 :\n8Cumulative and average errors achieved on the FAUST dataset\n\nFigure 10 :\n10Performance on the SCAPE raw scans dataset[Anguelov et al., 2005]. Top left: Cumulative error distribution. Other: Examples of typical maps obtained with PM-SDP . Bottom right: a failure case (forward-backward flip).\n\nFigure 11 :\n11Examples of maps obtained with PM-SDP on the nonisometric SHREC07 dataset\n\nFigure 14 :\n14typical run times as functions of the dimension and the number of points. (a) as a function of the dimension d, (b) as a function of the number of points n, (c) Comparison to the full relaxation discussed in section 3.\n\n\n73:9 • Point Registration via Efficient Convex Relaxation ACM Trans. Graph., Vol. 35, No. 4, Article 73, Publication Date: July 2016Dataset \n\nClassification PM-SDP Boyer et al. Expert \nGenera \n91.9 \n90.9 \n91.9 \nTeeth \nFamily \n94.3 \n92.5 \n94.3 \nAbove Family \n98.2 \n94.8 \n95.7 \nGenera \n79.6 \n79.6 \n88.1 \nMetatarsal \nFamily \n93.4 \n91.8 \n93.4 \nAbove Family \n100 \n100 \n100 \nGenera \n82.2 \n84.4 \n77.8 \nRadius \nFamily \nNA \nNA \nNA \nAbove Family \nNA \nNA \nNA \n\n\nACM Trans. Graph., Vol. 35, No. 4, Article 73, Publication Date: July 2016\nAcknowledgementsThis research was supported in part by the European Research Council (ERC Starting Grant \"SurfComp\", Grant No. 307754), the Israel Science Foundation (Grant No. 1284/12), I-CORE program of the Israel PBC and ISF (Grant No. 4/11). The authors would like thank Maks Ovsjanikov, Vladlen Koltun, Alex and Michael Bronstein and Qifeng Chen for code, helpful discussions and comments, and James Davis for the raw SCAPE scans, and the anonymous reviewers for their useful comments and suggestions.Appendix A Local minimizationThe local minimization can be initialized using the output of PM-SDP in four different ways. Two immediate possibilities are given by choosing the R or X coordinates from the optimal solution. We note that R, X may not be in O(d) × Πn, but as mentioned previously they are in the convex hull of that set. Two other possibilities can be obtained from decomposing the lifted variables Bj as explained next. When (7) holds, we can use (8) to write Bj = [R] X T j . We can then combine the matrices Bj into a larger matrix B so that B = [R] [X] T , and X, R can be recovered in this case by factorizing B into an outer product of two vectors. Motivated by this, we do the following:Appendix B Collection alignmentIn this section we present the collection alignment algorithm mentioned in sub-section 6.3 . First we solve PM for each pair of shapes in the collection with the additional constraint that Rij is in the convex hull of SO(3) using the formula from[Saunderson et al., 2014]. Then, we build a large matrix R containing all the orthogonal transformations obtained by PM-SDP as sub-blocks. More specifically, each d × d block in the (i, j)-th position is the orthogonal transformation between shape i and shape j. In case the set of transformations is consistent (i.e., for each i, j, k, Rij · R jk = R ik ) , R is positive semidefinite and has rank d (for the definition of consistent maps and orthogonal transformations see[Singer and Wu, 2012;Huang et al., 2014;Nguyen et al., 2011]).In the spirit of this observation, we feed this matrix into a an iterative ICP-like algorithm that performs the following steps:1. Project R onto the set of consistent rank d matrices: Let U DU T be the eigen-decomposition of R, we take the largest d eigenvectors of U scaled by the square root of the corresponding eigenvalue, which we denote U d and project each of its d × d block to its closest orthogonal matrix. Denote the matrix with the new blocks as U d then the output of this step2. For each block of R solve for the best permutation Xij using linear programming as described in section 4 .3. For each permutation Xij solve for the best orthogonal transformation using the closed form solution mentioned above.4. Construct R from the matrices Rij.Iterate until convergence.Our experiments show that this algorithm reaches a steady state after a few iterations that take a few seconds for the problems in Subsection 6.3.\nSCAPE: shape completion and animation of people. D Anguelov, P Srinivasan, D Koller, S Thrun, J Rodgers, Davis , J , In ACM Transactions on Graphics. 24ACMAnguelov, D., Srinivasan, P., Koller, D., Thrun, S., Rodgers, J., and Davis, J. (2005). SCAPE: shape completion and animation of people. In ACM Transactions on Graphics (TOG), volume 24, pages 408-416. ACM.\n\nThe wave kernel signature: A quantum mechanical approach to shape analysis. M Aubry, U Schlickewei, D Cremers, Computer Vision Workshops (ICCV Workshops. 2011Aubry, M., Schlickewei, U., and Cremers, D. (2011). The wave ker- nel signature: A quantum mechanical approach to shape analy- sis. In Computer Vision Workshops (ICCV Workshops), 2011\n\nIEEE International Conference on. IEEEIEEE International Conference on, pages 1626-1633. IEEE.\n\nIsomorphism of graphs with bounded eigenvalue multiplicity. L Babai, D Y Grigoryev, D M Mount, Proceedings of the Fourteenth Annual ACM Symposium on Theory of Computing, STOC '82. the Fourteenth Annual ACM Symposium on Theory of Computing, STOC '82New York, NY, USAACMBabai, L., Grigoryev, D. Y., and Mount, D. M. (1982). Isomorphism of graphs with bounded eigenvalue multiplicity. In Proceedings of the Fourteenth Annual ACM Symposium on Theory of Com- puting, STOC '82, pages 310-324, New York, NY, USA. ACM.\n\nLaplacian eigenmaps for dimensionality reduction and data representation. M Belkin, P Niyogi, Neural computation. 156Belkin, M. and Niyogi, P. (2003). Laplacian eigenmaps for dimen- sionality reduction and data representation. Neural computation, 15(6):1373-1396.\n\nShape matching and object recognition using low distortion correspondences. A C Berg, T L Berg, Malik , J , Computer Vision and Pattern Recognition, 2005. CVPR 2005. IEEE Computer Society Conference on. IEEE1Berg, A. C., Berg, T. L., and Malik, J. (2005). Shape matching and object recognition using low distortion correspondences. In Computer Vision and Pattern Recognition, 2005. CVPR 2005. IEEE Computer Society Conference on, volume 1, pages 26-33. IEEE.\n\nA method for registration of 3-d shapes. P Besl, N Mckay, IEEE Transactions on Pattern Analysis and Machine Intelligence. 142Besl, P. and McKay, N. (1992). A method for registration of 3- d shapes. IEEE Transactions on Pattern Analysis and Machine Intelligence, 14(2):239-256.\n\nFAUST: Dataset and evaluation for 3D mesh registration. F Bogo, J Romero, M Loper, M J Black, Computer Vision and Pattern Recognition (CVPR), 2014 IEEE Conference on. IEEEBogo, F., Romero, J., Loper, M., and Black, M. J. (2014). FAUST: Dataset and evaluation for 3D mesh registration. In Computer Vision and Pattern Recognition (CVPR), 2014 IEEE Conference on, pages 3794-3801. IEEE.\n\n. D M Boyer, Y Lipman, E S Clair, J Puente, B A Patel, T Funkhouser, J Jernvall, I ; • H Daubechies, Maron, Al- 73:10Boyer, D. M., Lipman, Y., Clair, E. S., Puente, J., Patel, B. A., Funkhouser, T., Jernvall, J., and Daubechies, I. (2011). Al- 73:10 • H. Maron et al.\n\ngorithms to automatically quantify the geometric similarity of anatomical surfaces. Proceedings of the National Academy of Sciences. 354ACM Trans. Graph.ACM Trans. Graph., Vol. 35, No. 4, Article 73, Publication Date: July 2016 gorithms to automatically quantify the geometric similarity of anatomical surfaces. Proceedings of the National Academy of Sciences, 108(45):18221-18226.\n\nGeneralized multidimensional scaling: A framework for isometryinvariant partial surface matching. A M Bronstein, M M Bronstein, R Kimmel, Proceedings of the National Academy of Sciences of the United States of America. the National Academy of Sciences of the United States of America103Bronstein, A. M., Bronstein, M. M., and Kimmel, R. (2006). Gen- eralized multidimensional scaling: A framework for isometry- invariant partial surface matching. Proceedings of the Na- tional Academy of Sciences of the United States of America, 103(5):1168-1172.\n\nGlobal non-rigid alignment of 3-d scans. B J Brown, S Rusinkiewicz, ACM Transactions on Graphics (TOG). 26321Brown, B. J. and Rusinkiewicz, S. (2007). Global non-rigid align- ment of 3-d scans. ACM Transactions on Graphics (TOG), 26(3):21.\n\nRobust nonrigid registration by convex optimization. Q Chen, V Koltun, Proceedings of the IEEE International Conference on Computer Vision. the IEEE International Conference on Computer VisionChen, Q. and Koltun, V. (2015). Robust nonrigid registration by convex optimization. In Proceedings of the IEEE International Conference on Computer Vision, pages 2039-2047.\n\nExact recovery with symmetries for procrustes matching. N Dym, Y Lipman, Technical reportDym, N. and Lipman, Y. (2016). Exact recovery with symmetries for procrustes matching. Technical report.\n\nThe farthest point strategy for progressive image sampling. Image Processing. Y Eldar, M Lindenbaum, M Porat, Y Y Zeevi, IEEE Transactions on. 69Eldar, Y., Lindenbaum, M., Porat, M., and Zeevi, Y. Y. (1997). The farthest point strategy for progressive image sampling. Image Processing, IEEE Transactions on, 6(9):1305-1315.\n\nRandom sample consensus: a paradigm for model fitting with applications to image analysis and automated cartography. M A Fischler, R C Bolles, Communications of the ACM. 246Fischler, M. A. and Bolles, R. C. (1981). Random sample consen- sus: a paradigm for model fitting with applications to image anal- ysis and automated cartography. Communications of the ACM, 24(6):381-395.\n\nExploiting sparsity in semidefinite programming via matrix completion I: General framework. M Fukuda, M Kojima, K Murota, K Nakata, SIAM J. on Optimization. 113Fukuda, M., Kojima, M., Murota, K., and Nakata, K. (2000). Exploiting sparsity in semidefinite programming via matrix completion I: General framework. SIAM J. on Optimization, 11(3):647-674.\n\nRobust global registration. N Gelfand, N J Mitra, L J Guibas, H Pottmann, Proceedings of the Third Eurographics Symposium on Geometry Processing, SGP '05. the Third Eurographics Symposium on Geometry Processing, SGP '05Airela-Ville, Switzerland, SwitzerlandEurographics AssociationGelfand, N., Mitra, N. J., Guibas, L. J., and Pottmann, H. (2005). Robust global registration. In Proceedings of the Third Euro- graphics Symposium on Geometry Processing, SGP '05, Aire- la-Ville, Switzerland, Switzerland. Eurographics Association.\n\nShape retrieval contest 2007: Watertight models track. SHREC competition. D Giorgi, S Biasotti, L Paraboschi, 8Giorgi, D., Biasotti, S., and Paraboschi, L. (2007). Shape retrieval contest 2007: Watertight models track. SHREC competition, 8.\n\nJ C Gower, G B Dijksterhuis, Procrustes problems. rustes problemsOxfordOxford University Press3Gower, J. C. and Dijksterhuis, G. B. (2004). Procrustes problems, volume 3. Oxford University Press Oxford.\n\nPositive definite completions of partial Hermitian matrices. Linear algebra and its applications. R Grone, C R Johnson, E M Sá, H Wolkowicz, 58Grone, R., Johnson, C. R., Sá, E. M., and Wolkowicz, H. (1984). Positive definite completions of partial Hermitian matrices. Lin- ear algebra and its applications, 58:109-124.\n\nFunctional map networks for analyzing and exploring large shape collections. Q Huang, F Wang, L Guibas, ACM Trans. Graph. 33411Huang, Q., Wang, F., and Guibas, L. (2014). Functional map net- works for analyzing and exploring large shape collections. ACM Trans. Graph., 33(4):36:1-36:11.\n\nNon-Rigid Spectral Correspondence of Triangle Meshes. V Jain, H Zhang, O Van Kaick, International Journal of Shape Modeling. 13Jain, V., Zhang, H., and Van Kaick, O. (2007). Non-Rigid Spectral Correspondence of Triangle Meshes. International Journal of Shape Modeling, 13:101-124.\n\nShape manifolds, Procrustean metrics, and complex projective spaces. D G Kendall, Bulletin of the London Mathematical Society. 162Kendall, D. G. (1984). Shape manifolds, Procrustean metrics, and complex projective spaces. Bulletin of the London Mathematical Society, 16(2):81-121.\n\nTight relaxation of quadratic matching. I Kezurer, S Z Kovalsky, R Basri, Y Lipman, Computer Graphics Forum. 345Kezurer, I., Kovalsky, S. Z., Basri, R., and Lipman, Y. (2015). Tight relaxation of quadratic matching. Computer Graphics Forum, 34(5):115-128.\n\nBlended intrinsic maps. V G Kim, Y Lipman, T Funkhouser, ACM Transactions on Graphics. 3041Kim, V. G., Lipman, Y., and Funkhouser, T. (2011). Blended intrin- sic maps. ACM Transactions on Graphics, 30(4):1.\n\nA spectral technique for correspondence problems using pairwise constraints. M Leordeanu, M Hebert, Computer Vision, 2005. ICCV 2005. Tenth IEEE International Conference on. IEEE2Leordeanu, M. and Hebert, M. (2005). A spectral technique for cor- respondence problems using pairwise constraints. In Computer Vision, 2005. ICCV 2005. Tenth IEEE International Conference on, volume 2, pages 1482-1489. IEEE.\n\nGlobal correspondence optimization for non-rigid registration of depth scans. H Li, R W Sumner, Pauly , M , Computer Graphics Forum. Wiley Online Library27Li, H., Sumner, R. W., and Pauly, M. (2008). Global correspon- dence optimization for non-rigid registration of depth scans. In Computer Graphics Forum, volume 27, pages 1421-1430. Wiley Online Library.\n\nMöbius voting for surface correspondence. Y Lipman, T Funkhouser, In ACM Transactions on Graphics (TOG). 72ACMLipman, Y. and Funkhouser, T. (2009). Möbius voting for surface correspondence. In ACM Transactions on Graphics (TOG), vol- ume 28, page 72. ACM.\n\n. Z.-Q Luo, W.-K Ma, A M So, .-C Ye, Y Zhang, S , Luo, Z.-Q., Ma, W.-k., So, A. M.-C., Ye, Y., and Zhang, S. (2010).\n\nSemidefinite relaxation of quadratic optimization problems. Signal Processing Magazine. IEEE27Semidefinite relaxation of quadratic optimization problems. Sig- nal Processing Magazine, IEEE, 27(3):20-34.\n\nComparing point clouds. F Mémoli, G Sapiro, Proceedings of the 2004 Eurographics/ACM SIGGRAPH Symposium on Geometry Processing, SGP '04. the 2004 Eurographics/ACM SIGGRAPH Symposium on Geometry Processing, SGP '04New York, NY, USAACMMémoli, F. and Sapiro, G. (2004). Comparing point clouds. In Proceedings of the 2004 Eurographics/ACM SIGGRAPH Sym- posium on Geometry Processing, SGP '04, pages 32-40, New York, NY, USA. ACM.\n\nAdvances in geometric morphometrics. P Mitteroecker, P Gunz, Evolutionary Biology. 362Mitteroecker, P. and Gunz, P. (2009). Advances in geometric mor- phometrics. Evolutionary Biology, 36(2):235-247.\n\nThe MOSEK optimization toolbox for MATLAB manual. Mosek, 7Revision 49MOSEK (2015). The MOSEK optimization toolbox for MATLAB manual. Version 7.1 (Revision 49).\n\nAn optimization approach to improving collections of shape maps. A Nguyen, M Ben-Chen, K Welnicka, Y Ye, L Guibas, Computer Graphics Forum. 305Nguyen, A., Ben-Chen, M., Welnicka, K., Ye, Y., and Guibas, L. (2011). An optimization approach to improving collections of shape maps. Computer Graphics Forum, 30(5):1481-1491.\n\nFunctional maps: a flexible representation of maps between shapes. M Ovsjanikov, M Ben-Chen, J Solomon, A Butscher, L Guibas, ACM Transactions on Graphics (TOG). 31430Ovsjanikov, M., Ben-Chen, M., Solomon, J., Butscher, A., and Guibas, L. (2012). Functional maps: a flexible representation of maps between shapes. ACM Transactions on Graphics (TOG), 31(4):30.\n\nOne point isometric matching with the heat kernel. M Ovsjanikov, Q Mérigot, F Mémoli, L Guibas, Computer Graphics Forum. Wiley Online Library29Ovsjanikov, M., Mérigot, Q., Mémoli, F., and Guibas, L. (2010). One point isometric matching with the heat kernel. In Computer Graphics Forum, volume 29, pages 1555-1564. Wiley Online Library.\n\nGlobal intrinsic symmetries of shapes. M Ovsjanikov, J Sun, L Guibas, Computer Graphics Forum. Wiley Online Library27Ovsjanikov, M., Sun, J., and Guibas, L. (2008). Global intrinsic symmetries of shapes. In Computer Graphics Forum, volume 27, pages 1341-1348. Wiley Online Library.\n\nComputing discrete minimal surfaces and their conjugates. U Pinkall, K Polthier, Experimental mathematics. 21Pinkall, U. and Polthier, K. (1993). Computing discrete mini- mal surfaces and their conjugates. Experimental mathematics, 2(1):15-36.\n\nSparse modeling of intrinsic correspondences. J Pokrass, A M Bronstein, M M Bronstein, P Sprechmann, G Sapiro, Computer Graphics Forum. 322Pokrass, J., Bronstein, A. M., Bronstein, M. M., Sprechmann, P., and Sapiro, G. (2013). Sparse modeling of intrinsic correspon- dences. Computer Graphics Forum, 32(2 PART4):459-468.\n\nA recipe for semidefinite relaxation for (0, 1)-quadratic programming. S Poljak, F Rendl, H Wolkowicz, Journal of Global Optimization. 71Poljak, S., Rendl, F., and Wolkowicz, H. (1995). A recipe for semidefinite relaxation for (0, 1)-quadratic programming. Jour- nal of Global Optimization, 7(1):51-73.\n\nEfficient variants of the ICP algorithm. S Rusinkiewicz, M Levoy, Proceedings Third International Conference on 3-D Digital Imaging and Modeling. Third International Conference on 3-D Digital Imaging and ModelingRusinkiewicz, S. and Levoy, M. (2001). Efficient variants of the ICP algorithm. Proceedings Third International Conference on 3-D Digital Imaging and Modeling, pages 145-152.\n\nLaplace-Beltrami eigenfunctions for deformation invariant shape representation. R M Rustamov, Proceedings of the Fifth Eurographics Symposium on Geometry Processing, SGP '07. the Fifth Eurographics Symposium on Geometry Processing, SGP '07Aire-la-Ville, Switzerland, SwitzerlandEurographics AssociationRustamov, R. M. (2007). Laplace-Beltrami eigenfunctions for de- formation invariant shape representation. In Proceedings of the Fifth Eurographics Symposium on Geometry Processing, SGP '07, pages 225-233, Aire-la-Ville, Switzerland, Switzerland. Eu- rographics Association.\n\nJ Saunderson, P A Parrilo, A S Willsky, arXiv:1403.4914Semidefinite descriptions of the convex hull of rotation matrices. arXiv preprintSaunderson, J., Parrilo, P. A., and Willsky, A. S. (2014). Semidef- inite descriptions of the convex hull of rotation matrices. arXiv preprint arXiv:1403.4914.\n\n73:11 • Point Registration via Efficient Convex Relaxation. A Singer, H.-T Wu, Communications on Pure and Applied Mathematics. 658ArticleSinger, A. and Wu, H.-T. (2012). Vector diffusion maps and the connection laplacian. Communications on Pure and Applied Mathematics, 65(8):1067-1144. 73:11 • Point Registration via Efficient Convex Relaxation ACM Trans. Graph., Vol. 35, No. 4, Article 73, Publication Date: July 2016\n\nRegistration of 3D point clouds and meshes: a survey from rigid to nonrigid. Visualization and Computer Graphics. G K Tam, Z.-Q Cheng, Y.-K Lai, F C Langbein, Y Liu, D Marshall, R R Martin, X.-F Sun, P L Rosin, IEEE Transactions on. 197Tam, G. K., Cheng, Z.-Q., Lai, Y.-K., Langbein, F. C., Liu, Y., Marshall, D., Martin, R. R., Sun, X.-F., and Rosin, P. L. (2013). Registration of 3D point clouds and meshes: a survey from rigid to nonrigid. Visualization and Computer Graphics, IEEE Trans- actions on, 19(7):1199-1217.\n\nIsometric registration of ambiguous and partial data. A Tevs, M Bokeloh, M Wand, A Schilling, H.-P Seidel, Computer Vision and Pattern Recognition. IEEECVPR 2009. IEEE Conference onTevs, A., Bokeloh, M., Wand, M., Schilling, A., and Seidel, H.-P. (2009). Isometric registration of ambiguous and partial data. In Computer Vision and Pattern Recognition, 2009. CVPR 2009. IEEE Conference on, pages 1185-1192. IEEE.\n\nA survey on shape correspondence. O Van Kaick, H Zhang, G Hamarneh, D Cohen-Or, Computer Graphics Forum. Wiley Online Library30Van Kaick, O., Zhang, H., Hamarneh, G., and Cohen-Or, D. (2011). A survey on shape correspondence. In Computer Graphics Fo- rum, volume 30, pages 1681-1707. Wiley Online Library.\n\nSums of squares and semidefinite programming relaxations for polynomial optimization problems with structured sparsity. H Waki, S Kim, M Kojima, M Muramatsu, SIAM Journal on Optimization. 17Waki, H., Kim, S., Kojima, M., and Muramatsu, M. (2006). Sums of squares and semidefinite programming relaxations for poly- nomial optimization problems with structured sparsity. SIAM Journal on Optimization, 17:218-242.\n\nComputing correspondences in geometric data sets tutorial. M Wand, W Chang, H Li, N Mitra, M Pauly, S Rusinkiewicz, Wand, M., Chang, W., Li, H., Mitra, N., Pauly, M., and Rusinkiewicz, S. (2011). Computing correspondences in ge- ometric data sets tutorial. http://resources.mpi-inf.mpg.de/ deformableShapeMatching/EG2011 Tutorial/.\n\nL Wei, Q Huang, D Ceylan, E Vouga, Li , H , Dense Human Body Correspondences Using Convolutional Networks. Wei, L., Huang, Q., Ceylan, D., Vouga, E., and Li, H. (2015). Dense Human Body Correspondences Using Convolutional Networks.\n\nGo-ICP: Solving 3D Registration Efficiently and Globally Optimally. J Yang, H Li, Y Jia, IEEE International Conference on Computer Vision. Yang, J., Li, H., and Jia, Y. (2013). Go-ICP: Solving 3D Regis- tration Efficiently and Globally Optimally. 2013 IEEE Interna- tional Conference on Computer Vision, pages 1457-1464.\n\nDense non-rigid surface registration using high-order graph matching. Y Zeng, C Wang, Y Wang, X Gu, D Samaras, Paragios , N , Computer Vision and Pattern Recognition (CVPR), 2010 IEEE Conference on. IEEEZeng, Y., Wang, C., Wang, Y., Gu, X., Samaras, D., and Paragios, N. (2010). Dense non-rigid surface registration using high-order graph matching. In Computer Vision and Pattern Recognition (CVPR), 2010 IEEE Conference on, pages 382-389. IEEE.\n\n. Q Zhao, S E Karisch, F Rendl, H Wolkowicz, Zhao, Q., Karisch, S. E., Rendl, F., and Wolkowicz, H. (1998).\n\nSemidefinite programming relaxations for the quadratic assignment problem. Journal of Combinatorial Optimization. 21Semidefinite programming relaxations for the quadratic assign- ment problem. Journal of Combinatorial Optimization, 2(1):71- 109.\n\nThe stitched puppet: A graphical model of 3D human shape and pose. S Zuffi, M J Black, Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. the IEEE Conference on Computer Vision and Pattern RecognitionZuffi, S. and Black, M. J. (2015). The stitched puppet: A graphical model of 3D human shape and pose. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition, pages 3537-3546.\n\nCreate the matrix B using the matrices Bj: B = [B1. Create the matrix B using the matrices Bj: B = [B1, ..., B k ].\n\nProject B onto the set of rank one matrices using SVD, denote the projection as B. 2. Project B onto the set of rank one matrices using SVD, denote the projection as B.\n\nFactorize the projected rank-one matrix as an outer product of two vectors B = [ R][ X], and use these vectors as another two possible initializations of R and X. Factorize the projected rank-one matrix as an outer product of two vectors B = [ R][ X], and use these vectors as another two possible initializations of R and X.\n", "annotations": {"author": "[{\"end\":117,\"start\":88},{\"end\":124,\"start\":118},{\"end\":135,\"start\":125},{\"end\":147,\"start\":136},{\"end\":157,\"start\":148}]", "publisher": null, "author_last_name": "[{\"end\":116,\"start\":90},{\"end\":123,\"start\":120},{\"end\":134,\"start\":127},{\"end\":146,\"start\":138},{\"end\":156,\"start\":150}]", "author_first_name": "[{\"end\":89,\"start\":88},{\"end\":119,\"start\":118},{\"end\":126,\"start\":125},{\"end\":137,\"start\":136},{\"end\":149,\"start\":148}]", "author_affiliation": null, "title": "[{\"end\":52,\"start\":1},{\"end\":209,\"start\":158}]", "venue": "[{\"end\":227,\"start\":211}]", "abstract": "[{\"end\":2151,\"start\":402}]", "bib_ref": "[{\"attributes\":{\"ref_id\":\"b35\"},\"end\":3168,\"start\":3143},{\"attributes\":{\"ref_id\":\"b6\"},\"end\":3768,\"start\":3746},{\"attributes\":{\"ref_id\":\"b56\"},\"end\":3828,\"start\":3825},{\"attributes\":{\"ref_id\":\"b56\"},\"end\":3894,\"start\":3891},{\"attributes\":{\"ref_id\":\"b56\"},\"end\":4218,\"start\":4215},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":4505,\"start\":4485},{\"attributes\":{\"ref_id\":\"b35\"},\"end\":4667,\"start\":4642},{\"attributes\":{\"ref_id\":\"b39\"},\"end\":4688,\"start\":4667},{\"attributes\":{\"ref_id\":\"b56\"},\"end\":4960,\"start\":4957},{\"attributes\":{\"ref_id\":\"b24\"},\"end\":5232,\"start\":5210},{\"end\":5765,\"start\":5761},{\"end\":5769,\"start\":5765},{\"end\":5773,\"start\":5769},{\"end\":5777,\"start\":5773},{\"end\":5781,\"start\":5777},{\"end\":5785,\"start\":5781},{\"attributes\":{\"ref_id\":\"b0\"},\"end\":6918,\"start\":6895},{\"attributes\":{\"ref_id\":\"b7\"},\"end\":6964,\"start\":6945},{\"attributes\":{\"ref_id\":\"b45\"},\"end\":7270,\"start\":7252},{\"attributes\":{\"ref_id\":\"b41\"},\"end\":7409,\"start\":7380},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":7629,\"start\":7602},{\"attributes\":{\"ref_id\":\"b17\"},\"end\":8021,\"start\":7999},{\"attributes\":{\"ref_id\":\"b51\"},\"end\":8039,\"start\":8021},{\"attributes\":{\"ref_id\":\"b49\"},\"end\":8292,\"start\":8273},{\"attributes\":{\"ref_id\":\"b47\"},\"end\":8315,\"start\":8292},{\"attributes\":{\"ref_id\":\"b45\"},\"end\":8332,\"start\":8315},{\"attributes\":{\"ref_id\":\"b31\"},\"end\":8486,\"start\":8461},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":8509,\"start\":8486},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":8589,\"start\":8566},{\"attributes\":{\"ref_id\":\"b26\"},\"end\":8707,\"start\":8679},{\"attributes\":{\"ref_id\":\"b5\"},\"end\":8725,\"start\":8707},{\"attributes\":{\"ref_id\":\"b24\"},\"end\":8835,\"start\":8813},{\"attributes\":{\"ref_id\":\"b12\"},\"end\":8930,\"start\":8907},{\"attributes\":{\"ref_id\":\"b11\"},\"end\":9189,\"start\":9159},{\"attributes\":{\"ref_id\":\"b28\"},\"end\":9239,\"start\":9210},{\"attributes\":{\"ref_id\":\"b52\"},\"end\":9257,\"start\":9239},{\"attributes\":{\"ref_id\":\"b25\"},\"end\":9274,\"start\":9257},{\"attributes\":{\"ref_id\":\"b36\"},\"end\":9315,\"start\":9290},{\"attributes\":{\"ref_id\":\"b46\"},\"end\":9333,\"start\":9315},{\"attributes\":{\"ref_id\":\"b27\"},\"end\":9419,\"start\":9402},{\"attributes\":{\"ref_id\":\"b55\"},\"end\":9791,\"start\":9768},{\"attributes\":{\"ref_id\":\"b50\"},\"end\":9808,\"start\":9791},{\"attributes\":{\"ref_id\":\"b22\"},\"end\":10003,\"start\":9984},{\"attributes\":{\"ref_id\":\"b37\"},\"end\":10027,\"start\":10003},{\"attributes\":{\"ref_id\":\"b35\"},\"end\":10051,\"start\":10027},{\"attributes\":{\"ref_id\":\"b39\"},\"end\":10072,\"start\":10051},{\"attributes\":{\"ref_id\":\"b42\"},\"end\":10233,\"start\":10217},{\"attributes\":{\"ref_id\":\"b37\"},\"end\":10423,\"start\":10398},{\"attributes\":{\"ref_id\":\"b35\"},\"end\":10812,\"start\":10787},{\"attributes\":{\"ref_id\":\"b23\"},\"end\":10961,\"start\":10946},{\"attributes\":{\"ref_id\":\"b19\"},\"end\":11047,\"start\":11017},{\"attributes\":{\"ref_id\":\"b32\"},\"end\":11139,\"start\":11110},{\"attributes\":{\"ref_id\":\"b8\"},\"end\":11158,\"start\":11139},{\"attributes\":{\"ref_id\":\"b19\"},\"end\":11347,\"start\":11317},{\"attributes\":{\"ref_id\":\"b40\"},\"end\":11667,\"start\":11646},{\"attributes\":{\"ref_id\":\"b29\"},\"end\":11684,\"start\":11667},{\"attributes\":{\"ref_id\":\"b16\"},\"end\":12044,\"start\":12023},{\"attributes\":{\"ref_id\":\"b48\"},\"end\":12062,\"start\":12044},{\"attributes\":{\"ref_id\":\"b29\"},\"end\":13171,\"start\":13153},{\"attributes\":{\"ref_id\":\"b53\"},\"end\":14071,\"start\":14053},{\"attributes\":{\"ref_id\":\"b24\"},\"end\":14113,\"start\":14091},{\"attributes\":{\"ref_id\":\"b20\"},\"end\":17381,\"start\":17361},{\"attributes\":{\"ref_id\":\"b13\"},\"end\":22997,\"start\":22975},{\"attributes\":{\"ref_id\":\"b3\"},\"end\":23795,\"start\":23775},{\"attributes\":{\"ref_id\":\"b25\"},\"end\":29188,\"start\":29170},{\"attributes\":{\"ref_id\":\"b0\"},\"end\":30834,\"start\":30811},{\"attributes\":{\"ref_id\":\"b19\"},\"end\":31712,\"start\":31682},{\"attributes\":{\"ref_id\":\"b35\"},\"end\":34952,\"start\":34927},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":35270,\"start\":35250},{\"attributes\":{\"ref_id\":\"b25\"},\"end\":35349,\"start\":35331},{\"attributes\":{\"ref_id\":\"b38\"},\"end\":35520,\"start\":35492},{\"attributes\":{\"ref_id\":\"b35\"},\"end\":36202,\"start\":36177},{\"attributes\":{\"ref_id\":\"b39\"},\"end\":36223,\"start\":36202},{\"attributes\":{\"ref_id\":\"b35\"},\"end\":36358,\"start\":36333},{\"attributes\":{\"ref_id\":\"b0\"},\"end\":36635,\"start\":36612},{\"attributes\":{\"ref_id\":\"b33\"},\"end\":36974,\"start\":36961},{\"attributes\":{\"ref_id\":\"b0\"},\"end\":37453,\"start\":37430},{\"attributes\":{\"ref_id\":\"b25\"},\"end\":37648,\"start\":37630},{\"attributes\":{\"ref_id\":\"b35\"},\"end\":37789,\"start\":37764},{\"attributes\":{\"ref_id\":\"b7\"},\"end\":38186,\"start\":38167},{\"attributes\":{\"ref_id\":\"b12\"},\"end\":38377,\"start\":38354},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":38435,\"start\":38410},{\"attributes\":{\"ref_id\":\"b12\"},\"end\":39035,\"start\":39012},{\"attributes\":{\"ref_id\":\"b0\"},\"end\":40163,\"start\":40140},{\"attributes\":{\"ref_id\":\"b0\"},\"end\":40499,\"start\":40477},{\"attributes\":{\"ref_id\":\"b12\"},\"end\":40609,\"start\":40586},{\"attributes\":{\"ref_id\":\"b25\"},\"end\":40754,\"start\":40736},{\"attributes\":{\"ref_id\":\"b12\"},\"end\":40879,\"start\":40856},{\"attributes\":{\"ref_id\":\"b18\"},\"end\":41164,\"start\":41143},{\"attributes\":{\"ref_id\":\"b23\"},\"end\":41529,\"start\":41514},{\"attributes\":{\"ref_id\":\"b8\"},\"end\":41548,\"start\":41529},{\"attributes\":{\"ref_id\":\"b8\"},\"end\":41708,\"start\":41688},{\"attributes\":{\"ref_id\":\"b7\"},\"end\":41909,\"start\":41890},{\"attributes\":{\"ref_id\":\"b12\"},\"end\":41955,\"start\":41932},{\"attributes\":{\"ref_id\":\"b8\"},\"end\":42117,\"start\":42097},{\"attributes\":{\"ref_id\":\"b8\"},\"end\":42419,\"start\":42399},{\"attributes\":{\"ref_id\":\"b8\"},\"end\":42852,\"start\":42832},{\"attributes\":{\"ref_id\":\"b7\"},\"end\":44251,\"start\":44232},{\"attributes\":{\"ref_id\":\"b18\"},\"end\":44571,\"start\":44550},{\"attributes\":{\"ref_id\":\"b18\"},\"end\":45936,\"start\":45915},{\"attributes\":{\"ref_id\":\"b8\"},\"end\":47714,\"start\":47694},{\"attributes\":{\"ref_id\":\"b8\"},\"end\":47850,\"start\":47830},{\"attributes\":{\"ref_id\":\"b18\"},\"end\":48087,\"start\":48066},{\"attributes\":{\"ref_id\":\"b0\"},\"end\":49013,\"start\":48990}]", "figure": "[{\"attributes\":{\"id\":\"fig_0\"},\"end\":48859,\"start\":48307},{\"attributes\":{\"id\":\"fig_2\"},\"end\":48932,\"start\":48860},{\"attributes\":{\"id\":\"fig_3\"},\"end\":49164,\"start\":48933},{\"attributes\":{\"id\":\"fig_4\"},\"end\":49253,\"start\":49165},{\"attributes\":{\"id\":\"fig_5\"},\"end\":49487,\"start\":49254},{\"attributes\":{\"id\":\"tab_2\",\"type\":\"table\"},\"end\":49940,\"start\":49488}]", "paragraph": "[{\"end\":2356,\"start\":2167},{\"end\":2763,\"start\":2358},{\"end\":3255,\"start\":2829},{\"end\":3710,\"start\":3257},{\"end\":4050,\"start\":3712},{\"end\":4893,\"start\":4052},{\"end\":5653,\"start\":4895},{\"end\":6054,\"start\":5655},{\"end\":6722,\"start\":6056},{\"end\":7058,\"start\":6724},{\"end\":7271,\"start\":7076},{\"end\":7831,\"start\":7273},{\"end\":8132,\"start\":7833},{\"end\":9022,\"start\":8134},{\"end\":9849,\"start\":9024},{\"end\":10813,\"start\":9851},{\"end\":11520,\"start\":10815},{\"end\":12495,\"start\":11522},{\"end\":12853,\"start\":12524},{\"end\":12954,\"start\":12855},{\"end\":13096,\"start\":13048},{\"end\":13486,\"start\":13098},{\"end\":13961,\"start\":13616},{\"end\":14445,\"start\":13978},{\"end\":14704,\"start\":14475},{\"end\":15247,\"start\":14706},{\"end\":15441,\"start\":15274},{\"end\":16006,\"start\":15443},{\"end\":16664,\"start\":16008},{\"end\":17315,\"start\":16666},{\"end\":17657,\"start\":17317},{\"end\":17980,\"start\":17681},{\"end\":18422,\"start\":18088},{\"end\":18705,\"start\":18424},{\"end\":19020,\"start\":18707},{\"end\":19292,\"start\":19022},{\"end\":19487,\"start\":19362},{\"end\":19678,\"start\":19528},{\"end\":19958,\"start\":19729},{\"end\":20240,\"start\":20055},{\"end\":20443,\"start\":20406},{\"end\":20656,\"start\":20457},{\"end\":21551,\"start\":20658},{\"end\":22049,\"start\":21553},{\"end\":22145,\"start\":22051},{\"end\":22488,\"start\":22147},{\"end\":22641,\"start\":22505},{\"end\":22769,\"start\":22657},{\"end\":22886,\"start\":22771},{\"end\":22998,\"start\":22888},{\"end\":23796,\"start\":23000},{\"end\":24796,\"start\":23798},{\"end\":25682,\"start\":24798},{\"end\":26369,\"start\":25684},{\"end\":27139,\"start\":26371},{\"end\":27593,\"start\":27141},{\"end\":27678,\"start\":27620},{\"end\":28124,\"start\":27680},{\"end\":28480,\"start\":28126},{\"end\":29007,\"start\":28482},{\"end\":29526,\"start\":29009},{\"end\":30085,\"start\":29528},{\"end\":31092,\"start\":30087},{\"end\":32024,\"start\":31094},{\"end\":32370,\"start\":32026},{\"end\":32791,\"start\":32385},{\"end\":33968,\"start\":32793},{\"end\":34205,\"start\":33970},{\"end\":34789,\"start\":34207},{\"end\":35545,\"start\":34824},{\"end\":35701,\"start\":35574},{\"end\":36497,\"start\":35703},{\"end\":38053,\"start\":36516},{\"end\":40314,\"start\":38055},{\"end\":41041,\"start\":40405},{\"end\":41327,\"start\":41062},{\"end\":42005,\"start\":41357},{\"end\":42344,\"start\":42007},{\"end\":43010,\"start\":42346},{\"end\":44103,\"start\":43041},{\"end\":44334,\"start\":44105},{\"end\":44809,\"start\":44336},{\"end\":45998,\"start\":44821},{\"end\":46506,\"start\":46014},{\"end\":47042,\"start\":46523},{\"end\":48306,\"start\":47044}]", "formula": "[{\"attributes\":{\"id\":\"formula_0\"},\"end\":2828,\"start\":2764},{\"attributes\":{\"id\":\"formula_1\"},\"end\":13047,\"start\":12955},{\"attributes\":{\"id\":\"formula_2\"},\"end\":13615,\"start\":13487},{\"attributes\":{\"id\":\"formula_3\"},\"end\":13977,\"start\":13962},{\"attributes\":{\"id\":\"formula_4\"},\"end\":15273,\"start\":15248},{\"attributes\":{\"id\":\"formula_5\"},\"end\":18087,\"start\":17981},{\"attributes\":{\"id\":\"formula_6\"},\"end\":19361,\"start\":19293},{\"attributes\":{\"id\":\"formula_7\"},\"end\":19527,\"start\":19488},{\"attributes\":{\"id\":\"formula_8\"},\"end\":19728,\"start\":19679},{\"attributes\":{\"id\":\"formula_9\"},\"end\":20023,\"start\":19959},{\"attributes\":{\"id\":\"formula_10\"},\"end\":20054,\"start\":20023},{\"attributes\":{\"id\":\"formula_11\"},\"end\":20405,\"start\":20241},{\"attributes\":{\"id\":\"formula_12\"},\"end\":35573,\"start\":35546}]", "table_ref": "[{\"end\":42659,\"start\":42652},{\"end\":47589,\"start\":47582}]", "section_header": "[{\"attributes\":{\"n\":\"1\"},\"end\":2165,\"start\":2153},{\"attributes\":{\"n\":\"2\"},\"end\":7074,\"start\":7061},{\"attributes\":{\"n\":\"3\"},\"end\":12522,\"start\":12498},{\"end\":14473,\"start\":14448},{\"end\":17679,\"start\":17660},{\"end\":20455,\"start\":20446},{\"attributes\":{\"n\":\"2.\"},\"end\":22503,\"start\":22491},{\"attributes\":{\"n\":\"3.\"},\"end\":22655,\"start\":22644},{\"attributes\":{\"n\":\"4\"},\"end\":27618,\"start\":27596},{\"attributes\":{\"n\":\"5\"},\"end\":32383,\"start\":32373},{\"attributes\":{\"n\":\"6\"},\"end\":34804,\"start\":34792},{\"attributes\":{\"n\":\"6.1\"},\"end\":34822,\"start\":34807},{\"end\":36514,\"start\":36500},{\"end\":40374,\"start\":40317},{\"end\":40403,\"start\":40377},{\"end\":41060,\"start\":41044},{\"attributes\":{\"n\":\"6.2\"},\"end\":41355,\"start\":41330},{\"attributes\":{\"n\":\"6.3\"},\"end\":43039,\"start\":43013},{\"end\":44819,\"start\":44812},{\"attributes\":{\"n\":\"7\"},\"end\":46012,\"start\":46001},{\"end\":46521,\"start\":46509},{\"end\":48318,\"start\":48308},{\"end\":48871,\"start\":48861},{\"end\":48945,\"start\":48934},{\"end\":49177,\"start\":49166},{\"end\":49266,\"start\":49255}]", "table": "[{\"end\":49940,\"start\":49622}]", "figure_caption": "[{\"end\":48859,\"start\":48320},{\"end\":48932,\"start\":48873},{\"end\":49164,\"start\":48948},{\"end\":49253,\"start\":49180},{\"end\":49487,\"start\":49269},{\"end\":49622,\"start\":49490}]", "figure_ref": "[{\"end\":4168,\"start\":4160},{\"end\":5868,\"start\":5860},{\"end\":20949,\"start\":20941},{\"end\":21356,\"start\":21348},{\"end\":30321,\"start\":30313},{\"end\":30657,\"start\":30649},{\"end\":31725,\"start\":31717},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":32804,\"start\":32796},{\"end\":33645,\"start\":33637},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":34281,\"start\":34273},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":35924,\"start\":35916},{\"end\":36072,\"start\":36064},{\"end\":37358,\"start\":37350},{\"end\":37498,\"start\":37490},{\"end\":37992,\"start\":37984},{\"attributes\":{\"ref_id\":\"fig_2\"},\"end\":38969,\"start\":38961},{\"end\":39977,\"start\":39969},{\"end\":40071,\"start\":40063},{\"attributes\":{\"ref_id\":\"fig_3\"},\"end\":40765,\"start\":40756},{\"attributes\":{\"ref_id\":\"fig_4\"},\"end\":41250,\"start\":41241},{\"end\":42954,\"start\":42945},{\"end\":44163,\"start\":44155},{\"end\":44364,\"start\":44355},{\"attributes\":{\"ref_id\":\"fig_5\"},\"end\":44952,\"start\":44943},{\"end\":47744,\"start\":47735},{\"end\":47932,\"start\":47923}]", "bib_author_first_name": "[{\"end\":53023,\"start\":53022},{\"end\":53035,\"start\":53034},{\"end\":53049,\"start\":53048},{\"end\":53059,\"start\":53058},{\"end\":53068,\"start\":53067},{\"end\":53083,\"start\":53078},{\"end\":53087,\"start\":53086},{\"end\":53413,\"start\":53412},{\"end\":53422,\"start\":53421},{\"end\":53437,\"start\":53436},{\"end\":53836,\"start\":53835},{\"end\":53845,\"start\":53844},{\"end\":53847,\"start\":53846},{\"end\":53860,\"start\":53859},{\"end\":53862,\"start\":53861},{\"end\":54362,\"start\":54361},{\"end\":54372,\"start\":54371},{\"end\":54629,\"start\":54628},{\"end\":54631,\"start\":54630},{\"end\":54639,\"start\":54638},{\"end\":54641,\"start\":54640},{\"end\":54653,\"start\":54648},{\"end\":54657,\"start\":54656},{\"end\":55054,\"start\":55053},{\"end\":55062,\"start\":55061},{\"end\":55347,\"start\":55346},{\"end\":55355,\"start\":55354},{\"end\":55365,\"start\":55364},{\"end\":55374,\"start\":55373},{\"end\":55376,\"start\":55375},{\"end\":55678,\"start\":55677},{\"end\":55680,\"start\":55679},{\"end\":55689,\"start\":55688},{\"end\":55699,\"start\":55698},{\"end\":55701,\"start\":55700},{\"end\":55710,\"start\":55709},{\"end\":55720,\"start\":55719},{\"end\":55722,\"start\":55721},{\"end\":55731,\"start\":55730},{\"end\":55745,\"start\":55744},{\"end\":55757,\"start\":55756},{\"end\":55763,\"start\":55758},{\"end\":56426,\"start\":56425},{\"end\":56428,\"start\":56427},{\"end\":56441,\"start\":56440},{\"end\":56443,\"start\":56442},{\"end\":56456,\"start\":56455},{\"end\":56918,\"start\":56917},{\"end\":56920,\"start\":56919},{\"end\":56929,\"start\":56928},{\"end\":57171,\"start\":57170},{\"end\":57179,\"start\":57178},{\"end\":57541,\"start\":57540},{\"end\":57548,\"start\":57547},{\"end\":57758,\"start\":57757},{\"end\":57767,\"start\":57766},{\"end\":57781,\"start\":57780},{\"end\":57790,\"start\":57789},{\"end\":57792,\"start\":57791},{\"end\":58122,\"start\":58121},{\"end\":58124,\"start\":58123},{\"end\":58136,\"start\":58135},{\"end\":58138,\"start\":58137},{\"end\":58476,\"start\":58475},{\"end\":58486,\"start\":58485},{\"end\":58496,\"start\":58495},{\"end\":58506,\"start\":58505},{\"end\":58764,\"start\":58763},{\"end\":58775,\"start\":58774},{\"end\":58777,\"start\":58776},{\"end\":58786,\"start\":58785},{\"end\":58788,\"start\":58787},{\"end\":58798,\"start\":58797},{\"end\":59341,\"start\":59340},{\"end\":59351,\"start\":59350},{\"end\":59363,\"start\":59362},{\"end\":59509,\"start\":59508},{\"end\":59511,\"start\":59510},{\"end\":59520,\"start\":59519},{\"end\":59522,\"start\":59521},{\"end\":59811,\"start\":59810},{\"end\":59820,\"start\":59819},{\"end\":59822,\"start\":59821},{\"end\":59833,\"start\":59832},{\"end\":59835,\"start\":59834},{\"end\":59841,\"start\":59840},{\"end\":60110,\"start\":60109},{\"end\":60119,\"start\":60118},{\"end\":60127,\"start\":60126},{\"end\":60375,\"start\":60374},{\"end\":60383,\"start\":60382},{\"end\":60392,\"start\":60391},{\"end\":60672,\"start\":60671},{\"end\":60674,\"start\":60673},{\"end\":60925,\"start\":60924},{\"end\":60936,\"start\":60935},{\"end\":60938,\"start\":60937},{\"end\":60950,\"start\":60949},{\"end\":60959,\"start\":60958},{\"end\":61166,\"start\":61165},{\"end\":61168,\"start\":61167},{\"end\":61175,\"start\":61174},{\"end\":61185,\"start\":61184},{\"end\":61427,\"start\":61426},{\"end\":61440,\"start\":61439},{\"end\":61834,\"start\":61833},{\"end\":61840,\"start\":61839},{\"end\":61842,\"start\":61841},{\"end\":61856,\"start\":61851},{\"end\":61860,\"start\":61859},{\"end\":62157,\"start\":62156},{\"end\":62167,\"start\":62166},{\"end\":62377,\"start\":62373},{\"end\":62387,\"start\":62383},{\"end\":62393,\"start\":62392},{\"end\":62395,\"start\":62394},{\"end\":62403,\"start\":62400},{\"end\":62409,\"start\":62408},{\"end\":62418,\"start\":62417},{\"end\":62718,\"start\":62717},{\"end\":62728,\"start\":62727},{\"end\":63158,\"start\":63157},{\"end\":63174,\"start\":63173},{\"end\":63548,\"start\":63547},{\"end\":63558,\"start\":63557},{\"end\":63570,\"start\":63569},{\"end\":63582,\"start\":63581},{\"end\":63588,\"start\":63587},{\"end\":63872,\"start\":63871},{\"end\":63886,\"start\":63885},{\"end\":63898,\"start\":63897},{\"end\":63909,\"start\":63908},{\"end\":63921,\"start\":63920},{\"end\":64217,\"start\":64216},{\"end\":64231,\"start\":64230},{\"end\":64242,\"start\":64241},{\"end\":64252,\"start\":64251},{\"end\":64542,\"start\":64541},{\"end\":64556,\"start\":64555},{\"end\":64563,\"start\":64562},{\"end\":64844,\"start\":64843},{\"end\":64855,\"start\":64854},{\"end\":65077,\"start\":65076},{\"end\":65088,\"start\":65087},{\"end\":65090,\"start\":65089},{\"end\":65103,\"start\":65102},{\"end\":65105,\"start\":65104},{\"end\":65118,\"start\":65117},{\"end\":65132,\"start\":65131},{\"end\":65424,\"start\":65423},{\"end\":65434,\"start\":65433},{\"end\":65443,\"start\":65442},{\"end\":65698,\"start\":65697},{\"end\":65714,\"start\":65713},{\"end\":66125,\"start\":66124},{\"end\":66127,\"start\":66126},{\"end\":66622,\"start\":66621},{\"end\":66636,\"start\":66635},{\"end\":66638,\"start\":66637},{\"end\":66649,\"start\":66648},{\"end\":66651,\"start\":66650},{\"end\":66979,\"start\":66978},{\"end\":66992,\"start\":66988},{\"end\":67455,\"start\":67454},{\"end\":67457,\"start\":67456},{\"end\":67467,\"start\":67463},{\"end\":67479,\"start\":67475},{\"end\":67486,\"start\":67485},{\"end\":67488,\"start\":67487},{\"end\":67500,\"start\":67499},{\"end\":67507,\"start\":67506},{\"end\":67519,\"start\":67518},{\"end\":67521,\"start\":67520},{\"end\":67534,\"start\":67530},{\"end\":67541,\"start\":67540},{\"end\":67543,\"start\":67542},{\"end\":67917,\"start\":67916},{\"end\":67925,\"start\":67924},{\"end\":67936,\"start\":67935},{\"end\":67944,\"start\":67943},{\"end\":67960,\"start\":67956},{\"end\":68311,\"start\":68310},{\"end\":68324,\"start\":68323},{\"end\":68333,\"start\":68332},{\"end\":68345,\"start\":68344},{\"end\":68704,\"start\":68703},{\"end\":68712,\"start\":68711},{\"end\":68719,\"start\":68718},{\"end\":68729,\"start\":68728},{\"end\":69055,\"start\":69054},{\"end\":69063,\"start\":69062},{\"end\":69072,\"start\":69071},{\"end\":69078,\"start\":69077},{\"end\":69087,\"start\":69086},{\"end\":69096,\"start\":69095},{\"end\":69329,\"start\":69328},{\"end\":69336,\"start\":69335},{\"end\":69345,\"start\":69344},{\"end\":69355,\"start\":69354},{\"end\":69365,\"start\":69363},{\"end\":69369,\"start\":69368},{\"end\":69630,\"start\":69629},{\"end\":69638,\"start\":69637},{\"end\":69644,\"start\":69643},{\"end\":69954,\"start\":69953},{\"end\":69962,\"start\":69961},{\"end\":69970,\"start\":69969},{\"end\":69978,\"start\":69977},{\"end\":69984,\"start\":69983},{\"end\":70002,\"start\":69994},{\"end\":70006,\"start\":70005},{\"end\":70333,\"start\":70332},{\"end\":70341,\"start\":70340},{\"end\":70343,\"start\":70342},{\"end\":70354,\"start\":70353},{\"end\":70363,\"start\":70362},{\"end\":70754,\"start\":70753},{\"end\":70763,\"start\":70762},{\"end\":70765,\"start\":70764}]", "bib_author_last_name": "[{\"end\":53032,\"start\":53024},{\"end\":53046,\"start\":53036},{\"end\":53056,\"start\":53050},{\"end\":53065,\"start\":53060},{\"end\":53076,\"start\":53069},{\"end\":53419,\"start\":53414},{\"end\":53434,\"start\":53423},{\"end\":53445,\"start\":53438},{\"end\":53842,\"start\":53837},{\"end\":53857,\"start\":53848},{\"end\":53868,\"start\":53863},{\"end\":54369,\"start\":54363},{\"end\":54379,\"start\":54373},{\"end\":54636,\"start\":54632},{\"end\":54646,\"start\":54642},{\"end\":55059,\"start\":55055},{\"end\":55068,\"start\":55063},{\"end\":55352,\"start\":55348},{\"end\":55362,\"start\":55356},{\"end\":55371,\"start\":55366},{\"end\":55382,\"start\":55377},{\"end\":55686,\"start\":55681},{\"end\":55696,\"start\":55690},{\"end\":55707,\"start\":55702},{\"end\":55717,\"start\":55711},{\"end\":55728,\"start\":55723},{\"end\":55742,\"start\":55732},{\"end\":55754,\"start\":55746},{\"end\":55774,\"start\":55764},{\"end\":55781,\"start\":55776},{\"end\":56438,\"start\":56429},{\"end\":56453,\"start\":56444},{\"end\":56463,\"start\":56457},{\"end\":56926,\"start\":56921},{\"end\":56942,\"start\":56930},{\"end\":57176,\"start\":57172},{\"end\":57186,\"start\":57180},{\"end\":57545,\"start\":57542},{\"end\":57555,\"start\":57549},{\"end\":57764,\"start\":57759},{\"end\":57778,\"start\":57768},{\"end\":57787,\"start\":57782},{\"end\":57798,\"start\":57793},{\"end\":58133,\"start\":58125},{\"end\":58145,\"start\":58139},{\"end\":58483,\"start\":58477},{\"end\":58493,\"start\":58487},{\"end\":58503,\"start\":58497},{\"end\":58513,\"start\":58507},{\"end\":58772,\"start\":58765},{\"end\":58783,\"start\":58778},{\"end\":58795,\"start\":58789},{\"end\":58807,\"start\":58799},{\"end\":59348,\"start\":59342},{\"end\":59360,\"start\":59352},{\"end\":59374,\"start\":59364},{\"end\":59517,\"start\":59512},{\"end\":59535,\"start\":59523},{\"end\":59817,\"start\":59812},{\"end\":59830,\"start\":59823},{\"end\":59838,\"start\":59836},{\"end\":59851,\"start\":59842},{\"end\":60116,\"start\":60111},{\"end\":60124,\"start\":60120},{\"end\":60134,\"start\":60128},{\"end\":60380,\"start\":60376},{\"end\":60389,\"start\":60384},{\"end\":60402,\"start\":60393},{\"end\":60682,\"start\":60675},{\"end\":60933,\"start\":60926},{\"end\":60947,\"start\":60939},{\"end\":60956,\"start\":60951},{\"end\":60966,\"start\":60960},{\"end\":61172,\"start\":61169},{\"end\":61182,\"start\":61176},{\"end\":61196,\"start\":61186},{\"end\":61437,\"start\":61428},{\"end\":61447,\"start\":61441},{\"end\":61837,\"start\":61835},{\"end\":61849,\"start\":61843},{\"end\":62164,\"start\":62158},{\"end\":62178,\"start\":62168},{\"end\":62381,\"start\":62378},{\"end\":62390,\"start\":62388},{\"end\":62398,\"start\":62396},{\"end\":62406,\"start\":62404},{\"end\":62415,\"start\":62410},{\"end\":62725,\"start\":62719},{\"end\":62735,\"start\":62729},{\"end\":63171,\"start\":63159},{\"end\":63179,\"start\":63175},{\"end\":63376,\"start\":63371},{\"end\":63555,\"start\":63549},{\"end\":63567,\"start\":63559},{\"end\":63579,\"start\":63571},{\"end\":63585,\"start\":63583},{\"end\":63595,\"start\":63589},{\"end\":63883,\"start\":63873},{\"end\":63895,\"start\":63887},{\"end\":63906,\"start\":63899},{\"end\":63918,\"start\":63910},{\"end\":63928,\"start\":63922},{\"end\":64228,\"start\":64218},{\"end\":64239,\"start\":64232},{\"end\":64249,\"start\":64243},{\"end\":64259,\"start\":64253},{\"end\":64553,\"start\":64543},{\"end\":64560,\"start\":64557},{\"end\":64570,\"start\":64564},{\"end\":64852,\"start\":64845},{\"end\":64864,\"start\":64856},{\"end\":65085,\"start\":65078},{\"end\":65100,\"start\":65091},{\"end\":65115,\"start\":65106},{\"end\":65129,\"start\":65119},{\"end\":65139,\"start\":65133},{\"end\":65431,\"start\":65425},{\"end\":65440,\"start\":65435},{\"end\":65453,\"start\":65444},{\"end\":65711,\"start\":65699},{\"end\":65720,\"start\":65715},{\"end\":66136,\"start\":66128},{\"end\":66633,\"start\":66623},{\"end\":66646,\"start\":66639},{\"end\":66659,\"start\":66652},{\"end\":66986,\"start\":66980},{\"end\":66995,\"start\":66993},{\"end\":67461,\"start\":67458},{\"end\":67473,\"start\":67468},{\"end\":67483,\"start\":67480},{\"end\":67497,\"start\":67489},{\"end\":67504,\"start\":67501},{\"end\":67516,\"start\":67508},{\"end\":67528,\"start\":67522},{\"end\":67538,\"start\":67535},{\"end\":67549,\"start\":67544},{\"end\":67922,\"start\":67918},{\"end\":67933,\"start\":67926},{\"end\":67941,\"start\":67937},{\"end\":67954,\"start\":67945},{\"end\":67967,\"start\":67961},{\"end\":68321,\"start\":68312},{\"end\":68330,\"start\":68325},{\"end\":68342,\"start\":68334},{\"end\":68354,\"start\":68346},{\"end\":68709,\"start\":68705},{\"end\":68716,\"start\":68713},{\"end\":68726,\"start\":68720},{\"end\":68739,\"start\":68730},{\"end\":69060,\"start\":69056},{\"end\":69069,\"start\":69064},{\"end\":69075,\"start\":69073},{\"end\":69084,\"start\":69079},{\"end\":69093,\"start\":69088},{\"end\":69109,\"start\":69097},{\"end\":69333,\"start\":69330},{\"end\":69342,\"start\":69337},{\"end\":69352,\"start\":69346},{\"end\":69361,\"start\":69356},{\"end\":69635,\"start\":69631},{\"end\":69641,\"start\":69639},{\"end\":69648,\"start\":69645},{\"end\":69959,\"start\":69955},{\"end\":69967,\"start\":69963},{\"end\":69975,\"start\":69971},{\"end\":69981,\"start\":69979},{\"end\":69992,\"start\":69985},{\"end\":70338,\"start\":70334},{\"end\":70351,\"start\":70344},{\"end\":70360,\"start\":70355},{\"end\":70373,\"start\":70364},{\"end\":70760,\"start\":70755},{\"end\":70771,\"start\":70766}]", "bib_entry": "[{\"attributes\":{\"id\":\"b0\",\"matched_paper_id\":3423879},\"end\":53334,\"start\":52973},{\"attributes\":{\"id\":\"b1\",\"matched_paper_id\":17847588},\"end\":53677,\"start\":53336},{\"attributes\":{\"id\":\"b2\"},\"end\":53773,\"start\":53679},{\"attributes\":{\"id\":\"b3\",\"matched_paper_id\":12837287},\"end\":54285,\"start\":53775},{\"attributes\":{\"id\":\"b4\",\"matched_paper_id\":14879317},\"end\":54550,\"start\":54287},{\"attributes\":{\"id\":\"b5\",\"matched_paper_id\":6055435},\"end\":55010,\"start\":54552},{\"attributes\":{\"id\":\"b6\",\"matched_paper_id\":21874346},\"end\":55288,\"start\":55012},{\"attributes\":{\"id\":\"b7\",\"matched_paper_id\":206592437},\"end\":55673,\"start\":55290},{\"attributes\":{\"doi\":\"Al- 73:10\",\"id\":\"b8\"},\"end\":55942,\"start\":55675},{\"attributes\":{\"id\":\"b9\",\"matched_paper_id\":3040582},\"end\":56325,\"start\":55944},{\"attributes\":{\"id\":\"b10\",\"matched_paper_id\":17892715},\"end\":56874,\"start\":56327},{\"attributes\":{\"id\":\"b11\",\"matched_paper_id\":13940692},\"end\":57115,\"start\":56876},{\"attributes\":{\"id\":\"b12\",\"matched_paper_id\":8327112},\"end\":57482,\"start\":57117},{\"attributes\":{\"id\":\"b13\"},\"end\":57677,\"start\":57484},{\"attributes\":{\"id\":\"b14\",\"matched_paper_id\":10015453},\"end\":58002,\"start\":57679},{\"attributes\":{\"id\":\"b15\",\"matched_paper_id\":972888},\"end\":58381,\"start\":58004},{\"attributes\":{\"id\":\"b16\",\"matched_paper_id\":14258139},\"end\":58733,\"start\":58383},{\"attributes\":{\"id\":\"b17\",\"matched_paper_id\":9789536},\"end\":59264,\"start\":58735},{\"attributes\":{\"id\":\"b18\"},\"end\":59506,\"start\":59266},{\"attributes\":{\"id\":\"b19\"},\"end\":59710,\"start\":59508},{\"attributes\":{\"id\":\"b20\"},\"end\":60030,\"start\":59712},{\"attributes\":{\"id\":\"b21\",\"matched_paper_id\":2217502},\"end\":60318,\"start\":60032},{\"attributes\":{\"id\":\"b22\",\"matched_paper_id\":8320882},\"end\":60600,\"start\":60320},{\"attributes\":{\"id\":\"b23\",\"matched_paper_id\":50702498},\"end\":60882,\"start\":60602},{\"attributes\":{\"id\":\"b24\",\"matched_paper_id\":18694610},\"end\":61139,\"start\":60884},{\"attributes\":{\"id\":\"b25\",\"matched_paper_id\":9655213},\"end\":61347,\"start\":61141},{\"attributes\":{\"id\":\"b26\",\"matched_paper_id\":13535815},\"end\":61753,\"start\":61349},{\"attributes\":{\"id\":\"b27\",\"matched_paper_id\":17982667},\"end\":62112,\"start\":61755},{\"attributes\":{\"id\":\"b28\",\"matched_paper_id\":6001942},\"end\":62369,\"start\":62114},{\"attributes\":{\"id\":\"b29\"},\"end\":62487,\"start\":62371},{\"attributes\":{\"id\":\"b30\"},\"end\":62691,\"start\":62489},{\"attributes\":{\"id\":\"b31\",\"matched_paper_id\":207156533},\"end\":63118,\"start\":62693},{\"attributes\":{\"id\":\"b32\",\"matched_paper_id\":16391039},\"end\":63319,\"start\":63120},{\"attributes\":{\"id\":\"b33\"},\"end\":63480,\"start\":63321},{\"attributes\":{\"id\":\"b34\",\"matched_paper_id\":5542409},\"end\":63802,\"start\":63482},{\"attributes\":{\"id\":\"b35\"},\"end\":64163,\"start\":63804},{\"attributes\":{\"id\":\"b36\",\"matched_paper_id\":256282},\"end\":64500,\"start\":64165},{\"attributes\":{\"id\":\"b37\",\"matched_paper_id\":18103178},\"end\":64783,\"start\":64502},{\"attributes\":{\"id\":\"b38\",\"matched_paper_id\":10068306},\"end\":65028,\"start\":64785},{\"attributes\":{\"id\":\"b39\",\"matched_paper_id\":487290},\"end\":65350,\"start\":65030},{\"attributes\":{\"id\":\"b40\",\"matched_paper_id\":12579692},\"end\":65654,\"start\":65352},{\"attributes\":{\"id\":\"b41\",\"matched_paper_id\":11663609},\"end\":66042,\"start\":65656},{\"attributes\":{\"id\":\"b42\",\"matched_paper_id\":16217354},\"end\":66619,\"start\":66044},{\"attributes\":{\"doi\":\"arXiv:1403.4914\",\"id\":\"b43\"},\"end\":66916,\"start\":66621},{\"attributes\":{\"id\":\"b44\",\"matched_paper_id\":17525937},\"end\":67338,\"start\":66918},{\"attributes\":{\"id\":\"b45\",\"matched_paper_id\":1482463},\"end\":67860,\"start\":67340},{\"attributes\":{\"id\":\"b46\",\"matched_paper_id\":15366827},\"end\":68274,\"start\":67862},{\"attributes\":{\"id\":\"b47\",\"matched_paper_id\":6068875},\"end\":68581,\"start\":68276},{\"attributes\":{\"id\":\"b48\",\"matched_paper_id\":15855218},\"end\":68993,\"start\":68583},{\"attributes\":{\"id\":\"b49\"},\"end\":69326,\"start\":68995},{\"attributes\":{\"id\":\"b50\"},\"end\":69559,\"start\":69328},{\"attributes\":{\"id\":\"b51\",\"matched_paper_id\":7421244},\"end\":69881,\"start\":69561},{\"attributes\":{\"id\":\"b52\",\"matched_paper_id\":5793282},\"end\":70328,\"start\":69883},{\"attributes\":{\"id\":\"b53\"},\"end\":70437,\"start\":70330},{\"attributes\":{\"id\":\"b54\",\"matched_paper_id\":97982},\"end\":70684,\"start\":70439},{\"attributes\":{\"id\":\"b55\",\"matched_paper_id\":5758477},\"end\":71114,\"start\":70686},{\"attributes\":{\"id\":\"b56\"},\"end\":71231,\"start\":71116},{\"attributes\":{\"id\":\"b57\"},\"end\":71401,\"start\":71233},{\"attributes\":{\"id\":\"b58\"},\"end\":71728,\"start\":71403}]", "bib_title": "[{\"end\":53020,\"start\":52973},{\"end\":53410,\"start\":53336},{\"end\":53833,\"start\":53775},{\"end\":54359,\"start\":54287},{\"end\":54626,\"start\":54552},{\"end\":55051,\"start\":55012},{\"end\":55344,\"start\":55290},{\"end\":56026,\"start\":55944},{\"end\":56423,\"start\":56327},{\"end\":56915,\"start\":56876},{\"end\":57168,\"start\":57117},{\"end\":57755,\"start\":57679},{\"end\":58119,\"start\":58004},{\"end\":58473,\"start\":58383},{\"end\":58761,\"start\":58735},{\"end\":60107,\"start\":60032},{\"end\":60372,\"start\":60320},{\"end\":60669,\"start\":60602},{\"end\":60922,\"start\":60884},{\"end\":61163,\"start\":61141},{\"end\":61424,\"start\":61349},{\"end\":61831,\"start\":61755},{\"end\":62154,\"start\":62114},{\"end\":62715,\"start\":62693},{\"end\":63155,\"start\":63120},{\"end\":63545,\"start\":63482},{\"end\":63869,\"start\":63804},{\"end\":64214,\"start\":64165},{\"end\":64539,\"start\":64502},{\"end\":64841,\"start\":64785},{\"end\":65074,\"start\":65030},{\"end\":65421,\"start\":65352},{\"end\":65695,\"start\":65656},{\"end\":66122,\"start\":66044},{\"end\":66976,\"start\":66918},{\"end\":67452,\"start\":67340},{\"end\":67914,\"start\":67862},{\"end\":68308,\"start\":68276},{\"end\":68701,\"start\":68583},{\"end\":69627,\"start\":69561},{\"end\":69951,\"start\":69883},{\"end\":70512,\"start\":70439},{\"end\":70751,\"start\":70686}]", "bib_author": "[{\"end\":53034,\"start\":53022},{\"end\":53048,\"start\":53034},{\"end\":53058,\"start\":53048},{\"end\":53067,\"start\":53058},{\"end\":53078,\"start\":53067},{\"end\":53086,\"start\":53078},{\"end\":53090,\"start\":53086},{\"end\":53421,\"start\":53412},{\"end\":53436,\"start\":53421},{\"end\":53447,\"start\":53436},{\"end\":53844,\"start\":53835},{\"end\":53859,\"start\":53844},{\"end\":53870,\"start\":53859},{\"end\":54371,\"start\":54361},{\"end\":54381,\"start\":54371},{\"end\":54638,\"start\":54628},{\"end\":54648,\"start\":54638},{\"end\":54656,\"start\":54648},{\"end\":54660,\"start\":54656},{\"end\":55061,\"start\":55053},{\"end\":55070,\"start\":55061},{\"end\":55354,\"start\":55346},{\"end\":55364,\"start\":55354},{\"end\":55373,\"start\":55364},{\"end\":55384,\"start\":55373},{\"end\":55688,\"start\":55677},{\"end\":55698,\"start\":55688},{\"end\":55709,\"start\":55698},{\"end\":55719,\"start\":55709},{\"end\":55730,\"start\":55719},{\"end\":55744,\"start\":55730},{\"end\":55756,\"start\":55744},{\"end\":55776,\"start\":55756},{\"end\":55783,\"start\":55776},{\"end\":56440,\"start\":56425},{\"end\":56455,\"start\":56440},{\"end\":56465,\"start\":56455},{\"end\":56928,\"start\":56917},{\"end\":56944,\"start\":56928},{\"end\":57178,\"start\":57170},{\"end\":57188,\"start\":57178},{\"end\":57547,\"start\":57540},{\"end\":57557,\"start\":57547},{\"end\":57766,\"start\":57757},{\"end\":57780,\"start\":57766},{\"end\":57789,\"start\":57780},{\"end\":57800,\"start\":57789},{\"end\":58135,\"start\":58121},{\"end\":58147,\"start\":58135},{\"end\":58485,\"start\":58475},{\"end\":58495,\"start\":58485},{\"end\":58505,\"start\":58495},{\"end\":58515,\"start\":58505},{\"end\":58774,\"start\":58763},{\"end\":58785,\"start\":58774},{\"end\":58797,\"start\":58785},{\"end\":58809,\"start\":58797},{\"end\":59350,\"start\":59340},{\"end\":59362,\"start\":59350},{\"end\":59376,\"start\":59362},{\"end\":59519,\"start\":59508},{\"end\":59537,\"start\":59519},{\"end\":59819,\"start\":59810},{\"end\":59832,\"start\":59819},{\"end\":59840,\"start\":59832},{\"end\":59853,\"start\":59840},{\"end\":60118,\"start\":60109},{\"end\":60126,\"start\":60118},{\"end\":60136,\"start\":60126},{\"end\":60382,\"start\":60374},{\"end\":60391,\"start\":60382},{\"end\":60404,\"start\":60391},{\"end\":60684,\"start\":60671},{\"end\":60935,\"start\":60924},{\"end\":60949,\"start\":60935},{\"end\":60958,\"start\":60949},{\"end\":60968,\"start\":60958},{\"end\":61174,\"start\":61165},{\"end\":61184,\"start\":61174},{\"end\":61198,\"start\":61184},{\"end\":61439,\"start\":61426},{\"end\":61449,\"start\":61439},{\"end\":61839,\"start\":61833},{\"end\":61851,\"start\":61839},{\"end\":61859,\"start\":61851},{\"end\":61863,\"start\":61859},{\"end\":62166,\"start\":62156},{\"end\":62180,\"start\":62166},{\"end\":62383,\"start\":62373},{\"end\":62392,\"start\":62383},{\"end\":62400,\"start\":62392},{\"end\":62408,\"start\":62400},{\"end\":62417,\"start\":62408},{\"end\":62421,\"start\":62417},{\"end\":62727,\"start\":62717},{\"end\":62737,\"start\":62727},{\"end\":63173,\"start\":63157},{\"end\":63181,\"start\":63173},{\"end\":63378,\"start\":63371},{\"end\":63557,\"start\":63547},{\"end\":63569,\"start\":63557},{\"end\":63581,\"start\":63569},{\"end\":63587,\"start\":63581},{\"end\":63597,\"start\":63587},{\"end\":63885,\"start\":63871},{\"end\":63897,\"start\":63885},{\"end\":63908,\"start\":63897},{\"end\":63920,\"start\":63908},{\"end\":63930,\"start\":63920},{\"end\":64230,\"start\":64216},{\"end\":64241,\"start\":64230},{\"end\":64251,\"start\":64241},{\"end\":64261,\"start\":64251},{\"end\":64555,\"start\":64541},{\"end\":64562,\"start\":64555},{\"end\":64572,\"start\":64562},{\"end\":64854,\"start\":64843},{\"end\":64866,\"start\":64854},{\"end\":65087,\"start\":65076},{\"end\":65102,\"start\":65087},{\"end\":65117,\"start\":65102},{\"end\":65131,\"start\":65117},{\"end\":65141,\"start\":65131},{\"end\":65433,\"start\":65423},{\"end\":65442,\"start\":65433},{\"end\":65455,\"start\":65442},{\"end\":65713,\"start\":65697},{\"end\":65722,\"start\":65713},{\"end\":66138,\"start\":66124},{\"end\":66635,\"start\":66621},{\"end\":66648,\"start\":66635},{\"end\":66661,\"start\":66648},{\"end\":66988,\"start\":66978},{\"end\":66997,\"start\":66988},{\"end\":67463,\"start\":67454},{\"end\":67475,\"start\":67463},{\"end\":67485,\"start\":67475},{\"end\":67499,\"start\":67485},{\"end\":67506,\"start\":67499},{\"end\":67518,\"start\":67506},{\"end\":67530,\"start\":67518},{\"end\":67540,\"start\":67530},{\"end\":67551,\"start\":67540},{\"end\":67924,\"start\":67916},{\"end\":67935,\"start\":67924},{\"end\":67943,\"start\":67935},{\"end\":67956,\"start\":67943},{\"end\":67969,\"start\":67956},{\"end\":68323,\"start\":68310},{\"end\":68332,\"start\":68323},{\"end\":68344,\"start\":68332},{\"end\":68356,\"start\":68344},{\"end\":68711,\"start\":68703},{\"end\":68718,\"start\":68711},{\"end\":68728,\"start\":68718},{\"end\":68741,\"start\":68728},{\"end\":69062,\"start\":69054},{\"end\":69071,\"start\":69062},{\"end\":69077,\"start\":69071},{\"end\":69086,\"start\":69077},{\"end\":69095,\"start\":69086},{\"end\":69111,\"start\":69095},{\"end\":69335,\"start\":69328},{\"end\":69344,\"start\":69335},{\"end\":69354,\"start\":69344},{\"end\":69363,\"start\":69354},{\"end\":69368,\"start\":69363},{\"end\":69372,\"start\":69368},{\"end\":69637,\"start\":69629},{\"end\":69643,\"start\":69637},{\"end\":69650,\"start\":69643},{\"end\":69961,\"start\":69953},{\"end\":69969,\"start\":69961},{\"end\":69977,\"start\":69969},{\"end\":69983,\"start\":69977},{\"end\":69994,\"start\":69983},{\"end\":70005,\"start\":69994},{\"end\":70009,\"start\":70005},{\"end\":70340,\"start\":70332},{\"end\":70353,\"start\":70340},{\"end\":70362,\"start\":70353},{\"end\":70375,\"start\":70362},{\"end\":70762,\"start\":70753},{\"end\":70773,\"start\":70762}]", "bib_venue": "[{\"end\":54040,\"start\":53955},{\"end\":56610,\"start\":56546},{\"end\":57309,\"start\":57257},{\"end\":58992,\"start\":58890},{\"end\":59579,\"start\":59558},{\"end\":62923,\"start\":62830},{\"end\":65868,\"start\":65802},{\"end\":66322,\"start\":66219},{\"end\":70914,\"start\":70852},{\"end\":53121,\"start\":53090},{\"end\":53488,\"start\":53447},{\"end\":53711,\"start\":53679},{\"end\":53953,\"start\":53870},{\"end\":54399,\"start\":54381},{\"end\":54753,\"start\":54660},{\"end\":55132,\"start\":55070},{\"end\":55455,\"start\":55384},{\"end\":56075,\"start\":56028},{\"end\":56544,\"start\":56465},{\"end\":56978,\"start\":56944},{\"end\":57255,\"start\":57188},{\"end\":57538,\"start\":57484},{\"end\":57820,\"start\":57800},{\"end\":58172,\"start\":58147},{\"end\":58538,\"start\":58515},{\"end\":58888,\"start\":58809},{\"end\":59338,\"start\":59266},{\"end\":59556,\"start\":59537},{\"end\":59808,\"start\":59712},{\"end\":60152,\"start\":60136},{\"end\":60443,\"start\":60404},{\"end\":60727,\"start\":60684},{\"end\":60991,\"start\":60968},{\"end\":61226,\"start\":61198},{\"end\":61521,\"start\":61449},{\"end\":61886,\"start\":61863},{\"end\":62217,\"start\":62180},{\"end\":62575,\"start\":62489},{\"end\":62828,\"start\":62737},{\"end\":63201,\"start\":63181},{\"end\":63369,\"start\":63321},{\"end\":63620,\"start\":63597},{\"end\":63964,\"start\":63930},{\"end\":64284,\"start\":64261},{\"end\":64595,\"start\":64572},{\"end\":64890,\"start\":64866},{\"end\":65164,\"start\":65141},{\"end\":65485,\"start\":65455},{\"end\":65800,\"start\":65722},{\"end\":66217,\"start\":66138},{\"end\":66741,\"start\":66676},{\"end\":67043,\"start\":66997},{\"end\":67571,\"start\":67551},{\"end\":68008,\"start\":67969},{\"end\":68379,\"start\":68356},{\"end\":68769,\"start\":68741},{\"end\":69052,\"start\":68995},{\"end\":69433,\"start\":69372},{\"end\":69698,\"start\":69650},{\"end\":70080,\"start\":70009},{\"end\":70551,\"start\":70514},{\"end\":70850,\"start\":70773},{\"end\":71166,\"start\":71116},{\"end\":71314,\"start\":71233},{\"end\":71564,\"start\":71403}]"}}}, "year": 2023, "month": 12, "day": 17}