{"id": 191147134, "updated": "2022-12-24 18:26:48.763", "metadata": {"title": "Interpretable Deep Learning for Spatial Analysis of Severe Hailstorms", "authors": "[{\"first\":\"David\",\"last\":\"Gagne II\",\"middle\":[\"John\"]},{\"first\":\"Sue\",\"last\":\"Haupt\",\"middle\":[\"Ellen\"]},{\"first\":\"Douglas\",\"last\":\"Nychka\",\"middle\":[\"W.\"]},{\"first\":\"Gregory\",\"last\":\"Thompson\",\"middle\":[]}]", "venue": "Monthly Weather Review", "journal": "Monthly Weather Review", "publication_date": {"year": 2019, "month": null, "day": null}, "abstract": "Deep learning models, such as convolutional neural networks, utilize multiple specialized layers to encode spatial patterns at different scales. In this study, deep learning models are compared with standard machine learning approaches on the task of predicting the probability of severe hail based on upper-air dynamic and thermodynamic ﬁelds from a convection-allowing numerical weather prediction model. The data for this study come from patches surrounding storms identiﬁed in NCAR convection-allowing ensemble runs from 3 May to 3 June 2016. The machine learning models are trained to predict whether the simulated surface hail size from the Thompson hail size diagnostic exceeds 25mm over the hour following storm detection. A convolutional neural network is compared with logistic regressions using input variables derived from either the spatialmeans of each ﬁeld orprincipalcomponentanalysis.The convolutional neuralnetworkstatistically signiﬁcantly outperforms all other methods in terms of Brier skill score and area under the receiver operator characteristic curve. Interpretation of the convolutional neural network through feature importance and feature optimization reveals that the network synthesized information about the environment and storm morphology that is consistent with our understanding of hail growth, including large lapse rates and a wind shear proﬁle that favors wide updrafts. Different neurons in the network also record different storm modes, and the magnitude of the output of those neurons is used to analyze the spatiotemporal distributions of different storm modes in the NCAR ensemble. and wind proﬁle can alter storm morphology and hail growth. varied midlevel relative humidity in idealized supercell simulations and found that the resulting changes in wind ﬂow and storm structure changed the mechanisms of hail growth and locations of maximum hail fall. and found that increasing wind shear in the east–west direction elongates the updraft in that direction and promotes more hail growth by creating a larger hail embryo source region and increasing residence in regions of for", "fields_of_study": "[\"Computer Science\"]", "external_ids": {"arxiv": null, "mag": "2948826745", "acl": null, "pubmed": null, "pubmedcentral": null, "dblp": null, "doi": "10.1175/mwr-d-18-0316.1"}}, "content": {"source": {"pdf_hash": "58d1b5bee6fcff8eee2b9ed8ec7c51cddc9a902b", "pdf_src": "ScienceParsePlus", "pdf_uri": "[\"https://journals.ametsoc.org/downloadpdf/journals/mwre/147/8/mwr-d-18-0316.1.pdf\"]", "oa_url_match": true, "oa_info": {"license": null, "open_access_url": "https://journals.ametsoc.org/downloadpdf/journals/mwre/147/8/mwr-d-18-0316.1.pdf", "status": "BRONZE"}}, "grobid": {"id": "9ee2fbadd5c18f1d0402c6781421a3dbe22877ff", "type": "plain-text", "url": "s3://ai2-s2-pdf-extraction-prod/parse-results/s2orc_worker/58d1b5bee6fcff8eee2b9ed8ec7c51cddc9a902b.txt", "contents": "\nInterpretable Deep Learning for Spatial Analysis of Severe Hailstorms\n\n\nDavid John Gagne Ii \nNational Center for Atmospheric Research\nBoulderColorado\n\nSue Ellen Haupt \nNational Center for Atmospheric Research\nBoulderColorado\n\nANDDouglas W Nychka \nNational Center for Atmospheric Research\nBoulderColorado\n\nGregory Thompson \nNational Center for Atmospheric Research\nBoulderColorado\n\nInterpretable Deep Learning for Spatial Analysis of Severe Hailstorms\n10.1175/MWR-D-18-0316.1(Manuscript received 5 September 2018, in final form 9 May 2019)\nDeep learning models, such as convolutional neural networks, utilize multiple specialized layers to encode spatial patterns at different scales. In this study, deep learning models are compared with standard machine learning approaches on the task of predicting the probability of severe hail based on upper-air dynamic and thermodynamic fields from a convection-allowing numerical weather prediction model. The data for this study come from patches surrounding storms identified in NCAR convection-allowing ensemble runs from 3 May to 3 June 2016. The machine learning models are trained to predict whether the simulated surface hail size from the Thompson hail size diagnostic exceeds 25 mm over the hour following storm detection. A convolutional neural network is compared with logistic regressions using input variables derived from either the spatial means of each field or principal component analysis. The convolutional neural network statistically significantly outperforms all other methods in terms of Brier skill score and area under the receiver operator characteristic curve. Interpretation of the convolutional neural network through feature importance and feature optimization reveals that the network synthesized information about the environment and storm morphology that is consistent with our understanding of hail growth, including large lapse rates and a wind shear profile that favors wide updrafts. Different neurons in the network also record different storm modes, and the magnitude of the output of those neurons is used to analyze the spatiotemporal distributions of different storm modes in the NCAR ensemble.\n\nIntroduction\n\nThe size of a hailstone depends on the path of the hail through a storm and how favorable the environment is for hail growth along that path (Foote 1984). The path and growth conditions are influenced by both the vertical thermodynamic profile of the environment and the morphology of the storm in both the horizontal and vertical directions. Diagnostic tools that most effectively encapsulate all of these factors should have the most skill in discriminating between large and small hail at the surface. Environmental information derived only from the bulk thermodynamic profile has shown some skill in predicting large hail. Edwards and Thompson (1998) found no correlation between integrated radar or sounding indices and hail size. More recently, Manzato (2012) identified instability indices calculated at the 850-to 500-hPa levels, such as the lifted index and Showalter index, as having the highest correlation with hail occurrence. Johnson and Sugden (2014) and Pú cik et al. (2015) both find deeplayer wind shear to discriminate hail size better than thermodynamic and low-level wind parameters. Expanding from scalar indices to full vertical profiles, the HAILCAST 1D hail growth model (Brimelow et al. 2002(Brimelow et al. , 2006Jewell and Brimelow 2009; Adams-Selin and Ziegler 2016) produces hail size estimates by simulating hail embryos growing in a steady-state updraft based on a full vertical wind and temperature profile and adjusting the hail growth based on localized variations in temperature and moisture. HAILCAST has demonstrated skill in diagnosing hail size from proximity soundings (Jewell and Brimelow 2009) and convection-allowing model environments (Adams-Selin et al. 2019). In this paper, we demonstrate that incorporating both vertical profile and spatial information into a deep learning hail size diagnostic model can provide both increased hail size analysis skill and insight into important factors for hail growth.\n\nThe importance of storm morphology to hail growth has been documented in observational and idealized modeling studies. Multiple observational studies (e.g., Nelson 1983;Foote 1984) have found a strong connection between the width of a thunderstorm updraft and the amount of hail growth. Idealized modeling studies of supercells have identified how small changes in the moisture and wind profile can alter storm morphology and hail growth. Grant and van den Heever (2014) varied midlevel relative humidity in idealized supercell simulations and found that the resulting changes in wind flow and storm structure changed the mechanisms of hail growth and locations of maximum hail fall. Dennis and Kumjian (2017) found that increasing wind shear in the east-west direction elongates the updraft in that direction and promotes more hail growth by creating a larger hail embryo source region and increasing residence time in favorable regions of the updraft for hail growth. However, increasing wind shear in the north-south direction decreased hail growth by separating the embryo source regions from the available hydrometeors. Given the limited information about morphology found in sounding studies, and the limited sample size of existing observational and idealized modeling studies, combining the two sources of information with algorithms designed to process large amounts of spatial data may lead to greater understanding about what factors are most important for the growth of large hail.\n\nMany automated weather forecasting algorithms contain methods for encoding spatial information, but these methods typically encode more information about the distribution of field values as opposed to structural features. Spatial encoding is typically performed either within the bounds of an object or within a neighborhood surrounding a fixed point. Object-based encodings offer the advantages of focusing on the relevant area of a discrete object and the reduced memory and processing loads from only calculating information about a limited number of objects versus a large number of grid points. Lakshmanan and Smith (2009) discuss the variety of spatial and temporal statistics that can be extracted from tracked storm objects, and Gagne et al. (2017) and Lagerquist et al. (2017) demonstrated how object-based machine learning methods produce skilled hail and severe wind forecasts, respectively. If the interactions among multiple objects are relevant for the prediction of a particular process, a spatiotemporal relational network framework can encode relationships, such as the distance and orientation between two objects, as well as interactions, such as whether objects overlap or if one object is contained within another object (McGovern et al. 2014).\n\nThe performance of object-based encodings can be limited by how the object is defined and by the way information is extracted from the object. The choice of area and intensity thresholds in the object-finding algorithm can have a large impact on the population of objects and their characteristics due to some potential objects being excluded or merged together, as Haberlie and Ashley (2018) have demonstrated for automated mesoscale convective system climatologies. Extracting environment information only from within a region defined by a radar reflectivity or other storm threshold (e.g., Gagne et al. 2017;Lagerquist et al. 2017) risks ignoring potentially valuable data from the inflow region of the storm. Expanding the area of interest to encompass a fixed-size region around a storm may help account for some of these issues.\n\nNeighborhood spatial encodings apply a transformation to the values of a quantity over the area surrounding a fixed point in order to produce a low-dimensional representation of the region's spatial structure. Principal component analysis (PCA ;Pearson 1901), also known as empirical orthogonal functions in the atmospheric science community, has been commonly used to identify regimes at both weather and climate time scales. Clustering of PCs has been used to identify weather regimes in which separate statistical models have been trained for weather prediction tasks (e.g., Greybush et al. 2008). Self-organizing maps (SOMs; Kohonen 1982) are a neural-network-based clustering and dimensionality reduction technique that has recently been used to identify near-storm atmospheric profiles (Nowotarski and Jensen 2013) and spatial configurations of the significant tornado parameter (Anderson-Frey et al. 2017) favorable for tornadoes. Unsupervised encoding methods can summarize the main features of a dataset without requiring labels, and both the components of PCA and SOMs can be visualized for interpretation. However, the features encoded by PCA and SOMs are not chosen to maximize predictive skill, and the top PCs or SOMs may not be the most important features for a given problem. The PCA and SOM features may also be artifacts of the choice of encoding method or model hyperparameters. For example, most of the variance in a time series of temperature may be explained by diurnal or seasonal cycles, but those forcings have limited utility for predicting large temperature changes produced by local weather phenomena, such as storms. The spatial weights for each PC can be strongly influenced by the shape of the domain, resulting in the same ''Buell patterns'' no matter what kind of input data are used (Buell 1975(Buell , 1979Richman and Lamb 1985;Richman 1993).\n\nDeep learning methods (LeCun et al. 2015) offer the ability to encode spatial features at multiple scales and levels of abstraction with the explicit goal of encoding the features that maximize predictive skill. Machine learning models in the deep learning family typically consist of neural networks with multiple specialized or sparsely connected hidden layers, as opposed to traditional artificial neural networks, which contain one or two densely connected hidden layers. The specialized layers either encode spatial or temporal structure in the data, or they transform the input data to improve the model optimization process. The encodings are learned through a numerical optimization process rather than being developed through empirics. This automated encoding process has enabled deep learning models to create high-level representations of entities in a given dataset and to use those representations to generate more accurate predictions. Deep learning models have produced state-of-theart performance on image recognition tasks (Krizhevsky et al. 2012). An open question is whether these deep learning models can encode spatial weather features and relate them to associated but unresolved severe weather hazards.\n\nThe purpose of this research is to evaluate if deep learning models can encode spatial weather data in a way that improves skill and physical interpretability of severe hail predictions over more traditional spatial encoding methods. A supervised convolutional neural network model is evaluated against unsupervised spatial mean and PCA encodings to determine whether the additional complexity of deep learning results in a significant improvement in the ability of the model to discriminate between storms that will produce simulated severe hail and those that do not. The inputs to all models are permuted to determine which inputs have the most impact on model performance. The internal encodings of each model are interrogated using feature interpretation methods to reveal what storm structures are associated with a high probability of severe hail.\n\n\nData and methods\n\n\na. Model output\n\nSpatial storm information originates from the NCAR convection-allowing numerical weather prediction (NWP) model ensemble (Schwartz et al. 2015). The NCAR ensemble consists of 10 WRF-ARW V3.6.1 (Skamarock and Klemp 2008) members run at 3-km grid spacing over the contiguous United States initialized at 0000 UTC each day. The ensemble uses the Thompson microphysics scheme (Thompson et al. 2004(Thompson et al. , 2008Thompson and Eidhammer 2014), MYJ planetary boundary layer (PBL) scheme (Mellor and Yamada 1982), Noah land surface model (Chen and Dudhia 2001), and the RRTMG radiation scheme (Mlawer et al. 1997). The forecast period of interest lies between forecast hours 12 and 36 (1200 to 1200 UTC the following day), which corresponds to the NOAA Storm Prediction Center Day 1 convective outlook valid period. The ensemble ran daily from April 2015 to December 2017, but on most days only surface variables and severe weather diagnostics were archived.\n\nFor the period from 3 May to 3 June 2016, instantaneous state variables describing weather conditions on isobaric levels were also archived. The NCAR ensemble model output variables and levels used as inputs to the machine learning models are listed in Table 1. The 850and 700-hPa isobaric levels are used because they describe conditions within the inflow region of the storm, and the 500-hPa level is used because it captures conditions within the hail growth zone, which typically ranges between 2108 and 2308C (Nelson 1983). We selected state variables instead of derived storm diagnostics, such as CAPE and wind shear, because most storm diagnostics are vertically integrated quantities that can hide the subtle variations in the storm environment important for discriminating severe hazards.\n\nTo build a dataset of storms, we extract every strong updraft from each NCAR ensemble member over the period of interest. The enhanced watershed method (Lakshmanan et al. 2009;Gagne et al. 2017) identifies storm tracks in the hourly maximum upward vertical velocity field that exceeded 10 m s 21 with a minimum storm track area of 10 grid cells to exclude updrafts only partially resolved horizontally. The updraft speed field should identify most individual storm cells in the model, including pulse thunderstorms, cells embedded in a line, and supercells, all of which can produce severe hail. Some small, weak, and stationary storms may be ignored by these criteria. No storm identification method will capture every storm perfectly, but these criteria produce a large sample of both hail-and non-hail-producing storms to evaluate. A 96-km-wide square patch is extracted around the centroid of each storm track in order to capture both the storm and the immediate surrounding environment. All of the input variables (Table 1) are instantaneous fields extracted at the start time of the updraft swath. Each input field value x i is transformed to b x i based on the training data distribution mean u i and standard deviation s i such that the transformed distribution has mean zero and standard deviation one:\nb x i 5 x i 2 u i s i .(1)\nEach storm patch extracted from each NCAR ensemble member at each forecast time is treated as an independent sample, and all evaluation statistics are calculated on a storm-by-storm basis. The independence assumption is not strictly true because storms in similar environments will have similar characteristics, but because the storms are extracted from 12-to 36-h model integrations, the storms in each ensemble member exhibit different storm initiation times and locations, resulting in different convective evolutions. Instead of using hail reports or radar-estimated hail size, the diagnosed maximum diameter of the graupelhail species in the Thompson microphysics scheme at the lowest model level within bounds of the storm swath is used to determine whether a simulated storm produced hail greater than 25 mm in diameter. This size is equivalent to the National Weather Service size threshold for severe hail since 2010. Because we are using simulated hail sizes as the target for the ML models, we are effectively producing 1-h-ahead hail size predictions within the world of the NWP model. Using simulated hail sizes instead of hail reports or radar-estimated hail sizes ensures the most direct connection between simulated storm features and hail at the surface by eliminating any spatial and temporal displacement errors between a predicted storm and the resulting hail swath. We have chosen to perform a perfect model experiment instead of calibrating toward observations because our primary goal is to increase our understanding of the relationship between storm and environmental features and severe hail, rather than to increase forecast skill.\n\nThe Thompson microphysics hail representation provides a reasonable balance between realism and computational efficiency with its representation of graupel and hail. To represent both graupel and hail with a single microphysical species, the Thompson scheme varies the intercept parameter N o,g as a function inversely proportional to the graupel mixing ratio q g (Thompson et al. 2004(Thompson et al. , 2008. For large q g , N o,g is greatly reduced, which then increases the number concentration of larger diameter graupelhail. The density of the graupel-hail species is held constant at 400 kg m 23 , which is a more graupel-like density. While sensitivity tests in Thompson et al. (2008) showed that intercept parameter changes outweigh the effect of density changes over a 12-h storm simulation, the density of the hail species can affect the fall speed and trajectory of hail within the simulated storm (Morrison and Milbrandt 2011).\n\nThe Thompson hail size diagnostic is a microphysicsagnostic method for estimating a reasonable maximum hail size directly from the particle size distribution (PSD) of a hail or graupel species. The gamma or exponential distribution used to represent the PSD extends to infinite sizes, but the number concentration does decay to the point where the probability of seeing a hailstone above a certain size is infinitesimal. The Thompson hail size diagnostic thus integrates backward across a range of logarithmically spaced diameters until it reaches a number concentration that ensures that a hailstone of that diameter would be detected. The diagnostic concentration threshold in the NCAR Ensemble during the 2016 Spring Experiment was 0.0001 particles m 23 , which roughly corresponds to expecting to find a hailstone of that size within the area of two American football fields. The current diagnostic concentration threshold in WRF version 4.0.3 is 0.0005 particles m 23 . This concentration threshold can also be replaced with a maximum percentile threshold. To validate that the Thompson hail size diagnostic and microphysics scheme approximate real-world hail behavior, we examine both the distribution of hail sizes and how well the diagnostic predicts severe hail when severe hail is reported in the vicinity of a simulated storm (Fig. 1). The hail reports are collected by the NOAA/ National Weather Service in the Storm Data publication and are distributed online by the Storm Prediction Center (Storm Prediction Center 2019). Because the hail diagnostic uses logarithmic-spaced bins instead of linear, a direct histogram of the hail size values would produce a distorted hail size distribution. Instead, we resample the hail sizes within each bin from a uniform distribution, such that each bin contains the same number of hail events but with a continuous range of values. The distribution of predicted hail sizes (Fig. 1) shows a peak in frequency around 12.5 mm with an exponential decrease with diameter. The storm-maximum hail sizes exhibit a fatter tail and two separate regimes of decreasing frequency due to the parameterized relationship between graupel-hail mixing ratio and the intercept parameter. The small, positive Heidke skill score (Wilks 2011) at different search radii from each storm to the hail reports shows that the NWP model can create storms that produce severe hail in areas where severe hail was reported, but the scheme also produces many false alarms based on the small Success Ratio, or ratio of true positive events to all positive predictions (Roebber 2009).\n\n\nb. Machine learning models\n\nWe evaluate a series of machine learning models with spatial encodings of increasing complexity. Because we are more interested in evaluating the quality of the spatial encoding than that of the machine learning model, we use the same algorithm, a logistic regression, to transform our spatial encodings into hail probabilities. A logistic regression is a linear regression model with a logistic, or sigmoid {[1 1 exp(2x)] 21 }, nonlinear transformation applied to the output, so that the output values range between zero and one. Because of this transformation, logistic regressions are often used to estimate the probability of an event with binary outcomes. The ''logistic mean'' baseline model feeds the spatial mean of each input variable into a logistic regression. In the second model, ''logistic PCA,'' PCA transforms each input variable field independently to create a vector representation where each component is orthogonal, and the components are ordered by the percentage of variance explained in the original data. The top five principal components from each variable feed into a logistic regression. PCA applied to spatial fields can detect spatial gradients of varying frequencies and directions based on which patterns explain the largest proportion of variance in the data.\n\nBoth of the logistic regression models are trained using the scikit-learn (v. 0.19; Pedregosa et al. 2011) machine learning library. Lasso, or L1 norm, regularization (Tibshirani 1996) of the logistic regression model weights performs feature selection as part of the model optimization process by penalizing the absolute values of the regression weights to the point where less relevant input weights are set to 0. For both models, the magnitudes of the regularization weights vary during the grid search by powers of 10 from 0.1 to 0.001 to determine the most skilled set of inputs. The Lasso regularization magnitude and number of principal components (3 or 5) are selected through a grid search evaluation on a validation set consisting of storms from a subset of the ensemble members not included in the training set.\n\nThe deep learning model used in this study is a convolutional neural network (ConvNets; LeCun et al. 1990), which learns to encode features in multivariate spatial or temporal data with a series of convolutional layers in order to identify features at a particular spatial scale. Dimension reduction layers condense information spatially and help make the model invariant to slight differences in the locations of certain features. The ConvNets is built using the Keras high-level deep learning library (Chollet et al. 2015) with the Tensorflow low-level backend (Abadi et al. 2016).\n\nA convolutional layer consists of a set of optimized feature maps, which are small patches of weights applied in a sliding window pattern over the spatial extent of the input grid. The output of each feature map is the sum of the product of the weights and the input values. Following the convolution operation, an activation function, or nonlinear transformation, is applied to the resulting field. ConvNets often use some variant of the rectified linear unit [ReLU; max(0, x)] activation function because it preserves the magnitude of positive signals as they travel forward and backward through the network (LeCun et al. 2015). Convolution filters are applied across all inputs simultaneously, which allows them to identify correlated patterns across multiple input variables or the results of previous convolutions. Figure 2 displays an example of how storm data are transformed and rescaled within a ConvNet. Simulated radar reflectivity is used in this figure for illustrative purposes but is not included as an input in the main machine learning model evaluation. The first set of convolutional filters broadly identifies areas of high and low simulated radar reflectivity. The second set of filters highlights a more diverse set of features, including the core of the storm, areas with strong intensity gradients, and low radar reflectivity areas. Spatial dimension reduction is performed either through a pooling layer, in which the mean or maximum of a 2 3 2 gridcell region of the input is calculated, or through the use of strided convolutions, in which the convolution window is shifted by two grid cells instead of one and results in an output half the length and width of the input. The effect of the spatial dimensionality reduction is seen in the second and third layers of the original network (Fig. 2), in which each pixel covers a larger portion of the original storm. Convolutional layers deeper in the network operate on combinations of previous convolutional features and effectively cover a larger portion of the input space. Following the series of convolution and dimension reduction layers, the resulting feature cube is flattened into a feature vector. This vector is then input into a densely connected output layer with a sigmoid activation function. This layer assigns an independent weight to each element of the flat feature vector, sums them together, and rescales the output to create a probability. This final dense layer performs the same operations as a logistic regression. In Fig. 2, the strongest positive weights match up with the reflectivity core and the gradient between the storm edge and the core, which is where the updraft and hail growth region are typically located. The network produced a 98% chance of severe hail for this example, which correctly verified.\n\nGiven its large number of weights, how does a convolutional neural network minimize the chances of overfitting to noise in the data and failing to generalize? First, the convolutional layers impose a strong prior assumption on the model about the spatial structure of the data (Goodfellow et al. 2016). The convolution filters effectively share the same weights across all parts of the image and focus on a local area at any given moment. This reduces the effective number of weights that are fit and updates the weights multiple times per input sample. Dropout regularization (Srivastava et al. 2014), which gives each input a fixed probability of being set to zero on a pass through the network, promotes independence among FIG. 2. Diagram of an example convolutional neural network for estimating the probability of hail from simulated radar reflectivity at 4 km above ground level. Each set of maps show the intensity of neuron activations for each convolutional filter in that layer after mean pooling has been performed on the data. Redder colors indicate a larger magnitude of activation. The original reflectivity image is overlaid on each filter activation map as a set of blue contours. The final set of maps shows the last filter activation multiplied by the matching weight in the dense output layer. the different weights in the model. Ridge, or L2 norm, regularization adds a penalty term to the error function that prefers solutions with small magnitude weights, which enables regression models to find reasonable solutions even with multiple correlated inputs at the expense of slightly higher training set error (Goodfellow et al. 2016). Batch normalization (Ioffe and Szegedy 2015) centers and rescales the internal values of a neural network in order to optimize the network to a certain error level faster and enable higher learning rates to be used.\n\nThe ConvNet configuration used in this study is shown in Fig. 3. The network consists of three strided convolutional layers with square 5 gridcell filters that combine the task of convolution and spatial dimensionality reduction. The number of convolutional filters is doubled in each successive layer. We train and validate separate ConvNets with a range of hyperparameters, or model settings that are fixed during training, in order to find a model configuration that should generalize well to unseen testing data. The initial number of filters is varied between 16 and 32. Dropout rates of 0.1 and 0.3 are validated. ReLU and Leaky ReLU activation functions are tested. Ridge (L2 norm) regularization is applied to each convolutional filter with a regularization coefficient of either 0.01 or 0.001. The Stochastic Gradient Descent and Adam (Kingma and Ba 2015) optimizers are both tested with learning rates of 0.001 and 0.0001. All networks are trained for 15 epochs with a batch size of 128 examples. While these hyperparameter settings do test some of the network architecture sensitivities, they are by no means comprehensive, and additional parameter search and architecture tuning could yield better results than what is shown.\n\nThe weights of a neural network are iteratively optimized through the process of stochastic gradient descent via back propagation. A batch, or random sample, of training data is drawn without replacement and sent forward through the network to generate predictions. The prediction error, or loss L(x, y), is calculated, and then the partial derivative of the error with respect to each weight, or the gradient = w i , is determined. The expansion of the gradient for a particular weight includes the gradients for all other weights between that neuron and the output layer. Next, the gradient calculation has to be propagated backward through the network until gradients are found for all weights, hence the term back propagation. Once the gradients are calculated, each weight w i is updated by stepping in the direction opposite the gradient by a proportional factor called the learning rate (a) such that w i 5 w i 2 a= w i L(x, y).\n\nFIG. 3. Schematic of the convolutional neural network used for severe hail prediction. Each red block consists of a convolutional filter, a nonlinear activation function, and any regularizing transforms performed after the activation. The architecture components and settings shown produce the highest validation scores in the repeated hyperparameter searches.\nAUGUST 2019 G A G N E E T A L .\nThe prediction error function used for this study is the Brier Score, which is equivalent to the mean squared error for probabilistic forecasts. The gradient, or derivative, of the Brier Score is the difference between the forecast probability and whether the event occurred. Stochastic gradient descent is performed using an optimization function with a specified learning rate, which controls the magnitude of the update at each step.\n\nWe assess the quality of the probabilistic forecasts from each machine learning model using standard probabilistic verification metrics. Many preprocessing factors, including the choice of hyperparameters and the training and test set composition affect the skill of each model. To control for some of these issues, a hyperparameter grid search, training, and testing procedure is conducted 30 times for each model type. A hyperparameter grid search is an exhaustive evaluation of every combination of discrete hyperparameter values that is commonly used for machine learning model tuning. During each search, the training and test storm data are split based on the NCAR Ensemble run initialization date with storms from 70% of the run dates used for training and storms from 30% of the run dates used for testing. For the hyperparameter grid search, storm patches from seven of the ten members are kept for training and storm patches from the remaining three members are held out for validation. Because this is a perfect model experiment and the storm extraction begins only after the model has run for at least 12 h, the ensemble members should be independent enough to minimize sharing of information across the training and validation examples. After the grid search has completed, the machine learning model is trained on the set of hyperparameters that produce the highest Brier skill score. The training for this machine learning model uses storms from all NCAR Ensemble members. This final model is then tested on storms from the ensemble runs on the held out test dates. This whole procedure repeats 30 times with different training and test run dates selected to determine the sensitivity of the hyperparameter settings to the training and test set composition. The test set scores aggregate across all 30 iterations. Permutation tests determine the statistical significance of the scores, and bootstrap resampling of the statistics from each iteration generates 95% confidence intervals on each verification diagram.\n\n\nHail model evaluation results\n\nThe primary evaluation statistics are the Brier skill score (BSS) and the area under the receiver operating characteristic (ROC) curve (AUC) (Mason 1982). The BSS can be decomposed into two terms and a scaling factor (Murphy 1973), as shown in Eq. (3):\nBSS 5 1 N å K k51 n k (o k 2 o) 2 2 1 N å K k51 n k ( p k 2 o k ) 2 o(1 2 o) .(3)\nThe first term in the numerator is the resolution, which is mean squared difference between the severe hail relative frequency of forecasts with a certain probability o k and the observed climatological frequency of the event o. The second term of the numerator is the reliability, which is the mean squared difference between the forecast probability p k and the severe hail relative frequency. The scaling factor in the denominator is the uncertainty, which is only a function of the severe hail relative frequency of the event in the test set. Because each testing sample will have a slightly different severe hail relative frequency of severe hail, the reliability and resolution terms are scaled by the uncertainty, so that the terms can be aggregated properly. The three machine learning hail models are compared in Table 2. The ConvNet has the highest BSS with a statistically significant improvement (a , 0.01 based on a permutation test) over the second most skilled model, the logistic PCA. In terms of BSS components, the ConvNet has the worst reliability but the best resolution. Since the differences in reliability are relatively small, the increase in resolution provided by the more sophisticated encodings is very helpful for this problem. The components of the BSS are visualized with the attributes diagram, which plots the severe hail relative frequency of an event against the forecast probability (Fig. 4). A dashed horizontal line indicates the climatological probability of the event, and grayshaded areas highlight where the BSS resolution exceeds the BSS reliability, contributing to a positive BSS. An inset plot shows the frequency of each forecast probability, providing a measure of sharpness. In the attributes diagram (Fig. 4), all of the models except for the logistic mean have observed relative frequencies that are close to the diagonal. The logistic mean model exhibits large deviations from the diagonal at high probability thresholds. The ConvNet displays a slight underforecasting bias at 20% probability and then an overforecasting bias at 80%. However, the ConvNet also has more forecasts with greater than 80% and less than 10% probability than any of the other models, which contributes to its high BSS resolution score. The logistic PCA models show very little deviation from the reliability diagonal. The probabilistic hail forecasts are also evaluated with ROC curves and the related performance diagram. The ROC curve (Mason 1982) evaluates probabilistic forecasts by converting them into a series of binary deterministic forecasts and calculating the probability of detection (POD), the ratio of hits to the total number of positive events and probability of correct negative (POCN), the ratio of true negative events to the total number of negative events, at each probability threshold. The curves display how much varying the probability threshold affects the trade-off between minimizing misses and false alarms. The area under the ROC curve (AUC) is a measure of total prediction skill in which AUC scores greater than 0.5 have more skill than a random prediction and a score of 1 results in perfectly discriminating between positive and negative events.\n\nThe conv.net has the highest AUC followed by the logistic PCA, and logistic mean with statistically significant separations among the different models ( Table 2). The ROC curves for each model (Fig. 5) indicate that the ConvNet and logistic PCA consistently perform better across probability thresholds. Each point on the curve indicates an increase in probability by 10% from upper left to lower right. The models with higher AUC also have more probability thresholds with POD above 0.5, so these models can discriminate events with a low amount of false alarms even at higher probability thresholds.\n\nPerformance diagrams (Roebber 2009) perform a similar function to the ROC curve but replace POCN with the success ratio, which is the ratio of hits to the total number of positive forecasts. A performance diagram for the hail model evaluation is shown in Fig. 6. The performance diagram ignores the number of true negative events, so it is easier to differentiate forecasts that perform well on rare events. The performance diagram also displays critical success index (curved filled contours), a measure of accuracy, and frequency bias, a measure of the ratio of false alarms to misses, on the same diagram. There is more separation between the ConvNet and logistic PCA models. The training times for each machine learning model are shown in Table 3. The mean single model training time is calculated by dividing the mean search time by the number of parameter combinations and multiplying by the number of processes running simultaneously (8). The ConvNet trains faster than the logistic PCA model because the ConvNet was relatively small and can take full advantage of GPU parallelism and optimizations. The logistic PCA model requires performing 15 PCA decomposition and transformation procedures followed by an iterative fitting of a logistic regression, which are performed serially on one CPU. A parallel implementation of the PCA process could lead to much faster logistic PCA fitting times.\n\nThe repeated hyperparameter searches for each machine learning model reveals settings that are robust across variations in the training data. For both logistic mean and logistic PCA, a low inverse Lasso penalty of 0.1 produces the lowest validation errors and leads to most or all of the variables being selected. The logistic PCA models with 5 principal components per variable consistently outperform those with 3. For ConvNets, ReLU activations produce better results than Leaky ReLU activations. Dropout rates of 30% perform best for ConvNets on this problem. Increasing the number convolutional filters results in better performance most of the time.\n\n\nMachine learning model interpretation\n\nUsers of machine learning models may not trust their output if they do not understand the model's decisionmaking process. Key questions for interpreting machine learning models include: which model inputs have the largest impact on the predictions and what features are encoded within a model's latent space? The first question can be addressed through modelagnostic interpretation methods, which treat the model as a black box and only operate on the inputs and outputs. Model-agnostic interpretation methods allow for apples-to-apples comparisons of model structures and can highlight how each model's assumptions and settings change the resulting model behavior. Permutation feature importance (Breiman 2001) ranks input variables based on how randomizing their values affects prediction error. First the model error on a set of examples is calculated. Then the values of each variable are permuted, or shuffled, among the examples. Then, the error is recalculated on the permuted data. A larger change in error is associated with higher importance.\n\nVariable importance scores are shown in Fig. 7. The ConvNet and logistic mean models feature similar rankings with high importance for geopotential height and temperature. The variables extracted at 850 hPa tend to rank higher than variables from other pressure levels. The large drop in scores seen for all variables may be due to the shuffling of input fields affecting the values of five variables instead of one. The ranking of the absolute values of logistic PCA regression coefficients reveals a similar pattern to the logistic mean with geopotential height and temperature variables having the highest weights. The logistic PCA rankings differ from the other models potentially because permuting any of the input fields varies five of the inputs to FIG. 6. Performance curve comparing different spatial machine learning methods. The curves show the probability of detection and success ratio as the forecast probability threshold increases (low probability thresholds are at the top left of the diagram and high probability thresholds are at the bottom right). The shaded areas indicate the 95% bootstrap confidence interval for each model's curve. The filled contours show regions of increasing critical success index. The dashed lines are contours of equal frequency bias. Points with frequency bias greater than one have more false alarms than misses, and points with frequency bias less than one have more misses than false alarms. the logistic regression, resulting in a major loss in skill. Although variable importance reveals which variables have the largest impact on predictive skill, it does not inform us about why each variable is important.\n\nTo provide more insight into why each variable is important, we utilize feature visualization by optimization, or backward optimization (Olah et al. 2017) on each machine learning model. The goal of feature visualization by optimization is to find the set of input values that maximize the activation of a particular neuron or set of neurons within a trained neural network. A logistic regression can be modeled as a one-layer neural network with no hidden layers, so the same process can be applied to the logistic mean and logistic PCA models as well. The results of this process should provide insight into what features each model has encoded. First, a neural network is trained. Then, the user picks a neuron or node to activate and creates a loss function that calculates the squared difference between the current output value (a i ) and the desired output value (a d ):\nE 5 (a i 2 a d ) 2 Á(4)\nNext, the user selects an initial input example to send through the network and be updated. This initial input can consist of all zeros, small random values, or a sample from the training set. The input example propagates forward through the network to the selected neuron, and the resulting activation is compared with the desired activation through the loss function. The gradient of each component of the input with respect to the activated neuron is calculated through back propagation. Because the gradient at the input is often very small, the gradient values are divided by the standard deviation of the gradient values.\n\nThe input values are updated by subtracting the gradient multiplied by a learning rate from each input value [Eq.\n\n(2)]. Finally, the process is repeated until the neuron activation for a given input matches the desired activation. The resulting input field should contain relevant features for activating the selected neuron. The gradient values from a single iteration of this process can also be used to create saliency maps that identify where in the input space a particular neuron is focusing its attention (Simoyan et al. 2014).\n\nThe strided convolution architecture used in the ConvNets creates a checkerboard pattern in the feature optimization fields because of uneven propagation of the gradient (Odena et al. 2016). To remove the checkerboard pattern while preserving the spatial structures in the feature optimization output, a Gaussian filter is applied to each field and the smooth field is scaled by the standard deviation so that the input values range from 23 to 3. Using average pooling layers instead of strided convolutions or max pooling for spatial dimensionality reduction also reduces the checkerboard artifacts.\n\nWhen applied to the output, the feature visualization by optimization process should reveal what input features lead each machine learning model to predict a high probability of hail. The strongest input anomalies in the logistic mean model (Fig. 8) come from the 850and 500-hPa geopotential heights, which show positive and negative anomalies, respectively. The temperature fields show decreasing positive anomalies with decreasing pressure. Dewpoint and winds have consistent small anomalies, which is consistent with the small permutation feature importance assigned to them.\n\nFeature visualization applied to the logistic PCA model (Fig. 9) illuminates more details consistent with the logistic mean visualization but providing more spatial context. The primary features are the same positive and negative geopotential height anomalies at 850 and 500 hPa along with a north-south temperature gradient in each field. Positive dewpoint anomalies appear at each level. The winds at 850 hPa show a weakly confluent pattern, the winds at 700 hPa have a slight rotation signature, and the winds at 500 hPa are from the south within the area of the height anomaly but are from the west outside of it.\n\nThe results of the input feature visualization on the output layer of a ConvNet are shown in Fig. 10. Many of the trained ConvNets produce an isolated storm similar to the top panel of Fig. 10. The input fields include many features associated with severe thunderstorms, including confluent warm moist air at low levels, directional wind shear with height, and strong lapse rates based on the change in temperature and height anomalies between 850 and 500 hPa. The ConvNet visualization generally matches the same patterns as the logistic PCA, FIG. 8. Magnitudes of the fields backward optimized by the logistic mean model to maximize the probability of severe hail. All values are scaled in terms of normalized anomalies from the training data mean value of each input variable.\n\nFIG. 9. A selection of input thermodynamic fields backward optimized by logistic PCA to maximize the probability of severe hail. The filled contours indicate geopotential height (red is positive and blue is negative), the orange-red contours indicate temperature, the purple contours show dewpoint, and the arrows display the wind vectors. All contours are scaled in terms of normalized anomalies from the training data mean value of each input variable. but the anomalies are all overlaid with each other, the winds are stronger near the center of the storm, and the wind field at 500 hPa is out of the west-southwest near the storm center and curves around north of the storm. The lapse rate information may be why the ConvNet and logistic mean models both featured high variable importance for the temperature and geopotential height variables. The rotational pattern seen in the 500-hPa wind field may be a precursor to the emergence of a rear flank downdraft, which has been shown to help large hail reach the surface by forcing cooler, drier air to the surface, which reduces hail melting (Rasmussen and Heymsfield 1987) and has been associated with the occurrence of large hail in hybrid supercell storms (Nelson 1987). The 500-hPa west-east wind vector orientation does match with the positive sensitivity to the wind shear direction found in Dennis and Kumjian (2017).\n\nA few of the optimized hailstorms include two storms with wind fields linked at 500 hPa, as shown in the bottom panel of Fig. 10. This pattern may be associated with graupel and hail generated in one storm seeding the updraft of the downwind storm and encouraging the growth of large hail, which is a previously documented pattern of large hail formation (Heymsfield et al. 1980). The process should be resolvable in a convection-allowing model with Thompson microphysics because it relies on advection of graupel-hail mass, and an increase in graupel-hail mass should result in a sharp decrease in the intercept parameter and thus very large hail increasing in number concentration.\n\nThe input optimized features associated with activating individual neurons in the last convolutional layer provide information about the breadth of storm structures that the network associates with severe hail. Convolutional neurons were ranked based on how well their output values discriminate among hail and nonhail storms based on the area under the ROC curve. Figure 11 displays the optimized inputs FIG. 10. A selection of input thermodynamic fields optimized by ConvNets to maximize the probability of severe hail. The filled contours indicate geopotential height (red is positive and blue is negative), the orange-red contours indicate temperature, the purple contours show dewpoint, and the arrows display the wind vectors. All contours are scaled in terms of normalized anomalies from the training data mean value of each input variable.\n\nAUGUST 2019 G A G N E E T A L .\n\nfor three of the top discriminating neurons in the last convolutional layer. Each convolutional filter captures a different storm morphology. The first two filters are positively associated with large hail and resemble a supercell-like storm and a bow-echoor bowing-line-like storm. Both of these feature the vertical geopotential height gradient in the main storm area. The bowing line also appears to have a strong rear flank downdraft with drier air at 700 hPa and cooler air at the surface. The third filter resembles a pulse-like storm and is negatively correlated with severe hail occurrence. The most notable differences between this storm and the others is the reversed geopotential height anomaly, negative temperature and moisture anomalies at the surface, and a lack of a clockwise hodograph or confluent winds at 850 and 700 hPa. Once neurons have been associated with a particular storm morphology or other higher-level concept, those neurons can be used to filter a dataset into subsets for further analysis. The distributions of storms that activate the different filters in Fig. 11 are plotted in space (Fig. 12) and time (Fig. 13). The supercell storms are concentrated in the southern High Plains of the United States and tend to occur primarily in the late afternoon, which is expected for isolated supercell storms. The bow echo storms occur farther east and farther north with a temporal peak in the early evening but slightly later than FIG. 11. Input fields that maximize the activation of neurons in the final convolution layer that strongly discriminate between severe and nonsevere hail based on AUC. The contours follow the same patterns as Figs. 9 and 10.\n\nthe supercells. Unlike the other storm types, the pulselike storms are found primarily in the lower Mississippi River valley, along the East Coast and the coasts of the Great Lakes, and peak in temporal frequency just after noon central standard time. The timing and location of these storms is consistent with a sea-breeze initiation mechanism (Byers and Rodebush 1948). The bottom panels of Figs. 12 and 13 show the spatial and temporal distributions of the storms that both activate each filter and produce severe hail. 62% of the supercell filter storms produce severe hail, but only 34% of the bow echo storms and 2% of the pulse storms produce severe hail. The combined areas covered by the different hailstorm modes closely match the extent of the hail climatologies in Cintineo et al. (2012) and Allen and Tippett (2015). The conditional spatial distribution of the supercells is largely unchanged. Severe hailstorms in May in the northern plains, Midwest, and the Carolinas tend to originate from bow echo storm types. The hail-producing pulse storms occur in regions around either Arkansas or Florida with none of the storms near the Great Lakes producing any severe hail. FIG. 12. (top) Spatial kernel density estimates of the distributions of storms that activate one of the specified neurons from Fig. 11 with a magnitude of at least 0.5. The lighter red, blue, and orange contours indicate a higher spatial frequency of storms. The contour values are the number of storms per year at a given location. (bottom) The same spatial distribution by storm mode but only for the storms that produced severe hail.\nAUGUST 2019 G A G N E E T A L .\nThe prevalence of bow echo and pulse storms in the Southeast in May could partially explain why severe hail is less common there. Diurnally, the bow echo hailstorms tend to occur more frequently in the 1800 to midnight central standard time range than the full population of bow echo storms and less frequently between 0300 and 0900.\n\n\nDiscussion\n\nThe verification and interpretation results in this paper have shown that the more sophisticated spatial encoding process of the convolutional neural network provides increased skill over models using unsupervised feature dimensionality reduction and encodes multiple physical features that have been historically associated with severe hailstorms. These performance gains have been accomplished with relatively small convolutional neural networks compared with those being used in the domain of object recognition in images. Deeper networks have a larger representational capacity, but they also require more data and longer training periods for optimization. Because they require less training time and less data, smaller networks can be tuned to optimal parameter settings more quickly and generally have fewer parameters that require tuning. Also, compared with generic images, most gridded weather fields are often more constrained and less noisy. Many weather prediction problems can be framed in a way that requires the network to predict a small number of classes or quantities, compared with thousands of classes that are often found in image recognition datasets. Therefore, we recommend that atmospheric scientists interested in deep learning start by experimenting with smaller convolutional neural networks and only add more layers if skill is less than adequate for the problem.\n\nThe neural network feature visualization process in Fig. 11 and the spatiotemporal analysis of activations in Figs. 12 and 13 demonstrate the potential for deep learning interpretation to enable morphological analysis of complex spatial datasets without feature engineering or hand-labeling. Researchers could train their convolutional neural networks on storm data and identify which filters in the final convolutional layer best match the storm morphologies of interest. Climatological analysis of environmental parameters by storm morphology could provide greater insights to meteorologists about which storm modes are more likely with particular combinations of largerscale environmental conditions. If the morphological feature identification is applied to real-time convection-allowing ensemble predictions, then forecasters could receive a probabilistic assessment of the timing and location of different storm modes and adjust their hazard assessments based on when supercells are expected to transition to a linear storm mode. The same deep learning and interpretation in this paper could also be applied to storms in gridded radar reflectivity mosaics to understand what radar features are linked with hail or tornado reports. This same interpretation approach could also be applied to a wide range of other weather and climate phenomena at different scales to perform similar kinds of analyses.\n\nAlthough the logistic PCA model performed well in this evaluation, it did not provide any physical insights into the hail forecasting problem. The top components for each variable closely resembled the Buell (1979) patterns, likely due to varying locations and orientations of the storm in each patch. Further preprocessing of the data and recentering patches on the storm of interest rather than the track could potentially provide more of the signal in the PCs, but it would be difficult to capture the sophisticated multivariate patterns identified by the ConvNet. Interaction terms among the PCs could also be calculated to identify relationships among variables, but that would greatly expand the number of inputs that the logistic regression would have to optimize. Rotated principal FIG. 13. Kernel density estimates of the diurnal distribution of the storms that activate each convolutional filter neuron from Fig. 11. Times are UTC 2 6 h. components (Richman 1986) could provide more interpretability at the expense of the loss of orthogonality among components and may be investigated in future studies.\n\nThe results of this study have some limitations that should be considered when interpreting the results. First, the verification scores for this study should not be compared directly with other hail prediction evaluations (e.g., Gagne et al. 2017) based on observed data because the simulated storms within CAMs are often displaced in space, time, and intensity from the observed hailstorms, so the verification scores will generally be less skilled than the perfect model results shown here. Second, deep neural networks have many possible configurations and parameter settings, so better or worse results may be achieved under the ConvNet framework with other types of layers and other settings not explored in the limited grid search performed here. Third, different results and interpretations may be possible if the storm patches are centered on the storm at the beginning of the hour instead of on the center of the updraft track over the course of the hour. All methods may perform slightly better if the storm is centered, but given the variety of storm modes captured in this dataset and the already high skill scores, this change may not have a large impact on the results.\n\n\nConclusions\n\nDeep learning models for encoding spatial weather data for analysis of severe hailstorms have been compared with traditional statistical approaches to determine the level of skill added by the deep learning encodings. Convolutional neural networks provide a statistically significant increase in multiple measures of prediction skill and result in sharper probabilistic predictions compared with logistic PCA. Through interpretation of the inputs that activate the hidden and output layers of the convolutional neural networks and logistic regressions, we discover that the machine learning models identify storm structures associated with severe hail in previous observational and modeling studies, including strong lapse rates, directional wind shear with a large west-east component, and seeding of graupel and hail from a weaker upstream storm. With these interpretation techniques, we can extract physical insights from machine learning models and compare the insights between models as well as with our conceptual understanding of the phenomenon. We also find that the neurons in convolutional neural networks can encode different storm morphologies, which enabled us to analyze our simulated hailstorm dataset and determine that supercelllike storms produce severe hail twice as frequently as bowing-line-like storms. In general, convolutional neural networks can serve as high-level feature detectors and enable semantic analysis of complex weather and climate datasets.\n\nThe machine learning and analysis software used in this paper can be accessed in the deepsky library available at https://github.com/djgagne/deepsky. Processed storm patch data, saved machine learning models, and other analysis data are available online (https:// rda.ucar.edu/datasets/ds898.0/; Gagne 2019).\n\nFIG. 1 .\n1(top) The distribution of the maximum (red) and all storm grid cell (purple) surface hail diameters in mm from the Thompson hail size diagnostic for each storm in the NCAR ensemble. (bottom) The probability of detection, success ratio, and Heidke skill score of the Thompson hail size diagnostic as a function of the maximum search radius for hail reports near a simulated storm from the NCAR ensemble.\n\nFIG. 4 .\n4Attributes diagram comparing the binned forecast probabilities of each spatial machine learning model with their observed relative frequencies. Ideally the curve for each model should fall along the dashed diagonal line. The shaded areas around each curve indicate the 95% bootstrap confidence interval for the severe hail relative frequency. The gray shaded area indicates the region where points on the curves contribute positively to the Brier skill score. The inset panel displays the frequency of all binned forecast probabilities for each model.FIG. 5. ROC curve comparing different spatial machine learning methods. The ROC curve for a given model shows how POD and POCN vary by splitting probability forecasts into binary forecasts over series of increasing thresholds. The points from low probability thresholds appear in the top-left corner, and the points from high probability thresholds appear in the bottom-right corner. The shaded areas indicate the 95% bootstrap confidence interval for each model's ROC curve. The dashed line indicates where performance is no better than random.\n\nFIG. 7 .\n7Variable importance scores in terms of the decrease in AUC and BSS for each of the hail forecast models. The whiskers indicate the 2.5 and 97.5 percentiles of the distribution of importance scores from the 30 optimized machine learning models from each resampling of the training data.\n\nTABLE 1 .\n1List of the input fields for each machine learning model and the mean and standard deviation (SD) of each field to three significant figures.Variable \nPressure level \nMean \nSD \n\nGeopotential height \n500 hPa \n5790 m \n65.1 m \nGeopotential height \n700 hPa \n3110 m \n49.7 m \nGeopotential height \n850 hPa \n1480 m \n45.3 m \nTemperature \n500 hPa \n261 K \n2.58 K \nTemperature \n700 hPa \n279 K \n2.37 K \nTemperature \n850 hPa \n290 K \n2.91 K \nDewpoint \n500 hPa \n254 K \n8.90 K \nDewpoint \n700 hPa \n275 K \n4.15 K \nDewpoint \n850 hPa \n286 K \n3.81 K \nZonal wind \n500 hPa \n10.1 m s 21 \n7.44 m s 21 \nZonal wind \n700 hPa \n6.14 m s 21 \n6.62 m s 21 \nZonal wind \n850 hPa \n2.74 m s 21 \n7.05 m s 21 \nMeridional wind \n500 hPa \n8.25 m s 21 \n7.45 m s 21 \nMeridional wind \n700 hPa \n7.48 m s 21 \n6.39 m s 21 \nMeridional wind \n850 hPa \n6.70 m s 21 \n7.41 m s 21 \n\n\n\nTABLE 2 .\n2Evaluation scores for the different machine learning models. Every score except BSS reliability is positively oriented such that larger values mean better performance. The scores below are the means of the individual scores of 30 models trained and tested on different samples of training and testing ensemble run dates. Bold numbers indicate the best value for each metric.Model \nBSS BSS reliability BSS resolution AUC \n\nLogistic mean 0.12 \n0.017 \n0.13 \n0.75 \nLogistic PCA \n0.29 \n0.008 \n0.30 \n0.85 \nConvNet \n0.36 \n0.019 \n0.37 \n0.88 \n\n\nTABLE 3 .\n3Summary of computational time for training each machine learning model. Deep learning models were trained on eight NVIDIA K40 graphical processing units (GPUs), and the logistic mean and logistic PCA models were trained on 8 Intel Xeon E5-2670 processors. Times are in minutes.Model name \n\nParameter \ncombinations \n\nMean search \ntime \n\nMean single \nmodel training \ntime \n\nLogistic PCA \n6 \n16 \n21.33 \nConvNet \n64 \n30 \n3.75 \nLogistic mean \n3 \n0.6 \n1.59 \n\nUnauthenticated | Downloaded 05/18/22 01:04 PM UTC\nAcknowledgments. The authors thank Amy McGovern, Ryan Lagerquist, and Nathan Snook for discussions about deep learning interpretability. Ryan Sobash, Glen Romine, and Craig Schwartz assisted with access to the NCAR Ensemble output. Roy Rasmussen provided helpful insights into the hail growth processes encoded by the convolutional neural network. The authors thank Dorit Hammerling for a helpful internal review of the manuscript. Rich Loft, Ben Matthews, and Irfan Elahi provided access and support for GPU computing in the NCAR HPC Futures Lab, where machine learning training and evaluation was performed. The NCAR Ensemble output was processed on the Cheyenne supercomputer (Computational and Information Systems Laboratory 2017), provided by NCAR's Computational and Information Systems Laboratory. This research is funded by the NCAR Advanced Study Program Postdoctoral Fellowship. The National Center for Atmospheric Research is sponsored by the National Science Foundation. The authors also thank three anonymous reviewers whose comments resulted in an improved manuscript.\nTensorflow: A system for largescale machine learning. M Abadi, Coauthors , Proc. 12th USENIX Symp. on Operating Systems Design and Implementation (OSDI'16). 12th USENIX Symp. on Operating Systems Design and Implementation (OSDI'16)Savannah, GAAbadi, M., and Coauthors, 2016: Tensorflow: A system for large- scale machine learning. Proc. 12th USENIX Symp. on Operating Systems Design and Implementation (OSDI'16), Savannah, GA, USENIX 265-283, https://www.usenix.org/ system/files/conference/osdi16/osdi16-abadi.pdf.\n\nForecasting hail using a one-dimensional hail growth model within WRF. R D Adams-Selin, C L Ziegler, Adams-Selin, R. D., and C. L. Ziegler, 2016: Forecasting hail using a one-dimensional hail growth model within WRF.\n\nEvolution of WRF-HAILCAST during the 2014-16 NOAA/Hazardous Weather Testbed spring forecasting experiments. Mon, Wea, A J Rev, C J Clark, S R Melick, I L Dembek, C L Jirak, Ziegler, 10.1175/WAF-D-18-0024.1Wea. Forecasting. 144Mon. Wea. Rev., 144, 4919-4939, https://doi.org/10.1175/ MWR-D-16-0027.1. --, A. J. Clark, C. J. Melick, S. R. Dembek, I. L. Jirak, and C. L. Ziegler, 2019: Evolution of WRF-HAILCAST during the 2014-16 NOAA/Hazardous Weather Testbed spring fore- casting experiments. Wea. Forecasting, 34, 61-79, https:// doi.org/10.1175/WAF-D-18-0024.1.\n\nJ T Allen, M K Tippett ; G A G N E E T A L, The characteristics of United States hail reports. 10Allen, J. T., and M. K. Tippett, 2015: The characteristics of United States hail reports: 1955-2014. Electron. J. Severe Storms Meteor., 10 (3), http://www.ejssm.org/ojs/index.php/ ejssm/article/viewArticle/149. AUGUST 2019 G A G N E E T A L .\n\nSelf-organizing maps for the investigation of tornadic near-storm environments. A K Anderson-Frey, Y P Richardson, R L Thompson, B T Smith, 10.1175/WAF-D-17-0034.1Wea. Forecasting. 32Anderson-Frey, A. K., Y. P. Richardson, R. L. Thompson, and B. T. Smith, 2017: Self-organizing maps for the investigation of tornadic near-storm environments. Wea. Forecasting, 32, 1467-1475, https://doi.org/10.1175/WAF-D-17-0034.1.\n\nRandom forests. L Breiman, 10.1023/A:1010933404324Mach. Learn. 45Breiman, L., 2001: Random forests. Mach. Learn., 45, 5-32, https:// doi.org/10.1023/A:1010933404324.\n\nModeling maximum hail size in Alberta thunderstorms. J C Brimelow, G W Reuter, E R Poolman, Brimelow, J. C., G. W. Reuter, and E. R. Poolman, 2002: Modeling maximum hail size in Alberta thunderstorms.\n\nSpatial forecasts of maximum hail size using prognostic model soundings and hailcast. Wea, T W Forecasting ; R. Goodson, Krauss, 10.1175/WAF915.1Wea. Forecasting. 171048:MMHSIA.2.0.COWea. Forecasting, 17, 1048-1062, https://doi.org/10.1175/ 1520-0434(2002)017,1048:MMHSIA.2.0.CO;2. --, --, R. Goodson, and T. W. Krauss, 2006: Spatial fore- casts of maximum hail size using prognostic model sound- ings and hailcast. Wea. Forecasting, 21, 206-219, https:// doi.org/10.1175/WAF915.1.\n\nThe topography of empirical orthogonal functions. C E Buell, Preprints Fourth Conf. on Probability and Statistics in Atmospheric Sciences. Tallahassee, FLAmer. Meteor. SocBuell, C. E., 1975: The topography of empirical orthogonal functions. Preprints Fourth Conf. on Probability and Sta- tistics in Atmospheric Sciences, Tallahassee, FL, Amer. Meteor. Soc., 188-193.\n\nOn the physical interpretation of empirical orthogonal functions. Preprints, Sixth Conf. on Probability and Statistics in Atmospheric Sciences. Banff, Alberta, CanadaAmer. Meteor. Soc--, 1979: On the physical interpretation of empirical orthogonal functions. Preprints, Sixth Conf. on Probability and Statistics in Atmospheric Sciences, Banff, Alberta, Canada, Amer. Meteor. Soc., 112-117.\n\nCauses of thunderstorms of the Florida peninsula. H R Byers, H R Rodebush, 10.1175/1520-0469(1948)005<0275:COTOTF>2.0.CO;2J. Meteor. 5Byers, H. R., and H. R. Rodebush, 1948: Causes of thunderstorms of the Florida peninsula. J. Meteor., 5, 275-280, https:// doi.org/10.1175/1520-0469(1948)005,0275:COTOTF. 2.0.CO;2.\n\nCoupling an advanced land surface-hydrology model with the Penn State-NCAR MM5 modeling system. Part I: Model implementation and sensitivity. F Chen, J Dudhia, 10.1175/1520-0493(2001)129<0569:CAALSH>2.0.CO;21175/1520-0493(2001)129,0569:CAALSH.2.0.CO;2Mon. Wea. Rev. 129Chen, F., and J. Dudhia, 2001: Coupling an advanced land surface-hydrology model with the Penn State-NCAR MM5 modeling system. Part I: Model implementation and sensitivity. Mon. Wea. Rev., 129, 569-585, https://doi.org/ 10.1175/1520-0493(2001)129,0569:CAALSH.2.0.CO;2.\n\nKeras: The Python Deep Learning Library. F Chollet, Coauthors , Chollet, F., and Coauthors, 2015: Keras: The Python Deep Learning Library. Accessed 31 August 2018, https://keras.io.\n\nAn objective high-resolution hail climatology of the contiguous United States. J L Cintineo, T M Smith, V Lakshmanan, H E Brooks, K L Ortega, 10.5065/D6RX99HXCheyenne: HPE/SGI ICE XA System (NCAR Community Computing). Boulder, CO27Computational and Information Systems LaboratoryTech. Rep.Wea. ForecastingCintineo, J. L., T. M. Smith, V. Lakshmanan, H. E. Brooks, and K. L. Ortega, 2012: An objective high-resolution hail clima- tology of the contiguous United States. Wea. Forecasting, 27, 1235-1248, https://doi.org/10.1175/WAF-D-11-00151.1. Computational and Information Systems Laboratory, 2017: Cheyenne: HPE/SGI ICE XA System (NCAR Community Computing). Tech. Rep., National Center for Atmospheric Research, Boulder, CO, accessed 1 September 2018, https:// doi.org/10.5065/D6RX99HX.\n\nThe impact of vertical wind shear on hail growth in simulated supercells. E J Dennis, M R Kumjian, 10.1175/JAS-D-16-0066.1J. Atmos. Sci. 74Dennis, E. J., and M. R. Kumjian, 2017: The impact of vertical wind shear on hail growth in simulated supercells. J. Atmos. Sci., 74, 641-663, https://doi.org/10.1175/JAS-D-16-0066.1.\n\nNationwide comparisons of hail size with WSR-88D vertically integrated liquid water and derived thermodynamic sounding data. R Edwards, R L Thompson, Edwards, R., and R. L. Thompson, 1998: Nationwide com- parisons of hail size with WSR-88D vertically integrated liquid water and derived thermodynamic sounding data.\n\n. Wea, Forecasting, 10.1175/1520-0434(1998)013<0277:NCOHSW>2.0.CO;213130277:NCOHSW.2.0.CO;2.Wea. Forecasting, 13, 277-285, https://doi.org/10.1175/ 1520-0434(1998)013,0277:NCOHSW.2.0.CO;2.\n\nA study of hail growth utilizing observed storm conditions. G B Foote, 10.1175/1520-0450(1984)023<0084:ASOHGU>2.0.CO;21175/1520-0450(1984)023,0084:ASOHGU.2.0.CO;2J. Climate Appl. Meteor. 23Foote, G. B., 1984: A study of hail growth utilizing observed storm conditions. J. Climate Appl. Meteor., 23, 84-101, https://doi.org/ 10.1175/1520-0450(1984)023,0084:ASOHGU.2.0.CO;2.\n\nInterpretable deep learning for spatial analysis of severe hailstorms: Storm and analysis data. D J Gagne, 10.5065/6CJA-B154Computational and Information Systems LaboratoryResearch Data Archive at the National Center for Atmospheric ResearchGagne, D. J., 2019: Interpretable deep learning for spatial analysis of severe hailstorms: Storm and analysis data. Research Data Archive at the National Center for Atmospheric Research, Computational and Information Systems Laboratory, https:// doi.org/10.5065/6CJA-B154.\n\nStorm-based probabilistic hail forecasting with machine learning applied to convection-allowing ensembles. -- , A Mcgovern, S E Haupt, R A Sobash, J K Williams, M Xue, 10.1175/WAF-D-17-0010.1Wea. Forecasting. 32--, A. McGovern, S. E. Haupt, R. A. Sobash, J. K. Williams, and M. Xue, 2017: Storm-based probabilistic hail forecasting with machine learning applied to convection-allowing ensembles. Wea. Forecasting, 32, 1819-1840, https://doi.org/10.1175/ WAF-D-17-0010.1.\n\nI Goodfellow, Y Bengio, A Courville, Deep Learning. MIT Press775ppGoodfellow, I., Y. Bengio, and A. Courville, 2016: Deep Learning. MIT Press, 775 pp.\n\nMicrophysical and dynamical characteristics of low-precipitation and classic supercells. L D Grant, S C Van Den, Heever, 10.1175/JAS-D-13-0261.1J. Atmos. Sci. 71Grant, L. D., and S. C. van den Heever, 2014: Microphysical and dynamical characteristics of low-precipitation and classic supercells. J. Atmos. Sci., 71, 2604-2624, https://doi.org/ 10.1175/JAS-D-13-0261.1.\n\nThe regime dependence of optimally weighted ensemble model consensus forecasts of surface temperature. S Greybush, S Haupt, G Young, 10.1175/2008WAF2007078.1Wea. Forecasting. 23Greybush, S., S. Haupt, and G. Young, 2008: The regime de- pendence of optimally weighted ensemble model consensus forecasts of surface temperature. Wea. Forecasting, 23, 1146-1161, https://doi.org/10.1175/2008WAF2007078.1.\n\nA method for identifying midlatitude mesoscale convective systems in radar mosaics. Part I: Segmentation and classification. A M Haberlie, W S Ashley, 10.1175/JAMC-D-17-0293.1J. Appl. Meteor. Climatol. 57Haberlie, A. M., and W. S. Ashley, 2018: A method for identi- fying midlatitude mesoscale convective systems in radar mosaics. Part I: Segmentation and classification. J. Appl. Meteor. Climatol., 57, 1575-1598, https://doi.org/10.1175/ JAMC-D-17-0293.1.\n\nHail growth mechanisms in a Colorado storm: Part II: Hail formation processes. A J Heymsfield, A R Jameson, H W Frank, 10.1175/1520-0469(1980)037<1779:HGMIAC>2.0.CO;2J. Atmos. Sci. 371779:HGMIAC. 2.0.CO;2.Heymsfield, A. J., A. R. Jameson, and H. W. Frank, 1980: Hail growth mechanisms in a Colorado storm: Part II: Hail formation processes. J. Atmos. Sci., 37, 1779-1807, https://doi.org/10.1175/1520-0469(1980)037,1779:HGMIAC. 2.0.CO;2.\n\nBatch normalization: Accelerating deep network training by reducing internal covariate shift. S Ioffe, C Szegedy, Proc. 32nd Int. Conf. on Machine Learning. 32nd Int. Conf. on Machine LearningLille, France, PMLR37Ioffe, S., and C. Szegedy, 2015: Batch normalization: Accelerating deep network training by reducing internal covariate shift. Proc. 32nd Int. Conf. on Machine Learning, Vol. 37, Lille, France, PMLR, 448-456, http://proceedings.mlr.press/v37/ ioffe15.html.\n\nEvaluation of Alberta hail growth model using severe hail proximity soundings from the United States. R Jewell, J Brimelow, 10.1175/2009WAF2222230.1Wea. Forecasting. 24Jewell, R., and J. Brimelow, 2009: Evaluation of Alberta hail growth model using severe hail proximity soundings from the United States. Wea. Forecasting, 24, 1592-1609, https:// doi.org/10.1175/2009WAF2222230.1.\n\nEvaluation of sounding-derived thermodynamic and wind-related parameters associated with large hail events. A W Johnson, K E Sugden, Electron. J. Severe Storms Meteor. 95Johnson, A. W., and K. E. Sugden, 2014: Evaluation of sounding-derived thermodynamic and wind-related pa- rameters associated with large hail events. Electron. J. Severe Storms Meteor., 9 (5), http://www.ejssm.org/ojs/index.php/ ejssm/article/viewArticle/137.\n\nD P Kingma, J Ba, Adam: A method for stochastic optimization. Int. Conf. on Learning Representations. San Diego, CAKingma, D. P., and J. Ba, 2015: Adam: A method for stochastic optimization. Int. Conf. on Learning Representations, San Diego, CA, https://arxiv.org/abs/1412.6980.\n\nSelf-organized formation of topologically correct feature maps. T Kohonen, 10.1007/BF00337288Biol. Cybern. 43Kohonen, T., 1982: Self-organized formation of topologically cor- rect feature maps. Biol. Cybern., 43, 59-69, https://doi.org/ 10.1007/BF00337288.\n\nA Krizhevsky, I Sutskever, G Hinton, ImageNet classification with deep convolutional neural networks. Advances in Neural Information Processing Systems 25 (NIPS 2012. F. Pereira et al. Eds.Neural Information Processing Systems Foundation, Inc., 1097-1105Krizhevsky, A., I. Sutskever, and G. Hinton, 2012: ImageNet classification with deep convolutional neural networks. Ad- vances in Neural Information Processing Systems 25 (NIPS 2012), F. Pereira et al. Eds., Neural Information Processing Systems Foundation, Inc., 1097-1105, http://papers.nips.cc/ paper/4824-imagenet-classification-with-deep-convolutional- neural-networks.pdf.\n\nMachine learning for real-time prediction of damaging straight-line convective wind. R Lagerquist, A Mcgovern, T Smith, 10.1175/WAF-D-17-0038.1Wea. Forecasting. 32Lagerquist, R., A. McGovern, and T. Smith, 2017: Machine learning for real-time prediction of damaging straight-line convective wind. Wea. Forecasting, 32, 2175-2193, https:// doi.org/10.1175/WAF-D-17-0038.1.\n\nAn efficient, generalpurpose technique for identifying storm cells in geospatial images. V Lakshmanan, T Smith, ; K Hondl, R Rabin, 10.1175/2008JTECHA1153.1J. Atmos. Oceanic Technol. 26J. Atmos. Oceanic Technol.Lakshmanan, V., and T. Smith, 2009: Data mining storm attributes from spatial grids. J. Atmos. Oceanic Technol., 26, 2353-2365, https://doi.org/10.1175/2009JTECHA1257.1. --, K. Hondl, and R. Rabin, 2009: An efficient, general- purpose technique for identifying storm cells in geospatial images. J. Atmos. Oceanic Technol., 26, 523-537, https:// doi.org/10.1175/2008JTECHA1153.1.\n\nHandwritten digit recognition with a back-propagation network. Y Lecun, B E Boser, J S Denker, D Henderson, R Howard, W Hubbard, L Jackel, ; Y Bengio, G Hinton, 10.1038/nature14539Advances in Neural Information Processing. Systems, D. S. TouretzkyMorgan Kaufmann Publishers, Inc521Deep learningLeCun, Y., B. E. Boser, J. S. Denker, D. Henderson, R. Howard, W. Hubbard, and L. Jackel, 1990: Handwritten digit recogni- tion with a back-propagation network. Advances in Neural Information Processing Systems, D. S. Touretzky, Ed., Morgan Kaufmann Publishers, Inc., 396-404, http://papers.nips.cc/ paper/293-handwritten-digit-recognition-with-a-back-prop- agation-network.pdf. --, Y. Bengio, and G. Hinton, 2015: Deep learning. Nature, 521, 436-444, https://doi.org/10.1038/nature14539.\n\nHail in northeast Italy: Climatology and bivariate analysis with the sounding-derived indices. A Manzato, 10.1175/JAMC-D-10-05012.1J. Appl. Meteor. Climatol. 51Manzato, A., 2012: Hail in northeast Italy: Climatology and bi- variate analysis with the sounding-derived indices. J. Appl. Meteor. Climatol., 51, 449-467, https://doi.org/10.1175/JAMC- D-10-05012.1.\n\nA model for assessment of weather forecasts. I B Mason, Aust. Meteor. Mag. 30Mason, I. B., 1982: A model for assessment of weather forecasts. Aust. Meteor. Mag., 30, 291-303.\n\nEnhancing understanding and improving prediction of severe weather through spatiotemporal relational learning. A Mcgovern, D J Gagne, J K Williams, R A Brown, J B Basara, 10.1007/s10994-013-5343-xMach. Learn. 95McGovern, A., D. J. Gagne, J. K. Williams, R. A. Brown, and J. B. Basara, 2014: Enhancing understanding and improving pre- diction of severe weather through spatiotemporal relational learning. Mach. Learn., 95, 27-50, https://doi.org/10.1007/ s10994-013-5343-x.\n\nDevelopement of turbulence closure model for geophysical fluid problems. G L Mellor, T Yamada, 10.1029/RG020i004p00851Rev. Geophys. Space Phys. 20Mellor, G. L., and T. Yamada, 1982: Developement of turbu- lence closure model for geophysical fluid problems. Rev. Geophys. Space Phys., 20, 851-875, https://doi.org/10.1029/ RG020i004p00851.\n\nRadiative transfer for inhomogeneous atmospheres: RRTM, a validated correlated-k model for the longwave. E J Mlawer, S J Taubman, P D Brown, M J Iacono, S A Clough, 10.1029/97JD00237J. Geophys. Res. 102Mlawer, E. J., S. J. Taubman, P. D. Brown, M. J. Iacono, and S. A. Clough, 1997: Radiative transfer for inhomogeneous atmospheres: RRTM, a validated correlated-k model for the longwave. J. Geophys. Res., 102, 16 663-16 682, https:// doi.org/10.1029/97JD00237.\n\nComparison of two-moment bulk microphysics schemes in idealized supercell thunderstorm simulations. H Morrison, J Milbrandt, 10.1175/2010MWR3433.1Mon. Wea. Rev. 139Morrison, H., and J. Milbrandt, 2011: Comparison of two-moment bulk microphysics schemes in idealized supercell thunder- storm simulations. Mon. Wea. Rev., 139, 1103-1130, https:// doi.org/10.1175/2010MWR3433.1.\n\nA new vector partition of the probability score. A H Murphy, 10.1175/1520-0450(1973)012<0595:ANVPOT>2.0.CO;2J. Appl. Meteor. 12120595:ANVPOT.2.0.CO;2.Murphy, A. H., 1973: A new vector partition of the probability score. J. Appl. Meteor., 12, 595-600, https://doi.org/10.1175/ 1520-0450(1973)012,0595:ANVPOT.2.0.CO;2.\n\nThe hybrid multicellular-supercellular storm-An efficient hail producer. Part II: General characteristics and implications for hail growth. S P Nelson, 10.1175/1520-0469(1987)044<2060:THMSEH>2.0.CO;2J. Atmos. Sci. TIOSFS.2.0.CO4044J. Atmos. Sci.. 2060:THMSEH.2.0.CO;2.Nelson, S. P., 1983: The influence of storm flow structure on hail growth. J. Atmos. Sci., 40, 1965-1983, https://doi.org/10.1175/ 1520-0469(1983)040,1965:TIOSFS.2.0.CO;2. --, 1987: The hybrid multicellular-supercellular storm-An efficient hail producer. Part II: General characteristics and implications for hail growth. J. Atmos. Sci., 44, 2060-2073, https://doi.org/10.1175/ 1520-0469(1987)044,2060:THMSEH.2.0.CO;2.\n\nClassifying proximity soundings with self-organizing maps toward improving supercell and tornado forecasting. C J Nowotarski, A A Jensen, 10.1175/WAF-D-12-00125.1Wea. Forecasting. 28Nowotarski, C. J., and A. A. Jensen, 2013: Classifying proximity soundings with self-organizing maps toward improving su- percell and tornado forecasting. Wea. Forecasting, 28, 783- 801, https://doi.org/10.1175/WAF-D-12-00125.1.\n\nDeconvolution and checkerboard artifacts. Distill, accessed 15. A Odena, C V. Dumoulin, Olah, Odena, A., V. Dumoulin, and C. Olah, 2016: Deconvolution and checkerboard artifacts. Distill, accessed 15 July 2018, https:// distill.pub/2016/deconv-checkerboard/.\n\nFeature visualization: How neural networks build up their understanding of images. Distill, accessed 15. C Olah, A Mordvintsev, L Schubert, Olah, C., A. Mordvintsev, and L. Schubert, 2017: Feature visu- alization: How neural networks build up their understanding of images. Distill, accessed 15 July 2018, https://distill.pub/ 2017/feature-visualization/.\n\nOn lines and planes of closest fit to systems of points in space. K Pearson, 10.1080/14786440109462720Philos. Mag. 2Pearson, K., 1901: On lines and planes of closest fit to systems of points in space. Philos. Mag., 2, 559-572, https://doi.org/ 10.1080/14786440109462720.\n\nScikit-learn: Machine Learning in Python. F Pedregosa, Coauthors , J. Mach. Learn. Res. 12Pedregosa, F., and Coauthors, 2011: Scikit-learn: Machine Learn- ing in Python. J. Mach. Learn. Res., 12, 2825-2830.\n\nProximity soundings of severe and nonsevere thunderstorms in central. T Pú Cik, P Groenemeijer, D Rýva, M Kolá, 10.1175/MWR-D-15-0104.1Europe. Mon. Wea. Rev. 143Pú cik, T., P. Groenemeijer, D. Rýva, and M. Kolá r, 2015: Prox- imity soundings of severe and nonsevere thunderstorms in central Europe. Mon. Wea. Rev., 143, 4805-4821, https:// doi.org/10.1175/MWR-D-15-0104.1.\n\nMelting and shedding of graupel and hail. Part I: Model physics. R M Rasmussen, A J Heymsfield, 10.1175/1520-0469(1987)044<2754:MASOGA>2.0.CO;2J. Atmos. Sci. 442754: MASOGA.2.0.CO;2.Rasmussen, R. M., and A. J. Heymsfield, 1987: Melting and shed- ding of graupel and hail. Part I: Model physics. J. Atmos. Sci., 44, 2754-2763, https://doi.org/10.1175/1520-0469(1987)044,2754: MASOGA.2.0.CO;2.\n\nClimatic pattern analysis of threeand seven-day summer rainfall in the central United States: Some methodological considerations and a regionalization. M B. ; P J Richman, Lamb, 10.1175/1520-0450(1985)024<1325:CPAOTA>2.0.CO;21175/1520-0450(1985)024,1325:CPAOTA.2.0.CO;2J. Climate Appl. Meteor. 6Int. J. Climatol.Richman, M. B., 1986: Rotation of principal components. Int. J. Climatol., 6, 293-335, https://doi.org/10.1002/joc.3370060305. --, 1993: Comments on ''The effect of domain shape on principal components analysis.'' Int. J. Climatol., 13, 203-218, https:// doi.org/10.1002/joc.3370130206. --, and P. J. Lamb, 1985: Climatic pattern analysis of three- and seven-day summer rainfall in the central United States: Some methodological considerations and a regionalization. J. Climate Appl. Meteor., 24, 1325-1343, https://doi.org/ 10.1175/1520-0450(1985)024,1325:CPAOTA.2.0.CO;2.\n\nVisualizing multiple measures of forecast quality. P J Roebber, 10.1175/2008WAF2222159.1Wea. Forecasting. 24Roebber, P. J., 2009: Visualizing multiple measures of fore- cast quality. Wea. Forecasting, 24, 601-608, https://doi.org/ 10.1175/2008WAF2222159.1.\n\nNCAR's experimental real-time convectionallowing ensemble prediction system. C S Schwartz, G S Romine, R A Sobash, K Fossell, M L Weisman, 10.1175/WAF-D-15-0103.1Wea. Forecasting. 30Schwartz, C. S., G. S. Romine, R. A. Sobash, K. Fossell, and M. L. Weisman, 2015: NCAR's experimental real-time convection- allowing ensemble prediction system. Wea. Forecasting, 30, 1645-1654, https://doi.org/10.1175/WAF-D-15-0103.1.\n\nK Simoyan, A Vedaldi, A Zisserman, Deep inside convolutional networks: Visualising image classification models and saliency maps. Int. Conf. on Learning Representations Workshop. Banff, CanadaSimoyan, K., A. Vedaldi, and A. Zisserman, 2014: Deep inside con- volutional networks: Visualising image classification models and saliency maps. Int. Conf. on Learning Representations Workshop, Banff, Canada, https://arxiv.org/abs/1312.6034.\n\nA time-split nonhydrostatic atmospheric model for weather research and forecasting applications. W C Skamarock, J B Klemp, 10.1016/j.jcp.2007.01.037J. Comput. Phys. 227Skamarock, W. C., and J. B. Klemp, 2008: A time-split non- hydrostatic atmospheric model for weather research and forecasting applications. J. Comput. Phys., 227, 3465-3485, https://doi.org/10.1016/j.jcp.2007.01.037.\n\nDropout: A simple way to prevent neural networks from overfitting. N Srivastava, G Hinton, A Krizhevsky, I Sutskever, R Salakhutdinov, J. Mach. Learn. Res. 15Srivastava, N., G. Hinton, A. Krizhevsky, I. Sutskever, and R. Salakhutdinov, 2014: Dropout: A simple way to prevent neural networks from overfitting. J. Mach. Learn. Res., 15, 1929-1958.\n\nStorm Prediction Center WCM Page. NOAA. Storm Prediction CenterStorm Prediction Center, 2019: Storm Prediction Center WCM Page. NOAA, accessed 1 February 2019, https:// www.spc.noaa.gov/wcm/.\n\nExplicit forecasts of winter precipitation using an improved bulk microphysics scheme. Part II: Implementation of a new snow parameterization. G Thompson, T M Eidhammer ; R, K Rasmussen, Manning, 10.1175/2008MWR2387.1J. Atmos. Sci. P. R. Field, R. M. Rasmussen, and W. D. Hall71Mon. Wea. Rev.Thompson, G., and T. Eidhammer, 2014: A study of aerosol im- pacts on clouds and precipitation development in a large winter cyclone. J. Atmos. Sci., 71, 3636-3658, https://doi.org/ 10.1175/JAS-D-13-0305.1. --, R. M. Rasmussen, and K. Manning, 2004: Explicit forecasts of winter precipitation using an improved bulk microphysics scheme. Part I: Description and sensitivity analysis. Mon. Wea. Rev., 132, 519-542, https://doi.org/10.1175/1520-0493(2004) 132,0519:EFOWPU.2.0.CO;2. --, P. R. Field, R. M. Rasmussen, and W. D. Hall, 2008: Explicit forecasts of winter precipitation using an improved bulk mi- crophysics scheme. Part II: Implementation of a new snow parameterization. Mon. Wea. Rev., 136, 5095-5115, https:// doi.org/10.1175/2008MWR2387.1.\n\nRegression shrinkage and selection via the lasso. R Tibshirani, J. Roy. Stat. Soc. B. 58Tibshirani, R., 1996: Regression shrinkage and selection via the lasso. J. Roy. Stat. Soc. B, 58, 267-288.\n\nD S Wilks, . ; G A G N E E T A L, Statistical Methods in the Atmospheric Sciences. Academic Press1003rd ed.Wilks, D. S., 2011: Statistical Methods in the Atmospheric Sciences. 3rd ed. International Geophysics Series, Vol. 100, Academic Press, 704 pp. AUGUST 2019 G A G N E E T A L .\n", "annotations": {"author": "[{\"end\":151,\"start\":73},{\"end\":226,\"start\":152},{\"end\":305,\"start\":227},{\"end\":381,\"start\":306}]", "publisher": null, "author_last_name": "[{\"end\":92,\"start\":84},{\"end\":167,\"start\":162},{\"end\":246,\"start\":240},{\"end\":322,\"start\":314}]", "author_first_name": "[{\"end\":78,\"start\":73},{\"end\":83,\"start\":79},{\"end\":155,\"start\":152},{\"end\":161,\"start\":156},{\"end\":237,\"start\":230},{\"end\":239,\"start\":238},{\"end\":313,\"start\":306}]", "author_affiliation": "[{\"end\":150,\"start\":94},{\"end\":225,\"start\":169},{\"end\":304,\"start\":248},{\"end\":380,\"start\":324}]", "title": "[{\"end\":70,\"start\":1},{\"end\":451,\"start\":382}]", "venue": null, "abstract": "[{\"end\":2178,\"start\":540}]", "bib_ref": "[{\"attributes\":{\"ref_id\":\"b17\"},\"end\":2347,\"start\":2335},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":2848,\"start\":2821},{\"attributes\":{\"ref_id\":\"b34\"},\"end\":2959,\"start\":2945},{\"attributes\":{\"ref_id\":\"b27\"},\"end\":3159,\"start\":3134},{\"attributes\":{\"ref_id\":\"b47\"},\"end\":3184,\"start\":3164},{\"attributes\":{\"ref_id\":\"b6\"},\"end\":3411,\"start\":3390},{\"end\":3434,\"start\":3411},{\"attributes\":{\"ref_id\":\"b26\"},\"end\":3458,\"start\":3434},{\"attributes\":{\"ref_id\":\"b26\"},\"end\":3829,\"start\":3804},{\"end\":3899,\"start\":3874},{\"attributes\":{\"ref_id\":\"b41\"},\"end\":4318,\"start\":4306},{\"attributes\":{\"ref_id\":\"b17\"},\"end\":4329,\"start\":4318},{\"attributes\":{\"ref_id\":\"b21\"},\"end\":4619,\"start\":4588},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":4858,\"start\":4833},{\"attributes\":{\"ref_id\":\"b32\"},\"end\":6271,\"start\":6244},{\"end\":6400,\"start\":6381},{\"attributes\":{\"ref_id\":\"b31\"},\"end\":6429,\"start\":6405},{\"attributes\":{\"ref_id\":\"b36\"},\"end\":6908,\"start\":6886},{\"attributes\":{\"ref_id\":\"b23\"},\"end\":7303,\"start\":7277},{\"end\":7522,\"start\":7504},{\"attributes\":{\"ref_id\":\"b31\"},\"end\":7544,\"start\":7522},{\"end\":7992,\"start\":7991},{\"attributes\":{\"ref_id\":\"b45\"},\"end\":8005,\"start\":7992},{\"attributes\":{\"ref_id\":\"b22\"},\"end\":8346,\"start\":8325},{\"attributes\":{\"ref_id\":\"b29\"},\"end\":8388,\"start\":8376},{\"attributes\":{\"ref_id\":\"b42\"},\"end\":8567,\"start\":8539},{\"attributes\":{\"ref_id\":\"b8\"},\"end\":9575,\"start\":9564},{\"end\":9588,\"start\":9575},{\"attributes\":{\"ref_id\":\"b49\"},\"end\":9610,\"start\":9588},{\"attributes\":{\"ref_id\":\"b49\"},\"end\":9623,\"start\":9610},{\"attributes\":{\"ref_id\":\"b33\"},\"end\":9667,\"start\":9648},{\"attributes\":{\"ref_id\":\"b30\"},\"end\":10689,\"start\":10666},{\"attributes\":{\"ref_id\":\"b51\"},\"end\":11889,\"start\":11867},{\"attributes\":{\"ref_id\":\"b53\"},\"end\":11964,\"start\":11939},{\"attributes\":{\"ref_id\":\"b56\"},\"end\":12139,\"start\":12118},{\"attributes\":{\"ref_id\":\"b56\"},\"end\":12162,\"start\":12139},{\"attributes\":{\"ref_id\":\"b56\"},\"end\":12190,\"start\":12162},{\"attributes\":{\"ref_id\":\"b37\"},\"end\":12258,\"start\":12234},{\"attributes\":{\"ref_id\":\"b11\"},\"end\":12306,\"start\":12284},{\"attributes\":{\"ref_id\":\"b38\"},\"end\":12359,\"start\":12339},{\"attributes\":{\"ref_id\":\"b41\"},\"end\":13233,\"start\":13220},{\"attributes\":{\"ref_id\":\"b32\"},\"end\":13681,\"start\":13657},{\"end\":13699,\"start\":13681},{\"attributes\":{\"ref_id\":\"b56\"},\"end\":16889,\"start\":16868},{\"attributes\":{\"ref_id\":\"b56\"},\"end\":16912,\"start\":16889},{\"attributes\":{\"ref_id\":\"b56\"},\"end\":17195,\"start\":17173},{\"attributes\":{\"ref_id\":\"b39\"},\"end\":17442,\"start\":17413},{\"attributes\":{\"ref_id\":\"b58\"},\"end\":19716,\"start\":19704},{\"attributes\":{\"ref_id\":\"b50\"},\"end\":20043,\"start\":20030},{\"attributes\":{\"ref_id\":\"b46\"},\"end\":21474,\"start\":21453},{\"attributes\":{\"ref_id\":\"b57\"},\"end\":21553,\"start\":21536},{\"attributes\":{\"ref_id\":\"b33\"},\"end\":22299,\"start\":22281},{\"attributes\":{\"ref_id\":\"b12\"},\"end\":22717,\"start\":22696},{\"attributes\":{\"ref_id\":\"b0\"},\"end\":22775,\"start\":22756},{\"attributes\":{\"ref_id\":\"b33\"},\"end\":23407,\"start\":23388},{\"attributes\":{\"ref_id\":\"b20\"},\"end\":25890,\"start\":25867},{\"attributes\":{\"ref_id\":\"b54\"},\"end\":26191,\"start\":26167},{\"attributes\":{\"ref_id\":\"b20\"},\"end\":27243,\"start\":27219},{\"attributes\":{\"ref_id\":\"b25\"},\"end\":27289,\"start\":27265},{\"attributes\":{\"ref_id\":\"b28\"},\"end\":28326,\"start\":28306},{\"attributes\":{\"ref_id\":\"b35\"},\"end\":32684,\"start\":32672},{\"attributes\":{\"ref_id\":\"b40\"},\"end\":32761,\"start\":32748},{\"attributes\":{\"ref_id\":\"b35\"},\"end\":35343,\"start\":35332},{\"attributes\":{\"ref_id\":\"b50\"},\"end\":36713,\"start\":36700},{\"attributes\":{\"ref_id\":\"b5\"},\"end\":39487,\"start\":39474},{\"end\":40593,\"start\":40587},{\"attributes\":{\"ref_id\":\"b44\"},\"end\":41648,\"start\":41630},{\"attributes\":{\"ref_id\":\"b52\"},\"end\":43558,\"start\":43538},{\"attributes\":{\"ref_id\":\"b43\"},\"end\":43751,\"start\":43732},{\"end\":45913,\"start\":45907},{\"attributes\":{\"ref_id\":\"b48\"},\"end\":47270,\"start\":47239},{\"attributes\":{\"ref_id\":\"b41\"},\"end\":47369,\"start\":47356},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":47520,\"start\":47495},{\"attributes\":{\"ref_id\":\"b24\"},\"end\":47902,\"start\":47878},{\"end\":48620,\"start\":48613},{\"end\":50556,\"start\":50549},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":51145,\"start\":51120},{\"attributes\":{\"ref_id\":\"b13\"},\"end\":51574,\"start\":51552},{\"attributes\":{\"ref_id\":\"b3\"},\"end\":51603,\"start\":51579},{\"end\":51972,\"start\":51958},{\"end\":55790,\"start\":55778},{\"end\":56373,\"start\":56366},{\"attributes\":{\"ref_id\":\"b49\"},\"end\":56548,\"start\":56535},{\"end\":56937,\"start\":56920}]", "figure": "[{\"attributes\":{\"id\":\"fig_0\"},\"end\":60092,\"start\":59679},{\"attributes\":{\"id\":\"fig_1\"},\"end\":61200,\"start\":60093},{\"attributes\":{\"id\":\"fig_2\"},\"end\":61497,\"start\":61201},{\"attributes\":{\"id\":\"tab_0\",\"type\":\"table\"},\"end\":62337,\"start\":61498},{\"attributes\":{\"id\":\"tab_1\",\"type\":\"table\"},\"end\":62884,\"start\":62338},{\"attributes\":{\"id\":\"tab_2\",\"type\":\"table\"},\"end\":63349,\"start\":62885}]", "paragraph": "[{\"end\":4147,\"start\":2194},{\"end\":5642,\"start\":4149},{\"end\":6909,\"start\":5644},{\"end\":7745,\"start\":6911},{\"end\":9624,\"start\":7747},{\"end\":10851,\"start\":9626},{\"end\":11707,\"start\":10853},{\"end\":12704,\"start\":11746},{\"end\":13503,\"start\":12706},{\"end\":14816,\"start\":13505},{\"end\":16502,\"start\":14844},{\"end\":17443,\"start\":16504},{\"end\":20045,\"start\":17445},{\"end\":21367,\"start\":20076},{\"end\":22191,\"start\":21369},{\"end\":22776,\"start\":22193},{\"end\":25588,\"start\":22778},{\"end\":27460,\"start\":25590},{\"end\":28699,\"start\":27462},{\"end\":29636,\"start\":28701},{\"end\":29998,\"start\":29638},{\"end\":30467,\"start\":30031},{\"end\":32497,\"start\":30469},{\"end\":32783,\"start\":32531},{\"end\":36074,\"start\":32866},{\"end\":36677,\"start\":36076},{\"end\":38078,\"start\":36679},{\"end\":38735,\"start\":38080},{\"end\":39829,\"start\":38777},{\"end\":41492,\"start\":39831},{\"end\":42371,\"start\":41494},{\"end\":43023,\"start\":42396},{\"end\":43138,\"start\":43025},{\"end\":43560,\"start\":43140},{\"end\":44162,\"start\":43562},{\"end\":44742,\"start\":44164},{\"end\":45361,\"start\":44744},{\"end\":46142,\"start\":45363},{\"end\":47521,\"start\":46144},{\"end\":48206,\"start\":47523},{\"end\":49055,\"start\":48208},{\"end\":49088,\"start\":49057},{\"end\":50773,\"start\":49090},{\"end\":52394,\"start\":50775},{\"end\":52760,\"start\":52427},{\"end\":54167,\"start\":52775},{\"end\":55574,\"start\":54169},{\"end\":56689,\"start\":55576},{\"end\":57874,\"start\":56691},{\"end\":59368,\"start\":57890},{\"end\":59678,\"start\":59370}]", "formula": "[{\"attributes\":{\"id\":\"formula_0\"},\"end\":14843,\"start\":14817},{\"attributes\":{\"id\":\"formula_2\"},\"end\":30030,\"start\":29999},{\"attributes\":{\"id\":\"formula_3\"},\"end\":32865,\"start\":32784},{\"attributes\":{\"id\":\"formula_4\"},\"end\":42395,\"start\":42372},{\"attributes\":{\"id\":\"formula_5\"},\"end\":52426,\"start\":52395}]", "table_ref": "[{\"attributes\":{\"ref_id\":\"tab_0\"},\"end\":12966,\"start\":12959},{\"attributes\":{\"ref_id\":\"tab_0\"},\"end\":14533,\"start\":14524},{\"attributes\":{\"ref_id\":\"tab_1\"},\"end\":33695,\"start\":33688},{\"attributes\":{\"ref_id\":\"tab_1\"},\"end\":36237,\"start\":36229},{\"attributes\":{\"ref_id\":\"tab_2\"},\"end\":37429,\"start\":37422}]", "section_header": "[{\"attributes\":{\"n\":\"1.\"},\"end\":2192,\"start\":2180},{\"attributes\":{\"n\":\"2.\"},\"end\":11726,\"start\":11710},{\"end\":11744,\"start\":11729},{\"end\":20074,\"start\":20048},{\"attributes\":{\"n\":\"3.\"},\"end\":32529,\"start\":32500},{\"attributes\":{\"n\":\"4.\"},\"end\":38775,\"start\":38738},{\"attributes\":{\"n\":\"5.\"},\"end\":52773,\"start\":52763},{\"attributes\":{\"n\":\"6.\"},\"end\":57888,\"start\":57877},{\"end\":59688,\"start\":59680},{\"end\":60102,\"start\":60094},{\"end\":61210,\"start\":61202},{\"end\":61508,\"start\":61499},{\"end\":62348,\"start\":62339},{\"end\":62895,\"start\":62886}]", "table": "[{\"end\":62337,\"start\":61651},{\"end\":62884,\"start\":62724},{\"end\":63349,\"start\":63174}]", "figure_caption": "[{\"end\":60092,\"start\":59690},{\"end\":61200,\"start\":60104},{\"end\":61497,\"start\":61212},{\"end\":61651,\"start\":61510},{\"end\":62724,\"start\":62350},{\"end\":63174,\"start\":62897}]", "figure_ref": "[{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":18790,\"start\":18782},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":19378,\"start\":19370},{\"end\":23606,\"start\":23598},{\"end\":24598,\"start\":24590},{\"end\":25300,\"start\":25294},{\"end\":27525,\"start\":27519},{\"attributes\":{\"ref_id\":\"fig_1\"},\"end\":34293,\"start\":34285},{\"attributes\":{\"ref_id\":\"fig_1\"},\"end\":34624,\"start\":34616},{\"end\":36277,\"start\":36269},{\"end\":36940,\"start\":36934},{\"attributes\":{\"ref_id\":\"fig_2\"},\"end\":39877,\"start\":39871},{\"end\":44412,\"start\":44405},{\"end\":44808,\"start\":44800},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":45463,\"start\":45456},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":45555,\"start\":45548},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":47651,\"start\":47644},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":48582,\"start\":48573},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":50187,\"start\":50180},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":50218,\"start\":50209},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":50237,\"start\":50228},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":52092,\"start\":52085},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":54228,\"start\":54221},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":56501,\"start\":56494}]", "bib_author_first_name": "[{\"end\":64539,\"start\":64538},{\"end\":64556,\"start\":64547},{\"end\":65073,\"start\":65072},{\"end\":65075,\"start\":65074},{\"end\":65090,\"start\":65089},{\"end\":65092,\"start\":65091},{\"end\":65340,\"start\":65337},{\"end\":65347,\"start\":65346},{\"end\":65349,\"start\":65348},{\"end\":65358,\"start\":65357},{\"end\":65360,\"start\":65359},{\"end\":65370,\"start\":65369},{\"end\":65372,\"start\":65371},{\"end\":65382,\"start\":65381},{\"end\":65384,\"start\":65383},{\"end\":65785,\"start\":65784},{\"end\":65787,\"start\":65786},{\"end\":65796,\"start\":65795},{\"end\":65798,\"start\":65797},{\"end\":66207,\"start\":66206},{\"end\":66209,\"start\":66208},{\"end\":66226,\"start\":66225},{\"end\":66228,\"start\":66227},{\"end\":66242,\"start\":66241},{\"end\":66244,\"start\":66243},{\"end\":66256,\"start\":66255},{\"end\":66258,\"start\":66257},{\"end\":66560,\"start\":66559},{\"end\":66764,\"start\":66763},{\"end\":66766,\"start\":66765},{\"end\":66778,\"start\":66777},{\"end\":66780,\"start\":66779},{\"end\":66790,\"start\":66789},{\"end\":66792,\"start\":66791},{\"end\":67004,\"start\":67003},{\"end\":67006,\"start\":67005},{\"end\":67446,\"start\":67445},{\"end\":67448,\"start\":67447},{\"end\":68205,\"start\":68204},{\"end\":68207,\"start\":68206},{\"end\":68216,\"start\":68215},{\"end\":68218,\"start\":68217},{\"end\":68613,\"start\":68612},{\"end\":68621,\"start\":68620},{\"end\":69051,\"start\":69050},{\"end\":69070,\"start\":69061},{\"end\":69272,\"start\":69271},{\"end\":69274,\"start\":69273},{\"end\":69286,\"start\":69285},{\"end\":69288,\"start\":69287},{\"end\":69297,\"start\":69296},{\"end\":69311,\"start\":69310},{\"end\":69313,\"start\":69312},{\"end\":69323,\"start\":69322},{\"end\":69325,\"start\":69324},{\"end\":70057,\"start\":70056},{\"end\":70059,\"start\":70058},{\"end\":70069,\"start\":70068},{\"end\":70071,\"start\":70070},{\"end\":70432,\"start\":70431},{\"end\":70443,\"start\":70442},{\"end\":70445,\"start\":70444},{\"end\":70874,\"start\":70873},{\"end\":70876,\"start\":70875},{\"end\":71284,\"start\":71283},{\"end\":71286,\"start\":71285},{\"end\":71811,\"start\":71809},{\"end\":71815,\"start\":71814},{\"end\":71827,\"start\":71826},{\"end\":71829,\"start\":71828},{\"end\":71838,\"start\":71837},{\"end\":71840,\"start\":71839},{\"end\":71850,\"start\":71849},{\"end\":71852,\"start\":71851},{\"end\":71864,\"start\":71863},{\"end\":72175,\"start\":72174},{\"end\":72189,\"start\":72188},{\"end\":72199,\"start\":72198},{\"end\":72416,\"start\":72415},{\"end\":72418,\"start\":72417},{\"end\":72427,\"start\":72426},{\"end\":72429,\"start\":72428},{\"end\":72800,\"start\":72799},{\"end\":72812,\"start\":72811},{\"end\":72821,\"start\":72820},{\"end\":73224,\"start\":73223},{\"end\":73226,\"start\":73225},{\"end\":73238,\"start\":73237},{\"end\":73240,\"start\":73239},{\"end\":73637,\"start\":73636},{\"end\":73639,\"start\":73638},{\"end\":73653,\"start\":73652},{\"end\":73655,\"start\":73654},{\"end\":73666,\"start\":73665},{\"end\":73668,\"start\":73667},{\"end\":74091,\"start\":74090},{\"end\":74100,\"start\":74099},{\"end\":74570,\"start\":74569},{\"end\":74580,\"start\":74579},{\"end\":74958,\"start\":74957},{\"end\":74960,\"start\":74959},{\"end\":74971,\"start\":74970},{\"end\":74973,\"start\":74972},{\"end\":75281,\"start\":75280},{\"end\":75283,\"start\":75282},{\"end\":75293,\"start\":75292},{\"end\":75625,\"start\":75624},{\"end\":75819,\"start\":75818},{\"end\":75833,\"start\":75832},{\"end\":75846,\"start\":75845},{\"end\":76538,\"start\":76537},{\"end\":76552,\"start\":76551},{\"end\":76564,\"start\":76563},{\"end\":76915,\"start\":76914},{\"end\":76929,\"start\":76928},{\"end\":76940,\"start\":76937},{\"end\":76949,\"start\":76948},{\"end\":77480,\"start\":77479},{\"end\":77489,\"start\":77488},{\"end\":77491,\"start\":77490},{\"end\":77500,\"start\":77499},{\"end\":77502,\"start\":77501},{\"end\":77512,\"start\":77511},{\"end\":77525,\"start\":77524},{\"end\":77535,\"start\":77534},{\"end\":77546,\"start\":77545},{\"end\":77558,\"start\":77555},{\"end\":77568,\"start\":77567},{\"end\":78296,\"start\":78295},{\"end\":78608,\"start\":78607},{\"end\":78610,\"start\":78609},{\"end\":78850,\"start\":78849},{\"end\":78862,\"start\":78861},{\"end\":78864,\"start\":78863},{\"end\":78873,\"start\":78872},{\"end\":78875,\"start\":78874},{\"end\":78887,\"start\":78886},{\"end\":78889,\"start\":78888},{\"end\":78898,\"start\":78897},{\"end\":78900,\"start\":78899},{\"end\":79286,\"start\":79285},{\"end\":79288,\"start\":79287},{\"end\":79298,\"start\":79297},{\"end\":79658,\"start\":79657},{\"end\":79660,\"start\":79659},{\"end\":79670,\"start\":79669},{\"end\":79672,\"start\":79671},{\"end\":79683,\"start\":79682},{\"end\":79685,\"start\":79684},{\"end\":79694,\"start\":79693},{\"end\":79696,\"start\":79695},{\"end\":79706,\"start\":79705},{\"end\":79708,\"start\":79707},{\"end\":80116,\"start\":80115},{\"end\":80128,\"start\":80127},{\"end\":80442,\"start\":80441},{\"end\":80444,\"start\":80443},{\"end\":80851,\"start\":80850},{\"end\":80853,\"start\":80852},{\"end\":81509,\"start\":81508},{\"end\":81511,\"start\":81510},{\"end\":81525,\"start\":81524},{\"end\":81527,\"start\":81526},{\"end\":81875,\"start\":81874},{\"end\":81884,\"start\":81883},{\"end\":82176,\"start\":82175},{\"end\":82184,\"start\":82183},{\"end\":82199,\"start\":82198},{\"end\":82494,\"start\":82493},{\"end\":82742,\"start\":82741},{\"end\":82763,\"start\":82754},{\"end\":82978,\"start\":82977},{\"end\":82988,\"start\":82987},{\"end\":83004,\"start\":83003},{\"end\":83012,\"start\":83011},{\"end\":83347,\"start\":83346},{\"end\":83349,\"start\":83348},{\"end\":83362,\"start\":83361},{\"end\":83364,\"start\":83363},{\"end\":83827,\"start\":83826},{\"end\":83836,\"start\":83828},{\"end\":84613,\"start\":84612},{\"end\":84615,\"start\":84614},{\"end\":84897,\"start\":84896},{\"end\":84899,\"start\":84898},{\"end\":84911,\"start\":84910},{\"end\":84913,\"start\":84912},{\"end\":84923,\"start\":84922},{\"end\":84925,\"start\":84924},{\"end\":84935,\"start\":84934},{\"end\":84946,\"start\":84945},{\"end\":84948,\"start\":84947},{\"end\":85238,\"start\":85237},{\"end\":85249,\"start\":85248},{\"end\":85260,\"start\":85259},{\"end\":85771,\"start\":85770},{\"end\":85773,\"start\":85772},{\"end\":85786,\"start\":85785},{\"end\":85788,\"start\":85787},{\"end\":86127,\"start\":86126},{\"end\":86141,\"start\":86140},{\"end\":86151,\"start\":86150},{\"end\":86165,\"start\":86164},{\"end\":86178,\"start\":86177},{\"end\":86743,\"start\":86742},{\"end\":86755,\"start\":86754},{\"end\":86757,\"start\":86756},{\"end\":86774,\"start\":86773},{\"end\":87695,\"start\":87694},{\"end\":87841,\"start\":87840},{\"end\":87843,\"start\":87842}]", "bib_author_last_name": "[{\"end\":64545,\"start\":64540},{\"end\":65087,\"start\":65076},{\"end\":65100,\"start\":65093},{\"end\":65330,\"start\":65327},{\"end\":65335,\"start\":65332},{\"end\":65344,\"start\":65341},{\"end\":65355,\"start\":65350},{\"end\":65367,\"start\":65361},{\"end\":65379,\"start\":65373},{\"end\":65390,\"start\":65385},{\"end\":65399,\"start\":65392},{\"end\":65793,\"start\":65788},{\"end\":65826,\"start\":65799},{\"end\":66223,\"start\":66210},{\"end\":66239,\"start\":66229},{\"end\":66253,\"start\":66245},{\"end\":66264,\"start\":66259},{\"end\":66568,\"start\":66561},{\"end\":66775,\"start\":66767},{\"end\":66787,\"start\":66781},{\"end\":66800,\"start\":66793},{\"end\":67001,\"start\":66998},{\"end\":67031,\"start\":67007},{\"end\":67039,\"start\":67033},{\"end\":67454,\"start\":67449},{\"end\":68213,\"start\":68208},{\"end\":68227,\"start\":68219},{\"end\":68618,\"start\":68614},{\"end\":68628,\"start\":68622},{\"end\":69059,\"start\":69052},{\"end\":69283,\"start\":69275},{\"end\":69294,\"start\":69289},{\"end\":69308,\"start\":69298},{\"end\":69320,\"start\":69314},{\"end\":69332,\"start\":69326},{\"end\":70066,\"start\":70060},{\"end\":70079,\"start\":70072},{\"end\":70440,\"start\":70433},{\"end\":70454,\"start\":70446},{\"end\":70628,\"start\":70625},{\"end\":70641,\"start\":70630},{\"end\":70882,\"start\":70877},{\"end\":71292,\"start\":71287},{\"end\":71824,\"start\":71816},{\"end\":71835,\"start\":71830},{\"end\":71847,\"start\":71841},{\"end\":71861,\"start\":71853},{\"end\":71868,\"start\":71865},{\"end\":72186,\"start\":72176},{\"end\":72196,\"start\":72190},{\"end\":72209,\"start\":72200},{\"end\":72424,\"start\":72419},{\"end\":72437,\"start\":72430},{\"end\":72445,\"start\":72439},{\"end\":72809,\"start\":72801},{\"end\":72818,\"start\":72813},{\"end\":72827,\"start\":72822},{\"end\":73235,\"start\":73227},{\"end\":73247,\"start\":73241},{\"end\":73650,\"start\":73640},{\"end\":73663,\"start\":73656},{\"end\":73674,\"start\":73669},{\"end\":74097,\"start\":74092},{\"end\":74108,\"start\":74101},{\"end\":74577,\"start\":74571},{\"end\":74589,\"start\":74581},{\"end\":74968,\"start\":74961},{\"end\":74980,\"start\":74974},{\"end\":75290,\"start\":75284},{\"end\":75296,\"start\":75294},{\"end\":75633,\"start\":75626},{\"end\":75830,\"start\":75820},{\"end\":75843,\"start\":75834},{\"end\":75853,\"start\":75847},{\"end\":76549,\"start\":76539},{\"end\":76561,\"start\":76553},{\"end\":76570,\"start\":76565},{\"end\":76926,\"start\":76916},{\"end\":76935,\"start\":76930},{\"end\":76946,\"start\":76941},{\"end\":76955,\"start\":76950},{\"end\":77486,\"start\":77481},{\"end\":77497,\"start\":77492},{\"end\":77509,\"start\":77503},{\"end\":77522,\"start\":77513},{\"end\":77532,\"start\":77526},{\"end\":77543,\"start\":77536},{\"end\":77553,\"start\":77547},{\"end\":77565,\"start\":77559},{\"end\":77575,\"start\":77569},{\"end\":78304,\"start\":78297},{\"end\":78616,\"start\":78611},{\"end\":78859,\"start\":78851},{\"end\":78870,\"start\":78865},{\"end\":78884,\"start\":78876},{\"end\":78895,\"start\":78890},{\"end\":78907,\"start\":78901},{\"end\":79295,\"start\":79289},{\"end\":79305,\"start\":79299},{\"end\":79667,\"start\":79661},{\"end\":79680,\"start\":79673},{\"end\":79691,\"start\":79686},{\"end\":79703,\"start\":79697},{\"end\":79715,\"start\":79709},{\"end\":80125,\"start\":80117},{\"end\":80138,\"start\":80129},{\"end\":80451,\"start\":80445},{\"end\":80860,\"start\":80854},{\"end\":81522,\"start\":81512},{\"end\":81534,\"start\":81528},{\"end\":81881,\"start\":81876},{\"end\":81896,\"start\":81885},{\"end\":81902,\"start\":81898},{\"end\":82181,\"start\":82177},{\"end\":82196,\"start\":82185},{\"end\":82208,\"start\":82200},{\"end\":82502,\"start\":82495},{\"end\":82752,\"start\":82743},{\"end\":82985,\"start\":82979},{\"end\":83001,\"start\":82989},{\"end\":83009,\"start\":83005},{\"end\":83017,\"start\":83013},{\"end\":83359,\"start\":83350},{\"end\":83375,\"start\":83365},{\"end\":83844,\"start\":83837},{\"end\":83850,\"start\":83846},{\"end\":84623,\"start\":84616},{\"end\":84908,\"start\":84900},{\"end\":84920,\"start\":84914},{\"end\":84932,\"start\":84926},{\"end\":84943,\"start\":84936},{\"end\":84956,\"start\":84949},{\"end\":85246,\"start\":85239},{\"end\":85257,\"start\":85250},{\"end\":85270,\"start\":85261},{\"end\":85783,\"start\":85774},{\"end\":85794,\"start\":85789},{\"end\":86138,\"start\":86128},{\"end\":86148,\"start\":86142},{\"end\":86162,\"start\":86152},{\"end\":86175,\"start\":86166},{\"end\":86192,\"start\":86179},{\"end\":86752,\"start\":86744},{\"end\":86771,\"start\":86758},{\"end\":86784,\"start\":86775},{\"end\":86793,\"start\":86786},{\"end\":87706,\"start\":87696},{\"end\":87849,\"start\":87844},{\"end\":87872,\"start\":87851}]", "bib_entry": "[{\"attributes\":{\"id\":\"b0\"},\"end\":64999,\"start\":64484},{\"attributes\":{\"id\":\"b1\"},\"end\":65217,\"start\":65001},{\"attributes\":{\"doi\":\"10.1175/WAF-D-18-0024.1\",\"id\":\"b2\",\"matched_paper_id\":125184207},\"end\":65782,\"start\":65219},{\"attributes\":{\"id\":\"b3\"},\"end\":66124,\"start\":65784},{\"attributes\":{\"doi\":\"10.1175/WAF-D-17-0034.1\",\"id\":\"b4\",\"matched_paper_id\":125864661},\"end\":66541,\"start\":66126},{\"attributes\":{\"doi\":\"10.1023/A:1010933404324\",\"id\":\"b5\",\"matched_paper_id\":89141},\"end\":66708,\"start\":66543},{\"attributes\":{\"id\":\"b6\"},\"end\":66910,\"start\":66710},{\"attributes\":{\"doi\":\"10.1175/WAF915.1\",\"id\":\"b7\",\"matched_paper_id\":121916225},\"end\":67393,\"start\":66912},{\"attributes\":{\"id\":\"b8\"},\"end\":67761,\"start\":67395},{\"attributes\":{\"id\":\"b9\"},\"end\":68152,\"start\":67763},{\"attributes\":{\"doi\":\"10.1175/1520-0469(1948)005<0275:COTOTF>2.0.CO;2\",\"id\":\"b10\",\"matched_paper_id\":122010428},\"end\":68468,\"start\":68154},{\"attributes\":{\"doi\":\"10.1175/1520-0493(2001)129<0569:CAALSH>2.0.CO;2\",\"id\":\"b11\",\"matched_paper_id\":9971293},\"end\":69007,\"start\":68470},{\"attributes\":{\"id\":\"b12\"},\"end\":69190,\"start\":69009},{\"attributes\":{\"id\":\"b13\",\"matched_paper_id\":122137426},\"end\":69980,\"start\":69192},{\"attributes\":{\"id\":\"b14\",\"matched_paper_id\":125348286},\"end\":70304,\"start\":69982},{\"attributes\":{\"id\":\"b15\"},\"end\":70621,\"start\":70306},{\"attributes\":{\"id\":\"b16\"},\"end\":70811,\"start\":70623},{\"attributes\":{\"id\":\"b17\",\"matched_paper_id\":124305602},\"end\":71185,\"start\":70813},{\"attributes\":{\"id\":\"b18\"},\"end\":71700,\"start\":71187},{\"attributes\":{\"id\":\"b19\",\"matched_paper_id\":6409061},\"end\":72172,\"start\":71702},{\"attributes\":{\"id\":\"b20\"},\"end\":72324,\"start\":72174},{\"attributes\":{\"id\":\"b21\",\"matched_paper_id\":18316390},\"end\":72694,\"start\":72326},{\"attributes\":{\"id\":\"b22\",\"matched_paper_id\":121411166},\"end\":73096,\"start\":72696},{\"attributes\":{\"id\":\"b23\",\"matched_paper_id\":125470927},\"end\":73555,\"start\":73098},{\"attributes\":{\"id\":\"b24\",\"matched_paper_id\":121885602},\"end\":73994,\"start\":73557},{\"attributes\":{\"id\":\"b25\",\"matched_paper_id\":5808102},\"end\":74465,\"start\":73996},{\"attributes\":{\"id\":\"b26\",\"matched_paper_id\":2630401},\"end\":74847,\"start\":74467},{\"attributes\":{\"id\":\"b27\",\"matched_paper_id\":55960684},\"end\":75278,\"start\":74849},{\"attributes\":{\"id\":\"b28\"},\"end\":75558,\"start\":75280},{\"attributes\":{\"id\":\"b29\",\"matched_paper_id\":206775459},\"end\":75816,\"start\":75560},{\"attributes\":{\"id\":\"b30\"},\"end\":76450,\"start\":75818},{\"attributes\":{\"id\":\"b31\",\"matched_paper_id\":35244529},\"end\":76823,\"start\":76452},{\"attributes\":{\"id\":\"b32\",\"matched_paper_id\":17922653},\"end\":77414,\"start\":76825},{\"attributes\":{\"id\":\"b33\",\"matched_paper_id\":2542741},\"end\":78198,\"start\":77416},{\"attributes\":{\"id\":\"b34\",\"matched_paper_id\":122288275},\"end\":78560,\"start\":78200},{\"attributes\":{\"id\":\"b35\"},\"end\":78736,\"start\":78562},{\"attributes\":{\"id\":\"b36\",\"matched_paper_id\":1889131},\"end\":79210,\"start\":78738},{\"attributes\":{\"id\":\"b37\",\"matched_paper_id\":59571822},\"end\":79550,\"start\":79212},{\"attributes\":{\"id\":\"b38\",\"matched_paper_id\":54031652},\"end\":80013,\"start\":79552},{\"attributes\":{\"id\":\"b39\",\"matched_paper_id\":54710374},\"end\":80390,\"start\":80015},{\"attributes\":{\"id\":\"b40\",\"matched_paper_id\":121053719},\"end\":80708,\"start\":80392},{\"attributes\":{\"id\":\"b41\",\"matched_paper_id\":123107876},\"end\":81396,\"start\":80710},{\"attributes\":{\"id\":\"b42\",\"matched_paper_id\":121596374},\"end\":81808,\"start\":81398},{\"attributes\":{\"id\":\"b43\"},\"end\":82068,\"start\":81810},{\"attributes\":{\"id\":\"b44\"},\"end\":82425,\"start\":82070},{\"attributes\":{\"id\":\"b45\",\"matched_paper_id\":125037489},\"end\":82697,\"start\":82427},{\"attributes\":{\"id\":\"b46\",\"matched_paper_id\":10659969},\"end\":82905,\"start\":82699},{\"attributes\":{\"id\":\"b47\",\"matched_paper_id\":119536551},\"end\":83279,\"start\":82907},{\"attributes\":{\"id\":\"b48\",\"matched_paper_id\":121884279},\"end\":83672,\"start\":83281},{\"attributes\":{\"id\":\"b49\",\"matched_paper_id\":129709256},\"end\":84559,\"start\":83674},{\"attributes\":{\"id\":\"b50\",\"matched_paper_id\":55285223},\"end\":84817,\"start\":84561},{\"attributes\":{\"id\":\"b51\",\"matched_paper_id\":55294567},\"end\":85235,\"start\":84819},{\"attributes\":{\"id\":\"b52\"},\"end\":85671,\"start\":85237},{\"attributes\":{\"id\":\"b53\",\"matched_paper_id\":491321},\"end\":86057,\"start\":85673},{\"attributes\":{\"id\":\"b54\",\"matched_paper_id\":6844431},\"end\":86404,\"start\":86059},{\"attributes\":{\"id\":\"b55\"},\"end\":86597,\"start\":86406},{\"attributes\":{\"id\":\"b56\",\"matched_paper_id\":53341712},\"end\":87642,\"start\":86599},{\"attributes\":{\"id\":\"b57\",\"matched_paper_id\":16162039},\"end\":87838,\"start\":87644},{\"attributes\":{\"id\":\"b58\"},\"end\":88122,\"start\":87840}]", "bib_title": "[{\"end\":64536,\"start\":64484},{\"end\":65325,\"start\":65219},{\"end\":66204,\"start\":66126},{\"end\":66557,\"start\":66543},{\"end\":66996,\"start\":66912},{\"end\":67443,\"start\":67395},{\"end\":68202,\"start\":68154},{\"end\":68610,\"start\":68470},{\"end\":69269,\"start\":69192},{\"end\":70054,\"start\":69982},{\"end\":70871,\"start\":70813},{\"end\":71807,\"start\":71702},{\"end\":72413,\"start\":72326},{\"end\":72797,\"start\":72696},{\"end\":73221,\"start\":73098},{\"end\":73634,\"start\":73557},{\"end\":74088,\"start\":73996},{\"end\":74567,\"start\":74467},{\"end\":74955,\"start\":74849},{\"end\":75622,\"start\":75560},{\"end\":76535,\"start\":76452},{\"end\":76912,\"start\":76825},{\"end\":77477,\"start\":77416},{\"end\":78293,\"start\":78200},{\"end\":78605,\"start\":78562},{\"end\":78847,\"start\":78738},{\"end\":79283,\"start\":79212},{\"end\":79655,\"start\":79552},{\"end\":80113,\"start\":80015},{\"end\":80439,\"start\":80392},{\"end\":80848,\"start\":80710},{\"end\":81506,\"start\":81398},{\"end\":82491,\"start\":82427},{\"end\":82739,\"start\":82699},{\"end\":82975,\"start\":82907},{\"end\":83344,\"start\":83281},{\"end\":83824,\"start\":83674},{\"end\":84610,\"start\":84561},{\"end\":84894,\"start\":84819},{\"end\":85768,\"start\":85673},{\"end\":86124,\"start\":86059},{\"end\":86740,\"start\":86599},{\"end\":87692,\"start\":87644}]", "bib_author": "[{\"end\":64547,\"start\":64538},{\"end\":64559,\"start\":64547},{\"end\":65089,\"start\":65072},{\"end\":65102,\"start\":65089},{\"end\":65332,\"start\":65327},{\"end\":65337,\"start\":65332},{\"end\":65346,\"start\":65337},{\"end\":65357,\"start\":65346},{\"end\":65369,\"start\":65357},{\"end\":65381,\"start\":65369},{\"end\":65392,\"start\":65381},{\"end\":65401,\"start\":65392},{\"end\":65795,\"start\":65784},{\"end\":65828,\"start\":65795},{\"end\":66225,\"start\":66206},{\"end\":66241,\"start\":66225},{\"end\":66255,\"start\":66241},{\"end\":66266,\"start\":66255},{\"end\":66570,\"start\":66559},{\"end\":66777,\"start\":66763},{\"end\":66789,\"start\":66777},{\"end\":66802,\"start\":66789},{\"end\":67003,\"start\":66998},{\"end\":67033,\"start\":67003},{\"end\":67041,\"start\":67033},{\"end\":67456,\"start\":67445},{\"end\":68215,\"start\":68204},{\"end\":68229,\"start\":68215},{\"end\":68620,\"start\":68612},{\"end\":68630,\"start\":68620},{\"end\":69061,\"start\":69050},{\"end\":69073,\"start\":69061},{\"end\":69285,\"start\":69271},{\"end\":69296,\"start\":69285},{\"end\":69310,\"start\":69296},{\"end\":69322,\"start\":69310},{\"end\":69334,\"start\":69322},{\"end\":70068,\"start\":70056},{\"end\":70081,\"start\":70068},{\"end\":70442,\"start\":70431},{\"end\":70456,\"start\":70442},{\"end\":70630,\"start\":70625},{\"end\":70643,\"start\":70630},{\"end\":70884,\"start\":70873},{\"end\":71294,\"start\":71283},{\"end\":71814,\"start\":71809},{\"end\":71826,\"start\":71814},{\"end\":71837,\"start\":71826},{\"end\":71849,\"start\":71837},{\"end\":71863,\"start\":71849},{\"end\":71870,\"start\":71863},{\"end\":72188,\"start\":72174},{\"end\":72198,\"start\":72188},{\"end\":72211,\"start\":72198},{\"end\":72426,\"start\":72415},{\"end\":72439,\"start\":72426},{\"end\":72447,\"start\":72439},{\"end\":72811,\"start\":72799},{\"end\":72820,\"start\":72811},{\"end\":72829,\"start\":72820},{\"end\":73237,\"start\":73223},{\"end\":73249,\"start\":73237},{\"end\":73652,\"start\":73636},{\"end\":73665,\"start\":73652},{\"end\":73676,\"start\":73665},{\"end\":74099,\"start\":74090},{\"end\":74110,\"start\":74099},{\"end\":74579,\"start\":74569},{\"end\":74591,\"start\":74579},{\"end\":74970,\"start\":74957},{\"end\":74982,\"start\":74970},{\"end\":75292,\"start\":75280},{\"end\":75298,\"start\":75292},{\"end\":75635,\"start\":75624},{\"end\":75832,\"start\":75818},{\"end\":75845,\"start\":75832},{\"end\":75855,\"start\":75845},{\"end\":76551,\"start\":76537},{\"end\":76563,\"start\":76551},{\"end\":76572,\"start\":76563},{\"end\":76928,\"start\":76914},{\"end\":76937,\"start\":76928},{\"end\":76948,\"start\":76937},{\"end\":76957,\"start\":76948},{\"end\":77488,\"start\":77479},{\"end\":77499,\"start\":77488},{\"end\":77511,\"start\":77499},{\"end\":77524,\"start\":77511},{\"end\":77534,\"start\":77524},{\"end\":77545,\"start\":77534},{\"end\":77555,\"start\":77545},{\"end\":77567,\"start\":77555},{\"end\":77577,\"start\":77567},{\"end\":78306,\"start\":78295},{\"end\":78618,\"start\":78607},{\"end\":78861,\"start\":78849},{\"end\":78872,\"start\":78861},{\"end\":78886,\"start\":78872},{\"end\":78897,\"start\":78886},{\"end\":78909,\"start\":78897},{\"end\":79297,\"start\":79285},{\"end\":79307,\"start\":79297},{\"end\":79669,\"start\":79657},{\"end\":79682,\"start\":79669},{\"end\":79693,\"start\":79682},{\"end\":79705,\"start\":79693},{\"end\":79717,\"start\":79705},{\"end\":80127,\"start\":80115},{\"end\":80140,\"start\":80127},{\"end\":80453,\"start\":80441},{\"end\":80862,\"start\":80850},{\"end\":81524,\"start\":81508},{\"end\":81536,\"start\":81524},{\"end\":81883,\"start\":81874},{\"end\":81898,\"start\":81883},{\"end\":81904,\"start\":81898},{\"end\":82183,\"start\":82175},{\"end\":82198,\"start\":82183},{\"end\":82210,\"start\":82198},{\"end\":82504,\"start\":82493},{\"end\":82754,\"start\":82741},{\"end\":82766,\"start\":82754},{\"end\":82987,\"start\":82977},{\"end\":83003,\"start\":82987},{\"end\":83011,\"start\":83003},{\"end\":83019,\"start\":83011},{\"end\":83361,\"start\":83346},{\"end\":83377,\"start\":83361},{\"end\":83846,\"start\":83826},{\"end\":83852,\"start\":83846},{\"end\":84625,\"start\":84612},{\"end\":84910,\"start\":84896},{\"end\":84922,\"start\":84910},{\"end\":84934,\"start\":84922},{\"end\":84945,\"start\":84934},{\"end\":84958,\"start\":84945},{\"end\":85248,\"start\":85237},{\"end\":85259,\"start\":85248},{\"end\":85272,\"start\":85259},{\"end\":85785,\"start\":85770},{\"end\":85796,\"start\":85785},{\"end\":86140,\"start\":86126},{\"end\":86150,\"start\":86140},{\"end\":86164,\"start\":86150},{\"end\":86177,\"start\":86164},{\"end\":86194,\"start\":86177},{\"end\":86754,\"start\":86742},{\"end\":86773,\"start\":86754},{\"end\":86786,\"start\":86773},{\"end\":86795,\"start\":86786},{\"end\":87708,\"start\":87694},{\"end\":87851,\"start\":87840},{\"end\":87874,\"start\":87851}]", "bib_venue": "[{\"end\":64727,\"start\":64641},{\"end\":67549,\"start\":67534},{\"end\":67929,\"start\":67907},{\"end\":69421,\"start\":69410},{\"end\":74207,\"start\":74153},{\"end\":75395,\"start\":75382},{\"end\":85429,\"start\":85416},{\"end\":64639,\"start\":64559},{\"end\":65070,\"start\":65001},{\"end\":65440,\"start\":65424},{\"end\":65877,\"start\":65828},{\"end\":66305,\"start\":66289},{\"end\":66604,\"start\":66593},{\"end\":66761,\"start\":66710},{\"end\":67073,\"start\":67057},{\"end\":67532,\"start\":67456},{\"end\":67905,\"start\":67763},{\"end\":68285,\"start\":68276},{\"end\":68734,\"start\":68721},{\"end\":69048,\"start\":69009},{\"end\":69408,\"start\":69350},{\"end\":70117,\"start\":70104},{\"end\":70429,\"start\":70306},{\"end\":70998,\"start\":70975},{\"end\":71281,\"start\":71187},{\"end\":71909,\"start\":71893},{\"end\":72224,\"start\":72211},{\"end\":72483,\"start\":72470},{\"end\":72869,\"start\":72853},{\"end\":73298,\"start\":73273},{\"end\":73736,\"start\":73723},{\"end\":74151,\"start\":74110},{\"end\":74631,\"start\":74615},{\"end\":75015,\"start\":74982},{\"end\":75380,\"start\":75298},{\"end\":75665,\"start\":75653},{\"end\":75983,\"start\":75855},{\"end\":76611,\"start\":76595},{\"end\":77006,\"start\":76981},{\"end\":77637,\"start\":77596},{\"end\":78356,\"start\":78331},{\"end\":78635,\"start\":78618},{\"end\":78945,\"start\":78934},{\"end\":79354,\"start\":79330},{\"end\":79749,\"start\":79734},{\"end\":80174,\"start\":80161},{\"end\":80515,\"start\":80500},{\"end\":80922,\"start\":80909},{\"end\":81576,\"start\":81560},{\"end\":81872,\"start\":81810},{\"end\":82173,\"start\":82070},{\"end\":82540,\"start\":82529},{\"end\":82785,\"start\":82766},{\"end\":83063,\"start\":83042},{\"end\":83437,\"start\":83424},{\"end\":83966,\"start\":83943},{\"end\":84665,\"start\":84649},{\"end\":84997,\"start\":84981},{\"end\":85414,\"start\":85272},{\"end\":85836,\"start\":85821},{\"end\":86213,\"start\":86194},{\"end\":86444,\"start\":86406},{\"end\":86829,\"start\":86816},{\"end\":87728,\"start\":87708},{\"end\":87921,\"start\":87874}]"}}}, "year": 2023, "month": 12, "day": 17}