{"id": 195259265, "updated": "2023-04-05 19:09:41.622", "metadata": {"title": "Learning APT chains from cyber threat intelligence", "authors": "[{\"first\":\"Ghaith\",\"last\":\"Husari\",\"middle\":[]},{\"first\":\"Ehab\",\"last\":\"Al-Shaer\",\"middle\":[]},{\"first\":\"Bill\",\"last\":\"Chu\",\"middle\":[]},{\"first\":\"Ruhani\",\"last\":\"Rahman\",\"middle\":[\"Faiheem\"]}]", "venue": null, "journal": "Proceedings of the 6th Annual Symposium on Hot Topics in the Science of Security", "publication_date": {"year": 2019, "month": null, "day": null}, "abstract": "With the rapidly evolving cyber attacks, cybersecurity specialists are actively using cyber threat intelligence to identify and respond to cyber attacks in a timely manner. However, this information will be highly useful for attack detection and mitigation if we can construct structured cyber threat intelligence and accurately generate TTP Chains to understand the steps of cyber attacks. In this poster, we present our preliminary Natural Language Processing (NLP) analysis to characterize the temporal relationship of attack actions of an APT attack to extract and construct the reported TTP chains using the popular standard, MITRE ATT&CK [1], and the Structured Sharing Language, STIX 2 [2], a machine-readable language that will help automate the process of understanding and responding to the cyber attacks shared in unstructured text via blogs, emails, and social media.", "fields_of_study": "[\"Computer Science\"]", "external_ids": {"arxiv": null, "mag": "2952280772", "acl": null, "pubmed": null, "pubmedcentral": null, "dblp": "conf/hotsos/HusariACR19", "doi": "10.1145/3314058.3317728"}}, "content": {"source": {"pdf_hash": "7378747908de1faf4a4506661036dbcf2f23cf9c", "pdf_src": "ACM", "pdf_uri": null, "oa_url_match": false, "oa_info": null}, "grobid": {"id": "10af4b92e4ca13154aa747e874cdb5e564304e0a", "type": "plain-text", "url": "s3://ai2-s2-pdf-extraction-prod/parse-results/s2orc_worker/7378747908de1faf4a4506661036dbcf2f23cf9c.txt", "contents": "\nLearning APT Chains from Cyber Threat Intelligence\n\n\nGhaith Husari ghusari@uncc.edu \nUniversity of North Carolina at Charlotte Charlotte\nNCUSA\n\nEhab Al-Shaer ealshaer@uncc.edu \nUniversity of North Carolina at Charlotte Charlotte\nNCUSA\n\nBill Chu billchu@uncc.edu \nUniversity of North Carolina at Charlotte Charlotte\nNCUSA\n\nRuhani Faiheem Rahman rrahman@uncc.edu \nUniversity of North Carolina at Charlotte Charlotte\nNCUSA\n\nLearning APT Chains from Cyber Threat Intelligence\n10.1145/3314058.3317728\nWith the rapidly evolving cyber attacks, cybersecurity specialists are actively using cyber threat intelligence to identify and respond to cyber attacks in a timely manner. However, this information will be highly useful for attack detection and mitigation if we can construct structured cyber threat intelligence and accurately generate TTP Chains to understand the steps of cyber attacks. In this poster, we present our preliminary Natural Language Processing (NLP) analysis to characterize the temporal relationship of attack actions of an APT attack to extract and construct the reported TTP chains using the popular standard, MITRE ATT&CK [1], and the Structured Sharing Language, STIX 2 [2], a machine-readable language that will help automate the process of understanding and responding to the cyber attacks shared in unstructured text via blogs, emails, and social media.\n\nBACKGROUND\n\nWith the increasing need for cyber threat intelligence, various standards have emerged to share cyber threat information with the public community. Most of these standards are based on the observation that cyber threats follow attack patterns. Identifying attack patterns is essential to define models to represent the attack information and for their mitigation planning. STIX [2] standard has become very popular for sharing CTI data. In STIX schema, campaign construct is defined as a set of Indicators of Compromise (IoCs) that belong to a given attack pattern. These IoCs consist of 88 types of malicious artifacts (e.g., website, IP address, registry key, etc.). To specify the sequential nature of attack pattern in a threat report, STIX has a kill_chain_phase attribute for the IoCs. This attribute is based on the definition of the cyber kill chain, which defines 7 phases for cyber attacks: reconnaissance, weaponization, delivery, exploitation, installation, command control and actions on objectives.\n\n\nPROBLEM DEFINITION AND MOTIVATION\n\nMITRE ATT&CK techniques provide threat high-level behaviors in terms of threat actions (e.g., Spearphishing Link, Exfiltration over C2, etc.). Although these threat behaviors are used to report cyber attack using the ATT&CK standard, yet there is no end-to-end approach that captures the sequential relationship between these actions and artifacts from threat reports. Although current solutions, such as TTPDrill [3], extract these techniques from unstructured texts of cyber threat intelligence, it does not capture the temporal Permission to make digital or hard copies of part or all of this work for personal or classroom use is granted without fee provided that copies are not made or distributed for profit or commercial advantage and that copies bear this notice and the full citation on the first page. Copyrights for third-party components of this work must be honored. For all other uses, contact the owner/author(s). relations report by the threat report. Recognizing this sequential (or temporal) relationship between actions and their artifacts is essential for detecting attacks by analyzing their artifacts gathered from the network. These artifacts can be used as signatures for detecting and preventing cyber attacks in a timely manner.\n\n\nWORK OBJECTIVE AND TECHNICAL APPROACH\n\nIn this poster, we will present our preliminary work to capture the temporal relationship between threat artifacts that are reported by cyber threat intelligence. First, we design a set if Regular Expressions (regex) to capture IoCs (artifacts) from the text, then we utilize Natural Language Processing and design our NLP typed dependency ruleset to extract the temporal relationship between these artifacts in threat reports. Based on our careful analysis of threat IoCs and artifacts, We adapt five stages of kill chain that are associated with the threat artifacts that we capture using our regexes.\n\n• Deliver: This is the first stage of delivery of the malware to provide initial access for the threat. This starts with a malicious email that includes a link or an attachment, if clicked downloads and executes a script that will start the malicious campaign. • Exploit: This phase includes exploiting a software vulnerability in an installed application on the victim's machine. • Command and control: Once installed, the malware will communicate with the remote c2 server via IP address or website to receive further commands on which malicious actions to execute. • Stage: After collecting sensitive data from the user's machine, the malware usually stores this data by creating a file on the victim's system in preparation of exfiltrating it. • Exfiltrate: The last phase of the attack is to send the collected information to a remote location using email, IP address, or web service.\n\nThreat actions, in CTI reports, are often associated with temporal expressions. These expressions can be used to determine the temporal order between threat actions. The output and accuracy of this process are important for ordering threat actions of a given cyber-attack in one timeline. This ordering is essential for merging multiple reports of the same cyber threat into one aggregated report. Also, it enables IDS specialists to train models to capture malicious malware behaviors (i.e., sequence of ordered threat actions).\n\n\nPRELIMINARY EXPERIMENTATION AND FINDINGS\n\nIn this preliminary work, We used the dependency rules shown in Table 1 to process 5,000 threat reports scraped from Symantec and Fireeye CTI blogs [4,5] to capture the temporal relationship  between threat actions and artifacts to generate STIX constructs of these artifacts and associate the temporal relationship between them using STIX 2 attribute kill_chain_phase. These constructs are machine-readable and therefore, they can be processed automatically by countermeasures such as firewalls, Web Application Firewalls (WAF), and Intrusion Detection Systems (IDS).\n\n[The types of artifacts exhibit high predictability] : Based on our analysis, we found that the different types of artifacts that are extracted from the dataset exhibit high temporal order correlation. For instance, as shown in Figure 1, vulnerability exploitation artifact (script) is often followed by creating a dump file on the Victim's host. This is after we extracted the temporal relations between them and calculated the correlation only based on temporal relations between every two types of artifacts. This finding is important for cybersecurity tools to detect malicious behaviors based on a sequence of temporal events and their artifacts to avoid the high false positive rate of IDS.\n\n\nFUTURE WORK\n\nWe learned in this preliminary work that the types of malicious artifacts exhibit a high temporal dependency which indicates that some types of artifacts are preconditions to other types. We can capture this temporal relationship and use it to detect behaviors of cyber attacks based on the artifacts which they generate. These behaviors should reduce the number of false positives laid by IDS that do not consider the temporal relationship between artifacts. { \"type\": \"malware\", \"id\": \"malware--0c7b-4a4d-aa9d-feb398cd0061\", \"created\": \"2019-03-8T08:17:27.000Z\", \"name\": \"Janero\", \"description\": \"Exploits vulnerability, dumps file\", \"labels\": [\"Trojan\"] \"kill_chain_phases\": [\"Exploit\",\"Stage\"] } Figure 2: STIX 2 malware construct generated by our tool However, using English temporal anchors (e.g., before, after, etc.) is a limited approach in the cyber domain and results in missing to capture a non-negligible amount of temporal relations.\n\nTo Address this limitation, we plan to expand our set of temporal anchors to include more temporal expressions used in CTI domain such as \"upon successful execution of the previous step, the malware ...\". To collect these terms, we intend to do the following:\n\n(1) Manually label artifacts reported by cyber threat information with an arc that represents the temporal relations between artifacts based on human intelligence. Then, we will use the text around these artifacts to learn the words that indicate the temporal relation amongst artifacts, and (2) we plan to use machine learning techniques to detect cyber malicious activity based on the types of artifacts and the temporal order of generating these artifacts by any given process to inform the security analyst of the suspicious processes running on the network machines.\n\nFigure 1 :\n1Example of Dependency Parsing, where the edge represents typed dependency type\n\nTable 1 :\n1An example of temporal relations extraction among threat actionsthreat \n\ndescription \n\nThe actors behind the previous FormBook campaign used \nCVE-2017-0199 ... Equation Editor downloaded a file called \n\"xyz[1].123\" and then created the scvhost.exe process... \nThe malware comes ... with rootkit functions such as key-\nlogging, clipboard stealing, screenshots and webcam ac-\ncess. Passwords are stolen from the following applications, \namong others ... it creates the POST request string, as you \ncan see below... Then, it encrypts it with 3DES before \nsending it. \n\nthreat actions with \ntemporal order \n\nexploit vulnerability \ndownload file [Before] create process \nkeylogging \nclipboard stealing \nscreenshots access \nwebcam access \nsteal passwords from applications \ncreate POST request string [Before] encrypt it with 3DES \nencrypt it with 3DES [Before] sending it. \n\ndobj \n\nThe Malware exploits CVE-2018-20511, then it dumps 2284f6a19aaead90955ca8 \n\nMalware artifact \nTemporal anchor \n\ndet \nnsubj \ndobj \nnsubj \n\n\n\nTable 2 :\n2Excerpt of typed dependencies used in this worktyped dependency \nThreat Action \nnsubj \nparent <verb>, child.<subj> \ndobj \nparent<verb>, child.<obj> \nnsubjpass \nparent<verb>, child.<obj> \nnmod:agent \nparent<verb>, child.<subj> \nnmod:from \nparent<verb>_from, child.<obj> \nnmod:to \nparent<verb>_to, child.<obj> \nnmod:with \nparent<verb>_with, child.<obj> \nnmod:via \nparent<verb>_via, child.<obj> \nnmod:over \nparent<verb>_over, child.<obj> \nnmod:for \nparent<verb>_for, child.<obj> \nnmod:through \nparent<verb>_through, child.<obj> \nnmod:using \nparent<verb>_using, child.<obj> \nnmod:into \nparent<verb>_into, child.<obj> \n\n\n\nMITRE ATT&CK. Mitre Corp, MITRE Corp. (1958). MITRE ATT&CK. https://attack.mitre.org/ . (Last accessed: November 12, 2018)\n\nThe Structured Threat Information eXpression. Stix, STIX. The Structured Threat Information eXpression.https://stixproject.github.io/\n\nTTPDrill: Automatic and Accurate Extraction of Threat Actions from Unstructured Text of CTI Sources. Ghaith Husari, Ehab Al-Shaer, Mohiuddin Ahmed, Bill Chu, Xi Niu, Proceedings of the 33rd Annual Computer Security Applications Conference. the 33rd Annual Computer Security Applications ConferenceNew York, NY, USAACMGhaith Husari, Ehab Al-Shaer, Mohiuddin Ahmed, Bill Chu, and Xi Niu. (2017). TTPDrill: Automatic and Accurate Extraction of Threat Actions from Unstructured Text of CTI Sources. In Proceedings of the 33rd Annual Computer Security Applica- tions Conference (ACSAC 2017). ACM, New York, NY, USA, 103-115.\n\n. Symantec Corp, Symantec Security, Center, Symantec Corp. Symantec Security Center. https://www.symantec. com/security response/.\n\n. Inc Fireeye, FireEye cyber threat intelligence. FireEye, Inc. FireEye cyber threat intelligence. https://www.fireeye.com/solutions/cyber-threat-intelligence.html.\n", "annotations": {"author": "[{\"end\":144,\"start\":54},{\"end\":236,\"start\":145},{\"end\":322,\"start\":237},{\"end\":421,\"start\":323}]", "publisher": null, "author_last_name": "[{\"end\":67,\"start\":61},{\"end\":158,\"start\":150},{\"end\":245,\"start\":242},{\"end\":344,\"start\":338}]", "author_first_name": "[{\"end\":60,\"start\":54},{\"end\":149,\"start\":145},{\"end\":241,\"start\":237},{\"end\":329,\"start\":323},{\"end\":337,\"start\":330}]", "author_affiliation": "[{\"end\":143,\"start\":86},{\"end\":235,\"start\":178},{\"end\":321,\"start\":264},{\"end\":420,\"start\":363}]", "title": "[{\"end\":51,\"start\":1},{\"end\":472,\"start\":422}]", "venue": null, "abstract": "[{\"end\":1376,\"start\":497}]", "bib_ref": "[{\"attributes\":{\"ref_id\":\"b1\"},\"end\":1771,\"start\":1768},{\"attributes\":{\"ref_id\":\"b2\"},\"end\":2857,\"start\":2854},{\"attributes\":{\"ref_id\":\"b3\"},\"end\":5957,\"start\":5954},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":5959,\"start\":5957}]", "figure": "[{\"attributes\":{\"id\":\"fig_0\"},\"end\":8961,\"start\":8870},{\"attributes\":{\"id\":\"tab_1\",\"type\":\"table\"},\"end\":9989,\"start\":8962},{\"attributes\":{\"id\":\"tab_2\",\"type\":\"table\"},\"end\":10617,\"start\":9990}]", "paragraph": "[{\"end\":2402,\"start\":1390},{\"end\":3694,\"start\":2440},{\"end\":4339,\"start\":3736},{\"end\":5230,\"start\":4341},{\"end\":5761,\"start\":5232},{\"end\":6374,\"start\":5806},{\"end\":7072,\"start\":6376},{\"end\":8035,\"start\":7088},{\"end\":8296,\"start\":8037},{\"end\":8869,\"start\":8298}]", "formula": null, "table_ref": "[{\"attributes\":{\"ref_id\":\"tab_1\"},\"end\":5877,\"start\":5870}]", "section_header": "[{\"attributes\":{\"n\":\"1\"},\"end\":1388,\"start\":1378},{\"attributes\":{\"n\":\"2\"},\"end\":2438,\"start\":2405},{\"attributes\":{\"n\":\"3\"},\"end\":3734,\"start\":3697},{\"attributes\":{\"n\":\"4\"},\"end\":5804,\"start\":5764},{\"attributes\":{\"n\":\"5\"},\"end\":7086,\"start\":7075},{\"end\":8881,\"start\":8871},{\"end\":8972,\"start\":8963},{\"end\":10000,\"start\":9991}]", "table": "[{\"end\":9989,\"start\":9038},{\"end\":10617,\"start\":10049}]", "figure_caption": "[{\"end\":8961,\"start\":8883},{\"end\":9038,\"start\":8974},{\"end\":10049,\"start\":10002}]", "figure_ref": "[{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":6612,\"start\":6604},{\"end\":7796,\"start\":7788}]", "bib_author_first_name": "[{\"end\":10985,\"start\":10979},{\"end\":10998,\"start\":10994},{\"end\":11018,\"start\":11009},{\"end\":11030,\"start\":11026},{\"end\":11038,\"start\":11036},{\"end\":11509,\"start\":11501},{\"end\":11636,\"start\":11633}]", "bib_author_last_name": "[{\"end\":10643,\"start\":10633},{\"end\":10793,\"start\":10789},{\"end\":10992,\"start\":10986},{\"end\":11007,\"start\":10999},{\"end\":11024,\"start\":11019},{\"end\":11034,\"start\":11031},{\"end\":11042,\"start\":11039},{\"end\":11514,\"start\":11510},{\"end\":11533,\"start\":11516},{\"end\":11541,\"start\":11535},{\"end\":11644,\"start\":11637}]", "bib_entry": "[{\"attributes\":{\"id\":\"b0\"},\"end\":10741,\"start\":10619},{\"attributes\":{\"id\":\"b1\"},\"end\":10876,\"start\":10743},{\"attributes\":{\"id\":\"b2\",\"matched_paper_id\":20396776},\"end\":11497,\"start\":10878},{\"attributes\":{\"id\":\"b3\"},\"end\":11629,\"start\":11499},{\"attributes\":{\"id\":\"b4\"},\"end\":11795,\"start\":11631}]", "bib_title": "[{\"end\":10977,\"start\":10878}]", "bib_author": "[{\"end\":10645,\"start\":10633},{\"end\":10795,\"start\":10789},{\"end\":10994,\"start\":10979},{\"end\":11009,\"start\":10994},{\"end\":11026,\"start\":11009},{\"end\":11036,\"start\":11026},{\"end\":11044,\"start\":11036},{\"end\":11516,\"start\":11501},{\"end\":11535,\"start\":11516},{\"end\":11543,\"start\":11535},{\"end\":11646,\"start\":11633}]", "bib_venue": "[{\"end\":11192,\"start\":11118},{\"end\":10631,\"start\":10619},{\"end\":10787,\"start\":10743},{\"end\":11116,\"start\":11044},{\"end\":11679,\"start\":11646}]"}}}, "year": 2023, "month": 12, "day": 17}