{"id": 195742686, "updated": "2022-02-06 12:15:08.848", "metadata": {"title": "Annotating and Characterizing Clinical Sentences with Explicit Why-QA Cues", "authors": "[{\"middle\":[],\"last\":\"Fan\",\"first\":\"Jungwei\"}]", "venue": null, "journal": "Proceedings of the 2nd Clinical Natural Language Processing Workshop", "publication_date": {"year": 2019, "month": null, "day": null}, "abstract": "Many clinical information needs can be stated as why-questions. The answers to them represent important clinical reasoning and justification. Clinical notes are a rich source for such why-question answering (why-QA). However, there are few dedicated corpora, and little is known about the characteristics of clinical why-QA narratives. To address this gap, the study performed manual annotation of 277 sentences containing explicit why-QA cues and summarized their quantitative and qualitative properties. The contributions are: 1) sharing a seed corpus that can be used for various QA-related training purposes, 2) adding to our knowledge about the diversity and distribution of clinical why-QA contents.", "fields_of_study": "[\"Computer Science\"]", "external_ids": {"arxiv": null, "mag": "2963790638", "acl": "W19-1913", "pubmed": null, "pubmedcentral": null, "dblp": null, "doi": "10.18653/v1/w19-1913"}}, "content": {"source": {"pdf_hash": "f3af0a19d9418418152cdd514459430041b0b97d", "pdf_src": "ACL", "pdf_uri": "[\"https://www.aclweb.org/anthology/W19-1913.pdf\"]", "oa_url_match": false, "oa_info": {"license": null, "open_access_url": null, "status": "CLOSED"}}, "grobid": {"id": "5499b076c09f3f3f1c4a93bd0c0d2b3d35403449", "type": "plain-text", "url": "s3://ai2-s2-pdf-extraction-prod/parse-results/s2orc_worker/f3af0a19d9418418152cdd514459430041b0b97d.txt", "contents": "\n\nJune 7\n\nProceedings of the 2nd Clinical Natural Language Processing Workshop\nthe 2nd Clinical Natural Language Processing WorkshopMinneapolis, MinnesotaJune 7101\nMany clinical information needs can be stated as why-questions. The answers to them represent important clinical reasoning and justification. Clinical notes are a rich source for such why-question answering (why-QA). However, there are few dedicated corpora, and little is known about the characteristics of clinical why-QA narratives. To address this gap, the study performed manual annotation of 277 sentences containing explicit why-QA cues and summarized their quantitative and qualitative properties. The contributions are: 1) sharing a seed corpus that can be used for various QA-related training purposes, 2) adding to our knowledge about the diversity and distribution of clinical why-QA contents.\n\nIntroduction\n\nThe thought process involved in clinical reasoning and decision-making can be naturally framed into a series of questions and answers. In addition to the tangible value as handy assistance, making computers handle question-answering (QA) is considered a remarkable achievement in artificial intelligence. Accordingly, there has been vital interest in developing clinical QA systems, e.g., AskHERMES (Cao et al., 2011), MiPACQ (Cairns et al., 2011), and MEANS (Abacha & Zweigenbaum, 2015). Among the targets, why-QA represents a special category that deals with cause, motivation, circumstance, and purpose (Verberne, 2006). Within the top ten question types asked by family doctors (Ely et al., 1999), 20% of them can actually be paraphrased into a why-question. Besides the sizable presence, clinical why-QA is both semantically and pragmatically rich because: 1) toward the deep explanatory end the task almost resembles expert-level synthesis and inference, 2) toward the shallower end it usually involves identifying the documented reason that a decision was made.\n\nIt is worth clarifying here two different scenarios that QA tasks are defined. The first aligns more along consulting knowledge sources to answer a question that is not patient-specific, e.g., Why do phenobarbital and Dilantin counteract each other? This is also the scenario that most of the existing clinical QA systems handle. The second scenario (focus of this study) is to find the answer within a given document (a.k.a. reading comprehension), which can especially benefit patient-specific QA based on information mentioned in clinical notes. In the general domain such reading comprehension QA has more than a decade of research, with widely used corpora such as the SQuAD (Rajpurkar, Zhang, Lopyrev, & Liang, 2016) and that by Verberne, Boves, Oostdijk, & Coppen (2006). There have not been comparable resources in the clinical domain until a couple of works in 2018 (see Related work section).\n\nThe recently developed corpora in clinical reading comprehension QA are extremely valuable, but also limited with regard to why-QA research because 1) their coverage and analysis did not emphasize on why-questions, 2) the annotation methods could have missed many representative why-QA targets. Therefore, the current study aims to compensate for these oversights through systematic inspection into clinical sentences that contain the intuitive cues \"because\" and \"due to\". The rationale is: we might never know what can be missed by diving right into complex cases, unless the low-hanging offers are well understood first. In fact, the results revealed many informative clinical topics and patterns involved in why-QA. Along with the diverse topics, the well-formed linguistic constructs based on the two unambiguous cues make this small corpus an ideal seed training set to stabilize models or to bootstrap other solutions.\n\n\nAnnotating and Characterizing Clinical Sentences with Explicit Why-QA Cues\n\nJungwei Fan Division of Digital Health Sciences, Mayo Clinic 200 1st Street SW, RO-HA-2-CSHCD, Rochester, MN 55905 fan.jung-wei@mayo.edu\n\n\nRelated work\n\nThere has been considerable annotation research for why-QA in non-medical domains. As part of developing a why-QA system, Higashinaka & Isozaki (2008) used information retrieval to search documents possibly relevant to each whyquestion, followed by manual validation of qualified QA pairs. Mrozinski, Whittaker, & Furui (2008) used Mechanical Turk to recruit annotators for reading Wikipedia articles and generating why-questions based on the contents. Dulceanu et al. (2018) applied web scraping over community forums to collect why-QAs about Adobe Photoshop usage. The answer quality was backed either by questioner feedback or by community votes. Prasad & Joshi (2008) proposed leveraging causal relations in the richly annotated Penn Discourse Treebank to derive why-QAs.\n\nIn the clinical domain there were two corpora developed for reading comprehension QA based on electronic medical records (EMR), and both had broad coverage not limited to only why-QAs. In Raghavan, Patwardhan, Liang, & Devarakonda (2018), medical students were presented with structured and unstructured EMR information of each patient and were instructed to come up with realistic questions for a hypothetical office encounter. The patient's notes were then loaded into an annotation tool for them to mark answer text spans. Pampari, Raghavan, Liang, & Peng (2018) developed emrQA, a large clinical QA corpus generated through template-based semantic extraction from the i2b2 NLP challenge datasets. * The emrQA contains 7.5% of why-QAs, but they mainly ask about why the patient received a test or treatment, due to the partial interest of the original challenge annotations.\n\n\nMethods\n\nThe study notes were from the 2010 i2b2/VA NLP challenge (Uzuner, South, Shen, & DuVall, 2011), obtained through an academic data use agreement. † The corpus consists of 426 discharge summaries from Partners Healthcare and Beth Israel Deaconess Medical Center. The two considerations in choosing this dataset were: 1) the sentences were pre-chunked that made the * https://www.i2b2.org/NLP/DataSets/ † Complying with the i2b2 NLP data use agreement, examples in this paper have been modified and differ from the original text. downstream analysis easier, 2) it overlapped with the emrQA corpus and thus allowed comparison of coverage, etc.\n\nCase-insensitive word search was performed using \"because\" and \"due to\" into the 426 notes. To avoid massive false positives, highly ambiguous cues such as \"for\" were avoided in this pilot study. The author then manually reviewed the 280 hit sentences, of which 79 were from \"because\" and 201 from \"due to\". The review involved two tasks: 1) generate a QA pair from the sentence, and 2) categorize the question anchor and the answer. Using the following sentence as an example:\n\nThe patient had urinary tract infection and received Bactrim, which was stopped later because of diarrhea.\n\nThe generated QA pair was: Q: Why was the Bactrim for urinary tract infection stopped?\n\nA: diarrhea It was required that each answer must come from a substring of the source sentence. For each annotation, the line number and character offset of the answer were preserved so as to facilitate computable reuses. The types of question anchors and their answers were induced and consolidated throughout the entire review process. For example, the categorization for the specific QA pair above was:\n\nQuestion anchor: medication avoidance Answer reason: adverse effect Upon completing the annotation, descriptive statistics were derived to show notable properties:\n\n• Sentence coverage of the annotated why-QAs as compared to that of emrQA ( Figure 1). • Distribution of clinical notes with respect to the number of sentences that contain either of the why-cues (Table 1). • Distribution of the categorized whyquestion anchors and answer types (Tables 2, 3, and 4).\n\n\nResults\n\nAs a simple comparison of the question sources, sentence coverage of the annotated why-QAs versus the emrQA why-associated entries is   2 (0.5) 6 2 (0.5) 7 1 (0.2) Table 1: Distribution of notes containing the \"because\" or \"due to\" cue illustrated in Figure 1. There were a total of 43,751 sentences (including those short section headers) in the study corpus of 426 clinical notes. The emrQA used 2,057 sentences in generating its QA pairs, which were basically all about reasons for ordering a test or treatment. The cue-based annotation used 242 sentences, yet the derived why-QAs were much more diverse (see Table 2). There were 60 sentences used by both. Two reasons that the original 280 hit sentences dropped to the 242 distinct annotated sentences were: 1) there were 3 sentences actually containing both cues, 2) 35 of the sentences were not usable to generate a QA pair because of anaphora. Note that it is possible for a double-cue sentence to generate two separate questions because of different why-anchors. As for the prevalence of the two cues, Table 1 shows that more than 30% (100% -65.7%) of the study notes had at least one cue, with as many as 7 cuecontaining sentences within one note.\n\nThe full categorization and distribution of the annotated why-QAs are shown in Table 2, while the distributions aggregated by the question anchors and answer reason types are in Table 3 and Table 4 \n\n\nDiscussion\n\nAlthough the explicit cues contributed a relatively small set of why-QAs, they exhibit a wealth of subject contours for further investigation. The majority of the emrQA why-questions correspond to the two anchor categories procedure disposition and medication administered, together covering only 21.6% among the various anchors in Table 3. Notably, the top anchor category abnormal manifestation (33.1%) concurs with the most commonly asked why-equivalent questions surveyed by (Ely et al., 1999), i.e., What is the cause of a symptom or finding? This concordance implies clinicians tend to explicitly document reasons on certain topics they feel like inquiring in practice as well. Moreover, annotations of medication avoidance and procedure avoidance (together making 20.4% of the anchors) host rich knowledge that is worth capturing systematically.   For example, procedure interaction and disease interaction (e.g., risk from comorbidity) are typical reasons in avoiding certain intervention. Even though the annotations involve only simple cues and single-sentence contexts, they should benefit the training of QA systems. It is known that such instances of atomic and regular structure can help stabilize/smooth the behavior of statistical models. The other possible route is to use the annotations as seed examples and train a question-generation model that automatically asks why-questions as additional training data. Although the study was short of resource to include experimental validation, it is hoped that at least as a self-contained descriptive analysis the results can be informative to the clinical NLP community.\n\nThe representativeness of the study was limited by using only discharge summaries and the two specific cues. The annotations with the complete answer available within one sentence do not touch upon complex scenarios that require synthesizing cross-sentence information. The questions from rephrasing sentences may lack natural intent and diversity, which was a limitation likely shared by repurposing NLP challenge annotations as done in emrQA. This study used only one annotator, which would introduce subjectivity especially in categorizing the QAs.\n\nThe annotations by this study are available at https://github.com/Jung-wei/ClinicalWhyQA\n\nFigure 1 :\n1Venn diagram comparing the # (%) of the annotated sentences to that of emrQA\n\nTable 2 :\n2Detailed distribution of QA pairs by type# of cue-containing \nsentences in the note \n# (%) of notes \n\n0 \n280 (65.7) \n1 \n74 (17.4) \n2 \n39 (9.2) \n3 \n16 (3.8) \n4 \n12 (2.8) \n5 \n\n\nTable 3 :\n3Distribution of QA pairs aggregated by the why-question anchor typesAnswer reason type \n# of QAs (%) \nclinical indication \n85 (34.7) \ndisease-caused \n52 (21.2) \nadverse effect \n35 (14.3) \ndisease interaction \n29 (11.8) \npatient attribute \n13 (5.3) \npatient preference \n9 (3.7) \nmanifestation elaborated \n6 (2.4) \nenvironment factor \n5 (2.0) \nprocedure interaction \n5 (2.0) \ndisease attribute \n4 (1.6) \npatient assessment \n1 (0.4) \nfamily factor \n1 (0.4) \n\n\n\nTable 4 :\n4Distribution of QA pairs aggregated by the answer reason types\nAcknowledgmentsDeidentified clinical records used in this research were provided by the i2b2 National Center for Biomedical Computing funded by U54LM008748 and were originally prepared for the Shared Tasks for Challenges in NLP for Clinical Data organized by Dr. Ozlem Uzuner, i2b2 and SUNY.I would like to thank the anonymous reviewers for their constructive feedback.\nMEANS: A medical question-answering system combining NLP techniques and semantic Web technologies. Information processing & management. A B Abacha, P Zweigenbaum, 51Abacha, A. B., & Zweigenbaum, P. (2015). MEANS: A medical question-answering system combining NLP techniques and semantic Web technologies. Information processing & management, 51(5), 570-594.\n\nThe MiPACQ clinical question answering system. B L Cairns, R D Nielsen, J J Masanz, J H Martin, M S Palmer, W H Ward, G K Savova, AMIA Annu Symp Proc. Cairns, B. L., Nielsen, R. D., Masanz, J. J., Martin, J. H., Palmer, M. S., Ward, W. H., & Savova, G. K. (2011). The MiPACQ clinical question answering system. AMIA Annu Symp Proc, 2011, 171-180.\n\nAskHERMES: An online question answering system for complex clinical questions. Y Cao, F Liu, P Simpson, L Antieau, A Bennett, J J Cimino, . . Yu, H , 10.1016/j.jbi.2011.01.004J Biomed Inform. 442Cao, Y., Liu, F., Simpson, P., Antieau, L., Bennett, A., Cimino, J. J., . . . Yu, H. (2011). AskHERMES: An online question answering system for complex clinical questions. J Biomed Inform, 44(2), 277- 288. doi:10.1016/j.jbi.2011.01.004\n\nPhotoshopQuiA: A corpus of non-factoid questions and answers for why-question answering. A Dulceanu, T Le Dinh, W Chang, T Bui, D S Kim, M C Vu, S Kim, Proceedings of the 11th International Conference on Language Resources and Evaluation. the 11th International Conference on Language Resources and EvaluationLRECDulceanu, A., Le Dinh, T., Chang, W., Bui, T., Kim, D. S., Vu, M. C., & Kim, S. (2018). PhotoshopQuiA: A corpus of non-factoid questions and answers for why-question answering. Proceedings of the 11th International Conference on Language Resources and Evaluation (LREC 2018).\n\nAnalysis of questions asked by family doctors regarding patient care. J W Ely, J A Osheroff, M H Ebell, G R Bergus, B T Levy, M L Chambliss, E R Evans, BMJ. 7206Ely, J. W., Osheroff, J. A., Ebell, M. H., Bergus, G. R., Levy, B. T., Chambliss, M. L., & Evans, E. R. (1999). Analysis of questions asked by family doctors regarding patient care. BMJ, 319(7206), 358-361.\n\nCorpus-based question answering for why-questions. R Higashinaka, H Isozaki, Proceedings of the Third International Joint Conference on Natural Language Processing. the Third International Joint Conference on Natural Language ProcessingHigashinaka, R., & Isozaki, H. (2008). Corpus-based question answering for why-questions. Proceedings of the Third International Joint Conference on Natural Language Processing: Volume-I.\n\nCollecting a why-question corpus for development and evaluation of an automatic QA-system. J Mrozinski, E Whittaker, S Furui, Proceedings of ACL-08: HLT. ACL-08: HLTMrozinski, J., Whittaker, E., & Furui, S. (2008). Collecting a why-question corpus for development and evaluation of an automatic QA-system. Proceedings of ACL-08: HLT, 443-451.\n\nA Pampari, P Raghavan, J Liang, J Peng, arXiv:1809.00732emrQA: A large corpus for question answering on electronic medical records. arXiv preprintPampari, A., Raghavan, P., Liang, J., & Peng, J. (2018). emrQA: A large corpus for question answering on electronic medical records. arXiv preprint arXiv:1809.00732.\n\nA discourse-based approach to generating why-questions from texts. R Prasad, A Joshi, Proceedings of the Workshop on the Question Generation Shared Task and Evaluation Challenge. the Workshop on the Question Generation Shared Task and Evaluation ChallengePrasad, R., & Joshi, A. (2008). A discourse-based approach to generating why-questions from texts. Proceedings of the Workshop on the Question Generation Shared Task and Evaluation Challenge, 1-3.\n\nAnnotating electronic medical records for question answering. P Raghavan, S Patwardhan, J J Liang, M V Devarakonda, arXiv:1805.06816arXiv preprintRaghavan, P., Patwardhan, S., Liang, J. J., & Devarakonda, M. V. (2018). Annotating electronic medical records for question answering. arXiv preprint arXiv:1805.06816.\n\nSQuAD: 100,000+ questions for machine comprehension of text. P Rajpurkar, J Zhang, K Lopyrev, P Liang, Proceedings of the Conference on Empirical Methods in Natural Language Processing. the Conference on Empirical Methods in Natural Language ProcessingEMNLPRajpurkar, P., Zhang, J., Lopyrev, K., & Liang, P. (2016). SQuAD: 100,000+ questions for machine comprehension of text. Proceedings of the Conference on Empirical Methods in Natural Language Processing (EMNLP).\n\n2010 i2b2/VA challenge on concepts, assertions, and relations in clinical text. O Uzuner, B R South, S Shen, S L Duvall, 10.1136/amiajnl-2011-000203J Am Med Inform Assoc. 185Uzuner, O., South, B. R., Shen, S., & DuVall, S. L. (2011). 2010 i2b2/VA challenge on concepts, assertions, and relations in clinical text. J Am Med Inform Assoc, 18(5), 552-556. doi:10.1136/amiajnl-2011-000203\n\nDeveloping an approach for why-question answering. S Verberne, Proceedings of the 11th Conference of the European Chapter of the Association for Computational Linguistics: Student Research Workshop. the 11th Conference of the European Chapter of the Association for Computational Linguistics: Student Research WorkshopVerberne, S. (2006). Developing an approach for why-question answering. Proceedings of the 11th Conference of the European Chapter of the Association for Computational Linguistics: Student Research Workshop, 39-46.\n\nData for question answering: the case of why. S Verberne, L Boves, N Oostdijk, P Coppen, Proceedings of the 5th International Conference on Language Resources and Evaluation (LREC. the 5th International Conference on Language Resources and Evaluation (LRECVerberne, S., Boves, L., Oostdijk, N., & Coppen, P. (2006). Data for question answering: the case of why. Proceedings of the 5th International Conference on Language Resources and Evaluation (LREC 2006).\n", "annotations": {"author": null, "publisher": null, "author_last_name": null, "author_first_name": null, "author_affiliation": null, "title": null, "venue": "[{\"start\":\"10\",\"end\":\"78\"}]", "abstract": "[{\"start\":\"164\",\"end\":\"869\"}]", "bib_ref": "[{\"start\":\"1284\",\"end\":\"1302\",\"attributes\":{\"ref_id\":\"b2\"}},{\"start\":\"1311\",\"end\":\"1332\",\"attributes\":{\"ref_id\":\"b1\"}},{\"start\":\"1344\",\"end\":\"1372\",\"attributes\":{\"ref_id\":\"b0\"}},{\"start\":\"1491\",\"end\":\"1507\",\"attributes\":{\"ref_id\":\"b12\"}},{\"start\":\"1567\",\"end\":\"1585\",\"attributes\":{\"ref_id\":\"b4\"}},{\"start\":\"2635\",\"end\":\"2677\",\"attributes\":{\"ref_id\":\"b10\"}},{\"start\":\"2690\",\"end\":\"2732\",\"attributes\":{\"ref_id\":\"b13\"}},{\"start\":\"4138\",\"end\":\"4166\",\"attributes\":{\"ref_id\":\"b5\"}},{\"start\":\"4306\",\"end\":\"4342\",\"attributes\":{\"ref_id\":\"b6\"}},{\"start\":\"4469\",\"end\":\"4491\",\"attributes\":{\"ref_id\":\"b3\"}},{\"start\":\"4666\",\"end\":\"4687\",\"attributes\":{\"ref_id\":\"b8\"}},{\"start\":\"4981\",\"end\":\"5030\",\"attributes\":{\"ref_id\":\"b9\"}},{\"start\":\"5739\",\"end\":\"5776\",\"attributes\":{\"ref_id\":\"b11\"}},{\"start\":\"9781\",\"end\":\"9799\",\"attributes\":{\"ref_id\":\"b4\"}}]", "figure": "[{\"start\":\"11579\",\"end\":\"11668\",\"attributes\":{\"id\":\"fig_0\"}},{\"start\":\"11669\",\"end\":\"11854\",\"attributes\":{\"id\":\"tab_1\",\"type\":\"table\"}},{\"start\":\"11855\",\"end\":\"12323\",\"attributes\":{\"id\":\"tab_4\",\"type\":\"table\"}},{\"start\":\"12324\",\"end\":\"12398\",\"attributes\":{\"id\":\"tab_5\",\"type\":\"table\"}}]", "paragraph": "[{\"start\":\"885\",\"end\":\"1953\"},{\"start\":\"1955\",\"end\":\"2857\"},{\"start\":\"2859\",\"end\":\"3784\"},{\"start\":\"3863\",\"end\":\"3999\"},{\"start\":\"4016\",\"end\":\"4791\"},{\"start\":\"4793\",\"end\":\"5670\"},{\"start\":\"5682\",\"end\":\"6321\"},{\"start\":\"6323\",\"end\":\"6800\"},{\"start\":\"6802\",\"end\":\"6908\"},{\"start\":\"6910\",\"end\":\"6996\"},{\"start\":\"6998\",\"end\":\"7403\"},{\"start\":\"7405\",\"end\":\"7568\"},{\"start\":\"7570\",\"end\":\"7869\"},{\"start\":\"7881\",\"end\":\"9087\"},{\"start\":\"9089\",\"end\":\"9287\"},{\"start\":\"9302\",\"end\":\"10935\"},{\"start\":\"10937\",\"end\":\"11488\"},{\"start\":\"11490\",\"end\":\"11578\"}]", "formula": null, "table_ref": "[{\"start\":\"7766\",\"end\":\"7774\"},{\"start\":\"8045\",\"end\":\"8052\"},{\"start\":\"8493\",\"end\":\"8500\",\"attributes\":{\"ref_id\":\"tab_1\"}},{\"start\":\"8941\",\"end\":\"8948\"},{\"start\":\"9168\",\"end\":\"9175\",\"attributes\":{\"ref_id\":\"tab_1\"}},{\"start\":\"9267\",\"end\":\"9274\",\"attributes\":{\"ref_id\":\"tab_4\"}},{\"start\":\"9279\",\"end\":\"9286\",\"attributes\":{\"ref_id\":\"tab_5\"}},{\"start\":\"9634\",\"end\":\"9641\",\"attributes\":{\"ref_id\":\"tab_4\"}}]", "section_header": "[{\"start\":\"871\",\"end\":\"883\",\"attributes\":{\"n\":\"1\"}},{\"start\":\"3787\",\"end\":\"3861\"},{\"start\":\"4002\",\"end\":\"4014\",\"attributes\":{\"n\":\"2\"}},{\"start\":\"5673\",\"end\":\"5680\",\"attributes\":{\"n\":\"3\"}},{\"start\":\"7872\",\"end\":\"7879\",\"attributes\":{\"n\":\"4\"}},{\"start\":\"9290\",\"end\":\"9300\",\"attributes\":{\"n\":\"5\"}},{\"start\":\"11580\",\"end\":\"11590\"},{\"start\":\"11670\",\"end\":\"11679\"},{\"start\":\"11856\",\"end\":\"11865\"},{\"start\":\"12325\",\"end\":\"12334\"}]", "table": "[{\"start\":\"11722\",\"end\":\"11854\"},{\"start\":\"11935\",\"end\":\"12323\"}]", "figure_caption": "[{\"start\":\"11592\",\"end\":\"11668\"},{\"start\":\"11681\",\"end\":\"11722\"},{\"start\":\"11867\",\"end\":\"11935\"},{\"start\":\"12336\",\"end\":\"12398\"}]", "figure_ref": "[{\"start\":\"7646\",\"end\":\"7654\",\"attributes\":{\"ref_id\":\"fig_0\"}},{\"start\":\"8132\",\"end\":\"8140\",\"attributes\":{\"ref_id\":\"fig_0\"}}]", "bib_author_first_name": "[{\"start\":\"12905\",\"end\":\"12906\"},{\"start\":\"12907\",\"end\":\"12908\"},{\"start\":\"12917\",\"end\":\"12918\"},{\"start\":\"13175\",\"end\":\"13176\"},{\"start\":\"13177\",\"end\":\"13178\"},{\"start\":\"13187\",\"end\":\"13188\"},{\"start\":\"13189\",\"end\":\"13190\"},{\"start\":\"13200\",\"end\":\"13201\"},{\"start\":\"13202\",\"end\":\"13203\"},{\"start\":\"13212\",\"end\":\"13213\"},{\"start\":\"13214\",\"end\":\"13215\"},{\"start\":\"13224\",\"end\":\"13225\"},{\"start\":\"13226\",\"end\":\"13227\"},{\"start\":\"13236\",\"end\":\"13237\"},{\"start\":\"13238\",\"end\":\"13239\"},{\"start\":\"13246\",\"end\":\"13247\"},{\"start\":\"13248\",\"end\":\"13249\"},{\"start\":\"13555\",\"end\":\"13556\"},{\"start\":\"13562\",\"end\":\"13563\"},{\"start\":\"13569\",\"end\":\"13570\"},{\"start\":\"13580\",\"end\":\"13581\"},{\"start\":\"13591\",\"end\":\"13592\"},{\"start\":\"13602\",\"end\":\"13603\"},{\"start\":\"13604\",\"end\":\"13605\"},{\"start\":\"13614\",\"end\":\"13615\"},{\"start\":\"13616\",\"end\":\"13617\"},{\"start\":\"13622\",\"end\":\"13623\"},{\"start\":\"13997\",\"end\":\"13998\"},{\"start\":\"14009\",\"end\":\"14010\"},{\"start\":\"14020\",\"end\":\"14021\"},{\"start\":\"14029\",\"end\":\"14030\"},{\"start\":\"14036\",\"end\":\"14037\"},{\"start\":\"14038\",\"end\":\"14039\"},{\"start\":\"14045\",\"end\":\"14046\"},{\"start\":\"14047\",\"end\":\"14048\"},{\"start\":\"14053\",\"end\":\"14054\"},{\"start\":\"14568\",\"end\":\"14569\"},{\"start\":\"14570\",\"end\":\"14571\"},{\"start\":\"14577\",\"end\":\"14578\"},{\"start\":\"14579\",\"end\":\"14580\"},{\"start\":\"14591\",\"end\":\"14592\"},{\"start\":\"14593\",\"end\":\"14594\"},{\"start\":\"14602\",\"end\":\"14603\"},{\"start\":\"14604\",\"end\":\"14605\"},{\"start\":\"14614\",\"end\":\"14615\"},{\"start\":\"14616\",\"end\":\"14617\"},{\"start\":\"14624\",\"end\":\"14625\"},{\"start\":\"14626\",\"end\":\"14627\"},{\"start\":\"14639\",\"end\":\"14640\"},{\"start\":\"14641\",\"end\":\"14642\"},{\"start\":\"14918\",\"end\":\"14919\"},{\"start\":\"14933\",\"end\":\"14934\"},{\"start\":\"15383\",\"end\":\"15384\"},{\"start\":\"15396\",\"end\":\"15397\"},{\"start\":\"15409\",\"end\":\"15410\"},{\"start\":\"15636\",\"end\":\"15637\"},{\"start\":\"15647\",\"end\":\"15648\"},{\"start\":\"15659\",\"end\":\"15660\"},{\"start\":\"15668\",\"end\":\"15669\"},{\"start\":\"16016\",\"end\":\"16017\"},{\"start\":\"16026\",\"end\":\"16027\"},{\"start\":\"16464\",\"end\":\"16465\"},{\"start\":\"16476\",\"end\":\"16477\"},{\"start\":\"16490\",\"end\":\"16491\"},{\"start\":\"16492\",\"end\":\"16493\"},{\"start\":\"16501\",\"end\":\"16502\"},{\"start\":\"16503\",\"end\":\"16504\"},{\"start\":\"16778\",\"end\":\"16779\"},{\"start\":\"16791\",\"end\":\"16792\"},{\"start\":\"16800\",\"end\":\"16801\"},{\"start\":\"16811\",\"end\":\"16812\"},{\"start\":\"17266\",\"end\":\"17267\"},{\"start\":\"17276\",\"end\":\"17277\"},{\"start\":\"17278\",\"end\":\"17279\"},{\"start\":\"17287\",\"end\":\"17288\"},{\"start\":\"17295\",\"end\":\"17296\"},{\"start\":\"17297\",\"end\":\"17298\"},{\"start\":\"17623\",\"end\":\"17624\"},{\"start\":\"18152\",\"end\":\"18153\"},{\"start\":\"18164\",\"end\":\"18165\"},{\"start\":\"18173\",\"end\":\"18174\"},{\"start\":\"18185\",\"end\":\"18186\"}]", "bib_author_last_name": "[{\"start\":\"12909\",\"end\":\"12915\"},{\"start\":\"12919\",\"end\":\"12930\"},{\"start\":\"13179\",\"end\":\"13185\"},{\"start\":\"13191\",\"end\":\"13198\"},{\"start\":\"13204\",\"end\":\"13210\"},{\"start\":\"13216\",\"end\":\"13222\"},{\"start\":\"13228\",\"end\":\"13234\"},{\"start\":\"13240\",\"end\":\"13244\"},{\"start\":\"13250\",\"end\":\"13256\"},{\"start\":\"13557\",\"end\":\"13560\"},{\"start\":\"13564\",\"end\":\"13567\"},{\"start\":\"13571\",\"end\":\"13578\"},{\"start\":\"13582\",\"end\":\"13589\"},{\"start\":\"13593\",\"end\":\"13600\"},{\"start\":\"13606\",\"end\":\"13612\"},{\"start\":\"13618\",\"end\":\"13620\"},{\"start\":\"13999\",\"end\":\"14007\"},{\"start\":\"14011\",\"end\":\"14018\"},{\"start\":\"14022\",\"end\":\"14027\"},{\"start\":\"14031\",\"end\":\"14034\"},{\"start\":\"14040\",\"end\":\"14043\"},{\"start\":\"14049\",\"end\":\"14051\"},{\"start\":\"14055\",\"end\":\"14058\"},{\"start\":\"14572\",\"end\":\"14575\"},{\"start\":\"14581\",\"end\":\"14589\"},{\"start\":\"14595\",\"end\":\"14600\"},{\"start\":\"14606\",\"end\":\"14612\"},{\"start\":\"14618\",\"end\":\"14622\"},{\"start\":\"14628\",\"end\":\"14637\"},{\"start\":\"14643\",\"end\":\"14648\"},{\"start\":\"14920\",\"end\":\"14931\"},{\"start\":\"14935\",\"end\":\"14942\"},{\"start\":\"15385\",\"end\":\"15394\"},{\"start\":\"15398\",\"end\":\"15407\"},{\"start\":\"15411\",\"end\":\"15416\"},{\"start\":\"15638\",\"end\":\"15645\"},{\"start\":\"15649\",\"end\":\"15657\"},{\"start\":\"15661\",\"end\":\"15666\"},{\"start\":\"15670\",\"end\":\"15674\"},{\"start\":\"16018\",\"end\":\"16024\"},{\"start\":\"16028\",\"end\":\"16033\"},{\"start\":\"16466\",\"end\":\"16474\"},{\"start\":\"16478\",\"end\":\"16488\"},{\"start\":\"16494\",\"end\":\"16499\"},{\"start\":\"16505\",\"end\":\"16516\"},{\"start\":\"16780\",\"end\":\"16789\"},{\"start\":\"16793\",\"end\":\"16798\"},{\"start\":\"16802\",\"end\":\"16809\"},{\"start\":\"16813\",\"end\":\"16818\"},{\"start\":\"17268\",\"end\":\"17274\"},{\"start\":\"17280\",\"end\":\"17285\"},{\"start\":\"17289\",\"end\":\"17293\"},{\"start\":\"17299\",\"end\":\"17305\"},{\"start\":\"17625\",\"end\":\"17633\"},{\"start\":\"18154\",\"end\":\"18162\"},{\"start\":\"18166\",\"end\":\"18171\"},{\"start\":\"18175\",\"end\":\"18183\"},{\"start\":\"18187\",\"end\":\"18193\"}]", "bib_entry": "[{\"start\":\"12769\",\"end\":\"13126\",\"attributes\":{\"id\":\"b0\"}},{\"start\":\"13128\",\"end\":\"13474\",\"attributes\":{\"matched_paper_id\":\"10397812\",\"id\":\"b1\"}},{\"start\":\"13476\",\"end\":\"13906\",\"attributes\":{\"matched_paper_id\":\"15241604\",\"id\":\"b2\",\"doi\":\"10.1016/j.jbi.2011.01.004\"}},{\"start\":\"13908\",\"end\":\"14496\",\"attributes\":{\"matched_paper_id\":\"21695200\",\"id\":\"b3\"}},{\"start\":\"14498\",\"end\":\"14865\",\"attributes\":{\"matched_paper_id\":\"42126553\",\"id\":\"b4\"}},{\"start\":\"14867\",\"end\":\"15290\",\"attributes\":{\"matched_paper_id\":\"9282777\",\"id\":\"b5\"}},{\"start\":\"15292\",\"end\":\"15634\",\"attributes\":{\"matched_paper_id\":\"18989197\",\"id\":\"b6\"}},{\"start\":\"15636\",\"end\":\"15947\",\"attributes\":{\"id\":\"b7\",\"doi\":\"arXiv:1809.00732\"}},{\"start\":\"15949\",\"end\":\"16400\",\"attributes\":{\"matched_paper_id\":\"15760232\",\"id\":\"b8\"}},{\"start\":\"16402\",\"end\":\"16715\",\"attributes\":{\"id\":\"b9\",\"doi\":\"arXiv:1805.06816\"}},{\"start\":\"16717\",\"end\":\"17184\",\"attributes\":{\"matched_paper_id\":\"11816014\",\"id\":\"b10\"}},{\"start\":\"17186\",\"end\":\"17570\",\"attributes\":{\"matched_paper_id\":\"30029552\",\"id\":\"b11\",\"doi\":\"10.1136/amiajnl-2011-000203\"}},{\"start\":\"17572\",\"end\":\"18104\",\"attributes\":{\"matched_paper_id\":\"13519577\",\"id\":\"b12\"}},{\"start\":\"18106\",\"end\":\"18565\",\"attributes\":{\"matched_paper_id\":\"1428529\",\"id\":\"b13\"}}]", "bib_title": "[{\"start\":\"13128\",\"end\":\"13173\"},{\"start\":\"13476\",\"end\":\"13553\"},{\"start\":\"13908\",\"end\":\"13995\"},{\"start\":\"14498\",\"end\":\"14566\"},{\"start\":\"14867\",\"end\":\"14916\"},{\"start\":\"15292\",\"end\":\"15381\"},{\"start\":\"15949\",\"end\":\"16014\"},{\"start\":\"16717\",\"end\":\"16776\"},{\"start\":\"17186\",\"end\":\"17264\"},{\"start\":\"17572\",\"end\":\"17621\"},{\"start\":\"18106\",\"end\":\"18150\"}]", "bib_author": "[{\"start\":\"12905\",\"end\":\"12917\"},{\"start\":\"12917\",\"end\":\"12932\"},{\"start\":\"13175\",\"end\":\"13187\"},{\"start\":\"13187\",\"end\":\"13200\"},{\"start\":\"13200\",\"end\":\"13212\"},{\"start\":\"13212\",\"end\":\"13224\"},{\"start\":\"13224\",\"end\":\"13236\"},{\"start\":\"13236\",\"end\":\"13246\"},{\"start\":\"13246\",\"end\":\"13258\"},{\"start\":\"13555\",\"end\":\"13562\"},{\"start\":\"13562\",\"end\":\"13569\"},{\"start\":\"13569\",\"end\":\"13580\"},{\"start\":\"13580\",\"end\":\"13591\"},{\"start\":\"13591\",\"end\":\"13602\"},{\"start\":\"13602\",\"end\":\"13614\"},{\"start\":\"13614\",\"end\":\"13622\"},{\"start\":\"13622\",\"end\":\"13626\"},{\"start\":\"13997\",\"end\":\"14009\"},{\"start\":\"14009\",\"end\":\"14020\"},{\"start\":\"14020\",\"end\":\"14029\"},{\"start\":\"14029\",\"end\":\"14036\"},{\"start\":\"14036\",\"end\":\"14045\"},{\"start\":\"14045\",\"end\":\"14053\"},{\"start\":\"14053\",\"end\":\"14060\"},{\"start\":\"14568\",\"end\":\"14577\"},{\"start\":\"14577\",\"end\":\"14591\"},{\"start\":\"14591\",\"end\":\"14602\"},{\"start\":\"14602\",\"end\":\"14614\"},{\"start\":\"14614\",\"end\":\"14624\"},{\"start\":\"14624\",\"end\":\"14639\"},{\"start\":\"14639\",\"end\":\"14650\"},{\"start\":\"14918\",\"end\":\"14933\"},{\"start\":\"14933\",\"end\":\"14944\"},{\"start\":\"15383\",\"end\":\"15396\"},{\"start\":\"15396\",\"end\":\"15409\"},{\"start\":\"15409\",\"end\":\"15418\"},{\"start\":\"15636\",\"end\":\"15647\"},{\"start\":\"15647\",\"end\":\"15659\"},{\"start\":\"15659\",\"end\":\"15668\"},{\"start\":\"15668\",\"end\":\"15676\"},{\"start\":\"16016\",\"end\":\"16026\"},{\"start\":\"16026\",\"end\":\"16035\"},{\"start\":\"16464\",\"end\":\"16476\"},{\"start\":\"16476\",\"end\":\"16490\"},{\"start\":\"16490\",\"end\":\"16501\"},{\"start\":\"16501\",\"end\":\"16518\"},{\"start\":\"16778\",\"end\":\"16791\"},{\"start\":\"16791\",\"end\":\"16800\"},{\"start\":\"16800\",\"end\":\"16811\"},{\"start\":\"16811\",\"end\":\"16820\"},{\"start\":\"17266\",\"end\":\"17276\"},{\"start\":\"17276\",\"end\":\"17287\"},{\"start\":\"17287\",\"end\":\"17295\"},{\"start\":\"17295\",\"end\":\"17307\"},{\"start\":\"17623\",\"end\":\"17635\"},{\"start\":\"18152\",\"end\":\"18164\"},{\"start\":\"18164\",\"end\":\"18173\"},{\"start\":\"18173\",\"end\":\"18185\"},{\"start\":\"18185\",\"end\":\"18195\"}]", "bib_venue": "[{\"start\":\"14147\",\"end\":\"14217\"},{\"start\":\"15032\",\"end\":\"15103\"},{\"start\":\"15446\",\"end\":\"15457\"},{\"start\":\"16128\",\"end\":\"16204\"},{\"start\":\"16903\",\"end\":\"16969\"},{\"start\":\"17771\",\"end\":\"17890\"},{\"start\":\"18287\",\"end\":\"18362\"},{\"start\":\"12769\",\"end\":\"12903\"},{\"start\":\"13258\",\"end\":\"13277\"},{\"start\":\"13651\",\"end\":\"13666\"},{\"start\":\"14060\",\"end\":\"14145\"},{\"start\":\"14650\",\"end\":\"14653\"},{\"start\":\"14944\",\"end\":\"15030\"},{\"start\":\"15418\",\"end\":\"15444\"},{\"start\":\"15692\",\"end\":\"15766\"},{\"start\":\"16035\",\"end\":\"16126\"},{\"start\":\"16402\",\"end\":\"16462\"},{\"start\":\"16820\",\"end\":\"16901\"},{\"start\":\"17334\",\"end\":\"17355\"},{\"start\":\"17635\",\"end\":\"17769\"},{\"start\":\"18195\",\"end\":\"18285\"}]"}}}, "year": 2023, "month": 12, "day": 17}