{"id": 206594923, "updated": "2023-11-08 14:37:03.8", "metadata": {"title": "Self-critical Sequence Training for Image Captioning", "authors": "[{\"first\":\"Steven\",\"last\":\"Rennie\",\"middle\":[\"J.\"]},{\"first\":\"Etienne\",\"last\":\"Marcheret\",\"middle\":[]},{\"first\":\"Youssef\",\"last\":\"Mroueh\",\"middle\":[]},{\"first\":\"Jarret\",\"last\":\"Ross\",\"middle\":[]},{\"first\":\"Vaibhava\",\"last\":\"Goel\",\"middle\":[]}]", "venue": "ArXiv", "journal": "ArXiv", "publication_date": {"year": 2016, "month": 12, "day": 2}, "abstract": "Recently it has been shown that policy-gradient methods for reinforcement learning can be utilized to train deep end-to-end systems directly on non-differentiable metrics for the task at hand. In this paper we consider the problem of optimizing image captioning systems using reinforcement learning, and show that by carefully optimizing our systems using the test metrics of the MSCOCO task, significant gains in performance can be realized. Our systems are built using a new optimization approach that we call self-critical sequence training (SCST). SCST is a form of the popular REINFORCE algorithm that, rather than estimating a\"baseline\"to normalize the rewards and reduce variance, utilizes the output of its own test-time inference algorithm to normalize the rewards it experiences. Using this approach, estimating the reward signal (as actor-critic methods must do) and estimating normalization (as REINFORCE algorithms typically do) is avoided, while at the same time harmonizing the model with respect to its test-time inference procedure. Empirically we find that directly optimizing the CIDEr metric with SCST and greedy decoding at test-time is highly effective. Our results on the MSCOCO evaluation sever establish a new state-of-the-art on the task, improving the best result in terms of CIDEr from 104.9 to 112.3.", "fields_of_study": "[\"Computer Science\"]", "external_ids": {"arxiv": "1612.00563", "mag": "2963084599", "acl": null, "pubmed": null, "pubmedcentral": null, "dblp": "conf/cvpr/RennieMMRG17", "doi": "10.1109/cvpr.2017.131"}}, "content": {"source": {"pdf_hash": "dd9a9175fa952a3888da3aafba13e777588dc574", "pdf_src": "Arxiv", "pdf_uri": "[\"https://arxiv.org/pdf/1612.00563v1.pdf\"]", "oa_url_match": true, "oa_info": {"license": null, "open_access_url": "http://arxiv.org/pdf/1612.00563", "status": "GREEN"}}, "grobid": {"id": "e2b6899d9e531c5bc3d8c2e92c52bb17e118f7fa", "type": "plain-text", "url": "s3://ai2-s2-pdf-extraction-prod/parse-results/s2orc_worker/dd9a9175fa952a3888da3aafba13e777588dc574.txt", "contents": "\nSelf-critical Sequence Training for Image Captioning\n\n\nSteven J Rennie sjrennie@us.ibm.com \nWatson Multimodal Algorithms and Engines Group IBM T.J. Watson Research Center\nNYUSA\n\nEtienne Marcheret etiennem@us.ibm.com \nWatson Multimodal Algorithms and Engines Group IBM T.J. Watson Research Center\nNYUSA\n\nYoussef Mroueh mroueh@us.ibm.com \nWatson Multimodal Algorithms and Engines Group IBM T.J. Watson Research Center\nNYUSA\n\nJarret Ross rossja@us.ibm.com \nWatson Multimodal Algorithms and Engines Group IBM T.J. Watson Research Center\nNYUSA\n\nVaibhava Goel vgoel@us.ibm.com \nWatson Multimodal Algorithms and Engines Group IBM T.J. Watson Research Center\nNYUSA\n\nSelf-critical Sequence Training for Image Captioning\n\nRecently it has been shown that policy-gradient methods for reinforcement learning can be utilized to train deep endto-end systems directly on non-differentiable metrics for the task at hand. In this paper we consider the problem of optimizing image captioning systems using reinforcement learning, and show that by carefully optimizing our systems using the test metrics of the MSCOCO task, significant gains in performance can be realized. Our systems are built using a new optimization approach that we call self-critical sequence training (SCST). SCST is a form of the popular RE-INFORCE algorithm that, rather than estimating a \"baseline\" to normalize the rewards and reduce variance, utilizes the output of its own test-time inference algorithm to normalize the rewards it experiences. Using this approach, estimating the reward signal (as actor-critic methods must do) and estimating normalization (as REINFORCE algorithms typically do) is avoided, while at the same time harmonizing the model with respect to its test-time inference procedure. Empirically we find that directly optimizing the CIDEr metric with SCST and greedy decoding at test-time is highly effective. Our results on the MSCOCO evaluation sever establish a new state-of-the-art on the task, improving the best result in terms of CIDEr from 104.9 to 112.3.\n\nIntroduction\n\nImage captioning aims at generating a natural language description of an image. Open domain captioning is a very challenging task, as it requires a fine-grained understanding of the global and the local entities in an image, as well as their attributes and relationships. The recently released MSCOCO challenge [1] provides a new, larger scale platform for evaluating image captioning systems, complete with an evaluation server for benchmarking competing methods. Deep learning approaches to sequence modeling have yielded impressive results on the task, dominating the task leaderboard. Inspired by the recently introduced encoder/decoder paradigm for machine translation using recurrent neural networks (RNNs) [2], [3], and [4] use a deep convolutional neural network (CNN) to encode the input image, and a Long Short Term Memory (LSTM) [5] RNN decoder to generate the output caption. These systems are trained end-to-end using back-propagation, and have achieved state-of-the-art results on MSCOCO. More recently in [6], the use of spatial attention mechanisms on CNN layers to incorporate visual context-which implicitly conditions on the text generated so far-was incorporated into the generation process. It has been shown and we have qualitatively observed that captioning systems that utilize attention mechanisms lead to better generalization, as these models can compose novel text descriptions based on the recognition of the global and local entities that comprise images.\n\nAs discussed in [7], deep generative models for text are typically trained to maximize the likelihood of the next ground-truth word given the previous ground-truth word using back-propagation. This approach has been called \"Teacher-Forcing\" [8]. However, this approach creates a mismatch between training and testing, since at test-time the model uses the previously generated words from the model distribution to predict the next word. This exposure bias [7], results in error accumulation during generation at test time, since the model has never been exposed to its own predictions.\n\nSeveral approaches to overcoming the exposure bias problem described above have recently been proposed. In [8] they show that feeding back the model's own predictions and slowly increasing the feedback probability p during training leads to significantly better test-time performance. Another line of work proposes \"Professor-Forcing\" [9], a technique that uses adversarial training to encourage the dynamics of the recurrent network to be the same when training conditioned on ground truth previous words and when sampling freely from the network.\n\nWhile sequence models are usually trained using the cross entropy loss, they are typically evaluated at test time using discrete and non-differentiable NLP metrics such as BLEU [10], ROUGE [11], METEOR [12] or CIDEr [13].\n\nIdeally sequence models for image captioning should be trained to avoid exposure bias and directly optimize metrics for the task at hand.\n\nRecently it has been shown that both the exposure bias and non-differentiable task metric issues can be addressed by incorporating techniques from Reinforcement Learning (RL) [14]. Specifically in [7], Ranzato et al. use the REINFORCE algorithm [15] to directly optimize nondifferentiable, sequence-based test metrics, and overcome both issues. REINFORCE as we will describe, allows one to optimize the gradient of the expected reward by sampling from the model during training, and treating those samples as ground-truth labels (that are re-weighted by the reward they deliver). The major limitation of the approach is that the expected gradient computed using mini-batches under REINFORCE typically exhibit high variance, and without proper context-dependent normalization, is typically unstable. The recent discovery that REINFORCE with proper bias correction using learned \"baselines\" is effective has led to a flurry of work in applying REINFORCE to problems in RL, supervised learning, and variational inference [16,17,18]. Actor-critic methods [14] , which instead train a second \"critic\" network to provide an estimate of the value of each generated word given the policy of an actor network, have also been investigated for sequence problems recently [19]. These techniques overcome the need to sample from the policy's (actors) action space, which can be enormous, at the expense of estimating future rewards, and training multiple networks based on one another's outputs, which as [19] explore, can also be unstable.\n\nIn this paper we present a new approach to sequence training which we call self-critical sequence training (SCST), and demonstrate that SCST can improve the performance of image captioning systems dramatically. SCST is a REINFORCE algorithm that, rather than estimating the reward signal, or how the reward signal should be normalized, utilizes the output of its own test-time inference algorithm to normalize the rewards it experiences. As a result, only samples from the model that outperform the current test-time system are given positive weight, and inferior samples are suppressed. Using SCST, attempting to estimate the reward signal, as actor-critic methods must do, and estimating normalization, as REINFORCE algorithms must do, is avoided, while at the same time harmonizing the model with respect to its test-time inference procedure. Empirically we find that directly optimizing the CIDEr metric with SCST and greedy decoding at test-time is highly effective. Our results on the MSCOCO evaluation sever establish a new state-of-the-art on the task, improving the best result in terms of CIDEr from 104.9 to 112.3.\n\n\nCaptioning Models\n\nIn this section we describe the recurrent models that we use for caption generation.\n\nFC models. Similarly to [3,4], we first encode the input image F using a deep CNN, and then embed it through a linear projection W I . Words are represented with one hot vectors that are embedded with a linear embedding E that has the same output dimension as W I . The beginning of each sentence is marked with a special BOS token, and the end with an EOS token. Under the model, words are generated and then fed back into the LSTM, with the image treated as the first word W I CN N (F ). The following updates for the hidden units and cells of an LSTM define the model [5]:\nx t = E1 wt−1 for t > 1, x 1 = W I CN N (F ) i t = σ (W ix x t + W ih h t−1 + b i ) (Input Gate) f t = σ (W f x x t + W f h h t−1 + b f ) (Forget Gate) o t = σ (W ox x t + W oh h t−1 + b o ) (Output Gate) c t = i t φ(W ⊗ zx x t + W ⊗ zh h t−1 + b ⊗ z ) + f t c t−1 h t = o t tanh(c t ) s t = W s h t ,\nwhere φ is a maxout non-linearity with 2 units (⊗ denotes the units) and σ is the sigmoid function. We initialize h 0 and c 0 to zero. The LSTM outputs a distribution over the next word w t using the softmax function:\nw t ∼ softmax (s t )(1)\nIn our architecture, the hidden states and word and image embeddings have dimension 512. Let θ denote the parameters of the model. Traditionally the parameters θ are learned by maximizing the likelihood of the observed sequence. Specifically, given a target ground truth sequence {w * 1 , . . . , w * T }, the objective is to minimize the cross entropy loss (XE):\nL(θ) = − T t=1 log(p θ (w * t |w * 1 , . . . w * t−1 )),(2)\nwhere p θ (w t |w 1 , . . . w t−1 ) is given by the parametric model in Equation (1).\n\nAttention Model (Att2in). Rather than utilizing a static, spatially pooled representation of the image, attention models dynamically re-weight the input spatial (CNN) features to focus on specific regions of the image at each time step.\n\nIn this paper we modify the architecture of the attention model for captioning given in [6], and input the attentionderived image feature only to the cell node of the LSTM. We have found that this architecture outperforms other designs when ADAM [20] is used for optimization.\nx t = E1 wt−1 for t ≥ 1 w 0 = BOS i t = σ (W ix x t + W ih h t−1 + b i ) (Input Gate) f t = σ (W f x x t + W f h h t−1 + b f ) (Forget Gate) o t = σ (W ox x t + W oh h t−1 + b o ) (Output Gate) c t = i t φ(W ⊗ zx x t + W ⊗ zI I t + W ⊗ zh h t−1 + b ⊗ z ) + f t c t−1 h t = o t tanh(c t ) s t = W s h t ,\nwhere I t is the attention-derived image feature. This feature is derived as in [6] as follows: given CNN features at\nN locations {I 1 , . . . I N }, I t = N i=1 α i t I i , where α t = softmax(a t + b α ), and a i t = W tanh(W aI I i + W ah h t−1 + b a ).\nIn this work we set the dimension of W to 1 × 512, and set c 0 and h 0 to zero. Let θ denote the parameters of the model. Then p θ (w t |w 1 , . . . w t−1 ) is again defined by (1). The parameters θ of attention models are also traditionally learned by optimizing the XE loss (2).\n\n\nReinforcement Learning\n\nSequence Generation as an RL problem. As described in the previous section, captioning systems are traditionally trained using the cross entropy loss. To directly optimize NLP metrics and address the exposure bias issue, we can cast our generative models in the Reinforcement Learning terminology as in [7]. Our recurrent models (LSTM) introduced above can be viewed as an \"agent\" that interacts with an external \"environment\" (words and image features). The parameters of the network, θ, define a policy p θ , that results in an \"action\" that is the prediction of the next word. After each action, the agent (the LSTM) updates its internal \"state\" (cells and hidden states of the LSTM, attention weights etc). Upon generating the end-of-sequence (EOS) token, the agent observes a \"reward\" that is, for instance, the CIDEr score of the generated sentence-we denote this reward by r. The reward is computed by an evaluation metric by comparing the generated sequence to corresponding ground-truth sequences. The goal of training is to minimize the negative expected reward:\nL(θ) = −E w s ∼p θ [r(w s )] ,(3)\nwhere w s = (w s 1 , . . . w s T ) and w s t is the word sampled from the model at the time step t. In practice L(θ) is typically estimated with a single sample from p θ :\nL(θ) ≈ −r(w s ), w s ∼ p θ .\nPolicy Gradient with REINFORCE. In order to compute the gradient ∇ θ L(θ), we use the REINFORCE algorithm [15](See also Chapter 13 in [14]). REINFORCE is based on the observation that the expected gradient of a nondifferentiable reward function can be computed as follows:\n∇ θ L(θ) = −E w s ∼p θ [r(w s )∇ θ log p θ (w s )] .(4)\nIn practice the expected gradient can be approximated using a single Monte-Carlo sample w s = (w s 1 . . . w s T ) from p θ , for each training example in the minibatch:\n∇ θ L(θ) ≈ −r(w s )∇ θ log p θ (w s ).\nREINFORCE with a Baseline. The policy gradient given by REINFORCE can be generalized to compute the reward associated with an action value relative to a reference reward or baseline b:\n∇ θ L(θ) = −E w s ∼p θ [(r(w s ) − b)∇ θ log p θ (w s )] . (5)\nThe baseline can be any arbitrary function, as long as it does not depend on the \"action\" w s [14] since in this case:\nE w s ∼p θ [b∇ θ log p θ (w s )] = b ws ∇ θ p θ (w s ) = b∇ θ ws p θ (w s ) = b∇ θ 1 = 0.(6)\nThis shows that the baseline does not change the expected gradient, but importantly, it can reduce the the variance of the gradient estimate. For each training case, we again approximate the expected gradient with a single sample w s ∼ p θ :\n∇ θ L(θ) ≈ −(r(w s ) − b)∇ θ log p θ (w s ).(7)\nNote that if b is function of θ or t as in [7], equation (6) still holds and b(θ) is a valid baseline.\n\nFinal Gradient Expression. Using the chain rule, and the parametric model of p θ given in Section 2 we have:\n∇ θ L(θ) = T t=1 ∂L(θ) ∂s t ∂s t ∂θ ,\nwhere s t is the input to the softmax function. Using RE-INFORCE with a baseline b the estimate of the gradient of\n∂L(θ)\n∂st is given by [17]:\n∂L(θ) ∂s t ≈ (r(w s ) − b)(p θ (w t |h t ) − 1 w s t ).(8)\n\nSelf-critical sequence training (SCST)\n\nThe central idea of the self-critical sequence training (SCST) approach is to baseline the REINFORCE algorithm with the reward obtained by the current model under the inference algorithm used at test time. The gradient of the negative reward of a sample w s from the model w.r.t. to the softmax activations at time-step t then becomes:\n∂L(θ) ∂s t = (r(w s ) − r(ŵ))(p θ (w t |h t ) − 1 w s t ).(9)(r(w s 1 , . . . , w s T ) r(ŵ 1 , . . . ,ŵ T )) r ✓ log p ✓ (w s 1 , . . . , w s T ) BOS p✓(w|h1) p✓(w|h2) CIDER (w s 1 , . . . , w s T ) r(w s 1 , . . . , w s T ) w s 1 w s 2 h0, c0 h1, c1 = LST M (BOS, h0, c0) h2, c2 = LST M (w s 1 , h1, c1) {(w ⇤ 1 , . . . , w ⇤ T )} sample sample BOS CIDER arg max arg max p ✓ (w|h 0 1 ) p✓(w|h 0 2 ) (ŵ 1 , . . . ,ŵ T ) r(ŵ 1 , . . . ,ŵ T ) w 1ŵ2 h 0 0 , c 0 0 h 0 1 , c 0 1 = LST M (BOS, h 0 0 , c 0 0 ) h 0 2 , c 0 2 = LST M (ŵ1, h 0 1 , c 0 1 ) {(w ⇤ 1 , . . . , w ⇤ T )}\narg max arg max Figure 1: Self-critical sequence training (SCST). The weight put on words of a sampled sentence from the model is determined by the difference between the reward for the sampled sentence and the reward obtained by the estimated sentence under the test-time inference procedure (greedy inference depicted). This harmonizes learning with the inference procedure, and lowers the variance of the gradients, improving the training procedure.\n\nwhere r(ŵ) again is the reward obtained by the current model under the inference algorithm used at test time. Accordingly, samples from the model that return higher reward thanŵ will be \"pushed up\", or increased in probability, while samples which result in lower reward will be suppressed. Like MIXER [7], SCST has all the advantages of REINFORCE algorithms, as it directly optimizes the true, sequence-level, evaluation metric, but avoids the usual scenario of having to learn a (context-dependent) estimate of expected future rewards as a baseline. In practice we have found that SCST has much lower variance, and can be more effectively trained on mini-batches of samples using SGD.\n\nSince the SCST baseline is based on the test-time estimate under the current model, SCST is forced to improve the performance of the model under the inference algorithm used at test time. This encourages training/test time consistency like the maximum likelihood-based approaches \"Data as Demonstrator\" [8], \"Professor Forcing\" [9], and E2E [7], but importantly, it can directly optimize sequence metrics. Finally, SCST is self-critical, and so avoids all the inherent training difficulties associated with actor-critic methods, where a second \"critic\" network must be trained to estimate value functions, and the actor must be trained on estimated value functions rather than actual rewards.\n\nIn this paper we focus on scenario of greedy decoding, where:ŵ t = arg max\nwt p(w t | h t )(10)\nThis choice, depicted in Figure 1, has several practical advantages. First and foremost, it minimizes the impact of baselining with the test-time inference algorithm on train-ing time, since it requires only one additional forward pass, and trains the system to be optimized for fast, greedy decoding at test-time. This choice may also be among the best forms of SCST based on a single test-time estimate, as suppressing all samples that underperform relative to the final test-time estimate will tend to favor a very decisive policy. The investigation of forms of SCST that incorporate margin, utilize more than 1 test-time estimate (e.g. an n-best list) to baseline, and/or more elaborate test-time inference procedures (e.g. beam search) are interesting possible directions of future work.\n\n\nExperiments\n\nDataset.\n\nWe evaluate our proposed method on the MSCOCO dataset [1]. For offline evaluation purposes we used the data splits from [21]. The training set contains 113, 287 images, along with 5 captions each. We use a set of 5K image for validation and report results on a test set of 5K images as well, as given in [21]. We report four widely used automatic evaluation metrics, BLEU-4, ROUGEL, METEOR, and CIDEr. We prune the vocabulary and drop any word that has count less then five, we end up with a vocabulary of size 10096 words.\n\nImage Features 1) FC Models. We use two type of Features: a) (FC-2k) features, where we encode each image with Resnet-101 (101 layers) [22]. Note that we do not rescale or crop each image. Instead we encode the full image with the final convolutional layer of resnet, and apply average pooling, which results in a vector of dimension 2048. b) (FC-15K) features where we stack average pooled 13 layers of Resnet-101 (11 × 1024 and 2 × 2048). These 13 layers are the odd layers of conv4 and conv5, with the exception of the 23rd layer of conv4, which was omitted. This results in a feature vector of dimension 15360. 2) Spatial CNN features for Attention models: (Att2in) We encode each image using the residual convolutional neural network Resnet-101 [22]. Note that we do not rescale or crop the image. Instead we encode the full image with the final convolutional layer of Resnet-101, and apply spatially adaptive average pooling so that the output has a fixed size of 14 × 14 × 2048. At each time step the attention model produces an attention mask over the 96 spatial locations. This mask is applied and then the result is spatially averaged to produce a 2048 dimension representation of the attended portion of the image. Implementation Details. The LSTM hidden, image, word and attention embeddings dimension are fixed to 512 for all of the models discussed herein. All of our models are trained according to the following recipe, except where otherwise noted. We initialize all models by training the model under the XE objective using ADAM [20] optimizer with an initial learning rate of 5 × 10 −4 . We anneal the learning rate by a factor of 0.8 every three epochs, and increase the probability of feeding back a sample of the word posterior by 0.05 every 5 epochs until we reach a feedback probability 0.25 [8]. We evaluate at each epoch the model on the development set and select the model with best CIDEr score as an initialization for SCST training. We then run SCST training initialized with the XE model to optimize the CIDEr metric (specifically, the CIDEr-D metric) using ADAM with a learning rate 5 × 10 −5 . Initially when experimenting with FC-2k and FC-15k models we utilized curriculum learning (CL) during training, as proposed in [7], by increasing the number of words that are sampled and trained under CIDEr by one each epoch (the prefix of the sentence remains under the XE criterion until eventually being subsumed). We have since realized that for the MSCOCO task CL is not required, and provides little to no boost in performance. The results reported here for the FC-2K and FC-15K models are trained with CL, while the attention models were trained directly on the entire sentence for all epochs after being initialized by the XE seed models.\n\n\nOffline Evaluation\n\nEvaluating different RL training strategies. Table 1 compares the performance of SCST to that of MIXER [7] on the test portion of the Karpathy splits. In this experiment, we utilize \"curriculum learning\" (CL) by optimizing the expected reward of the metric on the last n words of each training sentence, optimizing XE on the remaining sentence prefix, and slowly increasing n until the entire sentence is being sampled for all training cases. The results reported above were generated with a CL schedule matching the optimized schedule reported in [7]. Interestingly we found that CL was not necessary to successfully train both SCST and REINFORCE with a learned baseline on the MSCOCO dataset-equally good results relative to not applying CL could be obtained by both a learned baseline, as was done in [7], and SCST. The gain of using SCST over using a learned baseline was consistently about 4 CIDEr points, regardless of the CL schedule (or lack thereof), and the initialization seed.   to the best performance on that same metric at test time, an expected result. We experimented with training on multiple test metrics, and found that we were unable to outperform the overall performance of the model trained only on the CIDEr metric, which lifts the performance of all other metrics considerably. For this reason most of our experimentation has since focused on optimizing CIDEr.\n\nSingle FC-Models Versus Attention Models. We trained FC models (2K and 15 K), as well as attention models using SCST with the CIDEr metric. We trained 4 different models for each FC and attention, starting the optimization from four different random seeds 1 . We report in Table 3, the system with best performance for each family of models on the test portion of Karpathy splits [21]. We see that the FC-15K models outperform the FC-2K models. Both FC models are outperformed by the attention model, that establishes a new state of the art for a single model performance on Karpathy splits. Note that this quantitative evaluation favors attention models is inline with our observation that attention models tend to generalize better and compose outside of the context   Model Ensembling. In this section we use an ensemble of the four models mentioned above and trained using SCST in the FC and the attention modeling. We see in Table 5. Table 5 reports the performance of the 4 ensembled attention models trained with self-critical sequence training (SCST) on the official MSCOCO evaluation server. The previous best result on the leaderboard (as of Nov. 15,2016) is also depicted. We outperform the previous best system on all evaluation metrics.\n\n\nOnline Evaluation on MS-COCO Server\n\n\nExample of Generated Captions\n\nHere we provide a qualitative example of the captions generated by our systems for the input image in figure  2. This picture is taken from the objects out-of-context (OOOC) dataset of images from [24], and depicts a boat situated in an unusual context, and tests the ability of our models to compose descriptions of images that differ from those seen during training. The top 5 captions returned by the XE and SCST-trained FC-2K, FC-15K, and attention model ensembles when deployed with a decoding \"beam\" of 5 are depicted in figure 3 2 . On this image the FC models fail completely, and the SCST-trained ensemble of attention models is the only system that is able to correctly describe the image. In general we found that the performance of all captioning systems on MSCOCO data is qualitatively similar, while on images containing objects situated in an uncommon context [24] (i.e. unlike the MSCOCO training set) our attention models perform much better, and SCSTtrained attention models output yet more accurate and descriptive captions. In general we qualitatively found that SCST-trained attention models describe images more accurately, and with higher confidence, as reflected in Figure  2, where the average of the log-likelihoods of the words in each generated caption are also depicted. Additional examples, including an example with the corresponding heatmaps generated by the SCST-trained ensemble of attention models, can be found in the supplementary material (figure 7 of section C).\n\n\nDiscussion and Future Work\n\nIn this paper we have presented a simple and efficient approach to more effectively baselining the REINFORCE algorithm for policy-gradient based RL, which allows us to more effectively train on non-differentiable metrics, and leads to significant improvements in captioning performance on MSCOCO-our results on the MSCOCO evaluation sever establish a new state-of-the-art on the task. The self-critical approach, which normalizes the reward obtained by sampled sentences with the reward obtained by the model under the test-time inference algorithm is intuitive, and avoids having to estimate any state-dependent or independent reward functions. Extensions of SCST that incorporate margin or utilize more than 1 test-time estimate (e.g. an n-best list) to baseline, and/or more elaborate testtime inference procedures (e.g. beam search) are interesting possible directions of future work.\n\n\nA. Beam search\n\nThroughout the paper and in this supplementary material we often refer to caption results and evaluation metric results obtained using \"beam search\". This section briefly summarizes our beam search procedure. While decoding the image to generate captions that describe it, rather than greedily selecting the most probable word (N = 1), we can maintain a list of the N most probable sub-sequences generated so far, generate posterior probabilities for the next word of each of these subsequences, and then again prune down to the N -best sub-sequences. This approach is widely referred to as a beam search, where N is the width of the decoding \"beam\". In our experiments we additionally prune away hypotheses within the N -best list that have a log probability that is below that of the maximally probable partial sentence by more than ∆ log = 20. For all reported results, the value of N is tuned on a per-model basis on the validation set (of the Karpathy splits). On MSCOCO data, N = 2 is typically optimal for cross-entropy (XE) trained models and SCST-trained models, but in the latter case beam search provides only a very small boost in performance. For our captioning demonstrations we set N = 5 for all models for illustrative purposes, and because we have qualitatively observed that for test images that are substantially different from those encountered during training, beam search is important.\n\n\nB. Performance of XE versus SCST trained models\n\nIn tables 3 and 4 of the main text we compared the performance of models trained to optimize the CIDEr metric with self-critical sequence training (SCST) with that of their corresponding bootstrap models, which were trained under the crossentropy (XE) criterion using scheduled sampling [8]. We provide some additional details about these experiments here. For all XE models, the probability p f of feeding forward the maximally probable word rather than the ground-truth word was increased by 0.05 every 5 epochs until reaching a maximum value of 0.25. The XE model with the best performance on the validation set of the Karpathy splits was then selected as the bootstrap model for SCST.\n\nFor all models, the performance of greedily decoding each word at test time is reported, as is the performance of beam search as described in the previous section. As reported in [7], we found that beam search using RL-trained models resulted in very little performance gain. Figure 4 depicts the performance of our best Att2in model, which is trained to directly optimize the CIDEr metric, as a function of training epoch and evaluation metric, on the validation portion of the Karpathy splits. Optimizing CIDEr clearly improves all of the MSCOCO evaluation metrics substantially.\n\n\nC. Examples of Generated Captions\n\nFigures 5-13 depict demonstrations of the captioning performance of all systems. In general we found that the performance of all captioning systems on MSCOCO data is qualitatively similar, while on images containing objects situated in an uncommon context [24] (i.e. unlike the MSCOCO training set) our attention models perform much better, and SCST-trained attention models output yet more accurate and descriptive captions. Attention heat-maps for the image and corresponding captions depicted in 5 and 13 are given in 7. The heatmaps of the attention weights are reasonably inline with the predicted words in both cases, and the SCST attention weights are spatially sharper here, and in general.\n\n\nD. Further details and analysis of SCST training\n\nOne detail that was crucial to optimizing CIDEr to produce better models was to include the EOS tag as a word. When the EOS word was omitted, trivial sentence fragments such as \"with a\" and \"and a\" were dominating the metric gains, despite the \"gaming\" counter-measures (sentence length and precision clipping) that are included in CIDEr-D [13], which is what we optimized. Including the EOS tag substantially lowers the reward allocated to incomplete sentences, and completely resolved this issue. Another more obvious detail that is important is to associate the reward for the sentence with the first EOS encountered. Omitting the reward from the first EOS fails to reward sentence completion which leads to run-on, and rewarding any words that follow the first EOS token is inconsistent with the decoding procedure.\n\nThis work has focused on optimizing the CIDEr metric, since, as discussed in the paper, optimizing CIDER substantially improves all MSCOCO evaluation metrics, as was shown in tables 3 and 4 and is depicted in figure 4. Nevertheless, directly optimizing another metric does lead to higher evaluation scores on that same metric as shown, and so we have started to experiment with including models trained on Bleu, Rouge-L, and METEOR in our Att2in ensemble to attempt to improve it further. So far we have not been able to substantially improve performance w.r.t. the other metrics without more substantially degrading CIDEr.     Figure 8 by various models discussed in the paper. Beside each caption we report the average log probability of the words in the caption. All models perform well on this test image from the MSCOCO distribution. More generally we have observed that qualitatively, all models perform comparably on the MSCOCO test images.   Figure 10 by the various models discussed in the paper. Beside each caption we report the average log probability of the words in the caption. On this image, which presents an object situated in an atypical context [24], the FC models fail to give an accurate description, while the attention models handle the previously unseen image composition well. The models trained with SCST return a more accurate and more detailed summary of the image.   Figure 12 by the various models discussed in the paper. Beside each caption we report the average log probability of the words in the caption. On this image, which presents an object situated in an atypical context [24], the FC models fail to give an accurate description, while the attention models handle the previously unseen image composition well. The models trained with SCST return a more accurate and more detailed summary of the image.\n\nFigure 4 :\n4Performance of our best Att2in model, which is trained to directly optimize the CIDEr metric, as a function of training epoch on the validation portion of the Karpathy splits, for the CIDEr, BLEU-4, ROUGE-L, and METEOR MSCOCO evaluation metrics. Optimizing CIDEr improves all of these evaluation metrics substantially.\n\nFigure 5 :\n5Picture of a common object in MSCOCO (a giraffe) situated in an uncommon context (out of COCO domain)[24].\n\nFigure 6 :Figure 7 :\n67Captions generated by various models discussed in the paper to describe the image depicted infigure 5. Beside each caption we report the average of the log probabilities of each word, normalized by the sentence length. Notice that the attention models trained with SCST give an accurate description of this image with high confidence. Attention models trained with XE are less confident about the correct description. FC models trained with CE or SCST fail at giving an accurate description. dccxc026.pok.ibm.com:60000/upload (a) Attention heat-maps for the best model in the XE-trained ensemble of attention models, for the image depicted infigure 5. heat-maps for the best model in the SCST-trained ensemble of attention models, for the image depicted in figure 5.. Attention heat-maps.\n\nFigure 8 :\n8An image from the MSCOCO test set (Karpathy splits).\n\nFigure 9 :\n9Captions generated for the image depicted in\n\nFigure 10 :\n10An image from the objects out-of-context (OOOC) dataset of images from[24].\n\nFigure 11 :\n11Captions generated for the image depicted in\n\nFigure 12 :\n12An image from the objects out-of-context (OOOC) dataset of images from[24].\n\nFigure 13 :\n13Captions generated for the image depicted in\n\nTable 2 :\n2Training on different metrics.We experimented with training directly on the evaluation metrics of the MSCOCO challenge. Results for FC-2K models are depicted in table 2. In general we can see that optimizing for a given metric during training leadsPerformance on the test portion of the Karpathy \nsplits [21] as a function of training metric ( FC-2K models). \nOptimizing the CIDEr metric increases the overall perfor-\nmance under the evaluation metrics the most significantly. \nThe performance of the seed cross-entropy (XE) model is \nalso depicted. All models were decoded greedily, with the \nexception of the XE beam search result, which was opti-\nmized to beam 3 on the validation set. \n\n\n\nTable 3 :\n3Performance of the best XE and corresponding SCST-trained single models on the test portion of the Karpathy splits (best over 4 random seeds). The results obtained via the greedy decoding of each word and optimized beam search are depicted. Models learned using SCST were trained to directly optimize the CIDEr metric.\n\nTable 4 :\n4Performance of Ensembled XE and SCST-trained models on the test portion of the Karpathy splits (ensem-bled over 4 random seeds). The models learned using self-\ncritical sequence training (SCST) were trained to optimize \nthe CIDEr metric. \n\nof the training of MSCOCO, as we will see in Section 6. \n\nEnsemble \nEvaluation Metric \nSCST models CIDEr BLEU4 ROUGEL METEOR \nEns. 4 (Att2in) 112.3 \n34.4 \n55.9 \n26.8 \nPrevious best \n104.9 \n34.3 \n55.2 \n26.6 \n\n\n\nTable 5 :\n5Performance of 4 ensembled attention mod-\nels trained with self-critical sequence training (SCST) \non the official MSCOCO evaluation server (5 refer-\nence captions). \nThe previous best result on the \nleaderboard (as of 11/15/2016) is also depicted ( \nhttp://mscoco.org/dataset/#captions-leaderboard, Table C5, \nWatson Multimodal). \n\n\nplease consult the supplementary material for additional details regarding how the models were trained.\nthat ensembling improves performance and confirms the supremacy of attention modeling, and establishes yet another state of the art result on Karpathy splits[21]. Note that in our case we ensemble only 4 models and we don't do any fine-tuning of the Resnet. NIC[23], in contrast, used an ensemble of 15 models with fine-tuned CNNs.\nfor details regarding our test-time beam search procedure, please consult section A of the supplementary material.\nFigure 2: An image from the objects out-of-context (OOOC) dataset of images from[24].Image Caption Generation Demo With Visual AttentionIBM WatsonImage Caption Generation DemoImage: #captions:1. a couple of bikes parked next to each other 1.005856 2. a couple of bikes parked next to each other on a of a building 1.Figure 2by the various models discussed in the paper. Beside each caption we report the average log probability of the words in the caption. On this image, which presents an object situated in an atypical context[24], the FC models fail to give an accurate description, while the attention models handle the previously unseen image composition well. The models trained with SCST return a more accurate and more detailed summary of the image.IBM WatsonImage Caption Generation DemoImage: #captions:\n. Tsung-Yi Lin, Michael Maire, Serge J Belongie, Lubomir D Bourdev, Ross B Girshick, James Hays, Pietro Perona, Deva Ramanan, Piotr Dollár, C Lawrence Zitnick, Microsoft COCO: common objects in context. EECV, 2014. 1, 4Tsung-Yi Lin, Michael Maire, Serge J. Belongie, Lubomir D. Bourdev, Ross B. Girshick, James Hays, Pietro Perona, Deva Ramanan, Piotr Dollár, and C. Lawrence Zitnick. Microsoft COCO: common objects in context. EECV, 2014. 1, 4\n\nLearning phrase representations using RNN encoderdecoder for statistical machine translation. Kyunghyun Cho, Bart Van Merrienboer, Fethi Aglar Gülçehre, Holger Bougares, Yoshua Schwenk, Bengio, EMNLP. 1Kyunghyun Cho, Bart van Merrienboer, Ç aglar Gülçehre, Fethi Bougares, Holger Schwenk, and Yoshua Ben- gio. Learning phrase representations using RNN encoder- decoder for statistical machine translation. EMNLP, 2014. 1\n\nShow and tell: A neural image caption generator. Oriol Vinyals, Alexander Toshev, Samy Bengio, Dumitru Erhan, 1CVPROriol Vinyals, Alexander Toshev, Samy Bengio, and Du- mitru Erhan. Show and tell: A neural image caption gen- erator. CVPR, 2015. 1, 2\n\nDeep visual-semantic alignments for generating image descriptions. Andrej Karpathy, Fei-Fei Li, 1Andrej Karpathy and Fei-Fei Li. Deep visual-semantic align- ments for generating image descriptions. CVPR, 2015. 1, 2\n\nLong short-term memory. Sepp Hochreiter, Jürgen Schmidhuber, Neural Comput. 12Sepp Hochreiter and Jürgen Schmidhuber. Long short-term memory. Neural Comput., 1997. 1, 2\n\n. Kelvin Xu, Jimmy Ba, Ryan Kiros, Kyunghyun Cho, Aaron C Courville, Ruslan Salakhutdinov, S Richard, Kelvin Xu, Jimmy Ba, Ryan Kiros, Kyunghyun Cho, Aaron C. Courville, Ruslan Salakhutdinov, Richard S.\n\nShow, attend and tell: Neural image caption generation with visual attention. Yoshua Zemel, Bengio, ICML. 13Zemel, and Yoshua Bengio. Show, attend and tell: Neural image caption generation with visual attention. In ICML, 2015. 1, 2, 3\n\nSequence level training with recurrent neural networks. ICLR. Aurelio Marc, Sumit Ranzato, Michael Chopra, Wojciech Auli, Zaremba, 510Marc'Aurelio Ranzato, Sumit Chopra, Michael Auli, and Wojciech Zaremba. Sequence level training with recurrent neural networks. ICLR, 2015. 1, 2, 3, 4, 5, 10\n\nScheduled sampling for sequence prediction with recurrent neural networks. Samy Bengio, Oriol Vinyals, Navdeep Jaitly, Noam Shazeer, NIPS. 510Samy Bengio, Oriol Vinyals, Navdeep Jaitly, and Noam Shazeer. Scheduled sampling for sequence prediction with recurrent neural networks. In NIPS, 2015. 1, 4, 5, 10\n\nProfessor forcing: A new algorithm for training recurrent networks. Alex Lamb, Anirudh Goyal, Ying Zhang, Saizheng Zhang, Aaron Courville, Yoshua Bengio, Neural Information Processing Systems (NIPS) 2016. 14Alex Lamb, Anirudh Goyal, Ying Zhang, Saizheng Zhang, Aaron Courville, and Yoshua Bengio. Professor forcing: A new algorithm for training recurrent networks. Neural Infor- mation Processing Systems (NIPS) 2016, 2016. 1, 4\n\nBleu: A method for automatic evaluation of machine translation. Kishore Papineni, Salim Roukos, Todd Ward, Wei-Jing Zhu, ACL. Kishore Papineni, Salim Roukos, Todd Ward, and Wei-Jing Zhu. Bleu: A method for automatic evaluation of machine translation. In ACL, 2002. 1\n\nRouge: A package for automatic evaluation of summaries. Chin-Yew Lin, Text summarization branches out: Proceedings of the ACL-04 workshop. Barcelona, Spain8Chin-Yew Lin. Rouge: A package for automatic evalua- tion of summaries. In Text summarization branches out: Proceedings of the ACL-04 workshop, volume 8. Barcelona, Spain, 2004. 1\n\nMeteor: An automatic metric for mt evaluation with improved correlation with human judgments. Satanjeev Banerjee, Alon Lavie, Proceedings of the acl workshop on intrinsic and. the acl workshop on intrinsic and29extrinsic evaluation measures for machine translation and/or summarizationSatanjeev Banerjee and Alon Lavie. Meteor: An automatic metric for mt evaluation with improved correlation with hu- man judgments. In Proceedings of the acl workshop on in- trinsic and extrinsic evaluation measures for machine trans- lation and/or summarization, volume 29, pages 65-72, 2005. 1\n\nCider: Consensus-based image description evaluation. C Lawrence Ramakrishna Vedantam, Devi Zitnick, Parikh, CVPR. 110Ramakrishna Vedantam, C. Lawrence Zitnick, and Devi Parikh. Cider: Consensus-based image description evalua- tion. In CVPR, 2015. 1, 10\n\nReinforcement learning: An introduction. Richard S Sutton, Andrew G Barto, MIT Press23Richard S. Sutton and Andrew G. Barto. Reinforcement learning: An introduction. MIT Press, 1998. 2, 3\n\nSimple statistical gradient-following algorithms for connectionist reinforcement learning. Ronald J Williams, Machine Learning. 23Ronald J. Williams. Simple statistical gradient-following al- gorithms for connectionist reinforcement learning. In Ma- chine Learning, pages 229-256, 1992. 2, 3\n\nHigh-dimensional continuous control using generalized advantage estimation. John Schulman, Philipp Moritz, Sergey Levine, Michael Jordan, Pieter Abbeel, arXiv:1506.02438arXiv preprintJohn Schulman, Philipp Moritz, Sergey Levine, Michael Jor- dan, and Pieter Abbeel. High-dimensional continuous con- trol using generalized advantage estimation. arXiv preprint arXiv:1506.02438, 2015. 2\n\nReinforcement learning neural turing machines. Wojciech Zaremba, Ilya Sutskever, Arxiv. 23Wojciech Zaremba and Ilya Sutskever. Reinforcement learn- ing neural turing machines. Arxiv, 2015. 2, 3\n\nNeural variational inference and learning in belief networks. Andriy Mnih, Karol Gregor, arXiv:1402.0030arXiv preprintAndriy Mnih and Karol Gregor. Neural variational in- ference and learning in belief networks. arXiv preprint arXiv:1402.0030, 2014. 2\n\nAn actor-critic algorithm for sequence prediction. Dzmitry Bahdanau, Philemon Brakel, Kelvin Xu, Anirudh Goyal, Ryan Lowe, Joelle Pineau, Aaron C Courville, Yoshua Bengio, Arxiv. 2Dzmitry Bahdanau, Philemon Brakel, Kelvin Xu, Anirudh Goyal, Ryan Lowe, Joelle Pineau, Aaron C. Courville, and Yoshua Bengio. An actor-critic algorithm for sequence pre- diction. Arxiv, 2016. 2\n\nAdam: A method for stochastic optimization. P Diederik, Jimmy Kingma, Ba, ICLR. 25Diederik P. Kingma and Jimmy Ba. Adam: A method for stochastic optimization. ICLR, 2015. 2, 5\n\nDeep visual-semantic alignments for generating image descriptions. Andrej Karpathy, Fei-Fei Li, CVPR. 46Andrej Karpathy and Fei-Fei Li. Deep visual-semantic align- ments for generating image descriptions. In CVPR, 2015. 4, 5, 6\n\nDeep residual learning for image recognition. Kaiming He, Xiangyu Zhang, Shaoqing Ren, Jian Sun, CVPR. 45Kaiming He, Xiangyu Zhang, Shaoqing Ren, and Jian Sun. Deep residual learning for image recognition. In CVPR, 2016. 4, 5\n\nOriol Vinyals, Alexander Toshev, Samy Bengio, Dumitru Erhan, Show and tell: Lessons learned from the 2015 MSCOCO image captioning challenge. PAMI. Oriol Vinyals, Alexander Toshev, Samy Bengio, and Du- mitru Erhan. Show and tell: Lessons learned from the 2015 MSCOCO image captioning challenge. PAMI, 2016. 6\n\nContext models and out-of-context objects. Myung Jinchoi, Antonio Torralba, Alan S Willsky, 716Myung Jinchoi, Antonio Torralba, and Alan S. Willsky. Con- text models and out-of-context objects. 7, 8, 10, 12, 15, 16\n", "annotations": {"author": "[{\"end\":178,\"start\":56},{\"end\":303,\"start\":179},{\"end\":423,\"start\":304},{\"end\":540,\"start\":424},{\"end\":658,\"start\":541}]", "publisher": null, "author_last_name": "[{\"end\":71,\"start\":65},{\"end\":196,\"start\":187},{\"end\":318,\"start\":312},{\"end\":435,\"start\":431},{\"end\":554,\"start\":550}]", "author_first_name": "[{\"end\":62,\"start\":56},{\"end\":64,\"start\":63},{\"end\":186,\"start\":179},{\"end\":311,\"start\":304},{\"end\":430,\"start\":424},{\"end\":549,\"start\":541}]", "author_affiliation": "[{\"end\":177,\"start\":93},{\"end\":302,\"start\":218},{\"end\":422,\"start\":338},{\"end\":539,\"start\":455},{\"end\":657,\"start\":573}]", "title": "[{\"end\":53,\"start\":1},{\"end\":711,\"start\":659}]", "venue": null, "abstract": "[{\"end\":2044,\"start\":713}]", "bib_ref": "[{\"attributes\":{\"ref_id\":\"b0\"},\"end\":2374,\"start\":2371},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":2776,\"start\":2773},{\"attributes\":{\"ref_id\":\"b2\"},\"end\":2781,\"start\":2778},{\"attributes\":{\"ref_id\":\"b3\"},\"end\":2790,\"start\":2787},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":2903,\"start\":2900},{\"attributes\":{\"ref_id\":\"b5\"},\"end\":3083,\"start\":3080},{\"attributes\":{\"ref_id\":\"b7\"},\"end\":3566,\"start\":3563},{\"attributes\":{\"ref_id\":\"b8\"},\"end\":3791,\"start\":3788},{\"attributes\":{\"ref_id\":\"b7\"},\"end\":4006,\"start\":4003},{\"attributes\":{\"ref_id\":\"b8\"},\"end\":4244,\"start\":4241},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":4472,\"start\":4469},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":4865,\"start\":4861},{\"attributes\":{\"ref_id\":\"b11\"},\"end\":4877,\"start\":4873},{\"attributes\":{\"ref_id\":\"b12\"},\"end\":4890,\"start\":4886},{\"attributes\":{\"ref_id\":\"b13\"},\"end\":4904,\"start\":4900},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":5225,\"start\":5221},{\"attributes\":{\"ref_id\":\"b7\"},\"end\":5246,\"start\":5243},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":5295,\"start\":5291},{\"attributes\":{\"ref_id\":\"b16\"},\"end\":6068,\"start\":6064},{\"attributes\":{\"ref_id\":\"b17\"},\"end\":6071,\"start\":6068},{\"attributes\":{\"ref_id\":\"b18\"},\"end\":6074,\"start\":6071},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":6101,\"start\":6097},{\"attributes\":{\"ref_id\":\"b19\"},\"end\":6310,\"start\":6306},{\"attributes\":{\"ref_id\":\"b19\"},\"end\":6542,\"start\":6538},{\"attributes\":{\"ref_id\":\"b2\"},\"end\":7835,\"start\":7832},{\"attributes\":{\"ref_id\":\"b3\"},\"end\":7837,\"start\":7835},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":8382,\"start\":8379},{\"attributes\":{\"ref_id\":\"b5\"},\"end\":9768,\"start\":9765},{\"attributes\":{\"ref_id\":\"b20\"},\"end\":9927,\"start\":9923},{\"attributes\":{\"ref_id\":\"b5\"},\"end\":10341,\"start\":10338},{\"attributes\":{\"ref_id\":\"b7\"},\"end\":11128,\"start\":11125},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":12240,\"start\":12236},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":12268,\"start\":12264},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":13014,\"start\":13010},{\"attributes\":{\"ref_id\":\"b7\"},\"end\":13464,\"start\":13461},{\"attributes\":{\"ref_id\":\"b17\"},\"end\":13810,\"start\":13806},{\"attributes\":{\"ref_id\":\"b7\"},\"end\":15583,\"start\":15580},{\"attributes\":{\"ref_id\":\"b8\"},\"end\":16272,\"start\":16269},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":16297,\"start\":16294},{\"attributes\":{\"ref_id\":\"b7\"},\"end\":16310,\"start\":16307},{\"attributes\":{\"ref_id\":\"b0\"},\"end\":17631,\"start\":17628},{\"attributes\":{\"ref_id\":\"b21\"},\"end\":17698,\"start\":17694},{\"attributes\":{\"ref_id\":\"b21\"},\"end\":17882,\"start\":17878},{\"attributes\":{\"ref_id\":\"b22\"},\"end\":18238,\"start\":18234},{\"attributes\":{\"ref_id\":\"b22\"},\"end\":18853,\"start\":18849},{\"attributes\":{\"ref_id\":\"b20\"},\"end\":19650,\"start\":19646},{\"attributes\":{\"ref_id\":\"b8\"},\"end\":19918,\"start\":19915},{\"attributes\":{\"ref_id\":\"b7\"},\"end\":20356,\"start\":20353},{\"attributes\":{\"ref_id\":\"b7\"},\"end\":21001,\"start\":20998},{\"attributes\":{\"ref_id\":\"b7\"},\"end\":21446,\"start\":21443},{\"attributes\":{\"ref_id\":\"b7\"},\"end\":21702,\"start\":21699},{\"attributes\":{\"ref_id\":\"b21\"},\"end\":22666,\"start\":22662},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":23442,\"start\":23439},{\"end\":23447,\"start\":23442},{\"attributes\":{\"ref_id\":\"b24\"},\"end\":23804,\"start\":23800},{\"attributes\":{\"ref_id\":\"b24\"},\"end\":24482,\"start\":24478},{\"attributes\":{\"ref_id\":\"b8\"},\"end\":27791,\"start\":27788},{\"attributes\":{\"ref_id\":\"b7\"},\"end\":28373,\"start\":28370},{\"attributes\":{\"ref_id\":\"b24\"},\"end\":29070,\"start\":29066},{\"attributes\":{\"ref_id\":\"b13\"},\"end\":29905,\"start\":29901},{\"attributes\":{\"ref_id\":\"b24\"},\"end\":31551,\"start\":31547},{\"attributes\":{\"ref_id\":\"b24\"},\"end\":31998,\"start\":31994},{\"attributes\":{\"ref_id\":\"b24\"},\"end\":32674,\"start\":32670},{\"attributes\":{\"ref_id\":\"b24\"},\"end\":33702,\"start\":33698},{\"attributes\":{\"ref_id\":\"b24\"},\"end\":33853,\"start\":33849},{\"attributes\":{\"ref_id\":\"b21\"},\"end\":36022,\"start\":36018},{\"attributes\":{\"ref_id\":\"b23\"},\"end\":36126,\"start\":36122}]", "figure": "[{\"attributes\":{\"id\":\"fig_0\"},\"end\":32555,\"start\":32224},{\"attributes\":{\"id\":\"fig_1\"},\"end\":32675,\"start\":32556},{\"attributes\":{\"id\":\"fig_2\"},\"end\":33488,\"start\":32676},{\"attributes\":{\"id\":\"fig_3\"},\"end\":33554,\"start\":33489},{\"attributes\":{\"id\":\"fig_4\"},\"end\":33612,\"start\":33555},{\"attributes\":{\"id\":\"fig_5\"},\"end\":33703,\"start\":33613},{\"attributes\":{\"id\":\"fig_6\"},\"end\":33763,\"start\":33704},{\"attributes\":{\"id\":\"fig_7\"},\"end\":33854,\"start\":33764},{\"attributes\":{\"id\":\"fig_8\"},\"end\":33914,\"start\":33855},{\"attributes\":{\"id\":\"tab_2\",\"type\":\"table\"},\"end\":34618,\"start\":33915},{\"attributes\":{\"id\":\"tab_3\",\"type\":\"table\"},\"end\":34949,\"start\":34619},{\"attributes\":{\"id\":\"tab_5\",\"type\":\"table\"},\"end\":35410,\"start\":34950},{\"attributes\":{\"id\":\"tab_6\",\"type\":\"table\"},\"end\":35756,\"start\":35411}]", "paragraph": "[{\"end\":3545,\"start\":2060},{\"end\":4132,\"start\":3547},{\"end\":4682,\"start\":4134},{\"end\":4905,\"start\":4684},{\"end\":5044,\"start\":4907},{\"end\":6573,\"start\":5046},{\"end\":7700,\"start\":6575},{\"end\":7806,\"start\":7722},{\"end\":8383,\"start\":7808},{\"end\":8903,\"start\":8686},{\"end\":9291,\"start\":8928},{\"end\":9437,\"start\":9352},{\"end\":9675,\"start\":9439},{\"end\":9953,\"start\":9677},{\"end\":10375,\"start\":10258},{\"end\":10795,\"start\":10515},{\"end\":11894,\"start\":10822},{\"end\":12100,\"start\":11929},{\"end\":12402,\"start\":12130},{\"end\":12628,\"start\":12459},{\"end\":12852,\"start\":12668},{\"end\":13034,\"start\":12916},{\"end\":13369,\"start\":13128},{\"end\":13520,\"start\":13418},{\"end\":13630,\"start\":13522},{\"end\":13783,\"start\":13669},{\"end\":13811,\"start\":13790},{\"end\":14247,\"start\":13912},{\"end\":15276,\"start\":14824},{\"end\":15964,\"start\":15278},{\"end\":16658,\"start\":15966},{\"end\":16734,\"start\":16660},{\"end\":17548,\"start\":16756},{\"end\":17572,\"start\":17564},{\"end\":18097,\"start\":17574},{\"end\":20872,\"start\":18099},{\"end\":22280,\"start\":20895},{\"end\":23531,\"start\":22282},{\"end\":25104,\"start\":23603},{\"end\":26023,\"start\":25135},{\"end\":27449,\"start\":26042},{\"end\":28189,\"start\":27501},{\"end\":28772,\"start\":28191},{\"end\":29508,\"start\":28810},{\"end\":30380,\"start\":29561},{\"end\":32223,\"start\":30382}]", "formula": "[{\"attributes\":{\"id\":\"formula_0\"},\"end\":8685,\"start\":8384},{\"attributes\":{\"id\":\"formula_1\"},\"end\":8927,\"start\":8904},{\"attributes\":{\"id\":\"formula_2\"},\"end\":9351,\"start\":9292},{\"attributes\":{\"id\":\"formula_3\"},\"end\":10257,\"start\":9954},{\"attributes\":{\"id\":\"formula_4\"},\"end\":10514,\"start\":10376},{\"attributes\":{\"id\":\"formula_5\"},\"end\":11928,\"start\":11895},{\"attributes\":{\"id\":\"formula_6\"},\"end\":12129,\"start\":12101},{\"attributes\":{\"id\":\"formula_7\"},\"end\":12458,\"start\":12403},{\"attributes\":{\"id\":\"formula_8\"},\"end\":12667,\"start\":12629},{\"attributes\":{\"id\":\"formula_9\"},\"end\":12915,\"start\":12853},{\"attributes\":{\"id\":\"formula_10\"},\"end\":13127,\"start\":13035},{\"attributes\":{\"id\":\"formula_11\"},\"end\":13417,\"start\":13370},{\"attributes\":{\"id\":\"formula_12\"},\"end\":13668,\"start\":13631},{\"attributes\":{\"id\":\"formula_13\"},\"end\":13789,\"start\":13784},{\"attributes\":{\"id\":\"formula_14\"},\"end\":13870,\"start\":13812},{\"attributes\":{\"id\":\"formula_15\"},\"end\":14309,\"start\":14248},{\"attributes\":{\"id\":\"formula_16\"},\"end\":14823,\"start\":14309},{\"attributes\":{\"id\":\"formula_17\"},\"end\":16755,\"start\":16735}]", "table_ref": "[{\"end\":20947,\"start\":20940},{\"attributes\":{\"ref_id\":\"tab_3\"},\"end\":22562,\"start\":22555},{\"attributes\":{\"ref_id\":\"tab_6\"},\"end\":23219,\"start\":23212},{\"attributes\":{\"ref_id\":\"tab_6\"},\"end\":23228,\"start\":23221}]", "section_header": "[{\"attributes\":{\"n\":\"1.\"},\"end\":2058,\"start\":2046},{\"attributes\":{\"n\":\"2.\"},\"end\":7720,\"start\":7703},{\"attributes\":{\"n\":\"3.\"},\"end\":10820,\"start\":10798},{\"attributes\":{\"n\":\"4.\"},\"end\":13910,\"start\":13872},{\"attributes\":{\"n\":\"5.\"},\"end\":17562,\"start\":17551},{\"attributes\":{\"n\":\"5.1.\"},\"end\":20893,\"start\":20875},{\"attributes\":{\"n\":\"2.\"},\"end\":23569,\"start\":23534},{\"attributes\":{\"n\":\"6.\"},\"end\":23601,\"start\":23572},{\"attributes\":{\"n\":\"7.\"},\"end\":25133,\"start\":25107},{\"end\":26040,\"start\":26026},{\"end\":27499,\"start\":27452},{\"end\":28808,\"start\":28775},{\"end\":29559,\"start\":29511},{\"end\":32235,\"start\":32225},{\"end\":32567,\"start\":32557},{\"end\":32697,\"start\":32677},{\"end\":33500,\"start\":33490},{\"end\":33566,\"start\":33556},{\"end\":33625,\"start\":33614},{\"end\":33716,\"start\":33705},{\"end\":33776,\"start\":33765},{\"end\":33867,\"start\":33856},{\"end\":33925,\"start\":33916},{\"end\":34629,\"start\":34620},{\"end\":34960,\"start\":34951},{\"end\":35421,\"start\":35412}]", "table": "[{\"end\":34618,\"start\":34175},{\"end\":35410,\"start\":35064},{\"end\":35756,\"start\":35423}]", "figure_caption": "[{\"end\":32555,\"start\":32237},{\"end\":32675,\"start\":32569},{\"end\":33488,\"start\":32700},{\"end\":33554,\"start\":33502},{\"end\":33612,\"start\":33568},{\"end\":33703,\"start\":33628},{\"end\":33763,\"start\":33719},{\"end\":33854,\"start\":33779},{\"end\":33914,\"start\":33870},{\"end\":34175,\"start\":33927},{\"end\":34949,\"start\":34631},{\"end\":35064,\"start\":34962}]", "figure_ref": "[{\"end\":14848,\"start\":14840},{\"end\":16789,\"start\":16781},{\"end\":23714,\"start\":23705},{\"end\":24802,\"start\":24793},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":28475,\"start\":28467},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":30599,\"start\":30591},{\"attributes\":{\"ref_id\":\"fig_3\"},\"end\":31018,\"start\":31010},{\"attributes\":{\"ref_id\":\"fig_5\"},\"end\":31341,\"start\":31332},{\"attributes\":{\"ref_id\":\"fig_7\"},\"end\":31788,\"start\":31779}]", "bib_author_first_name": "[{\"end\":37132,\"start\":37124},{\"end\":37145,\"start\":37138},{\"end\":37158,\"start\":37153},{\"end\":37160,\"start\":37159},{\"end\":37178,\"start\":37171},{\"end\":37180,\"start\":37179},{\"end\":37194,\"start\":37190},{\"end\":37196,\"start\":37195},{\"end\":37212,\"start\":37207},{\"end\":37225,\"start\":37219},{\"end\":37238,\"start\":37234},{\"end\":37253,\"start\":37248},{\"end\":37263,\"start\":37262},{\"end\":37272,\"start\":37264},{\"end\":37671,\"start\":37662},{\"end\":37704,\"start\":37699},{\"end\":37727,\"start\":37721},{\"end\":37744,\"start\":37738},{\"end\":38044,\"start\":38039},{\"end\":38063,\"start\":38054},{\"end\":38076,\"start\":38072},{\"end\":38092,\"start\":38085},{\"end\":38314,\"start\":38308},{\"end\":38332,\"start\":38325},{\"end\":38485,\"start\":38481},{\"end\":38504,\"start\":38498},{\"end\":38635,\"start\":38629},{\"end\":38645,\"start\":38640},{\"end\":38654,\"start\":38650},{\"end\":38671,\"start\":38662},{\"end\":38682,\"start\":38677},{\"end\":38684,\"start\":38683},{\"end\":38702,\"start\":38696},{\"end\":38719,\"start\":38718},{\"end\":38915,\"start\":38909},{\"end\":39136,\"start\":39129},{\"end\":39148,\"start\":39143},{\"end\":39165,\"start\":39158},{\"end\":39182,\"start\":39174},{\"end\":39439,\"start\":39435},{\"end\":39453,\"start\":39448},{\"end\":39470,\"start\":39463},{\"end\":39483,\"start\":39479},{\"end\":39739,\"start\":39735},{\"end\":39753,\"start\":39746},{\"end\":39765,\"start\":39761},{\"end\":39781,\"start\":39773},{\"end\":39794,\"start\":39789},{\"end\":39812,\"start\":39806},{\"end\":40168,\"start\":40161},{\"end\":40184,\"start\":40179},{\"end\":40197,\"start\":40193},{\"end\":40212,\"start\":40204},{\"end\":40429,\"start\":40421},{\"end\":40805,\"start\":40796},{\"end\":40820,\"start\":40816},{\"end\":41337,\"start\":41336},{\"end\":41346,\"start\":41338},{\"end\":41373,\"start\":41369},{\"end\":41585,\"start\":41578},{\"end\":41587,\"start\":41586},{\"end\":41602,\"start\":41596},{\"end\":41604,\"start\":41603},{\"end\":41823,\"start\":41817},{\"end\":41825,\"start\":41824},{\"end\":42099,\"start\":42095},{\"end\":42117,\"start\":42110},{\"end\":42132,\"start\":42126},{\"end\":42148,\"start\":42141},{\"end\":42163,\"start\":42157},{\"end\":42460,\"start\":42452},{\"end\":42474,\"start\":42470},{\"end\":42668,\"start\":42662},{\"end\":42680,\"start\":42675},{\"end\":42911,\"start\":42904},{\"end\":42930,\"start\":42922},{\"end\":42945,\"start\":42939},{\"end\":42957,\"start\":42950},{\"end\":42969,\"start\":42965},{\"end\":42982,\"start\":42976},{\"end\":42996,\"start\":42991},{\"end\":42998,\"start\":42997},{\"end\":43016,\"start\":43010},{\"end\":43273,\"start\":43272},{\"end\":43289,\"start\":43284},{\"end\":43478,\"start\":43472},{\"end\":43496,\"start\":43489},{\"end\":43687,\"start\":43680},{\"end\":43699,\"start\":43692},{\"end\":43715,\"start\":43707},{\"end\":43725,\"start\":43721},{\"end\":43866,\"start\":43861},{\"end\":43885,\"start\":43876},{\"end\":43898,\"start\":43894},{\"end\":43914,\"start\":43907},{\"end\":44218,\"start\":44213},{\"end\":44235,\"start\":44228},{\"end\":44250,\"start\":44246},{\"end\":44252,\"start\":44251}]", "bib_author_last_name": "[{\"end\":37136,\"start\":37133},{\"end\":37151,\"start\":37146},{\"end\":37169,\"start\":37161},{\"end\":37188,\"start\":37181},{\"end\":37205,\"start\":37197},{\"end\":37217,\"start\":37213},{\"end\":37232,\"start\":37226},{\"end\":37246,\"start\":37239},{\"end\":37260,\"start\":37254},{\"end\":37280,\"start\":37273},{\"end\":37675,\"start\":37672},{\"end\":37697,\"start\":37677},{\"end\":37719,\"start\":37705},{\"end\":37736,\"start\":37728},{\"end\":37752,\"start\":37745},{\"end\":37760,\"start\":37754},{\"end\":38052,\"start\":38045},{\"end\":38070,\"start\":38064},{\"end\":38083,\"start\":38077},{\"end\":38098,\"start\":38093},{\"end\":38323,\"start\":38315},{\"end\":38335,\"start\":38333},{\"end\":38496,\"start\":38486},{\"end\":38516,\"start\":38505},{\"end\":38638,\"start\":38636},{\"end\":38648,\"start\":38646},{\"end\":38660,\"start\":38655},{\"end\":38675,\"start\":38672},{\"end\":38694,\"start\":38685},{\"end\":38716,\"start\":38703},{\"end\":38727,\"start\":38720},{\"end\":38921,\"start\":38916},{\"end\":38929,\"start\":38923},{\"end\":39141,\"start\":39137},{\"end\":39156,\"start\":39149},{\"end\":39172,\"start\":39166},{\"end\":39187,\"start\":39183},{\"end\":39196,\"start\":39189},{\"end\":39446,\"start\":39440},{\"end\":39461,\"start\":39454},{\"end\":39477,\"start\":39471},{\"end\":39491,\"start\":39484},{\"end\":39744,\"start\":39740},{\"end\":39759,\"start\":39754},{\"end\":39771,\"start\":39766},{\"end\":39787,\"start\":39782},{\"end\":39804,\"start\":39795},{\"end\":39819,\"start\":39813},{\"end\":40177,\"start\":40169},{\"end\":40191,\"start\":40185},{\"end\":40202,\"start\":40198},{\"end\":40216,\"start\":40213},{\"end\":40433,\"start\":40430},{\"end\":40814,\"start\":40806},{\"end\":40826,\"start\":40821},{\"end\":41367,\"start\":41347},{\"end\":41381,\"start\":41374},{\"end\":41389,\"start\":41383},{\"end\":41594,\"start\":41588},{\"end\":41610,\"start\":41605},{\"end\":41834,\"start\":41826},{\"end\":42108,\"start\":42100},{\"end\":42124,\"start\":42118},{\"end\":42139,\"start\":42133},{\"end\":42155,\"start\":42149},{\"end\":42170,\"start\":42164},{\"end\":42468,\"start\":42461},{\"end\":42484,\"start\":42475},{\"end\":42673,\"start\":42669},{\"end\":42687,\"start\":42681},{\"end\":42920,\"start\":42912},{\"end\":42937,\"start\":42931},{\"end\":42948,\"start\":42946},{\"end\":42963,\"start\":42958},{\"end\":42974,\"start\":42970},{\"end\":42989,\"start\":42983},{\"end\":43008,\"start\":42999},{\"end\":43023,\"start\":43017},{\"end\":43282,\"start\":43274},{\"end\":43296,\"start\":43290},{\"end\":43300,\"start\":43298},{\"end\":43487,\"start\":43479},{\"end\":43499,\"start\":43497},{\"end\":43690,\"start\":43688},{\"end\":43705,\"start\":43700},{\"end\":43719,\"start\":43716},{\"end\":43729,\"start\":43726},{\"end\":43874,\"start\":43867},{\"end\":43892,\"start\":43886},{\"end\":43905,\"start\":43899},{\"end\":43920,\"start\":43915},{\"end\":44226,\"start\":44219},{\"end\":44244,\"start\":44236},{\"end\":44260,\"start\":44253}]", "bib_entry": "[{\"attributes\":{\"id\":\"b0\"},\"end\":37566,\"start\":37122},{\"attributes\":{\"id\":\"b1\",\"matched_paper_id\":5590763},\"end\":37988,\"start\":37568},{\"attributes\":{\"id\":\"b2\"},\"end\":38239,\"start\":37990},{\"attributes\":{\"id\":\"b3\"},\"end\":38455,\"start\":38241},{\"attributes\":{\"id\":\"b4\",\"matched_paper_id\":1915014},\"end\":38625,\"start\":38457},{\"attributes\":{\"id\":\"b5\"},\"end\":38829,\"start\":38627},{\"attributes\":{\"id\":\"b6\",\"matched_paper_id\":1055111},\"end\":39065,\"start\":38831},{\"attributes\":{\"id\":\"b7\"},\"end\":39358,\"start\":39067},{\"attributes\":{\"id\":\"b8\",\"matched_paper_id\":1820089},\"end\":39665,\"start\":39360},{\"attributes\":{\"id\":\"b9\",\"matched_paper_id\":14994977},\"end\":40095,\"start\":39667},{\"attributes\":{\"id\":\"b10\",\"matched_paper_id\":11080756},\"end\":40363,\"start\":40097},{\"attributes\":{\"id\":\"b11\",\"matched_paper_id\":964287},\"end\":40700,\"start\":40365},{\"attributes\":{\"id\":\"b12\",\"matched_paper_id\":7164502},\"end\":41281,\"start\":40702},{\"attributes\":{\"id\":\"b13\",\"matched_paper_id\":9026666},\"end\":41535,\"start\":41283},{\"attributes\":{\"id\":\"b14\"},\"end\":41724,\"start\":41537},{\"attributes\":{\"id\":\"b15\",\"matched_paper_id\":2332513},\"end\":42017,\"start\":41726},{\"attributes\":{\"doi\":\"arXiv:1506.02438\",\"id\":\"b16\"},\"end\":42403,\"start\":42019},{\"attributes\":{\"id\":\"b17\",\"matched_paper_id\":16228924},\"end\":42598,\"start\":42405},{\"attributes\":{\"doi\":\"arXiv:1402.0030\",\"id\":\"b18\"},\"end\":42851,\"start\":42600},{\"attributes\":{\"id\":\"b19\",\"matched_paper_id\":14096841},\"end\":43226,\"start\":42853},{\"attributes\":{\"id\":\"b20\",\"matched_paper_id\":6628106},\"end\":43403,\"start\":43228},{\"attributes\":{\"id\":\"b21\",\"matched_paper_id\":8517067},\"end\":43632,\"start\":43405},{\"attributes\":{\"id\":\"b22\",\"matched_paper_id\":206594692},\"end\":43859,\"start\":43634},{\"attributes\":{\"id\":\"b23\"},\"end\":44168,\"start\":43861},{\"attributes\":{\"id\":\"b24\"},\"end\":44384,\"start\":44170}]", "bib_title": "[{\"end\":37660,\"start\":37568},{\"end\":38479,\"start\":38457},{\"end\":38907,\"start\":38831},{\"end\":39433,\"start\":39360},{\"end\":39733,\"start\":39667},{\"end\":40159,\"start\":40097},{\"end\":40419,\"start\":40365},{\"end\":40794,\"start\":40702},{\"end\":41334,\"start\":41283},{\"end\":41815,\"start\":41726},{\"end\":42450,\"start\":42405},{\"end\":42902,\"start\":42853},{\"end\":43270,\"start\":43228},{\"end\":43470,\"start\":43405},{\"end\":43678,\"start\":43634}]", "bib_author": "[{\"end\":37138,\"start\":37124},{\"end\":37153,\"start\":37138},{\"end\":37171,\"start\":37153},{\"end\":37190,\"start\":37171},{\"end\":37207,\"start\":37190},{\"end\":37219,\"start\":37207},{\"end\":37234,\"start\":37219},{\"end\":37248,\"start\":37234},{\"end\":37262,\"start\":37248},{\"end\":37282,\"start\":37262},{\"end\":37677,\"start\":37662},{\"end\":37699,\"start\":37677},{\"end\":37721,\"start\":37699},{\"end\":37738,\"start\":37721},{\"end\":37754,\"start\":37738},{\"end\":37762,\"start\":37754},{\"end\":38054,\"start\":38039},{\"end\":38072,\"start\":38054},{\"end\":38085,\"start\":38072},{\"end\":38100,\"start\":38085},{\"end\":38325,\"start\":38308},{\"end\":38337,\"start\":38325},{\"end\":38498,\"start\":38481},{\"end\":38518,\"start\":38498},{\"end\":38640,\"start\":38629},{\"end\":38650,\"start\":38640},{\"end\":38662,\"start\":38650},{\"end\":38677,\"start\":38662},{\"end\":38696,\"start\":38677},{\"end\":38718,\"start\":38696},{\"end\":38729,\"start\":38718},{\"end\":38923,\"start\":38909},{\"end\":38931,\"start\":38923},{\"end\":39143,\"start\":39129},{\"end\":39158,\"start\":39143},{\"end\":39174,\"start\":39158},{\"end\":39189,\"start\":39174},{\"end\":39198,\"start\":39189},{\"end\":39448,\"start\":39435},{\"end\":39463,\"start\":39448},{\"end\":39479,\"start\":39463},{\"end\":39493,\"start\":39479},{\"end\":39746,\"start\":39735},{\"end\":39761,\"start\":39746},{\"end\":39773,\"start\":39761},{\"end\":39789,\"start\":39773},{\"end\":39806,\"start\":39789},{\"end\":39821,\"start\":39806},{\"end\":40179,\"start\":40161},{\"end\":40193,\"start\":40179},{\"end\":40204,\"start\":40193},{\"end\":40218,\"start\":40204},{\"end\":40435,\"start\":40421},{\"end\":40816,\"start\":40796},{\"end\":40828,\"start\":40816},{\"end\":41369,\"start\":41336},{\"end\":41383,\"start\":41369},{\"end\":41391,\"start\":41383},{\"end\":41596,\"start\":41578},{\"end\":41612,\"start\":41596},{\"end\":41836,\"start\":41817},{\"end\":42110,\"start\":42095},{\"end\":42126,\"start\":42110},{\"end\":42141,\"start\":42126},{\"end\":42157,\"start\":42141},{\"end\":42172,\"start\":42157},{\"end\":42470,\"start\":42452},{\"end\":42486,\"start\":42470},{\"end\":42675,\"start\":42662},{\"end\":42689,\"start\":42675},{\"end\":42922,\"start\":42904},{\"end\":42939,\"start\":42922},{\"end\":42950,\"start\":42939},{\"end\":42965,\"start\":42950},{\"end\":42976,\"start\":42965},{\"end\":42991,\"start\":42976},{\"end\":43010,\"start\":42991},{\"end\":43025,\"start\":43010},{\"end\":43284,\"start\":43272},{\"end\":43298,\"start\":43284},{\"end\":43302,\"start\":43298},{\"end\":43489,\"start\":43472},{\"end\":43501,\"start\":43489},{\"end\":43692,\"start\":43680},{\"end\":43707,\"start\":43692},{\"end\":43721,\"start\":43707},{\"end\":43731,\"start\":43721},{\"end\":43876,\"start\":43861},{\"end\":43894,\"start\":43876},{\"end\":43907,\"start\":43894},{\"end\":43922,\"start\":43907},{\"end\":44228,\"start\":44213},{\"end\":44246,\"start\":44228},{\"end\":44262,\"start\":44246}]", "bib_venue": "[{\"end\":37767,\"start\":37762},{\"end\":38037,\"start\":37990},{\"end\":38306,\"start\":38241},{\"end\":38531,\"start\":38518},{\"end\":38935,\"start\":38931},{\"end\":39127,\"start\":39067},{\"end\":39497,\"start\":39493},{\"end\":39870,\"start\":39821},{\"end\":40221,\"start\":40218},{\"end\":40502,\"start\":40435},{\"end\":40876,\"start\":40828},{\"end\":41395,\"start\":41391},{\"end\":41576,\"start\":41537},{\"end\":41852,\"start\":41836},{\"end\":42093,\"start\":42019},{\"end\":42491,\"start\":42486},{\"end\":42660,\"start\":42600},{\"end\":43030,\"start\":43025},{\"end\":43306,\"start\":43302},{\"end\":43505,\"start\":43501},{\"end\":43735,\"start\":43731},{\"end\":44006,\"start\":43922},{\"end\":44211,\"start\":44170},{\"end\":40520,\"start\":40504},{\"end\":40911,\"start\":40878}]"}}}, "year": 2023, "month": 12, "day": 17}