{"id": 206711862, "updated": "2023-09-28 09:17:45.614", "metadata": {"title": "IllusionPIN: Shoulder-Surfing Resistant Authentication Using Hybrid Images", "authors": "[{\"first\":\"Athanasios\",\"last\":\"Papadopoulos\",\"middle\":[]},{\"first\":\"Toan\",\"last\":\"Nguyen\",\"middle\":[]},{\"first\":\"Emre\",\"last\":\"Durmus\",\"middle\":[]},{\"first\":\"Nasir\",\"last\":\"Memon\",\"middle\":[]}]", "venue": "IEEE Transactions on Information Forensics and Security", "journal": "IEEE Transactions on Information Forensics and Security", "publication_date": {"year": 2017, "month": 8, "day": 22}, "abstract": "We address the problem of shoulder-surfing attacks on authentication schemes by proposing IllusionPIN (IPIN), a PIN-based authentication method that operates on touchscreen devices. IPIN uses the technique of hybrid images to blend two keypads with different digit orderings in such a way, that the user who is close to the device is seeing one keypad to enter her PIN, while the attacker who is looking at the device from a bigger distance is seeing only the other keypad. The user's keypad is shuffled in every authentication attempt since the attacker may memorize the spatial arrangement of the pressed digits. To reason about the security of IllusionPIN, we developed an algorithm which is based on human visual perception and estimates the minimum distance from which an observer is unable to interpret the keypad of the user. We tested our estimations with 84 simulated shoulder-surfing attacks from 21 different people. None of the attacks was successful against our estimations. In addition, we estimated the minimum distance from which a camera is unable to capture the visual information from the keypad of the user. Based on our analysis, it seems practically almost impossible for a surveillance camera to capture the PIN of a smartphone user when IPIN is in use.", "fields_of_study": "[\"Computer Science\"]", "external_ids": {"arxiv": "1708.06508", "mag": "3101751391", "acl": null, "pubmed": null, "pubmedcentral": null, "dblp": "journals/tifs/PapadopoulosNDM17", "doi": "10.1109/tifs.2017.2725199"}}, "content": {"source": {"pdf_hash": "e8df9ef30dd3a77650bd34ebf83b0f73ff6e8d17", "pdf_src": "Arxiv", "pdf_uri": "[\"https://arxiv.org/pdf/1708.06508v1.pdf\"]", "oa_url_match": true, "oa_info": {"license": null, "open_access_url": "https://arxiv.org/pdf/1708.06508", "status": "GREEN"}}, "grobid": {"id": "dfb982890b0fef26f69eace2cb382190e03b0790", "type": "plain-text", "url": "s3://ai2-s2-pdf-extraction-prod/parse-results/s2orc_worker/e8df9ef30dd3a77650bd34ebf83b0f73ff6e8d17.txt", "contents": "\nIllusionPIN: Shoulder-Surfing Resistant Authentication Using Hybrid Images\n\n\nToan Nguyen toan.v.nguyen@nyu.edu \nAthanasios Papadopoulos New York University\nNew York University\nNew York University\nNew York University\n\n\nEmre Durmus mdurmus@nyu.edu \nAthanasios Papadopoulos New York University\nNew York University\nNew York University\nNew York University\n\n\nNasir Memon memon@nyu.edu \nAthanasios Papadopoulos New York University\nNew York University\nNew York University\nNew York University\n\n\nIllusionPIN: Shoulder-Surfing Resistant Authentication Using Hybrid Images\n\nWe address the problem of shoulder-surfing attacks on authentication schemes by proposing IllusionPIN (IPIN), a PIN-based authentication method that operates on touchscreen devices. IPIN uses the technique of hybrid images to blend two keypads with different digit orderings in such a way, that the user who is close to the device is seeing one keypad to enter her PIN, while the attacker who is looking at the device from a bigger distance is seeing only the other keypad. The user's keypad is shuffled in every authentication attempt since the attacker may memorize the spatial arrangement of the pressed digits.To reason about the security of IllusionPIN, we developed an algorithm which is based on human visual perception and estimates the minimum distance from which an observer is unable to interpret the keypad of the user. We tested our estimations with 84 simulated shoulder-surfing attacks from 21 different people. None of the attacks was successful against our estimations. In addition, we estimated the minimum distance from which a camera is unable to capture the visual information from the keypad of the user. Based on our analysis, it seems practically almost impossible for a surveillance camera to capture the PIN of a smartphone user when IPIN is in use.\n\nINTRODUCTION\n\nUser authentication is performed in various ways [4]. We focus on PIN authentication because of its simplicity and maturity. A Personal Identification Number (PIN) is a sequence of digits that confirms the identity of a person when it is successfully presented. PINs are simpler than alphanumeric passwords as they solely consist of numerical characters (0-9) and have a short length that is usually either 4 or 6 digits. This makes PINs easy to remember and easy to reproduce, and as a consequence, PIN authentication is characterized by infrequent errors [10]. So, simplicity is translated to usability. The maturity of PIN authentication is a result of its continuous usage for years in a wide range of everyday life applications, like mobile phones and banking systems.\n\nFrom the perspective of security, PIN authentication is susceptible to brute force or even guessing attacks [5]. To balance this weakness, the number of allowed authentication attempts is usually constrained to a small number such as 5. However, a simple attack that is still very hard to mitigate is shoulder-surfing [1].\n\nShoulder-surfing refers to eavesdropping personal information, like an alphanumeric password or a PIN, through observation. A typical example is an adversary who is standing behind a person in the line for an ATM machine and is looking, or \"surfing\", over the person's shoulder to obtain her PIN information. In this scenario, the attacker is observing a person while being in her vicinity. However, the attacker may observe someone remotely by using recorded material that was collected intentionally or even unintentionally. For example, unintentional recording of shoulder-surfing material could result from a surveillance camera that captured a person while entering her authentication credentials to unlock her phone in a store or at the workplace.\n\nAuthentication schemes which are not resilient to observation are vulnerable to shoulder-surfing. Any kind of visual information may be observed, including the blink of a button when it is pressed, or even the oily residue that the fingers leave on a touchscreen [2]. Shoulder-surfing is a big threat for PIN authentication in particular, because it is relatively easy for an observer to follow the PIN authentication process. PINs are short and require just a small numeric keypad instead of the usual alphanumeric keyboard. In addition, PIN authentication is often performed in crowded places, e.g., when someone is unlocking her mobile phone on the street or in the subway. Shoulder-surfing is facilitated in such scenarios since it is easier for an attacker to stand close to the user while escaping her attention.\n\nThe motivation behind this work relies on the hypothesis that PIN authentication will really meet the needs of its users when it will increase its shoulder-surfing resistance without a significant overhead in its usability. We contributed towards this claim in the following ways.\n\n• We designed IllusionPIN (IPIN) for touchscreen de-vices. The virtual keypad of IPIN is composed of two keypads with different digit orderings, blended in a single hybrid image [25]. The user who is close to the screen is able to see and use one keypad, but a poten-tial attacker who is looking at the screen from a bigger distance, is able to see only the other keypad. We analyze in detail the design of IllusionPIN in Section 5.\n\n• We developed an algorithm to estimate whether or not the user's keypad is visible to an observer at a given viewing position. We explain the estimation algorithm in Section 6.\n\n• We tested the estimated visibility of IllusionPIN through a user study of simulated shoulder-surfing attacks on smartphone devices. In total, we performed 84 attacks with 21 different people and none of the attacks was successful against our estimations. We provide the details of this user study in Section 8.\n\n• We estimated the minimum distance from which a camera is unable to capture the visual information from the user's keypad. The exact procedure is explained in Section 7. The results show that it is practically almost impossible for a surveillance camera to capture the PIN of a smartphone user when Illusion-PIN is in use.\n\n\nRELATED WORK\n\nWe organize shoulder-surfing resistant authentication schemes according to 6 design principles. The Obscurity principle states that the visual information of interest has to be obscured. For example, ShieldPIN [14] requires the user to physically cover the keypad by cupping one hand while using the other hand to enter her PIN. It is obvious that such an approach demands physical effort and simultaneous usage of both hands that may be unwanted. An alternative solution that does not require any extra effort from the user is to make the content of the screen visible within a limited range of viewing angle. This can be achieved either with additional hardware, e.g. privacy filters, or with special hardware, e.g. automultiscopic displays [6,21]. In both cases, deployability may be an issue. However, there is a number of software solutions which create a similar effect [11,15]. Specifically, depending on the viewing angle, different visual elements appear on the screen and obscure the real content. These approaches exploit technical limitations of certain screens' technology, and as a result, they can't be generalized or expected to be applicable in the future as screen technology advances. In addition, a shoulder-surfer is not necessarily observing from a big angle, as he may be just standing behind the user.\n\nThe Visual Complexity principle states that it has to be difficult to receive the visual information of interest [12]. For example, DAS [13] is a simple graphical password that allows the user to create a free-form drawing on a touchscreen and to use it as her password. Decoy Strokes [42] is a shoulder-surfing resistant variation of DAS that draws strokes alongside the user's password to confuse a malicious observer. The problem with such schemes is that the user is exposed to the same distracting information and may end up confused as well, leading to slower authentication and more frequent input errors. Also, if the attacker is able to observe multiple times during the authentication process or to record it, he may be able to steal the credentials of the user.\n\nThe Cognitive Complexity principle states that it has to be difficult to process the acquired visual information [38]. For example, in one of the cognitive trapdoor games [31], the user is required to enter her PIN in the following way. The digits on the provided keypad are separated into two sets based on their color; half of them are black, and half of them are white. The user selects the set that the current digit of her PIN belongs to, and then the digits are reassigned to the two color sets. This procedure is repeated until the scheme is able to uniquely determine the correct digit by intersecting the selected sets. Then, the user proceeds to the next digit of her PIN. For an observer, it is extremely difficult, if not impossible, to successfully perform sequential intersections of sets to extract the correct PIN. However, such schemes are usually complex for the users too, with all the inevitable consequences for usability. In addition, recorded material or even repeated observation may reveal the authentication credentials, since all the useful information is observable.\n\nThe Alteration principle states that the required input has to change in every authentication attempt [28,41]. For example, Deja Vu [9] presents to the user a number n of images, and asks her to specify which of them belong to a predefined set of images, called the user's portfolio. In each authentication attempt, different images from the portfolio are assigned to the set of the n images. As a consequence, an observer cannot learn the portfolio of the user in a limited number of observations. However, multiple observations may reveal the whole portfolio. In general, with such schemes is difficult for the user to get familiar with a standard input. For example, with Deja Vu the user has to identify different pictures in every authentication attempt. This requires additional cognitive effort and may affect the authentication time and the error rate.\n\nThe One-to-Many principle states that the same input has to correspond to more than one authentication credentials [17,40,29,8,31,37]. For example, SlotPIN [14] allows the user to enter a PIN by aligning four vertical reels of randomly ordered digits. The first reel is static and denotes the position of the first PIN digit. The other three reels get aligned by the user according to the PIN. In the end, ten PINs are formed, and a shoulder-surfer is unable to know which is the correct one. In addition, it is difficult to memorize all of them. However, the attacker could replicate the same input without the need to know the correct credentials. That's why schemes designed under this principle randomize the input interface periodically. In the case of SlotPIN, the digits on the reels are randomized in every authentication attempt. The problem with such schemes is that they exhibit high complexity in order to break the one-to-one correspondence between inputs and authentication credentials. This results in high cognitive effort on the user side and renders such schemes unacceptable for frequent usage, e.g. for unlocking mobile phones. Also, multiple observations may reveal the correct credentials.\n\nThe Non-Visual Information principle states that at least part of the information of interest has to be transmitted through channels that are not observable. This way, an observer is always missing a piece of information and shouldersurfing is mitigated even in cases that multiple observations or recordings are possible. However, the performance of such schemes in usability and deployability varies. For example, schemes which use audio and haptic information [3,35] suffer from high authentication time and their requirements for additional hardware heavily affect their deployability. However, the emergence of touchscreen devices which are pressure-sensitive may favor schemes which use this kind of haptic information [19,32,22,34,33,23], if they are combined with satisfying usability. Gaze-based authentication [16] corresponds to high authentication time, and authentication based on brainwaves [7] or bone conduction [36] requires special equipment. Fingerprint authentication [30] is a scheme that gains popularity nowadays by offering excellent usability. A usual problem with biometrics like fingerprints is that they cannot be revoked. In addition, biometrics can be used to uniquely identify a person and they raise privacy concerns. However, the concept of cancelable biometrics [27] could alleviate both problems.\n\n\nTHREAT MODEL\n\nA threat model guides the design of a security scheme. Our threat model consists of shoulder-surfing attack scenarios against smartphone authentication. Different scenarios involve attacks with different difficulty to mitigate. The most difficult scenario that we consider corresponds to situations similar to a crowded train where we assume that a shouldersurfer may be as close as 25 inches to the user. The least dangerous scenario we consider corresponds to workplace conditions, where a shoulder-surfer has the ability to repeatedly observe the user but from a minimum distance of 60 inches (e.g. the shoulder-surfer works to the cubicle next to the user). A scenario with intermediate difficulty corresponds to a non-crowded public place, where a shoulder-surfer may approach the user in a radius of 35 or 45 inches. As we can see, in each scenario we have to protect the user for viewing distances which are equal or bigger than a particular distance. We call such a distance \"safety distance\", and we denote it with ds. It is also important to consider that when the shoulder-surfer stands behind the user, it is difficult to have visual contact with the phone screen even if he is considerably taller than the user. Based on that, we assume that the shoulder-surfer is standing next to the user at an angle that is at least 30 degrees. We would like to note that the aforementioned safety distance values that ranged from 25 to 60 inches and corresponded to different scenarios, were determined empirically. Similarly, the value of 30 degrees is empirical too.\n\nWe additionally consider the scenario that the attacker has the ability to record the user during the authentication process. It is difficult for an attacker to record a user from a close distance while escaping her attention. Also, it is difficult to capture the user during the short time of the authentication process that usually happens unexpectedly. Consequently, we will focus on the scenario that the recorded material is collected with surveillance cameras. In such a case, the distance of recording is assumed to be at least 100 inches.\n\n\nPERCEPTION OF AN IMAGE BY A HU-MAN OBSERVER\n\nTo explain how we designed IllusionPIN we first need to provide some background information about the perception of grayscale images. Based on the 2D Fourier transform which describes an image as a superimposition of sine wave gratings, we first examine the perception of a single sine wave grating and then we extend to arbitrary images.\n\n\nPerception of Sine Wave Gratings\n\nWe study how a human observer perceives an image of a sine wave grating by studying how this is done by a single eyeball. In figure 1, we show how we model the behavior of an eyeball. We assume that it behaves as an ideal pinhole camera which directs light rays from the surface of an image G through a pinhole and onto the retina. On the retina, photoreceptors get activated and form a different 2D image Gr which corresponds to the visual information that the eye receives. This is a simplification of the real process, but offers an acceptable approximation, while being mathematically convenient. Under this model, Gr is shaped through the perspective projection of G on the retina, and consequently, Gr is a scaled version of G. This means that G and Gr are both sine wave gratings, but with different parameters, meaning different spatial frequency, contrast and phase. So, we can think of the image formation process on the retina as a projection that modifies the parameters of G. This leads us to make a distinction between the actual and the perceived parameters of G, which correspond to its parameters before and after its projection on the retina respectively. The perceived parameters of G are the parameters of Gr. Based on these remarks, given the actual parameters of a grating G and the position N of an observer, we want to derive the perceived parameters of G.\n\nWe start by considering the relation between the actual and perceived contrast. Perceived contrast depends on the amount of light rays that reaches the retina from each part of an image, and consequently, we need to model the illumination of the 3D scene. In the context of our work, illumination results from the screen of the device, from external light sources, e.g. a light bulb, and from light reflected off surfaces in the surrounding space. We make two assumptions regarding illumination. The first is that illumination is uniform. This means that each part of the image emits the same amount of light. This is a fair assumption since we consider that the dominant light source is the screen of the device. The second assumption is that the amount of light rays that reaches the retina is adequate to perceive the visual information of the image. This assumption is based on the ability of smartphone devices to adjust the brightness of their screens to the illumination level of the surrounding space. Following these assumptions, we lift the need to make a distinction between the actual and the perceived contrast of a grating, and from now on we will consider them as being equal.\n\nNext, we consider perceived phase. As we have seen, Gr is a scaled version of G. Scaling preserves the number of cycles of a grating as well as its phase, and consequently, we will consider perceived phase to be equal to the actual phase.\n\nNow we move to the calculation of the perceived spatial frequency. In figure 1, we can see that G subtends visual angle (θx, θy). So, if f = ( nx /dx, ny /dy) is the actual spatial frequency of G, its perceived spatial frequency will be fp = ( nx /θx, ny /θy), where nx, ny is the number of cycles in the horizontal and vertical directions, and (dx, dy) is the size of the image measured in units of length. All we need to do is to calculate (θx, θy). To this end, we consider the general setting depicted in figure 1. The coordinate system for specifying spatial positions is placed at the center of the image where we assume that the observer is focused. The position of the observer is N = (x0, y0, z0), where z0 > 0, meaning that the observer is in front of the image. For θx we have:\nθx = cos −1 − − → N A · − − → N B | − − → N A| · | − − → N B| (1) For − − → N A we have: − − → N A = − − → N O + −→ OA = −(x0, y0, z0) + (− dx /2, 0, 0) = (−x0 − dx /2, −y0, −z0)(2)\nSimilarly for − − → N B we have:\n− − → N B = (−x0 + dx /2, −y0, −z0)(3)\nBased on equations 2 and 3, from equation 1 we get: θ x = cos −1\nx 2 0 −1/4·d 2 x +y 2 0 +z 2 0 √ (x 0 +dx/2) 2 +y 2 0 +z 2 0 · √ (x 0 −dx/2) 2 +y 2 0 +z 2 0(4)\nSimilarly, for θy we get: θ y = cos −1\ny 2 0 −1/4·d 2 y +x 2 0 +z 2 0 √ (y 0 +dy/2) 2 +x 2 0 +z 2 0 · √ (y 0 −dy/2) 2 +x 2 0 +z 2 0(5)\nFrom equations 4 and 5 we can calculate θx and θy.\n\nIf we transform equations 4 and 5 in spherical coordinates (r, θ, φ), where r ∈ (0, +∞) is the viewing distance, θ ∈ (0, π) is the polar angle, and φ ∈ (− π /2, + π /2) is the azimuth angle, for N = (r0, θ0, φ0) we get: θ x = cos −1\nr 2 0 −1/4·d 2 x √ (r 2 0 +1/4·d 2 x ) 2 −(1/2·r 0 sin θ 0 sin φ 0 d x ) 2(6)\nθ y = cos −1  [20].\nr 2 0 −1/4·d 2 y √ (r 2 0 +1/4·d 2 y ) 2 −(1/2·r 0 cos θ 0 d y ) 2(7)\nWe can use these equations to examine how viewing distance and viewing angle affect visual perception. If we vary the value of viewing distance r0, θx and θy can take all their possible values. When r0 = 0 we get θx = θy = π. When r0 approaches infinity, the factor r 2 0 dominates equations 6 and 7, and we get θx ≈ θy ≈ cos −1 r 2 0 √ r 4 0 = 0. In contrast, when we change the values of θ0 or φ0, we just affect the denominators in equations 6 and 7 and the value of visual angle still heavily depends on the viewing distance. This shows that viewing distance is the main factor that affects visual perception. For this reason, in the following sections, when we need to demonstrate changes in perception we mainly consider variations in the viewing distance of the observer. However, to accurately estimate the way an image is perceived we have to consider the exact viewing position of the observer.\n\n\nContrast Sensitivity Function\n\nThe human visual system (HVS) demonstrates variability in its sensitivity to the perceived contrast of gratings with different perceived spatial frequencies. This variability is modeled through the contrast sensitivity function (CSF), which can be seen as a band-pass filter that the HVS applies to gratings according to their perceived spatial frequencies. Figure 2 provides the model of the CSF proposed by Mannos et al. [20]. CSF favors gratings with perceived spatial frequency magnitudes at a particular range around 10 c /d. For example, a grating with perceived spatial frequency magnitude equal to 30 c /d must have bigger perceived contrast than a grating with perceived spatial frequency magnitude 10 c /d to be perceived with the same clarity. Gratings with perceived spatial frequency magnitude beyond the limit of the visual acuity cannot be perceived, and that's why CSF cuts off completely every perceived spatial frequency with magnitude over 60 c /d.\n\n\nPerception of Superimposed Sine Wave Gratings\n\nAccording to the 2D Fourier transform, an image can be seen as a superimposition of sine wave gratings with unique actual spatial frequencies. The contribution of each grating is quantified by the magnitude of its Fourier coefficient |X( f )|, which is proportional to the grating's amplitude by a constant factor. Given an example image, in figure 3 (a) we visualize its actual 1D spectrum 1 . The horizontal axis represents the magnitudes of actual spatial frequencies to create a simple 2D graph instead of a 3D one. Unless stated otherwise, we will refer to 1D spectrums simply as spectrums. The vertical axis represents the contribution of gratings through the quantities ln (1 + |X( f )|). When the actual spatial frequencies fi, i = 1, 2, ...n from n different gratings have the same magnitude | f1|, the corresponding ln (1 + |X( fi)|) values are added together and the result is considered the total contribution of the n gratings. Since we are dealing with digital images, we are using the Discrete Fourier Transform (DFT) and the circles on the curve of figure 3 (a) correspond to the existing discrete magnitude values of actual spatial frequencies.\n\nTo understand how an image is perceived from a specific viewing position N = (r0, θ0, φ0), we use equations 6 and 7 to express the actual spectrum in perceived spatial frequencies. We call such a diagram the perceived spectrum. To aid our demonstrations, we consider the special case that the observer is looking directly at the image (θ0 = π /2, φ0 = 0) and additionally holds that dx = dy = d. In such a case, from equations 6 and 7 we get θx = θy = θ. As a consequence, it holds that | fp| = d /θ · | f | and the perceived spectrum has exactly the same form as the actual spectrum. In figure 3 (b), we depict the perceived spectrums of the image with the actual spectrum of figure 3 (a) when it is viewed from 3 different distances r0. The blue curve corresponds to the smallest viewing distance. As the viewing distance increases, the visual angle gets smaller and the factor d /θ gets bigger. As a consequence, the perceived spectrums are stretched and take the form of the cyan and the red curve. Since the contrast of a grating can be expressed through its amplitude, we can use the CSF to filter the perceived spectrums in order to understand how they are perceived. As we can see, the band-pass nature of the CSF favors the cyan curve. In particular, the CSF assigns small gain values to gratings with a big contribution in both the blue and the red curve. As a consequence, part of the visual information that the image is carrying is either perceived with less clarity or it is not perceived at all. For example, in the case of the red curve that the viewing distance has its bigger value, many gratings with high perceived spatial frequency magnitudes are completely cut-off. That's why when an image is viewed from a big distance, it is perceived as being blurred.\n\n\nILLUSIONPIN (IPIN) 5.1 Method\n\nIllusionPIN is a PIN-based authentication scheme for touch- screen devices which offers shoulder-surfing resistance. The design of IllusionPIN is based on the simple observation that the user is always viewing the screen of her device from a smaller distance than a shoulder-surfer. Based on this, the core idea of IllusionPIN is to make the keypad on the touchscreen to be interpreted with a different digit ordering when the viewing distance is adequately large. This way, when the shoulder-surfer is standing far enough, he is viewing the keypad as being different from the one that the user is utilizing for her authentication, and consequently he is unable to extract the user's PIN. Also, the keypad is shuffled in every authentication attempt (or every digit entry) to avoid disclosing the spatial distribution of the pressed digits. We create the keypad of IllusionPIN with the method of hybrid images [25,24] and we call it a hybrid keypad.\n\nA hybrid keypad I is created by blending appropriately two normal keypads denoted with Iu and Is. Our goal is I to be interpreted as being Iu when it is viewed from close up, and to be interpreted as being Is when it is viewed from far away. That's why we call Iu the \"user's keypad\" and Is the \"shoulder-surfer's keypad\". To create I, we process Iu with a high-pass filter and Is with a low-pass filter. The filtering results in two new images, I h u and I l s , and we simply set I = I h u + I l s . So, a hybrid keypad is composed by a high spatial frequency component I h u and a low spatial frequency component I l s . To understand how the interpretation of I is changing, we consider that we directly view an example hybrid keypad from different distances. If the viewing distance is adequately small, the visual angle is such that the perceived spectrums of I h u and I l s occupy low perceived spatial frequency magnitudes as depicted in figure 4 (a). As we can see, the gain distribution of the CSF favors the perceived spectrum of I h u , and as a result I is interpreted as being Iu. In figure 4 (b) we depict the same perceived spectrums for a bigger viewing distance. As we can see, the perceived spectrums are stretched to higher perceived spatial frequency magnitudes and the CSF favors I l s . As a consequence, Is dominates the perception of I. From intermediate viewing distances, both I h u and I l s are visible to a considerable extent and is not certain how I is interpreted. In figure 5, we provide an example hybrid image. In figure  5 (b) we downscale the image of figure 5 (a) to simulate how it is perceived when it is directly viewed from a 2-times bigger distance. From reading distance, we expect the digit ordering of the hybrid keypad in figure 5 (a) and (b) to be perceived as being different.  \n\n\nParameters\n\nGiven the images Iu and Is, the parameters that specify the hybrid keypad I are the parameters of the low-pass and the high-pass filters which are used to create I h u and I l s . For the low-pass filtering, we use a 2D Gaussian filter G l , and for the high-pass filtering we use a filter G h = 1 − G h l , where G h l is also a 2D Gaussian filter. In the spatial domain, both G l and G h l have zero mean values and diagonal covariance matrices with equal standard deviations. This way, they affect an image by an equal number of pixels in each dimension. So, if σ ls x and σ ls y are the standard deviations of G l in the horizontal and vertical dimensions, it will hold σ ls x = σ ls y . If σ lf x and σ lf y are the corresponding standard deviations in the frequency domain, it will hold\nN f x /2πσ lf x = N f y /2πσ lf y ⇒ σ lf y = N f y /N f x · σ lf x , where (N f x , N f y )\nis the size of the filter in samples. This shows that we can completely define G l by specifying either σ ls y or σ lf y . For convenience, we prefer to work in the frequency domain and consequently, we consider σ lf y as the single parameter of G l . Similarly, we define G h through the standard deviations of G h l , for which hold σ hf y = N f y /N f x · σ hf x in the frequency domain. Consequently, we consider σ hf y as the single parameter of G h .\n\nWe have to make two additional remarks. The first is that we want a filtered image to maintain its original size in pixels, (Nx, Ny), without the creation of additional frequency components in the stop-band of the filters. To this end, we perform the filtering in the frequency domain by multiplying the (Nx, Ny)-point DFT of the image with the corresponding filter. Because of this, the ratio N f y /N f x is equal to the ratio of the image dimensions Ny /Nx, which usually is 16 /9. The second remark is that we measure σ lf y and σ hf y in number of cycles per image ( c /im). This way, the visual effect of filtering is invariant to the size of the image.\n\n\nTuning\n\nThe values of σ lf y and σ hf y create a trade-off between security and usability. When the value of σ lf y is increased, I l s becomes more visible since its perceived spectrum extends to higher spatial frequencies. This means that the user gets more distracted during her authentication and she may even need to bring the touchscreen closer to her eyes to clearly see the user's keypad. So, usability is negatively affected. However, a shoulder-surfer needs to reduce his viewing distance too in order to see the user's keypad with the same clarity, and consequently security is increased. When σ lf y is decreased, the opposite effects are caused and usability is increased while security is decreased. The same trade-off is observed when the value of σ hf y changes, since the clarity of I h u is affected. In particular, when σ hf y is decreased, usability is increased and security is decreased, while the opposite behavior is observed when σ hf y is increased. To resolve the trade-off between security and usability, we first set the value of σ lf y in such a way that every possible level of security and usability is still possible depending on the value of σ hf y . Then, based on our security requirements, we set the minimum σ hf y that satisfies them. This way, usability is maximized under the constraint that our security needs are met. To set the value of σ lf y , we consider that if σ lf y gets very small, I l s will be that blurred that the original digits from Is won't be recognizable, no matter the viewing distance. On the other hand, we have to consider that a user is usually holding her device at a particular distance. If σ lf y gets very big, the user's keypad won't be able to dominate the perception from that specific viewing distance. So, we set σ lf y to be close to the minimum value that allows the digits on I l s to be interpreted. We experimented with N exus 6 and iP hone 6 smartphones which have representative keypads at their lock screens while they differ in size, resolution, and visual content. We concluded that a suitable value for σ lf y is 35 c /im. However, if the digits in another keypad are considerably different, e.g. much thicker, we may need to adjust the value of σ lf y to make them equally recognizable.\n\nTo specify the value of σ hf y we have to consider the given security requirements, which correspond to a safety distance value. In Section 6 we explain how we estimate the minimum value of σ hf y that respects a particular safety distance.\n\n\nDiscussion\n\nFor the design of IllusionPIN we follow the principle of obscurity, since the shoulder-surfer's keypad Is obscures the user's keypad Iu. We could use any image in the place of Is, but we decided to always use the image of keypad because this way I h u and I l s are visually aligned. This means that the digits in I h u and I l s overlap, and the less dominant keypad is perceived as noise, providing more clear interpretations of the hybrid keypad.\n\nWe also apply the principle of alteration by shuffling the user's keypad in every authentication attempt, or after every digit entry. Otherwise, it would be enough for a shouldersurfer to memorize just the spatial arrangement of the pressed digits. However, the shoulder-surfer's keypad always remains the same because this way we expect the user to become gradually better on ignoring it, resulting in faster authentication with fewer errors. Out of all the possible digit orderings that Is may have, we choose the regular digit ordering, as in figure 5. The reason is that this is the ordering that we expect an attacker to be the most familiar with, and as a consequence, to have the tendency to recognize. In our threat model, we have considered 4 shoulder-surfing scenarios with safety distance values which are equal to 25, 35, 45 and 60 inches. For each of these values we estimate the minimum σ hf y that keeps the user protected. This way we create 4 hybrid keypads for which hold that when security is increased, usability is decreased. These keypads are offered as predefined options to the user to pick the one that fits better to her needs. ))) 10: if v ≥ v th then 11:\n\n\nVISIBILITY ALGORITHM\n\nreturn No 12: else 13:\n\nreturn Yes\n\nThe visibility algorithm receives as inputs a hybrid keypad I and a viewing position N in the 3D space. It returns a binary prediction on whether the user's keypad of I is visible to an observer who is in position N . We use this prediction either to estimate the minimum safety distance that corresponds to a given hybrid keypad, or to create a hybrid keypad that respects a given safety distance. Algorithm 1 provides the pseudocode of the visibility algorithm.\n\n\nAlgorithm\n\n\nDistance-As-Filtering\n\nIn the first step of the visibility algorithm, we simulate the way I is perceived from the viewing position N by using the distance-as-filtering hypothesis proposed by Loftus et al. [18]. The distance-as-filtering hypothesis states that we can simulate the way an image is perceived from a particular viewing distance by filtering the image with an appropriate low-pass filter. The intuition behind this method is based on the effect that the CSF has in the visual perception of an image. However, as explained by Loftus et al. [18], the perception of an image from a particular distance and the perception of the corresponding filtered image are not identical, but they are equivalent with respect to performance on some task. Loftus et al. experimentally verified the distance-as-filtering hypothesis for face recognition tasks by designing a low-pass filter of a particular form. Our task is the recognition of digits on hybrid keypads, which differs from face recognition. However, both tasks require the perception of almost equally fine visual details, and consequently, we expect the low-pass filter designed by Loftus et al. to be applicable in our task too. We should also note that in the experiments conducted by Loftus et al., every observer was looking directly at an image and his viewing position was completely defined by his viewing distance. We use the same filter to simulate the perception of an observer who is at a random viewing position, by making the simplifying assumption that the perception of an image depends on the visual angle that it subtends, no matter where the observer stands.\n\nThe low-pass filter proposed by Loftus et al. [18] has constant gain equal to 1 until the perceived spatial frequency magnitude | f0|, and then drops until it reaches the value 0 is depicted when I l s is directly viewed from different distances. In the second row, the corresponding button of I DAF is depicted when I is directly viewed from the same distances as I l s . In the third row, the value of the visibility index for each viewing distance is provided.\n\nat the perceived spatial frequency magnitude | f1|. We call it DAF filter and it is mathematically defined in the following way:\nDAF ( fp) =      1 if| fp| < | f0| 1 − log (| fp |/| f 0 |) log (r) 2 if| f0| ≤ | fp| ≤ | f1| 0 if| fp| > | f1| (8)\nwhere r is a positive constant for which holds r > 1, and | f0| = | f 1 |/r. So, the parameters of the filter are the values of r and | f1|. Loftus et al. conducted 4 different face recognition experiments to specify the values of the parameters, and concluded that r = 3, while | f1| may be equal to 25, 31 or 42 c /d, depending on the task at hand. In Section 6.2.2, we explain how we specified | f1| for the purposes of our work.\n\n\nVisibility Index\n\nIn the second step of our algorithm, we compute the visibility index which quantifies how visible the user's keypad of I from the viewing position N is. We remind that I = I l s + I h u . To compute the visibility index, we apply the DAF filter both to I and to I l s , and we create the images I DAF and I l,DAF s , respectively. This way we simulate how I and I l s are perceived when they are viewed from position N . Then, we separate in equal rectangular regions the buttons from I DAF and I l,DAF s , and we compute the similarity of the corresponding buttons with the mean structural similarity index (MSSIM) [39]. The visibility index is the mean value of the 10 MSSIM index values from the pairs of corresponding buttons.\n\nThe visibility index is the cornerstone of our algorithm and we would like to clarify its behavior and the intuition behind it. Given a reference image I1 and a distorted version of I1 denoted with I2, MSSIM index measures the similarity between I1 and I2. The maximum value of the MSSIM index is 1 and is obtained when I1 and I2 are identical, meaning that I2 is not distorted at all. In our case, I l,DAF s is the reference image and I DAF is considered a distorted version of I l,DAF s because of the presence of the user's keypad. The maximum value of the visibility index is 1 and is obtained when the user's keypad is completely out of perception. In figure 6, we demonstrate the behavior of the visibility index for an example hybrid keypad I. In the first row, we depict the third button of I l,DAF s , when I l s is directly viewed from different distances. In the second row, we depict the third button of I DAF , when I is directly viewed from the same distances as I l s . In the third row, we provide the value of the visibility index for each viewing distance. From left to right, the viewing distance is increasing. As we can see, as the viewing distance is increasing, the digit 9 which belongs to the user's keypad is fading away and the visibility index is increasing. When the visibility index becomes big enough, the digit from the user's keypad is no longer visible. We would like to make clear that we apply the MSSIM index between separated buttons and not between I l,DAF s and I DAF as a whole, because in I l,DAF s and I DAF exist big, almost identical, regions and the MSSIM index would have a very big value irrespectively of the buttons form.\n\nThe MSSIM index follows the premise that the main function of the human eye is to extract structural information from the viewing field. This connection to human perception is the main reason that we decided to use the MSSIM index. An additional advantage is that MSSIM index is very easily computed.\n\n\nThreshold Value of the Visibility Index\n\nLet's assume that we are given a hybrid keypad I and an observer who first views I from position N1 and then from position N2. If the corresponding visibility index values are v1 and v2 and holds v2 > v1, we expect the user's keypad to be less visible from position N2 than from N1. If v1 v2, we expect the user's keypad to be almost equally visible in both cases. This is a direct consequence of the way we have defined the visibility index. Now let's assume that two different hybrid keypads I1 and I2 are viewed by the same observer from positions N1 and N2, respectively. If the corresponding visibility index values are v1 and v2 and holds v2 > v1, we expect the user's keypads of I1 to be more clearly visible than that of I2. Similarly, if v1 v2, we expect the user's keypads of I1 and I2 to be almost equally visible. This is the main assumption that we make about the behavior of the visibility index and we expect to hold in its reverse form too. This means that if the user's keypad from a hybrid keypad I1 is more clearly visible than the user's keypad of a different hybrid keypad I2 when they are viewed from positions N1 and N2, respectively, then for the corresponding visibility index values v1 and v2 we expect to hold v2 > v1. If the user's keypads from I1 and I2 are almost equally visible, then we expect v1 v2. It is important to mention that we expect these assumptions to hold only for the same observer. The reason is that the visual capabilities of different observers vary. For example, if a person with strong vision is directly viewing a hybrid keypad from a particular distance and is able to recognize the user's keypad with difficulty, then a person with weaker vision will have to go closer to the image to interpret it in the same way. As a result, the hybrid keypad will be interpreted in the same way by the two observers, but the value of the visibility index will be different.\n\nBased on the aforementioned remarks, we set as a threshold v th the value of the visibility index when a particular ob-server is able to marginally recognize the digits of a user's keypad. Then, the visibility algorithm calculates the visibility index v for the inputs I and N , and compares it with v th . If v ≥ v th , we predict that the user's keypad cannot be interpreted by the observer. If v < v th , we predict that the observer is able to interpret the digits of the user's keypad. Since the threshold value will vary for different observers, we universally use the v th value that corresponds to people with the strongest vision, because we don't want to mistakenly predict that the user's keypad is not visible when it is.\n\n\nParameter Tuning\n\nThe parameters of the visibility algorithm are the spatial frequency | f1| and the threshold v th . To specify their values, we conducted a user study.\n\n\nData Collection\n\nParticipants. We recruited 11 participants from our institution, who were between 21 and 34 years of age. Our aim was to have participants with strong vision and that's why they all were of young age. Out of the 11 participants, 6 reported that they had either myopia or astigmatism, but they were wearing their glasses during the process. The rest of the participants reported that they did not have any problem.\n\nMaterials. We used 2 different phones, a N exus 6 and an iP hone 6. These two phones have displays with the same dimension ratio (= 16 /9), but different size and different resolution. The N exus 6 has display size 5.96 inches and resolution 1440 × 2560, while the iP hone 6 has display size 4.7 inches and resolution 750 × 1334 pixels. For each phone, we created 7 different categories of hybrid keypads. In 6 of them, we set σ lf y = 35 c /im, since this is the value that we have decided to use in our hybrid keypads. The value of σ hf y was equal to 120, 160, 200, 240, 280 and 320 c /im. In the seventh category, we tried a different value for σ lf y , which we set equal to 60 c /im, while σ hf y = 200 c /im. For each category, we created 30 hybrid keypads which had user's keypads with different digit ordering.\n\nProcedure. Each subject participated in at least 3 sessions. Each session was split in 3 trials. The goal of each trial was to specify a viewing position N , from which the user's keypad of a hybrid keypad was marginally recognized. The hybrid keypad was displayed on a smartphone device. To specify the viewing position N of the participant, we used spherical coordinates; meaning that N = (r0, θ0, φ0). The coordinate system was placed at the center of the image. In each trial, we kept θ0 and φ0 constant and we varied r0.\n\nThe exact procedure was the following. During each trial, a smartphone device was placed on a tripod that matched the height of the participant. This way, when the participant was looking at the phone, θ0 was π /2 rad. To change the value of θ0, we tilted the phone on the tripod. Also, the participant was able to move relatively to the tripod in order to change the value of φ0. Having specified θ0 and φ0, the participant started to approach the phone from a big distance r0. The initial value of r0 was big enough to keep the user's keypad out of perception. As the participant was approaching to the phone, the user's keypad was starting to become visible. We recorded the maximum r0 from which the participant was able to read the digits on the user's key- pad. In particular, the participant had 15 seconds to read all the 10 digits and only one mistake was allowed. The time limit is connected to the fact that a shoulder-surfer has limited time to observe the user while entering her authentication credentials. Also, as the participant was approaching the phone, each time he or she failed to read the digits, we switched to a different hybrid keypad from the same category in order to be sure that the participant is not getting familiar with a specific digit ordering. This is the reason that we created multiple hybrid keypads from each category for each phone.\n\nFor each session, the value of θ0 was constant. Specifically, θ0 was equal to π /2, π /4 or π /3 rad. On each trial of a session, we had a different value for φ0. During the first trial, we had φ0 = 0 rad, during the second φ0 = π /6 rad, and during the third φ0 = π /3 rad. Since θ0 ∈ (0, π) and φ0 ∈ (− π /2, + π /2), the values of θ0 and φ0 that we considered belonged to the 1 /4 of the available space. The reason is that the visual angle is symmetric with respect to the xy, zx and zy planes as can be easily seen in equations 4 and 5. In addition, on each session we used hybrid keypads from a single category and we used only one smartphone device.\n\nLast but not least, we have to comment on the illumination of the scene since it affects the perception of the hybrid keypad. The experiments were conducted in an indoor space with normal artificial lighting and the smartphone was carefully placed to avoid distracting reflections from surrounding objects. In addition, the brightness of the screen was set to its maximum value. In general, we tried to create favorable conditions for the observers, since the collected data would be used for the estimation of the security strength of IPIN, and we wanted to correspond to the worst case scenario.\n\nCollected data. An entry in our dataset is composed of the identification number of a participant, the hybrid keypad that was at view, and the viewing position from which the participant was able to marginally recognize the digits from the user's keypad. In total, we have 270 entries. We tried to balance the number of data that we collected with each phone and from each hybrid keypad category. We stopped collecting data when the statistical analysis provided robust results with respect to the variables of our data.\n\n\nEstimation of the DAF Filter Parameters\n\nWe considered a subset of the data with 81 entries from 3 participants and we calculated the visibility index for each entry. We expected the behavior of the DAF filter to have two characteristics. The first was the visibility index to have small standard deviation for each participant. The second was the filtered hybrid keypads to have a user's keypad with digits that can be marginally recognized. Loftus et al. [18] suggested 3 possible values for | f1|, depending on the task at hand. Unfortunately, there was not a unique value for | f1| that could create a DAF filter with the desired behavior for our task. The reason was that when the viewing position N = (r0, θ0, φ0) of a participant had big φ0 or small θ0, the corresponding value of the visibility index was significantly smaller. This means that when the participants were viewing a hybrid keypad from an angle, they had to approach closer to the screen than expected according to the visibility index values. We assume that this problem is connected with the fact that the brightness of LCD screens, like the ones used by iP hone 6 and N exus 6, dims when an observer is viewing from an angle. As a result, when the participants were viewing from an angle, the perceived contrast was lower and more gratings from the hybrid keypad were not perceived. To account for this effect, we gradually reduce the value of | f1| as φ0 is increasing and θ0 is decreasing. Based on these remarks, we defined the DAF filter in 2 steps.\n\nIn the first step, the goal was to specify the initial value of | f1| when the brightness of the screen is unaffected by the viewing angle. The possible values for | f1| were 25, 31 and 42 c /d, as proposed by Loftus et al. [18]. To select the most suitable value, out of the 81 entries in our dataset, we singled out those with φ0 = 0 and θ = π /2, meaning the entries that corresponded to an observer who is looking directly at the screen. Then, since this subset had a small size, we applied the 3 DAF filter variants to the corresponding hybrid keypads and we picked the filter that created hybrid keypads with marginally recognizable user's keypad. Figure 7 (a) provides the third button of a hybrid keypad from our subset. The digit of the shoulder-surfer's keypad is 3 and the digit of the user's keypad is 6. We simulate how the button is perceived when it is directly viewed from 63 inches, since this viewing position was part of our data for this hybrid keypad. In figure 7 (b), we used a DAF filter with | f1| = 25 c /d, in figure 7 (c), | f1| = 31 c /d, and in figure 7 (d), | f1| = 42 c /d. As we can see, the digit on the button is interpreted as 3 in figure 7 (b), it is marginally interpreted as 6 (or even 3) in figure 7 (c), and is clearly interpreted as being 6 in figure 7 (d). Following this way of reasoning, we concluded that the most suitable initial value for | f1| is 31 c /d.\n\nIn the second step, we modeled how the value of | f1| changes as a function of θ0 and φ0. We assume that | f1| = 31 · A(φ0, θ0). For the function A, we have:\nA(φ0, θ0) = 1 − φ0 π /2 ka · 1 − θ0 − π /2 π /2 ka(9)\nwhere ka is a positive real number that controls how fast the value of | f1| drops when φ0 is increasing or θ0 is decreasing. We use the same number ka in both factors because we assume that the brightness of the screen changes in the same way when either φ0 or θ0 is changing. We considered five different cases for the effect of φ0 and θ0. The first was that they don't affect | f1|, meaning that A = 1. The rest four cases corresponded to ka = 2.5, ka = 3, ka = 3.5 and ka = 4. For each of these cases, we created the corresponding DAF filter and we computed the visibility index for all the 81 entries in our subset. Then, for each participant we calculated the standard deviation of the visibility index. In Table 1 we provide the results from this process. Each row corresponds to a different participant and each column corresponds to a different function A(φ0, θ0). As we can see, all the participants demonstrated the smallest standard deviation for ka = 3, and consequently, this was the choice we made. We have to note that the data we used were from participants without reported problems in their vision, because we wanted to increase the probability of defining a DAF filter that simulates the visual perception of a person with strong vision.\n\n\nEstimation of the Threshold Value for the Visibility Index\n\nAccording to the assumptions we made in Section 6.1.3, the visibility index should have almost identical values for each participant in our dataset, irrespectively of the phone that was used during the data collection process, or the categories that the hybrid keypads belonged to. To verify this, we used the DAF filter we defined in the previous section to compute the visibility index for each of the 270 entries in our dataset. Then, we computed the coefficient of variation (cv) for the visibility index values of each participant. We provide the results in Table 2. As we can see, the cv is lower than 10% for every participant, and consequently, we concluded that the values of the visibility index are homogeneous for each participant.\n\nWe wanted to further test the assumption that the values of the visibility index for each participant are independent of the smartphone device that was used. Also, we wanted to test the assumption that the values of the visibility index vary significantly between different participants. We tested both of these assumptions by applying a two-factor ANOVA with randomized complete block design. We used data from the participants who were exposed to both phones during the data collection process. These were 5 out of the 11 participants. The visibility index values from different participants were assigned to separate blocks, and consequently, the participants were the blocking factor. The factor of interest within each block was the type of the phone; N exus 6 or iP hone 6. Since the normality and homoscedasticity conditions were satisfied, we were able to compute the p-value of the two factors. The p-value for the type of the phone was 12.07% > 5% and we concluded that the smartphone device is not a statistically significant factor of variation for the value of the visibility index. In contrast, the p-value for the participants was less than 1 and consequently, the values of the visibility index between the participants have statistically significant differences.\n\nWe further tested if participants are a factor of variation by considering the whole dataset with the 11 participants. Our intention was to apply an one-way ANOVA, but the normality and homoscedasticity conditions weren't satisfied, and as a result, we applied the non-parametric Kruskal-Wallis test. The p-value was less than 1 and we confirmed that there are statistically significant differences between the visibility index values of different participants. In figure 8, we provide the corresponding box and whisker plot with median notch of the visibility indexes of all participants. As we can see, the participants formed three main groups based on their visibility index values. Participants p1, p2, p3, p4 and p5 formed the first group, p6, p8, p10 and p11 formed the second group, and p7 and p9 formed the third group. We confirmed this grouping of the participants by performing pairwise comparisons with Man-Whitney tests. Each group had participants with visibility index values in a different range and this is because the participants demonstrated different visual capabilities. The first group had the participants with the highest visibility index values and consequently, these were the people who demonstrated the strongest vision. The mean value of the visibility index in this group was 0, 92996 with standard error 0.00115. The desired threshold value of the visibility index was set equal to 0.93.\n\n\nSAFETY DISTANCE 7.1 Shoulder-Surfing With a Naked Eye\n\nWe assume that we are given a hybrid keypad I and an observer at a position N = (r0, θ0, φ0). If ds is a safety distance for I, then ∀θ0, φ0, if r0 ≥ ds, the user's keypad can not be interpreted by the observer. Of course, we are interested in the minimum possible value of ds, because it corresponds to the maximum protection that I can offer against shoulder surfing. In addition, as we have seen in previous sections, even in the case that we are given a desired ds and we are asked to design a hybrid keypad I that satisfies it, we aim to maximize the usability of I by making ds to be the minimum safety distance of I. So, we are only interested in the minimum possible value of the safety distance.\n\nTo estimate the minimum ds for a hybrid keypad I, we first examine from which viewing positions at the 3D space the user's keypad of I is visible. We call the resulting region of the 3D space, \"visibility region\". To estimate the visi-  bility region of a hybrid keypad, we applied the visibility algorithm for viewing positions from a dense grid at the 3D space. For a hybrid keypad I created with σ lf y = 35 c /im and σ hf y = 320 c /im for the iphone 6 smartphone, the visibility region is depicted in Figure 9. The depicted zx plane can be used as a reference to understand the geometry of the visibility region. The user's keypad is visible when I is viewed from positions which are either on the depicted surface or they are enclosed by it. The coordinate system is the same as the one used in Figure 1, with the image placed in position (0, 0, 0). In addition, for all viewing positions N = (x0, y0, z0), we assume that z0 > 5 inches. The visibility region is symmetric with respect to planes zx and yz. This is something that we expected because of the symmetry in equations 4 and 5. In general, the form of the visibility region is similar to that of an ellipsoid. If we consider spherical coordinates, the safety distance will be slightly bigger than the biggest viewing distance r0 of a position N = (r0, θ0, φ0) that belongs to the visibility region. Since the form of the visibility region is ellipsoidal, for the position N with the maximum r0 will hold θ0 = π /2 and φ0 = 0. This is a result that we expected, since for a given r0, from equations 6 and 7, we can easily derive that the visual angle is maximized when θ0 = π /2 and φ0 = 0. In our threat model, we have assumed that for the viewing position N = (r0, θ0, φ0) of the shoulder-surfer holds |φ0| ≥ π /6 rad. In the visibility region, as |φ0| is increasing, the maximum r0 is decreasing. As a consequence, we define the safety distance to be the minimum distance ds for which holds that from the viewing position N = (rs, π /2, π /6), an observer with strong vision is unable recognize the digits on the user's keypad. Based on this definition, if we are a given a hybrid keypad I, we can apply the visibility algorithm for viewing positions N = (r0, π /2, π /6) with varying r0, and set the safety distance to be equal to the minimum r0 for which holds that the corresponding visibility index v is greater than v th . We are also interested in the case that we are given as a security requirement a safety distance ds and we have to set the value of σ hf y . To do this, we vary the value of σ hf y that we use to create I, and we apply the visibility algorithm for the position N = (ds, π /2, π /6). We create I with the minimum σ hf y for which holds that the visibility index v is greater than v th . This way we were able to create the 4 hybrid keypads that we provide as predefined options to the users of IllusionPIN.\n\n\nShoulder-Surfing Through a Surveillance Camera\n\nWe assume that we are given a hybrid keypad I, a smartphone device where I is displayed on, and a surveillance camera at position N = (r0, θ0, φ0). To estimate the safety distance, we calculate the minimum r0 for which holds that ∀θ0, φ0, the camera is unable to capture the user's keypad I h u . We assume that the camera is unable to capture I h u when a cycle from the grating of I h u with the biggest cycle size, occupies at most a pixel when it is projected on the image plane of the camera.\n\nWe start by estimating the smallest spatial frequency components which are present in I h u , since they will correspond to the cycles with the biggest size. We remind that I h u is the result of applying the high-pass filter G h to Iu. We assume that when G h assigns a gain value less than 0.5 to a spatial frequency, the corresponding grating is cut off. The isocontour of G h that corresponds to the value 0.5 will be an ellipse that we call the cut-off ellipse. We consider that all the spatial frequencies enclosed by the cut-off ellipse are cut off.\nSince G h = 1 − G h l , where G h l (fx, fy) = exp(− 1 /2σ hf x · f 2 x − 1 /2σ hf y · f 2 y )\n, for the axes of the cut-off ellipse will hold:\na = 2σ hf x log ( 1 /0.5) (10) b = 2σ hf y log ( 1 /0.5)(11)\nTo describe the region of the spatial frequencies which are cut off by the filter in a simpler way, we consider the rectangle with the biggest area that is inscribed to the cut-off ellipse. We assume that the spatial frequencies which are cut off by the filter, are those enclosed by this rectangle instead of those enclosed by the cut-off ellipse. We call this rectangle, the cut-off rectangle. For the biggest horizontal and vertical spatial frequency components in the cut-off rectangle will hold:\nf s x = a · √ 2/2 (12) f s y = b · √ 2/2(13)\nBased on these remarks, we conclude that for a grating from I h u with spatial frequency f = (fx, fy) will hold fx ≥ f s x and fy ≥ f s y . For an example filter G h with (σ hf x , σ hf y ) = (120.9375 c /im, 215 c /im), we calculate f s x = 100.69 c /im and f s y = 178.99 c /im. After measuring the smallest frequency components present in I h u , we should calculate the length of the corresponding cycles. To this end, we need to know the resolution xr × yr of the screen that is used to display I and the number of pixels per inch (ppi). Based on that, we can calculate the biggest cycle size in each dimension:\nlx = xr /ppi f s x (14) ly = yr /ppi f s y(15)\nwhere xr /ppi and yr /ppi express the length of the display in the horizontal and vertical dimension respectively, measured in inches. If we assume that I is displayed on a N exus 6 device, the resolution is 1440 × 2560 pixels and ppi = 493 p /in. As a consequence, we find that lx = 0.029 inches and ly = 0.029 inches. As we can see, both lengths are equal. This is something that we expected, because we have designed G h to be isotropic in the spatial domain.\n\nTo estimate the safety distance ds, we assume that we have a square stimulus c of size (lx, ly), which is viewed by a camera in the same way that an image is viewed by a human observer in Figure 1. This means that the camera is modeled as an ideal pinhole camera. In this setting, the camera is in position N = (r0, θ0, φ0). As we increase r0, c subtends increasingly smaller angle. The camera will not be able to capture c for the first time when c will subtend visual angle that corresponds exactly to one pixel. As a result, safety distance will be the biggest distance for which holds that c is projected to exactly one pixel. From equations 6 and 7, we can easily see that a specific visual angle corresponds to the biggest r0 when θ0 = π /2 and φ0 = 0. As a result, in our setting, we assume that the camera is in position N = (ds, π /2, 0), while c subtends visual angle that corresponds to exactly one pixel on the image plane. Since c is a square stimulus, we simply use perspective projection in the horizontal dimension to find that for ds holds:\nds = f · lx /sp(16)\nwhere f is the focal length of the camera, and sp is the pixel size. If we assume that the surveillance camera has the specifications of a N exus 6 camera, for the pixel size will hold sp = 0.001127 mm and for the focal length f = 3.8 mm. As a result, we get ds = 97.81 inches.\n\nIn our threat model, we assumed that for this attack scenario the surveillance camera is recording from a distance that is at least 100 inches. According to the previous calculations, for a hybrid keypad created with (σ hf x , σ hf y ) = (120.9375 c /im, 215 c /im) and displayed on a N exus 6 smartphone, our security requirement is satisfied. It is important to note that this specific keypad is the second most usable hybrid keypad out of the 4 predefined options that we offer to N exus 6 users. In addition, we have to consider that all the assumptions that we made during our calculations were in favor of the attacker. Some examples are that we required the camera to be unable to capture all the gratings from I h u and not a subset of them, that we disregarded the effect of I l s , and that we overestimated the specifications of the surveillance camera. All these show that under real life conditions, is extremely improbable to capture the user's keypad of IllusionPIN with a surveillance camera.\n\n\nEVALUATION\n\nWe would like to estimate the probability of underestimating the safety distance with the visibility algorithm. In other words, we would like to know how probable it is for a shoulder-surfer to steal the credentials of an IllusionPIN user, even if the viewing distance of the attacker is equal or bigger than the estimated safety distance. To this end, we performed simulated shoulder-surfing attacks against Il-lusionPIN.\n\nParticipants. We recruited 21 participants who were undergraduate and graduate students from our institution. All participants were less than 40 years old and they had either normal or corrected vision. Note that all experiments in this work were approved by the IRB of our institution.\n\n\nMaterials.\n\nWe built an application for the Android operating system to aid the execution of the simulated attacks. The application was run on a N exus 6 phone and allowed the users to create five keypad categories that we denote with ci, for i = 1, 2, 3, 4, 5. The first 4 categories were hybrid keypads that corresponded to the 4 safety distance values d i s , i = 1, 2, 3, 4, that we have considered in our threat model. All hybrid keypads were created with σ lf y = 35 c /im. Category c1 was created with σ hf y = 145 c /im and corresponded to d 1 s = 60 inches, c2 had σ hf y = 215 c /im and d 2 s = 45 inches, c3 had σ hf y = 305 c /im and d 3 s = 35 inches, and c4 had σ hf y = 440 c /im and d 4 s = 25 inches. Category c5 was a normal keypad that is used in regular PIN authentication.\n\nProcedure. Participants worked in pairs. Each pair performed 10 simulations in total. In the first 5 simulations one participant was playing the role of the attacker and the other the role of the user. Then, the participants were asked to switch roles and repeat the same 5 simulations. The first 5 simulations si, i = 1, 2, 3, 4, 5, were performed in the following way. The shoulder-surfer was placed at position N = (d i s , π /2, π /6), while the phone was at position N = (0, π /2, 0). The user freely created a 4-digit PIN with a keypad from category ci, and was asked to successfully authenticate 3 times. The attacker was able to observe the user during all authentication attempts and then was asked to replicate the PIN. During s5, we set d 5 s = d 1 s , which was the biggest distance that we considered.\n\nBefore the simulations, we asked the participants to practice with all the keypad categories by authenticating 10 times with each category. During the simulations, we tried to create favorable conditions for the attackers. In particular, the simulations were performed in a silent indoor place with adequate illumination, while the brightness of the phone screen was set to its maximum level. In addition, the users were asked to keep the screen of the phone in the view of the attackers during the authentication. It is also important to clarify that we purposely selected participants of young age with normal or corrected vision, because these participants could impersonate skillful shoulder-surfers.\n\nCollected data. We simulated 84 shoulder-surfing attacks against IllusionPIN, and none of them was successful. The best performance was demonstrated by 2 participants who managed to correctly replicate 3 out of 4 PIN digits in one attack each. All 21 attacks against the regular PIN authentication were successful.\n\nData analysis. It is very important that none of the attackers was able to break IllusionPIN. We should also note that the category of a hybrid keypad wasn't a factor that affected the success rate of the attackers. Based on that, we consider that we have 21 independent samples and we calculate the Clopper-Pearson interval for the success rate of shoulder-surfing attacks. With probability 95%, we expect the interval [0, 0.1329] to contain the success rate. If we increase the sample size, the range of the interval will be reduced. However, based on the unfavorable conditions for our scheme, the visual capabilities of the participants, and the performance of the attackers, we expect that we have to record a very large number of attacks to find a successful one. As a result, we are already confident that the success rate is much closer to 0 than to 0.1329.\n\n\nLIMITATIONS AND CONCLUDING RE-MARKS\n\nThe main goal of our work was to design a PIN-based authentication scheme that would be resistant against shouldersurfing attacks. To this end, we created IllusionPIN. We quantified the level of resistance against shoulder-surfing by introducing the notion of safety distance, which we estimated with a visibility algorithm. In the context of the visibility algorithm, we had to model at a basic level how the human visual system works. In this process, we made a number of simplifying assumptions that limit the accuracy of our calculations. The most obvious example is the pinhole camera model that we used to describe the image formation process in the eye. This is a widely used model, but disregards important parts of the human eye, like the lens. In Section 6.1.1, we made an additional simplification by assuming that the perception of an image depends on the visual angle that it subtends, no matter where the observer stands. A problem with this assumptions is that, depending on the viewing position, we may perceive the dimensions of an image as having a different ratio. For example, as we can see in equations 6 and 7, when φ0 is increasing, only θx is decreasing and the image is perceived as being squeezed in the horizontal dimension. As a consequence, the image of a circle could be perceived as the image of an ellipse when it is viewed from a big angle. It is interesting to note that even if we did not explicitly model such phenomena, the factor A(φ0, θ0) that we estimated in Section 6.2.2 may have accounted for them implicitly to some extent. It is very important that despite all these simplifying assumptions that we made, our results led us to conclusions that agreed with our expectations. For example, the visibility region depicted in Figure 9 has the expected ellipsoidal form, while the visibility index demonstrated the behavior we described in Section 6.1.3. So, more strict assumptions, followed by more detailed models, could improve the accuracy of our current results, but we expect the general conclusions to remain the same.\n\nThe visibility algorithm forms the core of our work and we would like to examine whether it can be used to assess the visibility of images other than hybrid keypads. The visibility algorithm uses the MSSIM index which quantifies the distor- tion between two images. If we are given a random image Ir and a viewing position N , we could apply the same rationale by considering I DAF r as the distorted version of Ir. However, we do not expect the visibility index threshold value that we specified in Section 6.2.3 to be applicable to random images. The reason is that the level of distortion does not uniquely correspond to how visible particular visual details are in the distorted image. To verify this, we extended the data collection process that we presented in Section 6.2.1 to a different kind of hybrid keypads that we call white keypads. An example button from such a keypad is depicted in Figure 10. As we can see, the shoulder-surfer's keypad of a white keypad is composed of all white buttons. In the small dataset that we collected, the visibility index values were consistent for a particular user, but they were considerably lower than the corresponding values that the same user reported in the original dataset. This means that even if a person perceives the digits on a hybrid keypad to be equally visible to the digits on a white keypad, the distortion in the white keypad is bigger and the visibility index has a lower value. This is something logical, because when the reference buttons are all white, a digit that is even slightly visible is considered a big distortion. Based on that, we conclude that the visibility index threshold value is not universal. We would also like to remind that the values of the DAF filter parameters depend on the task at hand. As a result, we may have to repeat the estimation process for a considerably different task. We conclude that the visibility algorithm could be used to assess the visibility of general images, but its parameters have to be appropriately tuned for the particular task at hand.\n\nFigure 1 :\n1The image formation process on the retina according to the model of the pinhole camera. Gr is the projection of image G on the retina when is viewed from position N . Spatial positions are specified according to the coordinate system that is placed at the center of G.\n\nFigure 2 :\n2The Contrast Sensitive Function model as proposed by Mannos et al.\n\nFigure 3 :\n3(a) An example of how the actual spectrum of an image looks like. (b) The corresponding perceived spectrums when the same image is directly viewed from 3 different viewing distances.\n\nFigure 4 :\n4(a) An example of how the perceived spectrums of two square images I h u and I l s look like when they are directly viewed from a small distance. I h u is the result of high-pass filtering and I l s of low-pass filtering. (b) The perceived spectrums of the same images when they are viewed from a bigger distance.\n\nFigure 5 :\n5(a) A hybrid keypad (b) The simulated perception of the same hybrid keypad when it is directly viewed from distance which is 2 times bigger.\n\nFigure 6 :\n6We consider an example hybrid keypad I = I l s + I h u . In the first row, the third button of I l,DAF s\n\nFigure 7 :\n7(a) The third button from a hybrid keypad. We simulate the perception of this button from position (63, π /2, 0) by using DAF filters with different | f1| values. (b) The filtered button with | f1| = 25 c /d. (c) The filtered button with | f1| = 31 c /d. (d) The filtered button with | f1| = 42 c /d.\n\nFigure 8 :\n8The box and whisker plot with median notch after applying the Kruskal-Wallis test in our whole dataset with the participants as the factor of variation.\n\nFigure 9 :\n9The visibility region of a hybrid keypad I created with σ lf y = 35 c /im and σ hf y = 320 c /im for the iphone 6 smartphone.\n\nFigure 10 :\n10A button from a different kind of hybrid keypad. The shoulder-surfer's keypad is composed of uniformly white buttons.\n\n\nAlgorithm 1 Visibility Algorithm Require: hybrid keypad I, shoulder-surfer's keypad Is, DAF filter, viewing position N , visibility index threshold value v th 1: Isp ← calculate 2D perceived spectrum of I given N 2: Is,sp ← calculate 2D perceived spectrum of Is given N Buttons(I DAF ) ← segment the buttons of I DAF 8: Buttons(I DAF s ) ← segment the buttons of I DAF s 9: v ← mean(MSSIM(Buttons(I DAF ), Buttons(I DAF3: I DAF \n\nsp \n\n← apply DAF filter to Isp \n4: I DAF \ns,sp ← apply DAF filter to Is,sp \n5: I DAF ← transform I DAF \n\nsp \n\nto spatial domain \n6: I DAF \n\ns \n\n← transform I DAF \ns,sp to spatial domain \n7: s \n\n\n\nTable 1 :\n1The standard deviation of the visibility in-\ndex for three participants p1, p2 and p3, when dif-\nferent forms of the function A(φ0, θ0) are used. The \nminimum standard deviation value for each partici-\npant is highlighted. \nA = 1 ka = 2.5 ka = 3 ka = 3.5 ka = 4 \np1 0.0496 \n0.0181 \n0.0138 \n0.0159 \n0.0212 \np2 0.0546 \n0.0167 \n0.0112 \n0.0141 \n0.0223 \np3 0.0560 \n0.0224 \n0.0178 \n0.0183 \n0.0240 \n\n\n\nTable 2 :\n2The coefficient of variation for the visibility index values of each participant in our dataset. \np1 \np2 \np3 \np4 \np5 \np6 \np7 \np8 \np9 \np10 \np11 \ncv (%) 1.85 1.51 1.48 1.92 2.01 5.41 2.66 2.06 2.54 2.51 3.86 \n\n\nThe diagrams in figure 3 do not originate from an existing image. The reason is that we wanted to make the demonstrations simpler (smoother curves) in order to be more understandable.\nAcknowledgmentThe authors would like to thank all the participants of the conducted user studies for their cooperation and contribution. Also, they would like to thank Assoc. Prof. George Papadopoulos (Agricultural Univ. of Athens, Department of Crop Science, Laboratory of Biometry) for his contribution in the design and implementation of the statistical analysis presented in sections 6.2.3 and 8.\nWhy cryptosystems fail. R Anderson, Proceedings of the 1st ACM Conference on Computer and Communications Security. the 1st ACM Conference on Computer and Communications SecurityACMR. Anderson. Why cryptosystems fail. In Proceedings of the 1st ACM Conference on Computer and Communications Security, pages 215-227. ACM, 1993.\n\nSmudge attacks on smartphone touch screens. A J Aviv, K Gibson, E Mossop, M Blaze, J M Smith, WOOT. 10A. J. Aviv, K. Gibson, E. Mossop, M. Blaze, and J. M. Smith. Smudge attacks on smartphone touch screens. WOOT, 10:1-7, 2010.\n\nThe phone lock: audio and haptic shoulder-surfing resistant pin entry methods for mobile devices. A Bianchi, I Oakley, V Kostakos, D S Kwon, Proceedings of the fifth international conference on Tangible, embedded, and embodied interaction. the fifth international conference on Tangible, embedded, and embodied interactionACMA. Bianchi, I. Oakley, V. Kostakos, and D. S. Kwon. The phone lock: audio and haptic shoulder-surfing resistant pin entry methods for mobile devices. In Proceedings of the fifth international conference on Tangible, embedded, and embodied interaction, pages 197-200. ACM, 2011.\n\nThe quest to replace passwords: A framework for comparative evaluation of web authentication schemes. J Bonneau, C Herley, P C Van Oorschot, F Stajano, Security and Privacy (SP), 2012 IEEE Symposium on. IEEEJ. Bonneau, C. Herley, P. C. Van Oorschot, and F. Stajano. The quest to replace passwords: A framework for comparative evaluation of web authentication schemes. In Security and Privacy (SP), 2012 IEEE Symposium on, pages 553-567. IEEE, 2012.\n\nA birthday present every eleven wallets? the security of customer-chosen banking pins. J Bonneau, S Preibusch, R Anderson, Financial Cryptography and Data Security. Berlin HeidelbergSpringer7397J. Bonneau, S. Preibusch, and R. Anderson. A birthday present every eleven wallets? the security of customer-chosen banking pins. In Financial Cryptography and Data Security, volume 7397, pages 25-40. Springer Berlin Heidelberg, 2012.\n\nOn top of tabletop: A virtual touch panel display. L.-W Chan, T.-T Hu, J.-Y Lin, Y.-P Hung, J Hsu, Horizontal Interactive Human Computer Systems. IEEE3rd IEEE International Workshop onL.-W. Chan, T.-T. Hu, J.-Y. Lin, Y.-P. Hung, and J. Hsu. On top of tabletop: A virtual touch panel display. In Horizontal Interactive Human Computer Systems, 2008. TABLETOP 2008. 3rd IEEE International Workshop on, pages 169-176. IEEE, 2008.\n\nI think, therefore i am: Usability and security of authentication using brainwaves. J Chuang, H Nguyen, C Wang, B Johnson, Financial Cryptography and Data Security. SpringerJ. Chuang, H. Nguyen, C. Wang, and B. Johnson. I think, therefore i am: Usability and security of authentication using brainwaves. In Financial Cryptography and Data Security, pages 1-16. Springer, 2013.\n\nColorpin: securing pin entry through indirect input. A De Luca, K Hertzschuch, H Hussmann, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. the SIGCHI Conference on Human Factors in Computing SystemsACMA. De Luca, K. Hertzschuch, and H. Hussmann. Colorpin: securing pin entry through indirect input. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, pages 1103-1106. ACM, 2010.\n\nDeja vu-a user study: Using images for authentication. R Dhamija, A Perrig, USENIX Security Symposium. 9R. Dhamija and A. Perrig. Deja vu-a user study: Using images for authentication. In USENIX Security Symposium, volume 9, pages 4-4, 2000.\n\nThe anatomy of smartphone unlocking. M Harbach, A De Luca, S Egelman, Proceedings of the 34th Annual ACM Conference on Human Factors in Computing Systems, CHI. the 34th Annual ACM Conference on Human Factors in Computing Systems, CHIM. Harbach, A. De Luca, and S. Egelman. The anatomy of smartphone unlocking. In Proceedings of the 34th Annual ACM Conference on Human Factors in Computing Systems, CHI, 2016.\n\nA new angle on cheap lcds: making positive use of optical distortion. C Harrison, S E Hudson, Proceedings of the 24th annual ACM symposium on User interface software and technology. the 24th annual ACM symposium on User interface software and technologyACMC. Harrison and S. E. Hudson. A new angle on cheap lcds: making positive use of optical distortion. In Proceedings of the 24th annual ACM symposium on User interface software and technology, pages 537-540. ACM, 2011.\n\nUse your illusion: secure authentication usable anywhere. E Hayashi, R Dhamija, N Christin, A Perrig, Proceedings of the 4th symposium on Usable privacy and security. the 4th symposium on Usable privacy and securityACME. Hayashi, R. Dhamija, N. Christin, and A. Perrig. Use your illusion: secure authentication usable anywhere. In Proceedings of the 4th symposium on Usable privacy and security, pages 35-45. ACM, 2008.\n\nThe design and analysis of graphical passwords. I Jermyn, A J Mayer, F Monrose, M K Reiter, A D Rubin, Usenix Security. I. Jermyn, A. J. Mayer, F. Monrose, M. K. Reiter, A. D. Rubin, et al. The design and analysis of graphical passwords. In Usenix Security, 1999.\n\nMulti-touch authentication on tabletops. D Kim, P Dunphy, P Briggs, J Hook, J W Nicholson, J Nicholson, P Olivier, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. the SIGCHI Conference on Human Factors in Computing SystemsACMD. Kim, P. Dunphy, P. Briggs, J. Hook, J. W. Nicholson, J. Nicholson, and P. Olivier. Multi-touch authentication on tabletops. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, pages 1093-1102. ACM, 2010.\n\nEnabling concurrent dual views on common lcd screens. S Kim, X Cao, H Zhang, D Tan, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. the SIGCHI Conference on Human Factors in Computing SystemsACMS. Kim, X. Cao, H. Zhang, and D. Tan. Enabling concurrent dual views on common lcd screens. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, pages 2175-2184. ACM, 2012.\n\nReducing shoulder-surfing by using gaze-based password entry. M Kumar, T Garfinkel, D Boneh, T Winograd, Proceedings of the 3rd symposium on Usable privacy and security. the 3rd symposium on Usable privacy and securityACMM. Kumar, T. Garfinkel, D. Boneh, and T. Winograd. Reducing shoulder-surfing by using gaze-based password entry. In Proceedings of the 3rd symposium on Usable privacy and security, pages 13-19. ACM, 2007.\n\nAn association-based graphical password design resistant to shoulder-surfing attack. Z Li, Q Sun, Y Lian, D D Giusto, Multimedia and Expo, 2005. ICME 2005. IEEE International Conference on. IEEEZ. Li, Q. Sun, Y. Lian, and D. D. Giusto. An association-based graphical password design resistant to shoulder-surfing attack. In Multimedia and Expo, 2005. ICME 2005. IEEE International Conference on, pages 245-248. IEEE, 2005.\n\nWhy is it easier to identify someone close than far away?. G R Loftus, E M Harley, Psychonomic Bulletin & Review. 121G. R. Loftus and E. M. Harley. Why is it easier to identify someone close than far away? Psychonomic Bulletin & Review, 12(1):43-65, 2005.\n\nNovel shoulder-surfing resistant haptic-based graphical password. B Malek, M Orozco, A El Saddik, Proc. EuroHaptics. EuroHaptics6B. Malek, M. Orozco, and A. El Saddik. Novel shoulder-surfing resistant haptic-based graphical password. In Proc. EuroHaptics, volume 6, 2006.\n\nThe effects of a visual fidelity criterion of the encoding of images. J Mannos, D Sakrison, IEEE Transactions on information theory. 204J. Mannos and D. Sakrison. The effects of a visual fidelity criterion of the encoding of images. IEEE Transactions on information theory, 20(4):525-536, 1974.\n\nMultiview user interfaces with an automultiscopic display. W Matusik, C Forlines, H Pfister, Proceedings of the working conference on Advanced visual interfaces. the working conference on Advanced visual interfacesACMW. Matusik, C. Forlines, and H. Pfister. Multiview user interfaces with an automultiscopic display. In Proceedings of the working conference on Advanced visual interfaces, pages 363-366. ACM, 2008.\n\nFinger-drawn pin authentication on touch devices. T Nguyen, N Sae-Bae, N Memon, Image Processing (ICIP), 2014 IEEE International Conference on. IEEET. Nguyen, N. Sae-Bae, and N. Memon. Finger-drawn pin authentication on touch devices. In Image Processing (ICIP), 2014 IEEE International Conference on, pages 5002-5006. IEEE, 2014.\n\nDraw-a-pin. T V Nguyen, N Sae-Bae, N Memon, Computers and Security. 66CT. V. Nguyen, N. Sae-Bae, and N. Memon. Draw-a-pin. Computers and Security, 66(C):115-128, 2017.\n\nThe art of hybrid images: two for the view of one. A Oliva, Art & Perception. 11-2A. Oliva. The art of hybrid images: two for the view of one. Art & Perception, 1(1-2):65-74, 2013.\n\nHybrid images. A Oliva, A Torralba, P G Schyns, ACM Transactions on Graphics (TOG). 253A. Oliva, A. Torralba, and P. G. Schyns. Hybrid images. ACM Transactions on Graphics (TOG), 25(3):527-532, 2006.\n\nIllusionpin: Shoulder-surfing resistant authentication using hybrid images. A Papadopoulos, T Nguyen, E Durmus, N Memon, IEEE Transactions on Information Forensics and Security. A. Papadopoulos, T. Nguyen, E. Durmus, and N. Memon. Illusionpin: Shoulder-surfing resistant authentication using hybrid images. IEEE Transactions on Information Forensics and Security, 2017.\n\nCancelable biometrics: A review. V M Patel, N K Ratha, R Chellappa, IEEE Signal Processing Magazine. 325V. M. Patel, N. K. Ratha, and R. Chellappa. Cancelable biometrics: A review. IEEE Signal Processing Magazine, 32(5):54-65, 2015.\n\nPhotographic authentication through untrusted terminals. T Pering, M Sundar, J Light, R Want, IEEE Pervasive Computing. 21T. Pering, M. Sundar, J. Light, and R. Want. Photographic authentication through untrusted terminals. IEEE Pervasive Computing, 2(1):30-36, 2003.\n\nShoulder-surfing safe login in a partially observable attacker model. T Perković, M Čagalj, N Saxena, Financial Cryptography and Data Security. SpringerT. Perković, M.Čagalj, and N. Saxena. Shoulder-surfing safe login in a partially observable attacker model. In Financial Cryptography and Data Security, pages 351-358. Springer, 2010.\n\nEnhancing security and privacy in biometrics-based authentication systems. N K Ratha, J H Connell, R M Bolle, IBM systems Journal. 403N. K. Ratha, J. H. Connell, and R. M. Bolle. Enhancing security and privacy in biometrics-based authentication systems. IBM systems Journal, 40(3):614-634, 2001.\n\nA pin-entry method resilient against shoulder surfing. V Roth, K Richter, R Freidinger, Proceedings of the 11th ACM conference on Computer and communications security. the 11th ACM conference on Computer and communications securityACMV. Roth, K. Richter, and R. Freidinger. A pin-entry method resilient against shoulder surfing. In Proceedings of the 11th ACM conference on Computer and communications security, pages 236-245. ACM, 2004.\n\nBiometric-rich gestures: a novel approach to authentication on multi-touch devices. N Sae-Bae, K Ahmed, K Isbister, N Memon, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. the SIGCHI Conference on Human Factors in Computing SystemsACMN. Sae-Bae, K. Ahmed, K. Isbister, and N. Memon. Biometric-rich gestures: a novel approach to authentication on multi-touch devices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, pages 977-986. ACM, 2012.\n\nOnline signature verification on mobile devices. N Sae-Bae, N Memon, IEEE Transactions on Information Forensics and Security. 96N. Sae-Bae and N. Memon. Online signature verification on mobile devices. IEEE Transactions on Information Forensics and Security, 9(6):933-947, 2014.\n\nMultitouch gesture-based authentication. N Sae-Bae, N Memon, K Isbister, K Ahmed, IEEE transactions on information forensics and security. 94N. Sae-Bae, N. Memon, K. Isbister, and K. Ahmed. Multitouch gesture-based authentication. IEEE transactions on information forensics and security, 9(4):568-582, 2014.\n\nUndercover: authentication usable in front of prying eyes. H Sasamoto, N Christin, E Hayashi, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. the SIGCHI Conference on Human Factors in Computing SystemsACMH. Sasamoto, N. Christin, and E. Hayashi. Undercover: authentication usable in front of prying eyes. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, pages 183-192. ACM, 2008.\n\nSkullconduct: Biometric user identification on eyewear computers using bone conduction through the skull. S Schneegass, Y Oualil, A Bulling, Proc. of CHI 2016. of CHI 2016S. Schneegass, Y. Oualil, and A. Bulling. Skullconduct: Biometric user identification on eyewear computers using bone conduction through the skull. Proc. of CHI 2016, 2016.\n\nA pin entry scheme resistant to recording-based shoulder-surfing. P Shi, B Zhu, A Youssef, Emerging Security Information, Systems and Technologies, 2009. SECURWARE'09. Third International Conference on. IEEEP. Shi, B. Zhu, and A. Youssef. A pin entry scheme resistant to recording-based shoulder-surfing. In Emerging Security Information, Systems and Technologies, 2009. SECURWARE'09. Third International Conference on, pages 237-241. IEEE, 2009.\n\nSpy-resistant keyboard: Towards more secure password entry on publicly observable touch screens. D S Tan, P Keyani, M Czerwinski, Proceedings of OZCHI-Computer-Human Interaction Special Interest Group. OZCHI-Computer-Human Interaction Special Interest GroupCHISIGD. S. Tan, P. Keyani, and M. Czerwinski. Spy-resistant keyboard: Towards more secure password entry on publicly observable touch screens. In Proceedings of OZCHI-Computer-Human Interaction Special Interest Group (CHISIG) of\n\n. Australia, Canberra, ACM PressAustraliaAustralia. Canberra, Australia: ACM Press, 2005.\n\nImage quality assessment: from error visibility to structural similarity. Z Wang, A C Bovik, H R Sheikh, E P Simoncelli, IEEE transactions on image processing. 134Z. Wang, A. C. Bovik, H. R. Sheikh, and E. P. Simoncelli. Image quality assessment: from error visibility to structural similarity. IEEE transactions on image processing, 13(4):600-612, 2004.\n\nDesign and evaluation of a shoulder-surfing resistant graphical password scheme. S Wiedenbeck, J Waters, L Sobrado, J.-C Birget, Proceedings of the working conference on Advanced visual interfaces. the working conference on Advanced visual interfacesACMS. Wiedenbeck, J. Waters, L. Sobrado, and J.-C. Birget. Design and evaluation of a shoulder-surfing resistant graphical password scheme. In Proceedings of the working conference on Advanced visual interfaces, pages 177-184. ACM, 2006.\n\nDesign and analysis of shoulder surfing resistant pin based authentication mechanisms on google glass. D K Yadav, B Ionascu, S V K Ongole, A Roy, N Memon, International Conference on Financial Cryptography and Data Security. Berlin HeidelbergSpringerD. K. Yadav, B. Ionascu, S. V. K. Ongole, A. Roy, and N. Memon. Design and analysis of shoulder surfing resistant pin based authentication mechanisms on google glass. In International Conference on Financial Cryptography and Data Security, pages 281-297. Springer Berlin Heidelberg, 2015.\n\nShoulder surfing defence for recall-based graphical passwords. N H Zakaria, D Griffiths, S Brostoff, J Yan, Proceedings of the Seventh Symposium on Usable Privacy and Security. the Seventh Symposium on Usable Privacy and SecurityACMN. H. Zakaria, D. Griffiths, S. Brostoff, and J. Yan. Shoulder surfing defence for recall-based graphical passwords. In Proceedings of the Seventh Symposium on Usable Privacy and Security, page 6. ACM, 2011.\n", "annotations": {"author": "[{\"end\":218,\"start\":78},{\"end\":353,\"start\":219},{\"end\":486,\"start\":354}]", "publisher": null, "author_last_name": "[{\"end\":89,\"start\":83},{\"end\":230,\"start\":224},{\"end\":365,\"start\":360}]", "author_first_name": "[{\"end\":82,\"start\":78},{\"end\":223,\"start\":219},{\"end\":359,\"start\":354}]", "author_affiliation": "[{\"end\":217,\"start\":113},{\"end\":352,\"start\":248},{\"end\":485,\"start\":381}]", "title": "[{\"end\":75,\"start\":1},{\"end\":561,\"start\":487}]", "venue": null, "abstract": "[{\"end\":1838,\"start\":563}]", "bib_ref": "[{\"attributes\":{\"ref_id\":\"b3\"},\"end\":1906,\"start\":1903},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":2415,\"start\":2411},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":2740,\"start\":2737},{\"attributes\":{\"ref_id\":\"b0\"},\"end\":2950,\"start\":2947},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":3974,\"start\":3971},{\"end\":4862,\"start\":4859},{\"attributes\":{\"ref_id\":\"b24\"},\"end\":4992,\"start\":4988},{\"attributes\":{\"ref_id\":\"b13\"},\"end\":6291,\"start\":6287},{\"attributes\":{\"ref_id\":\"b5\"},\"end\":6823,\"start\":6820},{\"attributes\":{\"ref_id\":\"b20\"},\"end\":6826,\"start\":6823},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":6957,\"start\":6953},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":6960,\"start\":6957},{\"attributes\":{\"ref_id\":\"b11\"},\"end\":7521,\"start\":7517},{\"attributes\":{\"ref_id\":\"b12\"},\"end\":7544,\"start\":7540},{\"attributes\":{\"ref_id\":\"b42\"},\"end\":7693,\"start\":7689},{\"attributes\":{\"ref_id\":\"b37\"},\"end\":8295,\"start\":8291},{\"attributes\":{\"ref_id\":\"b30\"},\"end\":8353,\"start\":8349},{\"attributes\":{\"ref_id\":\"b27\"},\"end\":9380,\"start\":9376},{\"attributes\":{\"ref_id\":\"b41\"},\"end\":9383,\"start\":9380},{\"attributes\":{\"ref_id\":\"b8\"},\"end\":9409,\"start\":9406},{\"attributes\":{\"ref_id\":\"b16\"},\"end\":10255,\"start\":10251},{\"attributes\":{\"ref_id\":\"b40\"},\"end\":10258,\"start\":10255},{\"attributes\":{\"ref_id\":\"b28\"},\"end\":10261,\"start\":10258},{\"attributes\":{\"ref_id\":\"b7\"},\"end\":10263,\"start\":10261},{\"attributes\":{\"ref_id\":\"b30\"},\"end\":10266,\"start\":10263},{\"attributes\":{\"ref_id\":\"b36\"},\"end\":10269,\"start\":10266},{\"attributes\":{\"ref_id\":\"b13\"},\"end\":10296,\"start\":10292},{\"attributes\":{\"ref_id\":\"b2\"},\"end\":11815,\"start\":11812},{\"attributes\":{\"ref_id\":\"b34\"},\"end\":11818,\"start\":11815},{\"attributes\":{\"ref_id\":\"b18\"},\"end\":12078,\"start\":12074},{\"attributes\":{\"ref_id\":\"b31\"},\"end\":12081,\"start\":12078},{\"attributes\":{\"ref_id\":\"b21\"},\"end\":12084,\"start\":12081},{\"attributes\":{\"ref_id\":\"b33\"},\"end\":12087,\"start\":12084},{\"attributes\":{\"ref_id\":\"b32\"},\"end\":12090,\"start\":12087},{\"attributes\":{\"ref_id\":\"b22\"},\"end\":12093,\"start\":12090},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":12173,\"start\":12169},{\"attributes\":{\"ref_id\":\"b6\"},\"end\":12257,\"start\":12254},{\"attributes\":{\"ref_id\":\"b35\"},\"end\":12281,\"start\":12277},{\"attributes\":{\"ref_id\":\"b29\"},\"end\":12341,\"start\":12337},{\"attributes\":{\"ref_id\":\"b26\"},\"end\":12649,\"start\":12645},{\"attributes\":{\"ref_id\":\"b19\"},\"end\":19772,\"start\":19768},{\"attributes\":{\"ref_id\":\"b19\"},\"end\":21209,\"start\":21205},{\"attributes\":{\"ref_id\":\"b24\"},\"end\":25687,\"start\":25683},{\"attributes\":{\"ref_id\":\"b23\"},\"end\":25690,\"start\":25687},{\"attributes\":{\"ref_id\":\"b17\"},\"end\":34484,\"start\":34480},{\"attributes\":{\"ref_id\":\"b17\"},\"end\":34830,\"start\":34826},{\"attributes\":{\"ref_id\":\"b17\"},\"end\":35963,\"start\":35959},{\"attributes\":{\"ref_id\":\"b39\"},\"end\":37701,\"start\":37697},{\"attributes\":{\"ref_id\":\"b17\"},\"end\":48052,\"start\":48048},{\"attributes\":{\"ref_id\":\"b17\"},\"end\":49349,\"start\":49345}]", "figure": "[{\"attributes\":{\"id\":\"fig_0\"},\"end\":73191,\"start\":72910},{\"attributes\":{\"id\":\"fig_1\"},\"end\":73271,\"start\":73192},{\"attributes\":{\"id\":\"fig_2\"},\"end\":73467,\"start\":73272},{\"attributes\":{\"id\":\"fig_3\"},\"end\":73794,\"start\":73468},{\"attributes\":{\"id\":\"fig_5\"},\"end\":73948,\"start\":73795},{\"attributes\":{\"id\":\"fig_6\"},\"end\":74066,\"start\":73949},{\"attributes\":{\"id\":\"fig_7\"},\"end\":74380,\"start\":74067},{\"attributes\":{\"id\":\"fig_8\"},\"end\":74546,\"start\":74381},{\"attributes\":{\"id\":\"fig_9\"},\"end\":74685,\"start\":74547},{\"attributes\":{\"id\":\"fig_10\"},\"end\":74818,\"start\":74686},{\"attributes\":{\"id\":\"tab_0\",\"type\":\"table\"},\"end\":75445,\"start\":74819},{\"attributes\":{\"id\":\"tab_1\",\"type\":\"table\"},\"end\":75851,\"start\":75446},{\"attributes\":{\"id\":\"tab_2\",\"type\":\"table\"},\"end\":76072,\"start\":75852}]", "paragraph": "[{\"end\":2627,\"start\":1854},{\"end\":2951,\"start\":2629},{\"end\":3706,\"start\":2953},{\"end\":4526,\"start\":3708},{\"end\":4808,\"start\":4528},{\"end\":5242,\"start\":4810},{\"end\":5421,\"start\":5244},{\"end\":5735,\"start\":5423},{\"end\":6060,\"start\":5737},{\"end\":7402,\"start\":6077},{\"end\":8176,\"start\":7404},{\"end\":9272,\"start\":8178},{\"end\":10134,\"start\":9274},{\"end\":11347,\"start\":10136},{\"end\":12680,\"start\":11349},{\"end\":14266,\"start\":12697},{\"end\":14814,\"start\":14268},{\"end\":15200,\"start\":14862},{\"end\":16617,\"start\":15237},{\"end\":17810,\"start\":16619},{\"end\":18050,\"start\":17812},{\"end\":18840,\"start\":18052},{\"end\":19055,\"start\":19023},{\"end\":19159,\"start\":19095},{\"end\":19294,\"start\":19256},{\"end\":19441,\"start\":19391},{\"end\":19675,\"start\":19443},{\"end\":19773,\"start\":19754},{\"end\":20748,\"start\":19844},{\"end\":21749,\"start\":20782},{\"end\":22960,\"start\":21799},{\"end\":24739,\"start\":22962},{\"end\":25722,\"start\":24773},{\"end\":27553,\"start\":25724},{\"end\":28360,\"start\":27568},{\"end\":28909,\"start\":28453},{\"end\":29570,\"start\":28911},{\"end\":31846,\"start\":29581},{\"end\":32088,\"start\":31848},{\"end\":32552,\"start\":32103},{\"end\":33736,\"start\":32554},{\"end\":33783,\"start\":33761},{\"end\":33795,\"start\":33785},{\"end\":34260,\"start\":33797},{\"end\":35911,\"start\":34298},{\"end\":36376,\"start\":35913},{\"end\":36506,\"start\":36378},{\"end\":37060,\"start\":36628},{\"end\":37811,\"start\":37081},{\"end\":39484,\"start\":37813},{\"end\":39786,\"start\":39486},{\"end\":41745,\"start\":39830},{\"end\":42480,\"start\":41747},{\"end\":42652,\"start\":42501},{\"end\":43085,\"start\":42672},{\"end\":43906,\"start\":43087},{\"end\":44433,\"start\":43908},{\"end\":45809,\"start\":44435},{\"end\":46467,\"start\":45811},{\"end\":47066,\"start\":46469},{\"end\":47588,\"start\":47068},{\"end\":49119,\"start\":47632},{\"end\":50524,\"start\":49121},{\"end\":50683,\"start\":50526},{\"end\":51995,\"start\":50738},{\"end\":52801,\"start\":52058},{\"end\":54082,\"start\":52803},{\"end\":55504,\"start\":54084},{\"end\":56266,\"start\":55562},{\"end\":59168,\"start\":56268},{\"end\":59716,\"start\":59219},{\"end\":60274,\"start\":59718},{\"end\":60418,\"start\":60370},{\"end\":60980,\"start\":60480},{\"end\":61642,\"start\":61026},{\"end\":62152,\"start\":61690},{\"end\":63211,\"start\":62154},{\"end\":63509,\"start\":63232},{\"end\":64519,\"start\":63511},{\"end\":64956,\"start\":64534},{\"end\":65244,\"start\":64958},{\"end\":66040,\"start\":65259},{\"end\":66856,\"start\":66042},{\"end\":67562,\"start\":66858},{\"end\":67878,\"start\":67564},{\"end\":68745,\"start\":67880},{\"end\":70850,\"start\":68785},{\"end\":72909,\"start\":70852}]", "formula": "[{\"attributes\":{\"id\":\"formula_0\"},\"end\":19022,\"start\":18841},{\"attributes\":{\"id\":\"formula_1\"},\"end\":19094,\"start\":19056},{\"attributes\":{\"id\":\"formula_2\"},\"end\":19255,\"start\":19160},{\"attributes\":{\"id\":\"formula_3\"},\"end\":19390,\"start\":19295},{\"attributes\":{\"id\":\"formula_4\"},\"end\":19753,\"start\":19676},{\"attributes\":{\"id\":\"formula_5\"},\"end\":19843,\"start\":19774},{\"attributes\":{\"id\":\"formula_6\"},\"end\":28452,\"start\":28361},{\"attributes\":{\"id\":\"formula_7\"},\"end\":36627,\"start\":36507},{\"attributes\":{\"id\":\"formula_8\"},\"end\":50737,\"start\":50684},{\"attributes\":{\"id\":\"formula_9\"},\"end\":60369,\"start\":60275},{\"attributes\":{\"id\":\"formula_10\"},\"end\":60479,\"start\":60419},{\"attributes\":{\"id\":\"formula_11\"},\"end\":61025,\"start\":60981},{\"attributes\":{\"id\":\"formula_12\"},\"end\":61689,\"start\":61643},{\"attributes\":{\"id\":\"formula_13\"},\"end\":63231,\"start\":63212}]", "table_ref": "[{\"attributes\":{\"ref_id\":\"tab_1\"},\"end\":51458,\"start\":51451},{\"attributes\":{\"ref_id\":\"tab_2\"},\"end\":52628,\"start\":52621}]", "section_header": "[{\"attributes\":{\"n\":\"1.\"},\"end\":1852,\"start\":1840},{\"attributes\":{\"n\":\"2.\"},\"end\":6075,\"start\":6063},{\"attributes\":{\"n\":\"3.\"},\"end\":12695,\"start\":12683},{\"attributes\":{\"n\":\"4.\"},\"end\":14860,\"start\":14817},{\"attributes\":{\"n\":\"4.1\"},\"end\":15235,\"start\":15203},{\"attributes\":{\"n\":\"4.2\"},\"end\":20780,\"start\":20751},{\"attributes\":{\"n\":\"4.3\"},\"end\":21797,\"start\":21752},{\"attributes\":{\"n\":\"5.\"},\"end\":24771,\"start\":24742},{\"attributes\":{\"n\":\"5.2\"},\"end\":27566,\"start\":27556},{\"attributes\":{\"n\":\"5.3\"},\"end\":29579,\"start\":29573},{\"attributes\":{\"n\":\"5.4\"},\"end\":32101,\"start\":32091},{\"attributes\":{\"n\":\"6.\"},\"end\":33759,\"start\":33739},{\"attributes\":{\"n\":\"6.1\"},\"end\":34272,\"start\":34263},{\"attributes\":{\"n\":\"6.1.1\"},\"end\":34296,\"start\":34275},{\"attributes\":{\"n\":\"6.1.2\"},\"end\":37079,\"start\":37063},{\"attributes\":{\"n\":\"6.1.3\"},\"end\":39828,\"start\":39789},{\"attributes\":{\"n\":\"6.2\"},\"end\":42499,\"start\":42483},{\"attributes\":{\"n\":\"6.2.1\"},\"end\":42670,\"start\":42655},{\"attributes\":{\"n\":\"6.2.2\"},\"end\":47630,\"start\":47591},{\"attributes\":{\"n\":\"6.2.3\"},\"end\":52056,\"start\":51998},{\"attributes\":{\"n\":\"7.\"},\"end\":55560,\"start\":55507},{\"attributes\":{\"n\":\"7.2\"},\"end\":59217,\"start\":59171},{\"attributes\":{\"n\":\"8.\"},\"end\":64532,\"start\":64522},{\"end\":65257,\"start\":65247},{\"attributes\":{\"n\":\"9.\"},\"end\":68783,\"start\":68748},{\"end\":72921,\"start\":72911},{\"end\":73203,\"start\":73193},{\"end\":73283,\"start\":73273},{\"end\":73479,\"start\":73469},{\"end\":73806,\"start\":73796},{\"end\":73960,\"start\":73950},{\"end\":74078,\"start\":74068},{\"end\":74392,\"start\":74382},{\"end\":74558,\"start\":74548},{\"end\":74698,\"start\":74687},{\"end\":75456,\"start\":75447},{\"end\":75862,\"start\":75853}]", "table": "[{\"end\":75445,\"start\":75240},{\"end\":75851,\"start\":75458},{\"end\":76072,\"start\":75864}]", "figure_caption": "[{\"end\":73191,\"start\":72923},{\"end\":73271,\"start\":73205},{\"end\":73467,\"start\":73285},{\"end\":73794,\"start\":73481},{\"end\":73948,\"start\":73808},{\"end\":74066,\"start\":73962},{\"end\":74380,\"start\":74080},{\"end\":74546,\"start\":74394},{\"end\":74685,\"start\":74560},{\"end\":74818,\"start\":74701},{\"end\":75240,\"start\":74821}]", "figure_ref": "[{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":15370,\"start\":15362},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":18130,\"start\":18122},{\"attributes\":{\"ref_id\":\"fig_1\"},\"end\":21148,\"start\":21140},{\"attributes\":{\"ref_id\":\"fig_3\"},\"end\":26831,\"start\":26823},{\"attributes\":{\"ref_id\":\"fig_5\"},\"end\":27284,\"start\":27275},{\"attributes\":{\"ref_id\":\"fig_5\"},\"end\":33108,\"start\":33100},{\"attributes\":{\"ref_id\":\"fig_6\"},\"end\":38478,\"start\":38470},{\"attributes\":{\"ref_id\":\"fig_7\"},\"end\":49783,\"start\":49775},{\"attributes\":{\"ref_id\":\"fig_7\"},\"end\":50105,\"start\":50097},{\"attributes\":{\"ref_id\":\"fig_7\"},\"end\":50296,\"start\":50288},{\"attributes\":{\"ref_id\":\"fig_8\"},\"end\":54557,\"start\":54549},{\"attributes\":{\"ref_id\":\"fig_9\"},\"end\":56782,\"start\":56774},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":57077,\"start\":57069},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":62350,\"start\":62342},{\"attributes\":{\"ref_id\":\"fig_9\"},\"end\":70559,\"start\":70551},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":71760,\"start\":71751}]", "bib_author_first_name": "[{\"end\":76683,\"start\":76682},{\"end\":77029,\"start\":77028},{\"end\":77031,\"start\":77030},{\"end\":77039,\"start\":77038},{\"end\":77049,\"start\":77048},{\"end\":77059,\"start\":77058},{\"end\":77068,\"start\":77067},{\"end\":77070,\"start\":77069},{\"end\":77311,\"start\":77310},{\"end\":77322,\"start\":77321},{\"end\":77332,\"start\":77331},{\"end\":77344,\"start\":77343},{\"end\":77346,\"start\":77345},{\"end\":77919,\"start\":77918},{\"end\":77930,\"start\":77929},{\"end\":77940,\"start\":77939},{\"end\":77942,\"start\":77941},{\"end\":77958,\"start\":77957},{\"end\":78354,\"start\":78353},{\"end\":78365,\"start\":78364},{\"end\":78378,\"start\":78377},{\"end\":78751,\"start\":78747},{\"end\":78762,\"start\":78758},{\"end\":78771,\"start\":78767},{\"end\":78781,\"start\":78777},{\"end\":78789,\"start\":78788},{\"end\":79208,\"start\":79207},{\"end\":79218,\"start\":79217},{\"end\":79228,\"start\":79227},{\"end\":79236,\"start\":79235},{\"end\":79555,\"start\":79554},{\"end\":79566,\"start\":79565},{\"end\":79581,\"start\":79580},{\"end\":79992,\"start\":79991},{\"end\":80003,\"start\":80002},{\"end\":80217,\"start\":80216},{\"end\":80228,\"start\":80227},{\"end\":80231,\"start\":80229},{\"end\":80239,\"start\":80238},{\"end\":80660,\"start\":80659},{\"end\":80672,\"start\":80671},{\"end\":80674,\"start\":80673},{\"end\":81122,\"start\":81121},{\"end\":81133,\"start\":81132},{\"end\":81144,\"start\":81143},{\"end\":81156,\"start\":81155},{\"end\":81533,\"start\":81532},{\"end\":81543,\"start\":81542},{\"end\":81545,\"start\":81544},{\"end\":81554,\"start\":81553},{\"end\":81565,\"start\":81564},{\"end\":81567,\"start\":81566},{\"end\":81577,\"start\":81576},{\"end\":81579,\"start\":81578},{\"end\":81791,\"start\":81790},{\"end\":81798,\"start\":81797},{\"end\":81808,\"start\":81807},{\"end\":81818,\"start\":81817},{\"end\":81826,\"start\":81825},{\"end\":81828,\"start\":81827},{\"end\":81841,\"start\":81840},{\"end\":81854,\"start\":81853},{\"end\":82292,\"start\":82291},{\"end\":82299,\"start\":82298},{\"end\":82306,\"start\":82305},{\"end\":82315,\"start\":82314},{\"end\":82722,\"start\":82721},{\"end\":82731,\"start\":82730},{\"end\":82744,\"start\":82743},{\"end\":82753,\"start\":82752},{\"end\":83172,\"start\":83171},{\"end\":83178,\"start\":83177},{\"end\":83185,\"start\":83184},{\"end\":83193,\"start\":83192},{\"end\":83195,\"start\":83194},{\"end\":83570,\"start\":83569},{\"end\":83572,\"start\":83571},{\"end\":83582,\"start\":83581},{\"end\":83584,\"start\":83583},{\"end\":83834,\"start\":83833},{\"end\":83843,\"start\":83842},{\"end\":83853,\"start\":83852},{\"end\":83856,\"start\":83854},{\"end\":84111,\"start\":84110},{\"end\":84121,\"start\":84120},{\"end\":84396,\"start\":84395},{\"end\":84407,\"start\":84406},{\"end\":84419,\"start\":84418},{\"end\":84803,\"start\":84802},{\"end\":84813,\"start\":84812},{\"end\":84824,\"start\":84823},{\"end\":85097,\"start\":85096},{\"end\":85099,\"start\":85098},{\"end\":85109,\"start\":85108},{\"end\":85120,\"start\":85119},{\"end\":85305,\"start\":85304},{\"end\":85451,\"start\":85450},{\"end\":85460,\"start\":85459},{\"end\":85472,\"start\":85471},{\"end\":85474,\"start\":85473},{\"end\":85713,\"start\":85712},{\"end\":85729,\"start\":85728},{\"end\":85739,\"start\":85738},{\"end\":85749,\"start\":85748},{\"end\":86041,\"start\":86040},{\"end\":86043,\"start\":86042},{\"end\":86052,\"start\":86051},{\"end\":86054,\"start\":86053},{\"end\":86063,\"start\":86062},{\"end\":86299,\"start\":86298},{\"end\":86309,\"start\":86308},{\"end\":86319,\"start\":86318},{\"end\":86328,\"start\":86327},{\"end\":86581,\"start\":86580},{\"end\":86593,\"start\":86592},{\"end\":86603,\"start\":86602},{\"end\":86923,\"start\":86922},{\"end\":86925,\"start\":86924},{\"end\":86934,\"start\":86933},{\"end\":86936,\"start\":86935},{\"end\":86947,\"start\":86946},{\"end\":86949,\"start\":86948},{\"end\":87200,\"start\":87199},{\"end\":87208,\"start\":87207},{\"end\":87219,\"start\":87218},{\"end\":87668,\"start\":87667},{\"end\":87679,\"start\":87678},{\"end\":87688,\"start\":87687},{\"end\":87700,\"start\":87699},{\"end\":88135,\"start\":88134},{\"end\":88146,\"start\":88145},{\"end\":88407,\"start\":88406},{\"end\":88418,\"start\":88417},{\"end\":88427,\"start\":88426},{\"end\":88439,\"start\":88438},{\"end\":88734,\"start\":88733},{\"end\":88746,\"start\":88745},{\"end\":88758,\"start\":88757},{\"end\":89220,\"start\":89219},{\"end\":89234,\"start\":89233},{\"end\":89244,\"start\":89243},{\"end\":89525,\"start\":89524},{\"end\":89532,\"start\":89531},{\"end\":89539,\"start\":89538},{\"end\":90004,\"start\":90003},{\"end\":90006,\"start\":90005},{\"end\":90013,\"start\":90012},{\"end\":90023,\"start\":90022},{\"end\":90560,\"start\":90559},{\"end\":90568,\"start\":90567},{\"end\":90570,\"start\":90569},{\"end\":90579,\"start\":90578},{\"end\":90581,\"start\":90580},{\"end\":90591,\"start\":90590},{\"end\":90593,\"start\":90592},{\"end\":90923,\"start\":90922},{\"end\":90937,\"start\":90936},{\"end\":90947,\"start\":90946},{\"end\":90961,\"start\":90957},{\"end\":91434,\"start\":91433},{\"end\":91436,\"start\":91435},{\"end\":91445,\"start\":91444},{\"end\":91456,\"start\":91455},{\"end\":91460,\"start\":91457},{\"end\":91470,\"start\":91469},{\"end\":91477,\"start\":91476},{\"end\":91934,\"start\":91933},{\"end\":91936,\"start\":91935},{\"end\":91947,\"start\":91946},{\"end\":91960,\"start\":91959},{\"end\":91972,\"start\":91971}]", "bib_author_last_name": "[{\"end\":76692,\"start\":76684},{\"end\":77036,\"start\":77032},{\"end\":77046,\"start\":77040},{\"end\":77056,\"start\":77050},{\"end\":77065,\"start\":77060},{\"end\":77076,\"start\":77071},{\"end\":77319,\"start\":77312},{\"end\":77329,\"start\":77323},{\"end\":77341,\"start\":77333},{\"end\":77351,\"start\":77347},{\"end\":77927,\"start\":77920},{\"end\":77937,\"start\":77931},{\"end\":77955,\"start\":77943},{\"end\":77966,\"start\":77959},{\"end\":78362,\"start\":78355},{\"end\":78375,\"start\":78366},{\"end\":78387,\"start\":78379},{\"end\":78756,\"start\":78752},{\"end\":78765,\"start\":78763},{\"end\":78775,\"start\":78772},{\"end\":78786,\"start\":78782},{\"end\":78793,\"start\":78790},{\"end\":79215,\"start\":79209},{\"end\":79225,\"start\":79219},{\"end\":79233,\"start\":79229},{\"end\":79244,\"start\":79237},{\"end\":79563,\"start\":79556},{\"end\":79578,\"start\":79567},{\"end\":79590,\"start\":79582},{\"end\":80000,\"start\":79993},{\"end\":80010,\"start\":80004},{\"end\":80225,\"start\":80218},{\"end\":80236,\"start\":80232},{\"end\":80247,\"start\":80240},{\"end\":80669,\"start\":80661},{\"end\":80681,\"start\":80675},{\"end\":81130,\"start\":81123},{\"end\":81141,\"start\":81134},{\"end\":81153,\"start\":81145},{\"end\":81163,\"start\":81157},{\"end\":81540,\"start\":81534},{\"end\":81551,\"start\":81546},{\"end\":81562,\"start\":81555},{\"end\":81574,\"start\":81568},{\"end\":81585,\"start\":81580},{\"end\":81795,\"start\":81792},{\"end\":81805,\"start\":81799},{\"end\":81815,\"start\":81809},{\"end\":81823,\"start\":81819},{\"end\":81838,\"start\":81829},{\"end\":81851,\"start\":81842},{\"end\":81862,\"start\":81855},{\"end\":82296,\"start\":82293},{\"end\":82303,\"start\":82300},{\"end\":82312,\"start\":82307},{\"end\":82319,\"start\":82316},{\"end\":82728,\"start\":82723},{\"end\":82741,\"start\":82732},{\"end\":82750,\"start\":82745},{\"end\":82762,\"start\":82754},{\"end\":83175,\"start\":83173},{\"end\":83182,\"start\":83179},{\"end\":83190,\"start\":83186},{\"end\":83202,\"start\":83196},{\"end\":83579,\"start\":83573},{\"end\":83591,\"start\":83585},{\"end\":83840,\"start\":83835},{\"end\":83850,\"start\":83844},{\"end\":83863,\"start\":83857},{\"end\":84118,\"start\":84112},{\"end\":84130,\"start\":84122},{\"end\":84404,\"start\":84397},{\"end\":84416,\"start\":84408},{\"end\":84427,\"start\":84420},{\"end\":84810,\"start\":84804},{\"end\":84821,\"start\":84814},{\"end\":84830,\"start\":84825},{\"end\":85106,\"start\":85100},{\"end\":85117,\"start\":85110},{\"end\":85126,\"start\":85121},{\"end\":85311,\"start\":85306},{\"end\":85457,\"start\":85452},{\"end\":85469,\"start\":85461},{\"end\":85481,\"start\":85475},{\"end\":85726,\"start\":85714},{\"end\":85736,\"start\":85730},{\"end\":85746,\"start\":85740},{\"end\":85755,\"start\":85750},{\"end\":86049,\"start\":86044},{\"end\":86060,\"start\":86055},{\"end\":86073,\"start\":86064},{\"end\":86306,\"start\":86300},{\"end\":86316,\"start\":86310},{\"end\":86325,\"start\":86320},{\"end\":86333,\"start\":86329},{\"end\":86590,\"start\":86582},{\"end\":86600,\"start\":86594},{\"end\":86610,\"start\":86604},{\"end\":86931,\"start\":86926},{\"end\":86944,\"start\":86937},{\"end\":86955,\"start\":86950},{\"end\":87205,\"start\":87201},{\"end\":87216,\"start\":87209},{\"end\":87230,\"start\":87220},{\"end\":87676,\"start\":87669},{\"end\":87685,\"start\":87680},{\"end\":87697,\"start\":87689},{\"end\":87706,\"start\":87701},{\"end\":88143,\"start\":88136},{\"end\":88152,\"start\":88147},{\"end\":88415,\"start\":88408},{\"end\":88424,\"start\":88419},{\"end\":88436,\"start\":88428},{\"end\":88445,\"start\":88440},{\"end\":88743,\"start\":88735},{\"end\":88755,\"start\":88747},{\"end\":88766,\"start\":88759},{\"end\":89231,\"start\":89221},{\"end\":89241,\"start\":89235},{\"end\":89252,\"start\":89245},{\"end\":89529,\"start\":89526},{\"end\":89536,\"start\":89533},{\"end\":89547,\"start\":89540},{\"end\":90010,\"start\":90007},{\"end\":90020,\"start\":90014},{\"end\":90034,\"start\":90024},{\"end\":90405,\"start\":90396},{\"end\":90415,\"start\":90407},{\"end\":90565,\"start\":90561},{\"end\":90576,\"start\":90571},{\"end\":90588,\"start\":90582},{\"end\":90604,\"start\":90594},{\"end\":90934,\"start\":90924},{\"end\":90944,\"start\":90938},{\"end\":90955,\"start\":90948},{\"end\":90968,\"start\":90962},{\"end\":91442,\"start\":91437},{\"end\":91453,\"start\":91446},{\"end\":91467,\"start\":91461},{\"end\":91474,\"start\":91471},{\"end\":91483,\"start\":91478},{\"end\":91944,\"start\":91937},{\"end\":91957,\"start\":91948},{\"end\":91969,\"start\":91961},{\"end\":91976,\"start\":91973}]", "bib_entry": "[{\"attributes\":{\"id\":\"b0\",\"matched_paper_id\":5975142},\"end\":76982,\"start\":76658},{\"attributes\":{\"id\":\"b1\",\"matched_paper_id\":16836909},\"end\":77210,\"start\":76984},{\"attributes\":{\"id\":\"b2\",\"matched_paper_id\":790198},\"end\":77814,\"start\":77212},{\"attributes\":{\"id\":\"b3\",\"matched_paper_id\":7847705},\"end\":78264,\"start\":77816},{\"attributes\":{\"id\":\"b4\",\"matched_paper_id\":5721368},\"end\":78694,\"start\":78266},{\"attributes\":{\"id\":\"b5\",\"matched_paper_id\":17945467},\"end\":79121,\"start\":78696},{\"attributes\":{\"id\":\"b6\",\"matched_paper_id\":12821575},\"end\":79499,\"start\":79123},{\"attributes\":{\"id\":\"b7\",\"matched_paper_id\":2734426},\"end\":79934,\"start\":79501},{\"attributes\":{\"id\":\"b8\",\"matched_paper_id\":14605234},\"end\":80177,\"start\":79936},{\"attributes\":{\"id\":\"b9\"},\"end\":80587,\"start\":80179},{\"attributes\":{\"id\":\"b10\",\"matched_paper_id\":7876575},\"end\":81061,\"start\":80589},{\"attributes\":{\"id\":\"b11\",\"matched_paper_id\":15388754},\"end\":81482,\"start\":81063},{\"attributes\":{\"id\":\"b12\",\"matched_paper_id\":5498131},\"end\":81747,\"start\":81484},{\"attributes\":{\"id\":\"b13\",\"matched_paper_id\":2370490},\"end\":82235,\"start\":81749},{\"attributes\":{\"id\":\"b14\",\"matched_paper_id\":10043736},\"end\":82657,\"start\":82237},{\"attributes\":{\"id\":\"b15\",\"matched_paper_id\":4100723},\"end\":83084,\"start\":82659},{\"attributes\":{\"id\":\"b16\",\"matched_paper_id\":18778077},\"end\":83508,\"start\":83086},{\"attributes\":{\"id\":\"b17\",\"matched_paper_id\":20284755},\"end\":83765,\"start\":83510},{\"attributes\":{\"id\":\"b18\",\"matched_paper_id\":13806027},\"end\":84038,\"start\":83767},{\"attributes\":{\"id\":\"b19\",\"matched_paper_id\":24056678},\"end\":84334,\"start\":84040},{\"attributes\":{\"id\":\"b20\",\"matched_paper_id\":9577739},\"end\":84750,\"start\":84336},{\"attributes\":{\"id\":\"b21\",\"matched_paper_id\":16899852},\"end\":85082,\"start\":84752},{\"attributes\":{\"id\":\"b22\"},\"end\":85251,\"start\":85084},{\"attributes\":{\"id\":\"b23\",\"matched_paper_id\":15271238},\"end\":85433,\"start\":85253},{\"attributes\":{\"id\":\"b24\",\"matched_paper_id\":9989560},\"end\":85634,\"start\":85435},{\"attributes\":{\"id\":\"b25\",\"matched_paper_id\":206711862},\"end\":86005,\"start\":85636},{\"attributes\":{\"id\":\"b26\",\"matched_paper_id\":15482500},\"end\":86239,\"start\":86007},{\"attributes\":{\"id\":\"b27\",\"matched_paper_id\":15367010},\"end\":86508,\"start\":86241},{\"attributes\":{\"id\":\"b28\",\"matched_paper_id\":4589021},\"end\":86845,\"start\":86510},{\"attributes\":{\"id\":\"b29\",\"matched_paper_id\":10691349},\"end\":87142,\"start\":86847},{\"attributes\":{\"id\":\"b30\",\"matched_paper_id\":495783},\"end\":87581,\"start\":87144},{\"attributes\":{\"id\":\"b31\",\"matched_paper_id\":17870697},\"end\":88083,\"start\":87583},{\"attributes\":{\"id\":\"b32\",\"matched_paper_id\":17215243},\"end\":88363,\"start\":88085},{\"attributes\":{\"id\":\"b33\",\"matched_paper_id\":17344585},\"end\":88672,\"start\":88365},{\"attributes\":{\"id\":\"b34\",\"matched_paper_id\":7069954},\"end\":89111,\"start\":88674},{\"attributes\":{\"id\":\"b35\",\"matched_paper_id\":18330573},\"end\":89456,\"start\":89113},{\"attributes\":{\"id\":\"b36\",\"matched_paper_id\":2370992},\"end\":89904,\"start\":89458},{\"attributes\":{\"id\":\"b37\",\"matched_paper_id\":2182940},\"end\":90392,\"start\":89906},{\"attributes\":{\"id\":\"b38\"},\"end\":90483,\"start\":90394},{\"attributes\":{\"id\":\"b39\",\"matched_paper_id\":207761262},\"end\":90839,\"start\":90485},{\"attributes\":{\"id\":\"b40\",\"matched_paper_id\":13823856},\"end\":91328,\"start\":90841},{\"attributes\":{\"id\":\"b41\",\"matched_paper_id\":16027399},\"end\":91868,\"start\":91330},{\"attributes\":{\"id\":\"b42\",\"matched_paper_id\":15057486},\"end\":92309,\"start\":91870}]", "bib_title": "[{\"end\":76680,\"start\":76658},{\"end\":77026,\"start\":76984},{\"end\":77308,\"start\":77212},{\"end\":77916,\"start\":77816},{\"end\":78351,\"start\":78266},{\"end\":78745,\"start\":78696},{\"end\":79205,\"start\":79123},{\"end\":79552,\"start\":79501},{\"end\":79989,\"start\":79936},{\"end\":80214,\"start\":80179},{\"end\":80657,\"start\":80589},{\"end\":81119,\"start\":81063},{\"end\":81530,\"start\":81484},{\"end\":81788,\"start\":81749},{\"end\":82289,\"start\":82237},{\"end\":82719,\"start\":82659},{\"end\":83169,\"start\":83086},{\"end\":83567,\"start\":83510},{\"end\":83831,\"start\":83767},{\"end\":84108,\"start\":84040},{\"end\":84393,\"start\":84336},{\"end\":84800,\"start\":84752},{\"end\":85094,\"start\":85084},{\"end\":85302,\"start\":85253},{\"end\":85448,\"start\":85435},{\"end\":85710,\"start\":85636},{\"end\":86038,\"start\":86007},{\"end\":86296,\"start\":86241},{\"end\":86578,\"start\":86510},{\"end\":86920,\"start\":86847},{\"end\":87197,\"start\":87144},{\"end\":87665,\"start\":87583},{\"end\":88132,\"start\":88085},{\"end\":88404,\"start\":88365},{\"end\":88731,\"start\":88674},{\"end\":89217,\"start\":89113},{\"end\":89522,\"start\":89458},{\"end\":90001,\"start\":89906},{\"end\":90557,\"start\":90485},{\"end\":90920,\"start\":90841},{\"end\":91431,\"start\":91330},{\"end\":91931,\"start\":91870}]", "bib_author": "[{\"end\":76694,\"start\":76682},{\"end\":77038,\"start\":77028},{\"end\":77048,\"start\":77038},{\"end\":77058,\"start\":77048},{\"end\":77067,\"start\":77058},{\"end\":77078,\"start\":77067},{\"end\":77321,\"start\":77310},{\"end\":77331,\"start\":77321},{\"end\":77343,\"start\":77331},{\"end\":77353,\"start\":77343},{\"end\":77929,\"start\":77918},{\"end\":77939,\"start\":77929},{\"end\":77957,\"start\":77939},{\"end\":77968,\"start\":77957},{\"end\":78364,\"start\":78353},{\"end\":78377,\"start\":78364},{\"end\":78389,\"start\":78377},{\"end\":78758,\"start\":78747},{\"end\":78767,\"start\":78758},{\"end\":78777,\"start\":78767},{\"end\":78788,\"start\":78777},{\"end\":78795,\"start\":78788},{\"end\":79217,\"start\":79207},{\"end\":79227,\"start\":79217},{\"end\":79235,\"start\":79227},{\"end\":79246,\"start\":79235},{\"end\":79565,\"start\":79554},{\"end\":79580,\"start\":79565},{\"end\":79592,\"start\":79580},{\"end\":80002,\"start\":79991},{\"end\":80012,\"start\":80002},{\"end\":80227,\"start\":80216},{\"end\":80238,\"start\":80227},{\"end\":80249,\"start\":80238},{\"end\":80671,\"start\":80659},{\"end\":80683,\"start\":80671},{\"end\":81132,\"start\":81121},{\"end\":81143,\"start\":81132},{\"end\":81155,\"start\":81143},{\"end\":81165,\"start\":81155},{\"end\":81542,\"start\":81532},{\"end\":81553,\"start\":81542},{\"end\":81564,\"start\":81553},{\"end\":81576,\"start\":81564},{\"end\":81587,\"start\":81576},{\"end\":81797,\"start\":81790},{\"end\":81807,\"start\":81797},{\"end\":81817,\"start\":81807},{\"end\":81825,\"start\":81817},{\"end\":81840,\"start\":81825},{\"end\":81853,\"start\":81840},{\"end\":81864,\"start\":81853},{\"end\":82298,\"start\":82291},{\"end\":82305,\"start\":82298},{\"end\":82314,\"start\":82305},{\"end\":82321,\"start\":82314},{\"end\":82730,\"start\":82721},{\"end\":82743,\"start\":82730},{\"end\":82752,\"start\":82743},{\"end\":82764,\"start\":82752},{\"end\":83177,\"start\":83171},{\"end\":83184,\"start\":83177},{\"end\":83192,\"start\":83184},{\"end\":83204,\"start\":83192},{\"end\":83581,\"start\":83569},{\"end\":83593,\"start\":83581},{\"end\":83842,\"start\":83833},{\"end\":83852,\"start\":83842},{\"end\":83865,\"start\":83852},{\"end\":84120,\"start\":84110},{\"end\":84132,\"start\":84120},{\"end\":84406,\"start\":84395},{\"end\":84418,\"start\":84406},{\"end\":84429,\"start\":84418},{\"end\":84812,\"start\":84802},{\"end\":84823,\"start\":84812},{\"end\":84832,\"start\":84823},{\"end\":85108,\"start\":85096},{\"end\":85119,\"start\":85108},{\"end\":85128,\"start\":85119},{\"end\":85313,\"start\":85304},{\"end\":85459,\"start\":85450},{\"end\":85471,\"start\":85459},{\"end\":85483,\"start\":85471},{\"end\":85728,\"start\":85712},{\"end\":85738,\"start\":85728},{\"end\":85748,\"start\":85738},{\"end\":85757,\"start\":85748},{\"end\":86051,\"start\":86040},{\"end\":86062,\"start\":86051},{\"end\":86075,\"start\":86062},{\"end\":86308,\"start\":86298},{\"end\":86318,\"start\":86308},{\"end\":86327,\"start\":86318},{\"end\":86335,\"start\":86327},{\"end\":86592,\"start\":86580},{\"end\":86602,\"start\":86592},{\"end\":86612,\"start\":86602},{\"end\":86933,\"start\":86922},{\"end\":86946,\"start\":86933},{\"end\":86957,\"start\":86946},{\"end\":87207,\"start\":87199},{\"end\":87218,\"start\":87207},{\"end\":87232,\"start\":87218},{\"end\":87678,\"start\":87667},{\"end\":87687,\"start\":87678},{\"end\":87699,\"start\":87687},{\"end\":87708,\"start\":87699},{\"end\":88145,\"start\":88134},{\"end\":88154,\"start\":88145},{\"end\":88417,\"start\":88406},{\"end\":88426,\"start\":88417},{\"end\":88438,\"start\":88426},{\"end\":88447,\"start\":88438},{\"end\":88745,\"start\":88733},{\"end\":88757,\"start\":88745},{\"end\":88768,\"start\":88757},{\"end\":89233,\"start\":89219},{\"end\":89243,\"start\":89233},{\"end\":89254,\"start\":89243},{\"end\":89531,\"start\":89524},{\"end\":89538,\"start\":89531},{\"end\":89549,\"start\":89538},{\"end\":90012,\"start\":90003},{\"end\":90022,\"start\":90012},{\"end\":90036,\"start\":90022},{\"end\":90407,\"start\":90396},{\"end\":90417,\"start\":90407},{\"end\":90567,\"start\":90559},{\"end\":90578,\"start\":90567},{\"end\":90590,\"start\":90578},{\"end\":90606,\"start\":90590},{\"end\":90936,\"start\":90922},{\"end\":90946,\"start\":90936},{\"end\":90957,\"start\":90946},{\"end\":90970,\"start\":90957},{\"end\":91444,\"start\":91433},{\"end\":91455,\"start\":91444},{\"end\":91469,\"start\":91455},{\"end\":91476,\"start\":91469},{\"end\":91485,\"start\":91476},{\"end\":91946,\"start\":91933},{\"end\":91959,\"start\":91946},{\"end\":91971,\"start\":91959},{\"end\":91978,\"start\":91971}]", "bib_venue": "[{\"end\":76835,\"start\":76773},{\"end\":77534,\"start\":77452},{\"end\":78448,\"start\":78431},{\"end\":79727,\"start\":79668},{\"end\":80412,\"start\":80339},{\"end\":80842,\"start\":80771},{\"end\":81278,\"start\":81230},{\"end\":81999,\"start\":81940},{\"end\":82456,\"start\":82397},{\"end\":82877,\"start\":82829},{\"end\":83895,\"start\":83884},{\"end\":84550,\"start\":84498},{\"end\":87375,\"start\":87312},{\"end\":87843,\"start\":87784},{\"end\":88903,\"start\":88844},{\"end\":89284,\"start\":89273},{\"end\":90163,\"start\":90108},{\"end\":91091,\"start\":91039},{\"end\":91572,\"start\":91555},{\"end\":92099,\"start\":92047},{\"end\":76771,\"start\":76694},{\"end\":77082,\"start\":77078},{\"end\":77450,\"start\":77353},{\"end\":78017,\"start\":77968},{\"end\":78429,\"start\":78389},{\"end\":78840,\"start\":78795},{\"end\":79286,\"start\":79246},{\"end\":79666,\"start\":79592},{\"end\":80037,\"start\":80012},{\"end\":80337,\"start\":80249},{\"end\":80769,\"start\":80683},{\"end\":81228,\"start\":81165},{\"end\":81602,\"start\":81587},{\"end\":81938,\"start\":81864},{\"end\":82395,\"start\":82321},{\"end\":82827,\"start\":82764},{\"end\":83274,\"start\":83204},{\"end\":83622,\"start\":83593},{\"end\":83882,\"start\":83865},{\"end\":84171,\"start\":84132},{\"end\":84496,\"start\":84429},{\"end\":84894,\"start\":84832},{\"end\":85150,\"start\":85128},{\"end\":85329,\"start\":85313},{\"end\":85517,\"start\":85483},{\"end\":85812,\"start\":85757},{\"end\":86106,\"start\":86075},{\"end\":86359,\"start\":86335},{\"end\":86652,\"start\":86612},{\"end\":86976,\"start\":86957},{\"end\":87310,\"start\":87232},{\"end\":87782,\"start\":87708},{\"end\":88209,\"start\":88154},{\"end\":88502,\"start\":88447},{\"end\":88842,\"start\":88768},{\"end\":89271,\"start\":89254},{\"end\":89659,\"start\":89549},{\"end\":90106,\"start\":90036},{\"end\":90643,\"start\":90606},{\"end\":91037,\"start\":90970},{\"end\":91553,\"start\":91485},{\"end\":92045,\"start\":91978}]"}}}, "year": 2023, "month": 12, "day": 17}