{"id": 206942855, "updated": "2023-10-02 02:19:09.789", "metadata": {"title": "A benchmark for the evaluation of RGB-D SLAM systems", "authors": "[{\"first\":\"J.\",\"last\":\"Sturm\",\"middle\":[]},{\"first\":\"N.\",\"last\":\"Engelhard\",\"middle\":[]},{\"first\":\"F.\",\"last\":\"Endres\",\"middle\":[]},{\"first\":\"W.\",\"last\":\"Burgard\",\"middle\":[]},{\"first\":\"D.\",\"last\":\"Cremers\",\"middle\":[]}]", "venue": "2012 IEEE/RSJ International Conference on Intelligent Robots and Systems", "journal": "2012 IEEE/RSJ International Conference on Intelligent Robots and Systems", "publication_date": {"year": 2012, "month": null, "day": null}, "abstract": "In this paper, we present a novel benchmark for the evaluation of RGB-D SLAM systems. We recorded a large set of image sequences from a Microsoft Kinect with highly accurate and time-synchronized ground truth camera poses from a motion capture system. The sequences contain both the color and depth images in full sensor resolution (640 × 480) at video frame rate (30 Hz). The ground-truth trajectory was obtained from a motion-capture system with eight high-speed tracking cameras (100 Hz). The dataset consists of 39 sequences that were recorded in an office environment and an industrial hall. The dataset covers a large variety of scenes and camera motions. We provide sequences for debugging with slow motions as well as longer trajectories with and without loop closures. Most sequences were recorded from a handheld Kinect with unconstrained 6-DOF motions but we also provide sequences from a Kinect mounted on a Pioneer 3 robot that was manually navigated through a cluttered indoor environment. To stimulate the comparison of different approaches, we provide automatic evaluation tools both for the evaluation of drift of visual odometry systems and the global pose error of SLAM systems. The benchmark website [1] contains all data, detailed descriptions of the scenes, specifications of the data formats, sample code, and evaluation tools.", "fields_of_study": "[\"Computer Science\"]", "external_ids": {"arxiv": null, "mag": "2021851106", "acl": null, "pubmed": null, "pubmedcentral": null, "dblp": "conf/iros/SturmEEBC12", "doi": "10.1109/iros.2012.6385773"}}, "content": {"source": {"pdf_hash": "4dbe3e6ae6c552861dc0fe283df4f82dad8a1151", "pdf_src": "ScienceParsePlus", "pdf_uri": null, "oa_url_match": false, "oa_info": {"license": null, "open_access_url": "http://vision.in.tum.de/_media/spezial/bib/sturm12iros.pdf", "status": "GREEN"}}, "grobid": {"id": "63d0dbaf11c49f20efb40e420168b32dc0180ba7", "type": "plain-text", "url": "s3://ai2-s2-pdf-extraction-prod/parse-results/s2orc_worker/4dbe3e6ae6c552861dc0fe283df4f82dad8a1151.txt", "contents": "\nA Benchmark for the Evaluation of RGB-D SLAM Systems\n\n\nJürgen Sturm \nNikolas Engelhard \nFelix Endres \nWolfram Burgard \nDaniel Cremers \nA Benchmark for the Evaluation of RGB-D SLAM Systems\n\nIn this paper, we present a novel benchmark for the evaluation of RGB-D SLAM systems. We recorded a large set of image sequences from a Microsoft Kinect with highly accurate and time-synchronized ground truth camera poses from a motion capture system. The sequences contain both the color and depth images in full sensor resolution (640 × 480) at video frame rate (30 Hz). The ground-truth trajectory was obtained from a motion-capture system with eight high-speed tracking cameras (100 Hz). The dataset consists of 39 sequences that were recorded in an office environment and an industrial hall. The dataset covers a large variety of scenes and camera motions. We provide sequences for debugging with slow motions as well as longer trajectories with and without loop closures. Most sequences were recorded from a handheld Kinect with unconstrained 6-DOF motions but we also provide sequences from a Kinect mounted on a Pioneer 3 robot that was manually navigated through a cluttered indoor environment. To stimulate the comparison of different approaches, we provide automatic evaluation tools both for the evaluation of drift of visual odometry systems and the global pose error of SLAM systems. The benchmark website [1] contains all data, detailed descriptions of the scenes, specifications of the data formats, sample code, and evaluation tools.\n\nI. INTRODUCTION\n\nPublic datasets and benchmarks greatly support the scientific evaluation and objective comparison of algorithms. Several examples of successful benchmarks in the area computer vision have demonstrated that common datasets and clear evaluation metrics can significantly help to push the stateof-the-art forward. One highly relevant problem in robotics is the so-called simultaneous localization (SLAM) problem where the goal is to both recover the camera trajectory and the map from sensor data. The SLAM problem has been investigated in great detail for sensors such as sonar, laser, cameras, and time-of-flight sensors. Recently, novel low-cost RGB-D sensors such as the Kinect became available, and the first SLAM systems using these sensors have already appeared [2]- [4]. Other algorithms focus on fusing depth maps to a coherent 3D model [5]. Yet, the accuracy of the computed 3D model heavily depends on how accurate one can determine the individual camera poses.\n\nWith this dataset, we provide a complete benchmark that can be used to evaluate visual SLAM and odometry systems on RGB-D data. To stimulate comparison, we propose two evaluation metrics and provide automatic evaluation tools. Nikolas   We present a large dataset for the evaluation of RGB-D SLAM systems in (a) a typical office environment and (b) an industrial hall. We obtained the ground truth camera position from a motion capture system using reflective markers on (c) a hand-held and (d) a robot-mounted Kinect sensor.\n\nOur dataset consists of 39 sequences that we recorded in two different indoor environments. Each sequence contains the color and depth images, as well as the ground truth trajectory from the motion capture system. We carefully calibrated and time-synchronized the Kinect sensor to the motion capture system. After calibration, we measured the accuracy of the motion capture system to validate the calibration. All data is available online under the Creative Commons Attribution license (CC-BY 3.0) at http://vision.in.tum.de/data/datasets/ rgbd-dataset\n\nThe website contains-next to additional information about the data formats, calibration data, and example code-videos for simple visual inspection of the dataset.\n\n\nII. RELATED WORK\n\nThe simultaneous localization and mapping (or structurefrom-motion) problem has a long history both in robotics [6]- [12] and in computer vision [9], [13]- [16]. Different sensor modalities have been explored in the past, including 2D laser scanners [17], [18], 3D scanners [19]- [21], monocular cameras [9], [14]- [16], [22]- [24], stereo systems [25], [26]  For laser-and camera-based SLAM systems, there are several well-known datasets such as the Freiburg, Intel, Rawseeds and Newcollege datasets [27]- [29]. Geiger et al. [30] recently presented a benchmark for visual odometry from stereo images with ground truth poses. However the depth maps are not provided so that an additional preprocessing step is required. Pomerleau et al. [31] recorded a dataset with untextured point clouds from a Kinect in a motion capture studio. Also related is the work of Bao et al. [32] who aimed at the evaluation of semantic mapping and localization methods. However, in their dataset the camera poses were estimated from the color images of the Kinect, so that the ground truth is not accurate enough for our purpose. To the best of our knowledge, our dataset is therefore the first RGB-D dataset suitable for the evaluation of visual SLAM (and visual odometry) systems, as it contains both color and depth images and associated ground truth camera poses. An earlier version of our benchmark was presented recently [33]. Inspired from the feedback we received, we extended the original dataset with dynamic sequences, longer trajectories, and sequences recorded from a Kinect mounted on a mobile robot.\n\nNext to the data itself, a suitable evaluation metric is required for the benchmarking of SLAM solutions. One common evaluation metric that does not even require a ground truth is to measure the intrinsic errors after map optimization, such as the re-projection errors or, more generally, the χ 2 error [12], [34]. However, obviously low χ 2 errors do not guarantee a good map or an accurate estimate of the trajectory, as trivially not using any sensor data leads to zero error. From a practical viewpoint, we therefore advocatesimilar to Olson et al. [34]-to evaluate the end-to-end performance of the whole system by comparing its output (map or trajectory) with the ground truth. The map can for example be evaluated by overlaying it onto the floor plan and searching for differences. Although, in principle, difference images between the two maps can be computed automatically [35], the performance is often only judged visually by searching for thin structures, kinks or ghosts like double walls.\n\nThe alternative to map comparison is to evaluate a SLAM system by comparing the estimated camera motion against the true trajectory. Two frequently employed methods are the relative pose error (RPE) and the absolute trajectory error (ATE). The RPE measures the difference between the estimated motion and the true motion. It can either be used to evaluate the drift of a visual odometry system [36] or the accuracy at loop closures of SLAM systems [37], [38] which is especially useful if only sparse, relative relations are available as ground truth. Instead of evaluating relative poses differences, the ATE first aligns the two trajectories and then evaluates directly the absolute pose differences. This method is well suited for the evaluation of visual SLAM systems [34], [39] but requires that absolute ground truth poses are available. As we provide dense and absolute ground truth trajectories, both metrics are applicable. For both measures, we provide a reference implementation that computes the respective error given the estimated and the ground truth trajectory.\n\nIn this paper, we present a novel benchmark for the evaluation of visual SLAM and visual odometry systems on RGB-D data. Inspired from successful benchmarks in computer vision such as the Middlebury optical flow dataset [40] and the KITTI vision benchmark suite [30], we split out dataset into a training and a testing part. While the training sequences are fully available for offline evaluation, the testing sequences can only be evaluated on the benchmark website [1] to avoid over-fitting.\n\n\nIII. DATASET\n\nThe Kinect sensor consists of an near-infrared laser that projects a refraction pattern on the scene, an infrared camera that observes this pattern, and a color camera in between. As the projected pattern is known, it is possible to compute the disparity using block matching techniques. Note that image rectification and block matching is implemented in hardware and happens internally in the sensor.\n\nWe acquired a large set of data sequences containing both RGB-D data from the Kinect and ground truth pose estimates from the motion capture system. We recorded these trajectories both in a typical office environment (\"fr1\", 6 × 6m 2 ) and in a large industrial hall (\"fr2\", 10 × 12m 2 ) as depicted in Fig. 1. In most of these recordings, we used a handheld Kinect to browse through the scene. Furthermore, we recorded additional sequences with a Kinect mounted on a wheeled robot. Table I summarizes statistics over the 19 training sequences, and Fig. 2 shows images of four of them along with the corresponding camera trajectory. On average, the camera speeds of the fr1 sequences are higher than those of fr2. Except otherwise noted, we ensured that each sequence contains several loop closures to allow SLAM systems to recognize previously visited areas and use this to reduce camera drift. We grouped the recorded sequences into the categories \"Calibration\", \"Testing and Debugging\", \"Handheld SLAM\", and \"Robot SLAM\".\n\nIn the following, we briefly summarize the recorded sequences according to these categories. a) Calibration: For the calibration of intrinsic and extrinsic parameters of the Kinect and the motion capture system, we recorded for each Kinect • one sequence with color and depth images of a handheld 8 × 6 checkerboard with 20 mm square size recorded by a stationary Kinect,\n\n• one sequence with infrared images of a handheld 8 × 6 checkerboard with 20 mm square size recorded by a stationary Kinect,\n\n• one sequence with color and depth images of a stationary 8 × 7 checkerboard with 108 mm square size recorded by a handheld Kinect. b) Testing and Debugging: These sequences are intended to facilitate the development of novel algorithms with separated motions along and around the principal axes of the Kinect. In the \"xyz\" sequences, the camera was moved approximately along the X-, Y-and Z-axis (left/right, up/down, forward/backward) with little rotational components (see also Fig. 2a). Similarly, in the two \"rpy\" (roll-pitch-yaw) sequences, the camera was mostly only rotated around the principal axes with little translational motions. c) Handheld SLAM: We recorded 11 sequences with a handheld Kinect, i.e., 6-DOF camera motions. For the \"fr1/360\" sequence, we covered the whole office room by panning the Kinect in the center of the room. The \"fr1/floor\" sequence contains a camera sweep over the wooden floor. The \"fr1/desk\", \"fr1/desk2\" and \"fr1/room\" sequences cover two tables, four tables, and the whole room, respectively (see Fig. 2b). In the \"fr2/360 hemisphere\" sequence, we rotated the Kinect on the spot and pointed it at the walls and the ceiling of the industrial hall. In the \"fr2/360 kidnap\" sequence, we briefly covered the sensor with the hand for a few seconds to test the ability of SLAM systems to recover from sensor outages. For the \"fr2/desk\" sequence, we set up an office environment in the middle of the motion capture area consisting of two tables with various accessoires like a monitor, a keyboard, books, see Fig. 2c. Additionally, during the recording of the \"fr2/desk with person\" sequence a person was sitting at one of the desks and continuously moved several objects around. Furthermore, we recorded two large tours through the industrial hall, partially with poor illumination and few visual features. In the \"fr2/large no loop\" sequence, special care was taken that no visual overlap exists in the trajectory. Our intention behind this was to provide a sequence for measuring the long-term drift of (otherwise loop closing) SLAM systems. In contrast, the \"fr2/large with loop\" sequence has a large overlap between the beginning and the end of the sequence, so that a large loop exists. It should be noted that these tours were so large that we had to leave the motion capture area in the middle of the industrial hall. As a result, ground truth pose information only exists in the beginning and in the end of the sequence. d) Robot SLAM: We also recorded four sequences with a Kinect that was mounted on an ActivMedia Pioneer 3 robot (see Fig. 1d). With these sequences, it becomes possible to demonstrate the applicability of SLAM systems to wheeled robots. We aligned the Kinect horizontally, looking forward into the driving direction of the robot, so that the horizon was roughly located in the center of the image. Note that the motion of the Kinect is not strictly restricted to a plane because occasional tremors (as a result of bumps and wires on the floor) deflected the orientation of the Kinect. During recording, we joysticked the robot manually through the scene.\n\nIn the \"fr2/pioneer 360\" sequence, we drove the robot in a loop around the center of the (mostly) empty hall. Due to the large dimensions of the hall, the Kinect could not observe the depth of the distant walls for parts of the sequence. Furthermore, we set up a search-and-rescue scenario in the hall consisting of several office containers, boxes, and other feature-poor objects, see Fig. 2d. As a consequence, these sequences have depth, but are highly challenging for methods that rely on distinctive keypoints. In total, we recorded three sequences \"fr2/pioneer slam\", \"fr2/pioneer slam2\", and \"fr2/pioneer slam3\" that differ in the actual trajectories but all contain several loop closures.\n\nIV. DATA ACQUISITION All data was recorded at full resolution (640×480) and full frame rate (30 Hz) of the Microsoft Xbox Kinect sensor on a Linux laptop running Ubuntu 10.10 and ROS Diamondback. For recording the RGB-D data, we used two different off-theshelf Microsoft Kinect sensors (one for the \"fr1\" sequences, and a different sensor for the \"fr2\"). To access the color and depth images, we used the openni camera package in ROS which internally wraps PrimeSense's OpenNI-driver [41]. As the depth image and the color image are observed from two different cameras, the observed (raw) images are initially not aligned. To this aim, the OpenNI-driver has an option to register the depth image to the color image using a Z-buffer automatically. This is implemented by projecting the depth image to 3D and subsequently back-projecting it into the view of the color camera. The OpenNI-driver uses for this registration the factory calibration stored on the internal memory. Additionally, we used the kinect aux driver to record the accelerometer data from the Kinect at 500 Hz.\n\nTo obtain the camera pose of the Kinect sensor, we used an external motion capture system from MotionAnalysis [42]. Our setup consists of eight Raptor-E cameras with a camera resolution of 1280×1024 pixels at up to 300 Hz (see Fig. 3a). The motion capture system tracks the 3D position of passive markers by triangulation. To enhance the contrast of these markers, the motion capture cameras are equipped with infrared LEDs to illuminate the scene. We verified that the Kinect and the motion capture system do not interfere: The motion capture LEDs appear as dim lamps in the Kinect infrared image with no influence on the produced depth maps, while the projector of the Kinect is not detected at all by the motion capture cameras.\n\nFinally, we also video-taped all experiments with an external video camera to capture the camera motion and the scene from a different view point. All sequences and movies are available on our website [1].\n\n\nV. FILE FORMATS, TOOLS AND SAMPLE CODE\n\nEach sequence is provided as a single compressed TGZ archive which consists of the following files and folders:\n\n• \"rgb/\": a folder containing all color images (PNG format, 3 channels, 8 bit per channel),\n\n• \"depth/\": same for the depth images (PNG format, 1 channel, 16 bit per channel, distance in meters scaled by factor 5000),\n\n• \"rgb.txt\": a text file with a consecutive list of all color images (format: timestamp filename),\n\n• \"depth.txt\": same for the depth images (format: timestamp filename),\n\n• \"imu.txt\": a text file containing the timestamped accelerometer data (format: timestamp fx fy fz),\n\n• \"groundtruth.txt\": a text file containing the ground truth trajectory stored as a timestamped translation vector and unit quaternion (format: timestamp tx ty tz qx qy qz qw). Furthermore, all sequences are also available in the ROS bag format 1 and the rawlog format of the mobile robot programming toolkit (MRPT) 2 . Additionally, we provide a set of useful tools and sample code on our website for data association, evaluation and conversion [1].\n\n\nVI. CALIBRATION AND SYNCHRONIZATION\n\nAll components of our setup, i.e., the color camera, depth sensor, motion capture system require intrinsic and extrinsic calibration. Furthermore, the time stamps of the sensor messages need to be synchronized, due to time delays in the pre-processing, buffering, and data transmission of the individual sensors.\n\n\nA. Motion capture system calibration\n\nWe calibrated the motion capture system using the Cortex software provided by MotionAnalysis [42]. The calibration procedure requires waving a calibration stick with three markers extensively through the motion capture area, as illustrated in Fig. 3b. From these point correspondences, the system computes the poses of the motion capture cameras. To validate the result of this calibration procedure, we equipped a metal rod of approximately 2 m length with two reflective markers at both ends and checked whether its observed length was constant at different locations in the motion capture area. The idea behind this experiment is that if and only if the length of the metal rod is constant in all parts of the scene, then the whole motion capture area is Euclidean. In our experiment, we measured a standard deviation of 1.96 mm in the length of the stick over the entire motion capture area of 7 × 7Ḟrom this and further experiments, we conclude that the position estimates of the motion capture system are highly accurate, Euclidean and stable over time.\n\n\nB. Kinect calibration\n\nNext, we estimated the intrinsic camera parameters of both the color and the infrared camera using the OpenCV library from the \"rgb\" and \"ir\" calibration sequences. As a result of this calibration, we obtained the focal lengths (fx/fy), the optical center (cx/cy) and distortion parameters of both cameras. These parameters are summarized in Tab. II.\n\nSecondly, we validated the depth measurements of the Kinect by comparing the depth of four distinct points on the checkerboard as seen in the RGB image. As can be seen in Fig. 4a, the values of both Kinects do not exactly match the real depth as computed by the checkerboard detector from the calibrated RGB camera, but have slightly different scale. The estimated correction factor for the depth images is given in Tab. II. We applied this correction factor already to the dataset, so that no further action from the users is required. We evaluated the residual noise in the depth values as a function of the distance to the checkerboard. The result of this experiment is depicted in Fig. 4b. As can be seen from this plot, the noise in the depth values is around 1 cm until 2 m distance and around 5 cm in 4 m distance. A detailed analysis of Kinect calibration and the resulting accuracy has been recently published by Smisek et al. [43].\n\n\nC. Extrinsic calibration\n\nFor tracking a rigid body in the scene (like the Kinect sensor or the checkerboard), the motion capture system requires at least three reflective markers. In our experiments, we attached four reflective markers on each Kinect sensor (see Fig. 1c+1d) and five markers on the calibration checkerboard (see Fig. 5a). We placed four of the markers as accurately as possible on the outer corners of the checkerboard, such that the transformation between the visual checkerboard and the motion capture markers is known. Given these point observations and the point model, we can compute its pose with respect to the coordinate system of the motion capture system. We measured the average error between the point observations and the model to 0.60 mm in the office (\"fr1\") and 0.86 mm in the industrial hall (\"fr2\"). Given these noise values, we expect an error in the estimated orientations of around 0.34 deg and 0.49 deg, respectively. While this error is rather low, the reader should keep in mind that this means that reconstructed 3D models given the pose of the motion capture system -assuming a noise-free depth image for the moment -will have an error 30 mm and 43 mm, respectively in 5 m distance from the camera. Therefore, we emphasize that the pose estimates of the motion capture system cannot directly be used to generate (or evaluate) highly accurate 3D models of the scene. However, for evaluating the trajectory accuracy of visual SLAM systems, an absolute sub-millimeter and sub-degree accuracy is high enough to evaluate current (and potentially future) state-ofthe-art methods.\n\nAs the next calibration step, we estimated the transformation between the pose from the motion capture system and the optical frame of the Kinect using the calibration checkerboard. We validated our calibration by measuring the distance of the four corner points of the checkerboard as observed in the RGB image and the corner points predicted by the motion capture system. We measured an average error of 3.25 mm for the \"fr1\" Kinect and of 4.03 mm for the \"fr2\" Kinect. Note that these residuals contain both the noise induced by the motion capture system and the noise induced by the visual checkerboard detection. With respect to the high accuracy of the motion capture system, we attribute these errors mostly to (zero-mean) noise of the checkerboard detector.\n\nFrom our measurements obtained during calibration, we conclude that the relative error on a frame-to-frame basis in the ground truth data is lower than 1 mm and 0.5 deg measured in the optical center of the Kinect. Furthermore, the absolute error over the whole motion capture area is lower than 10 mm and 0.5 deg. Therefore, we claim that our dataset is valid to assess the performance of visual odometry and visual SLAM systems as long as these systems have (RPE and ATE) errors significantly above these values. \n\n\nD. Time synchronization\n\nWe determined the time delay between the motion capture system and the color camera of the Kinect using the same method, i.e., we evaluated the residuals for different time delays to determine the delay (see Fig. 5b). In this experiment, we found that the poses from the motion capture system were approximately 20 ms earlier than the color images of the Kinect. We corrected for this delay already in our dataset, so no further action is required by the user.\n\nThere is also a small time delay between the color and depth images as delivered by the Kinect. During the evaluation of our own SLAM and visual odometry systems, we found that the depth images arrive on average around 20 ms later than the color images. However, we decided to keep the unmodified time stamps of color and depth images in the dataset. To simplify the association of color and depth images for the user, we provide the \"associate.py\" script that outputs pairs of color and depth images according to the users preferences (such as time offset and maximum time difference).\n\nAnother challenge in the image data that users should keep in mind is that the Kinect uses a rolling shutter for the color camera which can lead to image distortions when the camera is moved quickly. As the Kinect automatically chooses the exposure time depending on the scene illumination, the strength of this effect can vary significantly in some of the sequences in the dataset.\n\n\nVII. EVALUATION METRICS\n\nA SLAM system generally outputs the estimated camera trajectory along with an estimate of the resulting map. While it is in principle possible to evaluate the quality of the resulting map, accurate ground truth maps are difficult to obtain. Therefore, we propose to evaluate the quality of the estimated trajectory from a given input sequence of RGB-D images. This approach simplifies the evaluation process greatly. Yet, it should be noted that a good trajectory does not necessarily imply a good map, as for example even a small error in the map could prevent the robot from working in the environment (obstacle in a doorway).\n\nFor the evaluation, we assume that we are given a sequence of poses from the estimated trajectory P 1 , . . . , P n ∈ SE(3) and from the ground truth trajectory Q 1 , . . . , Q n ∈ SE(3). For simplicity of notation, we assume that the sequences are Evaluating the drift by means of the relative pose error (RPE) of two visual odometry approaches on the fr1/desk sequence. As can be seen from this plot, RBM is has lower drift and fewer outliers than GICP. For more details, see [44].\n\ntime-synchronized, equally sampled, and both have length n.\n\nIn practice, these two sequences have typically different sampling rates, lengths and potentially missing data, so that an additional data association and interpolation step is required. Both sequences consist of homogeneous transformation matrices that express the pose of the RGB optical frame of the Kinect from an (arbitrary) reference frame. This reference frame does not have to be the same for both sequences, i.e., the estimated sequence might start in the origin, while the ground truth sequence is an absolute coordinate frame which was defined during calibration. While, in principle, the choice of the reference frame on the Kinect is also arbitrary, we decided to use the RGB optical frame as the reference because the depth images in our dataset have already been registered to this frame. In the remainder of this section, we define two common evaluation metrics for visual odometry and visual SLAM evaluation. For both evaluation metrics, we provide easy-to-use evaluation scripts for download on our website as well as an online version of this script to simplify and standardize the evaluation procedure for the users.\n\n\nA. Relative pose error (RPE)\n\nThe relative pose error measures the local accuracy of the trajectory over a fixed time interval ∆. Therefore, the relative pose error corresponds to the drift of the trajectory which is in particular useful for the evaluation of visual odometry systems. We define the relative pose error at time step i as\nE i := Q −1 i Q i+∆ −1 P −1 i P i+∆ .(1)\nFrom a sequence of n camera poses, we obtain in this way m = n − ∆ individual relative pose errors along the sequence. From these errors, we propose to compute the root mean squared error (RMSE) over all time indicies of the translational component as\nRMSE(E 1:n , ∆) := 1 m m i=1 trans(E i ) 2 1/2 ,(2)\nwhere trans(E i ) refers to the translational components of the relative pose error E i . It should be noted that some researchers prefer to evaluate the mean error instead of the root mean squared error which gives less influence to outliers. Alternatively, it is also possible to compute the median instead of the mean, which attributes even less influence to outliers. If desired, additionally the rotational error can be evaluated, but usually we found the comparison by translational errors to be sufficient (as rotational errors show up as translational errors when the camera is moved). Furthermore, the time parameter ∆ needs to be chosen. For visual odometry systems that match consecutive frames, ∆ = 1 is an intuitive choice; RMSE(E 1:n ) then gives the drift per frame. For systems that use more than one previous frame, larger values of ∆ can also be appropriate, for example, for ∆ = 30 gives the drift per second on a sequence recorded at 30 Hz. It should be noted that a common (but poor) choice is to set ∆ = n which means that the start point is directly compared to the end point. This metric can be misleading as it penalizes rotational errors in the beginning of a trajectory more than towards the end [37], [45]. For the evaluation of SLAM systems, it therefore makes sense to average over all possible time intervals ∆, i.e., to compute\nRMSE(E 1:n ) := 1 n n ∆=1 RMSE(E 1:n , ∆).(3)\nNote that the computational complexity of this expression is quadratic in the trajectory length. Therefore, we propose to approximate it by computing it from a fixed number of relative pose samples. Our automated evaluation script allows both the exact evaluation as well as the approximation for a given number of samples. An example of the relative pose error is given in Fig. 6. Here, the relative pose errors have been evaluated for two visual odometry approaches [44]. As can be seen from this figure, the RBM method has both lower drift and fewer outliers compared to GICP.\n\n\nB. Absolute trajectory error (ATE)\n\nFor visual SLAM systems, additionally the global consistency of the estimated trajectory is an important quantity. The global consistency can be evaluated by comparing the absolute distances between the estimated and the ground truth trajectory. As both trajectories can be specified in arbitrary coordinate frames, they first need to be aligned. This can be achieved in closed form using the method of Horn [46], which finds the rigid-body transformation S corresponding to the least-squares solution that maps the estimated trajectory P 1:n onto the ground truth trajectory Q 1:n . Given this transformation, the absolute trajectory error at time step i can be computed as\nF i := Q −1 i SP i .(4)\nSimilar to the relative pose error, we propose to evaluate the root mean squared error over all time indices of the translational components, i.e., \n\n\nRMSE\n\nA visualization of the absolute trajectory error is given in Fig. 7a. Here, RGB-D SLAM [47] was used to estimate the camera trajectory from the \"fr1/desk2\" sequence. (a) Visualization of the absolute trajectory error (ATE) on the \"fr1/desk2\" sequence. (b) Comparison of ATE and RPE measures. Both plots were generated from trajectories estimated by the RGB-D SLAM system [47].\n\nAlternatively, also the RPE can be used to evaluate the global error of a trajectory by averaging over all possible time intervals. Note that the RPE considers both translational and rotational errors, while the ATE only considers the translational errors. As a result, the RPE is always slightly larger than the ATE (or equal if there is no rotational error). This is also visualized in Fig. 7b, where both the RPE and the ATE were computed on various estimated trajectories from the RGB-D SLAM system. Therefore, the RPE metric provides an elegant way to combine rotational and translational errors into a single measure. However, rotational errors typically also manifest themselves in wrong translations and are thus indirectly also captured by the ATE. From a practical perspective, the ATE has an intuitive visualization which facilitates visual inspection. Nevertheless the two metrics are strongly correlated: In all our experiments we never encountered a substantial difference between the situations in which RPE and ATE were used. In fact, often the relative order remained the same independently from which measure was actually used.\n\n\nVIII. CONCLUSIONS\n\nIn this paper, we presented an benchmark for the evaluation of RGB-D SLAM systems. The dataset contains color images, depth maps, and associated ground-truth camera pose information. Further, we proposed two evaluation metrics that can be used to assess the performance of a visual odometry and visual SLAM system. Accurate calibration and rigorous validation ensures the high quality of the resulting dataset. We approved the validity of our dataset and the corresponding evaluation metrics by the evaluation of our own recent approaches [44], [47]. To conclude, we presented a high-quality dataset with a suitable set of evaluation metrics that constitutes a full benchmark for the evaluation of visual SLAM systems.\n\n\nFig. 1. We present a large dataset for the evaluation of RGB-D SLAM systems in (a) a typical office environment and (b) an industrial hall. We obtained the ground truth camera position from a motion capture system using reflective markers on (c) a hand-held and (d) a robot-mounted Kinect sensor.\n\nFig. 3 .\n3We use an external motion capture system from MotionAnalysis to track the camera pose of the Kinect.\n\nFig. 4 .\n4(a) Validation of the depth values of the fr1 and fr2 sensor by means of a checkerboard and (b) analysis of the noise in the depth values with respect to the camera distance.\n\nFig. 5 .\n5(a) Checkerboard used for the calibration and the time synchronization. (b) Analysis of the time delay between the motion capture system and the color camera of the Kinect sensor.\n\n\nFig. 6. Evaluating the drift by means of the relative pose error (RPE) of two visual odometry approaches on the fr1/desk sequence. As can be seen from this plot, RBM is has lower drift and fewer outliers than GICP. For more details, see [44].\n\n\nFig. 7. (a) Visualization of the absolute trajectory error (ATE) on the \"fr1/desk2\" sequence. (b) Comparison of ATE and RPE measures. Both plots were generated from trajectories estimated by the RGB-D SLAM system [47].\n\n\nEngelhard, Felix Endres and Wolfram Burgard are with the Autonomous Intelligent Systems Lab, Computer Science Department, University of Freiburg, Germany. {engelhar,endres,burgard}@informatik.uni-freiburg.de\n\n\nand recently RGB-D sensors such as the Microsoft Kinect [2]-[4]. Four examples of sequences contained in our dataset. Whereas the top row shows an example image, the bottom row shows the ground truth trajectory. The fr1/xyz sequence contains isolated motions along the coordinate axes, fr1/room and fr2/desk are sequences with several loop closures in two different office scenes, and fr2/slam was recorded from a Kinect mounted on a Pioneer 3 robot in a search-and-rescue scenario.1 \n\n1.5 \n\n0.2 \n\n0.4 \n\n0.6 \n\n0.8 \n\n1 \n\nx [m] \n\ny [m] \n\n(a) fr1/xyz \n\n−1 \n0 \n1 \n2 \n\n−1 \n\n0 \n\n1 \n\nx [m] \n\ny [m] \n\n(b) fr1/room \n\n−2 \n0 \n2 \n4 \n\n−2 \n\n0 \n\nx [m] \n\ny [m] \n\n(c) fr2/desk \n\n−5 \n0 \n5 \n\n−2 \n\n0 \n\n2 \n\nx [m] \n\ny [m] \n\n(d) fr2/slam \n\nFig. 2. \n\n\nPARAMETERS OF THE COLOR AND INFRARED CAMERAS FOR THE TWO KINECTS USED IN OUR DATASET, INCLUDING THE FOCAL LENGTH (FX/FY) AND THE OPTICAL CENTER (CX/CY). FURTHERMORE, WE ESTIMATED A CORRECTION FACTOR FOR THE DEPTH VALUES (DS).Sequence Name \nDuration Avg. Trans. \nAvg. Rot. \n[s] \nVel. [m/s] Vel. [deg/s] \n\nTesting and Debugging \n\nfr1/xyz \n30 \n0.24 \n8.92 \nfr1/rpy \n28 \n0.06 \n50.15 \nfr2/xyz \n123 \n0.06 \n1.72 \nfr2/rpy \n110 \n0.01 \n5.77 \n\nHandheld SLAM \n\nfr1/360 \n29 \n0.21 \n41.60 \nfr1/floor \n50 \n0.26 \n15.07 \nfr1/desk \n23 \n0.41 \n23.33 \nfr1/desk2 \n25 \n0.43 \n29.31 \nfr1/room \n49 \n0.33 \n29.88 \nfr2/360 hemisphere \n91 \n0.16 \n20.57 \nfr2/360 kidnap \n48 \n0.30 \n13.43 \nfr2/desk \n99 \n0.19 \n6.34 \nfr2/desk with person \n142 \n0.12 \n5.34 \nfr2/large no loop \n112 \n0.24 \n15.09 \nfr2/large with loop \n173 \n0.23 \n17.21 \n\nRobot SLAM \n\nfr2/pioneer 360 \n73 \n0.23 \n12.05 \nfr2/pioneer slam \n156 \n0.26 \n13.38 \nfr2/pioneer slam2 \n116 \n0.19 \n12.21 \nfr2/pioneer slam3 \n112 \n0.16 \n12.34 \n\nTABLE I \nLIST OF AVAILABLE RGB-D SEQUENCES \n\ndataset \ncamera \nfx \nfy \ncx \ncy \n\nFreiburg 1 color \n517.3 516.5 318.6 255.3 \ninfrared \n591.1 590.1 331.0 234.0 \ndepth \nds = 1.035 \nFreiburg 2 color \n520.9 521.0 325.1 249.7 \ninfrared \n580.8 581.8 308.8 253.0 \ndepth \nds = 1.031 \n\nTABLE II \nINTRINSIC \nhttp://www.ros.org 2 http://www.mrpt.org/\nACKNOWLEDGEMENTSThe authors would like to thank Jörg Müller and Michael Ruhnke for their help and support with the motion capture system. Furthermore, we thank Frank Steinbrücker, Rainer Kümmerle, Stéphane Magnenat, Françis Colas, and François Pomerleau for the fruitful discussions. We also thank Jose Luis Blanco for making our datasets available to users of the Mobile Robot Programming Toolkit (MRPT) by converting them to the RAWLOG format.\nRGB-D mapping: Using depth cameras for dense 3D modeling of indoor environments. P Henry, M Krainin, E Herbst, X Ren, D Fox, Intl. Symp. on Experimental Robotics (ISER). P. Henry, M. Krainin, E. Herbst, X. Ren, and D. Fox, \"RGB-D mapping: Using depth cameras for dense 3D modeling of indoor environments,\" in Intl. Symp. on Experimental Robotics (ISER), 2010.\n\nRealtime 3D visual SLAM with a hand-held RGB-D camera. N Engelhard, F Endres, J Hess, J Sturm, W Burgard, RGB-D Workshop on 3D Perception in Robotics at the European Robotics Forum. N. Engelhard, F. Endres, J. Hess, J. Sturm, and W. Burgard, \"Real- time 3D visual SLAM with a hand-held RGB-D camera,\" in RGB-D Workshop on 3D Perception in Robotics at the European Robotics Forum, 2011.\n\nReal-time dense appearance-based SLAM for RGB-D sensors. C Audras, A Comport, M Meilland, P Rives, Australasian Conf. on Robotics and Automation. C. Audras, A. Comport, M. Meilland, and P. Rives, \"Real-time dense appearance-based SLAM for RGB-D sensors,\" in Australasian Conf. on Robotics and Automation, 2011.\n\nKinectFusion: Real-time dense surface mapping and tracking. R Newcombe, S Izadi, O Hilliges, D Molyneaux, D Kim, A Davison, P Kohli, J Shotton, S Hodges, A Fitzgibbon, Intl. Symposium on Mixed and Augmented Reality (ISMAR). R. Newcombe, S. Izadi, O. Hilliges, D. Molyneaux, D. Kim, A. Davi- son, P. Kohli, J. Shotton, S. Hodges, and A. Fitzgibbon, \"KinectFusion: Real-time dense surface mapping and tracking,\" in Intl. Symposium on Mixed and Augmented Reality (ISMAR), 2011.\n\nGlobally consistent range scan alignment for environment mapping. F Lu, E Milios, Autonomous Robots. 44F. Lu and E. Milios, \"Globally consistent range scan alignment for environment mapping,\" Autonomous Robots, vol. 4, no. 4, pp. 333- 349, 1997.\n\nSquare root SAM. F Dellaert, Proc. of Robotics: Science and Systems (RSS). of Robotics: Science and Systems (RSS)Cambridge, MA, USAF. Dellaert, \"Square root SAM,\" in Proc. of Robotics: Science and Systems (RSS), Cambridge, MA, USA, 2005.\n\nFast iterative optimization of pose graphs with poor initial estimates. E Olson, J Leonard, S Teller, IEEE Intl. Conf. on Robotics and Automation (ICRA). E. Olson, J. Leonard, and S. Teller, \"Fast iterative optimization of pose graphs with poor initial estimates,\" in IEEE Intl. Conf. on Robotics and Automation (ICRA), 2006.\n\nParallel tracking and mapping for small AR workspaces. G Klein, D Murray, IEEE and ACM Intl. Symposium on Mixed and Augmented Reality (ISMAR). G. Klein and D. Murray, \"Parallel tracking and mapping for small AR workspaces,\" in IEEE and ACM Intl. Symposium on Mixed and Augmented Reality (ISMAR), 2007.\n\niSAM: Incremental smoothing and mapping. M Kaess, A Ranganathan, F Dellaert, IEEE Trans. on Robotics, TRO. 246M. Kaess, A. Ranganathan, and F. Dellaert, \"iSAM: Incremental smoothing and mapping,\" IEEE Trans. on Robotics, TRO, vol. 24, no. 6, pp. 1365-1378, Dec 2008.\n\nNon-linear constraint network optimization for efficient map learning. G Grisetti, C Stachniss, W Burgard, IEEE Transactions on Intelligent Transportation systems. 103G. Grisetti, C. Stachniss, and W. Burgard, \"Non-linear constraint network optimization for efficient map learning,\" IEEE Transactions on Intelligent Transportation systems, vol. 10, no. 3, pp. 428-439, 2009.\n\ng2o: A general framework for graph optimization. R Kümmerle, G Grisetti, H Strasdat, K Konolige, W Burgard, IEEE Intl. Conf. on Robotics and Automation (ICRA). R. Kümmerle, G. Grisetti, H. Strasdat, K. Konolige, and W. Bur- gard, \"g2o: A general framework for graph optimization,\" in IEEE Intl. Conf. on Robotics and Automation (ICRA), 2011.\n\nReal-time 3-D motion and structure of point features: Front-end system for vision-based control and interaction. H Jin, P Favaro, S Soatto, IEEE Conf. on Computer Vision and Pattern Recognition (CVPR). H. Jin, P. Favaro, and S. Soatto, \"Real-time 3-D motion and structure of point features: Front-end system for vision-based control and inter- action,\" in IEEE Conf. on Computer Vision and Pattern Recognition (CVPR), 2000.\n\nFrom images to 3D models. M Pollefeys, L Van Gool, Commun. ACM. 45M. Pollefeys and L. Van Gool, \"From images to 3D models,\" Commun. ACM, vol. 45, pp. 50-55, July 2002.\n\nPreemptive ransac for live structure and motion estimation. D Nistér, Machine Vision and Applications. 16D. Nistér, \"Preemptive ransac for live structure and motion estimation,\" Machine Vision and Applications, vol. 16, pp. 321-329, 2005.\n\nReal-time dense geometry from a handheld camera. J Stühmer, S Gumhold, D Cremers, DAGM Symposium on Pattern Recognition (DAGM). J. Stühmer, S. Gumhold, and D. Cremers, \"Real-time dense geometry from a handheld camera,\" in DAGM Symposium on Pattern Recogni- tion (DAGM), 2010.\n\nFastSLAM: A factored solution to the simultaneous localization and mapping problem. M Montemerlo, S Thrun, D Koller, B Wegbreit, Prof. of the National Conf. on Artificial Intelligence (AAAI). M. Montemerlo, S. Thrun, D. Koller, and B. Wegbreit, \"FastSLAM: A factored solution to the simultaneous localization and mapping problem,\" in Prof. of the National Conf. on Artificial Intelligence (AAAI), 2002.\n\nImproved techniques for grid mapping with rao-blackwellized particle filters. G Grisetti, C Stachniss, W Burgard, IEEE Transactions on Robotics (T-RO). 23G. Grisetti, C. Stachniss, and W. Burgard, \"Improved techniques for grid mapping with rao-blackwellized particle filters,\" IEEE Transac- tions on Robotics (T-RO), vol. 23, pp. 34-46, 2007.\n\n6D SLAM -3D mapping outdoor environments: Research articles. A Nüchter, K Lingemann, J Hertzberg, H Surmann, J. Field Robot. 24A. Nüchter, K. Lingemann, J. Hertzberg, and H. Surmann, \"6D SLAM -3D mapping outdoor environments: Research articles,\" J. Field Robot., vol. 24, pp. 699-722, August 2007.\n\nAutomatic appearance-based loop detection from 3D laser data using the normal distributions transform. M Magnusson, H Andreasson, A Nüchter, A Lilienthal, Journal of Field Robotics. 2611-12M. Magnusson, H. Andreasson, A. Nüchter, and A. Lilienthal, \"Auto- matic appearance-based loop detection from 3D laser data using the normal distributions transform,\" Journal of Field Robotics, vol. 26, no. 11-12, pp. 892-914, 2009.\n\nGeneralized-icp. A Segal, D Haehnel, S Thrun, Robotics: Science and Systems (RSS). A. Segal, D. Haehnel, and S. Thrun, \"Generalized-icp,\" in Robotics: Science and Systems (RSS), 2009.\n\nAn analysis-by-synthesis camera tracking approach based on free-form surfaces. K Koeser, B Bartczak, R Koch, German Conf. on Pattern Recognition (DAGM). K. Koeser, B. Bartczak, and R. Koch, \"An analysis-by-synthesis camera tracking approach based on free-form surfaces,\" in German Conf. on Pattern Recognition (DAGM), 2007.\n\nTowards lifelong visual maps. K Konolige, J Bowman, IEEE/RSJ Intl. Conf. on Intelligent Robots and Systems (IROS). K. Konolige and J. Bowman, \"Towards lifelong visual maps,\" in IEEE/RSJ Intl. Conf. on Intelligent Robots and Systems (IROS), 2009.\n\nScale drift-aware large scale monocular SLAM. H Strasdat, J Montiel, A Davison, Proc. of Robotics: Science and Systems (RSS). of Robotics: Science and Systems (RSS)H. Strasdat, J. Montiel, and A. Davison, \"Scale drift-aware large scale monocular SLAM,\" in Proc. of Robotics: Science and Systems (RSS), 2010.\n\nOutdoor mapping and navigation using stereo vision. K Konolige, M Agrawal, R Bolles, C Cowan, M Fischler, B Gerkey, Intl. Symp. on Experimental Robotics (ISER). K. Konolige, M. Agrawal, R. Bolles, C. Cowan, M. Fischler, and B. Gerkey, \"Outdoor mapping and navigation using stereo vision,\" in Intl. Symp. on Experimental Robotics (ISER), 2007.\n\nReal-time quadrifocal visual odometry. A Comport, E Malis, P Rives, Intl. Journal of Robotics Research (IJRR). 29A. Comport, E. Malis, and P. Rives, \"Real-time quadrifocal visual odometry,\" Intl. Journal of Robotics Research (IJRR), vol. 29, pp. 245-266, 2010.\n\nLaser-based SLAM datasets. C Stachniss, P Beeson, D Hähnel, M Bosse, J Leonard, B Steder, R Kümmerle, C Dornhege, M Ruhnke, G Grisetti, A Kleiner, C. Stachniss, P. Beeson, D. Hähnel, M. Bosse, J. Leonard, B. Steder, R. Kümmerle, C. Dornhege, M. Ruhnke, G. Grisetti, and A. Kleiner, \"Laser-based SLAM datasets.\" [Online]. Available: http://OpenSLAM.org\n\nThe Rawseeds project. \"The Rawseeds project,\" http://www.rawseeds.org/rs/datasets/.\n\nThe new college vision and laser data set. M Smith, I Baldwin, W Churchill, R Paul, P Newman, Intl. Journal of Robotics Research (IJRR). 285M. Smith, I. Baldwin, W. Churchill, R. Paul, and P. Newman, \"The new college vision and laser data set,\" Intl. Journal of Robotics Research (IJRR), vol. 28, no. 5, pp. 595-599, 2009.\n\nAre we ready for autonomous driving? the KITTI vision benchmark suite. A Geiger, P Lenz, R Urtasun, IEEE Conf. on Computer Vision and Pattern Recognition (CVPR). Providence, USAA. Geiger, P. Lenz, and R. Urtasun, \"Are we ready for autonomous driving? the KITTI vision benchmark suite,\" in IEEE Conf. on Computer Vision and Pattern Recognition (CVPR), Providence, USA, June 2012.\n\nTracking a depth camera: Parameter exploration for fast ICP. F Pomerleau, S Magnenat, F Colas, M Liu, R Siegwart, IEEE/RSJ Intl. Conf. on Intelligent Robots and Systems (IROS). F. Pomerleau, S. Magnenat, F. Colas, M. Liu, and R. Siegwart, \"Tracking a depth camera: Parameter exploration for fast ICP,\" in IEEE/RSJ Intl. Conf. on Intelligent Robots and Systems (IROS), 2011.\n\nSemantic structure from motion. S Bao, S Savarese, IEEE Intl. Conf. on Computer Vision and Pattern Recognition (CVPR). S. Bao and S. Savarese, \"Semantic structure from motion,\" in IEEE Intl. Conf. on Computer Vision and Pattern Recognition (CVPR), 2011.\n\nTowards a benchmark for RGB-D SLAM evaluation. J Sturm, S Magnenat, N Engelhard, F Pomerleau, F Colas, W Burgard, D Cremers, R Siegwart, RGB-D Workshop on Advanced Reasoning with Depth Cameras at RSS. J. Sturm, S. Magnenat, N. Engelhard, F. Pomerleau, F. Colas, W. Bur- gard, D. Cremers, and R. Siegwart, \"Towards a benchmark for RGB-D SLAM evaluation,\" in RGB-D Workshop on Advanced Reasoning with Depth Cameras at RSS, June 2011.\n\nEvaluating the performance of map optimization algorithms. E Olson, M Kaess, RSS Workshop on Good Experimental Methodology in Robotics. E. Olson and M. Kaess, \"Evaluating the performance of map optimiza- tion algorithms,\" in RSS Workshop on Good Experimental Methodol- ogy in Robotics, 2009.\n\nSLAM in real applications. R Vincent, B Limketkai, M Eriksen, T De Candia, RSS Workshop on Automated SLAM Evaluation. R. Vincent, B. Limketkai, M. Eriksen, and T. De Candia, \"SLAM in real applications,\" in RSS Workshop on Automated SLAM Evaluation, 2011.\n\nLarge scale visual odometry for rough terrain. K Konolige, M Agrawal, J Solà, Intl. Symposium on Robotics Research (ISER). K. Konolige, M. Agrawal, and J. Solà, \"Large scale visual odometry for rough terrain,\" in Intl. Symposium on Robotics Research (ISER), 2007.\n\nOn measuring the accuracy of SLAM algorithms. R Kümmerle, B Steder, C Dornhege, M Ruhnke, G Grisetti, C Stachniss, A Kleiner, Autonomous Robots. 27R. Kümmerle, B. Steder, C. Dornhege, M. Ruhnke, G. Grisetti, C. Stachniss, and A. Kleiner, \"On measuring the accuracy of SLAM algorithms,\" Autonomous Robots, vol. 27, pp. 387-407, 2009.\n\nA comparison of SLAM algorithms based on a graph of relations. W Burgard, C Stachniss, G Grisetti, B Steder, R Kümmerle, C Dornhege, M Ruhnke, A Kleiner, J Tardós, IEEE/RSJ Intl. Conf. on Intelligent Robots and Systems (IROS). W. Burgard, C. Stachniss, G. Grisetti, B. Steder, R. Kümmerle, C. Dornhege, M. Ruhnke, A. Kleiner, and J. Tardós, \"A comparison of SLAM algorithms based on a graph of relations,\" in IEEE/RSJ Intl. Conf. on Intelligent Robots and Systems (IROS), 2009.\n\nGround truth evaluation of large urban 6D SLAM. W Wulf, A Nüchter, J Hertzberg, B Wagner, IEEE/RSJ Intl. Conf. on Intelligent Robots and Systems (IROS). W. Wulf, A. Nüchter, J. Hertzberg, and B. Wagner, \"Ground truth evaluation of large urban 6D SLAM,\" in IEEE/RSJ Intl. Conf. on Intelligent Robots and Systems (IROS), 2007.\n\nA database and evaluation methodology for optical flow. S Baker, D Scharstein, J Lewis, S Roth, M Black, R Szeliski, Intl. Journal of Computer Vision (IJCV). 921S. Baker, D. Scharstein, J. Lewis, S. Roth, M. Black, and R. Szeliski, \"A database and evaluation methodology for optical flow,\" Intl. Journal of Computer Vision (IJCV), vol. 92, no. 1, 2011.\n\nIntroducing OpenNI. Willow Primesense, Garage, SideKick and AsusPrimeSense, Willow Garage, SideKick and Asus, \"Introducing OpenNI,\" http://http://www.openni.org.\n\nRaptor-E Digital RealTime System. Motionanalysis, MotionAnalysis, \"Raptor-E Digital RealTime System,\" http://www.motionanalysis.com/html/industrial/raptore.html.\n\n3D with Kinect. J Smisek, M Jancosek, T Pajdla, ICCV Workshop on Consumer Depth Cameras for Computer Vision. J. Smisek, M. Jancosek, and T. Pajdla, \"3D with Kinect,\" in ICCV Workshop on Consumer Depth Cameras for Computer Vision, 2011.\n\nReal-time visual odometry from dense RGB-D images. F Steinbrücker, J Sturm, D Cremers, ICCV Workshop on Live Dense Reconstruction with Moving Cameras. F. Steinbrücker, J. Sturm, and D. Cremers, \"Real-time visual odometry from dense RGB-D images,\" in ICCV Workshop on Live Dense Reconstruction with Moving Cameras, 2011.\n\nLinearized error propagation in odometry. A Kelly, Intl. Journal of Robotics Research (IJRR). 232A. Kelly, \"Linearized error propagation in odometry,\" Intl. Journal of Robotics Research (IJRR), vol. 23, no. 2, 2004.\n\nClosed-form solution of absolute orientation using unit quaternions. B Horn, Journal of the Optical Society of America A. 4B. Horn, \"Closed-form solution of absolute orientation using unit quaternions,\" Journal of the Optical Society of America A, vol. 4, pp. 629-642, 1987.\n\nAn evaluation of the RGB-D SLAM system. F Endres, J Hess, N Engelhard, J Sturm, D Cremers, W Burgard, IEEE Intl. Conf. on Robotics and Automation (ICRA). F. Endres, J. Hess, N. Engelhard, J. Sturm, D. Cremers, and W. Burgard, \"An evaluation of the RGB-D SLAM system,\" in IEEE Intl. Conf. on Robotics and Automation (ICRA), 2012.\n", "annotations": {"author": "[{\"end\":69,\"start\":56},{\"end\":88,\"start\":70},{\"end\":102,\"start\":89},{\"end\":119,\"start\":103},{\"end\":135,\"start\":120}]", "publisher": null, "author_last_name": "[{\"end\":68,\"start\":63},{\"end\":87,\"start\":78},{\"end\":101,\"start\":95},{\"end\":118,\"start\":111},{\"end\":134,\"start\":127}]", "author_first_name": "[{\"end\":62,\"start\":56},{\"end\":77,\"start\":70},{\"end\":94,\"start\":89},{\"end\":110,\"start\":103},{\"end\":126,\"start\":120}]", "author_affiliation": null, "title": "[{\"end\":53,\"start\":1},{\"end\":188,\"start\":136}]", "venue": null, "abstract": "[{\"end\":1540,\"start\":190}]", "bib_ref": "[{\"attributes\":{\"ref_id\":\"b0\"},\"end\":2328,\"start\":2325},{\"attributes\":{\"ref_id\":\"b2\"},\"end\":2333,\"start\":2330},{\"attributes\":{\"ref_id\":\"b3\"},\"end\":2405,\"start\":2402},{\"end\":2764,\"start\":2757},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":3909,\"start\":3906},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":3915,\"start\":3911},{\"attributes\":{\"ref_id\":\"b7\"},\"end\":3942,\"start\":3939},{\"attributes\":{\"ref_id\":\"b11\"},\"end\":3948,\"start\":3944},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":3954,\"start\":3950},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":4048,\"start\":4044},{\"attributes\":{\"ref_id\":\"b16\"},\"end\":4054,\"start\":4050},{\"attributes\":{\"ref_id\":\"b17\"},\"end\":4072,\"start\":4068},{\"attributes\":{\"ref_id\":\"b19\"},\"end\":4078,\"start\":4074},{\"attributes\":{\"ref_id\":\"b7\"},\"end\":4101,\"start\":4098},{\"attributes\":{\"ref_id\":\"b12\"},\"end\":4107,\"start\":4103},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":4113,\"start\":4109},{\"attributes\":{\"ref_id\":\"b20\"},\"end\":4119,\"start\":4115},{\"attributes\":{\"ref_id\":\"b22\"},\"end\":4125,\"start\":4121},{\"attributes\":{\"ref_id\":\"b23\"},\"end\":4146,\"start\":4142},{\"attributes\":{\"ref_id\":\"b24\"},\"end\":4152,\"start\":4148},{\"attributes\":{\"ref_id\":\"b25\"},\"end\":4299,\"start\":4295},{\"attributes\":{\"ref_id\":\"b27\"},\"end\":4305,\"start\":4301},{\"attributes\":{\"ref_id\":\"b28\"},\"end\":4325,\"start\":4321},{\"attributes\":{\"ref_id\":\"b29\"},\"end\":4536,\"start\":4532},{\"attributes\":{\"ref_id\":\"b30\"},\"end\":4670,\"start\":4666},{\"attributes\":{\"ref_id\":\"b31\"},\"end\":5206,\"start\":5202},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":5698,\"start\":5694},{\"attributes\":{\"ref_id\":\"b32\"},\"end\":5704,\"start\":5700},{\"attributes\":{\"ref_id\":\"b32\"},\"end\":5948,\"start\":5944},{\"attributes\":{\"ref_id\":\"b33\"},\"end\":6277,\"start\":6273},{\"attributes\":{\"ref_id\":\"b34\"},\"end\":6793,\"start\":6789},{\"attributes\":{\"ref_id\":\"b35\"},\"end\":6847,\"start\":6843},{\"attributes\":{\"ref_id\":\"b36\"},\"end\":6853,\"start\":6849},{\"attributes\":{\"ref_id\":\"b32\"},\"end\":7171,\"start\":7167},{\"attributes\":{\"ref_id\":\"b37\"},\"end\":7177,\"start\":7173},{\"attributes\":{\"ref_id\":\"b38\"},\"end\":7698,\"start\":7694},{\"attributes\":{\"ref_id\":\"b28\"},\"end\":7740,\"start\":7736},{\"attributes\":{\"ref_id\":\"b39\"},\"end\":14222,\"start\":14218},{\"attributes\":{\"ref_id\":\"b40\"},\"end\":14927,\"start\":14923},{\"attributes\":{\"ref_id\":\"b40\"},\"end\":17340,\"start\":17336},{\"attributes\":{\"ref_id\":\"b41\"},\"end\":19620,\"start\":19616},{\"attributes\":{\"ref_id\":\"b42\"},\"end\":25125,\"start\":25121},{\"attributes\":{\"ref_id\":\"b35\"},\"end\":28237,\"start\":28233},{\"attributes\":{\"ref_id\":\"b43\"},\"end\":28243,\"start\":28239},{\"attributes\":{\"ref_id\":\"b42\"},\"end\":28888,\"start\":28884},{\"attributes\":{\"ref_id\":\"b44\"},\"end\":29446,\"start\":29442},{\"attributes\":{\"ref_id\":\"b45\"},\"end\":29981,\"start\":29977},{\"attributes\":{\"ref_id\":\"b45\"},\"end\":30265,\"start\":30261},{\"attributes\":{\"ref_id\":\"b42\"},\"end\":31978,\"start\":31974},{\"attributes\":{\"ref_id\":\"b45\"},\"end\":31984,\"start\":31980},{\"attributes\":{\"ref_id\":\"b2\"},\"end\":33683,\"start\":33680}]", "figure": "[{\"attributes\":{\"id\":\"fig_0\"},\"end\":32452,\"start\":32154},{\"attributes\":{\"id\":\"fig_1\"},\"end\":32564,\"start\":32453},{\"attributes\":{\"id\":\"fig_2\"},\"end\":32750,\"start\":32565},{\"attributes\":{\"id\":\"fig_3\"},\"end\":32941,\"start\":32751},{\"attributes\":{\"id\":\"fig_4\"},\"end\":33186,\"start\":32942},{\"attributes\":{\"id\":\"fig_6\"},\"end\":33407,\"start\":33187},{\"attributes\":{\"id\":\"tab_0\",\"type\":\"table\"},\"end\":33617,\"start\":33408},{\"attributes\":{\"id\":\"tab_1\",\"type\":\"table\"},\"end\":34345,\"start\":33618},{\"attributes\":{\"id\":\"tab_2\",\"type\":\"table\"},\"end\":35596,\"start\":34346}]", "paragraph": "[{\"end\":2528,\"start\":1559},{\"end\":3055,\"start\":2530},{\"end\":3609,\"start\":3057},{\"end\":3773,\"start\":3611},{\"end\":5389,\"start\":3794},{\"end\":6393,\"start\":5391},{\"end\":7472,\"start\":6395},{\"end\":7967,\"start\":7474},{\"end\":8385,\"start\":7984},{\"end\":9411,\"start\":8387},{\"end\":9784,\"start\":9413},{\"end\":9910,\"start\":9786},{\"end\":13034,\"start\":9912},{\"end\":13732,\"start\":13036},{\"end\":14811,\"start\":13734},{\"end\":15544,\"start\":14813},{\"end\":15751,\"start\":15546},{\"end\":15905,\"start\":15794},{\"end\":15998,\"start\":15907},{\"end\":16124,\"start\":16000},{\"end\":16224,\"start\":16126},{\"end\":16296,\"start\":16226},{\"end\":16398,\"start\":16298},{\"end\":16850,\"start\":16400},{\"end\":17202,\"start\":16890},{\"end\":18302,\"start\":17243},{\"end\":18678,\"start\":18328},{\"end\":19621,\"start\":18680},{\"end\":21241,\"start\":19650},{\"end\":22008,\"start\":21243},{\"end\":22525,\"start\":22010},{\"end\":23013,\"start\":22553},{\"end\":23601,\"start\":23015},{\"end\":23985,\"start\":23603},{\"end\":24641,\"start\":24013},{\"end\":25126,\"start\":24643},{\"end\":25187,\"start\":25128},{\"end\":26325,\"start\":25189},{\"end\":26664,\"start\":26358},{\"end\":26957,\"start\":26706},{\"end\":28369,\"start\":27010},{\"end\":28995,\"start\":28416},{\"end\":29708,\"start\":29034},{\"end\":29881,\"start\":29733},{\"end\":30266,\"start\":29890},{\"end\":31413,\"start\":30268},{\"end\":32153,\"start\":31435}]", "formula": "[{\"attributes\":{\"id\":\"formula_0\"},\"end\":26705,\"start\":26665},{\"attributes\":{\"id\":\"formula_1\"},\"end\":27009,\"start\":26958},{\"attributes\":{\"id\":\"formula_2\"},\"end\":28415,\"start\":28370},{\"attributes\":{\"id\":\"formula_3\"},\"end\":29732,\"start\":29709}]", "table_ref": "[{\"end\":8877,\"start\":8870}]", "section_header": "[{\"end\":1557,\"start\":1542},{\"end\":3792,\"start\":3776},{\"end\":7982,\"start\":7970},{\"end\":15792,\"start\":15754},{\"end\":16888,\"start\":16853},{\"end\":17241,\"start\":17205},{\"end\":18326,\"start\":18305},{\"end\":19648,\"start\":19624},{\"end\":22551,\"start\":22528},{\"end\":24011,\"start\":23988},{\"end\":26356,\"start\":26328},{\"end\":29032,\"start\":28998},{\"end\":29888,\"start\":29884},{\"end\":31433,\"start\":31416},{\"end\":32462,\"start\":32454},{\"end\":32574,\"start\":32566},{\"end\":32760,\"start\":32752}]", "table": "[{\"end\":34345,\"start\":34102},{\"end\":35596,\"start\":34573}]", "figure_caption": "[{\"end\":32452,\"start\":32156},{\"end\":32564,\"start\":32464},{\"end\":32750,\"start\":32576},{\"end\":32941,\"start\":32762},{\"end\":33186,\"start\":32944},{\"end\":33407,\"start\":33189},{\"end\":33617,\"start\":33410},{\"end\":34102,\"start\":33620},{\"end\":34573,\"start\":34348}]", "figure_ref": "[{\"end\":8696,\"start\":8690},{\"end\":8942,\"start\":8936},{\"end\":10402,\"start\":10394},{\"end\":10962,\"start\":10955},{\"end\":11467,\"start\":11460},{\"end\":12504,\"start\":12497},{\"end\":13429,\"start\":13422},{\"attributes\":{\"ref_id\":\"fig_1\"},\"end\":15047,\"start\":15040},{\"attributes\":{\"ref_id\":\"fig_1\"},\"end\":17493,\"start\":17486},{\"attributes\":{\"ref_id\":\"fig_2\"},\"end\":18858,\"start\":18851},{\"attributes\":{\"ref_id\":\"fig_2\"},\"end\":19372,\"start\":19365},{\"end\":19898,\"start\":19888},{\"attributes\":{\"ref_id\":\"fig_3\"},\"end\":19961,\"start\":19954},{\"attributes\":{\"ref_id\":\"fig_3\"},\"end\":22768,\"start\":22761},{\"end\":28796,\"start\":28790},{\"end\":29958,\"start\":29951},{\"end\":30663,\"start\":30656}]", "bib_author_first_name": "[{\"end\":36167,\"start\":36166},{\"end\":36176,\"start\":36175},{\"end\":36187,\"start\":36186},{\"end\":36197,\"start\":36196},{\"end\":36204,\"start\":36203},{\"end\":36502,\"start\":36501},{\"end\":36515,\"start\":36514},{\"end\":36525,\"start\":36524},{\"end\":36533,\"start\":36532},{\"end\":36542,\"start\":36541},{\"end\":36891,\"start\":36890},{\"end\":36901,\"start\":36900},{\"end\":36912,\"start\":36911},{\"end\":36924,\"start\":36923},{\"end\":37206,\"start\":37205},{\"end\":37218,\"start\":37217},{\"end\":37227,\"start\":37226},{\"end\":37239,\"start\":37238},{\"end\":37252,\"start\":37251},{\"end\":37259,\"start\":37258},{\"end\":37270,\"start\":37269},{\"end\":37279,\"start\":37278},{\"end\":37290,\"start\":37289},{\"end\":37300,\"start\":37299},{\"end\":37688,\"start\":37687},{\"end\":37694,\"start\":37693},{\"end\":37886,\"start\":37885},{\"end\":38180,\"start\":38179},{\"end\":38189,\"start\":38188},{\"end\":38200,\"start\":38199},{\"end\":38490,\"start\":38489},{\"end\":38499,\"start\":38498},{\"end\":38779,\"start\":38778},{\"end\":38788,\"start\":38787},{\"end\":38803,\"start\":38802},{\"end\":39077,\"start\":39076},{\"end\":39089,\"start\":39088},{\"end\":39102,\"start\":39101},{\"end\":39431,\"start\":39430},{\"end\":39443,\"start\":39442},{\"end\":39455,\"start\":39454},{\"end\":39467,\"start\":39466},{\"end\":39479,\"start\":39478},{\"end\":39838,\"start\":39837},{\"end\":39845,\"start\":39844},{\"end\":39855,\"start\":39854},{\"end\":40176,\"start\":40175},{\"end\":40189,\"start\":40188},{\"end\":40379,\"start\":40378},{\"end\":40608,\"start\":40607},{\"end\":40619,\"start\":40618},{\"end\":40630,\"start\":40629},{\"end\":40920,\"start\":40919},{\"end\":40934,\"start\":40933},{\"end\":40943,\"start\":40942},{\"end\":40953,\"start\":40952},{\"end\":41318,\"start\":41317},{\"end\":41330,\"start\":41329},{\"end\":41343,\"start\":41342},{\"end\":41645,\"start\":41644},{\"end\":41656,\"start\":41655},{\"end\":41669,\"start\":41668},{\"end\":41682,\"start\":41681},{\"end\":41986,\"start\":41985},{\"end\":41999,\"start\":41998},{\"end\":42013,\"start\":42012},{\"end\":42024,\"start\":42023},{\"end\":42323,\"start\":42322},{\"end\":42332,\"start\":42331},{\"end\":42343,\"start\":42342},{\"end\":42570,\"start\":42569},{\"end\":42580,\"start\":42579},{\"end\":42592,\"start\":42591},{\"end\":42846,\"start\":42845},{\"end\":42858,\"start\":42857},{\"end\":43109,\"start\":43108},{\"end\":43121,\"start\":43120},{\"end\":43132,\"start\":43131},{\"end\":43424,\"start\":43423},{\"end\":43436,\"start\":43435},{\"end\":43447,\"start\":43446},{\"end\":43457,\"start\":43456},{\"end\":43466,\"start\":43465},{\"end\":43478,\"start\":43477},{\"end\":43755,\"start\":43754},{\"end\":43766,\"start\":43765},{\"end\":43775,\"start\":43774},{\"end\":44005,\"start\":44004},{\"end\":44018,\"start\":44017},{\"end\":44028,\"start\":44027},{\"end\":44038,\"start\":44037},{\"end\":44047,\"start\":44046},{\"end\":44058,\"start\":44057},{\"end\":44068,\"start\":44067},{\"end\":44080,\"start\":44079},{\"end\":44092,\"start\":44091},{\"end\":44102,\"start\":44101},{\"end\":44114,\"start\":44113},{\"end\":44459,\"start\":44458},{\"end\":44468,\"start\":44467},{\"end\":44479,\"start\":44478},{\"end\":44492,\"start\":44491},{\"end\":44500,\"start\":44499},{\"end\":44811,\"start\":44810},{\"end\":44821,\"start\":44820},{\"end\":44829,\"start\":44828},{\"end\":45181,\"start\":45180},{\"end\":45194,\"start\":45193},{\"end\":45206,\"start\":45205},{\"end\":45215,\"start\":45214},{\"end\":45222,\"start\":45221},{\"end\":45527,\"start\":45526},{\"end\":45534,\"start\":45533},{\"end\":45797,\"start\":45796},{\"end\":45806,\"start\":45805},{\"end\":45818,\"start\":45817},{\"end\":45831,\"start\":45830},{\"end\":45844,\"start\":45843},{\"end\":45853,\"start\":45852},{\"end\":45864,\"start\":45863},{\"end\":45875,\"start\":45874},{\"end\":46242,\"start\":46241},{\"end\":46251,\"start\":46250},{\"end\":46503,\"start\":46502},{\"end\":46514,\"start\":46513},{\"end\":46527,\"start\":46526},{\"end\":46538,\"start\":46537},{\"end\":46779,\"start\":46778},{\"end\":46791,\"start\":46790},{\"end\":46802,\"start\":46801},{\"end\":47043,\"start\":47042},{\"end\":47055,\"start\":47054},{\"end\":47065,\"start\":47064},{\"end\":47077,\"start\":47076},{\"end\":47087,\"start\":47086},{\"end\":47099,\"start\":47098},{\"end\":47112,\"start\":47111},{\"end\":47394,\"start\":47393},{\"end\":47405,\"start\":47404},{\"end\":47418,\"start\":47417},{\"end\":47430,\"start\":47429},{\"end\":47440,\"start\":47439},{\"end\":47452,\"start\":47451},{\"end\":47464,\"start\":47463},{\"end\":47474,\"start\":47473},{\"end\":47485,\"start\":47484},{\"end\":47858,\"start\":47857},{\"end\":47866,\"start\":47865},{\"end\":47877,\"start\":47876},{\"end\":47890,\"start\":47889},{\"end\":48192,\"start\":48191},{\"end\":48201,\"start\":48200},{\"end\":48215,\"start\":48214},{\"end\":48224,\"start\":48223},{\"end\":48232,\"start\":48231},{\"end\":48241,\"start\":48240},{\"end\":48515,\"start\":48509},{\"end\":48832,\"start\":48831},{\"end\":48842,\"start\":48841},{\"end\":48854,\"start\":48853},{\"end\":49104,\"start\":49103},{\"end\":49120,\"start\":49119},{\"end\":49129,\"start\":49128},{\"end\":49416,\"start\":49415},{\"end\":49660,\"start\":49659},{\"end\":49907,\"start\":49906},{\"end\":49917,\"start\":49916},{\"end\":49925,\"start\":49924},{\"end\":49938,\"start\":49937},{\"end\":49947,\"start\":49946},{\"end\":49958,\"start\":49957}]", "bib_author_last_name": "[{\"end\":36173,\"start\":36168},{\"end\":36184,\"start\":36177},{\"end\":36194,\"start\":36188},{\"end\":36201,\"start\":36198},{\"end\":36208,\"start\":36205},{\"end\":36512,\"start\":36503},{\"end\":36522,\"start\":36516},{\"end\":36530,\"start\":36526},{\"end\":36539,\"start\":36534},{\"end\":36550,\"start\":36543},{\"end\":36898,\"start\":36892},{\"end\":36909,\"start\":36902},{\"end\":36921,\"start\":36913},{\"end\":36930,\"start\":36925},{\"end\":37215,\"start\":37207},{\"end\":37224,\"start\":37219},{\"end\":37236,\"start\":37228},{\"end\":37249,\"start\":37240},{\"end\":37256,\"start\":37253},{\"end\":37267,\"start\":37260},{\"end\":37276,\"start\":37271},{\"end\":37287,\"start\":37280},{\"end\":37297,\"start\":37291},{\"end\":37311,\"start\":37301},{\"end\":37691,\"start\":37689},{\"end\":37701,\"start\":37695},{\"end\":37895,\"start\":37887},{\"end\":38186,\"start\":38181},{\"end\":38197,\"start\":38190},{\"end\":38207,\"start\":38201},{\"end\":38496,\"start\":38491},{\"end\":38506,\"start\":38500},{\"end\":38785,\"start\":38780},{\"end\":38800,\"start\":38789},{\"end\":38812,\"start\":38804},{\"end\":39086,\"start\":39078},{\"end\":39099,\"start\":39090},{\"end\":39110,\"start\":39103},{\"end\":39440,\"start\":39432},{\"end\":39452,\"start\":39444},{\"end\":39464,\"start\":39456},{\"end\":39476,\"start\":39468},{\"end\":39487,\"start\":39480},{\"end\":39842,\"start\":39839},{\"end\":39852,\"start\":39846},{\"end\":39862,\"start\":39856},{\"end\":40186,\"start\":40177},{\"end\":40198,\"start\":40190},{\"end\":40386,\"start\":40380},{\"end\":40616,\"start\":40609},{\"end\":40627,\"start\":40620},{\"end\":40638,\"start\":40631},{\"end\":40931,\"start\":40921},{\"end\":40940,\"start\":40935},{\"end\":40950,\"start\":40944},{\"end\":40962,\"start\":40954},{\"end\":41327,\"start\":41319},{\"end\":41340,\"start\":41331},{\"end\":41351,\"start\":41344},{\"end\":41653,\"start\":41646},{\"end\":41666,\"start\":41657},{\"end\":41679,\"start\":41670},{\"end\":41690,\"start\":41683},{\"end\":41996,\"start\":41987},{\"end\":42010,\"start\":42000},{\"end\":42021,\"start\":42014},{\"end\":42035,\"start\":42025},{\"end\":42329,\"start\":42324},{\"end\":42340,\"start\":42333},{\"end\":42349,\"start\":42344},{\"end\":42577,\"start\":42571},{\"end\":42589,\"start\":42581},{\"end\":42597,\"start\":42593},{\"end\":42855,\"start\":42847},{\"end\":42865,\"start\":42859},{\"end\":43118,\"start\":43110},{\"end\":43129,\"start\":43122},{\"end\":43140,\"start\":43133},{\"end\":43433,\"start\":43425},{\"end\":43444,\"start\":43437},{\"end\":43454,\"start\":43448},{\"end\":43463,\"start\":43458},{\"end\":43475,\"start\":43467},{\"end\":43485,\"start\":43479},{\"end\":43763,\"start\":43756},{\"end\":43772,\"start\":43767},{\"end\":43781,\"start\":43776},{\"end\":44015,\"start\":44006},{\"end\":44025,\"start\":44019},{\"end\":44035,\"start\":44029},{\"end\":44044,\"start\":44039},{\"end\":44055,\"start\":44048},{\"end\":44065,\"start\":44059},{\"end\":44077,\"start\":44069},{\"end\":44089,\"start\":44081},{\"end\":44099,\"start\":44093},{\"end\":44111,\"start\":44103},{\"end\":44122,\"start\":44115},{\"end\":44465,\"start\":44460},{\"end\":44476,\"start\":44469},{\"end\":44489,\"start\":44480},{\"end\":44497,\"start\":44493},{\"end\":44507,\"start\":44501},{\"end\":44818,\"start\":44812},{\"end\":44826,\"start\":44822},{\"end\":44837,\"start\":44830},{\"end\":45191,\"start\":45182},{\"end\":45203,\"start\":45195},{\"end\":45212,\"start\":45207},{\"end\":45219,\"start\":45216},{\"end\":45231,\"start\":45223},{\"end\":45531,\"start\":45528},{\"end\":45543,\"start\":45535},{\"end\":45803,\"start\":45798},{\"end\":45815,\"start\":45807},{\"end\":45828,\"start\":45819},{\"end\":45841,\"start\":45832},{\"end\":45850,\"start\":45845},{\"end\":45861,\"start\":45854},{\"end\":45872,\"start\":45865},{\"end\":45884,\"start\":45876},{\"end\":46248,\"start\":46243},{\"end\":46257,\"start\":46252},{\"end\":46511,\"start\":46504},{\"end\":46524,\"start\":46515},{\"end\":46535,\"start\":46528},{\"end\":46548,\"start\":46539},{\"end\":46788,\"start\":46780},{\"end\":46799,\"start\":46792},{\"end\":46807,\"start\":46803},{\"end\":47052,\"start\":47044},{\"end\":47062,\"start\":47056},{\"end\":47074,\"start\":47066},{\"end\":47084,\"start\":47078},{\"end\":47096,\"start\":47088},{\"end\":47109,\"start\":47100},{\"end\":47120,\"start\":47113},{\"end\":47402,\"start\":47395},{\"end\":47415,\"start\":47406},{\"end\":47427,\"start\":47419},{\"end\":47437,\"start\":47431},{\"end\":47449,\"start\":47441},{\"end\":47461,\"start\":47453},{\"end\":47471,\"start\":47465},{\"end\":47482,\"start\":47475},{\"end\":47492,\"start\":47486},{\"end\":47863,\"start\":47859},{\"end\":47874,\"start\":47867},{\"end\":47887,\"start\":47878},{\"end\":47897,\"start\":47891},{\"end\":48198,\"start\":48193},{\"end\":48212,\"start\":48202},{\"end\":48221,\"start\":48216},{\"end\":48229,\"start\":48225},{\"end\":48238,\"start\":48233},{\"end\":48250,\"start\":48242},{\"end\":48526,\"start\":48516},{\"end\":48534,\"start\":48528},{\"end\":48700,\"start\":48686},{\"end\":48839,\"start\":48833},{\"end\":48851,\"start\":48843},{\"end\":48861,\"start\":48855},{\"end\":49117,\"start\":49105},{\"end\":49126,\"start\":49121},{\"end\":49137,\"start\":49130},{\"end\":49422,\"start\":49417},{\"end\":49665,\"start\":49661},{\"end\":49914,\"start\":49908},{\"end\":49922,\"start\":49918},{\"end\":49935,\"start\":49926},{\"end\":49944,\"start\":49939},{\"end\":49955,\"start\":49948},{\"end\":49966,\"start\":49959}]", "bib_entry": "[{\"attributes\":{\"id\":\"b0\",\"matched_paper_id\":2647907},\"end\":36444,\"start\":36085},{\"attributes\":{\"id\":\"b1\"},\"end\":36831,\"start\":36446},{\"attributes\":{\"id\":\"b2\",\"matched_paper_id\":18372371},\"end\":37143,\"start\":36833},{\"attributes\":{\"id\":\"b3\",\"matched_paper_id\":11830123},\"end\":37619,\"start\":37145},{\"attributes\":{\"id\":\"b4\",\"matched_paper_id\":12781727},\"end\":37866,\"start\":37621},{\"attributes\":{\"id\":\"b5\",\"matched_paper_id\":14494873},\"end\":38105,\"start\":37868},{\"attributes\":{\"id\":\"b6\"},\"end\":38432,\"start\":38107},{\"attributes\":{\"id\":\"b7\",\"matched_paper_id\":206986664},\"end\":38735,\"start\":38434},{\"attributes\":{\"id\":\"b8\",\"matched_paper_id\":1312251},\"end\":39003,\"start\":38737},{\"attributes\":{\"id\":\"b9\",\"matched_paper_id\":696189},\"end\":39379,\"start\":39005},{\"attributes\":{\"id\":\"b10\",\"matched_paper_id\":206849534},\"end\":39722,\"start\":39381},{\"attributes\":{\"id\":\"b11\",\"matched_paper_id\":206589859},\"end\":40147,\"start\":39724},{\"attributes\":{\"id\":\"b12\",\"matched_paper_id\":15216890},\"end\":40316,\"start\":40149},{\"attributes\":{\"id\":\"b13\",\"matched_paper_id\":2379541},\"end\":40556,\"start\":40318},{\"attributes\":{\"id\":\"b14\",\"matched_paper_id\":17951990},\"end\":40833,\"start\":40558},{\"attributes\":{\"id\":\"b15\",\"matched_paper_id\":12104564},\"end\":41237,\"start\":40835},{\"attributes\":{\"id\":\"b16\",\"matched_paper_id\":321256},\"end\":41581,\"start\":41239},{\"attributes\":{\"id\":\"b17\",\"matched_paper_id\":53895943},\"end\":41880,\"start\":41583},{\"attributes\":{\"id\":\"b18\",\"matched_paper_id\":2383859},\"end\":42303,\"start\":41882},{\"attributes\":{\"id\":\"b19\",\"matched_paper_id\":231748613},\"end\":42488,\"start\":42305},{\"attributes\":{\"id\":\"b20\",\"matched_paper_id\":184709},\"end\":42813,\"start\":42490},{\"attributes\":{\"id\":\"b21\",\"matched_paper_id\":112383},\"end\":43060,\"start\":42815},{\"attributes\":{\"id\":\"b22\",\"matched_paper_id\":9307872},\"end\":43369,\"start\":43062},{\"attributes\":{\"id\":\"b23\",\"matched_paper_id\":1889386},\"end\":43713,\"start\":43371},{\"attributes\":{\"id\":\"b24\",\"matched_paper_id\":15139693},\"end\":43975,\"start\":43715},{\"attributes\":{\"id\":\"b25\"},\"end\":44328,\"start\":43977},{\"attributes\":{\"id\":\"b26\"},\"end\":44413,\"start\":44330},{\"attributes\":{\"id\":\"b27\",\"matched_paper_id\":206500040},\"end\":44737,\"start\":44415},{\"attributes\":{\"id\":\"b28\",\"matched_paper_id\":6724907},\"end\":45117,\"start\":44739},{\"attributes\":{\"id\":\"b29\",\"matched_paper_id\":17366636},\"end\":45492,\"start\":45119},{\"attributes\":{\"id\":\"b30\",\"matched_paper_id\":7665907},\"end\":45747,\"start\":45494},{\"attributes\":{\"id\":\"b31\",\"matched_paper_id\":6639131},\"end\":46180,\"start\":45749},{\"attributes\":{\"id\":\"b32\",\"matched_paper_id\":15370864},\"end\":46473,\"start\":46182},{\"attributes\":{\"id\":\"b33\"},\"end\":46729,\"start\":46475},{\"attributes\":{\"id\":\"b34\",\"matched_paper_id\":8127319},\"end\":46994,\"start\":46731},{\"attributes\":{\"id\":\"b35\",\"matched_paper_id\":281452},\"end\":47328,\"start\":46996},{\"attributes\":{\"id\":\"b36\",\"matched_paper_id\":6617980},\"end\":47807,\"start\":47330},{\"attributes\":{\"id\":\"b37\",\"matched_paper_id\":9086338},\"end\":48133,\"start\":47809},{\"attributes\":{\"id\":\"b38\",\"matched_paper_id\":316800},\"end\":48487,\"start\":48135},{\"attributes\":{\"id\":\"b39\"},\"end\":48650,\"start\":48489},{\"attributes\":{\"id\":\"b40\"},\"end\":48813,\"start\":48652},{\"attributes\":{\"id\":\"b41\",\"matched_paper_id\":5703532},\"end\":49050,\"start\":48815},{\"attributes\":{\"id\":\"b42\",\"matched_paper_id\":2007767},\"end\":49371,\"start\":49052},{\"attributes\":{\"id\":\"b43\",\"matched_paper_id\":722572},\"end\":49588,\"start\":49373},{\"attributes\":{\"id\":\"b44\",\"matched_paper_id\":11038004},\"end\":49864,\"start\":49590},{\"attributes\":{\"id\":\"b45\",\"matched_paper_id\":6966507},\"end\":50194,\"start\":49866}]", "bib_title": "[{\"end\":36164,\"start\":36085},{\"end\":36499,\"start\":36446},{\"end\":36888,\"start\":36833},{\"end\":37203,\"start\":37145},{\"end\":37685,\"start\":37621},{\"end\":37883,\"start\":37868},{\"end\":38177,\"start\":38107},{\"end\":38487,\"start\":38434},{\"end\":38776,\"start\":38737},{\"end\":39074,\"start\":39005},{\"end\":39428,\"start\":39381},{\"end\":39835,\"start\":39724},{\"end\":40173,\"start\":40149},{\"end\":40376,\"start\":40318},{\"end\":40605,\"start\":40558},{\"end\":40917,\"start\":40835},{\"end\":41315,\"start\":41239},{\"end\":41642,\"start\":41583},{\"end\":41983,\"start\":41882},{\"end\":42320,\"start\":42305},{\"end\":42567,\"start\":42490},{\"end\":42843,\"start\":42815},{\"end\":43106,\"start\":43062},{\"end\":43421,\"start\":43371},{\"end\":43752,\"start\":43715},{\"end\":44456,\"start\":44415},{\"end\":44808,\"start\":44739},{\"end\":45178,\"start\":45119},{\"end\":45524,\"start\":45494},{\"end\":45794,\"start\":45749},{\"end\":46239,\"start\":46182},{\"end\":46500,\"start\":46475},{\"end\":46776,\"start\":46731},{\"end\":47040,\"start\":46996},{\"end\":47391,\"start\":47330},{\"end\":47855,\"start\":47809},{\"end\":48189,\"start\":48135},{\"end\":48829,\"start\":48815},{\"end\":49101,\"start\":49052},{\"end\":49413,\"start\":49373},{\"end\":49657,\"start\":49590},{\"end\":49904,\"start\":49866}]", "bib_author": "[{\"end\":36175,\"start\":36166},{\"end\":36186,\"start\":36175},{\"end\":36196,\"start\":36186},{\"end\":36203,\"start\":36196},{\"end\":36210,\"start\":36203},{\"end\":36514,\"start\":36501},{\"end\":36524,\"start\":36514},{\"end\":36532,\"start\":36524},{\"end\":36541,\"start\":36532},{\"end\":36552,\"start\":36541},{\"end\":36900,\"start\":36890},{\"end\":36911,\"start\":36900},{\"end\":36923,\"start\":36911},{\"end\":36932,\"start\":36923},{\"end\":37217,\"start\":37205},{\"end\":37226,\"start\":37217},{\"end\":37238,\"start\":37226},{\"end\":37251,\"start\":37238},{\"end\":37258,\"start\":37251},{\"end\":37269,\"start\":37258},{\"end\":37278,\"start\":37269},{\"end\":37289,\"start\":37278},{\"end\":37299,\"start\":37289},{\"end\":37313,\"start\":37299},{\"end\":37693,\"start\":37687},{\"end\":37703,\"start\":37693},{\"end\":37897,\"start\":37885},{\"end\":38188,\"start\":38179},{\"end\":38199,\"start\":38188},{\"end\":38209,\"start\":38199},{\"end\":38498,\"start\":38489},{\"end\":38508,\"start\":38498},{\"end\":38787,\"start\":38778},{\"end\":38802,\"start\":38787},{\"end\":38814,\"start\":38802},{\"end\":39088,\"start\":39076},{\"end\":39101,\"start\":39088},{\"end\":39112,\"start\":39101},{\"end\":39442,\"start\":39430},{\"end\":39454,\"start\":39442},{\"end\":39466,\"start\":39454},{\"end\":39478,\"start\":39466},{\"end\":39489,\"start\":39478},{\"end\":39844,\"start\":39837},{\"end\":39854,\"start\":39844},{\"end\":39864,\"start\":39854},{\"end\":40188,\"start\":40175},{\"end\":40200,\"start\":40188},{\"end\":40388,\"start\":40378},{\"end\":40618,\"start\":40607},{\"end\":40629,\"start\":40618},{\"end\":40640,\"start\":40629},{\"end\":40933,\"start\":40919},{\"end\":40942,\"start\":40933},{\"end\":40952,\"start\":40942},{\"end\":40964,\"start\":40952},{\"end\":41329,\"start\":41317},{\"end\":41342,\"start\":41329},{\"end\":41353,\"start\":41342},{\"end\":41655,\"start\":41644},{\"end\":41668,\"start\":41655},{\"end\":41681,\"start\":41668},{\"end\":41692,\"start\":41681},{\"end\":41998,\"start\":41985},{\"end\":42012,\"start\":41998},{\"end\":42023,\"start\":42012},{\"end\":42037,\"start\":42023},{\"end\":42331,\"start\":42322},{\"end\":42342,\"start\":42331},{\"end\":42351,\"start\":42342},{\"end\":42579,\"start\":42569},{\"end\":42591,\"start\":42579},{\"end\":42599,\"start\":42591},{\"end\":42857,\"start\":42845},{\"end\":42867,\"start\":42857},{\"end\":43120,\"start\":43108},{\"end\":43131,\"start\":43120},{\"end\":43142,\"start\":43131},{\"end\":43435,\"start\":43423},{\"end\":43446,\"start\":43435},{\"end\":43456,\"start\":43446},{\"end\":43465,\"start\":43456},{\"end\":43477,\"start\":43465},{\"end\":43487,\"start\":43477},{\"end\":43765,\"start\":43754},{\"end\":43774,\"start\":43765},{\"end\":43783,\"start\":43774},{\"end\":44017,\"start\":44004},{\"end\":44027,\"start\":44017},{\"end\":44037,\"start\":44027},{\"end\":44046,\"start\":44037},{\"end\":44057,\"start\":44046},{\"end\":44067,\"start\":44057},{\"end\":44079,\"start\":44067},{\"end\":44091,\"start\":44079},{\"end\":44101,\"start\":44091},{\"end\":44113,\"start\":44101},{\"end\":44124,\"start\":44113},{\"end\":44467,\"start\":44458},{\"end\":44478,\"start\":44467},{\"end\":44491,\"start\":44478},{\"end\":44499,\"start\":44491},{\"end\":44509,\"start\":44499},{\"end\":44820,\"start\":44810},{\"end\":44828,\"start\":44820},{\"end\":44839,\"start\":44828},{\"end\":45193,\"start\":45180},{\"end\":45205,\"start\":45193},{\"end\":45214,\"start\":45205},{\"end\":45221,\"start\":45214},{\"end\":45233,\"start\":45221},{\"end\":45533,\"start\":45526},{\"end\":45545,\"start\":45533},{\"end\":45805,\"start\":45796},{\"end\":45817,\"start\":45805},{\"end\":45830,\"start\":45817},{\"end\":45843,\"start\":45830},{\"end\":45852,\"start\":45843},{\"end\":45863,\"start\":45852},{\"end\":45874,\"start\":45863},{\"end\":45886,\"start\":45874},{\"end\":46250,\"start\":46241},{\"end\":46259,\"start\":46250},{\"end\":46513,\"start\":46502},{\"end\":46526,\"start\":46513},{\"end\":46537,\"start\":46526},{\"end\":46550,\"start\":46537},{\"end\":46790,\"start\":46778},{\"end\":46801,\"start\":46790},{\"end\":46809,\"start\":46801},{\"end\":47054,\"start\":47042},{\"end\":47064,\"start\":47054},{\"end\":47076,\"start\":47064},{\"end\":47086,\"start\":47076},{\"end\":47098,\"start\":47086},{\"end\":47111,\"start\":47098},{\"end\":47122,\"start\":47111},{\"end\":47404,\"start\":47393},{\"end\":47417,\"start\":47404},{\"end\":47429,\"start\":47417},{\"end\":47439,\"start\":47429},{\"end\":47451,\"start\":47439},{\"end\":47463,\"start\":47451},{\"end\":47473,\"start\":47463},{\"end\":47484,\"start\":47473},{\"end\":47494,\"start\":47484},{\"end\":47865,\"start\":47857},{\"end\":47876,\"start\":47865},{\"end\":47889,\"start\":47876},{\"end\":47899,\"start\":47889},{\"end\":48200,\"start\":48191},{\"end\":48214,\"start\":48200},{\"end\":48223,\"start\":48214},{\"end\":48231,\"start\":48223},{\"end\":48240,\"start\":48231},{\"end\":48252,\"start\":48240},{\"end\":48528,\"start\":48509},{\"end\":48536,\"start\":48528},{\"end\":48702,\"start\":48686},{\"end\":48841,\"start\":48831},{\"end\":48853,\"start\":48841},{\"end\":48863,\"start\":48853},{\"end\":49119,\"start\":49103},{\"end\":49128,\"start\":49119},{\"end\":49139,\"start\":49128},{\"end\":49424,\"start\":49415},{\"end\":49667,\"start\":49659},{\"end\":49916,\"start\":49906},{\"end\":49924,\"start\":49916},{\"end\":49937,\"start\":49924},{\"end\":49946,\"start\":49937},{\"end\":49957,\"start\":49946},{\"end\":49968,\"start\":49957}]", "bib_venue": "[{\"end\":37999,\"start\":37943},{\"end\":43226,\"start\":43188},{\"end\":44916,\"start\":44901},{\"end\":36253,\"start\":36210},{\"end\":36626,\"start\":36552},{\"end\":36977,\"start\":36932},{\"end\":37367,\"start\":37313},{\"end\":37720,\"start\":37703},{\"end\":37941,\"start\":37897},{\"end\":38259,\"start\":38209},{\"end\":38575,\"start\":38508},{\"end\":38842,\"start\":38814},{\"end\":39167,\"start\":39112},{\"end\":39539,\"start\":39489},{\"end\":39924,\"start\":39864},{\"end\":40211,\"start\":40200},{\"end\":40419,\"start\":40388},{\"end\":40684,\"start\":40640},{\"end\":41025,\"start\":40964},{\"end\":41389,\"start\":41353},{\"end\":41706,\"start\":41692},{\"end\":42062,\"start\":42037},{\"end\":42386,\"start\":42351},{\"end\":42641,\"start\":42599},{\"end\":42928,\"start\":42867},{\"end\":43186,\"start\":43142},{\"end\":43530,\"start\":43487},{\"end\":43824,\"start\":43783},{\"end\":44002,\"start\":43977},{\"end\":44350,\"start\":44330},{\"end\":44550,\"start\":44509},{\"end\":44899,\"start\":44839},{\"end\":45294,\"start\":45233},{\"end\":45611,\"start\":45545},{\"end\":45948,\"start\":45886},{\"end\":46316,\"start\":46259},{\"end\":46591,\"start\":46550},{\"end\":46852,\"start\":46809},{\"end\":47139,\"start\":47122},{\"end\":47555,\"start\":47494},{\"end\":47960,\"start\":47899},{\"end\":48291,\"start\":48252},{\"end\":48507,\"start\":48489},{\"end\":48684,\"start\":48652},{\"end\":48922,\"start\":48863},{\"end\":49201,\"start\":49139},{\"end\":49465,\"start\":49424},{\"end\":49710,\"start\":49667},{\"end\":50018,\"start\":49968}]"}}}, "year": 2023, "month": 12, "day": 17}