{"id": 209088548, "updated": "2022-02-01 16:07:17.626", "metadata": {"title": "A Physical Design Flow Against Front-Side Probing Attacks by Internal Shielding", "authors": "[{\"middle\":[],\"last\":\"Wang\",\"first\":\"Huanyu\"},{\"middle\":[],\"last\":\"Shi\",\"first\":\"Qihang\"},{\"middle\":[],\"last\":\"Nahiyan\",\"first\":\"Adib\"},{\"middle\":[],\"last\":\"Forte\",\"first\":\"Domenic\"},{\"middle\":[\"M.\"],\"last\":\"Tehranipoor\",\"first\":\"Mark\"}]", "venue": "IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems", "journal": "IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems", "publication_date": {"year": 2020, "month": null, "day": null}, "abstract": "Security-critical applications on integrated circuits (ICs) are threatened by probing attacks that extract sensitive information assisted with focused ion beam (FIB)-based circuit edit. Existing countermeasures, such as active shield, analog shield, and $t$ -private circuit, have proven to be inefficient and provide limited resistance against probing attacks without taking FIB capabilities into consideration. In this article, we propose an FIB-aware anti-probing physical design flow, which considers FIB capabilities and utilizes computer-aided design (CAD) tools, to automatically reduce the probing attack vulnerability of an IC’s security-critical nets with minimal extra design effort. The floor-planning and routing of the design are constrained by incorporating three new steps in the conventional physical design flow, so that security-critical nets are protected by internal shield nets with low overhead. Results show that the proposed technique can reduce the vulnerable area exposed to probing on security-critical nets by 100% with all critical nets fully protected for both advanced encryption standard (AES) and data encryption standard (DES) modules. The timing, area, and power overheads are less than 3% per module, which would be negligible in a system-on-chip (SoC) design.", "fields_of_study": "[\"Computer Science\"]", "external_ids": {"arxiv": null, "mag": "2987478323", "acl": null, "pubmed": null, "pubmedcentral": null, "dblp": "journals/tcad/WangSNFT20", "doi": "10.1109/tcad.2019.2952133"}}, "content": {"source": {"pdf_hash": "6f3c0964401dc772a262beb3afcb3a2064796178", "pdf_src": "IEEE", "pdf_uri": null, "oa_url_match": false, "oa_info": null}, "grobid": {"id": "4ad15a1de52d9e5f21b00f6684ec80d039c6ebd5", "type": "plain-text", "url": "s3://ai2-s2-pdf-extraction-prod/parse-results/s2orc_worker/6f3c0964401dc772a262beb3afcb3a2064796178.txt", "contents": "\nA Physical Design Flow Against Front-Side Probing Attacks by Internal Shielding\nOCTOBER 2020\n\nStudent Member, IEEEHuanyu Wang \nMember, IEEEQihang Shi \nStudent Member, IEEENahiyan Adib \nSenior Member, IEEEDomenic Forte \nFellow, IEEEMark M Tehranipoor \nA Physical Design Flow Against Front-Side Probing Attacks by Internal Shielding\n\nIEEE TRANSACTIONS ON COMPUTER-AIDED DESIGN OF INTEGRATED CIRCUITS AND SYSTEMS\n3910OCTOBER 202010.1109/TCAD.2019.29521332152\nSecurity-critical applications on integrated circuits (ICs) are threatened by probing attacks that extract sensitive information assisted with focused ion beam (FIB)-based circuit edit. Existing countermeasures, such as active shield, analog shield, and t-private circuit, have proven to be inefficient and provide limited resistance against probing attacks without taking FIB capabilities into consideration. In this article, we propose an FIB-aware anti-probing physical design flow, which considers FIB capabilities and utilizes computer-aided design (CAD) tools, to automatically reduce the probing attack vulnerability of an IC's security-critical nets with minimal extra design effort. The floor-planning and routing of the design are constrained by incorporating three new steps in the conventional physical design flow, so that security-critical nets are protected by internal shield nets with low overhead. Results show that the proposed technique can reduce the vulnerable area exposed to probing on securitycritical nets by 100% with all critical nets fully protected for both advanced encryption standard (AES) and data encryption standard (DES) modules. The timing, area, and power overheads are less than 3% per module, which would be negligible in a system-on-chip (SoC) design.Index Terms-Computer-aided design (CAD), focused ion beam (FIB), hardware security, probing attack, very large-scale integration (VLSI) physical design.0278-0070\n\nI. INTRODUCTION\n\nI N LIGHT of the increasing performance of integrated circuits (ICs), society's reliance on these electronic computing systems is deepening. Meanwhile, various software and hardware-based attacks are threatening the integrity and confidentiality of security-critical information stored in ICs, for instance cryptographic keys, firmware, communication credentials, device configuration, and private data. Solutions to protect against cyber and noninvasive physical attacks, such as buffer overflow and side channel analysis, have been Manuscript  widely explored; however, there is no sufficient investigation on countermeasures against physical probing attacks. In a probing attack [1], the internal wires of security-critical IC devices, such as smart cards, smart phones, military systems, and financial systems, are physically tapped to extract sensitive information. Even if the design is equipped with protection mechanisms, an attacker is still likely to bypass the protection and expose the signal nets carrying security-critical information through focused ion beam (FIB) systems [2]. FIB is a powerful circuit editing tool that can mill and deposit material on silicon dies with sub-10-nm level precision [3], [4]. Note that FIB's resolution is keeping pace with technology scaling; further, an attacker does not need to purchase a new one. Instead, FIBs are available to rent or purchase second-hand at low cost. In the Internet of Things (IoT) era, the threat from probing is aggravated since there will be a larger volume of low-end devices which are physically accessible.\n\nIn recent literature, various countermeasures, e.g., active shield [5], [6], analog sensors [7], [22], and t-private circuit [8], could be utilized to protect security-critical circuits against probing attacks. Active shield is the most common method, which detects milling by placing a dynamic signal carrying wire mesh as a protective shield on the top-most metal layer of the chip [5], [6], against front-side probing attacks which occur from the passivation layer and through upper metal layers. To detect the attack, a digital pattern is transferred through the shield wires, and the received signals are compared with the same pattern from the lower metal layers. If a mismatch at the comparator is detected, an alarm will be triggered, which results in a security action, such as erasure of sensitive information or shut-down of the device. Unfortunately, large area and design overhead and routing congestion are imposed on the design by active shield. Further, it can be easily disabled or bypassed by FIB's circuit edit capability as demonstrated in [11]- [13], [18], and [19]. Analog sensors, which measures analog parameters of the victim wires, such as capacitance and delay to detect the attack, can be an alternative approach to active shield. However, the main challenge for analog sensors is the low reliability due to process variation in advanced technology nodes. Weiner et al. [22] recently proposed CaLIAD to compensate the manufacturing variations. Ishai et al. [8] proposed the t-private circuit approach where a security-critical circuit is transformed so that at least t + 1 probes are required within one clock cycle to extract 1-bit information. Though t-private circuit increases the probing attack's difficulty and time cost, its O(t 2 ) times area overhead for design transformation is prohibitively expensive [9].\n\nExisting countermeasures are ad hoc with inefficient protection, are not designed to counter FIB-based attack, and require prohibitive area and design overhead [9]. Further, there is no holistic and efficient approach that can be easily incorporated into conventional application-specific IC (ASIC) design flow to protect security-critical circuits and nets from probing attack. Therefore in this article, we make the following major contributions to mitigate front-side probing attack. 1) A highly automated physical layout design flow that mitigates the threat of front-side probing attacks and is easy to integrate into existing electronic design automation (EDA) design flows. 2) An internal shield design that is not limited to top layer and full-die area shapes, and does not require extra pattern generator circuit, which dramatically reduces area and routing overhead. Because the shield is placed on an internal layer rather than the top layer, the shield is far more difficult to reverse engineer, bypass, or reroute. 3) Instead of dedicated pattern generators, the proposed shield design uses nets from existing functional design, selected by a shield net identification metric. A method is also developed to choose the best two layers for multilayer shield designs based on the technology specifications, which can provide better protection to securitycritical nets than single layer shield. 4) A metric is developed to identify security-critical nets that are most likely to be targeted for probing attacks, thus enabling a shield design that does not have to cover entire die area. Such nets include those directly connected to the security asset as well as nets in the asset's fanout from which sensitive information could be derived. 5) The proposed approach is evaluated on advanced encryption standard (AES) and data encryption standard (DES) modules using the exposed area (EA) metric proposed in [13]. Results show that the vulnerable area exposed to probing attacks decreases from 80% without shield to zero for FIB aspect ratio smaller than 5, i.e., all security-critical nets are completely protected or covered in AES and DES. The overhead is less than 3% for timing, power, and area. The rest of this article is organized as follows. In Section II, we provide background on probing attacks and related research. In Section III, we present our probing-aware design flow, including target/shield identification, shield layer selection, constrained layout, and EA calculation. The evaluation results are provided in Section IV. Finally, we conclude in Section V.\n\n\nII. BACKGROUND\n\n\nA. Assets\n\nAn asset is an information resource worth protecting from extraction by a would-be adversary [10]. Compromise of assets could cause tremendous damage to intellectual properties (IPs), digital privacy, and digital rights management. Examples of assets that are likely targeted in a probing attack include the following [9], [10]. 1) Keys: Private keys used for encryption/decryption operations. 2) Firmware and Bitstream: Instruction codes of microprocessors and configuration bitstream of field programmable gate arrays. 3) On-Device Protected Data: Sensitive information such as financial data, personal health information, passwords, etc. stored on chip. 4) Device Configuration: Configuration data that controls the access permission of a device or a module. 5) Cryptographic Random Number: Random numbers generated as keys, one-time pads, and initialization vectors.\n\n\nB. Typical Probing Attack Steps\n\nIt is vital that assessment of a protective design should be performed with full knowledge about the attack it intends to prevent. Typical probing attacks [9] consist of these following fundamental steps, all of which must be successful for the attack to succeed. 1) Decapsulation.\n\n2) Reverse engineering of the chip under attack.\n\n3) Locating the target wires. 4) Exposing the target wires to probes. 5) Extracting target information from signals collected with the probe. To expose the chip die, the chip package needs to be partially or fully removed depending on the occupied area of attacker's probing target wires. This is the first stage of most invasive physical attacks, which requires sufficient practice handling noxious chemicals, such as fuming nitric acid at 60 • C combined with acetone to remove plastic packages [1]. The attacker can also remove the copper plate mechanically from the back-side to decapsulate the chip without chemical etching.\n\nNext, detailed design information could be extracted through reverse engineering [2], which is the iterative process of delayering and imaging to figure out the structure and functionality of the chip. Identifying the assets nets, such as encryption keys, is one of the most important job for the step of reverse engineering in the case of probing attack. The probing target wires' (asset nets) locations can then be figured out by one-to-one correspondence between the netlist and layout. Reverse engineering can also help determine whether the cut of a wire would impact the asset extraction or not. Advanced automatic tools, such as ICWorks from Chipworks [16], pix2net from [20], and ChipJuice from Texplained [21], can perform netlist extraction automatically from images of each layer captured through optical or scanning electron microscopes (SEMs), which accelerates the reverse engineering process to a great degree.\n\nAfter the probing target nets have been identified by reverse engineering step, the next step is physically locating the metal wires associated with the target nets on the IC under attack. The main challenge of this step is that although the attacker has located the probing target wires on the sacrificial chips during reverse engineering process, the target coordinates obtained from previous experience may not guarantee the success of the attack because of the FIB kinetic errors. Further, the attacker has to find the coordinates of the point to mill at blindly on the chip under attack, because the attacker cannot expose anything on the targeted device beyond absolute necessity to help him locate target wires, which requires a precise-enough kinematic mount, and fiducial markers (i.e., visual points of reference on the device) to base these coordinates.\n\nWhen the probing target wires are located on the chip under attack, the next step is to expose the target wire and build a conducting path for probing without damaging any other parts of the circuitry, e.g., wires or vias surrounding the target wire, on the chip. Modern FIB systems, such as ZEISS ORION NanoFab which can edit out obstructing circuitry with 5-nm level precision, may be used to accomplish this step. First, a cavity is milled on the chip to expose target wires on lower layer as shown in Fig. 1(a). Then, the gas injection system (GIS) nozzle installed at the chip front-side surface will release platinum (Pt) or tungsten (W) gas, whose atoms could be deposited in the milling cavity to build a conducting path that can serve as electrical probe contacts under the help of high energy ion beam as shown in Fig. 1(b). FIB aspect ratio is an important parameter for FIB system which is defined as the ratio between the depth and diameter of the milling hole. The larger of the aspect ratio, the narrower of the hole. Modern FIB system, like ZEISS ORION NanoFab, can reach the aspect ratio of ∼30 for milling. However, for depositing, the metal gas atoms cannot get to the bottom of the milling hole if the hole is too narrow because these atoms may block the hole in the middle. So, a reasonable maximum aspect ratio for depositing is ∼10 which is also the maximum FIB aspect ratio considered in this article. The high resolution of modern FIB systems implies that many probing attack countermeasures can be eliminated by simply cutting a few wires. Note that an FIB equipped attack can typically place no more than 8 simultaneous probes to inject signals by a function generator or capture signals by a logic analyzer.\n\nThe last step of probing attack is to extract the asset signal. As long as the asset wires are properly exposed and connected to the conducting path without triggering any probing alarms from active or analog shields, the asset signals can be extracted using a probing station. There are few difficulties for this step. First, some software and hardware processes might need to be synchronized and completed before the asset is available. Further, the asset information may only exist for a very short period, e.g., only few clock cycles. In addition, if the chip has an internal clock source to prevent external manipulation, the attacker will need to either disable it or synchronize his own clock with it.\n\nEach step can have a number of alternative techniques where success with only one of them is necessary. For example, locating target wires in layout can be done by reverse engineering the design or with information from a similar IP core. Obfuscation can force the attacker to spend more time on this step, but if the IP is reused in another design it would allow attacker to circumvent it.\n\n\nC. Countermeasures and Limitations\n\nIn this section, we briefly review existing countermeasures against probing attacks, such as active sensor, analog sensor, charge sensor, and t-private circuit, and list their limitations.\n\nActive shield is so far the most widely used countermeasure against front-side probing attack. In this technique, a shield carrying signal patterns is placed on the top-most metal layer of the chip to detect FIB tampering. As shown in Fig. 2, a digital pattern is generated from a pattern generator, transmitted through the shield wires on top-most metal layer (upper purple), and then compared with a copy of itself transmitted from lower layer (lower purple). If an attacker mills through the shield wires, a hole is expected to cut one or more shield wires, thereby leading to a mismatch at the comparator and triggering an alarm to erase or stop generating sensitive information. Despite its popularity, the biggest problem for active shield is that they impose large design overheads, and are very vulnerable to attacks with advanced FIBs. Aspect ratio is a measure of the FIB performance defined as the ratio between milled hole depth and diameter [4]. A FIB with high aspect ratio can penetrate the shield with a hole of smaller diameter by leveraging the space between shield wires without damaging the shield wires, which is called bypass attack. FIB's depositing capability allows the attacker to implement reroute attack which makes the shield wire free of cutting by rerouting a copy path between identified equipotential points [11], [12]. When milling and depositing in nanometer scale and applied on silicon ICs, state-of-the-art FIB systems can reach an aspect ratio up to ∼10 [3]. Another problem with active shield method is that at least an entire metal routing layer must be dedicated to the shield, which does not go well with designs with tight cost margin, or designs with few routing layers.\n\nAn alternative approach to active shield is to construct an analog shield or sensor. Analog sensors monitor parametric disturbances, such as capacitance, RC delay, with the victim wires. The probe attempt detector (PAD) [7] uses capacitance measurement on selected security critical wires to detect additional capacitance introduced by a metal probe. Compared to active shields, analog sensors require less area overhead. The problem with analog sensors or shields is that analog measurements are less reliable due to process and environmental variations, a problem further exacerbated by feature scaling. Weiner et al. [22] recently proposed CaLIAD to compensate the manufacturing variations.\n\nThe t-private circuit technique is proposed in [8] based on the assumption that the number of concurrent probe channels that an attacker could use is limited, and exhausting this resource thereby deters an attack. In this technique, the circuit of a security-critical block is transformed so that at least t + 1 probes are required within one clock cycle to extract one bit of information. The major issue with t-private circuit is that the area overhead involved for the transformation is prohibitively expensive (O(t 2 )). In addition, generating and protecting the random signals from being disabled by FIB is nontrivial.\n\n\nD. Threat Model\n\nIn this article, we restrict our focus on electrical probing from the front-side, although our proposed technique also applies to back-side attacks that occur through the silicon substrate rather than top-level passivation targeting low-layer interconnects. Back-side optical probing and attacks targeting gate diffusion silicides are based on an entirely different mechanism and therefore out-of-scope of this article, which will likely need another future work to address. The objective of the adversary this article intends to deter is to extract assets stored in a device through probing attacks with advanced circuit edit tools such as a FIB. We further assume a strong attacker that has full layout information of the design from either reverse engineering or bribing a rogue employee in the foundry. The attack is assumed to be performed by milling a cavity to expose the sensitive net, depositing a conductor in the cavity to build a contact pad on chip surface, and probing at the pad to extract sensitive information. \n\n\nIII. ANTI-PROBING DESIGN FLOW\n\nOur objective is to develop an FIB-aware anti-probing physical design flow that incorporates automated security-aware floor-planning, cell placement, routing, and evaluation into the conventional flow in order to protect the security-critical nets against front-side probing attacks. We shall accomplish this by using a chip's internal functional nets as \"shield\" nets on upper layers to provide coverage for \"target\" nets (i.e., those carrying asset signals) on lower layers in the design. Another copy of shield nets will be routed in lower layers. Once at least one shield net on upper layer is cut off in an attack, the comparator will detect the mismatch between the signal on upper shield net and the one from lower layer. An alarm will be triggered to take the appropriate actions (e.g., terminate the operation of the chip or remove all asset information). Note that by leveraging the internal functional nets of the design itself for protection without adding any extra large circuitry, like the pattern generator and shielding circuit in active shield approach, the overhead of our approach is very low. In addition, when shield nets are placed within internal metal layers, they will be far more difficult for an attacker to bypass and reroute than dedicated shields, like active shield which typically resides at top metal layer, since the metal wires above the shield layer will be a huge obstacle to circumvent during the attack. Also, our approach can complement those PAD-based techniques, e.g., PAD can protect buses efficiently while our approach can protect PAD and other nonbus circuits. Further, the whole anti-probing physical design flow is implemented using computer-aided design (CAD) tools, which means the whole process could be completely automatic and uniform for different designs so that the design overhead to build the proposed internal shield will be very limited.\n\nThe overall workflow of our anti-probing physical design flow is shown in Fig. 3. It brings into conventional ASIC design flow three new steps. First, appropriate shield nets and target nets are identified for optimal protection against probing attack. Sections III-A and III-B will illustrate the detailed requirements and metrics to identify target nets and shield nets, respectively. User input includes asset information and threshold values to identify target nets and shield nets. Then, a comparator is inserted in the gate-level netlist of the original design to detect the mismatch. The comparator itself is also protected as potential probing target. The length of the comparator is determined by the number of shield nets needed for the dedicated design. Both inputs of the comparator are connected to the same source nets, but one is the exact shield net from upper layer, while the other one is the copy form lower layer. These will be implemented in the routing constraint step as illustrated in Section III-E. Selection of the best layer for single layer shield and the best two layers for multilayer shield will be discussed in Section III-C. Next, floor-planning and wire routing of the design are constrained to build the internal shield and provide protection on target nets against probing attacks. Details of these procedures are given in Sections III-D and III-E. At last, to evaluate the protection performance of shielded designs, the EA metric [13] with additional realistic optimization is used as discussed in Section III-F.\n\n\nA. Target Net Identification\n\nIn this section, we discuss how we identify the nets which are most likely to be targeted for probing. Nets that are connected to assets are the most likely to be probed. In addition, an attacker can also probe nets that are not directly connected to an asset, but still contain valuable information from which the asset can be derived. For example, let us assume that a two-input xor gate where one input is connected to an asset, e.g., encryption key, and the other input is connected to an input that an attacker can control, e.g., plain-text. Then the attacker can infer the asset by controlling the plain-text input to logic 0 and probing the output of the XOR gate because the asset input is consistent with the output when the other input of the XOR gate is logic 0. Therefore, in addition to nets that are directly connected to assets, other nets which can be exploited to extract the asset also need to be protected against probing attack. Since it is inefficient to protect all nets in an system-onchip (SoC), we develop a probing target identification metric to rank the nets according to their ability to leak asset information and therefore, the nets' likelihood of being targeted for probing can be deduced. Note that this target identification metric only applies for the possible information leakage (IL) from pure signal propagation and simple logic combinations. Those nets that can be used to derive asset information by complicated mathematics process, e.g., the nets in the last round of an encryption module for typical fault injection attacks are not covered in the target identification metric. To protect this type of nets against probing attack, these nets can be declared as a kind of special assets in the user input.\n\nOur anti-probing design flow first requires the designers to input the name of nets/ports where the asset is located, e.g., the name of key nets, as user input. Then our flow performs the target net identification technique to identify all nets which are likely to be targeted for probing attack. This technique utilizes a target score (f TS (i)) metric to quantify the likelihood of a net to be targeted in a probing attack. A higher value of target score indicates the net is more likely to be targeted in a probing attack. The attacker will prefer to probe those high target score nets because he/she can reveal more information with less effort on controlling signals from the net with higher target score. For each net i in the circuit\nf TS (i) = f IL (i) f PD (i) + 1 (1)\nwhere f IL (i) denotes IL and quantifies the amount of asset information leaked by observing net i, and f PD (i) indicates the difficulty to control the logic values of internal nodes to avoid the asset signal being muted and propagate it to net i based on the SCOAP controllability metric [15]. The +1 is to avoid 0 value at the denominator. A larger value of f IL (i) means more asset information can be leaked at net i. On the other hand, a larger f PD (i) value indicates that it is more difficult to propagate an asset signal to net i. Hence, a higher f TS (i) represents a higher likelihood of being targeted for probing. f IL (i) Calculation: IL of a net i quantifies how much sensitive information can be directly inferred if this net is probed and observed by the attacker. If k (0 or 1) is observed at net i, the f IL.k (i) is defined as the number of asset bits that net i is associated with divided by the number of possible logic combinations of the associated asset bits to output k at net i.\n\nThe overall IL f IL (i) is the weighted summation of f IL.0 (i) and f IL.1 (i) based on the probability of observing 0 and 1 at net i. f IL (i) is calculated for each net and is evaluated on a gateby-gate basis from input to output. We use a two-input AND gate, as shown in Fig. 4(a), as an example to present how f IL (i) is derived. Note that a similar process is used to evaluate f IL (i) for all types of standard cell gates. We classify the IL calculation into the following three categories.\n\nCase 1 (All Inputs Are Fanout Nets of Assets): In this case, all inputs of the gate are associated with the assets. Fig. 4(b) shows an example of case 1, where a0 and a1 are both asset signals. If an attacker probes the net Z0, then he/she can extract some information about the asset a0 and a1. We can use the following four equations to calculate the IL at Z0 (f IL (Z0)):\nf C,k (Z0) = Gate(m,n)=k f C,m (a0) × f C,n (a1) × (k, m, n ∈ {0, 1}) (2a) f B (Z0) = f B (a0) + f B (a1) (2b) f IL,k (Z0) = f B (Z0) f C,k (Z0) (2c) f IL (Z0) = 1 k=0 f IL,k (Z0) × f C,k (Z0) 2 f B (Z0) = f B (Z0) 2 f B (Z0)−1 (2d)\nwhere k, m, and n is the logic value: 0 or 1; Gate(m, n) = k is the gate function to make k at the output with two inputs m and n [m AND n = k, in Fig. 4(b) example]. Six numerical measures (k = 0 or 1) for input nets, e.g., a0 and a1, are considered as shown in Table I. All measures for asset nets (e.g., a0-a2) would be 1, while they would be 0 for nonasset nets that lie outside of any asset propagation path (e.g., n0-n2). These measures for nets in Fig. 4 FIG. 4 same, while the Gate function needs to update accordingly. However, the total f IL (Z0) (2d) is not a function of f C.0 (Z0) and f C.1 (Z0), which means the total IL calculation for different types of gates is a uniform function of the number of asset bits that the calculated net is associated with. Therefore, only (2d) is needed to calculate the total IL for any net in the circuit. If we want to know the specific IL when a specific value, 0 or 1, is observed at net i, all four equations (2a)-(2d) should be calculated.\n\nCase 2 (One of the Inputs Is Fanout Net of Assets): In this case, one input of the gate is associated with assets while the rest input is controllable by the attacker. Fig. 4(c) shows an example of case 2, where a2 is an asset net and n0 is a nonasset net that is not associated with any asset but can be controlled by an attacker. Here, the attacker can control n0 to observe a2 from Z1. Therefore, the IL for Z1 is the same as asset input a2. The IL measures for nets in Fig. 4(c) are shown in Table II.\n\n\nCase 3 (No Input Is Fanout Net of Assets):\n\nIn this case, both inputs of the gate are nonasset signals that are not associated with any asset. Fig. 4(d) shows an example of case 3, where n1 and n2 are nonasset nets. Therefore, the IL for Z2 is 0. The IL measures for nets in Fig. 4(d) are shown in Table II.\n\nCase 4 (One of the Inputs Is a Noncontrollable Constant Value): In this case, one input of the gate is associated with assets while the rest input is a constant value which cannot be controlled by attackers. There are two scenarios that may happen. One is that the constant value will propagate the asset signal to the output of the gate, e.g., if the constant value is 1 for an AND gate. In this case, the IL measures in Table I of the gate output would be the same with the asset input. The other situation is that the constant value will mute the asset signal,   e.g., if the constant value is 0 for an AND gate. Then, the IL value of the gate output would be the same with a nonasset signal which is 0.\n\nf PD (i) Calculation: The f PD (i) quantifies the difficulty to propagate asset information to net i using SCOAP combinational controllability metric (CC0 and CC1) [15]. When both inputs of a gate are fanout nets of asset which have nonzero IL value [e.g., Fig. 4(b)], there is no need to control other nets to propagate asset information to the output Z0. Therefore, the f PD (Z0) for Z0 is set to 0. When one of the inputs is fanout net of asset [e.g., a2 in Fig. 4(c)], to propagate a2's information to Z1, n0 needs to be 1. CC1 n0 measures the 1-controllability value for net n0. Assuming n0 is a primary input, the CC1 n0 would be 1 and f PD (Z1) = CC1 n0 = 1 for Z1. When net i is located n stages after asset signals, the f PD (i) is the summation of n 1/0-controllability values of the nonasset input of the gate for each stage to propagate asset information to next stage.\n\nTarget Score Calculation: Table III shows the target score calculation using (1) for Z0-Z2 in Fig. 4(b)-(d), assuming n0-n2 are nonasset primary inputs. In Fig. 4(d), since both inputs are nonasset nets without any IL, the target score for Z2 is 0. Fig. 5 and Table IV show the target score metric calculation on two sample circuits where different types of gates and inputs are mixed. a0-a7 are asset signals while n0-n6 are nonasset primary inputs. In Fig. 5(a), the IL value (f IL (i)) on a0 propagation path (a0-A0-B0-C0) stays at 1, the target score is decreasing due to the difficulty to control nets (n0 = 1, A1 = 1, and B1 = 0) to propagate asset information to next stage increasing. On the other hand, in Fig. 5(b), all inputs are asset signals and the IL values decrease stage by stage, which indicates they are less and less likely to be targeted in probing attack.\n\nTo implement the target identification metric on a large circuit, the target score needs to be calculated from primary inputs to the primary outputs. A flip-flop can be treated as a buffer which maintains the target score and IL values as its input. For those feedback nets, in the initialization stage, they can be simplified as nonasset nets with zero target score and IL values. With the process of target score calculation, they will finally be assigned an updated value for target score and IL. Considering the sensitivity of the asset and the acceptable protection overhead, we can set a threshold value for target score to identify nets which are most likely targeted for probing attack. Any net whose target score is larger than this threshold value needs to be protected accordingly against probing attack. It can be observed from Fig. 5 and Table IV that the target scores for {C0, C1} are much lower than the other nets closer to asset nets. Therefore, we may exclude {C0, C1} from our target nets list, which indicates that only two level nets after asset need to be protected against probing attack. By further study, the target score threshold could be set to 0.125 to guarantee the two level nets after assets are protected. So, we would recommend the designers to set the target score threshold to at most 0.125 to achieve the default protection against probing attacks or lower to involve more target nets if the budget allows.\n\nNote that the asset should be identified by the chip designer as a user input in the anti-probing design flow as shown in Fig. 3. If one of the assets is not identified in the user input, the target net identification metric would not be able to recognize the nets that can leak information of the unidentified asset.\n\nThis article is mainly focusing on the protection against probing attack. So, the target nets identification metric we proposed here is mainly developed to identify target nets in a probing attack. As a probing attacker, he/she tends to directly read out the critical information from the probed nets, which is the preferred nature of a probing attack without additional complicated analysis used in SAT attack or differential fault analysis (DFA). A universal target identification metric counting for a variety of attacks is out of the scope of this article because the principle to identify the target nets for various attacks differs a lot. Therefore, our metric is not intelligent enough to consider all types of attacks. For those nets that might be utilized to infer asset information through complicated mathematical analysis, e.g., the intermediate nets of an encryption/decryption process used in DFA technique, they are not covered by the target net identification metric. However, these nets can also be protected in our methodology by declaring them in the user input as part of \"asset\" or setting the target score threshold to 0 to protect all fan-out nets of the keys against probing attack.\n\n\nB. Shield Net Identification\n\nOne unique feature that distinguishes our proposed antiprobing physical design flow from previously proposed techniques is the adoption of internal functional nets of the design as shield to protect target nets against probing attack. Existing active shield countermeasures are vulnerable to bypass attacks and reroute attacks [9], [11], [12], [18], [19] because the shield at the top-most layer is relatively easy to access and manipulate. In addition, more advanced active shields require cryptographically secure pattern generators [5], which themselves are sources of vulnerability and additional overhead. In contrast, utilizing internal functional nets provides the following major advantages. First, they will be routed within internal layers of the chip and therefore far more difficult to bypass and reroute. Second, the design itself will generate these signals alleviating the need for pattern generation, which will save the major area overhead introduced by active shield pattern generation. In this design, we develop a technique for identifying which internal nets can be utilized as shielding nets (covering nets). We define the following five requirements along with associated metrics as follows.\n\n1) Target Score: The shield nets should not carry any asset information since they are not protected and could be probed. The prior target score approach can be inverted to identify nets that carry the least sensitive information. 2) Toggle Frequency: The shield nets should have a relatively high toggling rate so that an attacker cannot replace them with a constant value after cutting them. 3) Switching Probability: It should be difficult to predict the signals on shield nets, which requires the probability of the net being 1 or 0 to be balanced. 4) Controllability: The attacker should not have control over the shield nets. Otherwise, the shield can be replicated with the controlled value, allowing the attacker to freely perform the attack. The SCOAP controllability value [15] can be used for this feature and should be as high as possible. 5) Delay Slack: Using internal nets as shield nets should not impact the critical path delay and the design's performance. As discussed in the later sections, shield nets will need to be extended and moved to cover target nets in the design, which will hurt the timing of the paths that the shield net belongs to. Hence, they should not lie on critical paths. For each of the aforementioned shield requirements, a threshold value of corresponding metric should be determined to maximize the coverage on target nets and minimize the vulnerabilities and impacts from shield nets. The final shield candidate nets will be the intersection of the five net collections which satisfy the threshold values for each shield requirement.\n\n\nC. Best Shield Layer\n\nAfter appropriate shield nets are identified, the metal layer in the chip layout to route these shielding nets needs to be determined. In this article, we build two types of shield structures: 1) single layer shield and 2) two layer parallel shield. For single layer shield, We assume a milling scenario using FIB technology as shown in Fig. 6, where colored bars are used to represent cross sections of metal wires on different routing layers. For the sake of argument, assume target wires (red) in the figure are on layer n, shield wires (purple) on layer n + q, and the attacker wishes to probe at one of the wires on target layer n to extract sensitive information. The hollowedout cone (white) shown in the figure represents a cavity milled with FIB equipment. One known exploit on active shields is to create a reroute between identified equipotential points by circuit editing with FIB, so that the net would not become open when parts of the wires are removed [12]. This forces active shield designs to only use parallel wires with minimum spacing and widths [5] to maximize the attack complexity, because the shield with elbows (snake-like) may create a short path for reroute with a long section of the shield wire disabled.\n\nFrom a layout point of view, active or analog shield designers are interested in the scenario where the attacker would make a mistake and leave a detectable footprint. To minimize the effect of the milling process, the attacker is likely to place the milling cavity in the center of two adjacent shield wires as shown in Fig. 6. To avoid affecting the normal signal transmission of shield wires, the attacker will avoid completely or partially cutting any shield wires. Further, a minimum space, S s2h , is left between the shield wire and the milling cavity, as shown in Fig. 6, to minimize the effect of changed parasitic capacitance during the attack on the timing of shield wires. In order to account for the limitations of lithography and metalization as well, S s2h is set to the same value with the minimum distance between metal wires as provided by the design rule of the technology. In addition, because of the process variation, the shield wires may be wider or thinner than the ideal wire width. Hence, to guarantee the minimum space between the shield wire and the milling cavity, an additional process variation margin (M pv : typically 10% of the wire width) is added to the width of shield wire as shown in Fig. 6.\n\nThese restrictions create a maximal milling hole diameter limit on shield layer\nD hole < P s − W s − 2M pv − 2S s2h(3)\nwhere P s is the pitch size of shield layer, W s is the ideal width of shield wires, M pv is the process variation margin of shield wires, and S margin is the minimal space between the shield \nD hole = D s2t R FIB (4)\nwhere D s2t is the depth from shield layer to target layer, and R FIB is the aspect ratio of FIB, which is defined as the ratio between FIB depth D s2t and diameter D hole as shown in Fig. 6. Therefore, the maximum FIB aspect ratio that the shield could protect against, which is termed as shield security [19], can be modeled as\nR FIB,max = D s2t P s − W s − 2M pv − 2S s2h .(5)\nThe higher the shield security (R FIB,max ) value is, the better the single layer shield is. The shield security can vary depending on shield layer, target layer, width of shield wire, and other layout technology parameters. Therefore, different technology libraries might lead to different shield security and different best shielding layer through (5). Table V shows the shield security calculated from SAED 32-nm library. As we can see, shield layer 6 has the best shield security for target nets on layers 3 and 4, and also good for target on layers 1 and 2. Though shield layer 4 is better than layer 6 for target nets on layers 1 and 2 in terms of shield security, it requires to route all target nets within only two layers (layers 1 and 2) to take this advantage, which may cause serious routing congestion. Hence, layer 6 is the overall optimal shield layer with excellent shield security and sufficient space left for routing of target nets for single layer shield designs. Therefore, in our single layer internal shield implementation, shield nets are routed on metal 6 and target nets are routed under metal 4 (metal 4 included). Compared to the conventional active shield approach whose shield wires are routed on the top-most layer (metal 9), the shield security for the best case of active shield (target on metal 1, shield on metal 9) is only 3.26, which is still less secure than the worst case of internal shield on M6 (target on metal 4, shield on metal 6) whose shield security is 3.61. In addition, the internal shield routed on metal 6 is more resistant to reroute attack where a shield path is duplicated between two equipotential points, and bypass attack where the shield is bypassed by leveraging the space between adjacent shield wires, since the wires beyond shield layer (layers 7-9) become huge obstacles to the attack.\n\nShield security is a very simple and useful metric to determine the best layer for single layer shield. However, it might not be appropriate for multilayer shield structures, e.g., twolayer parallel shield, because adding an extra layer of shield might not increase the maximum FIB aspect ratio that the shield can protect against resulting in the same shield security value. Though multilayer shield might improve the protected ratio against a specific FIB, as long as this ratio is not 100% the shield security will not be improved because it requires full protection. Therefore, to determine which layers are good for two-layer parallel shield, we propose the shield coverage metric.\n\nLet us consider the two layer staggered parallel shield on M6 and M8 as shown in Fig. 7. The pitch size on M8 is twice of M6 as defined in SAED 32-nm library, and they have 50% offset to maximize the protection. The shield coverage is defined as\nCoverage = Protected Region Period = Period − Exposed Period .(6)\nThe period is the pitch size of the upper shield layer (P m8 ) because typically the upper layer has a larger pitch size than the lower layer. The exposed is the region on target wires that is free to probe without triggering the shield alarm, which can be calculated as\nExposed = 2 × E 1 + P upper P lower − 1 × E 2(7)\nwhere P upper and P lower are the pitch size of upper and lower shield layers (P m8 and P m6 in Fig. 7), and E 1 and E 2 are two types of exposed region as shown in Fig. 7) and are defined as\nE 1 = 1 2 P lower − 1 2 W upper + W lower − S lower + S upper − 1 2 D upper + D lower (8a) E 2 = P lower − W lower − 2S lower − D lower (8b)\nwhere W upper and W lower are the metal width of upper and lower shield layers (W m8 and W m6 ), S upper and S lower are the space between shield wire and milling cavity (S m8 and S m6 which can be determined by the minimal metal space defined by the technology design rules), and D upper and D lower are the milling cavity diameter on the upper and lower shield layers (D m8 and D m6 ) which can be calculated using (4). The higher of the shield coverage, the better of the two-layer parallel shield design. As illustrated in (7) and (8), the shield coverage depends on many factors defined by the technology and the selection of shield and target layers. Fig. 8 shows the shield coverage of different two-layer staggered parallel shield designs using SAED 32-nm library. From the figure, we can see that all two-layer shield designs perform better than the single layer shield on M6 design (black curve) especially when R FIB is high. Though the two-layer shield on M5 and M6 is theoretically optimal for shield coverage, it brings a practical issue, routing congestion, due to the small pitch size on M5. Therefore, the shield on M6 and M8 (second best in shield coverage) are implemented for evaluation in the later sections.\n\n\nD. Floor-Planning Constraints\n\nIn conventional design flows, CAD tools perform floorplanning to optimize timing, power, and area. In an original design as shown in Fig. 9(a), target nets and the blocks containing them (red) are distributed randomly throughout the design. It is neither easy nor efficient to protect them with such placement. It might also require more shield nets than available. A more advantageous approach is to constrain them into a regularly shaped region, e.g., a rectangle, as shown in Fig. 9(b). This can be implemented by enumerating all gates connected to target nets, and then creating a floorplan group to constrain their relative placements. The location of this floorplan group is chosen to remain as close to its original placement to reduce the impact on performance. The optimal dimensions of this floorplan group are found by extracting all gates and nets involved into a sub-layout where only these gates and nets are placed and routed.\n\nThe comparator is used to detect the attack by comparing the shield signal from upper layer and another copy from lower layer. So the comparator nets should also be protected like target nets because if these nets are tampered to maintain a static value the testability of the shield nets will be compromised. Hence, the comparator gates (green) are constrained in a floorplan group besides the target block as shown in Fig. 9(d). The comparator is XNOR based, which is designed to output 1 when there are no attacks, and optimized by design compiler for less area.\n\nUnlike target nets, we divide the gates connected to shield nets into two separate floorplan groups: 1) shield nets driver group and 2) shield nets load group as shown in Fig. 9(c). Our proposed shield net identification metric ensures that the performance overhead due to our constrained floor-planning is minimal. Both shield nets driver group and load group (blue) are constrained at opposite ends of the expected shielding area (target and comparator block) as shown in Fig. 9(d), so that routing of shield nets crosses the target area and therefore provides vertical protection from milling/probing. The shield nets load group should be placed at the comparator's side. So that the received signals from shield nets could be compared in the comparator. The driver and load gates of the shield nets are buffers. Larger buffers are used for drivers to provide better driving capability for the long shield nets.\n\n\nE. Routing Constraints\n\nIn addition to creating floor-planning constraints, wirerouting constraints are also necessary to protect the device against probing attacks with large aspect ratio FIB. Aspect ratio of FIB is defined as the ratio between depth D and diameter d, as shown in Fig. 10, of a milled cavity and is an important measure of FIB performance [13]. A larger aspect ratio results in a milling cavity of smaller diameter on the top-most exposed layers, and therefore has less impact on the protective circuitry. Section III-C has revealed the best shield layers for single layer shield design and two-layer parallel shield design to maximize the protection against probing attack. Further, routing target nets in lower layer can also increase the chance to be protected from other nonshield internal function nets in the design. In this article, we route shield nets on M6 (M9 is the top layer) for single layer shield design, route shield nets on M6 and M8 for two-layer parallel shield design, and route target nets and comparator nets under M4 (M4 included) to get an optimal protection as shown in Fig. 10. Further, another copy of the shield nets, which is the other branch of the driving buffers of the shield nets, are also routed under M4 to be compared with the genuine shield nets on the upper layers at the comparator.\n\n\nF. Exposed Area Calculation\n\nTo assess the design's vulnerability to probing attacks, Shi et al. [13] proposed an EA metric by assuming that a complete cut of one shield wire is required for the detection of the attack. However, it is too conservative in several aspects. The first is assuming only complete cuts will be sufficient for detection. In reality, as soon as a minimum cross section of a cut wire to ensure correct signal transmission on the shield wires is violated, the attack is likely detected by active shield. Further, even if the milling cavity does not touch the shield wires, the changed parasitic capacitance due to the close distance between the shield wires and the milling cavity could possibly result in significant delays on shield wires especially in the low power designs, and thus trigger the alarm of an active shield by violating the setup time of flip flops. In addition, the attackers will probably not try to challenge the sensitivity of the shield. They will always set a margin for the potential timing violation, and also the FIB errors or operation mistakes. So, a space margin between the shield and the milling hole is necessary for attackers to improve the attack success rate. A more realistic model for detection is shown in Fig. 6, i.e., the probing attack can be detected if the center of milling exists within d faredge from the far edge of the shield wire, where\nd faredge = D s2t 2R FIB + W s + S s2h + M pv(9)\nwhere D s2t , R FIB , W s , S margin , and M pv are defined in Section III-C. Equation (9) shows the possibility to find the area which milling center should not fall inside. We term this area the milling exclusion area (MEA). The desired EA will be its complement projected on the target layer. Fig. 11 shows how the EA can be found for any given target wire and covering wires on higher layers which are capable of projecting the MEA. Assuming the white region is the targeted wire at lower layer of a layout and the green and purple regions are the covering wires at upper layers above the targeted wire, the shaded region is the MEA, which indicates that if the milling center falls in this area then the attack will be detected. Hence, the complement area of MEA is the desired EA that will not cause any risk to be detected. The EA can vary according to the different aspect ratio of FIB, since the diameter of the cavities milled by FIB with different aspect ratio is different. Larger EA in the design represents more vulnerable to probing attacks.\n\n\nIV. EVALUATION\n\nIn this section, the proposed FIB-aware anti-probing physical design flow is evaluated to find out how efficient the design flow can be and how much area in the design is vulnerable to probing attacks. For this purpose, layout of AES and DES crypto-cores are selected for the evaluation of the proposed design flow.\n\n\nA. Implementation of Proposed Design Flow\n\nThe DES and AES modules used are from OpenCores [14]. They are described in register-transfer level (RTL) code and synthesized using Synopsys Design Compiler with Synopsys SAED 32-nm technology library. The layout of AES and DES modules are generated and constrained using Synopsys IC Compiler. The asset in the AES and DES modules is taken to be the encryption key (128 bits for AES and 56 bits for DES), which is hardcoded in the design. The target score metric illustrated in Section III-A is used to identify the probing target nets in the AES and DES modules. The target score threshold value is set to 0.125 (target score for asset net is 1, for nonasset net is 0), which results in nets within two levels after the asset nets being identified as probing target nets. Hence, 384 nets for AES and 200 nets for DES, including key nets are probing target nets in the two designs. Further, gates connected to target nets are grouped and reshaped into a rectangular target block as shown in Fig. 12 (red). In addition, a 64-bit comparator is inserted in the AES and DES designs. Comparator gates are also grouped and reshaped into a rectangular block besides target gates block as shown in Fig. 12 (green). Table VI shows the metrics and threshold values used to identify shield nets in AES module to cover target block. The Min. and Max. columns shows the minimum and maximum value measured in the design for each metric. The Best column indicates the optimal value as shield net for each metric. The optimal value for the metric of shield nets are the minimum values of target score and delay slack; and maximum values of Togg. Rate, CC0, and CC1. The Percentage column presents percentage of all nets that are picked for each metric. The Threshold column indicates the threshold values for each metric, which are determined to offer a balanced tradeoff between security and overhead. Hence, 136 nets in AES module and 118 nets in DES module, which meet all requirements of shield metrics, are identified as shield candidate nets for both designs. The final number of shield nets used for building the internal shield depends on the area on chip that needs to be protected against probing attack and the structure of the shield (single layer or two-layer). In our implementation, 64 and 56 shield nets are used to build the single layer internal shield for AES and DES, respectively. Therefore, in AES module, 64 driver gates and 64 load gates connected to the shield nets are reshaped into two groups, respectively, and placed at the opposite ends of target and comparator block as shown in Fig. 12 (yellow). Fig. 13 shows the routing of target nets [ Fig. 13(a)], shield nets [ Fig. 13(b)], and their layer distribution [ Fig. 13(c) and (d)] in the AES layout. Target nets, comparator nets, and shield nets copy are constrained in the reshaped target and comparator block and routed under M4 as discussed in Section III-E. Most shield nets are routed on M6 to provide optimal coverage.\n\nIn addition to the single layer internal shield designs, twolayer staggered parallel shield [18], which utilizes two routing layers to build the parallel shield with some offset between different layers, can provide better protection. Fig. 14(a) shows an example of the two-layer staggered shield on M6 and M8.  The pitch size on M8 is 2 times of the pitch size on M6 in SAED 32-nm library, which results in that the shield density on M8 being half of the shield density on M6. The 50% offset is set between the shield wires on M6 and M8 to maximize the protection. Fig. 14(b) shows the placement of target gates (red), comparator gates (green), and shield gates (yellow). Fig. 14(c)-(e) shows the routing of target nets, shield nets on M6, and shield nets on M8, respectively.\n\nBesides the baseline single layer shield design and two-layer parallel shield design as illustrated above, we also implement four extra different designs for AES and DES, respectively, to show the high efficiency of our anti-probing physical design    Fig. 14. Design no. 6 is the conventional active shield design with a lightweight Simon cipher inserted as the shield signal pattern generator [5]. Fig. 15 shows the diagram of a conventional active shield [ Fig. 15(a)] and the layout of the implemented active shield on AES [ Fig. 15(b)]. The number of total gates, target nets, and target gates for different designs are listed in the third, fourth, and fifth columns of Table VIII.  Table VIII also shows the timing, power, area and routing overhead of all these designs compared to the original AES and DES without any constraints. Note that design nos. 2 and 5 have the same number of total gates, target nets, and target gates, but they are implemented with different shield structure as shown in Table VII. As a result, their overhead is different. As we can see from the table, the overhead of the baseline single layer shield (design no. 2) is less than 3% for both AES and DES in timing, power, and area. In addition, the timing, power, and area overhead of all internal shield approaches (design nos. [2][3][4][5] are all less than 6% even with lower target threshold (design no. 3) or including fault injection target nets (design no. 4), which indicates that even if we increase our security standard to protect more sensitive nets against probing attack, the overhead is still acceptable and not increased too much. Further, if considering the overhead to an SoC, this amount of overhead could be completely ignored since AES or DES module is just a very small portion in an SoC. However, the conventional active shield approaches (design no. 6) have ∼400% overhead in power, area, and routing, which is much larger than our internal shield designs, because it requires the insertion of shield signal pattern generator and other supporting circuitry, e.g., FSM.\n\n\nB. Exposed Area\n\nThe proposed internal shielding approach against probing attack is evaluated by the EA metric illustrated in Section III-F. Fig. 16(a) and (b) shows the normalized EA of all types of designs in Table VII for AES [ Fig. 16(a)] and DES [ Fig. 16(b)]. The EA is calculated across FIB aspect ratio from 1 to 10. As the FIB aspect ratio increases, the EA for all designs will also increase since d faredge decreases with larger FIB aspect ratio as shown in (9), which results in smaller MEA and thus larger EA. By using the proposed anti-probing design flow, the EA of all internal shield designs (design nos. [2][3][4][5] can be reduced to 0 for both AES and DES when the FIB aspect ratio is low. Even with the advanced FIB (aspect ratio is 10), the EA of baseline single layer shield (design no. 2) and two-layer shield (design no. 5) can be reduced at least to 5% and 2%, respectively, for both AES and DES. Fig. 16(c) and (d) shows the percentage of fully protected target nets for all designs. We define a net that is fully protected as one that does not have any EA. From Fig. 16(c) and (d), almost 100% of target nets for all internal shield designs (design nos. [2][3][4][5] are fully protected when R FIB ≤ 6, while less than 20% of target nets are fully protected for original AES and DES designs when R FIB = 6. With the advanced FIB, there are still 50% and 60% of target nets fully protected under two-layer staggered shield (design no. 5) for AES and DES, respectively, which is about five times more than the original AES and DES designs. For design nos. 2-4 with same single layer shield protection but different target nets configuration and increasing overhead as shown in Table VIII, Fig. 16(c) and (d) shows that they have similar security performance which indicates that our internal shield design flow can provide guaranteed protection with different target nets configuration. Compared with internal shield designs, conventional active shield designs (design no. 6) can only reduce the EA to ∼40% and increase the number of fully protected nets by about two times, which is not efficient as shown in Fig. 16(a)-(d).\n\n\nV. CONCLUSION\n\nIn this article, we presented the FIB-aware anti-probing physical design flow, which incorporates three security-critical steps in the conventional physical design flow. The floorplanning and routing of the design are constrained to provide coverage on asset nets through internal shield. Evaluations on AES and DES modules show that the total vulnerable EA to probing attack of the anti-probing design can be decreased by 100% compared to original design with all target nets fully protected, while the performance of the conventional active shield approach is inefficient. In addition, the general overhead of all internal shield designs are less than 6%, which can be totally ignored in an SoC.\n\nMoreover, due to the unavoidable and stochastic wire shift, process variation, and probe tip shift, the effective probing area will shrink further, which makes the probe-able target area on the chip even more limited. When FIB aspect ratio is high, even if all probe-able asset nets could be compromised, there are still considerable asset nets (>50%) that are fully protected. For long-bit assets like keys, extracting the remaining asset information is still exponentially difficult. In the future work, we will apply our anti-probing design flow to SoCs which contain more types of asset needing to be protected and propose effective countermeasure against back-side probing attack.\n\n2154 Fig. 1 .\n21541(a) FIB deposits platinum in the milling cavity to build conducting path from target wire. (b) Deposited conducting path serves as electrical probe contact.\n\nFig. 2 .\n2Basic working principle of active shield and bypass attack on active shield.\n\nFig. 3 .\n3Overall FIB-aware anti-probing physical design flow.\n\nFig. 5 .\n5Target score metric sample circuits. a0-a7 are asset signals. n0-n6 are non-asset signals.\n\nFig. 6 .\n6Calculations for shield security and d faredge .\n\nFig. 7 .\n7Section view of a two layer staggered parallel shield.\n\nFig. 8 .\n8Shield coverage of different shield designs in SAED 32-nm library.\n\nFig. 9 .\n9(a) Irregular blocks (red) of sensitive target nets. (b) Reshape the sensitive target blocks to one regular rectangle block (red), shield candidate block (blue), and comparator block (green). (c) Shield gates (blue) are divided into shield nets driver block and shield nets load block. (d) Shield gates are placed surrounding the target and comparator blocks which will be covered by shield nets.\n\nFig. 10 .\n10Routing layer constraints for target and shield nets.\n\nFig. 11 .\n11EA calculation.Fig. 12. Grouped and reshaped target gates, comparator gates, and shield gates in AES.\n\nFig. 13 .\n13(a) AES shield gates (yellow), target gates (red), and highlighted target nets under M4 (white). (b) AES shield gates (yellow) and highlighted shield nets on M6 (white). (c) Target nets layer distribution. (d) Shield nets layer distribution.\n\nFig. 14 .\n14(a) Diagram of two-layer staggered shield on M6 and M8. (b) Placement of target gates (red), comparator gates (green), and shield gates (yellow). Routing of (c) target nets, (d) shield nets on M6, and (e) shield nets on M8.\n\nFig. 15 .\n15(a) Diagram of a conventional active shield. (b) Layout of the implemented conventional active shield on AES.\n\nFig. 16 .\n16EA in (a) AES and (b) DES. Percentage of fully protected target nets in (c) AES and (d) DES.\n\n\nreceived April 25, 2019; revised July 15, 2019 and October 1, 2019; accepted October 13, 2019. Date of publication November 7, 2019; date of current version September 18, 2020. This work was supported in part by NSF under Project 1717392, in part by SRC under Grant 2769.001, and in part by AFOSR MURI under Project FA9550-14-1-0351. This article was recommended by Associate Editor C. H. Chang. (Corresponding author: Huanyu Wang.) The authors are with the Department of Electrical and Computer Engineering, University of Florida, Gainesville, FL 32611 USA (e-mail: huanyuwang@ufl.edu; qihang.shi@ufl.edu; adib1991@ufl.edu; dforte@ece.ufl.edu; tehranipoor@ece.ufl.edu). Digital Object Identifier 10.1109/TCAD.2019.2952133\n\nTABLE I MEASURES\nITO CALCULATE IL TABLE II IL MEASURES FOR NETS IN\n\nTABLE III TARGET\nIIISCORE CALCULATION FOR NETS INFIG. 4\n\nTABLE IV TARGET\nIVSCORE CALCULATION FOR NETS IN FIG. 5\n\nTABLE V SHIELD\nVSECURITY IN SAED 32-nm LIBRARY wire and the milling cavity which can be determined by the minimal space between metal wires defined by the technology design rule. The milling hole diameter is determined by\n\nTABLE VI THRESHOLD\nVIVALUES FOR SHIELD NETS IDENTIFICATION IN AES\n\nTABLE VII DESCRIPTION\nVIIOF IMPLEMENTED DESIGNS FOR AES AND DES\n\nTABLE VIII CONFIGURATION\nVIIIAND OVERHEAD OF DIFFERENT AES AND DES DESIGNS flow.Table VIIshows the description of implemented six different designs for AES and DES. Design no. 1 is the original design using conventional place and route flow without any protection against probing attack. Design no. 2 is the baseline single layer shield on M6 as illustrated before. Design no. 3 decreases the target score threshold from 0.125 to 0.01, which involves more target nets protected under the internal shield. Design no. 4 includes those common fault injection target nets in the asset declaration, so that the nets vulnerable to fault injection attack are also protected under the shield. Design no. 5 is the two-layer staggered parallel shield as shown in\nHe is currently a Post-Doctoral Associate with the\nPhysical attacks on tamper resistance: Progress and lessons. S Skorobogatov, Proc. 2nd ARO Spectr. Workshop Hardw. Assurance. 2nd ARO Spectr. Workshop Hardw. AssuranceWashington, DC, USAS. Skorobogatov, \"Physical attacks on tamper resistance: Progress and lessons,\" in Proc. 2nd ARO Spectr. Workshop Hardw. Assurance, Washington, DC, USA, 2011, pp. 1-16.\n\nA survey on chip to system reverse engineering. S E Quadir, ACM J. Emerg. Technol. Comput. Syst. 331S. E. Quadir et al., \"A survey on chip to system reverse engineering,\" ACM J. Emerg. Technol. Comput. Syst., vol. 33, no. 1, 2016, Art. no. 6.\n\nSub-10-nm nanolithography with a scanning helium beam. V Sidorkin, E Veldhoven, E V D Drift, P Alkemade, H Salemink, D Maas, J. Vacuum Sci. Technol. B. 274V. Sidorkin, E. Veldhoven, E. V. D. Drift, P. Alkemade, H. Salemink, and D. Maas, \"Sub-10-nm nanolithography with a scanning helium beam,\" J. Vacuum Sci. Technol. B, vol. 27, no. 4, pp. 18-20, 2009.\n\nFocused helium ion beam deposited low resistivity cobalt metal lines with 10 nm resolution: Implications for advanced circuit editing. H Wu, J. Mater. Sci. Mater. Electron. 252H. Wu et al., \"Focused helium ion beam deposited low resistivity cobalt metal lines with 10 nm resolution: Implications for advanced circuit editing,\" J. Mater. Sci. Mater. Electron. vol. 25, no. 2, pp. 587-595, 2014.\n\nCryptographically secure shields. J.-M Cioranesco, Proc. IEEE Int. Symp. Hardw. Oriented Security Trust (HOST). IEEE Int. Symp. Hardw. Oriented Security Trust (HOST)J.-M. Cioranesco et al., \"Cryptographically secure shields,\" in Proc. IEEE Int. Symp. Hardw. Oriented Security Trust (HOST), May 2014, pp. 25-31.\n\nDesign of monitor and protect circuits against FIB attack on chip security. M Ling, L Wu, X Li, X Zhang, J Hou, Y Wang, Proc. 8th Int. Conf. Comput. Intell. Security (CIS). 8th Int. Conf. Comput. Intell. Security (CIS)M. Ling, L. Wu, X. Li, X. Zhang, J. Hou, and Y. Wang, \"Design of monitor and protect circuits against FIB attack on chip security,\" in in Proc. 8th Int. Conf. Comput. Intell. Security (CIS), Nov. 2012, pp. 530-533.\n\nThe low area probing detector as a countermeasure against invasive attacks. M Weiner, S Manich, R Rodríguez-Montañés, G Sigl, IEEE Trans. Very Large Scale Integr. (VLSI) Syst. 262M. Weiner, S. Manich, R. Rodríguez-Montañés, and G. Sigl, \"The low area probing detector as a countermeasure against invasive attacks,\" IEEE Trans. Very Large Scale Integr. (VLSI) Syst., vol. 26, no. 2, pp. 392-403, Feb. 2018.\n\nPrivate circuits: Securing hardware against probing attacks. Y Ishai, A Sahai, D Wagner, Advances in Cryptology-CRYPTO, D. Boneh. Berlin, GermanySpringerY. Ishai, A. Sahai, and D. Wagner, \"Private circuits: Securing hard- ware against probing attacks,\" in Advances in Cryptology-CRYPTO, D. Boneh, Ed. Berlin, Germany: Springer, 2003, pp. 463-481.\n\nProbing attacks on integrated circuits: Challenges and research opportunities. H Wang, D Forte, M Tehranipoor, Q Shi, IEEE Des. Test. 345H. Wang, D. Forte, M. Tehranipoor, and Q. Shi, \"Probing attacks on integrated circuits: Challenges and research opportunities,\" IEEE Des. Test., vol. 34, no. 5, pp. 63-71, Oct. 2017.\n\nBuilding a Secure System Using TrustZone Technology. ARM IncCambridge, U.K., AccessedBuilding a Secure System Using TrustZone Technology, ARM Inc., Cambridge, U.K., Accessed. Jul. 13, 2017.\n\nFREUD applications of FIB: Invasive FIB attacks and countermeasures in hardware security devices. V Ray, Proc. East Coast Focused Ion Beam User Group Meeting. East Coast Focused Ion Beam User Group MeetingV. Ray, \"FREUD applications of FIB: Invasive FIB attacks and coun- termeasures in hardware security devices,\" in Proc. East Coast Focused Ion Beam User Group Meeting, Feb. 2009, pp. 2-17.\n\nDeconstructing a 'Secure' Processor. C Tarnovsky, C. Tarnovsky. (2013). Deconstructing a 'Secure' Processor. Accessed: Nov. 14, 2019. [Online]. Available: https://www.youtube.com/ watch?v=w7PT0nrK2BE\n\nA layoutdriven framework to assess vulnerability of ICs to microprobing attacks. Q Shi, N Asadizanjani, D Forte, M M Tehranipoor, Proc. IEEE Int. Symp. Hardw. Oriented Security Trust. IEEE Int. Symp. Hardw. Oriented Security TrustMcLean, VA, USAQ. Shi, N. Asadizanjani, D. Forte, and M. M. Tehranipoor, \"A layout- driven framework to assess vulnerability of ICs to microprobing attacks,\" in Proc. IEEE Int. Symp. Hardw. Oriented Security Trust, McLean, VA, USA, May 2016, pp. 155-160.\n\n. ) Aes (rijndael, Ip Core, AES (Rijndael) IP Core. Accessed: Nov. 14, 2019. [Online]. Available: https://opencores.org/projects/aes_core\n\nSCOAP: Sandia controllability/observability analysis program. L H Goldstein, E L Thigpen, Proc. 17th Design Autom. Conf. 17th Design Autom. ConfMinneapolis, MN, USAL. H. Goldstein and E. L. Thigpen, \"SCOAP: Sandia controllabil- ity/observability analysis program,\" in Proc. 17th Design Autom. Conf., Minneapolis, MN, USA, Jun. 1980, pp. 190-196\n\n. Chipworks, Accessed, Chipworks. Accessed: Nov. 14, 2019. [Online]. Available: http://www.techinsights.com/\n\nIntegrated circuit protection device and method. R Cole, J Yakura, WO Patent WO1 997 036. 326R. Cole and J. Yakura, \"Integrated circuit protection device and method,\" WO Patent WO1 997 036 326, Feb. 10, 1997.\n\nA Comprehensive analysis on vulnerability of active shields to tilted microprobing attacks. Q Shi, H Wang, N Asadizanjani, M M Tehranipoor, D Forte, Proc. Asian Hardw. Oriented Security Trust Symp. (AsianHOST). Asian Hardw. Oriented Security Trust Symp. (AsianHOST)Hong KongQ. Shi, H. Wang, N. Asadizanjani, M. M. Tehranipoor, and D. Forte, \"A Comprehensive analysis on vulnerability of active shields to tilted microprobing attacks,\" in Proc. Asian Hardw. Oriented Security Trust Symp. (AsianHOST), Hong Kong, 2018, pp. 98-103.\n\nProbing assessment framework and evaluation of antiprobing solutions. H Wang, Q Shi, D Forte, M M Tehranipoor, IEEE Trans. Very Large Scale Integr. (VLSI) Syst. 276H. Wang, Q. Shi, D. Forte, and M. M. Tehranipoor, \"Probing assess- ment framework and evaluation of antiprobing solutions,\" IEEE Trans. Very Large Scale Integr. (VLSI) Syst., vol. 27, no. 6, pp. 1239-1252, Jun. 2019.\n\n. Pix2net, Accessed, Pix2Net. Accessed: Nov. 14, 2019. [Online]. Available: http://micronetsol.net/pix2net-software/\n\n. Chipjuice, Accessed, ChipJuice. Accessed: Nov. 14, 2019. [Online]. Available: https://www.texplained.com/about-us/chipjuice-software/\n\nA calibratable detector for invasive attacks. M Weiner, W Wieser, E Lupon, G Sigl, S Manich, IEEE Trans. Very Large Scale Integr. (VLSI) Syst. 275M. Weiner, W. Wieser, E. Lupon, G. Sigl, and S. Manich, \"A calibrat- able detector for invasive attacks,\" IEEE Trans. Very Large Scale Integr. (VLSI) Syst., vol. 27, no. 5, pp. 1067-1079, May 2019.\n\nOn charge sensors for FIB attack detection. C Helfmeier, C Boit, U Kerst, Proc. IEEE Int. Symp. Hardw. Oriented Security Trust. IEEE Int. Symp. Hardw. Oriented Security TrustSan Francisco, CA, USAC. Helfmeier, C. Boit, and U. Kerst, \"On charge sensors for FIB attack detection,\" in Proc. IEEE Int. Symp. Hardw. Oriented Security Trust, San Francisco, CA, USA, 2012, pp. 128-133.\n", "annotations": {"author": "[{\"start\":\"95\",\"end\":\"127\"},{\"start\":\"128\",\"end\":\"151\"},{\"start\":\"152\",\"end\":\"185\"},{\"start\":\"186\",\"end\":\"219\"},{\"start\":\"220\",\"end\":\"251\"}]", "publisher": null, "author_last_name": "[{\"start\":\"122\",\"end\":\"126\"},{\"start\":\"147\",\"end\":\"150\"},{\"start\":\"180\",\"end\":\"184\"},{\"start\":\"213\",\"end\":\"218\"},{\"start\":\"239\",\"end\":\"250\"}]", "author_first_name": "[{\"start\":\"115\",\"end\":\"121\"},{\"start\":\"140\",\"end\":\"146\"},{\"start\":\"172\",\"end\":\"179\"},{\"start\":\"205\",\"end\":\"212\"},{\"start\":\"232\",\"end\":\"236\"},{\"start\":\"237\",\"end\":\"238\"}]", "author_affiliation": null, "title": "[{\"start\":\"1\",\"end\":\"80\"},{\"start\":\"252\",\"end\":\"331\"}]", "venue": "[{\"start\":\"333\",\"end\":\"410\"}]", "abstract": "[{\"start\":\"457\",\"end\":\"1911\"}]", "bib_ref": "[{\"start\":\"2464\",\"end\":\"2474\"},{\"start\":\"2612\",\"end\":\"2615\",\"attributes\":{\"ref_id\":\"b0\"}},{\"start\":\"3018\",\"end\":\"3021\",\"attributes\":{\"ref_id\":\"b1\"}},{\"start\":\"3144\",\"end\":\"3147\",\"attributes\":{\"ref_id\":\"b2\"}},{\"start\":\"3149\",\"end\":\"3152\",\"attributes\":{\"ref_id\":\"b3\"}},{\"start\":\"3584\",\"end\":\"3587\",\"attributes\":{\"ref_id\":\"b4\"}},{\"start\":\"3589\",\"end\":\"3592\",\"attributes\":{\"ref_id\":\"b5\"}},{\"start\":\"3609\",\"end\":\"3612\",\"attributes\":{\"ref_id\":\"b6\"}},{\"start\":\"3614\",\"end\":\"3618\",\"attributes\":{\"ref_id\":\"b21\"}},{\"start\":\"3642\",\"end\":\"3645\",\"attributes\":{\"ref_id\":\"b7\"}},{\"start\":\"3901\",\"end\":\"3904\",\"attributes\":{\"ref_id\":\"b4\"}},{\"start\":\"3906\",\"end\":\"3909\",\"attributes\":{\"ref_id\":\"b5\"}},{\"start\":\"4577\",\"end\":\"4581\",\"attributes\":{\"ref_id\":\"b10\"}},{\"start\":\"4583\",\"end\":\"4587\",\"attributes\":{\"ref_id\":\"b12\"}},{\"start\":\"4589\",\"end\":\"4593\",\"attributes\":{\"ref_id\":\"b17\"}},{\"start\":\"4599\",\"end\":\"4603\",\"attributes\":{\"ref_id\":\"b18\"}},{\"start\":\"4915\",\"end\":\"4919\",\"attributes\":{\"ref_id\":\"b21\"}},{\"start\":\"5002\",\"end\":\"5005\",\"attributes\":{\"ref_id\":\"b7\"}},{\"start\":\"5358\",\"end\":\"5361\",\"attributes\":{\"ref_id\":\"b8\"}},{\"start\":\"5524\",\"end\":\"5527\",\"attributes\":{\"ref_id\":\"b8\"}},{\"start\":\"7280\",\"end\":\"7284\",\"attributes\":{\"ref_id\":\"b12\"}},{\"start\":\"8072\",\"end\":\"8076\",\"attributes\":{\"ref_id\":\"b9\"}},{\"start\":\"8297\",\"end\":\"8300\",\"attributes\":{\"ref_id\":\"b8\"}},{\"start\":\"8302\",\"end\":\"8306\",\"attributes\":{\"ref_id\":\"b9\"}},{\"start\":\"9040\",\"end\":\"9043\",\"attributes\":{\"ref_id\":\"b8\"}},{\"start\":\"9715\",\"end\":\"9718\",\"attributes\":{\"ref_id\":\"b0\"}},{\"start\":\"9930\",\"end\":\"9933\",\"attributes\":{\"ref_id\":\"b1\"}},{\"start\":\"10508\",\"end\":\"10512\",\"attributes\":{\"ref_id\":\"b15\"}},{\"start\":\"10527\",\"end\":\"10531\",\"attributes\":{\"ref_id\":\"b19\"}},{\"start\":\"10563\",\"end\":\"10567\",\"attributes\":{\"ref_id\":\"b20\"}},{\"start\":\"15662\",\"end\":\"15665\",\"attributes\":{\"ref_id\":\"b3\"}},{\"start\":\"16049\",\"end\":\"16053\",\"attributes\":{\"ref_id\":\"b10\"}},{\"start\":\"16055\",\"end\":\"16059\",\"attributes\":{\"ref_id\":\"b11\"}},{\"start\":\"16201\",\"end\":\"16204\",\"attributes\":{\"ref_id\":\"b2\"}},{\"start\":\"16645\",\"end\":\"16648\",\"attributes\":{\"ref_id\":\"b6\"}},{\"start\":\"17045\",\"end\":\"17049\",\"attributes\":{\"ref_id\":\"b21\"}},{\"start\":\"17167\",\"end\":\"17170\",\"attributes\":{\"ref_id\":\"b7\"}},{\"start\":\"22194\",\"end\":\"22198\",\"attributes\":{\"ref_id\":\"b12\"}},{\"start\":\"25124\",\"end\":\"25128\",\"attributes\":{\"ref_id\":\"b14\"}},{\"start\":\"29633\",\"end\":\"29637\",\"attributes\":{\"ref_id\":\"b14\"}},{\"start\":\"34562\",\"end\":\"34565\",\"attributes\":{\"ref_id\":\"b8\"}},{\"start\":\"34567\",\"end\":\"34571\",\"attributes\":{\"ref_id\":\"b10\"}},{\"start\":\"34573\",\"end\":\"34577\",\"attributes\":{\"ref_id\":\"b11\"}},{\"start\":\"34579\",\"end\":\"34583\",\"attributes\":{\"ref_id\":\"b17\"}},{\"start\":\"34585\",\"end\":\"34589\",\"attributes\":{\"ref_id\":\"b18\"}},{\"start\":\"34770\",\"end\":\"34773\",\"attributes\":{\"ref_id\":\"b4\"}},{\"start\":\"36234\",\"end\":\"36238\",\"attributes\":{\"ref_id\":\"b14\"}},{\"start\":\"38022\",\"end\":\"38026\",\"attributes\":{\"ref_id\":\"b11\"}},{\"start\":\"38121\",\"end\":\"38124\",\"attributes\":{\"ref_id\":\"b4\"}},{\"start\":\"40165\",\"end\":\"40169\",\"attributes\":{\"ref_id\":\"b18\"}},{\"start\":\"40589\",\"end\":\"40592\",\"attributes\":{\"ref_id\":\"b4\"}},{\"start\":\"47790\",\"end\":\"47794\",\"attributes\":{\"ref_id\":\"b12\"}},{\"start\":\"48874\",\"end\":\"48878\",\"attributes\":{\"ref_id\":\"b12\"}},{\"start\":\"51720\",\"end\":\"51724\",\"attributes\":{\"ref_id\":\"b13\"}},{\"start\":\"54756\",\"end\":\"54760\",\"attributes\":{\"ref_id\":\"b17\"}},{\"start\":\"55838\",\"end\":\"55841\",\"attributes\":{\"ref_id\":\"b4\"}},{\"start\":\"56757\",\"end\":\"56760\",\"attributes\":{\"ref_id\":\"b1\"}},{\"start\":\"56760\",\"end\":\"56763\",\"attributes\":{\"ref_id\":\"b2\"}},{\"start\":\"56763\",\"end\":\"56766\",\"attributes\":{\"ref_id\":\"b3\"}},{\"start\":\"56766\",\"end\":\"56769\",\"attributes\":{\"ref_id\":\"b4\"}},{\"start\":\"57992\",\"end\":\"57995\",\"attributes\":{\"ref_id\":\"b8\"}},{\"start\":\"58145\",\"end\":\"58148\",\"attributes\":{\"ref_id\":\"b1\"}},{\"start\":\"58148\",\"end\":\"58151\",\"attributes\":{\"ref_id\":\"b2\"}},{\"start\":\"58151\",\"end\":\"58154\",\"attributes\":{\"ref_id\":\"b3\"}},{\"start\":\"58154\",\"end\":\"58157\",\"attributes\":{\"ref_id\":\"b4\"}},{\"start\":\"58705\",\"end\":\"58708\",\"attributes\":{\"ref_id\":\"b1\"}},{\"start\":\"58708\",\"end\":\"58711\",\"attributes\":{\"ref_id\":\"b2\"}},{\"start\":\"58711\",\"end\":\"58714\",\"attributes\":{\"ref_id\":\"b3\"}},{\"start\":\"58714\",\"end\":\"58717\",\"attributes\":{\"ref_id\":\"b4\"}}]", "figure": "[{\"start\":\"61077\",\"end\":\"61253\",\"attributes\":{\"id\":\"fig_0\"}},{\"start\":\"61254\",\"end\":\"61341\",\"attributes\":{\"id\":\"fig_1\"}},{\"start\":\"61342\",\"end\":\"61405\",\"attributes\":{\"id\":\"fig_2\"}},{\"start\":\"61406\",\"end\":\"61507\",\"attributes\":{\"id\":\"fig_3\"}},{\"start\":\"61508\",\"end\":\"61567\",\"attributes\":{\"id\":\"fig_4\"}},{\"start\":\"61568\",\"end\":\"61633\",\"attributes\":{\"id\":\"fig_5\"}},{\"start\":\"61634\",\"end\":\"61711\",\"attributes\":{\"id\":\"fig_6\"}},{\"start\":\"61712\",\"end\":\"62119\",\"attributes\":{\"id\":\"fig_7\"}},{\"start\":\"62120\",\"end\":\"62186\",\"attributes\":{\"id\":\"fig_8\"}},{\"start\":\"62187\",\"end\":\"62301\",\"attributes\":{\"id\":\"fig_9\"}},{\"start\":\"62302\",\"end\":\"62556\",\"attributes\":{\"id\":\"fig_10\"}},{\"start\":\"62557\",\"end\":\"62793\",\"attributes\":{\"id\":\"fig_11\"}},{\"start\":\"62794\",\"end\":\"62916\",\"attributes\":{\"id\":\"fig_12\"}},{\"start\":\"62917\",\"end\":\"63022\",\"attributes\":{\"id\":\"fig_13\"}},{\"start\":\"63023\",\"end\":\"63747\",\"attributes\":{\"id\":\"tab_0\",\"type\":\"table\"}},{\"start\":\"63748\",\"end\":\"63815\",\"attributes\":{\"id\":\"tab_2\",\"type\":\"table\"}},{\"start\":\"63816\",\"end\":\"63872\",\"attributes\":{\"id\":\"tab_3\",\"type\":\"table\"}},{\"start\":\"63873\",\"end\":\"63928\",\"attributes\":{\"id\":\"tab_4\",\"type\":\"table\"}},{\"start\":\"63929\",\"end\":\"64151\",\"attributes\":{\"id\":\"tab_5\",\"type\":\"table\"}},{\"start\":\"64152\",\"end\":\"64218\",\"attributes\":{\"id\":\"tab_6\",\"type\":\"table\"}},{\"start\":\"64219\",\"end\":\"64283\",\"attributes\":{\"id\":\"tab_7\",\"type\":\"table\"}},{\"start\":\"64284\",\"end\":\"65037\",\"attributes\":{\"id\":\"tab_8\",\"type\":\"table\"}}]", "paragraph": "[{\"start\":\"1930\",\"end\":\"3515\"},{\"start\":\"3517\",\"end\":\"5362\"},{\"start\":\"5364\",\"end\":\"7948\"},{\"start\":\"7979\",\"end\":\"8849\"},{\"start\":\"8885\",\"end\":\"9166\"},{\"start\":\"9168\",\"end\":\"9216\"},{\"start\":\"9218\",\"end\":\"9847\"},{\"start\":\"9849\",\"end\":\"10774\"},{\"start\":\"10776\",\"end\":\"11640\"},{\"start\":\"11642\",\"end\":\"13377\"},{\"start\":\"13379\",\"end\":\"14087\"},{\"start\":\"14089\",\"end\":\"14479\"},{\"start\":\"14518\",\"end\":\"14706\"},{\"start\":\"14708\",\"end\":\"16423\"},{\"start\":\"16425\",\"end\":\"17118\"},{\"start\":\"17120\",\"end\":\"17744\"},{\"start\":\"17764\",\"end\":\"18792\"},{\"start\":\"18826\",\"end\":\"20724\"},{\"start\":\"20726\",\"end\":\"22276\"},{\"start\":\"22309\",\"end\":\"24054\"},{\"start\":\"24056\",\"end\":\"24796\"},{\"start\":\"24834\",\"end\":\"25840\"},{\"start\":\"25842\",\"end\":\"26339\"},{\"start\":\"26341\",\"end\":\"26715\"},{\"start\":\"26949\",\"end\":\"27942\"},{\"start\":\"27944\",\"end\":\"28449\"},{\"start\":\"28496\",\"end\":\"28759\"},{\"start\":\"28761\",\"end\":\"29467\"},{\"start\":\"29469\",\"end\":\"30350\"},{\"start\":\"30352\",\"end\":\"31229\"},{\"start\":\"31231\",\"end\":\"32675\"},{\"start\":\"32677\",\"end\":\"32994\"},{\"start\":\"32996\",\"end\":\"34202\"},{\"start\":\"34235\",\"end\":\"35449\"},{\"start\":\"35451\",\"end\":\"37029\"},{\"start\":\"37054\",\"end\":\"38288\"},{\"start\":\"38290\",\"end\":\"39520\"},{\"start\":\"39522\",\"end\":\"39601\"},{\"start\":\"39641\",\"end\":\"39833\"},{\"start\":\"39859\",\"end\":\"40188\"},{\"start\":\"40239\",\"end\":\"42088\"},{\"start\":\"42090\",\"end\":\"42776\"},{\"start\":\"42778\",\"end\":\"43023\"},{\"start\":\"43090\",\"end\":\"43360\"},{\"start\":\"43410\",\"end\":\"43601\"},{\"start\":\"43743\",\"end\":\"44972\"},{\"start\":\"45006\",\"end\":\"45947\"},{\"start\":\"45949\",\"end\":\"46514\"},{\"start\":\"46516\",\"end\":\"47430\"},{\"start\":\"47457\",\"end\":\"48774\"},{\"start\":\"48806\",\"end\":\"50186\"},{\"start\":\"50236\",\"end\":\"51292\"},{\"start\":\"51311\",\"end\":\"51626\"},{\"start\":\"51672\",\"end\":\"54662\"},{\"start\":\"54664\",\"end\":\"55441\"},{\"start\":\"55443\",\"end\":\"57520\"},{\"start\":\"57540\",\"end\":\"59674\"},{\"start\":\"59692\",\"end\":\"60389\"},{\"start\":\"60391\",\"end\":\"61076\"}]", "formula": "[{\"start\":\"24797\",\"end\":\"24833\",\"attributes\":{\"id\":\"formula_0\"}},{\"start\":\"26716\",\"end\":\"26948\",\"attributes\":{\"id\":\"formula_1\"}},{\"start\":\"39602\",\"end\":\"39640\",\"attributes\":{\"id\":\"formula_2\"}},{\"start\":\"39834\",\"end\":\"39858\",\"attributes\":{\"id\":\"formula_3\"}},{\"start\":\"40189\",\"end\":\"40238\",\"attributes\":{\"id\":\"formula_4\"}},{\"start\":\"43024\",\"end\":\"43089\",\"attributes\":{\"id\":\"formula_5\"}},{\"start\":\"43361\",\"end\":\"43409\",\"attributes\":{\"id\":\"formula_6\"}},{\"start\":\"43602\",\"end\":\"43742\",\"attributes\":{\"id\":\"formula_7\"}},{\"start\":\"50187\",\"end\":\"50235\",\"attributes\":{\"id\":\"formula_8\"}}]", "table_ref": "[{\"start\":\"27212\",\"end\":\"27219\",\"attributes\":{\"ref_id\":\"tab_2\"}},{\"start\":\"28440\",\"end\":\"28448\",\"attributes\":{\"ref_id\":\"tab_2\"}},{\"start\":\"28750\",\"end\":\"28758\",\"attributes\":{\"ref_id\":\"tab_2\"}},{\"start\":\"29183\",\"end\":\"29190\",\"attributes\":{\"ref_id\":\"tab_2\"}},{\"start\":\"30378\",\"end\":\"30387\",\"attributes\":{\"ref_id\":\"tab_2\"}},{\"start\":\"30612\",\"end\":\"30620\",\"attributes\":{\"ref_id\":\"tab_2\"}},{\"start\":\"32082\",\"end\":\"32090\",\"attributes\":{\"ref_id\":\"tab_2\"}},{\"start\":\"40594\",\"end\":\"40601\",\"attributes\":{\"ref_id\":\"tab_5\"}},{\"start\":\"52880\",\"end\":\"52888\",\"attributes\":{\"ref_id\":\"tab_2\"}},{\"start\":\"56118\",\"end\":\"56141\",\"attributes\":{\"ref_id\":\"tab_2\"}},{\"start\":\"56448\",\"end\":\"56457\",\"attributes\":{\"ref_id\":\"tab_2\"}},{\"start\":\"57734\",\"end\":\"57743\",\"attributes\":{\"ref_id\":\"tab_2\"}},{\"start\":\"59226\",\"end\":\"59236\",\"attributes\":{\"ref_id\":\"tab_2\"}}]", "section_header": "[{\"start\":\"1913\",\"end\":\"1928\"},{\"start\":\"7951\",\"end\":\"7965\"},{\"start\":\"7968\",\"end\":\"7977\"},{\"start\":\"8852\",\"end\":\"8883\"},{\"start\":\"14482\",\"end\":\"14516\"},{\"start\":\"17747\",\"end\":\"17762\"},{\"start\":\"18795\",\"end\":\"18824\"},{\"start\":\"22279\",\"end\":\"22307\"},{\"start\":\"28452\",\"end\":\"28494\"},{\"start\":\"34205\",\"end\":\"34233\"},{\"start\":\"37032\",\"end\":\"37052\"},{\"start\":\"44975\",\"end\":\"45004\"},{\"start\":\"47433\",\"end\":\"47455\"},{\"start\":\"48777\",\"end\":\"48804\"},{\"start\":\"51295\",\"end\":\"51309\"},{\"start\":\"51629\",\"end\":\"51670\"},{\"start\":\"57523\",\"end\":\"57538\"},{\"start\":\"59677\",\"end\":\"59690\"},{\"start\":\"61078\",\"end\":\"61091\"},{\"start\":\"61255\",\"end\":\"61263\"},{\"start\":\"61343\",\"end\":\"61351\"},{\"start\":\"61407\",\"end\":\"61415\"},{\"start\":\"61509\",\"end\":\"61517\"},{\"start\":\"61569\",\"end\":\"61577\"},{\"start\":\"61635\",\"end\":\"61643\"},{\"start\":\"61713\",\"end\":\"61721\"},{\"start\":\"62121\",\"end\":\"62130\"},{\"start\":\"62188\",\"end\":\"62197\"},{\"start\":\"62303\",\"end\":\"62312\"},{\"start\":\"62558\",\"end\":\"62567\"},{\"start\":\"62795\",\"end\":\"62804\"},{\"start\":\"62918\",\"end\":\"62927\"},{\"start\":\"63749\",\"end\":\"63765\"},{\"start\":\"63817\",\"end\":\"63833\"},{\"start\":\"63874\",\"end\":\"63889\"},{\"start\":\"63930\",\"end\":\"63944\"},{\"start\":\"64153\",\"end\":\"64171\"},{\"start\":\"64220\",\"end\":\"64241\"},{\"start\":\"64285\",\"end\":\"64309\"}]", "table": null, "figure_caption": "[{\"start\":\"61097\",\"end\":\"61253\"},{\"start\":\"61265\",\"end\":\"61341\"},{\"start\":\"61353\",\"end\":\"61405\"},{\"start\":\"61417\",\"end\":\"61507\"},{\"start\":\"61519\",\"end\":\"61567\"},{\"start\":\"61579\",\"end\":\"61633\"},{\"start\":\"61645\",\"end\":\"61711\"},{\"start\":\"61723\",\"end\":\"62119\"},{\"start\":\"62133\",\"end\":\"62186\"},{\"start\":\"62200\",\"end\":\"62301\"},{\"start\":\"62315\",\"end\":\"62556\"},{\"start\":\"62570\",\"end\":\"62793\"},{\"start\":\"62807\",\"end\":\"62916\"},{\"start\":\"62930\",\"end\":\"63022\"},{\"start\":\"63025\",\"end\":\"63747\"},{\"start\":\"63767\",\"end\":\"63815\"},{\"start\":\"63837\",\"end\":\"63872\"},{\"start\":\"63892\",\"end\":\"63928\"},{\"start\":\"63946\",\"end\":\"64151\"},{\"start\":\"64174\",\"end\":\"64218\"},{\"start\":\"64245\",\"end\":\"64283\"},{\"start\":\"64314\",\"end\":\"65037\"}]", "figure_ref": "[{\"start\":\"12147\",\"end\":\"12156\"},{\"start\":\"12466\",\"end\":\"12475\"},{\"start\":\"14943\",\"end\":\"14949\",\"attributes\":{\"ref_id\":\"fig_1\"}},{\"start\":\"20800\",\"end\":\"20806\",\"attributes\":{\"ref_id\":\"fig_2\"}},{\"start\":\"26116\",\"end\":\"26125\"},{\"start\":\"26457\",\"end\":\"26466\"},{\"start\":\"27096\",\"end\":\"27102\"},{\"start\":\"27404\",\"end\":\"27410\"},{\"start\":\"27411\",\"end\":\"27417\"},{\"start\":\"28112\",\"end\":\"28121\"},{\"start\":\"28417\",\"end\":\"28423\"},{\"start\":\"28595\",\"end\":\"28604\"},{\"start\":\"28727\",\"end\":\"28733\"},{\"start\":\"29726\",\"end\":\"29735\"},{\"start\":\"29930\",\"end\":\"29939\"},{\"start\":\"30446\",\"end\":\"30459\"},{\"start\":\"30508\",\"end\":\"30517\"},{\"start\":\"30601\",\"end\":\"30607\",\"attributes\":{\"ref_id\":\"fig_3\"}},{\"start\":\"30806\",\"end\":\"30815\",\"attributes\":{\"ref_id\":\"fig_3\"}},{\"start\":\"31067\",\"end\":\"31076\",\"attributes\":{\"ref_id\":\"fig_3\"}},{\"start\":\"32071\",\"end\":\"32077\",\"attributes\":{\"ref_id\":\"fig_3\"}},{\"start\":\"32799\",\"end\":\"32805\",\"attributes\":{\"ref_id\":\"fig_2\"}},{\"start\":\"37391\",\"end\":\"37397\",\"attributes\":{\"ref_id\":\"fig_4\"}},{\"start\":\"38611\",\"end\":\"38617\",\"attributes\":{\"ref_id\":\"fig_4\"}},{\"start\":\"38862\",\"end\":\"38868\",\"attributes\":{\"ref_id\":\"fig_4\"}},{\"start\":\"39513\",\"end\":\"39519\",\"attributes\":{\"ref_id\":\"fig_4\"}},{\"start\":\"40043\",\"end\":\"40049\",\"attributes\":{\"ref_id\":\"fig_4\"}},{\"start\":\"42859\",\"end\":\"42865\",\"attributes\":{\"ref_id\":\"fig_5\"}},{\"start\":\"43506\",\"end\":\"43513\",\"attributes\":{\"ref_id\":\"fig_5\"}},{\"start\":\"43575\",\"end\":\"43582\",\"attributes\":{\"ref_id\":\"fig_5\"}},{\"start\":\"44400\",\"end\":\"44406\",\"attributes\":{\"ref_id\":\"fig_6\"}},{\"start\":\"45139\",\"end\":\"45148\",\"attributes\":{\"ref_id\":\"fig_7\"}},{\"start\":\"45485\",\"end\":\"45494\",\"attributes\":{\"ref_id\":\"fig_7\"}},{\"start\":\"46369\",\"end\":\"46378\",\"attributes\":{\"ref_id\":\"fig_7\"}},{\"start\":\"46687\",\"end\":\"46693\",\"attributes\":{\"ref_id\":\"fig_7\"}},{\"start\":\"46990\",\"end\":\"46996\",\"attributes\":{\"ref_id\":\"fig_7\"}},{\"start\":\"47715\",\"end\":\"47722\",\"attributes\":{\"ref_id\":\"fig_8\"}},{\"start\":\"48547\",\"end\":\"48554\",\"attributes\":{\"ref_id\":\"fig_8\"}},{\"start\":\"50045\",\"end\":\"50051\",\"attributes\":{\"ref_id\":\"fig_4\"}},{\"start\":\"50532\",\"end\":\"50539\",\"attributes\":{\"ref_id\":\"fig_9\"}},{\"start\":\"52664\",\"end\":\"52677\",\"attributes\":{\"ref_id\":\"fig_1\"}},{\"start\":\"52863\",\"end\":\"52870\",\"attributes\":{\"ref_id\":\"fig_1\"}},{\"start\":\"54267\",\"end\":\"54292\",\"attributes\":{\"ref_id\":\"fig_1\"}},{\"start\":\"54328\",\"end\":\"54338\",\"attributes\":{\"ref_id\":\"fig_2\"}},{\"start\":\"54355\",\"end\":\"54365\",\"attributes\":{\"ref_id\":\"fig_2\"}},{\"start\":\"54399\",\"end\":\"54409\",\"attributes\":{\"ref_id\":\"fig_2\"}},{\"start\":\"54899\",\"end\":\"54909\",\"attributes\":{\"ref_id\":\"fig_11\"}},{\"start\":\"55230\",\"end\":\"55240\",\"attributes\":{\"ref_id\":\"fig_11\"}},{\"start\":\"55337\",\"end\":\"55347\",\"attributes\":{\"ref_id\":\"fig_11\"}},{\"start\":\"55695\",\"end\":\"55699\"},{\"start\":\"55843\",\"end\":\"55850\",\"attributes\":{\"ref_id\":\"fig_3\"}},{\"start\":\"55903\",\"end\":\"55913\",\"attributes\":{\"ref_id\":\"fig_3\"}},{\"start\":\"55972\",\"end\":\"55982\",\"attributes\":{\"ref_id\":\"fig_3\"}},{\"start\":\"57664\",\"end\":\"57682\",\"attributes\":{\"ref_id\":\"fig_4\"}},{\"start\":\"57754\",\"end\":\"57764\",\"attributes\":{\"ref_id\":\"fig_4\"}},{\"start\":\"57776\",\"end\":\"57786\",\"attributes\":{\"ref_id\":\"fig_4\"}},{\"start\":\"58446\",\"end\":\"58456\",\"attributes\":{\"ref_id\":\"fig_4\"}},{\"start\":\"58613\",\"end\":\"58623\",\"attributes\":{\"ref_id\":\"fig_4\"}},{\"start\":\"59238\",\"end\":\"59248\",\"attributes\":{\"ref_id\":\"fig_4\"}},{\"start\":\"59659\",\"end\":\"59666\",\"attributes\":{\"ref_id\":\"fig_4\"}}]", "bib_author_first_name": "[{\"start\":\"65150\",\"end\":\"65151\"},{\"start\":\"65493\",\"end\":\"65494\"},{\"start\":\"65495\",\"end\":\"65496\"},{\"start\":\"65744\",\"end\":\"65745\"},{\"start\":\"65756\",\"end\":\"65757\"},{\"start\":\"65769\",\"end\":\"65770\"},{\"start\":\"65771\",\"end\":\"65774\"},{\"start\":\"65782\",\"end\":\"65783\"},{\"start\":\"65794\",\"end\":\"65795\"},{\"start\":\"65806\",\"end\":\"65807\"},{\"start\":\"66179\",\"end\":\"66180\"},{\"start\":\"66473\",\"end\":\"66477\"},{\"start\":\"66827\",\"end\":\"66828\"},{\"start\":\"66835\",\"end\":\"66836\"},{\"start\":\"66841\",\"end\":\"66842\"},{\"start\":\"66847\",\"end\":\"66848\"},{\"start\":\"66856\",\"end\":\"66857\"},{\"start\":\"66863\",\"end\":\"66864\"},{\"start\":\"67261\",\"end\":\"67262\"},{\"start\":\"67271\",\"end\":\"67272\"},{\"start\":\"67281\",\"end\":\"67282\"},{\"start\":\"67303\",\"end\":\"67304\"},{\"start\":\"67653\",\"end\":\"67654\"},{\"start\":\"67662\",\"end\":\"67663\"},{\"start\":\"67671\",\"end\":\"67672\"},{\"start\":\"68019\",\"end\":\"68020\"},{\"start\":\"68027\",\"end\":\"68028\"},{\"start\":\"68036\",\"end\":\"68037\"},{\"start\":\"68051\",\"end\":\"68052\"},{\"start\":\"68550\",\"end\":\"68551\"},{\"start\":\"68883\",\"end\":\"68884\"},{\"start\":\"69128\",\"end\":\"69129\"},{\"start\":\"69135\",\"end\":\"69136\"},{\"start\":\"69151\",\"end\":\"69152\"},{\"start\":\"69160\",\"end\":\"69161\"},{\"start\":\"69162\",\"end\":\"69163\"},{\"start\":\"69535\",\"end\":\"69536\"},{\"start\":\"69734\",\"end\":\"69735\"},{\"start\":\"69736\",\"end\":\"69737\"},{\"start\":\"69749\",\"end\":\"69750\"},{\"start\":\"69751\",\"end\":\"69752\"},{\"start\":\"70177\",\"end\":\"70178\"},{\"start\":\"70185\",\"end\":\"70186\"},{\"start\":\"70430\",\"end\":\"70431\"},{\"start\":\"70437\",\"end\":\"70438\"},{\"start\":\"70445\",\"end\":\"70446\"},{\"start\":\"70461\",\"end\":\"70462\"},{\"start\":\"70463\",\"end\":\"70464\"},{\"start\":\"70478\",\"end\":\"70479\"},{\"start\":\"70938\",\"end\":\"70939\"},{\"start\":\"70946\",\"end\":\"70947\"},{\"start\":\"70953\",\"end\":\"70954\"},{\"start\":\"70962\",\"end\":\"70963\"},{\"start\":\"70964\",\"end\":\"70965\"},{\"start\":\"71551\",\"end\":\"71552\"},{\"start\":\"71561\",\"end\":\"71562\"},{\"start\":\"71571\",\"end\":\"71572\"},{\"start\":\"71580\",\"end\":\"71581\"},{\"start\":\"71588\",\"end\":\"71589\"},{\"start\":\"71894\",\"end\":\"71895\"},{\"start\":\"71907\",\"end\":\"71908\"},{\"start\":\"71915\",\"end\":\"71916\"}]", "bib_author_last_name": "[{\"start\":\"65152\",\"end\":\"65164\"},{\"start\":\"65497\",\"end\":\"65503\"},{\"start\":\"65746\",\"end\":\"65754\"},{\"start\":\"65758\",\"end\":\"65767\"},{\"start\":\"65775\",\"end\":\"65780\"},{\"start\":\"65784\",\"end\":\"65792\"},{\"start\":\"65796\",\"end\":\"65804\"},{\"start\":\"65808\",\"end\":\"65812\"},{\"start\":\"66181\",\"end\":\"66183\"},{\"start\":\"66478\",\"end\":\"66488\"},{\"start\":\"66829\",\"end\":\"66833\"},{\"start\":\"66837\",\"end\":\"66839\"},{\"start\":\"66843\",\"end\":\"66845\"},{\"start\":\"66849\",\"end\":\"66854\"},{\"start\":\"66858\",\"end\":\"66861\"},{\"start\":\"66865\",\"end\":\"66869\"},{\"start\":\"67263\",\"end\":\"67269\"},{\"start\":\"67273\",\"end\":\"67279\"},{\"start\":\"67283\",\"end\":\"67301\"},{\"start\":\"67305\",\"end\":\"67309\"},{\"start\":\"67655\",\"end\":\"67660\"},{\"start\":\"67664\",\"end\":\"67669\"},{\"start\":\"67673\",\"end\":\"67679\"},{\"start\":\"68021\",\"end\":\"68025\"},{\"start\":\"68029\",\"end\":\"68034\"},{\"start\":\"68038\",\"end\":\"68049\"},{\"start\":\"68053\",\"end\":\"68056\"},{\"start\":\"68552\",\"end\":\"68555\"},{\"start\":\"68885\",\"end\":\"68894\"},{\"start\":\"69130\",\"end\":\"69133\"},{\"start\":\"69137\",\"end\":\"69149\"},{\"start\":\"69153\",\"end\":\"69158\"},{\"start\":\"69164\",\"end\":\"69175\"},{\"start\":\"69537\",\"end\":\"69550\"},{\"start\":\"69552\",\"end\":\"69559\"},{\"start\":\"69738\",\"end\":\"69747\"},{\"start\":\"69753\",\"end\":\"69760\"},{\"start\":\"70020\",\"end\":\"70029\"},{\"start\":\"70031\",\"end\":\"70039\"},{\"start\":\"70179\",\"end\":\"70183\"},{\"start\":\"70187\",\"end\":\"70193\"},{\"start\":\"70432\",\"end\":\"70435\"},{\"start\":\"70439\",\"end\":\"70443\"},{\"start\":\"70447\",\"end\":\"70459\"},{\"start\":\"70465\",\"end\":\"70476\"},{\"start\":\"70480\",\"end\":\"70485\"},{\"start\":\"70940\",\"end\":\"70944\"},{\"start\":\"70948\",\"end\":\"70951\"},{\"start\":\"70955\",\"end\":\"70960\"},{\"start\":\"70966\",\"end\":\"70977\"},{\"start\":\"71252\",\"end\":\"71259\"},{\"start\":\"71261\",\"end\":\"71269\"},{\"start\":\"71370\",\"end\":\"71379\"},{\"start\":\"71381\",\"end\":\"71389\"},{\"start\":\"71553\",\"end\":\"71559\"},{\"start\":\"71563\",\"end\":\"71569\"},{\"start\":\"71573\",\"end\":\"71578\"},{\"start\":\"71582\",\"end\":\"71586\"},{\"start\":\"71590\",\"end\":\"71596\"},{\"start\":\"71896\",\"end\":\"71905\"},{\"start\":\"71909\",\"end\":\"71913\"},{\"start\":\"71917\",\"end\":\"71922\"}]", "bib_entry": "[{\"start\":\"65089\",\"end\":\"65443\",\"attributes\":{\"id\":\"b0\"}},{\"start\":\"65445\",\"end\":\"65687\",\"attributes\":{\"matched_paper_id\":\"17855723\",\"id\":\"b1\"}},{\"start\":\"65689\",\"end\":\"66042\",\"attributes\":{\"matched_paper_id\":\"98106707\",\"id\":\"b2\"}},{\"start\":\"66044\",\"end\":\"66437\",\"attributes\":{\"matched_paper_id\":\"137665273\",\"id\":\"b3\"}},{\"start\":\"66439\",\"end\":\"66749\",\"attributes\":{\"matched_paper_id\":\"8996975\",\"id\":\"b4\"}},{\"start\":\"66751\",\"end\":\"67183\",\"attributes\":{\"matched_paper_id\":\"15272147\",\"id\":\"b5\"}},{\"start\":\"67185\",\"end\":\"67590\",\"attributes\":{\"matched_paper_id\":\"2558495\",\"id\":\"b6\"}},{\"start\":\"67592\",\"end\":\"67938\",\"attributes\":{\"matched_paper_id\":\"1719867\",\"id\":\"b7\"}},{\"start\":\"67940\",\"end\":\"68259\",\"attributes\":{\"matched_paper_id\":\"13126610\",\"id\":\"b8\"}},{\"start\":\"68261\",\"end\":\"68450\",\"attributes\":{\"id\":\"b9\"}},{\"start\":\"68452\",\"end\":\"68844\",\"attributes\":{\"id\":\"b10\"}},{\"start\":\"68846\",\"end\":\"69045\",\"attributes\":{\"id\":\"b11\"}},{\"start\":\"69047\",\"end\":\"69531\",\"attributes\":{\"matched_paper_id\":\"18741239\",\"id\":\"b12\"}},{\"start\":\"69533\",\"end\":\"69670\",\"attributes\":{\"id\":\"b13\"}},{\"start\":\"69672\",\"end\":\"70016\",\"attributes\":{\"matched_paper_id\":\"16499108\",\"id\":\"b14\"}},{\"start\":\"70018\",\"end\":\"70126\",\"attributes\":{\"id\":\"b15\"}},{\"start\":\"70128\",\"end\":\"70336\",\"attributes\":{\"id\":\"b16\"}},{\"start\":\"70338\",\"end\":\"70866\",\"attributes\":{\"matched_paper_id\":\"57764115\",\"id\":\"b17\"}},{\"start\":\"70868\",\"end\":\"71248\",\"attributes\":{\"matched_paper_id\":\"145986129\",\"id\":\"b18\"}},{\"start\":\"71250\",\"end\":\"71366\",\"attributes\":{\"id\":\"b19\"}},{\"start\":\"71368\",\"end\":\"71503\",\"attributes\":{\"id\":\"b20\"}},{\"start\":\"71505\",\"end\":\"71848\",\"attributes\":{\"matched_paper_id\":\"86609225\",\"id\":\"b21\"}},{\"start\":\"71850\",\"end\":\"72228\",\"attributes\":{\"matched_paper_id\":\"692854\",\"id\":\"b22\"}}]", "bib_title": "[{\"start\":\"65089\",\"end\":\"65148\"},{\"start\":\"65445\",\"end\":\"65491\"},{\"start\":\"65689\",\"end\":\"65742\"},{\"start\":\"66044\",\"end\":\"66177\"},{\"start\":\"66439\",\"end\":\"66471\"},{\"start\":\"66751\",\"end\":\"66825\"},{\"start\":\"67185\",\"end\":\"67259\"},{\"start\":\"67592\",\"end\":\"67651\"},{\"start\":\"67940\",\"end\":\"68017\"},{\"start\":\"68452\",\"end\":\"68548\"},{\"start\":\"69047\",\"end\":\"69126\"},{\"start\":\"69672\",\"end\":\"69732\"},{\"start\":\"70128\",\"end\":\"70175\"},{\"start\":\"70338\",\"end\":\"70428\"},{\"start\":\"70868\",\"end\":\"70936\"},{\"start\":\"71505\",\"end\":\"71549\"},{\"start\":\"71850\",\"end\":\"71892\"}]", "bib_author": "[{\"start\":\"65150\",\"end\":\"65166\"},{\"start\":\"65493\",\"end\":\"65505\"},{\"start\":\"65744\",\"end\":\"65756\"},{\"start\":\"65756\",\"end\":\"65769\"},{\"start\":\"65769\",\"end\":\"65782\"},{\"start\":\"65782\",\"end\":\"65794\"},{\"start\":\"65794\",\"end\":\"65806\"},{\"start\":\"65806\",\"end\":\"65814\"},{\"start\":\"66179\",\"end\":\"66185\"},{\"start\":\"66473\",\"end\":\"66490\"},{\"start\":\"66827\",\"end\":\"66835\"},{\"start\":\"66835\",\"end\":\"66841\"},{\"start\":\"66841\",\"end\":\"66847\"},{\"start\":\"66847\",\"end\":\"66856\"},{\"start\":\"66856\",\"end\":\"66863\"},{\"start\":\"66863\",\"end\":\"66871\"},{\"start\":\"67261\",\"end\":\"67271\"},{\"start\":\"67271\",\"end\":\"67281\"},{\"start\":\"67281\",\"end\":\"67303\"},{\"start\":\"67303\",\"end\":\"67311\"},{\"start\":\"67653\",\"end\":\"67662\"},{\"start\":\"67662\",\"end\":\"67671\"},{\"start\":\"67671\",\"end\":\"67681\"},{\"start\":\"68019\",\"end\":\"68027\"},{\"start\":\"68027\",\"end\":\"68036\"},{\"start\":\"68036\",\"end\":\"68051\"},{\"start\":\"68051\",\"end\":\"68058\"},{\"start\":\"68550\",\"end\":\"68557\"},{\"start\":\"68883\",\"end\":\"68896\"},{\"start\":\"69128\",\"end\":\"69135\"},{\"start\":\"69135\",\"end\":\"69151\"},{\"start\":\"69151\",\"end\":\"69160\"},{\"start\":\"69160\",\"end\":\"69177\"},{\"start\":\"69535\",\"end\":\"69552\"},{\"start\":\"69552\",\"end\":\"69561\"},{\"start\":\"69734\",\"end\":\"69749\"},{\"start\":\"69749\",\"end\":\"69762\"},{\"start\":\"70020\",\"end\":\"70031\"},{\"start\":\"70031\",\"end\":\"70041\"},{\"start\":\"70177\",\"end\":\"70185\"},{\"start\":\"70185\",\"end\":\"70195\"},{\"start\":\"70430\",\"end\":\"70437\"},{\"start\":\"70437\",\"end\":\"70445\"},{\"start\":\"70445\",\"end\":\"70461\"},{\"start\":\"70461\",\"end\":\"70478\"},{\"start\":\"70478\",\"end\":\"70487\"},{\"start\":\"70938\",\"end\":\"70946\"},{\"start\":\"70946\",\"end\":\"70953\"},{\"start\":\"70953\",\"end\":\"70962\"},{\"start\":\"70962\",\"end\":\"70979\"},{\"start\":\"71252\",\"end\":\"71261\"},{\"start\":\"71261\",\"end\":\"71271\"},{\"start\":\"71370\",\"end\":\"71381\"},{\"start\":\"71381\",\"end\":\"71391\"},{\"start\":\"71551\",\"end\":\"71561\"},{\"start\":\"71561\",\"end\":\"71571\"},{\"start\":\"71571\",\"end\":\"71580\"},{\"start\":\"71580\",\"end\":\"71588\"},{\"start\":\"71588\",\"end\":\"71598\"},{\"start\":\"71894\",\"end\":\"71907\"},{\"start\":\"71907\",\"end\":\"71915\"},{\"start\":\"71915\",\"end\":\"71924\"}]", "bib_venue": "[{\"start\":\"65166\",\"end\":\"65213\"},{\"start\":\"65505\",\"end\":\"65540\"},{\"start\":\"65814\",\"end\":\"65839\"},{\"start\":\"66185\",\"end\":\"66215\"},{\"start\":\"66490\",\"end\":\"66549\"},{\"start\":\"66871\",\"end\":\"66922\"},{\"start\":\"67311\",\"end\":\"67359\"},{\"start\":\"67681\",\"end\":\"67720\"},{\"start\":\"68058\",\"end\":\"68072\"},{\"start\":\"68261\",\"end\":\"68312\"},{\"start\":\"68557\",\"end\":\"68609\"},{\"start\":\"68846\",\"end\":\"68881\"},{\"start\":\"69177\",\"end\":\"69229\"},{\"start\":\"69762\",\"end\":\"69791\"},{\"start\":\"70195\",\"end\":\"70216\"},{\"start\":\"70487\",\"end\":\"70547\"},{\"start\":\"70979\",\"end\":\"71027\"},{\"start\":\"71598\",\"end\":\"71646\"},{\"start\":\"71924\",\"end\":\"71976\"},{\"start\":\"65215\",\"end\":\"65275\"},{\"start\":\"66551\",\"end\":\"66604\"},{\"start\":\"66924\",\"end\":\"66969\"},{\"start\":\"67722\",\"end\":\"67737\"},{\"start\":\"68611\",\"end\":\"68657\"},{\"start\":\"69231\",\"end\":\"69292\"},{\"start\":\"69793\",\"end\":\"69836\"},{\"start\":\"70549\",\"end\":\"70612\"},{\"start\":\"71978\",\"end\":\"72046\"}]"}}}, "year": 2023, "month": 12, "day": 17}