{"id": 209444382, "updated": "2023-10-06 20:19:30.973", "metadata": {"title": "PANNs: Large-Scale Pretrained Audio Neural Networks for Audio Pattern Recognition", "authors": "[{\"first\":\"Qiuqiang\",\"last\":\"Kong\",\"middle\":[]},{\"first\":\"Yin\",\"last\":\"Cao\",\"middle\":[]},{\"first\":\"Turab\",\"last\":\"Iqbal\",\"middle\":[]},{\"first\":\"Yuxuan\",\"last\":\"Wang\",\"middle\":[]},{\"first\":\"Wenwu\",\"last\":\"Wang\",\"middle\":[]},{\"first\":\"Mark\",\"last\":\"Plumbley\",\"middle\":[\"D.\"]}]", "venue": "ArXiv", "journal": "ArXiv", "publication_date": {"year": 2019, "month": 12, "day": 21}, "abstract": "Audio pattern recognition is an important research topic in the machine learning area, and includes several tasks such as audio tagging, acoustic scene classification and sound event detection. Recently neural networks have been applied to solve audio pattern recognition problems. However, previous systems focus on small datasets, which limits the performance of audio pattern recognition systems. Recently in computer vision and natural language processing, systems pretrained on large datasets have generalized well to several tasks. However, there is limited research on pretraining neural networks on large datasets for audio pattern recognition. In this paper, we propose large-scale pretrained audio neural networks (PANNs) trained on AudioSet. We propose to use Wavegram, a feature learned from waveform, and the mel spectrogram as input. We investigate the performance and complexity of a variety of convolutional neural networks. Our proposed AudioSet tagging system achieves a state-of-the-art mean average precision (mAP) of 0.439, outperforming the best previous system of 0.392. We transferred a PANN to six audio pattern recognition tasks and achieve state-of-the-art performance in many tasks. Source code and pretrained models have been released.", "fields_of_study": "[\"Computer Science\",\"Engineering\"]", "external_ids": {"arxiv": "1912.10211", "mag": "3094550259", "acl": null, "pubmed": null, "pubmedcentral": null, "dblp": "journals/taslp/KongCIWWP20", "doi": "10.1109/taslp.2020.3030497"}}, "content": {"source": {"pdf_hash": "65d53938a12c77e7920b8eb3a49df249c978ba3f", "pdf_src": "Arxiv", "pdf_uri": "[\"https://arxiv.org/pdf/1912.10211v3.pdf\"]", "oa_url_match": true, "oa_info": {"license": null, "open_access_url": "http://arxiv.org/pdf/1912.10211", "status": "GREEN"}}, "grobid": {"id": "4cb79fa2317e96211a04920dc64e09e0d20d757c", "type": "plain-text", "url": "s3://ai2-s2-pdf-extraction-prod/parse-results/s2orc_worker/65d53938a12c77e7920b8eb3a49df249c978ba3f.txt", "contents": "\nPANNs: Large-Scale Pretrained Audio Neural Networks for Audio Pattern Recognition\n\n\nStudent Member, IEEEQiuqiang Kong \nMember, IEEE, Turab IqbalYin Cao \nYuxuan Wang \nSenior Member, IEEEWenwu Wang \nFellow, IEEEMark D Plumbley \nPANNs: Large-Scale Pretrained Audio Neural Networks for Audio Pattern Recognition\n1Index Terms-Audio taggingpretrained audio neural net- workstransfer learning\nAudio pattern recognition is an important research topic in the machine learning area, and includes several tasks such as audio tagging, acoustic scene classification and sound event detection. Recently neural networks have been applied to solve audio pattern recognition problems. However, previous systems focus on small datasets, which limits the performance of audio pattern recognition systems. Recently in computer vision and natural language processing, systems pretrained on large datasets have generalized well to several tasks. However, there is limited research on pretraining neural networks on large datasets for audio pattern recognition. In this paper, we propose large-scale pretrained audio neural networks (PANNs) trained on AudioSet. We propose to use Wavegram, a feature learned from waveform, and the mel spectrogram as input. We investigate the performance and complexity of a variety of convolutional neural networks. Our proposed AudioSet tagging system achieves a state-of-the-art mean average precision (mAP) of 0.439, outperforming the best previous system of 0.392. We transferred a PANN to six audio pattern recognition tasks and achieve state-of-the-art performance in many tasks. Source code and pretrained models have been released.\n\nI. INTRODUCTION\n\nOur world is surrounded with sounds that contain rich information of where we are and what events are happening around us. Audio pattern recognition is an important research topic in machine learning and plays an important role in our life. Audio pattern recognition contains several tasks such as audio tagging [1], acoustic scene classification [2], sound event detection [3], classifying the emotion of patients from their speech [4], detecting the abnormal snoring of a patient [5] and classifying heart sounds.\n\nAudio pattern recognition has attracted increasing research efforts in recent years. Early works of audio pattern recognition focused on private datasets collected by individual researchers [6], [7]. For example, Woodard [6] applied a hidden Markov model (HMM) to classify three types of sounds: wooden door open and shut, metal dropped and water poured. Recently, the Detection and Classification of Acoustic Scenes and Events (DCASE) challenge series since 2013 [8], [9], [10], [2] have provided publicly available datasets including acoustic scene classification and sound event detection datasets for researchers to use. The DCASE challenges have attracted increasing research interests in recent years. The DCASE 2019 challenge received 311 entries in five subtasks [11].\n\nThough there were increasing works [11] on audio pattern recognition using the DCASE challenge datasets, it is still an open question of how good an audio pattern recognition system can perform when large-scale training data is available. In computer vision, there is existing research on using the large-scale ImageNet [12] for image classification. In natural language processing, there is research on using large-scale Wikipedia data [13] to train language models. However, there is limited work [1], [14] on training systems on large-scale audio datasets, for example, the systems [1], [14] were built in 1-second level but not in clip level.\n\nA milestone for audio pattern recognition is the release of AudioSet [1], a dataset containing over 5,000 hours of audio recordings with 527 sound classes in the released version. Instead of releasing the raw audio recordings, AudioSet released embedding features of audio clips extracted from a convolutional neural network [14]. Several works [15], [16], [17], [18], [19] have investigated building systems using the embedding features [14]. However, those methods did not work on improving systems obtaining better embedding features. In this work, we investigate AudioSet tagging with a wide range of neural network systems trained using raw audio recordings. We investigate a wide range of convolutional neural networks including [20], [21] applied on both log mel spectrograms and time-domain waveforms. Several of our proposed systems have outperformed the previous state-of-theart systems for AudioSet tagging. In addition, an analysis of the performance and computational efficiency of audio tagging has not been done in previous works [20], [21], [14].\n\nWe call the systems trained on AudioSet pretrained audio neural networks (PANNs). Previous works have investigated transfer learning for audio tagging. For example, in [22], systems pretrained on the Million Song Dataset were used as feature extractors for audio clips. In [20], [23], embedding features extracted from pretrained convolutional neural networks (CNNs) were used as inputs to second-stage classifiers such as neural networks or support vector machines (SVMs). In [24], [25], systems pretrained on MagnaTagATune [26] and acoustic scene [27] datasets were finetuned on other audio tagging tasks. However, previous works on transfer learning mainly used music datasets or were limited to smaller datasets than AudioSet. In this work, we investigate transferring PANNs to a wide range of audio pattern recognition tasks, including acoustic scene classification, general audio tagging, music classification and speech emotion classification. We investigate training a system from scratch, using a PANN as a feature extractor and fine-tuning a PANN on different tasks that have not been done in previous works. In addition, to investigate the generalization ability of PANNs, few-shot learning with PANNs using limited numbers of training samples are experimented.\n\nThis paper is organized as follows. Section II introduces audio tagging with various convolutional neural networks. Section III proposes Wavegram-CNN systems. Section IV proposes data processing techniques for AudioSet tagging. Section VI shows experimental results. Section VII concludes this work.\n\n\nII. AUDIO TAGGING SYSTEMS\n\nAudio tagging is an essential task of audio pattern recognition with the goal of predicting the presence or absence of sound events in an audio clip. Early work in audio tagging includes using manually-design features as input, such as audio energy, zero-crossing rate, and mel-frequency cepstrum coefficients (MFCCs) [28]. Generative models including Gaussian mixture models (GMMs) [29], [30], hidden Markov models (HMMs) and SVMs [31] have been used as classifiers. Recently, neural network based methods including CNNs have been used [32] to predict the tags of a music clip. CNN based systems have achieved state-of-the-art performance in several DCASE challenge tasks including acoustic scene classification [2] and sound event detection [3]. However, many of those works focused on particular tasks with a limited number of sound classes and were not designed to recognize a wide range of sound classes. In this work, we focus on training large-scale PANNs on AudioSet [1] to solve the general audio tagging problem.\n\nA. CNNs 1) Conventional CNNs: CNNs are classes of neural networks that have been successfully applied to computer vision tasks such as image classification [33], [34] and were later adopted for audio tagging [32], [19]. Log mel spectrograms are usually used as input to CNNs [32], [19]. To begin with, the short time Fourier transform (STFT) is applied on time-domain waveforms to calculate spectrograms. Then mel filter banks are applied on the spectrograms followed by a logarithmic operation to extract log mel spectrograms [32], [19]. A CNN consists of several convolutional layers. Each convolutional layer contains several kernels that are convolved with the input to capture local patterns of input.\n\n2) Adapting CNNs for AudioSet tagging: CNNs in this section are based on our previously proposed cross-task CNN systems for the DCASE 2019 challenge [35]. Different from [35], an extra fully-connected layer is added to the penultimate layer of CNNs which further increase the representation ability  of CNNs. Therefore we have 6-, 10-and 14-layer CNNs. The 6-layer CNN consists of 4 convolutional layers with kernel sizes of 5 × 5, originated from AlexNet [36]. The 10-and 14layer CNN inspired from [37] consists of 4 and 6 convolutional blocks, respectively. Each convolutional block consists of 2 convolutional layers with kernel sizes of 3 × 3. Batch normalization [38] is applied between each convolutional layer and ReLU nonlinearity [39] to speed up and stabilize training. Downsampling with average pooling size of 2 × 2 has been shown to outperform max pooling with size of 2 × 2 in the DCASE 2019 challenge tasks [35]. Therefore we adopt average pooling with sizes of 2 × 2 for downsampling after each convolutional block. Global pooling is applied after the last convolutional layer to summarize feature maps of audio clips with various durations to fixed-length vectors. In [21], maximum and average operation are used for global pooling. We sum the averaged and maximized vectors to calculate a fixed length vector. In [35], those fixed-length vectors were used as embedding features for audio clips. Different from [35], our embedding features are obtained by adding an extra fully-connected layer to the fixed length vectors. For a particular audio pattern recognition task, a linear classifier is applied on the embedding features followed by either a softmax nonlinearity for classification tasks or sigmoid nonlinearity for tagging tasks. Dropout [40] is applied after downsampling with the global pooling layers to prevent systems from overfitting. Table I summarizes the proposed CNN systems. The number after symbol @ indicates the number of feature maps. The first column shows the VGGish network proposed by [14]. MP is the abbreviation of max pooling. In [14], an audio clip was split into 1-second segments and assumed each segment inherits the label of the audio clip. In contrast, our systems shown from the second to the fourth column of Table I are trained on audio clips directly  without requiring the segment-wise labels. We denote the input representation of an audio clip as x n , where n is the index of an audio clip, and f (x n ) ∈ [0, 1] K is the output of the neural network representing the presence \n3 × 3 @ 128 BN, ReLU × 2 3 × 3 @ 128 BN, ReLU × 2 MP 2 × 2 Pooling 2 × 2 3 × 3 @ 256 ReLU × 2 5 × 5 @ 256 BN, ReLU 3 × 3 @ 256 BN, ReLU × 2 3 × 3 @ 256 BN, ReLU × 2 MP 2 × 2 Pooling 2 × 2 3 × 3 @ 512 ReLU × 2 5 × 5 @ 512 BN, ReLU 3 × 3 @ 512 BN, ReLU × 2 3 × 3 @ 512 BN, ReLU × 2 MP 2 × 2\n\nResNet22\n\nResNet38 ResNet54 Log mel spectrogram 1000 frames ×64 mel bins 3 × 3 @ 512, BN, ReLU × 2\nPooling 2 × 2 BasicB @ 64 × 2 BasicB @ 64 × 3 BottleneckB @ 64 × 3 Pooling 2 × 2 BasicB @ 128 × 2 BasicB @ 128 × 4 BottleneckB @ 128 × 4 Pooling 2 × 2 BasicB @ 256 × 2 BasicB @ 256 × 6 BottleneckB @ 256 × 6 Pooling 2 × 2 BasicB @ 512 × 2 BasicB @ 512 × 3 BottleneckB @ 512 × 3 Pooling 2 × 2 3 × 3 @ 2048, BN, ReLU × 2\nGlobal pooling FC 2048, ReLU FC 527, Sigmoid probability of K sound classes in the audio clip. The target is denoted as y ∈ {0, 1} K . The loss function l for AudioSet tagging is calculated using binary cross-entropy:\nl = − N n=1 (y n lnf (x n ) + (1 − y n )ln(1 − f (x n )),(1)\nwhere N is the number of training samples. In training, the parameters of the neural network f (·) are optimized by minimizing the loss function l.\n\nB. ResNets 1) Conventional ResNets: Deeper CNNs have been shown to achieve better performance than shallower CNNs [33]. However, one challenge of very deep conventional CNNs is that the gradients do not propagate properly [34]. To solve this problem, ResNets [34] were proposed to introduce shortcut connections between convolutional layers. In this way the forward and backward signals can be directly propagated from one layer to any other layers. The shortcut connections introduce neither extra parameters nor additional computational complexity. A ResNet consists of several blocks, where each block consists of two convolutional layers with kernel sizes of 3 × 3 and a shortcut connection. Bottleneck blocks can be used to replace the basic blocks in a ResNet, where each bottleneck block consists of three convolutional layers with a network-in-network architecture [41].\n\n2) Adapting ResNets for AudioSet tagging: We adapt ResNet [34] for AudioSet tagging as follows. To begin with, two convolutional layers and a downsampling layer are applied on the log mel spectrogram to reduce the input size. We implement a 22-layer ResNet with 8 basic blocks. Furthermore, we implement a 38-layer and a 54-layer ResNet with basic blocks and residual blocks, respectively. Table II   parameters and multiply-add operations. The computational complexity is an important issue when systems are implemented to portable devices. For example, in robotics, selfdriving cars and augmented reality, the recognition tasks need to be carried out in a timely fashion on a computationallylimited platform [42]. MobileNets were designed to reduce the number of parameters and multiply-add operations in a CNN. MobileNets are based on depthwise separable convolutions by factorizing a standard convolution into a depthwise convolution and a 1×1 pointwise convolution [42]. MobileNetV1 was later improved by MobileNetV2 [43] by introducing inverted residuals to the residual blocks, which further reduced the number of parameters.\n\n2) Adapting MobileNets for AudioSet tagging: We adapt MobileNetV1 [42] and MobileNetV2 [43] systems for Au-dioSet tagging. Table III shows the configurations of Mo-bileNetV1 and MobileNetV2 for AudioSet tagging. V1Block and V2Blocks are MobileNet convolutional blocks [42], [43] and consists of two and three convolutional layers, respectively.\n\n\nD. One-dimensional CNNs\n\nPrevious audio tagging systems are based on the log mel spectrogram trained with CNN systems. However, the log mel spectrogram is also a hand-crafted feature. There were several works proposed to build one-dimensional CNNs on the timedomain waveforms. For example, Dai et al. proposed a onedimensional CNN [33] for solving acoustic scene classification problems. Lee et al. proposed a one-dimensional CNN [44], which was later adopted by [21] for music tagging.\n\n1) DaiNet: DaiNet [33] applied a kernel with a length of 80 and a stride of 4 to the input waveform of audio recordings. The kernels are learnable during training. After the first layer, a maximum operation is applied to remove phase information. The maximum operation was designed to improve the robustness of system to the phase shift of input signals. Then, several one-dimensional convolutional blocks with kernel sizes of 3 and strides of 4 were applied to extract high level features. In [33] an 18-layer DaiNet with four convolutional layers in each convolutional block had achieved the best classification performance on the UrbanSound8K dataset.\n\n2) LeeNet: Different from the DaiNet that applied large kernels in the first layer, LeeNet [44] applied small kernels with a length of 3 on the waveforms. LeeNet stacked the kernels with lengths of 3 to replace the fixed length windows for STFT. LeeNet is composed of several convolutional layers with kernel sizes of 3. Each convolutional layer was followed by a downsampling layer with a size of 2. The original LeeNet consists of 11 layers.\n\n3) Adapting one-dimensional CNNs for AudioSet tagging: We improve the LeeNet to a deeper architecture that has 24 layers by replacing each convolutional layer with a convolutional block that consists of two convolutional layers. To further increase the number of layers of the one-dimensional CNNs, we propose Res1dNet based on LeeNet with small kernel sizes of 3. We replace the convolutional blocks in LeeNet with residual blocks, where each basic residual block consists of two convolutional layers with kernel sizes of 3. The first and second convolutional layers of a convolutional block have dilations of 1 and 2 respectively to increase the receptive field of a residual block. Downsampling is applied after each residual block. By using 14 and 24 residual blocks, we obtain a Res1dNet31 and a Res1dNet51 with 31 and 51 layers, respectively.\n\n\nIII. PROPOSED WAVEGRAM-CNN SYSTEMS\n\nThe previously proposed one-dimensional CNN systems [33], [44], [21] do not outperform the systems using log mel spectrograms as input. One disadvantage of the previously proposed time-domain CNN systems [33], [44] is that they are not designed to capture frequency information. For example, the one-dimensional CNNs are not invariant to frequency shift of sound events, because the filters of one-dimensional CNNs only have one dimension that captures the time dependency but not the frequency information. In this section, we propose a novel Wavegram-CNN and a Wavegram-Logmel-CNN architecture for AudioSet tagging. Frequency patterns are important for audio pattern recognition. A classifier should be robust to the frequency shift of sound events. A melody played by a piano with shifted pitch should also be recognized as a piano. On the other hand, the frequency patterns of sound events can be learned by a two-dimensional CNN using log mel spectrograms as input. The disadvantage of log mel spectrograms is that the STFT and mel filter banks are manually selected pre-processing procedures which might not be optimal for audio pattern recognition. The one-dimensional CNNs do not require hand-crafted transforms and learn from time-domain waveforms directly. This can learn representations that are not captured by human. To solve this problem, we propose a Wavegram-CNN system to combine the advantage of a onedimensional CNN and a two-dimensional CNN.\n\n\nA. Wavegram-CNN systems\n\nFirst, we apply a one-dimensional CNN to a time-domain waveform. The one-dimensional CNN begins with a convo- lutional layer with a filter length of 11 and a stride of 5 to reduce the size of the input. This immediately reduces the input lengths by 5 times to reduce memory usage. Then, three convolutional blocks are applied where each convolutional block consists of two convolutional layers with dilations of 1 and 2, respectively. Each convolutional block is followed by a downsampling layer with a ratio of 4. By choosing these downsampling ratios, there are 100 frames of features in one second. We denote the output size of the one-dimensional CNN layers as T ×C, where T is the number of frames and C is the number of channels. We reshape this output to a tensor with a size of T × F × C/F , which is called Wavegram where F is the number of frequency bins in the Wavegram. This design ensures the Wavegram to learn frequency patterns and be invariant to frequency shift introduced by the application of a two-dimensional CNN on the Wavegram. The twodimensional CNN can be any architectures in Section II. In the following experiments, we adopt CNN14 as the twodimensional CNN for Wavegram-CNN for its simplicity and robustness in AudioSet tagging.\n\n\nB. Wavegram-Logmel-CNN\n\nIn addition to the Wavegram-CNN, we combine the Wavegram and the log mel spectrogram as inputs to a twodimensional CNN. This can utilize the information from both time-domain waveforms and log mel spectrograms. The Wavegram can be concatenated with feature maps of a log mel spectrogram extracted by convolutional layers. The Wavegram provides extra information for audio tagging as a complement to the log mel spectrogram. Figure 1 shows the architecture of the Wavegram-Logmel-CNN.\n\n\nIV. DATA PROCESSING\n\nIn this section, we introduce data processing for AudioSet tagging, including data balancing and data augmentation. Data balancing is a technique to solve the training problem of a highly unbalanced dataset. Data augmentation is another technique to enlarge the dataset to prevent systems from overfitting during training.\n\n\nA. Data balancing\n\nThe number of audio clips available for training for different sound classes is different in AudioSet. For example, there are over 900,000 audio clips belonging to the categories \"Speech\" and \"Music\". On the other hand, there are only tens of audio clips belonging to the category \"Toothbrush\", for example. The number of audio clips for different sound classes has a long tail distribution. In training an AudioSet tagging system, the data is input to the neural network in mini-batches. Without the balancing strategy, audio clips are uniformly sampled from AudioSet for training. The sound classes with more samples such as \"Speech\" are more likely to be sampled for training. In an extreme case, all samples in a mini-batch belong to the same sound class. This will cause the system to overfit to sound classes with more samples and underfit to sound classes with fewer samples. To solve this problem, we designed a balanced sampling strategy containing two stages in training. The first stage uniformly selects sound classes for training. The second stage samples audio clips from the selected sound classes. In each mini-batch, the numbers of audio clips for different sound classes are almost the same. We use the term \"almost\" because there can be multiple tags for an audio clip. Therefore, each mini-batch is almost balanced instead of strictly balanced.\n\n\nB. Data augmentation\n\nData augmentation is a useful way to prevent a system from overfitting. Some sound classes in AudioSet have few training samples which may limit the audio tagging performance. We applied Mixup [45] and SpecAugment [46] for AudioSet augmentation.\n\n1) Mixup: Mixup [45] is a way to augment a dataset by interpolating both the input and target of two samples from a dataset. For example, we denote the input as x 1 , x 2 and the target as y 1 , y 2 of two samples, respectively. Then, the augmented sample can be obtained by x = λx 1 + (1 − λ)x 2 and y = λy 1 + (1 − λ)y 2 , where λ is sampled from a Beta distribution. Mixup was shown to reduce the memorization of corrupt labels and increase the robustness to adversarial examples [45]. In AudioSet tagging, we only apply mixup to the samples that have been used for training at least once. We do not apply mixup to the samples that have not been used for training.\n\n2) SpecAugment: SpecAugment [46] was proposed for augmenting speech data for speech recognition. SpecAugment is operated on the log mel spectrogram of an audio clip and contains frequency masking and time masking. The frequency masking is applied such that f consecutive mel frequency   \n[0, F − f ],\nwhere F is the number of mel frequency channels [46]. There can be more than one frequency mask in each log mel spectrogram. The frequency mask can improve the robustness of the systems to frequency distortion of audio clips recorded with different devices. Time masking is similar to frequency masking but is applied in the time domain.\n\nV. TRANSFER TO OTHER TASKS We call the audio tagging systems pretrained on AudioSet as PANNs. To investigate the generalization ability of PANNs, we propose to transfer PANNs to a wide range of audio pattern recognition tasks. Previous works [22], [20], [23], [24], [26] of transfer learning mainly focused on music tagging, and were limited to smaller datasets than AudioSet. In addition, there is a lack of research on comparing the performance of different transfer learning methods including using pretrained neural networks as feature extractors and fine-tuning pretrained neural networks. In this work, we propose the following transfer learning strategies.\n\n1) Training a system from scratch. The architecture of a PANN is used for a new task except the final fully-connected layer. All parameters are randomly initialized. No information from the AudioSet dataset is used for training the new task. This training from scratch system is used as a baseline system to be compared with other transfer learning strategies.\n\n2) Using a PANN as a feature extractor. A PANN is used as a feature extractor for a new task. First, the embedding features of an audio clip are obtained from the penultimate layer of the PANN. Then, the embedding features are used as input to another classifier such as a fully-connected neural network. In training, the parameters of the PANN are not trained. Only the parameters of the classifier built on the embedding features are trained. Fig. 2(a) shows training a PANN with the AudioSet dataset. Fig. 2(b) shows transfer learning with using the PANN as a feature extractor. The D AudioSet and D NewTask denotes the AudioSet dataset and a new task dataset. The FC AudioSet and FC NewTask denote the fully connected layer for AudioSet tagging and the classification or tagging of a new task. The input and prediction are denoted as x j and y j , respectively, where j is the index of task.   (3) Fine-tuning a PANN. The architecture of a PANN is used for a new task except the final fully-connected layer. All parameters to calculate the embedding features are initialized from the PANN instead of being randomly initialized. The fully connected layers after the embedding features are randomly initialized. During the training on a new task, all parameters are fine-tuned. Fig. 2(c) shows the diagram of finetuning a PANN.\n\nVI. EXPERIMENTS First, we evaluate AudioSet tagging performance with the proposed systems. Then, the PANNs are transferred to several audio pattern recognition datasets including acoustic scene classification, general audio tagging, music classification and speech emotion classification.\n\n\nA. AudioSet\n\nAudioSet is a large-scale audio dataset with an ontology of 527 sound classes [1]. The audio clips from AudioSet are extracted from YouTube videos. The training set consists of 2,063,839 audio clips including a balanced subset of 22,160 audio clips. The evaluation set consists of 20,371 audio clips. Instead of using the embedding features provided by [1], we download the audio clips from the internet using the links provided by [1] and skip the audio clips that are not downloadable. We successfully downloaded 1,934,187 audio clips in the full training set including 20,550 audio clips in the balanced training set. We successfully downloaded 18,887 audio clips in the evaluation dataset. We padded the audio clips to 10 seconds with silence if they were shorter than 10 seconds. Considering the fact that a large amount of audio clips from YouTube are monophonic and have a low sampling rate, we convert all audio clips to monophonic and resampled them to 32 kHz.\n\nWe extract log mel spectrograms for the CNN systems. STFT is applied on the waveform with a hamming window size of 1024 [35] and a hop size of 320 samples to obtain the spectrograms. This leads to 100 frames in a second mel spectrogram. We compare using different hop sizes in our experiments. We apply 64 mel filter banks to calculate the log mel spectrogram following [35]. The cut off frequencies of the mel banks are 50 Hz and 14 kHz to remove low frequency noise and aliasing effects. The log mel spectrogram of a 10second audio clip has a shape of 1000 × 64. \n\n\nB. Evaluation metrics\n\nMean average precision (mAP), mean area under the curve (mAUC) and d-prime are used as official evaluation metrics for AudioSet tagging [1]. Average precision (AP) is the area under the recall and precision curve. AP does not depend on the number of true negatives because neither precision nor recall depends on the number of true negatives. On the other hand, AUC is the area under the false positive rate and true positive rate (recall) which reflects the influence of the true negatives. The d-prime can be calculated from AUC [1]. All metrics are calculated on individual classes and then averaged across all classes. These metrics are also called macro metrics.\n\nC. AudioSet tagging results 1) Comparison with previous methods: Table IV shows the comparison of previous AudioSet tagging methods and our proposed CNN14. The random guess achieves an mAP of 0.005, an AUC of 0.500 and a d-prime of 0.000. The result released by Google [1] trained with embedding features from [14] achieved an mAP of 0.314 and an AUC of 0.959. The single-level attention and multi-level attention systems achieved mAPs of 0.337 and 0.360, which were later improved by a large feature-level attention neural network that achieved an mAP of 0.369. Wang et al. [18] investigated five different types of attention functions and achieved an mAP of 0.362. All the above systems were built on the embedding features released by [1]. The recent DeepRes system [47] built audio tagging systems on waveforms downloaded from YouTube and have achieved an mAP of 0.392. The bottom row shows our proposed CNN14 system achieves an mAP of 0.431 and outperforms the previous state-of-the-art systems by a large margin.\n\n2) Class-wise performance: Fig. 3 shows the class-wise AP of different sound classes with the CNN14 system. The left, middle and right columns shows the AP of sound classes sorted by the number of training samples in descending order. The performance of different sound classes can be very different. For example, \"Music\" and \"Speech\" achieve APs of over 0.8. On the other hand, some sound classes such as \"Inside, small\" achieve an AP of only 0.19. Fig. 3 shows that the APs are usually not correlated with the number of training samples. For example, the left column shows that \"Inside, small\" contains 70,159 training samples while its AP is low. On the other hand, the right column shows that \"Hoot\" only has 106 training samples but achieves an AP of 0.86 that is larger than many other sound classes with more training samples. Fig. 11 shows the class-wise comparison of CNN14, MobileNetV1 system with the previous audio tagging system [19] built with embedding features extracted by [1]. The blue bars show the number of training samples in logarithmic scale. The plus symbols indicate label quality between 0 and 1. The red symbols indicate the classes where label quality is not available. Fig. 11 shows that our proposed CNN14 outperform the system in [19] in a wide range of sound classes.\n\n3) Hop sizes: Hop size is the number of samples between adjacent frames. A smaller hop size leads to higher resolution in the time domain. Hop size is a hyper-parameter which controls the time domain resolution of log mel spectrograms. We investigate the influences of different hop sizes on AudioSet tagging with the CNN14 system. Hop sizes of 1000, 640, 500 and 320 are experimented which correspondingly result in time domain resolutions of 31.25 ms, 20.00 ms, 15.63 ms and 10.00 ms between adjacent frames. Table V shows that the mAP increases with smaller hop sizes. The system with a hop size of 320 achieves an mAP of 0.431, outperforming the other hop sizes of 500, 640 and 1000. 4) Embedding dimensions: Embedding features are fixedlength vectors that summarize an audio clip. The embedding feature vector of the previous CNN14 system has a dimension of 2048. In some applications, compact embeddings with smaller dimensions are required for computational efficiency. \n\n\n5) Number of CNN layers:\n\nWe investigate the performance of CNNs with 6, 10 and 14 layers described in Section II-A. Table VII shows that the 6-, 10-and 14-layer CNNs achieve mAPs of 0.343, 0.380 and 0.431, respectively. In contrast to the results that deeper CNNs with more than 9 layers underperform CNN with 9 layers trained on the DCASE datasets [35], we show that with the large-scale AudioSet dataset the 14-layer CNN system can outperform the 10layer in mAP by a large margin. Results show that with the increased number of convolutional layers, the performance of systems improves. This is because large-scale dataset is able to make advantage of deeper CNNs without overfitting, whereas smaller datasets suffer from overfitting, so shallower CNNs achieve better performance for small-scale dataset. 6) ResNets: To further investigate the AudioSet tagging performance with the increased number of convolutional layers, we evaluate the AudioSet tagging performance with ResNets. Table VII shows that ResNet22 achieves an mAP of 0.430 that is similar to the CNN14 system. ResNet38 achieves an mAP of 0.434 which slightly outperforms other systems. ResNet54 achieves an mAP of 0.429, which does not further improve the performance and may be caused by overfitting. 7) MobileNets: Previous systems show that the CNN systems have achieved good performance in AudioSet tagging. However, those systems do not consider the computational efficiency when systems are implemented in portable devices. We investigate the performance of AudioSet tagging with light weight MobileNets. Table VII shows that MobileNetV1 achieves an mAP of 0.389, which is 0.042 lower than the CNN14 system. The number of multiplication and addition operations (multi-adds) and parameters of the MobileNetV1 are only 8.6% and 5.9% of the CNN14 system. The MobileNetV2 achieves an mAP 0f 0.383 and is more computationally  efficient than MobileNetV1, where the number of multi-adds and parameters are only 6.7% and 5.0% of CNN14 which greatly reduces the computational cost. Table VII shows the performance of one-dimensional CNNs. The DaiNet with 18 layers [33] achieves an mAP of 0.295. The LeeNet11 with 11 layers [44] achieves an mAP of 0.266. Our extended LeeNet with 24 layers improves the mAP from 0.266 to 0.336. Furthermore, our proposed Res1dNet31 and Res1dNet51 systems achieve mAPs of 0.365 and 355, respectively, and have achieved the state-of-the-art performance among the one-dimensional CNN systems. Table VII show the result of our proposed Wavegram-CNN and Wavegram-Logmel-CNN systems. The Wavegram-CNN system achieves an mAP of 0.389, outperforming the best previous onedimensional CNN system ResNet30 of 0.365. This indicates that the proposed combination of one-dimensional and twodimensional CNNs are effective in audio pattern recognition. Furthermore, our proposed Wavegram-Logmel-CNN system achieves a state-of-the-art result among all AudioSet tagging systems with mAP, mAUC and d-prime of 0.439, 0.973 and 2.720, respectively. 10) Complexity analysis: We analyze the computational complexity of the aforementioned pattern recognition systems. The number of multi-adds and parameters are two important factors for systems running on portable devices. The middle column of Table VIII shows the number of multi-adds to infer a 10-second audio clip. The unit prefix \"G\" indicates 10 9 . The right column of Table VIII shows the number of parameters of different systems. The number of multi-adds and parameters of the CNN14 system are 42.220 G and around 81 million, which are larger than the CNN6 and CNN10 systems. The number of multi-adds of the ResNets22 and ResNet38 are slightly less than the CNN14 system. The ResNet54 system contains the most multi-adds of 54.563 G. The one-dimensional CNNs have a similar computational cost as the two-dimensional CNNs. The best one-dimensional system Res1dNet31 contains 32.688 G multi-adds and around 80 million parameters. Our proposed Wavegram-CNN contains 44.234 G multi-adds and around 81 million parameters. The Wavegram-Logmel-CNN slightly increases the multi-adds to 53.510 G. The number of parameters is around 81 million, which is not much more. To reduce the number of multi-adds and parameters, MobileNets are applied. The MobileNetV1 and MobileNetV2 are light weight CNNs, with only 3.614 G and 2.810 G multi-adds and around 5 million and 4 million parameters, respectively. The MobileNets greatly reduce the computational cost and the system size while minimizing the impact on performance. Figure 4 shows the multi-adds versus mAP of different AudioSet tagging systems. The same type of systems are grouped in the same color. The multiadds increases from left to right. The mAP increases from bottom to top. On the top-right is our proposed Wavegram-Logmel-CNN system that achieves the best mAP. On the topleft are MobileNetV1 and MobileNetV2 that are the most computationally efficient systems that do not reduce the mAP much.\n\n\n8) One-dimensional CNNs:\n\n\n9) Wavegram-CNN: The bottom rows of\n\n\nD. Transfer to other tasks\n\nIn this section we apply PANNs trained on AudioSet to other pattern recognition tasks. We resampled audio recordings to 32 kHz and converted audio recordings to monophonic to be consistent with the PANNs trained on AudioSet. We perform experiments the transfer learning strategies in Section V. For the strategy using a PANN as the feature extractor, we call the system using one and three fully-connected layers on the embedding features Freeze_L1 and Freeze_L3, respectively. We adopt CNN14 as the base system for transfer learning to other tasks for its simplicity and robustness to AudioSet tagging. Few-shot learning is an important issue in audio pattern recognition. This is because for some tasks, only a limited number of training samples are provided. To investigate the performance of the systems with few-shot learning, we evaluate the systems trained with a various number of training samples. This can show how PANNs can help audio pattern recognition using few training samples.\n\n1) ESC-50: ESC-50 is an environmental sounds dataset [49] consisting of 50 sound events in total such as \"Dog\" and \"Rain\". There are 2,000 5-second audio clips in the    [49] accuracy of systems. The Previous state-of-the-art system [48] achieved an accuracy of 0.865 using unsupervised filterbank learning which uses a convolutional restricted Boltzmann machine. Our system fine-tuned on PANN achieves an accuracy of 0.947 and outperforms the previous state-of-the-art system with a large margin. The Freeze_L1 and Freeze_L3 systems achieve an accuracy of 0.918 and 0.908, respectively. Training the system from scratch achieves an accuracy of 0.833. Fig. 5 shows the accuracy of PANNs with various numbers of training samples of each sound class. Using PANN as a feature extractor achieves the best performance when only a few samples are available such as fewer than 10 samples per sound class. When more training samples are available, the fine-tuned PANN achieves better performance. Both the fine-tuned system and the system using the PANN as a feature extractor outperform the systems trained from scratch.\n\n2) DCASE 2019 Task 1: The DCASE 2019 Task 1 is an acoustic scene classification task [2]. The DCASE 2019 Task 1 dataset consists of over 40 hours of recordings collected from various acoustic scenes in 12 large European cities. We focus on subtask A where each audio recording has two channels and the sampling rate is 48 kHz. In the development set, there are 9185 and 4185 audio clips for training and validation, respectively. We convert stereo recordings to monophonic by averaging the stereo channels. The state-of-the-art system has achieved an accuracy of 0.851 using the combination of various classifiers that use stereo recordings as input [50]. We only use the monophonic information in our systems. CNN14 trained from scratch achieves an accuracy of 0.691. The finetuned PANN achieved an accuracy of 0.764. Freeze_L1 and Freeze_L2 achieve an accuracy of 0.689 and 0.607, which means they do not outperform the system trained from scratch. One explanation is that the task of acoustic scene classification is different from AudioSet tagging so using PANN as a feature extractor did not outperform training from scratch. Still, the fine-tuned system achieves the best performance. Fig. 6 shows     the classification accuracy of systems with various numbers of training samples per class.\n\n\n3) DCASE 2018 Task 2:\n\nThe DCASE 2018 Task 2 is a general-purpose automatic audio tagging task [53] consisting of audio recordings from Freesound annotated using a vocabulary of 41 labels from the AudioSet ontology. The development set consists of 9,473 audio recordings with durations from 300 ms to 30 s. Table XI shows that the best previous method achieved an mAP@3 of 0.954 using an ensemble of several systems [51]. The system trained from scratch achieved an accuracy of 0.902. The fine-tuned PANN achieves an mAP@3 of 0.941. The Freeze_L1 and Freeze_L3 systems achieve an accuracy of 0.717 and 0.768. Fig. 7 shows the mAP@3 with various numbers of training samples. The fine-tuned PANN outperforms the systems trained from scratch and the systems using PANN as a feature extractor. The fine-tuned PANN achieves comparable results to the state-of-the-art system. 4) MSoS: The Making Sense of Sounds (MSoS) data challenge [54] is a task to assign an audio recording to one of  five categories: \"Nature\", \"Music\", \"Human\", \"Effects\" and \"Urban\". The dataset consists of a development set of 1,500 audio clips and an evaluation set of 500 audio clips. All audio clips have a duration of 4 seconds. The state-of-the-art system applied transfer learning [52] and achieved an accuracy of 0.930. Our fine-tuned PANN achieves an accuracy of 0.960, which outperforms the previous state-of-the-art system. The system trained from scratch achieves an accuracy of 0.760. Fig. 8 shows the accuracy of the systems with respect to the number of training samples. With fewer samples, the finetuned system and the system using PANN as feature extractor outperform the system trained from scratch.\n\n\n5) GTZAN:\n\nThe GTZAN dataset [56] is a music genre classification dataset containing 1,000 30-second music clips of 10 genres of music such as \"Classical\" and \"Country\". All music clips have a duration of 30 seconds and a sampling rate of 22,050 Hz. In development, 10-fold cross validation is used to evaluate the performance of the systems. Table XIII shows that the previous state-of-the-art system achieved an accuracy of 0.939 using a bottom-up broadcast neural network [55]. The system fine-tuned on PANN achieves an accuracy of 0.915, outperforming the system trained from scratch with an accuracy of 0.758 and the Freeze_L1 and Freeze_L3 systems with an accuracy of 0.827 and 0.858, respectively. Fig. 9 shows the accuracy of systems with various numbers of training samples. The Freeze_L1 and Freeze_L3 systems achieve better performance than other systems when less than 10 samples per class are used as training data. With more training samples, the fine-tuned PANN performs better than other systems. 6) RAVDESS: The Ryerson Audio-Visual Database of Emotional Speech and Song (RAVDESS) is a human speech emotion dataset [58]. The database consists of speech of 24 professional actors including 12 female and 12 male in 8 emotions such as \"Happy\" and \"Sad\". The task is to classify each speech into an emotion. There are 1,440 audio clips in the development set. We evaluate our systems with 4-fold cross validation. Table XIV shows that the previous state-ofthe-art system achieved an accuracy of 0.645 using a CNN [57]. The system trained from scratch achieved an accuracy     Fig. 10 shows the accuracy of systems with respect to a range of training samples. The fine-tuned systems and the system trained from scratch outperform systems using PANN as a feature extractor. This indicates that systems should be finetuned or retrained for fine-grained classification tasks such as recognizing different emotions of speech.\n\n\nE. Discussion\n\nIn this section we first evaluate the AudioSet tagging performance with different systems. Our adapted CNNs, ResNets and MobileNets have outperformed the previous state-of-theart AudioSet tagging systems, for example, CNN14 achieves an mAP of 0.431 and ResNet38 achieves an mAP of 0.434. MobileNets are light-weight systems that have fewer multi-adds and numbers of parameters, for example, Mo-bileNetV1 retains an mAP of 0.389 that do not reduce the performance much. Our adapted one-dimensional system Res1dNet31 achieves an mAP of 0.365, outperforming the DaiNet [33] of 0.295 and LeeNet11 [44] of 0.266. Our proposed Wavegram-CNN achieves the highest mAP of 0.389 among one-dimensional systems. Furthermore, the Wavegram-Logmel-CNN system achieves a state-of-the-art mAP of 0.439 among all systems.\n\nThe PANNs pretrained on AudioSet dataset are then transferred to six audio pattern recognition tasks. Many of previous state-of-the art systems applied the ensemble of different systems to obtain the best performance on one task. On the other hand, we do not apply ensemble of systems and only use the output of one PANN as prediction. The same PANN is used for all tasks. Still, the fine-tuned PANNs have achieved state-of-the-art performance in the ESC-50, MSOS and RAVDESS classification tasks, and have approached the state-of-the-art performance in the DCASE 2018 Task 2 and GTZAN classification tasks. All system performance increases with the number of training samples. Compared with training from scratch and using PANN as the feature extractor, the fine-tuned PANN achieves the best performance in all tasks. The experiments show that PANNs have been successful for general audio pattern recognition tasks.\n\nThe source code and pretrained models of PANNs are publicly available 1 . The source code of a demo with graphical user interface is available too 2 .\n\nVII. CONCLUSION This work proposes pretrained audio neural networks (PANNs) trained on the large-scale AudioSet for audio pattern recognition. A wide range of convolutional neural networks (CNNs) are explored to solve the AudioSet tagging problem. We propose a Wavegram-Logmel-CNN that has achieved the state-of-the-art performance in AudioSet tagging. Both the AudioSet tagging performance and computational efficiency of PANNs are investigated. The PANNs are transferred to a wide range of audio pattern recognition tasks and have outperformed several previous state-of-the-art systems. The PANNs have been shown to help few-shot audio pattern recognition tasks where only limited training samples are available. In the future, we will extend the PANNs to more audio pattern recognition tasks.  Average precision AP with averaging instances (baseline) AP with cnn13 AP with mobilenetv1 Label quality Fig. 11. Class-wise performance of AudioSet tagging systems. Red, blue and black curves are APs of CNN14, MobileNetV1 and the audio tagging system [19] built with embedding features extracted by [1].\n\n\nBagpipes\n\nSignal Processing Conference (EUSIPCO). IEEE, 2016, pp. 1128-1132.\n\n[28] D. Li, I. K. Sethi, N. Dimitrova, and T. McGee, \"Classification of general audio data for content-based retrieval,\" Pattern Recognition Letters, vol. 22, no. 5, pp. 533-544, 2001.\n\n[29] L. Vuegen, B. Broeck, P. Karsmakers, J. F. Gemmeke, B. Vanrumste,\n\nFig. 1 .\n1Architecture of Wavegram-Logmel-CNN\n\nFig. 2 .\n2(a) A PANN is pretrained with the AudioSet dataset. (b) For a new task, the PANN is used as the feature extractor. A classifier is built on the extracted embedding features. The shadow rectangle indicates the parameters are frozen and not trained. (c) For a new task, the parameters of a neural network are initialized with a PANN. Then, fine-tune all parameters of the neural network on the new task. channels [f 0 , f 0 + f ] are masked, where f is chosen from a uniform distribution from 0 to the frequency mask parameter f , and f 0 is chosen from\n\nFig. 3 .\n3Class-wise AP of sound events with CNN14 system. The number inside parentheses indicates the number of training samples. The left, middle and right columns show the AP of sound classes sorted by number of training samples in descending order. The left, middle, right columns show the number of training samples ranked the 1-10, 250-260 and 517-527 in the training set of AudioSet.\n\nFig. 4 .\n4Multi-adds versus mAP of AudioSet tagging systems. The same types of architectures are grouped in the same color.\n\nFig. 5 .\n5Accuracy of ESC-50 with various number of training samples per class.\n\nFig. 6 .\n6Accuracy of DCASE 2019 Task 1 with various number of training samples per class.\n\nFig. 7 .\n7Accuracy of DCASE 2018 Task 2 with various number of training samples per class.\n\nFig. 8 .\n8Accuracy of MSoS with various number of training samples per class.\n\nFig. 9 .\n9Accuracy of GTZAN with various number of training samples per class.\n\nFig. 10 .\n10Accuracy of RAVDESS with various number of training samples per class.\n\nTABLE I CNNS\nIFOR AUDIOSET TAGGINGVGGish [1] \nCNN6 \nCNN10 \nCNN14 \nLog-mel spectrogram \n96 frames × 64 mel bins \n\nLog-mel spectrogram \n1000 frames × 64 mel bins \n3 × 3 @ 64 \nReLU \n\n5 × 5 @ 64 \nBN, ReLU \n\n3 × 3 @ 64 \nBN, ReLU \n× 2 \n3 × 3 @ 64 \nBN, ReLU \n× 2 \n\nMP 2 × 2 \nPooling 2 × 2 \n3 × 3 @ 128 \nReLU \n\n5 × 5 @ 128 \nBN, ReLU \n\n\n\nTABLE II RESNETS\nIIFOR AUDIOSET TAGGING\n\n\nshows the architecture of ResNet systems for AudioSet tagging. The BasicB and BottleneckB are abbreviations of basic block and bottleneck block, respectively.C. MobileNets \n\n1) Conventional MobileNets: CNNs and ResNets intro-\nduced in the above subsections contain a large amount of \n\n\n\nTABLE III MOBILENETS\nIIIFOR AUDIOSET TAGGINGMobileNetV1 \nMobileNetV2 \n3 × 3 @ 32, BN, ReLU \nPooling 2 × 2 \nV1Block @ 64 \nV1Block @ 128 \n\nV2Block, t=1 @ 16 \n(V2Block, t=6 @ 24) × 2 \nPooling 2 × 2 \nV1Block @ 128 \nV1Block @ 256 \n(V2Block, t=6 @ 32) × 3 \n\nPooling 2 × 2 \nV1Block @ 256 \nV1Block @ 512 \n(V2Block, t=6 @ 64) × 4 \n\nPooling 2 × 2 \n(V1Block @ 512) × 5 \nV1Block @ 1024 \n(V2Block, t=6 @ 96) × 3 \n\nPooling 2 × 2 \n\nV1Block @ 1024 \n(V2Block, t=6 @ 160) × 3 \n(V2Block, t=6 @ 320) × 1 \nGlobal pooling \nFC, 1024, ReLU \nFC, 527, Sigmoid \n\n\n\nTABLE IV COMPARISON\nIVWITH PREVIOUS METHODS \n\nmAP \nAUC \nd-prime \n\nRandom guess \n0.005 0.500 \n0.000 \nGoogle CNN [1] \n0.314 0.959 \n2.452 \nSingle-level attention [15] \n0.337 0.968 \n2.612 \nMulti-level attention [16] \n0.360 0.970 \n2.660 \nLarge feature-level attention [19] 0.369 0.969 \n2.640 \nTAL Net [18] \n0.362 0.965 \n2.554 \nDeepRes [47] \n0.392 0.971 \n2.682 \n\nOur proposed CNN14 \n0.431 0.973 \n2.732 \n\n\n\nTABLE V RESULTS\nVOF DIFFERENT HOP SIZESHop size Time resolution \nmAP \nAUC \nd-prime \n\n1000 \n31.25 ms \n0.400 0.969 \n2.645 \n640 \n20.00 ms \n0.417 0.972 \n2.711 \n500 \n15.63 ms \n0.417 0.971 \n2.682 \n320 \n10.00 ms \n0.431 0.973 \n2.732 \n\nTABLE VI \nRESULTS OF DIFFERENT EMBEDDING DIMENSIONS \n\nEmbedding dimension \nmAP \nAUC \nd-prime \n\n32 \n0.364 0.958 \n2.437 \n128 \n0.412 0.969 \n2.634 \n512 \n0.420 0.971 \n2.689 \n2048 \n0.431 0.973 \n2.732 \n\n\n\nTABLE VII RESULTS\nVIIOF AUDIOSET TAGGING SYSTEMSmAP \nAUC \nd-prime \n\nCNN6 \n0.343 0.965 \n2.568 \nCNN10 \n0.380 0.971 \n2.678 \nCNN14 \n0.431 0.973 \n2.732 \n\nResNet22 \n0.430 0.973 \n0.270 \nResNet38 \n0.434 0.974 \n2.737 \nResNet54 \n0.429 0.971 \n2.675 \n\nMobileNetV1 \n0.389 0.970 \n2.653 \nMobileNetV2 \n0.383 0.968 \n2.624 \n\nDaiNet [33] \n0.295 0.958 \n2.437 \nLeeNet11 [44] \n0.266 0.953 \n2.371 \nLeeNet18 \n0.336 0.963 \n2.525 \nRes1dNet31 \n0.365 0.958 \n2.444 \nRes1dNet51 \n0.355 0.948 \n2.295 \n\nWavegram-CNN \n0.389 0.968 \n2.612 \nWavegram-Logmel-CNN 0.439 0.973 \n2.720 \n\nWe investigate building CNN14 with embedding dimensions \nof 32, 128, 512 and 2048, respectively. Table VI shows that \nwith an embedding dimension of 2048, an mAP of 0.431 is \nachieved. The mAPs slightly decrease to 0.420 and 0.412 with \nembedding dimensions of 512 and 128. The mAP drops to \n0.364 with an embedding dimension of 32. \n\n\nTABLE VIII NUMBER\nVIIIOF MULTI-ADDS AND PARAMETERS OF DIFFERENT SYSTEMSMulti-Adds \nParameters \n\nCNN6 \n21.986 G \n4,837,455 \nCNN10 \n21.986 G \n4,837,455 \nCNN14 \n42.220 G \n80,753,615 \nResNet22 \n30.081 G \n63,675,087 \nResNet38 \n48.962 G \n73,783,247 \nResNet54 \n54.563 G 104,318,159 \nMobileNetV1 \n3.614 G \n4,796,303 \nMobileNetV2 \n2.810 G \n4,075,343 \nDaiNet \n30.395 G \n4,385,807 \nLeeNet \n4.741 G \n748,367 \nLeeNet24 \n26.369 G \n10,003,791 \nRes1dNet31 \n32.688 G \n80,464,463 \nRes1dNet51 \n61.833 G 106,538,063 \nWavegram-CNN \n44.234 G \n80,991,759 \nWavegram-Logmel-CNN \n53.510 G \n81,065,487 \n\n0 \n10 \n20 \n30 \n40 \n50 \n60 \n70 \nMulti-adds (million) \n\n0.20 \n\n0.25 \n\n0.30 \n\n0.35 \n\n0.40 \n\n0.45 \n\n0.50 \n\nmAP \nCnn6 \n\nCnn10 \n\nCnn14 \n\nResNet22 \nResNet38 \nResNet54 \n\nMobileNetV1 \n\nMobileNetV2 \n\nDaiNet \n\nLeeNet \n\nLeeNet18 \n\nRes1dNet30 \n\nRes1dNet44 \n\nWavegram-CNN \n\nWavegram-\nLogmel-CNN \n\n\n\nTABLE IX\nIXACCURACY OF ESC-50 \n\nSTOA [48] Scratch fine-tune Freeze_L1 Freeze_L3 \n\nAcc. \n0.865 \n0.833 \n0.947 \n0.908 \n0.918 \n\ndataset with 40 samples per class. Table IX shows the 5-\nfold cross validation \n\nTABLE X\nXACCURACY OF DCASE 2019 TASK 1 \n\nSTOA [50] Scratch Fine-tune Freeze_L1 Freeze_L3 \n\nAcc. \n0.851 \n0.691 \n0.764 \n0.589 \n0.607 \n\n2 \n5 \n10 \n32 (all) \n\nTraining samples per class \n\n0.0 \n\n0.2 \n\n0.4 \n\n0.6 \n\n0.8 \n\n1.0 \n\nMap@3 \n\nFinetune \nScratch \nFreeze + 1layer \nFreeze + 3 layers \n\n\n\nTABLE XI\nXIACCURACY OF DCASE 2018 TASK 2 \n\nSTOA [51] Scratch Fine-tune Freeze_L1 Freeze_L3 \n\nAcc. \n0.954 \n0.902 \n0.941 \n0.717 \n0.768 \n\n\n\nTABLE XII\nXIIACCURACY OF MSOS \n\nSTOA [52] Scratch Fine-tune Freeze_L1 Freeze_L3 \n\nAcc. \n0.930 \n0.760 \n0.960 \n0.886 \n0.930 \n\n\n\nTABLE XIII\nXIIIACCURACY OF GTZAN \n\nSTOA [55] Scratch Fine-tune Freeze_L1 Freeze_L3 \n\nAcc. \n0.939 \n0.758 \n0.915 \n0.827 \n0.858 \n\n2 \n5 \n10 \n20 \n50 \n192 (all) \n\nTraining samples per class \n\n0.0 \n\n0.2 \n\n0.4 \n\n0.6 \n\n0.8 \n\n1.0 \n\nAccuracy \n\nFinetune \nScratch \nFreeze + 1layer \nFreeze + 3 layers \n\n\n\nTABLE XIV\nXIVACCURACY OF RAVDESS \n\nSTOA [57] Scratch Fine-tune Freeze_L1 Freeze_L3 \n\nAcc. \n0.645 \n0.692 \n0.721 \n0.397 \n0.401 \n\nof 0.692. The system fine-tuned on PANN achieves a state-\nof-the-art accuracy of 0.721. The Freeze_L1 and Freeze_L3 \nsystems achieve an accuracy of 0.397 and 0.401. \n\nAudio Set: An ontology and humanlabeled dataset for audio events. J F Gemmeke, D P Ellis, D Freedman, A Jansen, W Lawrence, R C Moore, M Plakal, M Ritter, IEEE International Conference on Acoustics, Speech and Signal Processing. J. F. Gemmeke, D. P. Ellis, D. Freedman, A. Jansen, W. Lawrence, R. C. Moore, M. Plakal, and M. Ritter, \"Audio Set: An ontology and human- labeled dataset for audio events,\" in IEEE International Conference on Acoustics, Speech and Signal Processing (ICASSP), 2017, pp. 776-780.\n\nA multi-device dataset for urban acoustic scene classification. A Mesaros, T Heittola, T Virtanen, Workshop on Detection and Classification of Acoustic Scenes and Events (DCASE). A. Mesaros, T. Heittola, and T. Virtanen, \"A multi-device dataset for urban acoustic scene classification,\" in Workshop on Detection and Classification of Acoustic Scenes and Events (DCASE), 2018, pp. 9- 13.\n\nPolyphonic sound event detection using multi label deep neural networks. E Cakir, T Heittola, H Huttunen, T Virtanen, International Joint Conference on Neural Networks (IJCNN). E. Cakir, T. Heittola, H. Huttunen, and T. Virtanen, \"Polyphonic sound event detection using multi label deep neural networks,\" in International Joint Conference on Neural Networks (IJCNN), 2015.\n\nRecognition of emotional speech for younger and older talkers: Behavioural findings from the toronto emotional speech set. K Dupuis, M K Pichora-Fuller, Canadian Acoustics. 393K. Dupuis and M. K. Pichora-Fuller, \"Recognition of emotional speech for younger and older talkers: Behavioural findings from the toronto emotional speech set,\" Canadian Acoustics, vol. 39, no. 3, pp. 182-183, 2011.\n\nClassification of snoring sound based on a recurrent neural network. S J Lim, S J Jang, J Y Lim, J H Ko, Expert Systems with Applications. 123S. J. Lim, S. J. Jang, J. Y. Lim, and J. H. Ko, \"Classification of snoring sound based on a recurrent neural network,\" Expert Systems with Applications, vol. 123, pp. 237-245, 2019.\n\nModeling and classification of natural sounds by product code hidden Markov models. J P Woodard, IEEE Transactions on Signal Processing. 407J. P. Woodard, \"Modeling and classification of natural sounds by product code hidden Markov models,\" IEEE Transactions on Signal Processing, vol. 40, no. 7, pp. 1833-1835, 1992.\n\nDetecting alarm sounds. D P W Ellis, https:/academiccommons.columbia.edu/doi/10.7916/D8F19821/downloadD. P. W. Ellis, \"Detecting alarm sounds,\" in https:// academiccommons. columbia.edu/ doi/ 10.7916/ D8F19821/ download, 2001.\n\nDetection and classification of acoustic scenes and events. D Stowell, D Giannoulis, E Benetos, M Lagrange, M D Plumbley, IEEE Transactions on Multimedia. 1710D. Stowell, D. Giannoulis, E. Benetos, M. Lagrange, and M. D. Plumbley, \"Detection and classification of acoustic scenes and events,\" IEEE Transactions on Multimedia, vol. 17, no. 10, pp. 1733-1746, 2015.\n\nDetection and classification of acoustic scenes and events: Outcome of the DCASE 2016 challenge. A Mesaros, T Heittola, E Benetos, P Foster, M Lagrange, T Virtanen, M D Plumbley, IEEE/ACM Transactions on Audio, Speech and Language Processing. 262TASLP)A. Mesaros, T. Heittola, E. Benetos, P. Foster, M. Lagrange, T. Virtanen, and M. D. Plumbley, \"Detection and classification of acoustic scenes and events: Outcome of the DCASE 2016 challenge,\" IEEE/ACM Transactions on Audio, Speech and Language Processing (TASLP), vol. 26, no. 2, pp. 379-393, 2018.\n\nDCASE 2017 challenge setup: Tasks, datasets and baseline system. A Mesaros, T Heittola, A Diment, B Elizalde, A Shah, E Vincent, B Raj, T Virtanen, Workshop on Detection and Classification of Acoustic Scenes and Events. A. Mesaros, T. Heittola, A. Diment, B. Elizalde, A. Shah, E. Vincent, B. Raj, and T. Virtanen, \"DCASE 2017 challenge setup: Tasks, datasets and baseline system,\" in Workshop on Detection and Classification of Acoustic Scenes and Events (DCASE), 2017, pp. 85-92.\n\n. DCASE Challenge. \"DCASE Challenge 2019,\" http://dcase.community/challenge2019.\n\nImageNet: A large-scale hierarchical image database. J Deng, W Dong, R Socher, L.-J Li, K Li, L Fei-Fei, IEEE Conference on Computer Vision and Pattern Recognition. J. Deng, W. Dong, R. Socher, L.-J. Li, K. Li, and L. Fei-Fei, \"ImageNet: A large-scale hierarchical image database,\" in IEEE Conference on Computer Vision and Pattern Recognition (CVPR), 2009, pp. 248-255.\n\nBERT: Pretraining of deep bidirectional transformers for language understanding. J Devlin, M.-W Chang, K Lee, K Toutanova, Annual Conference of the North American Chapter of the Association for Computational Linguistics (NAACL). J. Devlin, M.-W. Chang, K. Lee, and K. Toutanova, \"BERT: Pre- training of deep bidirectional transformers for language understanding,\" in Annual Conference of the North American Chapter of the Association for Computational Linguistics (NAACL), 2018, pp. 4171-4186.\n\nCNN architectures for large-scale audio classification. S Hershey, S Chaudhuri, D P Ellis, J F Gemmeke, A Jansen, R C Moore, M Plakal, D Platt, R A Saurous, B Seybold, IEEE International Conference on Acoustics, Speech and Signal Processing. S. Hershey, S. Chaudhuri, D. P. Ellis, J. F. Gemmeke, A. Jansen, R. C. Moore, M. Plakal, D. Platt, R. A. Saurous, B. Seybold et al., \"CNN architectures for large-scale audio classification,\" in IEEE International Conference on Acoustics, Speech and Signal Processing (ICASSP), 2017, pp. 131-135.\n\nAudio Set classification with attention model: A probabilistic perspective. Q Kong, Y Xu, W Wang, M D Plumbley, IEEE International Conference on Acoustics, Speech and Signal Processing. Q. Kong, Y. Xu, W. Wang, and M. D. Plumbley, \"Audio Set classification with attention model: A probabilistic perspective,\" in IEEE International Conference on Acoustics, Speech and Signal Processing (ICASSP), 2018, pp. 316-320.\n\nMulti-level attention model for weakly supervised audio classification. C Yu, K S Barsim, Q Kong, B Yang, Detection and Classification of Acoustic Scenes and Events (DCASE). C. Yu, K. S. Barsim, Q. Kong, and B. Yang, \"Multi-level attention model for weakly supervised audio classification,\" in Detection and Classification of Acoustic Scenes and Events (DCASE), 2018, pp. 188- 192.\n\nLearning to recognize transient sound events using attentional supervision. S.-Y Chou, J.-S R Jang, Y.-H Yang, International Joint Conferences on Artificial Intelligence (IJCAI). S.-Y. Chou, J.-S. R. Jang, and Y.-H. Yang, \"Learning to recognize transient sound events using attentional supervision,\" in International Joint Conferences on Artificial Intelligence (IJCAI), 2018, pp. 3336- 3342.\n\nA comparison of five multiple instance learning pooling functions for sound event detection with weak labeling. Y Wang, J Li, F Metze, IEEE International Conference on Acoustics, Speech and Signal Processing. Y. Wang, J. Li, and F. Metze, \"A comparison of five multiple instance learning pooling functions for sound event detection with weak labeling,\" in IEEE International Conference on Acoustics, Speech and Signal Processing (ICASSP), 2019, pp. 31-35.\n\nWeakly labelled audioset tagging with attention neural networks. Q Kong, C Yu, Y Xu, T Iqbal, W Wang, M D Plumbley, Speech, and Language Processing. 27Q. Kong, C. Yu, Y. Xu, T. Iqbal, W. Wang, and M. D. Plumbley, \"Weakly labelled audioset tagging with attention neural networks,\" IEEE/ACM Transactions on Audio, Speech, and Language Processing, vol. 27, no. 11, pp. 1791-1802, 2019.\n\nTransfer learning for music classification and regression tasks. K Choi, G Fazekas, M Sandler, K Cho, International Society of Music Information Retrieval. K. Choi, G. Fazekas, M. Sandler, and K. Cho, \"Transfer learning for music classification and regression tasks,\" in International Society of Music Information Retrieval (ISMIR), 2017, pp. 141-149.\n\nEnd-to-end learning for music audio tagging at scale. J Pons, O Nieto, M Prockup, E Schmidt, A Ehmann, X Serra, International Society for Music Information Retrieval. J. Pons, O. Nieto, M. Prockup, E. Schmidt, A. Ehmann, and X. Serra, \"End-to-end learning for music audio tagging at scale,\" in International Society for Music Information Retrieval (ISMIR), 2017, pp. 637-644.\n\nTransfer learning by supervised pre-training for audio-based music classification. A Van Den, S Oord, B Dieleman, Schrauwen, Conference of the International Society for Music Information Retrieval. A. Van Den Oord, S. Dieleman, and B. Schrauwen, \"Transfer learning by supervised pre-training for audio-based music classification,\" in Conference of the International Society for Music Information Retrieval (ISMIR), 2014, pp. 29-34.\n\nPolyphonic sound event detection with weak labeling. Y Wang, Carnegie Mellon UniversityPhD thesisY. Wang, \"Polyphonic sound event detection with weak labeling,\" PhD thesis, Carnegie Mellon University, 2018.\n\nMUSICNN: Pre-trained convolutional neural networks for music audio tagging. J Pons, X Serra, arXiv:1909.06654arXiv preprintJ. Pons and X. Serra, \"MUSICNN: Pre-trained convolutional neural networks for music audio tagging,\" arXiv preprint arXiv:1909.06654, 2019.\n\nTransfer learning of weakly labelled audio. A Diment, T Virtanen, IEEE Workshop on Applications of Signal Processing to Audio and Acoustics (WASPAA. A. Diment and T. Virtanen, \"Transfer learning of weakly labelled audio,\" in IEEE Workshop on Applications of Signal Processing to Audio and Acoustics (WASPAA), 2017, pp. 6-10.\n\nInput-agreement: a new mechanism for collecting data using human computation games. E Law, L Von Ahn, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. the SIGCHI Conference on Human Factors in Computing SystemsE. Law and L. Von Ahn, \"Input-agreement: a new mechanism for collecting data using human computation games,\" in Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 2009, pp. 1197-1206.\n\nTUT database for acoustic scene classification and sound event detection. A Mesaros, T Heittola, T Virtanen ; European, H Hamme, IEEE Workshop on Applications of Signal Processing to Audio and Acoustics (WASPAA). An MFCC-GMM approach for event detection and classificationA. Mesaros, T. Heittola, and T. Virtanen, \"TUT database for acoustic scene classification and sound event detection,\" in 2016 24th European and H. Hamme, \"An MFCC-GMM approach for event detection and classification,\" in IEEE Workshop on Applications of Signal Processing to Audio and Acoustics (WASPAA), 2013, pp. 1-3.\n\nAcoustic event detection in real life recordings. A Mesaros, T Heittola, A Eronen, T Virtanen, European Signal Processing Conference (EUSIPCO). A. Mesaros, T. Heittola, A. Eronen, and T. Virtanen, \"Acoustic event detection in real life recordings,\" in European Signal Processing Con- ference (EUSIPCO), 2010, pp. 1267-1271.\n\nNon-speech environmental sound classification using SVMs with a new set of features. B Uzkent, B D Barkana, H Cevikalp, International Journal of Innovative Computing, Information and Control. 85B. Uzkent, B. D. Barkana, and H. Cevikalp, \"Non-speech environmental sound classification using SVMs with a new set of features,\" Interna- tional Journal of Innovative Computing, Information and Control, vol. 8, no. 5, pp. 3511-3524, 2012.\n\nAutomatic tagging using deep convolutional neural networks. K Choi, G Fazekas, M Sandler, International Society for Music Information Retrieval. K. Choi, G. Fazekas, and M. Sandler, \"Automatic tagging using deep convolutional neural networks,\" in International Society for Music Information Retrieval (ISMIR), 2016, pp. 805-811.\n\nVery deep convolutional neural networks for raw waveforms. W Dai, C Dai, S Qu, J Li, S Das, IEEE International Conference on Acoustics, Speech and Signal Processing. W. Dai, C. Dai, S. Qu, J. Li, and S. Das, \"Very deep convolutional neural networks for raw waveforms,\" in IEEE International Conference on Acoustics, Speech and Signal Processing (ICASSP), 2017, pp. 421- 425.\n\nDeep residual learning for image recognition. K He, X Zhang, S Ren, J Sun, IEEE Conference on Computer Vision and Pattern Recognition (CVPR). K. He, X. Zhang, S. Ren, and J. Sun, \"Deep residual learning for image recognition,\" in IEEE Conference on Computer Vision and Pattern Recognition (CVPR), 2016, pp. 770-778.\n\nCross-task learning for audio tagging, sound event detection and spatial localization: DCASE 2019 baseline systems. Q Kong, Y Cao, T Iqbal, Y Xu, W Wang, M D Plumbley, arXiv:1904.03476arXiv preprintQ. Kong, Y. Cao, T. Iqbal, Y. Xu, W. Wang, and M. D. Plumbley, \"Cross-task learning for audio tagging, sound event detection and spatial localization: DCASE 2019 baseline systems,\" arXiv preprint arXiv:1904.03476, 2019.\n\nImageNet classification with deep convolutional neural networks. A Krizhevsky, I Sutskever, G E Hinton, Advances in Neural Information Processing Systems (NeurIPS). A. Krizhevsky, I. Sutskever, and G. E. Hinton, \"ImageNet classifica- tion with deep convolutional neural networks,\" in Advances in Neural Information Processing Systems (NeurIPS), 2012, pp. 1097-1105.\n\nVery deep convolutional networks for large-scale image recognition. K Simonyan, A Zisserman, International Conference on Learning Representations (ICLR). K. Simonyan and A. Zisserman, \"Very deep convolutional networks for large-scale image recognition,\" International Conference on Learning Representations (ICLR), 2015.\n\nBatch normalization: Accelerating deep network training by reducing internal covariate shift. S Ioffe, C Szegedy, International Conference on Machine Learning (ICML). S. Ioffe and C. Szegedy, \"Batch normalization: Accelerating deep network training by reducing internal covariate shift,\" in International Conference on Machine Learning (ICML), 2015, pp. 448-456.\n\nRectified linear units improve restricted boltzmann machines. V Nair, G E Hinton, International Conference on Machine Learning (ICML). V. Nair and G. E. Hinton, \"Rectified linear units improve restricted boltzmann machines,\" in International Conference on Machine Learning (ICML), 2010, pp. 807-814.\n\nDropout: a simple way to prevent neural networks from overfitting. N Srivastava, G Hinton, A Krizhevsky, I Sutskever, R Salakhutdinov, The Journal of Machine Learning Research. 151N. Srivastava, G. Hinton, A. Krizhevsky, I. Sutskever, and R. Salakhut- dinov, \"Dropout: a simple way to prevent neural networks from over- fitting,\" The Journal of Machine Learning Research, vol. 15, no. 1, pp. 1929-1958, 2014.\n\nNetwork in network. M Lin, Q Chen, S Yan, arXiv:1312.4400arXiv preprintM. Lin, Q. Chen, and S. Yan, \"Network in network,\" arXiv preprint arXiv:1312.4400, 2013.\n\nMobilenets: Efficient convolutional neural networks for mobile vision applications. A G Howard, M Zhu, B Chen, D Kalenichenko, W Wang, T Weyand, M Andreetto, H Adam, arXiv:1704.04861arXiv preprintA. G. Howard, M. Zhu, B. Chen, D. Kalenichenko, W. Wang, T. Weyand, M. Andreetto, and H. Adam, \"Mobilenets: Efficient convo- lutional neural networks for mobile vision applications,\" arXiv preprint arXiv:1704.04861, 2017.\n\nM Sandler, A Howard, M Zhu, A Zhmoginov, L.-C Chen, IEEE Conference on Computer Vision and Pattern Recognition (CVPR). MobilenetV2: Inverted residuals and linear bottlenecksM. Sandler, A. Howard, M. Zhu, A. Zhmoginov, and L.-C. Chen, \"MobilenetV2: Inverted residuals and linear bottlenecks,\" in IEEE Conference on Computer Vision and Pattern Recognition (CVPR), 2018, pp. 4510-4520.\n\nSample-level deep convolutional neural networks for music auto-tagging using raw waveforms. J Lee, J Park, K L Kim, J Nam, Sound and Music Computing Conference. J. Lee, J. Park, K. L. Kim, and J. Nam, \"Sample-level deep convolutional neural networks for music auto-tagging using raw waveforms,\" in Sound and Music Computing Conference, 2017, pp. 220-226.\n\nmixup: Beyond empirical risk minimization. H Zhang, M Cisse, Y N Dauphin, D Lopez-Paz, International Conference on Learning Representations (ICLR). H. Zhang, M. Cisse, Y. N. Dauphin, and D. Lopez-Paz, \"mixup: Beyond empirical risk minimization,\" in International Conference on Learning Representations (ICLR), 2018.\n\nSpecAugment: A simple data augmentation method for automatic speech recognition. D S Park, W Chan, Y Zhang, C.-C Chiu, B Zoph, E D Cubuk, Q V Le, INTERSPEECH. D. S. Park, W. Chan, Y. Zhang, C.-C. Chiu, B. Zoph, E. D. Cubuk, and Q. V. Le, \"SpecAugment: A simple data augmentation method for automatic speech recognition,\" in INTERSPEECH, 2019.\n\nA deep residual network for large-scale acoustic scene analysis. L Ford, H Tang, F Grondin, J Glass, INTERSPEECH. L. Ford, H. Tang, F. Grondin, and J. Glass, \"A deep residual network for large-scale acoustic scene analysis,\" INTERSPEECH, pp. 2568-2572, 2019.\n\nUnsupervised filterbank learning using convolutional restricted Boltzmann machine for environmental sound classification. H B Sailor, D M Agrawal, H A Patil, H. B. Sailor, D. M. Agrawal, and H. A. Patil, \"Unsupervised filterbank learning using convolutional restricted Boltzmann machine for environ- mental sound classification,\" in INTERSPEECH, 2017, pp. 3107-3111.\n\nESC: Dataset for environmental sound classification. K J Piczak, ACM International Conference on Multimedia. ACMK. J. Piczak, \"ESC: Dataset for environmental sound classification,\" in ACM International Conference on Multimedia. ACM, 2015, pp. 1015- 1018.\n\nIntegrating the data augmentation scheme with various classifiers for acoustic scene modeling. H Chen, Z Liu, Z Liu, P Zhang, Y Yan, DCASE2019 Challenge, Tech. Rep. H. Chen, Z. Liu, Z. Liu, P. Zhang, and Y. Yan, \"Integrating the data augmentation scheme with various classifiers for acoustic scene modeling,\" DCASE2019 Challenge, Tech. Rep., 2019.\n\nAudio tagging system for DCASE 2018: focusing on label noise data augmentation and its efficient learning. I.-Y Jeong, H Lim, DCASE Challenge Tech. Rep. I.-Y. Jeong and H. Lim, \"Audio tagging system for DCASE 2018: focusing on label noise data augmentation and its efficient learning,\" DCASE Challenge Tech. Rep., 2018.\n\nAttention-based convolutional neural network for audio event classification with feature transfer learning. T Chen, U Gupta, T. Chen and U. Gupta, \"Attention-based convolutional neural network for audio event classification with feature transfer learning,\" https:// cvssp.org/ projects/ making_sense_of_sounds/ site/ assets/ challenge_abstracts_and_figures/ Tianxiang_Chen.pdf , 2018.\n\nGeneral-purpose tagging of freesound audio with audioset labels: Task description, dataset, and baseline. E Fonseca, M Plakal, F Font, D P W Ellis, X Favory, J Pons, X Serra, Workshop on Detection and Classification of Acoustic Scenes and Events (DCASE). E. Fonseca, M. Plakal, F. Font, D. P. W. Ellis, X. Favory, J. Pons, and X. Serra, \"General-purpose tagging of freesound audio with audioset la- bels: Task description, dataset, and baseline,\" in Workshop on Detection and Classification of Acoustic Scenes and Events (DCASE), November 2018, pp. 69-73.\n\nGeneralisation in environmental sound classification: the 'making sense of sounds' data set and challenge. C Kroos, O Bones, Y Cao, L Harris, P J Jackson, W J Davies, W Wang, T J Cox, M D Plumbley, IEEE International Conference on Acoustics, Speech and Signal Processing. C. Kroos, O. Bones, Y. Cao, L. Harris, P. J. Jackson, W. J. Davies, W. Wang, T. J. Cox, and M. D. Plumbley, \"Generalisation in environ- mental sound classification: the 'making sense of sounds' data set and challenge,\" in IEEE International Conference on Acoustics, Speech and Signal Processing (ICASSP), 2019, pp. 8082-8086.\n\nBottom-up broadcast neural network for music genre classification. C Liu, L Feng, G Liu, H Wang, S Liu, arXiv:1901.08928arXiv preprintC. Liu, L. Feng, G. Liu, H. Wang, and S. Liu, \"Bottom-up broad- cast neural network for music genre classification,\" arXiv preprint arXiv:1901.08928, 2019.\n\nMusical genre classification of audio signals. G Tzanetakis, P Cook, IEEE Transactions on Speech and Audio Processing. 105G. Tzanetakis and P. Cook, \"Musical genre classification of audio signals,\" IEEE Transactions on Speech and Audio Processing, vol. 10, no. 5, pp. 293-302, 2002.\n\nSpectrogram based multi-task audio classification. Y Zeng, H Mao, D Peng, Z Yi, Multimedia Tools and Applications. 783Y. Zeng, H. Mao, D. Peng, and Z. Yi, \"Spectrogram based multi-task audio classification,\" Multimedia Tools and Applications, vol. 78, no. 3, pp. 3705-3722, 2019.\n\nRavdess: The Ryerson audio-visual database of emotional speech and song. S R Livingstone, K Peck, F A Russo, Annual Meeting of the Canadian Society for Brain, Behaviour and Cognitive Science (CSBBCS). S. R. Livingstone, K. Peck, and F. A. Russo, \"Ravdess: The Ryerson audio-visual database of emotional speech and song,\" in Annual Meeting of the Canadian Society for Brain, Behaviour and Cognitive Science (CSBBCS), 2012, pp. 1459-1462.\n", "annotations": {"author": "[{\"end\":119,\"start\":85},{\"end\":153,\"start\":120},{\"end\":166,\"start\":154},{\"end\":197,\"start\":167},{\"end\":226,\"start\":198}]", "publisher": null, "author_last_name": "[{\"end\":118,\"start\":114},{\"end\":152,\"start\":149},{\"end\":165,\"start\":161},{\"end\":196,\"start\":192},{\"end\":225,\"start\":217}]", "author_first_name": "[{\"end\":113,\"start\":105},{\"end\":148,\"start\":145},{\"end\":160,\"start\":154},{\"end\":191,\"start\":186},{\"end\":214,\"start\":210},{\"end\":216,\"start\":215}]", "author_affiliation": null, "title": "[{\"end\":82,\"start\":1},{\"end\":308,\"start\":227}]", "venue": null, "abstract": "[{\"end\":1651,\"start\":387}]", "bib_ref": "[{\"attributes\":{\"ref_id\":\"b0\"},\"end\":1985,\"start\":1982},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":2020,\"start\":2017},{\"attributes\":{\"ref_id\":\"b2\"},\"end\":2047,\"start\":2044},{\"attributes\":{\"ref_id\":\"b3\"},\"end\":2106,\"start\":2103},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":2155,\"start\":2152},{\"attributes\":{\"ref_id\":\"b5\"},\"end\":2380,\"start\":2377},{\"attributes\":{\"ref_id\":\"b6\"},\"end\":2385,\"start\":2382},{\"attributes\":{\"ref_id\":\"b5\"},\"end\":2411,\"start\":2408},{\"attributes\":{\"ref_id\":\"b7\"},\"end\":2654,\"start\":2651},{\"attributes\":{\"ref_id\":\"b8\"},\"end\":2659,\"start\":2656},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":2665,\"start\":2661},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":2670,\"start\":2667},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":2962,\"start\":2958},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":3004,\"start\":3000},{\"attributes\":{\"ref_id\":\"b11\"},\"end\":3289,\"start\":3285},{\"attributes\":{\"ref_id\":\"b12\"},\"end\":3406,\"start\":3402},{\"attributes\":{\"ref_id\":\"b0\"},\"end\":3467,\"start\":3464},{\"attributes\":{\"ref_id\":\"b13\"},\"end\":3473,\"start\":3469},{\"attributes\":{\"ref_id\":\"b0\"},\"end\":3553,\"start\":3550},{\"attributes\":{\"ref_id\":\"b13\"},\"end\":3559,\"start\":3555},{\"attributes\":{\"ref_id\":\"b0\"},\"end\":3685,\"start\":3682},{\"attributes\":{\"ref_id\":\"b13\"},\"end\":3942,\"start\":3938},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":3962,\"start\":3958},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":3968,\"start\":3964},{\"attributes\":{\"ref_id\":\"b16\"},\"end\":3974,\"start\":3970},{\"attributes\":{\"ref_id\":\"b17\"},\"end\":3980,\"start\":3976},{\"attributes\":{\"ref_id\":\"b18\"},\"end\":3986,\"start\":3982},{\"attributes\":{\"ref_id\":\"b13\"},\"end\":4055,\"start\":4051},{\"attributes\":{\"ref_id\":\"b19\"},\"end\":4352,\"start\":4348},{\"attributes\":{\"ref_id\":\"b20\"},\"end\":4358,\"start\":4354},{\"attributes\":{\"ref_id\":\"b19\"},\"end\":4662,\"start\":4658},{\"attributes\":{\"ref_id\":\"b20\"},\"end\":4668,\"start\":4664},{\"attributes\":{\"ref_id\":\"b13\"},\"end\":4674,\"start\":4670},{\"attributes\":{\"ref_id\":\"b21\"},\"end\":4849,\"start\":4845},{\"attributes\":{\"ref_id\":\"b19\"},\"end\":4954,\"start\":4950},{\"attributes\":{\"ref_id\":\"b22\"},\"end\":4960,\"start\":4956},{\"attributes\":{\"ref_id\":\"b23\"},\"end\":5158,\"start\":5154},{\"attributes\":{\"ref_id\":\"b24\"},\"end\":5164,\"start\":5160},{\"attributes\":{\"ref_id\":\"b25\"},\"end\":5206,\"start\":5202},{\"attributes\":{\"ref_id\":\"b26\"},\"end\":5230,\"start\":5226},{\"end\":6602,\"start\":6598},{\"end\":6667,\"start\":6663},{\"attributes\":{\"ref_id\":\"b27\"},\"end\":6673,\"start\":6669},{\"attributes\":{\"ref_id\":\"b28\"},\"end\":6716,\"start\":6712},{\"attributes\":{\"ref_id\":\"b29\"},\"end\":6821,\"start\":6817},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":6996,\"start\":6993},{\"attributes\":{\"ref_id\":\"b2\"},\"end\":7026,\"start\":7023},{\"attributes\":{\"ref_id\":\"b0\"},\"end\":7258,\"start\":7255},{\"attributes\":{\"ref_id\":\"b30\"},\"end\":7464,\"start\":7460},{\"attributes\":{\"ref_id\":\"b31\"},\"end\":7470,\"start\":7466},{\"attributes\":{\"ref_id\":\"b29\"},\"end\":7516,\"start\":7512},{\"attributes\":{\"ref_id\":\"b18\"},\"end\":7522,\"start\":7518},{\"attributes\":{\"ref_id\":\"b29\"},\"end\":7583,\"start\":7579},{\"attributes\":{\"ref_id\":\"b18\"},\"end\":7589,\"start\":7585},{\"attributes\":{\"ref_id\":\"b29\"},\"end\":7835,\"start\":7831},{\"attributes\":{\"ref_id\":\"b18\"},\"end\":7841,\"start\":7837},{\"attributes\":{\"ref_id\":\"b32\"},\"end\":8165,\"start\":8161},{\"attributes\":{\"ref_id\":\"b32\"},\"end\":8186,\"start\":8182},{\"attributes\":{\"ref_id\":\"b33\"},\"end\":8472,\"start\":8468},{\"attributes\":{\"ref_id\":\"b34\"},\"end\":8515,\"start\":8511},{\"attributes\":{\"ref_id\":\"b35\"},\"end\":8684,\"start\":8680},{\"attributes\":{\"ref_id\":\"b36\"},\"end\":8755,\"start\":8751},{\"attributes\":{\"ref_id\":\"b32\"},\"end\":8938,\"start\":8934},{\"attributes\":{\"ref_id\":\"b20\"},\"end\":9201,\"start\":9197},{\"attributes\":{\"ref_id\":\"b32\"},\"end\":9347,\"start\":9343},{\"attributes\":{\"ref_id\":\"b32\"},\"end\":9444,\"start\":9440},{\"attributes\":{\"ref_id\":\"b37\"},\"end\":9780,\"start\":9776},{\"attributes\":{\"ref_id\":\"b13\"},\"end\":10046,\"start\":10042},{\"attributes\":{\"ref_id\":\"b13\"},\"end\":10094,\"start\":10090},{\"attributes\":{\"ref_id\":\"b30\"},\"end\":11805,\"start\":11801},{\"attributes\":{\"ref_id\":\"b31\"},\"end\":11913,\"start\":11909},{\"attributes\":{\"ref_id\":\"b31\"},\"end\":11950,\"start\":11946},{\"attributes\":{\"ref_id\":\"b38\"},\"end\":12564,\"start\":12560},{\"attributes\":{\"ref_id\":\"b31\"},\"end\":12629,\"start\":12625},{\"attributes\":{\"ref_id\":\"b39\"},\"end\":13281,\"start\":13277},{\"attributes\":{\"ref_id\":\"b39\"},\"end\":13541,\"start\":13537},{\"attributes\":{\"ref_id\":\"b40\"},\"end\":13593,\"start\":13589},{\"attributes\":{\"ref_id\":\"b39\"},\"end\":13771,\"start\":13767},{\"attributes\":{\"ref_id\":\"b40\"},\"end\":13792,\"start\":13788},{\"attributes\":{\"ref_id\":\"b39\"},\"end\":13973,\"start\":13969},{\"attributes\":{\"ref_id\":\"b40\"},\"end\":13979,\"start\":13975},{\"attributes\":{\"ref_id\":\"b30\"},\"end\":14383,\"start\":14379},{\"attributes\":{\"ref_id\":\"b41\"},\"end\":14482,\"start\":14478},{\"attributes\":{\"ref_id\":\"b20\"},\"end\":14515,\"start\":14511},{\"attributes\":{\"ref_id\":\"b30\"},\"end\":14558,\"start\":14554},{\"attributes\":{\"ref_id\":\"b30\"},\"end\":15034,\"start\":15030},{\"attributes\":{\"ref_id\":\"b41\"},\"end\":15287,\"start\":15283},{\"attributes\":{\"ref_id\":\"b30\"},\"end\":16580,\"start\":16576},{\"attributes\":{\"ref_id\":\"b41\"},\"end\":16586,\"start\":16582},{\"attributes\":{\"ref_id\":\"b20\"},\"end\":16592,\"start\":16588},{\"attributes\":{\"ref_id\":\"b30\"},\"end\":16732,\"start\":16728},{\"attributes\":{\"ref_id\":\"b41\"},\"end\":16738,\"start\":16734},{\"attributes\":{\"ref_id\":\"b42\"},\"end\":21733,\"start\":21729},{\"attributes\":{\"ref_id\":\"b43\"},\"end\":21754,\"start\":21750},{\"attributes\":{\"ref_id\":\"b42\"},\"end\":21803,\"start\":21799},{\"attributes\":{\"ref_id\":\"b42\"},\"end\":22270,\"start\":22266},{\"attributes\":{\"ref_id\":\"b43\"},\"end\":22484,\"start\":22480},{\"attributes\":{\"ref_id\":\"b43\"},\"end\":22805,\"start\":22801},{\"attributes\":{\"ref_id\":\"b21\"},\"end\":23338,\"start\":23334},{\"attributes\":{\"ref_id\":\"b19\"},\"end\":23344,\"start\":23340},{\"attributes\":{\"ref_id\":\"b22\"},\"end\":23350,\"start\":23346},{\"attributes\":{\"ref_id\":\"b23\"},\"end\":23356,\"start\":23352},{\"attributes\":{\"ref_id\":\"b25\"},\"end\":23362,\"start\":23358},{\"attributes\":{\"ref_id\":\"b0\"},\"end\":25835,\"start\":25832},{\"attributes\":{\"ref_id\":\"b0\"},\"end\":26110,\"start\":26107},{\"attributes\":{\"ref_id\":\"b0\"},\"end\":26189,\"start\":26186},{\"attributes\":{\"ref_id\":\"b32\"},\"end\":26849,\"start\":26845},{\"attributes\":{\"ref_id\":\"b32\"},\"end\":27099,\"start\":27095},{\"attributes\":{\"ref_id\":\"b0\"},\"end\":27455,\"start\":27452},{\"attributes\":{\"ref_id\":\"b0\"},\"end\":27850,\"start\":27847},{\"attributes\":{\"ref_id\":\"b0\"},\"end\":28257,\"start\":28254},{\"attributes\":{\"ref_id\":\"b13\"},\"end\":28299,\"start\":28295},{\"attributes\":{\"ref_id\":\"b17\"},\"end\":28564,\"start\":28560},{\"attributes\":{\"ref_id\":\"b0\"},\"end\":28726,\"start\":28723},{\"attributes\":{\"ref_id\":\"b44\"},\"end\":28758,\"start\":28754},{\"attributes\":{\"ref_id\":\"b18\"},\"end\":29951,\"start\":29947},{\"attributes\":{\"ref_id\":\"b0\"},\"end\":29998,\"start\":29995},{\"attributes\":{\"ref_id\":\"b18\"},\"end\":30271,\"start\":30267},{\"attributes\":{\"ref_id\":\"b32\"},\"end\":31641,\"start\":31637},{\"attributes\":{\"ref_id\":\"b30\"},\"end\":33422,\"start\":33418},{\"attributes\":{\"ref_id\":\"b41\"},\"end\":33481,\"start\":33477},{\"attributes\":{\"ref_id\":\"b46\"},\"end\":37417,\"start\":37413},{\"attributes\":{\"ref_id\":\"b46\"},\"end\":37534,\"start\":37530},{\"attributes\":{\"ref_id\":\"b45\"},\"end\":37597,\"start\":37593},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":38563,\"start\":38560},{\"attributes\":{\"ref_id\":\"b47\"},\"end\":39129,\"start\":39125},{\"attributes\":{\"ref_id\":\"b50\"},\"end\":39875,\"start\":39871},{\"attributes\":{\"ref_id\":\"b48\"},\"end\":40196,\"start\":40192},{\"attributes\":{\"ref_id\":\"b51\"},\"end\":40708,\"start\":40704},{\"attributes\":{\"ref_id\":\"b49\"},\"end\":41036,\"start\":41032},{\"attributes\":{\"ref_id\":\"b53\"},\"end\":41498,\"start\":41494},{\"attributes\":{\"ref_id\":\"b52\"},\"end\":41944,\"start\":41940},{\"attributes\":{\"ref_id\":\"b55\"},\"end\":42601,\"start\":42597},{\"attributes\":{\"ref_id\":\"b54\"},\"end\":42996,\"start\":42992},{\"attributes\":{\"ref_id\":\"b30\"},\"end\":43987,\"start\":43983},{\"attributes\":{\"ref_id\":\"b41\"},\"end\":44014,\"start\":44010},{\"attributes\":{\"ref_id\":\"b18\"},\"end\":46344,\"start\":46340},{\"attributes\":{\"ref_id\":\"b0\"},\"end\":46391,\"start\":46388}]", "figure": "[{\"attributes\":{\"id\":\"fig_0\"},\"end\":46776,\"start\":46730},{\"attributes\":{\"id\":\"fig_2\"},\"end\":47339,\"start\":46777},{\"attributes\":{\"id\":\"fig_4\"},\"end\":47731,\"start\":47340},{\"attributes\":{\"id\":\"fig_5\"},\"end\":47856,\"start\":47732},{\"attributes\":{\"id\":\"fig_7\"},\"end\":47937,\"start\":47857},{\"attributes\":{\"id\":\"fig_9\"},\"end\":48029,\"start\":47938},{\"attributes\":{\"id\":\"fig_10\"},\"end\":48121,\"start\":48030},{\"attributes\":{\"id\":\"fig_11\"},\"end\":48200,\"start\":48122},{\"attributes\":{\"id\":\"fig_12\"},\"end\":48280,\"start\":48201},{\"attributes\":{\"id\":\"fig_13\"},\"end\":48364,\"start\":48281},{\"attributes\":{\"id\":\"tab_0\",\"type\":\"table\"},\"end\":48693,\"start\":48365},{\"attributes\":{\"id\":\"tab_2\",\"type\":\"table\"},\"end\":48734,\"start\":48694},{\"attributes\":{\"id\":\"tab_3\",\"type\":\"table\"},\"end\":49022,\"start\":48735},{\"attributes\":{\"id\":\"tab_4\",\"type\":\"table\"},\"end\":49560,\"start\":49023},{\"attributes\":{\"id\":\"tab_7\",\"type\":\"table\"},\"end\":49960,\"start\":49561},{\"attributes\":{\"id\":\"tab_8\",\"type\":\"table\"},\"end\":50385,\"start\":49961},{\"attributes\":{\"id\":\"tab_9\",\"type\":\"table\"},\"end\":51266,\"start\":50386},{\"attributes\":{\"id\":\"tab_10\",\"type\":\"table\"},\"end\":52128,\"start\":51267},{\"attributes\":{\"id\":\"tab_11\",\"type\":\"table\"},\"end\":52333,\"start\":52129},{\"attributes\":{\"id\":\"tab_12\",\"type\":\"table\"},\"end\":52618,\"start\":52334},{\"attributes\":{\"id\":\"tab_13\",\"type\":\"table\"},\"end\":52755,\"start\":52619},{\"attributes\":{\"id\":\"tab_14\",\"type\":\"table\"},\"end\":52881,\"start\":52756},{\"attributes\":{\"id\":\"tab_15\",\"type\":\"table\"},\"end\":53172,\"start\":52882},{\"attributes\":{\"id\":\"tab_16\",\"type\":\"table\"},\"end\":53466,\"start\":53173}]", "paragraph": "[{\"end\":2185,\"start\":1670},{\"end\":2963,\"start\":2187},{\"end\":3611,\"start\":2965},{\"end\":4675,\"start\":3613},{\"end\":5949,\"start\":4677},{\"end\":6250,\"start\":5951},{\"end\":7302,\"start\":6280},{\"end\":8010,\"start\":7304},{\"end\":10551,\"start\":8012},{\"end\":10940,\"start\":10852},{\"end\":11476,\"start\":11259},{\"end\":11685,\"start\":11538},{\"end\":12565,\"start\":11687},{\"end\":13699,\"start\":12567},{\"end\":14045,\"start\":13701},{\"end\":14534,\"start\":14073},{\"end\":15190,\"start\":14536},{\"end\":15635,\"start\":15192},{\"end\":16485,\"start\":15637},{\"end\":17985,\"start\":16524},{\"end\":19269,\"start\":18013},{\"end\":19779,\"start\":19296},{\"end\":20125,\"start\":19803},{\"end\":21511,\"start\":20147},{\"end\":21781,\"start\":21536},{\"end\":22450,\"start\":21783},{\"end\":22739,\"start\":22452},{\"end\":23090,\"start\":22753},{\"end\":23755,\"start\":23092},{\"end\":24117,\"start\":23757},{\"end\":25448,\"start\":24119},{\"end\":25738,\"start\":25450},{\"end\":26723,\"start\":25754},{\"end\":27290,\"start\":26725},{\"end\":27983,\"start\":27316},{\"end\":29003,\"start\":27985},{\"end\":30305,\"start\":29005},{\"end\":31284,\"start\":30307},{\"end\":36269,\"start\":31313},{\"end\":37358,\"start\":36365},{\"end\":38473,\"start\":37360},{\"end\":39773,\"start\":38475},{\"end\":41462,\"start\":39799},{\"end\":43399,\"start\":41476},{\"end\":44219,\"start\":43417},{\"end\":45137,\"start\":44221},{\"end\":45289,\"start\":45139},{\"end\":46392,\"start\":45291},{\"end\":46471,\"start\":46405},{\"end\":46657,\"start\":46473},{\"end\":46729,\"start\":46659}]", "formula": "[{\"attributes\":{\"id\":\"formula_0\"},\"end\":10840,\"start\":10552},{\"attributes\":{\"id\":\"formula_1\"},\"end\":11258,\"start\":10941},{\"attributes\":{\"id\":\"formula_2\"},\"end\":11537,\"start\":11477},{\"attributes\":{\"id\":\"formula_3\"},\"end\":22752,\"start\":22740}]", "table_ref": "[{\"attributes\":{\"ref_id\":\"tab_0\"},\"end\":9901,\"start\":9879},{\"attributes\":{\"ref_id\":\"tab_0\"},\"end\":10364,\"start\":10277},{\"attributes\":{\"ref_id\":\"tab_0\"},\"end\":12965,\"start\":12957},{\"attributes\":{\"ref_id\":\"tab_0\"},\"end\":13833,\"start\":13824},{\"attributes\":{\"ref_id\":\"tab_0\"},\"end\":28058,\"start\":28050},{\"attributes\":{\"ref_id\":\"tab_8\"},\"end\":30825,\"start\":30818},{\"attributes\":{\"ref_id\":\"tab_0\"},\"end\":31413,\"start\":31404},{\"attributes\":{\"ref_id\":\"tab_0\"},\"end\":32282,\"start\":32273},{\"attributes\":{\"ref_id\":\"tab_0\"},\"end\":32875,\"start\":32866},{\"attributes\":{\"ref_id\":\"tab_0\"},\"end\":33344,\"start\":33335},{\"attributes\":{\"ref_id\":\"tab_0\"},\"end\":33785,\"start\":33776},{\"attributes\":{\"ref_id\":\"tab_0\"},\"end\":34568,\"start\":34558},{\"attributes\":{\"ref_id\":\"tab_0\"},\"end\":34700,\"start\":34690},{\"attributes\":{\"ref_id\":\"tab_0\"},\"end\":40091,\"start\":40083},{\"attributes\":{\"ref_id\":\"tab_0\"},\"end\":41818,\"start\":41808},{\"attributes\":{\"ref_id\":\"tab_0\"},\"end\":42902,\"start\":42893}]", "section_header": "[{\"end\":1668,\"start\":1653},{\"end\":6278,\"start\":6253},{\"end\":10850,\"start\":10842},{\"end\":14071,\"start\":14048},{\"end\":16522,\"start\":16488},{\"end\":18011,\"start\":17988},{\"end\":19294,\"start\":19272},{\"end\":19801,\"start\":19782},{\"end\":20145,\"start\":20128},{\"end\":21534,\"start\":21514},{\"end\":25752,\"start\":25741},{\"end\":27314,\"start\":27293},{\"end\":31311,\"start\":31287},{\"end\":36296,\"start\":36272},{\"end\":36334,\"start\":36299},{\"end\":36363,\"start\":36337},{\"end\":39797,\"start\":39776},{\"end\":41474,\"start\":41465},{\"end\":43415,\"start\":43402},{\"end\":46403,\"start\":46395},{\"end\":46739,\"start\":46731},{\"end\":46786,\"start\":46778},{\"end\":47349,\"start\":47341},{\"end\":47741,\"start\":47733},{\"end\":47866,\"start\":47858},{\"end\":47947,\"start\":47939},{\"end\":48039,\"start\":48031},{\"end\":48131,\"start\":48123},{\"end\":48210,\"start\":48202},{\"end\":48291,\"start\":48282},{\"end\":48378,\"start\":48366},{\"end\":48711,\"start\":48695},{\"end\":49044,\"start\":49024},{\"end\":49581,\"start\":49562},{\"end\":49977,\"start\":49962},{\"end\":50404,\"start\":50387},{\"end\":51285,\"start\":51268},{\"end\":52138,\"start\":52130},{\"end\":52342,\"start\":52335},{\"end\":52628,\"start\":52620},{\"end\":52766,\"start\":52757},{\"end\":52893,\"start\":52883},{\"end\":53183,\"start\":53174}]", "table": "[{\"end\":48693,\"start\":48400},{\"end\":49022,\"start\":48895},{\"end\":49560,\"start\":49068},{\"end\":49960,\"start\":49584},{\"end\":50385,\"start\":50001},{\"end\":51266,\"start\":50435},{\"end\":52128,\"start\":51339},{\"end\":52333,\"start\":52141},{\"end\":52618,\"start\":52344},{\"end\":52755,\"start\":52631},{\"end\":52881,\"start\":52770},{\"end\":53172,\"start\":52898},{\"end\":53466,\"start\":53187}]", "figure_caption": "[{\"end\":46776,\"start\":46741},{\"end\":47339,\"start\":46788},{\"end\":47731,\"start\":47351},{\"end\":47856,\"start\":47743},{\"end\":47937,\"start\":47868},{\"end\":48029,\"start\":47949},{\"end\":48121,\"start\":48041},{\"end\":48200,\"start\":48133},{\"end\":48280,\"start\":48212},{\"end\":48364,\"start\":48294},{\"end\":48400,\"start\":48380},{\"end\":48734,\"start\":48714},{\"end\":48895,\"start\":48737},{\"end\":49068,\"start\":49048},{\"end\":50001,\"start\":49979},{\"end\":50435,\"start\":50408},{\"end\":51339,\"start\":51290}]", "figure_ref": "[{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":19728,\"start\":19720},{\"attributes\":{\"ref_id\":\"fig_2\"},\"end\":24573,\"start\":24564},{\"attributes\":{\"ref_id\":\"fig_2\"},\"end\":24632,\"start\":24623},{\"attributes\":{\"ref_id\":\"fig_2\"},\"end\":25408,\"start\":25399},{\"attributes\":{\"ref_id\":\"fig_4\"},\"end\":29038,\"start\":29032},{\"attributes\":{\"ref_id\":\"fig_4\"},\"end\":29461,\"start\":29455},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":29846,\"start\":29839},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":30211,\"start\":30204},{\"attributes\":{\"ref_id\":\"fig_5\"},\"end\":35840,\"start\":35832},{\"attributes\":{\"ref_id\":\"fig_7\"},\"end\":38018,\"start\":38012},{\"attributes\":{\"ref_id\":\"fig_9\"},\"end\":39672,\"start\":39666},{\"attributes\":{\"ref_id\":\"fig_10\"},\"end\":40391,\"start\":40385},{\"attributes\":{\"ref_id\":\"fig_11\"},\"end\":41248,\"start\":41242},{\"attributes\":{\"ref_id\":\"fig_12\"},\"end\":42176,\"start\":42170},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":43062,\"start\":43055},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":46200,\"start\":46193}]", "bib_author_first_name": "[{\"end\":53535,\"start\":53534},{\"end\":53537,\"start\":53536},{\"end\":53548,\"start\":53547},{\"end\":53550,\"start\":53549},{\"end\":53559,\"start\":53558},{\"end\":53571,\"start\":53570},{\"end\":53581,\"start\":53580},{\"end\":53593,\"start\":53592},{\"end\":53595,\"start\":53594},{\"end\":53604,\"start\":53603},{\"end\":53614,\"start\":53613},{\"end\":54042,\"start\":54041},{\"end\":54053,\"start\":54052},{\"end\":54065,\"start\":54064},{\"end\":54439,\"start\":54438},{\"end\":54448,\"start\":54447},{\"end\":54460,\"start\":54459},{\"end\":54472,\"start\":54471},{\"end\":54863,\"start\":54862},{\"end\":54873,\"start\":54872},{\"end\":54875,\"start\":54874},{\"end\":55202,\"start\":55201},{\"end\":55204,\"start\":55203},{\"end\":55211,\"start\":55210},{\"end\":55213,\"start\":55212},{\"end\":55221,\"start\":55220},{\"end\":55223,\"start\":55222},{\"end\":55230,\"start\":55229},{\"end\":55232,\"start\":55231},{\"end\":55542,\"start\":55541},{\"end\":55544,\"start\":55543},{\"end\":55801,\"start\":55800},{\"end\":55805,\"start\":55802},{\"end\":56065,\"start\":56064},{\"end\":56076,\"start\":56075},{\"end\":56090,\"start\":56089},{\"end\":56101,\"start\":56100},{\"end\":56113,\"start\":56112},{\"end\":56115,\"start\":56114},{\"end\":56467,\"start\":56466},{\"end\":56478,\"start\":56477},{\"end\":56490,\"start\":56489},{\"end\":56501,\"start\":56500},{\"end\":56511,\"start\":56510},{\"end\":56523,\"start\":56522},{\"end\":56535,\"start\":56534},{\"end\":56537,\"start\":56536},{\"end\":56988,\"start\":56987},{\"end\":56999,\"start\":56998},{\"end\":57011,\"start\":57010},{\"end\":57021,\"start\":57020},{\"end\":57033,\"start\":57032},{\"end\":57041,\"start\":57040},{\"end\":57052,\"start\":57051},{\"end\":57059,\"start\":57058},{\"end\":57541,\"start\":57540},{\"end\":57549,\"start\":57548},{\"end\":57557,\"start\":57556},{\"end\":57570,\"start\":57566},{\"end\":57576,\"start\":57575},{\"end\":57582,\"start\":57581},{\"end\":57941,\"start\":57940},{\"end\":57954,\"start\":57950},{\"end\":57963,\"start\":57962},{\"end\":57970,\"start\":57969},{\"end\":58411,\"start\":58410},{\"end\":58422,\"start\":58421},{\"end\":58435,\"start\":58434},{\"end\":58437,\"start\":58436},{\"end\":58446,\"start\":58445},{\"end\":58448,\"start\":58447},{\"end\":58459,\"start\":58458},{\"end\":58469,\"start\":58468},{\"end\":58471,\"start\":58470},{\"end\":58480,\"start\":58479},{\"end\":58490,\"start\":58489},{\"end\":58499,\"start\":58498},{\"end\":58501,\"start\":58500},{\"end\":58512,\"start\":58511},{\"end\":58970,\"start\":58969},{\"end\":58978,\"start\":58977},{\"end\":58984,\"start\":58983},{\"end\":58992,\"start\":58991},{\"end\":58994,\"start\":58993},{\"end\":59381,\"start\":59380},{\"end\":59387,\"start\":59386},{\"end\":59389,\"start\":59388},{\"end\":59399,\"start\":59398},{\"end\":59407,\"start\":59406},{\"end\":59771,\"start\":59767},{\"end\":59782,\"start\":59778},{\"end\":59784,\"start\":59783},{\"end\":59795,\"start\":59791},{\"end\":60198,\"start\":60197},{\"end\":60206,\"start\":60205},{\"end\":60212,\"start\":60211},{\"end\":60608,\"start\":60607},{\"end\":60616,\"start\":60615},{\"end\":60622,\"start\":60621},{\"end\":60628,\"start\":60627},{\"end\":60637,\"start\":60636},{\"end\":60645,\"start\":60644},{\"end\":60647,\"start\":60646},{\"end\":60992,\"start\":60991},{\"end\":61000,\"start\":60999},{\"end\":61011,\"start\":61010},{\"end\":61022,\"start\":61021},{\"end\":61334,\"start\":61333},{\"end\":61342,\"start\":61341},{\"end\":61351,\"start\":61350},{\"end\":61362,\"start\":61361},{\"end\":61373,\"start\":61372},{\"end\":61383,\"start\":61382},{\"end\":61740,\"start\":61739},{\"end\":61751,\"start\":61750},{\"end\":61759,\"start\":61758},{\"end\":62143,\"start\":62142},{\"end\":62374,\"start\":62373},{\"end\":62382,\"start\":62381},{\"end\":62605,\"start\":62604},{\"end\":62615,\"start\":62614},{\"end\":62971,\"start\":62970},{\"end\":62978,\"start\":62977},{\"end\":63408,\"start\":63407},{\"end\":63419,\"start\":63418},{\"end\":63431,\"start\":63430},{\"end\":63454,\"start\":63453},{\"end\":63976,\"start\":63975},{\"end\":63987,\"start\":63986},{\"end\":63999,\"start\":63998},{\"end\":64009,\"start\":64008},{\"end\":64336,\"start\":64335},{\"end\":64346,\"start\":64345},{\"end\":64348,\"start\":64347},{\"end\":64359,\"start\":64358},{\"end\":64746,\"start\":64745},{\"end\":64754,\"start\":64753},{\"end\":64765,\"start\":64764},{\"end\":65075,\"start\":65074},{\"end\":65082,\"start\":65081},{\"end\":65089,\"start\":65088},{\"end\":65095,\"start\":65094},{\"end\":65101,\"start\":65100},{\"end\":65438,\"start\":65437},{\"end\":65444,\"start\":65443},{\"end\":65453,\"start\":65452},{\"end\":65460,\"start\":65459},{\"end\":65825,\"start\":65824},{\"end\":65833,\"start\":65832},{\"end\":65840,\"start\":65839},{\"end\":65849,\"start\":65848},{\"end\":65855,\"start\":65854},{\"end\":65863,\"start\":65862},{\"end\":65865,\"start\":65864},{\"end\":66193,\"start\":66192},{\"end\":66207,\"start\":66206},{\"end\":66220,\"start\":66219},{\"end\":66222,\"start\":66221},{\"end\":66563,\"start\":66562},{\"end\":66575,\"start\":66574},{\"end\":66911,\"start\":66910},{\"end\":66920,\"start\":66919},{\"end\":67243,\"start\":67242},{\"end\":67251,\"start\":67250},{\"end\":67253,\"start\":67252},{\"end\":67549,\"start\":67548},{\"end\":67563,\"start\":67562},{\"end\":67573,\"start\":67572},{\"end\":67587,\"start\":67586},{\"end\":67600,\"start\":67599},{\"end\":67912,\"start\":67911},{\"end\":67919,\"start\":67918},{\"end\":67927,\"start\":67926},{\"end\":68137,\"start\":68136},{\"end\":68139,\"start\":68138},{\"end\":68149,\"start\":68148},{\"end\":68156,\"start\":68155},{\"end\":68164,\"start\":68163},{\"end\":68180,\"start\":68179},{\"end\":68188,\"start\":68187},{\"end\":68198,\"start\":68197},{\"end\":68211,\"start\":68210},{\"end\":68472,\"start\":68471},{\"end\":68483,\"start\":68482},{\"end\":68493,\"start\":68492},{\"end\":68500,\"start\":68499},{\"end\":68516,\"start\":68512},{\"end\":68948,\"start\":68947},{\"end\":68955,\"start\":68954},{\"end\":68963,\"start\":68962},{\"end\":68965,\"start\":68964},{\"end\":68972,\"start\":68971},{\"end\":69255,\"start\":69254},{\"end\":69264,\"start\":69263},{\"end\":69273,\"start\":69272},{\"end\":69275,\"start\":69274},{\"end\":69286,\"start\":69285},{\"end\":69610,\"start\":69609},{\"end\":69612,\"start\":69611},{\"end\":69620,\"start\":69619},{\"end\":69628,\"start\":69627},{\"end\":69640,\"start\":69636},{\"end\":69648,\"start\":69647},{\"end\":69656,\"start\":69655},{\"end\":69658,\"start\":69657},{\"end\":69667,\"start\":69666},{\"end\":69669,\"start\":69668},{\"end\":69938,\"start\":69937},{\"end\":69946,\"start\":69945},{\"end\":69954,\"start\":69953},{\"end\":69965,\"start\":69964},{\"end\":70255,\"start\":70254},{\"end\":70257,\"start\":70256},{\"end\":70267,\"start\":70266},{\"end\":70269,\"start\":70268},{\"end\":70280,\"start\":70279},{\"end\":70282,\"start\":70281},{\"end\":70554,\"start\":70553},{\"end\":70556,\"start\":70555},{\"end\":70852,\"start\":70851},{\"end\":70860,\"start\":70859},{\"end\":70867,\"start\":70866},{\"end\":70874,\"start\":70873},{\"end\":70883,\"start\":70882},{\"end\":71216,\"start\":71212},{\"end\":71225,\"start\":71224},{\"end\":71535,\"start\":71534},{\"end\":71543,\"start\":71542},{\"end\":71919,\"start\":71918},{\"end\":71930,\"start\":71929},{\"end\":71940,\"start\":71939},{\"end\":71948,\"start\":71947},{\"end\":71952,\"start\":71949},{\"end\":71961,\"start\":71960},{\"end\":71971,\"start\":71970},{\"end\":71979,\"start\":71978},{\"end\":72477,\"start\":72476},{\"end\":72486,\"start\":72485},{\"end\":72495,\"start\":72494},{\"end\":72502,\"start\":72501},{\"end\":72512,\"start\":72511},{\"end\":72514,\"start\":72513},{\"end\":72525,\"start\":72524},{\"end\":72527,\"start\":72526},{\"end\":72537,\"start\":72536},{\"end\":72545,\"start\":72544},{\"end\":72547,\"start\":72546},{\"end\":72554,\"start\":72553},{\"end\":72556,\"start\":72555},{\"end\":73036,\"start\":73035},{\"end\":73043,\"start\":73042},{\"end\":73051,\"start\":73050},{\"end\":73058,\"start\":73057},{\"end\":73066,\"start\":73065},{\"end\":73307,\"start\":73306},{\"end\":73321,\"start\":73320},{\"end\":73595,\"start\":73594},{\"end\":73603,\"start\":73602},{\"end\":73610,\"start\":73609},{\"end\":73618,\"start\":73617},{\"end\":73898,\"start\":73897},{\"end\":73900,\"start\":73899},{\"end\":73915,\"start\":73914},{\"end\":73923,\"start\":73922},{\"end\":73925,\"start\":73924}]", "bib_author_last_name": "[{\"end\":53545,\"start\":53538},{\"end\":53556,\"start\":53551},{\"end\":53568,\"start\":53560},{\"end\":53578,\"start\":53572},{\"end\":53590,\"start\":53582},{\"end\":53601,\"start\":53596},{\"end\":53611,\"start\":53605},{\"end\":53621,\"start\":53615},{\"end\":54050,\"start\":54043},{\"end\":54062,\"start\":54054},{\"end\":54074,\"start\":54066},{\"end\":54445,\"start\":54440},{\"end\":54457,\"start\":54449},{\"end\":54469,\"start\":54461},{\"end\":54481,\"start\":54473},{\"end\":54870,\"start\":54864},{\"end\":54890,\"start\":54876},{\"end\":55208,\"start\":55205},{\"end\":55218,\"start\":55214},{\"end\":55227,\"start\":55224},{\"end\":55235,\"start\":55233},{\"end\":55552,\"start\":55545},{\"end\":55811,\"start\":55806},{\"end\":56073,\"start\":56066},{\"end\":56087,\"start\":56077},{\"end\":56098,\"start\":56091},{\"end\":56110,\"start\":56102},{\"end\":56124,\"start\":56116},{\"end\":56475,\"start\":56468},{\"end\":56487,\"start\":56479},{\"end\":56498,\"start\":56491},{\"end\":56508,\"start\":56502},{\"end\":56520,\"start\":56512},{\"end\":56532,\"start\":56524},{\"end\":56546,\"start\":56538},{\"end\":56996,\"start\":56989},{\"end\":57008,\"start\":57000},{\"end\":57018,\"start\":57012},{\"end\":57030,\"start\":57022},{\"end\":57038,\"start\":57034},{\"end\":57049,\"start\":57042},{\"end\":57056,\"start\":57053},{\"end\":57068,\"start\":57060},{\"end\":57546,\"start\":57542},{\"end\":57554,\"start\":57550},{\"end\":57564,\"start\":57558},{\"end\":57573,\"start\":57571},{\"end\":57579,\"start\":57577},{\"end\":57590,\"start\":57583},{\"end\":57948,\"start\":57942},{\"end\":57960,\"start\":57955},{\"end\":57967,\"start\":57964},{\"end\":57980,\"start\":57971},{\"end\":58419,\"start\":58412},{\"end\":58432,\"start\":58423},{\"end\":58443,\"start\":58438},{\"end\":58456,\"start\":58449},{\"end\":58466,\"start\":58460},{\"end\":58477,\"start\":58472},{\"end\":58487,\"start\":58481},{\"end\":58496,\"start\":58491},{\"end\":58509,\"start\":58502},{\"end\":58520,\"start\":58513},{\"end\":58975,\"start\":58971},{\"end\":58981,\"start\":58979},{\"end\":58989,\"start\":58985},{\"end\":59003,\"start\":58995},{\"end\":59384,\"start\":59382},{\"end\":59396,\"start\":59390},{\"end\":59404,\"start\":59400},{\"end\":59412,\"start\":59408},{\"end\":59776,\"start\":59772},{\"end\":59789,\"start\":59785},{\"end\":59800,\"start\":59796},{\"end\":60203,\"start\":60199},{\"end\":60209,\"start\":60207},{\"end\":60218,\"start\":60213},{\"end\":60613,\"start\":60609},{\"end\":60619,\"start\":60617},{\"end\":60625,\"start\":60623},{\"end\":60634,\"start\":60629},{\"end\":60642,\"start\":60638},{\"end\":60656,\"start\":60648},{\"end\":60997,\"start\":60993},{\"end\":61008,\"start\":61001},{\"end\":61019,\"start\":61012},{\"end\":61026,\"start\":61023},{\"end\":61339,\"start\":61335},{\"end\":61348,\"start\":61343},{\"end\":61359,\"start\":61352},{\"end\":61370,\"start\":61363},{\"end\":61380,\"start\":61374},{\"end\":61389,\"start\":61384},{\"end\":61748,\"start\":61741},{\"end\":61756,\"start\":61752},{\"end\":61768,\"start\":61760},{\"end\":61779,\"start\":61770},{\"end\":62148,\"start\":62144},{\"end\":62379,\"start\":62375},{\"end\":62388,\"start\":62383},{\"end\":62612,\"start\":62606},{\"end\":62624,\"start\":62616},{\"end\":62975,\"start\":62972},{\"end\":62986,\"start\":62979},{\"end\":63416,\"start\":63409},{\"end\":63428,\"start\":63420},{\"end\":63451,\"start\":63432},{\"end\":63460,\"start\":63455},{\"end\":63984,\"start\":63977},{\"end\":63996,\"start\":63988},{\"end\":64006,\"start\":64000},{\"end\":64018,\"start\":64010},{\"end\":64343,\"start\":64337},{\"end\":64356,\"start\":64349},{\"end\":64368,\"start\":64360},{\"end\":64751,\"start\":64747},{\"end\":64762,\"start\":64755},{\"end\":64773,\"start\":64766},{\"end\":65079,\"start\":65076},{\"end\":65086,\"start\":65083},{\"end\":65092,\"start\":65090},{\"end\":65098,\"start\":65096},{\"end\":65105,\"start\":65102},{\"end\":65441,\"start\":65439},{\"end\":65450,\"start\":65445},{\"end\":65457,\"start\":65454},{\"end\":65464,\"start\":65461},{\"end\":65830,\"start\":65826},{\"end\":65837,\"start\":65834},{\"end\":65846,\"start\":65841},{\"end\":65852,\"start\":65850},{\"end\":65860,\"start\":65856},{\"end\":65874,\"start\":65866},{\"end\":66204,\"start\":66194},{\"end\":66217,\"start\":66208},{\"end\":66229,\"start\":66223},{\"end\":66572,\"start\":66564},{\"end\":66585,\"start\":66576},{\"end\":66917,\"start\":66912},{\"end\":66928,\"start\":66921},{\"end\":67248,\"start\":67244},{\"end\":67260,\"start\":67254},{\"end\":67560,\"start\":67550},{\"end\":67570,\"start\":67564},{\"end\":67584,\"start\":67574},{\"end\":67597,\"start\":67588},{\"end\":67614,\"start\":67601},{\"end\":67916,\"start\":67913},{\"end\":67924,\"start\":67920},{\"end\":67931,\"start\":67928},{\"end\":68146,\"start\":68140},{\"end\":68153,\"start\":68150},{\"end\":68161,\"start\":68157},{\"end\":68177,\"start\":68165},{\"end\":68185,\"start\":68181},{\"end\":68195,\"start\":68189},{\"end\":68208,\"start\":68199},{\"end\":68216,\"start\":68212},{\"end\":68480,\"start\":68473},{\"end\":68490,\"start\":68484},{\"end\":68497,\"start\":68494},{\"end\":68510,\"start\":68501},{\"end\":68521,\"start\":68517},{\"end\":68952,\"start\":68949},{\"end\":68960,\"start\":68956},{\"end\":68969,\"start\":68966},{\"end\":68976,\"start\":68973},{\"end\":69261,\"start\":69256},{\"end\":69270,\"start\":69265},{\"end\":69283,\"start\":69276},{\"end\":69296,\"start\":69287},{\"end\":69617,\"start\":69613},{\"end\":69625,\"start\":69621},{\"end\":69634,\"start\":69629},{\"end\":69645,\"start\":69641},{\"end\":69653,\"start\":69649},{\"end\":69664,\"start\":69659},{\"end\":69672,\"start\":69670},{\"end\":69943,\"start\":69939},{\"end\":69951,\"start\":69947},{\"end\":69962,\"start\":69955},{\"end\":69971,\"start\":69966},{\"end\":70264,\"start\":70258},{\"end\":70277,\"start\":70270},{\"end\":70288,\"start\":70283},{\"end\":70563,\"start\":70557},{\"end\":70857,\"start\":70853},{\"end\":70864,\"start\":70861},{\"end\":70871,\"start\":70868},{\"end\":70880,\"start\":70875},{\"end\":70887,\"start\":70884},{\"end\":71222,\"start\":71217},{\"end\":71229,\"start\":71226},{\"end\":71540,\"start\":71536},{\"end\":71549,\"start\":71544},{\"end\":71927,\"start\":71920},{\"end\":71937,\"start\":71931},{\"end\":71945,\"start\":71941},{\"end\":71958,\"start\":71953},{\"end\":71968,\"start\":71962},{\"end\":71976,\"start\":71972},{\"end\":71985,\"start\":71980},{\"end\":72483,\"start\":72478},{\"end\":72492,\"start\":72487},{\"end\":72499,\"start\":72496},{\"end\":72509,\"start\":72503},{\"end\":72522,\"start\":72515},{\"end\":72534,\"start\":72528},{\"end\":72542,\"start\":72538},{\"end\":72551,\"start\":72548},{\"end\":72565,\"start\":72557},{\"end\":73040,\"start\":73037},{\"end\":73048,\"start\":73044},{\"end\":73055,\"start\":73052},{\"end\":73063,\"start\":73059},{\"end\":73070,\"start\":73067},{\"end\":73318,\"start\":73308},{\"end\":73326,\"start\":73322},{\"end\":73600,\"start\":73596},{\"end\":73607,\"start\":73604},{\"end\":73615,\"start\":73611},{\"end\":73621,\"start\":73619},{\"end\":73912,\"start\":73901},{\"end\":73920,\"start\":73916},{\"end\":73931,\"start\":73926}]", "bib_entry": "[{\"attributes\":{\"id\":\"b0\",\"matched_paper_id\":21519176},\"end\":53975,\"start\":53468},{\"attributes\":{\"id\":\"b1\",\"matched_paper_id\":50785886},\"end\":54363,\"start\":53977},{\"attributes\":{\"id\":\"b2\",\"matched_paper_id\":15840755},\"end\":54737,\"start\":54365},{\"attributes\":{\"id\":\"b3\",\"matched_paper_id\":59506838},\"end\":55130,\"start\":54739},{\"attributes\":{\"id\":\"b4\",\"matched_paper_id\":68216946},\"end\":55455,\"start\":55132},{\"attributes\":{\"id\":\"b5\",\"matched_paper_id\":9820707},\"end\":55774,\"start\":55457},{\"attributes\":{\"doi\":\"https:/academiccommons.columbia.edu/doi/10.7916/D8F19821/download\",\"id\":\"b6\"},\"end\":56002,\"start\":55776},{\"attributes\":{\"id\":\"b7\",\"matched_paper_id\":215854279},\"end\":56367,\"start\":56004},{\"attributes\":{\"id\":\"b8\",\"matched_paper_id\":215768579},\"end\":56920,\"start\":56369},{\"attributes\":{\"id\":\"b9\",\"matched_paper_id\":53007193},\"end\":57403,\"start\":56922},{\"attributes\":{\"id\":\"b10\"},\"end\":57485,\"start\":57405},{\"attributes\":{\"id\":\"b11\",\"matched_paper_id\":57246310},\"end\":57857,\"start\":57487},{\"attributes\":{\"id\":\"b12\",\"matched_paper_id\":52967399},\"end\":58352,\"start\":57859},{\"attributes\":{\"id\":\"b13\",\"matched_paper_id\":8810481},\"end\":58891,\"start\":58354},{\"attributes\":{\"id\":\"b14\",\"matched_paper_id\":44006469},\"end\":59306,\"start\":58893},{\"attributes\":{\"id\":\"b15\",\"matched_paper_id\":3746911},\"end\":59689,\"start\":59308},{\"attributes\":{\"id\":\"b16\",\"matched_paper_id\":51608101},\"end\":60083,\"start\":59691},{\"attributes\":{\"id\":\"b17\",\"matched_paper_id\":53022279},\"end\":60540,\"start\":60085},{\"attributes\":{\"id\":\"b18\",\"matched_paper_id\":67855512},\"end\":60924,\"start\":60542},{\"attributes\":{\"id\":\"b19\",\"matched_paper_id\":215825159},\"end\":61277,\"start\":60926},{\"attributes\":{\"id\":\"b20\",\"matched_paper_id\":22756561},\"end\":61654,\"start\":61279},{\"attributes\":{\"id\":\"b21\",\"matched_paper_id\":6159614},\"end\":62087,\"start\":61656},{\"attributes\":{\"id\":\"b22\"},\"end\":62295,\"start\":62089},{\"attributes\":{\"doi\":\"arXiv:1909.06654\",\"id\":\"b23\"},\"end\":62558,\"start\":62297},{\"attributes\":{\"id\":\"b24\",\"matched_paper_id\":20773393},\"end\":62884,\"start\":62560},{\"attributes\":{\"id\":\"b25\",\"matched_paper_id\":10402290},\"end\":63331,\"start\":62886},{\"attributes\":{\"id\":\"b26\",\"matched_paper_id\":17377212},\"end\":63923,\"start\":63333},{\"attributes\":{\"id\":\"b27\",\"matched_paper_id\":1178068},\"end\":64248,\"start\":63925},{\"attributes\":{\"id\":\"b28\",\"matched_paper_id\":2472886},\"end\":64683,\"start\":64250},{\"attributes\":{\"id\":\"b29\",\"matched_paper_id\":582314},\"end\":65013,\"start\":64685},{\"attributes\":{\"id\":\"b30\",\"matched_paper_id\":751749},\"end\":65389,\"start\":65015},{\"attributes\":{\"id\":\"b31\",\"matched_paper_id\":206594692},\"end\":65706,\"start\":65391},{\"attributes\":{\"doi\":\"arXiv:1904.03476\",\"id\":\"b32\"},\"end\":66125,\"start\":65708},{\"attributes\":{\"id\":\"b33\",\"matched_paper_id\":195908774},\"end\":66492,\"start\":66127},{\"attributes\":{\"id\":\"b34\",\"matched_paper_id\":14124313},\"end\":66814,\"start\":66494},{\"attributes\":{\"id\":\"b35\",\"matched_paper_id\":5808102},\"end\":67178,\"start\":66816},{\"attributes\":{\"id\":\"b36\",\"matched_paper_id\":15539264},\"end\":67479,\"start\":67180},{\"attributes\":{\"id\":\"b37\",\"matched_paper_id\":6844431},\"end\":67889,\"start\":67481},{\"attributes\":{\"doi\":\"arXiv:1312.4400\",\"id\":\"b38\"},\"end\":68050,\"start\":67891},{\"attributes\":{\"doi\":\"arXiv:1704.04861\",\"id\":\"b39\"},\"end\":68469,\"start\":68052},{\"attributes\":{\"id\":\"b40\"},\"end\":68853,\"start\":68471},{\"attributes\":{\"id\":\"b41\",\"matched_paper_id\":17589207},\"end\":69209,\"start\":68855},{\"attributes\":{\"id\":\"b42\",\"matched_paper_id\":3162051},\"end\":69526,\"start\":69211},{\"attributes\":{\"id\":\"b43\",\"matched_paper_id\":121321299},\"end\":69870,\"start\":69528},{\"attributes\":{\"id\":\"b44\",\"matched_paper_id\":203157487},\"end\":70130,\"start\":69872},{\"attributes\":{\"id\":\"b45\"},\"end\":70498,\"start\":70132},{\"attributes\":{\"id\":\"b46\",\"matched_paper_id\":17567398},\"end\":70754,\"start\":70500},{\"attributes\":{\"id\":\"b47\",\"matched_paper_id\":196831871},\"end\":71103,\"start\":70756},{\"attributes\":{\"id\":\"b48\"},\"end\":71424,\"start\":71105},{\"attributes\":{\"id\":\"b49\"},\"end\":71810,\"start\":71426},{\"attributes\":{\"id\":\"b50\",\"matched_paper_id\":51723509},\"end\":72367,\"start\":71812},{\"attributes\":{\"id\":\"b51\",\"matched_paper_id\":131814786},\"end\":72966,\"start\":72369},{\"attributes\":{\"doi\":\"arXiv:1901.08928\",\"id\":\"b52\"},\"end\":73257,\"start\":72968},{\"attributes\":{\"id\":\"b53\",\"matched_paper_id\":3238519},\"end\":73541,\"start\":73259},{\"attributes\":{\"id\":\"b54\",\"matched_paper_id\":1779739},\"end\":73822,\"start\":73543},{\"attributes\":{\"id\":\"b55\"},\"end\":74260,\"start\":73824}]", "bib_title": "[{\"end\":53532,\"start\":53468},{\"end\":54039,\"start\":53977},{\"end\":54436,\"start\":54365},{\"end\":54860,\"start\":54739},{\"end\":55199,\"start\":55132},{\"end\":55539,\"start\":55457},{\"end\":56062,\"start\":56004},{\"end\":56464,\"start\":56369},{\"end\":56985,\"start\":56922},{\"end\":57538,\"start\":57487},{\"end\":57938,\"start\":57859},{\"end\":58408,\"start\":58354},{\"end\":58967,\"start\":58893},{\"end\":59378,\"start\":59308},{\"end\":59765,\"start\":59691},{\"end\":60195,\"start\":60085},{\"end\":60605,\"start\":60542},{\"end\":60989,\"start\":60926},{\"end\":61331,\"start\":61279},{\"end\":61737,\"start\":61656},{\"end\":62602,\"start\":62560},{\"end\":62968,\"start\":62886},{\"end\":63405,\"start\":63333},{\"end\":63973,\"start\":63925},{\"end\":64333,\"start\":64250},{\"end\":64743,\"start\":64685},{\"end\":65072,\"start\":65015},{\"end\":65435,\"start\":65391},{\"end\":66190,\"start\":66127},{\"end\":66560,\"start\":66494},{\"end\":66908,\"start\":66816},{\"end\":67240,\"start\":67180},{\"end\":67546,\"start\":67481},{\"end\":68945,\"start\":68855},{\"end\":69252,\"start\":69211},{\"end\":69607,\"start\":69528},{\"end\":69935,\"start\":69872},{\"end\":70551,\"start\":70500},{\"end\":70849,\"start\":70756},{\"end\":71210,\"start\":71105},{\"end\":71916,\"start\":71812},{\"end\":72474,\"start\":72369},{\"end\":73304,\"start\":73259},{\"end\":73592,\"start\":73543},{\"end\":73895,\"start\":73824}]", "bib_author": "[{\"end\":53547,\"start\":53534},{\"end\":53558,\"start\":53547},{\"end\":53570,\"start\":53558},{\"end\":53580,\"start\":53570},{\"end\":53592,\"start\":53580},{\"end\":53603,\"start\":53592},{\"end\":53613,\"start\":53603},{\"end\":53623,\"start\":53613},{\"end\":54052,\"start\":54041},{\"end\":54064,\"start\":54052},{\"end\":54076,\"start\":54064},{\"end\":54447,\"start\":54438},{\"end\":54459,\"start\":54447},{\"end\":54471,\"start\":54459},{\"end\":54483,\"start\":54471},{\"end\":54872,\"start\":54862},{\"end\":54892,\"start\":54872},{\"end\":55210,\"start\":55201},{\"end\":55220,\"start\":55210},{\"end\":55229,\"start\":55220},{\"end\":55237,\"start\":55229},{\"end\":55554,\"start\":55541},{\"end\":55813,\"start\":55800},{\"end\":56075,\"start\":56064},{\"end\":56089,\"start\":56075},{\"end\":56100,\"start\":56089},{\"end\":56112,\"start\":56100},{\"end\":56126,\"start\":56112},{\"end\":56477,\"start\":56466},{\"end\":56489,\"start\":56477},{\"end\":56500,\"start\":56489},{\"end\":56510,\"start\":56500},{\"end\":56522,\"start\":56510},{\"end\":56534,\"start\":56522},{\"end\":56548,\"start\":56534},{\"end\":56998,\"start\":56987},{\"end\":57010,\"start\":56998},{\"end\":57020,\"start\":57010},{\"end\":57032,\"start\":57020},{\"end\":57040,\"start\":57032},{\"end\":57051,\"start\":57040},{\"end\":57058,\"start\":57051},{\"end\":57070,\"start\":57058},{\"end\":57548,\"start\":57540},{\"end\":57556,\"start\":57548},{\"end\":57566,\"start\":57556},{\"end\":57575,\"start\":57566},{\"end\":57581,\"start\":57575},{\"end\":57592,\"start\":57581},{\"end\":57950,\"start\":57940},{\"end\":57962,\"start\":57950},{\"end\":57969,\"start\":57962},{\"end\":57982,\"start\":57969},{\"end\":58421,\"start\":58410},{\"end\":58434,\"start\":58421},{\"end\":58445,\"start\":58434},{\"end\":58458,\"start\":58445},{\"end\":58468,\"start\":58458},{\"end\":58479,\"start\":58468},{\"end\":58489,\"start\":58479},{\"end\":58498,\"start\":58489},{\"end\":58511,\"start\":58498},{\"end\":58522,\"start\":58511},{\"end\":58977,\"start\":58969},{\"end\":58983,\"start\":58977},{\"end\":58991,\"start\":58983},{\"end\":59005,\"start\":58991},{\"end\":59386,\"start\":59380},{\"end\":59398,\"start\":59386},{\"end\":59406,\"start\":59398},{\"end\":59414,\"start\":59406},{\"end\":59778,\"start\":59767},{\"end\":59791,\"start\":59778},{\"end\":59802,\"start\":59791},{\"end\":60205,\"start\":60197},{\"end\":60211,\"start\":60205},{\"end\":60220,\"start\":60211},{\"end\":60615,\"start\":60607},{\"end\":60621,\"start\":60615},{\"end\":60627,\"start\":60621},{\"end\":60636,\"start\":60627},{\"end\":60644,\"start\":60636},{\"end\":60658,\"start\":60644},{\"end\":60999,\"start\":60991},{\"end\":61010,\"start\":60999},{\"end\":61021,\"start\":61010},{\"end\":61028,\"start\":61021},{\"end\":61341,\"start\":61333},{\"end\":61350,\"start\":61341},{\"end\":61361,\"start\":61350},{\"end\":61372,\"start\":61361},{\"end\":61382,\"start\":61372},{\"end\":61391,\"start\":61382},{\"end\":61750,\"start\":61739},{\"end\":61758,\"start\":61750},{\"end\":61770,\"start\":61758},{\"end\":61781,\"start\":61770},{\"end\":62150,\"start\":62142},{\"end\":62381,\"start\":62373},{\"end\":62390,\"start\":62381},{\"end\":62614,\"start\":62604},{\"end\":62626,\"start\":62614},{\"end\":62977,\"start\":62970},{\"end\":62988,\"start\":62977},{\"end\":63418,\"start\":63407},{\"end\":63430,\"start\":63418},{\"end\":63453,\"start\":63430},{\"end\":63462,\"start\":63453},{\"end\":63986,\"start\":63975},{\"end\":63998,\"start\":63986},{\"end\":64008,\"start\":63998},{\"end\":64020,\"start\":64008},{\"end\":64345,\"start\":64335},{\"end\":64358,\"start\":64345},{\"end\":64370,\"start\":64358},{\"end\":64753,\"start\":64745},{\"end\":64764,\"start\":64753},{\"end\":64775,\"start\":64764},{\"end\":65081,\"start\":65074},{\"end\":65088,\"start\":65081},{\"end\":65094,\"start\":65088},{\"end\":65100,\"start\":65094},{\"end\":65107,\"start\":65100},{\"end\":65443,\"start\":65437},{\"end\":65452,\"start\":65443},{\"end\":65459,\"start\":65452},{\"end\":65466,\"start\":65459},{\"end\":65832,\"start\":65824},{\"end\":65839,\"start\":65832},{\"end\":65848,\"start\":65839},{\"end\":65854,\"start\":65848},{\"end\":65862,\"start\":65854},{\"end\":65876,\"start\":65862},{\"end\":66206,\"start\":66192},{\"end\":66219,\"start\":66206},{\"end\":66231,\"start\":66219},{\"end\":66574,\"start\":66562},{\"end\":66587,\"start\":66574},{\"end\":66919,\"start\":66910},{\"end\":66930,\"start\":66919},{\"end\":67250,\"start\":67242},{\"end\":67262,\"start\":67250},{\"end\":67562,\"start\":67548},{\"end\":67572,\"start\":67562},{\"end\":67586,\"start\":67572},{\"end\":67599,\"start\":67586},{\"end\":67616,\"start\":67599},{\"end\":67918,\"start\":67911},{\"end\":67926,\"start\":67918},{\"end\":67933,\"start\":67926},{\"end\":68148,\"start\":68136},{\"end\":68155,\"start\":68148},{\"end\":68163,\"start\":68155},{\"end\":68179,\"start\":68163},{\"end\":68187,\"start\":68179},{\"end\":68197,\"start\":68187},{\"end\":68210,\"start\":68197},{\"end\":68218,\"start\":68210},{\"end\":68482,\"start\":68471},{\"end\":68492,\"start\":68482},{\"end\":68499,\"start\":68492},{\"end\":68512,\"start\":68499},{\"end\":68523,\"start\":68512},{\"end\":68954,\"start\":68947},{\"end\":68962,\"start\":68954},{\"end\":68971,\"start\":68962},{\"end\":68978,\"start\":68971},{\"end\":69263,\"start\":69254},{\"end\":69272,\"start\":69263},{\"end\":69285,\"start\":69272},{\"end\":69298,\"start\":69285},{\"end\":69619,\"start\":69609},{\"end\":69627,\"start\":69619},{\"end\":69636,\"start\":69627},{\"end\":69647,\"start\":69636},{\"end\":69655,\"start\":69647},{\"end\":69666,\"start\":69655},{\"end\":69674,\"start\":69666},{\"end\":69945,\"start\":69937},{\"end\":69953,\"start\":69945},{\"end\":69964,\"start\":69953},{\"end\":69973,\"start\":69964},{\"end\":70266,\"start\":70254},{\"end\":70279,\"start\":70266},{\"end\":70290,\"start\":70279},{\"end\":70565,\"start\":70553},{\"end\":70859,\"start\":70851},{\"end\":70866,\"start\":70859},{\"end\":70873,\"start\":70866},{\"end\":70882,\"start\":70873},{\"end\":70889,\"start\":70882},{\"end\":71224,\"start\":71212},{\"end\":71231,\"start\":71224},{\"end\":71542,\"start\":71534},{\"end\":71551,\"start\":71542},{\"end\":71929,\"start\":71918},{\"end\":71939,\"start\":71929},{\"end\":71947,\"start\":71939},{\"end\":71960,\"start\":71947},{\"end\":71970,\"start\":71960},{\"end\":71978,\"start\":71970},{\"end\":71987,\"start\":71978},{\"end\":72485,\"start\":72476},{\"end\":72494,\"start\":72485},{\"end\":72501,\"start\":72494},{\"end\":72511,\"start\":72501},{\"end\":72524,\"start\":72511},{\"end\":72536,\"start\":72524},{\"end\":72544,\"start\":72536},{\"end\":72553,\"start\":72544},{\"end\":72567,\"start\":72553},{\"end\":73042,\"start\":73035},{\"end\":73050,\"start\":73042},{\"end\":73057,\"start\":73050},{\"end\":73065,\"start\":73057},{\"end\":73072,\"start\":73065},{\"end\":73320,\"start\":73306},{\"end\":73328,\"start\":73320},{\"end\":73602,\"start\":73594},{\"end\":73609,\"start\":73602},{\"end\":73617,\"start\":73609},{\"end\":73623,\"start\":73617},{\"end\":73914,\"start\":73897},{\"end\":73922,\"start\":73914},{\"end\":73933,\"start\":73922}]", "bib_venue": "[{\"end\":63123,\"start\":63064},{\"end\":53695,\"start\":53623},{\"end\":54154,\"start\":54076},{\"end\":54540,\"start\":54483},{\"end\":54910,\"start\":54892},{\"end\":55269,\"start\":55237},{\"end\":55592,\"start\":55554},{\"end\":55798,\"start\":55776},{\"end\":56157,\"start\":56126},{\"end\":56610,\"start\":56548},{\"end\":57140,\"start\":57070},{\"end\":57422,\"start\":57407},{\"end\":57650,\"start\":57592},{\"end\":58086,\"start\":57982},{\"end\":58594,\"start\":58522},{\"end\":59077,\"start\":59005},{\"end\":59480,\"start\":59414},{\"end\":59868,\"start\":59802},{\"end\":60292,\"start\":60220},{\"end\":60689,\"start\":60658},{\"end\":61080,\"start\":61028},{\"end\":61444,\"start\":61391},{\"end\":61852,\"start\":61781},{\"end\":62140,\"start\":62089},{\"end\":62371,\"start\":62297},{\"end\":62707,\"start\":62626},{\"end\":63062,\"start\":62988},{\"end\":63544,\"start\":63462},{\"end\":64067,\"start\":64020},{\"end\":64440,\"start\":64370},{\"end\":64828,\"start\":64775},{\"end\":65179,\"start\":65107},{\"end\":65531,\"start\":65466},{\"end\":65822,\"start\":65708},{\"end\":66290,\"start\":66231},{\"end\":66646,\"start\":66587},{\"end\":66981,\"start\":66930},{\"end\":67313,\"start\":67262},{\"end\":67656,\"start\":67616},{\"end\":67909,\"start\":67891},{\"end\":68134,\"start\":68052},{\"end\":68588,\"start\":68523},{\"end\":69014,\"start\":68978},{\"end\":69357,\"start\":69298},{\"end\":69685,\"start\":69674},{\"end\":69984,\"start\":69973},{\"end\":70252,\"start\":70132},{\"end\":70607,\"start\":70565},{\"end\":70919,\"start\":70889},{\"end\":71256,\"start\":71231},{\"end\":71532,\"start\":71426},{\"end\":72065,\"start\":71987},{\"end\":72639,\"start\":72567},{\"end\":73033,\"start\":72968},{\"end\":73376,\"start\":73328},{\"end\":73656,\"start\":73623},{\"end\":74023,\"start\":73933}]"}}}, "year": 2023, "month": 12, "day": 17}