{"id": 209432866, "updated": "2023-08-31 09:28:13.167", "metadata": {"title": "Dataset of breast ultrasound images", "authors": "[{\"first\":\"Walid\",\"last\":\"Al-Dhabyani\",\"middle\":[]},{\"first\":\"Mohammed\",\"last\":\"Gomaa\",\"middle\":[]},{\"first\":\"Hussien\",\"last\":\"Khaled\",\"middle\":[]},{\"first\":\"Aly\",\"last\":\"Fahmy\",\"middle\":[]}]", "venue": "Data in Brief", "journal": "Data in Brief", "publication_date": {"year": 2019, "month": 11, "day": 21}, "abstract": "Breast cancer is one of the most common causes of death among women worldwide. Early detection helps in reducing the number of early deaths. The data presented in this article reviews the medical images of breast cancer using ultrasound scan. Breast Ultrasound Dataset is categorized into three classes: normal, benign, and malignant images. Breast ultrasound images can produce great results in classification, detection, and segmentation of breast cancer when combined with machine learning.", "fields_of_study": "[\"Medicine\"]", "external_ids": {"arxiv": null, "mag": "2991372685", "acl": null, "pubmed": "31867417", "pubmedcentral": "6906728", "dblp": null, "doi": "10.1016/j.dib.2019.104863"}}, "content": {"source": {"pdf_hash": "c1b9434aab2fced5419169c11c71fa73623159f0", "pdf_src": "PubMedCentral", "pdf_uri": null, "oa_url_match": false, "oa_info": {"license": "CCBY", "open_access_url": "https://doi.org/10.1016/j.dib.2019.104863", "status": "GOLD"}}, "grobid": {"id": "9e6948d30609cc2816444b734ffdb7128850043a", "type": "plain-text", "url": "s3://ai2-s2-pdf-extraction-prod/parse-results/s2orc_worker/c1b9434aab2fced5419169c11c71fa73623159f0.txt", "contents": "\nDataset of breast ultrasound images\nAvailable online 21 November 2019\n\nWalid Al-Dhabyani \nFaculty of Computer and Artificial Intelligence\nCairo University\nEgypt\n\nMohammed Gomaa \nNational Cancer Institute\nCairo University\nEgypt\n\nHussien Khaled \nNational Cancer Institute\nCairo University\nEgypt\n\nAly Fahmy \nFaculty of Computer and Artificial Intelligence\nCairo University\nEgypt\n\nDataset of breast ultrasound images\nAvailable online 21 November 201910.1016/j.dib.2019.104863Article history: Received 24 June 2019 Received in revised form 12 November 2019 Accepted 13 November 2019Data Article a r t i c l e i n f o This is an open access article under the CC BY license (http://creativecommons. org/licenses/by/4.0/).Ultrasound Breast cancer Medical images Dataset Deep learning Classification Segmentation Detection\na b s t r a c tBreast cancer is one of the most common causes of death among women worldwide. Early detection helps in reducing the number of early deaths. The data presented in this article reviews the medical images of breast cancer using ultrasound scan. Breast Ultrasound Dataset is categorized into three classes: normal, benign, and malignant images. Breast ultrasound images can produce great results in classification, detection, and segmentation of breast cancer when combined with machine learning.\n\nData\n\nThe data collected at baseline include breast ultrasound images among women in ages between 25 and 75 years old. This data was collected in 2018. The number of patients is 600 female patients. The dataset consists of 780 images with an average image size of 500 Â 500 pixels. The images are in PNG format. The images are categorized into three classes, which are normal, benign, and malignant. The number of images in each class is shown in Table 1. The data samples are illustrated in Fig. 1.\n\nSamples of original images and the images after preprocessing are shown in Fig. 2 and Fig. 3, respectively. Furthermore, each image has its own ground truth (mask image) as shown in Fig. 4.\n\n\nExperimental design, materials, and methods\n\n\nDataset collection\n\nUltrasound (US) images are generally in grayscale. They were collected and stored in a DICOM format at Baheya hospital. The consumed time used to collect and annotate the images is about one year. US dataset is categorized into three classes: normal, benign, and malignant. At the beginning, the number of images collected was 1100. After performing preprocessing to the dataset, the number of images was reduced to 780 images. The original images contain unimportant information not used for mass classification. Moreover, they may affect the output results of the training process. The instruments used in the scanning process are LOGIQ E9 ultrasound system and LOGIQ E9 Agile ultrasound system. These instruments are usually used in top-notch imaging for radiology, cardiac and vascular application. They produce image resolution of 1280*1024. The transducers are 1e5 MHz on ML6-15-D Matrix linear probe. Fig. 2 Illustrates a sample of the original scanned images. Value of the Data Ultrasound scan is mostly used for examination and early detection of breast cancer. Moreover, it is safe in comparison to other radiology imaging techniques. Breast Ultrasound dataset can be used to train machine learning models which can classify, detect and segment early signs of masses or micro-calcification in breast cancer. Researchers with interest in classification, detection, and segmentation of breast cancer can utilize this data of breast ultrasound images, combine it with others' datasets, and analyze them for further insights. The data is comprehensive, containing breast cancer states (normal, benign, and malignant). This dataset is e to our best knowledge e the first breast ultrasound dataset publically available. \n\n\nPreprocessing\n\nTo make the dataset useful, some tasks should be performed. The data included duplicated images that required to be removed. Furthermore, radiologists from Baheya reviewed and fixed the incorrect annotation. DICOM images were converted to PNG format by using a DICOM converter application [2]. After refining the dataset, the number of US images was reduced to 780 images. The images are categorized into three classes (cases), which are normal, benign, and malignant. All images were cropped to different sizes to remove unused and unimportant boundaries from the images. We used fast photo crop [3] for this task. The image annotation is added to the image name. Special radiologists at Baheya hospital reviewed and checked all images. An example of the refined images is shown in Fig. 3.   \n\n\nGround truth\n\nGround truth (image boundary) is performed to make the ultrasound dataset beneficial. Matlab [4] is used to perform this step. A freehand segmentation is established for each image separately. An example of mask images is shown in Fig. 4. Three folders are created for each type of breast cancer categories. Each folder has the images of its class. The image name includes the name of the class and the number of the image. Furthermore, the name of the masked image has the name as the US images with adding \"_mask\" to the end name of the image.\n\n\nEthical considerations\n\nResearchers are mindful of the fact that patients have a right to be protected from public scrutiny of their private lives and illness. To this end, the researcher ensured that the patients and the hospital were adequately informed about the objective of this study. In addition, every patient's data stays unknown and his or her illness states is with the utmost confidentiality.\n\nFig. 1 .\n1Samples of Ultrasound breast images dataset.\n\nFig. 2 .\n2Samples of original Ultrasound breast images dataset (Original images that are scanned by the LOGIQ E9 ultrasound system).\n\nFig. 3 .\n3Samples of Ultrasound breast images dataset after refining.\n\nSpecifications Table\nSpecificationsSubject areaMedicine and Dentistry More specific subject area Radiology and Imaging Type of data Images and mask images How data was acquired LOGIQ E9 ultrasound and LOGIQ E9 Agile ultrasound system Data format PNG Experimental factorsAll images are classified as normal, benign and malignantExperimental featuresWhen medical images are used for training deep learning models, they provide fast and accurate results in classification, detection, and segmentation of breast cancer.Data source locationBaheya Hospital for Early Detection & Treatment of Women's Cancer, Cairo, Egypt.Data accessibility \nhttps://scholar.cu.edu.eg/?q¼afahmy/pages/dataset \nRelated research article \n1. Walid Al-Dhabyani, Mohammed Gomaa, Hussien Khaled and Aly Fahmy, \nDeep Learning Approaches for Data Augmentation and Classification of Breast \nMasses using Ultrasound Images [1] \n\n\n\nTable 1\n1The three classes of breast cases and the number of images in each case.Case \nNumber of images \n\nBenign \n487 \nMalignant \n210 \nNormal \n133 \nTotal \n780 \n\nAcknowledgmentsThe authors would like to appreciate the management of Baheya hospital for granting permission to obtain and use medical images for this research work. Furthermore, the authors would like to thank Dr. Mohamed Hamed for his support for managing the dataset.Conflict of InterestThe authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper.Appendix A. Supplementary dataSupplementary data to this article can be found online at https://doi.org/10.1016/j.dib.2019.104863.\nDeep learning approaches for data augmentation and classification of breast masses using ultrasound images. Walid Al-Dhabyani, Mohammed Gomaa, Hussien Khaled, Fahmy Aly, 10.14569/IJACSA.2019.0100579Int. J. Adv. Comput. Sci. Appl. 105Walid Al-Dhabyani, Mohammed Gomaa, Hussien Khaled, Fahmy Aly, \"Deep learning approaches for data augmentation and classification of breast masses using ultrasound images\", Int. J. Adv. Comput. Sci. Appl. 10 (5) (2019) https://doi.org/10. 14569/IJACSA.2019.0100579.\n\n. Medixant, Dicom Radiant, Viewer, Medixant, RadiAnt DICOM Viewer, 2018. https://www.radiantviewer.com.\n\nFast Photo Crop. Smieszny, Smieszny, Fast Photo Crop, 2013. https://www.microsoft.com/ar-eg/p/fast-photo-crop/9wzdncrdnvpv?activetab¼pivot% 3Aoverviewtab.\n\n. Statistics Matlab, Toolbox Release, The MathWorks, IncNatick, Massachusetts, United StatesMATLAB and Statistics Toolbox Release, The MathWorks, Inc., Natick, Massachusetts, United States, 2015b.\n", "annotations": {"author": "[{\"end\":162,\"start\":72},{\"end\":228,\"start\":163},{\"end\":294,\"start\":229},{\"end\":377,\"start\":295}]", "publisher": null, "author_last_name": "[{\"end\":89,\"start\":78},{\"end\":177,\"start\":172},{\"end\":243,\"start\":237},{\"end\":304,\"start\":299}]", "author_first_name": "[{\"end\":77,\"start\":72},{\"end\":171,\"start\":163},{\"end\":236,\"start\":229},{\"end\":298,\"start\":295}]", "author_affiliation": "[{\"end\":161,\"start\":91},{\"end\":227,\"start\":179},{\"end\":293,\"start\":245},{\"end\":376,\"start\":306}]", "title": "[{\"end\":36,\"start\":1},{\"end\":413,\"start\":378}]", "venue": null, "abstract": "[{\"end\":1323,\"start\":815}]", "bib_ref": "[{\"attributes\":{\"ref_id\":\"b1\"},\"end\":4118,\"start\":4115},{\"attributes\":{\"ref_id\":\"b2\"},\"end\":4426,\"start\":4423},{\"attributes\":{\"ref_id\":\"b3\"},\"end\":4732,\"start\":4729}]", "figure": "[{\"attributes\":{\"id\":\"fig_0\"},\"end\":5644,\"start\":5589},{\"attributes\":{\"id\":\"fig_1\"},\"end\":5778,\"start\":5645},{\"attributes\":{\"id\":\"fig_2\"},\"end\":5849,\"start\":5779},{\"attributes\":{\"id\":\"tab_0\",\"type\":\"table\"},\"end\":6746,\"start\":5850},{\"attributes\":{\"id\":\"tab_1\",\"type\":\"table\"},\"end\":6908,\"start\":6747}]", "paragraph": "[{\"end\":1824,\"start\":1331},{\"end\":2015,\"start\":1826},{\"end\":3808,\"start\":2084},{\"end\":4619,\"start\":3826},{\"end\":5181,\"start\":4636},{\"end\":5588,\"start\":5208}]", "formula": null, "table_ref": "[{\"attributes\":{\"ref_id\":\"tab_1\"},\"end\":1779,\"start\":1772}]", "section_header": "[{\"attributes\":{\"n\":\"1.\"},\"end\":1329,\"start\":1325},{\"attributes\":{\"n\":\"2.\"},\"end\":2061,\"start\":2018},{\"attributes\":{\"n\":\"2.1.\"},\"end\":2082,\"start\":2064},{\"attributes\":{\"n\":\"2.2.\"},\"end\":3824,\"start\":3811},{\"attributes\":{\"n\":\"2.3.\"},\"end\":4634,\"start\":4622},{\"attributes\":{\"n\":\"2.4.\"},\"end\":5206,\"start\":5184},{\"end\":5598,\"start\":5590},{\"end\":5654,\"start\":5646},{\"end\":5788,\"start\":5780},{\"end\":5871,\"start\":5851},{\"end\":6755,\"start\":6748}]", "table": "[{\"end\":6746,\"start\":6466},{\"end\":6908,\"start\":6829}]", "figure_caption": "[{\"end\":5644,\"start\":5600},{\"end\":5778,\"start\":5656},{\"end\":5849,\"start\":5790},{\"end\":6466,\"start\":5886},{\"end\":6829,\"start\":6757}]", "figure_ref": "[{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":1823,\"start\":1817},{\"attributes\":{\"ref_id\":\"fig_1\"},\"end\":1907,\"start\":1901},{\"attributes\":{\"ref_id\":\"fig_2\"},\"end\":1918,\"start\":1912},{\"end\":2014,\"start\":2008},{\"attributes\":{\"ref_id\":\"fig_1\"},\"end\":2998,\"start\":2992},{\"attributes\":{\"ref_id\":\"fig_2\"},\"end\":4615,\"start\":4609},{\"end\":4873,\"start\":4867}]", "bib_author_first_name": "[{\"end\":7614,\"start\":7609},{\"end\":7636,\"start\":7628},{\"end\":7651,\"start\":7644},{\"end\":7665,\"start\":7660},{\"end\":8017,\"start\":8012},{\"end\":8273,\"start\":8263}]", "bib_author_last_name": "[{\"end\":7626,\"start\":7615},{\"end\":7642,\"start\":7637},{\"end\":7658,\"start\":7652},{\"end\":7669,\"start\":7666},{\"end\":8010,\"start\":8002},{\"end\":8025,\"start\":8018},{\"end\":8033,\"start\":8027},{\"end\":8130,\"start\":8122},{\"end\":8280,\"start\":8274},{\"end\":8297,\"start\":8282}]", "bib_entry": "[{\"attributes\":{\"doi\":\"10.14569/IJACSA.2019.0100579\",\"id\":\"b0\",\"matched_paper_id\":192522112},\"end\":7998,\"start\":7501},{\"attributes\":{\"id\":\"b1\"},\"end\":8103,\"start\":8000},{\"attributes\":{\"id\":\"b2\"},\"end\":8259,\"start\":8105},{\"attributes\":{\"id\":\"b3\"},\"end\":8457,\"start\":8261}]", "bib_title": "[{\"end\":7607,\"start\":7501}]", "bib_author": "[{\"end\":7628,\"start\":7609},{\"end\":7644,\"start\":7628},{\"end\":7660,\"start\":7644},{\"end\":7671,\"start\":7660},{\"end\":8012,\"start\":8002},{\"end\":8027,\"start\":8012},{\"end\":8035,\"start\":8027},{\"end\":8132,\"start\":8122},{\"end\":8282,\"start\":8263},{\"end\":8299,\"start\":8282}]", "bib_venue": "[{\"end\":7729,\"start\":7699},{\"end\":8120,\"start\":8105}]"}}}, "year": 2023, "month": 12, "day": 17}