{"id": 209417211, "updated": "2023-03-02 16:18:24.489", "metadata": {"title": "Unsupervised Machine Learning of Topics Documented by Nurses about Hospitalized Patients Prior to a Rapid-Response Event", "authors": "[{\"first\":\"Zfania\",\"last\":\"Korach\",\"middle\":[\"Tom\"]},{\"first\":\"Kenrick\",\"last\":\"Cato\",\"middle\":[]},{\"first\":\"Sarah\",\"last\":\"Collins\",\"middle\":[]},{\"first\":\"Min\",\"last\":\"Kang\",\"middle\":[]},{\"first\":\"Christopher\",\"last\":\"Knaplund\",\"middle\":[]},{\"first\":\"Patricia\",\"last\":\"Dykes\",\"middle\":[]},{\"first\":\"Liqin\",\"last\":\"Wang\",\"middle\":[]},{\"first\":\"Kumiko\",\"last\":\"Schnock\",\"middle\":[]},{\"first\":\"Jose\",\"last\":\"Garcia\",\"middle\":[]},{\"first\":\"Haomiao\",\"last\":\"Jia\",\"middle\":[]},{\"first\":\"Frank\",\"last\":\"Chang\",\"middle\":[]},{\"first\":\"Jessica\",\"last\":\"Schwartz\",\"middle\":[]},{\"first\":\"Li\",\"last\":\"Zhou\",\"middle\":[]}]", "venue": "Applied Clinical Informatics", "journal": "Applied Clinical Informatics", "publication_date": {"year": 2019, "month": 10, "day": 1}, "abstract": "Abstract Background In the hospital setting, it is crucial to identify patients at risk for deterioration before it fully develops, so providers can respond rapidly to reverse the deterioration. Rapid response (RR) activation criteria include a subjective component (“worried about the patient”) that is often documented in nurses' notes and is hard to capture and quantify, hindering active screening for deteriorating patients. Objectives We used unsupervised machine learning to automatically discover RR event risk/protective factors from unstructured nursing notes. Methods In this retrospective cohort study, we obtained nursing notes of hospitalized, nonintensive care unit patients, documented from 2015 through 2018 from Partners HealthCare databases. We applied topic modeling to those notes to reveal topics (clusters of associated words) documented by nurses. Two nursing experts named each topic with a representative Systematized Nomenclature of Medicine–Clinical Terms (SNOMED CT) concept. We used the concepts along with vital signs and demographics in a time-dependent covariates extended Cox model to identify risk/protective factors for RR event risk. Results From a total of 776,849 notes of 45,299 patients, we generated 95 stable topics, of which 80 were mapped to 72 distinct SNOMED CT concepts. Compared with a model containing only demographics and vital signs, the latent topics improved the model's predictive ability from a concordance index of 0.657 to 0.720. Thirty topics were found significantly associated with RR event risk at a 0.05 level, and 11 remained significant after Bonferroni correction of the significance level to 6.94E-04, including physical examination (hazard ratio [HR] = 1.07, 95% confidence interval [CI], 1.03–1.12), informing doctor (HR = 1.05, 95% CI, 1.03–1.08), and seizure precautions (HR = 1.08, 95% CI, 1.04–1.12). Conclusion Unsupervised machine learning methods can automatically reveal interpretable and informative signals from free-text and may support early identification of patients at risk for RR events.", "fields_of_study": "[\"Medicine\"]", "external_ids": {"arxiv": null, "mag": "2996337964", "acl": null, "pubmed": "31853936", "pubmedcentral": null, "dblp": "journals/aci/KorachCCKKDWSGJ19", "doi": "10.1055/s-0039-3401814"}}, "content": {"source": {"pdf_hash": "2018b37aa1b9fa60222191b74ad6bed4c4916a2d", "pdf_src": "Thieme", "pdf_uri": null, "oa_url_match": false, "oa_info": {"license": null, "open_access_url": "http://www.thieme-connect.de/products/ejournals/pdf/10.1055/s-0039-3401814.pdf", "status": "BRONZE"}}, "grobid": {"id": "e39c181560a2a2ea54535a374958b3999449d4c9", "type": "plain-text", "url": "s3://ai2-s2-pdf-extraction-prod/parse-results/s2orc_worker/2018b37aa1b9fa60222191b74ad6bed4c4916a2d.txt", "contents": "\nUnsupervised Machine Learning of Topics Documented by Nurses about Hospitalized Patients Prior to a Rapid-Response Event\n\n\nZfania Tom Korach zkorach@bwh.harvard.edu. \nDivision of General Internal Medicine and Primary Care\nDepartment of Medicine\nBrigham and Women's Hospital\nBostonMassachusettsUnited States\n\nKenrick D Cato \nSchool of Nursing\nColumbia University\nNew YorkNew YorkUnited States\n\nSarah A Collins \nSchool of Nursing\nColumbia University\nNew YorkNew YorkUnited States\n\nDepartment of Biomedical Informatics\nDivision of General Internal Medicine and Primary Care\nDepartment of Medicine, Brigham and Women's Hospital\nColumbia University\n399 Revolution Dr02145New York, SomervilleNew York, MassachusettsUnited States, United States\n\nMin Jeoung Kang \nDivision of General Internal Medicine and Primary Care\nDepartment of Medicine\nBrigham and Women's Hospital\nBostonMassachusettsUnited States\n\nChristopher Knaplund \nSchool of Nursing\nColumbia University\nNew YorkNew YorkUnited States\n\nPatricia C Dykes \nDivision of General Internal Medicine and Primary Care\nDepartment of Medicine\nBrigham and Women's Hospital\nBostonMassachusettsUnited States\n\nLiqin Wang \nDivision of General Internal Medicine and Primary Care\nDepartment of Medicine\nBrigham and Women's Hospital\nBostonMassachusettsUnited States\n\nKumiko O Schnock \nDivision of General Internal Medicine and Primary Care\nDepartment of Medicine\nBrigham and Women's Hospital\nBostonMassachusettsUnited States\n\nJose P Garcia \nDivision of General Internal Medicine and Primary Care\nDepartment of Medicine\nBrigham and Women's Hospital\nBostonMassachusettsUnited States\n\nHaomiao Jia \nSchool of Nursing\nColumbia University\nNew YorkNew YorkUnited States\n\nFrank Chang \nDivision of General Internal Medicine and Primary Care\nDepartment of Medicine\nBrigham and Women's Hospital\nBostonMassachusettsUnited States\n\nJessica M Schwartz \nSchool of Nursing\nColumbia University\nNew YorkNew YorkUnited States\n\nLi Zhou \nDivision of General Internal Medicine and Primary Care\nDepartment of Medicine\nBrigham and Women's Hospital\nBostonMassachusettsUnited States\n\nUnsupervised Machine Learning of Topics Documented by Nurses about Hospitalized Patients Prior to a Rapid-Response Event\n10.1055/s-0039-3401814Address for correspondence Zfania Tom Korach, MD,► hospital rapid response team ► nursing assessment ► electronic health records ► survival analysis ► nursing notes ► natural language processing ► machine learning ► medicine\nBackground In the hospital setting, it is crucial to identify patients at risk for deterioration before it fully develops, so providers can respond rapidly to reverse the deterioration. Rapid response (RR) activation criteria include a subjective component (\"worried about the patient\") that is often documented in nurses' notes and is hard to capture and quantify, hindering active screening for deteriorating patients. Objectives We used unsupervised machine learning to automatically discover RR event risk/protective factors from unstructured nursing notes. Methods In this retrospective cohort study, we obtained nursing notes of hospitalized, nonintensive care unit patients, documented from 2015 through 2018 from Partners HealthCare databases. We applied topic modeling to those notes to reveal topics (clusters of associated words) documented by nurses. Two nursing experts named each topic with a representative Systematized Nomenclature of Medicine-Clinical Terms (SNOMED CT) concept. We used the concepts along with vital signs and demographics in a time-dependent covariates extended Cox model to identify risk/protective factors for RR event risk. Results From a total of 776,849 notes of 45,299 patients, we generated 95 stable topics, of which 80 were mapped to 72 distinct SNOMED CT concepts. Compared with a model containing only demographics and vital signs, the latent topics improved the model's predictive ability from a concordance index of 0.657 to 0.720. Thirty topics were found significantly associated with RR event risk at a 0.05 level, and 11 remained significant after Bonferroni correction of the significance level to 6.94E-04, including physical examination (hazard ratio [HR] ¼ 1.07, 95% confidence interval [CI], 1.03-1.12), informing doctor (HR ¼ 1.05, 95% CI, 1.03-1.08), and seizure precautions (HR ¼ 1.08, 95% CI, 1.04-1.12). Conclusion Unsupervised machine learning methods can automatically reveal interpretable and informative signals from free-text and may support early identification of patients at risk for RR events.\n\nBackground and Significance\n\nRapid response (RR) teams are charged with responding to nonintensive care unit patients at risk for rapid deterioration, with the goal of preventing further deterioration and changing the deterioration's course. RR systems usually include two components: (1) identification of a clinical deterioration while it develops (as opposed to cardiac arrest teams that respond after the actual deterioration has occurred), and (2) provision of effective and timely interventions, aimed at treating the deterioration. The identification of imminent clinical deterioration and prompt clinical intervention were demonstrated to reduce mortality. 1,2 Typically, RR systems are reactive in the sense of responding to calls made by staff noticing concerning findings. Active (prospective) surveillance of triggers for patient deterioration has achieved mixed results so far. 3,4 To facilitate active detection, the Clinical Decision Support Communication for Risky Patient States (CONCERN) study investigates nurses' judgment that a patient's clinical state may be deteriorating, in both narrative and structured information in acute and critical care. 5 While RR triggers are mostly objective measurements (e.g., heart rate, blood pressure, and alertness), they typically also include a subjective component such as \"Staff member is worried about the patient\" or \"Any patient you are seriously worried about.\" 6,7 Such subjective measures have been shown to capture cases that would be missed by the objective criteria. 8 From the perspective of missed cases, an independent review of 118 inpatient cardiac arrest cases in a public hospital found that in 35% of avoidable arrest cases, communication of the nurses' concern about the patient's deterioration to the physician was delayed. 9 While clinically important, the subjective criterion encompasses a multitude of clinical entities, and the reporting clinician might even lack a clear culprit finding. 8 Such variability and implicitness may hinder the ability to actively survey patients for subtle or subjective signs of deterioration due to challenges to formalize the criteria. By nature, these signs are expressed only in unstructured data such as notes. However, free-text notes cannot be used as-is for statistical modeling and risk prediction. Rather, they need to be transformed to numerical values in a process called \"feature engineering.\" Hand-crafting feature is a labor-intensive process (e.g., deciding what signs and symptoms to extract from the notes), especially for exploratory studies looking to elucidate new associations as in the case of nurses' concern for RR event. To overcome these challenges, we applied topic modeling, an unsupervised machine learning approach, to explore the content of the notes prior to RR events and discover potential associations between the topics mentioned in nurses' documentation and RR event incidence.\n\nTopic modeling, by applying statistical machine learning approaches, allows the revelation of latent patterns in the text without requiring manual annotation. Thus, it reduces the needed subject matter expert (SME) effort and is more suitable for exploratory analysis, where the relevant factors in the notes are not yet known. It has been extensively used for automatic feature engineering in text analysis and classification tasks. 10,11 Briefly, topic modeling views documents as bags of words (i.e., the word's position does not matter, only its occurrence in the document). It assumes that each document was generated by picking a set of topics for this document and then for each selected topic, picking a set of words according to their association with the topic. Thus, topics are essentially distribution of words, where for a given topic each word has an association strength ranging from 0 to 1, and the sum of the association strength across all words equals 1. By observing the actual distribution of words in representative documents, the process can be reverse-engineered to unravel the original topics (i.e., their word distribution). The weight of each topic in a document can be calculated by counting the occurrence of each word in the document and applying the word-in-topic distribution. Various algorithms can be used to learn the topics from text, among them latent Dirichlet allocation (LDA) is commonly used. 12 In contrast to term-based approaches, topic modeling provides insights about themes appearing in a document even if the exact phrases vary from case to case. The resulting topics can be interpreted by SMEs and assigned to real-world clinical entities, to increase the interpretability of other statistical models based on the topics. Topic modeling has been widely applied to clinical text for various analyses including risk prediction, disease trajectory detection, and phenotyping. [13][14][15] In the present study, we adopted topic modeling and survival analysis to discover potential factors in the clinical notes associated with the risk of RR event. We hypothesize that the topics revealed by topic modeling from nurses' documentation will be significantly associated with RR event incidence. The advancements in the identification of RR events therefore could facilitate earlier intervention and mitigation of preventable harms.\n\n\nMethods\n\nA high-level description of the study architecture is outlined in ►Fig. 1.\n\n\nData Collection\n\n\nStudy Population\n\nThe study population comprised hospitalized patients who were admitted to hospitals affiliated to Partners HealthCare, a large hospital system in the United States' northeastern region, between 2015 and 2018.\n\nInclusion criterion: Hospitalized patients who were admitted to at least one of the study units for 24 hours and longer. The study units were defined as \"A clinical general medical or surgical acute care or critical care unit,\" excluding pediatric or neonatal units, hospice units, emergency department, oncology units, obstetrics/labor and delivery units, behavioral/psychiatry units, observational units, operating room, preoperative, postoperative/postanesthesia care unit, same day surgical units, and plastic surgery units.\n\nExclusion criteria: (1) Patients less than 18 years old at the beginning of the study period, (2) patients who received hospice or palliative care, and (3) patients who lacked a hospital encounter.\n\n\nFollow-Up Scope\n\nSince patients may transfer between departments during their hospitalization, they were followed (for both exposure and outcome) only during their stay in study-included units and excluded when moved to a nonstudy unit. Transfers to radiology, procedures, operating room, and outpatient units were considered included or excluded based on the inclusion of the department from which they transferred. An example of an encounter's timeline and the corresponding inclusion status can be found in ►Fig. 2. Thus, each encounter included one or more contiguous time intervals during which the patient stayed only in included study units. For survival analysis, each interval is considered a separate case. Thus, the intervals of each encounter are correlated and will therefore require adjustment for the correlation. Since in practice over 99.8% of the encounters contained only a single interval, only the first interval of each encounter was included in the follow-up period, sparing the need for the more complex correlation adjustment (e.g., frailty analysis).\n\nData was collected only from the beginning of each followup period until either a RR event or right-censoring. To filter outliers, late RR events, defined as those occurring beyond the 99th percentile of the time from admission to RR event among the CONCERN study population (1,282 hours), were excluded. Thus, right-censoring occurred at the earliest of the end of the follow-up period (time interval) and 1,282 hours since admission.\n\n\nNote Collection\n\nWe included the following types of nursing notes in our study: progress notes, consults, procedures, discharge summaries, assessment and plan note, nursing note, code documentation, significant event, transfer/sign off note, nursing summary, and family meeting. Among those note types, we only obtained the notes documented by registered nurses. RR documentation notes were excluded from this analysis, despite being in the scope of the full CONCERN study, to prevent leakage of outcome information to the features.\n\n\nOutcome Calculation\n\nIncidence of RR events was captured from nursing flowsheets. Following the general scope of project, events occurring within 24 hours of admission were ignored, as well as events occurring past the 1,282 hours censoring time point. As multiple RR events can occur in a single encounter, only the first RR event was used. Fig. 2 Partitioning of an encounter to intervals and their inclusion status. A patient may be initially admitted to a nonstudy unit. The follow-up period begins once the patient is transferred to a study unit. Temporary transfers to radiology, procedures, operating room, and outpatient units do not change the inclusion/exclusion status. Once the patient is transferred to a nonstudy unit, follow-up ceases. Fig. 1 A high-level description of the study architecture. The content of narrative texts is not numeric and cannot be used directly in statistical modeling (unlike, e.g., vital signs). Therefore, unsupervised machine learning was used to automatically learn numeric features that represent the content of nursing notes and correspond to known clinical concepts (from Systematized Nomenclature of Medicine-Clinical Terms [SNOMED CT]). These features were then used to develop a survival model of the clinical outcome, incidence of rapid response event, to discover clinical entities associated with the outcome.\n\n\nTopic Modeling\n\n\nNote Preparation\n\nThe notes were tokenized and sentence segmented using the Stanford CoreNLP tokenizer. 16 Dates and numbers were collapsed to placeholder tokens. Headers and other text sequences automatically injected into the text by the electronic health record were removed, based on a manual review of the 1,000 most frequent n-grams of length 1 to 4 in the notes.\n\n\nTopic Model Training\n\nTopic models were trained on all of the notes using the Gensim implementation of the LDA algorithm. 17 The default hyperparameters were used except 50 passes and 5 iterations (►Table 1).\n\n\nTopic Stabilization\n\nSince LDA is a random process, the generated topics may change from invocation to invocation. We therefore reused a method developed by Shao et al to capture stable topics that remain similar between LDA runs. 15 The process is depicted in ►Fig. 3: for each target number of topics n, 3 topic models were trained using the same configuration (step 1), yielding 3 topic sets, each consisting of n LDA topics. For each of the n Â n Â n LDA topic-triplets in the Cartesian product of the three sets, we calculated the similarity of the triplet's topics in terms of their pairwise cosine similarity (step 2). Following the original method, we retained only triplets whose average cosine similarity exceeded 0.7 (in a -1 to 1 scale), removing topics that varied between invocations and thus are more likely to represent noise (step 3). Each retained triplet was consolidated to a stable topic by averaging its components. The density of a stable topic in a document was calculated as the average of its individual components' densities in that document.\n\n\nTopic Number Selection\n\nThe number of topics is not learned by the algorithm. Rather, it is prespecified and is the most important configuration variable. Therefore, we searched for the optimal number of topics by training topic models to generate differing number of topics (50 to 250 in intervals of 50) and comparing the goodness-of-fit of a survival model based on the discovered topics, in line with the study's goal of identifying risk factors for RR event. Since the topics were learned using only the word co-occurrence information, without any information about the outcome, the full set of notes was used to fit the Cox model (without splitting the data to training and testing sets). The range of possible target numbers was set to 50 to 250 in intervals of 50. The lower limit was selected based on our previous work in which clinicians enumerated the clinical entities related to clinical deterioration amounting to 120 entities. The upper limit was selected based on two factors. First, the number of predictors in Cox model is practically limited by the number of observed events, requiring approximately 10 events per each predictor and thus limiting the number of predictors in the current study to approximately 100. 18,19 Second, the SMEs' capacity to review and name the topics placed additional limit on the target number of topics. The stable topics were applied as-is (without manual review) to the full corpus. The weight of each stable topic in each note, along with the patient's age at admission, sex, and calendar hour of the note's entry were used as covariates for an extended Cox model. The different topic numbers were compared by the concordance index of their respective extended Cox models. Briefly, the concordance is defined as P(x i > x j |y i > y j ), the probability that the model's prediction goes in the same direction as the actual data. A pair of observations (i, j) is considered concordant if the prediction (x) and the outcome data (y) go in the same direction, that is, (y i > y j and x i > x j ) and vice versa. The concordance index is the fraction of concordant pairs. Since in survival analysis higher risk translates to earlier event time, the definition of a concordant pair is flipped: a pair of observations is concordant if the observation with the higher risk (as estimated by the model) experiences the event earlier (has a shorter survival time), that is, (y i < y j and x i > x j ). The concordance index is an extension of the area under the receiver-operating curve measure and it reflects the model's ability to rank (discriminate between) the observations according to their true risk/class. A concordance index value of 0.5 represents a model that is no better than a random guess and a value of 1 represents a model that can perfectly rank observations.\n\n\nTopic Naming\n\nTwo nursing SMEs separately reviewed the words from each stable topic (see ►Fig. 3, step 4) and assigned a concept from Systematized Nomenclature of Medicine-Clinical Terms (SNOMED CT) as the stable topic's name or discarded the stable topic if it was not clinically relevant (step 5). Each of these steps was performed based on the stable topic's top 10 words and top-10 weighted documents. Any disagreement between the two SMEs was resolved by consensus.\n\n\nCalculation of Concept Weights per Document\n\nThe weight of each stable topic in each document was calculated by averaging the weight of its components (the LDA topics from the three topic models). The weight of a concept in a document was calculated using the value of the stable topic to which it was assigned. When multiple stable topics were assigned to the same concept, the weights of the stable topics were aggregated by summation. Thus, throughout the process multiple LDA topics are aggregated to a single stable topic (topic stabilization step), and multiple stable topics are aggregated to a single SNOMED CT concept (topic naming step). Eventually, each document was represented by the weight of each of the SNOMED CT concepts.\n\n\nSurvival Analysis\n\nExtended Cox model with time-dependent covariates was used to estimate the association between each concept and the hazard of RR event. 20 Correlation between the concepts was estimated using variation inflation factor (VIF), to guide their inclusion together in a single model versus separate Fig. 3 Topic stabilization, naming, and consolidation process. See text for description of the numbered steps. First, three distinct topic models (epochs) are trained on the same corpus using the same target number of topics (1). Random components of the latent Dirichlet algorithm cause the generated topic to differ between the three epochs. The Cartesian product (taking all possible combination of the topics from the three epochs) is calculated, yielding n 3 triplets. The pairwise cosine similarity between the topics is calculated, yielding three values for each triplet (2). These values are averaged, and only those triplets which surpass the predefined cutoff are retained (3), to capture the stable topics-topics that remain similar between epochs. The stable topics are reviewed by two nursing experts and are either assigned a title from among Systematized Nomenclature of Medicine-Clinical Terms (SNOMED CT) concepts or discarded (4). The retained stable topics are consolidated (if multiple topics were assigned the same SNOMED CT concept) to generate the final list of concepts that will be used to represent the documents' content in the survival analysis.\n\nApplied Clinical Informatics Vol. 10 No. 5/2019 model for each concept. Since vital signs are part of existing RR activation criteria, they were incorporated into the model as well. Heart rate, blood pressure (separating regular vs. arterial and systolic vs. diastolic to different variables), respiratory rate, oxygen saturation, and temperature values were collected from flowsheets. The most recent measurement within the 8 hours preceding the note was used. The topic weights and vital sign values were normalized to mean 0 and variance 1. Potential confounders were added to the model including both time-dependent (calendar hour of the note's entry) and timeindependent (age at admission and sex) ones.\n\nTo investigate the effect of topic weights, three Cox models were built: vital signs alone, concept weights alone, and concept weights plus vital signs. The models were compared using their concordance index. For the concepts, a 0.05 significance level was prespecified and Bonferroni correction (dividing the prespecified significance level by the number of comparisons) was used to account for the multiple comparisons.\n\n\nResults\n\nThe \n\n\nTopic Model Search and Naming\n\nOut of the five topic models built, the n ¼ 250 topics model achieved the highest concordance index of 0.714. The concordance index showed a monotonically increasing relationship with the number of topics (Spearman's r: 0.900, p-value: 0.037).\n\nThe selected model (n ¼ 250) yielded 95 stable topics (out of 15,625,000 possible triplets). The SMEs assigned 80 of them to 72 distinct concepts, discarding 15 (15.7%) of them. The stable topics and their assigned concepts are listed in ►Table 2.\n\n\nSurvival Analysis\n\nVIF was low for all concepts (1.00-1.39) indicating the absence of substantial correlation between them. The models using vital signs alone and concept weights alone achieved a concordance index of 0.657 and 0.694, respectively, while the model combining both vital signs and concept weights achieved a higher concordance index of 0.720. The covariates whose Schoenfeld residuals were significantly associated with time are listed in ►Table 3. The hazard ratio (HR), 95% confidence interval (95% CI), and statistical significance at the two levels (raw and corrected) for all covariates in the final model are presented in ►Fig. 4. Using the raw significance level (0.05), 30 concepts were found statistically significant, dropping to 11 after the application of Bonferroni correction. \n\n\nDiscussion\n\nThe topics revealed by the unsupervised method corresponded well (80 out of 95 topics retained) to real-world clinical concepts. Moreover, these topics enhanced the ability to predict RR event hazard over vital signs alone. Some of the significantly associated concepts match the expected results, for example, the protective effect of \"ambulating patient,\" while others are novel findings and may guide further investigation, including validation of the concept's manifestation in the notes and validation studies. Notably, several concepts describing increased medical attention, including \"close observation,\" \"physical examination,\" \"informing doctor,\" and \"assessment of eating and drinking behavior,\" were found to increase the hazard of RR event. These significant associations may represent early and subtle cues about impending clinical deterioration expressed by the nursing staff before the patient's condition crosses the threshold for RR team activation. From a clinical perspective our results in ►Fig. 4 are encouraging. For example, several concepts that increased risk for RR correspond with traditional criteria for initiating a RR (i.e., respiratory rate, general health deterioration, cardiac arrhythmia). Also, several concepts that indicated decreased risk of RR, align with preventative clinical actions (i.e., prevention of deep vein thrombosis, neurological mental status, diuretic therapy). To further develop these signals, we propose future work which would validate the discovered risk/protective factors by manual chart review and testing on data from other organizations, as well as automated term recognition methods to capture complex clinical entities from the text. Nonsignificant associations between plausible concepts and RR event hazard could result from various reasons.  Particularly, negation, experiencer, and other context modifiers of a mention (e.g., \"no pain or swelling\") divide the various mentions of a word to different meanings. However, such differences are not captured by bag-of-words methods like topic modeling which consider only the presence or absence of the word, highlighting these methods' limitation. This study suffers from several limitations. First, while the addition of concepts to the survival model achieved a higher predictive ability, the enhanced model does not achieve perfect accuracy (concordance index of 0.720 in a scale of 0.5-1.0). During the target topic number search, the predictive ability increased monotonically with the number of topics (Spearman's r: 0.900, p-value: 0.037), suggesting a benefit from further increase of the target number of topics. As explained above, the target number of topics was limited in this work by the sample and the available human effort.  Fig. 4 Extended Cox model results. The vertical bar in the plot represents 0, the value of no-effect (in logarithmic scale), corresponding to a hazard ratio of 1. Ef., effect on the hazard rate; \"↓,\" decreasing hazard; \"\",\" increasing hazard; \" ¼ ,\" no effect on hazard.\n\nThe current findings may spur collection of a larger sample and additional human effort to allow a higher target number of topics to enhance the resulting survival model's capacity. Second, while the topics' manifestation in the notes was inspected in the top-10 notes for each topic, the accuracy by which the assigned concepts' weights describe the note's content was not formally evaluated. In addition to requiring intensive SME effort, such evaluation faces inherent challenges stemming for the continuous nature of topic weights compared with the dichotomous manner by which human annotators typically grade a topic occurrence. Finally, this study included data from a single organization, precluding estimation of the findings' generalizability to other organizations which might differ in documentation habits and patient population.\n\n\nConclusion\n\nThe present study demonstrates the ability of unsupervised machine learning to automatically extract interpretable and informative textual features from free-text without manual feature engineering, facilitating large-scale and exploratory studies of clinical outcomes from unstructured data.\n\n\nClinical Relevance Statement\n\nUnsupervised machine learning can be used to discover nursing topics associated with a clinical outcome's risk with reduced manual effort.\n\nMultiple Choice Questions 1. What manual effort is needed from the subject matter experts (SMEs) to use topic modeling? a. The SMEs have to define each topic and its root word, so the topic modeling algorithm can expand these roots to other words. b. SMEs have to define the number of top words in each topic, to guide the algorithm about the distribution of words in the topics. c. SMEs have to manually tag notes with annotations of topics, so the topic modeling algorithm can learn how topics look and find new ones. d. SMEs have to define only the number of topics. Optionally, they can review the topics to assign concepts to each of them.\n\nCorrect Answer: The correct answer is option d. As an unsupervised machine learning method, latent Dirichlet allocation-based topic modeling generates the topics (word distribution) from observed corpus and does not require a root for each topic (a). Labeled examples are needed for supervised machine learning algorithms (c). The target number of topics needs to be defined (d) rather than the number of top words in each topic (b).\n\n2. When learning a topic model, how is the target number of topics determined? a. The target number of topics is determined automatically by the latent Dirichlet allocation (LDA) algorithm, since it is an unsupervised machine learning algorithm. b. The target number is determined manually and requires careful selection. c. The largest target allowed by the computer hardware should be used. d. The number of the topics depends on the number of distinct words in the corpus.  Correct Answer: The correct answer is option b. The target number of topics is a configuration parameter and is not determined by either the topic modeling algorithm (a) or the vocabulary size (d). Rather, it is set manually and requires careful selection, either based on prior knowledge or based on a relevant benchmark (b). Even when the hardware is capable of handling a higher number of topics, other considerations (e.g., ratio of variables to number of examples) might dictate a lower number (c).\n\n\nProtection of Human and Animal Subjects\n\nThe study was approved by the institutional review board of Partners HealthCare System. \n\nFig. 4 (\n4Continued)\n\nFunding\nThis work was funded by the National Institute of Nursing Research (NINR) award number 1R01NR016941. Jessica Schwartz is a pre-doctoral fellow funded by the National Institute of Nursing Research Reducing Health Disparities Through Informatics (RHeaDI) T32NR007969 and was funded by a grant from CRICO titled \"2017-2019: Resilience in Clinical Deterioration Survival: Learning from Different Outcomes in Critical and Acute Care.\"\n\nTable 1\n1Gensim's default hyperparameters used for topic model training Passes Number of passes through the corpus during training 1 update_every Number of documents to be iterated through for each update. Set to 0 for batch learning, > 1 for online iterative learning per_word_topics If True, computes a list of topics, sorted in descending order of most likely topics for each word, along with their phi values multiplied by the feature lengthHyperparameter \nDescription \n\n\n\nstudy cohort included 45,299 patients (23,110 women [51.0%] and 22,152 men [48.9%]; mean [standard deviation, SD] age, 62.1 [17.4] years) with a total of 61,740 hospital encounters and 1,067 RR events. RR events occurred at a median of 82 hours after the admission. The follow-up time (i.e., the time from entering a study unit to the earliest of exit from study unit, discharge, or RR event) averaged 140 (SD: 164) hours with a median of 82 and interquartile range of 44 to 167 hours. ►Table 1 lists the types and the numbers of notes included in this study.\n\n\nThe significantly hazard-increasing covariates represent various themes including patient factors (age, HR ¼ 1.492, 95% CI ¼ 1.385-1.607), vital signs (respiratory rate, HR ¼ 1.086, 95% CI ¼ 1.068-1.105), and clinical attention (physical examination, HR ¼ 1.074, 95% CI ¼ 1.033-1.117; informing doctor, HR ¼ 1.054, 95% CI ¼ 1.028-1.081; and assessment of eating and drinking behavior, HR ¼ 1.053, 95% CI ¼ 1.025-1.082). The most protective covariates include concepts representing clinical improvement (weaning from mechanically assisted ventilation, HR ¼ 0.838, 95% CI ¼ 0.766-0.917 and ambulating patient, HR ¼ 0.594, 95% CI ¼ 0.486-0.726).\n\nTable 2\n2The number of notes by note typeNote type \nCount \n\nProgress notes \n727,705 \n\nNursing summary \n36,913 \n\nNursing note \n5,411 \n\nProcedures \n3,099 \n\nSignificant event \n1,739 \n\nTransfer/Sign off note \n1,672 \n\nCode documentation \n272 \n\nFamily meeting \n38 \n\nTotal \n776,849 \n\nApplied Clinical Informatics Vol. 10 No. 5/2019 \n\n\nTable 3\n3The top-10 words and the concept assigned to each stable topicConcept \nSNOMED CT ID \nTop-10 words \n\nAbdominal pain \n21522001 \nperforated, pain, diverticulitis, appendectomy, iv, appendicitis, rlq, qtc, sotalol, cipro \n\nAdmission assessment \n406152008 \nadmission, nursing, note, arrived, arrival, stretcher, ed, floor, pain, pacu \n\nAdvanced directive status \n310301000 \nliving, hill, wingate, golden, chestnut, wks, str, salem, weston, assisted \n\nAlcohol dependence \n66590003 \nativan, etoh, withdrawal, ciwa, anxiety, prn, po, tremors, shift, mg \n\nAmbulating patient \n62013009 \npain, steady, gait, flatus, oob, bs, voiding, abd, soft, bm \n\nAmbulating patient \n62013009 \nad, lib, pain, up, oob, denies, well, room, steady, vss \n\nAntibiotic therapy \n281789004 \nvanco, iv, trough, dose, po, picc, shift, id, due, vanc \n\nAnticoagulant therapy \n182764009 \nheparin, ptt, gtt, units, kg, time_placeholder, next, due, therapeutic, coumadin \n\nArteriovenous fistula \n439470001 \nhd, dialysis, fistula, esrd, avf, arm, removed, renal, mwf, bruit \n\nAssessment of eating \nand drinking behavior \n\n710848001 \ncrackers, toast, juice, rechecked, pain, st, aware, md, degree, orange \n\nAssessment of pain control \n370778008 \npain, well, controlled, diet, monitor, tolerating, managed, voiding, vss, oob \n\nAt risk for aspiration \n371736008 \naspiration, pills, liquids, crushed, diet, applesauce, slp, dysphagia, meds, whole \n\nBackache \n161891005 \npain, lumbar, spine, back, spinal, fusion, cervical, mg, posterior, date_placeholder \n\nBladder retention of urine \n130951007 \ncath, bladder, straight, void, cc, urinary, scan, retention, scanned, time_placeholder \n\nBlood pressure alteration \n129899009 \nline, pa, milrinone, goal, stable, failure, tbb, mg, remains, bleeding \n\nCardiac arrhythmia \n698247007 \nrun, beat, nsvt, runs, asymptomatic, shift, am, completed, mg, started \n\nCase management \n386230005 \nmanagement, case, completed, screening, initial, follow, assessment, high, available, \nrisk \n\nClose observation \n225415001 \npsych, time_placeholder, sitter, shift, times, bed, leave, agitated, section, safety \n\nCutaneous hypersensitivity \n21626009 \nrash, benadryl, itching, sarna, lotion, iv, pain, noted, itchiness, prn \n\nDiabetic care management \n385806006 \nfs, hs, ac, insulin, lispro, scale, lantus, sliding, coverage, ss \n\nDischarge planning \n371754007 \ndischarge, facility, care, ambulance, paperwork, time, snf, must, transfer, via \n\nDischarge planning \n371754007 \nrehab, bed, cm, ready, spaulding, follow, team, discharge, facility, snf \n\nDischarge planning \n371754007 \ndischarge, understanding, reviewed, instructions, home, verbalized, all, questions, up, \nwritten \n\nDiscomfort \n247347003 \ncomplaint, fib, pain, chief, roll, tach, iv, tib, time, lsctab \n\nDisease of liver \n235856003 \nlactulose, shift, liver, cirrhosis, following, hepatic, encephalopathy, bms, po, sbp \n\nDiuretic therapy \n722048006 \nmg, lasix, iv, ivp, po, am, afib, sob, started, dose \n\nEmotional support \n133921002 \nsupport, emotional, provided, pain, monitor, safety, maintained, see, care, bedside \n\nEvaluation of response to administration \nof fluids and electrolytes \n\n372068006 \npac, sodium, ph, blood, iv, shift, bicarb, urine, accessed, cal \n\nEvaluation of tubes and drains \n711139001 \ndrain, ir, pain, drainage, iv, flushed, drains, cc, fluid, abdominal \n\nEvaluation of tubes and drains \n711139001 \nchest, ct, pain, tube, leak, suction, right, noted, left, site \n\nExamination of limb \n302773001 \ngroin, pulses, left, hematoma, artery, repair, pain, site, sbp, bilateral \n\nFalls education \n390997009 \ncall, bed, bell, reach, alarm, light, denies, within, safety, pain \n\nFinding of pattern of pain \n301369003 \nanti, pain, spasms, pigtail, β, xa, spasm, cxray, shift, am \n\nFluid balance regulation \n276026009 \nml, ns, calcium, volume, fluid, bolus, exchange, time, albumin, total \n\nFracture care \n385691007 \nfall, fracture, fx, left, pain, mg, right, orif, tylenol, hip \n\nGeneral health deterioration \n285384003 \nchange, reassess, team, ccrn, prn, subject, lead, aware, remains, medical \n\nHandoff communication \n432138007 \nsummary, illness, action, verbal, confirm, awareness, concerns, handoff, severity, issues \n\nHemodialysis observable \n4.81E þ 11 \ndate_placeholder, hd, laboratory, date, results, component, value, post, negative, \nweight \n\nHigh risk of bleeding \n711536002 \nhct, gi, egd, bleeding, cbc, prbc, stool, unit, shift, hgb \n\nHistory taking \n84100007 \nhistory, YEAR, htn, who, chronic, presents, disease, past, pmh, year \n\nHome health aide \nservice assessment \n\n385780008 \nindependent, subscriber, assistance, address, home, services, name, functional, prior, \nprimary \n\nIndigestion \n162031009 \nmaalox, pain, indigestion, stomach, reflux, heartburn, iron, simethicone, omeprazole, \nmd \n\nInfection control procedure \n77248004 \ndoxycycline, washed, pain, tick, iv, bite, lyme, lvp, analgesia, cat \n\nInforming doctor \n304562007 \nresponding, clinician, bipap, paged, iv, md, access, rn, aware, notified \n\nApplied Clinical Informatics Vol. 10 No. 5/2019 \n\n\nTable 3 (\n3Continued) applied, mepilex, coccyx, area, cream, barrier, buttocks, noted, red Prevention of deep vein thrombosis 439993001 pfo, filter, ivs, ivc, all, dvt, pe, iv, shift, procedures Procedure aiding diagnosis 165167006 scan, pet, biopsy, mass, ct, pain, npo, onc, bx, throat Procedure on cardiovascular system 118672003 completed, shift, cad, cabg, ccl, cath, transferred, ef, osh, htn Respiratory assessment 422834003 cough, productive, nebs, sats, sputum, ra, nc, ls, sob, prn Secondary malignant neoplastic disease 128462008 radiation, oncology, pain, ca, chemo, metastatic, mets, xrt, potential, cancer Seizure precautions 64461008 seizure, activity, noted, eeg, neuro, keppra, shift, precautions, seizures, event Smoking cessation therapy 710081004 smoker, smoking, patch, nicotine, former, quit, pain, cessation, security, floor vac, dressing, changed, drainage, suction, foot, mmhg, change, intact Abbreviation: SNOMED CT: Systematized Nomenclature of Medicine-Clinical Terms. Note: Multiple stable topics could be assigned to the same concept. Such stable topics are presented sequentially. Applied Clinical Informatics Vol. 10 No. 5/2019Concept \nSNOMED CT ID \nTop-10 words \n\nInsertion of catheter into blood vessel \n429446009 \ncm, date_placeholder, picc, time_placeholder, procedure, lumen, dressing, insertion, \nplacement, catheter \n\nLanguage barrier \n422693009 \nspeaking, spanish, english, able, needs, only, ipop, primarily, make, known \n\nLeft ventricular assist device present \n723438005 \nlvad, vad, flows, stable, alarms, date_placeholder, vt, dressing, changed, mg \n\nLegal guardian \n58626002 \nguardian, guardianship, court, wheelchair, hearing, eye, blind, bound, ck, baseline \n\nMeasuring output from thoracic drain \n72162008 \neffusion, pleural, chest, pericardial, drained, cxr, pigtail, pain, ct, thoracentesis \n\nMonitoring pain \n710995003 \ncont, monitor, pain, conts, iv, vss, po, amb, denies, effect \n\nNasogastric tube maintenance \n52260009 \ncc, ngt, npo, output, pain, iv, lws, brown, draining, abd \n\nNausea care management \n408882007 \nnausea, zofran, pain, effect, iv, vomiting, good, mg, po, emesis \n\nNeurological assessment \n225398001 \nneuro, speech, left, facial, weakness, commands, right, strengths, perrl, follows \n\nNeurological mental status determination \n392257007 \nstatus, mental, hospitalization, condition, adult, during, altered, infection, progressing, \nrespiratory \n\nNursing care coordination \n385777007 \nhome, discharge, cm, vna, services, care, met, referral, follow, team \n\nNursing evaluation of patient and report \n19681004 \ndid, him, about, stated, would, does, when, states, said, asked \n\nObservational assessment \n310813001 \npain, mg, iv, md, anxious, portacath, humalog, wbcs, shift, aware \n\nOxygen therapy \n57485005 \noxygen, liters, nc, up, sats, pick, sat, nasal, air, breath \n\nPacemaker care assessment \n410096008 \nppm, ep, pacemaker, pacer, placement, site, degree, block, stable, device \n\nPain control \n225782006 \nhip, mg, knee, pain, csm, tylenol, oxycodone, prn, pp, ice \n\nPain control \n225782006 \npain, mg, back, patch, po, prn, dilaudid, oxycodone, tylenol, colace \n\nPain control \n225782006 \npca, pain, dilaudid, limit, mg, iv, outlined, lockout, dose, use \n\nPain control \n225782006 \npain, spasms, spec, tylenol, valium, mg, motrin, back, ivig, iv \n\nPalliative care \n103735009 \nfamily, care, morphine, hospice, palliative, comfort, cmo, comfortable, meeting, \nbedside \n\nPatient discharge \n58000006 \ndc, private, np, mgh, am, epic, home, ip, dr, thurs \n\nPhysical examination \n5880005 \nsounds, denies, clear, pain, soft, lung, noted, abdomen, sob, bs \n\nPhysical examination \n5880005 \nspo, temp, wt, oral, lb, nc, bp, shift, pulse, pain \n\nPressure ulcer care \n225357008 \nskin, Stoma assessment \n225192007 \nostomy, stoma, ileostomy, date_placeholder, intact, wound, pouch, colostomy, output, \nappliance \n\nTracheostomy care \n385858000 \ntrach, secretions, tf, tube, via, peg, place, shift, thick, suctioning \n\nUrinary catheter \n20568009 \nurine, foley, clots, pain, stent, urology, pink, colored, hematuria, catheter \n\nWeaning from mechanically \nassisted ventilation \n\n243174005 \nremains, off, mcg, propofol, weaned, map, goal, min, gtt, levo \n\nWound care \n225358003 \nwound, \n\nTable 4\n4Covariates violating the proportionality assumption from the vital signs-only and the concepts-only extended Cox models Applied Clinical Informatics Vol. 10 No. 5/2019Model \nCovariate \nCorrelation \ncoefficient \n\np-Value \n\nVital signs-only Heart rate \n-0.13694 \n3.09E-07 \n\nArterial blood \npressure systolic \n\n0.145736 \n0.000214 \n\nArterial blood \npressure diastolic \n\n-0.11664 \n0.010001 \n\nConcepts-only \nClose observation -0.06205 \n0.036023 \n\nCutaneous \nhypersensitivity \n\n-0.05408 \n0.024085 \n\nLegal guardian \n-0.09688 \n0.043812 \n\nTracheostomy \ncare \n\n-0.15304 \n2.65E-05 \n\nWound care \n-0.08908 \n0.014788 \n\n\nApplied Clinical Informatics Vol. 10 No. 5/2019 Unsupervised Learning of RR-Related Nursing Topics Korach et al.\nApplied Clinical Informatics Vol. 10 No. 5/2019\nFig. 4 (Continued)Applied Clinical Informatics Vol. 10 No. 5/2019\nConflict of InterestNone declared.\nRapidresponse systems as a patient safety strategy: a systematic review. B D Winters, S J Weaver, E R Pfoh, T Yang, J C Pham, S M Dy, Ann Intern Med. 1585Pt 2Winters BD, Weaver SJ, Pfoh ER, Yang T, Pham JC, Dy SM. Rapid- response systems as a patient safety strategy: a systematic review. Ann Intern Med 2013;158(5 Pt 2):417-425\n\nEffectiveness of rapid response teams on rates of in-hospital cardiopulmonary arrest and mortality: a systematic review and meta-analysis. R S Solomon, G S Corwin, D C Barclay, S F Quddusi, M D Dannenberg, J Hosp Med. 1106Solomon RS, Corwin GS, Barclay DC, Quddusi SF, Dannenberg MD. Effectiveness of rapid response teams on rates of in-hospital cardiopulmonary arrest and mortality: a systematic review and meta-analysis. J Hosp Med 2016;11(06):438-445\n\nActivation of a medical emergency team using an electronic medical recording-based screening system Ã. J W Huh, C-M Lim, Y Koh, Crit Care Med. 4204Huh JW, Lim C-M, Koh Y, et al. Activation of a medical emergency team using an electronic medical recording-based screening system Ã . Crit Care Med 2014;42(04):801-808\n\nA randomized trial of real-time automated clinical deterioration alerts sent to a rapid response team. M H Kollef, Y Chen, K Heard, J Hosp Med. 907Kollef MH, Chen Y, Heard K, et al. A randomized trial of real-time automated clinical deterioration alerts sent to a rapid response team. J Hosp Med 2014;9(07):424-429\n\nRelationship between nursing documentation and patients' mortality. S A Collins, K Cato, D Albers, Am J Crit Care. 2204Collins SA, Cato K, Albers D, et al. Relationship between nursing documentation and patients' mortality. Am J Crit Care 2013;22 (04):306-313\n\nProspective controlled trial of effect of medical emergency team on postoperative morbidity and mortality rates. R Bellomo, D Goldsmith, S Uchino, Crit Care Med. 3204Bellomo R, Goldsmith D, Uchino S, et al. Prospective controlled trial of effect of medical emergency team on postoperative morbidity and mortality rates. Crit Care Med 2004;32(04): 916-921\n\nMERIT study investigators. Introduction of the medical emergency team (MET) system: a cluster-randomised controlled trial. K Hillman, J Chen, M Cretikos, Lancet. 3659477Hillman K, Chen J, Cretikos M, et al; MERIT study investigators. Introduction of the medical emergency team (MET) system: a cluster-randomised controlled trial. Lancet 2005;365(9477): 2091-2097\n\nThe Medical Emergency Team: 12 month analysis of reasons for activation, immediate outcome and not-for-resuscitation orders. M J Parr, J H Hadfield, A Flabouris, G Bishop, K Hillman, Resuscitation. 5001Parr MJ, Hadfield JH, Flabouris A, Bishop G, Hillman K. The Medical Emergency Team: 12 month analysis of reasons for activation, immediate outcome and not-for-resuscitation orders. Resuscita- tion 2001;50(01):39-44\n\nIncidence, location and reasons for avoidable in-hospital cardiac arrest in a district general hospital. T J Hodgetts, G Kenward, I Vlackonikolis, Resuscitation. 5402Hodgetts TJ, Kenward G, Vlackonikolis I, et al. Incidence, location and reasons for avoidable in-hospital cardiac arrest in a district general hospital. Resuscitation 2002;54(02):115-123\n\nStatistical topic models for multi-label document classification. T N Rubin, A Chambers, P Smyth, M Steyvers, Mach Learn. 8801Rubin TN, Chambers A, Smyth P, Steyvers M. Statistical topic models for multi-label document classification. Mach Learn 2012; 88(01):157-208\n\nDevelopment and validation of a deep learning algorithm for mortality prediction in selecting patients with dementia for earlier palliative care interventions. L Wang, L Sha, J R Lakin, JAMA Netw Open. 207196972Wang L, Sha L, Lakin JR, et al. Development and validation of a deep learning algorithm for mortality prediction in selecting patients with dementia for earlier palliative care interventions. JAMA Netw Open 2019;2(07):e196972\n\nLatent Dirichlet allocation. D M Blei, A Y Ng, M I Jordan, J Mach Learn Res. 3Blei DM, Ng AY, Jordan MI. Latent Dirichlet allocation. J Mach Learn Res 2003;3(Jan):993-1022\n\nRisk prediction for chronic kidney disease progression using heterogeneous electronic health record data and time series analysis. A Perotte, R Ranganath, J S Hirsch, D Blei, N Elhadad, J Am Med Inform Assoc. 2204Perotte A, Ranganath R, Hirsch JS, Blei D, Elhadad N. Risk predic- tion for chronic kidney disease progression using heterogeneous electronic health record data and time series analysis. J Am Med Inform Assoc 2015;22(04):872-880\n\nDisease Trajectories and End-of-Life Care for Dementias: Latent Topic Modeling and Trend Analysis Using Clinical Notes. ResearchGate. Available atDisease Trajectories and End-of-Life Care for Dementias: Latent Topic Modeling and Trend Analysis Using Clinical Notes. ResearchGate. Available at: https://www.researchgate.net/publication/328899169_\n\n. Disease_Trajectories_And_End-Of-Life_Care_For_Dementias_Latent_, Topic_Modeling_And_Trend_Analysis_Using_Clinical_Notes, Accessed December. 18Disease_Trajectories_and_End-of-Life_Care_for_Dementias_Latent_ Topic_Modeling_and_Trend_Analysis_Using_Clinical_Notes. Accessed December 18, 2018\n\nIdentification and use of frailty indicators from text to examine associations with clinical outcomes among patients with heart failure. Y Shao, A F Mohanty, A Ahmed, AMIA Annu Symp Proc. 2016Shao Y, Mohanty AF, Ahmed A, et al. Identification and use of frailty indicators from text to examine associations with clinical outcomes among patients with heart failure. AMIA Annu Symp Proc 2017;2016:1110-1118\n\nThe Stanford CoreNLP Natural Language Processing Toolkit. C D Manning, M Surdeanu, J Bauer, J Finkel, S J Bethard, D Mcclosky, Association for Computational Linguistics (ACL) System Demonstrations. 2014gensim: topic modelling for humansManning CD, Surdeanu M, Bauer J, Finkel J, Bethard SJ, McClosky D. The Stanford CoreNLP Natural Language Processing Toolkit. In: Association for Computational Linguistics (ACL) System Demon- strations; 2014:55-60. Available at: http://www.aclweb.org/an- thology/P/P14/P14-5010. Accessed November 25, 2019 17 gensim: topic modelling for humans. Available at: https://radi- mrehurek.com/gensim/. Accessed March 4, 2018\n\nImportance of events per independent variable in proportional hazards analysis. J Concato, P Peduzzi, T R Holford, A R Feinstein, Concato J, Peduzzi P, Holford TR, Feinstein AR. Importance of events per independent variable in proportional hazards analysis.\n\ngoals, and general strategy. I Background, J Clin Epidemiol. 4812I. Background, goals, and general strategy. J Clin Epidemiol 1995; 48(12):1495-1501\n\nImportance of events per independent variable in proportional hazards regression analysis. II. Accuracy and precision of regression estimates. P Peduzzi, J Concato, A R Feinstein, T R Holford, J Clin Epidemiol. 4812Peduzzi P, Concato J, Feinstein AR, Holford TR. Importance of events per independent variable in proportional hazards regres- sion analysis. II. Accuracy and precision of regression estimates. J Clin Epidemiol 1995;48(12):1503-1510\n\nRepeated assessment of risk factors in survival analysis. P K Andersen, Stat Methods Med Res. 103Andersen PK. Repeated assessment of risk factors in survival analysis. Stat Methods Med Res 1992;1(03):297-315\n", "annotations": {"author": "[{\"end\":308,\"start\":124},{\"end\":393,\"start\":309},{\"end\":739,\"start\":394},{\"end\":897,\"start\":740},{\"end\":988,\"start\":898},{\"end\":1147,\"start\":989},{\"end\":1300,\"start\":1148},{\"end\":1459,\"start\":1301},{\"end\":1615,\"start\":1460},{\"end\":1697,\"start\":1616},{\"end\":1851,\"start\":1698},{\"end\":1940,\"start\":1852},{\"end\":2090,\"start\":1941}]", "publisher": null, "author_last_name": "[{\"end\":141,\"start\":135},{\"end\":323,\"start\":319},{\"end\":409,\"start\":402},{\"end\":755,\"start\":751},{\"end\":918,\"start\":910},{\"end\":1005,\"start\":1000},{\"end\":1158,\"start\":1154},{\"end\":1317,\"start\":1310},{\"end\":1473,\"start\":1467},{\"end\":1627,\"start\":1624},{\"end\":1709,\"start\":1704},{\"end\":1870,\"start\":1862},{\"end\":1948,\"start\":1944}]", "author_first_name": "[{\"end\":130,\"start\":124},{\"end\":134,\"start\":131},{\"end\":316,\"start\":309},{\"end\":318,\"start\":317},{\"end\":399,\"start\":394},{\"end\":401,\"start\":400},{\"end\":743,\"start\":740},{\"end\":750,\"start\":744},{\"end\":909,\"start\":898},{\"end\":997,\"start\":989},{\"end\":999,\"start\":998},{\"end\":1153,\"start\":1148},{\"end\":1307,\"start\":1301},{\"end\":1309,\"start\":1308},{\"end\":1464,\"start\":1460},{\"end\":1466,\"start\":1465},{\"end\":1623,\"start\":1616},{\"end\":1703,\"start\":1698},{\"end\":1859,\"start\":1852},{\"end\":1861,\"start\":1860},{\"end\":1943,\"start\":1941}]", "author_affiliation": "[{\"end\":307,\"start\":168},{\"end\":392,\"start\":325},{\"end\":478,\"start\":411},{\"end\":738,\"start\":480},{\"end\":896,\"start\":757},{\"end\":987,\"start\":920},{\"end\":1146,\"start\":1007},{\"end\":1299,\"start\":1160},{\"end\":1458,\"start\":1319},{\"end\":1614,\"start\":1475},{\"end\":1696,\"start\":1629},{\"end\":1850,\"start\":1711},{\"end\":1939,\"start\":1872},{\"end\":2089,\"start\":1950}]", "title": "[{\"end\":121,\"start\":1},{\"end\":2211,\"start\":2091}]", "venue": null, "abstract": "[{\"end\":4523,\"start\":2459}]", "bib_ref": "[{\"attributes\":{\"ref_id\":\"b0\"},\"end\":5192,\"start\":5190},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":5193,\"start\":5192},{\"attributes\":{\"ref_id\":\"b2\"},\"end\":5418,\"start\":5416},{\"attributes\":{\"ref_id\":\"b3\"},\"end\":5419,\"start\":5418},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":5695,\"start\":5694},{\"attributes\":{\"ref_id\":\"b5\"},\"end\":5954,\"start\":5952},{\"attributes\":{\"ref_id\":\"b6\"},\"end\":5955,\"start\":5954},{\"attributes\":{\"ref_id\":\"b7\"},\"end\":6063,\"start\":6062},{\"attributes\":{\"ref_id\":\"b8\"},\"end\":6330,\"start\":6329},{\"attributes\":{\"ref_id\":\"b7\"},\"end\":6500,\"start\":6499},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":7895,\"start\":7892},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":7897,\"start\":7895},{\"attributes\":{\"ref_id\":\"b11\"},\"end\":8894,\"start\":8892},{\"attributes\":{\"ref_id\":\"b12\"},\"end\":9384,\"start\":9380},{\"attributes\":{\"ref_id\":\"b13\"},\"end\":9388,\"start\":9384},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":9392,\"start\":9388},{\"attributes\":{\"ref_id\":\"b16\"},\"end\":14436,\"start\":14434},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":15146,\"start\":15144},{\"attributes\":{\"ref_id\":\"b17\"},\"end\":17223,\"start\":17220},{\"attributes\":{\"ref_id\":\"b19\"},\"end\":17225,\"start\":17223},{\"attributes\":{\"ref_id\":\"b20\"},\"end\":20180,\"start\":20178},{\"attributes\":{\"ref_id\":\"b0\"},\"end\":20564,\"start\":20561},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":20917,\"start\":20914}]", "figure": "[{\"attributes\":{\"id\":\"fig_0\"},\"end\":30574,\"start\":30553},{\"attributes\":{\"id\":\"fig_1\"},\"end\":31013,\"start\":30575},{\"attributes\":{\"id\":\"tab_0\",\"type\":\"table\"},\"end\":31489,\"start\":31014},{\"attributes\":{\"id\":\"tab_1\",\"type\":\"table\"},\"end\":32051,\"start\":31490},{\"attributes\":{\"id\":\"tab_2\",\"type\":\"table\"},\"end\":32696,\"start\":32052},{\"attributes\":{\"id\":\"tab_3\",\"type\":\"table\"},\"end\":33024,\"start\":32697},{\"attributes\":{\"id\":\"tab_4\",\"type\":\"table\"},\"end\":38066,\"start\":33025},{\"attributes\":{\"id\":\"tab_5\",\"type\":\"table\"},\"end\":42302,\"start\":38067},{\"attributes\":{\"id\":\"tab_6\",\"type\":\"table\"},\"end\":42917,\"start\":42303}]", "paragraph": "[{\"end\":7456,\"start\":4554},{\"end\":9832,\"start\":7458},{\"end\":9918,\"start\":9844},{\"end\":10165,\"start\":9957},{\"end\":10695,\"start\":10167},{\"end\":10894,\"start\":10697},{\"end\":11973,\"start\":10914},{\"end\":12410,\"start\":11975},{\"end\":12945,\"start\":12430},{\"end\":14310,\"start\":12969},{\"end\":14699,\"start\":14348},{\"end\":14910,\"start\":14724},{\"end\":15982,\"start\":14934},{\"end\":18806,\"start\":16009},{\"end\":19279,\"start\":18823},{\"end\":20020,\"start\":19327},{\"end\":21509,\"start\":20042},{\"end\":22219,\"start\":21511},{\"end\":22642,\"start\":22221},{\"end\":22658,\"start\":22654},{\"end\":22935,\"start\":22692},{\"end\":23184,\"start\":22937},{\"end\":23992,\"start\":23206},{\"end\":27036,\"start\":24007},{\"end\":27879,\"start\":27038},{\"end\":28186,\"start\":27894},{\"end\":28357,\"start\":28219},{\"end\":29003,\"start\":28359},{\"end\":29438,\"start\":29005},{\"end\":30420,\"start\":29440},{\"end\":30552,\"start\":30464}]", "formula": null, "table_ref": null, "section_header": "[{\"end\":4552,\"start\":4525},{\"end\":9842,\"start\":9835},{\"end\":9936,\"start\":9921},{\"end\":9955,\"start\":9939},{\"end\":10912,\"start\":10897},{\"end\":12428,\"start\":12413},{\"end\":12967,\"start\":12948},{\"end\":14327,\"start\":14313},{\"end\":14346,\"start\":14330},{\"end\":14722,\"start\":14702},{\"end\":14932,\"start\":14913},{\"end\":16007,\"start\":15985},{\"end\":18821,\"start\":18809},{\"end\":19325,\"start\":19282},{\"end\":20040,\"start\":20023},{\"end\":22652,\"start\":22645},{\"end\":22690,\"start\":22661},{\"end\":23204,\"start\":23187},{\"end\":24005,\"start\":23995},{\"end\":27892,\"start\":27882},{\"end\":28217,\"start\":28189},{\"end\":30462,\"start\":30423},{\"end\":30562,\"start\":30554},{\"end\":30583,\"start\":30576},{\"end\":31022,\"start\":31015},{\"end\":32705,\"start\":32698},{\"end\":33033,\"start\":33026},{\"end\":38077,\"start\":38068},{\"end\":42311,\"start\":42304}]", "table": "[{\"end\":31489,\"start\":31460},{\"end\":33024,\"start\":32739},{\"end\":38066,\"start\":33097},{\"end\":42302,\"start\":39227},{\"end\":42917,\"start\":42480}]", "figure_caption": "[{\"end\":30574,\"start\":30564},{\"end\":31013,\"start\":30584},{\"end\":31460,\"start\":31024},{\"end\":32051,\"start\":31492},{\"end\":32696,\"start\":32054},{\"end\":32739,\"start\":32707},{\"end\":33097,\"start\":33035},{\"end\":39227,\"start\":38079},{\"end\":42480,\"start\":42313}]", "figure_ref": "[{\"end\":13296,\"start\":13290},{\"end\":13705,\"start\":13699},{\"end\":20342,\"start\":20336},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":26772,\"start\":26766}]", "bib_author_first_name": "[{\"end\":43254,\"start\":43253},{\"end\":43256,\"start\":43255},{\"end\":43267,\"start\":43266},{\"end\":43269,\"start\":43268},{\"end\":43279,\"start\":43278},{\"end\":43281,\"start\":43280},{\"end\":43289,\"start\":43288},{\"end\":43297,\"start\":43296},{\"end\":43299,\"start\":43298},{\"end\":43307,\"start\":43306},{\"end\":43309,\"start\":43308},{\"end\":43650,\"start\":43649},{\"end\":43652,\"start\":43651},{\"end\":43663,\"start\":43662},{\"end\":43665,\"start\":43664},{\"end\":43675,\"start\":43674},{\"end\":43677,\"start\":43676},{\"end\":43688,\"start\":43687},{\"end\":43690,\"start\":43689},{\"end\":43701,\"start\":43700},{\"end\":43703,\"start\":43702},{\"end\":44069,\"start\":44068},{\"end\":44071,\"start\":44070},{\"end\":44080,\"start\":44077},{\"end\":44087,\"start\":44086},{\"end\":44386,\"start\":44385},{\"end\":44388,\"start\":44387},{\"end\":44398,\"start\":44397},{\"end\":44406,\"start\":44405},{\"end\":44667,\"start\":44666},{\"end\":44669,\"start\":44668},{\"end\":44680,\"start\":44679},{\"end\":44688,\"start\":44687},{\"end\":44973,\"start\":44972},{\"end\":44984,\"start\":44983},{\"end\":44997,\"start\":44996},{\"end\":45339,\"start\":45338},{\"end\":45350,\"start\":45349},{\"end\":45358,\"start\":45357},{\"end\":45705,\"start\":45704},{\"end\":45707,\"start\":45706},{\"end\":45715,\"start\":45714},{\"end\":45717,\"start\":45716},{\"end\":45729,\"start\":45728},{\"end\":45742,\"start\":45741},{\"end\":45752,\"start\":45751},{\"end\":46103,\"start\":46102},{\"end\":46105,\"start\":46104},{\"end\":46117,\"start\":46116},{\"end\":46128,\"start\":46127},{\"end\":46418,\"start\":46417},{\"end\":46420,\"start\":46419},{\"end\":46429,\"start\":46428},{\"end\":46441,\"start\":46440},{\"end\":46450,\"start\":46449},{\"end\":46780,\"start\":46779},{\"end\":46788,\"start\":46787},{\"end\":46795,\"start\":46794},{\"end\":46797,\"start\":46796},{\"end\":47087,\"start\":47086},{\"end\":47089,\"start\":47088},{\"end\":47097,\"start\":47096},{\"end\":47099,\"start\":47098},{\"end\":47105,\"start\":47104},{\"end\":47107,\"start\":47106},{\"end\":47362,\"start\":47361},{\"end\":47373,\"start\":47372},{\"end\":47386,\"start\":47385},{\"end\":47388,\"start\":47387},{\"end\":47398,\"start\":47397},{\"end\":47406,\"start\":47405},{\"end\":48450,\"start\":48449},{\"end\":48458,\"start\":48457},{\"end\":48460,\"start\":48459},{\"end\":48471,\"start\":48470},{\"end\":48777,\"start\":48776},{\"end\":48779,\"start\":48778},{\"end\":48790,\"start\":48789},{\"end\":48802,\"start\":48801},{\"end\":48811,\"start\":48810},{\"end\":48821,\"start\":48820},{\"end\":48823,\"start\":48822},{\"end\":48834,\"start\":48833},{\"end\":49453,\"start\":49452},{\"end\":49464,\"start\":49463},{\"end\":49475,\"start\":49474},{\"end\":49477,\"start\":49476},{\"end\":49488,\"start\":49487},{\"end\":49490,\"start\":49489},{\"end\":49661,\"start\":49660},{\"end\":49925,\"start\":49924},{\"end\":49936,\"start\":49935},{\"end\":49947,\"start\":49946},{\"end\":49949,\"start\":49948},{\"end\":49962,\"start\":49961},{\"end\":49964,\"start\":49963},{\"end\":50288,\"start\":50287},{\"end\":50290,\"start\":50289}]", "bib_author_last_name": "[{\"end\":43264,\"start\":43257},{\"end\":43276,\"start\":43270},{\"end\":43286,\"start\":43282},{\"end\":43294,\"start\":43290},{\"end\":43304,\"start\":43300},{\"end\":43312,\"start\":43310},{\"end\":43660,\"start\":43653},{\"end\":43672,\"start\":43666},{\"end\":43685,\"start\":43678},{\"end\":43698,\"start\":43691},{\"end\":43714,\"start\":43704},{\"end\":44075,\"start\":44072},{\"end\":44084,\"start\":44081},{\"end\":44091,\"start\":44088},{\"end\":44395,\"start\":44389},{\"end\":44403,\"start\":44399},{\"end\":44412,\"start\":44407},{\"end\":44677,\"start\":44670},{\"end\":44685,\"start\":44681},{\"end\":44695,\"start\":44689},{\"end\":44981,\"start\":44974},{\"end\":44994,\"start\":44985},{\"end\":45004,\"start\":44998},{\"end\":45347,\"start\":45340},{\"end\":45355,\"start\":45351},{\"end\":45367,\"start\":45359},{\"end\":45712,\"start\":45708},{\"end\":45726,\"start\":45718},{\"end\":45739,\"start\":45730},{\"end\":45749,\"start\":45743},{\"end\":45760,\"start\":45753},{\"end\":46114,\"start\":46106},{\"end\":46125,\"start\":46118},{\"end\":46142,\"start\":46129},{\"end\":46426,\"start\":46421},{\"end\":46438,\"start\":46430},{\"end\":46447,\"start\":46442},{\"end\":46459,\"start\":46451},{\"end\":46785,\"start\":46781},{\"end\":46792,\"start\":46789},{\"end\":46803,\"start\":46798},{\"end\":47094,\"start\":47090},{\"end\":47102,\"start\":47100},{\"end\":47114,\"start\":47108},{\"end\":47370,\"start\":47363},{\"end\":47383,\"start\":47374},{\"end\":47395,\"start\":47389},{\"end\":47403,\"start\":47399},{\"end\":47414,\"start\":47407},{\"end\":48085,\"start\":48022},{\"end\":48141,\"start\":48087},{\"end\":48455,\"start\":48451},{\"end\":48468,\"start\":48461},{\"end\":48477,\"start\":48472},{\"end\":48787,\"start\":48780},{\"end\":48799,\"start\":48791},{\"end\":48808,\"start\":48803},{\"end\":48818,\"start\":48812},{\"end\":48831,\"start\":48824},{\"end\":48843,\"start\":48835},{\"end\":49461,\"start\":49454},{\"end\":49472,\"start\":49465},{\"end\":49485,\"start\":49478},{\"end\":49500,\"start\":49491},{\"end\":49672,\"start\":49662},{\"end\":49933,\"start\":49926},{\"end\":49944,\"start\":49937},{\"end\":49959,\"start\":49950},{\"end\":49972,\"start\":49965},{\"end\":50299,\"start\":50291}]", "bib_entry": "[{\"attributes\":{\"id\":\"b0\"},\"end\":43508,\"start\":43180},{\"attributes\":{\"id\":\"b1\",\"matched_paper_id\":30562301},\"end\":43963,\"start\":43510},{\"attributes\":{\"id\":\"b2\",\"matched_paper_id\":21526311},\"end\":44280,\"start\":43965},{\"attributes\":{\"id\":\"b3\",\"matched_paper_id\":29535699},\"end\":44596,\"start\":44282},{\"attributes\":{\"id\":\"b4\",\"matched_paper_id\":13008073},\"end\":44857,\"start\":44598},{\"attributes\":{\"id\":\"b5\",\"matched_paper_id\":1207517},\"end\":45213,\"start\":44859},{\"attributes\":{\"id\":\"b6\"},\"end\":45577,\"start\":45215},{\"attributes\":{\"id\":\"b7\",\"matched_paper_id\":11536309},\"end\":45995,\"start\":45579},{\"attributes\":{\"id\":\"b8\",\"matched_paper_id\":46515988},\"end\":46349,\"start\":45997},{\"attributes\":{\"id\":\"b9\",\"matched_paper_id\":8861540},\"end\":46617,\"start\":46351},{\"attributes\":{\"id\":\"b10\",\"matched_paper_id\":195891898},\"end\":47055,\"start\":46619},{\"attributes\":{\"id\":\"b11\",\"matched_paper_id\":3177797},\"end\":47228,\"start\":47057},{\"attributes\":{\"id\":\"b12\",\"matched_paper_id\":13514714},\"end\":47671,\"start\":47230},{\"attributes\":{\"id\":\"b13\"},\"end\":48018,\"start\":47673},{\"attributes\":{\"id\":\"b14\"},\"end\":48310,\"start\":48020},{\"attributes\":{\"id\":\"b15\",\"matched_paper_id\":6909600},\"end\":48716,\"start\":48312},{\"attributes\":{\"id\":\"b16\",\"matched_paper_id\":14068874},\"end\":49370,\"start\":48718},{\"attributes\":{\"id\":\"b17\"},\"end\":49629,\"start\":49372},{\"attributes\":{\"id\":\"b18\"},\"end\":49779,\"start\":49631},{\"attributes\":{\"id\":\"b19\",\"matched_paper_id\":20308005},\"end\":50227,\"start\":49781},{\"attributes\":{\"id\":\"b20\",\"matched_paper_id\":45333492},\"end\":50436,\"start\":50229}]", "bib_title": "[{\"end\":43251,\"start\":43180},{\"end\":43647,\"start\":43510},{\"end\":44066,\"start\":43965},{\"end\":44383,\"start\":44282},{\"end\":44664,\"start\":44598},{\"end\":44970,\"start\":44859},{\"end\":45336,\"start\":45215},{\"end\":45702,\"start\":45579},{\"end\":46100,\"start\":45997},{\"end\":46415,\"start\":46351},{\"end\":46777,\"start\":46619},{\"end\":47084,\"start\":47057},{\"end\":47359,\"start\":47230},{\"end\":48447,\"start\":48312},{\"end\":48774,\"start\":48718},{\"end\":49658,\"start\":49631},{\"end\":49922,\"start\":49781},{\"end\":50285,\"start\":50229}]", "bib_author": "[{\"end\":43266,\"start\":43253},{\"end\":43278,\"start\":43266},{\"end\":43288,\"start\":43278},{\"end\":43296,\"start\":43288},{\"end\":43306,\"start\":43296},{\"end\":43314,\"start\":43306},{\"end\":43662,\"start\":43649},{\"end\":43674,\"start\":43662},{\"end\":43687,\"start\":43674},{\"end\":43700,\"start\":43687},{\"end\":43716,\"start\":43700},{\"end\":44077,\"start\":44068},{\"end\":44086,\"start\":44077},{\"end\":44093,\"start\":44086},{\"end\":44397,\"start\":44385},{\"end\":44405,\"start\":44397},{\"end\":44414,\"start\":44405},{\"end\":44679,\"start\":44666},{\"end\":44687,\"start\":44679},{\"end\":44697,\"start\":44687},{\"end\":44983,\"start\":44972},{\"end\":44996,\"start\":44983},{\"end\":45006,\"start\":44996},{\"end\":45349,\"start\":45338},{\"end\":45357,\"start\":45349},{\"end\":45369,\"start\":45357},{\"end\":45714,\"start\":45704},{\"end\":45728,\"start\":45714},{\"end\":45741,\"start\":45728},{\"end\":45751,\"start\":45741},{\"end\":45762,\"start\":45751},{\"end\":46116,\"start\":46102},{\"end\":46127,\"start\":46116},{\"end\":46144,\"start\":46127},{\"end\":46428,\"start\":46417},{\"end\":46440,\"start\":46428},{\"end\":46449,\"start\":46440},{\"end\":46461,\"start\":46449},{\"end\":46787,\"start\":46779},{\"end\":46794,\"start\":46787},{\"end\":46805,\"start\":46794},{\"end\":47096,\"start\":47086},{\"end\":47104,\"start\":47096},{\"end\":47116,\"start\":47104},{\"end\":47372,\"start\":47361},{\"end\":47385,\"start\":47372},{\"end\":47397,\"start\":47385},{\"end\":47405,\"start\":47397},{\"end\":47416,\"start\":47405},{\"end\":48087,\"start\":48022},{\"end\":48143,\"start\":48087},{\"end\":48457,\"start\":48449},{\"end\":48470,\"start\":48457},{\"end\":48479,\"start\":48470},{\"end\":48789,\"start\":48776},{\"end\":48801,\"start\":48789},{\"end\":48810,\"start\":48801},{\"end\":48820,\"start\":48810},{\"end\":48833,\"start\":48820},{\"end\":48845,\"start\":48833},{\"end\":49463,\"start\":49452},{\"end\":49474,\"start\":49463},{\"end\":49487,\"start\":49474},{\"end\":49502,\"start\":49487},{\"end\":49674,\"start\":49660},{\"end\":49935,\"start\":49924},{\"end\":49946,\"start\":49935},{\"end\":49961,\"start\":49946},{\"end\":49974,\"start\":49961},{\"end\":50301,\"start\":50287}]", "bib_venue": "[{\"end\":43328,\"start\":43314},{\"end\":43726,\"start\":43716},{\"end\":44106,\"start\":44093},{\"end\":44424,\"start\":44414},{\"end\":44711,\"start\":44697},{\"end\":45019,\"start\":45006},{\"end\":45375,\"start\":45369},{\"end\":45775,\"start\":45762},{\"end\":46157,\"start\":46144},{\"end\":46471,\"start\":46461},{\"end\":46819,\"start\":46805},{\"end\":47132,\"start\":47116},{\"end\":47437,\"start\":47416},{\"end\":47791,\"start\":47673},{\"end\":48160,\"start\":48143},{\"end\":48498,\"start\":48479},{\"end\":48914,\"start\":48845},{\"end\":49450,\"start\":49372},{\"end\":49690,\"start\":49674},{\"end\":49990,\"start\":49974},{\"end\":50321,\"start\":50301}]"}}}, "year": 2023, "month": 12, "day": 17}