{"id": 209509165, "updated": "2022-02-01 11:22:35.374", "metadata": {"title": "Use of natural language processing to improve predictive models for imaging utilization in children presenting to the emergency department", "authors": "[{\"middle\":[],\"last\":\"Zhang\",\"first\":\"Xingyu\"},{\"middle\":[\"Fernanda\"],\"last\":\"Bellolio\",\"first\":\"M.\"},{\"middle\":[],\"last\":\"Medrano-Gracia\",\"first\":\"Pau\"},{\"middle\":[],\"last\":\"Werys\",\"first\":\"Konrad\"},{\"middle\":[],\"last\":\"Yang\",\"first\":\"Sheng\"},{\"middle\":[],\"last\":\"Mahajan\",\"first\":\"Prashant\"}]", "venue": "BMC Medical Informatics and Decision Making", "journal": "BMC Medical Informatics and Decision Making", "publication_date": {"year": 2019, "month": null, "day": null}, "abstract": "Objective To examine the association between the medical imaging utilization and information related to patients’ socioeconomic, demographic and clinical factors during the patients’ ED visits; and to develop predictive models using these associated factors including natural language elements to predict the medical imaging utilization at pediatric ED. Methods Pediatric patients’ data from the 2012–2016 United States National Hospital Ambulatory Medical Care Survey was included to build the models to predict the use of imaging in children presenting to the ED. Multivariable logistic regression models were built with structured variables such as temperature, heart rate, age, and unstructured variables such as reason for visit, free text nursing notes and combined data available at triage. NLP techniques were used to extract information from the unstructured data. Results Of the 27,665 pediatric ED visits included in the study, 8394 (30.3%) received medical imaging in the ED, including 6922 (25.0%) who had an X-ray and 1367 (4.9%) who had a computed tomography (CT) scan. In the predictive model including only structured variables, the c-statistic was 0.71 (95% CI: 0.70–0.71) for any imaging use, 0.69 (95% CI: 0.68–0.70) for X-ray, and 0.77 (95% CI: 0.76–0.78) for CT. Models including only unstructured information had c-statistics of 0.81 (95% CI: 0.81–0.82) for any imaging use, 0.82 (95% CI: 0.82–0.83) for X-ray, and 0.85 (95% CI: 0.83–0.86) for CT scans. When both structured variables and free text variables were included, the c-statistics reached 0.82 (95% CI: 0.82–0.83) for any imaging use, 0.83 (95% CI: 0.83–0.84) for X-ray, and 0.87 (95% CI: 0.86–0.88) for CT. Conclusions Both CT and X-rays are commonly used in the pediatric ED with one third of the visits receiving at least one. Patients’ socioeconomic, demographic and clinical factors presented at ED triage period were associated with the medical imaging utilization. Predictive models combining structured and unstructured variables available at triage performed better than models using structured or unstructured variables alone, suggesting the potential for use of NLP in determining resource utilization.", "fields_of_study": "[\"Medicine\"]", "external_ids": {"arxiv": null, "mag": "2997309037", "acl": null, "pubmed": "31888609", "pubmedcentral": "6937987", "dblp": "journals/midm/ZhangBMWYM19", "doi": "10.1186/s12911-019-1006-6"}}, "content": {"source": {"pdf_hash": "ac59e61f9c405d8e6e42b99bedf8ca0aff0f1d13", "pdf_src": "PubMedCentral", "pdf_uri": null, "oa_url_match": false, "oa_info": {"license": "CCBY", "open_access_url": "https://bmcmedinformdecismak.biomedcentral.com/track/pdf/10.1186/s12911-019-1006-6", "status": "GOLD"}}, "grobid": {"id": "6bd907df680685f88345186935df4c06f2c3b331", "type": "plain-text", "url": "s3://ai2-s2-pdf-extraction-prod/parse-results/s2orc_worker/ac59e61f9c405d8e6e42b99bedf8ca0aff0f1d13.txt", "contents": "\nUse of natural language processing to improve predictive models for imaging utilization in children presenting to the emergency department\n\n\nXingyu Zhang \nDepartment of Systems, Populations and Leadership\nUniversity of Michigan School of Nursing\nAnn ArborUSA\n\nM Fernanda Bellolio \nPau Medrano-Gracia \nKonrad Werys \nSheng Yang \nDepartment of Biostatistics\nSchool of Public Health\nNanjing Medical University\nNanjingChina\n\nPrashant Mahajan \nUse of natural language processing to improve predictive models for imaging utilization in children presenting to the emergency department\n10.1186/s12911-019-1006-6R E S E A R C H A R T I C L E Open AccessPediatric emergency departmentNatural language processingPredictive modelMedical imaging utilization\nObjective: To examine the association between the medical imaging utilization and information related to patients' socioeconomic, demographic and clinical factors during the patients' ED visits; and to develop predictive models using these associated factors including natural language elements to predict the medical imaging utilization at pediatric ED. Methods: Pediatric patients' data from the 2012-2016 United States National Hospital Ambulatory Medical Care Survey was included to build the models to predict the use of imaging in children presenting to the ED. Multivariable logistic regression models were built with structured variables such as temperature, heart rate, age, and unstructured variables such as reason for visit, free text nursing notes and combined data available at triage. NLP techniques were used to extract information from the unstructured data.Results: Of the 27,665 pediatric ED visits included in the study, 8394 (30.3%) received medical imaging in the ED, including 6922 (25.0%) who had an X-ray and 1367 (4.9%) who had a computed tomography (CT) scan. In the predictive model including only structured variables, the c-statistic was 0.71 (95% CI: 0.70-0.71) for any imaging use, 0.69 (95% CI: 0.68-0.70) for X-ray, and 0.77 (95% CI: 0.76-0.78) for CT. Models including only unstructured information had c-statistics of 0.81 (95% CI: 0.81-0.82) for any imaging use, 0.82 (95% CI: 0.82-0.83) for X-ray, and 0.85 (95% CI: 0.83-0.86) for CT scans. When both structured variables and free text variables were included, the cstatistics reached 0.82 (95% CI: 0.82-0.83) for any imaging use, 0.83 (95% CI: 0.83-0.84) for X-ray, and 0.87 (95% CI: 0.86-0.88) for CT.Conclusions: Both CT and X-rays are commonly used in the pediatric ED with one third of the visits receiving at least one. Patients' socioeconomic, demographic and clinical factors presented at ED triage period were associated with the medical imaging utilization. Predictive models combining structured and unstructured variables available at triage performed better than models using structured or unstructured variables alone, suggesting the potential for use of NLP in determining resource utilization.\n\nIntroduction\n\nMore than 25 million pediatric patients seek medical care in the Emergency Department (ED) each year in the United States, and the pediatric ED utilization continues to increase [1]. Emergency providers usually need to make quick and complex clinical decisions with limited information [2]. Clinical decision making in pediatric patients is complicated and time-consuming because of their unique physiologic and developmental differences [3,4]. Consequently, ED health outcomes of children differ as their pattern of illness and presenting symptoms vary with age [5,6].\n\nIn many instances clinical decision making in the ED involves ordering of laboratory tests (blood, urine tests etc.) and/or performance of imaging procedures (x-rays, ultrasound, computed tomography (CT) scans) in order to arrive at working diagnosis to initiate therapies or other interventions which in some instances are lifesaving [7]. However, use of imaging has a significant impact on emergency care delivery both in terms of appropriateness as well as the impact of such studies on patient throughput, which in turn impacts access to emergency care and overcrowding [8,9].\n\nPrevious studies have focused on improving the efficiency and accuracy of pediatric medical decisions during ED visits [10,11]. Utilization of predictive analytical techniques to more rapidly determine patient health outcomes among adult ED patients have proved useful [12]. However, few studies have focused on predicting resource utilization (e.g., medical imaging use) of pediatric ED patients [13]. In addition, unstructured data such as patient chief complaints often available at the time of patient visiting, and contains valuable information that can potentially enhance the prediction performance [14,15]. However, these data are not immediately useful and require extraction, cleaning, and aggregation [16]. Our previous work has revealed that the incorporation of unstructured clinical notes can increase predictive accuracy for adult hospital admission using natural language processing [12] .\n\nEarly and accurate prediction of the need for medical imaging in pediatric patients visiting the ED may assist in the planning and optimization of resources in the ED healthcare service. In the current study, we examined the association between the medical imaging utilization and information related to patients' socioeconomic, demographic and clinical factors during the pediatric patients' ED visits; and developed predictive models using these associated factors including natural language elements to predict the medical imaging utilization at pediatric ED.\n\n\nData and methods\n\nWe used standardized guidelines for the conduction and reporting of this study including the Guidelines for Developing and Reporting Machine Learning Predictive Models in Biomedical Research [17]. We performed a secondary data analysis on the 2012-2016 National Hospital Ambulatory Medical Care Survey ED Subfile (NHAMCS-ED) [18][19][20]. NHAMCS is a multistage, stratified probability sample of ED visits from 300 hospital-based EDs each year, which was randomly selected from about 1900 geographically defined areas across the United States, administered by the National Center for Health Statistics. Details of the survey methodology are available from the National Center for Health Statistics [19,20]. We included a total of 27,665 pediatric patients (≤18 years old) visits for analysis in the survey datasets from 2012 to 2016. This represents 161,340,000 ED visits on the national level including the patient visit weight.\n\nThe primary outcome variables for this study were performance of any diagnostic imaging (X-ray and/or CT), any X-Ray use, and CT scan during an ED visit. Ultrasound use was not included in the study as the frequency of ultrasound use was low in the NHAMCS-ED. Structured covariates included information routinely collected at the time of ED triage: sex, age category, race/ethnicity, type of residence, source of payment, arrival mode, arrival day and time, initial vital signs (body temperature, heart rate, respiratory rate, blood pressure, pulse oximetry), 5 point triage level (1 Immediate; 2 Emergent; 3 Urgent; 4 Semi Urgent; 5 Nonurgent), pain scale, 72 h revisit, comorbidities (cancer, cerebrovascular disease, chronic obstructive pulmonary disease (COPD), congestive heart failure, and HIV), whether the visit was related to an injury, poisoning, or adverse effect of medical treatment. Description analysis of these structured variables were performed among each medical imaging group, and the odds ratios of using any imaging, X-Ray and CT scan were estimated using logistic regression.\n\nUnstructured data included up to three reasons for visiting the ED, and three causes of injury recorded by the providers for each patient in the triage notes [21]. Natural Language Processing (NLP) techniques were used to extract the information from the unstructured data. Firstly, we conducted a text preprocessing step which included lemmatization (grouping word capitalization and derivations together), removal of numbers, punctuations, and stop words (e.g., 'and', 'are', 'the'), and tokenization (breaking the text into single words and word pairs). We extracted all the unigrams (single words) and bigrams (word pairs) from the free text data after preprocessing. Subsequently, the frequency of each tokenized word or word-pairs for each person or visit can be formed [22]. We finally removed sparse terms, i.e., those with a frequency lower than 99.9% of the overall population. The words or word-pairs with frequency less than 277 (1% of the total sample size 27,665) were removed. A total of 1209 words and word-pairs were identified after preprocessing the unstructured data.\n\nFor both structured data and the word (or word pairs) frequencies, principal component analysis (PCA) was used to decrease the dimension (or select the features) of the structured data and frequency table of tokenized words or word pairs. As is described in previous studies [12,23], the goal of PCA is to obtain a fewer number of new variables, or principal components from the word or word pairs to represent large number of words or word pairs, using a linear combination. These principal components account for the maximum original variance or information of those words or word pairs. The first components derive as much of the variance in the word or word pairs frequency as possible, with each succeeding principal components accounting for the largest possible remain variance. There principal components have no information overlap between each other, based on the linear orthogonal algorithm.\n\nLogistic regression models were used to predict the pediatric medical imaging utilization. We established three models to determine the predictive performance in identifying patients with any medical imaging use, X-Ray, or CT scan: (1) models with structured variables only; (2) models with unstructured data; (3) models with both structured and unstructured variables. Missing values were imputed with median of each corresponding variable. Ten-fold cross-validation was used to validate the performance of each model. Patients were randomly divided into 10 sets, and 9 of the 10 sets were used to train the models while the one left was used as the testing set. For each round of training, t-tests compared principal components' scores between outcome groups. Principal components with p < 0.05 were used to establish the logistic regression models' input variables.\n\nThe area under the receiver operating curve (AUC), or c-statistic, was recorded for each testing set. The cstatistic informs in a single numerical value about the overall diagnostic accuracy of the index test. The cstatistic ranges from 0.50 to 1.00, with higher values indicating better predictive models. Values above 0.80 indicate very good models, between 0.70 and 0.80 good models, and between 0.50 and 0.70 weak models. The average ROC curve was derived by comparing the prediction values from all 10 cross-validation testing sets. The AUCs from different models were compared using t-test. The probabilities of medical imaging use for each patient were calculated with this model. The best cutoff of the probabilities was determined by using the point on the ROC curve with the shortest distance to the upper left corner (where sensitivity = 1 and specificity = 1). The best cutoff of the probabilities for prediction and the corresponding sensitivity, specificity, and overall accuracy were recorded [24].\n\nWe performed a sensitivity analysis to predict the two major subtypes of the CT scan (abdomen/pelvis and head CT) using the same modelling strategies described above. The best cut-off of the probabilities, sensitivity, specificity, overall accuracy, and AUC were recorded. Basic data organization was done in SAS 9.4. The text analyses were performed in R 3.3.2. The modeling of logistic regression was performed in MATLAB R2016b.\n\n\nResults\n\nAmong the 27,665 ED patient visits from 2012 to 2016, 30.3% (8394/27,665) received a medical imaging, including 25.0% (n = 6922) who had an X-ray and 4.9% (n = 1367/27,665) who had a CT scan (Table 1). Male patients (31.6%) present higher imaging use than females (29.1%). Younger kids had lower proportion of receiving imaging than older (3.3% by < 1 year and 21.7% by 1-6 years, compared to 32.3% by 6-12 years and 41.4% by older than 12 years). Hispanic patients had lower imaging use (27.6%) than non-Hispanics (31.2%), and black patients presented lower imaging (26.8%) than white (32.9%) and Asian (29.4%). Patients with private insurance (36.4%) and Medicare (33.6%) had higher imaging use than patients with Medicaid (27.4%) and no insurance (29.3%). Patients with immediate or emergent triage (37.1%) and patients urgent or semi-urgent (39.2%) had higher use of imaging than non-urgent patients (25.9%). A number of 45.5% of patients with injury/ trauma received medical imaging, which is higher than patients with overdose/poisoning (13.9%), patients with adverse effect of medical treatment (20.3%), and patients with no injury/trauma, overdose/poisoning, or adverse effect of medical treatment (23.4%).\n\nThe crude and adjusted odds ratio of ED visits resulting in different types of medical imaging (vs. no medical imaging) for each variable using binary logistic regression are presented in Table 2. Adjusted analyses showed patients between 1 and 6 years and between 6 and 12 were 42 and 24% less likely to require any medical imaging than patients less than 1 year old, respectively (aOR: 0.58, 95% CI 0.47-0.72 and aOR: 0.76, 95% CI 0.60-0.96). Black patients were 12% less likely for any imaging use than white patients (aOR: 0.88, 95% CI 0.77-1.00). Compared to those with private insurance, patients with Medicaid were 18% less likely for any imaging use than patients with private insurance (aOR: 0.82, 95% CI 0.73-0.92). Compared to those with mild pain level, patients with moderate and very severe levels were 2.15 and 2.70 more likely to receive any imaging respectively (aOR: 2.15, 95% CI 1.90-2.44 and aOR: 2.70, 95% CI 2.32-3.13). Compared to those with injury/trauma, patients with overdose/poisoning were 82% less likely to receive any imaging (aOR: 0.18, 95% CI 0.09-0.34) Patients with adverse effects of medical treatment and patients with other diagnoses were 80 and 68% less likely for any imaging use than patient with injury, respectively (aOR: 0.20, 95% CI 0.11-0.37 and aOR: 0.32, 95% CI 0.28-0.36). The odds ratios of those characteristics for X-Ray use are similar to the risk for any imaging use, as X-Ray is the most frequent medical imaging type. The distribution and the odds ratio of the top 25 most frequent words or word pairs were also reported in Fig. 1 and Additional file 1: Table S1. The odds of having imaging were higher for patients whose complaints contained words, such as pain, soreness, injury, and spasm, compared to patients without the presence of those words. Patients reporting fever, vomit, or skin issues showed lower odds of having imaging done. Around 200 principal components remain after feature selection for the input of each logistic regression model. Applying the three logistic regression models (Table 3; model 1: structured variables only, model 2: unstructured variables only, and model 3: both unstructured and structured variables), we found that the predictive accuracy for any medical imaging use was higher for models with textbased reason for visit variables only, compared to models with structured variables only. The AUC (Fig. 2 The result for the sensitivity analysis was reported in Additional file 1: Table S2 and Additional file 1: Figure  S1. A number of 420 (1.52% of total) patients had abdomen/pelvis CT scan and 785 (2.84%) had a head CT scan. In the model of abdomen/pelvis CT scan, the AUC was 0.856 (95% CI: 0.833-0.879) for unstructured data, 0.826 (95% CI: 0.814-0.838) for structured data, and 0.892 (95% CI: 0.875-0.909) for both. In the model for head CT scan, the AUC was 0.891(95% CI: 0.877-0.905)   for unstructured data, 0.797 (95% CI: 0.786-0.808) for structured data, and 0.906 (95% CI: 0.893-0.920) for both. The AUC are significantly different between the models on the unstructured data, structured data, and combined data (p < 0.01).\n\n\nDiscussion\n\nIn the current study, we described the rates of X-Ray use and CT use in pediatric visits to the emergency department in the United States. The rate of medical imaging use ranged from 28.4% to 31.8 each year across from 2012 to 2016; the rate of X-Ray use ranged from 23.8 to 26.2%, and CT's rate was 4.2 to 5.9%. We found that patients' socioeconomic, demographic and clinical factors presented at ED triage were associated with the medical imaging use. Similar to previous studies, we detected racial/ethnic and socioeconomic differences in the use of medical imaging [25,26]. We found that Blacks and Hispanics were less likely to undergo CT scans compared to white patients, which could be related to the distribution difference of injury severity, or access to insurance coverage, across racial/ethnic groups [25,27]. Compared to patients with private insurance, patients with Medicaid cover had less likelihood of receiving a CT scan. Reasons for these disparities should be further explored in future research to determine the appropriateness of including or excluding these variables in prediction models [27] based on the clinical context. We also found that younger age, higher triage level, ambulance arrival, abnormal vital signs, injury diagnosis and certain comorbidities were predictive of medical imaging use. As expected, patients with urgent and immediate triage levels had the highest likelihood of medical imaging use. Patients with abnormal vital signs generally had higher likelihood of medical imaging use than the patients with normal vitals.  Clinical practice in adult ED and pediatric ED is largely different, in particular, triaging pediatric patients is more complicated and time-consuming than adults because of their unique physiologic and developmental differences. Compared to our previous study on adult patients, we found even worse racial /ethnic disparities among the black patients compared to white patients in pediatric ED than adult ED. The CT use are positively associated with patients with Medicare in the pediatric patients but opposite for the adult ED patients The CT use are positively associated with urgency of ED among pediatrics.\n\nSince the prediction models are based on the imaging utilization assigned by the clinicians, the associated factors cannot only predict the imaging utilization outcomes but can also indicate the bias in the medical decision in imaging assignment by the clinicians. These biases should be considered in a real implementation of the prediction models in healthcare management. One of the approaches to evaluate these biases would be running a medical chart review from the electronic health records for each patient to analyze how much bias exists in the medical decisions in pediatric ED imaging assignment. Because EDs are the critical staging area for very ill patients, the higher ED utilization and ED overcrowding leads to reduced access to time-critical healthcare, thus negatively affecting patient care quality and patient safety [28][29][30]. As the crisis of emergency care grows, hospitals have taken initiatives to improve the patient care quality in many ways [31,32]. One of these is to establish better decision-making systems in emergency care systems that could mitigate these challenges and facilitate the transition to a value-based healthcare industry [33]. Based on large data collected from ED electronic health records and technological innovations that employ predictive analytics to more rapidly identify resources utilization, such as medical imaging.  Prediction models for the adult ED advanced medical imaging utilization (CT, MRI, and ultrasound) has been examined and proposed in a previous study [34]. The main difference between the prediction models in the adult paper and the current study is that single word frequency was used in the adult study for topic modelling, whereas we only kept the first few topics in the prediction models. Topic modelling is a commonly used technique for NLP. Although the method was reported to identify patterns hidden in the unstructured data into different themes, we did not find many clinically meaningful topics when we applied this to the reasons-forvisit data from adult patients. In the current paper using bag-of-words including both single and word pairs, we used a principal component analysis combined with a ttest for the feature extraction. We found that the AUC for pediatric patients (Any imaging use: 0.824; CT scan: 0.868) is improved compared to adults (Any imaging use: 0.780; CT scan: 0.790). The main contributors of the improvement are the bigrams and the inclusion of all features from all bags of words, instead of only keeping the first few. A novel part of this study was the development of a predictive model for medical imaging use among a cohort of pediatric ED patients using both structured and unstructured data available at ED triage. The predictive model showed \"good\" prediction performance for both medical imaging overall, X-Ray, and CT scan [35]. Although statistically significant, we found that the structured data did not add much prediction power based on the unstructured data in predicting medical imaging utilization for both adult and pediatric patients, indicating that the main factors for imaging utilization at ED were included in the reasons for visit and cause of injury data. A prediction tool built based on the information obtained from patient visits, including the unstructured information written by the triage nurse, may benefit triage personnel and ED physicians, suggesting that the Emergency Severity Index [36][37][38], a common triage standard in the US, may be underusing the wealth of information available in a typical triage note. Unstructured data from the hospital EHR system have remained largely unexplored as extraction and analysis of these data are complicated [37]. However, information hidden in those unstructured health records provide potentially important information to better predict resource utilization at ED. The prediction improved significantly for all three outcomes when naturallanguage processing elements were added. The present study adds to similar previous studies [39,40] by including natural language processing in the ED triage prediction model. Earlier prediction of resource use through tools like those developed here may improve throughput, and improved ED throughput may help reduce ED crowding [32,34,41,42].\n\nThe models generally use variables measured at one time point to estimate the probability of an outcome occurring within a given time in the future [43]. Research in prediction models for the ED health service at this stage aims to assist the clinical decision (i.e., to help identify patients' imaging needs early in the triage period) instead of completely replacing the role of clinicians. Prediction models with good accuracy can efficiently assist the clinical management workflow if there is a good implementation strategy. Medical and economic risk of deploying these models in a real clinical settings is, at this stage, high given the inaccuracies. However, it is still of value to study how to improve the prediction performance, how to better implement those types of prediction tools, and test the values of those models in real implementation, in order to advance the field. This study brought up a new approach to improve the prediction models, and set a base model for imaging prediction at pediatric ED using a national sample. We examined the associated factors of imaging utilization at ED and developed prediction models with good prediction results (AUCs greater than 0.80). Further studies should be performed on how to improve the models' accuracy, and how to implement the models with good accuracy as well as assess the medical-economic risk.\n\n\nLimitations and strengths\n\nThis study is limited in several ways. Limits of the data source (NHAMCS) include that (1) the outcomes of medical imaging use are based on clinical decisions made with awareness of the predictors used in the model, with resulting incorporation bias [44]; (2) the survey did not collect the information of the subtype of X-rays, or (3) information on the appropriateness of imaging utilization and pediatric specific comorbidities; (4) the survey rely on clinician diagnoses and it is not possible to validate the diagnoses; (5) NHAMCS uses visits and not individual patient counts, so it is possible that some children had multiple visits, or received multiple imaging, particularly those more medically complex. The NLP approach simplified the feature extraction using the frequency of word and word pairs existing in the text data. The approach ignored other information, such as word combination with more than bigrams, or the order of the words, which could exclude specific predictors. However, the number of words was small within each text field, so we would expect to capture clinically relevant information by simply extracting the frequency of the words and word pairs.. Limitations of the use of the c-statistic: it is a single number and summarizes the discrimination of a model but does not communicate all the information ROC plots contain and lacks direct clinical application [43].\n\nStrengths of the NHAMCS include national representativeness, increasing the generalizability of the data. This study was based on retrospective national survey samples, and should be viewed as preliminary in the hierarchy of diagnostic test validity. Future perspective studies should be performed to test the effectiveness of the predictive models.\n\n\nConclusions\n\nUsing a nationally representative data of pediatric patients presenting to the ED, we examined information relating to the patients' socioeconomic, demographic and clinical factors during the patients' ED visits, including unstructured free-text fields such as the reason for visiting, and developed predictive models for medical imaging use. Both CT and X-rays are commonly used in the pediatric ED with one third of the visits receiving at least one. We present several predictive models for the use of medical imaging in pediatric patients visiting the ED. The inclusion of unstructured data (ie: triage notes) provided significant improvement in accuracy.\n\n\nSupplementary information\n\nSupplementary information accompanies this paper at https://doi.org/10. 1186/s12911-019-1006-6.\n\nAdditional file 1: Table S1. Characteristics of the top 25 most frequent words in the patient complaint and cause of injury by imaging use. Table S2. Predictive performance of logistic regression models with 10fold classification in identifying patients with abdomen/pelvis and head CT scan during emergency department triage, NHAMCS 2012-2016. Figure S1. ROC curves for the logistic regression models for abdomen/ pelvis and head CT scan (The red point on each ROC curve minimizes the Euclidean distance between the ROC curve and the upper left corner of the coordinate, which is defined as the best cutoff in the study). \n\n\n) was 0.71 (95% CI: 0.70-0.71) for any imaging use, 0.69 (95% CI: 0.68-0.70) for X-ray, and 0.77 (95% CI: 0.76-0.78) for CT scan, in the predictive model including only structured variables. Models including only unstructured information obtained c-statistics of 0.81 (95% CI: 0.81-0.82) for any imaging use, 0.82 (95% CI: 0.82-0.83) for X-ray, and 0.85 (95% CI: 0.83-0.86) for CT scan. When both structured variables and free text variables were included, the c-statistics reached 0.82 (95% CI: 0.82-0.83) for any imaging use, 0.83 (95% CI: 0.83-0.84) for X-ray, and 0.87 (95% CI: 0.86-0.88) for CT scan. The AUC are significantly different between the models on the unstructured data, structured data, and combined data (p < 0.001).\n\nFig. 1\n1Frequency and the word cloud of the word and word pairs in the unstructured variables (the first figure shows the words that appear over 1500 times, the second shows the words that appear over 20 times)\n\nFig. 2\n2ROC curves for the logistic regression models for medical imaging use (The red point on each ROC curve minimizes the Euclidean distance between the ROC curve and the upper left corner of the coordinate, which is defined as the best cutoff in the study)\n\n\nAbbreviations aOR: Adjusted Odds Ratio; AUC: Area under Curve; CI: Confidential Interval; CT: Computed tomography; ED: Emergency Department; EHR: Electronic Health Record; MRI: Magnetic Resonance Imaging; NHAMCS: National Hospital Ambulatory Medical Care Survey ED Subfile; NLP: Natural Language Processing; PCA: Principal Component Analysis; ROC: Receiver Operating Curve\n\nTable 1\n1Baseline characteristics of U.S. patients presenting to the ED, stratified by medical imaging utilization, NHAMCS 2012-2016All N(%) \nNo Imaging N(%) \nAny imaging N(%) \nX-Ray N(%) \nCT Scan N(%) \nP value \n\n27,665 \n19,271(69.7) \n8394(30.3) \n6922(25.0) \n1367(4.9) \n\nSex \n\nFemale \n13,542(48.9) \n9606(70.9) \n3936(29.1) \n3170(23.4) \n625(4.6) \n< 0.0001 \n\nMale \n14,123(51.1) \n9665(68.4) \n4458(31.6) \n3752(26.6) \n742(5.3) \n\nAge category \n\n< 1 year \n3191(12.2) \n2448(76.7) \n743(23.3) \n653(20.5) \n68(2.1) \n< 0.0001 \n\n1-6 year \n9447(36.2) \n7400(78.3) \n2047(21.7) \n1829(19.4) \n187(2.0) \n\n6-12 year \n6390(24.5) \n4325(67.7) \n2065(32.3) \n1759(27.5) \n291(4.6) \n\n12-18 year \n7033(27.0) \n4118(58.6) \n2915(41.4) \n2271(32.3) \n628(8.9) \n\nEthnic \n\nHispanic \n6776(24.5) \n4908(72.4) \n1868(27.6) \n1516(22.4) \n272(4.0) \n< 0.0001 \n\nNon-Hispanic \n20,889(75.5) \n14,363(68.8) \n6526(31.2) \n5406(25.9) \n1095(5.2) \n\nRace \n\nWhite \n14,692(68.9) \n9859(67.1) \n4833(32.9) \n3928(26.7) \n902(6.1) \n< 0.0001 \n\nBlack \n5773(27.1) \n4227(73.2) \n1546(26.8) \n1353(23.4) \n180(3.1) \n\nAsian \n557(2.6) \n393(70.6) \n164(29.4) \n136(24.4) \n19(3.4) \n\nOther \n315(1.5) \n231(73.3) \n84(26.7) \n71(22.5) \n11(3.5) \n\nResidence \n\nPrivate residence \n26,783(99.2) \n18,599(69.4) \n8184(30.6) \n6747(25.2) \n1323(4.9) \n0.1114 \n\nNursing home \n36(0.1) \n22(61.1) \n14(38.9) \n10(27.8) \n7(19.4) \n\nHomeless \n27(0.1) \n20(74.1) \n7(25.9) \n6(22.2) \n2(7.4) \n\nOther \n156(0.6) \n96(61.5) \n60(38.5) \n51(32.7) \n12(7.7) \n\nInsurance \n\nPrivate insurance \n7572(29.7) \n4819(63.6) \n2753(36.4) \n2193(29.0) \n543(7.2) \n< 0.0001 \n\nMedicare \n235(0.9) \n156(66.4) \n79(33.6) \n61(26.0) \n19(8.1) \n\nMedicaid or CHIP \n15,448(60.6) \n11,212(72.6) \n4236(27.4) \n3562(23.1) \n569(3.7) \n\nUninsured \n1546(6.1) \n1093(70.7) \n453(29.3) \n365(23.6) \n81(5.2) \n\nOther \n692(2.7) \n459(66.3) \n233(33.7) \n200(28.9) \n46(6.6) \n\nArrival by Ambulance \n\nNo \n25,059(93.6) \n17,562(70.1) \n7497(29.9) \n6219(24.8) \n1093(4.4) \n< 0.0001 \n\nYes \n1711(6.4) \n1032(60.3) \n679(39.7) \n518(30.3) \n247(14.4) \n\nVisit year \n\n2012 \n6641(24.0) \n4526(68.2) \n2115(31.8) \n1714(25.8) \n393(5.9) \n< 0.0001 \n\n2013 \n5709(20.6) \n4088(71.6) \n1621(28.4) \n1357(23.8) \n240(4.2) \n\n2014 \n5906(21.3) \n4193(71.0) \n1713(29.0) \n1425(24.1) \n272(4.6) \n\n2015 \n4954(17.9) \n3400(68.6) \n1554(31.4) \n1259(25.4) \n262(5.3) \n\n2016 \n4455(16.1) \n3064(68.8) \n1391(31.2) \n1167(26.2) \n200(4.5) \n\nVisit month \n\nDec-Feb \n6718(24.3) \n4705(70.0) \n2013(30.0) \n1697(25.3) \n305(4.5) \n0.0006 \n\nMar-May \n7055(25.5) \n4866(69.0) \n2189(31.0) \n1820(25.8) \n360(5.1) \n\nJun-Aug \n6745(24.4) \n4815(71.4) \n1930(28.6) \n1562(23.2) \n312(4.6) \n\nSep-Nov \n7147(25.8) \n4885(68.4) \n2262(31.6) \n1843(25.8) \n390(5.5) \n\nDay of Week \n\nSunday \n4109(14.9) \n2902(70.6) \n1207(29.4) \n1018(24.8) \n168(4.1) \n0.3082 \n\n\nTable 1\n1Baseline characteristics of U.S. patients presenting to the ED, stratified by medical imaging utilization, NHAMCS 2012-2016 (Continued)All N(%) \nNo Imaging N(%) \nAny imaging N(%) \nX-Ray N(%) \nCT Scan N(%) \nP value \n\n27,665 \n19,271(69.7) \n8394(30.3) \n6922(25.0) \n1367(4.9) \n\nNot related to any above \n17,112(64.0) \n13,111(76.6) \n4001(23.4) \n3119(18.2) \n603(3.5) \n\nQuestionable injury status \n81(0.3) \n66(81.5) \n15(18.5) \n10(12.3) \n5(6.2) \n\n72 h Revisit \n\nYes \n1029(4.1) \n745(72.4) \n284(27.6) \n223(21.7) \n53(5.2) \n0.0429 \n\nNo \n24,092(95.9) \n16,728(69.4) \n7364(30.6) \n6053(25.1) \n1201(5.0) \n\nCancer \n\nYes \n74(0.3) \n45(60.8) \n29(39.2) \n23(31.1) \n8(10.8) \n0.0974 \n\nNo \n27,591(99.7) \n19,226 \n8365 (30.3) \n6899 (35.9) \n1359 (4.9) \n\nCerebral Cardiovascular disease \n\nYes \n16(0.1) \n6(37.5) \n10(62.5) \n8(50.0) \n6(37.5) \n0.0051 \n\nNo \n27,649(99.9) \n19,265 (69.8) \n8384(30.3) \n6914(35.9) \n1361 (4.9) \n\nCongestive Heart Failure \n\nYes \n8(0.1) \n3(37.5) \n5(62.5) \n4(50.0) \n1(12.5) \n0.0478 \n\nNo \n27,657(99.9) \n19,268(69.8) \n8389(30.3) \n6918(35.9) \n1366 (4.9) \n\nCOPD \n\nYes \n135(0.5) \n63(46.7) \n72(53.3) \n70(51.9) \n1(0.7) \n< 0.0001 \n\nNo \n27,530(99.5) \n19,208(69.8) \n8322(30.3) \n6852(35.7) \n1366 (5.0) \n\nHIV \n\nYes \n17(0.1) \n13(76.5) \n4(23.5) \n3(17.6) \n1(5.9) \n0.5411 \n\nNo \n27,648(99.9) \n19,258(69.8) \n8390(30.3) \n6919(35.9) \n1366 (5.0) \n\nNote: Missing value for systolic and diastolic blood pressure, arrival by ambulance, patient's residence type, arrival time, and whether the visit is related to injury/ \npoisoning is lower than 5%. Missing values for body temperature, heart rate, pulse oximetry, source of payment, episode of care, 72 h revisit are between 10 and \n15%. Missing values for pain level is 38%, and triage level pain scale is 64% \n\n\nTable 2\n2Adjusted odds ratio of characteristics associated with the use of diagnostic imaging studies during the emergency department visit (vs. no imaging use), NHAMCS 2012-2016Any imaging \nX-Ray \nCT Scan \n\nCrude \nAdjusted \nCrude \nAdjusted \nCrude \nAdjusted \n\nMale vs Female \n1.13(1.07-1.19) 1.03(0.92-1.15) 1.18(1.12-1.25) 1.01(0.91-1.13) 1.15(1.03-1.28) 1.20(0.97-1.50) \n\nAge category \n\n< 1 year \nReference [1] Reference [1] Reference [1] Reference [1] \nReference [1] \nReference [1] \n\n1-6 year \n0.91(0.83-1.00) 0.58(0.47-0.72) 0.93(0.84-1.03) 0.62(0.50-0.77) 0.93(0.70-1.23) 0.83(0.44-1.54) \n\n6-12 year \n1.57(1.43-1.73) 0.76(0.60-0.96) 1.48(1.33-1.64) 0.78(0.61-0.99) 2.19(1.68-2.86) 1.44(0.77-2.69) \n\n12-18 year \n2.33(2.12-2.56) 0.84(0.66-1.08) 1.85(1.68-2.05) 0.79(0.61-1.03) 4.50(3.49-5.80) 1.91(1.01-3.62) \n\nNon-Hispanic vs Hispanic \n1.19(1.12-1.27) 1.21(1.05-1.40) 1.21(1.14-1.29) 1.16(1.00-1.35) 1.32(1.16-1.52) 1.32(0.98-1.79) \n\nRace \n\nWhite \nReference [1] Reference [1] Reference [1] Reference [1] \nReference [1] \nReference [1] \n\nBlack \n0.75(0.70-0.80) 0.88(0.77-1.00) 0.84(0.78-0.90) 1.03(0.90-1.18) 0.49(0.42-0.58) 0.44(0.32-0.61) \n\nAsian \n0.85(0.71-1.03) 1.29(0.94-1.76) 0.89(0.73-1.08) 1.22(0.88-1.68) 0.54(0.34-0.86) 0.60(0.28-1.26) \n\nOther \n0.74(0.58-0.95) 0.65(0.43-0.99) 0.80(0.61-1.04) 0.79(0.52-1.20) 0.55(0.30-1.01) 0.45(0.16-1.28) \n\nResidence \n\nPrivate residence \nReference [1] Reference [1] Reference [1] Reference [1] \nReference [1] \nReference [1] \n\nNursing home \n1.45(0.74-2.83) 2.01(0.58-7.04) 1.14(0.55-2.37) 2.14(0.61-7.54) 4.65(2.03-10.62) 2.26(0.42-12.21) \n\nHomeless \n0.80(0.34-1.88) 0.87(0.11-6.93) 0.85(0.34-2.10) 1.48(0.21-10.60) 1.54(0.36-6.51) 1.46(0.09-23.04) \n\nOther \n1.42(1.03-1.96) 0.62(0.32-1.22) 1.44(1.03-2.02) 0.67(0.33-1.36) 1.60(0.89-2.90) 0.35(0.08-1.56) \n\nInsurance \n\nPrivate insurance \nReference [1] Reference [1] Reference [1] Reference [1] \nReference [1] \nReference [1] \n\nMedicare \n0.89(0.67-1.17) 1.16(0.68-1.98) 0.86(0.64-1.16) 0.99(0.56-1.74) 1.14(0.71-1.84) 2.61(1.17-5.81) \n\nMedicaid or CHIP \n0.66(0.62-0.70) 0.82(0.73-0.92) 0.74(0.69-0.78) 0.88(0.78-0.99) 0.50(0.44-0.56) 0.75(0.60-0.95) \n\nUninsured \n0.73(0.64-0.82) 0.82(0.65-1.03) 0.76(0.67-0.86) 0.86(0.68-1.09) 0.72(0.56-0.91) 0.80(0.51-1.26) \n\nOther \n0.89(0.75-1.05) 1.10(0.79-1.52) 1.00(0.84-1.18) 1.27(0.91-1.76) 0.92(0.68-1.26) 0.70(0.34-1.44) \n\nArrival by Ambulance \n\nYes vs No \n1.54(1.39-1.70) 1.19(0.96-1.49) 1.32(1.18-1.46) 1.04(0.83-1.30) 3.70(3.19-4.29) 2.40(1.75-3.31) \n\nVisit year \n\n2012 \nReference [1] Reference [1] Reference [1] Reference [1] \nReference [1] \nReference [1] \n\n2013 \n0.85(0.79-0.92) 0.73(0.63-0.86) 0.90(0.83-0.97) 0.75(0.63-0.88) 0.70(0.59-0.82) 0.72(0.53-1.00) \n\n2014 \n0.87(0.81-0.94) 0.79(0.68-0.93) 0.91(0.84-0.99) 0.80(0.68-0.94) 0.77(0.66-0.90) 0.76(0.55-1.04) \n\n2015 \n0.98(0.90-1.06) 0.89(0.76-1.06) 0.98(0.90-1.07) 0.89(0.75-1.05) 0.89(0.76-1.04) 0.98(0.71-1.34) \n\n2016 \n0.97(0.90-1.05) 1.01(0.85-1.19) 1.02(0.94-1.11) 1.14(0.96-1.34) 0.75(0.63-0.89) 0.67(0.47-0.94) \n\nVisit month \n\nDec-Feb \nReference [1] Reference [1] Reference [1] Reference [1] \nReference [1] \nReference [1] \n\nMar-May \n1.05(0.98-1.13) 1.15(0.99-1.33) 1.03(0.95-1.11) 1.05(0.90-1.22) 1.13(0.97-1.32) 1.46(1.07-1.98) \n\nJun-Aug \n0.94(0.87-1.01) 0.83(0.71-0.97) 0.89(0.82-0.97) 0.77(0.66-0.90) 1.02(0.87-1.20) 0.95(0.68-1.34) \n\nSep-Nov \n1.08(1.01-1.16) 1.00(0.87-1.16) 1.03(0.95-1.11) 0.86(0.74-1.00) 1.21(1.04-1.42) 1.43(1.05-1.93) \n\nDay of Week \n\nSunday \nReference [1] Reference [1] Reference [1] Reference [1] \nReference [1] \nReference [1] \n\nMonday \n1.05(0.96-1.15) 0.96(0.79-1.15) 1.00(0.91-1.10) 0.91(0.75-1.10) 1.25(1.02-1.54) 0.93(0.63-1.37) \n\nTuesday \n1.06(0.97-1.17) 1.17(0.97-1.42) 1.02(0.93-1.13) 1.20(0.99-1.46) 1.24(1.00-1.53) 0.99(0.67-1.47) \n\nWednesday \n1.03(0.93-1.13) 0.99(0.81-1.20) 0.99(0.89-1.09) 0.93(0.76-1.14) 1.25(1.01-1.54) 1.08(0.73-1.60) \n\nThursday \n1.10(1.00-1.21) 1.01(0.83-1.23) 1.04(0.94-1.16) 0.94(0.77-1.15) 1.31(1.06-1.61) 1.28(0.88-1.86) \n\n\nTable 2\n2Adjusted odds ratio of characteristics associated with the use of diagnostic imaging studies during the emergency department visit (vs. no imaging use), NHAMCS 2012-2016 (Continued)Any imaging \nX-Ray \nCT Scan \n\nCrude \nAdjusted \nCrude \nAdjusted \nCrude \nAdjusted \n\nFriday \n1.10(1.00-1.21) 0.93(0.76-1.14) 1.07(0.96-1.18) 0.98(0.80-1.20) 1.30(1.05-1.61) 0.85(0.56-1.29) \n\nSaturday \n1.01(0.92-1.11) 0.84(0.69-1.02) 0.98(0.88-1.08) 0.85(0.70-1.05) 1.21(0.98-1.49) 0.96(0.64-1.44) \n\nArrival time \n\nMorning \nReference [1] Reference [1] Reference [1] Reference [1] \nReference [1] \nReference [1] \n\nAfternoon \n1.06(0.99-1.15) 0.96(0.82-1.12) 1.06(0.98-1.15) 0.90(0.77-1.06) 1.06(0.91-1.25) 1.18(0.86-1.62) \n\nEvening \n1.09(1.00-1.18) 0.87(0.74-1.03) 1.11(1.02-1.21) 0.87(0.74-1.03) 1.01(0.85-1.20) 0.98(0.70-1.37) \n\nNight \n0.94(0.87-1.01) 0.89(0.77-1.04) 0.96(0.88-1.04) 0.88(0.75-1.03) 0.96(0.82-1.13) 1.06(0.77-1.46) \n\nTriage level \n\nImmediate and Emergent \nReference [1] Reference [1] Reference [1] Reference [1] \nReference [1] \nReference [1] \n\nUrgent and Semi-urgent \n1.09(0.97-1.23) 1.07(0.86-1.33) 1.07(0.94-1.21) 1.11(0.88-1.40) 0.82(0.67-0.99) 0.93(0.66-1.32) \n\nNonurgent \n0.59(0.53-0.66) 0.53(0.43-0.60) 0.78(0.69-0.88) 0.78(0.62-0.98) 0.21(0.17-0.26) 0.23(0.16-0.33) \n\nTemperature \n\n36 C-38 C \nReference [1] Reference [1] Reference [1] Reference [1] \nReference [1] \nReference [1] \n\n< =36 C \n1.00(0.84-1.17) 0.77(0.55-1.09) 0.93(0.78-1.11) 0.77(0.53-1.10) 1.08(0.78-1.50) 1.21(0.66-2.21) \n\n> 38 C \n0.97(0.89-1.06) 1.79(1.48-2.16) 1.18(1.08-1.29) 2.04(1.69-2.48) 0.29(0.21-0.39) 0.67(0.39-1.16) \n\nDiastolic BP \n\n60-80 \nReference [1] Reference [1] Reference [1] Reference [1] \nReference [1] \nReference [1] \n\n< 60 \n0.60(0.57-0.64) 1.08(0.91-1.28) 0.69(0.65-0.73) 1.01(0.85-1.21) 0.44(0.39-0.50) 1.12(0.81-1.55) \n\n> 80 \n1.27(1.16-1.38) 1.12(0.94-1.34) 1.17(1.07-1.29) 1.09(0.91-1.31) 1.46(1.25-1.70) 0.99(0.72-1.35) \n\nSystolic BP \n\n80-120 \nReference [1] Reference [1] Reference [1] Reference [1] \nReference [1] \nReference [1] \n\n< 80 \n0.61(0.58-0.65) 0.83(0.68-1.00) 0.72(0.68-0.77) 0.93(0.76-1.14) 0.35(0.30-0.42) 0.70(0.45-1.08) \n\n> 120 \n1.49(1.40-1.59) 1.02(0.89-1.18) 1.35(1.26-1.45) 0.99(0.86-1.15) 1.77(1.57-2.00) 1.08(0.83-1.40) \n\nHeart Rate \n\n60-90 \nReference [1] Reference [1] Reference [1] Reference [1] \nReference [1] \nReference [1] \n\n< 60 \n0.56(0.50-0.61) 1.03(0.78-1.36) 0.64(0.58-0.71) 1.27(0.96-1.68) 0.59(0.49-0.72) 0.90(0.54-1.49) \n\n> 90 \n0.58(0.55-0.61) 0.89(0.79-1.01) 0.69(0.65-0.74) 1.02(0.89-1.16) 0.43(0.39-0.48) 0.89(0.70-1.13) \n\nPulse Oximetry \n\n> =95 vs < 95 \n0.57(0.50-0.66) 0.61(0.45-0.82) 0.51(0.44-0.59) 0.51(0.38-0.68) 1.05(0.76-1.45) 1.11(0.57-2.18) \n\nPain level \n\nMild \nReference [1] Reference [1] Reference [1] Reference [1] \nReference [1] \nReference [1] \n\nModerate \n2.85(2.64-3.08) 2.15(1.90-2.44) 2.46(2.27-2.67) 1.97(1.73-2.24) 2.48(2.12-2.90) 1.72(1.32-2.22) \n\nVery severe \n3.26(2.99-3.56) 2.70(2.32-3.13) 2.72(2.49-2.98) 2.33(2.00-2.72) 3.02(2.56-3.57) 1.94(1.45-2.59) \n\nInjury/poisoning \n\nInjury/trauma \nReference [1] Reference [1] Reference [1] Reference [1] \nReference [1] \nReference [1] \n\nOverdose/poisoning \n0.19(0.14-0.27) 0.18(0.09-0.34) 0.23(0.16-0.33) 0.24(0.12-0.46) 0.21(0.09-0.52) 0.23(0.05-0.96) \n\nAdverse effect of medical/surgical treatment 0.31(0.23-0.41) 0.20(0.11-0.37) 0.29(0.21-0.39) 0.21(0.11-0.41) 0.72(0.44-1.18) 0.67(0.23-1.91) \n\nNot related to any above \n0.37(0.35-0.39) 0.32(0.28-0.36) 0.34(0.32-0.36) 0.28(0.24-0.31) 0.43(0.38-0.48) 0.60(0.48-0.76) \n\nQuestionable injury status \n0.27(0.16-0.48) 0.39(0.10-1.49) 0.22(0.11-0.42) 0.11(0.02-0.90) 0.77(0.31-1.92) 5.68 \n(1.14-28.22) \n\n72 h Revisit \n\nNo vs Yes \n1.16(1.01-1.33) 1.11(0.83-1.49) 1.21(1.04-1.41) 1.21(0.89-1.65) 0.97(0.73-1.28) 0.89(0.51-1.56) \n\nCancer \n1.48(0.93-2.36) 1.31(0.30-5.78) 1.35(0.83-2.22) 0.67(0.14-3.24) 2.34(1.12-4.89) 2.85 \n\n\nTable 2\n2Adjusted odds ratio of characteristics associated with the use of diagnostic imaging studies during the emergency department visit (vs. no imaging use), NHAMCS 2012-2016 (Continued)Any imaging \nX-Ray \nCT Scan \n\nCrude \nAdjusted \nCrude \nAdjusted \nCrude \nAdjusted \n\n(0.46-17.53) \n\nCerebral Cardiovascular disease \n3.81 \n(1.39-10.48) \n\n-\n2.99(1.12-7.98) -\n11.59 \n(4.21-31.93) \n\n-\n\nCOPD \n2.64(1.88-3.70) 5.85 \n(2.89-11.85) \n\n3.25(2.32-4.56) 7.87 \n(3.91-15.84) \n\n0.14(0.02-1.02) -\n\nCongestive Heart Failure \n3.81 \n(0.91-15.93) \n\n-\n2.99 \n(0.75-11.96) \n\n-\n2.76(0.34-22.38) -\n\nHIV \n0.71(0.23-2.17) -\n0.64(0.19-2.24) 6.55 \n(0.51-83.75) \n\n1.20(0.16-9.07) 2.81 \n(0.16-50.30) \n\n\n\nTable 3\n3Predictive performance of logistic regression models with 10-fold classification in identifying patients with various medical imaging use during emergency department triage, NHAMCS 2012-2016Probability cut-off \nSensitivity \nSpecificity \nAccuracy \nAUC (95% CI) \n\nAny Imaging use \n\nUnstructured variables \n0.28 \n0.72 \n0.74 \n0.73 \n0.810 (0.807-0.813) \n\nStructured variables \n0.31 \n0.62 \n0.67 \n0.66 \n0.706 (0.698-0.714) \n\nUnstructured + Structured variables \n0.27 \n0.75 \n0.73 \n0.74 \n0.824 (0.818-0.829) \n\nXray \n\nUnstructured variables \n0.22 \n0.73 \n0.74 \n0.74 \n0.824 (0.822-0.826) \n\nStructured variables \n0.26 \n0.61 \n0.67 \n0.65 \n0.694(0.685-0.704) \n\nUnstructured + Structured variables \n0.22 \n0.75 \n0.74 \n0.74 \n0.834 (0.830-0.839) \n\nCT Scan \n\nUnstructured variables \n0.04 \n0.79 \n0.77 \n0.78 \n0.845 (0.832-0.858) \n\nStructured variables \n0.05 \n0.71 \n0.69 \n0.69 \n0.771 (0.759-0.783) \n\nUnstructured + Structured variables \n0.04 \n0.80 \n0.79 \n0.79 \n0.868(0.858-0.878) \n\nNote: The best cutoff of the probabilities was determined by using the point on the ROC curve with the shortest distance to the upper left corner (where \nsensitivity = 1 and specificity = 1) \n\nAcknowledgementsThe first author Xingyu Zhang thank Elizabeth Duffy from Department of Emergency Medicine, University of Michigan School of Medicine for her help in writing the paper and obtaining the funding from MICHR.Role of the funder/sponsorThe funders/sponsors had no role in the design and conduct of the study; collection, management, analysis, and interpretation of the data; preparation, review, or approval of the manuscript; and decision to submit the manuscript for publication.Authors' contributions Dr. Zhang had full access to all the data in the study and take responsibility for the integrity of the data and the accuracy of the data analysis.Concept and design: XZ, PM.Acquisition, analysis, or interpretation of data: All authors.Availability of data and materialsThe NHAMCS-ED dataset can be accessed through the website of the US Centers for Disease Control and Prevention (CDC) (https://www.cdc.gov/ nchs/ahcd/index.htm). The detailed explanation of the survey data for each year and the code book can be found here: https://ftp.cdc.gov/pub/Health_ Statistics/NCHS/dataset_documentation/nhamcs/ The SAS dataset for each year can be found here: https://ftp.cdc.gov/pub/ Health_Statistics/NCHS/Datasets/NHAMCS/ All the data were in a SAS format. To get the unstructured data, one needs to run the SAS format files under the following link before import the data to the analysis software. https://ftp.cdc.gov/pub/Health_Statistics/NCHS/ dataset_documentation/nhamcs/sas/ Ethics approval and consent to participate This study was a secondary analysis of a public database and did not require ethical approval.Consent for publicationNot applicable.Competing interestsThe authors declare that they have no competing interests.\nUS emergency department performance on wait time and length of visit. L I Horwitz, J Green, E H Bradley, Ann Emerg Med. 552Horwitz LI, Green J, Bradley EH. US emergency department performance on wait time and length of visit. Ann Emerg Med. 2010;55(2):133-41.\n\nClinical decision making: an emergency medicine perspective. G Kovacs, P Croskerry, Acad Emerg Med. 69Kovacs G, Croskerry P. Clinical decision making: an emergency medicine perspective. Acad Emerg Med. 1999;6(9):947-52.\n\n. M Patel, I Maconochie, Triage in children. Trauma. 104Patel M, Maconochie I. Triage in children. Trauma. 2008;10(4):239-45.\n\nEvaluation of the emergency severity index (version 3) triage algorithm in pediatric patients. M R Baumann, T D Strout, Acad Emerg Med. 123Baumann MR, Strout TD. Evaluation of the emergency severity index (version 3) triage algorithm in pediatric patients. Acad Emerg Med. 2005; 12(3):219-24.\n\nValidation of different pediatric triage systems in the emergency department. K Aeimchanbanjong, U Pandee, World J Emerg Med. 83223Aeimchanbanjong K, Pandee U. Validation of different pediatric triage systems in the emergency department. World J Emerg Med. 2017;8(3):223.\n\nTriage of the pediatric patient in the emergency department: are we all in agreement?. T Maldonado, J R Avner, Pediatrics. 1142Maldonado T, Avner JR. Triage of the pediatric patient in the emergency department: are we all in agreement? Pediatrics. 2004;114(2):356-60.\n\nTransforming hospital emergency department workflow and patient care. E K Lee, H Y Atallah, M D Wright, E T Post, Thomas Iv, C Wu, D T Haley, L L Jr, Interfaces. 451Lee EK, Atallah HY, Wright MD, Post ET, Thomas Iv C, Wu DT, Haley LL Jr. Transforming hospital emergency department workflow and patient care. Interfaces. 2015;45(1):58-82.\n\nThe association between advanced diagnostic imaging and ED length of stay. H K Kanzaria, M A Probst, N A Ponce, R Y Hsia, Am J Emerg Med. 3210Kanzaria HK, Probst MA, Ponce NA, Hsia RY. The association between advanced diagnostic imaging and ED length of stay. Am J Emerg Med. 2014;32(10):1253-8.\n\nAnalysis of factors influencing length of stay in the emergency department. P Yoon, I Steiner, G Reinhardt, CJEM. 53Yoon P, Steiner I, Reinhardt G. Analysis of factors influencing length of stay in the emergency department. CJEM. 2003;5(3):155-61.\n\nThe appropriate use of CT: quality improvement and clinical decision-making in pediatric emergency medicine. C G Macias, J J Sahouria, Pediatr Radiol. 412498Macias CG, Sahouria JJ. The appropriate use of CT: quality improvement and clinical decision-making in pediatric emergency medicine. Pediatr Radiol. 2011;41(2):498.\n\nUsing electronic medical record systems for admission decisions in emergency departments: examining the crowdedness effect. O Ben-Assuli, M Leshno, I Shabtai, J Med Syst. 366Ben-Assuli O, Leshno M, Shabtai I. Using electronic medical record systems for admission decisions in emergency departments: examining the crowdedness effect. J Med Syst. 2012;36(6):3795-803.\n\nPrediction of emergency department hospital admission based on natural language processing and neural networks. X Zhang, J Kim, R E Patzer, S R Pitts, A Patzer, J D Schrager, Methods Inf Med. 5605Zhang X, Kim J, Patzer RE, Pitts SR, Patzer A, Schrager JD. Prediction of emergency department hospital admission based on natural language processing and neural networks. Methods Inf Med. 2017;56(05):377-89.\n\nMachine learningbased prediction of clinical outcomes for children during emergency department triage. T Goto, C A Camargo, M K Faridi, R J Freishtat, K Hasegawa, JAMA Netw Open. 21186937Goto T, Camargo CA, Faridi MK, Freishtat RJ, Hasegawa K. Machine learning- based prediction of clinical outcomes for children during emergency department triage. JAMA Netw Open. 2019;2(1):e186937.\n\nWhat can natural language processing do for clinical decision support?. D Demner-Fushman, W W Chapman, C J Mcdonald, J Biomed Inform. 425Demner-Fushman D, Chapman WW, McDonald CJ. What can natural language processing do for clinical decision support? J Biomed Inform. 2009;42(5):760-72.\n\nText Mining of Medical Records for Radiodiagnostic decision-making. W Claster, S Shanmuganathan, N Ghotbi, JCP. 31Claster W, Shanmuganathan S, Ghotbi N. Text Mining of Medical Records for Radiodiagnostic decision-making. JCP. 2008;3(1):1-6.\n\nInformation extraction: distilling structured data from unstructured text. A Mccallum, Queue. 39McCallum A. Information extraction: distilling structured data from unstructured text. Queue. 2005;3(9):48-57.\n\nGuidelines for developing and reporting machine learning predictive models in biomedical research: a multidisciplinary view. W Luo, D Phung, T Tran, S Gupta, Rana S Karmakar, C Shilton, A Yearwood, J Dimitrova, N Ho, T B , J Med Internet Res. 1812323Luo W, Phung D, Tran T, Gupta S, Rana S, Karmakar C, Shilton A, Yearwood J, Dimitrova N, Ho TB. Guidelines for developing and reporting machine learning predictive models in biomedical research: a multidisciplinary view. J Med Internet Res. 2016;18(12):e323.\n\nUnderstanding and interpreting the National Hospital Ambulatory Medical Care Survey: key questions and answers. L F Mccaig, C W Burt, Ann Emerg Med. 606McCaig LF, Burt CW. Understanding and interpreting the National Hospital Ambulatory Medical Care Survey: key questions and answers. Ann Emerg Med. 2012;60(6):716-21.\n\nEarly hospital readmission after kidney transplantation: patient and center-level associations. M A Mcadams-Demarco, M E Grams, E C Hall, J Coresh, D L Segev, Am J Transplant Off J Am Soc Transplant Am Soc Transplant Surg. 1212McAdams-Demarco MA, Grams ME, Hall EC, Coresh J, Segev DL. Early hospital readmission after kidney transplantation: patient and center-level associations. Am J Transplant Off J Am Soc Transplant Am Soc Transplant Surg. 2012;12(12):3283-8.\n\nEarly rehospitalization after kidney transplantation: assessing preventability and prognosis. M Harhay, E Lin, A Pai, M O Harhay, A Huverserian, A Mussell, P Abt, M Levine, R Bloom, J A Shea, Am J Transplant Off J Am Soc Transplant Am Soc Transplant Surg. 1312Harhay M, Lin E, Pai A, Harhay MO, Huverserian A, Mussell A, Abt P, Levine M, Bloom R, Shea JA, et al. Early rehospitalization after kidney transplantation: assessing preventability and prognosis. Am J Transplant Off J Am Soc Transplant Am Soc Transplant Surg. 2013;13(12):3164-72.\n\nA reason for visit classification for ambulatory care. Vital Health Stat 2. D Schneider, L Appleton, T Mclemore, Schneider D, Appleton L, McLemore T. A reason for visit classification for ambulatory care. Vital Health Stat 2. 1979;(78):1-63 i-vi.\n\nUnderstanding bag-of-words model: a statistical framework. Y Zhang, Jin R Zhou, Z-H , Int J Mach Learn Cybern. 11-4Zhang Y, Jin R, Zhou Z-H. Understanding bag-of-words model: a statistical framework. Int J Mach Learn Cybern. 2010;1(1-4):43-52.\n\nInformation maximizing component analysis of left ventricular remodeling due to myocardial infarction. X Zhang, B Ambale-Venkatesh, D A Bluemke, B R Cowan, J P Finn, A H Kadish, D C Lee, Jac Lima, W G Hundley, A Suinesiaputra, J Transl Med. 131343Zhang X, Ambale-Venkatesh B, Bluemke DA, Cowan BR, Finn JP, Kadish AH, Lee DC, Lima JAC, Hundley WG, Suinesiaputra A. Information maximizing component analysis of left ventricular remodeling due to myocardial infarction. J Transl Med. 2015;13(1):343.\n\nUsing ROC Curves to Choose Minimally Important Change Thresholds when Sensitivity and Specificity Are Valued Equally: The Forgotten Lesson of Pythagoras. Theoretical Considerations and an Example Application of Change in Health Status. R Froud, G Abel, PLoS One. 912114468Froud R, Abel G. Using ROC Curves to Choose Minimally Important Change Thresholds when Sensitivity and Specificity Are Valued Equally: The Forgotten Lesson of Pythagoras. Theoretical Considerations and an Example Application of Change in Health Status. PLoS One. 2014;9(12):e114468.\n\nRelationship of physician-identified patient race and ethnicity to use of computed tomography in pediatric blunt torso trauma. J E Natale, J G Joseph, A J Rogers, M Tunik, D Monroe, B Kerrey, B K Bonsu, L J Cook, K Page, K Adelgais, Acad Emerg Med Off J Soc Acad Emerg Med. 235Natale JE, Joseph JG, Rogers AJ, Tunik M, Monroe D, Kerrey B, Bonsu BK, Cook LJ, Page K, Adelgais K, et al. Relationship of physician-identified patient race and ethnicity to use of computed tomography in pediatric blunt torso trauma. Acad Emerg Med Off J Soc Acad Emerg Med. 2016; 23(5):584-90.\n\nPediatric abdominal pain: use of imaging in the emergency department in the United States from 1999 to. A L Hryhorczuk, R C Mannix, G A Taylor, Radiology. 2633Hryhorczuk AL, Mannix RC, Taylor GA. Pediatric abdominal pain: use of imaging in the emergency department in the United States from 1999 to 2007. Radiology. 2012;263(3):778-85.\n\nRacial disparities in ordering laboratory and radiology tests for pediatric patients in the emergency department. N R Payne, S E Puumala, Pediatr Emerg Care. 295Payne NR, Puumala SE. Racial disparities in ordering laboratory and radiology tests for pediatric patients in the emergency department. Pediatr Emerg Care. 2013;29(5):598-606.\n\nPediatric emergency department overcrowding and impact on patient flow outcomes. N L Timm, M L Ho, J W Luria, Acad Emerg Med. 159Timm NL, Ho ML, Luria JW. Pediatric emergency department overcrowding and impact on patient flow outcomes. Acad Emerg Med. 2008;15(9):832-7.\n\nPediatric emergency department crowding is associated with a lower likelihood of hospital admission. K A Michelson, M C Monuteaux, A M Stack, R G Bachur, Acad Emerg Med. 197Michelson KA, Monuteaux MC, Stack AM, Bachur RG. Pediatric emergency department crowding is associated with a lower likelihood of hospital admission. Acad Emerg Med. 2012;19(7):816-20.\n\nQuality measurement in the emergency department: past and future. J D Schuur, R Y Hsia, H Burstin, M J Schull, J M Pines, Health Aff. 3212Schuur JD, Hsia RY, Burstin H, Schull MJ, Pines JM. Quality measurement in the emergency department: past and future. Health Aff. 2013;32(12):2129-38.\n\nA simulation study to improve quality of care in the emergency department of a community hospital. Z Zeng, X Ma, Y Hu, J Li, D Bryant, J Emerg Nurs. 384Zeng Z, Ma X, Hu Y, Li J, Bryant D. A simulation study to improve quality of care in the emergency department of a community hospital. J Emerg Nurs. 2012;38(4):322-8.\n\nA conceptual model of emergency department crowding. B R Asplin, D J Magid, K V Rhodes, L I Solberg, N Lurie, C A CamargoJr, Ann Emerg Med. 422Asplin BR, Magid DJ, Rhodes KV, Solberg LI, Lurie N, Camargo CA Jr. A conceptual model of emergency department crowding. Ann Emerg Med. 2003;42(2):173-80.\n\nExploring the potential of predictive analytics and big data in emergency care. A T Janke, D L Overbeek, K E Kocher, P D Levy, Ann Emerg Med. 672Janke AT, Overbeek DL, Kocher KE, Levy PD. Exploring the potential of predictive analytics and big data in emergency care. Ann Emerg Med. 2016; 67(2):227-36.\n\nAdvanced diagnostic imaging utilization during emergency department visits in the United States: a predictive modeling study for emergency department triage. X Zhang, J Kim, R E Patzer, S R Pitts, F H Chokshi, J D Schrager, PLoS One. 144214905Zhang X, Kim J, Patzer RE, Pitts SR, Chokshi FH, Schrager JD. Advanced diagnostic imaging utilization during emergency department visits in the United States: a predictive modeling study for emergency department triage. PLoS One. 2019;14(4):e0214905.\n\nSensitivity, specificity, accuracy, associated confidence interval and ROC analysis with practical SAS implementations. NESUG proceedings: health care and life sciences. W Zhu, N Zeng, N Wang, 1967Zhu W, Zeng N, Wang N. Sensitivity, specificity, accuracy, associated confidence interval and ROC analysis with practical SAS implementations. NESUG proceedings: health care and life sciences. 2010;19:67.\n\nThe emergency severity index (version 3) 5-level triage system scores predict ED resource consumption. P Tanabe, R Gimbel, P R Yarnold, J G Adams, J Emerg Nurs. 301Tanabe P, Gimbel R, Yarnold PR, Adams JG. The emergency severity index (version 3) 5-level triage system scores predict ED resource consumption. J Emerg Nurs. 2004;30(1):22-9.\n\nMore patients are triaged using the emergency severity index than any other triage acuity system in the United States. M Mchugh, P Tanabe, M Mcclelland, R K Khare, Acad Emerg Med Off J Soc Acad Emerg Med. 191McHugh M, Tanabe P, McClelland M, Khare RK. More patients are triaged using the emergency severity index than any other triage acuity system in the United States. Acad Emerg Med Off J Soc Acad Emerg Med. 2012;19(1):106-9.\n\nEmergency severity index triage category is associated with sixmonth survival. ESI triage study group. R Wuerz, Acad Emerg Med Off J Soc Acad Emerg Med. 81Wuerz R. Emergency severity index triage category is associated with six- month survival. ESI triage study group. Acad Emerg Med Off J Soc Acad Emerg Med. 2001;8(1):61-4.\n\nMachine-learning-based electronic triage more accurately differentiates patients with respect to clinical outcomes compared with the emergency severity index. S Levin, M Toerper, E Hamrock, J S Hinson, S Barnes, H Gardner, A Dugas, B Linton, T Kirsch, G Kelen, Ann Emerg Med. 715Levin S, Toerper M, Hamrock E, Hinson JS, Barnes S, Gardner H, Dugas A, Linton B, Kirsch T, Kelen G. Machine-learning-based electronic triage more accurately differentiates patients with respect to clinical outcomes compared with the emergency severity index. Ann Emerg Med. 2018;71(5): 565-74.\n\nDesign and development of a mobile system for supporting emergency triage. W Michalowski, R Slowinski, S Wilk, K Farion, J Pike, S Rubin, Methods Inf Med. 441Michalowski W, Slowinski R, Wilk S, Farion K, Pike J, Rubin S. Design and development of a mobile system for supporting emergency triage. Methods Inf Med. 2005;44(1):14-24.\n\nEffect of emergency department crowding on outcomes of admitted patients. B C Sun, R Y Hsia, R E Weiss, D Zingmond, L J Liang, W Han, H Mccreath, S M Asch, Ann Emerg Med. 616Sun BC, Hsia RY, Weiss RE, Zingmond D, Liang LJ, Han W, McCreath H, Asch SM. Effect of emergency department crowding on outcomes of admitted patients. Ann Emerg Med. 2013;61(6):605-11 e606.\n\nSystematic review of emergency department crowding: causes, effects, and solutions. N R Hoot, D Aronsky, Ann Emerg Med. 522e121Hoot NR, Aronsky D. Systematic review of emergency department crowding: causes, effects, and solutions. Ann Emerg Med. 2008;52(2): 126-136. e121.\n\nEvaluating discrimination of risk prediction models: the C statistic. M J Pencina, D&apos;agostino Rb, Jama. 31410Pencina MJ, D'agostino RB. Evaluating discrimination of risk prediction models: the C statistic. Jama. 2015;314(10):1063-4.\n\nIncorporation bias in studies of diagnostic tests: how to avoid being biased about bias. A Worster, C Carpenter, CJEM. 102Worster A, Carpenter C. Incorporation bias in studies of diagnostic tests: how to avoid being biased about bias. CJEM. 2008;10(2):174-5.\n\nPublisher's Note. Publisher's Note\n\nSpringer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations.\n", "annotations": {"author": "[{\"start\":\"142\",\"end\":\"260\"},{\"start\":\"261\",\"end\":\"281\"},{\"start\":\"282\",\"end\":\"301\"},{\"start\":\"302\",\"end\":\"315\"},{\"start\":\"316\",\"end\":\"420\"},{\"start\":\"421\",\"end\":\"438\"}]", "publisher": null, "author_last_name": "[{\"start\":\"149\",\"end\":\"154\"},{\"start\":\"263\",\"end\":\"280\"},{\"start\":\"286\",\"end\":\"300\"},{\"start\":\"309\",\"end\":\"314\"},{\"start\":\"322\",\"end\":\"326\"},{\"start\":\"430\",\"end\":\"437\"}]", "author_first_name": "[{\"start\":\"142\",\"end\":\"148\"},{\"start\":\"261\",\"end\":\"262\"},{\"start\":\"282\",\"end\":\"285\"},{\"start\":\"302\",\"end\":\"308\"},{\"start\":\"316\",\"end\":\"321\"},{\"start\":\"421\",\"end\":\"429\"}]", "author_affiliation": "[{\"start\":\"156\",\"end\":\"259\"},{\"start\":\"328\",\"end\":\"419\"}]", "title": "[{\"start\":\"1\",\"end\":\"139\"},{\"start\":\"439\",\"end\":\"577\"}]", "venue": null, "abstract": "[{\"start\":\"745\",\"end\":\"2942\"}]", "bib_ref": "[{\"start\":\"3136\",\"end\":\"3139\",\"attributes\":{\"ref_id\":\"b0\"}},{\"start\":\"3244\",\"end\":\"3247\",\"attributes\":{\"ref_id\":\"b1\"}},{\"start\":\"3396\",\"end\":\"3399\",\"attributes\":{\"ref_id\":\"b2\"}},{\"start\":\"3399\",\"end\":\"3401\",\"attributes\":{\"ref_id\":\"b3\"}},{\"start\":\"3521\",\"end\":\"3524\",\"attributes\":{\"ref_id\":\"b4\"}},{\"start\":\"3524\",\"end\":\"3526\",\"attributes\":{\"ref_id\":\"b5\"}},{\"start\":\"3864\",\"end\":\"3867\",\"attributes\":{\"ref_id\":\"b6\"}},{\"start\":\"4103\",\"end\":\"4106\",\"attributes\":{\"ref_id\":\"b7\"}},{\"start\":\"4106\",\"end\":\"4108\",\"attributes\":{\"ref_id\":\"b8\"}},{\"start\":\"4230\",\"end\":\"4234\",\"attributes\":{\"ref_id\":\"b9\"}},{\"start\":\"4234\",\"end\":\"4237\",\"attributes\":{\"ref_id\":\"b10\"}},{\"start\":\"4380\",\"end\":\"4384\",\"attributes\":{\"ref_id\":\"b11\"}},{\"start\":\"4508\",\"end\":\"4512\",\"attributes\":{\"ref_id\":\"b12\"}},{\"start\":\"4717\",\"end\":\"4721\",\"attributes\":{\"ref_id\":\"b13\"}},{\"start\":\"4721\",\"end\":\"4724\",\"attributes\":{\"ref_id\":\"b14\"}},{\"start\":\"4823\",\"end\":\"4827\",\"attributes\":{\"ref_id\":\"b15\"}},{\"start\":\"5010\",\"end\":\"5014\",\"attributes\":{\"ref_id\":\"b11\"}},{\"start\":\"5792\",\"end\":\"5796\",\"attributes\":{\"ref_id\":\"b16\"}},{\"start\":\"5926\",\"end\":\"5930\",\"attributes\":{\"ref_id\":\"b17\"}},{\"start\":\"5930\",\"end\":\"5934\",\"attributes\":{\"ref_id\":\"b18\"}},{\"start\":\"5934\",\"end\":\"5938\",\"attributes\":{\"ref_id\":\"b19\"}},{\"start\":\"6299\",\"end\":\"6303\",\"attributes\":{\"ref_id\":\"b18\"}},{\"start\":\"6303\",\"end\":\"6306\",\"attributes\":{\"ref_id\":\"b19\"}},{\"start\":\"7790\",\"end\":\"7794\",\"attributes\":{\"ref_id\":\"b20\"}},{\"start\":\"8408\",\"end\":\"8412\",\"attributes\":{\"ref_id\":\"b21\"}},{\"start\":\"8996\",\"end\":\"9000\",\"attributes\":{\"ref_id\":\"b11\"}},{\"start\":\"9000\",\"end\":\"9003\",\"attributes\":{\"ref_id\":\"b22\"}},{\"start\":\"11503\",\"end\":\"11507\",\"attributes\":{\"ref_id\":\"b23\"}},{\"start\":\"16883\",\"end\":\"16887\",\"attributes\":{\"ref_id\":\"b24\"}},{\"start\":\"16887\",\"end\":\"16890\",\"attributes\":{\"ref_id\":\"b25\"}},{\"start\":\"17127\",\"end\":\"17131\",\"attributes\":{\"ref_id\":\"b24\"}},{\"start\":\"17131\",\"end\":\"17134\",\"attributes\":{\"ref_id\":\"b26\"}},{\"start\":\"17426\",\"end\":\"17430\",\"attributes\":{\"ref_id\":\"b26\"}},{\"start\":\"19333\",\"end\":\"19337\",\"attributes\":{\"ref_id\":\"b27\"}},{\"start\":\"19337\",\"end\":\"19341\",\"attributes\":{\"ref_id\":\"b28\"}},{\"start\":\"19341\",\"end\":\"19345\",\"attributes\":{\"ref_id\":\"b29\"}},{\"start\":\"19468\",\"end\":\"19472\",\"attributes\":{\"ref_id\":\"b30\"}},{\"start\":\"19472\",\"end\":\"19475\",\"attributes\":{\"ref_id\":\"b31\"}},{\"start\":\"19667\",\"end\":\"19671\",\"attributes\":{\"ref_id\":\"b32\"}},{\"start\":\"20023\",\"end\":\"20027\",\"attributes\":{\"ref_id\":\"b33\"}},{\"start\":\"21343\",\"end\":\"21347\",\"attributes\":{\"ref_id\":\"b34\"}},{\"start\":\"21933\",\"end\":\"21937\",\"attributes\":{\"ref_id\":\"b35\"}},{\"start\":\"21937\",\"end\":\"21941\",\"attributes\":{\"ref_id\":\"b36\"}},{\"start\":\"21941\",\"end\":\"21945\",\"attributes\":{\"ref_id\":\"b37\"}},{\"start\":\"22200\",\"end\":\"22204\",\"attributes\":{\"ref_id\":\"b36\"}},{\"start\":\"22524\",\"end\":\"22528\",\"attributes\":{\"ref_id\":\"b38\"}},{\"start\":\"22528\",\"end\":\"22531\",\"attributes\":{\"ref_id\":\"b39\"}},{\"start\":\"22762\",\"end\":\"22766\",\"attributes\":{\"ref_id\":\"b31\"}},{\"start\":\"22766\",\"end\":\"22769\",\"attributes\":{\"ref_id\":\"b33\"}},{\"start\":\"22769\",\"end\":\"22772\",\"attributes\":{\"ref_id\":\"b40\"}},{\"start\":\"22772\",\"end\":\"22775\",\"attributes\":{\"ref_id\":\"b41\"}},{\"start\":\"22926\",\"end\":\"22930\",\"attributes\":{\"ref_id\":\"b42\"}},{\"start\":\"24424\",\"end\":\"24428\",\"attributes\":{\"ref_id\":\"b43\"}},{\"start\":\"25567\",\"end\":\"25571\",\"attributes\":{\"ref_id\":\"b42\"}}]", "figure": "[{\"start\":\"27349\",\"end\":\"28085\",\"attributes\":{\"id\":\"fig_0\"}},{\"start\":\"28086\",\"end\":\"28297\",\"attributes\":{\"id\":\"fig_1\"}},{\"start\":\"28298\",\"end\":\"28559\",\"attributes\":{\"id\":\"fig_2\"}},{\"start\":\"28560\",\"end\":\"28934\",\"attributes\":{\"id\":\"fig_3\"}},{\"start\":\"28935\",\"end\":\"31635\",\"attributes\":{\"id\":\"tab_0\",\"type\":\"table\"}},{\"start\":\"31636\",\"end\":\"33374\",\"attributes\":{\"id\":\"tab_1\",\"type\":\"table\"}},{\"start\":\"33375\",\"end\":\"37362\",\"attributes\":{\"id\":\"tab_2\",\"type\":\"table\"}},{\"start\":\"37363\",\"end\":\"41230\",\"attributes\":{\"id\":\"tab_3\",\"type\":\"table\"}},{\"start\":\"41231\",\"end\":\"41906\",\"attributes\":{\"id\":\"tab_4\",\"type\":\"table\"}},{\"start\":\"41907\",\"end\":\"43067\",\"attributes\":{\"id\":\"tab_5\",\"type\":\"table\"}}]", "paragraph": "[{\"start\":\"2958\",\"end\":\"3527\"},{\"start\":\"3529\",\"end\":\"4109\"},{\"start\":\"4111\",\"end\":\"5016\"},{\"start\":\"5018\",\"end\":\"5580\"},{\"start\":\"5601\",\"end\":\"6530\"},{\"start\":\"6532\",\"end\":\"7630\"},{\"start\":\"7632\",\"end\":\"8719\"},{\"start\":\"8721\",\"end\":\"9623\"},{\"start\":\"9625\",\"end\":\"10493\"},{\"start\":\"10495\",\"end\":\"11508\"},{\"start\":\"11510\",\"end\":\"11940\"},{\"start\":\"11952\",\"end\":\"13166\"},{\"start\":\"13168\",\"end\":\"16299\"},{\"start\":\"16314\",\"end\":\"18494\"},{\"start\":\"18496\",\"end\":\"22776\"},{\"start\":\"22778\",\"end\":\"24144\"},{\"start\":\"24174\",\"end\":\"25572\"},{\"start\":\"25574\",\"end\":\"25923\"},{\"start\":\"25939\",\"end\":\"26598\"},{\"start\":\"26628\",\"end\":\"26723\"},{\"start\":\"26725\",\"end\":\"27348\"}]", "formula": null, "table_ref": "[{\"start\":\"12143\",\"end\":\"12152\",\"attributes\":{\"ref_id\":\"tab_0\"}},{\"start\":\"13356\",\"end\":\"13363\",\"attributes\":{\"ref_id\":\"tab_2\"}},{\"start\":\"14778\",\"end\":\"14786\",\"attributes\":{\"ref_id\":\"tab_0\"}},{\"start\":\"15223\",\"end\":\"15231\",\"attributes\":{\"ref_id\":\"tab_5\"}},{\"start\":\"15643\",\"end\":\"15651\",\"attributes\":{\"ref_id\":\"tab_2\"}},{\"start\":\"26744\",\"end\":\"26752\",\"attributes\":{\"ref_id\":\"tab_0\"}},{\"start\":\"26865\",\"end\":\"26873\",\"attributes\":{\"ref_id\":\"tab_2\"}}]", "section_header": "[{\"start\":\"2944\",\"end\":\"2956\"},{\"start\":\"5583\",\"end\":\"5599\"},{\"start\":\"11943\",\"end\":\"11950\"},{\"start\":\"16302\",\"end\":\"16312\"},{\"start\":\"24147\",\"end\":\"24172\"},{\"start\":\"25926\",\"end\":\"25937\"},{\"start\":\"26601\",\"end\":\"26626\"},{\"start\":\"28087\",\"end\":\"28093\"},{\"start\":\"28299\",\"end\":\"28305\"},{\"start\":\"28936\",\"end\":\"28943\"},{\"start\":\"31637\",\"end\":\"31644\"},{\"start\":\"33376\",\"end\":\"33383\"},{\"start\":\"37364\",\"end\":\"37371\"},{\"start\":\"41232\",\"end\":\"41239\"},{\"start\":\"41908\",\"end\":\"41915\"}]", "table": "[{\"start\":\"29068\",\"end\":\"31635\"},{\"start\":\"31781\",\"end\":\"33374\"},{\"start\":\"33554\",\"end\":\"37362\"},{\"start\":\"37554\",\"end\":\"41230\"},{\"start\":\"41422\",\"end\":\"41906\"},{\"start\":\"42107\",\"end\":\"43067\"}]", "figure_caption": "[{\"start\":\"27351\",\"end\":\"28085\"},{\"start\":\"28095\",\"end\":\"28297\"},{\"start\":\"28307\",\"end\":\"28559\"},{\"start\":\"28562\",\"end\":\"28934\"},{\"start\":\"28945\",\"end\":\"29068\"},{\"start\":\"31646\",\"end\":\"31781\"},{\"start\":\"33385\",\"end\":\"33554\"},{\"start\":\"37373\",\"end\":\"37554\"},{\"start\":\"41241\",\"end\":\"41422\"},{\"start\":\"41917\",\"end\":\"42107\"}]", "figure_ref": "[{\"start\":\"14748\",\"end\":\"14754\",\"attributes\":{\"ref_id\":\"fig_1\"}},{\"start\":\"15560\",\"end\":\"15567\",\"attributes\":{\"ref_id\":\"fig_2\"}},{\"start\":\"15675\",\"end\":\"15685\",\"attributes\":{\"ref_id\":\"fig_1\"}},{\"start\":\"27070\",\"end\":\"27079\",\"attributes\":{\"ref_id\":\"fig_1\"}}]", "bib_author_first_name": "[{\"start\":\"44882\",\"end\":\"44883\"},{\"start\":\"44884\",\"end\":\"44885\"},{\"start\":\"44895\",\"end\":\"44896\"},{\"start\":\"44904\",\"end\":\"44905\"},{\"start\":\"44906\",\"end\":\"44907\"},{\"start\":\"45134\",\"end\":\"45135\"},{\"start\":\"45144\",\"end\":\"45145\"},{\"start\":\"45296\",\"end\":\"45297\"},{\"start\":\"45305\",\"end\":\"45306\"},{\"start\":\"45516\",\"end\":\"45517\"},{\"start\":\"45518\",\"end\":\"45519\"},{\"start\":\"45529\",\"end\":\"45530\"},{\"start\":\"45531\",\"end\":\"45532\"},{\"start\":\"45793\",\"end\":\"45794\"},{\"start\":\"45812\",\"end\":\"45813\"},{\"start\":\"46075\",\"end\":\"46076\"},{\"start\":\"46088\",\"end\":\"46089\"},{\"start\":\"46090\",\"end\":\"46091\"},{\"start\":\"46327\",\"end\":\"46328\"},{\"start\":\"46329\",\"end\":\"46330\"},{\"start\":\"46336\",\"end\":\"46337\"},{\"start\":\"46338\",\"end\":\"46339\"},{\"start\":\"46349\",\"end\":\"46350\"},{\"start\":\"46351\",\"end\":\"46352\"},{\"start\":\"46361\",\"end\":\"46362\"},{\"start\":\"46363\",\"end\":\"46364\"},{\"start\":\"46371\",\"end\":\"46377\"},{\"start\":\"46382\",\"end\":\"46383\"},{\"start\":\"46388\",\"end\":\"46389\"},{\"start\":\"46390\",\"end\":\"46391\"},{\"start\":\"46399\",\"end\":\"46400\"},{\"start\":\"46401\",\"end\":\"46402\"},{\"start\":\"46671\",\"end\":\"46672\"},{\"start\":\"46673\",\"end\":\"46674\"},{\"start\":\"46685\",\"end\":\"46686\"},{\"start\":\"46687\",\"end\":\"46688\"},{\"start\":\"46697\",\"end\":\"46698\"},{\"start\":\"46699\",\"end\":\"46700\"},{\"start\":\"46708\",\"end\":\"46709\"},{\"start\":\"46710\",\"end\":\"46711\"},{\"start\":\"46969\",\"end\":\"46970\"},{\"start\":\"46977\",\"end\":\"46978\"},{\"start\":\"46988\",\"end\":\"46989\"},{\"start\":\"47251\",\"end\":\"47252\"},{\"start\":\"47253\",\"end\":\"47254\"},{\"start\":\"47263\",\"end\":\"47264\"},{\"start\":\"47265\",\"end\":\"47266\"},{\"start\":\"47589\",\"end\":\"47590\"},{\"start\":\"47603\",\"end\":\"47604\"},{\"start\":\"47613\",\"end\":\"47614\"},{\"start\":\"47944\",\"end\":\"47945\"},{\"start\":\"47953\",\"end\":\"47954\"},{\"start\":\"47960\",\"end\":\"47961\"},{\"start\":\"47962\",\"end\":\"47963\"},{\"start\":\"47972\",\"end\":\"47973\"},{\"start\":\"47974\",\"end\":\"47975\"},{\"start\":\"47983\",\"end\":\"47984\"},{\"start\":\"47993\",\"end\":\"47994\"},{\"start\":\"47995\",\"end\":\"47996\"},{\"start\":\"48341\",\"end\":\"48342\"},{\"start\":\"48349\",\"end\":\"48350\"},{\"start\":\"48351\",\"end\":\"48352\"},{\"start\":\"48362\",\"end\":\"48363\"},{\"start\":\"48364\",\"end\":\"48365\"},{\"start\":\"48374\",\"end\":\"48375\"},{\"start\":\"48376\",\"end\":\"48377\"},{\"start\":\"48389\",\"end\":\"48390\"},{\"start\":\"48695\",\"end\":\"48696\"},{\"start\":\"48713\",\"end\":\"48714\"},{\"start\":\"48715\",\"end\":\"48716\"},{\"start\":\"48726\",\"end\":\"48727\"},{\"start\":\"48728\",\"end\":\"48729\"},{\"start\":\"48979\",\"end\":\"48980\"},{\"start\":\"48990\",\"end\":\"48991\"},{\"start\":\"49008\",\"end\":\"49009\"},{\"start\":\"49228\",\"end\":\"49229\"},{\"start\":\"49486\",\"end\":\"49487\"},{\"start\":\"49493\",\"end\":\"49494\"},{\"start\":\"49502\",\"end\":\"49503\"},{\"start\":\"49510\",\"end\":\"49511\"},{\"start\":\"49519\",\"end\":\"49523\"},{\"start\":\"49524\",\"end\":\"49525\"},{\"start\":\"49536\",\"end\":\"49537\"},{\"start\":\"49547\",\"end\":\"49548\"},{\"start\":\"49559\",\"end\":\"49560\"},{\"start\":\"49572\",\"end\":\"49573\"},{\"start\":\"49578\",\"end\":\"49579\"},{\"start\":\"49580\",\"end\":\"49581\"},{\"start\":\"49983\",\"end\":\"49984\"},{\"start\":\"49985\",\"end\":\"49986\"},{\"start\":\"49995\",\"end\":\"49996\"},{\"start\":\"49997\",\"end\":\"49998\"},{\"start\":\"50286\",\"end\":\"50287\"},{\"start\":\"50288\",\"end\":\"50289\"},{\"start\":\"50307\",\"end\":\"50308\"},{\"start\":\"50309\",\"end\":\"50310\"},{\"start\":\"50318\",\"end\":\"50319\"},{\"start\":\"50320\",\"end\":\"50321\"},{\"start\":\"50328\",\"end\":\"50329\"},{\"start\":\"50338\",\"end\":\"50339\"},{\"start\":\"50340\",\"end\":\"50341\"},{\"start\":\"50751\",\"end\":\"50752\"},{\"start\":\"50761\",\"end\":\"50762\"},{\"start\":\"50768\",\"end\":\"50769\"},{\"start\":\"50775\",\"end\":\"50776\"},{\"start\":\"50777\",\"end\":\"50778\"},{\"start\":\"50787\",\"end\":\"50788\"},{\"start\":\"50802\",\"end\":\"50803\"},{\"start\":\"50813\",\"end\":\"50814\"},{\"start\":\"50820\",\"end\":\"50821\"},{\"start\":\"50830\",\"end\":\"50831\"},{\"start\":\"50839\",\"end\":\"50840\"},{\"start\":\"50841\",\"end\":\"50842\"},{\"start\":\"51276\",\"end\":\"51277\"},{\"start\":\"51289\",\"end\":\"51290\"},{\"start\":\"51301\",\"end\":\"51302\"},{\"start\":\"51507\",\"end\":\"51508\"},{\"start\":\"51516\",\"end\":\"51519\"},{\"start\":\"51520\",\"end\":\"51521\"},{\"start\":\"51528\",\"end\":\"51531\"},{\"start\":\"51796\",\"end\":\"51797\"},{\"start\":\"51805\",\"end\":\"51806\"},{\"start\":\"51825\",\"end\":\"51826\"},{\"start\":\"51827\",\"end\":\"51828\"},{\"start\":\"51838\",\"end\":\"51839\"},{\"start\":\"51840\",\"end\":\"51841\"},{\"start\":\"51849\",\"end\":\"51850\"},{\"start\":\"51851\",\"end\":\"51852\"},{\"start\":\"51859\",\"end\":\"51860\"},{\"start\":\"51861\",\"end\":\"51862\"},{\"start\":\"51871\",\"end\":\"51872\"},{\"start\":\"51873\",\"end\":\"51874\"},{\"start\":\"51880\",\"end\":\"51883\"},{\"start\":\"51890\",\"end\":\"51891\"},{\"start\":\"51892\",\"end\":\"51893\"},{\"start\":\"51903\",\"end\":\"51904\"},{\"start\":\"52428\",\"end\":\"52429\"},{\"start\":\"52437\",\"end\":\"52438\"},{\"start\":\"52875\",\"end\":\"52876\"},{\"start\":\"52877\",\"end\":\"52878\"},{\"start\":\"52887\",\"end\":\"52888\"},{\"start\":\"52889\",\"end\":\"52890\"},{\"start\":\"52899\",\"end\":\"52900\"},{\"start\":\"52901\",\"end\":\"52902\"},{\"start\":\"52911\",\"end\":\"52912\"},{\"start\":\"52920\",\"end\":\"52921\"},{\"start\":\"52930\",\"end\":\"52931\"},{\"start\":\"52940\",\"end\":\"52941\"},{\"start\":\"52942\",\"end\":\"52943\"},{\"start\":\"52951\",\"end\":\"52952\"},{\"start\":\"52953\",\"end\":\"52954\"},{\"start\":\"52961\",\"end\":\"52962\"},{\"start\":\"52969\",\"end\":\"52970\"},{\"start\":\"53426\",\"end\":\"53427\"},{\"start\":\"53428\",\"end\":\"53429\"},{\"start\":\"53442\",\"end\":\"53443\"},{\"start\":\"53444\",\"end\":\"53445\"},{\"start\":\"53454\",\"end\":\"53455\"},{\"start\":\"53456\",\"end\":\"53457\"},{\"start\":\"53773\",\"end\":\"53774\"},{\"start\":\"53775\",\"end\":\"53776\"},{\"start\":\"53784\",\"end\":\"53785\"},{\"start\":\"53786\",\"end\":\"53787\"},{\"start\":\"54078\",\"end\":\"54079\"},{\"start\":\"54080\",\"end\":\"54081\"},{\"start\":\"54088\",\"end\":\"54089\"},{\"start\":\"54090\",\"end\":\"54091\"},{\"start\":\"54096\",\"end\":\"54097\"},{\"start\":\"54098\",\"end\":\"54099\"},{\"start\":\"54369\",\"end\":\"54370\"},{\"start\":\"54371\",\"end\":\"54372\"},{\"start\":\"54384\",\"end\":\"54385\"},{\"start\":\"54386\",\"end\":\"54387\"},{\"start\":\"54399\",\"end\":\"54400\"},{\"start\":\"54401\",\"end\":\"54402\"},{\"start\":\"54410\",\"end\":\"54411\"},{\"start\":\"54412\",\"end\":\"54413\"},{\"start\":\"54693\",\"end\":\"54694\"},{\"start\":\"54695\",\"end\":\"54696\"},{\"start\":\"54705\",\"end\":\"54706\"},{\"start\":\"54707\",\"end\":\"54708\"},{\"start\":\"54715\",\"end\":\"54716\"},{\"start\":\"54726\",\"end\":\"54727\"},{\"start\":\"54728\",\"end\":\"54729\"},{\"start\":\"54738\",\"end\":\"54739\"},{\"start\":\"54740\",\"end\":\"54741\"},{\"start\":\"55016\",\"end\":\"55017\"},{\"start\":\"55024\",\"end\":\"55025\"},{\"start\":\"55030\",\"end\":\"55031\"},{\"start\":\"55036\",\"end\":\"55037\"},{\"start\":\"55042\",\"end\":\"55043\"},{\"start\":\"55290\",\"end\":\"55291\"},{\"start\":\"55292\",\"end\":\"55293\"},{\"start\":\"55302\",\"end\":\"55303\"},{\"start\":\"55304\",\"end\":\"55305\"},{\"start\":\"55313\",\"end\":\"55314\"},{\"start\":\"55315\",\"end\":\"55316\"},{\"start\":\"55325\",\"end\":\"55326\"},{\"start\":\"55327\",\"end\":\"55328\"},{\"start\":\"55338\",\"end\":\"55339\"},{\"start\":\"55347\",\"end\":\"55348\"},{\"start\":\"55349\",\"end\":\"55350\"},{\"start\":\"55616\",\"end\":\"55617\"},{\"start\":\"55618\",\"end\":\"55619\"},{\"start\":\"55627\",\"end\":\"55628\"},{\"start\":\"55629\",\"end\":\"55630\"},{\"start\":\"55641\",\"end\":\"55642\"},{\"start\":\"55643\",\"end\":\"55644\"},{\"start\":\"55653\",\"end\":\"55654\"},{\"start\":\"55655\",\"end\":\"55656\"},{\"start\":\"55998\",\"end\":\"55999\"},{\"start\":\"56007\",\"end\":\"56008\"},{\"start\":\"56014\",\"end\":\"56015\"},{\"start\":\"56016\",\"end\":\"56017\"},{\"start\":\"56026\",\"end\":\"56027\"},{\"start\":\"56028\",\"end\":\"56029\"},{\"start\":\"56037\",\"end\":\"56038\"},{\"start\":\"56039\",\"end\":\"56040\"},{\"start\":\"56050\",\"end\":\"56051\"},{\"start\":\"56052\",\"end\":\"56053\"},{\"start\":\"56505\",\"end\":\"56506\"},{\"start\":\"56512\",\"end\":\"56513\"},{\"start\":\"56520\",\"end\":\"56521\"},{\"start\":\"56841\",\"end\":\"56842\"},{\"start\":\"56851\",\"end\":\"56852\"},{\"start\":\"56861\",\"end\":\"56862\"},{\"start\":\"56863\",\"end\":\"56864\"},{\"start\":\"56874\",\"end\":\"56875\"},{\"start\":\"56876\",\"end\":\"56877\"},{\"start\":\"57198\",\"end\":\"57199\"},{\"start\":\"57208\",\"end\":\"57209\"},{\"start\":\"57218\",\"end\":\"57219\"},{\"start\":\"57232\",\"end\":\"57233\"},{\"start\":\"57234\",\"end\":\"57235\"},{\"start\":\"57613\",\"end\":\"57614\"},{\"start\":\"57996\",\"end\":\"57997\"},{\"start\":\"58005\",\"end\":\"58006\"},{\"start\":\"58016\",\"end\":\"58017\"},{\"start\":\"58027\",\"end\":\"58028\"},{\"start\":\"58029\",\"end\":\"58030\"},{\"start\":\"58039\",\"end\":\"58040\"},{\"start\":\"58049\",\"end\":\"58050\"},{\"start\":\"58060\",\"end\":\"58061\"},{\"start\":\"58069\",\"end\":\"58070\"},{\"start\":\"58079\",\"end\":\"58080\"},{\"start\":\"58089\",\"end\":\"58090\"},{\"start\":\"58487\",\"end\":\"58488\"},{\"start\":\"58502\",\"end\":\"58503\"},{\"start\":\"58515\",\"end\":\"58516\"},{\"start\":\"58523\",\"end\":\"58524\"},{\"start\":\"58533\",\"end\":\"58534\"},{\"start\":\"58541\",\"end\":\"58542\"},{\"start\":\"58818\",\"end\":\"58819\"},{\"start\":\"58820\",\"end\":\"58821\"},{\"start\":\"58827\",\"end\":\"58828\"},{\"start\":\"58829\",\"end\":\"58830\"},{\"start\":\"58837\",\"end\":\"58838\"},{\"start\":\"58839\",\"end\":\"58840\"},{\"start\":\"58848\",\"end\":\"58849\"},{\"start\":\"58860\",\"end\":\"58861\"},{\"start\":\"58862\",\"end\":\"58863\"},{\"start\":\"58871\",\"end\":\"58872\"},{\"start\":\"58878\",\"end\":\"58879\"},{\"start\":\"58890\",\"end\":\"58891\"},{\"start\":\"58892\",\"end\":\"58893\"},{\"start\":\"59193\",\"end\":\"59194\"},{\"start\":\"59195\",\"end\":\"59196\"},{\"start\":\"59203\",\"end\":\"59204\"},{\"start\":\"59453\",\"end\":\"59454\"},{\"start\":\"59455\",\"end\":\"59456\"},{\"start\":\"59466\",\"end\":\"59481\"},{\"start\":\"59711\",\"end\":\"59712\"},{\"start\":\"59722\",\"end\":\"59723\"}]", "bib_author_last_name": "[{\"start\":\"44886\",\"end\":\"44893\"},{\"start\":\"44897\",\"end\":\"44902\"},{\"start\":\"44908\",\"end\":\"44915\"},{\"start\":\"45136\",\"end\":\"45142\"},{\"start\":\"45146\",\"end\":\"45155\"},{\"start\":\"45298\",\"end\":\"45303\"},{\"start\":\"45307\",\"end\":\"45317\"},{\"start\":\"45520\",\"end\":\"45527\"},{\"start\":\"45533\",\"end\":\"45539\"},{\"start\":\"45795\",\"end\":\"45810\"},{\"start\":\"45814\",\"end\":\"45820\"},{\"start\":\"46077\",\"end\":\"46086\"},{\"start\":\"46092\",\"end\":\"46097\"},{\"start\":\"46331\",\"end\":\"46334\"},{\"start\":\"46340\",\"end\":\"46347\"},{\"start\":\"46353\",\"end\":\"46359\"},{\"start\":\"46365\",\"end\":\"46369\"},{\"start\":\"46378\",\"end\":\"46380\"},{\"start\":\"46384\",\"end\":\"46386\"},{\"start\":\"46392\",\"end\":\"46397\"},{\"start\":\"46675\",\"end\":\"46683\"},{\"start\":\"46689\",\"end\":\"46695\"},{\"start\":\"46701\",\"end\":\"46706\"},{\"start\":\"46712\",\"end\":\"46716\"},{\"start\":\"46971\",\"end\":\"46975\"},{\"start\":\"46979\",\"end\":\"46986\"},{\"start\":\"46990\",\"end\":\"46999\"},{\"start\":\"47255\",\"end\":\"47261\"},{\"start\":\"47267\",\"end\":\"47275\"},{\"start\":\"47591\",\"end\":\"47601\"},{\"start\":\"47605\",\"end\":\"47611\"},{\"start\":\"47615\",\"end\":\"47622\"},{\"start\":\"47946\",\"end\":\"47951\"},{\"start\":\"47955\",\"end\":\"47958\"},{\"start\":\"47964\",\"end\":\"47970\"},{\"start\":\"47976\",\"end\":\"47981\"},{\"start\":\"47985\",\"end\":\"47991\"},{\"start\":\"47997\",\"end\":\"48005\"},{\"start\":\"48343\",\"end\":\"48347\"},{\"start\":\"48353\",\"end\":\"48360\"},{\"start\":\"48366\",\"end\":\"48372\"},{\"start\":\"48378\",\"end\":\"48387\"},{\"start\":\"48391\",\"end\":\"48399\"},{\"start\":\"48697\",\"end\":\"48711\"},{\"start\":\"48717\",\"end\":\"48724\"},{\"start\":\"48730\",\"end\":\"48738\"},{\"start\":\"48981\",\"end\":\"48988\"},{\"start\":\"48992\",\"end\":\"49006\"},{\"start\":\"49010\",\"end\":\"49016\"},{\"start\":\"49230\",\"end\":\"49238\"},{\"start\":\"49488\",\"end\":\"49491\"},{\"start\":\"49495\",\"end\":\"49500\"},{\"start\":\"49504\",\"end\":\"49508\"},{\"start\":\"49512\",\"end\":\"49517\"},{\"start\":\"49526\",\"end\":\"49534\"},{\"start\":\"49538\",\"end\":\"49545\"},{\"start\":\"49549\",\"end\":\"49557\"},{\"start\":\"49561\",\"end\":\"49570\"},{\"start\":\"49574\",\"end\":\"49576\"},{\"start\":\"49987\",\"end\":\"49993\"},{\"start\":\"49999\",\"end\":\"50003\"},{\"start\":\"50290\",\"end\":\"50305\"},{\"start\":\"50311\",\"end\":\"50316\"},{\"start\":\"50322\",\"end\":\"50326\"},{\"start\":\"50330\",\"end\":\"50336\"},{\"start\":\"50342\",\"end\":\"50347\"},{\"start\":\"50753\",\"end\":\"50759\"},{\"start\":\"50763\",\"end\":\"50766\"},{\"start\":\"50770\",\"end\":\"50773\"},{\"start\":\"50779\",\"end\":\"50785\"},{\"start\":\"50789\",\"end\":\"50800\"},{\"start\":\"50804\",\"end\":\"50811\"},{\"start\":\"50815\",\"end\":\"50818\"},{\"start\":\"50822\",\"end\":\"50828\"},{\"start\":\"50832\",\"end\":\"50837\"},{\"start\":\"50843\",\"end\":\"50847\"},{\"start\":\"51278\",\"end\":\"51287\"},{\"start\":\"51291\",\"end\":\"51299\"},{\"start\":\"51303\",\"end\":\"51311\"},{\"start\":\"51509\",\"end\":\"51514\"},{\"start\":\"51522\",\"end\":\"51526\"},{\"start\":\"51798\",\"end\":\"51803\"},{\"start\":\"51807\",\"end\":\"51823\"},{\"start\":\"51829\",\"end\":\"51836\"},{\"start\":\"51842\",\"end\":\"51847\"},{\"start\":\"51853\",\"end\":\"51857\"},{\"start\":\"51863\",\"end\":\"51869\"},{\"start\":\"51875\",\"end\":\"51878\"},{\"start\":\"51884\",\"end\":\"51888\"},{\"start\":\"51894\",\"end\":\"51901\"},{\"start\":\"51905\",\"end\":\"51918\"},{\"start\":\"52430\",\"end\":\"52435\"},{\"start\":\"52439\",\"end\":\"52443\"},{\"start\":\"52879\",\"end\":\"52885\"},{\"start\":\"52891\",\"end\":\"52897\"},{\"start\":\"52903\",\"end\":\"52909\"},{\"start\":\"52913\",\"end\":\"52918\"},{\"start\":\"52922\",\"end\":\"52928\"},{\"start\":\"52932\",\"end\":\"52938\"},{\"start\":\"52944\",\"end\":\"52949\"},{\"start\":\"52955\",\"end\":\"52959\"},{\"start\":\"52963\",\"end\":\"52967\"},{\"start\":\"52971\",\"end\":\"52979\"},{\"start\":\"53430\",\"end\":\"53440\"},{\"start\":\"53446\",\"end\":\"53452\"},{\"start\":\"53458\",\"end\":\"53464\"},{\"start\":\"53777\",\"end\":\"53782\"},{\"start\":\"53788\",\"end\":\"53795\"},{\"start\":\"54082\",\"end\":\"54086\"},{\"start\":\"54092\",\"end\":\"54094\"},{\"start\":\"54100\",\"end\":\"54105\"},{\"start\":\"54373\",\"end\":\"54382\"},{\"start\":\"54388\",\"end\":\"54397\"},{\"start\":\"54403\",\"end\":\"54408\"},{\"start\":\"54414\",\"end\":\"54420\"},{\"start\":\"54697\",\"end\":\"54703\"},{\"start\":\"54709\",\"end\":\"54713\"},{\"start\":\"54717\",\"end\":\"54724\"},{\"start\":\"54730\",\"end\":\"54736\"},{\"start\":\"54742\",\"end\":\"54747\"},{\"start\":\"55018\",\"end\":\"55022\"},{\"start\":\"55026\",\"end\":\"55028\"},{\"start\":\"55032\",\"end\":\"55034\"},{\"start\":\"55038\",\"end\":\"55040\"},{\"start\":\"55044\",\"end\":\"55050\"},{\"start\":\"55294\",\"end\":\"55300\"},{\"start\":\"55306\",\"end\":\"55311\"},{\"start\":\"55317\",\"end\":\"55323\"},{\"start\":\"55329\",\"end\":\"55336\"},{\"start\":\"55340\",\"end\":\"55345\"},{\"start\":\"55351\",\"end\":\"55358\"},{\"start\":\"55620\",\"end\":\"55625\"},{\"start\":\"55631\",\"end\":\"55639\"},{\"start\":\"55645\",\"end\":\"55651\"},{\"start\":\"55657\",\"end\":\"55661\"},{\"start\":\"56000\",\"end\":\"56005\"},{\"start\":\"56009\",\"end\":\"56012\"},{\"start\":\"56018\",\"end\":\"56024\"},{\"start\":\"56030\",\"end\":\"56035\"},{\"start\":\"56041\",\"end\":\"56048\"},{\"start\":\"56054\",\"end\":\"56062\"},{\"start\":\"56507\",\"end\":\"56510\"},{\"start\":\"56514\",\"end\":\"56518\"},{\"start\":\"56522\",\"end\":\"56526\"},{\"start\":\"56843\",\"end\":\"56849\"},{\"start\":\"56853\",\"end\":\"56859\"},{\"start\":\"56865\",\"end\":\"56872\"},{\"start\":\"56878\",\"end\":\"56883\"},{\"start\":\"57200\",\"end\":\"57206\"},{\"start\":\"57210\",\"end\":\"57216\"},{\"start\":\"57220\",\"end\":\"57230\"},{\"start\":\"57236\",\"end\":\"57241\"},{\"start\":\"57615\",\"end\":\"57620\"},{\"start\":\"57998\",\"end\":\"58003\"},{\"start\":\"58007\",\"end\":\"58014\"},{\"start\":\"58018\",\"end\":\"58025\"},{\"start\":\"58031\",\"end\":\"58037\"},{\"start\":\"58041\",\"end\":\"58047\"},{\"start\":\"58051\",\"end\":\"58058\"},{\"start\":\"58062\",\"end\":\"58067\"},{\"start\":\"58071\",\"end\":\"58077\"},{\"start\":\"58081\",\"end\":\"58087\"},{\"start\":\"58091\",\"end\":\"58096\"},{\"start\":\"58489\",\"end\":\"58500\"},{\"start\":\"58504\",\"end\":\"58513\"},{\"start\":\"58517\",\"end\":\"58521\"},{\"start\":\"58525\",\"end\":\"58531\"},{\"start\":\"58535\",\"end\":\"58539\"},{\"start\":\"58543\",\"end\":\"58548\"},{\"start\":\"58822\",\"end\":\"58825\"},{\"start\":\"58831\",\"end\":\"58835\"},{\"start\":\"58841\",\"end\":\"58846\"},{\"start\":\"58850\",\"end\":\"58858\"},{\"start\":\"58864\",\"end\":\"58869\"},{\"start\":\"58873\",\"end\":\"58876\"},{\"start\":\"58880\",\"end\":\"58888\"},{\"start\":\"58894\",\"end\":\"58898\"},{\"start\":\"59197\",\"end\":\"59201\"},{\"start\":\"59205\",\"end\":\"59212\"},{\"start\":\"59457\",\"end\":\"59464\"},{\"start\":\"59482\",\"end\":\"59484\"},{\"start\":\"59713\",\"end\":\"59720\"},{\"start\":\"59724\",\"end\":\"59733\"}]", "bib_entry": "[{\"start\":\"44812\",\"end\":\"45071\",\"attributes\":{\"matched_paper_id\":\"19760228\",\"id\":\"b0\"}},{\"start\":\"45073\",\"end\":\"45292\",\"attributes\":{\"matched_paper_id\":\"11206574\",\"id\":\"b1\"}},{\"start\":\"45294\",\"end\":\"45419\",\"attributes\":{\"id\":\"b2\"}},{\"start\":\"45421\",\"end\":\"45713\",\"attributes\":{\"matched_paper_id\":\"10438902\",\"id\":\"b3\"}},{\"start\":\"45715\",\"end\":\"45986\",\"attributes\":{\"matched_paper_id\":\"46708694\",\"id\":\"b4\"}},{\"start\":\"45988\",\"end\":\"46255\",\"attributes\":{\"matched_paper_id\":\"43606789\",\"id\":\"b5\"}},{\"start\":\"46257\",\"end\":\"46594\",\"attributes\":{\"matched_paper_id\":\"2885390\",\"id\":\"b6\"}},{\"start\":\"46596\",\"end\":\"46891\",\"attributes\":{\"matched_paper_id\":\"21650287\",\"id\":\"b7\"}},{\"start\":\"46893\",\"end\":\"47140\",\"attributes\":{\"matched_paper_id\":\"7216954\",\"id\":\"b8\"}},{\"start\":\"47142\",\"end\":\"47463\",\"attributes\":{\"matched_paper_id\":\"11170051\",\"id\":\"b9\"}},{\"start\":\"47465\",\"end\":\"47830\",\"attributes\":{\"matched_paper_id\":\"18498300\",\"id\":\"b10\"}},{\"start\":\"47832\",\"end\":\"48236\",\"attributes\":{\"matched_paper_id\":\"22273920\",\"id\":\"b11\"}},{\"start\":\"48238\",\"end\":\"48621\",\"attributes\":{\"matched_paper_id\":\"58638933\",\"id\":\"b12\"}},{\"start\":\"48623\",\"end\":\"48909\",\"attributes\":{\"matched_paper_id\":\"13780041\",\"id\":\"b13\"}},{\"start\":\"48911\",\"end\":\"49151\",\"attributes\":{\"matched_paper_id\":\"15845559\",\"id\":\"b14\"}},{\"start\":\"49153\",\"end\":\"49359\",\"attributes\":{\"id\":\"b15\"}},{\"start\":\"49361\",\"end\":\"49869\",\"attributes\":{\"matched_paper_id\":\"3794211\",\"id\":\"b16\"}},{\"start\":\"49871\",\"end\":\"50188\",\"attributes\":{\"matched_paper_id\":\"6040954\",\"id\":\"b17\"}},{\"start\":\"50190\",\"end\":\"50655\",\"attributes\":{\"matched_paper_id\":\"205849263\",\"id\":\"b18\"}},{\"start\":\"50657\",\"end\":\"51198\",\"attributes\":{\"matched_paper_id\":\"23359606\",\"id\":\"b19\"}},{\"start\":\"51200\",\"end\":\"51446\",\"attributes\":{\"id\":\"b20\"}},{\"start\":\"51448\",\"end\":\"51691\",\"attributes\":{\"matched_paper_id\":\"12255087\",\"id\":\"b21\"}},{\"start\":\"51693\",\"end\":\"52190\",\"attributes\":{\"matched_paper_id\":\"4491916\",\"id\":\"b22\"}},{\"start\":\"52192\",\"end\":\"52746\",\"attributes\":{\"matched_paper_id\":\"12262731\",\"id\":\"b23\"}},{\"start\":\"52748\",\"end\":\"53320\",\"attributes\":{\"matched_paper_id\":\"25507151\",\"id\":\"b24\"}},{\"start\":\"53322\",\"end\":\"53657\",\"attributes\":{\"matched_paper_id\":\"13370966\",\"id\":\"b25\"}},{\"start\":\"53659\",\"end\":\"53995\",\"attributes\":{\"matched_paper_id\":\"33141836\",\"id\":\"b26\"}},{\"start\":\"53997\",\"end\":\"54266\",\"attributes\":{\"matched_paper_id\":\"20280345\",\"id\":\"b27\"}},{\"start\":\"54268\",\"end\":\"54625\",\"attributes\":{\"matched_paper_id\":\"23239933\",\"id\":\"b28\"}},{\"start\":\"54627\",\"end\":\"54915\",\"attributes\":{\"matched_paper_id\":\"10717698\",\"id\":\"b29\"}},{\"start\":\"54917\",\"end\":\"55235\",\"attributes\":{\"matched_paper_id\":\"31840897\",\"id\":\"b30\"}},{\"start\":\"55237\",\"end\":\"55534\",\"attributes\":{\"matched_paper_id\":\"35137031\",\"id\":\"b31\"}},{\"start\":\"55536\",\"end\":\"55838\",\"attributes\":{\"matched_paper_id\":\"33209948\",\"id\":\"b32\"}},{\"start\":\"55840\",\"end\":\"56333\",\"attributes\":{\"matched_paper_id\":\"106408186\",\"id\":\"b33\"}},{\"start\":\"56335\",\"end\":\"56736\",\"attributes\":{\"id\":\"b34\"}},{\"start\":\"56738\",\"end\":\"57077\",\"attributes\":{\"matched_paper_id\":\"30466821\",\"id\":\"b35\"}},{\"start\":\"57079\",\"end\":\"57508\",\"attributes\":{\"matched_paper_id\":\"31692172\",\"id\":\"b36\"}},{\"start\":\"57510\",\"end\":\"57835\",\"attributes\":{\"matched_paper_id\":\"25684861\",\"id\":\"b37\"}},{\"start\":\"57837\",\"end\":\"58410\",\"attributes\":{\"matched_paper_id\":\"5046204\",\"id\":\"b38\"}},{\"start\":\"58412\",\"end\":\"58742\",\"attributes\":{\"matched_paper_id\":\"14089675\",\"id\":\"b39\"}},{\"start\":\"58744\",\"end\":\"59107\",\"attributes\":{\"matched_paper_id\":\"1289030\",\"id\":\"b40\"}},{\"start\":\"59109\",\"end\":\"59381\",\"attributes\":{\"matched_paper_id\":\"12833881\",\"id\":\"b41\"}},{\"start\":\"59383\",\"end\":\"59620\",\"attributes\":{\"matched_paper_id\":\"205063031\",\"id\":\"b42\"}},{\"start\":\"59622\",\"end\":\"59880\",\"attributes\":{\"matched_paper_id\":\"42758655\",\"id\":\"b43\"}},{\"start\":\"59882\",\"end\":\"59916\",\"attributes\":{\"id\":\"b44\"}},{\"start\":\"59918\",\"end\":\"60155\",\"attributes\":{\"id\":\"b45\"}}]", "bib_title": "[{\"start\":\"44812\",\"end\":\"44880\"},{\"start\":\"45073\",\"end\":\"45132\"},{\"start\":\"45421\",\"end\":\"45514\"},{\"start\":\"45715\",\"end\":\"45791\"},{\"start\":\"45988\",\"end\":\"46073\"},{\"start\":\"46257\",\"end\":\"46325\"},{\"start\":\"46596\",\"end\":\"46669\"},{\"start\":\"46893\",\"end\":\"46967\"},{\"start\":\"47142\",\"end\":\"47249\"},{\"start\":\"47465\",\"end\":\"47587\"},{\"start\":\"47832\",\"end\":\"47942\"},{\"start\":\"48238\",\"end\":\"48339\"},{\"start\":\"48623\",\"end\":\"48693\"},{\"start\":\"48911\",\"end\":\"48977\"},{\"start\":\"49153\",\"end\":\"49226\"},{\"start\":\"49361\",\"end\":\"49484\"},{\"start\":\"49871\",\"end\":\"49981\"},{\"start\":\"50190\",\"end\":\"50284\"},{\"start\":\"50657\",\"end\":\"50749\"},{\"start\":\"51448\",\"end\":\"51505\"},{\"start\":\"51693\",\"end\":\"51794\"},{\"start\":\"52192\",\"end\":\"52426\"},{\"start\":\"52748\",\"end\":\"52873\"},{\"start\":\"53322\",\"end\":\"53424\"},{\"start\":\"53659\",\"end\":\"53771\"},{\"start\":\"53997\",\"end\":\"54076\"},{\"start\":\"54268\",\"end\":\"54367\"},{\"start\":\"54627\",\"end\":\"54691\"},{\"start\":\"54917\",\"end\":\"55014\"},{\"start\":\"55237\",\"end\":\"55288\"},{\"start\":\"55536\",\"end\":\"55614\"},{\"start\":\"55840\",\"end\":\"55996\"},{\"start\":\"56738\",\"end\":\"56839\"},{\"start\":\"57079\",\"end\":\"57196\"},{\"start\":\"57510\",\"end\":\"57611\"},{\"start\":\"57837\",\"end\":\"57994\"},{\"start\":\"58412\",\"end\":\"58485\"},{\"start\":\"58744\",\"end\":\"58816\"},{\"start\":\"59109\",\"end\":\"59191\"},{\"start\":\"59383\",\"end\":\"59451\"},{\"start\":\"59622\",\"end\":\"59709\"}]", "bib_author": "[{\"start\":\"44882\",\"end\":\"44895\"},{\"start\":\"44895\",\"end\":\"44904\"},{\"start\":\"44904\",\"end\":\"44917\"},{\"start\":\"45134\",\"end\":\"45144\"},{\"start\":\"45144\",\"end\":\"45157\"},{\"start\":\"45296\",\"end\":\"45305\"},{\"start\":\"45305\",\"end\":\"45319\"},{\"start\":\"45516\",\"end\":\"45529\"},{\"start\":\"45529\",\"end\":\"45541\"},{\"start\":\"45793\",\"end\":\"45812\"},{\"start\":\"45812\",\"end\":\"45822\"},{\"start\":\"46075\",\"end\":\"46088\"},{\"start\":\"46088\",\"end\":\"46099\"},{\"start\":\"46327\",\"end\":\"46336\"},{\"start\":\"46336\",\"end\":\"46349\"},{\"start\":\"46349\",\"end\":\"46361\"},{\"start\":\"46361\",\"end\":\"46371\"},{\"start\":\"46371\",\"end\":\"46382\"},{\"start\":\"46382\",\"end\":\"46388\"},{\"start\":\"46388\",\"end\":\"46399\"},{\"start\":\"46399\",\"end\":\"46407\"},{\"start\":\"46671\",\"end\":\"46685\"},{\"start\":\"46685\",\"end\":\"46697\"},{\"start\":\"46697\",\"end\":\"46708\"},{\"start\":\"46708\",\"end\":\"46718\"},{\"start\":\"46969\",\"end\":\"46977\"},{\"start\":\"46977\",\"end\":\"46988\"},{\"start\":\"46988\",\"end\":\"47001\"},{\"start\":\"47251\",\"end\":\"47263\"},{\"start\":\"47263\",\"end\":\"47277\"},{\"start\":\"47589\",\"end\":\"47603\"},{\"start\":\"47603\",\"end\":\"47613\"},{\"start\":\"47613\",\"end\":\"47624\"},{\"start\":\"47944\",\"end\":\"47953\"},{\"start\":\"47953\",\"end\":\"47960\"},{\"start\":\"47960\",\"end\":\"47972\"},{\"start\":\"47972\",\"end\":\"47983\"},{\"start\":\"47983\",\"end\":\"47993\"},{\"start\":\"47993\",\"end\":\"48007\"},{\"start\":\"48341\",\"end\":\"48349\"},{\"start\":\"48349\",\"end\":\"48362\"},{\"start\":\"48362\",\"end\":\"48374\"},{\"start\":\"48374\",\"end\":\"48389\"},{\"start\":\"48389\",\"end\":\"48401\"},{\"start\":\"48695\",\"end\":\"48713\"},{\"start\":\"48713\",\"end\":\"48726\"},{\"start\":\"48726\",\"end\":\"48740\"},{\"start\":\"48979\",\"end\":\"48990\"},{\"start\":\"48990\",\"end\":\"49008\"},{\"start\":\"49008\",\"end\":\"49018\"},{\"start\":\"49228\",\"end\":\"49240\"},{\"start\":\"49486\",\"end\":\"49493\"},{\"start\":\"49493\",\"end\":\"49502\"},{\"start\":\"49502\",\"end\":\"49510\"},{\"start\":\"49510\",\"end\":\"49519\"},{\"start\":\"49519\",\"end\":\"49536\"},{\"start\":\"49536\",\"end\":\"49547\"},{\"start\":\"49547\",\"end\":\"49559\"},{\"start\":\"49559\",\"end\":\"49572\"},{\"start\":\"49572\",\"end\":\"49578\"},{\"start\":\"49578\",\"end\":\"49584\"},{\"start\":\"49983\",\"end\":\"49995\"},{\"start\":\"49995\",\"end\":\"50005\"},{\"start\":\"50286\",\"end\":\"50307\"},{\"start\":\"50307\",\"end\":\"50318\"},{\"start\":\"50318\",\"end\":\"50328\"},{\"start\":\"50328\",\"end\":\"50338\"},{\"start\":\"50338\",\"end\":\"50349\"},{\"start\":\"50751\",\"end\":\"50761\"},{\"start\":\"50761\",\"end\":\"50768\"},{\"start\":\"50768\",\"end\":\"50775\"},{\"start\":\"50775\",\"end\":\"50787\"},{\"start\":\"50787\",\"end\":\"50802\"},{\"start\":\"50802\",\"end\":\"50813\"},{\"start\":\"50813\",\"end\":\"50820\"},{\"start\":\"50820\",\"end\":\"50830\"},{\"start\":\"50830\",\"end\":\"50839\"},{\"start\":\"50839\",\"end\":\"50849\"},{\"start\":\"51276\",\"end\":\"51289\"},{\"start\":\"51289\",\"end\":\"51301\"},{\"start\":\"51301\",\"end\":\"51313\"},{\"start\":\"51507\",\"end\":\"51516\"},{\"start\":\"51516\",\"end\":\"51528\"},{\"start\":\"51528\",\"end\":\"51534\"},{\"start\":\"51796\",\"end\":\"51805\"},{\"start\":\"51805\",\"end\":\"51825\"},{\"start\":\"51825\",\"end\":\"51838\"},{\"start\":\"51838\",\"end\":\"51849\"},{\"start\":\"51849\",\"end\":\"51859\"},{\"start\":\"51859\",\"end\":\"51871\"},{\"start\":\"51871\",\"end\":\"51880\"},{\"start\":\"51880\",\"end\":\"51890\"},{\"start\":\"51890\",\"end\":\"51903\"},{\"start\":\"51903\",\"end\":\"51920\"},{\"start\":\"52428\",\"end\":\"52437\"},{\"start\":\"52437\",\"end\":\"52445\"},{\"start\":\"52875\",\"end\":\"52887\"},{\"start\":\"52887\",\"end\":\"52899\"},{\"start\":\"52899\",\"end\":\"52911\"},{\"start\":\"52911\",\"end\":\"52920\"},{\"start\":\"52920\",\"end\":\"52930\"},{\"start\":\"52930\",\"end\":\"52940\"},{\"start\":\"52940\",\"end\":\"52951\"},{\"start\":\"52951\",\"end\":\"52961\"},{\"start\":\"52961\",\"end\":\"52969\"},{\"start\":\"52969\",\"end\":\"52981\"},{\"start\":\"53426\",\"end\":\"53442\"},{\"start\":\"53442\",\"end\":\"53454\"},{\"start\":\"53454\",\"end\":\"53466\"},{\"start\":\"53773\",\"end\":\"53784\"},{\"start\":\"53784\",\"end\":\"53797\"},{\"start\":\"54078\",\"end\":\"54088\"},{\"start\":\"54088\",\"end\":\"54096\"},{\"start\":\"54096\",\"end\":\"54107\"},{\"start\":\"54369\",\"end\":\"54384\"},{\"start\":\"54384\",\"end\":\"54399\"},{\"start\":\"54399\",\"end\":\"54410\"},{\"start\":\"54410\",\"end\":\"54422\"},{\"start\":\"54693\",\"end\":\"54705\"},{\"start\":\"54705\",\"end\":\"54715\"},{\"start\":\"54715\",\"end\":\"54726\"},{\"start\":\"54726\",\"end\":\"54738\"},{\"start\":\"54738\",\"end\":\"54749\"},{\"start\":\"55016\",\"end\":\"55024\"},{\"start\":\"55024\",\"end\":\"55030\"},{\"start\":\"55030\",\"end\":\"55036\"},{\"start\":\"55036\",\"end\":\"55042\"},{\"start\":\"55042\",\"end\":\"55052\"},{\"start\":\"55290\",\"end\":\"55302\"},{\"start\":\"55302\",\"end\":\"55313\"},{\"start\":\"55313\",\"end\":\"55325\"},{\"start\":\"55325\",\"end\":\"55338\"},{\"start\":\"55338\",\"end\":\"55347\"},{\"start\":\"55347\",\"end\":\"55362\"},{\"start\":\"55616\",\"end\":\"55627\"},{\"start\":\"55627\",\"end\":\"55641\"},{\"start\":\"55641\",\"end\":\"55653\"},{\"start\":\"55653\",\"end\":\"55663\"},{\"start\":\"55998\",\"end\":\"56007\"},{\"start\":\"56007\",\"end\":\"56014\"},{\"start\":\"56014\",\"end\":\"56026\"},{\"start\":\"56026\",\"end\":\"56037\"},{\"start\":\"56037\",\"end\":\"56050\"},{\"start\":\"56050\",\"end\":\"56064\"},{\"start\":\"56505\",\"end\":\"56512\"},{\"start\":\"56512\",\"end\":\"56520\"},{\"start\":\"56520\",\"end\":\"56528\"},{\"start\":\"56841\",\"end\":\"56851\"},{\"start\":\"56851\",\"end\":\"56861\"},{\"start\":\"56861\",\"end\":\"56874\"},{\"start\":\"56874\",\"end\":\"56885\"},{\"start\":\"57198\",\"end\":\"57208\"},{\"start\":\"57208\",\"end\":\"57218\"},{\"start\":\"57218\",\"end\":\"57232\"},{\"start\":\"57232\",\"end\":\"57243\"},{\"start\":\"57613\",\"end\":\"57622\"},{\"start\":\"57996\",\"end\":\"58005\"},{\"start\":\"58005\",\"end\":\"58016\"},{\"start\":\"58016\",\"end\":\"58027\"},{\"start\":\"58027\",\"end\":\"58039\"},{\"start\":\"58039\",\"end\":\"58049\"},{\"start\":\"58049\",\"end\":\"58060\"},{\"start\":\"58060\",\"end\":\"58069\"},{\"start\":\"58069\",\"end\":\"58079\"},{\"start\":\"58079\",\"end\":\"58089\"},{\"start\":\"58089\",\"end\":\"58098\"},{\"start\":\"58487\",\"end\":\"58502\"},{\"start\":\"58502\",\"end\":\"58515\"},{\"start\":\"58515\",\"end\":\"58523\"},{\"start\":\"58523\",\"end\":\"58533\"},{\"start\":\"58533\",\"end\":\"58541\"},{\"start\":\"58541\",\"end\":\"58550\"},{\"start\":\"58818\",\"end\":\"58827\"},{\"start\":\"58827\",\"end\":\"58837\"},{\"start\":\"58837\",\"end\":\"58848\"},{\"start\":\"58848\",\"end\":\"58860\"},{\"start\":\"58860\",\"end\":\"58871\"},{\"start\":\"58871\",\"end\":\"58878\"},{\"start\":\"58878\",\"end\":\"58890\"},{\"start\":\"58890\",\"end\":\"58900\"},{\"start\":\"59193\",\"end\":\"59203\"},{\"start\":\"59203\",\"end\":\"59214\"},{\"start\":\"59453\",\"end\":\"59466\"},{\"start\":\"59466\",\"end\":\"59486\"},{\"start\":\"59711\",\"end\":\"59722\"},{\"start\":\"59722\",\"end\":\"59735\"}]", "bib_venue": "[{\"start\":\"44917\",\"end\":\"44930\"},{\"start\":\"45157\",\"end\":\"45171\"},{\"start\":\"45319\",\"end\":\"45345\"},{\"start\":\"45541\",\"end\":\"45555\"},{\"start\":\"45822\",\"end\":\"45839\"},{\"start\":\"46099\",\"end\":\"46109\"},{\"start\":\"46407\",\"end\":\"46417\"},{\"start\":\"46718\",\"end\":\"46732\"},{\"start\":\"47001\",\"end\":\"47005\"},{\"start\":\"47277\",\"end\":\"47291\"},{\"start\":\"47624\",\"end\":\"47634\"},{\"start\":\"48007\",\"end\":\"48022\"},{\"start\":\"48401\",\"end\":\"48415\"},{\"start\":\"48740\",\"end\":\"48755\"},{\"start\":\"49018\",\"end\":\"49021\"},{\"start\":\"49240\",\"end\":\"49245\"},{\"start\":\"49584\",\"end\":\"49602\"},{\"start\":\"50005\",\"end\":\"50018\"},{\"start\":\"50349\",\"end\":\"50411\"},{\"start\":\"50849\",\"end\":\"50911\"},{\"start\":\"51200\",\"end\":\"51274\"},{\"start\":\"51534\",\"end\":\"51557\"},{\"start\":\"51920\",\"end\":\"51932\"},{\"start\":\"52445\",\"end\":\"52453\"},{\"start\":\"52981\",\"end\":\"53020\"},{\"start\":\"53466\",\"end\":\"53475\"},{\"start\":\"53797\",\"end\":\"53815\"},{\"start\":\"54107\",\"end\":\"54121\"},{\"start\":\"54422\",\"end\":\"54436\"},{\"start\":\"54749\",\"end\":\"54759\"},{\"start\":\"55052\",\"end\":\"55064\"},{\"start\":\"55362\",\"end\":\"55375\"},{\"start\":\"55663\",\"end\":\"55676\"},{\"start\":\"56064\",\"end\":\"56072\"},{\"start\":\"56335\",\"end\":\"56503\"},{\"start\":\"56885\",\"end\":\"56897\"},{\"start\":\"57243\",\"end\":\"57282\"},{\"start\":\"57622\",\"end\":\"57661\"},{\"start\":\"58098\",\"end\":\"58111\"},{\"start\":\"58550\",\"end\":\"58565\"},{\"start\":\"58900\",\"end\":\"58913\"},{\"start\":\"59214\",\"end\":\"59227\"},{\"start\":\"59486\",\"end\":\"59490\"},{\"start\":\"59735\",\"end\":\"59739\"},{\"start\":\"59882\",\"end\":\"59898\"},{\"start\":\"59918\",\"end\":\"60035\"}]"}}}, "year": 2023, "month": 12, "day": 17}