{"id": 211109939, "updated": "2023-11-08 03:29:25.222", "metadata": {"title": "A Bayesian machine scientist to aid in the solution of challenging scientific problems", "authors": "[{\"first\":\"Roger\",\"last\":\"Guimerà\",\"middle\":[]},{\"first\":\"Ignasi\",\"last\":\"Reichardt\",\"middle\":[]},{\"first\":\"Antoni\",\"last\":\"Aguilar-Mogas\",\"middle\":[]},{\"first\":\"Francesco\",\"last\":\"Massucci\",\"middle\":[\"A.\"]},{\"first\":\"Manuel\",\"last\":\"Miranda\",\"middle\":[]},{\"first\":\"Jordi\",\"last\":\"Pallarès\",\"middle\":[]},{\"first\":\"Marta\",\"last\":\"Sales-Pardo\",\"middle\":[]}]", "venue": "Science Advances", "journal": "Science Advances", "publication_date": {"year": 2020, "month": 1, "day": 1}, "abstract": "A Bayesian machine scientist uncovers closed-form mathematical models from data.", "fields_of_study": "[\"Computer Science\",\"Physics\",\"Mathematics\"]", "external_ids": {"arxiv": "2004.12157", "mag": "3099800717", "acl": null, "pubmed": "32064326", "pubmedcentral": "6994216", "dblp": "journals/corr/abs-2004-12157", "doi": "10.1126/sciadv.aav6971"}}, "content": {"source": {"pdf_hash": "07c0c9c5851c7000ee6a6cbc276099a3aa4590ad", "pdf_src": "PubMedCentral", "pdf_uri": null, "oa_url_match": false, "oa_info": {"license": "CCBYNC", "open_access_url": "https://advances.sciencemag.org/content/advances/6/5/eaav6971.full.pdf", "status": "GOLD"}}, "grobid": {"id": "7b751de122ab0dfbf60ca47cf4dac5ee0d9d2165", "type": "plain-text", "url": "s3://ai2-s2-pdf-extraction-prod/parse-results/s2orc_worker/07c0c9c5851c7000ee6a6cbc276099a3aa4590ad.txt", "contents": "\nA Bayesian machine scientist to aid in the solution of challenging scientific problems\n\n\nRoger Guimerà \nIgnasi Reichardt \nAntoni Aguilar-Mogas \nFrancesco A Massucci \nManuel Miranda \nJordi Pallarès \nMarta Sales-Pardo \nA Bayesian machine scientist to aid in the solution of challenging scientific problems\nN E T W O R K S C I E N C E for the Advancement of Science. No claim to original U.S. Government Works. Distributed under a Creative Commons Attribution NonCommercial License 4.0 (CC BY-NC).\nClosed-form, interpretable mathematical models have been instrumental for advancing our understanding of the world; with the data revolution, we may now be in a position to uncover new such models for many systems from physics to the social sciences. However, to deal with increasing amounts of data, we need \"machine scientists\" that are able to extract these models automatically from data. Here, we introduce a Bayesian machine scientist, which establishes the plausibility of models using explicit approximations to the exact marginal posterior over models and establishes its prior expectations about models by learning from a large empirical corpus of mathematical expressions. It explores the space of models using Markov chain Monte Carlo. We show that this approach uncovers accurate models for synthetic and real data and provides out-of-sample predictions that are more accurate than those of existing approaches and of other nonparametric methods.\n\nINTRODUCTION\n\nSince the scientific revolution, interpretable closed-form mathematical models have been instrumental for advancing our understanding of the world. Think, for example, of Newton's law of gravitation and how it has enabled us to predict astronomical phenomena with great accuracy and, perhaps more importantly, to interpret seemingly unrelated physical phenomena. With the data revolution, we may now be in a position to uncover closed-form, interpretable mathematical models of natural and even socioeconomic systems that were previously not amenable to quantitative analysis.\n\nTo be able to do this, however, we need to develop algorithms for automatically identifying these models (1)(2)(3)(4). Following Evans and Rzhetsky, here, we call these algorithms, which would assist human scientists, \"machine scientists\" (2).\n\nAttempts to design machine scientists date back to, at least, the 1970s and have led to very successful approaches in recent years. One of these approaches is based on genetic programming (5,6). In this approach, closed-form mathematical expressions are represented as graphs, and, given a goodness-of-fit metric, populations of expressions are created and evolved in such a way that high-fitness expressions are selected for further exploration. Another successful approach is based on sparse regression (7)(8)(9)(10)(11). In this approach, closed-form mathematical models are assumed to be linear combinations of some (linear or nonlinear) \"basis functions\" of the independent variables, and sparse regression is used to select and weigh the relevant basis functions. This approach is particularly suited to learn differential equations (8)(9)(10)(11), whose form often follows the assumption of linearity on relatively simple basis functions. For more general situations, sparse regression can be combined with genetic programs that automatically generate the basis functions, thus relaxing the need to know them a priori (12,13).\n\nDespite this remarkable progress, machine scientists have stumbled upon two major challenges. First, algorithms must balance goodness of fit and model complexity, thus avoiding overfitting. In general, this issue is dealt with by defining model complexity heuristically and then applying model selection criteria to the models that lay on the fit-complexity Pareto front. Both the definition of complexity and the choice of model-selection criterion are, however, hard to generalize and systematize. Second, machine scientists should, in principle, explore an arbitrarily large space of closed-form mathematical models. This is typically addressed by using methods such as genetic programming, which have no guarantees of actually exploring the best models more frequently; or by restricting the search space, for example, to linear combinations of the basis functions in sparse regression approaches, thus leaving out potentially valid models.\n\nHere, we propose a Bayesian approach to the definition of machine scientists. To address the fit-complexity trade-off, we obtain the posterior probability of each expression from basic probabilistic arguments and explicit approximations. The posterior, which leads to consistent model selection, naturally combines the goodness of fit and a prior over expressions that accounts for model complexity. To establish the prior over expressions, we compile a corpus of closed-form mathematical models from Wikipedia and then use a maximum entropy approach to formalize a prior that is statistically consistent with the corpus (14). To address the challenges related to the exploration of the space of closed-form mathematical expressions, we introduce a Markov chain Monte Carlo (MCMC) algorithm that samples from the posterior over expressions. We demonstrate that the Bayesian machine scientist successfully recovers the true generating model when fed with synthetic data, even in situations in which state-of-the-art machine scientists fail (4). We also demonstrate that the machine is able to uncover accurate, closed-form mathematical models for systems for which no closedform model has agreed on. Last, we find that the machine scientist provides out-of-sample predictions that are more accurate than those of other machine scientists and of standard nonparametric machine learning approaches, such as Gaussian processes (15).\n\n\nRESULTS\n\nBayesian formulation of the problem and expression plausibility Let us first formalize the problem in probabilistic terms. Consider a property y that can be expressed as an unknown, closed-form mathematical function y = F(x, q) of K variables x = {x 1 , …, x K } and L parameters q ∈ R L [for example, y = sin (q 1 x 1 ) or y = q 1 x 1 + q 2 x 2 ]. Given some data D = {(y 1 , x 1 ), …, (y N , x N )}, and assuming that the measurements have some experimental error y k = F(x k , q) + D k , the Bayesian machine scientist assigns to each possible closed-form mathematical expression f i a plausibility p( f i |D) given by the marginal posterior\npð f i |DÞ ¼ 1 Z ∫ Q i dq i pðD|f i ; q i Þ pðq i |f i Þ pð f i Þ ¼ exp ½ÀLð f i Þ Z ð1Þ\nwhere q i are the parameters associated with expression f i , the integral is over the space Q i of possible values of these parameters, Z = p(D) does not depend on f i , and p( f i ) is the prior over expressions.\n\nThe quantity\nLð f i Þ ≡ À log ½pðD; f i Þ ¼ Àlog ∫ Q i dq i pðD|f i ; q i Þ pðq i |f i Þ pð f i Þ h ið2Þ\nis the description length of model f i , that is, the number of nats needed to jointly encode the data and the model with an optimal code (16). Although in general the description length cannot be calculated exactly, it can be approximated in a number of ways (17,18); here, we take one of the simplest approximations\nLð f i Þ ≈ Bð f i Þ 2 À log pð f i Þ ð 3Þ\nwhere B( f i ) is the Bayesian information criterion (BIC) of expression f i and can be readily calculated from the data (Supplementary text S1) (11,17). This is a first-order approximation to the description length and holds when the likelihood p(D|f i , q i ) is peaked around the maximum likelihood parameters q * i and the prior is smooth in this region; when the number of experimental points is small, the approximation may fail, and one would need to get more precise estimates of the description length such as the generalized BIC (19) or even calculate numerically the integral over the parameters. Beyond these potential limitations, Eqs. 1 to 3 naturally combine the goodness of fit of a model and its structural complexity, which is captured by the prior over expressions. In addition, in the limit of large datasets, we have |B( f i )| ≫ |log p( f i )|; since B( f i ) is consistent, the machine scientist is also consistent, that is, in this limit it prefers the correct expression over any other expression with probability approaching 1.\n\nSampling from the posterior distribution over expressions The Bayesian machine scientist explores the space of closed-form mathematical expressions using MCMC. In particular, we introduce three move types that enable one to go from any closed-form expression to any other closed-form expression, thus enabling the machine scientist to explore, given enough time, the whole space of closed-form mathematical expressions (Materials and Methods) (Fig. 1). Regardless of the frequency of each move and other parameters of the Markov chain, MCMC samples expressions f i from the stationary distribution p( f i |D) (fig. S1). Although MCMC is slower than some alternative machine scientists that put emphasis on speed, such as evolutionary feature synthesis (EFS), the only dependency on the number of data points is in the estimation of the BIC of each model, and therefore its complexity scales as any other method using least squares to fit model parameters.\n\nFor model selection, the Bayesian machine scientist can use the most plausible expression from an MCMC run, that is, the maximum a posteriori (or minimum description length) expression. However, MCMC naturally samples over the whole space of models, thus generating arbitrarily long sequences of expressions; as we show below, this leads to a more complete characterization of the expression space and to higher out-of-sample prediction accuracy.\n\nEstimation of prior probabilities using a corpus of mathematical expressions For the Bayesian machine scientist to be able to estimate the plausibility of a given expression, it needs to estimate the prior probabilities p( f i ). A common approach in model selection is to have no a priori preference for any given model over the others and assume that p( f i ) is the same for all models (17,18). In that case, and within our approximation for the description length, the most plausible model is simply the one with the lowest BIC. This is a consistent approach and generally reasonable when comparing a small number of simple models. However, it is inappropriate when considering a finite dataset and a very large (potentially infinite) space of mathematical expressions because one can always find a very complex model that fits the data arbitrarily well even with very few parameters. These unnecessarily complex models are likely to generalize very poorly in the same way that models with many parameters do-this structural overfitting is thus akin to traditional overfitting but arises from the large number of mathematical models considered rather than the large number of parameters (Supplementary text S4 and fig. S5). From this perspective, the prior over expressions acts as a model regularizer. It would also be possible to add other regularizers to expression trees, but, within our Bayesian framework, tree regularizers could still be cast as nonuniform priors, although they may be formally more complex and harder to interpret than the ones that we introduce below.\n\nGiven these considerations, the machine scientist needs to \"learn\" the a priori plausibility of models. Human scientists obtain this prior knowledge by studying science books and becoming familiar with the mathematical expressions that appear in them. We take a similar empirical approach to define the prior expectations of the machine scientist-we compiled a corpus of 4080 mathematical expressions that are included in Wikipedia entries (Materials and Methods)and use these expressions to shape the prior expectations of the machine scientist, that is, to establish the statistical properties expected a priori for expressions (Fig. 2). To do this, we use an approach based on exponential random graphs (20)(21)(22)(23). In particular, we choose a prior that generates expressions with the same average number of each type of operation [and their squares (23,24)] as in the empirical corpus and, given this constraint, satisfies the maximum entropy principle (14, 23) (Materials and Methods; Supplementary text S2, fig. S2, and tables S3 and S4). As we show in Fig. 2, this prior generates mathematical expressions statistically consistent with the corpus. Note that the Bayesian machine scientist is not restricted to the 4080 expressions in the corpus, or even to arbitrary combinations of these expressions-all closed-form mathematical expressions are valid and can be visited by the MCMC; those that are statistically similar to the corpus are simply more plausible a priori. Note also that, as mentioned earlier, for large amounts of data, the prior washes out and the description length, as approximated in Eq. 3, is consistent regardless of the selection of prior.\n\nValidation of the Bayesian machine scientist with synthetic data Having addressed the methodological challenges in the definition of the Bayesian machine scientist, we next demonstrate the ways in which it can be used and illustrate how one can get insights by using it. First, we test that, when fed with synthetic data, the machine scientist recovers the models that truly generated the data. We start by selecting an arbitrary expression and setting its parameters to values uniformly selected from [−2, 2]. The selected expression (Fig. 3) is F(x 1 ,x 2 ; q 1 ,q 2 ) = x 1 (q 1 + x 2 ) cos(x 1 )/[q 2 log(q 2 )], with q 1 = −1.19 and q 2 = 0.29. Note that this expression is not one of the expressions present in our empirical corpus.\n\nWe then feed the machine scientist with 400 noisy data points generated using this expression. The Bayesian machine scientist finds the correct model and assigns to it the maximum plausibility or, equivalently, the minimum description length (Fig. 3). To evaluate to which extent it is remarkable that the Bayesian machine scientist finds the correct model in this situation, we attempt the same task with stateof-the-art machine scientists (4), including two methods based on genetic programing [Eureqa (5) and D-lexicase selection (EPLEX) (6)] and a method that combines genetic programming with sparse regression (Materials and Methods) [EFS; (13)]. We find that, from the same dataset, none of these methods are able to recover the correct model and that they tend to structurally overfit the data (Supplementary text S3).\n\nThe ability of the Bayesian machine scientist (and of any other method) to identify the correct model requires a minimum amount of data points. We find that, for this synthetic dataset, and even though the other approaches do not identify the correct expression with 400 points, the Bayesian machine recovers the true model with as few as 100 points (Supplementary text S3 and fig. S3).\n\nNext, we investigate whether the machine is able to recover the differential equations that govern the Rössler system (25), and what is the effect of increasing observational noise in the equation discovery process. Since we are mostly interested in the effect of increasing noise in the target variable, we assume that the only measurement error is in the derivatives, although in some real situations derivatives may need to be estimated numerically from noisy measurements of the variables. In those situations, it may be necessary to use advanced techniques to estimate the derivatives (26). Under the conditions of our experiment, we find that the machine is able to recover the correct differential equations when the derivatives are measured with moderate noise (Fig. 4). When the measurement noise is high, the true expressions are still regarded as very plausible, but the machine identifies as the most plausible ones expressions that are \"regularized\" versions of the exact models. In these regularized models, small terms are disregarded; in all 1 2  Fig. 1. MCMC to systematically explore the space of closed-form mathematical expressions. (A) Closed-form mathematical expressions can be represented as trees, whose internal nodes are functions (operations) and whose leaves are variables and parameters. To explore the space of mathematical expressions, we implemented three move types (Materials and Methods): (i) root addition/removal-we added/removed the root of the tree; (ii) elementary tree replacement (we define an elementary tree as a subtree containing, at most, one function)-we replaced one elementary tree by another (for example, c 1 x by x); (iii) node replacement-we replaced one node (function, variable, or parameter) by another. Each of these moves was proposed with a certain frequency and accepted or rejected using the Metropolis' rule (Materials and Methods) (36). (B) To validate the MCMC, we explored the space of all expressions with one variable, one parameter and using only the functions {+, sin}. For this experiment only, we restricted the size of the expression tree to be smaller than eight nodes, and we assume that all expressions are equally plausible a priori, p(f i ) = const. Each node in the network represents a different expression, and links represent jumps from one expression to another resulting from the MCMC moves described in (A). The size of each node is proportional to the number of times they are visited by the MCMC. In the absence of data, the MCMC explores all possible expressions with equal probability. (C) We generated synthetic data with the expression y = a + x + sin (x), to which we added noise (circles). We show how the correct expression and two closely related expressions fit the data. (D) We explored the same space as in (B) but considering the synthetic data in (C). When data are taken into account, expressions that are more plausible given the data are visited more frequently (larger nodes), and many expressions are too implausible and, therefore, not visited at all (fig. S1). The color of each node corresponds to the color of the curves in (C).\nc 1 + x c 1 + x + sin(x) c 1 + x + sin(sin(x)) B D A\ncases, the most plausible models are almost indistinguishable from the true ones ( fig. S4). Thus, as expected, the machine scientist automatically adjusts the complexity of the models to the quality of the data (Supplementary text S4). Again, these results stand in contrast to those of alternative machine scientists [with the exception of pure sparse regression methods particularly suited to reverse-engineer differential equations (8)(9)(10)(11), which would be able to recover the true expressions, at least in the case with low noise]. Even for the simplest case in this experiment (inference ofẋ with a low level of noise), all benchmark machine scientists fail to recover the true model and tend to overfit structurally (Supplementary text S4). Last, we test the behavior of the machine scientist when presented with data that are generated from a model that does not have a closedform mathematical expression in terms of the basic functions that it uses. In particular, we generate synthetic data using Bessel functions J a (x) with a ∈ {0, 1, 2, 3, 4}. We find that the machine scientist is able to identify closed-form expressions that are as accurate as high-order Taylor expansions of the exact functions. We also find that, when the synthetic data are noisy and the machine scientist is restricted to choose among low-order series expansions, it consecutively chooses firstorder, second-order, or third-order expansions, as the range of observed data increases and as the noise decreases, as one would expect (Supplementary text S5 and fig. S6).\n\nUse of the machine scientist on small datasets and on the Nikuradse dataset Next, we turn to the analysis of real datasets. First, we analyze how the machine scientist provides insights into problems for which there are scarce and noisy data. We focus on three datasets that have been the subject of recent analyses and for which models have been proposed: a dataset on funding success in different European countries (27); a dataset on cell-to-cell stresses (28); and a dataset on stocks of salmon in the Fraser River in British Columbia, Canada (29).\n\nFor each of these three datasets, we compare existing models to models identified by the machine scientist in terms of their plausibility p( f i |D), their BIC B( f i ), and their cross-validation error (Supplementary text S6 and tables S5 to S7). In all cases, the machine scientist identifies at least one model that is better than existing models in a Pareto sense, namely, better in at least one of the three performance metrics without being worse in any of the others.\n\nLast, we show in more detail how the machine scientist can help us to solve major open scientific problems. For this, we focus on the classical experiment of turbulent friction in rough pipes performed in the early 1930s by Johann Nikuradse (30)(31)(32)(33). In his experiments, Nikuradse measured the turbulent friction l as a function of the roughness x D of the pipe and the Reynolds number x R . We take the original Nikuradse dataset and feed it to the machine scientist to study possible analytical expressions for the turbulent friction. A typical MCMC run uncovers numerous expressions that fit all observed data remarkably well (Fig. 5, A and B). We compare these expressions to the best expressions uncovered by other machine scientists (Materials and Methods): Eureqa (5), EFS (13), and EPLEX (6) (see Supplementary text S7 and fig. S10 for EPLEX). The expressions uncovered by the Bayesian machine scientist fit the Nikuradse dataset better than those uncovered by Eureqa, which, in turn, is significantly better than all other benchmark methods.\n\nThe Bayesian machine scientist does not find any candidate expression that is overwhelmingly more plausible than all the others; rather, it uncovers a collection of similarly plausible models. This has two important implications. First, it points toward the need to revisit our tendency to look for single \"best models\" from data. Second, it suggests that, when using the machine scientist to make predictions, we should average over the whole ensemble of plausible models (34,35). In particular, the posterior predictive distribution for a point y k can be approximated as\npðy k |D; x k Þ ≈ ∑ i d y k À f i ðx k ; q * i Þ À Á pð f i |DÞ ð 4Þ\nwhereq * i is the maximum likelihood estimator of f i 's parameters, d(x) is the Dirac delta function, and the sum runs over all possible expressions f i . Note that estimating the posterior predictive distribution in this way makes interpretation of the predictions harder-even if each model f i is interpretable, averaging leads to a noninterpretable effective model. However, it is important to point out that this is the most comprehensive approach possible, in the sense that, even if one is certain that the data were generated with a single, unknown model F, the best predictive distribution comes from taking all models into consideration, each weighted by its plausibility p( f i |D) (34).\n\nIn practice, the average over models can be computed using the MCMC sample collected by the machine scientist, and we can use the median of the posterior distribution p(y k |D; x k ) to make predictions for y k that minimize the mean absolute predictive error. By considering, among all sampled models, the one that most resembles this median prediction, we obtain a single closed-form mathematical model that is optimally predictive-we call this model the median predictive model. To test the predictive power of the median predictive  Fig. 3. Recovery of an arbitrary expression from synthetic data. We drew an expression with two variables (x 1 and x 2 ) and two parameters (q 1 and q 2 ) from the prior distribution p(f i ); the drawn function is F(x 1 ,x 2 ; q 1 ,q 2 ) = x 1 (q 1 + x 2 ) cos (x 1 )/[q 2 log (q 2 )], with q 1 = −1.19 and q 2 = 0.29. With this function, we generated 400 synthetic points y k ¼ Fðx k 1 , x k 2 ; q 1 ,q 2 Þ þ e k , with ðx k 1 ,x k 2 Þ uniformly chosen in [−2,2] 2 , and e ∼ N(0,1) normally distributed [points in (A) and (D) to (G); the color of the points corresponds to the value of y as indicated by the color bar]. We fed these synthetic data to the Bayesian machine scientist and run 2500 steps of the MCMC algorithm. (A) After 2500 steps, the most plausible model identified (blue surface) is f(x 1 , x 2 ; q 1 , q 2 ) = x 1 (c 1 + c 2 x 2 ) cos x 1 , which coincides with the correct model up to indeterminacies in the dependency on the parameters that cannot be resolved without varying their values (see movie S1 for the complete evolution of the MCMC). (B) The blue line indicates the evolution of the description length L during the MCMC (up to an irrelevant additive constant that comes from the prior normalization and therefore affects all points equally). Lower description lengths correspond to more plausible models. The MCMC starts from an expression with high description length, but after 1000 to 1500 steps, it equilibrates and samples from the stationary distribution p(f i |D). (C) The blue line indicates the evolution of the mean absolute error of each model sampled by the MCMC with respect to the true model. The error is calculated over a grid in [−2,2] 2 , that is, not at the observed points. (D to G) The MCMC is prone to getting trapped in local maxima of the plausibility (local minima of the description length). To explore the expression space more efficiently, we used parallel tempering (38), a technique used in statistical physics to study disordered systems with rugged energy landscapes (Materials and Methods). Besides the main MCMC in (A), parallel tempering keeps a number of parallel MCMCs that sample the distributions p(f i ,T k ) º exp [−B(f i )/2T k + log p(f i )] parametrized by \"temperatures\" T k (Materials and Methods). In our case, higher temperatures correspond to simpler expressions. At each MCMC step, we attempted a swap of expressions at contiguous T k using Metropolis' rule. The evolution of the description length and the mean absolute error of the parallel MCMCs are represented in (B) and (C) with the same colors as in (D) to (G). model in the Nikuradse dataset, we compare it to the alternative machine scientists (Eureqa, EPLEX, and EFS), as well as to a standard nonparametric Bayesian approach, Gaussian processes (15). In particular, we test the ability of all approaches to generalize to data never seen before (Fig. 5, C and D). We find that the predictions of the Bayesian machine scientist are significantly more accurate than those of all alternative approaches.\n\nThe median predictive model, being a function of the roughness only for large Reynolds numbers, also predicts the expected limiting scaling for the turbulent friction (Fig. 5, E and F), which is remarkable considering that (i) most of the observed data correspond to a regime with different physics (31) and (ii) many of the sampled models do not scale correctly (fig. S9). Last, to fully exploit the potential of the machine scientist to obtain interpretable models of turbulent friction, we use it in combination with the known physics of the problem. In 1933, Prandtl suggested that the functionl ¼ ð100lÞ À1=2 À 2log D=r should be a universal function depending only on the so-called roughness Reynolds number k þ s ðRe; r=DÞ (30,33). We use the machine scientist to obtain the most plausible form for such universal function and getl ¼ 1:73 þ 0:64 Â 0:96 k þ s À 2:62 Â 0:64 k þ s (Fig. 5G); this very simple model on the scaled variable does indeed provide an excellent fit to the original (unscaled) data (Fig. 5H).\n\n\nDISCUSSION\n\nIn the age of data, there is a pressing need to design algorithms capable of helping in the scientific process, from assisting in the proof of theorems to parsing scientific texts. Discovering closed-form mathematical models was one of the earliest tasks attempted, and yet, despite much progress in the area, two related difficulties have arisen repeatedly-deciding what is the correct balance between goodness of fit and model complexity and searching systematically through the space of models. These are fundamental difficulties that stem from the nature of the problem that we aim to solve, and, therefore, no approach can possibly avoid them completely-one cannot establish an assumption-free measure of model complexity that serves all purposes or make the search space small without risking to leave out valid models or even the true generating model. However, the Bayesian approach that we have introduced here forces us to be explicit and transparent about all the necessary assumptions and approximations to deal with these challenges. With regard to the fit-complexity trade-off, model complexity enters through our prior expectations about expressions. The use of an empirical corpus is somewhat arbitrary, and one may need to tune the corpus to the problem at hand; but it is reasonable to expect that, lacking any data, the machine scientist should propose models that statistically resemble existing phenomenological models in the literature. With our maximum entropy approach, we guarantee that the prior distribution is the most agnostic distribution satisfying this constraint. Besides, our approach makes it clear that, given enough data, prior expectations become irrelevant, and the machine scientist will consistently prefer the true model with probability approaching 1. With regard to the search through the space of models, MCMC guarantees that, asymptotically (that is, given enough data and time), the Bayesian machine scientist samples from the posterior distribution and, because it is consistent, visits the true model with the highest frequency.\n\nDespite these advantages, our approach is not, of course, exempt of difficulties, the most pressing of which we have already pointed out. First, despite the virtues of MCMC for sampling the expression space, it may be necessary to develop more efficient approaches for very large datasets, without losing the guarantees provided by MCMC. Evidence for the need for these approaches would come from the observation that different MCMC runs on the same dataset result in different description length distributions, which would indicate that the stationary posterior is not being sampled correctly. Alternatives to sampling the full posterior using MCMC may range from Bayesian inference methods such as variational approximations to mathematical optimization methods, if suitable representations of the problem can be found and we are content with obtaining a single model and some bounds to its optimality. Second, it may be desirable to develop and compare other approaches to setting priors for expressions, perhaps based on noninformative priors or symmetry considerations, or empirical approaches different from the one that we have adopted here. A situation in which this need would be obvious is when the proposed models clearly violate some basic features of the desired solution, such as some particular limiting behavior or dimensional consistency. If such additional information is available, then it would be appropriate to formalize it in the prior. Last, in some situations involving small datasets and leading to broad likelihoods in parameter space, it may be necessary to use approximations to the description length that are more accurate than those based on the BIC, for example, the generalized BIC (18). However, this problem would be more difficult to diagnose in a practical situation because, even for a single dataset, the BIC can be a good approximation for some models but not for others. In any case, situations in which the BIC is a poor approximation are likely to involve small or very noisy datasets, situations in which the importance of the BIC is relatively small compared to that of the prior and simple models will be sampled anyway.\n\nThese challenges notwithstanding, our results suggest that, in practice, the Bayesian machine scientist is able to uncover models that are \n\n\nS C I E N C E A D V A N C E S | R E S E A R C H A R T I C L E\n\ngood in terms of both describing the observed data and predicting new data. Our approach can also be used in other contexts, for example when a phenomenological model has been proposed from data, and we aim to find whether there are other models that are more plausible or, at least, similarly plausible. Or, given two conflicting theories for the same process, the Bayesian machine scientist could be used to establish which one is more plausible and to what extent, and whether there exist other reasonable models. From a broader perspective, our approach sets the basis for further developing theories of model discoverability: Is it always possible to identify the correct model given the data? And if not, then under which conditions is the true model discoverable? In addition, our approach opens the door to addressing fundamental questions related to the limits of predictability for mathematical models: To what extent can a system be accurately predicted? Are closed-form, interpretable models as expressive as machine learning models such as deep neural networks? And if so, why? These are all important questions whose answer may lead to significant new insights about the scientific process and about our capacity to understand and describe the world using mathematics.\n\n\nMATERIALS AND METHODS\n\n\nMCMC moves for mathematical expression sampling\n\nTo perform a systematic exploration of the space of closed-form mathematical expressions, we represented closed-form mathematical expressions as expression trees. In these trees, internal nodes represent operations (for example, sum or exponential) and leaves represent variables or parameters (Fig. 1). To avoid problems with improper priors, we limited the size of expressions trees to 50 nodes. Although, in principle, one could make this number arbitrarily large, all parameter values and results in the paper are obtained using this value.\n\nWe classified the nodes of the expression tree based on the number of offspring that they have. Leaves (variables and parameters) have no offspring, whereas operations can have one offspring (operations that take only one argument, like the exponential function) or two offspring (operations that take two arguments, such as the sum). In table S1, we list all the operations that the machine scientist uses for building models.\n\nAn elementary tree (ET) is an expression tree (thus, a mathematical expression) that contains at most one operation. For the implementation of the Markov chain, we used a variety of moves (described in detail below) that operate by adding, removing, replacing, or modifying ETs. We call those ETs whose operation has k offspring k-ET. For example, x + a is a 2-ET (because the sum has two offspring: x and a), sin x is a 1-ET (because the sine function has a single offspring: x), and x is a 0-ET. Expressions such as sin(x + a) are not ETs because they contain more than one operation.\n\nWe designed an MCMC algorithm to sample expressions from the posterior distribution p(f i |D), which gives the plausibility of an expression given the observed data. This distribution is given by Eq. 3. We used three types of move to update mathematical expressions (Fig. 1): 1) Node replacement. We replaced a node in the expression tree (selected uniformly at random among all nodes in the tree) by a randomly selected node, with the only restriction that the replacement must have the same number of offspring as the original node (for example, a \"+\" node can be replaced by a \"*\" node but not by an \"exp\" node). The offspring branches remain unchanged.\n\n2) Root addition (RA). We added a new root to the expression tree. The new root can be any operation. If the operation takes one off-spring, then the old expression tree becomes the offspring of the new root; otherwise, the old expression tree becomes the leftmost offspring of the operation, with the other offspring being randomly chosen 0-ETs (that is, variables or parameters). To be more precise, at the beginning of a sampling process, all possible replacement roots are enumerated (all operations with all possible 0-ET offspring in all positions other than the leftmost branch, which is left empty); when a RA is attempted, the new root is chosen uniformly among this list of candidates. The reverse move, root removal (RR), consists of removing the root of the expression tree and all its offspring except for the leftmost branch, which becomes the new expression tree. RR is only possible when all branches except the leftmost one are 0-ETs.\n\n3) Elementary tree replacement (ETR). We replaced a randomly selected ET in the complete expression tree by another randomly selected ET. At the beginning of a sampling process, all possible ETs are enumerated (all operations with all possible 0-ET offspring). In each move, an ET (chosen uniformly at random among all ETs in the expression tree) is replaced by an ET chosen uniformly at random among all possible ETs.\n\nThe ETR move introduces small variations to expression trees and is therefore the major source of expression variation. By contrast, node replacement moves often introduce major changes in expressions (for example, replacing a sum by a product often alters a model very significantly) and are therefore not very efficient. However, they are useful in that they represent long jumps in the space of models. Last, root replacement is the only move that can make trees grow/shrink at the top and is useful to add/remove terms to models that are already reasonable. Without root replacement, adding an additive term to an expression tree would require disassembling the whole tree and assembling it again with the additional term from the beginning.\n\n\nMCMC acceptance rules\n\nAt each MCMC step, we attempt one of the three moves described above and accept or reject the proposed move according to Metropolis' rule (36) \np accept ð f i → f f Þ ¼ min 1; pð f f |DÞgð f i |f f Þ pð f i |DÞgð f f |f i Þ & 'ð5Þ\nwhere g( f f | f i ) is the distribution of movement proposal f i → f f (where f and i stand for final and initial, respectively). This rule ensures that the stationary distribution is p( f i |D)\npð f i |DÞ ¼ 1 Z exp ½ÀLð f i Þð6Þ\nwith Z being a normalizing constant and L( f i ) being the description length, as defined and approximated in the main text\nLð f i Þ ≈ Bð f i Þ 2 À log pð f i Þ ð 7Þ\nFor all samples in the paper, we attempt a root replacement move 5% of the time, a node replacement move 45% of the time, and an ETR 50% of the time. These rates are arbitrary and should not affect the achievement or the equilibrium distribution but do have an effect on how fast the Markov chain converges to the equilibrium distribution.\n\nIn what follows, we describe the specific form of the acceptance (Eq. 5) rule for each movement.\n\n1) Node replacement (NR). Since the node to change is chosen uniformly at random and so is the new node, the move is symmetric, that is, the probability of attempting a move and its reverse are the same g( f f |f i ) = g( f i |f f ). Therefore, the acceptance probability in this case is given simply by the difference in the description lengths of the expression trees\np NR accept ¼ minf1; exp ½ÀDLgð8Þ\n2) RA and RR. In this case, the proposal distribution for the RA and RR movements is not symmetric. The RR move is deterministic in that it always affects the existing root of the expression tree. By contrast, the RA move involves selecting uniformly at random among all possible N root roots that can be added (which are enumerated once at the beginning of the sampling process, as described above). Therefore, if p RR is the probability of selecting this type of move, then g(RR) = p RR and g(RA) = p RR /N root so that g(RR)/g(RA) = N root , which gives the following acceptance rules\np RA accept ¼ minf1; N root exp ½ÀDLgð9Þp RR accept ¼ min 1; exp ½ÀDL N root & 'ð10Þ\nwhere N root is the number of possible roots among which we choose in the RA move.\n\n3) ETR. The ETR move is the most involved in terms of defining the move proposal probabilities necessary to define the acceptance rule. First, we need to specify exactly how we choose the attempted move. We start by selecting the orders o i and o f of the existing (initial, i) and replacement (final, f) ETs. For example, we may choose to replace a 0-ET (o i = 0, a constant or a variable) by a 2-ET (o f = 2, e.g., a sum or a product). In this initial choice, we need to take into consideration the number n if of options that we have to choose o i and o f (for example, if a tree has reached the maximum allowed size o f ≤ o i necessarily). Once the orders o i and o f are selected, we need to account for (i) all the possible ETs of order o i in the initial tree W i that we can choose to replace and (ii) all the possible ETs of order o f that we can choose to replace the ET in the initial tree, s f . If p ETR is the probability with which we choose this move, then taking into account the previous considerations g(o f |o i ) = p ETR × 1/n if × 1/W i × 1/s f . Conversely, g(o i |o f ) = p ETR × 1/n fi × 1/W f × 1/s i , so that the acceptance rule is\np ETR accept ¼ min 1; n if W i s f n f i W f s i exp ½ÀDL & 'ð11Þ\nTo validate that these moves and these acceptance rules lead to sampling from the equilibrium distribution p( f i |D), we use the same example as in Fig. 1. We generate data as in Fig. 1 and sample expressions using MCMC, limiting the expressions to use only \"+\" and \"sin\" operations, a single variable x, a single parameter a, and a maximum of seven nodes. In fig. S1, we show that, as expected, the equilibrium distribution is p( f i |D).\n\n\nAvoidance of expression duplicates in MCMC\n\nThe mapping of expressions to expression trees is not one to one because several expression trees can represent the same expression (for example, the expression x + a can be encoded in an expression tree with x or with a on the left branch). To avoid overcounting expressions, we internally reduce all expression trees to a \"canonical form\" using the Python module Sympy (37). Then, if an expression tree that is visited for the first time reduces to an expression that is equivalent to that of a previously visited expression tree, then the current tree is forbidden (assigned infinite description length) and never visited again, so that only one representative of each expression remains.\n\n\nParallel tempering MCMC\n\nThe search space for the MCMC is extremely rugged, with some neighboring expressions having very different description lengths. This makes the sampling process problematic and prone to getting trapped in local minima. To partly alleviate this problem, we used parallel tempering (38). In traditional parallel tempering (typically used in physics for spin glasses and other disordered systems), several replicas of the sampling process are kept at logarithmically spaced and increasing temperatures-at high temperatures, the sampling easily escapes local minima, whereas at low temperatures, the sampling explores configurations that are physically more meaningful. From time to time, samples at consecutive temperatures are switched with a rule that guarantees detailed balance at all temperatures. Therefore, the lowest temperature sample is always equilibrated at the desired temperature, but the configuration space is explored more efficiently because of the high temperature samples exploring larger portions of the space.\n\nFor our purposes here, we introduce a computational temperature T and sample from the distributions\npð f i ; T k Þ ¼ 1 Z exp À Bð f i Þ 2T k þ log pð f i Þ ! ð12Þ\nWith this definition, p( f i ,T = 1) = p( f i |D) is the equilibrium distribution from which we aim to sample, and p( f i ,T = ∞) = p( f i ) is the prior distribution, independent of the data.\n\nThe results of the manuscript were obtained with 40 different temperatures defined as T k = 1.05 k , with k = {0,1, …,39}. From all these, we take expressions only from the T 0 = 1 sample (Fig. 3). In addition, for the Nikuradse dataset, we used four restarts of the parallel tempering MCMC so that the sampling is even better equilibrated.\n\n\nParsing of Wikipedia expressions for expression priors\n\nWe compiled all the mathematical expressions included in pages listed under Wikipedia's \"List of scientific equations named after people,\" which we surmise often correspond to phenomenological models of the kind that we aim to identify (as opposed, for example, to derivations of mathematical identities, proofs of mathematical theorems, etc.).\n\nIn Wikipedia, expressions are encoded in such a way that some of them are ambiguous without the context provided by the text in the page, so fully automatic parsing of expressions is virtually impossible. For example, the expression x a + x b could represent the sum of the two components of a vector or the sum of two powers of x. We designed an algorithm that parses Wikipedia expressions into Sympy (37), using heuristics for the ambiguous cases (the full code for expression parsing is available at https://bitbucket.org/rguimera/machine-scientist/src/ no_degeneracy/Process-Formulas/). We then selected three random subsets of 200 expressions out of the 4080 expressions that could be parsed and verified manually that the parsings were meaningful (accepting parsings that may be wrong once the context is known but that are otherwise mathematically correct). We refined the heuristics until we found that there were fewer than 5% of errors in the parsed expressions of all three subsets. In table S2, we show a small sample of the corpus.\n\n\nPrior definition\n\nTo define the prior distribution over mathematical expressions, we took advantage of the fact that mathematical expressions can be represented as graphs and used an approach based on exponential random graph models (20)(21)(22)(23). As in exponential random graphs models, we aimed to generate mathematical expressions (graphs) with statistical properties similar to those in the corpus. Specifically, we aimed to generate mathematical expressions for which the average number of each operation per expression is the same as in the corpus (for example, in the corpus, the average number of sums per expression is 〈n + 〉 = 0.312). We also aimed to reproduce the average of the square of the number of each operation per expression (for example, the average of the square of the number of sums per expression, 〈n 2 þ 〉 ¼ 0:731) (23,24). As in exponential random graph models, we selected the prior probability p( f i ) that generates expressions with these desired average properties and that, at the same time, is maximally uninformative and therefore consistent with the maximum entropy principle (14,23,39). This prior is given by\npð f i Þ ¼ ∑ o∈O a o n o ð f i Þ þ b o n 2 o ð f i Þ Â Ãð13Þ\nwhere the sum is over all operations considered O = { +, exp, …} (table S1), and a o and b o are hyperparameters that we fitted so that expressions generated from the prior were consistent with the corpus (22,23).\n\n\nFitting of prior hyperparameters\n\nTo fit the a o and b o hyperparameters, we proceeded as follows: 1) Obtain, from the empirical corpus of mathematical expressions, the average number 〈n o 〉 target of each operation o per expression and the average of the square 〈n 2 o 〉 target of the number of each operation per expression.\n\n2) Set some initial values for the parameters.\n\n3) Repeat until the change in parameters values is small enough: (i) Generate, using the MCMC, a large number of expressions (typically 1 million to 10 million).\n\n(ii) Measure 〈n o 〉 measured and 〈n 2 o 〉 measured in the generated formulas. (iii) Update the a o parameters as follows\na o ← a o þ el 〈n o 〉 measured À 〈n o 〉 target 〈n o 〉 targetð14Þ\nwhere l is a fixed parameter (typically between 0.01 and 0.05) and e is a random number in [0, 1] generated independently for each update.\n\n(iv) Update the b o parameters as follows\nb o ← b o þ el 〈n 2 o 〉 measured À 〈n 2 o 〉 target 〈n 2 o 〉 targetð15Þ\nwhere l is a fixed parameter (typically between 0.01 and 0.05) and e is a random number in [0,1] generated independently for each update. If one b o becomes negative, then its value is set to 0.\n\n(v) Repeat from (i). This method is adapted from an exisiting method to fit the parameters of exponential random graphs (22). A typical evolution of the parameter values is shown in fig. S2, and the parameter values obtained are listed in tables S3 and S4 (Supplementary text S2).\n\n\nBenchmark machine scientists\n\nWe benchmarked the performance of the Bayesian machine scientist against three other machine scientists: Eureqa (5), EPLEX (6), and EFS (13). Eureqa uses a genetic algorithm to search the space of expressions (5). Eureqa requires that a complexity penalty is set for each operation type; we set these penalties to their default values and selected the same basic operations used by the Bayesian machine scientist. We also selected the default fitness function. We ran Eureqa for several weeks in each experiment, until the number of evaluated expressions is, at least, 10 13 . Eureqa is available at www.nutonian.com/download/eureqadesktop-download/.\n\nEPLEX is another algorithm based on genetic programming and was the top performer in a recent systematic comparison of state of the art machine scientists (4). We ran EPLEX in the same conditions as in that study (implementation available at https://epistasislab.github.io/ellyn/); in particular, we obtained 10 6 models with a population size of 1000 and 1000 generations. Moreover, we repeated this procedure 10 times and selected the realization with the best fitness among the 10 repetitions. However, in all our experiments, EPLEX gives results that are considerably worse than Eureqa's, so we do not show its results in the main text (Supplementary text S7 and fig. S10).\n\nLast, EFS is a method based on sparse regression that generates basis functions automatically using a genetic algorithm (13). Thus, this approach has the advantages of sparse regression, and, at the same time, it does not require a priori knowledge of the basis functions. EFS is an evolution of multiple regression genetic programming (12), which was also a top performer in (4), although somehow more inconsistent than EPLEX. EFS is fast and gives expressions within seconds. Thus, we were able to repeat the training process 100 times for each experiment and select the model with the best default fitness measure (mean squared error). We used the implementation of EFS available at http://flexgp. github.io/efs/.\n\n\nGaussian process models\n\nFor the comparison of the out-of-sample predictions of Gaussian process models to those of the machine scientist, we proceeded as follows. We trained the Gaussian process using the scikit-learn implementation (40). We tested different kernels (including radial-basis function kernels, Matérn kernels, white kernels, rational quadratic kernels, exponential kernels, and linear and quadratic combinations of these), and we also tested the effects of using D/r or its logarithm as the feature. Among these, we selected the combination that gave the best results (an radial-basis function plus white kernel with logarithmic D/r)-all results reported in the main text correspond to this combination.\n\n\nSUPPLEMENTARY MATERIALS\n\nSupplementary material for this article is available at http://advances.sciencemag.org/cgi/ content/full/6/5/eaav6971/DC1 Supplementary Text S1. Calculation of the BIC Supplementary Text S2. Prior parameter values S C I E N C E A D V A N C E S | R E S E A R C H A R T I C L E  Table S1. Operations used by the machine scientist and their properties. Table S2. Sample of the expressions in the empirical corpus. Table S3. Values of the a prior parameters for different number of variables, N v , and parameters N p . Table S4. Values of the b prior parameters for different number of variables, N v , and parameters N p . Table S5. Models for the funding application success in different European countries as a function of socioeconomic indicators of the countries and of their ability to attract and retain scientific talent. Table S6. Models for the cell-to-cell stresses as a function of the concentration of several cell adhesion proteins. Table S7. Models for the (logarithm of the) Seymour stock of salmon in the Fraser River system in British Columbia, Canada as a function of several ecological indicators. Fig. S1. Equilibrium distribution of the MCMC. Fig. S2. Fitting of the parameters of the prior distribution for expressions. Fig. S3. Ability of the Bayesian machine scientist to identify the correct model from synthetic data as a function the number of observed points. Fig. S4. True and most plausible models of the Rössler system in high-noise scenarios. Fig. S5. True and minimum BIC models of the Rössler system. Fig. S6. Recovery of Bessel functions. Fig. S7. Out-of-sample predictions for small datasets. Fig. S8. Energy distribution for the Nikuradse dataset. Fig. S9. Sampled models. Fig. S10. EPLEX models and out-of-sample predictions for the Nikuradse dataset. Movie S1. Video of the Bayesian machine scientist finding models for a synthetic dataset. interests: The authors declare that they have no competing interests. Data and materials availability: A Python implementation of the Bayesian machine scientist and all data needed to evaluate the conclusions in the paper are publicly available from Bitbucket at https://bitbucket.org/rguimera/machine-scientist. Additional data related to this paper may be requested from the authors. \n\nFig. 2 .\n2The prior probability distribution generates plausible expressions. (A) We extracted 4080 mathematical expressions from Wikipedia pages listed under the category \"List of scientific equations named after people\", for example, the page devoted to \"Newton's law of universal gravitation\" (see also table S2). (B) After parsing each expression (Materials and Methods), we counted the number of each operation in the expression and the square of these numbers. In Newton's law of gravitation, we counted two products, one division, and one square. The complete list of operations is listed in table S1. Then, we parametrized the prior distributions p(f i ) and fit the parameters so as to generate expressions that have realistic numbers (and squares) of each operation (Materials and Methods). (C to H) We ran the MCMC to draw sets of 4080 synthetic expressions from the prior distribution. We compared these sets of 4080 synthetic expressions with the 4080 empirical expressions obtained from Wikipedia. In particular, for each set of 4080 expressions, we counted the mean number 〈n o 〉 of each operation o per expression [(C) sine, (D) logarithm, (E) sum], or the mean 〈n 2 o 〉 of the square of those numbers (F to H) and plot their probability density function (PDF; pink). The red vertical line indicates the mean of the distribution, which is close to the empirical observation, represented by a dashed black line. The empirical value is always well within the expected ranges of the expressions generated by the MCMC. The results in the figure correspond to expressions with up to five variables and eight parameters.\n\nFig. 4 .\n4Recovery of the differential equations governing the Rössler system. (A) We generated synthetic data for the Rössler system (equations shown in the panels) with a = b = 0.2 and c = 5.7. We assume that (x, y, z) are measured without error, but the functions that we aim to recover ðẋ,ẏ,żÞ are measured with two levels of Gaussian noise [e.g.,ẋ k ¼ Fðx k ,y k ,z k Þ þ e k with e k ∼ N(0, s e )]: orange, s e = 1; blue, s e = 5. (B) Trajectories in velocity space ðẋ,ẏ,żÞ for the levels of noise that we considered. (C to J) For each level of noise, we sampled 10,000 models forẋ using the machine scientist and the same forẏ andż. (C and G), For each level of noise, we plot the most plausible model obtained. (D to F and H to J) We plot the distribution of description lengths (up to an irrelevant additive constant) for the models sampled. (D to F) For low noise, the most plausible model among those sampled always coincides with the true model, as indicated by the dashed vertical line. (H to J) For high noise,ẋ was recovered exactly, whereas forẏ andż, the most plausible models corresponded to regularized versions of the true models, in which terms that are comparatively small because of the factor 0.2 are dropped. In all cases, the true model (dashed vertical line) is, at least, among the most plausible ones.\n\nFig. 5 .\n5The machine scientist gives accurate closed-form models and out-ofsample predictions for the Nikuradse dataset. The dataset contains measurements of the turbulent friction l in rough pipes as a function of the Reynolds number x R and the inverse of the relative roughness x D . (A and B) We fed the machine scientist with the Nikuradse dataset (gray) and sample more than 18,000 models using MCMC as described in the text. The two graphs show the fit of two of the most plausible models (red), indicated at the top of each panel. For comparison, we show the best models identified by alternative machine scientists Eureqa (green) and EFS (orange). The inset in each graph shows the mean absolute error (MAE) of the machine scientist (MS), Eureqa (EU), and EFS (EF) (Materials and Methods), and error bars indicate the 95% confidence interval for the mean. (C and D) We fed the machine scientist with the data points in gray and sample 20,000 models using MCMC. We made predictions (red) for the unobserved data (black) using the median predictive model (see text). For comparison, we show the predictions of Eureqa, EFS, and Gaussian processes (GP) (Materials and Methods). The inset in each graph shows the mean absolute error for all approaches. (E) We considered, again, the models obtained from the whole data as in (A) and (B) but asked what the median predictive model predicts in the fully turbulent regime, well above the highest observed Reynold number(31). Despite the fact that individual sampled models have different behaviors in this region (fig. S5), the median predictive model [obtained as in (C) and (D)] predicts that turbulent friction stays constant at large Reynolds numbers, in agreement with theory(31)(32)(33).(F) The machine scientist also predicts the correct scaling (D/r) −1/3 for the turbulent friction in this regime (dashed line). (G) Scaling of the Nikuradse dataset proposed by Prandtl (with k þ s ðRe,r=DÞ ¼ Re Â ffiffiffiffiffiffiffiffiffiffi l=32 p Â D=r) (30, 33) and most plausible model identified by the machine scientist for the universal scaling function. (H) When unscaled, this simple universal function provides a good description of all the data.\n\n\n31 January 2020 10.1126/sciadv.aav6971 Citation: R. Guimerà, I. Reichardt, A. Aguilar-Mogas, F. A. Massucci, M. Miranda, J. Pallarès, M. Sales-Pardo, A Bayesian machine scientist to aid in the solution of challenging scientific problems. Sci. Adv. 6, eaav6971 (2020).\n\n\nSupplementary Text S3. Validation and benchmarking on synthetic data Supplementary Text S4. Rössler system Supplementary Text S5. Recovery of Bessel functions Supplementary Text S6. Results for small datasets Supplementary Text S7. Nikuradse dataset\nGuimerà et al., Sci. Adv. 2020; 6 : eaav6971\nAcknowledgments:We thank E. G. Altmann, L. A. N. Amaral, A. Arenas, J. Bonet Avalos, and D. Shasha for helpful comments and suggestions. We thank I. Arnaldo for help with the EFS software. We thank A. Arenas for pointing us toward the Nikuradse dataset. We thank M. De Domenico and A. Arenas for sharing the financial success dataset. We thank E. Bazellières\nS Džeroski, L Todorovski, Computational Discovery of Scientific Knowledge. SpringerS. Džeroski, L. Todorovski, Lecture Notes in Artificial Intelligence, in Computational Discovery of Scientific Knowledge (Springer, 2007).\n\nMachine science. J Evans, A Rzhetsky, Science. 329J. Evans, A. Rzhetsky, Machine science. Science 329, 399-400 (2010).\n\nAutomated adaptive inference of phenomenological dynamical models. B C Daniels, I Nemenman, Nat. Commun. 68133B. C. Daniels, I. Nemenman, Automated adaptive inference of phenomenological dynamical models. Nat. Commun. 6, 8133 (2015).\n\nP Orzechowski, W La Cava, J H Moore, Proceedings of the Genetic and Evolutionary Computation Conference, GECCO '18. the Genetic and Evolutionary Computation Conference, GECCO '18ACMP. Orzechowski, W. La Cava, J. H. Moore, Proceedings of the Genetic and Evolutionary Computation Conference, GECCO '18 (ACM, 2018), pp. 1183-1190.\n\nDistilling free-form natural laws from experimental data. M Schmidt, H Lipson, Science. 324M. Schmidt, H. Lipson, Distilling free-form natural laws from experimental data. Science 324, 81-85 (2009).\n\nW La Cava, L Spector, K Danai, Proceedings of the Genetic and Evolutionary Computation Conference. the Genetic and Evolutionary Computation ConferenceACMGECCO '16W. La Cava, L. Spector, K. Danai, Proceedings of the Genetic and Evolutionary Computation Conference 2016, GECCO '16 (ACM, 2016), pp. 741-748.\n\nFFX: Fast, scalable, deterministic symbolic regression technology. T Mcconaghy, R Ix, E Riolo, Vladislavleva, Genetic Programming Theory and Practice. J. H. MooreNew YorkSpringerT. McConaghy, FFX: Fast, scalable, deterministic symbolic regression technology, in Genetic Programming Theory and Practice IX, R. Riolo,E. Vladislavleva, J. H. Moore, Eds. (Springer New York, 2011), pp. 235-260.\n\nDiscovering governing equations from data by sparse identification of nonlinear dynamical systems. S L Brunton, J L Proctor, J N Kutz, Proc. Natl. Acad. Sci. U.S.A. 133S. L. Brunton, J. L. Proctor, J. N. Kutz, Discovering governing equations from data by sparse identification of nonlinear dynamical systems. Proc. Natl. Acad. Sci. U.S.A. 133, 3932-3937 (2016).\n\nThe ALAMO approach to machine learning. Z T Wilson, N V Sahinidis, Comput. Chem. Eng. 106Z. T. Wilson, N. V. Sahinidis, The ALAMO approach to machine learning. Comput. Chem. Eng. 106, 785-795 (2017).\n\nData-driven discovery of partial differential equations. S H Rudy, S L Brunton, J L Proctor, J N Kutz, Sci. Adv. 31602614S. H. Rudy, S. L. Brunton, J. L. Proctor, J. N. Kutz, Data-driven discovery of partial differential equations. Sci. Adv. 3, e1602614 (2017).\n\nModel selection for dynamical systems via sparse regression and information criteria. N M Mangan, J N Kutz, S L Brunton, J L Proctor, Proc. R. Soc. A. 47320170009N. M. Mangan, J. N. Kutz, S. L. Brunton, J. L. Proctor, Model selection for dynamical systems via sparse regression and information criteria. Proc. R. Soc. A 473, 20170009 (2017).\n\nI Arnaldo, K Krawiec, U.-M O&apos;reilly, Proceedings of the 2014 Annual Conference on Genetic and Evolutionary Computation, GECCO '14. the 2014 Annual Conference on Genetic and Evolutionary Computation, GECCO '14ACMI. Arnaldo, K. Krawiec, U.-M. O'Reilly, Proceedings of the 2014 Annual Conference on Genetic and Evolutionary Computation, GECCO '14 (ACM, 2014), pp. 879-886.\n\nI Arnaldo, U.-M O&apos;reilly, K Veeramachaneni, Proceedings of the 2015 Annual Conference on Genetic and Evolutionary Computation, GECCO '15. the 2015 Annual Conference on Genetic and Evolutionary Computation, GECCO '15ACMI. Arnaldo, U.-M. O'Reilly, K. Veeramachaneni, Proceedings of the 2015 Annual Conference on Genetic and Evolutionary Computation, GECCO '15 (ACM, 2015), pp. 983-990.\n\nInformation theory and statistical mechanics. E T Jaynes, Phys. Rev. 106E. T. Jaynes, Information theory and statistical mechanics. Phys. Rev. 106, 620-630 (1957).\n\nD Barber, Bayesian Reasoning and Machine Learning. Cambridge Univ. PressD. Barber, Bayesian Reasoning and Machine Learning (Cambridge Univ. Press, 2012).\n\nP D Grünwald, The Minimum Description Length Principle. The MIT PressP. D. Grünwald, The Minimum Description Length Principle (The MIT Press, 2007).\n\nEstimating the dimension of a model. G Schwarz, Ann. Stat. 6G. Schwarz, Estimating the dimension of a model. Ann. Stat. 6, 461-464 (1978).\n\nT Ando, Bayesian Model Selection and Statistical Modeling. CRC PressT. Ando, Bayesian Model Selection and Statistical Modeling (CRC Press, 2010).\n\nBayesian information criteria and smoothing parameter selection in radial basis function networks. S Konishi, T Ando, S Imoto, Biometrika. 91S. Konishi, T. Ando, S. Imoto, Bayesian information criteria and smoothing parameter selection in radial basis function networks. Biometrika 91, 27-43 (2004).\n\nAn introduction to exponential random graph (p*) models for social networks. G Robins, P Pattison, Y Kalish, D Lusher, Soc. Netw. 29G. Robins, P. Pattison, Y. Kalish, D. Lusher, An introduction to exponential random graph (p*) models for social networks. Soc. Netw. 29, 173-191 (2007).\n\nStatistical models for social networks. T A B Snijders, Annu. Rev. Sociol. 37T. A. B. Snijders, Statistical models for social networks. Annu. Rev. Sociol. 37, 131-153 (2011).\n\nBayesian inference for exponential random graphs. A Caimo, N Friel, Soc. Netw. 33A. Caimo, N. Friel, Bayesian inference for exponential random graphs. Soc. Netw. 33, 41-55 (2011).\n\nReducing degeneracy in maximum entropy models of networks. S Horvát, E Czabarka, Z Toroczkai, Phys. Rev. Lett. 114158701S. Horvát, E. Czabarka, Z. Toroczkai, Reducing degeneracy in maximum entropy models of networks. Phys. Rev. Lett. 114, 158701 (2015).\n\nSampling motif-constrained ensembles of networks. R Fischer, J C Leitão, T P Peixoto, E G Altmann, Phys. Rev. Lett. 115188701R. Fischer, J. C. Leitão, T. P. Peixoto, E. G. Altmann, Sampling motif-constrained ensembles of networks. Phys. Rev. Lett. 115, 188701 (2015).\n\nAn equation for continuous chaos. O E Rössler, Phys. Lett. A. 57O. E. Rössler, An equation for continuous chaos. Phys. Lett. A 57, 397-398 (1976).\n\nPrediction of dynamical systems by symbolic regression. M Quade, M Abel, K Shafi, R K Niven, B R Noack, Phys. Rev. E. 9412214M. Quade, M. Abel, K. Shafi, R. K. Niven, B. R. Noack, Prediction of dynamical systems by symbolic regression. Phys. Rev. E 94, 012214 (2016).\n\nResearcher incentives: EU cash goes to the sticky and attractive. M De Domenico, A Arenas, Nature. 531580M. De Domenico, A. Arenas, Researcher incentives: EU cash goes to the sticky and attractive. Nature 531, 580 (2016).\n\nControl of cell-cell forces and collective cell dynamics by the intercellular adhesome. E Bazellières, V Conte, A Elosegui-Artola, X Serra-Picamal, M Bintanel-Morcillo, P Roca-Cusachs, J J Muñoz, M Sales-Pardo, R Guimerà, X Trepat, Nat. Cell Biol. 17E. Bazellières, V. Conte, A. Elosegui-Artola, X. Serra-Picamal, M. Bintanel-Morcillo, P. Roca-Cusachs, J. J. Muñoz, M. Sales-Pardo, R. Guimerà, X. Trepat, Control of cell-cell forces and collective cell dynamics by the intercellular adhesome. Nat. Cell Biol. 17, 409-420 (2015).\n\nEquation-free mechanistic ecosystem forecasting using empirical dynamic modeling. H Ye, R J Beamish, S M Glaser, S C H Grant, C.-H Hsieh, L J Richards, J T Schnute, G Sugihara, Proc. Natl. Acad. Sci. U.S.A. 112H. Ye, R. J. Beamish, S. M. Glaser, S. C. H. Grant, C.-H. Hsieh, L. J. Richards, J. T. Schnute, G. Sugihara, Equation-free mechanistic ecosystem forecasting using empirical dynamic modeling. Proc. Natl. Acad. Sci. U.S.A. 112, E1569-E1576 (2015).\n\n. English in J. Nikuradse, NACA Tech. Memo. 1292Reprinted in English in J. Nikuradse, NACA Tech. Memo.1292 (1950).\n\nTurbulent friction in rough pipes and the energy spectrum of the phenomenological theory. G Gioia, P Chakraborty, Phys. Rev. Lett. 9644502G. Gioia, P. Chakraborty, Turbulent friction in rough pipes and the energy spectrum of the phenomenological theory. Phys. Rev. Lett. 96, 044502 (2006).\n\nRoughness-induced critical phenomena in a turbulent flow. N Goldenfeld, Phys. Rev. Lett. 9644503N. Goldenfeld, Roughness-induced critical phenomena in a turbulent flow. Phys. Rev. Lett. 96, 044503 (2006).\n\nA multi-state description of roughness effects in turbulent pipe flow. Z.-S She, Y Wu, X Chen, F Hussain, New J. Phys. 1493054Z.-S. She, Y. Wu, X. Chen, F. Hussain, A multi-state description of roughness effects in turbulent pipe flow. New J. Phys. 14, 093054 (2012).\n\nBayesian model averaging: A tutorial. J A Hoeting, D Madigan, A E Raftery, C T Volinsky, Stat. Sci. 14382417J. A. Hoeting, D. Madigan, A. E. Raftery, C. T. Volinsky, Bayesian model averaging: A tutorial. Stat. Sci. 14, 382417 (1999).\n\nModeling dynamic systems with efficient ensembles of process-based models. N Simidjievski, L Todorovski, S Džeroski, PLOS ONE. 11153507N. Simidjievski, L. Todorovski, S. Džeroski, Modeling dynamic systems with efficient ensembles of process-based models. PLOS ONE 11, e0153507 (2016).\n\nEquation of state calculations by fast computing machines. N Metropolis, A W Rosenbluth, M N Rosenbluth, A H Teller, E Teller, J. Chem. Phys. 21N. Metropolis, A. W. Rosenbluth, M. N. Rosenbluth, A. H. Teller, E. Teller, Equation of state calculations by fast computing machines. J. Chem. Phys. 21, 1087-1092 (1953).\n\nSympy: symbolic computing in python. A Meurer, C P Smith, M Paprocki, O Čertík, S B Kirpichev, M Rocklin, A Kumar, S Ivanov, J K Moore, S Singh, T Rathnayake, S Vig, B E Granger, R P Muller, F Bonazzi, H Gupta, S Vats, F Johansson, F Pedregosa, M J Curry, A R Terrel, S Roučka, A Saboo, I Fernando, S Kulal, R Cimrman, A Scopatz, PeerJ Comput. Sci. 3103A. Meurer, C. P. Smith, M. Paprocki, O. Čertík, S. B. Kirpichev, M. Rocklin, A. Kumar, S. Ivanov, J. K. Moore, S. Singh, T. Rathnayake, S. Vig, B. E. Granger, R. P. Muller, F. Bonazzi, H. Gupta, S. Vats, F. Johansson, F. Pedregosa, M. J. Curry, A. R. Terrel, S. Roučka, A. Saboo, I. Fernando, S. Kulal, R. Cimrman, A. Scopatz, Sympy: symbolic computing in python. PeerJ Comput. Sci. 3, e103 (2017).\n\nParallel tempering: Theory, applications, and new perspectives. D J Earl, M W Deem, Phys. Chem. Chem. Phys. 7D. J. Earl, M. W. Deem, Parallel tempering: Theory, applications, and new perspectives. Phys. Chem. Chem. Phys. 7, 3910-3916 (2005).\n\nE T Jaynes, Probability Theory: The Logic of Science. Cambridge Univ. PressE. T. Jaynes, Probability Theory: The Logic of Science (Cambridge Univ. Press, 2003).\n\nScikit-learn: Machine learning in Python. F Pedregosa, G Varoquaux, A Gramfort, V Michel, B Thirion, O Grisel, M Blondel, P Prettenhofer, R Weiss, V Dubourg, J Vanderplas, A Passos, D Cournapeau, M Brucher, M Perrot, E Duchesnay, J. Mach. Learn. Res. 12F. Pedregosa, G. Varoquaux, A. Gramfort, V. Michel, B. Thirion, O. Grisel, M. Blondel, P. Prettenhofer, R. Weiss, V. Dubourg, J. Vanderplas, A. Passos, D. Cournapeau, M. Brucher, M. Perrot, E. Duchesnay, Scikit-learn: Machine learning in Python. J. Mach. Learn. Res. 12, 2825-2830 (2011).\n", "annotations": {"author": "[{\"end\":104,\"start\":90},{\"end\":122,\"start\":105},{\"end\":144,\"start\":123},{\"end\":166,\"start\":145},{\"end\":182,\"start\":167},{\"end\":198,\"start\":183},{\"end\":217,\"start\":199}]", "publisher": null, "author_last_name": "[{\"end\":103,\"start\":96},{\"end\":121,\"start\":112},{\"end\":143,\"start\":130},{\"end\":165,\"start\":157},{\"end\":181,\"start\":174},{\"end\":197,\"start\":189},{\"end\":216,\"start\":205}]", "author_first_name": "[{\"end\":95,\"start\":90},{\"end\":111,\"start\":105},{\"end\":129,\"start\":123},{\"end\":154,\"start\":145},{\"end\":156,\"start\":155},{\"end\":173,\"start\":167},{\"end\":188,\"start\":183},{\"end\":204,\"start\":199}]", "author_affiliation": null, "title": "[{\"end\":87,\"start\":1},{\"end\":304,\"start\":218}]", "venue": null, "abstract": "[{\"end\":1455,\"start\":496}]", "bib_ref": "[{\"attributes\":{\"ref_id\":\"b0\"},\"end\":2157,\"start\":2154},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":2160,\"start\":2157},{\"attributes\":{\"ref_id\":\"b2\"},\"end\":2163,\"start\":2160},{\"attributes\":{\"ref_id\":\"b3\"},\"end\":2166,\"start\":2163},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":2291,\"start\":2288},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":2485,\"start\":2482},{\"attributes\":{\"ref_id\":\"b5\"},\"end\":2487,\"start\":2485},{\"attributes\":{\"ref_id\":\"b6\"},\"end\":2802,\"start\":2799},{\"attributes\":{\"ref_id\":\"b7\"},\"end\":2805,\"start\":2802},{\"attributes\":{\"ref_id\":\"b8\"},\"end\":2808,\"start\":2805},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":2812,\"start\":2808},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":2816,\"start\":2812},{\"attributes\":{\"ref_id\":\"b7\"},\"end\":3136,\"start\":3133},{\"attributes\":{\"ref_id\":\"b8\"},\"end\":3139,\"start\":3136},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":3143,\"start\":3139},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":3147,\"start\":3143},{\"attributes\":{\"ref_id\":\"b11\"},\"end\":3423,\"start\":3419},{\"attributes\":{\"ref_id\":\"b12\"},\"end\":3426,\"start\":3423},{\"attributes\":{\"ref_id\":\"b13\"},\"end\":5000,\"start\":4996},{\"attributes\":{\"ref_id\":\"b3\"},\"end\":5417,\"start\":5414},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":5802,\"start\":5798},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":7012,\"start\":7008},{\"attributes\":{\"ref_id\":\"b16\"},\"end\":7134,\"start\":7130},{\"attributes\":{\"ref_id\":\"b17\"},\"end\":7137,\"start\":7134},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":7379,\"start\":7375},{\"attributes\":{\"ref_id\":\"b16\"},\"end\":7382,\"start\":7379},{\"attributes\":{\"ref_id\":\"b18\"},\"end\":7773,\"start\":7769},{\"attributes\":{\"ref_id\":\"b16\"},\"end\":10083,\"start\":10079},{\"attributes\":{\"ref_id\":\"b17\"},\"end\":10086,\"start\":10083},{\"attributes\":{\"ref_id\":\"b19\"},\"end\":11983,\"start\":11979},{\"attributes\":{\"ref_id\":\"b20\"},\"end\":11987,\"start\":11983},{\"attributes\":{\"ref_id\":\"b21\"},\"end\":11991,\"start\":11987},{\"attributes\":{\"ref_id\":\"b22\"},\"end\":11995,\"start\":11991},{\"attributes\":{\"ref_id\":\"b22\"},\"end\":12135,\"start\":12131},{\"attributes\":{\"ref_id\":\"b23\"},\"end\":12138,\"start\":12135},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":14196,\"start\":14193},{\"attributes\":{\"ref_id\":\"b5\"},\"end\":14233,\"start\":14230},{\"attributes\":{\"ref_id\":\"b12\"},\"end\":14339,\"start\":14335},{\"attributes\":{\"ref_id\":\"b24\"},\"end\":15027,\"start\":15023},{\"attributes\":{\"ref_id\":\"b25\"},\"end\":15499,\"start\":15495},{\"attributes\":{\"ref_id\":\"b0\"},\"end\":15964,\"start\":15963},{\"attributes\":{\"ref_id\":\"b35\"},\"end\":16805,\"start\":16801},{\"attributes\":{\"ref_id\":\"b7\"},\"end\":18536,\"start\":18533},{\"attributes\":{\"ref_id\":\"b8\"},\"end\":18539,\"start\":18536},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":18543,\"start\":18539},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":18547,\"start\":18543},{\"attributes\":{\"ref_id\":\"b26\"},\"end\":20081,\"start\":20077},{\"attributes\":{\"ref_id\":\"b27\"},\"end\":20122,\"start\":20118},{\"attributes\":{\"ref_id\":\"b28\"},\"end\":20210,\"start\":20206},{\"attributes\":{\"ref_id\":\"b29\"},\"end\":20934,\"start\":20930},{\"attributes\":{\"ref_id\":\"b30\"},\"end\":20938,\"start\":20934},{\"attributes\":{\"ref_id\":\"b31\"},\"end\":20942,\"start\":20938},{\"attributes\":{\"ref_id\":\"b32\"},\"end\":20946,\"start\":20942},{\"attributes\":{\"ref_id\":\"b12\"},\"end\":21481,\"start\":21477},{\"attributes\":{\"ref_id\":\"b33\"},\"end\":22226,\"start\":22222},{\"attributes\":{\"ref_id\":\"b34\"},\"end\":22229,\"start\":22226},{\"attributes\":{\"ref_id\":\"b33\"},\"end\":23089,\"start\":23085},{\"attributes\":{\"ref_id\":\"b37\"},\"end\":25559,\"start\":25555},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":26420,\"start\":26416},{\"attributes\":{\"ref_id\":\"b30\"},\"end\":26975,\"start\":26971},{\"attributes\":{\"ref_id\":\"b29\"},\"end\":27406,\"start\":27402},{\"attributes\":{\"ref_id\":\"b32\"},\"end\":27409,\"start\":27406},{\"attributes\":{\"ref_id\":\"b17\"},\"end\":31508,\"start\":31504},{\"end\":38027,\"start\":38006},{\"attributes\":{\"ref_id\":\"b36\"},\"end\":42201,\"start\":42197},{\"attributes\":{\"ref_id\":\"b37\"},\"end\":42828,\"start\":42824},{\"attributes\":{\"ref_id\":\"b19\"},\"end\":45960,\"start\":45956},{\"attributes\":{\"ref_id\":\"b20\"},\"end\":45964,\"start\":45960},{\"attributes\":{\"ref_id\":\"b21\"},\"end\":45968,\"start\":45964},{\"attributes\":{\"ref_id\":\"b22\"},\"end\":45972,\"start\":45968},{\"attributes\":{\"ref_id\":\"b22\"},\"end\":46571,\"start\":46567},{\"attributes\":{\"ref_id\":\"b23\"},\"end\":46574,\"start\":46571},{\"attributes\":{\"ref_id\":\"b13\"},\"end\":46842,\"start\":46838},{\"attributes\":{\"ref_id\":\"b22\"},\"end\":46845,\"start\":46842},{\"attributes\":{\"ref_id\":\"b38\"},\"end\":46848,\"start\":46845},{\"attributes\":{\"ref_id\":\"b21\"},\"end\":47143,\"start\":47139},{\"attributes\":{\"ref_id\":\"b22\"},\"end\":47146,\"start\":47143},{\"attributes\":{\"ref_id\":\"b21\"},\"end\":48448,\"start\":48444},{\"attributes\":{\"ref_id\":\"b5\"},\"end\":48763,\"start\":48760},{\"attributes\":{\"ref_id\":\"b12\"},\"end\":48777,\"start\":48773},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":48849,\"start\":48846},{\"attributes\":{\"ref_id\":\"b12\"},\"end\":50092,\"start\":50088},{\"attributes\":{\"ref_id\":\"b11\"},\"end\":50308,\"start\":50304},{\"attributes\":{\"ref_id\":\"b39\"},\"end\":50925,\"start\":50921},{\"attributes\":{\"ref_id\":\"b30\"},\"end\":58139,\"start\":58135},{\"attributes\":{\"ref_id\":\"b30\"},\"end\":58400,\"start\":58396},{\"attributes\":{\"ref_id\":\"b31\"},\"end\":58404,\"start\":58400},{\"attributes\":{\"ref_id\":\"b32\"},\"end\":58408,\"start\":58404}]", "figure": "[{\"attributes\":{\"id\":\"fig_0\"},\"end\":55330,\"start\":53699},{\"attributes\":{\"id\":\"fig_2\"},\"end\":56662,\"start\":55331},{\"attributes\":{\"id\":\"fig_3\"},\"end\":58867,\"start\":56663},{\"attributes\":{\"id\":\"fig_4\"},\"end\":59137,\"start\":58868},{\"attributes\":{\"id\":\"tab_1\",\"type\":\"table\"},\"end\":59389,\"start\":59138}]", "paragraph": "[{\"end\":2047,\"start\":1471},{\"end\":2292,\"start\":2049},{\"end\":3427,\"start\":2294},{\"end\":4373,\"start\":3429},{\"end\":5803,\"start\":4375},{\"end\":6459,\"start\":5815},{\"end\":6763,\"start\":6549},{\"end\":6777,\"start\":6765},{\"end\":7187,\"start\":6870},{\"end\":8283,\"start\":7230},{\"end\":9240,\"start\":8285},{\"end\":9688,\"start\":9242},{\"end\":11271,\"start\":9690},{\"end\":12947,\"start\":11273},{\"end\":13687,\"start\":12949},{\"end\":14515,\"start\":13689},{\"end\":14903,\"start\":14517},{\"end\":18043,\"start\":14905},{\"end\":19657,\"start\":18097},{\"end\":20211,\"start\":19659},{\"end\":20687,\"start\":20213},{\"end\":21747,\"start\":20689},{\"end\":22322,\"start\":21749},{\"end\":23090,\"start\":22392},{\"end\":26670,\"start\":23092},{\"end\":27694,\"start\":26672},{\"end\":29786,\"start\":27709},{\"end\":31955,\"start\":29788},{\"end\":32096,\"start\":31957},{\"end\":33444,\"start\":32162},{\"end\":34064,\"start\":33520},{\"end\":34493,\"start\":34066},{\"end\":35081,\"start\":34495},{\"end\":35739,\"start\":35083},{\"end\":36692,\"start\":35741},{\"end\":37112,\"start\":36694},{\"end\":37859,\"start\":37114},{\"end\":38028,\"start\":37885},{\"end\":38311,\"start\":38116},{\"end\":38470,\"start\":38347},{\"end\":38852,\"start\":38513},{\"end\":38950,\"start\":38854},{\"end\":39321,\"start\":38952},{\"end\":39943,\"start\":39356},{\"end\":40111,\"start\":40029},{\"end\":41272,\"start\":40113},{\"end\":41779,\"start\":41339},{\"end\":42517,\"start\":41826},{\"end\":43572,\"start\":42545},{\"end\":43673,\"start\":43574},{\"end\":43929,\"start\":43737},{\"end\":44271,\"start\":43931},{\"end\":44674,\"start\":44330},{\"end\":45720,\"start\":44676},{\"end\":46872,\"start\":45741},{\"end\":47147,\"start\":46934},{\"end\":47476,\"start\":47184},{\"end\":47524,\"start\":47478},{\"end\":47687,\"start\":47526},{\"end\":47809,\"start\":47689},{\"end\":48013,\"start\":47875},{\"end\":48056,\"start\":48015},{\"end\":48322,\"start\":48128},{\"end\":48604,\"start\":48324},{\"end\":49287,\"start\":48637},{\"end\":49966,\"start\":49289},{\"end\":50684,\"start\":49968},{\"end\":51406,\"start\":50712},{\"end\":53698,\"start\":51434}]", "formula": "[{\"attributes\":{\"id\":\"formula_0\"},\"end\":6548,\"start\":6460},{\"attributes\":{\"id\":\"formula_1\"},\"end\":6869,\"start\":6778},{\"attributes\":{\"id\":\"formula_2\"},\"end\":7229,\"start\":7188},{\"attributes\":{\"id\":\"formula_3\"},\"end\":18096,\"start\":18044},{\"attributes\":{\"id\":\"formula_4\"},\"end\":22391,\"start\":22323},{\"attributes\":{\"id\":\"formula_5\"},\"end\":38115,\"start\":38029},{\"attributes\":{\"id\":\"formula_6\"},\"end\":38346,\"start\":38312},{\"attributes\":{\"id\":\"formula_7\"},\"end\":38512,\"start\":38471},{\"attributes\":{\"id\":\"formula_8\"},\"end\":39355,\"start\":39322},{\"attributes\":{\"id\":\"formula_9\"},\"end\":39984,\"start\":39944},{\"attributes\":{\"id\":\"formula_10\"},\"end\":40028,\"start\":39984},{\"attributes\":{\"id\":\"formula_11\"},\"end\":41338,\"start\":41273},{\"attributes\":{\"id\":\"formula_12\"},\"end\":43736,\"start\":43674},{\"attributes\":{\"id\":\"formula_13\"},\"end\":46933,\"start\":46873},{\"attributes\":{\"id\":\"formula_14\"},\"end\":47874,\"start\":47810},{\"attributes\":{\"id\":\"formula_15\"},\"end\":48127,\"start\":48057}]", "table_ref": "[{\"end\":18849,\"start\":18826},{\"end\":47009,\"start\":46999},{\"end\":51719,\"start\":51711},{\"end\":51792,\"start\":51784},{\"end\":51853,\"start\":51845},{\"end\":51958,\"start\":51950},{\"end\":52063,\"start\":52055},{\"end\":52269,\"start\":52261},{\"end\":52386,\"start\":52378}]", "section_header": "[{\"end\":1469,\"start\":1457},{\"end\":5813,\"start\":5806},{\"end\":27707,\"start\":27697},{\"end\":32160,\"start\":32099},{\"end\":33468,\"start\":33447},{\"end\":33518,\"start\":33471},{\"end\":37883,\"start\":37862},{\"end\":41824,\"start\":41782},{\"end\":42543,\"start\":42520},{\"end\":44328,\"start\":44274},{\"end\":45739,\"start\":45723},{\"end\":47182,\"start\":47150},{\"end\":48635,\"start\":48607},{\"end\":50710,\"start\":50687},{\"end\":51432,\"start\":51409},{\"end\":53708,\"start\":53700},{\"end\":55340,\"start\":55332},{\"end\":56672,\"start\":56664}]", "table": null, "figure_caption": "[{\"end\":55330,\"start\":53710},{\"end\":56662,\"start\":55342},{\"end\":58867,\"start\":56674},{\"end\":59137,\"start\":58870},{\"end\":59389,\"start\":59140}]", "figure_ref": "[{\"end\":8736,\"start\":8728},{\"attributes\":{\"ref_id\":\"fig_3\"},\"end\":10915,\"start\":10908},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":11911,\"start\":11903},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":12298,\"start\":12291},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":12343,\"start\":12337},{\"end\":13492,\"start\":13484},{\"end\":13939,\"start\":13931},{\"end\":14901,\"start\":14894},{\"attributes\":{\"ref_id\":\"fig_2\"},\"end\":15682,\"start\":15674},{\"end\":15974,\"start\":15968},{\"attributes\":{\"ref_id\":\"fig_2\"},\"end\":18187,\"start\":18180},{\"end\":19655,\"start\":19648},{\"attributes\":{\"ref_id\":\"fig_3\"},\"end\":21343,\"start\":21326},{\"end\":21536,\"start\":21528},{\"end\":23635,\"start\":23629},{\"attributes\":{\"ref_id\":\"fig_3\"},\"end\":26532,\"start\":26515},{\"attributes\":{\"ref_id\":\"fig_3\"},\"end\":26856,\"start\":26839},{\"end\":27044,\"start\":27035},{\"attributes\":{\"ref_id\":\"fig_3\"},\"end\":27567,\"start\":27558},{\"attributes\":{\"ref_id\":\"fig_3\"},\"end\":27693,\"start\":27684},{\"end\":33822,\"start\":33814},{\"end\":35358,\"start\":35349},{\"end\":41494,\"start\":41488},{\"end\":41525,\"start\":41519},{\"end\":41707,\"start\":41700},{\"end\":44126,\"start\":44119},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":48513,\"start\":48506},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":48603,\"start\":48580},{\"end\":49964,\"start\":49929},{\"end\":52556,\"start\":52549},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":52603,\"start\":52596},{\"end\":52681,\"start\":52674},{\"attributes\":{\"ref_id\":\"fig_2\"},\"end\":52827,\"start\":52820},{\"attributes\":{\"ref_id\":\"fig_3\"},\"end\":52914,\"start\":52907},{\"end\":52974,\"start\":52967},{\"end\":53013,\"start\":53006},{\"end\":53068,\"start\":53061},{\"end\":53124,\"start\":53117},{\"end\":53150,\"start\":53142}]", "bib_author_first_name": "[{\"end\":59795,\"start\":59794},{\"end\":59807,\"start\":59806},{\"end\":60035,\"start\":60034},{\"end\":60044,\"start\":60043},{\"end\":60205,\"start\":60204},{\"end\":60207,\"start\":60206},{\"end\":60218,\"start\":60217},{\"end\":60373,\"start\":60372},{\"end\":60388,\"start\":60387},{\"end\":60391,\"start\":60389},{\"end\":60399,\"start\":60398},{\"end\":60401,\"start\":60400},{\"end\":60760,\"start\":60759},{\"end\":60771,\"start\":60770},{\"end\":60902,\"start\":60901},{\"end\":60905,\"start\":60903},{\"end\":60913,\"start\":60912},{\"end\":60924,\"start\":60923},{\"end\":61275,\"start\":61274},{\"end\":61288,\"start\":61287},{\"end\":61294,\"start\":61293},{\"end\":61699,\"start\":61698},{\"end\":61701,\"start\":61700},{\"end\":61712,\"start\":61711},{\"end\":61714,\"start\":61713},{\"end\":61725,\"start\":61724},{\"end\":61727,\"start\":61726},{\"end\":62003,\"start\":62002},{\"end\":62005,\"start\":62004},{\"end\":62015,\"start\":62014},{\"end\":62017,\"start\":62016},{\"end\":62221,\"start\":62220},{\"end\":62223,\"start\":62222},{\"end\":62231,\"start\":62230},{\"end\":62233,\"start\":62232},{\"end\":62244,\"start\":62243},{\"end\":62246,\"start\":62245},{\"end\":62257,\"start\":62256},{\"end\":62259,\"start\":62258},{\"end\":62513,\"start\":62512},{\"end\":62515,\"start\":62514},{\"end\":62525,\"start\":62524},{\"end\":62527,\"start\":62526},{\"end\":62535,\"start\":62534},{\"end\":62537,\"start\":62536},{\"end\":62548,\"start\":62547},{\"end\":62550,\"start\":62549},{\"end\":62770,\"start\":62769},{\"end\":62781,\"start\":62780},{\"end\":62795,\"start\":62791},{\"end\":63146,\"start\":63145},{\"end\":63160,\"start\":63156},{\"end\":63177,\"start\":63176},{\"end\":63582,\"start\":63581},{\"end\":63584,\"start\":63583},{\"end\":63701,\"start\":63700},{\"end\":63856,\"start\":63855},{\"end\":63858,\"start\":63857},{\"end\":64043,\"start\":64042},{\"end\":64146,\"start\":64145},{\"end\":64392,\"start\":64391},{\"end\":64403,\"start\":64402},{\"end\":64411,\"start\":64410},{\"end\":64671,\"start\":64670},{\"end\":64681,\"start\":64680},{\"end\":64693,\"start\":64692},{\"end\":64703,\"start\":64702},{\"end\":64921,\"start\":64920},{\"end\":64925,\"start\":64922},{\"end\":65107,\"start\":65106},{\"end\":65116,\"start\":65115},{\"end\":65297,\"start\":65296},{\"end\":65307,\"start\":65306},{\"end\":65319,\"start\":65318},{\"end\":65543,\"start\":65542},{\"end\":65554,\"start\":65553},{\"end\":65556,\"start\":65555},{\"end\":65566,\"start\":65565},{\"end\":65568,\"start\":65567},{\"end\":65579,\"start\":65578},{\"end\":65581,\"start\":65580},{\"end\":65796,\"start\":65795},{\"end\":65798,\"start\":65797},{\"end\":65966,\"start\":65965},{\"end\":65975,\"start\":65974},{\"end\":65983,\"start\":65982},{\"end\":65992,\"start\":65991},{\"end\":65994,\"start\":65993},{\"end\":66003,\"start\":66002},{\"end\":66005,\"start\":66004},{\"end\":66245,\"start\":66244},{\"end\":66260,\"start\":66259},{\"end\":66490,\"start\":66489},{\"end\":66505,\"start\":66504},{\"end\":66514,\"start\":66513},{\"end\":66533,\"start\":66532},{\"end\":66550,\"start\":66549},{\"end\":66571,\"start\":66570},{\"end\":66587,\"start\":66586},{\"end\":66589,\"start\":66588},{\"end\":66598,\"start\":66597},{\"end\":66613,\"start\":66612},{\"end\":66624,\"start\":66623},{\"end\":67014,\"start\":67013},{\"end\":67020,\"start\":67019},{\"end\":67022,\"start\":67021},{\"end\":67033,\"start\":67032},{\"end\":67035,\"start\":67034},{\"end\":67045,\"start\":67044},{\"end\":67049,\"start\":67046},{\"end\":67061,\"start\":67057},{\"end\":67070,\"start\":67069},{\"end\":67072,\"start\":67071},{\"end\":67084,\"start\":67083},{\"end\":67086,\"start\":67085},{\"end\":67097,\"start\":67096},{\"end\":67595,\"start\":67594},{\"end\":67604,\"start\":67603},{\"end\":67854,\"start\":67853},{\"end\":68076,\"start\":68072},{\"end\":68083,\"start\":68082},{\"end\":68089,\"start\":68088},{\"end\":68097,\"start\":68096},{\"end\":68309,\"start\":68308},{\"end\":68311,\"start\":68310},{\"end\":68322,\"start\":68321},{\"end\":68333,\"start\":68332},{\"end\":68335,\"start\":68334},{\"end\":68346,\"start\":68345},{\"end\":68348,\"start\":68347},{\"end\":68581,\"start\":68580},{\"end\":68597,\"start\":68596},{\"end\":68611,\"start\":68610},{\"end\":68851,\"start\":68850},{\"end\":68865,\"start\":68864},{\"end\":68867,\"start\":68866},{\"end\":68881,\"start\":68880},{\"end\":68883,\"start\":68882},{\"end\":68897,\"start\":68896},{\"end\":68899,\"start\":68898},{\"end\":68909,\"start\":68908},{\"end\":69146,\"start\":69145},{\"end\":69156,\"start\":69155},{\"end\":69158,\"start\":69157},{\"end\":69167,\"start\":69166},{\"end\":69179,\"start\":69178},{\"end\":69189,\"start\":69188},{\"end\":69191,\"start\":69190},{\"end\":69204,\"start\":69203},{\"end\":69215,\"start\":69214},{\"end\":69224,\"start\":69223},{\"end\":69234,\"start\":69233},{\"end\":69236,\"start\":69235},{\"end\":69245,\"start\":69244},{\"end\":69254,\"start\":69253},{\"end\":69268,\"start\":69267},{\"end\":69275,\"start\":69274},{\"end\":69277,\"start\":69276},{\"end\":69288,\"start\":69287},{\"end\":69290,\"start\":69289},{\"end\":69300,\"start\":69299},{\"end\":69311,\"start\":69310},{\"end\":69320,\"start\":69319},{\"end\":69328,\"start\":69327},{\"end\":69341,\"start\":69340},{\"end\":69354,\"start\":69353},{\"end\":69356,\"start\":69355},{\"end\":69365,\"start\":69364},{\"end\":69367,\"start\":69366},{\"end\":69377,\"start\":69376},{\"end\":69387,\"start\":69386},{\"end\":69396,\"start\":69395},{\"end\":69408,\"start\":69407},{\"end\":69417,\"start\":69416},{\"end\":69428,\"start\":69427},{\"end\":69926,\"start\":69925},{\"end\":69928,\"start\":69927},{\"end\":69936,\"start\":69935},{\"end\":69938,\"start\":69937},{\"end\":70105,\"start\":70104},{\"end\":70107,\"start\":70106},{\"end\":70309,\"start\":70308},{\"end\":70322,\"start\":70321},{\"end\":70335,\"start\":70334},{\"end\":70347,\"start\":70346},{\"end\":70357,\"start\":70356},{\"end\":70368,\"start\":70367},{\"end\":70378,\"start\":70377},{\"end\":70389,\"start\":70388},{\"end\":70405,\"start\":70404},{\"end\":70414,\"start\":70413},{\"end\":70425,\"start\":70424},{\"end\":70439,\"start\":70438},{\"end\":70449,\"start\":70448},{\"end\":70463,\"start\":70462},{\"end\":70474,\"start\":70473},{\"end\":70484,\"start\":70483}]", "bib_author_last_name": "[{\"end\":59804,\"start\":59796},{\"end\":59818,\"start\":59808},{\"end\":60041,\"start\":60036},{\"end\":60053,\"start\":60045},{\"end\":60215,\"start\":60208},{\"end\":60227,\"start\":60219},{\"end\":60385,\"start\":60374},{\"end\":60396,\"start\":60392},{\"end\":60407,\"start\":60402},{\"end\":60768,\"start\":60761},{\"end\":60778,\"start\":60772},{\"end\":60910,\"start\":60906},{\"end\":60921,\"start\":60914},{\"end\":60930,\"start\":60925},{\"end\":61285,\"start\":61276},{\"end\":61291,\"start\":61289},{\"end\":61300,\"start\":61295},{\"end\":61315,\"start\":61302},{\"end\":61709,\"start\":61702},{\"end\":61722,\"start\":61715},{\"end\":61732,\"start\":61728},{\"end\":62012,\"start\":62006},{\"end\":62027,\"start\":62018},{\"end\":62228,\"start\":62224},{\"end\":62241,\"start\":62234},{\"end\":62254,\"start\":62247},{\"end\":62264,\"start\":62260},{\"end\":62522,\"start\":62516},{\"end\":62532,\"start\":62528},{\"end\":62545,\"start\":62538},{\"end\":62558,\"start\":62551},{\"end\":62778,\"start\":62771},{\"end\":62789,\"start\":62782},{\"end\":62809,\"start\":62796},{\"end\":63154,\"start\":63147},{\"end\":63174,\"start\":63161},{\"end\":63192,\"start\":63178},{\"end\":63591,\"start\":63585},{\"end\":63708,\"start\":63702},{\"end\":63867,\"start\":63859},{\"end\":64051,\"start\":64044},{\"end\":64151,\"start\":64147},{\"end\":64400,\"start\":64393},{\"end\":64408,\"start\":64404},{\"end\":64417,\"start\":64412},{\"end\":64678,\"start\":64672},{\"end\":64690,\"start\":64682},{\"end\":64700,\"start\":64694},{\"end\":64710,\"start\":64704},{\"end\":64934,\"start\":64926},{\"end\":65113,\"start\":65108},{\"end\":65122,\"start\":65117},{\"end\":65304,\"start\":65298},{\"end\":65316,\"start\":65308},{\"end\":65329,\"start\":65320},{\"end\":65551,\"start\":65544},{\"end\":65563,\"start\":65557},{\"end\":65576,\"start\":65569},{\"end\":65589,\"start\":65582},{\"end\":65806,\"start\":65799},{\"end\":65972,\"start\":65967},{\"end\":65980,\"start\":65976},{\"end\":65989,\"start\":65984},{\"end\":66000,\"start\":65995},{\"end\":66011,\"start\":66006},{\"end\":66257,\"start\":66246},{\"end\":66267,\"start\":66261},{\"end\":66502,\"start\":66491},{\"end\":66511,\"start\":66506},{\"end\":66530,\"start\":66515},{\"end\":66547,\"start\":66534},{\"end\":66568,\"start\":66551},{\"end\":66584,\"start\":66572},{\"end\":66595,\"start\":66590},{\"end\":66610,\"start\":66599},{\"end\":66621,\"start\":66614},{\"end\":66631,\"start\":66625},{\"end\":67017,\"start\":67015},{\"end\":67030,\"start\":67023},{\"end\":67042,\"start\":67036},{\"end\":67055,\"start\":67050},{\"end\":67067,\"start\":67062},{\"end\":67081,\"start\":67073},{\"end\":67094,\"start\":67087},{\"end\":67106,\"start\":67098},{\"end\":67601,\"start\":67596},{\"end\":67616,\"start\":67605},{\"end\":67865,\"start\":67855},{\"end\":68080,\"start\":68077},{\"end\":68086,\"start\":68084},{\"end\":68094,\"start\":68090},{\"end\":68105,\"start\":68098},{\"end\":68319,\"start\":68312},{\"end\":68330,\"start\":68323},{\"end\":68343,\"start\":68336},{\"end\":68357,\"start\":68349},{\"end\":68594,\"start\":68582},{\"end\":68608,\"start\":68598},{\"end\":68620,\"start\":68612},{\"end\":68862,\"start\":68852},{\"end\":68878,\"start\":68868},{\"end\":68894,\"start\":68884},{\"end\":68906,\"start\":68900},{\"end\":68916,\"start\":68910},{\"end\":69153,\"start\":69147},{\"end\":69164,\"start\":69159},{\"end\":69176,\"start\":69168},{\"end\":69186,\"start\":69180},{\"end\":69201,\"start\":69192},{\"end\":69212,\"start\":69205},{\"end\":69221,\"start\":69216},{\"end\":69231,\"start\":69225},{\"end\":69242,\"start\":69237},{\"end\":69251,\"start\":69246},{\"end\":69265,\"start\":69255},{\"end\":69272,\"start\":69269},{\"end\":69285,\"start\":69278},{\"end\":69297,\"start\":69291},{\"end\":69308,\"start\":69301},{\"end\":69317,\"start\":69312},{\"end\":69325,\"start\":69321},{\"end\":69338,\"start\":69329},{\"end\":69351,\"start\":69342},{\"end\":69362,\"start\":69357},{\"end\":69374,\"start\":69368},{\"end\":69384,\"start\":69378},{\"end\":69393,\"start\":69388},{\"end\":69405,\"start\":69397},{\"end\":69414,\"start\":69409},{\"end\":69425,\"start\":69418},{\"end\":69436,\"start\":69429},{\"end\":69933,\"start\":69929},{\"end\":69943,\"start\":69939},{\"end\":70114,\"start\":70108},{\"end\":70319,\"start\":70310},{\"end\":70332,\"start\":70323},{\"end\":70344,\"start\":70336},{\"end\":70354,\"start\":70348},{\"end\":70365,\"start\":70358},{\"end\":70375,\"start\":70369},{\"end\":70386,\"start\":70379},{\"end\":70402,\"start\":70390},{\"end\":70411,\"start\":70406},{\"end\":70422,\"start\":70415},{\"end\":70436,\"start\":70426},{\"end\":70446,\"start\":70440},{\"end\":70460,\"start\":70450},{\"end\":70471,\"start\":70464},{\"end\":70481,\"start\":70475},{\"end\":70494,\"start\":70485}]", "bib_entry": "[{\"attributes\":{\"id\":\"b0\"},\"end\":60015,\"start\":59794},{\"attributes\":{\"id\":\"b1\",\"matched_paper_id\":28087717},\"end\":60135,\"start\":60017},{\"attributes\":{\"id\":\"b2\",\"matched_paper_id\":8818680},\"end\":60370,\"start\":60137},{\"attributes\":{\"id\":\"b3\"},\"end\":60699,\"start\":60372},{\"attributes\":{\"id\":\"b4\",\"matched_paper_id\":7366016},\"end\":60899,\"start\":60701},{\"attributes\":{\"id\":\"b5\"},\"end\":61205,\"start\":60901},{\"attributes\":{\"id\":\"b6\",\"matched_paper_id\":59826221},\"end\":61597,\"start\":61207},{\"attributes\":{\"id\":\"b7\",\"matched_paper_id\":1594001},\"end\":61960,\"start\":61599},{\"attributes\":{\"id\":\"b8\",\"matched_paper_id\":32455558},\"end\":62161,\"start\":61962},{\"attributes\":{\"id\":\"b9\",\"matched_paper_id\":4575852},\"end\":62424,\"start\":62163},{\"attributes\":{\"id\":\"b10\",\"matched_paper_id\":8598995},\"end\":62767,\"start\":62426},{\"attributes\":{\"id\":\"b11\"},\"end\":63143,\"start\":62769},{\"attributes\":{\"id\":\"b12\"},\"end\":63533,\"start\":63145},{\"attributes\":{\"id\":\"b13\",\"matched_paper_id\":17870175},\"end\":63698,\"start\":63535},{\"attributes\":{\"id\":\"b14\"},\"end\":63853,\"start\":63700},{\"attributes\":{\"id\":\"b15\"},\"end\":64003,\"start\":63855},{\"attributes\":{\"id\":\"b16\",\"matched_paper_id\":123722079},\"end\":64143,\"start\":64005},{\"attributes\":{\"id\":\"b17\"},\"end\":64290,\"start\":64145},{\"attributes\":{\"id\":\"b18\",\"matched_paper_id\":14123140},\"end\":64591,\"start\":64292},{\"attributes\":{\"id\":\"b19\",\"matched_paper_id\":1850652},\"end\":64878,\"start\":64593},{\"attributes\":{\"id\":\"b20\",\"matched_paper_id\":141186556},\"end\":65054,\"start\":64880},{\"attributes\":{\"id\":\"b21\"},\"end\":65235,\"start\":65056},{\"attributes\":{\"id\":\"b22\",\"matched_paper_id\":11607124},\"end\":65490,\"start\":65237},{\"attributes\":{\"id\":\"b23\",\"matched_paper_id\":13884173},\"end\":65759,\"start\":65492},{\"attributes\":{\"id\":\"b24\",\"matched_paper_id\":119846844},\"end\":65907,\"start\":65761},{\"attributes\":{\"id\":\"b25\",\"matched_paper_id\":4833725},\"end\":66176,\"start\":65909},{\"attributes\":{\"id\":\"b26\",\"matched_paper_id\":205088289},\"end\":66399,\"start\":66178},{\"attributes\":{\"id\":\"b27\",\"matched_paper_id\":13840836},\"end\":66929,\"start\":66401},{\"attributes\":{\"id\":\"b28\",\"matched_paper_id\":2162406},\"end\":67386,\"start\":66931},{\"attributes\":{\"id\":\"b29\"},\"end\":67502,\"start\":67388},{\"attributes\":{\"id\":\"b30\",\"matched_paper_id\":7439208},\"end\":67793,\"start\":67504},{\"attributes\":{\"id\":\"b31\",\"matched_paper_id\":26533873},\"end\":67999,\"start\":67795},{\"attributes\":{\"id\":\"b32\",\"matched_paper_id\":119534226},\"end\":68268,\"start\":68001},{\"attributes\":{\"id\":\"b33\",\"matched_paper_id\":1459299},\"end\":68503,\"start\":68270},{\"attributes\":{\"id\":\"b34\",\"matched_paper_id\":14949411},\"end\":68789,\"start\":68505},{\"attributes\":{\"id\":\"b35\",\"matched_paper_id\":1046577},\"end\":69106,\"start\":68791},{\"attributes\":{\"id\":\"b36\",\"matched_paper_id\":2272000},\"end\":69859,\"start\":69108},{\"attributes\":{\"id\":\"b37\",\"matched_paper_id\":14009137},\"end\":70102,\"start\":69861},{\"attributes\":{\"id\":\"b38\"},\"end\":70264,\"start\":70104},{\"attributes\":{\"id\":\"b39\",\"matched_paper_id\":10659969},\"end\":70807,\"start\":70266}]", "bib_title": "[{\"end\":60032,\"start\":60017},{\"end\":60202,\"start\":60137},{\"end\":60757,\"start\":60701},{\"end\":61272,\"start\":61207},{\"end\":61696,\"start\":61599},{\"end\":62000,\"start\":61962},{\"end\":62218,\"start\":62163},{\"end\":62510,\"start\":62426},{\"end\":63579,\"start\":63535},{\"end\":64040,\"start\":64005},{\"end\":64389,\"start\":64292},{\"end\":64668,\"start\":64593},{\"end\":64918,\"start\":64880},{\"end\":65104,\"start\":65056},{\"end\":65294,\"start\":65237},{\"end\":65540,\"start\":65492},{\"end\":65793,\"start\":65761},{\"end\":65963,\"start\":65909},{\"end\":66242,\"start\":66178},{\"end\":66487,\"start\":66401},{\"end\":67011,\"start\":66931},{\"end\":67592,\"start\":67504},{\"end\":67851,\"start\":67795},{\"end\":68070,\"start\":68001},{\"end\":68306,\"start\":68270},{\"end\":68578,\"start\":68505},{\"end\":68848,\"start\":68791},{\"end\":69143,\"start\":69108},{\"end\":69923,\"start\":69861},{\"end\":70306,\"start\":70266}]", "bib_author": "[{\"end\":59806,\"start\":59794},{\"end\":59820,\"start\":59806},{\"end\":60043,\"start\":60034},{\"end\":60055,\"start\":60043},{\"end\":60217,\"start\":60204},{\"end\":60229,\"start\":60217},{\"end\":60387,\"start\":60372},{\"end\":60398,\"start\":60387},{\"end\":60409,\"start\":60398},{\"end\":60770,\"start\":60759},{\"end\":60780,\"start\":60770},{\"end\":60912,\"start\":60901},{\"end\":60923,\"start\":60912},{\"end\":60932,\"start\":60923},{\"end\":61287,\"start\":61274},{\"end\":61293,\"start\":61287},{\"end\":61302,\"start\":61293},{\"end\":61317,\"start\":61302},{\"end\":61711,\"start\":61698},{\"end\":61724,\"start\":61711},{\"end\":61734,\"start\":61724},{\"end\":62014,\"start\":62002},{\"end\":62029,\"start\":62014},{\"end\":62230,\"start\":62220},{\"end\":62243,\"start\":62230},{\"end\":62256,\"start\":62243},{\"end\":62266,\"start\":62256},{\"end\":62524,\"start\":62512},{\"end\":62534,\"start\":62524},{\"end\":62547,\"start\":62534},{\"end\":62560,\"start\":62547},{\"end\":62780,\"start\":62769},{\"end\":62791,\"start\":62780},{\"end\":62811,\"start\":62791},{\"end\":63156,\"start\":63145},{\"end\":63176,\"start\":63156},{\"end\":63194,\"start\":63176},{\"end\":63593,\"start\":63581},{\"end\":63710,\"start\":63700},{\"end\":63869,\"start\":63855},{\"end\":64053,\"start\":64042},{\"end\":64153,\"start\":64145},{\"end\":64402,\"start\":64391},{\"end\":64410,\"start\":64402},{\"end\":64419,\"start\":64410},{\"end\":64680,\"start\":64670},{\"end\":64692,\"start\":64680},{\"end\":64702,\"start\":64692},{\"end\":64712,\"start\":64702},{\"end\":64936,\"start\":64920},{\"end\":65115,\"start\":65106},{\"end\":65124,\"start\":65115},{\"end\":65306,\"start\":65296},{\"end\":65318,\"start\":65306},{\"end\":65331,\"start\":65318},{\"end\":65553,\"start\":65542},{\"end\":65565,\"start\":65553},{\"end\":65578,\"start\":65565},{\"end\":65591,\"start\":65578},{\"end\":65808,\"start\":65795},{\"end\":65974,\"start\":65965},{\"end\":65982,\"start\":65974},{\"end\":65991,\"start\":65982},{\"end\":66002,\"start\":65991},{\"end\":66013,\"start\":66002},{\"end\":66259,\"start\":66244},{\"end\":66269,\"start\":66259},{\"end\":66504,\"start\":66489},{\"end\":66513,\"start\":66504},{\"end\":66532,\"start\":66513},{\"end\":66549,\"start\":66532},{\"end\":66570,\"start\":66549},{\"end\":66586,\"start\":66570},{\"end\":66597,\"start\":66586},{\"end\":66612,\"start\":66597},{\"end\":66623,\"start\":66612},{\"end\":66633,\"start\":66623},{\"end\":67019,\"start\":67013},{\"end\":67032,\"start\":67019},{\"end\":67044,\"start\":67032},{\"end\":67057,\"start\":67044},{\"end\":67069,\"start\":67057},{\"end\":67083,\"start\":67069},{\"end\":67096,\"start\":67083},{\"end\":67108,\"start\":67096},{\"end\":67603,\"start\":67594},{\"end\":67618,\"start\":67603},{\"end\":67867,\"start\":67853},{\"end\":68082,\"start\":68072},{\"end\":68088,\"start\":68082},{\"end\":68096,\"start\":68088},{\"end\":68107,\"start\":68096},{\"end\":68321,\"start\":68308},{\"end\":68332,\"start\":68321},{\"end\":68345,\"start\":68332},{\"end\":68359,\"start\":68345},{\"end\":68596,\"start\":68580},{\"end\":68610,\"start\":68596},{\"end\":68622,\"start\":68610},{\"end\":68864,\"start\":68850},{\"end\":68880,\"start\":68864},{\"end\":68896,\"start\":68880},{\"end\":68908,\"start\":68896},{\"end\":68918,\"start\":68908},{\"end\":69155,\"start\":69145},{\"end\":69166,\"start\":69155},{\"end\":69178,\"start\":69166},{\"end\":69188,\"start\":69178},{\"end\":69203,\"start\":69188},{\"end\":69214,\"start\":69203},{\"end\":69223,\"start\":69214},{\"end\":69233,\"start\":69223},{\"end\":69244,\"start\":69233},{\"end\":69253,\"start\":69244},{\"end\":69267,\"start\":69253},{\"end\":69274,\"start\":69267},{\"end\":69287,\"start\":69274},{\"end\":69299,\"start\":69287},{\"end\":69310,\"start\":69299},{\"end\":69319,\"start\":69310},{\"end\":69327,\"start\":69319},{\"end\":69340,\"start\":69327},{\"end\":69353,\"start\":69340},{\"end\":69364,\"start\":69353},{\"end\":69376,\"start\":69364},{\"end\":69386,\"start\":69376},{\"end\":69395,\"start\":69386},{\"end\":69407,\"start\":69395},{\"end\":69416,\"start\":69407},{\"end\":69427,\"start\":69416},{\"end\":69438,\"start\":69427},{\"end\":69935,\"start\":69925},{\"end\":69945,\"start\":69935},{\"end\":70116,\"start\":70104},{\"end\":70321,\"start\":70308},{\"end\":70334,\"start\":70321},{\"end\":70346,\"start\":70334},{\"end\":70356,\"start\":70346},{\"end\":70367,\"start\":70356},{\"end\":70377,\"start\":70367},{\"end\":70388,\"start\":70377},{\"end\":70404,\"start\":70388},{\"end\":70413,\"start\":70404},{\"end\":70424,\"start\":70413},{\"end\":70438,\"start\":70424},{\"end\":70448,\"start\":70438},{\"end\":70462,\"start\":70448},{\"end\":70473,\"start\":70462},{\"end\":70483,\"start\":70473},{\"end\":70496,\"start\":70483}]", "bib_venue": "[{\"end\":59867,\"start\":59820},{\"end\":60062,\"start\":60055},{\"end\":60240,\"start\":60229},{\"end\":60486,\"start\":60409},{\"end\":60787,\"start\":60780},{\"end\":60998,\"start\":60932},{\"end\":61356,\"start\":61317},{\"end\":61762,\"start\":61734},{\"end\":62046,\"start\":62029},{\"end\":62274,\"start\":62266},{\"end\":62575,\"start\":62560},{\"end\":62903,\"start\":62811},{\"end\":63286,\"start\":63194},{\"end\":63602,\"start\":63593},{\"end\":63749,\"start\":63710},{\"end\":63909,\"start\":63869},{\"end\":64062,\"start\":64053},{\"end\":64202,\"start\":64153},{\"end\":64429,\"start\":64419},{\"end\":64721,\"start\":64712},{\"end\":64953,\"start\":64936},{\"end\":65133,\"start\":65124},{\"end\":65346,\"start\":65331},{\"end\":65606,\"start\":65591},{\"end\":65821,\"start\":65808},{\"end\":66025,\"start\":66013},{\"end\":66275,\"start\":66269},{\"end\":66647,\"start\":66633},{\"end\":67136,\"start\":67108},{\"end\":67430,\"start\":67390},{\"end\":67633,\"start\":67618},{\"end\":67882,\"start\":67867},{\"end\":68118,\"start\":68107},{\"end\":68368,\"start\":68359},{\"end\":68630,\"start\":68622},{\"end\":68931,\"start\":68918},{\"end\":69455,\"start\":69438},{\"end\":69967,\"start\":69945},{\"end\":70156,\"start\":70116},{\"end\":70515,\"start\":70496},{\"end\":60550,\"start\":60488},{\"end\":61051,\"start\":61000},{\"end\":61377,\"start\":61369},{\"end\":62982,\"start\":62905},{\"end\":63365,\"start\":63288}]"}}}, "year": 2023, "month": 12, "day": 17}