{"id": 211204736, "updated": "2023-10-06 18:56:27.703", "metadata": {"title": "REALM: Retrieval-Augmented Language Model Pre-Training", "authors": "[{\"first\":\"Kelvin\",\"last\":\"Guu\",\"middle\":[]},{\"first\":\"Kenton\",\"last\":\"Lee\",\"middle\":[]},{\"first\":\"Zora\",\"last\":\"Tung\",\"middle\":[]},{\"first\":\"Panupong\",\"last\":\"Pasupat\",\"middle\":[]},{\"first\":\"Ming-Wei\",\"last\":\"Chang\",\"middle\":[]}]", "venue": "ArXiv", "journal": "ArXiv", "publication_date": {"year": 2020, "month": 2, "day": 10}, "abstract": "Language model pre-training has been shown to capture a surprising amount of world knowledge, crucial for NLP tasks such as question answering. However, this knowledge is stored implicitly in the parameters of a neural network, requiring ever-larger networks to cover more facts. To capture knowledge in a more modular and interpretable way, we augment language model pre-training with a latent knowledge retriever, which allows the model to retrieve and attend over documents from a large corpus such as Wikipedia, used during pre-training, fine-tuning and inference. For the first time, we show how to pre-train such a knowledge retriever in an unsupervised manner, using masked language modeling as the learning signal and backpropagating through a retrieval step that considers millions of documents. We demonstrate the effectiveness of Retrieval-Augmented Language Model pre-training (REALM) by fine-tuning on the challenging task of Open-domain Question Answering (Open-QA). We compare against state-of-the-art models for both explicit and implicit knowledge storage on three popular Open-QA benchmarks, and find that we outperform all previous methods by a significant margin (4-16% absolute accuracy), while also providing qualitative benefits such as interpretability and modularity.", "fields_of_study": "[\"Computer Science\"]", "external_ids": {"arxiv": "2002.08909", "mag": "3034671305", "acl": null, "pubmed": null, "pubmedcentral": null, "dblp": "conf/icml/GuuLTPC20", "doi": null}}, "content": {"source": {"pdf_hash": "832fff14d2ed50eb7969c4c4b976c35776548f56", "pdf_src": "Arxiv", "pdf_uri": "[\"https://arxiv.org/pdf/2002.08909v1.pdf\"]", "oa_url_match": false, "oa_info": null}, "grobid": {"id": "0996ad250ed58b6fe1de799f4721438d52916b47", "type": "plain-text", "url": "s3://ai2-s2-pdf-extraction-prod/parse-results/s2orc_worker/832fff14d2ed50eb7969c4c4b976c35776548f56.txt", "contents": "\nREALM: Retrieval-Augmented Language Model Pre-Training\n10 Feb 2020\n\nKelvin Guu \nKenton Lee \nZora Tung \nPanupong Pasupat \nMing-Wei Chang \nREALM: Retrieval-Augmented Language Model Pre-Training\n10 Feb 2020\nLanguage model pre-training has been shown to capture a surprising amount of world knowledge, crucial for NLP tasks such as question answering. However, this knowledge is stored implicitly in the parameters of a neural network, requiring ever-larger networks to cover more facts. To capture knowledge in a more modular and interpretable way, we augment language model pretraining with a latent knowledge retriever, which allows the model to retrieve and attend over documents from a large corpus such as Wikipedia, used during pre-training, fine-tuning and inference. For the first time, we show how to pretrain such a knowledge retriever in an unsupervised manner, using masked language modeling as the learning signal and backpropagating through a retrieval step that considers millions of documents. We demonstrate the effectiveness of Retrieval-Augmented Language Model pre-training (REALM) by fine-tuning on the challenging task of Open-domain Question Answering (Open-QA). We compare against state-of-theart models for both explicit and implicit knowledge storage on three popular Open-QA benchmarks, and find that we outperform all previous methods by a significant margin (4-16% absolute accuracy), while also providing qualitative benefits such as interpretability and modularity.\n\nIntroduction\n\nRecent advances in language model pre-training have shown that models such as BERT (Devlin et al., 2018), RoBERTa  and T5 (Raffel et al., 2019) store a surprising amount of world knowledge, acquired from the massive text corpora they are trained on (Petroni et al., 2019). For example, BERT is able to * Equal contribution 1 Google Research. Correspondence to: Kelvin Guu <kguu@google.com>, Kenton Lee <ken-tonl@google.com>, Zora Tung <gatoatigrado@google.com>, Panupong Pasupat <ppasupat@google.com>, Ming-Wei Chang <mingweichang@google.com>. Figure 1. REALM augments language model pre-training with a neural knowledge retriever that retrieves knowledge from a textual knowledge corpus, Z (e.g., all of Wikipedia). Signal from the language modeling objective backpropagates all the way through the retriever, which must consider millions of documents in Z-a significant computational challenge that we address. correctly predict the missing word in the following sentence: \"The is the currency of the United\n\nKingdom\" (answer: \"pound\").\n\nIn these language models, the learned world knowledge is stored implicitly in the parameters of the underlying neural network. This makes it difficult to determine what knowledge is stored in the network and where. Furthermore, storage space is limited by the size of the network-to capture more world knowledge, one must train ever-larger networks, which can be prohibitively slow or expensive.\n\nTo capture knowledge in a more interpretable and modular way, we propose a novel framework, Retrieval-Augmented Language Model (REALM) pre-training, which augments language model pre-training algorithms with a learned textual knowledge retriever. In contrast to models that store knowledge in their parameters, this approach explicitly exposes the role of world knowledge by asking the model to decide what knowledge to retrieve and use during inference. Before making each prediction, the language model uses the retriever to retrieve documents 1 from a large corpus such as Wikipedia, and then attends over those documents to help inform its prediction. Learning this model end-toend requires backpropagating through a retrieval step that considers an entire corpus of textual knowledge, as shown in Figure 1.\n\nThe key intuition of REALM is to train the retriever using a performance-based signal from unsupervised text: a retrieval that improves the language model's perplexity is helpful and should be rewarded, while an uninformative retrieval should be penalized. For example, in Figure 1, if the model needs to fill the blank in \"the at the top of the pyramid\", the retriever should be rewarded for selecting a document containing \"The pyramidion on top allows for less material higher up the pyramid\". We achieve this behavior by modeling our retrieve-then-predict approach as a latent variable language model and optimizing the marginal likelihood.\n\nIncorporating a large-scale neural retrieval module during pre-training constitutes a significant computational challenge, since the retriever must consider millions of candidate documents for each pre-training step, and we must backpropagate through its decisions. To address this, we structure the retriever such that the computation performed for each document can be cached and asynchronously updated, and selection of the best documents can be formulated as Maximum Inner Product Search (MIPS).\n\nNumerous prior works have demonstrated the benefit of adding a discrete retrieval step to neural networks (Miller et al., 2016;Chen et al., 2017), but did not apply the framework to language model pre-training and employed non-learned retrievers to handle large-scale document collections. In the language modeling literature, the k-Nearest Neighbor Language Model (Khandelwal et al., 2019) (kNN-LM) retrieves similar LM examples to improve memorization. However, kNN-LM was not finetuned for downstream tasks, perhaps because it is unclear how to adapt the retrieval mechanism: a kNN can only use examples labeled for the target task-during fine-tuning, this precludes LM examples, which contain the desired world knowledge. In contrast, REALM's retriever is designed to transfer to other tasks, and the retrieval is just text, not a labeled example.\n\nWe evaluate our approach by fine-tuning the models pre-trained with REALM on the task of Opendomain Question Answering (Open-QA), one of the most knowledge-intensive tasks in natural language processing. We evaluate on three popular Open-QA benchmarks (NATURALQUESTIONS-OPEN, WEBQUESTIONS, and CURATEDTREC) and compare to state-of-the-art Open-QA models, including both extremely large models that store knowledge implicitly (such as T5) as well as previous approaches that also use a knowledge retriever to access external knowledge, but implement retrieval in a more heuristic fashion Min et al., 2019a;Asai et al., 2019). REALM achieves new state-of-the-art results on all three benchmarks, significantly outperforming all previous systems by 4-16% absolute accuracy. We also demonstrate qualitative benefits of REALM, including interpretability and modularity.\n\n\nBackground\n\nLanguage model pre-training The goal of language model pre-training is to learn useful representations of language, usually from unlabeled text corpora. The resulting pre-trained model can then be further trained (fine-tuned) for a downstream task of primary interest (in our case, Open-QA), often leading to better generalization than training from scratch (Dai & Le, 2015;Radford et al., 2019).\n\nWe focus on the masked language model 2 (MLM) variant of pre-training popularized by BERT (Devlin et al., 2018). In its basic form, an MLM is trained to predict the missing tokens in an input text passage. Given an unlabeled pre-training corpus X (e.g., Wikipedia text), a training example (x, y) can be generated by randomly masking tokens in a sampled piece of text (e.g., x = \"The [MASK] is the currency [MASK] the UK\"; y = (\"pound\", \"of\")). The model uses its representation of the masked input x to predict the token that should go in each mask. A good MLM must learn to encode syntactic and semantic information (e.g., to predict \"of\") as well as some world knowledge (e.g., to predict \"pound\").\n\nOpen-domain question answering (Open-QA) To measure a model's ability to incorporate world knowledge, we need a downstream task where world knowledge is critical. Perhaps one of the most knowledge-intensive tasks in natural language processing is open-domain question answering (Open-QA): given a question x such as \"What is the currency of the UK?\", a model must output the correct answer string y, \"pound\". The \"open\" part of Open-QA refers to the fact that the model does not receive a preidentified document that is known to contain the answer, unlike traditional reading comprehension (RC) tasks such as SQuAD (Rajpurkar et al., 2016;. While RC mod-els comprehend a single document, Open-QA models must retain knowledge from millions of documents, since a question could be about any of them.\n\nWe focus on Open-QA systems that utilize a textual knowledge corpus Z as the knowledge source. Many of these systems employ a retrieval-based approach: given a question x, retrieve potentially relevant documents z from the corpus Z, and then extract an answer y from the documents (Brill et al., 2002;Chen et al., 2017;Lee et al., 2019). Our approach, REALM, is inspired by this paradigm and extends it to language model pre-training. Alternatively, some recent work has proposed generationbased systems that apply a sequence-to-sequence model on x to directly generate y token-by-token Raffel et al., 2019). We will compare against state-of-theart systems from both paradigms in our experiments.\n\n\nApproach\n\nWe start by formalizing REALM's pre-training and finetuning tasks as a retrieve-then-predict generative process in Section 3.1. Then in Section 3.2, we describe the model architectures for each component of that process. In Section 3.3, we show how to implement REALM pre-training and fine-tuning by maximizing the likelihood of REALM's generative process. En route, we address important computational challenges, explain why training works, and also discuss strategies for injecting useful inductive biases. The overall framework is illustrated in Figure 2.\n\n\nREALM's generative process\n\nFor both pre-training and fine-tuning, REALM takes some input x and learns a distribution p(y | x) over possible outputs y. For pre-training, the task is masked language modeling: x is a sentence from a pre-training corpus X with some tokens masked out, and the model must predict the value of those missing tokens, y. For fine-tuning, the task is Open-QA: x is a question, and y is the answer.\n\nREALM decomposes p(y | x) into two steps: retrieve, then predict. Given an input x, we first retrieve possibly helpful documents z from a knowledge corpus Z. We model this as a sample from the distribution p(z | x). Then, we condition on both the retrieved z and the original input x to generate the output y-modeled as p(y | z, x). To obtain the overall likelihood of generating y, we treat z as a latent variable and marginalize over all possible documents z, yielding\np(y | x) = z∈Z p(y | z, x) p(z | x).\n(1)\n\n\nModel architecture\n\nWe now describe the two key components: the neural knowledge retriever, which models p(z | x), and the knowledge-augmented encoder, which models p(y | z, x).\n\nKnowledge Retriever The retriever is defined using a dense inner product model:\np(z | x) = exp f (x, z) z ′ exp f (x, z ′ ) , f (x, z) = Embed input (x) ⊤ Embed doc (z),\nwhere Embed input and Embed doc are embedding functions that map x and z respectively to d-dimensional vectors.\n\nThe relevance score f (x, z) between x and z is defined as the inner product of the vector embeddings. The retrieval distribution is the softmax over all relevance scores.\n\nWe implement the embedding functions using BERT-style Transformers (Devlin et al., 2018). Following standard practices, we join spans of text by applying wordpiece tokenization, separating them with [SEP] tokens, prefixing a [CLS] token, and appending a final [SEP] token.\njoin BERT (x) = [CLS]x[SEP] join BERT (x 1 , x 2 ) = [CLS]x 1 [SEP]x 2 [SEP]\nAs in Devlin et al. (2018), we pass this into a Transformer, which produces one vector for each token, including the vector corresponding to [CLS] which is used as a \"pooled\" representation of the sequence (denoted BERT CLS ). Finally, we perform a linear projection to reduce the dimensionality of the vector, denoted as a projection matrix W:\nEmbed input (x) = W input BERT CLS (join BERT (x)) Embed doc (z) = W doc BERT CLS (join BERT (z title , z body ))\nwhere z title is the document's title and z body is its body. We let θ denote all parameters associated with the retriever, which include the Transformer and projection matrices.\n\nKnowledge-Augmented Encoder Given an input x and a retrieved document z, the knowledge-augmented encoder defines p(y | z, x). We join x and z into a single sequence that we feed into a Transformer (distinct from the one used in the retriever). This allows us to perform rich crossattention between x and z before predicting y. See Figure 1 for a concrete example.\n\nAt this stage, the architectures for pre-training and finetuning differ slightly. For the masked language model pretraining task, we must predict the original value of each [MASK] token in x. To do so, we use the same masked language modeling (MLM) loss as in Devlin et al. (2018):\np(y | z, x) = Jx j=1 p(y j | z, x) p(y j | z, x) ∝ exp w ⊤ j BERT MASK(j) (join BERT (x, z body ))\nwhere BERT MASK(j) denotes the Transformer output vector corresponding to the j th masked token, J x is the total number of [MASK] tokens in x, and w j is a learned word embedding for token y j .\n\nFor Open-QA fine-tuning, we wish to produce the answer string y. Following previous reading comprehension work (Rajpurkar et al., 2016;Seo et al., 2016;Lee et al., 2016;Clark & Gardner, 2017), we will assume that the answer y can be found as a contiguous sequence of tokens in some document z. Let S(z, y) be the set of spans matching y in z. Then we can define p(y | z, x) as:\np(y | z, x) ∝ s∈S(z,y) exp MLP h START(s) ; h END(s) h START(s) = BERT START(s) (join BERT (x, z body )), h END(s) = BERT END(s) (join BERT (x, z body )),\nwhere BERT START(s) and BERT END(s) denote the Transformer output vectors corresponding to the start and end tokens of span s, respectively, while MLP denotes a feed-forward neural network. We will let φ denote all parameters associated with the knowledge-augmented encoder.\n\n\nTraining\n\nFor both pre-training and fine-tuning, we train by maximizing the log-likelihood log p(y | x) of the correct output y. Since both the knowledge retriever and knowledgeaugmented encoder are differentiable neural networks, we can compute the gradient of log p(y | x) (defined in Equation 1) with respect to the model parameters θ and φ, and optimize using stochastic gradient descent.\n\nThe key computational challenge is that the marginal probability p(y | x) = z∈Z p(y | x, z) p(z | x) involves a summation over all documents z in the knowledge corpus Z. We approximate this by instead summing over the top k documents with highest probability under p(z | x)-this is reasonable if most documents have near zero probability.\n\nEven with this approximation, we still need an efficient way to find the top k documents. Note that the ordering of documents under p(z | x) is the same as under the relevance score f (x, z) = Embed input (x) ⊤ Embed doc (z), which is an inner product. Thus, we can employ Maximum Inner Product Search (MIPS) algorithms to find the approximate top k documents, using running time and storage space that scale sub-linearly with the number of documents (Ram & Gray, 2012;Shrivastava & Li, 2014;Shen et al., 2015).\n\nTo employ MIPS, we must pre-compute Embed doc (z) for every z ∈ Z and construct an efficient search index over these embeddings. However, this data structure will no longer be consistent with p(z | x) if the parameters θ of Embed doc are later updated. Hence, the search index goes \"stale\" after every gradient update on θ.\n\nOur solution is to \"refresh\" the index by asynchronously re-embedding and re-indexing all documents every several hundred training steps. The MIPS index is slightly stale between refreshes, but note that it is only used to select the top k documents. We recompute p(z | x) and its gradient, using the fresh θ, for these top k documents after retrieving them. In Section 4.5, we empirically demonstrate that this procedure results in stable optimization, provided that refreshes happen at a sufficiently frequent rate.\n\nImplementing asynchronous MIPS refreshes We asynchronously refresh the MIPS index by running two jobs in parallel: a primary trainer job, which performs gradient updates on the parameters, and a secondary index builder job, which embeds and indexes the documents. As shown below, the trainer sends the index builder a snapshot of its parameters, θ ′ . The trainer then continues to train while the index builder uses θ ′ to construct a new index in the background. As soon as the index builder is done, it sends the new index back to the trainer, and the process repeats.\n\nWhile asynchronous refreshes can be used for both pretraining and fine-tuning, in our experiments we only use it for pre-training. For fine-tuning, we just build the MIPS index once (using the pre-trained θ) for simplicity and do not update Embed doc . 3 Note that we still fine-tune Embed input , so the retrieval function is still updated from the query side.\n\nWhat does the retriever learn? Since the knowledge retrieval of REALM is latent, it is not obvious how the training objective encourages meaningful retrievals. Here, we show how it rewards retrievals that improve prediction accuracy.\n\nFor a given query x and document z, recall that f (x, z) is the \"relevance score\" that the knowledge retriever assigns to document z. We can see how a single step of gradient descent during REALM pre-training alters this score by analyzing the gradient with respect to the parameters of the knowledge retriever, θ:\n∇ log p(y | x) = z∈Z r(z)∇f (x, z) r(z) = p(y | z, x) p(y | x) − 1 p(z | x).\nFor each document z, the gradient encourages the retriever to change the score f (x, z) by r(z) -increasing if r(z) is positive, and decreasing if negative. The multiplier r(z) is positive if and only if p(y | z, x) > p(y | x). The term p(y | z, x) is the probability of predicting the correct output y when using document z. The term p(y | x) is the expected value of p(y | x, z) when randomly sampling a document from p(z | x). Hence, document z receives a positive update whenever it performs better than expected.\n\n\nInjecting inductive biases into pre-training\n\nIn the process of developing REALM, we discovered several additional strategies that further guide the model towards meaningful retrievals, described below.\n\nSalient span masking During REALM pre-training, we want to focus on examples x that require world knowledge to predict the masked tokens. As explained in Section 2, some MLM spans only require local context. To focus on problems that require world knowledge, we mask salient spans such as \"United Kingdom\" or \"July 1969\". We use a BERT-based tagger trained on CoNLL-2003 data (Sang & De Meulder, 2003) to identify named entities, and a regular expression to identify dates. We select and mask one of these salient spans within a sentence for the masked language modeling task. We show that this significantly outperforms other masking strategies in Section 4.5.\n\nNull document Even with salient span masking, not all masked tokens require world knowledge to predict. We model this by adding an empty null document ∅ to the top k retrieved documents, allowing appropriate credit to be assigned to a consistent sink when no retrieval is necessary.\n\nProhibiting trivial retrievals If the pre-training corpus X and the knowledge corpus Z are the same, there exists a trivial retrieval candidate z that is too informative: if the masked sentence x comes from document z, the knowledge augmented encoder can trivially predict y by looking at the unmasked version of x in z. This results in a large positive gradient for p(z | x). If this occurs too often, the knowledge retriever ends up learning to look for exact string matches between x and z, which does not capture other forms of relevance. For this reason, we exclude this trivial candidate during pre-training.\n\nInitialization At the beginning of training, if the retriever does not have good embeddings for Embed input (x) and Embed doc (z), the retrieved documents z will likely be unrelated to x. This causes the knowledge augmented encoder to learn to ignore the retrieved documents. Once this occurs, the knowledge retriever does not receive a meaningful gradient and cannot improve, creating a vicious cycle.\n\nTo avoid this cold-start problem, we warm-start Embed input and Embed doc using a simple training objective known as the Inverse Cloze Task (ICT) where, given a sentence, the model is trained to retrieve the document where that sentence came from. We defer to Lee et al. (2019) for details. For the knowledge-augmented encoder, we warmstart it with BERT pre-training-specifically, the uncased BERT-base model (12 layers, 768 hidden units, 12 attention heads).\n\n\nExperiments\n\nWe now evaluate our approach on the Open-QA task. In this section, we describe in detail the benchmarks used and the different approaches to which we compare empirically.\n\n\nOpen-QA Benchmarks\n\nA number of benchmarks have been proposed for Open-QA. In this work, we focus on datasets where the question writers did not already know the answer. This yields questions that reflect more realistic information-seeking needs, and also avoids artifacts that can arise if the question is formulated with a particular answer in mind. A deeper justification is given in Lee et al. (2019). In all cases, the predicted answer is evaluated via exact match with any reference answer, following previous Open-QA work (Chen et al., 2017).\n\n\nNaturalQuestions-Open\n\nThe NaturalQuestions dataset (Kwiatkowski et al., 2019) consists of naturally occurring Google queries and their answers. Each answer also comes with an \"answer type\": following Lee et al. (2019), we only keep questions that are categorized as \"short answer type\" with at most five tokens. The dataset also provides a suggested Wikipedia document to retrieve; like all models we compare against, we do not provide this to our model.\n\n\nWebQuestions\n\nThe WebQuestions dataset (Berant et al., 2013) was collected from the Google Suggest API, using one seed question and expanding the set to related questions. We follow the setting defined by Chen et al. (2017).\n\nCuratedTrec The CuratedTrec dataset is a collection of question-answer pairs drawn from real user queries issued on sites such as MSNSearch and AskJeeves. To account for multiple correct answers or different spelling variations, the answers in this dataset are defined as regular expressions that match all correct answers. It is unclear how to train generation-based models with this type of supervision, so we do not evaluate them on this dataset.\n\n\nApproaches compared\n\nRetrieval-based Open-QA Most existing Open-QA systems answer the input question by first retrieving potentially relevant documents from a knowledge corpus, and then using a reading comprehension system to extract an answer from the documents. In this paradigm, the knowledge is stored explicitly in the corpus. We wish to compare different methods for implementing retrieval.\n\nMany approaches use non-learned heuristic retrieval such as sparse bag-of-words matching (Robertson et al., 2009) or entity linking on the question to select a small set of rel-evant documents (e.g., 20). These documents are typically then re-ranked using a learned model, but coverage may be limited by the initial heuristic retrieval step. Approaches such as DrQA (Chen et al., 2017), HardEM (Min et al., 2019a), GraphRetriever (Min et al., 2019b), and PathRetriever (Asai et al., 2019) in Table 1 are in this category.\n\nSome recent approaches have proposed to implement learnable retrieval using a MIPS index. ORQA  formulates Open-QA using a similar latent variable model as REALM, and also trains by maximizing the marginal likelihood. However, REALM adds a novel language model pre-training step, and backpropagates into the MIPS index, rather than using a fixed index. In Table 1, we directly compare the two. It is also important to note that the retrievers for both REALM pretraining and ORQA are initialized using the Inverse Cloze Task, described in Section 3.4.\n\nGeneration-based Open-QA An emerging alternative approach to Open-QA is to model it as a sequence prediction task: simply encode the question, and then decode the answer token-by-token based on the encoding. While it was initially unclear how large amounts of knowledge could be injected into the model, GPT-2 (Radford et al., 2019) hinted at the possibility of directly generating answers without using any given context via sequence-tosequence. However, their performance was not competitive possibly due to the lack of fine-tuning. Orthogonally, T5 (Raffel et al., 2019) showed that directly generating answers without explicit extraction from the given context is viable approach, but they only experimented on the reading comprehension task, where a context document is provided.\n\nFor the most competitive and comparable generation-based baseline, we compare to concurrent work which fine-tunes T5 for Open-QA (Roberts et al., 2020). 4 We compare against the Base, Large, and even larger 11-billion parameter model to measure the effect of model size.\n\n\nImplementation Details\n\nFine-tuning We reuse all hyperparameters from Lee et al. (2019), to enable direct comparison. Our knowledge corpus is derived from the December 20, 2018 snapshot of English Wikipedia. Documents are greedily split into chunks of up to 288 BERT wordpieces, resulting in just over 13 million retrieval candidates. During finetuning inference, we consider the top-5 candidates, and the We experiment with two choices of the pre-training corpus X : (1) Wikipedia, which is identical to the knowledge corpus Z, and (2) CC-News, our reproduction of the corpus of English news proposed by Liu et al. (2019). Table 1 shows the accuracy of different approaches on the three Open-QA datasets. REALM outperform all previous approaches by a significant margin. Table 1 also shows the number of parameters for each model.\n\n\nMain results\n\nAs reported in the concurrent work of Roberts et al. (2020), the generative Open-QA systems based on T5 are surprisingly powerful, with the largest T5-11B model outperforming the previous best Open-QA system. Increasing the size of T5 yields consistent improvement, but comes at significant computational cost (from Base to 11B, the model is 50 times larger, and gains roughly 5 points in accuracy). In contrast, REALM outperforms the largest T5-11B model while being 30 times smaller. It is also important to note that T5 accesses additional reading comprehension data from SQuAD during its pre-training (100,000+ examples). Access to such data could also benefit REALM, but was not used in our experiments.\n\nAmong all systems, the most direct comparison with REALM is ORQA , where the fine-tuning setup, hyperparameters and training data are identical. The improvement of REALM over ORQA is purely due to better pre-training methods. The results also indicate that our method of pre-training can be applied both on (1) the singlecorpus setting (X = Wikipedia, Z = Wikipedia), or (2) the separate-corpus setting (X = CC-News, Z = Wikipedia).\n\nCompared to other retrieval-based systems (Asai et al., 2019;Min et al., 2019a; which often retrieve from 20 to 80 documents, our system gets the overall best performance while only retrieving 5 documents.\n\n\nAnalysis\n\nIn Table 2 we present results for NaturalQuestions-Open after ablating critical components of REALM. In addition to the end-to-end results, we also report how often the gold answer appears in the top-5 retrievals before applying any fine-tuning. The latter metric more significantly isolates the contribution of improving the retriever during pre-training. Table 3. An example where REALM utilizes retrieved documents to better predict masked tokens. It assigns much higher probability (0.129) to the correct term, \"Fermat\", compared to BERT. (Note that the blank corresponds to 3 BERT wordpieces.)\n\nx: An equilateral triangle is easily constructed using a straightedge and compass, because 3 is a prime.\n\n(a) BERT p(y = \"Fermat\" | x) = 1.1 × 10 −14 (No retrieval.) (b) REALM p(y = \"Fermat\" | x, z) = 1.0 (Conditional probability with document z =\"257 is . . . a Fermat prime. Thus a regular polygon with 257 sides is constructible with compass . . . \") (c) REALM p(y = \"Fermat\" | x) = 0.129 (Marginal probability, marginalizing over top 8 retrieved documents.)\n\nEncoder or Retriever We first aim to determine whether REALM pre-training improves the retriever or the encoder, or both. To do so, we can reset the parameters of either the retriever or the encoder to their baseline state before REALM pre-training, and feed that into fine-tuning. Resetting both the retriever and encoder reduces the system to our main baseline, ORQA. We find that both the encoder and retriever benefit from REALM training separately, but the best result requires both components acting in unison.\n\nMasking scheme We compare our salient span masking scheme (Section 3.4) with (1) random token masking introduced in BERT (Devlin et al., 2018) and (2) random span masking proposed by SpanBERT . While such salient span masking has not been shown to be impactful in previous work with standard BERT training , it is crucial for REALM. Intuitively, the latent variable learning relies heavily on the utility of retrieval and is therefore more sensitive to a consistent learning signal.\n\nMIPS index refresh rate During pre-training, we run a parallel process to re-embed corpus documents and rebuild the MIPS index. This results in one index refresh per approximately 500 training steps. To demonstrate the importance of frequent index refreshes, we compare against using a slower refresh rate. The results in Table 2 suggests that a stale index can hurt model training, and further reducing this staleness could offer better optimization. Table 3 shows an example of the REALM masked language model prediction. In this example, \"Fermat\" is the correct word, and REALM (row (c)) gives the word a much high probability compared to the BERT model (row (a)). Since REALM manages to retrieve some documents with a related fact (row (b)), the marginalized probability of the correct answer dramatically increases. This shows that REALM is able to retrieve document to fill in the masked word even though it is trained with unsupervised text only.\n\n\nExamples of retrieved documents\n\n\nDiscussion and Related Work\n\nWe previously discussed related methods for Open-QA.\n\nHere we present several alternate ways of viewing REALM that connect it to a broader set of ideas beyond Open-QA:\n\nLanguage modeling with corpus as context Language representation models have been incorporating contexts of increasingly large scope when making predictions. Examples of this progression include models that condition on surrounding words (Mikolov et al., 2013a;, sentences (Kiros et al., 2015;Peters et al., 2018), and paragraphs (Radford et al., 2018;Devlin et al., 2018). We can view REALM as a generalization of the above work to the next level of scope: the entire text corpus.\n\nRetrieve-and-edit with learned retrieval In order to better explain the variance in the input text and enable controllable generation, Guu et al. (2018) proposed a language model with the retrieve-and-edit framework  that conditions on text with high lexical overlap. REALM has a similar approach, except that the model learns for itself which texts are most useful for reducing perplexity. By jointly learning the retriever, REALM has the capacity to depend on information beyond lexical overlap.\n\nScalable grounded neural memory The document index can be viewed as a memory where the keys are the document embeddings. From this view, our work share motivations with works such as product key memory (Lample et al., 2019), which enables sub-linear memory access in a memory network (Weston et al., 2014;Graves et al., 2014;Sukhbaatar et al., 2015), allowing these scalable memory layers to be integrated into large language models. One main difference is that our memories are grounded-each memory is associated with a document rather than unnamed value vectors. This level of interpretability is crucial for applications like Open-QA, where users would require provenance for a predicted answer to be trustworthy.\n\n\nUnsupervised Corpus Alignment\n\nIn sequence-tosequence models with attention (Bahdanau et al., 2014), text is generated with latent selection of relevant tokens. This results in a set of model-centric unsupervised alignments between target and source tokens. Analogously, REALM also generates text with latent selection of relevant documents. A by-product of our method is that we offer a set of model-centric unsupervised alignments between text in the pre-training corpus X and knowledge corpus Z.\n\n\nFuture Work\n\nThe work presented here is the minimal instantiation of a family of REALM-like approaches where a representation is pre-trained to perform reasoning over a large corpus of knowledge on-the-fly during inference. We are particularly optimistic about generalizations of this work to (1) structured knowledge, which would result in a generalization of Peters et al. (2019) where we would also learn the decision of which entities are informative, (2) the multi-lingual setting, e.g., retrieving knowledge in a high-resource language to better represent text in a low-resource language, and (3) the multi-modal setting, e.g., retrieving images or videos that can provide knowledge rarely observed in text.\n\nFigure 2 .\n2The overall framework of REALM. Left: Unsupervised pre-training. The knowledge retriever and knowledge-augmented encoder are jointly pre-trained on the unsupervised language modeling task. Right: Supervised fine-tuning. After the parameters of the retriever (θ) and encoder (φ) have been pre-trained, they are then fine-tuned on a task of primary interest, using supervised examples.\n\nFigure 3 .\n3REALM pre-training with asynchronous MIPS refreshes.\n\nTable 1 .\n1Test results on Open-QA benchmarks. The number of train/test examples are shown in paretheses below each benchmark. Predictions are evaluated with exact match against any reference answer. Sparse retrieval denotes methods that use sparse features such as TF-IDF and BM25. Our model, REALM, outperforms all existing systems.Name \nArchitectures \nPre-training \nNQ \n(79k/4k) \n\nWQ \n(3k/2k) \n\nCT \n(1k /1k) \n# params \n\nBERT-Baseline (Lee et al., 2019) \nSparse Retr.+Transformer \nBERT \n26.5 \n17.7 \n21.3 \n110m \n\nT5 (base) (Roberts et al., 2020) \nTransformer Seq2Seq \nT5 (Multitask) \n27.0 \n29.1 \n-\n223m \nT5 (large) (Roberts et al., 2020) \nTransformer Seq2Seq \nT5 (Multitask) \n29.8 \n32.2 \n-\n738m \nT5 (11b) (Roberts et al., 2020) \nTransformer Seq2Seq \nT5 (Multitask) \n34.5 \n37.4 \n-\n11318m \n\nDrQA (Chen et al., 2017) \nSparse Retr.+DocReader \nN/A \n-\n20.7 \n25.7 \n34m \nHardEM (Min et al., 2019a) \nSparse Retr.+Transformer \nBERT \n28.1 \n-\n-\n110m \nGraphRetriever (Min et al., 2019b) \nGraphRetriever+Transformer BERT \n31.8 \n31.6 \n-\n110m \nPathRetriever (Asai et al., 2019) \nPathRetriever+Transformer \nMLM \n32.6 \n-\n-\n110m \nORQA (Lee et al., 2019) \nDense Retr.+Transformer \nICT+BERT \n33.3 \n36.4 \n30.1 \n330m \n\nOurs (X = Wikipedia, Z = Wikipedia) Dense Retr.+Transformer \nREALM \n39.2 \n40.2 \n46.8 \n330m \nOurs (X = CC-News, Z = Wikipedia) \nDense Retr.+Transformer \nREALM \n40.4 \n40.7 \n42.9 \n330m \n\nTable 2. Ablation experiments on NQ's development set. \n\nAblation \nExact \nMatch \n\nZero-shot \nRetrieval \nRecall@5 \n\nREALM \n38.2 \n38.5 \n\nREALM retriever+Baseline encoder \n37.4 \n38.5 \nBaseline retriever+REALM encoder \n35.3 \n13.9 \nBaseline (ORQA) \n31.3 \n13.9 \n\nREALM with random uniform masks \n32.3 \n24.2 \nREALM with random span masks \n35.3 \n26.1 \n\n30× stale MIPS \n28.7 \n15.1 \n\nentire model can be run on a single machine with a 12GB \nGPU. \n\nPre-training We pre-train for 200k steps on 64 Google \nCloud TPUs, with a batch size of 512 and a learning rate \nof 3e-5, using BERT's default optimizer. The document \nembedding step for the MIPS index is parallelized over 16 \nTPUs. For each example, we retrieve and marginalize over \n8 candidate documents, including the null document ∅. \n\n\nWe use the term \"document\" loosely to refer to a passage from the knowledge corpus, not necessarily a whole article.2 Strictly speaking, MLM is not a standard language model, since it does not define a distribution over the entire sequence of tokens. In the paper we sometimes abuse the term \"language model\" slightly to make the phrase shorter.\nThis works because pre-training already yields a good Embeddoc function. However, it is possible that refreshing the index would further improve performance.\nWe initially conducted our own T5 experiments using the code from https://tinyurl.com/t5-openqa-colab(Raffel et al., 2019). We now report results from the concurrent work ofRoberts et al. (2020), which has an improved fine-tuning procedure.\nA. Derivation of the gradient with respect to the knowledge retrieverWe compute the gradient of the REALM pre-training objective (a log-likelihood) with respect to the parameters of the knowledge retriever, θ:where the last line follows from applying conditional Bayes' rule. We can then expand ∇ log p (z | x) as:Plugging this back into the first set of equations yields:In the second line, we used the fact that the overall expression is an expectation with respect to p (z | y, x), and the terms which depend on z ′ but not z can be moved out of that expectation.B. Connection between REALM and supervised learningFrom the equations in Appendix A, we saw thatSuppose that there exists one document z * which causes the model to achieve perfect prediction accuracy (i.e., p (y | z * , x) = 1), while all other documents z ′ result in zero accuracy (i.e., p (y | z ′ , x) = 0). Under this setting, p (z * | y, x) = 1 (provided that p (z * | x) is non-zero), which causes the gradient to becomeFrom this, we see that gradient descent on the REALM objective is equivalent to gradient descent on log p (z * | x). This is none other than the typical maximum likelihood training objective used in supervised learning, where z * is the \"gold\" document.C. Adapting to new knowledge An explicit retrieval system allows us to adapt to new world knowledge simply by modifying the corpus documents. To demonstrate this ability, we replace the knowledge corpus with a more recent version of Wikipedia corpus after pre-training is done. When the input query is about a fact where the two corpora disagree, REALM can change the prediction to reflect the updated information, as exemplified inTable 4. However, even with an explicit retrieval mechanism, the knowledge-augmented encoder will still end up remembering some world knowledge, making the prediction of some input sentences not updated with the new corpus. (For instance, the model predicts \"Thatcher\" for \"is the prime minister of United Kingdom.\" on both corpora, perhaps due to the frequent mention of her name in Wikipedia articles.)D. Retrieval UtilityThe null document ∅ described in Section 3.4 provides a way to measure the importance of a retrieved document z: we define the retrieval utility (RU) of z for the masked input x as the difference between the log-likelihood of the knowledge-augmented encoder when conditioning on z versus on ∅:A negative RU shows that z is less useful for predicting y than the null document. This could mean that z is irrelevant to x, but could also mean that the masked tokens in x do not require world knowledge to predict, or that the world knowledge is sufficiently commonplace it has been baked into the model's parameters. In practice, we find that RU increases steadily over the course of pre-training, and is more predictive of good performance on the downstream task of Open-QA than even the overall log-likelihood. An example of how RU behaves over time and across different settings is inFigure 4. BERT also (0.13), then (0.08), later (0.05), . . . REALM (Z =20 Dec 2018 corpus) smith (0.01), brown (0.01), jones (0.01) REALM (Z =20 Jan 2020 corpus) lawrence (0.13), brown (0.01), smith (0.01), . . .Table 4. An example where REALM adapts to the updated knowledge corpus. The Wikipedia page \"Excellent Cadaver\" was added in 2019, so the model was not about to recover the word when the knowledge corpus is outdated (2018). Interestingly, the same REALM model pre-trained on the 2018 corpus is able to retrieve the document in the updated corpus (2020) and generate the correct token, \"Lawrence\".  2) vs the number of pre-training steps. RU roughly estimates the \"usefulness\" of retrieval. RU is impacted by the choice of masking and the number of pre-training steps.\nLearning to retrieve reasoning paths over wikipedia graph for question answering. A Asai, K Hashimoto, H Hajishirzi, R Socher, C Xiong, arXiv:1911.10470arXiv preprintAsai, A., Hashimoto, K., Hajishirzi, H., Socher, R., and Xiong, C. Learning to retrieve reasoning paths over wikipedia graph for question answering. arXiv preprint arXiv:1911.10470, 2019.\n\nNeural machine translation by jointly learning to align and translate. D Bahdanau, K Cho, Y Bengio, arXiv:1409.0473arXiv preprintBahdanau, D., Cho, K., and Bengio, Y. Neural machine translation by jointly learning to align and translate. arXiv preprint arXiv:1409.0473, 2014.\n\nSemantic parsing on freebase from question-answer pairs. J Berant, A Chou, R Frostig, P Liang, Proceedings of the 2013 Conference on Empirical Methods in Natural Language Processing. the 2013 Conference on Empirical Methods in Natural Language ProcessingBerant, J., Chou, A., Frostig, R., and Liang, P. Semantic parsing on freebase from question-answer pairs. In Pro- ceedings of the 2013 Conference on Empirical Methods in Natural Language Processing, pp. 1533-1544, 2013.\n\nAn analysis of the askmsr question-answering system. E Brill, S Dumais, M Banko, Empirical Methods in Natural Language Processing. Brill, E., Dumais, S., and Banko, M. An analysis of the askmsr question-answering system. In Empirical Meth- ods in Natural Language Processing, 2002.\n\nReading wikipedia to answer open-domain questions. D Chen, A Fisch, J Weston, A Bordes, Proceedings of the 55th Annual Meeting of the Association for Computational Linguistics. the 55th Annual Meeting of the Association for Computational Linguistics1Chen, D., Fisch, A., Weston, J., and Bordes, A. Read- ing wikipedia to answer open-domain questions. In Pro- ceedings of the 55th Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers), volume 1, pp. 1870-1879, 2017.\n\nSimple and effective multiparagraph reading comprehension. C Clark, M Gardner, Annual Meeting of the Association for Computational Linguistics. Clark, C. and Gardner, M. Simple and effective multi- paragraph reading comprehension. In Annual Meeting of the Association for Computational Linguistics, 2017.\n\nSemi-supervised sequence learning. A M Dai, Q V Le, Advances in neural information processing systems. Dai, A. M. and Le, Q. V. Semi-supervised sequence learn- ing. In Advances in neural information processing sys- tems, pp. 3079-3087, 2015.\n\nJ Devlin, M.-W Chang, K Lee, K Toutanova, Bert, arXiv:1810.04805Pre-training of deep bidirectional transformers for language understanding. arXiv preprintDevlin, J., Chang, M.-W., Lee, K., and Toutanova, K. Bert: Pre-training of deep bidirectional transformers for lan- guage understanding. arXiv preprint arXiv:1810.04805, 2018.\n\nNeural turing machines. ArXiv, abs/1410. A Graves, G Wayne, I Danihelka, 5401Graves, A., Wayne, G., and Danihelka, I. Neural turing machines. ArXiv, abs/1410.5401, 2014.\n\nGenerating sentences by editing prototypes. K Guu, T B Hashimoto, Y Oren, P Liang, Transactions of the Association for Computational Linguistics. 6Guu, K., Hashimoto, T. B., Oren, Y., and Liang, P. Gen- erating sentences by editing prototypes. Transactions of the Association for Computational Linguistics, 6:437- 450, 2018.\n\nA retrieve-and-edit framework for predicting structured outputs. T B Hashimoto, K Guu, Y Oren, P S Liang, Advances in Neural Information Processing Systems. Hashimoto, T. B., Guu, K., Oren, Y., and Liang, P. S. A retrieve-and-edit framework for predicting structured outputs. In Advances in Neural Information Processing Systems, pp. 10052-10062, 2018.\n\nM Joshi, D Chen, Y Liu, D S Weld, L Zettlemoyer, O Levy, Spanbert, arXiv:1907.10529Improving pre-training by representing and predicting spans. arXiv preprintJoshi, M., Chen, D., Liu, Y., Weld, D. S., Zettlemoyer, L., and Levy, O. SpanBERT: Improving pre-training by representing and predicting spans. arXiv preprint arXiv:1907.10529, 2019.\n\nGeneralization through memorization: Nearest neighbor language models. U Khandelwal, O Levy, D Jurafsky, L Zettlemoyer, Lewis , M , abs/1911.00172ArXiv. Khandelwal, U., Levy, O., Jurafsky, D., Zettlemoyer, L., and Lewis, M. Generalization through memo- rization: Nearest neighbor language models. ArXiv, abs/1911.00172, 2019.\n\nSkip-thought vectors. R Kiros, Y Zhu, R R Salakhutdinov, R Zemel, R Urtasun, A Torralba, S Fidler, Advances in neural information processing systems. Kiros, R., Zhu, Y., Salakhutdinov, R. R., Zemel, R., Urta- sun, R., Torralba, A., and Fidler, S. Skip-thought vectors. In Advances in neural information processing systems, pp. 3294-3302, 2015.\n\nNatural questions: a benchmark for question answering research. T Kwiatkowski, J Palomaki, O Rhinehart, M Collins, A Parikh, C Alberti, D Epstein, I Polosukhin, M Kelcey, J Devlin, Transactions of the Association for Computational Linguistics. Kwiatkowski, T., Palomaki, J., Rhinehart, O., Collins, M., Parikh, A., Alberti, C., Epstein, D., Polosukhin, I., Kel- cey, M., Devlin, J., et al. Natural questions: a benchmark for question answering research. Transactions of the As- sociation for Computational Linguistics, 2019.\n\nLarge memory layers with product keys. G Lample, A Sablayrolles, M Ranzato, L Denoyer, H Jégou, Advances in Neural Information Processing Systems. Lample, G., Sablayrolles, A., Ranzato, M., Denoyer, L., and Jégou, H. Large memory layers with product keys. In Advances in Neural Information Processing Systems, pp. 8546-8557, 2019.\n\nLearning recurrent span representations for extractive question answering. K Lee, S Salant, T Kwiatkowski, A Parikh, D Das, J Berant, arXiv:1611.01436arXiv preprintLee, K., Salant, S., Kwiatkowski, T., Parikh, A., Das, D., and Berant, J. Learning recurrent span representa- tions for extractive question answering. arXiv preprint arXiv:1611.01436, 2016.\n\nLatent retrieval for weakly supervised open domain question answering. K Lee, M.-W Chang, K Toutanova, Proceedings of the Conference of Association for Computational Linguistics. the Conference of Association for Computational LinguisticsLee, K., Chang, M.-W., and Toutanova, K. Latent re- trieval for weakly supervised open domain question an- swering. In Proceedings of the Conference of Associa- tion for Computational Linguistics, 2019.\n\nDenoising sequence-to-sequence pre-training for natural language generation, translation, and comprehension. M Lewis, Y Liu, N Goyal, M Ghazvininejad, A Mohamed, O Levy, V Stoyanov, L Zettlemoyer, Bart, abs/1910.13461ArXiv. Lewis, M., Liu, Y., Goyal, N., Ghazvininejad, M., Mo- hamed, A., Levy, O., Stoyanov, V., and Zettlemoyer, L. Bart: Denoising sequence-to-sequence pre-training for natural language generation, translation, and comprehen- sion. ArXiv, abs/1910.13461, 2019.\n\nY Liu, M Ott, N Goyal, J Du, M Joshi, D Chen, O Levy, M Lewis, L Zettlemoyer, V Stoyanov, Roberta, arXiv:1907.11692A robustly optimized bert pretraining approach. arXiv preprintLiu, Y., Ott, M., Goyal, N., Du, J., Joshi, M., Chen, D., Levy, O., Lewis, M., Zettlemoyer, L., and Stoyanov, V. Roberta: A robustly optimized bert pretraining approach. arXiv preprint arXiv:1907.11692, 2019.\n\nEfficient estimation of word representations in vector space. T Mikolov, K Chen, G Corrado, J Dean, arXiv:1301.3781arXiv preprintMikolov, T., Chen, K., Corrado, G., and Dean, J. Efficient estimation of word representations in vector space. arXiv preprint arXiv:1301.3781, 2013a.\n\nDistributed representations of words and phrases and their compositionality. T Mikolov, I Sutskever, K Chen, G S Corrado, J Dean, Advances in neural information processing systems. Mikolov, T., Sutskever, I., Chen, K., Corrado, G. S., and Dean, J. Distributed representations of words and phrases and their compositionality. In Advances in neural information processing systems, pp. 3111-3119, 2013b.\n\nKey-value memory networks for directly reading documents. A Miller, A Fisch, J Dodge, A.-H Karimi, A Bordes, Weston , J , arXiv:1606.03126arXiv preprintMiller, A., Fisch, A., Dodge, J., Karimi, A.-H., Bordes, A., and Weston, J. Key-value memory networks for directly reading documents. arXiv preprint arXiv:1606.03126, 2016.\n\nA discrete hard em approach for weakly supervised question answering. S Min, D Chen, H Hajishirzi, L Zettlemoyer, arXiv:1909.04849arXiv preprintMin, S., Chen, D., Hajishirzi, H., and Zettlemoyer, L. A dis- crete hard em approach for weakly supervised question answering. arXiv preprint arXiv:1909.04849, 2019a.\n\nKnowledge guided text retrieval and reading for open domain question answering. S Min, D Chen, L Zettlemoyer, H Hajishirzi, arXiv:1911.03868arXiv preprintMin, S., Chen, D., Zettlemoyer, L., and Hajishirzi, H. Knowledge guided text retrieval and reading for open domain question answering. arXiv preprint arXiv:1911.03868, 2019b.\n\nDeep contextualized word representations. M E Peters, M Neumann, M Iyyer, M Gardner, C Clark, K Lee, L Zettlemoyer, Proc. of NAACL. of NAACLPeters, M. E., Neumann, M., Iyyer, M., Gardner, M., Clark, C., Lee, K., and Zettlemoyer, L. Deep contextualized word representations. In Proc. of NAACL, 2018.\n\nKnowledge enhanced contextual word representations. M E Peters, M Neumann, R L L Iv, R Schwartz, V Joshi, S Singh, N A Smith, Peters, M. E., Neumann, M., IV, R. L. L., Schwartz, R., Joshi, V., Singh, S., and Smith, N. A. Knowledge en- hanced contextual word representations, 2019.\n\nLanguage models as knowl. F Petroni, T Rocktäschel, P Lewis, A Bakhtin, Y Wu, A H Miller, S Riedel, arXiv:1909.01066arXiv preprintPetroni, F., Rocktäschel, T., Lewis, P., Bakhtin, A., Wu, Y., Miller, A. H., and Riedel, S. Language models as knowl- edge bases? arXiv preprint arXiv:1909.01066, 2019.\n\nImproving language understanding with unsupervised learning. A Radford, K Narasimhan, T Salimans, I Sutskever, OpenAITechnical reportRadford, A., Narasimhan, K., Salimans, T., and Sutskever, I. Improving language understanding with unsupervised learning. Technical report, OpenAI, 2018.\n\nLanguage models are unsupervised multitask learners. A Radford, J Wu, R Child, D Luan, D Amodei, I Sutskever, OpenAI Blog. Radford, A., Wu, J., Child, R., Luan, D., Amodei, D., and Sutskever, I. Language models are unsupervised multi- task learners. OpenAI Blog, 2019.\n\nExploring the limits of transfer learning with a unified text-to-text transformer. C Raffel, N Shazeer, A Roberts, K Lee, S Narang, M Matena, Y Zhou, W Li, P J Liu, arXiv:1910.10683arXiv preprintRaffel, C., Shazeer, N., Roberts, A., Lee, K., Narang, S., Matena, M., Zhou, Y., Li, W., and Liu, P. J. Exploring the limits of transfer learning with a unified text-to-text transformer. arXiv preprint arXiv:1910.10683, 2019.\n\nSquad: 100,000+ questions for machine comprehension of text. P Rajpurkar, J Zhang, K Lopyrev, P Liang, Proceedings of the 2016 Conference on Empirical Methods in Natural Language Processing. the 2016 Conference on Empirical Methods in Natural Language ProcessingRajpurkar, P., Zhang, J., Lopyrev, K., and Liang, P. Squad: 100,000+ questions for machine comprehension of text. In Proceedings of the 2016 Conference on Empirical Methods in Natural Language Processing, pp. 2383- 2392, 2016.\n\nP Rajpurkar, R Jia, P Liang, arXiv:1806.03822Know what you don't know: Unanswerable questions for squad. arXiv preprintRajpurkar, P., Jia, R., and Liang, P. Know what you don't know: Unanswerable questions for squad. arXiv preprint arXiv:1806.03822, 2018.\n\nMaximum inner-product search using cone trees. P Ram, A G Gray, Proceedings of the 18th ACM SIGKDD international conference on Knowledge discovery and data mining. the 18th ACM SIGKDD international conference on Knowledge discovery and data miningRam, P. and Gray, A. G. Maximum inner-product search us- ing cone trees. In Proceedings of the 18th ACM SIGKDD international conference on Knowledge discovery and data mining, pp. 931-939, 2012.\n\nHow much knowl. A Roberts, C Raffel, N Shazeer, arXiv:TBDarXiv preprintRoberts, A., Raffel, C., and Shazeer, N. How much knowl- edge can you pack into the parameters of a language model? arXiv preprint arXiv:TBD, 2020.\n\nThe probabilistic relevance framework: Bm25 and beyond. S Robertson, H Zaragoza, Foundations and Trends in Information Retrieval. 34Robertson, S., Zaragoza, H., et al. The probabilistic rele- vance framework: Bm25 and beyond. Foundations and Trends in Information Retrieval, 3(4):333-389, 2009.\n\nIntroduction to the conll-2003 shared task: Language-independent named entity recognition. E T K Sang, F De Meulder, Proceedings of the Seventh Conference on Natural Language Learning at HLT-NAACL 2003. the Seventh Conference on Natural Language Learning at HLT-NAACL 2003Sang, E. T. K. and De Meulder, F. Introduction to the conll- 2003 shared task: Language-independent named entity recognition. In Proceedings of the Seventh Conference on Natural Language Learning at HLT-NAACL 2003, pp. 142-147, 2003.\n\nBidirectional attention flow for machine comprehension. M Seo, A Kembhavi, A Farhadi, H Hajishirzi, International Conference on Learning Representations. Seo, M., Kembhavi, A., Farhadi, A., and Hajishirzi, H. Bidirectional attention flow for machine comprehension. In International Conference on Learning Representa- tions, 2016.\n\nLearning binary codes for maximum inner product search. F Shen, W Liu, S Zhang, Y Yang, Tao Shen, H , Proceedings of the IEEE International Conference on Computer Vision. the IEEE International Conference on Computer VisionShen, F., Liu, W., Zhang, S., Yang, Y., and Tao Shen, H. Learning binary codes for maximum inner product search. In Proceedings of the IEEE International Con- ference on Computer Vision, pp. 4148-4156, 2015.\n\nAsymmetric lsh (alsh) for sublinear time maximum inner product search (mips). A Shrivastava, P Li, Advances in Neural Information Processing Systems. Shrivastava, A. and Li, P. Asymmetric lsh (alsh) for sub- linear time maximum inner product search (mips). In Advances in Neural Information Processing Systems, pp. 2321-2329, 2014.\n\nEnd-to-end memory networks. S Sukhbaatar, J Weston, R Fergus, Advances in neural information processing systems. Sukhbaatar, S., Weston, J., Fergus, R., et al. End-to-end memory networks. In Advances in neural information processing systems, 2015.\n\n. J Weston, S Chopra, A Bordes, arXiv:1410.3916Memory networks. arXiv preprintWeston, J., Chopra, S., and Bordes, A. Memory networks. arXiv preprint arXiv:1410.3916, 2014.\n", "annotations": {"author": "[{\"end\":80,\"start\":69},{\"end\":92,\"start\":81},{\"end\":103,\"start\":93},{\"end\":121,\"start\":104},{\"end\":137,\"start\":122}]", "publisher": null, "author_last_name": "[{\"end\":79,\"start\":76},{\"end\":91,\"start\":88},{\"end\":102,\"start\":98},{\"end\":120,\"start\":113},{\"end\":136,\"start\":131}]", "author_first_name": "[{\"end\":75,\"start\":69},{\"end\":87,\"start\":81},{\"end\":97,\"start\":93},{\"end\":112,\"start\":104},{\"end\":130,\"start\":122}]", "author_affiliation": null, "title": "[{\"end\":55,\"start\":1},{\"end\":192,\"start\":138}]", "venue": null, "abstract": "[{\"end\":1494,\"start\":205}]", "bib_ref": "[{\"attributes\":{\"ref_id\":\"b7\"},\"end\":1614,\"start\":1593},{\"attributes\":{\"ref_id\":\"b30\"},\"end\":1653,\"start\":1632},{\"attributes\":{\"ref_id\":\"b27\"},\"end\":1781,\"start\":1759},{\"attributes\":{\"ref_id\":\"b22\"},\"end\":5034,\"start\":5013},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":5052,\"start\":5034},{\"attributes\":{\"ref_id\":\"b12\"},\"end\":5297,\"start\":5272},{\"attributes\":{\"ref_id\":\"b23\"},\"end\":6365,\"start\":6347},{\"attributes\":{\"ref_id\":\"b0\"},\"end\":6383,\"start\":6365},{\"attributes\":{\"ref_id\":\"b6\"},\"end\":7013,\"start\":6997},{\"attributes\":{\"ref_id\":\"b29\"},\"end\":7034,\"start\":7013},{\"attributes\":{\"ref_id\":\"b7\"},\"end\":7148,\"start\":7127},{\"end\":7427,\"start\":7421},{\"attributes\":{\"ref_id\":\"b31\"},\"end\":8379,\"start\":8355},{\"attributes\":{\"ref_id\":\"b3\"},\"end\":8840,\"start\":8820},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":8858,\"start\":8840},{\"attributes\":{\"ref_id\":\"b17\"},\"end\":8875,\"start\":8858},{\"attributes\":{\"ref_id\":\"b30\"},\"end\":9146,\"start\":9126},{\"attributes\":{\"ref_id\":\"b7\"},\"end\":11470,\"start\":11449},{\"attributes\":{\"ref_id\":\"b7\"},\"end\":11758,\"start\":11738},{\"end\":12915,\"start\":12909},{\"attributes\":{\"ref_id\":\"b7\"},\"end\":13016,\"start\":12996},{\"end\":13247,\"start\":13241},{\"attributes\":{\"ref_id\":\"b31\"},\"end\":13449,\"start\":13425},{\"attributes\":{\"ref_id\":\"b37\"},\"end\":13466,\"start\":13449},{\"attributes\":{\"ref_id\":\"b16\"},\"end\":13483,\"start\":13466},{\"attributes\":{\"ref_id\":\"b5\"},\"end\":13505,\"start\":13483},{\"attributes\":{\"ref_id\":\"b33\"},\"end\":15327,\"start\":15309},{\"attributes\":{\"ref_id\":\"b39\"},\"end\":15350,\"start\":15327},{\"attributes\":{\"ref_id\":\"b38\"},\"end\":15368,\"start\":15350},{\"attributes\":{\"ref_id\":\"b36\"},\"end\":18903,\"start\":18878},{\"attributes\":{\"ref_id\":\"b17\"},\"end\":20746,\"start\":20729},{\"attributes\":{\"ref_id\":\"b17\"},\"end\":21521,\"start\":21504},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":21665,\"start\":21646},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":21747,\"start\":21721},{\"attributes\":{\"ref_id\":\"b2\"},\"end\":22187,\"start\":22166},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":22350,\"start\":22332},{\"attributes\":{\"ref_id\":\"b35\"},\"end\":23316,\"start\":23292},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":23588,\"start\":23569},{\"attributes\":{\"ref_id\":\"b23\"},\"end\":23616,\"start\":23597},{\"attributes\":{\"ref_id\":\"b24\"},\"end\":23652,\"start\":23633},{\"attributes\":{\"ref_id\":\"b0\"},\"end\":23691,\"start\":23672},{\"attributes\":{\"ref_id\":\"b29\"},\"end\":24610,\"start\":24588},{\"attributes\":{\"ref_id\":\"b30\"},\"end\":24851,\"start\":24830},{\"attributes\":{\"ref_id\":\"b34\"},\"end\":25215,\"start\":25193},{\"end\":25218,\"start\":25217},{\"attributes\":{\"ref_id\":\"b17\"},\"end\":25424,\"start\":25407},{\"attributes\":{\"ref_id\":\"b19\"},\"end\":25959,\"start\":25942},{\"attributes\":{\"ref_id\":\"b34\"},\"end\":26244,\"start\":26223},{\"attributes\":{\"ref_id\":\"b0\"},\"end\":27390,\"start\":27371},{\"attributes\":{\"ref_id\":\"b23\"},\"end\":27408,\"start\":27390},{\"attributes\":{\"ref_id\":\"b7\"},\"end\":29270,\"start\":29249},{\"attributes\":{\"ref_id\":\"b20\"},\"end\":31061,\"start\":31038},{\"attributes\":{\"ref_id\":\"b13\"},\"end\":31093,\"start\":31073},{\"attributes\":{\"ref_id\":\"b25\"},\"end\":31113,\"start\":31093},{\"attributes\":{\"ref_id\":\"b28\"},\"end\":31152,\"start\":31130},{\"attributes\":{\"ref_id\":\"b7\"},\"end\":31172,\"start\":31152},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":31435,\"start\":31418},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":32005,\"start\":31984},{\"attributes\":{\"ref_id\":\"b41\"},\"end\":32087,\"start\":32066},{\"attributes\":{\"ref_id\":\"b8\"},\"end\":32107,\"start\":32087},{\"attributes\":{\"ref_id\":\"b40\"},\"end\":32131,\"start\":32107},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":32600,\"start\":32577},{\"attributes\":{\"ref_id\":\"b26\"},\"end\":33383,\"start\":33363},{\"attributes\":{\"ref_id\":\"b30\"},\"end\":36967,\"start\":36946},{\"attributes\":{\"ref_id\":\"b34\"},\"end\":37039,\"start\":37018}]", "figure": "[{\"attributes\":{\"id\":\"fig_0\"},\"end\":34112,\"start\":33716},{\"attributes\":{\"id\":\"fig_1\"},\"end\":34178,\"start\":34113},{\"attributes\":{\"id\":\"tab_0\",\"type\":\"table\"},\"end\":36340,\"start\":34179}]", "paragraph": "[{\"end\":2519,\"start\":1510},{\"end\":2548,\"start\":2521},{\"end\":2945,\"start\":2550},{\"end\":3758,\"start\":2947},{\"end\":4404,\"start\":3760},{\"end\":4905,\"start\":4406},{\"end\":5758,\"start\":4907},{\"end\":6624,\"start\":5760},{\"end\":7035,\"start\":6639},{\"end\":7738,\"start\":7037},{\"end\":8537,\"start\":7740},{\"end\":9235,\"start\":8539},{\"end\":9806,\"start\":9248},{\"end\":10231,\"start\":9837},{\"end\":10703,\"start\":10233},{\"end\":10744,\"start\":10741},{\"end\":10924,\"start\":10767},{\"end\":11005,\"start\":10926},{\"end\":11207,\"start\":11096},{\"end\":11380,\"start\":11209},{\"end\":11654,\"start\":11382},{\"end\":12076,\"start\":11732},{\"end\":12369,\"start\":12191},{\"end\":12734,\"start\":12371},{\"end\":13017,\"start\":12736},{\"end\":13312,\"start\":13117},{\"end\":13691,\"start\":13314},{\"end\":14121,\"start\":13847},{\"end\":14516,\"start\":14134},{\"end\":14856,\"start\":14518},{\"end\":15369,\"start\":14858},{\"end\":15694,\"start\":15371},{\"end\":16213,\"start\":15696},{\"end\":16786,\"start\":16215},{\"end\":17149,\"start\":16788},{\"end\":17384,\"start\":17151},{\"end\":17700,\"start\":17386},{\"end\":18295,\"start\":17778},{\"end\":18500,\"start\":18344},{\"end\":19163,\"start\":18502},{\"end\":19447,\"start\":19165},{\"end\":20063,\"start\":19449},{\"end\":20467,\"start\":20065},{\"end\":20928,\"start\":20469},{\"end\":21114,\"start\":20944},{\"end\":21666,\"start\":21137},{\"end\":22124,\"start\":21692},{\"end\":22351,\"start\":22141},{\"end\":22802,\"start\":22353},{\"end\":23201,\"start\":22826},{\"end\":23724,\"start\":23203},{\"end\":24276,\"start\":23726},{\"end\":25062,\"start\":24278},{\"end\":25334,\"start\":25064},{\"end\":26168,\"start\":25361},{\"end\":26893,\"start\":26185},{\"end\":27327,\"start\":26895},{\"end\":27534,\"start\":27329},{\"end\":28145,\"start\":27547},{\"end\":28251,\"start\":28147},{\"end\":28608,\"start\":28253},{\"end\":29126,\"start\":28610},{\"end\":29610,\"start\":29128},{\"end\":30565,\"start\":29612},{\"end\":30683,\"start\":30631},{\"end\":30798,\"start\":30685},{\"end\":31281,\"start\":30800},{\"end\":31780,\"start\":31283},{\"end\":32498,\"start\":31782},{\"end\":32999,\"start\":32532},{\"end\":33715,\"start\":33015}]", "formula": "[{\"attributes\":{\"id\":\"formula_0\"},\"end\":10740,\"start\":10704},{\"attributes\":{\"id\":\"formula_1\"},\"end\":11095,\"start\":11006},{\"attributes\":{\"id\":\"formula_2\"},\"end\":11731,\"start\":11655},{\"attributes\":{\"id\":\"formula_3\"},\"end\":12190,\"start\":12077},{\"attributes\":{\"id\":\"formula_4\"},\"end\":13116,\"start\":13018},{\"attributes\":{\"id\":\"formula_5\"},\"end\":13846,\"start\":13692},{\"attributes\":{\"id\":\"formula_6\"},\"end\":17777,\"start\":17701}]", "table_ref": "[{\"attributes\":{\"ref_id\":\"tab_0\"},\"end\":23702,\"start\":23695},{\"attributes\":{\"ref_id\":\"tab_0\"},\"end\":24089,\"start\":24082},{\"attributes\":{\"ref_id\":\"tab_0\"},\"end\":25968,\"start\":25961},{\"attributes\":{\"ref_id\":\"tab_0\"},\"end\":26116,\"start\":26109},{\"end\":27557,\"start\":27550},{\"end\":27911,\"start\":27904},{\"end\":29941,\"start\":29934},{\"end\":30071,\"start\":30064}]", "section_header": "[{\"attributes\":{\"n\":\"1.\"},\"end\":1508,\"start\":1496},{\"attributes\":{\"n\":\"2.\"},\"end\":6637,\"start\":6627},{\"attributes\":{\"n\":\"3.\"},\"end\":9246,\"start\":9238},{\"attributes\":{\"n\":\"3.1.\"},\"end\":9835,\"start\":9809},{\"attributes\":{\"n\":\"3.2.\"},\"end\":10765,\"start\":10747},{\"attributes\":{\"n\":\"3.3.\"},\"end\":14132,\"start\":14124},{\"attributes\":{\"n\":\"3.4.\"},\"end\":18342,\"start\":18298},{\"attributes\":{\"n\":\"4.\"},\"end\":20942,\"start\":20931},{\"attributes\":{\"n\":\"4.1.\"},\"end\":21135,\"start\":21117},{\"end\":21690,\"start\":21669},{\"end\":22139,\"start\":22127},{\"attributes\":{\"n\":\"4.2.\"},\"end\":22824,\"start\":22805},{\"attributes\":{\"n\":\"4.3.\"},\"end\":25359,\"start\":25337},{\"attributes\":{\"n\":\"4.4.\"},\"end\":26183,\"start\":26171},{\"attributes\":{\"n\":\"4.5.\"},\"end\":27545,\"start\":27537},{\"end\":30599,\"start\":30568},{\"attributes\":{\"n\":\"5.\"},\"end\":30629,\"start\":30602},{\"end\":32530,\"start\":32501},{\"attributes\":{\"n\":\"6.\"},\"end\":33013,\"start\":33002},{\"end\":33727,\"start\":33717},{\"end\":34124,\"start\":34114},{\"end\":34189,\"start\":34180}]", "table": "[{\"end\":36340,\"start\":34514}]", "figure_caption": "[{\"end\":34112,\"start\":33729},{\"end\":34178,\"start\":34126},{\"end\":34514,\"start\":34191}]", "figure_ref": "[{\"end\":2062,\"start\":2054},{\"end\":3757,\"start\":3749},{\"end\":4041,\"start\":4033},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":9805,\"start\":9797},{\"end\":12710,\"start\":12702}]", "bib_author_first_name": "[{\"end\":40934,\"start\":40933},{\"end\":40942,\"start\":40941},{\"end\":40955,\"start\":40954},{\"end\":40969,\"start\":40968},{\"end\":40979,\"start\":40978},{\"end\":41278,\"start\":41277},{\"end\":41290,\"start\":41289},{\"end\":41297,\"start\":41296},{\"end\":41541,\"start\":41540},{\"end\":41551,\"start\":41550},{\"end\":41559,\"start\":41558},{\"end\":41570,\"start\":41569},{\"end\":42012,\"start\":42011},{\"end\":42021,\"start\":42020},{\"end\":42031,\"start\":42030},{\"end\":42293,\"start\":42292},{\"end\":42301,\"start\":42300},{\"end\":42310,\"start\":42309},{\"end\":42320,\"start\":42319},{\"end\":42802,\"start\":42801},{\"end\":42811,\"start\":42810},{\"end\":43084,\"start\":43083},{\"end\":43086,\"start\":43085},{\"end\":43093,\"start\":43092},{\"end\":43095,\"start\":43094},{\"end\":43292,\"start\":43291},{\"end\":43305,\"start\":43301},{\"end\":43314,\"start\":43313},{\"end\":43321,\"start\":43320},{\"end\":43664,\"start\":43663},{\"end\":43674,\"start\":43673},{\"end\":43683,\"start\":43682},{\"end\":43838,\"start\":43837},{\"end\":43845,\"start\":43844},{\"end\":43847,\"start\":43846},{\"end\":43860,\"start\":43859},{\"end\":43868,\"start\":43867},{\"end\":44185,\"start\":44184},{\"end\":44187,\"start\":44186},{\"end\":44200,\"start\":44199},{\"end\":44207,\"start\":44206},{\"end\":44215,\"start\":44214},{\"end\":44217,\"start\":44216},{\"end\":44474,\"start\":44473},{\"end\":44483,\"start\":44482},{\"end\":44491,\"start\":44490},{\"end\":44498,\"start\":44497},{\"end\":44500,\"start\":44499},{\"end\":44508,\"start\":44507},{\"end\":44523,\"start\":44522},{\"end\":44887,\"start\":44886},{\"end\":44901,\"start\":44900},{\"end\":44909,\"start\":44908},{\"end\":44921,\"start\":44920},{\"end\":44940,\"start\":44935},{\"end\":44944,\"start\":44943},{\"end\":45165,\"start\":45164},{\"end\":45174,\"start\":45173},{\"end\":45181,\"start\":45180},{\"end\":45183,\"start\":45182},{\"end\":45200,\"start\":45199},{\"end\":45209,\"start\":45208},{\"end\":45220,\"start\":45219},{\"end\":45232,\"start\":45231},{\"end\":45552,\"start\":45551},{\"end\":45567,\"start\":45566},{\"end\":45579,\"start\":45578},{\"end\":45592,\"start\":45591},{\"end\":45603,\"start\":45602},{\"end\":45613,\"start\":45612},{\"end\":45624,\"start\":45623},{\"end\":45635,\"start\":45634},{\"end\":45649,\"start\":45648},{\"end\":45659,\"start\":45658},{\"end\":46053,\"start\":46052},{\"end\":46063,\"start\":46062},{\"end\":46079,\"start\":46078},{\"end\":46090,\"start\":46089},{\"end\":46101,\"start\":46100},{\"end\":46421,\"start\":46420},{\"end\":46428,\"start\":46427},{\"end\":46438,\"start\":46437},{\"end\":46453,\"start\":46452},{\"end\":46463,\"start\":46462},{\"end\":46470,\"start\":46469},{\"end\":46772,\"start\":46771},{\"end\":46782,\"start\":46778},{\"end\":46791,\"start\":46790},{\"end\":47252,\"start\":47251},{\"end\":47261,\"start\":47260},{\"end\":47268,\"start\":47267},{\"end\":47277,\"start\":47276},{\"end\":47294,\"start\":47293},{\"end\":47305,\"start\":47304},{\"end\":47313,\"start\":47312},{\"end\":47325,\"start\":47324},{\"end\":47623,\"start\":47622},{\"end\":47630,\"start\":47629},{\"end\":47637,\"start\":47636},{\"end\":47646,\"start\":47645},{\"end\":47652,\"start\":47651},{\"end\":47661,\"start\":47660},{\"end\":47669,\"start\":47668},{\"end\":47677,\"start\":47676},{\"end\":47686,\"start\":47685},{\"end\":47701,\"start\":47700},{\"end\":48072,\"start\":48071},{\"end\":48083,\"start\":48082},{\"end\":48091,\"start\":48090},{\"end\":48102,\"start\":48101},{\"end\":48367,\"start\":48366},{\"end\":48378,\"start\":48377},{\"end\":48391,\"start\":48390},{\"end\":48399,\"start\":48398},{\"end\":48401,\"start\":48400},{\"end\":48412,\"start\":48411},{\"end\":48750,\"start\":48749},{\"end\":48760,\"start\":48759},{\"end\":48769,\"start\":48768},{\"end\":48781,\"start\":48777},{\"end\":48791,\"start\":48790},{\"end\":48806,\"start\":48800},{\"end\":48810,\"start\":48809},{\"end\":49088,\"start\":49087},{\"end\":49095,\"start\":49094},{\"end\":49103,\"start\":49102},{\"end\":49117,\"start\":49116},{\"end\":49410,\"start\":49409},{\"end\":49417,\"start\":49416},{\"end\":49425,\"start\":49424},{\"end\":49440,\"start\":49439},{\"end\":49702,\"start\":49701},{\"end\":49704,\"start\":49703},{\"end\":49714,\"start\":49713},{\"end\":49725,\"start\":49724},{\"end\":49734,\"start\":49733},{\"end\":49745,\"start\":49744},{\"end\":49754,\"start\":49753},{\"end\":49761,\"start\":49760},{\"end\":50012,\"start\":50011},{\"end\":50014,\"start\":50013},{\"end\":50024,\"start\":50023},{\"end\":50035,\"start\":50034},{\"end\":50039,\"start\":50036},{\"end\":50045,\"start\":50044},{\"end\":50057,\"start\":50056},{\"end\":50066,\"start\":50065},{\"end\":50075,\"start\":50074},{\"end\":50077,\"start\":50076},{\"end\":50268,\"start\":50267},{\"end\":50279,\"start\":50278},{\"end\":50294,\"start\":50293},{\"end\":50303,\"start\":50302},{\"end\":50314,\"start\":50313},{\"end\":50320,\"start\":50319},{\"end\":50322,\"start\":50321},{\"end\":50332,\"start\":50331},{\"end\":50603,\"start\":50602},{\"end\":50614,\"start\":50613},{\"end\":50628,\"start\":50627},{\"end\":50640,\"start\":50639},{\"end\":50883,\"start\":50882},{\"end\":50894,\"start\":50893},{\"end\":50900,\"start\":50899},{\"end\":50909,\"start\":50908},{\"end\":50917,\"start\":50916},{\"end\":50927,\"start\":50926},{\"end\":51183,\"start\":51182},{\"end\":51193,\"start\":51192},{\"end\":51204,\"start\":51203},{\"end\":51215,\"start\":51214},{\"end\":51222,\"start\":51221},{\"end\":51232,\"start\":51231},{\"end\":51242,\"start\":51241},{\"end\":51250,\"start\":51249},{\"end\":51256,\"start\":51255},{\"end\":51258,\"start\":51257},{\"end\":51583,\"start\":51582},{\"end\":51596,\"start\":51595},{\"end\":51605,\"start\":51604},{\"end\":51616,\"start\":51615},{\"end\":52012,\"start\":52011},{\"end\":52025,\"start\":52024},{\"end\":52032,\"start\":52031},{\"end\":52316,\"start\":52315},{\"end\":52323,\"start\":52322},{\"end\":52325,\"start\":52324},{\"end\":52728,\"start\":52727},{\"end\":52739,\"start\":52738},{\"end\":52749,\"start\":52748},{\"end\":52988,\"start\":52987},{\"end\":53001,\"start\":53000},{\"end\":53319,\"start\":53318},{\"end\":53323,\"start\":53320},{\"end\":53331,\"start\":53330},{\"end\":53791,\"start\":53790},{\"end\":53798,\"start\":53797},{\"end\":53810,\"start\":53809},{\"end\":53821,\"start\":53820},{\"end\":54122,\"start\":54121},{\"end\":54130,\"start\":54129},{\"end\":54137,\"start\":54136},{\"end\":54146,\"start\":54145},{\"end\":54156,\"start\":54153},{\"end\":54164,\"start\":54163},{\"end\":54576,\"start\":54575},{\"end\":54591,\"start\":54590},{\"end\":54859,\"start\":54858},{\"end\":54873,\"start\":54872},{\"end\":54883,\"start\":54882},{\"end\":55082,\"start\":55081},{\"end\":55092,\"start\":55091},{\"end\":55102,\"start\":55101}]", "bib_author_last_name": "[{\"end\":40939,\"start\":40935},{\"end\":40952,\"start\":40943},{\"end\":40966,\"start\":40956},{\"end\":40976,\"start\":40970},{\"end\":40985,\"start\":40980},{\"end\":41287,\"start\":41279},{\"end\":41294,\"start\":41291},{\"end\":41304,\"start\":41298},{\"end\":41548,\"start\":41542},{\"end\":41556,\"start\":41552},{\"end\":41567,\"start\":41560},{\"end\":41576,\"start\":41571},{\"end\":42018,\"start\":42013},{\"end\":42028,\"start\":42022},{\"end\":42037,\"start\":42032},{\"end\":42298,\"start\":42294},{\"end\":42307,\"start\":42302},{\"end\":42317,\"start\":42311},{\"end\":42327,\"start\":42321},{\"end\":42808,\"start\":42803},{\"end\":42819,\"start\":42812},{\"end\":43090,\"start\":43087},{\"end\":43098,\"start\":43096},{\"end\":43299,\"start\":43293},{\"end\":43311,\"start\":43306},{\"end\":43318,\"start\":43315},{\"end\":43331,\"start\":43322},{\"end\":43337,\"start\":43333},{\"end\":43671,\"start\":43665},{\"end\":43680,\"start\":43675},{\"end\":43693,\"start\":43684},{\"end\":43842,\"start\":43839},{\"end\":43857,\"start\":43848},{\"end\":43865,\"start\":43861},{\"end\":43874,\"start\":43869},{\"end\":44197,\"start\":44188},{\"end\":44204,\"start\":44201},{\"end\":44212,\"start\":44208},{\"end\":44223,\"start\":44218},{\"end\":44480,\"start\":44475},{\"end\":44488,\"start\":44484},{\"end\":44495,\"start\":44492},{\"end\":44505,\"start\":44501},{\"end\":44520,\"start\":44509},{\"end\":44528,\"start\":44524},{\"end\":44538,\"start\":44530},{\"end\":44898,\"start\":44888},{\"end\":44906,\"start\":44902},{\"end\":44918,\"start\":44910},{\"end\":44933,\"start\":44922},{\"end\":45171,\"start\":45166},{\"end\":45178,\"start\":45175},{\"end\":45197,\"start\":45184},{\"end\":45206,\"start\":45201},{\"end\":45217,\"start\":45210},{\"end\":45229,\"start\":45221},{\"end\":45239,\"start\":45233},{\"end\":45564,\"start\":45553},{\"end\":45576,\"start\":45568},{\"end\":45589,\"start\":45580},{\"end\":45600,\"start\":45593},{\"end\":45610,\"start\":45604},{\"end\":45621,\"start\":45614},{\"end\":45632,\"start\":45625},{\"end\":45646,\"start\":45636},{\"end\":45656,\"start\":45650},{\"end\":45666,\"start\":45660},{\"end\":46060,\"start\":46054},{\"end\":46076,\"start\":46064},{\"end\":46087,\"start\":46080},{\"end\":46098,\"start\":46091},{\"end\":46107,\"start\":46102},{\"end\":46425,\"start\":46422},{\"end\":46435,\"start\":46429},{\"end\":46450,\"start\":46439},{\"end\":46460,\"start\":46454},{\"end\":46467,\"start\":46464},{\"end\":46477,\"start\":46471},{\"end\":46776,\"start\":46773},{\"end\":46788,\"start\":46783},{\"end\":46801,\"start\":46792},{\"end\":47258,\"start\":47253},{\"end\":47265,\"start\":47262},{\"end\":47274,\"start\":47269},{\"end\":47291,\"start\":47278},{\"end\":47302,\"start\":47295},{\"end\":47310,\"start\":47306},{\"end\":47322,\"start\":47314},{\"end\":47337,\"start\":47326},{\"end\":47343,\"start\":47339},{\"end\":47627,\"start\":47624},{\"end\":47634,\"start\":47631},{\"end\":47643,\"start\":47638},{\"end\":47649,\"start\":47647},{\"end\":47658,\"start\":47653},{\"end\":47666,\"start\":47662},{\"end\":47674,\"start\":47670},{\"end\":47683,\"start\":47678},{\"end\":47698,\"start\":47687},{\"end\":47710,\"start\":47702},{\"end\":47719,\"start\":47712},{\"end\":48080,\"start\":48073},{\"end\":48088,\"start\":48084},{\"end\":48099,\"start\":48092},{\"end\":48107,\"start\":48103},{\"end\":48375,\"start\":48368},{\"end\":48388,\"start\":48379},{\"end\":48396,\"start\":48392},{\"end\":48409,\"start\":48402},{\"end\":48417,\"start\":48413},{\"end\":48757,\"start\":48751},{\"end\":48766,\"start\":48761},{\"end\":48775,\"start\":48770},{\"end\":48788,\"start\":48782},{\"end\":48798,\"start\":48792},{\"end\":49092,\"start\":49089},{\"end\":49100,\"start\":49096},{\"end\":49114,\"start\":49104},{\"end\":49129,\"start\":49118},{\"end\":49414,\"start\":49411},{\"end\":49422,\"start\":49418},{\"end\":49437,\"start\":49426},{\"end\":49451,\"start\":49441},{\"end\":49711,\"start\":49705},{\"end\":49722,\"start\":49715},{\"end\":49731,\"start\":49726},{\"end\":49742,\"start\":49735},{\"end\":49751,\"start\":49746},{\"end\":49758,\"start\":49755},{\"end\":49773,\"start\":49762},{\"end\":50021,\"start\":50015},{\"end\":50032,\"start\":50025},{\"end\":50042,\"start\":50040},{\"end\":50054,\"start\":50046},{\"end\":50063,\"start\":50058},{\"end\":50072,\"start\":50067},{\"end\":50083,\"start\":50078},{\"end\":50276,\"start\":50269},{\"end\":50291,\"start\":50280},{\"end\":50300,\"start\":50295},{\"end\":50311,\"start\":50304},{\"end\":50317,\"start\":50315},{\"end\":50329,\"start\":50323},{\"end\":50339,\"start\":50333},{\"end\":50611,\"start\":50604},{\"end\":50625,\"start\":50615},{\"end\":50637,\"start\":50629},{\"end\":50650,\"start\":50641},{\"end\":50891,\"start\":50884},{\"end\":50897,\"start\":50895},{\"end\":50906,\"start\":50901},{\"end\":50914,\"start\":50910},{\"end\":50924,\"start\":50918},{\"end\":50937,\"start\":50928},{\"end\":51190,\"start\":51184},{\"end\":51201,\"start\":51194},{\"end\":51212,\"start\":51205},{\"end\":51219,\"start\":51216},{\"end\":51229,\"start\":51223},{\"end\":51239,\"start\":51233},{\"end\":51247,\"start\":51243},{\"end\":51253,\"start\":51251},{\"end\":51262,\"start\":51259},{\"end\":51593,\"start\":51584},{\"end\":51602,\"start\":51597},{\"end\":51613,\"start\":51606},{\"end\":51622,\"start\":51617},{\"end\":52022,\"start\":52013},{\"end\":52029,\"start\":52026},{\"end\":52038,\"start\":52033},{\"end\":52320,\"start\":52317},{\"end\":52330,\"start\":52326},{\"end\":52736,\"start\":52729},{\"end\":52746,\"start\":52740},{\"end\":52757,\"start\":52750},{\"end\":52998,\"start\":52989},{\"end\":53010,\"start\":53002},{\"end\":53328,\"start\":53324},{\"end\":53342,\"start\":53332},{\"end\":53795,\"start\":53792},{\"end\":53807,\"start\":53799},{\"end\":53818,\"start\":53811},{\"end\":53832,\"start\":53822},{\"end\":54127,\"start\":54123},{\"end\":54134,\"start\":54131},{\"end\":54143,\"start\":54138},{\"end\":54151,\"start\":54147},{\"end\":54161,\"start\":54157},{\"end\":54588,\"start\":54577},{\"end\":54594,\"start\":54592},{\"end\":54870,\"start\":54860},{\"end\":54880,\"start\":54874},{\"end\":54890,\"start\":54884},{\"end\":55089,\"start\":55083},{\"end\":55099,\"start\":55093},{\"end\":55109,\"start\":55103}]", "bib_entry": "[{\"attributes\":{\"doi\":\"arXiv:1911.10470\",\"id\":\"b0\"},\"end\":41204,\"start\":40851},{\"attributes\":{\"doi\":\"arXiv:1409.0473\",\"id\":\"b1\"},\"end\":41481,\"start\":41206},{\"attributes\":{\"id\":\"b2\",\"matched_paper_id\":6401679},\"end\":41956,\"start\":41483},{\"attributes\":{\"id\":\"b3\",\"matched_paper_id\":5541486},\"end\":42239,\"start\":41958},{\"attributes\":{\"id\":\"b4\",\"matched_paper_id\":3618568},\"end\":42740,\"start\":42241},{\"attributes\":{\"id\":\"b5\"},\"end\":43046,\"start\":42742},{\"attributes\":{\"id\":\"b6\",\"matched_paper_id\":7138078},\"end\":43289,\"start\":43048},{\"attributes\":{\"doi\":\"arXiv:1810.04805\",\"id\":\"b7\"},\"end\":43620,\"start\":43291},{\"attributes\":{\"id\":\"b8\"},\"end\":43791,\"start\":43622},{\"attributes\":{\"id\":\"b9\",\"matched_paper_id\":2318481},\"end\":44117,\"start\":43793},{\"attributes\":{\"id\":\"b10\",\"matched_paper_id\":54446010},\"end\":44471,\"start\":44119},{\"attributes\":{\"doi\":\"arXiv:1907.10529\",\"id\":\"b11\"},\"end\":44813,\"start\":44473},{\"attributes\":{\"doi\":\"abs/1911.00172\",\"id\":\"b12\",\"matched_paper_id\":207870430},\"end\":45140,\"start\":44815},{\"attributes\":{\"id\":\"b13\",\"matched_paper_id\":9126867},\"end\":45485,\"start\":45142},{\"attributes\":{\"id\":\"b14\",\"matched_paper_id\":86611921},\"end\":46011,\"start\":45487},{\"attributes\":{\"id\":\"b15\",\"matched_paper_id\":195886317},\"end\":46343,\"start\":46013},{\"attributes\":{\"doi\":\"arXiv:1611.01436\",\"id\":\"b16\"},\"end\":46698,\"start\":46345},{\"attributes\":{\"id\":\"b17\",\"matched_paper_id\":173990818},\"end\":47140,\"start\":46700},{\"attributes\":{\"doi\":\"abs/1910.13461\",\"id\":\"b18\",\"matched_paper_id\":204960716},\"end\":47620,\"start\":47142},{\"attributes\":{\"doi\":\"arXiv:1907.11692\",\"id\":\"b19\"},\"end\":48007,\"start\":47622},{\"attributes\":{\"doi\":\"arXiv:1301.3781\",\"id\":\"b20\"},\"end\":48287,\"start\":48009},{\"attributes\":{\"id\":\"b21\",\"matched_paper_id\":16447573},\"end\":48689,\"start\":48289},{\"attributes\":{\"doi\":\"arXiv:1606.03126\",\"id\":\"b22\"},\"end\":49015,\"start\":48691},{\"attributes\":{\"doi\":\"arXiv:1909.04849\",\"id\":\"b23\"},\"end\":49327,\"start\":49017},{\"attributes\":{\"doi\":\"arXiv:1911.03868\",\"id\":\"b24\"},\"end\":49657,\"start\":49329},{\"attributes\":{\"id\":\"b25\",\"matched_paper_id\":3626819},\"end\":49957,\"start\":49659},{\"attributes\":{\"id\":\"b26\"},\"end\":50239,\"start\":49959},{\"attributes\":{\"doi\":\"arXiv:1909.01066\",\"id\":\"b27\"},\"end\":50539,\"start\":50241},{\"attributes\":{\"id\":\"b28\"},\"end\":50827,\"start\":50541},{\"attributes\":{\"id\":\"b29\",\"matched_paper_id\":160025533},\"end\":51097,\"start\":50829},{\"attributes\":{\"doi\":\"arXiv:1910.10683\",\"id\":\"b30\"},\"end\":51519,\"start\":51099},{\"attributes\":{\"id\":\"b31\",\"matched_paper_id\":11816014},\"end\":52009,\"start\":51521},{\"attributes\":{\"doi\":\"arXiv:1806.03822\",\"id\":\"b32\"},\"end\":52266,\"start\":52011},{\"attributes\":{\"id\":\"b33\",\"matched_paper_id\":514516},\"end\":52709,\"start\":52268},{\"attributes\":{\"doi\":\"arXiv:TBD\",\"id\":\"b34\"},\"end\":52929,\"start\":52711},{\"attributes\":{\"id\":\"b35\",\"matched_paper_id\":207178704},\"end\":53225,\"start\":52931},{\"attributes\":{\"id\":\"b36\",\"matched_paper_id\":2470716},\"end\":53732,\"start\":53227},{\"attributes\":{\"id\":\"b37\",\"matched_paper_id\":8535316},\"end\":54063,\"start\":53734},{\"attributes\":{\"id\":\"b38\",\"matched_paper_id\":9275142},\"end\":54495,\"start\":54065},{\"attributes\":{\"id\":\"b39\",\"matched_paper_id\":1653222},\"end\":54828,\"start\":54497},{\"attributes\":{\"id\":\"b40\",\"matched_paper_id\":1399322},\"end\":55077,\"start\":54830},{\"attributes\":{\"doi\":\"arXiv:1410.3916\",\"id\":\"b41\"},\"end\":55250,\"start\":55079}]", "bib_title": "[{\"end\":41538,\"start\":41483},{\"end\":42009,\"start\":41958},{\"end\":42290,\"start\":42241},{\"end\":42799,\"start\":42742},{\"end\":43081,\"start\":43048},{\"end\":43835,\"start\":43793},{\"end\":44182,\"start\":44119},{\"end\":44884,\"start\":44815},{\"end\":45162,\"start\":45142},{\"end\":45549,\"start\":45487},{\"end\":46050,\"start\":46013},{\"end\":46769,\"start\":46700},{\"end\":47249,\"start\":47142},{\"end\":48364,\"start\":48289},{\"end\":49699,\"start\":49659},{\"end\":50880,\"start\":50829},{\"end\":51580,\"start\":51521},{\"end\":52313,\"start\":52268},{\"end\":52985,\"start\":52931},{\"end\":53316,\"start\":53227},{\"end\":53788,\"start\":53734},{\"end\":54119,\"start\":54065},{\"end\":54573,\"start\":54497},{\"end\":54856,\"start\":54830}]", "bib_author": "[{\"end\":40941,\"start\":40933},{\"end\":40954,\"start\":40941},{\"end\":40968,\"start\":40954},{\"end\":40978,\"start\":40968},{\"end\":40987,\"start\":40978},{\"end\":41289,\"start\":41277},{\"end\":41296,\"start\":41289},{\"end\":41306,\"start\":41296},{\"end\":41550,\"start\":41540},{\"end\":41558,\"start\":41550},{\"end\":41569,\"start\":41558},{\"end\":41578,\"start\":41569},{\"end\":42020,\"start\":42011},{\"end\":42030,\"start\":42020},{\"end\":42039,\"start\":42030},{\"end\":42300,\"start\":42292},{\"end\":42309,\"start\":42300},{\"end\":42319,\"start\":42309},{\"end\":42329,\"start\":42319},{\"end\":42810,\"start\":42801},{\"end\":42821,\"start\":42810},{\"end\":43092,\"start\":43083},{\"end\":43100,\"start\":43092},{\"end\":43301,\"start\":43291},{\"end\":43313,\"start\":43301},{\"end\":43320,\"start\":43313},{\"end\":43333,\"start\":43320},{\"end\":43339,\"start\":43333},{\"end\":43673,\"start\":43663},{\"end\":43682,\"start\":43673},{\"end\":43695,\"start\":43682},{\"end\":43844,\"start\":43837},{\"end\":43859,\"start\":43844},{\"end\":43867,\"start\":43859},{\"end\":43876,\"start\":43867},{\"end\":44199,\"start\":44184},{\"end\":44206,\"start\":44199},{\"end\":44214,\"start\":44206},{\"end\":44225,\"start\":44214},{\"end\":44482,\"start\":44473},{\"end\":44490,\"start\":44482},{\"end\":44497,\"start\":44490},{\"end\":44507,\"start\":44497},{\"end\":44522,\"start\":44507},{\"end\":44530,\"start\":44522},{\"end\":44540,\"start\":44530},{\"end\":44900,\"start\":44886},{\"end\":44908,\"start\":44900},{\"end\":44920,\"start\":44908},{\"end\":44935,\"start\":44920},{\"end\":44943,\"start\":44935},{\"end\":44947,\"start\":44943},{\"end\":45173,\"start\":45164},{\"end\":45180,\"start\":45173},{\"end\":45199,\"start\":45180},{\"end\":45208,\"start\":45199},{\"end\":45219,\"start\":45208},{\"end\":45231,\"start\":45219},{\"end\":45241,\"start\":45231},{\"end\":45566,\"start\":45551},{\"end\":45578,\"start\":45566},{\"end\":45591,\"start\":45578},{\"end\":45602,\"start\":45591},{\"end\":45612,\"start\":45602},{\"end\":45623,\"start\":45612},{\"end\":45634,\"start\":45623},{\"end\":45648,\"start\":45634},{\"end\":45658,\"start\":45648},{\"end\":45668,\"start\":45658},{\"end\":46062,\"start\":46052},{\"end\":46078,\"start\":46062},{\"end\":46089,\"start\":46078},{\"end\":46100,\"start\":46089},{\"end\":46109,\"start\":46100},{\"end\":46427,\"start\":46420},{\"end\":46437,\"start\":46427},{\"end\":46452,\"start\":46437},{\"end\":46462,\"start\":46452},{\"end\":46469,\"start\":46462},{\"end\":46479,\"start\":46469},{\"end\":46778,\"start\":46771},{\"end\":46790,\"start\":46778},{\"end\":46803,\"start\":46790},{\"end\":47260,\"start\":47251},{\"end\":47267,\"start\":47260},{\"end\":47276,\"start\":47267},{\"end\":47293,\"start\":47276},{\"end\":47304,\"start\":47293},{\"end\":47312,\"start\":47304},{\"end\":47324,\"start\":47312},{\"end\":47339,\"start\":47324},{\"end\":47345,\"start\":47339},{\"end\":47629,\"start\":47622},{\"end\":47636,\"start\":47629},{\"end\":47645,\"start\":47636},{\"end\":47651,\"start\":47645},{\"end\":47660,\"start\":47651},{\"end\":47668,\"start\":47660},{\"end\":47676,\"start\":47668},{\"end\":47685,\"start\":47676},{\"end\":47700,\"start\":47685},{\"end\":47712,\"start\":47700},{\"end\":47721,\"start\":47712},{\"end\":48082,\"start\":48071},{\"end\":48090,\"start\":48082},{\"end\":48101,\"start\":48090},{\"end\":48109,\"start\":48101},{\"end\":48377,\"start\":48366},{\"end\":48390,\"start\":48377},{\"end\":48398,\"start\":48390},{\"end\":48411,\"start\":48398},{\"end\":48419,\"start\":48411},{\"end\":48759,\"start\":48749},{\"end\":48768,\"start\":48759},{\"end\":48777,\"start\":48768},{\"end\":48790,\"start\":48777},{\"end\":48800,\"start\":48790},{\"end\":48809,\"start\":48800},{\"end\":48813,\"start\":48809},{\"end\":49094,\"start\":49087},{\"end\":49102,\"start\":49094},{\"end\":49116,\"start\":49102},{\"end\":49131,\"start\":49116},{\"end\":49416,\"start\":49409},{\"end\":49424,\"start\":49416},{\"end\":49439,\"start\":49424},{\"end\":49453,\"start\":49439},{\"end\":49713,\"start\":49701},{\"end\":49724,\"start\":49713},{\"end\":49733,\"start\":49724},{\"end\":49744,\"start\":49733},{\"end\":49753,\"start\":49744},{\"end\":49760,\"start\":49753},{\"end\":49775,\"start\":49760},{\"end\":50023,\"start\":50011},{\"end\":50034,\"start\":50023},{\"end\":50044,\"start\":50034},{\"end\":50056,\"start\":50044},{\"end\":50065,\"start\":50056},{\"end\":50074,\"start\":50065},{\"end\":50085,\"start\":50074},{\"end\":50278,\"start\":50267},{\"end\":50293,\"start\":50278},{\"end\":50302,\"start\":50293},{\"end\":50313,\"start\":50302},{\"end\":50319,\"start\":50313},{\"end\":50331,\"start\":50319},{\"end\":50341,\"start\":50331},{\"end\":50613,\"start\":50602},{\"end\":50627,\"start\":50613},{\"end\":50639,\"start\":50627},{\"end\":50652,\"start\":50639},{\"end\":50893,\"start\":50882},{\"end\":50899,\"start\":50893},{\"end\":50908,\"start\":50899},{\"end\":50916,\"start\":50908},{\"end\":50926,\"start\":50916},{\"end\":50939,\"start\":50926},{\"end\":51192,\"start\":51182},{\"end\":51203,\"start\":51192},{\"end\":51214,\"start\":51203},{\"end\":51221,\"start\":51214},{\"end\":51231,\"start\":51221},{\"end\":51241,\"start\":51231},{\"end\":51249,\"start\":51241},{\"end\":51255,\"start\":51249},{\"end\":51264,\"start\":51255},{\"end\":51595,\"start\":51582},{\"end\":51604,\"start\":51595},{\"end\":51615,\"start\":51604},{\"end\":51624,\"start\":51615},{\"end\":52024,\"start\":52011},{\"end\":52031,\"start\":52024},{\"end\":52040,\"start\":52031},{\"end\":52322,\"start\":52315},{\"end\":52332,\"start\":52322},{\"end\":52738,\"start\":52727},{\"end\":52748,\"start\":52738},{\"end\":52759,\"start\":52748},{\"end\":53000,\"start\":52987},{\"end\":53012,\"start\":53000},{\"end\":53330,\"start\":53318},{\"end\":53344,\"start\":53330},{\"end\":53797,\"start\":53790},{\"end\":53809,\"start\":53797},{\"end\":53820,\"start\":53809},{\"end\":53834,\"start\":53820},{\"end\":54129,\"start\":54121},{\"end\":54136,\"start\":54129},{\"end\":54145,\"start\":54136},{\"end\":54153,\"start\":54145},{\"end\":54163,\"start\":54153},{\"end\":54167,\"start\":54163},{\"end\":54590,\"start\":54575},{\"end\":54596,\"start\":54590},{\"end\":54872,\"start\":54858},{\"end\":54882,\"start\":54872},{\"end\":54892,\"start\":54882},{\"end\":55091,\"start\":55081},{\"end\":55101,\"start\":55091},{\"end\":55111,\"start\":55101}]", "bib_venue": "[{\"end\":41737,\"start\":41666},{\"end\":42490,\"start\":42418},{\"end\":46938,\"start\":46879},{\"end\":49799,\"start\":49791},{\"end\":51783,\"start\":51712},{\"end\":52515,\"start\":52432},{\"end\":53499,\"start\":53430},{\"end\":54288,\"start\":54236},{\"end\":40931,\"start\":40851},{\"end\":41275,\"start\":41206},{\"end\":41664,\"start\":41578},{\"end\":42087,\"start\":42039},{\"end\":42416,\"start\":42329},{\"end\":42884,\"start\":42821},{\"end\":43149,\"start\":43100},{\"end\":43429,\"start\":43355},{\"end\":43661,\"start\":43622},{\"end\":43937,\"start\":43876},{\"end\":44274,\"start\":44225},{\"end\":44615,\"start\":44556},{\"end\":44966,\"start\":44961},{\"end\":45290,\"start\":45241},{\"end\":45729,\"start\":45668},{\"end\":46158,\"start\":46109},{\"end\":46418,\"start\":46345},{\"end\":46877,\"start\":46803},{\"end\":47364,\"start\":47359},{\"end\":47783,\"start\":47737},{\"end\":48069,\"start\":48009},{\"end\":48468,\"start\":48419},{\"end\":48747,\"start\":48691},{\"end\":49085,\"start\":49017},{\"end\":49407,\"start\":49329},{\"end\":49789,\"start\":49775},{\"end\":50009,\"start\":49959},{\"end\":50265,\"start\":50241},{\"end\":50600,\"start\":50541},{\"end\":50950,\"start\":50939},{\"end\":51180,\"start\":51099},{\"end\":51710,\"start\":51624},{\"end\":52114,\"start\":52056},{\"end\":52430,\"start\":52332},{\"end\":52725,\"start\":52711},{\"end\":53059,\"start\":53012},{\"end\":53428,\"start\":53344},{\"end\":53886,\"start\":53834},{\"end\":54234,\"start\":54167},{\"end\":54645,\"start\":54596},{\"end\":54941,\"start\":54892}]"}}}, "year": 2023, "month": 12, "day": 17}