{"id": 212647122, "updated": "2022-01-30 19:05:50.888", "metadata": {"title": "On the Use of Cyber Threat Intelligence (CTI) in Support of Developing the Commander's Understanding of the Adversary", "authors": "[{\"middle\":[],\"last\":\"Parmar\",\"first\":\"Manisha\"},{\"middle\":[],\"last\":\"Domingo\",\"first\":\"Alberto\"}]", "venue": "MILCOM 2019 - 2019 IEEE Military Communications Conference (MILCOM)", "journal": "MILCOM 2019 - 2019 IEEE Military Communications Conference (MILCOM)", "publication_date": {"year": 2019, "month": null, "day": null}, "abstract": "Cyber Threat Intelligence (CTI) is a rapidly developing field which has evolved in direct response to exponential growth in cyber related crimes and attacks. CTI supports Communication and Information System (CIS)Security in order to bolster defenses and aids in the development of threat models that inform an organization's decision making process. In a military organization like NATO, CTI additionally supports Cyberspace Operations by providing the Commander with essential intelligence about the adversary, their capabilities and objectives while operating in and through cyberspace. There have been many contributions to the CTI field; a noteworthy contribution is the ATT&CK® framework by the Mitre Corporation. ATT&CK® contains a comprehensive list of adversary tactics and techniques linked to custom or publicly known Advanced Persistent Threats (APT) which aids an analyst in the characterization of Indicators of Compromise (IOCs). The ATT&CK® framework also demonstrates possibility of supporting an organization with linking observed tactics and techniques to specific APT behavior, which may assist with adversary characterization and identification, necessary steps towards attribution. The NATO Allied Command Transformation (ACT) and the NATO Communication and Information Agency (NCI Agency) have been experimenting with the use of deception techniques (including decoys) to increase the collection of adversary related data. The collected data is mapped to the tactics and techniques described in the ATT&CK® framework, in order to derive evidence to support adversary characterization; this intelligence is pivotal for the Commander to support mission planning and determine the best possible multi-domain courses of action. This paper describes the approach, methodology, outcomes and next steps for the conducted experiments.", "fields_of_study": "[\"Computer Science\"]", "external_ids": {"arxiv": null, "mag": "3011422375", "acl": null, "pubmed": null, "pubmedcentral": null, "dblp": "conf/milcom/ParmarD19", "doi": "10.1109/milcom47813.2019.9020852"}}, "content": {"source": {"pdf_hash": "0f0afc80ff38a620784062b50211501bde068542", "pdf_src": "IEEE", "pdf_uri": null, "oa_url_match": false, "oa_info": null}, "grobid": {"id": "40dfaaf440335c5b5d15443eb697ec5535e68ecf", "type": "plain-text", "url": "s3://ai2-s2-pdf-extraction-prod/parse-results/s2orc_worker/0f0afc80ff38a620784062b50211501bde068542.txt", "contents": "\nXXX-X-XXXX-XXXX-X/XX/$XX.00 ©20XX IEEE On the use of Cyber Threat Intelligence (CTI) in Support of Developing the Commander's Understanding of the Adversary\n\n\nMs Manisha Parmar manisha.parmar@ncia.nato.int \nNATO Allied Command Transformation (ACT), North Atlantic Treaty Organization (NATO)\nNATO CIS Agency (NCI Agency)\nNorth Atlantic Treaty Organization (NATO)\nHague, NorfolkVANetherlands, USA\n\nDrAlberto Domingo alberto.domingo@act.nato.int \nNATO Allied Command Transformation (ACT), North Atlantic Treaty Organization (NATO)\nNATO CIS Agency (NCI Agency)\nNorth Atlantic Treaty Organization (NATO)\nHague, NorfolkVANetherlands, USA\n\nXXX-X-XXXX-XXXX-X/XX/$XX.00 ©20XX IEEE On the use of Cyber Threat Intelligence (CTI) in Support of Developing the Commander's Understanding of the Adversary\nCyberspaceATT&CK®Cyber Threat IntelligenceDeception TechniquesDecoysAdversary Attribution\nCyber Threat Intelligence (CTI) is a rapidly developing field which has evolved in direct response to exponential growth in cyber related crimes and attacks. CTI supports Communication and Information System (CIS) Security in order to bolster defenses and aids in the development of threat models that inform an organization's decision making process. In a military organization like NATO, CTI additionally supports Cyberspace Operations by providing the Commander with essential intelligence about the adversary, their capabilities and objectives while operating in and through cyberspace.There have been many contributions to the CTI field; a noteworthy contribution is the ATT&CK® framework by the Mitre Corporation. ATT&CK® contains a comprehensive list of adversary tactics and techniques linked to custom or publicly known Advanced Persistent Threats (APT) which aids an analyst in the characterization of Indicators of Compromise (IOCs). The ATT&CK® framework also demonstrates possibility of supporting an organization with linking observed tactics and techniques to specific APT behavior, which may assist with adversary characterization and identification, necessary steps towards attribution.The NATO Allied Command Transformation (ACT) and the NATO Communication and Information Agency (NCI Agency)have been experimenting with the use of deception techniques (including decoys) to increase the collection of adversary related data. The collected data is mapped to the tactics and techniques described in the ATT&CK® framework, in order to derive evidence to support adversary characterization; this intelligence is pivotal for the Commander to support mission planning and determine the best possible multi-domain courses of action. This paper describes the approach, methodology, outcomes and next steps for the conducted experiments.\n\nINTRODUCTION\n\nCyber Threat Intelligence (CTI) has gained a significant amount of attention in cyber security communities as a way to forecast potential threats and reduce attack detection time in terms of the kill chain processes [1]. CTI can be used in cyberspace operations as it aids the Commander with essential information about the adversary which, ultimately, impacts mission assurance. Furthermore, for those communities with a strong interest in attributing adversary actions, such as defence and military, the collection of tactics and techniques via CTI feeds can also aid in understanding \"adversary like\" characteristics which can be used to support theories of adversary identification which facilitates mission planning and the decision making process for the Commander in determining the best possible multi-domain courses of action.\n\nFor an organization such as NATO, who has recognized Cyberspace as one of four operational domains [2], adversary attribution for the Commander is an important capability.\n\nThe ATT&CK® Framework [3] from the Mitre Corporation is a noteworthy contribution to the field of CTI, and contains a number of tactics and techniques which are described as per categories of adversary modus operandi, each which are linked to a number of threat actors who are known to employ such tactics or techniques. Use of the ATT&CK® Framework can aid an organization in the 1) behavioral analytics development, 2) threat intelligence enrichment, 3) defensive gap assessment, 4) adversary emulation of known threat actor groups and 5) Security Operations Centre (SOC) maturity assessment. Additionally, the repository of publicly known Advanced Persistent Threats (APTs) can be mapped by the CTI team to characterize Indicators of Compromise (IOCs) as seen on their network, which may highlight known attack patterns of activity, giving some indication of what adversary (or adversaries) may be targeting an organization. A partial screenshot of the online ATT&CK navigator is seen in Figure  1.  as honeypots) to collect adversary traffic and perform subsequent analysis, with aid of the ATT&CK® Framework, to highlight known patterns of adversary activity. The overall objective of the experiment was to determine whether use of the ATT&CK® Framework and technical data gathered from endpoint sensors could be used to derive operationally relevant information for the Commander concerning the adversary. This objective, aligned with the methods, was achieved via the execution of three test cases: 1) validate that honey pots are able to provide \"rich enough\" information to conduct further analysis, 2) validate that the data from the first test case can be mapped to the tactics and techniques of the ATT&CK® framework and 3) validate that operational context based on the threat actors identified in test case 2 can be collected using the Malware Information Sharing Platform (MISP) [4] and/or other open source intelligence inputs.\n\n\nII. EXPERIMENT PREPARATION\n\nIn preparing for the exercise, three teams were created: a White Team (WT), a Blue Team (BT) and a Red Team (RT). The WT were put in charge of the experiment itself and were charged with ensuring the parameters for the experiment were controlled and established in a reasonable methodology. The BT was responsible for the fine tuning of the sensors in the test bed for data collection (in this case, Sysmon), and subsequent analysis of the data once collection was completed. In Test Case (TC) 2, the BT were divided into two: the first analyst (BT1) was equipped with the automated threat detection capability and use of the ATT&CK® Framework, the second (BT2) without any automated tools or framework support; this analyst only used the raw data and their own skill. Lastly, the RT was responsible for the generation of scripts used by the RT simulation tool (Caldera 2.0) and for working with the CCDCOE for their live RT attack contributions to the experiment. Due to resource constraints, some members of the WT were dual hatted, and also played on the BT. Of course, to ensure BT analysis was unbiased, no members of the BT would participate on the RT, and vice versa. Once plans for the exercise were underway, a knowledge \"firewall\" was put in place between the BTs and RT.\n\n\nIII. INNOVATION\n\nThe ATT&CK Framework was developed to support the five use cases described in the Introduction of this paper, and was not designed to explicitly address the topic of attribution [5]. The content and structure of the Framework does, however, allow for extrapolation of novel use cases such as the one described within.\n\nThe experiments were, therefore, designed to 1) test innovations in the adoption of existing frameworks for their novel application, 2) in combining multiple sources of input to correlate and derive operational context and 3) using artificial intelligence and machine learning to improve threat detection cycles (this activity is conducted in the aftermath of the CWIX experimentation and is out of scope for this report).\n\nAt the time of the exercise, there were no known examples of the ATT&CK® Framework being used in the proposed use case, however, at the time of writing, there are experiments being conducted by commercial CTI providers using a similar methodology. The results of these experiments are not presently known.\n\n\nIV. TEST BED PREPARATION\n\nA mock test environment was prepared, however, the test environment was intentionally simple as to allow more focus to be applied on the data collection aspects themselves. Testing was performed from within our own experimental enclave: a DMZ, CORE, User LAN and Administrative segment were created ( Figure 2). The environment consisting of several Virtual Machines (VM) to emulate user workstations, servers and honeypots (all located in the User LAN), as well as to host VMs to support centralized monitoring using Splunk (CORE), and deployment of an automated RT simulation tool (Mitre's Caldera® 2.0, located in the User LAN). A user simulation tool, AutoHotKey, was also deployed (on each endpoint) to simulate regular user traffic and create \"noise\" on the network, hiding adversary traffic amongst legitimate user actions. The baseline Operating Systems (OSs) for each of the images (both workstations and servers) were based on baseline images of the NATO Computer Incident Response Capability Technical Centre (NCIRC TC). \n\n\nV. CONTRIBUTION TO INNOVATION AND EXPECTED OUTCOMES\n\nTo facilitate data collection, all user workstations, servers and honeypots were configured to log all Windows Application, System and Security logs. Sensors on all the endpoints were enabled with the use of Sysmon which was configured to automatically map known events to an associated ATT&CK® ID. Both Windows Logs and Sysmon generated events were sent to a centralized monitoring instance with a Splunk deployment and collected in the main Splunk index and a Splunk index created by a Threat Hunting Application, respectively ( Figure 3).\n\nOf course, the image of honeypot endpoints was the same image as the user workstations, to ensure the attacker was not be able to easily distinguish between the two.\n\n\nFigure 3: Experiment Design\n\nTo ensure accreditation of the unclassified test system was acceptable for deployment to the CWIX Unclassified testing environment, an open source firewall was installed to provide segregation from other entities within the Cyber enclave of the CWIX Unclassified environment.\n\nAfter initial testing with RT traffic and optimizations / corrections were made to the test environment, three official \"runs\" of the TCs were conducted: two using Caldera 2.0, and one with the CCDCOE RT. During all TC runs, BT analysts did not actively defend the network.\n\n\nVI. VALIDATION OF DECEPTION TECHNOLOGIES\n\nIn Test Case 1 (TC1), we are most interested in understanding whether the use of deception technologies, or decoys, such as honeypots, can offer enough data about the adversary and his/her modus operandi to map findings to the ATT&CK® framework's tactics and techniques. The honeypots used in the test environment were high interactive honeypots; meaning, full installations of the OS footprint used on operational systems were installed and deployed, allowing any attacker interacting with the honeypot full ability to explore the system and perform a variety of functions. Traffic observed via event reporting to these particular systems was automatically considered suspicious, based on the fact that normal user traffic would not generally be seen at these systems.\n\nIn that sense, it is trivial to separate the events generated by the decoys from those events generated by regular workstations and servers. Whether this data on its own, however, is useful to achieve the ATT&CK® Framework mapping and identify \"adversary like\" behavior is a separate question, one that was answered in the analysis of TC 2.\n\nIt should be noted that the effectiveness in the use of decoys can be further enhanced by BT analysts through \"baiting\" the attacker: for example, the BT analyst may plant, within the honeynet or honey system, honey tokens such as falsified documents (that look classified or important otherwise) and/or planted credentials. For instance, if the attacker is on a honeypot workstation, the BT analyst may plant a Notepad file called \"Password.txt\" and include credentials that can be used on another workstation that provides an alert to the BT upon use. This type of interaction enables the BT to learn more about the adversary and the modus operandi used, which can further enable the ATT&CK® Framework mapping of attacker activity. For example, attackers tend to use the same types of tactics and techniques, such as the deployment of a Remote Access Tool (RAT) or the specific use of malware. BT analysts could take this an additional step further, by offering live interaction; that is, responding to an attacker's actions with a specific response, intended to continue luring him or her in for the purpose of learning more about their methods.\n\nDue to the automated nature of the RT activity in this experimentation using Caldera 2.0, it was neither possible nor intended to engage in this type of live interaction with the attacker (as the attacker playbook is pre-scripted). While it was, however, possible to do this with the CCDCOE RT, due to the timing of this TC and availability of BT analysts, this type of interaction was not conducted and is considered by the authors as a limitation of the testing.\n\nIn summary, considering limitations as described above, the fact that the data generated by the decoys provided a reasonable first step in the BT analysis, indicates that it is beneficial to use data from decoys in order to derive support to adversary like behavior, however, these experiments did not yield enough proof to demonstrate the use of this data alone is effective enough; it must be supplemented with analysis of data generated on regular user workstations and servers.\n\n\nVII. VALIDATION OF AUTOMATED THREAT DETECTION\n\nIn Test Case 2 (TC2), two BT analysts were tasked to review and analyze the resultant data from TC1 with the objective of identifying adversary patterns emulated by the RT. BT1 was provided with the Sysmon alerts and access to the Threat Hunting application in Splunk which provides an auto mapping of the events to the ATT&CK® Framework (where possible). BT2 was only provided access to the main Splunk index where all Windows events (Application, System and Security) were available. There was no auto mapping to the ATT&CK® Framework provided in BT2's view. BT2 was, however, able to begin analysis with an educated starting point, given the data generation from the decoys, and the assumption that this data can be assumed as unexpected.\n\nOverall, in the cases where BT analysis was done against the automated RT attacks (using Caldera® 2.0), BT1 was able to derive valuable outputs before BT2, via use of the ATT&CK® Framework, and the mapping of tactics and techniques as alerted via the Sysmon configuration and the Threat Hunting application in Splunk. The data to derive such output, however, went beyond only using events generated by the decoys, and it was obvious that while data generated by the decoys was helpful in the BT analysis (for both BT1 and BT2), the data, alone, was not enough to derive adversary like patterns with a reasonable degree of confidence. Recall the limitation of this experimentation as described in TC1: attacker interaction with the decoys could not be stimulated or \"baited\" by the BT since an automated script for the RT activity was being used. Naturally, BT interaction with the attacker via the use of decoys would elicit more events concerning tactics and techniques of the adversary; this additional data would clearly aid in the efficiency of the analysis conducted by both BT although it is not easy to determine which threshold would need to be reached in order to rely solely on decoy generated data.\n\n\nFigure 4: Splunk Threat Hunting Overview\n\nDuring RT testing by the CCDCOE, there was only BT analysis conducted by BT1; this was due to the timing of the experimentation and unavailability of more than one BT member. Additionally, the time provided to BT1 was limited, and as a result, thorough analysis of the RT patterns was not exhaustive. As a result, outcomes from the analysis conducted by BT1 based on CCDCOE RT traffic was incomplete, however, some degree of pattern matching was conducted that provides promising insight into the potential of further mapping of events to the tactics and techniques within the ATT&CK® Framework.\n\nIn summary, results from TC2 yielded the following results: On run 1, BT1 was able to correctly identify which adversary was simulated by the automated RT (APT 3, ATT&CK® mapping shown in Figure 5; the diagram is meant to be illustrative, not readable). BT2 had begun analyzing traffic from the decoys, but was not able to reach any conclusion in the time available. On run 2, BT1 was also able to correctly identify the emulated adversary. BT2 once again had successfully begun manual analysis of the traffic, but no conclusions could be reached. In run 3 using the CCDCOE, no conclusions could be reached by BT1 due to the short time available. There was no participation by BT2.\n\n\nFigure 5: APT 3 Mapped to ATT&CK® Framework\n\n\nVIII. VALIDATION OF OPERATIONAL SITUATIONAL\n\n\nAWARENESS BUILDING\n\nFor TC3, using the identified adversaries from TC2, operationally relevant information about the adversary was derived using accessible sources to the NCIRC TC. This includes the use of MISP and online resources such as FireEye's APT repository [6] and APT Notes from Threatminer. The Diamond Model for Intrusion Analysis [7] can also be applied to the analysis process in characterizing the adversary, and can be employed to aid in collection of various CTI elements, such as payload, distribution method, general victimology and, if possible, adversary avatar.\n\nFinding any information about specific APT groups is not necessarily challenging, however, finding operationally relevant information may in fact be. For starters, one must have an appreciation for the terms \"operationally relevant\"; for the purpose of our work, we consider operationally relevant information as knowledge about the adversary that supports the Commander in his decision making process when it comes to the goals of the mission.\n\nGiven that the vignette used in the exercise was based on mock countries and scenarios, it was necessary to develop criteria, in advance to the experiments, that would be used in the BT analysis to facilitate the determination of whether information about the APT can be considered operationally relevant.\n\n\n\n\nThe APT's known physical geographic location that may be cause to introduce a particular group to an organization's threat model. Other relevant information includes attacker intent, history, links, funding sources and known capabilities. \n\nThe APT's targeting location (for example, a North Korean APT cell may be targeting Baltic nation states). The Commander's Area of Responsibility (AOR) may lie within this targeted region. \n\nThe APT's traditional victimology (whether it be Transportation, High Tech Industry, Government, Military, Construction and Engineering, etc.). \n\nThe APT's preferred method of payload distribution with knowledge that a critical mission asset is vulnerable to the vulnerability typically exploited.\n\nThere are plenty of other types of operationally relevant information; the above serves to simply provide some examples to the reader. In fact, it is possible that information may not be operationally relevant when it is learned, but is relevant at another time, and that the relevancy of the information is not recognized as operationally relevant until a mission is underway.\n\nIn summary, for TC 3, the following elements of operationally relevant information were collected on APT 3 and APT 37. For APT 3, it was learned that this group operates out of China and can be strongly linked to the Chinese Ministry of State Security [8] and specifically targets Aerospace and Defense victims however, victimology has changed in recent years from exclusively targeting US victims to now focusing on victims within political organizations operating in the Hong Kong area. Their methodology primarily relies on zero day attacks, but those that are browser based and some depending on old versions of Adobe Flash. If indeed this APT was suspected as attacking the network, much of the information found would aid in the bolstering of defenses, and in further characterization of the threat model. There was no data in MISP available.\n\nFor APT 37, it was learned that this group operates out of South Korea and tends to target mainly South Korea, Japan, Vietnam and the Middle East. Their methodology also relies to zero day attacks (as it is with APT 3), however, APT 37 is also a fan of malware based attacks and credential stealing.\n\nInformation in MISP for APT 37 was available, and in fact there were 10 events associated to this particular threat group. Through MISP, it was learned that APT 37 actors rely on espionage in order to exploit their targets and seem to be related to the Lazarus group, who are a well-known criminal organization linked to, mainly, financial crimes and theft.\n\nBased on the experiments conducted at the CWIX 2019 exercise, a number of findings can confidently be assessed.\n\nFirstly, the use of decoy data is very valuable to aid in BT assessment of traffic, however, without \"baiting\" the attacker, it is not possible to state that this data alone can support adversary characterization. Future testing would need to be done using a live red team test.\n\nSecondly, it is obvious that use of the ATT&CK® Framework provides a sound methodology for which BT members can map events to the tactics and techniques. \n\n\nIX. EXPERIMENTAL FINDINGS AND FUTURE WORK\n\nWithout the framework and mapping initiative, BT analysis is ad hoc and without much structure. This process is timely and given the fast changing nature of Cyberspace and its criticality to mission support, this time investment is one not easily afforded.\n\nThirdly, through the use of the ATT&CK® Framework, it is possible to identify correlations / patterns, however, this is a manual process. An improvement and potential area of future work would be to develop an auto-mapping capability which takes the event with the identified ATT&CK® ID, and maps it to the framework. Then, using this mapping, a tool could provide \"best fit\" characterization for the adversary. While possible to conduct, the manual approach is not elegant and could easily be augmented with automated support.\n\nMISP and open source intelligence portals provide interesting information that, when coupled with mission metadata, can provide the Commander with a better understanding of the adversary.\n\nLastly, it is evident from the information collected on the adversary that information can be provided to both the operational community (for the Commander's understanding) and to the technical community to aid in CIS Monitoring, Real Time Detection and Proactive Detection capabilities.\n\n\nX. FUTURE WORK\n\nIn addition to the secondary testing for the use of decoys and creation of an auto mapping and visualization tool to aid BT analysis described above, the experimentation would benefit from further validation in other, suitable environments. The Cyber Coalition 2019 exercise, NATO's largest Cyber exercise, offers such a suitable environment where over 29 nations come together for three days of joint exercise activities. This experimentation background will be used to further focus on the validation of resulting outputs from this approach to the Commander's overall Cyber Situational Awareness. In addition, the use of automation will be considered to further increase effectiveness of such approaches, along with artificial intelligence (machine learning) strategies to further reduce the cycle in deriving correlations of adversary behavior.\n\n\nXI. CONCLUSIONS\n\nThe CWIX 2019 exercise environment provided an opportune location to conduct the three TCs to leverage CTI in unique ways to facilitate support to the Commander for adversary characterization. As it was once said \"Intrusion analysis is as much about tcpdump as astronomy is about telescopes\" (Chris Sanders, [10]), and those of us with the mandate to evolve capability development in the area of cyberspace operations must continue to find innovative ways to reduce the human burden and increase effectiveness and efficiencies in response time and support the missions of our organizations. Frameworks, such as ATT&CK®, offer a consistent and structured mechanism in which communication can occur across a variety of stakeholders (including those in the operational and technical communities) and highlight patterns of activity which can be used, in combination with other evidence, to support adversary attribution.\n\nFigure 1 :\n1Partial View of ATT&CK® Navigator with Menu Options Shown\n\nFigure 2 :\n2CWIX 2019 Test Bed Network Architecture\n\nFigure 6 :\n6APT 3 Timeline of Activities[9] \n\n\nThe NATO Allied Command Transformation (ACT) and NATO Communication and Information Agency (NCI Agency) have performed experimentation at the Coalition Warrior Interoperability eXercise (CWIX) in June of 2019, in Bydgoszcz, Poland, where all 29 NATO nations and several partner nations meet to test cooperative interoperability through the execution of well-planned vignettes. The ACT / NCI Agency experimentation focused on the employment of deception techniques (specifically, tools such This work has been funded through the annual NATO Military Budget (NMB) Program of Work for NATO Allied Command Transformation (ACT).\n\nWhat is Cyber Threat Intelligence, and Why Do You Need It?. Shimon Brathwaite, Business News Daily. Available at. Shimon Brathwaite, \"What is Cyber Threat Intelligence, and Why Do You Need It?\" Business News Daily. Available at https://www.businessnewsdaily.com/11141-cyber-threat- intelligence.html\n\n(INV)-FINAL, Warsaw Summit Communiqué, Item #70. Dprc-Wp, DPRC-WP(2016)0003-REV14 (INV)-FINAL, Warsaw Summit Communiqué, Item #70. July 2016. Available at https://www.nato.int/cps/ic/natohq/official_texts_133169.htm.\n\n. Online ATT&CK® Navigation tool. Online ATT&CK® Navigation tool available at https://mitre- attack.github.io/attack-navigator/enterprise/\n\nMalware Information Sharing Platform. Malware Information Sharing Platform, available at https://www.misp- project.org/\n\nMitre ATT&CK: Design and Philosophy. B Strom, A Applebaum, D Miller, K Nickels, A Pennington, C Thomas, B. Strom, A. Applebaum, D. Miller, K. Nickels, A. Pennington, C. Thomas, \"Mitre ATT&CK: Design and Philosophy\", July 2018. Available at https://www.mitre.org/sites/default/files/publications/pr-18- 0944-11-mitre-attack-design-and-philosophy.pdf\n\nAdvanced Persistent Threat Groups. Fireye, Online Resource accessible atFireye, \"Advanced Persistent Threat Groups\", Online Resource accessible at https://www.fireeye.com/current-threats/apt-groups.html.\n\nThe Diamond Model of Intrusion Analysis. Sergio Caltagirone, Andrew Pendergast, Chirstopher Betz, Active Response. Available atSergio Caltagirone, Andrew Pendergast, Chirstopher Betz, \"The Diamond Model of Intrusion Analysis\", Active Response. Available at http://www.activeresponse.org/wp- content/uploads/2013/07/diamond.pdf\n\nAPT Notes. Threatminter, Online Resource accessible atThreatminter, \"APT Notes\", Online Resource accessible at https://libraries.io/github/threatminer/APTnotes\n\nRecorded Future. Chinese MSS Behind APT. 3Online Resource accessible atRecorded Future, \"Chinese MSS Behind APT 3\", Online Resource accessible at https://www.recordedfuture.com/chinese-mss-behind-apt3/.\n\nThe Ten Commandments of Intrusion Analysis. Chris Sanders, Online Resource accessible atChris Sanders, \"The Ten Commandments of Intrusion Analysis\", Online Resource accessible at https://chrissanders.org/2011/01/the-10- commandments-of-intrusion-analysis/, January 2011\n", "annotations": {"author": "[{\"start\":\"160\",\"end\":\"396\"},{\"start\":\"397\",\"end\":\"633\"}]", "publisher": null, "author_last_name": "[{\"start\":\"171\",\"end\":\"177\"},{\"start\":\"407\",\"end\":\"414\"}]", "author_first_name": "[{\"start\":\"160\",\"end\":\"162\"},{\"start\":\"163\",\"end\":\"170\"},{\"start\":\"399\",\"end\":\"406\"}]", "author_affiliation": "[{\"start\":\"208\",\"end\":\"395\"},{\"start\":\"445\",\"end\":\"632\"}]", "title": "[{\"start\":\"1\",\"end\":\"157\"},{\"start\":\"634\",\"end\":\"790\"}]", "venue": null, "abstract": "[{\"start\":\"881\",\"end\":\"2728\"}]", "bib_ref": "[{\"start\":\"2960\",\"end\":\"2963\",\"attributes\":{\"ref_id\":\"b0\"}},{\"start\":\"3680\",\"end\":\"3683\",\"attributes\":{\"ref_id\":\"b1\"}},{\"start\":\"3776\",\"end\":\"3779\",\"attributes\":{\"ref_id\":\"b2\"}},{\"start\":\"5648\",\"end\":\"5651\",\"attributes\":{\"ref_id\":\"b3\"}},{\"start\":\"7207\",\"end\":\"7210\",\"attributes\":{\"ref_id\":\"b4\"}},{\"start\":\"17424\",\"end\":\"17427\",\"attributes\":{\"ref_id\":\"b5\"}},{\"start\":\"17501\",\"end\":\"17504\",\"attributes\":{\"ref_id\":\"b6\"}},{\"start\":\"19865\",\"end\":\"19868\",\"attributes\":{\"ref_id\":\"b7\"}},{\"start\":\"24173\",\"end\":\"24177\",\"attributes\":{\"ref_id\":\"b9\"}},{\"start\":\"24947\",\"end\":\"24950\",\"attributes\":{\"ref_id\":\"b8\"}}]", "figure": "[{\"start\":\"24782\",\"end\":\"24852\",\"attributes\":{\"id\":\"fig_0\"}},{\"start\":\"24853\",\"end\":\"24905\",\"attributes\":{\"id\":\"fig_1\"}},{\"start\":\"24906\",\"end\":\"24951\",\"attributes\":{\"id\":\"fig_2\"}},{\"start\":\"24952\",\"end\":\"25577\",\"attributes\":{\"id\":\"tab_0\",\"type\":\"table\"}}]", "paragraph": "[{\"start\":\"2744\",\"end\":\"3579\"},{\"start\":\"3581\",\"end\":\"3752\"},{\"start\":\"3754\",\"end\":\"5697\"},{\"start\":\"5728\",\"end\":\"7009\"},{\"start\":\"7029\",\"end\":\"7346\"},{\"start\":\"7348\",\"end\":\"7770\"},{\"start\":\"7772\",\"end\":\"8077\"},{\"start\":\"8106\",\"end\":\"9138\"},{\"start\":\"9194\",\"end\":\"9735\"},{\"start\":\"9737\",\"end\":\"9902\"},{\"start\":\"9934\",\"end\":\"10209\"},{\"start\":\"10211\",\"end\":\"10484\"},{\"start\":\"10529\",\"end\":\"11298\"},{\"start\":\"11300\",\"end\":\"11640\"},{\"start\":\"11642\",\"end\":\"12790\"},{\"start\":\"12792\",\"end\":\"13256\"},{\"start\":\"13258\",\"end\":\"13739\"},{\"start\":\"13789\",\"end\":\"14530\"},{\"start\":\"14532\",\"end\":\"15741\"},{\"start\":\"15786\",\"end\":\"16381\"},{\"start\":\"16383\",\"end\":\"17064\"},{\"start\":\"17179\",\"end\":\"17741\"},{\"start\":\"17743\",\"end\":\"18187\"},{\"start\":\"18189\",\"end\":\"18494\"},{\"start\":\"18500\",\"end\":\"18740\"},{\"start\":\"18742\",\"end\":\"18932\"},{\"start\":\"18934\",\"end\":\"19079\"},{\"start\":\"19081\",\"end\":\"19232\"},{\"start\":\"19234\",\"end\":\"19611\"},{\"start\":\"19613\",\"end\":\"20461\"},{\"start\":\"20463\",\"end\":\"20762\"},{\"start\":\"20764\",\"end\":\"21121\"},{\"start\":\"21123\",\"end\":\"21234\"},{\"start\":\"21236\",\"end\":\"21514\"},{\"start\":\"21516\",\"end\":\"21670\"},{\"start\":\"21716\",\"end\":\"21972\"},{\"start\":\"21974\",\"end\":\"22501\"},{\"start\":\"22503\",\"end\":\"22690\"},{\"start\":\"22692\",\"end\":\"22979\"},{\"start\":\"22998\",\"end\":\"23845\"},{\"start\":\"23865\",\"end\":\"24781\"}]", "formula": null, "table_ref": null, "section_header": "[{\"start\":\"2730\",\"end\":\"2742\"},{\"start\":\"5700\",\"end\":\"5726\"},{\"start\":\"7012\",\"end\":\"7027\"},{\"start\":\"8080\",\"end\":\"8104\"},{\"start\":\"9141\",\"end\":\"9192\"},{\"start\":\"9905\",\"end\":\"9932\"},{\"start\":\"10487\",\"end\":\"10527\"},{\"start\":\"13742\",\"end\":\"13787\"},{\"start\":\"15744\",\"end\":\"15784\"},{\"start\":\"17067\",\"end\":\"17110\"},{\"start\":\"17113\",\"end\":\"17156\"},{\"start\":\"17159\",\"end\":\"17177\"},{\"start\":\"18497\",\"end\":\"18498\"},{\"start\":\"21673\",\"end\":\"21714\"},{\"start\":\"22982\",\"end\":\"22996\"},{\"start\":\"23848\",\"end\":\"23863\"},{\"start\":\"24783\",\"end\":\"24793\"},{\"start\":\"24854\",\"end\":\"24864\"},{\"start\":\"24907\",\"end\":\"24917\"}]", "table": null, "figure_caption": "[{\"start\":\"24795\",\"end\":\"24852\"},{\"start\":\"24866\",\"end\":\"24905\"},{\"start\":\"24919\",\"end\":\"24951\"},{\"start\":\"24954\",\"end\":\"25577\"}]", "figure_ref": "[{\"start\":\"4745\",\"end\":\"4754\",\"attributes\":{\"ref_id\":\"fig_0\"}},{\"start\":\"8407\",\"end\":\"8415\",\"attributes\":{\"ref_id\":\"fig_1\"}},{\"start\":\"9725\",\"end\":\"9733\"},{\"start\":\"16571\",\"end\":\"16579\"}]", "bib_author_first_name": "[{\"start\":\"25639\",\"end\":\"25645\"},{\"start\":\"26396\",\"end\":\"26397\"},{\"start\":\"26405\",\"end\":\"26406\"},{\"start\":\"26418\",\"end\":\"26419\"},{\"start\":\"26428\",\"end\":\"26429\"},{\"start\":\"26439\",\"end\":\"26440\"},{\"start\":\"26453\",\"end\":\"26454\"},{\"start\":\"26955\",\"end\":\"26961\"},{\"start\":\"26975\",\"end\":\"26981\"},{\"start\":\"26994\",\"end\":\"27005\"},{\"start\":\"27651\",\"end\":\"27656\"}]", "bib_author_last_name": "[{\"start\":\"25646\",\"end\":\"25656\"},{\"start\":\"25929\",\"end\":\"25936\"},{\"start\":\"26398\",\"end\":\"26403\"},{\"start\":\"26407\",\"end\":\"26416\"},{\"start\":\"26420\",\"end\":\"26426\"},{\"start\":\"26430\",\"end\":\"26437\"},{\"start\":\"26441\",\"end\":\"26451\"},{\"start\":\"26455\",\"end\":\"26461\"},{\"start\":\"26744\",\"end\":\"26750\"},{\"start\":\"26962\",\"end\":\"26973\"},{\"start\":\"26982\",\"end\":\"26992\"},{\"start\":\"27006\",\"end\":\"27010\"},{\"start\":\"27253\",\"end\":\"27265\"},{\"start\":\"27657\",\"end\":\"27664\"}]", "bib_entry": "[{\"start\":\"25579\",\"end\":\"25878\",\"attributes\":{\"id\":\"b0\"}},{\"start\":\"25880\",\"end\":\"26096\",\"attributes\":{\"id\":\"b1\"}},{\"start\":\"26098\",\"end\":\"26236\",\"attributes\":{\"id\":\"b2\"}},{\"start\":\"26238\",\"end\":\"26357\",\"attributes\":{\"id\":\"b3\"}},{\"start\":\"26359\",\"end\":\"26707\",\"attributes\":{\"id\":\"b4\"}},{\"start\":\"26709\",\"end\":\"26912\",\"attributes\":{\"id\":\"b5\"}},{\"start\":\"26914\",\"end\":\"27240\",\"attributes\":{\"id\":\"b6\"}},{\"start\":\"27242\",\"end\":\"27401\",\"attributes\":{\"id\":\"b7\"}},{\"start\":\"27403\",\"end\":\"27605\",\"attributes\":{\"id\":\"b8\"}},{\"start\":\"27607\",\"end\":\"27876\",\"attributes\":{\"id\":\"b9\"}}]", "bib_title": "[{\"start\":\"25579\",\"end\":\"25637\"},{\"start\":\"27403\",\"end\":\"27418\"}]", "bib_author": "[{\"start\":\"25639\",\"end\":\"25658\"},{\"start\":\"25929\",\"end\":\"25938\"},{\"start\":\"26396\",\"end\":\"26405\"},{\"start\":\"26405\",\"end\":\"26418\"},{\"start\":\"26418\",\"end\":\"26428\"},{\"start\":\"26428\",\"end\":\"26439\"},{\"start\":\"26439\",\"end\":\"26453\"},{\"start\":\"26453\",\"end\":\"26463\"},{\"start\":\"26744\",\"end\":\"26752\"},{\"start\":\"26955\",\"end\":\"26975\"},{\"start\":\"26975\",\"end\":\"26994\"},{\"start\":\"26994\",\"end\":\"27012\"},{\"start\":\"27253\",\"end\":\"27267\"},{\"start\":\"27651\",\"end\":\"27666\"}]", "bib_venue": "[{\"start\":\"25658\",\"end\":\"25691\"},{\"start\":\"25880\",\"end\":\"25927\"},{\"start\":\"26100\",\"end\":\"26130\"},{\"start\":\"26238\",\"end\":\"26274\"},{\"start\":\"26359\",\"end\":\"26394\"},{\"start\":\"26709\",\"end\":\"26742\"},{\"start\":\"26914\",\"end\":\"26953\"},{\"start\":\"27242\",\"end\":\"27251\"},{\"start\":\"27420\",\"end\":\"27442\"},{\"start\":\"27607\",\"end\":\"27649\"}]"}}}, "year": 2023, "month": 12, "day": 17}