{"id": 216496153, "updated": "2022-01-20 02:31:24.553", "metadata": {"title": "Locational Detection of the False Data Injection Attack in a Smart Grid: A Multilabel Classification Approach", "authors": "[{\"middle\":[],\"last\":\"Wang\",\"first\":\"Shuoyao\"},{\"middle\":[],\"last\":\"Bi\",\"first\":\"Suzhi\"},{\"middle\":[\"Angela\"],\"last\":\"Zhang\",\"first\":\"Ying-Jun\"}]", "venue": "IEEE Internet of Things Journal", "journal": "IEEE Internet of Things Journal", "publication_date": {"year": 2020, "month": null, "day": null}, "abstract": "State estimation is critical to the monitoring and control of smart grids. Recently, the false data injection attack (FDIA) is emerging as a severe threat to state estimation. Conventional FDIA detection approaches are limited by their strong statistical knowledge assumptions, complexity, and hardware cost. Moreover, most of the current FDIA detection approaches focus on detecting the presence of FDIA, while the important information of the exact injection locations is not attainable. Inspired by the recent advances in deep learning, we propose a deep-learning-based locational detection architecture (DLLD) to detect the exact locations of FDIA in real time. The DLLD architecture concatenates a convolutional neural network (CNN) with a standard bad data detector (BDD). The BDD is used to remove the low-quality data. The followed CNN, as a multilabel classifier, is employed to capture the inconsistency and co-occurrence dependency in the power flow measurements due to the potential attacks. The proposed DLLD is “model-free” in the sense that it does not leverage any prior statistical assumptions. It is also “cost-friendly” in the sense that it does not alter the current BDD system and the runtime of the detection process is only hundreds of microseconds on a household computer. Through extensive experiments in the IEEE bus systems, we show that DLLD can perform locational detection precisely under various noise and attack conditions. In addition, we also demonstrate that the employed multilabel classification approach effectively enhances the presence-detection accuracy.", "fields_of_study": "[\"Computer Science\"]", "external_ids": {"arxiv": null, "mag": "3013246316", "acl": null, "pubmed": null, "pubmedcentral": null, "dblp": "journals/iotj/WangBZ20", "doi": "10.1109/jiot.2020.2983911"}}, "content": {"source": {"pdf_hash": "176977b7b09603afc8c9813c8b685d6f2b893c0c", "pdf_src": "IEEE", "pdf_uri": null, "oa_url_match": false, "oa_info": null}, "grobid": {"id": "e5ddfce4e82f756de7de565f541d3c3b4ea580f2", "type": "plain-text", "url": "s3://ai2-s2-pdf-extraction-prod/parse-results/s2orc_worker/176977b7b09603afc8c9813c8b685d6f2b893c0c.txt", "contents": "\nLocational Detection of the False Data Injection Attack in a Smart Grid: A Multilabel Classification Approach\nSEPTEMBER 2020\n\nShuoyao Wang \nSenior Member, IEEESuzhi Bi \nFellow, IEEEYing-Jun Angela Zhang yjzhang@i.e.cuhk.edu.hk. \nShuoyao Wang \nSuzhi Bi \nYing-Jun Angela Zhang \n\nCollege of Electronic and Information Engineering\nDepartment of Information Engineering\nShenzhen University\n518060ShenzhenChina\n\n\nChinese University of Hong Kong\nHong Kong\n\nLocational Detection of the False Data Injection Attack in a Smart Grid: A Multilabel Classification Approach\n\nIEEE INTERNET OF THINGS JOURNAL\n79SEPTEMBER 202010.1109/JIOT.2020.2983911Manuscript received October 8, 2019; revised February 2, 2020 and March 6, 2020; accepted March 22, 2020. Date of publication March 27, 2020; date of current version September 15, 2020.8218 (Corresponding author: Suzhi Bi.)\nState estimation is critical to the monitoring and control of smart grids. Recently, the false data injection attack (FDIA) is emerging as a severe threat to state estimation. Conventional FDIA detection approaches are limited by their strong statistical knowledge assumptions, complexity, and hardware cost. Moreover, most of the current FDIA detection approaches focus on detecting the presence of FDIA, while the important information of the exact injection locations is not attainable. Inspired by the recent advances in deep learning, we propose a deep-learning-based locational detection architecture (DLLD) to detect the exact locations of FDIA in real time. The DLLD architecture concatenates a convolutional neural network (CNN) with a standard bad data detector (BDD). The BDD is used to remove the low-quality data. The followed CNN, as a multilabel classifier, is employed to capture the inconsistency and co-occurrence dependency in the power flow measurements due to the potential attacks. The proposed DLLD is \"model-free\" in the sense that it does not leverage any prior statistical assumptions. It is also \"cost-friendly\" in the sense that it does not alter the current BDD system and the runtime of the detection process is only hundreds of microseconds on a household computer. Through extensive experiments in the IEEE bus systems, we show that DLLD can perform locational detection precisely under various noise and attack conditions. In addition, we also demonstrate that the employed multilabel classification approach effectively enhances the presence-detection accuracy.Index Terms-Convolutional neural network (CNN), false data injection attack (FDIA), multilabel classification, power system, security, state estimation.\n\nI. INTRODUCTION\n\nA. Motivations and Summary of Contributions T HE POWER system is a fundamental economic-social infrastructure. The recent trends of Industrial Internetof-Things (IIoT) technology have profoundly transformed the conventional power system in the last decades. In particular, the latest advances in smart grids extensively integrate the advanced information and communication technology (ICT) [1] with the conventional power system, which significantly increase the grid efficiency and reliability. However, the new ICT systems employed by smart grids as well as other IIoT networks are facing great security challenges especially under the mounting threats of cyberattacks. State estimation, which calculates the state of the power network system from the raw measurements gathered by the supervisory control and data acquisition (SCADA) system [2], plays a very essential role in the control center. In particular, compromised system state estimation may interfere the operation of power systems, since many power system applications (such as economic dispatch, contingency analysis, etc.) rely on the results of state estimation [3]. Liang et al. [4] and Deng et al. [5] presented comprehensive surveys on the impacts of cyberattacks on state estimation, e.g., line congestion [6], power outage [7], communication block [8], etc.\n\nAmong the existing cyberattacks, the false data injection attack (FDIA) [9] is targeted at compromising power system state estimation by injecting false data into meter measurements. A well-structured FDIA can circumvent the conventional bad data detector (BDD) in today's SCADA system, and thus is recognized as one of the most challenging threats to state estimation. For example, the work in [6] demonstrated the economical effect of false data injection by causing transmission line congestion. Various research has been developed to investigate possible ways of constructing FDIA [5]. For instance, a stealthy attack was introduced in [9], which shows how this type of false data can pass the BDD in the control center. It is shown in [10] that an undetectable attack is also possible even if the attacker has partial configuration information of the power network, and can only manipulate a small set of the power network measurements.\n\nAt the same time, much research effort has been devoted to defending against FDIA, which is broadly classified into two categories, namely, physical-based defending strategies [10]- [12] and data-dependent detection algorithms [13]- [23]. For example, Yang et al. [11] computed the minimum number of sensors that must be compromised to manipulate and developed an effective algorithm for optimal PMU placement to defend against FDIA. Gai et al. [12] introduced dynamic programming to produce an optimal solution of maximizing privacy protection levels for resourceconstrained devices. Alternatively, various data-dependent algorithms have been proposed to investigate the FDIA detection problem, e.g., mixture Gaussian distribution methods [13], maximum-likelihood estimation [14], Kalman filters [15], sparse optimization [16], network theory [17], and similarity matching [18]. For instance, Ashok et al. [18] leveraged load forecast information, generation schedules, and synchrophasor data to obtain a statistical characterization of the variation between SCADA-based state estimates and forecast-based predictions to detect anomalies. However, the effectiveness of most of the existing work highly depends on the knowledge of the attack model and power system information (e.g., the assumption of the near chordal sparsity of the power grids). Recently, data-driven detection methods based on deep learning have been proposed. Instead of deriving an algorithm from a predefined attack and power system model, deep learning methods allow the system to learn the models directly from training data. A summary of recent work is provided in Section I-B. However, to the best of our knowledge, all the existing methods only focus on detecting the presence of attacks, i.e., whether there exists a malicious attack. In practice, other than presence detection, it is essential to identify the location of the attack for the fast deployment of effective countermeasures. In addition, the inconsistency and co-occurrence dependency captured by location identification provides additional room for enhancing the presence-detection performance.\n\nTo bridge the gap, in this article, we consider a deeplearning-based mechanism to achieve the locational detection of FDIA. In particular, we formulate the FDIA locational detection problem as a multilabel classification problem. To solve this problem, we propose an architecture that concatenates a convolutional neural network (CNN) with a standard BDD detector. The standard BDD detector is used to remove the low-quality data. The followed CNN, as a multilabel classifier, is employed to capture the inconsistency and cooccurrence dependency introduced by FDIA. The architecture is practical in the sense that it is model-free and requires no alternation of the current BDD system. Moreover, the runtime of the detection process is only hundreds of microseconds on a household computer. In summary, our main contributions are detailed as follows.\n\n1) To the best of our knowledge, this article is among the first to develop a deep-learning-based locational detection mechanism of FDIA in the power system. In particular, the proposed algorithm, referred to as DLLD, concatenates a deep neural network with a standard BDD detector. With updated network parameters, the DLLD architecture can adapt to the variation of the underlying attack and topology models. 2) To extract power flow correlation features and improve the locational detection performance, we formulate the FDIA locational detection problem as a multilabel classification problem and employ CNN as the classifier. We carefully design the network structure (e.g., render up pooling layers) and loss function according to the unique structures of the FDIA locational detection problem. 3) We carry out extensive evaluations to verify and analyze the proposed framework with open-source data and code. The parameter sensitivity test is also performed to evaluate the performance and generalization ability of the proposed mechanism. By the way of illustration, results in the IEEE 118-bus system show that the proposed DLLD on average achieves 93.18% locational detection accuracy and 99.1% presence-detection accuracy.\n\nOverall, we conclude that DLLD is a scalable robust mechanism with high accuracy.\n\n\nB. Related Work\n\nThere have been some existing FDIA detection methods using machine learning technologies. For instance, Ganjkhani et al. [19] used a nonlinear autoregressive exogenous network to identify the injected bad data in state estimation and generate FDIAs, where less than 10% of the generated FDIAs are detected by conventional processors. Ozay et al. [20] proposed semisupervised and online learning algorithms to detect FDIA. The algorithms can be employed in hierarchical and topological networks for different attack scenarios. Both supervised and unsupervised learning methods were proposed in [21] to distinguish the stealthy FDIA and safe operation modes. He et al. [22] used the conditional deep belief network (CDBN) to reveal the high-dimensional temporal behavior features of the stealthy FDIAs, and successfully detected 90% of the FDIAs. Most recently, Yu et al. [23] employed a discrete wavelet transform to reveal the spatial data characteristics and deep neural network to capture the temporal data correlations for FDIA detection. Therein, the detection accuracy is improved from around 70% by Kalman filters [15] to more than 90%. Overall, all the existing works focused only on detecting the presence of the attack. In contrast, the FDIA locational detection considered in this article shares some similarities with the multilabel classification problem in image processing and speech recognition [24], [25].\n\nKrizhevsky et al. [26] proposed a deep CNN for image classification, consisting of convolutional layers, pooling layers, and fully connected layers. A variant of this model won the ILSVRC-2012 competition, and CNNs have received skyrocketed interest in both academia and industry since then. More recently, CNNs have played a crucial role in AlphaGo [27] which beats the best human player in Go games. One main advantage of utilizing a CNN for image multilabel classification is that the semantic structure of multilabel images can be better preserved [24]. In this article, we intend to capture the inconsistency and co-occurrence dependency on multiple measurements introduced by FDIA, which has a similar flavor of semantic structures in multilabel images classifications. We, therefore, apply CNN as the core module for locational detection of FDIA in this article.\n\nThe remainder of this article is organized as follows. We briefly introduce the conventional state estimation method and its vulnerability against FDIA in Section II. In Section III, we illustrate the architecture and implementation issues on the proposed FDIA locational detection mechanism. The simulation results with parameter sensitivity are presented in Section IV. Finally, this article is concluded in Section V.\n\n\nII. PRELIMINARY\n\n\nA. Power System State Estimation\n\nState estimation is to infer the operational state of a power system from the available meter measurements in an SCADA system. In this article, we focus on the state estimation in dc microgrids, which are widely deployed due to the advantages over their ac counterparts, including higher reliability, simpler control, and more efficient interfacing with renewable energy sources and energy storage units [28]. In a dc model, the relationship between the n-dimensional measurement z = (z 1 , z 2 , . . . , z n ) T and the m-dimensional system state\nx = (x 1 , x 2 , . . . , x m ) T can be expressed as z = Hx + e(1)\nwhere e = (e 1 , e 2 , . . . , e n ) T and H denote the measurement noise and Jacobian matrix, respectively. The conventional BDD approaches compare the 2 -norm of the measurement residual with a threshold τ to check whether there exists a low quality, i.e., bad or compromised, measurements [9]. In this case, the detector announces the presence of an attack as long as\nR = z − Hx 2 2 ≥ τ.(2)\n\nB. False Data Injection Attack\n\nThe objective of FDIA is to mislead the system operator into considering a compromised state estimatex = x + c as a valid estimation, where c = 0 is the deviation of the power system state. To achieve this, an attacker changes the received measurements at the control center toẑ = z + a, where a = (a 1 , a 2 , . . . , a n ) T is the compromised attack vector. Then, the observation model can be described aŝ\nz = Hx + e + a.(3)\nIn general, an unstructured a is likely to be identified by the traditional BDD in (2). To circumvent the BDD mechanism, the attack vector should be structured, such as a = Hc. In such cases, the 2 -norm of the residual is unchanged\nẑ − Hx = z + a − H(x + c) = z − Hx(4)\nand thus the attack can bypass the BDD. Accordingly, the power system operator would mistake x + c for a valid estimate, and thus an error vector c is introduced.\n\nIn reality, getting access to all information of H comes at an unbearable cost and effort for attackers because the information is kept confidential and highly secured. In practice, constructing a successful stealthy FDIA may only require compromising a small number of meters [10], [29], even with partial knowledge of system parameters. For instance, Bi and Zhang [10] proved that an optimal stealthy attack that minimizes the attackers' resource cost can be constructed efficiently through solving a min-cut problem, when the attacker only has limited knowledge of H.\n\nIn this article, we develop a new data-driven mechanism that can detect the location of FDIA in a SCADA system. It is formulated as a multilabel classification problem that determines whether each meter measurement is compromised. The problem is formulated and solved in Section III.\n\n\nIII. LOCATIONAL DETECTION: MULTILABEL CLASSIFICATION APPROACH\n\nIn this article, we propose a multilabel classification mechanism using the recent advances in deep learning technologies to capture the inconsistency and co-occurrence dependency caused by FDIA. In this section, we first elaborate on the structure of the proposed mechanism. Then, we present the detailed implementation of the mechanism.\n\n\nA. Locational Detection\n\nMathematically, to detect the existence of FDIA is equivalent to classifying the whole measurement vector, i.e., x, into two categories: 1) exist or 2) not. This is a singlelabel classification problem from the perspective of machine learning, whereas to identify the location of the attack is equivalent to classifying each element of the measurement vector, i.e., x i , into two categories. That is, the locational detection problem is a multilabel classification problem from the perspective of machine learning. Although deep learning technologies have achieved great success in single-label classification over the past decade, multilabel classification is still attracting much research interest due to its complexity and wide applicability. Unlike single-label classification, multilabel classification problems can be evaluated with a multitude of quality measures, often conflicting in nature. Besides, the labels of multilabel classification problems are usually extremely unbalanced, and thus the single-label balance methods (e.g., downsampling) do not work. To address the problem, we carefully design the CNN structure in Fig. 2 to extract and describe the associated data information to produce satisfactory performances in multilabel classification. In addition, we will also evaluate the improvements over the original single-label methods in our numerical experiments. \n\n\nB. Proposed Mechanism\n\nThe proposed FDIA locational detection mechanism is depicted in Fig. 1. The proposed framework receives measurements from consecutive discrete sampling time instances, i.e., the time instances when the conventional state estimation takes place. 1 This, together with the fact that the training process of the CNN classifier only requires measurements and groundtruth labels and confirms that the proposed mechanism does not leverage any prior statistical assumptions (e.g., H). At a sampling time instance t, the input data (the real-time measurement) first goes through the BDD detector. As described in (2), BDD evaluates the quality of the measurement data by calculating the 2 -norm of the measurement residual and comparing with a predetermined threshold τ . BDD reports the current meter as compromised or noisy if R ≥ τ . 2 By doing so, the sampling and communication errors as well as potential unstructured FDIA can be effectively detected, because of their high residual values [5]. If the measurement data pass the BDD, a CNN-based multilabel classifier will detect the presence and location of structured FDIAs by analyzing the inconsistency and co-occurrence dependency of the data.\n\nThe proposed DLLD scheme employs a CNN to extract and analyze the high-dimensional temporal features of FDIA.\n\n1) Data: We denote the input (i.e., the measurements), the ground-truth labels (i.e., the meter classes), and the output (i.e., the classification of the CNN at time t)\nas z t = (z t 1 , . . . , z t n ), y t = (y t 1 , . . . , y t n ), andŷ t = (ŷ t 1 , . . . ,ŷ t n ),\nrespectively. For example, in our numerical experiments in Section IV, the dimensions of input and output data are both 19 for the IEEE 14-bus system, because there are 19 measurements inside the 14-bus system in our simulation settings. The ground-truth label of meter i at time t is determined according to the following rule:\ny t i = 1, the meter i at time t is compromised 0, otherwise.(5)\nThe output of CNNŷ t n 's is continuous numbers between 0 and 1. Correspondingly, the classifier defines a discrimination threshold to quantify the outputs to 0 or 1. The discrimination threshold can be adjusted to increase or decrease 1 The sample rates range from 100 Hz (burst mode recording) to hourly readings for SCADA systems [30]. 2 Following the common practice [22], the selection of the value of the threshold τ is numerically studied and selected as 10 in this article. the sensitivity to application factors. Unless specified otherwise, the discrimination threshold is set to 0.5 in this article following the common practice.\n\n2) Architecture: The architecture of the deep CNN for FDIA locational detection is shown in Fig. 2. It contains an input layer, several convolutional layers, one flattening layer, one fully connected hidden layer, and an output layer. The input layer has n input numbers representing the n measurements at each time instance. Each filter in the first convolutional layer is applied to the windows in the input layer to generate features through the convolution operation, batch normalization, and nonlinear transformation with the rectifiedlinear unit (ReLU) activation function [31]. The feature maps c 1,j of the first convolutional layer generated from the input data z, which can be expressed as\nc 1,j = ReLU z * h 1,j + b 1,j .(6)\nHere, h 1,j is the jth convolution kernel, which is essentially a 1-D filter, 3 and b 1,j is the corresponding scalar bias. In (6), a scalar bias b 1,j is added to all the convolution output, which is a commonly used representation in deep learning [31]. The convolution operation is denoted by * in (6) and the output at position i is defined as\nl 1,j k=1 h 1,j [i] × (z) i − k + l 1,j 2 .(7)\nHere, l 1,j and × denote the length of the filter h 1,j and the inner product operation, respectively. The hidden features generated by filters in the (q − 1)th convolutional layer are then used as the input to the qth convolutional layer and processed in a similar way. The output can be written as\nc q,j = ReLU c q−1 * h q,j + b q,j(8)\nwhere c q,j is the jth feature map at the qth convolutional layer.\n\nThe number of filters in each layer and depth of convolutional layers are hyperparameters, which will be further discussed in the simulation section. The extracted features learned by the last convolutional layer, i.e., the q max th convolutional layer, are merged into one single vector in the flatten layer and fed into \nc F,j = ReLU w F × c q max + b F(9)\nwhere c F,j , w F , and b F denote the feature maps, weights, and biases of the flatten layer, respectively. The nodes in the dense layer are also fully connected to n nodes in the output layer. The sigmoid function is applied to the nodes in the output layer to classify the type of each measurement. For meter j at time t, the final multilabel classification resultŷ t j iŝ\ny t j = sigmoid(w D × c F + b D )(10)\nwhere w D and b D denote the weights and biases of the dense layer, respectively. Overall, we plot Table I to show an example of the DLLD network for the IEEE 14-bus system.\n\nRemark 1: Besides the convolutional layers, pooling and dropout layers are also important components in ordinary CNN architectures. However, they do not appear in our design for the following reasons. First, pooling layers are normally used for the downsampling of high-dimensional computation, e.g., 2-D-convolution and 3-D-convolution computations. In our problem, all the convolutional layers are 1-D-convolutional layers whose computation under GPU programming is quite efficient. Second, traditionally, pooling layers are one of the main factors to achieve nonlinear mapping in deep CNN. However, the popular ReLU active function also introduces nonlinearity in deep models. Therefore, rendering up pooling layers sometimes achieves even a better performance, because useful details may be discarded by pooling layers [32]. Third, dropout is a widely used technique to control overfitting. Meanwhile, the proposed DLLD already has employed the mini-batch methodology for overfitting control, which intentionally introduces sufficient noise to each gradient update. Indeed, we have tested the performance of pooling and dropout, and found that they do not provide any performance gain.\n\n\nC. Training\n\nBefore using the proposed FDIA locational detection scheme to classify the measurements, we need to first optimize the learning parameters, i.e., the filters h, weights w, and biases b, in each layer. This parameter tunning process is called training, which aims to find the optimal parameters that match the input and output in the training data.\n\n\n1) Mini-Batch and Cross-Validation:\n\nTo enhance the convergence rate and avoid overfitting, we adopt the mini-batch gradient descent method to train the network. In our simulations, each mini-batch contains 200 instances of data. In each iteration, a fixed number of training samples, i.e., a mini-batch, are randomly selected from the training set to calculate the gradient. Following the common practice in machine learning, we separate 7/10 data into the training set and 3/10 data into the validation set for each batch. Then, fitting is done using the Adam optimizer with an initial learning rate of 0.001 and a patience of 5.\n\n2) Loss Function: To find the optimal learning parameter set, we introduce a loss function to measure the difference between the actual output and the ground-truth output among each mini-batch. To extend our framework to multilabel classification, the loss function of the proposed CNN is chosen as the cross-entropy function. In particular, the crossentropy loss function over a mini-batch θ = {t 1 , . . . , t 200 } is expressed as cross-entropy(θ )\n= t∈θ − 1 n n i=1 ŷ t i log y t i + 1 −ŷ t i log 1 − y t i .(11)\nWith clearly defined loss function, we can adopt the Adam [31] optimizer to find the optimal parameters given a mini-batch θ .\n\n\nIV. EXPERIMENTS\n\nIn this section, we first present the training and testing data generation step by step in Section IV-A. In Section IV-B, we introduce the implementation details and benchmark algorithms. Then, we show detailed examples to demonstrate how the proposed method captures the inconsistency and co-occurrence dependency introduced by FDIA on nearby measurements in Section IV-C. The detection accuracy and robustness of locational and presence detection are investigated in Sections IV-C and IV-D, respectively.\n\n\nA. Data Set\n\nIn this section, we assess the performance of the proposed FDIA locational detection mechanism in the IEEE 14-and 118-bus power systems. The topologies of the grid can be obtained from MATPOWER [33] and summarized in Table II. The measurements of meters located at adjacent lines or buses are highly correlated. Besides, CNN obtains the features by analyzing the meter measurements of adjacent indices. Therefore, we index the meter measurements based on the network topology. In this article, we first index the line flow meters from q = 1 as follows: 1) we index the unindexed meters connecting bus q and set q = q + 1 and 2) if q > 14(118), we terminate the index process; otherwise, the policy turns back to 1). Then, we continue the index from line meters and label the injection meters based on the ascending order of the bus index. For illustration purpose, an indexed measurement placement of the IEEE 14-bus system is plotted in Fig. 3. The measurement placement and indices for the 118-bus system are omitted for the simplicity of expositions. The complete source code implementing DLLD and data sets is available at https://github.com/wsyCUHK/WSYCUHK_ FDIA.\n\n1) Base Load: We first generate uncompromised data by extending the real-world data through artificially generating the loads on each bus. The generated loads follow a normal distribution whose mean is equal to the baseload and standard variance is equal to 1/6 of the value of base load [14], [34]. Besides, we also generate compromised data. As mentioned in Section I, there are two categories of FDIAs, namely, well-structured FDIA and unstructured FDIA. Unstructured FDIAs can be precluded by the conventional BDD process inside our DLLD framework. The system will consider them as faulty measurements and discard them directly. Hence, we only generate well-structured FDIA.\n\n2) Attack Implementation: Due to the limited budgets of attackers, we generate the compromised data based on the mincut FDIA model with partial network knowledge in [10]. More specifically, the optimal partial knowledge attack is the one who requires the minimum cost of obtaining the knowledge of a particular transmission line impedance. Without loss of generality, the system parameters are generated as follows.\n\n1) The number of target state variables follows a discrete uniform (2, 5) distribution in the 14-bus system and a discrete uniform (2, 10) distribution in the 118-bus system, respectively.\n\n2) The cost of obtaining the knowledge of a particular transmission line impedance is set in the same way as in [10]. The 2 -norm of the injection data varies from 1 to 5 in Fig. 5 and is set as 1 in all other experiments.\n\n3) Measurement Noise: Last but not least, noticing that there exists an inevitable dynamic noise in measurement and communication processes, we also append random Gaussian noises to the measurement values. In particular, the noise standard derivation varies from 0.1 to 0.5 in Fig. 5 and is set as 0.2 in all other experiments.\n\n\n4) Training and Testing Data Set:\n\nUnder each level of attack and noise, we generate a training set that contains 10 000 compromised instances and 100 000 instances without any injection. We generate another ten independent testing data sets that contain 500 compromised time instances and 500 instances without any injection for performance evaluation. Each value presented in this section is averaged over ten independent testing sets. The detailed generation process and data sets are available at https://github.com/wsyCUHK/WSYCUHK_FDIA.\n\n\nB. Implementation Details\n\nAll simulations are conducted on a machine with an Intel Xeon E5-2630 CPU, two nVidia GTX 1080 GPUs, and 64-GB RAM. The multilayer perceptron network (MLP) and CNN are constructed using Keras [35] for a computational speed boost. For benchmark methods, we compare the proposed scheme with the state-of-the-art methods, including support vector machine (SVM), light gradient boosting machine (LightGBM), and deep-learning-based identification (DLBI) [22]. 4 1) DLBI: He et al. [22] proposed a CDBN architecture to extract high-dimensional temporal features. The CDBN detects the FDIA by analyzing the temporal attack patterns that are presented by the real-time measurement data from the geographically distributed meters. 2) SVM: SVM [36] is a maximum margin classifier that constructs a hyperplane(s) in a high-dimensional space. It is widely used since it achieved top performance in some classification problems (e.g., text spam and images) in the 1990s. 3) LightGBM: LightGBM [37] is a gradient boosting framework that uses tree-based learning algorithms published by Microsoft. LightGBM is being widely used in many winning solutions of machine learning competitions. Hyperparameter (e.g., the number of convolutional layers and the number of filters) tuning is done using a random search strategy, where we select the model that assigns the highest F 1 -Score (defined in Section IV-C) to the validation data.\n\n\nC. Locational Detection Performance\n\n\n1) Performance Evaluation Metrics:\n\nIn our experiments, we employ the precision and recall of the generated outputs as performance evaluation metrics. The precision and recall are defined as precision = True Positive Rate True Positive Rate + False-Positive Rate (12) and recall = True Positive Rate True Positive Rate + False-Negative Rate (13) respectively. In this article, true positive rate (TPR), falsepositive rate (FPR), and false-negative rate (FNR) are defined as the probability that a compromised location is labeled as compromised, an uncompromised location is labeled as compromised, and an uncompromised location is labeled as uncompromised, respectively. To strike a balance between the precision and recall, we also strike the F 1 -score. In particular, F 1 -score is the geometrical average of the precision and recall, and is expressed as\nF 1 -Score = 2 × Precision × Recall Precision + Recall .(14)\nMoreover, we introduce row accuracy (RACC) as an evaluation metric. RACC is defined as the probability that all the uncompromised locations in the grid are labeled as uncompromised and all the compromised locations are labeled as compromised.\n\nWe first evaluate the proposed method when the 2 -norm of the injection data is 2 and the standard deviation of the measurement noise is 0.2. We compare the proposed mechanism not only with the state-of-the-art methods: SVM and LightGBM but also with an alternative of the proposed mechanism, where the CNNs in our location and detection mechanism is replaced by the MLPs. Accordingly, the proposed mechanism and the MLP alternative are named as DLLD and MLP-DLLD, respectively. In particular, the number of hidden layers in the MLP varies from 2 to 6 and the number of units is selected with the highest F 1 -Score. To guarantee a fair comparison, we use the same data sets for the training and testing procedure of all four methods.\n\n2) IEEE 14-Bus System: First, we compare the four metrics among SVM, LightGBM, and MLP-DLLD with a different number of hidden layers, and DLLD with a different number of hidden layers in the IEEE 14-bus system in Table III. Overall, DLLD outperforms the three benchmark algorithms in both F 1 -Score and RACC, which justifies the effectiveness of the proposed mechanism.\n\nFrom Table III, we observe the metrics increase when the number of hidden layers of the MLP increases from 2 to 4. Meanwhile, the metrics decrease slightly when the number of hidden layers of the MLP increases from 4 to 6. This is known as the degradation problem: with the network depth increasing, accuracy gets saturated and then degrades rapidly [32]. On the other hand, we also observe that the metrics increase when the number of hidden layers of CNN increases from 2 to 5 and keeps almost the same when the number of hidden layers of CNN increases from 5 to 6. Overall, the fine-tuned DLLD architecture achieves very high F 1 -Score and RACC. This, together with the fact that the computational complexity also increases with the number of hidden layers and drives  us to design our DLLD architecture with five hidden layers, in order to achieve a good balance between location accuracy and computational complexity.\n\nA point worth noting is that SVM and LightGBM are conventionally proposed for single-label multiclass classification problems. In order to solve the multilabel classification problems using SVM and LightGBM, we convert the multilabel data set to the single-label data set. For example, in the IEEE 14-bus system, the 19 binary labels (y 1 t , y 2 t , . . . , y 19 t ) are converted into one label with a class size of 2 19 . Due to the high co-coherence dependency, after we remove the classes that never happen in the whole data set, such that the class size shrinks from 2 19 to 80. Then, we can employ SVM and LightGBM to classify the converted multiclass problem. As a result, the RACCs achieved by SVM and LightGBM are higher than the ones achieved by MLP-DLLD while the precises and recalls are lower.\n\nWe would like to emphasize that the high accuracy achieved by the proposed CNN structure is due to the fact that our proposed CNN structure can capture the inconsistency and cooccurrence dependency on nearby measurements introduced by FDIA. For example, CNN can capture the co-occurrence of FDIA on the 3rd and 4th measurements as they are directly connected. In Table IV, we show the locational classification results on the 3rd, 4th, and 11th measurements. For example, in the first three rows, we demonstrate the classification accuracy for four attack cases: 1) the 3rd measurement is compromised and the 4th is not; 2) the 4th measurements are compromised and the 3rd is not; 3) both the 3rd and 4th measurements are compromised; and 4) neither the 3rd and 4th measurements are compromised. We observe that the co-occurrence of FDIA on the 3rd and 4th measurements is much larger than the one on the 3rd and 11th measurements and the classification accuracy is also higher than the one on the 3rd and 11th measurements. It is because the 3rd and 4th measurements are directly connected and thus the measurements are highly coupled.\n\n3) IEEE 118-Bus System: The performance comparison in the IEEE 118-bus system is given in Table V. We can observe that the precises and recalls are only about 1%, and the RACCs are always near 50% under MLP-DLLD. This is because when the bus system is large, MLP-DLLD can only detect the presence of the attack but not its location. Moreover, as expected, SVM and LightGBM do not converge in the IEEE 118-bus system after we go through 200 epochs. This is due to the fact that the conversion introduces a huge number of classes, e.g., more than 10 000 in our simulation. In contrast, DLLD still achieves 99.37 F 1 -Score and 93.2% RACC. Hence, we conclude that the proposed DLLD is scalable when the system size becomes large.\n\nAs discussed in Section III-B, the outputs of the CNN y t n 's are continuous within [0, 1], and are quantized to 0 or 1 by a discrimination threshold. In the above figures, we have fixed the discrimination threshold at 0.5. In general, the value of the threshold determines the tradeoff between TPR and FPR. Specifically, a lower threshold results in a higher TPR and a lower FPR. We investigate the tradeoff in Fig. 4, which plots FPR versus TPR when the threshold varies from 0 to 1. To depict relative tradeoffs between TPR and FPR, the area under the ROC (AUC) is commonly considered as a performance metric of the discriminatory capacity [38]. Here, AUC is defined as the area between the FPR, TPR, x-axis, and y-axis. An excellent model has AUC near to 1, which means that it has a good measure of separability. The model predicates 1s as 1s and 0s as 0s. When a model has AUC near to 0, the model predicates 0s as 1s and 1s as 0s [38]. From the figure, we can see the proposed mechanism has AUC near to 1, which represents the excellent discriminatory capacity of the proposed mechanism. 4) Robustness: In Fig. 5, we evaluate the robustness of the proposed mechanism against the aggressiveness of the attacker and the noise in the data acquisition environment. In particular, we evaluate the proposed mechanism as follows.\n\n1) Aggressiveness: We fixed the standard deviation σ to be 0.2, and varied the 2 -norm of the injection from 1 to 5. 2) Noise: We fix the 2 -norm of the injection to be 2, and vary the standard deviation σ from 0.1 to 0.5. Fig. 5 shows that compared with MLP-DLLD, SVM, and LightGBM, DLLD achieves the highest F 1 -Score. From Fig. 5(a), the F 1 -Score of all of the four schemes increases with the 2 -norm of the injection data. This is because that the patterns of the normal data and the compromised data become more distinguishable when the attack is more aggressive. Likewise, from Fig. 5(b), we can see that when the noise level increases, the F 1 -Score of all of the four schemes decreases. This is because that the patterns of the normal data and the compromised data are less distinguishable when the noise power increases. In both subfigures, the proposed DLLD can always achieve F 1 -Score near 100, when the standard deviation varies from 0.1 to 0.5 and the 2 -norm of the injection data varies from 1 to 5. This implies that the proposed high accuracy DLLD mechanism is robust to the environmental noise and the size of attack injection.\n\nWe would like to emphasize that the runtime of the detection process is only about 100 μs, where the sampling rate for SCADA systems is larger than 100 Hz. This, together with the fact that our simulations were run on a machine with an Intel Xeon E5-2630 CPU, two nVidia GTX 1080 GPUs, and 64-GB RAM, indicates that the proposed mechanism is practical and cost-friendly.\n\n\nD. Presence-Detection Performance\n\nWe take one step back and investigate how well the proposed mechanism works in terms of detecting the presence of attacks. In particular, we regard the power system as uncompromised or the attacks are absent ifŷ i t = 0, for all i = 1, . . . , n. Otherwise, the power system is regarded as compromised or the attacks are present. In Fig. 6, we investigate the FDIA presence-detection performance of the proposed mechanism. In particular, we compare the detection accuracy with the two benchmarks: 1) SVM and 2) DLBI. Moreover, since the performance gaps in the IEEE 118-bus system are more distinct than those in the IEEE 14-bus system. We only plot the accuracy in the IEEE 118-bus system for simplicity.\n\nIn Fig. 6(a), we compare the detection accuracy achieved by DLBI, SVM, MLP-DLLD, and DLLD. Overall, compared with DLBI and SVM methods, the proposed detection scheme achieves the highest detection accuracy. Moreover, we can also see that as the noise level increases, the detection accuracy of DLBI and SVM methods decreases, which is similar to the conclusion drawn in Fig. 5(a).\n\nFinally, we investigate the presence-detection accuracy versus the standard deviation of measurement noise in Fig. 6(b). As expected, the proposed scheme achieves the highest detection accuracy. Similar to the conclusion in Fig. 5(b), the detection accuracy of all the four methods increases with the standard deviation of the noise. Before we leave this section, we would like to emphasize that the proposed multilabel classification method, although is targeted at detecting FDIA locations, also improves the presence-detection accuracy. This is because multilabel classification captures the inconsistency and co-occurrence dependency of meter measurements.\n\n\nV. CONCLUSION\n\nIn this article, we have formulated the locational detection problem of FDIA as a multilabel classification problem and designed a BDD-CNN architecture as a multilabel classifier. The standard BDD detector is to estimate the quality of the real-time measurement data and used to remove the lowquality data. The CNN is to capture the inconsistency and co-occurrence dependency introduced by FDIA. The mechanism is model-free in the sense that the architecture does not depend on any assumed attack model, and is cost-friendly in the sense that the architecture is built on the existing BDD that requires no alternation of the current BDD system and the runtime of the detection process is only hundreds of microseconds on a household computer. Moreover, we have carried out extensive simulations in the IEEE 14-and 118-bus power systems to demonstrate the practicability. In particular, we have shown that DLLD can perform locational detection for the whole bus system under various noise and attack conditions. In addition, we also have demonstrated that the presence-detection accuracy can be further improved through multilabel classification formulation, and thus the achieved presence-detection accuracy is better than that of the state-of-the-art benchmarks.\n\nFig. 1 .\n1Proposed FDIA locational detection mechanism.\n\nFig. 2 .\n2Architecture of 1-D deep CNN for DLLD. 1: compromised meter; and 0: uncompromised meter.\n\nFig. 5 .\n5F 1 -Score comparison in the IEEE 14-bus system. (a) Comparison versus the standard deviation of noise. (b) Comparison versus 2 -norm of the injection data.\n\nFig. 6 .\n6Accuracy of stealthy FDIA detection in the IEEE 118-bus system. (a) Accuracy versus 2 -norm of the injection data. (b) Accuracy versus the standard deviation of measurement noise.\n\nTABLE I\nIDEEP-LEARNING-BASED LOCATIONAL DETECTION (DLLD) NETWORK \nFOR THE IEEE 14-BUS SYSTEM. TOTAL PARAMETERS: \n247 827; TRAINABLE PARAMETERS: 246 675; \nAND NONTRAINABLE PARAMETERS: 1152 \n\na fully connected hidden layer (also known as dense layer) \nwith the activation function ReLU. That is \n\n\n\nTABLE II STATISTICS\nIIOF IEEE 14-AND 118-BUS POWER TEST SYSTEMS Fig. 3. Indexed IEEE 14-bus system.\n\nTABLE III PERFORMANCE\nIIICOMPARISON IN THE IEEE 14-BUS SYSTEM\n\nTABLE IV CLASSIFICATION\nIVRESULTS ON THE 3RD, 4TH, AND 11TH MEASUREMENTS\n\nTABLE V PERFORMANCE\nVCOMPARISON IN THE IEEE 118-BUS SYSTEM Fig. 4. ROC curve for the proposed mechanism. TPR rises to 0.99 extremely fast when FPR increases from 0 to 0.0002 and thus we only plot TPR versus FPR from 0 to 0.002.\n1/2/3-D: one/two/three-dimensional.\nThe open-source implementation of SVN and LightGBM can be find in https://github.com/soloice/SVM-python and https://github.com/Microsoft/ LightGBM, respectively.\n\nFusion of cognitive wireless networks and edge computing. K Gai, K Xu, Z Lu, M Qiu, L Zhu, IEEE Wireless Commun. 263K. Gai, K. Xu, Z. Lu, M. Qiu, and L. Zhu, \"Fusion of cognitive wireless networks and edge computing,\" IEEE Wireless Commun., vol. 26, no. 3, pp. 69-75, Jun. 2019.\n\n. M S Thomas, J D Mcdonald, Power System, Scada , Smart Grids, CRC PressHoboken, NJ, USAM. S. Thomas and J. D. McDonald, Power System SCADA and Smart Grids. Hoboken, NJ, USA: CRC Press, 2015.\n\nThe integration of diversely redundant designs, dynamic system models, and state estimation technology to the cyber security of physical systems. B M Horowitz, K M Pierce, Syst. Eng. 164B. M. Horowitz and K. M. Pierce, \"The integration of diversely redun- dant designs, dynamic system models, and state estimation technology to the cyber security of physical systems,\" Syst. Eng., vol. 16, no. 4, pp. 401-412, 2013.\n\nA review of false data injection attacks against modern power systems. G Liang, J Zhao, F Luo, S R Weller, Z Y Dong, IEEE Trans. Smart Grid. 84G. Liang, J. Zhao, F. Luo, S. R. Weller, and Z. Y. Dong, \"A review of false data injection attacks against modern power systems,\" IEEE Trans. Smart Grid, vol. 8, no. 4, pp. 1630-1638, Jul. 2017.\n\nFalse data injection on state estimation in power systems-Attacks, impacts, and defense: A survey. R Deng, G Xiao, R Lu, H Liang, A V Vasilakos, IEEE Trans. Ind. Informat. 132R. Deng, G. Xiao, R. Lu, H. Liang, and A. V. Vasilakos, \"False data injection on state estimation in power systems-Attacks, impacts, and defense: A survey,\" IEEE Trans. Ind. Informat., vol. 13, no. 2, pp. 411-423, Apr. 2017.\n\nIntegrity data attacks in power market operations. L Xie, Y Mo, B Sinopoli, IEEE Trans. Smart Grid. 24L. Xie, Y. Mo, and B. Sinopoli, \"Integrity data attacks in power mar- ket operations,\" IEEE Trans. Smart Grid, vol. 2, no. 4, pp. 659-666, Dec. 2011.\n\nMasking transmission line outages via false data injection attacks. X Liu, Z Li, X Liu, Z Li, IEEE Trans. Inf. Forensics Security. 117X. Liu, Z. Li, X. Liu, and Z. Li, \"Masking transmission line outages via false data injection attacks,\" IEEE Trans. Inf. Forensics Security, vol. 11, no. 7, pp. 1592-1602, Jul. 2016.\n\nSpoofing-jamming attack strategy using optimal power distributions in wireless smart grid networks. K Gai, M Qiu, Z Ming, H Zhao, L Qiu, IEEE Trans. Smart Grid. 85K. Gai, M. Qiu, Z. Ming, H. Zhao, and L. Qiu, \"Spoofing-jamming attack strategy using optimal power distributions in wireless smart grid networks,\" IEEE Trans. Smart Grid, vol. 8, no. 5, pp. 2431-2439, Sep. 2017.\n\nFalse data injection attacks against state estimation in electric power grids. Y Liu, P Ning, M K Reiter, ACM Trans. Inf. Syst. Security. 141Y. Liu, P. Ning, and M. K. Reiter, \"False data injection attacks against state estimation in electric power grids,\" ACM Trans. Inf. Syst. Security, vol. 14, no. 1, pp. 1-33, Jun. 2011.\n\nUsing covert topological information for defense against malicious attacks on DC state estimation. S Bi, Y J Zhang, IEEE J. Sel. Areas Commun. 327S. Bi and Y. J. Zhang, \"Using covert topological information for defense against malicious attacks on DC state estimation,\" IEEE J. Sel. Areas Commun., vol. 32, no. 7, pp. 1471-1485, Jul. 2014.\n\nOn optimal PMU placement-based defense against data integrity attacks in smart grid. Q Yang, D An, R Min, W Yu, X Yang, W Zhao, IEEE Trans. Inf. Forensics Security. 127Q. Yang, D. An, R. Min, W. Yu, X. Yang, and W. Zhao, \"On optimal PMU placement-based defense against data integrity attacks in smart grid,\" IEEE Trans. Inf. Forensics Security, vol. 12, no. 7, pp. 1735-1750, Jul. 2017.\n\nPrivacy-preserving contentoriented wireless communication in Internet-of-Things. K Gai, K.-K R Choo, M Qiu, L Zhu, IEEE Internet Things J. 54K. Gai, K.-K. R. Choo, M. Qiu, and L. Zhu, \"Privacy-preserving content- oriented wireless communication in Internet-of-Things,\" IEEE Internet Things J., vol. 5, no. 4, pp. 3059-3067, Aug. 2018.\n\nDetection of false data injection attacks against state estimation in smart grids based on a mixture Gaussian distribution learning method. S A Foroutan, F R Salmasi, IET Cyber Phys. Syst. Theory Appl. 24S. A. Foroutan and F. R. Salmasi, \"Detection of false data injection attacks against state estimation in smart grids based on a mixture Gaussian distribution learning method,\" IET Cyber Phys. Syst. Theory Appl., vol. 2, no. 4, pp. 161-171, 2017.\n\nA fast, decentralized covariance selection-based approach to detect cyber attacks in smart grids. R Moslemi, A Mesbahi, J M Velni, IEEE Trans. Smart Grid. 95R. Moslemi, A. Mesbahi, and J. M. Velni, \"A fast, decentralized covari- ance selection-based approach to detect cyber attacks in smart grids,\" IEEE Trans. Smart Grid, vol. 9, no. 5, pp. 4930-4941, Sep. 2018.\n\nDetection of faults and attacks including false data injection attack in smart grid using Kalman filter. K Manandhar, X Cao, F Hu, Y Liu, IEEE Trans. Control Netw. Syst. 14K. Manandhar, X. Cao, F. Hu, and Y. Liu, \"Detection of faults and attacks including false data injection attack in smart grid using Kalman filter,\" IEEE Trans. Control Netw. Syst., vol. 1, no. 4, pp. 370-379, Dec. 2014.\n\nDetecting false data injection attacks on power grid by sparse optimization. L Liu, M Esmalifalak, Q Ding, V A Emesih, Z Han, IEEE Trans. Smart Grid. 52L. Liu, M. Esmalifalak, Q. Ding, V. A. Emesih, and Z. Han, \"Detecting false data injection attacks on power grid by sparse optimization,\" IEEE Trans. Smart Grid, vol. 5, no. 2, pp. 612-621, Mar. 2014.\n\nDistributed attack detection and secure estimation of networked cyber-physical systems against false data injection attacks and jamming attacks. Y Guan, X Ge, IEEE Trans. Signal Inf. Process. Netw. 41Y. Guan and X. Ge, \"Distributed attack detection and secure estimation of networked cyber-physical systems against false data injection attacks and jamming attacks,\" IEEE Trans. Signal Inf. Process. Netw., vol. 4, no. 1, pp. 48-59, Mar. 2018.\n\nOnline detection of stealthy false data injection attacks in power system state estimation. A Ashok, M Govindarasu, V Ajjarapu, IEEE Trans. Smart Grid. 93A. Ashok, M. Govindarasu, and V. Ajjarapu, \"Online detection of stealthy false data injection attacks in power system state estimation,\" IEEE Trans. Smart Grid, vol. 9, no. 3, pp. 1636-1646, May 2018.\n\nA novel detection algorithm to identify false data injection attacks on power system state estimation. M Ganjkhani, S Fallah, S Badakhshan, S Shamshirband, K.-W Chau, Energies. 122209M. Ganjkhani, S. Fallah, S. Badakhshan, S. Shamshirband, and K.-W. Chau, \"A novel detection algorithm to identify false data injection attacks on power system state estimation,\" Energies, vol. 12, p. 2209, Jun. 2019.\n\nMachine learning methods for attack detection in the smart grid. M Ozay, I Esnaola, F T Y Vural, S R Kulkarni, H V Poor, IEEE Trans. Neural Netw. Learn. Syst. 278M. Ozay, I. Esnaola, F. T. Y. Vural, S. R. Kulkarni, and H. V. Poor, \"Machine learning methods for attack detection in the smart grid,\" IEEE Trans. Neural Netw. Learn. Syst., vol. 27, no. 8, pp. 1773-1786, Aug. 2016.\n\nDetecting stealthy false data injection using machine learning in smart grid. M Esmalifalak, L Liu, N Nguyen, R Zheng, Z Han, IEEE Syst. J. 113M. Esmalifalak, L. Liu, N. Nguyen, R. Zheng, and Z. Han, \"Detecting stealthy false data injection using machine learning in smart grid,\" IEEE Syst. J., vol. 11, no. 3, pp. 1644-1652, Sep. 2017.\n\nReal-time detection of false data injection attacks in smart grid: A deep learning-based intelligent mechanism. Y He, G J Mendis, J Wei, IEEE Trans. Smart Grid. 85Y. He, G. J. Mendis, and J. Wei, \"Real-time detection of false data injec- tion attacks in smart grid: A deep learning-based intelligent mechanism,\" IEEE Trans. Smart Grid, vol. 8, no. 5, pp. 2505-2516, Sep. 2017.\n\nOnline false data injection attack detection with wavelet transform and deep neural networks. J J Q Yu, Y Hou, V O K Li, IEEE Trans. Ind. Informat. 147J. J. Q. Yu, Y. Hou, and V. O. K. Li, \"Online false data injection attack detection with wavelet transform and deep neural networks,\" IEEE Trans. Ind. Informat., vol. 14, no. 7, pp. 3271-3280, Jul. 2018.\n\nDeep semantic ranking based hashing for multi-label image retrieval. F Zhao, Y Huang, L Wang, T Tan, Proc. CVPR Conf. CVPR ConfF. Zhao, Y. Huang, L. Wang, and T. Tan, \"Deep semantic ranking based hashing for multi-label image retrieval,\" in Proc. CVPR Conf., Jun. 2015, pp. 1556-1564.\n\nConvolutional, long short-term memory, fully connected deep neural networks. T N Sainath, O Vinyals, A W Senior, H Sak, Proc. ICASSP Conf. ICASSP ConfT. N. Sainath, O. Vinyals, A. W. Senior, and H. Sak, \"Convolutional, long short-term memory, fully connected deep neural networks,\" in Proc. ICASSP Conf., Apr. 2015, pp. 4580-4584.\n\nImageNet classification with deep convolutional neural networks. A Krizhevsky, I Sutskever, G E Hinton, Proc. NIPS Conf. NIPS ConfA. Krizhevsky, I. Sutskever, and G. E. Hinton, \"ImageNet classification with deep convolutional neural networks,\" in Proc. NIPS Conf., 2012, pp. 1097-1105.\n\nMastering the game of go with deep neural networks and tree search. D Silver, Nature. 529D. Silver et al., \"Mastering the game of go with deep neural networks and tree search,\" Nature, vol. 529, pp. 484-503, Jan. 2016.\n\nDC microgrids-Part I: A review of control strategies and stabilization techniques. T Dragičević, X Lu, J C Vasquez, J M Guerrero, IEEE Trans. Power Electron. 317T. Dragičević, X. Lu, J. C. Vasquez, and J. M. Guerrero, \"DC microgrids-Part I: A review of control strategies and stabilization techniques,\" IEEE Trans. Power Electron., vol. 31, no. 7, pp. 4876-4891, Jul. 2016.\n\nIdentification of vulnerable node clusters against false data injection attack in an AMI based smart grid. A Anwar, A N Mahmood, Z Tari, Inf. Syst. 53A. Anwar, A. N. Mahmood, and Z. Tari, \"Identification of vulnerable node clusters against false data injection attack in an AMI based smart grid,\" Inf. Syst., vol. 53, pp. 201-212, Oct./Nov. 2015.\n\nSCADA: Supervisory Control and Data Acquisition. S A Boyer, Int. Soc. AutomNew York, NY, USAS. A. Boyer, SCADA: Supervisory Control and Data Acquisition. New York, NY, USA: Int. Soc. Autom., 2009.\n\nI J Goodfellow, Y Bengio, A Courville, Y Bengio, Deep Learning. Cambridge, MA, USAMIT Press1I. J. Goodfellow, Y. Bengio, A. Courville, and Y. Bengio, Deep Learning, vol. 1. Cambridge, MA, USA: MIT Press, 2016.\n\nDeep residual learning for image recognition. K He, X Zhang, S Ren, J Sun, Proc. CVPR Conf. CVPR ConfK. He, X. Zhang, S. Ren, and J. Sun, \"Deep residual learning for image recognition,\" in Proc. CVPR Conf., 2016, pp. 770-778.\n\n. R D Zimmerma, R. D. Zimmerma et al. (2018). MATPOWER. [Online]. Available: http://www.pserc.cornell.edu/matpower\n\nStatistical structure learning to ensure data integrity in smart grid. H Sedghi, E Jonckheere, IEEE Trans. Smart Grid. 64H. Sedghi and E. Jonckheere, \"Statistical structure learning to ensure data integrity in smart grid,\" IEEE Trans. Smart Grid, vol. 6, no. 4, pp. 1924-1933, Jul. 2015.\n\nKeras. F Chollet, F. Chollet et al. (2015). Keras. [Online]. Available: https://keras.io\n\nSupport vector machine. C Cortes, V Vapnik, Mach. Learn. 203C. Cortes and V. Vapnik, \"Support vector machine,\" Mach. Learn., vol. 20, no. 3, pp. 273-297, 1995.\n\nLightGBM: A highly efficient gradient boosting decision tree. G Ke, Proc. Adv. Neural Inf. Process. Syst. Adv. Neural Inf. ess. SystG. Ke et al., \"LightGBM: A highly efficient gradient boosting decision tree,\" in Proc. Adv. Neural Inf. Process. Syst., 2017, pp. 3146-3154.\n\nAn introduction to ROC analysis. T Fawcett, Pattern Recognit. Lett. 278T. Fawcett, \"An introduction to ROC analysis,\" Pattern Recognit. Lett., vol. 27, no. 8, pp. 861-874, 2006.\n", "annotations": {"author": "[{\"start\":\"127\",\"end\":\"140\"},{\"start\":\"141\",\"end\":\"169\"},{\"start\":\"170\",\"end\":\"229\"},{\"start\":\"230\",\"end\":\"243\"},{\"start\":\"244\",\"end\":\"253\"},{\"start\":\"254\",\"end\":\"276\"},{\"start\":\"277\",\"end\":\"406\"},{\"start\":\"407\",\"end\":\"450\"}]", "publisher": null, "author_last_name": "[{\"start\":\"135\",\"end\":\"139\"},{\"start\":\"198\",\"end\":\"203\"},{\"start\":\"238\",\"end\":\"242\"},{\"start\":\"250\",\"end\":\"252\"},{\"start\":\"270\",\"end\":\"275\"}]", "author_first_name": "[{\"start\":\"127\",\"end\":\"134\"},{\"start\":\"160\",\"end\":\"165\"},{\"start\":\"166\",\"end\":\"168\"},{\"start\":\"182\",\"end\":\"190\"},{\"start\":\"191\",\"end\":\"197\"},{\"start\":\"230\",\"end\":\"237\"},{\"start\":\"244\",\"end\":\"249\"},{\"start\":\"254\",\"end\":\"262\"},{\"start\":\"263\",\"end\":\"269\"}]", "author_affiliation": "[{\"start\":\"278\",\"end\":\"405\"},{\"start\":\"408\",\"end\":\"449\"}]", "title": "[{\"start\":\"1\",\"end\":\"110\"},{\"start\":\"451\",\"end\":\"560\"}]", "venue": "[{\"start\":\"562\",\"end\":\"593\"}]", "abstract": "[{\"start\":\"859\",\"end\":\"2606\"}]", "bib_ref": "[{\"start\":\"3015\",\"end\":\"3018\",\"attributes\":{\"ref_id\":\"b0\"}},{\"start\":\"3468\",\"end\":\"3471\",\"attributes\":{\"ref_id\":\"b1\"}},{\"start\":\"3754\",\"end\":\"3757\",\"attributes\":{\"ref_id\":\"b2\"}},{\"start\":\"3772\",\"end\":\"3775\",\"attributes\":{\"ref_id\":\"b3\"}},{\"start\":\"3792\",\"end\":\"3795\",\"attributes\":{\"ref_id\":\"b4\"}},{\"start\":\"3902\",\"end\":\"3905\",\"attributes\":{\"ref_id\":\"b5\"}},{\"start\":\"3920\",\"end\":\"3923\",\"attributes\":{\"ref_id\":\"b6\"}},{\"start\":\"3945\",\"end\":\"3948\",\"attributes\":{\"ref_id\":\"b7\"}},{\"start\":\"4028\",\"end\":\"4031\",\"attributes\":{\"ref_id\":\"b8\"}},{\"start\":\"4351\",\"end\":\"4354\",\"attributes\":{\"ref_id\":\"b5\"}},{\"start\":\"4541\",\"end\":\"4544\",\"attributes\":{\"ref_id\":\"b4\"}},{\"start\":\"4596\",\"end\":\"4599\",\"attributes\":{\"ref_id\":\"b8\"}},{\"start\":\"4696\",\"end\":\"4700\",\"attributes\":{\"ref_id\":\"b9\"}},{\"start\":\"5075\",\"end\":\"5079\",\"attributes\":{\"ref_id\":\"b9\"}},{\"start\":\"5081\",\"end\":\"5085\",\"attributes\":{\"ref_id\":\"b11\"}},{\"start\":\"5126\",\"end\":\"5130\",\"attributes\":{\"ref_id\":\"b12\"}},{\"start\":\"5132\",\"end\":\"5136\",\"attributes\":{\"ref_id\":\"b22\"}},{\"start\":\"5163\",\"end\":\"5167\",\"attributes\":{\"ref_id\":\"b10\"}},{\"start\":\"5344\",\"end\":\"5348\",\"attributes\":{\"ref_id\":\"b11\"}},{\"start\":\"5639\",\"end\":\"5643\",\"attributes\":{\"ref_id\":\"b12\"}},{\"start\":\"5675\",\"end\":\"5679\",\"attributes\":{\"ref_id\":\"b13\"}},{\"start\":\"5696\",\"end\":\"5700\",\"attributes\":{\"ref_id\":\"b14\"}},{\"start\":\"5722\",\"end\":\"5726\",\"attributes\":{\"ref_id\":\"b15\"}},{\"start\":\"5743\",\"end\":\"5747\",\"attributes\":{\"ref_id\":\"b16\"}},{\"start\":\"5773\",\"end\":\"5777\",\"attributes\":{\"ref_id\":\"b17\"}},{\"start\":\"5806\",\"end\":\"5810\",\"attributes\":{\"ref_id\":\"b17\"}},{\"start\":\"9348\",\"end\":\"9352\",\"attributes\":{\"ref_id\":\"b18\"}},{\"start\":\"9573\",\"end\":\"9577\",\"attributes\":{\"ref_id\":\"b19\"}},{\"start\":\"9820\",\"end\":\"9824\",\"attributes\":{\"ref_id\":\"b20\"}},{\"start\":\"9894\",\"end\":\"9898\",\"attributes\":{\"ref_id\":\"b21\"}},{\"start\":\"10097\",\"end\":\"10101\",\"attributes\":{\"ref_id\":\"b22\"}},{\"start\":\"10347\",\"end\":\"10351\",\"attributes\":{\"ref_id\":\"b14\"}},{\"start\":\"10637\",\"end\":\"10641\",\"attributes\":{\"ref_id\":\"b23\"}},{\"start\":\"10643\",\"end\":\"10647\",\"attributes\":{\"ref_id\":\"b24\"}},{\"start\":\"10668\",\"end\":\"10672\",\"attributes\":{\"ref_id\":\"b25\"}},{\"start\":\"11000\",\"end\":\"11004\",\"attributes\":{\"ref_id\":\"b26\"}},{\"start\":\"11202\",\"end\":\"11206\",\"attributes\":{\"ref_id\":\"b23\"}},{\"start\":\"12400\",\"end\":\"12404\",\"attributes\":{\"ref_id\":\"b27\"}},{\"start\":\"12903\",\"end\":\"12906\",\"attributes\":{\"ref_id\":\"b8\"}},{\"start\":\"13549\",\"end\":\"13552\",\"attributes\":{\"ref_id\":\"b1\"}},{\"start\":\"14178\",\"end\":\"14182\",\"attributes\":{\"ref_id\":\"b9\"}},{\"start\":\"14184\",\"end\":\"14188\",\"attributes\":{\"ref_id\":\"b28\"}},{\"start\":\"14267\",\"end\":\"14271\",\"attributes\":{\"ref_id\":\"b9\"}},{\"start\":\"16846\",\"end\":\"16847\",\"attributes\":{\"ref_id\":\"b0\"}},{\"start\":\"17430\",\"end\":\"17431\",\"attributes\":{\"ref_id\":\"b1\"}},{\"start\":\"17589\",\"end\":\"17592\",\"attributes\":{\"ref_id\":\"b4\"}},{\"start\":\"18809\",\"end\":\"18810\",\"attributes\":{\"ref_id\":\"b0\"}},{\"start\":\"18906\",\"end\":\"18910\",\"attributes\":{\"ref_id\":\"b29\"}},{\"start\":\"18912\",\"end\":\"18913\",\"attributes\":{\"ref_id\":\"b1\"}},{\"start\":\"18944\",\"end\":\"18948\",\"attributes\":{\"ref_id\":\"b21\"}},{\"start\":\"19793\",\"end\":\"19797\",\"attributes\":{\"ref_id\":\"b30\"}},{\"start\":\"20028\",\"end\":\"20029\",\"attributes\":{\"ref_id\":\"b2\"}},{\"start\":\"20199\",\"end\":\"20203\",\"attributes\":{\"ref_id\":\"b30\"}},{\"start\":\"20250\",\"end\":\"20253\",\"attributes\":{\"ref_id\":\"b5\"}},{\"start\":\"22521\",\"end\":\"22525\",\"attributes\":{\"ref_id\":\"b31\"}},{\"start\":\"24461\",\"end\":\"24465\",\"attributes\":{\"ref_id\":\"b30\"}},{\"start\":\"25265\",\"end\":\"25269\",\"attributes\":{\"ref_id\":\"b32\"}},{\"start\":\"26529\",\"end\":\"26533\",\"attributes\":{\"ref_id\":\"b13\"}},{\"start\":\"26535\",\"end\":\"26539\",\"attributes\":{\"ref_id\":\"b33\"}},{\"start\":\"27086\",\"end\":\"27090\",\"attributes\":{\"ref_id\":\"b9\"}},{\"start\":\"27640\",\"end\":\"27644\",\"attributes\":{\"ref_id\":\"b9\"}},{\"start\":\"28845\",\"end\":\"28849\",\"attributes\":{\"ref_id\":\"b34\"}},{\"start\":\"29102\",\"end\":\"29106\",\"attributes\":{\"ref_id\":\"b21\"}},{\"start\":\"29108\",\"end\":\"29109\",\"attributes\":{\"ref_id\":\"b3\"}},{\"start\":\"29129\",\"end\":\"29133\",\"attributes\":{\"ref_id\":\"b21\"}},{\"start\":\"29387\",\"end\":\"29391\",\"attributes\":{\"ref_id\":\"b35\"}},{\"start\":\"29633\",\"end\":\"29637\",\"attributes\":{\"ref_id\":\"b36\"}},{\"start\":\"30372\",\"end\":\"30376\",\"attributes\":{\"ref_id\":\"b11\"}},{\"start\":\"30450\",\"end\":\"30454\",\"attributes\":{\"ref_id\":\"b12\"}},{\"start\":\"32730\",\"end\":\"32734\",\"attributes\":{\"ref_id\":\"b31\"}},{\"start\":\"33725\",\"end\":\"33727\",\"attributes\":{\"ref_id\":\"b18\"}},{\"start\":\"33880\",\"end\":\"33882\",\"attributes\":{\"ref_id\":\"b18\"}},{\"start\":\"36624\",\"end\":\"36628\",\"attributes\":{\"ref_id\":\"b37\"}},{\"start\":\"36918\",\"end\":\"36922\",\"attributes\":{\"ref_id\":\"b37\"}}]", "figure": "[{\"start\":\"41904\",\"end\":\"41960\",\"attributes\":{\"id\":\"fig_0\"}},{\"start\":\"41961\",\"end\":\"42060\",\"attributes\":{\"id\":\"fig_1\"}},{\"start\":\"42061\",\"end\":\"42228\",\"attributes\":{\"id\":\"fig_2\"}},{\"start\":\"42229\",\"end\":\"42419\",\"attributes\":{\"id\":\"fig_3\"}},{\"start\":\"42420\",\"end\":\"42716\",\"attributes\":{\"id\":\"tab_0\",\"type\":\"table\"}},{\"start\":\"42717\",\"end\":\"42817\",\"attributes\":{\"id\":\"tab_1\",\"type\":\"table\"}},{\"start\":\"42818\",\"end\":\"42880\",\"attributes\":{\"id\":\"tab_2\",\"type\":\"table\"}},{\"start\":\"42881\",\"end\":\"42954\",\"attributes\":{\"id\":\"tab_3\",\"type\":\"table\"}},{\"start\":\"42955\",\"end\":\"43183\",\"attributes\":{\"id\":\"tab_4\",\"type\":\"table\"}}]", "paragraph": "[{\"start\":\"2625\",\"end\":\"3954\"},{\"start\":\"3956\",\"end\":\"4897\"},{\"start\":\"4899\",\"end\":\"7037\"},{\"start\":\"7039\",\"end\":\"7889\"},{\"start\":\"7891\",\"end\":\"9124\"},{\"start\":\"9126\",\"end\":\"9207\"},{\"start\":\"9227\",\"end\":\"10648\"},{\"start\":\"10650\",\"end\":\"11519\"},{\"start\":\"11521\",\"end\":\"11941\"},{\"start\":\"11996\",\"end\":\"12543\"},{\"start\":\"12611\",\"end\":\"12981\"},{\"start\":\"13038\",\"end\":\"13446\"},{\"start\":\"13466\",\"end\":\"13698\"},{\"start\":\"13737\",\"end\":\"13899\"},{\"start\":\"13901\",\"end\":\"14471\"},{\"start\":\"14473\",\"end\":\"14756\"},{\"start\":\"14822\",\"end\":\"15160\"},{\"start\":\"15188\",\"end\":\"16575\"},{\"start\":\"16601\",\"end\":\"17796\"},{\"start\":\"17798\",\"end\":\"17907\"},{\"start\":\"17909\",\"end\":\"18077\"},{\"start\":\"18179\",\"end\":\"18507\"},{\"start\":\"18573\",\"end\":\"19212\"},{\"start\":\"19214\",\"end\":\"19913\"},{\"start\":\"19950\",\"end\":\"20296\"},{\"start\":\"20344\",\"end\":\"20643\"},{\"start\":\"20682\",\"end\":\"20748\"},{\"start\":\"20750\",\"end\":\"21072\"},{\"start\":\"21109\",\"end\":\"21484\"},{\"start\":\"21523\",\"end\":\"21696\"},{\"start\":\"21698\",\"end\":\"22887\"},{\"start\":\"22903\",\"end\":\"23250\"},{\"start\":\"23290\",\"end\":\"23884\"},{\"start\":\"23886\",\"end\":\"24337\"},{\"start\":\"24403\",\"end\":\"24529\"},{\"start\":\"24549\",\"end\":\"25055\"},{\"start\":\"25071\",\"end\":\"26239\"},{\"start\":\"26241\",\"end\":\"26919\"},{\"start\":\"26921\",\"end\":\"27336\"},{\"start\":\"27338\",\"end\":\"27526\"},{\"start\":\"27528\",\"end\":\"27750\"},{\"start\":\"27752\",\"end\":\"28079\"},{\"start\":\"28117\",\"end\":\"28623\"},{\"start\":\"28653\",\"end\":\"30068\"},{\"start\":\"30145\",\"end\":\"30966\"},{\"start\":\"31028\",\"end\":\"31270\"},{\"start\":\"31272\",\"end\":\"32006\"},{\"start\":\"32008\",\"end\":\"32378\"},{\"start\":\"32380\",\"end\":\"33303\"},{\"start\":\"33305\",\"end\":\"34112\"},{\"start\":\"34114\",\"end\":\"35250\"},{\"start\":\"35252\",\"end\":\"35978\"},{\"start\":\"35980\",\"end\":\"37310\"},{\"start\":\"37312\",\"end\":\"38463\"},{\"start\":\"38465\",\"end\":\"38835\"},{\"start\":\"38873\",\"end\":\"39578\"},{\"start\":\"39580\",\"end\":\"39960\"},{\"start\":\"39962\",\"end\":\"40622\"},{\"start\":\"40640\",\"end\":\"41903\"}]", "formula": "[{\"start\":\"12544\",\"end\":\"12610\",\"attributes\":{\"id\":\"formula_0\"}},{\"start\":\"12982\",\"end\":\"13004\",\"attributes\":{\"id\":\"formula_1\"}},{\"start\":\"13447\",\"end\":\"13465\",\"attributes\":{\"id\":\"formula_2\"}},{\"start\":\"13699\",\"end\":\"13736\",\"attributes\":{\"id\":\"formula_3\"}},{\"start\":\"18078\",\"end\":\"18178\",\"attributes\":{\"id\":\"formula_4\"}},{\"start\":\"18508\",\"end\":\"18572\",\"attributes\":{\"id\":\"formula_5\"}},{\"start\":\"19914\",\"end\":\"19949\",\"attributes\":{\"id\":\"formula_6\"}},{\"start\":\"20297\",\"end\":\"20343\",\"attributes\":{\"id\":\"formula_7\"}},{\"start\":\"20644\",\"end\":\"20681\",\"attributes\":{\"id\":\"formula_8\"}},{\"start\":\"21073\",\"end\":\"21108\",\"attributes\":{\"id\":\"formula_9\"}},{\"start\":\"21485\",\"end\":\"21522\",\"attributes\":{\"id\":\"formula_10\"}},{\"start\":\"24338\",\"end\":\"24402\",\"attributes\":{\"id\":\"formula_11\"}},{\"start\":\"30967\",\"end\":\"31027\",\"attributes\":{\"id\":\"formula_12\"}}]", "table_ref": "[{\"start\":\"21622\",\"end\":\"21629\",\"attributes\":{\"ref_id\":\"tab_0\"}},{\"start\":\"25288\",\"end\":\"25296\",\"attributes\":{\"ref_id\":\"tab_0\"}},{\"start\":\"32221\",\"end\":\"32230\",\"attributes\":{\"ref_id\":\"tab_0\"}},{\"start\":\"32385\",\"end\":\"32394\",\"attributes\":{\"ref_id\":\"tab_0\"}},{\"start\":\"34477\",\"end\":\"34485\",\"attributes\":{\"ref_id\":\"tab_0\"}},{\"start\":\"35342\",\"end\":\"35349\",\"attributes\":{\"ref_id\":\"tab_4\"}}]", "section_header": "[{\"start\":\"2608\",\"end\":\"2623\"},{\"start\":\"9210\",\"end\":\"9225\"},{\"start\":\"11944\",\"end\":\"11959\"},{\"start\":\"11962\",\"end\":\"11994\"},{\"start\":\"13006\",\"end\":\"13036\"},{\"start\":\"14759\",\"end\":\"14820\"},{\"start\":\"15163\",\"end\":\"15186\"},{\"start\":\"16578\",\"end\":\"16599\"},{\"start\":\"22890\",\"end\":\"22901\"},{\"start\":\"23253\",\"end\":\"23288\"},{\"start\":\"24532\",\"end\":\"24547\"},{\"start\":\"25058\",\"end\":\"25069\"},{\"start\":\"28082\",\"end\":\"28115\"},{\"start\":\"28626\",\"end\":\"28651\"},{\"start\":\"30071\",\"end\":\"30106\"},{\"start\":\"30109\",\"end\":\"30143\"},{\"start\":\"38838\",\"end\":\"38871\"},{\"start\":\"40625\",\"end\":\"40638\"},{\"start\":\"41905\",\"end\":\"41913\"},{\"start\":\"41962\",\"end\":\"41970\"},{\"start\":\"42062\",\"end\":\"42070\"},{\"start\":\"42230\",\"end\":\"42238\"},{\"start\":\"42421\",\"end\":\"42428\"},{\"start\":\"42718\",\"end\":\"42737\"},{\"start\":\"42819\",\"end\":\"42840\"},{\"start\":\"42882\",\"end\":\"42905\"},{\"start\":\"42956\",\"end\":\"42975\"}]", "table": "[{\"start\":\"42430\",\"end\":\"42716\"}]", "figure_caption": "[{\"start\":\"41915\",\"end\":\"41960\"},{\"start\":\"41972\",\"end\":\"42060\"},{\"start\":\"42072\",\"end\":\"42228\"},{\"start\":\"42240\",\"end\":\"42419\"},{\"start\":\"42740\",\"end\":\"42817\"},{\"start\":\"42844\",\"end\":\"42880\"},{\"start\":\"42908\",\"end\":\"42954\"},{\"start\":\"42977\",\"end\":\"43183\"}]", "figure_ref": "[{\"start\":\"16324\",\"end\":\"16330\",\"attributes\":{\"ref_id\":\"fig_1\"}},{\"start\":\"16665\",\"end\":\"16671\",\"attributes\":{\"ref_id\":\"fig_0\"}},{\"start\":\"19306\",\"end\":\"19312\",\"attributes\":{\"ref_id\":\"fig_1\"}},{\"start\":\"26009\",\"end\":\"26015\"},{\"start\":\"27702\",\"end\":\"27708\",\"attributes\":{\"ref_id\":\"fig_2\"}},{\"start\":\"28029\",\"end\":\"28035\",\"attributes\":{\"ref_id\":\"fig_2\"}},{\"start\":\"36393\",\"end\":\"36399\"},{\"start\":\"37094\",\"end\":\"37100\",\"attributes\":{\"ref_id\":\"fig_2\"}},{\"start\":\"37535\",\"end\":\"37541\",\"attributes\":{\"ref_id\":\"fig_2\"}},{\"start\":\"37639\",\"end\":\"37648\",\"attributes\":{\"ref_id\":\"fig_2\"}},{\"start\":\"37899\",\"end\":\"37908\",\"attributes\":{\"ref_id\":\"fig_2\"}},{\"start\":\"39206\",\"end\":\"39212\",\"attributes\":{\"ref_id\":\"fig_3\"}},{\"start\":\"39583\",\"end\":\"39589\",\"attributes\":{\"ref_id\":\"fig_3\"}},{\"start\":\"39950\",\"end\":\"39959\",\"attributes\":{\"ref_id\":\"fig_2\"}},{\"start\":\"40072\",\"end\":\"40081\",\"attributes\":{\"ref_id\":\"fig_3\"}},{\"start\":\"40186\",\"end\":\"40195\",\"attributes\":{\"ref_id\":\"fig_2\"}}]", "bib_author_first_name": "[{\"start\":\"43441\",\"end\":\"43442\"},{\"start\":\"43448\",\"end\":\"43449\"},{\"start\":\"43454\",\"end\":\"43455\"},{\"start\":\"43460\",\"end\":\"43461\"},{\"start\":\"43467\",\"end\":\"43468\"},{\"start\":\"43665\",\"end\":\"43666\"},{\"start\":\"43667\",\"end\":\"43668\"},{\"start\":\"43677\",\"end\":\"43678\"},{\"start\":\"43679\",\"end\":\"43680\"},{\"start\":\"43691\",\"end\":\"43696\"},{\"start\":\"43705\",\"end\":\"43710\"},{\"start\":\"43713\",\"end\":\"43718\"},{\"start\":\"44002\",\"end\":\"44003\"},{\"start\":\"44004\",\"end\":\"44005\"},{\"start\":\"44016\",\"end\":\"44017\"},{\"start\":\"44018\",\"end\":\"44019\"},{\"start\":\"44344\",\"end\":\"44345\"},{\"start\":\"44353\",\"end\":\"44354\"},{\"start\":\"44361\",\"end\":\"44362\"},{\"start\":\"44368\",\"end\":\"44369\"},{\"start\":\"44370\",\"end\":\"44371\"},{\"start\":\"44380\",\"end\":\"44381\"},{\"start\":\"44382\",\"end\":\"44383\"},{\"start\":\"44711\",\"end\":\"44712\"},{\"start\":\"44719\",\"end\":\"44720\"},{\"start\":\"44727\",\"end\":\"44728\"},{\"start\":\"44733\",\"end\":\"44734\"},{\"start\":\"44742\",\"end\":\"44743\"},{\"start\":\"44744\",\"end\":\"44745\"},{\"start\":\"45064\",\"end\":\"45065\"},{\"start\":\"45071\",\"end\":\"45072\"},{\"start\":\"45077\",\"end\":\"45078\"},{\"start\":\"45334\",\"end\":\"45335\"},{\"start\":\"45341\",\"end\":\"45342\"},{\"start\":\"45347\",\"end\":\"45348\"},{\"start\":\"45354\",\"end\":\"45355\"},{\"start\":\"45684\",\"end\":\"45685\"},{\"start\":\"45691\",\"end\":\"45692\"},{\"start\":\"45698\",\"end\":\"45699\"},{\"start\":\"45706\",\"end\":\"45707\"},{\"start\":\"45714\",\"end\":\"45715\"},{\"start\":\"46040\",\"end\":\"46041\"},{\"start\":\"46047\",\"end\":\"46048\"},{\"start\":\"46055\",\"end\":\"46056\"},{\"start\":\"46057\",\"end\":\"46058\"},{\"start\":\"46387\",\"end\":\"46388\"},{\"start\":\"46393\",\"end\":\"46394\"},{\"start\":\"46395\",\"end\":\"46396\"},{\"start\":\"46714\",\"end\":\"46715\"},{\"start\":\"46722\",\"end\":\"46723\"},{\"start\":\"46728\",\"end\":\"46729\"},{\"start\":\"46735\",\"end\":\"46736\"},{\"start\":\"46741\",\"end\":\"46742\"},{\"start\":\"46749\",\"end\":\"46750\"},{\"start\":\"47098\",\"end\":\"47099\"},{\"start\":\"47105\",\"end\":\"47109\"},{\"start\":\"47110\",\"end\":\"47111\"},{\"start\":\"47118\",\"end\":\"47119\"},{\"start\":\"47125\",\"end\":\"47126\"},{\"start\":\"47493\",\"end\":\"47494\"},{\"start\":\"47495\",\"end\":\"47496\"},{\"start\":\"47507\",\"end\":\"47508\"},{\"start\":\"47509\",\"end\":\"47510\"},{\"start\":\"47902\",\"end\":\"47903\"},{\"start\":\"47913\",\"end\":\"47914\"},{\"start\":\"47924\",\"end\":\"47925\"},{\"start\":\"47926\",\"end\":\"47927\"},{\"start\":\"48275\",\"end\":\"48276\"},{\"start\":\"48288\",\"end\":\"48289\"},{\"start\":\"48295\",\"end\":\"48296\"},{\"start\":\"48301\",\"end\":\"48302\"},{\"start\":\"48640\",\"end\":\"48641\"},{\"start\":\"48647\",\"end\":\"48648\"},{\"start\":\"48662\",\"end\":\"48663\"},{\"start\":\"48670\",\"end\":\"48671\"},{\"start\":\"48672\",\"end\":\"48673\"},{\"start\":\"48682\",\"end\":\"48683\"},{\"start\":\"49062\",\"end\":\"49063\"},{\"start\":\"49070\",\"end\":\"49071\"},{\"start\":\"49453\",\"end\":\"49454\"},{\"start\":\"49462\",\"end\":\"49463\"},{\"start\":\"49477\",\"end\":\"49478\"},{\"start\":\"49820\",\"end\":\"49821\"},{\"start\":\"49833\",\"end\":\"49834\"},{\"start\":\"49843\",\"end\":\"49844\"},{\"start\":\"49857\",\"end\":\"49858\"},{\"start\":\"49873\",\"end\":\"49877\"},{\"start\":\"50183\",\"end\":\"50184\"},{\"start\":\"50191\",\"end\":\"50192\"},{\"start\":\"50202\",\"end\":\"50203\"},{\"start\":\"50204\",\"end\":\"50207\"},{\"start\":\"50215\",\"end\":\"50216\"},{\"start\":\"50217\",\"end\":\"50218\"},{\"start\":\"50229\",\"end\":\"50230\"},{\"start\":\"50231\",\"end\":\"50232\"},{\"start\":\"50576\",\"end\":\"50577\"},{\"start\":\"50591\",\"end\":\"50592\"},{\"start\":\"50598\",\"end\":\"50599\"},{\"start\":\"50608\",\"end\":\"50609\"},{\"start\":\"50617\",\"end\":\"50618\"},{\"start\":\"50948\",\"end\":\"50949\"},{\"start\":\"50954\",\"end\":\"50955\"},{\"start\":\"50956\",\"end\":\"50957\"},{\"start\":\"50966\",\"end\":\"50967\"},{\"start\":\"51308\",\"end\":\"51309\"},{\"start\":\"51310\",\"end\":\"51313\"},{\"start\":\"51318\",\"end\":\"51319\"},{\"start\":\"51325\",\"end\":\"51326\"},{\"start\":\"51327\",\"end\":\"51330\"},{\"start\":\"51639\",\"end\":\"51640\"},{\"start\":\"51647\",\"end\":\"51648\"},{\"start\":\"51656\",\"end\":\"51657\"},{\"start\":\"51664\",\"end\":\"51665\"},{\"start\":\"51933\",\"end\":\"51934\"},{\"start\":\"51935\",\"end\":\"51936\"},{\"start\":\"51946\",\"end\":\"51947\"},{\"start\":\"51957\",\"end\":\"51958\"},{\"start\":\"51959\",\"end\":\"51960\"},{\"start\":\"51969\",\"end\":\"51970\"},{\"start\":\"52253\",\"end\":\"52254\"},{\"start\":\"52267\",\"end\":\"52268\"},{\"start\":\"52280\",\"end\":\"52281\"},{\"start\":\"52282\",\"end\":\"52283\"},{\"start\":\"52543\",\"end\":\"52544\"},{\"start\":\"52778\",\"end\":\"52779\"},{\"start\":\"52792\",\"end\":\"52793\"},{\"start\":\"52798\",\"end\":\"52799\"},{\"start\":\"52800\",\"end\":\"52801\"},{\"start\":\"52811\",\"end\":\"52812\"},{\"start\":\"52813\",\"end\":\"52814\"},{\"start\":\"53177\",\"end\":\"53178\"},{\"start\":\"53186\",\"end\":\"53187\"},{\"start\":\"53188\",\"end\":\"53189\"},{\"start\":\"53199\",\"end\":\"53200\"},{\"start\":\"53467\",\"end\":\"53468\"},{\"start\":\"53469\",\"end\":\"53470\"},{\"start\":\"53616\",\"end\":\"53617\"},{\"start\":\"53618\",\"end\":\"53619\"},{\"start\":\"53632\",\"end\":\"53633\"},{\"start\":\"53642\",\"end\":\"53643\"},{\"start\":\"53655\",\"end\":\"53656\"},{\"start\":\"53873\",\"end\":\"53874\"},{\"start\":\"53879\",\"end\":\"53880\"},{\"start\":\"53888\",\"end\":\"53889\"},{\"start\":\"53895\",\"end\":\"53896\"},{\"start\":\"54056\",\"end\":\"54057\"},{\"start\":\"54058\",\"end\":\"54059\"},{\"start\":\"54241\",\"end\":\"54242\"},{\"start\":\"54251\",\"end\":\"54252\"},{\"start\":\"54466\",\"end\":\"54467\"},{\"start\":\"54573\",\"end\":\"54574\"},{\"start\":\"54583\",\"end\":\"54584\"},{\"start\":\"54772\",\"end\":\"54773\"},{\"start\":\"55017\",\"end\":\"55018\"}]", "bib_author_last_name": "[{\"start\":\"43443\",\"end\":\"43446\"},{\"start\":\"43450\",\"end\":\"43452\"},{\"start\":\"43456\",\"end\":\"43458\"},{\"start\":\"43462\",\"end\":\"43465\"},{\"start\":\"43469\",\"end\":\"43472\"},{\"start\":\"43669\",\"end\":\"43675\"},{\"start\":\"43681\",\"end\":\"43689\"},{\"start\":\"43697\",\"end\":\"43703\"},{\"start\":\"43719\",\"end\":\"43724\"},{\"start\":\"44006\",\"end\":\"44014\"},{\"start\":\"44020\",\"end\":\"44026\"},{\"start\":\"44346\",\"end\":\"44351\"},{\"start\":\"44355\",\"end\":\"44359\"},{\"start\":\"44363\",\"end\":\"44366\"},{\"start\":\"44372\",\"end\":\"44378\"},{\"start\":\"44384\",\"end\":\"44388\"},{\"start\":\"44713\",\"end\":\"44717\"},{\"start\":\"44721\",\"end\":\"44725\"},{\"start\":\"44729\",\"end\":\"44731\"},{\"start\":\"44735\",\"end\":\"44740\"},{\"start\":\"44746\",\"end\":\"44755\"},{\"start\":\"45066\",\"end\":\"45069\"},{\"start\":\"45073\",\"end\":\"45075\"},{\"start\":\"45079\",\"end\":\"45087\"},{\"start\":\"45336\",\"end\":\"45339\"},{\"start\":\"45343\",\"end\":\"45345\"},{\"start\":\"45349\",\"end\":\"45352\"},{\"start\":\"45356\",\"end\":\"45358\"},{\"start\":\"45686\",\"end\":\"45689\"},{\"start\":\"45693\",\"end\":\"45696\"},{\"start\":\"45700\",\"end\":\"45704\"},{\"start\":\"45708\",\"end\":\"45712\"},{\"start\":\"45716\",\"end\":\"45719\"},{\"start\":\"46042\",\"end\":\"46045\"},{\"start\":\"46049\",\"end\":\"46053\"},{\"start\":\"46059\",\"end\":\"46065\"},{\"start\":\"46389\",\"end\":\"46391\"},{\"start\":\"46397\",\"end\":\"46402\"},{\"start\":\"46716\",\"end\":\"46720\"},{\"start\":\"46724\",\"end\":\"46726\"},{\"start\":\"46730\",\"end\":\"46733\"},{\"start\":\"46737\",\"end\":\"46739\"},{\"start\":\"46743\",\"end\":\"46747\"},{\"start\":\"46751\",\"end\":\"46755\"},{\"start\":\"47100\",\"end\":\"47103\"},{\"start\":\"47112\",\"end\":\"47116\"},{\"start\":\"47120\",\"end\":\"47123\"},{\"start\":\"47127\",\"end\":\"47130\"},{\"start\":\"47497\",\"end\":\"47505\"},{\"start\":\"47511\",\"end\":\"47518\"},{\"start\":\"47904\",\"end\":\"47911\"},{\"start\":\"47915\",\"end\":\"47922\"},{\"start\":\"47928\",\"end\":\"47933\"},{\"start\":\"48277\",\"end\":\"48286\"},{\"start\":\"48290\",\"end\":\"48293\"},{\"start\":\"48297\",\"end\":\"48299\"},{\"start\":\"48303\",\"end\":\"48306\"},{\"start\":\"48642\",\"end\":\"48645\"},{\"start\":\"48649\",\"end\":\"48660\"},{\"start\":\"48664\",\"end\":\"48668\"},{\"start\":\"48674\",\"end\":\"48680\"},{\"start\":\"48684\",\"end\":\"48687\"},{\"start\":\"49064\",\"end\":\"49068\"},{\"start\":\"49072\",\"end\":\"49074\"},{\"start\":\"49455\",\"end\":\"49460\"},{\"start\":\"49464\",\"end\":\"49475\"},{\"start\":\"49479\",\"end\":\"49487\"},{\"start\":\"49822\",\"end\":\"49831\"},{\"start\":\"49835\",\"end\":\"49841\"},{\"start\":\"49845\",\"end\":\"49855\"},{\"start\":\"49859\",\"end\":\"49871\"},{\"start\":\"49878\",\"end\":\"49882\"},{\"start\":\"50185\",\"end\":\"50189\"},{\"start\":\"50193\",\"end\":\"50200\"},{\"start\":\"50208\",\"end\":\"50213\"},{\"start\":\"50219\",\"end\":\"50227\"},{\"start\":\"50233\",\"end\":\"50237\"},{\"start\":\"50578\",\"end\":\"50589\"},{\"start\":\"50593\",\"end\":\"50596\"},{\"start\":\"50600\",\"end\":\"50606\"},{\"start\":\"50610\",\"end\":\"50615\"},{\"start\":\"50619\",\"end\":\"50622\"},{\"start\":\"50950\",\"end\":\"50952\"},{\"start\":\"50958\",\"end\":\"50964\"},{\"start\":\"50968\",\"end\":\"50971\"},{\"start\":\"51314\",\"end\":\"51316\"},{\"start\":\"51320\",\"end\":\"51323\"},{\"start\":\"51331\",\"end\":\"51333\"},{\"start\":\"51641\",\"end\":\"51645\"},{\"start\":\"51649\",\"end\":\"51654\"},{\"start\":\"51658\",\"end\":\"51662\"},{\"start\":\"51666\",\"end\":\"51669\"},{\"start\":\"51937\",\"end\":\"51944\"},{\"start\":\"51948\",\"end\":\"51955\"},{\"start\":\"51961\",\"end\":\"51967\"},{\"start\":\"51971\",\"end\":\"51974\"},{\"start\":\"52255\",\"end\":\"52265\"},{\"start\":\"52269\",\"end\":\"52278\"},{\"start\":\"52284\",\"end\":\"52290\"},{\"start\":\"52545\",\"end\":\"52551\"},{\"start\":\"52780\",\"end\":\"52790\"},{\"start\":\"52794\",\"end\":\"52796\"},{\"start\":\"52802\",\"end\":\"52809\"},{\"start\":\"52815\",\"end\":\"52823\"},{\"start\":\"53179\",\"end\":\"53184\"},{\"start\":\"53190\",\"end\":\"53197\"},{\"start\":\"53201\",\"end\":\"53205\"},{\"start\":\"53471\",\"end\":\"53476\"},{\"start\":\"53620\",\"end\":\"53630\"},{\"start\":\"53634\",\"end\":\"53640\"},{\"start\":\"53644\",\"end\":\"53653\"},{\"start\":\"53657\",\"end\":\"53663\"},{\"start\":\"53875\",\"end\":\"53877\"},{\"start\":\"53881\",\"end\":\"53886\"},{\"start\":\"53890\",\"end\":\"53893\"},{\"start\":\"53897\",\"end\":\"53900\"},{\"start\":\"54060\",\"end\":\"54068\"},{\"start\":\"54243\",\"end\":\"54249\"},{\"start\":\"54253\",\"end\":\"54263\"},{\"start\":\"54468\",\"end\":\"54475\"},{\"start\":\"54575\",\"end\":\"54581\"},{\"start\":\"54585\",\"end\":\"54591\"},{\"start\":\"54774\",\"end\":\"54776\"},{\"start\":\"55019\",\"end\":\"55026\"}]", "bib_entry": "[{\"start\":\"43383\",\"end\":\"43661\",\"attributes\":{\"matched_paper_id\":\"195831999\",\"id\":\"b0\"}},{\"start\":\"43663\",\"end\":\"43854\",\"attributes\":{\"id\":\"b1\"}},{\"start\":\"43856\",\"end\":\"44271\",\"attributes\":{\"matched_paper_id\":\"37659838\",\"id\":\"b2\"}},{\"start\":\"44273\",\"end\":\"44610\",\"attributes\":{\"matched_paper_id\":\"20452367\",\"id\":\"b3\"}},{\"start\":\"44612\",\"end\":\"45011\",\"attributes\":{\"matched_paper_id\":\"15194417\",\"id\":\"b4\"}},{\"start\":\"45013\",\"end\":\"45264\",\"attributes\":{\"matched_paper_id\":\"11125581\",\"id\":\"b5\"}},{\"start\":\"45266\",\"end\":\"45582\",\"attributes\":{\"matched_paper_id\":\"10273270\",\"id\":\"b6\"}},{\"start\":\"45584\",\"end\":\"45959\",\"attributes\":{\"matched_paper_id\":\"13319630\",\"id\":\"b7\"}},{\"start\":\"45961\",\"end\":\"46286\",\"attributes\":{\"matched_paper_id\":\"838905\",\"id\":\"b8\"}},{\"start\":\"46288\",\"end\":\"46627\",\"attributes\":{\"matched_paper_id\":\"16068914\",\"id\":\"b9\"}},{\"start\":\"46629\",\"end\":\"47015\",\"attributes\":{\"matched_paper_id\":\"22750547\",\"id\":\"b10\"}},{\"start\":\"47017\",\"end\":\"47351\",\"attributes\":{\"matched_paper_id\":\"51983061\",\"id\":\"b11\"}},{\"start\":\"47353\",\"end\":\"47802\",\"attributes\":{\"matched_paper_id\":\"3978909\",\"id\":\"b12\"}},{\"start\":\"47804\",\"end\":\"48168\",\"attributes\":{\"matched_paper_id\":\"52120350\",\"id\":\"b13\"}},{\"start\":\"48170\",\"end\":\"48561\",\"attributes\":{\"matched_paper_id\":\"3866942\",\"id\":\"b14\"}},{\"start\":\"48563\",\"end\":\"48915\",\"attributes\":{\"matched_paper_id\":\"1755715\",\"id\":\"b15\"}},{\"start\":\"48917\",\"end\":\"49359\",\"attributes\":{\"matched_paper_id\":\"3478148\",\"id\":\"b16\"}},{\"start\":\"49361\",\"end\":\"49715\",\"attributes\":{\"matched_paper_id\":\"5021490\",\"id\":\"b17\"}},{\"start\":\"49717\",\"end\":\"50116\",\"attributes\":{\"matched_paper_id\":\"197433447\",\"id\":\"b18\"}},{\"start\":\"50118\",\"end\":\"50496\",\"attributes\":{\"matched_paper_id\":\"12237987\",\"id\":\"b19\"}},{\"start\":\"50498\",\"end\":\"50834\",\"attributes\":{\"matched_paper_id\":\"12731104\",\"id\":\"b20\"}},{\"start\":\"50836\",\"end\":\"51212\",\"attributes\":{\"matched_paper_id\":\"30397074\",\"id\":\"b21\"}},{\"start\":\"51214\",\"end\":\"51568\",\"attributes\":{\"matched_paper_id\":\"49574534\",\"id\":\"b22\"}},{\"start\":\"51570\",\"end\":\"51854\",\"attributes\":{\"matched_paper_id\":\"2519230\",\"id\":\"b23\"}},{\"start\":\"51856\",\"end\":\"52186\",\"attributes\":{\"matched_paper_id\":\"898670\",\"id\":\"b24\"}},{\"start\":\"52188\",\"end\":\"52473\",\"attributes\":{\"matched_paper_id\":\"195908774\",\"id\":\"b25\"}},{\"start\":\"52475\",\"end\":\"52693\",\"attributes\":{\"matched_paper_id\":\"515925\",\"id\":\"b26\"}},{\"start\":\"52695\",\"end\":\"53068\",\"attributes\":{\"matched_paper_id\":\"6673928\",\"id\":\"b27\"}},{\"start\":\"53070\",\"end\":\"53416\",\"attributes\":{\"matched_paper_id\":\"11480179\",\"id\":\"b28\"}},{\"start\":\"53418\",\"end\":\"53614\",\"attributes\":{\"id\":\"b29\"}},{\"start\":\"53616\",\"end\":\"53825\",\"attributes\":{\"id\":\"b30\"}},{\"start\":\"53827\",\"end\":\"54052\",\"attributes\":{\"matched_paper_id\":\"206594692\",\"id\":\"b31\"}},{\"start\":\"54054\",\"end\":\"54168\",\"attributes\":{\"id\":\"b32\"}},{\"start\":\"54170\",\"end\":\"54457\",\"attributes\":{\"matched_paper_id\":\"15658283\",\"id\":\"b33\"}},{\"start\":\"54459\",\"end\":\"54547\",\"attributes\":{\"id\":\"b34\"}},{\"start\":\"54549\",\"end\":\"54708\",\"attributes\":{\"matched_paper_id\":\"6589884\",\"id\":\"b35\"}},{\"start\":\"54710\",\"end\":\"54982\",\"attributes\":{\"matched_paper_id\":\"3815895\",\"id\":\"b36\"}},{\"start\":\"54984\",\"end\":\"55161\",\"attributes\":{\"matched_paper_id\":\"2027090\",\"id\":\"b37\"}}]", "bib_title": "[{\"start\":\"43383\",\"end\":\"43439\"},{\"start\":\"43856\",\"end\":\"44000\"},{\"start\":\"44273\",\"end\":\"44342\"},{\"start\":\"44612\",\"end\":\"44709\"},{\"start\":\"45013\",\"end\":\"45062\"},{\"start\":\"45266\",\"end\":\"45332\"},{\"start\":\"45584\",\"end\":\"45682\"},{\"start\":\"45961\",\"end\":\"46038\"},{\"start\":\"46288\",\"end\":\"46385\"},{\"start\":\"46629\",\"end\":\"46712\"},{\"start\":\"47017\",\"end\":\"47096\"},{\"start\":\"47353\",\"end\":\"47491\"},{\"start\":\"47804\",\"end\":\"47900\"},{\"start\":\"48170\",\"end\":\"48273\"},{\"start\":\"48563\",\"end\":\"48638\"},{\"start\":\"48917\",\"end\":\"49060\"},{\"start\":\"49361\",\"end\":\"49451\"},{\"start\":\"49717\",\"end\":\"49818\"},{\"start\":\"50118\",\"end\":\"50181\"},{\"start\":\"50498\",\"end\":\"50574\"},{\"start\":\"50836\",\"end\":\"50946\"},{\"start\":\"51214\",\"end\":\"51306\"},{\"start\":\"51570\",\"end\":\"51637\"},{\"start\":\"51856\",\"end\":\"51931\"},{\"start\":\"52188\",\"end\":\"52251\"},{\"start\":\"52475\",\"end\":\"52541\"},{\"start\":\"52695\",\"end\":\"52776\"},{\"start\":\"53070\",\"end\":\"53175\"},{\"start\":\"53827\",\"end\":\"53871\"},{\"start\":\"54170\",\"end\":\"54239\"},{\"start\":\"54549\",\"end\":\"54571\"},{\"start\":\"54710\",\"end\":\"54770\"},{\"start\":\"54984\",\"end\":\"55015\"}]", "bib_author": "[{\"start\":\"43441\",\"end\":\"43448\"},{\"start\":\"43448\",\"end\":\"43454\"},{\"start\":\"43454\",\"end\":\"43460\"},{\"start\":\"43460\",\"end\":\"43467\"},{\"start\":\"43467\",\"end\":\"43474\"},{\"start\":\"43665\",\"end\":\"43677\"},{\"start\":\"43677\",\"end\":\"43691\"},{\"start\":\"43691\",\"end\":\"43705\"},{\"start\":\"43705\",\"end\":\"43713\"},{\"start\":\"43713\",\"end\":\"43726\"},{\"start\":\"44002\",\"end\":\"44016\"},{\"start\":\"44016\",\"end\":\"44028\"},{\"start\":\"44344\",\"end\":\"44353\"},{\"start\":\"44353\",\"end\":\"44361\"},{\"start\":\"44361\",\"end\":\"44368\"},{\"start\":\"44368\",\"end\":\"44380\"},{\"start\":\"44380\",\"end\":\"44390\"},{\"start\":\"44711\",\"end\":\"44719\"},{\"start\":\"44719\",\"end\":\"44727\"},{\"start\":\"44727\",\"end\":\"44733\"},{\"start\":\"44733\",\"end\":\"44742\"},{\"start\":\"44742\",\"end\":\"44757\"},{\"start\":\"45064\",\"end\":\"45071\"},{\"start\":\"45071\",\"end\":\"45077\"},{\"start\":\"45077\",\"end\":\"45089\"},{\"start\":\"45334\",\"end\":\"45341\"},{\"start\":\"45341\",\"end\":\"45347\"},{\"start\":\"45347\",\"end\":\"45354\"},{\"start\":\"45354\",\"end\":\"45360\"},{\"start\":\"45684\",\"end\":\"45691\"},{\"start\":\"45691\",\"end\":\"45698\"},{\"start\":\"45698\",\"end\":\"45706\"},{\"start\":\"45706\",\"end\":\"45714\"},{\"start\":\"45714\",\"end\":\"45721\"},{\"start\":\"46040\",\"end\":\"46047\"},{\"start\":\"46047\",\"end\":\"46055\"},{\"start\":\"46055\",\"end\":\"46067\"},{\"start\":\"46387\",\"end\":\"46393\"},{\"start\":\"46393\",\"end\":\"46404\"},{\"start\":\"46714\",\"end\":\"46722\"},{\"start\":\"46722\",\"end\":\"46728\"},{\"start\":\"46728\",\"end\":\"46735\"},{\"start\":\"46735\",\"end\":\"46741\"},{\"start\":\"46741\",\"end\":\"46749\"},{\"start\":\"46749\",\"end\":\"46757\"},{\"start\":\"47098\",\"end\":\"47105\"},{\"start\":\"47105\",\"end\":\"47118\"},{\"start\":\"47118\",\"end\":\"47125\"},{\"start\":\"47125\",\"end\":\"47132\"},{\"start\":\"47493\",\"end\":\"47507\"},{\"start\":\"47507\",\"end\":\"47520\"},{\"start\":\"47902\",\"end\":\"47913\"},{\"start\":\"47913\",\"end\":\"47924\"},{\"start\":\"47924\",\"end\":\"47935\"},{\"start\":\"48275\",\"end\":\"48288\"},{\"start\":\"48288\",\"end\":\"48295\"},{\"start\":\"48295\",\"end\":\"48301\"},{\"start\":\"48301\",\"end\":\"48308\"},{\"start\":\"48640\",\"end\":\"48647\"},{\"start\":\"48647\",\"end\":\"48662\"},{\"start\":\"48662\",\"end\":\"48670\"},{\"start\":\"48670\",\"end\":\"48682\"},{\"start\":\"48682\",\"end\":\"48689\"},{\"start\":\"49062\",\"end\":\"49070\"},{\"start\":\"49070\",\"end\":\"49076\"},{\"start\":\"49453\",\"end\":\"49462\"},{\"start\":\"49462\",\"end\":\"49477\"},{\"start\":\"49477\",\"end\":\"49489\"},{\"start\":\"49820\",\"end\":\"49833\"},{\"start\":\"49833\",\"end\":\"49843\"},{\"start\":\"49843\",\"end\":\"49857\"},{\"start\":\"49857\",\"end\":\"49873\"},{\"start\":\"49873\",\"end\":\"49884\"},{\"start\":\"50183\",\"end\":\"50191\"},{\"start\":\"50191\",\"end\":\"50202\"},{\"start\":\"50202\",\"end\":\"50215\"},{\"start\":\"50215\",\"end\":\"50229\"},{\"start\":\"50229\",\"end\":\"50239\"},{\"start\":\"50576\",\"end\":\"50591\"},{\"start\":\"50591\",\"end\":\"50598\"},{\"start\":\"50598\",\"end\":\"50608\"},{\"start\":\"50608\",\"end\":\"50617\"},{\"start\":\"50617\",\"end\":\"50624\"},{\"start\":\"50948\",\"end\":\"50954\"},{\"start\":\"50954\",\"end\":\"50966\"},{\"start\":\"50966\",\"end\":\"50973\"},{\"start\":\"51308\",\"end\":\"51318\"},{\"start\":\"51318\",\"end\":\"51325\"},{\"start\":\"51325\",\"end\":\"51335\"},{\"start\":\"51639\",\"end\":\"51647\"},{\"start\":\"51647\",\"end\":\"51656\"},{\"start\":\"51656\",\"end\":\"51664\"},{\"start\":\"51664\",\"end\":\"51671\"},{\"start\":\"51933\",\"end\":\"51946\"},{\"start\":\"51946\",\"end\":\"51957\"},{\"start\":\"51957\",\"end\":\"51969\"},{\"start\":\"51969\",\"end\":\"51976\"},{\"start\":\"52253\",\"end\":\"52267\"},{\"start\":\"52267\",\"end\":\"52280\"},{\"start\":\"52280\",\"end\":\"52292\"},{\"start\":\"52543\",\"end\":\"52553\"},{\"start\":\"52778\",\"end\":\"52792\"},{\"start\":\"52792\",\"end\":\"52798\"},{\"start\":\"52798\",\"end\":\"52811\"},{\"start\":\"52811\",\"end\":\"52825\"},{\"start\":\"53177\",\"end\":\"53186\"},{\"start\":\"53186\",\"end\":\"53199\"},{\"start\":\"53199\",\"end\":\"53207\"},{\"start\":\"53467\",\"end\":\"53478\"},{\"start\":\"53616\",\"end\":\"53632\"},{\"start\":\"53632\",\"end\":\"53642\"},{\"start\":\"53642\",\"end\":\"53655\"},{\"start\":\"53655\",\"end\":\"53665\"},{\"start\":\"53873\",\"end\":\"53879\"},{\"start\":\"53879\",\"end\":\"53888\"},{\"start\":\"53888\",\"end\":\"53895\"},{\"start\":\"53895\",\"end\":\"53902\"},{\"start\":\"54056\",\"end\":\"54070\"},{\"start\":\"54241\",\"end\":\"54251\"},{\"start\":\"54251\",\"end\":\"54265\"},{\"start\":\"54466\",\"end\":\"54477\"},{\"start\":\"54573\",\"end\":\"54583\"},{\"start\":\"54583\",\"end\":\"54593\"},{\"start\":\"54772\",\"end\":\"54778\"},{\"start\":\"55017\",\"end\":\"55028\"}]", "bib_venue": "[{\"start\":\"51688\",\"end\":\"51697\"},{\"start\":\"51995\",\"end\":\"52006\"},{\"start\":\"52309\",\"end\":\"52318\"},{\"start\":\"53680\",\"end\":\"53698\"},{\"start\":\"53919\",\"end\":\"53928\"},{\"start\":\"54816\",\"end\":\"54842\"},{\"start\":\"43474\",\"end\":\"43494\"},{\"start\":\"44028\",\"end\":\"44037\"},{\"start\":\"44390\",\"end\":\"44412\"},{\"start\":\"44757\",\"end\":\"44782\"},{\"start\":\"45089\",\"end\":\"45111\"},{\"start\":\"45360\",\"end\":\"45395\"},{\"start\":\"45721\",\"end\":\"45743\"},{\"start\":\"46067\",\"end\":\"46097\"},{\"start\":\"46404\",\"end\":\"46429\"},{\"start\":\"46757\",\"end\":\"46792\"},{\"start\":\"47132\",\"end\":\"47154\"},{\"start\":\"47520\",\"end\":\"47553\"},{\"start\":\"47935\",\"end\":\"47957\"},{\"start\":\"48308\",\"end\":\"48338\"},{\"start\":\"48689\",\"end\":\"48711\"},{\"start\":\"49076\",\"end\":\"49113\"},{\"start\":\"49489\",\"end\":\"49511\"},{\"start\":\"49884\",\"end\":\"49892\"},{\"start\":\"50239\",\"end\":\"50275\"},{\"start\":\"50624\",\"end\":\"50636\"},{\"start\":\"50973\",\"end\":\"50995\"},{\"start\":\"51335\",\"end\":\"51360\"},{\"start\":\"51671\",\"end\":\"51686\"},{\"start\":\"51976\",\"end\":\"51993\"},{\"start\":\"52292\",\"end\":\"52307\"},{\"start\":\"52553\",\"end\":\"52559\"},{\"start\":\"52825\",\"end\":\"52851\"},{\"start\":\"53207\",\"end\":\"53216\"},{\"start\":\"53418\",\"end\":\"53465\"},{\"start\":\"53665\",\"end\":\"53678\"},{\"start\":\"53902\",\"end\":\"53917\"},{\"start\":\"54265\",\"end\":\"54287\"},{\"start\":\"54459\",\"end\":\"54464\"},{\"start\":\"54593\",\"end\":\"54604\"},{\"start\":\"54778\",\"end\":\"54814\"},{\"start\":\"55028\",\"end\":\"55050\"}]"}}}, "year": 2023, "month": 12, "day": 17}