{"id": 21704927, "updated": "2023-11-07 23:21:28.251", "metadata": {"title": "Annotating Electronic Medical Records for Question Answering", "authors": "[{\"first\":\"Preethi\",\"last\":\"Raghavan\",\"middle\":[]},{\"first\":\"Siddharth\",\"last\":\"Patwardhan\",\"middle\":[]},{\"first\":\"Jennifer\",\"last\":\"Liang\",\"middle\":[\"J.\"]},{\"first\":\"Murthy\",\"last\":\"Devarakonda\",\"middle\":[\"V.\"]}]", "venue": "ArXiv", "journal": "ArXiv", "publication_date": {"year": 2018, "month": 5, "day": 17}, "abstract": "Our research is in the relatively unexplored area of question answering technologies for patient-specific questions over their electronic health records. A large dataset of human expert curated question and answer pairs is an important pre-requisite for developing, training and evaluating any question answering system that is powered by machine learning. In this paper, we describe a process for creating such a dataset of questions and answers. Our methodology is replicable, can be conducted by medical students as annotators, and results in high inter-annotator agreement (0.71 Cohen's kappa). Over the course of 11 months, 11 medical students followed our annotation methodology, resulting in a question answering dataset of 5696 questions over 71 patient records, of which 1747 questions have corresponding answers generated by the medical students.", "fields_of_study": "[\"Computer Science\"]", "external_ids": {"arxiv": "1805.06816", "mag": "2804581867", "acl": null, "pubmed": null, "pubmedcentral": null, "dblp": "journals/corr/abs-1805-06816", "doi": null}}, "content": {"source": {"pdf_hash": "a05e918b4dee1ac0f162f474959a8851b7f111b2", "pdf_src": "Arxiv", "pdf_uri": "[\"https://arxiv.org/pdf/1805.06816v1.pdf\"]", "oa_url_match": false, "oa_info": null}, "grobid": {"id": "5d321fddb4749af3b7fa427b4562bcc17a95f825", "type": "plain-text", "url": "s3://ai2-s2-pdf-extraction-prod/parse-results/s2orc_worker/a05e918b4dee1ac0f162f474959a8851b7f111b2.txt", "contents": "\nAnnotating Electronic Medical Records for Question Answering\n\n\nPhDPreethi Raghavan \nIBM T. J. Watson Research Center\nYorktown HeightsNYUSA\n\nPhDSiddharth Patwardhan \nIBM T. J. Watson Research Center\nYorktown HeightsNYUSA\n\nMDJennifer J Liang \nIBM T. J. Watson Research Center\nYorktown HeightsNYUSA\n\nPhDMurthy V Devarakonda \nIBM T. J. Watson Research Center\nYorktown HeightsNYUSA\n\nAnnotating Electronic Medical Records for Question Answering\n\nOur research is in the relatively unexplored area of question answering technologies for patient-specific questions over their electronic health records. A large dataset of human expert curated question and answer pairs is an important pre-requisite for developing, training and evaluating any question answering system that is powered by machine learning. In this paper, we describe a process for creating such a dataset of questions and answers. Our methodology is replicable, can be conducted by medical students as annotators, and results in high inter-annotator agreement (0.71 Cohen's κ). Over the course of 11 months, 11 medical students followed our annotation methodology, resulting in a question answering dataset of 5696 questions over 71 patient records, of which 1747 questions have corresponding answers generated by the medical students.\n\nIntroduction\n\nIn recent years, automatic question answering (QA) systems have made big strides in addressing many different types of question answering problems. IBM's Watson 1 successfully challenged human grand champions on a televised quiz show of Jeopardy! Similarly, systems have also been built for answering factoid questions from structured resources 2,3,4,5 , for answering questions about news stories 6 and even for handling 4 th grade science questions 7 . In the medical domain, similar systems 8,9 have been designed to answer questions on medical knowledge using resources such as MEDLINE abstracts, PubMed Central full-text articles, eMedicine documents, etc.\n\nPatient-specific QA from electronic medical records (EMRs), however, is a new and relatively unexplored problem in clinical natural language processing. The idea is for such a system to be available to physicians during patient visits, for instance, for easy access to information about the patient. A system that would automatically answer patient-specific questions by analyzing the patient's longitudinal medical records, including clinical narratives such as discharge summaries, progress notes, radiology reports as well as structured procedure, allergy and diagnoses lists, would be of immense value to medical professionals. Using such a system, a physician could get quick answers to questions such as\n\n\nHas this patient had a surgical procedure recently?\n\nWhat medications is the patient taking to control his hypertension?\n\nDoes she smoke?\n\nAnswers to these questions are facts about the patient that would be retrieved or inferred by the system from the patient's EMR.\n\nWe refer to this kind of QA as patient-specific QA, and, although this type of QA is also in the medical domain, it differs from previous QA research initiatives in at least two ways. First, the answers to these questions are not well known facts about the world, but are very specific facts about a specific patient. This typically requires searching for a particular word, phrase or passage in the patient EMR, with the evidence for that fact being localized to one small part of the EMR. Compare this with the factoid/trivia QA, where the fact, as well as the evidence for that fact can be found in many different parts of the underlying knowledge resources. The second major difference for patient specific QA is the lack of question-answer datasets required to train, develop and evaluate such systems.\n\nMost QA systems rely on machine learning technology that learn from training examples of question-answer pairs. To successfully train a machine-learning model for QA, we require the training questions to be realistic, and representative of questions that would be asked by a user of the system. For patient-specific QA, this requirement makes it especially challenging and expensive to obtain a set of such question-answer pairs. It is no easy task to automatically gather questions that a physician would ask about her patients during the course of her day. Furthermore, the correct answers to these questions are words, phrases or passages in the patient's EMR, and must be manually identified by a medical expert -again, no easy feat.\n\nIn this paper, we describe the creation of a dataset of manually curated question-answer pairs for patient-specific QA. We developed a process for generating questions that are likely to be asked by a physician in a real clinical setting, and we also defined a process for annotating corresponding answers from both structured and unstructured parts of the patient's EMR. The main contributions of this paper are as follows:\n\n(1) We outline a replicable annotation process, with minimal annotator bias, for generating questions similar to what a physician may want to ask about a patient.\n\n(2) We also outline a replicable annotation process for marking answers to the generated questions in the EMR, and then discuss the inter-annotator reliability and factors leading to annotator disagreement.\n\n(3) We present an analysis of the dataset created, as well as some limitations of our methodology.\n\n(4) Our methodology is replicable, can be conducted by medical students as annotators, and results in high inter-annotator agreement (0.71 Cohen's κ).\n\n(5) Eleven medical students created a question answering dataset of 5696 questions over 71 patient records following our annotation methodology. Of these questions, 1747 have corresponding answers generated by the same medical students. This data was created over a period of 11 months, but the work was conducted intermittently over this period.\n\nIn the following sections, we cover the related work from literature, a description of our methods, and our observations on the generated data set.\n\n\nRelated Work\n\nThere have been multiple studies that generate resources and build systems for biomedical question answering. 8,9,10,11 The common question types, semantic models of questions, as well as resources and systems available for biomedical question answering have been well-documented. 8,9 Current state-of-the-art biomedical QA systems primarily deal with medical questions that relate to patient-care but are not patient-specific. 8,9 Thus, the resources used to answer biomedical questions are typically MEDLINE abstracts, PubMed Central full-text articles, eMedicine documents, clinical guidelines and Wikipedia articles. In contrast, patient-specific questions are typically answered from the structured and unstructured resources in the EMR.\n\nEly et al. 11 developed a taxonomy of medical questions collected from primary care doctors in a clinical setting. 64 generic question types were used to classify 1396 clinical questions. The three common generic types were \"What is the drug of choice for condition x?\" \"What is the cause of symptom x?\" and \"What test is indicated in situation x?\" Some of the questions in this dataset have a patient-specific nature, for example \"Could this patient have condition x?\" and \"Could this patient have condition x?\" While this question set is used by multiple medical QA systems, these systems do not address the problem of answering patient-specific questions and hence do not gather answers to the patient-specific questions.\n\nClinicalQuestions or Clinques (http://clinques.nlm.nih.gov) is a question repository of 4654 questions maintained by the NLM that has questions collected from healthcare providers in clinical settings across the US. 11,12 Most biomedical QA systems either use the Clinques repository 13,14 of questions or create their own question set for manual evaluation by physicians. The MiPACQ 14 system narrowed the questions to those likely to be answered by the MEDPEDIA and excluded questions that required patient-specific knowledge. A few other datasets have also been created for biomedical QA through different question answering challenges. The BioASQ challenge 15 uses benchmark datasets of about 500 questions and gold-standard answers constructed by a team of biomedical experts from around Europe. The answers consist of relevant concepts from designated terminologies, articles, snippets, RDF triples from designated ontologies, exact answers and paragraph-sized summaries. Denmer-Fushman et al. 16 use the TREC 2007 genomics dataset to identify answers in the form of semantic relations between biomedical entities in questions and potential answer types.\n\nCommunity-shared annotated datasets for clinical NLP tasks have been developed as part of the i2b2 challenge 17 , CLEF 18 and SemEval 19 . However, there is no systematically developed resource of questions and answers available to develop a robust patient-specific question answering system.\n\n\nMethods: Annotation Process\n\nThe objective of the annotation task was to generate questions that physicians would ask of the EMR in a clinical setting. The answers to these questions, if found in the EMR, maybe be one or more phrases, passages. Annotated data is used to build, train and evaluate models for the EMR QA task. This implicitly assumes that the annotations represent the truth. However, this assumption can be violated in two ways: either because the annotators exhibit a certain bias, or because what is considered as truth may be subjective. We propose an annotation process for question answering on EMRs developed using de-identified medical records available to us through a research collaboration with Cleveland Clinic, that is aware of these problems and tries to address them to a large extent. The annotation task requires annotators with medical domain expertise. The annotators used in our EMR QA annotation process are medical students in their third or fourth year of training. The annotation process is divided into two stages i.e. question generation and answer generation.\n\n\nQuestion Generation\n\nThe question generation process is designed to generate questions that (1) minimize bias in question language, (2) are representative of what physicians would ask of a patient's EMR in a clinical setting, and (3) cover most common topics of interest to physicians.\n\nOne important concern is that the language in the EMR, when formulating a question, should not bias the annotators. This would lead to questions being worded in a manner that makes it easy to find the answer. For instance, if an annotator reads a clinical note that mentions \"the most recent colonoscopy was done in 2005\", this may prompt them to formulating the question \"when was the most recent colonoscopy done?\" Machine learning models trained to predict passage or answer relevance for a particular question learn predictive relationships based on patterns found in the training set. Given such biased data, the trained models are likely to perform poorly on questions generated in a real setting. We try to minimize this bias by not allowing the annotators to read through the entire EMR during question generation. Instead, they are presented with the following starting points:\n\n(1) The Watson Electronic Medical Record Analysis (EMRA) summarization user interface ( Figure 1). This is a dashboard that provides a view of automatically generated problem lists, structured medications, labs, procedures, and a view of clinical notes over time. 20,21 (2) The latest clinical note or any well formed clinical note (that has a reason for visit, assessment and plan). During review of Watson EMRA summarization, the annotators ask questions that get trigged based on the information they see i.e. problem list, medications, vitals etc. For the latest clinical note, the annotators ask questions that get trigged based on what they read. If the note presented to them does not trigger many questions, they may pick another well-formed note. In both cases, the questions need not be about the medical entities present on the summarization UI or in the note reviewed, but any question that occurs to the annotator based on what they read review. These starting points for generating questions were meant to simulate what physicians might ask at the point-of-care, where they may review a cover page or the patient's most recent progress note to get a quick summary of the patient prior to the patient encounter ( Figure 2). Thus, the annotators are given the following instructions:\n\n\"Imagine yourself as a clinician about to see a patient. As preparation for the upcoming visit, you review the patient's information by viewing either Watson EMRA Summarization or the patient's last informative note. What are some questions you would like to ask on the patient's EMR to help you in preparing for this visit?\"\nFigure 2.\nOverview of annotation process for question and answer generation.\n\nGenerated questions were captured using a spreadsheet template provided to the annotators that includes the following fields: EMR ID, question ID, generated question, the specific context that triggered the question (e.g. \"Blood pressure 149/93\") and the origin or source of that context (i.e. panel within summarization or note ID of last informative note reviewed).\n\nTo ensure that the questions generated would be representative of the topics most of interest to physicians, we (1) provide to the annotators a list of the general types of questions asked by physicians on EMRs, and (2) include standard questions on common topics that were asked on every patient EMR (Table 1).  We extracted the lists of question types and standard questions from a set of questions asked by physicians at the Veterans Hospital Administration (VA) on patient medical records. This data was provided to us through a research collaboration agreement with VA, and was used as a starting point to understand the different types of questions that are asked by physicians in a real clinical setting. We have approximately 976 questions from the VA.\n\nQuestions are required to be complete sentences, self-contained and potentially answerable on EMR content alone. Note that questions are required to only be potentially answerable; this means that the answer to these questions may or may not be found in the EMR, a quality that reflects those questions asked in real-world clinical settings.\n\nGiven this annotation process, each annotator is able to generate 10 to 20 questions for a single EMR in one hour. We have generated a total of 5696 questions over 71 patient records so far using this process, 2492 of which have been analyzed and the results discussed later in this paper.\n\n\nAnswer Generation\n\nGiven a set of questions paired with EMRs generated in the question generation phase, the annotators then annotate answers to those questions within the context of each clinical note (Figure 2). We describe here our final annotation process converged on after multiple pilot annotation tasks. This process generates a consistent and complete answer set for each question with good inter-annotator agreement (IAA), and records the context of the marked answer within the scope of the full note. For now, this process has only been applied for generating answers on unstructured notes. Ongoing work involves extending this process to generate answers on structured data within the EMR.\n\nAnnotations for answer generation were completed using the brat rapid annotation tool (brat), which supports text span annotations within documents as named entities. 22 To adapt this tool for our purposes, for each EMR, all clinical notes were ordered chronologically and loaded into brat, and annotators were provided with a list of questions to be answered with corresponding Question IDs. The Question IDs are used in brat to represent questions to be answered on that same EMR. Questions are answered by a different annotator than the ones who generated the questions to eliminate any bias from previous review of the EMR during the question generation process. Figure 3 shows the brat user interface used by annotators to record answers to questions. At the time when this screenshot was captured, the annotator has already marked two spans of text \"diabetes for the last 10 years\" and \"diabetic for the last 10 years\" as answers Question ID Q05 (\"How long has he had diabetes?\"), and is in the process of annotating a new span \"home medications include insulin\" as the answer to Question ID Q06 (\"Has the patient ever taken insulin for their diabetes?\"). With this setup, an annotator performs a note-by-note review of the entire EMR and annotates any text spans that answer a question with the corresponding entity. A note-by-note review ensures completeness of the annotations so that no answers are missed. If the annotated span does not reflect the final answer to a question and requires some inference to come to the answer, a free-text Notes field allows the annotator to enter the final answer to the question. This is most frequently found in yes/no type questions, but may apply to other types of questions as well.\n\nAs questions with temporal qualifiers are difficult to answer before having reviewed the entire EMR, annotators were asked to disregard temporal qualifiers while annotating answers during this note-by-note review within brat. So \"What are the results of his colonoscopy?\" and \"What are the results of his last colonoscopy?\" would have the same spans annotated as answers. For any questions with temporal qualifiers, a separate pass on the spans annotated as answers would be required to determine the final answer.\n\n\nResults and Discussion\n\n\nQuestion Generation: Analysis of dataset\n\nOut of the total 5696 questions generated, for a subset of 2492 questions, we studied the distribution of questions generated using different contextual triggers i.e. various medical concepts that triggered that specific question in the last informative note, standard questions or the summarization UI. The most frequent context triggers along with their counts are shown is shown in Table 2. The summarization contextual triggers like problems, orders, medications etc. are displayed on different panels of the summarization UI shown in Figure 1. We also analyzed the types of questions from the subset of 2492 questions (Figure 4). While there could be many more question types, we have identified a handful of types that help us make sense of the generated questions from a question analysis and answer generation perspective. A question may occur across multiple types.\n\nTemporal: This question type includes \"when\" questions, questions with temporal qualifiers like \"current\", \"previous\", \"next\", \"last\" (and their inflections) and duration-based questions. Since patient records are longitudinal in nature, the large number of temporal questions is not surprising. In analyzing this type of question, it is important to understand dependencies between temporal keywords and medical concepts in the question. For instance, in the question, \"Has the patient had a previous MI?\" we should identify previous as a temporal qualifier applied to the medical concept MI (myocardial infarction).\n\n\nFigure 4. Question type distribution\n\nPresence/Absence: Questions in this type need confirmation of the presence or absence of a problem, test or procedure. While these questions may appear to be like the factoid \"yes/no\" style questions, the expected answer for these questions goes beyond a simple \"yes\" or \"no\". When a physician asks \"Did the patient have a colonoscopy?\" not only may he want to ascertain that the procedure happened, but also find out about when and where it happened, along with the outcome of the procedure.\n\n\nMedications, Tests, Procedures:\n\nMedication questions typically ask about the medications taken by the patient for a particular problem (both currently and in the past), allergic reactions to specific medications, when a medication was started or stopped. A few of them also ask for the \"reason\" why the patient is on a particular medication. These questions also get classified under the \"reason\" question type. Question analysis on medication type questions like \"What medications has the patient tried for hypertension in the past?\" needs to identify the medical concepts (hypertension) on which the medication relation (mediations for) is to be applied. We also need to account for the temporal aspect in the question by applying the temporal relation (in the past) to the results of the medication relation. In case of labs and procedures, the questions tend to ask if a particular test/procedure was done, when and why it was done, and the results of the test or procedure. Similar to the medications type, the questions in this type could have temporal or reason type characteristics.\n\nOther more infrequent question types (some of which overlap with many of the previous types like temporal, medications, tests/procedures) include \"Past Medical History\" that consists of questions asking about problems that have occurred in the patient's history and \"Problem Nature\" that discusses the severity, recurrence and status of the problem. Another type \"Location\" has questions about the location of a problem in the patient's body. Instances of the \"Reason\" question type were seen in the medications, tests and procedures type. Finally, the \"Relational\" question type has multiple medical concepts that have to be considered in relationship with each other to answer the question correctly. For instance, in the question, \"Is the patient's pain due to generalized osteoarthritis wellcontrolled with medication?\" we need to correlate the pain caused by the problem of generalized osteoarthritis with the its corresponding medication. This category of questions, though infrequent in our dataset, can be of high value to the physician because even with several clicks in an EHR system, the physician may be unable to make this correlation without pulling out multiple pieces of information and analyzing them in conjunction with each other.\n\nAnother characteristic of the questions generated in the annotation process is that they are mostly fact-based i.e. the answer is understood to exist somewhere in the EMR (although this may not always be true), and the questions seek to unravel those answers buried in the unstructured and structured resources in the EMR. An important category of questions is based on what is not observed in the EMR. For example, when a physician observes a patient who has a myocardial infarction but is not on any ACE inhibitors, he may ask \"Why is the patient not on ACE inhibitors?\" The answer may be that the patient is allergic to that category of medications or has experienced some adverse effect in the past due to ACE inhibitors, or the answer may not be apparent from any related information found in the EMR. Generating more of these types of questions may require some tweaks to our annotation process such as encouraging annotators to also think about patient questions based on what is missing from the EMR. Incorporating this aspect into our annotation is something we intend to do in future iterations of our annotation task.\n\n\nAnswer Generation: Development of annotation process and inter-annotator agreement\n\nTo arrive at the answer generation process described previously, a total of five pilots were conducted to hone various aspects of the annotation process. For each pilot, 3 EMRs with approximately 40 questions each was double annotated, then reviewed for reconciliation, and a post-pilot discussion was held with researchers and annotators together to explore issues that arose during the pilot. Inter-annotator agreement was also computed at the end of each pilot to enable us to develop a more robust annotation process that minimizes annotator-bias and enforces consistency in answering questions.\n\nOur initial pilot mimicked the natural process of finding an answer to a question, where given a question, an individual browses and/or searches through the EMR to find the answer. With this as our starting point, we found in our earlier pilots that there were essentially two types of disagreements: (1) actual disagreements due to differences in what is considered an answer and (2) apparent disagreements that were simply answers overlooked by one of the two annotators due to differences in their method of searching and navigating through EMRs.\n\nTwo examples of the first type of disagreement are listed below:\n\n(1) For questions asking whether a concept was present in the patient (e.g. \"Does the patient use a CPAP machine?\"), one annotator considered the absence of a concept to indicate negation -and therefore an answer, while another annotator did not -instead considering this as a question with no answer.\n\n(2) For questions asking about the existence of a disease in the patient, one annotator considered the disease to be present if the findings needed to meet the criteria for the diagnosis were available and consistent with the diagnosis (e.g. considering two elevated blood pressure readings taken weeks apart to indicate a diagnosis of hypertension), while another annotator considered only those diagnoses that were explicitly stated within the medical record as answers.\n\nSubsequent pilots implemented guideline changes to clearly define what constitutes an answer, and annotation process and tooling changes to minimize overlooked answers and reduce annotation time per EMR. Table 3 summarizes the lessons learned and adjustments made with each pilot, along with IAA calculated at each stage. The reported IAA is pre reconciliation and at the answer note ID level. Annotators assigned so that the person answering the question is different from the person who generated the question.\n\nObserved two types of disagreement: (1) true disagreements due to differences in judgment, and (2) apparent disagreements due to answers missed by annotator during annotation process.\n\n\n0.54\n\nPilot 3 Spreadsheet Implemented process changes to reduce \"false\" disagreements.\n\nSlight improvement in IAA with process changes, but still observing missed answers.\n\n\n0.63\n\n\nPilot 4 IBM Human Annotation Tool\n\nSwitched to note-by-note review to ensure completeness of annotations.\n\nMoved to using IBM Human Annotation Tool for annotation to facilitate note-by-note review.\n\nA note-by-note review increased IAA and reduced annotation time by more than half.\n\nPresence of annotation errors due to difficulties in (1) viewing annotations when a span of text is annotated more than once, and (2) reviewing annotations when correction is needed.\n\n\n0.71\n\nPilot 5 Brat rapid annotation tool 22 Moved to using brat, which allows for easier visualization of multiple overlapping annotations, and has a search function to locate specific text or previously annotated spans.\n\nConverted to single annotator annotations because relatively good IAA with note-by-note review.\n\nGeneral positive feedback from annotators.\n\nCompletion of pilot process.\n\n\nn/a\n\nGenerated answers can be broadly categorized by (1) if the answer is expressed as a fact from the patient record or requires one or more paragraphs of explanation, and (2) if the answer is explicitly stated or requires inference.\n\nAnswers that consist of facts usually correspond to Location or Presence/Absence questions, as well as a subset of Temporal questions that ask for a specific time or date (for e.g., \"when\" questions); while answers that involve paragraphs of explanation are mostly Problem Nature or Reason questions (e.g. \"why\" questions, \"what was the cause of x?\"). Questions on Medications, Tests, and Procedures vary depending on the specific information requested; questions on whether a test was done usually have answers expressed as facts, while questions on why a test was done or the results of a test may require a paragraph as an answer.\n\nAnswers that require inference can be further separated into common-sense logical inferences that are made using general knowledge, and those inferences that require domain-specific knowledge. For example, the question \"Is his hoarseness caused by the thyroid surgery?\" can be answered as \"No\" if there is documentation of hoarseness in the patient prior to thyroid surgery. This is an inference that can be made without domain-specific knowledge. This is in contrast with the following example. For the question \"Does the patient have diabetes?\", documentation of the patient being prescribed the medication metformin would be annotated as an answer, considering that this medication is specifically used for treatment of diabetes so would only be prescribed if the patient has this problem. This is an inference that requires medical knowledge.\n\nExamples of different types of answers are shown in Table 4. Differentiating between these types of answers becomes necessary as we move ahead with developing a questionanswering system on EMRs and evaluating our performance for these various types of question-answer pairs.\n\n\nLimitations\n\nWe summarize some of the limitations of our annotation process and the reasons behind them.\n\n(1) Questions are required to be complete sentences. A question expressed as \"When was the last colonoscopy?\" tells us that the physician specifically wants to know when the last colonoscopy was performed, whereas an incomplete query like \"last colonoscopy\" could mean that the physician may want to know \"when\", \"where\" or the \"results\" of the procedure. However, in a real clinical setting, a physician may prefer entering short phrases or keywords (which may be more appropriate for traditional keywordbased search) instead of complete sentences. (2) Questions are required to be self-contained. The \"context\" information used to generate questions is not used for answer generation. (3) Questions are potentially answerable on EMR content alone. Some questions like \"Does the patient have any neurological symptoms?\" may require information from both the EMR as well as external medical resources to provide a complete answer. We do not generate such questions. (4) Brat allows us to only view a single clinical note at a time. Thus, it does not support the annotation of cross-document relations and restricts the marking of related answer spans to a single note. While there may be ways to work around this, annotating relations across a longitudinal EMR is a very tedious task. (5) Simulated clinical setting. Medical student annotators simulate the process of a physician asking patientspecific questions in a real setting where he is treating a patient. In this simulated setting, the students may lack the relevant context to generate certain complex questions.\n\n\nConclusions\n\nWe have defined a replicable methodology for generating a question and answer dataset for the relatively unexplored problem of patient-specific QA over EMRs. The annotation task was conducted using medical student annotators. The question generation process minimizes annotator bias, while simulating a physician asking questions in a real clinical setting. The answer generation process identifies appropriate phrases, passages or notes based on the question type and how the answer is expressed in the EMR. Using this methodology, we generate a dataset of 5969 questions and 1747 answers. Our results show how different types of questions and answers may be generated with high inter-annotator agreement. Our analysis of the QA dataset provides insights into tackling the patientspecific QA task. We plan to release our question set, along with question type analysis, to encourage community participation in question analysis for patient-specific QA.\n\nFigure 1 .\n1Screenshot of Watson EMRA summarization UI.\n\nFigure 3 .\n3Brat user interface used to annotate answers within a clinical note.\n\nTable 1 .\n1List of common question topics and their counts within the VA Dataset of 976 questions, along with the standard questions added to our dataset to be asked on all patient EMRs.\n\n\nCommon Topic Count in VA Dataset Standard QuestionWhat are the results of the last echocardiogram?Colonoscopy \n46 \nWhen was the last colonoscopy? \n\nWhat were the results of the last colonoscopy? \n\nEchocardiogram \n25 \nHas the patient had an echocardiogram? \n\nPap smear \n13 \nWhen was the last pap smear? \n\nMammogram \n12 \nWhen was the last mammogram? \n\nAntihypertensives 12 \nWhat antihypertensives has the patient tried? \n\nAntidepressants \n11 \nWhat antidepressants has the patient been tried on? \n\nSubstance Abuse 15 \nDoes the patient have history of substance abuse? \n\nSmoking \n8 \nWhen did the patient quit smoking? \n\n\n\nTable 2 .\n2Examples of generated questions along with the corresponding context trigger.Context -Source \nCount Example Context \nExample Questions \n\nLast informative note 914 \nPast Medical History of -11-2206 \n(vasculopothy/OCP induced) \n\nDoes the patient have a family history of \nblood disorder? \n\nStandard questions \n475 \nWhat antihypertensives has the patient \ntried? \nSummarization-\nProblems \n\n680 \nHyperlipidemia \nWhen was the patient's last lipid panel \nperformed? \nSummarization-\nOrders \n\n111 \ndilated fundus exam \nHas there been a systematic increase in \nthis patient's urine microalbuminuria? \nSummarization-\nMedications \n\n76 \nbaclofen \nHow long has the patient been on \nbaclofen? \nSummarization-\nDemographics \n\n58 \n64 year old Female \nWhen was the patient's last mammogram? \n\nSummarization-Labs 36 \nCA 125 bld \nWhy was a cancer antigen, ca-125 test \nperformed? \nSummarization-\nAllergies \n\n23 \nepinephrine \nWhat kind of reaction does the patient \nhave to epinephrine? \n\n\n\nTable 3 .\n3Overview of pilots conducted for answer generation. Cohen's Kappa was used to measure inter-annotator agreement.Pilot \nTooling \nChanges implemented in this pilot Lessons learned from this pilot Kappa \n\nPilot 1 Spreadsheet \nn/a \nConfusion regarding what \nconstitutes an answer. \n\nBias observed when annotator \nwho generated the question also \nanswered the question. \n\n0.36 \n\nPilot 2 Spreadsheet \nGuidelines revised to clarify what \nshould be considered as an answer. \n\n\n\nTable 4 .\n4Sample question-answer pairs.Question \nAnswer Passage \nAnswer \nAnswer \nType \n\nInference \nRequired \n\nWhy does the \npatient take \ntrazodone? \n\n5. 780.52 Insomnia \n\n-TRAZODONE 50 MG TABLET \n\nInsomnia \nFact \nNone \n\nDoes the patient \ncurrently smoke? \n\nTobacco Use: Quit Packs/Day: .5 \nYears: 1.5 \n\nNo \nFact \nLogical \n\nHas the patient \never been \npregnant? \n\nThis is a 40 year old G8P3325 who \npresents for her annual gynecologic \nexam. \n\nYes \nFact \nMedical \n\nWhat were the \nresults of the \npatient's most \nrecent \nechocardiogram? \n\nLABORATORY DATA PRIOR TO \nADMISSION Included normal \nechocardiogram with mild pulmonic \nvalve insufficiency and moderate \nleft ventricular hypertrophy. \n\nnormal echocardiogram \nwith mild pulmonic \nvalve insufficiency and \nmoderate left \nventricular hypertrophy \n\nParagraph \nNone \n\n\n\nBuilding Watson: an overview of the DeepQA project. D Ferrucci, E Brown, J Chu-Carroll, Fan J Gondek, D Kalyanpur, A , AI Magazine. 313Ferrucci D, Brown E, Chu-Carroll J, Fan J, Gondek D, Kalyanpur A, et al. Building Watson: an overview of the DeepQA project. AI Magazine. 31(3):59-79, Fall 2010.\n\nScaling semantic parsers with on-the-fly ontology matching. T Kwiatkowski, E Choi, Y Artzi, L Zettlemoyer, Proc. of EMNLP. of EMNLPSeattle, WAKwiatkowski T, Choi E, Artzi Y, Zettlemoyer L. Scaling semantic parsers with on-the-fly ontology matching. Proc. of EMNLP, Seattle, WA, October 2013.\n\nInformation extraction over structured data: question answering with Freebase. X Yao, B Van Durme, Proc. of ACL. of ACLBaltimore, MDYao X, Van Durme B. Information extraction over structured data: question answering with Freebase. Proc. of ACL, Baltimore, MD, June 2014.\n\nSemantic parsing on Freebase from question-answer pairs. J Berant, A Chou, R Frostig, P Liang, Proc. of EMNLP. of EMNLPSeattle, WABerant J, Chou A, Frostig R, Liang P. Semantic parsing on Freebase from question-answer pairs. Proc. of EMNLP, Seattle, WA, October 2013.\n\nSemantic parsing via paraphrasing. J Berant, P Liang, Proceedings of ACLBerant J, Liang P. Semantic parsing via paraphrasing. Proceedings of ACL; 2014 Jun;\n\n. M D Baltimore, Baltimore, MD.\n\nTeaching machines to read and comprehend. NIPS. K M Hermann, T Kocisky, E Grefenstette, L Espeholt, W Kay, M Suleyman, Hermann KM, Kocisky T, Grefenstette E, Espeholt L, Kay W, Suleyman M, et al. Teaching machines to read and comprehend. NIPS; 2015 Dec;\n\n. Canada Montreal, Montreal, Canada: pages 1684-1692.\n\nCombining retrieval, statistics, and inference to answer elementary science questions. P Clark, O Etzioni, T Khot, A Sabharwal, O Tafjord, P Turney, Proc. of AAAI. of AAAIPatras, GreeceClark P, Etzioni O, Khot T, Sabharwal A, Tafjord O, Turney P, et al. Combining retrieval, statistics, and inference to answer elementary science questions. Proc. of AAAI, pages 313-317, Patras, Greece, July 2008.\n\nQuestion answering in biomedicine. P Zweigenbaum, Proceedings Workshop on Natural Language Processing for Question Answering, EACL. Workshop on Natural Language Processing for Question Answering, EACLZweigenbaum P. Question answering in biomedicine. In Proceedings Workshop on Natural Language Processing for Question Answering, EACL 2003 Apr 14 (Vol. 2005, pp. 1-4).\n\nBiomedical question answering: a survey. Computer methods and programs in biomedicine. S J Athenikos, H Han, 99Athenikos SJ, Han H. Biomedical question answering: a survey. Computer methods and programs in biomedicine. 2010 Jul 31; 99(1):1-24.\n\nInformation needs in office practice: are they being met?. D G Covell, G C Uman, P R Manning, Ann Intern Med. 1034Covell DG, Uman GC, Manning PR. Information needs in office practice: are they being met? Ann Intern Med. 1985 Oct 1;103(4):596-9.\n\nAnalysis of questions asked by family doctors regarding patient care. J W Ely, J A Osheroff, M H Ebell, G R Bergus, B T Levy, M L Chambliss, BMJ. 3197206Ely JW, Osheroff JA, Ebell MH, Bergus GR, Levy BT, Chambliss ML, et al. Analysis of questions asked by family doctors regarding patient care. BMJ. 1999 Aug 7;319(7206):358-61.\n\nAn evaluation of information-seeking behaviors of general pediatricians. D M D&apos;alessandro, C D Kreiter, M W Peterson, Pediatrics. 1131D'Alessandro DM, Kreiter CD, Peterson MW. An evaluation of information-seeking behaviors of general pediatricians. Pediatrics. 2004 Jan 1;113(1):64-9.\n\nAskHERMES: An online question answering system for complex clinical questions. JBI. Y Cao, F Liu, P Simpson, L Antieau, A Bennett, J J Cimino, 44Cao Y, Liu F, Simpson P, Antieau L, Bennett A, Cimino JJ, et al. AskHERMES: An online question answering system for complex clinical questions. JBI. 2011 Apr 30;44(2):277-88.\n\nThe MiPACQ clinical question answering system. B L Cairns, R D Nielsen, J J Masanz, J H Martin, M S Palmer, W H Ward, Proc. AMIA Symp. Oct. AMIA Symp. Oct2011Cairns BL, Nielsen RD, Masanz JJ, Martin JH, Palmer MS, Ward WH, et al. The MiPACQ clinical question answering system. Proc. AMIA Symp. Oct (Vol. 2011, pp. 171-80).\n\nA Challenge on Large-Scale Biomedical Semantic Indexing and Question Answering. G Tsatsaronis, M Schroeder, G Paliouras, Y Almirantis, I Androutsopoulos, E Gaussier, AAAI fall symposium: Information retrieval and knowledge discovery in biomedical text. Tsatsaronis G, Schroeder M, Paliouras G, Almirantis Y, Androutsopoulos I, Gaussier E, et al. BioASQ: A Challenge on Large-Scale Biomedical Semantic Indexing and Question Answering. In AAAI fall symposium: Information retrieval and knowledge discovery in biomedical text 2012 Nov 2.\n\nAnswer extraction, semantic clustering, and extractive summarization for clinical question answering. D Demner-Fushman, J Lin, Proc. of ACL. of ACLDemner-Fushman D, Lin J. Answer extraction, semantic clustering, and extractive summarization for clinical question answering. Proc. of ACL; 2006 Jul 17; (pp. 841-848).\n\n2010 i2b2/VA challenge on concepts, assertions, and relations in clinical text. Ö Uzuner, B R South, S Shen, S L Duvall, JAMIA. 185Uzuner Ö, South BR, Shen S, DuVall SL. 2010 i2b2/VA challenge on concepts, assertions, and relations in clinical text. JAMIA. 2011 Sep 1;18(5):552-6.\n\nThe CLEF corpus: semantic annotation of clinical text. A Roberts, R Gaizauskas, M Hepple, N Davis, G Demetriou, Y Guo, Proc. AMIA Symp. Roberts A, Gaizauskas R, Hepple M, Davis N, Demetriou G, Guo Y, et al. The CLEF corpus: semantic annotation of clinical text. Proc. AMIA Symp.; 2007; Chicago, IL. p. 625-9.\n\nSemeval-2014 task 7: Analysis of clinical text. SemEval. S Pradhan, N Elhadad, W Chapman, S Manandhar, G Savova, 19954Pradhan S, Elhadad N, Chapman W, Manandhar S, Savova G. Semeval-2014 task 7: Analysis of clinical text. SemEval. 2014 Aug 23; 199(99):54.\n\nProblem-oriented patient record summary: an early report on a Watson application. M Devarakonda, D Zhang, C-H Tsou, M Bornea, IEEE HealthCom. Devarakonda M, Zhang D, Tsou C-H, Bornea M. Problem-oriented patient record summary: an early report on a Watson application. IEEE HealthCom; 2014 Oct; Natal, Brazil. p. 281-286.\n\nAutomated problem list generation from electronic medical records in IBM Watson. AAAI Winter Conference -IAAI Track. M Devarakonda, C-H Tsou, Devarakonda M, Tsou C-H. Automated problem list generation from electronic medical records in IBM Watson. AAAI Winter Conference -IAAI Track; 2015 Jan;\n\n. T X Austin, Austin, TX.\n\nbrat: a web-based tool for NLP-assisted text annotation. P Stenetorp, S Pyysalo, G Topić, T Ohta, S Ananiadou, J Tsujii, Proc. of the Demonstrations Session at EACL. of the Demonstrations Session at EACLStenetorp P, Pyysalo S, Topić G, Ohta T, Ananiadou S, Tsujii J. brat: a web-based tool for NLP-assisted text annotation. Proc. of the Demonstrations Session at EACL 2012.\n", "annotations": {"author": "[{\"end\":140,\"start\":64},{\"end\":221,\"start\":141},{\"end\":297,\"start\":222},{\"end\":378,\"start\":298}]", "publisher": null, "author_last_name": "[{\"end\":83,\"start\":75},{\"end\":164,\"start\":154},{\"end\":240,\"start\":235},{\"end\":321,\"start\":310}]", "author_first_name": "[{\"end\":74,\"start\":67},{\"end\":153,\"start\":144},{\"end\":232,\"start\":224},{\"end\":234,\"start\":233},{\"end\":307,\"start\":301},{\"end\":309,\"start\":308}]", "author_affiliation": "[{\"end\":139,\"start\":85},{\"end\":220,\"start\":166},{\"end\":296,\"start\":242},{\"end\":377,\"start\":323}]", "title": "[{\"end\":61,\"start\":1},{\"end\":439,\"start\":379}]", "venue": null, "abstract": "[{\"end\":1293,\"start\":441}]", "bib_ref": "[{\"attributes\":{\"ref_id\":\"b1\"},\"end\":1656,\"start\":1654},{\"attributes\":{\"ref_id\":\"b2\"},\"end\":1658,\"start\":1656},{\"attributes\":{\"ref_id\":\"b3\"},\"end\":1660,\"start\":1658},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":1661,\"start\":1660},{\"attributes\":{\"ref_id\":\"b6\"},\"end\":1708,\"start\":1707},{\"attributes\":{\"ref_id\":\"b8\"},\"end\":1761,\"start\":1760},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":1805,\"start\":1803},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":1806,\"start\":1805},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":6175,\"start\":6173},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":6177,\"start\":6175},{\"attributes\":{\"ref_id\":\"b11\"},\"end\":6180,\"start\":6177},{\"attributes\":{\"ref_id\":\"b12\"},\"end\":6182,\"start\":6180},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":6346,\"start\":6344},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":6347,\"start\":6346},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":6493,\"start\":6491},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":6494,\"start\":6493},{\"attributes\":{\"ref_id\":\"b12\"},\"end\":6820,\"start\":6818},{\"attributes\":{\"ref_id\":\"b12\"},\"end\":7752,\"start\":7749},{\"attributes\":{\"ref_id\":\"b13\"},\"end\":7754,\"start\":7752},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":7820,\"start\":7817},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":7822,\"start\":7820},{\"attributes\":{\"ref_id\":\"b16\"},\"end\":8196,\"start\":8194},{\"attributes\":{\"ref_id\":\"b17\"},\"end\":8535,\"start\":8533},{\"attributes\":{\"ref_id\":\"b19\"},\"end\":8816,\"start\":8814},{\"attributes\":{\"ref_id\":\"b20\"},\"end\":8831,\"start\":8829},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":10229,\"start\":10226},{\"attributes\":{\"ref_id\":\"b21\"},\"end\":11536,\"start\":11533},{\"attributes\":{\"ref_id\":\"b22\"},\"end\":11538,\"start\":11536},{\"attributes\":{\"ref_id\":\"b24\"},\"end\":15609,\"start\":15607},{\"attributes\":{\"ref_id\":\"b24\"},\"end\":26734,\"start\":26732}]", "figure": "[{\"attributes\":{\"id\":\"fig_0\"},\"end\":31784,\"start\":31728},{\"attributes\":{\"id\":\"fig_1\"},\"end\":31866,\"start\":31785},{\"attributes\":{\"id\":\"tab_0\",\"type\":\"table\"},\"end\":32054,\"start\":31867},{\"attributes\":{\"id\":\"tab_1\",\"type\":\"table\"},\"end\":32673,\"start\":32055},{\"attributes\":{\"id\":\"tab_2\",\"type\":\"table\"},\"end\":33654,\"start\":32674},{\"attributes\":{\"id\":\"tab_3\",\"type\":\"table\"},\"end\":34135,\"start\":33655},{\"attributes\":{\"id\":\"tab_4\",\"type\":\"table\"},\"end\":34957,\"start\":34136}]", "paragraph": "[{\"end\":1970,\"start\":1309},{\"end\":2681,\"start\":1972},{\"end\":2804,\"start\":2737},{\"end\":2821,\"start\":2806},{\"end\":2951,\"start\":2823},{\"end\":3760,\"start\":2953},{\"end\":4499,\"start\":3762},{\"end\":4925,\"start\":4501},{\"end\":5089,\"start\":4927},{\"end\":5297,\"start\":5091},{\"end\":5397,\"start\":5299},{\"end\":5549,\"start\":5399},{\"end\":5897,\"start\":5551},{\"end\":6046,\"start\":5899},{\"end\":6805,\"start\":6063},{\"end\":7531,\"start\":6807},{\"end\":8693,\"start\":7533},{\"end\":8987,\"start\":8695},{\"end\":10091,\"start\":9019},{\"end\":10379,\"start\":10115},{\"end\":11267,\"start\":10381},{\"end\":12564,\"start\":11269},{\"end\":12891,\"start\":12566},{\"end\":12968,\"start\":12902},{\"end\":13337,\"start\":12970},{\"end\":14099,\"start\":13339},{\"end\":14442,\"start\":14101},{\"end\":14733,\"start\":14444},{\"end\":15438,\"start\":14755},{\"end\":17172,\"start\":15440},{\"end\":17688,\"start\":17174},{\"end\":18632,\"start\":17758},{\"end\":19251,\"start\":18634},{\"end\":19784,\"start\":19292},{\"end\":20878,\"start\":19820},{\"end\":22130,\"start\":20880},{\"end\":23260,\"start\":22132},{\"end\":23946,\"start\":23347},{\"end\":24497,\"start\":23948},{\"end\":24563,\"start\":24499},{\"end\":24866,\"start\":24565},{\"end\":25340,\"start\":24868},{\"end\":25854,\"start\":25342},{\"end\":26039,\"start\":25856},{\"end\":26128,\"start\":26048},{\"end\":26213,\"start\":26130},{\"end\":26328,\"start\":26258},{\"end\":26420,\"start\":26330},{\"end\":26504,\"start\":26422},{\"end\":26688,\"start\":26506},{\"end\":26911,\"start\":26697},{\"end\":27008,\"start\":26913},{\"end\":27052,\"start\":27010},{\"end\":27082,\"start\":27054},{\"end\":27319,\"start\":27090},{\"end\":27954,\"start\":27321},{\"end\":28802,\"start\":27956},{\"end\":29078,\"start\":28804},{\"end\":29185,\"start\":29094},{\"end\":30758,\"start\":29187},{\"end\":31727,\"start\":30774}]", "formula": "[{\"attributes\":{\"id\":\"formula_0\"},\"end\":12901,\"start\":12892}]", "table_ref": "[{\"attributes\":{\"ref_id\":\"tab_0\"},\"end\":13649,\"start\":13640},{\"attributes\":{\"ref_id\":\"tab_2\"},\"end\":18150,\"start\":18143},{\"attributes\":{\"ref_id\":\"tab_3\"},\"end\":25553,\"start\":25546},{\"attributes\":{\"ref_id\":\"tab_4\"},\"end\":28863,\"start\":28856}]", "section_header": "[{\"end\":1307,\"start\":1295},{\"end\":2735,\"start\":2684},{\"end\":6061,\"start\":6049},{\"end\":9017,\"start\":8990},{\"end\":10113,\"start\":10094},{\"end\":14753,\"start\":14736},{\"end\":17713,\"start\":17691},{\"end\":17756,\"start\":17716},{\"end\":19290,\"start\":19254},{\"end\":19818,\"start\":19787},{\"end\":23345,\"start\":23263},{\"end\":26046,\"start\":26042},{\"end\":26220,\"start\":26216},{\"end\":26256,\"start\":26223},{\"end\":26695,\"start\":26691},{\"end\":27088,\"start\":27085},{\"end\":29092,\"start\":29081},{\"end\":30772,\"start\":30761},{\"end\":31739,\"start\":31729},{\"end\":31796,\"start\":31786},{\"end\":31877,\"start\":31868},{\"end\":32684,\"start\":32675},{\"end\":33665,\"start\":33656},{\"end\":34146,\"start\":34137}]", "table": "[{\"end\":32673,\"start\":32155},{\"end\":33654,\"start\":32763},{\"end\":34135,\"start\":33779},{\"end\":34957,\"start\":34177}]", "figure_caption": "[{\"end\":31784,\"start\":31741},{\"end\":31866,\"start\":31798},{\"end\":32054,\"start\":31879},{\"end\":32155,\"start\":32057},{\"end\":32763,\"start\":32686},{\"end\":33779,\"start\":33667},{\"end\":34177,\"start\":34148}]", "figure_ref": "[{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":11365,\"start\":11357},{\"end\":12504,\"start\":12495},{\"end\":14947,\"start\":14938},{\"attributes\":{\"ref_id\":\"fig_1\"},\"end\":16115,\"start\":16107},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":18305,\"start\":18297},{\"end\":18391,\"start\":18381}]", "bib_author_first_name": "[{\"end\":35012,\"start\":35011},{\"end\":35024,\"start\":35023},{\"end\":35033,\"start\":35032},{\"end\":35050,\"start\":35047},{\"end\":35052,\"start\":35051},{\"end\":35062,\"start\":35061},{\"end\":35075,\"start\":35074},{\"end\":35318,\"start\":35317},{\"end\":35333,\"start\":35332},{\"end\":35341,\"start\":35340},{\"end\":35350,\"start\":35349},{\"end\":35630,\"start\":35629},{\"end\":35637,\"start\":35636},{\"end\":35880,\"start\":35879},{\"end\":35890,\"start\":35889},{\"end\":35898,\"start\":35897},{\"end\":35909,\"start\":35908},{\"end\":36127,\"start\":36126},{\"end\":36137,\"start\":36136},{\"end\":36251,\"start\":36250},{\"end\":36253,\"start\":36252},{\"end\":36330,\"start\":36329},{\"end\":36332,\"start\":36331},{\"end\":36343,\"start\":36342},{\"end\":36354,\"start\":36353},{\"end\":36370,\"start\":36369},{\"end\":36382,\"start\":36381},{\"end\":36389,\"start\":36388},{\"end\":36544,\"start\":36538},{\"end\":36679,\"start\":36678},{\"end\":36688,\"start\":36687},{\"end\":36699,\"start\":36698},{\"end\":36707,\"start\":36706},{\"end\":36720,\"start\":36719},{\"end\":36731,\"start\":36730},{\"end\":37026,\"start\":37025},{\"end\":37447,\"start\":37446},{\"end\":37449,\"start\":37448},{\"end\":37462,\"start\":37461},{\"end\":37664,\"start\":37663},{\"end\":37666,\"start\":37665},{\"end\":37676,\"start\":37675},{\"end\":37678,\"start\":37677},{\"end\":37686,\"start\":37685},{\"end\":37688,\"start\":37687},{\"end\":37921,\"start\":37920},{\"end\":37923,\"start\":37922},{\"end\":37930,\"start\":37929},{\"end\":37932,\"start\":37931},{\"end\":37944,\"start\":37943},{\"end\":37946,\"start\":37945},{\"end\":37955,\"start\":37954},{\"end\":37957,\"start\":37956},{\"end\":37967,\"start\":37966},{\"end\":37969,\"start\":37968},{\"end\":37977,\"start\":37976},{\"end\":37979,\"start\":37978},{\"end\":38254,\"start\":38253},{\"end\":38256,\"start\":38255},{\"end\":38277,\"start\":38276},{\"end\":38279,\"start\":38278},{\"end\":38290,\"start\":38289},{\"end\":38292,\"start\":38291},{\"end\":38556,\"start\":38555},{\"end\":38563,\"start\":38562},{\"end\":38570,\"start\":38569},{\"end\":38581,\"start\":38580},{\"end\":38592,\"start\":38591},{\"end\":38603,\"start\":38602},{\"end\":38605,\"start\":38604},{\"end\":38840,\"start\":38839},{\"end\":38842,\"start\":38841},{\"end\":38852,\"start\":38851},{\"end\":38854,\"start\":38853},{\"end\":38865,\"start\":38864},{\"end\":38867,\"start\":38866},{\"end\":38877,\"start\":38876},{\"end\":38879,\"start\":38878},{\"end\":38889,\"start\":38888},{\"end\":38891,\"start\":38890},{\"end\":38901,\"start\":38900},{\"end\":38903,\"start\":38902},{\"end\":39197,\"start\":39196},{\"end\":39212,\"start\":39211},{\"end\":39225,\"start\":39224},{\"end\":39238,\"start\":39237},{\"end\":39252,\"start\":39251},{\"end\":39271,\"start\":39270},{\"end\":39755,\"start\":39754},{\"end\":39773,\"start\":39772},{\"end\":40050,\"start\":40049},{\"end\":40060,\"start\":40059},{\"end\":40062,\"start\":40061},{\"end\":40071,\"start\":40070},{\"end\":40079,\"start\":40078},{\"end\":40081,\"start\":40080},{\"end\":40307,\"start\":40306},{\"end\":40318,\"start\":40317},{\"end\":40332,\"start\":40331},{\"end\":40342,\"start\":40341},{\"end\":40351,\"start\":40350},{\"end\":40364,\"start\":40363},{\"end\":40619,\"start\":40618},{\"end\":40630,\"start\":40629},{\"end\":40641,\"start\":40640},{\"end\":40652,\"start\":40651},{\"end\":40665,\"start\":40664},{\"end\":40901,\"start\":40900},{\"end\":40916,\"start\":40915},{\"end\":40927,\"start\":40924},{\"end\":40935,\"start\":40934},{\"end\":41258,\"start\":41257},{\"end\":41275,\"start\":41272},{\"end\":41438,\"start\":41437},{\"end\":41440,\"start\":41439},{\"end\":41520,\"start\":41519},{\"end\":41533,\"start\":41532},{\"end\":41544,\"start\":41543},{\"end\":41553,\"start\":41552},{\"end\":41561,\"start\":41560},{\"end\":41574,\"start\":41573}]", "bib_author_last_name": "[{\"end\":35021,\"start\":35013},{\"end\":35030,\"start\":35025},{\"end\":35045,\"start\":35034},{\"end\":35059,\"start\":35053},{\"end\":35072,\"start\":35063},{\"end\":35330,\"start\":35319},{\"end\":35338,\"start\":35334},{\"end\":35347,\"start\":35342},{\"end\":35362,\"start\":35351},{\"end\":35634,\"start\":35631},{\"end\":35647,\"start\":35638},{\"end\":35887,\"start\":35881},{\"end\":35895,\"start\":35891},{\"end\":35906,\"start\":35899},{\"end\":35915,\"start\":35910},{\"end\":36134,\"start\":36128},{\"end\":36143,\"start\":36138},{\"end\":36263,\"start\":36254},{\"end\":36340,\"start\":36333},{\"end\":36351,\"start\":36344},{\"end\":36367,\"start\":36355},{\"end\":36379,\"start\":36371},{\"end\":36386,\"start\":36383},{\"end\":36398,\"start\":36390},{\"end\":36553,\"start\":36545},{\"end\":36685,\"start\":36680},{\"end\":36696,\"start\":36689},{\"end\":36704,\"start\":36700},{\"end\":36717,\"start\":36708},{\"end\":36728,\"start\":36721},{\"end\":36738,\"start\":36732},{\"end\":37038,\"start\":37027},{\"end\":37459,\"start\":37450},{\"end\":37466,\"start\":37463},{\"end\":37673,\"start\":37667},{\"end\":37683,\"start\":37679},{\"end\":37696,\"start\":37689},{\"end\":37927,\"start\":37924},{\"end\":37941,\"start\":37933},{\"end\":37952,\"start\":37947},{\"end\":37964,\"start\":37958},{\"end\":37974,\"start\":37970},{\"end\":37989,\"start\":37980},{\"end\":38274,\"start\":38257},{\"end\":38287,\"start\":38280},{\"end\":38301,\"start\":38293},{\"end\":38560,\"start\":38557},{\"end\":38567,\"start\":38564},{\"end\":38578,\"start\":38571},{\"end\":38589,\"start\":38582},{\"end\":38600,\"start\":38593},{\"end\":38612,\"start\":38606},{\"end\":38849,\"start\":38843},{\"end\":38862,\"start\":38855},{\"end\":38874,\"start\":38868},{\"end\":38886,\"start\":38880},{\"end\":38898,\"start\":38892},{\"end\":38908,\"start\":38904},{\"end\":39209,\"start\":39198},{\"end\":39222,\"start\":39213},{\"end\":39235,\"start\":39226},{\"end\":39249,\"start\":39239},{\"end\":39268,\"start\":39253},{\"end\":39280,\"start\":39272},{\"end\":39770,\"start\":39756},{\"end\":39777,\"start\":39774},{\"end\":40057,\"start\":40051},{\"end\":40068,\"start\":40063},{\"end\":40076,\"start\":40072},{\"end\":40088,\"start\":40082},{\"end\":40315,\"start\":40308},{\"end\":40329,\"start\":40319},{\"end\":40339,\"start\":40333},{\"end\":40348,\"start\":40343},{\"end\":40361,\"start\":40352},{\"end\":40368,\"start\":40365},{\"end\":40627,\"start\":40620},{\"end\":40638,\"start\":40631},{\"end\":40649,\"start\":40642},{\"end\":40662,\"start\":40653},{\"end\":40672,\"start\":40666},{\"end\":40913,\"start\":40902},{\"end\":40922,\"start\":40917},{\"end\":40932,\"start\":40928},{\"end\":40942,\"start\":40936},{\"end\":41270,\"start\":41259},{\"end\":41280,\"start\":41276},{\"end\":41447,\"start\":41441},{\"end\":41530,\"start\":41521},{\"end\":41541,\"start\":41534},{\"end\":41550,\"start\":41545},{\"end\":41558,\"start\":41554},{\"end\":41571,\"start\":41562},{\"end\":41581,\"start\":41575}]", "bib_entry": "[{\"attributes\":{\"id\":\"b0\",\"matched_paper_id\":1831060},\"end\":35255,\"start\":34959},{\"attributes\":{\"id\":\"b1\",\"matched_paper_id\":14341841},\"end\":35548,\"start\":35257},{\"attributes\":{\"id\":\"b2\",\"matched_paper_id\":2131938},\"end\":35820,\"start\":35550},{\"attributes\":{\"id\":\"b3\",\"matched_paper_id\":6401679},\"end\":36089,\"start\":35822},{\"attributes\":{\"id\":\"b4\"},\"end\":36246,\"start\":36091},{\"attributes\":{\"id\":\"b5\"},\"end\":36279,\"start\":36248},{\"attributes\":{\"id\":\"b6\"},\"end\":36534,\"start\":36281},{\"attributes\":{\"id\":\"b7\"},\"end\":36589,\"start\":36536},{\"attributes\":{\"id\":\"b8\",\"matched_paper_id\":1255845},\"end\":36988,\"start\":36591},{\"attributes\":{\"id\":\"b9\",\"matched_paper_id\":15993859},\"end\":37357,\"start\":36990},{\"attributes\":{\"id\":\"b10\"},\"end\":37602,\"start\":37359},{\"attributes\":{\"id\":\"b11\",\"matched_paper_id\":40512040},\"end\":37848,\"start\":37604},{\"attributes\":{\"id\":\"b12\",\"matched_paper_id\":42126553},\"end\":38178,\"start\":37850},{\"attributes\":{\"id\":\"b13\",\"matched_paper_id\":24709261},\"end\":38469,\"start\":38180},{\"attributes\":{\"id\":\"b14\"},\"end\":38790,\"start\":38471},{\"attributes\":{\"id\":\"b15\",\"matched_paper_id\":10397812},\"end\":39114,\"start\":38792},{\"attributes\":{\"id\":\"b16\",\"matched_paper_id\":10306599},\"end\":39650,\"start\":39116},{\"attributes\":{\"id\":\"b17\",\"matched_paper_id\":5024817},\"end\":39967,\"start\":39652},{\"attributes\":{\"id\":\"b18\",\"matched_paper_id\":30029552},\"end\":40249,\"start\":39969},{\"attributes\":{\"id\":\"b19\",\"matched_paper_id\":9641348},\"end\":40559,\"start\":40251},{\"attributes\":{\"id\":\"b20\"},\"end\":40816,\"start\":40561},{\"attributes\":{\"id\":\"b21\",\"matched_paper_id\":5609262},\"end\":41138,\"start\":40818},{\"attributes\":{\"id\":\"b22\"},\"end\":41433,\"start\":41140},{\"attributes\":{\"id\":\"b23\"},\"end\":41460,\"start\":41435},{\"attributes\":{\"id\":\"b24\",\"matched_paper_id\":2065400},\"end\":41835,\"start\":41462}]", "bib_title": "[{\"end\":35009,\"start\":34959},{\"end\":35315,\"start\":35257},{\"end\":35627,\"start\":35550},{\"end\":35877,\"start\":35822},{\"end\":36676,\"start\":36591},{\"end\":37023,\"start\":36990},{\"end\":37661,\"start\":37604},{\"end\":37918,\"start\":37850},{\"end\":38251,\"start\":38180},{\"end\":38837,\"start\":38792},{\"end\":39194,\"start\":39116},{\"end\":39752,\"start\":39652},{\"end\":40047,\"start\":39969},{\"end\":40304,\"start\":40251},{\"end\":40898,\"start\":40818},{\"end\":41517,\"start\":41462}]", "bib_author": "[{\"end\":35023,\"start\":35011},{\"end\":35032,\"start\":35023},{\"end\":35047,\"start\":35032},{\"end\":35061,\"start\":35047},{\"end\":35074,\"start\":35061},{\"end\":35078,\"start\":35074},{\"end\":35332,\"start\":35317},{\"end\":35340,\"start\":35332},{\"end\":35349,\"start\":35340},{\"end\":35364,\"start\":35349},{\"end\":35636,\"start\":35629},{\"end\":35649,\"start\":35636},{\"end\":35889,\"start\":35879},{\"end\":35897,\"start\":35889},{\"end\":35908,\"start\":35897},{\"end\":35917,\"start\":35908},{\"end\":36136,\"start\":36126},{\"end\":36145,\"start\":36136},{\"end\":36265,\"start\":36250},{\"end\":36342,\"start\":36329},{\"end\":36353,\"start\":36342},{\"end\":36369,\"start\":36353},{\"end\":36381,\"start\":36369},{\"end\":36388,\"start\":36381},{\"end\":36400,\"start\":36388},{\"end\":36555,\"start\":36538},{\"end\":36687,\"start\":36678},{\"end\":36698,\"start\":36687},{\"end\":36706,\"start\":36698},{\"end\":36719,\"start\":36706},{\"end\":36730,\"start\":36719},{\"end\":36740,\"start\":36730},{\"end\":37040,\"start\":37025},{\"end\":37461,\"start\":37446},{\"end\":37468,\"start\":37461},{\"end\":37675,\"start\":37663},{\"end\":37685,\"start\":37675},{\"end\":37698,\"start\":37685},{\"end\":37929,\"start\":37920},{\"end\":37943,\"start\":37929},{\"end\":37954,\"start\":37943},{\"end\":37966,\"start\":37954},{\"end\":37976,\"start\":37966},{\"end\":37991,\"start\":37976},{\"end\":38276,\"start\":38253},{\"end\":38289,\"start\":38276},{\"end\":38303,\"start\":38289},{\"end\":38562,\"start\":38555},{\"end\":38569,\"start\":38562},{\"end\":38580,\"start\":38569},{\"end\":38591,\"start\":38580},{\"end\":38602,\"start\":38591},{\"end\":38614,\"start\":38602},{\"end\":38851,\"start\":38839},{\"end\":38864,\"start\":38851},{\"end\":38876,\"start\":38864},{\"end\":38888,\"start\":38876},{\"end\":38900,\"start\":38888},{\"end\":38910,\"start\":38900},{\"end\":39211,\"start\":39196},{\"end\":39224,\"start\":39211},{\"end\":39237,\"start\":39224},{\"end\":39251,\"start\":39237},{\"end\":39270,\"start\":39251},{\"end\":39282,\"start\":39270},{\"end\":39772,\"start\":39754},{\"end\":39779,\"start\":39772},{\"end\":40059,\"start\":40049},{\"end\":40070,\"start\":40059},{\"end\":40078,\"start\":40070},{\"end\":40090,\"start\":40078},{\"end\":40317,\"start\":40306},{\"end\":40331,\"start\":40317},{\"end\":40341,\"start\":40331},{\"end\":40350,\"start\":40341},{\"end\":40363,\"start\":40350},{\"end\":40370,\"start\":40363},{\"end\":40629,\"start\":40618},{\"end\":40640,\"start\":40629},{\"end\":40651,\"start\":40640},{\"end\":40664,\"start\":40651},{\"end\":40674,\"start\":40664},{\"end\":40915,\"start\":40900},{\"end\":40924,\"start\":40915},{\"end\":40934,\"start\":40924},{\"end\":40944,\"start\":40934},{\"end\":41272,\"start\":41257},{\"end\":41282,\"start\":41272},{\"end\":41449,\"start\":41437},{\"end\":41532,\"start\":41519},{\"end\":41543,\"start\":41532},{\"end\":41552,\"start\":41543},{\"end\":41560,\"start\":41552},{\"end\":41573,\"start\":41560},{\"end\":41583,\"start\":41573}]", "bib_venue": "[{\"end\":35399,\"start\":35380},{\"end\":35682,\"start\":35663},{\"end\":35952,\"start\":35933},{\"end\":36776,\"start\":36755},{\"end\":37190,\"start\":37122},{\"end\":38946,\"start\":38932},{\"end\":39799,\"start\":39793},{\"end\":41665,\"start\":41628},{\"end\":35089,\"start\":35078},{\"end\":35378,\"start\":35364},{\"end\":35661,\"start\":35649},{\"end\":35931,\"start\":35917},{\"end\":36124,\"start\":36091},{\"end\":36327,\"start\":36281},{\"end\":36753,\"start\":36740},{\"end\":37120,\"start\":37040},{\"end\":37444,\"start\":37359},{\"end\":37712,\"start\":37698},{\"end\":37994,\"start\":37991},{\"end\":38313,\"start\":38303},{\"end\":38553,\"start\":38471},{\"end\":38930,\"start\":38910},{\"end\":39367,\"start\":39282},{\"end\":39791,\"start\":39779},{\"end\":40095,\"start\":40090},{\"end\":40385,\"start\":40370},{\"end\":40616,\"start\":40561},{\"end\":40958,\"start\":40944},{\"end\":41255,\"start\":41140},{\"end\":41626,\"start\":41583}]"}}}, "year": 2023, "month": 12, "day": 17}