{"id": 218569273, "updated": "2023-03-16 13:22:51.916", "metadata": {"title": "mm-FLEX: an open platform for millimeter-wave mobile full-bandwidth experimentation", "authors": "[{\"first\":\"Jesus\",\"last\":\"Lacruz\",\"middle\":[\"Omar\"]},{\"first\":\"Dolores\",\"last\":\"Garcia\",\"middle\":[]},{\"first\":\"Pablo\",\"last\":\"Mateo\",\"middle\":[\"Jiménez\"]},{\"first\":\"Joan\",\"last\":\"Palacios\",\"middle\":[]},{\"first\":\"Joerg\",\"last\":\"Widmer\",\"middle\":[]}]", "venue": null, "journal": "Proceedings of the 18th International Conference on Mobile Systems, Applications, and Services", "publication_date": {"year": 2020, "month": null, "day": null}, "abstract": "Millimeter-Wave (mm-wave) technology is increasingly being considered for mobile devices and use cases such as vehicular communication. This requires suitable experimentation platforms to support systems-oriented research to tackle the multitude of problems and challenges of mm-wave communications in such environments. To this end, we introduce mm-FLEX, a flexible and modular open platform with real-time signal processing capabilities that supports a bandwidth of 2 GHz and is compatible with mm-wave standard requirements. mm-FLEX integrates an FPGA-based baseband processor with full-duplex capabilities together with mm-wave RF front-ends and phased antenna arrays that are fully configurable from the processor in real-time. To demonstrate the capabilities of mm-FLEX, we implement a scalable, ultra-fast beam alignment mechanism for IEEE 802.11ad systems. It is based on compressive estimation of the signal's angle-of-arrival by means of switching through multiple receive beam patterns on a nano-second time-scale while receiving a packet preamble. Our implementation is open source and is made publicly available to the research community.", "fields_of_study": "[\"Computer Science\"]", "external_ids": {"arxiv": null, "mag": "3033072436", "acl": null, "pubmed": null, "pubmedcentral": null, "dblp": "conf/mobisys/LacruzGMPW20", "doi": "10.1145/3386901.3389034"}}, "content": {"source": {"pdf_hash": "205bb83abf16e654665293b0d8bede89f325100a", "pdf_src": "ACM", "pdf_uri": null, "oa_url_match": false, "oa_info": null}, "grobid": {"id": "5fe596cf59472c9808d093cade3d94b26d56bae4", "type": "plain-text", "url": "s3://ai2-s2-pdf-extraction-prod/parse-results/s2orc_worker/205bb83abf16e654665293b0d8bede89f325100a.txt", "contents": "\nmm-FLEX: An Open Platform for Millimeter-Wave Mobile Full-Bandwidth Experimentation\nJune 15-19, 2020. 2020. June\n\nJesus Omar Lacruz jesusomar.lacruz@imdea.org \nDolores Garcia dolores.garcia@imdea.org \nPablo Jiménez pablo.jimenezmateo@imdea.org \nMateo \nJoan Palacios joan.palacios@imdea.org \nJoerg Widmer joerg.widmer@imdea.org \nJesus Omar Lacruz \nDolores Garcia \nPablo Jiménez Mateo \nJoan Palacios \nJoerg Widmer \n\nIMDEA Networks Institute Madrid\nSpain\n\n\nIMDEA Networks Institute Universidad Carlos III de Madrid Madrid\nSpain\n\n\nIMDEA Networks Institute Universidad Carlos III de Madrid Madrid\nSpain\n\n\nIMDEA Networks Institute Universidad Carlos III de Madrid Madrid\nSpain\n\n\nIMDEA Networks Institute Madrid\nSpain\n\nmm-FLEX: An Open Platform for Millimeter-Wave Mobile Full-Bandwidth Experimentation\n\nThe 18th Annual International Conference on Mobile Systems, Applications, and Services (MobiSys '20)\nToronto, ON, Canada20June 15-19, 2020. 2020. June10.1145/3386901.3389034ACM ISBN 978-1-4503-7954-0/20/06. . . $15.00 15-19, 2020, Toronto, ON, Canada. ACM, New York, NY, USA, 13 pages.CCS CONCEPTS • Networks → Network experimentationMobile networks• Computer systems organization → Real-time system archi- tecture• Hardware → Digital signal processing KEYWORDS Millimeter Wave, Testbed, FPGA, Phased Antenna Array, Beam Training\nMillimeter-Wave (mm-wave) technology is increasingly being considered for mobile devices and use cases such as vehicular communication. This requires suitable experimentation platforms to support systems-oriented research to tackle the multitude of problems and challenges of mm-wave communications in such environments. To this end, we introduce mm-FLEX, a flexible and modular open platform with real-time signal processing capabilities that supports a bandwidth of 2 GHz and is compatible with mm-wave standard requirements. mm-FLEX integrates an FPGA-based baseband processor with full-duplex capabilities together with mm-wave RF front-ends and phased antenna arrays that are fully configurable from the processor in real-time. To demonstrate the capabilities of mm-FLEX, we implement a scalable, ultra-fast beam alignment mechanism for IEEE 802.11ad systems. It is based on compressive estimation of the signal's angle-of-arrival by means of switching through multiple receive beam patterns on a nano-second timescale while receiving a packet preamble. Our implementation is open source and is made publicly available to the research community.\n\nINTRODUCTION\n\nMillimeter-Wave (mm-wave) network technology such as the IEEE 802.11ad [33] and the upcoming IEEE 802.11ay [34] standards for 60 GHz Wireless Local Area Networks (WLANs) can provide vastly higher data rates than networks operating below 6 GHz, due to the large amount of bandwidth available at mm-wave frequencies.\n\nMm-wave devices typically implement directional communication using phased arrays, so that the beam-forming gains of the antenna compensate for the higher path loss due to the small wavelength [22]. This not only ensures a good link range but also reduces interference and thus improves spatial reuse. Operating networks at mm-wave frequencies introduces new problems not only due to the RF front-end components but also due to the need for high gain directional communication and the associated beam training or channel estimation. Especially for mobile scenarios, further practical research is needed. For instance, fast device tracking is essential for continuous antenna beam alignment, but current beam training mechanisms introduce a high overhead and latency when used in highly mobile environments. At the same time, there is a lack of suitable experimentation platforms that allow for realtime packet processing and antenna reconfiguration, and that are flexible enough to support modifications of the physical and MAC layers. To address the challenges of mobile mm-wave communication networks, it is crucial to provide the research community with such an experimentation platform, that ideally should have the following features: i) giga-sampling rate capability, to be able to accurately study the characteristics of the wide-band channels and be compatible to current standards, ii) access to physical layer data, which brings invaluable information to researchers to measure the channel and develop new signal processing algorithms, iii) simplicity, flexibility and configurability, such that researchers can easily modify the behavior of the system, iv) fast antenna reconfiguration to support high-mobility scenarios, and v) affordability, to enable also smaller research groups to carry out mobile systems research. The latter is a problem specific to mm-wave systems and their large bandwidth, since the cost of the A/D converters and the FPGA are directly related to the maximum sampling frequency and the number of logic elements/speed grade, respectively. Different solutions in the literature aim to address the need for experimentation platforms. The MiRa platform [2] uses Universal Software Radio Peripheral (USRP) devices as baseband equipment attached to a custom 28 GHz RF front-end. It only supports narrowband channels due to the USRP's bandwidth limitations. The X60 testbed [23] is based on National Instruments (NI) hardware and a phased array antenna kit. While it meets the bandwidth requirements of the IEEE 802.11ad standard, it is expensive and the high complexity of the design makes low-level modifications more difficult. OpenMili [35] aims to increase performance compared to [2] at a more manageable cost compared to [23]. It does provide better performance than [2] but still does not meet the bandwidth requirements of mm-wave standards. Our system is complementary to [36] which provides a MIMO-capable RF front-end, whereas our focus is on a full-bandwidth baseband design. In addition, the solutions listed above lack support for high-mobility scenarios, which require fast control over the antenna array to enable real-time beam steering with very low antenna reconfiguration latency.\n\nIn this paper we propose a Millimeter Wave Mobile FulL-Bandwidth EX perimentation Platform (mm-FLEX). It is a flexible, modular and highly configurable testbed that exceeds the requirements of current mm-wave standards, supporting more than 2 GHz of bandwidth. mm-FLEX is an open source research platform that offers a unique set of features. At approximately twice the cost of a high-end narrow-band USRP (an order of magnitude less than [23]), it offers more than ten times the performance and does not sacrifice standard compliance as [2,35]. Furthermore, we add important features such as fast real-time antenna steering that are a key enablers for research targeting high mobility scenarios.\n\nThe testbed is composed of a powerful baseband system including a high performance FPGA and processor boards with the necessary components for real-time signal processing, as well as a 60 GHz RF front-end using a 16+16 element phased array antenna with high resolution phase shifters that can be fully controlled from the system. We design mm-FLEX to be modular and flexible with the necessary IP blocks that facilitate real-time experimentation with mobile mm-wave systems. Furthermore, the designed blocks have a flexible AXI interface that allows different Super Sample Rate (SSR) configurations such that they can even be used on different FPGA platforms, such as the narrow-band X310 USRP system. We implement the signal processing blocks for real-time capture and frame processing directly on the FPGA 1 , together with the fast beam sweeping of the phased-array antenna at nano-second time scale. Our testbed also supports a hardware-in-the-loop mode where part of the functionality is software modeled while the time-critical ones are hardware-implemented, facilitating the development and validation of signal processing applications for the mm-wave community.\n\nWhile our experimentation platform is currently designed for IEEE 802.11ad, it is flexible enough to be used with 28GHz equipment [27] for 5G New Radio (NR) and beyond research.\n\nTo showcase the capabilities of mm-FLEX, we use it to address the important problem of fast beam alignment in dense, mobile mm-wave scenarios. Conventional IEEE 802.11ad [33] beam training is done by transmitting frames using each of the available antenna configurations, while the target device listens with a quasiomnidirectional beam pattern. This avoids the complexity of training both ends of the link simultaneously. The target device then provides feedback which sector resulted in the highest Signal-to-Noise Ratio (SNR) [14]. Such brute force or simple hierarchical beam training (in case beam refinement is used) works well for relatively static deployments of moderate density. However, the overhead may become prohibitive when frequent beam training is required in more dynamic environments with device mobility or link interruptions through blocking obstacles.\n\nWe propose a design that eliminates dedicated station beam training to allow the network to handle very high network dynamics and client densities. Our mechanism works with unmodified standardcompliant IEEE 802.11ad Access Points (APs). While an AP sends multiple frames for the standard beam training, the stations perform quick signal strength measurements with different receive beam patterns during preamble reception of these frames after packet detection. We then use a fast sparse estimation algorithm to determine the Angle of Arrival (AoA) and select the best beam pattern to be used at the station. Our mechanism only requires minor changes in the firmware of the stations, since the fast beam-pattern sweeping capability is already included in 802.11ad standard compliant devices for the Beam Refinement Phase (BRP). We perform an extensive measurement campaign and show that our mechanism can switch through 10 receive beam patterns during the preamble without compromising detection accuracy for typical SNR values, whereas only 5 beam patterns are required to accurately estimate the AoA with an error of around 1 • .\n\nOverall, our paper provides the following contributions: • We design mm-FLEX, a flexible and configurable testbed that is able to perform real-time signal processing at multi-GHz bandwidths and is compatible with current mm-wave standards. At the same time, the hardware on which the system is based is affordable for such a high performance system. • We implement the baseband system on a powerful FPGA and processor board with dual AXI-stream data paths for separate transmitter and receiver chains. This brings modularity to the design and enables full-duplex applications. Our hardware processing blocks to detect and process the preamble of standard-compliant IEEE 802.11ad frames operates with the full bandwidth of 1.76 GHz. The code and specification of our testbed are publicly available [6].\n\n• We augment the testbed functionality to provide fast real-time antenna array reconfigurability, implementing a hardware block to directly switch beam patterns on a nano-second time scale, using a configurable input trigger. This is a crucial feature not only to support standard-compliant IEEE 802.11ad beam training, but more importantly to enable symbol-level beam reconfiguration for research targeting high-mobility scenarios.\n\n• We demonstrate the capabilities of the testbed platform by implementing a mechanism for passive station beam alignment for dense, mobile millimeter-wave networks, that significantly outperforms current standards and prior work.\n\n\nPLATFORM ARCHITECTURE\n\nIn this section, we describe the top-level hardware architecture of mm-FLEX and the design choices taken that ensure flexibility and modularity of the system.\n\n\nHardware components\n\nThe proposed testbed system is composed of two main components, i) a powerful baseband processor that can generate and capture baseband IQ samples at Giga-sampling rates from a ii) 60GHz RF front-end with phased array antennas with analog beam-forming capabilities, which performs direct up/down conversion from/to the baseband samples. This design limits the number of hardware components required to implement the testbed. A simple block diagram is shown in Fig. 1. While we describe the testbed development with 60GHz transceivers, mm-FLEX can support RF front-ends for other mm-wave frequencies [27]. The baseband processor is composed by a single chassis including an i) AMC599 board, integrating a Xilinx Kintex Ultrascale FPGA, high-speed AD/DA converters and DDR4 memory banks, among other features [31] and ii) an AMC726 board with an Intel Core i7 processor [32]. The AMC599 board provides the Programmable Logic (PL) to implement the hardware signal processing blocks for processing the IQ samples that are sent to and captured from the converters and stored in the on-board DDR memory. The AMC726 board provides the Processing System (PS), serving as a management and configuration processor for the FPGA, AD/DA converters and RF front-end. The PL and PS subsystems are connected to each other through a PCIe interface in the chassis' back plane. The chassis allows to connect an additional AMC599 board that can be managed from the same PS via PCIe, which allows to extend mm-FLEX to support mm-wave MIMO communications, as used for example in the latest standards [34]. The RF front-end is composed of 60 GHz up/down converters with phased antenna arrays. Finally, an external dual channel clock board is used to generate independent sampling clock signals for the AD/DA converters (i.e., we do not require that the communicating transceivers are clock synchronized). A photo of the system with labels for the most relevant hardware components is shown in Fig. 2a. System specifications exceed by far the bandwidth and processing requirements for an IEEE 802.11ad compliant transceiver and offer enough flexibility to be used for more powerful future mm-wave communication standards.\n\n2.2 General data/control architecture 2.2.1 Data path. We develop mm-FLEX to have full-duplex capabilities and therefore design independent transmitter and receiver data paths, as shown with solid lines in Fig. 1). They move the IQ samples through the different signal processing blocks from the source, in the baseband processor, to the transmitter phased array antenna and vice versa on the receiver side. Each data path has an independent clocking structure, DDR memory and separated blocks to transmit and receive IQ samples from/to the converters, without sacrificing bandwidth or real-time signal processing capabilities.\n\nTo ensure modularity , facilitate block interconnection and avoid inter-block synchronization issues, we adopt the well-known AXIstream for both data paths ( Fig. 1) to move the IQ samples through the signal processing blocks. Thanks to this interface, high-level tools like Xilinx Vivado HLS and System Generator can be used to develop custom signal processing blocks, providing a reasonably high level of abstraction to extend the design. With Giga-Samples per Second (GSPS) sampling frequencies of the AD/DA converters and a PL clock frequency on the order of hundreds of MHz, multiple samples must be processed in parallel during every clock cycle in each channel of the data paths. The number of parallel samples is defined by the SSR parameter, the ratio between the sampling clock frequency and the PL clock frequency. Here, we adopt an SSR of 16 parallel samples for full bandwidth operation. This parameter can be configured depending on the specific design requirements, in favor of area reduction or timing constraints relaxation. Although mm-FLEX can be used with a wide range of sampling clock frequencies to meet specific standard requirements, in the remainder of this paper the sampling frequency for the DACs/ADCs is selected to be 3.52 GSPS (1.76 Gsymbols/s * 2 samples/symbol, which gives a clock frequency of 220MHz for both data paths, considering a SSR of 16). This ensures that the system meets the symbol rate requirements of the IEEE 802.11ad standard of 1.76 Gsymbols/s, considering two samples per received symbol.\n\nCommunication between the PL and the PS is done by means of a PCI-to-AXI IP block that enables fast large data transfers from/to the on-board DDR memory, as required due to the Giga sampling rates. Access to the DDR memory from the PS and PL is done by means of custom-designed DDR write and DDR read hardware blocks. These efficient write/read operations to/from the on-board memory match the SSR adopted for the AXI-stream data-width in the design. Specifically, the DDR write core is user configurable from the PS to operate in two different modes: i) simple writing, where the user configures the amount of IQ samples to be stored in the DDR memory in a single capture (up to 250 million IQ samples) and ii) burst saving, where the user configures the number of chunks of data (and their length) that should be captured and saved for further processing. In this case, the block requires a hardware trigger input that indicates when to start saving each chunk.\n\n\nControl path.\n\nSystem control and management is done entirely from the PS (AMC726 processor) through the PCIe interface. This allows not only to move large amounts of data to/from the 16  DDR memory but also provides control and management of the data converters, IP blocks and RF front-end. To this end we include an AXI protocol conversion in the PL, which passes from an AXI-stream to an AXI-lite interface, allowing to send and receive commands to the configuration registers of each of the modules, as shown in Fig. 1 (dotted lines). The PS controls the RF front-end by means of a USB interface and Python functions (supplied by the manufacturer), that allow to configure each kit as transmitter or receiver (at runtime), transfer the antenna codebook, set the Antenna Wave Vector (AWV), power amplifier gains, and carrier frequency, among other features.\n\nFrom the user point of view, a C/C++ application is used to configure and operate the system through an SSH connection. Simple commands are used to run functions that entirely configure the baseband processor, send and receive IQ samples to/from DDR memory, configure IP blocks, etc. On system start-up, the user just runs an \"init\" function to configure the PLLs for the converters, to set up the transmitter and receiver data paths, and configure the peripherals of the system. Besides, the user can configure at any moment the IP blocks included in each one of the data paths by means of commands that write directly to the IP block registers using the AXI-lite bus.\n\n\nBaseband processing blocks\n\nConsidering the simple block diagram of Fig. 1 and the system architecture described above, mm-FLEX is able to transfer complex IQ samples from the ADCs directly to one DDR memory at 6.4 GSPS, without the need for any custom AXI-stream block. At the same time, in the transmitter chain, the other DDR bank can stream IQ samples directly to the DACs. With this system structure, mm-FLEX can be used in a hardware-in-the-loop system where the baseband processor is used to transmit and capture IQ samples while the entire decoding is done in software, as is often done with conventional USRP devices. Although useful and simple, this operation mode does not fully exploit the capabilities of the powerful baseband processor of mm-FLEX. We develop the system to allow users to perform step-by-step translation of signal processing functions with heavy computational load to be hardware implemented, while the entire system (hardware-software) remains fully functional. This helps not only to accelerate the processing of the IQ samples but also allows hardware designers to validate the implementation of signal processing blocks in real-time environments, comparing their behavior with software floating point models.\n\nNext we include the designed hardware blocks that facilitate experimentation with IEEE 802.11ad systems, translating part of the signal processing tasks to hardware implementation, while the rest of the decoder processing functions remain software-based. This allows potential users to translate more functions to the PL side using the provided system as a reference design to further upgrade and extend functionality. The designed blocks are flexible enough to be used with different baseband processors with different sampling rate requirements, since the SSR can be changed by means of a single parameter in the block interface.\n\n• Packet Detector: this block detects IEEE 802.11ad compliant frames [33] received by the ADCs. It implements the Normalized Auto Correlation (NAC) algorithm given in Eq. (1), where y is the vector of received IQ samples, k is the sample index, and [·] * is the complex conjugate operator.\nNAC = k +127 n=k [y] n [y] * n−127 k+127 n=k [y] n [y] * n(1)\nIn our implementation, the terms are rearranged to avoid division to simplify the hardware implementation of the block [7,8,17]. It considers that a valid frame is detected when the NAC exceeds a programmable threshold. To enhance the robustness and reduce the amount of false packet detection due to noise, we add a stage that counts the number of cycles during which the signal exceeds the configurable threshold. This reduces false frame detection but introduces additional latency in the detection. The block sets a flag (PD_FLAG) when a packet is detected. This flag can be used as trigger for other IP blocks. We use it in conjunction with the DDR write IP block to only write received IQ samples of actual frames to the DDR memory and avoid storing samples of noise. Packet detector configuration parameters, such as the threshold and the number of cycles to detect a valid packet, can be configured on-the-fly from the PS, making it flexible to adapt to different channel conditions without requiring a full re-build of the system.\n\n• Square-Root-Raised-Cosine (SRRC) filter: this block is located in the receiver data path to process the incoming IQ samples from the ADC (Fig. 2b). The coefficients and the roll-off value of the filter can be configured from the PS considering that the IEEE 802.11ad standard does not define the baseband filter characteristics 2 . The filter includes a bypass option to disable its functionality.\n\n• GPIO signal management: enables fast real-time beam steering of the antenna array from the PL by means of GPIO pulses. These are sent to the antenna controller ( Fig. 2a) to perform the rapid beam pattern changes in the phased array. The block implements a state machine which continuously waits for an input trigger signal to generate the pulse to the RF front-end controller that changes the beam-pattern. The input trigger signal can be sent from the PS or from other hardware blocks in the PL. The block can either change a single beam pattern or can send multiple periodic pulses (userconfigurable on a nanoseconds scale through the PS) from a single trigger pulse to cycle through multiple patterns. After sending the pulses, it can either directly return to the original idle state or generate another pulse (through a different GPIO pin) which forces the RF front-end to jump to a pre-configured standard beam pattern. This feature of mm-FLEX enables real-time experimentation not only with beam training mechanisms, including Sector Level Sweep (SLS) and BRP, where fast beam switching capabilities are used [33], but even supports custom switching capabilities on a per symbol level. We exploit this feature to implement the fast beam alignment algorithm proposed later in this paper.\n\n• Received Signal Strength (RSS) Computation: estimates the RSS value of the received frame taking advantage of the term inside the summation in the denominator of (1), avoiding the use of complex multipliers that would unnecessarily increase the design's area. The block is configurable to allow any input trigger. In this paper we use the PD_FLAG as input trigger to start computing the RSS of a received frame. This block serves as a good example how to use mm-FLEX to extract characteristics of a received packet in real-time, allowing to quickly react to signal changes and avoid the possible latency when communicating with the PS.\n\n• Variable Delay Line: the converters are connected to the FPGA using a JESD204B interface [4], which reduces the number of pins required for the connection. We calibrate the elastic buffers on the PL side of the JESD204B interface in order to reduce phase impairments between the IQ streams in the ADCs. This has to be done only a single time when a new FPGA image is built. For the DACs, this is accomplished by means of an IP block that implements a variable delay line which, at startup, is configured to read the phase registers on each DAC to compensate their possible differences using the IP. This step is required since the PLLs used to generate the clocks required by the JESD204B interface use a divided-by-4 version of the DAC sampling clock, which introduces phase uncertainly. With our approach, the phase difference between the IQ channels is ensured to be less than one sample. This block is transparent to the user and it is configured at startup once the user executes the \"init\" function (Section 2.2.2).\n\nA block diagram of the baseband processor is presented in Fig.  2b, including the main FPGA hardware blocks described above.\n\nWhile Fig. 2b only includes the blocks corresponding to the Rx data path, the Tx data path is similar (replacing the ADCs by the DACs, the DDR write core by the DDR read core and replacing the receiver IP blocks by the ones used in the Tx chain). Furthermore, the system is capable of working as a full-duplex transceiver, since full-bandwidth IEEE 802.11ad compliant frames can be transmitted by the transmitter block independently of the receiver part of the system, streaming the IQ samples directly from the dedicated DDR memory to the Tx data path.\n\n\n60 GHz RF front-end\n\nWe use the EVK06002 development kit from Sivers IMA [26] with 60 GHz up/down converters as the RF front-end for mm-FLEX. It supports the frequencies and bandwidth of IEEE 802.11ad channels and includes a 16+16 (Tx/Rx) element phased array arranged in two linear array structures (Fig. 2a). The kit includes 2D analog beam forming capabilities through phase shifters with 6 bit resolution for each antenna element. The kit can be controlled via three different interfaces: USB, SPI and GPIO pulses. We use the USB interface (connected to the AMC726 processor, Fig. 2a) to configure the kit as transmitter or receiver (at runtime), transfer the codebook, set the AWV and configure the GPIO control interface.\n\nIn addition, the kit incorporates fast beam switching capabilities through simple pulses via a GPIO interface, that allow to switch beam patterns every 10 ns. However, the kit has a maximum RF settling time of 35 ns when changing beam patterns. The GPIO functionality is as follows: i) one GPIO input is used to increment the pointer for the active sector in the stored codebook for each received pulse; ii) a second input is used to return to a predefined sector, which can be freely configured from the USB interface.\n\nThe front-end supports codebooks containing 64 different AWV. The predefined codebook consists of a quasi-omnidirectional beam pattern and 63 directional ones with main lobes at angles ranging from -45 • to 45 • . However, the codebook can be freely configured, allowing the user to design custom beam patterns as needed.\n\n\nPreliminary test\n\nTo test the proper functioning of the developed system, we setup a 10 m Line-of-Sight (LOS) link and use mm-FLEX to transmit IEEE 802.11ad compliant frames (generated offline) for the different single-carrier Modulation and Coding Schemes (MCSs) of the standard, from MCS 1 to 12. The mm-FLEX receiver captures the frames after packet detection using the IP blocks described before, while the actual frame decoding is carried out in software. Fig. 3 shows an example of the experiment results. Specifically, Fig. 3a shows the signal of a received MCS 12 IEEE 802.11ad frame [33] over time and Fig. 3b shows the corresponding NAC output of the packet detector block. Finally, Fig. 3c and 3d show the constellation points for MCS 8 and MCS 12 frames of the corresponding frames captured using mm-FLEX.\n\n\nCASE STUDY: ULTRA FAST BEAM ALIGNEMENT\n\nTo showcase the unique capabilities of mm-FLEX, we address the problem of high IEEE 802.11ad beam overhead [33] when the station (user) is mobile, especially for scenarios with a higher number beam alignment between the AP and stations to overcome the high path loss and achieve a sufficiently high SNR. The efficiency and accuracy of this mechanism directly determines the achievable data throughput. To improve performance, we introduce an Ultra Fast Alignment (UFA) mechanism, which aims to eliminate the beam training at the station side of the link by means of estimating the RSS for different receive beam patterns while the station is receiving the preamble of a training packet during AP beam training. This obviates the need for any dedicated station-side beam training, thus substantially reducing beam training overhead and maintaining beam alignment even when a station is highly mobile.\n\n\nPreliminaries\n\nBefore discussing our algorithm, we introduce the beam training mechanism as defined by the IEEE 802.11ad standard and the preamble structure of standard compliant frames of which we take advantage in our algorithm. \n\n\nMain idea\n\nThe purpose of UFA is to reduce beam training overhead by performing SLS only at the AP and train the stations while they are receiving the AP transmit sector training packets. We first discuss the case of a single AP performing SLS with a station, but this case easily extends to multiple APs. During the AP's SLS, the station receives a beacon frame for each AP transmit beam pattern. After the station successfully detects a beacon frame, the STF has served its purpose and for the remainder of its duration the station can switch through M beam patterns. The switching has to terminate before the STF ends, i.e., before the Golay sequences −Gb 128 and −Ga 128 at the end of the STF, to ensure that boundary detection is not affected and the CEF can be received correctly.\n\nThe key idea of our algorithm is that since for a given transmit sector the M beam pattern changes of the station happen during a single STF, changes in the amplitude of the signal are directly related to the receive beam patterns. These amplitude changes can be extracted from the RSS measurements, which provides a simple and fast estimator that does not increase receiver complexity. We then use the sparsity of the mm-wave channel to estimate the AoA with high accuracy with only a reduced set of measurements.\n\n\nProblem formulation\n\nFor a given transmit beam pattern t and a receive beam pattern r , the RSS t ,r can be calculated as\nRSS t ,r = N −1+k n=k [y] n · [y] * n(2)\nwhere y is the vector with the received IQ samples, k denotes the sample index and N is the number of IQ samples considered to compute the RSS value. We denote the Euclidean norm by ∥y∥ and the inner product of two vectors x and y by < x, y >. For a single transmit sector t, the station changes through M receive sectors.\n\nLet In order to obtain the AoA θ at the station, we must find the θ value that minimizes the differences between the RSS t ,r measurements at the receiver and the known receive beam patterns b m over all transmit sectors\nθ = arg min θ t ,m min α t (θ ) ∥RSS t ,m − α t (θ )b m (θ )∥ 2 ,(3)\nwhere α t (θ ) stands for the amplitude of the received beam pattern t that minimizes the Euclidean norm for each t. We convert this problem to a correlation between the RSS measurements and the known beam patterns. For this, we expand Eq. (3) to obtain:\nθ = arg min θ t ,m min α t (θ ) ∥RSS t ,m ∥ 2 + ∥α t (θ )b m (θ )∥ 2 − 2α t (θ )RSS t ,m b m (θ )\nSumming over m we get\nθ = arg min θ t min α t (θ ) ∥R t ∥ 2 + ∥α t (θ )B(θ )∥ 2 − 2α t (θ ) < R t , B(θ ) >\nNow, the minimization over α t (θ ) is a quadratic problem that we can solve and substitute while removing the constant term\nθ = arg min θ t − < R t , B(θ ) > 2 /∥B(θ )∥ 2 .\nFinally we change the variableB(θ ) = B(θ )/∥B(θ )∥ and convert the problem into a maximization problem\nθ = arg max θ t < R t ,B(θ ) > 2 .(4)\nThe station uses the estimated direction of arrival θ of the signal to select the beam pattern with the highest gain in that direction for communication. This method is of very low complexity and uses the RSS information from the M receive sectors for all the received transmit sectors during SLS, in a single optimization. All steps of our algorithm are basic operations such as additions and real multiplications that allow for fast hardware implementation and low complexity at the receiver.\n\nFinally, it is important to remark that the accuracy of mm-FLEX does not rely on the shape of the M beam patterns used to estimate θ but on the angular resolution used to measure them. In the evaluation section, we will show that very accurate angle estimation is possible measuring only a small subset of beam patterns from the 63 predefined ones. For the communication phase, we then choose the best matching pattern from all of the 63 predefined ones. To further improve performance, it would even be possible to design a custom beam pattern that has the highest gain at the desired angle.\n\n\nIMPLEMENTATION\n\nWe now explain how the mm-FLEX testbed is configured to implement our beam-alignment algorithm, including the enhanced functionality added to the IP blocks presented in Section 2.\n\n\nmm-FLEX Configuration\n\nThe UFA algorithm is implemented using the mm-FLEX IP blocks explained in Section 2. We introduce some modifications from the standard functionality to provide rapid antenna reconfiguration and the synchronized computation of multiple RSS measurements that are required to implement the algorithm.\n\nThe packet detector generates a trigger signal (PD_FLAG) that is used as input for the GPIO signal management and the DDR write block. The latter allows to save to the DDR memory only valid data corresponding to the beacon frames sent from the multiple APs in the experimental setup. The block is configured with a detection threshold of 0.25 and the number of clock cycles to detect a valid packet is set to 64. These parameters reduce the probability of false packet detection while maintaining a reasonable detection latency.\n\nThe GPIO signal management block is configured to start sending the GPIO pulses to change through M beam patterns after receiving the PD_FLAG as input trigger. In the beginning, the system starts with a quasi-omnidirectional beam pattern as conventional IEEE 802.11ad receivers. Once it detects a valid frame, it triggers pulses to cycle through M measurement beam patterns from the predefined codebook. After that, another pulse is sent to return to the quasiomnidirectional beam pattern to continue with the frame decoding. The time between GPIO pulses is selected to establish a balance between RSS accuracy and computation time. To this end, the IP block is configured to trigger GPIO pulses each 192 received samples (12 FPGA clock cycles = 54.5 ns). Although the M value is user configurable from the PS, for the experiments conducted in this paper we set M = 10, which gives (192 samples * 10)/3.52 GSPS = 545 ns for the beam pattern changes.\n\nWe augment the functionality of the RSS computation block to be synchronized with the GPIO signal management block to compute M RSS values per detected packet, one per tested receive beam pattern. The block waits for a PD_FLAG to start computing each RSS value during 12 clock cycles (leaving out the first 8 samples of the RSS computation to avoid the possible transients in the received signal due to the RF front-end settling time of 35 ns when changing a beam pattern) and saves the individual results to M registers to build the vector R t used to compute the AoA estimate.\n\nWe remark that there exists a constant delay between the time when the ADCs sample the incoming IQ signal and when the corresponding samples are available to be processed by the FPGA logic. Due to the buffering and serialization process in the JESD204B interface [4], there is a deterministic latency of 650 ns (measured) for both ADCs in the system. This value increases to 700 ns due to the pipeline registers used in our SRRC filter and packet detector blocks to meet timing constraints in the design. The RSS computation block takes this deterministic latency into account before it starts computing the RSS values for each beam pattern. In Fig. 4 we present a timing diagram showing how the RSS computation block works cooperatively with the GPIO signal management and packet detector blocks to compute the M RSS values (shown in different colours), when a valid packet is detected.\n\nIn Fig. 5, we show an example of a preamble with M = 10 beam pattern changes (separated with dotted lines). We observe a typical frame detection delay of 900 ns, a latency of 700 ns between the Analog-to-Digital Converter (ADC) and FPGA (before the FPGA  Figure 5: Measured STF of a control frame, showing signal changes due to beam switching at the receiver can react to the GPIO pulses after the detection and starts seeing the beam patterns changes). During this time we also perform CFO estimation (which requires around 7 Golay sequences to obtain a good estimate [7,8]) and symbol synchronization, and 545 ns to switch through the 10 beam patterns, which is more than enough to reliably estimate the AoA of the received signal. The total time is well below the is 3.49 µs duration of the 48 Golay sequences Gb 128 of the STF. As can be seen from Figure 5, switching beam patterns is extremely fast and only short transients can be observed close to each beam pattern change, affecting only few IQ samples during the phase shifter reconfiguration. Symbol synchronization aims to select the proper sampling point of the signal, splitting it in a small set of coarse phases. After that, each one is correlated with Golay sequences and then the one with the maximum value is selected. This can be done while the decoder is waiting for the changes in the signal beam pattern to take effect.\n\n\nMeasuring the receive beam patterns\n\nUFA requires knowing the shape of the M beam patterns used at the receiver to estimate the AoA. In order to measure the shape of the receive beam patterns, we mount the phased array on a motorized pan/tilt platform that mechanically steers over the whole azimuth (Fig. 2a). We time the movement of the rotation table to wait for a full SLS before moving to the next angle. We record n = 10 measurements of the received signal for each receive beam pattern r and transmit beam pattern t, respectively, and then change the angle for a new measurement. The rotation table advances in steps of 0.5 • , giving approximately 0.5 • resolution in our direction estimation.\n\nWith the obtained measurements, we average the individual RSS measurements for each one of the angles of the pan/tilt platform to  obtain the amplitude response of the receive beam patterns. Note that we only need to take these calibration measurements once per type of device and they are independent of the deployment scenario. The measurements are stored in a ROM on the FPGA.\n\n\nEVALUATION\n\nWe now evaluate the performance of our mm-FLEX beam-alignment algorithm. Unless stated otherwise, we set up the experiments in an empty room of size 6 × 23 m, where reflections mainly come from the walls. To show that mm-FLEX works with Commercial-Off-The-Shelf (COTS) APs, we use mm-FLEX as the station and a commercial Talon AD7200 router as the AP. The Talon router uses Qualcomm's QCA9500 FullMAC IEEE 802.11ad Wi-Fi chip and a phased array antenna with 32 elements. We also perform tests with a Dell Wireless Dock D5000 station and a NETGEAR Nighthawk X10 router.\n\n\nFrame detection latency\n\nUFA critically depends on timely frame detection during preamble reception. If frame detection occurs late in the preamble, there may not be enough time to switch through directional receive beam patterns and back to the quasi-omnidirectional pattern before the end of the STF, which would compromise packet reception. Detection time primarily depends on the SNR. We therefore change the receiver gain to obtain different SNR values. Receive beam pattern switching at the station is disabled, to determine the exact remaining duration of the STF after the moment of frame detection.\n\nIn Fig. 6a we stack the delay for frame detection, the constant ADC-to-FPGA latency, the time required for 10 receive beam pattern changes, as well as the time for boundary detection. We also include a line at 6400 samples corresponding to the duration of the STF. We observe that for SNR values from 14 to -4 dB the frame detection delay indeed increases, but for all SNR values packet detection occurs early enough for our proposal to work. Moreover, as shown in Fig. 6b, for SNR values below 2 dB, most of the frames cannot be correctly decoded. SLS frames are control frames that have a more robust preamble than data frames, so that data communication at these SNR levels would be impossible. UFA thus works for all relevant SNR levels. \n\n\nAccuracy\n\nWe study the impact of the number of receive beam patterns during the preamble and the number of sectors in the SLS on the angle estimation accuracy, obtained over 920 measurements each, for a single AP and one station. The latter is rotated between −45 • and 45 • in steps of 2 • . Fig. 7 shows whisker plots with median, quartiles, extremes (± 1.5 IQR), and outliers. Despite the possible multi-path effect, our method is able to determine the direction of the AP with a mean error of 0.5 • with only 5 beam patterns (with a very small number of outliers). Fig. 8 shows the Cumulative Distribution Function (CDF) of the AoA estimation error, obtained with UFA for 3, 5 and 10 receive beam patterns. We show the case where we only consider a subset of transmit sectors (14 instead of all possible sectors in the SLS). For UFA-10BP, the CDF curve is well below 5 • for 97% of the cases and thus within the half power beam width of the antenna (∼10 • ). The algorithm achieves less than 4 • error for 95% of the cases and a median angle estimation error of 2 • . The performance of UFA-5BP is similar to the one of UFA-10BP without introducing any relevant accuracy loss. If we consider only three receive beam patterns, the selected beam pattern for communication would be sub-optimal as shown in the UFA-3BP curve. For UFA-5BP, the level of accuracy is more than sufficient for good beam alignment performance. \n\n\nSNR loss\n\nWhenever the estimated angle leads to the selection of a sub-optimal beam pattern, the SNR of the link will be lower by factor that corresponds to difference of the gains of the optimum versus the chosen antenna pattern at the true angle. We compare the SNR loss of UFA with 10 receive beam patterns to brute force beam training which always selects the optimal beam pattern. To determine SNR, we generate traffic from the AP to the station using iperf. After AoA estimation using UFA, we configure the station to receive the data packets using the beam pattern that provides the highest gain in the estimated direction. We then decode the data packets from the AP to determine the SNR. The SNR loss of UFA compared to exhaustive search is shown in Fig. 9. The mean SNR loss is close to zero for more than 3 receive beam patterns, and has no non-zero outliers for 5 beam patterns or more.\n\n\nMobility\n\nTo verify the angle estimation accuracy of UFA in real-time, we perform tests with rotation at a fixed location and trajectories through the room.\n\n\nRotation test I.\n\nFirst we use a setup where the mm-FLEX station is static but rotates on a pan/tilt platform, to be able to tightly control the angles. The receiver is steered following a triangular angle pattern sweeping to angles of 35 • and -35 • and back to 0 • . The complete cycle of the movement takes 2.8 seconds. After that, the system remains with the original orientation (pointing towards AP1). For this experiment we use 10 receive beam pattern changes. We deploy 5 APs in the room to show that UFA can reliably estimate angles to multiple APs at the same time, as pictured in Fig. 10. Furthermore, to show that UFA works with any standard-compliant IEEE 802.11ad hardware, we use different types of APs: one Talon AD7200 router (AP1), 3 Dell Wireless Dock D5000 stations (AP2, AP3, AP5), and a NETGEAR Nighthawk X10 (AP4). The distances to the station are: AP1 = 6 m, AP2 = 6.5 m, AP3 = 4.7 m, AP4 = 6.5 m and AP5 = 4.7 m. The results of this experiment are presented in Fig. 10. The initial ground truth angles for each AP are AP1 = 0 • , AP2 = 21.8 • , AP3 = 30.9 • , AP4 = −21.8 • , AP5 = −30.9 • . As expected, the figure shows the triangular angle rotation pattern and flat lines once rotation ends after 2.8 seconds. The rotation is relatively fast, corresponding to angle changes of 55 • per second. We further include in Fig. 10 \n\n\nRotation test II.\n\nWe perform an additional rotation test in an smaller scenario, a laboratory of 7 × 6 m, where windows and office furniture (chairs, desks, computers, etc.) create a richer multi-path environment. We deploy a single AP-station pair spaced 4 m apart and facing each other. The station is rotating following a pattern given by a gyroscope trace of a walking person [10,25], while the AP is in a fixed position. The results of the experiment are presented in Fig. 11, showing how the station implementing UFA is able to follow the trajectory over the duration of the experiments with a maximum absolute error of 5.1 o and a median error of 0.69 o , despite the more complex multi-path environment in the laboratory.\n\n\nHuman mobility I.\n\nWe also perform experiments with realtime human mobility in which the receiver is moved manually at walking speed along a trajectory within the room with four APs placed in the corners, as depicted in Fig. 12 extremely difficult since our manual angle measurements as well as those of an electronic compass devices have an angle error that is higher than the accuracy of our algorithm. While we could not compare against a sufficiently accurate ground truth, we expect the data to be smooth due to the continuity of the movement. We smooth the angle trajectory of each APs using a 10 sample window Savitzky-Golay filter and compare against it as we would compare against ground truth. This does not provide an absolute error but a relative error that indicates how far angle estimates stray from the smooth trajectory. The obtained errors for the measured paths are very accurate with 0.36 • , 0.22 • , 0.45 • , and 0.76 • for the respective APs. In addition, we observe that the angles change in the order we expect for the route followed, based on our manual angle estimation. This indicates that our results well match the angles observed throughout the experiment trajectory.\n\nTo avoid spurious estimates to influence the trajectory results of Fig. 12 due to multipath or bad quality signal, we apply the following condition as a filter: a minimum ratio p th of the observed power must be explained by the estimated direction expected measure, else we discard the result, i.e., E t ∥α t B(θ )∥ 2 /∥R t ∥ > p th . Following the previous derivations can be shown to correspond to\nE t | < R t , B(θ ) > |/∥R t ∥ > p th .\nFor our experiments this value is set to p th = 0.85.\n\n\nHuman mobility II.\n\nWe also perform an experiment in the smaller laboratory environment with a single AP-station pair, as shown in Fig. 13a. First, we take measurements with the AP moving from POS A to POS B at constant walking speed with the station in a fixed position. The result from Fig. 13b shows that UFA is able to estimate the trajectory with high accuracy and a median error of 0.39 o . Next, we test the system with both AP and station mobility: while the station is rotating following the human walking pattern trace [10,25], the AP is moving from POS A to POS B as in the experiment from Fig. 13b. The results in Fig. 13c show that the angle pattern is the combination of the angles in Fig. 13b and Fig.  11. Even with the difficulties derived from the dual movement, the error curve shows a maximum error of 10 o and a median of 0.78 o .\n\n\nScalability and overhead reduction\n\nWhile we only have two FPGA transceivers, since UFA is passive and simply removes station beam training overhead entirely, we can reliably estimate the overhead reduction by analyzing large standard IEEE 802.11ad deployments and discounting the station overhead. We test real-world deployments with up to 10 Talon routers, out of which 1 is configured as AP, 7 are stations, and 2 are in monitor mode to capture the IEEE 802.11ad traffic. The beam training frequency is vendor specific and in the Talon routers depends on the data traffic and medium utilization. For this reason we add background traffic of 250 MBit/s per station and compare actual measured overhead and extrapolated overhead. The extrapolated overhead is determined using the per station overhead (Sector Sweep during A-BFT and DTI, Sector Sweep Feedback, and Sector Sweep ACK) measured with 1 AP and 1 station, multiplied by the number of stations. This corresponds to deployments where the frequency of beam training cannot be reduced due to network dynamics. To compute the overhead reduction achieved by UFA, we divide the total overhead by the overhead caused by UFA (DMG Beacon, Sector Sweep Feedback, and Sector Sweep ACK). Fig. 14 shows measured and extrapolated beam training overhead. With 1 AP and 1 station, their overhead is approximately the same and thus IEEE 802.11ad has twice the overhead of UFA. For 4 stations, the extrapolated station overhead is 4 times larger and thus IEEE 802.11ad overhead is 5.1× that of UFA (left bar). The Talon routers actually both slightly increase the DMG Beacon frequency and significantly increase the station beam training frequency so that measured IEEE 802.11ad overhead is higher by a factor of 5.9. For 7 stations, the beam training frequency of stations is reduced due to the increase in data traffic with that many stations. Here, IEEE 802.11ad overhead is around 8× that of UFA, and measured and extrapolated overhead almost match.\n\n\nRELATED WORK\n\nWe first discuss works related to mm-wave testbeds and also briefly survey research on beam training improvements.\n\nmm-wave testbeds: Since the advent of mm-wave communication systems, different experimentation platforms have been proposed, each one trying to cover different types of experiments. Solutions differ in price, performance, flexibility, etc. The MiRa platform [2] uses the same baseband equipment typically used for sub-6GHz platforms, simple USRP software-defined radio devices, attached to a custom-made RF front-end in the 28GHz frequency band. Due to  the bandwidth constraints of the USRP baseband processor, only narrowband signal can be generated, which does not allow to study the characteristics of ultra wideband mm-wave channels. Besides, the signal processing functions are implemented in software which introduces a high latency and makes such a testbed unsuitable for certain applications. The phased array provides only coarse phase control, limiting its application for relatively simple directional applications. Despite that, its low cost makes it a good solution for simple research experiments. Recently, the solution from [13], use similar equipment as [2] but introduces the capability of implementing signal processing functions on the on-board FPGA. This reduces the latency and allows for the validation of hardware implemented algorithms. Despite that, it suffers from the similar disadvantages as [2]. The X60 testbed [23] in turn addresses the need for high-end full bandwidth systems and includes hardware equipment from National Instruments (NI) plus a phased array antenna kit with analog beam forming capabilities. X60 fulfills the bandwidth requirements of the IEEE 802.11ad standard, but due to the complex hardware has a comparatively high cost that makes it unaffordable for much of the research community. Furthermore, it has limited flexibility regarding the fast configuration of the antenna array. OpenMili from [35] increases the bandwidth capabilities compared to [2,13], but still does not meet the requirements of mm-wave standards, such as the IEEE 802.11ad [33]. Besides the custom-made phased array system only includes coarse phase control and its antenna control is limited. COTS devices have been used to perform mm-wave experiments. While this offers the cheapest solution, this approach does not provide access to the physical and lower MAC layers, which are important to develop and validate new MAC and signal processing solutions. The work from [29] modifies the firmware of a COTS device to allow access to some of the physical layer information (SNR, RSS, etc.), providing the basis for a variety of research efforts [11,15,16].\n\nM-Cube [36] makes use of an RF front-end with phased array antennas from a COTS device, which are connected to an FPGAbased baseband processor through a custom-made bridge board. The system sends the adequate control signals (acquired by means of reverse engineering) from the baseband processor to reconfigure the RF front-end. As drawbacks, the latency required to reconfigure the antenna array may be too high for certain applications such as the processing of TRN field of IEEE 802.11ad/ay frames. Besides, the separation of data and control paths via different devices reduces the flexibility of the testbed for dynamic environments. A very promising testbed design is to use mm-FLEX with the bridge board and RF front-end from [36] and which allows to have both control and data paths in the same device.\n\nWith mm-FLEX, we target the next milestone for mm-wave experimentation, mobility. The fast real-time antenna reconfiguration makes mm-FLEX an excellent choice for mobility experiments where fast beam-steering is important. Besides, it offers the flexibility to be used not only for IEEE 802.11ad-based systems but also with other mm-wave standards such as the IEEE 802.11ay, where fast beam steering is widely used during the beam training mechanism and also to track station movement in the data communication phase.\n\nTo summarize, in Table 1, we include a comparison between mm-FLEX and different mm-wave testbeds from the literature. The comparison includes cost, operating bandwidth (BW), easiness to upgrade the system functionality, antenna type included in the RF front-end, number of antenna elements and fast beam steering capability. Beam training: Beam training using the IEEE 802.11ad standard mechanism takes several milliseconds [15,30,37]. This may incur unacceptable latency and a very high overhead in mobile scenarios where beam training has to be performed frequently [1,9,21]. Mechanisms that reduce this overhead are mainly based on Compressed Sensing (CS) beam training, since the sparsity of the mm-wave channel makes it amenable to sparse estimation [19,28]. Recent approaches along this line [3,20,29] use RSS measurements to obtain angle information. However, they only take advantage of changing beam patterns at one side of the link, requiring three times more measurements for the same accuracy (15 instead of 5) and explicit station beam training, whereas our approach does not require per client beam training. In [29], both SNR and RSS measurements are used due to the noisy RSS values extracted from the COTS devices used for their experiments. Other works present simultaneous station training in 802.11ad [18,24], but none of those are compatible with legacy IEEE 802.11ad devices. A 2-step location algorithm is proposed in [12] were AP and STA share information to try to overcome the imperfect position problem, however this work is only simulation based and the overhead is unclear. In [5], the authors extract the association directions from the A-BFT, but their focus is on maximizing the number of concurrent paths whereas the application we showcase aims to reduce the beam training overhead. We provide better mobility support by eliminating station beam training whereas prior work requires active station beam training. Our approach is compatible with current 802.11ad deployments, does not affect legacy stations and can be implemented on current devices using only firmware modifications.\n\n\nCONCLUSIONS AND REMARKS\n\nIn this paper we propose mm-FLEX, a flexible, modular and reconfigurable testbed suitable for experiments in mm-wave ultra wideband channels. Our proposal allows easy integration and verification of hardware processing blocks as well as real-time control of phased array antennas for experiments in high mobility scenarios. The open-source nature of our mm-wave system makes it an ideal platform for the research community to modify and extend the functionality as needed. The design is powerful enough to allow for complex low level changes to the mm-wave signal processing, and at the same time offers a simple ready-to-use platform for researchers that want to focus on the higher layers of the protocol stack, using the physical layer implementation as is. We test the most important features of mm-FLEX by implementing a mechanism for fast IEEE 802.11ad beam training. To this end, we make use of the powerful beam pattern switching capabilities of mm-FLEX together with fast RSS measurements. Our evaluation shows that mm-FLEX provides extremely accurate angle measurements at the station that indicate the best station beam pattern to be used, using only a reduced set of measurement during a single preamble of a received frame. This obviates the need for active station beam training and thus significantly reduces the beam training overhead for dense and mobile networks.\n\n\nACKNOWLEDGMENT\n\nThis work was supported in part by the Region of Madrid through TAPIR-CM (S2018/TCS-4496) and PinPoint5G+ RTI2018-094313-B-I00 (MCIU/AEI/FEDER, UE).\n\nFigure 1 :\n1mm-FLEX top-level architecture showing Tx and Rx data paths and control path\n\nFigure 2 :\n2mm-FLEX main components\n\nFigure 3 :\n3Example of received IEEE 802.11ad frames of stations. Directional mm-wave communication requires proper\n\n\nR t = [RSS t ,1 , . . . , RSS t ,M ] be the vector containing the M different RSS measurements. For the receive beam patterns, let G denote the size of the grid of the possible angles for which the antenna gain is known. Therefore, b m = [b m (θ 1 ), . . . , b m (θ G )] defines the shape of the m th receive beam pattern and B = [B(θ 1 ), . . . , B(θ G )] T is the matrix with columns containing the measurement of b m (θ i ) ∀m.\n\nFigure 6 :\n6Frame detection for different SNR values\n\nFigure 7 :\n7Angle error for different reception beam patterns\n\nFigure 8 :\n8CDF of the AoA estimation error for an AP with 14 sectors\n\nFigure 9 :\n9SNR-loss of UFA compared to exhaustive search\n\nFigure 10 :Figure 11 :\n1011the absolute angle error over time for the 5 APs. The median angle estimation errors for the APs are 1.17 • , 0.83 • , 0.99 • , 0.63 • , and 1.21 • , respectively. Given that our pan/tilt system and mm-FLEX are not perfectly time synchronized and a 1 • error corresponds to only a 18 ms time shift, these results are within the measurement accuracy of our setup. Real-time rotation of the station with 5 APs at different positions in the room (left) and experimental setup for rotation experiment (right) Real-time rotation of the station following the mobility trace of a person walking\n\nFigure 12 :\n12. The APs are performing SLS one at a time every 102 ms. Because of the different beam width apertures and the orientations of the receiver at each point, different APs are observed during different parts of the trajectory, as shown inFig. 12. Obtaining ground truth angles for this setup Angle of estimated LOS path for mobility experiment with 4 APs (left) and experimental setup for mobility experiment (right)\n\nFigure 13 :\n13Both AP and station mobility in a laboratory environment\n\nFigure 14 :\n14Measured (left bar) and extrapolated (right bar) overhead of IEEE 802.11ad and UFA, with the overhead ratio of IEEE 802.11ad divided by UFA shown on top of the bars\n\nTable 1 :\n1Comparison of mm-FLEX and existing mm-wave testbedsmm-\nFLEX \n\nOpen-Mili \n[35] \n\nRFNoC-based \n[13] \nX60 [23] \n\nCOST \n40K \n29K \n24K \n200K \nBW \n2GHz \n1GHz \n200MHz \n2GHz \nUPGRADING \nYES \nLIMITED \nLIMITED \nDIFFICULT \nANT. TYPE \nARRAY \nARRAY \nHORN \nARRAY \nANT. ELEM. \n16+16 \n4 \n1 \n12 \nFAST BEAM \nSTEERING \nYES \nNO \nNO \nNO \n\n\nFor simplicity, in this work only the preamble is processed on the FPGA in realtime, while frame decoding is done offline. However, the FPGA is large enough for a standard-compliant real-time IEEE 802.11ad transceiver and we intend to implement this in the future.\nmm-FLEX: An Open Platform for mm-Wave Experimentation\nOnly Error Vector Magnitude (EVM) measurements are defined with an SRRC filter (roll-off = 0.25) \nMobiSys '20, June 15-19, 2020, Toronto, ON, Canada\nSince our FPGA implementation does not include real-time frame decoding, the ACK frames for the data packets from the AP are sent by a Talon router in station mode located next to the FPGA.\nmm-FLEX: An Open Platform for mm-Wave Experimentation MobiSys '20, June 15-19, 2020, Toronto, ON, Canada\n\nCutting the Cord in Virtual Reality. Omid Abari, Dinesh Bharadia, Austin Duffield, Dina Katabi, 10.1145/3005745.3005770Proceedings of the 15th ACM Workshop on Hot Topics in Networks (HotNets '16). the 15th ACM Workshop on Hot Topics in Networks (HotNets '16)New York, NY, USAAssociation for Computing MachineryOmid Abari, Dinesh Bharadia, Austin Duffield, and Dina Katabi. 2016. Cutting the Cord in Virtual Reality. In Proceedings of the 15th ACM Workshop on Hot Topics in Networks (HotNets '16). Association for Computing Machinery, New York, NY, USA, 162-168. https://doi.org/10.1145/3005745.3005770\n\nPoster: A Millimeter Wave Software Defined Radio Platform with Phased Arrays. Omid Abari, Haitham Hassanieh, Michael Rodriguez, Dina Katabi, 10.1145/2973750.2985258Proceedings of the 22Nd Annual International Conference on Mobile Computing and Networking (MobiCom '16). the 22Nd Annual International Conference on Mobile Computing and Networking (MobiCom '16)New York, NY, USAACMOmid Abari, Haitham Hassanieh, Michael Rodriguez, and Dina Katabi. 2016. Poster: A Millimeter Wave Software Defined Radio Platform with Phased Arrays. In Proceedings of the 22Nd Annual International Conference on Mobile Computing and Networking (MobiCom '16). ACM, New York, NY, USA, 419-420. https: //doi.org/10.1145/2973750.2985258\n\nFast Millimeter Wave Beam Alignment. Haitham Hassanieh, Omid Abari, Michael Rodriguez, Mohammed Abdelghany, Dina Katabi, Piotr Indyk, 10.1145/3230543.3230581Proceedings of the 2018 Conference of the ACM Special Interest Group on Data Communication (SIGCOMM '18). the 2018 Conference of the ACM Special Interest Group on Data Communication (SIGCOMM '18)New York, NY, USAAssociation for Computing MachineryHaitham Hassanieh, Omid Abari, Michael Rodriguez, Mohammed Abdelghany, Dina Katabi, and Piotr Indyk. 2018. Fast Millimeter Wave Beam Alignment. In Proceedings of the 2018 Conference of the ACM Special Interest Group on Data Communication (SIGCOMM '18). Association for Computing Machinery, New York, NY, USA, 432-445. https://doi.org/10.1145/3230543.3230581\n\nSerial Interface for Data Converters (JESD204B). JEDEC Solid State Technology AssociationJEDEC Solid State Technology Association. 2017. Serial Interface for Data Con- verters (JESD204B). (2017). http://www.jedec.org/standards-documents/results/ jesd204\n\nMany-to-Many Beam Alignment in Millimeter Wave Networks. Suraj Jog, Jiaming Wang, Junfeng Guan, Thomas Moon, Haitham Hassanieh, Romit Roy Choudhury, 16th USENIX Symposium on Networked Systems Design and Implementation (NSDI 19). USENIX Association. Boston, MASuraj Jog, Jiaming Wang, Junfeng Guan, Thomas Moon, Haitham Hassanieh, and Romit Roy Choudhury. 2019. Many-to-Many Beam Alignment in Millimeter Wave Networks. In 16th USENIX Symposium on Networked Systems Design and Implementation (NSDI 19). USENIX Association, Boston, MA, 783-800. https: //www.usenix.org/conference/nsdi19/presentation/jog\n\n2020. mm-FLEX: Millimeter Wave Mobile Full-Bandwidth Experimentation Platform. Jesus Omar Lacruz, Joerg Widmer, Jesus Omar Lacruz and Joerg Widmer. 2020. mm-FLEX: Millimeter Wave Mobile Full-Bandwidth Experimentation Platform. (2020). http://wireless.networks. imdea.org/mmflex\n\nDual-Mode All-Digital Baseband Receiver With a Feed-Forward and Shared-Memory Architecture for Dual-Standard Over 60 GHz NLOS Channel. Chun-Yi Liu, Meng-Siou Sie, Edmund W J Leong, Yu-Cheng Yao, Chih-Wei Jen, Wei-Chang Liu, Chih-Feng Wu, Shyh-Jye Jou, IEEE Transactions on Circuits and Systems I: Regular Papers. Chun-Yi Liu, Meng-Siou Sie, Edmund W. J. Leong, Yu-Cheng Yao, Chih-Wei Jen, Wei-Chang Liu, Chih-Feng Wu, and Shyh-Jye Jou. 2017. Dual-Mode All-Digital Baseband Receiver With a Feed-Forward and Shared-Memory Architecture for Dual-Standard Over 60 GHz NLOS Channel. IEEE Transactions on Circuits and Systems I: Regular Papers (2017).\n\nAll-Digital Synchronization for SC/OFDM Mode of IEEE 802.15.3c and IEEE 802.11ad. Wei-Chang Liu, Ting-Chen Wei, Ya-Shiue Huang, Ching-Da Chan, Shyh-Jye Jou, IEEE Transactions on Circuits and Systems I: Regular Papers. Wei-Chang Liu, Ting-Chen Wei, Ya-Shiue Huang, Ching-Da Chan, and Shyh-Jye Jou. 2015. All-Digital Synchronization for SC/OFDM Mode of IEEE 802.15.3c and IEEE 802.11ad. IEEE Transactions on Circuits and Systems I: Regular Papers (2015).\n\n2017. mm-Wave on wheels: Practical 60 GHz vehicular communication without beam training. A Loch, A Asadi, G H Sim, J Widmer, M Hollick, 2017 9th International Conference on Communication Systems and Networks (COMSNETS. A. Loch, A. Asadi, G. H. Sim, J. Widmer, and M. Hollick. 2017. mm-Wave on wheels: Practical 60 GHz vehicular communication without beam training. In 2017 9th International Conference on Communication Systems and Networks (COMSNETS). 1-8.\n\nZero Overhead Device Tracking in 60 GHz Wireless Networks using Multi-Lobe Beam Patterns. Adrian Loch, Hany Assasa, Joan Palacios, Joerg Widmer, Hans Suys, Björn Debaillie, 10.1145/3143361.3143395Proceedings of the 13th International Conference on Emerging Networking EXperiments and Technologies (CoNEXT '17). the 13th International Conference on Emerging Networking EXperiments and Technologies (CoNEXT '17)New York, NY, USAAssociation for Computing MachineryAdrian Loch, Hany Assasa, Joan Palacios, Joerg Widmer, Hans Suys, and Björn Debaillie. 2017. Zero Overhead Device Tracking in 60 GHz Wireless Networks using Multi-Lobe Beam Patterns. In Proceedings of the 13th International Con- ference on Emerging Networking EXperiments and Technologies (CoNEXT '17). Association for Computing Machinery, New York, NY, USA, 224-237. https: //doi.org/10.1145/3143361.3143395\n\nPractical Lower Layer 60 GHz Measurements Using Commercial Off-the-shelf Hardware. Adrian Loch, Guillermo Bielsa, Joerg Widmer, Proceedings of the Tenth ACM International Workshop on Wireless Network Testbeds, Experimental Evaluation, and Characterization (WiNTECH '16). the Tenth ACM International Workshop on Wireless Network Testbeds, Experimental Evaluation, and Characterization (WiNTECH '16)New York, NY, USAACMAdrian Loch, Guillermo Bielsa, and Joerg Widmer. 2016. Practical Lower Layer 60 GHz Measurements Using Commercial Off-the-shelf Hardware. In Proceedings of the Tenth ACM International Workshop on Wireless Network Testbeds, Experimental Evaluation, and Characterization (WiNTECH '16). ACM, New York, NY, USA, 9- 16.\n\nRobust Location-Aided Beam Alignment in Millimeter Wave Massive MIMO. F Maschietti, D Gesbert, P De Kerret, H Wymeersch, GLOBECOM 2017 -2017 IEEE Global Communications Conference. F. Maschietti, D. Gesbert, P. de Kerret, and H. Wymeersch. 2017. Robust Location- Aided Beam Alignment in Millimeter Wave Massive MIMO. In GLOBECOM 2017 -2017 IEEE Global Communications Conference. 1-6.\n\nOpen Source RFNoC-Based Testbed for Millimeter-Wave Experimentation Using USRP Software Defined Radios. Adriana Moreno, Jesus O Lacruz, Joerg Widmer, International Symposium on Circuits and Systems (ISCAS-2020). Adriana Moreno, Jesus O. Lacruz, and Joerg Widmer. 2020. Open Source RFNoC- Based Testbed for Millimeter-Wave Experimentation Using USRP Software De- fined Radios. In International Symposium on Circuits and Systems (ISCAS-2020).\n\nIEEE 802.11ad: directional 60 GHz communication for multi-Gigabit-persecond Wi-Fi. T Nitsche, C Cordeiro, A B Flores, E W Knightly, E Perahia, J C Widmer, Invited PaperT. Nitsche, C. Cordeiro, A. B. Flores, E. W. Knightly, E. Perahia, and J. C. Widmer. 2014. IEEE 802.11ad: directional 60 GHz communication for multi-Gigabit-per- second Wi-Fi [Invited Paper].\n\n. IEEE Communications Magazine. 52IEEE Communications Magazine 52, 12 (2014), 132-141.\n\nLEAP: Location Estimation and Predictive Handover with Consumer-Grade mmWave Devices. J Palacios, P Casari, H Assasa, J Widmer, IEEE INFOCOM 2019 -IEEE Conference on Computer Communications. J. Palacios, P. Casari, H. Assasa, and J. Widmer. 2019. LEAP: Location Estima- tion and Predictive Handover with Consumer-Grade mmWave Devices. In IEEE INFOCOM 2019 -IEEE Conference on Computer Communications. 2377-2385.\n\nAdaptive Codebook Optimization for Beam Training on Off-the-Shelf IEEE 802.11Ad Devices. Joan Palacios, Daniel Steinmetzer, Adrian Loch, Matthias Hollick, Joerg Widmer, Proceedings of the 24th Annual International Conference on Mobile Computing and Networking (MobiCom '18). the 24th Annual International Conference on Mobile Computing and Networking (MobiCom '18)New York, NY, USAACMJoan Palacios, Daniel Steinmetzer, Adrian Loch, Matthias Hollick, and Joerg Widmer. 2018. Adaptive Codebook Optimization for Beam Training on Off-the- Shelf IEEE 802.11Ad Devices. In Proceedings of the 24th Annual International Conference on Mobile Computing and Networking (MobiCom '18). ACM, New York, NY, USA, 241-255.\n\nDigital synchronization for symbol-spaced IEEE802.11ad Gigabit mmWave systems. N Preyss, A Burg, 2015 IEEE International Conference on Electronics, Circuits, and Systems (ICECS). N. Preyss and A. Burg. 2015. Digital synchronization for symbol-spaced IEEE802.11ad Gigabit mmWave systems. In 2015 IEEE International Conference on Electronics, Circuits, and Systems (ICECS). 637-640.\n\nMAC-layer concurrent beamforming protocol for indoor millimeter-wave networks. J Qiao, X Shen, J W Mark, Y He, IEEE Transactions on Vehicular Technology. 64J. Qiao, X. Shen, J. W. Mark, and Y. He. 2015. MAC-layer concurrent beamforming protocol for indoor millimeter-wave networks. IEEE Transactions on Vehicular Technology 64, 1 (2015), 327-338.\n\nBroadband Millimeter-Wave Propagation Measurements and Models Using Adaptive-Beam Antennas for Outdoor Urban Cellular Communications. T S Rappaport, F Gutierrez, E Ben-Dor, J N Murdock, Y Qiao, J I Tamir, IEEE Transactions on Antennas and Propagation. 61T. S. Rappaport, F. Gutierrez, E. Ben-Dor, J. N. Murdock, Y. Qiao, and J. I. Tamir. 2013. Broadband Millimeter-Wave Propagation Measurements and Models Using Adaptive-Beam Antennas for Outdoor Urban Cellular Communications. IEEE Transactions on Antennas and Propagation 61, 4 (2013), 1850-1859.\n\nNoncoherent MmWave Path Tracking. Maryam Eslami Rasekh, Zhinus Marzi, Yanzi Zhu, Upamanyu Madhow, Haitao Zheng, 10.1145/3032970.3032974Proceedings of the 18th International Workshop on Mobile Computing Systems and Applications (HotMobile '17). the 18th International Workshop on Mobile Computing Systems and Applications (HotMobile '17)New York, NY, USAAssociation for Computing MachineryMaryam Eslami Rasekh, Zhinus Marzi, Yanzi Zhu, Upamanyu Madhow, and Haitao Zheng. 2017. Noncoherent MmWave Path Tracking. In Proceedings of the 18th International Workshop on Mobile Computing Systems and Applications (HotMobile '17). Association for Computing Machinery, New York, NY, USA, 13-18. https://doi.org/10.1145/3032970.3032974\n\nVehicular Millimeter Wave Communications: Opportunities and Challenges. Robert W Heath, Robert W. Heath. 2015. Vehicular Millimeter Wave Communications: Opportuni- ties and Challenges. (2015). http://users.ece.utexas.edu/~rheath/presentations/ 2015/DSTOPvehicularMmWave2015Heath.pdf\n\nMillimeter-wave beamforming as an enabling technology for 5G cellular communications: Theoretical feasibility and prototype results. W Roh, J Seol, J Park, B Lee, J Lee, Y Kim, J Cho, K Cheun, F Aryanfar, IEEE Communications Magazine. 52W. Roh, J. Seol, J. Park, B. Lee, J. Lee, Y. Kim, J. Cho, K. Cheun, and F. Aryanfar. 2014. Millimeter-wave beamforming as an enabling technology for 5G cellular communications: Theoretical feasibility and prototype results. IEEE Communica- tions Magazine 52, 2 (2014), 106-113.\n\nX60: A programmable testbed for wideband 60 GHz WLANs with phased arrays. Yasaman Swetank Kumar Saha, Muhammad Kumail Ghasempour, Tariq Haider, Paulo De Siddiqui, Neerad Melo, Luke Somanchi, Arjun Zakrajsek, Roshan Singh, Owen Shyamsunder, Torres, 10.1016/j.comcom.2018.09.005Computer Communications. 133Swetank Kumar Saha, Yasaman Ghasempour, Muhammad Kumail Haider, Tariq Siddiqui, Paulo De Melo, Neerad Somanchi, Luke Zakrajsek, Arjun Singh, Roshan Shyamsunder, Owen Torres, et al. 2019. X60: A programmable testbed for wide- band 60 GHz WLANs with phased arrays. Computer Communications 133 (2019), 77 -88. https://doi.org/10.1016/j.comcom.2018.09.005\n\nTwo-dimensional reduction of beam training overhead in crowded 802.11ad based networks. S Shao, H Zhang, D Koutsonikolas, A Khreishah, IEEE INFOCOM 2018 -IEEE Conference on Computer Communications Workshops (INFOCOM WKSHPS. S. Shao, H. Zhang, D. Koutsonikolas, and A. Khreishah. 2018. Two-dimensional reduction of beam training overhead in crowded 802.11ad based networks. In IEEE INFOCOM 2018 -IEEE Conference on Computer Communications Workshops (INFOCOM WKSHPS). 680-685.\n\nFusion of Smartphone Motion Sensors for Physical Activity Recognition. Muhammad Shoaib, Stephan Bosch, Ozlem D Incel, Hans Scholten, Paul J M Havinga, Sensors. 14Muhammad Shoaib, Stephan Bosch, Ozlem D. Incel, Hans Scholten, and Paul J.M. Havinga. 2014. Fusion of Smartphone Motion Sensors for Physical Activity Recognition. Sensors 14, 6 (2014), 10146-10176.\n\nSIVERSIMA. EVK06002 Development Kit. SIVERSIMA. 2018. EVK06002 Development Kit. (2018). https://www.siversima. com/product/evk-600200\n\nEVK02001 28 GHz Development Kit. Siversima, SIVERSIMA. 2019. EVK02001 28 GHz Development Kit. (2019). https://www. siversima.com/product/evk-02001-00/\n\nStatistical Characterization of 60-GHz Indoor Radio Channels. P F M Smulders, IEEE Transactions on Antennas and Propagation. 57P. F. M. Smulders. 2009. Statistical Characterization of 60-GHz Indoor Radio Channels. IEEE Transactions on Antennas and Propagation 57, 10 (2009), 2820- 2829.\n\nCompressive Millimeter-Wave Sector Selection in Offthe-Shelf IEEE 802.11ad Devices. Daniel Steinmetzer, Daniel Wegemer, Matthias Schulz, Joerg Widmer, Matthias Hollick, 10.1145/3143361.3143384Proceedings of the 13th International Conference on Emerging Networking EXperiments and Technologies (CoNEXT '17). the 13th International Conference on Emerging Networking EXperiments and Technologies (CoNEXT '17)New York, NY, USAAssociation for Computing MachineryDaniel Steinmetzer, Daniel Wegemer, Matthias Schulz, Joerg Widmer, and Matthias Hollick. 2017. Compressive Millimeter-Wave Sector Selection in Off- the-Shelf IEEE 802.11ad Devices. In Proceedings of the 13th International Con- ference on Emerging Networking EXperiments and Technologies (CoNEXT '17). Association for Computing Machinery, New York, NY, USA, 414-425. https: //doi.org/10.1145/3143361.3143384\n\nWiFi-Assisted 60 GHz Wireless Networks. Sanjib Sur, Ioannis Pefkianakis, Xinyu Zhang, Kyu-Han Kim, 10.1145/3117811.3117817Proceedings of the 23rd Annual International Conference on Mobile Computing and Networking (MobiCom '17). the 23rd Annual International Conference on Mobile Computing and Networking (MobiCom '17)New York, NY, USAAssociation for Computing MachinerySanjib Sur, Ioannis Pefkianakis, Xinyu Zhang, and Kyu-Han Kim. 2017. WiFi- Assisted 60 GHz Wireless Networks. In Proceedings of the 23rd Annual In- ternational Conference on Mobile Computing and Networking (MobiCom '17). Association for Computing Machinery, New York, NY, USA, 28-41. https: //doi.org/10.1145/3117811.3117817\n\nVadatech, AMC599 board. Vadatech. 2018. AMC599 board. (2018). https://www.vadatech.com/media/ AMC599_AMC599_Datasheet.pdf\n\nVadatech, AMC726 board. Vadatech. 2018. AMC726 board. (2018). https://www.vadatech.com/media/ AMC726_AMC726_Datasheet.pdf\n\nWireless LAN Medium Access Control (MAC) and Physical Layer (PHY) Specifications Amendment 3: Enhancements for Very High Throughput in the 60 GHz Band. IEEE Standard. 80211IEEE 802.11 working groupIEEE 802.11 working group. 2012. Wireless LAN Medium Access Control (MAC) and Physical Layer (PHY) Specifications Amendment 3: Enhancements for Very High Throughput in the 60 GHz Band. IEEE Standard 802.11ad (2012).\n\nIEEE Draft Standard for Information Technology-Telecommunications and Information Exchange Between Systems Local and Metropolitan Area Networks-Specific Requirements Part 11: Wireless LAN Medium Access Control (MAC) and Physical Layer (PHY) Specifications-Amendment: Enhanced Throughput for Operation in License-Exempt Bands Above 45 GHz. P802.11ay/D3.0IEEE 802.11 working groupIEEE 802.11 working group. 2019. IEEE Draft Standard for Information Technology-Telecommunications and Information Exchange Between Systems Local and Metropolitan Area Networks-Specific Requirements Part 11: Wireless LAN Medium Access Control (MAC) and Physical Layer (PHY) Specifications- Amendment: Enhanced Throughput for Operation in License-Exempt Bands Above 45 GHz. IEEE P802.11ay/D3.0 (2019).\n\nOpenMili: A 60 GHz Software Radio Platform with a Reconfigurable Phasedarray Antenna. Jialiang Zhang, Xinyu Zhang, Pushkar Kulkarni, Parameswaran Ramanathan, 10.1145/2973750.2973760Proceedings of the 22Nd Annual International Conference on Mobile Computing and Networking (MobiCom '16). the 22Nd Annual International Conference on Mobile Computing and Networking (MobiCom '16)New York, NY, USAACMJialiang Zhang, Xinyu Zhang, Pushkar Kulkarni, and Parameswaran Ramanathan. 2016. OpenMili: A 60 GHz Software Radio Platform with a Reconfigurable Phased- array Antenna. In Proceedings of the 22Nd Annual International Conference on Mobile Computing and Networking (MobiCom '16). ACM, New York, NY, USA, 162-175. https://doi.org/10.1145/2973750.2973760\n\nM-Cube: A Millimeter-Wave Massive MIMO Software Radio. R Zhao, T Woodford, T Wei, Q Kun, X Zhang, ACM MobiCom. R. Zhao, T. Woodford, T. Wei, Q. Kun, and X. Zhang. 2020. M-Cube: A Millimeter- Wave Massive MIMO Software Radio. In ACM MobiCom.\n\nDemystifying 60GHz Outdoor Picocells. Yibo Zhu, Zengbin Zhang, Zhinus Marzi, Chris Nelson, Upamanyu Madhow, Ben Y Zhao, Haitao Zheng, 10.1145/2639108.2639121Proceedings of the 20th Annual International Conference on Mobile Computing and Networking (MobiCom '14). the 20th Annual International Conference on Mobile Computing and Networking (MobiCom '14)New York, NY, USAAssociation for Computing MachineryYibo Zhu, Zengbin Zhang, Zhinus Marzi, Chris Nelson, Upamanyu Madhow, Ben Y. Zhao, and Haitao Zheng. 2014. Demystifying 60GHz Outdoor Picocells. In Proceedings of the 20th Annual International Conference on Mobile Computing and Networking (MobiCom '14). Association for Computing Machinery, New York, NY, USA, 5-16. https://doi.org/10.1145/2639108.2639121\n", "annotations": {"author": "[{\"end\":160,\"start\":115},{\"end\":201,\"start\":161},{\"end\":245,\"start\":202},{\"end\":252,\"start\":246},{\"end\":291,\"start\":253},{\"end\":328,\"start\":292},{\"end\":347,\"start\":329},{\"end\":363,\"start\":348},{\"end\":384,\"start\":364},{\"end\":399,\"start\":385},{\"end\":413,\"start\":400},{\"end\":453,\"start\":414},{\"end\":526,\"start\":454},{\"end\":599,\"start\":527},{\"end\":672,\"start\":600},{\"end\":712,\"start\":673}]", "publisher": null, "author_last_name": "[{\"end\":132,\"start\":126},{\"end\":175,\"start\":169},{\"end\":215,\"start\":208},{\"end\":266,\"start\":258},{\"end\":304,\"start\":298},{\"end\":346,\"start\":340},{\"end\":362,\"start\":356},{\"end\":383,\"start\":378},{\"end\":398,\"start\":390}]", "author_first_name": "[{\"end\":120,\"start\":115},{\"end\":125,\"start\":121},{\"end\":168,\"start\":161},{\"end\":207,\"start\":202},{\"end\":251,\"start\":246},{\"end\":257,\"start\":253},{\"end\":297,\"start\":292},{\"end\":334,\"start\":329},{\"end\":339,\"start\":335},{\"end\":355,\"start\":348},{\"end\":369,\"start\":364},{\"end\":377,\"start\":370},{\"end\":389,\"start\":385},{\"end\":405,\"start\":400},{\"end\":412,\"start\":406}]", "author_affiliation": "[{\"end\":452,\"start\":415},{\"end\":525,\"start\":455},{\"end\":598,\"start\":528},{\"end\":671,\"start\":601},{\"end\":711,\"start\":674}]", "title": "[{\"end\":84,\"start\":1},{\"end\":796,\"start\":713}]", "venue": "[{\"end\":898,\"start\":798}]", "abstract": "[{\"end\":2478,\"start\":1328}]", "bib_ref": "[{\"attributes\":{\"ref_id\":\"b33\"},\"end\":2569,\"start\":2565},{\"attributes\":{\"ref_id\":\"b34\"},\"end\":2605,\"start\":2601},{\"attributes\":{\"ref_id\":\"b22\"},\"end\":3007,\"start\":3003},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":5000,\"start\":4997},{\"attributes\":{\"ref_id\":\"b23\"},\"end\":5219,\"start\":5215},{\"attributes\":{\"ref_id\":\"b35\"},\"end\":5485,\"start\":5481},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":5530,\"start\":5527},{\"attributes\":{\"ref_id\":\"b23\"},\"end\":5573,\"start\":5569},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":5618,\"start\":5615},{\"attributes\":{\"ref_id\":\"b36\"},\"end\":5727,\"start\":5723},{\"attributes\":{\"ref_id\":\"b23\"},\"end\":6487,\"start\":6483},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":6585,\"start\":6582},{\"attributes\":{\"ref_id\":\"b35\"},\"end\":6588,\"start\":6585},{\"attributes\":{\"ref_id\":\"b27\"},\"end\":8047,\"start\":8043},{\"attributes\":{\"ref_id\":\"b33\"},\"end\":8266,\"start\":8262},{\"attributes\":{\"ref_id\":\"b13\"},\"end\":8625,\"start\":8621},{\"attributes\":{\"ref_id\":\"b5\"},\"end\":10900,\"start\":10897},{\"attributes\":{\"ref_id\":\"b27\"},\"end\":12377,\"start\":12373},{\"attributes\":{\"ref_id\":\"b31\"},\"end\":12585,\"start\":12581},{\"attributes\":{\"ref_id\":\"b32\"},\"end\":12646,\"start\":12642},{\"attributes\":{\"ref_id\":\"b34\"},\"end\":13356,\"start\":13352},{\"attributes\":{\"ref_id\":\"b16\"},\"end\":15983,\"start\":15980},{\"attributes\":{\"ref_id\":\"b16\"},\"end\":17297,\"start\":17295},{\"attributes\":{\"ref_id\":\"b33\"},\"end\":20596,\"start\":20592},{\"attributes\":{\"ref_id\":\"b6\"},\"end\":20997,\"start\":20994},{\"attributes\":{\"ref_id\":\"b7\"},\"end\":20999,\"start\":20997},{\"attributes\":{\"ref_id\":\"b17\"},\"end\":21002,\"start\":20999},{\"attributes\":{\"ref_id\":\"b33\"},\"end\":23440,\"start\":23436},{\"attributes\":{\"ref_id\":\"b3\"},\"end\":24348,\"start\":24345},{\"attributes\":{\"ref_id\":\"b26\"},\"end\":26038,\"start\":26034},{\"attributes\":{\"ref_id\":\"b33\"},\"end\":28131,\"start\":28127},{\"attributes\":{\"ref_id\":\"b33\"},\"end\":28506,\"start\":28502},{\"attributes\":{\"ref_id\":\"b3\"},\"end\":36328,\"start\":36325},{\"attributes\":{\"ref_id\":\"b6\"},\"end\":37523,\"start\":37520},{\"attributes\":{\"ref_id\":\"b7\"},\"end\":37525,\"start\":37523},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":45592,\"start\":45588},{\"attributes\":{\"ref_id\":\"b25\"},\"end\":45595,\"start\":45592},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":48170,\"start\":48166},{\"attributes\":{\"ref_id\":\"b25\"},\"end\":48173,\"start\":48170},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":50880,\"start\":50877},{\"attributes\":{\"ref_id\":\"b12\"},\"end\":51664,\"start\":51660},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":51694,\"start\":51691},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":51944,\"start\":51941},{\"attributes\":{\"ref_id\":\"b23\"},\"end\":51966,\"start\":51962},{\"attributes\":{\"ref_id\":\"b35\"},\"end\":52473,\"start\":52469},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":52526,\"start\":52523},{\"attributes\":{\"ref_id\":\"b12\"},\"end\":52529,\"start\":52526},{\"attributes\":{\"ref_id\":\"b33\"},\"end\":52624,\"start\":52620},{\"attributes\":{\"ref_id\":\"b29\"},\"end\":53021,\"start\":53017},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":53195,\"start\":53191},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":53198,\"start\":53195},{\"attributes\":{\"ref_id\":\"b16\"},\"end\":53201,\"start\":53198},{\"attributes\":{\"ref_id\":\"b36\"},\"end\":53215,\"start\":53211},{\"attributes\":{\"ref_id\":\"b36\"},\"end\":53941,\"start\":53937},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":54963,\"start\":54959},{\"attributes\":{\"ref_id\":\"b30\"},\"end\":54966,\"start\":54963},{\"attributes\":{\"ref_id\":\"b37\"},\"end\":54969,\"start\":54966},{\"attributes\":{\"ref_id\":\"b0\"},\"end\":55106,\"start\":55103},{\"attributes\":{\"ref_id\":\"b8\"},\"end\":55108,\"start\":55106},{\"attributes\":{\"ref_id\":\"b21\"},\"end\":55111,\"start\":55108},{\"attributes\":{\"ref_id\":\"b19\"},\"end\":55294,\"start\":55290},{\"attributes\":{\"ref_id\":\"b28\"},\"end\":55297,\"start\":55294},{\"attributes\":{\"ref_id\":\"b2\"},\"end\":55336,\"start\":55333},{\"attributes\":{\"ref_id\":\"b20\"},\"end\":55339,\"start\":55336},{\"attributes\":{\"ref_id\":\"b29\"},\"end\":55342,\"start\":55339},{\"attributes\":{\"ref_id\":\"b29\"},\"end\":55665,\"start\":55661},{\"attributes\":{\"ref_id\":\"b18\"},\"end\":55860,\"start\":55856},{\"attributes\":{\"ref_id\":\"b24\"},\"end\":55863,\"start\":55860},{\"attributes\":{\"ref_id\":\"b11\"},\"end\":55980,\"start\":55976},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":56144,\"start\":56141},{\"attributes\":{\"ref_id\":\"b25\"},\"end\":61196,\"start\":61193}]", "figure": "[{\"attributes\":{\"id\":\"fig_0\"},\"end\":58318,\"start\":58229},{\"attributes\":{\"id\":\"fig_1\"},\"end\":58355,\"start\":58319},{\"attributes\":{\"id\":\"fig_2\"},\"end\":58472,\"start\":58356},{\"attributes\":{\"id\":\"fig_3\"},\"end\":58905,\"start\":58473},{\"attributes\":{\"id\":\"fig_5\"},\"end\":58959,\"start\":58906},{\"attributes\":{\"id\":\"fig_6\"},\"end\":59022,\"start\":58960},{\"attributes\":{\"id\":\"fig_7\"},\"end\":59093,\"start\":59023},{\"attributes\":{\"id\":\"fig_8\"},\"end\":59152,\"start\":59094},{\"attributes\":{\"id\":\"fig_9\"},\"end\":59768,\"start\":59153},{\"attributes\":{\"id\":\"fig_10\"},\"end\":60197,\"start\":59769},{\"attributes\":{\"id\":\"fig_11\"},\"end\":60269,\"start\":60198},{\"attributes\":{\"id\":\"fig_13\"},\"end\":60449,\"start\":60270},{\"attributes\":{\"id\":\"tab_3\",\"type\":\"table\"},\"end\":60780,\"start\":60450}]", "paragraph": "[{\"end\":2808,\"start\":2494},{\"end\":6042,\"start\":2810},{\"end\":6740,\"start\":6044},{\"end\":7911,\"start\":6742},{\"end\":8090,\"start\":7913},{\"end\":8965,\"start\":8092},{\"end\":10098,\"start\":8967},{\"end\":10901,\"start\":10100},{\"end\":11335,\"start\":10903},{\"end\":11566,\"start\":11337},{\"end\":11750,\"start\":11592},{\"end\":13971,\"start\":11774},{\"end\":14600,\"start\":13973},{\"end\":16143,\"start\":14602},{\"end\":17108,\"start\":16145},{\"end\":17971,\"start\":17126},{\"end\":18642,\"start\":17973},{\"end\":19888,\"start\":18673},{\"end\":20521,\"start\":19890},{\"end\":20812,\"start\":20523},{\"end\":21914,\"start\":20875},{\"end\":22315,\"start\":21916},{\"end\":23613,\"start\":22317},{\"end\":24252,\"start\":23615},{\"end\":25277,\"start\":24254},{\"end\":25403,\"start\":25279},{\"end\":25958,\"start\":25405},{\"end\":26688,\"start\":25982},{\"end\":27209,\"start\":26690},{\"end\":27532,\"start\":27211},{\"end\":28352,\"start\":27553},{\"end\":29294,\"start\":28395},{\"end\":29528,\"start\":29312},{\"end\":30317,\"start\":29542},{\"end\":30833,\"start\":30319},{\"end\":30957,\"start\":30857},{\"end\":31321,\"start\":30999},{\"end\":31543,\"start\":31323},{\"end\":31867,\"start\":31613},{\"end\":31987,\"start\":31966},{\"end\":32198,\"start\":32074},{\"end\":32351,\"start\":32248},{\"end\":32884,\"start\":32390},{\"end\":33478,\"start\":32886},{\"end\":33676,\"start\":33497},{\"end\":33999,\"start\":33702},{\"end\":34529,\"start\":34001},{\"end\":35480,\"start\":34531},{\"end\":36060,\"start\":35482},{\"end\":36949,\"start\":36062},{\"end\":38342,\"start\":36951},{\"end\":39046,\"start\":38382},{\"end\":39427,\"start\":39048},{\"end\":40010,\"start\":39442},{\"end\":40620,\"start\":40038},{\"end\":41364,\"start\":40622},{\"end\":42789,\"start\":41377},{\"end\":43690,\"start\":42802},{\"end\":43849,\"start\":43703},{\"end\":45204,\"start\":43870},{\"end\":45937,\"start\":45226},{\"end\":47138,\"start\":45959},{\"end\":47540,\"start\":47140},{\"end\":47634,\"start\":47581},{\"end\":48488,\"start\":47657},{\"end\":50486,\"start\":48527},{\"end\":50617,\"start\":50503},{\"end\":53202,\"start\":50619},{\"end\":54014,\"start\":53204},{\"end\":54533,\"start\":54016},{\"end\":56652,\"start\":54535},{\"end\":58061,\"start\":56680},{\"end\":58228,\"start\":58080}]", "formula": "[{\"attributes\":{\"id\":\"formula_0\"},\"end\":20874,\"start\":20813},{\"attributes\":{\"id\":\"formula_1\"},\"end\":30998,\"start\":30958},{\"attributes\":{\"id\":\"formula_2\"},\"end\":31612,\"start\":31544},{\"attributes\":{\"id\":\"formula_3\"},\"end\":31965,\"start\":31868},{\"attributes\":{\"id\":\"formula_4\"},\"end\":32073,\"start\":31988},{\"attributes\":{\"id\":\"formula_5\"},\"end\":32247,\"start\":32199},{\"attributes\":{\"id\":\"formula_6\"},\"end\":32389,\"start\":32352},{\"attributes\":{\"id\":\"formula_7\"},\"end\":47580,\"start\":47541}]", "table_ref": "[{\"attributes\":{\"ref_id\":\"tab_3\"},\"end\":54559,\"start\":54552}]", "section_header": "[{\"attributes\":{\"n\":\"1\"},\"end\":2492,\"start\":2480},{\"attributes\":{\"n\":\"2\"},\"end\":11590,\"start\":11569},{\"attributes\":{\"n\":\"2.1\"},\"end\":11772,\"start\":11753},{\"attributes\":{\"n\":\"2.2.2\"},\"end\":17124,\"start\":17111},{\"attributes\":{\"n\":\"2.3\"},\"end\":18671,\"start\":18645},{\"attributes\":{\"n\":\"2.4\"},\"end\":25980,\"start\":25961},{\"attributes\":{\"n\":\"2.5\"},\"end\":27551,\"start\":27535},{\"attributes\":{\"n\":\"3\"},\"end\":28393,\"start\":28355},{\"attributes\":{\"n\":\"3.1\"},\"end\":29310,\"start\":29297},{\"attributes\":{\"n\":\"3.2\"},\"end\":29540,\"start\":29531},{\"attributes\":{\"n\":\"3.3\"},\"end\":30855,\"start\":30836},{\"attributes\":{\"n\":\"4\"},\"end\":33495,\"start\":33481},{\"attributes\":{\"n\":\"4.1\"},\"end\":33700,\"start\":33679},{\"attributes\":{\"n\":\"4.2\"},\"end\":38380,\"start\":38345},{\"attributes\":{\"n\":\"5\"},\"end\":39440,\"start\":39430},{\"attributes\":{\"n\":\"5.1\"},\"end\":40036,\"start\":40013},{\"attributes\":{\"n\":\"5.2\"},\"end\":41375,\"start\":41367},{\"attributes\":{\"n\":\"5.3\"},\"end\":42800,\"start\":42792},{\"attributes\":{\"n\":\"5.4\"},\"end\":43701,\"start\":43693},{\"attributes\":{\"n\":\"5.4.1\"},\"end\":43868,\"start\":43852},{\"attributes\":{\"n\":\"5.4.2\"},\"end\":45224,\"start\":45207},{\"attributes\":{\"n\":\"5.4.3\"},\"end\":45957,\"start\":45940},{\"attributes\":{\"n\":\"5.4.4\"},\"end\":47655,\"start\":47637},{\"attributes\":{\"n\":\"5.5\"},\"end\":48525,\"start\":48491},{\"attributes\":{\"n\":\"6\"},\"end\":50501,\"start\":50489},{\"attributes\":{\"n\":\"7\"},\"end\":56678,\"start\":56655},{\"end\":58078,\"start\":58064},{\"end\":58240,\"start\":58230},{\"end\":58330,\"start\":58320},{\"end\":58367,\"start\":58357},{\"end\":58917,\"start\":58907},{\"end\":58971,\"start\":58961},{\"end\":59034,\"start\":59024},{\"end\":59105,\"start\":59095},{\"end\":59176,\"start\":59154},{\"end\":59781,\"start\":59770},{\"end\":60210,\"start\":60199},{\"end\":60282,\"start\":60271},{\"end\":60460,\"start\":60451}]", "table": "[{\"end\":60780,\"start\":60513}]", "figure_caption": "[{\"end\":58318,\"start\":58242},{\"end\":58355,\"start\":58332},{\"end\":58472,\"start\":58369},{\"end\":58905,\"start\":58475},{\"end\":58959,\"start\":58919},{\"end\":59022,\"start\":58973},{\"end\":59093,\"start\":59036},{\"end\":59152,\"start\":59107},{\"end\":59768,\"start\":59181},{\"end\":60197,\"start\":59784},{\"end\":60269,\"start\":60213},{\"end\":60449,\"start\":60285},{\"end\":60513,\"start\":60462}]", "figure_ref": "[{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":12240,\"start\":12234},{\"attributes\":{\"ref_id\":\"fig_1\"},\"end\":13751,\"start\":13744},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":14185,\"start\":14179},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":14767,\"start\":14760},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":17633,\"start\":17627},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":18719,\"start\":18713},{\"attributes\":{\"ref_id\":\"fig_1\"},\"end\":22064,\"start\":22055},{\"attributes\":{\"ref_id\":\"fig_1\"},\"end\":22489,\"start\":22481},{\"attributes\":{\"ref_id\":\"fig_1\"},\"end\":25345,\"start\":25337},{\"attributes\":{\"ref_id\":\"fig_1\"},\"end\":25418,\"start\":25411},{\"attributes\":{\"ref_id\":\"fig_1\"},\"end\":26270,\"start\":26261},{\"attributes\":{\"ref_id\":\"fig_1\"},\"end\":26548,\"start\":26541},{\"attributes\":{\"ref_id\":\"fig_2\"},\"end\":28002,\"start\":27996},{\"attributes\":{\"ref_id\":\"fig_2\"},\"end\":28068,\"start\":28061},{\"attributes\":{\"ref_id\":\"fig_2\"},\"end\":28153,\"start\":28146},{\"attributes\":{\"ref_id\":\"fig_2\"},\"end\":28242,\"start\":28228},{\"end\":36713,\"start\":36707},{\"end\":36960,\"start\":36954},{\"end\":37214,\"start\":37206},{\"end\":37811,\"start\":37803},{\"attributes\":{\"ref_id\":\"fig_1\"},\"end\":38654,\"start\":38645},{\"attributes\":{\"ref_id\":\"fig_5\"},\"end\":40632,\"start\":40625},{\"attributes\":{\"ref_id\":\"fig_5\"},\"end\":41094,\"start\":41087},{\"attributes\":{\"ref_id\":\"fig_6\"},\"end\":41666,\"start\":41660},{\"attributes\":{\"ref_id\":\"fig_7\"},\"end\":41942,\"start\":41936},{\"attributes\":{\"ref_id\":\"fig_8\"},\"end\":43557,\"start\":43551},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":44450,\"start\":44443},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":44845,\"start\":44838},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":45203,\"start\":45196},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":45688,\"start\":45681},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":46167,\"start\":46160},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":47214,\"start\":47207},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":47776,\"start\":47768},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":47933,\"start\":47925},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":48246,\"start\":48238},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":48271,\"start\":48263},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":48357,\"start\":48336},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":49734,\"start\":49727}]", "bib_author_first_name": "[{\"end\":61586,\"start\":61582},{\"end\":61600,\"start\":61594},{\"end\":61617,\"start\":61611},{\"end\":61632,\"start\":61628},{\"end\":62230,\"start\":62226},{\"end\":62245,\"start\":62238},{\"end\":62264,\"start\":62257},{\"end\":62280,\"start\":62276},{\"end\":62906,\"start\":62899},{\"end\":62922,\"start\":62918},{\"end\":62937,\"start\":62930},{\"end\":62957,\"start\":62949},{\"end\":62974,\"start\":62970},{\"end\":62988,\"start\":62983},{\"end\":63942,\"start\":63937},{\"end\":63955,\"start\":63948},{\"end\":63969,\"start\":63962},{\"end\":63982,\"start\":63976},{\"end\":63996,\"start\":63989},{\"end\":64017,\"start\":64008},{\"end\":64566,\"start\":64561},{\"end\":64571,\"start\":64567},{\"end\":64585,\"start\":64580},{\"end\":64903,\"start\":64896},{\"end\":64918,\"start\":64909},{\"end\":64930,\"start\":64924},{\"end\":64934,\"start\":64931},{\"end\":64950,\"start\":64942},{\"end\":64964,\"start\":64956},{\"end\":64979,\"start\":64970},{\"end\":64994,\"start\":64985},{\"end\":65007,\"start\":64999},{\"end\":65498,\"start\":65489},{\"end\":65513,\"start\":65504},{\"end\":65527,\"start\":65519},{\"end\":65543,\"start\":65535},{\"end\":65558,\"start\":65550},{\"end\":65951,\"start\":65950},{\"end\":65959,\"start\":65958},{\"end\":65968,\"start\":65967},{\"end\":65970,\"start\":65969},{\"end\":65977,\"start\":65976},{\"end\":65987,\"start\":65986},{\"end\":66415,\"start\":66409},{\"end\":66426,\"start\":66422},{\"end\":66439,\"start\":66435},{\"end\":66455,\"start\":66450},{\"end\":66468,\"start\":66464},{\"end\":66480,\"start\":66475},{\"end\":67279,\"start\":67273},{\"end\":67295,\"start\":67286},{\"end\":67309,\"start\":67304},{\"end\":67994,\"start\":67993},{\"end\":68008,\"start\":68007},{\"end\":68019,\"start\":68018},{\"end\":68032,\"start\":68031},{\"end\":68418,\"start\":68411},{\"end\":68432,\"start\":68427},{\"end\":68434,\"start\":68433},{\"end\":68448,\"start\":68443},{\"end\":68833,\"start\":68832},{\"end\":68844,\"start\":68843},{\"end\":68856,\"start\":68855},{\"end\":68858,\"start\":68857},{\"end\":68868,\"start\":68867},{\"end\":68870,\"start\":68869},{\"end\":68882,\"start\":68881},{\"end\":68893,\"start\":68892},{\"end\":68895,\"start\":68894},{\"end\":69285,\"start\":69284},{\"end\":69297,\"start\":69296},{\"end\":69307,\"start\":69306},{\"end\":69317,\"start\":69316},{\"end\":69704,\"start\":69700},{\"end\":69721,\"start\":69715},{\"end\":69741,\"start\":69735},{\"end\":69756,\"start\":69748},{\"end\":69771,\"start\":69766},{\"end\":70398,\"start\":70397},{\"end\":70408,\"start\":70407},{\"end\":70780,\"start\":70779},{\"end\":70788,\"start\":70787},{\"end\":70796,\"start\":70795},{\"end\":70798,\"start\":70797},{\"end\":70806,\"start\":70805},{\"end\":71183,\"start\":71182},{\"end\":71185,\"start\":71184},{\"end\":71198,\"start\":71197},{\"end\":71211,\"start\":71210},{\"end\":71222,\"start\":71221},{\"end\":71224,\"start\":71223},{\"end\":71235,\"start\":71234},{\"end\":71243,\"start\":71242},{\"end\":71245,\"start\":71244},{\"end\":71638,\"start\":71632},{\"end\":71645,\"start\":71639},{\"end\":71660,\"start\":71654},{\"end\":71673,\"start\":71668},{\"end\":71687,\"start\":71679},{\"end\":71702,\"start\":71696},{\"end\":72402,\"start\":72396},{\"end\":72404,\"start\":72403},{\"end\":72742,\"start\":72741},{\"end\":72749,\"start\":72748},{\"end\":72757,\"start\":72756},{\"end\":72765,\"start\":72764},{\"end\":72772,\"start\":72771},{\"end\":72779,\"start\":72778},{\"end\":72786,\"start\":72785},{\"end\":72793,\"start\":72792},{\"end\":72802,\"start\":72801},{\"end\":73205,\"start\":73198},{\"end\":73234,\"start\":73226},{\"end\":73241,\"start\":73235},{\"end\":73259,\"start\":73254},{\"end\":73273,\"start\":73268},{\"end\":73276,\"start\":73274},{\"end\":73293,\"start\":73287},{\"end\":73304,\"start\":73300},{\"end\":73320,\"start\":73315},{\"end\":73338,\"start\":73332},{\"end\":73350,\"start\":73346},{\"end\":73870,\"start\":73869},{\"end\":73878,\"start\":73877},{\"end\":73887,\"start\":73886},{\"end\":73904,\"start\":73903},{\"end\":74336,\"start\":74328},{\"end\":74352,\"start\":74345},{\"end\":74365,\"start\":74360},{\"end\":74367,\"start\":74366},{\"end\":74379,\"start\":74375},{\"end\":74394,\"start\":74390},{\"end\":74398,\"start\":74395},{\"end\":74968,\"start\":74967},{\"end\":74972,\"start\":74969},{\"end\":75283,\"start\":75277},{\"end\":75303,\"start\":75297},{\"end\":75321,\"start\":75313},{\"end\":75335,\"start\":75330},{\"end\":75352,\"start\":75344},{\"end\":76104,\"start\":76098},{\"end\":76117,\"start\":76110},{\"end\":76136,\"start\":76131},{\"end\":76151,\"start\":76144},{\"end\":78287,\"start\":78279},{\"end\":78300,\"start\":78295},{\"end\":78315,\"start\":78308},{\"end\":78338,\"start\":78326},{\"end\":78998,\"start\":78997},{\"end\":79006,\"start\":79005},{\"end\":79018,\"start\":79017},{\"end\":79025,\"start\":79024},{\"end\":79032,\"start\":79031},{\"end\":79226,\"start\":79222},{\"end\":79239,\"start\":79232},{\"end\":79253,\"start\":79247},{\"end\":79266,\"start\":79261},{\"end\":79283,\"start\":79275},{\"end\":79295,\"start\":79292},{\"end\":79297,\"start\":79296},{\"end\":79310,\"start\":79304}]", "bib_author_last_name": "[{\"end\":61592,\"start\":61587},{\"end\":61609,\"start\":61601},{\"end\":61626,\"start\":61618},{\"end\":61639,\"start\":61633},{\"end\":62236,\"start\":62231},{\"end\":62255,\"start\":62246},{\"end\":62274,\"start\":62265},{\"end\":62287,\"start\":62281},{\"end\":62916,\"start\":62907},{\"end\":62928,\"start\":62923},{\"end\":62947,\"start\":62938},{\"end\":62968,\"start\":62958},{\"end\":62981,\"start\":62975},{\"end\":62994,\"start\":62989},{\"end\":63946,\"start\":63943},{\"end\":63960,\"start\":63956},{\"end\":63974,\"start\":63970},{\"end\":63987,\"start\":63983},{\"end\":64006,\"start\":63997},{\"end\":64027,\"start\":64018},{\"end\":64578,\"start\":64572},{\"end\":64592,\"start\":64586},{\"end\":64907,\"start\":64904},{\"end\":64922,\"start\":64919},{\"end\":64940,\"start\":64935},{\"end\":64954,\"start\":64951},{\"end\":64968,\"start\":64965},{\"end\":64983,\"start\":64980},{\"end\":64997,\"start\":64995},{\"end\":65011,\"start\":65008},{\"end\":65502,\"start\":65499},{\"end\":65517,\"start\":65514},{\"end\":65533,\"start\":65528},{\"end\":65548,\"start\":65544},{\"end\":65562,\"start\":65559},{\"end\":65956,\"start\":65952},{\"end\":65965,\"start\":65960},{\"end\":65974,\"start\":65971},{\"end\":65984,\"start\":65978},{\"end\":65995,\"start\":65988},{\"end\":66420,\"start\":66416},{\"end\":66433,\"start\":66427},{\"end\":66448,\"start\":66440},{\"end\":66462,\"start\":66456},{\"end\":66473,\"start\":66469},{\"end\":66490,\"start\":66481},{\"end\":67284,\"start\":67280},{\"end\":67302,\"start\":67296},{\"end\":67316,\"start\":67310},{\"end\":68005,\"start\":67995},{\"end\":68016,\"start\":68009},{\"end\":68029,\"start\":68020},{\"end\":68042,\"start\":68033},{\"end\":68425,\"start\":68419},{\"end\":68441,\"start\":68435},{\"end\":68455,\"start\":68449},{\"end\":68841,\"start\":68834},{\"end\":68853,\"start\":68845},{\"end\":68865,\"start\":68859},{\"end\":68879,\"start\":68871},{\"end\":68890,\"start\":68883},{\"end\":68902,\"start\":68896},{\"end\":69294,\"start\":69286},{\"end\":69304,\"start\":69298},{\"end\":69314,\"start\":69308},{\"end\":69324,\"start\":69318},{\"end\":69713,\"start\":69705},{\"end\":69733,\"start\":69722},{\"end\":69746,\"start\":69742},{\"end\":69764,\"start\":69757},{\"end\":69778,\"start\":69772},{\"end\":70405,\"start\":70399},{\"end\":70413,\"start\":70409},{\"end\":70785,\"start\":70781},{\"end\":70793,\"start\":70789},{\"end\":70803,\"start\":70799},{\"end\":70809,\"start\":70807},{\"end\":71195,\"start\":71186},{\"end\":71208,\"start\":71199},{\"end\":71219,\"start\":71212},{\"end\":71232,\"start\":71225},{\"end\":71240,\"start\":71236},{\"end\":71251,\"start\":71246},{\"end\":71652,\"start\":71646},{\"end\":71666,\"start\":71661},{\"end\":71677,\"start\":71674},{\"end\":71694,\"start\":71688},{\"end\":71708,\"start\":71703},{\"end\":72410,\"start\":72405},{\"end\":72746,\"start\":72743},{\"end\":72754,\"start\":72750},{\"end\":72762,\"start\":72758},{\"end\":72769,\"start\":72766},{\"end\":72776,\"start\":72773},{\"end\":72783,\"start\":72780},{\"end\":72790,\"start\":72787},{\"end\":72799,\"start\":72794},{\"end\":72811,\"start\":72803},{\"end\":73224,\"start\":73206},{\"end\":73252,\"start\":73242},{\"end\":73266,\"start\":73260},{\"end\":73285,\"start\":73277},{\"end\":73298,\"start\":73294},{\"end\":73313,\"start\":73305},{\"end\":73330,\"start\":73321},{\"end\":73344,\"start\":73339},{\"end\":73362,\"start\":73351},{\"end\":73370,\"start\":73364},{\"end\":73875,\"start\":73871},{\"end\":73884,\"start\":73879},{\"end\":73901,\"start\":73888},{\"end\":73914,\"start\":73905},{\"end\":74343,\"start\":74337},{\"end\":74358,\"start\":74353},{\"end\":74373,\"start\":74368},{\"end\":74388,\"start\":74380},{\"end\":74406,\"start\":74399},{\"end\":74795,\"start\":74786},{\"end\":74981,\"start\":74973},{\"end\":75295,\"start\":75284},{\"end\":75311,\"start\":75304},{\"end\":75328,\"start\":75322},{\"end\":75342,\"start\":75336},{\"end\":75360,\"start\":75353},{\"end\":76108,\"start\":76105},{\"end\":76129,\"start\":76118},{\"end\":76142,\"start\":76137},{\"end\":76155,\"start\":76152},{\"end\":76761,\"start\":76753},{\"end\":76884,\"start\":76876},{\"end\":78293,\"start\":78288},{\"end\":78306,\"start\":78301},{\"end\":78324,\"start\":78316},{\"end\":78349,\"start\":78339},{\"end\":79003,\"start\":78999},{\"end\":79015,\"start\":79007},{\"end\":79022,\"start\":79019},{\"end\":79029,\"start\":79026},{\"end\":79038,\"start\":79033},{\"end\":79230,\"start\":79227},{\"end\":79245,\"start\":79240},{\"end\":79259,\"start\":79254},{\"end\":79273,\"start\":79267},{\"end\":79290,\"start\":79284},{\"end\":79302,\"start\":79298},{\"end\":79316,\"start\":79311}]", "bib_entry": "[{\"attributes\":{\"doi\":\"10.1145/3005745.3005770\",\"id\":\"b0\",\"matched_paper_id\":15807336},\"end\":62146,\"start\":61545},{\"attributes\":{\"doi\":\"10.1145/2973750.2985258\",\"id\":\"b1\",\"matched_paper_id\":17338718},\"end\":62860,\"start\":62148},{\"attributes\":{\"doi\":\"10.1145/3230543.3230581\",\"id\":\"b2\",\"matched_paper_id\":51928115},\"end\":63623,\"start\":62862},{\"attributes\":{\"id\":\"b3\"},\"end\":63878,\"start\":63625},{\"attributes\":{\"id\":\"b4\",\"matched_paper_id\":57499990},\"end\":64480,\"start\":63880},{\"attributes\":{\"id\":\"b5\"},\"end\":64759,\"start\":64482},{\"attributes\":{\"id\":\"b6\",\"matched_paper_id\":6545539},\"end\":65405,\"start\":64761},{\"attributes\":{\"id\":\"b7\",\"matched_paper_id\":26898056},\"end\":65859,\"start\":65407},{\"attributes\":{\"id\":\"b8\",\"matched_paper_id\":12051148},\"end\":66317,\"start\":65861},{\"attributes\":{\"doi\":\"10.1145/3143361.3143395\",\"id\":\"b9\",\"matched_paper_id\":21879391},\"end\":67188,\"start\":66319},{\"attributes\":{\"id\":\"b10\",\"matched_paper_id\":17327346},\"end\":67921,\"start\":67190},{\"attributes\":{\"id\":\"b11\",\"matched_paper_id\":23198960},\"end\":68305,\"start\":67923},{\"attributes\":{\"id\":\"b12\",\"matched_paper_id\":225857103},\"end\":68747,\"start\":68307},{\"attributes\":{\"id\":\"b13\"},\"end\":69108,\"start\":68749},{\"attributes\":{\"id\":\"b14\"},\"end\":69196,\"start\":69110},{\"attributes\":{\"id\":\"b15\",\"matched_paper_id\":67915721},\"end\":69609,\"start\":69198},{\"attributes\":{\"id\":\"b16\",\"matched_paper_id\":52978545},\"end\":70316,\"start\":69611},{\"attributes\":{\"id\":\"b17\",\"matched_paper_id\":10476100},\"end\":70698,\"start\":70318},{\"attributes\":{\"id\":\"b18\",\"matched_paper_id\":8090088},\"end\":71046,\"start\":70700},{\"attributes\":{\"id\":\"b19\",\"matched_paper_id\":2836735},\"end\":71596,\"start\":71048},{\"attributes\":{\"doi\":\"10.1145/3032970.3032974\",\"id\":\"b20\",\"matched_paper_id\":8143509},\"end\":72322,\"start\":71598},{\"attributes\":{\"id\":\"b21\"},\"end\":72606,\"start\":72324},{\"attributes\":{\"id\":\"b22\",\"matched_paper_id\":3045638},\"end\":73122,\"start\":72608},{\"attributes\":{\"doi\":\"10.1016/j.comcom.2018.09.005\",\"id\":\"b23\",\"matched_paper_id\":8424210},\"end\":73779,\"start\":73124},{\"attributes\":{\"id\":\"b24\",\"matched_paper_id\":14017634},\"end\":74255,\"start\":73781},{\"attributes\":{\"id\":\"b25\",\"matched_paper_id\":5423074},\"end\":74616,\"start\":74257},{\"attributes\":{\"id\":\"b26\"},\"end\":74751,\"start\":74618},{\"attributes\":{\"id\":\"b27\"},\"end\":74903,\"start\":74753},{\"attributes\":{\"id\":\"b28\",\"matched_paper_id\":13015131},\"end\":75191,\"start\":74905},{\"attributes\":{\"doi\":\"10.1145/3143361.3143384\",\"id\":\"b29\",\"matched_paper_id\":21434382},\"end\":76056,\"start\":75193},{\"attributes\":{\"doi\":\"10.1145/3117811.3117817\",\"id\":\"b30\",\"matched_paper_id\":19767332},\"end\":76751,\"start\":76058},{\"attributes\":{\"id\":\"b31\"},\"end\":76874,\"start\":76753},{\"attributes\":{\"id\":\"b32\"},\"end\":76997,\"start\":76876},{\"attributes\":{\"id\":\"b33\",\"matched_paper_id\":54164102},\"end\":77411,\"start\":76999},{\"attributes\":{\"doi\":\"P802.11ay/D3.0\",\"id\":\"b34\"},\"end\":78191,\"start\":77413},{\"attributes\":{\"doi\":\"10.1145/2973750.2973760\",\"id\":\"b35\",\"matched_paper_id\":16944951},\"end\":78940,\"start\":78193},{\"attributes\":{\"id\":\"b36\",\"matched_paper_id\":211198441},\"end\":79182,\"start\":78942},{\"attributes\":{\"doi\":\"10.1145/2639108.2639121\",\"id\":\"b37\",\"matched_paper_id\":780268},\"end\":79943,\"start\":79184}]", "bib_title": "[{\"end\":61580,\"start\":61545},{\"end\":62224,\"start\":62148},{\"end\":62897,\"start\":62862},{\"end\":63935,\"start\":63880},{\"end\":64894,\"start\":64761},{\"end\":65487,\"start\":65407},{\"end\":65948,\"start\":65861},{\"end\":66407,\"start\":66319},{\"end\":67271,\"start\":67190},{\"end\":67991,\"start\":67923},{\"end\":68409,\"start\":68307},{\"end\":69282,\"start\":69198},{\"end\":69698,\"start\":69611},{\"end\":70395,\"start\":70318},{\"end\":70777,\"start\":70700},{\"end\":71180,\"start\":71048},{\"end\":71630,\"start\":71598},{\"end\":72739,\"start\":72608},{\"end\":73196,\"start\":73124},{\"end\":73867,\"start\":73781},{\"end\":74326,\"start\":74257},{\"end\":74627,\"start\":74618},{\"end\":74965,\"start\":74905},{\"end\":75275,\"start\":75193},{\"end\":76096,\"start\":76058},{\"end\":77149,\"start\":76999},{\"end\":78277,\"start\":78193},{\"end\":78995,\"start\":78942},{\"end\":79220,\"start\":79184}]", "bib_author": "[{\"end\":61594,\"start\":61582},{\"end\":61611,\"start\":61594},{\"end\":61628,\"start\":61611},{\"end\":61641,\"start\":61628},{\"end\":62238,\"start\":62226},{\"end\":62257,\"start\":62238},{\"end\":62276,\"start\":62257},{\"end\":62289,\"start\":62276},{\"end\":62918,\"start\":62899},{\"end\":62930,\"start\":62918},{\"end\":62949,\"start\":62930},{\"end\":62970,\"start\":62949},{\"end\":62983,\"start\":62970},{\"end\":62996,\"start\":62983},{\"end\":63948,\"start\":63937},{\"end\":63962,\"start\":63948},{\"end\":63976,\"start\":63962},{\"end\":63989,\"start\":63976},{\"end\":64008,\"start\":63989},{\"end\":64029,\"start\":64008},{\"end\":64580,\"start\":64561},{\"end\":64594,\"start\":64580},{\"end\":64909,\"start\":64896},{\"end\":64924,\"start\":64909},{\"end\":64942,\"start\":64924},{\"end\":64956,\"start\":64942},{\"end\":64970,\"start\":64956},{\"end\":64985,\"start\":64970},{\"end\":64999,\"start\":64985},{\"end\":65013,\"start\":64999},{\"end\":65504,\"start\":65489},{\"end\":65519,\"start\":65504},{\"end\":65535,\"start\":65519},{\"end\":65550,\"start\":65535},{\"end\":65564,\"start\":65550},{\"end\":65958,\"start\":65950},{\"end\":65967,\"start\":65958},{\"end\":65976,\"start\":65967},{\"end\":65986,\"start\":65976},{\"end\":65997,\"start\":65986},{\"end\":66422,\"start\":66409},{\"end\":66435,\"start\":66422},{\"end\":66450,\"start\":66435},{\"end\":66464,\"start\":66450},{\"end\":66475,\"start\":66464},{\"end\":66492,\"start\":66475},{\"end\":67286,\"start\":67273},{\"end\":67304,\"start\":67286},{\"end\":67318,\"start\":67304},{\"end\":68007,\"start\":67993},{\"end\":68018,\"start\":68007},{\"end\":68031,\"start\":68018},{\"end\":68044,\"start\":68031},{\"end\":68427,\"start\":68411},{\"end\":68443,\"start\":68427},{\"end\":68457,\"start\":68443},{\"end\":68843,\"start\":68832},{\"end\":68855,\"start\":68843},{\"end\":68867,\"start\":68855},{\"end\":68881,\"start\":68867},{\"end\":68892,\"start\":68881},{\"end\":68904,\"start\":68892},{\"end\":69296,\"start\":69284},{\"end\":69306,\"start\":69296},{\"end\":69316,\"start\":69306},{\"end\":69326,\"start\":69316},{\"end\":69715,\"start\":69700},{\"end\":69735,\"start\":69715},{\"end\":69748,\"start\":69735},{\"end\":69766,\"start\":69748},{\"end\":69780,\"start\":69766},{\"end\":70407,\"start\":70397},{\"end\":70415,\"start\":70407},{\"end\":70787,\"start\":70779},{\"end\":70795,\"start\":70787},{\"end\":70805,\"start\":70795},{\"end\":70811,\"start\":70805},{\"end\":71197,\"start\":71182},{\"end\":71210,\"start\":71197},{\"end\":71221,\"start\":71210},{\"end\":71234,\"start\":71221},{\"end\":71242,\"start\":71234},{\"end\":71253,\"start\":71242},{\"end\":71654,\"start\":71632},{\"end\":71668,\"start\":71654},{\"end\":71679,\"start\":71668},{\"end\":71696,\"start\":71679},{\"end\":71710,\"start\":71696},{\"end\":72412,\"start\":72396},{\"end\":72748,\"start\":72741},{\"end\":72756,\"start\":72748},{\"end\":72764,\"start\":72756},{\"end\":72771,\"start\":72764},{\"end\":72778,\"start\":72771},{\"end\":72785,\"start\":72778},{\"end\":72792,\"start\":72785},{\"end\":72801,\"start\":72792},{\"end\":72813,\"start\":72801},{\"end\":73226,\"start\":73198},{\"end\":73254,\"start\":73226},{\"end\":73268,\"start\":73254},{\"end\":73287,\"start\":73268},{\"end\":73300,\"start\":73287},{\"end\":73315,\"start\":73300},{\"end\":73332,\"start\":73315},{\"end\":73346,\"start\":73332},{\"end\":73364,\"start\":73346},{\"end\":73372,\"start\":73364},{\"end\":73877,\"start\":73869},{\"end\":73886,\"start\":73877},{\"end\":73903,\"start\":73886},{\"end\":73916,\"start\":73903},{\"end\":74345,\"start\":74328},{\"end\":74360,\"start\":74345},{\"end\":74375,\"start\":74360},{\"end\":74390,\"start\":74375},{\"end\":74408,\"start\":74390},{\"end\":74797,\"start\":74786},{\"end\":74983,\"start\":74967},{\"end\":75297,\"start\":75277},{\"end\":75313,\"start\":75297},{\"end\":75330,\"start\":75313},{\"end\":75344,\"start\":75330},{\"end\":75362,\"start\":75344},{\"end\":76110,\"start\":76098},{\"end\":76131,\"start\":76110},{\"end\":76144,\"start\":76131},{\"end\":76157,\"start\":76144},{\"end\":76763,\"start\":76753},{\"end\":76886,\"start\":76876},{\"end\":78295,\"start\":78279},{\"end\":78308,\"start\":78295},{\"end\":78326,\"start\":78308},{\"end\":78351,\"start\":78326},{\"end\":79005,\"start\":78997},{\"end\":79017,\"start\":79005},{\"end\":79024,\"start\":79017},{\"end\":79031,\"start\":79024},{\"end\":79040,\"start\":79031},{\"end\":79232,\"start\":79222},{\"end\":79247,\"start\":79232},{\"end\":79261,\"start\":79247},{\"end\":79275,\"start\":79261},{\"end\":79292,\"start\":79275},{\"end\":79304,\"start\":79292},{\"end\":79318,\"start\":79304}]", "bib_venue": "[{\"end\":61820,\"start\":61742},{\"end\":62524,\"start\":62418},{\"end\":63231,\"start\":63125},{\"end\":64139,\"start\":64129},{\"end\":66745,\"start\":66630},{\"end\":67604,\"start\":67461},{\"end\":69992,\"start\":69886},{\"end\":71951,\"start\":71842},{\"end\":75615,\"start\":75500},{\"end\":76392,\"start\":76286},{\"end\":78586,\"start\":78480},{\"end\":79553,\"start\":79447},{\"end\":61740,\"start\":61664},{\"end\":62416,\"start\":62312},{\"end\":63123,\"start\":63019},{\"end\":63672,\"start\":63625},{\"end\":64127,\"start\":64029},{\"end\":64559,\"start\":64482},{\"end\":65072,\"start\":65013},{\"end\":65623,\"start\":65564},{\"end\":66078,\"start\":65997},{\"end\":66628,\"start\":66515},{\"end\":67459,\"start\":67318},{\"end\":68101,\"start\":68044},{\"end\":68517,\"start\":68457},{\"end\":68830,\"start\":68749},{\"end\":69140,\"start\":69112},{\"end\":69387,\"start\":69326},{\"end\":69884,\"start\":69780},{\"end\":70495,\"start\":70415},{\"end\":70852,\"start\":70811},{\"end\":71298,\"start\":71253},{\"end\":71840,\"start\":71733},{\"end\":72394,\"start\":72324},{\"end\":72841,\"start\":72813},{\"end\":73423,\"start\":73400},{\"end\":74003,\"start\":73916},{\"end\":74415,\"start\":74408},{\"end\":74653,\"start\":74629},{\"end\":74784,\"start\":74753},{\"end\":75028,\"start\":74983},{\"end\":75498,\"start\":75385},{\"end\":76284,\"start\":76180},{\"end\":76775,\"start\":76763},{\"end\":76898,\"start\":76886},{\"end\":77164,\"start\":77151},{\"end\":77750,\"start\":77413},{\"end\":78478,\"start\":78374},{\"end\":79051,\"start\":79040},{\"end\":79445,\"start\":79341}]"}}}, "year": 2023, "month": 12, "day": 17}