{"id": 218772411, "updated": "2022-07-26 05:54:00.99", "metadata": {"title": "A biochemically-interpretable machine learning classifier for microbial GWAS", "authors": "[{\"first\":\"Erol\",\"last\":\"Kavvas\",\"middle\":[\"S.\"]},{\"first\":\"Laurence\",\"last\":\"Yang\",\"middle\":[]},{\"first\":\"Jonathan\",\"last\":\"Monk\",\"middle\":[\"M.\"]},{\"first\":\"David\",\"last\":\"Heckmann\",\"middle\":[]},{\"first\":\"Bernhard\",\"last\":\"Palsson\",\"middle\":[\"O.\"]}]", "venue": "Nature Communications", "journal": "Nature Communications", "publication_date": {"year": 2020, "month": null, "day": null}, "abstract": "Current machine learning classifiers have successfully been applied to whole-genome sequencing data to identify genetic determinants of antimicrobial resistance (AMR), but they lack causal interpretation. Here we present a metabolic model-based machine learning classifier, named Metabolic Allele Classifier (MAC), that uses flux balance analysis to estimate the biochemical effects of alleles. We apply the MAC to a dataset of 1595 drug-tested Mycobacterium tuberculosis strains and show that MACs predict AMR phenotypes with accuracy on par with mechanism-agnostic machine learning models (isoniazid AUC = 0.93) while enabling a biochemical interpretation of the genotype-phenotype map. Interpretation of MACs for three antibiotics (pyrazinamide, para-aminosalicylic acid, and isoniazid) recapitulates known AMR mechanisms and suggest a biochemical basis for how the identified alleles cause AMR. Extending flux balance analysis to identify accurate sequence classifiers thus contributes mechanistic insights to GWAS, a field thus far dominated by mechanism-agnostic results.", "fields_of_study": "[\"Computer Science\"]", "external_ids": {"arxiv": null, "mag": "3026996309", "acl": null, "pubmed": "32444610", "pubmedcentral": "7244534", "dblp": null, "doi": "10.1038/s41467-020-16310-9"}}, "content": {"source": {"pdf_hash": "eb59044738b56aed312d598eecd0eb123e2ce32c", "pdf_src": "PubMedCentral", "pdf_uri": null, "oa_url_match": false, "oa_info": {"license": "CCBY", "open_access_url": "https://www.nature.com/articles/s41467-020-16310-9.pdf", "status": "GOLD"}}, "grobid": {"id": "4dccbfc1324f2e0f0253b1cde44eed5446af0918", "type": "plain-text", "url": "s3://ai2-s2-pdf-extraction-prod/parse-results/s2orc_worker/eb59044738b56aed312d598eecd0eb123e2ce32c.txt", "contents": "\nA biochemically-interpretable machine learning classifier for microbial GWAS\n\n\nErol S Kavvas \nDepartment of Bioengineering\nUniversity of California\nSan DiegoCAUSA\n\nLaurence Yang \nDepartment of Chemical Engineering\nQueen's University\nK7L 3N6KingstonONCanada\n\nJonathan M Monk \nDepartment of Bioengineering\nUniversity of California\nSan DiegoCAUSA\n\nDavid Heckmann \nDepartment of Bioengineering\nUniversity of California\nSan DiegoCAUSA\n\nBernhard O Palsson palsson@ucsd.edu \nDepartment of Bioengineering\nUniversity of California\nSan DiegoCAUSA\n\nDepartment of Pediatrics\nUniversity of California\nSan DiegoCAUSA. ✉\n\nA biochemically-interpretable machine learning classifier for microbial GWAS\n10.1038/s41467-020-16310-9ARTICLE OPEN 1\nCurrent machine learning classifiers have successfully been applied to whole-genome sequencing data to identify genetic determinants of antimicrobial resistance (AMR), but they lack causal interpretation. Here we present a metabolic model-based machine learning classifier, named Metabolic Allele Classifier (MAC), that uses flux balance analysis to estimate the biochemical effects of alleles. We apply the MAC to a dataset of 1595 drug-tested Mycobacterium tuberculosis strains and show that MACs predict AMR phenotypes with accuracy on par with mechanism-agnostic machine learning models (isoniazid AUC = 0.93) while enabling a biochemical interpretation of the genotype-phenotype map. Interpretation of MACs for three antibiotics (pyrazinamide, para-aminosalicylic acid, and isoniazid) recapitulates known AMR mechanisms and suggest a biochemical basis for how the identified alleles cause AMR. Extending flux balance analysis to identify accurate sequence classifiers thus contributes mechanistic insights to GWAS, a field thus far dominated by mechanismagnostic results.\n\nM ycobacterium tuberculosis (TB) claims 1.6 million lives annually and resists eradication through evolution of antimicrobial resistance (AMR) 1 . To elucidate AMR mechanisms, researchers have applied machine learning approaches to large-scale genome sequencing and drug-testing datasets for identifying genetic determinants of AMR [2][3][4][5][6][7] . While current machine learning approaches have provided a predictive tool for microbial genome-wide association studies (GWAS), such black-box models are incapable of mechanistically interpreting genetic associations. Such a limitation has become increasingly apparent in TB, where numerous experimental studies have shown that AMR-associated genetic variants often reflect network-level metabolic adaptations to antibiotic-induced selection pressures ( Supplementary Fig. 1 [8][9][10][11][12] . These studies show that identified genetic associations have corresponding network-level associations that are highly informative of AMR mechanisms. However, current GWAS results only provide predictions for which alleles are most important, not their functional effects. Therefore, machine learning models that incorporate biochemical network structure may naturally extend GWAS results by estimating functional effects of identified alleles, leading to an enhanced understanding of AMR [13][14][15] .\n\nOver the past couple of decades, the computational analysis of biochemical networks in microorganisms has been advanced through the use of genome-scale models (GEMs) 16,17 . By computing metabolic flux states (see Glossary for definition of terms) consistent with imposed biological constraints, GEMs have been shown to predict a range of cellular functions, making them a valuable tool for analyzing multi-omics datasets 18 . Although GEMs are transparent genotype-phenotype models, they are largely outperformed by machine learning models in direct comparisons of prediction accuracy. Approaches have thus been developed that integrate meaningful GEM computations with predictive black-box machine learning to enable white-box interpretations of data 19 . These approaches have worked well for endogenous metabolomics data by using the GEM to directly transform the measurements to meaningful inputs for black box machine learning.\n\nThis approach, however, may not be amenable to analyzing microbial GWAS data, in which the genetic parameters of the GEM are not directly observed (see Supplementary Notes). GEMs have previously modeled genetic variation at the resolution of gene presence-absence 20-23 , but have not yet been used to link nucleotide-level genetic variation (i.e., alleles) to observed phenotypes (i.e., AMR) in a predictive manner 24 . Since alleles are the primary forms of causal variation identified in GWAS, an approach for mechanistically integrating information about alleles is of major interest 25 .\n\nHere we develop a GEM-based machine learning framework for modeling datasets used in GWAS and apply it to a sequencing dataset of drug-tested TB strains. We show that our framework achieves high performance in accurately classifying AMR phenotypes of TB strains. We then characterize the identified classifiers for pyrazinamide, isoniazid, and para-aminosalicylic acid AMR and show that they identify key genetic determinants and pathway activity discriminating between resistant and susceptible TB strains. This work demonstrates how GEMs can be used directly as an input-output machine learning model to extract both genetic and biochemical network-level insights from microbial GWAS datasets.\n\n\nResults\n\nAssessing AMR mechanisms motivates metabolic model approach. We first set out to assess the scope of a potential mechanism-based genotype-phenotype map using a dataset of 1595 drug-tested TB strains 2,26 and a GEM of TB H37Rv, named iEK1011 27 . The acquired genetic variant matrix (G) of the 1595 strains describes 3739 protein-coding genes and their 12,762 allelic variants, where each variant is defined as a unique amino acid sequence for the protein coding gene. Our analysis therefore does not account for synonymous amino acid changes and intergenic genetic variants. The corresponding drug susceptibility status for a strain is described by a binary 'susceptibility' or 'resistance' phenotype to a particular antibiotic. iEK1011 accounts for 1011 genes (26% of H37Rv) and comprises a metabolic network of 1229 reactions and 998 metabolites.\n\nComparing the gene list between iEK1011 and the genomics dataset, we found that 26% (981/3739) of the total genes and 25% (3310/12,762) of the total variants described by the genetic variant matrix were accounted for by the GEM. To evaluate iEK1011's potential to model causal variants, we compiled a list of AMR genes and compared this list to the gene list of iEK1011 (Supplementary Data 1; Methods). We found that 72% (32/44) of known AMR genes are accounted for in iEK1011 (Supplementary Table 1). In the case of six drugs (ethambutol, isoniazid, dcycloserine, para-aminosalicylic acid, ethionamide, and pyrazinamide), 87% (20/23) of their AMR genes were accounted for in iEK1011. AMR genes not explicitly accounted for in iEK1011 were primarily related to DNA transcription (e.g., rpoB) and transcriptional regulation (e.g., embR). The antibiotics rifampicin, ofloxacin, and streptomycin do not have AMR genes accounted for in iEK1011 and are therefore out of scope for our study. Taken together, the abundance of AMR genes accounted for in iEK1011 motivated a GEM-driven analysis of the TB AMR dataset.\n\nA flux balance framework for classifying microbial genomes. While we have shown that a GEM accounts for the majority of known genetic determinants of AMR in TB, computational methods do not exist for integrating a fine-grained description of allelic variation with GEMs to directly predict binary phenotypes (i.e., AMR susceptible/resistant classification). We thus set out to develop a GEM-based machine learning framework for analyzing the TB dataset. The developed method, named Metabolic Allele Classifier (MAC), takes the genome sequence of a particular TB strain as its input and classifies strains as either resistant or susceptible to a specific antibiotic (Fig. 1a). Specifically, the MAC is an allele-parameterized form of flux balance analysis 28,29 that represents a strain as a set of allele-specific flux capacity constraints and classifies AMR according to the optimum value attained by optimizing an antibiotic-specific objective.\n\nWe formulate the MAC within the flux balance analysis framework as follows,\nH y;k ¼ sign À max v c T y v k þ b Á Antibiotic-specific objective ð Þ s: t: Sv k ¼ 0 Flux balance constraint ð Þ v lb ≤ v ≤ v ub Over-all min=max flux constraints ð Þ Ga lb ¼ v lb ≤ v ≤ v ub ¼ Ga ub Allele-specific min=max flux constraints ð Þð1Þ\nWhere each line of the MAC formulation in Eq. (1) is briefly described with plain text to the right, and further detailed by the correspondingly ordered bullet points below;\n\n• H y,k is the sign of the MAC optimum value that classifies a strain, k, as either resistant (R) or susceptible (S) to a specific antibiotic, y (see Supplementary Notes for comparison between the MAC and the Support Vector Machine). The optimum value is determined by optimizing the objective function, max c T y v k , which describes a linear combination of the metabolic fluxes, v k , and is specific to an antibiotic, y. The antibiotic-specific objective coefficients, c y T , are unknown apriori and inferred from the data as a normal to the plane that best separates resistant and susceptible strains (Fig. 1b).\n\n\n•\n\nThe classical flux-balance constraints, Sv k = 0, ensure that for each strain, k, the net mass flux through each of their metabolites is balanced to 0 (i.e., steady internal homeostatic state), where S is the stoichiometric matrix with 998 metabolites (rows) and 1229 reactions (columns).\n\n\n•\n\nThe constraints on the fluxes (reaction rates) through the metabolic reactions, v lb,ub , describe the overall min/max flux constraints not changed by allelic variation and are thus the same for all strains. Geometrically, the constraints v lb,ub and Sv k = 0 define a polytope in which all strain-specific fluxes must reside (Fig. 1b).\n\n\n•\n\nThe binary genetic variant matrix, G k,i , is the primary data type used in GWAS and describes the presence/absence of i alleles (columns) across k strains (rows).\n\n\n•\n\nThe constraints, G k,i a i,j lb,ub = v k,j lb,ub , represent the genome sequence of each strain (represented as a row in G) as a set of allele-specific flux constraints, v k,j lb,ub . The allele-constraint matrix, a lb,ub , describes the allele-specific flux constraint values of i alleles (rows) that encode for enzymes catalyzing j reactions (columns) (see Supplementary Notes for further explanation on the biological relationship between alleles and flux constraints). The allele-constraint matrix is unknown apriori and inferred from the data. Geometrically, Ga describes strain-specific polytopes that represent the best separation of resistant and susceptible strains within the overall flux space (Fig. 1b).\n\nImportantly, the MAC was formulated such that for each strain-antibiotic classification, H y,k , there exists a corresponding flux state, v k , thereby providing a biochemical network explanation of the classification. Geometrically, the flux state of the metabolic network of a particular strain is described by the intersection of the objective function with its genome-specific polytope (Fig. 1c).\n\nThe objective function corresponds to the fluxes through a set of metabolic reactions that form the basis for the MAC. By the fundamental nature of flux balancing, these reactions identify activity levels of discriminating pathways. The objective function that best separates the two polytopes formed by the spaces of resistant and sensitive phenotypes is a plane that describes a critical level of pathway activity that discriminates between the R and S phenotypes. Thus, the separating plane consists of fluxes that are directly activated by alleles (c i ≠ 0) and those that result b a c Fig. 1 A metabolic systems approach for genetic associations. a In this study, data describing TB genome sequences and AMR data types are integrated with a metabolic model to learn a biochemically-interpretable classifier, named Metabolic Allele Classifier (MAC). The MAC parameters consist of allelespecific flux capacity constraints, a, and an antibiotic-specific metabolic objective, c, both of which are inferred from the data. b The optimal MAC describes strain-specific polytopes in flux space that separate into resistant (R) and susceptible (S) regions. The MAC objective function, c T v, is identified as normal to the plane that best separates R and S. c The learned MAC provides a biochemically-based hypothesis of AMR mechanisms and allele-specific effects through interpretation of c and v. The genome-scale flux state of a strain, v, consists of fluxes that are directly activated by alleles (allelic fluxes) and those that are flux-balance consequences of the allele-activated fluxes (compensatory fluxes). Abbreviations: S, susceptible; R, resistant; AMR, antimicrobial resistance.\n\nfrom flux-balance consequences of c i ≠ 0. Statistical tests can then be performed using the set of all strain-specific intersections to identify both significant flux states discriminating between resistant and susceptible strains ( Supplementary Fig. 2a) as well as their underlying allele-specific flux effects ( Supplementary  Fig. 2b). The MAC is therefore a biochemically interpretable machine learning classifier.\n\nValidation of metabolic allele classifiers. We utilized randomized sampling, machine learning, and model selection to identify predictive MACs (see Supplementary Fig. 4-5, Methods, and Supplementary Notes for further details of the process outlined below). Specifically, the MACs were trained on the same 375 strains to predict antibiotic phenotypes with 1220 strains set aside for testing. Since the computational cost of estimating MACs scales poorly with the number of alleles utilized, we limited the set of alleles modeled by the MAC to 237, describing 107 genes consisting of both known and unknown relations to AMR (Supplementary Data 1). The known AMR genes provide validation cases while the unknown genes enable novel insights.\n\nWe assessed MACs for isoniazid, rifampicin, pyrazinamide, ethambutol, and ethionamide using held out test sets and find that the MACs generally achieve high classification performance (Fig. 2a), with scores similar to our previous mechanism-agnostic machine learning models 2 . The MACs were further validated by assessing their ability to recover the primary AMR genes. We find that the largest objective weights for pyrazinamide, paraaminosalicylic acid, and isoniazid MACs correspond to the primary known AMR genes of antibiotics (Fig. 2b). These results show that the MAC performs on par with state-of-the-art machine learning approaches in AMR classification and identification of primary AMR genes.\n\nMACs reveal known and new antibiotic resistance determinants. The ability of MACs to efficiently predict AMR phenotypes (i.e., high accuracy, low complexity) suggests that the model parameters have biological relevance. Furthermore, in contrast to black-box machine learning models, the genotype-phenotype map of a MAC was designed to satisfy known biological constraints on metabolism e.g., reaction stoichiometry, mass conservation, geneproduct-reaction encoding, nutrient environment. Therefore, we hypothesized that MACs should not only identify genetic determinants of AMR, but also provide metabolic systems explanations of their predictions.\n\nBelow, we focus our analysis on three case studies: pyrazinamide, para-aminosalicylic acid, and isoniazid AMR. These three antibiotics were chosen due to having both characterized and uncharacterized mechanisms underlying their associated alleles, allowing for both test cases and novel insights for the MAC. We analyze the best MACs for each antibiotic through four steps: (i) identification of significant fluxes discriminating between resistant and susceptible strains (i.e., flux GWAS), (ii) pathway enrichments of significant fluxes, (iii) identification of key allelic flux effects, and (iv) network-level flux tracing of allelic effects (Methods).\n\nMACs for pyrazinamide resistance. To identify key flux states discriminating between resistant and susceptible strains, we performed statistical associations between the strain-specific MAC fluxes, v k , and pyrazinamide AMR phenotypes using the training set of 77 strains (52 resistant, 25 susceptible) (we refer to this as Flux GWAS, see To gain a coarse systems view of the 25 significant fluxes, we performed pathway enrichment tests using a curated genepathway annotation list consisting of both BioCyc 30 and KEGG pathways 31 that accounts for 32% of protein-coding genes in the H37Rv genome (1254/3906) (Supplementary Data 2; Methods). Of the 245 total pathways, 5 were enriched with significant fluxes with less than 5% false discovery rate (FDR < 0.05) 32 and were primarily described by phthiocerol biosynthesis and nicotinate and nicotinamide metabolism (Fig. 3a). These results recapitulate two pyrazinamide features describing flux variation in nicotinamidase activity 33 and phthiocerol dimycocerosate (PDIM) biosynthesis 12 .\n\nWe then set out to understand the genetic basis for the flux associations by identifying loci in which the AMR association of each allele was correlated with their flux distribution (LOR-flux correlation) (see Methods). The idea here is that resistant alleles have different metabolic effects than susceptible alleles for key genes. These allele-specific flux differences underlie the AMR classification accuracy of the MAC. We identified significant LOR-flux correlations at pncA, ansP2, and ppsA loci (FDR < 0.05) (Fig. 3b). Specifically, the MACs infer a flux decreasing selection pressure at the pncA locus and flux increasing selection pressures at the ansP2 and ppsA loci. The estimated decreased enzymatic activity of pncA is consistent with studies describing resistant pncA mutants as loss of function 34 . Mutations in ppsA have previously been linked to pyrazinamide AMR 12 and convergent AMR evolution 35 while ansP2 mutants have not yet been associated with AMR.\n\nTo understand the global effects of pncA, ppsA, and ansP2 alleles on the metabolic network, we traced out their LOR-flux correlation through the 25 significant reactions (Fig. 3c). For ansP2, we observe that the increased generation of L-asparagine by the resistant ansP2 allele was utilized to generate coenzyme A (CoA) through aspartate aminotransferase (ASPTA) and citrate synthase (CS) (Fig. 3d), which recapitulates experimental studies describing L-aspartate-based modulation of CoA as a pyrazinamide resistance b a c d NATURE COMMUNICATIONS | https://doi.org/10.1038/s41467-020-16310-9 ARTICLE NATURE COMMUNICATIONS | (2020) 11:2580 | https://doi.org/10.1038/s41467-020-16310-9 | www.nature.com/naturecommunications mechanism 12 . However, our results differ from that of the proposed panD-based pantothenate route for CoA generation [36][37][38] . The lack of pyrazinamide-associated panD alleles in our dataset may underlie this discrepancy. In summary, pyrazinamide MACs correctly identify pncA and ppsA alleles as major genetic determinants and recapitulate nicotinamide metabolism, CoA biosynthesis, and phthiocerol metabolism as key metabolic associations 12,34 . As for new hypothesis, the MACs implicate ansP2 mutants in resistance through L-aspartate-based modulation of the coenzyme-A pool.\n\nMACs for Para-aminosalicylic acid resistance. We performed flux GWAS using the para-aminosalicylic acid training set of 375 strains (80 resistant, 295 susceptible) and identified 52 fluxes discriminating between resistant and susceptible strains (Bonferroni corrected P < 4.66 × 10 −5 , 0.05/1073 reactions) (Supplementary Fig. 7b, Supplementary Data 4). Of these 52 reactions, 10 were directly encoded by MAC alleles of 8 genes (thyA, katG, pncA, alar, cysK2, ald, fadE26, aspB, kdg, and inhA). Pathway enrichment tests of these 52 reactions identified S-adenosyl-L-methionine cycle II, NAD de novo biosynthesis I (from aspartate), and cysteine and methionine metabolism as key para-aminosalicylic acid pathways (FDR < 0.05) (Fig. 4a). The identification of cysteine and methionine metabolism recapitulates known metabolic effects of para-aminosalicylic acid 39 .\n\nWe tested these genes for allelic LOR-flux correlations and identified selection pressures at thyA, cysK2, alr, pncA, and fadD26 loci (FDR < 0.05, R 2 > 0.1) (Fig. 4b). Specifically, the MACs infer flux decreasing selection pressures at the thyA, cysK2, pncA, and fadD26 loci and a flux increasing selection pressure at the alr locus. The estimated decreased enzymatic activity of thyA resistant alleles is consistent with experimental studies describing thyA resistant mutants as loss of function 8,40 . The identification of alr and pncA-known determinants of cycloserine and pyrazinamide, respectively-reflect the co-resistance of these strains and are not known to have selective pressure in paraaminosalicylic acid treatment. Of these genes, only cysK2 encodes an enzyme in cysteine and methionine pathway and has not been previously linked to AMR.\n\nWe traced out the allelic LOR-flux correlation of cysK2 through cysteine and methionine pathway flux and found that their effects positively correlated with fadD26 alleles and negatively with thyA, alr, and pncA alleles (Fig. 4c). Resistant cysK2 alleles are estimated to lead to increased flux through O-succinylhomoserine (SHSL2r) and cystathionine beta-synthase (CYSTS). The effect of cysK2 decreases from SHSL2r to CYSTS at the L-homocysteine flux balance node, which implicates L-homocysteine modulation as the cysK2 selection pressure (Fig. 4d). Notably, L-homocysteine was experimentally identified as the most differentially perturbed metabolite resulting from para-aminosalicylic acid treatment 39 .\n\nIn summary, para-aminosalicylic acid MACs recover thyA as the primary genetic determinant and recapitulate cysteine and methionine metabolism as a major pathway induced by the drug. As for novel hypothesis, the MACs implicate deleterious cysK2 mutants in resistance through modulation of L-homocysteine that may either arise from deleterious thyA mutants or paraaminosalicylic acid treatment.\n\nMACs for isoniazid resistance. We performed flux GWAS using the isoniazid training set of 375 strains (248 resistant, 127 susceptible) and identified 160 significant fluxes (Bonferroni corrected P < 4.66 × 10 −5 , 0.05/1073 reactions) ( Supplementary  Fig. 7c, Supplementary Data 5). We find that only 11.3% (18/160) of the significant fluxes were catalyzed by gene-products of the MAC alleles. Pathway enrichments of the 160 significant fluxes identified TCA cycle V, oxidative phosphorylation, superpathway of mycolate biosynthesis, and gluconeogenesis I as key isoniazid pathways (FDR < 0.05) (Fig. 5a). These results are consistent with numerous studies demonstrating TCA and oxidative phosphorylation as key TB pathways altered by isoniazid treatment [41][42][43] and studies generally linking antibiotic efficacy to these pathways 44 . In general, we found that resistant strains were characterized by decreased respiratory activity, which is consistent with studies connecting decreased respiration to increased isoniazid resistance 42 . The genes encoding enzymes in these enriched pathways correspond to known (inhA, fabD, kasA, accD6, fadE24, ndh) and unknown (accD5, nuoL, gpdA2) genetic determinants of isoniazid resistance; however, none of these encoded for reactions annotated with TCA cycle V.\n\nWe tested the significant fluxes for allelic LOR-flux correlations and identified selection pressures at katG, ndh, nuoL, accD6, gpdA2, fabD, kasA, and accD5 loci (FDR < 0.05) (Fig. 5b). Specifically, the MACs infer flux decreasing selection pressures at the ndh, nuoL, fabD, gpdA2, and kasA loci and a flux increasing selection pressure at the katG, accD6, and accD5 locus (MCOATA is depicted in reverse direction). The resulting increased CAT flux observed in resistant strains is consistent with studies describing the majority of resistance-conferring katG alleles in clinical isolates as preserving catalase-peroxidase activity while disabling isoniazid binding (i.e., strains carrying susceptible-dominant katG alleles have low catalase-peroxidase flux due to isoniazid binding) 45,46 . The increased flux towards mycolic acid biosynthesis in resistant strains by fabD, accD6, and kasA is consistent with studies showing increased expression of these genes resulting from isoniazid treatment 47 . Furthermore, the metabolite acted on by these genes, malonyl-CoA, has recently been shown to have a significant fold change in response to 16 antibiotics in TB 48 .\n\nWe traced out significant LOR-flux correlations of these genes through the enriched pathways to elucidate their global network effects (Fig. 5c). For the novel genetic determinants, nuoL and gpdA2, we find that their alleles have significant flux effects in cytochrome bd oxidase reactions (CYTBD, CYTBD2) traced through menaquinone and ubiquinone flux balance nodes, respectively (Fig. 5d). The allelic effects of the primary genetic determinant, katG, are similarly traced through cytochrome bd oxidase flux by oxygen. The importance of cytochrome bd oxidase has recently been linked to isoniazid 41 . These results implicate gpdA2 and nuoL mutants in isoniazid AMR through modulation of quinone/menaquinone pools.\n\nIn summary, isoniazid MACs recover the primary (katG) and secondary (inhA, fabD, kasA, accD6, fadE24, ndh) genetic determinants and recapitulate oxidative phosphorylation, TCA, and mycolic acid biosynthesis as major pathways induced by the drug [41][42][43] . As for novel genetic hypothesis, the MACs implicate gpdA2 and nuoL mutants in resistance through modulation of menaquinone and ubiquinone that may either arise from katG mutants or isoniazid-induced oxidative stress.\n\nConventional pathway analyses do not recapitulate mechanisms. To assess how MAC results compare to mechanismagnostic approaches, we performed conventional pathway analysis of the 197 alleles (Supplementary Data 6, Methods). Comparison of pathway-based analysis showed that results derived from conventional pathway enrichments do not recapitulate the antibiotic mechanisms for isoniazid, pyrazinamide, and paraaminosalicylic acid. For isoniazid, a total of five pathways were enriched (FDR < 0.05); however, the significant allelic associations enriched in pathways were simply those annotated for katG, such as superoxide radicals degradation and tryptophan metabolism.\n\nFor para-aminosalicylic acid, L-alanine biosynthesis I was the only enriched pathway while no pathway was enriched for pyrazinamide alleles (FDR < 0.05).\n\nThese results show that flux balance constraints are required to generate meaningful network-level hypotheses for identified genetic associations. The basis for this advancement is that flux balances represent how the entirety of metabolic gene products come together to produce balanced homeostatic states.\n\n\nDiscussion\n\nWe have developed a computational framework for analyzing data sets (comprised of genotypes and binary phenotypes) using a genome-scale model (GEM) to identify the genetic and metabolic basis for TB AMR (Fig. 1a). The identification of the underlying biochemical mechanisms is reflected in the MAC. We first discuss our approach, emphasizing key design choices, and then describe the results it generates when applied to the TB dataset.\n\nThe outcome of the MAC depends on two major design choices: the set of alleles and the objective function that optimally separates strains into resistant and sensitive strain cohorts in the overall metabolic flux space. Although our approach does not explicitly require prior knowledge of key AMR genes, we chose a set of alleles with just over 100 genes with known and implicated AMR relations in order to both provide test cases and to address the combinatorial explosion of sampling possible allelic effects. Relaxing the current computational bottleneck in identifying MACs will enable the utilization of all alleles. For determining the NATURE COMMUNICATIONS | https://doi.org/10.1038/s41467-020-16310-9 ARTICLE objective function, our approach was based on the key insight that a linear program may behave as a machine learning classifier if its objective optimizes in the direction normal to a predictive classification plane. While we utilized PCA, L1-logistic regression, and the BIC metric to identify sparse linear objectives, there are potentially alternative avenues that could be taken. The major concept that should sustain in any model selection strategy is that a good model is simple (in structure) yet accurate (in its predictions). Application of the MAC to other GWAS datasets may therefore benefit from tuning these parameters appropriately.\n\nThe MAC advances current GWAS machine learning approaches by enabling a biochemical interpretation of genetic associations. Although advancements have been made to increase the explainability of black-box machine learning models [49][50][51] , such interpretations are limited by the lack of mechanistic knowledge incorporated in the model. We show that causal biochemical explanations for classifications can be derived by constraining a machine learning classifier to satisfy knowledgebased biological constraints (gene function, reaction stoichiometry, flux balance, etc).\n\nOur interpretation of MACs for pyrazinamide, paraaminosalicylic acid, and isoniazid AMR identified genome-scale flux states and key pathways discriminating resistant and susceptible strains. Notably, we found the MAC-identified pathways to be consistent with known antibiotic mechanisms. In contrast, conventional pathway analysis using only alleles was unable to recapitulate known pathway mechanisms. The MAC therefore provides a mechanistic approach for pathway-based analysis of genome-wide associations 52 .\n\nDissection of the allele-specific fluxes underlying the significant fluxes further clarified the genotype-phenotype map and provided hypotheses regarding specific allelic effects. For example, pyrazinamide MACs implicate an ansP2 allele as a novel resistance determinant through increased uptake of asparagine towards Laspartate-based CoA generation. The MAC thus extends allelephenotype associations (i.e., LOR) by estimating allele-specific flux effects and their network interactions.\n\nTaken together, the framework presented here meets the pressing need to integrate comprehensive biochemical mechanisms for the analysis of genomics-phenomics datasets. Our framework both recovers known gene-AMR relations and provides novel insights regarding their metabolic basis. As genome sequences, phenotypes, and genome-scale network reconstructions of microbes continue to grow in size and scope, similar results to those presented here are likely to appear in the coming years. This initial development of an FBA based GWAS analysis (FBA-GWAS) is likely to continue the development of a mechanistic basis into future GWAS methods.\n\n\nMethods\n\nCharacteristics of utilized datasets. The TB AMR datasets utilized in this study were acquired from a previous study that performed machine learning and protein structure analysis. References describing this data set are provided in the supplementary information of the previous study 2 . The dataset was initially acquired from the PATRIC database 26 . The sequencing and phenotypic testing data for these strains were generated at the Broad Institute. Additional information for these sequencing projects can be found at the Broad Institute website for the TB Antibiotic Resistance Catalog (TB-ARC).\n\nCuration and functional assessment of TB AMR genes. A list of known and implicated TB AMR genes was curated for 8 antibiotics (isoniazid, rifampicin, ethambutol, pyrazinamide, ofloxacin, d-cycloserine, para-aminosalicylic acid) using a combination of databases 53 , experimental studies, and computational studies 2,35,54,55 . Experimental studies on allele-specific effects for these AMR genes were curated utilizing a previous study performing 3D structural mutation mapping 2 and functional annotation from UNIPROT 56 . The lists of known and implicated TB AMR genes and mutational effects are provided (Supplementary Data 1).\n\nModification of base genome-scale model. We performed minor modifications to the base genome-scale model, iEK1011, in order to use it for the MAC. Specifically, we performed quality-assurance and quality check (QA/QC) by removing blocked reactions (i.e., cannot carry any flux) and imposing maximum and minimum allowable flux constraints on the model determined by Loopless Flux Variability Analysis (LFVA) 57,58 . Before FVA-derived constraints were imposed, we parameterized the exchange reactions according to the experimental nutrient media for testing AMR phenotypes, Middlebrook 7H10 (m7H10). Specifically, the LFVA simulations were constrained to have a biomass flux of at least 10% of its maximum value, and the total flux was bounded from above by 1.5 times the minimum total flux determined by parsimonious flux balance analysis 59 . The code for initializing the base genome-scale model is provided in the code repository.\n\nDiscretization of flux solution space for allelic effects. We determined the set of potential constraints imposed by an allele through discretization of the flux solution space. Following QA/QC, the flux solution space was sampled by Markov-Chain Monte-carlo sampling 60,61 , resulting in a probability distribution for each reaction flux. The solution space can then be discretized by first splitting the flux space in half at the mean flux. The upper bounds are then constructed by taking equal intervals from the mean to the maximum upper flux. The lower bounds are constructed similarly by setting them at equal intervals from the mean to the minimum lower flux. Notably, this discretization of the sampled flux space into upper and lower bound constraints requires the explicit definition of the total number of potential constraints an allele can potentially be mapped to. Specifying the set of constraints per allele determines the possible flux variation in the population. The set of constraints per allele was chosen to be minimally sufficient in our case, owing to the coarse resolution of the binary AMR phenotypes. Increasing the number of constraints per allele provides a finer resolution of the flux solution space, but comes at the cost of increasing the number of sampled MACs. We tested variations of the discretization resolution and found that while more constraints generally allow for the largest variety of variation, increasing the number of potential constraints by a linear factor leads to an exponential increase in the size of the solution space, requiring more samples. We found 4 to 10 constraints to be sufficient for generating popFVA states capable of explaining observed phenotypic variation. All constraint-based modeling was performed using the cobrapy package version 0.15.3 62 .\n\nRandomized sampling of allele-constraint map ensemble. Since knowledge of allele-specific effects are unavailable, we generated an ensemble of landscapes through randomized sampling of the allele-constraint map. Specifically, we generated an allele-constraint sample by sampling from each allele's discretized constraint set. The constraint set per allele includes the no change option and has a uniform probability distribution (i.e., each constraint has equal probability). An allele-constraint map sample is thus derived from sampling each allele's constraint distribution for all alleles.\n\nEstimation of MAC objective function. In order to identify the antibiotic-specific objective functions for each MAC, we first comprehensively evaluated the metabolic consequences of their allele-constraint map sample using a population extension of Flux Variability Analysis (FVA) 63 , named population FVA (popFVA). The popFVA linear program is formulated as follows, max v =min v v k;j ðMaximize and minimize flux through all j reactionsÞ s:t:\nSv k ¼ 0 ðFlux balance constraintÞ v lb ≤ v ≤ v ub ðOver-all min=max flux constraintsÞ Ga lb ¼ v lb ≤ v ≤ v ub ¼ Ga ub ðAllele-specific min=max flux constraintsÞð2Þ\nWhere G is the genetic variant matrix with k strains and i alleles, and where S is the stoichiometric matrix. The matrices a ub and a lb describe the mapping of alleles to upper bound (ub) and lower bound (lb) flux constraints, respectively (allele-constraint map). Optimizing the minimum and maximum flux through all allelecatalyzed reactions represents our ignorance of the true evolutionary forces underlying the dataset. Once popFVA is computed for the MAC allele-constraint map, we then approximate the MAC linear objective using a series of steps described below.\n\n1. We first use principal component analysis (PCA) to decompose the popFVA landscape, X, into a linear combination of two matrices, U (strains, PCA components) and V T (popFVA features, PCA components) (e.g., X = UV). Prior to decomposition, X was first normalized using minmax scaling. PCA was constrained to explain at least 90% of the total variation and implemented using the pca function in the scikit-learn toolbox v.0.20.3 64 . 2. The U matrix was then fit using L1-regularized logistic regression (LogReg) to predict AMR phenotypes. L1-regularized logistic regression was implemented using the Logit function in the statsmodels package version 0.9.0 65 with parameters maxiter, disp, and alpha set to 1500, False, and 0.5, respectively. An intercept was included for the regression model using the add_intercept function in statsmodels. The process of using PCA with regression is known as principal component regression (PCR). 3. To identify a linear programming objective from the PCR model, we make the key observation that the PCR function is a linear function normal to the decision boundary and has increasing/decreasing probability of classifying strain as resistant as you go further from the decision boundary (i.e., probability is closer to 0.5 at boundary and closer to 0 or 1 as you go further away). Therefore, the PCR function itself provides an ideal template for identifying a linear programming objective. We expect that the MAC predicts increasing or decreasing resistance as we maximize or minimize the objective value. Since the MAC objective function operates on the flux space, a series of mathematical transformations were taken to go from the PCR popFVA model to the MAC objective function (i.e., LogReg(PCA(FVA fluxes) → LogReg(v)). We start with the PCA decomposition of the popFVA fluxes (3)\nPCAðFVA fluxesÞ ! U ¼ XZð3Þ\nWhere X is the popFVA fluxes (strains, popFVA features), and U describes the PCA components (strains, PCA components) and Z has shape (popFVA features, PCA components). Fitting logistic regression to predict AMR using the PCA components gives the following Eq. (4)\nLogRegðPCAðFVA fluxesÞÞ ! Y ¼ b 0 þ b 1 u 1 þ Á Á Á þ b k u kð4Þ\nWhere u describes the k PCA components and b describes the LogReg coefficients. From this, we transform back to FVA space using the following mapping (5)\nX ¼ UZ Tð5Þ\nWhich leads to the new LogReg equation,\nLogRegðFVA fluxesÞ ! Y ¼ b 0 þ c 1 x 1 þ Á Á Á þ c m x mð6Þ\nWhere c m ¼ P k i¼1 z m;i b i for m popFVA variables and k PCA components. The c values become the coefficients in the MAC objective function by representing the V max popFVA variables as V forward flux variables and V min popFVA features as V reverse flux variables.\n\nIf the objective is a minimization, then it is converted to a maximization by multiplying the objective function by −1.\n\nAssessment of MAC quality and model selection. We used the Bayesian-Information criterion (BIC) to assess the quality of each MAC sample. Specifically, the BIC was derived from the PCR model used to infer the MAC objective. Since the BIC value, by itself, is not interpretable, high-quality MACs were determined according to their specific distance from the minimum BIC value, ΔBIC i (i.e., ΔBIC i = 0 for minimum BIC model). We chose a ΔBIC i cutoff of 10, which is in line with a rule of thumb that meaningful models (i.e., relatively high empirical support) should have ΔBIC i < 10 66 .\n\nNATURE COMMUNICATIONS | https://doi.org/10.1038/s41467-020-16310-9 ARTICLE NATURE COMMUNICATIONS | (2020) 11:2580 | https://doi.org/10.1038/s41467-020-16310-9 | www.nature.com/naturecommunications Flux GWAS. We performed statistical tests to identify MAC fluxes significantly associated with AMR phenotypes. The goal was to determine which fluxes differentiate resistant and susceptible strains. Specifically, we tested whether the median scaled flux of a reaction was linearly correlated AMR phenotypes using an ANOVA F-test implemented by the f_classif function in the scikit-learn toolbox v.0.20.3 64 . The strain-specific reaction fluxes per MAC were normalized to be between zero and one using the MinMaxScaler function in the scikit-learn toolbox 64 . The set of significant reaction fluxes was determined by the Bonferronicorrected significance threshold set at P < 0.05/1073 = 4.66 × 10 −5 .\n\nPathway enrichments for significant fluxes. We identified metabolic pathways enriched in significant AMR-associated fluxes through hypergeometric enrichment tests using the scipy function hypergeom 67 . The set of pathways was curated by combining gene-pathway annotations using both BioCyc 30 and KEGG 31 pathway annotations of TB genes. Pathways with 2 or less reactions were removed from the list, leaving a total of 264 pathways. We identified significant pathways as having less than 5% false discovery rate (FDR) correction by the Benjamini-Hochberg method.\n\nStatistical tests for allelic AMR and flux stratification. We tested the AMRbased flux stratification of alleles by fitting a linear regression line between the allele log odds ratio (LOR) and fluxes. Linear regression was implemented using the linregress function in the scipy package. The LOR for each allele with respect to a specific antibiotic was quantified as LOR = log 10 ((PR/PS)/(AR/AS)). PR, PS, AR, and AS denote number of strains that have the allele and are resistant (PR), have the allele and are susceptible (PS), do not have the allele and are resistant (AR), and do not have the allele and are susceptible (AS), respectively. If any of the values were 0, then 0.5 was added to each value to ensure a value when computing the logarithm. The fluxes for each allele were defined as the set of fluxes in strains containing that allele. We identified significant allelic LOR-flux correlations as having less than 5% FDR by the Benjamini-Hochberg method.\n\nConventional pathway analysis of allelic variants. We identified metabolic pathways enriched in the alleles of key AMR genes through hypergeometric enrichment tests using the scipy function hypergeom and the gene-pathway annotation list described above. We identified significant pathways as having less than 5% false discovery rate (FDR) correction by the Benjamini-Hochberg method.\n\nReporting summary. Further information on research design is available in the Nature Research Reporting Summary linked to this article.\n\n\nData availability\n\nThe TB AMR datasets utilized in this study were acquired from a previous study that performed machine learning and protein structure analysis 2 . References describing this data set are provided in the supplementary information of the previous study 2 . The dataset was initially acquired from the PATRIC database 26 . The sequencing and phenotypic testing data for these strains were generated at the Broad Institute. Additional information for these sequencing projects can be found at the Broad Institute website for the TB Antibiotic Resistance Catalog (TB-ARC).\n\n\nFig. 1d). Flux GWAS identified 25 significant reaction fluxes (Bonferroni corrected P < 4.66 × 10 −5 , 0.05/1073 reactions) whose gene-protein reaction rules overlappedwith 8 genes modeled by MAC alleles (pncA, ansP2, fadD26, ppsA, and drrABC) (Supplementary Fig. 7a; Supplementary Data 3). a b Fig. 2 Validation of metabolic allele classifiers. a Receiver operator characteristic (ROC) curves for MAC AMR predictions determined using a test set of 1188 isoniazid-tested strains. b Histogram of median absolute MAC objective function coefficients (c y T ) for pyrazinamide, para-aminosalicylic acid, and isoniazid MACs. The reaction variables corresponding to the two largest coefficients are noted in text. The reaction variable corresponding to the primary genetic determinant is colored pink. Abbreviations: AUC, area under the curve.\n\nFig. 3\n3Characterization of pyrazinamide MACs. a Horizontal bar plots of pathways enriched with significant pyrazinamide-associated fluxes with FDR < 0.05. b Boxplots of pncA, ansP2, and ppsA allele-specific fluxes for the reactions catalyzed by their gene-products. Alleles are rank ordered from least to greatest by their log odds ratio (LOR), from left to right. The boxes are colored according to the allele LOR, where positive corresponds to resistant (R) dominant while negative corresponds to susceptible (S) dominant. The box shows the quartiles of the dataset with the median noted as the horizontal line while the whiskers extend to show the rest of the points with outliers colored gray. The R-squared and P-value for the regression between allele LOR and flux is noted. See Supplementary Data 3 for list of mutations per allele. c Clustered heatmap of allele LOR-flux correlations between genes (y-axis) and significant reactions fluxes (x-axis). d Pathway depiction of nicotinate and nicotinamide metabolism and phthiocerol biosynthesis with objective variables plotted. Coenzyme-A generation from L-asparagine through aspartate decarboxylase (ASPTA) and citrate synthase (CS) is also depicted. Traced allelic effects are shown as dashed lines and colored for pncA, ansP2, and ppsA.\n\nFig. 4\n4Characterization of para-aminosalicylic acid MACs. a Horizontal bar plots of pathways enriched with significant para-aminosalicylic acid-associated fluxes with FDR < 0.05. b Boxplots of thyA, cysK2, alr, pncA, and fadD26 allele-specific fluxes for the reactions catalyzed by their gene-products. Alleles are rank ordered from least to greatest by their log odds ratio (LOR), from left to right. The boxes are colored according to the allele LOR, where positive corresponds to resistant (R) dominant while negative corresponds to susceptible (S) dominant. The box shows the quartiles of the dataset with the median noted as the horizontal line while the whiskers extend to show the rest of the points with outliers colored gray. The R-squared and P-value for the regression between allele LOR and flux is noted. See Supplementary Data 4 for list of mutations per allele. c Clustered heatmap of allele LOR-flux correlations for significant reactions in cysteine and methionine metabolism. d Pathway depiction of cysteine and methionine metabolism and one carbon pool by folate. Significant allelic effects are shown by dashed lines and colored for thyA and cysK2.\n\nFig. 5\n5Characterization of isoniazid MACs. a Horizontal bar plots of pathways enriched with significant isoniazid-associated fluxes with FDR < 0.05. b Boxplots of katG, nuoL, ndh, gpdA2, accD6, fabD, kasA, and accD5 allele-specific fluxes for the reactions catalyzed by their gene-products. Alleles are rank ordered from least to greatest by their log odds ratio (LOR), from left to right. The flux (y-axis) is the median scaled flux across the high-quality isoniazid MACs. The boxes are colored according to the allele LOR, where positive corresponds to resistant (R) dominant while negative corresponds to susceptible (S) dominant. The box shows the quartiles of the dataset with the median noted as the horizontal line while the whiskers extend to show the rest of the points with outliers colored gray. The R-squared and P-value for the regression between allele LOR and flux is noted. See Supplementary Data 5 for list of mutations per allele. c Clustered heatmap of allele LOR-flux correlations for significant reactions in TCA Cycle V, Oxidative phosphorylation, and Mycolate biosynthesis. d Pathway depiction of TCA Cycle V, Oxidative phosphorylation, and Mycolate biosynthesis. Significant allelic effects are shown by dashed lines and colored for gpdA2 and nuoL.\n\n, Supplementary Table 1 )\nSupplementary1\nNATURE COMMUNICATIONS | (2020) 11:2580 | https://doi.org/10.1038/s41467-020-16310-9 | www.nature.com/naturecommunications\nNATURE COMMUNICATIONS | https://doi.org/10.1038/s41467-020-16310-9\n© The Author(s) 2020\nCode availabilityCode for MACs is available on GitHub (https://github.com/erolkavvas/metabolic-alleleclassifiers).Received: 6 August 2019; Accepted: 16 April 2020;AcknowledgementsWe would like to thank Anand Sastry, Jean-Christophe Lachance, Yara Seif, and Jason Hyun for helpful discussions and Marc Abrams for editing the manuscript. This research was supported by the NIAID grant (AI124316), the NIGMS (GM102098), and the Novo Nordisk Foundation Grant Number NNF10CC1016517.Author contributionsCompeting interestsThe authors declare no competing interests.Additional informationSupplementary information is available for this paper at https://doi.org/10.1038/s41467-020-16310-9.Correspondence and requests for materials should be addressed to B.O.P.Peer review information Nature Communications thanks Francesc Coll and the other, anonymous, reviewer(s) for their contribution to the peer review of this work. Peer reviewer reports are available Reprints and permission information is available at http://www.nature.com/reprintsPublisher's note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations.Open Access This article is licensed under a Creative Commons Attribution 4.0 International License, which permits use, sharing, adaptation, distribution and reproduction in any medium or format, as long as you give appropriate credit to the original author(s) and the source, provide a link to the Creative Commons license, and indicate if changes were made. The images or other third party material in this article are included in the article's Creative Commons license, unless indicated otherwise in a credit line to the material. If material is not included in the article's Creative Commons license and your intended use is not permitted by statutory regulation or exceeds the permitted use, you will need to obtain permission directly from the copyright holder. To view a copy of this license, visit http://creativecommons.org/ licenses/by/4.0/.\n. W H Organization, Others, Global Tuberculosis Report. World Health OrganizationOrganization, W. H. & Others. Global Tuberculosis Report 2018. (World Health Organization, 2018).\n\nMachine learning and structural analysis of Mycobacterium tuberculosis pan-genome identifies genetic signatures of antibiotic resistance. E S Kavvas, Nat. Commun. 94306Kavvas, E. S. et al. Machine learning and structural analysis of Mycobacterium tuberculosis pan-genome identifies genetic signatures of antibiotic resistance. Nat. Commun. 9, 4306 (2018).\n\nSequencing-based methods and resources to study antimicrobial resistance. M Boolchandani, A W Souza, G Dantas, 10.1038/s41576-019-0108-4s41576-019-0108-4Nat. Rev. Genet. Boolchandani, M., D'Souza, A. W. & Dantas, G. Sequencing-based methods and resources to study antimicrobial resistance. Nat. Rev. Genet. https://doi. org/10.1038/s41576-019-0108-4 (2019).\n\nAntimicrobial resistance prediction in PATRIC and RAST. J J Davis, Sci. Rep. 627930Davis, J. J. et al. Antimicrobial resistance prediction in PATRIC and RAST. Sci. Rep. 6, 27930 (2016).\n\nDeepARG: a deep learning approach for predicting antibiotic resistance genes from metagenomic data. G Arango-Argoty, 623Arango-Argoty, G. et al. DeepARG: a deep learning approach for predicting antibiotic resistance genes from metagenomic data. Microbiome 6, 23 (2018).\n\nWhole genome sequencing of Mycobacterium tuberculosis: current standards and open issues. C J Meehan, 10.1038/s41579-019-0214-5s41579-019-0214-5Nat. Rev. Microbiol. 17Meehan, C.J. et al. Whole genome sequencing of Mycobacterium tuberculosis: current standards and open issues. Nat. Rev. Microbiol. 17, 533-545 https:// doi.org/10.1038/s41579-019-0214-5 (2019).\n\nIdentifying lineage effects when controlling for population structure improves power in bacterial association studies. S G Earle, Nat. Microbiol. 116041Earle, S. G. et al. Identifying lineage effects when controlling for population structure improves power in bacterial association studies. Nat. Microbiol. 1, 16041 (2016).\n\npara-Aminosalicylic acid is a prodrug targeting dihydrofolate reductase in Mycobacterium tuberculosis. J Zheng, J. Biol. Chem. 288Zheng, J. et al. para-Aminosalicylic acid is a prodrug targeting dihydrofolate reductase in Mycobacterium tuberculosis. J. Biol. Chem. 288, 23447-23456 (2013).\n\nEvolution of high-level ethambutol-resistant tuberculosis through interacting mutations in decaprenylphosphoryl-[beta]-D-arabinose biosynthetic and utilization pathway genes. H Safi, Nat. Genet. 45Safi, H. et al. Evolution of high-level ethambutol-resistant tuberculosis through interacting mutations in decaprenylphosphoryl-[beta]-D-arabinose biosynthetic and utilization pathway genes. Nat. Genet. 45, 1190-1197 (2013).\n\nGenomic and functional analyses of Mycobacterium tuberculosis strains implicate ald in D-cycloserine resistance. C A Desjardins, Nat. Genet. 48Desjardins, C. A. et al. Genomic and functional analyses of Mycobacterium tuberculosis strains implicate ald in D-cycloserine resistance. Nat. Genet. 48, 544-551 (2016).\n\nClinically prevalent mutations in Mycobacterium tuberculosis alter propionate metabolism and mediate multidrug tolerance. N D Hicks, Nat. Microbiol. 3Hicks, N. D. et al. Clinically prevalent mutations in Mycobacterium tuberculosis alter propionate metabolism and mediate multidrug tolerance. Nat. Microbiol. 3, 1032-1042 (2018).\n\nPyrazinamide resistance is caused by two distinct mechanisms: prevention of coenzyme A depletion and loss of virulence factor synthesis. P Gopal, ACS Infect. Dis. 2Gopal, P. et al. Pyrazinamide resistance is caused by two distinct mechanisms: prevention of coenzyme A depletion and loss of virulence factor synthesis. ACS Infect. Dis. 2, 616-626 (2016).\n\nVisible machine learning for biomedicine. M K Yu, Cell. 173Yu, M. K. et al. Visible machine learning for biomedicine. Cell 173, 1562-1565 (2018).\n\nUsing deep learning to model the hierarchical structure and function of a cell. J Ma, Nat. Methods. 15Ma, J. et al. Using deep learning to model the hierarchical structure and function of a cell. Nat. Methods 15, 290-298 (2018).\n\nNext-generation machine learning for biological networks. D M Camacho, K M Collins, R K Powers, J C Costello, J J Collins, Cell. 173Camacho, D. M., Collins, K. M., Powers, R. K., Costello, J. C. & Collins, J. J. Next-generation machine learning for biological networks. Cell 173, 1581-1592 (2018).\n\nB Ø Palsson, Systems Biology: Constraint-based Reconstruction and Analysis. Cambridge University PressPalsson, B. Ø. Systems Biology: Constraint-based Reconstruction and Analysis. (Cambridge University Press, 2015).\n\nUsing genome-scale models to predict biological capabilities. E J O&apos;brien, J M Monk, B O Palsson, Cell. 161O'Brien, E. J., Monk, J. M. & Palsson, B. O. Using genome-scale models to predict biological capabilities. Cell 161, 971-987 (2015).\n\nConstraint-based models predict metabolic and associated cellular functions. A Bordbar, J M Monk, Z A King, B O Palsson, Nat. Rev. Genet. 15Bordbar, A., Monk, J. M., King, Z. A. & Palsson, B. O. Constraint-based models predict metabolic and associated cellular functions. Nat. Rev. Genet. 15, 107-120 (2014).\n\nA white-box machine learning approach for revealing antibiotic mechanisms of action. J H Yang, Cell. 177Yang, J. H. et al. A white-box machine learning approach for revealing antibiotic mechanisms of action. Cell 177, 1649-1661 (2019).\n\nGenome-scale metabolic reconstructions of multiple Escherichia coli strains highlight strain-specific adaptations to nutritional environments. J M Monk, Proc. Natl. Acad. Sci. USA. 110Monk, J. M. et al. Genome-scale metabolic reconstructions of multiple Escherichia coli strains highlight strain-specific adaptations to nutritional environments. Proc. Natl. Acad. Sci. USA 110, 20338-20343 (2013).\n\nComparative genome-scale modelling of Staphylococcus aureus strains identifies strain-specific metabolic capabilities linked to pathogenicity. E Bosi, Proc. Natl. Acad. Sci. USA. 113Bosi, E. et al. Comparative genome-scale modelling of Staphylococcus aureus strains identifies strain-specific metabolic capabilities linked to pathogenicity. Proc. Natl. Acad. Sci. USA 113, E3801-E3809 (2016).\n\nGenome-scale metabolic reconstructions of multiple Salmonella strains reveal serovar-specific metabolic traits. Y Seif, Nat. Commun. 93771Seif, Y. et al. Genome-scale metabolic reconstructions of multiple Salmonella strains reveal serovar-specific metabolic traits. Nat. Commun. 9, 3771 (2018).\n\nEscherichia coli B2 strains prevalent in inflammatory bowel disease patients have distinct metabolic capabilities that enable colonization of intestinal mucosa. X Fang, BMC Syst. Biol. 1266Fang, X. et al. Escherichia coli B2 strains prevalent in inflammatory bowel disease patients have distinct metabolic capabilities that enable colonization of intestinal mucosa. BMC Syst. Biol. 12, 66 (2018).\n\nAnalysis of genetic variation and potential applications in genome-scale metabolic modeling. J G R Cardoso, M R Andersen, M J Herrgård, N Sonnenschein, Front. Bioeng. Biotechnol. 313Cardoso, J. G. R., Andersen, M. R., Herrgård, M. J. & Sonnenschein, N. Analysis of genetic variation and potential applications in genome-scale metabolic modeling. Front. Bioeng. Biotechnol. 3, 13 (2015).\n\nBacterial GWAS: not just gilding the lily. J A Lees, S D Bentley, Nat. Rev. Microbiol. 14406Lees, J. A. & Bentley, S. D. Bacterial GWAS: not just gilding the lily. Nat. Rev. Microbiol. 14, 406 (2016).\n\nPATRIC, the bacterial bioinformatics database and analysis resource. A R Wattam, Nucleic Acids Res. 42Wattam, A. R. et al. PATRIC, the bacterial bioinformatics database and analysis resource. Nucleic Acids Res. 42, D581-D591 (2014).\n\nUpdated and standardized genome-scale reconstruction of Mycobacterium tuberculosis H37Rv, iEK1011, simulates flux states indicative of physiological conditions. E S Kavvas, BMC Syst. Biol. 1225Kavvas, E. S. et al. Updated and standardized genome-scale reconstruction of Mycobacterium tuberculosis H37Rv, iEK1011, simulates flux states indicative of physiological conditions. BMC Syst. Biol. 12, 25 (2018).\n\nStoichiometric flux balance models quantitatively predict growth and metabolic by-product secretion in wild-type Escherichia coli W3110. A Varma, B O Palsson, Appl. Environ. Microbiol. 60Varma, A. & Palsson, B. O. Stoichiometric flux balance models quantitatively predict growth and metabolic by-product secretion in wild-type Escherichia coli W3110. Appl. Environ. Microbiol. 60, 3724-3731 (1994).\n\nWhat is flux balance analysis?. J D Orth, I Thiele, B Ø Palsson, Nat. Biotechnol. 28Orth, J. D., Thiele, I. & Palsson, B. Ø. What is flux balance analysis? Nat. Biotechnol. 28, 245-248 (2010).\n\nThe MetaCyc database of metabolic pathways and enzymes and the BioCyc collection of pathway/genome databases. R Caspi, Nucleic Acids Res. 42Caspi, R. et al. The MetaCyc database of metabolic pathways and enzymes and the BioCyc collection of pathway/genome databases. Nucleic Acids Res. 42, D459-D471 (2014).\n\nNew approach for understanding genome variations in KEGG. M Kanehisa, Y Sato, M Furumichi, K Morishima, M Tanabe, Nucleic Acids Res. 47Kanehisa, M., Sato, Y., Furumichi, M., Morishima, K. & Tanabe, M. New approach for understanding genome variations in KEGG. Nucleic Acids Res. 47, D590-D595 (2019).\n\nStatistical significance for genomewide studies. J D Storey, R Tibshirani, Proc. Natl. Acad. Sci. USA. 100Storey, J. D. & Tibshirani, R. Statistical significance for genomewide studies. Proc. Natl. Acad. Sci. USA 100, 9440-9445 (2003).\n\nMutations in pncA, a gene encoding pyrazinamidase/ nicotinamidase, cause resistance to the antituberculous drug pyrazinamide in tubercle bacillus. A Scorpio, Y Zhang, Nat. Med. 2Scorpio, A. & Zhang, Y. Mutations in pncA, a gene encoding pyrazinamidase/ nicotinamidase, cause resistance to the antituberculous drug pyrazinamide in tubercle bacillus. Nat. Med. 2, 662-667 (1996).\n\nCharacterization of Mycobacterium tuberculosis nicotinamidase/pyrazinamidase. H Zhang, FEBS J. 275Zhang, H. et al. Characterization of Mycobacterium tuberculosis nicotinamidase/pyrazinamidase. FEBS J. 275, 753-762 (2008).\n\nGenomic analysis identifies targets of convergent positive selection in drug-resistant Mycobacterium tuberculosis. M R Farhat, Nat. Genet. 45Farhat, M. R. et al. Genomic analysis identifies targets of convergent positive selection in drug-resistant Mycobacterium tuberculosis. Nat. Genet. 45, 1183-1189 (2013).\n\nPyrazinoic acid inhibits mycobacterial coenzyme A biosynthesis by binding to aspartate decarboxylase PanD. P Gopal, ACS Infect. Dis. 3Gopal, P. et al. Pyrazinoic acid inhibits mycobacterial coenzyme A biosynthesis by binding to aspartate decarboxylase PanD. ACS Infect. Dis. 3, 807-819 (2017).\n\nPantothenate and pantetheine antagonize the antitubercular activity of pyrazinamide. N A Dillon, N D Peterson, B C Rosen, A D Baughn, Antimicrob. Agents Chemother. 58Dillon, N. A., Peterson, N. D., Rosen, B. C. & Baughn, A. D. Pantothenate and pantetheine antagonize the antitubercular activity of pyrazinamide. Antimicrob. Agents Chemother. 58, 7258-7263 (2014).\n\nMutations in panD encoding aspartate decarboxylase are associated with pyrazinamide resistance in Mycobacterium tuberculosis. S Zhang, Emerg. Microbes Infect. 234Zhang, S. et al. Mutations in panD encoding aspartate decarboxylase are associated with pyrazinamide resistance in Mycobacterium tuberculosis. Emerg. Microbes Infect. 2, e34 (2013).\n\nParaaminosalicylic acid acts as an alternative substrate of folate metabolism in Mycobacterium tuberculosis. S Chakraborty, T Gruber, C E Barry, H I Boshoff, K Y Rhee, Science. 339Chakraborty, S., Gruber, T., Barry, C. E. 3rd, Boshoff, H. I. & Rhee, K. Y. Para- aminosalicylic acid acts as an alternative substrate of folate metabolism in Mycobacterium tuberculosis. Science 339, 88-91 (2013).\n\ndfrA thyA double deletion in para-aminosalicylic acid-resistant Mycobacterium tuberculosis Beijing strains. D Moradigaravand, Antimicrob. Agents Chemother. 60Moradigaravand, D. et al. dfrA thyA double deletion in para-aminosalicylic acid-resistant Mycobacterium tuberculosis Beijing strains. Antimicrob. Agents Chemother. 60, 3864-3867 (2016).\n\nIsoniazid bactericidal activity involves electron transport chain perturbation. S Zeng, Antimicrob. Agents Chemother. 63Zeng, S. et al. Isoniazid bactericidal activity involves electron transport chain perturbation. Antimicrob. Agents Chemother. 63, e01841-18 (2019).\n\nEnhanced respiration prevents drug tolerance and drug resistance in Mycobacterium tuberculosis. C Vilchèze, Proc. Natl. Acad. Sci. USA. 114Vilchèze, C. et al. Enhanced respiration prevents drug tolerance and drug resistance in Mycobacterium tuberculosis. Proc. Natl. Acad. Sci. USA 114, 4495-4500 (2017).\n\nIsocitrate lyase mediates broad antibiotic tolerance in Mycobacterium tuberculosis. M Nandakumar, C Nathan, K Y Rhee, Nat. Commun. 54306Nandakumar, M., Nathan, C. & Rhee, K. Y. Isocitrate lyase mediates broad antibiotic tolerance in Mycobacterium tuberculosis. Nat. Commun. 5, 4306 (2014).\n\nAntibiotic efficacy is linked to bacterial cellular respiration. M A Lobritz, Proc. Natl. Acad. Sci. USA. 112Lobritz, M. A. et al. Antibiotic efficacy is linked to bacterial cellular respiration. Proc. Natl. Acad. Sci. USA 112, 8173-8180 (2015).\n\nRecombinant Mycobacterium tuberculosis KatG (S315T) is a competent catalase-peroxidase with reduced activity toward isoniazid. N L Wengenack, J. Infect. Dis. 176Wengenack, N. L. et al. Recombinant Mycobacterium tuberculosis KatG (S315T) is a competent catalase-peroxidase with reduced activity toward isoniazid. J. Infect. Dis. 176, 722-727 (1997).\n\nEffect of katG mutations on the virulence of Mycobacterium tuberculosis and the implication for transmission in humans. A S Pym, B Saint-Joanis, S T Cole, Infect. Immun. 70Pym, A. S., Saint-Joanis, B. & Cole, S. T. Effect of katG mutations on the virulence of Mycobacterium tuberculosis and the implication for transmission in humans. Infect. Immun. 70, 4955-4960 (2002).\n\nExploring drug-induced alterations in gene expression in Mycobacterium tuberculosis by microarray hybridization. M Wilson, Proc. Natl. Acad. Sci. USA. 96Wilson, M. et al. Exploring drug-induced alterations in gene expression in Mycobacterium tuberculosis by microarray hybridization. Proc. Natl. Acad. Sci. USA 96, 12833-12838 (1999).\n\nHigh-throughput metabolomic analysis predicts mode of action of uncharacterized antimicrobial compounds. M Zampieri, Sci. Transl. Med. 103973Zampieri, M. et al. High-throughput metabolomic analysis predicts mode of action of uncharacterized antimicrobial compounds. Sci. Transl. Med. 10, eaal3973 (2018).\n\nWhy should I trust you? Explaining the predictions of any classifier. M T Ribeiro, S Singh, C Guestrin, Proceedings of the 22nd ACM SIGKDD International Conference on Knowledge Discovery and Data Mining. the 22nd ACM SIGKDD International Conference on Knowledge Discovery and Data MiningACMRibeiro, M. T., Singh, S. & Guestrin, C. Why should I trust you? Explaining the predictions of any classifier. in Proceedings of the 22nd ACM SIGKDD International Conference on Knowledge Discovery and Data Mining 1135-1144 (ACM, 2016).\n\nPeeking inside the black-box: a survey on explainable artificial intelligence (XAI). A Adadi, M Berrada, IEEE Access. 6Adadi, A. & Berrada, M. Peeking inside the black-box: a survey on explainable artificial intelligence (XAI). IEEE Access 6, 52138-52160 (2018).\n\nDARPA's explainable artificial intelligence (XAI) program. D Gunning, D Aha, AI Magazine. 40Gunning, D. & Aha, D. DARPA's explainable artificial intelligence (XAI) program. AI Magazine 40, 44-58 (2019).\n\nAnalysing biological pathways in genomewide association studies. K Wang, M Li, H Hakonarson, Nat. Rev. Genet. 11Wang, K., Li, M. & Hakonarson, H. Analysing biological pathways in genome- wide association studies. Nat. Rev. Genet. 11, 843-854 (2010).\n\nTuberculosis drug resistance mutation database. A Sandgren, PLoS Med. 62Sandgren, A. et al. Tuberculosis drug resistance mutation database. PLoS Med. 6, e2 (2009).\n\nGenome-wide analysis of multi-and extensively drug-resistant Mycobacterium tuberculosis. F Coll, Nat. Genet. 50Coll, F. et al. Genome-wide analysis of multi-and extensively drug-resistant Mycobacterium tuberculosis. Nat. Genet. 50, 307-316 (2018).\n\nWhole-genome sequencing for prediction of Mycobacterium tuberculosis drug susceptibility and resistance: a retrospective cohort study. T M Walker, Lancet Infect. Dis. 15Walker, T. M. et al. Whole-genome sequencing for prediction of Mycobacterium tuberculosis drug susceptibility and resistance: a retrospective cohort study. Lancet Infect. Dis. 15, 1193-1202 (2015).\n\nUniProt: the universal protein knowledgebase. The UniProt Consortium. 45The UniProt Consortium. UniProt: the universal protein knowledgebase. Nucleic Acids Res. 45, D158-D169 (2017).\n\nCycleFreeFlux: efficient removal of thermodynamically infeasible loops from flux distributions. A A Desouki, F Jarre, G Gelius-Dietrich, M J Lercher, Bioinformatics. 31Desouki, A. A., Jarre, F., Gelius-Dietrich, G. & Lercher, M. J. CycleFreeFlux: efficient removal of thermodynamically infeasible loops from flux distributions. Bioinformatics 31, 2159-2165 (2015).\n\nComputationally efficient flux variability analysis. S Gudmundsson, I Thiele, BMC Bioinformatics. 11489Gudmundsson, S. & Thiele, I. Computationally efficient flux variability analysis. BMC Bioinformatics 11, 489 (2010).\n\nOmic data from evolved E. coli are consistent with computed optimal growth from genome-scale models. N E Lewis, Mol. Syst. Biol. 6390Lewis, N. E. et al. Omic data from evolved E. coli are consistent with computed optimal growth from genome-scale models. Mol. Syst. Biol. 6, 390 (2010).\n\nUse of randomized sampling for analysis of metabolic networks. J Schellenberger, B Ø Palsson, J. Biol. Chem. 284Schellenberger, J. & Palsson, B. Ø. Use of randomized sampling for analysis of metabolic networks. J. Biol. Chem. 284, 5457-5461 (2009).\n\noptGpSampler: an improved tool for uniformly sampling the solution-space of genome-scale metabolic networks. W Megchelenbrink, M Huynen, E Marchiori, PLoS ONE. 986587Megchelenbrink, W., Huynen, M. & Marchiori, E. optGpSampler: an improved tool for uniformly sampling the solution-space of genome-scale metabolic networks. PLoS ONE 9, e86587 (2014).\n\nCOBRApy: constraints-based reconstruction and analysis for Python. A Ebrahim, J A Lerman, B O Palsson, D R Hyduke, BMC Syst. Biol. 774Ebrahim, A., Lerman, J. A., Palsson, B. O. & Hyduke, D. R. COBRApy: constraints-based reconstruction and analysis for Python. BMC Syst. Biol. 7, 74 (2013).\n\nThe effects of alternate optimal solutions in constraint-based genome-scale metabolic models. R Mahadevan, C H Schilling, Metab. Eng. 5Mahadevan, R. & Schilling, C. H. The effects of alternate optimal solutions in constraint-based genome-scale metabolic models. Metab. Eng. 5, 264-276 (2003).\n\nScikit-learn: machine learning in Python. F Pedregosa, J. Mach. Learn. Res. 12Pedregosa, F. et al. Scikit-learn: machine learning in Python. J. Mach. Learn. Res. 12, 2825-2830 (2011).\n\nStatsmodels: econometric and statistical modeling with python. S Seabold, J Perktold, Proceedings of the 9th Python in Science Conference. the 9th Python in Science ConferenceScipySeabold, S. & Perktold, J. Statsmodels: econometric and statistical modeling with python. In Proceedings of the 9th Python in Science Conference (Scipy, 2010).\n\nModel selection and multimodel inference: a practical information-theoretic approach. K P Burnham, D R Anderson, Springer Science & Business MediaBurnham, K. P. & Anderson, D. R. Model selection and multimodel inference: a practical information-theoretic approach. (Springer Science & Business Media, 2003).\n\nPython for scientific computing. T E Oliphant, Comput. Sci. Eng. 9Oliphant, T. E. Python for scientific computing. Comput. Sci. Eng. 9, 10-20 (2007).\n", "annotations": {"author": "[{\"end\":164,\"start\":80},{\"end\":258,\"start\":165},{\"end\":345,\"start\":259},{\"end\":431,\"start\":346},{\"end\":607,\"start\":432}]", "publisher": null, "author_last_name": "[{\"end\":93,\"start\":87},{\"end\":178,\"start\":174},{\"end\":274,\"start\":270},{\"end\":360,\"start\":352},{\"end\":450,\"start\":443}]", "author_first_name": "[{\"end\":84,\"start\":80},{\"end\":86,\"start\":85},{\"end\":173,\"start\":165},{\"end\":267,\"start\":259},{\"end\":269,\"start\":268},{\"end\":351,\"start\":346},{\"end\":440,\"start\":432},{\"end\":442,\"start\":441}]", "author_affiliation": "[{\"end\":163,\"start\":95},{\"end\":257,\"start\":180},{\"end\":344,\"start\":276},{\"end\":430,\"start\":362},{\"end\":537,\"start\":469},{\"end\":606,\"start\":539}]", "title": "[{\"end\":77,\"start\":1},{\"end\":684,\"start\":608}]", "venue": null, "abstract": "[{\"end\":1802,\"start\":726}]", "bib_ref": "[{\"attributes\":{\"ref_id\":\"b0\"},\"end\":1948,\"start\":1947},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":2139,\"start\":2136},{\"attributes\":{\"ref_id\":\"b2\"},\"end\":2142,\"start\":2139},{\"attributes\":{\"ref_id\":\"b3\"},\"end\":2145,\"start\":2142},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":2148,\"start\":2145},{\"attributes\":{\"ref_id\":\"b5\"},\"end\":2151,\"start\":2148},{\"attributes\":{\"ref_id\":\"b6\"},\"end\":2154,\"start\":2151},{\"attributes\":{\"ref_id\":\"b7\"},\"end\":2635,\"start\":2632},{\"attributes\":{\"ref_id\":\"b8\"},\"end\":2638,\"start\":2635},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":2642,\"start\":2638},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":2646,\"start\":2642},{\"attributes\":{\"ref_id\":\"b11\"},\"end\":2650,\"start\":2646},{\"attributes\":{\"ref_id\":\"b12\"},\"end\":3145,\"start\":3141},{\"attributes\":{\"ref_id\":\"b13\"},\"end\":3149,\"start\":3145},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":3153,\"start\":3149},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":3326,\"start\":3323},{\"attributes\":{\"ref_id\":\"b16\"},\"end\":3328,\"start\":3326},{\"attributes\":{\"ref_id\":\"b17\"},\"end\":3581,\"start\":3579},{\"attributes\":{\"ref_id\":\"b18\"},\"end\":3912,\"start\":3910},{\"end\":4367,\"start\":4356},{\"attributes\":{\"ref_id\":\"b23\"},\"end\":4510,\"start\":4508},{\"attributes\":{\"ref_id\":\"b24\"},\"end\":4682,\"start\":4680},{\"attributes\":{\"ref_id\":\"b26\"},\"end\":5636,\"start\":5634},{\"attributes\":{\"ref_id\":\"b32\"},\"end\":17193,\"start\":17191},{\"attributes\":{\"ref_id\":\"b11\"},\"end\":17247,\"start\":17245},{\"attributes\":{\"ref_id\":\"b33\"},\"end\":18064,\"start\":18062},{\"attributes\":{\"ref_id\":\"b35\"},\"end\":19073,\"start\":19069},{\"attributes\":{\"ref_id\":\"b36\"},\"end\":19077,\"start\":19073},{\"attributes\":{\"ref_id\":\"b37\"},\"end\":19081,\"start\":19077},{\"attributes\":{\"ref_id\":\"b11\"},\"end\":19400,\"start\":19397},{\"attributes\":{\"ref_id\":\"b33\"},\"end\":19402,\"start\":19400},{\"attributes\":{\"ref_id\":\"b38\"},\"end\":20399,\"start\":20397},{\"attributes\":{\"ref_id\":\"b7\"},\"end\":20903,\"start\":20901},{\"attributes\":{\"ref_id\":\"b39\"},\"end\":20905,\"start\":20903},{\"attributes\":{\"ref_id\":\"b38\"},\"end\":21964,\"start\":21962},{\"attributes\":{\"ref_id\":\"b40\"},\"end\":23122,\"start\":23118},{\"attributes\":{\"ref_id\":\"b41\"},\"end\":23126,\"start\":23122},{\"attributes\":{\"ref_id\":\"b42\"},\"end\":23130,\"start\":23126},{\"attributes\":{\"ref_id\":\"b43\"},\"end\":23201,\"start\":23199},{\"attributes\":{\"ref_id\":\"b41\"},\"end\":23404,\"start\":23402},{\"attributes\":{\"ref_id\":\"b44\"},\"end\":24461,\"start\":24458},{\"attributes\":{\"ref_id\":\"b45\"},\"end\":24463,\"start\":24461},{\"attributes\":{\"ref_id\":\"b46\"},\"end\":24673,\"start\":24671},{\"attributes\":{\"ref_id\":\"b47\"},\"end\":24838,\"start\":24836},{\"attributes\":{\"ref_id\":\"b40\"},\"end\":25443,\"start\":25441},{\"attributes\":{\"ref_id\":\"b40\"},\"end\":25809,\"start\":25805},{\"attributes\":{\"ref_id\":\"b41\"},\"end\":25813,\"start\":25809},{\"attributes\":{\"ref_id\":\"b42\"},\"end\":25817,\"start\":25813},{\"attributes\":{\"ref_id\":\"b48\"},\"end\":29223,\"start\":29219},{\"attributes\":{\"ref_id\":\"b49\"},\"end\":29227,\"start\":29223},{\"attributes\":{\"ref_id\":\"b50\"},\"end\":29231,\"start\":29227},{\"attributes\":{\"ref_id\":\"b51\"},\"end\":30077,\"start\":30075},{\"attributes\":{\"ref_id\":\"b25\"},\"end\":31571,\"start\":31569},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":32139,\"start\":32137},{\"attributes\":{\"ref_id\":\"b34\"},\"end\":32142,\"start\":32139},{\"attributes\":{\"ref_id\":\"b53\"},\"end\":32145,\"start\":32142},{\"attributes\":{\"ref_id\":\"b54\"},\"end\":32147,\"start\":32145},{\"attributes\":{\"ref_id\":\"b56\"},\"end\":32864,\"start\":32861},{\"attributes\":{\"ref_id\":\"b57\"},\"end\":32866,\"start\":32864},{\"attributes\":{\"ref_id\":\"b58\"},\"end\":33295,\"start\":33293},{\"attributes\":{\"ref_id\":\"b59\"},\"end\":33660,\"start\":33657},{\"attributes\":{\"ref_id\":\"b60\"},\"end\":33662,\"start\":33660},{\"attributes\":{\"ref_id\":\"b61\"},\"end\":35204,\"start\":35202},{\"attributes\":{\"ref_id\":\"b62\"},\"end\":36085,\"start\":36083},{\"attributes\":{\"ref_id\":\"b65\"},\"end\":40412,\"start\":40410},{\"attributes\":{\"ref_id\":\"b63\"},\"end\":41019,\"start\":41017},{\"attributes\":{\"ref_id\":\"b63\"},\"end\":41171,\"start\":41169},{\"attributes\":{\"ref_id\":\"b66\"},\"end\":41517,\"start\":41515},{\"attributes\":{\"ref_id\":\"b25\"},\"end\":43708,\"start\":43706}]", "figure": "[{\"attributes\":{\"id\":\"fig_0\"},\"end\":44798,\"start\":43959},{\"attributes\":{\"id\":\"fig_1\"},\"end\":46095,\"start\":44799},{\"attributes\":{\"id\":\"fig_2\"},\"end\":47266,\"start\":46096},{\"attributes\":{\"id\":\"fig_3\"},\"end\":48541,\"start\":47267},{\"attributes\":{\"id\":\"tab_0\",\"type\":\"table\"},\"end\":48583,\"start\":48542}]", "paragraph": "[{\"end\":3155,\"start\":1804},{\"end\":4090,\"start\":3157},{\"end\":4684,\"start\":4092},{\"end\":5381,\"start\":4686},{\"end\":6241,\"start\":5393},{\"end\":7351,\"start\":6243},{\"end\":8299,\"start\":7353},{\"end\":8376,\"start\":8301},{\"end\":8798,\"start\":8625},{\"end\":9417,\"start\":8800},{\"end\":9711,\"start\":9423},{\"end\":10053,\"start\":9717},{\"end\":10222,\"start\":10059},{\"end\":10943,\"start\":10228},{\"end\":11345,\"start\":10945},{\"end\":13034,\"start\":11347},{\"end\":13456,\"start\":13036},{\"end\":14195,\"start\":13458},{\"end\":14901,\"start\":14197},{\"end\":15551,\"start\":14903},{\"end\":16207,\"start\":15553},{\"end\":17249,\"start\":16209},{\"end\":18226,\"start\":17251},{\"end\":19535,\"start\":18228},{\"end\":20401,\"start\":19537},{\"end\":21256,\"start\":20403},{\"end\":21966,\"start\":21258},{\"end\":22360,\"start\":21968},{\"end\":23671,\"start\":22362},{\"end\":24840,\"start\":23673},{\"end\":25558,\"start\":24842},{\"end\":26036,\"start\":25560},{\"end\":26708,\"start\":26038},{\"end\":26863,\"start\":26710},{\"end\":27172,\"start\":26865},{\"end\":27623,\"start\":27187},{\"end\":28988,\"start\":27625},{\"end\":29565,\"start\":28990},{\"end\":30079,\"start\":29567},{\"end\":30568,\"start\":30081},{\"end\":31208,\"start\":30570},{\"end\":31821,\"start\":31220},{\"end\":32452,\"start\":31823},{\"end\":33387,\"start\":32454},{\"end\":35206,\"start\":33389},{\"end\":35800,\"start\":35208},{\"end\":36247,\"start\":35802},{\"end\":36982,\"start\":36413},{\"end\":38810,\"start\":36984},{\"end\":39103,\"start\":38839},{\"end\":39322,\"start\":39169},{\"end\":39374,\"start\":39335},{\"end\":39702,\"start\":39435},{\"end\":39823,\"start\":39704},{\"end\":40414,\"start\":39825},{\"end\":41315,\"start\":40416},{\"end\":41880,\"start\":41317},{\"end\":42848,\"start\":41882},{\"end\":43233,\"start\":42850},{\"end\":43370,\"start\":43235},{\"end\":43958,\"start\":43392}]", "formula": "[{\"attributes\":{\"id\":\"formula_0\"},\"end\":8624,\"start\":8377},{\"attributes\":{\"id\":\"formula_1\"},\"end\":36412,\"start\":36248},{\"attributes\":{\"id\":\"formula_2\"},\"end\":38838,\"start\":38811},{\"attributes\":{\"id\":\"formula_3\"},\"end\":39168,\"start\":39104},{\"attributes\":{\"id\":\"formula_4\"},\"end\":39334,\"start\":39323},{\"attributes\":{\"id\":\"formula_5\"},\"end\":39434,\"start\":39375}]", "table_ref": "[{\"end\":6742,\"start\":6735}]", "section_header": "[{\"end\":5391,\"start\":5384},{\"end\":9421,\"start\":9420},{\"end\":9715,\"start\":9714},{\"end\":10057,\"start\":10056},{\"end\":10226,\"start\":10225},{\"end\":27185,\"start\":27175},{\"end\":31218,\"start\":31211},{\"end\":43390,\"start\":43373},{\"end\":44806,\"start\":44800},{\"end\":46103,\"start\":46097},{\"end\":47274,\"start\":47268},{\"end\":48568,\"start\":48543}]", "table": null, "figure_caption": "[{\"end\":44798,\"start\":43961},{\"end\":46095,\"start\":44808},{\"end\":47266,\"start\":46105},{\"end\":48541,\"start\":47276}]", "figure_ref": "[{\"end\":2631,\"start\":2611},{\"end\":8027,\"start\":8018},{\"end\":9416,\"start\":9407},{\"end\":10052,\"start\":10043},{\"end\":10942,\"start\":10933},{\"end\":11344,\"start\":11335},{\"end\":11943,\"start\":11937},{\"end\":13291,\"start\":13270},{\"end\":13374,\"start\":13352},{\"attributes\":{\"ref_id\":\"fig_2\"},\"end\":13626,\"start\":13606},{\"end\":14390,\"start\":14381},{\"end\":14739,\"start\":14730},{\"attributes\":{\"ref_id\":\"fig_1\"},\"end\":17083,\"start\":17074},{\"attributes\":{\"ref_id\":\"fig_1\"},\"end\":17776,\"start\":17767},{\"attributes\":{\"ref_id\":\"fig_1\"},\"end\":18407,\"start\":18398},{\"attributes\":{\"ref_id\":\"fig_1\"},\"end\":18627,\"start\":18618},{\"attributes\":{\"ref_id\":\"fig_2\"},\"end\":19890,\"start\":19860},{\"attributes\":{\"ref_id\":\"fig_2\"},\"end\":20272,\"start\":20263},{\"attributes\":{\"ref_id\":\"fig_2\"},\"end\":20570,\"start\":20561},{\"attributes\":{\"ref_id\":\"fig_2\"},\"end\":21487,\"start\":21478},{\"attributes\":{\"ref_id\":\"fig_2\"},\"end\":21808,\"start\":21799},{\"attributes\":{\"ref_id\":\"fig_3\"},\"end\":22644,\"start\":22599},{\"attributes\":{\"ref_id\":\"fig_3\"},\"end\":22967,\"start\":22958},{\"attributes\":{\"ref_id\":\"fig_3\"},\"end\":23858,\"start\":23849},{\"attributes\":{\"ref_id\":\"fig_3\"},\"end\":24986,\"start\":24977},{\"attributes\":{\"ref_id\":\"fig_3\"},\"end\":25232,\"start\":25223},{\"end\":27399,\"start\":27390}]", "bib_author_first_name": "[{\"end\":50815,\"start\":50814},{\"end\":50817,\"start\":50816},{\"end\":51131,\"start\":51130},{\"end\":51133,\"start\":51132},{\"end\":51424,\"start\":51423},{\"end\":51440,\"start\":51439},{\"end\":51442,\"start\":51441},{\"end\":51451,\"start\":51450},{\"end\":51765,\"start\":51764},{\"end\":51767,\"start\":51766},{\"end\":51996,\"start\":51995},{\"end\":52257,\"start\":52256},{\"end\":52259,\"start\":52258},{\"end\":52648,\"start\":52647},{\"end\":52650,\"start\":52649},{\"end\":52957,\"start\":52956},{\"end\":53320,\"start\":53319},{\"end\":53681,\"start\":53680},{\"end\":53683,\"start\":53682},{\"end\":54004,\"start\":54003},{\"end\":54006,\"start\":54005},{\"end\":54349,\"start\":54348},{\"end\":54609,\"start\":54608},{\"end\":54611,\"start\":54610},{\"end\":54794,\"start\":54793},{\"end\":55002,\"start\":55001},{\"end\":55004,\"start\":55003},{\"end\":55015,\"start\":55014},{\"end\":55017,\"start\":55016},{\"end\":55028,\"start\":55027},{\"end\":55030,\"start\":55029},{\"end\":55040,\"start\":55039},{\"end\":55042,\"start\":55041},{\"end\":55054,\"start\":55053},{\"end\":55056,\"start\":55055},{\"end\":55243,\"start\":55242},{\"end\":55245,\"start\":55244},{\"end\":55522,\"start\":55521},{\"end\":55524,\"start\":55523},{\"end\":55540,\"start\":55539},{\"end\":55542,\"start\":55541},{\"end\":55550,\"start\":55549},{\"end\":55552,\"start\":55551},{\"end\":55783,\"start\":55782},{\"end\":55794,\"start\":55793},{\"end\":55796,\"start\":55795},{\"end\":55804,\"start\":55803},{\"end\":55806,\"start\":55805},{\"end\":55814,\"start\":55813},{\"end\":55816,\"start\":55815},{\"end\":56101,\"start\":56100},{\"end\":56103,\"start\":56102},{\"end\":56396,\"start\":56395},{\"end\":56398,\"start\":56397},{\"end\":56795,\"start\":56794},{\"end\":57158,\"start\":57157},{\"end\":57503,\"start\":57502},{\"end\":57833,\"start\":57832},{\"end\":57837,\"start\":57834},{\"end\":57848,\"start\":57847},{\"end\":57850,\"start\":57849},{\"end\":57862,\"start\":57861},{\"end\":57864,\"start\":57863},{\"end\":57876,\"start\":57875},{\"end\":58171,\"start\":58170},{\"end\":58173,\"start\":58172},{\"end\":58181,\"start\":58180},{\"end\":58183,\"start\":58182},{\"end\":58399,\"start\":58398},{\"end\":58401,\"start\":58400},{\"end\":58725,\"start\":58724},{\"end\":58727,\"start\":58726},{\"end\":59108,\"start\":59107},{\"end\":59117,\"start\":59116},{\"end\":59119,\"start\":59118},{\"end\":59403,\"start\":59402},{\"end\":59405,\"start\":59404},{\"end\":59413,\"start\":59412},{\"end\":59423,\"start\":59422},{\"end\":59425,\"start\":59424},{\"end\":59675,\"start\":59674},{\"end\":59932,\"start\":59931},{\"end\":59944,\"start\":59943},{\"end\":59952,\"start\":59951},{\"end\":59965,\"start\":59964},{\"end\":59978,\"start\":59977},{\"end\":60224,\"start\":60223},{\"end\":60226,\"start\":60225},{\"end\":60236,\"start\":60235},{\"end\":60559,\"start\":60558},{\"end\":60570,\"start\":60569},{\"end\":60869,\"start\":60868},{\"end\":61129,\"start\":61128},{\"end\":61131,\"start\":61130},{\"end\":61433,\"start\":61432},{\"end\":61706,\"start\":61705},{\"end\":61708,\"start\":61707},{\"end\":61718,\"start\":61717},{\"end\":61720,\"start\":61719},{\"end\":61732,\"start\":61731},{\"end\":61734,\"start\":61733},{\"end\":61743,\"start\":61742},{\"end\":61745,\"start\":61744},{\"end\":62112,\"start\":62111},{\"end\":62440,\"start\":62439},{\"end\":62455,\"start\":62454},{\"end\":62465,\"start\":62464},{\"end\":62467,\"start\":62466},{\"end\":62476,\"start\":62475},{\"end\":62478,\"start\":62477},{\"end\":62489,\"start\":62488},{\"end\":62491,\"start\":62490},{\"end\":62834,\"start\":62833},{\"end\":63151,\"start\":63150},{\"end\":63436,\"start\":63435},{\"end\":63730,\"start\":63729},{\"end\":63744,\"start\":63743},{\"end\":63754,\"start\":63753},{\"end\":63756,\"start\":63755},{\"end\":64002,\"start\":64001},{\"end\":64004,\"start\":64003},{\"end\":64311,\"start\":64310},{\"end\":64313,\"start\":64312},{\"end\":64654,\"start\":64653},{\"end\":64656,\"start\":64655},{\"end\":64663,\"start\":64662},{\"end\":64679,\"start\":64678},{\"end\":64681,\"start\":64680},{\"end\":65020,\"start\":65019},{\"end\":65348,\"start\":65347},{\"end\":65619,\"start\":65618},{\"end\":65621,\"start\":65620},{\"end\":65632,\"start\":65631},{\"end\":65641,\"start\":65640},{\"end\":66161,\"start\":66160},{\"end\":66170,\"start\":66169},{\"end\":66399,\"start\":66398},{\"end\":66410,\"start\":66409},{\"end\":66609,\"start\":66608},{\"end\":66617,\"start\":66616},{\"end\":66623,\"start\":66622},{\"end\":66843,\"start\":66842},{\"end\":67049,\"start\":67048},{\"end\":67344,\"start\":67343},{\"end\":67346,\"start\":67345},{\"end\":67857,\"start\":67856},{\"end\":67859,\"start\":67858},{\"end\":67870,\"start\":67869},{\"end\":67879,\"start\":67878},{\"end\":67898,\"start\":67897},{\"end\":67900,\"start\":67899},{\"end\":68180,\"start\":68179},{\"end\":68195,\"start\":68194},{\"end\":68449,\"start\":68448},{\"end\":68451,\"start\":68450},{\"end\":68698,\"start\":68697},{\"end\":68716,\"start\":68715},{\"end\":68718,\"start\":68717},{\"end\":68994,\"start\":68993},{\"end\":69012,\"start\":69011},{\"end\":69022,\"start\":69021},{\"end\":69302,\"start\":69301},{\"end\":69313,\"start\":69312},{\"end\":69315,\"start\":69314},{\"end\":69325,\"start\":69324},{\"end\":69327,\"start\":69326},{\"end\":69338,\"start\":69337},{\"end\":69340,\"start\":69339},{\"end\":69620,\"start\":69619},{\"end\":69633,\"start\":69632},{\"end\":69635,\"start\":69634},{\"end\":69862,\"start\":69861},{\"end\":70068,\"start\":70067},{\"end\":70079,\"start\":70078},{\"end\":70432,\"start\":70431},{\"end\":70434,\"start\":70433},{\"end\":70445,\"start\":70444},{\"end\":70447,\"start\":70446},{\"end\":70688,\"start\":70687},{\"end\":70690,\"start\":70689}]", "bib_author_last_name": "[{\"end\":50830,\"start\":50818},{\"end\":50838,\"start\":50832},{\"end\":51140,\"start\":51134},{\"end\":51437,\"start\":51425},{\"end\":51448,\"start\":51443},{\"end\":51458,\"start\":51452},{\"end\":51773,\"start\":51768},{\"end\":52010,\"start\":51997},{\"end\":52266,\"start\":52260},{\"end\":52656,\"start\":52651},{\"end\":52963,\"start\":52958},{\"end\":53325,\"start\":53321},{\"end\":53694,\"start\":53684},{\"end\":54012,\"start\":54007},{\"end\":54355,\"start\":54350},{\"end\":54614,\"start\":54612},{\"end\":54797,\"start\":54795},{\"end\":55012,\"start\":55005},{\"end\":55025,\"start\":55018},{\"end\":55037,\"start\":55031},{\"end\":55051,\"start\":55043},{\"end\":55064,\"start\":55057},{\"end\":55253,\"start\":55246},{\"end\":55537,\"start\":55525},{\"end\":55547,\"start\":55543},{\"end\":55560,\"start\":55553},{\"end\":55791,\"start\":55784},{\"end\":55801,\"start\":55797},{\"end\":55811,\"start\":55807},{\"end\":55824,\"start\":55817},{\"end\":56108,\"start\":56104},{\"end\":56403,\"start\":56399},{\"end\":56800,\"start\":56796},{\"end\":57163,\"start\":57159},{\"end\":57508,\"start\":57504},{\"end\":57845,\"start\":57838},{\"end\":57859,\"start\":57851},{\"end\":57873,\"start\":57865},{\"end\":57889,\"start\":57877},{\"end\":58178,\"start\":58174},{\"end\":58191,\"start\":58184},{\"end\":58408,\"start\":58402},{\"end\":58734,\"start\":58728},{\"end\":59114,\"start\":59109},{\"end\":59127,\"start\":59120},{\"end\":59410,\"start\":59406},{\"end\":59420,\"start\":59414},{\"end\":59433,\"start\":59426},{\"end\":59681,\"start\":59676},{\"end\":59941,\"start\":59933},{\"end\":59949,\"start\":59945},{\"end\":59962,\"start\":59953},{\"end\":59975,\"start\":59966},{\"end\":59985,\"start\":59979},{\"end\":60233,\"start\":60227},{\"end\":60247,\"start\":60237},{\"end\":60567,\"start\":60560},{\"end\":60576,\"start\":60571},{\"end\":60875,\"start\":60870},{\"end\":61138,\"start\":61132},{\"end\":61439,\"start\":61434},{\"end\":61715,\"start\":61709},{\"end\":61729,\"start\":61721},{\"end\":61740,\"start\":61735},{\"end\":61752,\"start\":61746},{\"end\":62118,\"start\":62113},{\"end\":62452,\"start\":62441},{\"end\":62462,\"start\":62456},{\"end\":62473,\"start\":62468},{\"end\":62486,\"start\":62479},{\"end\":62496,\"start\":62492},{\"end\":62849,\"start\":62835},{\"end\":63156,\"start\":63152},{\"end\":63445,\"start\":63437},{\"end\":63741,\"start\":63731},{\"end\":63751,\"start\":63745},{\"end\":63761,\"start\":63757},{\"end\":64012,\"start\":64005},{\"end\":64323,\"start\":64314},{\"end\":64660,\"start\":64657},{\"end\":64676,\"start\":64664},{\"end\":64686,\"start\":64682},{\"end\":65027,\"start\":65021},{\"end\":65357,\"start\":65349},{\"end\":65629,\"start\":65622},{\"end\":65638,\"start\":65633},{\"end\":65650,\"start\":65642},{\"end\":66167,\"start\":66162},{\"end\":66178,\"start\":66171},{\"end\":66407,\"start\":66400},{\"end\":66414,\"start\":66411},{\"end\":66614,\"start\":66610},{\"end\":66620,\"start\":66618},{\"end\":66634,\"start\":66624},{\"end\":66852,\"start\":66844},{\"end\":67054,\"start\":67050},{\"end\":67353,\"start\":67347},{\"end\":67867,\"start\":67860},{\"end\":67876,\"start\":67871},{\"end\":67895,\"start\":67880},{\"end\":67908,\"start\":67901},{\"end\":68192,\"start\":68181},{\"end\":68202,\"start\":68196},{\"end\":68457,\"start\":68452},{\"end\":68713,\"start\":68699},{\"end\":68726,\"start\":68719},{\"end\":69009,\"start\":68995},{\"end\":69019,\"start\":69013},{\"end\":69032,\"start\":69023},{\"end\":69310,\"start\":69303},{\"end\":69322,\"start\":69316},{\"end\":69335,\"start\":69328},{\"end\":69347,\"start\":69341},{\"end\":69630,\"start\":69621},{\"end\":69645,\"start\":69636},{\"end\":69872,\"start\":69863},{\"end\":70076,\"start\":70069},{\"end\":70088,\"start\":70080},{\"end\":70442,\"start\":70435},{\"end\":70456,\"start\":70448},{\"end\":70699,\"start\":70691}]", "bib_entry": "[{\"attributes\":{\"id\":\"b0\"},\"end\":50990,\"start\":50812},{\"attributes\":{\"id\":\"b1\",\"matched_paper_id\":52984473},\"end\":51347,\"start\":50992},{\"attributes\":{\"doi\":\"10.1038/s41576-019-0108-4\",\"id\":\"b2\",\"matched_paper_id\":81980772},\"end\":51706,\"start\":51349},{\"attributes\":{\"id\":\"b3\",\"matched_paper_id\":4756554},\"end\":51893,\"start\":51708},{\"attributes\":{\"id\":\"b4\"},\"end\":52164,\"start\":51895},{\"attributes\":{\"id\":\"b5\",\"matched_paper_id\":189927282},\"end\":52526,\"start\":52166},{\"attributes\":{\"id\":\"b6\",\"matched_paper_id\":4536692},\"end\":52851,\"start\":52528},{\"attributes\":{\"id\":\"b7\",\"matched_paper_id\":6049085},\"end\":53142,\"start\":52853},{\"attributes\":{\"id\":\"b8\",\"matched_paper_id\":205347572},\"end\":53565,\"start\":53144},{\"attributes\":{\"id\":\"b9\",\"matched_paper_id\":4986884},\"end\":53879,\"start\":53567},{\"attributes\":{\"id\":\"b10\",\"matched_paper_id\":51926736},\"end\":54209,\"start\":53881},{\"attributes\":{\"id\":\"b11\",\"matched_paper_id\":24312220},\"end\":54564,\"start\":54211},{\"attributes\":{\"id\":\"b12\",\"matched_paper_id\":49210890},\"end\":54711,\"start\":54566},{\"attributes\":{\"id\":\"b13\",\"matched_paper_id\":3783024},\"end\":54941,\"start\":54713},{\"attributes\":{\"id\":\"b14\",\"matched_paper_id\":47005580},\"end\":55240,\"start\":54943},{\"attributes\":{\"id\":\"b15\"},\"end\":55457,\"start\":55242},{\"attributes\":{\"id\":\"b16\",\"matched_paper_id\":15124359},\"end\":55703,\"start\":55459},{\"attributes\":{\"id\":\"b17\",\"matched_paper_id\":18785106},\"end\":56013,\"start\":55705},{\"attributes\":{\"id\":\"b18\",\"matched_paper_id\":206570746},\"end\":56250,\"start\":56015},{\"attributes\":{\"id\":\"b19\",\"matched_paper_id\":9002807},\"end\":56649,\"start\":56252},{\"attributes\":{\"id\":\"b20\",\"matched_paper_id\":23344362},\"end\":57043,\"start\":56651},{\"attributes\":{\"id\":\"b21\",\"matched_paper_id\":52276176},\"end\":57339,\"start\":57045},{\"attributes\":{\"id\":\"b22\",\"matched_paper_id\":47020494},\"end\":57737,\"start\":57341},{\"attributes\":{\"id\":\"b23\",\"matched_paper_id\":18427093},\"end\":58125,\"start\":57739},{\"attributes\":{\"id\":\"b24\",\"matched_paper_id\":39956678},\"end\":58327,\"start\":58127},{\"attributes\":{\"id\":\"b25\",\"matched_paper_id\":14830574},\"end\":58561,\"start\":58329},{\"attributes\":{\"id\":\"b26\",\"matched_paper_id\":3630781},\"end\":58968,\"start\":58563},{\"attributes\":{\"id\":\"b27\",\"matched_paper_id\":40496290},\"end\":59368,\"start\":58970},{\"attributes\":{\"id\":\"b28\",\"matched_paper_id\":205274549},\"end\":59562,\"start\":59370},{\"attributes\":{\"id\":\"b29\",\"matched_paper_id\":6207727},\"end\":59871,\"start\":59564},{\"attributes\":{\"id\":\"b30\",\"matched_paper_id\":53503747},\"end\":60172,\"start\":59873},{\"attributes\":{\"id\":\"b31\",\"matched_paper_id\":2013990},\"end\":60409,\"start\":60174},{\"attributes\":{\"id\":\"b32\",\"matched_paper_id\":8579133},\"end\":60788,\"start\":60411},{\"attributes\":{\"id\":\"b33\",\"matched_paper_id\":15839323},\"end\":61011,\"start\":60790},{\"attributes\":{\"id\":\"b34\",\"matched_paper_id\":8786327},\"end\":61323,\"start\":61013},{\"attributes\":{\"id\":\"b35\",\"matched_paper_id\":4587599},\"end\":61618,\"start\":61325},{\"attributes\":{\"id\":\"b36\",\"matched_paper_id\":22192298},\"end\":61983,\"start\":61620},{\"attributes\":{\"id\":\"b37\",\"matched_paper_id\":11081012},\"end\":62328,\"start\":61985},{\"attributes\":{\"id\":\"b38\",\"matched_paper_id\":342483},\"end\":62723,\"start\":62330},{\"attributes\":{\"id\":\"b39\",\"matched_paper_id\":25905653},\"end\":63068,\"start\":62725},{\"attributes\":{\"id\":\"b40\",\"matched_paper_id\":58632452},\"end\":63337,\"start\":63070},{\"attributes\":{\"id\":\"b41\",\"matched_paper_id\":4854318},\"end\":63643,\"start\":63339},{\"attributes\":{\"id\":\"b42\",\"matched_paper_id\":1137352},\"end\":63934,\"start\":63645},{\"attributes\":{\"id\":\"b43\",\"matched_paper_id\":293764},\"end\":64181,\"start\":63936},{\"attributes\":{\"id\":\"b44\",\"matched_paper_id\":24693771},\"end\":64531,\"start\":64183},{\"attributes\":{\"id\":\"b45\",\"matched_paper_id\":32518879},\"end\":64904,\"start\":64533},{\"attributes\":{\"id\":\"b46\",\"matched_paper_id\":14359871},\"end\":65240,\"start\":64906},{\"attributes\":{\"id\":\"b47\",\"matched_paper_id\":3449563},\"end\":65546,\"start\":65242},{\"attributes\":{\"id\":\"b48\",\"matched_paper_id\":13029170},\"end\":66073,\"start\":65548},{\"attributes\":{\"id\":\"b49\",\"matched_paper_id\":52965836},\"end\":66337,\"start\":66075},{\"attributes\":{\"id\":\"b50\",\"matched_paper_id\":67773377},\"end\":66541,\"start\":66339},{\"attributes\":{\"id\":\"b51\",\"matched_paper_id\":2356691},\"end\":66792,\"start\":66543},{\"attributes\":{\"id\":\"b52\",\"matched_paper_id\":5134479},\"end\":66957,\"start\":66794},{\"attributes\":{\"id\":\"b53\",\"matched_paper_id\":4959764},\"end\":67206,\"start\":66959},{\"attributes\":{\"id\":\"b54\",\"matched_paper_id\":3004029},\"end\":67574,\"start\":67208},{\"attributes\":{\"id\":\"b55\",\"matched_paper_id\":5163716},\"end\":67758,\"start\":67576},{\"attributes\":{\"id\":\"b56\",\"matched_paper_id\":21774972},\"end\":68124,\"start\":67760},{\"attributes\":{\"id\":\"b57\",\"matched_paper_id\":12175968},\"end\":68345,\"start\":68126},{\"attributes\":{\"id\":\"b58\",\"matched_paper_id\":11099659},\"end\":68632,\"start\":68347},{\"attributes\":{\"id\":\"b59\",\"matched_paper_id\":26538668},\"end\":68882,\"start\":68634},{\"attributes\":{\"id\":\"b60\",\"matched_paper_id\":40654},\"end\":69232,\"start\":68884},{\"attributes\":{\"id\":\"b61\",\"matched_paper_id\":14189026},\"end\":69523,\"start\":69234},{\"attributes\":{\"id\":\"b62\",\"matched_paper_id\":23616291},\"end\":69817,\"start\":69525},{\"attributes\":{\"id\":\"b63\",\"matched_paper_id\":10659969},\"end\":70002,\"start\":69819},{\"attributes\":{\"id\":\"b64\",\"matched_paper_id\":62426288},\"end\":70343,\"start\":70004},{\"attributes\":{\"id\":\"b65\"},\"end\":70652,\"start\":70345},{\"attributes\":{\"id\":\"b66\",\"matched_paper_id\":206457124},\"end\":70803,\"start\":70654}]", "bib_title": "[{\"end\":51128,\"start\":50992},{\"end\":51421,\"start\":51349},{\"end\":51762,\"start\":51708},{\"end\":52254,\"start\":52166},{\"end\":52645,\"start\":52528},{\"end\":52954,\"start\":52853},{\"end\":53317,\"start\":53144},{\"end\":53678,\"start\":53567},{\"end\":54001,\"start\":53881},{\"end\":54346,\"start\":54211},{\"end\":54606,\"start\":54566},{\"end\":54791,\"start\":54713},{\"end\":54999,\"start\":54943},{\"end\":55519,\"start\":55459},{\"end\":55780,\"start\":55705},{\"end\":56098,\"start\":56015},{\"end\":56393,\"start\":56252},{\"end\":56792,\"start\":56651},{\"end\":57155,\"start\":57045},{\"end\":57500,\"start\":57341},{\"end\":57830,\"start\":57739},{\"end\":58168,\"start\":58127},{\"end\":58396,\"start\":58329},{\"end\":58722,\"start\":58563},{\"end\":59105,\"start\":58970},{\"end\":59400,\"start\":59370},{\"end\":59672,\"start\":59564},{\"end\":59929,\"start\":59873},{\"end\":60221,\"start\":60174},{\"end\":60556,\"start\":60411},{\"end\":60866,\"start\":60790},{\"end\":61126,\"start\":61013},{\"end\":61430,\"start\":61325},{\"end\":61703,\"start\":61620},{\"end\":62109,\"start\":61985},{\"end\":62437,\"start\":62330},{\"end\":62831,\"start\":62725},{\"end\":63148,\"start\":63070},{\"end\":63433,\"start\":63339},{\"end\":63727,\"start\":63645},{\"end\":63999,\"start\":63936},{\"end\":64308,\"start\":64183},{\"end\":64651,\"start\":64533},{\"end\":65017,\"start\":64906},{\"end\":65345,\"start\":65242},{\"end\":65616,\"start\":65548},{\"end\":66158,\"start\":66075},{\"end\":66396,\"start\":66339},{\"end\":66606,\"start\":66543},{\"end\":66840,\"start\":66794},{\"end\":67046,\"start\":66959},{\"end\":67341,\"start\":67208},{\"end\":67620,\"start\":67576},{\"end\":67854,\"start\":67760},{\"end\":68177,\"start\":68126},{\"end\":68446,\"start\":68347},{\"end\":68695,\"start\":68634},{\"end\":68991,\"start\":68884},{\"end\":69299,\"start\":69234},{\"end\":69617,\"start\":69525},{\"end\":69859,\"start\":69819},{\"end\":70065,\"start\":70004},{\"end\":70685,\"start\":70654}]", "bib_author": "[{\"end\":50832,\"start\":50814},{\"end\":50840,\"start\":50832},{\"end\":51142,\"start\":51130},{\"end\":51439,\"start\":51423},{\"end\":51450,\"start\":51439},{\"end\":51460,\"start\":51450},{\"end\":51775,\"start\":51764},{\"end\":52012,\"start\":51995},{\"end\":52268,\"start\":52256},{\"end\":52658,\"start\":52647},{\"end\":52965,\"start\":52956},{\"end\":53327,\"start\":53319},{\"end\":53696,\"start\":53680},{\"end\":54014,\"start\":54003},{\"end\":54357,\"start\":54348},{\"end\":54616,\"start\":54608},{\"end\":54799,\"start\":54793},{\"end\":55014,\"start\":55001},{\"end\":55027,\"start\":55014},{\"end\":55039,\"start\":55027},{\"end\":55053,\"start\":55039},{\"end\":55066,\"start\":55053},{\"end\":55255,\"start\":55242},{\"end\":55539,\"start\":55521},{\"end\":55549,\"start\":55539},{\"end\":55562,\"start\":55549},{\"end\":55793,\"start\":55782},{\"end\":55803,\"start\":55793},{\"end\":55813,\"start\":55803},{\"end\":55826,\"start\":55813},{\"end\":56110,\"start\":56100},{\"end\":56405,\"start\":56395},{\"end\":56802,\"start\":56794},{\"end\":57165,\"start\":57157},{\"end\":57510,\"start\":57502},{\"end\":57847,\"start\":57832},{\"end\":57861,\"start\":57847},{\"end\":57875,\"start\":57861},{\"end\":57891,\"start\":57875},{\"end\":58180,\"start\":58170},{\"end\":58193,\"start\":58180},{\"end\":58410,\"start\":58398},{\"end\":58736,\"start\":58724},{\"end\":59116,\"start\":59107},{\"end\":59129,\"start\":59116},{\"end\":59412,\"start\":59402},{\"end\":59422,\"start\":59412},{\"end\":59435,\"start\":59422},{\"end\":59683,\"start\":59674},{\"end\":59943,\"start\":59931},{\"end\":59951,\"start\":59943},{\"end\":59964,\"start\":59951},{\"end\":59977,\"start\":59964},{\"end\":59987,\"start\":59977},{\"end\":60235,\"start\":60223},{\"end\":60249,\"start\":60235},{\"end\":60569,\"start\":60558},{\"end\":60578,\"start\":60569},{\"end\":60877,\"start\":60868},{\"end\":61140,\"start\":61128},{\"end\":61441,\"start\":61432},{\"end\":61717,\"start\":61705},{\"end\":61731,\"start\":61717},{\"end\":61742,\"start\":61731},{\"end\":61754,\"start\":61742},{\"end\":62120,\"start\":62111},{\"end\":62454,\"start\":62439},{\"end\":62464,\"start\":62454},{\"end\":62475,\"start\":62464},{\"end\":62488,\"start\":62475},{\"end\":62498,\"start\":62488},{\"end\":62851,\"start\":62833},{\"end\":63158,\"start\":63150},{\"end\":63447,\"start\":63435},{\"end\":63743,\"start\":63729},{\"end\":63753,\"start\":63743},{\"end\":63763,\"start\":63753},{\"end\":64014,\"start\":64001},{\"end\":64325,\"start\":64310},{\"end\":64662,\"start\":64653},{\"end\":64678,\"start\":64662},{\"end\":64688,\"start\":64678},{\"end\":65029,\"start\":65019},{\"end\":65359,\"start\":65347},{\"end\":65631,\"start\":65618},{\"end\":65640,\"start\":65631},{\"end\":65652,\"start\":65640},{\"end\":66169,\"start\":66160},{\"end\":66180,\"start\":66169},{\"end\":66409,\"start\":66398},{\"end\":66416,\"start\":66409},{\"end\":66616,\"start\":66608},{\"end\":66622,\"start\":66616},{\"end\":66636,\"start\":66622},{\"end\":66854,\"start\":66842},{\"end\":67056,\"start\":67048},{\"end\":67355,\"start\":67343},{\"end\":67869,\"start\":67856},{\"end\":67878,\"start\":67869},{\"end\":67897,\"start\":67878},{\"end\":67910,\"start\":67897},{\"end\":68194,\"start\":68179},{\"end\":68204,\"start\":68194},{\"end\":68459,\"start\":68448},{\"end\":68715,\"start\":68697},{\"end\":68728,\"start\":68715},{\"end\":69011,\"start\":68993},{\"end\":69021,\"start\":69011},{\"end\":69034,\"start\":69021},{\"end\":69312,\"start\":69301},{\"end\":69324,\"start\":69312},{\"end\":69337,\"start\":69324},{\"end\":69349,\"start\":69337},{\"end\":69632,\"start\":69619},{\"end\":69647,\"start\":69632},{\"end\":69874,\"start\":69861},{\"end\":70078,\"start\":70067},{\"end\":70090,\"start\":70078},{\"end\":70444,\"start\":70431},{\"end\":70458,\"start\":70444},{\"end\":70701,\"start\":70687}]", "bib_venue": "[{\"end\":50866,\"start\":50840},{\"end\":51153,\"start\":51142},{\"end\":51517,\"start\":51502},{\"end\":51783,\"start\":51775},{\"end\":51993,\"start\":51895},{\"end\":52329,\"start\":52310},{\"end\":52672,\"start\":52658},{\"end\":52978,\"start\":52965},{\"end\":53337,\"start\":53327},{\"end\":53706,\"start\":53696},{\"end\":54028,\"start\":54014},{\"end\":54372,\"start\":54357},{\"end\":54620,\"start\":54616},{\"end\":54811,\"start\":54799},{\"end\":55070,\"start\":55066},{\"end\":55316,\"start\":55255},{\"end\":55566,\"start\":55562},{\"end\":55841,\"start\":55826},{\"end\":56114,\"start\":56110},{\"end\":56431,\"start\":56405},{\"end\":56828,\"start\":56802},{\"end\":57176,\"start\":57165},{\"end\":57524,\"start\":57510},{\"end\":57916,\"start\":57891},{\"end\":58212,\"start\":58193},{\"end\":58427,\"start\":58410},{\"end\":58750,\"start\":58736},{\"end\":59153,\"start\":59129},{\"end\":59450,\"start\":59435},{\"end\":59700,\"start\":59683},{\"end\":60004,\"start\":59987},{\"end\":60275,\"start\":60249},{\"end\":60586,\"start\":60578},{\"end\":60883,\"start\":60877},{\"end\":61150,\"start\":61140},{\"end\":61456,\"start\":61441},{\"end\":61782,\"start\":61754},{\"end\":62142,\"start\":62120},{\"end\":62505,\"start\":62498},{\"end\":62879,\"start\":62851},{\"end\":63186,\"start\":63158},{\"end\":63473,\"start\":63447},{\"end\":63774,\"start\":63763},{\"end\":64040,\"start\":64014},{\"end\":64339,\"start\":64325},{\"end\":64701,\"start\":64688},{\"end\":65055,\"start\":65029},{\"end\":65375,\"start\":65359},{\"end\":65750,\"start\":65652},{\"end\":66191,\"start\":66180},{\"end\":66427,\"start\":66416},{\"end\":66651,\"start\":66636},{\"end\":66862,\"start\":66854},{\"end\":67066,\"start\":67056},{\"end\":67373,\"start\":67355},{\"end\":67644,\"start\":67622},{\"end\":67924,\"start\":67910},{\"end\":68222,\"start\":68204},{\"end\":68474,\"start\":68459},{\"end\":68741,\"start\":68728},{\"end\":69042,\"start\":69034},{\"end\":69363,\"start\":69349},{\"end\":69657,\"start\":69647},{\"end\":69893,\"start\":69874},{\"end\":70141,\"start\":70090},{\"end\":70429,\"start\":70345},{\"end\":70717,\"start\":70701},{\"end\":65835,\"start\":65752},{\"end\":70179,\"start\":70143}]"}}}, "year": 2023, "month": 12, "day": 17}