{"id": 218762358, "updated": "2022-01-25 09:46:29.129", "metadata": {"title": "Inferring multimodal latent topics from electronic health records", "authors": "[{\"middle\":[],\"last\":\"Li\",\"first\":\"Yue\"},{\"middle\":[],\"last\":\"Nair\",\"first\":\"Pratheeksha\"},{\"middle\":[\"Han\"],\"last\":\"Lu\",\"first\":\"Xing\"},{\"middle\":[],\"last\":\"Wen\",\"first\":\"Zhi\"},{\"middle\":[],\"last\":\"Wang\",\"first\":\"Yuening\"},{\"middle\":[\"Ardalan\",\"Kalantari\"],\"last\":\"Dehaghi\",\"first\":\"Amir\"},{\"middle\":[],\"last\":\"Miao\",\"first\":\"Yan\"},{\"middle\":[],\"last\":\"Liu\",\"first\":\"Weiqi\"},{\"middle\":[],\"last\":\"Ordog\",\"first\":\"Tamas\"},{\"middle\":[\"M.\"],\"last\":\"Biernacka\",\"first\":\"Joanna\"},{\"middle\":[],\"last\":\"Ryu\",\"first\":\"Euijung\"},{\"middle\":[\"E.\"],\"last\":\"Olson\",\"first\":\"Janet\"},{\"middle\":[\"A.\"],\"last\":\"Frye\",\"first\":\"Mark\"},{\"middle\":[],\"last\":\"Liu\",\"first\":\"Aihua\"},{\"middle\":[],\"last\":\"Guo\",\"first\":\"Liming\"},{\"middle\":[],\"last\":\"Marelli\",\"first\":\"Ariane\"},{\"middle\":[],\"last\":\"Ahuja\",\"first\":\"Yuri\"},{\"middle\":[],\"last\":\"Davila-Velderrain\",\"first\":\"Jose\"},{\"middle\":[],\"last\":\"Kellis\",\"first\":\"Manolis\"}]", "venue": "Nature Communications", "journal": "Nature Communications", "publication_date": {"year": 2020, "month": null, "day": null}, "abstract": "Electronic health records (EHR) are rich heterogeneous collections of patient health information, whose broad adoption provides clinicians and researchers unprecedented opportunities for health informatics, disease-risk prediction, actionable clinical recommendations, and precision medicine. However, EHRs present several modeling challenges, including highly sparse data matrices, noisy irregular clinical notes, arbitrary biases in billing code assignment, diagnosis-driven lab tests, and heterogeneous data types. To address these challenges, we present MixEHR, a multi-view Bayesian topic model. We demonstrate MixEHR on MIMIC-III, Mayo Clinic Bipolar Disorder, and Quebec Congenital Heart Disease EHR datasets. Qualitatively, MixEHR disease topics reveal meaningful combinations of clinical features across heterogeneous data types. Quantitatively, we observe superior prediction accuracy of diagnostic codes and lab test imputations compared to the state-of-art methods. We leverage the inferred patient topic mixtures to classify target diseases and predict mortality of patients in critical conditions. In all comparison, MixEHR confers competitive performance and reveals meaningful disease-related topics.", "fields_of_study": "[\"Computer Science\"]", "external_ids": {"arxiv": null, "mag": "3027889410", "acl": null, "pubmed": "32439869", "pubmedcentral": "7242436", "dblp": null, "doi": "10.1038/s41467-020-16378-3"}}, "content": {"source": {"pdf_hash": "36cd9d81c66dea2b1ec46ae0b7c1481df2f85ff0", "pdf_src": "PubMedCentral", "pdf_uri": null, "oa_url_match": false, "oa_info": {"license": "CCBY", "open_access_url": "https://www.nature.com/articles/s41467-020-16378-3.pdf", "status": "GOLD"}}, "grobid": {"id": "8a3405833af66fa73a076d53d9ea1ecadb80892a", "type": "plain-text", "url": "s3://ai2-s2-pdf-extraction-prod/parse-results/s2orc_worker/36cd9d81c66dea2b1ec46ae0b7c1481df2f85ff0.txt", "contents": "\nInferring multimodal latent topics from electronic health records\n\n\nYue Li yueli@cs.mcgill.ca \nSchool of Computer Science\nMcGill Centre for Bioinformatics\nMcGill University\nH3A0E9MontrealQuebecCanada\n\nPratheeksha Nair \nSchool of Computer Science\nMcGill Centre for Bioinformatics\nMcGill University\nH3A0E9MontrealQuebecCanada\n\nXing Han Lu \nSchool of Computer Science\nMcGill Centre for Bioinformatics\nMcGill University\nH3A0E9MontrealQuebecCanada\n\nZhi Wen \nSchool of Computer Science\nMcGill Centre for Bioinformatics\nMcGill University\nH3A0E9MontrealQuebecCanada\n\nYuening Wang \nSchool of Computer Science\nMcGill Centre for Bioinformatics\nMcGill University\nH3A0E9MontrealQuebecCanada\n\nAmir Ardalan \nKalantari Dehaghi \nSchool of Computer Science\nMcGill Centre for Bioinformatics\nMcGill University\nH3A0E9MontrealQuebecCanada\n\nYan Miao \nSchool of Computer Science\nMcGill Centre for Bioinformatics\nMcGill University\nH3A0E9MontrealQuebecCanada\n\nWeiqi Liu \nSchool of Computer Science\nMcGill Centre for Bioinformatics\nMcGill University\nH3A0E9MontrealQuebecCanada\n\nTamas Ordog \nDepartment of Physiology and Biomedical Engineering and Division of Gastroenterology and Hepatology\nDepartment of Medicine, and Center for Individualized Medicine\nMayo Clinic\nRochesterMNUSA\n\nJoanna M Biernacka \nDepartment of Health Sciences Research\nMayo Clinic\nRochesterMNUSA\n\nDepartment of Psychiatry and Psychology\nMayo Clinic\nRochesterMNUSA\n\nEuijung Ryu \nDepartment of Health Sciences Research\nMayo Clinic\nRochesterMNUSA\n\nJanet E Olson \nDepartment of Health Sciences Research\nMayo Clinic\nRochesterMNUSA\n\nMark A Frye \nDepartment of Psychiatry and Psychology\nMayo Clinic\nRochesterMNUSA\n\nAihua Liu \nMcGill Adult Unit for Congenital Heart Disease Excellence (MAUDE Unit)\nH4A 3J1Montreal, QuebecQCCanada\n\nLiming Guo \nMcGill Adult Unit for Congenital Heart Disease Excellence (MAUDE Unit)\nH4A 3J1Montreal, QuebecQCCanada\n\nAriane Marelli \nMcGill Adult Unit for Congenital Heart Disease Excellence (MAUDE Unit)\nH4A 3J1Montreal, QuebecQCCanada\n\nYuri Ahuja \nComputer Science and Artificial Intelligence Lab\nMassachusetts Institute of Technology\n32 Vassar St02139CambridgeMAUSA\n\nJose Davila-Velderrain \nComputer Science and Artificial Intelligence Lab\nMassachusetts Institute of Technology\n32 Vassar St02139CambridgeMAUSA\n\nManolis Kellis \nComputer Science and Artificial Intelligence Lab\nMassachusetts Institute of Technology\n32 Vassar St02139CambridgeMAUSA\n\nThe Broad Institute of Harvard and MIT\n415 Main Street02142CambridgeMAUSA. ✉\n\nInferring multimodal latent topics from electronic health records\n10.1038/s41467-020-16378-3ARTICLE OPEN 1\nElectronic health records (EHR) are rich heterogeneous collections of patient health information, whose broad adoption provides clinicians and researchers unprecedented opportunities for health informatics, disease-risk prediction, actionable clinical recommendations, and precision medicine. However, EHRs present several modeling challenges, including highly sparse data matrices, noisy irregular clinical notes, arbitrary biases in billing code assignment, diagnosis-driven lab tests, and heterogeneous data types. To address these challenges, we present MixEHR, a multi-view Bayesian topic model. We demonstrate MixEHR on MIMIC-III, Mayo Clinic Bipolar Disorder, and Quebec Congenital Heart Disease EHR datasets. Qualitatively, MixEHR disease topics reveal meaningful combinations of clinical features across heterogeneous data types. Quantitatively, we observe superior prediction accuracy of diagnostic codes and lab test imputations compared to the state-of-art methods. We leverage the inferred patient topic mixtures to classify target diseases and predict mortality of patients in critical conditions. In all comparison, MixEHR confers competitive performance and reveals meaningful disease-related topics.\n\nT he broad adoption of electronic health record (EHR) systems has created unprecedented resources and opportunities for conducting health informatics research. Hospitals routinely generate EHR data for millions of patients, which are increasingly being standardized by using systematic codes, such as Logical Observation Identifiers Names and Codes (LOINC) for lab tests, RxNorm for prescriptions; and Systematized Nomenclature of Medicine (SNOMED), Diagnosis-Related Groups (DRG), and International Classification of Diseases (ICD-9) for diagnoses (albeit for billing purposes). In the USA, for example, the number of nonfederal acute care hospitals with basic digital systems increased from 9.4% to 96% over the 7-year period between 2008 and 2015 [1][2][3] . Furthermore, the amount of comprehensive EHR data recording multiple data types, including clinical notes, increased from only 1.6% in 2008 to 40% in 2015 3 . With the aid of effective computational methods, these EHR data promise to define an encyclopedia of diseases, disorders, injuries, and other related health conditions, uncovering a modular phenotypic network.\n\nDistilling meaningful concepts from the raw EHR data presents several challenges, and it is often unfeasible to directly model the joint distribution over the entire EHR feature space. On the other hand, it is possible to formulate a latent topic model over discrete data, in analogy to automatic text categorization 4 , considering each patient as a document and each disease meta-phenotype as a topic (grouping recurrent combinations of individual phenotypes). Our task then is to learn a set of meaningful disease topics, and the probabilistic mixture memberships of patients for each disease topic, representing the combination of meta-phenotypes inferred for each patient.\n\nIn this paper, we formalize this analogy by introducing a latent topic model, MixEHR, designed to meet the challenges intrinsic to heterogeneous EHR data. The main objective of our approach is twofold: (1) distill meaningful disease topics from otherwise highly sparse, biased, and heterogeneous EHR data; and (2) provide clinical recommendations by predicting undiagnosed patient phenotypes based on their disease mixture membership. Importantly, we aim for our model to be interpretable in that it makes not only accurate predictions but also intuitive biological sense. MixEHR can simultaneously model an arbitrary number of EHR categories with separate discrete distributions. For efficient Bayesian learning, we developed a variational inference algorithm that scales to large-scale EHR data.\n\nMixEHR builds on the concepts of collaborative filtering 5-9 and latent topic modeling 4,[10][11][12][13][14] . In particular, our method is related to the widely popular text-mining method Latent Dirichlet Allocation (LDA) 4 . However, LDA does not account for missing data and NMAR mechanism 8,15 . Our method is also related to several EHR phenotyping studies focusing on matrix factorization and model interpretability [16][17][18][19][20][21][22][23] . Recently developed deeplearning methods primarily focus on prediction performance of target clinical outcomes [24][25][26][27][28][29][30][31] . Apart from these methods, Graphbased Attention Model (GRAM) 32 uses the existing knowledge graph to embed ICD code and make prediction of diagnostic codes at the next admission using the graph embedding. Deep patient 29 uses a stacked stochastic denoising autoencoder to model the EHR code by its latent embedding, which are used as features in a classifier for predicting a target disease. More detailed review are described in Supplementary Discussion.\n\nWe apply MixEHR to three real-world EHR datasets: (1) Medical Information Mart for Intensive Care (MIMIC)-III 1 : a public dataset to date containing over 50,000 ICU admissions; (2) Mayo Clinic EHR dataset containing 187 patients, including with 93 bipolar disorder and 94 controls; (3) The Régie de l'assurance maladie du Québec Congenital Heart Disease Dataset (Quebec CHD Database) on over 80,000 patients being followed for congenital heart disease (CHD) for over 28 years (1983-2010) at the McGill University Health Centre (MUHC) in Montreal. In these applications, we find that the clinical features emerging across EHR categories under common disease topics are biologically meaningful, revealing insights into disease co-morbidities. The inferred topics reveal sub-categories of bipolar disorder, despite the small sample size. The inferred patient topic mixtures can be used to effectively predict diagnostic code in patient's future hospital visits from outpatient data, impute missing lab results, and predict future next-admission patient mortality risk.\n\n\nResults\n\nMixEHR probabilistic model. We take a probabilistic joint matrix factorization approach, by projecting each patient's highdimensional and heterogeneous clinical record onto a lowdimension probabilistic meta-phenotype signature, which reflects the patient's mixed memberships across diverse latent disease topics. The key innovation that enables us to handle highly heterogeneous data types is that we carry out this factorization at two levels. At the lower level, we use data-type-specific topic models, learning a set of basis matrices for each data type. Using the MIMIC-III data as an particular example, we learned seven basis matrices corresponding to clinical notes, ICD-9 billing codes, prescriptions, DRG billing codes, CPT procedural codes, lab tests, and lab results from the MIMIC-III dataset. We link these seven basis matrices at the higher level using a common loading matrix that connects the multiple data types for each patient (Fig. 1a).\n\nTo model the lab data, we assign common latent topic to both the lab test and lab test result such that they are conditionally independent given their topic assignments (Fig. 1b). We then updates the lab topic distributions using both the observed lab test results and the missing/imputed lab test results weighted by their topic assignment probabilities for each patient. This differs from other latent topic models, which assume that data are either completely observed or missing at random. To learn the model, we use a variational Bayes to update each model parameters in a coordinate ascent (Fig. 1c). The inference algorithms are detailed in \"Methods\" and \"Supplementary Methods\". After learning the model, we can obtain three pieces of clinically relevant information: (1) to impute missing EHR code for each patient, we take average over the disease topics; (2) to infer patients' metaphenotypes as their mixed disease memberships, we average over the phenotype dimension; and (3) to infer latent disease topic distribution (i.e., distributions over all clinical variables), we average over the patient dimension.\n\nMultimodal disease topics from MIMIC-III. We applied Mix-EHR to MIMIC-III data 1 , which contain~39,000 patients each with a single admission and~7500 patients each with multiple admissions (Supplementary Table 1). We used MixEHR to jointly model six data categories, including unstructured text in clinical notes, ICD-9, DRG, current procedural terminology (CPT), prescriptions, and lab tests, together comprising of~53,000 clinical features and~16 million total clinical observations (\"Methods\"). The frequency of observed EHR code over all admissions is low ( Supplementary Fig. 27). Majority of the variables including the lab tests were observed in less than 1% of the 58,903 admissions (i.e., greater than 99% missing rates for most variables). Therefore, the data are extremely sparse underscoring the importance of integrating multimodal data information to aid the imputation.\n\nTo choose the optimal number of topics (K), we performed fivefold cross-validation to evaluate models with different K by the averaged predictive likelihood on the held-out patients ( Supplementary Fig. 1a). We set K = 75 for subsequent analyses as it gave the highest predictive likelihood. We then examined the clinical relevance of our learned disease topics by qualitatively assessing the coherence of the 5 most probable EHR codes for each topic. Taking a column with common index k from the topic distribution matrices for each of the six EHR data types (i.e., notes, ICD-9, CPT, DRG, lab tests, and prescription) gives us a single disease topic distribution over clinical terms across those data types. We annotated all of the 75 topics based on the top EHR codes and found that majority of the inferred topics are specific to distinct diseases (Supplementary Table 2).\n\nFor the purpose of demonstration, we paid special attention to the disease topics exhibiting the highest likelihoods over the broad set of ICD-9 codes with prefixes {250, 296, 331, 042, 205, 415, 571}, representing diabetes, psychoses, neurodegeneration, HIV, myeloid leukemia, acute pulmonary heart disease, and chronic liver disease and cirrhosis, respectively. The top terms are displayed in alternative word cloud representations in Supplementary Fig. 3. We observed salient intra-topic consistency and inter-topic contrast with respect to each topic's highest-scoring EHR features across diverse EHR data categories (colored bars on the right; Fig. 2a). Notably, if we were to use LDA and thereby model observations across all data categories as draws from the same multinomial distribution, the learned disease topics would have been dominated by clinical notes, given that these contain far more features (i.e., words) than the other categories. We illustrate this aspect in the application of mortality prediction below.\n\nMoreover, we observed interesting connections between abnormal lab results and specific diseases ( Supplementary Fig. 4). For instance, topic M31 is enriched for alcoholic cirrhosis billing codes and ascites-based lab tests typical for cirrhosis patients; in M42, the code for HIV infection is grouped with abnormal counts of immune cells, including CD4 lymphocytes; diabetes codes tend to rank highly alongside high blood acetone in M48, and topic M62 is enriched for opioid abuse along with valproic acid and lithium prescriptions-common treatments for bipolar disorder. Interestingly, topic M59-associated with neurodegenerative diseases such as Alzheimer's disease (AD)-is strongly associated with vitamin B12, which was recently shown to exhibit differential pattern in AD patients 33 . We also correlated the 75topic distributions with patients' age. The results clearly show that the top positively age-correlated topics are related to heart failure (M20), cardiovascular (M44), and dementia (M59). In contrast, the top three negatively age-correlated topics are all related with newborn ( Fig. 2b; Supplementary Fig. 5).\n\nDisease comorbidity network in MIMIC-III data. We reasoned that the similarity of the annotated disease (ICD-9 codes) distributions over topics might help uncover nontrivial associations between diseases. In order to infer a disease comorbidity network, we used the 75 learned disease topics and calculated the pairwise correlations between ICD-9 diagnostic codes. We included 424 ICD-9 codes observed in at least 100 patients, and not in the external injuries (ICD-9 code starting with V) or supplementary classification (ICD-9 code starting with E) sections. For comparison, we calculated the correlations between the same 424 ICD-9 codes using their sparse distributions over patients in the raw data. Despite focusing on the ICD-9 codes with at least 100 patients, on average each code is observed in only 0.8% of patients (min: 0.3% and max 2%). Consequently, due to the high sparsity of diseases among patients, we observed very weak correlations based on the observed data ranging between −0.02 and 0.06 ( Supplementary Fig. 6a). However, when we correlated the ICD-9 codes using our inferred topic embeddings, we observed much stronger correlations. More importantly, diseases of similar physiology form modules consistent with clinical intuition ( Supplementary Fig. 6b). Thus, the projection of multimodal data to the inferred topic embeddings space enables the discovery of strong disease association, not directly measurable from the raw EHR data.\n\nUsing these topic embeddings, we can also obtain a comorbidity network centering on a specific disease of interest by correlating the disease's diagnostic code with all other diagnostic codes. In particular, we obtained such a comorbidity network for schizophrenia, post traumatic stress disorder (PTSD), Alzheimer's disease, and bipolar disorder ( Fig. 2c; Supplementary Figs. [7][8][9][10][11][12][13][14]. The size of the terms are proportional to their Pearson correlation with the disease of interest. To control the false discovery rate, we randomly shuffled the topic probabilities for the target phenotype to calculate the background correlation. Only phenotypes with permutation p-value < 0.01 are displayed. We observed meaningful related phenotypes in all of the four examples.\n\nPatient risk prioritization using MIMIC-III data. Besides gaining insights from the disease topics (i.e., basis matrices), we can also exploit the disease topic mixture memberships along the patients dimension. As an example, we took the 50 patients with the highest proportions for topics M31, M35, and M50, which as we noted above are associated with alcoholic cirrhosis, pulmonary embolism, and leukemia, respectively (Fig. 3a). We observed a clear enrichment for the expected ICD-9 codes-571, 415, and 205, corresponding to the diagnoses of chronic liver disease and cirrhosis, acute pulmonary heart disease, and myeloid leukemia, respectively-among these patients (Fig. 3b). However, not all of the patients were classified by their expected diagnostic codes.\n\nWe then hypothesized that these unclassified patients perhaps exhibit other markers of the relevant diseases. To further investigate these high-risk patients, we examined the 10 highest-scoring EHR codes under these topics (Fig. 3c). We highlighted some evidence as why the patients with the absence of ICD-9 code were prioritized as high risk by our model. Most patients under the leukemia topic M31, including those missing ICD-9 code 205, received bone marrow biopsies (CPT code 4131) and infusion of a cancer chemotherapeutic substance (CPT code 9925)-clear indicators of leukemia diagnosis and treatment. Likewise, several patients under the pulmonary embolism topic (M35) that are missing ICD-9 code 415 nevertheless have the DRG billing code for pulmonary embolism, a prescription for enoxaparin sodium (which is used to treat pulmonary embolism), or the related ICD-9 code 453 for other venous embolism and thrombosis. Moreover, all patients under the cirrhosis topic M50 have the key word cirrhosis mentioned in their clinical notes. Notably, although the procedural code for esophageal variceal banding is not particularly prevalent, MixEHR predicts reasonably high probability of undergoing this procedure among cirrhosis-topic patients-a clinically reasonable prediction. This suggests that our model is not only intuitively interpretable but also potentially useful for suggesting patient's future medical interventions.\n\nClassification of Mayo Clinic bipolar disorder patients. To further demonstrate the utility of our approach in discovering meaningful multimodal topics, we applied MixEHR to a separate dataset containing 187 patients, including 93 bipolar disorder cases and 94 age-and sex-matched controls from Mayo Clinic. Despite the small sample size, the patients were deeply phenotyped: there are in total 7731 heterogeneous EHR features across five different data categories, including ICD-9 codes, procedure codes, patient provided information (PPI), lab tests, and prescription codes. In total, there are 108,390 observations. We evaluated our model by fivefold cross-validation. Here, we trained MixEHR or the unsupervised baseline models and a logistic regression (LR) classifier that uses the patient topic mixture derived from MixEHR or embeddings derived from other methods to predict the bipolar disorder label ( Fig. 4a; \"Methods\"). We observed superior performance of MixEHR+LR compared with LDA+LR and RBM+LR in both the area under the ROC and the area under the precision-recall curves (Fig. 4b).\n\nWe quantified the predictive information of the 20 topics based on the linear coefficients of the LR classifer. We observed that topics M19 and M7 have the highest positive coefficients for bipolar disorder label (Fig. 4c). To confirm the finding, we visualized the 187 patient topic mixtures side-by-side with their BD diagnosis ICD-9 296 code (Fig. 4d). Indeed, we find that M19 and M7 are highly correlated with the BD diagnosis label, and M19 and M7 may represent two distinct subgroups of BD patients. To check whether these two topics were driven by demographic information, we compared the topic mixture membership with sex and age for each patient. We did not observe significant difference between sexes for M19 mixture probabilities or M7 mixture probabilities ( Supplementary  Fig. 28). There is also no significant correlation between age and M19 or M7 topic mixture ( Supplementary Fig. 31). We further investigated the differences between the M19 and M7 topics in terms of the underlying 7731 EHR codes. For each EHR code, we grouped the patients based on the presence and absence of that code. We then tested whether the two groups are significantly different in terms of their topic mixture memberships under M19 or M7 using Wilcoxon signed-rank one-sided tests. For the ease of interpretability, here we tested whether the patients with the code exhibit significantly higher topic mixture for M19 or M7, to assess positive enrichment for the topic. We note that these phenome-wide association studies (PheWAS) results were not corrected for multiple testing, and thus we used the results as an exploratory purpose only.\n\nWhile a large proportion of the significant EHR codes is associated with both the M7 and M19 topics, we also find interesting codes that are unique to each topic (Fig. 5). For instance, ICD-9 codes for suicidal ideation (V62.84), family history of psychiatric condition (V17.0), and bipolar type I disorder with the most recent severe depressed episode without psychotic behavior (296.53) are significantly associated with M19 but not M7, although both topics share 296.80 (bipolar disorder, unspecified) and 296.52 (bipolar I disorder, most recent episode (or current) depressed, moderate) codes for BD (Fig. 5). Certain lab tests (e.g., SLC6A4, HTR2A, and cytochrome P450 enzymes) are also associated with M19, but not M7. Lithium lab test is also associated with high M19 mixture probabilities, but not M7. Thus it is possible that M19 patients may have had more severe symptoms and needed an increased use of pharmacogenomically guided treatment. PheWAS for the PPI questions are displayed in Supplementary Fig. 32. Interpretation on the PPI PheWAS must be taken with caution (\"Methods\"). With these data, we are able to demonstrate a potential utility of our MixEHR approach to classify BD patients into potentially clinically meaningful categories that require further investigation in larger dataset.\n\nEHR code prediction in MIMIC-III data. Retrospective EHR code prediction has its value in diagnosing the code entered in the existing EHR patient records and making suggestions about the potential missing code and incorrectly entered code based on the expectation of those EHR codes. To predict EHR codes, we formulated a k-nearest neighbor approach (Supplementary Fig. 16a; \"Methods\"). We evaluated the prediction accuracy based on fivefold cross-validation. The predicted EHR codes match consistently with the observed frequency of the diagnostic codes ( Supplementary Fig. 15). Overall, the median prediction accuracy of MixEHR (multimodal) is 88.9%, AUROC is 85%, and AUPRC is 9.6%. In contrast, the baseline model that ignores distinct data types (flattened; i.e., LDA) obtained only 83.3% accuracy, 77.1% AUROC, and 6.7% AUPRC, respectively ( Supplementary  Fig. 16b). The prediction performances vary among distinct data types ( Supplementary Fig. 17) and also among different ICD-9 disease groups ( Supplementary Fig. 18), which are attributable to the rareness of the diseases, complexity of the disease codes, and the strength and limitations of our model-based assumption. One caveat in this experiment is that we are potentially using highly related code to predict the current target code. Therefore, we should distinguish this experiment from predicting diagnostic code in the future admissions of inpatient data or future visits in the outpatient data.  These topics are displayed as word clouds where the size of the word is proportional to their probabilities under the topic. The heatmap indicates patient mixture memberships for the topics. The color bar on the right of the heatmap indicates the actual diagnoses of the diseases related to each of the topics, namely leukemia, pulmonary embolism, and cirrhosis. c Top EHR codes of the high-risk patients. The top ten EHR codes (rows) from each topic were displayed for the top 50 patients (columns) under each topic. We highlighted some evidence (asterisks) as why some of the patients in absence of ICD-9 codes were prioritized as high risk by our method based on their relevance to the diseases of interests (i.e., leukemia, pulmonary embolism, and cirrhosis).   In the MIMIC-III data, there are 7541 patients who were admitted to the hospital more than once. This allows us to evaluate how well we can predict the diagnostic codes in the next admission based on the information from the previous admission(s) for the same patients. To this end, we developed a pipeline that combines MixEHR topics with recurrent neural network (RNN) with Gated Recurrent Unit (GRU) ( Fig. 6a; \"Methods\"). By leveraging the correlation structure information between rarely observed codes and commonly observed codes via the latent topics, we hypothesize that our approach can achieve comparable prediction accuracy as GRAM, which relies on the accuracy of the existing ICD-9 knowledge graph or taxonomy.\n\nWe observe that MixEHR+RNN confers the highest overall accuracy among the three methods, although the difference between MixEHR+RNN and GRAM 32 is small (Fig. 6b). We also generated the prediction accuracy on the codes binned by their frequencies as before ( Supplementary Fig. 35). MixEHR+RNN performs the best in four out of the five ranges and falls short by only 2% in the last range (80-100) compared with GRAM. Both MixEHR+RNN and GRAM outperform Doctor AI 27 by a large margin. Doctor AI did not do well in this application because of the small sample size and short medical history of the MIMIC-III data (11 years) (Fig. 6b).\n\nLongitudinal EHR code prediction using Quebec CHD data. We evaluated the code prediction accuracy on the 28-year longitudinal outpatient data from the CHD database using a MixEHR +RNN architecture ( Fig. 6c; \"Methods\"). Compared to our model with the baseline RNN, we observed a significant improvement in terms of both AUPRC (Wilcoxon signed-rank tests p-value < 0.0408) and AUROC (Wilcoxon signed-rank tests p-value < 5.35e-55) (Fig. 6d). Therefore, adding MixEHR significantly improves the EHR code prediction over the baseline RNN model. We also observed that the learned weights connected to the 50topic mixture exhibit higher magnitude than the learned weights connected to the concatenated dense layer embedding ( Supplementary Fig. 19). This means that the network relies heavily on the topic mixture to make accurate predictions. Because our dataset is focused on the CHD patients, we checked the prediction accuracy on ICD-9 code 428. Both models achieve 93% AUROC and 33% AUPRC for predicting 428 ICD-9 code.\n\nWe discovered two interesting topics namely M43 and M1 that are highly related to heart-failure ICD-9 code 428 ( Supplementary  Fig. 20). Specifically, M43 involves not only ICD-9 code 428.9 for heart failure but also code 518.4 for acute lung edema, code 290.9 for senile psychotic condition, code 428.0 for congenital heart failure, code 402.9 for hypertensive heart disease without HF, and code 782.3 for edema. Indeed, edema is known to be the precursor for heart failure among many patients. Interestingly, topic M1 characterizes a different set of heart-related diseases, such as rheumatic aortic stenosis (code 395.0), secondary cardiomyopathy (code 425.9), and left heart failure (code 428.1).\n\nProcedural codes 1-71, 1-9115, 1-9112 all indicate billing for more complex care either by a family doctor or specialists in patients who have impaired mobility, prolonged hospitalization beyond 15 days and/or admission to short-stay units for patients unable to go home, typically requiring diuretics for pulmonary edema. Therefore, most of the top EHR codes under topic M43 are clinically relevant predictors of heart-failure events in clinical practice.\n\nLab results imputation using MIMIC-III data. We then evaluated the imputation accuracy of missing lab results. We first performed an extensive simulation by subsampling from MIMIC-III data to compare lab imputation accuracy between MixEHR and MICE 34 (Supplementary Note). Our approach demonstrated superior performance compared with MICE and the model that assumes missing-at-random (MAR) lab results ( Supplementary  Fig. 25). We then demonstrated our approach on imputing the real MIMIC-III lab results. Here, we took a similar approach as the k-nearest neighbor approach in the EHR code prediction ( Fig. 7a; \"Methods\"). We observed that MixEHR achieves . This is attributable to two facts: (1) Mix-EHR accounts for NMAR by jointly modeling the distribution both the lab missing indicators and lab results; (2) MixEHR is able to leverage more information than CF-RBM: it models not only the lab data but also other administrative data and clinical notes. We also observed significantly higher accuracy for our MixEHR imputation strategy compared to a simple averaging approach (Supplementary Fig. 34; \"Methods\").\n\nMortality-risk prediction using the MIMIC-III data. Predicting patient's mortality risk in the Intensive Care Unit (ICU) is vital to assessing the severity of illness or trauma and facilitating subsequent urgent care. Because we are able to distill meaningful disease topics from heterogeneous EHR data, we sought to assess the predictive capacity of these disease topics for mortality predictions in future admissions. Here, we predicted the mortality outcome in the last admission based on the second-last admission of the patient within 6 months. We obtained the highest 31.62% AUPRC from MixEHR (50 topics) among all methods (Fig. 8a) and second highest AUROC of 65.69% ( Supplementary Fig. 22). We also experimented with two different classifiers namely logistic regression with L2-norm ( Supplementary Fig. 29) and random forest (Supplementary Fig. 30). We observed overall best performance using our MixEHR embedding with both classifiers compared with the other methods. Furthermore, we designed another experiment that used the earliest/first admission to predict the mortality in the last admission. The value of this application is to identify patients who are discharged too early and therefore to provide a measure on whether the patients should be discharged from the ICU based on their current condition. Once again, MixEHR outperformed other baseline methods (Supplementary Fig. 33). Here, we focused our analysis on the mortality in the last admission based on the information in the second-last admission.\n\nNotably, LDA obtained similar performance to MixEHR, whereas PCA, SiCNMF, and EN performed a lot worse on this task. This suggests that the topic models (i.e., LDA and MixEHR) are generally more suitable to modeling the discrete count data in the EHR. Based on the elastic net linear coefficients, the three most positively predictive mortality topics are enriched for renal failure (M60 with the most positive coefficient), leukemia (M73), and dementia (M26), respectively (Fig. 8c). Interestingly, the three most negatively predictive mortality topics are normal newborn (topic M52 with the most negative coefficient), aneurysm (M8), drug poisoning (M73), respectively. We note that each MixEHR topic is represented by the top EHR features from diverse data types. In contrast, all of the predictive topics from LDA are represented by a single data type: clinical notes (Fig. 8d). This is because clinical notes contain most EHR features (i.e., words) among all of the data types. By normalizing the EHR features across all of the data types, the LDA topics are overwhelmed by the category that contains a lot more features than the other categories. Qualitatively, this greatly reduces the interpretability of the topics compared to our MixEHR.  We also ran Deep Patient 29 on the MIMIC-III data and did not obtain good performance (\"Methods\"; Supplementary Fig. 23). This is perhaps due to the small sample size and the lack of carefully designed preprocessing pipeline 29 as the authors demonstrated on their own EHR data. In addition, previous work has shown the benefits of using demographic information in representing EHR codes and patient visits 35 . Our preliminary results show little benefit of adding demographic information including sex, age, religion, ethnicity, and marital status in the mortality prediction (Supplementary Fig. 24). However, we acknowledge its importance and will continue exploring this in our future work.\n\n\nDiscussion\n\nWe present MixEHR as an unsupervised Bayesian framework to efficiently model the distribution of heterogeneous highdimensional EHR data. We envision MixEHR to be a step toward several promising translational venues, such as (1)    EHR systems, our model needs to adapt to incoming data without refitting to the entire dataset-in other words, to go online-a topic for future development.\n\nIn the current framework, MixEHR assumes that the input data are a set of two-dimensional matrices of patients by measurements (lab tests, diagnoses, treatments, etc.), as delineated in the structure of our datasets. However, one could envision EHR data being represented as higher-dimensional data objects-for instance, as a three-dimensional object of patients by lab tests by diagnoses, patients by diagnoses by treatments, or patients by diagnoses by time. To model such high-dimensional EHR data (as it becomes available), we can extend MixEHR to a probabilistic tensor-decomposition (TD) framework. Recently developed non-Bayesian models such as Marble 36 , Rubik 37 , and non-negative TD 21 are TD-based methods that show great promise. MixEHR is an ideal modeling core to serve as the basis for such upcoming modeling high-dimensional challenges.\n\nIt is challenging to interpret associations with patient provided information (PPI), compared with the other data types we used here. The presence of PPI data is confounded by factors such as the point of care (e.g., primary care versus psychiatric department), gender, demographics, and other social determinants of health. We will revisit this challenge in our future work.\n\nOur basic MixEHR framework is cross-sectional. Nonetheless, longitudinal EHR learning is an important research area as it promises to forecast patients' disease outcomes based on their entire medical history records while taking into account the temporal trajectory of patient states 27,38,39 . To this end, we present a pipeline that provides the MixEHR-inferred topic mixture at each admission as an input to a recurrent neural network in order to model the longitudinal aspect of the EHR data. It is more challenging to model irregularly sampled time points as commonly observed in the outpatient visits while modeling highdimensional variables. In addition, in our lab imputation analysis, we did not model the sequential event of lab test results within the same admission, which requires a more sophisticated model that takes into account NMAR and the irregularly measured lab tests during the patient's stay. We leave these as future extensions to MixEHR.\n\nIn the mortality prediction, we used the information at the early admission to predict mortality in the last admission. Meanwhile, we understand the value of using the first 24 or 48 h data to predict in-hospital mortality within the same admission (e.g. ref. 17 ). This is different from our application. We did not carry out this experiment because not all of the EHR data in MIMIC-III have a time stamp (i.e., CHARTTIME) within the same admission. In particular, although clinical notes and lab tests have chart time that records the time they were taken during the in-hospital admission, all of the rest of the data including ICD-9 diagnostic code, prescription, CPT, DRG code do not have a chart time and are usually entered upon patient's discharge. This makes it difficult to design such an experiment that uses all of the information. We acknowledge that one caveat in our analysis is that some patients who are terminally ill (e.g., at the metastatic cancer stage) may choose to die at home and therefore our prediction may reflect not only the patients' health states but also their mental and social states.\n\nIn summary, our data-driven approach, using a large number of heterogeneous topics over long observation periods, has the potential of leading to clinically meaningful algorithms that will help clinicians anticipate high disease-burden events in clinical practice. Our findings can inform the growing emphasis on proactive rather than reactive health management as we move into an era of increasing precision medicine.\n\n\nMethods\n\nMixture EHR topic model (MixEHR). We model EHR data using a generative latent topic model (Fig. 1). Notations are summarized in Supplementary Table 3. Suppose there are K latent disease topics, each topic k ∈ {1, …, K} under data type t ∈ {1, …, T} prescribes a vector of unknown weights ϕ ðtÞ k ¼ ½ϕ ðtÞ wk W ðtÞ for W (t) EHR features, which follows a Dirichlet distribution with unknown hyperparameter β wt . In addition, each topic is also characterized by a set of unknown Dirichletdistributed weights η lk ¼ ½η lkv V l with V l distinct values (e.g., a lab test l with V l distinct lab result values). For each patient j ∈ {1, …, D}, the disease mixture membership θ j is generated from the K-dimensional Dirichlet distribution Dir(α) with unknown asymmetric hyperparameters α k . To generate EHR observation i for patient j, a latent topic z ðtÞ ij under data type t is first drawn from multinomial distribution with rate θ j . Given the latent topic z For lab data, we use a generative process where each patient has a variable for the result for every lab test regardless whether the results is observed. One important assumption we make here is that the lab results y lj and lab observation r lj for patient j are conditionally independent given the latent topic h lj , namely that the probability of taking the test and the value of that test both depend on the latent disease topic, but not on each other. In terms of the generative process, we first sample the latent variable h lj from the multinomial distribution with rate θ j . Conditioned on the latent variable, we then concurrently sample (1) the lab result y lj from V l -dimensional Dirichlet distribution η lh lj with hyperparameters ζ l over V l values and (2) the lab observation indicator r lj from Binomial distribution 1 with rate ψ lh ij , which follows a Beta distribution with unknown shape and scale hyperparameters a l and b l . The hyperparameters α k , β wt , ζ lv , a l , b l 's follow unknown Gamma distributions.\n\nFormally, we first generate global variables as the parameters for the disease topic distribution: ϕ ðtÞ k $ Dirðβ t Þ :\nΓ P w β wt À Á Q w Γðβ wt Þ Y w ϕ ðtÞ wk h i β wt À1 η lk $ Dirðζ l Þ : Γð P v ζ lv Þ Q v Γðζ lv Þ Y v η ζ lv À1\nlkv ; ψ lk $ Betða l ; b l Þ :\nΓða l þ b l Þ Γða l ÞΓðb l Þ ψ a l À1 lk ð1 À ψ lk Þ b l À1\nWe then generate local variables for the diagnostic codes including words from clinical notes, ICD-9 diagnostic codes, prescription terms, Current Procedure Terminology (CPT) codes of each patient: Marginalized likelihood. Treating the latent variables as missing data, we can express the complete joint likelihood based on our model as follows: pðx; y; r; z; h; θ; ϕ; ψ; ηjΘÞ ¼ pðθjαÞpðz; hjθÞpðxjz; ϕÞpðϕjβÞpðrjh; ψÞpðyjh; ηÞpðηjζÞpðψja; bÞ At this point, we could formulate a variational inference algorithm with mean-field factorization by optimizing an evidence lower bound of the marginal likelihood with respect to the model parameters 40 . However, that would be inaccurate and computationally expensive for the following reasons. The mean-field variational distribution assumes that all of the latent variables are independent. On the other hand, we know from our model that these independence assumptions are unrealistic. In particular, the latent topic assignments depend on the patient mixtures, and the disease latent topic distribution and topic assignment are dependent given the observed lab tests or diagnostic code (i.e., the V shape structure in the probabilistic graphical model 41 ). In addition, the variational updates require extensive usages of exponential function and digamma function for every latent topic assignment of every patient, which are computationally expensive to compute for larger number of patients.\nθ j $ DirðαÞ : Γð P k α k Þ Q k Γðα k Þ Y k θ α k À1 jk ; z ij $ Mulðθ j Þ : Y k θ ½z ij ¼k jk ; x ij $ Mulðϕ\nWe can achieve more accurate and efficient inference by first analytically integrating out the patient mixtures and latent topic distributions 13,42 . To do so, we exploit the respective conjugacy of Dirichlet variables ϕ, η, θ to the multinomial likelihood variables x, y, {z, h}, and the conjugacy of Beta variable ψ to the binomial lab observation indicator variable r. This way we can simplify the complete joint likelihood distribution of the data and the latent variables {z, h} as follows:\n\npðx; y; r; z; hjα; β; ζ; a; bÞ ¼\nZ pðz; hjθÞpðθjαÞdθ Z pðxjz; ϕÞpðϕjβÞdϕ Z pðyjh; ηÞpðηjζÞdη Z pðrjh; ψÞpðψja; bÞdψ ¼ Y j Γ P k α k À Á Q k Γðα k Þ Q k Γ α k þ n ð:Þ :jk þ m :jk Γ P k α k þ n ð:Þ :jk þ m :jk Y k Y t Γ P w β wt À Á Q w Γ β wt À Á Q w Γ β t þ n ðtÞ w:k Γ P w β wt þ n ðtÞ w:k Y k Y l Γ P v ζ lv À Á Q v Γ ζ lv ð Þ Q v Γ ζ lv þ m l:kv ð Þ Γ P v ζ lv þ m l:kv À Á Y k Y l Γ a l þ b l ð Þ Γða l ÞΓðb l Þ Γða l þ p lk ÞΓðb l þ q lk Þ Γða l þ p lk þ b l þ q lk Þ\nwhere the sufficient statistics are: \nn ð:Þ :jk ¼ X T t¼1 X M ðtÞ j i¼1 ½z ðtÞ ij ¼ k; n ðtÞ w:k ¼ X D j¼1 X M ðtÞ j i¼1 ½x ðtÞ ij ¼ w; z ðtÞ ij ¼ k ð1Þ m :jk: ¼ X L l¼1 X V l v¼1 y ljv ½h lj ¼ k; m l:kv ¼ X D j¼1 y ljv ½h lj ¼ k ð2Þ p lk ¼ X j ½r lj ¼ 1 Y v y ljv ½h lj ¼ k; q lk ¼ X j ½r lj ¼ 0 X v ½h lj ¼ k; y lj ¼ vð3Þ½h lj ¼ klog λ ljkð7Þ\nMaximizing (6) \n0 B B B @ 1 C C C Að11Þ\nTo infer p(h lj = k|x, y, r), we will need to separately consider whether the lab test l is observed or missing. In particular, we can infer the topic distribution λ ljkv / E q ½log pðh lj ¼ kjx; y; rÞ of an observed lab test y lj at value v as: \nλ ljkv / α k þñ :þ b l þq lk !ð12Þ\nFor unobserved lab tests, we infer the joint distribution of latent topic and lab result π ljkv / E q ½log pðh lj ¼ k; y lj ¼ vjx; y; rÞ:\n\nπ ljkv / α k þñ :jk þm Àðl;jÞ :jk ζ lv þm Àðl;j;vÞ lkv \nP v 0 ζ lv¼ X L l 0 ≠l X V l 0 v¼1 ½r l 0 j ¼ 1y l 0 jv λ l 0 jkv þ ½r l 0 j ¼ 0π l 0 jkv ð15Þ m Àðl;j;vÞ l:kv ¼ X D j¼1 X L l¼1 X V l v 0 ≠v ½r lj ¼ 1y ljv 0 λ ljkv 0 þ ½r lj ¼ 0π ljkv 0 ð16Þ p Àðl;jÞ lk ¼ X j 0 ≠j ½r lj 0 ¼ 1 X v y lj 0 v λ lj 0 k ;q Àðl;jÞ lk ¼ X j 0 ≠j ½r lj 0 ¼ 0 X v π ljkvð17Þ\nFurthermore, we update the hyperparameters by maximizing the marginal likelihood under the variational expectations via empirical Bayes fixed-point updates 14,43 ). For example, the update for β wt is\nβ Ã wt a β À 1 þ β wt P k Ψðβ wt þ n ðtÞ w:k Þ À KW t Ψðβ wt Þ b β þ P k ΨðW t β wt þ P w n ðtÞ w:k Þ À KΨðW t β wt Þð18Þ\nOther hyperparameters updates are similar. The learning algorithm therefore follows expectation-maximization: E-step infers γ ðtÞ ijk ; λ ljkv ; π ljkv 's; M-step updates the above sufficient statistics of model parameters and hyperparameters. Details and time complexity analysis are described in Supplementary Methods.\n\nStochastic joint collapsed variational Bayesian inference. To learn MixEHR from massive-scale EHR data, we propose a stochastic collapsed variational Bayesian (SCVB) algorithm 44,45 . The main objective of our SCVB algorithm is to avoid keeping track of all of the latent topic assignments γ ðtÞ ijk and λ ljkv 's while maintaining accurate model inference. Specifically, we first calculate the intermediate variational updates from randomly sampled mini-batches of D 0 patients:\nn ðtÞ w:k ¼ X D 0 j 0 ¼1 X M ðtÞ j 0 i¼1 ½x ðtÞ ij 0 ¼ wγ ðtÞ ij 0 k ð19Þ m l:kv ¼ X D 0 j 0 ¼1 X L l¼1 ½r lj 0 ¼ 1y lj 0 v λ lj 0 kv þ ½r lj 0 ¼ 0π lj 0 kvð20Þ\nWe then update the latent disease topics using natural gradients, which are the intermediate updates weighted by a fixed learning rate: \n\nDetails are described in Supplementary Methods. We observed that the SJCVB0 algorithm achieves comparable performance as the full-batch learning with only a fraction of time and constant memory ( Supplementary Fig. 2).\n\nPredictive likelihood. To evaluate model learning and monitor empirical convergence, we performed fivefold cross-validation. For each patient in the validation fold, we randomly selected 50% of their EHR features to infer their disease mixtures and then used the other 50% of the features to evaluate the log predictive likelihood -a common metric to evaluate topic models 4,14,44 : ; ψ lk ¼ a l þp lk a l þp lk þ b l þq lk ;η lkv ¼ ζ lv þm lkv P V l v 0 ¼1 ζ lv 0 þm lkv 0 Sensible models should demonstrate improved predictive likelihood on held-out patients. We evaluated the predictive log likelihood of models with K ∈ {10, 25, 40, 50, 60, 75, 100, 125, 150} using the MIMIC-III data and ultimately set K = 75 as it gave the highest predictive likelihood (Supplementary Fig. 1). Nonetheless, models with K within the range between 50 and 100 have similar performance.\n\nRetrospectively predict EHR codes by a k-nearest neighbor approach. To impute missing data in an individual-specific way, we here describe a k-nearest neighbor approach. As illustrated in Supplementary Fig. 16a. the prediction can be divided into three steps:\n\n• Train MixEHR on training set to learn the EHR code by disease topic matrices W across data types and infer the disease topic mixtures θ train for each training patient data point;\n\n• To infer the probability of an unknown EHR code t for a test patient j 0 , use MixEHR and the learnt disease topic matrices W to infer the disease topic mixture θ j 0 for the test patient;\n\n• Compare the test patient disease topic mixture θ j 0 with the training patient disease mixtures θ train to find the k most similar training patients S j 0 . Here, the patient-patient similarity matrix is calculated based on the Euclidean distance between their disease topic mixtures:\nd ij ¼ ffiffiffiffiffiffiffiffiffiffiffiffiffiffiffiffiffiffiffiffiffiffiffiffiffiffiffiffiffiffiffiffiffiffiffiffiffiffi ffi X K k¼1 θ j 0 k À θ jk 2 rð24Þ\nwhere θ j 0 k and θ jk are the mixture memberships of the test patient j 0 and training patient j, respectively. Finally, we take the average of the EHR code t over these k-nearest neighbor patients as the prediction for the target code t for test patient j 0 :\nx tj 0 ¼ 1 k X j2S j 0 x tjð25Þ\nWe empirically determined the number of nearest neighbors k to be 100.\n\nEvaluating retrospective EHR code prediction. To evaluate the prediction performance, we chose a set of EHR codes from each data category based on the following criteria. For clinical notes, we chose the key words that are recorded in more than 10 patients but fewer than 500 patients to focus on disease-specific words with sufficient number of patients. For other data categories, we chose target codes that are observed in at least 100 patients but no more than 50% of the training cohort (i.e.,~19,000 patients). We then further selected the top 100 codes per data type in terms of the number of patients except for the ICD-9 diagnostic code, for which we evaluated prediction on each of the 499 codes in order to assess the performance differences by ICD-9 disease groups ( Supplementary Fig. 18). In total, we obtained 976 target EHR codes (Supplementary Table 4). For unbiased evaluation, we performed a fivefold cross-validation. For training fold n, we trained MixEHR to learn the disease topic matrices W training fold n and patient disease topic mixtures θ training fold n . For the corresponding validation fold, we evaluated the prediction of each target code t for each test patient j 0 as follows. We first removed the target code t from the test patient j 0 if it is observed for the test patient j 0 . We then inferred the disease mixture for the test patient j 0 and inferred the probability of target code t for test patient j 0 using the k-nearest neighbor approach. We repeated this procedure for the five validation folds to obtain the predictions of each target EHR code.\n\nFor comparison, we evaluated the performance of the baseline topic model which ignores distinct data types in the EHR data. Notably, such model is essentially equivalent to LDA. To this end, we modified the training and validation datasets to have the same data type for all of the 53432 EHR codes and gave each code a unique ID (i.e., 1 to 53,432). We then extracted the 976 target codes for fivefold cross-validation predictions. We ran MixEHR on such data-type-flattened data. We evaluated the predictions based on area under of the ROC curve (AUROC) and precision-recall curve (AUPRC) as well as the overall accuracy by thresholding the prediction probability by 1/k, where k = 100 is the empirically determined number of nearest neighbors.\n\nImplementations of the existing methods. For experiments comparing our method with GRAM 32 and Doctor AI 27 , we used the open source implementation made available by the authors of the papers found at https://github.com/mp2893/ gram and https://github.com/mp2893/doctorai, respectively. GRAM and Doctor AI were both set to predict the medical codes (as defined in their papers) in the next admission for the MIMIC-III. This task is also known as sequential diagnosis prediction. The same Clinical Classification Software (CCS) medical codes used in the original implementation of both methods were used in the comparisons as well. Note that Doctor AI can also be used to predict the time duration of next visit, but we did not compare our method with it in this aspect. For both Doctor AI and GRAM, we used the default recommended settings provided in their code bases. Both these models were implemented in Theano. To compare with Doctor AI and GRAM, we used Accuracy@20 as described in the GRAM paper for different percentile of frequencies of the medical codes.\n\nIn our comparison with Deep Patient, since there was no published code available, we implemented the stacked denoising autoencoder to the best of our abilities. We closely followed the steps mentioned in the paper by the authors. We did not follow the elaborate data preprocessing pipeline used in the paper as our dataset (MIMIC-III) is different from the one used by 29 . Our implementation had three layers of autoencoders with 500 hidden units (as in the original paper) and was coded using Keras library. We used the Deep Patient representation as input to a classifier (i.e., logistic regression) to predict mortality and compared the accuracy with MixEHR in terms of the area under the precision-recall (AUPRC) and area under the ROC (AUROC) (Supplementary Fig. 23).\n\nConditioned Factored Restricted Boltzmann Machine (CF-RBM) was implemented by adapting the code from https://github.com/felipecruz/CFRBM. CF-RBM was originally designed for Netflix movie recommendation. Each movie has a five-star rating. We modified the code to make it work with two-state lab results (i.e., normal and abnormal). We used 100 hidden units of CF-RBM to train on the randomly sampled 80% of the admissions and tested the CF-RBM on the remaining 20% of admissions. We ensured that the training and test sets were the same for both CF-RBM and MixEHR. We evaluated the trained CF-RBM as follows. We iterated over the admissions in the test set, and for every lab test in that admission, we masked its test result and made a prediction based on the remaining lab tests of the same admission. This procedure was repeated for every lab test in every admission. We then recorded the predicted lab results and the true lab results for evaluation purpose. The same evaluation procedure was also used for MixEHR.\n\nSiCNMF was implemented using the Python code from author's Github repository https://github.com/sgunasekar/SiCNMF 19 . The model was trained on the MIMIC-III dataset with six data types as the six collective matrices until convergence.\n\nUnless mentioned otherwise, all of the other unsupervised learning and classification methods such as PCA, random forest, elastic net, logistic regression, and LDA were implemented using the Scikit-Learn Python library.\n\nMIMIC-III data description. The methods were performed in accordance with the PhysioNet data user agreement. All of the MIMIC-III data received simple and minimal preprocessing of the raw comma separated value (CSV) files provided from MIMIC-III critical care database (mimic.physionet.org). For all data types, we removed nonspecific EHR code that were commonly observed among admissions based on their inflection points ( Supplementary Fig. 26). No further processing was performed unless mentioned otherwise. For clinical notes (NOTEEVENTS.csv), we used the R library tm 46 by following a simple pipeline. We filtered out common stop words, punctuations, numbers, whitespace and converting all of the remaining words to lowercase.\n\nFor lab test data, we used the FLAG column that indicates normal or abnormal level for the lab results. We counted for each admission the number of times the lab results were normal and abnormal. A patient at the same admission can exhibit both normal and abnormal states zero or more times for the same lab test. In this case, we recorded the frequency at each state for the same admission.\n\nFor prescription, we concatenated the DRUG, DRUG_NAME_GENERIC, GSN, NDC column to form a compound ID for each prescription. For the Diagnosis-related group (DRG) code (DRGCODES.csv), we concatenated several IDs including DRG_TYPE, DRG_CODE, DESCRIPTION, DRG_SEVERITY, and DRG_MORTALITY to form a compound ID for each DRG code. The identifiers for ICD-9 code (ICD-9-CM) (DIAGNOSES_ICD.csv) and treatment procedure code (PROCEDURES_ICD.csv) (ICD-9-CPT) were kept as their original forms. The resulting data are summarized in Supplementary Table 1.\n\nMayo Clinic data description. The 187 patients (94 bipolar disorder cases and 93 controls) were selected from the Mayo Clinic Bipolar Disorder Biobank and the Mayo Clinic Biobank, respectively. They had consented for research, including research using their EHR data 47,48 . This study was reviewed and approved by Mayo Clinic Institutional Review Board and by the access committees from both biobanks. The EHR information for each of the patients cover five categories, including ICD-9 codes (2224 ICD-9-CM codes), procedure codes (2200 CPT codes), patient provided information (955 text questions), lab tests (1742 lab test codes), medication prescriptions (610 prescription order codes). In total, there are 7731 codes and 108,390 observations (Supplementary Table 5). For each case, one subject from the Mayo Clinic Biobank was matched on age and sex, after excluding subjects with psychiatric conditions in self-reports and/or EHR. Supplementary Table 6 summarizes age-sex distribution by cases and controls.\n\nQuebec CHD data description. The dataset was derived from the EHR documented Quebec Congenital Heart Disease (CHD) database with 84,498 patients and 28 years of follow-up from 1983 to 2010 49,50 . The study uses administrative databases as data sources. No participant is enrolled. The study was approved by Research Ethics Board of McGill University Health Centre. For each patient, the patient history can be traced back to the later of birth or 1983, and followed up to the end of the study or death of the patient, whichever came earlier. The dataset includes two data types: ICD-9 or ICD-10 billing code and intervention code. The raw dataset consists of individual records of each patient's medical visit. Each visit lasted less than a day. Thus, they were not considered as admissions, and are categorized as outpatient data. The informed consent was obtained from all participants.\n\nBy using the time stamp of those visits, we aggregated the diagnoses and intervention codes by the months into visit blocks. Thus, each visit block represents the record of a patient in that time interval as a set of diagnoses and a set of interventions. Since the patients' visit history was recorded as sequential events over the 28 years, we represented each patient's complete medical history as a time series of diagnoses and intervention sets. The length of the sequence depends on the total number of months. We only kept the months in which a patient has visited a medical institution at least once. The diagnoses given were represented as a four or five-digit ICD-9 or ICD-10 code. All of the codes were converted to ICD-9 using a board-approved conversion table. In order to generate the labels, we took the first three digits of each code. The processed data are summarized in Supplementary Table 3.\n\nBipolar disorder Mayo Clinic patients classification details. Among the five data categories, lab tests and PPI have two separate data features unlike the other three binary data categories. Specifically, they consist of (1) presence vs. absence of the data in the EHR (e.g., whether a lab test was done or whether a patient answered a particular PPI question) and (2) the actual value for the variable (i.e., test results for a lab test, or patient's answer for a PPI question). Given the small sample size, we chose to model the first data feature (whether the data exists in the EHR) to mimic the data structure used in the rest of the data categories, recognizing that we may miss important information by not analyzing the actual lab test results and/or patients answers for particular PPI questions. We speculate that the missing pattern may be related to the disease classification and disease subgroups, especially for the lab codes. However, we note that the missing pattern for the PPI data might be strongly confounded by other nonclinical characteristics such as age, gender and social determinants of health.\n\nWe used a 20-topic MixEHR to model the distinct distribution of these six data types. Our preliminary analysis showed that more than 20 topics produced degenerate models. First, we sought to quantitatively examine whether the patient topic mixtures provide useful information for accurate classification of bipolar disorder. To this end, we divided the 187 patients into five folds (Fig. 4a). We trained MixEHR on the four folds and then a logistic regression (LR) classifier that uses the patient topic mixture in the four folds to predict the bipolar disorder label. In this evaluation, we removed ICD-9 code category 296 from all patients as it codes for bipolar disorder. We then applied the trained MixEHR and LR to predict the BD labels of patients in the validation fold based on their MixEHR 20-topic mixture. As a comparison, we also applied two other unsupervised learning approaches, namely Latent Dirichlet Allocation (LDA) with 20 topics and Restricted Boltzmann Machine (RBM) with 20 hidden units.\n\nLongitudinal MIMIC-III EHR code prediction details. Because our current model is not longitudinal, we developed a pipeline that combines MixEHR topics with recurrent neural network (RNN) with Gated Recurrent Unit (GRU) (Fig. 6a). We first trained MixEHR on the EHR data for~39,000 patients with single admission in MIMIC-III. We then used the trained MixEHR to infer topic mixture at each admission for the 7541 patients with multiple admissions. Then we used as input the inferred topic mixture at the current admission (say at time t) to the RNN to auto-regressively predict the diagnostic codes at the next admission at time t + 1.\n\nHere, MixEHR uses all of the data types from MIMIC-III. Specifically, we used a 128-dense layer to embed the input topic mixture before passing it to the two 128-GRU layers followed by a dense layer connected to the CCS medical code output classes. We set the L2 weight penalty to 0.001 and dropout rate 0.5 based on preliminary results and existing literature.\n\nAs a comparison, we ran one of the recently developed state-of-the-art deeplearning frameworks called Graph-based Attention Model (GRAM) 32 . GRAM requires a knowledge graph such as the CCS multi-level diagnosis hierarchy or ICD-9 taxonomy and at least two admissions for each patient. Therefore, we only trained GRAM on the 7541 patients' admissions using only their ICD-9 codes. For MixEHR+RNN and GRAM, we randomly split the multi-admission patients into 80% for training and 20% for testing. Same as the evaluation performed by Choi et al., we prepared the true labels by grouping the ICD-9-CM codes into 283 groups using the Clinical Classification Software (CCS) 32 .\n\nIn terms of evaluating prediction accuracy of specific medical codes, we found that all of the models including GRAM and Doctor AI do not perform well on the low-frequent medical codes (with median accuracies equal to 0 and mean accuracies below 25% accuracy range), and the accuracy estimates are unstable for the rare medical codes, depending on the training and testing split. Therefore, we focused on evaluating the predictions of the 42 medical codes each observed in at least 1000 training admissions. We then calculated the accuracy at the top 20 predictions for each CCS diagnosis code. For each medical code, we counted the number of true positives among the top 20 predicted code for each admission and then divided it by the number of total positives.\n\nQuebec CHD EHR code prediction details. In this database, each patient had on average 28 years medical follow-up history . The input data have two data types namely, ICD-9 or ICD-10 code and procedure intervention code. We designed an RNN that takes as input both the raw EHR data and the multimodal topic mixture (over the two ICD and procedure data types) inferred by MixEHR at each visit block t and predicts as outputs the first three digits of the diagnostic ICD code at the next visit block t + 1 (Fig. 6c). Similar to the design from Doctor AI 27 , we defined a visit block as a 1-month interval that contains at least one visit from the patient. For instance, suppose a patient visits multiple times in January and does not visit since then until May. We pool the data over those visits in January. We ignore the months where there is no visit by that patient (i.e., February to April). We predict diagnostic code for the next visit block t + 1 in the subsequent month that contains at least one visit by that patient (i.e., May in the above hypothetical example).\n\nHere, we sought to assess whether there is additional information provided by MixEHR that is not captured by the fully connected dense layer of the RNN in terms of the code prediction improvement. For the ease of reference, we call this approach as MixEHR+RNN to distinguish it from the baseline RNN that takes only the raw EHR as input (i.e., Doctor AI). For the baseline RNN, we use 100dimensional hidden embedding (i.e., fully connected dense layer) to encode the observed EHR code in the input. For the MixEHR+RNN model, we used 50dimensional hidden embedding to encode the observed EHR code augmented with 50-topic MixEHR for the topic mixture embedding ( Supplementary Fig. 21). Therefore, both models have 100-dimensional latent embeddings to encode the input features. The rest of the architecture stays the same for both RNN models. Details are described in Supplementary Note.\n\nFor evaluation, we randomly split the 80,000 patients into 80% of the patients for training and 20% of the patients for testing. For MixEHR+RNN, we first trained MixEHR on all of the visit blocks of the training patients. Then, we trained an RNN that takes the raw input concatenated with the MixEHR-inferred 50-topic mixture at each visit block of the training patients to predict the diagnostic code at the next visit block. For testing, we applied the trained MixEHR+RNN and the baseline RNN to predict the diagnostic code in the next visit block of the test patients based on all of the previous visit block(s). For MixEHR+RNN and the baseline RNN models, we recorded the prediction accuracy across all visit blocks (excluding the first visit block) for each patient in terms of AUROC and AUPRC for each diagnostic code.\n\nMIMIC-III lab results imputation details. In total, there are 53,432 unique features/variables over six data types in the MIMIC-III. Among these, 564 variables are lab tests. We used all of the variables (notes, ICD, lab, prescriptions, DRG, CPT) across all of the six data types to learn the topic distribution from the training set and performed imputation of lab results on the testing set (Fig. 7a). For the observed lab tests of each patient, we used the FLAG column that indicates normal or abnormal level for the lab results. We counted for each admission the number of times the lab results were normal and abnormal. A patient at the same admission can exhibit both normal and abnormal states zero or more times for the same lab test. In this case, we recorded the frequency at each state for the same admission.\n\nThe goal of our analysis is to impute missing lab test results based on all of the other information of the patient's admission. Therefore, we did not distinguish whether the admissions came from the same patients and focused on imputing lab results within the same admission. Most patients only have one admission in the MIMIC-III dataset: among the 46,522 patients only 7541 patients (16%) have more than one admission. Therefore, the conclusion will likely remain the same if we were to aggregate information from multiple admissions for the same patient.\n\nWe randomly split the total 58,903 admissions into 80% for training and 20% for testing. For the training set, we trained our MixEHR to learn the topic distribution and the 50-topic mixture memberships for each training admission (Fig. 7a, step 1). We then iterated over the admissions in the test set. For every lab test observed in the test admission, we first masked its test result and imputed the test result as follows. We first inferred the 50-topic mixture memberships for each test admission using the topic distribution learned from the training set (Fig. 7a,  step 2). We then found the 25 most similar admissions to the test admission from the training set based on the Euclidean distance of their topic mixture memberships (Fig. 7a, step 3). These 25 admissions must have the target lab test observed. We then took the average of the frequency over the 25 most similar training admissions as our imputed lab result for the target lab test in the test admission.\n\nThis procedure was repeated for every lab test in every test admission. We recorded the predicted lab results and the true lab results for evaluation purposes. The same way was used to evaluate the CF-RBM method. As a comparison, we trained conditional factored Restricted Boltzmann Machine (CF-RBM) 5 with 100 hidden units only on the lab tests. For MixEHR and CF-RBM, we used 80% of the admissions for training and 20% of the admissions for testing. Here we did not distinguish whether the admissions came from the same patients but rather focused on imputing lab results within the same admission.\n\nTo further compare our proposed approach, we took a simpler imputation strategy by averaging. For each lab test, we took the average of the observed lab results over the training admissions. We then used the average frequency as the predictions for the lab results on the 20% testing admissions.\n\nMIMIC-III mortality prediction details. We first trained MixEHR on the~39 K patients with single-admissions to learn the disease topics. We used the trained MixEHR to infer topic mixture of each admission for the patients who had more than one admission. We took the last two admissions that are within 6 months apart, which gave us around 4000 multi-admission patients. We used the topic mixture inferred for the second-last admission as an input to a classifier to predict the mortality outcome at the discharge of the last admission (i.e., as indicated by the EXPIRED flag in the Discharge location of the last admission). To realistically evaluate our model, we filtered out Discharge Summary from the clinical notes in all of the data (under CATEGORY of the notes) because they usually contain conclusion about patients' critical conditions. We then performed a 5-fold crossvalidation to evaluate the prediction accuracy. We experimented with K = 50 and 75 topics. As baseline models, we tested LDA on a flattened EHR matrix over all six data types, Principal Component Analysis (PCA) with 50 Principal Components (PCs), Sparsity-inducing Collected Non-negative Matrix Factorization (SiCNMF) on the same input data 19 . We ran SiCNMF with the default settings with lower rank set to 20. Lastly, we trained elastic net directly on the raw input data from thẽ 4000 patients' second-last admission to predict the morality in their last admissions upon discharge.\n\nMoreover, we designed another experiment that used the earliest/first admission to predict the mortality in the last admission. We removed patients if their earliest admission lasted longer than 48 h based on the difference between the admission time and discharge time within the same admission. This also gave us 4040 patients whose first in-hospital stay was shorter than 2 days. Same as the above, we performed a fivefold CV on these patients as above using the pre-trained unsupervised models on the single-admission patients' data to generate topic mixtures on the first admissions as input to a supervised classifier (i.e., elastic net), which then predicts the mortality in the last admission upon discharge.\n\nReporting summary. Further information on research design is available in the Nature Research Reporting Summary linked to this article.\n\n\nData availability\n\nThe MIMIC-III data analyzed in this paper are publicly available through PhysioNet (http://mimic.physionet.org). Mayo Clinic and Quebec CHD data are not publicly accessible due to restricted user agreement.\n\n\n| (2020) 11:2536 | https://doi.org/10.1038/s41467-020-16378-3 | www.nature.com/naturecommunications\n\nFig. 3\n3Prioritize patients by disease mixture from MIMIC-III dataset. a Word clouds of the three topics with colors indicating different data types and font size proportional to the probabilities of the EHR codes under that topic. b We selected top 50 patients under three of the learned topics for illustration.\n\nFig. 4\n4Classification of bipolar disorder patients using the Mayo Clinic dataset. a Workflow to evaluate the classification accuracy of bipolar disorder in a fivefold cross-validation (CV). b Classification accuracy of fivefold CV in ROC and precision-recall curves. c Linear coefficients of the 20 topics ranked by decreasing order. d Inferred 20-topic mixture of 187 patients. The patients with and without bipolar disorder diagnosed were colored in red and green, respectively, on the left side of the dendrogram. | (2020) 11:2536 | https://doi.org/10.1038/s41467-020-16378-3 | www.nature.com/naturecommunications\n\n\nfacilitating clinicians' decision-making, (2) directing further/deeper phenotyping, (3) enabling personalized medical recommendations, and (4) aiding biomarker discovery. Specifically, MixEHR can infer the expected phenotypes of a patient conditioned only on a subset of clinical variables that are perhaps easier and cheaper to measure. Because new data are constantly entering the Mortality-predictive topics from MixEHR (K = 75) Mortality-predictive topics from LDA (K = 75)\n\nFig. 8\n8Mortality prediction using MIMIC-III dataset. Each unsupervised embedding method was trained on the patients with only one admission in the MIMIC-III data. The trained model was then applied to embed the second-last admission from patients with at least two admissions that are within 6 months apart. An elastic net (EN) classifier was trained to predict the mortality outcome in the last admission. This was performed in a fivefold crossvalidation setting. a Precision-recall curve (PRC) were generated, and the area under of the PRC (AUPRC) were displayed in the legend for each embedding method. EN represents the performance of elastic net using the raw EHR features. b Linear coefficients for the topics from MixEHR and LDA. The top three and bottom three topics are highlighted. c Topic clinical features for the top three most positively predictive topics and three most negatively predictive topics based on the elastic net coefficients for the 75 latent disease topics from MixEHR. d Same as c, but for the top predictive topics from LDA. | (2020) 11:2536 | https://doi.org/10.1038/s41467-020-16378-3 | www.nature.com/naturecommunications\n\n\n¼w kw and the local variables for the lab data, including latent topic, lab result, and observation indicator:h lj $ Mulðθ j Þ : Y k θ ½h lj ¼k jk; y lj $ Mulðη lh lj Þ : v ; r lj $ Binðψ lh lj Þ : ψ r lj lh lj ð1 À ψ lh lj Þ 1Àr lj where Gam(. ), Dir(. ), Bet(. ), Mul(. ), and Bin(. ) denote gamma, Dirichlet, beta, multinomial, and Binomial distributions, respectively.\n\n\nnotation n −(i, j) indicate the exclusion of variable index i, j. The sufficient statistics in the above inference have closed-form expression conditioned on the other latent variables:\n\n\nlj ¼ 1log X kθ jk ðψ lk þη lky lj Þð23Þwhere we inferred the variational expectations of the disease mixture and disease\n\n\nEHR learning from diverse evidence typesFig. 1MixEHR model overview. a Multi-view matrix factorization of multiple data matrices corresponding to different EHR data types, including lab tests, billing code, doctor notes, etc. b Proposed Bayesian model for modeling non-missing-at-random (NMAR) lab tests and other multimodal data. In order to achieve tractable inference, we assign a latent topic h lj to the lab results y lj and missing indicator (r lj ) such that they become conditionally independent. c Collapsed variational Bayesian inference of the MixEHR model. The inference and learning can be visualized as marginalizing a three-dimensional tensor that represents the expectations of the latent variables.Fig. 2 Disease topics from MIMIC-III dataset. a Top five EHR codes for select disease topics from the 75-topic MixEHR model. The rows are the top features, and columns are the topics. The color intensities indicate the inferred probabilities of these features belonging to each topic. b Age-correlated disease topics. Top three EHR codes were displayed for the top three most and least age-correlated topics. c Top correlated EHR codes with schizophrenia and PTSD.Patients \n\nLoading matrix \n\nMeta-phenotypes \nPatients \n\nMulti-view phenotypes \nVocab \nDoctor notes \n\nLab \nLab tests \n\nPrescriptions \nDrg \n\nTreatments \nTmt \nBasis matrices \n\nICD \nBilling \ncodes \n\nMixEHR probabilistic model \n\nCollapsed variational bayesian inference \n\nMeta-phenotypes \n\n... \n\n... \n\nPatients \n\nE H R \np h e n o t y p e s \no r la b t e s t s \nL a t e n t \n\nm e t a -p h e n o t y p e \n\n1. Marginalize \nlatent meta-phenotype \ndimension \n2. Marginalize \nEHR phenotype \nor lab test dimension \n\n3. marginalize \npatient dimension \n\nJ (t) \n\nijk \n\nEHR lab 1, state 1 \nEHR lab 1, state 2 \nEHR lab 1, state 3 \nEHR lab 2, state 1 \nEHR lab 2, state 2 \nEHR lab 3, state 1 \nEHR lab 3, state 2 \nEHR lab 5, state 1 \nEHR lab 5, state 2 \n\n... \n... \n\n... \n\nEHR phe 1 \nEHR phe 2 \nEHR phe 3 \nEHR phe 4 \nEHR phe 5 \nEHR phe 6 \nEHR phe 7 \nEHR phe 8 \nEHR phe 9 \n\nEHR phe 1 \nEHR phe 2 \nEHR phe 3 \nEHR phe 4 \nEHR phe 5 \nEHR phe 6 \nEHR phe 7 \nEHR phe 8 \nEHR phe 9 \nEHR phe 10 \nEHR phe 11 \nEHR phe 12 \nEHR lab 1 \nEHR lab 2 \nEHR lab 3 \nEHR lab 4 \nEHR lab 5 \nEHR lab 6 \nEHR lab 7 \nEHR lab 8 \nEHR lab 9 \nEHR lab 10 \nEHR lab 11 \nEHR lab 12 \nMeta-phenotype 1 \nMeta-phenotype 2 \nMeta-phenotype 3 \nMeta-phenotype 4 \nMeta-phenotype 5 \nMeta-phenotype 6 \nMeta-phenotype 7 \nMeta-phenotype 8 \nMeta-phenotype 9 \nMeta-phenotype 10 \nMeta-phenotype 11 \nMeta-phenotype 12 \n\n... \n... \n\n... \n\nE q [m lj×k v ] \n\nE q [n i×jk ] \n\n(t) \n\nE q [n wj ×k ] \n\nEHR phenotypes \n\nEHR phenotypes \n\nEHR lab tests \n\nPatients \n\n... \n\n... \n\nEHR lab tests \n\n... \n\n... \n\nT \n\nx: EHR phenotype \ny: lab test \n\nm: number of patients for lab results \nn: number of patients for phenotype \n\nt: evidence-type index \nw: phenotype word index \n\ni: phenotype token index (AD, IBD...) \nj: patient index (patient ID) \nk: topic index (meta-phenotype) \nl: lab index (e.g. lipids, cell counts) \nv: lab result discrete category index \n(e.g. normal, abnormal, 1-5, M/F) \n\nq: proposed variational distribution \n(e.g. Mean Field Factorization) \n*: integrate over preceding variable \n\n... \n\nPatient 1 \nPatient 2 \nPatient 3 \nPatient 4 \nPatient 5 \nPatient 6 \nPatient 7 \nPatient 8 \nPatient 9 \n\ny \nr \n\nT \n\nz \nK \nh \n\nClinical \nphenotypes \n\nMissing \nlab test \nindicator \n\n(Partially \nobserved) \nlab results \n\nPhenotype \nfrequency \n(prior) \n\n< \n\nLab measured \nfrequency \n\nPatient meta-phenotype \nmixture membership \n\nPatient-lab \nlatent variable \n\nPatient-phenotype \nlatent variable \n\nx \n\n) \n\nICD -9 \n\na \n\nc \n\nb \n\nT \n\nE q [y Ij ] \n\n(t ) \n\nE q [x Ij ] \n\nRisperidone,risperidone (021154,50458030001) \n\nLithium carbonate,lithium carbonate cr \n\nBipol i currnt manic nos (29640) \n\nAcc poison−hormones (E8580) \n\nPoison−medicinal agt nec (9778) \n\nDivalproex (delayed release),divalproex (delay \nParanoid schizo−chronic (29532) \n\nSalicyl \n\nPsychot \n\nDigestive tract xray nec (8769) \n\nRisperidone,risperidone oral solution \n\nSchizoaffective dis nos (29570) \n\nHip synovectomy (8075) \n\nPsyc \n\nNicoderm cq,nicotine (016427,766145010) \n\nPsych \n\nClonazepam,clonazepam (004561,4005850) \n\nCogentin \n\nBipolar \n\nPoison−tranquilizer nec (9695) \n\nToxic effect caustic nos (9839) \n\nSchizophrenia \n\nSchizophrenia nos−unspec (29590) \n\nDelusion \n\n0 \n10 \n20 \n30 \nCorrelation score \n\ntype \n\nNotes \n\nicd_cm \n\nicd_cpt \n\nPresc \n\nDrg \n\nPositive \ncorrelation \n\nNegative \ncorrelation \n\nCardiovascular \n\nNeonate \n\nHeart failure \n\nDementia \n\nNeo \n\nPreterm birth \n\nTopics correlated with age \n\n20 \n30 \n\nToxic effects of non−medicinal substances (APR,8163,3,1) \n\nEpisodic mood disord nos (29690) \n\nToxic effects of non−medicinal substances (APR,8163,3,4) \n\nSchizophrenia (APR,7502,2,2) \n\nBipolar disorders (APR,7532,2,2) \n\nToxic effects of non−medicinal substances (APR,8162,2,2) \n\nAcc poison−antidepressnt (E8540) \n\nAcc poisn−muscl/resp agt (E8586) \n\nHx of physical abuse (V1541) \n\nDegenerative nervous system disorders exc mult sclerosis \n\nZiprasidone,ziprasidone (047568,49399041) \n\nAcc poison−cleanser nos (E8619) \n\nToxic effects of non−medicinal substances (APR,8162,2,1) \n\nAripiprazole,aripiprazole (051334,59148000935) \n\nRisperidone,risperidone (021155,60505258700) \n\nBuspar \n\nNontraumatic stupor & coma (APR,522,2,3) \n\nBuspirone,buspirone (003781,51079098620) \n\nAripiprazole,aripiprazole (051333,59148000835) \n\nApap \n\nUndeterm pois−barbiturat (E9801) \n\nAbilifi \n\nPosttraumatic stress dis (30981) \n\nPtsd \n\n0 \n10 \n40 \nCorrelation score \n\nSchizophrenia-associated codes \nPTSD-associated codes \n\nTopics correlated with psychiatric traits \n\nDisease topics corelated with age \n\nTop clinical features from select disease topics \n\nDisease topics \n\nCirrhosis \n\na \n\nb \n\nc \n\nPulmEm \n\nHIV \n\nDiabetes \n\nLeukemia \n\nDementia \n\nPsycho \n\nSelect topics learned \nfrom MIMIC-III EHR data \n\n\n\n\n296.52_BIPOLAR I DISORDER, MOST RECENT EPISODE (OR CURRENT) DEPRESS 296.80_BIPOLAR DISORDER, UNSPECIFIED 296.52_BIPOLAR I DISORDER, MOST RECENT EPISODE (OR CURRENT) DEPRESS 296.53_BIPOLAR I DISORDER, MOST RECENT EPISODE (OR CURRENT) DEPRESS 296.80_BIPOLAR DISORDER, UNSPECIFIED V17.0_FAMILY HISTORY OF PSYCHIATRIC CONDITION V62.84_SUICIDAL IDEATION 20606−ROCLIS_Creatinine, U (w/ADULT) 21651−ROCLIS_Amphetamines.Fig. 5 Phenome-wide association studies (PheWAS) of the 6776 EHR codes on the two bipolar disorder mixture topics (M7 and M19) based on the Mayo Clinic dataset. For each EHR code, we tested the difference between patient groups with and without that code in terms of M19 and M7 topic membership probabilities. The labeled EHR codes are the ones with Wilcoxon signed-rank one-sided test p-values < 0.001. The red, blue, and black color indicate the codes that are significant in only M19, in only M7, and in both M19 and M7, respectively. PheWAS for the PPI questions are displayed in Supplementary Fig. 32.significantly higher accuracy compared to CF-RBM(Fig. 7b, c;Wilcoxon test p-value < 0.00013, Kolmogorov-Smirnov (KS) test p-value < 1.15 × 10 −5 )22312−ROCLIS_Specific Gravity... \n23509−ROCLIS_pH (w/CDAU) \n23511−ROCLIS_Oxidants \n\n23591−ROCLIS_Benzodiazepines. \n\n2574−ROCLIS_Barbiturates \n\n2576−ROCLIS_Cocaine, U \n2577−ROCLIS_Opiates, U \n\n2578−ROCLIS_Phencyclidine, U \n2579−ROCLIS_Tetrahydrocannabinol, U \n\n2897−ROCLIS_25−Hydroxy D2 \n\n2898−ROCLIS_25−Hydroxy D3 \n\n30909−ROCLIS_Alcohol, U \n\n83670−ROCLIS_25−Hydroxy D Total \n\n89115−ROCLIS_Glucose, Random, S \n\n9198−ROCLIS_Folate(S) \n\n20606−ROCLIS_Creatinine, U (w/ADULT) \n\n21651−ROCLIS_Amphetamines. \n\n22312−ROCLIS_Specific Gravity... \n\n23509−ROCLIS_pH (w/CDAU) \n\n23511−ROCLIS_Oxidants \n\n23591−ROCLIS_Benzodiazepines. \n\n2574−ROCLIS_Barbiturates \n\n2576−ROCLIS_Cocaine, U \n\n2577−ROCLIS_Opiates, U \n2578−ROCLIS_Phencyclidine, U \n\n2579−ROCLIS_Tetrahydrocannabinol, U \n\n30909−ROCLIS_Alcohol, U \n\n81793−ROCLIS_BUN (Bld Urea Nitrogen) \n\n8384−ROCLIS_Lithium, S \n\n89115−ROCLIS_Glucose, Random, S \n\nZ4559−ROCLIS_CYP2D6 Genotype. \n\nZ4560−ROCLIS_CYP2D6 Phenotype.... \nZ4561−ROCLIS_CYP2C19 Genotype. \n\nZ4562−ROCLIS_CYP2C19 Phenotype.. \n\nZ4569−ROCLIS_CYP1A2 Genotype. \nZ4571−ROCLIS_SLC6A4 Genotype \nZ4572−ROCLIS_SLC6A4 Phenotype \n\nZ4573−ROCLIS_HTRA2 Genotype \n\nZ4574−ROCLIS_HTRA2 Phenotype \n\nAbilify \nClonazepam \n\nLithium carbonate \n\nLorazepam \n\nQuetiapine \n\nAbilify \n\nClonazepam \n\nDivalproex \n\nLamictal \n\nLithium carbonate \nLorazepam \n\nOlanzapine \n\nQuetiapine \n\nIcd \nLabs \nmeds \n\nM7 \n\nM19 \n\n2 \n\n4 \n\n6 \n\n0.0 \n\n2.5 \n\n5.0 \n\n0 \n\n7.5 \n\nEHR code \n\nOne−sided wilcox test (−log10 P) \n\na \na \na \n\nM19 − M7 \nM7 − M19 \nM7 & M19 \n\n\n\n\nDiagnostic code prediction using the MIMIC-III and Quebec CHD datasets. a Proposed MixEHR+RNN framework for predicting medical code from the MIMIC-III data. b Medical code-prediction accuracy. We evaluated the prediction accuracy of the 42 common Clinical Classification Software (CCS) medical codes comparing MixEHR with Doctor AI and GRAM. For each medical code, the accuracy was calculated by the true positives among the top 20 predicted codes divided by the total number of positives. The dots are individual accuracies for each code predicted by each method. c Proposed MixEHR +RNN framework for predicting the ICD code on Quebec CHD database. d Prediction accuracies in terms of area under the precision-recall curve (AUPRC) and area under the ROC curve (AUROC) over all of the 1098 3-digit ICD codes. The center line, bounds, and whiskers of the boxplots are median, first and third quartiles, and outlier, respectively. Wilcoxon signed-rank one-sided tests were performed to calculate the p-values with the alternative hypothesis set to that AUCs from MixEHR+RNN are greater than the AUCs from the baseline RNN.Dynamic EHR code prediction on MIMIC-III data \n\nPredicted EHR code \nat admission t + 1 for patient j \n\nGRU × 2 \n\nDense \n\nMixEHR \n\n{Notes, ICD-9, DRG, \nprescription, procedure, \nlab tests} at admission t \nfor patient j \n\n... \n... \n\nPredicted EHR code \nat admission t + k for patient j \n\nGRU × 2 \n\na \nb \n\nc \nd \n\nDense \n\nMixEHR \n\n{Notes, ICD-9, DRG, \nprescription, procedure, \nlab tests} at admission t + k-1 \nfor patient j \n\n... \n\nEHR code prediction accuracy on MIMIC-III \n\nCode prediction on quebec CHD data \nPrediction accuracy on quebec CHD data \n\nPRC \nROC \n\nR \nN \nN \n\nM \ni x E H \n\nR \n+ R \n\nN \nN \nR \nN \nN \n\nM \ni x E H \n\nR \n+ R \n\nN \nN \n\n0.00 \n\n0.25 \n\n0.50 \n\n0.75 \n\n1.00 \n\n0.0 \n\n0.2 \n\n0.4 \n\n0.6 \n\n0.8 \n\nArea under the curve \n\nWilcoxon one-sided test \np < 5.35e-55 \n\nWilcoxon one-sided test \np < 0.0408 \n\nInput data at admission t \nfor patient j \n\npredicted 3-digit ICD code \nat admission t + 1 \n\nGRU × 2 \n\nICD-CM \n\nDense \n\nOutput \n\nProcedure \n\nMixEHR \n\n... \n\nInput data at admission t + k-1 \nfor patient j \n\npredicted 3-digit ICD code \nat admission t + k \n\nGRU × 2 \n\nICD-CM \n\nDense \n\nOutput \n\nProcedure \n\nMixEHR \n\n... \n\n20.3% \n\n57.0% \n\n59.7% \n\n0.0 \n\n0.2 \n\n0.4 \n\n0.6 \n\nDoctorAI \nGRAM MixEHR+ RNN \n\nAccuracy \n\nDoctorAI \n\nGRAM \n\nMixEHR+RNN \n\nFig. 6 \n\n\nFig. 7Lab results imputation using MIMIC-III dataset. a Workflow to impute lab results.Step 1: We modeled lab tests, lab test results, and non-lab EHR data (i.e., ICD, notes, prescription, treatment) to infer the patient topic mixture.Step 2: For a test patient, we masked each of his observed lab test result t, and inferred his topic mixture.Step 3: We then found k = 25 patients who have the lab test results t observed and exhibit the most similar topic mixture to the test patient. We then took the average of lab result values over the k patients as the prediction of the lab result value for the test patient j 0 . Steps 1-3 were repeated to evaluate every observed lab test in every test patient. b We compared the imputation accuracy between MixEHR and CF-RBM. We generated the cumulative density function (CDF) of accuracy as well as the boxplot distributions (inset) for each method. The center line, bounds, and whiskers of the boxplots are median, first and third quartiles, and outlier, respectively. In both cases, MixEHR significantly outperformed CF-RBM based on KS test (p < 1.15e-5) and Wilcoxon signed-rank one-sided test (p < 0.00013). c CF-RBM versus MixEHR scatterplot in terms of imputation accuracy.Evaluation design for imputing lab results \nLab result imputation accuracy \n\nCF-RBM versus MixEHR accuracy \n\n1. Training step: learning disease topics \n\n3. Predict target code t from K nearest training patients \n\nX′ train \n′ train \n\nTopics \n\nTest patient \nmixture \n\nj′ \n\ntest \n\nFind K nearest \ntraining patients \n\n2. Testing step: inferring test patient mixture \n\nEHR features \nTopics \n\nj′ \n\ntest \n\nTrain patients \n\nTarget lab result \nt \n\nTopics \n\nTrain patients \n\nTopics \nPatients \n\na \nb \n\nc \n\nLab \nLab missing indicator \n\nLab results (normal) \n\nLab results (abnormal) \n\nLab \n\nLab \nLab test information \n\ntrain \n\nNon-Lab EHR data \n\nword \nDoctor notes \n\nMed \n\nTreatments \nTmt \n\nICD \nBilling codes \n\nPrescriptions \n\nLearned topics \n\nTest patient j′ \n\nMissing lab result t \n\n0.00 \n\n0.25 \n\n0.50 \n\n0.75 \n\n1.00 \n\n0.00 \n0.25 \n0.50 \n0.75 \n1.00 \n\nAccuracy \n\nCumulative density \n\nModel \n\nCF−RBM \n\nMixEHR \n\n0.00 \n\n0.25 \n\n0.50 \n\n0.75 \n\n1.00 \n\nCF−RBM \nMixEHR \n\naccuracy \n\nWilcox test p val < 0.00013 \n\nKS test p-val < 1.15e-05 \n\nICD -9 \n\n\n\n\nNote that we use y ljv to denote the frequency of observing the lab test l of outcome v for patient j and [y lj = v] as binary indicator of a single test. Detailed derivations are in Supplementary Methods.KL½qðz; hÞjjpðz; hjx; y; rÞ ¼ E qðz;hÞ ½log qðz; hÞ À E qðz;hÞ ½log pðz; h; x; y; rÞþ log pðx; y; rÞ because log pðx; y; rÞ is constant and KL½qðz; hÞjjpðz; hjx; y; rÞþ L ELBO ¼ log pðx; y; rÞ.Under mean-field factorization, the proposed distribution of latent variables z and h are defined as:log qðzjγÞ ¼ ij ¼ klog γðtÞijk ; log qðhjλÞ ¼Joint collapsed variational Bayesian inference. The marginal likelihood can be \napproximated by evidence lower bound (ELBO): \n\nlog pðx; y; rjα; β; ζ; a; bÞ ¼ log \n\nX \n\nz;h \n\npðx; y; r; z; hjα; β; ζ; a; bÞ \nqðz; hÞ \nqðz; hÞ \nð4Þ \n\n≥ \nX \n\nz;h \n\nqðz; hÞlog pðx; y; r; z; hjα; β; ζ; a; bÞ À \n\nX \n\nz;h \n\nqðz; hÞlog qðz; hÞ \nð5Þ \n\n¼ E qðz;hÞ ½log pðx; y; r; z; hjα; β; ζ; a; bÞ À E qðz;hÞ ½log qðz; hÞ L ELBO \nð6Þ \n\nEqs. (4) to (5) follows Jensen's inequality. Maximizing L ELBO is equivalent to \nminimizing Kullback-Leibler (KL) divergence: \n\nX \n\nt;i;j;k \n\n½z \n\nðtÞ \n\nX \n\nl;j;k \n\n\n\n\nwith respect to the variational parameter γ ðtÞ ijk and λ ljk is equivalent to calculating the expectation of z ðtÞ ij ¼ k and h lj = k with respect to all of the other latent variables 13,41 :log qðz ðtÞ ij ¼ kÞ ¼ E qðz Àði;jÞ Þ ½log pðx; zÞ; log qðh lj ¼ kÞ ¼ E qðh Àðl;jÞ Þ ½log pðy; r; hÞ ð8ÞExponentiating and normalizing the distribution of qðz \n\nðtÞ \n\nij ¼ kÞ and q(h lj = k) gives \n\nγ \n\nðtÞ \n\nijk ¼ \n\nexpðE qðz Àði;jÞ Þ ½log pðx; z Àði;jÞ ; z ij ¼ kÞÞ \nP \nk 0 expðE qðz Àði;jÞ Þ ½log pðx; z Àði;jÞ ; z ij ¼ k 0 ÞÞ \n\nð9Þ \n\nλ ljk ¼ \nexpðE qðh Àðl;jÞ Þ ½log pðy; r; h Àði;jÞ ; h ij ¼ kÞÞ \nP \nk 0 expðE qðh Àðl;jÞ Þ ½log pðy; r; h Àði;jÞ ; h ij ¼ k 0 ÞÞ \n\nð10Þ \n\nWe can approximate these expectations by first deriving the conditional \ndistribution for pðz \n\nðtÞ \n\nij ¼ kjx; y; rÞ and p(h lj = k|x, y, r) (Supplementary Methods) \nand then using Gaussian distributions to approximate the sufficient statistics by the \nsummation of the variational parameters in zero-order Taylor expansion 13,14 : \n\nγ \n\nðtÞ \n\nijk / α k þñ \n\nÀði;jÞ \n:jk \n\nþm :jk \n\n\nβ tx ðtÞ \n\nij \n\nþñ \n\nðtÞ \n\nx \n\nðtÞ \n\nij :k \n\n! Àði;jÞ \n\nP \nw β wt þñ \n\nðtÞ \nw:k \n\nh \ni Àði;jÞ \n\n\nNATURE COMMUNICATIONS | https://doi.org/10.1038/s41467-020-16378-3\nNATURE COMMUNICATIONS | (2020) 11:2536 | https://doi.org/10.1038/s41467-020-16378-3 | www.nature.com/naturecommunications\n© The Author(s) 2020\nCode availabilityWe implemented MixEHR in C++ as a standalone Unix command-line software using OpenMP for multi-threaded inference. It allows an arbitrary number of discrete data types and discrete states per EHR feature. The software is available as Supplementary Software 1 or at https://github.com/li-lab-mcgill/mixehr. The funding for the Mayo Clinic bipolar disorder study is provided by Marriott Foundation. Mayo Clinic Center is funded by Individualized Medicine. The Québec CHD Database is funded by Dr. Marelli's Canadian Institute of Health Research Foundation Grant Award #35223. We thank Mathieu Blanchette for the helpful comments on the paper.Competing interestsThe authors declare no competing interests.Additional informationSupplementary information is available for this paper at https://doi.org/10.1038/s41467-020-16378-3.Correspondence and requests for materials should be addressed to Y.L. or M.K.Peer review information Nature Communications thanks Yanshan Wang and the other, anonymous, reviewer(s) for their contribution to the peer review of this work.Reprints and permission information is available at http://www.nature.com/reprintsPublisher's note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations.Open Access This article is licensed under a Creative Commons Attribution 4.0 International License, which permits use, sharing, adaptation, distribution and reproduction in any medium or format, as long as you give appropriate credit to the original author(s) and the source, provide a link to the Creative Commons license, and indicate if changes were made. The images or other third party material in this article are included in the article's Creative Commons license, unless indicated otherwise in a credit line to the material. If material is not included in the article's Creative Commons license and your intended use is not permitted by statutory regulation or exceeds the permitted use, you will need to obtain permission directly from the copyright holder. To view a copy of this license, visit http://creativecommons.org/ licenses/by/4.0/.\nMIMIC-III, a freely accessible critical care database. A E W Johnson, Sci. Data. 3Johnson, A. E. W. et al. MIMIC-III, a freely accessible critical care database. Sci. Data 3, 160035-1600359 (2016).\n\nAdoption of electronic health record systems among US non-federal acute care hospitals. D Charles, M Gabriel, M F Furukawa, ONC Data Brief. 9Charles, D., Gabriel, M. & Furukawa, M. F. Adoption of electronic health record systems among US non-federal acute care hospitals: 2008-2012. ONC Data Brief. 9, 1-9 (2013).\n\nAdoption of electronic health record systems among US non-federal acute care hospitals. J Henry, Y Pylypchuk, T Searcy, V Patel, ONC data brief. 35Henry, J., Pylypchuk, Y., Searcy, T. & Patel, V. Adoption of electronic health record systems among US non-federal acute care hospitals: 2008-2015. ONC data brief. 35, 1-9 (2016).\n\nLatent dirichlet allocation. D M Blei, A Y Ng, M I Jordan, J. Mach. Learn. Res. 3Blei, D. M., Ng, A. Y. & Jordan, M. I. Latent dirichlet allocation. J. Mach. Learn. Res. 3, 993-1022 (2003).\n\nRestricted Boltzmann machines for collaborative filtering. R Salakhutdinov, A Mnih, G Hinton, Proceedings of the 24th International Conference on Machine Learning. the 24th International Conference on Machine LearningNew YorkACM PressSalakhutdinov, R., Mnih, A. & Hinton, G. Restricted Boltzmann machines for collaborative filtering. Proceedings of the 24th International Conference on Machine Learning. In ACM Press (ed. Ghahramani, Z.) 791-798 (New York, 2007).\n\nProbabilistic matrix factorization. A Mnih, R R Salakhutdinov, Advances in Neural Information Processing Systems. Platt, J. C., Koller, D., Singer, Y. & Roweis, S. TMIT PressMnih, A. & Salakhutdinov, R. R. Probabilistic matrix factorization. Advances in Neural Information Processing Systems, In MIT Press (eds Platt, J. C., Koller, D., Singer, Y. & Roweis, S. T.) 1257-1264 (2008).\n\nProbabilistic matrix factorization with non-random missing data. J M Hernandez-Lobato, N Houlsby, Z Ghahramani, Proceedings of the 31th International Conference on Machine Learning. Xing, E. P. & Jebara, T. S.the 31th International Conference on Machine Learning32JMLRHernandez-lobato, J. M., Houlsby, N. & Ghahramani, Z. Probabilistic matrix factorization with non-random missing data. Proceedings of the 31th International Conference on Machine Learning. In JMLR (eds Xing, E. P. & Jebara, T. S.) 32, 1512-1520 (2014).\n\nCollaborative prediction and ranking with nonrandom missing data. B M Marlin, R S Zemel, The Proceedings of the third ACM conference on Recommender systems. Burke, R., Felfernig, A. & Schmidt-Thieme, L.New YorkACM PressMarlin, B. M. & Zemel, R. S. Collaborative prediction and ranking with non- random missing data. The Proceedings of the third ACM conference on Recommender systems, In ACM Press (eds Burke, R., Felfernig, A. & Schmidt- Thieme, L.) 5-12 (New York, 2009).\n\nCollaborative filtering and the missing at random assumption. G Fraser, R Yan, Epidemiology. 18Fraser, G. & Yan, R. Collaborative filtering and the missing at random assumption. Epidemiology 18, 1-9 (2016).\n\nSupervised topic models. J D Mcauliffe, D M Blei, Advances in Neural Information Processing Systems. Platt, J. C., Koller, D., Singer, Y. & Roweis, S. TCurran Associates, Inc20Mcauliffe, J. D. & Blei, D. M. Supervised topic models. In Advances in Neural Information Processing Systems (eds Platt, J. C., Koller, D., Singer, Y. & Roweis, S. T.) Vol. 20, 121-128 (Curran Associates, Inc., 2008).\n\nProbabilistic topic models. D M Blei, Commun. ACM. 55Blei, D. M. Probabilistic topic models. Commun. ACM 55, 77-84 (2012).\n\nFinding scientific topics. T L Griffiths, M Steyvers, Proc. Natl Acad. Sci. USA. 101Supplement 1Griffiths, T. L. & Steyvers, M. Finding scientific topics. Proc. Natl Acad. Sci. USA 101 (Supplement 1), 5228-5235 (2004).\n\nA collapsed variational bayesian inference algorithm for latent dirichlet allocation. Y W Teh, D Newman, M Welling, Advances in Neural Information Processing Systems. Schölkopf, B., Platt, J. C. & Hoffman,MIT Press19Teh, Y. W., Newman, D. & Welling, M. A collapsed variational bayesian inference algorithm for latent dirichlet allocation. in Advances in Neural Information Processing Systems (eds Schölkopf, B., Platt, J. C. & Hoffman, T.) Vol. 19, 1353-1360 (MIT Press, 2007).\n\nOn smoothing and inference for topic models. A Asuncion, M Welling, P Smyth, Y W Teh, Proceedings of the Twenty-Fifth Conference on Uncertainty in Artificial Intelligence UAI '09. Bilmes, J. & Ng, A.the Twenty-Fifth Conference on Uncertainty in Artificial Intelligence UAI '09Arlington, VAAUAI PressAsuncion, A., Welling, M., Smyth, P. & Teh, Y. W. On smoothing and inference for topic models. Proceedings of the Twenty-Fifth Conference on Uncertainty in Artificial Intelligence UAI '09, In AUAI Press (eds Bilmes, J. & Ng, A.) 27-34 (Arlington, VA, 2009).\n\nStatistical Analysis with Missing Data. R J A Little, D B Rubin, John Wiley & SonsLittle, R. J. A. & Rubin, D. B. Statistical Analysis with Missing Data (John Wiley & Sons, 2014).\n\nY Halpern, S Horng, F Doshi-Velez, J Fackler, D Kale, B Wallace, J Wiens, Proceedings of the 1st Machine Learning for Healthcare Conference. & Sontag, D.the 1st Machine Learning for Healthcare Conference56Halpern, Y., Horng, S. & Sontag, D. (eds Doshi-Velez, F., Fackler, J., Kale, D., Wallace, B. & Wiens, J.) in Proceedings of the 1st Machine Learning for Healthcare Conference. PMLR 56, 209-225. (2016).\n\nIdentifiable phenotyping using constrained non-negative matrix factorization. S Joshi, S Gunasekar, D Sontag, J Ghosh, F Doshi-Velez, J Fackler, D Kale, B Wallace, J Wiens, PMLRProceedings of the 1st Machine Learning for Healthcare Conference. the 1st Machine Learning for Healthcare Conference56Joshi, S., Gunasekar, S., Sontag, D. & Ghosh, J. Identifiable phenotyping using constrained non-negative matrix factorization. Proceedings of the 1st Machine Learning for Healthcare Conference. In PMLR (eds Doshi-Velez, F., Fackler, J., Kale, D., Wallace, B. & Wiens, J.) 56, 17-41 (2016).\n\nLearning probabilistic phenotypes from heterogeneous EHR data. R Pivovarov, J. Biomed. Inform. 58Pivovarov, R. et al. Learning probabilistic phenotypes from heterogeneous EHR data. J. Biomed. Inform. 58, 156-165 (2015).\n\nPhenotyping using structured collective matrix factorization of multi-source EHR data. S Gunasekar, Preprint atGunasekar, S. et al. Phenotyping using structured collective matrix factorization of multi-source EHR data. Preprint at https://arxiv.org/abs/ 1609.04466 (2016).\n\nA latent variable model for chemogenomic profiling. P Flaherty, G Giaever, J Kumm, M I Jordan, A P Arkin, Bioinformatics. 21Flaherty, P., Giaever, G., Kumm, J., Jordan, M. I. & Arkin, A. P. A latent variable model for chemogenomic profiling. Bioinformatics 21, 3286-3293 (2005).\n\nDetecting time-evolving phenotypic topics via tensor factorization on electronic health records cardiovascular disease case study. J Zhao, J. Biomed. Inform. 98103270Zhao, J. et al. Detecting time-evolving phenotypic topics via tensor factorization on electronic health records cardiovascular disease case study. J. Biomed. Inform. 98, 103270 (2019).\n\nUnsupervised machine learning for the discovery of latent disease clusters and patient subgroups using electronic health records. Y Wang, J. Biomed. Inform. 102103364Wang, Y. et al. Unsupervised machine learning for the discovery of latent disease clusters and patient subgroups using electronic health records. J. Biomed. Inform. 102, 103364 (2020).\n\nThe application of unsupervised deep learning in predictive models using electronic health records. L Wang, L Tong, D Davis, T Arnold, T Esposito, BMC Med. Res. Methodol. 20Wang, L., Tong, L., Davis, D., Arnold, T. & Esposito, T. The application of unsupervised deep learning in predictive models using electronic health records. BMC Med. Res. Methodol. 20, 1-9 (2020).\n\nTemporal convolutional neural networks for diagnosis from lab tests. N Razavian, D Sontag, Preprint atRazavian, N. & Sontag, D. Temporal convolutional neural networks for diagnosis from lab tests. Preprint at https://arxiv.org/abs/1511.07938 (2015).\n\nRisk prediction with electronic health records: a deep learning approach. Y Cheng, F Wang, P Zhang, J Hu, 2016 SIAM International Conference. Venkatasubramanian, S. & Meira, W.SIAMCheng, Y., Wang, F., Zhang, P. & Hu, J. Risk prediction with electronic health records: a deep learning approach. In 2016 SIAM International Conference. (eds Venkatasubramanian, S. & Meira, W.) 432-440 (SIAM, 2016).\n\nLearning to diagnose with LSTM recurrent neural networks. Z C Lipton, D C Kale, C Elkan, R R Wetzel, Preprint atLipton, Z. C., Kale, D. C., Elkan, C. & Wetzel, R. R. Learning to diagnose with LSTM recurrent neural networks. Preprint at https://arxiv.org/abs/1511.03677 (2015).\n\nDoctor AI: predicting clinical events via recurrent neural networks. E Choi, M T Bahadori, A Schuetz, W F Stewart, J Sun, JMLR Workshop Conf. Proc. 56Choi, E., Bahadori, M. T., Schuetz, A., Stewart, W. F. & Sun, J. Doctor AI: predicting clinical events via recurrent neural networks. JMLR Workshop Conf. Proc. 56, 301-318 (2016).\n\nA Convolutional Net for Medical Records. P Nguyen, T Tran, N Wickramasinghe, S Venkatesh, Deepr, IEEE Journal of Biomedical and Health Informatics. 21Nguyen, P., Tran, T., Wickramasinghe, N. & Venkatesh, S. Deepr: A Convolutional Net for Medical Records. in IEEE Journal of Biomedical and Health Informatics. 21, 22-30 (2017).\n\nDeep patient: an unsupervised representation to predict the future of patients from the electronic health records. R Miotto, L Li, B A Kidd, J T Dudley, Sci. Rep. 6Miotto, R., Li, L., Kidd, B. A. & Dudley, J. T. Deep patient: an unsupervised representation to predict the future of patients from the electronic health records. Sci. Rep. 6, 1-10 (2016).\n\nThe use of autoencoders for discovering patient phenotypes. H Suresh, P Szolovits, M Ghassemi, Preprint atSuresh, H., Szolovits, P. & Ghassemi, M. The use of autoencoders for discovering patient phenotypes. Preprint at https://arxiv.org/abs/1703.07004 (2017).\n\nScalable and accurate deep learning with electronic health records. A Rajkomar, npj Digital Med. 118Rajkomar, A. et al. Scalable and accurate deep learning with electronic health records. npj Digital Med. 1, 18 (2018).\n\nGRAM: graphbased attention model for healthcare representation learning. E Choi, M T Bahadori, L Song, W F Stewart, J Sun, Proceedings of the ACM SIGKDD International Conference on Knowledge Discovery and Data Mining. Matwin, S., Yu, S. & Farooq, F.the ACM SIGKDD International Conference on Knowledge Discovery and Data MiningSacramento, New York, NYSutter HealthChoi, E., Bahadori, M. T., Song, L., Stewart, W. F. & Sun, J. GRAM: graph- based attention model for healthcare representation learning. Proceedings of the ACM SIGKDD International Conference on Knowledge Discovery and Data Mining. In ACM Press (eds Matwin, S., Yu, S. & Farooq, F.) 787-795 (Sutter Health, Sacramento, New York, NY, 2017).\n\nNeuropsychology of vitamin B12 deficiency in elderly dementia patients and control subjects. A Osimani, A Berger, J Friedman, B S Porat-Katz, J M Abarbanel, J. Geriatr. Psychiatry Neurol. 18Osimani, A., Berger, A., Friedman, J., Porat-Katz, B. S. & Abarbanel, J. M. Neuropsychology of vitamin B12 deficiency in elderly dementia patients and control subjects. J. Geriatr. Psychiatry Neurol. 18, 33-38 (2005).\n\nMice: multivariate imputation by chained equations in R. S Van Buuren, K Groothuis-Oudshoorn, J. Stat. Softw. 45van Buuren, S. & Groothuis-Oudshoorn, K. Mice: multivariate imputation by chained equations in R. J. Stat. Softw. 45, 1-67 (2011).\n\nMulti-layer representation learning for medical concepts. E Choi, The 22nd ACM SIGKDD International Conference. Aggarwal, C. & Smola, A.New York, NYACM PressChoi, E. et al. Multi-layer representation learning for medical concepts. The 22nd ACM SIGKDD International Conference. In ACM Press (eds Aggarwal, C. & Smola, A.) 1495-1504 (New York, NY, 2016).\n\nMarble: high-throughput phenotyping from electronic health records via sparse nonnegative tensor factorization. J C Ho, J Ghosh, J Sun, Proceedings of the 20th ACM SIGKDD International Conference on Knowledge Discovery and Data Mining KDD '14. Macskassy, S. & Perlich, C.the 20th ACM SIGKDD International Conference on Knowledge Discovery and Data Mining KDD '14New York, NYACM PressHo, J. C., Ghosh, J. & Sun, J. Marble: high-throughput phenotyping from electronic health records via sparse nonnegative tensor factorization. Proceedings of the 20th ACM SIGKDD International Conference on Knowledge Discovery and Data Mining KDD '14. In ACM Press (eds Macskassy, S. & Perlich, C.) 115-124 (New York, NY, 2014).\n\nRubik: knowledge guided tensor factorization and completion for health data analytics. Y Wang, R Chen, J Ghosh, J C Denny, A Kho, Proceedings of the 21th ACM SIGKDD International Conference on Knowledge Discovery and Data Mining. Cao, L. & Zhang, C.the 21th ACM SIGKDD International Conference on Knowledge Discovery and Data MiningNew York, NYACM PressWang, Y., Chen, R. Ghosh, J., Denny, J. C. & Kho, A. Rubik: knowledge guided tensor factorization and completion for health data analytics. Proceedings of the 21th ACM SIGKDD International Conference on Knowledge Discovery and Data Mining. In ACM Press (eds Cao, L. & Zhang, C.) 265-1274 (New York, NY, 2015).\n\nA framework for individualizing predictions of disease trajectories by exploiting multi-resolution structure. P Schulam, S Saria, C Cortes, N D Lawrence, D D Lee, M Sugiyama, R Garnett, Advances in Neural Information Processing Systems. Curran Associates, Inc28Schulam, P. & Saria, S. A framework for individualizing predictions of disease trajectories by exploiting multi-resolution structure. In Advances in Neural Information Processing Systems (eds Cortes, C., Lawrence, N. D., Lee, D. D., Sugiyama, M. & Garnett, R.) Vol. 28, 748-756 (Curran Associates, Inc., 2015).\n\nIntegrative analysis using coupled latent variable models for individualizing prognoses. P Schulam, S Saria, J. Mach. Learn. Res. 17Schulam, P. & Saria, S. Integrative analysis using coupled latent variable models for individualizing prognoses. J. Mach. Learn. Res. 17, 1-35 (2016).\n\nAn introduction to variational methods for graphical models. Learning in Graphical Models. M I Jordan, Z Ghahramani, T S Jaakkola, L K Saul, Springer (ed. Heckerman, D.Netherlands, DordrechtJordan, M. I., Ghahramani, Z., Jaakkola, T. S. & Saul, L. K. An introduction to variational methods for graphical models. Learning in Graphical Models. In Springer (ed. Heckerman, D.) 105-161 (Netherlands, Dordrecht, 1998).\n\nPattern recognition and machine learning. C M Bishop, Jordan, M., Kleinberg & J.SpringerInformation Science and StatisticsBishop, C. M. Pattern recognition and machine learning. Information Science and Statistics. Springer (eds Jordan, M., Kleinberg & J., Scholkopf, B.) 461-474 (2006).\n\nFinding scientific topics. T L Griffiths, M Steyvers, Proc. Natl Acad. Sci. USA. 1011SupplGriffiths, T. L. & Steyvers, M. Finding scientific topics. Proc. Natl Acad. Sci. USA 101 (Suppl 1), 5228-5235 (2004).\n\nEstimating a Dirichlet distribution. T Minka, MITTechnical ReportMinka, T. Estimating a Dirichlet distribution. Technical Report (MIT, 2000).\n\nStochastic variational inference. M D Hoffman, D M Blei, C Wang, J W Paisley, J. Mach. Learn. Res. 14Hoffman, M. D., Blei, D. M., Wang, C. & Paisley, J. W. Stochastic variational inference. J. Mach. Learn. Res. 14, 1303-1347 (2013).\n\nStochastic collapsed variational bayesian inference for latent dirichlet allocation. J Foulds, L Boyles, C Dubois, P Smyth, M Welling, R Grossman, R Uthurusamy, Proceedings of the 19th ACM SIGKDD international conference on Knowledge discovery and data mining. the 19th ACM SIGKDD international conference on Knowledge discovery and data miningNew York, NYACM PressFoulds, J., Boyles, L., Dubois, C., Smyth, P. & Welling, M. Stochastic collapsed variational bayesian inference for latent dirichlet allocation. Proceedings of the 19th ACM SIGKDD international conference on Knowledge discovery and data mining. In ACM Press (eds Grossman, R. & Uthurusamy, R.) 446-454 (New York, NY, 2013).\n\nText mining infrastructure in R. I Feinerer, K Hornik, D Meyer, J. Stat. Softw. 25Feinerer, I., Hornik, K. & Meyer, D. Text mining infrastructure in R. J. Stat. Softw. 25, 1-54 (2008).\n\nDevelopment of a bipolar disorder biobank: differential phenotyping for subsequent biomarker analyses. M A Frye, Int. J. Bipolar Disord. 330Frye, M. A. et al. Development of a bipolar disorder biobank: differential phenotyping for subsequent biomarker analyses. Int. J. Bipolar Disord. 3, 30 (2015).\n\nThe Mayo Clinic Biobank: a building block for individualized medicine. J E Olson, Mayo Clin. Proc. 88Olson, J. E. et al. The Mayo Clinic Biobank: a building block for individualized medicine. Mayo Clin. Proc. 88, 952-962 (2013).\n\nCongenital heart disease in the general population: changing prevalence and age distribution. A J Marelli, A S Mackie, R Ionescu-Ittu, E Rahme, L Pilote, Circulation. 115Marelli, A. J., Mackie, A. S., Ionescu-Ittu, R., Rahme, E. & Pilote, L. Congenital heart disease in the general population: changing prevalence and age distribution. Circulation 115, 163-172 (2007).\n\nLifetime prevalence of congenital heart disease in the general population from. A J Marelli, Author contributions Y.L. and M.K. conceived the initial idea. Y.L. developed and implemented the method. 130processed and analyzed the data, and wrote the initial draft of the paper. P.N. ran the experiments on the EHR code prediction and mortality prediction using MIMIC-III dataMarelli, A. J. et al. Lifetime prevalence of congenital heart disease in the general population from 2000 to 2010. Circulation 130, 749-756 (2014). Author contributions Y.L. and M.K. conceived the initial idea. Y.L. developed and implemented the method, processed and analyzed the data, and wrote the initial draft of the paper. P.N. ran the experiments on the EHR code prediction and mortality prediction using MIMIC-III data.\n\nprovided the Mayo Clinic dataset. E.R. performed the data extraction and de-identification of the EHR data for both the bipolar and the control cohorts. Y W , A A K D T O , J M B , J E O , M A F W L , Y M , Z W T O , J M B , E R , helped analyze the results. A.M. provided the data from Quebec CHD Database. A.L. and L.G. processed the data. X.H.L. implemented the MixEHR+RNN model and ran the experiments on the Quebec CHD Database with the help from Z.W. A.L. and A.M. helped interpreting the results from the Quebec CHD Database. Y.A. and J.D. performed the initial data processing and helped. helped running the Mayo Clinic part of the experiment. interpreted the initial results. M.K. edited the initial draft of the paper. Y.L. and M.K. supervised the project. All of the authors contributed to the final writing of the paperY.W. and A.A.K.D. helped running part of the lab imputation experiments. T.O., J.M.B., J.E.O., and M.A.F. provided the Mayo Clinic dataset. E.R. performed the data extraction and de-identification of the EHR data for both the bipolar and the control cohorts. W.L., Y.M., and Z.W. helped running the Mayo Clinic part of the experiment. T.O., J.M.B., and E.R. helped analyze the results. A.M. provided the data from Quebec CHD Database. A.L. and L.G. processed the data. X.H.L. implemented the MixEHR+RNN model and ran the experiments on the Quebec CHD Database with the help from Z.W. A.L. and A.M. helped interpreting the results from the Quebec CHD Database. Y.A. and J.D. performed the initial data processing and helped interpreted the initial results. M.K. edited the initial draft of the paper. Y.L. and M.K. supervised the project. All of the authors contributed to the final writing of the paper.\n", "annotations": {"author": "[{\"start\":\"69\",\"end\":\"201\"},{\"start\":\"202\",\"end\":\"325\"},{\"start\":\"326\",\"end\":\"444\"},{\"start\":\"445\",\"end\":\"559\"},{\"start\":\"560\",\"end\":\"679\"},{\"start\":\"680\",\"end\":\"693\"},{\"start\":\"694\",\"end\":\"818\"},{\"start\":\"819\",\"end\":\"934\"},{\"start\":\"935\",\"end\":\"1051\"},{\"start\":\"1052\",\"end\":\"1255\"},{\"start\":\"1256\",\"end\":\"1410\"},{\"start\":\"1411\",\"end\":\"1490\"},{\"start\":\"1491\",\"end\":\"1572\"},{\"start\":\"1573\",\"end\":\"1653\"},{\"start\":\"1654\",\"end\":\"1768\"},{\"start\":\"1769\",\"end\":\"1884\"},{\"start\":\"1885\",\"end\":\"2004\"},{\"start\":\"2005\",\"end\":\"2136\"},{\"start\":\"2137\",\"end\":\"2280\"},{\"start\":\"2281\",\"end\":\"2494\"}]", "publisher": null, "author_last_name": "[{\"start\":\"73\",\"end\":\"75\"},{\"start\":\"214\",\"end\":\"218\"},{\"start\":\"335\",\"end\":\"337\"},{\"start\":\"449\",\"end\":\"452\"},{\"start\":\"568\",\"end\":\"572\"},{\"start\":\"685\",\"end\":\"692\"},{\"start\":\"704\",\"end\":\"711\"},{\"start\":\"823\",\"end\":\"827\"},{\"start\":\"941\",\"end\":\"944\"},{\"start\":\"1058\",\"end\":\"1063\"},{\"start\":\"1265\",\"end\":\"1274\"},{\"start\":\"1419\",\"end\":\"1422\"},{\"start\":\"1499\",\"end\":\"1504\"},{\"start\":\"1580\",\"end\":\"1584\"},{\"start\":\"1660\",\"end\":\"1663\"},{\"start\":\"1776\",\"end\":\"1779\"},{\"start\":\"1892\",\"end\":\"1899\"},{\"start\":\"2010\",\"end\":\"2015\"},{\"start\":\"2142\",\"end\":\"2159\"},{\"start\":\"2289\",\"end\":\"2295\"}]", "author_first_name": "[{\"start\":\"69\",\"end\":\"72\"},{\"start\":\"202\",\"end\":\"213\"},{\"start\":\"326\",\"end\":\"330\"},{\"start\":\"331\",\"end\":\"334\"},{\"start\":\"445\",\"end\":\"448\"},{\"start\":\"560\",\"end\":\"567\"},{\"start\":\"680\",\"end\":\"684\"},{\"start\":\"694\",\"end\":\"703\"},{\"start\":\"819\",\"end\":\"822\"},{\"start\":\"935\",\"end\":\"940\"},{\"start\":\"1052\",\"end\":\"1057\"},{\"start\":\"1256\",\"end\":\"1262\"},{\"start\":\"1263\",\"end\":\"1264\"},{\"start\":\"1411\",\"end\":\"1418\"},{\"start\":\"1491\",\"end\":\"1496\"},{\"start\":\"1497\",\"end\":\"1498\"},{\"start\":\"1573\",\"end\":\"1577\"},{\"start\":\"1578\",\"end\":\"1579\"},{\"start\":\"1654\",\"end\":\"1659\"},{\"start\":\"1769\",\"end\":\"1775\"},{\"start\":\"1885\",\"end\":\"1891\"},{\"start\":\"2005\",\"end\":\"2009\"},{\"start\":\"2137\",\"end\":\"2141\"},{\"start\":\"2281\",\"end\":\"2288\"}]", "author_affiliation": "[{\"start\":\"96\",\"end\":\"200\"},{\"start\":\"220\",\"end\":\"324\"},{\"start\":\"339\",\"end\":\"443\"},{\"start\":\"454\",\"end\":\"558\"},{\"start\":\"574\",\"end\":\"678\"},{\"start\":\"713\",\"end\":\"817\"},{\"start\":\"829\",\"end\":\"933\"},{\"start\":\"946\",\"end\":\"1050\"},{\"start\":\"1065\",\"end\":\"1254\"},{\"start\":\"1276\",\"end\":\"1341\"},{\"start\":\"1343\",\"end\":\"1409\"},{\"start\":\"1424\",\"end\":\"1489\"},{\"start\":\"1506\",\"end\":\"1571\"},{\"start\":\"1586\",\"end\":\"1652\"},{\"start\":\"1665\",\"end\":\"1767\"},{\"start\":\"1781\",\"end\":\"1883\"},{\"start\":\"1901\",\"end\":\"2003\"},{\"start\":\"2017\",\"end\":\"2135\"},{\"start\":\"2161\",\"end\":\"2279\"},{\"start\":\"2297\",\"end\":\"2415\"},{\"start\":\"2417\",\"end\":\"2493\"}]", "title": "[{\"start\":\"1\",\"end\":\"66\"},{\"start\":\"2495\",\"end\":\"2560\"}]", "venue": null, "abstract": "[{\"start\":\"2602\",\"end\":\"3818\"}]", "bib_ref": "[{\"start\":\"4570\",\"end\":\"4573\",\"attributes\":{\"ref_id\":\"b0\"}},{\"start\":\"4573\",\"end\":\"4576\",\"attributes\":{\"ref_id\":\"b1\"}},{\"start\":\"4576\",\"end\":\"4579\",\"attributes\":{\"ref_id\":\"b2\"}},{\"start\":\"4737\",\"end\":\"4738\",\"attributes\":{\"ref_id\":\"b2\"}},{\"start\":\"5269\",\"end\":\"5270\",\"attributes\":{\"ref_id\":\"b3\"}},{\"start\":\"5941\",\"end\":\"5944\",\"attributes\":{\"ref_id\":\"b1\"}},{\"start\":\"6517\",\"end\":\"6519\",\"attributes\":{\"ref_id\":\"b3\"}},{\"start\":\"6519\",\"end\":\"6523\",\"attributes\":{\"ref_id\":\"b9\"}},{\"start\":\"6523\",\"end\":\"6527\",\"attributes\":{\"ref_id\":\"b10\"}},{\"start\":\"6527\",\"end\":\"6531\",\"attributes\":{\"ref_id\":\"b11\"}},{\"start\":\"6531\",\"end\":\"6535\",\"attributes\":{\"ref_id\":\"b12\"}},{\"start\":\"6535\",\"end\":\"6539\",\"attributes\":{\"ref_id\":\"b13\"}},{\"start\":\"6654\",\"end\":\"6655\",\"attributes\":{\"ref_id\":\"b3\"}},{\"start\":\"6724\",\"end\":\"6726\",\"attributes\":{\"ref_id\":\"b7\"}},{\"start\":\"6726\",\"end\":\"6728\",\"attributes\":{\"ref_id\":\"b14\"}},{\"start\":\"6853\",\"end\":\"6857\",\"attributes\":{\"ref_id\":\"b15\"}},{\"start\":\"6857\",\"end\":\"6861\",\"attributes\":{\"ref_id\":\"b16\"}},{\"start\":\"6861\",\"end\":\"6865\",\"attributes\":{\"ref_id\":\"b17\"}},{\"start\":\"6865\",\"end\":\"6869\",\"attributes\":{\"ref_id\":\"b18\"}},{\"start\":\"6869\",\"end\":\"6873\",\"attributes\":{\"ref_id\":\"b19\"}},{\"start\":\"6873\",\"end\":\"6877\",\"attributes\":{\"ref_id\":\"b20\"}},{\"start\":\"6877\",\"end\":\"6881\",\"attributes\":{\"ref_id\":\"b21\"}},{\"start\":\"6881\",\"end\":\"6885\",\"attributes\":{\"ref_id\":\"b22\"}},{\"start\":\"6998\",\"end\":\"7002\",\"attributes\":{\"ref_id\":\"b23\"}},{\"start\":\"7002\",\"end\":\"7006\",\"attributes\":{\"ref_id\":\"b24\"}},{\"start\":\"7006\",\"end\":\"7010\",\"attributes\":{\"ref_id\":\"b25\"}},{\"start\":\"7010\",\"end\":\"7014\",\"attributes\":{\"ref_id\":\"b26\"}},{\"start\":\"7014\",\"end\":\"7018\",\"attributes\":{\"ref_id\":\"b27\"}},{\"start\":\"7018\",\"end\":\"7022\",\"attributes\":{\"ref_id\":\"b28\"}},{\"start\":\"7022\",\"end\":\"7026\",\"attributes\":{\"ref_id\":\"b29\"}},{\"start\":\"7026\",\"end\":\"7030\",\"attributes\":{\"ref_id\":\"b30\"}},{\"start\":\"7093\",\"end\":\"7095\",\"attributes\":{\"ref_id\":\"b31\"}},{\"start\":\"7250\",\"end\":\"7252\",\"attributes\":{\"ref_id\":\"b28\"}},{\"start\":\"7667\",\"end\":\"7670\",\"attributes\":{\"ref_id\":\"b1\"}},{\"start\":\"7957\",\"end\":\"7977\"},{\"start\":\"10301\",\"end\":\"10304\",\"attributes\":{\"ref_id\":\"b0\"}},{\"start\":\"10391\",\"end\":\"10394\",\"attributes\":{\"ref_id\":\"b1\"}},{\"start\":\"14230\",\"end\":\"14232\",\"attributes\":{\"ref_id\":\"b32\"}},{\"start\":\"16412\",\"end\":\"16415\",\"attributes\":{\"ref_id\":\"b6\"}},{\"start\":\"16415\",\"end\":\"16418\",\"attributes\":{\"ref_id\":\"b7\"}},{\"start\":\"16418\",\"end\":\"16421\",\"attributes\":{\"ref_id\":\"b8\"}},{\"start\":\"16421\",\"end\":\"16425\",\"attributes\":{\"ref_id\":\"b9\"}},{\"start\":\"16425\",\"end\":\"16429\",\"attributes\":{\"ref_id\":\"b10\"}},{\"start\":\"16429\",\"end\":\"16433\",\"attributes\":{\"ref_id\":\"b11\"}},{\"start\":\"16433\",\"end\":\"16437\",\"attributes\":{\"ref_id\":\"b12\"}},{\"start\":\"16437\",\"end\":\"16441\",\"attributes\":{\"ref_id\":\"b13\"}},{\"start\":\"33148\",\"end\":\"33150\",\"attributes\":{\"ref_id\":\"b34\"}},{\"start\":\"35355\",\"end\":\"35358\",\"attributes\":{\"ref_id\":\"b26\"}},{\"start\":\"35358\",\"end\":\"35361\",\"attributes\":{\"ref_id\":\"b37\"}},{\"start\":\"35361\",\"end\":\"35363\",\"attributes\":{\"ref_id\":\"b38\"}},{\"start\":\"36295\",\"end\":\"36297\",\"attributes\":{\"ref_id\":\"b16\"}},{\"start\":\"40555\",\"end\":\"40557\",\"attributes\":{\"ref_id\":\"b39\"}},{\"start\":\"41111\",\"end\":\"41113\",\"attributes\":{\"ref_id\":\"b40\"}},{\"start\":\"41607\",\"end\":\"41610\",\"attributes\":{\"ref_id\":\"b12\"}},{\"start\":\"41610\",\"end\":\"41612\",\"attributes\":{\"ref_id\":\"b41\"}},{\"start\":\"43754\",\"end\":\"43757\",\"attributes\":{\"ref_id\":\"b13\"}},{\"start\":\"43757\",\"end\":\"43761\",\"attributes\":{\"ref_id\":\"b42\"}},{\"start\":\"44419\",\"end\":\"44422\",\"attributes\":{\"ref_id\":\"b43\"}},{\"start\":\"44422\",\"end\":\"44424\",\"attributes\":{\"ref_id\":\"b44\"}},{\"start\":\"45615\",\"end\":\"45617\",\"attributes\":{\"ref_id\":\"b3\"}},{\"start\":\"45617\",\"end\":\"45620\",\"attributes\":{\"ref_id\":\"b13\"}},{\"start\":\"45620\",\"end\":\"45622\",\"attributes\":{\"ref_id\":\"b43\"}},{\"start\":\"51340\",\"end\":\"51342\",\"attributes\":{\"ref_id\":\"b28\"}},{\"start\":\"55165\",\"end\":\"55168\",\"attributes\":{\"ref_id\":\"b46\"}},{\"start\":\"55168\",\"end\":\"55170\",\"attributes\":{\"ref_id\":\"b47\"}},{\"start\":\"56102\",\"end\":\"56105\",\"attributes\":{\"ref_id\":\"b48\"}},{\"start\":\"56105\",\"end\":\"56107\",\"attributes\":{\"ref_id\":\"b49\"}},{\"start\":\"60988\",\"end\":\"60990\",\"attributes\":{\"ref_id\":\"b31\"}},{\"start\":\"61520\",\"end\":\"61522\",\"attributes\":{\"ref_id\":\"b31\"}},{\"start\":\"67736\",\"end\":\"67737\",\"attributes\":{\"ref_id\":\"b4\"}},{\"start\":\"69555\",\"end\":\"69557\",\"attributes\":{\"ref_id\":\"b18\"}}]", "figure": "[{\"start\":\"70883\",\"end\":\"70984\",\"attributes\":{\"id\":\"fig_0\"}},{\"start\":\"70985\",\"end\":\"71299\",\"attributes\":{\"id\":\"fig_1\"}},{\"start\":\"71300\",\"end\":\"71918\",\"attributes\":{\"id\":\"fig_3\"}},{\"start\":\"71919\",\"end\":\"72398\",\"attributes\":{\"id\":\"fig_5\"}},{\"start\":\"72399\",\"end\":\"73555\",\"attributes\":{\"id\":\"fig_6\"}},{\"start\":\"73556\",\"end\":\"73930\",\"attributes\":{\"id\":\"fig_8\"}},{\"start\":\"73931\",\"end\":\"74118\",\"attributes\":{\"id\":\"fig_9\"}},{\"start\":\"74119\",\"end\":\"74241\",\"attributes\":{\"id\":\"fig_11\"}},{\"start\":\"74242\",\"end\":\"80082\",\"attributes\":{\"id\":\"tab_0\",\"type\":\"table\"}},{\"start\":\"80083\",\"end\":\"82754\",\"attributes\":{\"id\":\"tab_3\",\"type\":\"table\"}},{\"start\":\"82755\",\"end\":\"85123\",\"attributes\":{\"id\":\"tab_4\",\"type\":\"table\"}},{\"start\":\"85124\",\"end\":\"87376\",\"attributes\":{\"id\":\"tab_5\",\"type\":\"table\"}},{\"start\":\"87377\",\"end\":\"88498\",\"attributes\":{\"id\":\"tab_7\",\"type\":\"table\"}},{\"start\":\"88499\",\"end\":\"89648\",\"attributes\":{\"id\":\"tab_8\",\"type\":\"table\"}}]", "paragraph": "[{\"start\":\"3820\",\"end\":\"4950\"},{\"start\":\"4952\",\"end\":\"5629\"},{\"start\":\"5631\",\"end\":\"6428\"},{\"start\":\"6430\",\"end\":\"7487\"},{\"start\":\"7489\",\"end\":\"8555\"},{\"start\":\"8567\",\"end\":\"9523\"},{\"start\":\"9525\",\"end\":\"10646\"},{\"start\":\"10648\",\"end\":\"11533\"},{\"start\":\"11535\",\"end\":\"12411\"},{\"start\":\"12413\",\"end\":\"13441\"},{\"start\":\"13443\",\"end\":\"14571\"},{\"start\":\"14573\",\"end\":\"16032\"},{\"start\":\"16034\",\"end\":\"16822\"},{\"start\":\"16824\",\"end\":\"17588\"},{\"start\":\"17590\",\"end\":\"19023\"},{\"start\":\"19025\",\"end\":\"20123\"},{\"start\":\"20125\",\"end\":\"21761\"},{\"start\":\"21763\",\"end\":\"23070\"},{\"start\":\"23072\",\"end\":\"26030\"},{\"start\":\"26032\",\"end\":\"26665\"},{\"start\":\"26667\",\"end\":\"27686\"},{\"start\":\"27688\",\"end\":\"28389\"},{\"start\":\"28391\",\"end\":\"28847\"},{\"start\":\"28849\",\"end\":\"29965\"},{\"start\":\"29967\",\"end\":\"31490\"},{\"start\":\"31492\",\"end\":\"33435\"},{\"start\":\"33450\",\"end\":\"33836\"},{\"start\":\"33838\",\"end\":\"34692\"},{\"start\":\"34694\",\"end\":\"35069\"},{\"start\":\"35071\",\"end\":\"36033\"},{\"start\":\"36035\",\"end\":\"37153\"},{\"start\":\"37155\",\"end\":\"37573\"},{\"start\":\"37585\",\"end\":\"39585\"},{\"start\":\"39587\",\"end\":\"39707\"},{\"start\":\"39821\",\"end\":\"39851\"},{\"start\":\"39912\",\"end\":\"41353\"},{\"start\":\"41464\",\"end\":\"41960\"},{\"start\":\"41962\",\"end\":\"41994\"},{\"start\":\"42435\",\"end\":\"42472\"},{\"start\":\"42780\",\"end\":\"42795\"},{\"start\":\"42820\",\"end\":\"43066\"},{\"start\":\"43102\",\"end\":\"43239\"},{\"start\":\"43241\",\"end\":\"43296\"},{\"start\":\"43598\",\"end\":\"43798\"},{\"start\":\"43921\",\"end\":\"44241\"},{\"start\":\"44243\",\"end\":\"44722\"},{\"start\":\"44884\",\"end\":\"45020\"},{\"start\":\"45022\",\"end\":\"45240\"},{\"start\":\"45242\",\"end\":\"46114\"},{\"start\":\"46116\",\"end\":\"46375\"},{\"start\":\"46377\",\"end\":\"46558\"},{\"start\":\"46560\",\"end\":\"46750\"},{\"start\":\"46752\",\"end\":\"47038\"},{\"start\":\"47196\",\"end\":\"47457\"},{\"start\":\"47490\",\"end\":\"47560\"},{\"start\":\"47562\",\"end\":\"49156\"},{\"start\":\"49158\",\"end\":\"49902\"},{\"start\":\"49904\",\"end\":\"50969\"},{\"start\":\"50971\",\"end\":\"51744\"},{\"start\":\"51746\",\"end\":\"52763\"},{\"start\":\"52765\",\"end\":\"53000\"},{\"start\":\"53002\",\"end\":\"53221\"},{\"start\":\"53223\",\"end\":\"53956\"},{\"start\":\"53958\",\"end\":\"54349\"},{\"start\":\"54351\",\"end\":\"54896\"},{\"start\":\"54898\",\"end\":\"55911\"},{\"start\":\"55913\",\"end\":\"56802\"},{\"start\":\"56804\",\"end\":\"57714\"},{\"start\":\"57716\",\"end\":\"58837\"},{\"start\":\"58839\",\"end\":\"59850\"},{\"start\":\"59852\",\"end\":\"60486\"},{\"start\":\"60488\",\"end\":\"60849\"},{\"start\":\"60851\",\"end\":\"61524\"},{\"start\":\"61526\",\"end\":\"62288\"},{\"start\":\"62290\",\"end\":\"63362\"},{\"start\":\"63364\",\"end\":\"64250\"},{\"start\":\"64252\",\"end\":\"65076\"},{\"start\":\"65078\",\"end\":\"65898\"},{\"start\":\"65900\",\"end\":\"66458\"},{\"start\":\"66460\",\"end\":\"67434\"},{\"start\":\"67436\",\"end\":\"68036\"},{\"start\":\"68038\",\"end\":\"68333\"},{\"start\":\"68335\",\"end\":\"69799\"},{\"start\":\"69801\",\"end\":\"70517\"},{\"start\":\"70519\",\"end\":\"70654\"},{\"start\":\"70676\",\"end\":\"70882\"}]", "formula": "[{\"start\":\"39708\",\"end\":\"39820\",\"attributes\":{\"id\":\"formula_0\"}},{\"start\":\"39852\",\"end\":\"39911\",\"attributes\":{\"id\":\"formula_1\"}},{\"start\":\"41354\",\"end\":\"41463\",\"attributes\":{\"id\":\"formula_2\"}},{\"start\":\"41995\",\"end\":\"42434\",\"attributes\":{\"id\":\"formula_3\"}},{\"start\":\"42473\",\"end\":\"42758\",\"attributes\":{\"id\":\"formula_4\"}},{\"start\":\"42758\",\"end\":\"42779\",\"attributes\":{\"id\":\"formula_5\"}},{\"start\":\"42796\",\"end\":\"42819\",\"attributes\":{\"id\":\"formula_6\"}},{\"start\":\"43067\",\"end\":\"43084\",\"attributes\":{\"id\":\"formula_7\"}},{\"start\":\"43084\",\"end\":\"43101\",\"attributes\":{\"id\":\"formula_8\"}},{\"start\":\"43297\",\"end\":\"43307\",\"attributes\":{\"id\":\"formula_9\"}},{\"start\":\"43307\",\"end\":\"43597\",\"attributes\":{\"id\":\"formula_10\"}},{\"start\":\"43799\",\"end\":\"43920\",\"attributes\":{\"id\":\"formula_11\"}},{\"start\":\"44723\",\"end\":\"44883\",\"attributes\":{\"id\":\"formula_12\"}},{\"start\":\"47039\",\"end\":\"47195\",\"attributes\":{\"id\":\"formula_14\"}},{\"start\":\"47458\",\"end\":\"47489\",\"attributes\":{\"id\":\"formula_15\"}}]", "table_ref": "[{\"start\":\"10853\",\"end\":\"10860\"},{\"start\":\"12387\",\"end\":\"12409\"},{\"start\":\"37713\",\"end\":\"37734\"},{\"start\":\"48423\",\"end\":\"48430\"},{\"start\":\"54874\",\"end\":\"54895\"},{\"start\":\"55660\",\"end\":\"55667\"},{\"start\":\"55849\",\"end\":\"55856\"},{\"start\":\"57692\",\"end\":\"57713\"}]", "section_header": "[{\"start\":\"8558\",\"end\":\"8565\"},{\"start\":\"33438\",\"end\":\"33448\"},{\"start\":\"37576\",\"end\":\"37583\"},{\"start\":\"70657\",\"end\":\"70674\"},{\"start\":\"70986\",\"end\":\"70992\"},{\"start\":\"71301\",\"end\":\"71307\"},{\"start\":\"72400\",\"end\":\"72406\"}]", "table": "[{\"start\":\"75423\",\"end\":\"80082\"},{\"start\":\"81249\",\"end\":\"82754\"},{\"start\":\"83877\",\"end\":\"85123\"},{\"start\":\"86350\",\"end\":\"87376\"},{\"start\":\"87923\",\"end\":\"88498\"},{\"start\":\"88797\",\"end\":\"89648\"}]", "figure_caption": "[{\"start\":\"70885\",\"end\":\"70984\"},{\"start\":\"70994\",\"end\":\"71299\"},{\"start\":\"71309\",\"end\":\"71918\"},{\"start\":\"71921\",\"end\":\"72398\"},{\"start\":\"72408\",\"end\":\"73555\"},{\"start\":\"73558\",\"end\":\"73930\"},{\"start\":\"73933\",\"end\":\"74118\"},{\"start\":\"74121\",\"end\":\"74241\"},{\"start\":\"74244\",\"end\":\"75423\"},{\"start\":\"80085\",\"end\":\"81249\"},{\"start\":\"82757\",\"end\":\"83877\"},{\"start\":\"85126\",\"end\":\"86350\"},{\"start\":\"87379\",\"end\":\"87923\"},{\"start\":\"88501\",\"end\":\"88797\"}]", "figure_ref": "[{\"start\":\"9513\",\"end\":\"9522\"},{\"start\":\"9694\",\"end\":\"9703\"},{\"start\":\"10121\",\"end\":\"10130\"},{\"start\":\"11211\",\"end\":\"11232\"},{\"start\":\"11719\",\"end\":\"11741\"},{\"start\":\"12864\",\"end\":\"12870\",\"attributes\":{\"ref_id\":\"fig_1\"}},{\"start\":\"13062\",\"end\":\"13070\"},{\"start\":\"13542\",\"end\":\"13562\",\"attributes\":{\"ref_id\":\"fig_3\"}},{\"start\":\"14540\",\"end\":\"14569\"},{\"start\":\"15586\",\"end\":\"15607\"},{\"start\":\"15830\",\"end\":\"15852\"},{\"start\":\"16383\",\"end\":\"16390\"},{\"start\":\"17245\",\"end\":\"17254\",\"attributes\":{\"ref_id\":\"fig_1\"}},{\"start\":\"17493\",\"end\":\"17502\",\"attributes\":{\"ref_id\":\"fig_1\"}},{\"start\":\"17813\",\"end\":\"17822\",\"attributes\":{\"ref_id\":\"fig_1\"}},{\"start\":\"19936\",\"end\":\"19943\",\"attributes\":{\"ref_id\":\"fig_3\"}},{\"start\":\"20113\",\"end\":\"20122\",\"attributes\":{\"ref_id\":\"fig_3\"}},{\"start\":\"20338\",\"end\":\"20347\",\"attributes\":{\"ref_id\":\"fig_3\"}},{\"start\":\"20470\",\"end\":\"20479\",\"attributes\":{\"ref_id\":\"fig_3\"}},{\"start\":\"20898\",\"end\":\"20920\",\"attributes\":{\"ref_id\":\"fig_6\"}},{\"start\":\"21006\",\"end\":\"21027\",\"attributes\":{\"ref_id\":\"fig_1\"}},{\"start\":\"21925\",\"end\":\"21932\"},{\"start\":\"22367\",\"end\":\"22374\"},{\"start\":\"22760\",\"end\":\"22781\",\"attributes\":{\"ref_id\":\"fig_1\"}},{\"start\":\"23437\",\"end\":\"23445\"},{\"start\":\"23629\",\"end\":\"23650\"},{\"start\":\"23921\",\"end\":\"23944\"},{\"start\":\"24008\",\"end\":\"24029\"},{\"start\":\"24079\",\"end\":\"24100\",\"attributes\":{\"ref_id\":\"fig_6\"}},{\"start\":\"25712\",\"end\":\"25719\"},{\"start\":\"26185\",\"end\":\"26194\"},{\"start\":\"26291\",\"end\":\"26312\",\"attributes\":{\"ref_id\":\"fig_1\"}},{\"start\":\"26655\",\"end\":\"26664\"},{\"start\":\"26866\",\"end\":\"26873\"},{\"start\":\"27097\",\"end\":\"27106\"},{\"start\":\"27388\",\"end\":\"27409\"},{\"start\":\"27801\",\"end\":\"27824\"},{\"start\":\"29253\",\"end\":\"29275\"},{\"start\":\"29453\",\"end\":\"29460\"},{\"start\":\"29945\",\"end\":\"29952\",\"attributes\":{\"ref_id\":\"fig_1\"}},{\"start\":\"30596\",\"end\":\"30604\",\"attributes\":{\"ref_id\":\"fig_6\"}},{\"start\":\"30643\",\"end\":\"30664\"},{\"start\":\"30761\",\"end\":\"30782\"},{\"start\":\"30802\",\"end\":\"30824\",\"attributes\":{\"ref_id\":\"fig_1\"}},{\"start\":\"31342\",\"end\":\"31364\",\"attributes\":{\"ref_id\":\"fig_1\"}},{\"start\":\"31966\",\"end\":\"31975\",\"attributes\":{\"ref_id\":\"fig_6\"}},{\"start\":\"32364\",\"end\":\"32373\",\"attributes\":{\"ref_id\":\"fig_6\"}},{\"start\":\"32839\",\"end\":\"32860\",\"attributes\":{\"ref_id\":\"fig_1\"}},{\"start\":\"33334\",\"end\":\"33341\",\"attributes\":{\"ref_id\":\"fig_3\"}},{\"start\":\"37675\",\"end\":\"37683\"},{\"start\":\"45218\",\"end\":\"45239\"},{\"start\":\"46002\",\"end\":\"46024\"},{\"start\":\"46304\",\"end\":\"46326\"},{\"start\":\"48341\",\"end\":\"48362\",\"attributes\":{\"ref_id\":\"fig_6\"}},{\"start\":\"51720\",\"end\":\"51742\",\"attributes\":{\"ref_id\":\"fig_1\"}},{\"start\":\"53647\",\"end\":\"53668\"},{\"start\":\"59221\",\"end\":\"59230\",\"attributes\":{\"ref_id\":\"fig_3\"}},{\"start\":\"60071\",\"end\":\"60080\"},{\"start\":\"62793\",\"end\":\"62802\"},{\"start\":\"64025\",\"end\":\"64046\"},{\"start\":\"65471\",\"end\":\"65480\"},{\"start\":\"66690\",\"end\":\"66706\"},{\"start\":\"67020\",\"end\":\"67037\"},{\"start\":\"67196\",\"end\":\"67213\",\"attributes\":{\"ref_id\":\"fig_1\"}}]", "bib_author_first_name": "[{\"start\":\"92060\",\"end\":\"92061\"},{\"start\":\"92062\",\"end\":\"92065\"},{\"start\":\"92292\",\"end\":\"92293\"},{\"start\":\"92303\",\"end\":\"92304\"},{\"start\":\"92314\",\"end\":\"92315\"},{\"start\":\"92316\",\"end\":\"92317\"},{\"start\":\"92607\",\"end\":\"92608\"},{\"start\":\"92616\",\"end\":\"92617\"},{\"start\":\"92629\",\"end\":\"92630\"},{\"start\":\"92639\",\"end\":\"92640\"},{\"start\":\"92876\",\"end\":\"92877\"},{\"start\":\"92878\",\"end\":\"92879\"},{\"start\":\"92886\",\"end\":\"92887\"},{\"start\":\"92888\",\"end\":\"92889\"},{\"start\":\"92894\",\"end\":\"92895\"},{\"start\":\"92896\",\"end\":\"92897\"},{\"start\":\"93097\",\"end\":\"93098\"},{\"start\":\"93114\",\"end\":\"93115\"},{\"start\":\"93122\",\"end\":\"93123\"},{\"start\":\"93539\",\"end\":\"93540\"},{\"start\":\"93547\",\"end\":\"93548\"},{\"start\":\"93549\",\"end\":\"93550\"},{\"start\":\"93952\",\"end\":\"93953\"},{\"start\":\"93954\",\"end\":\"93955\"},{\"start\":\"93974\",\"end\":\"93975\"},{\"start\":\"93985\",\"end\":\"93986\"},{\"start\":\"94475\",\"end\":\"94476\"},{\"start\":\"94477\",\"end\":\"94478\"},{\"start\":\"94487\",\"end\":\"94488\"},{\"start\":\"94489\",\"end\":\"94490\"},{\"start\":\"94945\",\"end\":\"94946\"},{\"start\":\"94955\",\"end\":\"94956\"},{\"start\":\"95116\",\"end\":\"95117\"},{\"start\":\"95118\",\"end\":\"95119\"},{\"start\":\"95131\",\"end\":\"95132\"},{\"start\":\"95133\",\"end\":\"95134\"},{\"start\":\"95514\",\"end\":\"95515\"},{\"start\":\"95516\",\"end\":\"95517\"},{\"start\":\"95637\",\"end\":\"95638\"},{\"start\":\"95639\",\"end\":\"95640\"},{\"start\":\"95652\",\"end\":\"95653\"},{\"start\":\"95916\",\"end\":\"95917\"},{\"start\":\"95918\",\"end\":\"95919\"},{\"start\":\"95925\",\"end\":\"95926\"},{\"start\":\"95935\",\"end\":\"95936\"},{\"start\":\"96354\",\"end\":\"96355\"},{\"start\":\"96366\",\"end\":\"96367\"},{\"start\":\"96377\",\"end\":\"96378\"},{\"start\":\"96386\",\"end\":\"96387\"},{\"start\":\"96388\",\"end\":\"96389\"},{\"start\":\"96907\",\"end\":\"96908\"},{\"start\":\"96909\",\"end\":\"96912\"},{\"start\":\"96921\",\"end\":\"96922\"},{\"start\":\"96923\",\"end\":\"96924\"},{\"start\":\"97048\",\"end\":\"97049\"},{\"start\":\"97059\",\"end\":\"97060\"},{\"start\":\"97068\",\"end\":\"97069\"},{\"start\":\"97083\",\"end\":\"97084\"},{\"start\":\"97094\",\"end\":\"97095\"},{\"start\":\"97102\",\"end\":\"97103\"},{\"start\":\"97113\",\"end\":\"97114\"},{\"start\":\"97534\",\"end\":\"97535\"},{\"start\":\"97543\",\"end\":\"97544\"},{\"start\":\"97556\",\"end\":\"97557\"},{\"start\":\"97566\",\"end\":\"97567\"},{\"start\":\"97575\",\"end\":\"97576\"},{\"start\":\"97590\",\"end\":\"97591\"},{\"start\":\"97601\",\"end\":\"97602\"},{\"start\":\"97609\",\"end\":\"97610\"},{\"start\":\"97620\",\"end\":\"97621\"},{\"start\":\"98106\",\"end\":\"98107\"},{\"start\":\"98351\",\"end\":\"98352\"},{\"start\":\"98590\",\"end\":\"98591\"},{\"start\":\"98602\",\"end\":\"98603\"},{\"start\":\"98613\",\"end\":\"98614\"},{\"start\":\"98621\",\"end\":\"98622\"},{\"start\":\"98623\",\"end\":\"98624\"},{\"start\":\"98633\",\"end\":\"98634\"},{\"start\":\"98635\",\"end\":\"98636\"},{\"start\":\"98949\",\"end\":\"98950\"},{\"start\":\"99300\",\"end\":\"99301\"},{\"start\":\"99622\",\"end\":\"99623\"},{\"start\":\"99630\",\"end\":\"99631\"},{\"start\":\"99638\",\"end\":\"99639\"},{\"start\":\"99647\",\"end\":\"99648\"},{\"start\":\"99657\",\"end\":\"99658\"},{\"start\":\"99962\",\"end\":\"99963\"},{\"start\":\"99974\",\"end\":\"99975\"},{\"start\":\"100218\",\"end\":\"100219\"},{\"start\":\"100227\",\"end\":\"100228\"},{\"start\":\"100235\",\"end\":\"100236\"},{\"start\":\"100244\",\"end\":\"100245\"},{\"start\":\"100599\",\"end\":\"100600\"},{\"start\":\"100601\",\"end\":\"100602\"},{\"start\":\"100611\",\"end\":\"100612\"},{\"start\":\"100613\",\"end\":\"100614\"},{\"start\":\"100621\",\"end\":\"100622\"},{\"start\":\"100630\",\"end\":\"100631\"},{\"start\":\"100632\",\"end\":\"100633\"},{\"start\":\"100888\",\"end\":\"100889\"},{\"start\":\"100896\",\"end\":\"100897\"},{\"start\":\"100898\",\"end\":\"100899\"},{\"start\":\"100910\",\"end\":\"100911\"},{\"start\":\"100921\",\"end\":\"100922\"},{\"start\":\"100923\",\"end\":\"100924\"},{\"start\":\"100934\",\"end\":\"100935\"},{\"start\":\"101191\",\"end\":\"101192\"},{\"start\":\"101201\",\"end\":\"101202\"},{\"start\":\"101209\",\"end\":\"101210\"},{\"start\":\"101227\",\"end\":\"101228\"},{\"start\":\"101593\",\"end\":\"101594\"},{\"start\":\"101603\",\"end\":\"101604\"},{\"start\":\"101609\",\"end\":\"101610\"},{\"start\":\"101611\",\"end\":\"101612\"},{\"start\":\"101619\",\"end\":\"101620\"},{\"start\":\"101621\",\"end\":\"101622\"},{\"start\":\"101892\",\"end\":\"101893\"},{\"start\":\"101902\",\"end\":\"101903\"},{\"start\":\"101915\",\"end\":\"101916\"},{\"start\":\"102161\",\"end\":\"102162\"},{\"start\":\"102386\",\"end\":\"102387\"},{\"start\":\"102394\",\"end\":\"102395\"},{\"start\":\"102396\",\"end\":\"102397\"},{\"start\":\"102408\",\"end\":\"102409\"},{\"start\":\"102416\",\"end\":\"102417\"},{\"start\":\"102418\",\"end\":\"102419\"},{\"start\":\"102429\",\"end\":\"102430\"},{\"start\":\"103111\",\"end\":\"103112\"},{\"start\":\"103122\",\"end\":\"103123\"},{\"start\":\"103132\",\"end\":\"103133\"},{\"start\":\"103144\",\"end\":\"103145\"},{\"start\":\"103146\",\"end\":\"103147\"},{\"start\":\"103160\",\"end\":\"103161\"},{\"start\":\"103162\",\"end\":\"103163\"},{\"start\":\"103484\",\"end\":\"103485\"},{\"start\":\"103498\",\"end\":\"103499\"},{\"start\":\"103729\",\"end\":\"103730\"},{\"start\":\"104137\",\"end\":\"104138\"},{\"start\":\"104139\",\"end\":\"104140\"},{\"start\":\"104145\",\"end\":\"104146\"},{\"start\":\"104154\",\"end\":\"104155\"},{\"start\":\"104824\",\"end\":\"104825\"},{\"start\":\"104832\",\"end\":\"104833\"},{\"start\":\"104840\",\"end\":\"104841\"},{\"start\":\"104849\",\"end\":\"104850\"},{\"start\":\"104851\",\"end\":\"104852\"},{\"start\":\"104860\",\"end\":\"104861\"},{\"start\":\"105511\",\"end\":\"105512\"},{\"start\":\"105522\",\"end\":\"105523\"},{\"start\":\"105531\",\"end\":\"105532\"},{\"start\":\"105541\",\"end\":\"105542\"},{\"start\":\"105543\",\"end\":\"105544\"},{\"start\":\"105555\",\"end\":\"105556\"},{\"start\":\"105557\",\"end\":\"105558\"},{\"start\":\"105564\",\"end\":\"105565\"},{\"start\":\"105576\",\"end\":\"105577\"},{\"start\":\"106063\",\"end\":\"106064\"},{\"start\":\"106074\",\"end\":\"106075\"},{\"start\":\"106349\",\"end\":\"106350\"},{\"start\":\"106351\",\"end\":\"106352\"},{\"start\":\"106361\",\"end\":\"106362\"},{\"start\":\"106375\",\"end\":\"106376\"},{\"start\":\"106377\",\"end\":\"106378\"},{\"start\":\"106389\",\"end\":\"106390\"},{\"start\":\"106391\",\"end\":\"106392\"},{\"start\":\"106715\",\"end\":\"106716\"},{\"start\":\"106717\",\"end\":\"106718\"},{\"start\":\"106988\",\"end\":\"106989\"},{\"start\":\"106990\",\"end\":\"106991\"},{\"start\":\"107003\",\"end\":\"107004\"},{\"start\":\"107207\",\"end\":\"107208\"},{\"start\":\"107347\",\"end\":\"107348\"},{\"start\":\"107349\",\"end\":\"107350\"},{\"start\":\"107360\",\"end\":\"107361\"},{\"start\":\"107362\",\"end\":\"107363\"},{\"start\":\"107370\",\"end\":\"107371\"},{\"start\":\"107378\",\"end\":\"107379\"},{\"start\":\"107380\",\"end\":\"107381\"},{\"start\":\"107632\",\"end\":\"107633\"},{\"start\":\"107642\",\"end\":\"107643\"},{\"start\":\"107652\",\"end\":\"107653\"},{\"start\":\"107662\",\"end\":\"107663\"},{\"start\":\"107671\",\"end\":\"107672\"},{\"start\":\"107682\",\"end\":\"107683\"},{\"start\":\"107694\",\"end\":\"107695\"},{\"start\":\"108270\",\"end\":\"108271\"},{\"start\":\"108282\",\"end\":\"108283\"},{\"start\":\"108292\",\"end\":\"108293\"},{\"start\":\"108526\",\"end\":\"108527\"},{\"start\":\"108528\",\"end\":\"108529\"},{\"start\":\"108795\",\"end\":\"108796\"},{\"start\":\"108797\",\"end\":\"108798\"},{\"start\":\"109048\",\"end\":\"109049\"},{\"start\":\"109050\",\"end\":\"109051\"},{\"start\":\"109061\",\"end\":\"109062\"},{\"start\":\"109063\",\"end\":\"109064\"},{\"start\":\"109073\",\"end\":\"109074\"},{\"start\":\"109089\",\"end\":\"109090\"},{\"start\":\"109098\",\"end\":\"109099\"},{\"start\":\"109404\",\"end\":\"109405\"},{\"start\":\"109406\",\"end\":\"109407\"},{\"start\":\"110280\",\"end\":\"110281\"},{\"start\":\"110282\",\"end\":\"110283\"},{\"start\":\"110286\",\"end\":\"110287\"},{\"start\":\"110288\",\"end\":\"110297\"},{\"start\":\"110300\",\"end\":\"110301\"},{\"start\":\"110302\",\"end\":\"110305\"},{\"start\":\"110308\",\"end\":\"110309\"},{\"start\":\"110310\",\"end\":\"110313\"},{\"start\":\"110316\",\"end\":\"110317\"},{\"start\":\"110318\",\"end\":\"110325\"},{\"start\":\"110328\",\"end\":\"110329\"},{\"start\":\"110330\",\"end\":\"110331\"},{\"start\":\"110334\",\"end\":\"110335\"},{\"start\":\"110336\",\"end\":\"110341\"},{\"start\":\"110344\",\"end\":\"110345\"},{\"start\":\"110346\",\"end\":\"110349\"},{\"start\":\"110352\",\"end\":\"110353\"},{\"start\":\"110354\",\"end\":\"110355\"}]", "bib_author_last_name": "[{\"start\":\"92066\",\"end\":\"92073\"},{\"start\":\"92294\",\"end\":\"92301\"},{\"start\":\"92305\",\"end\":\"92312\"},{\"start\":\"92318\",\"end\":\"92326\"},{\"start\":\"92609\",\"end\":\"92614\"},{\"start\":\"92618\",\"end\":\"92627\"},{\"start\":\"92631\",\"end\":\"92637\"},{\"start\":\"92641\",\"end\":\"92646\"},{\"start\":\"92880\",\"end\":\"92884\"},{\"start\":\"92890\",\"end\":\"92892\"},{\"start\":\"92898\",\"end\":\"92904\"},{\"start\":\"93099\",\"end\":\"93112\"},{\"start\":\"93116\",\"end\":\"93120\"},{\"start\":\"93124\",\"end\":\"93130\"},{\"start\":\"93541\",\"end\":\"93545\"},{\"start\":\"93551\",\"end\":\"93564\"},{\"start\":\"93956\",\"end\":\"93972\"},{\"start\":\"93976\",\"end\":\"93983\"},{\"start\":\"93987\",\"end\":\"93997\"},{\"start\":\"94479\",\"end\":\"94485\"},{\"start\":\"94491\",\"end\":\"94496\"},{\"start\":\"94947\",\"end\":\"94953\"},{\"start\":\"94957\",\"end\":\"94960\"},{\"start\":\"95120\",\"end\":\"95129\"},{\"start\":\"95135\",\"end\":\"95139\"},{\"start\":\"95518\",\"end\":\"95522\"},{\"start\":\"95641\",\"end\":\"95650\"},{\"start\":\"95654\",\"end\":\"95662\"},{\"start\":\"95920\",\"end\":\"95923\"},{\"start\":\"95927\",\"end\":\"95933\"},{\"start\":\"95937\",\"end\":\"95944\"},{\"start\":\"96356\",\"end\":\"96364\"},{\"start\":\"96368\",\"end\":\"96375\"},{\"start\":\"96379\",\"end\":\"96384\"},{\"start\":\"96390\",\"end\":\"96393\"},{\"start\":\"96913\",\"end\":\"96919\"},{\"start\":\"96925\",\"end\":\"96930\"},{\"start\":\"97050\",\"end\":\"97057\"},{\"start\":\"97061\",\"end\":\"97066\"},{\"start\":\"97070\",\"end\":\"97081\"},{\"start\":\"97085\",\"end\":\"97092\"},{\"start\":\"97096\",\"end\":\"97100\"},{\"start\":\"97104\",\"end\":\"97111\"},{\"start\":\"97115\",\"end\":\"97120\"},{\"start\":\"97536\",\"end\":\"97541\"},{\"start\":\"97545\",\"end\":\"97554\"},{\"start\":\"97558\",\"end\":\"97564\"},{\"start\":\"97568\",\"end\":\"97573\"},{\"start\":\"97577\",\"end\":\"97588\"},{\"start\":\"97592\",\"end\":\"97599\"},{\"start\":\"97603\",\"end\":\"97607\"},{\"start\":\"97611\",\"end\":\"97618\"},{\"start\":\"97622\",\"end\":\"97627\"},{\"start\":\"98108\",\"end\":\"98117\"},{\"start\":\"98353\",\"end\":\"98362\"},{\"start\":\"98592\",\"end\":\"98600\"},{\"start\":\"98604\",\"end\":\"98611\"},{\"start\":\"98615\",\"end\":\"98619\"},{\"start\":\"98625\",\"end\":\"98631\"},{\"start\":\"98637\",\"end\":\"98642\"},{\"start\":\"98951\",\"end\":\"98955\"},{\"start\":\"99302\",\"end\":\"99306\"},{\"start\":\"99624\",\"end\":\"99628\"},{\"start\":\"99632\",\"end\":\"99636\"},{\"start\":\"99640\",\"end\":\"99645\"},{\"start\":\"99649\",\"end\":\"99655\"},{\"start\":\"99659\",\"end\":\"99667\"},{\"start\":\"99964\",\"end\":\"99972\"},{\"start\":\"99976\",\"end\":\"99982\"},{\"start\":\"100220\",\"end\":\"100225\"},{\"start\":\"100229\",\"end\":\"100233\"},{\"start\":\"100237\",\"end\":\"100242\"},{\"start\":\"100246\",\"end\":\"100248\"},{\"start\":\"100603\",\"end\":\"100609\"},{\"start\":\"100615\",\"end\":\"100619\"},{\"start\":\"100623\",\"end\":\"100628\"},{\"start\":\"100634\",\"end\":\"100640\"},{\"start\":\"100890\",\"end\":\"100894\"},{\"start\":\"100900\",\"end\":\"100908\"},{\"start\":\"100912\",\"end\":\"100919\"},{\"start\":\"100925\",\"end\":\"100932\"},{\"start\":\"100936\",\"end\":\"100939\"},{\"start\":\"101193\",\"end\":\"101199\"},{\"start\":\"101203\",\"end\":\"101207\"},{\"start\":\"101211\",\"end\":\"101225\"},{\"start\":\"101229\",\"end\":\"101238\"},{\"start\":\"101240\",\"end\":\"101245\"},{\"start\":\"101595\",\"end\":\"101601\"},{\"start\":\"101605\",\"end\":\"101607\"},{\"start\":\"101613\",\"end\":\"101617\"},{\"start\":\"101623\",\"end\":\"101629\"},{\"start\":\"101894\",\"end\":\"101900\"},{\"start\":\"101904\",\"end\":\"101913\"},{\"start\":\"101917\",\"end\":\"101925\"},{\"start\":\"102163\",\"end\":\"102171\"},{\"start\":\"102388\",\"end\":\"102392\"},{\"start\":\"102398\",\"end\":\"102406\"},{\"start\":\"102410\",\"end\":\"102414\"},{\"start\":\"102420\",\"end\":\"102427\"},{\"start\":\"102431\",\"end\":\"102434\"},{\"start\":\"103113\",\"end\":\"103120\"},{\"start\":\"103124\",\"end\":\"103130\"},{\"start\":\"103134\",\"end\":\"103142\"},{\"start\":\"103148\",\"end\":\"103158\"},{\"start\":\"103164\",\"end\":\"103173\"},{\"start\":\"103486\",\"end\":\"103496\"},{\"start\":\"103500\",\"end\":\"103519\"},{\"start\":\"103731\",\"end\":\"103735\"},{\"start\":\"104141\",\"end\":\"104143\"},{\"start\":\"104147\",\"end\":\"104152\"},{\"start\":\"104156\",\"end\":\"104159\"},{\"start\":\"104826\",\"end\":\"104830\"},{\"start\":\"104834\",\"end\":\"104838\"},{\"start\":\"104842\",\"end\":\"104847\"},{\"start\":\"104853\",\"end\":\"104858\"},{\"start\":\"104862\",\"end\":\"104865\"},{\"start\":\"105513\",\"end\":\"105520\"},{\"start\":\"105524\",\"end\":\"105529\"},{\"start\":\"105533\",\"end\":\"105539\"},{\"start\":\"105545\",\"end\":\"105553\"},{\"start\":\"105559\",\"end\":\"105562\"},{\"start\":\"105566\",\"end\":\"105574\"},{\"start\":\"105578\",\"end\":\"105585\"},{\"start\":\"106065\",\"end\":\"106072\"},{\"start\":\"106076\",\"end\":\"106081\"},{\"start\":\"106353\",\"end\":\"106359\"},{\"start\":\"106363\",\"end\":\"106373\"},{\"start\":\"106379\",\"end\":\"106387\"},{\"start\":\"106393\",\"end\":\"106397\"},{\"start\":\"106719\",\"end\":\"106725\"},{\"start\":\"106992\",\"end\":\"107001\"},{\"start\":\"107005\",\"end\":\"107013\"},{\"start\":\"107209\",\"end\":\"107214\"},{\"start\":\"107351\",\"end\":\"107358\"},{\"start\":\"107364\",\"end\":\"107368\"},{\"start\":\"107372\",\"end\":\"107376\"},{\"start\":\"107382\",\"end\":\"107389\"},{\"start\":\"107634\",\"end\":\"107640\"},{\"start\":\"107644\",\"end\":\"107650\"},{\"start\":\"107654\",\"end\":\"107660\"},{\"start\":\"107664\",\"end\":\"107669\"},{\"start\":\"107673\",\"end\":\"107680\"},{\"start\":\"107684\",\"end\":\"107692\"},{\"start\":\"107696\",\"end\":\"107706\"},{\"start\":\"108272\",\"end\":\"108280\"},{\"start\":\"108284\",\"end\":\"108290\"},{\"start\":\"108294\",\"end\":\"108299\"},{\"start\":\"108530\",\"end\":\"108534\"},{\"start\":\"108799\",\"end\":\"108804\"},{\"start\":\"109052\",\"end\":\"109059\"},{\"start\":\"109065\",\"end\":\"109071\"},{\"start\":\"109075\",\"end\":\"109087\"},{\"start\":\"109091\",\"end\":\"109096\"},{\"start\":\"109100\",\"end\":\"109106\"},{\"start\":\"109408\",\"end\":\"109415\"}]", "bib_entry": "[{\"start\":\"92005\",\"end\":\"92202\",\"attributes\":{\"matched_paper_id\":\"33285731\",\"id\":\"b0\"}},{\"start\":\"92204\",\"end\":\"92517\",\"attributes\":{\"id\":\"b1\"}},{\"start\":\"92519\",\"end\":\"92845\",\"attributes\":{\"id\":\"b2\"}},{\"start\":\"92847\",\"end\":\"93036\",\"attributes\":{\"matched_paper_id\":\"3177797\",\"id\":\"b3\"}},{\"start\":\"93038\",\"end\":\"93501\",\"attributes\":{\"matched_paper_id\":\"7285098\",\"id\":\"b4\"}},{\"start\":\"93503\",\"end\":\"93885\",\"attributes\":{\"matched_paper_id\":\"467086\",\"id\":\"b5\"}},{\"start\":\"93887\",\"end\":\"94407\",\"attributes\":{\"matched_paper_id\":\"16264644\",\"id\":\"b6\"}},{\"start\":\"94409\",\"end\":\"94881\",\"attributes\":{\"matched_paper_id\":\"2758584\",\"id\":\"b7\"}},{\"start\":\"94883\",\"end\":\"95089\",\"attributes\":{\"matched_paper_id\":\"9024470\",\"id\":\"b8\"}},{\"start\":\"95091\",\"end\":\"95484\",\"attributes\":{\"matched_paper_id\":\"7375081\",\"id\":\"b9\"}},{\"start\":\"95486\",\"end\":\"95608\",\"attributes\":{\"matched_paper_id\":\"753304\",\"id\":\"b10\"}},{\"start\":\"95610\",\"end\":\"95828\",\"attributes\":{\"matched_paper_id\":\"15671300\",\"id\":\"b11\"}},{\"start\":\"95830\",\"end\":\"96307\",\"attributes\":{\"matched_paper_id\":\"851882\",\"id\":\"b12\"}},{\"start\":\"96309\",\"end\":\"96865\",\"attributes\":{\"matched_paper_id\":\"14158514\",\"id\":\"b13\"}},{\"start\":\"96867\",\"end\":\"97046\",\"attributes\":{\"id\":\"b14\"}},{\"start\":\"97048\",\"end\":\"97454\",\"attributes\":{\"id\":\"b15\"}},{\"start\":\"97456\",\"end\":\"98041\",\"attributes\":{\"matched_paper_id\":\"547136\",\"id\":\"b16\",\"doi\":\"PMLR\"}},{\"start\":\"98043\",\"end\":\"98262\",\"attributes\":{\"matched_paper_id\":\"8036708\",\"id\":\"b17\"}},{\"start\":\"98264\",\"end\":\"98536\",\"attributes\":{\"id\":\"b18\"}},{\"start\":\"98538\",\"end\":\"98816\",\"attributes\":{\"matched_paper_id\":\"6612899\",\"id\":\"b19\"}},{\"start\":\"98818\",\"end\":\"99168\",\"attributes\":{\"matched_paper_id\":\"201752204\",\"id\":\"b20\"}},{\"start\":\"99170\",\"end\":\"99520\",\"attributes\":{\"matched_paper_id\":\"165164077\",\"id\":\"b21\"}},{\"start\":\"99522\",\"end\":\"99891\",\"attributes\":{\"matched_paper_id\":\"211479310\",\"id\":\"b22\"}},{\"start\":\"99893\",\"end\":\"100142\",\"attributes\":{\"id\":\"b23\"}},{\"start\":\"100144\",\"end\":\"100539\",\"attributes\":{\"matched_paper_id\":\"31457108\",\"id\":\"b24\"}},{\"start\":\"100541\",\"end\":\"100817\",\"attributes\":{\"id\":\"b25\"}},{\"start\":\"100819\",\"end\":\"101148\",\"attributes\":{\"matched_paper_id\":\"5842463\",\"id\":\"b26\"}},{\"start\":\"101150\",\"end\":\"101476\",\"attributes\":{\"matched_paper_id\":\"16034016\",\"id\":\"b27\"}},{\"start\":\"101478\",\"end\":\"101830\",\"attributes\":{\"matched_paper_id\":\"4404566\",\"id\":\"b28\"}},{\"start\":\"101832\",\"end\":\"102091\",\"attributes\":{\"id\":\"b29\"}},{\"start\":\"102093\",\"end\":\"102311\",\"attributes\":{\"matched_paper_id\":\"7979241\",\"id\":\"b30\"}},{\"start\":\"102313\",\"end\":\"103016\",\"attributes\":{\"matched_paper_id\":\"13432738\",\"id\":\"b31\"}},{\"start\":\"103018\",\"end\":\"103425\",\"attributes\":{\"id\":\"b32\"}},{\"start\":\"103427\",\"end\":\"103669\",\"attributes\":{\"matched_paper_id\":\"16120223\",\"id\":\"b33\"}},{\"start\":\"103671\",\"end\":\"104023\",\"attributes\":{\"matched_paper_id\":\"17891422\",\"id\":\"b34\"}},{\"start\":\"104025\",\"end\":\"104735\",\"attributes\":{\"matched_paper_id\":\"16078581\",\"id\":\"b35\"}},{\"start\":\"104737\",\"end\":\"105399\",\"attributes\":{\"matched_paper_id\":\"11728475\",\"id\":\"b36\"}},{\"start\":\"105401\",\"end\":\"105972\",\"attributes\":{\"matched_paper_id\":\"14864296\",\"id\":\"b37\"}},{\"start\":\"105974\",\"end\":\"106256\",\"attributes\":{\"matched_paper_id\":\"2375893\",\"id\":\"b38\"}},{\"start\":\"106258\",\"end\":\"106671\",\"attributes\":{\"id\":\"b39\"}},{\"start\":\"106673\",\"end\":\"106959\",\"attributes\":{\"id\":\"b40\"}},{\"start\":\"106961\",\"end\":\"107168\",\"attributes\":{\"matched_paper_id\":\"15671300\",\"id\":\"b41\"}},{\"start\":\"107170\",\"end\":\"107311\",\"attributes\":{\"id\":\"b42\"}},{\"start\":\"107313\",\"end\":\"107545\",\"attributes\":{\"matched_paper_id\":\"5652538\",\"id\":\"b43\"}},{\"start\":\"107547\",\"end\":\"108235\",\"attributes\":{\"matched_paper_id\":\"14497260\",\"id\":\"b44\"}},{\"start\":\"108237\",\"end\":\"108421\",\"attributes\":{\"matched_paper_id\":\"51738608\",\"id\":\"b45\"}},{\"start\":\"108423\",\"end\":\"108722\",\"attributes\":{\"matched_paper_id\":\"18909457\",\"id\":\"b46\"}},{\"start\":\"108724\",\"end\":\"108952\",\"attributes\":{\"matched_paper_id\":\"12945118\",\"id\":\"b47\"}},{\"start\":\"108954\",\"end\":\"109322\",\"attributes\":{\"matched_paper_id\":\"2332369\",\"id\":\"b48\"}},{\"start\":\"109324\",\"end\":\"110125\",\"attributes\":{\"matched_paper_id\":\"6915846\",\"id\":\"b49\"}},{\"start\":\"110127\",\"end\":\"111861\",\"attributes\":{\"id\":\"b50\"}}]", "bib_title": "[{\"start\":\"92005\",\"end\":\"92058\"},{\"start\":\"92204\",\"end\":\"92290\"},{\"start\":\"92519\",\"end\":\"92605\"},{\"start\":\"92847\",\"end\":\"92874\"},{\"start\":\"93038\",\"end\":\"93095\"},{\"start\":\"93503\",\"end\":\"93537\"},{\"start\":\"93887\",\"end\":\"93950\"},{\"start\":\"94409\",\"end\":\"94473\"},{\"start\":\"94883\",\"end\":\"94943\"},{\"start\":\"95091\",\"end\":\"95114\"},{\"start\":\"95486\",\"end\":\"95512\"},{\"start\":\"95610\",\"end\":\"95635\"},{\"start\":\"95830\",\"end\":\"95914\"},{\"start\":\"96309\",\"end\":\"96352\"},{\"start\":\"97456\",\"end\":\"97532\"},{\"start\":\"98043\",\"end\":\"98104\"},{\"start\":\"98538\",\"end\":\"98588\"},{\"start\":\"98818\",\"end\":\"98947\"},{\"start\":\"99170\",\"end\":\"99298\"},{\"start\":\"99522\",\"end\":\"99620\"},{\"start\":\"100144\",\"end\":\"100216\"},{\"start\":\"100819\",\"end\":\"100886\"},{\"start\":\"101150\",\"end\":\"101189\"},{\"start\":\"101478\",\"end\":\"101591\"},{\"start\":\"102093\",\"end\":\"102159\"},{\"start\":\"102313\",\"end\":\"102384\"},{\"start\":\"103018\",\"end\":\"103109\"},{\"start\":\"103427\",\"end\":\"103482\"},{\"start\":\"103671\",\"end\":\"103727\"},{\"start\":\"104025\",\"end\":\"104135\"},{\"start\":\"104737\",\"end\":\"104822\"},{\"start\":\"105401\",\"end\":\"105509\"},{\"start\":\"105974\",\"end\":\"106061\"},{\"start\":\"106961\",\"end\":\"106986\"},{\"start\":\"107313\",\"end\":\"107345\"},{\"start\":\"107547\",\"end\":\"107630\"},{\"start\":\"108237\",\"end\":\"108268\"},{\"start\":\"108423\",\"end\":\"108524\"},{\"start\":\"108724\",\"end\":\"108793\"},{\"start\":\"108954\",\"end\":\"109046\"},{\"start\":\"109324\",\"end\":\"109402\"},{\"start\":\"110127\",\"end\":\"110278\"}]", "bib_author": "[{\"start\":\"92060\",\"end\":\"92075\"},{\"start\":\"92292\",\"end\":\"92303\"},{\"start\":\"92303\",\"end\":\"92314\"},{\"start\":\"92314\",\"end\":\"92328\"},{\"start\":\"92607\",\"end\":\"92616\"},{\"start\":\"92616\",\"end\":\"92629\"},{\"start\":\"92629\",\"end\":\"92639\"},{\"start\":\"92639\",\"end\":\"92648\"},{\"start\":\"92876\",\"end\":\"92886\"},{\"start\":\"92886\",\"end\":\"92894\"},{\"start\":\"92894\",\"end\":\"92906\"},{\"start\":\"93097\",\"end\":\"93114\"},{\"start\":\"93114\",\"end\":\"93122\"},{\"start\":\"93122\",\"end\":\"93132\"},{\"start\":\"93539\",\"end\":\"93547\"},{\"start\":\"93547\",\"end\":\"93566\"},{\"start\":\"93952\",\"end\":\"93974\"},{\"start\":\"93974\",\"end\":\"93985\"},{\"start\":\"93985\",\"end\":\"93999\"},{\"start\":\"94475\",\"end\":\"94487\"},{\"start\":\"94487\",\"end\":\"94498\"},{\"start\":\"94945\",\"end\":\"94955\"},{\"start\":\"94955\",\"end\":\"94962\"},{\"start\":\"95116\",\"end\":\"95131\"},{\"start\":\"95131\",\"end\":\"95141\"},{\"start\":\"95514\",\"end\":\"95524\"},{\"start\":\"95637\",\"end\":\"95652\"},{\"start\":\"95652\",\"end\":\"95664\"},{\"start\":\"95916\",\"end\":\"95925\"},{\"start\":\"95925\",\"end\":\"95935\"},{\"start\":\"95935\",\"end\":\"95946\"},{\"start\":\"96354\",\"end\":\"96366\"},{\"start\":\"96366\",\"end\":\"96377\"},{\"start\":\"96377\",\"end\":\"96386\"},{\"start\":\"96386\",\"end\":\"96395\"},{\"start\":\"96907\",\"end\":\"96921\"},{\"start\":\"96921\",\"end\":\"96932\"},{\"start\":\"97048\",\"end\":\"97059\"},{\"start\":\"97059\",\"end\":\"97068\"},{\"start\":\"97068\",\"end\":\"97083\"},{\"start\":\"97083\",\"end\":\"97094\"},{\"start\":\"97094\",\"end\":\"97102\"},{\"start\":\"97102\",\"end\":\"97113\"},{\"start\":\"97113\",\"end\":\"97122\"},{\"start\":\"97534\",\"end\":\"97543\"},{\"start\":\"97543\",\"end\":\"97556\"},{\"start\":\"97556\",\"end\":\"97566\"},{\"start\":\"97566\",\"end\":\"97575\"},{\"start\":\"97575\",\"end\":\"97590\"},{\"start\":\"97590\",\"end\":\"97601\"},{\"start\":\"97601\",\"end\":\"97609\"},{\"start\":\"97609\",\"end\":\"97620\"},{\"start\":\"97620\",\"end\":\"97629\"},{\"start\":\"98106\",\"end\":\"98119\"},{\"start\":\"98351\",\"end\":\"98364\"},{\"start\":\"98590\",\"end\":\"98602\"},{\"start\":\"98602\",\"end\":\"98613\"},{\"start\":\"98613\",\"end\":\"98621\"},{\"start\":\"98621\",\"end\":\"98633\"},{\"start\":\"98633\",\"end\":\"98644\"},{\"start\":\"98949\",\"end\":\"98957\"},{\"start\":\"99300\",\"end\":\"99308\"},{\"start\":\"99622\",\"end\":\"99630\"},{\"start\":\"99630\",\"end\":\"99638\"},{\"start\":\"99638\",\"end\":\"99647\"},{\"start\":\"99647\",\"end\":\"99657\"},{\"start\":\"99657\",\"end\":\"99669\"},{\"start\":\"99962\",\"end\":\"99974\"},{\"start\":\"99974\",\"end\":\"99984\"},{\"start\":\"100218\",\"end\":\"100227\"},{\"start\":\"100227\",\"end\":\"100235\"},{\"start\":\"100235\",\"end\":\"100244\"},{\"start\":\"100244\",\"end\":\"100250\"},{\"start\":\"100599\",\"end\":\"100611\"},{\"start\":\"100611\",\"end\":\"100621\"},{\"start\":\"100621\",\"end\":\"100630\"},{\"start\":\"100630\",\"end\":\"100642\"},{\"start\":\"100888\",\"end\":\"100896\"},{\"start\":\"100896\",\"end\":\"100910\"},{\"start\":\"100910\",\"end\":\"100921\"},{\"start\":\"100921\",\"end\":\"100934\"},{\"start\":\"100934\",\"end\":\"100941\"},{\"start\":\"101191\",\"end\":\"101201\"},{\"start\":\"101201\",\"end\":\"101209\"},{\"start\":\"101209\",\"end\":\"101227\"},{\"start\":\"101227\",\"end\":\"101240\"},{\"start\":\"101240\",\"end\":\"101247\"},{\"start\":\"101593\",\"end\":\"101603\"},{\"start\":\"101603\",\"end\":\"101609\"},{\"start\":\"101609\",\"end\":\"101619\"},{\"start\":\"101619\",\"end\":\"101631\"},{\"start\":\"101892\",\"end\":\"101902\"},{\"start\":\"101902\",\"end\":\"101915\"},{\"start\":\"101915\",\"end\":\"101927\"},{\"start\":\"102161\",\"end\":\"102173\"},{\"start\":\"102386\",\"end\":\"102394\"},{\"start\":\"102394\",\"end\":\"102408\"},{\"start\":\"102408\",\"end\":\"102416\"},{\"start\":\"102416\",\"end\":\"102429\"},{\"start\":\"102429\",\"end\":\"102436\"},{\"start\":\"103111\",\"end\":\"103122\"},{\"start\":\"103122\",\"end\":\"103132\"},{\"start\":\"103132\",\"end\":\"103144\"},{\"start\":\"103144\",\"end\":\"103160\"},{\"start\":\"103160\",\"end\":\"103175\"},{\"start\":\"103484\",\"end\":\"103498\"},{\"start\":\"103498\",\"end\":\"103521\"},{\"start\":\"103729\",\"end\":\"103737\"},{\"start\":\"104137\",\"end\":\"104145\"},{\"start\":\"104145\",\"end\":\"104154\"},{\"start\":\"104154\",\"end\":\"104161\"},{\"start\":\"104824\",\"end\":\"104832\"},{\"start\":\"104832\",\"end\":\"104840\"},{\"start\":\"104840\",\"end\":\"104849\"},{\"start\":\"104849\",\"end\":\"104860\"},{\"start\":\"104860\",\"end\":\"104867\"},{\"start\":\"105511\",\"end\":\"105522\"},{\"start\":\"105522\",\"end\":\"105531\"},{\"start\":\"105531\",\"end\":\"105541\"},{\"start\":\"105541\",\"end\":\"105555\"},{\"start\":\"105555\",\"end\":\"105564\"},{\"start\":\"105564\",\"end\":\"105576\"},{\"start\":\"105576\",\"end\":\"105587\"},{\"start\":\"106063\",\"end\":\"106074\"},{\"start\":\"106074\",\"end\":\"106083\"},{\"start\":\"106349\",\"end\":\"106361\"},{\"start\":\"106361\",\"end\":\"106375\"},{\"start\":\"106375\",\"end\":\"106389\"},{\"start\":\"106389\",\"end\":\"106399\"},{\"start\":\"106715\",\"end\":\"106727\"},{\"start\":\"106988\",\"end\":\"107003\"},{\"start\":\"107003\",\"end\":\"107015\"},{\"start\":\"107207\",\"end\":\"107216\"},{\"start\":\"107347\",\"end\":\"107360\"},{\"start\":\"107360\",\"end\":\"107370\"},{\"start\":\"107370\",\"end\":\"107378\"},{\"start\":\"107378\",\"end\":\"107391\"},{\"start\":\"107632\",\"end\":\"107642\"},{\"start\":\"107642\",\"end\":\"107652\"},{\"start\":\"107652\",\"end\":\"107662\"},{\"start\":\"107662\",\"end\":\"107671\"},{\"start\":\"107671\",\"end\":\"107682\"},{\"start\":\"107682\",\"end\":\"107694\"},{\"start\":\"107694\",\"end\":\"107708\"},{\"start\":\"108270\",\"end\":\"108282\"},{\"start\":\"108282\",\"end\":\"108292\"},{\"start\":\"108292\",\"end\":\"108301\"},{\"start\":\"108526\",\"end\":\"108536\"},{\"start\":\"108795\",\"end\":\"108806\"},{\"start\":\"109048\",\"end\":\"109061\"},{\"start\":\"109061\",\"end\":\"109073\"},{\"start\":\"109073\",\"end\":\"109089\"},{\"start\":\"109089\",\"end\":\"109098\"},{\"start\":\"109098\",\"end\":\"109108\"},{\"start\":\"109404\",\"end\":\"109417\"},{\"start\":\"110280\",\"end\":\"110286\"},{\"start\":\"110286\",\"end\":\"110300\"},{\"start\":\"110300\",\"end\":\"110308\"},{\"start\":\"110308\",\"end\":\"110316\"},{\"start\":\"110316\",\"end\":\"110328\"},{\"start\":\"110328\",\"end\":\"110334\"},{\"start\":\"110334\",\"end\":\"110344\"},{\"start\":\"110344\",\"end\":\"110352\"},{\"start\":\"110352\",\"end\":\"110358\"}]", "bib_venue": "[{\"start\":\"92075\",\"end\":\"92084\"},{\"start\":\"92328\",\"end\":\"92342\"},{\"start\":\"92648\",\"end\":\"92662\"},{\"start\":\"92906\",\"end\":\"92925\"},{\"start\":\"93132\",\"end\":\"93200\"},{\"start\":\"93566\",\"end\":\"93615\"},{\"start\":\"93999\",\"end\":\"94067\"},{\"start\":\"94498\",\"end\":\"94564\"},{\"start\":\"94962\",\"end\":\"94974\"},{\"start\":\"95141\",\"end\":\"95190\"},{\"start\":\"95524\",\"end\":\"95535\"},{\"start\":\"95664\",\"end\":\"95689\"},{\"start\":\"95946\",\"end\":\"95995\"},{\"start\":\"96395\",\"end\":\"96487\"},{\"start\":\"96867\",\"end\":\"96905\"},{\"start\":\"97122\",\"end\":\"97187\"},{\"start\":\"97633\",\"end\":\"97698\"},{\"start\":\"98119\",\"end\":\"98136\"},{\"start\":\"98264\",\"end\":\"98349\"},{\"start\":\"98644\",\"end\":\"98658\"},{\"start\":\"98957\",\"end\":\"98974\"},{\"start\":\"99308\",\"end\":\"99325\"},{\"start\":\"99669\",\"end\":\"99691\"},{\"start\":\"99893\",\"end\":\"99960\"},{\"start\":\"100250\",\"end\":\"100284\"},{\"start\":\"100541\",\"end\":\"100597\"},{\"start\":\"100941\",\"end\":\"100965\"},{\"start\":\"101247\",\"end\":\"101296\"},{\"start\":\"101631\",\"end\":\"101639\"},{\"start\":\"101832\",\"end\":\"101890\"},{\"start\":\"102173\",\"end\":\"102188\"},{\"start\":\"102436\",\"end\":\"102529\"},{\"start\":\"103175\",\"end\":\"103204\"},{\"start\":\"103521\",\"end\":\"103535\"},{\"start\":\"103737\",\"end\":\"103781\"},{\"start\":\"104161\",\"end\":\"104267\"},{\"start\":\"104867\",\"end\":\"104965\"},{\"start\":\"105587\",\"end\":\"105636\"},{\"start\":\"106083\",\"end\":\"106102\"},{\"start\":\"106258\",\"end\":\"106347\"},{\"start\":\"106673\",\"end\":\"106713\"},{\"start\":\"107015\",\"end\":\"107040\"},{\"start\":\"107170\",\"end\":\"107205\"},{\"start\":\"107391\",\"end\":\"107410\"},{\"start\":\"107708\",\"end\":\"107806\"},{\"start\":\"108301\",\"end\":\"108315\"},{\"start\":\"108536\",\"end\":\"108558\"},{\"start\":\"108806\",\"end\":\"108821\"},{\"start\":\"109108\",\"end\":\"109119\"},{\"start\":\"109417\",\"end\":\"109521\"},{\"start\":\"110358\",\"end\":\"110722\"},{\"start\":\"93202\",\"end\":\"93263\"},{\"start\":\"94096\",\"end\":\"94149\"},{\"start\":\"94611\",\"end\":\"94619\"},{\"start\":\"96508\",\"end\":\"96598\"},{\"start\":\"97201\",\"end\":\"97251\"},{\"start\":\"97700\",\"end\":\"97750\"},{\"start\":\"102562\",\"end\":\"102664\"},{\"start\":\"103807\",\"end\":\"103819\"},{\"start\":\"104296\",\"end\":\"104399\"},{\"start\":\"104986\",\"end\":\"105081\"},{\"start\":\"107808\",\"end\":\"107903\"}]"}}}, "year": 2023, "month": 12, "day": 17}