{"id": 219452378, "updated": "2022-01-24 15:27:00.727", "metadata": {"title": "Detection of Malicious Social Bots Using Learning Automata With URL Features in Twitter Network", "authors": "[{\"middle\":[\"Ranjan\"],\"last\":\"Rout\",\"first\":\"Rashmi\"},{\"middle\":[],\"last\":\"Lingam\",\"first\":\"Greeshma\"},{\"middle\":[\"V.\",\"L.\",\"N.\"],\"last\":\"Somayajulu\",\"first\":\"D.\"}]", "venue": "IEEE Transactions on Computational Social Systems", "journal": "IEEE Transactions on Computational Social Systems", "publication_date": {"year": 2020, "month": null, "day": null}, "abstract": "Malicious social bots generate fake tweets and automate their social relationships either by pretending like a follower or by creating multiple fake accounts with malicious activities. Moreover, malicious social bots post shortened malicious URLs in the tweet in order to redirect the requests of online social networking participants to some malicious servers. Hence, distinguishing malicious social bots from legitimate users is one of the most important tasks in the Twitter network. To detect malicious social bots, extracting URL-based features (such as URL redirection, frequency of shared URLs, and spam content in URL) consumes less amount of time in comparison with social graph-based features (which rely on the social interactions of users). Furthermore, malicious social bots cannot easily manipulate URL redirection chains. In this article, a learning automata-based malicious social bot detection (LA-MSBD) algorithm is proposed by integrating a trust computation model with URL-based features for identifying trustworthy participants (users) in the Twitter network. The proposed trust computation model contains two parameters, namely, direct trust and indirect trust. Moreover, the direct trust is derived from Bayes’ theorem, and the indirect trust is derived from the Dempster–Shafer theory (DST) to determine the trustworthiness of each participant accurately. Experimentation has been performed on two Twitter data sets, and the results illustrate that the proposed algorithm achieves improvement in precision, recall, F-measure, and accuracy compared with existing approaches for MSBD.", "fields_of_study": "[\"Computer Science\"]", "external_ids": {"arxiv": null, "mag": "3025451404", "acl": null, "pubmed": null, "pubmedcentral": null, "dblp": "journals/tcss/RoutLS20", "doi": "10.1109/tcss.2020.2992223"}}, "content": {"source": {"pdf_hash": "9d94d82fecd9b0342d68eee26eb0758cdd160665", "pdf_src": "IEEE", "pdf_uri": null, "oa_url_match": false, "oa_info": null}, "grobid": {"id": "c2aa44ccbf0f0b34e68334f7cd96602ba6f27d21", "type": "plain-text", "url": "s3://ai2-s2-pdf-extraction-prod/parse-results/s2orc_worker/9d94d82fecd9b0342d68eee26eb0758cdd160665.txt", "contents": "\nDetection of Malicious Social Bots Using Learning Automata With URL Features in Twitter Network\nAUGUST 2020\n\nMember, IEEERashmi Ranjan Rout \nGreeshma Lingam \nSenior Member, IEEED V L N Somayajulu \nDetection of Malicious Social Bots Using Learning Automata With URL Features in Twitter Network\n\nIEEE TRANSACTIONS ON COMPUTATIONAL SOCIAL SYSTEMS\n74AUGUST 202010.1109/TCSS.2020.29922231004\nMalicious social bots generate fake tweets and automate their social relationships either by pretending like a follower or by creating multiple fake accounts with malicious activities. Moreover, malicious social bots post shortened malicious URLs in the tweet in order to redirect the requests of online social networking participants to some malicious servers. Hence, distinguishing malicious social bots from legitimate users is one of the most important tasks in the Twitter network.To detect malicious social bots, extracting URL-based features (such as URL redirection, frequency of shared URLs, and spam content in URL) consumes less amount of time in comparison with social graph-based features (which rely on the social interactions of users). Furthermore, malicious social bots cannot easily manipulate URL redirection chains. In this article, a learning automata-based malicious social bot detection (LA-MSBD) algorithm is proposed by integrating a trust computation model with URL-based features for identifying trustworthy participants (users) in the Twitter network. The proposed trust computation model contains two parameters, namely, direct trust and indirect trust. Moreover, the direct trust is derived from Bayes' theorem, and the indirect trust is derived from the Dempster-Shafer theory (DST) to determine the trustworthiness of each participant accurately. Experimentation has been performed ontwo Twitter data sets, and the results illustrate that the proposed algorithm achieves improvement in precision, recall, F-measure, and accuracy compared with existing approaches for MSBD.Index Terms-Learning automata (LA), malicious social bots, online social networks (OSNs), trust.\n\nDetection of Malicious Social Bots Using Learning Automata With URL Features in Twitter Network\n\nRashmi Ranjan Rout , Member, IEEE, Greeshma Lingam, and D. V. L. N. Somayajulu, Senior Member, IEEE Abstract-Malicious social bots generate fake tweets and automate their social relationships either by pretending like a follower or by creating multiple fake accounts with malicious activities. Moreover, malicious social bots post shortened malicious URLs in the tweet in order to redirect the requests of online social networking participants to some malicious servers. Hence, distinguishing malicious social bots from legitimate users is one of the most important tasks in the Twitter network. To detect malicious social bots, extracting URL-based features (such as URL redirection, frequency of shared URLs, and spam content in URL) consumes less amount of time in comparison with social graph-based features (which rely on the social interactions of users). Furthermore, malicious social bots cannot easily manipulate URL redirection chains. In this article, a learning automata-based malicious social bot detection (LA-MSBD) algorithm is proposed by integrating a trust computation model with URL-based features for identifying trustworthy participants (users) in the Twitter network. The proposed trust computation model contains two parameters, namely, direct trust and indirect trust. Moreover, the direct trust is derived from Bayes' theorem, and the indirect trust is derived from the Dempster-Shafer theory (DST) to determine the trustworthiness of each participant accurately. Experimentation has been performed on two Twitter data sets, and the results illustrate that the proposed algorithm achieves improvement in precision, recall, F-measure, and accuracy compared with existing approaches for MSBD.\n\nIndex Terms-Learning automata (LA), malicious social bots, online social networks (OSNs), trust.\n\n\nI. INTRODUCTION\n\nM ALICIOUS social bot is a software program that pretends to be a real user in online social networks (OSNs) [1], [2]. Moreover, malicious social bots perform several malicious attacks, such as spread social spam content, generate fake identities, manipulate online ratings, and perform phishing attacks [1]. In Twitter, when a participant (user) wants to share a tweet containing URL(s) with the neighboring participants (i.e., followers or followees), the participant adapts URL shortened service (i.e., bit.ly [3]) in order to reduce the length of URL (because a tweet is restricted up to 140 characters). Moreover, a malicious social bot may post shortened phishing URLs in the tweet [4]. As shown in Fig. 1, when a participant clicks on a shortened phishing URL, the participant's request will be redirected to intermediate URLs associated with malicious servers that, in turn, redirect the user to malicious web pages. Then, the legitimate participant is exposed to an attacker. This leads to Twitter network suffering from several vulnerabilities (such as phishing attack).\n\nSeveral approaches have been proposed to detect spam in the Twitter network [5]- [8]. These approaches are based on tweet-content features, social relationship features, and user profile features. However, the malicious social bots can manipulate profile features, such as hashtag ratio, follower ratio, URL ratio, and the number of retweets. The malicious social bots can also manipulate tweet-content features, such as sentimental words, emoticons, and most frequent words used in the tweets, by manipulating the content of each tweet [9]. The social relationship-based features are highly robust because the malicious social bots cannot easily manipulate the social interactions of users in the Twitter network. However, extracting social relationship-based features consumes a huge amount of time due to the massive volume of social network graph [10]. Therefore, identifying the malicious social bots from the legitimate participants is a challenging task in the Twitter network. The existing malicious URL detection approaches [11], [12] are based on DNS information and lexical properties of URLs. The malicious social bots use URL redirections in order to avoid detection [13]. However, for detectors, identification of all malicious social bots is an issue because malicious social bots do not post malicious URLs directly in the tweets. Thus, it is important to identify malicious URLs (i.e., harmful URLs) posted by malicious social bots in Twitter.\n\nMost of the existing approaches [14], [15] are based on supervised learning algorithms, where the model is trained with the labeled data in order to detect malicious bots in OSNs. However, these approaches rely on statistical features instead of analyzing the social behavior of users [16]. Moreover, these approaches are not highly robust in detecting the temporal data patterns with noisy data (i.e., where the data is biased with untrustworthy or fake information) because the behavior of malicious bots changes over time in order to avoid detection [17], [18]. This motivated us to consider one of the reinforcement learning techniques (such as the learning automata (LA) model) to handle temporal data patterns. In this work, we design an LA model to detect malicious social bots with improved precision and recall.\n\nIn this article, the malicious behavior of participants is analyzed by considering features extracted from the posted URLs (in the tweets), such as URL redirection, frequency of shared URLs, and spam content in URL, to distinguish between legitimate and malicious tweets. To protect against the malicious social bot attacks, our proposed LA-based malicious social bot detection (LA-MSBD) algorithm integrates a trust computational model with a set of URL-based features for the detection of malicious social bots. The proposed trust computational model contains two parameters, namely, direct trust and indirect trust. The direct trust value is derived from the Bayesian learning [19] (by considering URL-based features) to determine the trustworthiness of tweets posted by each participant. In addition to the direct trust, belief values (i.e., indicators for determining indirect trust) are collected from multiple neighbors of a participant. This is due to the fact that in case the neighbors of a participant are trustworthy, the participant is likely to be trustworthy. Furthermore, Dempster's combination rule [20] aggregates the belief values provided by multiple one-hop neighboring participants in order to evaluate the indirect trust value of participants in the Twitter network. Moreover, in our work, the belief values provided by multiple neighboring participants are considered to be independent. The proposed LA-MSBD algorithm helps to detect malicious social bots accurately (in terms of precision, recall, F-measure, and accuracy) in Twitter. The major contributions are as follows.\n\n1) Analyze the malicious behavior of a participant by considering URL-based features, such as URL redirection, the relative position of URL, frequency of shared URLs, and spam content in URL. 2) Evaluate the trustworthiness of tweets (posted by each participant) by using the Bayesian learning and Dempster-Shafer theory (DST). 3) Design of an LA-MSBD algorithm by integrating a trust model with a set of URL-based features. 4) Performance evaluation of the proposed LA-MSBD algorithm using two Twitter data sets, namely, The Fake Project data set [21] and Social Honeypot data set [22] in terms of precision, recall, F-measure, and accuracy for MSBD in the Twitter network.\n\nThe remaining portion of this article is organized as follows. Section II summarizes the existing works. Section III presents the problem formulation. Section IV provides an LA-MSBD algorithm. Section V presents the experimental results. Finally, this article is concluded in Section VI.\n\n\nII. RELATED WORK\n\nBesel et al. [23] analyzed social botnet attack on Twitter. The authors have presented that social bots use URL shortening services and URL redirection in order to redirect users to malicious web pages. Echeverria and Zhou [24] presented methods to detect, retrieve, and analyze botnet over thousands of users to observe the social behavior of bots. In [25], a social bot hunter model has been presented based on the user behavioral features, such as follower ratio, the number of URLs, and reputation score. In [26], a trust model has been designed to detect malicious activities in an OSN. The authors analyzed that the low trust value of a user indicates that the information spread by the user is considered as untrustworthy. In [1], an MSBD approach has been proposed by considering user behavioral features, such as commenting, liking, and sharing. Madisetty and Desarkar [5] have developed five different convolutional neural network models by considering tweet features. In [27], a social botnet detection algorithm is proposed by considering spam content in tweets and trust to identify social bots. Gupta et al. [7] designed a framework for detecting spammers in the Twitter network using different machine learning algorithms. In this article, we focus to detect malicious social bots (who perform phishing attacks) by considering various URL-based features using an LA model.\n\nSeveral spam-detection approaches have been proposed in the Twitter network to distinguish nonspam accounts and spam accounts [5]- [8]. Moreover, these studies consider user profile features, which can easily be modified by malicious bots. To avoid feature manipulation, Yang et al. [28] considered social relationships between malicious users and with their neighboring users based on closeness centrality. Moreover, profile features and social interaction features may not help in detecting malicious URLs that are posted by the participants. To address the above-mentioned problem, Janabi et al. [29] considered URL-based features (such as URL length, Http-302 status code, and disabling right click) to distinguish legitimate URLs from suspicious URLs. In [30], a URL-based approach is proposed to detect spam tweets in Twitter based on the tweet content and URL redirection chains. Patil and Patil [31] used decision tree classifiers with statistical features in order to detect malicious URLs. Moreover, social bots may use malicious URL redirections in order to avoid detection.\n\nThus, malicious social bots can attack legitimate users by misleading detectors. In this article, to protect against the malicious social bot attacks, we propose to identify the malicious tweets (which contains malicious URLs) in Twitter based on the lexical properties of URL and URL redirection chains.\n\n\nA. Learning Automata\n\nLA is one of the reinforcement machine learning algorithms [32]. LA is a self-adaptive decision-making unit and learns an optimal action by repeatedly interacting with the environment. At each iteration, LA selects a specific action from a finite set of actions and produces a response (or reinforcement signal) in terms of reward and penalty [33]. Based on the response from the environment, LA updates its action probability value to obtain the maximum reward from the environment. LA can be represented by a six-tuple < L A, A, pr, β, r s , F >, where L A = {la 1 , la 2 , . . . , la n } represents the set of states of an automata, A = {a 1 , a 2 , . . . , a n } represents the set of actions (or outputs of LA), and pr = { pr 1 , pr 2 , . . . , pr n } represents the set of action probability values of each learning action to be chosen. Let β = {β 1 , β 2 , . . . β n } represent a set of reinforcement signals, where β i ∈ {0, 1}, 1 represents reward, 0 represents penalty, r s represents learning algorithm, and F : pr ×β → pr represents the updation of action probability values with respect to the current action probability value and the response from the environment (i.e., β). In [17], an LA model has been proposed to identify the spatiotemporal patterns in noisy sequences. Khojasteh and Meybodi [18] discussed that LA is more robust to handle the noisy data in an adversarial environment. Moayedikia et al. [34] proposed an LA-based method to label the ground truth without human intervention and to avoid genuine interpretation by manually observing users' behavioral patterns. However, our work is different from other existing works [17], [18] in the sense that we focus on detecting malicious social bots based on the LA model with the trust computational model. The LA has also been successfully applied in various areas, such as Internet of Things (IoT) [32], cloud computing [33], social networks [17], [35], wireless networks [36], and image processing [37].\n\n\nIII. PROBLEM FORMULATION\n\nIn this section, we define some basic terminologies followed by problem formulation. The notations used in this work are listed in Table I.\n\nGiven a Twitter network G = (P, E), where P represents a participant set P = {p 1 , p 2 , . . . , p n } and E (i.e., E ⊆ P × P) represents a social relationship set (or directed edges) between the participants (users). If there exists a social relationship between two participants, then they are considered as neighbors (i.e., either followers or followees). According to a given Twitter network with n participants and series of m tweets tw p i = {tw i1 , tw i2 , . . . , tw im } posted by each participant p i , a feature set F = { f 1 , f 2 , . . . , f n } can be constructed from each tweet posted by each participant. In this work, we assume that features are independent to each other. Based on the URL-based features (such as URL redirection, frequency of shared initial URLs, and spam content in URL), we define trust We aim to design a framework by considering the feature set to evaluate the trust value of each OSN account (i.e., participant) and to detect malicious social bots in the Twitter network effectively and efficiently. Furthermore, we define two trust components, namely, direct and indirect trusts to determine the trust value of each participant.  trustworthiness of each tweet posted by the participants and to identify malicious social bots in Twitter. The objective is to compute two functions\nf : {G(1), G(2), . . . , G(τ )} → {T P (1), T P (2),. . ., T P (τ )} and g : {T P (1),. . ., T P (τ )} →C = {Legitimate, Malicious bot}\nto determine the set of trust values of all the participants for all the posted tweets (by the participants) at time t (i.e., denoted as T P (t)) and determine the class C of a participant p i (as either legitimate or malicious social bot).\n\n\nIV. DETECTION OF MALICIOUS SOCIAL BOTS USING LEARNING AUTOMATA ALONG WITH URL-BASED FEATURES\n\nIn this section, we first propose a framework for analyzing the tweets posted by participants in the Twitter network. In addition, we present a trust model with several features that are extracted from URLs (which are posted by the participants in the tweets) for evaluating the trust value of each participant in Twitter. Finally, an LA-MSBD algorithm is proposed to identify malicious social bots.\n\n\nA. Proposed Framework for Detecting Malicious Social Bots\n\nAs shown in Fig. 2, the proposed framework consists of three components: data collection, feature extraction, and LA model. To collect tweets posted by participants (users), the tweets can be crawled using Twitter Streaming APIs [38]. The data collection component (i.e., phase) consists of three subcomponents (i.e., subphases): reading tweets from Twitter streaming, collecting tweets, and URLs. Moreover, the collected tweets and collected URLs are stored in a repository. The feature extraction consists of two subcomponents: expanding shortened URLs and extracting feature set. Whenever a feature extraction component obtains a shortened URL from the repository, it is converted into a long URL using URL shortened services (such as t.co, bit.ly, and tinyurl.com) [39]. For each URL (posted by the participant in the tweet), we extract several features that are based on the lexical properties of URLs (such as spam content and the presence of -, @, and # symbols in the domain name) along with the features of URL redirection (such as URL redirection length and relative position of initial URL). Furthermore, we use these features as input to the proposed LA model for MSBD. The proposed LA model is integrated with a trust evaluation model. Moreover, the trust model determines the probability of a tweet containing any malicious information (such as URL redirection, frequency of URLs, and spam content in URL). Finally, after evaluating the malicious behavior of a series of tweets posted by a participant, we classify tweets as malicious and legitimate tweets. However, malicious tweets are likely to be posted by malicious social bots. This helps in distinguishing malicious social bots from benign participants.\n\n\nB. Feature Extraction\n\nThe accuracy of the MSBD approach is based on several features that are extracted from the Twitter network. In the proposed approach, we consider URL-based feature set F = { f 1 , f 2 , . . . , f 11 }, which are described in Table II (similar features are mentioned in [12], [30], and [41]). These features are derived from URL redirection chains and the lexical properties of URLs. Moreover, the URL-based features are used in evaluating the trustworthiness of tweets posted by the participants. For example, malicious social bots usually use long URL redirects to avoid detection [41]. The malicious URLs are not usually placed at the end of the URL redirection chain because social bots have to redirect Twitter users to different web pages in order to perform phishing attacks [30]. Therefore, in this work, URL redirection length, the relative Compute weight\nwt f i = G( f i ) n i=1 G( f i ) 3: end for 4: F → Construct a feature ranking vector with weights wt f i associated with each important feature f i\nThe feature ranking algorithm is presented in Algorithm 1. Feature ranking algorithm (with a weight function) helps to identify the most important features based on the weights associated with each feature. The weight function for i th feature is defined as\nwt f i = G( f i ) n i=1 G( f i ),\nwhere n is the number of features, G( f i ) represents the information gain value (i.e., the amount of information which is gained for a feature) of each feature f i , and it is computed based on Shannon's entropy model [35] (lines 1-3). Using the weight function (line 2, Algorithm 1), a set of features will be identified as important features, and other set of features will be identified as less influential features based on the available Twitter network data set. For example (i.e., for some data set), spam content, URL redirection length, and relative position of initial URLs may be the most important features, whereas URL without hostname and presence of symbols (like @, -, and #) may be the least influential features for identifying malicious information in tweets. However, the actual set of important features will be determined based on higher weight values on a given data set. Finally, feature ranking vector F = { f 1 , f 2 , . . . , f n } is constructed based on weights associated with each important feature (i.e., where important features will be chosen with higher weight values and the actual number of important features in F will be less than or equal to the number of features in the initial feature set F) (line 4, Algorithm 1).\n\n\nC. Trust Computational Model\n\nIn the Twitter network, there is an uncertainty in evaluating the trust value of participants because social trust relationship changes over time. To address this uncertainty, we consider two different methods: Bayesian learning and DST. The proposed trust computational model contains two parameters, direct trust and indirect trust, where the former is derived using the Bayesian learning and the latter is derived based on DST.\n\nLet G = (P, E) be a Twitter network, where P = { p 1 , p 2 , . . . , p n } represents a set of participants (users) and E ⊆ P × P is the set of directed edges representing social relationships among participants. The trust value of participant p i at time t (denoted as T p i (t)) is obtained using\nT p i (t) = αT D p i (t) + (1 − α)T I D p i (t)(1)\nwhere T D p i (t) and T I D p i (t) are the direct and indirect trusts of participant p i , respectively, at time t. Furthermore, α ∈ [0, 1] represents weight assigned to T D p i , and it is computed by adopting Shannon's entropy-based trust model [35].\n\n1) Direct Trust Computation: For MSBD, the direct trust value is evaluated based on identifying the malicious behavior of a participant in terms of posting malicious URLs in the tweets. We assume that participant p i posts malicious information in the j th tweet tw i j (t) at time t. The distrust value of participant p i posting j th tweet at time t (denoted as DT tw i j (t)) is given by\nDT tw i j (t) = pr (C = malicious|tw i j (t)).(2)\nWe consider two classes, namely, malicious and legitimate to train a classifier in order to identify the malicious tweets.\n\nIn this article, we use a Bayesian classifier in order to achieve better precision. In the Bayesian classification, we determine the class C to which a tweet belongs. The probability that tweet tw i j (t) belongs to class C (i.e., malicious) is denoted as pr (C = mali ci ous|tw i j (t)). In this article, we consider feature set with 11 features (for performance evaluation) that are extracted from each tweet (refer to Section IV-B). Furthermore, the feature ranking vector F is constructed with the weights associated with each important feature (as presented in Algorithm 1). Therefore, the tweet tw i j (t) is represented as a feature ranking vector F = { f 1 , f 2 , . . . , f n }. From the Bayesian learning [42], we compute the probability that a tweet (represented by feature ranking vector F) is malicious, and the probability is given by\npr (C = malicious|tw i j (t)) = pr (C = malicious| F) = pr (C = malicious) × pr ( F|C = malicious) pr ( F) = pr (C = malicious) × pr ( F|C = malicious) pr (C = malicious) × pr ( F|C = malicious) + pr (C = legitimate) × pr ( F|C = legitimate) . (3)\nWe assign weights to each feature before computing the trust value of a tweet because features play a vital role for evaluating the trustworthiness of tweets posted by each participant. We rank the features based on their associated weights (as discussed in Section IV-B). Ranking these features plays a vital role in detecting malicious social bots. Therefore, the probability of each feature is multiplied with its associated weight wt f i (refer to Algorithm 1)\npr ( F|C = malicious) = pr ( f 1 , f 2 , . . . |C = malicious) = n i=1 pr ( f i = x i |C = malicious) × wt f i .(4)\nIn (4), each feature is conditionally independent. The probabilities pr ( f i = x i |C = mali ci ous) are estimated as the ratio of number of tuples containing a malicious class C (in training data tuples) having the value x i for feature f i (i.e., f i is a ranked feature) and number of tuples containing a malicious class C (in training data tuples). Substituting (4) into (3), the probability pr (C = mali ci ous|tw i j (t)) [which is DT tw i j (t) as given in (2)] can be obtained. The trust value of j th tweet posted by i th participant at time t (denoted as T tw i j (t)) is determined by\nT tw i j (t) = 1 − DT tw i j (t).(5)\nTherefore, the direct trust value of participant p i [denoted as T D p i (t)] at time t is computed as\nT D p i (t) = m j =1 T tw i j (t) m(6)\nwhere if participant p i has posted j th tweet tw to one of its neighboring participant (friend) then 4: F ← Extract feature set of tw i j\n\n\n5:\n\nF ← Feature_ranking(F) 6: for each feature f i ∈ F do 7: Compute pr ( f 1 , .., f n |C = mali ci ous) using Equation (4) 8:\n\nend for 9: Compute T tw i j (t) using Equation (5) 10:\n\n\nConcatenation of T D (t) with value T tw i j (t) and\n\nT D (t) is updated with the concatenated values 11: end if 12: end for 13: Compute direct trust T D p i (t) using Equation (6) Direct trust computation algorithm (as discussed in Algorithm 2) takes a series of tweets posted by a participant p i at time t as input. We extract a set of features F from each j th tweet tw i j posted by a participant p i at time t (lines 2-4). Based on the extracted features, a feature ranking vector F is constructed with the weights associated with the features (line 5). The probability of each feature in F belonging to malicious class C is determined using (4). Furthermore, the distrust value of a tweet is computed by substituting (4) into (3) and finally from (2)  2) Indirect Trust Computation: The indirect trust is determined by considering belief values of all one-hop neighbors of a participant p i . Although the direct trust value is important in evaluating the trustworthiness of the participant, the belief values collected from multiple neighboring participants are also helpful in evaluating the trustworthiness of the participant. Moreover, if legitimate participants randomly add malicious social bots as their friends, then the tweets posted by legitimate participants are likely to be considered as malicious because the legitimate participants are influenced by the malicious social bots [43]. Hence, the belief values collected from the multiple neighboring participants can reduce the bias in the trust value of a participant. The belief value of each onehop neighboring participant is considered as conditionally independent. The direct trust value as computed using (6) \nA) = T D p 1 (t) b p 1 (Ā) = 0 b p 1 (μ) = 1 − T D p 1 (t).(7)\nSimilarly, if participant p i has a neighbor p 2 , then the belief value of p 2 with an assumption A (that participant p 2 is legitimate) is denoted as b p 2 (A). The belief values are computed as follows:\nb p 2 (A) = T D p 2 (t) b p 2 (Ā) = 0 b p 2 (μ) = 1 − T D p 2 (t).(8)\nFrom the belief values of one-hop neighboring participants of p i , we identify whether participant p i is legitimate or malicious social bot based on the trust value of neighbors of p i (say p 1 and p 2 ). Therefore, the beliefs of p 1 and p 2 are combined by using Dempster's rule [20] that is given by\nb p 1 (A) ⊕ b p 2 (A) = 1 k b p 1 (A)b p 2 (A) + b p 1 (A)b p 2 (μ) + b p 1 (μ)b p 2 (A) b p 1 (Ā) ⊕ b p 2 (Ā) = 1 k b p 1 (Ā)b p 2 (Ā) + b p 1 (Ā)b p 2 (μ) + b p 1 (μ)b p 2 (Ā) b p 1 (μ) ⊕ b p 2 (μ) = 1 k b p 1 (μ)b p 2 (μ) (9) where, k = b p 1 (A)b p 2 (A) + b p 1 (A)b p 2 (μ) + b p 1 (μ)b p 2 (A) + b p 1 (μ)b p 2 (μ) + b p 1 (Ā)b p 2 (Ā) + b p 1 (Ā)b p 2 (μ) + b p 1 (μ)b p 2 (Ā) .(10)\nTherefore, the indirect trust value of p i at time t (denoted as T I D p i (t)) is derived by combining the belief values [45] of all one-hop neighbors (of p i ) and is determined as\nT I D p i (t) = b p 1 (A) ⊕ b p 2 (A)⊕, . . . , ⊕b p L (A)(11)\nwhere participant p 1 , p 2 , . . . , p L represents neighbors of p i and the belief aggregation operator (i.e., ⊕) is commutative and associative [44]. Indirect trust computation algorithm is discussed in Algorithm 3. If participant p i has one or more one-hop neighboring participants, then the indirect trust value of participant p i at time t requires the belief values of its neighbors (say p 1 , p 2 , . . . p L ). The belief value of each p i neighbor is determined using the direct trust computation (as discussed in Algorithm 2) (lines 1\n\n\n-4). Moreover, each neighboring participant's direct trust value T D p k (t) is concatenated with a set T I D (t) (where T I D (t) is initially φ as shown in Line 1, Algorithm 3) in order to determine indirect trust value of a participant p i at time t (line 5). Then, T I D (t) is updated with\n\nthe concatenated values. The entire process is repeated for each neighboring participants (i.e., for L number of neighbors). Finally, the indirect trust value of p i is computed by combining the belief values (i.e., direct trust values) of all one-hop neighbors of p i using (11) by considering {T D p 1 (t), . . . , T D p L (t)} (i.e., from the set T I D (t)) (line 7, Algorithm 3). Otherwise, the indirect trust value T I D p i (t) is set to 0 (line 9). For example, if participant p i has two neighbors (say p 1 and p 2 ), then the result of combining two belief functions is computed as follows [using (9)\n]: b p 1 (A) = 0.5, b p 1 (Ā) = 0, b p 1 (μ) = 0.5, b p 2 (A) = 0.8, b p 2 (Ā) = 0, b p 2 (μ) = 0.2, b p i (A) = b p 1 (A) ⊕ b p 2 (A) = 0.5 * 0.8 + 0.5 * 0.2 + 0.8 * 0.5 = 0.90, b p i (Ā) = b p 1 (Ā) ⊕ b p 2 (Ā) = 0 * 0 + 0.2 * 0 + 0.5 * 0 = 0, and b p i (μ) = 0.5 * 0.2 = 0.10. The indirect trust value of p i is 0.90.\n\nD. Learning Automata-Based Malicious Social Bot Detection Using Trust Model\n\nIn this section, we first discuss the motivation for applying the LA model for malicious bot detection. Later, the LA-MSBD algorithm has been proposed by considering direct and indirect trust components with various URL-based features in a Twitter network.\n\n\n1) Motivation Behind Trust Computation and Learning Automata Model:\n\nMalicious social bots usually send malicious or fake content to their legitimate neighboring participants. Thereby, malicious bots can reduce the trust value of their legitimate neighbors [46]. This motivated us to consider two trust parameters, namely, direct trust (i.e., from users' own  Compute trust value of p i (T p i (t)) using Equation (1) 8:\n\nCompute action probability value pr (t) = 1 − T p i (t) 9: if T p i (t) < T f then 10: Concatenation of set β with a string 1 and β is updated with the concatenated values 11: else 12: Concatenation of set β with a string 0 and β is updated with the concatenated values 13: end if 14: Compute pr (t + 1) using Equation (12) 15: end for 16: if (no. of 1's in β > no. of 0's in β) then 17: 18: reward p i using T p i (t) = T p i (t) − ε 19: else 20: p i is legitimate and added into the legitimate list of participants. 21: Concatenation of set T with the value T p i (t) and T is updated with the concatenated values 22: end if 23: β = φ 24: end for 25: return T with list of legitimate participants and S b behavioral patterns while interacting in its neighborhood) and indirect trust (i.e., from belief values that are collected from the neighbors depending on their behavioral patterns) for MSBD. In OSNs, the behavior of malicious social bot changes with time. For constructing ground truth, involving human experts may not always provide genuine interpretation by manually observing users' behavioral patterns [34]. Moreover, most of the existing supervised machine learning algorithms are not suitable when a malicious user manipulates data with noisy patterns (i.e., where data is biased with fake information) [18]. This motivated us to design an LA model (which is one of the reinforcement learning techniques) to detect the participants who are posting malicious information in the tweets. A participant cannot be considered as legitimate by posting a series of legitimate tweets at a particular time slot t. This is due to the fact that the participant may change its behavior (with time) and start posting malicious tweets again; this, in turn, misleads the detection of malicious bots. The motivation behind using LA is to detect a participant as a malicious social bot only after executing a finite number of learning actions. In our work, a finite number of learning actions represent a series of tweets posted by a participant at different time slots.\nS b = S b ∪ { p i } // p i -malicious social bot\n2) Learning Automata Model: In the proposed model, LA is defined as < L A, A, pr, β, r s , F >, where L A = {la 1 , la 2 , . . . , la n } and each automaton la i is associated with each participant (user) in the Twitter network. Let A = {a 1 , a 2 , . . . , a n } represent the set of actions, where each action a i represents a series of tweets posted by participant p i in the Twitter network. Let pr = {pr 1 , pr 2 , . . . , pr n } be the set of action probability values of participant p i posting malicious information in the tweets at different time slots. Let a k (t) represent a learning action selected by an automata at time t. The learning actions are performed on an environment and produces either a penalty or a reward. In addition, β = {β 1 , β 2 , . . . , β n } represents a set of reinforcement signals for each participant p i at different time slots, where β i ∈ {1, 0}. If β i = 1, it implies that the proposed LA model identifies the malicious information from series of tweets posted by a participant at time slot t. The term r s represents the learning algorithm in order to update reinforcement signal, which is based on either penalty (ρ) or reward (r ). For each tweet, we predict success or failure of identifying a tweet as malicious. Thus, β i = 0 implies that the learning algorithm r s fails to identify the malicious tweets. Furthermore, F : pr × β → pr represents the updation of action probability values with respect to the current action probability value and the response from the environment (i.e., β). If the learning automaton obtains a reward (i.e., when β i = 1), then the probability value pr (t + 1) remains constant (unchanged). Otherwise, if the learning automaton obtains a penalty (i.e., when β i = 0), then the probability value pr (t + 1) (at next time slot t + 1) is updated as follows [47]:\npr (t +1) = (1−η) pr (t), β i = 0 pr (t), β i = 1 where η is a constant.(12)\nIn the Twitter network, a tweet may contain malicious information that may lead to several vulnerabilities (such as performing phishing attacks). Malicious social bots are usually used for posting (or reposting) spam (or malicious) tweets. In the proposed model, if a participant p i posts a tweet to a participant p j in the Twitter network, then the learning algorithm r s determines whether the tweet contains any malicious information, such as malicious URL redirection, frequency of shared URLs, and spam content in URL (which are described in Section IV-B). In this article, reward r is defined as the probability of tweet that contains malicious information. The participant who posts malicious information in the tweet is rewarded for his/her postings, and the trust value of the participant will be reduced. Furthermore, if a participant is continuously posting retweeted tweets with malicious information, then the participant will gain a high reward for his/her malicious postings. Therefore, as the reward of the participant increases, the distrust value also increases.\n\n\n3) Proposed Learning Automata-Based Malicious Social Bot Detection Algorithm:\n\nWe present an LA-MSBD (refer to Algorithm 4) by incorporating trust computational model in order to identify the malicious social bots. For each participant p i , the LA is activated, and the trust value of p i at time t [denoted as T p i (t)] is computed using (1) (lines 1-7). Moreover, the Direct_Trust_Computation() (as mentioned in Line 5, Algorithm 4) will be determined using Algorithm 2, and Indirect_Trust_Computation() (as mentioned in Line 6, Algorithm 4) will be determined using Algorithm 3. Initially, the action probability value is computed as 1 − T p i (t) in order to identify the malicious information in the tweets posted by participant p i at time slot t (line 8). If T p i (t) < T f , then p i is rewarded by concatenating reinforcement signal set β with a string 1. This implies that the proposed LA-MSBD algorithm identifies a participant as a malicious social bot at time slot t. Otherwise, p i is penalized by concatenating β with a string 0. Then, β is updated with the concatenated values. The action probability value is updated for the next time slot using (12). The entire process is repeated for a finite number of learning actions at different time slots (lines 9-15). Therefore, reinforcement signal β is obtained as a string of 0s and 1s from different time slots t. Moreover, the proposed LA-MSBD algorithm identifies a participant as a malicious social bot if the number of 1s in β is greater than the number of zeroes in β. Once a participant is detected as a malicious social bot then the participant is rewarded by reducing the trust value of the participant with reward constant (where ∈ [0, 0.05]). Otherwise, the participant is considered legitimate and added into the legitimate list of participants (lines [16][17][18][19][20][21][22]. Moreover, the reinforcement signal set β is reset to null after identifying each participant as a legitimate or social bot (line 23). Therefore, LA returns a set of trust values of all the legitimate participants with a list of legitimate participants and a set of malicious social bots in the Twitter network (line 25).\n\nThe malicious social bots (or spammer bots) can manipulate profile features (such as the number of tweets, retweets, and followers) by using pseudorandom generator functions [9]. Moreover, malicious social bots can manipulate the content of each tweet. When malicious social bots perform phishing attacks, our proposed LA-MSBD algorithm analyzes the malicious behavior of tweets (containing URL) by considering URL-based features (such as URL redirection, frequency of shared URLs, and spam content in URL) for bot detection. However, malicious social bots cannot manipulate URL redirection chains and spam content in URL because their intention is to perform phishing attacks through URL redirection. Hence, our proposed method detects malicious social bots (by considering URL-based features) from the phishing attack.\n\nThe \n\n\nV. EXPERIMENTAL RESULTS\n\nIn this section, the performance of our proposed LA-MSBD algorithm is evaluated by considering two Twitter data sets, namely, Social Honeypot 1 data set [22] and The Fake Project 2 data set [21]. The Fake Project data set [21] and the Social Honeypot data set [22] contain the labels for tweets (i.e., as legitimate and malicious tweets) and users (i.e., legitimate users and malicious bots). The Fake Project data set contains 3474 legitimate participants and 1000 malicious social bots (i.e., folder named traditional_spambots_1) [21]. Social Honeypot data set contains 19 276 legitimate participants and 22 223 social bots [22]. For example, Social Honeypot data set [22] contains a set of labeled legitimate users and content polluter tweets (i.e., bots tweets). From the Social Honeypot data set, we have considered that the tweets posted by legitimate users are (implicitly) labeled as legitimate tweets, and all tweets posted by content polluters are malicious tweets. Moreover, the Social Honeypot data set contains a text file as \"legitimate users tweets.txt\" with samples in the form of \"UserID, TweetID, Tweet, and CreatedAt.\" Furthermore, we have collected all the URLs in the tweets in order to extract the URL-based features. Using Algorithm 1, the feature ranking vector is constructed by choosing a set of features that have higher weight values for the above-mentioned data sets. The details of the Social Honeypot and The Fake Project data sets are presented in Table III. The proposed LA-MSBD algorithm identifies the participants as either legitimate participants or malicious social bots by considering URL-based features. Moreover, each URL feature is conditionally independent. If a tweet is determined to be malicious based on one URL feature and legitimate based on another URL feature, then the probability of the tweet being malicious is computed by using (3). If a malicious tweet and a legitimate tweet both are posted by the same participant p i , then we first determine the trustworthiness of each tweet by using (5). Later, we determine the trust value of participant p i by using (6). Moreover, if a participant posts a series of tweets with malicious information (or spam content in the tweet), then the participant is identified as a malicious social bot. For example, if a participant p i is marked as a malicious social bot in January 2019, then based on his/her malicious behavior in subsequent months, the proposed LA-MSBD algorithm identifies the user as either a malicious social bot or legitimate. Fig. 4 shows the variation of false-negative (FN) and falsepositive (FP) rates for different threshold values. The FN rates start decreasing when the threshold value is around 70%t and 60% for The Fake Project data set and the Social Honeypot data set, respectively. This implies that the proposed LA-MSBD algorithm can achieve a high detection rate (i.e., in terms of recall) to detect malicious social bots for the above threshold values. Therefore, we consider 70% and 60% as threshold values for The Fake Project data set and the Social Honeypot data set, respectively. However, the threshold value may vary depending on the nature of the data set. We compare our proposed LA-MSBD algorithm in two different ways: 1) LA-MSBD algorithm with four conventional machine learning algorithms and 2) LA-MSBD algorithm with the existing social bot detection algorithms, such as learning from unlabeled tweets (Lfun) [15] and neural-network-based redirection spam (NN-RS) detection [41].\n\n\nA. Comparison With Conventional Machine Learning Algorithms\n\nFirst, we compare our proposed LA-MSBD algorithm with four conventional machine learning algorithms [such as support vector machine (SVM), multilayer perceptron (MLP), logistic regression (LR), and random forest (RF)] by considering URL-based features with fivefold cross-validation for MSBD. We use scikit-learn library (with the respective packages) for the following four conventional machine learning algorithms.\n\nSVM: It is one of the popular supervised machine learning methods in order to classify the data. Moreover, SVM is used for both linear and nonlinear separation of data by constructing a hyperplane in order to reduce the overfitting of data [48]. For SVM, we use LinearSVC with RBF kernel (from sklearn package) by considering URL-based features.\n\nMLP: It is a feedforward neural network with at least three layers, namely, input layer, hidden layer, and output layer. MLP uses backpropagation for training, and network weights can be adjusted in order to minimize the error between actual and predicted output [49]. For MLP, we use MLPClassifier with stochastic gradient descent (from sklearn.neural_network package) by considering URL-based features.\n\nLR: It uses logistic function to predict the outcome in terms of binary value (such as true/false, win/lose, and yes/no) [50]. For LR, we use LogisticRegression (from sklearn.linear_model package of scikit-learn library) by considering URL-based features.\n\nRF: It is an ensemble learning algorithm, which implies that the algorithm uses other machine learning algorithms in order to achieve better performance. Moreover, the RF algorithm is used for constructing multiple decision trees based on random subsets of features [51]. For RF, we use RandomForestClassifier (from sklearn.ensemble package) by considering URL-based features.\n\nThe performance of our proposed LA-MSBD algorithm is evaluated in terms of F-measure, precision, recall, and accuracy by taking a set of URL-based features into consideration. We summarize the results of the proposed LA-MSBD algorithm by considering the following evaluation metrics.   \n\n\n4) True Negative (TN):\n\nParticipants detected as legitimate participants are really legitimate participants. We compare the outcomes of our proposed LA-MSBD algorithm with other existing algorithms based on the following metrics:\nPrecision = TP TP + FP Recall = TP TP + FN(13)F-measure = 2 * Precision * Recall Precision + Recall(14)Accuracy = TP + TN TP + FN + FP + TN .(15)\nTables IV and V show the comparison of the results of the proposed LA-MSBD algorithm with four conventional machine learning algorithms (such as SVM, MLP, LR, and RF) for fivefold cross-validation on two data sets (such as the Social Honeypot data set and The Fake Project data set) by considering URL-based features. For SVM, the MSBD performance in terms of precision is around 74%, which is a moderate value for binary data classification. The experimental results illustrate that our proposed LA-MSBD algorithm gives better performance compared with conventional machine learning algorithms in terms of precision. The reason is that the data labeled by crowd-sourcing methods (i.e., which uses human intelligence or experts to label participant as either a bot or a legitimate) cannot efficiently provide genuine interpretation by manually observing behavioral patterns of a participant with its neighboring participants. Furthermore, the trust value of a participant changes over time based on their behavioral patterns. Moreover, our proposed LA-MSBD algorithm is based on the malicious behavior of a participant (at different time intervals) and the belief values collected from the multiple one-hop neighboring participants (refer Section IV-C2). Therefore, by incorporating direct and indirect trust parameters with the LA model, our proposed LA-MSBD algorithm has achieved approximately 95% (for The Fake Project data set) on the precision with fivefold cross-validation. Therefore, the learning process conventional machine learning algorithms have achieved less precision compared with our proposed LA-MSBD algorithm. Furthermore, the precision value obtained for The Fake Project data set is better than the Social Honeypot data set because the Social Honeypot data set contains noisy and untrustworthy information in its user content features than The Fake Project data set.     LA-MSBD algorithm outperforms the existing algorithms. For The Fake Project data set, we observe that the precision level of the proposed LA-MSBD algorithm is 10% higher than LR when performing social bot detection for the tenth day.\n\nFrom Fig. 6(a), we observe that the precision level of the proposed LA-MSBD algorithm is around 10% higher than LR while performing social bot detection on the Social Honeypot data set for the month of October. Figs. 5(c) and 6(c)  show that the F-measure of our proposed is above 90% for all days and months. The SVM has the lowest F-measure of social bot detection that is below 75%. For The Fake Project data set, the highest precision level of the proposed LA-MSBD algorithm is around 95%, and the highest precision level of RF is around 92%. For MSBD in the Social Honeypot data set, the highest precision level of the proposed LA-MSBD algorithm is around 90%, and the highest precision level of RF is around 87%. This is due to the fact that the proposed LA-MSBD algorithm executes for a finite set of learning actions to update the action probability value and achieves the advantages of incremental learning. Hence, the LA model with a trust component identifies the malicious tweets that are posted by malicious social bots.\n\n\nB. Comparison With the Existing Social Bot Detection Algorithms\n\nThe proposed LA-MSBD algorithm provides better performance compared with the existing algorithms, such as learning from unlabeled tweets (Lfun) [15] and NN-RS detection [41]. From Fig. 7, we can observe that the proposed LA-MSBD algorithm with direct and indirect trust computation has the highest precision among the three approaches. Furthermore, we can observe that the proposed LA-MSBD algorithm with direct and indirect trust achieves 2%-3% improvements on precision value over our proposed LA-MSBD with only direct trust. The first reason is that the indirect trust of the participant is derived from DST by considering the belief values of all one-hop neighbors. The second reason is that malicious social bots may be trustworthy toward one participant and may be malicious toward other participants.\n\nIn the proposed LA-MSBD, we have considered search engine-based features (like PageRank and domain expiration) into consideration for the detection of malicious social bots because most of the popular legitimate URLs may appear within the top-k search engine results. Moreover, we compare in terms of recall, precision, and F-measure to detect malicious social bots. Table VI shows the comparison of the proposed algorithm with other existing approaches. The existing Lfun [15] and NN-RS [41] approaches obtain lower precision and recall compared with our proposed LA-MSBD algorithm. For The Fake Project data set, the recall of the proposed LA-MSBD algorithm is 96.12% and the recall of the existing Lfun [15] is 90.88%. In the proposed LA-MSBD algorithm, we have taken third-party-based features (such as DNS information, and WHOIS database 3 ) into consideration for detection of malicious social bots. Thus, the recall of our proposed algorithm is higher than the existing algorithms. For The Fake Project and Social Honeypot data sets, we can observe that the precision of the proposed LA-MSBD algorithm provides 3% improvement over the existing Lfun [15].\n\nFigs. 8 and 9 show the accuracy of legitimate participant and MSBD for three different approaches, namely, LA-MSBD, Lfun [15], and NN-RS [41]. From Figs. 8(a) and (b) and 9(a), we can observe that the accuracy of legitimate participant detection is stable, and it is more than 90% for the proposed LA-MSBD and the existing Lfun approaches. From Fig. 8(c), we can observe that the accuracy of the legitimate participant is more than 85% for the existing NN-RS approach. From Fig. 8, we observe that the accuracy of MSBD fluctuates. This is due to the fact that bots post less number of malicious tweets (at a particular time slot t) in order to avoid detection. The MSBD (i.e., in terms of accuracy) for the proposed LA-MSBD algorithm is around 92% on the first day and decreases to 70% on the fifth day [as shown in 8(a)]. The MSBD for the existing Lfun approach has been decreased from 90% on the first day to almost 65% on the fifth day [as shown in Fig. 8(b)]. Moreover, the MSBD for the existing NN-RS approach has been decreased from 81% on the first day to almost 60% on the fifth day [as shown in Fig. 8(c)]. Similarly, the results for the different approaches can be compared accordingly for different days (as shown in Fig. 8). From Fig. 9, we observe that the accuracy of MSBD fluctuates. This is due to the fact that the malicious social bots have reduced the length of URL redirection chains because long URL redirection chains are usually considered as suspicious. The MSBDs for both the proposed LA-MSBD and the existing Lfun algorithms are around 90% on May, and the accuracy reduces to 75% on September [as shown in Fig. 9(a)]. However, in other months, the accuracy of the proposed LA-MSBD algorithm is better than the existing Lfun approach. Moreover, the social bot detection for the existing NN-RS approach decreases from 85% in the first month to almost 60% on other months [as shown in Fig. 9(c)]. On average, the proposed LA-MSBD algorithm provides better accuracy over the existing algorithms, namely, Lfun and NN-RS.\n\n\nVI. CONCLUSION\n\nThis article presents an LA-MSBD algorithm by integrating a trust computational model with a set of URL-based features for MSBD. In addition, we evaluate the trustworthiness of tweets (posted by each participant) by using the Bayesian learning and DST. Moreover, the proposed LA-MSBD algorithm executes a finite set of learning actions to update action probability value (i.e., probability of a participant posting malicious URLs in the tweets). The proposed LA-MSBD algorithm achieves the advantages of incremental learning. Two Twitter data sets are used to evaluate the performance of our proposed LA-MSBD algorithm. The experimental results show that the proposed LA-MSBD algorithm achieves up to 7% improvement of accuracy compared with other existing algorithms. For The Fake Project and Social Honeypot data sets, the proposed LA-MSBD algorithm has achieved precisions of 95.37% and 91.77% for MSBD, respectively. Furthermore, as a future research challenge, we would like to investigate the dependence among the features and its impact on MSBD.\n\nFig. 1 .\n1Malicious act on URL shortened service.\n\nDefinition 1 (\n1Direct Trust): The direct trust is defined as belief value of all tweets posted by each participant and denoted as T D p i (t). Let T D p i (t) ∈ [0, 1] represent the direct trust value of participant p i and T tw i j (t) ∈ [0, 1] represent trustworthiness of j th tweet posted by i th participant at time t. If T D p i (t) = 0, it implies that all the tweets posted by participant p i contain completely fake or malicious information. If T D p i (t) = 1, it implies that participant p i consistently posts trustworthy information in the tweets. Definition 2 (Indirect Trust): The indirect trust is a belief value of tweets posted by all one-hop neighboring participants of participant p i at time t [denoted as T I D p i (t)]. If neighbors of a participant are trustworthy, then the participant is more likely to be trustworthy. T I D p i (t) ∈ [0, 1] represents the indirect trust value of participant p i . If T I D p i (t) = 0, it implies that all the tweets posted by all the neighbors of participant p i contain completely fake or malicious information. If T I D p i (t) = 1, it implies that all the tweets posted by all the neighbors of participant p i contain completely trustworthy information. Problem (MSBD): Given a Twitter network G(t) = (P(t), E(t)) with series of m tweets tw p i (t) = {tw i1 (t), tw i2 (t), . . . , tw im (t)} posted by participant p i at different times t ∈ 1, 2, . . . , τ , where P(t) is a set of participants and E(t) is a set of social relationships (directed edges) at time t. Let T P (t) represent the set of trust values (by considering both direct trust and indirect trust) of all the participants for all the posted tweets by the participants at time t. The goal of trust evaluation is to determine the\n\nFig. 2 .\n2Proposed framework for detecting malicious social bots.\n\n\nT tw i j (t) is the trustworthiness of the j th tweet posted by the i th participant at time t, and m represents the number of tweets posted by p i . T D (t) = φ 2: for each tweet tw i j j=1 to m do 3:\n\n\n(lines[6][7][8]. The trust value of the j th tweet posted by a participant p i [i.e., denoted as T tw i j (t)] is determined using (5) (line 9). Moreover, each trust value T tw i j (t) is concatenated with a set T D (t) (where T D (t) is initially φ as shown in Line 1, Algorithm 2) in order to determine direct trust value of a participant p i at time t (line 10). Then, T D (t) is updated with the concatenated values. The entire process is repeated for m number of tweets posted by each participant p i . Finally, the direct trust value T D p i (t) of a participant p i at time t is determined using (6) by considering {T tw i1 (t), . . . , T tw im (t)} (i.e., from the set T D (t)) (line 13, Algorithm 2).\n\n\nwill be the belief value of a participant p i at time t, and it is used by DST[20], where Dempster'T I D (t) = φ 2: if participant p i has one or more one-hop neighboring participants then3:    for each p k ∈ N B( p i ) do// N B( p i )-neighbors of p i T I D (t) with value T D p k (t) and T I D (t) is updated with the work, let X={malicious, legitimate} and A be an assumption that neighbors of a participant p i are legitimate. Based on assumption A, the neighbors of p i belongs to one of the state's power set 2 X = {{}, A = {legitimate}, A = {malicious}, and μ = X}. Then, the indirect trust value of participant p i is computed from the belief value of multiple one-hop neighbors of p i based on assumption A. If participant p i has a neighbor p 1 , then the belief value of p 1 with an assumption A (that participant p 1 is legitimate) is denoted as b p 1 (A), and it is computed as the direct trust of p 1 using (6), i.e., b p 1 (A) = T D p 1 (t). According to assumption A, the belief value b p 1 (Ā) = 0. From DST[20],[44] m∈ 2 X b p 1 (m) = 1, then the belief value b p 1 (μ) = 1 − T D p 1 (t). If participant p 1 is legitimate, then participant p i is likely to be legitimate. Therefore, the belief values are shown as b p 1 (\n\n\nSet of participants P = {p 1 , . . . , p n } in Twitter, τ : Number of time slots, T f : Threshold value, : Reward parameter Output: T : a set of trust values of all legitimate participants with list of legitimate participants, S b : a set of malicious social bots Assumptions:Let L A = {la 1 , la 2 , . . . la n } be set of LA, where la i represents learning automata for each participant. begin 1: S b = φ, β = φ, T = φ 2: Learning automata is activated for each participant p i 3: for each participant p i ∈ P do4:    for t = 1, 2, . . . , τ do 5:\n\nFig. 3 .\n3LA model for social bot detection in the Twitter network.\n\n\ntime complexity of the proposed LA-MSBD Algorithm 4 is O(nτ km), where n is the number of participants (or users), τ is the number of time slots, m is the number of tweets posted by each participant at a particular time slot, and k is the number of neighbors of a participant p i . In Algorithm 4, for each time slot t, the time complexity of direct trust computation Algorithm 2 is O(Fm), whereF is the number of features (in a feature ranking vector F as defined in Section IV-B). The time complexity of indirect trust computation Algorithm 3 is O(Fkm). Therefore, the time complexity for one time slot is O(Fm +Fkm) that can be rewritten as O(km) by assumingF as a constant. For the number of time slots in Algorithm 4, the time complexity of each participant is O(τ km). Therefore, the time complexity of the proposed LA-MSBD algorithm is O(nτ km).\n\nFig. 4 .\n4Variation of FN and FP rates for different threshold values. (a) The Fake Project data set. (b) Social Honeypot data set.\n\n1 )\n1True Positive (TP): Participants detected as malicious social bots are really malicious social bots. 2) False Positive (FP): Participants detected as malicious social bots are really legitimate participants. 3) False Negative (FN): Participants detected as legitimate participants are really malicious social bots.\n\nFig. 5 .\n5MSBD on The Fake Project data set. (a) Precision. (b) Recall (TP Rate). (c) F-measure.\n\nFig. 6 .\n6MSBD on Social Honeypot data set. (a) Precision. (b) Recall (TP Rate). (c) F-measure.\n\nFigs. 5\n5and 6 show the performance of social bot detection algorithms in terms of precision, recall (TP rate), and F-measure on different time slots. Figs. 5(a) and 6(a) illustrate that the LA-MSBD algorithm shows better performance in terms of precision compared with the four conventional machine learning algorithms, such as SVM, MLP, LR, and RF. Moreover, in terms of recall [refer to Figs. 5(b) and 6(b)] and F-measure [refer to Figs. 5(c) and 6(c)], the proposed\n\nFig. 7 .\n7Comparison (performance in terms of precision) of the proposed LA-MSBD algorithm with the existing algorithms. (a) The Fake Project data set. (b) Social Honeypot data set.\n\nFig. 8 .\n8Detection rates (in terms of accuracy) on The Fake Project data set. (a) LA-MSBD. (b) Lfun[15]. (c) NN-RS[41].\n\nFig. 9 .\n9Detection rates (in terms of accuracy) on the Social Honeypot data set. (a) LA-MSBD. (b) Lfun[15]. (c) NN-RS[41].\n\nTABLE I NOTATIONS\nIparameters in order to evaluate trustworthiness of all tweets posted by each participant.\n\nTABLE II\nIIURL-BASED FEATURES position of initial URL, and suspicious words in a URL are considered in order to detect malicious tweets.Algorithm 1 Feature Ranking() \n1: for each feature f i ∈ F do \n\n2: \n\n\n\nTABLE III SUMMARY\nIIIOF TWITTER DATA SETS\n\nTABLE IV COMPARISON\nIVPERFORMANCE OF THE PROPOSED LA-MSBD ALGORITHM WITH THE EXISTING ALGORITHMS FOR FIVEFOLD CROSS VALIDATION OF THE FAKE PROJECT DATA SET\n\nTABLE V\nVCOMPARISON PERFORMANCE OF THE PROPOSED LA-MSBD ALGORITHM WITH THE EXISTING ALGORITHMS FOR FIVEFOLD CROSS VALIDATION OF THE SOCIAL HONEYPOT DATA SET\n\nTABLE VI COMPARISON\nVIOF PERFORMANCE ON TWO DATA SETS\nhttp://infolab.tamu.edu/data/ 2 http://mib.projects.iit.cnr.it/data set.html\nhttp://whois.domaintools.com\n\nDetecting malicious social bots based on clickstream sequences. P Shi, Z Zhang, K.-K.-R Choo, IEEE Access. 7P. Shi, Z. Zhang, and K.-K.-R. Choo, \"Detecting malicious social bots based on clickstream sequences,\" IEEE Access, vol. 7, pp. 28855-28862, 2019.\n\nAdaptive deep Q-learning model for detecting social bots and influential users in online social networks. G Lingam, R R Rout, D V L N Somayajulu, Appl. Intell. 4911G. Lingam, R. R. Rout, and D. V. L. N. Somayajulu, \"Adaptive deep Q-learning model for detecting social bots and influential users in online social networks,\" Appl. Intell., vol. 49, no. 11, pp. 3947-3964, Nov. 2019.\n\nBit.ly/practice: Uncovering content publishing and sharing through URL shortening services. D Choi, J Han, S Chun, E Rappos, S Robert, T T Kwon, Telematics Inform. 355D. Choi, J. Han, S. Chun, E. Rappos, S. Robert, and T. T. Kwon, \"Bit.ly/practice: Uncovering content publishing and sharing through URL shortening services,\" Telematics Inform., vol. 35, no. 5, pp. 1310-1323, 2018.\n\nFluxing botnet command and control channels with URL shortening services. S Lee, J Kim, Comput. Commun. 363S. Lee and J. Kim, \"Fluxing botnet command and control channels with URL shortening services,\" Comput. Commun., vol. 36, no. 3, pp. 320-332, Feb. 2013.\n\nA neural network-based ensemble approach for spam detection in Twitter. S Madisetty, M S Desarkar, IEEE Trans. Comput. Social Syst. 54S. Madisetty and M. S. Desarkar, \"A neural network-based ensemble approach for spam detection in Twitter,\" IEEE Trans. Comput. Social Syst., vol. 5, no. 4, pp. 973-984, Dec. 2018.\n\nComparisons of machine learning techniques for detecting malicious webpages. H B Kazemian, S Ahmed, Expert Syst. Appl. 423H. B. Kazemian and S. Ahmed, \"Comparisons of machine learning tech- niques for detecting malicious webpages,\" Expert Syst. Appl., vol. 42, no. 3, pp. 1166-1177, Feb. 2015.\n\nA framework for real-time spam detection in Twitter. H Gupta, M S Jamal, S Madisetty, M S Desarkar, Proc. 10th Int. Conf. Commun. Syst. Netw. (COMSNETS). 10th Int. Conf. Commun. Syst. Netw. (COMSNETS)H. Gupta, M. S. Jamal, S. Madisetty, and M. S. Desarkar, \"A framework for real-time spam detection in Twitter,\" in Proc. 10th Int. Conf. Commun. Syst. Netw. (COMSNETS), Jan. 2018, pp. 380-383.\n\nTwitter spam detection based on deep learning. T Wu, S Liu, J Zhang, Y Xiang, Proc. Australas. Comput. Sci. Week Multiconf. Australas. Comput. Sci. Week MulticonfACSW3T. Wu, S. Liu, J. Zhang, and Y. Xiang, \"Twitter spam detection based on deep learning,\" in Proc. Australas. Comput. Sci. Week Mul- ticonf. (ACSW), 2017, p. 3.\n\nKey challenges in defending against malicious socialbots. Y Boshmaf, I Muslukhov, K Beznosov, M Ripeanu, Presented at the 5th USENIX Workshop Large-Scale Exploits Emergent Threats. Y. Boshmaf, I. Muslukhov, K. Beznosov, and M. Ripeanu, \"Key challenges in defending against malicious socialbots,\" Presented at the 5th USENIX Workshop Large-Scale Exploits Emergent Threats, 2012, pp. 1-4.\n\nPeri-watchdog: Hunting for hidden botnets in the periphery of online social networks. G Yan, Comput. Netw. 572G. Yan, \"Peri-watchdog: Hunting for hidden botnets in the periphery of online social networks,\" Comput. Netw., vol. 57, no. 2, pp. 540-555, Feb. 2013.\n\nProphiler: A fast filter for the large-scale detection of malicious Web pages. D Canali, M Cova, G Vigna, C Kruegel, Proc. 20th Int. Conf. World Wide Web. 20th Int. Conf. World Wide WebWWWD. Canali, M. Cova, G. Vigna, and C. Kruegel, \"Prophiler: A fast filter for the large-scale detection of malicious Web pages,\" in Proc. 20th Int. Conf. World Wide Web (WWW), 2011, pp. 197-206.\n\nA machine learning based approach for phishing detection using hyperlinks information. A K Jain, B B Gupta, J. Ambient Intell. Hum. Comput. 105A. K. Jain and B. B. Gupta, \"A machine learning based approach for phishing detection using hyperlinks information,\" J. Ambient Intell. Hum. Comput., vol. 10, no. 5, pp. 2015-2028, May 2019.\n\n6 million spam tweets: A large ground truth for timely Twitter spam detection. C Chen, J Zhang, X Chen, Y Xiang, W Zhou, Proc. IEEE Int. Conf. Commun. (ICC). IEEE Int. Conf. Commun. (ICC)C. Chen, J. Zhang, X. Chen, Y. Xiang, and W. Zhou, \"6 million spam tweets: A large ground truth for timely Twitter spam detection,\" in Proc. IEEE Int. Conf. Commun. (ICC), Jun. 2015, pp. 7065-7070.\n\nDetecting automation of Twitter accounts: Are you a human, bot, or cyborg?. Z Chu, S Gianvecchio, H Wang, S Jajodia, IEEE Trans. Dependable Secure Comput. 96Z. Chu, S. Gianvecchio, H. Wang, and S. Jajodia, \"Detecting automation of Twitter accounts: Are you a human, bot, or cyborg?\" IEEE Trans. Dependable Secure Comput., vol. 9, no. 6, pp. 811-824, Nov. 2012.\n\nStatistical features-based real-time detection of drifted Twitter spam. C Chen, Y Wang, J Zhang, Y Xiang, W Zhou, G Min, IEEE Trans. Inf. Forensics Security. 124C. Chen, Y. Wang, J. Zhang, Y. Xiang, W. Zhou, and G. Min, \"Statistical features-based real-time detection of drifted Twitter spam,\" IEEE Trans. Inf. Forensics Security, vol. 12, no. 4, pp. 914-925, Apr. 2017.\n\nPractical evasion of a learning-based classifier: A case study. N Rndic, P Laskov, Proc. IEEE Symp. Secur. Privacy. IEEE Symp. Secur. PrivacyN. Rndic and P. Laskov, \"Practical evasion of a learning-based classi- fier: A case study,\" in Proc. IEEE Symp. Secur. Privacy, May 2014, pp. 197-211.\n\nLearning-automatonbased online discovery and tracking of spatiotemporal event patterns. A Yazidi, O.-C Granmo, B J Oommen, IEEE Trans. Cybern. 433A. Yazidi, O.-C. Granmo, and B. J. Oommen, \"Learning-automaton- based online discovery and tracking of spatiotemporal event patterns,\" IEEE Trans. Cybern., vol. 43, no. 3, pp. 1118-1130, Jun. 2013.\n\nEvaluating learning automata as a model for cooperation in complex multi-agent domains. M R Khojasteh, M R Meybodi, Robot Soccer World Cup. SpringerM. R. Khojasteh and M. R. Meybodi, \"Evaluating learning automata as a model for cooperation in complex multi-agent domains,\" in Robot Soccer World Cup. Springer, 2006, pp. 410-417.\n\nFeature set identification for detecting suspicious URLs using Bayesian classification in social networks. C.-M Chen, D J Guan, Q.-K Su, Inf. Sci. 289C.-M. Chen, D. J. Guan, and Q.-K. Su, \"Feature set identification for detecting suspicious URLs using Bayesian classification in social networks,\" Inf. Sci., vol. 289, pp. 133-147, Dec. 2014.\n\nDempster-shafer theory for intrusion detection in ad hoc networks. T M Chen, V Venkataramanan, IEEE Internet Comput. 96T. M. Chen and V. Venkataramanan, \"Dempster-shafer theory for intru- sion detection in ad hoc networks,\" IEEE Internet Comput., vol. 9, no. 6, pp. 35-41, Nov. 2005.\n\nThe paradigm-shift of social spambots: Evidence, theories, and tools for the arms race. S Cresci, R Di Pietro, M Petrocchi, A Spognardi, M Tesconi, Proc. 26th Int. Conf. World Wide Web Companion. 26th Int. Conf. World Wide Web CompanionWWW CompanionS. Cresci, R. Di Pietro, M. Petrocchi, A. Spognardi, and M. Tesconi, \"The paradigm-shift of social spambots: Evidence, theories, and tools for the arms race,\" in Proc. 26th Int. Conf. World Wide Web Companion- (WWW Companion), 2017, pp. 963-972.\n\nSeven months with the devils: A long-term study of content polluters on Twitter. K Lee, B D Eoff, J Caverlee, Proc. ICWSM. ICWSMK. Lee, B. D. Eoff, and J. Caverlee, \"Seven months with the devils: A long-term study of content polluters on Twitter,\" in Proc. ICWSM, 2011, pp. 1-8.\n\nFull cycle analysis of a largescale botnet attack on Twitter. C Besel, J Echeverria, S Zhou, Proc. IEEE/ACM Int. Conf. Adv. Social Netw. Anal. Mining (ASONAM). IEEE/ACM Int. Conf. Adv. Social Netw. Anal. Mining (ASONAM)C. Besel, J. Echeverria, and S. Zhou, \"Full cycle analysis of a large- scale botnet attack on Twitter,\" in Proc. IEEE/ACM Int. Conf. Adv. Social Netw. Anal. Mining (ASONAM), Aug. 2018, pp. 170-177.\n\nDiscovery, retrieval, and analysis of the'star wars' botnet in twitter. J Echeverria, S Zhou, Proc. 2017 IEEE/ACM Int. Conf. Adv. Social Netw. Anal. Mining. 2017 IEEE/ACM Int. Conf. Adv. Social Netw. Anal. MiningJ. Echeverria and S. Zhou, \"Discovery, retrieval, and analysis of the'star wars' botnet in twitter,\" in Proc. 2017 IEEE/ACM Int. Conf. Adv. Social Netw. Anal. Mining 2017, 2017, pp. 1-8.\n\nSocialBotHunter: Botnet detection in Twitter-like social networking services using semisupervised collective classification. A Dorri, M Abadi, M Dadfarnia, Proc. IEEE 16th Int. Conf. Dependable, Autonomic Secure Comput., 16th Int. Conf. Pervasive Intell. Comput., 4th Intl Conf Big Data Intell. IEEE 16th Int. Conf. Dependable, Autonomic Secure Comput., 16th Int. Conf. Pervasive Intell. Comput., 4th Intl Conf Big Data IntellA. Dorri, M. Abadi, and M. Dadfarnia, \"SocialBotHunter: Bot- net detection in Twitter-like social networking services using semi- supervised collective classification,\" in Proc. IEEE 16th Int. Conf. Dependable, Autonomic Secure Comput., 16th Int. Conf. Pervasive Intell. Comput., 4th Intl Conf Big Data Intell. Comput. Cyber Sci. Technol. Congr. (DASC/PiCom/DataCom/CyberSciTech), Aug. 2018, pp. 496-503.\n\nUsing trust model for detecting malicious activities in Twitter. M Agarwal, B Zhou, Proc. Int. Conf. Social Comput., Behav.-Cultural Modeling, Predict. Int. Conf. Social Comput., Behav.-Cultural Modeling, PredictSpringerM. Agarwal and B. Zhou, \"Using trust model for detecting malicious activities in Twitter,\" in Proc. Int. Conf. Social Comput., Behav.-Cultural Modeling, Predict. Springer, 2014, pp. 207-214.\n\nDetection of social botnet using a trust model based on spam content in Twitter network. G Lingam, R R Rout, D V L N Somayajulu, Proc. IEEE 13th Int. Conf. Ind. Inf. Syst. (ICIIS). IEEE 13th Int. Conf. Ind. Inf. Syst. (ICIIS)G. Lingam, R. R. Rout, and D. V. L. N. Somayajulu, \"Detection of social botnet using a trust model based on spam content in Twitter network,\" in Proc. IEEE 13th Int. Conf. Ind. Inf. Syst. (ICIIS), Dec. 2018, pp. 280-285.\n\nEmpirical evaluation and new design for fighting evolving Twitter spammers. C Yang, R Harkreader, G Gu, IEEE Trans. Inf. Forensics Security. 88C. Yang, R. Harkreader, and G. Gu, \"Empirical evaluation and new design for fighting evolving Twitter spammers,\" IEEE Trans. Inf. Foren- sics Security, vol. 8, no. 8, pp. 1280-1293, Aug. 2013.\n\nUsing supervised machine learning algorithms to detect suspicious URLs in online social networks. M Al-Janabi, E D Quincey, P Andras, Proc. IEEE/ACM Int. Conf. Adv. Social Netw. Anal. Mining. IEEE/ACM Int. Conf. Adv. Social Netw. Anal. MiningM. Al-Janabi, E. D. Quincey, and P. Andras, \"Using supervised machine learning algorithms to detect suspicious URLs in online social net- works,\" in Proc. IEEE/ACM Int. Conf. Adv. Social Netw. Anal. Mining, Jul. 2017, pp. 1104-1111.\n\nWarningBird: A near real-time detection system for suspicious URLs in Twitter stream. S Lee, J Kim, IEEE Trans. Dependable Secure Comput. 103S. Lee and J. Kim, \"WarningBird: A near real-time detection system for suspicious URLs in Twitter stream,\" IEEE Trans. Dependable Secure Comput., vol. 10, no. 3, pp. 183-195, May 2013.\n\nMalicious URLs detection using decision tree classifiers and majority voting technique. D R Patil, J B Patil, Cybern. Inf. Technol. 181D. R. Patil and J. B. Patil, \"Malicious URLs detection using decision tree classifiers and majority voting technique,\" Cybern. Inf. Technol., vol. 18, no. 1, pp. 11-29, Mar. 2018.\n\nA new learning automatabased pruning method to train deep neural networks. H Guo, S Li, B Li, Y Ma, X Ren, IEEE Internet Things J. 55H. Guo, S. Li, B. Li, Y. Ma, and X. Ren, \"A new learning automata- based pruning method to train deep neural networks,\" IEEE Internet Things J., vol. 5, no. 5, pp. 3263-3269, Oct. 2018.\n\nA learning automata-based ensemble resource usage prediction algorithm for cloud computing environment. A A Rahmanian, M Ghobaei-Arani, S Tofighy, Future Gener. Comput. Syst. 79A. A. Rahmanian, M. Ghobaei-Arani, and S. Tofighy, \"A learn- ing automata-based ensemble resource usage prediction algorithm for cloud computing environment,\" Future Gener. Comput. Syst., vol. 79, pp. 54-71, Feb. 2018.\n\nTask assignment in microtask crowdsourcing platforms using learning automata. A Moayedikia, K.-L Ong, Y L Boo, W G S Yeoh, Eng. Appl. Artif. Intell. 74A. Moayedikia, K.-L. Ong, Y. L. Boo, and W. G. S. Yeoh, \"Task assign- ment in microtask crowdsourcing platforms using learning automata,\" Eng. Appl. Artif. Intell., vol. 74, pp. 212-225, Sep. 2018.\n\nLearning automatabased trust model for user recommendations in online social networks. G Lingam, R R Rout, D Somayajulu, Comput. Electr. Eng. 66G. Lingam, R. R. Rout, and D. Somayajulu, \"Learning automata- based trust model for user recommendations in online social networks,\" Comput. Electr. Eng., vol. 66, pp. 174-188, Feb. 2018.\n\nTarget coverage heuristic based on learning automata in wireless sensor networks. S Manju, B Chand, Kumar, IET Wireless Sensor Syst. 83Manju, S. Chand, and B. Kumar, \"Target coverage heuristic based on learning automata in wireless sensor networks,\" IET Wireless Sensor Syst., vol. 8, no. 3, pp. 109-115, Jun. 2018.\n\nLearning automata for image segmentation. Q Sang, Z Lin, S T Acton, Pattern Recognit. Lett. 74Q. Sang, Z. Lin, and S. T. Acton, \"Learning automata for image segmentation,\" Pattern Recognit. Lett., vol. 74, pp. 46-52, Apr. 2016.\n\nIs the sample good enough? comparing data from twitter's streaming API with Twitter's firehose. F Morstatter, J Pfeffer, H Liu, K M Carley, Proc. ICWSM. ICWSMF. Morstatter, J. Pfeffer, H. Liu, and K. M. Carley, \"Is the sample good enough? comparing data from twitter's streaming API with Twitter's firehose,\" in Proc. ICWSM, 2013, pp. 1-9.\n\nSecurity and privacy implications of url shortening services. A Neumann, J Barnickel, U Meyer, Proc. Workshop Web 2.0 Secur. Privacy. Workshop Web 2.0 Secur. PrivacyA. Neumann, J. Barnickel, and U. Meyer, \"Security and privacy impli- cations of url shortening services,\" in Proc. Workshop Web 2.0 Secur. Privacy, 2010, pp. 1-31.\n\n. Online, Database, Online. WHOIS Database. Accessed: Nov.24, 2018. [Online]. Available: http://whois.domaintools.com//\n\nDetecting redirection spam using multilayer perceptron neural network. K Hans, L Ahuja, S K Muttoo, Soft Comput. 2113K. Hans, L. Ahuja, and S. K. Muttoo, \"Detecting redirection spam using multilayer perceptron neural network,\" Soft Comput., vol. 21, no. 13, pp. 3803-3814, Jul. 2017.\n\nBayesian-inference-based recommendation in online social networks. X Yang, Y Guo, Y Liu, IEEE Trans. Parallel Distrib. Syst. 244X. Yang, Y. Guo, and Y. Liu, \"Bayesian-inference-based recommen- dation in online social networks,\" IEEE Trans. Parallel Distrib. Syst., vol. 24, no. 4, pp. 642-651, Apr. 2013.\n\nDissecting a social botnet: Growth, content and influence in Twitter. N Abokhodair, D Yoo, D W Mcdonald, Proc. 18th ACM Conf. Comput. Supported Cooperat. 18th ACM Conf. Comput. Supported CooperatN. Abokhodair, D. Yoo, and D. W. McDonald, \"Dissecting a social bot- net: Growth, content and influence in Twitter,\" in Proc. 18th ACM Conf. Comput. Supported Cooperat. Work Social Comput., 2015, pp. 839-851.\n\nART: An attack-resistant trust management scheme for securing vehicular ad hoc networks. W Li, H Song, IEEE Trans. Intell. Transp. Syst. 174W. Li and H. Song, \"ART: An attack-resistant trust management scheme for securing vehicular ad hoc networks,\" IEEE Trans. Intell. Transp. Syst., vol. 17, no. 4, pp. 960-969, Apr. 2016.\n\nSecurity enhancements for mobile ad hoc networks with trust management using uncertain reasoning. Z Wei, H Tang, F R Yu, M Wang, P Mason, IEEE Trans. Veh. Technol. 639Z. Wei, H. Tang, F. R. Yu, M. Wang, and P. Mason, \"Security enhancements for mobile ad hoc networks with trust management using uncertain reasoning,\" IEEE Trans. Veh. Technol., vol. 63, no. 9, pp. 4647-4858, 2014.\n\nA topic-focused trust model for Twitter. L Zhao, T Hua, C.-T Lu, I.-R Chen, Comput. Commun. 76L. Zhao, T. Hua, C.-T. Lu, and I.-R. Chen, \"A topic-focused trust model for Twitter,\" Comput. Commun., vol. 76, pp. 1-11, Feb. 2016.\n\nSampling from complex networks using distributed learning automata. A Rezvanian, M Rahmati, M R Meybodi, Phys. A, Stat. Mech. Appl. 396A. Rezvanian, M. Rahmati, and M. R. Meybodi, \"Sampling from complex networks using distributed learning automata,\" Phys. A, Stat. Mech. Appl., vol. 396, pp. 224-234, Feb. 2014.\n\nTwin support vector machines: A survey. H Huang, X Wei, Y Zhou, Neurocomputing. 300H. Huang, X. Wei, and Y. Zhou, \"Twin support vector machines: A survey,\" Neurocomputing, vol. 300, pp. 34-43, Jul. 2018.\n\nAn efficient hybrid multilayer perceptron neural network with grasshopper optimization. A A Heidari, H Faris, I Aljarah, S Mirjalili, Soft Comput. 2317A. A. Heidari, H. Faris, I. Aljarah, and S. Mirjalili, \"An efficient hybrid multilayer perceptron neural network with grasshopper optimization,\" Soft Comput., vol. 23, no. 17, pp. 7941-7958, Sep. 2019.\n\nA general framework for the use of logistic regression models in meta-analysis. M C Simmonds, J P Higgins, Stat. Methods Med. Res. 256M. C. Simmonds and J. P. Higgins, \"A general framework for the use of logistic regression models in meta-analysis,\" Stat. Methods Med. Res., vol. 25, no. 6, pp. 2858-2877, Dec. 2016.\n\nRandom forest for label ranking. Y Zhou, G Qiu, Expert Syst. Appl. 112Y. Zhou and G. Qiu, \"Random forest for label ranking,\" Expert Syst. Appl., vol. 112, pp. 99-109, Dec. 2018.\n", "annotations": {"author": "[{\"start\":\"110\",\"end\":\"141\"},{\"start\":\"142\",\"end\":\"158\"},{\"start\":\"159\",\"end\":\"197\"}]", "publisher": null, "author_last_name": "[{\"start\":\"136\",\"end\":\"140\"},{\"start\":\"151\",\"end\":\"157\"}]", "author_first_name": "[{\"start\":\"122\",\"end\":\"128\"},{\"start\":\"129\",\"end\":\"135\"},{\"start\":\"142\",\"end\":\"150\"},{\"start\":\"178\",\"end\":\"179\"},{\"start\":\"180\",\"end\":\"196\"}]", "author_affiliation": null, "title": "[{\"start\":\"1\",\"end\":\"96\"},{\"start\":\"198\",\"end\":\"293\"}]", "venue": "[{\"start\":\"295\",\"end\":\"344\"}]", "abstract": "[{\"start\":\"388\",\"end\":\"2088\"}]", "bib_ref": "[{\"start\":\"4129\",\"end\":\"4132\",\"attributes\":{\"ref_id\":\"b0\"}},{\"start\":\"4134\",\"end\":\"4137\",\"attributes\":{\"ref_id\":\"b1\"}},{\"start\":\"4324\",\"end\":\"4327\",\"attributes\":{\"ref_id\":\"b0\"}},{\"start\":\"4533\",\"end\":\"4536\",\"attributes\":{\"ref_id\":\"b2\"}},{\"start\":\"4708\",\"end\":\"4711\",\"attributes\":{\"ref_id\":\"b3\"}},{\"start\":\"5178\",\"end\":\"5181\",\"attributes\":{\"ref_id\":\"b4\"}},{\"start\":\"5183\",\"end\":\"5186\",\"attributes\":{\"ref_id\":\"b7\"}},{\"start\":\"5639\",\"end\":\"5642\",\"attributes\":{\"ref_id\":\"b8\"}},{\"start\":\"5953\",\"end\":\"5957\",\"attributes\":{\"ref_id\":\"b9\"}},{\"start\":\"6135\",\"end\":\"6139\",\"attributes\":{\"ref_id\":\"b10\"}},{\"start\":\"6141\",\"end\":\"6145\",\"attributes\":{\"ref_id\":\"b11\"}},{\"start\":\"6282\",\"end\":\"6286\",\"attributes\":{\"ref_id\":\"b12\"}},{\"start\":\"6596\",\"end\":\"6600\",\"attributes\":{\"ref_id\":\"b13\"}},{\"start\":\"6602\",\"end\":\"6606\",\"attributes\":{\"ref_id\":\"b14\"}},{\"start\":\"6849\",\"end\":\"6853\",\"attributes\":{\"ref_id\":\"b15\"}},{\"start\":\"7117\",\"end\":\"7121\",\"attributes\":{\"ref_id\":\"b16\"}},{\"start\":\"7123\",\"end\":\"7127\",\"attributes\":{\"ref_id\":\"b17\"}},{\"start\":\"8066\",\"end\":\"8070\",\"attributes\":{\"ref_id\":\"b18\"}},{\"start\":\"8502\",\"end\":\"8506\",\"attributes\":{\"ref_id\":\"b19\"}},{\"start\":\"9535\",\"end\":\"9539\",\"attributes\":{\"ref_id\":\"b20\"}},{\"start\":\"9569\",\"end\":\"9573\",\"attributes\":{\"ref_id\":\"b21\"}},{\"start\":\"9984\",\"end\":\"9988\",\"attributes\":{\"ref_id\":\"b22\"}},{\"start\":\"10194\",\"end\":\"10198\",\"attributes\":{\"ref_id\":\"b23\"}},{\"start\":\"10324\",\"end\":\"10328\",\"attributes\":{\"ref_id\":\"b24\"}},{\"start\":\"10483\",\"end\":\"10487\",\"attributes\":{\"ref_id\":\"b25\"}},{\"start\":\"10704\",\"end\":\"10707\",\"attributes\":{\"ref_id\":\"b0\"}},{\"start\":\"10849\",\"end\":\"10852\",\"attributes\":{\"ref_id\":\"b4\"}},{\"start\":\"10953\",\"end\":\"10957\",\"attributes\":{\"ref_id\":\"b26\"}},{\"start\":\"11093\",\"end\":\"11096\",\"attributes\":{\"ref_id\":\"b6\"}},{\"start\":\"11486\",\"end\":\"11489\",\"attributes\":{\"ref_id\":\"b4\"}},{\"start\":\"11491\",\"end\":\"11494\",\"attributes\":{\"ref_id\":\"b7\"}},{\"start\":\"11643\",\"end\":\"11647\",\"attributes\":{\"ref_id\":\"b27\"}},{\"start\":\"11959\",\"end\":\"11963\",\"attributes\":{\"ref_id\":\"b28\"}},{\"start\":\"12120\",\"end\":\"12124\",\"attributes\":{\"ref_id\":\"b29\"}},{\"start\":\"12263\",\"end\":\"12267\",\"attributes\":{\"ref_id\":\"b30\"}},{\"start\":\"12835\",\"end\":\"12839\",\"attributes\":{\"ref_id\":\"b31\"}},{\"start\":\"13119\",\"end\":\"13123\",\"attributes\":{\"ref_id\":\"b32\"}},{\"start\":\"13969\",\"end\":\"13973\",\"attributes\":{\"ref_id\":\"b16\"}},{\"start\":\"14087\",\"end\":\"14091\",\"attributes\":{\"ref_id\":\"b17\"}},{\"start\":\"14199\",\"end\":\"14203\",\"attributes\":{\"ref_id\":\"b33\"}},{\"start\":\"14428\",\"end\":\"14432\",\"attributes\":{\"ref_id\":\"b16\"}},{\"start\":\"14434\",\"end\":\"14438\",\"attributes\":{\"ref_id\":\"b17\"}},{\"start\":\"14652\",\"end\":\"14656\",\"attributes\":{\"ref_id\":\"b31\"}},{\"start\":\"14674\",\"end\":\"14678\",\"attributes\":{\"ref_id\":\"b32\"}},{\"start\":\"14696\",\"end\":\"14700\",\"attributes\":{\"ref_id\":\"b16\"}},{\"start\":\"14702\",\"end\":\"14706\",\"attributes\":{\"ref_id\":\"b34\"}},{\"start\":\"14726\",\"end\":\"14730\",\"attributes\":{\"ref_id\":\"b35\"}},{\"start\":\"14753\",\"end\":\"14757\",\"attributes\":{\"ref_id\":\"b36\"}},{\"start\":\"17414\",\"end\":\"17418\",\"attributes\":{\"ref_id\":\"b37\"}},{\"start\":\"17954\",\"end\":\"17958\",\"attributes\":{\"ref_id\":\"b38\"}},{\"start\":\"19204\",\"end\":\"19208\",\"attributes\":{\"ref_id\":\"b11\"}},{\"start\":\"19210\",\"end\":\"19214\",\"attributes\":{\"ref_id\":\"b29\"}},{\"start\":\"19220\",\"end\":\"19224\",\"attributes\":{\"ref_id\":\"b40\"}},{\"start\":\"19517\",\"end\":\"19521\",\"attributes\":{\"ref_id\":\"b40\"}},{\"start\":\"19716\",\"end\":\"19720\",\"attributes\":{\"ref_id\":\"b29\"}},{\"start\":\"20460\",\"end\":\"20464\",\"attributes\":{\"ref_id\":\"b34\"}},{\"start\":\"22561\",\"end\":\"22565\",\"attributes\":{\"ref_id\":\"b34\"}},{\"start\":\"23848\",\"end\":\"23852\",\"attributes\":{\"ref_id\":\"b41\"}},{\"start\":\"25689\",\"end\":\"25691\"},{\"start\":\"25755\",\"end\":\"25757\"},{\"start\":\"25786\",\"end\":\"25788\"},{\"start\":\"25865\",\"end\":\"25867\"},{\"start\":\"26016\",\"end\":\"26019\"},{\"start\":\"26039\",\"end\":\"26042\"},{\"start\":\"27312\",\"end\":\"27316\",\"attributes\":{\"ref_id\":\"b42\"}},{\"start\":\"28221\",\"end\":\"28225\",\"attributes\":{\"ref_id\":\"b19\"}},{\"start\":\"28756\",\"end\":\"28760\",\"attributes\":{\"ref_id\":\"b44\"}},{\"start\":\"29027\",\"end\":\"29031\",\"attributes\":{\"ref_id\":\"b43\"}},{\"start\":\"30331\",\"end\":\"30334\",\"attributes\":{\"ref_id\":\"b8\"}},{\"start\":\"31250\",\"end\":\"31254\",\"attributes\":{\"ref_id\":\"b45\"}},{\"start\":\"31471\",\"end\":\"31473\"},{\"start\":\"31498\",\"end\":\"31501\"},{\"start\":\"31587\",\"end\":\"31590\"},{\"start\":\"31596\",\"end\":\"31599\"},{\"start\":\"31685\",\"end\":\"31688\"},{\"start\":\"31696\",\"end\":\"31699\"},{\"start\":\"31751\",\"end\":\"31754\"},{\"start\":\"31799\",\"end\":\"31801\",\"attributes\":{\"ref_id\":\"b16\"}},{\"start\":\"31803\",\"end\":\"31806\"},{\"start\":\"31850\",\"end\":\"31853\"},{\"start\":\"31859\",\"end\":\"31862\"},{\"start\":\"31933\",\"end\":\"31936\"},{\"start\":\"32031\",\"end\":\"32034\"},{\"start\":\"32042\",\"end\":\"32045\"},{\"start\":\"32064\",\"end\":\"32067\"},{\"start\":\"32529\",\"end\":\"32533\",\"attributes\":{\"ref_id\":\"b33\"}},{\"start\":\"32732\",\"end\":\"32736\",\"attributes\":{\"ref_id\":\"b17\"}},{\"start\":\"35368\",\"end\":\"35372\",\"attributes\":{\"ref_id\":\"b46\"}},{\"start\":\"37702\",\"end\":\"37706\",\"attributes\":{\"ref_id\":\"b11\"}},{\"start\":\"38366\",\"end\":\"38370\",\"attributes\":{\"ref_id\":\"b15\"}},{\"start\":\"38370\",\"end\":\"38374\",\"attributes\":{\"ref_id\":\"b16\"}},{\"start\":\"38374\",\"end\":\"38378\",\"attributes\":{\"ref_id\":\"b17\"}},{\"start\":\"38378\",\"end\":\"38382\",\"attributes\":{\"ref_id\":\"b18\"}},{\"start\":\"38382\",\"end\":\"38386\",\"attributes\":{\"ref_id\":\"b19\"}},{\"start\":\"38386\",\"end\":\"38390\",\"attributes\":{\"ref_id\":\"b20\"}},{\"start\":\"38390\",\"end\":\"38394\",\"attributes\":{\"ref_id\":\"b21\"}},{\"start\":\"38892\",\"end\":\"38895\",\"attributes\":{\"ref_id\":\"b8\"}},{\"start\":\"39725\",\"end\":\"39729\",\"attributes\":{\"ref_id\":\"b21\"}},{\"start\":\"39762\",\"end\":\"39766\",\"attributes\":{\"ref_id\":\"b20\"}},{\"start\":\"39794\",\"end\":\"39798\",\"attributes\":{\"ref_id\":\"b20\"}},{\"start\":\"39832\",\"end\":\"39836\",\"attributes\":{\"ref_id\":\"b21\"}},{\"start\":\"40104\",\"end\":\"40108\",\"attributes\":{\"ref_id\":\"b20\"}},{\"start\":\"40198\",\"end\":\"40202\",\"attributes\":{\"ref_id\":\"b21\"}},{\"start\":\"40242\",\"end\":\"40246\",\"attributes\":{\"ref_id\":\"b21\"}},{\"start\":\"41617\",\"end\":\"41620\",\"attributes\":{\"ref_id\":\"b4\"}},{\"start\":\"41686\",\"end\":\"41689\",\"attributes\":{\"ref_id\":\"b5\"}},{\"start\":\"43025\",\"end\":\"43029\",\"attributes\":{\"ref_id\":\"b14\"}},{\"start\":\"43090\",\"end\":\"43094\",\"attributes\":{\"ref_id\":\"b40\"}},{\"start\":\"43817\",\"end\":\"43821\",\"attributes\":{\"ref_id\":\"b47\"}},{\"start\":\"44187\",\"end\":\"44191\",\"attributes\":{\"ref_id\":\"b48\"}},{\"start\":\"44451\",\"end\":\"44455\",\"attributes\":{\"ref_id\":\"b49\"}},{\"start\":\"44853\",\"end\":\"44857\",\"attributes\":{\"ref_id\":\"b50\"}},{\"start\":\"49003\",\"end\":\"49007\",\"attributes\":{\"ref_id\":\"b14\"}},{\"start\":\"49028\",\"end\":\"49032\",\"attributes\":{\"ref_id\":\"b40\"}},{\"start\":\"50141\",\"end\":\"50145\",\"attributes\":{\"ref_id\":\"b14\"}},{\"start\":\"50156\",\"end\":\"50160\",\"attributes\":{\"ref_id\":\"b40\"}},{\"start\":\"50374\",\"end\":\"50378\",\"attributes\":{\"ref_id\":\"b14\"}},{\"start\":\"50824\",\"end\":\"50828\",\"attributes\":{\"ref_id\":\"b14\"}},{\"start\":\"50952\",\"end\":\"50956\",\"attributes\":{\"ref_id\":\"b14\"}},{\"start\":\"50968\",\"end\":\"50972\",\"attributes\":{\"ref_id\":\"b40\"}},{\"start\":\"56037\",\"end\":\"56040\",\"attributes\":{\"ref_id\":\"b5\"}},{\"start\":\"56040\",\"end\":\"56043\",\"attributes\":{\"ref_id\":\"b6\"}},{\"start\":\"56043\",\"end\":\"56046\",\"attributes\":{\"ref_id\":\"b7\"}},{\"start\":\"56821\",\"end\":\"56825\",\"attributes\":{\"ref_id\":\"b19\"}},{\"start\":\"57767\",\"end\":\"57771\",\"attributes\":{\"ref_id\":\"b19\"}},{\"start\":\"57772\",\"end\":\"57776\",\"attributes\":{\"ref_id\":\"b43\"}},{\"start\":\"60864\",\"end\":\"60868\",\"attributes\":{\"ref_id\":\"b14\"}},{\"start\":\"60879\",\"end\":\"60883\",\"attributes\":{\"ref_id\":\"b40\"}},{\"start\":\"60989\",\"end\":\"60993\",\"attributes\":{\"ref_id\":\"b14\"}},{\"start\":\"61004\",\"end\":\"61008\",\"attributes\":{\"ref_id\":\"b40\"}}]", "figure": "[{\"start\":\"53944\",\"end\":\"53994\",\"attributes\":{\"id\":\"fig_0\"}},{\"start\":\"53995\",\"end\":\"55757\",\"attributes\":{\"id\":\"fig_1\"}},{\"start\":\"55758\",\"end\":\"55824\",\"attributes\":{\"id\":\"fig_2\"}},{\"start\":\"55825\",\"end\":\"56028\",\"attributes\":{\"id\":\"fig_3\"}},{\"start\":\"56029\",\"end\":\"56740\",\"attributes\":{\"id\":\"fig_4\"}},{\"start\":\"56741\",\"end\":\"57982\",\"attributes\":{\"id\":\"fig_5\"}},{\"start\":\"57983\",\"end\":\"58535\",\"attributes\":{\"id\":\"fig_6\"}},{\"start\":\"58536\",\"end\":\"58604\",\"attributes\":{\"id\":\"fig_8\"}},{\"start\":\"58605\",\"end\":\"59459\",\"attributes\":{\"id\":\"fig_9\"}},{\"start\":\"59460\",\"end\":\"59592\",\"attributes\":{\"id\":\"fig_10\"}},{\"start\":\"59593\",\"end\":\"59913\",\"attributes\":{\"id\":\"fig_11\"}},{\"start\":\"59914\",\"end\":\"60011\",\"attributes\":{\"id\":\"fig_12\"}},{\"start\":\"60012\",\"end\":\"60108\",\"attributes\":{\"id\":\"fig_13\"}},{\"start\":\"60109\",\"end\":\"60579\",\"attributes\":{\"id\":\"fig_14\"}},{\"start\":\"60580\",\"end\":\"60762\",\"attributes\":{\"id\":\"fig_15\"}},{\"start\":\"60763\",\"end\":\"60884\",\"attributes\":{\"id\":\"fig_16\"}},{\"start\":\"60885\",\"end\":\"61009\",\"attributes\":{\"id\":\"fig_17\"}},{\"start\":\"61010\",\"end\":\"61119\",\"attributes\":{\"id\":\"tab_0\",\"type\":\"table\"}},{\"start\":\"61120\",\"end\":\"61326\",\"attributes\":{\"id\":\"tab_1\",\"type\":\"table\"}},{\"start\":\"61327\",\"end\":\"61369\",\"attributes\":{\"id\":\"tab_2\",\"type\":\"table\"}},{\"start\":\"61370\",\"end\":\"61526\",\"attributes\":{\"id\":\"tab_3\",\"type\":\"table\"}},{\"start\":\"61527\",\"end\":\"61684\",\"attributes\":{\"id\":\"tab_4\",\"type\":\"table\"}},{\"start\":\"61685\",\"end\":\"61739\",\"attributes\":{\"id\":\"tab_5\",\"type\":\"table\"}}]", "paragraph": "[{\"start\":\"2187\",\"end\":\"3902\"},{\"start\":\"3904\",\"end\":\"4000\"},{\"start\":\"4020\",\"end\":\"5100\"},{\"start\":\"5102\",\"end\":\"6562\"},{\"start\":\"6564\",\"end\":\"7384\"},{\"start\":\"7386\",\"end\":\"8985\"},{\"start\":\"8987\",\"end\":\"9661\"},{\"start\":\"9663\",\"end\":\"9950\"},{\"start\":\"9971\",\"end\":\"11358\"},{\"start\":\"11360\",\"end\":\"12445\"},{\"start\":\"12447\",\"end\":\"12751\"},{\"start\":\"12776\",\"end\":\"14758\"},{\"start\":\"14787\",\"end\":\"14926\"},{\"start\":\"14928\",\"end\":\"16250\"},{\"start\":\"16387\",\"end\":\"16627\"},{\"start\":\"16724\",\"end\":\"17123\"},{\"start\":\"17185\",\"end\":\"18909\"},{\"start\":\"18935\",\"end\":\"19798\"},{\"start\":\"19948\",\"end\":\"20205\"},{\"start\":\"20240\",\"end\":\"21498\"},{\"start\":\"21531\",\"end\":\"21961\"},{\"start\":\"21963\",\"end\":\"22261\"},{\"start\":\"22313\",\"end\":\"22566\"},{\"start\":\"22568\",\"end\":\"22958\"},{\"start\":\"23009\",\"end\":\"23131\"},{\"start\":\"23133\",\"end\":\"23981\"},{\"start\":\"24230\",\"end\":\"24694\"},{\"start\":\"24811\",\"end\":\"25407\"},{\"start\":\"25445\",\"end\":\"25547\"},{\"start\":\"25587\",\"end\":\"25725\"},{\"start\":\"25732\",\"end\":\"25855\"},{\"start\":\"25857\",\"end\":\"25911\"},{\"start\":\"25968\",\"end\":\"27598\"},{\"start\":\"27662\",\"end\":\"27867\"},{\"start\":\"27938\",\"end\":\"28242\"},{\"start\":\"28634\",\"end\":\"28816\"},{\"start\":\"28880\",\"end\":\"29426\"},{\"start\":\"29725\",\"end\":\"30334\"},{\"start\":\"30734\",\"end\":\"30990\"},{\"start\":\"31062\",\"end\":\"31413\"},{\"start\":\"31415\",\"end\":\"33481\"},{\"start\":\"33531\",\"end\":\"35373\"},{\"start\":\"35451\",\"end\":\"36533\"},{\"start\":\"36615\",\"end\":\"38716\"},{\"start\":\"38718\",\"end\":\"39538\"},{\"start\":\"39540\",\"end\":\"39544\"},{\"start\":\"39572\",\"end\":\"43095\"},{\"start\":\"43159\",\"end\":\"43575\"},{\"start\":\"43577\",\"end\":\"43922\"},{\"start\":\"43924\",\"end\":\"44328\"},{\"start\":\"44330\",\"end\":\"44585\"},{\"start\":\"44587\",\"end\":\"44963\"},{\"start\":\"44965\",\"end\":\"45251\"},{\"start\":\"45278\",\"end\":\"45483\"},{\"start\":\"45630\",\"end\":\"47756\"},{\"start\":\"47758\",\"end\":\"48791\"},{\"start\":\"48859\",\"end\":\"49666\"},{\"start\":\"49668\",\"end\":\"50829\"},{\"start\":\"50831\",\"end\":\"52872\"},{\"start\":\"52891\",\"end\":\"53943\"}]", "formula": "[{\"start\":\"16251\",\"end\":\"16386\",\"attributes\":{\"id\":\"formula_0\"}},{\"start\":\"19799\",\"end\":\"19947\",\"attributes\":{\"id\":\"formula_1\"}},{\"start\":\"20206\",\"end\":\"20239\",\"attributes\":{\"id\":\"formula_2\"}},{\"start\":\"22262\",\"end\":\"22312\",\"attributes\":{\"id\":\"formula_3\"}},{\"start\":\"22959\",\"end\":\"23008\",\"attributes\":{\"id\":\"formula_4\"}},{\"start\":\"23982\",\"end\":\"24229\",\"attributes\":{\"id\":\"formula_5\"}},{\"start\":\"24695\",\"end\":\"24810\",\"attributes\":{\"id\":\"formula_6\"}},{\"start\":\"25408\",\"end\":\"25444\",\"attributes\":{\"id\":\"formula_7\"}},{\"start\":\"25548\",\"end\":\"25586\",\"attributes\":{\"id\":\"formula_8\"}},{\"start\":\"27599\",\"end\":\"27661\",\"attributes\":{\"id\":\"formula_9\"}},{\"start\":\"27868\",\"end\":\"27937\",\"attributes\":{\"id\":\"formula_10\"}},{\"start\":\"28243\",\"end\":\"28633\",\"attributes\":{\"id\":\"formula_11\"}},{\"start\":\"28817\",\"end\":\"28879\",\"attributes\":{\"id\":\"formula_12\"}},{\"start\":\"30335\",\"end\":\"30655\",\"attributes\":{\"id\":\"formula_13\"}},{\"start\":\"33482\",\"end\":\"33530\",\"attributes\":{\"id\":\"formula_14\"}},{\"start\":\"35374\",\"end\":\"35450\",\"attributes\":{\"id\":\"formula_15\"}},{\"start\":\"45484\",\"end\":\"45530\",\"attributes\":{\"id\":\"formula_16\"}},{\"start\":\"45530\",\"end\":\"45587\",\"attributes\":{\"id\":\"formula_17\"}},{\"start\":\"45587\",\"end\":\"45629\",\"attributes\":{\"id\":\"formula_18\"}}]", "table_ref": "[{\"start\":\"14918\",\"end\":\"14925\",\"attributes\":{\"ref_id\":\"tab_0\"}},{\"start\":\"19160\",\"end\":\"19168\",\"attributes\":{\"ref_id\":\"tab_0\"}},{\"start\":\"41052\",\"end\":\"41061\",\"attributes\":{\"ref_id\":\"tab_0\"}},{\"start\":\"50035\",\"end\":\"50043\",\"attributes\":{\"ref_id\":\"tab_0\"}}]", "section_header": "[{\"start\":\"2090\",\"end\":\"2185\"},{\"start\":\"4003\",\"end\":\"4018\"},{\"start\":\"9953\",\"end\":\"9969\"},{\"start\":\"12754\",\"end\":\"12774\"},{\"start\":\"14761\",\"end\":\"14785\"},{\"start\":\"16630\",\"end\":\"16722\"},{\"start\":\"17126\",\"end\":\"17183\"},{\"start\":\"18912\",\"end\":\"18933\"},{\"start\":\"21501\",\"end\":\"21529\"},{\"start\":\"25728\",\"end\":\"25730\"},{\"start\":\"25914\",\"end\":\"25966\"},{\"start\":\"29429\",\"end\":\"29723\"},{\"start\":\"30657\",\"end\":\"30732\"},{\"start\":\"30993\",\"end\":\"31060\"},{\"start\":\"36536\",\"end\":\"36613\"},{\"start\":\"39547\",\"end\":\"39570\"},{\"start\":\"43098\",\"end\":\"43157\"},{\"start\":\"45254\",\"end\":\"45276\"},{\"start\":\"48794\",\"end\":\"48857\"},{\"start\":\"52875\",\"end\":\"52889\"},{\"start\":\"53945\",\"end\":\"53953\"},{\"start\":\"53996\",\"end\":\"54010\"},{\"start\":\"55759\",\"end\":\"55767\"},{\"start\":\"58537\",\"end\":\"58545\"},{\"start\":\"59461\",\"end\":\"59469\"},{\"start\":\"59594\",\"end\":\"59597\"},{\"start\":\"59915\",\"end\":\"59923\"},{\"start\":\"60013\",\"end\":\"60021\"},{\"start\":\"60110\",\"end\":\"60117\"},{\"start\":\"60581\",\"end\":\"60589\"},{\"start\":\"60764\",\"end\":\"60772\"},{\"start\":\"60886\",\"end\":\"60894\"},{\"start\":\"61011\",\"end\":\"61028\"},{\"start\":\"61121\",\"end\":\"61129\"},{\"start\":\"61328\",\"end\":\"61345\"},{\"start\":\"61371\",\"end\":\"61390\"},{\"start\":\"61528\",\"end\":\"61535\"},{\"start\":\"61686\",\"end\":\"61705\"}]", "table": "[{\"start\":\"61257\",\"end\":\"61326\"}]", "figure_caption": "[{\"start\":\"53955\",\"end\":\"53994\"},{\"start\":\"54012\",\"end\":\"55757\"},{\"start\":\"55769\",\"end\":\"55824\"},{\"start\":\"55827\",\"end\":\"56028\"},{\"start\":\"56031\",\"end\":\"56740\"},{\"start\":\"56743\",\"end\":\"57982\"},{\"start\":\"57985\",\"end\":\"58535\"},{\"start\":\"58547\",\"end\":\"58604\"},{\"start\":\"58607\",\"end\":\"59459\"},{\"start\":\"59471\",\"end\":\"59592\"},{\"start\":\"59599\",\"end\":\"59913\"},{\"start\":\"59925\",\"end\":\"60011\"},{\"start\":\"60023\",\"end\":\"60108\"},{\"start\":\"60119\",\"end\":\"60579\"},{\"start\":\"60591\",\"end\":\"60762\"},{\"start\":\"60774\",\"end\":\"60884\"},{\"start\":\"60896\",\"end\":\"61009\"},{\"start\":\"61030\",\"end\":\"61119\"},{\"start\":\"61132\",\"end\":\"61257\"},{\"start\":\"61349\",\"end\":\"61369\"},{\"start\":\"61393\",\"end\":\"61526\"},{\"start\":\"61537\",\"end\":\"61684\"},{\"start\":\"61708\",\"end\":\"61739\"}]", "figure_ref": "[{\"start\":\"4725\",\"end\":\"4731\",\"attributes\":{\"ref_id\":\"fig_0\"}},{\"start\":\"17197\",\"end\":\"17203\",\"attributes\":{\"ref_id\":\"fig_2\"}},{\"start\":\"36881\",\"end\":\"36892\",\"attributes\":{\"ref_id\":\"fig_0\"}},{\"start\":\"42113\",\"end\":\"42119\",\"attributes\":{\"ref_id\":\"fig_10\"}},{\"start\":\"47763\",\"end\":\"47772\",\"attributes\":{\"ref_id\":\"fig_13\"}},{\"start\":\"49039\",\"end\":\"49045\",\"attributes\":{\"ref_id\":\"fig_15\"}},{\"start\":\"51176\",\"end\":\"51185\",\"attributes\":{\"ref_id\":\"fig_16\"}},{\"start\":\"51305\",\"end\":\"51311\",\"attributes\":{\"ref_id\":\"fig_16\"}},{\"start\":\"51783\",\"end\":\"51792\",\"attributes\":{\"ref_id\":\"fig_16\"}},{\"start\":\"51935\",\"end\":\"51944\",\"attributes\":{\"ref_id\":\"fig_16\"}},{\"start\":\"52059\",\"end\":\"52065\",\"attributes\":{\"ref_id\":\"fig_16\"}},{\"start\":\"52073\",\"end\":\"52079\",\"attributes\":{\"ref_id\":\"fig_17\"}},{\"start\":\"52463\",\"end\":\"52472\",\"attributes\":{\"ref_id\":\"fig_17\"}},{\"start\":\"52739\",\"end\":\"52748\",\"attributes\":{\"ref_id\":\"fig_17\"}}]", "bib_author_first_name": "[{\"start\":\"61911\",\"end\":\"61912\"},{\"start\":\"61918\",\"end\":\"61919\"},{\"start\":\"61927\",\"end\":\"61934\"},{\"start\":\"62209\",\"end\":\"62210\"},{\"start\":\"62219\",\"end\":\"62220\"},{\"start\":\"62221\",\"end\":\"62222\"},{\"start\":\"62229\",\"end\":\"62230\"},{\"start\":\"62231\",\"end\":\"62236\"},{\"start\":\"62577\",\"end\":\"62578\"},{\"start\":\"62585\",\"end\":\"62586\"},{\"start\":\"62592\",\"end\":\"62593\"},{\"start\":\"62600\",\"end\":\"62601\"},{\"start\":\"62610\",\"end\":\"62611\"},{\"start\":\"62620\",\"end\":\"62621\"},{\"start\":\"62622\",\"end\":\"62623\"},{\"start\":\"62942\",\"end\":\"62943\"},{\"start\":\"62949\",\"end\":\"62950\"},{\"start\":\"63200\",\"end\":\"63201\"},{\"start\":\"63213\",\"end\":\"63214\"},{\"start\":\"63215\",\"end\":\"63216\"},{\"start\":\"63520\",\"end\":\"63521\"},{\"start\":\"63522\",\"end\":\"63523\"},{\"start\":\"63534\",\"end\":\"63535\"},{\"start\":\"63791\",\"end\":\"63792\"},{\"start\":\"63800\",\"end\":\"63801\"},{\"start\":\"63802\",\"end\":\"63803\"},{\"start\":\"63811\",\"end\":\"63812\"},{\"start\":\"63824\",\"end\":\"63825\"},{\"start\":\"63826\",\"end\":\"63827\"},{\"start\":\"64179\",\"end\":\"64180\"},{\"start\":\"64185\",\"end\":\"64186\"},{\"start\":\"64192\",\"end\":\"64193\"},{\"start\":\"64201\",\"end\":\"64202\"},{\"start\":\"64517\",\"end\":\"64518\"},{\"start\":\"64528\",\"end\":\"64529\"},{\"start\":\"64541\",\"end\":\"64542\"},{\"start\":\"64553\",\"end\":\"64554\"},{\"start\":\"64933\",\"end\":\"64934\"},{\"start\":\"65188\",\"end\":\"65189\"},{\"start\":\"65198\",\"end\":\"65199\"},{\"start\":\"65206\",\"end\":\"65207\"},{\"start\":\"65215\",\"end\":\"65216\"},{\"start\":\"65578\",\"end\":\"65579\"},{\"start\":\"65580\",\"end\":\"65581\"},{\"start\":\"65588\",\"end\":\"65589\"},{\"start\":\"65590\",\"end\":\"65591\"},{\"start\":\"65905\",\"end\":\"65906\"},{\"start\":\"65913\",\"end\":\"65914\"},{\"start\":\"65922\",\"end\":\"65923\"},{\"start\":\"65930\",\"end\":\"65931\"},{\"start\":\"65939\",\"end\":\"65940\"},{\"start\":\"66288\",\"end\":\"66289\"},{\"start\":\"66295\",\"end\":\"66296\"},{\"start\":\"66310\",\"end\":\"66311\"},{\"start\":\"66318\",\"end\":\"66319\"},{\"start\":\"66646\",\"end\":\"66647\"},{\"start\":\"66654\",\"end\":\"66655\"},{\"start\":\"66662\",\"end\":\"66663\"},{\"start\":\"66671\",\"end\":\"66672\"},{\"start\":\"66680\",\"end\":\"66681\"},{\"start\":\"66688\",\"end\":\"66689\"},{\"start\":\"67010\",\"end\":\"67011\"},{\"start\":\"67019\",\"end\":\"67020\"},{\"start\":\"67327\",\"end\":\"67328\"},{\"start\":\"67337\",\"end\":\"67341\"},{\"start\":\"67350\",\"end\":\"67351\"},{\"start\":\"67352\",\"end\":\"67353\"},{\"start\":\"67672\",\"end\":\"67673\"},{\"start\":\"67674\",\"end\":\"67675\"},{\"start\":\"67687\",\"end\":\"67688\"},{\"start\":\"67689\",\"end\":\"67690\"},{\"start\":\"68021\",\"end\":\"68025\"},{\"start\":\"68032\",\"end\":\"68033\"},{\"start\":\"68034\",\"end\":\"68035\"},{\"start\":\"68042\",\"end\":\"68046\"},{\"start\":\"68324\",\"end\":\"68325\"},{\"start\":\"68326\",\"end\":\"68327\"},{\"start\":\"68334\",\"end\":\"68335\"},{\"start\":\"68630\",\"end\":\"68631\"},{\"start\":\"68640\",\"end\":\"68641\"},{\"start\":\"68642\",\"end\":\"68644\"},{\"start\":\"68653\",\"end\":\"68654\"},{\"start\":\"68666\",\"end\":\"68667\"},{\"start\":\"68679\",\"end\":\"68680\"},{\"start\":\"69119\",\"end\":\"69120\"},{\"start\":\"69126\",\"end\":\"69127\"},{\"start\":\"69128\",\"end\":\"69129\"},{\"start\":\"69136\",\"end\":\"69137\"},{\"start\":\"69380\",\"end\":\"69381\"},{\"start\":\"69389\",\"end\":\"69390\"},{\"start\":\"69403\",\"end\":\"69404\"},{\"start\":\"69808\",\"end\":\"69809\"},{\"start\":\"69822\",\"end\":\"69823\"},{\"start\":\"70261\",\"end\":\"70262\"},{\"start\":\"70270\",\"end\":\"70271\"},{\"start\":\"70279\",\"end\":\"70280\"},{\"start\":\"71033\",\"end\":\"71034\"},{\"start\":\"71044\",\"end\":\"71045\"},{\"start\":\"71469\",\"end\":\"71470\"},{\"start\":\"71479\",\"end\":\"71480\"},{\"start\":\"71481\",\"end\":\"71482\"},{\"start\":\"71489\",\"end\":\"71490\"},{\"start\":\"71491\",\"end\":\"71496\"},{\"start\":\"71903\",\"end\":\"71904\"},{\"start\":\"71911\",\"end\":\"71912\"},{\"start\":\"71925\",\"end\":\"71926\"},{\"start\":\"72262\",\"end\":\"72263\"},{\"start\":\"72275\",\"end\":\"72276\"},{\"start\":\"72277\",\"end\":\"72278\"},{\"start\":\"72288\",\"end\":\"72289\"},{\"start\":\"72726\",\"end\":\"72727\"},{\"start\":\"72733\",\"end\":\"72734\"},{\"start\":\"73055\",\"end\":\"73056\"},{\"start\":\"73057\",\"end\":\"73058\"},{\"start\":\"73066\",\"end\":\"73067\"},{\"start\":\"73068\",\"end\":\"73069\"},{\"start\":\"73358\",\"end\":\"73359\"},{\"start\":\"73365\",\"end\":\"73366\"},{\"start\":\"73371\",\"end\":\"73372\"},{\"start\":\"73377\",\"end\":\"73378\"},{\"start\":\"73383\",\"end\":\"73384\"},{\"start\":\"73707\",\"end\":\"73708\"},{\"start\":\"73709\",\"end\":\"73710\"},{\"start\":\"73722\",\"end\":\"73723\"},{\"start\":\"73739\",\"end\":\"73740\"},{\"start\":\"74078\",\"end\":\"74079\"},{\"start\":\"74092\",\"end\":\"74096\"},{\"start\":\"74102\",\"end\":\"74103\"},{\"start\":\"74104\",\"end\":\"74105\"},{\"start\":\"74111\",\"end\":\"74112\"},{\"start\":\"74113\",\"end\":\"74116\"},{\"start\":\"74437\",\"end\":\"74438\"},{\"start\":\"74447\",\"end\":\"74448\"},{\"start\":\"74449\",\"end\":\"74450\"},{\"start\":\"74457\",\"end\":\"74458\"},{\"start\":\"74765\",\"end\":\"74766\"},{\"start\":\"74774\",\"end\":\"74775\"},{\"start\":\"75042\",\"end\":\"75043\"},{\"start\":\"75050\",\"end\":\"75051\"},{\"start\":\"75057\",\"end\":\"75058\"},{\"start\":\"75059\",\"end\":\"75060\"},{\"start\":\"75325\",\"end\":\"75326\"},{\"start\":\"75339\",\"end\":\"75340\"},{\"start\":\"75350\",\"end\":\"75351\"},{\"start\":\"75357\",\"end\":\"75358\"},{\"start\":\"75359\",\"end\":\"75360\"},{\"start\":\"75632\",\"end\":\"75633\"},{\"start\":\"75643\",\"end\":\"75644\"},{\"start\":\"75656\",\"end\":\"75657\"},{\"start\":\"76092\",\"end\":\"76093\"},{\"start\":\"76100\",\"end\":\"76101\"},{\"start\":\"76109\",\"end\":\"76110\"},{\"start\":\"76111\",\"end\":\"76112\"},{\"start\":\"76373\",\"end\":\"76374\"},{\"start\":\"76381\",\"end\":\"76382\"},{\"start\":\"76388\",\"end\":\"76389\"},{\"start\":\"76682\",\"end\":\"76683\"},{\"start\":\"76696\",\"end\":\"76697\"},{\"start\":\"76703\",\"end\":\"76704\"},{\"start\":\"76705\",\"end\":\"76706\"},{\"start\":\"77106\",\"end\":\"77107\"},{\"start\":\"77112\",\"end\":\"77113\"},{\"start\":\"77441\",\"end\":\"77442\"},{\"start\":\"77448\",\"end\":\"77449\"},{\"start\":\"77456\",\"end\":\"77457\"},{\"start\":\"77458\",\"end\":\"77459\"},{\"start\":\"77464\",\"end\":\"77465\"},{\"start\":\"77472\",\"end\":\"77473\"},{\"start\":\"77766\",\"end\":\"77767\"},{\"start\":\"77774\",\"end\":\"77775\"},{\"start\":\"77781\",\"end\":\"77785\"},{\"start\":\"77790\",\"end\":\"77794\"},{\"start\":\"78021\",\"end\":\"78022\"},{\"start\":\"78034\",\"end\":\"78035\"},{\"start\":\"78045\",\"end\":\"78046\"},{\"start\":\"78047\",\"end\":\"78048\"},{\"start\":\"78306\",\"end\":\"78307\"},{\"start\":\"78315\",\"end\":\"78316\"},{\"start\":\"78322\",\"end\":\"78323\"},{\"start\":\"78559\",\"end\":\"78560\"},{\"start\":\"78561\",\"end\":\"78562\"},{\"start\":\"78572\",\"end\":\"78573\"},{\"start\":\"78581\",\"end\":\"78582\"},{\"start\":\"78592\",\"end\":\"78593\"},{\"start\":\"78905\",\"end\":\"78906\"},{\"start\":\"78907\",\"end\":\"78908\"},{\"start\":\"78919\",\"end\":\"78920\"},{\"start\":\"78921\",\"end\":\"78922\"},{\"start\":\"79176\",\"end\":\"79177\"},{\"start\":\"79184\",\"end\":\"79185\"}]", "bib_author_last_name": "[{\"start\":\"61913\",\"end\":\"61916\"},{\"start\":\"61920\",\"end\":\"61925\"},{\"start\":\"61935\",\"end\":\"61939\"},{\"start\":\"62211\",\"end\":\"62217\"},{\"start\":\"62223\",\"end\":\"62227\"},{\"start\":\"62237\",\"end\":\"62247\"},{\"start\":\"62579\",\"end\":\"62583\"},{\"start\":\"62587\",\"end\":\"62590\"},{\"start\":\"62594\",\"end\":\"62598\"},{\"start\":\"62602\",\"end\":\"62608\"},{\"start\":\"62612\",\"end\":\"62618\"},{\"start\":\"62624\",\"end\":\"62628\"},{\"start\":\"62944\",\"end\":\"62947\"},{\"start\":\"62951\",\"end\":\"62954\"},{\"start\":\"63202\",\"end\":\"63211\"},{\"start\":\"63217\",\"end\":\"63225\"},{\"start\":\"63524\",\"end\":\"63532\"},{\"start\":\"63536\",\"end\":\"63541\"},{\"start\":\"63793\",\"end\":\"63798\"},{\"start\":\"63804\",\"end\":\"63809\"},{\"start\":\"63813\",\"end\":\"63822\"},{\"start\":\"63828\",\"end\":\"63836\"},{\"start\":\"64181\",\"end\":\"64183\"},{\"start\":\"64187\",\"end\":\"64190\"},{\"start\":\"64194\",\"end\":\"64199\"},{\"start\":\"64203\",\"end\":\"64208\"},{\"start\":\"64519\",\"end\":\"64526\"},{\"start\":\"64530\",\"end\":\"64539\"},{\"start\":\"64543\",\"end\":\"64551\"},{\"start\":\"64555\",\"end\":\"64562\"},{\"start\":\"64935\",\"end\":\"64938\"},{\"start\":\"65190\",\"end\":\"65196\"},{\"start\":\"65200\",\"end\":\"65204\"},{\"start\":\"65208\",\"end\":\"65213\"},{\"start\":\"65217\",\"end\":\"65224\"},{\"start\":\"65582\",\"end\":\"65586\"},{\"start\":\"65592\",\"end\":\"65597\"},{\"start\":\"65907\",\"end\":\"65911\"},{\"start\":\"65915\",\"end\":\"65920\"},{\"start\":\"65924\",\"end\":\"65928\"},{\"start\":\"65932\",\"end\":\"65937\"},{\"start\":\"65941\",\"end\":\"65945\"},{\"start\":\"66290\",\"end\":\"66293\"},{\"start\":\"66297\",\"end\":\"66308\"},{\"start\":\"66312\",\"end\":\"66316\"},{\"start\":\"66320\",\"end\":\"66327\"},{\"start\":\"66648\",\"end\":\"66652\"},{\"start\":\"66656\",\"end\":\"66660\"},{\"start\":\"66664\",\"end\":\"66669\"},{\"start\":\"66673\",\"end\":\"66678\"},{\"start\":\"66682\",\"end\":\"66686\"},{\"start\":\"66690\",\"end\":\"66693\"},{\"start\":\"67012\",\"end\":\"67017\"},{\"start\":\"67021\",\"end\":\"67027\"},{\"start\":\"67329\",\"end\":\"67335\"},{\"start\":\"67342\",\"end\":\"67348\"},{\"start\":\"67354\",\"end\":\"67360\"},{\"start\":\"67676\",\"end\":\"67685\"},{\"start\":\"67691\",\"end\":\"67698\"},{\"start\":\"68026\",\"end\":\"68030\"},{\"start\":\"68036\",\"end\":\"68040\"},{\"start\":\"68047\",\"end\":\"68049\"},{\"start\":\"68328\",\"end\":\"68332\"},{\"start\":\"68336\",\"end\":\"68350\"},{\"start\":\"68632\",\"end\":\"68638\"},{\"start\":\"68645\",\"end\":\"68651\"},{\"start\":\"68655\",\"end\":\"68664\"},{\"start\":\"68668\",\"end\":\"68677\"},{\"start\":\"68681\",\"end\":\"68688\"},{\"start\":\"69121\",\"end\":\"69124\"},{\"start\":\"69130\",\"end\":\"69134\"},{\"start\":\"69138\",\"end\":\"69146\"},{\"start\":\"69382\",\"end\":\"69387\"},{\"start\":\"69391\",\"end\":\"69401\"},{\"start\":\"69405\",\"end\":\"69409\"},{\"start\":\"69810\",\"end\":\"69820\"},{\"start\":\"69824\",\"end\":\"69828\"},{\"start\":\"70263\",\"end\":\"70268\"},{\"start\":\"70272\",\"end\":\"70277\"},{\"start\":\"70281\",\"end\":\"70290\"},{\"start\":\"71035\",\"end\":\"71042\"},{\"start\":\"71046\",\"end\":\"71050\"},{\"start\":\"71471\",\"end\":\"71477\"},{\"start\":\"71483\",\"end\":\"71487\"},{\"start\":\"71497\",\"end\":\"71507\"},{\"start\":\"71905\",\"end\":\"71909\"},{\"start\":\"71913\",\"end\":\"71923\"},{\"start\":\"71927\",\"end\":\"71929\"},{\"start\":\"72264\",\"end\":\"72273\"},{\"start\":\"72279\",\"end\":\"72286\"},{\"start\":\"72290\",\"end\":\"72296\"},{\"start\":\"72728\",\"end\":\"72731\"},{\"start\":\"72735\",\"end\":\"72738\"},{\"start\":\"73059\",\"end\":\"73064\"},{\"start\":\"73070\",\"end\":\"73075\"},{\"start\":\"73360\",\"end\":\"73363\"},{\"start\":\"73367\",\"end\":\"73369\"},{\"start\":\"73373\",\"end\":\"73375\"},{\"start\":\"73379\",\"end\":\"73381\"},{\"start\":\"73385\",\"end\":\"73388\"},{\"start\":\"73711\",\"end\":\"73720\"},{\"start\":\"73724\",\"end\":\"73737\"},{\"start\":\"73741\",\"end\":\"73748\"},{\"start\":\"74080\",\"end\":\"74090\"},{\"start\":\"74097\",\"end\":\"74100\"},{\"start\":\"74106\",\"end\":\"74109\"},{\"start\":\"74117\",\"end\":\"74121\"},{\"start\":\"74439\",\"end\":\"74445\"},{\"start\":\"74451\",\"end\":\"74455\"},{\"start\":\"74459\",\"end\":\"74469\"},{\"start\":\"74767\",\"end\":\"74772\"},{\"start\":\"74776\",\"end\":\"74781\"},{\"start\":\"74783\",\"end\":\"74788\"},{\"start\":\"75044\",\"end\":\"75048\"},{\"start\":\"75052\",\"end\":\"75055\"},{\"start\":\"75061\",\"end\":\"75066\"},{\"start\":\"75327\",\"end\":\"75337\"},{\"start\":\"75341\",\"end\":\"75348\"},{\"start\":\"75352\",\"end\":\"75355\"},{\"start\":\"75361\",\"end\":\"75367\"},{\"start\":\"75634\",\"end\":\"75641\"},{\"start\":\"75645\",\"end\":\"75654\"},{\"start\":\"75658\",\"end\":\"75663\"},{\"start\":\"75902\",\"end\":\"75908\"},{\"start\":\"75910\",\"end\":\"75918\"},{\"start\":\"76094\",\"end\":\"76098\"},{\"start\":\"76102\",\"end\":\"76107\"},{\"start\":\"76113\",\"end\":\"76119\"},{\"start\":\"76375\",\"end\":\"76379\"},{\"start\":\"76383\",\"end\":\"76386\"},{\"start\":\"76390\",\"end\":\"76393\"},{\"start\":\"76684\",\"end\":\"76694\"},{\"start\":\"76698\",\"end\":\"76701\"},{\"start\":\"76707\",\"end\":\"76715\"},{\"start\":\"77108\",\"end\":\"77110\"},{\"start\":\"77114\",\"end\":\"77118\"},{\"start\":\"77443\",\"end\":\"77446\"},{\"start\":\"77450\",\"end\":\"77454\"},{\"start\":\"77460\",\"end\":\"77462\"},{\"start\":\"77466\",\"end\":\"77470\"},{\"start\":\"77474\",\"end\":\"77479\"},{\"start\":\"77768\",\"end\":\"77772\"},{\"start\":\"77776\",\"end\":\"77779\"},{\"start\":\"77786\",\"end\":\"77788\"},{\"start\":\"77795\",\"end\":\"77799\"},{\"start\":\"78023\",\"end\":\"78032\"},{\"start\":\"78036\",\"end\":\"78043\"},{\"start\":\"78049\",\"end\":\"78056\"},{\"start\":\"78308\",\"end\":\"78313\"},{\"start\":\"78317\",\"end\":\"78320\"},{\"start\":\"78324\",\"end\":\"78328\"},{\"start\":\"78563\",\"end\":\"78570\"},{\"start\":\"78574\",\"end\":\"78579\"},{\"start\":\"78583\",\"end\":\"78590\"},{\"start\":\"78594\",\"end\":\"78603\"},{\"start\":\"78909\",\"end\":\"78917\"},{\"start\":\"78923\",\"end\":\"78930\"},{\"start\":\"79178\",\"end\":\"79182\"},{\"start\":\"79186\",\"end\":\"79189\"}]", "bib_entry": "[{\"start\":\"61847\",\"end\":\"62101\",\"attributes\":{\"matched_paper_id\":\"85502071\",\"id\":\"b0\"}},{\"start\":\"62103\",\"end\":\"62483\",\"attributes\":{\"matched_paper_id\":\"157068364\",\"id\":\"b1\"}},{\"start\":\"62485\",\"end\":\"62866\",\"attributes\":{\"matched_paper_id\":\"49293319\",\"id\":\"b2\"}},{\"start\":\"62868\",\"end\":\"63126\",\"attributes\":{\"matched_paper_id\":\"27953755\",\"id\":\"b3\"}},{\"start\":\"63128\",\"end\":\"63441\",\"attributes\":{\"matched_paper_id\":\"54459992\",\"id\":\"b4\"}},{\"start\":\"63443\",\"end\":\"63736\",\"attributes\":{\"matched_paper_id\":\"7630344\",\"id\":\"b5\"}},{\"start\":\"63738\",\"end\":\"64130\",\"attributes\":{\"matched_paper_id\":\"4572036\",\"id\":\"b6\"}},{\"start\":\"64132\",\"end\":\"64457\",\"attributes\":{\"matched_paper_id\":\"6818379\",\"id\":\"b7\"}},{\"start\":\"64459\",\"end\":\"64845\",\"attributes\":{\"matched_paper_id\":\"6219611\",\"id\":\"b8\"}},{\"start\":\"64847\",\"end\":\"65107\",\"attributes\":{\"matched_paper_id\":\"7885113\",\"id\":\"b9\"}},{\"start\":\"65109\",\"end\":\"65489\",\"attributes\":{\"matched_paper_id\":\"215806739\",\"id\":\"b10\"}},{\"start\":\"65491\",\"end\":\"65824\",\"attributes\":{\"matched_paper_id\":\"57117174\",\"id\":\"b11\"}},{\"start\":\"65826\",\"end\":\"66210\",\"attributes\":{\"matched_paper_id\":\"3848424\",\"id\":\"b12\"}},{\"start\":\"66212\",\"end\":\"66572\",\"attributes\":{\"matched_paper_id\":\"351844\",\"id\":\"b13\"}},{\"start\":\"66574\",\"end\":\"66944\",\"attributes\":{\"matched_paper_id\":\"206711286\",\"id\":\"b14\"}},{\"start\":\"66946\",\"end\":\"67237\",\"attributes\":{\"matched_paper_id\":\"8999574\",\"id\":\"b15\"}},{\"start\":\"67239\",\"end\":\"67582\",\"attributes\":{\"matched_paper_id\":\"1606725\",\"id\":\"b16\"}},{\"start\":\"67584\",\"end\":\"67912\",\"attributes\":{\"matched_paper_id\":\"1220118\",\"id\":\"b17\"}},{\"start\":\"67914\",\"end\":\"68255\",\"attributes\":{\"matched_paper_id\":\"30119827\",\"id\":\"b18\"}},{\"start\":\"68257\",\"end\":\"68540\",\"attributes\":{\"matched_paper_id\":\"15979807\",\"id\":\"b19\"}},{\"start\":\"68542\",\"end\":\"69036\",\"attributes\":{\"matched_paper_id\":\"9471256\",\"id\":\"b20\"}},{\"start\":\"69038\",\"end\":\"69316\",\"attributes\":{\"matched_paper_id\":\"18181\",\"id\":\"b21\"}},{\"start\":\"69318\",\"end\":\"69734\",\"attributes\":{\"matched_paper_id\":\"53083445\",\"id\":\"b22\"}},{\"start\":\"69736\",\"end\":\"70134\",\"attributes\":{\"matched_paper_id\":\"7314745\",\"id\":\"b23\"}},{\"start\":\"70136\",\"end\":\"70966\",\"attributes\":{\"matched_paper_id\":\"53095245\",\"id\":\"b24\"}},{\"start\":\"70968\",\"end\":\"71378\",\"attributes\":{\"matched_paper_id\":\"4135088\",\"id\":\"b25\"}},{\"start\":\"71380\",\"end\":\"71825\",\"attributes\":{\"matched_paper_id\":\"169034400\",\"id\":\"b26\"}},{\"start\":\"71827\",\"end\":\"72162\",\"attributes\":{\"matched_paper_id\":\"573894\",\"id\":\"b27\"}},{\"start\":\"72164\",\"end\":\"72638\",\"attributes\":{\"matched_paper_id\":\"21453236\",\"id\":\"b28\"}},{\"start\":\"72640\",\"end\":\"72965\",\"attributes\":{\"matched_paper_id\":\"9691561\",\"id\":\"b29\"}},{\"start\":\"72967\",\"end\":\"73281\",\"attributes\":{\"matched_paper_id\":\"67145007\",\"id\":\"b30\"}},{\"start\":\"73283\",\"end\":\"73601\",\"attributes\":{\"id\":\"b31\"}},{\"start\":\"73603\",\"end\":\"73998\",\"attributes\":{\"matched_paper_id\":\"37033767\",\"id\":\"b32\"}},{\"start\":\"74000\",\"end\":\"74348\",\"attributes\":{\"matched_paper_id\":\"52111345\",\"id\":\"b33\"}},{\"start\":\"74350\",\"end\":\"74681\",\"attributes\":{\"id\":\"b34\"}},{\"start\":\"74683\",\"end\":\"74998\",\"attributes\":{\"matched_paper_id\":\"47021979\",\"id\":\"b35\"}},{\"start\":\"75000\",\"end\":\"75227\",\"attributes\":{\"matched_paper_id\":\"7319079\",\"id\":\"b36\"}},{\"start\":\"75229\",\"end\":\"75568\",\"attributes\":{\"matched_paper_id\":\"13560202\",\"id\":\"b37\"}},{\"start\":\"75570\",\"end\":\"75898\",\"attributes\":{\"matched_paper_id\":\"10263815\",\"id\":\"b38\"}},{\"start\":\"75900\",\"end\":\"76019\",\"attributes\":{\"id\":\"b39\"}},{\"start\":\"76021\",\"end\":\"76304\",\"attributes\":{\"matched_paper_id\":\"25724569\",\"id\":\"b40\"}},{\"start\":\"76306\",\"end\":\"76610\",\"attributes\":{\"matched_paper_id\":\"1448727\",\"id\":\"b41\"}},{\"start\":\"76612\",\"end\":\"77015\",\"attributes\":{\"matched_paper_id\":\"1770076\",\"id\":\"b42\"}},{\"start\":\"77017\",\"end\":\"77341\",\"attributes\":{\"matched_paper_id\":\"9314594\",\"id\":\"b43\"}},{\"start\":\"77343\",\"end\":\"77723\",\"attributes\":{\"matched_paper_id\":\"13044231\",\"id\":\"b44\"}},{\"start\":\"77725\",\"end\":\"77951\",\"attributes\":{\"matched_paper_id\":\"3413005\",\"id\":\"b45\"}},{\"start\":\"77953\",\"end\":\"78264\",\"attributes\":{\"matched_paper_id\":\"18025970\",\"id\":\"b46\"}},{\"start\":\"78266\",\"end\":\"78469\",\"attributes\":{\"matched_paper_id\":\"21697134\",\"id\":\"b47\"}},{\"start\":\"78471\",\"end\":\"78823\",\"attributes\":{\"matched_paper_id\":\"70261704\",\"id\":\"b48\"}},{\"start\":\"78825\",\"end\":\"79141\",\"attributes\":{\"matched_paper_id\":\"40775859\",\"id\":\"b49\"}},{\"start\":\"79143\",\"end\":\"79320\",\"attributes\":{\"matched_paper_id\":\"12169258\",\"id\":\"b50\"}}]", "bib_title": "[{\"start\":\"61847\",\"end\":\"61909\"},{\"start\":\"62103\",\"end\":\"62207\"},{\"start\":\"62485\",\"end\":\"62575\"},{\"start\":\"62868\",\"end\":\"62940\"},{\"start\":\"63128\",\"end\":\"63198\"},{\"start\":\"63443\",\"end\":\"63518\"},{\"start\":\"63738\",\"end\":\"63789\"},{\"start\":\"64132\",\"end\":\"64177\"},{\"start\":\"64459\",\"end\":\"64515\"},{\"start\":\"64847\",\"end\":\"64931\"},{\"start\":\"65109\",\"end\":\"65186\"},{\"start\":\"65491\",\"end\":\"65576\"},{\"start\":\"65826\",\"end\":\"65903\"},{\"start\":\"66212\",\"end\":\"66286\"},{\"start\":\"66574\",\"end\":\"66644\"},{\"start\":\"66946\",\"end\":\"67008\"},{\"start\":\"67239\",\"end\":\"67325\"},{\"start\":\"67584\",\"end\":\"67670\"},{\"start\":\"67914\",\"end\":\"68019\"},{\"start\":\"68257\",\"end\":\"68322\"},{\"start\":\"68542\",\"end\":\"68628\"},{\"start\":\"69038\",\"end\":\"69117\"},{\"start\":\"69318\",\"end\":\"69378\"},{\"start\":\"69736\",\"end\":\"69806\"},{\"start\":\"70136\",\"end\":\"70259\"},{\"start\":\"70968\",\"end\":\"71031\"},{\"start\":\"71380\",\"end\":\"71467\"},{\"start\":\"71827\",\"end\":\"71901\"},{\"start\":\"72164\",\"end\":\"72260\"},{\"start\":\"72640\",\"end\":\"72724\"},{\"start\":\"72967\",\"end\":\"73053\"},{\"start\":\"73283\",\"end\":\"73356\"},{\"start\":\"73603\",\"end\":\"73705\"},{\"start\":\"74000\",\"end\":\"74076\"},{\"start\":\"74350\",\"end\":\"74435\"},{\"start\":\"74683\",\"end\":\"74763\"},{\"start\":\"75000\",\"end\":\"75040\"},{\"start\":\"75229\",\"end\":\"75323\"},{\"start\":\"75570\",\"end\":\"75630\"},{\"start\":\"76021\",\"end\":\"76090\"},{\"start\":\"76306\",\"end\":\"76371\"},{\"start\":\"76612\",\"end\":\"76680\"},{\"start\":\"77017\",\"end\":\"77104\"},{\"start\":\"77343\",\"end\":\"77439\"},{\"start\":\"77725\",\"end\":\"77764\"},{\"start\":\"77953\",\"end\":\"78019\"},{\"start\":\"78266\",\"end\":\"78304\"},{\"start\":\"78471\",\"end\":\"78557\"},{\"start\":\"78825\",\"end\":\"78903\"},{\"start\":\"79143\",\"end\":\"79174\"}]", "bib_author": "[{\"start\":\"61911\",\"end\":\"61918\"},{\"start\":\"61918\",\"end\":\"61927\"},{\"start\":\"61927\",\"end\":\"61941\"},{\"start\":\"62209\",\"end\":\"62219\"},{\"start\":\"62219\",\"end\":\"62229\"},{\"start\":\"62229\",\"end\":\"62249\"},{\"start\":\"62577\",\"end\":\"62585\"},{\"start\":\"62585\",\"end\":\"62592\"},{\"start\":\"62592\",\"end\":\"62600\"},{\"start\":\"62600\",\"end\":\"62610\"},{\"start\":\"62610\",\"end\":\"62620\"},{\"start\":\"62620\",\"end\":\"62630\"},{\"start\":\"62942\",\"end\":\"62949\"},{\"start\":\"62949\",\"end\":\"62956\"},{\"start\":\"63200\",\"end\":\"63213\"},{\"start\":\"63213\",\"end\":\"63227\"},{\"start\":\"63520\",\"end\":\"63534\"},{\"start\":\"63534\",\"end\":\"63543\"},{\"start\":\"63791\",\"end\":\"63800\"},{\"start\":\"63800\",\"end\":\"63811\"},{\"start\":\"63811\",\"end\":\"63824\"},{\"start\":\"63824\",\"end\":\"63838\"},{\"start\":\"64179\",\"end\":\"64185\"},{\"start\":\"64185\",\"end\":\"64192\"},{\"start\":\"64192\",\"end\":\"64201\"},{\"start\":\"64201\",\"end\":\"64210\"},{\"start\":\"64517\",\"end\":\"64528\"},{\"start\":\"64528\",\"end\":\"64541\"},{\"start\":\"64541\",\"end\":\"64553\"},{\"start\":\"64553\",\"end\":\"64564\"},{\"start\":\"64933\",\"end\":\"64940\"},{\"start\":\"65188\",\"end\":\"65198\"},{\"start\":\"65198\",\"end\":\"65206\"},{\"start\":\"65206\",\"end\":\"65215\"},{\"start\":\"65215\",\"end\":\"65226\"},{\"start\":\"65578\",\"end\":\"65588\"},{\"start\":\"65588\",\"end\":\"65599\"},{\"start\":\"65905\",\"end\":\"65913\"},{\"start\":\"65913\",\"end\":\"65922\"},{\"start\":\"65922\",\"end\":\"65930\"},{\"start\":\"65930\",\"end\":\"65939\"},{\"start\":\"65939\",\"end\":\"65947\"},{\"start\":\"66288\",\"end\":\"66295\"},{\"start\":\"66295\",\"end\":\"66310\"},{\"start\":\"66310\",\"end\":\"66318\"},{\"start\":\"66318\",\"end\":\"66329\"},{\"start\":\"66646\",\"end\":\"66654\"},{\"start\":\"66654\",\"end\":\"66662\"},{\"start\":\"66662\",\"end\":\"66671\"},{\"start\":\"66671\",\"end\":\"66680\"},{\"start\":\"66680\",\"end\":\"66688\"},{\"start\":\"66688\",\"end\":\"66695\"},{\"start\":\"67010\",\"end\":\"67019\"},{\"start\":\"67019\",\"end\":\"67029\"},{\"start\":\"67327\",\"end\":\"67337\"},{\"start\":\"67337\",\"end\":\"67350\"},{\"start\":\"67350\",\"end\":\"67362\"},{\"start\":\"67672\",\"end\":\"67687\"},{\"start\":\"67687\",\"end\":\"67700\"},{\"start\":\"68021\",\"end\":\"68032\"},{\"start\":\"68032\",\"end\":\"68042\"},{\"start\":\"68042\",\"end\":\"68051\"},{\"start\":\"68324\",\"end\":\"68334\"},{\"start\":\"68334\",\"end\":\"68352\"},{\"start\":\"68630\",\"end\":\"68640\"},{\"start\":\"68640\",\"end\":\"68653\"},{\"start\":\"68653\",\"end\":\"68666\"},{\"start\":\"68666\",\"end\":\"68679\"},{\"start\":\"68679\",\"end\":\"68690\"},{\"start\":\"69119\",\"end\":\"69126\"},{\"start\":\"69126\",\"end\":\"69136\"},{\"start\":\"69136\",\"end\":\"69148\"},{\"start\":\"69380\",\"end\":\"69389\"},{\"start\":\"69389\",\"end\":\"69403\"},{\"start\":\"69403\",\"end\":\"69411\"},{\"start\":\"69808\",\"end\":\"69822\"},{\"start\":\"69822\",\"end\":\"69830\"},{\"start\":\"70261\",\"end\":\"70270\"},{\"start\":\"70270\",\"end\":\"70279\"},{\"start\":\"70279\",\"end\":\"70292\"},{\"start\":\"71033\",\"end\":\"71044\"},{\"start\":\"71044\",\"end\":\"71052\"},{\"start\":\"71469\",\"end\":\"71479\"},{\"start\":\"71479\",\"end\":\"71489\"},{\"start\":\"71489\",\"end\":\"71509\"},{\"start\":\"71903\",\"end\":\"71911\"},{\"start\":\"71911\",\"end\":\"71925\"},{\"start\":\"71925\",\"end\":\"71931\"},{\"start\":\"72262\",\"end\":\"72275\"},{\"start\":\"72275\",\"end\":\"72288\"},{\"start\":\"72288\",\"end\":\"72298\"},{\"start\":\"72726\",\"end\":\"72733\"},{\"start\":\"72733\",\"end\":\"72740\"},{\"start\":\"73055\",\"end\":\"73066\"},{\"start\":\"73066\",\"end\":\"73077\"},{\"start\":\"73358\",\"end\":\"73365\"},{\"start\":\"73365\",\"end\":\"73371\"},{\"start\":\"73371\",\"end\":\"73377\"},{\"start\":\"73377\",\"end\":\"73383\"},{\"start\":\"73383\",\"end\":\"73390\"},{\"start\":\"73707\",\"end\":\"73722\"},{\"start\":\"73722\",\"end\":\"73739\"},{\"start\":\"73739\",\"end\":\"73750\"},{\"start\":\"74078\",\"end\":\"74092\"},{\"start\":\"74092\",\"end\":\"74102\"},{\"start\":\"74102\",\"end\":\"74111\"},{\"start\":\"74111\",\"end\":\"74123\"},{\"start\":\"74437\",\"end\":\"74447\"},{\"start\":\"74447\",\"end\":\"74457\"},{\"start\":\"74457\",\"end\":\"74471\"},{\"start\":\"74765\",\"end\":\"74774\"},{\"start\":\"74774\",\"end\":\"74783\"},{\"start\":\"74783\",\"end\":\"74790\"},{\"start\":\"75042\",\"end\":\"75050\"},{\"start\":\"75050\",\"end\":\"75057\"},{\"start\":\"75057\",\"end\":\"75068\"},{\"start\":\"75325\",\"end\":\"75339\"},{\"start\":\"75339\",\"end\":\"75350\"},{\"start\":\"75350\",\"end\":\"75357\"},{\"start\":\"75357\",\"end\":\"75369\"},{\"start\":\"75632\",\"end\":\"75643\"},{\"start\":\"75643\",\"end\":\"75656\"},{\"start\":\"75656\",\"end\":\"75665\"},{\"start\":\"75902\",\"end\":\"75910\"},{\"start\":\"75910\",\"end\":\"75920\"},{\"start\":\"76092\",\"end\":\"76100\"},{\"start\":\"76100\",\"end\":\"76109\"},{\"start\":\"76109\",\"end\":\"76121\"},{\"start\":\"76373\",\"end\":\"76381\"},{\"start\":\"76381\",\"end\":\"76388\"},{\"start\":\"76388\",\"end\":\"76395\"},{\"start\":\"76682\",\"end\":\"76696\"},{\"start\":\"76696\",\"end\":\"76703\"},{\"start\":\"76703\",\"end\":\"76717\"},{\"start\":\"77106\",\"end\":\"77112\"},{\"start\":\"77112\",\"end\":\"77120\"},{\"start\":\"77441\",\"end\":\"77448\"},{\"start\":\"77448\",\"end\":\"77456\"},{\"start\":\"77456\",\"end\":\"77464\"},{\"start\":\"77464\",\"end\":\"77472\"},{\"start\":\"77472\",\"end\":\"77481\"},{\"start\":\"77766\",\"end\":\"77774\"},{\"start\":\"77774\",\"end\":\"77781\"},{\"start\":\"77781\",\"end\":\"77790\"},{\"start\":\"77790\",\"end\":\"77801\"},{\"start\":\"78021\",\"end\":\"78034\"},{\"start\":\"78034\",\"end\":\"78045\"},{\"start\":\"78045\",\"end\":\"78058\"},{\"start\":\"78306\",\"end\":\"78315\"},{\"start\":\"78315\",\"end\":\"78322\"},{\"start\":\"78322\",\"end\":\"78330\"},{\"start\":\"78559\",\"end\":\"78572\"},{\"start\":\"78572\",\"end\":\"78581\"},{\"start\":\"78581\",\"end\":\"78592\"},{\"start\":\"78592\",\"end\":\"78605\"},{\"start\":\"78905\",\"end\":\"78919\"},{\"start\":\"78919\",\"end\":\"78932\"},{\"start\":\"79176\",\"end\":\"79184\"},{\"start\":\"79184\",\"end\":\"79191\"}]", "bib_venue": "[{\"start\":\"61941\",\"end\":\"61952\"},{\"start\":\"62249\",\"end\":\"62261\"},{\"start\":\"62630\",\"end\":\"62647\"},{\"start\":\"62956\",\"end\":\"62970\"},{\"start\":\"63227\",\"end\":\"63258\"},{\"start\":\"63543\",\"end\":\"63560\"},{\"start\":\"63838\",\"end\":\"63890\"},{\"start\":\"64210\",\"end\":\"64254\"},{\"start\":\"64564\",\"end\":\"64638\"},{\"start\":\"64940\",\"end\":\"64952\"},{\"start\":\"65226\",\"end\":\"65262\"},{\"start\":\"65599\",\"end\":\"65629\"},{\"start\":\"65947\",\"end\":\"65982\"},{\"start\":\"66329\",\"end\":\"66365\"},{\"start\":\"66695\",\"end\":\"66730\"},{\"start\":\"67029\",\"end\":\"67060\"},{\"start\":\"67362\",\"end\":\"67380\"},{\"start\":\"67700\",\"end\":\"67722\"},{\"start\":\"68051\",\"end\":\"68059\"},{\"start\":\"68352\",\"end\":\"68372\"},{\"start\":\"68690\",\"end\":\"68736\"},{\"start\":\"69148\",\"end\":\"69159\"},{\"start\":\"69411\",\"end\":\"69476\"},{\"start\":\"69830\",\"end\":\"69891\"},{\"start\":\"70292\",\"end\":\"70429\"},{\"start\":\"71052\",\"end\":\"71118\"},{\"start\":\"71509\",\"end\":\"71559\"},{\"start\":\"71931\",\"end\":\"71966\"},{\"start\":\"72298\",\"end\":\"72354\"},{\"start\":\"72740\",\"end\":\"72776\"},{\"start\":\"73077\",\"end\":\"73097\"},{\"start\":\"73390\",\"end\":\"73412\"},{\"start\":\"73750\",\"end\":\"73776\"},{\"start\":\"74123\",\"end\":\"74147\"},{\"start\":\"74471\",\"end\":\"74490\"},{\"start\":\"74790\",\"end\":\"74814\"},{\"start\":\"75068\",\"end\":\"75090\"},{\"start\":\"75369\",\"end\":\"75380\"},{\"start\":\"75665\",\"end\":\"75702\"},{\"start\":\"76121\",\"end\":\"76132\"},{\"start\":\"76395\",\"end\":\"76429\"},{\"start\":\"76717\",\"end\":\"76764\"},{\"start\":\"77120\",\"end\":\"77152\"},{\"start\":\"77481\",\"end\":\"77505\"},{\"start\":\"77801\",\"end\":\"77815\"},{\"start\":\"78058\",\"end\":\"78083\"},{\"start\":\"78330\",\"end\":\"78344\"},{\"start\":\"78605\",\"end\":\"78616\"},{\"start\":\"78932\",\"end\":\"78954\"},{\"start\":\"79191\",\"end\":\"79208\"},{\"start\":\"63892\",\"end\":\"63938\"},{\"start\":\"64256\",\"end\":\"64294\"},{\"start\":\"65264\",\"end\":\"65294\"},{\"start\":\"65984\",\"end\":\"66013\"},{\"start\":\"67062\",\"end\":\"67087\"},{\"start\":\"68738\",\"end\":\"68778\"},{\"start\":\"69161\",\"end\":\"69166\"},{\"start\":\"69478\",\"end\":\"69537\"},{\"start\":\"69893\",\"end\":\"69948\"},{\"start\":\"70431\",\"end\":\"70562\"},{\"start\":\"71120\",\"end\":\"71180\"},{\"start\":\"71561\",\"end\":\"71605\"},{\"start\":\"72356\",\"end\":\"72406\"},{\"start\":\"75382\",\"end\":\"75387\"},{\"start\":\"75704\",\"end\":\"75735\"},{\"start\":\"76766\",\"end\":\"76807\"}]"}}}, "year": 2023, "month": 12, "day": 17}