{"id": 219547841, "updated": "2022-01-24 12:21:52.25", "metadata": {"title": "Attack Hypothesis Generation", "authors": "[{\"middle\":[],\"last\":\"Elitzur\",\"first\":\"Aviad\"},{\"middle\":[],\"last\":\"Puzis\",\"first\":\"Rami\"},{\"middle\":[],\"last\":\"Zilberman\",\"first\":\"Polina\"}]", "venue": "2019 European Intelligence and Security Informatics Conference (EISIC)", "journal": "2019 European Intelligence and Security Informatics Conference (EISIC)", "publication_date": {"year": 2019, "month": null, "day": null}, "abstract": "In recent years, the perpetrators of cyber-attacks have been playing a dynamic cat and mouse game with cybersecurity analysts who try to trace the attack and reconstruct the attack steps. While analysts rely on alert correlations, machine learning, and advanced visualizations in order to come up with sound attack hypotheses, they primarily rely on their knowledge and experience. Cyber Threat Intelligence (CTI) on past similar attacks may help with attack reconstruction by providing a deeper understanding of the tools and attack patterns used by attackers. In this paper, we present the Attack Hypothesis Generator (AHG) which takes advantage of a knowledge graph derived from threat intelligence in order to generate hypotheses regarding attacks that may be present in an organizational network. Based on five recommendation algorithms we have developed and preliminary analysis provided by a security analyst, AHG provides an attack hypothesis comprised of yet unobserved attack patterns and tools presumed to have been used by the attacker. The proposed algorithms can help security analysts by improving attack reconstruction and proposing new directions for investigation. Experiments show that when implemented with the MITRE ATT&CK knowledge graph, our algorithms can significantly increase the accuracy of the analyst's preliminary analysis.", "fields_of_study": "[\"Computer Science\"]", "external_ids": {"arxiv": null, "mag": "3033945962", "acl": null, "pubmed": null, "pubmedcentral": null, "dblp": "conf/eisic/ElitzurPZ19", "doi": "10.1109/eisic49498.2019.9108886"}}, "content": {"source": {"pdf_hash": "0502da5be96bb326c744f2e12b1880ea91cc39e4", "pdf_src": "IEEE", "pdf_uri": null, "oa_url_match": false, "oa_info": null}, "grobid": {"id": "50aa1f30f787e0e6918fb3c0d71c040f01eb2cb6", "type": "plain-text", "url": "s3://ai2-s2-pdf-extraction-prod/parse-results/s2orc_worker/0502da5be96bb326c744f2e12b1880ea91cc39e4.txt", "contents": "\nAttack Hypothesis Generation\n\n\nAviad Elitzur s:elitzura@post.bgu.ac.il \nEuropean Intelligence and Security Informatics Conference (EISIC)\nDept. of Software and Information Systems Engineering, § Cyber@BGU Ben-Gurion University of the Negev\n2019Beer-ShevaIsrael\n\nRami Puzis \nEuropean Intelligence and Security Informatics Conference (EISIC)\nDept. of Software and Information Systems Engineering, § Cyber@BGU Ben-Gurion University of the Negev\n2019Beer-ShevaIsrael\n\nPolina Zilberman polinaz@bgu.ac.il \nEuropean Intelligence and Security Informatics Conference (EISIC)\nDept. of Software and Information Systems Engineering, § Cyber@BGU Ben-Gurion University of the Negev\n2019Beer-ShevaIsrael\n\nAttack Hypothesis Generation\nIndex Terms-Threat intelligenceattack hypothesisknowl- edge graphs\nIn recent years, the perpetrators of cyber-attacks have been playing a dynamic cat and mouse game with cybersecurity analysts who try to trace the attack and reconstruct the attack steps. While analysts rely on alert correlations, machine learning, and advanced visualizations in order to come up with sound attack hypotheses, they primarily rely on their knowledge and experience. Cyber Threat Intelligence (CTI) on past similar attacks may help with attack reconstruction by providing a deeper understanding of the tools and attack patterns used by attackers.In this paper, we present the Attack Hypothesis Generator (AHG) which takes advantage of a knowledge graph derived from threat intelligence in order to generate hypotheses regarding attacks that may be present in an organizational network. Based on five recommendation algorithms we have developed and preliminary analysis provided by a security analyst, AHG provides an attack hypothesis comprised of yet unobserved attack patterns and tools presumed to have been used by the attacker. The proposed algorithms can help security analysts by improving attack reconstruction and proposing new directions for investigation. Experiments show that when implemented with the MITRE ATT&CK knowledge graph, our algorithms can significantly increase the accuracy of the analyst's preliminary analysis.Index Terms-Threat intelligence, attack hypothesis, knowledge graphs.\n\nI. INTRODUCTION\n\nIn recent years, the perpetrators of cyber-attacks play a dynamic cat and mouse game with those trying to stop them. In order to stay ahead of their opponent, cybersecurity analysts search for techniques that can assist them in the forensic investigation of attacks as they try to infer the attacker objectives, trace back the attack vector used for initial penetration, or reconstruct the intermediate attack steps. Figure 1 presents the general workflow of forensic investigation. Sensors that send monitored data to the organization's Security Information and Event Management (SIEM) ( Figure  1-A) serve as the basis of an organization's security array. The SIEM aggregates and correlates the data from the sensors, and generates alerts when a suspicious event is detected (Figure 1-B). The analyst investigates these alerts, performs triage, and decides on a course of action.\n\nCurrently, there are no fully automated Security Operations Centers (SOCs). Analysts have primary responsibility for understanding, prioritizing, investigating, and responding to the alerts (Figure 1-C). One of the analyst's aims is to draw conclusions from the alerts raised by the SIEM about the goals of the attacker, how the artifacts discovered serve the attacker's goals, and how the attacker might achieve his goals.  [2]. Yet, there is a lack of automation tools and algorithms that utilize high-level CTI, such as attack patterns, to aid the analyst with his tasks.\n\nIn this paper, we present the Attack Hypothesis Generator (AHG), which leverages threat intelligence to provide insights on the methods and tools used in the attack (Figure 1-D). AHG applies recommender system techniques on a threat intelligence graph to generate insights about the ongoing attack. Provided insights increase the efficiency of his investigations by improving the analyst's hypotheses and resulting in actionable investigative items (Figure 1-E,F).\n\nAHG simplifies the investigations performed by forensic analysts. Its main contributions are three-fold: 1) utilizing threat intelligence to improve attack hypotheses 2) improving the accuracy of hypotheses provided by the analyst by a factor of 1.37 on average 3) suggesting actionable items to guide the analyst through further forensic investigation. Through high-level reasoning on the CTI knowledge graph, AHG provides full descriptions of the hypothetical attacks by complementing yet undetected attack patterns and tools. The ability of AHG to complement the descriptions of hypothetical attacks is a critical step toward increasing the automation level of forensic investigations.\n\nThe rest of the paper is structured as follows. Relevant background and related work are described in Section II. Section III presents the proposed AHG's algorithms, which are evaluated in Section IV. A summary and our conclusions are presented in Section V.\n\n\nII. BACKGROUND & RELATED WORK\n\nTraditional methods are insufficient due to the rapidly changing and evolving cyber threat landscape. CTI, shared by organizations, aids in strategic decision making and speeds up the adaptation of the defenses to the new threats. However, one of the most significant challenges is the need to translate the accumulated CTI into operational steps. Most of the traditional Artificial Intelligence (AI) methods do not take advantage of the knowledge accumulated through sharing CTI. In this section, we review techniques that leverage CTI for security operations.\n\n\nA. Technical and Tactical CTI\n\nCTI is an evidence-based knowledge about threats that can help in forming decisions [3]. CTI bridges the gap between human knowledge about cyber threats targeting organizations and attack predictions. 1 As a result, CTI helps organizations to stay up-to-date with the everyday increasing amount of cyber threats. Companies use CTI to document suspicious and malicious activities, enable information sharing among companies, and promote automation in the process of identifying and investigating attacks on the organization. Tounsi et al. [4] discuss four categories of CTI: strategic threat intelligence, operational threat intelligence, tactical threat intelligence, and technical threat intelligence.\n\nThe hierarchy of tactical and technical indicators is represented by the Pyramid of Pain (PoP) [5]. The bottom levels of the PoP include technical indicators, specifically, hash values, IP addresses, domain names, and network/host artifacts. These indicators have accurate values, but they are easily modified by the attacker, for example, an attacker may change IP addresses and file hashes with minimal effort. 2 Even domain names can easily be changed due to the free DNS providers and lax registration standards.\n\nThe higher levels of the PoP include tactical indicators, which are behavior-oriented. Tools, tactics, techniques, and procedures are patterns of activities or methods associated with a specific threat actor or a group of threat actors [6]. Identifying the high-level footprint of an attack is more challenging due to the intricate patterns and the similarity to normal behavior. Attacker behavior modeling is an essential step toward an in-depth understanding of attack methods, increased detection, and analytic capabilities.\n\nObrst et al. [7] mentioned Structured Threat Information eXpression (STIX) as an overarching CTI framework. STIX defines various cyber ontology elements such as adversaries, tactics, techniques, and procedures (TTP), incidents, indicators, vulnerabilities, and courses of action. A STIX element is denoted as STIX Domain Object (SDO). MITRE ATT&CK use different terminology from STIX2.x. What ATT&CK refers to as technique, STIX2.x refers to as attack patterns. What ATT&CK refers to as groups are campaigns, intrusionsets, and threat actors in STIX2.x. For the rest of this paper, we use the terminology of STIX2.x.\n\nThe immediate requirements for using CTI are the ability of the analyst to search and view the collected CTI. Bohm et al. [8] presented a framework to aid security analysts in their investigation by enabling searches in a graph of STIX elements and providing visualization of the graph. As part of this study, security analysts were asked to work with the proposed framework. The surveyed analysts reported that the proposed visualization of CTI helped them in their investigations. Gascon et al. [9] built a platform that unified CTI reports into a graph representation and enabled information retrieval search based on their a novel similarity algorithm. Their innovative search enabled searching on a variety of nodes' attributes and multiple sets of nodes (subgraph).\n\n\nB. Reasoning with Operational and Strategic CTI\n\nAttack reconstruction, which is often the output of a successful threat hunting procedure, refers to describing a threat by presenting the different steps the attacker managed to execute successfully. The security analyst should be able to explain how each step was achieved by pointing to the relevant events based on collected evidence and their analysis [10].\n\nMilajerdi et al. [11] presented a framework for real-time APT detection by analyzing kernel audit logs. The framework produces a high-level scenario graph with relationships between TTPs for each detected APT. Bhatt et al. [12] also suggested an APT detection model. The proposed model is used to improve hypothesizing on ongoing attacks given correlated events and the Cyber Kill Chain (CKC) [13]. 3 Rubinshtein et al. [14] built an attack ontology and reconstructed attack steps based on this ontology.\n\nPolatidis et al. [15] proposed an approach for cyber attack prediction using visualized attack graphs and recommender systems, however, the modeling of an attacker's behavior was based on exploiting vulnerabilities, regardless of the attacker's goals.\n\nKotenko and Saenko [16] proposed a cybersecurity ontology, which includes malefactor, attack, topology, cost, zeroday, and system metrics along with environmental components. Following an attack detection, an analyst can implement countermeasures using the metrics and the relationships between metrics the attacked environment components.\n\nGiura et al. [17] proposed an attack pyramid that aims to capture the movements of an attacker through CKC phases (represented by the levels of the pyramid), and organization's environments (represented by the planes of the pyramid), e.g., physical, network, user and application. The attacker's goal is located at the top of the pyramid, and it is reachable by stepping from one event to another. The pyramid enables to detect the attack path and the attacker's goal. Iqbal et al. [18] built a unified graph representation for CKC and PoP models by extracting entities from textual reports. They compared two variants of the same attack and showed that they could map TTPs for each stage of the attack using the graph. Consequently, the authors derive and predict missing TTPs from the graph.\n\nAlEroud et al. [19] used domain knowledge to improve initial predictions and create an accurate attack profile. Attacks were represented as nodes on Semantic Link Networks (SLNs). First, the authors ranked predictions according to the SLN, and then, with domain knowledge and a taxonomy, they adjusted predictions according to the predictions' correlation to the taxonomy.\n\n\nC. Reasoning Using CTI Knowledge Graphs\n\nIn the field of cybersecurity, the use of knowledge graphs is in its early stages and is mainly used for visualization and less for prediction.\n\nLee et al. [20] built a knowledge graph from open-source intelligence (OSINT). With known graph algorithms, they represent valuable relationships for the analyst. In particular, they use PageRank and Betweenness metrics to detect relevant information in the graph.\n\nGao et al. [21] presented a trust evaluation mechanism to assess which information is relevant (malicious) and which is not. They extract features from the suspicious threat along with graph-based features, and train supervised classification algorithms to distinguish between trusted and untrusted information. They found that graph-based features increase the accuracy of the trained models. The authors proposed three graph mining features: similarity, correlation, and frequent patterns. The similarity feature reflects the similarity between the timestamps of the nodes. The correlation feature is the number of correlated nodes (number of nodes related to the inspected data in the intelligence graph). The frequent patterns feature represents the patterns of the inspected data that exist in the graph.\n\nQamar et al. [22] and Riesco and Villagrá [23] proposed data-driven analytics based on the STIX ontology. They used logic-based deductive inference rules (defined in Semantic Web Rule Language (SWRL)) and defined valuable queries for evaluating threat likelihood and managing cyber threat response activities. Although logic rules may detect complex patterns in the CTI, a domain expert is required to define the rules, which is the main drawback of this method.\n\n\nIII. PROPOSED SOLUTIONS\n\nIn this section, we present the problem and five approaches inspired by recommender systems and knowledge graphs.\n\n\nA. Problem Definition\n\nAssume a security analyst who investigates suspicious events taking place in an organization. Based on alerts and various artifacts recorded in the organization's SIEM, the analyst formulates an initial hypothesis on the course of the possible attack (see the full use case in Figure 1). The goal of AHG is to improve the analyst's hypothesis.\n\nFollowing the STIX2.x terminology, we build a knowledge graph consisting of the following types of SDOs: Campaign (C), Malware (M), Intrusion Set (IS), Attack Pattern (AP), We distinguish between the attack representation SDOs and attack descriptive SDOs. An attack representation is a single SDO that contains information about an attack, such as name, creation date, and CKC phases. SDOs that can be used to represent an attack, specifically Campaign (C), Malware (M) and Intrusion Set (IS), are grouped in a super-set denoted as A. Further, an attack descriptive SDO is an SDO that contains information about an element that has been used or targeted by the attack. SDOs that can be used to describe an attack, specifically SDOs of types Attack Pattern (AP), Identity (ID), Threat Actor (TA), Tool (T) and Vulnerability (VUL), are grouped in a super-set denoted as D.\n\nDefinition 1 (Cyber-security Knowledge Graph): Cybersecurity knowledge graph KG = A, D, E is a bipartite graph where A are the nodes representing past attacks, D contains the description nodes (specifically, attack patterns and tools), and E ⊆ A × D are the associations of attacks to descriptive SDOs according to past CTI feeds. Given an attack representation a ∈ A, we refer to the set of SDOs associated with a as the attack description AD a = {v|(a, v) ∈ E} ⊆ D.\n\nAssume an unknown ongoing attack a new , currently being investigated by the analyst. The analyst adds a new to the KG. According to a preliminary investigation, the analyst connects a new to descriptive SDOs, denoted as AD analyst anew (for example, see Figure 3). AD analyst anew may also be referred to as the initial hypothesis or an Indicator of Attack (IoA) [24].\n\nDefinition 2 (IoA Prediction Problem): Given a preliminary IoA AD analyst anew and a knowledge graph KG, generate a new IoA AD AHG anew that is more accurate than AD analyst anew with respect to the real attack a new .\n\nExample 1: Figure 2 presents a partial snapshot of the MITRE knowledge graph focusing on the BADNEWS malware (red), which is a backdoor that provides full control of the victim machine. This malware has been used by Patchwork Group (green) in their campaigns. The attack description of BADNEWS consists of 23 attack patterns. If BADNEWS has been activated in an organization, the analyst might detect some of its activity and infer some of the attack patterns. However, he may also falsely identify irrelevant attack patterns. Figure 3 illustrates a possible hypothesis by an analyst. In this case, the analyst has identified several attack patterns (purple). The patterns identified by the analyst are part of different stages of the attack (yellow). The objective of AHG is to recognize which attack patterns were missed by the analyst and which were falsely identified.\n\n\nB. Link Prediction in Knowledge Graphs\n\nGiven a snapshot of KG, Link Prediction (LP) techniques identify missing relationships within the graph that are likely to occur. LP can also be used to identify relationships that are likely to be incorrect within KG. We apply five techniques to predict the relationships between the SDO representing the new attack a new and the relevant descriptive SDOs. We rank each descriptive SDO d ∈ D, and select the top N to serve as the improved hypothesis.\n\nAccording to Definition 1, KG is a bipartite graph linking attacks to their descriptive SDOs. Following the common practice in recommender systems [25], in some of the following approaches, we rely on the one-mode projection of KG on either the attacks' set (A) or the set of descriptive SDOs (D).\n\nDefinition 3 (Attack similarity graph KG A ):\nKG A = A, E A , w A is a unipartite weighted graph, where (a i , a j ) ∈ E A if AD ai ∩ AD aj = ∅ and the edge weight w A (a i , a j )\nis the Jaccard coefficient of the respective attack descriptions:\nw A (a i , a j ) = ADa i ∩ADa j ADa i ∪ADa j\nWe define the weighted description similarity graph (KG D D, E D , w D ) symmetrically as the one-mode projection of KG on D.\n\n1) Projected Description (ProjD): We begin with the simplest approach that aggregates the link weights between the description provided by the analyst and each one of the descriptive SDOs d ∈ D. The relevance score P rojD of the descriptive SDOs is calculated as follows:\nP rojD d = d ∈AD analyst anew w D (d , d)(1)\n2) Link Prediction on Projected Description (LPProjD): Although, P rojD takes into account the similarity between descriptive SDOs in terms of the attacks associated with them, the topology of KG D is not considered there. Next, we utilize several common link prediction measures to improve P rojD by taking into account the neighborhoods of the descriptive SDOs suggested by the analyst. Given KG D , we apply known LP measures such as Jaccard Coefficient, Adamic Adar, and Friends Measure [26] on KG D . The likelihood of each description d ∈ D is calculated as follows:\nLP P rojD d = d ∈AD analyst anew lp KG D (d , d)(2)\n3) Projected Attack (ProjA): Equation 3 is used to rank each attack a ∈ A, and select the top k attacks, denoted as Similar to Equation 2, we use a range of LP measures to find the attacks most similar a new . The score of each descriptive SDO d ∈ D, is calculated as:\nA top . score a = lp KG A (a i , a new )(3)P rojA d = a∈Atop:a =anew∧d∈ADa score a(4)\nIn Section IV-C, we present the results obtained with the Jaccard Coefficient as the LP measure, since in preliminary experiments this method showed the best results.\n\n\n4) Collaborative Filtering (CF):\n\nIntuitively, the more an attack description is similar to AD analyst anew , the higher the attack descriptive SDOs will be ranked. In this approach, we rank the descriptive SDOs, d ∈ D, according to the Jaccard Coefficient between AD analyst anew and the attack descriptions that d belong to ({AD a |a ∈ A ∧ d ∈ AD a }) in KG. Equation 5 is used to calculate the likelihood score for each description d ∈ D.\nCF d = a∈Atop:a =anew∧d∈ADa Jaccard(AD a , AD anew ) (5)\nwhere a ∈ A top are k attacks which get the highest score when applying Jaccard(AD a , AD anew ).\n\n\n5) Supervised Link Prediction (SupLP):\n\nHere, we describe how to formulate LP as a supervised learning problem and apply machine learning models to predict the probability of a link in KG. First, we build a training set that consists of couples of nodes {(u, v)|u ∈ A∧v ∈ D}. Then, we extract the following features for each couple: (1) the nodes' topological attributes (e.g., degree, page rank, centrality, hubs and authorities [27] measures), (2) neighborhood-based metrics (e.g., Jaccard Coefficient, preferential attachment) and (3) distancebased measures (e.g., shortest path length, number of shortest paths). The extracted features are fed to a model, which learns to classify existing and not existing links in KG [28].\n\nWe want to estimate the extent to which there is a link between a new and d j ∈ D (1 ≤ j ≤ |D|) in KG. As in the model's training phase, we (1) extract the topological attributes and distance-based metrics of a new and d j from KG, and (2) use the projections KG A and KG D to obtain neighborhoodbased metrics for a new and d j , respectively. Finally, we feed the extracted features for all (a new , d j ) tuples (1 ≤ j ≤ |D|) to the trained model, and select the top N ranked descriptions to serve as the improved hypothesis.\n\nOn the one hand, building SupLP model requires a large number of examples in the learning phase. On the other hand, SupLP makes it possible to combine several features and be aware of wider contexts than the other four algorithms, that take into account only one feature.\n\nIn Section IV-C, we present the results for Random Forest classifier [29], since in preliminary experiments this model performed the best.\n\n\nC. Providing Actionable Items and Visualization for Analysts\n\nSTIX2.x ontology contains Course of Action (COA) SDO, which represents an action taken to either prevent an attack or respond to an attack. We mapped in KG the descriptive SDOs (D) to their related COA SDOs. Given a hypothesis consisting of top N descriptive SDOs, we filtered out the SDOs that were supplied by the analyst. We sort the COA SDOs in descending order according to the related SDOs' ranks given by the AHG and present the analyst the ordered list for further investigation and testing of the hypothesis.\n\nExample 2: Figure 4 shows a hypothesis generated by the CF algorithm on AD analyst BADN EW S (see Figure 3). Given only five attack patterns as an input, CF discovers 16 attack patterns out of 23 of BADNEWS' descriptive SDOs. CF falsely detected seven attack patterns. The related course of actions in KG for the top 5 discovered attack patterns are: 1) for remote file copy -check for unusual data transfer over known tools and protocols like FTP; 2) for web service and standard application layer protocol -analyze network data for uncommon data flows; 3) for system information discovery -monitor processes and command-line arguments for actions that could be taken to gather system and network information; 4) for code signing -collect and analyze signing certificate metadata.\n\nIn addition, the KG graph can be used to provide an overview of the threat landscape to the analyst. As defined in Section III-A, KG is a bipartite graph with relationships between the groups A and D. For a more comprehensive visualization of the graph, we recommend including internal edges representing various relationships within the groups A and D as well.\n\n\nIV. EVALUATION\n\nIn this section, we describe the evaluation data set, the AHG algorithms, the experimental setup, and results.\n\n\nA. ATT&CK Knowledge Graph\n\nATT&CK [10] presents a behavioral-based threat model for describing the actions an attacker may take to compromise and operate within an enterprise network. We used ATT&CK's knowledge base of adversarial tactics and techniques (available in STIX2.x format) to build KG. 4 We query KG through the Neo4j graph database. We build KG with the tool, intrusion set, malware, and attack pattern SDOs 5 as nodes, and add edges between nodes that are related in MITRE. See Table I for a summary of the SDOs in KG.\n\nB. Experiment Setup 1) Perturbed Knowledge Graph: In order to evaluate the algorithms for improving initial attack hypotheses perturb the knowledge graph simulating an IoA defined by an analyst. Every attack a ∈ A being evaluated is first removed from KG. Next, we select a set of descriptive SDOs as the preliminary description of a produced by the analyst. The analyst attempts to make the right decisions regarding the attack patterns and tools used by the attacker but makes mistakes due to lack of knowledge or insufficient forensic evidence. We evaluate the extent to which AHG can improve the preliminary hypotheses produced by an analyst for a wide range of possible errors made by the analyst. We will use AD a , AD analyst a , and AD AHG a to denote the ground truth, the analyst's, and the improved attack descriptions, respectively.\n\nFalse-positive rate (F P R) is the fraction of erroneous descriptive SDOs selected by the analyst out of the total number of descriptive SDOs irrelevant to the investigated attack a. The task of the AHG is to identify the wrongly omitted and wrongly added descriptive SDOs for each AD analyst a . Next, we discuss the performance indicators of AHG algorithms.\nF P R = AD analyst a \\ AD a D \\ AD a\n2) Evaluation Metrics: In the evaluation, we measure the gap between the original attack description AD a and the initial hypothesis AD analyst a and test whether AHG managed to decrease the gap and improve AD analyst a . Note that the proposed approaches described in Section III, rank all d ∈ D according to their likelihood to be associated with the attack similar to search results in a typical recommender system. Therefore, we use Average Precision (AP) and Mean Average Precision (MAP) [30], performance metrics commonly used to evaluate information retrieval algorithms, to evaluate the AHG approaches.\n\nGiven the original attack description AD a , the analyst's hypothesis AD analyst a and AHG's hypothesis AD AHG a , we compute the AP score for AD AHG a and AD analyst a by comparing each of the hypotheses to AD a .\n\nNext, we evaluate the improvement of AHG's hypothesis in comparison to the analyst's hypothesis by calculating the difference between the AP score of AD analyst a and the AP score of AD AHG a , i.e., we compute AP (AD a , AD AHG   3) Outline of the Experiment: In order to test the AHG algorithms, we use attacks associated with more than ten descriptive SDOs (A 10 ⊆ A). We consider attack descriptions with less than ten descriptive SDOs as degenerate descriptions with insufficient data to be used as the ground truth during evaluation. At the time of writing this article, ATT&CK KG contained 88 = |A 10 | attacks associated with more than ten attack patterns and tools.\n\nFor each evaluated attack a ∈ A 10 we generate 110 variants of AD analyst a corresponding to F P R ∈ {0.0, 0.01, 0.03, 0.05, 0.07, 0.1, 0.2, 0.5, 0.7, 1.0} and F N R ∈ {0.0, 0.1, 0.2, 0.3, 0.4, 0.5, 0.6, 0.7, 0.8, 0.9, 1.0}. SimAnalyst procedure (lines 12-18 in Algorithm 1) samples the KG given specific F P R and F N R values.\n\nEvery AD analyst a is analyzed using each one of the LP techniques alg ∈ {P rojD, LP P rojD, P rojA, CF, SupLP } presented in Section III. The CF algorithm was executed with k ∈ {5, 10, 15,|A|}. SupLP is the only approach which requires a training phase. It was trained on the KG with the test attack being removed. In both training and testing phases, we normalized the features according to the mean and variance of the train set.\n\nAlgorithm 1 describes a single iteration of the evaluation experiment. Given F P R, F N R, and alg, Algorithm 1 iterates over all attacks a ∈ A 10 and simulates an analyst's hypothesis AD analyst a as described in Section IV-B1 (line 4). For each attack, given the knowledge graph KG and the simulated analyst's hypothesis AD analyst a , alg generates a hypothesis AD AHG a (line 5). Next, we evaluate the performance of alg (lines 7-9). Finally, we return the mean averaged precision M AP and ∆M AP scores for each algorithm.  15: negatives ← random.sample(AD a ,|AD a | − F N ) 16: positives ← random.sample(D \\ AD a , F P )   to their importance for the Random Forest classifier. The most important features for this classifier are the prediction score given by the CF algorithm and the distance between the attack's SDO and the descriptive SDOs in KG. These two features are associated with the relationship between the attack and its descriptive SDOs, while the other features are associated with the descriptive SDOs themselves. Note that the features from the projected graphs (KG A , KG D ) were less relevant than features extracted from the original KG.\nF N ← |AD a | × F N R 14: F P ← F P R × (|D| −|AD a |)\nIn comparison to the other algorithms, SupLP 's computation time is longer due to the calculation of some features whose computation time is quadratic in the size of KG. The features that require the longest computing time are the number of shortest paths between an attack SDO to its descriptive SDOs and the Betweenness-centrality of nodes.\n\nCF shows the best results when considering the top 10 scored attacks (k = 10). The superiority of CF in the experiments indicates that (1) relying on similar attacks is a good approach for hypothesizing about new attacks, and (2) the Jaccard Coefficient between attack descriptions is a good measure for identifying similar attacks.\n\nWhen we project KG on A and apply link prediction, the more central an attack is, the higher the score it gets. This leads to hypotheses containing popular descriptive SDOs almost completely disregarding and analyst's input. Thus, P rojA shows a stable MAP of 0.5, even for random hypotheses. Since some of the attack patterns are very common, P rojA's performance is reasonably high. Figure 5 (bottom) shows the extent of the improvement, if any, achieved by AD AHG in comparison to AD analyst for each F P R and F N R. In every cell, we present the ∆M AP . Red indicates that AD AHG degraded the initial quality of AD analyst (∆M AP < 0), while green indicates that AD AHG improved over AD analyst (∆M AP > 0).\n\nNote that all algorithms but SupLP ruin the attack hypothesis when the analyst is very close to being a perfect oracle. On the one hand, when the analyst is absolutely right, confirming it is not an easy task. On the other hand, there is no point in relying on the analyst's input if his performance is not better than random. For high F N R and F P R values (the cells that appear in the darkest red in the analyst's heatmap in Figure 5), AP analyst is practically equivalent to the performance of a random algorithm, which achieved a M AP of 0.07.\n\nWe consider M AP analyst ≥ 0.3 as a reasonable performance of an analyst and evaluate the extent to which AHG algorithms can improve such hypotheses. Next, we ignore configurations with F N R and F P R for which M AP analyst < 0.3. Then, for each algorithm, we calculate the M AP score and average it over the remaining configurations. Figure 7 presents these results for the SupLP , CF (k = 10), LP P rojD and CF (k = |A|) algorithms which improved the simulated analyst's hypotheses. A random hypotheses generator is presented as a reference. The CF (k = |A|) algorithm improved the analyst's hypothesis by 0.03, the CF (k = 10) and LP P rojD algorithms improved the analyst's hypothesis by an average of 0.13, and the SupLP algorithm improved the analyst's hypothesis by 0.37 in terms of the average ∆M AP . The other algorithms did not improve the analyst's hypothesis for the designated configurations.\n\nFrom Figure 5 it can be concluded that, although SupLP algorithm shows better results for most reasonable scenarios, it is more error-prone and less effective in the early stages of the investigation (when there is not much information). In such cases it is better to start with the CF (k = 10) algorithm.\n\n\nV. CONCLUSIONS\n\nCybersecurity analysts are always looking for techniques that will improve their forensic investigation capabilities and abilities to reconstruct attacks' paths. Cyber Threat Intelligence (CTI) on similar attacks may help with attack reconstruction by providing a more in-depth understanding of the tools and attack patterns used by the attacker.\n\nIn this paper, we propose an approach toward an Attack Hypothesis Generator (AHG) that utilizes a knowledge graph (KG) derived from CTI (e.g., MITRE ATT&CK) to improve the analyst's hypotheses. To the best of our knowledge, the proposed approach is the first to focus on strategic CTI using recommender system techniques for attacks analysis and prediction. Specifically, we used supervised and unsupervised link prediction and collaborative filtering algorithms.\n\nIn order to evaluate the performance of the AHG algorithms, we simulated an analyst's hypotheses of various quality levels and compared them to the hypotheses generated by AHG. Experiments show that link prediction which is based on collaborative filtering and graph-based features (specifically, distance and topological features in KG) significantly increase the accuracy of the analyst's hypotheses, and may lead to a more effective investigation. We expect improvement in accuracy results as the size of KG increases and its quality grows. However, the proposed AHG algorithms achieved satisfying accuracy results even given small KG.\n\nFuture work should include adding features that are based on domain expert information, such as targeted OS, kill chain phases, and data sources, which may increase AHG's accuracy even more.\n\nFigure 1 .\n1Forensic investigation process using AHG Accumulated Cyber Threat Intelligence (CTI) can help the analyst with reasoning about the goals and methods of relevant attack actors[1] \n\nFigure 2 .\n2BADNEWS malware with its direct relationships to attack patterns (purple) and intrusion-set (green). Attack patterns are mapped to kill chain phases (yellow). The depicted attack patterns are considered as the ground truth attack description for BADNEWS.Course of Action (COA), Identity (ID), Indicator (IND), Observed Data (OD), Threat Actor (TA), Tool (T), and Vulnerability (VUL). SDOs can be organized in multiple levels of abstraction according to the PoP (see Section II-A).\n\nFigure 3 .\n3An analyst's hypothesis AD analyst BADN EW S for BADNEWS.\n\nFalse\n-negative rate (F N R) is the fraction of attack patterns and tools used by the attacker and erroneously omitted by the analyst.F N R = AD a \\ AD analyst a |AD a |Example 3: BADNEWS malware attack description (see Figure 2) consists of 23 attack patterns, i.e. |ADBADNEW S | = 23. The KG contains 270 attack patterns and tools, i.e. |D| = 270. Assuming F P R = 0.01 and F N R = 0.2 the analyst's hypothesis AD analyst BADN EW S will have 23 × 0.8 ≈ 18 correct descriptive SDOs and (270 − 23) · 0.01 ≈ 3 incorrect descriptive SDOs (see Figure 3).\n\n\na ) − AP (AD a , AD Analyst a ).\n\nFigure 4 .\n4The CF algorithm hypothesis AD CF BADN EW S on analyst hypothesis AD analyst BADN EW S .\n\nAlgorithm 1\n1EvaluateAlg Input: F P R, F N R, alg, KG Output: alg's average precision score and average precision improvement 1: procedure EVALUATEALG(F P R, F N R, alg, KG) AHG ← AP (AD a , AD AHG a ) / |A 10 | 8: M AP analyst ← AP (AD a , AD analyst a )/|A 10 | 9: ∆M AP ← M AP AHG − M AP analyst 10: return M AP AHG , ∆M AP 11: end procedure 12: procedure SIMANALYST(D, AD a , F P R, F N R) 13:\n\nFigure 5 (\n5top) presents the mean average precision score for each of the algorithms, clearly showing that SupLP achieves the best results. The features inFigure 6are listed according\n\nFigure 5 .\n5Mean average precision M AP (top) and mean average precision improvement ∆M AP (bottom) of the AHG approaches\n\nFigure 6 .Figure 7 .\n67SupLP's feature importance based on Random Forest evaluation Averaged average precision scores of AHG's algorithms compared to the analyst's hypothesis\n\nTable I NODE\nITYPES IN MITRE KNOWLEDGE GRAPHNode type \nNodes \nEdges \nAvg. degree \nDescription \nTool \n47 \n424 \n9.0 \nLegitimate software that can be used by threat actors. \nIntrusion set \n80 \n1231 \n15.3 \nA set of adversarial behaviors and resources with common properties. \nMalware \n237 \n2508 \n10.5 \nMalicious code or software. \nAttack pattern \n223 \n4826 \n21.6 \nWays threat actors attempt to compromise targets. \nCourse of Action \n222 \n222 \n1 \nAn action taken to either prevent an attack or respond to an attack. \n\n\nhttps://www.blueliv.com/blog/threat-intelligence/what-is-threatintelligence/2 The attacker may use anonymous proxy service like Tor in order to change the IP, while a file's hash is changed by flipping a bit in an unused resource or adding spaces.\nCKC was developed to model the diverse threat landscape. CKC describes seven steps that an attacker has to take in order to accomplish the goal of an attack.\nhttps://github.com/mitre/cti/blob/master/USAGE.md 5 Attack patterns imported from ATT&CK are in fact techniques according to STIXv1.0. These not be confused with the Common Attack Pattern Enumeration and Classification (CAPEC) which was also introduced by MITRE (https://capec.mitre.org/). There is only a partial mapping between ATT&CK's techniques and CAPEC's attack patterns.\n\nThreat intelligence: What it is, and how to use it effectively. M Bromiley, SANS Institute InfoSec Reading Room. 15M. Bromiley, \"Threat intelligence: What it is, and how to use it effectively,\" SANS Institute InfoSec Reading Room, vol. 15, 2016.\n\nCyber threat intelligence model: An evaluation of taxonomies, sharing standards, and ontologies within cyber threat intelligence. V Mavroeidis, S Bromander, Intelligence and Security Informatics Conference. IEEEV. Mavroeidis and S. Bromander, \"Cyber threat intelligence model: An evaluation of taxonomies, sharing standards, and ontologies within cyber threat intelligence,\" in Intelligence and Security Informatics Conference (EISIC), 2017 European, pp. 91-98, IEEE, 2017.\n\nDefinition: Threat intelligence. R Mcmillan, 29Citado naR. McMillan, \"Definition: Threat intelligence.[sl], 2013,\" Citado na, p. 29, 2013.\n\nA survey on technical threat intelligence in the age of sophisticated cyber attacks. W Tounsi, H Rais, Computers & security. 72W. Tounsi and H. Rais, \"A survey on technical threat intelligence in the age of sophisticated cyber attacks,\" Computers & security, vol. 72, pp. 212-233, 2018.\n\nD Bianco, The pyramid of pain. D. Bianco, \"The pyramid of pain (2014),\" URL http://detect-respond. blogspot. nl/2013/03/the-pyramid-of-pain. html, 2013.\n\nDefinitive Guide to Cyber Threat Intelligence: Using Knowledge about Adversaries to Win the War against Targeted Attacks. J Friedman, M Bouchard, CyberEdge GroupJ. Friedman and M. Bouchard, Definitive Guide to Cyber Threat Intel- ligence: Using Knowledge about Adversaries to Win the War against Targeted Attacks. CyberEdge Group, 2015.\n\nDeveloping an ontology of the cyber security domain. L Obrst, P Chase, R Markeloff, STIDS. L. Obrst, P. Chase, and R. Markeloff, \"Developing an ontology of the cyber security domain.,\" in STIDS, pp. 49-56, 2012.\n\nGraph-based visual analytics for cyber threat intelligence. F Böhm, F Menges, G Pernul, Cybersecurity. 1116F. Böhm, F. Menges, and G. Pernul, \"Graph-based visual analytics for cyber threat intelligence,\" Cybersecurity, vol. 1, no. 1, p. 16, 2018.\n\nMining attributed graphs for threat intelligence. H Gascon, B Grobauer, T Schreck, L Rist, D Arp, K Rieck, Proceedings of the Seventh ACM on Conference on Data and Application Security and Privacy. the Seventh ACM on Conference on Data and Application Security and PrivacyACMH. Gascon, B. Grobauer, T. Schreck, L. Rist, D. Arp, and K. Rieck, \"Mining attributed graphs for threat intelligence,\" in Proceedings of the Seventh ACM on Conference on Data and Application Security and Privacy, pp. 15-22, ACM, 2017.\n\nFinding cyber threats with att&ck-based analytics. B E Strom, J A Battaglia, M S Kemmerer, W Kupersanin, D P Miller, C Wampler, S M Whitley, R D Wolf, MTR170202tech. rep. Technical ReportB. E. Strom, J. A. Battaglia, M. S. Kemmerer, W. Kupersanin, D. P. Miller, C. Wampler, S. M. Whitley, and R. D. Wolf, \"Finding cy- ber threats with att&ck-based analytics,\" tech. rep., Technical Report MTR170202, MITRE, 2017.\n\nHolmes: real-time apt detection through correlation of suspicious information flows. S M Milajerdi, R Gjomemo, B Eshete, R Sekar, V Venkatakrishnan, arXiv:1810.01594arXiv preprintS. M. Milajerdi, R. Gjomemo, B. Eshete, R. Sekar, and V. Venkatakrish- nan, \"Holmes: real-time apt detection through correlation of suspicious information flows,\" arXiv preprint arXiv:1810.01594, 2018.\n\nTowards a framework to detect multi-stage advanced persistent threats attacks. P Bhatt, E T Yano, P Gustavsson, 2014 IEEE 8th International Symposium on Service Oriented System Engineering (SOSE). IEEEP. Bhatt, E. T. Yano, and P. Gustavsson, \"Towards a framework to detect multi-stage advanced persistent threats attacks,\" in 2014 IEEE 8th International Symposium on Service Oriented System Engineering (SOSE), pp. 390-395, IEEE, 2014.\n\nIntelligence-driven computer network defense informed by analysis of adversary campaigns and intrusion kill chains. E M Hutchins, M J Cloppert, R M Amin, Leading Issues in Information Warfare & Security Research. 1180E. M. Hutchins, M. J. Cloppert, and R. M. Amin, \"Intelligence-driven computer network defense informed by analysis of adversary campaigns and intrusion kill chains,\" Leading Issues in Information Warfare & Security Research, vol. 1, no. 1, p. 80, 2011.\n\nModeling and reconstruction of multistage attacks. S Rubinshtein, R Puzis, 2016 IEEE International Conference on Software Science, Technology and Engineering (SWSTE). S. Rubinshtein and R. Puzis, \"Modeling and reconstruction of multi- stage attacks,\" in 2016 IEEE International Conference on Software Science, Technology and Engineering (SWSTE), pp. 135-137, 2016.\n\nFrom product recommendation to cyber-attack prediction: Generating attack graphs and predicting future attacks. N Polatidis, E Pimenidis, M Pavlidis, S Papastergiou, H Mouratidis, Evolving Systems. N. Polatidis, E. Pimenidis, M. Pavlidis, S. Papastergiou, and H. Moura- tidis, \"From product recommendation to cyber-attack prediction: Gen- erating attack graphs and predicting future attacks,\" Evolving Systems, pp. 1-12, 2018.\n\nThe ontology of metrics for security evaluation and decision support in siem systems. I Kotenko, O Polubelova, I Saenko, E Doynikova, Availability, Reliability and Security (ARES), 2013 Eighth International Conference on. IEEEI. Kotenko, O. Polubelova, I. Saenko, and E. Doynikova, \"The ontology of metrics for security evaluation and decision support in siem systems,\" in Availability, Reliability and Security (ARES), 2013 Eighth Interna- tional Conference on, pp. 638-645, IEEE, 2013.\n\nA context-based detection framework for advanced persistent threats. P Giura, W Wang, Cyber Security (CyberSecurity), 2012 International Conference on. IEEEP. Giura and W. Wang, \"A context-based detection framework for advanced persistent threats,\" in Cyber Security (CyberSecurity), 2012 International Conference on, pp. 69-74, IEEE, 2012.\n\nOntology generation of advanced persistent threats and their automated analysis. Z Iqbal, Z Anwar, NUST Journal of Engineering Sciences. 92Z. Iqbal and Z. Anwar, \"Ontology generation of advanced persistent threats and their automated analysis,\" NUST Journal of Engineering Sciences, vol. 9, no. 2, pp. 68-75, 2016.\n\nMethods and techniques to identify security incidents using domain knowledge and contextual information. A Aleroud, G Karabatis, 2017 IFIP/IEEE Symposium on. IEEEIntegrated Network and Service Management (IMA. AlEroud and G. Karabatis, \"Methods and techniques to identify security incidents using domain knowledge and contextual information,\" in Integrated Network and Service Management (IM), 2017 IFIP/IEEE Symposium on, pp. 1040-1045, IEEE, 2017.\n\nManaging cyber threat intelligence in a graph database: Methods of analyzing intrusion sets, threat actors, and campaigns. S Lee, H Cho, N Kim, B Kim, J Park, 2018 International Conference on Platform Technology and Service (PlatCon). IEEES. Lee, H. Cho, N. Kim, B. Kim, and J. Park, \"Managing cyber threat intelligence in a graph database: Methods of analyzing intrusion sets, threat actors, and campaigns,\" in 2018 International Conference on Platform Technology and Service (PlatCon), pp. 1-6, IEEE, 2018.\n\nGraph mining-based trust evaluation mechanism with multidimensional features for largescale heterogeneous threat intelligence. Y Gao, X Li, J Li, Y Gao, N Guo, 2018 IEEE International Conference on Big Data (Big Data). IEEEY. Gao, X. Li, J. Li, Y. Gao, and N. Guo, \"Graph mining-based trust evaluation mechanism with multidimensional features for large- scale heterogeneous threat intelligence,\" in 2018 IEEE International Conference on Big Data (Big Data), pp. 1272-1277, IEEE, 2018.\n\nDatadriven analytics for cyber-threat intelligence and information sharing. S Qamar, Z Anwar, M A Rahman, E Al-Shaer, B.-T Chu, Computers & Security. 67S. Qamar, Z. Anwar, M. A. Rahman, E. Al-Shaer, and B.-T. Chu, \"Data- driven analytics for cyber-threat intelligence and information sharing,\" Computers & Security, vol. 67, pp. 35-58, 2017.\n\nLeveraging cyber threat intelligence for a dynamic risk framework. R Riesco, V Villagrá, International Journal of Information Security. R. Riesco and V. Villagrá, \"Leveraging cyber threat intelligence for a dynamic risk framework,\" International Journal of Information Security, pp. 1-25, 2019.\n\nIndicators of attack vs. indicators of compromise. J Decianno, CrowdStrikeJ. DeCianno, \"Indicators of attack vs. indicators of compromise,\" CrowdStrike, 2014.\n\nItembased collaborative filtering recommendation algorithms. B M Sarwar, G Karypis, J A Konstan, J Riedl, Www. 1B. M. Sarwar, G. Karypis, J. A. Konstan, J. Riedl, et al., \"Item- based collaborative filtering recommendation algorithms.,\" Www, vol. 1, pp. 285-295, 2001.\n\nComputationally efficient link prediction in a variety of social networks. M Fire, L Tenenboim-Chekina, R Puzis, O Lesser, L Rokach, Y Elovici, ACM Transactions on Intelligent Systems and Technology (TIST). 5110M. Fire, L. Tenenboim-Chekina, R. Puzis, O. Lesser, L. Rokach, and Y. Elovici, \"Computationally efficient link prediction in a variety of so- cial networks,\" ACM Transactions on Intelligent Systems and Technology (TIST), vol. 5, no. 1, p. 10, 2013.\n\nAuthoritative sources in a hyperlinked environment. J M Kleinberg, Journal of the ACM (JACM). 465J. M. Kleinberg, \"Authoritative sources in a hyperlinked environment,\" Journal of the ACM (JACM), vol. 46, no. 5, pp. 604-632, 1999.\n\nSupervised machine learning applied to link prediction in bipartite social networks. N Benchettara, R Kanawati, C Rouveirol, 2010 International Conference on Advances in Social Networks Analysis and Mining. IEEEN. Benchettara, R. Kanawati, and C. Rouveirol, \"Supervised machine learning applied to link prediction in bipartite social networks,\" in 2010 International Conference on Advances in Social Networks Analysis and Mining, pp. 326-330, IEEE, 2010.\n\nRandom forest modeling for network intrusion detection system. N Farnaaz, M Jabbar, Procedia Computer Science. 89N. Farnaaz and M. Jabbar, \"Random forest modeling for network intru- sion detection system,\" Procedia Computer Science, vol. 89, pp. 213- 217, 2016.\n\nMean Average Precision. L. LIU and M. T.ÖZSUSpringer USBoston, MAL. LIU and M. T.ÖZSU, eds., Mean Average Precision, pp. 1703-1703. Boston, MA: Springer US, 2009.\n", "annotations": {"author": "[{\"start\":\"32\",\"end\":\"262\"},{\"start\":\"263\",\"end\":\"464\"},{\"start\":\"465\",\"end\":\"690\"}]", "publisher": null, "author_last_name": "[{\"start\":\"38\",\"end\":\"45\"},{\"start\":\"268\",\"end\":\"273\"},{\"start\":\"472\",\"end\":\"481\"}]", "author_first_name": "[{\"start\":\"32\",\"end\":\"37\"},{\"start\":\"263\",\"end\":\"267\"},{\"start\":\"465\",\"end\":\"471\"}]", "author_affiliation": "[{\"start\":\"73\",\"end\":\"261\"},{\"start\":\"275\",\"end\":\"463\"},{\"start\":\"501\",\"end\":\"689\"}]", "title": "[{\"start\":\"1\",\"end\":\"29\"},{\"start\":\"691\",\"end\":\"719\"}]", "venue": null, "abstract": "[{\"start\":\"787\",\"end\":\"2209\"}]", "bib_ref": "[{\"start\":\"3536\",\"end\":\"3539\",\"attributes\":{\"ref_id\":\"b1\"}},{\"start\":\"5814\",\"end\":\"5817\",\"attributes\":{\"ref_id\":\"b2\"}},{\"start\":\"5931\",\"end\":\"5932\",\"attributes\":{\"ref_id\":\"b0\"}},{\"start\":\"6268\",\"end\":\"6271\",\"attributes\":{\"ref_id\":\"b3\"}},{\"start\":\"6529\",\"end\":\"6532\",\"attributes\":{\"ref_id\":\"b4\"}},{\"start\":\"6847\",\"end\":\"6848\",\"attributes\":{\"ref_id\":\"b1\"}},{\"start\":\"7188\",\"end\":\"7191\",\"attributes\":{\"ref_id\":\"b5\"}},{\"start\":\"7494\",\"end\":\"7497\",\"attributes\":{\"ref_id\":\"b6\"}},{\"start\":\"8221\",\"end\":\"8224\",\"attributes\":{\"ref_id\":\"b7\"}},{\"start\":\"8596\",\"end\":\"8599\",\"attributes\":{\"ref_id\":\"b8\"}},{\"start\":\"9279\",\"end\":\"9283\",\"attributes\":{\"ref_id\":\"b9\"}},{\"start\":\"9303\",\"end\":\"9307\",\"attributes\":{\"ref_id\":\"b10\"}},{\"start\":\"9509\",\"end\":\"9513\",\"attributes\":{\"ref_id\":\"b11\"}},{\"start\":\"9679\",\"end\":\"9683\",\"attributes\":{\"ref_id\":\"b12\"}},{\"start\":\"9685\",\"end\":\"9686\",\"attributes\":{\"ref_id\":\"b2\"}},{\"start\":\"9706\",\"end\":\"9710\",\"attributes\":{\"ref_id\":\"b13\"}},{\"start\":\"9809\",\"end\":\"9813\",\"attributes\":{\"ref_id\":\"b14\"}},{\"start\":\"10064\",\"end\":\"10068\",\"attributes\":{\"ref_id\":\"b15\"}},{\"start\":\"10399\",\"end\":\"10403\",\"attributes\":{\"ref_id\":\"b16\"}},{\"start\":\"10868\",\"end\":\"10872\",\"attributes\":{\"ref_id\":\"b17\"}},{\"start\":\"11196\",\"end\":\"11200\",\"attributes\":{\"ref_id\":\"b18\"}},{\"start\":\"11753\",\"end\":\"11757\",\"attributes\":{\"ref_id\":\"b19\"}},{\"start\":\"12019\",\"end\":\"12023\",\"attributes\":{\"ref_id\":\"b20\"}},{\"start\":\"12832\",\"end\":\"12836\",\"attributes\":{\"ref_id\":\"b21\"}},{\"start\":\"12861\",\"end\":\"12865\",\"attributes\":{\"ref_id\":\"b22\"}},{\"start\":\"15498\",\"end\":\"15502\",\"attributes\":{\"ref_id\":\"b23\"}},{\"start\":\"17240\",\"end\":\"17244\",\"attributes\":{\"ref_id\":\"b24\"}},{\"start\":\"18619\",\"end\":\"18623\",\"attributes\":{\"ref_id\":\"b25\"}},{\"start\":\"20306\",\"end\":\"20310\",\"attributes\":{\"ref_id\":\"b26\"}},{\"start\":\"20599\",\"end\":\"20603\",\"attributes\":{\"ref_id\":\"b27\"}},{\"start\":\"21477\",\"end\":\"21481\",\"attributes\":{\"ref_id\":\"b28\"}},{\"start\":\"23440\",\"end\":\"23444\",\"attributes\":{\"ref_id\":\"b9\"}},{\"start\":\"23703\",\"end\":\"23704\",\"attributes\":{\"ref_id\":\"b3\"}},{\"start\":\"25675\",\"end\":\"25679\",\"attributes\":{\"ref_id\":\"b29\"}},{\"start\":\"27978\",\"end\":\"27981\"},{\"start\":\"28030\",\"end\":\"28033\"},{\"start\":\"33676\",\"end\":\"33679\",\"attributes\":{\"ref_id\":\"b0\"}},{\"start\":\"36411\",\"end\":\"36412\",\"attributes\":{\"ref_id\":\"b1\"}}]", "figure": "[{\"start\":\"33489\",\"end\":\"33680\",\"attributes\":{\"id\":\"fig_0\"}},{\"start\":\"33681\",\"end\":\"34174\",\"attributes\":{\"id\":\"fig_1\"}},{\"start\":\"34175\",\"end\":\"34245\",\"attributes\":{\"id\":\"fig_2\"}},{\"start\":\"34246\",\"end\":\"34798\",\"attributes\":{\"id\":\"fig_3\"}},{\"start\":\"34799\",\"end\":\"34833\",\"attributes\":{\"id\":\"fig_4\"}},{\"start\":\"34834\",\"end\":\"34935\",\"attributes\":{\"id\":\"fig_5\"}},{\"start\":\"34936\",\"end\":\"35334\",\"attributes\":{\"id\":\"fig_6\"}},{\"start\":\"35335\",\"end\":\"35520\",\"attributes\":{\"id\":\"fig_8\"}},{\"start\":\"35521\",\"end\":\"35643\",\"attributes\":{\"id\":\"fig_9\"}},{\"start\":\"35644\",\"end\":\"35819\",\"attributes\":{\"id\":\"fig_10\"}},{\"start\":\"35820\",\"end\":\"36334\",\"attributes\":{\"id\":\"tab_0\",\"type\":\"table\"}}]", "paragraph": "[{\"start\":\"2228\",\"end\":\"3109\"},{\"start\":\"3111\",\"end\":\"3685\"},{\"start\":\"3687\",\"end\":\"4151\"},{\"start\":\"4153\",\"end\":\"4841\"},{\"start\":\"4843\",\"end\":\"5101\"},{\"start\":\"5135\",\"end\":\"5696\"},{\"start\":\"5730\",\"end\":\"6432\"},{\"start\":\"6434\",\"end\":\"6950\"},{\"start\":\"6952\",\"end\":\"7479\"},{\"start\":\"7481\",\"end\":\"8097\"},{\"start\":\"8099\",\"end\":\"8870\"},{\"start\":\"8922\",\"end\":\"9284\"},{\"start\":\"9286\",\"end\":\"9790\"},{\"start\":\"9792\",\"end\":\"10043\"},{\"start\":\"10045\",\"end\":\"10384\"},{\"start\":\"10386\",\"end\":\"11179\"},{\"start\":\"11181\",\"end\":\"11553\"},{\"start\":\"11597\",\"end\":\"11740\"},{\"start\":\"11742\",\"end\":\"12006\"},{\"start\":\"12008\",\"end\":\"12817\"},{\"start\":\"12819\",\"end\":\"13281\"},{\"start\":\"13309\",\"end\":\"13422\"},{\"start\":\"13448\",\"end\":\"13791\"},{\"start\":\"13793\",\"end\":\"14663\"},{\"start\":\"14665\",\"end\":\"15132\"},{\"start\":\"15134\",\"end\":\"15503\"},{\"start\":\"15505\",\"end\":\"15723\"},{\"start\":\"15725\",\"end\":\"16597\"},{\"start\":\"16640\",\"end\":\"17091\"},{\"start\":\"17093\",\"end\":\"17390\"},{\"start\":\"17392\",\"end\":\"17437\"},{\"start\":\"17573\",\"end\":\"17638\"},{\"start\":\"17684\",\"end\":\"17809\"},{\"start\":\"17811\",\"end\":\"18082\"},{\"start\":\"18128\",\"end\":\"18700\"},{\"start\":\"18753\",\"end\":\"19021\"},{\"start\":\"19108\",\"end\":\"19274\"},{\"start\":\"19311\",\"end\":\"19718\"},{\"start\":\"19776\",\"end\":\"19873\"},{\"start\":\"19916\",\"end\":\"20604\"},{\"start\":\"20606\",\"end\":\"21133\"},{\"start\":\"21135\",\"end\":\"21406\"},{\"start\":\"21408\",\"end\":\"21546\"},{\"start\":\"21611\",\"end\":\"22128\"},{\"start\":\"22130\",\"end\":\"22911\"},{\"start\":\"22913\",\"end\":\"23274\"},{\"start\":\"23293\",\"end\":\"23403\"},{\"start\":\"23433\",\"end\":\"23937\"},{\"start\":\"23939\",\"end\":\"24783\"},{\"start\":\"24785\",\"end\":\"25144\"},{\"start\":\"25182\",\"end\":\"25792\"},{\"start\":\"25794\",\"end\":\"26008\"},{\"start\":\"26010\",\"end\":\"26684\"},{\"start\":\"26686\",\"end\":\"27014\"},{\"start\":\"27016\",\"end\":\"27448\"},{\"start\":\"27450\",\"end\":\"28613\"},{\"start\":\"28669\",\"end\":\"29011\"},{\"start\":\"29013\",\"end\":\"29345\"},{\"start\":\"29347\",\"end\":\"30059\"},{\"start\":\"30061\",\"end\":\"30610\"},{\"start\":\"30612\",\"end\":\"31519\"},{\"start\":\"31521\",\"end\":\"31826\"},{\"start\":\"31845\",\"end\":\"32191\"},{\"start\":\"32193\",\"end\":\"32656\"},{\"start\":\"32658\",\"end\":\"33296\"},{\"start\":\"33298\",\"end\":\"33488\"}]", "formula": "[{\"start\":\"17438\",\"end\":\"17572\",\"attributes\":{\"id\":\"formula_0\"}},{\"start\":\"17639\",\"end\":\"17683\",\"attributes\":{\"id\":\"formula_1\"}},{\"start\":\"18083\",\"end\":\"18127\",\"attributes\":{\"id\":\"formula_2\"}},{\"start\":\"18701\",\"end\":\"18752\",\"attributes\":{\"id\":\"formula_3\"}},{\"start\":\"19022\",\"end\":\"19065\",\"attributes\":{\"id\":\"formula_4\"}},{\"start\":\"19065\",\"end\":\"19107\",\"attributes\":{\"id\":\"formula_5\"}},{\"start\":\"19719\",\"end\":\"19775\",\"attributes\":{\"id\":\"formula_6\"}},{\"start\":\"25145\",\"end\":\"25181\",\"attributes\":{\"id\":\"formula_7\"}},{\"start\":\"28614\",\"end\":\"28668\",\"attributes\":{\"id\":\"formula_8\"}}]", "table_ref": "[{\"start\":\"23897\",\"end\":\"23904\",\"attributes\":{\"ref_id\":\"tab_0\"}}]", "section_header": "[{\"start\":\"2211\",\"end\":\"2226\"},{\"start\":\"5104\",\"end\":\"5133\"},{\"start\":\"5699\",\"end\":\"5728\"},{\"start\":\"8873\",\"end\":\"8920\"},{\"start\":\"11556\",\"end\":\"11595\"},{\"start\":\"13284\",\"end\":\"13307\"},{\"start\":\"13425\",\"end\":\"13446\"},{\"start\":\"16600\",\"end\":\"16638\"},{\"start\":\"19277\",\"end\":\"19309\"},{\"start\":\"19876\",\"end\":\"19914\"},{\"start\":\"21549\",\"end\":\"21609\"},{\"start\":\"23277\",\"end\":\"23291\"},{\"start\":\"23406\",\"end\":\"23431\"},{\"start\":\"31829\",\"end\":\"31843\"},{\"start\":\"33490\",\"end\":\"33500\"},{\"start\":\"33682\",\"end\":\"33692\"},{\"start\":\"34176\",\"end\":\"34186\"},{\"start\":\"34247\",\"end\":\"34252\"},{\"start\":\"34835\",\"end\":\"34845\"},{\"start\":\"34937\",\"end\":\"34948\"},{\"start\":\"35336\",\"end\":\"35346\"},{\"start\":\"35522\",\"end\":\"35532\"},{\"start\":\"35645\",\"end\":\"35665\"},{\"start\":\"35821\",\"end\":\"35833\"}]", "table": "[{\"start\":\"35865\",\"end\":\"36334\"}]", "figure_caption": "[{\"start\":\"33502\",\"end\":\"33680\"},{\"start\":\"33694\",\"end\":\"34174\"},{\"start\":\"34188\",\"end\":\"34245\"},{\"start\":\"34253\",\"end\":\"34798\"},{\"start\":\"34801\",\"end\":\"34833\"},{\"start\":\"34847\",\"end\":\"34935\"},{\"start\":\"34950\",\"end\":\"35334\"},{\"start\":\"35348\",\"end\":\"35520\"},{\"start\":\"35534\",\"end\":\"35643\"},{\"start\":\"35668\",\"end\":\"35819\"},{\"start\":\"35835\",\"end\":\"35865\"}]", "figure_ref": "[{\"start\":\"2645\",\"end\":\"2653\",\"attributes\":{\"ref_id\":\"fig_0\"}},{\"start\":\"2817\",\"end\":\"2826\",\"attributes\":{\"ref_id\":\"fig_0\"}},{\"start\":\"3005\",\"end\":\"3014\",\"attributes\":{\"ref_id\":\"fig_0\"}},{\"start\":\"3301\",\"end\":\"3313\",\"attributes\":{\"ref_id\":\"fig_0\"}},{\"start\":\"3852\",\"end\":\"3864\",\"attributes\":{\"ref_id\":\"fig_0\"}},{\"start\":\"4136\",\"end\":\"4145\",\"attributes\":{\"ref_id\":\"fig_0\"}},{\"start\":\"13725\",\"end\":\"13733\",\"attributes\":{\"ref_id\":\"fig_0\"}},{\"start\":\"15389\",\"end\":\"15397\",\"attributes\":{\"ref_id\":\"fig_2\"}},{\"start\":\"15736\",\"end\":\"15744\",\"attributes\":{\"ref_id\":\"fig_1\"}},{\"start\":\"16252\",\"end\":\"16260\",\"attributes\":{\"ref_id\":\"fig_2\"}},{\"start\":\"22141\",\"end\":\"22149\",\"attributes\":{\"ref_id\":\"fig_5\"}},{\"start\":\"22228\",\"end\":\"22236\",\"attributes\":{\"ref_id\":\"fig_2\"}},{\"start\":\"29732\",\"end\":\"29740\",\"attributes\":{\"ref_id\":\"fig_8\"}},{\"start\":\"30490\",\"end\":\"30498\",\"attributes\":{\"ref_id\":\"fig_8\"}},{\"start\":\"30948\",\"end\":\"30956\"},{\"start\":\"31526\",\"end\":\"31534\",\"attributes\":{\"ref_id\":\"fig_8\"}}]", "bib_author_first_name": "[{\"start\":\"37185\",\"end\":\"37186\"},{\"start\":\"37498\",\"end\":\"37499\"},{\"start\":\"37512\",\"end\":\"37513\"},{\"start\":\"37876\",\"end\":\"37877\"},{\"start\":\"38068\",\"end\":\"38069\"},{\"start\":\"38078\",\"end\":\"38079\"},{\"start\":\"38271\",\"end\":\"38272\"},{\"start\":\"38547\",\"end\":\"38548\"},{\"start\":\"38559\",\"end\":\"38560\"},{\"start\":\"38816\",\"end\":\"38817\"},{\"start\":\"38825\",\"end\":\"38826\"},{\"start\":\"38834\",\"end\":\"38835\"},{\"start\":\"39036\",\"end\":\"39037\"},{\"start\":\"39044\",\"end\":\"39045\"},{\"start\":\"39054\",\"end\":\"39055\"},{\"start\":\"39274\",\"end\":\"39275\"},{\"start\":\"39284\",\"end\":\"39285\"},{\"start\":\"39296\",\"end\":\"39297\"},{\"start\":\"39307\",\"end\":\"39308\"},{\"start\":\"39315\",\"end\":\"39316\"},{\"start\":\"39322\",\"end\":\"39323\"},{\"start\":\"39786\",\"end\":\"39787\"},{\"start\":\"39788\",\"end\":\"39789\"},{\"start\":\"39797\",\"end\":\"39798\"},{\"start\":\"39799\",\"end\":\"39800\"},{\"start\":\"39812\",\"end\":\"39813\"},{\"start\":\"39814\",\"end\":\"39815\"},{\"start\":\"39826\",\"end\":\"39827\"},{\"start\":\"39840\",\"end\":\"39841\"},{\"start\":\"39842\",\"end\":\"39843\"},{\"start\":\"39852\",\"end\":\"39853\"},{\"start\":\"39863\",\"end\":\"39864\"},{\"start\":\"39865\",\"end\":\"39866\"},{\"start\":\"39876\",\"end\":\"39877\"},{\"start\":\"39878\",\"end\":\"39879\"},{\"start\":\"40234\",\"end\":\"40235\"},{\"start\":\"40236\",\"end\":\"40237\"},{\"start\":\"40249\",\"end\":\"40250\"},{\"start\":\"40260\",\"end\":\"40261\"},{\"start\":\"40270\",\"end\":\"40271\"},{\"start\":\"40279\",\"end\":\"40280\"},{\"start\":\"40610\",\"end\":\"40611\"},{\"start\":\"40619\",\"end\":\"40620\"},{\"start\":\"40621\",\"end\":\"40622\"},{\"start\":\"40629\",\"end\":\"40630\"},{\"start\":\"41084\",\"end\":\"41085\"},{\"start\":\"41086\",\"end\":\"41087\"},{\"start\":\"41098\",\"end\":\"41099\"},{\"start\":\"41100\",\"end\":\"41101\"},{\"start\":\"41112\",\"end\":\"41113\"},{\"start\":\"41114\",\"end\":\"41115\"},{\"start\":\"41490\",\"end\":\"41491\"},{\"start\":\"41505\",\"end\":\"41506\"},{\"start\":\"41917\",\"end\":\"41918\"},{\"start\":\"41930\",\"end\":\"41931\"},{\"start\":\"41943\",\"end\":\"41944\"},{\"start\":\"41955\",\"end\":\"41956\"},{\"start\":\"41971\",\"end\":\"41972\"},{\"start\":\"42319\",\"end\":\"42320\"},{\"start\":\"42330\",\"end\":\"42331\"},{\"start\":\"42344\",\"end\":\"42345\"},{\"start\":\"42354\",\"end\":\"42355\"},{\"start\":\"42791\",\"end\":\"42792\"},{\"start\":\"42800\",\"end\":\"42801\"},{\"start\":\"43145\",\"end\":\"43146\"},{\"start\":\"43154\",\"end\":\"43155\"},{\"start\":\"43485\",\"end\":\"43486\"},{\"start\":\"43496\",\"end\":\"43497\"},{\"start\":\"43954\",\"end\":\"43955\"},{\"start\":\"43961\",\"end\":\"43962\"},{\"start\":\"43968\",\"end\":\"43969\"},{\"start\":\"43975\",\"end\":\"43976\"},{\"start\":\"43982\",\"end\":\"43983\"},{\"start\":\"44468\",\"end\":\"44469\"},{\"start\":\"44475\",\"end\":\"44476\"},{\"start\":\"44481\",\"end\":\"44482\"},{\"start\":\"44487\",\"end\":\"44488\"},{\"start\":\"44494\",\"end\":\"44495\"},{\"start\":\"44903\",\"end\":\"44904\"},{\"start\":\"44912\",\"end\":\"44913\"},{\"start\":\"44921\",\"end\":\"44922\"},{\"start\":\"44923\",\"end\":\"44924\"},{\"start\":\"44933\",\"end\":\"44934\"},{\"start\":\"44945\",\"end\":\"44949\"},{\"start\":\"45237\",\"end\":\"45238\"},{\"start\":\"45247\",\"end\":\"45248\"},{\"start\":\"45517\",\"end\":\"45518\"},{\"start\":\"45687\",\"end\":\"45688\"},{\"start\":\"45689\",\"end\":\"45690\"},{\"start\":\"45699\",\"end\":\"45700\"},{\"start\":\"45710\",\"end\":\"45711\"},{\"start\":\"45712\",\"end\":\"45713\"},{\"start\":\"45723\",\"end\":\"45724\"},{\"start\":\"45971\",\"end\":\"45972\"},{\"start\":\"45979\",\"end\":\"45980\"},{\"start\":\"46000\",\"end\":\"46001\"},{\"start\":\"46009\",\"end\":\"46010\"},{\"start\":\"46019\",\"end\":\"46020\"},{\"start\":\"46029\",\"end\":\"46030\"},{\"start\":\"46409\",\"end\":\"46410\"},{\"start\":\"46411\",\"end\":\"46412\"},{\"start\":\"46673\",\"end\":\"46674\"},{\"start\":\"46688\",\"end\":\"46689\"},{\"start\":\"46700\",\"end\":\"46701\"},{\"start\":\"47107\",\"end\":\"47108\"},{\"start\":\"47118\",\"end\":\"47119\"}]", "bib_author_last_name": "[{\"start\":\"37187\",\"end\":\"37195\"},{\"start\":\"37500\",\"end\":\"37510\"},{\"start\":\"37514\",\"end\":\"37523\"},{\"start\":\"37878\",\"end\":\"37886\"},{\"start\":\"38070\",\"end\":\"38076\"},{\"start\":\"38080\",\"end\":\"38084\"},{\"start\":\"38273\",\"end\":\"38279\"},{\"start\":\"38549\",\"end\":\"38557\"},{\"start\":\"38561\",\"end\":\"38569\"},{\"start\":\"38818\",\"end\":\"38823\"},{\"start\":\"38827\",\"end\":\"38832\"},{\"start\":\"38836\",\"end\":\"38845\"},{\"start\":\"39038\",\"end\":\"39042\"},{\"start\":\"39046\",\"end\":\"39052\"},{\"start\":\"39056\",\"end\":\"39062\"},{\"start\":\"39276\",\"end\":\"39282\"},{\"start\":\"39286\",\"end\":\"39294\"},{\"start\":\"39298\",\"end\":\"39305\"},{\"start\":\"39309\",\"end\":\"39313\"},{\"start\":\"39317\",\"end\":\"39320\"},{\"start\":\"39324\",\"end\":\"39329\"},{\"start\":\"39790\",\"end\":\"39795\"},{\"start\":\"39801\",\"end\":\"39810\"},{\"start\":\"39816\",\"end\":\"39824\"},{\"start\":\"39828\",\"end\":\"39838\"},{\"start\":\"39844\",\"end\":\"39850\"},{\"start\":\"39854\",\"end\":\"39861\"},{\"start\":\"39867\",\"end\":\"39874\"},{\"start\":\"39880\",\"end\":\"39884\"},{\"start\":\"40238\",\"end\":\"40247\"},{\"start\":\"40251\",\"end\":\"40258\"},{\"start\":\"40262\",\"end\":\"40268\"},{\"start\":\"40272\",\"end\":\"40277\"},{\"start\":\"40281\",\"end\":\"40296\"},{\"start\":\"40612\",\"end\":\"40617\"},{\"start\":\"40623\",\"end\":\"40627\"},{\"start\":\"40631\",\"end\":\"40641\"},{\"start\":\"41088\",\"end\":\"41096\"},{\"start\":\"41102\",\"end\":\"41110\"},{\"start\":\"41116\",\"end\":\"41120\"},{\"start\":\"41492\",\"end\":\"41503\"},{\"start\":\"41507\",\"end\":\"41512\"},{\"start\":\"41919\",\"end\":\"41928\"},{\"start\":\"41932\",\"end\":\"41941\"},{\"start\":\"41945\",\"end\":\"41953\"},{\"start\":\"41957\",\"end\":\"41969\"},{\"start\":\"41973\",\"end\":\"41983\"},{\"start\":\"42321\",\"end\":\"42328\"},{\"start\":\"42332\",\"end\":\"42342\"},{\"start\":\"42346\",\"end\":\"42352\"},{\"start\":\"42356\",\"end\":\"42365\"},{\"start\":\"42793\",\"end\":\"42798\"},{\"start\":\"42802\",\"end\":\"42806\"},{\"start\":\"43147\",\"end\":\"43152\"},{\"start\":\"43156\",\"end\":\"43161\"},{\"start\":\"43487\",\"end\":\"43494\"},{\"start\":\"43498\",\"end\":\"43507\"},{\"start\":\"43956\",\"end\":\"43959\"},{\"start\":\"43963\",\"end\":\"43966\"},{\"start\":\"43970\",\"end\":\"43973\"},{\"start\":\"43977\",\"end\":\"43980\"},{\"start\":\"43984\",\"end\":\"43988\"},{\"start\":\"44470\",\"end\":\"44473\"},{\"start\":\"44477\",\"end\":\"44479\"},{\"start\":\"44483\",\"end\":\"44485\"},{\"start\":\"44489\",\"end\":\"44492\"},{\"start\":\"44496\",\"end\":\"44499\"},{\"start\":\"44905\",\"end\":\"44910\"},{\"start\":\"44914\",\"end\":\"44919\"},{\"start\":\"44925\",\"end\":\"44931\"},{\"start\":\"44935\",\"end\":\"44943\"},{\"start\":\"44950\",\"end\":\"44953\"},{\"start\":\"45239\",\"end\":\"45245\"},{\"start\":\"45249\",\"end\":\"45257\"},{\"start\":\"45519\",\"end\":\"45527\"},{\"start\":\"45691\",\"end\":\"45697\"},{\"start\":\"45701\",\"end\":\"45708\"},{\"start\":\"45714\",\"end\":\"45721\"},{\"start\":\"45725\",\"end\":\"45730\"},{\"start\":\"45973\",\"end\":\"45977\"},{\"start\":\"45981\",\"end\":\"45998\"},{\"start\":\"46002\",\"end\":\"46007\"},{\"start\":\"46011\",\"end\":\"46017\"},{\"start\":\"46021\",\"end\":\"46027\"},{\"start\":\"46031\",\"end\":\"46038\"},{\"start\":\"46413\",\"end\":\"46422\"},{\"start\":\"46675\",\"end\":\"46686\"},{\"start\":\"46690\",\"end\":\"46698\"},{\"start\":\"46702\",\"end\":\"46711\"},{\"start\":\"47109\",\"end\":\"47116\"},{\"start\":\"47120\",\"end\":\"47126\"}]", "bib_entry": "[{\"start\":\"37121\",\"end\":\"37366\",\"attributes\":{\"id\":\"b0\"}},{\"start\":\"37368\",\"end\":\"37841\",\"attributes\":{\"matched_paper_id\":\"2061843\",\"id\":\"b1\"}},{\"start\":\"37843\",\"end\":\"37981\",\"attributes\":{\"id\":\"b2\"}},{\"start\":\"37983\",\"end\":\"38269\",\"attributes\":{\"matched_paper_id\":\"44761484\",\"id\":\"b3\"}},{\"start\":\"38271\",\"end\":\"38423\",\"attributes\":{\"id\":\"b4\"}},{\"start\":\"38425\",\"end\":\"38761\",\"attributes\":{\"id\":\"b5\"}},{\"start\":\"38763\",\"end\":\"38974\",\"attributes\":{\"matched_paper_id\":\"36375\",\"id\":\"b6\"}},{\"start\":\"38976\",\"end\":\"39222\",\"attributes\":{\"matched_paper_id\":\"59279926\",\"id\":\"b7\"}},{\"start\":\"39224\",\"end\":\"39733\",\"attributes\":{\"matched_paper_id\":\"11864092\",\"id\":\"b8\"}},{\"start\":\"39735\",\"end\":\"40147\",\"attributes\":{\"matched_paper_id\":\"11053302\",\"id\":\"b9\",\"doi\":\"MTR170202\"}},{\"start\":\"40149\",\"end\":\"40529\",\"attributes\":{\"id\":\"b10\",\"doi\":\"arXiv:1810.01594\"}},{\"start\":\"40531\",\"end\":\"40966\",\"attributes\":{\"matched_paper_id\":\"11815578\",\"id\":\"b11\"}},{\"start\":\"40968\",\"end\":\"41437\",\"attributes\":{\"matched_paper_id\":\"6421896\",\"id\":\"b12\"}},{\"start\":\"41439\",\"end\":\"41803\",\"attributes\":{\"matched_paper_id\":\"16228247\",\"id\":\"b13\"}},{\"start\":\"41805\",\"end\":\"42231\",\"attributes\":{\"matched_paper_id\":\"13745657\",\"id\":\"b14\"}},{\"start\":\"42233\",\"end\":\"42720\",\"attributes\":{\"matched_paper_id\":\"18129684\",\"id\":\"b15\"}},{\"start\":\"42722\",\"end\":\"43062\",\"attributes\":{\"matched_paper_id\":\"10981496\",\"id\":\"b16\"}},{\"start\":\"43064\",\"end\":\"43378\",\"attributes\":{\"matched_paper_id\":\"67837386\",\"id\":\"b17\"}},{\"start\":\"43380\",\"end\":\"43829\",\"attributes\":{\"matched_paper_id\":\"5751609\",\"id\":\"b18\"}},{\"start\":\"43831\",\"end\":\"44339\",\"attributes\":{\"matched_paper_id\":\"52901764\",\"id\":\"b19\"}},{\"start\":\"44341\",\"end\":\"44825\",\"attributes\":{\"matched_paper_id\":\"59235635\",\"id\":\"b20\"}},{\"start\":\"44827\",\"end\":\"45168\",\"attributes\":{\"id\":\"b21\"}},{\"start\":\"45170\",\"end\":\"45464\",\"attributes\":{\"matched_paper_id\":\"102354010\",\"id\":\"b22\"}},{\"start\":\"45466\",\"end\":\"45624\",\"attributes\":{\"id\":\"b23\"}},{\"start\":\"45626\",\"end\":\"45894\",\"attributes\":{\"matched_paper_id\":\"8047550\",\"id\":\"b24\"}},{\"start\":\"45896\",\"end\":\"46355\",\"attributes\":{\"matched_paper_id\":\"18242216\",\"id\":\"b25\"}},{\"start\":\"46357\",\"end\":\"46586\",\"attributes\":{\"matched_paper_id\":\"216000619\",\"id\":\"b26\"}},{\"start\":\"46588\",\"end\":\"47042\",\"attributes\":{\"matched_paper_id\":\"16924216\",\"id\":\"b27\"}},{\"start\":\"47044\",\"end\":\"47305\",\"attributes\":{\"matched_paper_id\":\"63457797\",\"id\":\"b28\"}},{\"start\":\"47307\",\"end\":\"47469\",\"attributes\":{\"id\":\"b29\"}}]", "bib_title": "[{\"start\":\"37121\",\"end\":\"37183\"},{\"start\":\"37368\",\"end\":\"37496\"},{\"start\":\"37983\",\"end\":\"38066\"},{\"start\":\"38763\",\"end\":\"38814\"},{\"start\":\"38976\",\"end\":\"39034\"},{\"start\":\"39224\",\"end\":\"39272\"},{\"start\":\"39735\",\"end\":\"39784\"},{\"start\":\"40531\",\"end\":\"40608\"},{\"start\":\"40968\",\"end\":\"41082\"},{\"start\":\"41439\",\"end\":\"41488\"},{\"start\":\"41805\",\"end\":\"41915\"},{\"start\":\"42233\",\"end\":\"42317\"},{\"start\":\"42722\",\"end\":\"42789\"},{\"start\":\"43064\",\"end\":\"43143\"},{\"start\":\"43380\",\"end\":\"43483\"},{\"start\":\"43831\",\"end\":\"43952\"},{\"start\":\"44341\",\"end\":\"44466\"},{\"start\":\"44827\",\"end\":\"44901\"},{\"start\":\"45170\",\"end\":\"45235\"},{\"start\":\"45626\",\"end\":\"45685\"},{\"start\":\"45896\",\"end\":\"45969\"},{\"start\":\"46357\",\"end\":\"46407\"},{\"start\":\"46588\",\"end\":\"46671\"},{\"start\":\"47044\",\"end\":\"47105\"}]", "bib_author": "[{\"start\":\"37185\",\"end\":\"37197\"},{\"start\":\"37498\",\"end\":\"37512\"},{\"start\":\"37512\",\"end\":\"37525\"},{\"start\":\"37876\",\"end\":\"37888\"},{\"start\":\"38068\",\"end\":\"38078\"},{\"start\":\"38078\",\"end\":\"38086\"},{\"start\":\"38271\",\"end\":\"38281\"},{\"start\":\"38547\",\"end\":\"38559\"},{\"start\":\"38559\",\"end\":\"38571\"},{\"start\":\"38816\",\"end\":\"38825\"},{\"start\":\"38825\",\"end\":\"38834\"},{\"start\":\"38834\",\"end\":\"38847\"},{\"start\":\"39036\",\"end\":\"39044\"},{\"start\":\"39044\",\"end\":\"39054\"},{\"start\":\"39054\",\"end\":\"39064\"},{\"start\":\"39274\",\"end\":\"39284\"},{\"start\":\"39284\",\"end\":\"39296\"},{\"start\":\"39296\",\"end\":\"39307\"},{\"start\":\"39307\",\"end\":\"39315\"},{\"start\":\"39315\",\"end\":\"39322\"},{\"start\":\"39322\",\"end\":\"39331\"},{\"start\":\"39786\",\"end\":\"39797\"},{\"start\":\"39797\",\"end\":\"39812\"},{\"start\":\"39812\",\"end\":\"39826\"},{\"start\":\"39826\",\"end\":\"39840\"},{\"start\":\"39840\",\"end\":\"39852\"},{\"start\":\"39852\",\"end\":\"39863\"},{\"start\":\"39863\",\"end\":\"39876\"},{\"start\":\"39876\",\"end\":\"39886\"},{\"start\":\"40234\",\"end\":\"40249\"},{\"start\":\"40249\",\"end\":\"40260\"},{\"start\":\"40260\",\"end\":\"40270\"},{\"start\":\"40270\",\"end\":\"40279\"},{\"start\":\"40279\",\"end\":\"40298\"},{\"start\":\"40610\",\"end\":\"40619\"},{\"start\":\"40619\",\"end\":\"40629\"},{\"start\":\"40629\",\"end\":\"40643\"},{\"start\":\"41084\",\"end\":\"41098\"},{\"start\":\"41098\",\"end\":\"41112\"},{\"start\":\"41112\",\"end\":\"41122\"},{\"start\":\"41490\",\"end\":\"41505\"},{\"start\":\"41505\",\"end\":\"41514\"},{\"start\":\"41917\",\"end\":\"41930\"},{\"start\":\"41930\",\"end\":\"41943\"},{\"start\":\"41943\",\"end\":\"41955\"},{\"start\":\"41955\",\"end\":\"41971\"},{\"start\":\"41971\",\"end\":\"41985\"},{\"start\":\"42319\",\"end\":\"42330\"},{\"start\":\"42330\",\"end\":\"42344\"},{\"start\":\"42344\",\"end\":\"42354\"},{\"start\":\"42354\",\"end\":\"42367\"},{\"start\":\"42791\",\"end\":\"42800\"},{\"start\":\"42800\",\"end\":\"42808\"},{\"start\":\"43145\",\"end\":\"43154\"},{\"start\":\"43154\",\"end\":\"43163\"},{\"start\":\"43485\",\"end\":\"43496\"},{\"start\":\"43496\",\"end\":\"43509\"},{\"start\":\"43954\",\"end\":\"43961\"},{\"start\":\"43961\",\"end\":\"43968\"},{\"start\":\"43968\",\"end\":\"43975\"},{\"start\":\"43975\",\"end\":\"43982\"},{\"start\":\"43982\",\"end\":\"43990\"},{\"start\":\"44468\",\"end\":\"44475\"},{\"start\":\"44475\",\"end\":\"44481\"},{\"start\":\"44481\",\"end\":\"44487\"},{\"start\":\"44487\",\"end\":\"44494\"},{\"start\":\"44494\",\"end\":\"44501\"},{\"start\":\"44903\",\"end\":\"44912\"},{\"start\":\"44912\",\"end\":\"44921\"},{\"start\":\"44921\",\"end\":\"44933\"},{\"start\":\"44933\",\"end\":\"44945\"},{\"start\":\"44945\",\"end\":\"44955\"},{\"start\":\"45237\",\"end\":\"45247\"},{\"start\":\"45247\",\"end\":\"45259\"},{\"start\":\"45517\",\"end\":\"45529\"},{\"start\":\"45687\",\"end\":\"45699\"},{\"start\":\"45699\",\"end\":\"45710\"},{\"start\":\"45710\",\"end\":\"45723\"},{\"start\":\"45723\",\"end\":\"45732\"},{\"start\":\"45971\",\"end\":\"45979\"},{\"start\":\"45979\",\"end\":\"46000\"},{\"start\":\"46000\",\"end\":\"46009\"},{\"start\":\"46009\",\"end\":\"46019\"},{\"start\":\"46019\",\"end\":\"46029\"},{\"start\":\"46029\",\"end\":\"46040\"},{\"start\":\"46409\",\"end\":\"46424\"},{\"start\":\"46673\",\"end\":\"46688\"},{\"start\":\"46688\",\"end\":\"46700\"},{\"start\":\"46700\",\"end\":\"46713\"},{\"start\":\"47107\",\"end\":\"47118\"},{\"start\":\"47118\",\"end\":\"47128\"}]", "bib_venue": "[{\"start\":\"39422\",\"end\":\"39496\"},{\"start\":\"37197\",\"end\":\"37232\"},{\"start\":\"37525\",\"end\":\"37573\"},{\"start\":\"37843\",\"end\":\"37874\"},{\"start\":\"38086\",\"end\":\"38106\"},{\"start\":\"38281\",\"end\":\"38300\"},{\"start\":\"38425\",\"end\":\"38545\"},{\"start\":\"38847\",\"end\":\"38852\"},{\"start\":\"39064\",\"end\":\"39077\"},{\"start\":\"39331\",\"end\":\"39420\"},{\"start\":\"39895\",\"end\":\"39904\"},{\"start\":\"40149\",\"end\":\"40232\"},{\"start\":\"40643\",\"end\":\"40726\"},{\"start\":\"41122\",\"end\":\"41179\"},{\"start\":\"41514\",\"end\":\"41604\"},{\"start\":\"41985\",\"end\":\"42001\"},{\"start\":\"42367\",\"end\":\"42453\"},{\"start\":\"42808\",\"end\":\"42872\"},{\"start\":\"43163\",\"end\":\"43199\"},{\"start\":\"43509\",\"end\":\"43536\"},{\"start\":\"43990\",\"end\":\"44064\"},{\"start\":\"44501\",\"end\":\"44558\"},{\"start\":\"44955\",\"end\":\"44975\"},{\"start\":\"45259\",\"end\":\"45304\"},{\"start\":\"45466\",\"end\":\"45515\"},{\"start\":\"45732\",\"end\":\"45735\"},{\"start\":\"46040\",\"end\":\"46101\"},{\"start\":\"46424\",\"end\":\"46449\"},{\"start\":\"46713\",\"end\":\"46793\"},{\"start\":\"47128\",\"end\":\"47153\"},{\"start\":\"47307\",\"end\":\"47329\"}]"}}}, "year": 2023, "month": 12, "day": 17}