{"id": 219690516, "updated": "2023-03-11 21:33:56.334", "metadata": {"title": "3D Room Geometry Inference Using a Linear Loudspeaker Array and a Single Microphone", "authors": "[{\"first\":\"Cagdas\",\"last\":\"Tuna\",\"middle\":[]},{\"first\":\"Antonio\",\"last\":\"Canclini\",\"middle\":[]},{\"first\":\"Federico\",\"last\":\"Borra\",\"middle\":[]},{\"first\":\"Philipp\",\"last\":\"Götz\",\"middle\":[]},{\"first\":\"Fabio\",\"last\":\"Antonacci\",\"middle\":[]},{\"first\":\"Andreas\",\"last\":\"Walther\",\"middle\":[]},{\"first\":\"Augusto\",\"last\":\"Sarti\",\"middle\":[]},{\"first\":\"Emanuël\",\"last\":\"Habets\",\"middle\":[\"A.\",\"P.\"]}]", "venue": "IEEE/ACM Transactions on Audio, Speech, and Language Processing", "journal": "IEEE/ACM Transactions on Audio, Speech, and Language Processing", "publication_date": {"year": 2020, "month": null, "day": null}, "abstract": "Sound reproduction systems may highly benefit from detailed knowledge of the acoustic space to enhance the spatial sound experience. This article presents a room geometry inference method based on identification of reflective boundaries using a high-resolution direction-of-arrival map produced via room impulse responses (RIRs) measured with a linear loudspeaker array and a single microphone. Exploiting the sparse nature of the early part of the RIRs, Elastic Net regularization is applied to obtain a 2D polar-coordinate map, on which the direct path and early reflections appear as distinct peaks, described by their propagation distance and direction of arrival. Assuming a separable room geometry with four side-walls perpendicular to the floor and ceiling, and imposing pre-defined geometrical constraints on the walls, the 2D-map is segmented into six regions, each corresponding to a particular wall. The salient peaks within each region are selected as candidates for the first-order wall reflections, and a set of potential room geometries is formed by considering all possible combinations of the associated peaks. The room geometry is then inferred using a cost function evaluated on the higher-order reflections computed via beam tracing. The proposed method is tested with both simulated and measured data.", "fields_of_study": "[\"Computer Science\"]", "external_ids": {"arxiv": null, "mag": "3029684239", "acl": null, "pubmed": null, "pubmedcentral": null, "dblp": "journals/taslp/TunaCBGAWSH20", "doi": "10.1109/taslp.2020.2998299"}}, "content": {"source": {"pdf_hash": "2ca934ebb376aa3ae32e1b5d0a8784bd7cbdbba5", "pdf_src": "IEEE", "pdf_uri": null, "oa_url_match": false, "oa_info": {"license": null, "open_access_url": "https://ieeexplore.ieee.org/ielx7/6570655/8938144/09103061.pdf", "status": "BRONZE"}}, "grobid": {"id": "55aee1df51e92303c260b0c3703c5da31c69e4e4", "type": "plain-text", "url": "s3://ai2-s2-pdf-extraction-prod/parse-results/s2orc_worker/2ca934ebb376aa3ae32e1b5d0a8784bd7cbdbba5.txt", "contents": "\n3D Room Geometry Inference Using a Linear Loudspeaker Array and a Single Microphone\n\n\nCagdas Tuna \nAntonio Canclini \nFederico Borra \nPhilipp Götz \nMember, IEEEFabio Antonacci \nAndreas Walther \nSenior Member, IEEEAugusto Sarti \nSenior Member, IEEEEmanuël A P Habets \n3D Room Geometry Inference Using a Linear Loudspeaker Array and a Single Microphone\n\nIEEE/ACM TRANSACTIONS ON AUDIO, SPEECH, AND LANGUAGE PROCESSING\n28202010.1109/TASLP.2020.29982991729Index Terms-DOA estimationreflector localizationecho labelingroom geometry inference\nSound reproduction systems may highly benefit from detailed knowledge of the acoustic space to enhance the spatial sound experience. This article presents a room geometry inference method based on identification of reflective boundaries using a high-resolution direction-of-arrival map produced via room impulse responses (RIRs) measured with a linear loudspeaker array and a single microphone. Exploiting the sparse nature of the early part of the RIRs, Elastic Net regularization is applied to obtain a 2D polar-coordinate map, on which the direct path and early reflections appear as distinct peaks, described by their propagation distance and direction of arrival. Assuming a separable room geometry with four side-walls perpendicular to the floor and ceiling, and imposing pre-defined geometrical constraints on the walls, the 2D-map is segmented into six regions, each corresponding to a particular wall. The salient peaks within each region are selected as candidates for the first-order wall reflections, and a set of potential room geometries is formed by considering all possible combinations of the associated peaks. The room geometry is then inferred using a cost function evaluated on the higher-order reflections computed via beam tracing. The proposed method is tested with both simulated and measured data.\n\nI. INTRODUCTION\n\nI NFORMATION on the acoustic environment is of importance in advanced audio systems, improving the system performance and enabling new functionalities in applications. For instance, the knowledge of the room geometry can be used to increase robustness in sound source localization [1], [2], enhance the target signal in dereverberation [3], [4], and improve the spatial impression through room compensation in sound reproduction [5]. Room geometry inference (RGI) methods generally involve the localization of first-order reflections from the walls enclosing the room via the room impulse responses (RIRs) measured between different arrangements of loudspeakers and microphones. RIRs are processed to extract times of arrivals (TOAs) of the direct path and reflections, which are then used to estimate the locations and orientations of wall reflectors.\n\nReflector localization requires TOAs to be grouped into sets, each associated with a particular reflective boundary, which is known as TOA disambiguation or echo labeling in the literature [6], [7]. A class of reflector localization methods uses an ellipse-based formulation [8]- [14], where a reflector is identified by finding the common tangent to all the ellipses with the foci given by the pair of speaker-and microphone-positions traced from the corresponding TOAs. A 2D reflector localization algorithm to obtain the common tangent is proposed in [8], and its robustness to temperature variations is investigated in [9]. This approach is also adopted in [10] to blindly localize the walls in 2D using single-source multiple-receiver setups. In [11], the use of a compact microphone array guarantees that TOAs belonging to the same reflector in 2D are ordered consistently in different RIRs from the same array, except in some special cases. An extension to 3D environments is achieved in [12] by decomposing the 3D microphone array into 2D sub-arrays and in [13], [14] by using ellipsoids. In an alternative reflector localization method proposed in [15], the 3D room geometry is inferred from the knowledge of TOAs of first-order reflections obtained via the Euclidean distance matrix associated with a distributed microphone array. In [16], TOAs are acquired from an uncalibrated 3D setup by means of an auto-localization algorithm proposed in [17], and the room geometry is then estimated using a greedy iterative approach.\n\nAnother class of reflector localization techniques bypasses the need for TOA detection in each RIR by jointly processing the array measurements to generate polar time-domain TOA/DOA (direction-of-arrival) maps describing the evolution of planar reflections following the direct path over time, which emerge on these maps as distinct peaks [18]- [22]. In [18], the TOAspace maps are generated using plane-wave decomposition in frequency domain over RIRs measured with a circular array. In [19], [20], the superdirective array (SDA) beamformer [23] is applied to RIRs recorded with bi-circular arrays to obtain time-domain azimuth-DOA maps to be used for 3D reflector localization and classification. Exploiting the acoustic reciprocity principle [24], the Linear Radon Transform (LRT) is applied to the stack of RIRs measured with a linear loudspeaker array and a 2329-9290 © 2020 IEEE. Personal use is permitted, but republication/redistribution requires IEEE permission.\n\nSee https://www.ieee.org/publications/rights/index.html for more information.\n\nsingle microphone in [21] to generate similar maps for 2D TOA disambiguation.\n\nMost existing reflector localization methods require the use of a single omnidirectional speaker and a microphone array that has the same dimension as the case of interest (e.g., circular or planar arrays for 2D reflector localization and spherical arrays for the 3D case). If these techniques are implemented using setups with lower-dimensional arrays, they may fail to accurately localize reflectors and produce probable but incorrect estimates due to the geometrical ambiguity arising from the lack of a dimension in the array. There are few techniques in the literature circumventing this geometrical ambiguity introduced by the transducer array. In [25], a compact circular array is used for 3D RGI, and a l 1 -regularized least-squares fit is applied on the measured RIRs using an extensive set of acoustic reflections synthetically generated in 3D. In [14], [20], bi-circular microphone arrays are used for 3D reflection localization, and the up/down ambiguity is circumvented by assuming that the array positioning relative to the floor/ceiling is known a priori (e.g., floor is closer than the ceiling). As a follow-up to the LRT-based technique developed in [21], a measurement setup composed of a 2D rectangular loudspeaker array (with the intention to place it around a video screen) and an omnidirectional microphone is used in [22] for 3D RGI and the front/back ambiguity is avoided by assuming the loudspeaker array is placed close to one of the walls at a nearly-parallel position.\n\nIn this manuscript, we introduce a 3D RGI algorithm using a setup consisting only of a linear loudspeaker array and a single omnidirectional microphone. With the increasing use of soundbars in TV sets, 3D reflector localization with a linear loudspeaker array becomes more relevant to commercial applications. The performance of the sound reproduction system can significantly be improved if it is made aware of the surrounding environment (e.g., [26]), as some prior knowledge of the room geometry such as the floor-map and floor/ceiling height is key to sound rendering in achieving a pleasing immersive experience. However, to the best of our knowledge, 3D RGI with a linear array (1D configuration), where the spatial diversity is significantly reduced in two dimensions, is yet to be addressed in the literature. As the first attempt to combat this challenging situation, the main contributions of this work include: 1) a novel sparsity-constrained high-resolution 2D polarspace DOA mapping technique using RIRs recorded with a synchronized setup made up of a linear loudspeaker array and a single microphone, 2) a semisupervised approach tackling the geometrical ambiguity and identifying potential first-order reflection candidates through the segmentation of the DOA map into bounded regions, each associated with a wall, based on pre-defined constraints for wall dimensions and orientations, 3) room geometry inference based on a cost function measuring the match between the higher-order reflections estimated via beam tracing [27]- [29] and the actual reflections spotted on the DOA map. The proposed 3D RGI algorithm is validated with an extensive set of RIRs measured in rooms with different wall characteristics and reverberation times as well as a simulated replica of one of these rooms.\n\nThe remainder of the manuscript is organized as follows: Section II gives an overview of the proposed method. Section III provides the description of a separable room geometry. Section IV formulates the DOA-map estimation from RIR measurements, and explains the peak detection and pruning method. Section V details the segmentation of the DOA map into regions generated based on the geometric constraints imposed on the walls. Section VI explains how the inferred room geometry is determined via beam tracing from all possible room configurations. Section VII presents the performance evaluation of the proposed method with real and simulated data and Section VIII concludes the manuscript.\n\n\nII. METHOD OVERVIEW\n\nThe proposed 3D RGI algorithm using a linear loudspeaker array and a single microphone consists of three main steps, as outlined in Fig. 1.\n\nTo tackle the geometrical ambiguity arising from the limited spatial diversity of the linear array, a room of interest is assumed to have a separable geometry (i.e., side-walls are perpendicular to floor and ceiling and no discontinuity exists along the walls). In addition, the microphone is assumed to be in line of sight with the loudspeakers located in front of the array on the same horizontal plane, parallel to the floor.\n\nIn the first step of the proposed RGI algorithm, RIRs recorded synchronously between the linear loudspeaker array and single microphone (i.e., any initial delay in a given RIR is associated with the acoustic propagation path) are used to generate a DOA map, where the localization of the real-and imagemicrophones in 3D is achieved by their projection onto the 2D polar-coordinate space. One should expect the resulting DOA map to have a small number of discrete peaks resulting from the sparse nature of the early parts of RIRs containing only the direct path and distinct early reflections. A high-resolution map is thus obtained by formulating DOA estimation as a linear inverse problem and then solving it via Elastic Net regularization [30], [31], in which a penalty term composed of a weighted summation of LASSO and ridge-regression constraints is used in the optimization cost function. A standard 2D peak detection algorithm [21] followed by a peak pruning procedure is then utilized on the estimated DOA map to identify the salient peaks likely to be associated with the direct path and early reflections.\n\nIn the second step, the DOA map is segmented into multiple bounded regions, each corresponding to a wall, to determine the peak candidates that may potentially correspond to the first-order reflections. These bounded regions are generated based on a set of relaxed geometrical constraints imposed on the walls to restrict the search space for the reflecting boundary surfaces. In more detail, lower and upper bounds are pre-defined for the distances from the loudspeaker array to the walls along with an angular limit on the orientation of side-walls, allowing some degree of deviation from a shoe-box room model. Within each region, the most significant peaks are then selected as potential wall candidates. In the third step, all possible room geometries are obtained through a Cartesian product of the sets of wall candidates extracted from the six bounded regions that correspond to four side-walls, floor and ceiling. Finally, the room geometry described by its floor map and height is inferred by using a cost function that evaluates the agreement between the higher-order reflections estimated from the candidate first-order reflections via the beam-tracing method [27]- [29] and the peaks on the actual DOA map.\n\n\nIII. SEPARABLE ROOM GEOMETRY\n\n\nA. Room Description\n\nUnder the assumption of a separable room geometry, which is obtained by the Cartesian product of 2D and 1D environments (2D × 1D), a room of an unknown shape can be completely described by its floor map and height, having perfectly flat side-walls of equal height and all perpendicular to the floor and ceiling. The setup used in this manuscript is illustrated in Fig. 2. The inference of a 3D room geometry is achieved by estimating the parameter pair (v w , d w ), the normal vector and distance from the origin, for each of the six walls w = 1, . . . , 6 via RIRs measured from a linear array of loudspeakers located parallel to the floor and ceiling at the positions s l , ∀l ∈ {1, . . . , L} to an omnidirectional microphone located at r o . Without loss of generality, a reference system with the origin located at the array center and the x-axis aligned with the array is considered such that the lth array element is positioned at s l = [x s l , 0, 0] T . The microphone is positioned to be in front of the speaker array at the same height (i.e.,\nr o = [x o , y o , z o ] T , where y o > 0 and z o = 0).\nUnder the 2D × 1D geometry assumption, each side-wall may be described by the orientation angle ϕ w yielding the normal vector v w = [cos ϕ w , sin ϕ w , 0] T , and the distance d w (w = 1, . . . , 4), whereas the normal vectors are known a priori for floor and ceiling given by v 5 = [0, 0, 1] T and v 6 = [0, 0, −1] T such that only the corresponding distances d 5 and d 6 need to be estimated. Under the aforementioned assumptions, it readily follows that the room shape is determined by a total of 10 parameters (4 angles and 6 distances).\n\nA set of geometric constraints is imposed on the walls to limit the search space for the room geometry to be inferred. For side-walls, the search for the orientation angle is restricted into the range ϕ w ∈ [ϕ w − Δϕ w , ϕ w + Δϕ w ], where Δϕ w denotes the maximum allowed deviation from a shoe-box room model, in which the orientation angles ϕ w , w = 1, . . . , 4 are specified for four side-walls as ϕ 1 = π/2 (back wall), ϕ 2 = π (right wall), ϕ 3 = −π/2 (front wall) and ϕ 4 = 0 (left wall). This leads to the \narccos v w , vφ w ≤ Δϕ w ,(1)\nwhere vφ w refers to the normal vector of the wth wall in a shoebox room and ·, · denotes the inner product. For each of the six walls, the distance d w is bounded by pre-defined minimum and maximum values (w = 1, . . . , 6):\nd min w ≤ d w ≤ d max w .(2)\n\nB. Geometrical Ambiguity\n\nAssuming a linear array setup with the origin located at the array center and the x-axis aligned with the array, each point r in 3D-space may be projected onto the 2D polar-coordinate space with its polar coordinates given by the pair (ρ, θ):\nρ = r and θ = arccos r, u r ,(3)\nwhere ρ is the propagation distance, the angle θ ∈ [0 • , 180 • ] and u = [1, 0, 0] T is the unit vector in the direction of x axis. The mapping from r to the polar-coordinate space can be unequivocally determined, but the reverse is not true, since this is not an invertible operation. As illustrated in Fig. 3, the pair (ρ, θ) may represent any point on the circumference of a circle perpendicular to the xy-plane, centered at [ρ cos θ, 0, 0] T with the radius equal to ρ sin θ, indicating a circular symmetry for the linear array geometry when used in 3D setups. The geometrical ambiguity arising from the linear array setup is lessened under the assumption of a 2D × 1D separable room geometry. Side-walls generate image-microphone positions all lying on the same plane with the speaker array and measurement position (i.e., the xy-plane) such that the uncertainty reduces down to a \"front-back\" ambiguity, where it is still not possible to distinguish between the image-microphones occurring in the \"front\" (y > 0) or \"back\" (y < 0) of the speaker array. Floor and ceiling can be treated separately from side-walls because the first-order image-microphones (as well as higher-order reflections between floor and ceiling) should be then located in 1D space (i.e., the line parallel to the z-axis and passing from r o ), resulting in an \"up\" (z > 0) and \"down\" (z < 0) ambiguity for floor and ceiling.\n\nSince the measurement point is also assumed to be positioned in front of the speaker array at the same height, the Cartesian coordinates of r o are given by the corresponding the polarcoordinate pair (ρ o , θ o ):\nr o = ⎡ ⎢ ⎣ ρ o cos θ o ρ o sin θ o 0 ⎤ ⎥ ⎦ .(4)\nBased on geometrical acoustics and the reciprocity principle, the specular reflection from a wall described by the parameter pair (v, d) can be regarded as an acoustic path originated at the first-order image microphone position r o , which is obtained by mirroring r o :\nr o = (I − 2vv T )r o − 2dv.(5)\nGiven the r o and r o , the wall parameters may then be fully determined by using (5). The normal vector is given by\nv = r o − r o r o − r o ,(6)\nand the distance is computed via\nd = − 1 2 v T (r o + r o ).(7)\n1) Side-Walls: Due to the front-back ambiguity, a pair (ρ, θ) in polar-coordinate space representing a first-order side-wall reflection may be associated with two distinct positions in geometric space, which are given by\nr o,y − = ⎡ ⎢ ⎣ ρ cos θ −ρ sin θ 0 ⎤ ⎥ ⎦ and r o,y + = ⎡ ⎢ ⎣ ρ cos θ ρ sin θ 0 ⎤ ⎥ ⎦ ,(8)\nThus, the mapping between polar-coordinate space and side-wall parameters can be summarized as\n(ρ, θ) r o,y − ←→ (v y − , d y − ), (ρ, θ) r o,y + ←→ (v y + , d y + ),(9)\nwhere the wall-parameter pairs (v y − , d y − ) and (v y + , d y + ) are computed via (6) and (7).\n\n\n2) Floor and Ceiling:\n\nUnder the separable geometry assumption, the image-microphones corresponding to the firstorder floor and ceiling reflections share the same x-y coordinates with the measurement point r o with an up-down ambiguity. The two image-microphone positions are thus given by\nr o,z − = ⎡ ⎢ ⎣ ρ o cos θ o ρ o sin θ o − ρ 2 − ρ 2 o ⎤ ⎥ ⎦ and r o,z + = ⎡ ⎢ ⎣ ρ o cos θ o ρ o sin θ o ρ 2 − ρ 2 o ⎤ ⎥ ⎦ . (10)\nwhere the sign ambiguity is resolved, as r o,z − must correspond to a floor reflection and r o,z + to a ceiling reflection. Given the normal vectors, v 5 = [0, 0, 1] T and v 6 = [0, 0, −1] T for floor and ceiling, the distance parameters computed via (7) attain the same value for both r o,z − and r o,z + :\nd z = ρ 2 − ρ 2 o 2 .(11)\nThis results in the mapping between polar-coordinate space and floor/ceiling wall parameters as Fig. 4. DOA mapping based on RIRs recorded between a uniform loudspeaker array and a single microphone: The measured RIRs (illustrated here as a normalized and dB-scaled image of vertically stacked RIRs) are first translated into a 2D polar-coordinate DOA map (shown as a normalized and dB-scaled image) and the salient peaks that are likely to correspond to real-and image-microphones are then identified on the DOA map using a standard 2D peak detecting and pruning algorithm (peaks are colored in gray scale with respect to their magnitude).\n(ρ, θ) r o,z − ←→ (v 5 , d z ), (ρ, θ) r o,z + ←→ (v 6 , d z ).(12)\n\nIV. DOA MAPPING\n\nAn illustrative summary of the DOA-mapping procedure described in this section is given in Fig. 4. To combat the geometrical ambiguity resulting from the lack of spatial diversity and identify the locations and orientations of wall reflectors, RIRs recorded between the linear loudspeaker array and single microphone are first translated into a 2D polar-coordinate map, onto which real-and image-microphones in 3D are projected, emerging as distinct peaks described by their propagation distances and DOAs. A peak detection and pruning procedure is then applied to the estimated map to determine the significant peaks that are likely to correspond to real-and image-microphones.\n\n\nA. Forward Problem\n\nLet X(ρ, θ) be the unknown 2D discrete polar-coordinate map of size M × I, where the 2D-grid has a length of M along the ρ-axis and a length of I along the θ-axis. Using the acoustic reciprocity principle [24], a grid point located at (ρ m , θ i ) on the map corresponds to a 2D projection of a potential point source associated with a real-or image-microphone position in 3D. Assuming all acoustic devices are synchronized and taking into account all the points across the 2D-grid, the nth element of the discrete-time room impulse response vector h (l) ∈ R N of length N acquired between the speaker l in the linear array and the single microphone may be expressed as\nh (l) (n) = M −1 m=0 I−1 i=0 h (l) ρ m ,θ i (n) + b (l) (n),(13)\nwhere b (l) (n) is the nth element of the additive measurement noise vector b (l) ∈ R N . Considering a spherical wave propagation model, h (l) ρ m ,θ i (n) described by the contribution of a particular grid point located at (ρ m , θ i ) to h (l) (n) is given by\nh (l) ρ m ,θ i (n) ≈ X ρ m ,θ i δ(n − f s · d (l) ρ m ,θ i /c ) d (l) ρ m ,θ i ,(14)\nwhere d\n(l) ρ m ,θ i = [(ρ m cos θ i − x s l ) 2 + (ρ m sin θ i ) 2 ] 1/2 is the propagation distance from the point (ρ m , θ i ) to the speaker l with the corresponding time-of-flight d (l) ρ m ,θ i /c (c: the speed of sound), δ(n) is the discrete-time Dirac delta function, .\ndenotes the operator for rounding to the closest integer value and f s is the sampling frequency. The amplitude of the grid point denoted by X ρ m ,θ i only takes nonzero values if a real-or image-microphone is actually projected onto the point (ρ m , θ i ), representing a numerical indicator for a combination of potential acoustic phenomena including the level of absorption at a reflective surface, diffraction, and the microphone and loudspeaker directivity.\n\nThe rounding operation in (14) results in a mismatch between the actual time delay and sampled instance, and hence, may cause some noticeable distortion due to the high sensitivity to the relative phase between the speakers in the array. Furthermore, in practice, the measured RIRs rarely contain sharp peaks as a result of the factors including the type of excitation signal and equipment effects, etc. Alternatively, the Dirac delta function may be replaced by a function, which models these effects by \"smoothing\" the relation between the grid points on the map X(ρ, θ) and the discrete-time RIRs [32], [33]. Let g (l) ρ m ,θ i be a 1D smoothing function of length N sampled from a continuous-time function g(t) shifted by the actual time-delay d (l) ρ m ,θ i /c, whose nth element is given by\ng (l) ρ m ,θ i (n) = g(t − d (l) ρ m ,θ i /c) t= n fs , 0 ≤ n ≤ N − 1. (15)\nThe revised h (l) (n) can then be given by\nh (l) (n) = M −1 m=0 I−1 i=0 X ρ m ,θ i g (l) ρ m ,θ i (n) d (l) ρ m ,θ i + b (l) (n).(16)\nLet\nA (l) ρ m = [g (l) ρ m ,θ 0 /d (l) ρ m ,θ 0 , . . . , g (l) ρ m ,θ I−1 /d (l) ρ m ,θ I−1 ]\nbe the angular-grid matrix at the propagation distance ρ m for the lth array element and x ρ m = [X ρ m ,θ 0 , . . . X ρ m ,θ I−1 ] T be the amplitude vector across the DOAs at the propagation distance ρ m corresponding to the mth column of the 2D-map X(ρ, θ). Then, vertically concatenating the impulse responses from L speakers and reformulating them in the matrix form yields the additive signal-noise model for the linear inverse problem: ⎡\n⎢ ⎢ ⎣ h (1) . . . h (L) ⎤ ⎥ ⎥ ⎦ h = ⎡ ⎢ ⎢ ⎣ A (1) ρ 0 · · · A (1) ρ M −1 . . . . . . . . . A (L) ρ 0 · · · A (L) ρ M −1 ⎤ ⎥ ⎥ ⎦ A ⎡ ⎢ ⎢ ⎣ x ρ 0 . . . x ρ M −1 ⎤ ⎥ ⎥ ⎦ x + ⎡ ⎢ ⎢ ⎣ b (1) . . . b (L) ⎤ ⎥ ⎥ ⎦ b ,(17)\nwhere A ∈ R L·N ×M ·I is the concatenated steering matrix, the vector x ∈ R M ·I corresponds to the polar-coordinate map X(ρ, θ) in the vectorized form, and h ∈ R L·N and b ∈ R L·N are the vertically-concatenated impulse-response and additive measurement-noise vectors, respectively.\n\n\nB. Map Estimation\n\nThe early parts of the measured RIRs consist of the direct path and acoustic reflections from the room surfaces, which in turn should appear on the DOA map as a relatively small number of distinct peaks, prompting the use of sparse signal estimation techniques. The Elastic Net regularization is considered here, with its estimate given by [30], [31] x = argmin\nx≥0 1 2 ||h − Ax|| 2 2 + λ β||x|| 1 + (1 − β) 2 ||x|| 2 2 ,(18)\nwhere λ > 0 is the regularization parameter for the Elastic Net penalty, which is composed of a weighted summation of l 1 -norm (LASSO) and l 2 -norm (ridge regression) constraints controlled by the weighting parameter 0 ≤ β ≤ 1. A non-negativity constraint is additionally imposed on x, taking only the interactions between the air and hard surfaces into account. As a result of the design of the matrix A ∈ R L·N ×M ·I using a smoothing function in (15), the grid points neighboring a peak on the DOA map should be highly correlated, generating a locally-smooth region in the proximity of the peak. However, one of the known limitations of using only a LASSO penalty is that in underdetermined systems (i.e., L · N < M · I), LASSO may only select one variable from a group of highly correlated variables and discard the rest, which may be prevented by including an additional quadratic penalty term in the optimization problem [31]. Therefore, the Elastic Net regularization can achieve a desired level of sparsity while simultaneously selecting the grouped variables by jointly imposing the LASSO and ridge-regression penalties [30], [31]. The Elastic Net may be solved as a LASSO problem using an augmented forward model as follows [31]:\nh = h 0 andÃ = A λ · (1 − β) I .(19)\nRewriting (18) yields the LASSO estimatê\nx = argmin x≥0 1 2 ||h −Ãx|| 2 2 + (λ · β)||x|| 1 .(20)\nThe coordinate descent algorithm is used here to obtain the LASSO solution, during whichx is updated cyclically at each iteration [34]. Exploiting the sparse nature of the measurement matrixÃ, the LASSO estimate may be computed efficiently, since the coordinate descent solution does not require any matrix inversion. Initializing the algorithm withx (−1) = 0, the cyclic update at iteration k ≥ 0 is achieved by minimizing only over x(η), the ηth element of x, while keeping all x(ψ), ψ = η fixed, and the non-negativity constraint is satisfied by zeroing any negative estimate occurred after an update. This leads to a one-sided soft-thresholding operation, which may be expressed asx\n(η) = (ã T ηrη − (λ · β))/||ã η || 2 2 ifã T ηrη > (λ · β) 0 otherwise ,(21)\nwhere the residual vector is given byr η =h − ψ =ηx (ψ)ã ψ , andã η andã ψ denote the ηth and ψth (ψ = η) columns of A, respectively. The coordinate descent algorithm is stopped when the relative error at iteration k reaches below a pre-defined threshold:\n(k) < τ, where (k) = ||x (k) −x (k−1) || 1 ||x (k−1) || 1 .(22)\n\nC. Peak Detection and Pruning\n\nThe salient peaks on the DOA map X(ρ, θ) are detected based on a standard 2D peak-picking algorithm to extract the local maxima from an image representation of a 2D function (c.f., [21]). To reduce the set of all detected peaks into a subset of the most significant peaks that are more likely to be associated with actual real-and image-microphones, a pruning procedure is additionally applied, during which all secondary peaks in the neighborhood of more significant ones are discarded in an iterative fashion.\n\nLet Q 0 be the set of all extracted peaks, which are then sorted in descending order with respect to the magnitude and The DOA map is segmented into six regions, each corresponding to a wall, based on the pre-defined constraints on the wall dimensions and orientations, followed by the selection of peaks inside each region that are potential first-order reflection candidates. The room geometry is inferred by using a cost function evaluating the agreement between the higher-order image-microphones estimated from the candidate first-order reflections via beam tracing and the peaks on the actual DOA map. Q −1 = ∅ be the set of most significant peaks, which is empty at initialization. At iteration k ≥ 0, all the peaks within the neighborhood of the first element of the set Q k denoted by q k = (ρ k , θ k ) are pruned:\nQ k+1 = Q k \\ N (q k ),(23)\nwhere N (q k ) is the rectangular neighborhood of q k , whose size is specified by the thresholds |ρ − ρ k | ≤ T ρ and |θ − θ k | ≤ T θ . Then, q k is added to the set of most significant peaks:\nQ k = Q k−1 ∪ q k .(24)\nThis procedure is repeated until Q k+1 = ∅. The set of the most significant peaks is finally obtained as\nQ = {q 0 , q 1 , . . .} .(25)\nV. MAP SEGMENTATION Fig. 5 shows an example of the generation of bounded regions using the geometric constraints defined in (1) and (2), each corresponding to either a side-wall or floor/ceiling, followed by the selection of the peaks inside each region as candidates for first-order reflections. Such a map-segmentation procedure involves the remapping of the salient peaks given by their propagation-path distance and DOA-angle in the 2D polarcoordinate space back onto the 3D geometric space to identify the real-and image-microphone positions corresponding to the direct path and first-order wall reflections for room geometry inference.\n\n\nA. Direct Path Estimation\n\nAssuming that the measurement point r o is in line of sight with all array elements, s l , ∀l ∈ {1, . . . , L}, the first arrival corresponding to the direct path should generally emerge on the DOA map as the peak with the highest magnitude. However, in some cases, there may also be peaks with amplitudes higher than the direct path as a result of compensating for the propagationdistance attenuation based on the spherical-wave propagation model. Taking a practical approach, the peak corresponding to the direct path is searched among the ten largest peaks in Q and the first arrival among them is estimated as the peak corresponding to the direct path, which is labelled as the pair (ρ o , θ o ).\n\n\nB. Generation of Bounded Regions\n\n1) Side-Walls: A pair (ρ, θ) becomes a valid candidate for the wth side-wall provided that the conditions described by (1) and (2) are satisfied by (v y + , d y + ) and/or (v y − , d y − ) given in (9). The set of all valid pairs (ρ, θ) then forms two bounded regions M (w) y ± on the DOA map for the side-walls w = 1, . . . , 4, which may be formally defined as\nM (w) y ± = (ρ, θ) : arccos v y ± , vᾱ w ≤ Δϕ w d min w ≤ d y ± ≤ d max w .(26)\nCombining the two regions M (w) y ± results in the unified region\nM (w) = M (w) y − ∪ M (w)\ny + for each side-wall.\n\n2) Floor and Ceiling: Varying the distance paramater d z given in (11) from d min w to d max w translates into a curve segment in polar-coordinate space described by\nρ 2 o + (2d min w ) 2 ρ min w ≤ ρ ≤ ρ 2 o + (2d max w ) 2 ρ max w(27)\nand\nθ(ρ) = arccos ρ o cos θ o ρ ,(28)\nyielding the bounded regions M (w) (w = 5, 6) on the DOA map containing the first-order floor and ceiling reflections:\nM (w) = (ρ, θ) : ρ min w ≤ ρ ≤ ρ max w θ(ρ) − ξ θ ≤ θ ≤ θ(ρ) + ξ θ ,(29)\nwhere a small tolerance ξ θ is introduced on the angle θ(ρ) to convert each M (w) from a curve segment to a narrow-width region.\n\n\nC. Candidates for First-Order Reflections\n\nThe set of candidate peaks within the bounded region M (w) corresponding to the wth wall is determined by intersecting M (w) with the set Q K , which only includes the K largest peaks from Q:\nQ (w) = M (w) ∩ Q K .(30)\nIf still Q (w) = ∅, then the search for a peak among the remaining elements of Q is continued until Q (w) has at least one element.\n\nIf the cardinality of Q (w) is greater than a pre-specified number K, then only the first K elements are kept in Q (w) and the rest are discarded to avoid an exhaustive search.\n\nTo account for the geometrical ambiguity introduced by the linear array, Q (w) is subdivided back into two subsets as Q (w)\ny ± = Q (w) ∩ M (w)\ny ± for the side-walls (w = 1, . . . , 4). Given the realmicrophone position r o , each pair (ρ, θ) in Q (w) y ± are translated into their corresponding wall parameters (v (w)\ny ± , d (w) y ± ) using (3),(6)\nand (7) and stored in a unified wall-parameter set denoted by P (w) . For floor and ceiling (w = 5, 6), the wall-parameter sets P (w) are obtained directly from the peak set Q (w) .\n\n\nVI. ROOM GEOMETRY INFERENCE\n\n\nA. Room Geometry Candidates\n\nConsidering all possible combinations of individual wall parameters, the room geometry candidates are obtained via the Cartesian product as G = P (1) × P (2) × · · · × P (6)\n= {G 1 , G 2 , . . . , G J } ,(31)\nwhere J = |G| is the total number of candidate room geometries and the jth candidate described by the parameters (v w,j , d w,j ) for each wall is given by\nG j = {(v 1,j , d 1,j ) ; . . . ; (v 6,j , d 6,j )} .(32)\nConsidering the z = 0 plane, on which the real-and imagemicrophones lie, side-walls can be represented by the lines of equation a w,j x + b w,j y + c w,j = 0, corresponding to the homogeneous vector [35] \nl w,j = ⎡ ⎣ a w,j b w,j c w,j ⎤ ⎦ = ⎡ ⎣ [v w,j ] 1 [v w,j ] 2 d w,j ⎤ ⎦ ,(33)\nwhere [v] k denotes the kth component of the vector v. The 2D Cartesian coordinates p 1,j , . . . p 4,j of the four corners are computed by intersecting the pairs of lines 1 (l 1,j , l 2,j ), (l 2,j , l 3,j ), (l 3,j , l 4,j ) and (l 4,j , l 1,j ). The floor map is then described by the set of line segments\nF j = {p 1,j p 2,j , p 2,j p 3,j , p 3,j p 4,j , p 4,j p 1,j }.(34)\nThe candidate room height is simply given by\nH j = d 5,j + d 6,j .(35)\nArising from the up-down ambiguity, the projection of the set of higher-order image-microphone positions of two candidates j and j onto the DOA map would be the same if d 5,j = d 6,j and d 6,j = d 5,j , which may result in an \"upside-down\" inferred room geometry. Therefore, the linear loudspeaker array and single microphone are always assumed to be positioned closer to the floor, meaning that any given candidate G j with d 5,j > d 6,j is discarded from the candidate set G to tackle the up-down ambiguity.\n\nTo prevent unrealistically low estimates for the room height particularly in real-world scenarios with noisy measurements, a minimum room height level is also introduced as an additional constraint such that when H j < H min for a candidate G j , it is also omitted from G. If no candidate is left in G satisfying the minimum height constraint, then the search among the remaining elements of Q is continued until at least a peak-pair for floor and ceiling satisfies H min .\n\n\nB. Beam Tracing and Cost Function\n\nIn the final step, a candidate from the set G is selected as the inferred room geometry, comparing the estimated higher-order reflections with the actual peaks on the DOA map remaining after the exclusion of the peak-set corresponding to first-order reflections. In more detail, for each room geometry candidate, the higher-order image-microphone positions are first estimated via the beam-tracing method described in [27]- [29] from the 1 Given a pair of lines l 1 = [a 1 , b 1 , c 1 ] T and l 2 = [a 2 , b 2 , c 2 ] T , their intersection is computed in homogeneous coordinates as the cross product l 1 × l 2 [35]. It is easy to verify that the corresponding Cartesian coordinates are given by candidate first-order reflections, and then projected onto the 2D polar-coordinate space as illustrated in the rightmost column of Fig. 5. Subsequently, a cost function is computed by summing the amplitudes of grid points on the DOA map corresponding to the estimated higher-order image-microphone positions. Finally, the candidate that achieves the highest score among all the others is determined as the inferred room geometry. 1) Beam Tracing: For a source-receiver pair along with a set of line segments describing a 2D acoustic environment, beam tracing [28] enables the computation of all image-microphone positions that are visible from the source using the image method [36] up to a predetermined order of reflections, in which the visibility from the sources is evaluated by tracing the beam splitting/branching process resulting from multiple reflections on the line segments. The concept of visibility is exemplified in Fig. 6(a), where the region of visibility of an image-microphone at r o through the segment p 1 p 2 corresponds to a beam (gray-shaded region), and the image microphone is visible from the source at s 1 but not from s 2 . As discussed in [28], [29], the beam-tracing method originally developed for planar (2D) geometries can be easily extended to 2D × 1D geometry. This is accomplished by mirroring the set of the resulting coplanar image-microphones with respect to the planes corresponding to floor and ceiling, and repeating this procedure until reaching the maximum reflection order.\np = (x, y) = b 1 c 2 − b 2 c 1 a 1 b 2 − a 2 b 1 , a 2 c 1 − a 1 c 2 a 1 b 2 − a 2 b 1 .\nTo estimate the higher-order propagation paths for the roomgeometry candidate j, the beam-tracing process may be defined in the form of a function as H j , s, r o , κ) , (36) which yields the output set I j containing the 3D Cartesian coordinates of all image-microphones visible from the array center s = [0, 0, 0] T given the real microphone position r o and the maximum order of reflections of interest, denoted by κ. An illustration of the beam-tracing output up to the 3rd-order image-microphones is depicted in Fig. 6(b) for a room with a trapezoidal floor map.\nI j = B (F j ,\n\n2) Cost Function:\n\nTo evaluate the agreement between the higher-order reflections estimated via beam tracing and the actual peaks on the DOA map for the room-geometry candidate j, a cost function is defined as\nΨ(I j ) = (ρ j ,θ j )∈I j max |ρ−ρ j |<τ ρ |θ−θ j |<τ θ X ρ,θ , j ∈ {1, 2, . . . , J},(37)\nwhereI j is the set of image-microphone positions given in the polar-coordinate space, obtained by applying (3) to the elements of I j , and the thresholds τ ρ and τ θ describe a rectangular region on the DOA map centered at each position (ρ j , θ j ) ∈ I j , within which the local maximum is then determined.\n\nThe candidate that attains the highest score is selected as the final estimate:ĵ = arg max j Ψ(I j ), (38) and the room geometry is then inferred from the set of wall parameters Gĵ.\n\n\nVII. PERFORMANCE EVALUATION\n\n\nA. Experiments\n\nThe proposed method was tested in three real rooms (two configurations in a small office, a laboratory room and a lecture hall) as illustrated with top-and side-views in Fig. 7. The measurement setup consisted of a 13-element uniform linear array of 2-inch full-range drivers spaced apart by 6 cm and an omni-directional microphone of type Microtech Gefell M373. The loudspeaker array was positioned close and parallel to the back-wall as a typical office/home layout and the microphone was placed in front of it at a total of nine positions according to an equally-spaced 3 × 3 grid. The individual transmission paths between each loudspeaker in the array and the microphone were measured using a logarithmic sweep with a time-length of 5 s starting at 150 Hz and reaching its end at 20 kHz, and RIRs were obtained using a standard deconvolution scheme. A loopback measurement was used to free the measurements from the hardware latency of the system such that any initial delay in RIRs was associated with the acoustic propagation of the direct path. Additionally, the reverberation times were measured in all three rooms according to the ISO standard [37]. The sampling frequency was 48 kHz, and the air temperature was set to 20 • C corresponding to a speed of sound of approximately 343 m/s. \n\n\n1) Small Office:\n\nAs depicted in Figs. 7(a) and 7(b), the room had four flat concrete side-walls featuring a non-rectangular floor map, a floor covered with a thin carpet and a concrete ceiling parallel to the floor, satisfying the 2D × 1D geometry assumption. A radiator and a cable shaft were located on one side of the room (indicated by the label \"radiators\"), both causing scattering of incident sound, and a plywood closet was located at one of the corners. The experiments were performed in two different configurations named as \"Configuration A\" and \"Configuration B\". Identical walls were labelled with the same name (e.g., Wall A, Wall B, etc.) in both cases, while their roles (e.g., Front, Left, etc.) changed depending on the configuration. The reverberation time was measured to be RT 60 = 0.57 s.\n\n2) Laboratory Room: As illustrated in Fig. 7(c), the room had a trapezoidal floor map with all four walls made of concrete and a floor covered with a thin layer of carpet. The ceiling was, however, acoustically treated with a layer of porous absorption behind a perforated ceiling panel, attenuating acoustic reflections. Furthermore, just below the ceiling, an air ventilation duct protruding into the room additionally had an impact on reflections off of the ceiling. The reverberation time was measured to be RT 60 = 0.7 s. Fig. 7(d), the lecture hall was the largest of the three rooms, while it was also the only one with a rectangular floor-map. The back-wall was actually a full glass window with steel frames, creating a non-uniform reflective surface, the left-wall was a wooden room-partitioning panel, and front-and right-walls were made of concrete. The floor was covered with a thin layer of carpet, whereas the ceiling featured another non-uniform surface consisting of a mixture of LED and acoustic-ceiling panels. The reverberation time was measured to be RT 60 = 0.92 s.\n\n\n3) Lecture Hall: As shown in\n\n\nB. Simulations\n\nA replica of the two configurations in the small office excluding the absorber and the plywood cabinet was simulated using the same loudspeaker and microphone setup (but assuming omnidirectional responses) to compare the performance of the RGI algorithm between the experimental and simulated data. The simulated RIRs were generated via the beam-tracing method up to the tenth-order of reflections [28], [29]. To test the proposed method at varying reverberation times, RIRs were simulated at RT 60 s of 0.2 s, 0.6 s and 1.0 s using Configuration A, where the wall attenuation coefficients were computed using the Sabine's formula [24]. In addition, RIRs were generated using both configurations to evaluate the robustness of the RGI algorithm to varying wall characteristics by setting the attenuation coefficient of the wall along which the radiators were installed (labelled as \"Wall B,\" playing the role of a \"right-wall\" in Configuration A, and a \"back-wall\" in Configuration B) to α w = 0.1 and α w = 0.5, while keeping the attenuation coefficients of the remaining walls fixed at α w = 0.9.\n\nC. Parameter Selection 1) DOA Mapping: Each RIR measurement was truncated at the sample corresponding to the propagation distance of ρ max = 15 m for the small office and laboratory room, resulting in N = ρ max · f s /c = 2099, and ρ max = 50 m for the lecture hall, yielding N = 6997. These values were chosen large enough for each room to accommodate higher-order reflections on the DOA map for beam tracing. The DOA-map resolution along the ρ-axis was set to be the same as the measured RIRs i.e., M = N . The angular grid was obtained by uniformly sampling over [0 • , 180 • ] with a resolution of 1 • , leading to a grid length of I = 181.\n\nThe smoothing filter g (l) ρ m ,θ i used for the generation of the matrix A was sampled from a rectangular-windowed Laplace probability density function as an ad-hoc choice to replace the 1D Gaussian filter with the aim of peak-sharpening and hence a reduction in blurring when compared to a Gaussian filter:\ng (l) ρ m ,θ i (n) = 1 2σ e − n−f s ·d (l) ρm,θ i /c /σ if N l ≤ n ≤ N u 0 otherwise (39)\nwhere σ is the scale parameter and the rectangular window is described by the lower bound N l = max(0, −N win + f s · d (l) ρ m ,θ i /c + 1) and the upper bound\nN u = min(N − 1, N win + f s · d (l) ρ m ,θ i /c ),\nwhere N win ∈ Z + and · refers to the flooring to the closest integer value operation. The choice for the filter parameters were σ = 1 and N win = 4, resulting in a narrow-width filter with a sharp peak. This procedure may also be viewed as the selection of a filter that could generate a point spread function for the imaging system, i.e., the local impulse response to a point source [38] with desired properties. Alternatively, fractional-delay filters as described in [32] could be used for the same purpose, but this would result in the matrix A to have negative-valued elements, which could complicate the map estimation with a non-negativity constraint as the measured RIRs also included the loudspeaker driver responses, causing the peaks in RIRs to follow a pattern quite different to that of a sinc function [39].\n\nThe Elastic Net regularization parameters, (λ, β), were empirically tuned to achieve an appropriate trade-off between the model agreement and locally-smooth sparseness: λ = 0.1 and β = 0.05 for the small office and laboratory room, and λ = 0.01 and β = 0.05 for the lecture hall, where a smaller λ was used for the lecture hall to also recover the peaks appearing much later in the RIRs (as the lecture hall being a much larger room than the other two) because LASSO tended to reduce the amplitude of these peaks more than the early ones at a given λ due to the distance compensation arising from the spherical-wave propagation model. The relative error threshold used as the stopping criterion for the coordinate descent algorithm was set to be τ = 10 −3 , resulting in around 30 iterations. MATLAB was run on a computer with a 3.5 GHz Intel Core i7 processor and a 16 GB RAM, solving the Elastic Net in ∼15 minutes for the small office and the laboratory room, and in ∼30 minutes for the lecture hall.\n\nFor the peak detection and pruning process, the values defining the size of the neighborhood were empirically determined as T θ = 5 • and T ρ = 0.034 m (equivalently a time difference of 0.1 ms) to make a reasonable trade-off between reducing the possibility of missing any closely positioned peaks and incorrectly detecting some image artifacts appearing with a small amplitude on the DOA map as potential peaks corresponding to acoustic reflections.\n\n2) Map Segmentation: The wall constraints used for the generation of bounded regions, d min m , d max m and Δϕ m were imposed as two separate sets for the small rooms (small office and laboratory room) and the lecture hall as listed in Table I. The geometrical bounds selected for the small rooms were intended to be general enough for a wide range of small offices and living rooms, which may also be treated as very rough estimates that could potentially be given by a consumer through visual inspection of the actual scene in a commercial scenario. These bounds, however, had to be relaxed and adapted for the lecture hall, as the RGI algorithm was not initially designed to work in such large rooms.\n\nThe search inside each bounded region for the peak candidates for first-order reflections was initialized with the K = 50 largest peaks from Q, and a maximum of K = 10 peaks were allowed to be candidates within each bounded region.\n\n3) Room Geometry Inference: The minimum room height constraint was set to H min = 2.2 m, which should be a reasonable value considering a typical human height range, and also again may be given as a rough user input in a commercial scenario as described above.\n\nThe beam tracing was run with the maximum reflection order to be κ = 3. The thresholds used for the evaluation of the cost function were as τ ρ = 0.02 m and τ θ = 2 • . These values were found experimentally to be large enough to guarantee a sufficient level of robustness against errors in the beam-tracing output (mainly caused by uncertainties in the positions of the array elements and microphone, as well as temporal-and  spatial-sampling artifacts). At the same time, they were sufficiently small to avoid the presence of multiple local maxima falling within the neighborhood of the same candidate image-microphone position.\n\n\nD. Evaluation Metrics\n\nTo evaluate the estimation accuracy for individual walls, the deviation of the estimated pair of wall parameters (v w ,d w ) from the ground-truth values (v w , d w ) is computed in terms of the distance error w,d and orientation error w,θ given by\nw,d = |d w −d w | and w,θ = arccos v w ,v w ,(40)\nrespectively. Please note that w,θ = 0 for the floor and ceiling under the separable room geometry assumption, and hence is considered only for the side-wall estimates.\n\nTo jointly assess the accuracy of the inferred room geometry based on all estimated walls, the root mean square distance error E d and the root mean square orientation error E θ are defined as\nE d = 1 6 6 w=1 2 w,d , E θ = 1 4 4 w=1 2 w,θ ,(41)\nwhere E θ is computed only over the side-wall estimates, since w,θ = 0 by assumption as mentioned above.\n\n\nE. Results\n\nThe performance evaluation results for the experimental data are presented in Table II using the metrics w,d and w,θ , and in Table III using the metrics E d and E θ . In both tables, the mean and standard deviation of each metric computed over nine measurements positions are reported. In addition, the inferred floor maps and room height at nine positions are plotted in Fig. 8 for all four setups in comparison to the actual layout along with the estimated microphone positions. The mean-error values for individual wall estimates μ( w,d ) < 38 cm and μ( w,θ ) < 3 • indicate that the proposed method has achieved a reasonable accuracy across the measurement positions. Despite the geometrical ambiguity arising from using a 1D array, the RGI meanerror values μ(E d ) < 18 cm and μ(E θ ) < 2 • are numerically comparable to those achieved by the techniques in the literature operating both with 2D and 3D array configurations in rooms with similar dimensions and acoustic characteristics [10], [12], [13], [16], [22]. The fact that the wall with a long radiator in the small office was not a proper reflector can be observed in the error results and estimated floor maps, particularly in Configuration A, where it was in the role of a right-wall. The effect of the speaker directivity on the individual wall estimates can clearly be seen from the distance-error comparison between the back-wall and others, where in all four setups, the back-wall was behind the loudspeaker array. The most severe case with a very high error occurred in the laboratory room at two positions, where the peaks corresponding to the back-wall were not even picked during the peak selection for the first-order reflections due to having very weak amplitudes. The exceptional case resulted with the highest error took place during the estimation of the front-wall in Configuration B, where at two positions, the estimated front-wall was aligned with the absorber and plywood closet, and in two other positions, the peak corresponding to the ceiling estimate was also selected as the front-wall estimate, as the RGI algorithm was allowed to select the same peak for multiple walls. If the loudspeaker array is positioned parallel to a side-wall, then the associated peaks line up along the same path on the DOA map as the peaks corresponding to higher-order floor and/or ceiling reflections as a result of the lack of spatial diversity in the linear array. Therefore, these peaks were inaccurately associated with the front-wall by the RGI algorithm during the beam tracing and cost function step due to the actual higher-reflections from the front-wall potentially shifted by the plywood cabinet (a \"non-flat\" wall scenario) and attenuated by the absorber. It was found out that if each peak candidate was restricted to a single-wall, the algorithm was able to select the correct peak for the front-wall at these two positions. For the same reason, it was also observed that if the minimum height constraint H min was not introduced, the RGI algorithm would select a peak appearing earlier than the actual ceiling reflection on the DOA map as the ceiling candidate, resulting in an unrealistically low height estimate, particularly at two positions in Configuration B and at the majority of grid positions in the lecture hall because of the acoustic ceiling attenuating the reflections. However, even with H min , the room height estimate was still incorrect at two positions in the laboratory room due to the duct and acoustic treatment across the ceiling. Besides, the measurement grid in the lecture hall was intentionally positioned closer to the left-wall, resulting in the right-wall estimates to be slightly worse as expected. Since the front-wall was located far away from the measurement positions, it was estimated with a relatively high error. It was also found out that if a wide range was used for the front-wall distance constraint, the RGI algorithm tended to select one of the very earlier peaks appearing along the same path on the DOA map as the front-wall peak resulting from the geometrical ambiguity similar to the case described above for Configuration B.\n\nThe RGI error results for the simulated data are presented in Table IV. The RGI algorithm showed better performance with the simulated data than in experiments. This was not surprising, since the simulations represented an idealized empty-room scenario, where the walls were perfectly flat with no irregularities, loudspeakers and microphone were perfectly omnidirectional and there were no additional acoustic phenomena such as scattering or diffraction. There was a slight increase in RGI error with longer reverberation times because the walls became more reflective with increasing RT 60 , which in turn yielded larger peaks appearing in the later part of the DOA map, causing the algorithm to miss the correct peaks in some cases during the peak selection step for first-order reflection candidates. This was due to these peaks not being included in the set of K = 50 largest peaks, where K was actually empirically set based on the experimental data. As expected, the performance degraded with a less reflective wall, where the RGI algorithm usually selected a random peak from the corresponding bounded region on the DOA map, as the actual peak associated with the wall was very weak. The distance-error for Wall B in the simulated replica of the small office was \n\n\nF. Discussion and Future Work\n\nThe adoption of spherical wave propagation in the physical model enables a more accurate description of the acoustic wavefronts in the near-field. Assuming a plane-wave propagation model would particularly be problematic when the microphone was positioned close to the loudspeaker array with respect to the array size because this would cause the peaks corresponding to the direct path and first-order reflections to appear as smeared and angularly shifted on the DOA map, increasing the wall estimation errors noticeably. A similar problem is also reported in [22], where the linear Radon transform is applied on RIRs for TOA disambiguation. As one would expect, the use of a spherical wave propagation model may produce artificial peaks on the DOA map at the high values of ρ due to the noise in RIRs boosted by the distance compensation. However, this is mitigated through the quadratic penalty in the optimization cost function reducing the noise with a proper choice of the regularization parameters. At the moment, these parameters are manually tuned, since it can be quite challenging to achieve an appropriate trade-off between the model agreement and the locally-smooth sparseness. Nevertheless, the algorithm would highly benefit from the development of an automatic parameter tuning procedure in the future. Another potential disadvantage of the optimization framework used in map generation may be the computational complexity. However, the sparse matrix structure and the lack of need for any inverse operation during the implementation of the coordinate descent algorithm makes the optimization step quite feasible in terms of computational time. The peak detection and pruning technique used in this work is rather a simple approach, meaning that it is incapable of differentiating the peaks that are weak in amplitude but actually represent an acoustic reflection from image artifacts caused by model discrepancies and/or noise. An example of such limitation can be seen in the rightmost column of Fig. 4 especially around the direct-path peak. The use of a more advanced scheme such as the morphology-based peak-detection scheme used in [20] may bring some significant improvement, simplifying the selection of peak candidates for the first-order reflections on the segmented map, essentially when a reflection from a wall appears as rather a weak peak on the DOA map due to absorption and/or transducer directivity.\n\nMap segmentation involves the most challenging part of the proposed RGI method, since during this step, the geometrical ambiguity is tackled by an empirical approach built upon the generation of bounded regions on the DOA map with respect to the pre-defined constraints on the wall dimensions and orientations. There is also room for improvement regarding the selection of peak candidates for the first-order wall reflections, as the current algorithm may fail to include the peaks associated with weakly reflective surfaces. Thus, another potential advancement should include the replacement of the semisupervised approach for the generation of wall-candidate sets with a fully automated scheme. The current RGI algorithm is expected to work in rooms with more than four side-walls and possibly with more inclination, provided that the constraints are given for all the walls. A tilted ceiling scenario may also be handled by the algorithm, but this would require a modification in the beam-tracing step. However, similar to many existing RGI algorithms, all these can become possible only if all the first-order reflections exist on the DOA map. Therefore, the current algorithm will either fail or select a random peak from the bounded regions when a first-order reflection is absent from the DOA map due to a very absorbent boundary, invisibility or occlusion.\n\nWhile the cost function used for RGI yields reliable results in relatively empty rooms, its dependence on the position and amplitude of higher-order reflections on the DOA map may also easily lead to inaccurate estimates, particularly for rooms with many furniture items. Diffuse reflections may also be another factor degrading the estimation accuracy, as they result in sets of smeared peaks on the DOA map, generating higher-order reflections that are also scattered and much more weakened in magnitude. To tackle these issues, the DOA map itself may actually be very useful, since it may also provide more acoustical information about the walls, other reflective surfaces and potential furniture in the room. The generation of DOA maps on bandpass-filtered RIRs at multiple frequencies may enable the frequency-dependent analysis of individual peaks, which may then be used for a more robust and comprehensive characterization of acoustic reflectors within a room.\n\nThe proposed RGI method operates with a synchronized setup to be able to directly estimate DOAs from multiple RIRs without the need to detect TOA in each microphone-speaker pair individually. When synchronization is not possible in advance, auto-calibration techniques such as [16], [17] may be adopted as an initial step for measurement-position estimation. The developed approach requires the measurement microphone to be placed in front of the array to avoid geometrical ambiguity introduced by the linear speaker array. However, this may be regarded as a plausible condition in a typical home/office setting.\n\n\nVIII. CONCLUSION\n\nWe have proposed a 3D RGI methodology for the identification of wall reflectors in convex-shaped rooms from acoustic measurements collected with a linear loudspeaker array and a single microphone. RIRs are translated into a high resolution 2D DOA map, on which salient peaks represent distinct acoustic reflections as a function of the propagation distance and DOA angle with respect to the speaker array. Assuming a 2D × 1D geometry, relaxed geometrical wall bounds are used for the segmentation of the DOA map into six regions to localize the first-order reflections corresponding to four side-walls, floor and ceiling. The 3D wall parameters are determined as those maximizing a cost function evaluated on the DOA map using the higher-order image-microphone positions estimated via beam tracing from the first-order reflections, among all possible room candidates. The feasibility of the proposed method is validated by using simulated and measured RIRs. \n\nFig. 1 .\n1The block diagram of the proposed 3D room geometry inference algorithm using a linear loudspeaker array and a single microphone.\n\nFig. 2 .\n2The separable room geometry obtained by the Cartesian product of 2D and 1D environments (2D × 1D): The room shape can be fully described by its floor map (top view) and height (side view). angular constraint for side-walls (w = 1, . . . ,4) \n\nFig. 3 .\n3Geometrical ambiguity due to using a linear array: The pair (ρ, θ) may correspond to any point r located on the circumference of a circle perpendicular to the xy-plane, centered at [ρ cos θ, 0, 0] T with the radius equal to ρ sin θ, resulting in a circular symmetry for the linear array geometry.\n\nFig. 5 .\n5Map segmentation and room geometry inference via beam tracing:\n\nFig. 6 .\n6Visibility of an image-microphone and an example of a set of visible image-microphones obtained via beam tracing.\n\nFig. 7 .\n7The experimental setups used for the evaluation of the proposed 3D RGI method: RIRs were measured at nine different microphone positions in a small room with two configurations, in a laboratory room and a lecture hall with the measured reverberation times reported in parentheses.\n\nFig. 8 .\n8Room geometry inference results: The floor-map and floor/ceiling height inferred at all nine positions in four setups along with the estimated microphone positions.\n\n\nTuna received the B.Sc. degrees in telecommunications engineering and electronics engineering (double major program) from Istanbul Technical University, Istanbul, Turkey, in 2006 and 2007, respectively, and the M.Sc. (as a Fulbright scholar) and Ph.D. degrees in electrical and computer engineering from the University of Illinois at Urbana-Champaign, Champaign, IL, USA, in 2009 and 2014, respectively. From 2014 to 2017, he was a Postdoctoral Researcher with the University of Illinois' Advanced Digital Sciences Center (ADSC), Singapore. Since 2017, he has been a Research Associate with the International Audio Laboratories Erlangen (a joint institution of the Friedrich-Alexander-Universität Erlangen-Nürnberg and Fraunhofer IIS, Erlangen, Germany). His research interests include spatial audio signal processing, room acoustics, sensor-array signal processing and inverse problems.\n\nTABLE I PARAMETERS\nIUSED FOR THE WALL CONSTRAINTS\n\nTABLE II EXPERIMENTS\nII: INDIVIDUAL WALL ESTIMATION ERROR Mean±std (standard deviation) computed over nine measurement positions.\n\nTABLE III\nIIIEXPERIMENTS: RGI ERROR \n\nMean±std (standard deviation) computed over nine measurement \npositions. \n\n\n\nTABLE IV SIMULATIONS\nIV: RGI ERROR Mean±std (standard deviation) computed over nine measurement positions.\n\n\nw,d [cm] : 12.112 ± 16.020 when α Right = 0.1 and w,d [cm] : 3.207 ± 6.048 when α Right = 0.5 in Configuration A (role: right-wall), and w,d [cm] : 9.635 ± 13.812 when α Back = 0.1 and w,d [cm] : 0.456 ± 0.145 when α Back = 0.5 in Configuration B (role: back-wall).\nACKNOWLEDGMENTThe authors would like to thank the anonymous reviewers for their constructive feedback on the manuscript and also acknowledge Youssef El Baba for helpful suggestions, Felix Knauff for his assistance in experiments and Valentin Schilling for reverberation time measurements.Antonio Canclini was born in Sondalo, Italy, onDecember 19, 1983. He received the M.Sc. degree (cum laude) in computer science and engineering and the Ph.D. degree (cum laude) in information technology from the Politecnico di Milano, Milan, Italy, in 2008 and 2012, respectively. He is currently a Contract Professor with the Politecnico di Milano, where he is also a Postdoctoral Researcher with the Image and Sound Processing Group, Dipartimento di Elettronica, Informazione e Bioingegneria. His research interests focus on space-time audio signal processing (localization of acoustic sources and reflectors, spatial sound field rendering). He promoted/coordinated and/or contributed to numerous European projects in the area of multimedia signal processing. He has coauthored more than 300 scientific publications on international journals and congresses and numerous patents in the multimedia signal processing area. His main research interests are in the area of audio and acoustic signal processing, with particular focus on sound analysis, synthesis, and processing; space-time audio processing; geometrical acoustics; music information extraction and music modeling. He served in the IEEE Technical Committee on Audio and Acoustics Signal Processing for two terms.Federico\nUsing reverberation to improve range and elevation discrimination for small array sound source localization. F Ribeiro, C Zhang, D A Florencio, D E Ba, IEEE Trans. Audio, Speech, Lang. Process. 187F. Ribeiro, C. Zhang, D. A. Florencio, and D. E. Ba, \"Using reverberation to improve range and elevation discrimination for small array sound source localization,\" IEEE Trans. Audio, Speech, Lang. Process., vol. 18, no. 7, pp. 1781-1792, Sep. 2010.\n\nTurning enemies into friends: Using reflections to improve sound source localization. F Ribeiro, D Ba, C Zhang, D Florêncio, Proc. Int. Conf. Multimedia Expo. Int. Conf. Multimedia ExpoF. Ribeiro, D. Ba, C. Zhang, and D. Florêncio, \"Turning enemies into friends: Using reflections to improve sound source localization,\" in Proc. Int. Conf. Multimedia Expo., 2010, pp. 731-736.\n\nP A Naylor, N D Gaubitch, Speech Dereverberation. Berlin, GermanySpringerP. A. Naylor and N. D. Gaubitch, Speech Dereverberation. Berlin, Germany: Springer, 2010.\n\nA dereverberation algorithm for spherical microphone arrays using compressed sensing techniques. P K T Wu, N Epain, C Jin, Proc. IEEE Int. Conf. Acoust., Speech Signal Process. IEEE Int. Conf. Acoust., Speech Signal essP. K. T. Wu, N. Epain, and C. Jin, \"A dereverberation algorithm for spher- ical microphone arrays using compressed sensing techniques,\" in Proc. IEEE Int. Conf. Acoust., Speech Signal Process., 2012, pp. 4053-4056.\n\nA room-compensated virtual surround system exploiting early reflections in a reverberant room. A Canclini, D Markovi, F Antonacci, A Sarti, S Tubaro, Proc. Eur. Signal Process. Conf. Eur. Signal ess. ConfA. Canclini, D. Markovi, F. Antonacci, A. Sarti, and S. Tubaro, \"A room-compensated virtual surround system exploiting early reflections in a reverberant room,\" in Proc. Eur. Signal Process. Conf., Aug. 2012, pp. 1029-1033.\n\nDisambiguation of TDOA estimation for multiple sources in reverberant environments. J Scheuing, B Yang, IEEE Trans. Audio, Speech, Lang. Process. 168J. Scheuing and B. Yang, \"Disambiguation of TDOA estimation for multiple sources in reverberant environments,\" IEEE Trans. Audio, Speech, Lang. Process., vol. 16, no. 8, pp. 1479-1489, Nov. 2008.\n\nImproved TDOA disambiguation techniques for sound source localization in reverberant environments. C M Zannini, A Cirillo, R Parisi, A Uncini, Proc. Int. Symp. Circuits Syst. Int. Symp. Circuits SystC. M. Zannini, A. Cirillo, R. Parisi, and A. Uncini, \"Improved TDOA disambiguation techniques for sound source localization in reverberant environments,\" in Proc. Int. Symp. Circuits Syst., 2010, pp. 2666-2669.\n\nGeometric reconstruction of the environment from its response to multiple acoustic emissions. F Antonacci, A Sarti, S Tubaro, Proc. IEEE Int. Conf. Acoust., Speech Signal Process. IEEE Int. Conf. Acoust., Speech Signal essF. Antonacci, A. Sarti, and S. Tubaro, \"Geometric reconstruction of the environment from its response to multiple acoustic emissions,\" in Proc. IEEE Int. Conf. Acoust., Speech Signal Process., 2010, pp. 2822-2825.\n\nGeometric inference of the room geometry under temperature variations. P Annibale, J Filos, P A Naylor, R Rabenstein, Proc. Int. Symp. Control, Commmun. Signal Process. Int. Symp. Control, Commmun. Signal essP. Annibale, J. Filos, P. A. Naylor, and R. Rabenstein, \"Geometric inference of the room geometry under temperature variations,\" in Proc. Int. Symp. Control, Commmun. Signal Process, 2012, pp. 1-4.\n\nA two-step approach to blindly infer room geometries. J Filos, E A Habets, P A Naylor, Proc. Int. Workshop Acoust. Echo Noise Control. Int. Workshop Acoust. Echo Noise ControlJ. Filos, E. A. Habets, and P. A. Naylor, \"A two-step approach to blindly in- fer room geometries,\" in Proc. Int. Workshop Acoust. Echo Noise Control, 2010, pp. 1-4.\n\nInference of room geometry from acoustic impulse responses. F Antonacci, IEEE Trans. Audio, Speech, Lang. Process. 2010F. Antonacci et al., \"Inference of room geometry from acoustic impulse responses,\" IEEE Trans. Audio, Speech, Lang. Process., vol. 20, no. 10, pp. 2683-2695, Dec. 2012.\n\nLocalization of planar acoustic reflectors from the combination of linear estimates. J Filos, A Canclini, F Antonacci, A Sarti, P A Naylor, Proc. Eur. Signal Process. Conf. Eur. Signal ess. ConfJ. Filos, A. Canclini, F. Antonacci, A. Sarti, and P. A. Naylor, \"Localization of planar acoustic reflectors from the combination of linear estimates,\" in Proc. Eur. Signal Process. Conf., 2012, pp. 1019-1023.\n\nA 3D model for room boundary estimation. L Remaggi, P J B Jackson, W Wang, J A Chambers, Proc. IEEE Int. Conf. Acoust., Speech Signal Process. IEEE Int. Conf. Acoust., Speech Signal essL. Remaggi, P. J. B. Jackson, W. Wang, and J. A. Chambers, \"A 3D model for room boundary estimation,\" in Proc. IEEE Int. Conf. Acoust., Speech Signal Process., Apr. 2015, pp. 514-518.\n\nAcoustic reflector localization: Novel image source reversion and direct localization methods. L Remaggi, P J B Jackson, P Coleman, W Wang, IEEE Trans. Audio, Speech, Lang. Process. 252L. Remaggi, P. J. B. Jackson, P. Coleman, and W. Wang, \"Acoustic reflector localization: Novel image source reversion and direct localization methods,\" IEEE Trans. Audio, Speech, Lang. Process., vol. 25, no. 2, pp. 296-309, Feb. 2017.\n\nAcoustic echoes reveal room shape. I Dokmanić, R Parhizkar, A Walther, Y M Lu, M Vetterli, Proc. Nat. Acad. Sci. Nat. Acad. Sci110I. Dokmanić, R. Parhizkar, A. Walther, Y. M. Lu, and M. Vetterli, \"Acoustic echoes reveal room shape,\" Proc. Nat. Acad. Sci., vol. 110, no. 30, pp. 12 186-12 191, 2013.\n\nUncalibrated 3D room geometry estimation from sound impulse responses. M Crocco, A Trucco, A Del Bue, J. Franklin Inst. 35418M. Crocco, A. Trucco, and A. Del Bue, \"Uncalibrated 3D room geometry estimation from sound impulse responses,\" J. Franklin Inst., vol. 354, no. 18, pp. 8678-8709, 2017.\n\nAuto-localization in ad-hoc microphone arrays. N D Gaubitch, W B Kleijn, R Heusdens, Proc. IEEE Int. Conf. Acoust., Speech Signal Process. IEEE Int. Conf. Acoust., Speech Signal essN. D. Gaubitch, W. B. Kleijn, and R. Heusdens, \"Auto-localization in ad-hoc microphone arrays,\" in Proc. IEEE Int. Conf. Acoust., Speech Signal Process., May 2013, pp. 106-110.\n\nRoom acoustics analysis using circular arrays: An experimental study based on sound field planewave decomposition. A M Torres, J J Lopez, B Pueo, M Cobos, J. Acoust. Soc. Amer. 1334A. M. Torres, J. J. Lopez, B. Pueo, and M. Cobos, \"Room acoustics analysis using circular arrays: An experimental study based on sound field plane- wave decomposition,\" J. Acoust. Soc. Amer., vol. 133, no. 4, pp. 2146- 2156, 2013.\n\n3D room geometry reconstruction using audio-visual sensors. H Kim, L Remaggi, P J Jackson, F M Fazi, A Hilton, Proc. Int. Conf. 3D Vision. Int. Conf. 3D VisionH. Kim, L. Remaggi, P. J. Jackson, F. M. Fazi, and A. Hilton, \"3D room geometry reconstruction using audio-visual sensors,\" in Proc. Int. Conf. 3D Vision, Oct. 2017, pp. 621-629.\n\nAcoustic reflector localization and classification. L Remaggi, H Kim, P J B Jackson, F M Fazi, A Hilton, Proc. IEEE Int. Conf. Acoust., Speech Signal Process. IEEE Int. Conf. Acoust., Speech Signal essL. Remaggi, H. Kim, P. J. B. Jackson, F. M. Fazi, and A. Hilton, \"Acoustic reflector localization and classification,\" in Proc. IEEE Int. Conf. Acoust., Speech Signal Process., Apr. 2018, pp. 201-205.\n\nTime of arrival disambiguation using the linear Radon transform. Y El Baba, A Walther, E A P Habets, Proc. IEEE Int. Conf. Acoust., Speech Signal Process. IEEE Int. Conf. Acoust., Speech Signal essY. El Baba, A. Walther, and E. A. P. Habets, \"Time of arrival disambigua- tion using the linear Radon transform,\" in Proc. IEEE Int. Conf. Acoust., Speech Signal Process., Mar. 2017, pp. 106-110.\n\n3D room geometry inference based on room impulse response stacks. Y El Baba, A Walther, E A Habets, IEEE Trans. Audio, Speech, Lang. Process. 265Y. El Baba, A. Walther, and E. A. Habets, \"3D room geometry inference based on room impulse response stacks,\" IEEE Trans. Audio, Speech, Lang. Process., vol. 26, no. 5, pp. 857-872, May 2018.\n\nOn 2d localization of reflectors using robust beamforming techniques. E Mabande, H Sun, K Kowalczyk, W Kellermann, Proc. IEEE Int. Conf. Acoust., Speech Signal Process. IEEE Int. Conf. Acoust., Speech Signal essE. Mabande, H. Sun, K. Kowalczyk, and W. Kellermann, \"On 2d local- ization of reflectors using robust beamforming techniques,\" in Proc. IEEE Int. Conf. Acoust., Speech Signal Process., May 2011, pp. 153-156.\n\nL E Kinsler, A R Frey, A B Coppens, J V Sanders, Fundamentals of Acoustics. Hoboken, NJ, USAWiley4th edL. E. Kinsler, A. R. Frey, A. B. Coppens, and J. V. Sanders, Fundamentals of Acoustics, 4th ed. Hoboken, NJ, USA: Wiley, 1999.\n\nGeometrically constrained room modeling with compact microphone arrays. F Ribeiro, D Florêncio, D Bai, S Zhang, IEEE Trans. Audio, Speech, Lang. Process. 205F. Ribeiro, D. Florêncio, D. Bai, and S. Zhang, \"Geometrically constrained room modeling with compact microphone arrays,\" IEEE Trans. Audio, Speech, Lang. Process., vol. 20, no. 5, pp. 1449-1460, Jul. 2012.\n\nDynamic audio reproduction with linear loudspeaker arrays. M F S Galvez, D Menzies, F M Fazi, J. Audio Eng. Soc. 674M. F. S. Galvez, D. Menzies, and F. M. Fazi, \"Dynamic audio reproduction with linear loudspeaker arrays,\" J. Audio Eng. Soc., vol. 67, no. 4, pp. 190- 200, 2019.\n\nSound spatialization based on fast beam tracing in the dual space. M Foco, P Polotti, A Sarti, S Tubaro, Proc. Int. Conf. Digit. Audio Effects (DAFx-03). Int. Conf. Digit. Audio Effects (DAFx-03)Paper 52M. Foco, P. Polotti, A. Sarti, and S. Tubaro, \"Sound spatialization based on fast beam tracing in the dual space,\" in Proc. Int. Conf. Digit. Audio Effects (DAFx-03), Sep. 2003, pp. 1-5, Paper 52.\n\nFast tracing of acoustic beams and paths through visibility lookup. F Antonacci, M Foco, A Sarti, S Tubaro, IEEE Trans. Audio, Speech, Lang. Process. 164F. Antonacci, M. Foco, A. Sarti, and S. Tubaro, \"Fast tracing of acoustic beams and paths through visibility lookup,\" IEEE Trans. Audio, Speech, Lang. Process., vol. 16, no. 4, pp. 812-824, May 2008.\n\nVisibility-based beam tracing for soundfield rendering. D Markovic, A Canclini, F Antonacci, A Sarti, S Tubaro, Proc. Int. Workshop Multimedia Signal Process. Int. Workshop Multimedia Signal essD. Markovic, A. Canclini, F. Antonacci, A. Sarti, and S. Tubaro, \"Visibility-based beam tracing for soundfield rendering,\" in Proc. Int. Workshop Multimedia Signal Process., 2010, pp. 40-45.\n\nRegression shrinkage and selection via the lasso. R Tibshirani, J. R. Stat. Soc. Ser. B Methodol. 581R. Tibshirani, \"Regression shrinkage and selection via the lasso,\" J. R. Stat. Soc. Ser. B Methodol., vol. 58, no. 1, pp. 267-288, 1996.\n\nRegularization and variable selection via the elastic net. H Zou, T Hastie, J. R. Stat. Soc. Ser. B Methodol. 672H. Zou and T. Hastie, \"Regularization and variable selection via the elastic net,\" J. R. Stat. Soc. Ser. B Methodol., vol. 67, no. 2, pp. 301-320, 2005.\n\nSimulating the response of multiple microphones to a single acoustic source in a reverberant room. P M Peterson, J. Acoust. Soc. Amer. 805P. M. Peterson, \"Simulating the response of multiple microphones to a single acoustic source in a reverberant room,\" J. Acoust. Soc. Amer., vol. 80, no. 5, pp. 1527-1529, 1986.\n\nSingle-and multi-microphone speech dereverberation using spectral enhancement. E A P Habets, Eindhoven, The NetherlandsDept. Elect. Eng., Eindhoven Univ. Technol.Ph.D. dissertationE. A. P. Habets, \"Single-and multi-microphone speech dereverberation using spectral enhancement,\" Ph.D. dissertation, Dept. Elect. Eng., Eind- hoven Univ. Technol., Eindhoven, The Netherlands, 2007.\n\nRegularization paths for generalized linear models via coordinate descent. J Friedman, T Hastie, R Tibshirani, J. Stat. Softw. 331J. Friedman, T. Hastie, and R. Tibshirani, \"Regularization paths for gener- alized linear models via coordinate descent,\" J. Stat. Softw., vol. 33, no. 1, pp. 1-22, 2010.\n\nMultiple View Geometry in Computer Vision. R Hartley, A Zisserman, Cambridge Univ. PressCambridge, U.K.2nd ed.R. Hartley and A. Zisserman, Multiple View Geometry in Computer Vision. 2nd ed., Cambridge, U.K.: Cambridge Univ. Press, 2003.\n\nImage method for efficiently simulating small-room acoustics. J B Allen, D A Berkley, J. Acoust. Soc. Amer. 654J. B. Allen and D. A. Berkley, \"Image method for efficiently simulating small-room acoustics,\" J. Acoust. Soc. Amer., vol. 65, no. 4, pp. 943-950, 1979.\n\nAcoustics -Measurement of room acoustic parameters -Part 2: Reverberation time in ordinary rooms. International Organization for Standardization. ISO 3382-2:2008(ENISO 3382-2:2008(EN), \"Acoustics -Measurement of room acoustic pa- rameters -Part 2: Reverberation time in ordinary rooms,\" International Organization for Standardization, Geneva, CH, Standard, 2008.\n\nSpatial resolution properties of penalizedlikelihood image reconstruction: Space-invariant tomographs. J A Fessler, L Rogers, IEEE Trans. Image Process. 59J. A. Fessler and L. Rogers, \"Spatial resolution properties of penalized- likelihood image reconstruction: Space-invariant tomographs,\" IEEE Trans. Image Process., vol. 5, no. 9, pp. 1346-1358, Sep. 1996.\n\nAdvancements in impulse response measurements by sine sweeps. A Farina, Proc. Audio Eng. Soc. Conv. Paper 7121A. Farina, \"Advancements in impulse response measurements by sine sweeps,\" in Proc. Audio Eng. Soc. Conv., May 2007, pp. 1-21, Paper 7121.\n", "annotations": {"author": "[{\"end\":99,\"start\":87},{\"end\":117,\"start\":100},{\"end\":133,\"start\":118},{\"end\":147,\"start\":134},{\"end\":176,\"start\":148},{\"end\":193,\"start\":177},{\"end\":227,\"start\":194},{\"end\":266,\"start\":228}]", "publisher": null, "author_last_name": "[{\"end\":98,\"start\":94},{\"end\":116,\"start\":108},{\"end\":132,\"start\":127},{\"end\":146,\"start\":142},{\"end\":175,\"start\":166},{\"end\":192,\"start\":185},{\"end\":265,\"start\":259}]", "author_first_name": "[{\"end\":93,\"start\":87},{\"end\":107,\"start\":100},{\"end\":126,\"start\":118},{\"end\":141,\"start\":134},{\"end\":165,\"start\":160},{\"end\":184,\"start\":177},{\"end\":220,\"start\":213},{\"end\":226,\"start\":221},{\"end\":254,\"start\":247},{\"end\":258,\"start\":255}]", "author_affiliation": null, "title": "[{\"end\":84,\"start\":1},{\"end\":350,\"start\":267}]", "venue": "[{\"end\":415,\"start\":352}]", "abstract": "[{\"end\":1859,\"start\":537}]", "bib_ref": "[{\"attributes\":{\"ref_id\":\"b0\"},\"end\":2162,\"start\":2159},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":2167,\"start\":2164},{\"attributes\":{\"ref_id\":\"b2\"},\"end\":2217,\"start\":2214},{\"attributes\":{\"ref_id\":\"b3\"},\"end\":2222,\"start\":2219},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":2310,\"start\":2307},{\"attributes\":{\"ref_id\":\"b5\"},\"end\":2924,\"start\":2921},{\"attributes\":{\"ref_id\":\"b6\"},\"end\":2929,\"start\":2926},{\"attributes\":{\"ref_id\":\"b7\"},\"end\":3010,\"start\":3007},{\"attributes\":{\"ref_id\":\"b13\"},\"end\":3016,\"start\":3012},{\"attributes\":{\"ref_id\":\"b7\"},\"end\":3289,\"start\":3286},{\"attributes\":{\"ref_id\":\"b8\"},\"end\":3358,\"start\":3355},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":3397,\"start\":3393},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":3487,\"start\":3483},{\"attributes\":{\"ref_id\":\"b11\"},\"end\":3731,\"start\":3727},{\"attributes\":{\"ref_id\":\"b12\"},\"end\":3801,\"start\":3797},{\"attributes\":{\"ref_id\":\"b13\"},\"end\":3807,\"start\":3803},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":3893,\"start\":3889},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":4080,\"start\":4076},{\"attributes\":{\"ref_id\":\"b16\"},\"end\":4189,\"start\":4185},{\"attributes\":{\"ref_id\":\"b17\"},\"end\":4610,\"start\":4606},{\"attributes\":{\"ref_id\":\"b21\"},\"end\":4616,\"start\":4612},{\"attributes\":{\"ref_id\":\"b17\"},\"end\":4625,\"start\":4621},{\"attributes\":{\"ref_id\":\"b18\"},\"end\":4759,\"start\":4755},{\"attributes\":{\"ref_id\":\"b19\"},\"end\":4765,\"start\":4761},{\"attributes\":{\"ref_id\":\"b22\"},\"end\":4813,\"start\":4809},{\"attributes\":{\"ref_id\":\"b23\"},\"end\":5016,\"start\":5012},{\"attributes\":{\"ref_id\":\"b20\"},\"end\":5344,\"start\":5340},{\"attributes\":{\"ref_id\":\"b24\"},\"end\":6056,\"start\":6052},{\"attributes\":{\"ref_id\":\"b13\"},\"end\":6261,\"start\":6257},{\"attributes\":{\"ref_id\":\"b19\"},\"end\":6267,\"start\":6263},{\"attributes\":{\"ref_id\":\"b20\"},\"end\":6570,\"start\":6566},{\"attributes\":{\"ref_id\":\"b21\"},\"end\":6743,\"start\":6739},{\"attributes\":{\"ref_id\":\"b25\"},\"end\":7348,\"start\":7344},{\"attributes\":{\"ref_id\":\"b26\"},\"end\":8438,\"start\":8434},{\"attributes\":{\"ref_id\":\"b28\"},\"end\":8444,\"start\":8440},{\"attributes\":{\"ref_id\":\"b29\"},\"end\":10732,\"start\":10728},{\"attributes\":{\"ref_id\":\"b30\"},\"end\":10738,\"start\":10734},{\"attributes\":{\"ref_id\":\"b20\"},\"end\":10925,\"start\":10921},{\"attributes\":{\"ref_id\":\"b26\"},\"end\":12280,\"start\":12276},{\"attributes\":{\"ref_id\":\"b28\"},\"end\":12286,\"start\":12282},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":17198,\"start\":17195},{\"attributes\":{\"ref_id\":\"b23\"},\"end\":20295,\"start\":20291},{\"attributes\":{\"ref_id\":\"b13\"},\"end\":21942,\"start\":21938},{\"attributes\":{\"ref_id\":\"b31\"},\"end\":22516,\"start\":22512},{\"attributes\":{\"ref_id\":\"b32\"},\"end\":22522,\"start\":22518},{\"end\":22533,\"start\":22530},{\"end\":22665,\"start\":22662},{\"attributes\":{\"ref_id\":\"b29\"},\"end\":24321,\"start\":24317},{\"attributes\":{\"ref_id\":\"b30\"},\"end\":24327,\"start\":24323},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":24858,\"start\":24854},{\"attributes\":{\"ref_id\":\"b30\"},\"end\":25336,\"start\":25332},{\"attributes\":{\"ref_id\":\"b29\"},\"end\":25538,\"start\":25534},{\"attributes\":{\"ref_id\":\"b30\"},\"end\":25544,\"start\":25540},{\"attributes\":{\"ref_id\":\"b30\"},\"end\":25643,\"start\":25639},{\"attributes\":{\"ref_id\":\"b33\"},\"end\":25913,\"start\":25909},{\"attributes\":{\"ref_id\":\"b20\"},\"end\":27080,\"start\":27076},{\"attributes\":{\"ref_id\":\"b0\"},\"end\":30145,\"start\":30142},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":30153,\"start\":30150},{\"attributes\":{\"ref_id\":\"b8\"},\"end\":30224,\"start\":30221},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":30653,\"start\":30649},{\"attributes\":{\"ref_id\":\"b34\"},\"end\":32973,\"start\":32969},{\"attributes\":{\"ref_id\":\"b26\"},\"end\":34946,\"start\":34942},{\"attributes\":{\"ref_id\":\"b28\"},\"end\":34952,\"start\":34948},{\"attributes\":{\"ref_id\":\"b34\"},\"end\":35139,\"start\":35135},{\"attributes\":{\"ref_id\":\"b27\"},\"end\":35783,\"start\":35779},{\"attributes\":{\"ref_id\":\"b35\"},\"end\":35902,\"start\":35898},{\"attributes\":{\"ref_id\":\"b27\"},\"end\":36393,\"start\":36389},{\"attributes\":{\"ref_id\":\"b28\"},\"end\":36399,\"start\":36395},{\"attributes\":{\"ref_id\":\"b35\"},\"end\":37003,\"start\":36999},{\"attributes\":{\"ref_id\":\"b37\"},\"end\":38132,\"start\":38128},{\"attributes\":{\"ref_id\":\"b36\"},\"end\":39414,\"start\":39410},{\"attributes\":{\"ref_id\":\"b27\"},\"end\":41908,\"start\":41904},{\"attributes\":{\"ref_id\":\"b28\"},\"end\":41914,\"start\":41910},{\"attributes\":{\"ref_id\":\"b23\"},\"end\":42141,\"start\":42137},{\"end\":43277,\"start\":43274},{\"attributes\":{\"ref_id\":\"b37\"},\"end\":44253,\"start\":44249},{\"attributes\":{\"ref_id\":\"b31\"},\"end\":44339,\"start\":44335},{\"attributes\":{\"ref_id\":\"b38\"},\"end\":44685,\"start\":44681},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":49830,\"start\":49826},{\"attributes\":{\"ref_id\":\"b11\"},\"end\":49836,\"start\":49832},{\"attributes\":{\"ref_id\":\"b12\"},\"end\":49842,\"start\":49838},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":49848,\"start\":49844},{\"attributes\":{\"ref_id\":\"b21\"},\"end\":49854,\"start\":49850},{\"attributes\":{\"ref_id\":\"b21\"},\"end\":54864,\"start\":54860},{\"attributes\":{\"ref_id\":\"b19\"},\"end\":56457,\"start\":56453},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":59351,\"start\":59347},{\"attributes\":{\"ref_id\":\"b16\"},\"end\":59357,\"start\":59353},{\"attributes\":{\"ref_id\":\"b3\"},\"end\":61053,\"start\":61051}]", "figure": "[{\"attributes\":{\"id\":\"fig_0\"},\"end\":60801,\"start\":60662},{\"attributes\":{\"id\":\"fig_1\"},\"end\":61054,\"start\":60802},{\"attributes\":{\"id\":\"fig_2\"},\"end\":61362,\"start\":61055},{\"attributes\":{\"id\":\"fig_3\"},\"end\":61436,\"start\":61363},{\"attributes\":{\"id\":\"fig_4\"},\"end\":61561,\"start\":61437},{\"attributes\":{\"id\":\"fig_5\"},\"end\":61853,\"start\":61562},{\"attributes\":{\"id\":\"fig_6\"},\"end\":62029,\"start\":61854},{\"attributes\":{\"id\":\"fig_7\"},\"end\":62919,\"start\":62030},{\"attributes\":{\"id\":\"tab_0\",\"type\":\"table\"},\"end\":62970,\"start\":62920},{\"attributes\":{\"id\":\"tab_1\",\"type\":\"table\"},\"end\":63101,\"start\":62971},{\"attributes\":{\"id\":\"tab_2\",\"type\":\"table\"},\"end\":63216,\"start\":63102},{\"attributes\":{\"id\":\"tab_3\",\"type\":\"table\"},\"end\":63324,\"start\":63217},{\"attributes\":{\"id\":\"tab_4\",\"type\":\"table\"},\"end\":63592,\"start\":63325}]", "paragraph": "[{\"end\":2730,\"start\":1878},{\"end\":4265,\"start\":2732},{\"end\":5238,\"start\":4267},{\"end\":5317,\"start\":5240},{\"end\":5396,\"start\":5319},{\"end\":6895,\"start\":5398},{\"end\":8700,\"start\":6897},{\"end\":9392,\"start\":8702},{\"end\":9555,\"start\":9416},{\"end\":9985,\"start\":9557},{\"end\":11102,\"start\":9987},{\"end\":12323,\"start\":11104},{\"end\":13432,\"start\":12378},{\"end\":14033,\"start\":13490},{\"end\":14551,\"start\":14035},{\"end\":14807,\"start\":14582},{\"end\":15106,\"start\":14864},{\"end\":16544,\"start\":15140},{\"end\":16759,\"start\":16546},{\"end\":17080,\"start\":16809},{\"end\":17229,\"start\":17113},{\"end\":17291,\"start\":17259},{\"end\":17543,\"start\":17323},{\"end\":17728,\"start\":17634},{\"end\":17902,\"start\":17804},{\"end\":18194,\"start\":17928},{\"end\":18631,\"start\":18324},{\"end\":19298,\"start\":18658},{\"end\":20063,\"start\":19385},{\"end\":20755,\"start\":20086},{\"end\":21083,\"start\":20821},{\"end\":21176,\"start\":21169},{\"end\":21910,\"start\":21447},{\"end\":22708,\"start\":21912},{\"end\":22827,\"start\":22785},{\"end\":22922,\"start\":22919},{\"end\":23458,\"start\":23014},{\"end\":23955,\"start\":23672},{\"end\":24338,\"start\":23977},{\"end\":25644,\"start\":24403},{\"end\":25722,\"start\":25682},{\"end\":26465,\"start\":25779},{\"end\":26798,\"start\":26543},{\"end\":27406,\"start\":26895},{\"end\":28232,\"start\":27408},{\"end\":28455,\"start\":28261},{\"end\":28584,\"start\":28480},{\"end\":29256,\"start\":28615},{\"end\":29986,\"start\":29286},{\"end\":30385,\"start\":30023},{\"end\":30531,\"start\":30466},{\"end\":30581,\"start\":30558},{\"end\":30748,\"start\":30583},{\"end\":30822,\"start\":30819},{\"end\":30975,\"start\":30857},{\"end\":31177,\"start\":31049},{\"end\":31414,\"start\":31223},{\"end\":31572,\"start\":31441},{\"end\":31750,\"start\":31574},{\"end\":31875,\"start\":31752},{\"end\":32071,\"start\":31896},{\"end\":32285,\"start\":32104},{\"end\":32520,\"start\":32347},{\"end\":32711,\"start\":32556},{\"end\":32974,\"start\":32770},{\"end\":33361,\"start\":33053},{\"end\":33474,\"start\":33430},{\"end\":34010,\"start\":33501},{\"end\":34486,\"start\":34012},{\"end\":36739,\"start\":34524},{\"end\":37396,\"start\":36829},{\"end\":37622,\"start\":37432},{\"end\":38024,\"start\":37714},{\"end\":38207,\"start\":38026},{\"end\":39553,\"start\":38256},{\"end\":40367,\"start\":39574},{\"end\":41456,\"start\":40369},{\"end\":42603,\"start\":41506},{\"end\":43249,\"start\":42605},{\"end\":43559,\"start\":43251},{\"end\":43810,\"start\":43650},{\"end\":44686,\"start\":43863},{\"end\":45691,\"start\":44688},{\"end\":46144,\"start\":45693},{\"end\":46849,\"start\":46146},{\"end\":47082,\"start\":46851},{\"end\":47344,\"start\":47084},{\"end\":47976,\"start\":47346},{\"end\":48250,\"start\":48002},{\"end\":48469,\"start\":48301},{\"end\":48663,\"start\":48471},{\"end\":48820,\"start\":48716},{\"end\":52992,\"start\":48835},{\"end\":54265,\"start\":52994},{\"end\":56732,\"start\":54299},{\"end\":58098,\"start\":56734},{\"end\":59068,\"start\":58100},{\"end\":59682,\"start\":59070},{\"end\":60661,\"start\":59703}]", "formula": "[{\"attributes\":{\"id\":\"formula_0\"},\"end\":13489,\"start\":13433},{\"attributes\":{\"id\":\"formula_1\"},\"end\":14581,\"start\":14552},{\"attributes\":{\"id\":\"formula_2\"},\"end\":14836,\"start\":14808},{\"attributes\":{\"id\":\"formula_3\"},\"end\":15139,\"start\":15107},{\"attributes\":{\"id\":\"formula_4\"},\"end\":16808,\"start\":16760},{\"attributes\":{\"id\":\"formula_5\"},\"end\":17112,\"start\":17081},{\"attributes\":{\"id\":\"formula_6\"},\"end\":17258,\"start\":17230},{\"attributes\":{\"id\":\"formula_7\"},\"end\":17322,\"start\":17292},{\"attributes\":{\"id\":\"formula_8\"},\"end\":17633,\"start\":17544},{\"attributes\":{\"id\":\"formula_9\"},\"end\":17803,\"start\":17729},{\"attributes\":{\"id\":\"formula_10\"},\"end\":18323,\"start\":18195},{\"attributes\":{\"id\":\"formula_11\"},\"end\":18657,\"start\":18632},{\"attributes\":{\"id\":\"formula_12\"},\"end\":19366,\"start\":19299},{\"attributes\":{\"id\":\"formula_13\"},\"end\":20820,\"start\":20756},{\"attributes\":{\"id\":\"formula_14\"},\"end\":21168,\"start\":21084},{\"attributes\":{\"id\":\"formula_15\"},\"end\":21446,\"start\":21177},{\"attributes\":{\"id\":\"formula_16\"},\"end\":22784,\"start\":22709},{\"attributes\":{\"id\":\"formula_17\"},\"end\":22918,\"start\":22828},{\"attributes\":{\"id\":\"formula_18\"},\"end\":23013,\"start\":22923},{\"attributes\":{\"id\":\"formula_19\"},\"end\":23671,\"start\":23459},{\"attributes\":{\"id\":\"formula_20\"},\"end\":24402,\"start\":24339},{\"attributes\":{\"id\":\"formula_21\"},\"end\":25681,\"start\":25645},{\"attributes\":{\"id\":\"formula_22\"},\"end\":25778,\"start\":25723},{\"attributes\":{\"id\":\"formula_23\"},\"end\":26542,\"start\":26466},{\"attributes\":{\"id\":\"formula_24\"},\"end\":26862,\"start\":26799},{\"attributes\":{\"id\":\"formula_25\"},\"end\":28260,\"start\":28233},{\"attributes\":{\"id\":\"formula_26\"},\"end\":28479,\"start\":28456},{\"attributes\":{\"id\":\"formula_27\"},\"end\":28614,\"start\":28585},{\"attributes\":{\"id\":\"formula_28\"},\"end\":30465,\"start\":30386},{\"attributes\":{\"id\":\"formula_29\"},\"end\":30557,\"start\":30532},{\"attributes\":{\"id\":\"formula_30\"},\"end\":30818,\"start\":30749},{\"attributes\":{\"id\":\"formula_31\"},\"end\":30856,\"start\":30823},{\"attributes\":{\"id\":\"formula_32\"},\"end\":31048,\"start\":30976},{\"attributes\":{\"id\":\"formula_33\"},\"end\":31440,\"start\":31415},{\"attributes\":{\"id\":\"formula_34\"},\"end\":31895,\"start\":31876},{\"attributes\":{\"id\":\"formula_35\"},\"end\":32103,\"start\":32072},{\"attributes\":{\"id\":\"formula_36\"},\"end\":32555,\"start\":32521},{\"attributes\":{\"id\":\"formula_37\"},\"end\":32769,\"start\":32712},{\"attributes\":{\"id\":\"formula_38\"},\"end\":33052,\"start\":32975},{\"attributes\":{\"id\":\"formula_39\"},\"end\":33429,\"start\":33362},{\"attributes\":{\"id\":\"formula_40\"},\"end\":33500,\"start\":33475},{\"attributes\":{\"id\":\"formula_41\"},\"end\":36828,\"start\":36740},{\"attributes\":{\"id\":\"formula_42\"},\"end\":37411,\"start\":37397},{\"attributes\":{\"id\":\"formula_43\"},\"end\":37713,\"start\":37623},{\"attributes\":{\"id\":\"formula_44\"},\"end\":43649,\"start\":43560},{\"attributes\":{\"id\":\"formula_45\"},\"end\":43862,\"start\":43811},{\"attributes\":{\"id\":\"formula_46\"},\"end\":48300,\"start\":48251},{\"attributes\":{\"id\":\"formula_47\"},\"end\":48715,\"start\":48664}]", "table_ref": "[{\"attributes\":{\"ref_id\":\"tab_0\"},\"end\":46389,\"start\":46382},{\"attributes\":{\"ref_id\":\"tab_0\"},\"end\":48921,\"start\":48913},{\"attributes\":{\"ref_id\":\"tab_0\"},\"end\":48970,\"start\":48961},{\"attributes\":{\"ref_id\":\"tab_0\"},\"end\":53064,\"start\":53056}]", "section_header": "[{\"end\":1876,\"start\":1861},{\"end\":9414,\"start\":9395},{\"end\":12354,\"start\":12326},{\"end\":12376,\"start\":12357},{\"end\":14862,\"start\":14838},{\"end\":17926,\"start\":17905},{\"end\":19383,\"start\":19368},{\"end\":20084,\"start\":20066},{\"end\":23975,\"start\":23958},{\"end\":26893,\"start\":26864},{\"end\":29284,\"start\":29259},{\"end\":30021,\"start\":29989},{\"end\":31221,\"start\":31180},{\"end\":32315,\"start\":32288},{\"end\":32345,\"start\":32318},{\"end\":34522,\"start\":34489},{\"end\":37430,\"start\":37413},{\"end\":38237,\"start\":38210},{\"end\":38254,\"start\":38240},{\"end\":39572,\"start\":39556},{\"end\":41487,\"start\":41459},{\"end\":41504,\"start\":41490},{\"end\":48000,\"start\":47979},{\"end\":48833,\"start\":48823},{\"end\":54297,\"start\":54268},{\"end\":59701,\"start\":59685},{\"end\":60671,\"start\":60663},{\"end\":60811,\"start\":60803},{\"end\":61064,\"start\":61056},{\"end\":61372,\"start\":61364},{\"end\":61446,\"start\":61438},{\"end\":61571,\"start\":61563},{\"end\":61863,\"start\":61855},{\"end\":62939,\"start\":62921},{\"end\":62992,\"start\":62972},{\"end\":63112,\"start\":63103},{\"end\":63238,\"start\":63218}]", "table": "[{\"end\":63216,\"start\":63116}]", "figure_caption": "[{\"end\":60801,\"start\":60673},{\"end\":61054,\"start\":60813},{\"end\":61362,\"start\":61066},{\"end\":61436,\"start\":61374},{\"end\":61561,\"start\":61448},{\"end\":61853,\"start\":61573},{\"end\":62029,\"start\":61865},{\"end\":62919,\"start\":62032},{\"end\":62970,\"start\":62941},{\"end\":63101,\"start\":62995},{\"end\":63324,\"start\":63241},{\"end\":63592,\"start\":63327}]", "figure_ref": "[{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":9554,\"start\":9548},{\"attributes\":{\"ref_id\":\"fig_1\"},\"end\":12748,\"start\":12742},{\"attributes\":{\"ref_id\":\"fig_2\"},\"end\":15451,\"start\":15445},{\"end\":18760,\"start\":18754},{\"end\":19482,\"start\":19476},{\"attributes\":{\"ref_id\":\"fig_3\"},\"end\":28641,\"start\":28635},{\"end\":29985,\"start\":29973},{\"attributes\":{\"ref_id\":\"fig_3\"},\"end\":35357,\"start\":35351},{\"attributes\":{\"ref_id\":\"fig_4\"},\"end\":36160,\"start\":36151},{\"end\":36996,\"start\":36979},{\"attributes\":{\"ref_id\":\"fig_4\"},\"end\":37355,\"start\":37346},{\"attributes\":{\"ref_id\":\"fig_5\"},\"end\":38432,\"start\":38426},{\"attributes\":{\"ref_id\":\"fig_5\"},\"end\":40416,\"start\":40407},{\"attributes\":{\"ref_id\":\"fig_5\"},\"end\":40905,\"start\":40896},{\"attributes\":{\"ref_id\":\"fig_6\"},\"end\":49214,\"start\":49208},{\"end\":56319,\"start\":56313}]", "bib_author_first_name": "[{\"end\":65272,\"start\":65271},{\"end\":65283,\"start\":65282},{\"end\":65292,\"start\":65291},{\"end\":65294,\"start\":65293},{\"end\":65307,\"start\":65306},{\"end\":65309,\"start\":65308},{\"end\":65696,\"start\":65695},{\"end\":65707,\"start\":65706},{\"end\":65713,\"start\":65712},{\"end\":65722,\"start\":65721},{\"end\":65988,\"start\":65987},{\"end\":65990,\"start\":65989},{\"end\":66000,\"start\":65999},{\"end\":66002,\"start\":66001},{\"end\":66249,\"start\":66248},{\"end\":66253,\"start\":66250},{\"end\":66259,\"start\":66258},{\"end\":66268,\"start\":66267},{\"end\":66682,\"start\":66681},{\"end\":66694,\"start\":66693},{\"end\":66705,\"start\":66704},{\"end\":66718,\"start\":66717},{\"end\":66727,\"start\":66726},{\"end\":67100,\"start\":67099},{\"end\":67112,\"start\":67111},{\"end\":67461,\"start\":67460},{\"end\":67463,\"start\":67462},{\"end\":67474,\"start\":67473},{\"end\":67485,\"start\":67484},{\"end\":67495,\"start\":67494},{\"end\":67867,\"start\":67866},{\"end\":67880,\"start\":67879},{\"end\":67889,\"start\":67888},{\"end\":68281,\"start\":68280},{\"end\":68293,\"start\":68292},{\"end\":68302,\"start\":68301},{\"end\":68304,\"start\":68303},{\"end\":68314,\"start\":68313},{\"end\":68671,\"start\":68670},{\"end\":68680,\"start\":68679},{\"end\":68682,\"start\":68681},{\"end\":68692,\"start\":68691},{\"end\":68694,\"start\":68693},{\"end\":69019,\"start\":69018},{\"end\":69333,\"start\":69332},{\"end\":69342,\"start\":69341},{\"end\":69354,\"start\":69353},{\"end\":69367,\"start\":69366},{\"end\":69376,\"start\":69375},{\"end\":69378,\"start\":69377},{\"end\":69694,\"start\":69693},{\"end\":69705,\"start\":69704},{\"end\":69709,\"start\":69706},{\"end\":69720,\"start\":69719},{\"end\":69728,\"start\":69727},{\"end\":69730,\"start\":69729},{\"end\":70118,\"start\":70117},{\"end\":70129,\"start\":70128},{\"end\":70133,\"start\":70130},{\"end\":70144,\"start\":70143},{\"end\":70155,\"start\":70154},{\"end\":70479,\"start\":70478},{\"end\":70491,\"start\":70490},{\"end\":70504,\"start\":70503},{\"end\":70515,\"start\":70514},{\"end\":70517,\"start\":70516},{\"end\":70523,\"start\":70522},{\"end\":70815,\"start\":70814},{\"end\":70825,\"start\":70824},{\"end\":70835,\"start\":70834},{\"end\":71086,\"start\":71085},{\"end\":71088,\"start\":71087},{\"end\":71100,\"start\":71099},{\"end\":71102,\"start\":71101},{\"end\":71112,\"start\":71111},{\"end\":71513,\"start\":71512},{\"end\":71515,\"start\":71514},{\"end\":71525,\"start\":71524},{\"end\":71527,\"start\":71526},{\"end\":71536,\"start\":71535},{\"end\":71544,\"start\":71543},{\"end\":71871,\"start\":71870},{\"end\":71878,\"start\":71877},{\"end\":71889,\"start\":71888},{\"end\":71891,\"start\":71890},{\"end\":71902,\"start\":71901},{\"end\":71904,\"start\":71903},{\"end\":71912,\"start\":71911},{\"end\":72202,\"start\":72201},{\"end\":72213,\"start\":72212},{\"end\":72220,\"start\":72219},{\"end\":72224,\"start\":72221},{\"end\":72235,\"start\":72234},{\"end\":72237,\"start\":72236},{\"end\":72245,\"start\":72244},{\"end\":72618,\"start\":72617},{\"end\":72621,\"start\":72619},{\"end\":72629,\"start\":72628},{\"end\":72640,\"start\":72639},{\"end\":72644,\"start\":72641},{\"end\":73013,\"start\":73012},{\"end\":73016,\"start\":73014},{\"end\":73024,\"start\":73023},{\"end\":73035,\"start\":73034},{\"end\":73037,\"start\":73036},{\"end\":73355,\"start\":73354},{\"end\":73366,\"start\":73365},{\"end\":73373,\"start\":73372},{\"end\":73386,\"start\":73385},{\"end\":73705,\"start\":73704},{\"end\":73707,\"start\":73706},{\"end\":73718,\"start\":73717},{\"end\":73720,\"start\":73719},{\"end\":73728,\"start\":73727},{\"end\":73730,\"start\":73729},{\"end\":73741,\"start\":73740},{\"end\":73743,\"start\":73742},{\"end\":74008,\"start\":74007},{\"end\":74019,\"start\":74018},{\"end\":74032,\"start\":74031},{\"end\":74039,\"start\":74038},{\"end\":74360,\"start\":74359},{\"end\":74364,\"start\":74361},{\"end\":74374,\"start\":74373},{\"end\":74385,\"start\":74384},{\"end\":74387,\"start\":74386},{\"end\":74647,\"start\":74646},{\"end\":74655,\"start\":74654},{\"end\":74666,\"start\":74665},{\"end\":74675,\"start\":74674},{\"end\":75049,\"start\":75048},{\"end\":75062,\"start\":75061},{\"end\":75070,\"start\":75069},{\"end\":75079,\"start\":75078},{\"end\":75391,\"start\":75390},{\"end\":75403,\"start\":75402},{\"end\":75415,\"start\":75414},{\"end\":75428,\"start\":75427},{\"end\":75437,\"start\":75436},{\"end\":75771,\"start\":75770},{\"end\":76019,\"start\":76018},{\"end\":76026,\"start\":76025},{\"end\":76326,\"start\":76325},{\"end\":76328,\"start\":76327},{\"end\":76622,\"start\":76621},{\"end\":76626,\"start\":76623},{\"end\":76998,\"start\":76997},{\"end\":77010,\"start\":77009},{\"end\":77020,\"start\":77019},{\"end\":77268,\"start\":77267},{\"end\":77279,\"start\":77278},{\"end\":77525,\"start\":77524},{\"end\":77527,\"start\":77526},{\"end\":77536,\"start\":77535},{\"end\":77538,\"start\":77537},{\"end\":78195,\"start\":78194},{\"end\":78197,\"start\":78196},{\"end\":78208,\"start\":78207},{\"end\":78515,\"start\":78514}]", "bib_author_last_name": "[{\"end\":65280,\"start\":65273},{\"end\":65289,\"start\":65284},{\"end\":65304,\"start\":65295},{\"end\":65312,\"start\":65310},{\"end\":65704,\"start\":65697},{\"end\":65710,\"start\":65708},{\"end\":65719,\"start\":65714},{\"end\":65732,\"start\":65723},{\"end\":65997,\"start\":65991},{\"end\":66011,\"start\":66003},{\"end\":66256,\"start\":66254},{\"end\":66265,\"start\":66260},{\"end\":66272,\"start\":66269},{\"end\":66691,\"start\":66683},{\"end\":66702,\"start\":66695},{\"end\":66715,\"start\":66706},{\"end\":66724,\"start\":66719},{\"end\":66734,\"start\":66728},{\"end\":67109,\"start\":67101},{\"end\":67117,\"start\":67113},{\"end\":67471,\"start\":67464},{\"end\":67482,\"start\":67475},{\"end\":67492,\"start\":67486},{\"end\":67502,\"start\":67496},{\"end\":67877,\"start\":67868},{\"end\":67886,\"start\":67881},{\"end\":67896,\"start\":67890},{\"end\":68290,\"start\":68282},{\"end\":68299,\"start\":68294},{\"end\":68311,\"start\":68305},{\"end\":68325,\"start\":68315},{\"end\":68677,\"start\":68672},{\"end\":68689,\"start\":68683},{\"end\":68701,\"start\":68695},{\"end\":69029,\"start\":69020},{\"end\":69339,\"start\":69334},{\"end\":69351,\"start\":69343},{\"end\":69364,\"start\":69355},{\"end\":69373,\"start\":69368},{\"end\":69385,\"start\":69379},{\"end\":69702,\"start\":69695},{\"end\":69717,\"start\":69710},{\"end\":69725,\"start\":69721},{\"end\":69739,\"start\":69731},{\"end\":70126,\"start\":70119},{\"end\":70141,\"start\":70134},{\"end\":70152,\"start\":70145},{\"end\":70160,\"start\":70156},{\"end\":70488,\"start\":70480},{\"end\":70501,\"start\":70492},{\"end\":70512,\"start\":70505},{\"end\":70520,\"start\":70518},{\"end\":70532,\"start\":70524},{\"end\":70822,\"start\":70816},{\"end\":70832,\"start\":70826},{\"end\":70843,\"start\":70836},{\"end\":71097,\"start\":71089},{\"end\":71109,\"start\":71103},{\"end\":71121,\"start\":71113},{\"end\":71522,\"start\":71516},{\"end\":71533,\"start\":71528},{\"end\":71541,\"start\":71537},{\"end\":71550,\"start\":71545},{\"end\":71875,\"start\":71872},{\"end\":71886,\"start\":71879},{\"end\":71899,\"start\":71892},{\"end\":71909,\"start\":71905},{\"end\":71919,\"start\":71913},{\"end\":72210,\"start\":72203},{\"end\":72217,\"start\":72214},{\"end\":72232,\"start\":72225},{\"end\":72242,\"start\":72238},{\"end\":72252,\"start\":72246},{\"end\":72626,\"start\":72622},{\"end\":72637,\"start\":72630},{\"end\":72651,\"start\":72645},{\"end\":73021,\"start\":73017},{\"end\":73032,\"start\":73025},{\"end\":73044,\"start\":73038},{\"end\":73363,\"start\":73356},{\"end\":73370,\"start\":73367},{\"end\":73383,\"start\":73374},{\"end\":73397,\"start\":73387},{\"end\":73715,\"start\":73708},{\"end\":73725,\"start\":73721},{\"end\":73738,\"start\":73731},{\"end\":73751,\"start\":73744},{\"end\":74016,\"start\":74009},{\"end\":74029,\"start\":74020},{\"end\":74036,\"start\":74033},{\"end\":74045,\"start\":74040},{\"end\":74371,\"start\":74365},{\"end\":74382,\"start\":74375},{\"end\":74392,\"start\":74388},{\"end\":74652,\"start\":74648},{\"end\":74663,\"start\":74656},{\"end\":74672,\"start\":74667},{\"end\":74682,\"start\":74676},{\"end\":75059,\"start\":75050},{\"end\":75067,\"start\":75063},{\"end\":75076,\"start\":75071},{\"end\":75086,\"start\":75080},{\"end\":75400,\"start\":75392},{\"end\":75412,\"start\":75404},{\"end\":75425,\"start\":75416},{\"end\":75434,\"start\":75429},{\"end\":75444,\"start\":75438},{\"end\":75782,\"start\":75772},{\"end\":76023,\"start\":76020},{\"end\":76033,\"start\":76027},{\"end\":76337,\"start\":76329},{\"end\":76633,\"start\":76627},{\"end\":77007,\"start\":76999},{\"end\":77017,\"start\":77011},{\"end\":77031,\"start\":77021},{\"end\":77276,\"start\":77269},{\"end\":77289,\"start\":77280},{\"end\":77533,\"start\":77528},{\"end\":77546,\"start\":77539},{\"end\":78205,\"start\":78198},{\"end\":78215,\"start\":78209},{\"end\":78522,\"start\":78516}]", "bib_entry": "[{\"attributes\":{\"id\":\"b0\",\"matched_paper_id\":7569188},\"end\":65607,\"start\":65162},{\"attributes\":{\"id\":\"b1\",\"matched_paper_id\":8641106},\"end\":65985,\"start\":65609},{\"attributes\":{\"id\":\"b2\"},\"end\":66149,\"start\":65987},{\"attributes\":{\"id\":\"b3\",\"matched_paper_id\":2338131},\"end\":66584,\"start\":66151},{\"attributes\":{\"id\":\"b4\",\"matched_paper_id\":15860710},\"end\":67013,\"start\":66586},{\"attributes\":{\"id\":\"b5\",\"matched_paper_id\":2497009},\"end\":67359,\"start\":67015},{\"attributes\":{\"id\":\"b6\",\"matched_paper_id\":10150220},\"end\":67770,\"start\":67361},{\"attributes\":{\"id\":\"b7\",\"matched_paper_id\":1172520},\"end\":68207,\"start\":67772},{\"attributes\":{\"id\":\"b8\",\"matched_paper_id\":16055815},\"end\":68614,\"start\":68209},{\"attributes\":{\"id\":\"b9\",\"matched_paper_id\":52455760},\"end\":68956,\"start\":68616},{\"attributes\":{\"id\":\"b10\",\"matched_paper_id\":14455177},\"end\":69245,\"start\":68958},{\"attributes\":{\"id\":\"b11\",\"matched_paper_id\":8438977},\"end\":69650,\"start\":69247},{\"attributes\":{\"id\":\"b12\",\"matched_paper_id\":7220856},\"end\":70020,\"start\":69652},{\"attributes\":{\"id\":\"b13\",\"matched_paper_id\":3005614},\"end\":70441,\"start\":70022},{\"attributes\":{\"id\":\"b14\",\"matched_paper_id\":9320233},\"end\":70741,\"start\":70443},{\"attributes\":{\"id\":\"b15\",\"matched_paper_id\":21663257},\"end\":71036,\"start\":70743},{\"attributes\":{\"id\":\"b16\",\"matched_paper_id\":17657641},\"end\":71395,\"start\":71038},{\"attributes\":{\"id\":\"b17\",\"matched_paper_id\":5163403},\"end\":71808,\"start\":71397},{\"attributes\":{\"id\":\"b18\",\"matched_paper_id\":46966676},\"end\":72147,\"start\":71810},{\"attributes\":{\"id\":\"b19\",\"matched_paper_id\":52289942},\"end\":72550,\"start\":72149},{\"attributes\":{\"id\":\"b20\",\"matched_paper_id\":28122153},\"end\":72944,\"start\":72552},{\"attributes\":{\"id\":\"b21\",\"matched_paper_id\":3961451},\"end\":73282,\"start\":72946},{\"attributes\":{\"id\":\"b22\",\"matched_paper_id\":9933898},\"end\":73702,\"start\":73284},{\"attributes\":{\"id\":\"b23\"},\"end\":73933,\"start\":73704},{\"attributes\":{\"id\":\"b24\",\"matched_paper_id\":15622431},\"end\":74298,\"start\":73935},{\"attributes\":{\"id\":\"b25\",\"matched_paper_id\":146076499},\"end\":74577,\"start\":74300},{\"attributes\":{\"id\":\"b26\",\"matched_paper_id\":18592719},\"end\":74978,\"start\":74579},{\"attributes\":{\"id\":\"b27\",\"matched_paper_id\":5709015},\"end\":75332,\"start\":74980},{\"attributes\":{\"id\":\"b28\",\"matched_paper_id\":18211404},\"end\":75718,\"start\":75334},{\"attributes\":{\"id\":\"b29\",\"matched_paper_id\":16162039},\"end\":75957,\"start\":75720},{\"attributes\":{\"id\":\"b30\",\"matched_paper_id\":122419596},\"end\":76224,\"start\":75959},{\"attributes\":{\"id\":\"b31\",\"matched_paper_id\":43761976},\"end\":76540,\"start\":76226},{\"attributes\":{\"id\":\"b32\"},\"end\":76920,\"start\":76542},{\"attributes\":{\"id\":\"b33\",\"matched_paper_id\":42639},\"end\":77222,\"start\":76922},{\"attributes\":{\"id\":\"b34\"},\"end\":77460,\"start\":77224},{\"attributes\":{\"id\":\"b35\",\"matched_paper_id\":10721495},\"end\":77725,\"start\":77462},{\"attributes\":{\"id\":\"b36\"},\"end\":78089,\"start\":77727},{\"attributes\":{\"id\":\"b37\",\"matched_paper_id\":14448971},\"end\":78450,\"start\":78091},{\"attributes\":{\"id\":\"b38\",\"matched_paper_id\":108967814},\"end\":78700,\"start\":78452}]", "bib_title": "[{\"end\":65269,\"start\":65162},{\"end\":65693,\"start\":65609},{\"end\":66246,\"start\":66151},{\"end\":66679,\"start\":66586},{\"end\":67097,\"start\":67015},{\"end\":67458,\"start\":67361},{\"end\":67864,\"start\":67772},{\"end\":68278,\"start\":68209},{\"end\":68668,\"start\":68616},{\"end\":69016,\"start\":68958},{\"end\":69330,\"start\":69247},{\"end\":69691,\"start\":69652},{\"end\":70115,\"start\":70022},{\"end\":70476,\"start\":70443},{\"end\":70812,\"start\":70743},{\"end\":71083,\"start\":71038},{\"end\":71510,\"start\":71397},{\"end\":71868,\"start\":71810},{\"end\":72199,\"start\":72149},{\"end\":72615,\"start\":72552},{\"end\":73010,\"start\":72946},{\"end\":73352,\"start\":73284},{\"end\":74005,\"start\":73935},{\"end\":74357,\"start\":74300},{\"end\":74644,\"start\":74579},{\"end\":75046,\"start\":74980},{\"end\":75388,\"start\":75334},{\"end\":75768,\"start\":75720},{\"end\":76016,\"start\":75959},{\"end\":76323,\"start\":76226},{\"end\":76995,\"start\":76922},{\"end\":77522,\"start\":77462},{\"end\":77823,\"start\":77727},{\"end\":78192,\"start\":78091},{\"end\":78512,\"start\":78452}]", "bib_author": "[{\"end\":65282,\"start\":65271},{\"end\":65291,\"start\":65282},{\"end\":65306,\"start\":65291},{\"end\":65314,\"start\":65306},{\"end\":65706,\"start\":65695},{\"end\":65712,\"start\":65706},{\"end\":65721,\"start\":65712},{\"end\":65734,\"start\":65721},{\"end\":65999,\"start\":65987},{\"end\":66013,\"start\":65999},{\"end\":66258,\"start\":66248},{\"end\":66267,\"start\":66258},{\"end\":66274,\"start\":66267},{\"end\":66693,\"start\":66681},{\"end\":66704,\"start\":66693},{\"end\":66717,\"start\":66704},{\"end\":66726,\"start\":66717},{\"end\":66736,\"start\":66726},{\"end\":67111,\"start\":67099},{\"end\":67119,\"start\":67111},{\"end\":67473,\"start\":67460},{\"end\":67484,\"start\":67473},{\"end\":67494,\"start\":67484},{\"end\":67504,\"start\":67494},{\"end\":67879,\"start\":67866},{\"end\":67888,\"start\":67879},{\"end\":67898,\"start\":67888},{\"end\":68292,\"start\":68280},{\"end\":68301,\"start\":68292},{\"end\":68313,\"start\":68301},{\"end\":68327,\"start\":68313},{\"end\":68679,\"start\":68670},{\"end\":68691,\"start\":68679},{\"end\":68703,\"start\":68691},{\"end\":69031,\"start\":69018},{\"end\":69341,\"start\":69332},{\"end\":69353,\"start\":69341},{\"end\":69366,\"start\":69353},{\"end\":69375,\"start\":69366},{\"end\":69387,\"start\":69375},{\"end\":69704,\"start\":69693},{\"end\":69719,\"start\":69704},{\"end\":69727,\"start\":69719},{\"end\":69741,\"start\":69727},{\"end\":70128,\"start\":70117},{\"end\":70143,\"start\":70128},{\"end\":70154,\"start\":70143},{\"end\":70162,\"start\":70154},{\"end\":70490,\"start\":70478},{\"end\":70503,\"start\":70490},{\"end\":70514,\"start\":70503},{\"end\":70522,\"start\":70514},{\"end\":70534,\"start\":70522},{\"end\":70824,\"start\":70814},{\"end\":70834,\"start\":70824},{\"end\":70845,\"start\":70834},{\"end\":71099,\"start\":71085},{\"end\":71111,\"start\":71099},{\"end\":71123,\"start\":71111},{\"end\":71524,\"start\":71512},{\"end\":71535,\"start\":71524},{\"end\":71543,\"start\":71535},{\"end\":71552,\"start\":71543},{\"end\":71877,\"start\":71870},{\"end\":71888,\"start\":71877},{\"end\":71901,\"start\":71888},{\"end\":71911,\"start\":71901},{\"end\":71921,\"start\":71911},{\"end\":72212,\"start\":72201},{\"end\":72219,\"start\":72212},{\"end\":72234,\"start\":72219},{\"end\":72244,\"start\":72234},{\"end\":72254,\"start\":72244},{\"end\":72628,\"start\":72617},{\"end\":72639,\"start\":72628},{\"end\":72653,\"start\":72639},{\"end\":73023,\"start\":73012},{\"end\":73034,\"start\":73023},{\"end\":73046,\"start\":73034},{\"end\":73365,\"start\":73354},{\"end\":73372,\"start\":73365},{\"end\":73385,\"start\":73372},{\"end\":73399,\"start\":73385},{\"end\":73717,\"start\":73704},{\"end\":73727,\"start\":73717},{\"end\":73740,\"start\":73727},{\"end\":73753,\"start\":73740},{\"end\":74018,\"start\":74007},{\"end\":74031,\"start\":74018},{\"end\":74038,\"start\":74031},{\"end\":74047,\"start\":74038},{\"end\":74373,\"start\":74359},{\"end\":74384,\"start\":74373},{\"end\":74394,\"start\":74384},{\"end\":74654,\"start\":74646},{\"end\":74665,\"start\":74654},{\"end\":74674,\"start\":74665},{\"end\":74684,\"start\":74674},{\"end\":75061,\"start\":75048},{\"end\":75069,\"start\":75061},{\"end\":75078,\"start\":75069},{\"end\":75088,\"start\":75078},{\"end\":75402,\"start\":75390},{\"end\":75414,\"start\":75402},{\"end\":75427,\"start\":75414},{\"end\":75436,\"start\":75427},{\"end\":75446,\"start\":75436},{\"end\":75784,\"start\":75770},{\"end\":76025,\"start\":76018},{\"end\":76035,\"start\":76025},{\"end\":76339,\"start\":76325},{\"end\":76635,\"start\":76621},{\"end\":77009,\"start\":76997},{\"end\":77019,\"start\":77009},{\"end\":77033,\"start\":77019},{\"end\":77278,\"start\":77267},{\"end\":77291,\"start\":77278},{\"end\":77535,\"start\":77524},{\"end\":77548,\"start\":77535},{\"end\":78207,\"start\":78194},{\"end\":78217,\"start\":78207},{\"end\":78524,\"start\":78514}]", "bib_venue": "[{\"end\":65794,\"start\":65768},{\"end\":66052,\"start\":66037},{\"end\":66370,\"start\":66328},{\"end\":66790,\"start\":66769},{\"end\":67560,\"start\":67536},{\"end\":67994,\"start\":67952},{\"end\":68417,\"start\":68378},{\"end\":68791,\"start\":68751},{\"end\":69441,\"start\":69420},{\"end\":69837,\"start\":69795},{\"end\":70570,\"start\":70556},{\"end\":71219,\"start\":71177},{\"end\":71969,\"start\":71949},{\"end\":72350,\"start\":72308},{\"end\":72749,\"start\":72707},{\"end\":73495,\"start\":73453},{\"end\":73796,\"start\":73780},{\"end\":74774,\"start\":74733},{\"end\":75528,\"start\":75493},{\"end\":65354,\"start\":65314},{\"end\":65766,\"start\":65734},{\"end\":66035,\"start\":66013},{\"end\":66326,\"start\":66274},{\"end\":66767,\"start\":66736},{\"end\":67159,\"start\":67119},{\"end\":67534,\"start\":67504},{\"end\":67950,\"start\":67898},{\"end\":68376,\"start\":68327},{\"end\":68749,\"start\":68703},{\"end\":69071,\"start\":69031},{\"end\":69418,\"start\":69387},{\"end\":69793,\"start\":69741},{\"end\":70202,\"start\":70162},{\"end\":70554,\"start\":70534},{\"end\":70861,\"start\":70845},{\"end\":71175,\"start\":71123},{\"end\":71572,\"start\":71552},{\"end\":71947,\"start\":71921},{\"end\":72306,\"start\":72254},{\"end\":72705,\"start\":72653},{\"end\":73086,\"start\":73046},{\"end\":73451,\"start\":73399},{\"end\":73778,\"start\":73753},{\"end\":74087,\"start\":74047},{\"end\":74411,\"start\":74394},{\"end\":74731,\"start\":74684},{\"end\":75128,\"start\":75088},{\"end\":75491,\"start\":75446},{\"end\":75816,\"start\":75784},{\"end\":76067,\"start\":76035},{\"end\":76359,\"start\":76339},{\"end\":76619,\"start\":76542},{\"end\":77047,\"start\":77033},{\"end\":77265,\"start\":77224},{\"end\":77568,\"start\":77548},{\"end\":77871,\"start\":77825},{\"end\":78242,\"start\":78217},{\"end\":78550,\"start\":78524}]"}}}, "year": 2023, "month": 12, "day": 17}