{"id": 221139438, "updated": "2023-10-06 12:31:47.885", "metadata": {"title": "MLBF-Net: A Multi-Lead-Branch Fusion Network for Multi-Class Arrhythmia Classification Using 12-Lead ECG", "authors": "[{\"first\":\"Jing\",\"last\":\"Zhang\",\"middle\":[]},{\"first\":\"Deng\",\"last\":\"Liang\",\"middle\":[]},{\"first\":\"Aiping\",\"last\":\"Liu\",\"middle\":[]},{\"first\":\"Min\",\"last\":\"Gao\",\"middle\":[]},{\"first\":\"Xiang\",\"last\":\"Chen\",\"middle\":[]},{\"first\":\"Xu\",\"last\":\"Zhang\",\"middle\":[]},{\"first\":\"Xun\",\"last\":\"Chen\",\"middle\":[]}]", "venue": "ArXiv", "journal": "ArXiv", "publication_date": {"year": 2020, "month": 8, "day": 17}, "abstract": "Automatic arrhythmia detection using 12-lead electrocardiogram (ECG) signal plays a critical role in early prevention and diagnosis of cardiovascular diseases. In the previous studies on automatic arrhythmia detection, most methods concatenated 12 leads of ECG into a matrix, and then input the matrix to a variety of feature extractors or deep neural networks for extracting useful information. Under such frameworks, these methods had the ability to extract comprehensive features (known as integrity) of 12-lead ECG since the information of each lead interacts with each other during training. However, the diverse lead-specific features (known as diversity) among 12 leads were neglected, causing inadequate information learning for 12-lead ECG. To maximize the information learning of multi-lead ECG, the information fusion of comprehensive features with integrity and lead-specific features with diversity should be taken into account. In this paper, we propose a novel Multi-Lead-Branch Fusion Network (MLBF-Net) architecture for arrhythmia classification by integrating multi-loss optimization to jointly learning diversity and integrity of multi-lead ECG. MLBF-Net is composed of three components: 1) multiple lead-specific branches for learning the diversity of multi-lead ECG; 2) cross-lead features fusion by concatenating the output feature maps of all branches for learning the integrity of multi-lead ECG; 3) multi-loss co-optimization for all the individual branches and the concatenated network. We demonstrate our MLBF-Net on China Physiological Signal Challenge 2018 which is an open 12-lead ECG dataset. The experimental results show that MLBF-Net obtains an average $F_1$ score of 0.855, reaching the highest arrhythmia classification performance. The proposed method provides a promising solution for multi-lead ECG analysis from an information fusion perspective.", "fields_of_study": "[\"Engineering\",\"Computer Science\"]", "external_ids": {"arxiv": "2008.07263", "mag": "3049101303", "acl": null, "pubmed": "33777544", "pubmedcentral": "7963211", "dblp": "journals/corr/abs-2008-07263", "doi": "10.1109/jtehm.2021.3064675"}}, "content": {"source": {"pdf_hash": "dd7ef589d1d9c22a835b3741bac9a47378c242ad", "pdf_src": "Arxiv", "pdf_uri": "[\"https://arxiv.org/pdf/2008.07263v1.pdf\"]", "oa_url_match": false, "oa_info": {"license": "CCBYNCND", "open_access_url": "https://ieeexplore.ieee.org/ielx7/6221039/9246949/09373359.pdf", "status": "GOLD"}}, "grobid": {"id": "9d7b37fcb029023636bba81190459d3870ca17bd", "type": "plain-text", "url": "s3://ai2-s2-pdf-extraction-prod/parse-results/s2orc_worker/dd7ef589d1d9c22a835b3741bac9a47378c242ad.txt", "contents": "\nMLBF-Net: A Multi-Lead-Branch Fusion Network for Multi-Class Arrhythmia Classification Using 12-Lead ECG\n\n\nJing Zhang \nDeng Liang \nAiping Liu \nMin Gao \nXiang Chen \nXu Zhang \nXun Chen \nMLBF-Net: A Multi-Lead-Branch Fusion Network for Multi-Class Arrhythmia Classification Using 12-Lead ECG\n1Index Terms-arrhythmia classificationmulti-lead ECGco- optimizationdeep learning\nAutomatic arrhythmia detection using 12-lead electrocardiogram (ECG) signal plays a critical role in early prevention and diagnosis of cardiovascular diseases. In the previous studies on automatic arrhythmia detection, most methods concatenated 12 leads of ECG into a matrix, and then input the matrix to a variety of feature extractors or deep neural networks for extracting useful information. Under such frameworks, these methods had the ability to extract comprehensive features (known as integrity) of 12-lead ECG since the information of each lead interacts with each other during training. However, the diverse lead-specific features (known as diversity) among 12 leads were neglected, causing inadequate information learning for 12lead ECG. To maximize the information learning of multi-lead ECG, the information fusion of comprehensive features with integrity and lead-specific features with diversity should be taken into account. In this paper, we propose a novel Multi-Lead-Branch Fusion Network (MLBF-Net) architecture for arrhythmia classification by integrating multi-loss optimization to jointly learning diversity and integrity of multi-lead ECG. MLBF-Net is composed of three components: 1) multiple lead-specific branches for learning the diversity of multi-lead ECG; 2) crosslead features fusion by concatenating the output feature maps of all branches for learning the integrity of multi-lead ECG; 3) multi-loss co-optimization for all the individual branches and the concatenated network. We demonstrate our MLBF-Net on China Physiological Signal Challenge 2018 which is an open 12lead ECG dataset. The experimental results show that MLBF-Net obtains an average F1 score of 0.855, reaching the highest arrhythmia classification performance. The proposed method provides a promising solution for multi-lead ECG analysis from an information fusion perspective.\n\ncardiac deaths and about 80% of these are caused by cardiac arrhythmia [2]. Electrocardiogram (ECG) is a widely accessed, non-invasive, and inexpensive tool for arrhythmia diagnosis in clinic. It records the heart's electrical activities over time through electrodes attached to the skin surface. Recently, intelligent healthcare has become increasingly prominent. Automatic arrhythmia detection based on ECG could assist doctors in clinical practice, and also provide ordinary people with daily monitoring using wearable devices. Therefore, how to promote the accuracy of automatic arrhythmia detection is a critical issue.\n\nOver the last decades, a large number of traditional ECG classification methods have been developed. Traditional methods primarily comprise three procedures involving preprocessing (e.g. denoising and heartbeat segmentation), feature extraction, and classification. Of these, feature extraction is the most crucial step, which relies on professional knowledge to construct a set of hand-craft features. In recent years, deep learning has made great success in the field of healthcare with its powerful capability to extract high-level abstract features automatically, avoiding laborious manual feature design. Many studies have designed deep learning-based approaches for arrhythmia detection using ECG signals.\n\nA standard ECG record contains 12 leads (i.e. I, II, III, avR, avL, avF, V1, V2, V3, V4, V5, V6), which is widely used in clinical arrhythmia diagnosis. The 12-lead ECG has two inherent properties: integrity and diversity [3]. On the one hand, the 12-lead ECG signal contains comprehensive information by recording the electrical potential from different spatial angles of the heart. It gives an overall reflection on the heart's condition. Thus, the 12-lead ECG could be treated as an integrated one to make a diagnosis. On the other hand, different leads correspond to different anatomical areas of the heart, providing distinct perspectives. Thus, the ECG signal under each lead contains lead-specific features, and the 12lead ECG signal has diverse information across leads. To maximize information learning for 12-lead ECG, integrity and diversity should be both taken into account. For multi-lead ECG analysis, most existing studies concatenated multi-lead ECG into a matrix, and then input the matrix to a variety of feature extractors or deep neural networks for extracting useful information. However, such approaches lacked explicit mechanisms to realize lead-specific features extraction and only considered comprehensive features extraction of multilead ECG. Furthermore, they were difficult to utilize the adequate information fusion of diversity and integrity to enhance the detecting performance.\n\nTo address the limitations mentioned above, how to fully utilize the diversity and integrity of multi-lead ECG and thereby maximize the information learning is investigated in this paper. The main contributions of this paper are concluded below: 1) We propose a novel Multi-Lead-Branch Fusion Network (MLBF-Net) architecture with multiple branches for arrhythmia classification using 12-lead ECG. For realizing diversity learning, each branch of MLBF-Net is designed to classify the ECG signal under a specific lead, which could learn lead-specific features. Specifically, each branch introduces a hierarchical network structure consisting of the convolutional layers, bidirectional gated recurrent unit (BiGRU), and an attention module to mine the discriminative information further. For realizing integrity learning, the output feature maps from all branches are concatenated to form the concatenated network of MLBF-Net. It is responsible for learning to classify the ECG signal based on all 12 leads, which could extract comprehensive features.\n\n2) We design a collaborative optimization strategy with multiple losses, specialized for all the individual branches and the concatenated network. This strategy not only optimizes comprehensive features of multi-lead ECG, but also realizes lead-specific features learning simultaneously during the training process, which could achieve the information fusion of diversity and integrity.\n\nThe remainder of this paper is arranged as follows. Section II outlines the related works. Section III describes the architecture of the proposed Multi-Lead-Branch Network. Section IV presents the experimental result. Section V gives the discussions. Finally, Section VI summaries this paper.\n\n\nII. RELATED WORKS\n\nTraditional ECG classification methods designed a number of hand-craft features. Typical hand-craft features include statistical features [4]- [6], P-QRS-T features [7]- [9], morphological features [9]- [12], and wavelet features [13]- [16]. Also, mathematical transformations that transform the high-dimensional ECG signal into a lower-dimensional space can be used for extracting meaningful information, such as independent component analysis (ICA) [17]- [19], principal component analysis (PCA) [19]- [21], and linear discriminant analysis (LDA) [19], [21]. Following feature extraction, a variety of classifiers are carried out to classify the extracted features. This can be implemented by artificial neural network (ANN) [8], [13], support vector machine (SVM) [4], [12], [14], [16], k nearest neighbor (KNN) [10], [17], decision tree [15], [17] and bayesian classifier [9], [12].\n\nDeep learning is increasingly predominant in recent studies on ECG classification. Convolutional neural networks (CNNs) are a commonly adopted type of deep neural network due to its effectiveness in extracting features. Kiranyaz et al. [22] designed an adaptive CNN for patient-specific ECG heartbeat classification, which incorporates traditional feature extraction and classification into a single learning structure. Rahhal et al. [23] transformed ECG signals to image-like representations using continuous wavelet transform, and then fed these representations into a deep CNN pretrained on ImageNet with a large number of annotated images, which achieved a good detection performance for supraventricular ectopic beats and ventricular ectopic beats. Rajpurkar et al. [24] presented a 34-layer residual CNN with a cardiologistlevel accuracy in detecting twelve cardiac arrhythmias. In other studies, the ECG signal was viewed as a time-series and recurrent neural network (RNN) specialized for tackling sequential data was adopted. The representative variants of RNN include long short-term memory (LSTM) and gated recurrent unit (GRU). Saadatnejad et al. [25] developed a realtime heartbeat classification algorithm for personal wearable devices based on multiple LSTMs and wavelet transform. Lynn et al. [26] proposed a deep bidirectional GRU network for classifying biometric ECG signals. Further, many research works have designed hierarchical networks by stacking CNN and RNN. He et al. [27] stacked a deep residual CNN and a bidirectional LSTM layer for arrhythmia classification, and obtained a good performance. Yao et al. [28] classified multiclass arrhythmias using an integrated model consisting of VGGNet-based CNN and varied-length LSTMs, which allows for varied-length signal input and is effective in detecting paroxysmal arrhythmias.\n\nRecently, Liu et al. [3] proposed a multiple-feature-branch convolutional neural network (MFB-CNN) for myocardial infarction detection using 12-lead ECG, aiming at exploiting both integrity and diversity. Particularly, 12 ECG leads were input into different branches of MFB-CNN for learning lead-specific features; a fully connected layer was used to summarize the output feature map of 12 feature branches, utilizing the integrity. However, the parameters of MFB-CNN were optimized by only a single loss function in an endto-end way. This single-loss training strategy is unable to fully exploit the specific information of each individual branch in an isolated way, since the classification loss of training samples is backwardly propagated to all 12 branches [29]. Therefore, diversity learning is weakened significantly. In [30], Liu et al. refined the network architecture of MFB-CNN, in which the fully connected layer was replaced by LSTM for summarizing all the branches. In addition, several branches were randomly deactivated at each training iteration for improving the generalization of the model. Nevertheless, as with [3], the deficiency in diversity learning still exists. Currently, the existing works have not achieved joint learning for the diversity and integrity of multi-lead ECG. In other words, the fusion of diversity and integrity to maximize the information learning of multi-lead ECG is worthy of further investigation.\n\n\nIII. METHODS\n\n\nA. Model Overview\n\nThe proposed Multi-Lead-Branch Fusion Network (MLBF-Net) is illustrated in Fig. 1. It is mainly composed of three components: 1) multiple lead-specific branches for learning the diversity of multi-lead ECG; 2) cross-lead features fusion by concatenating the output feature maps of all branches for  learning the integrity of multi-lead ECG; 3) multi-loss cooptimization for all the individual branches and the concatenated network. These three components are described in detail below.\n\n\nB. Single Lead-Branch Feature Learning\n\nThe preprocessed 12-lead ECG signals X are split into 12 single leads, denoted as X j ∈ R L×1 , j ∈ {1, 2, ..., 12} where L is the length of the preprocessed signal. X j is then fed into the jth branch. The configuration of all branches is the same. For convenience, we name the single branch network \"BranchNet\", of which the configuration is shown in Table I. BranchNet combines 15 convolutional layers, a bidirectional gated recurrent unit (BiGRU) layer, and an attention module. Its internal behavior can be formulated as:\nf cnnj = CN N (X j ) (1) f BiGRU j = BiGRU (f cnnj ) (2) f attj = Attention(f BiGRU j ) (3)\nwhere CN N , BiGRU , and Attention denote the convolutional neural subnetwork, BiGRU layer, and attention module, respectively. f cnnj , f BiGRU j , and f attj denote the output feature map of these three modules of the jth branch. The cross-entropy loss is employed for training single branch, calculated as:\nL j = − 1 N N i=1 log( exp(p(X (i) j , y (i) )) c exp(p(X (i) j , c)) )(4)\nwhere N is the number of training samples, y (i) is the true label of ith sample, and p(X (i) j , c) denotes the probability that the input X (i) j is predicted as label c. By minimizing the crossentropy loss function during training, lead-specific features are iteratively optimized for achieving diversity learning.\n\nConvolutional Neural Subnetwork: As shown in Table I, the convolutional neural subnetwork is composed of 5 convolutional blocks, with a total of 15 convolutional layers. Each convolution block includes three convolution layers, together with a dropout [31] layer. The output of each convolutional layer is nonlinear transformed by a leaky rectified linear unit (LeakyReLU) activation function, where the operation is omitted for brevity in Table I. Although ReLU [32] is a more common choice, LeakyReLU [33] is applied due to the ability to avoid the dead neurons problem. To mitigate the neural network from overfitting, the dropout rate is set to 0.2.\n\nBidirectional GRU: The output feature map f cnn of convolutional neural subnetwork flows into a bidirectional GRU layer. GRU [34] and LSTM [35] are the evolutionary implementations of RNN. We select GRU since it has similar performance to LSTM but with less computational complexity. As illustrated in Fig. 2, the bidirectional GRU consists of a forward GRU and a backward GRU, which read the timeseries feature map in the temporal and anti-temporal directions, respectively. At time t, the forward GRU aggregates the information of f cnn from 1 to t and the backward GRU aggregates the information of f cnn from T to t. In our model, T equals 469, which is the time length of f cnn . The features from both opposite directions are incorporated by the bidirectional GRU to obtain the contextual information. Note that we achieve the incorporation by concatenation operation, summarizing the features centered around time t. In our experiments, the unit number of the bidirectional GRU layer is configured to 12, meaning that the dimension for each time step is 12.\n\nAttention Module: Different ECG components such as P wave, QRS complex wave, and ST-segment contribute differentially to the pathological information of the whole ECG segment. Hence, attention mechanism [36] is introduced to extract the informative segments and merge the representation of these important segments. This process is formulated as:\nu jt = tanh(W w f BiGRUjt + b w )(5)α jt = exp(u T jt u w ) t exp(u T jt u w )(6)f attj = t α jt f BiGRUjt(7)\nThat is, the encoded ECG signal f BiGRUjt is fed into a one-layer multilayer perceptron to obtain u jt as a hidden representation of f BiGRUjt . Then the similarity of u jt and a trainable vector u w is measured and a normalized importance weight vector α jt is obtained through a softmax function. Afterwards, the weighted sum of the encoded ECG signal f BiGRUjt and its corresponding weight vector α jt is computed to get the weighted representation f attj . W w , u w , and b w are randomly initialized trainable parameters.\n\n\nC. Multi-Lead Feature Fusion Learning\n\nFor learning complementary cross-lead information and providing more robust diagnosis, we fuse the features extracted from each lead by concatenating the lead-specific feature maps f BiGRU j of all branches in channel axis:\nF = Cat(f BiGRU 1 , f BiGRU 2 , ..., f BiGRU 12 )(8)\nThen the concatenated feature map F is fed through the same attention module used in BranchNet to build the concatenated network. The concatenated network shares the feature maps from the input X j to the output f BiGRU j of BiGRU layer with each branch for obtaining the comprehensive prediction based on 12-lead ECG. Similar to single lead-branch training, a cross-entropy loss is also employed to train the concatenated network, calculated as:\nL c = − 1 N N i=1 log( exp(p(X (i) , y (i) )) c exp(p(X (i) , c)) )(9)\nwhere p(X (i) , c) denotes the probability that the input X (i) is predicted as label c.\n\n\nD. Joint Optimization with Multiple Losses\n\nIt is noted that lead-specific branches are interrelated rather than independent. In order to jointly learning the diversity and integrity of multi-lead ECG, we design multiple dedicated losses for collaboratively optimizing multiple branches and the concatenated network. The loss for each branch is designed to optimize lead-specific features for maximizing the discriminative capability of single-lead ECG, and the loss for the concatenated network aims to optimize multi-lead comprehensive features simultaneously. For the training of the whole model, the final loss function is defined as:\nL = L c + λ(L 1 + ... + L 12 )(10)\nwhere λ is a balance parameter used for determining the importance ratio between diversity and integrity, which is set to 1 in our experiments. L c and L j are the cross-entropy losses of the concatenated network and the jth branch, respectively. The co-optimization strategy not only optimizes multi-lead comprehensive features, but also realizes lead-specific features learning simultaneously during the training process. Compared with the regular single-loss learning, this strategy achieves the information fusion of diversity and integrity, thereby promoting the maximum of multi-lead ECG information learning.\n\n\nIV. EXPERIMENT\n\nThe proposed method is performed using Python language and Keras 2.2.4 framework. All experiments in this paper were run on a server with Xeon E5 2620 CPU, 128GB memory and four GeForce RTX cards.  \n\n\nA. Data Description\n\nChina Physiological Signal Challenge 2018 (CPSC 2018) provides 12-lead ECG records, which is suitable for multilead ECG analysis. The proposed network was trained using the public dataset of CPSC 2018, and evaluated on the private test set that is inaccessible for researchers to ensure a fair comparison. The ECG records were acquired from 11 hospitals. The sampling rate is 500Hz. The public dataset includes 6877 12-lead ECG records varying in length from 6 to 60 seconds, and the test set includes 2954 12-lead ECG records of similar lengths. The details of the public database can be found in Table II, with a total of 9 ECG classes containing normal rhythm and 8 types of arrhythmias. Figure 3 gives an example of a 12-lead ECG record. More details about CPSC 2018 database can be seen in [37].\n\n\nB. Evaluation Metric\n\nIn this research, F 1 score is used to measure the model's classification performance for each class. It is the harmonic mean of precision and recall, defined as:\nP recision = T P T P + F P (11) Recall = T P T P + F N (12) F 1 = 2 × (P recision × Recall) P recision + Recall(13)\nThe terms TP, FP, and FN refer to the sample number of true positive, false positive, and false negative, respectively. The average of F 1 scores for all classes, namely macro-F 1 score, is computed to make a final evaluation.\n\nC. Implementation Details 1) Preprocessing: Similar to our previous work [42], the preprocessing for the original ECG signal includes two procedures: downsampling and cropping or padding. In the first step, the downsampling from 500Hz to 250Hz was performed to speed up the training. In the second step, the downsampled ECG signals were cropped or padded with zeros to the same length because convolutional neural networks do not accept varied-length input. In our setting, 60 seconds was the target length. It means that the signals longer than 60 seconds were cropped and those less than 60 seconds were padded with zero.\n\n2) Training Setting: We trained the proposed model in an end-to-end way. The preprocessed training data was grouped into batches of 64 samples to fed into MLBF-Net. We set 64 to batch size by tuning this hyperparameter. The batched updating of network parameters takes less memory and is more computationally efficient. More importantly, a more robust convergence can be obtained by mini-batch, averting local minima. We applied adaptive moment estimation (Adam) optimizer [44] to update the weights of the whole model iteratively with a fixed learning rate of 0.001. Adam, which updates weights based on exponential decaying averages of past gradients and past squared gradients, is usually considered to converge to an excellent performance [45].   In order to alleviate the proposed model overfitting during the training process, another two strategies were adopted in addition to dropout layers of the network structure. The first strategy is earlystopping, which stops training if the classification performance of the model on validation data remains unimproved up to 50 epochs. The best-performing model was saved. The second strategy is that we set macro-F 1 score of validation data as the stopping criterion. Different from the accuracy metric that is dominated by the classes with more samples, macro-F 1 score is an unbiased metric towards unbalanced ECG classes. Table III shows the classification performance of the proposed method, and makes a comparison with eight previous works in detail. To ensure a fair comparison, our models were evaluated on the private test set of CPSC 2018 that is also used in the evaluation of these works. In order to provide a more robust prediction, We applied 10-fold cross validation to get an ensemble model, denoted as Ours 2 . In particular, the public dataset was randomly split into ten subsets, with each subset in turn as validation data and the rest ones as training data. Ten training data sets were separately preprocessed by the above preprocessing operations and then input into the proposed network architecture to obtain ten models. Finally, the prediction probabilities of these models were averaged as the final probabilities. In addition, a single model without ensemble was also evaluated, denoted as Ours 1 .\n\n\nD. Classification Performance\n\n[43] was the first place among CPSC 2018 competitors, where their average F 1 score is 0.837. As shown in Table  III, the proposed method outperforms the existing methods in the average screening capability for 9 types of ECG. It even beats the previous first place by 1.8% average F 1 score, achieving the highest classification performance. It is observed that our model makes a superior diagnosis than other models for Normal, I-AVB, LBBB, RBBB, STD, and STE. Among them, the most significant superiority lies in the identification of Normal and STE, gaining 2.7% (0.82-0.847), 3.7% (0.64-0.677) F 1 score increase than the previous best-performing ones, respectively.\n\n\nV. DISCUSSION\n\n\nA. Ablation Studies\n\nTo verify the effectiveness of main components in MLBF-Net, we also evaluated several variants of the network. The following experiments involved in the Discussion section were evaluated through 10-fold cross validation, not the private test set. Unlike the experiment conducted in the Experiment section, the public dataset was randomly divided into ten subsets, with each subset taking turns as the test set. The remaining records were further divided into training data and validation data, of which 11.12% was as validation data. Finally, the ratio of training data, validation data, and test data in each fold is 8: 1: 1.\n\n1) Single-Branch Framework vs. Multi-Branch Framework: When dealing with multi-lead ECG signals, the regular frameworks are that multi-lead ECG is concatenated into an integrated matrix and then input into a feature extractor or deep neural network. They can be regarded as single-branch. Despite the simplicity of such network frameworks, the diversity of multi-lead ECG signal is neglected. To analyze the effect of multi-lead diversity, we take the BranchNet to classify 12-lead ECG signals. Table IV shows the performances of BranchNet with a single branch against MLBF-Net with multiple branches. In terms of network architecture, BranchNet is a branch of MLBF-Net, but it should be noted that in this experiment, the input to BranchNet is 12-lead ECG signals, not single-lead ones. We can observe that multi-branch model is far superior to single-branch model for all classes in the F 1 score, gaining 3.7% increase in the average F 1 score. It is proved that lead-specific features do considerably improve the classification performance of MLBF-Net.\n\n2) Single-Loss Optimization vs. Multi-Loss Optimization: The hyperparameter λ governs the participation rate of leadspecific features in our model. Here, we conducted some experiments to explore the sensitiveness of this hyperparameter. The first experiment was implemented for evaluating the effectiveness of the multi-loss co-optimization strategy, in which the attention modules from all branches are removed. These attention modules are used to generate lead-specific features that correspond to all branch losses. Finally, we only keep the loss for the concatenated network. Table V shows the above experimental result. It is observed that multi-loss co-optimization improves the F 1 score by 2.4% (0.828-0.852). Furthermore, extra experiments were conducted to analyze the effect of different participate rates of lead-specific features by setting λ from 0 to 10 in our model. As we can see from Table  V, the classification performance is highest on the condition that lead-specific features with diversity and comprehensive features with integrity are equally important (λ=1). When either of lead-specific features and comprehensive features is more predominant, the classification performance is slightly worse than that of their equal participation rate. It is clear that the arrhythmia detection performance is significantly improved through multi-loss co-optimization to jointly learning diversity and integrity.\n\n\nB. Visualization of Learned Features\n\nThe t-distributed stochastic neighbor embedding (t-SNE) [46] visualizes high dimensional data in a two or threedimensional map. Here, we introduced t-SNE algorithm to evaluate the proposed method visually. The attention modules in each branch and the concatenated network output the 24dimensional features. These features are as the input of t-SNE to visualize the performance of learned the comprehensive features and lead-specific features, shown in 4a and Fig. 4b-4m. As we can see from Fig. 4b-4m, the dots of different colors represent the extracted features of different types of ECG signals with varying degrees of overlap, meaning that only lead-specific features of a single lead are incapable of distinguishing multi-class arrhythmias well. Due to the small number of STE samples, the purple dots representing STE are difficult to observe. Excluding STE, the heaviest overlapping is in distinguishing STD from Normal signals, probably because the tiny changes in ST-segment are prone to be contaminated by various noises. In Fig. 4a, the colorful dots are separated obviously. Thus, the features learned by multi-branch with multiloss co-optimization are discriminative for classifying 9 ECG classes. It can be observed from this figure that the yellow dots representing RBBB have two clusters, possibly because the used dataset contains both complete RBBB and incomplete RBBB in which QRS complex durations are different.\n\n\nC. Model Parameter\n\nIn this subsection, the parameter amount of the proposed MLBF-Net is analyzed, shown in Table. VI. The multi-branch architecture seems to introduce a large number of parameters exponentially. In fact, our model is still lightweight in comparison with many previous deep learning-based studies for arrhythmia detection. In [24], the comparable performance to cardiologists was reported for the identification of 12 types of arrhythmias by using a 34-layer ResNet. However, the training parameters were as high as about 10.47 million. Yao et al. [40] evaluated their proposed method on the same independent test set as ours, and obtained a F 1 score of 0.812. In their study, the parameters were about 4.98 million. As calculated in Table. VI, only 0.42 million parameters need to be trained in our model, realizing a tens of times parameter reduction than [24] and [40].\n\nVI. CONCLUSION In this paper, we propose a novel end-to-end Multi-Lead-Branch Fusion Network (MLBF-Net) for ECG classification using 12-lead ECG records. MLBF-Net fully utilizes the diversity and integrity of multi-lead ECG by integrating multiple losses to optimize lead-specific features and comprehensive the 12-lead features collaboratively. We demonstrate that our MLBF-Net reaches the highest arrhythmia classification performance on China Physiological Signal Challenge 2018 which is an open 12-lead ECG dataset. In addition, compared with many existing deep neural networks, MLBF-Net is a parameter-efficient model that is less prone to overfitting, despite its multiple branches architecture. The proposed model has the advantages of both high screening capability and light weight. Therefore, it has the potential to be applied in clinical applications and daily monitoring.\n\nFig. 1 :\n1The proposed network architecture.\n\nFig. 2 :\n2The illustration for a bidirectional GRU. \"Cat\" is an abbreviation for concatenation operation.\n\nFig. 3 :\n3An example of normal 12-lead ECG record.\n\nBranchNet 0 .\n0809±0.018 0.914±0.017 0.872±0.022 0.882±0.043 0.929±0.019 0.739±0.060 0.872±0.027 0.808±0.033 0.513±0.101 0.815±0.018 MLBF-Net 0.832±0.033 0.932±0.017 0.902±0.025 0.911±0.032 0.944±0.013 0.814±0.051 0.889±0.018 0.834±0.038 0.608±0.126 0.852±0.021\n\nFig. 4 :\n4The t-SNE visualization for the performance of MLBF-Net (a) and each branch (b-m).\n\nTABLE I :\nIThe configuration of each branch.The convolutional layer is represented as Conv(kernel size) (kernel num-\nber). \n\n\n\nTABLE II :\nIIDistribution of ECG classes on the public dataset of CPSC 2018.\n\nTABLE III :\nIIIComparison for classification performance of previous works and ours evaluated on the private test set of CPSC 2018.Work \nYear \nArchitecture \nF 1 score \n\nNormal \n(394) \n\nAF \n(466) \n\nI-AVB \n(295) \n\nLBBB \n(97) \n\nRBBB \n(756) \n\nPAC \n(250) \n\nPVC \n(276) \n\nSTD \n(340) \n\nSTE \n(80) \n\nAverage \n(2954) \n\n[28] \n2018 CNN+LSTM \n0.753 \n0.900 0.809 \n0.874 \n0.922 \n0.638 0.832 0.762 0.462 0.772 \n[38] \n2018 Expert features; CNN \n0.82 \n0.91 \n0.87 \n0.87 \n0.91 \n0.63 \n0.82 \n0.81 \n0.60 \n0.81 \n[27] \n2019 CNN+LSTM \n-\n-\n-\n-\n-\n-\n-\n-\n-\n0.806 \n[39] \n2019 CNN+Attention \n0.79 \n0.93 \n0.85 \n0.86 \n0.93 \n0.75 \n0.85 \n0.80 \n0.56 \n0.813 \n[40] \n2020 CNN+LSTM+Attention \n0.789 \n0.920 0.850 \n0.872 \n0.933 \n0.736 0.861 0.789 0.556 0.812 \n[41] \n2020 Multi-Scaled CNN+Attention \n0.82 \n0.90 \n0.86 \n0.87 \n0.93 \n0.78 \n0.88 \n0.80 \n0.62 \n0.828 \n[42] \n2020 CNN+Attention+BiGRU; Ensemble model \n0.819 \n0.936 \n0.866 \n0.862 \n0.926 \n0.789 0.865 0.812 0.640 0.835 \n[43] \n2020 CNN+BiGRU+Attention; Ensemble model \n0.801 \n0.933 0.875 \n0.884 \n0.910 \n0.826 \n0.869 0.811 0.624 0.837 \nOurs 1 \nMulti-Lead-Branch; CNN+BiGRU+Attention 0.850 \n0.933 \n0.885 \n0.862 \n0.931 \n0.801 0.859 0.820 \n0.646 0.843 \nOurs 2 \nEnsemble model based on Ours 1 \n0.847 \n0.934 0.884 \n0.896 \n0.939 \n0.822 0.878 0.818 \n0.677 0.855 \n\nThe \"-\" indicates the F 1 score was not reported. The number of ECG classes are in parentheses. \nOurs 1 indicates the single model without ensemble. Ours 2 indicates ensemble model. \nThe highest score for each class is in bold. \n\n\n\nTABLE IV :\nIVClassification performance comparison for single-branch and multi-branch frameworks with 12-lead ECG as input \nby 10-fold cross validation (mean±SD). \n\nNetwork \nNormal \nAF \nI-AVB \nLBBB \nRBBB \nPAC \nPVC \nSTD \nSTE \naverage F1 \n\n\n\nTABLE V :\nVClassification performance comparison for singleloss and multi-loss optimization by 10-fold cross validation (mean±SD).Setting \naverage F 1 \n\nsingle loss 0.828±0.021 \nλ=0.1 \n0.837±0.020 \nλ=0.2 \n0.844±0.017 \nλ=0.5 \n0.849±0.017 \nλ=1 \n0.852±0.021 \nλ=2 \n0.843±0.014 \nλ=5 \n0.848±0.023 \nλ=10 \n0.847±0.023 \n\n\n\nTABLE VI :\nVIParameter amount for the proposed model, MLBF-Net.\n\nCardiovascular diseases (CVDs). Cardiovascular diseases (CVDs). [Online]. Available: https://www.who. int/news-room/fact-sheets/detail/cardiovascular-diseases-(cvds)\n\nGlobal public health problem of sudden cardiac death. R Mehra, Journal of electrocardiology. 406R. Mehra, \"Global public health problem of sudden cardiac death,\" Journal of electrocardiology, vol. 40, no. 6, pp. S118-S122, 2007.\n\nMultiple-featurebranch convolutional neural network for myocardial infarction diagnosis using electrocardiogram. W Liu, Q Huang, S Chang, H Wang, J He, Biomedical Signal Processing and Control. 45W. Liu, Q. Huang, S. Chang, H. Wang, and J. He, \"Multiple-feature- branch convolutional neural network for myocardial infarction diagnosis using electrocardiogram,\" Biomedical Signal Processing and Control, vol. 45, pp. 22-32, 2018.\n\nVentricular fibrillation and tachycardia classification using a machine learning approach. Q Li, C Rajagopalan, G D Clifford, IEEE Transactions on Biomedical Engineering. 616Q. Li, C. Rajagopalan, and G. D. Clifford, \"Ventricular fibrillation and tachycardia classification using a machine learning approach,\" IEEE Transactions on Biomedical Engineering, vol. 61, no. 6, pp. 1607-1613, 2013.\n\nEcg heart beat classification method based on modified abc algorithm. S Dilmac, M Korurek, Applied Soft Computing. 36S. Dilmac and M. Korurek, \"Ecg heart beat classification method based on modified abc algorithm,\" Applied Soft Computing, vol. 36, pp. 641- 655, 2015.\n\nAutomated detection of atrial fibrillation based on time-frequency analysis of seismocardiograms. T Hurnanen, E Lehtonen, M J Tadi, T Kuusela, T Kiviniemi, A Saraste, T Vasankari, J Airaksinen, T Koivisto, M Pänkäälä, IEEE journal of biomedical and health informatics. 215T. Hurnanen, E. Lehtonen, M. J. Tadi, T. Kuusela, T. Kiviniemi, A. Saraste, T. Vasankari, J. Airaksinen, T. Koivisto, and M. Pänkäälä, \"Automated detection of atrial fibrillation based on time-frequency analysis of seismocardiograms,\" IEEE journal of biomedical and health informatics, vol. 21, no. 5, pp. 1233-1241, 2016.\n\nAn arrhythmia classification system based on the rr-interval signal. M G Tsipouras, D I Fotiadis, D Sideris, Artificial Intelligence in Medicine. 333M. G. Tsipouras, D. I. Fotiadis, and D. Sideris, \"An arrhythmia classi- fication system based on the rr-interval signal,\" Artificial Intelligence in Medicine, vol. 33, no. 3, pp. 237-250, 2005.\n\nFuzzy clustered probabilistic and multi layered feed forward neural networks for electrocardiogram arrhythmia classification. H H Haseena, A T Mathew, J K Paul, Journal of Medical Systems. 352H. H. Haseena, A. T. Mathew, and J. K. Paul, \"Fuzzy clustered probabilistic and multi layered feed forward neural networks for elec- trocardiogram arrhythmia classification,\" Journal of Medical Systems, vol. 35, no. 2, pp. 179-188, 2011.\n\nOptimization of ecg classification by means of feature selection. T Mar, S Zaunseder, J P Martínez, M Llamedo, R Poll, IEEE transactions on Biomedical Engineering. 588T. Mar, S. Zaunseder, J. P. Martínez, M. Llamedo, and R. Poll, \"Optimization of ecg classification by means of feature selection,\" IEEE transactions on Biomedical Engineering, vol. 58, no. 8, pp. 2168-2177, 2011.\n\nA multi-stage automatic arrhythmia recognition and classification system. Y Kutlu, D Kuntalp, Computers in Biology and Medicine. 411Y. Kutlu and D. Kuntalp, \"A multi-stage automatic arrhythmia recog- nition and classification system,\" Computers in Biology and Medicine, vol. 41, no. 1, pp. 37-45, 2011.\n\nUnsupervised classification of atrial heartbeats using a prematurity index and wave morphology features. J L Rodríguez-Sotelo, D Cuesta-Frau, G Castellanos-Dominguez, Medical & Biological Engineering & Computing. 477J. L. Rodríguez-Sotelo, D. Cuesta-Frau, and G. Castellanos-Dominguez, \"Unsupervised classification of atrial heartbeats using a prematurity in- dex and wave morphology features,\" Medical & Biological Engineering & Computing, vol. 47, no. 7, pp. 731-741, 2009.\n\nHeartbeat classification using disease-specific feature selection. Z Zhang, J Dong, X Luo, K.-S Choi, X Wu, Computers in Biology and Medicine. 46Z. Zhang, J. Dong, X. Luo, K.-S. Choi, and X. Wu, \"Heartbeat classification using disease-specific feature selection,\" Computers in Biology and Medicine, vol. 46, pp. 79-89, 2014.\n\nA new approach to detection of ecg arrhythmias: Complex discrete wavelet transform based complex valued artificial neural network. Y Özbay, Journal of Medical Systems. 336435Y.Özbay, \"A new approach to detection of ecg arrhythmias: Complex discrete wavelet transform based complex valued artificial neural net- work,\" Journal of Medical Systems, vol. 33, no. 6, p. 435, 2009.\n\nA comparative study of dwt, cwt and dct transformations in ecg arrhythmias classification. H Khorrami, M Moavenian, Expert Systems with Applications. 378H. Khorrami and M. Moavenian, \"A comparative study of dwt, cwt and dct transformations in ecg arrhythmias classification,\" Expert Systems with Applications, vol. 37, no. 8, pp. 5751-5757, 2010.\n\nClassification of electrocardiogram and auscultatory blood pressure signals using machine learning models. M Seera, C P Lim, W S Liew, E Lim, C K Loo, Expert Systems with Applications. 427M. Seera, C. P. Lim, W. S. Liew, E. Lim, and C. K. Loo, \"Classification of electrocardiogram and auscultatory blood pressure signals using machine learning models,\" Expert Systems with Applications, vol. 42, no. 7, pp. 3643-3652, 2015.\n\nArrhythmia recognition and classification using combined linear and nonlinear features of ecg signals. F A Elhaj, N Salim, A R Harris, T T Swee, T Ahmed, Computer Methods and Programs in Biomedicine. 127F. A. Elhaj, N. Salim, A. R. Harris, T. T. Swee, and T. Ahmed, \"Arrhythmia recognition and classification using combined linear and nonlinear features of ecg signals,\" Computer Methods and Programs in Biomedicine, vol. 127, pp. 52-63, 2016.\n\nApplication of higher order statistics for atrial arrhythmia classification. R J Martis, U R Acharya, H Prasad, C K Chua, C M Lim, J S Suri, Biomedical signal processing and control. 86R. J. Martis, U. R. Acharya, H. Prasad, C. K. Chua, C. M. Lim, and J. S. Suri, \"Application of higher order statistics for atrial arrhythmia classification,\" Biomedical signal processing and control, vol. 8, no. 6, pp. 888-900, 2013.\n\nAn automatic subjectadaptable heartbeat classifier based on multiview learning. C Ye, B V Kumar, M T Coimbra, IEEE journal of biomedical and health informatics. 206C. Ye, B. V. Kumar, and M. T. Coimbra, \"An automatic subject- adaptable heartbeat classifier based on multiview learning,\" IEEE journal of biomedical and health informatics, vol. 20, no. 6, pp. 1485-1492, 2015.\n\nEcg beat classification using pca, lda, ica and discrete wavelet transform. R J Martis, U R Acharya, L C Min, Biomedical Signal Processing and Control. 85R. J. Martis, U. R. Acharya, and L. C. Min, \"Ecg beat classification using pca, lda, ica and discrete wavelet transform,\" Biomedical Signal Processing and Control, vol. 8, no. 5, pp. 437-448, 2013.\n\nA generic and robust system for automated patient-specific classification of ecg signals. T Ince, S Kiranyaz, M Gabbouj, IEEE Transactions on Biomedical Engineering. 565T. Ince, S. Kiranyaz, and M. Gabbouj, \"A generic and robust system for automated patient-specific classification of ecg signals,\" IEEE Transac- tions on Biomedical Engineering, vol. 56, no. 5, pp. 1415-1426, 2009.\n\nEcg arrhythmia classification using a probabilistic neural network with a feature reduction method. J.-S Wang, W.-C Chiang, Y.-L Hsu, Y.-T C Yang, Neurocomputing. 116J.-S. Wang, W.-C. Chiang, Y.-L. Hsu, and Y.-T. C. Yang, \"Ecg arrhyth- mia classification using a probabilistic neural network with a feature reduction method,\" Neurocomputing, vol. 116, pp. 38-45, 2013.\n\nReal-time patient-specific ecg classification by 1-d convolutional neural networks. S Kiranyaz, T Ince, M Gabbouj, IEEE Transactions on Biomedical Engineering. 633S. Kiranyaz, T. Ince, and M. Gabbouj, \"Real-time patient-specific ecg classification by 1-d convolutional neural networks,\" IEEE Transactions on Biomedical Engineering, vol. 63, no. 3, pp. 664-675, 2015.\n\nConvolutional neural networks for electrocardiogram classification. M M Rahhal, Y Bazi, M Zuair, E Othman, B Benjdira, Journal of Medical and Biological Engineering. 386M. M. Al Rahhal, Y. Bazi, M. Al Zuair, E. Othman, and B. BenJdira, \"Convolutional neural networks for electrocardiogram classification,\" Journal of Medical and Biological Engineering, vol. 38, no. 6, pp. 1014- 1025, 2018.\n\nCardiologist-level arrhythmia detection and classification in ambulatory electrocardiograms using a deep neural network. A Y Hannun, P Rajpurkar, M Haghpanahi, G H Tison, C Bourn, M P Turakhia, A Y Ng, Nature Medicine. 25165A. Y. Hannun, P. Rajpurkar, M. Haghpanahi, G. H. Tison, C. Bourn, M. P. Turakhia, and A. Y. Ng, \"Cardiologist-level arrhythmia detection and classification in ambulatory electrocardiograms using a deep neural network,\" Nature Medicine, vol. 25, no. 1, p. 65, 2019.\n\nLstm-based ecg classification for continuous monitoring on personal wearable devices. S Saadatnejad, M Oveisi, M Hashemi, IEEE journal of biomedical and health informatics. S. Saadatnejad, M. Oveisi, and M. Hashemi, \"Lstm-based ecg classifi- cation for continuous monitoring on personal wearable devices,\" IEEE journal of biomedical and health informatics, 2019.\n\nA deep bidirectional gru network model for biometric electrocardiogram classification based on recurrent neural networks. H M Lynn, S B Pan, P Kim, IEEE Access. 7H. M. Lynn, S. B. Pan, and P. Kim, \"A deep bidirectional gru network model for biometric electrocardiogram classification based on recurrent neural networks,\" IEEE Access, vol. 7, pp. 145 395-145 405, 2019.\n\nAutomatic cardiac arrhythmia classification using combination of deep residual network and bidirectional lstm. R He, Y Liu, K Wang, N Zhao, Y Yuan, Q Li, H Zhang, IEEE Access. 7R. He, Y. Liu, K. Wang, N. Zhao, Y. Yuan, Q. Li, and H. Zhang, \"Automatic cardiac arrhythmia classification using combination of deep residual network and bidirectional lstm,\" IEEE Access, vol. 7, pp. 102 119-102 135, 2019.\n\nTimeincremental convolutional neural network for arrhythmia detection in varied-length electrocardiogram. Q Yao, X Fan, Y Cai, R Wang, L Yin, Y Li, 2018 IEEE 16th Intl Conf on Dependable, Autonomic and Secure Computing, 16th Intl Conf on Pervasive Intelligence and Computing, 4th Intl Conf on Big Data Intelligence and Computing and Cyber Science and Technology Congress. IEEEQ. Yao, X. Fan, Y. Cai, R. Wang, L. Yin, and Y. Li, \"Time- incremental convolutional neural network for arrhythmia detection in varied-length electrocardiogram,\" in 2018 IEEE 16th Intl Conf on Dependable, Autonomic and Secure Computing, 16th Intl Conf on Pervasive Intelligence and Computing, 4th Intl Conf on Big Data In- telligence and Computing and Cyber Science and Technology Congress (DASC/PiCom/DataCom/CyberSciTech). IEEE, 2018, pp. 754-761.\n\nLearning attribute-specific representations for visual tracking. Y Qi, S Zhang, W Zhang, L Su, Q Huang, M.-H Yang, Proceedings of the AAAI Conference on Artificial Intelligence. the AAAI Conference on Artificial Intelligence33Y. Qi, S. Zhang, W. Zhang, L. Su, Q. Huang, and M.-H. Yang, \"Learning attribute-specific representations for visual tracking,\" in Proceedings of the AAAI Conference on Artificial Intelligence, vol. 33, 2019, pp. 8835- 8842.\n\nMfb-cbrnn: A hybrid network for mi detection using 12-lead ecgs. W Liu, F Wang, Q Huang, S Chang, H Wang, J He, IEEE Journal of Biomedical and Health Informatics. 242W. Liu, F. Wang, Q. Huang, S. Chang, H. Wang, and J. He, \"Mfb-cbrnn: A hybrid network for mi detection using 12-lead ecgs,\" IEEE Journal of Biomedical and Health Informatics, vol. 24, no. 2, pp. 503-514, 2020.\n\nDropout: a simple way to prevent neural networks from overfitting. N Srivastava, G Hinton, A Krizhevsky, I Sutskever, R Salakhutdinov, The Journal of Machine Learning Research. 151N. Srivastava, G. Hinton, A. Krizhevsky, I. Sutskever, and R. Salakhut- dinov, \"Dropout: a simple way to prevent neural networks from over- fitting,\" The Journal of Machine Learning Research, vol. 15, no. 1, pp. 1929-1958, 2014.\n\nRectified linear units improve restricted boltzmann machines. V Nair, G E Hinton, Proceedings of the 27th International Conference on Machine Learning (ICML-10). the 27th International Conference on Machine Learning (ICML-10)V. Nair and G. E. Hinton, \"Rectified linear units improve restricted boltz- mann machines,\" in Proceedings of the 27th International Conference on Machine Learning (ICML-10), 2010, pp. 807-814.\n\nRectifier nonlinearities improve neural network acoustic models. A L Maas, A Y Hannun, A Y Ng, Proc. icml. icml303A. L. Maas, A. Y. Hannun, and A. Y. Ng, \"Rectifier nonlinearities improve neural network acoustic models,\" in Proc. icml, vol. 30, no. 1, 2013, p. 3.\n\nLearning phrase representations using rnn encoder-decoder for statistical machine translation. K Cho, B Van Merriënboer, C Gulcehre, D Bahdanau, F Bougares, H Schwenk, Y Bengio, Proceedings of the 2014 Conference on Empirical Methods in Natural Language Processing. the 2014 Conference on Empirical Methods in Natural Language ProcessingK. Cho, B. van Merriënboer, C. Gulcehre, D. Bahdanau, F. Bougares, H. Schwenk, and Y. Bengio, \"Learning phrase representations using rnn encoder-decoder for statistical machine translation,\" in Proceedings of the 2014 Conference on Empirical Methods in Natural Language Processing (EMNLP), 2014, pp. 1724-1734.\n\nLong short-term memory. S Hochreiter, J Schmidhuber, Neural computation. 98S. Hochreiter and J. Schmidhuber, \"Long short-term memory,\" Neural computation, vol. 9, no. 8, pp. 1735-1780, 1997.\n\nHierarchical attention networks for document classification. Z Yang, D Yang, C Dyer, X He, A Smola, E Hovy, Proceedings of the 2016 conference of the North American chapter of the association for computational linguistics: human language technologies. the 2016 conference of the North American chapter of the association for computational linguistics: human language technologiesZ. Yang, D. Yang, C. Dyer, X. He, A. Smola, and E. Hovy, \"Hierarchical attention networks for document classification,\" in Proceedings of the 2016 conference of the North American chapter of the association for computational linguistics: human language technologies, 2016, pp. 1480-1489.\n\nAn open access database for evaluating the algorithms of electrocardiogram rhythm and morphology abnormality detection. F Liu, C Liu, L Zhao, X Zhang, X Wu, X Xu, Y Liu, C Ma, S Wei, Z He, Journal of Medical Imaging and Health Informatics. 87F. Liu, C. Liu, L. Zhao, X. Zhang, X. Wu, X. Xu, Y. Liu, C. Ma, S. Wei, Z. He et al., \"An open access database for evaluating the algorithms of electrocardiogram rhythm and morphology abnormality detection,\" Journal of Medical Imaging and Health Informatics, vol. 8, no. 7, pp. 1368-1373, 2018.\n\nAutomatic identification of abnormalities in 12-lead ecgs using expert features and convolutional neural networks. Z Liu, X Meng, J Cui, Z Huang, J Wu, 2018 International Conference on Sensor Networks and Signal Processing. Z. Liu, X. Meng, J. Cui, Z. Huang, and J. Wu, \"Automatic identification of abnormalities in 12-lead ecgs using expert features and convolutional neural networks,\" in 2018 International Conference on Sensor Networks and Signal Processing (SNSP). IEEE, 2018, pp. 163-167.\n\nMulti-class arrhythmia detection based on neural network with multi-stage features fusion. R Wang, SMCQ Yao, SMCX Fan, SMCY Li, SMC2019 IEEE International Conference on Systems, Man and Cybernetics. R. Wang, Q. Yao, X. Fan, and Y. Li, \"Multi-class arrhythmia detection based on neural network with multi-stage features fusion,\" in 2019 IEEE International Conference on Systems, Man and Cybernetics (SMC).\n\n. IEEE. IEEE, 2019, pp. 4082-4087.\n\nMulti-class arrhythmia detection from 12-lead varied-length ecg using attention-based timeincremental convolutional neural network. Q Yao, R Wang, X Fan, J Liu, Y Li, Information Fusion. 53Q. Yao, R. Wang, X. Fan, J. Liu, and Y. Li, \"Multi-class arrhythmia detection from 12-lead varied-length ecg using attention-based time- incremental convolutional neural network,\" Information Fusion, vol. 53, pp. 174-182, 2020.\n\nDeep multi-scale fusion neural network for multi-class arrhythmia detection. R Wang, J Fan, Y Li, IEEE Journal of Biomedical and Health Informatics. R. Wang, J. Fan, and Y. Li, \"Deep multi-scale fusion neural network for multi-class arrhythmia detection,\" IEEE Journal of Biomedical and Health Informatics, pp. 1-1, 2020.\n\nEcg-based multi-class arrhythmia detection using spatio-temporal attention-based convolutional recurrent neural network. J Zhang, A Liu, M Gao, X Chen, X Zhang, X Chen, Artificial Intelligence in Medicine. 106101856J. Zhang, A. Liu, M. Gao, X. Chen, X. Zhang, and X. Chen, \"Ecg-based multi-class arrhythmia detection using spatio-temporal attention-based convolutional recurrent neural network,\" Artificial Intelligence in Medicine, vol. 106, p. 101856, 2020. [Online]. Available: http://www.sciencedirect.com/science/article/pii/S0933365719312606\n\nDetection and classification of cardiac arrhythmias by a challenge-best deep learning neural network model. T.-M Chen, C.-H Huang, E S Shih, Y.-F Hu, M.-J Hwang, Iscience. 233100886T.-M. Chen, C.-H. Huang, E. S. Shih, Y.-F. Hu, and M.-J. Hwang, \"Detection and classification of cardiac arrhythmias by a challenge-best deep learning neural network model,\" Iscience, vol. 23, no. 3, p. 100886, 2020.\n\nAdam: A method for stochastic optimization. D Kingma, J Ba, International Conference on Learning Representations (ICLR). D. Kingma and J. Ba, \"Adam: A method for stochastic optimization,\" in International Conference on Learning Representations (ICLR), 2015.\n\nMultiscaled fusion of deep convolutional neural networks for screening atrial fibrillation from single lead short ecg recordings. X Fan, Q Yao, Y Cai, F Miao, F Sun, Y Li, IEEE journal of biomedical and health informatics. 226X. Fan, Q. Yao, Y. Cai, F. Miao, F. Sun, and Y. Li, \"Multiscaled fusion of deep convolutional neural networks for screening atrial fibrillation from single lead short ecg recordings,\" IEEE journal of biomedical and health informatics, vol. 22, no. 6, pp. 1744-1753, 2018.\n\nVisualizing data using t-sne. L V Der Maaten, G E Hinton, Journal of Machine Learning Research. 9L. V. Der Maaten and G. E. Hinton, \"Visualizing data using t-sne,\" Journal of Machine Learning Research, vol. 9, pp. 2579-2605, 2008.\n", "annotations": {"author": "[{\"end\":119,\"start\":108},{\"end\":131,\"start\":120},{\"end\":143,\"start\":132},{\"end\":152,\"start\":144},{\"end\":164,\"start\":153},{\"end\":174,\"start\":165},{\"end\":184,\"start\":175}]", "publisher": null, "author_last_name": "[{\"end\":118,\"start\":113},{\"end\":130,\"start\":125},{\"end\":142,\"start\":139},{\"end\":151,\"start\":148},{\"end\":163,\"start\":159},{\"end\":173,\"start\":168},{\"end\":183,\"start\":179}]", "author_first_name": "[{\"end\":112,\"start\":108},{\"end\":124,\"start\":120},{\"end\":138,\"start\":132},{\"end\":147,\"start\":144},{\"end\":158,\"start\":153},{\"end\":167,\"start\":165},{\"end\":178,\"start\":175}]", "author_affiliation": null, "title": "[{\"end\":105,\"start\":1},{\"end\":289,\"start\":185}]", "venue": null, "abstract": "[{\"end\":2252,\"start\":372}]", "bib_ref": "[{\"attributes\":{\"ref_id\":\"b1\"},\"end\":2328,\"start\":2325},{\"attributes\":{\"ref_id\":\"b2\"},\"end\":3818,\"start\":3815},{\"attributes\":{\"ref_id\":\"b3\"},\"end\":6899,\"start\":6896},{\"attributes\":{\"ref_id\":\"b5\"},\"end\":6904,\"start\":6901},{\"attributes\":{\"ref_id\":\"b6\"},\"end\":6926,\"start\":6923},{\"attributes\":{\"ref_id\":\"b8\"},\"end\":6931,\"start\":6928},{\"attributes\":{\"ref_id\":\"b8\"},\"end\":6959,\"start\":6956},{\"attributes\":{\"ref_id\":\"b11\"},\"end\":6965,\"start\":6961},{\"attributes\":{\"ref_id\":\"b12\"},\"end\":6992,\"start\":6988},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":6998,\"start\":6994},{\"attributes\":{\"ref_id\":\"b16\"},\"end\":7213,\"start\":7209},{\"attributes\":{\"ref_id\":\"b18\"},\"end\":7219,\"start\":7215},{\"attributes\":{\"ref_id\":\"b18\"},\"end\":7260,\"start\":7256},{\"attributes\":{\"ref_id\":\"b20\"},\"end\":7266,\"start\":7262},{\"attributes\":{\"ref_id\":\"b18\"},\"end\":7311,\"start\":7307},{\"attributes\":{\"ref_id\":\"b20\"},\"end\":7317,\"start\":7313},{\"attributes\":{\"ref_id\":\"b7\"},\"end\":7488,\"start\":7485},{\"attributes\":{\"ref_id\":\"b12\"},\"end\":7494,\"start\":7490},{\"attributes\":{\"ref_id\":\"b3\"},\"end\":7528,\"start\":7525},{\"attributes\":{\"ref_id\":\"b11\"},\"end\":7534,\"start\":7530},{\"attributes\":{\"ref_id\":\"b13\"},\"end\":7540,\"start\":7536},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":7546,\"start\":7542},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":7577,\"start\":7573},{\"attributes\":{\"ref_id\":\"b16\"},\"end\":7583,\"start\":7579},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":7603,\"start\":7599},{\"attributes\":{\"ref_id\":\"b16\"},\"end\":7609,\"start\":7605},{\"attributes\":{\"ref_id\":\"b8\"},\"end\":7637,\"start\":7634},{\"attributes\":{\"ref_id\":\"b11\"},\"end\":7643,\"start\":7639},{\"attributes\":{\"ref_id\":\"b21\"},\"end\":7886,\"start\":7882},{\"attributes\":{\"ref_id\":\"b22\"},\"end\":8084,\"start\":8080},{\"attributes\":{\"ref_id\":\"b23\"},\"end\":8421,\"start\":8417},{\"attributes\":{\"ref_id\":\"b24\"},\"end\":8809,\"start\":8805},{\"attributes\":{\"ref_id\":\"b25\"},\"end\":8959,\"start\":8955},{\"attributes\":{\"ref_id\":\"b26\"},\"end\":9145,\"start\":9141},{\"attributes\":{\"ref_id\":\"b27\"},\"end\":9284,\"start\":9280},{\"attributes\":{\"ref_id\":\"b2\"},\"end\":9524,\"start\":9521},{\"attributes\":{\"ref_id\":\"b28\"},\"end\":10266,\"start\":10262},{\"attributes\":{\"ref_id\":\"b29\"},\"end\":10332,\"start\":10328},{\"attributes\":{\"ref_id\":\"b2\"},\"end\":10635,\"start\":10632},{\"attributes\":{\"ref_id\":\"b30\"},\"end\":13090,\"start\":13086},{\"attributes\":{\"ref_id\":\"b31\"},\"end\":13301,\"start\":13297},{\"attributes\":{\"ref_id\":\"b32\"},\"end\":13341,\"start\":13337},{\"attributes\":{\"ref_id\":\"b33\"},\"end\":13618,\"start\":13614},{\"attributes\":{\"ref_id\":\"b34\"},\"end\":13632,\"start\":13628},{\"attributes\":{\"ref_id\":\"b35\"},\"end\":14762,\"start\":14758},{\"attributes\":{\"ref_id\":\"b36\"},\"end\":18796,\"start\":18792},{\"attributes\":{\"ref_id\":\"b42\"},\"end\":19406,\"start\":19402},{\"attributes\":{\"ref_id\":\"b44\"},\"end\":20431,\"start\":20427},{\"attributes\":{\"ref_id\":\"b45\"},\"end\":20701,\"start\":20697},{\"attributes\":{\"ref_id\":\"b46\"},\"end\":26186,\"start\":26182},{\"attributes\":{\"ref_id\":\"b23\"},\"end\":27907,\"start\":27903},{\"attributes\":{\"ref_id\":\"b40\"},\"end\":28129,\"start\":28125},{\"attributes\":{\"ref_id\":\"b23\"},\"end\":28440,\"start\":28436},{\"attributes\":{\"ref_id\":\"b40\"},\"end\":28449,\"start\":28445}]", "figure": "[{\"attributes\":{\"id\":\"fig_0\"},\"end\":29382,\"start\":29337},{\"attributes\":{\"id\":\"fig_1\"},\"end\":29489,\"start\":29383},{\"attributes\":{\"id\":\"fig_2\"},\"end\":29541,\"start\":29490},{\"attributes\":{\"id\":\"fig_3\"},\"end\":29804,\"start\":29542},{\"attributes\":{\"id\":\"fig_4\"},\"end\":29898,\"start\":29805},{\"attributes\":{\"id\":\"tab_0\",\"type\":\"table\"},\"end\":30025,\"start\":29899},{\"attributes\":{\"id\":\"tab_1\",\"type\":\"table\"},\"end\":30103,\"start\":30026},{\"attributes\":{\"id\":\"tab_2\",\"type\":\"table\"},\"end\":31600,\"start\":30104},{\"attributes\":{\"id\":\"tab_3\",\"type\":\"table\"},\"end\":31840,\"start\":31601},{\"attributes\":{\"id\":\"tab_4\",\"type\":\"table\"},\"end\":32154,\"start\":31841},{\"attributes\":{\"id\":\"tab_5\",\"type\":\"table\"},\"end\":32219,\"start\":32155}]", "paragraph": "[{\"end\":2878,\"start\":2254},{\"end\":3591,\"start\":2880},{\"end\":5004,\"start\":3593},{\"end\":6054,\"start\":5006},{\"end\":6442,\"start\":6056},{\"end\":6736,\"start\":6444},{\"end\":7644,\"start\":6758},{\"end\":9498,\"start\":7646},{\"end\":10946,\"start\":9500},{\"end\":11468,\"start\":10983},{\"end\":12037,\"start\":11511},{\"end\":12439,\"start\":12130},{\"end\":12832,\"start\":12515},{\"end\":13487,\"start\":12834},{\"end\":14553,\"start\":13489},{\"end\":14901,\"start\":14555},{\"end\":15539,\"start\":15012},{\"end\":15804,\"start\":15581},{\"end\":16304,\"start\":15858},{\"end\":16464,\"start\":16376},{\"end\":17105,\"start\":16511},{\"end\":17756,\"start\":17141},{\"end\":17973,\"start\":17775},{\"end\":18797,\"start\":17997},{\"end\":18984,\"start\":18822},{\"end\":19327,\"start\":19101},{\"end\":19952,\"start\":19329},{\"end\":22230,\"start\":19954},{\"end\":22935,\"start\":22264},{\"end\":23601,\"start\":22975},{\"end\":24659,\"start\":23603},{\"end\":26085,\"start\":24661},{\"end\":27558,\"start\":26126},{\"end\":28450,\"start\":27581},{\"end\":29336,\"start\":28452}]", "formula": "[{\"attributes\":{\"id\":\"formula_0\"},\"end\":12129,\"start\":12038},{\"attributes\":{\"id\":\"formula_1\"},\"end\":12514,\"start\":12440},{\"attributes\":{\"id\":\"formula_2\"},\"end\":14938,\"start\":14902},{\"attributes\":{\"id\":\"formula_3\"},\"end\":14983,\"start\":14938},{\"attributes\":{\"id\":\"formula_4\"},\"end\":15011,\"start\":14983},{\"attributes\":{\"id\":\"formula_5\"},\"end\":15857,\"start\":15805},{\"attributes\":{\"id\":\"formula_6\"},\"end\":16375,\"start\":16305},{\"attributes\":{\"id\":\"formula_7\"},\"end\":17140,\"start\":17106},{\"attributes\":{\"id\":\"formula_8\"},\"end\":19100,\"start\":18985}]", "table_ref": "[{\"attributes\":{\"ref_id\":\"tab_0\"},\"end\":11871,\"start\":11864},{\"attributes\":{\"ref_id\":\"tab_0\"},\"end\":12886,\"start\":12879},{\"attributes\":{\"ref_id\":\"tab_0\"},\"end\":13281,\"start\":13274},{\"attributes\":{\"ref_id\":\"tab_0\"},\"end\":18603,\"start\":18595},{\"attributes\":{\"ref_id\":\"tab_0\"},\"end\":21339,\"start\":21330},{\"attributes\":{\"ref_id\":\"tab_0\"},\"end\":22380,\"start\":22370},{\"attributes\":{\"ref_id\":\"tab_0\"},\"end\":24106,\"start\":24098},{\"attributes\":{\"ref_id\":\"tab_4\"},\"end\":25248,\"start\":25241},{\"attributes\":{\"ref_id\":\"tab_4\"},\"end\":25571,\"start\":25563},{\"end\":27675,\"start\":27669},{\"end\":28318,\"start\":28312}]", "section_header": "[{\"end\":6756,\"start\":6739},{\"end\":10961,\"start\":10949},{\"end\":10981,\"start\":10964},{\"end\":11509,\"start\":11471},{\"end\":15579,\"start\":15542},{\"end\":16509,\"start\":16467},{\"end\":17773,\"start\":17759},{\"end\":17995,\"start\":17976},{\"end\":18820,\"start\":18800},{\"end\":22262,\"start\":22233},{\"end\":22951,\"start\":22938},{\"end\":22973,\"start\":22954},{\"end\":26124,\"start\":26088},{\"end\":27579,\"start\":27561},{\"end\":29346,\"start\":29338},{\"end\":29392,\"start\":29384},{\"end\":29499,\"start\":29491},{\"end\":29556,\"start\":29543},{\"end\":29814,\"start\":29806},{\"end\":29909,\"start\":29900},{\"end\":30037,\"start\":30027},{\"end\":30116,\"start\":30105},{\"end\":31612,\"start\":31602},{\"end\":31851,\"start\":31842},{\"end\":32166,\"start\":32156}]", "table": "[{\"end\":30025,\"start\":29944},{\"end\":31600,\"start\":30236},{\"end\":31840,\"start\":31615},{\"end\":32154,\"start\":31972}]", "figure_caption": "[{\"end\":29382,\"start\":29348},{\"end\":29489,\"start\":29394},{\"end\":29541,\"start\":29501},{\"end\":29804,\"start\":29558},{\"end\":29898,\"start\":29816},{\"end\":29944,\"start\":29911},{\"end\":30103,\"start\":30040},{\"end\":30236,\"start\":30120},{\"end\":31972,\"start\":31853},{\"end\":32219,\"start\":32169}]", "figure_ref": "[{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":11064,\"start\":11058},{\"attributes\":{\"ref_id\":\"fig_1\"},\"end\":13797,\"start\":13791},{\"attributes\":{\"ref_id\":\"fig_2\"},\"end\":18696,\"start\":18688},{\"attributes\":{\"ref_id\":\"fig_4\"},\"end\":26595,\"start\":26585},{\"attributes\":{\"ref_id\":\"fig_4\"},\"end\":26626,\"start\":26616},{\"attributes\":{\"ref_id\":\"fig_4\"},\"end\":27168,\"start\":27161}]", "bib_author_first_name": "[{\"end\":32443,\"start\":32442},{\"end\":32732,\"start\":32731},{\"end\":32739,\"start\":32738},{\"end\":32748,\"start\":32747},{\"end\":32757,\"start\":32756},{\"end\":32765,\"start\":32764},{\"end\":33140,\"start\":33139},{\"end\":33146,\"start\":33145},{\"end\":33161,\"start\":33160},{\"end\":33163,\"start\":33162},{\"end\":33512,\"start\":33511},{\"end\":33522,\"start\":33521},{\"end\":33809,\"start\":33808},{\"end\":33821,\"start\":33820},{\"end\":33833,\"start\":33832},{\"end\":33835,\"start\":33834},{\"end\":33843,\"start\":33842},{\"end\":33854,\"start\":33853},{\"end\":33867,\"start\":33866},{\"end\":33878,\"start\":33877},{\"end\":33891,\"start\":33890},{\"end\":33905,\"start\":33904},{\"end\":33917,\"start\":33916},{\"end\":34376,\"start\":34375},{\"end\":34378,\"start\":34377},{\"end\":34391,\"start\":34390},{\"end\":34393,\"start\":34392},{\"end\":34405,\"start\":34404},{\"end\":34777,\"start\":34776},{\"end\":34779,\"start\":34778},{\"end\":34790,\"start\":34789},{\"end\":34792,\"start\":34791},{\"end\":34802,\"start\":34801},{\"end\":34804,\"start\":34803},{\"end\":35148,\"start\":35147},{\"end\":35155,\"start\":35154},{\"end\":35168,\"start\":35167},{\"end\":35170,\"start\":35169},{\"end\":35182,\"start\":35181},{\"end\":35193,\"start\":35192},{\"end\":35537,\"start\":35536},{\"end\":35546,\"start\":35545},{\"end\":35872,\"start\":35871},{\"end\":35874,\"start\":35873},{\"end\":35894,\"start\":35893},{\"end\":35909,\"start\":35908},{\"end\":36311,\"start\":36310},{\"end\":36320,\"start\":36319},{\"end\":36328,\"start\":36327},{\"end\":36338,\"start\":36334},{\"end\":36346,\"start\":36345},{\"end\":36701,\"start\":36700},{\"end\":37038,\"start\":37037},{\"end\":37050,\"start\":37049},{\"end\":37402,\"start\":37401},{\"end\":37411,\"start\":37410},{\"end\":37413,\"start\":37412},{\"end\":37420,\"start\":37419},{\"end\":37422,\"start\":37421},{\"end\":37430,\"start\":37429},{\"end\":37437,\"start\":37436},{\"end\":37439,\"start\":37438},{\"end\":37823,\"start\":37822},{\"end\":37825,\"start\":37824},{\"end\":37834,\"start\":37833},{\"end\":37843,\"start\":37842},{\"end\":37845,\"start\":37844},{\"end\":37855,\"start\":37854},{\"end\":37857,\"start\":37856},{\"end\":37865,\"start\":37864},{\"end\":38242,\"start\":38241},{\"end\":38244,\"start\":38243},{\"end\":38254,\"start\":38253},{\"end\":38256,\"start\":38255},{\"end\":38267,\"start\":38266},{\"end\":38277,\"start\":38276},{\"end\":38279,\"start\":38278},{\"end\":38287,\"start\":38286},{\"end\":38289,\"start\":38288},{\"end\":38296,\"start\":38295},{\"end\":38298,\"start\":38297},{\"end\":38665,\"start\":38664},{\"end\":38671,\"start\":38670},{\"end\":38673,\"start\":38672},{\"end\":38682,\"start\":38681},{\"end\":38684,\"start\":38683},{\"end\":39037,\"start\":39036},{\"end\":39039,\"start\":39038},{\"end\":39049,\"start\":39048},{\"end\":39051,\"start\":39050},{\"end\":39062,\"start\":39061},{\"end\":39064,\"start\":39063},{\"end\":39404,\"start\":39403},{\"end\":39412,\"start\":39411},{\"end\":39424,\"start\":39423},{\"end\":39801,\"start\":39797},{\"end\":39812,\"start\":39808},{\"end\":39825,\"start\":39821},{\"end\":39835,\"start\":39831},{\"end\":39837,\"start\":39836},{\"end\":40152,\"start\":40151},{\"end\":40164,\"start\":40163},{\"end\":40172,\"start\":40171},{\"end\":40504,\"start\":40503},{\"end\":40506,\"start\":40505},{\"end\":40516,\"start\":40515},{\"end\":40524,\"start\":40523},{\"end\":40533,\"start\":40532},{\"end\":40543,\"start\":40542},{\"end\":40949,\"start\":40948},{\"end\":40951,\"start\":40950},{\"end\":40961,\"start\":40960},{\"end\":40974,\"start\":40973},{\"end\":40988,\"start\":40987},{\"end\":40990,\"start\":40989},{\"end\":40999,\"start\":40998},{\"end\":41008,\"start\":41007},{\"end\":41010,\"start\":41009},{\"end\":41022,\"start\":41021},{\"end\":41024,\"start\":41023},{\"end\":41404,\"start\":41403},{\"end\":41419,\"start\":41418},{\"end\":41429,\"start\":41428},{\"end\":41804,\"start\":41803},{\"end\":41806,\"start\":41805},{\"end\":41814,\"start\":41813},{\"end\":41816,\"start\":41815},{\"end\":41823,\"start\":41822},{\"end\":42163,\"start\":42162},{\"end\":42169,\"start\":42168},{\"end\":42176,\"start\":42175},{\"end\":42184,\"start\":42183},{\"end\":42192,\"start\":42191},{\"end\":42200,\"start\":42199},{\"end\":42206,\"start\":42205},{\"end\":42560,\"start\":42559},{\"end\":42567,\"start\":42566},{\"end\":42574,\"start\":42573},{\"end\":42581,\"start\":42580},{\"end\":42589,\"start\":42588},{\"end\":42596,\"start\":42595},{\"end\":43346,\"start\":43345},{\"end\":43352,\"start\":43351},{\"end\":43361,\"start\":43360},{\"end\":43370,\"start\":43369},{\"end\":43376,\"start\":43375},{\"end\":43388,\"start\":43384},{\"end\":43797,\"start\":43796},{\"end\":43804,\"start\":43803},{\"end\":43812,\"start\":43811},{\"end\":43821,\"start\":43820},{\"end\":43830,\"start\":43829},{\"end\":43838,\"start\":43837},{\"end\":44176,\"start\":44175},{\"end\":44190,\"start\":44189},{\"end\":44200,\"start\":44199},{\"end\":44214,\"start\":44213},{\"end\":44227,\"start\":44226},{\"end\":44581,\"start\":44580},{\"end\":44589,\"start\":44588},{\"end\":44591,\"start\":44590},{\"end\":45004,\"start\":45003},{\"end\":45006,\"start\":45005},{\"end\":45014,\"start\":45013},{\"end\":45016,\"start\":45015},{\"end\":45026,\"start\":45025},{\"end\":45028,\"start\":45027},{\"end\":45299,\"start\":45298},{\"end\":45306,\"start\":45305},{\"end\":45325,\"start\":45324},{\"end\":45337,\"start\":45336},{\"end\":45349,\"start\":45348},{\"end\":45361,\"start\":45360},{\"end\":45372,\"start\":45371},{\"end\":45877,\"start\":45876},{\"end\":45891,\"start\":45890},{\"end\":46106,\"start\":46105},{\"end\":46114,\"start\":46113},{\"end\":46122,\"start\":46121},{\"end\":46130,\"start\":46129},{\"end\":46136,\"start\":46135},{\"end\":46145,\"start\":46144},{\"end\":46833,\"start\":46832},{\"end\":46840,\"start\":46839},{\"end\":46847,\"start\":46846},{\"end\":46855,\"start\":46854},{\"end\":46864,\"start\":46863},{\"end\":46870,\"start\":46869},{\"end\":46876,\"start\":46875},{\"end\":46883,\"start\":46882},{\"end\":46889,\"start\":46888},{\"end\":46896,\"start\":46895},{\"end\":47366,\"start\":47365},{\"end\":47373,\"start\":47372},{\"end\":47381,\"start\":47380},{\"end\":47388,\"start\":47387},{\"end\":47397,\"start\":47396},{\"end\":47837,\"start\":47836},{\"end\":47848,\"start\":47847},{\"end\":47858,\"start\":47857},{\"end\":47868,\"start\":47867},{\"end\":48320,\"start\":48319},{\"end\":48327,\"start\":48326},{\"end\":48335,\"start\":48334},{\"end\":48342,\"start\":48341},{\"end\":48349,\"start\":48348},{\"end\":48683,\"start\":48682},{\"end\":48691,\"start\":48690},{\"end\":48698,\"start\":48697},{\"end\":49050,\"start\":49049},{\"end\":49059,\"start\":49058},{\"end\":49066,\"start\":49065},{\"end\":49073,\"start\":49072},{\"end\":49081,\"start\":49080},{\"end\":49090,\"start\":49089},{\"end\":49589,\"start\":49585},{\"end\":49600,\"start\":49596},{\"end\":49609,\"start\":49608},{\"end\":49611,\"start\":49610},{\"end\":49622,\"start\":49618},{\"end\":49631,\"start\":49627},{\"end\":49921,\"start\":49920},{\"end\":49931,\"start\":49930},{\"end\":50266,\"start\":50265},{\"end\":50273,\"start\":50272},{\"end\":50280,\"start\":50279},{\"end\":50287,\"start\":50286},{\"end\":50295,\"start\":50294},{\"end\":50302,\"start\":50301},{\"end\":50665,\"start\":50664},{\"end\":50667,\"start\":50666},{\"end\":50681,\"start\":50680},{\"end\":50683,\"start\":50682}]", "bib_author_last_name": "[{\"end\":32449,\"start\":32444},{\"end\":32736,\"start\":32733},{\"end\":32745,\"start\":32740},{\"end\":32754,\"start\":32749},{\"end\":32762,\"start\":32758},{\"end\":32768,\"start\":32766},{\"end\":33143,\"start\":33141},{\"end\":33158,\"start\":33147},{\"end\":33172,\"start\":33164},{\"end\":33519,\"start\":33513},{\"end\":33530,\"start\":33523},{\"end\":33818,\"start\":33810},{\"end\":33830,\"start\":33822},{\"end\":33840,\"start\":33836},{\"end\":33851,\"start\":33844},{\"end\":33864,\"start\":33855},{\"end\":33875,\"start\":33868},{\"end\":33888,\"start\":33879},{\"end\":33902,\"start\":33892},{\"end\":33914,\"start\":33906},{\"end\":33926,\"start\":33918},{\"end\":34388,\"start\":34379},{\"end\":34402,\"start\":34394},{\"end\":34413,\"start\":34406},{\"end\":34787,\"start\":34780},{\"end\":34799,\"start\":34793},{\"end\":34809,\"start\":34805},{\"end\":35152,\"start\":35149},{\"end\":35165,\"start\":35156},{\"end\":35179,\"start\":35171},{\"end\":35190,\"start\":35183},{\"end\":35198,\"start\":35194},{\"end\":35543,\"start\":35538},{\"end\":35554,\"start\":35547},{\"end\":35891,\"start\":35875},{\"end\":35906,\"start\":35895},{\"end\":35931,\"start\":35910},{\"end\":36317,\"start\":36312},{\"end\":36325,\"start\":36321},{\"end\":36332,\"start\":36329},{\"end\":36343,\"start\":36339},{\"end\":36349,\"start\":36347},{\"end\":36707,\"start\":36702},{\"end\":37047,\"start\":37039},{\"end\":37060,\"start\":37051},{\"end\":37408,\"start\":37403},{\"end\":37417,\"start\":37414},{\"end\":37427,\"start\":37423},{\"end\":37434,\"start\":37431},{\"end\":37443,\"start\":37440},{\"end\":37831,\"start\":37826},{\"end\":37840,\"start\":37835},{\"end\":37852,\"start\":37846},{\"end\":37862,\"start\":37858},{\"end\":37871,\"start\":37866},{\"end\":38251,\"start\":38245},{\"end\":38264,\"start\":38257},{\"end\":38274,\"start\":38268},{\"end\":38284,\"start\":38280},{\"end\":38293,\"start\":38290},{\"end\":38303,\"start\":38299},{\"end\":38668,\"start\":38666},{\"end\":38679,\"start\":38674},{\"end\":38692,\"start\":38685},{\"end\":39046,\"start\":39040},{\"end\":39059,\"start\":39052},{\"end\":39068,\"start\":39065},{\"end\":39409,\"start\":39405},{\"end\":39421,\"start\":39413},{\"end\":39432,\"start\":39425},{\"end\":39806,\"start\":39802},{\"end\":39819,\"start\":39813},{\"end\":39829,\"start\":39826},{\"end\":39842,\"start\":39838},{\"end\":40161,\"start\":40153},{\"end\":40169,\"start\":40165},{\"end\":40180,\"start\":40173},{\"end\":40513,\"start\":40507},{\"end\":40521,\"start\":40517},{\"end\":40530,\"start\":40525},{\"end\":40540,\"start\":40534},{\"end\":40552,\"start\":40544},{\"end\":40958,\"start\":40952},{\"end\":40971,\"start\":40962},{\"end\":40985,\"start\":40975},{\"end\":40996,\"start\":40991},{\"end\":41005,\"start\":41000},{\"end\":41019,\"start\":41011},{\"end\":41027,\"start\":41025},{\"end\":41416,\"start\":41405},{\"end\":41426,\"start\":41420},{\"end\":41437,\"start\":41430},{\"end\":41811,\"start\":41807},{\"end\":41820,\"start\":41817},{\"end\":41827,\"start\":41824},{\"end\":42166,\"start\":42164},{\"end\":42173,\"start\":42170},{\"end\":42181,\"start\":42177},{\"end\":42189,\"start\":42185},{\"end\":42197,\"start\":42193},{\"end\":42203,\"start\":42201},{\"end\":42212,\"start\":42207},{\"end\":42564,\"start\":42561},{\"end\":42571,\"start\":42568},{\"end\":42578,\"start\":42575},{\"end\":42586,\"start\":42582},{\"end\":42593,\"start\":42590},{\"end\":42599,\"start\":42597},{\"end\":43349,\"start\":43347},{\"end\":43358,\"start\":43353},{\"end\":43367,\"start\":43362},{\"end\":43373,\"start\":43371},{\"end\":43382,\"start\":43377},{\"end\":43393,\"start\":43389},{\"end\":43801,\"start\":43798},{\"end\":43809,\"start\":43805},{\"end\":43818,\"start\":43813},{\"end\":43827,\"start\":43822},{\"end\":43835,\"start\":43831},{\"end\":43841,\"start\":43839},{\"end\":44187,\"start\":44177},{\"end\":44197,\"start\":44191},{\"end\":44211,\"start\":44201},{\"end\":44224,\"start\":44215},{\"end\":44241,\"start\":44228},{\"end\":44586,\"start\":44582},{\"end\":44598,\"start\":44592},{\"end\":45011,\"start\":45007},{\"end\":45023,\"start\":45017},{\"end\":45031,\"start\":45029},{\"end\":45303,\"start\":45300},{\"end\":45322,\"start\":45307},{\"end\":45334,\"start\":45326},{\"end\":45346,\"start\":45338},{\"end\":45358,\"start\":45350},{\"end\":45369,\"start\":45362},{\"end\":45379,\"start\":45373},{\"end\":45888,\"start\":45878},{\"end\":45903,\"start\":45892},{\"end\":46111,\"start\":46107},{\"end\":46119,\"start\":46115},{\"end\":46127,\"start\":46123},{\"end\":46133,\"start\":46131},{\"end\":46142,\"start\":46137},{\"end\":46150,\"start\":46146},{\"end\":46837,\"start\":46834},{\"end\":46844,\"start\":46841},{\"end\":46852,\"start\":46848},{\"end\":46861,\"start\":46856},{\"end\":46867,\"start\":46865},{\"end\":46873,\"start\":46871},{\"end\":46880,\"start\":46877},{\"end\":46886,\"start\":46884},{\"end\":46893,\"start\":46890},{\"end\":46899,\"start\":46897},{\"end\":47370,\"start\":47367},{\"end\":47378,\"start\":47374},{\"end\":47385,\"start\":47382},{\"end\":47394,\"start\":47389},{\"end\":47400,\"start\":47398},{\"end\":47842,\"start\":47838},{\"end\":47852,\"start\":47849},{\"end\":47862,\"start\":47859},{\"end\":47871,\"start\":47869},{\"end\":48324,\"start\":48321},{\"end\":48332,\"start\":48328},{\"end\":48339,\"start\":48336},{\"end\":48346,\"start\":48343},{\"end\":48352,\"start\":48350},{\"end\":48688,\"start\":48684},{\"end\":48695,\"start\":48692},{\"end\":48701,\"start\":48699},{\"end\":49056,\"start\":49051},{\"end\":49063,\"start\":49060},{\"end\":49070,\"start\":49067},{\"end\":49078,\"start\":49074},{\"end\":49087,\"start\":49082},{\"end\":49095,\"start\":49091},{\"end\":49594,\"start\":49590},{\"end\":49606,\"start\":49601},{\"end\":49616,\"start\":49612},{\"end\":49625,\"start\":49623},{\"end\":49637,\"start\":49632},{\"end\":49928,\"start\":49922},{\"end\":49934,\"start\":49932},{\"end\":50270,\"start\":50267},{\"end\":50277,\"start\":50274},{\"end\":50284,\"start\":50281},{\"end\":50292,\"start\":50288},{\"end\":50299,\"start\":50296},{\"end\":50305,\"start\":50303},{\"end\":50678,\"start\":50668},{\"end\":50690,\"start\":50684}]", "bib_entry": "[{\"attributes\":{\"id\":\"b0\"},\"end\":32386,\"start\":32221},{\"attributes\":{\"id\":\"b1\",\"matched_paper_id\":23713883},\"end\":32616,\"start\":32388},{\"attributes\":{\"id\":\"b2\",\"matched_paper_id\":51868017},\"end\":33046,\"start\":32618},{\"attributes\":{\"id\":\"b3\",\"matched_paper_id\":7585468},\"end\":33439,\"start\":33048},{\"attributes\":{\"id\":\"b4\",\"matched_paper_id\":12049862},\"end\":33708,\"start\":33441},{\"attributes\":{\"id\":\"b5\",\"matched_paper_id\":3587617},\"end\":34304,\"start\":33710},{\"attributes\":{\"id\":\"b6\",\"matched_paper_id\":982541},\"end\":34648,\"start\":34306},{\"attributes\":{\"id\":\"b7\",\"matched_paper_id\":9728023},\"end\":35079,\"start\":34650},{\"attributes\":{\"id\":\"b8\",\"matched_paper_id\":14219918},\"end\":35460,\"start\":35081},{\"attributes\":{\"id\":\"b9\",\"matched_paper_id\":8264604},\"end\":35764,\"start\":35462},{\"attributes\":{\"id\":\"b10\",\"matched_paper_id\":31569480},\"end\":36241,\"start\":35766},{\"attributes\":{\"id\":\"b11\",\"matched_paper_id\":19165252},\"end\":36567,\"start\":36243},{\"attributes\":{\"id\":\"b12\",\"matched_paper_id\":2564723},\"end\":36944,\"start\":36569},{\"attributes\":{\"id\":\"b13\",\"matched_paper_id\":15489337},\"end\":37292,\"start\":36946},{\"attributes\":{\"id\":\"b14\",\"matched_paper_id\":38650197},\"end\":37717,\"start\":37294},{\"attributes\":{\"id\":\"b15\",\"matched_paper_id\":206858844},\"end\":38162,\"start\":37719},{\"attributes\":{\"id\":\"b16\",\"matched_paper_id\":38251455},\"end\":38582,\"start\":38164},{\"attributes\":{\"id\":\"b17\",\"matched_paper_id\":14756371},\"end\":38958,\"start\":38584},{\"attributes\":{\"id\":\"b18\",\"matched_paper_id\":21808840},\"end\":39311,\"start\":38960},{\"attributes\":{\"id\":\"b19\",\"matched_paper_id\":6811679},\"end\":39695,\"start\":39313},{\"attributes\":{\"id\":\"b20\",\"matched_paper_id\":36838770},\"end\":40065,\"start\":39697},{\"attributes\":{\"id\":\"b21\",\"matched_paper_id\":206614746},\"end\":40433,\"start\":40067},{\"attributes\":{\"id\":\"b22\",\"matched_paper_id\":64664784},\"end\":40825,\"start\":40435},{\"attributes\":{\"id\":\"b23\",\"matched_paper_id\":57574627},\"end\":41315,\"start\":40827},{\"attributes\":{\"id\":\"b24\",\"matched_paper_id\":54476491},\"end\":41679,\"start\":41317},{\"attributes\":{\"id\":\"b25\",\"matched_paper_id\":202768511},\"end\":42049,\"start\":41681},{\"attributes\":{\"id\":\"b26\",\"matched_paper_id\":199510164},\"end\":42451,\"start\":42051},{\"attributes\":{\"id\":\"b27\",\"matched_paper_id\":53092432},\"end\":43278,\"start\":42453},{\"attributes\":{\"id\":\"b28\",\"matched_paper_id\":70146951},\"end\":43729,\"start\":43280},{\"attributes\":{\"id\":\"b29\",\"matched_paper_id\":117730937},\"end\":44106,\"start\":43731},{\"attributes\":{\"id\":\"b30\",\"matched_paper_id\":6844431},\"end\":44516,\"start\":44108},{\"attributes\":{\"id\":\"b31\",\"matched_paper_id\":15539264},\"end\":44936,\"start\":44518},{\"attributes\":{\"id\":\"b32\",\"matched_paper_id\":16489696},\"end\":45201,\"start\":44938},{\"attributes\":{\"id\":\"b33\",\"matched_paper_id\":5590763},\"end\":45850,\"start\":45203},{\"attributes\":{\"id\":\"b34\",\"matched_paper_id\":1915014},\"end\":46042,\"start\":45852},{\"attributes\":{\"id\":\"b35\",\"matched_paper_id\":6857205},\"end\":46710,\"start\":46044},{\"attributes\":{\"id\":\"b36\",\"matched_paper_id\":70024401},\"end\":47248,\"start\":46712},{\"attributes\":{\"id\":\"b37\",\"matched_paper_id\":58675641},\"end\":47743,\"start\":47250},{\"attributes\":{\"id\":\"b38\",\"matched_paper_id\":208630217},\"end\":48149,\"start\":47745},{\"attributes\":{\"id\":\"b39\"},\"end\":48185,\"start\":48151},{\"attributes\":{\"id\":\"b40\",\"matched_paper_id\":197532274},\"end\":48603,\"start\":48187},{\"attributes\":{\"id\":\"b41\",\"matched_paper_id\":215772494},\"end\":48926,\"start\":48605},{\"attributes\":{\"id\":\"b42\",\"matched_paper_id\":218947952},\"end\":49475,\"start\":48928},{\"attributes\":{\"id\":\"b43\",\"matched_paper_id\":203884836},\"end\":49874,\"start\":49477},{\"attributes\":{\"id\":\"b44\",\"matched_paper_id\":6628106},\"end\":50133,\"start\":49876},{\"attributes\":{\"id\":\"b45\",\"matched_paper_id\":52003048},\"end\":50632,\"start\":50135},{\"attributes\":{\"id\":\"b46\",\"matched_paper_id\":5855042},\"end\":50864,\"start\":50634}]", "bib_title": "[{\"end\":32440,\"start\":32388},{\"end\":32729,\"start\":32618},{\"end\":33137,\"start\":33048},{\"end\":33509,\"start\":33441},{\"end\":33806,\"start\":33710},{\"end\":34373,\"start\":34306},{\"end\":34774,\"start\":34650},{\"end\":35145,\"start\":35081},{\"end\":35534,\"start\":35462},{\"end\":35869,\"start\":35766},{\"end\":36308,\"start\":36243},{\"end\":36698,\"start\":36569},{\"end\":37035,\"start\":36946},{\"end\":37399,\"start\":37294},{\"end\":37820,\"start\":37719},{\"end\":38239,\"start\":38164},{\"end\":38662,\"start\":38584},{\"end\":39034,\"start\":38960},{\"end\":39401,\"start\":39313},{\"end\":39795,\"start\":39697},{\"end\":40149,\"start\":40067},{\"end\":40501,\"start\":40435},{\"end\":40946,\"start\":40827},{\"end\":41401,\"start\":41317},{\"end\":41801,\"start\":41681},{\"end\":42160,\"start\":42051},{\"end\":42557,\"start\":42453},{\"end\":43343,\"start\":43280},{\"end\":43794,\"start\":43731},{\"end\":44173,\"start\":44108},{\"end\":44578,\"start\":44518},{\"end\":45001,\"start\":44938},{\"end\":45296,\"start\":45203},{\"end\":45874,\"start\":45852},{\"end\":46103,\"start\":46044},{\"end\":46830,\"start\":46712},{\"end\":47363,\"start\":47250},{\"end\":47834,\"start\":47745},{\"end\":48317,\"start\":48187},{\"end\":48680,\"start\":48605},{\"end\":49047,\"start\":48928},{\"end\":49583,\"start\":49477},{\"end\":49918,\"start\":49876},{\"end\":50263,\"start\":50135},{\"end\":50662,\"start\":50634}]", "bib_author": "[{\"end\":32451,\"start\":32442},{\"end\":32738,\"start\":32731},{\"end\":32747,\"start\":32738},{\"end\":32756,\"start\":32747},{\"end\":32764,\"start\":32756},{\"end\":32770,\"start\":32764},{\"end\":33145,\"start\":33139},{\"end\":33160,\"start\":33145},{\"end\":33174,\"start\":33160},{\"end\":33521,\"start\":33511},{\"end\":33532,\"start\":33521},{\"end\":33820,\"start\":33808},{\"end\":33832,\"start\":33820},{\"end\":33842,\"start\":33832},{\"end\":33853,\"start\":33842},{\"end\":33866,\"start\":33853},{\"end\":33877,\"start\":33866},{\"end\":33890,\"start\":33877},{\"end\":33904,\"start\":33890},{\"end\":33916,\"start\":33904},{\"end\":33928,\"start\":33916},{\"end\":34390,\"start\":34375},{\"end\":34404,\"start\":34390},{\"end\":34415,\"start\":34404},{\"end\":34789,\"start\":34776},{\"end\":34801,\"start\":34789},{\"end\":34811,\"start\":34801},{\"end\":35154,\"start\":35147},{\"end\":35167,\"start\":35154},{\"end\":35181,\"start\":35167},{\"end\":35192,\"start\":35181},{\"end\":35200,\"start\":35192},{\"end\":35545,\"start\":35536},{\"end\":35556,\"start\":35545},{\"end\":35893,\"start\":35871},{\"end\":35908,\"start\":35893},{\"end\":35933,\"start\":35908},{\"end\":36319,\"start\":36310},{\"end\":36327,\"start\":36319},{\"end\":36334,\"start\":36327},{\"end\":36345,\"start\":36334},{\"end\":36351,\"start\":36345},{\"end\":36709,\"start\":36700},{\"end\":37049,\"start\":37037},{\"end\":37062,\"start\":37049},{\"end\":37410,\"start\":37401},{\"end\":37419,\"start\":37410},{\"end\":37429,\"start\":37419},{\"end\":37436,\"start\":37429},{\"end\":37445,\"start\":37436},{\"end\":37833,\"start\":37822},{\"end\":37842,\"start\":37833},{\"end\":37854,\"start\":37842},{\"end\":37864,\"start\":37854},{\"end\":37873,\"start\":37864},{\"end\":38253,\"start\":38241},{\"end\":38266,\"start\":38253},{\"end\":38276,\"start\":38266},{\"end\":38286,\"start\":38276},{\"end\":38295,\"start\":38286},{\"end\":38305,\"start\":38295},{\"end\":38670,\"start\":38664},{\"end\":38681,\"start\":38670},{\"end\":38694,\"start\":38681},{\"end\":39048,\"start\":39036},{\"end\":39061,\"start\":39048},{\"end\":39070,\"start\":39061},{\"end\":39411,\"start\":39403},{\"end\":39423,\"start\":39411},{\"end\":39434,\"start\":39423},{\"end\":39808,\"start\":39797},{\"end\":39821,\"start\":39808},{\"end\":39831,\"start\":39821},{\"end\":39844,\"start\":39831},{\"end\":40163,\"start\":40151},{\"end\":40171,\"start\":40163},{\"end\":40182,\"start\":40171},{\"end\":40515,\"start\":40503},{\"end\":40523,\"start\":40515},{\"end\":40532,\"start\":40523},{\"end\":40542,\"start\":40532},{\"end\":40554,\"start\":40542},{\"end\":40960,\"start\":40948},{\"end\":40973,\"start\":40960},{\"end\":40987,\"start\":40973},{\"end\":40998,\"start\":40987},{\"end\":41007,\"start\":40998},{\"end\":41021,\"start\":41007},{\"end\":41029,\"start\":41021},{\"end\":41418,\"start\":41403},{\"end\":41428,\"start\":41418},{\"end\":41439,\"start\":41428},{\"end\":41813,\"start\":41803},{\"end\":41822,\"start\":41813},{\"end\":41829,\"start\":41822},{\"end\":42168,\"start\":42162},{\"end\":42175,\"start\":42168},{\"end\":42183,\"start\":42175},{\"end\":42191,\"start\":42183},{\"end\":42199,\"start\":42191},{\"end\":42205,\"start\":42199},{\"end\":42214,\"start\":42205},{\"end\":42566,\"start\":42559},{\"end\":42573,\"start\":42566},{\"end\":42580,\"start\":42573},{\"end\":42588,\"start\":42580},{\"end\":42595,\"start\":42588},{\"end\":42601,\"start\":42595},{\"end\":43351,\"start\":43345},{\"end\":43360,\"start\":43351},{\"end\":43369,\"start\":43360},{\"end\":43375,\"start\":43369},{\"end\":43384,\"start\":43375},{\"end\":43395,\"start\":43384},{\"end\":43803,\"start\":43796},{\"end\":43811,\"start\":43803},{\"end\":43820,\"start\":43811},{\"end\":43829,\"start\":43820},{\"end\":43837,\"start\":43829},{\"end\":43843,\"start\":43837},{\"end\":44189,\"start\":44175},{\"end\":44199,\"start\":44189},{\"end\":44213,\"start\":44199},{\"end\":44226,\"start\":44213},{\"end\":44243,\"start\":44226},{\"end\":44588,\"start\":44580},{\"end\":44600,\"start\":44588},{\"end\":45013,\"start\":45003},{\"end\":45025,\"start\":45013},{\"end\":45033,\"start\":45025},{\"end\":45305,\"start\":45298},{\"end\":45324,\"start\":45305},{\"end\":45336,\"start\":45324},{\"end\":45348,\"start\":45336},{\"end\":45360,\"start\":45348},{\"end\":45371,\"start\":45360},{\"end\":45381,\"start\":45371},{\"end\":45890,\"start\":45876},{\"end\":45905,\"start\":45890},{\"end\":46113,\"start\":46105},{\"end\":46121,\"start\":46113},{\"end\":46129,\"start\":46121},{\"end\":46135,\"start\":46129},{\"end\":46144,\"start\":46135},{\"end\":46152,\"start\":46144},{\"end\":46839,\"start\":46832},{\"end\":46846,\"start\":46839},{\"end\":46854,\"start\":46846},{\"end\":46863,\"start\":46854},{\"end\":46869,\"start\":46863},{\"end\":46875,\"start\":46869},{\"end\":46882,\"start\":46875},{\"end\":46888,\"start\":46882},{\"end\":46895,\"start\":46888},{\"end\":46901,\"start\":46895},{\"end\":47372,\"start\":47365},{\"end\":47380,\"start\":47372},{\"end\":47387,\"start\":47380},{\"end\":47396,\"start\":47387},{\"end\":47402,\"start\":47396},{\"end\":47847,\"start\":47836},{\"end\":47857,\"start\":47847},{\"end\":47867,\"start\":47857},{\"end\":47876,\"start\":47867},{\"end\":48326,\"start\":48319},{\"end\":48334,\"start\":48326},{\"end\":48341,\"start\":48334},{\"end\":48348,\"start\":48341},{\"end\":48354,\"start\":48348},{\"end\":48690,\"start\":48682},{\"end\":48697,\"start\":48690},{\"end\":48703,\"start\":48697},{\"end\":49058,\"start\":49049},{\"end\":49065,\"start\":49058},{\"end\":49072,\"start\":49065},{\"end\":49080,\"start\":49072},{\"end\":49089,\"start\":49080},{\"end\":49097,\"start\":49089},{\"end\":49596,\"start\":49585},{\"end\":49608,\"start\":49596},{\"end\":49618,\"start\":49608},{\"end\":49627,\"start\":49618},{\"end\":49639,\"start\":49627},{\"end\":49930,\"start\":49920},{\"end\":49936,\"start\":49930},{\"end\":50272,\"start\":50265},{\"end\":50279,\"start\":50272},{\"end\":50286,\"start\":50279},{\"end\":50294,\"start\":50286},{\"end\":50301,\"start\":50294},{\"end\":50307,\"start\":50301},{\"end\":50680,\"start\":50664},{\"end\":50692,\"start\":50680}]", "bib_venue": "[{\"end\":32251,\"start\":32221},{\"end\":32479,\"start\":32451},{\"end\":32810,\"start\":32770},{\"end\":33217,\"start\":33174},{\"end\":33554,\"start\":33532},{\"end\":33977,\"start\":33928},{\"end\":34450,\"start\":34415},{\"end\":34837,\"start\":34811},{\"end\":35243,\"start\":35200},{\"end\":35589,\"start\":35556},{\"end\":35977,\"start\":35933},{\"end\":36384,\"start\":36351},{\"end\":36735,\"start\":36709},{\"end\":37094,\"start\":37062},{\"end\":37477,\"start\":37445},{\"end\":37917,\"start\":37873},{\"end\":38345,\"start\":38305},{\"end\":38743,\"start\":38694},{\"end\":39110,\"start\":39070},{\"end\":39477,\"start\":39434},{\"end\":39858,\"start\":39844},{\"end\":40225,\"start\":40182},{\"end\":40599,\"start\":40554},{\"end\":41044,\"start\":41029},{\"end\":41488,\"start\":41439},{\"end\":41840,\"start\":41829},{\"end\":42225,\"start\":42214},{\"end\":42823,\"start\":42601},{\"end\":43456,\"start\":43395},{\"end\":43892,\"start\":43843},{\"end\":44283,\"start\":44243},{\"end\":44678,\"start\":44600},{\"end\":45043,\"start\":45033},{\"end\":45467,\"start\":45381},{\"end\":45923,\"start\":45905},{\"end\":46294,\"start\":46152},{\"end\":46950,\"start\":46901},{\"end\":47472,\"start\":47402},{\"end\":47942,\"start\":47876},{\"end\":48157,\"start\":48153},{\"end\":48372,\"start\":48354},{\"end\":48752,\"start\":48703},{\"end\":49132,\"start\":49097},{\"end\":49647,\"start\":49639},{\"end\":49995,\"start\":49936},{\"end\":50356,\"start\":50307},{\"end\":50728,\"start\":50692},{\"end\":43504,\"start\":43458},{\"end\":44743,\"start\":44680},{\"end\":45049,\"start\":45045},{\"end\":45540,\"start\":45469},{\"end\":46423,\"start\":46296}]"}}}, "year": 2023, "month": 12, "day": 17}