{"id": 222178328, "updated": "2023-11-08 05:15:14.397", "metadata": {"title": "Learning to Explain: Datasets and Models for Identifying Valid Reasoning Chains in Multihop Question-Answering", "authors": "[{\"first\":\"Harsh\",\"last\":\"Jhamtani\",\"middle\":[]},{\"first\":\"Peter\",\"last\":\"Clark\",\"middle\":[]}]", "venue": "EMNLP", "journal": "Proceedings of the 2020 Conference on Empirical Methods in Natural Language Processing (EMNLP)", "publication_date": {"year": 2020, "month": 10, "day": 7}, "abstract": "Despite the rapid progress in multihop question-answering (QA), models still have trouble explaining why an answer is correct, with limited explanation training data available to learn from. To address this, we introduce three explanation datasets in which explanations formed from corpus facts are annotated. Our first dataset, eQASC, contains over 98K explanation annotations for the multihop question answering dataset QASC, and is the first that annotates multiple candidate explanations for each answer. The second dataset eQASC-perturbed is constructed by crowd-sourcing perturbations (while preserving their validity) of a subset of explanations in QASC, to test consistency and generalization of explanation prediction models. The third dataset eOBQA is constructed by adding explanation annotations to the OBQA dataset to test generalization of models trained on eQASC. We show that this data can be used to significantly improve explanation quality (+14% absolute F1 over a strong retrieval baseline) using a BERT-based classifier, but still behind the upper bound, offering a new challenge for future research. We also explore a delexicalized chain representation in which repeated noun phrases are replaced by variables, thus turning them into generalized reasoning chains (for example:\"X is a Y\"AND\"Y has Z\"IMPLIES\"X has Z\"). We find that generalized chains maintain performance while also being more robust to certain perturbations.", "fields_of_study": "[\"Computer Science\"]", "external_ids": {"arxiv": "2010.03274", "mag": "3104992282", "acl": "2020.emnlp-main.10", "pubmed": null, "pubmedcentral": null, "dblp": "conf/emnlp/JhamtaniC20", "doi": "10.18653/v1/2020.emnlp-main.10"}}, "content": {"source": {"pdf_hash": "ebaebfefec9d5c21a4559a1a038743bd437d2f01", "pdf_src": "Arxiv", "pdf_uri": "[\"https://arxiv.org/pdf/2010.03274v1.pdf\"]", "oa_url_match": false, "oa_info": {"license": "CCBY", "open_access_url": "https://www.aclweb.org/anthology/2020.emnlp-main.10.pdf", "status": "HYBRID"}}, "grobid": {"id": "8878081a523443946430ce6f32142be2752db7a1", "type": "plain-text", "url": "s3://ai2-s2-pdf-extraction-prod/parse-results/s2orc_worker/ebaebfefec9d5c21a4559a1a038743bd437d2f01.txt", "contents": "\nLearning to Explain: Datasets and Models for Identifying Valid Reasoning Chains in Multihop Question-Answering\n\n\nHarsh Jhamtani \nSchool of Computer Science\nCarnegie Mellon University\n\n\nPeter Clark peterc@allenai.org \nAllen Institute for AI\n\n\nLearning to Explain: Datasets and Models for Identifying Valid Reasoning Chains in Multihop Question-Answering\n\nDespite the rapid progress in multihop question-answering (QA), models still have trouble explaining why an answer is correct, with limited explanation training data available to learn from. To address this, we introduce three explanation datasets in which explanations formed from corpus facts are annotated. Our first dataset, eQASC, contains over 98K explanation annotations for the multihop question answering dataset QASC, and is the first that annotates multiple candidate explanations for each answer. The second dataset eQASC-perturbed is constructed by crowd-sourcing perturbations (while preserving their validity) of a subset of explanations in QASC, to test consistency and generalization of explanation prediction models. The third dataset eOBQA is constructed by adding explanation annotations to the OBQA dataset to test generalization of models trained on eQASC. We show that this data can be used to significantly improve explanation quality (+14% absolute F1 over a strong retrieval baseline) using a BERT-based classifier, but still behind the upper bound, offering a new challenge for future research. We also explore a delexicalized chain representation in which repeated noun phrases are replaced by variables, thus turning them into generalized reasoning chains (for example: \"X is a Y\" AND \"Y has Z\" IMPLIES \"X has Z\"). We find that generalized chains maintain performance while also being more robust to certain perturbations. 1\n\nIntroduction\n\nWhile neural systems have become remarkably adept at question answering (QA), e.g., (Clark and Gardner, 2018), their ability to explain those answers remains limited. This creates a barrier for deploying QA systems in practical settings, and Figure 1: Our datasets contain annotated (valid and invalid) reasoning chains in support of an answer, allowing explanation classifier models to be trained and applied. We also find that using a variabilized version of the chains improves the models' robustness. limits their utility for other tasks such as education and tutoring, where explanation plays a key role. This need has become particularly important with multihop question-answering, where multiple facts are needed to derive an answer. In this context, seeing a chain of reasoning leading to an answer, can help a user assess an answer's validity. Our research here contributes to this goal.\n\nWe are interested in questions where the decomposition into subquestions -hence the explanation structure -is not evident from the question, but has to be found. For example, \"Does a suit of armor conduct electricity?\" might be answered (hence explained) by first identifying what material armor is made of, even though the question itself does not mention materials. This contrasts with earlier multihop QA datasets, e.g., HotpotQA (Yang et al., 2018), where the explanation structure is evident in the question itself. For example, \"What nationality was James Miller's wife?\" implies a chain of reasoning to first finds Miller's wife, then her nationality. Such cases are easier but less representative of natural questions. Multihop datasets of the kind where explanation structure is not evident To find valid reasoning chains, we first generate candidates for each answer option using a 2-step retrieval process (Section 3.2). We then collect annotations for the correct answer option chains to train and evaluate models to detect valid reasoning chains. (Above, chains A1 and A3 are valid, while A2, B1, and B2 are invalid).\n\ninclude OpenBookQA (Mihaylov et al., 2018) and more recently QASC (Khot et al., 2020). However, although providing QA pairs, these datasets provide limited explanation information. Open-BookQA does not come with any explanation data, and QASC only provides a single gold explanation for each answer, while in practice there may be multiple valid explanations.\n\nTo alleviate this lack of data, we contribute three new datasets: The first (and largest) is eQASC, containing annotations on over 98K candidate explanations for the QASC dataset, including on multiple (typically 10) possible explanations for each answer, including both valid and invalid explanations. The second, eQASC-perturbed, contains semantically invariant perturbations of a subset of QASC explanations, for better measuring the generality of explanation prediction models. Finally eOBQA adds adding explanation annotations to the OBQA test set, to further test generality of models trained on eQASC. In addition, we use these datasets to build models for detecting valid explanations, to establish baseline scores. Finally, we explore a delexicalized chain representation in which repeated noun phrases are replaced by variables, thus turning them into generalized reasoning chains, as illustrated in Figure 1. We find that generalized chains maintain performance while also being more robust to perturbations, suggesting a promising avenue for further research.\n\n\nRelated Work\n\nIn the context of QA, there are multiple notions of explanation/justification, including showing an authoritative, answer-bearing sentence (Perez et al., 2019), a collection of text snippets supporting an answer (DeYoung et al., 2020), an attention map over a passage (Seo et al., 2016), a synthesized phrase connecting question and answer (Rajani et al., 2019), or the syntactic pattern used to locate the answer (Ye et al., 2020;Hancock et al., 2018). These methods are primarily designed for answers to \"lookup\" questions, to explain where and how an answer was found in a corpus.\n\nFor questions requiring inference, the focus of this paper, an explanation is often taken as the chain of steps (typically sentences) leading to an answer. HotpotQA's support task goes partway towards this by asking for answer-supporting sentences (but not how they combine) (Yang et al., 2018). The R4C dataset takes this further, annotating how (and which) HotpotQA supporting sentences chain together (Inoue et al., 2019). However, in HotpotQA and R4C, the decomposition (hence structure of the explanation) is evident in the question (Mihaylov et al., 2018), simplifying the task. More recently, multihop datasets where the decomposition is not evident have appeared, e.g., WikiHop (Welbl et al., 2018), OBQA (Mihaylov et al., 2018), and QASC (Khot et al., 2020), posing more a realistic explanation challenge. However, explanation annotations are sparse (only QASC contains a single gold explanation per question), limiting their support for both training and evaluation of explanation systems, hence motivating this work.\n\nFinally there are a few human-authored explanation datasets. e-SNLI (Camburu et al., 2018) adds crowdsourced explanations to SNLI entailment problems (Bowman et al., 2015), and CoS-E (Rajani et al., 2019) adds explanations for Com-monsenseQA questions (Talmor et al., 2019). This work differs from ours in two ways. First, the authored explanations are single-hop, directly linking a question to an answer. Second, the datasets were primarily designed for (explanation) language generation, while our goal is to assemble explanations from an authoritative corpus so that they have credible provenance.\n\nOur work is quite different from prior work focusing on textual entailment. Our goal is not to decide if a sentence is entailed, but to identify a valid explanation for why. For example, a SciTail  model may predict that \"metals conduct heat\" entails \"a spoon transmits energy\", but not offer an explanation as to why. Our work fills this gap by providing an explanation (e.g., \"spoon is made of metal\", \"heat is energy\" from a larger retrieved context). Similarly, another entailmentbased dataset is FEVER (Thorne et al., 2018), testing where a larger context entails a claim. However, the FEVER task requires finding a context sentence that simply paraphrases the claim, rather than a reasoned-based explanation from more general statements -the aim of this work.\n\n\nExplanation Datasets\n\nWe now present our new datasets, first describing how we construct candidate chains for each QA pair, and then how they were annotated.\n\n\nTask Definition\n\nWe consider the task where the input is a question Q, (correct) answer A, and a corpus of sentences T . The (desired) output is a valid reasoning chain, constructed from sentences in T , that supports the answer. We define a reasoning chain as a sequence of sentences C = [s 1 , ..., s n ] plus a conclusion sen-  tence H, and a valid reasoning chain as one where C entails H. Following the textual entailment literature (Dagan et al., 2013), we define entailment using human judgements rather than formally, i.e., C entails H if a person would reasonably conclude H given C. This definition directly aligns with our end-goal, namely to provide users with a credible reason that an answer is correct.\n\nFor generating candidate chains C, we construct each C from sentences in the corpus T , as described below. Following the design of the QASC dataset, we consider just 2-sentence chains, as this was the maximum chain length used in its creation, although our approach could be extended to Nsentence chains.\n\n\nCandidate Chain Construction\n\nGiven Q + A, we use the procedure described in (Khot et al., 2020) to assemble candidate chains from T (below). This procedure aims to find plausible chains by encouraging word overlap:\n\n(1) Using ElasticSearch (a standard retrieval engine), retrieve K (=20 for efficiency) facts F1 from T using Q+A as the search query.\n\n(2) For each fact f1 ∈ F1, retrieve L (=4 to promote diversity) facts F2, each of which contains at least one word from Q+A \\ f1 and from f1 \\ Q+A; (3) Remove [f1,f2] pairs that do not contain any word from Q or A; (4) Select the top M (here, =10) [f1,f2] pairs sorted by the sum of their individual IR (Elas-ticSearch) scores.\n\nStep (3) ensures that the chain contains at least some mention of part of Q and part of A, a minimal requirement.\n\nStep (4) imposes a preference for chains with greater overlap with Q+A, and between f1 and f2. Note that this procedure does not guarantee valid chains, rather it only finds candidates that may be plausible because of their overlap. Some example chains are produced by this method are shown in Figure 2. In all our experiments, we use the QASC corpus 2 as the corpus T , namely the same corpus of 17M cleaned up facts as used in (Khot et al., 2020).\n\n\neQASC -Explanations for QASC\n\nThe original QASC dataset includes only a single gold (valid) reasoning chain for each correct answer, and no examples of invalid chains. To develop a richer explanation dataset, suitable for both training and evaluation, we generate eQASC as follows. First, we use the above algorithm to generate (up to) 10 candidate chains for each Q + correct answer option A pair. This resulted in a total of 98780 chains for QASC's 9980 questions.\n\nWe then use (Amazon Turk) crowdworkers to annotate each chain. Workers were shown the question, correct answer, and reasoning chain, e.g.:\n\nQuestion: What is formed by rivers flowing over rocks? Answer: soil Because:\n\nfact 1: Rivers erode the rocks they flow over, and fact 2: soil is formed by rocks eroding\n\nThey were then asked if fact 1 and fact 2 together were a reasonable chain of reasoning for the answer, and to promote thought were offered several categories of \"no\" answer: fact 1 alone, or fact 2 alone, or either alone, justified the answer; or the answer was not justified; or the question/answer did not make sense. (Two \"unsure\" categories were also offered but rarely selected). The full instructions to the workers are provided in the Appendix. Each chain was annotated by 3 workers. To ensure quality, only AMT Masters level workers were used, and several checks were performed: First, for cases where at least two workers agreed, if a worker's annotations disagreed with the majority unreasonably often (from inspection, judged as more than 25% of the time), then the worker was (paid but then) blocked, and his/her annotations redone. Second, if a worker's distribution of labels among the six categories substantially deviated from other workers (e.g., almost always selecting the same category), or if his/her task completion time was unrealistically low, then his/her work was sampled and checked. If it was of low quality then he/she again was (paid and) blocked, and his/her annotations redone. Pairwise agreement was 74% (2 class) or 45% (for all six subclasses), with a Fleiss κ (inter-annotator agreement) of 0.37 (\"fair agreement\" (Landis and Koch, 1977)). There was a 2 https://allenai.org/data/qasc majority agreement (using all six subclasses) of 84%, again suggesting fair annotation quality. For the final dataset, we adopt a conservative approach and treat the no majority agreement cases as invalid chains. Summary statistics are in Table 1.\n\n\neQASC-perturbed -Testing Robustness\n\nFor a test of robustness of model for reasoning chain explanation detection, we also created eQASC-perturbed, a dataset of valid eQASC reasoning chains, perturbed in a way so as to preserve their validity. To do this, we first randomly selected a subset of the valid reasoning chains from the test split of eQASC-perturbed. We then asked crowdworkers to modify the chains by replacing a word or phrase shared between at least two sentences with a different word or phrase, and to make sure that the resulting new chain remained valid. (e.g., \"amphibians\" became \"frogs\", or \"eats other animals\" became \"consumes its prey\").\n\nWe collected 855 perturbed, (still) valid reasoning chains in this way.\n\n\neOBQA -Testing Generalization\n\nFinally, to further measure the generality of our model (without re-fine-tuning), we created a smaller set of annotations for a different dataset, namely OBQA (4-way multiple choice) (Mihaylov et al., 2018). The original dataset has no explanations and no associated corpus. Thus to generate explanations, we use sentences from the QASC corpus, and annotate the top two (for all test questions) formed by the retrieval step (Section 3.2). Note that for some questions, there may be no valid justification which can be formed from the corpus. We followed the same annotation protocol as for eQASC to have crowd workers annotate the chains (Section 3.3). The resulting dataset containing 998 annotated chains, of which 9.5% were marked as valid reasoning explanations. We evaluate using all three collected datasets. We also evaluate two different ways of presenting the chain to the model to score (both train and test): (a) in its original form (with Q+A flipped to a declarative sentence), (b) in a generalized form, where repeated noun phrases are variabilized. Our interest is how well a model can perform, both to assess practical use and as a baseline for further improvement; and how the two different chain representations impact performance.\n\n\nChain Representation\n\nDeclarative form For a chain to support the answer to a question, we construct H as a declarative form of the question + answer using standard QA2D tools, e.g., (Demszky et al., 2018). For example, for the question + answer \"What can cause a forest fire? Static electricity\", the hypothesis H to be entailed by C is \"Static electricity can cause a forest fire.\". An alternate representation for H is to simply append answer to the end of the question. We did not observe any significant change in the best dev split performances on switching to the alternate representation described above.\n\nGeneralized Reasoning Chains (GRC) : We observe that specific reasoning chains are often instantiations of more general patterns. For example, in Figure 1, the specific explanation can be seen as an instantiation of the more general pattern \"X can cause Y\" AND \"Y can start Z\" IMPLIES \"X can cause Z\". We refer to such patterns as Generalized Reasoning Chains (GRCs). To encourage our model to recognize valid and invalid chains at the pattern level, we explore the following strategy: First, we transform candidate chains into generalized chains (GRCs) by replacing repeated noun phrases with variables (special tokens), a process known as delexicalization (Suntwal et al., 2019). We then train and test the model using the GRC representation. We hypothesize that distinguishing a valid justification chain from an invalid one should not need typing information in most cases.\n\nTo identify the phrases to variabilize, (1) we first perform part-of-speech tagging on the sentences, and (2) extract candidate entities by identifying repeating nouns i.e. those which occur in at least two of the sentences in the chain (We stem the words before matching, and include any matching preceding determiners and adjectives into detected entities). e.g. 'the blue whale is a mammal' and 'the blue whale breathes..' leads to detection of 'the blue whale').\n\n(3) Then, we assign a special token to each of the candidates, using a predefined set of unused tokens, which can be viewed as a set of variables. Some examples of GRCs are shown in Figure 3 and later in Figure 4, using X,Y,Z as the special token set (As our models are BERT-based, we use unusedi i ∈ {1, 2, ...} to denote these tokens).\n\n\nModel Training\n\nTo distinguish valid from invalid chains, we finetune a pre-trained BERT model (Devlin et al., 2019) for scoring the possible explanation chains. We encode a chain f 1 AND f 2 → H as:\n[CLS] f 1 [SEP] f 2 [SEP] H where [SEP]\nis a sentence boundary marker. Thereafter, we pass the chain through the BERT model (BERT-base-uncased). We employ a two layer feedforward neural network with ReLU non-linearity, as a binary classifier on the pooled [CLS] representation to predict valid vs invalid reasoning chains. Model parameters are trained to minimize the binary cross entropy loss.\n\n\nExperiments\n\nFor training, we use the annotated chains in the train split of eQASC alongwith the 'gold' chains provided in the QASC dataset (QSC gold chains  Table 2: The ability of models to identify valid explanations (classification) or rank the set of explanations for each answer (ranking), with best test results highlighted. BERT-GRC and BERT-CHAIN perform better than RETRIEVAL and BERT-QA methods, though fall short of the upper bound. Using the generalized chains (BERT-GRC) performs similarly to BERT-CHAIN, even though it is using less information (masking out overlapping noun phrases).\n\nare always considered valid reasoning chains). We try two different ways of presenting chains to the model, namely the original and generalized chain representations (GRCs), thus produce two models that we refer to as BERT-CHAIN and BERT-GRC respectively. In earlier experiments, we did not find using chains for negative answer options (which are all invalid chains) to be useful (see Section 6.3), so we use chains for correct answer options only. We use AllenNLP  toolkit to code our models. We test on all the three proposed datasets. Since we are interested in finding explanations for the correct answer, we ignore the incorrect answer chains for the purpose of testing (they still accompany the dataset and can be used as additional training data since they are invalid reasoning chains by definition: Section 6.3). For eQASC and eOBQA, we evaluate in two ways: First, treating the task as classification, we measure F1 and AUC-ROC (below). Second, treating the task as ranking the set of explanations for each answer, we measure P@1 and Normalized Discounted Cumulative Gain (NDMC) (also below). We use the trained model's probability of a chain being valid to rank the retrieved candidate chains for a given question and answer. F1 and AUC-ROC: Viewing the task as classifying individual explanations, we report the area under the ROC (Receiver Operating Characteristics) curve, treating the valid explanation chains as the positive class. ROC curves are plots of true positive rate on the Y-axis against false positive rate on the X-axis. A larger area under the curve is better, with 1.0 being the best. Additionally, we report F1 for the positive class. P@1 and NDCG: Viewing the task as ranking the set of explanations for each answer, P@1 measures the fraction of cases where the topmost ranked chain is a valid chain. This reflects the model's ability to find a valid explanation for an answer, given the retrieval module. Note that the upper bound for this measure is less than 1.0 for eQASC, as there are questions for which none of the candidate chains are valid (discussed shortly in Section 6.4). NDCG (Normalized Discounted Cumulative Gain) measures how well ranked the candidates are when ordered by score, and is a measure widely used in the learning-to-rank literature. Consider an ordered (as per decreasing score) list of N(=10) chains and corresponding labels y i ∈ {0, 1}; i ∈ 1, 2, .., N , where y i = 1 represents a valid chain. NDCG is defined per question (then averaged) as:\n\n\nMetrics\nNDCG = 1 Z N i=1 y i log 2 (i + 1)\nwhere Z is a normalization factor so that perfect ranking score (when all the valid chains are ranked above all the invalid chains) is 1. We define NDCG as 0 if there are no valid chains.\n\n\nBaselines\n\nWe compare our model with two baselines, RE-TRIEVAL and BERT-QA. Recall that our method first collects the top M candidate chains, ordered by retrieval score (Section 3.2). Thus a simple baseline is to use that retrieval score itself as a measure of chain validity. This is the RETRIEVAL baseline.\n\nWe also consider a baseline, BERT-QA, by adapting the approach of Perez et al. (2019) to our task. In the original work, given a passage of text and a multiple choice question, the system identifies the sentence(s) S that are the most convincing evidence for a given answer option a i . To do this, it iteratively finds the sentence that most increases the probability of a i when added to an (initially empty) pool of evidence, using a QA system originally trained on the entire passage. In other words, the probability increase is used as a measure of how   Table 4: Given an immaterial perturbation to a reasoning chain, a model's predicted probability of validity should not change if it is making consistent predictions. We evaluate the absolute difference in probability scores of original and edited reasoning chains in eQASC-perturbed. We observe that for 40.8% and 0.23% of the cases did not show any change in score for BERT-GRC and BERT-GRC respectively. The results suggest that GRCs improve prediction consistency.\n\nconvincing the evidence sentence is. We adapt this by instead finding the chain that most increases the probability of a i (compared with an empty pool of evidence), using a QA system originally trained with all the candidate chains for a i . For the QA system, we use the straightforward BERT-based model described in (Khot et al., 2020). We then use that increase in probability of the correct answer option, measured for each chain, as a measure of chain validity. We call this baseline BERT-QA.\n\n\nResults: Performance on eQASC\n\nThe test results on the eQASC are shown in Table 2.\n\nThere are several important findings: 1. The best performing versions of BERT-CHAIN and BERT-GRC significantly outperforms the baselines. In particular, the AUC-ROC is 11% higher (absolute), NDCG rises from 0.60 to 0.64, and P@1 rises from 0.47 to 0.54 for BERT-GRC, indicating substantial improvement. 2. The generalized chain representation does not lead to a significant reduction (nor gain) in performance, despite abstracting away some of the lexical details through variabilization. This suggests the abstracted representation is as good as the original, and may have some additional benefits  (Section 5.4).\n\n3. The BERT-QA baseline scores surprisingly low. A possible explanation is that, in the original setting, Perez et al. (2019)'s model learned to spot a (usually) single relevant sentence among a passage of irrelevant sentences. In our setting, though, all the chains are partially relevant, making it harder for the model to distinguish just one as central.\n\n\nResults:Consistency in eQASC-perturbed\n\nWe posit that the generalized (GRC) chain representation may improve robustness to small changes in the chains, as the GRC abstracts away some of the lexical details. To evaluate this, we use the crowdworker-perturbed, (still) valid chains in eQASC-perturbed. As the perturbed chain often follows the same/similar reasoning as the original one, this test can be considered one of consistency: the model's prediction should stay same.\n\nTo measure this, we record the model's predicted probability of a chain being valid, then compare these probabilities for each pair of original and perturbed chains. Ideally, if the model is consistent and the perturbations are immaterial, then these probabilities should not change.\n\nThe results are shown in Table 4. In a large fraction of the instances, generalized chain representation exhibits no change. This is perhaps expected given the design of the GRC representations. Thus, X can cause Y AND Y can start Z → X can cause Z X is used for Y AND Z are X → Z are used for Y X are formed by Y AND Y are made of Z → X are formed by Z X are Y AND Y are Z → X are Z X produce Y AND Y is a Z → X produce Z X increases Y AND X occurs as Z → Z increases Y X changes Y AND Y is Z → X changes Z X is Y AND X carries Z → Y carries Z X changes an Y AND Z are examples of X → Z change an Y X are formed by Y AND X are formed through Z → Y can cause Z X changes a Y AND Z start most X → Z can change Y Figure 4: Examples of some of the highest scoring generalized reasoning chains (GRCs) found in eQASC.\n\nusing GRC not only achieves similar performance ( Table 2), but produces more consistent predictions for certain types of perturbations. Table 3 shows some examples.\n\n\nResults: Generalization to eOBQA\n\nWe are also interested in the generality of the model, i.e., how well it can transfer to a new dataset with no explanation training data (i.e., the situation with most datasets). To measure this, we ran our (eQASC-trained) models on eOBQA, namely the annotated top-2 candidate chains for OBQA test questions, to see if the models can still detect valid chains in this new data.\n\nThe results are shown in Table 5, and again illustrate that the BERT trained models continue to significantly outperform the retrieval baseline. High P @1 scores suggest that model is able to score a valid reasoning as the highest among the candidate whenever there is at least one such valid chain. The high AUC-ROC suggests that the model is able to effectively distinguish valid from invalid chains.\n\n\nAnalysis and Discussions\n\n\nGRC as Explicit Reasoning Rationale\n\nA potentially useful by-product of GRCs is that the underling reasoning patterns are made explicit. For example, Figure 4 show some of the top-scoring GRCs. This may be useful for helping a user understand the rationale behind a chain, and a repository of high-scoring patterns may be useful as a knowledge resource in its own right. This direction is loosely related to certain prior works on inducing general semantic reasoning rules (such as Tsuchida et al. (2011) who propose a method that induces rules for semantic relations based on a set of seed relation instances.)\n\n\nError Analysis\n\nHowever, the BERT-GRC model was not always able to correctly distinguish valid from invalid GRC explanations. To better understand why, we analyzed 100 scoring failures on eQASC (dev), looking at the top 50 chains (i.e., ranked as most valid by our model) that were in fact annotated as invalid (false positives, FP), and the bottom 50 chains (ranked most invalid) that were in fact marked valid (false negatives, FN). We observed four main sources of error:\n\n1. Over-generalization: (≈ 45% of the FP cases, ≈ 40% of FN cases). Some generalized reasoning chains are merely plausible rather than a deductive proof, meaning that their instantiations may be annotated as valid or invalid depending on the context. For example, for the GRC X contains Y AND Z are in X → Z are in Y its instantation may have been marked as valid in Cells contain nuclei AND Proteins are in cells → Proteins are in nuclei but not for Smog contains ozone AND Particulates are in smog → Particulates are in ozone (Ozone itself does not contain particulates). Here the context is important to the perception of validity, but has been lost in the generalized form. 2. Incorrect Declarative Form: (FP ≈ 20%, FN ≈ 30%). Sometimes the conversion from question + answer to a declarative form H goes wrong, eg\n\nWhat do octopuses use ink to hide from? sharks was converted to the nonsensical sentence Octopuses do use sharks ink to hide from. In these cases, the annotations on chains supporting the original answer do not meaningfully transfer to the declarative formulation. (Here, FP/FN are due to label rather than prediction errors). 3. Shared Entity Detection: (FP ≈ 10%, FN ≈ 10%) To detect and variabilize shared entities during GRC construction, we search for repeated noun phrases in the sentences. This operational definition of \"shared entities\" can sometimes make mistakes, for example sometimes shared entities may be missed, e.g., frog and bullfrog, or incorrectly equated due to stemming or wrong part of speech tagging, e.g., organic and organism. The resulting GRC may be thus wrong or not fully generalized, causing some errors. 4. Model Failures: (FP ≈ 25%, FN ≈ 10%) The remaining failures appear to be simply due the model itself, representing incorrect generalization from the training data. Additional training data may help alleviate such problems.\n\nDespite these, GRCs often abstract away irrelevant details, and may be worthy of further study in explanation research.\n\n\nChains for Negative Answer Options\n\nWe also investigated whether we could skip using the eQASC annotations completely, and instead simply use the single QASC gold chains as positives, and chains for wrong answers as negatives (a form of distant supervision). However, we observed that but the results were significantly worse. We also tried adding chains for wrong answers as additional negative examples to the full eQASC dataset. However, we observed that this did not significantly improve (or hurt) scores. One possible reason for this is that eQASC may already contain enough training signal. Another possible reason is that (invalid) chains for wrong answers may qualitatively differ in some way from invalid reasoning chains for right answers, thus this additional data does not provide reliable new signal.\n\n\nLimitations of Retrieval\n\nOur focus in this paper has been on recognizing valid chains of reasoning, assuming a retrieval step that retrieves a reasonable pool of candidates to start with (Section 3.2). However, the retrieval step itself is not perfect: For QASC, designed so that at least one valid chain always exists, the retrieved pool of 10 contains no valid chains for 24% of the questions (upper bound in Table 2), capping the overall system's performance. To gauge the performance of our model when coupled with an improved retrieval system, we ran an experiment where, at test time, we explicitly add the gold chain to the candidate pool if it does not get retrieved (and even if there is some other valid chain already in the pool). We find the P@1 score rises from 0.54 (Table 2) to 0.82 (upper bound is now 1.0). This indicates the model scoring algorithm is performing well, and that improving the retrieval system, e.g., by considering may more chains per question or modifying the search algorithm itself, is likely to have the biggest impact on improving the overall system. Note also that the corpus itself is an important component: finding valid chains requires the corpus to contain a broad diversity of general facts to build chains from, hence expanding/filtering the corpus itself is another avenue for improvement.\n\n\nFuture Directions\n\nThe main purpose of this dataset is to generate explanations as an end-goal in itself, rather than improve QA scores (we do not make any claims in terms of QA accuracy or ability to improve QA scores). Although much of NLP has focused on QA scores, more recent work has targeted explanation as an end-goal in itself, with ultimate benefits for tutoring, validation, and trust. Nonetheless, a useful future direction is exploring answer prediction and explanation prediction as joint goals, and perhaps they can benefit each other.\n\nAdditionally, in the current work we have explored only a sequence of two sentences as an explanation for the third. Extending the proposed approaches for longer chains is an important future direction. We have proposed a technique for reducing reasoning chains to abstract chains. This technique makes assumptions about being able to match overlapping words. A future extension could explore more robust techniques for identifying abstract chains which do not make such assumptions.\n\n\nSummary and Conclusion\n\nExplaining answers to multihop questions is important for understanding why an answer may be correct, but there is currently a dearth of suitable, annotated data. To address this, and promote progress in explanation, we contribute three new explanation datasets, including one with over 98k annotated reasoning chains -by far the largest repository of annotated, corpus-derived explanations to date. We also have shown this data can significantly improve explanation quality on both in-domain (QASC) and out-of-domain (OBQA) tasks. Finally, we have proposed and explored using a lightweight method to achieve a delexicalized representation of reasoning chains. While preserving explanation quality (despite removing details), this representation appears to be more robust to certain perturbations.\n\nFigure 2 :\n2QASC contains multiple-choice questions, plus one gold (valid) reasoning chain for the correct answer.\n\nFigure 3 :\n3Generalized reasoning chains (GRCs) are formed by replacing repeated noun phrases with variables.\n\nTable 1 :\n1Summary statistics for eQASC, the annotated chains for the correct answers in QASC. Each chain is tagged by three annotators, and we use majority judgement.\n\n\ninsects can spread disease and destroy crops insects can spread disease and decimate crops AND food crops are produced for local consumption AND food crops are produced for local consumption 0.11 0.00 → insects can destroy food → insects can decimate foodOriginal chain \n\nEdited chain \nBERT BERT \n-CHAIN -GRC \n\ntadpole changes into a frog \ntadpole changes into a frog \nAND the frog is a totem of metamorphosis \nAND the frog is a totem of transformation \n0.21 \n0.00 \n→ tadpoles undergo metamorphosis \n→ tadpoles undergo transformation \n\n\n\nTable 3 :\n3Prediction Consistency: Examples from eQASC-perturbed with changes in probability score (of \nbeing a valid reasoning chain) for different methods. Here, BERT-GRC has (desirably) not changed its score due to \nan immaterial perturbation, while BERT-CHAIN has, indicating greater stability for the GRC representation. This \ntrend holds generally (Table 4). \n\n% cases with \nModel \n0.0 change \n\nBERT-CHAIN \n0.23% \nBERT-GRC \n40.80% \n\n\n\nTable 5 :\n5Application of our (eQASC-trained) model to \na new dataset eOBQA. The high AUC-ROC figure sug-\ngests the model remains good at distinguishing valid \nfrom invalid chains. We report P@1 only for the ques-\ntions which have at least one valid chain, i.e., where \nranking is meaningful. \n\n\nCode and datasets can be found at https://allenai. org/data/eqasc\nLearning to Score ChainsOur full approach to explaining an answer has two steps, namely candidate chain retrieval followed by chain scoring, to find the highest-ranked chain supporting an answer. For chain retrieval, we assume the same procedure described earlier to identify candidate chains. For chain scoring, we train a BERT-based model to distinguish valid chains from invalid ones, using the training data collected in the eQASC dataset, as we now describe.\nAcknowledgements We thank Ashish Sabharwal, Tushar Khot, Dirk Groeneveld, Taylor Berg-Kirkpatrick, and anonymous reviewers for useful comments and feedback. We thank Michal Guerquin for helping with the QA2D tool. This work was partly carried out when HJ was interning at AI2. HJ is funded in part by a Adobe Research Fellowship.APPENDIXA. Additional Implementation Details• Optimizer: We use Adam optimizer with initial learning rate of 2e-5• Number of params: ∼ 110M parameters (Bert-base uncased and classification layer)• Hyper-parameters: We search over following options for hyperparameter (1) one layer vs two layer classifier (2) negative class weight ( (0.1, 0.2, ..., 0.9)) (3) using negative option chains or not; for BERT-GRC as well as BERT-CHAIN. We perform model selection based on best dev split performance as per P @1.• Best model configuration for BERT-Chain: negative class weight = 0.2; without using negative option chains; using a two layer classifier. Best model configuration for BERT-GRC: negative class weight = 0.3; without using negative option chains; using a two layer classifier.B. Instructions to CrowdworkersBelow are the instructions provided to the (Amazon Mechanical Turk) crowdworkers for chain annotation.Instructions (click here to collapse/expand instructions)As part of an artificial intelligence (AI) project, we are trying to teach the computer to reason. We are planning to eventually make the system available as a free, open source resource on the internet.To measure how well the computer is reasoning, we are wanting to assess whether the computer can explain a (correct) answer to a question. The HIT here is to look at five computer-generated explanations for five answers, and assess whether the explanations seem reasonable or not.Each explanation consists of two facts. A good explanation is one where the two facts combine or \"chain\" together to explain an answer in a sensible way. Or, in some cases, just one of the facts is sufficient to justify the answer. For example:Question: What is formed by rivers flowing over rocks? Answer: soil Because: fact 1: Rivers erode the rocks they flow over, and fact 2: soil is formed by rocks erodingNow select a choice below: Do fact 1 and fact 2 seem like a good explanation for the Answer to the Question?Yes -fact 1 and fact 2 together seems like a reasonable chain of reasoning for the answer Yes -fact 1 alone is enough to justify the answer.Yes -fact 2 alone is enough to justify the answer.Yes -fact 1 alone, AND fact 2 alone, are both separately enough to justify the answer.No -the facts don't combine together to support the answer No -the question/answer itself is incorrect/doesn't make sense.Not quite -the facts combine, but an additional fact is needed:Additional fact:Unsure -this seems like a borderline case NOTE: In this case, as rivers erode rocks (fact 1), and eroding rocks forms soil (fact 2), it follows that the answer to What is formed by rivers flowing over rocks? is soil. Thus fact 1 and fact 2 seem like a reasonable explanation for the given Answer (soil).Some important notes:A good explanation is one with a reasonable chain of reasoning. Examples are below. Think of what would be a good explanation if you were explaining an Answer to a friend, or writing an explanation as part of an exam. Additionally, in some cases a single fact is enough to justify the Answer (i.e., the other fact is not needed). We'd like you to identify these caess also. A bad explanation is one where the facts don't combine into a sensible line of reasoning (e.g., the facts are irrelevant to the question, or don't arrive at the Answer) Ignore minor grammatical errors, e.g., typo's, extra words -so long as it's clear what the facts are saying.If the question/answer itself seems wrong or weird, seleect the \"No -the question/answer itself is incorrect/doesn't make sense\" option Note: a few questions are \"complete the sentence\" form, e.g., \"Question: Dogs are... Answer: mammals\" Feel free to use the Web for information, if that helps assess the explanations In all these cases, you can see a chain of reasoning from the question to the answer using the facts.The following are examples of a single fact explanations (\"Yes -fact 1/2 alone is enough to justify the answer\"):Question: what do flowers attract? Answer: bees Because: fact 1: How flowers attract honey bees and why they do it., and fact 2: bees convert nectar into honey Here, fact 1 alone is enough to justify the answer that \"flowers attract bees\"Question: What has permeable skin? Answer: frogs Because:fact 1: skin is used for breathing air by frogs, and fact 2: Frogs have permeable skin that both breathes and takes in water. Here, fact 2 alone is enough to justify the answer that \"frogs have permeable skin\"The following is an example of a bad question/answer (\"No -the question/answer itself is incorrect/doesn't make sense.\") Question: What powers rockets? Answer: Mechanical energy Because:fact 1: Power is what they seek, and power is what they get., and fact 2: Most ecosystems get energy from sunlight. The answer seems wrong here -rockets are powered by chemical energy, not mechanical energy. fact 1: Sweat glands produce sweat., and fact 2: when the body is hot , sweat is produced to cool the bodyThe following is an example of an additional fact being needed (\"Not quite -the facts combine, but an additional fact is needed\"): Question: Snow leopards coats can be used for what? Answer: protection from the cold Because: fact 1: Snow leopards coats have thick, dense fur., and fact 2: thick fur protects animals in winter Here an additional fact that it is cold in winter is needed:Additional fact: It is cold in winter.Thank you for your help! You rock!\nA large annotated corpus for learning natural language inference. R Samuel, Gabor Bowman, Christopher Angeli, Christopher D Potts, Manning, abs/1508.05326ArXiv. Samuel R. Bowman, Gabor Angeli, Christopher Potts, and Christopher D. Manning. 2015. A large anno- tated corpus for learning natural language inference. ArXiv, abs/1508.05326.\n\ne-snli: Natural language inference with natural language explanations. Oana-Maria Camburu, Tim Rocktäschel, Thomas Lukasiewicz, Phil Blunsom, Advances in Neural Information Processing Systems 31: Annual Conference on Neural Information Processing. NeurIPS; Montréal, CanadaOana-Maria Camburu, Tim Rocktäschel, Thomas Lukasiewicz, and Phil Blunsom. 2018. e-snli: Nat- ural language inference with natural language expla- nations. In Advances in Neural Information Process- ing Systems 31: Annual Conference on Neural Infor- mation Processing Systems 2018, NeurIPS 2018, 3- 8 December 2018, Montréal, Canada, pages 9560- 9572.\n\nSimple and effective multi-paragraph reading comprehension. Christopher Clark, Matt Gardner, 10.18653/v1/P18-1078Proceedings of the 56th Annual Meeting of the Association for Computational Linguistics, ACL 2018. the 56th Annual Meeting of the Association for Computational Linguistics, ACL 2018Association for Computational LinguisticsChristopher Clark and Matt Gardner. 2018. Simple and effective multi-paragraph reading comprehen- sion. In Proceedings of the 56th Annual Meeting of the Association for Computational Linguistics, ACL 2018, pages 845-855. Association for Compu- tational Linguistics.\n\nRecognizing Textual Entailment: Models and Applications. Synthesis Lectures on Human Language Technologies. Dan Ido Dagan, Mark Roth, Fabio Massimo Sammons, Zanzotto, 10.2200/S00509ED1V01Y201305HLT023Morgan & Claypool PublishersIdo Dagan, Dan Roth, Mark Sammons, and Fabio Mas- simo Zanzotto. 2013. Recognizing Textual Entail- ment: Models and Applications. Synthesis Lectures on Human Language Technologies. Morgan & Clay- pool Publishers.\n\nTransforming question answering datasets into natural language inference datasets. Dorottya Demszky, Kelvin Guu, Percy Liang, abs/1809.02922ArXiv. Dorottya Demszky, Kelvin Guu, and Percy Liang. 2018. Transforming question answering datasets into natural language inference datasets. ArXiv, abs/1809.02922.\n\nBERT: pre-training of deep bidirectional transformers for language understanding. Jacob Devlin, Ming-Wei Chang, Kenton Lee, Kristina Toutanova, 10.18653/v1/n19-1423Proceedings of the 2019 Conference of the North American Chapter of the Association for Computational Linguistics: Human Language Technologies, NAACL-HLT 2019. the 2019 Conference of the North American Chapter of the Association for Computational Linguistics: Human Language Technologies, NAACL-HLT 2019Association for Computational LinguisticsJacob Devlin, Ming-Wei Chang, Kenton Lee, and Kristina Toutanova. 2019. BERT: pre-training of deep bidirectional transformers for language under- standing. In Proceedings of the 2019 Conference of the North American Chapter of the Association for Computational Linguistics: Human Language Tech- nologies, NAACL-HLT 2019, pages 4171-4186. As- sociation for Computational Linguistics.\n\n. Jay Deyoung, Sarthak Jain, Nazneen Fatema Rajani, E Lehman, Caiming Xiong, R Socher, Byron C , Jay DeYoung, Sarthak Jain, Nazneen Fatema Rajani, E. Lehman, Caiming Xiong, R. Socher, and Byron C.\n\nEraser: A benchmark to evaluate rationalized nlp models. Wallace, ACL. Wallace. 2020. Eraser: A benchmark to evaluate ra- tionalized nlp models. In ACL.\n\nAllennlp: A deep semantic natural language processing platform. Matt Gardner, Joel Grus, Mark Neumann, Oyvind Tafjord, Pradeep Dasigi, Nelson F Liu, Matthew E Peters, Michael Schmitz, Luke Zettlemoyer, abs/1803.07640CoRRMatt Gardner, Joel Grus, Mark Neumann, Oyvind Tafjord, Pradeep Dasigi, Nelson F. Liu, Matthew E. Peters, Michael Schmitz, and Luke Zettlemoyer. 2018. Allennlp: A deep semantic natural language processing platform. CoRR, abs/1803.07640.\n\nTraining classifiers with natural language explanations. Braden Hancock, Paroma Varma, Stephanie Wang, Martin Bringmann, Percy Liang, Christopher Ré, Proceedings of the conference. Association for Computational Linguistics. Meeting. the conference. Association for Computational Linguistics. MeetingBraden Hancock, Paroma Varma, Stephanie Wang, Martin Bringmann, Percy Liang, and Christopher Ré. 2018. Training classifiers with natural language explanations. Proceedings of the conference. As- sociation for Computational Linguistics. Meeting, 2018:1884-1895.\n\nRC-QED: evaluating natural language derivations in multi-hop reading comprehension. Naoya Inoue, Pontus Stenetorp, Kentaro Inui, abs/1910.04601CoRRNaoya Inoue, Pontus Stenetorp, and Kentaro Inui. 2019. RC-QED: evaluating natural language deriva- tions in multi-hop reading comprehension. CoRR, abs/1910.04601.\n\nQasc: A dataset for question answering via sentence composition. Tushar Khot, Peter Clark, Michal Guerquin, Peter Jansen, Ashish Sabharwal, AAAI Conference on Artificial Intelligence. Tushar Khot, Peter Clark, Michal Guerquin, Peter Jansen, and Ashish Sabharwal. 2020. Qasc: A dataset for question answering via sentence compo- sition. In AAAI Conference on Artificial Intelligence 2020.\n\nScitail: A textual entailment dataset from science question answering. Tushar Khot, Ashish Sabharwal, Peter Clark, Proceedings of the Thirty-Second AAAI Conference on Artificial Intelligence, (AAAI-18). the Thirty-Second AAAI Conference on Artificial Intelligence, (AAAI-18)AAAI PressTushar Khot, Ashish Sabharwal, and Peter Clark. 2018. Scitail: A textual entailment dataset from science question answering. In Proceedings of the Thirty- Second AAAI Conference on Artificial Intelligence, (AAAI-18), pages 5189-5197. AAAI Press.\n\nThe measurement of oberver agreement for categorical data. J R Landis, G G Koch, Biometrics. 33J. R. Landis and G. G. Koch. 1977. The measurement of oberver agreement for categorical data. Biomet- rics, 33:159-174.\n\nCan a suit of armor conduct electricity? a new dataset for open book question answering. Todor Mihaylov, Peter Clark, Tushar Khot, Ashish Sabharwal, 10.18653/v1/d18-1260EMNLP. Todor Mihaylov, Peter Clark, Tushar Khot, and Ashish Sabharwal. 2018. Can a suit of armor conduct elec- tricity? a new dataset for open book question answer- ing. In EMNLP.\n\nFinding generalizable evidence by learning to convince q\\&a models. Ethan Perez, Siddharth Karamcheti, Rob Fergus, Jason Weston, Douwe Kiela, Kyunghyun Cho, 10.18653/v1/D19-1244Proceedings of the 2019 Conference on Empirical Methods in Natural Language Processing and the 9th International Joint Conference on Natural Language Processing (EMNLP-IJCNLP). the 2019 Conference on Empirical Methods in Natural Language Processing and the 9th International Joint Conference on Natural Language Processing (EMNLP-IJCNLP)Ethan Perez, Siddharth Karamcheti, Rob Fergus, Ja- son Weston, Douwe Kiela, and Kyunghyun Cho. 2019. Finding generalizable evidence by learning to convince q\\&a models. In Proceedings of the 2019 Conference on Empirical Methods in Natu- ral Language Processing and the 9th International Joint Conference on Natural Language Processing (EMNLP-IJCNLP), pages 2402-2411.\n\nExplain yourself! leveraging language models for commonsense reasoning. Bryan Nazneen Fatema Rajani, Caiming Mccann, Richard Xiong, Socher, 10.18653/v1/p19-1487Proceedings of the 57th Conference of the Association for Computational Linguistics, ACL 2019. the 57th Conference of the Association for Computational Linguistics, ACL 2019Association for Computational LinguisticsNazneen Fatema Rajani, Bryan McCann, Caiming Xiong, and Richard Socher. 2019. Explain yourself! leveraging language models for commonsense rea- soning. In Proceedings of the 57th Conference of the Association for Computational Linguistics, ACL 2019, pages 4932-4942. Association for Computa- tional Linguistics.\n\nBidirectional attention flow for machine comprehension. Minjoon Seo, Aniruddha Kembhavi, Ali Farhadi, Hannaneh Hajishirzi, ICLR. Minjoon Seo, Aniruddha Kembhavi, Ali Farhadi, and Hannaneh Hajishirzi. 2016. Bidirectional attention flow for machine comprehension. In ICLR.\n\nOn the importance of delexicalization for fact verification. Sandeep Suntwal, Mithun Paul, Rebecca Sharp, Mihai Surdeanu, 10.18653/v1/D19-1340Proceedings of the 2019 Conference on Empirical Methods in Natural Language Processing and the 9th International Joint Conference on Natural Language Processing (EMNLP-IJCNLP). the 2019 Conference on Empirical Methods in Natural Language Processing and the 9th International Joint Conference on Natural Language Processing (EMNLP-IJCNLP)Sandeep Suntwal, Mithun Paul, Rebecca Sharp, and Mihai Surdeanu. 2019. On the importance of delex- icalization for fact verification. In Proceedings of the 2019 Conference on Empirical Methods in Nat- ural Language Processing and the 9th International Joint Conference on Natural Language Processing (EMNLP-IJCNLP), pages 3404-3409.\n\nCommonsenseqa: A question answering challenge targeting commonsense knowledge. Alon Talmor, Jonathan Herzig, Nicholas Lourie, Jonathan Berant, NAACL-HLT. Alon Talmor, Jonathan Herzig, Nicholas Lourie, and Jonathan Berant. 2019. Commonsenseqa: A ques- tion answering challenge targeting commonsense knowledge. In NAACL-HLT.\n\nThe fact extraction and verification (fever) shared task. James Thorne, Andreas Vlachos, Oana Cocarascu, Proceedings of the First Workshop on Fact Extraction and VERification (FEVER). the First Workshop on Fact Extraction and VERification (FEVER)Christos Christodoulopoulos, and Arpit MittalJames Thorne, Andreas Vlachos, Oana Cocarascu, Christos Christodoulopoulos, and Arpit Mittal. 2018. The fact extraction and verification (fever) shared task. In Proceedings of the First Workshop on Fact Extraction and VERification (FEVER), pages 1-9.\n\nToward finding semantic relations not written in a single sentence: An inference method using auto-discovered rules. Masaaki Tsuchida, Kentaro Torisawa, Stijn De, Jong-Hoon Saeger, Oh, Chikara Jun&apos;ichi Kazama, Hayato Hashimoto, Ohwada, Fifth International Joint Conference on Natural Language Processing. Chiang MaiThailand2011The Association for Computer LinguisticsMasaaki Tsuchida, Kentaro Torisawa, Stijn De Saeger, Jong-Hoon Oh, Jun'ichi Kazama, Chikara Hashimoto, and Hayato Ohwada. 2011. Toward finding semantic relations not written in a single sen- tence: An inference method using auto-discovered rules. In Fifth International Joint Conference on Natural Language Processing, IJCNLP 2011, Chi- ang Mai, Thailand, November 8-13, 2011, pages 902-910. The Association for Computer Linguis- tics.\n\nConstructing datasets for multi-hop reading comprehension across documents. Johannes Welbl, Pontus Stenetorp, Sebastian Riedel, Transactions of the Association for Computational Linguistics. 6Johannes Welbl, Pontus Stenetorp, and Sebastian Riedel. 2018. Constructing datasets for multi-hop reading comprehension across documents. Transac- tions of the Association for Computational Linguis- tics, 6:287-302.\n\nZhilin Yang, Peng Qi, Saizheng Zhang, Yoshua Bengio, W William, Ruslan Cohen, Christopher D Salakhutdinov, Manning, 10.18653/v1/d18-1259arXiv:1809.09600Hotpotqa: A dataset for diverse, explainable multi-hop question answering. arXiv preprintZhilin Yang, Peng Qi, Saizheng Zhang, Yoshua Ben- gio, William W Cohen, Ruslan Salakhutdinov, and Christopher D Manning. 2018. Hotpotqa: A dataset for diverse, explainable multi-hop question answer- ing. arXiv preprint arXiv:1809.09600.\n\nTeaching machine comprehension with compositional explanations. Qinyuan Ye, Xiaozhen Huang, Xiang Ren, abs/2005.00806ArXiv. Qinyuan Ye, Xiaozhen Huang, and Xiang Ren. 2020. Teaching machine comprehension with composi- tional explanations. ArXiv, abs/2005.00806.\n", "annotations": {"author": "[{\"end\":185,\"start\":114},{\"end\":242,\"start\":186}]", "publisher": null, "author_last_name": "[{\"end\":128,\"start\":120},{\"end\":197,\"start\":192}]", "author_first_name": "[{\"end\":119,\"start\":114},{\"end\":191,\"start\":186}]", "author_affiliation": "[{\"end\":184,\"start\":130},{\"end\":241,\"start\":218}]", "title": "[{\"end\":111,\"start\":1},{\"end\":353,\"start\":243}]", "venue": null, "abstract": "[{\"end\":1808,\"start\":355}]", "bib_ref": "[{\"attributes\":{\"ref_id\":\"b2\"},\"end\":1933,\"start\":1908},{\"attributes\":{\"ref_id\":\"b23\"},\"end\":3174,\"start\":3155},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":3896,\"start\":3873},{\"attributes\":{\"ref_id\":\"b11\"},\"end\":3939,\"start\":3920},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":5462,\"start\":5442},{\"end\":5537,\"start\":5515},{\"attributes\":{\"ref_id\":\"b17\"},\"end\":5589,\"start\":5571},{\"attributes\":{\"ref_id\":\"b16\"},\"end\":5664,\"start\":5643},{\"attributes\":{\"ref_id\":\"b24\"},\"end\":5734,\"start\":5717},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":5755,\"start\":5734},{\"attributes\":{\"ref_id\":\"b23\"},\"end\":6182,\"start\":6163},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":6312,\"start\":6292},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":6449,\"start\":6426},{\"attributes\":{\"ref_id\":\"b22\"},\"end\":6594,\"start\":6574},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":6624,\"start\":6601},{\"attributes\":{\"ref_id\":\"b11\"},\"end\":6654,\"start\":6635},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":7007,\"start\":6985},{\"attributes\":{\"ref_id\":\"b0\"},\"end\":7088,\"start\":7067},{\"attributes\":{\"ref_id\":\"b19\"},\"end\":7190,\"start\":7169},{\"attributes\":{\"ref_id\":\"b20\"},\"end\":8048,\"start\":8027},{\"attributes\":{\"ref_id\":\"b11\"},\"end\":9571,\"start\":9552},{\"attributes\":{\"ref_id\":\"b11\"},\"end\":10719,\"start\":10700},{\"attributes\":{\"ref_id\":\"b13\"},\"end\":12875,\"start\":12852},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":14145,\"start\":14122},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":15396,\"start\":15374},{\"attributes\":{\"ref_id\":\"b18\"},\"end\":16485,\"start\":16463},{\"attributes\":{\"ref_id\":\"b5\"},\"end\":17608,\"start\":17587},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":21828,\"start\":21809},{\"attributes\":{\"ref_id\":\"b11\"},\"end\":23110,\"start\":23091},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":24098,\"start\":24079},{\"attributes\":{\"ref_id\":\"b21\"},\"end\":27424,\"start\":27402}]", "figure": "[{\"attributes\":{\"id\":\"fig_0\"},\"end\":34146,\"start\":34031},{\"attributes\":{\"id\":\"fig_1\"},\"end\":34257,\"start\":34147},{\"attributes\":{\"id\":\"tab_1\",\"type\":\"table\"},\"end\":34426,\"start\":34258},{\"attributes\":{\"id\":\"tab_3\",\"type\":\"table\"},\"end\":34965,\"start\":34427},{\"attributes\":{\"id\":\"tab_4\",\"type\":\"table\"},\"end\":35406,\"start\":34966},{\"attributes\":{\"id\":\"tab_6\",\"type\":\"table\"},\"end\":35703,\"start\":35407}]", "paragraph": "[{\"end\":2720,\"start\":1824},{\"end\":3852,\"start\":2722},{\"end\":4213,\"start\":3854},{\"end\":5286,\"start\":4215},{\"end\":5886,\"start\":5303},{\"end\":6915,\"start\":5888},{\"end\":7518,\"start\":6917},{\"end\":8285,\"start\":7520},{\"end\":8445,\"start\":8310},{\"end\":9165,\"start\":8465},{\"end\":9472,\"start\":9167},{\"end\":9690,\"start\":9505},{\"end\":9825,\"start\":9692},{\"end\":10154,\"start\":9827},{\"end\":10269,\"start\":10156},{\"end\":10720,\"start\":10271},{\"end\":11189,\"start\":10753},{\"end\":11329,\"start\":11191},{\"end\":11407,\"start\":11331},{\"end\":11499,\"start\":11409},{\"end\":13169,\"start\":11501},{\"end\":13832,\"start\":13209},{\"end\":13905,\"start\":13834},{\"end\":15188,\"start\":13939},{\"end\":15803,\"start\":15213},{\"end\":16682,\"start\":15805},{\"end\":17150,\"start\":16684},{\"end\":17489,\"start\":17152},{\"end\":17691,\"start\":17508},{\"end\":18086,\"start\":17732},{\"end\":18688,\"start\":18102},{\"end\":21197,\"start\":18690},{\"end\":21430,\"start\":21243},{\"end\":21741,\"start\":21444},{\"end\":22770,\"start\":21743},{\"end\":23270,\"start\":22772},{\"end\":23355,\"start\":23304},{\"end\":23971,\"start\":23357},{\"end\":24330,\"start\":23973},{\"end\":24806,\"start\":24373},{\"end\":25091,\"start\":24808},{\"end\":25905,\"start\":25093},{\"end\":26072,\"start\":25907},{\"end\":26486,\"start\":26109},{\"end\":26890,\"start\":26488},{\"end\":27531,\"start\":26957},{\"end\":28008,\"start\":27550},{\"end\":28827,\"start\":28010},{\"end\":29890,\"start\":28829},{\"end\":30011,\"start\":29892},{\"end\":30828,\"start\":30050},{\"end\":32169,\"start\":30857},{\"end\":32721,\"start\":32191},{\"end\":33206,\"start\":32723},{\"end\":34030,\"start\":33233}]", "formula": "[{\"attributes\":{\"id\":\"formula_0\"},\"end\":17731,\"start\":17692},{\"attributes\":{\"id\":\"formula_1\"},\"end\":21242,\"start\":21208}]", "table_ref": "[{\"attributes\":{\"ref_id\":\"tab_1\"},\"end\":13168,\"start\":13161},{\"end\":18254,\"start\":18247},{\"end\":22310,\"start\":22303},{\"end\":23354,\"start\":23347},{\"end\":25125,\"start\":25118},{\"end\":25964,\"start\":25957},{\"attributes\":{\"ref_id\":\"tab_4\"},\"end\":26051,\"start\":26044},{\"attributes\":{\"ref_id\":\"tab_6\"},\"end\":26520,\"start\":26513},{\"end\":31250,\"start\":31243},{\"end\":31621,\"start\":31612}]", "section_header": "[{\"attributes\":{\"n\":\"1\"},\"end\":1822,\"start\":1810},{\"attributes\":{\"n\":\"2\"},\"end\":5301,\"start\":5289},{\"attributes\":{\"n\":\"3\"},\"end\":8308,\"start\":8288},{\"attributes\":{\"n\":\"3.1\"},\"end\":8463,\"start\":8448},{\"attributes\":{\"n\":\"3.2\"},\"end\":9503,\"start\":9475},{\"attributes\":{\"n\":\"3.3\"},\"end\":10751,\"start\":10723},{\"attributes\":{\"n\":\"3.4\"},\"end\":13207,\"start\":13172},{\"attributes\":{\"n\":\"3.5\"},\"end\":13937,\"start\":13908},{\"attributes\":{\"n\":\"4.1\"},\"end\":15211,\"start\":15191},{\"attributes\":{\"n\":\"4.2\"},\"end\":17506,\"start\":17492},{\"attributes\":{\"n\":\"5\"},\"end\":18100,\"start\":18089},{\"attributes\":{\"n\":\"5.1\"},\"end\":21207,\"start\":21200},{\"attributes\":{\"n\":\"5.2\"},\"end\":21442,\"start\":21433},{\"attributes\":{\"n\":\"5.3\"},\"end\":23302,\"start\":23273},{\"attributes\":{\"n\":\"5.4\"},\"end\":24371,\"start\":24333},{\"attributes\":{\"n\":\"5.5\"},\"end\":26107,\"start\":26075},{\"attributes\":{\"n\":\"6\"},\"end\":26917,\"start\":26893},{\"attributes\":{\"n\":\"6.1\"},\"end\":26955,\"start\":26920},{\"attributes\":{\"n\":\"6.2\"},\"end\":27548,\"start\":27534},{\"attributes\":{\"n\":\"6.3\"},\"end\":30048,\"start\":30014},{\"attributes\":{\"n\":\"6.4\"},\"end\":30855,\"start\":30831},{\"attributes\":{\"n\":\"6.5\"},\"end\":32189,\"start\":32172},{\"attributes\":{\"n\":\"7\"},\"end\":33231,\"start\":33209},{\"end\":34042,\"start\":34032},{\"end\":34158,\"start\":34148},{\"end\":34268,\"start\":34259},{\"end\":34976,\"start\":34967},{\"end\":35417,\"start\":35408}]", "table": "[{\"end\":34965,\"start\":34684},{\"end\":35406,\"start\":34978},{\"end\":35703,\"start\":35419}]", "figure_caption": "[{\"end\":34146,\"start\":34044},{\"end\":34257,\"start\":34160},{\"end\":34426,\"start\":34270},{\"end\":34684,\"start\":34429}]", "figure_ref": "[{\"end\":5133,\"start\":5125},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":10573,\"start\":10565},{\"end\":15959,\"start\":15951},{\"attributes\":{\"ref_id\":\"fig_1\"},\"end\":17342,\"start\":17334},{\"end\":17364,\"start\":17356},{\"end\":19930,\"start\":19928},{\"end\":25812,\"start\":25804},{\"end\":27078,\"start\":27070}]", "bib_author_first_name": "[{\"end\":42051,\"start\":42050},{\"end\":42065,\"start\":42060},{\"end\":42085,\"start\":42074},{\"end\":42105,\"start\":42094},{\"end\":42107,\"start\":42106},{\"end\":42403,\"start\":42393},{\"end\":42416,\"start\":42413},{\"end\":42436,\"start\":42430},{\"end\":42454,\"start\":42450},{\"end\":43019,\"start\":43008},{\"end\":43031,\"start\":43027},{\"end\":43661,\"start\":43658},{\"end\":43677,\"start\":43673},{\"end\":43689,\"start\":43684},{\"end\":43697,\"start\":43690},{\"end\":44083,\"start\":44075},{\"end\":44099,\"start\":44093},{\"end\":44110,\"start\":44105},{\"end\":44386,\"start\":44381},{\"end\":44403,\"start\":44395},{\"end\":44417,\"start\":44411},{\"end\":44431,\"start\":44423},{\"end\":45196,\"start\":45193},{\"end\":45213,\"start\":45206},{\"end\":45227,\"start\":45220},{\"end\":45244,\"start\":45243},{\"end\":45260,\"start\":45253},{\"end\":45269,\"start\":45268},{\"end\":45283,\"start\":45278},{\"end\":45285,\"start\":45284},{\"end\":45611,\"start\":45607},{\"end\":45625,\"start\":45621},{\"end\":45636,\"start\":45632},{\"end\":45652,\"start\":45646},{\"end\":45669,\"start\":45662},{\"end\":45684,\"start\":45678},{\"end\":45686,\"start\":45685},{\"end\":45699,\"start\":45692},{\"end\":45701,\"start\":45700},{\"end\":45717,\"start\":45710},{\"end\":45731,\"start\":45727},{\"end\":46063,\"start\":46057},{\"end\":46079,\"start\":46073},{\"end\":46096,\"start\":46087},{\"end\":46109,\"start\":46103},{\"end\":46126,\"start\":46121},{\"end\":46145,\"start\":46134},{\"end\":46650,\"start\":46645},{\"end\":46664,\"start\":46658},{\"end\":46683,\"start\":46676},{\"end\":46943,\"start\":46937},{\"end\":46955,\"start\":46950},{\"end\":46969,\"start\":46963},{\"end\":46985,\"start\":46980},{\"end\":47000,\"start\":46994},{\"end\":47338,\"start\":47332},{\"end\":47351,\"start\":47345},{\"end\":47368,\"start\":47363},{\"end\":47852,\"start\":47851},{\"end\":47854,\"start\":47853},{\"end\":47864,\"start\":47863},{\"end\":47866,\"start\":47865},{\"end\":48102,\"start\":48097},{\"end\":48118,\"start\":48113},{\"end\":48132,\"start\":48126},{\"end\":48145,\"start\":48139},{\"end\":48431,\"start\":48426},{\"end\":48448,\"start\":48439},{\"end\":48464,\"start\":48461},{\"end\":48478,\"start\":48473},{\"end\":48492,\"start\":48487},{\"end\":48509,\"start\":48500},{\"end\":49318,\"start\":49313},{\"end\":49349,\"start\":49342},{\"end\":49365,\"start\":49358},{\"end\":49991,\"start\":49984},{\"end\":50006,\"start\":49997},{\"end\":50020,\"start\":50017},{\"end\":50038,\"start\":50030},{\"end\":50268,\"start\":50261},{\"end\":50284,\"start\":50278},{\"end\":50298,\"start\":50291},{\"end\":50311,\"start\":50306},{\"end\":51096,\"start\":51092},{\"end\":51113,\"start\":51105},{\"end\":51130,\"start\":51122},{\"end\":51147,\"start\":51139},{\"end\":51400,\"start\":51395},{\"end\":51416,\"start\":51409},{\"end\":51430,\"start\":51426},{\"end\":52004,\"start\":51997},{\"end\":52022,\"start\":52015},{\"end\":52052,\"start\":52043},{\"end\":52072,\"start\":52065},{\"end\":52101,\"start\":52095},{\"end\":52773,\"start\":52765},{\"end\":52787,\"start\":52781},{\"end\":52808,\"start\":52799},{\"end\":53104,\"start\":53098},{\"end\":53115,\"start\":53111},{\"end\":53128,\"start\":53120},{\"end\":53142,\"start\":53136},{\"end\":53152,\"start\":53151},{\"end\":53168,\"start\":53162},{\"end\":53189,\"start\":53176},{\"end\":53648,\"start\":53641},{\"end\":53661,\"start\":53653},{\"end\":53674,\"start\":53669}]", "bib_author_last_name": "[{\"end\":42058,\"start\":42052},{\"end\":42072,\"start\":42066},{\"end\":42092,\"start\":42086},{\"end\":42113,\"start\":42108},{\"end\":42122,\"start\":42115},{\"end\":42411,\"start\":42404},{\"end\":42428,\"start\":42417},{\"end\":42448,\"start\":42437},{\"end\":42462,\"start\":42455},{\"end\":43025,\"start\":43020},{\"end\":43039,\"start\":43032},{\"end\":43671,\"start\":43662},{\"end\":43682,\"start\":43678},{\"end\":43705,\"start\":43698},{\"end\":43715,\"start\":43707},{\"end\":44091,\"start\":44084},{\"end\":44103,\"start\":44100},{\"end\":44116,\"start\":44111},{\"end\":44393,\"start\":44387},{\"end\":44409,\"start\":44404},{\"end\":44421,\"start\":44418},{\"end\":44441,\"start\":44432},{\"end\":45204,\"start\":45197},{\"end\":45218,\"start\":45214},{\"end\":45241,\"start\":45228},{\"end\":45251,\"start\":45245},{\"end\":45266,\"start\":45261},{\"end\":45276,\"start\":45270},{\"end\":45453,\"start\":45446},{\"end\":45619,\"start\":45612},{\"end\":45630,\"start\":45626},{\"end\":45644,\"start\":45637},{\"end\":45660,\"start\":45653},{\"end\":45676,\"start\":45670},{\"end\":45690,\"start\":45687},{\"end\":45708,\"start\":45702},{\"end\":45725,\"start\":45718},{\"end\":45743,\"start\":45732},{\"end\":46071,\"start\":46064},{\"end\":46085,\"start\":46080},{\"end\":46101,\"start\":46097},{\"end\":46119,\"start\":46110},{\"end\":46132,\"start\":46127},{\"end\":46148,\"start\":46146},{\"end\":46656,\"start\":46651},{\"end\":46674,\"start\":46665},{\"end\":46688,\"start\":46684},{\"end\":46948,\"start\":46944},{\"end\":46961,\"start\":46956},{\"end\":46978,\"start\":46970},{\"end\":46992,\"start\":46986},{\"end\":47010,\"start\":47001},{\"end\":47343,\"start\":47339},{\"end\":47361,\"start\":47352},{\"end\":47374,\"start\":47369},{\"end\":47861,\"start\":47855},{\"end\":47871,\"start\":47867},{\"end\":48111,\"start\":48103},{\"end\":48124,\"start\":48119},{\"end\":48137,\"start\":48133},{\"end\":48155,\"start\":48146},{\"end\":48437,\"start\":48432},{\"end\":48459,\"start\":48449},{\"end\":48471,\"start\":48465},{\"end\":48485,\"start\":48479},{\"end\":48498,\"start\":48493},{\"end\":48513,\"start\":48510},{\"end\":49340,\"start\":49319},{\"end\":49356,\"start\":49350},{\"end\":49371,\"start\":49366},{\"end\":49379,\"start\":49373},{\"end\":49995,\"start\":49992},{\"end\":50015,\"start\":50007},{\"end\":50028,\"start\":50021},{\"end\":50049,\"start\":50039},{\"end\":50276,\"start\":50269},{\"end\":50289,\"start\":50285},{\"end\":50304,\"start\":50299},{\"end\":50320,\"start\":50312},{\"end\":51103,\"start\":51097},{\"end\":51120,\"start\":51114},{\"end\":51137,\"start\":51131},{\"end\":51154,\"start\":51148},{\"end\":51407,\"start\":51401},{\"end\":51424,\"start\":51417},{\"end\":51440,\"start\":51431},{\"end\":52013,\"start\":52005},{\"end\":52031,\"start\":52023},{\"end\":52041,\"start\":52033},{\"end\":52059,\"start\":52053},{\"end\":52063,\"start\":52061},{\"end\":52093,\"start\":52073},{\"end\":52111,\"start\":52102},{\"end\":52119,\"start\":52113},{\"end\":52779,\"start\":52774},{\"end\":52797,\"start\":52788},{\"end\":52815,\"start\":52809},{\"end\":53109,\"start\":53105},{\"end\":53118,\"start\":53116},{\"end\":53134,\"start\":53129},{\"end\":53149,\"start\":53143},{\"end\":53160,\"start\":53153},{\"end\":53174,\"start\":53169},{\"end\":53203,\"start\":53190},{\"end\":53212,\"start\":53205},{\"end\":53651,\"start\":53649},{\"end\":53667,\"start\":53662},{\"end\":53678,\"start\":53675}]", "bib_entry": "[{\"attributes\":{\"doi\":\"abs/1508.05326\",\"id\":\"b0\",\"matched_paper_id\":14604520},\"end\":42320,\"start\":41984},{\"attributes\":{\"id\":\"b1\",\"matched_paper_id\":54040953},\"end\":42946,\"start\":42322},{\"attributes\":{\"doi\":\"10.18653/v1/P18-1078\",\"id\":\"b2\",\"matched_paper_id\":223637},\"end\":43548,\"start\":42948},{\"attributes\":{\"doi\":\"10.2200/S00509ED1V01Y201305HLT023\",\"id\":\"b3\"},\"end\":43990,\"start\":43550},{\"attributes\":{\"doi\":\"abs/1809.02922\",\"id\":\"b4\",\"matched_paper_id\":52182179},\"end\":44297,\"start\":43992},{\"attributes\":{\"doi\":\"10.18653/v1/n19-1423\",\"id\":\"b5\",\"matched_paper_id\":52967399},\"end\":45189,\"start\":44299},{\"attributes\":{\"id\":\"b6\"},\"end\":45387,\"start\":45191},{\"attributes\":{\"id\":\"b7\",\"matched_paper_id\":207847663},\"end\":45541,\"start\":45389},{\"attributes\":{\"doi\":\"abs/1803.07640\",\"id\":\"b8\"},\"end\":45998,\"start\":45543},{\"attributes\":{\"id\":\"b9\",\"matched_paper_id\":13696741},\"end\":46559,\"start\":46000},{\"attributes\":{\"doi\":\"abs/1910.04601\",\"id\":\"b10\"},\"end\":46870,\"start\":46561},{\"attributes\":{\"id\":\"b11\",\"matched_paper_id\":204915921},\"end\":47259,\"start\":46872},{\"attributes\":{\"id\":\"b12\",\"matched_paper_id\":24462950},\"end\":47790,\"start\":47261},{\"attributes\":{\"id\":\"b13\",\"matched_paper_id\":11077516},\"end\":48006,\"start\":47792},{\"attributes\":{\"doi\":\"10.18653/v1/d18-1260\",\"id\":\"b14\",\"matched_paper_id\":52183757},\"end\":48356,\"start\":48008},{\"attributes\":{\"doi\":\"10.18653/v1/D19-1244\",\"id\":\"b15\",\"matched_paper_id\":202572744},\"end\":49239,\"start\":48358},{\"attributes\":{\"doi\":\"10.18653/v1/p19-1487\",\"id\":\"b16\",\"matched_paper_id\":174803111},\"end\":49926,\"start\":49241},{\"attributes\":{\"id\":\"b17\",\"matched_paper_id\":8535316},\"end\":50198,\"start\":49928},{\"attributes\":{\"doi\":\"10.18653/v1/D19-1340\",\"id\":\"b18\",\"matched_paper_id\":202719284},\"end\":51011,\"start\":50200},{\"attributes\":{\"id\":\"b19\",\"matched_paper_id\":53296520},\"end\":51335,\"start\":51013},{\"attributes\":{\"id\":\"b20\",\"matched_paper_id\":53645946},\"end\":51878,\"start\":51337},{\"attributes\":{\"id\":\"b21\",\"matched_paper_id\":13470418},\"end\":52687,\"start\":51880},{\"attributes\":{\"id\":\"b22\",\"matched_paper_id\":9192723},\"end\":53096,\"start\":52689},{\"attributes\":{\"doi\":\"10.18653/v1/d18-1259\",\"id\":\"b23\"},\"end\":53575,\"start\":53098},{\"attributes\":{\"id\":\"b24\",\"matched_paper_id\":218487030},\"end\":53838,\"start\":53577}]", "bib_title": "[{\"end\":42048,\"start\":41984},{\"end\":42391,\"start\":42322},{\"end\":43006,\"start\":42948},{\"end\":44073,\"start\":43992},{\"end\":44379,\"start\":44299},{\"end\":45444,\"start\":45389},{\"end\":46055,\"start\":46000},{\"end\":46935,\"start\":46872},{\"end\":47330,\"start\":47261},{\"end\":47849,\"start\":47792},{\"end\":48095,\"start\":48008},{\"end\":48424,\"start\":48358},{\"end\":49311,\"start\":49241},{\"end\":49982,\"start\":49928},{\"end\":50259,\"start\":50200},{\"end\":51090,\"start\":51013},{\"end\":51393,\"start\":51337},{\"end\":51995,\"start\":51880},{\"end\":52763,\"start\":52689},{\"end\":53639,\"start\":53577}]", "bib_author": "[{\"end\":42060,\"start\":42050},{\"end\":42074,\"start\":42060},{\"end\":42094,\"start\":42074},{\"end\":42115,\"start\":42094},{\"end\":42124,\"start\":42115},{\"end\":42413,\"start\":42393},{\"end\":42430,\"start\":42413},{\"end\":42450,\"start\":42430},{\"end\":42464,\"start\":42450},{\"end\":43027,\"start\":43008},{\"end\":43041,\"start\":43027},{\"end\":43673,\"start\":43658},{\"end\":43684,\"start\":43673},{\"end\":43707,\"start\":43684},{\"end\":43717,\"start\":43707},{\"end\":44093,\"start\":44075},{\"end\":44105,\"start\":44093},{\"end\":44118,\"start\":44105},{\"end\":44395,\"start\":44381},{\"end\":44411,\"start\":44395},{\"end\":44423,\"start\":44411},{\"end\":44443,\"start\":44423},{\"end\":45206,\"start\":45193},{\"end\":45220,\"start\":45206},{\"end\":45243,\"start\":45220},{\"end\":45253,\"start\":45243},{\"end\":45268,\"start\":45253},{\"end\":45278,\"start\":45268},{\"end\":45288,\"start\":45278},{\"end\":45455,\"start\":45446},{\"end\":45621,\"start\":45607},{\"end\":45632,\"start\":45621},{\"end\":45646,\"start\":45632},{\"end\":45662,\"start\":45646},{\"end\":45678,\"start\":45662},{\"end\":45692,\"start\":45678},{\"end\":45710,\"start\":45692},{\"end\":45727,\"start\":45710},{\"end\":45745,\"start\":45727},{\"end\":46073,\"start\":46057},{\"end\":46087,\"start\":46073},{\"end\":46103,\"start\":46087},{\"end\":46121,\"start\":46103},{\"end\":46134,\"start\":46121},{\"end\":46150,\"start\":46134},{\"end\":46658,\"start\":46645},{\"end\":46676,\"start\":46658},{\"end\":46690,\"start\":46676},{\"end\":46950,\"start\":46937},{\"end\":46963,\"start\":46950},{\"end\":46980,\"start\":46963},{\"end\":46994,\"start\":46980},{\"end\":47012,\"start\":46994},{\"end\":47345,\"start\":47332},{\"end\":47363,\"start\":47345},{\"end\":47376,\"start\":47363},{\"end\":47863,\"start\":47851},{\"end\":47873,\"start\":47863},{\"end\":48113,\"start\":48097},{\"end\":48126,\"start\":48113},{\"end\":48139,\"start\":48126},{\"end\":48157,\"start\":48139},{\"end\":48439,\"start\":48426},{\"end\":48461,\"start\":48439},{\"end\":48473,\"start\":48461},{\"end\":48487,\"start\":48473},{\"end\":48500,\"start\":48487},{\"end\":48515,\"start\":48500},{\"end\":49342,\"start\":49313},{\"end\":49358,\"start\":49342},{\"end\":49373,\"start\":49358},{\"end\":49381,\"start\":49373},{\"end\":49997,\"start\":49984},{\"end\":50017,\"start\":49997},{\"end\":50030,\"start\":50017},{\"end\":50051,\"start\":50030},{\"end\":50278,\"start\":50261},{\"end\":50291,\"start\":50278},{\"end\":50306,\"start\":50291},{\"end\":50322,\"start\":50306},{\"end\":51105,\"start\":51092},{\"end\":51122,\"start\":51105},{\"end\":51139,\"start\":51122},{\"end\":51156,\"start\":51139},{\"end\":51409,\"start\":51395},{\"end\":51426,\"start\":51409},{\"end\":51442,\"start\":51426},{\"end\":52015,\"start\":51997},{\"end\":52033,\"start\":52015},{\"end\":52043,\"start\":52033},{\"end\":52061,\"start\":52043},{\"end\":52065,\"start\":52061},{\"end\":52095,\"start\":52065},{\"end\":52113,\"start\":52095},{\"end\":52121,\"start\":52113},{\"end\":52781,\"start\":52765},{\"end\":52799,\"start\":52781},{\"end\":52817,\"start\":52799},{\"end\":53111,\"start\":53098},{\"end\":53120,\"start\":53111},{\"end\":53136,\"start\":53120},{\"end\":53151,\"start\":53136},{\"end\":53162,\"start\":53151},{\"end\":53176,\"start\":53162},{\"end\":53205,\"start\":53176},{\"end\":53214,\"start\":53205},{\"end\":53653,\"start\":53641},{\"end\":53669,\"start\":53653},{\"end\":53680,\"start\":53669}]", "bib_venue": "[{\"end\":42143,\"start\":42138},{\"end\":42568,\"start\":42464},{\"end\":43158,\"start\":43061},{\"end\":43656,\"start\":43550},{\"end\":44137,\"start\":44132},{\"end\":44621,\"start\":44463},{\"end\":45458,\"start\":45455},{\"end\":45605,\"start\":45543},{\"end\":46231,\"start\":46150},{\"end\":46643,\"start\":46561},{\"end\":47054,\"start\":47012},{\"end\":47462,\"start\":47376},{\"end\":47883,\"start\":47873},{\"end\":48182,\"start\":48177},{\"end\":48710,\"start\":48535},{\"end\":49494,\"start\":49401},{\"end\":50055,\"start\":50051},{\"end\":50517,\"start\":50342},{\"end\":51165,\"start\":51156},{\"end\":51519,\"start\":51442},{\"end\":52188,\"start\":52121},{\"end\":52878,\"start\":52817},{\"end\":53323,\"start\":53250},{\"end\":53699,\"start\":53694},{\"end\":42595,\"start\":42570},{\"end\":43242,\"start\":43160},{\"end\":44766,\"start\":44623},{\"end\":46299,\"start\":46233},{\"end\":47535,\"start\":47464},{\"end\":48872,\"start\":48712},{\"end\":49574,\"start\":49496},{\"end\":50679,\"start\":50519},{\"end\":51583,\"start\":51521},{\"end\":52208,\"start\":52200}]"}}}, "year": 2023, "month": 12, "day": 17}