{"id": 224924968, "updated": "2023-10-06 10:54:30.146", "metadata": {"title": "Supplementary Information for What is needed to deliver carbon-neutral heat using hydrogen and CCS?", "authors": "[{\"first\":\"Nixon\",\"last\":\"Sunny\",\"middle\":[]},{\"first\":\"Niall\",\"last\":\"Dowell\",\"middle\":[\"Mac\"]},{\"first\":\"Nilay\",\"last\":\"Shah\",\"middle\":[]}]", "venue": "Energy & Environmental Science", "journal": "Energy & Environmental Science", "publication_date": {"year": 2020, "month": null, "day": null}, "abstract": "A spatio-temporal systems-based assessment of the conversion of a natural gas-based heating network to H2 is presented in this paper.", "fields_of_study": "[\"Environmental Science\"]", "external_ids": {"arxiv": null, "mag": "3088216153", "acl": null, "pubmed": null, "pubmedcentral": null, "dblp": null, "doi": "10.1039/d0ee02016h"}}, "content": {"source": {"pdf_hash": "b94a3774dc419b0223b1f4331138967062d8d0d1", "pdf_src": "ScienceParsePlus", "pdf_uri": "[\"https://pubs.rsc.org/HJM/content/articlepdf/2020/ee/d0ee02016h?page=search\"]", "oa_url_match": true, "oa_info": {"license": "CCBY", "open_access_url": "https://pubs.rsc.org/en/content/articlepdf/2020/ee/d0ee02016h", "status": "HYBRID"}}, "grobid": {"id": "57ce86996a445d865ec2a276b68a4a66b189690f", "type": "plain-text", "url": "s3://ai2-s2-pdf-extraction-prod/parse-results/s2orc_worker/b94a3774dc419b0223b1f4331138967062d8d0d1.txt", "contents": "\nSupplementary Information for What is needed to deliver carbon-neutral heat using hydrogen and CCS?\n\n\nNixon Sunny \nNiall Mac Dowell \nNilay Shah \n\nCentre for Process Systems Engineering\nImperial College London\nLondon\n\n\nCentre for Environmental Policy\nImperial College London\nLondon\n\n\nDepartment of Chemical Engineering\nImperial College London\nLondon Electronic Supplementary Material (ESI) for Energy & Environmental Science\n\n\nSupplementary Information for What is needed to deliver carbon-neutral heat using hydrogen and CCS?\nSupplementary information\n\n Table 1\n: A complete list of the sets and indices used in the H 2 -CCS infrastructure design model.\n\n\nSets and Indices Description\n\ng, g ∈ G Spatial grid cells/ nodes that are indexed (54) r ∈ R All resources (Natural gas, domestic heat, industrial heat, electricity, biomass, H 2 at 5, 20, 40, 60 and 80 bar, emitted CO 2 , dense-phase CO 2 ) ir ⊆ R Importable resources (Natural gas, electricity, biomass) sr ⊆ R All resources which can be stored as opposed to being emitted (Densephase CO 2 , H 2 at 60 and 80 bar) t, t ∈ T Minor time periods (15) tm, tm ∈ T M Major time periods (7) m ∈ M Performance metrics (CapEx, OpEx) j ∈ J Technologies (SMR with syngas CO 2 capture, SMR with flue gas capture, ATR with CCS, ATR with GHR and CCS, Biomass gasification with CCS, Water electrolysis, smaller scale SMRs and ATRs, domestic and industrial natural gas, H 2 boiler, intraday cavern, interseasonal cavern, injection well, H 2 and CO 2 compressors) pj ⊆ J Process technologies sj ⊆ J Storage technologies (intraday cavern, interseasonal cavern, injection well) d ∈ D Distribution technologies (Pipelines -18, 24, 36 and 48 inches for H 2 , 12 and 26 inches CO 2 pipes for both onshore and offshore transport) od ∈ D Onshore transportation/ distribution technologies dmo ∈ DM O Distribution modes (e.g., flows at specific pressure ranges)\n\n1 Model components 1.1 Nomenclature Tables 1, 2 and 3 summarise the indices, sets, parameters and variables used within this optimisation framework. Units of measurement are omitted here as many of the parameters are block parameters which are created out of many parameters with specific units.\n\n\nEquations\n\nThe equations presented here should be combined with those presented in the paper to produce a complete list, which can be used as a general framework. The import rates are bounded by a maximum import rate placed on importable resources in importable locations as shown in equation (1). This is written as follows:\n\nIM ir,g,t,tm ≤ IM M AX ir,g ∀ ir, g, t, tm\n\nwhere IM M AX ir,g denotes the maximum import rates of an importable resource ir in a grid cell, g. Similarly, the flowrate of a resource is bounded by the capacity of their units as shown in equation (2): dmo Q g,g ,d,dmo,t,tm ≤ N D g,g ,d,tm Q M AX d ∀ g, g , d, t, tm (2) where N D g,g ,d,t is the number of distribution units used to transport a resource from grid cell g to g using distribution technology d at major time period tm, Q M AX d is the maximum flowrate achievable using a single distribution unit for transporting a resource using distribution technology d.  Production rate of a process technology type, pj operating in grid cell, g at minor time, t and major time, tm IM r,g,t,tm Import rate of a resource type, r in grid cell, g at minor time, t and major time, tm Q g,g ,d,dmo,t,tm Flowrate of resource from grid cell, g to g , through distribution mode, dmo in a distribution technology, d at minor time, t and major time, tm ε r,g,t,tm\n\n\nSupplementary information\n\nEmission rate of resource type, r in grid cell, g at minor time, t and major time, tm (Intermediates that aren't stored are emitted.) λ S r,g,sj,t,tm Storage rate of resource type, r using storage technology, sj in grid cell, g at minor time, t and major time, tm λ R r,g,sj,t,tm\n\nRetrieval rate of resource type, r from storage technology, sj in grid cell, g at minor time, t and major time, tm I r,g,sj,t,tm\n\nTotal inventory of a resource type, r using storage technology type, sj in grid cell, g at minor time, t and major time, tm T M m,tm Total contribution to the performance metric type, m in each major time period, tm T AC Total annualised costs of the entire network N P pj,g,tm Number of process units of process technology type, pj existing in grid cell, g at major time period, tm N S r,sj,g,tm Number of storage units of storage technology type, sj used to store resource type, r in grid cell, g at major time period, tm N D g,g ,d,tm\n\nNumber of units of distribution technology type, d operational from grid cell, g to g at major time period, tm N I P pj,g,tm Number of additional process units of process technology type, pj built in grid cell, g at major time period, tm N I S r,sj,g,tm Number of additional storage units of storage technology type, sj used to store resource type, r built in grid cell, g at major time period, tm N I D g,g ,d,tm\n\nNumber of additional units of distribution technology type, d built from grid cell, g to g at major time period, tm α g,tm Binary indicating if the heat demand in a grid cell, g is supplied using H 2 at major time period, tm\n\n\nSupplementary information\n\nFurther constraints are used to ensure that network is not built between a grid cell g to the exact same grid cell in equation (3), where g = g. This in combination with equation (2) ensures that a flow cannot occur between the same grid cells. In addition, equation (4) ensures that at most one pipeline of a particular type is allowed to be built between any two grid cells. Equation (3) and (4) are written as follows:\nN D g,g ,d,tm = 0 ∀ g, d, t, g = g (3) N D g,g ,d,tm ≤ 1 ∀ g, g , tm, d(4)\nEquation (5) imposes constraints on the inventory of a resource as a result of the number of storage units and technologies available as shown below:\n\nI r,g,sj,t,tm ≤ N S r,sj,g,tm N P C sj ∀ r, g, sj, t, tm\n\nI r,g,sj,t,tm = I r,g,sj,t−1,tm + OT t (λ S r,g,sj,t,tm − λ R r,g,sj,t,tm ) ∀ r, g, sj, t, tm\n\nwhere I r,g,sj,t,tm is the inventory of resource r using storage technology sj in grid cell g at minor time period t, and major time period, tm. N S r,sj,g,tm is the number of storage units storing resource r using technology sj in grid cell g at major time tm. OT t is the operating time corresponding to the minor time period, t. It is assumed that the inventory is updated at the end of each time period. The equation is modified for when t reaches the last ordered element of the set T , where the inventory value from within that major time, tm is used to update the initial inventory for the next tm. Equation (7) ensures that the inventory of a resource never exceeds the maximum theoretical capacity of the sites in which it is stored. This equation applies to inventories in all underground locations.\n\nI r,g,sj,t,tm ≤ S M AX sj,g ∀ r, g, sj, t, tm\n\nwhere S M AX sj,g is the maximum storage capacity available via storage technology, sj in grid cell, g. The time-period linking unit balance constraints for storage and distribution units are shown in equations (8) and (9) respectively: N S r,sj,g,tm = N S r,sj,g,tm−1 + N I S r,sj,g,tm ∀ r, sj, g, tm (8)\nN D g,g ,d,tm = N D g,g ,d,tm−1 + N I D g,g ,d,tm ∀ g, g , d, tm(9)\nwhere N I S r,sj,g,tm and N I D g,g ,d,tm are the additional number of storage and distribution units built in major time period tm respectively. Constraints on storage and retrieval rates enforce that you cannot charge into and discharge from the same stores at the same time as shown in equations (10) and (11):\nλ S r,g,sj,t,tm ≤ Γ SM AX r,sj ∀ r, g, sj, t, tm (10) λ R r,g,sj,t,tm ≤ Γ RM AX r,sj ∀ r, g, sj, t, tm(11)\nwhere Γ SM AX r,sj is the maximum injection rate of a resource r into a storage technology sj and Γ RM AX r,sj is the maximum retrieval rate. Additional constraints are enforced to ensure that CO 2 is never retrieved from the storage sites as shown in equation (12) below.\n\n\nSupplementary information\n\nλ R r,g,sj,t,tm = 0 ∀ g, sj, t, tm, r = CO 2 (12)\n\nEquation (13) states that the net stored volume of H 2 in interseasonal caverns over an annual time horizon must equal zero.\n(λ S r,g,sj,t,tm − λ R r,g,sj,t,tm ) OT t = 0 ∀ g, tm, r = H 2 , sj = Interseasonal cavern(13)\nEquation (14) and (15) confines the heating supply in a region to be either natural gas or H 2 through the introduction of the binary variable, α g,tm . They are written as follows:\nP R pj,g,t,tm ≤ α g,tm M ∀ g, t, tm, pj = H 2 boiler (14) P R pj,g,t,tm ≤ (1 − α g,tm )M ∀ g, t, tm, pj = Natural gas boiler (15)\nwhere M is a large positive real number. These two constraints will enable for the evaluation of regions where the usage of a particular resource is optimal in a net-zero environment. Equation (16) ensures that if α g,tm is non-zero, it remains so until the end of the planning horizon. Physically, this means that if a region has adopted H 2 , it will not be using natural gas for heating.\nα g,tm−1 ≤ α g,tm ∀ g, tm(16)\nEquation (17) ensures that both onshore and offshore pipelines are separated out in order to cost them separately along with the compression requirements. It is written as follows:\nN D g,g ,od,tm ≤ ON g K ∀ g, g , od, tm(17)\nwhere K is any positive real number greater than or equal to 1 to constitute an upper limit on the number of pipelines of a given type.\n\n\nDiscretisation of space\n\nGB is discretised into 54 grid cells (polygons achieving 80 km x 80 km resolution on average), g as a compromise between accuracy and computational complexity. The centroids of these cells are subsequently used to compute the euclidean distances between one cell and another for establishing transport links 1 . The cells capture geographical features such as existing natural gas import locations, gas and electricity infrastructure. The total quantity of an entity in a specific cell is determined through aggregation of that entity over the entire cell area. The spatial aggregation and discretisation was performed in an open-source GIS software, QGIS 2.18 2 using specific tools developed for H 2 -CCS data processing by the authors as part of the ERA-NET ACT project \"Elegancy\" 1 . The GIS spatial discretisation in the input data processing tool was achieved using a subset of functions from within the \"Resource Mapping Tool\" by Cooper 3,4 .\n\n\nDiscretisation of time\n\nThis study considers a discrete representation of time where the temporal variations in heating demand across an annual horizon are discretised. The difficulties associated with capturing intra-day and inter-seasonal variations in demand are often described as key challenges in numerical representation of design problems. In addressing this challenge, a mathematical set, t, comprising 15 periods was Supplementary information chosen so that short-term dynamics can be incorporated into the model whilst also considering seasonal variations. The resulting discrete characterisation of aggregate domestic heating demand is illustrated in Fig. 1. The specific procedure employed for formulating the discrete time representation is described in more detail as follows.\n\nk-means clustering was used to identify 3 distinct clusters of points from nation-wide demand data. Following which, the daily variation of demand in time was discretised by minimising the error between the discrete aggregate profile and the actual data using variable length time-steps, except for cluster 2 which contains the peak demand. For cluster 2, the daily demand using the discrete profile was scaled to coincide with the peak daily demand to ensure adequacy in design. This results in an overestimate of the total heating demand on a daily basis as the discrete daily profile used in cluster 2 has a greater area than a curve traced through the actual demand data points on the peak day. Therefore, the total number of representative days in cluster 2 was scaled to ensure that the aggregate heat demand attributable to cluster 2 using discrete days is equivalent to the aggregate total of the demand data. Fig. 1 highlights the temporal demand variations over a time frame of 330 days as opposed to 365 days due to the shrinkage of representative days during scaling in cluster 2.\n\nThe effect of this choice on model outputs is discussed in Supplementary information section 3.1. Two mathematical sets are used for the representation of time, with the first (tm) used for the purposes of defining investment decisions and the second, t used to distinguish the operational decision space.\n\n\nInput summary\n\n• Spatio-temporal demand/ availability of all resources in the system.\n\n• Locations of existing production, transportation and storage infrastructure.\n\n• Techno-economic parameters and performance metrics characterising technologies -CapEx, OpEx, efficiency, capacity, ramp rates, etc.\n\n\nOutput summary\n\n• Location, type, capacities of production, distribution and storage technologies.\n\n\nSupplementary information\n\n• Production, consumption, import, flow, storage and retrieval rates of all resources in the system in all regions.\n\n• Regional transition pathway from natural gas infrastructure to H 2 at varying levels of decarbonisation.\n\n\nModelling assumptions\n\n• Low pressure distribution pipelines are assumed to be available. The costs of pressure reduction stations are assumed to be negligible compared to the network components.\n\n• Temperature variations in heating demands are not considered. Domestic and industrial boiler efficiencies were assumed to be 94% and 90% respectively for both natural gas and H 2 5 .\n\n• Both domestic and industrial appliance conversion costs are not explicitly accounted for in the network design. The authors assume that natural gas and H 2 -based appliances are comparable in both performance and total costs.\n\n• A carbon-neutral electricity grid by 2050 is assumed as per legislation in addition to 1.5 % release in methane supply chain, amounting to 8.7 gCO 2 /MJ HHV of imported gas 6 .\n\n\nMethodological innovations\n\nIn this section, a hierarchical modelling approach, specifically constructed for the assessment of model accuracy in the representation of time, is highlighted. Additionally, a multistage mathematical optimisation approach, developed for studying the transitions from existing infrastructure, is described as an alternative to multi-period model formulations.\n\n\nHierarchical analysis: Time\n\nThe formulation of discrete time periods could constitute a significant source of inaccuracy in the model results. A coarse representation of time is used initially as a compromise to improve computational performance. The effect of such compromises on the accuracy of model outputs is evaluated using a two-stage analytical approach to determine whether the infrastructure is appropriately sized to supply the required time-varying demands. Stage 1 of this formulation identifies the optimal mix of technologies and infrastructure required to achieve the least cost design for a target reduction in emissions, using a collection of 15 time periods. Stage 2 initially assigns the integer variables (i.e., quantity of a specific production, transportation and storage technology installed in a given location) with the respective outputs obtained from stage 1. Upon which, the temporal resolution of the operational time is improved by representing the same data using a greater number of discrete time periods. The subsequent problem is re-optimised to determine whether the resulting network has been over/under-sized. If the model instance from stage 2 is proven to be infeasible, then the network has been under-sized and thus, incapable of meeting the heating demands. In this case, ancillary investments are required to support the additional capacity requirements. The amount of additional investment required is defined via the relaxation of the initial assignments, and further incorporation of integer outputs as the lower bound for the realisation of the investment variables in the subsequent optimisation.\n\nThe modelling workflow is graphically depicted in Fig. 2. The inequality constraint in stage 2 reduces the size of the feasible set of solutions, enabling the model instance to be solved at a higher temporal resolution. Consequently, an optimal solution achieved via this method will clearly detail the additional infrastructure requirements to ensure technical feasibility and operability. When stage 2 presents a feasible solution, it is possible to identify the extent to which the infrastructure is over-sized. It is worth noting that this modelling approach can be applied sequentially, in an iterative manner with Supplementary information Figure 2: A schematic of the workflow used for evaluating the effect of temporal uncertainties where y and x denote the set of investment and operational decision variables respectively. The numerical subscript refers to the realisation of these variables within the corresponding stage and the asterix is used to denote the optimal values for the decision variables.\n\nincreasingly higher temporal resolutions to eventually reflect that of the original data set. The main disadvantage associated with this approach is that solution optimality is only guaranteed at the highest level of the hierarchy (i.e., stage 1) and improved representations of time result in solutions which depart from mathematically guaranteed optimum to those that are practicable in design. The authors note great value in the development of mathematical frameworks and techniques that are capable of optimising the trade-offs between high spatial and temporal resolutions in planning problems.\n\n\nTransition pathway\n\nA multi-stage optimisation model variant was developed to study the transition pathway from natural gas infrastructure to H 2 . Typically, multi-period model formulations are used for these purposes but the presence of large groupings of integer decisions in multi-vector design problems could present severe computational limitations for problems described over a long-term planning horizon. Instead, it is possible to use snapshot model formulations (i.e., single investment time horizon) to define a phased deployment pathway in instances where the inherent model components are not susceptible to significant change in the long-term. There is inherent uncertainty in the assumption of prices for resources such as natural gas, electricity and biomass over time. However, these elements are not forecasted and exogenously imposed onto the model based on authors' assumptions. The resulting model formulation used in this paper utilises a snapshot solution with an iterative component which defines the deployment rate of technologies as a function of the target reduction in CO 2 emissions intensity. These model outputs are subsequently matched with a time horizon through the satisfaction of CO 2 emissions intensities at respective time points. In the pathway analysis, stage 1 of the formulation is identical to that in 2.1. Subsequently, the emissions intensity constraint is updated. Upon which, the model is re-optimised using the initial solution from stage 1 as the upper bound for the design variables, y in the next stage. This significantly reduces the solution space and limits the technological options to only those present in stage 1. This specific solution procedure is depicted in Fig. 3.\n\nb denotes a set of binary decisions which determine whether a region is supplied with natural gas or H 2 . In particular, b is indexed via the set of spatial cells, g and b = 1 indicates that a region is converted to H 2 , whereas b = 0 implies the continued usage of natural gas. The key factor influencing Supplementary information Figure 3: A schematic overview of the workflow in defining spatially resolved outputs at 5 year time intervals through a snapshot model solution and subsequent processing as opposed to using a computationally expensive multi-period formulation.\n\nthe resolution of the transition pathway in this model instance is the cardinality of the set, tm. In particular, the analyses presented in this paper assume 7 discrete intervals of uniform size with the resulting set spanning across a 35 year time horizon. Hence, a uniform interval length of 5 years is assumed per element of tm. Thus, under the assumption that tm = {1, 2, .., 7}, the solution procedure shown graphically in Fig. 3 terminates when tm = T end = 7. The key benefit of this modelling approach lies in the possibility for obtaining deployment pathways over shorter time intervals than what is typically achievable in similar multi-period planning models. The availability of finely resolved model outputs are invaluable for the contrivement of long-term infrastructural plans.\n\n\nStatistical analysis\n\nKey statistical parameters are computed to distinguish the importance of input parameters whilst ensuring reliable results. They are comprised of the pearson correlation coefficient (r), adjusted coefficient of determination (R 2 ), standardised regression coefficient (β), Variance Inflation Factor (V IF ) and the F-ratio. The r value denotes the strength of the linear correlation between model inputs, Z i and outputs, Y where Z is the vector of randomly generated input values for uncertain parameter i and Y is the vector of model outputs. The F-ratio is the ratio of the variance explained by the regression model relative to its unexplained residuals. This parameter is compared with the F-statistic to understand whether the addition of another input in the regression model results in statistically significant improvements in its predictive ability. Equations forR 2 , β and the VIF are defined as:\nR 2 = 1 − (1 − R 2 ) n − 1 n − p − 1(1)β i = RC i σ z,i σ y ∀ i(2)\nSupplementary information\nV IF i = 1 1 − R 2 i ∀ i (3)\nwhere R 2 is the coefficient of determination, n is the sample size, p is the number of predictive inputs, RC i is the regression/ partial coefficient for uncertain parameter i in the regression model, σ z,i and σ y represent the standard deviations for Z i and Y.R 2 adjusts R 2 based on the number of independent variables and the sample size. The β i coefficient describes the proportionate impacts of one standard deviation of change in the uncertain input parameter i on the standardised model output. Therefore, β i values can be directly compared and allows for the relative importance of the inputs to be deduced from the regression model. Finally, the V IF i measures multicollinearity between uncertain model input parameters. A low degree of multicollinearity is observable at lower V IF i values, whereby the resulting variance can be attributed to independent input parameters as opposed to a collection of inputs to improve accuracy of estimation. A stepwise estimation procedure based on Hair et al. 7 is used to build the regression model.\n\n\nSupplementary results\n\n\nRepresentation of time\n\nThe T AC was computed via independent optimisations of the model at pre-defined intervals of 5% reduction in CO 2 emissions intensity. The resulting solutions were studied to determine whether the designs suffice or require additional investments using the two-stage hierarchical modelling approach. The discernible differences in total costs between stages 1 and 2 are plotted in Fig. 4. The difference in T AC between 15 and 60 time periods is expressed through the definition of a new variable T AC dif f as follows:\nT AC dif f = (T AC 60 − T AC 15 )/T AC 15(1)\nwhere T AC 15 and T AC 60 refer to the total annualised costs of heat supply using the model formulation with 15 and 60 time periods respectively. Fig. 4 demonstrates that T AC dif f equates to zero only at the origin where the T AC 60 and T AC 15 are necessarily indistinguishable. Natural gas is continually Figure 4: A scatterplot of the differences in TAC between 60 and 15 time periods expressed as a percentage plotted against maximum achievable CO 2 removal through independent cost-optimal designs.\n\nsupplied without any additional infrastructural investments when there is no effective CO 2 emissions reduction constraint. Thus, total costs of heat supply remain identical in both stages irrespective of the temporal resolution. A point to emphasise is the prominence of the data in the positive real space indicating that using a set of 15 time periods results in an underestimate of the required investments in this instance. Thus, the initial representation of time results in solutions that are infeasible in practice.\n\n\nSupplementary information\n\nThe largest error in T AC across all optimisations was within 3% of the optimum solution, occuring at the highest CO 2 removal targets. Although the network has been undersized in all instances, minimal capacity additions are required for ensuring operability of design. Thus, the representation of operational time was deemed appropriate for this design problem.\n\n\nPeak day operating mix for H 2 production\n\nFig. 5 displays the operating capacity during peak supply in the absence of H 2 storage. ATRs, SMRs and BG with CCS are operational throughout the course of the day with elevated production rates at times of peak demand. In contrast, WE units are only operational for the satisfaction of peak demand due to their higher OpEx requirements. There is little commercial experience and academic literature surrounding the flexible operation of SMRs, in part due to its limited use in applications with temporal demand variability. Thus, operational flexibility criteria must be developed as part of future research. At present, large scale deployment of the WE process should be recommended for applications with significant temporal variabilities in the absence of sufficient H 2 storage. The resulting power requirements for WE might necessitate capacity expansions within the electricity transmission grid especially when peak demands for the given application and power use coincide, amplifying the magnitude of associated investments. Figure 5: Operating mix during the peak day in the absence of H 2 storage. The importance of the WE process for supplying peak demands is shown here. Figure 6: Scatterplots to investigate the correlative behaviour between resource prices, cavern costs and the total annualised cost, T AC using 10,000 samples. Gas price appears to have the strongest correlation with T AC whereas the electricity price shows the weakest, if any. Both biomass price and cavern cost seems to have a strong influence on T AC.\n\n\nStatistical analysis of the regression models\n\n\nSupplementary information\n\n4 scatterplots were generated using randomly generated samples for each input parameter and its corresponding output as depicted in Fig. 6. The quadrants were generated using the mean for the input and output T AC. Observations from the scatterplots highlight a stronger correlation between gas price and T AC in comparison to other resources. In contrast, the electricity price seems to have little effect on the T AC as illustrated by an approximately equal occupancy of data points within each quadrant. From the figure, it is not entirely clear whether the T AC is more sensitive to variations in biomass price or cavern cost.\n\nMulticollinearity between uncertain input parameters was analysed using the V IF i where i is an element from the set, {gas price, biomass price, electricity price, cavern cost}. All VIF values were determined to be close to unity within 3 decimal places, implying a lack of correlation amongst the input parameters. However, there may be underlying correlative effects describing the electricity price as a function of the gas price rather than as a uniform distribution across the uncertainty space. Therefore, dependencies between these inputs could potentially distort its impact on T AC. Nevertheless, regression coefficients and goodness-of-fit statistics are combined to determine the overall contribution from potentially correlated inputs as shown in Table 4. Within the table, model A includes gas price, biomass price and cavern costs as the explanatory variables whereas model B includes electricity price in addition to the aforementioned variables. Therefore model A contains three degrees of freedom (D.O.F) and model B contains four. The differences betweenR 2 and the F-ratio must be noted when comparing models, A and B. In particular, the F-ratio decreases upon the inclusion of electricity price as a regression variable whilst displaying a negligible increase in theR 2 value by 0.003. Thus, model B was rejected, and model A was confirmed as the most appropriate representation for a multivariate regression model. The t-statistic was used to ascribe a confidence interval to the regression coefficients in order to confirm that the estimated regression coefficients are statistically significant. The t-statistic is evaluated using the estimated regression coefficient and the standard error of estimation. Across all β coefficients, the maximum error is within ±0.6% of the standardised value which leads to the conclusion that all of the estimated coefficients are statistically significant since the confidence intervals do not overlap with zero.\n\n\nImpact of grid CO 2 intensities\n\nThe impact of electricity and natural gas grid CO 2 intensities on total costs and energy consumption was evaluated. Complex system wide trade-offs arise from the presence of upstream supply chain emissions. The extent of their influence on total energy requirement and T AC for complete decarbonisation of the heating supply is illustrated via Fig. 7.\n\nThe percentage increases in total energy consumption were computed as a function of grid CO 2 intensities, measured relative to the energy requirements that arise from a carbon neutral electricity and natural gas grid. The figure affirms the relative importance of reducing upstream methane supply chain emissions. Note that the CO 2 footprint of the natural gas grid has a greater influence on the total energy consumption than that of the electricity grid. At higher CO 2 intensities, the requirement for negative emissions should increase. Thus, resulting in a greater deployment of BG with CCS, which increases the overall energy consumption due to its lower overall energy efficiency. This leads to the expectation of higher increase in energy requirements than that observed at higher CO 2 intensities. This peculiarity arises from the fact that BG with CCS is deployed to its optimal extent at net zero emissions targets. It appears economically optimal to combine BG with CCS for H 2 supply in certain regions whilst continuing the supply of natural gas in other regions. A direct implication of this observation is that a greater deployment of H 2 is necessitated by higher grid CO 2 intensities, thereby eventually converting all of the natural gas supply to H 2 .\n\nSimilarly, the effect of grid CO 2 intensities on the total costs for decarbonisation is also illustrated in Fig. 7. The resulting surface illustrates the potential for the T AC to increase by over 15%, displaying a stronger correlation with increasing CO 2 intensities. The extent of this variability provides a clear incentive for reducing the upstream methane supply chain emissions. This is a crucial point to consolidate as few studies have extensively focused on the reduction of emissions from gas grids in comparison to the electricity grid. There is little interdependence between the electricity grid and the H 2 supply system in the absence of significant WE deployment. Naturally, the relative importance of the decarbonisation of the electricity sector is magnified when the WE process amasses a greater share of the production mix.\n\n\nImpact of biomass availability and CO 2 intensity\n\nThe impact of biomass availability and CO 2 intensity on optimal value chain design must be understood. Note the distinction between biomass supply CO 2 intensity and the embodied emissions that are released during the gasification and conversion of the feedstock. The former explicitly refers to the direct and indirect greenhouse gas emissions across the biomass supply chain with its origins from sourcing and transportation before use. Fig. 8 illustrates the effect of biomass availability and its Figure 8: An illustration of the percentage increase in total annualised system costs compared to the minimum cost requirements at a supply CO 2 intensity of 0 g/kWh with varying potential availability of indigenous biomass.\n\nsupply chain intensity on T AC for decarbonisation of the heating supply. As expected, the T AC of decarbonisation is highly influenced by both the CO 2 footprint of the biomass supply chain and the total availability of biomass. In particular, significant economic penalties are associated with a constrained supply of biomass. At least 150 TWh of biomass is required for a complete decarbonisation of the GB H 2 supply network at least cost. In addition, the sustainable sourcing of biomass is of paramount importance for the reduction of T AC, as evidenced by a cost increase as high as 30% as shown. These findings have major implications on the extent of mobilisation of land for the sourcing of biomass and its transportation means, which must be considered in the long-term planning of H 2 infrastructure.\n\nFigure 1 :\n1Discrete representation of the domestic heating demand over the annual time horizon. The month of June is equated to the starting timeframe of the optimisation. Three distinct clusters of days are presented; clusters 1, 2 and 3 contain 160, 45 and 125 days respectively.\n\nFigure 7 :\n7An illustration of the percentage increases in primary energy consumption and T AC compared to the requirements at grid CO 2 intensities of 0 g/kWh.\n\nTable 2 :\n2A complete list of the parameters used in the H 2 -CCS infrastructure design model. Maximum flowrate of a resource through a single unit of distribution technology type, d IM M AX ir,gMaximum import rate of an importable resource, ir in a grid, g β r,dmo,d Conversion coefficient of a resource, r in a distribution technology, d through a distribution mode, dmo U E r Upstream emissions pertaining to a unit of the resource, r µ pj,r Production/ consumption rate coefficients for resource, r using a process technology type, pj τ j,g,m Coefficients related to the effects of an investment in a technology type, j in grid cell, g on the performance metric type, m N C d,mCoefficients related to the effects of installation of a network using a distribution technology type, d on the performance metric type, m (e.g., CAPEX for construction of a H 2 pipeline) P C pj,m Coefficients related to the effects of the processing of resources using a process technology type, pj on the performance metric type, m QC d,mCoefficients related to the effects of the flow of a resource using distribution technology type, d on performance metric type, m IM C ir,mMaximum storage capacity of a storage technology, sj in grid cell, g Γ SM AX sr,sj Maximum injection rate of a storable resource type, sr into a storage technology type, sj Γ RM AX sr,sj Maximum retrieval rate of a storable resource type, sr from a storage technology type, sj OW m,tmOverall objective weighting factor corresponding to performance metric type, m in major time period, tmParameter \nDescription \n\nCI \nCarbon intensity of the heat supply \nDEM T OT \nTotal annual heating demand \nCRF j \nCaptial recovery factor for the different technologies \nON g \nBinary parameter to indicate if a grid, g is onshore/ offshore \nIN IT j,g \nInitial capacity of technology, j in grid cell, g at the start of the planning \nhorizon \nD r,g,t,tm \nDemand for resource, r in grid cell, g at minor time, t and at major time, \ntm \nN P C j \nNameplate capacity for technology type, j (e.g., unit capacity of the tech-\nnologies) \nν g,g \nDistance between grid cells, g and g , where g = g \nOT t \nOperational time corresponding to each time period, t \nQ M AX \n\nd \n\n\n\nTable 3 :\n3A complete list of the variables used in the H 2 -CCS infrastructure design model.Variable \nDescription \n\nP pj,g,t,tm \n\n\nTable 4 :\n4Standardised regression coefficients and statistical analysis for multivariate regression models to scrutinise the inclusion of electricity price as an explanatory variable.Model A \nModel B \nD.O.F \n3 \n4 \nR 2 \n0.984 \n0.987 \nF-Ratio \n2.00×10 5 \n1.85×10 5 \nβ gas price \n0.709 \n0.708 \nβ biomass price \n0.513 \n0.514 \nβ cavern cost \n0.465 \n0.464 \nβ electricity price \n-\n0.055 \n\n\nhttps://www.sintef.no/elegancy\n\n. O Akgul, A Zamboni, F Bezzo, N Shah, L G Papageorgiou, Ind. Eng. Chem. Res. 50O. Akgul, A. Zamboni, F. Bezzo, N. Shah and L. G. Papageorgiou, Ind. Eng. Chem. Res, 2011, 50, 4927-4938.\n\nQgis Qgis, The Leading Open Source Desktop GIS. QGIS, QGIS -The Leading Open Source Desktop GIS, 2017, https://www.qgis.org/en/site/ about/index.html.\n\nGitHub -nathanialcooper/Resource-Mapping-Tool. Nathanial Cooper, Nathanial Cooper, GitHub -nathanialcooper/Resource-Mapping-Tool, 2018, https://github. com/nathanialcooper/Resource-Mapping-Tool.\n\n. N Cooper, A Panteli, N Shah, Applied Energy. 113526N. Cooper, A. Panteli and N. Shah, Applied Energy, 2019, 253, 113526.\n\n. M Chaudry, M Abeysekera, S H R Hosseini, N Jenkins, J Wu, Energy Policy. 87M. Chaudry, M. Abeysekera, S. H. R. Hosseini, N. Jenkins and J. Wu, Energy Policy, 2015, 87, 623-640.\n\nP Balcombe, K Anderson, J Speirs, N Brandon, A Hawkes, Sustainable Gas Institute. P. Balcombe, K. Anderson, J. Speirs, N. Brandon and A. Hawkes, Sustainable Gas Institute, 2015.\n", "annotations": {"author": "[{\"end\":115,\"start\":103},{\"end\":133,\"start\":116},{\"end\":145,\"start\":134},{\"end\":217,\"start\":146},{\"end\":282,\"start\":218},{\"end\":426,\"start\":283}]", "publisher": null, "author_last_name": "[{\"end\":114,\"start\":109},{\"end\":132,\"start\":126},{\"end\":144,\"start\":140}]", "author_first_name": "[{\"end\":108,\"start\":103},{\"end\":121,\"start\":116},{\"end\":125,\"start\":122},{\"end\":139,\"start\":134}]", "author_affiliation": "[{\"end\":216,\"start\":147},{\"end\":281,\"start\":219},{\"end\":425,\"start\":284}]", "title": "[{\"end\":100,\"start\":1},{\"end\":526,\"start\":427}]", "venue": null, "abstract": null, "bib_ref": "[{\"attributes\":{\"ref_id\":\"b0\"},\"end\":2489,\"start\":2486},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":2768,\"start\":2765},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":2838,\"start\":2835},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":5354,\"start\":5351},{\"attributes\":{\"ref_id\":\"b3\"},\"end\":5442,\"start\":5439},{\"attributes\":{\"ref_id\":\"b3\"},\"end\":5569,\"start\":5566}]", "figure": "[{\"attributes\":{\"id\":\"fig_0\"},\"end\":33486,\"start\":33203},{\"attributes\":{\"id\":\"fig_1\"},\"end\":33648,\"start\":33487},{\"attributes\":{\"id\":\"tab_0\",\"type\":\"table\"},\"end\":35856,\"start\":33649},{\"attributes\":{\"id\":\"tab_1\",\"type\":\"table\"},\"end\":35988,\"start\":35857},{\"attributes\":{\"id\":\"tab_2\",\"type\":\"table\"},\"end\":36373,\"start\":35989}]", "paragraph": "[{\"end\":654,\"start\":563},{\"end\":1893,\"start\":687},{\"end\":2190,\"start\":1895},{\"end\":2518,\"start\":2204},{\"end\":2562,\"start\":2520},{\"end\":3523,\"start\":2564},{\"end\":3832,\"start\":3553},{\"end\":3962,\"start\":3834},{\"end\":4501,\"start\":3964},{\"end\":4916,\"start\":4503},{\"end\":5142,\"start\":4918},{\"end\":5593,\"start\":5172},{\"end\":5818,\"start\":5669},{\"end\":5876,\"start\":5820},{\"end\":5971,\"start\":5878},{\"end\":6783,\"start\":5973},{\"end\":6830,\"start\":6785},{\"end\":7137,\"start\":6832},{\"end\":7519,\"start\":7206},{\"end\":7899,\"start\":7627},{\"end\":7978,\"start\":7929},{\"end\":8104,\"start\":7980},{\"end\":8381,\"start\":8200},{\"end\":8902,\"start\":8512},{\"end\":9113,\"start\":8933},{\"end\":9293,\"start\":9158},{\"end\":10270,\"start\":9321},{\"end\":11064,\"start\":10297},{\"end\":12158,\"start\":11066},{\"end\":12465,\"start\":12160},{\"end\":12553,\"start\":12483},{\"end\":12633,\"start\":12555},{\"end\":12768,\"start\":12635},{\"end\":12869,\"start\":12787},{\"end\":13014,\"start\":12899},{\"end\":13122,\"start\":13016},{\"end\":13320,\"start\":13148},{\"end\":13506,\"start\":13322},{\"end\":13735,\"start\":13508},{\"end\":13915,\"start\":13737},{\"end\":14305,\"start\":13946},{\"end\":15954,\"start\":14337},{\"end\":16969,\"start\":15956},{\"end\":17571,\"start\":16971},{\"end\":19303,\"start\":17594},{\"end\":19883,\"start\":19305},{\"end\":20677,\"start\":19885},{\"end\":21611,\"start\":20702},{\"end\":21704,\"start\":21679},{\"end\":22789,\"start\":21734},{\"end\":23359,\"start\":22840},{\"end\":23911,\"start\":23405},{\"end\":24436,\"start\":23913},{\"end\":24829,\"start\":24466},{\"end\":26415,\"start\":24875},{\"end\":27123,\"start\":26493},{\"end\":29097,\"start\":27125},{\"end\":29485,\"start\":29133},{\"end\":30761,\"start\":29487},{\"end\":31608,\"start\":30763},{\"end\":32388,\"start\":31662},{\"end\":33202,\"start\":32390}]", "formula": "[{\"attributes\":{\"id\":\"formula_1\"},\"end\":5668,\"start\":5594},{\"attributes\":{\"id\":\"formula_5\"},\"end\":7205,\"start\":7138},{\"attributes\":{\"id\":\"formula_6\"},\"end\":7626,\"start\":7520},{\"attributes\":{\"id\":\"formula_7\"},\"end\":8199,\"start\":8105},{\"attributes\":{\"id\":\"formula_8\"},\"end\":8511,\"start\":8382},{\"attributes\":{\"id\":\"formula_9\"},\"end\":8932,\"start\":8903},{\"attributes\":{\"id\":\"formula_10\"},\"end\":9157,\"start\":9114},{\"attributes\":{\"id\":\"formula_11\"},\"end\":21651,\"start\":21612},{\"attributes\":{\"id\":\"formula_12\"},\"end\":21678,\"start\":21651},{\"attributes\":{\"id\":\"formula_13\"},\"end\":21733,\"start\":21705},{\"attributes\":{\"id\":\"formula_14\"},\"end\":23404,\"start\":23360}]", "table_ref": "[{\"end\":562,\"start\":555},{\"attributes\":{\"ref_id\":\"tab_0\"},\"end\":1948,\"start\":1931},{\"attributes\":{\"ref_id\":\"tab_2\"},\"end\":27892,\"start\":27885}]", "section_header": "[{\"end\":685,\"start\":657},{\"attributes\":{\"n\":\"1.2\"},\"end\":2202,\"start\":2193},{\"end\":3551,\"start\":3526},{\"end\":5170,\"start\":5145},{\"end\":7927,\"start\":7902},{\"attributes\":{\"n\":\"1.3\"},\"end\":9319,\"start\":9296},{\"attributes\":{\"n\":\"1.4\"},\"end\":10295,\"start\":10273},{\"attributes\":{\"n\":\"1.5\"},\"end\":12481,\"start\":12468},{\"attributes\":{\"n\":\"1.6\"},\"end\":12785,\"start\":12771},{\"end\":12897,\"start\":12872},{\"attributes\":{\"n\":\"1.7\"},\"end\":13146,\"start\":13125},{\"attributes\":{\"n\":\"2\"},\"end\":13944,\"start\":13918},{\"attributes\":{\"n\":\"2.1\"},\"end\":14335,\"start\":14308},{\"attributes\":{\"n\":\"2.2\"},\"end\":17592,\"start\":17574},{\"attributes\":{\"n\":\"2.3\"},\"end\":20700,\"start\":20680},{\"attributes\":{\"n\":\"3\"},\"end\":22813,\"start\":22792},{\"attributes\":{\"n\":\"3.1\"},\"end\":22838,\"start\":22816},{\"end\":24464,\"start\":24439},{\"attributes\":{\"n\":\"3.2\"},\"end\":24873,\"start\":24832},{\"attributes\":{\"n\":\"3.3\"},\"end\":26463,\"start\":26418},{\"end\":26491,\"start\":26466},{\"attributes\":{\"n\":\"3.4\"},\"end\":29131,\"start\":29100},{\"attributes\":{\"n\":\"3.5\"},\"end\":31660,\"start\":31611},{\"end\":33214,\"start\":33204},{\"end\":33498,\"start\":33488},{\"end\":33659,\"start\":33650},{\"end\":35867,\"start\":35858},{\"end\":35999,\"start\":35990}]", "table": "[{\"end\":35856,\"start\":35197},{\"end\":35988,\"start\":35951},{\"end\":36373,\"start\":36174}]", "figure_caption": "[{\"end\":33486,\"start\":33216},{\"end\":33648,\"start\":33500},{\"end\":35197,\"start\":33661},{\"end\":35951,\"start\":35869},{\"end\":36174,\"start\":36001}]", "figure_ref": "[{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":10942,\"start\":10936},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":11990,\"start\":11984},{\"end\":16012,\"start\":16006},{\"end\":16610,\"start\":16602},{\"end\":19302,\"start\":19296},{\"end\":19647,\"start\":19639},{\"end\":20319,\"start\":20313},{\"end\":23227,\"start\":23221},{\"end\":23558,\"start\":23552},{\"end\":23723,\"start\":23715},{\"end\":25918,\"start\":25910},{\"end\":26068,\"start\":26060},{\"end\":26631,\"start\":26625},{\"attributes\":{\"ref_id\":\"fig_1\"},\"end\":29484,\"start\":29478},{\"attributes\":{\"ref_id\":\"fig_1\"},\"end\":30878,\"start\":30872},{\"end\":32108,\"start\":32102},{\"end\":32172,\"start\":32164}]", "bib_author_first_name": "[{\"end\":36409,\"start\":36408},{\"end\":36418,\"start\":36417},{\"end\":36429,\"start\":36428},{\"end\":36438,\"start\":36437},{\"end\":36446,\"start\":36445},{\"end\":36448,\"start\":36447},{\"end\":36597,\"start\":36593},{\"end\":36801,\"start\":36792},{\"end\":36944,\"start\":36943},{\"end\":36954,\"start\":36953},{\"end\":36965,\"start\":36964},{\"end\":37068,\"start\":37067},{\"end\":37079,\"start\":37078},{\"end\":37093,\"start\":37092},{\"end\":37097,\"start\":37094},{\"end\":37109,\"start\":37108},{\"end\":37120,\"start\":37119},{\"end\":37246,\"start\":37245},{\"end\":37258,\"start\":37257},{\"end\":37270,\"start\":37269},{\"end\":37280,\"start\":37279},{\"end\":37291,\"start\":37290}]", "bib_author_last_name": "[{\"end\":36415,\"start\":36410},{\"end\":36426,\"start\":36419},{\"end\":36435,\"start\":36430},{\"end\":36443,\"start\":36439},{\"end\":36461,\"start\":36449},{\"end\":36602,\"start\":36598},{\"end\":36808,\"start\":36802},{\"end\":36951,\"start\":36945},{\"end\":36962,\"start\":36955},{\"end\":36970,\"start\":36966},{\"end\":37076,\"start\":37069},{\"end\":37090,\"start\":37080},{\"end\":37106,\"start\":37098},{\"end\":37117,\"start\":37110},{\"end\":37123,\"start\":37121},{\"end\":37255,\"start\":37247},{\"end\":37267,\"start\":37259},{\"end\":37277,\"start\":37271},{\"end\":37288,\"start\":37281},{\"end\":37298,\"start\":37292}]", "bib_entry": "[{\"attributes\":{\"id\":\"b0\"},\"end\":36591,\"start\":36406},{\"attributes\":{\"id\":\"b1\"},\"end\":36743,\"start\":36593},{\"attributes\":{\"id\":\"b2\"},\"end\":36939,\"start\":36745},{\"attributes\":{\"id\":\"b3\"},\"end\":37063,\"start\":36941},{\"attributes\":{\"id\":\"b4\"},\"end\":37243,\"start\":37065},{\"attributes\":{\"id\":\"b5\"},\"end\":37422,\"start\":37245}]", "bib_title": null, "bib_author": "[{\"end\":36417,\"start\":36408},{\"end\":36428,\"start\":36417},{\"end\":36437,\"start\":36428},{\"end\":36445,\"start\":36437},{\"end\":36463,\"start\":36445},{\"end\":36604,\"start\":36593},{\"end\":36810,\"start\":36792},{\"end\":36953,\"start\":36943},{\"end\":36964,\"start\":36953},{\"end\":36972,\"start\":36964},{\"end\":37078,\"start\":37067},{\"end\":37092,\"start\":37078},{\"end\":37108,\"start\":37092},{\"end\":37119,\"start\":37108},{\"end\":37125,\"start\":37119},{\"end\":37257,\"start\":37245},{\"end\":37269,\"start\":37257},{\"end\":37279,\"start\":37269},{\"end\":37290,\"start\":37279},{\"end\":37300,\"start\":37290}]", "bib_venue": "[{\"end\":36482,\"start\":36463},{\"end\":36639,\"start\":36604},{\"end\":36790,\"start\":36745},{\"end\":36986,\"start\":36972},{\"end\":37138,\"start\":37125},{\"end\":37325,\"start\":37300}]"}}}, "year": 2023, "month": 12, "day": 17}