{"id": 226254657, "updated": "2023-10-06 09:01:28.989", "metadata": {"title": "Extremal Effective Field Theories", "authors": "[{\"first\":\"Simon\",\"last\":\"Caron-Huot\",\"middle\":[]},{\"first\":\"Vincent\",\"last\":\"Duong\",\"middle\":[\"Van\"]}]", "venue": null, "journal": "Journal of High Energy Physics", "publication_date": {"year": 2021, "month": null, "day": null}, "abstract": "Effective field theories (EFT) parameterize the long-distance effects of short-distance dynamics whose details may or may not be known. It is known that EFT coefficients must obey certain positivity constraints if causality and unitarity are satisfied at all scales. We explore those constraints from the perspective of 2 to 2 scattering amplitudes of a light real scalar field, using semi-definite programming to carve out the space of allowed EFT coefficients for a given mass threshold M. We point out that all EFT parameters are bounded both below and above, effectively showing that dimensional analysis scaling is a consequence of causality. This includes the coefficients of four- and six-derivative interactions. We present simple extremal amplitudes which realize, or\"rule in\", kinks in coefficient space and whose convex hull span a large fraction of the allowed space.", "fields_of_study": "[\"Physics\"]", "external_ids": {"arxiv": "2011.02957", "mag": "3096071290", "acl": null, "pubmed": null, "pubmedcentral": null, "dblp": null, "doi": "10.1007/jhep05(2021)280"}}, "content": {"source": {"pdf_hash": "f497dcce44252f749121faf3c9e0402e79d6129d", "pdf_src": "Arxiv", "pdf_uri": "[\"https://arxiv.org/pdf/2011.02957v2.pdf\"]", "oa_url_match": false, "oa_info": {"license": "CCBY", "open_access_url": "https://link.springer.com/content/pdf/10.1007/JHEP05(2021)280.pdf", "status": "GOLD"}}, "grobid": {"id": "5460e08cd33c7f84b7657ed093d15c1c623e0138", "type": "plain-text", "url": "s3://ai2-s2-pdf-extraction-prod/parse-results/s2orc_worker/f497dcce44252f749121faf3c9e0402e79d6129d.txt", "contents": "\nPrepared for submission to JHEP Extremal Effective Field Theories\n27 May 2021\n\nSimon Caron-Huot \nDepartment of Physics\nMcGill University\nMontréalQCCanada\n\nVincent Van Duong \nDepartment of Physics\nMcGill University\nMontréalQCCanada\n\nPrepared for submission to JHEP Extremal Effective Field Theories\n27 May 2021\nEffective field theories (EFT) parameterize the long-distance effects of shortdistance dynamics whose details may or may not be known. Previous work showed that EFT coefficients must obey certain positivity constraints if causality and unitarity are satisfied at all scales. We explore those constraints from the perspective of 2 → 2 scattering amplitudes of a light real scalar field, using semi-definite programming to carve out the space of allowed EFT coefficients for a given mass threshold M . We point out that all EFT parameters are bounded both below and above, effectively showing that dimensional analysis scaling is a consequence of causality. This includes the coefficients of s 2 +t 2 +u 2 and stu type interactions. We present simple 2 → 2 extremal amplitudes which realize, or \"rule in\", kinks in coefficient space and whose convex hull span a large fraction of the allowed space.\n\nIntroduction\n\nThe notion that degrees of freedom at different length scales decouple from each other is a cornerstone of modern physics. In this note, we consider situations where details of the short-distance physics are unknown, but one is interested in its long-distance effects as parameterized by effective field theory (EFT) coefficients. In relativistic quantum theories, it is known that \"not anything goes\": if the short-distance physics part is compatible with causality and unitarity, the low-energy parameters will obey certain inequalities, discussed notably in [1]. In this paper we explore such inequalities in an effort to carve out the allowed space of local and unitary EFTs. We will consider asymptotically flat space-time, where the S-matrix encodes long-distance or low-energy observables. We will specifically study a subset of EFT parameters, denoted g k , captured by 2 → 2 scattering. As will be reviewed below, causality and unitarity imply dispersive sum rules:\ng k = J ∞ M 2\nds (· · · ) k ρ J (s) (1.1) where the spectral density ρ J (s) (proportional to the imaginary part of the amplitude) is related to the probability of a high-energy state with angular momentum J to scatter at energy √ s > M , and the kernels (· · · ) k are given explicitly below and depend on the particular EFT coefficient g k of interest. The mass M separates \"light\" and \"heavy\" states and can be interpreted as the EFT cutoff in an appropriate scheme. We will be agnostic about the highenergy sector: our only input will be its compatibility with unitarity and crossing symmetry. Unitarity, the statement that probabilities should lie between 0 and 1, will simply mean:\n0 ≤ ρ J (s) ≤ 2 .\n(1.2)\n\nNot all spectral densities that satisfy this inequality are reasonable candidates for the imaginary part of a scattering amplitude, however. This is because Kramers-Kronig type dispersion relations can reconstruct amplitudes from ρ J alone, but there is no guarantee that the outcome satisfies the full crossing symmetry. Crossing-symmetric ρ J (s)'s are orthogonal to an infinite set of \"null constraints\", which will be a key ingredient of this paper. For our purposes, classifying causal and unitary EFTs amounts to finding the image, under the map (1.1), of the set of unitary and crossing-symmetric ρ J (s).\n\nCausality constraints in quantum field theory have been discussed since the inception of the subject. Many studies were motivated by the phenomenology of the strong force [2]. To give just a few examples, dispersion relations and sum rules were used in the analysis of low-energy pion scattering [3][4][5], and inequalities satisfied by EFT parameters were obtained using properties of forward amplitudes in [6,7]. This work aims to explore inequalities on EFT parameters systematically.\n\nWe focus on the simplest example: a single (non-gravitating) real scalar field. Since we view the EFT cutoff M as much larger than the mass of the light scattered particles, we take the latter to be massless. On grounds of dimensional analysis, one expects the coefficient of a (k + d)-dimensional operator in the low-energy effective Lagrangian to scale like ∼ 1/M k , possibly further suppressed by a small coupling, but never larger. This scaling is clearly realized when one integrates out a massive field. The main question to be addressed is: Can dimensional analysis scaling be justified by rigorous numerical bounds? Can \"accidentally large\" EFT coefficients be ruled out ? We will find that the answer is positive, and we present a general framework to numerically obtain the optimal bounds. Furthermore, we will show that much of the shape of the allowed space, including two kinks, can be understood from simple analytic scattering amplitudes.\n\nThe relation between dimensional analysis scaling and causality resonates with many previous studies, for example [8][9][10][11][12]. Our new observation will be the seemingly universal existence of two-sided bounds.\n\nThis paper is organized as follows. In section 2 we review the general principles satisfied by scattering amplitudes, introducing a family of \"B k \" sum rules expressing EFT coefficients as averages over high-energy probabilities. In section 3, we provide a general numerical optimization strategy to rule-out candidate EFTs by making use of the averaging technology. In section 4, numerical results are presented along with remarks. Section 5 bridges the numerics with the analytic results. We conclude in section 6 with a discussion about the potential use cases of the numerical framework presented and the further implications of the numerical results.\n\nNote added: When this manuscript was being completed, the works [13] and then [14] appeared with partial overlap in the results. The second paper in particular gave a two-sided bound on the stu interaction which agrees with our eq. (3.6). Further comparisons will be interesting.\n\n2 Preliminaries: Scattering amplitudes and dispersion relations 2.1 Low energy: effective field theory We consider 2 → 2 scattering of massless identical real scalars in a Poincaré invariant theory ( fig. 1). Treating all momenta as incoming, the amplitude is a function of Mandelstam invariants:\ns = −(p 1 + p 2 ) 2 , t = −(p 2 + p 3 ) 2 , u = −(p 1 + p 3 ) 2 (2.1)\nwhich satisfy s + t + u = 0. By crossing symmetry, it is invariant under all permutations (this holds with appropriate i0's in the discontinuity, as further discussed below):\nM(s, t) = M(t, s) = M(s, u) = . . . (2.2)\nOur first step is to parameterize the amplitude at low energies in terms of a specific effective field theory. Generally, the form of the amplitude depends on the couplings of the theory. It becomes particularly simple if the theory is weakly coupled and we restrict ourselves to the tree approximation. We thus use the tree approximation here and until subsection 2.4 In this case, the amplitude has no low-energy branch-cuts, so the EFT expansion is simply a series in small s, t, u:\nM low (s, t) = − g 2 1 s + 1 t + 1 u − λ + g 2 (s 2 + t 2 + u 2 ) + g 3 (stu) + g 4 (s 2 + t 2 + u 2 ) 2 + g 5 (s 2 + t 2 + u 2 )(stu)\n+ g 6 (s 2 + t 2 + u 2 ) 3 + g 6 (stu) 2 + g 7 (s 2 + t 2 + u 2 ) 2 (stu) + · · · (2.3) The first line accounts for φ 3 and φ 4 relevant interactions, while the remaining terms simply list the most general symmetric polynomials in s, t, u, to account for higher-dimension operators in the EFT. The subscript denotes the degree in Mandelstam invariants. Symmetric polynomials are easy to enumerate since their ring is freely generated by two elements: s 2 + t 2 + u 2 and stu (given that s + t + u = 0).\n\nA short exercise shows that the preceding amplitude is obtained from the following effective Lagrangian in the tree approximation:\nL low = − 1 2 (∂ µ φ) 2 − g 3! φ 3 − λ 4! φ 4 + g 2 2 (∂ µ φ) 2 2 + g 3 3 (∂ µ ∂ ν φ) 2 (∂ σ φ) 2 + 4g 4 (∂ µ ∂ ν φ) 2 2 + · · · (2.4)\nAs is well known, Lagrangian densities are not unique: they are defined modulo integrationby-parts and field redefinitions. One can cast any effective Lagrangian for a real scalar field into the form (2.4) by using field redefinitions to eliminate, order by order in the derivative expansion, corrections to the kinetic and cubic terms as well as appearances of ∂ 2 φ. See for example [15] for a discussion in the Standard Model context. The amplitude (2.3) is a physical observable unaffected by such ambiguities, which is why we choose to parameterize the coefficients in terms of it. Our goal is to constrain the EFT parameters g k assuming existence of an high-energy completion which is causal and unitary, but not necessarily weakly coupled. Low-energy interactions involving five or more powers of φ will not be constrained by our methods, since they are not detected by (tree-level) 2 → 2 scattering. When low-energy loop corrections are included, the detailed form of eq. (2.3) will be modified, but we do not expect the number of independent EFT parameters that we can constrain to increase. A precise definition of the g k 's that remains valid in the presence of low-energy loop corrections is given in eq. (2.18) below.\n\n\nHigh energy: partial wave decomposition\n\nAt high energies, we will be agnostic about the form of the amplitude except for the assumption that it is causal and unitary. We follow the general framework of S-matrix theory, as reviewed for example in [2]. Let us begin with unitarity of the S-matrix, which is formally that: S † S = 1, where S = 1 + iM. More precisely, one picks a physical region, say where s > 0 is interpreted as center-of-mass energy squared, and −s < t < 0 gives the momentum transfer (squared); the scattering angle is\ncos θ = 1 + 2t s . (2.5)\nThe scattering operator is a convolution with respect to angles, which is diagonalized by going to a basis of angular momentum partial waves. The unitarity condition is thus simplest to state in this basis (our conventions follow [16]):\nM(s, t) = J even n (d) J f J (s)P J 1 + 2t s , n (d) J = (4π) d 2 (d + 2J − 3)Γ(d + J − 3) πΓ d−2 2 Γ(J + 1) , (2.6)\nwhere d is the space-time dimensions and P J (x) are the d-dimensional version of Legendre polynomials (which appear in the d = 4 case):\nP J (x) ≡ 2 F 1 −J, J + d − 3, d − 2 2 , 1 − x 2 . (2.7)\nDetails of the specific scattering process are encoded in the coefficients f J (s). In this normalization convention, unitarity of the elastic amplitude of identical real particles is [16]:\nS J (s) ≤ 1, S J (s) ≡ 1 + is d−4 2 f J (s) . (2.8)\nThe elastic amplitude S J can have absolute value less than unity due to inelastic processes. We will only need the imaginary part of the high-energy amplitude. Defining the spectral density ρ J (s) = s d−4\n\n2 Im f J (s), it can thus be written as\nIm M(s, t) = s 4−d 2 J even n (d) J ρ J (s)P J 1 + 2t s (2.9)\nwhere the unitarity constraint is\n0 ≤ ρ J (s) ≤ 2 ∀s > 0, ∀J even . (2.10)\nThe normalization is such that ρ J = 1 for complete absorption (S J = 0), and ρ J = 2 for an elastic phase shift π. For the most part (except for subsection 3.5) we will only use the first inequality: 0 ≤ ρ J (s).\n\n\nDispersion relations\n\nThe other key ingredient from S-matrix theory is the connection between low and high energies, which stems from analyticity. More precisely, we will use the following two properties of the amplitude:\n\n1. For fixed t < 0 and |s| sufficiently large, M(s, t) is analytic in s away from the real axis.\n\n2. For fixed t < 0, lim |s|→∞ M(s,t) s 2 = 0 along any line of constant phase.\n\nPhysically, these conditions combine causality and unitarity. For an elementary explanation of their respective significance, we refer to the signal propagation model in appendix D of [8], where it is explained that propagation of a signal through a black box is causal if and only if the corresponding transfer function S(ω) is analytic in the upper-half frequency plane (with sub-exponential growth), and that |S(ω)| 2 ≤ 1 throughout the upper-half-plane if the box furthermore preserves the squared-norm of signals. These are general facts about Fourier transforms. The original physical derivation of crossing symmetry [17] applies these facts to the expectation value of a retarded commutator in one-particle state. Schematically, one considers\np 4 | [φ(x 3 ), φ(x 2 )]θ(x 0 3 − x 0 2 ) |p 1 ,(2.11)\nwhich vanishes outside the forward light-cone rendering its Fourier transform analytic in the upper-half s-plane (intuitively, one uses that s is linear in right-moving light-cone momentum), at least for large enough |s|. Its boundary values on the real axis unite the s-channel amplitude and the complex conjugate of the u-channel amplitude, see fig. 2. This is the traditional understanding of crossing symmetry within the axiomatic theory [18]. The boundedness property, in particular including the extra factor of 1/s 2 compared with the signal model, will be critical for us. We believe it can be justified physically by directly analyzing the transverse Fourier transform [19]. As far as we understand, properties 1-2 are theorems in axiomatic quantum field theory, for example in the context of pion scattering [20,21]; we take them as axioms embodying causality and unitarity.\n\nThe two properties assumed above amount to the existence of twice-subtracted dispersion relations. Let us derive such dispersion relations explicitly. The starting point is that an integral over a large circle vanishes:\n∞ ds 2πi(s − s) M(s , t) (s − s 1 )(s − s 2 ) = 0 (2.12)\nwhere s 1 and s 2 are arbitrary subtraction points. For large enough s , the integrand behaves like ∼ M(s , t)/s 3 , and so the integral vanishes thanks to property 2. Typically, one would formally treat all of s, s 1 and s 2 as non-real and deform the contour toward the real axis. Summing the three explicit poles and cuts then relates M(s, t) to its value at two subtraction points plus an integral over the discontinuity of M across the real axis [22]. For our purposes it is convenient to instead treat the subtraction poles as part of the real-axis cuts. We choose s 1 = 0 and s 2 = −t to maintain the symmetry between the s and Figure 2: Analyticity in the upper-half-plane relates the s-channel amplitude and the complex conjugate (anti-time-ordered) u-channel amplitude. Note that the s-and u-channel cuts overlap in the physical region where t < 0, which is not a problem since the crossing path avoids small |s|. Figure 3: Contour deformation which gives the sum rule (2.14) when low-energy loops are neglected: the integral over arcs at infinity vanishes, thus relating low-energy data and heavy cuts.\nRe Im × × • • u-cut s-cut M * M sRe Im × × × × −t −M 2 − t M 2 |s| → ∞ s = Re Im × × × × −t −M 2 − t M 2 s\nu channels without introducing any new energy scale into the problem. The identity (2.12) then relates the residue at s = s with a discontinuity:\nM(s, t) s(s + t) = ∞ −∞ ds π(s − s) Im M(s , t) s (s + t) (t < 0, s / ∈ R),(2.13)\nwhere we have written the discontinuity as an imaginary since the amplitude on the \"wrong side of the cut\" is its complex conjugate; technically Im f (s)\n≡ 1 2i f (s + i0) − f (s − i0)\n. We call eq. (2.13) a twice-subtracted dispersion relation because of the two powers of s added to the denominator.\n\nLet us see how this works in the simplest situation considered in eq. (2.3), where lowenergy loops are neglected. Then branch cuts can only start at the UV cutoff M 2 . The right-hand-side of eq. (2.13) then contains low-energy poles at s = 0 and s = −t (due both to the denominator in eq. (2.13) and poles in the amplitude), and high-energy cuts at s > M 2 and s < −M 2 − t. Separating low and high energies gives a relation:\nM low (s, t) s(s + t) + Res s =0,−t 1 s − s M low (s , t) s (s + t) = ∞ M 2 ds π 1 s − s + 1 s + s + t Im M high (s , t) s (s + t) .\n(2.14)\n\nWe used s ↔ u symmetry to combine the left and right cuts. This relation is supposed to converge for any s, t with u < 0. Interestingly, plugging in the EFT expansion eq. (2.3) for M low , one finds that both the spin-0 exchange diagram g 2 and spin-0 contact interaction λ cancel out, and what remains is pole-free (this could have been anticipated from the fact that the three residues on the left combine into a single contour over a large circle). On the right-hand-side we insert the partial wave expansion (2.9). It is useful to define heavy averages:\nF (m 2 , J) ≡ J even n (d) J ∞ M 2 dm 2 π m 4−d m 2 ρ J (m 2 ) F (m 2 , J) . (2.15)\nEq. (2.14) becomes, for t < 0:\n2g 2 − tg 3 + 4 2t 2 + s(s + t) g 4 + . . . = 2m 2 + t (m 2 − s)(m 2 + s + t) P J (1 + 2t m 2 ) m 2 (m 2 + t)\n.\n\n(2.16)\n\nThe averaging symbol denotes a (non-normalized) positive sum over heavy states with mass m > M . All the results in this paper follow from Taylor-expanding both sides in s and t and using positivity of the measure · · · . It will be useful (though non-essential) to re-organize a bit.\n\n\nThe B k (t) family of sum rules\n\nIt is easy to see that the Taylor expansion of both sides of eq. (2.16) maintains the symmetry under s → −s − t, and therefore only even powers of s carry information. More precisely, for each even integer k the coefficient of [s(s + t)] k/2−1 gives a one-parameter family of sum rules parameterized by t, which we call B k (t). It can be computed by taking the s → 0 limit in eq. (2.12):\nB k (t) ≡ ∞ ds 2πi 1 s M(s, t) s(s + t) k/2 = 0 (t < 0, k = 2, 4, . . .) . (2.17)\nThis is similar to moment sum rules ∞ ds s k+1 M(s, t) which have been used since times immemorial. Here we have simply re-organized using the s ↔ u symmetry of our problem to eliminate odd moments. 1 The subscript indicates that B k enjoys the high-energy convergence of a k-subtracted dispersion relation. 1 The identity: ∞ ds 2πi 1 s s(s + t) (k−k )/2 = δ k,k shows that eq. (2.17) indeed extracts the coefficient of Figure 4: Integration contour to be used when low-energy loops are included; the integral vanishes as it is equivalent to arcs at infinity. This relates high-energy cuts at s > M 2 and u > M 2 with EFT-computable data near the EFT cutoff |s| ∼ M 2 .\n[s(s + t)] k/2 in M low . Re Im × × × × −t −M 2 − t M 2 s\nA closely related basis of sum rules was introduced recently for conformal field theory correlators [23] (see also [24]). For holographic theories, the Mellin-space form of the sum rule, called B k,t (see eq. (4.54) and section 4.8 there), precisely reduces in the flat space limit to our current B k (t). In this context, convergence for k ≥ 2 is a consequence of the known boundedness of conformal correlators in the Regge limit.\n\nFor massless scattering, the low-energy s-and u-channel cuts of M(s, t) generally overlap as shown in fig. 2. It is important that eq. (2.17) can be computed without going between the cuts. We simply deform the contour to pick heavy branch cuts at s > M 2 and u > M 2 , and keep the rest as large arcs with |s| ∼ M 2 , the EFT cutoff, see fig. 4. This gives a relation between physics at the scale M and that at higher-energies:\nB k : |s|≈M 2 ds 2πi 1 s M(s, t) s(s + t) k/2 = 2m 2 + t m 2 + t P (d) J 1 + 2t m 2 m 2 (m 2 + t) k/2 (t < 0, k = 2, 4, . . .) .\n(2.18) This equation is valid even when EFT loops are included. The idea is to choose the EFT cutoff M such that loop corrections in the low-energy EFT are under control over the arcs with |s| ≈ M 2 . Eq. (2.18) thus equates an EFT-computable left-hand-side, with a high-energy average that enjoys positivity properties.\n\nThe specific relation between the left-hand-side and EFT coefficients will depend on EFT interactions. For concreteness let us thus focus again on the case where EFT loops are neglected. The left-hand-side is then just the sum of residues at s = 0 and s = −t; By symmetry, we can replace 1 s by 1 s − 1 s+t and include a single pole, and the B k sum rules becomes:\nB k : Res s=0 2s + t s(s + t) M low (s, t) s(s + t) k/2 = 2m 2 + t m 2 + t P (d) J 1 + 2t m 2 m 2 (m 2 + t) k/2 (t < 0, k = 2, 4, . . .) .\n(2.19) This simplification of eq. (2.18) is only valid when neglecting EFT loops.\n\nLet us record the first few two instances explicitly:\nB 2 : 2g 2 − g 3 t + 8g 4 t 2 + . . . = 2m 2 + t P J 1 + 2t m 2 m 2 (m 2 + t) 2 , (2.20) B 4 : 4g 4 + . . . = 2m 2 + t P J 1 + 2t m 2 m 4 (m 2 + t) 3 . (2.21)\nThe left-hand side has a regular series in t, and the right-hand side involves Gegenbauers P J (1 + 2t m 2 ), which can be straightforwardly expanded at small t M 2 using eq. (2.7) . Recall that averages are taken over heavy states with m ≥ M . Matching both sides order by order in t generates a linear system in g n 's:\ng 2 = 1 m 4 , g 3 = 3 − 4 d−2 J 2 m 6 , g 4 = 1 2m 8 , g 4 = 1 + 4−5d 2d(d−2) J 2 + 1 d(d−2) J 4 2m 8 . (2.22)\nWe introduced the spin Casimir J 2 = J(J + d − 3) for convenience. Note that we truncated M low to order g 4 , but it is possible to work to higher orders and generate linear relations on couplings such as g 5 and so on.\n\nThe averaging notation immediately shows that g 2 , g 4 > 0 since they are high-energy averages of positive quantities 1 m 4 and 1 2m 8 , respectively. Furthermore, the inequalities g 3 ≤ 3g 2 M 2 and g 4 ≤ g 2 2M 4 also follow readily since m ≥ M inside the average. In contrast, the sign of g 3 is not immediate due to the presence of spinning particles -the magnitude of J 2 requires a deeper investigation. This difficulty was noted in attempted proofs of the six-dimensional a-theorem [25].\n\nThe key to calculating a lower bound for g 3 will be the existence of two distinct averages that output g 4 . Equating them yields the first example of what turns out to be an infinite set of null constraints:\n0 = n 4 (m 2 , J) , n 4 (m 2 , J) ≡ J 2 2J 2 − (5d − 4) m 8 . (2.23)\nThis is a constraint on the probabilities ρ J (s) which define the average · . The subscript indicates the degree in 1/m 2 . Physically this stems from crossing symmetry -since there is a unique symmetric polynomial at degree 4, the coefficients of s 2 t 2 and s 4 must be related. There are no lower-degree examples of this phenomenon: monomials with fewer than two powers of s are killed by any double-subtracted sum rule, and odd powers of s are informationfree since fixed-t dispersion relations preserve the s ↔ −s − t symmetry of our problem. Null constraints such as eq. (2.23) will be central to this work. They balance spin-two states against higher spin states: as visible from fig. 5, the average vanishes for spin 0, is negative for spin 2, and positive for all other spins. This implies that, as soon as one particle \n��������� � � � � �� � � � � � -� � � �� � � � � � (� � � �) � (� -�)(3 − d + d(d + 4) + 1)) is always situated between 2 < J < 3.\nof spin 2 is present, higher-spin particles must also be present, with predictable properties.\n\n(Spin two particles are singled out by the physical assumption that double-subtracted sum rule converges.)\n\n\nOptimization framework\n\nThe B k sum rules just introduced, coupled with positivity of high-energy averages · provide a complete apparatus to establish potent self-consistency conditions on EFT coefficients g k 's (defined in eq. (2.3)). We recall our physical assumptions:\n\n• Double-subtracted dispersion relations converge\n\n• The low-energy amplitude is crossing symmetric\n\n• The high-energy spectral density is positive\n\nSince we are considering averages over heavy states (with m > M ), the coefficients (except in subsection 3.5) are naturally normalized by g 2 and the EFT cutoff M . We will therefore be bounding dimensionless ratios:\ng 3 = g 3 M 2 g 2 ,g 4 = g 4 M 4 g 2 ,g 5 = g 5 M 6 g 2 , . . . (3.1)\nOptimal bounds on theseg k 's will be found by formulating a dual problem, in which we combine the desired averages (such as 2.18) with null constraints (such as eq. (2.23)) to obtain sign-definite sum rules. We first describe a simple example analytically, then describe a systematic implementation as a semi-definite problem amenable to publicly available software like SDPB [26].\n\n\nWarm-up problem with three sum rules\n\nAs a warm-up, let us ask whether it is possible to lower-bound theg 3 coefficient using the B 2 , B 4 sum rules previously calculated. We consider the corresponding system of three equations from (2.22) (including the null constraint obtained via g 4 data):\ng 2 = 1 m 4 , g 3 = 3 − 4 d−2 J 2 m 6 , 0 = J 2 (2J 2 − 5d + 4) m 8 . (3.2)\nWith these definitions, let us examine a similar, but simpler set of relations: \nh 2 = 1 m 4 , h 3 = a − J 2 m 6 , 0 = J 4 − bJ 2 m 8 ≡ n(m 2 , J) .3 = 4 d−2 h 3 . Consequently, our warm-up problem is to lower-bound h 3 .\nWhat makes a finite lower bound plausible is that the null constraint (the third equation) should somehow prevent large spins from contributing too much. This is an important point: the allowed range forg 3 is restricted by higher derivative crossing equations! We now calculate a lower bound in two ways. The first -and simplest -method is to use the Cauchy-Schwarz inequality with the null constraint:\nJ 2 m 6 2 ≤ 1 m 4 J 4 m 8 = b 1 m 4 J 2 m 8 . (3.4)\nThen, using the fact that m > M and J 2 ≥ 0 inside the average yields J 2\nm 8 ≤ 1 M 2 J 2 m 6\n, and by dividing both sides by that average, we obtain an upper-bound on J 2 m 6 as desired:\nJ 2 m 6 ≤ b M 2 1 m 4 ⇒ h 3 ≥ − b M 2 h 2 . (3.5)\nThis has a simple physical interpretation: if we define an impact parameterb = 2J m , then we have effectively shown that heavy states can't contribute at impact parameters much larger than ∼ 1/M . In terms of the original problem (3.2), we have shown that\n− 2(5d − 4) d − 2 ≤ g 3 M 2 g 2 ≤ 3 . (3.6)\nThis shows the existence of two-sided bounds for generic couplings. This is an important qualitative result, to our knowledge originally emphasized in [11]: ratios of EFT couplings, in units of the cutoff scale M , must be O(1) numbers. Numerically, however, the Cauchy-Schwarz method does not yield the optimal lower bound.\n\nIn contrast, the second -and more powerful -method is re-interpret the above task as a semi-definite problem, in order to systematically search for optimal bounds. Denote h i (m 2 , J) the function whose average gives h i . The idea is to construct positive-definite combinations of the three averages in eq. (3.3):\nF (m 2 , J) ≡ h 3 (m 2 , J) + αh 2 (m 2 , J) + βn(m 2 , J) = a − J 2 m 6 + α m 4 + β J 4 − bJ 2 m 8 ,(3.7)\nwhere we must find α, β such that F (m 2 , J) ≥ 0 for all J = 0, 2, 4 . . . and m ≥ M . Taking the average of any such F then proves h 3 ≥ −αh 2 . The optimal bound will come from a non-negative F with minimal α. Let us first reproduce the first Cauchy-Schwarz argument in this language, which should give α = b M 2 . Assume β > 0. The argument amounts to completing squares in the J 4 /m 8 term:\nF (m 2 , J) = α − βλ 2 m 4 + a m 6 + J 2 m 6 (2βλ − 1) − βb J 2 m 8 + β 1 m 4 J 2 m 2 − λ 2 positive . (3.8)\nFor any λ this is an identical rewriting of eq. (3.7), and the Cauchy-Schwartz-like method is to choose λ, β such that the other terms are positive as well. From the limit J → ∞, the terms with J 2 need to give a positive functions of m, which imposes that (2βλ − 1 − βb/M 2 ) ≥ 0.\n\nTo minimize α we must minimize βλ 2 ; we find that the minimum saturates the inequality, and is simply β = M 2 /b with βλ = 1. With this choice, our trial functional becomes\nF (m 2 , J) = α − b M 2 m 4 + a m 6 + J 2 m 6 1 M 2 − 1 m 2 + M 2 bm 4 J 2 m 2 − b M 2 2 positive . (3.9)\nThe minimal α for which the first terms are positive for all m 2 is then α = b M 2 , precisely as anticipated! We have thus exhibited a positive functional F which proves the Cauchy-Schwarz bound in (3.5).\n\nIt is now easy to see why this bound is not optimal: F doesn't need to be expressible as a sum of three separately positive parts! In d = 4, for example, the above argument gives −16 ≤g 3 . In comparison, using the numerical search strategy detailed in the next subsections, we find that the following combination is positive for all J = 0, 2, 4 . . . and m ≥ M :\n0 ≤ F (m 2 , J) =    10.61249 1 0.0671875    ·    g 2 (m 2 , J) M 2 g 3 (m 2 , J) M 4 n 4 (m 2 , J)    . (3.10)\nThis allows to infer, by taking the average of this inequality, that This is significantly stronger than −16 ≤g 3 that we just derived in an ad hoc manner. How can we understand the solution (3.10) analytically? They key ingredient will be that spins J are discrete, whereas our ad hoc bound treated J's as continuous parameter. We now calculate this bound analytically. Let us return to the functional ansatz (3.7) and try to directly constrain the unknowns α, β. Putting J = 0 we only deduce α ≥ 0. Putting J = 2, 4 . . . gives a sequence of quadratic polynomials in (m 2 − M 2 ), each with positive curvature. Such polynomials are non-negative if the two roots are negative, or if both roots are positive and equal, or if they are complex conjugate pairs. It seems virtually impossible to guess a priori which case is realized, however this information is readily gleaned by plotting the numerical polynomials (3.10), as shown in fig. 6. We see that the J = 2, 4 inequalities are both saturated: the former by having a root at m 2 = M 2 , and the latter by having a positive double root (i.e. vanishing discriminant).\n\nThese two saturated inequalities give algebraic equations that may be solved analytically; this determines the vector (α * , 1, β * ) in eq. (3.10) to be: \nα * = 5d − 2 + (d+3)(319d 3 +76d 2 −292d+32) 6(d+1)(d+4) 2(d − 2) , β * = 1 2d(d − 1) α * − 5d − 2 d − 2 . (3.12) ���� � � � � ��� ��� ��� ��� ��� ��� ��� ��� ��� ��� ��� ��� ��� ��� � � /� � �(� � � �)\n\nDual problem: general formulation\n\nWe now introduce the general \"dual\" optimization problem which allows to carve out the space of EFT coefficientsg 3 ,g 4 ,g 5 , . . . allowed by unitarity and positivity.\n\nThe data at our disposal comes from the B k sum-rules in eq. (2.19):\n\n1. Representative averages g k (m 2 , J) which measure each \"desired\" g k : allowing the desired optimal bound ong 3 to be inferred:\ng 2 = g 2 (m 2 , J) , g 3 = g 3 (m 2 , J) , g 4 = g 4 (m 2 , J) , · · ·\nA ≤g 3 . It then follows thatg 3 ≤ B. Taking the intersection of these two sets yields a convex region defined by\nA ≤g 3 ≤ B. (3.20)\nThese are the inequalities inferred ong 3 from data in the B k sum-rules. In theory, the null constraints n i are part of an infinite dimensional vector space, but for numerical purposes, the dimensionality is taken to be finite and determined by the truncation order of the low-energy expansion M low . We will find that the optimal bounds converge rapidly as the maximal degree is increased.\n\nThis problem can be readily adapted if we are given additional assumptions. For example, to make exclusion plots in the (g 3 ,g 4 ) plane, one strategy is to postulate some value ofg \ng 4 ≥ A + Bg(0)\n3 , for example. In fact, since the EFT parameters enter linearly, the resulting inequality automatically carves out a half-space in the (g 3 ,g 4 )-plane:\ng 4 − Bg 3 ≥ A. (3.22)\nThis half-plane is tangent to the allowed region atg 3 =g\n\n3 . If this process is repeated for distinctg (0) This processes generalizes to higher dimensional planes (i.e. hyperplanes): the vector v always contains only those coefficients we are not being agnostic about, plus an arbitrary number of null constraints. Although we will not go beyond three-dimensional regions, we note that an efficient search algorithm in higher dimensions is described in ref. [27].\n\n\nExample with a SDPB implementation\n\nThe optimization problem just formulated is in a form that is directly amenable to the SDPB solver [26]. There are just two simple substitutions to make:\n\n1. The program accepts polynomials of x ≥ 0; we set m 2 → M 2 (1 + x) and remove a common denominator.\n\n2. The program accepts finite lists of polynomial constraints. We tabulate a finite list of spins J = 0, 2, . . . , J max and add a single function of x corresponding to J → ∞.\n\nThe second truncation is valid as long as J max is taken sufficiently large; once convergence is achieved, further increases of J max have no effect on the bounds. We consider now an example relevant to one of the plots in the next section, when working in d = 4, J max = 40 and Mandelstam order n = 4. The goal is to find a lower bounding plane ong 4 for fixedg 3 , sayg 3 = −10.5 (which is slightly above the allowed lower bound In addition to tabulating v for all even J ≤ J max , we also include the infinite-J limit, which is simply the coefficient of J 4 :\n\nv(x, ∞) = (0, 0, 0, 2) .\n\n\n(3.25)\n\nTo lower-boundg 4 at the stated value ofg 3 , we search for four-vectors y, normalized to y· 0, 0, 1, 0 = 1, which solve the following problem:\nmaximize: h = y· (−1, −(−10.5), 0, 0) subject to: 0 ≤ y·v(x, J) ∀ x > 0, J ∈ {0, 2, · · · , 40, ∞} . (3.26)\nThe lower bound is theng\n4 ≥ h (atg 3 = −10.5) . (3.27)\nThe solution vector y computed by SDPB was found to be y ≈ (1.4823, 0.1810, 1, 0.01472), giving h = 0.4183. The half-plane allowed by positivity of y·v is thus g 4 + 0.1810(g 3 + 10.5) ≥ 0.4183 (3.28) which gives one of the boundaries used to make the n = 4 region in fig. 10 (b) below.\n\n\nGenerating null constraints\n\nSo far we used a single constraint from crossing: the null average n 4 (m 2 , J) from eq. (2.23).\n\nThe bounds improve after we add more constraints. Let us describe a way to generate them. A straightforward method is as follows. First, fix a degree in Mandelstam invariants, n. Then, list all the n 2 low-energy averages corresponding to this degree, namely the coefficient of t n−k in the left-hand-side of the B k (t) sum rules (2.19) with k ≤ n, using the crossingsymmetric low-energy ansatz (2.3). The right-hand-sides of those linear combinations with vanishing left-hand-side then constitute a basis of null constraints.\n\nThe first few cases, up to degree n = 7, are (in arbitrary normalization):\nm 8 n 4 = (4 − 5d)J 2 + 2J 4 , m 10 n 5 = 23d 2 − 12d − 20 J 2 + (−21d − 2)J 4 + 4J 6 , m 12 n 6 = 4 13d 2 + 21d + 2 J 4 − 3(d + 2) 17d 2 + 4d − 16 J 2 + 2(−9d − 8)J 6 + 2J 8 , m 14 n 7 = 6 45d 2 + 140d + 92 J 6 + 4 −140d 3 − 619d 2 − 711d − 46 J 4 + 401d 4 + 2108d 3 + 2284d 2 − 3008d − 3360 J 2 + 5(−11d − 18)J 8 + 4J 10 , m 14 n 7 = (−27d − 14) J 4 + 2(d − 1)(19d + 22)J 2 + 4J 6 (3.29) where we recall that J 2 = J(J + d − 3)\n. Note that all null averages vanish when J = 0: they relate spinning heavy states to one another, but spinless states are completely decoupled.\n\nWe find that there exists a single null constraint for each degree n = 4, 5, 6, then two constraint each for n = 7, 8, 9, three each for n = 10, 11, 12, etc.: the number of linearly independent null constraints at each degree increases by 1 for every increase of n by 3. A sequence of generating functions X k (t) which enumerates them all is discussed in appendix A.\n\nFinally, it is important to stress that the null constraints only average to zero modulo EFT loops, since the method for finding them relies on the explicit tree-level parameterization (2.3). The interpretation of resulting inequalities as bounds on g k is thus only strictly valid in this approximation. In an interacting EFT, the coefficients g k depend on choices of scale and renormalization scheme, and the correct interpretation of the positive functionals F is that they give rigorous (possibly non-optimal) inequalities of the form:\ng 3 (m 2 , J) + i c i n i (m 2 , J) ≥ A g 2 (m 2 , J) (3.30)\nwhere all averages are computed as integrals over arcs with |s| ≈ M 2 following eq. (2.18). The method thus produces rigorous bounds on computable combinations of EFT couplings at the scale M .\n\n\nAn ad hoc upper bound on (∂φ) 4\n\nThe systematic method explained above bounds ratios g k /g 2 , but how about g 2 itself? Here we present one upper bound on g 2 ; this subsection is somewhat separate from the rest since we were unable to systematically optimize the bound.\n\nThe naive intuition is that if heavy states couplings are order unity, then g 2 ∼ 1 M d . An upper bound with this scaling should thus follow from the unitarity limit, ρ J ≤ 2. This would be the full story if heavy states only had a finite number of spins, however, to get an actual bound one must also control the infinite sum over spins. The idea is to combine the sum rule for g 2 with a multiple of the first null constraint n 4 :\ng 2 = 1 m 4 − α f (J) m 8 with f (J) = J 2 2J 2 − (5d − 4) . (3.31)\nThis holds for any α; we recall that J 2 = J(J + d − 3) is the spin Casimir. Inserting the definition (2.15) of the average and switching to a dimensionless mass parameter z = M 2 /m 2 < 1, this can be rewritten\ng 2 = 1 πM d J even n (d) J 1 0 dz z z d 2 ρ J (M 2 /z) 1 − αz 2 f (J) . (3.32)\nThis is a good step to get an upper bound on g 2 since for α > 0 the integrand is mostly negative at large spin J, except for a small region with z small. We use unitarity in two steps: first, we use positivity ρ J ≥ 0 to restrict the integral to the small-z region where the parenthesis is positive, where we can then use ρ J ≤ 2. Thus:\ng 2 ≤ 2 πM d J even n (d) J zmax(J) 0 dz z z d 2 1 − αz 2 f (J) (3.33)\nwhere z max (J) = min([αf (J)] − 1 2 , 1) determines the region where the parenthesis is positive. The important point is that at large spin this region shrinks, which will ensure convergence of the J sum. Effectively the region is bounded by impact parameter Mb ∼ < α −1/4 . At small spins the full range is generally accessible. Letting z max (J) = 1 for J ≤ J * (α), the sum splits as\ng 2 ≤ 2 πM d   0≤J≤J * (α) n (d) J 2 d − 2αf (J) d + 4 + 8α − d 4 d(d + 4) J>J * (α) n (d) J f (J) d 4   . (3.34)\nBoth sums run only over even spins. Since n (d) J ∝ J d−3 at large spin, the sum to infinity converges. This inequality is valid for any α > 0; with increasing α, the J = 0, 2 terms tend to increase whereas the rest decreases: the optimal bound with this method is obtained by minimizing over α. The dependence is rather non-linear (which is why we were not able to generalize the method to include more null constraints), but evaluating the sum numerically we find (in all dimensions we tried) that the optimum occurs with J * = 2. In d = 4, for example, the optimal value α * = 0.025, giving the analytic bound: 4) .  Table 1: Nonperturbative (possibly non-optimal) upper bounds on\n0 ≤ g 2 (4π) 2 ≤ 0.794 M 4 (d =g 2 M d Γ( d 2 ) (4π) d 2 Γ(d) in various space- time dimensions.\nAs expected, up to a standard loop factor, the coefficient of 1 2 (∂φ) 4 can't exceed order unity in units of the heavy scale. We stress that, contrary to other bounds in this paper, upper bounds on couplings at the cutoff scale cannot be straightforwardly interpreted in terms of Lagrangian parameters, since any EFT which saturates them is by definition strongly interacting already below the cutoff, making quantum corrections non-negligible. Rather, the bound may be interpreted as follows: among all observables which are linear in the S-matrix at the scale M and which reduce to g 2 at weak coupling, there exists one which satisfies eq. \n\n\nNumerically ruling-out: The allowed space of scalar EFTs\n\nIn this section, we summarize the obtained numerical results, focusing on d = 3 + 1 spacetime dimensions. Treating the low-energy EFT to tree-level, we determine the space of EFT coefficients g n , where the low-energy amplitude is parameterized as\nM low = − g 2 1 s + 1 t + 1 u − λ + g 2 (s 2 + t 2 + u 2 ) + g 3 (stu) + g 4 (s 2 + t 2 + u 2 ) 2 + g 5 (s 2 + t 2 + u 2 )(stu) + · · · (4.1)\nRecall that it is convenient to introduce dimensionless EFT coefficientsg n normalized by g 2 and appropriate powers of the mass gap M introduced in equation (3.1), since the numerical analysis is performed directly on these variables. We find optimal upper and lower bounds forg 3 ,g 4 , andg 5 , given positivity of high-energy spectral densities ρ J , using the optimization framework introduced above.\n\n\nBounds on individual coefficients\n\nLet us begin by confining the value of individual EFT coefficients, being completely agnostic about all the others.  Table 2: Convergence of the \"box bounds\" (4.2) with increasing Mandelstam order n , which results in larger sets of orthogonal constraints N = {n 4 (m 2 , J), · · · }. At order n = 3, all lower bounds would be −∞ since no null constraints exist at that order.\n\nThe simple, rational upper bounds are saturated by the spin-0 contribution to sum rules like eq. (2.22). While keeping constraints with higher Mandelstam degree n is feasible, runtime-wise, we found that the large-spin convergence was harder to control as we needed J max = O(1000). However, for n ≤ 16, convergence is easily obtained for smaller spins. This is the reason why we stopped the table at n = 16; it would be interesting to understand how to stabilize the numerics at large n.\n\nTheg 3 lower bound is plotted as a function of 1/dim N in fig. 7, where dim N is the dimension of the number of null constraints accessed. The dimension of this vector space is naturally monotonically increasing with the Mandelstam order n. Ideally, one would like to extrapolate the bounds to n → ∞, however the approach is somewhat irregular and we didn't find a compelling fit function. Therefore, the recorded bounds are simply taken from our largest reliable value of n.\n\nIn d = 6 and d = 10, the analogous bounds take the values: g n obtained with n = 10 (corresponding to 12 linearly independent null constraints) are presented in appendix B.\n\n\nTwo-dimensional allowed region in (g 3 ,g 4 ) plane\n\nThe \"box bounds\" in eq. (4.2) tell an incomplete story since they miss potential correlations between the coefficients. Exclusion plots on the (g 3 ,g 4 ) plane can be obtained following the constrained optimization framework presented at the end of section 3.2. Specifically, upper and lower bounding planes ong 4 were obtained by samplingg 3 at various points in the range allowed by eq. (4.2). Repeating this process for a large number of sampling points generates a collection of linear inequalities, whose intersection defines a refined allowed region. Figure  8 depicts this region with over 100 sampling points alongg 3 .\n\nFurther insight into the shape of the region can be obtained by noticing that the crossing symmetry constraints do not mix particles of spin 0 with the others, as noted in eq. (3.29). This indicates that heavy spin-0 particles satisfy crossing on their own, as will be further discussed in the next section. For numerical purposes, this decoupling allows to refine the problem: any high-energy spectrum can be written as a positive sum of its spin-0 content, plus a unitary solution to crossing that only contains particles of spin J ≥ 2. The full allowed region is then simply the convex hull of the allowed regions for these two problems:\n-�� -� -� -� -� � � ��� ��� ��� ��� ��� ��� -�� -� -� -� -� � � ��� ��� ��� ��� ��� ��� �  � �  � ��� �\nEntire region = Convex Hull [Spin-0 + Spin-J ≥ 2] . (4.5)\n\nAs may be seen from the form of the g 3 sum rule (2.22), the two solutions are differentiated by the sign of g 3 : positive for Spin-0 and negative for Spin-J ≥ 2. In our implementation of the dual problem, theories with only J ≥ 2 particles can be studied by simply dropping the positivity constraint for the functional action on J = 0. The allowed regions for the Spin-0 and Spin-J ≥ 2 sub-problems are the narrow almond-shaped regions shown in fig. 9.\n\nThe shape of these regions is largely explained by a simple scaling argument: given any solution to crossing, scaling-up its overall mass scale will give a new solution. Starting from any allowed point (g 3 ,g 4 ), this generates an allowed path (αg 3 , α 2g 4 ) where 0 ≤ α ≤ 1. This explains the parabolic shape of the \"underbellies\" in fig. 9. In fact the Spin-0 almond is simply the convex hull of the parabola connecting (0, 0) to (3, 1 2 ). (This is qualitatively similar to what is found in the forward limit [11,13].)\n\nThe Spin-J ≥ 2 region is more complicated -while it also displays a parabolic underbelly near the origin, it fails to extend all the way tog 4 = 1 2 . The boundary must thus exhibit non-analytic behaviour at the end of the parabola, however we were unable to local- Figure 9: The (g 3 ,g 4 ) allowed region, segmented into theories without spinless particles (J ≥ 2) and theories with only spinless particles (J = 0). The convex hull of these two regions reproduces fig. 8.\n-�� -� -� -� -� � � ��� ��� ��� ��� ��� ��� -�� -� -� -� -� � � ��� ��� ��� ��� ��� ��� �  � �  � � ⩾ � � = �\nize a kink that remains stable with varying the Mandelstam expansion order n, suggesting milder non-analyticity (such as a discontinuous second derivative). This qualitative feature is demonstrated by close-ups on the high-g 4 end of the allowed region are shown in fig. 10, which also indicates convergence with increasing n. The lineg 4 = 1 2 features two kinks: at (−10.19, 0.5) and (3, 0.5), as shown in figure 10. Below we will find analytic expressions for the scattering amplitude at these kinks! We chose the simplest and perhaps weakest method of calculating the exclusion region. Method of radials or normals have the potential more efficiently calculate these boundaries with higher fidelity near kinks [28]. For example, the normals maximization procedure explained extracts sharp features at regions of large curvature. Unfortunately, we were not able to use the normals method because it requires one to solve the \"primal\" problem instead.\n\n\n4.3\n\nThree-dimensional allowed volume in (g 3 ,g 4 ,g 5 ) Finally, we consider the space of EFT coefficients (g 3 ,g 4 ,g 5 ) using a similar procedure to the 2d process. Once the 2d exclusion region is obtained, points in (g 3 ,g 4 ) are sampled from the exclusion region and then the optimal upper and lower bounds ong 5 with the associated hyperplanes are computed via the constrained optimization approach. Figure 11 shows that the 3d region is narrow, suggesting that S-matrix positivity is a potent constraint on the EFT.   Finally, the exclusion plot converges as the truncation order n is increased as shown in figures 10. In particular, the n = 10 and n = 14 regions overlap better than the n = 4 and n = 10 regions. Despite doubling the number of functions n i (m 2 , J) in the null constraints N to sharpen bounds between n = 10 and n = 14, the numerics show that they generate very similar regions. Therefore, it is sufficient to consider n = 10 in order to infer general features.\n\n5 Analytically ruling-in: the two kinks withg 4 = 1 2 It is interesting to ask whether the bounds on (g 3 ,g 4 , . . .) obtained in the preceding section are indeed optimal. We obtained these bounds using the so-called dual problem, which \"rulesout\" more and more space as one adds null constraints. This contrasts with the primal problem, whereby the goal is to \"rule-in\" coefficients of 2 → 2 S-matrices satisfying all the axioms. When results from both problems agree, the optimal solution is apprehended with complete confidence.\n\nSystematic implementations of the primal problem have been proposed for generic field theories (without a large gap M ) [29,30]. Convergence of the dual and primal problems have also been studied for two-dimensional S-matrices [28,31]. We will not attempt to adapt these methods to our problem, but we will study simple special theories which can be ruled in analytically.\n\nThe (g 3 ,g 4 ) allowed region in fig. 8 prominently displays two kinks withg 4 = 1 2 (connected with a horizontal segment). This value is interesting, because the EFT parameter g 2 and g 4 satisfy the following sum rules:\ng 2 = 1 m 4 , g 4 = 1 2 1 m 8 ,(5.1)\nwhere · signifies a positive sum over states with m ≥ M and different spin, as previously defined. The coefficient g 4 = g 2 2M 4 can only be realized if the high-energy theory contains only states at the single mass m = M ! The corresponding amplitudes are therefore rational functions with poles at s, t or u = m 2 . Furthermore, they must satisfy the boundedness property lim s→0 M(s,t) s 2 = 0. It is easy to see that there are only two crossing-symmetric rational functions with these properties:\nM spin-0 = 1 m 2 − s + 1 m 2 − t + 1 m 2 − u , M stu-pole = m 4 (m 2 − s) (m 2 − t) (m 2 − u) − γ(d)M spin-0 . (5.2)\nHere, γ(d) is a coefficient that will ensure unitarity and positivity of the amplitude in ddimensional space-time. In particular, we have that\nγ(d) ≡ 4 9 2 F 1 1 2 , 1, d−1 2 , 1 9 . (5.3)\nTo show this, consider the spectral density of the first amplitude (its imaginary part) is supported entirely on spin-0. Following the decomposition used in fig. 9, we have then subtracted a constant multiple of M spin−0 to remove the spin-0 content from M stu-pole . To find the left kink, we should thus tune γ(d) to make the spectral density supported only on spins J ≥ 2.\n\nIn general, the Gegenbauer polynomials satisfy an orthogonality relation [16] that allows one to extract the coefficient:\nf J (s) = N d 2 1 −1 dz 1 − z 2 d−4 2 P J (z)M(s, t(z)),(5.4)\nwhere z = 1 + 2t\ns and N d = (16π) 2−d 2 Γ( d−2 2 )\nwe find\nρ J (s) stu-pole = 2πN d m d−4 δ(s − m 2 ) 1 −1 dz 1 − z 2 d−4 2 P J (z) 1 9 − z 2 − γ(d) 4 . (5.5)\nPlugging in P 0 (z) = 1 and computing the integral, we find that the spin-0 component vanishes provided we choose:\nγ(d) = 4 9 2 F 1 1 2 , 1, d−1 2 , 1 9 . (5.6)\nTo verify that the partial waves are positive for J ≥ 2, one can use the Froissart-Gribov formula (see eq. (2.53) of [16]) to analytically integrate (5.5) in terms of a single residue at z = ±3; the integral is proportional to the function defined as Q (d)\nJ (3)\nthere, which is a positive hypergeometric function for any d ≥ 3. We conclude that the amplitude M stu-pole , with the value (5.3), satisfies all the axioms of crossing symmetry, spin-2 Regge convergence, and positivity ρ J (s) ≥ 0! Of course, this does not imply that this amplitude can indeed be realized in some fully-fledged UV complete theory, only that it cannot be ruled out with our current methods.\n\nLet us now situate the amplitudes M spin-0 and M stu-pole in the context of our numerical exclusion plots. By series expanding at small s, t, u and comparing with the low-energy parameterization 2.6, it is straightforward to find that M spin-0 :\n\n(g 3 ,g 4 ,g 5 ) = 3 m 2 , 1 2m 4 , 5 2m 6 (5.7)\n\nM stu-pole : ). The fact that the amplitude M stu-pole realizes a negative coefficient for stu (i.e. g 3 < 0) suggests that it would be impossible to prove irreversibility of six-dimensional renormalization group flow using only crossing and positivity of 2 → 2 scattering [25]. This contrasts the successful four-dimensional case, in which the a-theorem was related to positivity of g 2 [32].  fig. 12. The parabolic \"underbellies\" are simply the dimensionally-rescaled theories at the kinks. This region is analytically \"ruled in\".\n(g 3 ,g 4 ,g 5 ) = 2 m 2 3γ(d) − 1 2γ(d) − 1 , 1 2m 4 , 1 m 6 5γ(d) − 2 2γ(d) − 1 ,(5.\nOne notices that a sliver obtained via numerics is not in the span of these simple analytic models. Since the upper-left arc of this sliver cannot be generated by the convex hull of (possibly rescaled) discrete theories, we attribute it to a continuous one-parameter family of \"extremal theories\" which terminate at the kink. It would be interesting to find an analytic expressions for this family.\n\nOne may wonder if this family of extremal theories terminates at a second kink; we did not locate any stable candidate in the numerics. This suggests that the family instead disappears inside its own convex hull. Naturally this would occur at the point where its slope becomes tangent to the parabola of dimensionally-rescaled theories originating from that point, dg 3 g 4 = g 3 2g 4 . In this scenario, only the second derivative of the boundary shape would be discontinuous, explaining the difficulty in locating it numerically.\n\nWe find it remarkable that two simple analytic models almost span the entire region obtained via numerics: to a good approximation (up to the missing sliver), a scalar EFT is compatible with causality and unitarity if it is a positive linear combination of the models in eq. (5.2).\n\n\nConcluding remarks\n\nIn this work we showed, in the case of a scalar field theory, that the space of low effective field theories is sharply constrained by positivity of the S-matrix. Dimensional analysis teaches us to expect a low-energy coupling of mass dimension n to be suppressed by a factor of 1/M n , where M is the mass of new heavy states. Our main finding is simple: in any causal and unitary theory, dimensional analysis scaling is a theorem.\n\nMore precisely, for a theory of a single identical real scalar, we showed that dimensionless ratios of the form g k /g 2 M # , where g 2 is the coefficient of 1 2 (∂φ) 4 , are bounded above and below by finite constants of order unity. Our method does not assume that physics above the scale M is weakly coupled, only that it is consistent with unitarity and causality. The technical assumption is the convergence of double-subtracted dispersion relations in 2 → 2 scattering. We then separately bounded g 2 itself in eq. (3.35).\n\nTo our (possibly incomplete) knowledge, this is the first time that two-sided bounds are obtained for interactions that vanish in the forward limit, such as the six-derivative \"stu\" contact interaction g 3 (see eqs. (2.3) and (4.2)). The key ingredient was to use \"null constraints\" (for example eq. (2.23)): integrals over the high-energy spectral density which must vanish by crossing symmetry, and which limit the contribution of higher-spin particles. A systematic procedure to extract optimal bounds was presented. The precise form of the null constraints are affected by low-energy self-interactions (i.e. loops within the low-energy EFT), whose effects would be interesting to investigate. It would be interesting to assess if bounds of this type are closely saturated in specific low-energy processes, for example pion scattering. In this case, a generalization to non-identical scalars might be necessary.\n\nIn this paper we ignored gravity. A graviton pole would cause the B 2 (t) sum rule to diverge in the forward limit, invalidating conclusions from a Taylor series around t = 0. However the X 2 (t) null constraints in eq. (A.3) should remain valid for t < 0 and their implications are worth investigating. Intuitively, one may anticipate that the graviton pole will somewhat weaken the bounds on scalar scattering [1,33,34] (see also [35]). However, following the general principle that self-consistent spinning S-matrices are harder to come by, interactions involving gravitons are likely to be sharply constrained by similar methods, possibly extending [8,36,37] or addressing conjectures of [38].\n\nFor non-gravitational scalar scattering, we found that crossing symmetry does not mix heavy spinning and spinless states. The allowed 2 → 2 low-energy S-matrices are positive sums of those two sectors. These are respectively (almost completely) spanned by the two simple analytic models in eq. (5.2), which realize theories at kinks. Perhaps this is a tantalizing hint that the collection of valid EFTs is not so vast after all. \n\n\nA A basis of crossing symmetry constraints\n\nIn this section we present a complete basis of vanishing heavy averages, which vanish in any theory with no branch cut below M 2 (i.e. when neglecting low-energy loops). They are organized as functions X k (t) where k is an even integer representing the number of subtractions.\n\nWe first give a pedestrian argument considering the unsubtracted case, X 0 , and then make a general argument exploiting crossing symmetry.\n\nAs a warm-up, let us first consider a \"superbounded\" theory where lim s→∞ M(s, t) → 0 for t < 0, so that unsubtracted dispersion relations converge, and where the low-energy amplitude is polynomial, corresponding to g = 0 in (2.3). In the superbounded case the first sum rule is B 0 from eq. (2.18):\nB 0 : g 0 + 2g 2 t 2 + 2g 4 t 4 + . . . = 2m 2 + t m 2 + t P 1 + 2t m 2 (A.1)\nwhere we relabelled the constant term in the amplitude as g 0 = −λ. Viewed as a function of t this sum rule is marginally useful because it involves infinitely many unknowns on the left-hand-side and one loses control when −t becomes of order M 2 . However, each g k with k ≥ 2 can be computed by some other sum rule: for example, the t → 0 limit of B 2 measures g 2 , B 4 (0) measures g 4 , etc. Dividing by an overall t for future convenience, we can package these into an infinite set of null constraints:\n0 = 2m 2 + t t(m 2 + t) P J 1 + 2t m 2 − ∞ k=0 B high k (0)t 2k−1 = X 0 (t; m 2 , j) where X 0 (t; m 2 , J) ≡ (2m 2 + t)P J 1 + 2t m 2 t(m 2 + t) − 2m 4 P J (1) t(m 4 − t 2 ) . (A.2)\nX 0 (t) defines a sensible sum rule for any 0 < −t < M 2 , and Taylor-expanding around t = 0 gives an infinite number of averages which vanish by crossing symmetry (if unsubtracted sum rules converge).\n\nRepeating the same manipulations for subtracted sum rules, we find that to cancel the cancel the generic power of t in B 2 (t) one must also both the B k (0) and its first derivative around t = 0; there is then a unique solution: X 2 (t; m 2 , J) = 0 where X 2 (t; m 2 , J) = (2m 2 + t) P J 1 + 2t m 2 − P J (1) m 2 t 2 (m 2 + t) 2 − 4P J (1) tm 2 (m 4 − t 2 )\n\n.\n(A.3)\nFor any 0 < −t < M 2 , this enjoys the high-energy convergence as a double-subtracted dispersion relation, whence the subscript. Setting t = 0 this reproduces the n 4 sum rule in eq. (3.29). Finally, we record explicitly the four-subtracted version obtained with the same method: X 4 (t; m 2 , J) = (2m 2 + t) P J 1 + 2t m 2 − P J (1) m 4 t 3 (m 2 + t) 3 − 2(2m 4 − 3t(m 2 + t))P J (1)\nm 8 t 2 (m 2 − t)(m 2 + t) 2 − 4P J (1) m 8 t(m 4 − t 2 )\n.\n\n(A.4)\n\n\nA.1 Derivation using dispersion relations in three channels\n\nLet us now present the general case along with a direct derivation. The idea is to combine dispersion relations in all three channels. Consider the following identity:\nX k (t ) : 0 = Cs + Ct + Cu ds ∧ dt (2πi) 2 st(t − t ) M(s, t) [st(s + t)] k/2 , (A.5)\nwhere each contour is a product of circles: C s = Circle s∼0 ∧ Circle t→∞ , C t = Circle t∼0,t ∧ Circle u→∞ and C u = Circle u∼0 ∧ Circle s→∞ . The first contour implements a fixed-s sum rule, which we then evaluate at s → 0, and similar for the others, but note that the fixed-t relation is evaluated at both t = 0 and t = t . All the integrals vanish (for k ≥ 2) due to the vanishing at large-t of M(s, t)/t 2 . (The contours around 0 are a bit dangerous, since the integrals around say large-t converges only when s < 0; this should not be a problem since (ignoring EFT loops) one can interpret the residue as extracting the coefficient of 1/s in the Laurent expansion as s → 0 − .) The trick is then to deform the arcs at infinity to pick high-energy cuts and low-energy poles, as in fig 3 of the main text. What is nice with the above contour is that all double-residues cancel because of antisymmetry of the contours. For the double residue at (s, t) = (0, t ) the cancellation simply follows from mismatching orientations, since the contours C s and C t compute the same double-residue in opposite orders: 0 = Circle s∼0 ∧ Circle t∼t + Circle t∼t ∧ Circle s∼0 .\n\n(A.6)\n\nAlternatively, in practice, one may think of the integral 1 2πi Circle s∼0 as just a residue, defined by plucking ds s ∧ from the left of the differential form it multiplies, and the integral vanishes because the thus-defined residue operation is antisymmetric. The nested poles at (s, t) = (0, 0) require more care (one has to perform a blow-up) since all three contours contribute, but one still finds a perfect cancellation, as one may verify explicitly: for any polynomial numerator. This is curiously reminiscent of the Jacobi identity. The upshot is that the integral (A.5) is orthogonal to any tree-level low-energy EFT amplitude (whether or not it is s-t-u symmetric), it gives purely a constraint on high-energy cuts. Similar constraints would follow for any choice of (rational) denominator. Each term in eq. (A.5) contributes cuts in two channels, for example the C s term contributes Res s=0 1 m 2 (t − m 2 ) + 1 (m 2 + s)(m 2 + s + t ) m 2 P J 1 + 2s m 2 s(sm 2 (m 2 + s)) k/2 (A. 8) where the two terms in the parenthesis come from the t and u-channel heavy cuts, respectively. If we did not assume s−t−u symmetry, we would get a relation between the three spectral densities. Here we record only the simplified result assuming that all the spectral densities are the same: 0 = X k (t; m 2 , J) where X k (t; m 2 , J) = 2m 2 + t t(m 2 + t) P J 1 + 2t Expanding at small t, the X k (t) sum rules admit regular Taylor series, which reproduce precisely the sum rules recorded in eq. (3.29). Namely, the coefficient of t n in X k has degree 3k 2 + n + 1 in 1/m 2 , so the first case is X 2 (0) ∼ g 4 . The first time one gets two X sum rules is at weight 7, where X 2 (0) and X 4 (0) span g 7 and g 7 . The number of X sum rules per degree increases every 3 degree because of the 1/(stu) k/2 factor in eq. (A.5). The number of X sum rules thus agrees precisely with the counting below eq. (3.29). We conclude that the X k (t) sum rules are a complete basis of sum rules orthogonal to tree-level EFTs! As mentioned below eq. (3.30), when EFT loops are included these sum rules may average to nonzero but computable quantities. -0.524 1.125 g 9 -13.60 3 g 10 0 0.0625 g 10 -6.32 3.75 k refers to the coefficient of (s 2 + t 2 + u 2 ) k−3(2p+δ k,odd ) 2 (stu) 2p+δ k,odd , which has degree k in Mandelstam invariants and contains 2p powers of stu more than the minimum at that degree. The upper bounds are all simple rational numbers realized by the M spin-0 model. The values (except forg 3 ) were calculated at order n = 10, which corresponds to the number of null constraints of dim N = 12.\n\n\nB Bounds on operators up to order s 10\n\nIn table 3 we record numerical bounds on various EFT coefficients in four spacetime dimensions.\n\nB\nad hoc upper bound on (∂φ) 4 18 4 Numerically ruling-out: The allowed space of scalar EFTs 20 4.1 Bounds on individual coefficients 20 4.2 Two-dimensional allowed region in (g 3 ,g 4 ) plane 22 4.3 Three-dimensional allowed volume in (g 3 ,g 4 ,g 5 ) 245 Analytically ruling-in: the two kinks withg 4 Bounds on operators up to order s 10 33\n\nFigure 1 :\n1The 2 → 2 scattering process studied in this paper. For different choices of four-momenta, time can flow either horizontally or vertically (or diagonally).\n\nFigure 5 :\n5The null constraint m 8 n 4 (m 2 , J), which is a function of only J. It vanishes at J = 0, is negative at J = 2, but positive at J = 4, 6, . . . , and thus balances spin-two against higher-spin states. The sign change in various space-time dimensions (at J critical = 1 2\n\n\ntake on the same form as original identities when a =\n\nFigure 6 :\n6The non-negative function F (m 2 , J) returned by SDPB when maximizing the lower bound forg 3 . The spin 4 curve is particularly enlightening because it features a double root.In d = 4, this gives α * 10.61249 . . . precisely as found numerically! This result showcases the use of numerics to guide our analytical understanding. Moreover, the preceding formula can be shown to give the correct optimal lower bound ong 3 in any d ≥ 3, when including the single null constraint n 4 . (When we add more equations below, the d = 4 bound will converge tog 3 ≥ −10.346.)\n\n\nset of null functions n i (m 2 , J) whose heavy averages vanish: 0 = n 4 (m 2 , J) = n 5 (m 2 , J) = n 6 (m 2 , J) = . . .(3.14)First consider the problem of lower-bounding g 3 , given g 2 , but being agnostic about the other g k 's with k ≥ 4. Define a vector of functions which combines g 2 , g 3 and null constraints:v(m 2 , J) ≡ g 2 (m 2 , J), M 2 g 3 (m 2 , J), n 4 (m 2 , J), n 5 (m 2 , J), . . . . (3.15) The following (\"dual\") optimization problem then determines a lower bound on g 3 : maximize: A subject to: 0 ≤ −A, 1, c 4 , c 5 , . . . · v(m 2 , J) ∀ m ≥ M, ∀J = 0, 2, 4, . . . (3.16)Here we are maximizing over A and all possible linear combinations c i of the null constraints n i (m 2 , J). Having found such a linear combination c i and an optimal number A, it readily follows from linearity and positivity of · that 0 ≤ −Ag 2 + M 2 g 3 + 0,(3.17)    \n\n\nmotivates the maximization of A. Alternatively, to find an optimal upper bound B, it is enough to consider the analogous problem: minimize: B subject to: 0 ≤ B, −1, c 4 , c 5 , . . . · v(m 2 , J) ∀ m ≥ M, ∀J = 0, 2, 4, . . . (3.19)\n\n\nallowed range, and for each value we determine lower and upper bounds ong 4 . The vector v in eq. (3.15) then acquires an extra g 4 row: v → g 2 , M 2 g 3 , M 4 g 4 , n 4 , n 5 , . . . . (3.21) Imposing positivity of −A, −B, 1, c 4 , c 5 , . . . · v(m, J) for all m and J yields a lower bound\n\n\n(3.10) for this truncation). The polynomial vector v combines the three observed coefficients and a single null constraint n 4 , rescaled by appropriate powers of M : v(x, J) ≡ M 4 (1 + x) 4 × g 2 , M 2 g 3 , M 4 g 4 , M 4 n 4 (3.23) = (1 + x) 2 , (1 + x)(3 − 2J(J + 1)), 1 2 , 2J(J + 1)(J(J + 1) − 8) . (3.24)\n\n\n(3.35): namely, eq. (3.31) with the quoted α * . This observable resides at the scale M in the sense of eq. (3.30).Similar bounds in different spacetime dimensions are recorded in table 1; after normalizing with a suitable d-dimension factor (closely related to n (d) 0 ) we find that the obtained bound is pretty stable in dimensions.\n\nFigure 7 :\n7and lower bounds were obtained by solving the optimization problems given in equations(3.16)  and(3.19), respectively. For the n = 16 data points in the table, we kept spins up to 200 (in addition to J = ∞). A full list of the bounds on the first 10 coefficients Theg 3 lower bound vs. 1/dim N , where dim N is the dimension of the number of null constraints accessed. Plotting with respect to 1/(dim N ) 2 or different powers of 1/n did not reveal any particularly compelling fitting function. The kink described in the next plot is situated at −10.19 ≈g 3 .\n\nFigure 8 :\n8The (g 3 ,g 4 ) allowed region. Numerics were performed at n = 10 Mandelstam order and J = 0, 2, . . . , 40. One can see that g 3 may take-on negative values, while g 4 is positive. Boundaries appear smooth except for two kinks at (−10.19, 0.5) and (3, 0.5).\n\n\nClose-up near the left kink at (−10.19, 0.5).\n\nFigure 10 :\n10Convergence of the (g 3 ,g 4 ) allowed region (shaded) with the Mandelstam degree n of crossing equations. The positive section of the horizontal axis is omitted since that region converges immediately.(a) General shape of the volume.(b) View of the narrow ridge alongg 4 = 1 2 .\n\nFigure 11 :\n11g 3 vs.g 4 vs.g 5 \"tortilla chip\". Numerics were performed at n = 10 Mandelstam order and J = 0, 2, . . . , 40. The volume is surprisingly narrow, showing a strongg 3 -g 5 correlation.\n\n\nm M . Atm = 1 and d = 4, the spin-0 model produces the upper-right kink at (3, 1 2 ), whereas the stu-pole model gives (g 3 ,g 4 ) = (6 2 log 2−1 4 log 2−3 , 1 2 ) ≈ (−10.19196, 0.5) which precisely matches with the numerical value in fig. 10! We also found agreement with the numerical position of the kink in d = 6 and d = 10. As d → ∞, the kink converges to (−6, − 1 2\n\nFigure 12 :\n12Remaining allowed sliver compared with the positive span of the two analytical models: M stu-pole and M spin-0 , which lie at the left and right upper kinks, respectively. The convex hull of the space of the two amplitudes M spin-0 and M stu-pole , for different values of the mass m, generates the region with parabolic boundaries shown in\n\n\n2 + s)(m 2 − s)(m 2 + 2s) s(t − s)(m 2 + s)(m 2 − t)(m 2 + s + t)the main result of this appendix. For any even k ≥ 2 and −M 2 < t < 0 we expect these to be physical sum rules (i.e. convergent in theories where double-subtracted dispersion relations converge) orthogonal to any tree-level low-energy amplitude. For k = 0, 2, 4 this reproduces the formulas quoted in eqs. (A.2)-(A.4).\n\nTable 2\n2shows how these bounds depend on the number of crossing \nsymmetry constraints kept. We conclude that, in d = 3 + 1 space-time, normalized EFT \ncoefficients satisfy: \n\n−10.346 ≤g 3 ≤ 3, \n0 ≤g 4 ≤ \n1 \n2 \n, \n−4.0960 ≤g 5 ≤ \n5 \n2 \n. \n(4.2) \n\n\n\nby the National Science and Engineering Council of Canada. Work of SCH is supported by the National Science and Engineering Council of Canada, the Canada Research Chair program, the Fonds de Recherche du Québec -Nature et Technologies, and the Simons Collaboration on the Nonperturbative Bootstrap.\n\n\nEFT coefficient Lower bound Upper boundg 3 \n-10.346 \n3 \ng 4 \n0 \n0.5 \ng 5 \n-4.096 \n2.5 \ng 6 \n0 \n0.25 \ng 6 \n-12.83 \n3 \ng 7 \n-1.548 \n1.75 \ng 8 \n0 \n0.125 \ng 8 \n-10.03 \n4 \ng 9 \n\n\nTable 3 :\n3Bounds on coefficientsg(p) \n\nk = g \n\n(p) \n\nk M 2k−4 /g 2 for d = 4 spacetime dimension, where \ng \n\n(p) \n\n\n, a collection of planes is rapidly generated from which it is possible to carve out the convex allowed space.\nAcknowledgmentsWe thank Dalimil Mazàč, Leonardo Rastelli, David Simmons-Duffin and Anh-Khoi Trinh for useful conversations and Clément Virally for technical assistance. Work of VVD is supported\nCausality, analyticity and an IR obstruction to UV completion. A Adams, N Arkani-Hamed, S Dubovsky, A Nicolis, R Rattazzi, 10.1088/1126-6708/2006/10/014hep-th/0602178JHEP. 1014A. Adams, N. Arkani-Hamed, S. Dubovsky, A. Nicolis and R. Rattazzi, Causality, analyticity and an IR obstruction to UV completion, JHEP 10 (2006) 014 [hep-th/0602178].\n\nA Martin, 10.1007/BFb0101043Scattering Theory: Unitarity, Analyticity and Crossing. 3A. Martin, Scattering Theory: Unitarity, Analyticity and Crossing, vol. 3 (1969), 10.1007/BFb0101043.\n\nExact integral equation for pion pion scattering involving only physical region partial waves. S M Roy, 10.1016/0370-2693(71)90724-6Phys. Lett. B. 36353S.M. Roy, Exact integral equation for pion pion scattering involving only physical region partial waves, Phys. Lett. B 36 (1971) 353.\n\n. G Colangelo, J Gasser, H Leutwyler, 10.1016/S0550-3213(01)00147-Xhep-ph/0103088Nucl. Phys. B. 603125G. Colangelo, J. Gasser and H. Leutwyler, ππ scattering, Nucl. Phys. B 603 (2001) 125 [hep-ph/0103088].\n\nOn the precision of the theoretical predictions for pi pi scattering. I Caprini, G Colangelo, J Gasser, H Leutwyler, 10.1103/PhysRevD.68.074006hep-ph/0306122Phys. Rev. D. 6874006I. Caprini, G. Colangelo, J. Gasser and H. Leutwyler, On the precision of the theoretical predictions for pi pi scattering, Phys. Rev. D 68 (2003) 074006 [hep-ph/0306122].\n\nEvaluation of the Derivative Quartic Terms of the Meson Chiral Lagrangian From Forward Dispersion Relation. T N Pham, T N Truong, 10.1103/PhysRevD.31.3027Phys. Rev. D. 313027T.N. Pham and T.N. Truong, Evaluation of the Derivative Quartic Terms of the Meson Chiral Lagrangian From Forward Dispersion Relation, Phys. Rev. D 31 (1985) 3027.\n\nConsistency of the chiral pion pion scattering amplitudes with axiomatic constraints. B Ananthanarayan, D Toublan, G Wanders, 10.1103/PhysRevD.51.1093hep-ph/9410302Phys. Rev. D. 511093B. Ananthanarayan, D. Toublan and G. Wanders, Consistency of the chiral pion pion scattering amplitudes with axiomatic constraints, Phys. Rev. D 51 (1995) 1093 [hep-ph/9410302].\n\nCausality Constraints on Corrections to the Graviton Three-Point Coupling. X O Camanho, J D Edelstein, J Maldacena, A Zhiboedov, 10.1007/JHEP02(2016)0201407.5597JHEP. 0220X.O. Camanho, J.D. Edelstein, J. Maldacena and A. Zhiboedov, Causality Constraints on Corrections to the Graviton Three-Point Coupling, JHEP 02 (2016) 020 [1407.5597].\n\nEinstein gravity 3-point functions from conformal field theory. N Afkhami-Jeddi, T Hartman, S Kundu, A Tajdini, 10.1007/JHEP12(2017)0491610.09378JHEP. 1249N. Afkhami-Jeddi, T. Hartman, S. Kundu and A. Tajdini, Einstein gravity 3-point functions from conformal field theory, JHEP 12 (2017) 049 [1610.09378].\n\n. C Cheung, G N Remmen, 10.1007/JHEP04(2016)0021601.04068Positive Signs in Massive Gravity. 042JHEPC. Cheung and G.N. Remmen, Positive Signs in Massive Gravity, JHEP 04 (2016) 002 [1601.04068].\n\nN Arkani-Hamed, Y.-T Huang, Positive geometry of effective field theory, lectures at the CERN winter school on supergravity, strings and gauge theory. New positivity bounds from the EFT hedron, talk at the 24th rencontres Itzykson of the IPHT of CEA-SaclayN. Arkani-Hamed and Y.-T. Huang, Positive geometry of effective field theory, lectures at the CERN winter school on supergravity, strings and gauge theory (2019); New positivity bounds from the EFT hedron, talk at the 24th rencontres Itzykson of the IPHT of CEA-Saclay (2019).\n\nPositivity bounds for scalar field theories. C De Rham, S Melville, A J Tolley, S.-Y Zhou, 10.1103/PhysRevD.96.0817021702.06134Phys. Rev. D. 9681702C. de Rham, S. Melville, A.J. Tolley and S.-Y. Zhou, Positivity bounds for scalar field theories, Phys. Rev. D 96 (2017) 081702 [1702.06134].\n\nB Bellazzini, J Elias Miró, R Rattazzi, M Riembau, F Riva, Positive Moments for Scattering Amplitudes. 37B. Bellazzini, J. Elias Miró, R. Rattazzi, M. Riembau and F. Riva, Positive Moments for Scattering Amplitudes, 2011.00037.\n\nA J Tolley, Z.-Y Wang, S.-Y Zhou, New positivity bounds from full crossing symmetry. A.J. Tolley, Z.-Y. Wang and S.-Y. Zhou, New positivity bounds from full crossing symmetry, 2011.02400.\n\nThe Standard Model as an Effective Field Theory. I Brivio, M Trott, 10.1016/j.physrep.2018.11.0021706.08945Phys. Rept. 7931I. Brivio and M. Trott, The Standard Model as an Effective Field Theory, Phys. Rept. 793 (2019) 1 [1706.08945].\n\nAn Analytical Toolkit for the S-matrix Bootstrap. M Correia, A Sever, A Zhiboedov, 8221M. Correia, A. Sever and A. Zhiboedov, An Analytical Toolkit for the S-matrix Bootstrap, 2006.08221.\n\nUse of causality conditions in quantum theory. M Gell-Mann, M Goldberger, W E Thirring, 10.1103/PhysRev.95.1612Phys. Rev. 951612M. Gell-Mann, M. Goldberger and W.E. Thirring, Use of causality conditions in quantum theory, Phys. Rev. 95 (1954) 1612.\n\nA proof of the crossing property for two-particle amplitudes in general quantum field theory. J Bros, H Epstein, V Glaser, 10.1007/BF01646307Commun. Math. Phys. 1240J. Bros, H. Epstein and V. Glaser, A proof of the crossing property for two-particle amplitudes in general quantum field theory, Commun. Math. Phys. 1 (1965) 240.\n\n. S Caron-Huot, Lorentzian and Analytic Bootstrap Lecture. 3Bootstrap SchoolS. Caron-Huot, Lorentzian and Analytic Bootstrap Lecture 3, 2020 Bootstrap School (2020) .\n\nNumber of Subtractions in Fixed-Transfer Dispersion Relations. Y Jin, A Martin, 10.1103/PhysRev.135.B1375Phys. Rev. 1351375Y. Jin and A. Martin, Number of Subtractions in Fixed-Transfer Dispersion Relations, Phys. Rev. 135 (1964) B1375.\n\nExtension of the axiomatic analyticity domain of scattering amplitudes by unitarity. 1. A Martin, 10.1007/BF02720568Nuovo Cim. A. 42930A. Martin, Extension of the axiomatic analyticity domain of scattering amplitudes by unitarity. 1., Nuovo Cim. A 42 (1965) 930.\n\nThe analytic S-matrix. R J Eden, P V Landshoff, D I Olive, J C Polkinghorne, Cambridge Univ. PressCambridgeR.J. Eden, P.V. Landshoff, D.I. Olive and J.C. Polkinghorne, The analytic S-matrix, Cambridge Univ. Press, Cambridge (1966).\n\nS Caron-Huot, D Mazac, L Rastelli, D Simmons-Duffin, Dispersive CFT Sum Rules. 4931S. Caron-Huot, D. Mazac, L. Rastelli and D. Simmons-Duffin, Dispersive CFT Sum Rules, 2008.04931.\n\nNonperturbative Mellin Amplitudes: Existence, Properties, Applications. J Penedones, J A Silva, A Zhiboedov, 10.1007/JHEP08(2020)0311912.11100JHEP. 0831J. Penedones, J.A. Silva and A. Zhiboedov, Nonperturbative Mellin Amplitudes: Existence, Properties, Applications, JHEP 08 (2020) 031 [1912.11100].\n\nOn renormalization group flows and the a-theorem in 6d. H Elvang, D Z Freedman, L.-Y Hung, M Kiermaier, R C Myers, S Theisen, 10.1007/JHEP10(2012)011JHEP. 10111205.3994H. Elvang, D.Z. Freedman, L.-Y. Hung, M. Kiermaier, R.C. Myers and S. Theisen, On renormalization group flows and the a-theorem in 6d, JHEP 10 (2012) 011 [1205.3994].\n\nA Semidefinite Program Solver for the Conformal Bootstrap. D Simmons-Duffin, 10.1007/JHEP06(2015)1741502.02033JHEP. 06174D. Simmons-Duffin, A Semidefinite Program Solver for the Conformal Bootstrap, JHEP 06 (2015) 174 [1502.02033].\n\nCarving out OPE space and precise O(2) model critical exponents. S M Chester, W Landry, J Liu, D Poland, D Simmons-Duffin, N Su, 10.1007/JHEP06(2020)142JHEP. 061421912.03324S.M. Chester, W. Landry, J. Liu, D. Poland, D. Simmons-Duffin, N. Su et al., Carving out OPE space and precise O(2) model critical exponents, JHEP 06 (2020) 142 [1912.03324].\n\nThe O(N) S-matrix Monolith. L Cordova, Y He, M Kruczenski, P Vieira, 10.1007/JHEP04(2020)1421909.06495JHEP. 04142L. Cordova, Y. He, M. Kruczenski and P. Vieira, The O(N) S-matrix Monolith, JHEP 04 (2020) 142 [1909.06495].\n\nThe S-matrix bootstrap. Part III: higher dimensional amplitudes. M F Paulos, J Penedones, J Toledo, B C Van Rees, P Vieira, 10.1007/JHEP12(2019)0401708.06765JHEP. 1240M.F. Paulos, J. Penedones, J. Toledo, B.C. van Rees and P. Vieira, The S-matrix bootstrap. Part III: higher dimensional amplitudes, JHEP 12 (2019) 040 [1708.06765].\n\nBootstrapping QCD Using Pion Scattering Amplitudes. A L Guerrieri, J Penedones, P Vieira, 10.1103/PhysRevLett.122.241604Phys. Rev. Lett. 1222416041810.12849A.L. Guerrieri, J. Penedones and P. Vieira, Bootstrapping QCD Using Pion Scattering Amplitudes, Phys. Rev. Lett. 122 (2019) 241604 [1810.12849].\n\nA L Guerrieri, A Homrich, P Vieira, Dual S-matrix Bootstrap I: 2D Theory. A.L. Guerrieri, A. Homrich and P. Vieira, Dual S-matrix Bootstrap I: 2D Theory, 2008.02770.\n\nOn Renormalization Group Flows in Four Dimensions. Z Komargodski, A Schwimmer, 10.1007/JHEP12(2011)0991107.3987JHEP. 1299Z. Komargodski and A. Schwimmer, On Renormalization Group Flows in Four Dimensions, JHEP 12 (2011) 099 [1107.3987].\n\nGravitational positivity bounds. J Tokuda, K Aoki, S Hirano, J. Tokuda, K. Aoki and S. Hirano, Gravitational positivity bounds, 2007.15009.\n\nPositivity Bounds and the Massless Spin-2 Pole. L Alberte, C De Rham, S Jaitly, A J Tolley, L. Alberte, C. de Rham, S. Jaitly and A.J. Tolley, Positivity Bounds and the Massless Spin-2 Pole, 2007.12667.\n\nPositivity of Amplitudes, Weak Gravity Conjecture, and Modified Gravity. B Bellazzini, M Lewandowski, J Serra, 10.1103/PhysRevLett.123.2511031902.03250Phys. Rev. Lett. 123251103B. Bellazzini, M. Lewandowski and J. Serra, Positivity of Amplitudes, Weak Gravity Conjecture, and Modified Gravity, Phys. Rev. Lett. 123 (2019) 251103 [1902.03250].\n\nWeak Gravity Conjecture from Unitarity and Causality. Y Hamada, T Noumi, G Shiu, 10.1103/PhysRevLett.123.0516011810.03637Phys. Rev. Lett. 12351601Y. Hamada, T. Noumi and G. Shiu, Weak Gravity Conjecture from Unitarity and Causality, Phys. Rev. Lett. 123 (2019) 051601 [1810.03637].\n\nPositivity Bounds for Massive Spin-1 and Spin-2 Fields. C De Rham, S Melville, A J Tolley, S.-Y Zhou, 10.1007/JHEP03(2019)182JHEP. 031821804.10624C. de Rham, S. Melville, A.J. Tolley and S.-Y. Zhou, Positivity Bounds for Massive Spin-1 and Spin-2 Fields, JHEP 03 (2019) 182 [1804.10624].\n\nClassifying and constraining local four photon and four graviton S-matrices. S D Chowdhury, A Gadde, T Gopalka, I Halder, L Janagal, S Minwalla, 10.1007/JHEP02(2020)114JHEP. 021141910.14392S.D. Chowdhury, A. Gadde, T. Gopalka, I. Halder, L. Janagal and S. Minwalla, Classifying and constraining local four photon and four graviton S-matrices, JHEP 02 (2020) 114 [1910.14392].\n", "annotations": {"author": "[{\"end\":155,\"start\":80},{\"end\":232,\"start\":156}]", "publisher": null, "author_last_name": "[{\"end\":96,\"start\":86},{\"end\":173,\"start\":168}]", "author_first_name": "[{\"end\":85,\"start\":80},{\"end\":163,\"start\":156},{\"end\":167,\"start\":164}]", "author_affiliation": "[{\"end\":154,\"start\":98},{\"end\":231,\"start\":175}]", "title": "[{\"end\":66,\"start\":1},{\"end\":298,\"start\":233}]", "venue": null, "abstract": "[{\"end\":1207,\"start\":311}]", "bib_ref": "[{\"attributes\":{\"ref_id\":\"b0\"},\"end\":1787,\"start\":1784},{\"end\":2239,\"start\":2234},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":3699,\"start\":3696},{\"attributes\":{\"ref_id\":\"b2\"},\"end\":3824,\"start\":3821},{\"attributes\":{\"ref_id\":\"b3\"},\"end\":3827,\"start\":3824},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":3830,\"start\":3827},{\"attributes\":{\"ref_id\":\"b5\"},\"end\":3936,\"start\":3933},{\"attributes\":{\"ref_id\":\"b6\"},\"end\":3938,\"start\":3936},{\"end\":4695,\"start\":4694},{\"attributes\":{\"ref_id\":\"b7\"},\"end\":5087,\"start\":5084},{\"attributes\":{\"ref_id\":\"b8\"},\"end\":5090,\"start\":5087},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":5094,\"start\":5090},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":5098,\"start\":5094},{\"attributes\":{\"ref_id\":\"b11\"},\"end\":5102,\"start\":5098},{\"attributes\":{\"ref_id\":\"b12\"},\"end\":5914,\"start\":5910},{\"attributes\":{\"ref_id\":\"b13\"},\"end\":5928,\"start\":5924},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":8491,\"start\":8487},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":9587,\"start\":9584},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":10134,\"start\":10130},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":10636,\"start\":10632},{\"attributes\":{\"ref_id\":\"b7\"},\"end\":11879,\"start\":11876},{\"attributes\":{\"ref_id\":\"b16\"},\"end\":12319,\"start\":12315},{\"attributes\":{\"ref_id\":\"b17\"},\"end\":12943,\"start\":12939},{\"attributes\":{\"ref_id\":\"b18\"},\"end\":13179,\"start\":13175},{\"attributes\":{\"ref_id\":\"b19\"},\"end\":13319,\"start\":13315},{\"attributes\":{\"ref_id\":\"b20\"},\"end\":13322,\"start\":13319},{\"attributes\":{\"ref_id\":\"b21\"},\"end\":14115,\"start\":14111},{\"attributes\":{\"ref_id\":\"b0\"},\"end\":17765,\"start\":17764},{\"attributes\":{\"ref_id\":\"b0\"},\"end\":17874,\"start\":17873},{\"attributes\":{\"ref_id\":\"b22\"},\"end\":18397,\"start\":18393},{\"attributes\":{\"ref_id\":\"b23\"},\"end\":18412,\"start\":18408},{\"attributes\":{\"ref_id\":\"b24\"},\"end\":21555,\"start\":21551},{\"attributes\":{\"ref_id\":\"b25\"},\"end\":24096,\"start\":24092},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":25844,\"start\":25840},{\"end\":27711,\"start\":27706},{\"end\":31181,\"start\":31178},{\"attributes\":{\"ref_id\":\"b26\"},\"end\":31537,\"start\":31533},{\"attributes\":{\"ref_id\":\"b25\"},\"end\":31680,\"start\":31676},{\"end\":33121,\"start\":33115},{\"attributes\":{\"ref_id\":\"b3\"},\"end\":38522,\"start\":38521},{\"end\":42374,\"start\":42368},{\"end\":43897,\"start\":43894},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":43974,\"start\":43970},{\"attributes\":{\"ref_id\":\"b12\"},\"end\":43977,\"start\":43974},{\"attributes\":{\"ref_id\":\"b27\"},\"end\":45285,\"start\":45281},{\"attributes\":{\"ref_id\":\"b28\"},\"end\":47177,\"start\":47173},{\"attributes\":{\"ref_id\":\"b29\"},\"end\":47180,\"start\":47177},{\"attributes\":{\"ref_id\":\"b27\"},\"end\":47284,\"start\":47280},{\"attributes\":{\"ref_id\":\"b30\"},\"end\":47287,\"start\":47284},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":48949,\"start\":48945},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":49498,\"start\":49494},{\"attributes\":{\"ref_id\":\"b24\"},\"end\":50623,\"start\":50619},{\"attributes\":{\"ref_id\":\"b31\"},\"end\":50738,\"start\":50734},{\"attributes\":{\"ref_id\":\"b0\"},\"end\":54500,\"start\":54497},{\"attributes\":{\"ref_id\":\"b32\"},\"end\":54503,\"start\":54500},{\"attributes\":{\"ref_id\":\"b33\"},\"end\":54506,\"start\":54503},{\"attributes\":{\"ref_id\":\"b34\"},\"end\":54521,\"start\":54517},{\"attributes\":{\"ref_id\":\"b7\"},\"end\":54741,\"start\":54738},{\"attributes\":{\"ref_id\":\"b35\"},\"end\":54744,\"start\":54741},{\"attributes\":{\"ref_id\":\"b36\"},\"end\":54747,\"start\":54744},{\"attributes\":{\"ref_id\":\"b37\"},\"end\":54781,\"start\":54777},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":57284,\"start\":57283},{\"end\":57512,\"start\":57506},{\"attributes\":{\"ref_id\":\"b2\"},\"end\":57677,\"start\":57676},{\"attributes\":{\"ref_id\":\"b7\"},\"end\":60267,\"start\":60265},{\"end\":60771,\"start\":60765}]", "figure": "[{\"attributes\":{\"id\":\"fig_0\"},\"end\":62353,\"start\":62010},{\"attributes\":{\"id\":\"fig_1\"},\"end\":62522,\"start\":62354},{\"attributes\":{\"id\":\"fig_2\"},\"end\":62808,\"start\":62523},{\"attributes\":{\"id\":\"fig_3\"},\"end\":62864,\"start\":62809},{\"attributes\":{\"id\":\"fig_5\"},\"end\":63442,\"start\":62865},{\"attributes\":{\"id\":\"fig_6\"},\"end\":64312,\"start\":63443},{\"attributes\":{\"id\":\"fig_7\"},\"end\":64546,\"start\":64313},{\"attributes\":{\"id\":\"fig_8\"},\"end\":64841,\"start\":64547},{\"attributes\":{\"id\":\"fig_9\"},\"end\":65154,\"start\":64842},{\"attributes\":{\"id\":\"fig_11\"},\"end\":65492,\"start\":65155},{\"attributes\":{\"id\":\"fig_12\"},\"end\":66065,\"start\":65493},{\"attributes\":{\"id\":\"fig_13\"},\"end\":66337,\"start\":66066},{\"attributes\":{\"id\":\"fig_14\"},\"end\":66385,\"start\":66338},{\"attributes\":{\"id\":\"fig_15\"},\"end\":66680,\"start\":66386},{\"attributes\":{\"id\":\"fig_16\"},\"end\":66880,\"start\":66681},{\"attributes\":{\"id\":\"fig_17\"},\"end\":67254,\"start\":66881},{\"attributes\":{\"id\":\"fig_18\"},\"end\":67610,\"start\":67255},{\"attributes\":{\"id\":\"fig_20\"},\"end\":67996,\"start\":67611},{\"attributes\":{\"id\":\"tab_0\",\"type\":\"table\"},\"end\":68244,\"start\":67997},{\"attributes\":{\"id\":\"tab_1\",\"type\":\"table\"},\"end\":68545,\"start\":68245},{\"attributes\":{\"id\":\"tab_2\",\"type\":\"table\"},\"end\":68720,\"start\":68546},{\"attributes\":{\"id\":\"tab_3\",\"type\":\"table\"},\"end\":68838,\"start\":68721}]", "paragraph": "[{\"end\":2197,\"start\":1223},{\"end\":2885,\"start\":2212},{\"end\":2909,\"start\":2904},{\"end\":3523,\"start\":2911},{\"end\":4012,\"start\":3525},{\"end\":4968,\"start\":4014},{\"end\":5186,\"start\":4970},{\"end\":5844,\"start\":5188},{\"end\":6125,\"start\":5846},{\"end\":6423,\"start\":6127},{\"end\":6668,\"start\":6494},{\"end\":7196,\"start\":6711},{\"end\":7834,\"start\":7332},{\"end\":7966,\"start\":7836},{\"end\":9334,\"start\":8102},{\"end\":9874,\"start\":9378},{\"end\":10136,\"start\":9900},{\"end\":10390,\"start\":10254},{\"end\":10637,\"start\":10448},{\"end\":10896,\"start\":10690},{\"end\":10937,\"start\":10898},{\"end\":11033,\"start\":11000},{\"end\":11288,\"start\":11075},{\"end\":11512,\"start\":11313},{\"end\":11610,\"start\":11514},{\"end\":11690,\"start\":11612},{\"end\":12441,\"start\":11692},{\"end\":13381,\"start\":12497},{\"end\":13602,\"start\":13383},{\"end\":14773,\"start\":13660},{\"end\":15026,\"start\":14881},{\"end\":15262,\"start\":15109},{\"end\":15410,\"start\":15294},{\"end\":15838,\"start\":15412},{\"end\":15978,\"start\":15972},{\"end\":16537,\"start\":15980},{\"end\":16652,\"start\":16622},{\"end\":16764,\"start\":16763},{\"end\":16772,\"start\":16766},{\"end\":17058,\"start\":16774},{\"end\":17482,\"start\":17094},{\"end\":18234,\"start\":17565},{\"end\":18724,\"start\":18293},{\"end\":19154,\"start\":18726},{\"end\":19604,\"start\":19284},{\"end\":19970,\"start\":19606},{\"end\":20191,\"start\":20110},{\"end\":20246,\"start\":20193},{\"end\":20727,\"start\":20406},{\"end\":21059,\"start\":20839},{\"end\":21556,\"start\":21061},{\"end\":21767,\"start\":21558},{\"end\":22667,\"start\":21837},{\"end\":22893,\"start\":22799},{\"end\":23001,\"start\":22895},{\"end\":23276,\"start\":23028},{\"end\":23327,\"start\":23278},{\"end\":23377,\"start\":23329},{\"end\":23425,\"start\":23379},{\"end\":23644,\"start\":23427},{\"end\":24097,\"start\":23715},{\"end\":24395,\"start\":24138},{\"end\":24552,\"start\":24472},{\"end\":25097,\"start\":24694},{\"end\":25223,\"start\":25150},{\"end\":25337,\"start\":25244},{\"end\":25644,\"start\":25388},{\"end\":26013,\"start\":25689},{\"end\":26330,\"start\":26015},{\"end\":26834,\"start\":26438},{\"end\":27225,\"start\":26944},{\"end\":27400,\"start\":27227},{\"end\":27712,\"start\":27507},{\"end\":28077,\"start\":27714},{\"end\":29322,\"start\":28202},{\"end\":29479,\"start\":29324},{\"end\":29889,\"start\":29719},{\"end\":29959,\"start\":29891},{\"end\":30093,\"start\":29961},{\"end\":30279,\"start\":30166},{\"end\":30692,\"start\":30299},{\"end\":30877,\"start\":30694},{\"end\":31049,\"start\":30894},{\"end\":31130,\"start\":31073},{\"end\":31538,\"start\":31132},{\"end\":31730,\"start\":31577},{\"end\":31834,\"start\":31732},{\"end\":32012,\"start\":31836},{\"end\":32576,\"start\":32014},{\"end\":32602,\"start\":32578},{\"end\":32756,\"start\":32613},{\"end\":32889,\"start\":32865},{\"end\":33207,\"start\":32921},{\"end\":33336,\"start\":33239},{\"end\":33865,\"start\":33338},{\"end\":33941,\"start\":33867},{\"end\":34516,\"start\":34372},{\"end\":34885,\"start\":34518},{\"end\":35427,\"start\":34887},{\"end\":35682,\"start\":35489},{\"end\":35957,\"start\":35718},{\"end\":36393,\"start\":35959},{\"end\":36673,\"start\":36462},{\"end\":37091,\"start\":36754},{\"end\":37550,\"start\":37163},{\"end\":38352,\"start\":37669},{\"end\":39094,\"start\":38450},{\"end\":39403,\"start\":39155},{\"end\":39951,\"start\":39546},{\"end\":40365,\"start\":39989},{\"end\":40855,\"start\":40367},{\"end\":41332,\"start\":40857},{\"end\":41506,\"start\":41334},{\"end\":42190,\"start\":41562},{\"end\":42832,\"start\":42192},{\"end\":42996,\"start\":42939},{\"end\":43452,\"start\":42998},{\"end\":43979,\"start\":43454},{\"end\":44454,\"start\":43981},{\"end\":45520,\"start\":44567},{\"end\":46516,\"start\":45528},{\"end\":47051,\"start\":46518},{\"end\":47425,\"start\":47053},{\"end\":47649,\"start\":47427},{\"end\":48188,\"start\":47687},{\"end\":48448,\"start\":48306},{\"end\":48870,\"start\":48495},{\"end\":48993,\"start\":48872},{\"end\":49072,\"start\":49056},{\"end\":49115,\"start\":49108},{\"end\":49330,\"start\":49216},{\"end\":49633,\"start\":49377},{\"end\":50047,\"start\":49640},{\"end\":50294,\"start\":50049},{\"end\":50344,\"start\":50296},{\"end\":50879,\"start\":50346},{\"end\":51365,\"start\":50967},{\"end\":51898,\"start\":51367},{\"end\":52181,\"start\":51900},{\"end\":52636,\"start\":52204},{\"end\":53167,\"start\":52638},{\"end\":54083,\"start\":53169},{\"end\":54782,\"start\":54085},{\"end\":55213,\"start\":54784},{\"end\":55537,\"start\":55260},{\"end\":55678,\"start\":55539},{\"end\":55979,\"start\":55680},{\"end\":56566,\"start\":56058},{\"end\":56951,\"start\":56750},{\"end\":57313,\"start\":56953},{\"end\":57316,\"start\":57315},{\"end\":57708,\"start\":57323},{\"end\":57768,\"start\":57767},{\"end\":57775,\"start\":57770},{\"end\":58006,\"start\":57839},{\"end\":59262,\"start\":58094},{\"end\":59269,\"start\":59264},{\"end\":61871,\"start\":59271},{\"end\":62009,\"start\":61914}]", "formula": "[{\"attributes\":{\"id\":\"formula_0\"},\"end\":2211,\"start\":2198},{\"attributes\":{\"id\":\"formula_1\"},\"end\":2903,\"start\":2886},{\"attributes\":{\"id\":\"formula_2\"},\"end\":6493,\"start\":6424},{\"attributes\":{\"id\":\"formula_3\"},\"end\":6710,\"start\":6669},{\"attributes\":{\"id\":\"formula_4\"},\"end\":7331,\"start\":7197},{\"attributes\":{\"id\":\"formula_5\"},\"end\":8101,\"start\":7967},{\"attributes\":{\"id\":\"formula_6\"},\"end\":9899,\"start\":9875},{\"attributes\":{\"id\":\"formula_7\"},\"end\":10253,\"start\":10137},{\"attributes\":{\"id\":\"formula_8\"},\"end\":10447,\"start\":10391},{\"attributes\":{\"id\":\"formula_9\"},\"end\":10689,\"start\":10638},{\"attributes\":{\"id\":\"formula_10\"},\"end\":10999,\"start\":10938},{\"attributes\":{\"id\":\"formula_11\"},\"end\":11074,\"start\":11034},{\"attributes\":{\"id\":\"formula_12\"},\"end\":12496,\"start\":12442},{\"attributes\":{\"id\":\"formula_13\"},\"end\":13659,\"start\":13603},{\"attributes\":{\"id\":\"formula_14\"},\"end\":14807,\"start\":14774},{\"attributes\":{\"id\":\"formula_15\"},\"end\":14880,\"start\":14807},{\"attributes\":{\"id\":\"formula_16\"},\"end\":15108,\"start\":15027},{\"attributes\":{\"id\":\"formula_17\"},\"end\":15293,\"start\":15263},{\"attributes\":{\"id\":\"formula_18\"},\"end\":15971,\"start\":15839},{\"attributes\":{\"id\":\"formula_19\"},\"end\":16621,\"start\":16538},{\"attributes\":{\"id\":\"formula_20\"},\"end\":16762,\"start\":16653},{\"attributes\":{\"id\":\"formula_21\"},\"end\":17564,\"start\":17483},{\"attributes\":{\"id\":\"formula_22\"},\"end\":18292,\"start\":18235},{\"attributes\":{\"id\":\"formula_23\"},\"end\":19283,\"start\":19155},{\"attributes\":{\"id\":\"formula_24\"},\"end\":20109,\"start\":19971},{\"attributes\":{\"id\":\"formula_25\"},\"end\":20405,\"start\":20247},{\"attributes\":{\"id\":\"formula_26\"},\"end\":20838,\"start\":20728},{\"attributes\":{\"id\":\"formula_27\"},\"end\":21836,\"start\":21768},{\"attributes\":{\"id\":\"formula_28\"},\"end\":22737,\"start\":22668},{\"attributes\":{\"id\":\"formula_29\"},\"end\":22798,\"start\":22737},{\"attributes\":{\"id\":\"formula_30\"},\"end\":23714,\"start\":23645},{\"attributes\":{\"id\":\"formula_31\"},\"end\":24471,\"start\":24396},{\"attributes\":{\"id\":\"formula_32\"},\"end\":24620,\"start\":24553},{\"attributes\":{\"id\":\"formula_33\"},\"end\":24693,\"start\":24620},{\"attributes\":{\"id\":\"formula_34\"},\"end\":25149,\"start\":25098},{\"attributes\":{\"id\":\"formula_35\"},\"end\":25243,\"start\":25224},{\"attributes\":{\"id\":\"formula_36\"},\"end\":25387,\"start\":25338},{\"attributes\":{\"id\":\"formula_37\"},\"end\":25688,\"start\":25645},{\"attributes\":{\"id\":\"formula_38\"},\"end\":26437,\"start\":26331},{\"attributes\":{\"id\":\"formula_39\"},\"end\":26943,\"start\":26835},{\"attributes\":{\"id\":\"formula_40\"},\"end\":27506,\"start\":27401},{\"attributes\":{\"id\":\"formula_41\"},\"end\":28201,\"start\":28078},{\"attributes\":{\"id\":\"formula_42\"},\"end\":29682,\"start\":29480},{\"attributes\":{\"id\":\"formula_43\"},\"end\":30165,\"start\":30094},{\"attributes\":{\"id\":\"formula_44\"},\"end\":30298,\"start\":30280},{\"attributes\":{\"id\":\"formula_45\"},\"end\":30893,\"start\":30878},{\"attributes\":{\"id\":\"formula_46\"},\"end\":31072,\"start\":31050},{\"attributes\":{\"id\":\"formula_48\"},\"end\":32864,\"start\":32757},{\"attributes\":{\"id\":\"formula_49\"},\"end\":32920,\"start\":32890},{\"attributes\":{\"id\":\"formula_50\"},\"end\":34371,\"start\":33942},{\"attributes\":{\"id\":\"formula_51\"},\"end\":35488,\"start\":35428},{\"attributes\":{\"id\":\"formula_52\"},\"end\":36461,\"start\":36394},{\"attributes\":{\"id\":\"formula_53\"},\"end\":36753,\"start\":36674},{\"attributes\":{\"id\":\"formula_54\"},\"end\":37162,\"start\":37092},{\"attributes\":{\"id\":\"formula_55\"},\"end\":37668,\"start\":37551},{\"attributes\":{\"id\":\"formula_56\"},\"end\":38384,\"start\":38353},{\"attributes\":{\"id\":\"formula_57\"},\"end\":38449,\"start\":38384},{\"attributes\":{\"id\":\"formula_58\"},\"end\":39545,\"start\":39404},{\"attributes\":{\"id\":\"formula_59\"},\"end\":42938,\"start\":42833},{\"attributes\":{\"id\":\"formula_60\"},\"end\":44566,\"start\":44455},{\"attributes\":{\"id\":\"formula_61\"},\"end\":47686,\"start\":47650},{\"attributes\":{\"id\":\"formula_62\"},\"end\":48305,\"start\":48189},{\"attributes\":{\"id\":\"formula_63\"},\"end\":48494,\"start\":48449},{\"attributes\":{\"id\":\"formula_64\"},\"end\":49055,\"start\":48994},{\"attributes\":{\"id\":\"formula_65\"},\"end\":49107,\"start\":49073},{\"attributes\":{\"id\":\"formula_66\"},\"end\":49215,\"start\":49116},{\"attributes\":{\"id\":\"formula_67\"},\"end\":49376,\"start\":49331},{\"attributes\":{\"id\":\"formula_68\"},\"end\":49639,\"start\":49634},{\"attributes\":{\"id\":\"formula_69\"},\"end\":50966,\"start\":50880},{\"attributes\":{\"id\":\"formula_70\"},\"end\":56057,\"start\":55980},{\"attributes\":{\"id\":\"formula_71\"},\"end\":56749,\"start\":56567},{\"attributes\":{\"id\":\"formula_72\"},\"end\":57322,\"start\":57317},{\"attributes\":{\"id\":\"formula_73\"},\"end\":57766,\"start\":57709},{\"attributes\":{\"id\":\"formula_74\"},\"end\":58093,\"start\":58007}]", "table_ref": "[{\"end\":38296,\"start\":38289},{\"attributes\":{\"ref_id\":\"tab_0\"},\"end\":40113,\"start\":40106}]", "section_header": "[{\"attributes\":{\"n\":\"1\"},\"end\":1221,\"start\":1209},{\"attributes\":{\"n\":\"2.2\"},\"end\":9376,\"start\":9337},{\"attributes\":{\"n\":\"2.3\"},\"end\":11311,\"start\":11291},{\"attributes\":{\"n\":\"2.4\"},\"end\":17092,\"start\":17061},{\"attributes\":{\"n\":\"3\"},\"end\":23026,\"start\":23004},{\"attributes\":{\"n\":\"3.1\"},\"end\":24136,\"start\":24100},{\"attributes\":{\"n\":\"3.2\"},\"end\":29717,\"start\":29684},{\"attributes\":{\"n\":\"3.3\"},\"end\":31575,\"start\":31541},{\"end\":32611,\"start\":32605},{\"attributes\":{\"n\":\"3.4\"},\"end\":33237,\"start\":33210},{\"attributes\":{\"n\":\"3.5\"},\"end\":35716,\"start\":35685},{\"attributes\":{\"n\":\"4\"},\"end\":39153,\"start\":39097},{\"attributes\":{\"n\":\"4.1\"},\"end\":39987,\"start\":39954},{\"attributes\":{\"n\":\"4.2\"},\"end\":41560,\"start\":41509},{\"end\":45526,\"start\":45523},{\"attributes\":{\"n\":\"6\"},\"end\":52202,\"start\":52184},{\"end\":55258,\"start\":55216},{\"end\":57837,\"start\":57778},{\"end\":61912,\"start\":61874},{\"end\":62012,\"start\":62011},{\"end\":62365,\"start\":62355},{\"end\":62534,\"start\":62524},{\"end\":62876,\"start\":62866},{\"end\":65504,\"start\":65494},{\"end\":66077,\"start\":66067},{\"end\":66398,\"start\":66387},{\"end\":66693,\"start\":66682},{\"end\":67267,\"start\":67256},{\"end\":68005,\"start\":67998},{\"end\":68731,\"start\":68722}]", "table": "[{\"end\":68244,\"start\":68007},{\"end\":68720,\"start\":68587},{\"end\":68838,\"start\":68756}]", "figure_caption": "[{\"end\":62353,\"start\":62013},{\"end\":62522,\"start\":62367},{\"end\":62808,\"start\":62536},{\"end\":62864,\"start\":62811},{\"end\":63442,\"start\":62878},{\"end\":64312,\"start\":63445},{\"end\":64546,\"start\":64315},{\"end\":64841,\"start\":64549},{\"end\":65154,\"start\":64844},{\"end\":65492,\"start\":65157},{\"end\":66065,\"start\":65506},{\"end\":66337,\"start\":66079},{\"end\":66385,\"start\":66340},{\"end\":66680,\"start\":66401},{\"end\":66880,\"start\":66696},{\"end\":67254,\"start\":66883},{\"end\":67610,\"start\":67270},{\"end\":67996,\"start\":67613},{\"end\":68545,\"start\":68247},{\"end\":68587,\"start\":68548},{\"end\":68756,\"start\":68733}]", "figure_ref": "[{\"attributes\":{\"ref_id\":\"fig_1\"},\"end\":6333,\"start\":6327},{\"end\":12850,\"start\":12844},{\"end\":14303,\"start\":14295},{\"end\":14592,\"start\":14584},{\"end\":17993,\"start\":17985},{\"end\":18834,\"start\":18828},{\"end\":19071,\"start\":19065},{\"attributes\":{\"ref_id\":\"fig_2\"},\"end\":22531,\"start\":22525},{\"attributes\":{\"ref_id\":\"fig_5\"},\"end\":29141,\"start\":29135},{\"attributes\":{\"ref_id\":\"fig_1\"},\"end\":33196,\"start\":33189},{\"end\":38285,\"start\":38283},{\"attributes\":{\"ref_id\":\"fig_12\"},\"end\":40921,\"start\":40915},{\"attributes\":{\"ref_id\":\"fig_13\"},\"end\":42129,\"start\":42120},{\"end\":43451,\"start\":43445},{\"end\":43799,\"start\":43793},{\"end\":44255,\"start\":44247},{\"attributes\":{\"ref_id\":\"fig_13\"},\"end\":44453,\"start\":44447},{\"attributes\":{\"ref_id\":\"fig_1\"},\"end\":44840,\"start\":44833},{\"attributes\":{\"ref_id\":\"fig_1\"},\"end\":44984,\"start\":44975},{\"attributes\":{\"ref_id\":\"fig_1\"},\"end\":45943,\"start\":45934},{\"attributes\":{\"ref_id\":\"fig_13\"},\"end\":47467,\"start\":47461},{\"end\":48658,\"start\":48652},{\"attributes\":{\"ref_id\":\"fig_1\"},\"end\":50748,\"start\":50741},{\"end\":58890,\"start\":58882}]", "bib_author_first_name": "[{\"end\":69208,\"start\":69207},{\"end\":69217,\"start\":69216},{\"end\":69233,\"start\":69232},{\"end\":69245,\"start\":69244},{\"end\":69256,\"start\":69255},{\"end\":69490,\"start\":69489},{\"end\":69773,\"start\":69772},{\"end\":69775,\"start\":69774},{\"end\":69967,\"start\":69966},{\"end\":69980,\"start\":69979},{\"end\":69990,\"start\":69989},{\"end\":70242,\"start\":70241},{\"end\":70253,\"start\":70252},{\"end\":70266,\"start\":70265},{\"end\":70276,\"start\":70275},{\"end\":70631,\"start\":70630},{\"end\":70633,\"start\":70632},{\"end\":70641,\"start\":70640},{\"end\":70643,\"start\":70642},{\"end\":70948,\"start\":70947},{\"end\":70966,\"start\":70965},{\"end\":70977,\"start\":70976},{\"end\":71300,\"start\":71299},{\"end\":71302,\"start\":71301},{\"end\":71313,\"start\":71312},{\"end\":71315,\"start\":71314},{\"end\":71328,\"start\":71327},{\"end\":71341,\"start\":71340},{\"end\":71629,\"start\":71628},{\"end\":71646,\"start\":71645},{\"end\":71657,\"start\":71656},{\"end\":71666,\"start\":71665},{\"end\":71875,\"start\":71874},{\"end\":71885,\"start\":71884},{\"end\":71887,\"start\":71886},{\"end\":72068,\"start\":72067},{\"end\":72087,\"start\":72083},{\"end\":72647,\"start\":72646},{\"end\":72658,\"start\":72657},{\"end\":72670,\"start\":72669},{\"end\":72672,\"start\":72671},{\"end\":72685,\"start\":72681},{\"end\":72893,\"start\":72892},{\"end\":72907,\"start\":72906},{\"end\":72913,\"start\":72908},{\"end\":72921,\"start\":72920},{\"end\":72933,\"start\":72932},{\"end\":72944,\"start\":72943},{\"end\":73122,\"start\":73121},{\"end\":73124,\"start\":73123},{\"end\":73137,\"start\":73133},{\"end\":73148,\"start\":73144},{\"end\":73360,\"start\":73359},{\"end\":73370,\"start\":73369},{\"end\":73597,\"start\":73596},{\"end\":73608,\"start\":73607},{\"end\":73617,\"start\":73616},{\"end\":73783,\"start\":73782},{\"end\":73796,\"start\":73795},{\"end\":73810,\"start\":73809},{\"end\":73812,\"start\":73811},{\"end\":74080,\"start\":74079},{\"end\":74088,\"start\":74087},{\"end\":74099,\"start\":74098},{\"end\":74317,\"start\":74316},{\"end\":74546,\"start\":74545},{\"end\":74553,\"start\":74552},{\"end\":74809,\"start\":74808},{\"end\":75008,\"start\":75007},{\"end\":75010,\"start\":75009},{\"end\":75018,\"start\":75017},{\"end\":75020,\"start\":75019},{\"end\":75033,\"start\":75032},{\"end\":75035,\"start\":75034},{\"end\":75044,\"start\":75043},{\"end\":75046,\"start\":75045},{\"end\":75218,\"start\":75217},{\"end\":75232,\"start\":75231},{\"end\":75241,\"start\":75240},{\"end\":75253,\"start\":75252},{\"end\":75472,\"start\":75471},{\"end\":75485,\"start\":75484},{\"end\":75487,\"start\":75486},{\"end\":75496,\"start\":75495},{\"end\":75757,\"start\":75756},{\"end\":75767,\"start\":75766},{\"end\":75769,\"start\":75768},{\"end\":75784,\"start\":75780},{\"end\":75792,\"start\":75791},{\"end\":75805,\"start\":75804},{\"end\":75807,\"start\":75806},{\"end\":75816,\"start\":75815},{\"end\":76096,\"start\":76095},{\"end\":76335,\"start\":76334},{\"end\":76337,\"start\":76336},{\"end\":76348,\"start\":76347},{\"end\":76358,\"start\":76357},{\"end\":76365,\"start\":76364},{\"end\":76375,\"start\":76374},{\"end\":76393,\"start\":76392},{\"end\":76647,\"start\":76646},{\"end\":76658,\"start\":76657},{\"end\":76664,\"start\":76663},{\"end\":76678,\"start\":76677},{\"end\":76907,\"start\":76906},{\"end\":76909,\"start\":76908},{\"end\":76919,\"start\":76918},{\"end\":76932,\"start\":76931},{\"end\":76942,\"start\":76941},{\"end\":76944,\"start\":76943},{\"end\":76956,\"start\":76955},{\"end\":77227,\"start\":77226},{\"end\":77229,\"start\":77228},{\"end\":77242,\"start\":77241},{\"end\":77255,\"start\":77254},{\"end\":77477,\"start\":77476},{\"end\":77479,\"start\":77478},{\"end\":77492,\"start\":77491},{\"end\":77503,\"start\":77502},{\"end\":77695,\"start\":77694},{\"end\":77710,\"start\":77709},{\"end\":77915,\"start\":77914},{\"end\":77925,\"start\":77924},{\"end\":77933,\"start\":77932},{\"end\":78071,\"start\":78070},{\"end\":78082,\"start\":78081},{\"end\":78093,\"start\":78092},{\"end\":78103,\"start\":78102},{\"end\":78105,\"start\":78104},{\"end\":78300,\"start\":78299},{\"end\":78314,\"start\":78313},{\"end\":78329,\"start\":78328},{\"end\":78625,\"start\":78624},{\"end\":78635,\"start\":78634},{\"end\":78644,\"start\":78643},{\"end\":78910,\"start\":78909},{\"end\":78921,\"start\":78920},{\"end\":78933,\"start\":78932},{\"end\":78935,\"start\":78934},{\"end\":78948,\"start\":78944},{\"end\":79220,\"start\":79219},{\"end\":79222,\"start\":79221},{\"end\":79235,\"start\":79234},{\"end\":79244,\"start\":79243},{\"end\":79255,\"start\":79254},{\"end\":79265,\"start\":79264},{\"end\":79276,\"start\":79275}]", "bib_author_last_name": "[{\"end\":69214,\"start\":69209},{\"end\":69230,\"start\":69218},{\"end\":69242,\"start\":69234},{\"end\":69253,\"start\":69246},{\"end\":69265,\"start\":69257},{\"end\":69497,\"start\":69491},{\"end\":69779,\"start\":69776},{\"end\":69977,\"start\":69968},{\"end\":69987,\"start\":69981},{\"end\":70000,\"start\":69991},{\"end\":70250,\"start\":70243},{\"end\":70263,\"start\":70254},{\"end\":70273,\"start\":70267},{\"end\":70286,\"start\":70277},{\"end\":70638,\"start\":70634},{\"end\":70650,\"start\":70644},{\"end\":70963,\"start\":70949},{\"end\":70974,\"start\":70967},{\"end\":70985,\"start\":70978},{\"end\":71310,\"start\":71303},{\"end\":71325,\"start\":71316},{\"end\":71338,\"start\":71329},{\"end\":71351,\"start\":71342},{\"end\":71643,\"start\":71630},{\"end\":71654,\"start\":71647},{\"end\":71663,\"start\":71658},{\"end\":71674,\"start\":71667},{\"end\":71882,\"start\":71876},{\"end\":71894,\"start\":71888},{\"end\":72081,\"start\":72069},{\"end\":72093,\"start\":72088},{\"end\":72655,\"start\":72648},{\"end\":72667,\"start\":72659},{\"end\":72679,\"start\":72673},{\"end\":72690,\"start\":72686},{\"end\":72904,\"start\":72894},{\"end\":72918,\"start\":72914},{\"end\":72930,\"start\":72922},{\"end\":72941,\"start\":72934},{\"end\":72949,\"start\":72945},{\"end\":73131,\"start\":73125},{\"end\":73142,\"start\":73138},{\"end\":73153,\"start\":73149},{\"end\":73367,\"start\":73361},{\"end\":73376,\"start\":73371},{\"end\":73605,\"start\":73598},{\"end\":73614,\"start\":73609},{\"end\":73627,\"start\":73618},{\"end\":73793,\"start\":73784},{\"end\":73807,\"start\":73797},{\"end\":73821,\"start\":73813},{\"end\":74085,\"start\":74081},{\"end\":74096,\"start\":74089},{\"end\":74106,\"start\":74100},{\"end\":74328,\"start\":74318},{\"end\":74550,\"start\":74547},{\"end\":74560,\"start\":74554},{\"end\":74816,\"start\":74810},{\"end\":75015,\"start\":75011},{\"end\":75030,\"start\":75021},{\"end\":75041,\"start\":75036},{\"end\":75059,\"start\":75047},{\"end\":75229,\"start\":75219},{\"end\":75238,\"start\":75233},{\"end\":75250,\"start\":75242},{\"end\":75268,\"start\":75254},{\"end\":75482,\"start\":75473},{\"end\":75493,\"start\":75488},{\"end\":75506,\"start\":75497},{\"end\":75764,\"start\":75758},{\"end\":75778,\"start\":75770},{\"end\":75789,\"start\":75785},{\"end\":75802,\"start\":75793},{\"end\":75813,\"start\":75808},{\"end\":75824,\"start\":75817},{\"end\":76111,\"start\":76097},{\"end\":76345,\"start\":76338},{\"end\":76355,\"start\":76349},{\"end\":76362,\"start\":76359},{\"end\":76372,\"start\":76366},{\"end\":76390,\"start\":76376},{\"end\":76396,\"start\":76394},{\"end\":76655,\"start\":76648},{\"end\":76661,\"start\":76659},{\"end\":76675,\"start\":76665},{\"end\":76685,\"start\":76679},{\"end\":76916,\"start\":76910},{\"end\":76929,\"start\":76920},{\"end\":76939,\"start\":76933},{\"end\":76953,\"start\":76945},{\"end\":76963,\"start\":76957},{\"end\":77239,\"start\":77230},{\"end\":77252,\"start\":77243},{\"end\":77262,\"start\":77256},{\"end\":77489,\"start\":77480},{\"end\":77500,\"start\":77493},{\"end\":77510,\"start\":77504},{\"end\":77707,\"start\":77696},{\"end\":77720,\"start\":77711},{\"end\":77922,\"start\":77916},{\"end\":77930,\"start\":77926},{\"end\":77940,\"start\":77934},{\"end\":78079,\"start\":78072},{\"end\":78090,\"start\":78083},{\"end\":78100,\"start\":78094},{\"end\":78112,\"start\":78106},{\"end\":78311,\"start\":78301},{\"end\":78326,\"start\":78315},{\"end\":78335,\"start\":78330},{\"end\":78632,\"start\":78626},{\"end\":78641,\"start\":78636},{\"end\":78649,\"start\":78645},{\"end\":78918,\"start\":78911},{\"end\":78930,\"start\":78922},{\"end\":78942,\"start\":78936},{\"end\":78953,\"start\":78949},{\"end\":79232,\"start\":79223},{\"end\":79241,\"start\":79236},{\"end\":79252,\"start\":79245},{\"end\":79262,\"start\":79256},{\"end\":79273,\"start\":79266},{\"end\":79285,\"start\":79277}]", "bib_entry": "[{\"attributes\":{\"doi\":\"10.1088/1126-6708/2006/10/014\",\"id\":\"b0\",\"matched_paper_id\":2956810},\"end\":69487,\"start\":69144},{\"attributes\":{\"id\":\"b1\"},\"end\":69675,\"start\":69489},{\"attributes\":{\"id\":\"b2\",\"matched_paper_id\":119669432},\"end\":69962,\"start\":69677},{\"attributes\":{\"id\":\"b3\"},\"end\":70169,\"start\":69964},{\"attributes\":{\"id\":\"b4\",\"matched_paper_id\":16791979},\"end\":70520,\"start\":70171},{\"attributes\":{\"id\":\"b5\",\"matched_paper_id\":37156490},\"end\":70859,\"start\":70522},{\"attributes\":{\"id\":\"b6\",\"matched_paper_id\":6092268},\"end\":71222,\"start\":70861},{\"attributes\":{\"id\":\"b7\",\"matched_paper_id\":118668558},\"end\":71562,\"start\":71224},{\"attributes\":{\"id\":\"b8\",\"matched_paper_id\":3218222},\"end\":71870,\"start\":71564},{\"attributes\":{\"id\":\"b9\"},\"end\":72065,\"start\":71872},{\"attributes\":{\"id\":\"b10\"},\"end\":72599,\"start\":72067},{\"attributes\":{\"id\":\"b11\",\"matched_paper_id\":119420674},\"end\":72890,\"start\":72601},{\"attributes\":{\"id\":\"b12\"},\"end\":73119,\"start\":72892},{\"attributes\":{\"id\":\"b13\"},\"end\":73308,\"start\":73121},{\"attributes\":{\"id\":\"b14\",\"matched_paper_id\":119325527},\"end\":73544,\"start\":73310},{\"attributes\":{\"id\":\"b15\"},\"end\":73733,\"start\":73546},{\"attributes\":{\"id\":\"b16\",\"matched_paper_id\":8606610},\"end\":73983,\"start\":73735},{\"attributes\":{\"id\":\"b17\",\"matched_paper_id\":121239240},\"end\":74312,\"start\":73985},{\"attributes\":{\"id\":\"b18\"},\"end\":74480,\"start\":74314},{\"attributes\":{\"id\":\"b19\",\"matched_paper_id\":122360426},\"end\":74718,\"start\":74482},{\"attributes\":{\"id\":\"b20\",\"matched_paper_id\":122285698},\"end\":74982,\"start\":74720},{\"attributes\":{\"id\":\"b21\"},\"end\":75215,\"start\":74984},{\"attributes\":{\"id\":\"b22\"},\"end\":75397,\"start\":75217},{\"attributes\":{\"id\":\"b23\",\"matched_paper_id\":209460911},\"end\":75698,\"start\":75399},{\"attributes\":{\"id\":\"b24\",\"matched_paper_id\":119242107},\"end\":76034,\"start\":75700},{\"attributes\":{\"id\":\"b25\",\"matched_paper_id\":35625559},\"end\":76267,\"start\":76036},{\"attributes\":{\"id\":\"b26\",\"matched_paper_id\":208910721},\"end\":76616,\"start\":76269},{\"attributes\":{\"id\":\"b27\",\"matched_paper_id\":202577256},\"end\":76839,\"start\":76618},{\"attributes\":{\"id\":\"b28\",\"matched_paper_id\":119464548},\"end\":77172,\"start\":76841},{\"attributes\":{\"id\":\"b29\",\"matched_paper_id\":197511593},\"end\":77474,\"start\":77174},{\"attributes\":{\"id\":\"b30\"},\"end\":77641,\"start\":77476},{\"attributes\":{\"id\":\"b31\",\"matched_paper_id\":119231010},\"end\":77879,\"start\":77643},{\"attributes\":{\"id\":\"b32\"},\"end\":78020,\"start\":77881},{\"attributes\":{\"id\":\"b33\"},\"end\":78224,\"start\":78022},{\"attributes\":{\"id\":\"b34\",\"matched_paper_id\":119251477},\"end\":78568,\"start\":78226},{\"attributes\":{\"id\":\"b35\",\"matched_paper_id\":119012626},\"end\":78851,\"start\":78570},{\"attributes\":{\"id\":\"b36\",\"matched_paper_id\":54217161},\"end\":79140,\"start\":78853},{\"attributes\":{\"id\":\"b37\",\"matched_paper_id\":207796070},\"end\":79517,\"start\":79142}]", "bib_title": "[{\"end\":69205,\"start\":69144},{\"end\":69770,\"start\":69677},{\"end\":70239,\"start\":70171},{\"end\":70628,\"start\":70522},{\"end\":70945,\"start\":70861},{\"end\":71297,\"start\":71224},{\"end\":71626,\"start\":71564},{\"end\":72644,\"start\":72601},{\"end\":73357,\"start\":73310},{\"end\":73780,\"start\":73735},{\"end\":74077,\"start\":73985},{\"end\":74543,\"start\":74482},{\"end\":74806,\"start\":74720},{\"end\":75469,\"start\":75399},{\"end\":75754,\"start\":75700},{\"end\":76093,\"start\":76036},{\"end\":76332,\"start\":76269},{\"end\":76644,\"start\":76618},{\"end\":76904,\"start\":76841},{\"end\":77224,\"start\":77174},{\"end\":77692,\"start\":77643},{\"end\":78297,\"start\":78226},{\"end\":78622,\"start\":78570},{\"end\":78907,\"start\":78853},{\"end\":79217,\"start\":79142}]", "bib_author": "[{\"end\":69216,\"start\":69207},{\"end\":69232,\"start\":69216},{\"end\":69244,\"start\":69232},{\"end\":69255,\"start\":69244},{\"end\":69267,\"start\":69255},{\"end\":69499,\"start\":69489},{\"end\":69781,\"start\":69772},{\"end\":69979,\"start\":69966},{\"end\":69989,\"start\":69979},{\"end\":70002,\"start\":69989},{\"end\":70252,\"start\":70241},{\"end\":70265,\"start\":70252},{\"end\":70275,\"start\":70265},{\"end\":70288,\"start\":70275},{\"end\":70640,\"start\":70630},{\"end\":70652,\"start\":70640},{\"end\":70965,\"start\":70947},{\"end\":70976,\"start\":70965},{\"end\":70987,\"start\":70976},{\"end\":71312,\"start\":71299},{\"end\":71327,\"start\":71312},{\"end\":71340,\"start\":71327},{\"end\":71353,\"start\":71340},{\"end\":71645,\"start\":71628},{\"end\":71656,\"start\":71645},{\"end\":71665,\"start\":71656},{\"end\":71676,\"start\":71665},{\"end\":71884,\"start\":71874},{\"end\":71896,\"start\":71884},{\"end\":72083,\"start\":72067},{\"end\":72095,\"start\":72083},{\"end\":72657,\"start\":72646},{\"end\":72669,\"start\":72657},{\"end\":72681,\"start\":72669},{\"end\":72692,\"start\":72681},{\"end\":72906,\"start\":72892},{\"end\":72920,\"start\":72906},{\"end\":72932,\"start\":72920},{\"end\":72943,\"start\":72932},{\"end\":72951,\"start\":72943},{\"end\":73133,\"start\":73121},{\"end\":73144,\"start\":73133},{\"end\":73155,\"start\":73144},{\"end\":73369,\"start\":73359},{\"end\":73378,\"start\":73369},{\"end\":73607,\"start\":73596},{\"end\":73616,\"start\":73607},{\"end\":73629,\"start\":73616},{\"end\":73795,\"start\":73782},{\"end\":73809,\"start\":73795},{\"end\":73823,\"start\":73809},{\"end\":74087,\"start\":74079},{\"end\":74098,\"start\":74087},{\"end\":74108,\"start\":74098},{\"end\":74330,\"start\":74316},{\"end\":74552,\"start\":74545},{\"end\":74562,\"start\":74552},{\"end\":74818,\"start\":74808},{\"end\":75017,\"start\":75007},{\"end\":75032,\"start\":75017},{\"end\":75043,\"start\":75032},{\"end\":75061,\"start\":75043},{\"end\":75231,\"start\":75217},{\"end\":75240,\"start\":75231},{\"end\":75252,\"start\":75240},{\"end\":75270,\"start\":75252},{\"end\":75484,\"start\":75471},{\"end\":75495,\"start\":75484},{\"end\":75508,\"start\":75495},{\"end\":75766,\"start\":75756},{\"end\":75780,\"start\":75766},{\"end\":75791,\"start\":75780},{\"end\":75804,\"start\":75791},{\"end\":75815,\"start\":75804},{\"end\":75826,\"start\":75815},{\"end\":76113,\"start\":76095},{\"end\":76347,\"start\":76334},{\"end\":76357,\"start\":76347},{\"end\":76364,\"start\":76357},{\"end\":76374,\"start\":76364},{\"end\":76392,\"start\":76374},{\"end\":76398,\"start\":76392},{\"end\":76657,\"start\":76646},{\"end\":76663,\"start\":76657},{\"end\":76677,\"start\":76663},{\"end\":76687,\"start\":76677},{\"end\":76918,\"start\":76906},{\"end\":76931,\"start\":76918},{\"end\":76941,\"start\":76931},{\"end\":76955,\"start\":76941},{\"end\":76965,\"start\":76955},{\"end\":77241,\"start\":77226},{\"end\":77254,\"start\":77241},{\"end\":77264,\"start\":77254},{\"end\":77491,\"start\":77476},{\"end\":77502,\"start\":77491},{\"end\":77512,\"start\":77502},{\"end\":77709,\"start\":77694},{\"end\":77722,\"start\":77709},{\"end\":77924,\"start\":77914},{\"end\":77932,\"start\":77924},{\"end\":77942,\"start\":77932},{\"end\":78081,\"start\":78070},{\"end\":78092,\"start\":78081},{\"end\":78102,\"start\":78092},{\"end\":78114,\"start\":78102},{\"end\":78313,\"start\":78299},{\"end\":78328,\"start\":78313},{\"end\":78337,\"start\":78328},{\"end\":78634,\"start\":78624},{\"end\":78643,\"start\":78634},{\"end\":78651,\"start\":78643},{\"end\":78920,\"start\":78909},{\"end\":78932,\"start\":78920},{\"end\":78944,\"start\":78932},{\"end\":78955,\"start\":78944},{\"end\":79234,\"start\":79219},{\"end\":79243,\"start\":79234},{\"end\":79254,\"start\":79243},{\"end\":79264,\"start\":79254},{\"end\":79275,\"start\":79264},{\"end\":79287,\"start\":79275}]", "bib_venue": "[{\"end\":69314,\"start\":69310},{\"end\":69571,\"start\":69517},{\"end\":69822,\"start\":69809},{\"end\":70058,\"start\":70045},{\"end\":70340,\"start\":70328},{\"end\":70688,\"start\":70676},{\"end\":71037,\"start\":71025},{\"end\":71389,\"start\":71385},{\"end\":71713,\"start\":71709},{\"end\":71962,\"start\":71929},{\"end\":72216,\"start\":72095},{\"end\":72740,\"start\":72728},{\"end\":72993,\"start\":72951},{\"end\":73204,\"start\":73155},{\"end\":73427,\"start\":73417},{\"end\":73594,\"start\":73546},{\"end\":73855,\"start\":73846},{\"end\":74144,\"start\":74126},{\"end\":74371,\"start\":74330},{\"end\":74596,\"start\":74587},{\"end\":74848,\"start\":74836},{\"end\":75005,\"start\":74984},{\"end\":75294,\"start\":75270},{\"end\":75545,\"start\":75541},{\"end\":75853,\"start\":75849},{\"end\":76150,\"start\":76146},{\"end\":76425,\"start\":76421},{\"end\":76724,\"start\":76720},{\"end\":77002,\"start\":76998},{\"end\":77309,\"start\":77294},{\"end\":77548,\"start\":77512},{\"end\":77758,\"start\":77754},{\"end\":77912,\"start\":77881},{\"end\":78068,\"start\":78022},{\"end\":78392,\"start\":78377},{\"end\":78706,\"start\":78691},{\"end\":78982,\"start\":78978},{\"end\":79314,\"start\":79310}]"}}}, "year": 2023, "month": 12, "day": 17}