{"id": 227127506, "updated": "2023-10-06 08:38:25.496", "metadata": {"title": "Measuring Quadrangle Formation in Complex Networks", "authors": "[{\"first\":\"Mingshan\",\"last\":\"Jia\",\"middle\":[]},{\"first\":\"Bogdan\",\"last\":\"Gabrys\",\"middle\":[]},{\"first\":\"Katarzyna\",\"last\":\"Musial\",\"middle\":[]}]", "venue": "ArXiv", "journal": "ArXiv", "publication_date": {"year": 2020, "month": 11, "day": 21}, "abstract": "The classic clustering coefficient and the lately proposed closure coefficient quantify the formation of triangles from two different perspectives, with the focal node at the centre or at the end in an open triad respectively. As many networks are naturally rich in triangles, they become standard metrics to describe and analyse networks. However, the advantages of applying them can be limited in networks, where there are relatively few triangles but which are rich in quadrangles, such as the protein-protein interaction networks, the neural networks and the food webs. This yields for other approaches that would leverage quadrangles in our journey to better understand local structures and their meaning in different types of networks. Here we propose two quadrangle coefficients, i.e., the i-quad coefficient and the o-quad coefficient, to quantify quadrangle formation in networks, and we further extend them to weighted networks. Through experiments on 16 networks from six different domains, we first reveal the density distribution of the two quadrangle coefficients, and then analyse their correlations with node degree. Finally, we demonstrate that at network-level, adding the average i-quad coefficient and the average o-quad coefficient leads to significant improvement in network classification, while at node-level, the i-quad and o-quad coefficients are useful features to improve link prediction.", "fields_of_study": "[\"Computer Science\"]", "external_ids": {"arxiv": "2011.10763", "mag": "3106987662", "acl": null, "pubmed": null, "pubmedcentral": null, "dblp": "journals/tnse/JiaGM22", "doi": "10.1109/tnse.2021.3123735"}}, "content": {"source": {"pdf_hash": "5e61e23b6d3a892d35134135a5f4a77179b82233", "pdf_src": "Arxiv", "pdf_uri": "[\"https://arxiv.org/pdf/2011.10763v1.pdf\"]", "oa_url_match": true, "oa_info": {"license": null, "open_access_url": "http://arxiv.org/pdf/2011.10763", "status": "GREEN"}}, "grobid": {"id": "fbb68fcbbaebb5a9b0d80c9ff93294957f1891f5", "type": "plain-text", "url": "s3://ai2-s2-pdf-extraction-prod/parse-results/s2orc_worker/5e61e23b6d3a892d35134135a5f4a77179b82233.txt", "contents": "\nMeasuring Quadrangle Formation in Complex Networks\nAUGUST 2015 1\n\nJournal Of L A T E X Class \nFiles \nMeasuring Quadrangle Formation in Complex Networks\n148AUGUST 2015 1Index Terms-clustering coefficientclosure coefficientquadrangle coefficientnetwork classificationlink prediction\nThe classic clustering coefficient and the lately proposed closure coefficient quantify the formation of triangles from two different perspectives, with the focal node at the centre or at the end in an open triad respectively. As many networks are naturally rich in triangles, they become standard metrics to describe and analyse networks. However, the advantages of applying them can be limited in networks, where there are relatively few triangles but which are rich in quadrangles, such as the protein-protein interaction networks, the neural networks and the food webs. This yields for other approaches that would leverage quadrangles in our journey to better understand local structures and their meaning in different types of networks. Here we propose two quadrangle coefficients, i.e., the i-quad coefficient and the o-quad coefficient, to quantify quadrangle formation in networks, and we further extend them to weighted networks. Through experiments on 16 networks from six different domains, we first reveal the density distribution of the two quadrangle coefficients, and then analyse their correlations with node degree. Finally, we demonstrate that at network-level, adding the average i-quad coefficient and the average o-quad coefficient leads to significant improvement in network classification, while at node-level, the i-quad and o-quad coefficients are useful features to improve link prediction.\n\nINTRODUCTION\n\nC OMPLEX systems across various domains, such as biology, ecology, physics and social science, can be modelled as networks that abstract the interactions between system's components [1], [2], [3]. Different from a simple grid graph or a line graph for image or text modelling respectively, the complexity of networks comes from their intricate topological structures. Therefore, the study of network structure, especially local structure, underlies a number of representative and analytical applications such as representation learning of graphs [4], [5], node-type classification [6], [7], link prediction [8], [9] and anomaly detection [10], [11].\n\nOne fundamental and classic statistical metric to assess the local structure of complex networks is the local clustering coefficient [12], [13]. It is defined as the percentage of the number of triangles formed with a focal node to the number of triangles that the focal node could form with all its neighbours. Note that the focal node here serves as the centre node in an open triad (the middle of a length-2 path). Since many of the real-world networks are triangle-rich, the clustering coefficient -a measure of triangle formationhas become a standard metric to describe networks. It has also been used in numerous applications such as malware detection [14], language learning [15] and structural role discovery [16].\n\nA recent study has proposed another interesting measure of triangle formation, i.e., the local closure coefficient [17]. With the focal node as the end node of an open triad (the head of a length-2 path), it is quantified as the percentage of twice the number of triangles containing the focal node to the number of all length-2 paths starting from the focal node. Specifically, the classic local clustering coefficient measures the extent to which the 1-hop neighbours of a given node connect to each other, while the local closure coefficient measures the extent to which the 2-hop neighbours of a given node connect to the given node itself. This new metric has been proven to be a useful feature in network analysis tasks such as community detection and link prediction [17].\n\nIn many types of networks, however, quadrangles appear at a much higher frequency than triangles, and thus become the most dominant motifs [18]. For instance, in gene regulatory networks, logical circuits networks and neuron networks, the over-represented \"bi-fan\" structure (a specific arXiv:2011.10763v1 [cs.SI] 21 Nov 2020 (a). i-quad coefficient (b). o-quad coefficient directed quadrangle) serves to carry information or signals from previous units to following ones; while in food webs, the highly recurring \"bi-parallel\" structure (another type of directed quadrangle) describes how energy flows in an ecosystem.\n\nIn order to better describe and analyse the local structure of networks, we propose two metrics quantifying the formation of quadrangles, i.e., the i-quad coefficient and the o-quad coefficient. There are two definitions in that two categories of nodes -the inner node or the outer node -can be distinguished from the node's position in an open quadriad (also called intransitive quadriad in some works [19]). The i-quad coefficient, with the focal node functioning as the inner node of an open quadriad, measures the extent to which the focal node's 2-hop neighbours connect to its 1-hop neighbours. The o-quad coefficient, having the focal node as the outer node of an open quadriad, measures the extent to which the focal node's 3-hop neighbours connect to itself ( Figure 1).\n\nAlthough the focus in this paper lies on the general unipartite networks, the proposed i-quad and o-quad coefficients provide interesting insights into bipartite networks as well. Suppose that in a recommender network where node type x denotes users and node type y denotes movies, an edge between x i and y i represents user x i likes movie y i . Take the i-quad coefficient for instance (Figure 2a), given x 1 , the focal user, likes movies y 1 and y 2 , while x 2 likes y 1 , it measures whether x 2 likes y 2 . In other words, the iquad coefficient gives the extent to which other users have a similar preference as the focal user. Likewise, for the oquad coefficient, given x 2 likes y 1 and y 2 , while x 1 , the focal node, likes y 1 , it measures whether x 1 likes y 2 (Figure 2b). That is to say, the o-quad coefficient gives the extent to which the focal user shares a similar opinion with other users. Interestingly, this explanation coincides with the idea of collaborative filtering [20], [21].\n\nIn addition to the basic network structure, a deeper understanding of complex systems sometimes requires taking into account the intensity or the strength of interactions between components. This is achieved by assigning weights to links. For instance, in unipartite networks, weighted links are used to represent the frequency of contact in a communication network, or the intensity of the traffic flow in a transportation network; in bipartite networks, especially recommender networks, weights are added to indicate how much a person likes a product or how often he or she purchases it. Accordingly, we introduce the weighted i-quad coefficient and the weighted o-quad coefficient in order to unveil the quadrangle formation in real weighted networks.\n\nOur empirical study on 16 real-world networks from six domains has revealed several basic and interesting properties of the two proposed coefficients. First, we find that in most types of networks, the average o-quad coefficient is smaller than the average i-quad coefficient, which is also demonstrated through their cumulative density distributions. Secondly, we show that the o-quad coefficient has a strong positive correlation with node degree, whereas the correlation between the i-quad coefficient and node degree is very weak. We then provide a theoretical justification of this phenomenon under the configuration model.\n\nLast but not least, we illustrate how the proposed quadrangle coefficients can be powerful features for network analysis and inference tasks. In a network classification task, we show that different types of real-world networks are significantly better clustered by adding the two quadrangle coefficients. Furthermore, in a link prediction task, we also show that the i-quad and o-quad coefficients can be used as effective predictors to improve the performance, especially in food webs, protein-protein interaction networks and infrastructure networks.\n\nTo sum up, in order to measure the formation of quadrangles in networks, we propose the i-quad coefficient and the o-quad coefficient, based on the inner node and the outer node of an open quadriad respectively. We further extend them to weighted networks. Through extensive experiments on real-world networks, we show not only the intrinsic properties of the two coefficients, but also investigate how they can be utilised in common network analysis task and machine learning tasks. The remainder of this paper is organised as follows. Section 2 introduces notations and background knowledge of clustering coefficient and closure coefficient. Section 3 presents and exemplifies the proposed quadrangle coefficients, whereas Section 4 provides details of the evaluation, including the datasets, experiment setups, performance measures, experiment results and our findings. Section 5 briefly contemplates the related works, and finally we conclude this paper in Section 6.\n\n\nBACKGROUND AND MOTIVATING EXAMPLE\n\nThis section first introduces the basic concepts such as the classic clustering coefficient and the recently proposed closure coefficient. We then illustrate how these coefficients are calculated in the case of a small-scale network that serves as an example.\n\n\nClustering Coefficient\n\nThe clustering coefficient, or more specifically the local clustering coefficient, was originally proposed in order to measure the cliquishness of a neighbourhood in networks [12]. It has since become one of the most commonly used metrics for network structure, together with such measures as degree distribution, path length, connected components, etc. Let G = (V, E) be an undirected graph on a node set V (the number of nodes is |V |) and an edge set E (the number of edges is m), without self-loops and multiple edges. We denote the set of neighbours of node i as N (i), and thus the degree of node i, denoted as d i , equals to |N (i)|. An open triad is a directionless length-2 path. For example, in an open triad ijk, where an edge connects node i and j, and another edge connects node j and k, we do not distinguish between path i → j → k and path k → j → i.\n\nFor any node i ∈ V , its local clustering coefficient, denoted C(i), is defined as the number of triangles containing node i (denoted T (i)), divided by the number of open triads with i as the centre node (denoted OT C(i)):\nC(i) = T (i) OT C(i) = 1 2 j∈N (i) |N (i) ∩ N (j)| 1 2 d i (d i − 1)\n.\n\nIn other words, it is the fraction of open triads, where the focal node serves as the centre node, that actually form triangles. By definition, C(i) ∈ [0, 1].\n\nIn order to get a network-level measurement, the average clustering coefficient is introduced by averaging the local clustering coefficient over all nodes (an undefined local clustering coefficient is treated as zero):\nC = 1 |V | i∈V C(i).(2)\nAn alternative way to measure clustering at the networklevel is the global clustering coefficient [22], which is defined as the fraction of open triads that form triangles in the entire network:\nC = i∈V j∈N (i) |N (i) ∩ N (j)| i∈V d i (d i − 1)\n.\n\n(\n\nNote that the global clustering coefficient is not equivalent to the average clustering coefficient. In Equation 3, we calculate the number of triangles in the entire network, then divided by the number of open triads across the network. Since a node with high degree forms more open triads and also tends to form more triangles, the global clustering coefficient thus puts more weight on hub nodes. On the contrary, in Equation 2, we first calculate the sum of local clustering coefficient of each node, then average over the number of nodes, which gives equal weight on each node.\n\n\nClosure Coefficient\n\nDifferent from the ordinary centre node based perspective in the clustering coefficient, another interesting measure of triangle formation, i.e., the local closure coefficient, has recently been proposed [17]. The focal node in the closure coefficient serves as the end node of an open triad. As Yin et al. [17] has revealed, this subtle difference in measurement leads to very different properties from those of the clustering coefficient.\n\nAdopting the notations of Section 2.1, the local closure coefficient of node i, denoted E(i), is defined as twice the number of triangles formed with i, divided by the number of open triads with i as the end node. (denoted OT E(i)):\nE(i) = 2T (i) OT E(i) = j∈N (i) |N (i) ∩ N (j)| j∈N (i) (d j − 1) .(4)\nIn other words, it is the fraction of open triads, where the focal node serves as the end node, that actually form triangles. T (i) is multiplied by two for the reason that each  At the network-level, the average closure coefficient is then defined as the mean of the local closure coefficient over all nodes (an undefined local closure coefficient is treated as zero):\nE = 1 |V | i∈V E(i).(5)\nAnalogous to the global clustering coefficient (Equation 3), the global closure coefficient, denoted E, is defined as:\nE = i∈V j∈N (i) |N (i) ∩ N (j)| i∈V j∈N (i) (d j − 1) .(6)\nThe global closure coefficient (Equation 6) is actually equivalent to the global clustering coefficient (Equation 3), as globally the difference of the position of the focal node will not surface.\n\n\nA motivating example\n\nWe illustrate how the two coefficients of triangle formation are calculated via a small yet real network. Figure 4a shows a simplified food web of the backwaters of Kerala, India [23]. It is composed of 9 nodes and 18 edges. Each node represents a species and each edge represents the flow of food energy from one species to another. Figure 4b gives a detailed table of the number of triangles T (i), the number of centre-node-based open triads OT C(i), the number of end-node-based open triads OT E(i), the local clustering coefficient C(i) and the local closure coefficient E(i) for each node. Also, the last row gives the average clustering coefficient, the average closure coefficient and the global clustering/closure coefficient, all of which are around 0.20.\n\nDifferent from some triangle-rich networks, we find many more quadrangles than triangles in this food web (23 versus 4), which motivates us to propose measuring quadrangle formation instead. In the next section, new measures to quantify information about quadrangles in complex networks are proposed, and we show how we can leverage the fact that some networks are quadrangle and not triangle rich.\n\n\nTWO QUADRANGLE COEFFICIENTS\n\nThe clustering coefficient and the closure coefficient provide us two ways of measuring triangle formation. In some   networks however, we care more about the formation of quadrangles. Also, triangles do not exist in bipartite networks and the most basic enclosed structure in this representation of networks is quadrangle. In this section, we first propose two coefficients measuring quadrangle formation, based on two different positions of the focal node in an open quadriad. Then, we further extend them to weighted networks.\n\n\nI-quad coefficient\n\nRecall that an open quadriad is a directionless length-3 path ( Figure 1d). In an open quadriad ijkl, for instance, where three edges exist between node pairs (i, j), (j, k) and (k, l), we name nodes j and k as inner nodes. In contrast, nodes i and l are outer nodes. Obviously, an inner node has a degree of two, and an outer node has a degree of one. Further, an open quadriad with the focal node acting as the inner node is called inner-node-based open quadriad of that node; an open quadriad with the focal node acting as the outer node is named outer-node-based open quadriad of that node. In comparison to the definition of clustering coefficient in measuring triangle formation, we propose the i-quad coefficient for measuring quadrangle formation. It is quantified as the fraction of inner-node-based open quadriads that actually form quadrangles. Concretely, the i-quad coefficient of node i, denoted I(i), is defined as twice the number of quadrangles formed with i (denoted as Q(i)), divided by the number of open quadriads with i as the inner node (denoted as OQI(i)):\nI(i) = 2Q(i) OQI(i) = j∈N (i) k∈(N (j)−i) |N (k) ∩ N (i) − j| j∈N (i) k∈(N (j)−i) |N (i) − j − k| .(7)\nIn the above equation, j is in i's neighbour set, and k is in j's neighbour set excluding i. Q(i) is multiplied by two because each quadrangle can be viewed as constructed from two open quadriads with i as the inner node. By definition, it is obvious that\nI(i) ∈ [0, 1].\nThen, we define the average i-quad coefficient at the network-level, as the mean of the i-quad coefficient over all nodes (undefined ones are treated as zeros):\nI = 1 |V | i∈V I(i).(8)\nIn the case of a random network where each pair of nodes is connected with a probability p, the expected value of the average i-quad coefficient is also p, i.e., E[I] = p. An alternative way of measuring quadrangle formation at the network-level is the global i-quad coefficient, which is defined as the fraction of inner-node-based open quadriads that form quadrangles in the entire network:\nI = i∈V j∈N (i) k∈(N (j)−i) |N (k) ∩ N (i) − j| i∈V j∈N (i) k∈(N (j)−i) |N (i) − j − k| .(9)\nThe numerator of the above equation can be viewed as eight times the number of quadrangles in the entire network (each node of a quadrangle contributes two counts), then divided by twice the number of open quadriads with each node acting as the inner node. Although both the average i-quad coefficient and the global i-quad coefficient can be used as metrics to describe quadrangle formation in the entire network, they are calculated differently. The average i-quad coefficient adds up the i-quad coefficient of every node then divides it by the number of nodes, giving each node equal weight. In contrast, the global i-quad coefficient gives nodes that form numerous quadrangles more weight, by first totalling the numerator of the i-quad coefficient then dividing it by the sum of the denominator of the i-quad coefficient.\n\n\nO-quad coefficient\n\nInspired by the closure coefficient in measuring triangle formation, we move the focal node from the inner node to the outer node of an open quadriad, thus proposing the o-quad coefficient in order to measure the formation of quadrangle from a different perspective.\n\nThe significance of introducing the o-quad coefficient is twofold. First, the o-quad coefficient takes into account length-3 paths emanating from the focal node, and therefore has a larger scope of the network structure. Second, when a quadrangle is formed, the closing edge (the edge that closes the outer-node-based open quadriad) is incident to the focal node. This leads to some special properties, comparing to the i-quad coefficient where the closing edge is not incident to the focal node. We show in Section 4 that the cumulative distribution curve of the o-quad coefficient is above that of the i-quad coefficient, and that the o-quad coefficient tends to increase with node degree. In a similar way, the o-quad coefficient of node i, denoted as O(i), is defined as the fraction of open quadriads with i as the outer node that are closed:\nO(i) = 2Q(i) OQO(i) = j∈N (i) k∈(N (j)−i) |N (k) ∩ N (i) − j| j∈N (i) k∈(N (j)−i) |N (k) − j − i| ,(10)\nwhere OQO(i) is the number of outer-node-based open quadriads of node i, and Q(i) is the number of quadrangles containing i. Q(i) is multiplied by two because each quadrangle contains two open quadriads with i as the outer node. In a quadrangle, the focal node can serve as the inner node in two open quadriads or as the outer node in another two open quadriads ( Figure 5). Obviously,\nO(i) ∈ [0, 1].\nIn order to measure at the network level, the average o-quad coefficient is defined by averaging the o-quad coefficient over all nodes (an undefined o-quad coefficient is treated as zero):\nO = 1 |V | i∈V O(i).(11)\nAnalogous to the global i-quad coefficient, the global oquad coefficient can be defined as the fraction of outer-nodebased open quadriads that form quadrangles in the entire network:\nO = i∈V j∈N (i) k∈(N (j)−i) |N (k) ∩ N (i) − j| i∈V j∈N (i) k∈(N (j)−i) |N (k) − j − i| .(12)\nAs the equivalence between the global clustering coefficient and the global closure coefficient, this definition of global o-quad coefficient is actually not different from the global i-quad coefficient (Equation 9) since globally the difference of the position of the focal node will not arise. Revisiting the motivating example, Figure 4c gives a detailed table of the number of quadrangles Q(i), the number of inner-node-based open quadriads OQI(i) and the number of outer-node-based open quadriads OQO(i) of each node, based on which the i-quad coefficient I(i) and the o-quad coefficient O(i) are calculated. Also, the last row of this table gives the three network-level measures, i.e., the average i-quad coefficient, the average o-quad coefficient and the global i-quad/o-quad coefficient, which are more than 2.5 times larger than those metrics measuring triangles formation.\n\n\nQuadrangle coefficients in weighted networks\n\nUntil now, the discussion has been focused on binary networks, where the value of each link is either one or zero. In many networks, however, we need a more accurate representation of the relationships between nodes, such as the frequency of contact in a communication network, or the rating of a product given by a consumer in a recommender network, etc. This kind of information is usually expressed as a strength of the relationship and we use weighted networks to represent it. Therefore, we are interested in extending the two quadrangle coefficients to networks that allow for weights of the relationships.\n\nSeveral versions of weighted clustering coefficient have been proposed in order to measure triangle formation in weighted networks [24], [25], [26], [27]. For example, Onnela et al. [25] proposed to sum over the geometric averages of the three weights in formed triangles, divided by the number of potential triangles. Alternatively, Zhang and Horvath. [26] chose to sum simply over the products of the three weights in formed triangles, divided by the total of products of the two weights of all open triads, implying the triadic closing edges taking the maximum weight.\n\nAdopting a strategy similar to the one proposed by Zhang and Horvath [26], we introduce the weighted iquad coefficient and the weighted o-quad coefficient to measure quadrangles formation in weighted networks. Let G W = (V, E) be a weighted graph without self-loops and multiple edges. The weight of a link between any node i and j is denoted w ij (w ij ∈ [0, 1] after normalisation by the maximum weight). For any node i ∈ V , the weighted iquad coefficient, denoted as I W (i), and the weighted o-quad coefficient, denoted as O W (i), are defined as:\nI W (i) = j∈N (i) k∈(N (j)−i) l∈(N (i)∩N (k)−j) w ij w jk w il w lk j∈N (i) k∈(N (j)−i) l∈(N (i)−j−k) w ij w jk w il ,(13)O W (i) = j∈N (i) k∈(N (j)−i) l∈(N (i)∩N (k)−j) w ij w jk w il w lk j∈N (i) k∈(N (j)−i) l∈(N (k)−j−i) w ij w jk w kl .(14)\nWhen the graph becomes binary (unweighted), i.e., w ij = 1, the above two weighted quadrangle coefficients degrade to their unweighted versions (Equation 7 and Equation 10). The average weighted i-quad coefficient and the average weighted o-quad coefficient are then defined respectively as:\nI W = 1 |V | i∈V I W (i), O W = 1 |V | i∈V O W (i).\nWe can see from Figure 6 that in different weighted networks, the correlation of i-quad coefficient and weighted i-quad coefficient (and the correlation of o-quad coefficient and weighted o-quad coefficient) is also different. In other words, when weights are considered in calculating quadrangle coefficients, the weighted i-quad coefficient and the weighted o-quad coefficient capture different information compared to their unweighted counterparts.\n\n\nComputational cost\n\nAt the end of this section, we give a brief discussion about the computational efficiency of the above mentioned metrics. From Equation 7 and Equation 10, we can see that to compute the i-quad coefficient or the o-quad coefficient for a single node, the cost is O( k 3 ), where k is the average degree of the network. Therefore, the cost for computing the two coefficients for every node in a network is O(|V | · k 3 ). This might seem expensive. Fortunately, in most real-world networks, k is small, and therefore the computation of these proposed metrics is relatively fast in large networks.\n\n\nEXPERIMENTS AND ANALYSIS\n\nIn this section, we analyse the proposed quadrangle coefficients on different types of real-world networks and demonstrate their usage in some common applications 1 .\n\n1. Our code is available at https://github.com/MingshanJia/ explore-local-structure.\n\n\nQuadrangle coefficients in real-world networks\n\nDatasets. We run experiments on 16 networks of six categories: 1) Food webs. FLORIDADRY [30], [31] and LITTLE-ROCK [32]: energy transfer relationships collected from the cypress wetlands of South Florida and the Little Rock Lake of Wisconsin. Nodes represent species and an edge denotes that one species feeds on another (edge direction and weight are ignored). 2) Social networks. EMAILEU [33], [34]: a temporal email network from a European research institution (a temporal edge denotes that an email is exchanged between two persons at a certain time); CLGMSG [35]: temporal online message interactions between UCIrvine college students (a temporal edge means that a message is exchanged between two students at a certain time); BTCALPHA [36]: a temporal whotrusts-whom network of users on a Bitcoin trading platform Bitcoin Alpha (edge direction and weight are ignored); TWITCHFR [37]: a network of gamers who stream in French, where nodes are the users and edges are mutual friendships between them. 3) Protein-protein interaction networks. STELZL [38], FIGEYS [39], VIDAL [40] and INTACT [41]: four networks of interactions between proteins in Homo sapiens. Nodes represent proteins and an edge denotes the physical contact between two proteins in the cell. 4) Citation networks. DBLP [42] and CORA [43]: two academic publication citation networks. DBLP contains temporal information on edges. Nodes represent papers, and an edge means that one paper cites another paper (direction is ignored). 5) Infrastructure networks. RD-NEWYORK and RD-BAYAREA [31]: two road networks for New York City and San Francisco Bay Area. Nodes represent intersections and endpoints, and the roads connecting them are represented by edges. 6) Q&A networks. MATHOVFL. and ASKUBUNTU [33]: two temporal Q&A networks derived from Stack Exchange. Nodes represent users, and a temporal edge means that one user answers another user's question at a certain time (edge direction is ignored).\n\nObservations. Table 1 lists some key statistics including the proposed coefficients of these networks. We observe that in most types of networks (except road networks), the average o-quad coefficient is smaller than the average iquad coefficient. That is to say, for the majority of nodes in these types of networks, fewer quadrangles are built from the outer-node-based open quadriads, compared to the number of quadrangles constructed from the inner-nodebased open quadriads. This phenomenon is better revealed through the cumulative distribution function (Figure 7): the CDF curve of the o-quad coefficient is above that of the iquad coefficient when the coefficient value is small (except in RD-NEWYORK).\n\nWe can also observe that in all food webs, two PPI networks (PPI-STELZL and PPI-FIGEYS) and all road networks, the average i-quad coefficient is larger than the  1 Statistics of datasets, showing the number of nodes (|V |), the number of edges (|E|), the average degree ( k ), the average clustering coefficient (C), the average closure coefficient (E), the average i-quad coefficient (I) and the average o-quad coefficient (O). In order to facilitate comparison, the last four columns give the quotient of C and E, the quotient of I and O, the quotient of I and C, and the quotient of O and E respectively. Datasets having timestamps on edge creation are superscripted by (τ ).  average clustering coefficient (I > C); and the average oquad coefficient is larger than the average closure coefficient (O > E). In other words, these networks are more inclined to form quadrangles than to form triangles, which leads us to the following experiments.\n\n\nNetwork\n\n\nCorrelation with node degree\n\nSince node degree is one of the most important and widely used concepts in network science, we study how the two quadrangle coefficients vary with it. We start by conducting an empirical analysis in real networks, followed by a theoretical justification under the degree-preserving random graph model. We choose one network in each category and plot the correlation of quadrangle coefficients and degree (Figure 8). We observe a strong positive correlation between the o-quad coefficient and the node degree: the average o-quad coefficient is small among nodes with small degree and becomes larger as the average node degree increases. In contrast, the correlation between the i-quad coefficient and the degree is weak: the average i-quad coefficient is large (compared to the average o-quad coefficient) when the average node degree is small and does not change too much as the average degree increases. Since most real-world networks are scalefree and exhibit heavy-tailed degree distribution, it also explains why the average i-quad coefficient is bigger than the average o-quad coefficient in most networks studied in our work (Table 1).\n\nTo better understand the correlation between the quadrangle coefficients and the node degree, we give a theoretical explanation under the configuration model [44]. Constrained by a given degree sequence, the configuration model generates a network by placing edges between nodes uniformly at random. This can be achieved through a stubmatching process, in which the probability of forming an edge between node i and node j equals d i ·d j /2m (assuming d 2 i 2m for all i). Now we give the following proposition. chosen with probability proportional to its degree. As n → ∞, for any node i ∈ V , its local i-quad coefficient satisfies:\nE[I(i)] = (k − 1) 2 2m ,\nand its local o-quad coefficient satisfies:\nE[O(i)] = (d i − 1) · (k − 1) 2m .\n\nProof.\n\nFor any open quadriad with node i as an inner node, we denote one outer node by k and another outer node by l (Figure 9a). The probability that this open quadriad is closed equals the probability of having an edge between node k and l, which is (d k − 1) (d l − 1) /2m in the configuration mode. The reason of subtracting 1 from d k and d l is that one stub of node k (and node l) has already been used in forming the open quadriad. Now, we show that as n → ∞, E [d k ] = E [d l ] =k. Via stub matching, any node, other than node i and j, can form an edge with node j and thus become one outer node of the open quadriad. The probability of node k being this node is proportional to its degree, which is\nd k k∈V,k =i,j d k . Therefore, we have E [d k ] = k∈V,k =i,j d k · d k k∈V,k =i,j d k . When n → ∞, E [d k ] = k∈V d k · d k k∈V d k =k. Similarly, we have E [d l ] =k.\nIn short, we have:\nE[I(i)] = E [(d k − 1) (d l − 1) /(2m)] = (E [d k ] − 1) · (E [d l ] − 1) 2m = (k − 1) 2 2m .\n(a). Node i as an inner node (b). Node i as an outer node i j k l i j k l Fig. 9. Two types of quadrangle formation via stub matching. (a) Quadrangle is potentially formed with the focal node i acting as the inner node. The closing edge is between node k and l. (b) Quadrangle is potentially formed with the focal node i acting as the outer node. The closing edge is between node i and l.\n\nLikewise, for any open quadriad with node i as an outer node, we denote the other outer node by l (Figure 9b). And we have:\nE[O(i)] = E [(d i − 1) (d l − 1) /(2m)] = (d i − 1) · (E [d l ] − 1) 2m = (d i − 1) · (k − 1) 2m .\nAlthough Proposition 1 is given under the configuration model, we see from Figure 8 that this property is well preserved in most real-world networks. Only that in road networks, i.e., RD-NEWYORK and RD-BAYAREA, the average i-quad coefficient and the average o-quad coefficient are very similar (Table 1), and they exhibit similar correlations with node degree. This is because the variance of node degree is extremely small (less than one) in this type of network, resulting in d i close tok, and thus E[O(i)] close to E[I(i)].\n\n\nNetwork classification\n\nIn this section, we exhibit how useful the proposed quadrangle coefficients are in classifying different types of networks. Previous works have shown that normalized number of triads and triangles (triad significance profile [45] and clustering signatures [46]) are effective attributes in a network classification task. It motivated us to use the two quadrangle coefficients in the network classification, as they represent a normalized number of quadrangles.\n\nWe can see in Table 1 that the quotient of the average iquad coefficient and the average clustering coefficient (I/C), and the quotient of the average o-quad coefficient and the average closure coefficient (O/E) are contrasting in different types of networks. It is intuitive to expect the two quadrangle coefficients will be able to add useful discriminative information to a set of features, in addition to the average clustering coefficient and the average closure coefficient, for improving of the network classification accuracy. Setup. We first prepare the data by choosing five features from the networks, i.e., the average node degree k , the average clustering coefficient C, the average closure coefficient E, the average i-quad coefficient I, and the average o-quad coefficient O. Then we employ a K-means clustering algorithm to partition all 16 networks of our dataset into 6 clusters. The initial centroids are chosen randomly, and we repeat the algorithm with different set of initial centroids for 1000 times, returning the best result in terms of V-measure score [47]. Maximum number of iterations for a single run is set to 300. To compare, we use the same setting to run the experiment, but with only three features, i.e., without the two quadrangle coefficients. Results and discussion. The classification results measured in homogeneity, completeness and V-measure score are given in Table 2. Homogeneity measures whether the samples of a single class belonging to a single cluster; Completeness measures whether all members of a class are assigned to the same cluster; V-measure score is the harmonic mean of the Homogeneity and Completeness. We observe significant improvement (more than 10% in homogeneity and V-measure score, nearly 15% in completeness score) after adding the two quadrangle coefficients. In order to better analyse the results, we adopt the Principal Component Analysis algorithm to compress the data to a two-dimensional space, and thus visualise the classification results ( Figure 10). We can see from Figure 10(a) that with the two quadrangle coefficients, the labellings of food webs (cluster 1), PPI networks (cluster 3), road networks (cluster 2) and QA networks (cluster 6) are perfect. The model only cannot properly partition social networks from citation networks (cluster 5 contains three social networks and two citation networks while cluster 4 has only one social network -SOC-EMAILEU). In contrast, when the quadrangle coefficients are excluded from the model, the majority of data points are congregated at the left part of the space, resulting in worse classification result, as shown in Figure 10(b). Only two types of networks are labelled perfectly (food webs in cluster 2 and QA networks in cluster 5). The remaining four types of networks are poorly clustered, especially in cluster 3 which contains data points of all four categories. This experiment shows that adding quadrangle coefficients improves significantly the ability to tell apart different types of real-world networks, especially for these rich in quadrangles.\n\n\nLink prediction\n\nAs two new metrics measuring quadrangle formation, the i-quad coefficient and the o-quad coefficient provide additional topological features for a node-level network analysis and inference. As an example, we show their utilities in missing link prediction, where significant improvement is brought by adding them.\n\nMany studies have shown that common neighbours index and its variations such as Adamic-Adar index and resource allocation index perform well in the link prediction problem [48], [49], [50]. Besides, the clustering coefficient and the closure coefficient are proven to be useful features to improve the performance [17], [51]. Therefore, we use these five features as the baseline features in our prediction model, and then test the performance by adding the proposed iquad and o-quad coefficients. XGBoost, the gradient boosted trees, is used as the prediction model due to its speed and performance. Setup. We model a network as a graph G = (V, E). For networks having timestamps on edges, we order the edges according to their appearing times and select the first 70% edges and related nodes to form an \"old graph\", denoted G old = (V * , E old ). For networks not having timestamps, we randomly shuffle the edges then perform the partition, and we repeat 100 times in order to assess variance and reduce the impact of a single partition on the possible conclusions. The remaining 30% edges filtered by node set V * will form a \"new graph\", denoted G new = (V * , E new ). The test set is built by node pairs, that appear in the old graph, but do not TABLE 3 Test set performance comparison measured in ROC-AUC score of four XGBoost models with different features. Second column lists the scores with baseline features (BL) , third column adds i-quad coefficient to baseline features, fourth column adds o-quad coefficient to baseline features, and fifth column adds both i-quad and o-quad coefficients to baseline features. An improvement of more than 2% is put in bold type, and an improvement of more than 5% is indicated by dagger. Last row gives the average (over the datasets) ranking of the four models for comparison, where smaller is better. A model receives rank 1 if it has the highest ROC-AUC score, rank 2 if it has the second highest, and so on. If two models share the best score, they both get rank 1.5, and so on. The best ranking is put in bold italic. form a link. Each such pair of nodes indicates a positive or a negative example depending on whether a link between them appears in the new graph. The training set is built on the old graph, on which we fit four XGBoost models with four sets of features: 1) baseline feature set which includes common neighbours, Adamic-Adar, resource allocation, clustering coefficient and closure coefficient; 2) baseline features plus i-quad coefficient; 3) baseline features plus o-quad coefficient; 4) baseline features plus both i-quad coefficient and o-quad coefficients. Then we evaluate their prediction performances on the test set. For large networks (|V | > 10K), we perform a randomised breadth first search sampling [52] of 3K nodes on the original graph and repeat 10 times. Results and discussion. Since a network link prediction is a highly unbalanced task, we choose ROC-AUC score as the metric and report the prediction result on the test set, as shown in Table 3. First, we discover that adding only iquad (3 rd column) or o-quad coefficient (4 th column) leads to improvement in most networks (except SOC-EMAILEU and CIT-DBLP when i-quad is added, and QA-MATHOVFL. when o-quad is added). And when both of the quadrangle coefficients are added to the baseline features (5 th column), the performance is improved in all networks. The average ranking (last row) also shows that adding both i-quad and o-quad coefficients at the same time leads to the best i = 0.67 = 0.67 = 0.33 = 0.5 = 1.0 Fig. 11. An example of all five coefficients measuring quadrangle formation for node i. H(i) is the higher order clustering coefficient proposed by Fronczak et al. [53]; S L (i) is the square clustering coefficient proposed by Lind et al. [54]; S Z (i) is another square clustering coefficient proposed by Zhang et al. [55]; I(i) and O(i) are the two quadrangle coefficients proposed by us.\n\nperformance overall.\n\nSecond, we find that the improvement is particularly significant in food webs, protein-protein networks and road networks (more than 2% in all eight networks of these three types, and more than 5% in five networks when both quadrangle coefficients are added). The common characteristic of these types of networks is that they tend to have larger quadrangle coefficients compared to the clustering and closure coefficients. Also, we notice that only adding o-quad coefficient has better performance than only adding i-quad coefficient in most networks (except in two Q&A networks), which is an interesting phenomenon for further study.\n\n\nADDITIONAL RELATED WORK\n\nWe now recapitulate some additional related works that proposed other metrics to measure quadrangle formations in networks. Fronczak et al. [53] proposed a higher order clustering coefficient for random networks. It is defined as C i (x) = 2Ei(x) ki(ki−1) , where i is the focal node and x is the length of path. E i (x) denotes the number of x-length paths between the neighbours of i. When x equals 2, this definition deals with the formation of quadrangles. The limitation of this definition is that the normalisation only takes the degree of the focal node i into account while neglects the degree of i's neighbours. Since each pair of neighbours could have multiple length-2 paths between them, the clustering value can be larger than one.\n\nLind et al. [54] later proposed a square clustering coefficient in the context of bipartite networks by taking into consideration the degree of the neighbours, in other words, the length-2 paths starting from the focal node. It is defined as C 4,mn (i) = qimn (km−ηimn)(kn−ηimn)+qimn , where m and n are a pair of neighbours of the focal node i, and q imn denotes the number of squares containing the three nodes. What is uncommon about this definition is that it deems squares are formed via node overlapping, which is not a standard approach. Zhang et al. [55] then modified the equation and proposed another more standard square clustering coefficient for bipartite networks. Their definition is: C 4,mn (i) = qimn (km−ηimn)+(kn−ηimn)+qimn . However, in both of these definitions, there is no notion of open quadriad introduced, and the normalisation is thus based on the number of squares.\n\nOur proposed i-quad and o-quad coefficients are different from the previous works in that 1) the scope of the o-quad coefficient is larger since it takes into account length-3 paths emanating from the focal node, whereas the square clustering coefficients only calculates length-2 paths in the normalisation; 2) the two coefficients proposed by us view a formed quadrangle as being built from two open quadriads, which conform with the classic clustering and closure coefficients (in their definitions a formed triangle is viewed as being built from open triads); 3) the two quadrangle coefficients are proposed for the general unipartite networks on which multiple experiments are conducted. In Figure 11, we provide a small example to illustrate the three coefficients proposed by previous works and the two quadrangle coefficients proposed by us.\n\n\nCONCLUSION\n\nIn this paper, we introduced the i-quad coefficient and the o-quad coefficient to measure quadrangle formation in networks, according to the different location of the focal node in an open quadriad. We also extended them to weighed networks. Through experiments on 16 real-world networks from six domains, we revealed that 1) in most types of networks, the average o-quad coefficient is smaller than the average i-quad coefficient; 2) in food webs, protein-protein interaction networks and road networks, the i-quad and oquad coefficients are larger than the clustering and closure coefficients respectively; 3) the o-quad coefficient tends to increase with node degree while the i-quad coefficient does not change too much as the node degree increases.\n\nWe also demonstrated that including the two coefficients leads to improvement in both network-level and node-level analysis tasks, such as network classification and link prediction. The improvement is especially significant in food webs, protein-protein networks and road networks in link prediction task. Additionally, we plan to further consider the dynamics of time-varying networks and link directions of directed networks when measuring quadrangle formation in the future. Due to the simplicity and interpretability in the definitions, we anticipate that the i-quad and o-quad coefficients will become standard descriptive features and be incorporated in other network mining tasks.\n\n•Fig. 1 .\n1M. Jia, B. Gabrys and K. Musial are with the School of Computer Science, University of Technology Sydney, Ultimo NSW 2007, Australia. E-mail: mingshan.jia@student.uts.edu.au, {bogdan.gabrys, katarzyna.musial-gabrys}@uts.edu.au (b). clustering coefficient (c)The i-quad coefficient and the o-quad coefficient in comparison with the clustering coefficient and the closure coefficient. Letters c, e, i and o denote centre node, end node, inner node and outer node respectively. Node in green colour is the focal node in each subfigure. Number on node indicates the node's distance from the focal node in the open triad or the open quadriad, which might be closed by an edge in dotted green line style.\n\nFig. 2 .\n2An example of the i-quad coefficient and the o-quad coefficient in a movie recommender network. Circle nodes represent users, and square nodes represent movies. Node x 1 , marked in green, is the focal node. Four nodes and three solid links form an open quadriad, which if is closed by a dotted link will form a quadrangle.\n\nFig. 3 .\n3Two types of open triads in triangle formation. Among three nodes i, j and k, node i, painted in green, is the focal node.triangle contains two open triads with i as the end node. When a triangle is actually formed, the focal node can be viewed as the centre node in one open triad or as the end node in two open triads (Figure 3). Obviously, E(i) ∈ [0, 1].\n\nFig. 4 .\n4A motivating example.\n\nFig. 5 .\n5Two types of open quadriads in a quadrangle. Node i, depicted in green, is the focal node, among four nodes i, j, k and l.\n\nFig. 6 .\n6Correlation of quadrangle coefficients and weighted quadrangle coefficients in three different networks. First row is the correlation of i-quad coefficient I(i) and weighted i-quad coefficient I W (i), second row is the correlation of o-quad coefficient O(i) and weighted o-quad coefficient O W (i). The weighted networks are: (1) the neural network of the Caenorhabditis elegans worm[12]; (2) the network of the 500 busiest commercial airports in the United States[28]; (3) the social network of online community for students at University of California, Irvine[29].\n\nFig. 7 .\n7Cumulative distribution curve of the i-quad coefficient I(i) (in green colour) and the o-quad coefficient O(i) (in purple colour) in six real-world networks of different types.\n\nProposition 1 .Fig. 8 .\n18Let V be a set of n nodes with specific degrees d 1 , d 2 , ..., d n , on which graph G is generated from the configuration model.Let m = 1 2 n i=1 d i denote the number of edges andk = ( i d 2 i )/( i d i )be the expected degree when a node is Correlation of two quadrangle coefficients with node degree in six real-world networks. Nodes are grouped into logarithmic bins in ascending order by degree, then average i-quad and o-quad coefficients are calculated in each bin.\n\nFig. 10 .\n10Two-dimensional visualisation of K-means clustering on PCA-reduced data, with and without quadrangle coefficients (left figure and right figure respectively). Six clusters are labelled from 1 to 6, and painted in sequential colours. Centroids of clusters are marked as black crosses. Data points are plotted in different shapes and colours representing their ground truth categories, as shown in the legend.\n\nTABLE\n\n\nTABLE 2\n2Homogeneity (Homo.), completeness (Compl.) and V-measure score of the K-means clustering on 16 real-world networks, with and without the quadrangle coefficients (first row and second row respectively).Features \nHomo. \nCompl. \nV-measure \n\nwith quadrangle coefs. \n0.810 \n0.879 \n0.826 \n\nwithout quadrangle coefs. \n0.731 \n0.766 \n0.745 \n\n\nACKNOWLEDGMENTSThis work was supported by the Australian Research Council, grant No. DP190101087: \"Dynamics and Control of Complex Social Networks\".\nNetwork science. A.-L Barabási, Cambridge university pressA.-L. Barabási et al., Network science. Cambridge university press, 2016.\n\n. M Newman, Networks, Oxford university pressM. Newman, Networks. Oxford university press, 2018.\n\nSocial networks on the internet. K Musiał, P Kazienko, World Wide Web. K. Musiał and P. Kazienko, \"Social networks on the internet,\" World Wide Web, 2013.\n\nRepresentation learning on graphs: Methods and applications. W L Hamilton, R Ying, J Leskovec, arXiv:1709.05584arXiv preprintW. L. Hamilton, R. Ying, and J. Leskovec, \"Representation learning on graphs: Methods and applications,\" arXiv preprint arXiv:1709.05584, 2017.\n\nnode2vec: Scalable feature learning for networks. A Grover, J Leskovec, KDD. A. Grover and J. Leskovec, \"node2vec: Scalable feature learning for networks,\" in KDD, 2016.\n\nNode classification in social networks. S Bhagat, G Cormode, S Muthukrishnan, Social network data analytics. SpringerS. Bhagat, G. Cormode, and S. Muthukrishnan, \"Node classifica- tion in social networks,\" in Social network data analytics. Springer, 2011.\n\nSemi-supervised classification with graph convolutional networks. T N Kipf, M Welling, arXiv:1609.02907arXiv preprintT. N. Kipf and M. Welling, \"Semi-supervised classification with graph convolutional networks,\" arXiv preprint arXiv:1609.02907, 2016.\n\nLink prediction methods and their accuracy for different social networks and network metrics. F Gao, K Musial, C Cooper, S Tsoka, Scientific programmingF. Gao, K. Musial, C. Cooper, and S. Tsoka, \"Link prediction methods and their accuracy for different social networks and network metrics,\" Scientific programming, 2015.\n\nNetwork-based prediction of protein interactions. I A Kovács, K Luck, K Spirohn, Y Wang, C Pollis, S Schlabach, W Bian, D.-K Kim, N Kishore, T Hao, Nature communications. I. A. Kovács, K. Luck, K. Spirohn, Y. Wang, C. Pollis, S. Schlabach, W. Bian, D.-K. Kim, N. Kishore, T. Hao et al., \"Network-based prediction of protein interactions,\" Nature communications, 2019.\n\nGraph-based anomaly detection. C C Noble, D J Cook, KDD. C. C. Noble and D. J. Cook, \"Graph-based anomaly detection,\" in KDD, 2003.\n\nGraph based anomaly detection and description: a survey. L Akoglu, H Tong, D Koutra, Data mining and knowledge discovery. L. Akoglu, H. Tong, and D. Koutra, \"Graph based anomaly detection and description: a survey,\" Data mining and knowledge discovery, 2015.\n\nCollective dynamics of 'smallworld'networks. D J Watts, S H Strogatz, nature. D. J. Watts and S. H. Strogatz, \"Collective dynamics of 'small- world'networks,\" nature, 1998.\n\nClustering in complex directed networks. G Fagiolo, Physical Review E. G. Fagiolo, \"Clustering in complex directed networks,\" Physical Review E, 2007.\n\nAutomatic malware mutant detection and group classification based on the n-gram and clustering coefficient. T Lee, B Choi, Y Shin, J Kwak, The Journal of Supercomputing. T. Lee, B. Choi, Y. Shin, and J. Kwak, \"Automatic malware mu- tant detection and group classification based on the n-gram and clustering coefficient,\" The Journal of Supercomputing, 2018.\n\nThe influence of clustering coefficient on word-learning: how groups of similar sounding words facilitate acquisition. R Goldstein, M S Vitevitch, Frontiers in psychology. R. Goldstein and M. S. Vitevitch, \"The influence of clustering coefficient on word-learning: how groups of similar sounding words facilitate acquisition,\" Frontiers in psychology, 2014.\n\nRolx: structural role extraction & mining in large graphs. K Henderson, B Gallagher, T Eliassi-Rad, H Tong, S Basu, L Akoglu, D Koutra, C Faloutsos, L Li, KDD. K. Henderson, B. Gallagher, T. Eliassi-Rad, H. Tong, S. Basu, L. Akoglu, D. Koutra, C. Faloutsos, and L. Li, \"Rolx: structural role extraction & mining in large graphs,\" in KDD, 2012.\n\nThe local closure coefficient: A new perspective on network clustering. H Yin, A R Benson, J Leskovec, WSDM. H. Yin, A. R. Benson, and J. Leskovec, \"The local closure coeffi- cient: A new perspective on network clustering,\" in WSDM, 2019.\n\nNetwork motifs: simple building blocks of complex networks. R Milo, S Shen-Orr, S Itzkovitz, N Kashtan, D Chklovskii, U Alon, Science. R. Milo, S. Shen-Orr, S. Itzkovitz, N. Kashtan, D. Chklovskii, and U. Alon, \"Network motifs: simple building blocks of complex networks,\" Science, 2002.\n\nThe network nature of over-the-counter interest rates. E Rainone, Journal of Financial Markets. E. Rainone, \"The network nature of over-the-counter interest rates,\" Journal of Financial Markets, 2020.\n\nUsing collaborative filtering to weave an information tapestry. D Goldberg, D Nichols, B M Oki, D Terry, Communications of the ACM. D. Goldberg, D. Nichols, B. M. Oki, and D. Terry, \"Using collabo- rative filtering to weave an information tapestry,\" Communications of the ACM, 1992.\n\nA survey of collaborative filtering techniques. X Su, T M Khoshgoftaar, Advances in artificial intelligence. X. Su and T. M. Khoshgoftaar, \"A survey of collaborative filtering techniques,\" Advances in artificial intelligence, 2009.\n\nRandom graphs with arbitrary degree distributions and their applications. M E Newman, S H Strogatz, D J Watts, Physical review E. M. E. Newman, S. H. Strogatz, and D. J. Watts, \"Random graphs with arbitrary degree distributions and their applications,\" Physi- cal review E, 2001.\n\nSome problems related to the food chain in a tropical estuary. S Qasim, Marine food chains. S. Qasim, \"Some problems related to the food chain in a tropical estuary,\" Marine food chains, 1970.\n\nThe architecture of complex weighted networks. A Barrat, M Barthelemy, R Pastor-Satorras, A Vespignani, PNASA. Barrat, M. Barthelemy, R. Pastor-Satorras, and A. Vespignani, \"The architecture of complex weighted networks,\" PNAS, 2004.\n\nIntensity and coherence of motifs in weighted complex networks. J.-P Onnela, J Saramäki, J Kertész, K Kaski, Physical Review E. J.-P. Onnela, J. Saramäki, J. Kertész, and K. Kaski, \"Intensity and coherence of motifs in weighted complex networks,\" Physical Review E, 2005.\n\nA general framework for weighted gene co-expression network analysis. B Zhang, S Horvath, Statistical applications in genetics and molecular biology. B. Zhang and S. Horvath, \"A general framework for weighted gene co-expression network analysis,\" Statistical applications in genetics and molecular biology, 2005.\n\nGeneralizations of the clustering coefficient to weighted complex networks. J Saramäki, M Kivelä, J.-P Onnela, K Kaski, J Kertesz, Physical Review E. J. Saramäki, M. Kivelä, J.-P. Onnela, K. Kaski, and J. Kertesz, \"Generalizations of the clustering coefficient to weighted complex networks,\" Physical Review E, 2007.\n\nReactiondiffusion processes and metapopulation models in heterogeneous networks. V Colizza, R Pastor-Satorras, A Vespignani, Nature Physics. V. Colizza, R. Pastor-Satorras, and A. Vespignani, \"Reaction- diffusion processes and metapopulation models in heterogeneous networks,\" Nature Physics, 2007.\n\nClustering in weighted networks. T Opsahl, P Panzarasa, Social networks. T. Opsahl and P. Panzarasa, \"Clustering in weighted networks,\" Social networks, 2009.\n\nNetwork analysis of trophic dynamics in south florida ecosystems. R E Ulanowicz, D L Deangelis, US Geological Survey Program on the South Florida EcosystemR. E. Ulanowicz and D. L. DeAngelis, \"Network analysis of trophic dynamics in south florida ecosystems,\" US Geological Survey Pro- gram on the South Florida Ecosystem, 1999.\n\nKonect: the koblenz network collection. J Kunegis, Proceedings of the 22nd International Conference on World Wide Web. the 22nd International Conference on World Wide WebJ. Kunegis, \"Konect: the koblenz network collection,\" in Proceed- ings of the 22nd International Conference on World Wide Web, 2013.\n\nArtifacts or attributes? effects of resolution on the little rock lake food web. N D Martinez, Ecological monographs. N. D. Martinez, \"Artifacts or attributes? effects of resolution on the little rock lake food web,\" Ecological monographs, 1991.\n\nMotifs in temporal networks. A Paranjape, A R Benson, J Leskovec, WSDM. A. Paranjape, A. R. Benson, and J. Leskovec, \"Motifs in temporal networks,\" in WSDM, 2017.\n\nSnap: A general-purpose network analysis and graph-mining library. J Leskovec, R Sosič, ACM Transactions on Intelligent Systems and Technology. TISTJ. Leskovec and R. Sosič, \"Snap: A general-purpose network analysis and graph-mining library,\" ACM Transactions on Intelligent Systems and Technology (TIST), 2016.\n\nPatterns and dynamics of users' behavior and interaction: Network analysis of an online community. P Panzarasa, T Opsahl, K M Carley, Journal of the American Society for Information Science and Technology. P. Panzarasa, T. Opsahl, and K. M. Carley, \"Patterns and dynamics of users' behavior and interaction: Network analysis of an online community,\" Journal of the American Society for Information Science and Technology, 2009.\n\nRev2: Fraudulent user prediction in rating platforms. S Kumar, B Hooi, D Makhija, M Kumar, C Faloutsos, V Subrahmanian, WSDM. S. Kumar, B. Hooi, D. Makhija, M. Kumar, C. Faloutsos, and V. Subrahmanian, \"Rev2: Fraudulent user prediction in rating platforms,\" in WSDM, 2018.\n\nMulti-scale attributed node embedding. B Rozemberczki, C Allen, R Sarkar, arXiv:1909.13021arXiv preprintB. Rozemberczki, C. Allen, and R. Sarkar, \"Multi-scale attributed node embedding,\" arXiv preprint arXiv:1909.13021, 2019.\n\nA human protein-protein interaction network: a resource for annotating the proteome. U Stelzl, U Worm, M Lalowski, C Haenig, F H Brembeck, H Goehler, M Stroedicke, M Zenkner, A Schoenherr, S Koeppen, Cell. U. Stelzl, U. Worm, M. Lalowski, C. Haenig, F. H. Brembeck, H. Goehler, M. Stroedicke, M. Zenkner, A. Schoenherr, S. Koeppen et al., \"A human protein-protein interaction network: a resource for annotating the proteome,\" Cell, 2005.\n\nLarge-scale mapping of human protein-protein interactions by mass spectrometry. R M Ewing, P Chu, F Elisma, H Li, P Taylor, S Climie, L Mcbroom-Cerajewski, M D Robinson, L O&apos;connor, M Li, Molecular systems biologyR. M. Ewing, P. Chu, F. Elisma, H. Li, P. Taylor, S. Climie, L. McBroom-Cerajewski, M. D. Robinson, L. O'Connor, M. Li et al., \"Large-scale mapping of human protein-protein interactions by mass spectrometry,\" Molecular systems biology, 2007.\n\nTowards a proteome-scale map of the human protein-protein interaction network. J.-F Rual, K Venkatesan, T Hao, T Hirozane-Kishikawa, A Dricot, N Li, G F Berriz, F D Gibbons, M Dreze, N Ayivi-Guedehoussou, Nature. J.-F. Rual, K. Venkatesan, T. Hao, T. Hirozane-Kishikawa, A. Dri- cot, N. Li, G. F. Berriz, F. D. Gibbons, M. Dreze, N. Ayivi- Guedehoussou et al., \"Towards a proteome-scale map of the hu- man protein-protein interaction network,\" Nature, 2005.\n\nThe mintact project-intact as a common curation platform for 11 molecular interaction databases. S Orchard, M Ammari, B Aranda, L Breuza, L Briganti, F Broackes-Carter, N H Campbell, G Chavali, C Chen, N Del-Toro, Nucleic acids research. S. Orchard, M. Ammari, B. Aranda, L. Breuza, L. Briganti, F. Broackes-Carter, N. H. Campbell, G. Chavali, C. Chen, N. Del- Toro et al., \"The mintact project-intact as a common curation platform for 11 molecular interaction databases,\" Nucleic acids research, 2014.\n\nThe dblp computer science bibliography: Evolution, research issues, perspectives. M Ley, International symposium on string processing and information retrieval. SpringerM. Ley, \"The dblp computer science bibliography: Evolution, research issues, perspectives,\" in International symposium on string processing and information retrieval. Springer, 2002.\n\nModel of complex networks based on citation dynamics. L Šubelj, M Bajec, Proceedings of the 22nd international conference on World Wide Web. the 22nd international conference on World Wide WebL.Šubelj and M. Bajec, \"Model of complex networks based on citation dynamics,\" in Proceedings of the 22nd international conference on World Wide Web, 2013.\n\nConfiguring random graph models with fixed degree sequences. B K Fosdick, D B Larremore, J Nishimura, J Ugander, SIAM Review. B. K. Fosdick, D. B. Larremore, J. Nishimura, and J. Ugander, \"Configuring random graph models with fixed degree sequences,\" SIAM Review, 2018.\n\nSuperfamilies of evolved and designed networks. R Milo, S Itzkovitz, N Kashtan, R Levitt, S Shen-Orr, I Ayzenshtat, M Sheffer, U Alon, Science. R. Milo, S. Itzkovitz, N. Kashtan, R. Levitt, S. Shen-Orr, I. Ayzen- shtat, M. Sheffer, and U. Alon, \"Superfamilies of evolved and designed networks,\" Science, 2004.\n\nClustering signatures classify directed networks. S E Ahnert, T M Fink, Physical Review E. S. E. Ahnert and T. M. Fink, \"Clustering signatures classify di- rected networks,\" Physical Review E, 2008.\n\nV-measure: A conditional entropy-based external cluster evaluation measure. A Rosenberg, J Hirschberg, EMNLP-CoNLL. A. Rosenberg and J. Hirschberg, \"V-measure: A conditional entropy-based external cluster evaluation measure,\" in EMNLP- CoNLL, 2007.\n\nJournal of the American society for information science and technology. D Liben-Nowell, J Kleinberg, The link-prediction problem for social networksD. Liben-Nowell and J. Kleinberg, \"The link-prediction problem for social networks,\" Journal of the American society for information science and technology, 2007.\n\nFriends and neighbors on the web. L A Adamic, E Adar, Social networks. L. A. Adamic and E. Adar, \"Friends and neighbors on the web,\" Social networks, 2003.\n\nPredicting missing links via local information. T Zhou, L Lü, Y.-C Zhang, The European Physical Journal B. T. Zhou, L. Lü, and Y.-C. Zhang, \"Predicting missing links via local information,\" The European Physical Journal B, 2009.\n\nLink prediction using supervised learning. M Hasan, V Chaoji, S Salem, M Zaki, SDM06: workshop on link analysis, counter-terrorism and security. M. Al Hasan, V. Chaoji, S. Salem, and M. Zaki, \"Link prediction using supervised learning,\" in SDM06: workshop on link analysis, counter-terrorism and security, 2006.\n\nMetric convergence in social network sampling. C Doerr, N Blenn, Proceedings of the 5th ACM workshop on HotPlanet. the 5th ACM workshop on HotPlanetC. Doerr and N. Blenn, \"Metric convergence in social network sampling,\" in Proceedings of the 5th ACM workshop on HotPlanet, 2013.\n\nHigher order clustering coefficients in barabási-albert networks. A Fronczak, J A Hołyst, M Jedynak, J Sienkiewicz, Physica A: Statistical Mechanics and its Applications. A. Fronczak, J. A. Hołyst, M. Jedynak, and J. Sienkiewicz, \"Higher order clustering coefficients in barabási-albert networks,\" Physica A: Statistical Mechanics and its Applications, 2002.\n\nCycles and clustering in bipartite networks. P G Lind, M C Gonzalez, H J Herrmann, Physical review E. P. G. Lind, M. C. Gonzalez, and H. J. Herrmann, \"Cycles and clustering in bipartite networks,\" Physical review E, 2005.\n\nClustering coefficient and community structure of bipartite networks. P Zhang, J Wang, X Li, M Li, Z Di, Y Fan, Physica A: Statistical Mechanics and its Applications. P. Zhang, J. Wang, X. Li, M. Li, Z. Di, and Y. Fan, \"Clustering co- efficient and community structure of bipartite networks,\" Physica A: Statistical Mechanics and its Applications, 2008.\n", "annotations": {"author": "[{\"end\":94,\"start\":67},{\"end\":101,\"start\":95}]", "publisher": null, "author_last_name": "[{\"end\":93,\"start\":67},{\"end\":100,\"start\":95}]", "author_first_name": null, "author_affiliation": null, "title": "[{\"end\":51,\"start\":1},{\"end\":152,\"start\":102}]", "venue": null, "abstract": "[{\"end\":1698,\"start\":282}]", "bib_ref": "[{\"attributes\":{\"ref_id\":\"b0\"},\"end\":1899,\"start\":1896},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":1904,\"start\":1901},{\"attributes\":{\"ref_id\":\"b2\"},\"end\":1909,\"start\":1906},{\"attributes\":{\"ref_id\":\"b3\"},\"end\":2263,\"start\":2260},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":2268,\"start\":2265},{\"attributes\":{\"ref_id\":\"b5\"},\"end\":2298,\"start\":2295},{\"attributes\":{\"ref_id\":\"b6\"},\"end\":2303,\"start\":2300},{\"attributes\":{\"ref_id\":\"b7\"},\"end\":2324,\"start\":2321},{\"attributes\":{\"ref_id\":\"b8\"},\"end\":2329,\"start\":2326},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":2356,\"start\":2352},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":2362,\"start\":2358},{\"attributes\":{\"ref_id\":\"b11\"},\"end\":2502,\"start\":2498},{\"attributes\":{\"ref_id\":\"b12\"},\"end\":2508,\"start\":2504},{\"attributes\":{\"ref_id\":\"b13\"},\"end\":3027,\"start\":3023},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":3051,\"start\":3047},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":3086,\"start\":3082},{\"attributes\":{\"ref_id\":\"b16\"},\"end\":3208,\"start\":3204},{\"attributes\":{\"ref_id\":\"b16\"},\"end\":3867,\"start\":3863},{\"attributes\":{\"ref_id\":\"b17\"},\"end\":4013,\"start\":4009},{\"end\":4223,\"start\":4220},{\"attributes\":{\"ref_id\":\"b18\"},\"end\":4898,\"start\":4894},{\"attributes\":{\"ref_id\":\"b19\"},\"end\":6272,\"start\":6268},{\"attributes\":{\"ref_id\":\"b20\"},\"end\":6278,\"start\":6274},{\"attributes\":{\"ref_id\":\"b11\"},\"end\":9696,\"start\":9692},{\"attributes\":{\"ref_id\":\"b21\"},\"end\":11186,\"start\":11182},{\"attributes\":{\"ref_id\":\"b16\"},\"end\":12149,\"start\":12145},{\"attributes\":{\"ref_id\":\"b16\"},\"end\":12252,\"start\":12248},{\"attributes\":{\"ref_id\":\"b22\"},\"end\":13663,\"start\":13659},{\"attributes\":{\"ref_id\":\"b23\"},\"end\":21998,\"start\":21994},{\"attributes\":{\"ref_id\":\"b24\"},\"end\":22004,\"start\":22000},{\"attributes\":{\"ref_id\":\"b25\"},\"end\":22010,\"start\":22006},{\"attributes\":{\"ref_id\":\"b26\"},\"end\":22016,\"start\":22012},{\"attributes\":{\"ref_id\":\"b24\"},\"end\":22049,\"start\":22045},{\"attributes\":{\"ref_id\":\"b25\"},\"end\":22220,\"start\":22216},{\"attributes\":{\"ref_id\":\"b25\"},\"end\":22509,\"start\":22505},{\"attributes\":{\"ref_id\":\"b29\"},\"end\":25070,\"start\":25066},{\"attributes\":{\"ref_id\":\"b30\"},\"end\":25076,\"start\":25072},{\"attributes\":{\"ref_id\":\"b31\"},\"end\":25097,\"start\":25093},{\"attributes\":{\"ref_id\":\"b32\"},\"end\":25372,\"start\":25368},{\"attributes\":{\"ref_id\":\"b33\"},\"end\":25378,\"start\":25374},{\"attributes\":{\"ref_id\":\"b34\"},\"end\":25545,\"start\":25541},{\"attributes\":{\"ref_id\":\"b35\"},\"end\":25723,\"start\":25719},{\"attributes\":{\"ref_id\":\"b36\"},\"end\":25866,\"start\":25862},{\"attributes\":{\"ref_id\":\"b37\"},\"end\":26035,\"start\":26031},{\"attributes\":{\"ref_id\":\"b38\"},\"end\":26048,\"start\":26044},{\"attributes\":{\"ref_id\":\"b39\"},\"end\":26060,\"start\":26056},{\"attributes\":{\"ref_id\":\"b40\"},\"end\":26076,\"start\":26072},{\"attributes\":{\"ref_id\":\"b41\"},\"end\":26273,\"start\":26269},{\"attributes\":{\"ref_id\":\"b42\"},\"end\":26287,\"start\":26283},{\"attributes\":{\"ref_id\":\"b30\"},\"end\":26537,\"start\":26533},{\"attributes\":{\"ref_id\":\"b32\"},\"end\":26749,\"start\":26745},{\"attributes\":{\"ref_id\":\"b43\"},\"end\":29954,\"start\":29950},{\"attributes\":{\"ref_id\":\"b44\"},\"end\":32923,\"start\":32919},{\"attributes\":{\"ref_id\":\"b45\"},\"end\":32954,\"start\":32950},{\"attributes\":{\"ref_id\":\"b46\"},\"end\":34240,\"start\":34236},{\"attributes\":{\"ref_id\":\"b47\"},\"end\":36757,\"start\":36753},{\"attributes\":{\"ref_id\":\"b48\"},\"end\":36763,\"start\":36759},{\"attributes\":{\"ref_id\":\"b49\"},\"end\":36769,\"start\":36765},{\"attributes\":{\"ref_id\":\"b16\"},\"end\":36899,\"start\":36895},{\"attributes\":{\"ref_id\":\"b50\"},\"end\":36905,\"start\":36901},{\"end\":37841,\"start\":37834},{\"attributes\":{\"ref_id\":\"b51\"},\"end\":39371,\"start\":39367},{\"attributes\":{\"ref_id\":\"b52\"},\"end\":40314,\"start\":40310},{\"attributes\":{\"ref_id\":\"b53\"},\"end\":40389,\"start\":40385},{\"attributes\":{\"ref_id\":\"b54\"},\"end\":40469,\"start\":40465},{\"attributes\":{\"ref_id\":\"b52\"},\"end\":41366,\"start\":41362},{\"attributes\":{\"ref_id\":\"b53\"},\"end\":41984,\"start\":41980},{\"attributes\":{\"ref_id\":\"b54\"},\"end\":42530,\"start\":42526},{\"attributes\":{\"ref_id\":\"b11\"},\"end\":47152,\"start\":47148},{\"attributes\":{\"ref_id\":\"b27\"},\"end\":47233,\"start\":47229},{\"attributes\":{\"ref_id\":\"b28\"},\"end\":47330,\"start\":47326}]", "figure": "[{\"attributes\":{\"id\":\"fig_0\"},\"end\":45881,\"start\":45171},{\"attributes\":{\"id\":\"fig_1\"},\"end\":46216,\"start\":45882},{\"attributes\":{\"id\":\"fig_3\"},\"end\":46585,\"start\":46217},{\"attributes\":{\"id\":\"fig_5\"},\"end\":46618,\"start\":46586},{\"attributes\":{\"id\":\"fig_6\"},\"end\":46752,\"start\":46619},{\"attributes\":{\"id\":\"fig_7\"},\"end\":47331,\"start\":46753},{\"attributes\":{\"id\":\"fig_8\"},\"end\":47519,\"start\":47332},{\"attributes\":{\"id\":\"fig_9\"},\"end\":48021,\"start\":47520},{\"attributes\":{\"id\":\"fig_10\"},\"end\":48442,\"start\":48022},{\"attributes\":{\"id\":\"tab_1\",\"type\":\"table\"},\"end\":48450,\"start\":48443},{\"attributes\":{\"id\":\"tab_3\",\"type\":\"table\"},\"end\":48794,\"start\":48451}]", "paragraph": "[{\"end\":2363,\"start\":1714},{\"end\":3087,\"start\":2365},{\"end\":3868,\"start\":3089},{\"end\":4489,\"start\":3870},{\"end\":5270,\"start\":4491},{\"end\":6279,\"start\":5272},{\"end\":7035,\"start\":6281},{\"end\":7665,\"start\":7037},{\"end\":8220,\"start\":7667},{\"end\":9193,\"start\":8222},{\"end\":9490,\"start\":9231},{\"end\":10383,\"start\":9517},{\"end\":10608,\"start\":10385},{\"end\":10679,\"start\":10678},{\"end\":10839,\"start\":10681},{\"end\":11059,\"start\":10841},{\"end\":11278,\"start\":11084},{\"end\":11330,\"start\":11329},{\"end\":11333,\"start\":11332},{\"end\":11917,\"start\":11335},{\"end\":12381,\"start\":11941},{\"end\":12615,\"start\":12383},{\"end\":13056,\"start\":12687},{\"end\":13199,\"start\":13081},{\"end\":13455,\"start\":13259},{\"end\":14245,\"start\":13480},{\"end\":14645,\"start\":14247},{\"end\":15206,\"start\":14677},{\"end\":16309,\"start\":15229},{\"end\":16668,\"start\":16413},{\"end\":16844,\"start\":16684},{\"end\":17261,\"start\":16869},{\"end\":18181,\"start\":17355},{\"end\":18470,\"start\":18204},{\"end\":19319,\"start\":18472},{\"end\":19809,\"start\":19424},{\"end\":20013,\"start\":19825},{\"end\":20221,\"start\":20039},{\"end\":21200,\"start\":20316},{\"end\":21861,\"start\":21249},{\"end\":22434,\"start\":21863},{\"end\":22988,\"start\":22436},{\"end\":23525,\"start\":23234},{\"end\":24029,\"start\":23578},{\"end\":24646,\"start\":24052},{\"end\":24841,\"start\":24675},{\"end\":24927,\"start\":24843},{\"end\":26947,\"start\":24978},{\"end\":27657,\"start\":26949},{\"end\":28606,\"start\":27659},{\"end\":29790,\"start\":28649},{\"end\":30427,\"start\":29792},{\"end\":30496,\"start\":30453},{\"end\":31243,\"start\":30541},{\"end\":31432,\"start\":31414},{\"end\":31915,\"start\":31527},{\"end\":32040,\"start\":31917},{\"end\":32667,\"start\":32140},{\"end\":33154,\"start\":32694},{\"end\":36246,\"start\":33156},{\"end\":36579,\"start\":36266},{\"end\":40536,\"start\":36581},{\"end\":40558,\"start\":40538},{\"end\":41194,\"start\":40560},{\"end\":41966,\"start\":41222},{\"end\":42861,\"start\":41968},{\"end\":43712,\"start\":42863},{\"end\":44480,\"start\":43727},{\"end\":45170,\"start\":44482}]", "formula": "[{\"attributes\":{\"id\":\"formula_0\"},\"end\":10677,\"start\":10609},{\"attributes\":{\"id\":\"formula_2\"},\"end\":11083,\"start\":11060},{\"attributes\":{\"id\":\"formula_3\"},\"end\":11328,\"start\":11279},{\"attributes\":{\"id\":\"formula_5\"},\"end\":12686,\"start\":12616},{\"attributes\":{\"id\":\"formula_6\"},\"end\":13080,\"start\":13057},{\"attributes\":{\"id\":\"formula_7\"},\"end\":13258,\"start\":13200},{\"attributes\":{\"id\":\"formula_8\"},\"end\":16412,\"start\":16310},{\"attributes\":{\"id\":\"formula_9\"},\"end\":16683,\"start\":16669},{\"attributes\":{\"id\":\"formula_10\"},\"end\":16868,\"start\":16845},{\"attributes\":{\"id\":\"formula_11\"},\"end\":17354,\"start\":17262},{\"attributes\":{\"id\":\"formula_12\"},\"end\":19423,\"start\":19320},{\"attributes\":{\"id\":\"formula_13\"},\"end\":19824,\"start\":19810},{\"attributes\":{\"id\":\"formula_14\"},\"end\":20038,\"start\":20014},{\"attributes\":{\"id\":\"formula_15\"},\"end\":20315,\"start\":20222},{\"attributes\":{\"id\":\"formula_16\"},\"end\":23111,\"start\":22989},{\"attributes\":{\"id\":\"formula_17\"},\"end\":23233,\"start\":23111},{\"attributes\":{\"id\":\"formula_18\"},\"end\":23577,\"start\":23526},{\"attributes\":{\"id\":\"formula_19\"},\"end\":30452,\"start\":30428},{\"attributes\":{\"id\":\"formula_20\"},\"end\":30531,\"start\":30497},{\"attributes\":{\"id\":\"formula_21\"},\"end\":31413,\"start\":31244},{\"attributes\":{\"id\":\"formula_22\"},\"end\":31526,\"start\":31433},{\"attributes\":{\"id\":\"formula_23\"},\"end\":32139,\"start\":32041}]", "table_ref": "[{\"end\":26970,\"start\":26963},{\"end\":27822,\"start\":27821},{\"end\":29789,\"start\":29780},{\"end\":32443,\"start\":32434},{\"end\":33177,\"start\":33170},{\"attributes\":{\"ref_id\":\"tab_3\"},\"end\":34568,\"start\":34561},{\"end\":39619,\"start\":39612}]", "section_header": "[{\"attributes\":{\"n\":\"1\"},\"end\":1712,\"start\":1700},{\"attributes\":{\"n\":\"2\"},\"end\":9229,\"start\":9196},{\"attributes\":{\"n\":\"2.1\"},\"end\":9515,\"start\":9493},{\"attributes\":{\"n\":\"2.2\"},\"end\":11939,\"start\":11920},{\"attributes\":{\"n\":\"2.3\"},\"end\":13478,\"start\":13458},{\"attributes\":{\"n\":\"3\"},\"end\":14675,\"start\":14648},{\"attributes\":{\"n\":\"3.1\"},\"end\":15227,\"start\":15209},{\"attributes\":{\"n\":\"3.2\"},\"end\":18202,\"start\":18184},{\"attributes\":{\"n\":\"3.3\"},\"end\":21247,\"start\":21203},{\"attributes\":{\"n\":\"3.4\"},\"end\":24050,\"start\":24032},{\"attributes\":{\"n\":\"4\"},\"end\":24673,\"start\":24649},{\"attributes\":{\"n\":\"4.1\"},\"end\":24976,\"start\":24930},{\"end\":28616,\"start\":28609},{\"attributes\":{\"n\":\"4.2\"},\"end\":28647,\"start\":28619},{\"end\":30539,\"start\":30533},{\"attributes\":{\"n\":\"4.3\"},\"end\":32692,\"start\":32670},{\"attributes\":{\"n\":\"4.4\"},\"end\":36264,\"start\":36249},{\"attributes\":{\"n\":\"5\"},\"end\":41220,\"start\":41197},{\"attributes\":{\"n\":\"6\"},\"end\":43725,\"start\":43715},{\"end\":45181,\"start\":45172},{\"end\":45891,\"start\":45883},{\"end\":46226,\"start\":46218},{\"end\":46595,\"start\":46587},{\"end\":46628,\"start\":46620},{\"end\":46762,\"start\":46754},{\"end\":47341,\"start\":47333},{\"end\":47544,\"start\":47521},{\"end\":48032,\"start\":48023},{\"end\":48449,\"start\":48444},{\"end\":48459,\"start\":48452}]", "table": "[{\"end\":48794,\"start\":48662}]", "figure_caption": "[{\"end\":45881,\"start\":45183},{\"end\":46216,\"start\":45893},{\"end\":46585,\"start\":46228},{\"end\":46618,\"start\":46597},{\"end\":46752,\"start\":46630},{\"end\":47331,\"start\":46764},{\"end\":47519,\"start\":47343},{\"end\":48021,\"start\":47547},{\"end\":48442,\"start\":48035},{\"end\":48662,\"start\":48461}]", "figure_ref": "[{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":5268,\"start\":5260},{\"attributes\":{\"ref_id\":\"fig_1\"},\"end\":5672,\"start\":5661},{\"attributes\":{\"ref_id\":\"fig_1\"},\"end\":6059,\"start\":6049},{\"attributes\":{\"ref_id\":\"fig_5\"},\"end\":13595,\"start\":13586},{\"attributes\":{\"ref_id\":\"fig_5\"},\"end\":13823,\"start\":13814},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":15303,\"start\":15293},{\"attributes\":{\"ref_id\":\"fig_6\"},\"end\":19796,\"start\":19788},{\"attributes\":{\"ref_id\":\"fig_5\"},\"end\":20656,\"start\":20647},{\"attributes\":{\"ref_id\":\"fig_7\"},\"end\":23602,\"start\":23594},{\"attributes\":{\"ref_id\":\"fig_8\"},\"end\":27517,\"start\":27507},{\"end\":29062,\"start\":29053},{\"end\":30661,\"start\":30651},{\"end\":31607,\"start\":31601},{\"end\":32025,\"start\":32015},{\"end\":32223,\"start\":32215},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":35185,\"start\":35176},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":35213,\"start\":35204},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":35814,\"start\":35805},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":40153,\"start\":40146},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":43568,\"start\":43559}]", "bib_author_first_name": "[{\"end\":48965,\"start\":48961},{\"end\":49080,\"start\":49079},{\"end\":49209,\"start\":49208},{\"end\":49219,\"start\":49218},{\"end\":49393,\"start\":49392},{\"end\":49395,\"start\":49394},{\"end\":49407,\"start\":49406},{\"end\":49415,\"start\":49414},{\"end\":49652,\"start\":49651},{\"end\":49662,\"start\":49661},{\"end\":49813,\"start\":49812},{\"end\":49823,\"start\":49822},{\"end\":49834,\"start\":49833},{\"end\":50096,\"start\":50095},{\"end\":50098,\"start\":50097},{\"end\":50106,\"start\":50105},{\"end\":50376,\"start\":50375},{\"end\":50383,\"start\":50382},{\"end\":50393,\"start\":50392},{\"end\":50403,\"start\":50402},{\"end\":50655,\"start\":50654},{\"end\":50657,\"start\":50656},{\"end\":50667,\"start\":50666},{\"end\":50675,\"start\":50674},{\"end\":50686,\"start\":50685},{\"end\":50694,\"start\":50693},{\"end\":50704,\"start\":50703},{\"end\":50717,\"start\":50716},{\"end\":50728,\"start\":50724},{\"end\":50735,\"start\":50734},{\"end\":50746,\"start\":50745},{\"end\":51005,\"start\":51004},{\"end\":51007,\"start\":51006},{\"end\":51016,\"start\":51015},{\"end\":51018,\"start\":51017},{\"end\":51164,\"start\":51163},{\"end\":51174,\"start\":51173},{\"end\":51182,\"start\":51181},{\"end\":51412,\"start\":51411},{\"end\":51414,\"start\":51413},{\"end\":51423,\"start\":51422},{\"end\":51425,\"start\":51424},{\"end\":51582,\"start\":51581},{\"end\":51801,\"start\":51800},{\"end\":51808,\"start\":51807},{\"end\":51816,\"start\":51815},{\"end\":51824,\"start\":51823},{\"end\":52171,\"start\":52170},{\"end\":52184,\"start\":52183},{\"end\":52186,\"start\":52185},{\"end\":52470,\"start\":52469},{\"end\":52483,\"start\":52482},{\"end\":52496,\"start\":52495},{\"end\":52511,\"start\":52510},{\"end\":52519,\"start\":52518},{\"end\":52527,\"start\":52526},{\"end\":52537,\"start\":52536},{\"end\":52547,\"start\":52546},{\"end\":52560,\"start\":52559},{\"end\":52828,\"start\":52827},{\"end\":52835,\"start\":52834},{\"end\":52837,\"start\":52836},{\"end\":52847,\"start\":52846},{\"end\":53056,\"start\":53055},{\"end\":53064,\"start\":53063},{\"end\":53076,\"start\":53075},{\"end\":53089,\"start\":53088},{\"end\":53100,\"start\":53099},{\"end\":53114,\"start\":53113},{\"end\":53340,\"start\":53339},{\"end\":53551,\"start\":53550},{\"end\":53563,\"start\":53562},{\"end\":53574,\"start\":53573},{\"end\":53576,\"start\":53575},{\"end\":53583,\"start\":53582},{\"end\":53819,\"start\":53818},{\"end\":53825,\"start\":53824},{\"end\":53827,\"start\":53826},{\"end\":54078,\"start\":54077},{\"end\":54080,\"start\":54079},{\"end\":54090,\"start\":54089},{\"end\":54092,\"start\":54091},{\"end\":54104,\"start\":54103},{\"end\":54106,\"start\":54105},{\"end\":54348,\"start\":54347},{\"end\":54526,\"start\":54525},{\"end\":54536,\"start\":54535},{\"end\":54550,\"start\":54549},{\"end\":54569,\"start\":54568},{\"end\":54781,\"start\":54777},{\"end\":54791,\"start\":54790},{\"end\":54803,\"start\":54802},{\"end\":54814,\"start\":54813},{\"end\":55057,\"start\":55056},{\"end\":55066,\"start\":55065},{\"end\":55377,\"start\":55376},{\"end\":55389,\"start\":55388},{\"end\":55402,\"start\":55398},{\"end\":55412,\"start\":55411},{\"end\":55421,\"start\":55420},{\"end\":55700,\"start\":55699},{\"end\":55711,\"start\":55710},{\"end\":55730,\"start\":55729},{\"end\":55952,\"start\":55951},{\"end\":55962,\"start\":55961},{\"end\":56145,\"start\":56144},{\"end\":56147,\"start\":56146},{\"end\":56160,\"start\":56159},{\"end\":56162,\"start\":56161},{\"end\":56449,\"start\":56448},{\"end\":56794,\"start\":56793},{\"end\":56796,\"start\":56795},{\"end\":56989,\"start\":56988},{\"end\":57002,\"start\":57001},{\"end\":57004,\"start\":57003},{\"end\":57014,\"start\":57013},{\"end\":57191,\"start\":57190},{\"end\":57203,\"start\":57202},{\"end\":57536,\"start\":57535},{\"end\":57549,\"start\":57548},{\"end\":57559,\"start\":57558},{\"end\":57561,\"start\":57560},{\"end\":57920,\"start\":57919},{\"end\":57929,\"start\":57928},{\"end\":57937,\"start\":57936},{\"end\":57948,\"start\":57947},{\"end\":57957,\"start\":57956},{\"end\":57970,\"start\":57969},{\"end\":58179,\"start\":58178},{\"end\":58195,\"start\":58194},{\"end\":58204,\"start\":58203},{\"end\":58452,\"start\":58451},{\"end\":58462,\"start\":58461},{\"end\":58470,\"start\":58469},{\"end\":58482,\"start\":58481},{\"end\":58492,\"start\":58491},{\"end\":58494,\"start\":58493},{\"end\":58506,\"start\":58505},{\"end\":58517,\"start\":58516},{\"end\":58531,\"start\":58530},{\"end\":58542,\"start\":58541},{\"end\":58556,\"start\":58555},{\"end\":58886,\"start\":58885},{\"end\":58888,\"start\":58887},{\"end\":58897,\"start\":58896},{\"end\":58904,\"start\":58903},{\"end\":58914,\"start\":58913},{\"end\":58920,\"start\":58919},{\"end\":58930,\"start\":58929},{\"end\":58940,\"start\":58939},{\"end\":58962,\"start\":58961},{\"end\":58964,\"start\":58963},{\"end\":58976,\"start\":58975},{\"end\":58993,\"start\":58992},{\"end\":59349,\"start\":59345},{\"end\":59357,\"start\":59356},{\"end\":59371,\"start\":59370},{\"end\":59378,\"start\":59377},{\"end\":59400,\"start\":59399},{\"end\":59410,\"start\":59409},{\"end\":59416,\"start\":59415},{\"end\":59418,\"start\":59417},{\"end\":59428,\"start\":59427},{\"end\":59430,\"start\":59429},{\"end\":59441,\"start\":59440},{\"end\":59450,\"start\":59449},{\"end\":59823,\"start\":59822},{\"end\":59834,\"start\":59833},{\"end\":59844,\"start\":59843},{\"end\":59854,\"start\":59853},{\"end\":59864,\"start\":59863},{\"end\":59876,\"start\":59875},{\"end\":59895,\"start\":59894},{\"end\":59897,\"start\":59896},{\"end\":59909,\"start\":59908},{\"end\":59920,\"start\":59919},{\"end\":59928,\"start\":59927},{\"end\":60312,\"start\":60311},{\"end\":60637,\"start\":60636},{\"end\":60647,\"start\":60646},{\"end\":60993,\"start\":60992},{\"end\":60995,\"start\":60994},{\"end\":61006,\"start\":61005},{\"end\":61008,\"start\":61007},{\"end\":61021,\"start\":61020},{\"end\":61034,\"start\":61033},{\"end\":61251,\"start\":61250},{\"end\":61259,\"start\":61258},{\"end\":61272,\"start\":61271},{\"end\":61283,\"start\":61282},{\"end\":61293,\"start\":61292},{\"end\":61305,\"start\":61304},{\"end\":61319,\"start\":61318},{\"end\":61330,\"start\":61329},{\"end\":61564,\"start\":61563},{\"end\":61566,\"start\":61565},{\"end\":61576,\"start\":61575},{\"end\":61578,\"start\":61577},{\"end\":61790,\"start\":61789},{\"end\":61803,\"start\":61802},{\"end\":62036,\"start\":62035},{\"end\":62052,\"start\":62051},{\"end\":62310,\"start\":62309},{\"end\":62312,\"start\":62311},{\"end\":62322,\"start\":62321},{\"end\":62481,\"start\":62480},{\"end\":62489,\"start\":62488},{\"end\":62498,\"start\":62494},{\"end\":62706,\"start\":62705},{\"end\":62715,\"start\":62714},{\"end\":62725,\"start\":62724},{\"end\":62734,\"start\":62733},{\"end\":63023,\"start\":63022},{\"end\":63032,\"start\":63031},{\"end\":63322,\"start\":63321},{\"end\":63334,\"start\":63333},{\"end\":63336,\"start\":63335},{\"end\":63346,\"start\":63345},{\"end\":63357,\"start\":63356},{\"end\":63661,\"start\":63660},{\"end\":63663,\"start\":63662},{\"end\":63671,\"start\":63670},{\"end\":63673,\"start\":63672},{\"end\":63685,\"start\":63684},{\"end\":63687,\"start\":63686},{\"end\":63909,\"start\":63908},{\"end\":63918,\"start\":63917},{\"end\":63926,\"start\":63925},{\"end\":63932,\"start\":63931},{\"end\":63938,\"start\":63937},{\"end\":63944,\"start\":63943}]", "bib_author_last_name": "[{\"end\":48974,\"start\":48966},{\"end\":49087,\"start\":49081},{\"end\":49097,\"start\":49089},{\"end\":49216,\"start\":49210},{\"end\":49228,\"start\":49220},{\"end\":49404,\"start\":49396},{\"end\":49412,\"start\":49408},{\"end\":49424,\"start\":49416},{\"end\":49659,\"start\":49653},{\"end\":49671,\"start\":49663},{\"end\":49820,\"start\":49814},{\"end\":49831,\"start\":49824},{\"end\":49848,\"start\":49835},{\"end\":50103,\"start\":50099},{\"end\":50114,\"start\":50107},{\"end\":50380,\"start\":50377},{\"end\":50390,\"start\":50384},{\"end\":50400,\"start\":50394},{\"end\":50409,\"start\":50404},{\"end\":50664,\"start\":50658},{\"end\":50672,\"start\":50668},{\"end\":50683,\"start\":50676},{\"end\":50691,\"start\":50687},{\"end\":50701,\"start\":50695},{\"end\":50714,\"start\":50705},{\"end\":50722,\"start\":50718},{\"end\":50732,\"start\":50729},{\"end\":50743,\"start\":50736},{\"end\":50750,\"start\":50747},{\"end\":51013,\"start\":51008},{\"end\":51023,\"start\":51019},{\"end\":51171,\"start\":51165},{\"end\":51179,\"start\":51175},{\"end\":51189,\"start\":51183},{\"end\":51420,\"start\":51415},{\"end\":51434,\"start\":51426},{\"end\":51590,\"start\":51583},{\"end\":51805,\"start\":51802},{\"end\":51813,\"start\":51809},{\"end\":51821,\"start\":51817},{\"end\":51829,\"start\":51825},{\"end\":52181,\"start\":52172},{\"end\":52196,\"start\":52187},{\"end\":52480,\"start\":52471},{\"end\":52493,\"start\":52484},{\"end\":52508,\"start\":52497},{\"end\":52516,\"start\":52512},{\"end\":52524,\"start\":52520},{\"end\":52534,\"start\":52528},{\"end\":52544,\"start\":52538},{\"end\":52557,\"start\":52548},{\"end\":52563,\"start\":52561},{\"end\":52832,\"start\":52829},{\"end\":52844,\"start\":52838},{\"end\":52856,\"start\":52848},{\"end\":53061,\"start\":53057},{\"end\":53073,\"start\":53065},{\"end\":53086,\"start\":53077},{\"end\":53097,\"start\":53090},{\"end\":53111,\"start\":53101},{\"end\":53119,\"start\":53115},{\"end\":53348,\"start\":53341},{\"end\":53560,\"start\":53552},{\"end\":53571,\"start\":53564},{\"end\":53580,\"start\":53577},{\"end\":53589,\"start\":53584},{\"end\":53822,\"start\":53820},{\"end\":53840,\"start\":53828},{\"end\":54087,\"start\":54081},{\"end\":54101,\"start\":54093},{\"end\":54112,\"start\":54107},{\"end\":54354,\"start\":54349},{\"end\":54533,\"start\":54527},{\"end\":54547,\"start\":54537},{\"end\":54566,\"start\":54551},{\"end\":54580,\"start\":54570},{\"end\":54788,\"start\":54782},{\"end\":54800,\"start\":54792},{\"end\":54811,\"start\":54804},{\"end\":54820,\"start\":54815},{\"end\":55063,\"start\":55058},{\"end\":55074,\"start\":55067},{\"end\":55386,\"start\":55378},{\"end\":55396,\"start\":55390},{\"end\":55409,\"start\":55403},{\"end\":55418,\"start\":55413},{\"end\":55429,\"start\":55422},{\"end\":55708,\"start\":55701},{\"end\":55727,\"start\":55712},{\"end\":55741,\"start\":55731},{\"end\":55959,\"start\":55953},{\"end\":55972,\"start\":55963},{\"end\":56157,\"start\":56148},{\"end\":56172,\"start\":56163},{\"end\":56457,\"start\":56450},{\"end\":56805,\"start\":56797},{\"end\":56999,\"start\":56990},{\"end\":57011,\"start\":57005},{\"end\":57023,\"start\":57015},{\"end\":57200,\"start\":57192},{\"end\":57209,\"start\":57204},{\"end\":57546,\"start\":57537},{\"end\":57556,\"start\":57550},{\"end\":57568,\"start\":57562},{\"end\":57926,\"start\":57921},{\"end\":57934,\"start\":57930},{\"end\":57945,\"start\":57938},{\"end\":57954,\"start\":57949},{\"end\":57967,\"start\":57958},{\"end\":57983,\"start\":57971},{\"end\":58192,\"start\":58180},{\"end\":58201,\"start\":58196},{\"end\":58211,\"start\":58205},{\"end\":58459,\"start\":58453},{\"end\":58467,\"start\":58463},{\"end\":58479,\"start\":58471},{\"end\":58489,\"start\":58483},{\"end\":58503,\"start\":58495},{\"end\":58514,\"start\":58507},{\"end\":58528,\"start\":58518},{\"end\":58539,\"start\":58532},{\"end\":58553,\"start\":58543},{\"end\":58564,\"start\":58557},{\"end\":58894,\"start\":58889},{\"end\":58901,\"start\":58898},{\"end\":58911,\"start\":58905},{\"end\":58917,\"start\":58915},{\"end\":58927,\"start\":58921},{\"end\":58937,\"start\":58931},{\"end\":58959,\"start\":58941},{\"end\":58973,\"start\":58965},{\"end\":58990,\"start\":58977},{\"end\":58996,\"start\":58994},{\"end\":59354,\"start\":59350},{\"end\":59368,\"start\":59358},{\"end\":59375,\"start\":59372},{\"end\":59397,\"start\":59379},{\"end\":59407,\"start\":59401},{\"end\":59413,\"start\":59411},{\"end\":59425,\"start\":59419},{\"end\":59438,\"start\":59431},{\"end\":59447,\"start\":59442},{\"end\":59469,\"start\":59451},{\"end\":59831,\"start\":59824},{\"end\":59841,\"start\":59835},{\"end\":59851,\"start\":59845},{\"end\":59861,\"start\":59855},{\"end\":59873,\"start\":59865},{\"end\":59892,\"start\":59877},{\"end\":59906,\"start\":59898},{\"end\":59917,\"start\":59910},{\"end\":59925,\"start\":59921},{\"end\":59937,\"start\":59929},{\"end\":60316,\"start\":60313},{\"end\":60644,\"start\":60638},{\"end\":60653,\"start\":60648},{\"end\":61003,\"start\":60996},{\"end\":61018,\"start\":61009},{\"end\":61031,\"start\":61022},{\"end\":61042,\"start\":61035},{\"end\":61256,\"start\":61252},{\"end\":61269,\"start\":61260},{\"end\":61280,\"start\":61273},{\"end\":61290,\"start\":61284},{\"end\":61302,\"start\":61294},{\"end\":61316,\"start\":61306},{\"end\":61327,\"start\":61320},{\"end\":61335,\"start\":61331},{\"end\":61573,\"start\":61567},{\"end\":61583,\"start\":61579},{\"end\":61800,\"start\":61791},{\"end\":61814,\"start\":61804},{\"end\":62049,\"start\":62037},{\"end\":62062,\"start\":62053},{\"end\":62319,\"start\":62313},{\"end\":62327,\"start\":62323},{\"end\":62486,\"start\":62482},{\"end\":62492,\"start\":62490},{\"end\":62504,\"start\":62499},{\"end\":62712,\"start\":62707},{\"end\":62722,\"start\":62716},{\"end\":62731,\"start\":62726},{\"end\":62739,\"start\":62735},{\"end\":63029,\"start\":63024},{\"end\":63038,\"start\":63033},{\"end\":63331,\"start\":63323},{\"end\":63343,\"start\":63337},{\"end\":63354,\"start\":63347},{\"end\":63369,\"start\":63358},{\"end\":63668,\"start\":63664},{\"end\":63682,\"start\":63674},{\"end\":63696,\"start\":63688},{\"end\":63915,\"start\":63910},{\"end\":63923,\"start\":63919},{\"end\":63929,\"start\":63927},{\"end\":63935,\"start\":63933},{\"end\":63941,\"start\":63939},{\"end\":63948,\"start\":63945}]", "bib_entry": "[{\"attributes\":{\"id\":\"b0\"},\"end\":49075,\"start\":48944},{\"attributes\":{\"id\":\"b1\"},\"end\":49173,\"start\":49077},{\"attributes\":{\"id\":\"b2\",\"matched_paper_id\":6243362},\"end\":49329,\"start\":49175},{\"attributes\":{\"doi\":\"arXiv:1709.05584\",\"id\":\"b3\"},\"end\":49599,\"start\":49331},{\"attributes\":{\"id\":\"b4\",\"matched_paper_id\":207238980},\"end\":49770,\"start\":49601},{\"attributes\":{\"id\":\"b5\",\"matched_paper_id\":7490480},\"end\":50027,\"start\":49772},{\"attributes\":{\"doi\":\"arXiv:1609.02907\",\"id\":\"b6\"},\"end\":50279,\"start\":50029},{\"attributes\":{\"id\":\"b7\"},\"end\":50602,\"start\":50281},{\"attributes\":{\"id\":\"b8\",\"matched_paper_id\":81978193},\"end\":50971,\"start\":50604},{\"attributes\":{\"id\":\"b9\",\"matched_paper_id\":5941981},\"end\":51104,\"start\":50973},{\"attributes\":{\"id\":\"b10\",\"matched_paper_id\":5865347},\"end\":51364,\"start\":51106},{\"attributes\":{\"id\":\"b11\"},\"end\":51538,\"start\":51366},{\"attributes\":{\"id\":\"b12\",\"matched_paper_id\":2317676},\"end\":51690,\"start\":51540},{\"attributes\":{\"id\":\"b13\",\"matched_paper_id\":14802289},\"end\":52049,\"start\":51692},{\"attributes\":{\"id\":\"b14\",\"matched_paper_id\":1270543},\"end\":52408,\"start\":52051},{\"attributes\":{\"id\":\"b15\",\"matched_paper_id\":458476},\"end\":52753,\"start\":52410},{\"attributes\":{\"id\":\"b16\",\"matched_paper_id\":59295078},\"end\":52993,\"start\":52755},{\"attributes\":{\"id\":\"b17\",\"matched_paper_id\":9884096},\"end\":53282,\"start\":52995},{\"attributes\":{\"id\":\"b18\",\"matched_paper_id\":214500514},\"end\":53484,\"start\":53284},{\"attributes\":{\"id\":\"b19\",\"matched_paper_id\":1591394},\"end\":53768,\"start\":53486},{\"attributes\":{\"id\":\"b20\",\"matched_paper_id\":1805048},\"end\":54001,\"start\":53770},{\"attributes\":{\"id\":\"b21\",\"matched_paper_id\":360112},\"end\":54282,\"start\":54003},{\"attributes\":{\"id\":\"b22\"},\"end\":54476,\"start\":54284},{\"attributes\":{\"id\":\"b23\"},\"end\":54711,\"start\":54478},{\"attributes\":{\"id\":\"b24\",\"matched_paper_id\":14259722},\"end\":54984,\"start\":54713},{\"attributes\":{\"id\":\"b25\",\"matched_paper_id\":7756201},\"end\":55298,\"start\":54986},{\"attributes\":{\"id\":\"b26\",\"matched_paper_id\":6241256},\"end\":55616,\"start\":55300},{\"attributes\":{\"id\":\"b27\",\"matched_paper_id\":14278241},\"end\":55916,\"start\":55618},{\"attributes\":{\"id\":\"b28\",\"matched_paper_id\":8822670},\"end\":56076,\"start\":55918},{\"attributes\":{\"id\":\"b29\"},\"end\":56406,\"start\":56078},{\"attributes\":{\"id\":\"b30\",\"matched_paper_id\":15005100},\"end\":56710,\"start\":56408},{\"attributes\":{\"id\":\"b31\",\"matched_paper_id\":84867861},\"end\":56957,\"start\":56712},{\"attributes\":{\"id\":\"b32\",\"matched_paper_id\":13332080},\"end\":57121,\"start\":56959},{\"attributes\":{\"id\":\"b33\",\"matched_paper_id\":2601163},\"end\":57434,\"start\":57123},{\"attributes\":{\"id\":\"b34\",\"matched_paper_id\":4989418},\"end\":57863,\"start\":57436},{\"attributes\":{\"id\":\"b35\",\"matched_paper_id\":44195887},\"end\":58137,\"start\":57865},{\"attributes\":{\"doi\":\"arXiv:1909.13021\",\"id\":\"b36\"},\"end\":58364,\"start\":58139},{\"attributes\":{\"id\":\"b37\",\"matched_paper_id\":8235923},\"end\":58803,\"start\":58366},{\"attributes\":{\"id\":\"b38\"},\"end\":59264,\"start\":58805},{\"attributes\":{\"id\":\"b39\",\"matched_paper_id\":4427026},\"end\":59723,\"start\":59266},{\"attributes\":{\"id\":\"b40\",\"matched_paper_id\":18874556},\"end\":60227,\"start\":59725},{\"attributes\":{\"id\":\"b41\",\"matched_paper_id\":37854991},\"end\":60580,\"start\":60229},{\"attributes\":{\"id\":\"b42\",\"matched_paper_id\":13135140},\"end\":60929,\"start\":60582},{\"attributes\":{\"id\":\"b43\",\"matched_paper_id\":14094707},\"end\":61200,\"start\":60931},{\"attributes\":{\"id\":\"b44\",\"matched_paper_id\":14760882},\"end\":61511,\"start\":61202},{\"attributes\":{\"id\":\"b45\",\"matched_paper_id\":18619897},\"end\":61711,\"start\":61513},{\"attributes\":{\"id\":\"b46\",\"matched_paper_id\":14153811},\"end\":61961,\"start\":61713},{\"attributes\":{\"id\":\"b47\"},\"end\":62273,\"start\":61963},{\"attributes\":{\"id\":\"b48\",\"matched_paper_id\":2262951},\"end\":62430,\"start\":62275},{\"attributes\":{\"id\":\"b49\",\"matched_paper_id\":14353767},\"end\":62660,\"start\":62432},{\"attributes\":{\"id\":\"b50\",\"matched_paper_id\":9274608},\"end\":62973,\"start\":62662},{\"attributes\":{\"id\":\"b51\",\"matched_paper_id\":7422221},\"end\":63253,\"start\":62975},{\"attributes\":{\"id\":\"b52\",\"matched_paper_id\":17556095},\"end\":63613,\"start\":63255},{\"attributes\":{\"id\":\"b53\",\"matched_paper_id\":5004537},\"end\":63836,\"start\":63615},{\"attributes\":{\"id\":\"b54\",\"matched_paper_id\":15413636},\"end\":64191,\"start\":63838}]", "bib_title": "[{\"end\":49206,\"start\":49175},{\"end\":49649,\"start\":49601},{\"end\":49810,\"start\":49772},{\"end\":50652,\"start\":50604},{\"end\":51002,\"start\":50973},{\"end\":51161,\"start\":51106},{\"end\":51409,\"start\":51366},{\"end\":51579,\"start\":51540},{\"end\":51798,\"start\":51692},{\"end\":52168,\"start\":52051},{\"end\":52467,\"start\":52410},{\"end\":52825,\"start\":52755},{\"end\":53053,\"start\":52995},{\"end\":53337,\"start\":53284},{\"end\":53548,\"start\":53486},{\"end\":53816,\"start\":53770},{\"end\":54075,\"start\":54003},{\"end\":54345,\"start\":54284},{\"end\":54775,\"start\":54713},{\"end\":55054,\"start\":54986},{\"end\":55374,\"start\":55300},{\"end\":55697,\"start\":55618},{\"end\":55949,\"start\":55918},{\"end\":56446,\"start\":56408},{\"end\":56791,\"start\":56712},{\"end\":56986,\"start\":56959},{\"end\":57188,\"start\":57123},{\"end\":57533,\"start\":57436},{\"end\":57917,\"start\":57865},{\"end\":58449,\"start\":58366},{\"end\":59343,\"start\":59266},{\"end\":59820,\"start\":59725},{\"end\":60309,\"start\":60229},{\"end\":60634,\"start\":60582},{\"end\":60990,\"start\":60931},{\"end\":61248,\"start\":61202},{\"end\":61561,\"start\":61513},{\"end\":61787,\"start\":61713},{\"end\":62307,\"start\":62275},{\"end\":62478,\"start\":62432},{\"end\":62703,\"start\":62662},{\"end\":63020,\"start\":62975},{\"end\":63319,\"start\":63255},{\"end\":63658,\"start\":63615},{\"end\":63906,\"start\":63838}]", "bib_author": "[{\"end\":48976,\"start\":48961},{\"end\":49089,\"start\":49079},{\"end\":49099,\"start\":49089},{\"end\":49218,\"start\":49208},{\"end\":49230,\"start\":49218},{\"end\":49406,\"start\":49392},{\"end\":49414,\"start\":49406},{\"end\":49426,\"start\":49414},{\"end\":49661,\"start\":49651},{\"end\":49673,\"start\":49661},{\"end\":49822,\"start\":49812},{\"end\":49833,\"start\":49822},{\"end\":49850,\"start\":49833},{\"end\":50105,\"start\":50095},{\"end\":50116,\"start\":50105},{\"end\":50382,\"start\":50375},{\"end\":50392,\"start\":50382},{\"end\":50402,\"start\":50392},{\"end\":50411,\"start\":50402},{\"end\":50666,\"start\":50654},{\"end\":50674,\"start\":50666},{\"end\":50685,\"start\":50674},{\"end\":50693,\"start\":50685},{\"end\":50703,\"start\":50693},{\"end\":50716,\"start\":50703},{\"end\":50724,\"start\":50716},{\"end\":50734,\"start\":50724},{\"end\":50745,\"start\":50734},{\"end\":50752,\"start\":50745},{\"end\":51015,\"start\":51004},{\"end\":51025,\"start\":51015},{\"end\":51173,\"start\":51163},{\"end\":51181,\"start\":51173},{\"end\":51191,\"start\":51181},{\"end\":51422,\"start\":51411},{\"end\":51436,\"start\":51422},{\"end\":51592,\"start\":51581},{\"end\":51807,\"start\":51800},{\"end\":51815,\"start\":51807},{\"end\":51823,\"start\":51815},{\"end\":51831,\"start\":51823},{\"end\":52183,\"start\":52170},{\"end\":52198,\"start\":52183},{\"end\":52482,\"start\":52469},{\"end\":52495,\"start\":52482},{\"end\":52510,\"start\":52495},{\"end\":52518,\"start\":52510},{\"end\":52526,\"start\":52518},{\"end\":52536,\"start\":52526},{\"end\":52546,\"start\":52536},{\"end\":52559,\"start\":52546},{\"end\":52565,\"start\":52559},{\"end\":52834,\"start\":52827},{\"end\":52846,\"start\":52834},{\"end\":52858,\"start\":52846},{\"end\":53063,\"start\":53055},{\"end\":53075,\"start\":53063},{\"end\":53088,\"start\":53075},{\"end\":53099,\"start\":53088},{\"end\":53113,\"start\":53099},{\"end\":53121,\"start\":53113},{\"end\":53350,\"start\":53339},{\"end\":53562,\"start\":53550},{\"end\":53573,\"start\":53562},{\"end\":53582,\"start\":53573},{\"end\":53591,\"start\":53582},{\"end\":53824,\"start\":53818},{\"end\":53842,\"start\":53824},{\"end\":54089,\"start\":54077},{\"end\":54103,\"start\":54089},{\"end\":54114,\"start\":54103},{\"end\":54356,\"start\":54347},{\"end\":54535,\"start\":54525},{\"end\":54549,\"start\":54535},{\"end\":54568,\"start\":54549},{\"end\":54582,\"start\":54568},{\"end\":54790,\"start\":54777},{\"end\":54802,\"start\":54790},{\"end\":54813,\"start\":54802},{\"end\":54822,\"start\":54813},{\"end\":55065,\"start\":55056},{\"end\":55076,\"start\":55065},{\"end\":55388,\"start\":55376},{\"end\":55398,\"start\":55388},{\"end\":55411,\"start\":55398},{\"end\":55420,\"start\":55411},{\"end\":55431,\"start\":55420},{\"end\":55710,\"start\":55699},{\"end\":55729,\"start\":55710},{\"end\":55743,\"start\":55729},{\"end\":55961,\"start\":55951},{\"end\":55974,\"start\":55961},{\"end\":56159,\"start\":56144},{\"end\":56174,\"start\":56159},{\"end\":56459,\"start\":56448},{\"end\":56807,\"start\":56793},{\"end\":57001,\"start\":56988},{\"end\":57013,\"start\":57001},{\"end\":57025,\"start\":57013},{\"end\":57202,\"start\":57190},{\"end\":57211,\"start\":57202},{\"end\":57548,\"start\":57535},{\"end\":57558,\"start\":57548},{\"end\":57570,\"start\":57558},{\"end\":57928,\"start\":57919},{\"end\":57936,\"start\":57928},{\"end\":57947,\"start\":57936},{\"end\":57956,\"start\":57947},{\"end\":57969,\"start\":57956},{\"end\":57985,\"start\":57969},{\"end\":58194,\"start\":58178},{\"end\":58203,\"start\":58194},{\"end\":58213,\"start\":58203},{\"end\":58461,\"start\":58451},{\"end\":58469,\"start\":58461},{\"end\":58481,\"start\":58469},{\"end\":58491,\"start\":58481},{\"end\":58505,\"start\":58491},{\"end\":58516,\"start\":58505},{\"end\":58530,\"start\":58516},{\"end\":58541,\"start\":58530},{\"end\":58555,\"start\":58541},{\"end\":58566,\"start\":58555},{\"end\":58896,\"start\":58885},{\"end\":58903,\"start\":58896},{\"end\":58913,\"start\":58903},{\"end\":58919,\"start\":58913},{\"end\":58929,\"start\":58919},{\"end\":58939,\"start\":58929},{\"end\":58961,\"start\":58939},{\"end\":58975,\"start\":58961},{\"end\":58992,\"start\":58975},{\"end\":58998,\"start\":58992},{\"end\":59356,\"start\":59345},{\"end\":59370,\"start\":59356},{\"end\":59377,\"start\":59370},{\"end\":59399,\"start\":59377},{\"end\":59409,\"start\":59399},{\"end\":59415,\"start\":59409},{\"end\":59427,\"start\":59415},{\"end\":59440,\"start\":59427},{\"end\":59449,\"start\":59440},{\"end\":59471,\"start\":59449},{\"end\":59833,\"start\":59822},{\"end\":59843,\"start\":59833},{\"end\":59853,\"start\":59843},{\"end\":59863,\"start\":59853},{\"end\":59875,\"start\":59863},{\"end\":59894,\"start\":59875},{\"end\":59908,\"start\":59894},{\"end\":59919,\"start\":59908},{\"end\":59927,\"start\":59919},{\"end\":59939,\"start\":59927},{\"end\":60318,\"start\":60311},{\"end\":60646,\"start\":60636},{\"end\":60655,\"start\":60646},{\"end\":61005,\"start\":60992},{\"end\":61020,\"start\":61005},{\"end\":61033,\"start\":61020},{\"end\":61044,\"start\":61033},{\"end\":61258,\"start\":61250},{\"end\":61271,\"start\":61258},{\"end\":61282,\"start\":61271},{\"end\":61292,\"start\":61282},{\"end\":61304,\"start\":61292},{\"end\":61318,\"start\":61304},{\"end\":61329,\"start\":61318},{\"end\":61337,\"start\":61329},{\"end\":61575,\"start\":61563},{\"end\":61585,\"start\":61575},{\"end\":61802,\"start\":61789},{\"end\":61816,\"start\":61802},{\"end\":62051,\"start\":62035},{\"end\":62064,\"start\":62051},{\"end\":62321,\"start\":62309},{\"end\":62329,\"start\":62321},{\"end\":62488,\"start\":62480},{\"end\":62494,\"start\":62488},{\"end\":62506,\"start\":62494},{\"end\":62714,\"start\":62705},{\"end\":62724,\"start\":62714},{\"end\":62733,\"start\":62724},{\"end\":62741,\"start\":62733},{\"end\":63031,\"start\":63022},{\"end\":63040,\"start\":63031},{\"end\":63333,\"start\":63321},{\"end\":63345,\"start\":63333},{\"end\":63356,\"start\":63345},{\"end\":63371,\"start\":63356},{\"end\":63670,\"start\":63660},{\"end\":63684,\"start\":63670},{\"end\":63698,\"start\":63684},{\"end\":63917,\"start\":63908},{\"end\":63925,\"start\":63917},{\"end\":63931,\"start\":63925},{\"end\":63937,\"start\":63931},{\"end\":63943,\"start\":63937},{\"end\":63950,\"start\":63943}]", "bib_venue": "[{\"end\":48959,\"start\":48944},{\"end\":49244,\"start\":49230},{\"end\":49390,\"start\":49331},{\"end\":49676,\"start\":49673},{\"end\":49879,\"start\":49850},{\"end\":50093,\"start\":50029},{\"end\":50373,\"start\":50281},{\"end\":50773,\"start\":50752},{\"end\":51028,\"start\":51025},{\"end\":51226,\"start\":51191},{\"end\":51442,\"start\":51436},{\"end\":51609,\"start\":51592},{\"end\":51860,\"start\":51831},{\"end\":52221,\"start\":52198},{\"end\":52568,\"start\":52565},{\"end\":52862,\"start\":52858},{\"end\":53128,\"start\":53121},{\"end\":53378,\"start\":53350},{\"end\":53616,\"start\":53591},{\"end\":53877,\"start\":53842},{\"end\":54131,\"start\":54114},{\"end\":54374,\"start\":54356},{\"end\":54523,\"start\":54478},{\"end\":54839,\"start\":54822},{\"end\":55134,\"start\":55076},{\"end\":55448,\"start\":55431},{\"end\":55757,\"start\":55743},{\"end\":55989,\"start\":55974},{\"end\":56142,\"start\":56078},{\"end\":56525,\"start\":56459},{\"end\":56828,\"start\":56807},{\"end\":57029,\"start\":57025},{\"end\":57265,\"start\":57211},{\"end\":57640,\"start\":57570},{\"end\":57989,\"start\":57985},{\"end\":58176,\"start\":58139},{\"end\":58570,\"start\":58566},{\"end\":58883,\"start\":58805},{\"end\":59477,\"start\":59471},{\"end\":59961,\"start\":59939},{\"end\":60388,\"start\":60318},{\"end\":60721,\"start\":60655},{\"end\":61055,\"start\":61044},{\"end\":61344,\"start\":61337},{\"end\":61602,\"start\":61585},{\"end\":61827,\"start\":61816},{\"end\":62033,\"start\":61963},{\"end\":62344,\"start\":62329},{\"end\":62537,\"start\":62506},{\"end\":62805,\"start\":62741},{\"end\":63088,\"start\":63040},{\"end\":63424,\"start\":63371},{\"end\":63715,\"start\":63698},{\"end\":64003,\"start\":63950},{\"end\":56578,\"start\":56527},{\"end\":60774,\"start\":60723},{\"end\":63123,\"start\":63090}]"}}}, "year": 2023, "month": 12, "day": 17}