{"id": 227162679, "updated": "2023-10-06 08:34:34.913", "metadata": {"title": "SurFree: a fast surrogate-free black-box attack", "authors": "[{\"first\":\"Thibault\",\"last\":\"Maho\",\"middle\":[]},{\"first\":\"Teddy\",\"last\":\"Furon\",\"middle\":[]},{\"first\":\"Erwan\",\"last\":\"Merrer\",\"middle\":[\"Le\"]}]", "venue": "Proceedings of the IEEE/CVF Conference on Computer Vision and Pattern Recognition, CVPR 2021", "journal": "2021 IEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR)", "publication_date": {"year": 2020, "month": null, "day": null}, "abstract": "Machine learning classifiers are critically prone to evasion attacks. Adversarial examples are slightly modified inputs that are then misclassified, while remaining perceptively close to their originals. Last couple of years have witnessed a striking decrease in the amount of queries a black box attack submits to the target classifier, in order to forge adversarials. This particularly concerns the black-box score-based setup, where the attacker has access to top predicted probabilites: the amount of queries went from to millions of to less than a thousand. This paper presents SurFree, a geometrical approach that achieves a similar drastic reduction in the amount of queries in the hardest setup: black box decision-based attacks (only the top-1 label is available). We first highlight that the most recent attacks in that setup, HSJA, QEBA and GeoDA all perform costly gradient surrogate estimations. SurFree proposes to bypass these, by instead focusing on careful trials along diverse directions, guided by precise indications of geometrical properties of the classifier decision boundaries. We motivate this geometric approach before performing a head-to-head comparison with previous attacks with the amount of queries as a first class citizen. We exhibit a faster distortion decay under low query amounts (few hundreds to a thousand), while remaining competitive at higher query budgets.", "fields_of_study": "[\"Computer Science\"]", "external_ids": {"arxiv": "2011.12807", "mag": "3110642986", "acl": null, "pubmed": null, "pubmedcentral": null, "dblp": "conf/cvpr/MahoFM21", "doi": "10.1109/cvpr46437.2021.01029"}}, "content": {"source": {"pdf_hash": "6e574db0923c1d6e364c9b655ba7da831a9afd1d", "pdf_src": "Arxiv", "pdf_uri": "[\"https://arxiv.org/pdf/2011.12807v1.pdf\"]", "oa_url_match": true, "oa_info": {"license": null, "open_access_url": "http://arxiv.org/pdf/2011.12807", "status": "GREEN"}}, "grobid": {"id": "d64cb8000b0f876720f30b4a83041f1b483824af", "type": "plain-text", "url": "s3://ai2-s2-pdf-extraction-prod/parse-results/s2orc_worker/6e574db0923c1d6e364c9b655ba7da831a9afd1d.txt", "contents": "\nSurFree: a fast surrogate-free black-box attack\n\n\nThibault Maho thibault.maho@inria.fr \nErwan Le Merrer erwan.le-merrer@inria.fr \n\nTeddy Furon Univ. Rennes, Inria\nUniv. Rennes\nCNRS\nIRISA\nRennesInriaFrance\n\n\nCNRS\nIRISA\nRennesFrance\n\n\nUniv. Rennes, Inria\nCNRS\nIRISA\nRennesFrance\n\nSurFree: a fast surrogate-free black-box attack\n\nMachine learning classifiers are critically prone to evasion attacks. Adversarial examples are slightly modified inputs that are then misclassified, while remaining perceptively close to their originals. Last couple of years have witnessed a striking decrease in the amount of queries a black box attack submits to the target classifier, in order to forge adversarials. This particularly concerns the black box score-based setup, where the attacker has access to top predicted probabilites: the amount of queries went from to millions of to less than a thousand. This paper presents SurFree, a geometrical approach that achieves a similar drastic reduction in the amount of queries in the hardest setup: black box decision-based attacks (only the top-1 label is available). We first highlight that the most recent attacks in that setup, HSJA [3], QEBA[14]and GeoDA [23] all perform costly gradient surrogate estimations. SurFree proposes to bypass these, by instead focusing on careful trials along diverse directions, guided by precise indications of geometrical properties of the classifier decision boundaries. We motivate this geometric approach before performing a headto-head comparison with previous attacks with the amount of queries as a first class citizen. We exhibit a faster distortion decay under low query amounts (few hundreds to a thousand), while remaining competitive at higher query budgets. 1\n\nIntroduction\n\nThe literature on adversarial examples is divided into two shares, depending on the threat model: either the attacker has full knowledge of the target classifier [2,26,17] (whitebox setting) or she/he has an unrestricted query access to the unknown classifier [18,1,14,23,3,28,13,27,11,5,12,4] (black-box setting). The latter scenario is deemed as more 1 The code of SurFree is available at https://github.com/tmaho/SurFree SurFree GeoDA [23] QEBA [14] Number of queries relevant to gauge the intrinsic robustness of classifiers in real-world applications (typically queried through an API). Black box attacks are iterative procedures that keep on refining the quality of an adversarial example based on the pairs of submitted input / observed output. They are coined score-based when the attacker observes the top-k predicted probabilities or decision-based (a.k.a. hard label) when she/he only learns the top-k labels (k ≥ 1). Indeed, the latter case where the output is solely the top-1 label is the most challenging because the attacker cannot rely on any rich information for crafting these adversarial examples.\n\nIt is striking that black-box attacks always use substitution to replace information they are missing. Early blackbox attacks used a surrogate model (trained from a huge number of input / output pairs) mimicking the targeted model [20,21]. The attack then boils down to a white-box setting on the surrogate with the hope that the adversarial example transfers to the target classifier. Almost all recent score-based attacks resort to gradient estimation to compensate for the lack of back-propagation, which is the key instrument of any white-box attack [4,27,13,28]. The Hop-SkipJump attack (HSJA [3]) estimates the decision boundary by an hyperplane. As a last example, authors in [12] turn a decision-based setup into a score-based by probing noisy versions of an image to derive a score-like function from the top-k labels. The trend is thus to substitute missing information by estimates in order to fall back to an easier setup.\n\nThe need for faster attacks consuming fewer queries is already present in the literature. Most notably, research works on score-based attacks managed to reduce query amount from millions of requests [12] to less than a thousand with most recent approaches [28]. Surprisingly, this impressive decrease has not reached comparable levels in the hard-label setup. In particular, paper [12] questions the model surrogate approach: while a considerable amount of queries is spent for training the surrogate, not a single adversarial example is forged. Moreover, access to the target model in practice is usually not free and not unlimited 2 .\n\nYet, this argument should challenge any substitution mechanisms. They all consume a fair amount of queries and it is not clear whether they are worth the gain in term of distortion. Especially, many techniques trade some query amount for an accurate gradient estimate giving birth to good perturbation directions [23,3]. While spending these queries, the adversarial example is not updated and the distortion stalls as illustrated in Fig. 1.\n\nThis paper considers the query amount as a central criterion. It presents a fast black-box decision-based attack, named SurFree, motivated by practical applications in which a low amount of queries is key. Fast means that it outperforms the state of the art when it comes to the distortion of adversarials under a low query budget (as examplified in Fig. 1 with the purple curve).\n\nThe main contributions of this paper are:\n\n• SurFree, a black box decision-based attack not using any substitution mechanism: no surrogate of the target model, no score reconstruction, no estimation of gradient. It is inspired by the early works [8,1].\n\n• a geometrical mechanism to get the biggest distortion decrease for a given direction to be explored under the assumption of a hyperplane boundary [10].\n\n• a head to head comparison of the recent approaches with distortion as a function of query number.\n\nExperimental results show that SurFree overcomes state of the art on the query amount factor (a thousand of queries), while still remaining competitive with unlimited queries (normal scenario for competitors).\n\n\nRelated Works\n\n\nWatermarking\n\nDigital watermarking embeds a secret and invisible mark into images. A watermark detector is a two-class classifier checking for the presence or absence of the mark in a query image. This community called oracle attack what we now call a black-box attack: the attacker has the secret-keyed detector in hand as a black sealed box, and calls it iteratively to either estimate the secret key or to remove the watermark from protected images. This latter problem is equivalent to forging adversarial images in the decision based setting.\n\nAll the ingredients used nowadays were already present in this literature dating back to 1997 [7,15]: surjection onto the boundary with binary search, estimation of the gradient at a 'sensitive' point lying on the boundary, dimension reduction. The new HopSkipJumpAttack [3] is indeed very similar to the old Blind Newton Sensitivity Attack [6]. The last work on this subject by this community [8] surprisingly does not use any gradient estimate but random directions; this is also the case of the very first decision-based attack [1].\n\n\nBlack box adversarial examples\n\nThis paper operates in a black box setup; white box attacks [2,26,17] are considered out of its scope.\n\nThere has been a huge improvement on the amount of queries of score-based black box attacks. On ImageNet, the order of magnitudes of the first attacks were of some hundreds of thousands queries for one image with a reported runtime of 20 minutes in [4]. Nowadays state-of-the-art attacks make less than one thousand calls to the classifier, thanks to advanced gradient estimators [13] and Zero Order Optimization techniques [27,28,16].\n\nThe decision-based attacks followed the same trend but with a factor of ten. Brendel et al. report in the order of one million of queries for one image in one of the first black-box decision based paper [1, Fig. 6]. Then, the order of magnitude went down to tens of thousands [3, Fig. 4] [14,Fig. 5] and even some thousands in [23,Fig. 2]. No decision-based paper reports results with less than one thousand of calls on ImageNet. This paper explores this range of query budget.\n\nThe main engine of the decision-based attacks iterates the three following steps: i) the surjection (find a point on the boundary), ii) the estimation of the gradient (i.e. the normal vector of the tangent hyperplane), iii) the update of the adversarial example.\n\nStep ii) proceeds by bombarding the model with small perturbations around the boundary point. The main problems are the trade-off between the number of queries devoted to this task and the accuracy of the gradient estimate (see [3,Th. 2], [23,Lemma 2], [14,Th. 1]) and the impact of this accuracy on the convergence of the attack (see [23,Th. 2]). In the end, [23] recommends that step ii) consumes a number of queries following a geometric sequence w.r.t. the iteration number, whereas [3] makes it proportional to the square root of the iteration number. This paper follows the opposite strategy: no query is spent for a gradient estimate.\n\nA second track of improvement is dimension reduction restricting the perturbation to a low dimension subspace. This a priori increases of distortion at convergence since the attacker has fewer degrees of freedom, but it indeed facilitates the estimation of the projected gradient. The latter is more important for low query budget. The choice of the subspace incorporates prior information: it usually corresponds to a low-frequency band (of the full DCT transform [23,14]) containing most critical information about the visual content of the image. This paper shows that the block DCT yields better results.\n\n\nProblem statement\n\nWe introduce the following notations. The pre-trained classifier is represented as the function f :\n[0, 1] D → R C . For a given input image x, the final decision is the top-1 label cl(x) := arg max k f k (x), f k (x) being the predicted probability of class k, 1 ≤ k ≤ C.\nThe attacker does not know the function f and can only observe the decision cl(x) for any image x. From an original well classified image x o , the attack is untargeted as it looks for an image x a close to x o and s.t. cl(x a ) = cl(x o ). This defines the outside region O := {x ∈ R D : cl(x) = cl(x o )} and the optimal adversarial image:\nx a = arg min x∈O x − x o .(1)\nThis is a hard problem and the attack is indeed an efficient algorithm finding an approximate solution. We assume that when knowing a point y ∈ O, it is possible to find a point x b ∈ [x o , y] that lies on the boundary denoted by ∂O. This is usually done by a line search in the literature [3,14,23]. There has been experimental evidence that the boundary is a rather smooth low curvature surface for deep neural networks [9]. This justifies that the boundary is often approximated by an hyperplane locally around a boundary point: in other words, locally around\nx b ∈ ∂O, there exists n ∈ R D , n = 1 s.t. y ∈ O if y n ≥ x b n.\n\nOur Approach\n\nThe study of the recent attacks [3,23,14] under the query budget viewpoint, reveals the presence of plateaus (see Fig. 1). These are due to the construction of a surrogate for gradients, and appear to be particularly costly. Moreover, the budget allocated to gradient estimate in [3] does not impact the speed of convergence: fewer queries give less accurate gradient estimates yielding a smaller distortion decrease but at a higher rate. Our rationale is to set this query budget to its extreme value, i.e. zero. We thus trade this budget for more directions investigated with the hope that their multiplication allows for a faster distorsion decrease. We now develop this idea.\n\n\nBasic idea\n\nLet us assume that we know a point on the boundary:\nx b ∈ ∂O. We define d := x b − x o and u := (x b − x o )/d so that u = 1.\nWe restrict the search for a closer adversarial point in a random affine plane P of dimension 2. This plane P contains the point x o and is spanned by vector u and a random orthogonal\ndirection v ∈ R D , v = 1, v u = 0. Note that x b ∈ P.\nIn polar coordinates, we consider a point in P that is at a distance d(1 − α) from x o and makes an angle θ with u:\nz(α, θ) = d(1 − α) (cos(θ)u + sin(θ)v) + x o , (2) with α ∈ [0, 1] and θ ∈ [−π, π]. Note that z(0, 0) = x b and z(1, θ) = x o , ∀θ. If z(α, θ) is adversarial, then the distortion decreases by 100 × α%.\nThis section shows how to choose (α, θ) to raise the probability of z(α, θ) being adversarial. This study makes a clear cut with [8,1] which also consider random directions.\n\nThis section assumes that the intersection ∂O ∩ P is a line passing by x b and with normal vector n ∈ P, n = 1. Without loss of generality, n is pointing outside\ns.t. a point z ∈ P is adversarial if (z − x b ) n ≥ 0. In polar coordi- nates, n := cos(ψ)u + sin(ψ)v with ψ ∈ (−π/2, π/2).\nThe point z(α, θ) ∈ ∂O ∩ P minimizing the distance from x o is the projection of x o onto this line, obtained for θ = ψ and α = 1 − cos(ψ). The attacker can not create this optimal point because angle ψ is unknown. Note that\n• If ψ = 0, then n = u, v n = 0, (z(α, θ) − x b ) n = d((1 − α) cos(θ) − 1) < 0, and z(α, θ)\nis not adversarial. This corresponds to the case where ∂O ∩ P is a tangent line of the circle of center x o and radius d. This implies that x b is already optimum because it is the projection of x o onto ∂O ∩ P.\n• If θ = 0 and α > 0, then (z(α, 0) − x b ) n = α(x o − x b ) n < 0 because x o is not adversarial. Therefore, z(α, 0) is not adversarial. For θ = 0, calculation shows that z(α, θ) is adversarial if g α (θ) := 1 − (1 − α) cos(θ) (1 − α) sin(θ) ≤ tan(ψ)sign(θ). (3)\nPoint z(α, θ) might be adversarial only if ψ and θ share the same sign s.t. the rhs (3) is positive. In this case, the surprise is that (3) separates parameters (α, θ) that the attacker controls from the unknown angle ψ.\n\nMinimizing g α (θ) raises the chances that (3) holds. Its derivative cancels for θ = θ (α) := ± arccos(1 − α) (according to the sign of ψ) so that This quantity is an increasing function of α ranging from 0 (α = 0) to +∞ (α → 1). From now on, we denote by z (θ) a point created with this coupling between θ and α, z (θ) := z(1 − cos(θ), θ).\ng α (θ (α)) = 1 − (1 − α) 2 1 − α = | tan(θ (α))|. (4) O ∩ P ∂O ∩ P n ψ θ d d(1 − α) u v x o x b z (θ) z (θ )Property 1 Consider the mid-point c = (x o + x b )/2. The locus of the points z (θ) ∈ P is the circle of center c and radius d/2. Indeed, z (0) = x b and z (±π/2) = x o .\nLittle algebra shows that z (θ) − c = d/2, ∀θ ∈ [−π/2, π/2]. This circle is depicted in red in Fig. 2.\nProperty 2 If z (θ) is adversarial, then so is z (φ) for φ ∈ [0, θ]. Conversely, if z (θ) is not adversarial, then so is z (φ) for φ ∈ [θ, sign(θ).π/2].\nThis is due to the monotonicity of function α → g α (θ (α)).\n\nProperty 3 θ = ψ is the angle yielding a maximum distortion decrease of α = 1 − cos(ψ). The point z (θ ) is indeed the projection of x o on the boundary line ∂O ∩ P:\nz (θ ) = d cos(ψ)n + x o .\nThis is shown by injecting (4) in (3).\n\n\nIterations over orthonormal directions\n\nThis section assumes that the boundary ∂O is an affine hyperplane passing through x b,1 in R D , with normal vector N. We consider a random basis of span(\nx b,1 − x o ) ⊥ composed of D − 1 vectors {v i } D−1 i=1 .\nThe normal vector is decomposed in spherical coordinates:\nN = sin(ψ D−1 )v D−1 + cos(ψ D−1 ) sin(ψ D−2 )v D−2 + . . . + cos(ψ D−1 ) . . . cos(ψ 2 )n 1 ,(5)\nwhere n 1 := sin(ψ 1 )v 1 + cos(ψ 1 )u 1 is the 2 normalized projection of N onto hyperplane P 1 spanned by v 1 and u 1 :\n= (x b,1 − x o )/d. Note that N u 1 = cos(ψ D−1 ) . . . cos(ψ 1 ).\nWe then find x b,2 := z (θ ) ∈ O∩P 1 as given in Prop. 3 and define u 2 := (x b,2 −x o )/d cos(ψ 1 ) = n 1 . We solve the problem in P 2 spanned by v 2 and u 2 . Note that N u 2 = cos(ψ D−1 ) . . . cos(ψ 2 ) ≥ N u 1 .\n\nProperty 4 Iterating this process converges to the adversarial point with minimal distortion.\n\nIterations increase the scalar product between N and (x b,k − x o ) ∝ u k given by:\nN u k = D−k i=1 cos(ψ D−i ).(6)\nAt the end, x b,D ∈ O and x b,D −x o is colinear with N, thus pointing to the projection of x o to the hyperplane boundary. A clever strategy browses the directions according to the decreasing order of their angles (|ψ k |) k (biggest distortion decreases first). This is out of reach for the attacker oblivious to N and not willing to spend queries for its estimate.\n\n\nConvex boundary\n\nOur procedure can be seen as a coordinate descent on a random basis. If the boundary ∂O is not a hyperplane but a smooth and convex surface, then cycling over the vectors {v i } D−1 i=1 multiple times ensures convergence to a local minimum [19]. On one hand, this reference shows that the rate of convergence of the random coordinate descent (on expectation) is essentially the same as the worst-case rate of the standard gradient descent (when it is available). On the other hand, estimating the gradient in the black-box setting costs more queries than the coordinate descent of Sect. 4.1. These conflicting arguments deserve investigation.\n\n\nThe SurFree attack\n\nThis section presents the attack based on the ideas explained in Sect. 4. One iteration of SurFree is summarized in pseudo-code Alg. 1.\n\n\nThe algorithm\n\nInitialisation. The algorithm needs an initial point x b,1 ∈ ∂O. It first generates a point y 0 ∈ O. As done in [23,14], y 0 is one image from the targeted class (targeted attack) or a noisy version of x o (untargeted attack). Defining y λ = λx o + (1 − λ)y 0 , a binary search over λ ∈ (0, 1) results in x b,1 adversarial and close to the boundary.\n\nNew direction. At iteration k, the point x b,k ∈ O and close to the boundary defines u k ∝ x b,k − x o , u k = 1. Line 3 generates pseudo-randomly t k ∼ T (see Sect. 5.2). A Gram-Schmidt procedure makes it orthogonal to u k and to the L (at most) last directions 1) , producing the new directions v k in line 4.\nV k−1 := {v j } k−1 j=max(k−L,\nSign Search. The algorithm considers points z(α, θ) as defined in (2)  The search stops as soon as an adversarial image is found. If this fails, line 17 decreases θ max , direction v is given up (line 18), and another direction is generated.\nwith u = u k , v = v k , d k := x b,k − x o ,\nBinary Search. When the sign search finds an adversarial image at θ = θ max .t/T , the binary search in line 12 refines the angle θ over the interval θ max /T.[t, t + sign(t)] within steps. The result is θ s.t. z (θ ) ∈ O is the new boundary point x b,k+1 provoking a distortion decrease α = 1 − cos(θ ).\n\n\nDistribution of the directions\n\nThe algorithm is a random process as it draws directions from distribution T according to Alg. 2. This has two roles: dimension reduction and adaptivity to the content of x o .\n\nDimension reduction is implemented with the help of a reversible image transformation (DCT 8 × 8, or full frame DCT in Table 1). Line 3 selects a fraction ρ of the transform coefficients, typically in the low frequency subband. We draw ρD samples uniformly distributed over {−1, 0, 1}, the other transform coefficients being set to 0. The inverse transform yields the direction t in the pixel domain.\n\nAdaptivity to the visual content makes the perturbation less perceptible thanks to the masking effect well know in image watermarking [8]. It shapes the adversarial perturbation like the visual content of x o . The following is a simple implementation of this principle: denote the i-th transform coefficient of image x o by X o,i . Line 5 modulates the amplitude of a random variables by A(|X o,i |), where A : R + → R + is a non decreasing function. The goal is to shape the power distribution of the perturbation as the one of the original image.\n\n\nInterpolation\n\nSection 4 motivated our design assuming the boundary is an hyperplane. This extra interpolation is an option of SurFree inspired by the watermarking attack [8], which tackles convex surfaces with small curvature as in Fig. 3.\n\nA given iteration starts with x b,k ∈ ∂O at angle θ = 0 and distance d. The binary search in line 12 gives the angle θ of a boundary point at distance d cos(θ ). This option finds a third point on the boundary at angle θ /2 thanks to a binary search between x o and z (θ /2). This point, depicted in blue in Fig. 3, is at distance δ ≤ d cos(θ /2). Thanks to these three boundary points resp. at angle 0, θ /2, and θ , we interpolate the mapping from angle to distance (of the surjection of z(α, θ) onto the boundary) by a second order polynomial and find its minimum at:\nO ∩ P ∂O ∩ P x o x b z (θ ) θ /2 θ d δ d c o s ( θ ) z (θ /2)θ = θ 4 4δ − d(cos(θ ) + 3) 2δ − d(cos(θ ) + 1) .(7)\nThis option concludes by a binary search finding the point on the boundary between x o and z (θ). The new point x b,k+1 is the closest point we found on the boundary.  θ = BS(θ max .τ j ; θ max (τ j + sign(τ j )/T )) 13:\nEnsure: Output x b,k+1 ∈ ∂O, V k 1: New direction 2: u k = η(x b,k − x o ) η(x) := x/ x 3: t k ∼ T Algorithm 2 4: v k = η proj span(V k−1 ∪u k ) ⊥ (t k ) Gram-Schmidt 5: V k = V k−1 ∪ {v k } 6: Sign Search 7: j = 1, τ = (T, −T, (T − 1), −(T − 1), . . . , 1, −1) /T 8: while z (θ max .τ j ) / ∈ O ∧ j ≤ 2T doθ max ← θ max /(1 − κ) 14:\nReturn x b,k+1 = z (θ ) 15: or Interpolation Sect. 5.3 16: else Sign Search failed 17: θ max ← θ max × (1 − κ) Geometric decay 18: Go to line 3 Give up T j = 0\n8: Return t = η DCT −1 (T) η(x) := x/ x\n\nExperimental Work\n\nWe first specify the experimental setup and the parameters of our approach. We then perform an ablation study on SurFree (subsection 6.2), for it allows to precise gains on the two considered metrics. Subsection 6.3 performs a head-to-head comparison of all the competing approaches.\n\n\nDatasets and Experimental Setup\n\nDatasets For MNIST, we use a pre-trained CNN network that is composed of 2 convolutional layers and 2 fully connected Layers. Its accuracy is 99.14%. A subset of 100 correctly classified images have been randomly chosen to perform the ablation study. Our attack generates directions on the pixel domain without any dimension reduction.\n\nThe ImageNet dataset is tackled by a pre-trained ResNet18, made available for the PyTorch environment [22]. Its top-1 accuracy is 0.3024. We randomly selected 350 correctly classified images from the ILSVRC2012's validation set with size D = 3 × 224 × 224.\n\n\nSetup and Code\n\nWe now detail the specific parameters of SurFree, for both MNIST and ImageNet. We set empirically the following values in Alg. 1: T = 3, L = 100, θ max = 30, κ = 0.02, at most = 10 steps for the binary search (with an early stop if the range is lower than 1% of d). We develop SurFree on top of the FoolBox library.\n\n\nEvaluation Metrics\n\nThe two core evaluation metrics are the amount of queries, and the resulting distortion on the attacked image. The distortion is measured with the 2 norm over the space [0, 1] D (with D the number of pixels times the number of colour channel). For a given x o , it is the smallest distortion obtained over the sequence of queries (q j ) k j=1 that happen to be adversarial:\nd(k, x o ) := min 1≤j≤k :cl(qj ) =cl(xo) q j − x o 2(8)\nThe mean over N original images gives a characteristic of the attack efficiency revealing its capacity to find an adversary close to the original image and especially its speed.\nd(k) := 1 N N i=1 d(k, x o,i )(9)\nWe define the success rate as the probability of getting a distortion lower than a target d t within a query budget K:\nS(d t , K) := |{i : d(K, x o,i ) ≤ d t }| N(10)\n\nAblation Studies\n\nImpact of the components -MNIST This first ablation evaluates how the hyperplane hypothesis [10] meets a practical experimentation, and how the interpolation mechanism of Sect. 5.3 is able to compensate this hypothesis. To this end, four variants of our attack are tested in Fig. 4 \n\n\nand 5:\n\nSignSearch stops at line 10 of Alg. 1 whereas SurFree is the regular attack, '+Interpolation' uses the option 5.3. Our attack is highly random due to the generation of directions. This may yield unstable results with adversarial images of scattered distortion. Fig. 4 shows the distortion decrease averaged over 100 images and Fig. 5 the standard deviation for one image attacked 20 times.\n\nThis outlines the trade-off between the complexity of one iteration in terms of query number and the gain in the distortion decrease. The Interpolation option may yield substantial decrease depending on the direction. This explains its large standard deviation. Yet, its costs (2 more binary searches) slows down the speed. SignSearch is less costly and offers competitive distortions only at the beginning. SurFree strikes the right trade-off both in term of averaged distortion and standard deviation. Compared to SignSearch, it always exhausts the explored direction giving the best gain under the hyperplane boundary assumption. The first important insight is that this hypothesis seems to be good enough to ensure a rapid decay.\n\nThe ablation study also tested different values for some parameters of SurFree. The value of κ has no significant impact provided that κ > 0. Parameter T doesn't benefit from higher value because of the finer seach in line 12.\n\n\nImpact of the direction generation domain -ImageNet\n\nThe literature reports that black-box attacks have difficulty in handling large images like ImageNet. Attack become slow because the space is too large to be explored efficiently. All competing attacks resort to a dimension reduction, typically by leveraging a full DCT transform [14,23]. Yet, dimension reduction lowers the degrees of freedom for the attacker: the closest adversarial as defined in (1) has a bigger distortion under this constraint. The distortion supposedly converge faster but to a bigger limit. SurFree is no exception. Table 1 shows that the distortion in the full pixel domain is bigger within the first thousand queries. For the same query budget, constraining the perturbation to lie in a smaller low-frequency subspace defined with the full DCT as in [14,23] is beneficial. Yet, this holds to some extent: distortion reported for a reduction of ρ = 25% are always larger than those for 50%.\n\nWe now question the type of DCT transform. Indeed, while the DCT full frame is widely acclaimed, we prefer the block-based DCT as used in JPEG. It gives a better spacefrequency localization trade-off. Table 1 shows that it does change the distortions a lot. The last rows of Table 1 focus on the adaptivity to the visual content of the original image (see Sect. 5.2). Amplitude function A(x) = x concentrates the perturbation power too much on some high amplitude coefficients when the original image has sharp edges. tanh(x) is a good compromise between the constant and the identity functions. It offers early distortion drop and reaches similar levels than A(x) = cst in the long run.\n\nOur design is driven by the small query budget requirement so we choose tanh shaping function applied on ρ = 50% of the DCT 8×8 coefficients.\n\n\nBenchmarking\n\nWe compare to recent algorithms considered as stateof-the-art decision-based black-box attacks: HSJA [3],  Figure 6. Benchmark on ImageNet. The amount of queries k (xaxis) w.r.t. mean distortion d(k) (y-axis).\n\nGeoDA [23] and QEBA [14]. These 3 algorithms leverage gradient surrogates. The benchmark does not include older attacks like OPT [5] and BA [1] because they have proven less efficient than the three above-mentioned references.\n\nWe use the authors code for these algorithms: HSJA [3] is integrated in the FoolBox library [24,25].\n\nFor GeoDA [23] and QEBA [14], we pull implementations from their respective GitHub repositories 34 with default parameters. For GeoDA [23], the number of queries devoted to the gradient estimates follow a geometric progression of common ratio λ −2/3 with λ = 0.6, and the dimension reduction focuses on 5,625 coefficients of the full DCT transform. Concerning QEBA [14], ρ = 25% dimension reduction on low frequency full DCT coefficients. HSJA [3] works on the pixel domain, the number of queries devoted to gradient estimates scales as N 0 √ j with j the iteration number. We tested two versions with N 0 ∈ {10, 100}, which is directly observable with the larger plateaus on Fig. 6.\n\nA very important point is that all attacks are initialized with the same first adversarial example in order to avoid favoring a competitor by giving it an easier initialization.  Table 3. Visual trajectories for an easy (chickadee), a medium (king penguin), and a difficult image (warthog) -predicted label and distortion versus the amount of queries. SurFree presents a smooth curve, resulting from the averaging over 350 images. The other attacks still show large plateaus (as highlighted in Fig. 1 for one image) because gradient estimates are scheduled at the same instants for any image. Note that these plateaus are not shown in the papers because the distortion is seen as a function of the iteration number, not the query number. The two most recent attacks, QEBA [14] and GeoDA [23] indeed beat HSJA [3] as reported in the corresponding papers. SurFree dives significantly faster than all attacks to lower distortions (most notably from 1 to 750 queries), while QEBA [14] prevails at around 3, 750 queries. Note that SurFree is also first with DCT full but for a shorter period (≈ 800 queries). For completeness, here are the scores at 10,000 queries: 2.09 (QEBA [14]) < 2.72 (SurFree) < 3.48 (HSJA 10) < 4.63 (GeoDA [23]). Although a small query budget drives its design, SurFree is not off in the long run. Similar results are observed for MNIST (in the pixel domain, without dimension reduction) where SurFree is ahead up to ≈ 5, 000 queries.\n\nPerformance evaluation: Success rate We now consider three query budgets, K ∈ {500, 1, 000, 2, 000}, which are rather low with regards to the state-of-the-art (see Sect. 2.2). Table 2 details how the success rate S(d t , K) varies for some setup (d t , K) (10). Fig. 7 shows the success rate S(d t , 500) increase with d t . GeoDA [23] is superior to QEBA [14] for large target distortions only. Both schemes outperform HSJA [3]. SurFree remains the best attack for any target distortion up to this 2, 000 query budget.\n\nFinally, Table 3 displays the visual trajectories of three attacked images witnessed as easy, medium, and difficult to attack for SurFree. While all three attacks affect differently the images, SurFree gives relatively less annoying artefacts. We also note a drawback of QEBA [14]: the adversarials often keep the label of the random starting point (e.g. stingray), hence sometimes converging to a local minimum which is far from the optimal solution (1).\n\n\nConclusion\n\nThe performance of black box decision-based attacks reveals important gaps when it comes to the required amount of queries. Core to the three state-of-the-art approaches this papers considers is the estimation of gradients. This step is particularly costly, with regards to our novel geometrical attack SurFree. The trial of multiple directions together with a simple mechanism getting the best distortion decrease along a given direction allow a fast convergence to qualitative adversarials, within an order of hundreds of queries solely. This sets a new stage for future works.\n\nFigure 1 .\n1The perturbation distortion ( 2 norm) vs. the number of queries for image 'lizard'. Competitor attacks waste queries to estimate a gradient surrogate resulting in plateaus of distortion.\n\nFigure 2 .\n2The geometrical configuration of the problem in P.\n\n\nand the coupling cos(θ) = 1 − α. The sign of θ depends on the sign of unknown ψ (see Sect. 4.1). Hence, we test some angles starting with the biggest amplitudes, alternating + and -sign, as stored in the vector θ max .τ with τ := (1, −1, (T − 1)/T, −(T − 1)/T, . . . , 1/T, −1/T ).\n\nFigure 3 .\n3Interpolation mechanism to refine the boundary point.\n\nAlgorithm 1\n1One iteration of SurFree Require: Original image x o , boundary point x b,k ∈ ∂O, previous directions V k−1 := {v j }\n\nAlgorithm 2\n2Draw direction t ∼ T Require: Original image x o , frequency subband F s.t. |F| = ρD, A(·) shaping function Ensure: A random direction t perceptually shaped as x o 1: X o = DCT(x o ) 2: for j = 1 :\n\nFigure 4 .Figure 5 .\n45Ablation study on SurFree. Mean distortion d(k) (9) vs. number k of queries on MNIST. Ablation study on SurFree. The deviation of the distortion over 20 runs of SurFree on one MNIST image.\n\nFigure 7 .\n7Success rate S(dt, K) (10) vs. target distortion dt with K = 500 queries over ImageNet.\n\n\nSpace Shaping A(x) Dim. Reduc. ρ K = 100 K = 1000Pixel \n100% \n27.23 \n17.20 \nDCT f ull \ncst \n50% \n26.50 \n15.35 \nDCT f ull \ncst \n25% \n32.08 \n21.23 \nDCT 8×8 \ncst \n50% \n19.49 \n10.69 \nDCT 8×8 \ncst \n25% \n18.26 \n9.93 \nDCT 8×8 \nx \n50% \n20.11 \n11.96 \nDCT 8×8 \nx \n25% \n20.29 \n12.22 \nDCT 8×8 \ntanh(x) \n50% \n17.38 \n10.22 \nDCT 8×8 \ntanh(x) \n25% \n18.20 \n10.61 \nTable 1. Mean distortion d(K) when random directions are gener-\nated with different subspaces and shaping (ImageNet). \n\n100-HSJA [3] \n\n0 \n1000 \n2000 \n3000 \n4000 \n5000 \nNumber of queries \n\n10 \n\n20 \n\n30 \n\n40 \n\n50 \n\nDistortion \n\nSurFree \nGeoDA [23] \nQEBA [14] \n10-HSJA [3] \n\n\n\n\nPerformance evaluation: distortion vs. queries Figure 6 displays the distortion of the perturbation ( 2 norm) target K = 500 queries K = 1, 000 queries K = 2, 000 queries d t HSJA [3] GeoDA [23] QEBA [14] SurFree HSJA [3] GeoDA [23] QEBA [14] SurFree HSJA [3] GeoDA [23] QEBA [14] SurFreeTable 2. Success rate S(dt, K) for achieving a targeted distortion dt under a limited query budget K (ImageNet). attack K = 100 K = 500 K = 1000 K = 100 K = 500 K = 1000 K = 100 K = 500 K = 100030 \n0.56 \n0.79 \n0.71 \n0.90 \n0.88 \n0.93 \n0.88 \n0.96 \n0.98 \n0.96 \n0.97 \n0.99 \n10 \n0.13 \n0.25 \n0.32 \n0.44 \n0.23 \n0.52 \n0.46 \n0.57 \n0.40 \n0.70 \n0.69 \n0.73 \n5 \n0.07 \n0.14 \n0.17 \n0.23 \n0.09 \n0.21 \n0.30 \n0.31 \n0.13 \n0.39 \n0.47 \n0.50 \n\nSurFree \n\namer. dipper-2.6 \namer. dipper-1.3 \namer. dipper-0.9 \nstone wall-14.9 \nstone wall-8.7 \nstone wall-5.4 \ncliff dwelling-21.9 \ncliff dwelling-18.4 \ntriceratops-13.5 \n\nQEBA [14] \n\nstingray-60.6 \nstingray-33.7 \nstingray-20.8 \nstone wall-25.2 \nstone wall-4.8 \nstone wall-2.6 \nwombat-58.3 \nwombat-24.3 \nwombat-13.6 \n\nGeoDA [23] \n\nbrambling-18.9 \nbrambling-9.7 \nbrambling-5.8 \nstone wall-15.8 \nmegalith-4.5 \nmegalith-2.6 \narmadillo-49.4 \ntusker-31.3 \ntusker-18.9 \n\n\nsee e.g., https : / / azure . microsoft . com / en -us / pricing / details/cognitive-services/face-api/ for conditions.\nQEBA: https://github.com/AI-secure/QEBA 4 GeoDA: https://github.com/thisisalirah/GeoDA\n\nDecision-based adversarial attacks: Reliable attacks against black-box machine learning models. Wieland Brendel, Jonas Rauber, Matthias Bethge, International Conference on Learning Representations. Wieland Brendel, Jonas Rauber, and Matthias Bethge. Decision-based adversarial attacks: Reliable attacks against black-box machine learning models. In International Con- ference on Learning Representations, 2018. 1, 2, 3, 7\n\nTowards evaluating the robustness of neural networks. Nicholas Carlini, David Wagner, IEEE Symp. 1Nicholas Carlini and David Wagner. Towards evaluating the robustness of neural networks. In IEEE Symp. on Security and Privacy, 2017. 1, 2\n\nHopSkipJumpAttack: A query-efficient decision-based attack. Jianbo Chen, Martin J Michael I Jordan, Wainwright, 2020 IEEE Symposium on Security and Privacy (sp). IEEEJianbo Chen, Michael I Jordan, and Martin J Wainwright. HopSkipJumpAttack: A query-efficient decision-based at- tack. In 2020 IEEE Symposium on Security and Privacy (sp), pages 1277-1294. IEEE, 2020. 1, 2, 3, 7, 8\n\nZoo: Zeroth order optimization based blackbox attacks to deep neural networks without training substitute models. Pin-Yu Chen, Huan Zhang, Yash Sharma, Jinfeng Yi, Cho-Jui Hsieh, Proceedings of the 10th ACM Workshop on Artificial Intelligence and Security, AISec '17. the 10th ACM Workshop on Artificial Intelligence and Security, AISec '17New York, NY, USA1Pin-Yu Chen, Huan Zhang, Yash Sharma, Jinfeng Yi, and Cho-Jui Hsieh. Zoo: Zeroth order optimization based black- box attacks to deep neural networks without training substi- tute models. In Proceedings of the 10th ACM Workshop on Artificial Intelligence and Security, AISec '17, pages 15-26, New York, NY, USA, 2017. Association for Computing Ma- chinery. 1, 2\n\nQuery-efficient hard-label black-box attack: An optimization-based approach. Minhao Cheng, Thong Le, Pin-Yu Chen, Huan Zhang, Jinfeng Yi, Cho-Jui Hsieh, 7th International Conference on Learning Representations, ICLR 2019. New Orleans, LA, USAMinhao Cheng, Thong Le, Pin-Yu Chen, Huan Zhang, Jin- feng Yi, and Cho-Jui Hsieh. Query-efficient hard-label black-box attack: An optimization-based approach. In 7th International Conference on Learning Representations, ICLR 2019, New Orleans, LA, USA, May 6-9, 2019, 2019. 1, 7\n\nBlind newton sensitivity attack. P Comesana, L Perez-Freire, F Perez-Gonzalez, IEE Proceedings -Information Security. 1533P. Comesana, L. Perez-Freire, and F. Perez-Gonzalez. Blind newton sensitivity attack. IEE Proceedings -Information Se- curity, 153(3):115-125, 2006. 2\n\n. I J Cox, J , I. J. Cox and J. .\n\nPublic watermarks and resistance to tampering. M G Linnartz, Proceedings of International Conference on Image Processing. International Conference on Image Processing3M. G. Linnartz. Public watermarks and re- sistance to tampering. In Proceedings of International Con- ference on Image Processing, volume 3, pages 3-6, 1997. 2\n\nTangential sensitivity analysis of watermarks using prior information. John W Earl, Security, Steganography, and Watermarking of Multimedia Contents IX. Edward J. Delp III and Ping Wah Wong65055SPIEJohn W. Earl. Tangential sensitivity analysis of watermarks using prior information. In Edward J. Delp III and Ping Wah Wong, editors, Security, Steganography, and Watermarking of Multimedia Contents IX, volume 6505, pages 449 -460. International Society for Optics and Photonics, SPIE, 2007. 2, 3, 5\n\nRobustness of classifiers: from adversarial to random noise. Alhussein Fawzi, Pascal Seyed-Mohsen Moosavi-Dezfooli, Frossard, Advances in Neural Information Processing Systems. D. Lee, M. Sugiyama, U. Luxburg, I. Guyon, and R. GarnettCurran Associates, Inc293Alhussein Fawzi, Seyed-Mohsen Moosavi-Dezfooli, and Pascal Frossard. Robustness of classifiers: from adversar- ial to random noise. In D. Lee, M. Sugiyama, U. Luxburg, I. Guyon, and R. Garnett, editors, Advances in Neural Infor- mation Processing Systems, volume 29, pages 1632-1640. Curran Associates, Inc., 2016. 3\n\nEmpirical study of the topology and geometry of deep networks. Alhussein Fawzi, Pascal Seyed-Mohsen Moosavi-Dezfooli, Stefano Frossard, Soatto, Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition (CVPR). the IEEE Conference on Computer Vision and Pattern Recognition (CVPR)26Alhussein Fawzi, Seyed-Mohsen Moosavi-Dezfooli, Pascal Frossard, and Stefano Soatto. Empirical study of the topol- ogy and geometry of deep networks. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recogni- tion (CVPR), June 2018. 2, 6\n\nSimple black-box adversarial attacks. Chuan Guo, Jacob Gardner, Yurong You, Andrew Gordon Wilson, Kilian Weinberger, International Conference on Machine Learning. Chuan Guo, Jacob Gardner, Yurong You, Andrew Gordon Wilson, and Kilian Weinberger. Simple black-box adversar- ial attacks. In International Conference on Machine Learn- ing, pages 2484-2493, 2019. 1\n\nBlack-box adversarial attacks with limited queries and information. Andrew Ilyas, Logan Engstrom, Anish Athalye, Jessy Lin, PMLR. 1Proceedings of Machine Learning Research. Jennifer Dy and Andreas KrauseMachine Learning ResearchStockholmsmässan, Stockholm Sweden80Andrew Ilyas, Logan Engstrom, Anish Athalye, and Jessy Lin. Black-box adversarial attacks with limited queries and information. In Jennifer Dy and Andreas Krause, editors, Proceedings of Machine Learning Research, volume 80, pages 2137-2146, Stockholmsmässan, Stockholm Sweden, 10-15 Jul 2018. PMLR. 1, 2\n\nPrior convictions: Black-box adversarial attacks with bandits and priors. Andrew Ilyas, Logan Engstrom, Aleksander Madry, International Conference on Learning Representations. 1Andrew Ilyas, Logan Engstrom, and Aleksander Madry. Prior convictions: Black-box adversarial attacks with bandits and priors. In International Conference on Learning Repre- sentations, 2019. 1, 2\n\nQeba: Query-efficient boundary-based blackbox attack. H Li, X Xu, X Zhang, S Yang, B Li, 2020 IEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR). Los Alamitos, CA, USA71, 2, 3, 4, 6H. Li, X. Xu, X. Zhang, S. Yang, and B. Li. Qeba: Query-efficient boundary-based blackbox attack. In 2020 IEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR), pages 1218-1227, Los Alamitos, CA, USA, jun 2020. IEEE Computer Society. 1, 2, 3, 4, 6, 7, 8\n\nAnalysis of the sensitivity attack against electronic watermarks in images. J Linnartz, Marten Van Dijk, Information Hiding. J. Linnartz and Marten van Dijk. Analysis of the sensitivity attack against electronic watermarks in images. In Informa- tion Hiding, 1998. 2\n\nA primer on zeroth-order optimization in signal processing and machine learning: Principals, recent advances, and applications. S Liu, P Y Chen, B Kailkhura, G Zhang, A O Hero, Iii , P K Varshney, IEEE Signal Processing Magazine. 375S. Liu, P. Y. Chen, B. Kailkhura, G. Zhang, A. O. Hero III, and P. K. Varshney. A primer on zeroth-order optimization in signal processing and machine learning: Principals, recent advances, and applications. IEEE Signal Processing Maga- zine, 37(5):43-54, 2020. 2\n\nTowards deep learning models resistant to adversarial attacks. Aleksander Madry, Aleksandar Makelov, Ludwig Schmidt, Dimitris Tsipras, Adrian Vladu, 6th International Conference on Learning Representations, ICLR 2018. Vancouver, BC, Canada1Conference Track ProceedingsAleksander Madry, Aleksandar Makelov, Ludwig Schmidt, Dimitris Tsipras, and Adrian Vladu. Towards deep learning models resistant to adversarial attacks. In 6th International Conference on Learning Representations, ICLR 2018, Van- couver, BC, Canada, April 30 -May 3, 2018, Conference Track Proceedings, 2018. 1, 2\n\nSimple black-box adversarial attacks on deep neural networks. N Narodytska, S Kasiviswanathan, 2017 IEEE Conference on Computer Vision and Pattern Recognition Workshops (CVPRW). N. Narodytska and S. Kasiviswanathan. Simple black-box adversarial attacks on deep neural networks. In 2017 IEEE Conference on Computer Vision and Pattern Recognition Workshops (CVPRW), pages 1310-1318, 2017. 1\n\nEfficiency of coordinate descent methods on huge-scale optimization problems. Yu, Nesterov, SIAM Journal on Optimization. 222Yu. Nesterov. Efficiency of coordinate descent methods on huge-scale optimization problems. SIAM Journal on Opti- mization, 22(2):341-362, 2012. 4\n\nTransferability in machine learning: from phenomena to black-box attacks using adversarial samples. Nicolas Papernot, Patrick Mcdaniel, Ian Goodfellow, arXiv:1605.07277arXiv preprintNicolas Papernot, Patrick McDaniel, and Ian Goodfellow. Transferability in machine learning: from phenomena to black-box attacks using adversarial samples. arXiv preprint arXiv:1605.07277, 2016. 1\n\nPractical black-box attacks against machine learning. Nicolas Papernot, Patrick Mcdaniel, Ian Goodfellow, Somesh Jha, Z Berkay Celik, Ananthram Swami, Proceedings of the 2017 ACM on Asia Conference on Computer and Communications Security, ASIA CCS '17. the 2017 ACM on Asia Conference on Computer and Communications Security, ASIA CCS '17New York, NY, USAAssociation for Computing MachineryNicolas Papernot, Patrick McDaniel, Ian Goodfellow, Somesh Jha, Z. Berkay Celik, and Ananthram Swami. Prac- tical black-box attacks against machine learning. In Proceed- ings of the 2017 ACM on Asia Conference on Computer and Communications Security, ASIA CCS '17, pages 506-519, New York, NY, USA, 2017. Association for Computing Ma- chinery. 1\n\nPytorch: An imperative style, high-performance deep learning library. Adam Paszke, Sam Gross, Francisco Massa, Adam Lerer, James Bradbury, Gregory Chanan, Trevor Killeen, Zeming Lin, Natalia Gimelshein, Luca Antiga, Alban Desmaison, Andreas Kopf, Edward Yang, Zachary Devito, Martin Raison, Alykhan Tejani, Sasank Chilamkurthy, Benoit Steiner, Lu Fang, Junjie Bai, Soumith Chintala, Advances in Neural Information Processing Systems. H. Wallach, H. Larochelle, A. Beygelzimer, F. Alche-Buc, E. Fox, and R. GarnettCurran Associates, Inc32Adam Paszke, Sam Gross, Francisco Massa, Adam Lerer, James Bradbury, Gregory Chanan, Trevor Killeen, Zeming Lin, Natalia Gimelshein, Luca Antiga, Alban Desmaison, Andreas Kopf, Edward Yang, Zachary DeVito, Martin Rai- son, Alykhan Tejani, Sasank Chilamkurthy, Benoit Steiner, Lu Fang, Junjie Bai, and Soumith Chintala. Pytorch: An im- perative style, high-performance deep learning library. In H. Wallach, H. Larochelle, A. Beygelzimer, F. Alche-Buc, E. Fox, and R. Garnett, editors, Advances in Neural Informa- tion Processing Systems 32, pages 8024-8035. Curran Asso- ciates, Inc., 2019. 6\n\nGeoda: a geometric framework for black-box adversarial attacks. Ali Rahmati, Pascal Seyed-Mohsen Moosavi-Dezfooli, Huaiyu Frossard, Dai, Proceedings of the IEEE/CVF Conference on Computer Vision and Pattern Recognition. the IEEE/CVF Conference on Computer Vision and Pattern Recognition7Ali Rahmati, Seyed-Mohsen Moosavi-Dezfooli, Pascal Frossard, and Huaiyu Dai. Geoda: a geometric frame- work for black-box adversarial attacks. In Proceedings of the IEEE/CVF Conference on Computer Vision and Pattern Recognition, pages 8446-8455, 2020. 1, 2, 3, 4, 6, 7, 8\n\nFoolbox: A python toolbox to benchmark the robustness of machine learning models. Jonas Rauber, Wieland Brendel, Matthias Bethge, Reliable Machine Learning in the Wild Workshop, 34th International Conference on Machine Learning. Jonas Rauber, Wieland Brendel, and Matthias Bethge. Fool- box: A python toolbox to benchmark the robustness of ma- chine learning models. In Reliable Machine Learning in the Wild Workshop, 34th International Conference on Machine Learning, 2017. 7\n\nFoolbox native: Fast adversarial attacks to benchmark the robustness of machine learning models in pytorch, tensorflow, and jax. Jonas Rauber, Roland Zimmermann, Matthias Bethge, Wieland Brendel, Journal of Open Source Software. 5532607Jonas Rauber, Roland Zimmermann, Matthias Bethge, and Wieland Brendel. Foolbox native: Fast adversarial attacks to benchmark the robustness of machine learning models in py- torch, tensorflow, and jax. Journal of Open Source Software, 5(53):2607, 2020. 7\n\nIsmail Ben Ayed, Robert Sabourin, and Eric Granger. Decoupling direction and norm for efficient gradient-based l2 adversarial attacks and defenses. Jerome Rony, G Luiz, Luiz S Hafemann, Oliveira, The IEEE Conference on Computer Vision and Pattern Recognition (CVPR). 1Jerome Rony, Luiz G. Hafemann, Luiz S. Oliveira, Is- mail Ben Ayed, Robert Sabourin, and Eric Granger. De- coupling direction and norm for efficient gradient-based l2 adversarial attacks and defenses. In The IEEE Conference on Computer Vision and Pattern Recognition (CVPR), June 2019. 1, 2\n\nAutozoom: Autoencoder-based zeroth order optimization method for attacking black-box neural networks. Chun-Chen Tu, Paishun Ting, Pin-Yu Chen, Sijia Liu, Huan Zhang, Jinfeng Yi, Cho-Jui Hsieh, Shin-Ming Cheng, Proceedings of the AAAI Conference on Artificial Intelligence. the AAAI Conference on Artificial Intelligence33Chun-Chen Tu, Paishun Ting, Pin-Yu Chen, Sijia Liu, Huan Zhang, Jinfeng Yi, Cho-Jui Hsieh, and Shin-Ming Cheng. Autozoom: Autoencoder-based zeroth order optimization method for attacking black-box neural networks. In Pro- ceedings of the AAAI Conference on Artificial Intelligence, volume 33, pages 742-749, 2019. 1, 2\n\nTowards query-efficient black-box adversary with zeroth-order natural gradient descent. CoRR, abs. Pu Zhao, Pin-Yu Chen, Siyue Wang, Xue Lin, Pu Zhao, Pin-Yu Chen, Siyue Wang, and Xue Lin. Towards query-efficient black-box adversary with zeroth-order natu- ral gradient descent. CoRR, abs/2002.07891, 2020. 1, 2\n", "annotations": {"author": "[{\"end\":88,\"start\":51},{\"end\":130,\"start\":89},{\"end\":206,\"start\":131},{\"end\":232,\"start\":207},{\"end\":278,\"start\":233}]", "publisher": null, "author_last_name": "[{\"end\":64,\"start\":60},{\"end\":104,\"start\":95}]", "author_first_name": "[{\"end\":59,\"start\":51},{\"end\":94,\"start\":89}]", "author_affiliation": "[{\"end\":205,\"start\":132},{\"end\":231,\"start\":208},{\"end\":277,\"start\":234}]", "title": "[{\"end\":48,\"start\":1},{\"end\":326,\"start\":279}]", "venue": null, "abstract": "[{\"end\":1741,\"start\":328}]", "bib_ref": "[{\"attributes\":{\"ref_id\":\"b1\"},\"end\":1922,\"start\":1919},{\"attributes\":{\"ref_id\":\"b26\"},\"end\":1925,\"start\":1922},{\"attributes\":{\"ref_id\":\"b17\"},\"end\":1928,\"start\":1925},{\"attributes\":{\"ref_id\":\"b18\"},\"end\":2021,\"start\":2017},{\"attributes\":{\"ref_id\":\"b0\"},\"end\":2023,\"start\":2021},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":2026,\"start\":2023},{\"attributes\":{\"ref_id\":\"b23\"},\"end\":2029,\"start\":2026},{\"attributes\":{\"ref_id\":\"b2\"},\"end\":2031,\"start\":2029},{\"attributes\":{\"ref_id\":\"b28\"},\"end\":2034,\"start\":2031},{\"attributes\":{\"ref_id\":\"b13\"},\"end\":2037,\"start\":2034},{\"attributes\":{\"ref_id\":\"b27\"},\"end\":2040,\"start\":2037},{\"attributes\":{\"ref_id\":\"b11\"},\"end\":2043,\"start\":2040},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":2045,\"start\":2043},{\"attributes\":{\"ref_id\":\"b12\"},\"end\":2048,\"start\":2045},{\"attributes\":{\"ref_id\":\"b3\"},\"end\":2050,\"start\":2048},{\"attributes\":{\"ref_id\":\"b0\"},\"end\":2111,\"start\":2110},{\"attributes\":{\"ref_id\":\"b23\"},\"end\":2199,\"start\":2195},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":2209,\"start\":2205},{\"attributes\":{\"ref_id\":\"b20\"},\"end\":3111,\"start\":3107},{\"attributes\":{\"ref_id\":\"b21\"},\"end\":3114,\"start\":3111},{\"attributes\":{\"ref_id\":\"b3\"},\"end\":3433,\"start\":3430},{\"attributes\":{\"ref_id\":\"b27\"},\"end\":3436,\"start\":3433},{\"attributes\":{\"ref_id\":\"b13\"},\"end\":3439,\"start\":3436},{\"attributes\":{\"ref_id\":\"b28\"},\"end\":3442,\"start\":3439},{\"attributes\":{\"ref_id\":\"b2\"},\"end\":3477,\"start\":3474},{\"attributes\":{\"ref_id\":\"b12\"},\"end\":3563,\"start\":3559},{\"attributes\":{\"ref_id\":\"b12\"},\"end\":4015,\"start\":4011},{\"attributes\":{\"ref_id\":\"b28\"},\"end\":4072,\"start\":4068},{\"attributes\":{\"ref_id\":\"b12\"},\"end\":4197,\"start\":4193},{\"attributes\":{\"ref_id\":\"b23\"},\"end\":4767,\"start\":4763},{\"attributes\":{\"ref_id\":\"b2\"},\"end\":4769,\"start\":4767},{\"attributes\":{\"ref_id\":\"b8\"},\"end\":5524,\"start\":5521},{\"attributes\":{\"ref_id\":\"b0\"},\"end\":5526,\"start\":5524},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":5681,\"start\":5677},{\"attributes\":{\"ref_id\":\"b6\"},\"end\":6659,\"start\":6656},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":6662,\"start\":6659},{\"attributes\":{\"ref_id\":\"b2\"},\"end\":6836,\"start\":6833},{\"attributes\":{\"ref_id\":\"b5\"},\"end\":6906,\"start\":6903},{\"attributes\":{\"ref_id\":\"b8\"},\"end\":6959,\"start\":6956},{\"attributes\":{\"ref_id\":\"b0\"},\"end\":7096,\"start\":7093},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":7195,\"start\":7192},{\"attributes\":{\"ref_id\":\"b26\"},\"end\":7198,\"start\":7195},{\"attributes\":{\"ref_id\":\"b17\"},\"end\":7201,\"start\":7198},{\"attributes\":{\"ref_id\":\"b3\"},\"end\":7488,\"start\":7485},{\"attributes\":{\"ref_id\":\"b13\"},\"end\":7620,\"start\":7616},{\"attributes\":{\"ref_id\":\"b27\"},\"end\":7664,\"start\":7660},{\"attributes\":{\"ref_id\":\"b28\"},\"end\":7667,\"start\":7664},{\"attributes\":{\"ref_id\":\"b16\"},\"end\":7670,\"start\":7667},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":7965,\"start\":7961},{\"end\":7972,\"start\":7965},{\"attributes\":{\"ref_id\":\"b23\"},\"end\":8004,\"start\":8000},{\"end\":8011,\"start\":8004},{\"attributes\":{\"ref_id\":\"b2\"},\"end\":8647,\"start\":8644},{\"end\":8653,\"start\":8647},{\"attributes\":{\"ref_id\":\"b23\"},\"end\":8659,\"start\":8655},{\"end\":8667,\"start\":8659},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":8673,\"start\":8669},{\"end\":8679,\"start\":8673},{\"attributes\":{\"ref_id\":\"b23\"},\"end\":8755,\"start\":8751},{\"end\":8761,\"start\":8755},{\"attributes\":{\"ref_id\":\"b23\"},\"end\":8780,\"start\":8776},{\"attributes\":{\"ref_id\":\"b2\"},\"end\":8906,\"start\":8903},{\"attributes\":{\"ref_id\":\"b23\"},\"end\":9528,\"start\":9524},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":9531,\"start\":9528},{\"attributes\":{\"ref_id\":\"b2\"},\"end\":10629,\"start\":10626},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":10632,\"start\":10629},{\"attributes\":{\"ref_id\":\"b23\"},\"end\":10635,\"start\":10632},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":10761,\"start\":10758},{\"attributes\":{\"ref_id\":\"b2\"},\"end\":11015,\"start\":11012},{\"attributes\":{\"ref_id\":\"b23\"},\"end\":11018,\"start\":11015},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":11021,\"start\":11018},{\"attributes\":{\"ref_id\":\"b2\"},\"end\":11263,\"start\":11260},{\"attributes\":{\"ref_id\":\"b8\"},\"end\":12489,\"start\":12486},{\"attributes\":{\"ref_id\":\"b0\"},\"end\":12491,\"start\":12489},{\"attributes\":{\"ref_id\":\"b19\"},\"end\":16668,\"start\":16664},{\"attributes\":{\"ref_id\":\"b23\"},\"end\":17358,\"start\":17354},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":17361,\"start\":17358},{\"attributes\":{\"ref_id\":\"b0\"},\"end\":17858,\"start\":17856},{\"attributes\":{\"ref_id\":\"b8\"},\"end\":19280,\"start\":19277},{\"attributes\":{\"ref_id\":\"b8\"},\"end\":19869,\"start\":19866},{\"attributes\":{\"ref_id\":\"b13\"},\"end\":20841,\"start\":20839},{\"end\":21204,\"start\":21201},{\"end\":21235,\"start\":21232},{\"end\":21263,\"start\":21260},{\"end\":21307,\"start\":21304},{\"attributes\":{\"ref_id\":\"b22\"},\"end\":22159,\"start\":22155},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":23590,\"start\":23586},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":25479,\"start\":25475},{\"attributes\":{\"ref_id\":\"b23\"},\"end\":25482,\"start\":25479},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":25976,\"start\":25972},{\"attributes\":{\"ref_id\":\"b23\"},\"end\":25979,\"start\":25976},{\"attributes\":{\"ref_id\":\"b2\"},\"end\":27064,\"start\":27061},{\"attributes\":{\"ref_id\":\"b23\"},\"end\":27181,\"start\":27177},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":27195,\"start\":27191},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":27303,\"start\":27300},{\"attributes\":{\"ref_id\":\"b2\"},\"end\":27453,\"start\":27450},{\"attributes\":{\"ref_id\":\"b24\"},\"end\":27495,\"start\":27491},{\"attributes\":{\"ref_id\":\"b25\"},\"end\":27498,\"start\":27495},{\"attributes\":{\"ref_id\":\"b23\"},\"end\":27515,\"start\":27511},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":27529,\"start\":27525},{\"attributes\":{\"ref_id\":\"b23\"},\"end\":27639,\"start\":27635},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":27870,\"start\":27866},{\"attributes\":{\"ref_id\":\"b2\"},\"end\":27948,\"start\":27945},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":28962,\"start\":28958},{\"attributes\":{\"ref_id\":\"b23\"},\"end\":28977,\"start\":28973},{\"attributes\":{\"ref_id\":\"b2\"},\"end\":28998,\"start\":28995},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":29166,\"start\":29162},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":29362,\"start\":29358},{\"attributes\":{\"ref_id\":\"b23\"},\"end\":29416,\"start\":29412},{\"attributes\":{\"ref_id\":\"b23\"},\"end\":29977,\"start\":29973},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":30002,\"start\":29998},{\"attributes\":{\"ref_id\":\"b2\"},\"end\":30070,\"start\":30067},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":30443,\"start\":30439}]", "figure": "[{\"attributes\":{\"id\":\"fig_1\"},\"end\":31412,\"start\":31213},{\"attributes\":{\"id\":\"fig_2\"},\"end\":31476,\"start\":31413},{\"attributes\":{\"id\":\"fig_3\"},\"end\":31760,\"start\":31477},{\"attributes\":{\"id\":\"fig_4\"},\"end\":31827,\"start\":31761},{\"attributes\":{\"id\":\"fig_5\"},\"end\":31959,\"start\":31828},{\"attributes\":{\"id\":\"fig_7\"},\"end\":32171,\"start\":31960},{\"attributes\":{\"id\":\"fig_8\"},\"end\":32384,\"start\":32172},{\"attributes\":{\"id\":\"fig_9\"},\"end\":32485,\"start\":32385},{\"attributes\":{\"id\":\"tab_0\",\"type\":\"table\"},\"end\":33107,\"start\":32486},{\"attributes\":{\"id\":\"tab_1\",\"type\":\"table\"},\"end\":34287,\"start\":33108}]", "paragraph": "[{\"end\":2874,\"start\":1757},{\"end\":3810,\"start\":2876},{\"end\":4448,\"start\":3812},{\"end\":4891,\"start\":4450},{\"end\":5273,\"start\":4893},{\"end\":5316,\"start\":5275},{\"end\":5527,\"start\":5318},{\"end\":5682,\"start\":5529},{\"end\":5783,\"start\":5684},{\"end\":5994,\"start\":5785},{\"end\":6560,\"start\":6027},{\"end\":7097,\"start\":6562},{\"end\":7234,\"start\":7132},{\"end\":7671,\"start\":7236},{\"end\":8150,\"start\":7673},{\"end\":8414,\"start\":8152},{\"end\":9057,\"start\":8416},{\"end\":9667,\"start\":9059},{\"end\":9788,\"start\":9689},{\"end\":10303,\"start\":9962},{\"end\":10898,\"start\":10335},{\"end\":11659,\"start\":10980},{\"end\":11725,\"start\":11674},{\"end\":11983,\"start\":11800},{\"end\":12154,\"start\":12039},{\"end\":12530,\"start\":12357},{\"end\":12693,\"start\":12532},{\"end\":13042,\"start\":12818},{\"end\":13347,\"start\":13136},{\"end\":13833,\"start\":13613},{\"end\":14175,\"start\":13835},{\"end\":14558,\"start\":14456},{\"end\":14772,\"start\":14712},{\"end\":14939,\"start\":14774},{\"end\":15005,\"start\":14967},{\"end\":15202,\"start\":15048},{\"end\":15319,\"start\":15262},{\"end\":15539,\"start\":15418},{\"end\":15824,\"start\":15607},{\"end\":15919,\"start\":15826},{\"end\":16004,\"start\":15921},{\"end\":16404,\"start\":16037},{\"end\":17066,\"start\":16424},{\"end\":17224,\"start\":17089},{\"end\":17591,\"start\":17242},{\"end\":17904,\"start\":17593},{\"end\":18177,\"start\":17936},{\"end\":18528,\"start\":18224},{\"end\":18739,\"start\":18563},{\"end\":19141,\"start\":18741},{\"end\":19692,\"start\":19143},{\"end\":19935,\"start\":19710},{\"end\":20507,\"start\":19937},{\"end\":20842,\"start\":20622},{\"end\":21336,\"start\":21177},{\"end\":21680,\"start\":21397},{\"end\":22051,\"start\":21716},{\"end\":22309,\"start\":22053},{\"end\":22643,\"start\":22328},{\"end\":23039,\"start\":22666},{\"end\":23273,\"start\":23096},{\"end\":23426,\"start\":23308},{\"end\":23776,\"start\":23494},{\"end\":24176,\"start\":23787},{\"end\":24911,\"start\":24178},{\"end\":25139,\"start\":24913},{\"end\":26111,\"start\":25195},{\"end\":26800,\"start\":26113},{\"end\":26943,\"start\":26802},{\"end\":27169,\"start\":26960},{\"end\":27397,\"start\":27171},{\"end\":27499,\"start\":27399},{\"end\":28184,\"start\":27501},{\"end\":29640,\"start\":28186},{\"end\":30161,\"start\":29642},{\"end\":30618,\"start\":30163},{\"end\":31212,\"start\":30633}]", "formula": "[{\"attributes\":{\"id\":\"formula_0\"},\"end\":9961,\"start\":9789},{\"attributes\":{\"id\":\"formula_1\"},\"end\":10334,\"start\":10304},{\"attributes\":{\"id\":\"formula_2\"},\"end\":10964,\"start\":10899},{\"attributes\":{\"id\":\"formula_3\"},\"end\":11799,\"start\":11726},{\"attributes\":{\"id\":\"formula_4\"},\"end\":12038,\"start\":11984},{\"attributes\":{\"id\":\"formula_5\"},\"end\":12356,\"start\":12155},{\"attributes\":{\"id\":\"formula_6\"},\"end\":12817,\"start\":12694},{\"attributes\":{\"id\":\"formula_7\"},\"end\":13135,\"start\":13043},{\"attributes\":{\"id\":\"formula_8\"},\"end\":13612,\"start\":13348},{\"attributes\":{\"id\":\"formula_9\"},\"end\":14285,\"start\":14176},{\"attributes\":{\"id\":\"formula_10\"},\"end\":14455,\"start\":14285},{\"attributes\":{\"id\":\"formula_11\"},\"end\":14711,\"start\":14559},{\"attributes\":{\"id\":\"formula_12\"},\"end\":14966,\"start\":14940},{\"attributes\":{\"id\":\"formula_13\"},\"end\":15261,\"start\":15203},{\"attributes\":{\"id\":\"formula_14\"},\"end\":15417,\"start\":15320},{\"attributes\":{\"id\":\"formula_15\"},\"end\":15606,\"start\":15540},{\"attributes\":{\"id\":\"formula_16\"},\"end\":16036,\"start\":16005},{\"attributes\":{\"id\":\"formula_17\"},\"end\":17935,\"start\":17905},{\"attributes\":{\"id\":\"formula_18\"},\"end\":18223,\"start\":18178},{\"attributes\":{\"id\":\"formula_19\"},\"end\":20569,\"start\":20508},{\"attributes\":{\"id\":\"formula_20\"},\"end\":20621,\"start\":20569},{\"attributes\":{\"id\":\"formula_21\"},\"end\":21150,\"start\":20843},{\"attributes\":{\"id\":\"formula_22\"},\"end\":21176,\"start\":21150},{\"attributes\":{\"id\":\"formula_23\"},\"end\":21376,\"start\":21337},{\"attributes\":{\"id\":\"formula_24\"},\"end\":23095,\"start\":23040},{\"attributes\":{\"id\":\"formula_25\"},\"end\":23307,\"start\":23274},{\"attributes\":{\"id\":\"formula_26\"},\"end\":23474,\"start\":23427}]", "table_ref": "[{\"end\":18867,\"start\":18860},{\"end\":25743,\"start\":25736},{\"end\":26321,\"start\":26314},{\"end\":26395,\"start\":26388},{\"end\":28372,\"start\":28365},{\"end\":29825,\"start\":29818},{\"end\":30179,\"start\":30172}]", "section_header": "[{\"attributes\":{\"n\":\"1.\"},\"end\":1755,\"start\":1743},{\"attributes\":{\"n\":\"2.\"},\"end\":6010,\"start\":5997},{\"attributes\":{\"n\":\"2.1.\"},\"end\":6025,\"start\":6013},{\"attributes\":{\"n\":\"2.2.\"},\"end\":7130,\"start\":7100},{\"attributes\":{\"n\":\"3.\"},\"end\":9687,\"start\":9670},{\"attributes\":{\"n\":\"4.\"},\"end\":10978,\"start\":10966},{\"attributes\":{\"n\":\"4.1.\"},\"end\":11672,\"start\":11662},{\"attributes\":{\"n\":\"4.2.\"},\"end\":15046,\"start\":15008},{\"attributes\":{\"n\":\"4.3.\"},\"end\":16422,\"start\":16407},{\"attributes\":{\"n\":\"5.\"},\"end\":17087,\"start\":17069},{\"attributes\":{\"n\":\"5.1.\"},\"end\":17240,\"start\":17227},{\"attributes\":{\"n\":\"5.2.\"},\"end\":18561,\"start\":18531},{\"attributes\":{\"n\":\"5.3.\"},\"end\":19708,\"start\":19695},{\"attributes\":{\"n\":\"6.\"},\"end\":21395,\"start\":21378},{\"attributes\":{\"n\":\"6.1.\"},\"end\":21714,\"start\":21683},{\"end\":22326,\"start\":22312},{\"end\":22664,\"start\":22646},{\"attributes\":{\"n\":\"6.2.\"},\"end\":23492,\"start\":23476},{\"end\":23785,\"start\":23779},{\"end\":25193,\"start\":25142},{\"attributes\":{\"n\":\"6.3.\"},\"end\":26958,\"start\":26946},{\"attributes\":{\"n\":\"7.\"},\"end\":30631,\"start\":30621},{\"end\":31224,\"start\":31214},{\"end\":31424,\"start\":31414},{\"end\":31772,\"start\":31762},{\"end\":31840,\"start\":31829},{\"end\":31972,\"start\":31961},{\"end\":32193,\"start\":32173},{\"end\":32396,\"start\":32386}]", "table": "[{\"end\":33107,\"start\":32537},{\"end\":34287,\"start\":33592}]", "figure_caption": "[{\"end\":31412,\"start\":31226},{\"end\":31476,\"start\":31426},{\"end\":31760,\"start\":31479},{\"end\":31827,\"start\":31774},{\"end\":31959,\"start\":31842},{\"end\":32171,\"start\":31974},{\"end\":32384,\"start\":32196},{\"end\":32485,\"start\":32398},{\"end\":32537,\"start\":32488},{\"end\":33592,\"start\":33110}]", "figure_ref": "[{\"attributes\":{\"ref_id\":\"fig_1\"},\"end\":4890,\"start\":4884},{\"attributes\":{\"ref_id\":\"fig_1\"},\"end\":5249,\"start\":5243},{\"end\":7886,\"start\":7880},{\"end\":7959,\"start\":7953},{\"attributes\":{\"ref_id\":\"fig_1\"},\"end\":11100,\"start\":11094},{\"attributes\":{\"ref_id\":\"fig_2\"},\"end\":14557,\"start\":14551},{\"attributes\":{\"ref_id\":\"fig_4\"},\"end\":19934,\"start\":19928},{\"attributes\":{\"ref_id\":\"fig_4\"},\"end\":20251,\"start\":20245},{\"end\":23775,\"start\":23769},{\"end\":24054,\"start\":24048},{\"end\":24120,\"start\":24114},{\"end\":27075,\"start\":27067},{\"end\":28183,\"start\":28177},{\"attributes\":{\"ref_id\":\"fig_1\"},\"end\":28686,\"start\":28680},{\"attributes\":{\"ref_id\":\"fig_9\"},\"end\":29910,\"start\":29904}]", "bib_author_first_name": "[{\"end\":34599,\"start\":34592},{\"end\":34614,\"start\":34609},{\"end\":34631,\"start\":34623},{\"end\":34981,\"start\":34973},{\"end\":34996,\"start\":34991},{\"end\":35223,\"start\":35217},{\"end\":35238,\"start\":35230},{\"end\":35658,\"start\":35652},{\"end\":35669,\"start\":35665},{\"end\":35681,\"start\":35677},{\"end\":35697,\"start\":35690},{\"end\":35709,\"start\":35702},{\"end\":36341,\"start\":36335},{\"end\":36354,\"start\":36349},{\"end\":36365,\"start\":36359},{\"end\":36376,\"start\":36372},{\"end\":36391,\"start\":36384},{\"end\":36403,\"start\":36396},{\"end\":36814,\"start\":36813},{\"end\":36826,\"start\":36825},{\"end\":36842,\"start\":36841},{\"end\":37057,\"start\":37056},{\"end\":37059,\"start\":37058},{\"end\":37066,\"start\":37065},{\"end\":37137,\"start\":37136},{\"end\":37139,\"start\":37138},{\"end\":37492,\"start\":37488},{\"end\":37494,\"start\":37493},{\"end\":37987,\"start\":37978},{\"end\":38001,\"start\":37995},{\"end\":38566,\"start\":38557},{\"end\":38580,\"start\":38574},{\"end\":38619,\"start\":38612},{\"end\":39096,\"start\":39091},{\"end\":39107,\"start\":39102},{\"end\":39123,\"start\":39117},{\"end\":39135,\"start\":39129},{\"end\":39142,\"start\":39136},{\"end\":39157,\"start\":39151},{\"end\":39490,\"start\":39484},{\"end\":39503,\"start\":39498},{\"end\":39519,\"start\":39514},{\"end\":39534,\"start\":39529},{\"end\":40066,\"start\":40060},{\"end\":40079,\"start\":40074},{\"end\":40100,\"start\":40090},{\"end\":40415,\"start\":40414},{\"end\":40421,\"start\":40420},{\"end\":40427,\"start\":40426},{\"end\":40436,\"start\":40435},{\"end\":40444,\"start\":40443},{\"end\":40908,\"start\":40907},{\"end\":40925,\"start\":40919},{\"end\":41228,\"start\":41227},{\"end\":41235,\"start\":41234},{\"end\":41237,\"start\":41236},{\"end\":41245,\"start\":41244},{\"end\":41258,\"start\":41257},{\"end\":41267,\"start\":41266},{\"end\":41269,\"start\":41268},{\"end\":41279,\"start\":41276},{\"end\":41283,\"start\":41282},{\"end\":41285,\"start\":41284},{\"end\":41670,\"start\":41660},{\"end\":41688,\"start\":41678},{\"end\":41704,\"start\":41698},{\"end\":41722,\"start\":41714},{\"end\":41738,\"start\":41732},{\"end\":42243,\"start\":42242},{\"end\":42257,\"start\":42256},{\"end\":42950,\"start\":42943},{\"end\":42968,\"start\":42961},{\"end\":42982,\"start\":42979},{\"end\":43284,\"start\":43277},{\"end\":43302,\"start\":43295},{\"end\":43316,\"start\":43313},{\"end\":43335,\"start\":43329},{\"end\":43342,\"start\":43341},{\"end\":43366,\"start\":43357},{\"end\":44034,\"start\":44030},{\"end\":44046,\"start\":44043},{\"end\":44063,\"start\":44054},{\"end\":44075,\"start\":44071},{\"end\":44088,\"start\":44083},{\"end\":44106,\"start\":44099},{\"end\":44121,\"start\":44115},{\"end\":44137,\"start\":44131},{\"end\":44150,\"start\":44143},{\"end\":44167,\"start\":44163},{\"end\":44181,\"start\":44176},{\"end\":44200,\"start\":44193},{\"end\":44213,\"start\":44207},{\"end\":44227,\"start\":44220},{\"end\":44242,\"start\":44236},{\"end\":44258,\"start\":44251},{\"end\":44273,\"start\":44267},{\"end\":44294,\"start\":44288},{\"end\":44306,\"start\":44304},{\"end\":44319,\"start\":44313},{\"end\":44332,\"start\":44325},{\"end\":45157,\"start\":45154},{\"end\":45173,\"start\":45167},{\"end\":45211,\"start\":45205},{\"end\":45737,\"start\":45732},{\"end\":45753,\"start\":45746},{\"end\":45771,\"start\":45763},{\"end\":46262,\"start\":46257},{\"end\":46277,\"start\":46271},{\"end\":46298,\"start\":46290},{\"end\":46314,\"start\":46307},{\"end\":46774,\"start\":46768},{\"end\":46782,\"start\":46781},{\"end\":46793,\"start\":46789},{\"end\":46795,\"start\":46794},{\"end\":47291,\"start\":47282},{\"end\":47303,\"start\":47296},{\"end\":47316,\"start\":47310},{\"end\":47328,\"start\":47323},{\"end\":47338,\"start\":47334},{\"end\":47353,\"start\":47346},{\"end\":47365,\"start\":47358},{\"end\":47382,\"start\":47373},{\"end\":47922,\"start\":47920},{\"end\":47935,\"start\":47929},{\"end\":47947,\"start\":47942},{\"end\":47957,\"start\":47954}]", "bib_author_last_name": "[{\"end\":34607,\"start\":34600},{\"end\":34621,\"start\":34615},{\"end\":34638,\"start\":34632},{\"end\":34989,\"start\":34982},{\"end\":35003,\"start\":34997},{\"end\":35228,\"start\":35224},{\"end\":35255,\"start\":35239},{\"end\":35267,\"start\":35257},{\"end\":35663,\"start\":35659},{\"end\":35675,\"start\":35670},{\"end\":35688,\"start\":35682},{\"end\":35700,\"start\":35698},{\"end\":35715,\"start\":35710},{\"end\":36347,\"start\":36342},{\"end\":36357,\"start\":36355},{\"end\":36370,\"start\":36366},{\"end\":36382,\"start\":36377},{\"end\":36394,\"start\":36392},{\"end\":36409,\"start\":36404},{\"end\":36823,\"start\":36815},{\"end\":36839,\"start\":36827},{\"end\":36857,\"start\":36843},{\"end\":37063,\"start\":37060},{\"end\":37148,\"start\":37140},{\"end\":37499,\"start\":37495},{\"end\":37993,\"start\":37988},{\"end\":38031,\"start\":38002},{\"end\":38041,\"start\":38033},{\"end\":38572,\"start\":38567},{\"end\":38610,\"start\":38581},{\"end\":38628,\"start\":38620},{\"end\":38636,\"start\":38630},{\"end\":39100,\"start\":39097},{\"end\":39115,\"start\":39108},{\"end\":39127,\"start\":39124},{\"end\":39149,\"start\":39143},{\"end\":39168,\"start\":39158},{\"end\":39496,\"start\":39491},{\"end\":39512,\"start\":39504},{\"end\":39527,\"start\":39520},{\"end\":39538,\"start\":39535},{\"end\":40072,\"start\":40067},{\"end\":40088,\"start\":40080},{\"end\":40106,\"start\":40101},{\"end\":40418,\"start\":40416},{\"end\":40424,\"start\":40422},{\"end\":40433,\"start\":40428},{\"end\":40441,\"start\":40437},{\"end\":40447,\"start\":40445},{\"end\":40917,\"start\":40909},{\"end\":40934,\"start\":40926},{\"end\":41232,\"start\":41229},{\"end\":41242,\"start\":41238},{\"end\":41255,\"start\":41246},{\"end\":41264,\"start\":41259},{\"end\":41274,\"start\":41270},{\"end\":41294,\"start\":41286},{\"end\":41676,\"start\":41671},{\"end\":41696,\"start\":41689},{\"end\":41712,\"start\":41705},{\"end\":41730,\"start\":41723},{\"end\":41744,\"start\":41739},{\"end\":42254,\"start\":42244},{\"end\":42273,\"start\":42258},{\"end\":42650,\"start\":42648},{\"end\":42660,\"start\":42652},{\"end\":42959,\"start\":42951},{\"end\":42977,\"start\":42969},{\"end\":42993,\"start\":42983},{\"end\":43293,\"start\":43285},{\"end\":43311,\"start\":43303},{\"end\":43327,\"start\":43317},{\"end\":43339,\"start\":43336},{\"end\":43355,\"start\":43343},{\"end\":43372,\"start\":43367},{\"end\":44041,\"start\":44035},{\"end\":44052,\"start\":44047},{\"end\":44069,\"start\":44064},{\"end\":44081,\"start\":44076},{\"end\":44097,\"start\":44089},{\"end\":44113,\"start\":44107},{\"end\":44129,\"start\":44122},{\"end\":44141,\"start\":44138},{\"end\":44161,\"start\":44151},{\"end\":44174,\"start\":44168},{\"end\":44191,\"start\":44182},{\"end\":44205,\"start\":44201},{\"end\":44218,\"start\":44214},{\"end\":44234,\"start\":44228},{\"end\":44249,\"start\":44243},{\"end\":44265,\"start\":44259},{\"end\":44286,\"start\":44274},{\"end\":44302,\"start\":44295},{\"end\":44311,\"start\":44307},{\"end\":44323,\"start\":44320},{\"end\":44341,\"start\":44333},{\"end\":45165,\"start\":45158},{\"end\":45203,\"start\":45174},{\"end\":45220,\"start\":45212},{\"end\":45225,\"start\":45222},{\"end\":45744,\"start\":45738},{\"end\":45761,\"start\":45754},{\"end\":45778,\"start\":45772},{\"end\":46269,\"start\":46263},{\"end\":46288,\"start\":46278},{\"end\":46305,\"start\":46299},{\"end\":46322,\"start\":46315},{\"end\":46779,\"start\":46775},{\"end\":46787,\"start\":46783},{\"end\":46804,\"start\":46796},{\"end\":46814,\"start\":46806},{\"end\":47294,\"start\":47292},{\"end\":47308,\"start\":47304},{\"end\":47321,\"start\":47317},{\"end\":47332,\"start\":47329},{\"end\":47344,\"start\":47339},{\"end\":47356,\"start\":47354},{\"end\":47371,\"start\":47366},{\"end\":47388,\"start\":47383},{\"end\":47927,\"start\":47923},{\"end\":47940,\"start\":47936},{\"end\":47952,\"start\":47948},{\"end\":47961,\"start\":47958}]", "bib_entry": "[{\"attributes\":{\"id\":\"b0\",\"matched_paper_id\":2410333},\"end\":34917,\"start\":34496},{\"attributes\":{\"id\":\"b1\",\"matched_paper_id\":2893830},\"end\":35155,\"start\":34919},{\"attributes\":{\"id\":\"b2\",\"matched_paper_id\":173991158},\"end\":35536,\"start\":35157},{\"attributes\":{\"id\":\"b3\",\"matched_paper_id\":2179389},\"end\":36256,\"start\":35538},{\"attributes\":{\"id\":\"b4\",\"matched_paper_id\":49672236},\"end\":36778,\"start\":36258},{\"attributes\":{\"id\":\"b5\",\"matched_paper_id\":14477710},\"end\":37052,\"start\":36780},{\"attributes\":{\"id\":\"b6\"},\"end\":37087,\"start\":37054},{\"attributes\":{\"id\":\"b7\",\"matched_paper_id\":15329903},\"end\":37415,\"start\":37089},{\"attributes\":{\"id\":\"b8\",\"matched_paper_id\":5596101},\"end\":37915,\"start\":37417},{\"attributes\":{\"id\":\"b9\",\"matched_paper_id\":13451211},\"end\":38492,\"start\":37917},{\"attributes\":{\"id\":\"b10\",\"matched_paper_id\":52044345},\"end\":39051,\"start\":38494},{\"attributes\":{\"id\":\"b11\",\"matched_paper_id\":86541092},\"end\":39414,\"start\":39053},{\"attributes\":{\"doi\":\"PMLR. 1\",\"id\":\"b12\",\"matched_paper_id\":5046541},\"end\":39984,\"start\":39416},{\"attributes\":{\"id\":\"b13\",\"matched_paper_id\":49907212},\"end\":40358,\"start\":39986},{\"attributes\":{\"id\":\"b14\",\"matched_paper_id\":218972155},\"end\":40829,\"start\":40360},{\"attributes\":{\"id\":\"b15\",\"matched_paper_id\":14657398},\"end\":41097,\"start\":40831},{\"attributes\":{\"id\":\"b16\",\"matched_paper_id\":219573488},\"end\":41595,\"start\":41099},{\"attributes\":{\"id\":\"b17\",\"matched_paper_id\":3488815},\"end\":42178,\"start\":41597},{\"attributes\":{\"id\":\"b18\",\"matched_paper_id\":23223569},\"end\":42568,\"start\":42180},{\"attributes\":{\"id\":\"b19\",\"matched_paper_id\":1424102},\"end\":42841,\"start\":42570},{\"attributes\":{\"doi\":\"arXiv:1605.07277\",\"id\":\"b20\"},\"end\":43221,\"start\":42843},{\"attributes\":{\"id\":\"b21\",\"matched_paper_id\":1090603},\"end\":43958,\"start\":43223},{\"attributes\":{\"id\":\"b22\",\"matched_paper_id\":202786778},\"end\":45088,\"start\":43960},{\"attributes\":{\"id\":\"b23\",\"matched_paper_id\":212725250},\"end\":45648,\"start\":45090},{\"attributes\":{\"id\":\"b24\",\"matched_paper_id\":3995611},\"end\":46126,\"start\":45650},{\"attributes\":{\"id\":\"b25\",\"matched_paper_id\":224901284},\"end\":46618,\"start\":46128},{\"attributes\":{\"id\":\"b26\"},\"end\":47178,\"start\":46620},{\"attributes\":{\"id\":\"b27\",\"matched_paper_id\":44079102},\"end\":47819,\"start\":47180},{\"attributes\":{\"id\":\"b28\"},\"end\":48132,\"start\":47821}]", "bib_title": "[{\"end\":34590,\"start\":34496},{\"end\":34971,\"start\":34919},{\"end\":35215,\"start\":35157},{\"end\":35650,\"start\":35538},{\"end\":36333,\"start\":36258},{\"end\":36811,\"start\":36780},{\"end\":37134,\"start\":37089},{\"end\":37486,\"start\":37417},{\"end\":37976,\"start\":37917},{\"end\":38555,\"start\":38494},{\"end\":39089,\"start\":39053},{\"end\":39482,\"start\":39416},{\"end\":40058,\"start\":39986},{\"end\":40412,\"start\":40360},{\"end\":40905,\"start\":40831},{\"end\":41225,\"start\":41099},{\"end\":41658,\"start\":41597},{\"end\":42240,\"start\":42180},{\"end\":42646,\"start\":42570},{\"end\":43275,\"start\":43223},{\"end\":44028,\"start\":43960},{\"end\":45152,\"start\":45090},{\"end\":45730,\"start\":45650},{\"end\":46255,\"start\":46128},{\"end\":46766,\"start\":46620},{\"end\":47280,\"start\":47180}]", "bib_author": "[{\"end\":34609,\"start\":34592},{\"end\":34623,\"start\":34609},{\"end\":34640,\"start\":34623},{\"end\":34991,\"start\":34973},{\"end\":35005,\"start\":34991},{\"end\":35230,\"start\":35217},{\"end\":35257,\"start\":35230},{\"end\":35269,\"start\":35257},{\"end\":35665,\"start\":35652},{\"end\":35677,\"start\":35665},{\"end\":35690,\"start\":35677},{\"end\":35702,\"start\":35690},{\"end\":35717,\"start\":35702},{\"end\":36349,\"start\":36335},{\"end\":36359,\"start\":36349},{\"end\":36372,\"start\":36359},{\"end\":36384,\"start\":36372},{\"end\":36396,\"start\":36384},{\"end\":36411,\"start\":36396},{\"end\":36825,\"start\":36813},{\"end\":36841,\"start\":36825},{\"end\":36859,\"start\":36841},{\"end\":37065,\"start\":37056},{\"end\":37069,\"start\":37065},{\"end\":37150,\"start\":37136},{\"end\":37501,\"start\":37488},{\"end\":37995,\"start\":37978},{\"end\":38033,\"start\":37995},{\"end\":38043,\"start\":38033},{\"end\":38574,\"start\":38557},{\"end\":38612,\"start\":38574},{\"end\":38630,\"start\":38612},{\"end\":38638,\"start\":38630},{\"end\":39102,\"start\":39091},{\"end\":39117,\"start\":39102},{\"end\":39129,\"start\":39117},{\"end\":39151,\"start\":39129},{\"end\":39170,\"start\":39151},{\"end\":39498,\"start\":39484},{\"end\":39514,\"start\":39498},{\"end\":39529,\"start\":39514},{\"end\":39540,\"start\":39529},{\"end\":40074,\"start\":40060},{\"end\":40090,\"start\":40074},{\"end\":40108,\"start\":40090},{\"end\":40420,\"start\":40414},{\"end\":40426,\"start\":40420},{\"end\":40435,\"start\":40426},{\"end\":40443,\"start\":40435},{\"end\":40449,\"start\":40443},{\"end\":40919,\"start\":40907},{\"end\":40936,\"start\":40919},{\"end\":41234,\"start\":41227},{\"end\":41244,\"start\":41234},{\"end\":41257,\"start\":41244},{\"end\":41266,\"start\":41257},{\"end\":41276,\"start\":41266},{\"end\":41282,\"start\":41276},{\"end\":41296,\"start\":41282},{\"end\":41678,\"start\":41660},{\"end\":41698,\"start\":41678},{\"end\":41714,\"start\":41698},{\"end\":41732,\"start\":41714},{\"end\":41746,\"start\":41732},{\"end\":42256,\"start\":42242},{\"end\":42275,\"start\":42256},{\"end\":42652,\"start\":42648},{\"end\":42662,\"start\":42652},{\"end\":42961,\"start\":42943},{\"end\":42979,\"start\":42961},{\"end\":42995,\"start\":42979},{\"end\":43295,\"start\":43277},{\"end\":43313,\"start\":43295},{\"end\":43329,\"start\":43313},{\"end\":43341,\"start\":43329},{\"end\":43357,\"start\":43341},{\"end\":43374,\"start\":43357},{\"end\":44043,\"start\":44030},{\"end\":44054,\"start\":44043},{\"end\":44071,\"start\":44054},{\"end\":44083,\"start\":44071},{\"end\":44099,\"start\":44083},{\"end\":44115,\"start\":44099},{\"end\":44131,\"start\":44115},{\"end\":44143,\"start\":44131},{\"end\":44163,\"start\":44143},{\"end\":44176,\"start\":44163},{\"end\":44193,\"start\":44176},{\"end\":44207,\"start\":44193},{\"end\":44220,\"start\":44207},{\"end\":44236,\"start\":44220},{\"end\":44251,\"start\":44236},{\"end\":44267,\"start\":44251},{\"end\":44288,\"start\":44267},{\"end\":44304,\"start\":44288},{\"end\":44313,\"start\":44304},{\"end\":44325,\"start\":44313},{\"end\":44343,\"start\":44325},{\"end\":45167,\"start\":45154},{\"end\":45205,\"start\":45167},{\"end\":45222,\"start\":45205},{\"end\":45227,\"start\":45222},{\"end\":45746,\"start\":45732},{\"end\":45763,\"start\":45746},{\"end\":45780,\"start\":45763},{\"end\":46271,\"start\":46257},{\"end\":46290,\"start\":46271},{\"end\":46307,\"start\":46290},{\"end\":46324,\"start\":46307},{\"end\":46781,\"start\":46768},{\"end\":46789,\"start\":46781},{\"end\":46806,\"start\":46789},{\"end\":46816,\"start\":46806},{\"end\":47296,\"start\":47282},{\"end\":47310,\"start\":47296},{\"end\":47323,\"start\":47310},{\"end\":47334,\"start\":47323},{\"end\":47346,\"start\":47334},{\"end\":47358,\"start\":47346},{\"end\":47373,\"start\":47358},{\"end\":47390,\"start\":47373},{\"end\":47929,\"start\":47920},{\"end\":47942,\"start\":47929},{\"end\":47954,\"start\":47942},{\"end\":47963,\"start\":47954}]", "bib_venue": "[{\"end\":35895,\"start\":35806},{\"end\":36500,\"start\":36480},{\"end\":37255,\"start\":37211},{\"end\":38793,\"start\":38724},{\"end\":39678,\"start\":39619},{\"end\":40546,\"start\":40525},{\"end\":41836,\"start\":41815},{\"end\":43578,\"start\":43476},{\"end\":45376,\"start\":45310},{\"end\":47499,\"start\":47453},{\"end\":34692,\"start\":34640},{\"end\":35014,\"start\":35005},{\"end\":35317,\"start\":35269},{\"end\":35804,\"start\":35717},{\"end\":36478,\"start\":36411},{\"end\":36896,\"start\":36859},{\"end\":37209,\"start\":37150},{\"end\":37568,\"start\":37501},{\"end\":38092,\"start\":38043},{\"end\":38722,\"start\":38638},{\"end\":39214,\"start\":39170},{\"end\":39587,\"start\":39547},{\"end\":40160,\"start\":40108},{\"end\":40523,\"start\":40449},{\"end\":40954,\"start\":40936},{\"end\":41327,\"start\":41296},{\"end\":41813,\"start\":41746},{\"end\":42356,\"start\":42275},{\"end\":42690,\"start\":42662},{\"end\":42941,\"start\":42843},{\"end\":43474,\"start\":43374},{\"end\":44392,\"start\":44343},{\"end\":45308,\"start\":45227},{\"end\":45877,\"start\":45780},{\"end\":46355,\"start\":46324},{\"end\":46885,\"start\":46816},{\"end\":47451,\"start\":47390},{\"end\":47918,\"start\":47821}]"}}}, "year": 2023, "month": 12, "day": 17}