{"id": 2305032, "updated": "2023-12-10 03:05:51.973", "metadata": {"title": "HEART DISEASE", "authors": "[{\"first\":\"S. A.\",\"last\":\"Smith\",\"middle\":[]}]", "venue": "Hall's journal of health", "journal": "Medical Journal of Australia", "publication_date": {"year": 1931, "month": null, "day": null}, "abstract": "With rabbits living to an older age and rabbit caretakers becoming more educated about various diseases and what to watch for, veterinarians across the country are beginning to see and treat more rabbits with heart disease. Today we are breaking new ground, but as more cases are treated, more will be learned and hopefully heart disease in rabbits will become as treatable as it has become in humans.", "fields_of_study": "[\"Medicine\"]", "external_ids": {"arxiv": null, "mag": null, "acl": null, "pubmed": null, "pubmedcentral": null, "dblp": null, "doi": "10.5694/j.1326-5377.1931.tb52956.x"}}, "content": {"source": {"pdf_hash": "7a7f298f9b68c39f87dc991428b99cc659a335ba", "pdf_src": "Wiley", "pdf_uri": null, "oa_url_match": false, "oa_info": null}, "grobid": {"id": "b2a77a290917750a99984d2b26bae80043c2a416", "type": "plain-text", "url": "s3://ai2-s2-science-parse-plus-prod/parse-results/s2orc_worker/7a7f298f9b68c39f87dc991428b99cc659a335ba.txt", "contents": "\n\nMAY 23, 1931\n\nThe \nJournal \nAustralia MAY 23, 1931640\n\n\nｾ ｰ ･ ､ ｡ ｬ articles on Diagnosis.\n\n(Oontributed by Bequest.) XLVI. HEART DISEASE.\n\nTHE aim of diagnosis in heart disease is to determine the capacity of the heart to maintain an efficient circulation. As James Mackenzie pointed out, the whole study 'of cardiac disease centres around heart failure.\n\nThe examination of a patient suffering from heart disease reveals the presence of failure of the heart or renders possible the recognition of structural changes which foreshadow its failure in the future. When heart failure is well established, it presents, in the majority of instances, few difficulties of diagnosis. But it is more difficult, and in some respects more important, to recognize the earliest signs of failure or to foresee it before it comes. The recognition of the necessity for early diagnosis and the difficulty inherent in this have induced in many practitioners a fear that early heart disease may pass undetected by them. This fear has led to many an erroneous diagnosis which has infiicted injustice and misery upon the patient. Also many patients rationalize their symptoms incorrectly as arising from the heart. So it comes to pass that \"a large proportion of those who think or fear they have heart disease, turn out on careful examination to be free from it.\"(1) By a careful evaluation of symptoms and signs it is possible to avoid such errors to a large extent.\n\nIf the heart actually is faili11g, the diagnosis of this fact is made from the history and from the examination of other organs than the heart. In patients in whom structural changes are present, which may lead to failure of the heart in the future, the diagnosis rests mainly on the examination of the heart itself.\n\nTHE SYMPTOMS AND SIGNS OF FAILING HEART. There are two forms of heart failure, namely, heart failure with congestion and heart failure with pain.\n\nHeart Failure with Congestion. The cardinal signs of heart failure and congestion are oedema, orthopneea, enlargement of the liver and cyanosis. These are the signs of advanced heart failure, but usually before they appear evidence is available from the symptoms that an early stage of failure is present. There is no more important part of the examination than an evaluatwn of the symptoms disclosed by the history, especially breathlessness, pain, fatigue and the response to exercise. The most important evidence is that of deficient exercise tolerance, An estimate of the response to exercise is obtained most reliably from the history, that is, from the account given by the patient of his capacity to perform familiar tasks. Many exercise tests have been proposed by which it is claimed that an estimation can be made as a clinical observation with almost the same mathematical accuracy as in a blood count. These tests are of very limited value, because they can take no account of the nervous factors at work, because it is impracticable to use the same exercise test for all, irrespecttve of their age, bulk, habits et cetera, and because there is no basis of comparison in each patient with response to similar physical work under normal conditions.\n\nThe exercise tolerance is a matter for judgement rather than observation. The most dependable opinion is founded upon close cross-questioning of the patient as to the degree of discomfort attaching to the performance of the usual daily routine, such as the occurrence of dyspnraa or pain or fatigue (of a degree judged to be untoward to the patient) in ascending stairs, walking up hills or inclines or even walking along the level street. Thomas Lewis has summarized the interpretation to be placed upon a deficiency in the exercise' tolerance as follows:\n\n1. In the presence of definite enlargement of the heart, aortic disease, mitral stenosis, or fibrillation of the auricles, any undue distress after exercise should be attributed to cardiac disease.\n\n2. In young subjects, if none of the above four conditions is present, a definite diminution of exercise tolerance should rarely be attributed to the heart. Tuberculosis and other infections are likely.\n\n3. In the elderly, in whom there is no sign of structural change, if the exercise tolerance is poor, the heart should be blamed. Such persons are liable to suffer from angina pectoris or from myocardial damage, in which the chief symptoms may be breathlessness or undue fatigue rather than pain.(I) When heart failure with congestion is advanced, the cardinal signs already mentioned are present. Some of these will be discussed later.\n\nHeart Failure with Pain. Heart failure with pain occurs with angina pectoris and in coronary occlusion. The latter is such a clearly defined clinical entity that it will be given separate. presentation.\n\nCardiac pain is often the chief evidence of heart failure. It sometimes occurs in patients who present no clearly perceptible signs of structural change, such as cardiac enlargement, and must be distinguished from less serious forms of cardiac pain sometimes present in patients who have no organic disease. The relevant facts in diagnosis are:\n\n1. Grave angina pectoris is a malady of middle life or advanced years.\n\n2. Exercise is the chief provocative cause of pain in both types, but in grave angina the attack of pain is not experienced while the subject rests in bed, unless it is brought out also by mild exercise. In the milder form of cardiac pain, the attacks are not infrequent at night time and may be confined to resting hours.\n\n3. Grave angina starts usually in the sternal region; the less serious type of cardiac pain starts in the region of the precordium.. (Except in mitral stenosis, great cardiac enlargement and acute pericarditis, pain over the apex is not due to organic heart disease.) The radiation to neck and arms is very similar in the two types. Hyperresthesia is present in both and over similar areas.\n\n4. Signs of structural heart disease are often, though not always, present in the grave form, and alternation in the strength of the pulse beats (pulsus alternO!Tl8) is frequently displayed; not so in the less serious form.\n\n5. In the less serious form the patient is usually highly strung and is often the subject of neuroses. He has the \"effort syndrome,\" rapid heart action being the rule, and the response of the heart rate to exercise is exaggerated.?' THE SIGNS OF HEART DISEASE. There are certain cardinal principles of physical diagnosis to be clearly recognized.\n\n\nAge.\n\nOnly in very rare and exceptional instances is it justifiable to diagnose heart disease in patients under forty years of age in the absence of one or more of certain chief reliable signs. In the elderly the contrary is true.\n\nThe Chief Reliable Signs. The chief reliable signs are eight in number, five to be detected in the examination of the heart and three in the examination of other organs: (I) Definite signs of enlargement of the heart, (it) a definite precordial thrill, (iii) an undoubted pericardial friction rub, (Iv) a diastolic murmur, (v) an abnormal rhythm, especially one in which gross irregularity is present, persisting when the heart rate is over 120, (vi) distinct over-distension of the veins of the neck, (vii) expansile pulsation of the liver, (viti) generalized arterial disease or a persistent high blood pressure (180 or over).\n\nIt has been said that in exceptional instances a diagnosis of heart disease is allowable in spite of the absence of any of the chief reliable signs. Such instances are angin-a pectoris, certain conditions revealed by the electrocardiograph, acute and subacute bacterial heart disease and defiBitely lessened exercise tolerance in elderly patients.\n\nIn some instances also a firm diagnosis is not possible because in syphilis, acute rheumatic fever, chorea and hyperthyreoidism sufficient time may not have elapsed to determine if cardiac damage has occurred. For these latter exceptions the term \"potential heart disease\" has been rightly suggested.\n\nEnlargement of the Heart. The size of the heart is variable in normal people, the weight of the heart muscle being related to the weight of the general somatic musculature. Therefore allowance must be made for this. All measurements of the heart in the living are only approximate. The most reliable physical sign indicating the size of the heart is the position of the apex beat. When the chest is palpated a maximal impulse can be felt. This is a definitely palpable thrust, recognizable as being caused by the push of the underlying heart muscle, and is to be distinguished from an indeterminate fiicker sometimes felt over the precordium. The maximal impulse is usually felt over a circumscribed area of about 2·5 centimetres (one inch) in diameter. The outermost margin of this circumscribed area is the apex beat. It is the best clinical guide we possess to the left border of the heart, and, providing the heart is not displaced, to the size of the organ. A well defined maximal Impulsa which lies beyond the natural limits, namely, an impulse situated more than 11·25 centimetres (four and a half inches) to the left of the mid-sternal line or quite clear of the nipple line, is to be taken as a definite sign of the heart's enlargement. The sign is all the more emphatic if it is discovered in the sixth interspace; it is less emphatic if found in the fourth. The position of the apex beat when so abnormally displaced is evidence of the size of the heart as a whole and no decision is possible as to the relative amount of dilatation and hypertrophy which is present. \"To assess the comparative degrees of hypertrophy and dilatation is rarely, if ever, possible. It is probable that in almost all instances where the heart is permanently enlarged, hypertrophy and dilatation are coexistent; to estimate the relative degrees of muscular growth and stretching in the living man is not possible; it is, moreover, unnecessary.vw Dilatation may be diagnosed as the predominant change only when the position of the apex beat has been observed on repeated examinations to move in the course of a few hours or days.\n\nPercussion of the heart is of much less value than palpation. In some instances an approximate knowledge of the position of the left border of the heart can be obtained. When this is situated abnormally to the left, it is an indication of the presence of ventricular enlargement without reference to which ventricle is involved. It is not necessarily of itself indicative of dilatation or of hypertrophy of the left ventricle.\n\nPercussion of the right border of the heart is of value only when the organ is displaced. It is difficult or impossible of accomplishment with any degree of accuracy and has little or no clinical value except in detecting or aiding to detect displacement of the heart. When the. heart is not displaced and a right margin is recognized by percussion, it has relation, not to the ventricle, but to the right auricle, and we possess in the over-distension of the veins of the neck a much more reliable indication of enlargement of the right auricle.\n\nThe most reliable indication of the size of the heart is obtained by X ray examination carried out with a proper technique, and in case of doubt it is a method which should be used.\n\nEnlargement of the heart is a cardinal sign in many patients with heart disease and may be present when the valve lesion is insignificant, when hypertension is not present and when no adhesive pericarditis exists. There is an unknown factor in the causation of hypertrophy.\n\nIn many patients the presence of demonstrable enlargement solves the question of the significance of a murmur.\n\n\nA Definite Precordial Thrill.\n\nTo be significant, a thrill must be distinguished from a slight vibration or a \"suggestion of a thrill,\" which may be found in normal hearts, especially in young adults when the heart is beating vigorously after exercise or excitement. (At the apex in mitral stenosis, at the base in aortic and pulmonary stenoses-when it is essential to . the diagnosis-and in syphilitic aortitis, a detinite purring thrill is a cardinal sign of structural change.)\n\n\nAn Undoubted Pericardial Friction Bub.\n\nRarely is an undoubted pericardial friction rub unaecompanted by other definite evidence. In the acute pericarditis of rheumatic heart disease, it is accompanied by precordial pain, usually of severe grade, and in coronary occlusion it is frequently one of the several features of Ii. grave clinical picture.\n\nA Diastolic M1JIN1l,ur.\n\nThe time has surely passed when it should be necessary to belabour the point that a systolic murmur, as an isolated physical sign, is of very slight significance as evidence of heart disease. The presence of a systolic murmur means no more than that the examination of the heart must be carried out carefully to determine if there are definite signs of cardiac disease. If this sign is present, it is not the murmur, but such evidence as the careful estimation of the size of the heart, the occurrence of rheumatic fever in the past or the diminution of exercise tolerance which decides the question.\n\nTime and again hearts which have shown persistent systolic murmurs during life have been found quite normal at autopsy. This statement applies to all types of systolic bruit, soft and blowing, harsh and musical, \"conducted\" or otherwisa; the character of the sound is no criterion as to its significance.\n\nNor is the location of the systolic murmur a reliable sign. The commonest apical systolic murmur is a cardiorespiratory 'sound, in reality a breath sound broken into two or more short murmurs. It is frequently associated with rapid heart action, but may be heard in slow hearts; it is not necessarily confined to inspiration. It is sometimes conducted into the axilla and may be heard even at the angle of the left scapula. If it is due to regurgitation, it is impossible to tell from the murmur alone if it is due to a lax mitral ring or a deformed valve cusp. If it is due to the former, it betokens a weakened myocardium, but there are much more reliable signs of this. If it is due to a deformed valve cusp and no signs of stenosis are present, it is of little or no consequence if none of the reliable signs of heart disease is present.\n\nThere was a time, not long since, when mitral regurgitation was a fashionable diagnosis, but it is now clear that, even in the hands of experts, the diagnosis of mitral regurgitation Is-uncertain, if not impossible. Mackenzie relates how Graham Steel startled him nearly forty years ago by stating that no one ever died of mitral regurgitation and of the steps which led him to confirm this opinion. Even if mitral reflux does occur at a lax mitral ring, it is an insignificant matter.\n\nIt is the hypertensive heart disease, the auricular fibrillation, the anremia or the widespread infection et cetera which was the real cause of death and not the relaxation of the mitral ring which they caused.\n\nCabot, in an analysis of 1,846 necropsied cases of heart disease, came to the follOWing conclusions on mitral regurgitation:\n\n(1) \"Mitral regurgitation without stenosis is the commonest diagnosis now made by American physicians in cases of real or suspected heart disease.\n\n(2) \"This lesion is exceedingly rare P08t motrlem; only seven cases, three of them doubtful, were found in 1,846 necropsied cases of heart disease.\n\n(3) \"Even in rare cases, where mitral regurgitation without stenosis does exist, there are no physical signs by which it can be reasoned out, so that a diagnosis of mitral regurgitation without stenosis is never justified.\n\n(4) \"... for the happiness and comfort of aU concerned it is essential that we should get this matter straight.\"'\"> Systolic murmurs at the base 01 the heart are of no greater significance, when no other signs of heart disease are present. They are useful in reminding the physician to determine if a thrill is present, should he have neglected to do so, but of themselves, no matter what their character, they are not evidence of stenosis of either aortic or pulmonary valves. MAY 23, 1931. Tricuspid systolic murmurs are heard frequently in normal people.\n\nBut it is a different case with diastolic murmurs. If a definite diastolic murmur is present at the base or at the' apex, it is much more likely to be significant of disease' than is a systoltc murmur, if the examiner can be certain it is endocardial. But it is not often that the diagnosis rests on the murmur alone. Aortic regurgitation in most instances has the other characteristic signs of waterhammer pulse, relatively low diastolic pressure, cardiac enlargement and a history of acute rheumatism or syphilis. Yet in rare instances, when the amount of refiux is small and the arterial and the cardiac sighs of regurgitation are inconspicuous, a diastolic aortic murmur, usually heard better to the left than to the right of the sternum, may be the only sign of early incompetence, but it is doubtful if one is ever justified in making a positive diagnosis of aortic regurgitation on such evidence alone.\n\nMitral stenosis should never be diagnosed in the absence of a diastolic murmur. Sometimes the murmur is so slight that it can be detected only by ausculation after exercise and change of position, especially lying on the left side.\n\n\nIrregularity of Rhythm.\n\nIn the scope of this article the whole question of arrhythmia cannot be discussed.\n\nArrhythmia, when it arises from auricular fibrillation (or fiutter) and pulsus alternans, is an indication of organic heart disease.\n\nWhen due. to extra systoles, paroxysmal tachycardia or atrio-ventricular rhythm, it may be, but is not necessarily, associated with organic disease. If it is, the recognition of thls comes from the signs other than the arrhythmia. These conditions may occur in the normal heart.\n\nWhen the irregularity arises from sinus arrhythmia or sino-auricular block, no suspicion of organic disease need be harboured.\n\nThe recognition of the type of arrhythmia can sometimes be made only after a' study of the electrocardiogram, but this is not necessary in all instances. There are certain salient characters of some arrhythmias which make the diagnosis posstble without instrumental examination, and some of these arhythmias are among the chief reliable signs of heart disease. Auricular Fibrillation. Auricular fibrillation never exists without disease of the heart muscle. When present, it is usually accompanied by manifest signs of disease or by heart failure. As reliable diagnostic phenomena, it is to be noted that:\n\n1. It is the commonest irregularity associated with insutnciency of the heart.\n\n2. It is usually associated with a rapid heart. It is substantially true to say that it is the only irregularity accompanying heart rates of over 140 per minute, and it is the only irregularity at all common in rates of over 120. If the heart rate is below this figure and auricular fibrillation is suspected, the irregularity persists if the rate is raised to over 120 by exercise or otherwise. It is the only arrhythmia which behaves in this fashion.\n\n3. Except in the exceedingly rare instances of paroxysmal auricular fibrillation which sometfmes occur, it is a persistent condition uninfluenced by respiration, posture, activity or sleep.\n\n4. The irregularity is a gross one, both in time and force, and a pulse deficit is usually present. A pulse deficit may be detected by noting the absence of some of the heart beats at the wrist as one palpates the pulse and simultaneously listens over the apex with the stethoscope.\n\nA pulse deficit may be present, however, in arrhythmia due to extra systoles, and in very rare cases of pulsus atternans, in which the weaker beats are not palpable at the wrtst., though recognizable by auscultation over the apex.\n\n\nExtra 8ystoles.\n\nExtra systoles are next in order of frequency as causes of arrhythmia, but they are not necessarily signs of a heart condition which is untoward for the patient.\n\nIf they occur in conjunction with heart disease, the fact is recognized by other symptoms or signs of cardiac disability. However, they may cause an irregularity Which must be distinguished from that of auricular fibrillation. The intermittency of the pulse (the extra systole being represented by a beat out of time or by an intermission) may be at regular or irregular intervals or may group the pulse into twos or threes.\n\nExtra systoles are recognized by the following criteria. 1. They disappear when the pulse rate rises to 140 or even to 120, either from exercise or otherwise. They are rarely present in hearts beating at rates over 100.\n\n2. They are not characteristically associated with the failing heart.\n\n3. They are variable in occurrence, frequent at one time, few or absent at another. 4. On auscultation, a dominant rhythm is found and the extra systole can usually be recognized, followed by a longer pause than in normal rhythm.\n\nSome rare forms of arrhythmia (for example, dropped beat of partial heart block, sino-auricular block et cetera) may be mistaken for extra systoles, but they are of very rare occurrence and can only be diagnosed after electrocardiographic examination.\n\nParoxysmal Tachycardia. Paroxysmal tachycardia is a clear cut clinical entity. There is invariably a striking history of an abrupt onset and (except rarely) an equally abrupt offset of rapid heart action. The heart .rate is regular and usually lies between 140 and 200 per minute. The rate is regular and constant, being approximately the same at all times during the paroxysm. The attack may last a few minutes or for hours or days. It is generally repeated. If it lasts more than fourteen days, the paroxysm is probably due to auricular flutter and is not a true paroxysmal tachycardia.\n\nIt is not associated necessarily with organic heart disease. \"It can safely be asserted that at autopsy the pathologist, unaware of the clinical history, finds nothing that leads him to say this patient was affected by paroxysmal tachycardia.\"I61 If it is associated with organic disease of the heart, this is recognized by other signs. In most instances no recognizable structural damage is present and the prognosis for life is favourable. Auricular Flutter. If auricular flutter is present, the heart is usually organically diseased, but there are no structural lesions to which it can be ascribed deflnitely. It is essentially similar to auricular fibrillation and is frequently a half way house to that condition. The rhythm is usually regular. When irregularity is present, it is not gross. The rate varies from normal to 160, commonly between 110 and 160. The rate is fixed as in paroxysmal tachycardia and is unaffected by those influences which accelerate or retard normal rhythm (exercise, rest, posture, excitement et cetera). There are usually symptoms of heart failure. It. may be paroxysmal and must therefore be differentiated from paroxysmal tachycardia, but it is a much rarer arrhythmia. Its certain recognition can be made only by the study of the electrocardiogram, but the longer duration, the generally slower pulse rate and the response to digitalis or quinidine will enable the distinction to be made in many instances.\n\n\nHeart Block.\n\nComplete or auriculo-ventricular block in which the auricle and ventricle beat at different rates is the only kind of block whose presence may be suspected without electrocardiographic examination.\n\nErrors are frequent, however, in diagnoses made without graphic methods.\n\nA pulse rate of less than forty is usually due to heart block. Other conditions causing it are so rare and detectable only by graphic methods that they may be disregarded by the general practitioner.\n\nA pulse rate of between 40 and 60 may be due to heart block, simple bradycardia (physiological) or some rare causes only recognizable in an\" electrocardiogram. It is not wtse to diagnose heart block when the rate is over 40 without an electrocardiogram.\n\nIn a favourable instance for diagnosis by ordi.nary clinical methods the pulse rhythm is regular, the rate not over 40 per minute and auricular aounda are faintly heard over the base with the stethoscope and the difference in auricular and ventricular rates may be detected by seeing the more rapid auricular waves in the neck veins and feeling or hearing the ventricular contractions at wrist or apex.\n\nAn Adams-Stokes phenomenon sometimes occurs at the initiation or during the course of heart block.\n\nIt is associated with standstill of the ventricles. If the ventricle ceases to beat for more than ten seconds, the cerebral aneemia causes giddiness, then loss of consciousness, and if for more than fifteen seconds, convulsions as in an attack of major epilepsy.\n\nIf the standstill continues, the patient dies, but if the ventricle resumes its contraction the patient quickly recovers.\n\nWhen a patient describes a sudden loss of consciousness during which he falls down and immediately recovers, the possibility of heart block must always be considered.\n\nIn some instances repeated attacks of convulsions occur until the ventricle begins to contract regularly.\n\nSuch attacks may be distinguished from true epilepsy by the facts that usually the tongue is not bitten or the urine and freces passed during the attack, and from ordinary syncope by the fact that in the latter condition the heart rate is not sutll.ciently slowed (usually about fifty).\n\nPulsus Alternans. The recognition of pulsus alternans can be made most certainly by the polygraph, but in well marked instances it may be detected while taking the blood pressure. Pulsus alternans, or alternation of the ventricles, is a state in which the pulse is regular, but consists of a strong beat followed by a weak one. In examining the blood pressure when alternation is marked, as the pressure rises in the CUff, the number of pulse beats is halved before the pulse finally disappears, a difference of from ten to thirty millimetres of mercury existing between the pressure of neighbouring beats. When pulsus alternans is accompanied by no other symptoms or signs of heart disease it has no significance, but when such signs are present it indicates a sinister condition.\n\nLewis has called it under such circumstances \"the faint cry of an anguished and fast failing heart muscle.'?\"\n\n\nVentricular Fibrillation.\n\nVentricular fibrillation is a terminal phase of grave organic disease and calls for no discussion here.\n\n\nDistinct Over-Distensia<n of the Veins of the Neck.\n\nIn the normal person lying at ease there is sometimes to be observed a soft filling of the veins of the neck with the characteristic fluctuations of the venous pulse. This is sometimes visible at the root of the neck, even when the patient is standing. But when the right auricle is engorged the veins of the neck become over-distended to a degree which is easily and definitely recognizable. This sign is of far greater consequence than any actual or supposed displacement of the right margin of cardiac dulness. \"It is an unmistakable phenomenon, one of those emphatic and legible signs of which we possess no surplus.\"'S)\n\n\nExpansile Pulsation of the Liver.\n\nExpansile pulsation of the liver is a sign of advanced heart failure, said by Mackenzie to be observed most frequently in heart failure from auricular fibrillation.\n\n\nGeneralized Arteriosclerosis and High Blood Pressure.\n\nThe commonest cause of myocardial damage operating in adult life, and discussed later under \"myocarditis,\" is generalized arteriosclerosis with high blood pressure.\n\nUnreliable Symptoms and Signs of Heart Disease.\n\nMany patients are condemned to an erroneous diagnosis of heart disease on the basis of symptoms and signs which, although sometimes present in organic heart disease, are found frequently in persons with normal hearts.\n\nSuch symptoms are pain, palpitation, fainting, dizziness, feeling of suffocation, exhaustion and slight degrees of breathlessness. None of these of itself justifies a diagnosis of heart disease.\n\nThe most important is pain. As has been pointed out earlier, pain may in some instances be the main evidence upon which the diagnosis is based. The characteristics of true cardiac pain have already been described. It may be repeated that pain over the apex is not significant of organic disease unless accompanied by one of the \"chief reliable signs.\"\n\nIf the pain is substernal, it may be unaccompanied by a reliable sign in patients beyond forty years of age and yet have grave significance. In this regard the electrocardiograph is of great value, since in about 70% of such patients definite evidence of damage to the myocardium is written in the slectrocardtogram.w \"Fainting is as rare in heart failure, contrary to popular belief, as it is frequent in vasomotor neuroses...UO) It is a good general rule that fainting never occurs as the result of heart disease without other outspoken evidence.\n\nPalpitation is rarely an initial symptom of heart failure, but is common in the neuroses.\n\nThere are also many physical signs which are unreliable as evidence of heart disease. Among these are slight thrills, diffuse cardiac impulse, systolic murmurs, cardiorespiratory murmurs, the so-called \"weak heart sounds,\" reduplication of first or second sound, normal protodiastolic gallop (third sound) in the young, sinus arrhythmia (respiratory or phasic) tachycardia of mild degree and inconstant rate and arrhythmia due to extra systoles in hearts which give no reliable evidence of organic disease.\n\nEpigastric pulsation is a sign which has to be interpreted with extreme caution, and oedema of the legs has inflicted on many a patient with varicose veins or ansemia or rheumatism and on many a rotund lady in the height of summer, an erroneous diagnosis of early heart failure.\n\n\nCoronary Occlusion.\n\nWe now recognize coronary occlusion as a distinct clinical entity. This is the outstanding recent addition to our knowledge of heart disease. It occurs particularly in men over the age of forty and is characteristically sudden in onset and not related to effort. Death occurs at once or in a few hours in about 50% of cases only. In those patients in whom sudden death does not occur, intense pain is the outstanding symptom. Agonizing in character, it may be substernal or epigastric. It lasts usually for hours or days and severe dyspncea accompanies it. Vomiting is frequent, the pulse becomes feeble, rapid and often irregular, fever and leucocytosis develop some hours afterwards, the blood pressure is often suddenly lowered, weak heart sounds, a gallop rhythm and pericardial friction may appear, and congesttvc heart failure often follows. Sometimes pain is absent, the onset being marked by collapse and dyspnrea. Electrocardiographic examination in most instances shows characteristic changes in the ventricular complexes. The reader unfamiliar with the work published since 1928 describing the clinical features of coronary occlusion is recommended to consult a recent text book.\n\nCoronary occlusion must be differentiated from angim« pectoris, acute abdominal catastrophes and pneumonia.\n\nThe pain of angiJoo pectoris is clearly distinguishable because of its onset usually after exertion, its shorter duration (minutes only) the absence of severe shock and dyspnoea, the unchanged character of the pulse and heart sounds, and the lack of pyrexia, leucocytosis and blood pressure changes. Congestive heart failure does not follow angina.\n\n\nMyocardial Lesions.\n\nMyocarditis, as a clinical diagnosis, has been much abused. \"In some instances it would seem reasonable' to suppose that the user's mind worked somewhat as follows: 'I think there is something wrong with the heart. I can't hear any murmurs, so I can't blame it on a valve lesion; I don't know what the trouble is, so I guess I'll just say it is myocarditis.' Thus the term myocarditis has been applied to cases of cardio-vascular syphilis, senescent heart disease, hypertensive heart disease et cetera, and even to cases in which the heart is normal.\n\nIn this sense myocarditis has at times been used as a waste-basket dtagnosts.\"?\"\n\nThat myocarditis exists commonly is undoubted, as every pathologist knows, but as a clinical diagnosis the term should be used ctreumspectly, as part only of a larger diagnosis. It is 'the predominant feature in rheumatic heart disease, syphilitic heart disease and hypertensive heart disease, but its presence should never be diagnosed in the absence of some of the reliable symptoms and signs already detailed.\n\nThe presence of an etiological factor is of importance. Especially is this the case when marked coronary disease, arteriosclerosis or hypertension or undoubted valvular lesions are present.\n\nIt is not uncommon to meet a diagnosis of myocarditis based on symptoms in a patient whose heart is normal on examination. A guiding principle is that in the absence of one of the \"chief reliable signs\" or of anginal pain the myocardium of young people may be pronounced sound whether breathlessness is present or not. Also the myocardium may be pronounced sound in patients of all ages when exercise tolerance is good. But if the reaction to exercise is not good in patients over forty years of age, and no other satisfactory cause for this is discoverable (for example, pulmonary disease), the heart muscle should not be pronounced sound, even if there are no physical signs of disease.\n\nBreathlessness of cardiac origin is common in old men who present no signs of structural heart change.\n\n. Altered heart sounds (\"weak sounds,\" systolic murmurs, reduplications et cetera) should never be used alone to diagnose myocardial disease. Where they exist in diseased hearts they are accompanied by other definite signs or symptoms of heart disease.\n\nThe diagnosis of \"myocarditis,\" therefore, is one not to be made at random. It should never be made unless the evidence is reliable and clear in the mind of the examiner. It is preferable that it should be a part of a larger diagnosis, such as, for example, \"the myocarditis of hypertensive heart disease.\"\n\n\"Fatty Heart.\" The name fatty heart has now disappeared from medical literature. The pathologist and the clinician have come to doubt the disease significance of depositions of fat in the heart and regard the term \"fatty degeneration\" as a misnomer. With more precise knowledge the \"fatty heart\" of. our fathers has been lost, mainly in the condition of hypertensive heart disease, just as the \"fibroid heart\" has disappeared with the clearer recognition of the causes of degenerative changes in the myocardium. \"Heart Strain.\"\n\nWhile \"myocarditis\" is a' diagnosis which is somewhat suspect because it is too vague and the \"fatty heart\" and the \"fibroid heart\" are completely in the discard, \"heart strain\" is still with us, although it should have been the first of these names to disappear.\n\n\"Heart strain\" is a diagnosis which is often given, one suspects, to satisfy the patient's views. But it is doubtful if the layman's vague ideas on this matter are more vague than those of some medical men who permit the term. This term and \"irritable heart\" are frequently used loosely to label ailments the nature of which is imperfectly understood. This diagnosis is very frequently made' in patients suffering from neurosis.\n\nThe healthy heart is able to withstand all \"strains\" or demands made upon it, no matter how extreme the degree of physical effort. It is protected by the fibrous pericardium, but, more importantly, by the fact that the full supply of blood to the somatic muscles and the excretion of lactic acid products formed by the muscles will fail before the heart, if the call is excessive. It has also been shown that a breakdown of the respiratory functions with complete failure to eliminate carbon dioxide will protect the' healthy heart from damage by excessive exertion. The idea that the healthy heart will be damaged by excessive physical work is a relic of the old tradition, now moribund, that the first and last cause of heart failure is a mechanical defect.\n\n. Lewis summarizes his experience by saying: \"If strain of the healthy heart exists, it is no more than a curiosity.\"W> Therefore one has only to consider the effect of strain on the diseased heart, that is, the damaged mvocardtum. An unhealthy state of the myocardium may be due to a present infection which may be so slight as a mildly pyrextal attack of tonsillitis or Influenza. Or it may be due to the effects of an old infection, such as rheumatic fever. From such causes as these, the myocardium may be so weakened as to reduce its capacity for withstanding mechanical strains. The strain may be sudden or long continued. It is the sudden onset of heart failure which is of most importance to discuss from the point of view of diagnosis.\n\nSudden effort in some instances appears to precipitate the' onset of heart failure. In a patient with damaged heart muscle whose cardiac reserve power is lessening, it is not surprising that his first distress should come at a moment of severe exertion; at such a moment his reserve power is called upon and is found wanting. It is the progressive changes in the myocardium which are the predominant feature and not the physical exertion. In other instances the onset of auricular fibrillation occurs after a severe effort and is followed by heart failure. It is possible that the increased heart rate is the means by which auricular fibrillation is produced by severe effort in patients whose auricular muscle is ready to fibrillate. Mackenzie states that: \"Every case of heart failure with respiratory distress from what is called 'heart strain' which followed some extra effort that I have seen, could be attributed to the onset of auricular fibrillation or its allied condition, flutter.\"na'\n\nWhere the strain is a long continued one, as, for example, when a patient with mitral or aortic disease with the associated myocardial changes engages in heavy manual work, the time of ultimate failure may be hastened. Such a heart is bound to progress deliberately to failure under any circumstances. If the patient performs heavy manual, labour, he makes greater demands on his reserve power, he uses it up more quickly and it disappears earlier than if he had lived an easier physical life.\n\nIn the writer's opinion it is impossible to evaluate the effect that the continuous heavy physical work has had in such patients in hastening the time when heart failure occurs.\n\n\"Heart strain\" does not occur, therefore, in the healthy heart. If strain plays any part in producing heart failure, it does so only in the diseased heart, the underlying damaged condition of the myocardium being the predominant factor.\n\nIn most instances, however, the diagnosis of \"heart strain\" has been given to patients with healthy hearts, but unhealthy nervous systems, victims of a cardioneurosis. The story is nearly always that during a severe effort, usually when the arm and shoulder muscles are being used, the previously healthy patient feels pain in the precordium (over the apex of the heart) and often dizziness. Although this may be due to strain or fibrositis of the superficial muscles of the thorax, the patient fears that he has \"strained his heart.\" He consults a doctor and his fears may be confirmed by an erroneous diagnosis. Shortness of breath appears and an unstable tachycardia. In fact, he develops many or all of the unreliable symptoms of heart disease-he becomes \"heart conscious.\" His cardioneurosis, when fully established, is difficult to combat, especially if he is a claimant under the Workers' Compensation Act.\n\n\"Acute Dilatation of the Heart.\"\n\nA diagnosis of acute dilatation of the heart is frequently encountered and sometimes betrays a misconception of the real nature of the phenomena. It frequently arises from the conviction that a pathological SUdden dilatation of the heart may occur and cause grave symptoms of heart failure.\n\nIn the healthy heart dilatation probably occurs during exertion, as shown under experimental conditions by Starling, but this is a physiological and not a pathological process. It is a temporary change, because the heart of the healthy person has been shown by accurate investigation to return immediately after exercise to a condition in which it is rather smaller than before exercise. It has been pointed out in discussing \"heart strain\" that Nature has provided the healthy heart with efficient safeguards. There is no evidence that a pathological acute dilatation of the healthy heart does occur.\n\nIt is doubtful also if an acute (sudden) dilatation of the diseased heart occurs except as a phenomenon secondary to some other cause. Many believe that heart failure sometimes arises suddenly from this cause, as, for example, after surgical operations.\n\nIt is now known that the undoubted dilatation present in such patients arises' as the result of the sudden onset of arrhythmia; this primary condition causes gross over-action of the heart which in its turn produces sudden dilatation. It is important to recognize that dilatation of the heart is not the cause of a rise in the heart rate. It is sometimes an effect, however. An accurate knowledge of the signs and symptoms of the arrhythmias will enable a true diagnosis to be made.\n\nIn this discussion it must be clearly kept in mind that sudden dilatations only are under consideration. Dilatation of the heart, other than acute, is commonly one of the many phenomena of heart disease and heart failure.\n\n\nThe Cardiac Neuroses.\n\nMore errors in the diganosis of cardiac disease arise from a failure to distinguish the neuroses from organic disease than from any other cause, and the patient is indeed the sufferer.\n\nIn this article an attempt has been made to indicate the criteria upon which recognition of the neuroses rests. A clear understanding of the significance of symptoms and stgns, of those which are reliable and those which are not, is the main necessity. As soon as it is recognized that precordial pain and hyperresthesia, shortness of breath, dizziness, tremor of the hands, with cold, clammy hands .and even cyanotic fingers, and an unstable tachycardia unaccompanied by definite reliable signs, are not suggestive .ot heart disease, most of the ditllculties disappear. Among those physical signs which have been responsible for confusion, the commonest have already been discussed. They are increased but variable heart rate, systolic murmurs, diffuse apex beat, weak heart sounds, reduplicated heart sounds and exaggerated lack of exercise tolerance when no other sign of organic heart disease is present (\"effort syndrome\").\n\nThe only real ditllculty in diagnosis is presented by hyperthyreoidism. The three important factors are, when doubt exists, the nature of the tachycardia, the determination of the basal metabolic rate and the result of treatment at rest. The second and third quarterly reports were presented to the meeting and adopted.\n\nSeveral case histories were then read in detail and discussed.\n\n\nEclampsia.\n\nMrs. M.F., an Australian, aged twenty-three, a pr1l1lUpaq 'a. was admitted to hospital semiconscious and quite blind. She had been sent in from the country by a doctor who said that she had had no antenatal supervision. Her first fit occurred at 4 a.m. on May 13, 1930, and was followed quickly by four more. On admission to hospital her temperature was 38'3°C. (101°F.), her systolic .blood pressure was 170 millimetres of mercury, her pulse rate 120 and her urine became solid on boiling. She .had another four fits and did not regain consciousness. She was treated by colon irrigations and washing out of the stomach, magnesium sulphate being left in the stomach. She appeared dangerously ill and was getting rapidly worse, so that a Cresarean section was decided upon. Before operation could be commenced she had a fit, in which she went quite black in the face and stopped breathing and she appeared to have died.\n\nArtificial respiration was perforined and breathing recommenced. Thirteen hours after the first fit operation was performed. A small amount of ether was used for anresthesia and the classical Cresarean section was done. The abdominal wall was very cedematous and much serous fluid came from the incision.\n\nBoth ovaries were enlarged and cedematous, resembling two big sausages, being about 11·25 centimetres (four and a half inches) long and five centimetres (two inches) in diameter. She improved rapidly after operation and' sevsn hours later was able to talk when roused. On the following morning she spoke rationally and her sight began to improve. She then recovered rapidly and on leaving hospital her systolic blood pressure was 140 millimetres and there was only a trace of albumin in the urine. Her puerperium was uneventful, the child survived and lactation was established.\n\nPelvic Deformity.\n\nMrs. F.F., an Australian, aged thirty-eight, was in her first pregnancy. There was considerable pelvic deformity and X ray examination revealed the left hip and thigh ankylosed in a flexed position. When the left foot was on the ground she was bowed forward and her head was barely four feet from the ground. The external pelvic measurements were as follows: Interspinous, 18 centimetres; intercristal, 22 centimetres; external conjugate, 14 centimetres. The true conjugate was estimated to be 5·6 centimetres. She had had a severe illness when she was ten years of age, probably due to acute osteomyelitis of the pelvis. She was admitted to hospital in labour and Cresarean section was performed twelve hours after its commencement. The classical operation was done and convalescence was uneventful. The child was delivered alive and weighed 2·9 kilograms (six and a half pounds).\n\n\nTuberculosis.\n\nMrs. M.C., an Australian, was in her fourth pregnancy. This patient was suffering from pulmonary tuberculosis and had been under treatment by artificial pneumothorax all through her pregnancy. The first stage of labour lasted ten hours and the second two hours. She was delivered naturally of a femal.e child which was full term, weighed 2·9 kilograms (six and a half pounds), but was still-born. The placenta was adherent and was manually removed on account of heemorrhage one and a half hours after the second stage. The puerperium was uneventful.\n\nA Case for Diagnosis.\n\nMrs. K.M.W., an Australian, aged twenty-five, was in her third pregnancy. Her previous obstetrical history showed that she had a long labour with her first child four years before, the perineum being badly torn; a considerable amount of blood was lost before delivery of the placenta. Her second confinement, two years before, was accompanied by albuminuria and <edema. An infant, four kilograms (nine pounds) in weight, was born by the aid of forceps and the perineum was badly torn again. Her puerperium was morbid. During the present pregnancy she had been\n\n\nOF THE OBSTETRICAL SECTION OF THE QUEENS-LAND BRANCH OF THE BRITISH MEDICAL ASSOCIATION was held at the B.M.A. Building, Adelaide Street, Brisbane, on -October 28, 1930, DR. F. A. HoPE MICul)n. the President, in the chair.\n\nFacts on the Heart. R C Cabot, 17R. C. Cabot: \"Facts on the Heart,\" 1926, page 17.\n\nCardinal Principles in Cardiological Practice. Thomas Lewis, The Britis.h Medical JQW1'1l. J.l521Thomas Lewis: \"Cardinal Principles in Cardiological Practice,\" The Britis.h Medical JQW1'1l,(J.l, November 15, 1919, page 521.\n\nThe Soldier's Heart and the Effort Syndrome. Thomas Lewis, Thomas Lewis: Ibidem. 51Thomas Lewis: \"The Soldier's Heart and the Effort Syndrome,\" 1918, page 77. «) Thomas Lewis: Ibidem, page 51.\n\nFacts on the Heart. R C Cabot, 295R. C. Cabot: \"Facts on the Heart,\" 1926, page 295.\n\nThe Heart in Modern Practice. W D Reid, 252Second EditionW. D. Reid: \"The Heart in Modern Practice,\" Second Edition, 1928, page 252.\n\nClinical Disorders of the Heart Beat. Thomas Lewis, 121Sixth EditionThomas Lewis: \"Clinical Disorders of the Heart Beat,\" Sixth Edition, 1925, page 121.\n\nThe Soldier's Heart and the Effort Syndrome. Thomas Lewis, 61Thomas Lewis: \"The Soldier's Heart and the Effort Syndrome,\" 1918, page 61.\n\nClinical Aspects of the Electrocardiogram. H E B D Pardie ; W, Reid, IV191The Heart in Modern Practice. Second EditionH. E. B. Pardie: \"Clinical Aspects of the Electro- cardiogram,\" 1924, page 156. (10) \"Nelson Loose Leaf Living Medicine,\" Volume IV, page 282. (ll) W. D. Reid: \"The Heart in Modern Practice,\" Second Edition, 1928, page 191.\n\nThe Soldier's Heart and the Effort :Syndrome. Thomas Lewis, S. A. SMITH, M.B., Ch.M. (Sydney), Horwrary Physician, Royal Prince Alfred Hospital, Syam.ey31Thomas Lewis: \"The Soldier's Heart and the Effort :Syndrome,\" 1918, page 31. S. A. SMITH, M.B., Ch.M. (Sydney), Horwrary Physician, Royal Prince Alfred Hospital, Syam.ey.\n", "annotations": {"author": "[{\"end\":20,\"start\":16},{\"end\":29,\"start\":21},{\"end\":40,\"start\":30}]", "publisher": null, "author_last_name": "[{\"end\":19,\"start\":16},{\"end\":28,\"start\":21},{\"end\":39,\"start\":30}]", "author_first_name": null, "author_affiliation": null, "title": null, "venue": null, "abstract": null, "bib_ref": "[{\"end\":119,\"start\":110},{\"end\":3623,\"start\":3617},{\"end\":16112,\"start\":16103},{\"end\":43152,\"start\":43149}]", "figure": "[{\"attributes\":{\"id\":\"fig_0\"},\"end\":47173,\"start\":46949}]", "paragraph": "[{\"end\":92,\"start\":58},{\"end\":140,\"start\":94},{\"end\":357,\"start\":142},{\"end\":1449,\"start\":359},{\"end\":1767,\"start\":1451},{\"end\":1914,\"start\":1769},{\"end\":3175,\"start\":1916},{\"end\":3733,\"start\":3177},{\"end\":3932,\"start\":3735},{\"end\":4136,\"start\":3934},{\"end\":4573,\"start\":4138},{\"end\":4777,\"start\":4575},{\"end\":5123,\"start\":4779},{\"end\":5195,\"start\":5125},{\"end\":5519,\"start\":5197},{\"end\":5911,\"start\":5521},{\"end\":6136,\"start\":5913},{\"end\":6484,\"start\":6138},{\"end\":6717,\"start\":6493},{\"end\":7347,\"start\":6719},{\"end\":7696,\"start\":7349},{\"end\":7998,\"start\":7698},{\"end\":10117,\"start\":8000},{\"end\":10545,\"start\":10119},{\"end\":11093,\"start\":10547},{\"end\":11276,\"start\":11095},{\"end\":11551,\"start\":11278},{\"end\":11663,\"start\":11553},{\"end\":12146,\"start\":11697},{\"end\":12497,\"start\":12189},{\"end\":12522,\"start\":12499},{\"end\":13124,\"start\":12524},{\"end\":13430,\"start\":13126},{\"end\":14273,\"start\":13432},{\"end\":14760,\"start\":14275},{\"end\":14972,\"start\":14762},{\"end\":15098,\"start\":14974},{\"end\":15246,\"start\":15100},{\"end\":15395,\"start\":15248},{\"end\":15619,\"start\":15397},{\"end\":16178,\"start\":15621},{\"end\":17089,\"start\":16180},{\"end\":17322,\"start\":17091},{\"end\":17432,\"start\":17350},{\"end\":17566,\"start\":17434},{\"end\":17846,\"start\":17568},{\"end\":17974,\"start\":17848},{\"end\":18581,\"start\":17976},{\"end\":18661,\"start\":18583},{\"end\":19115,\"start\":18663},{\"end\":19306,\"start\":19117},{\"end\":19590,\"start\":19308},{\"end\":19822,\"start\":19592},{\"end\":20003,\"start\":19842},{\"end\":20429,\"start\":20005},{\"end\":20650,\"start\":20431},{\"end\":20721,\"start\":20652},{\"end\":20952,\"start\":20723},{\"end\":21205,\"start\":20954},{\"end\":21795,\"start\":21207},{\"end\":23240,\"start\":21797},{\"end\":23454,\"start\":23257},{\"end\":23528,\"start\":23456},{\"end\":23729,\"start\":23530},{\"end\":23984,\"start\":23731},{\"end\":24388,\"start\":23986},{\"end\":24488,\"start\":24390},{\"end\":24752,\"start\":24490},{\"end\":24875,\"start\":24754},{\"end\":25043,\"start\":24877},{\"end\":25150,\"start\":25045},{\"end\":25438,\"start\":25152},{\"end\":26221,\"start\":25440},{\"end\":26332,\"start\":26223},{\"end\":26465,\"start\":26362},{\"end\":27145,\"start\":26521},{\"end\":27347,\"start\":27183},{\"end\":27569,\"start\":27405},{\"end\":27618,\"start\":27571},{\"end\":27837,\"start\":27620},{\"end\":28033,\"start\":27839},{\"end\":28386,\"start\":28035},{\"end\":28936,\"start\":28388},{\"end\":29027,\"start\":28938},{\"end\":29535,\"start\":29029},{\"end\":29815,\"start\":29537},{\"end\":31029,\"start\":29839},{\"end\":31138,\"start\":31031},{\"end\":31488,\"start\":31140},{\"end\":32062,\"start\":31512},{\"end\":32144,\"start\":32064},{\"end\":32558,\"start\":32146},{\"end\":32749,\"start\":32560},{\"end\":33439,\"start\":32751},{\"end\":33543,\"start\":33441},{\"end\":33797,\"start\":33545},{\"end\":34105,\"start\":33799},{\"end\":34634,\"start\":34107},{\"end\":34899,\"start\":34636},{\"end\":35329,\"start\":34901},{\"end\":36090,\"start\":35331},{\"end\":36836,\"start\":36092},{\"end\":37833,\"start\":36838},{\"end\":38328,\"start\":37835},{\"end\":38507,\"start\":38330},{\"end\":38745,\"start\":38509},{\"end\":39660,\"start\":38747},{\"end\":39694,\"start\":39662},{\"end\":39986,\"start\":39696},{\"end\":40589,\"start\":39988},{\"end\":40844,\"start\":40591},{\"end\":41328,\"start\":40846},{\"end\":41551,\"start\":41330},{\"end\":41761,\"start\":41577},{\"end\":42691,\"start\":41763},{\"end\":43012,\"start\":42693},{\"end\":43076,\"start\":43014},{\"end\":44009,\"start\":43091},{\"end\":44315,\"start\":44011},{\"end\":44895,\"start\":44317},{\"end\":44914,\"start\":44897},{\"end\":45797,\"start\":44916},{\"end\":46364,\"start\":45815},{\"end\":46387,\"start\":46366},{\"end\":46948,\"start\":46389}]", "formula": null, "table_ref": null, "section_header": "[{\"end\":6491,\"start\":6487},{\"end\":11695,\"start\":11666},{\"end\":12187,\"start\":12149},{\"end\":17348,\"start\":17325},{\"end\":19840,\"start\":19825},{\"end\":23255,\"start\":23243},{\"end\":26360,\"start\":26335},{\"end\":26519,\"start\":26468},{\"end\":27181,\"start\":27148},{\"end\":27403,\"start\":27350},{\"end\":29837,\"start\":29818},{\"end\":31510,\"start\":31491},{\"end\":41575,\"start\":41554},{\"end\":43089,\"start\":43079},{\"end\":45813,\"start\":45800}]", "table": null, "figure_caption": "[{\"end\":47173,\"start\":46951}]", "figure_ref": null, "bib_author_first_name": "[{\"end\":47196,\"start\":47195},{\"end\":47198,\"start\":47197},{\"end\":47312,\"start\":47306},{\"end\":47535,\"start\":47529},{\"end\":47699,\"start\":47698},{\"end\":47701,\"start\":47700},{\"end\":47795,\"start\":47794},{\"end\":47797,\"start\":47796},{\"end\":47942,\"start\":47936},{\"end\":48103,\"start\":48097},{\"end\":48234,\"start\":48233},{\"end\":48240,\"start\":48235},{\"end\":48585,\"start\":48579}]", "bib_author_last_name": "[{\"end\":47204,\"start\":47199},{\"end\":47318,\"start\":47313},{\"end\":47541,\"start\":47536},{\"end\":47707,\"start\":47702},{\"end\":47802,\"start\":47798},{\"end\":47948,\"start\":47943},{\"end\":48109,\"start\":48104},{\"end\":48251,\"start\":48241},{\"end\":48257,\"start\":48253},{\"end\":48591,\"start\":48586}]", "bib_entry": "[{\"attributes\":{\"id\":\"b0\"},\"end\":47257,\"start\":47175},{\"attributes\":{\"id\":\"b1\",\"matched_paper_id\":20487573},\"end\":47482,\"start\":47259},{\"attributes\":{\"id\":\"b2\",\"matched_paper_id\":75241769},\"end\":47676,\"start\":47484},{\"attributes\":{\"id\":\"b3\"},\"end\":47762,\"start\":47678},{\"attributes\":{\"id\":\"b4\"},\"end\":47896,\"start\":47764},{\"attributes\":{\"id\":\"b5\"},\"end\":48050,\"start\":47898},{\"attributes\":{\"id\":\"b6\"},\"end\":48188,\"start\":48052},{\"attributes\":{\"id\":\"b7\"},\"end\":48531,\"start\":48190},{\"attributes\":{\"id\":\"b8\"},\"end\":48857,\"start\":48533}]", "bib_title": "[{\"end\":47304,\"start\":47259},{\"end\":47527,\"start\":47484}]", "bib_author": "[{\"end\":47206,\"start\":47195},{\"end\":47320,\"start\":47306},{\"end\":47543,\"start\":47529},{\"end\":47709,\"start\":47698},{\"end\":47804,\"start\":47794},{\"end\":47950,\"start\":47936},{\"end\":48111,\"start\":48097},{\"end\":48253,\"start\":48233},{\"end\":48259,\"start\":48253},{\"end\":48593,\"start\":48579}]", "bib_venue": "[{\"end\":47193,\"start\":47175},{\"end\":47348,\"start\":47320},{\"end\":47563,\"start\":47543},{\"end\":47696,\"start\":47678},{\"end\":47792,\"start\":47764},{\"end\":47934,\"start\":47898},{\"end\":48095,\"start\":48052},{\"end\":48231,\"start\":48190},{\"end\":48577,\"start\":48533}]"}}}, "year": 2023, "month": 12, "day": 17}