{"id": 231664305, "updated": "2022-09-30 02:51:55.12", "metadata": {"title": "Efficient Nonlinear Model Predictive Control for Quadrotor Trajectory Tracking: Algorithms and Experiment", "authors": "[{\"first\":\"Dong\",\"last\":\"Wang\",\"middle\":[]},{\"first\":\"Quan\",\"last\":\"Pan\",\"middle\":[]},{\"first\":\"Yang\",\"last\":\"Shi\",\"middle\":[]},{\"first\":\"Jinwen\",\"last\":\"Hu\",\"middle\":[]},{\"first\":\"Chunhui\",\"last\":\"records\",\"middle\":[\"Zhao\"]}]", "venue": "IEEE Transactions on Cybernetics", "journal": "IEEE Transactions on Cybernetics", "publication_date": {"year": 2021, "month": null, "day": null}, "abstract": "This article studies an efficient nonlinear model-predictive control (NMPC) scheme for trajectory tracking control of a quadrotor unmanned aerial vehicle (UAV). By augmenting the desired trajectory to a reference dynamical system, we can make the tracking task fit into the standard NMPC framework. In order to alleviate the heavy computational burden caused by solving the corresponding NMPC optimization problem online, we develop an improved continuation/generalized minimal residual (<inline-formula> <tex-math notation=\"LaTeX\">${i}\\text{C}$ </tex-math></inline-formula>/GMRES) algorithm. Compared with the standard C/GMRES method, the inequality constraint is relaxed by imposing the penalty term on the cost function. To guarantee the closed-loop system stability, we introduce a contraction constraint. Based on the proposed numerical algorithm and the stability constraint, we develop a novel efficient-NMPC algorithm to achieve acceptable control performance with reduced computational complexity. The numerical convergence of <inline-formula> <tex-math notation=\"LaTeX\">${i}\\text{C}$ </tex-math></inline-formula>/GMRES solutions and the closed-loop stability of efficient-NMPC are theoretically analyzed in the presence of the input constraint. Finally, the numerical simulations, software-in-the-loop (SIL) simulations, and the real-time experiment are given to demonstrate the effectiveness of the proposed <inline-formula> <tex-math notation=\"LaTeX\">${i}\\text{C}$ </tex-math></inline-formula>/GMRES algorithm and efficient-NMPC scheme.", "fields_of_study": "[\"Medicine\"]", "external_ids": {"arxiv": null, "mag": null, "acl": null, "pubmed": "33471775", "pubmedcentral": null, "dblp": "journals/tcyb/WangPSHZ21", "doi": "10.1109/tcyb.2020.3043361"}}, "content": {"source": {"pdf_hash": "50fd5f08b576185fe04ed1855e54b5db0aa1be2b", "pdf_src": "IEEE", "pdf_uri": null, "oa_url_match": false, "oa_info": null}, "grobid": {"id": "1f65707520b977a194c6bd8e8508e5105f3221af", "type": "plain-text", "url": "s3://ai2-s2-pdf-extraction-prod/parse-results/s2orc_worker/50fd5f08b576185fe04ed1855e54b5db0aa1be2b.txt", "contents": "\nEfficient Nonlinear Model Predictive Control for Quadrotor Trajectory Tracking: Algorithms and Experiment\nOCTOBER 2021\n\nGraduate Student Member, IEEEDong Wang \nMember, IEEEQuan Pan \nFellow, IEEEYang Shi \nMember, IEEEJinwen Hu \nMember, IEEEChunhui Zhao \nEfficient Nonlinear Model Predictive Control for Quadrotor Trajectory Tracking: Algorithms and Experiment\n\nIEEE TRANSACTIONS ON CYBERNETICS\n51105057OCTOBER 202110.1109/TCYB.2020.3043361Index Terms-C/GMRESinput constraintsnonlinear model predictive control (NMPC)real-time implementationtrajectory tracking\nThis article studies an efficient nonlinear modelpredictive control (NMPC) scheme for trajectory tracking control of a quadrotor unmanned aerial vehicle (UAV). By augmenting the desired trajectory to a reference dynamical system, we can make the tracking task fit into the standard NMPC framework. In order to alleviate the heavy computational burden caused by solving the corresponding NMPC optimization problem online, we develop an improved continuation/generalized minimal residual (iC/GMRES) algorithm. Compared with the standard C/GMRES method, the inequality constraint is relaxed by imposing the penalty term on the cost function. To guarantee the closed-loop system stability, we introduce a contraction constraint. Based on the proposed numerical algorithm and the stability constraint, we develop a novel efficient-NMPC algorithm to achieve acceptable control performance with reduced computational complexity. The numerical convergence of iC/GMRES solutions and the closed-loop stability of efficient-NMPC are theoretically analyzed in the presence of the input constraint. Finally, the numerical simulations, software-in-the-loop (SIL) simulations, and the real-time experiment are given to demonstrate the effectiveness of the proposed iC/GMRES algorithm and efficient-NMPC scheme.\n\ntracking control, one of the most critical problems, has received growing interest. In addition, many ready-to-fly autonomous UAV platforms, such as DJI and Parrot, appear on the market and become preferable in these applications [3], [4]. These autonomous platforms have autopilots, such as PX4 or Pixhawk, to maintain the stable and reliable flight. For the trajectory tracking control of these UAVs, users only need to design a trajectory tracking controller that accesses position and velocity data from sensors for translational motion. In addition to the traditional control methods, such as backstepping control (BC) [5] and sliding-mode control [6], the optimal control methods, such as H ∞ control [7] and optimized BC technique [8], turn out to be successful in various applications. Nevertheless, the development of a feasible and stable tracking controller for such quadrotor systems up to today is still a challenging task due to the integrated physical constraints, system nonlinearities, computational complexity, and external disturbances.\n\nA common issue of the aforementioned control strategies is being unable to efficiently handle system constraints that ubiquitously exist in practical applications, such as the allowed maximum magnitude of control signals and online computational time constraints. The input saturation is often handled by using the nested saturation method [9] or the anti-windup scheme [10]. But these treatments may cause defective control performance. Instead, an efficient alternative is to use the nonlinear model predictive control (NMPC) scheme because of its capability of systematically handling constraints [11]. Its flexibility in problem formulation allows NMPC to tackle the dynamic nonlinearity in the UAV model. These salient characteristics make NMPC a promising choice for UAV motion control problems in the presence of input constraints. In [12], the MPC motion controller is developed based on the linearized quadrotor model to solve the waypoint tracking problem efficiently. Similarly, MPC is applied to flocking control of quadrotors with the collision avoidance constraint considered in [13]. In [14], the NMPC scheme for stabilizing the translational dynamics of a quadrotor with input constraint satisfaction is proposed, where the optimization problem is solved by using the interior-point (IP) method [15].\n\nWhile NMPC provides the benefits of fully incorporating physical limits, the accompanying computationally extensive online calculation of solving a finite-horizon open-loop optimal control problem (OCP) in the receding horizon fashion becomes its bottleneck in real-time applications, especially for the resource-constrained embedded systems with fast sampling frequency, such as quadrotor UAVs. The reinforcement learning strategy [8] and the heuristic algorithm [16] can be executed to solve the OCP. However, they are computationally expensive and, thus, they are not suitable for UAV flight control in which the sampling period is required to be smaller than a second. At each sampling instant, the NMPC controller must provide an optimal control action within the strict time constraint, where the computational time constraint cannot be neglected. The time constraint violation directly hinders the real-time implementation of NMPC in mechatronics and robotics applications [17]. That is essentially the reason why some NMPC algorithms are effective in theoretical studies, but may fail in real-time applications. Inspired by the application issues, we aim to develop efficient numerical algorithms to facilitate the real-time implementation of NMPC.\n\nThe computationally efficient algorithms for the numerical solution of NMPC have been reviewed in [18]. Compared with the traditional methods, the continuation/generalized minimal residual (C/GMRES) algorithm does not rely on a large number of iterations that are needed in direct optimization approaches to solve the optimization problem. Therefore, it is a computationally efficient alternative for fast computation of NMPC [19]. However, the standard C/GMRES cannot be directly used in the trajectory tracking control problem because it cannot handle the inequality constraints. In [20], a tutorial on C/GMRES and its applications in the NMPC-based motion control of mobile platforms is introduced. The control input constraint is treated by using the auxiliary variable method. Yet, this treatment is sensitive to the weighting factor, which may lead to unstable parameterization. Huang et al. [21] proposed different strategies for handling the inequality constraint. However, they do not consider the initial value selection of the control input sequence in the initialization. For the C/GMRES method, a fast numerical convergence can be obtained in the neighborhood of the optimal solution. Therefore, improper settings of initial values affect numerical convergence. In [22], a modified C/GMRES (mC/GMRES) overcomes these issues by virtue of the logarithm-based barrier function. But, in this modification, the inequality constraint is transformed to a soft constraint such that the input constraint is probably violated. For a violated constraint, the logarithm function is undefined for nonpositive real numbers, which leads to an infeasible problem. In addition, the C/GMRES framework suffers from the drawback that the terminal state constraints are not included in the problem formulation and, thus, the computed NMPC control actions have no stability guarantee [18]. In order to handle the aforementioned issues, we aim to improve the C/GMRES algorithm and propose a novel efficient-NMPC scheme. The main contributions of this article are summarized as follows.\n\n1) Considering the input constraint and computational time constraint in practical quadrotor systems, a novel efficient-NMPC scheme is proposed to reduce the computational complexity of solving the OCP while achieving acceptable tracking performance for the trajectory tracking control problem. 2) Compared to mC/GMRES in [22], an improved C/GMRES (iC/GMRES) algorithm is developed for the fast computation of NMPC; specifically, the inequality constraint is tackled by imposing the penalty term on the cost function. By incorporating a successively increased weighting factor of the penalty term, the new OCP is solved to approximately obtain the inequalityconstrained optimum, and its numerical convergence is analyzed. 3) For the quadrotor system, we introduce a contraction constraint in the proposed efficient-NMPC-based trajectory control scheme to guarantee the closed-loop stability. Extensive simulation studies and the practical experiment confirm the improved performance of the proposed iC/GMRES and efficient-NMPC in terms of convergence and robustness. The remainder of this article is organized as follows. Section II introduces the NMPC formulation for quadrotor UAV trajectory tracking control. In Section III, the proposed iC/GMRES numerical algorithm and efficient-NMPC algorithm are detailed. Section IV presents the convergence analysis. In Section V, extensive simulations and the real-time experiment are carried out. The conclusive remarks and future work are provided in Section VI.\n\nNotations: The absolute value, the Euclidean norm, and the infinity norm are denoted by | · |, || · ||, and || · || ∞ , respectively. ||x|| 2 P is the weighted norm x Px, where P is a positive-definite matrix.η andη are the first-order and second-order time derivatives of η, respectively. The column operation [x 1 , . . . , x n ] is abbreviated as col(x 1 , . . . , x n ), and the diagonal operation is written as diag(·). The superscript \" \" represents the transposition, and max{·} is the maximum elements of an array. The internal variables in the NMPC controller are denoted by a hat (x,û) to indicate the predicted values.\n\n\nII. NMPC TRACKING CONTROL\n\nIn this article, we consider the motion of a Parrot commercial autonomous quadrotor UAV in a horizontal plane. A quadrotor UAV is usually modeled by using the Lagrange-Euler equations [7], [23] as follows:\nmς = R(ξ )T p − G g (1a) M(ξ )ξ + C ξ ,ξ ξ = τ ξ (1b)\nwhere G g = [0, 0, mg] , g is the gravity acceleration, m is the quadrotor mass, ς = [x, y, z] is the position, ξ = [φ, θ, ψ] is the vector of Euler angles, φ is the roll angle, θ is the pitch angle, and ψ is the yaw angle. T p is the total thrust, and τ ξ is the control torque generated by differences in the motor speeds. R(ξ ) is the rotation matrix. M(ξ ) acts as the inertia matrix and C(ξ ,ξ ) is the Coriolis matrix [24]. For underactuated UAVs, the flight system is decomposed into two interconnected subsystems (i.e., position and attitude subsystem), resulting in an inner-outer control loop structure [25]. For some commercial quadrotors such as the Parrot quadrotors, they are typically operated around their static equilibrium, that is, the stationary hovering attitude, because of the autopilots for attitude stabilization. The attitude is thus only defined by the heading, with respect to the yaw angle ψ, assuming that the pitch θ and roll φ angles are small, that is\nR(ξ ) ≈ R(ψ) = ⎡ ⎣ cos ψ − sin ψ 0 sin ψ cos ψ 0 0 0 1 ⎤ ⎦ .(2)\nSuch autopilot-aided quadrotors, therefore, are fully actuated in the control system design for position control, where the direct control on the velocities in the body-fixed frame is feasible. The kinematic model, which relates linear and angular velocities v b = [u, v, r] in the body-fixed frame with those in the inertial frameη = [ẋ,ẏ,ψ] , is written as [4] \nη = R(ψ)v b .(3)\nDuring the flight, the quadrotor UAV cannot instantly reach the reference velocities. In order to approximate this response behavior and reduce the complexity of the nonlinear model for facilitating control system design, the relationship between the velocity responses v b and the control commands u = [u x , u y , u ψ ] is approximated by the following first-order dynamics [26]:\nv b = Sv b + Gu (4) where S = diag([a s , b s , c s ]) and G = diag([a g , b g , c g ]) are\nthe model parameters that can be obtained by parameter identification [27]. Based on these considerations, we establish the following dynamic model for the quadrotor UAV trajectory tracking:\nx = η v b = R(ψ)v b Sv b + Gu = f(x, u).(5)\nLet p(t) = [x r (t), y r (t)] denote the desired trajectory. Then, we construct the reference augmentation:\nx r (t) = col(η r (t), v br (t)) with η r (t) = [x r (t), y r (t), ψ r (t)] v br (t) = [u r (t), v r (t), r r (t)](6)\nwhere\nψ r (t) = atan2{ẏ r (t),ẋ r (t)}, u r (t) = ẋ 2 r (t) +ẏ 2 r (t) v r (t) = 0, r r (t) =ẋ r (t)ÿ r (t) −ẍ r (t)ẏ r (t) x 2 r (t) +ẏ 2 r (t) atan2{·}\nis the four-quadrant inverse tangent function.\n\nObviously, x r (t) fulfills the kinematic property of the UAV motion, that is,η r = R(ψ r )v br . Therefore, each state of this model has a unique reference such that the singularity can be avoided.\n\nBased on the generated reference system, a finite-horizon NMPC problem (P 0 (x)) for the quadrotor UAV trajectory tracking control at time t is formulated as follows:\nP 0 (x) : min u(·) J = t+T t ||x(s)|| 2 Q + ||û(s)|| 2 R ds +||x(t + T)|| 2 P (7a) s.t.ẋ(s) = f x(s),û(s) , s ∈ [t, t + T) (7b) x(t) = x(t) (7c) ||û(s)|| ∞ ≤ u max , s ∈ [t, t + T) (7d)\nwherex(s) =x(s) − x r (s) is the predicted tracking error and u max is the maximum amplitude of the control inputs. T is the prediction horizon. Q, R, and P are the positive-definite weighting matrices.\n\nNote that the C/GMRES method is implemented using a discrete-time formulation but its dependence on t is still continuous [19]. In other words, the discretized problem is solved at each continuous time t under the assumption that the discretization is stable with sufficient accuracy. The prediction horizon is divided into N steps. The step size δ is decided by δ = T/N, which is interpreted as the sampling period. Therefore, for (P 0 (x)), the discretized version (P 1 (x)) is established as follows:\nP 1 (x) min u i J = N−1 i=0 (||x i || 2 Q + ||û i || 2 R )δ + ||x N || 2 P (8a) s.t.x i+1 =x i + f (x i ,û i )δ (8b) x 0 = x(t) (8c) c in (x i ,û i ) ≤ 0 (8d) wherex i =x i − x r . c in (x i ,û i ) ≤ 0 stands for the vector-valued inequality constraint. The UAV system model is discretized and denoted by x i+1 = x i +f (x i , u i )δ with x i = x(iδ) and u i = u(iδ).\nWe simplify the notation of (P 1 (x)) as the following optimization (P 1 ):\nP 1 : min U J(U) s.t. c in (U) ≤ 0(9)\nwhere U = col(û 0 ,û 1 , . . . ,û N−1 ). Given the initial statex 0 = x(t) at each time instant t, an optimal control sequence U * is obtained by solving (P 1 ). The control action to be applied to the UAV system is given by u(t) = (U * ), where (U * ) is to abstract the first element of the input sequence U * . Generally, the Karush-Kuhn-Tucker (KKT) conditions provide the first-order necessary conditions for a solution U * of (P 1 ) to be optimal. (P 1 ) is actually to solve the KKT conditions using Newton-based numerical algorithms, such as sequential quadratic programming (SQP) [28]. However, this method generally relies on successive linearizations, which results in the heavy computational burden. To improve the computational efficiency, we utilize the C/GMRES numerical algorithm to accelerate the computation of NMPC numerically. Note that the standard C/GMRES method can solve (P 1 (x)) only with the equality constraints. In the following, we will relax this limitation and propose an improved strategy to compute the optimal solution of the inequality-constrained OCP in the C/GMRES framework.\n\n\nIII. EFFICIENT-NMPC ALGORITHM\n\nIn this section, we first relax the inequality constraint in (P 1 (x)). Then, we propose the iC/GMRES numerical algorithm to solve the new NMPC optimization problem. Finally, we present the efficient-NMPC algorithm for the real-time trajectory tracking control with guaranteed stability.\n\n\nA. Inequality Constraint Relaxation\n\nIn order to address the limitation on the inequality constraint c in (x i ,û i ) ≤ 0, we introduce a penalty on the constraint violation in the cost function for the approximate treatment of this inequality constraint. The penalty term on the inequality constraint is defined as the following switching behavior of the inequality constraint:\nζ(c j (x i ,û i )) = 1, for c j (x i ,û i ) > 0 0, for c j (x i ,û i ) ≤ 0 (10) where the jth row of c in (·, ·) is c j (x i ,û i ), j = 1, 2, . . . , n,\nn is the dimension of the vector-valued inequality constraint. However, the lack of continuous differentiability at c j (x i ,û i ) = 0 results in the nondifferentiability. This problem can be tackled by relaxing (10) via the following function approximation:\nζ(c j (x i ,û i )) ≈ sig(c j (·, ·), κ a ) = 1 1 + e −c j (x i ,û i )κ a(11)\nwhere sig(·, ·) is the sigmoid function and κ a determines the sharpness of the switching behavior. Note that the sigmoid function can approximate (10) with a large enough κ a . Then, a new OCP (P 2 (x)) with the penalty term imposed on the cost function is formulated as follows:\nP 2 (x) : min u iJ = N−1 i=0 (||x i || 2 Q + ||û i || 2 R + ε · χ(x i ,û i ))δ + ||x N || 2 P (12a) s.t.x i+1 =x i + f (x i ,û i )δ (12b) x 0 = x(t) (12c) where χ(x i ,û i ) = n j=1 ζ(c j (x i ,û i ))\n. We also simplify the notation of (P 2 (x)) as the follow optimization (P 2 ):\nP 2 : min UJ (Ū, ε) := J(Ū) + ε · χ(Ū)δ(13)\nwhereŪ = col(û 0 ,û 1 , . . . ,û N−1 ) is the input sequence of (12). Note that ε · χ(x i ,û i ) in (12a) is the penalty term accounting for unboundedness of the control inputû i if the upper constraint of (8d) is touched. The effect of this term with different values of the parameter ε on the numerical convergence properties will be explained in Section IV-A. Remark 1: This inequality constraint relaxation is referred to as the soft constraint and leads to a tradeoff between constraint compliance and other goals in the cost function. In contrast to [22], the proposed treatment to the inequality constraint in this article obviates the consideration that the inequality constraint requirements are never violated during operation due to the simple logarithmic function. The new OCP can be solved successfully even when an inequality constraint would be slightly violated. This makes it particularly well suited in the robotic applications with state constraints. Moreover, in contrast to [20], it obviates the need of additional optimization variables such that this treatment maintains the problem dimension and computational effort at a relatively low level.\n\n\nB. iC/GMRES Numerical Algorithm\n\nFor (P 2 (x)), the Hamiltonian function H is defined as\nH(x, u, λ) = ||x − x r || 2 Q + ||u|| 2 R + ε · χ(x, u) + λ f (x, u)\nwhere λ is the costate. The discretized Pontryagin's maximum principle (PMP) claims that for an optimal control sequence {û * i } N−1 i=0 of (12), the costate sequence {λ i } N i=1 satisfies (12b), (12c) and the following conditions:\nλ N = ∂||x N || 2 P ∂x (14a) λ i = λ i+1 + H x (x i ,û * i , λ i+1 , ε)δ (14b) H u (x i ,û * i , λ i+1 , ε) = 0 (14c)\nwhere H x and H u denote the Jacobian of H with respect to x and u, respectively. Due to the boundary conditions (12c) and (14a), these necessary optimality conditions form the twopoint boundary value problem (TPBVP) [28]. In order to solve this problem, the state and costate are calculated inside the prediction time horizon\n[0, T], recursively, with {û * i } N−1 i=0\nbeing determined by (14c). The state forwards with prediction time using (12b), starting from (12c). Similarly, the costate backwards with prediction time using (14b) from (14a). We substitute the state sequence {x i } N−1 i=0 and the costate sequence\n{λ i } N i=1 into (14c)\nto obtain the following equation:\nF(Ū * , x(t), ε) = ⎡ ⎢ ⎢ ⎢ ⎣ H u (x 0 ,û * 0 , λ 1 , ε) H u (x 1 ,û * 1 , λ 2 , ε) . . . H u (x N−1 ,û * N−1 , λ N , ε) ⎤ ⎥ ⎥ ⎥ ⎦ = 0. (15)\nIn order to solve (15) at time instant t, we utilize numerical continuation method and forward-difference generalized minimal residual (FDGMRES) method. The detailed algorithm descriptions are presented in [19] and [22], which averts evaluating Jacobians, Hessian, and inverses. For simplification, in this article, it is denoted as the function called FDGMREṠ\nU = FDGMRES(Ū, x(t),ẋ(t), t,Ũ, k max , ε)(16)\nwhere k max is the preset maximum iteration number.Ũ is a initial guess.ẋ(t) is approximated by (x(t) − x(t − δ))/δ. Note that during the initialization, the PMP conditions are solved once in the standard C/GMRES method to obtain a feasible initial control input sequenceŪ such that ||F(Ū, x(t 0 ), 0)|| ≤ γ for some positive γ analytically or numerically [19]. Note that numerical methods based on the solution of TPBVP provide a fast numerical convergence in the neighbor of the optimal solution and deliver highly accurate solutions. It is necessary to find a good initial guess of U, especially for constrained cases. To this end, we solve F(Ū, x(t 0 ), ε) = 0 successively with increased values of ε. In this process, the previous solutions are used as the initial values. In this way, for ε → +∞, we intuitively expect that the costJ(Ū, ε) in (13) converges to the optimal value J * in (9) and that the solutionŪ converges to the constrained optimum U * . Consequently, we can approximately solve (P 1 (x)) efficiently by applying iC/GMRES to solving (P 2 (x)). This conclusion will be elaborated in Section IV-A. The iC/GMRES algorithm for solving (P 2 (x)) is summarized in Algorithm 1.\n\nAlgorithm 1: iC/GMRES Algorithm for (P 2 (x)) Input: d = 0, ε 0 , δ, x(t), x, k max ,Ũ −1 : = 0, incremental coefficient ρ, iteration number d max ; Output:Ū * ;\nInitialization: Find ||F(Ū d , x(t), ε 0 )|| ≤ γ for some positive γ numerically; d = d + 1; while d ≤ d max do ε d = ρε d−1 , findŪ d such that F(Ū d , x(t), ε d ) = 0 numerically with initial guessŨ d =U d−1 ; d = d + 1; end Computation: ε = ε d ; U = FDGMRES(Ū d , x, x/δ, t,U d , k max , ε); U * =Ū d +U · δ.\n\nC. Efficient-NMPC\n\nIn the previous section, we mainly focus on the computational efficiency of solving the NMPC problem, without considering the closed-loop stability explicitly under the NMPC control method. Yet, the optimality of its solution cannot guarantee the closed-loop stability under the finite-horizon NMPC formulation (P 0 (x)). To guarantee this key property theoretically, we impose a stability constraint on the new NMPC optimization problem (P 3 (x)) [29] \nP 3 (x): min u(·) J = t+T t ||x(s)|| 2 Q + ||û(s)|| 2 R ds + ||x(t + T)|| 2 P (17a) s.t.ẋ(s) = f(x(s),û(s)), s ∈ [t, t + T) (17b) x(t) = x(t) (17c) ||û(s)|| ∞ ≤ u max , s ∈ [t, t + T) (17d) ∂V ∂x f(x(t),û(t)) ≤ ∂V ∂x f(x(t), h(x(t)))(17e)\nwhere V(·) is a Lyapunov function and h(·) is an auxiliary Lyapunov-based control law. The details of the stability constraint (17e) will be discussed in Section IV-B. Since only the first element of the optimal control sequence U * is sent to the UAV, we only consider the stability constraint in the first prediction time [t, t + δ].\n\nIt can be seen that the efficient-NMPC scheme based on (P 3 (x)) inherits the stability property of the auxiliary control law, which provides the flexibility of specifying the prediction horizon without destabilizing the tracking control. In other words, the prediction horizon can be adjusted properly in order to reduce the size of the NMPC optimization for the real-time control if the control algorithm is running on the low-cost onboard processor [30]. By virtue of the feedback of the computer processing time t p for each iteration in real time, this adjustment is integrated into Algorithm 2. The proposed efficient-NMPC algorithm based on (P 3 (x)) is briefly Algorithm 2: Efficient-NMPC Algorithm for (P 3 (x)) Initialization: Set simulation time t sim , initial state x(t 0 ), k = 0, t 0 = 0, x = 0, ω, N, N ; Discretize (P 3 (x)) to obtain (P 1 (x)); Transform (P 1 (x)) into (P 2 (x)); Solve (P 2 (x)) with initial state x(0) by Algorithm 1 to generateŪ * 0 at t = t 0 ; Apply the computed control action u(t) = (Ū *\n0 ); k = k + 1, t = kδ; for t ≤ t sim do\nRecord the value of t p . If t p > δ then set N = N − N; else if t p < ωδ then set N = N + N; else N = N; Sample the system state x(t); Compute the state difference x = x(kδ) − x((k − 1)δ); Solve (P 2 (x)) by using Algorithm 1 with the updated N to generateŪ * k ; Apply the computed control action u(t) = (Ū * k ); k = k + 1, t = kδ; end described in Algorithm 2, where N is the prediction horizon increment (or decrement), ω ∈ (0, 1) is the well-tuned weighting coefficient, t p is the computational time of each iteration. Obviously, it allows for specifying the prediction horizon without destabilizing the closed-loop system. In other words, it essentially improves the control performance and further reduces the computational complexity. Therefore, it is promising for low-cost processors to perform the proposed efficient-NMPC. The schematic illustration of the efficient-NMPC algorithm for the UAV trajectory tracking is shown in Fig. 1.\n\n\nIV. CONVERGENCE ANALYSIS\n\nIn this section, we first investigate the convergence property of the new OCP (P 2 (x)) under Algorithm 1. Then, we prove that the convergence of UAV trajectory is guaranteed under Algorithm 2.\n\n\nA. Numerical Convergence Analysis\n\nNote that iC/GMRES is utilized to compute the solution of (P 1 (x)) approximately. In the context of practical applications, although there is no practical obstruction to applying it to problems that cannot be guaranteed to possess a global optimum, we make the following reasonable assumptions in order to simplify the exposition in the convergence analysis.\n\nAssumption 1: The problem (P 1 ) has a unique optimal solution U * with the optimal cost J(U * ) = J * . Assumption 2: [31] The problem (P 2 ) has a bounded solu-tionŪ d for each ε = ε d > 0.\n\nConsidering that iC/GMRES is based on solving the necessary optimality conditions of PMP for the optimal solution to (P 2 (x)) rather than KKT conditions, the sufficiency of PMP to solve the KKT conditions is first explored as follows.\n\nLemma 1: [22] A point that satisfies the PMP conditions of (P 1 (x)) sufficiently solves its KKT conditions. LetŪ d denote the solution to (P 2 ) when ε = ε d , where ε d > 0 is the dth term of the sequence {ε d }. Then, the cost function (13) can be represented as\nJ(Ū d , ε d ) = J(Ū d ) + ε d · χ(Ū d )δ.(18)\nSince (P 2 (x)) has to be successively solved with the increasing ε during the initialization in Algorithm 1, the growth of its cost and the convergence of its optimal solution to the constrained optimum are discussed in the following lemmas.\n\nLemma 2: Suppose that Assumption 2 holds. LetŪ d and U d+1 be the optimal solutions to (P 2 ) for 0 < ε d < ε d+1 .\n\nThen, the following inequalities hold for the cost function (18):\nJ(Ū d+1 , ε d+1 ) ≥J(Ū d , ε d ) J(Ū d+1 ) ≥ J(Ū d ), χ (Ū d ) ≥ χ(Ū d+1 ).\nProof: As a candidate solution to (P 2 ), together with ε d < ε d+1 ,Ū d+1 corresponds to the cost functionJ(Ū d , ε d ) in (18) satisfyinḡ\nJ(Ū d+1 , ε d+1 ) ≥ J(Ū d+1 ) + ε d · χ(Ū d+1 )δ =J(Ū d+1 , ε d ) (20a) J(Ū d+1 , ε d+1 ) ≤J(Ū d , ε d+1 ). (20b) LikewiseJ (Ū d , ε d ) ≤J(Ū d+1 , ε d ).(21)\nEquations (20a) and (21) implȳ\nJ(Ū d+1 , ε d+1 ) ≥J(Ū d , ε d ).(22)\nSubstituting (18) into (20b) and (21), we imply\nε d+1 (χ (Ū d ) − χ(Ū d+1 ))δ ≥ J(Ū d+1 ) − J(Ū d ) (23) J(Ū d+1 ) − J(Ū d ) ≥ ε d (χ (Ū d ) − χ(Ū d+1 ))δ.(24)\nCombining (23) and (24),\nwe have (ε d+1 − ε d )(χ (Ū d ) − χ(Ū d+1 )) ≥ 0. Therefore χ(Ū d ) ≥ χ(Ū d+1 )(25)\nholds for 0 < ε d < ε d+1 . Substituting (25) into (23) yields\nJ(Ū d+1 ) ≥ J(Ū d ),(26)\nwhich completes the proof. Lemma 3: Let {ε d } be an increasing sequence of the positive weighting factor, which satisfies 0 < ε d < ε d+1 and ε d → +∞ as d → +∞. Suppose that Assumptions 1 and 2 hold. Then,Ū d converges to U * as ε d → +∞.\n\nProof: According to Assumption 2 and Lemma 2, the sequences {J(Ū d )} and {J(Ū d , ε d )} are monotonically increasing and upper bounded. By the monotone convergence theorem, we claim that they converge with limits L andL, respectively. Thus, we have lim\nd→+∞J (Ū d , ε d ) − J(Ū d ) =L−L.\nSince ε d → +∞ as d → +∞, based on (18) we can imply\nlim d→+∞ χ(Ū d ) = lim d→+∞J (Ū d , ε d ) − J(Ū d ) δε d = 0. (27)\nIt can be seen that when ε d → +∞,Ū d belongs to the admissible set D of (P 1 ). Therefore, we have ∀ U ∈ D\nJ(Ū d ) =J(Ū d , ε d ) ≤J(U, ε d ) = J(U).(28)\nBased on (27) and (28), for ε d → +∞, we have J(Ū d ) = J * = J(U * ). Therefore, according to Assumption 1, we can conclude thatŪ d converges to U * as ε d → +∞.\n\nTheorem 1: Consider Lemmas 1 and 3. Suppose that Assumption 1 holds. Then, iC/GMRES approximately solves (P 1 (x)) with a sufficiently large ε in (P 2 (x)).\n\nProof: For (P 1 (x)), let c eq (x i ,û i ) = 0 be the equality constraints including the system (8b) and the initial condition (8c). It essentially confines the state trajectory instead of the decision variable u. c in (x i ,û i ) ≤ 0, including the input constraint and stability constraint confines the decision variable u. Hence, the gradient ∇c in (·, ·) and ∇c eq (·, ·) are linearly independent, which satisfies the linear independence constraint qualification [32,Sec. 5.5]. This qualification ensures that the optimal solution U * satisfies the KKT conditions. According to Lemmas 1 and 3, PMP points in (P 2 (x)) satisfy the KKT conditions in (P 1 (x)) when ε → +∞. Therefore, (P 1 (x)) can be solved by iC/GMRES with the sufficiently large ε to approximately obtain the optimal solution U * .\n\n\nB. Trajectory Convergence Analysis\n\nDifferent from the traditional MPC, efficient-NMPC ensures the stability if the auxiliary control law h(x) is a feasible solution under the condition that ||h(x)|| ∞ ≤ u max can hold [33]. In principal, we can design h(x) by employing any Lyapunovbased control methods. Since the Lyapunov-based BC control method is extensively used in UAV systems, we construct h(x) by using the BC technique [5]. The Lyapunov candidate is chosen as\nV = 1 2 z 1 z 1 + 1 2 z z 2 2(29)\nwhere z 1 = η r −η is the position error, z 2 =η r −R(ψ)v b +α 1 z 1 is the velocity error. Then, we can infer the BC control law as follows:\nh(x) = −G −1 Sv b + G −1 R (ψ)μ(x) (30) where μ(x) =η r −Ṙ(ψ)v b + (α 1 + α 2 )z 2 + (1 − α 2 1 )z 1 (31)\nα 1 , α 2 > 0 are the BC controller parameters. Furthermore, based on (30) and the derivative of (29), we can accordingly obtain the following explicit expression of (17e): Gû(t)] ≤ 0. (32) Note that the stability of efficient-NMPC is guaranteed when ||h(x)|| ∞ ≤ u max . To this end, we are expecting to find a pair of feasible BC controller parameters.\nz 2 (t)[μ(x(t)) − R(ψ(t))(Sv b (t) +\nAssumption 3: The desired position trajectory p(t) and its derivatives are smooth and bounded, satisfying that:\n|x r (t)| ≤ x, |y r (t)| ≤ȳ, |ẋ r (t)| ≤x 1 , |ẏ r (t)| ≤ȳ 1 , |ẍ r (t)| ≤x 2 , |ÿ r (t)| ≤¯y 2 .\nLemma 4 [33]: The reference state η r (t) in (6) and its first and second derivativesη r (t),η r (t) are bounded, that is, ||η r (t)|| ∞ ≤η, ||η r (t)|| ∞ ≤η 1 , ||η r (t)|| ∞ ≤η 2 for some positive numbersη,η 1 andη 2 .\n\nRemark 2: For a continuous and smooth curve p(t), Assumption 3 is easy to be satisfied. Based on Assumption 3, the boundness with respect to the reference state can be proved.\n\nTheorem 2: Suppose that Assumption 3 holds.\nGivenḡ = ||G −1 || ∞ ,s = ||S|| ∞ , that is,ḡ = max{a −1 g , b −1 g , c −1 g },s = max{a s , b s , c s }.\nIf the following condition can be satisfied: √ 2 ·ḡ(s · l +η 2 + 2 √ 2 · l 2 + w) ≤ u max (33) where l =η 1 + ||z 2 (t 0 )|| 2 + α 1 ||z 1 (t 0 )|| 2 , w = (α 1 + α 2 )||z 2 (t 0 )|| 2 + (1 − α 2 1 )||z 1 (t 0 )|| 2 , t 0 is the initial time, then the efficient-NMPC scheme based on (17) always has an acceptable and feasible solution.\n\nProof: See the Appendix. Remark 3: Theorem 2 provides a guideline on appropriately selecting α 1 and α 2 , following (33), for ensuring ||h(x)|| ∞ ≤ u max . For the sake of facilitating the exploration of the possible optimal solution, it is desirable to make α 1 and α 2 as small as possible in order to maximize the allowable operating region. Although the small values of α 1 and α 2 result in slow convergence controlled by BC, the optimal control performance with respect to a certain performance index is guaranteed by using efficient-NMPC.\n\nNote that the stability constraint is imposed to ensure the closed-loop stability when the BC controller parameters satisfy (33). Then, the stability of the proposed efficient-NMPC can be proved by using Lyapunov's direct method.\n\nTheorem 3: Suppose that Assumptions 1-3 and the inequality (33) hold. Considering the auxiliary control law h(x) in (30) and Lemma 3, Algorithm 2 enforces asymptotic convergence to the desired trajectory.\n\nProof: For the Lyapunov candidate V(x) in (29), which is continuously differentiable and radically unbounded [34,Th. 4.2], there exist K ∞ functions β i (·), i = 1, 2, 3 that satisfy the following inequalities by the converse Lyapunov theorem [34, Th. 4.17]:\nβ 1 (||x||) ≤ V(x) ≤ β 2 (||x||) (34a) ∂V(x) ∂x f(x, h(x)) ≤ −β 3 (||x||). (34b)\nConsidering the stability constraint (17e) and that the control action u(t) = u * (s), s ∈ [t, t + δ] in (P 3 (x)) will be input for one sampling period at each time instant, together with (34b) V(x) in the closed-loop system under the efficient-NMPC control actions satisfies the following inequality:\n∂V(x) ∂x f(x, u) ≤ ∂V(x) ∂x f(x, h(x)) ≤ −β 3 (||x||).(35)\nBased on the standard Lyapunov arguments [34,Th. 4.9] and Lemma 3, we claim thatx = 0 is asymptotically stable for the closed-loop system associated with the efficient-NMPC law for ε d → +∞.\n\n\nV. STIMULATION AND EXPERIMENTAL STUDIES\n\nIn this section, we first validate the proposed iC/GMRES numerical algorithm via the numerical simulations. Then, we testify the real-time performance of the proposed efficient-NMPC algorithm via the software-in-the-loop (SIL) real-time simulations. Finally, the experimental validation demonstrates the efficacy of the proposed efficient-NMPC scheme.\n\n\nA. Desired Trajectories and Parameters Selection\n\nIn the simulations, the sampling period is δ = 0.1[s]. The sinusoidal trajectory p(t) = [0.1t, sin(0.1t)] (case I) and the lemniscate trajectory p(t) = [ sin(0.05t), sin(0.1t)] (case II) are chosen as the reference trajectories. Both of them are typical test trajectories with varying reference tangential and angular velocities for tracking control, which causes challenges in tracking tasks. The Parrot quadrotor model parameters used in the control system design are a s = b s = −0.5092, c s = 0, a g = b g = 1.458, and c g = 1.6. The backstepping controller parameters are selected as α 1 = 0.4 and α 2 = 0.4 according to Theorem 2. For the iC/GMRES algorithm, since the solu-tionU at the previous sampling time is often a good initial guess in the FDGMRES function, the small iteration number k max = 11 suffices to obtain an accurate solution. The successive computation number d max , the incremental coefficient ρ = 10 and the initial value ε 0 = 1 of the weighting factor ε are properly selected by trial and error. For the efficient-NMPC control algorithm, the weighting matrices R = diag([1, 1, 1]), P = Q = diag([1200, 1200, 1200, 10 3 , 10 3 , 10 3 ]), the coefficient ω = 0.4 and prediction increment N = 5 are selected properly to achieve the trajectory convergence.\n\nIn the outdoor experiment, we perform the trajectory tracking mission on a real Parrot quadrotor along the desired straight line trajectory p(t) = [0.1t, 0] to avoid the uncertainties caused by integrated sensor imperfections in the real platform. As discussed in UAV modeling of Section II, the efficient-NMPC-based control system in the simulation can be directly applied in the real platform.\n\n\nB. Simulation and Experimental Setup\n\nIn the numerical simulations, the proposed iC/GMRES is compared to SQP and mC/GMRES [22] in solving the NMPC optimization problems (P 1 (x)) derived from (P 0 (x)) with different prediction horizons. The numerical convergence and computational efficiency are assessed with the indexes of tracking error e x , e y , and e z and average computational time (ACT). In particular, in order to demonstrate the influence of different values of ε on the optimal solutions, we solve (P 2 (x)) with successively increased ε from ε 0 to ρ·d max during the initialization in iC/GMRES. The numerical convergence is demonstrated by the evolution ofU d 0 andŪ d 0 with respect to d max .\n\nIn the SIL real-time simulations, we implement the efficient-NMPC controller by using Simulink Real-Time Toolbox. In order to testify the effectiveness of the stability constraint, efficient-NMPC is compared to the standard NMPC that solves the optimization (P 1 (x)) derived from (P 0 (x)). Both NMPC problems are solved by iC/GMRES. The quadrotor model is running in the robot operating system (ROS) environment with the software development kit (SDK) of the Parrot quadrotor, where the uncertainties caused by integrated sensor imperfections in the real platform are not considered. We impose a 10% model parameter error and wind disturbances of magnitude 0.2[m/s] on this model. The communication between the Simulink-based controller and the quadrotor model is via the interprocess communication mechanism to form the closed-loop feedback, which increases the realism of the simulations.\n\nIn the real experiment, we directly implement the proposed controller to the real quadrotor. The SDK communicates with the real drone over WiFi. The trajectory tracking controller sends the reference velocity signals to the autopilot. The onboard GPS and IMU provide the longitude, latitude, heading, and velocity. Efficient-NMPC is compared with SQPbased NMPC for the same optimization problem (P 3 (x)). The real-time control performance is evaluated by the tracking error. A detailed schematic illustration of the control system in the SIL simulations and experiment is shown in Fig. 2. All the simulations and the real-time experiment are carried out on Ubuntu 16.04 with a 1.90-GHz Intel Core i7-8650U.\n\n\nC. iC/GMRES Solution and Computational Efficiency Evaluation\n\nThe position trajectories in case I and II are plotted in Fig. 3. The position trajectories solved by SQP are plotted    Table I, the iC/GMRES solutions not only demonstrate a better tracking performance, but also shorter computational time with the larger d max . This is because that iC/GMRES calculates the good initial value forŪ to the optimal value of (P 1 (x)) whileU d 0 is reduced to 0 gradually, which reveals a better numerical convergence compared  to the mC/GMRES numerical algorithm. When d max = 1, iC/GMRES is actually equivalent to the standard C/GMRES. The improper initial values for the control input sequence reduce the solution performance of this efficient numerical algorithm, which confirms the improvements in comparison to the original algorithm. From these comparison studies, it can be observed that the proposed iC/GMRES can improve the solution performance and computational efficacy in the fast computation of NMPC and satisfy the control requirements.\n\nIn both cases, all the NMPC tracking controllers successfully steer the quadrotor along the desired trajectories. The convergence of UAV trajectory is guaranteed by designing proper parameters T, P, Q, R,Ū 0 , κ a , d max , and ρ for the fixed types of desired trajectories. However, it should be noted that the optimality of the solution to (P 0 (x)) cannot guarantee the convergence of the states. Since Table I shows that the computational efficiency of iC/GMRES fulfills the control updating frequency requirement of 10[Hz], the time constraint of the efficient-NMPC-based control system can be respected. Next, we will analyze the effect of the stability constraint on the trajectory tracking in terms of tracking error and robustness in the SIL real-time simulation.\n\n\nD. Stability and Robustness Test in SIL Simulation\n\nThe simulation results are shown in Figs Fig. 7 reveals that the closed-loop system controlled by NMPC becomes unstable if the prediction horizon is set improperly, for example, T = 2δ[s]. In contrast, efficient-NMPC demonstrates the better closed-loop performance, which highlights the advantage of the stability constraint. For the prespecified trajectory tracking, we can always design a set of proper parameters by trial and error to achieve the trajectory convergence. Nevertheless, for fully autonomous flight projects that involve arbitrary trajectory tracking, it is necessary to consider this stability constraint. Figs. 9 and 10 show the trajectories of tracking errors and control inputs. It can be seen that the control signals ensure that the tracking errors are bounded while fulfilling the prescribed control input constraints. From Fig. 9, we can see that the proposed efficient-NMPC outperforms NMPC under the same prediction horizon (N = 2) in terms of closed-loop convergence and robustness, which presents the advantages of the stability constraint. As the prediction horizon increases, the NMPC controller steers the UAV to move more aggressively than BC for the sake   of fast trajectory convergence, which reveals its advantage compared to BC with the specific control gain. Moreover, efficient-NMPC guarantees the optimal control performance in the presence of the input constraint while BC has the degraded control performance with small values of the BC controller parameters.\n\n\nE. Real-Time Performance in the Experimental Test\n\nIn the experiment, we maintain the control updating frequency at 10[Hz]. The controllers run 900 iterations, that is, t sim = 90[s]. The experimental results are illustrated: the position in the x-axis is shown in Fig. 11; the velocity and the control input are demonstrated in Fig. 12. It is observed that the flight velocity u is maintained around 0.1[m/s] by the BC and efficient-NMPC controllers. Accordingly, they can steer the quadrotor to fly about 9 [m] along the x-axis direction. However, NMPC with stability constraint solved by SQP fails to guide the quadrotor along the desired trajectory in the real flight although the numerical simulations validate its promising tracking performance in Fig. 3. The time constraint violation results in the unstable flight velocity control as shown in Fig. 12. Furthermore, according to Fig. 11, it is confirmed from the experimental test that efficient-NMPC outperforms BC in terms of tracking performance.\n\n\nVI. CONCLUSION\n\nIn this article, for the trajectory tracking control of a commercial quadrotor UAV, we have presented an iC/GMRESbased efficient-NMPC scheme in the presence of the input constraint and computational time constraint. The iC/GMRES numerical algorithm is employed to solve the constrained NMPC efficiently. By taking advantage of BC as the auxiliary controller for the construction of stability constraint, the closed-loop stability is guaranteed. The computational complexity is significantly reduced while the tracking performance is maintained. The simulation and experimental results underpin that the proposed efficient-NMPC scheme can effectively and successfully be applied to the real quadrotor UAV system.\n\nIt is worthwhile to point out that MPC does require the plant model to be precisely known, whereas the model is generally inaccurate or even unavailable in applications. Therefore, our future research will be focusing on the development of fast adaptive and learning MPC and fast data-driven MPC. Zhang and Shi [35] proposed an adaptive robust MPC framework that can update the unknown model parameters online; yet, its fast implementation in applications deserves further research. Wang and Liu [36], for the first time, established the criteria of the controllability and the observability of linear discrete-time systems via two data-based methods, which present a promising approach of developing data-driven MPC.\n\n\nAPPENDIX PROOF OF THEOREM 2\n\nBy taking infinity norm on the both sides of (30), we obtain the following inequality:\n\n||h(x)|| ∞ ≤ ||G −1 || ∞ ||S|| ∞ ||v b || ∞ + ||G −1 || ∞ ||R (ψ)|| ∞ ||μ|| ∞ .\n\nAccording to (2), it implies that ||R (ψ)|| ∞ = max{| sin(ψ)| + | cos(ψ)|, 1} ≤ √ 2.\n\nSimilarly, the following inequality holds for (31): \n||μ||||v b || ∞ = ||R (ψ)η|| ∞ ≤ √ 2||η|| ∞ .(39)\nIt follows z 1 = η r − η andż 1 = z 2 − α 1 z 1 that: ||η|| ∞ = ||η d −ż 1 || ≤η 1 + ||ż 1 || ∞ ≤η 1 + ||z 2 || ∞ + α 1 ||z 1 || ∞ .\n\nSinceV ≤ 0, ||z 1 (t)|| ∞ ≤ ||z 1 (t)|| 2 ≤ ||z 1 (t 0 )|| 2 and ||z 2 (t)|| ∞ ≤ ||z 2 (t)|| 2 ≤ ||z 2 (t 0 )|| 2 (generally t 0 = 0). Therefore, according to (38), we can obtain\n||μ|| ∞ ≤η 2 + 2 √ 2 · l 2 + w(41)\nwhere l =η 1 + ||z 2 (t 0 )|| 2 + α 1 ||z 1 (t 0 )|| 2 , w = (α 1 + α 2 )||z 2 (t 0 )|| 2 + (1 − α 2 1 )||z 1 (t 0 )|| 2 . Substituting (37), (39), and (41) into (36), we have ||h(x)|| ∞ ≤ √ 2 ·f (s · l +η 2 + 2 √ 2 · l 2 + w). (42) Obviously, if (33) is satisfied, ||h(x)|| ∞ ≤ u max is always satisfied all the time such that the efficient-NMPC scheme based on (17) has an acceptable and feasible solution that satisfies the constraints (17d) and (17e). This completes the proof.\n\nFig. 1 .\n1Efficient-NMPC-based control system diagram.\n\nFig. 2 .\n2Efficient-NMPC-based control system for the SIL simulations and the real-time experiment.\n\nFig. 3 .\n3Position trajectories with different numerical algorithms and different parameters. (a) Case I. (b) Case II.\n\nFig. 4 .\n4Trajectories of (a) optimal solution and (b) tracking error from t = 0[s] to t = 3.4[s] (Case I).\n\nFig. 5 .\n5Trajectories of (a) optimal solution and (b) tracking error from t = 0[s] to t = 3.4[s] (Case II). in the brown curves and magenta curves with the prediction horizon T = 4δ[s] and T = 7δ[s], respectively. The position trajectories solved by mC/GMRES are plotted in yellow and black curves with d max = 1 and d max = 10, respectively. The position trajectories solved by iC/GMRES are plotted in blue, red, deep green, and cyan curves with the different T and d max , while the green curves are the desired trajectories. Generally speaking, similar observations can be made for the two test cases: As can be seen in Figs. 3-5 and\n\n\nthe initialization. At each time instant,Ū * is computed in iC/GMRES by taking advantage of the previous solution at the last step, which makes the evolution of the control input smoother. In particular, in Fig. 6 we compare iC/GMRES with mC/GMRES in terms of the tendency ofŪ d 0 andU d 0 as d max increases. For iC/GMRES, as ε becomes larger successively,Ū d 0 converges\n\nFig. 6 .\n6Evolution of the first elements of the control input sequence and control input sequence increment as d max increases. (a) Case I. (b) Case II.\n\n\n. 7-10. The red and blue curves are under NMPC. The cyan curves are under efficient-NMPC. The black curves are under BC.\n\nFig. 7 .\n7Position trajectories in SIL real-time simulation under the disturbances (Case I).\n\nFig. 8 .\n8Position trajectories in SIL real-time simulation under the disturbances (Case II).\n\nFig. 9 .\n9Trajectories of tracking errors under the different control methods. (a) Case I. (b) Case II.\n\nFig. 10 .\n10Different responses of the control inputs in the different control methods for the same disturbances. (a) Case I. (b) Case II.\n\nFig. 11 .\n11Experimental trajectories of (a) position and (b) tracking error in the real Parrot quadrotor system.\n\nFig. 12 .\n12Experimental velocity responses and control signals in the real Parrot quadrotor system. (a) Flight velocity. (b) Control signal.\n\n\n∞ ≤η 2 + || || ∞ ||v b || ∞ + (α 1 + α 2 )||z 2 || ∞ + (1 − α 2 1 )||z 1 || ∞ (38) where = −Ṙ(ψ) = ⎡ ⎣sin(ψ)r cos(ψ)r 0 − cos(ψ)r sin(ψ)the fact that || || ∞ ≤ √ 2||v b || ∞ . Based on (5), we have\n\nTABLE I ACT\nIPER UPDATE IN THE DIFFERENT NUMERICAL ALGORITHMS\n\nSensor-driven area coverage for an autonomous fixed-wing unmanned aerial vehicle. L Paull, C Thibault, A Nagaty, M Seto, H Li, IEEE Trans. Cybern. 449L. Paull, C. Thibault, A. Nagaty, M. Seto, and H. Li, \"Sensor-driven area coverage for an autonomous fixed-wing unmanned aerial vehicle,\" IEEE Trans. Cybern., vol. 44, no. 9, pp. 1605-1618, Sep. 2014.\n\nClassifications, applications, and design challenges of drones: A review. M Hassanalian, A Abdelkefi, Progr. Aerosp. Sci. 91M. Hassanalian and A. Abdelkefi, \"Classifications, applications, and design challenges of drones: A review,\" Progr. Aerosp. Sci., vol. 91, pp. 99-131, May 2017.\n\nBuild your own visual-inertial drone: A cost-effective and open-source autonomous drone. I Sa, IEEE Robot. Autom. Mag. 251I. Sa et al., \"Build your own visual-inertial drone: A cost-effective and open-source autonomous drone,\" IEEE Robot. Autom. Mag., vol. 25, no. 1, pp. 89-103, Mar. 2018.\n\nStable path-following control for a quadrotor helicopter considering energy consumption. D C Gandolfo, L R Salinas, A Brando, J M Toibero, IEEE Trans. Control Syst. Technol. 254D. C. Gandolfo, L. R. Salinas, A. Brando, and J. M. Toibero, \"Stable path-following control for a quadrotor helicopter considering energy consumption,\" IEEE Trans. Control Syst. Technol., vol. 25, no. 4, pp. 1423-1430, Jul. 2017.\n\nBackstepping control for a quadrotor helicopter. T Madani, A Benallegue, Proc. IEEE Int. Conf. Intell. Robots Syst. (IROS). IEEE Int. Conf. Intell. Robots Syst. (IROS)Beijing, ChinaT. Madani and A. Benallegue, \"Backstepping control for a quadrotor helicopter,\" in Proc. IEEE Int. Conf. Intell. Robots Syst. (IROS), Beijing, China, Oct. 2006, pp. 3255-3260.\n\nIntegral sliding mode flight controller design for a quadrotor and the application in a heterogeneous multi-agent system. B Mu, K Zhang, Y Shi, IEEE Trans. Ind. Electron. 6412B. Mu, K. Zhang, and Y. Shi, \"Integral sliding mode flight controller design for a quadrotor and the application in a heterogeneous multi-agent system,\" IEEE Trans. Ind. Electron., vol. 64, no. 12, pp. 9389-9398, Dec. 2017.\n\nAn integral predictive/nonlinear H ∞ control structure for a quadrotor helicopter. G V Raffo, M G Ortega, F R Rubio, Automatica. 461G. V. Raffo, M. G. Ortega, and F. R. Rubio, \"An integral predictive/nonlinear H ∞ control structure for a quadrotor helicopter,\" Automatica, vol. 46, no. 1, pp. 29-39, 2010.\n\nAdaptive tracking control of surface vessel using optimized backstepping technique. G Wen, S S Ge, C L P Chen, F Tu, S Wang, IEEE Trans. Cybern. 499G. Wen, S. S. Ge, C. L. P. Chen, F. Tu, and S. Wang, \"Adaptive tracking control of surface vessel using optimized backstepping technique,\" IEEE Trans. Cybern., vol. 49, no. 9, pp. 3420-3431, Sep. 2019.\n\nInner-outer loop control for quadrotor UAVs with input and state constraints. N Cao, A F Lynch, IEEE Trans. Control Syst. Technol. 245N. Cao and A. F. Lynch, \"Inner-outer loop control for quadrotor UAVs with input and state constraints,\" IEEE Trans. Control Syst. Technol., vol. 24, no. 5, pp. 1797-1804, Sep. 2016.\n\nAdaptive and robust control of quadrotor aircrafts with input saturation. S Li, Y Wang, J Tan, Nonlinear Dyn. 891S. Li, Y. Wang, and J. Tan, \"Adaptive and robust control of quadro- tor aircrafts with input saturation,\" Nonlinear Dyn., vol. 89, no. 1, pp. 255-265, 2017.\n\nAperiodic robust model predictive control for constrained continuous-time nonlinear systems: An eventtriggered approach. C Liu, J Gao, H Li, D Xu, IEEE Trans. Cybern. 485C. Liu, J. Gao, H. Li, and D. Xu, \"Aperiodic robust model predictive control for constrained continuous-time nonlinear systems: An event- triggered approach,\" IEEE Trans. Cybern., vol. 48, no. 5, pp. 1397-1405, May 2019.\n\nDesign and flight experiments of a tube-based model predictive controller for the AR.Drone 2.0 quadrotor. N Michel, S Bertrand, S Olaru, G Valmorbida, D Dumur, Proc. IFAC Workshop Robot Control (WROCO). IFAC Workshop Robot Control (WROCO)Daejeon, Republic of KoreaN. Michel, S. Bertrand, S. Olaru, G. Valmorbida, and D. Dumur, \"Design and flight experiments of a tube-based model predictive controller for the AR.Drone 2.0 quadrotor,\" in Proc. IFAC Workshop Robot Control (WROCO), Daejeon, Republic of Korea, Sept. 2019, pp. 112-117.\n\nMultivehicle flocking with collision avoidance via distributed model predictive control. Y Lyu, J Hu, B M Chen, C Zhao, Q Pan, 10.1109/TCYB.2019.2944892IEEE Trans. Cybern. early accessY. Lyu, J. Hu, B. M. Chen, C. Zhao, and Q. Pan, \"Multivehicle flocking with collision avoidance via distributed model predictive control,\" IEEE Trans. Cybern., early access, Oct. 1, 2019, doi: 10.1109/TCYB.2019.2944892.\n\nStability guarantees for translational thrust-propelled vehicles dynamics through NMPC designs. N T Nguyen, I Prodan, L Lefévre, 10.1109/TCST.2020.2974146IEEE Trans. Control Syst. Technol., early access. N. T. Nguyen, I. Prodan, and L. Lefévre, \"Stability guarantees for trans- lational thrust-propelled vehicles dynamics through NMPC designs,\" IEEE Trans. Control Syst. Technol., early access, Feb. 25, 2020, doi: 10.1109/TCST.2020.2974146.\n\nOn the implementation of an interiorpoint filter line-search algorithm for large-scale nonlinear programming. A Wächter, L T Biegler, Math. Program. 1061A. Wächter and L. T. Biegler, \"On the implementation of an interior- point filter line-search algorithm for large-scale nonlinear programming,\" Math. Program., vol. 106, no. 1, pp. 25-57, 2006.\n\nGrey wolf optimizer-based approach to the tuning of PI-fuzzy controllers with a reduced process parametric sensitivity. R.-E Precup, R.-C David, E.-M Petriu, A.-L Szedlak-Stinean, C.-A Bojan-Dragos, Proc. IFAC Conf. Intell. Control Autom. Sci. (ICONS). IFAC Conf. Intell. Control Autom. Sci. (ICONS)Reims, FranceR.-E. Precup, R.-C. David, E.-M. Petriu, A.-L. Szedlak-Stinean, and C.-A. Bojan-Dragos, \"Grey wolf optimizer-based approach to the tuning of PI-fuzzy controllers with a reduced process parametric sensitivity,\" in Proc. IFAC Conf. Intell. Control Autom. Sci. (ICONS), Reims, France, Jun. 2016, pp. 55-60.\n\nAdvanced control in marine mechatronic systems: A survey. Y Shi, C Shen, H Fang, H Li, IEEE/ASME Trans. Mechatronics. 223Y. Shi, C. Shen, H. Fang, and H. Li, \"Advanced control in marine mecha- tronic systems: A survey,\" IEEE/ASME Trans. Mechatronics, vol. 22, no. 3, pp. 1121-1131, Jun. 2017.\n\nEfficient nonlinear model predictive control algorithms. M Cannon, Annu. Rev. Control. 282M. Cannon, \"Efficient nonlinear model predictive control algorithms,\" Annu. Rev. Control, vol. 28, no. 2, pp. 229-237, 2004.\n\nA continuation/GMRES method for fast computation of nonlinear receding horizon control. T Ohtsuka, Automatica. 404T. Ohtsuka, \"A continuation/GMRES method for fast computation of nonlinear receding horizon control,\" Automatica, vol. 40, no. 4, pp. 563-574, 2004.\n\nA tutorial on C/GMRES and automatic code generation for nonlinear model predictive control. T Ohtsuka, Proc. Eur. Control Conf. (ECC). Eur. Control Conf. (ECC)Linz, AustriaT. Ohtsuka, \"A tutorial on C/GMRES and automatic code generation for nonlinear model predictive control,\" in Proc. Eur. Control Conf. (ECC), Linz, Austria, Jul. 2015, pp. 73-86.\n\nNonlinear model predictive control of a diesel engine air path: A comparison of constraint handling and computational strategies. M Huang, H Nakada, K Butts, I Kolmanovsky, Proc. IFAC Conf. Nonlinear Model Predictive Control (NMPC). IFAC Conf. Nonlinear Model Predictive Control (NMPC)Seville, SpainM. Huang, H. Nakada, K. Butts, and I. Kolmanovsky, \"Nonlinear model predictive control of a diesel engine air path: A comparison of con- straint handling and computational strategies,\" in Proc. IFAC Conf. Nonlinear Model Predictive Control (NMPC), Seville, Spain, Sep. 2015, pp. 372-379.\n\nModified C/GMRES algorithm for fast nonlinear model predictive tracking control of AUVs. C Shen, B Buckham, Y Shi, IEEE Trans. Control Syst. Technol. 255C. Shen, B. Buckham, and Y. Shi, \"Modified C/GMRES algorithm for fast nonlinear model predictive tracking control of AUVs,\" IEEE Trans. Control Syst. Technol., vol. 25, no. 5, pp. 1896-1904, Sep. 2017.\n\nPerformance recovery trackingcontroller for quadcopters via invariant dynamic surface approach. S Kim, C K Ahn, P Shi, IEEE Trans. Ind. Informat. 159S. Kim, C. K. Ahn, and P. Shi, \"Performance recovery tracking- controller for quadcopters via invariant dynamic surface approach,\" IEEE Trans. Ind. Informat., vol. 15, no. 9, pp. 5235-5243, Sep. 2019.\n\nStabilization of a mini rotorcraft with four rotors. P Castillo, R Lozano, A Dzul, IEEE Control Syst. Mag. 256P. Castillo, R. Lozano, and A. Dzul, \"Stabilization of a mini rotorcraft with four rotors,\" IEEE Control Syst. Mag., vol. 25, no. 6, pp. 45-55, Dec. 2005.\n\nReliable tracking control for under-actuated quadrotors with wind disturbances. J Xu, P Shi, C Lim, C Cai, Y Zou, Man, Cybern., Syst. 4910IEEE Trans. Syst.J. Xu, P. Shi, C. Lim, C. Cai, and Y. Zou, \"Reliable tracking control for under-actuated quadrotors with wind disturbances,\" IEEE Trans. Syst., Man, Cybern., Syst., vol. 49, no. 10, pp. 2059-2070, Oct. 2019.\n\nCollision avoidance effects on the mobility of a UAV swarm using chaotic ant colony with model predictive control. J Dentler, J. Intell. Robot. Syst. 931J. Dentler et al., \"Collision avoidance effects on the mobility of a UAV swarm using chaotic ant colony with model predictive control,\" J. Intell. Robot. Syst., vol. 93, no. 1, pp. 227-243, 2019.\n\nModel predictive control for aerial collision avoidance in dynamic environments. M Castillo-Lopez, S A Sajadi-Alamdari, J L Sanchez-Lopez, M A Olivares-Méndez, H Voos, Proc. Mediterranean Conf. Control Autom. (MED). Mediterranean Conf. Control Autom. (MED)Zadar, CroatiaM. Castillo-Lopez, S. A. Sajadi-Alamdari, J. L. Sanchez-Lopez, M. A. Olivares-Méndez, and H. Voos \"Model predictive control for aerial collision avoidance in dynamic environments,\" in Proc. Mediterranean Conf. Control Autom. (MED), Zadar, Croatia, Jun. 2018, pp. 1-6.\n\nPractical Methods for Optimal Control and Estimation Using Nonlinear Programming. J T Betts, Soc. Ind. Appl. Math. J. T. Betts, Practical Methods for Optimal Control and Estimation Using Nonlinear Programming. Philadelphia, PA, USA: Soc. Ind. Appl. Math., 2010.\n\nLyapunov-based model predictive control of nonlinear systems subject to data losses. D Munoz De La Pena, P D Christofides, IEEE Trans. Autom. Control. 539D. Munoz de la Pena and P. D. Christofides, \"Lyapunov-based model predictive control of nonlinear systems subject to data losses,\" IEEE Trans. Autom. Control, vol. 53, no. 9, pp. 2076-2089, Oct. 2008.\n\nDistributed implementation of nonlinear model predictive control for AUV trajectory tracking. C Shen, Y Shi, Automatica. 115Art. no. 108863C. Shen and Y. Shi, \"Distributed implementation of nonlinear model predictive control for AUV trajectory tracking,\" Automatica, vol. 115, May 2020, Art. no. 108863.\n\nAn interior penalty method for inequality constrained optimal control problems. L Lasdon, A Waren, R Rice, IEEE Trans. Autom. Control. 124L. Lasdon, A. Waren, and R. Rice, \"An interior penalty method for inequality constrained optimal control problems,\" IEEE Trans. Autom. Control, vol. 12, no. 4, pp. 388-395, Aug. 1967.\n\nS Boyd, L Vandenberghe, Convex Optimization. Cambridge, U.K.Cambridge Univ. PressS. Boyd and L. Vandenberghe, Convex Optimization. Cambridge, U.K.: Cambridge Univ. Press, 2004.\n\nTrajectory tracking control of an autonomous underwater vehicle using Lyapunov-based model predictive control. C Shen, Y Shi, B Buckham, IEEE Trans. Ind. Electron. 657C. Shen, Y. Shi, and B. Buckham, \"Trajectory tracking control of an autonomous underwater vehicle using Lyapunov-based model predictive control,\" IEEE Trans. Ind. Electron., vol. 65, no. 7, pp. 5796-5805, Jul. 2018.\n\n. H K Khalil, Nonlinear Systems, Prentice-HallEnglewood Cliffs, NJ, USAH. K. Khalil, Nonlinear Systems. Englewood Cliffs, NJ, USA: Prentice-Hall, 2002.\n\nAdaptive model predictive control for a class of constrained linear systems with parametric uncertainties. K Zhang, Y Shi, Automatica. 117Art. no. 108974K. Zhang and Y. Shi, \"Adaptive model predictive control for a class of constrained linear systems with parametric uncertainties,\" Automatica, vol. 117, Jul. 2020, Art. no. 108974.\n\nData-based controllability and observability analysis of linear discrete-time systems. Z Wang, D Liu, IEEE Trans. Neural Netw. 2212Z. Wang and D. Liu, \"Data-based controllability and observability anal- ysis of linear discrete-time systems,\" IEEE Trans. Neural Netw., vol. 22, no. 12, pp. 2388-2392, Dec. 2011.\n", "annotations": {"author": "[{\"end\":160,\"start\":121},{\"end\":182,\"start\":161},{\"end\":204,\"start\":183},{\"end\":227,\"start\":205},{\"end\":253,\"start\":228}]", "publisher": null, "author_last_name": "[{\"end\":159,\"start\":155},{\"end\":181,\"start\":178},{\"end\":203,\"start\":200},{\"end\":226,\"start\":224},{\"end\":252,\"start\":248}]", "author_first_name": "[{\"end\":154,\"start\":150},{\"end\":177,\"start\":173},{\"end\":199,\"start\":195},{\"end\":223,\"start\":217},{\"end\":247,\"start\":240}]", "author_affiliation": null, "title": "[{\"end\":106,\"start\":1},{\"end\":359,\"start\":254}]", "venue": "[{\"end\":393,\"start\":361}]", "abstract": "[{\"end\":1855,\"start\":560}]", "bib_ref": "[{\"attributes\":{\"ref_id\":\"b2\"},\"end\":2090,\"start\":2087},{\"attributes\":{\"ref_id\":\"b3\"},\"end\":2095,\"start\":2092},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":2484,\"start\":2481},{\"attributes\":{\"ref_id\":\"b5\"},\"end\":2513,\"start\":2510},{\"attributes\":{\"ref_id\":\"b6\"},\"end\":2567,\"start\":2564},{\"attributes\":{\"ref_id\":\"b7\"},\"end\":2598,\"start\":2595},{\"attributes\":{\"ref_id\":\"b8\"},\"end\":3257,\"start\":3254},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":3288,\"start\":3284},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":3518,\"start\":3514},{\"attributes\":{\"ref_id\":\"b11\"},\"end\":3760,\"start\":3756},{\"attributes\":{\"ref_id\":\"b12\"},\"end\":4011,\"start\":4007},{\"attributes\":{\"ref_id\":\"b13\"},\"end\":4020,\"start\":4016},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":4229,\"start\":4225},{\"attributes\":{\"ref_id\":\"b7\"},\"end\":4667,\"start\":4664},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":4700,\"start\":4696},{\"attributes\":{\"ref_id\":\"b16\"},\"end\":5216,\"start\":5212},{\"attributes\":{\"ref_id\":\"b17\"},\"end\":5592,\"start\":5588},{\"attributes\":{\"ref_id\":\"b18\"},\"end\":5920,\"start\":5916},{\"attributes\":{\"ref_id\":\"b19\"},\"end\":6079,\"start\":6075},{\"attributes\":{\"ref_id\":\"b20\"},\"end\":6392,\"start\":6388},{\"attributes\":{\"ref_id\":\"b21\"},\"end\":6772,\"start\":6768},{\"attributes\":{\"ref_id\":\"b17\"},\"end\":7369,\"start\":7365},{\"attributes\":{\"ref_id\":\"b21\"},\"end\":7893,\"start\":7889},{\"attributes\":{\"ref_id\":\"b6\"},\"end\":9922,\"start\":9919},{\"attributes\":{\"ref_id\":\"b22\"},\"end\":9928,\"start\":9924},{\"attributes\":{\"ref_id\":\"b23\"},\"end\":10423,\"start\":10419},{\"attributes\":{\"ref_id\":\"b24\"},\"end\":10612,\"start\":10608},{\"attributes\":{\"ref_id\":\"b3\"},\"end\":11406,\"start\":11403},{\"attributes\":{\"ref_id\":\"b25\"},\"end\":11805,\"start\":11801},{\"attributes\":{\"ref_id\":\"b26\"},\"end\":11973,\"start\":11969},{\"attributes\":{\"ref_id\":\"b18\"},\"end\":13445,\"start\":13441},{\"attributes\":{\"ref_id\":\"b27\"},\"end\":14898,\"start\":14894},{\"attributes\":{\"ref_id\":\"b11\"},\"end\":17286,\"start\":17282},{\"attributes\":{\"ref_id\":\"b21\"},\"end\":17778,\"start\":17774},{\"attributes\":{\"ref_id\":\"b19\"},\"end\":18217,\"start\":18213},{\"attributes\":{\"ref_id\":\"b27\"},\"end\":19119,\"start\":19115},{\"attributes\":{\"ref_id\":\"b18\"},\"end\":19928,\"start\":19924},{\"attributes\":{\"ref_id\":\"b21\"},\"end\":19937,\"start\":19933},{\"attributes\":{\"ref_id\":\"b18\"},\"end\":20485,\"start\":20481},{\"attributes\":{\"ref_id\":\"b12\"},\"end\":20978,\"start\":20974},{\"attributes\":{\"ref_id\":\"b8\"},\"end\":21020,\"start\":21017},{\"attributes\":{\"ref_id\":\"b28\"},\"end\":22268,\"start\":22264},{\"attributes\":{\"ref_id\":\"b29\"},\"end\":23302,\"start\":23298},{\"attributes\":{\"ref_id\":\"b30\"},\"end\":25607,\"start\":25603},{\"attributes\":{\"ref_id\":\"b21\"},\"end\":25927,\"start\":25923},{\"attributes\":{\"ref_id\":\"b24\"},\"end\":27411,\"start\":27407},{\"attributes\":{\"ref_id\":\"b31\"},\"end\":29054,\"start\":29050},{\"end\":29063,\"start\":29054},{\"attributes\":{\"ref_id\":\"b32\"},\"end\":29611,\"start\":29607},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":29820,\"start\":29817},{\"attributes\":{\"ref_id\":\"b29\"},\"end\":30214,\"start\":30210},{\"attributes\":{\"ref_id\":\"b31\"},\"end\":30329,\"start\":30325},{\"attributes\":{\"ref_id\":\"b32\"},\"end\":30754,\"start\":30750},{\"attributes\":{\"ref_id\":\"b32\"},\"end\":31385,\"start\":31381},{\"attributes\":{\"ref_id\":\"b32\"},\"end\":32304,\"start\":32300},{\"attributes\":{\"ref_id\":\"b29\"},\"end\":32527,\"start\":32523},{\"attributes\":{\"ref_id\":\"b33\"},\"end\":32726,\"start\":32722},{\"end\":32734,\"start\":32726},{\"attributes\":{\"ref_id\":\"b33\"},\"end\":33360,\"start\":33356},{\"end\":33368,\"start\":33360},{\"attributes\":{\"ref_id\":\"b21\"},\"end\":35760,\"start\":35756},{\"attributes\":{\"ref_id\":\"b34\"},\"end\":43384,\"start\":43380},{\"attributes\":{\"ref_id\":\"b35\"},\"end\":43569,\"start\":43565},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":44003,\"start\":44000}]", "figure": "[{\"attributes\":{\"id\":\"fig_0\"},\"end\":45061,\"start\":45006},{\"attributes\":{\"id\":\"fig_1\"},\"end\":45162,\"start\":45062},{\"attributes\":{\"id\":\"fig_2\"},\"end\":45282,\"start\":45163},{\"attributes\":{\"id\":\"fig_3\"},\"end\":45391,\"start\":45283},{\"attributes\":{\"id\":\"fig_4\"},\"end\":46030,\"start\":45392},{\"attributes\":{\"id\":\"fig_5\"},\"end\":46405,\"start\":46031},{\"attributes\":{\"id\":\"fig_6\"},\"end\":46560,\"start\":46406},{\"attributes\":{\"id\":\"fig_7\"},\"end\":46683,\"start\":46561},{\"attributes\":{\"id\":\"fig_8\"},\"end\":46777,\"start\":46684},{\"attributes\":{\"id\":\"fig_9\"},\"end\":46872,\"start\":46778},{\"attributes\":{\"id\":\"fig_10\"},\"end\":46977,\"start\":46873},{\"attributes\":{\"id\":\"fig_11\"},\"end\":47117,\"start\":46978},{\"attributes\":{\"id\":\"fig_12\"},\"end\":47232,\"start\":47118},{\"attributes\":{\"id\":\"fig_13\"},\"end\":47375,\"start\":47233},{\"attributes\":{\"id\":\"fig_14\"},\"end\":47575,\"start\":47376},{\"attributes\":{\"id\":\"tab_0\",\"type\":\"table\"},\"end\":47638,\"start\":47576}]", "paragraph": "[{\"end\":2912,\"start\":1857},{\"end\":4230,\"start\":2914},{\"end\":5488,\"start\":4232},{\"end\":7565,\"start\":5490},{\"end\":9074,\"start\":7567},{\"end\":9705,\"start\":9076},{\"end\":9940,\"start\":9735},{\"end\":10979,\"start\":9995},{\"end\":11407,\"start\":11044},{\"end\":11806,\"start\":11425},{\"end\":12089,\"start\":11899},{\"end\":12241,\"start\":12134},{\"end\":12365,\"start\":12360},{\"end\":12560,\"start\":12514},{\"end\":12760,\"start\":12562},{\"end\":12928,\"start\":12762},{\"end\":13317,\"start\":13115},{\"end\":13822,\"start\":13319},{\"end\":14266,\"start\":14191},{\"end\":15418,\"start\":14305},{\"end\":15739,\"start\":15452},{\"end\":16120,\"start\":15779},{\"end\":16534,\"start\":16275},{\"end\":16892,\"start\":16612},{\"end\":17173,\"start\":17094},{\"end\":18385,\"start\":17218},{\"end\":18476,\"start\":18421},{\"end\":18779,\"start\":18546},{\"end\":19224,\"start\":18898},{\"end\":19519,\"start\":19268},{\"end\":19577,\"start\":19544},{\"end\":20078,\"start\":19718},{\"end\":21319,\"start\":20125},{\"end\":21482,\"start\":21321},{\"end\":22269,\"start\":21816},{\"end\":22844,\"start\":22509},{\"end\":23875,\"start\":22846},{\"end\":24863,\"start\":23917},{\"end\":25085,\"start\":24892},{\"end\":25482,\"start\":25123},{\"end\":25675,\"start\":25484},{\"end\":25912,\"start\":25677},{\"end\":26179,\"start\":25914},{\"end\":26468,\"start\":26226},{\"end\":26585,\"start\":26470},{\"end\":26652,\"start\":26587},{\"end\":26868,\"start\":26729},{\"end\":27058,\"start\":27028},{\"end\":27144,\"start\":27097},{\"end\":27281,\"start\":27257},{\"end\":27428,\"start\":27366},{\"end\":27694,\"start\":27454},{\"end\":27950,\"start\":27696},{\"end\":28038,\"start\":27986},{\"end\":28213,\"start\":28106},{\"end\":28423,\"start\":28261},{\"end\":28581,\"start\":28425},{\"end\":29385,\"start\":28583},{\"end\":29857,\"start\":29424},{\"end\":30033,\"start\":29892},{\"end\":30494,\"start\":30140},{\"end\":30643,\"start\":30532},{\"end\":30962,\"start\":30742},{\"end\":31139,\"start\":30964},{\"end\":31184,\"start\":31141},{\"end\":31626,\"start\":31291},{\"end\":32174,\"start\":31628},{\"end\":32405,\"start\":32176},{\"end\":32611,\"start\":32407},{\"end\":32871,\"start\":32613},{\"end\":33255,\"start\":32953},{\"end\":33505,\"start\":33315},{\"end\":33900,\"start\":33549},{\"end\":35234,\"start\":33953},{\"end\":35631,\"start\":35236},{\"end\":36344,\"start\":35672},{\"end\":37238,\"start\":36346},{\"end\":37947,\"start\":37240},{\"end\":38996,\"start\":38012},{\"end\":39770,\"start\":38998},{\"end\":41327,\"start\":39825},{\"end\":42337,\"start\":41381},{\"end\":43067,\"start\":42356},{\"end\":43786,\"start\":43069},{\"end\":43904,\"start\":43818},{\"end\":43985,\"start\":43906},{\"end\":44071,\"start\":43987},{\"end\":44125,\"start\":44073},{\"end\":44308,\"start\":44176},{\"end\":44488,\"start\":44310},{\"end\":45005,\"start\":44524}]", "formula": "[{\"attributes\":{\"id\":\"formula_0\"},\"end\":9994,\"start\":9941},{\"attributes\":{\"id\":\"formula_1\"},\"end\":11043,\"start\":10980},{\"attributes\":{\"id\":\"formula_2\"},\"end\":11424,\"start\":11408},{\"attributes\":{\"id\":\"formula_3\"},\"end\":11898,\"start\":11807},{\"attributes\":{\"id\":\"formula_4\"},\"end\":12133,\"start\":12090},{\"attributes\":{\"id\":\"formula_5\"},\"end\":12359,\"start\":12242},{\"attributes\":{\"id\":\"formula_6\"},\"end\":12513,\"start\":12366},{\"attributes\":{\"id\":\"formula_7\"},\"end\":13114,\"start\":12929},{\"attributes\":{\"id\":\"formula_8\"},\"end\":14190,\"start\":13823},{\"attributes\":{\"id\":\"formula_9\"},\"end\":14304,\"start\":14267},{\"attributes\":{\"id\":\"formula_10\"},\"end\":16274,\"start\":16121},{\"attributes\":{\"id\":\"formula_11\"},\"end\":16611,\"start\":16535},{\"attributes\":{\"id\":\"formula_12\"},\"end\":17093,\"start\":16893},{\"attributes\":{\"id\":\"formula_13\"},\"end\":17217,\"start\":17174},{\"attributes\":{\"id\":\"formula_14\"},\"end\":18545,\"start\":18477},{\"attributes\":{\"id\":\"formula_15\"},\"end\":18897,\"start\":18780},{\"attributes\":{\"id\":\"formula_16\"},\"end\":19267,\"start\":19225},{\"attributes\":{\"id\":\"formula_17\"},\"end\":19543,\"start\":19520},{\"attributes\":{\"id\":\"formula_18\"},\"end\":19717,\"start\":19578},{\"attributes\":{\"id\":\"formula_19\"},\"end\":20124,\"start\":20079},{\"attributes\":{\"id\":\"formula_20\"},\"end\":21795,\"start\":21483},{\"attributes\":{\"id\":\"formula_21\"},\"end\":22508,\"start\":22270},{\"attributes\":{\"id\":\"formula_22\"},\"end\":23916,\"start\":23876},{\"attributes\":{\"id\":\"formula_23\"},\"end\":26225,\"start\":26180},{\"attributes\":{\"id\":\"formula_24\"},\"end\":26728,\"start\":26653},{\"attributes\":{\"id\":\"formula_25\"},\"end\":27027,\"start\":26869},{\"attributes\":{\"id\":\"formula_26\"},\"end\":27096,\"start\":27059},{\"attributes\":{\"id\":\"formula_27\"},\"end\":27256,\"start\":27145},{\"attributes\":{\"id\":\"formula_28\"},\"end\":27365,\"start\":27282},{\"attributes\":{\"id\":\"formula_29\"},\"end\":27453,\"start\":27429},{\"attributes\":{\"id\":\"formula_30\"},\"end\":27985,\"start\":27951},{\"attributes\":{\"id\":\"formula_31\"},\"end\":28105,\"start\":28039},{\"attributes\":{\"id\":\"formula_32\"},\"end\":28260,\"start\":28214},{\"attributes\":{\"id\":\"formula_33\"},\"end\":29891,\"start\":29858},{\"attributes\":{\"id\":\"formula_34\"},\"end\":30139,\"start\":30034},{\"attributes\":{\"id\":\"formula_35\"},\"end\":30531,\"start\":30495},{\"attributes\":{\"id\":\"formula_36\"},\"end\":30741,\"start\":30644},{\"attributes\":{\"id\":\"formula_37\"},\"end\":31290,\"start\":31185},{\"attributes\":{\"id\":\"formula_38\"},\"end\":32952,\"start\":32872},{\"attributes\":{\"id\":\"formula_39\"},\"end\":33314,\"start\":33256},{\"attributes\":{\"id\":\"formula_42\"},\"end\":44131,\"start\":44126},{\"attributes\":{\"id\":\"formula_43\"},\"end\":44175,\"start\":44131},{\"attributes\":{\"id\":\"formula_45\"},\"end\":44523,\"start\":44489}]", "table_ref": "[{\"attributes\":{\"ref_id\":\"tab_0\"},\"end\":38140,\"start\":38133},{\"attributes\":{\"ref_id\":\"tab_0\"},\"end\":39411,\"start\":39404}]", "section_header": "[{\"end\":9733,\"start\":9708},{\"end\":15450,\"start\":15421},{\"end\":15777,\"start\":15742},{\"end\":18419,\"start\":18388},{\"end\":21814,\"start\":21797},{\"end\":24890,\"start\":24866},{\"end\":25121,\"start\":25088},{\"end\":29422,\"start\":29388},{\"end\":33547,\"start\":33508},{\"end\":33951,\"start\":33903},{\"end\":35670,\"start\":35634},{\"end\":38010,\"start\":37950},{\"end\":39823,\"start\":39773},{\"end\":41379,\"start\":41330},{\"end\":42354,\"start\":42340},{\"end\":43816,\"start\":43789},{\"end\":45015,\"start\":45007},{\"end\":45071,\"start\":45063},{\"end\":45172,\"start\":45164},{\"end\":45292,\"start\":45284},{\"end\":45401,\"start\":45393},{\"end\":46415,\"start\":46407},{\"end\":46693,\"start\":46685},{\"end\":46787,\"start\":46779},{\"end\":46882,\"start\":46874},{\"end\":46988,\"start\":46979},{\"end\":47128,\"start\":47119},{\"end\":47243,\"start\":47234},{\"end\":47588,\"start\":47577}]", "table": null, "figure_caption": "[{\"end\":45061,\"start\":45017},{\"end\":45162,\"start\":45073},{\"end\":45282,\"start\":45174},{\"end\":45391,\"start\":45294},{\"end\":46030,\"start\":45403},{\"end\":46405,\"start\":46033},{\"end\":46560,\"start\":46417},{\"end\":46683,\"start\":46563},{\"end\":46777,\"start\":46695},{\"end\":46872,\"start\":46789},{\"end\":46977,\"start\":46884},{\"end\":47117,\"start\":46991},{\"end\":47232,\"start\":47131},{\"end\":47375,\"start\":47246},{\"end\":47575,\"start\":47378},{\"end\":47638,\"start\":47590}]", "figure_ref": "[{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":24862,\"start\":24856},{\"end\":30318,\"start\":30313},{\"attributes\":{\"ref_id\":\"fig_1\"},\"end\":37828,\"start\":37822},{\"attributes\":{\"ref_id\":\"fig_2\"},\"end\":38076,\"start\":38070},{\"end\":39865,\"start\":39861},{\"attributes\":{\"ref_id\":\"fig_8\"},\"end\":39872,\"start\":39866},{\"attributes\":{\"ref_id\":\"fig_10\"},\"end\":40679,\"start\":40673},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":41602,\"start\":41595},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":41666,\"start\":41659},{\"attributes\":{\"ref_id\":\"fig_2\"},\"end\":42090,\"start\":42084},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":42189,\"start\":42182},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":42224,\"start\":42217}]", "bib_author_first_name": "[{\"end\":47723,\"start\":47722},{\"end\":47732,\"start\":47731},{\"end\":47744,\"start\":47743},{\"end\":47754,\"start\":47753},{\"end\":47762,\"start\":47761},{\"end\":48067,\"start\":48066},{\"end\":48082,\"start\":48081},{\"end\":48368,\"start\":48367},{\"end\":48660,\"start\":48659},{\"end\":48662,\"start\":48661},{\"end\":48674,\"start\":48673},{\"end\":48676,\"start\":48675},{\"end\":48687,\"start\":48686},{\"end\":48697,\"start\":48696},{\"end\":48699,\"start\":48698},{\"end\":49028,\"start\":49027},{\"end\":49038,\"start\":49037},{\"end\":49459,\"start\":49458},{\"end\":49465,\"start\":49464},{\"end\":49474,\"start\":49473},{\"end\":49820,\"start\":49819},{\"end\":49822,\"start\":49821},{\"end\":49831,\"start\":49830},{\"end\":49833,\"start\":49832},{\"end\":49843,\"start\":49842},{\"end\":49845,\"start\":49844},{\"end\":50128,\"start\":50127},{\"end\":50135,\"start\":50134},{\"end\":50137,\"start\":50136},{\"end\":50143,\"start\":50142},{\"end\":50147,\"start\":50144},{\"end\":50155,\"start\":50154},{\"end\":50161,\"start\":50160},{\"end\":50473,\"start\":50472},{\"end\":50480,\"start\":50479},{\"end\":50482,\"start\":50481},{\"end\":50786,\"start\":50785},{\"end\":50792,\"start\":50791},{\"end\":50800,\"start\":50799},{\"end\":51104,\"start\":51103},{\"end\":51111,\"start\":51110},{\"end\":51118,\"start\":51117},{\"end\":51124,\"start\":51123},{\"end\":51481,\"start\":51480},{\"end\":51491,\"start\":51490},{\"end\":51503,\"start\":51502},{\"end\":51512,\"start\":51511},{\"end\":51526,\"start\":51525},{\"end\":51999,\"start\":51998},{\"end\":52006,\"start\":52005},{\"end\":52012,\"start\":52011},{\"end\":52014,\"start\":52013},{\"end\":52022,\"start\":52021},{\"end\":52030,\"start\":52029},{\"end\":52411,\"start\":52410},{\"end\":52413,\"start\":52412},{\"end\":52423,\"start\":52422},{\"end\":52433,\"start\":52432},{\"end\":52868,\"start\":52867},{\"end\":52879,\"start\":52878},{\"end\":52881,\"start\":52880},{\"end\":53229,\"start\":53225},{\"end\":53242,\"start\":53238},{\"end\":53254,\"start\":53250},{\"end\":53267,\"start\":53263},{\"end\":53289,\"start\":53285},{\"end\":53781,\"start\":53780},{\"end\":53788,\"start\":53787},{\"end\":53796,\"start\":53795},{\"end\":53804,\"start\":53803},{\"end\":54074,\"start\":54073},{\"end\":54321,\"start\":54320},{\"end\":54589,\"start\":54588},{\"end\":54978,\"start\":54977},{\"end\":54987,\"start\":54986},{\"end\":54997,\"start\":54996},{\"end\":55006,\"start\":55005},{\"end\":55525,\"start\":55524},{\"end\":55533,\"start\":55532},{\"end\":55544,\"start\":55543},{\"end\":55888,\"start\":55887},{\"end\":55895,\"start\":55894},{\"end\":55897,\"start\":55896},{\"end\":55904,\"start\":55903},{\"end\":56196,\"start\":56195},{\"end\":56208,\"start\":56207},{\"end\":56218,\"start\":56217},{\"end\":56489,\"start\":56488},{\"end\":56495,\"start\":56494},{\"end\":56502,\"start\":56501},{\"end\":56509,\"start\":56508},{\"end\":56516,\"start\":56515},{\"end\":56888,\"start\":56887},{\"end\":57204,\"start\":57203},{\"end\":57222,\"start\":57221},{\"end\":57224,\"start\":57223},{\"end\":57243,\"start\":57242},{\"end\":57245,\"start\":57244},{\"end\":57262,\"start\":57261},{\"end\":57264,\"start\":57263},{\"end\":57283,\"start\":57282},{\"end\":57744,\"start\":57743},{\"end\":57746,\"start\":57745},{\"end\":58010,\"start\":58009},{\"end\":58030,\"start\":58029},{\"end\":58032,\"start\":58031},{\"end\":58375,\"start\":58374},{\"end\":58383,\"start\":58382},{\"end\":58666,\"start\":58665},{\"end\":58676,\"start\":58675},{\"end\":58685,\"start\":58684},{\"end\":58909,\"start\":58908},{\"end\":58917,\"start\":58916},{\"end\":59198,\"start\":59197},{\"end\":59206,\"start\":59205},{\"end\":59213,\"start\":59212},{\"end\":59473,\"start\":59472},{\"end\":59475,\"start\":59474},{\"end\":59493,\"start\":59484},{\"end\":59731,\"start\":59730},{\"end\":59740,\"start\":59739},{\"end\":60045,\"start\":60044},{\"end\":60053,\"start\":60052}]", "bib_author_last_name": "[{\"end\":47729,\"start\":47724},{\"end\":47741,\"start\":47733},{\"end\":47751,\"start\":47745},{\"end\":47759,\"start\":47755},{\"end\":47765,\"start\":47763},{\"end\":48079,\"start\":48068},{\"end\":48092,\"start\":48083},{\"end\":48371,\"start\":48369},{\"end\":48671,\"start\":48663},{\"end\":48684,\"start\":48677},{\"end\":48694,\"start\":48688},{\"end\":48707,\"start\":48700},{\"end\":49035,\"start\":49029},{\"end\":49049,\"start\":49039},{\"end\":49462,\"start\":49460},{\"end\":49471,\"start\":49466},{\"end\":49478,\"start\":49475},{\"end\":49828,\"start\":49823},{\"end\":49840,\"start\":49834},{\"end\":49851,\"start\":49846},{\"end\":50132,\"start\":50129},{\"end\":50140,\"start\":50138},{\"end\":50152,\"start\":50148},{\"end\":50158,\"start\":50156},{\"end\":50166,\"start\":50162},{\"end\":50477,\"start\":50474},{\"end\":50488,\"start\":50483},{\"end\":50789,\"start\":50787},{\"end\":50797,\"start\":50793},{\"end\":50804,\"start\":50801},{\"end\":51108,\"start\":51105},{\"end\":51115,\"start\":51112},{\"end\":51121,\"start\":51119},{\"end\":51127,\"start\":51125},{\"end\":51488,\"start\":51482},{\"end\":51500,\"start\":51492},{\"end\":51509,\"start\":51504},{\"end\":51523,\"start\":51513},{\"end\":51532,\"start\":51527},{\"end\":52003,\"start\":52000},{\"end\":52009,\"start\":52007},{\"end\":52019,\"start\":52015},{\"end\":52027,\"start\":52023},{\"end\":52034,\"start\":52031},{\"end\":52420,\"start\":52414},{\"end\":52430,\"start\":52424},{\"end\":52441,\"start\":52434},{\"end\":52876,\"start\":52869},{\"end\":52889,\"start\":52882},{\"end\":53236,\"start\":53230},{\"end\":53248,\"start\":53243},{\"end\":53261,\"start\":53255},{\"end\":53283,\"start\":53268},{\"end\":53302,\"start\":53290},{\"end\":53785,\"start\":53782},{\"end\":53793,\"start\":53789},{\"end\":53801,\"start\":53797},{\"end\":53807,\"start\":53805},{\"end\":54081,\"start\":54075},{\"end\":54329,\"start\":54322},{\"end\":54597,\"start\":54590},{\"end\":54984,\"start\":54979},{\"end\":54994,\"start\":54988},{\"end\":55003,\"start\":54998},{\"end\":55018,\"start\":55007},{\"end\":55530,\"start\":55526},{\"end\":55541,\"start\":55534},{\"end\":55548,\"start\":55545},{\"end\":55892,\"start\":55889},{\"end\":55901,\"start\":55898},{\"end\":55908,\"start\":55905},{\"end\":56205,\"start\":56197},{\"end\":56215,\"start\":56209},{\"end\":56223,\"start\":56219},{\"end\":56492,\"start\":56490},{\"end\":56499,\"start\":56496},{\"end\":56506,\"start\":56503},{\"end\":56513,\"start\":56510},{\"end\":56520,\"start\":56517},{\"end\":56896,\"start\":56889},{\"end\":57219,\"start\":57205},{\"end\":57240,\"start\":57225},{\"end\":57259,\"start\":57246},{\"end\":57280,\"start\":57265},{\"end\":57288,\"start\":57284},{\"end\":57752,\"start\":57747},{\"end\":58027,\"start\":58011},{\"end\":58045,\"start\":58033},{\"end\":58380,\"start\":58376},{\"end\":58387,\"start\":58384},{\"end\":58673,\"start\":58667},{\"end\":58682,\"start\":58677},{\"end\":58690,\"start\":58686},{\"end\":58914,\"start\":58910},{\"end\":58930,\"start\":58918},{\"end\":59203,\"start\":59199},{\"end\":59210,\"start\":59207},{\"end\":59221,\"start\":59214},{\"end\":59482,\"start\":59476},{\"end\":59501,\"start\":59494},{\"end\":59737,\"start\":59732},{\"end\":59744,\"start\":59741},{\"end\":60050,\"start\":60046},{\"end\":60057,\"start\":60054}]", "bib_entry": "[{\"attributes\":{\"id\":\"b0\",\"matched_paper_id\":5621836},\"end\":47990,\"start\":47640},{\"attributes\":{\"id\":\"b1\",\"matched_paper_id\":114913580},\"end\":48276,\"start\":47992},{\"attributes\":{\"id\":\"b2\",\"matched_paper_id\":602869},\"end\":48568,\"start\":48278},{\"attributes\":{\"id\":\"b3\",\"matched_paper_id\":206659841},\"end\":48976,\"start\":48570},{\"attributes\":{\"id\":\"b4\",\"matched_paper_id\":2308108},\"end\":49334,\"start\":48978},{\"attributes\":{\"id\":\"b5\",\"matched_paper_id\":4858464},\"end\":49734,\"start\":49336},{\"attributes\":{\"id\":\"b6\",\"matched_paper_id\":62887703},\"end\":50041,\"start\":49736},{\"attributes\":{\"id\":\"b7\",\"matched_paper_id\":206670736},\"end\":50392,\"start\":50043},{\"attributes\":{\"id\":\"b8\",\"matched_paper_id\":10048449},\"end\":50709,\"start\":50394},{\"attributes\":{\"id\":\"b9\",\"matched_paper_id\":125529707},\"end\":50980,\"start\":50711},{\"attributes\":{\"id\":\"b10\",\"matched_paper_id\":4601561},\"end\":51372,\"start\":50982},{\"attributes\":{\"id\":\"b11\",\"matched_paper_id\":209749746},\"end\":51907,\"start\":51374},{\"attributes\":{\"doi\":\"10.1109/TCYB.2019.2944892\",\"id\":\"b12\",\"matched_paper_id\":204832707},\"end\":52312,\"start\":51909},{\"attributes\":{\"doi\":\"10.1109/TCST.2020.2974146\",\"id\":\"b13\",\"matched_paper_id\":213880836},\"end\":52755,\"start\":52314},{\"attributes\":{\"id\":\"b14\",\"matched_paper_id\":14183894},\"end\":53103,\"start\":52757},{\"attributes\":{\"id\":\"b15\",\"matched_paper_id\":113988989},\"end\":53720,\"start\":53105},{\"attributes\":{\"id\":\"b16\",\"matched_paper_id\":35004283},\"end\":54014,\"start\":53722},{\"attributes\":{\"id\":\"b17\",\"matched_paper_id\":5469972},\"end\":54230,\"start\":54016},{\"attributes\":{\"id\":\"b18\",\"matched_paper_id\":22428889},\"end\":54494,\"start\":54232},{\"attributes\":{\"id\":\"b19\",\"matched_paper_id\":11318341},\"end\":54845,\"start\":54496},{\"attributes\":{\"id\":\"b20\",\"matched_paper_id\":113314627},\"end\":55433,\"start\":54847},{\"attributes\":{\"id\":\"b21\",\"matched_paper_id\":206659912},\"end\":55789,\"start\":55435},{\"attributes\":{\"id\":\"b22\",\"matched_paper_id\":155980491},\"end\":56140,\"start\":55791},{\"attributes\":{\"id\":\"b23\",\"matched_paper_id\":18810104},\"end\":56406,\"start\":56142},{\"attributes\":{\"id\":\"b24\",\"matched_paper_id\":125195443},\"end\":56770,\"start\":56408},{\"attributes\":{\"id\":\"b25\",\"matched_paper_id\":59414150},\"end\":57120,\"start\":56772},{\"attributes\":{\"id\":\"b26\",\"matched_paper_id\":52122816},\"end\":57659,\"start\":57122},{\"attributes\":{\"id\":\"b27\",\"matched_paper_id\":61340500},\"end\":57922,\"start\":57661},{\"attributes\":{\"id\":\"b28\",\"matched_paper_id\":2745489},\"end\":58278,\"start\":57924},{\"attributes\":{\"id\":\"b29\",\"matched_paper_id\":213011041},\"end\":58583,\"start\":58280},{\"attributes\":{\"id\":\"b30\",\"matched_paper_id\":51669163},\"end\":58906,\"start\":58585},{\"attributes\":{\"id\":\"b31\"},\"end\":59084,\"start\":58908},{\"attributes\":{\"id\":\"b32\",\"matched_paper_id\":3796425},\"end\":59468,\"start\":59086},{\"attributes\":{\"id\":\"b33\"},\"end\":59621,\"start\":59470},{\"attributes\":{\"id\":\"b34\",\"matched_paper_id\":67936146},\"end\":59955,\"start\":59623},{\"attributes\":{\"id\":\"b35\",\"matched_paper_id\":15758087},\"end\":60267,\"start\":59957}]", "bib_title": "[{\"end\":47720,\"start\":47640},{\"end\":48064,\"start\":47992},{\"end\":48365,\"start\":48278},{\"end\":48657,\"start\":48570},{\"end\":49025,\"start\":48978},{\"end\":49456,\"start\":49336},{\"end\":49817,\"start\":49736},{\"end\":50125,\"start\":50043},{\"end\":50470,\"start\":50394},{\"end\":50783,\"start\":50711},{\"end\":51101,\"start\":50982},{\"end\":51478,\"start\":51374},{\"end\":51996,\"start\":51909},{\"end\":52408,\"start\":52314},{\"end\":52865,\"start\":52757},{\"end\":53223,\"start\":53105},{\"end\":53778,\"start\":53722},{\"end\":54071,\"start\":54016},{\"end\":54318,\"start\":54232},{\"end\":54586,\"start\":54496},{\"end\":54975,\"start\":54847},{\"end\":55522,\"start\":55435},{\"end\":55885,\"start\":55791},{\"end\":56193,\"start\":56142},{\"end\":56486,\"start\":56408},{\"end\":56885,\"start\":56772},{\"end\":57201,\"start\":57122},{\"end\":57741,\"start\":57661},{\"end\":58007,\"start\":57924},{\"end\":58372,\"start\":58280},{\"end\":58663,\"start\":58585},{\"end\":59195,\"start\":59086},{\"end\":59728,\"start\":59623},{\"end\":60042,\"start\":59957}]", "bib_author": "[{\"end\":47731,\"start\":47722},{\"end\":47743,\"start\":47731},{\"end\":47753,\"start\":47743},{\"end\":47761,\"start\":47753},{\"end\":47767,\"start\":47761},{\"end\":48081,\"start\":48066},{\"end\":48094,\"start\":48081},{\"end\":48373,\"start\":48367},{\"end\":48673,\"start\":48659},{\"end\":48686,\"start\":48673},{\"end\":48696,\"start\":48686},{\"end\":48709,\"start\":48696},{\"end\":49037,\"start\":49027},{\"end\":49051,\"start\":49037},{\"end\":49464,\"start\":49458},{\"end\":49473,\"start\":49464},{\"end\":49480,\"start\":49473},{\"end\":49830,\"start\":49819},{\"end\":49842,\"start\":49830},{\"end\":49853,\"start\":49842},{\"end\":50134,\"start\":50127},{\"end\":50142,\"start\":50134},{\"end\":50154,\"start\":50142},{\"end\":50160,\"start\":50154},{\"end\":50168,\"start\":50160},{\"end\":50479,\"start\":50472},{\"end\":50490,\"start\":50479},{\"end\":50791,\"start\":50785},{\"end\":50799,\"start\":50791},{\"end\":50806,\"start\":50799},{\"end\":51110,\"start\":51103},{\"end\":51117,\"start\":51110},{\"end\":51123,\"start\":51117},{\"end\":51129,\"start\":51123},{\"end\":51490,\"start\":51480},{\"end\":51502,\"start\":51490},{\"end\":51511,\"start\":51502},{\"end\":51525,\"start\":51511},{\"end\":51534,\"start\":51525},{\"end\":52005,\"start\":51998},{\"end\":52011,\"start\":52005},{\"end\":52021,\"start\":52011},{\"end\":52029,\"start\":52021},{\"end\":52036,\"start\":52029},{\"end\":52422,\"start\":52410},{\"end\":52432,\"start\":52422},{\"end\":52443,\"start\":52432},{\"end\":52878,\"start\":52867},{\"end\":52891,\"start\":52878},{\"end\":53238,\"start\":53225},{\"end\":53250,\"start\":53238},{\"end\":53263,\"start\":53250},{\"end\":53285,\"start\":53263},{\"end\":53304,\"start\":53285},{\"end\":53787,\"start\":53780},{\"end\":53795,\"start\":53787},{\"end\":53803,\"start\":53795},{\"end\":53809,\"start\":53803},{\"end\":54083,\"start\":54073},{\"end\":54331,\"start\":54320},{\"end\":54599,\"start\":54588},{\"end\":54986,\"start\":54977},{\"end\":54996,\"start\":54986},{\"end\":55005,\"start\":54996},{\"end\":55020,\"start\":55005},{\"end\":55532,\"start\":55524},{\"end\":55543,\"start\":55532},{\"end\":55550,\"start\":55543},{\"end\":55894,\"start\":55887},{\"end\":55903,\"start\":55894},{\"end\":55910,\"start\":55903},{\"end\":56207,\"start\":56195},{\"end\":56217,\"start\":56207},{\"end\":56225,\"start\":56217},{\"end\":56494,\"start\":56488},{\"end\":56501,\"start\":56494},{\"end\":56508,\"start\":56501},{\"end\":56515,\"start\":56508},{\"end\":56522,\"start\":56515},{\"end\":56898,\"start\":56887},{\"end\":57221,\"start\":57203},{\"end\":57242,\"start\":57221},{\"end\":57261,\"start\":57242},{\"end\":57282,\"start\":57261},{\"end\":57290,\"start\":57282},{\"end\":57754,\"start\":57743},{\"end\":58029,\"start\":58009},{\"end\":58047,\"start\":58029},{\"end\":58382,\"start\":58374},{\"end\":58389,\"start\":58382},{\"end\":58675,\"start\":58665},{\"end\":58684,\"start\":58675},{\"end\":58692,\"start\":58684},{\"end\":58916,\"start\":58908},{\"end\":58932,\"start\":58916},{\"end\":59205,\"start\":59197},{\"end\":59212,\"start\":59205},{\"end\":59223,\"start\":59212},{\"end\":59484,\"start\":59472},{\"end\":59503,\"start\":59484},{\"end\":59739,\"start\":59730},{\"end\":59746,\"start\":59739},{\"end\":60052,\"start\":60044},{\"end\":60059,\"start\":60052}]", "bib_venue": "[{\"end\":47785,\"start\":47767},{\"end\":48112,\"start\":48094},{\"end\":48395,\"start\":48373},{\"end\":48742,\"start\":48709},{\"end\":49100,\"start\":49051},{\"end\":49505,\"start\":49480},{\"end\":49863,\"start\":49853},{\"end\":50186,\"start\":50168},{\"end\":50523,\"start\":50490},{\"end\":50819,\"start\":50806},{\"end\":51147,\"start\":51129},{\"end\":51575,\"start\":51534},{\"end\":52079,\"start\":52061},{\"end\":52516,\"start\":52468},{\"end\":52904,\"start\":52891},{\"end\":53356,\"start\":53304},{\"end\":53838,\"start\":53809},{\"end\":54101,\"start\":54083},{\"end\":54341,\"start\":54331},{\"end\":54629,\"start\":54599},{\"end\":55078,\"start\":55020},{\"end\":55583,\"start\":55550},{\"end\":55935,\"start\":55910},{\"end\":56247,\"start\":56225},{\"end\":56540,\"start\":56522},{\"end\":56920,\"start\":56898},{\"end\":57336,\"start\":57290},{\"end\":57774,\"start\":57754},{\"end\":58073,\"start\":58047},{\"end\":58399,\"start\":58389},{\"end\":58718,\"start\":58692},{\"end\":58951,\"start\":58932},{\"end\":59248,\"start\":59223},{\"end\":59756,\"start\":59746},{\"end\":60082,\"start\":60059},{\"end\":49159,\"start\":49102},{\"end\":51638,\"start\":51577},{\"end\":53417,\"start\":53358},{\"end\":54668,\"start\":54631},{\"end\":55146,\"start\":55080},{\"end\":57392,\"start\":57338},{\"end\":58968,\"start\":58953}]"}}}, "year": 2023, "month": 12, "day": 17}