{"id": 231743806, "updated": "2022-08-05 19:16:26.07", "metadata": {"title": "Validity and Reliability of the Scale Internet Users’ Information Privacy Concerns (IUIPC)", "authors": "[{\"first\":\"Thomas\",\"last\":\"Groß\",\"middle\":[]}]", "venue": "Proceedings on Privacy Enhancing Technologies", "journal": "Proceedings on Privacy Enhancing Technologies", "publication_date": {"year": 2021, "month": null, "day": null}, "abstract": ": Internet Users’ Information Privacy Concerns (IUIPC-10) is one of the most endorsed privacy concern scales. It is widely used in the evaluation of human factors of PETs and the investigation of the privacy paradox. Even though its predecessor Concern For Information Privacy (CFIP) has been evaluated independently and the instrument itself seen some scrutiny, we are still missing a dedicated conﬁrmation of IUIPC-10, itself. We aim at closing this gap by systematically analyz-ing IUIPC’s construct validity and reliability. We obtained three mutually independent samples with a total of N = 1031 participants. We conducted a conﬁrmatory factor analysis (CFA) on our main sample to assert the validity and reliability of IUIPC-10. Having found weaknesses, we proposed a respeciﬁed instrument IUIPC-8 with improved psychometric properties. Finally, we conﬁrmed our ﬁndings on a validation sample. While we found sound foundations for content validity and could conﬁrm the overall three-dimensionality of IUIPC-10, we observed evidence of biases in the question wording and found that IUIPC-10 consistently missed the mark in evaluations of construct validity and reliability, call-ing into question the unidimensionality of its sub-scales Awareness and Control. Our respeciﬁed scale IUIPC-8 oﬀers a statistically signiﬁcantly better model and out-performs IUIPC-10’s construct validity and reliability. The disconﬁrming evidence on IUIPC-10’s construct validity raises doubts how well it measures the latent variable Information Privacy Concern. The less than desired reliability could yield spurious and erratic results as well as attenuate relations with other latent variables, such as behavior. Thereby, the instrument could confound studies of human factors of PETs or the privacy paradox, in general.", "fields_of_study": "[\"Computer Science\"]", "external_ids": {"arxiv": null, "mag": null, "acl": null, "pubmed": null, "pubmedcentral": null, "dblp": "journals/popets/Gross21", "doi": "10.2478/popets-2021-0026"}}, "content": {"source": {"pdf_hash": "bf6e145b618db2521c61f233a6492715779227df", "pdf_src": "ScienceParsePlus", "pdf_uri": null, "oa_url_match": false, "oa_info": {"license": "CCBYNCND", "open_access_url": "https://www.sciendo.com/pdf/10.2478/popets-2021-0026", "status": "HYBRID"}}, "grobid": {"id": "2c9716b9e4a3c4d01daf6b83cfa824f5674e18fa", "type": "plain-text", "url": "s3://ai2-s2-pdf-extraction-prod/parse-results/s2orc_worker/bf6e145b618db2521c61f233a6492715779227df.txt", "contents": "\nValidity and Reliability of the Scale Internet Users' Information Privacy Concerns (IUIPC)\n\n\nThomas Groß thomas.gross@newcastle.ac.uk \nValidity and Reliability of the Scale Internet Users' Information Privacy Concerns (IUIPC)\n\nProceedings on Privacy Enhancing Technologies\n2021210.2478/popets-2021-0026*Corresponding Author: Thomas Groß: Newcastle Uni-versity,IUIPCprivacy concernmeasurement in- strumentvalidityreliabilityfactor structure\nInternet Users' Information Privacy Concerns (IUIPC-10) is one of the most endorsed privacy concern scales. It is widely used in the evaluation of human factors of PETs and the investigation of the privacy paradox. Even though its predecessor Concern For Information Privacy (CFIP) has been evaluated independently and the instrument itself seen some scrutiny, we are still missing a dedicated confirmation of IUIPC-10, itself. We aim at closing this gap by systematically analyzing IUIPC's construct validity and reliability. We obtained three mutually independent samples with a total of N = 1031 participants. We conducted a confirmatory factor analysis (CFA) on our main sample to assert the validity and reliability of IUIPC-10. Having found weaknesses, we proposed a respecified instrument IUIPC-8 with improved psychometric properties. Finally, we confirmed our findings on a validation sample. While we found sound foundations for content validity and could confirm the overall three-dimensionality of IUIPC-10, we observed evidence of biases in the question wording and found that IUIPC-10 consistently missed the mark in evaluations of construct validity and reliability, calling into question the unidimensionality of its sub-scales Awareness and Control. Our respecified scale IUIPC-8 offers a statistically significantly better model and outperforms IUIPC-10's construct validity and reliability. The disconfirming evidence on IUIPC-10's construct validity raises doubts how well it measures the latent variable Information Privacy Concern. The less than desired reliability could yield spurious and erratic results as well as attenuate relations with other latent variables, such as behavior. Thereby, the instrument could confound studies of human factors of PETs or the privacy paradox, in general.\n\nIntroduction\n\nSound measurement instruments are a key ingredient in the investigation of privacy concern and its impact on human behavior. They act as a measuring stick for privacy concern itself as well as a foundational component for substantive composite models. Thereby, they are a crucial keystone in evaluating human factors of PETs and studying the privacy paradox.\n\nWhile there has been a diversification of instruments of privacy concern and behaviors [6,7,9,30,34,40,43] also documented in systematic reviews on the privacy paradox [13,26], Internet Users' Information Privacy Concerns (IUIPC) [30] stands out as a widely adopted scale diligently created in an evolutionary fashion and with a sound theoretical underpinning.\n\nIUIPC is based on Concerns for Information Privacy (CFIP) [40], itself a popular scale measuring organizational information privacy concern, which has been validated in independent empirical studies [18,41]. Both CFIP and IUIPC scales have been endorsed by Preibusch [34] as sound instruments.\n\nWe are interested in IUIPC-10, a 10-item privacy concern scale with the three dimensions Control, Awareness, and Collection. Our interest is rooted in its strong pedigree and its wide-spread use in the investigation of human factors of PETs and of the privacy paradox. While it has seen some scrutiny as part of other studies [32,38] and questions of its validity have become apparent, there has not yet been a dedicated confirmatory factor analysis to assess its validity and reliability.\n\nWe aim at two complementary research questions: (i) First, we investigate to what extent the the validity and reliability of IUIPC-10 can be confirmed. (ii) Second, we consider under which circumstances IUIPC-10 can be employed most reliably, considering the estimation method used. The latter line of inquiry is motivated by design decisions made by Malhotra et al. [30], which are at odds with contemporary recommendations for a sound CFA methodology [5,11,24]. Hence, we thereby aim at ruling out possible confounders of our direct replication and at offering empirically grounded recommendations derived from our conceptual replications on how to best use IUIPC.\n\n\nOur Contributions.\n\nTo the best of our knowledge, we established the first dedicated adequately-sized registered independent confirmatory factor analysis of IUIPC-10. We, thereby, offer the first comprehensive disconfirming evidence of the construct validity and reliability of this scale, with wide implications for studies measuring information privacy concern in their endeavor to evaluate the users attitude to PETs or to study the privacy paradox overall. While we found sound foundations in content validity and could confirm the overall three-dimensionality of the scale, we found indications of biases in its questionnaire wording and weaknesses in factorial and convergent validity as well as reliability, especially rooted the sub-scales Control and Awareness. Those weaknesses appeared consistently across our independent samples and irrespective of CFA estimators used. We propose a respecified scale IUIPC-8 that consistently offers a statistically significantly better fit, stronger construct validity and reliability. In terms of analysis methodology, we build a bridge between replicating the exact design decisions of Malhotra et al. [30] to factor analyses especially adept on non-normal, ordinal data following contemporary recommendations [25].\n\n\nBackground\n\n\nInformation Privacy Concern\n\nIn defining information privacy concern we focus on the conceptual framework of IUIPC. Malhotra et al. [30, p. 337] refer to Westin's definition of information privacy as a foundation of their understanding of privacy concern: \"the claim of individuals, groups, or institutions to determine for them selves when, how, and to what extent information about them is communicated to others.\" Information privacy concern is then defined as \"an individual's subjective views of fairness within the context of information privacy.\"\n\nThis framing of information privacy concern is well aligned with the interdisciplinary review of privacy studies by Smith et al. [39], which considered privacy concern as the central antecedent of related behavior in their privacy macro model. Of course, the causal impact of privacy concern on behavior has been under considerable scrutiny with the observation of the privacy attitude-behavior dichotomy-the privacy paradox [13]. The intense inquiry of the privacy community into the paradox calls for measuring information privacy con-cern accurately and reliably. This conviction is rooted in the fact that measurement errors could confound the assessment of users' privacy concern and, thereby, yield an alternative explanation for the privacy paradox: If one does not actually measure privacy concern reliably, it is hardly expected to align with exhibited behavior.\n\nThere has been a proliferation of related and distinct instruments for measuring information privacy concern. As a comprehensive comparison would be beyond the scope of this study, we refer to Preibusch's excellent guide to measuring privacy concern [34] for an overview of the field and shall focus on specific comparisons to IUIPC itself. First, we mention Concern for information privacy (CFIP) [40] a major influence on IUIPC. It consists of four dimensions-Collection, Unauthorized Secondary Use, Improper Access and Errors. While both questionnaires share questions, CFIP focuses on individuals' concerns about organizational privacy practices and the organization's responsibilities, IUIPC shifts this focus to Internet users framed as consumers and their perception of fairness and justice in the context of information privacy and online companies.\n\nInternet Privacy Concerns (IPC) [9] considered internet privacy concerns with antecedents of perceived vulnerability and control, antecedents familiar from the Protection Motivation Theory (PMT). In terms of the core scale of privacy concern, Dinev and Hart identified two factors (i) Abuse (concern about misuse of information submitted on the Internet) and (ii) Finding (concern about being observed and specific private information being found out). IPC differs from IUIPC in its focus on misuse rather than just collection of information and of concerns of surveillance.\n\nBuchanan et al.'s Online Privacy Concern and Protection for Use on the Internet (OPC) [7] measure considered three sub-scales-General Caution, Technical Protection (both on behaviors), and Privacy Attitude. Compared to IUIPC, OPC sports a strong focus on item stems eliciting being concerned and on measures through a range of concrete privacy risks. The authors considered concurrent validity with IUIPC, observing a correlation of r = .246 between OPC's privacy concern and the total IUIPC score.\n\nCFIP, IPC and OPC have in common that-unlike IUIPC-they do not explicitly mention the loaded word \"privacy.\"\n\n\nGenesis of IUIPC\n\nThe scale Internet Users' Information Privacy Concern (IUIPC) was developed by Malhotra et al. [30], by predominately adapting questions of the earlier 15-item scale Concern for Information Privacy (CFIP) by Smith et al. [40] and by framing the questionnaire for Internet users. CFIP received independent empirical confirmations of its factor structure, first by Stewart and Segars [41], but also by Harborth and Pape [18] on its German translation.\n\nMalhotra et al. [30, pp. 338] conceived IUIPC-10 as a second-order reflective scale of information privacy concern, with the dimensions Control, Awareness, and Collection. The authors considered the \"act of collection, whether it is legal or illegal,\" as the starting point of information privacy concerns. The sub-scale Control is founded on the conviction that \"individuals view procedures as fair when they are vested with control of the procedures.\" Finally, they considered being \"informed about data collection and other issues\" as central concept to the sub-scale Awareness. The authors developed IUIPC in exploratory and confirmatory factor analysis, which we shall review systematically in Section 6.\n\n\nThe Role of Privacy Concern Scales in the Investigation of PETs\n\nThe role of privacy concern scales in the investigation of the privacy paradox was well documented in the Systematic Literature Review by Gerber et al. [13]: More than a dozen studies used privacy concern as variable. For instance, Schwaig et al. [37] used IUIPC as instrument in their privacy paradox study. On human factors of PETs, we have the, e.g., technology acceptance of Tor/JonDonym [21] and anonymous credentials [4]. While these two studies used \"perceived anonymity\" as a three-item scale, subsequent work by Harborth and Pape used IUIPC as privacy concern scale to evaluate JonDonym [19] and Tor [20].\n\nFurthermore, IUIPC has not only been used in the narrow sense of evaluating the privacy paradox or PETs. Let us highlight a few examples in PoPETS: Pu and Grossklags [35] used a scale adopted from IUIPC Collection (or one of its predecessors) to measure own and friends' privacy concern in their study social app users' valuation of interdependent privacy. Gerber et al. [14] used IUIPC to contextualize their investigation on privacy risk perception. Barbosa et al. [3] used IUIPC as main privacy measure to predict changes in smart home device use.\n\nGiven that Smith et al.'s privacy macro model [39] centered on privacy concern as antecedent of behavior and that Preibusch [34] recommended IUIPC as a \"safe bet,\" it is not surprising that IUIPC is high on the list of instruments to analyze privacy paradox or PETs. Thereby, we would expect prolific use of IUIPC in future privacy research and perceive a strong need to substantiate the evidence of its construct validity and reliability.\n\n\nValidity and Reliability\n\nWhen evaluating privacy concern instruments, the dual key questions for privacy researchers interested in the investigation of the human factors of PETs and the privacy paradox are: (i) Are we measuring the hidden latent construct Privacy concern accurately? (validity) (ii) Are we measuring privacy concern consistently and with an adequate signal-to-noise ratio? (reliability)\n\nValidity refers to whether an instrument measures what it purports to measure. Messick offered an early well-regarded definition of validity as the \"integrated evaluative judgment of the degree to which empirical evidence and theoretical rationales support the adequacy and appropriateness of inferences and actions based on test scores\" [31]. Validity is inferred-judged in degrees-not measured. In our work, we take a pragmatic empiricist's approach focusing on the validation procedure and evidence.\n\n\nContent Validity\n\nContent validity refers to the relevance and representativeness of the content of the instrument, typically assessed by expert judgment. We shall evaluate content validity together in keeping with evidence on the craft of the questionnaire design, incl. question format, language used, question order, and, hence, assess psychometric barriers in the form of biases rooted in the questionnaire wording [33, p. 128]. Priming: Priming means that mentioning a concept activates it in respondents minds and makes it more easily accessible in subsequent questions. Priming is, for instance, created by the use of a loaded word such as \"security.\" It can invoke the respondents' social desirability bias.\n\nLeading Questions: Leading questions elicit agreement or specific instances of a general term, introduce a bias towards that lead. Double-Barreled Questions: Double-barreled questions consist of two or more questions or clauses, making it difficult for the respondent to decide what to answer to, causing nondifferentiated responses. Positively-Oriented Questions: Exclusively using positively framed wording for questions leads to nondifferentiation/straightlining and, thereby, to accommodating the acquiescent response bias.\n\n\nConstruct Validity\n\nFirst, we seek evidence of factorial validity, that is, evidence that that factor composition and dimensionality are sound. While IUIPC is a multidimensional scale with three correlated designated dimensions, we require unidimensionality of each sub-scale, a requirement discussed at length by Gerbing and Anderson [15]. The empirical evidence for factorial validity is the found in the adequacy of the hypothesized model's fit and passing the corresponding fit hypotheses of a confirmatory factor analysis for the designated factor structure [2,15,25]. Specifically, we prioritize the following fit metrics and hypotheses, refering the interested reader to Appendix C for further explanations: Goodness-of-Fit χ 2 : Measures the exact fit of a model and gives rise to the accept-support exactfit test against null hypothesis H χ 2 ,0 . RMSEA: Root Mean Square Estimate of Approximation, an absolute badness-of-fit measure estimated asε with its 90% confidence interval, yielding a range of fit-tests: close fit, not-close fit, and poor fit with decreasing tightness requirements. Further common criteria, such as CFI or SRMR, are defined in Appendix C.\n\nConvergent validity [17, pp. 675] (convergent coherence) on an item-construct level means that items belonging together, that is, to the same construct, should be observed as related to each other. Similarly, discriminant validity [17, pp. 676] (discriminant distinctiveness) means that items not belonging together, that is, not belonging to the same construct, should be observed as not related to each other. Similarly, on a sub-scale level, we expect factors of the same higher-order construct to relate to each other and, on hierarchical factor level, we expect all 1 st -order factors to load strongly on the 2 nd -order factor. While a poor local fit and tell-tale residual patterns yield disconfirming evidence for convergent and discriminant validity, further evidence is found evidence interitem correlation matrices. We expect items belonging to the same sub-scale to be highly correlated (converge on the same construct). At the same time correlation to items of other sub-scales should be low, especially lower than the in-construct correlations [25, pp. 196].\n\nThese judgments are substantiated with empirical criteria, where we highlight the following metrics: Standardized Factor Loadings β: Z-transformed factor scores, typically reported in factor analysis. Variance Extracted R 2 : The factor variance accounted for, giving rise to the Average Variance Extracted (AVE) defined subsequently in reliability Section 2.2.3.\n\n\nHeterotrait-Monotrait Ratio (HTMT): The\n\nHeterotrait-Monotrait Ratio is the ratio of the the avg. correlations of indicators across constructs measuring different phenomena to the avg. correlations of indicators within the same construct [22]. We gain empirical evidence in favor of convergent validity [17, pp. 675 [12]), (ii) if the Heterotrait-Monotrait Ratio (HTMT) is less than .85 [1,22].\n\n\nReliability\n\nReliability is the extent to which a variable is consistent in what is being measured [17, p. 123]. It can further be understood as the capacity of \"separating signal from noise\" [36, p. 709], quantified by the ratio of true score to observed score variance. [25, pp. 90] We evaluate internal consistency as a means to estimate reliability from a single test application. Internal consistency entails that items that purport to measure the same construct produce similar scores [25, p. 91]. We will use the following internal consistency measures: Cronbach's α: Is based on the average inter-item correlations. Congeneric Reliability ω: The amount of general factor saturation (also called composite reliabil-ity [25, pp. 313] or construct reliability (CR) [17, p. 676] depending on the source). AVE: Average Variance Extracted (AVE) [25, pp. 313] is the average of the squared standardized loadings of indicators belonging to the same factor. Thresholds for reliability estimates like Cronbach's α or Composite Reliability ω are debated in the field, where many recommendations are based on Nunnally's original treatment of the subject, but equally often misstated [27]. The often quoted α ≥ .70 was described by Nunnally only to \"save time and energy,\" whereas a greater threshold of .80 was endorsed for basic research [27]. While that would be beneficial for privacy research as well, we shall adopt reliability metrics α, ω ≥ .70 as suggested by Hair et al. [17, p. 676]. We further require AVE > .50.\n\n\nFactor Analysis as Validation Tool\n\nFactor analysis is an excellent tool to establish construct validity and reliability of an instrument. We introduce factor analysis concepts in the Appendix C and assume knowledge of the standard factor analysis with Maximum Likelihood estimation. Here we shall only mention properties of estimators MLM and robust WLS, developed to handle non-normal, ordinal data.\n\nA maximum-likelihood estimation with robust standard errors and Satorra-Bentler scaled test statistic (MLM) is robust against some deviations from normality [24, p. 122]. Lei and Wu [28, p. 172] submit that Likert items with more than five points approximate continuous measurement enough to use MLM; this stance, however, is not universally endorsed [5,11].\n\nKline recommends to use of estimators specializing on ordinal data [24, p. 122], such as robust weighted least squares (WLSMVS 1 ). The following explanation summarizes Kline [25, pp. 324]. In general, robust WLS methods associate each indicator with a latent response variable for which the method estimates thresholds that relate the ordinal responses on the indicator to a continuous distribution on the indicator's latent response variable. Then, the measurement model is evaluated with the latent response variables as indicators, while optimizing to approximate the observed polychoric correlations between the original indicator variables. In addition, the method will compute robust standard errors and corrected test statistics. Because the method also needs to estimate the thresholds, the number of free parameters will be greater than in a comparable ML estimation. Reported estimates and R 2 relate to the latent response variable, not the original indicators themselves.\n\nBecause of the level of indirection and the estimation of non-linearly related thresholds, robust WLS is a quite different kettle of fish than Maximum Likelihood estimation on assumedly continuous variables: they are not easily compared by trivially examining fit indices. The estimates of robust WLS need to be interpreted differently than in ML: they are the probit of individuals' response to an indicator instead of a linear change in an indicator [5]. The thresholds show what factor score is necessary for the respective option of an indicator or higher to be selected with 50% probability.\n\nThe advantages and disadvantages of robust WLS have been carefully evaluated in simulation studies with known ground truth [10,29]: (i) Robust WLS models show little bias in the parameter estimation even es the level of skewness and kurtosis increased. Unlike ML models, do not suffer from out-of-bounds estimations of indicator variables. (ii) There is contradictory evidence on standard errors, where robust WLS may be subject to greater amounts of bias. (iii) χ 2 fit indices of robust WLS are inflated for larger models or smaller samples. (iv) Robust WLS may inflate correlation estimates.\n\n\nRelated Work\n\nSipior et al. [38] observed that IUIPC was under-studied at the time, offered a considerate review of the related literature, and focused their lens on the role of trusting and risk beliefs in IUIPC's causal model. With the caveat of being executed on a small sample of N = 63 students, their research could \"not confirm the use of the IUIPC construct to measure information privacy concerns.\" Even though they also excluded one Control item, their concerns, however, were mostly focused on the causal structure of IUIPC and not on the soundness of the underlying measurement model of IUIPC-10. Our study goes beyond Sipior et al.'s by evaluating the heart of IUIPC, that is, its measurement model, and by doing so in adequately sized confirmatory factor analyses.\n\nMorton [32, p. 472] conducted an adequately sized exploratory factor analysis of IUIPC-10 (N = 353) as part of his pilot study for the development of the scale on Dispositional Privacy Concern (DPC). He observed a misloading of the item we call awa3 between the di-mensions Awareness and Control in that EFA. He chose to exclude from IUIPC-10 the two items we call ctrl3 and awa3. Even though not highlighted as a main point of the paper, Morton's EFA raised concerns on the validity and factor structure of IUIPC-10. Our analysis differs from Morton's by employing confirmatory factor analysis poised to systematically establish construct validity, by offering a wide range of diagnostics beyond the factor loadings and by re-confirming our analyses on an independent validation sample. While Morton's pilot EFA largely yields statements on his sample, our analysis is a pre-registered confirmatory study yields at results holding generally for the instrument itself and irrespective of estimation methods used.\n\nTo the best of our knowledge, the validity and reliability of IUIPC-10 have not undergone an adequately sized dedicated independent analysis, to date. As a starting point for that inquiry, we offer a detailed evaluation of the original IUIPC-10 scale in Section 6.\n\n\nAims\n\n\nConception and Content Validity\n\nWe are interested in the roots of IUIPC, especially its content validity and its reported psychometric properties at its conception.\n\n\nRQ 1 (Content Validity of IUIPC).\n\nWhat are the qualitative properties of IUIPC's content validity, that is, relevance and representativeness of the content in the instrument.\n\n\nConstruct Validity and Reliability\n\nOur main goal is an independent confirmation of the IUIPC-10 instrument by Malhotra et al. [30], where we focus on construct validity and reliability.\n\n\nRQ 2 (Confirmation of IUIPC). To what extent can we confirm IUIPC-10's construct validity and reliability?\n\nThis aim largely entails confirming the factorial validity, that is, the three-dimensional factor structure, of IUIPC. The first inquiry there is to compare alternative models of the IUIPC with different factor solutions.\n\nSecond, we will gather further evidence for factorial validity by seeking to fit IUIPC-10 hypothesized second-order model, where the unidimensionality of its sub-scales, that is, the absence of cross-loadings is a key consideration. This will be tested with statistical inferences on the models global fit based on the statistical hypotheses introduced in Appendix C indicating increasingly worse approximations: 10,0 ). We further evaluated the combination rule used by Malhotra et al. [30]: (i) CFI > .95, (ii) GFI > .90, (iii) RMSEA < .06. This global fit analysis will be complemented by an assessment of local fit on residuals.\n(i) Exact Fit (H χ 2 ,0 ), (ii) Close Fit (H ε0≤.05,0 ), (iii) Not Close Fit (H ε0≥.05,0 ), (iv) Poor Fit (H ε0≥.\nThis inquiry is complemented by analyses of convergent and discriminant validity on the criteria established in Section 2.2.2 similarly to analyses of internalconsistency reliability on criteria from Section 2.2. 3 Overall, the aim of evaluating the construct validity and reliability of IUIPC-10 is not just about a binary judgment, but a fine-grained diagnosis of possible problems and viable improvements. This wealth of evidence to enable privacy researchers to form their own opinions.\n\n\nEstimator Appraisal\n\nAs second line of inquiry, we considered multiple estimation methods in conceptual replications shown in Figure 1 on the horizontal axis.\n\n\nRQ 3 (Estimator Invariance). To what extent do the confirmation results in regards to RQ 2 hold irrespective of the estimator used?\n\nFor that, we expect the statistical hypotheses of RQ 2 to yield the same outcome across estimation methods. For respecifications, we expect the fit indices (especially CFI and CAIC) to show appreciable improvements comparing the models on their respective estimators shown in Figure 1 on the vertical axis.\n\nIn addition, we aim at gaining an empirical underpinning to design decisions made in the field with respect to the methodological setup of CFAs and SEMs with IUIPC and similar scales.\n\n\nRQ 4. Which estimator is most viable to create models with IUIPC, measured in ordinal 7-point Likert items?\n\nWe aim at investigating the viability of alternatives to the maximum likelihood (ML) estimation: (i) scaled estimation (MLM) and (ii) estimation specializing on ordinal variables (robust WLS). As discussed in Section C, robust WLS is a far cry from ML/MLM estimation.\n\nHence, a plain comparison on their fit indices, such as on the consistent Akaike Information Criteria (CAIC), may lead us astray: their fit measures are not directly comparable in a fair manner.\n\nThereby, the question becomes: Are the respective estimations viable in their own right, everything else being equal? To what extent do the estimators offer us a plausible approximation of IUIPC? For these questions we aim at estimating mean structures throughout such that we can assess their first-order predictions on indicators. Without knowing the ground truth of the true IUIPC scores of our samples, the assessment on what estimator is most viable will be largely qualitative.\n\n\nMethod\n\nThe project was registered on the Open Science Framework 2 . The OSF project contains the registration of the study as well as technical supplementary materials, incl. R covariance matrices and related data needed to reproduce the ML-and MLM-estimated CFAs. There is a comprehensive arXiv report with supplementary materials [16]. The statistics were computed in R largely using the package lavaan, where graphs and tables were largely produced with knitr. The significance level was set to α = .05.\n\n\nEthics\n\nThe ethical requirements of the host institution were followed and ethics cases registered. Participants were recruited under informed consent. They could withdraw from the study at any point. They were enabled to ask questions about the study to the principal investigator. They agreed to offer their demographics (age, gender, mother tongue) as well as the results of the questionnaires for the study. Participants were paid standard rates for Prolific Academic, £12/hour, which is greater than the UK minimum wage of £8.21 during the study's timeframe. The data of participants was stored on encrypted hard disks, their Prolific ID only used to ensure independence of observations and to arrange payment.\n\n\nSample\n\nWe used three independent samples, A, B, V in different stages of the analysis. Auxiliary sample A was collected in a prior study and aimed at a sample size of 200 cases.\n\nBase sample B and validation sample V were collected for a current investigation. They had a designated sample size of 420 each, based on an a priori power analysis for structural equation modeling with RMSEA-based significance tests.\n\nWhile all three samples were recruited on Prolific Academic, B and V were recruited to be representative of the UK census by age and gender. The sampling frame was Prolific users who were registered to be residents of the UK, consisting of 48, 454 users at sampling time. The sampling process was as follows: 1. Prolific presented our studies to all users with matching demographics, 2. the users could choose themselves whether they would participate or not. We prepared to enforce sample independence by uniqueness of the participants' Prolific ID.\n\nWe planned for excluding observations from the sample, without replacement, because (i) observations were incomplete, (ii) observations were duplicates by Prolific ID, (iii) participants failed more than one attention check, (iv) observations constituted multi-variate outliers determined with a Mahalanobis distance of 12 or greater.\n\n\nAnalysis Approach\n\nWe analyzed Malhotra et al.'s original IUIPC publication [30] wrt. RQ 1 with a qualitative review on content validity and with quantitative assessments of construct validity and reliability evidenced at the time. In absence of the original dataset, this analysis was based on the reported descriptives in the publication.\n\nWe bridged between a direct replication of the IUIPC-10 analysis approach and conceptual replications adopting to non-normal, ordinal data. We illustrate the dimensions of our approach in Figure 1. As a direct replication with ML estimation and without distribution or outlier consideration would have exposed this study to unpredictable confounders, we computed our analysis with three estimators ceteris paribus. We computed all models including their mean structures.\n\nWe faced the didactic challenge that even though robust WLS would be best suited for the task at hand [5], it is least used in the privacy community. As discussed in background Section 2.3, its probit estimation is in- terpreted differently to more common ML CFA. Hence, we chose to make the MLM model the primary touch stone for our analysis: It carries the advantages of being robust to moderately skewed non-normal data and of yielding interpretations natural to the community. In our analysis process depicted in Figure 2, we used our three samples deliberately: For the factor analysis of IUIPC-10, we used base Sample B as main dataset to work with. We retained Sample A as an auxiliary sample to conduct exploratory factor analyses and to have respecification proposals informed by more than one dataset, thereby warding against the impact of chance. Sample V was reserved for validation after a final model was chosen. Figure 2 illustrate this relationship of the different samples to analysis stages.\n\nFirst, we established a sound data preparation, including consideration for measurement level and distribution as well as outliers. Second, we computed a covariance-based confirmatory factor analysis on the IUIPC-10 second-order model [30], complemented with alternative one-factor and two-factor models. This comparison served to confirm the three-dimensionality of IUIPC. We evaluated the hypothesized IUIPC-10 model on Sample B, gathering evidence for construct validity in the form of factorial validity evident in global and local fit, convergent and discriminant validity, as well as reliability.\n\nHaving found inconsistencies, we then engaged in a diagnosis and respecification stage. Therein, we also computed a parallel polychoric factor analysis and EFAs on samples A and B to re-assess the three-dimensional factor structure itself and to hunt down patterns of weaknesses. From this evaluation, we prepared a respec-ified IUIPC-8 which was first evaluated on Sample B. We compared the non-nested models of IUIPC-10 and IUIPC-8 with the Vuong Likelihood Ratio Test [42] on the ML estimation. Otherwise, we compared between fit indices, focusing on an evenly weighted CAIC for nonnested comparisons.\n\nFinally, once respecification and design decisions were settled, we entered the CFA validation stage. Therein, we compared the performance of the original IUIPC-10 and the respecified IUIPC-8 on the independent validation Sample V.\n\n\nReview of IUIPC-10\n\nInternet users' information privacy concerns (IUIPC-10) [30] was created in two studies, determining a preliminary factor structure in an EFA on Study 1 (N IUIPC,1 = 293) and confirming it in a LISREL covariance-based ML CFA on Study 2 (N IUIPC,2 = 449). We have asked Malhotra et al. for a dataset or covariance matrix to directly compare against their results. Sung S. Kim [23] was so kind to respond promptly and stated that they could locate these data.\n\n\nContent Validity\n\nThe authors [30, pp. 338] make a compelling and wellargued case for the content relevance of the information privacy concern dimensions of Collection, Control, and Awareness (cf. in Section 2.1.1). Being rooted in Social Contract (SC) theory, the authors focus on one of the key SC principles they quoted as \"norm-generating microsocial contracts must be founded in informed consent, buttressed by rights of exit and voice,\"which, in turn, underpins the respondents perception of fairness of information collection contingent on their granted control and awareness of intended use.\n\nThe questionnaire consisted of ten Likert 7point items anchored on 1=\"Strongly disagree\" to 7=\"Strongly Agree.\" We included the questionnaire in the Materials Appendix A Table 9. In terms of question format, we observe two types of questions present (i) statements of belief or conviction, e.g., \"Consumer control of personal information lies at the heart of consumer privacy.\" (ctrl2) and (ii) statements of concern, e.g., \"It usually bothers me when online companies ask me for personal information.\" (coll1) We would classify ctrl1, ctrl2, awa1 and awa2 as belief statements, the remainder as concern statements. Considering the temporal reference point of the questions, we observe that the questionnaire aims at long-term trait statements, evoked for instance by keywords like \"usually.\" Consequently, we believe IUIPC not to respond strongly to respondents short-term changes in state.\n\nWhen it comes to content relating to psychometric barriers and biases, we find that the questionnaire mentions the loaded word \"privacy\" four times. It further uses loaded words, such as \"autonomy.\" Hence, we expect the questionnaire to exhibit a systematic priming bias and a social desirability bias, leading to a negative skew of measured scores. The priming is aggravated by the question order, in which the loaded words are most predominant in the first three items.\n\nWe find leading questions, too: ctrl3 \"I believe that online privacy is invaded when control is lost or unwillingly reduced as a result of a marketing transaction,\" is a leading question towards thinking about the more specific theme of \"marketing transactions.\" Other questions, such as awa1 \"Companies seeking information online should disclose the way the data are collected, processed, and used.\" induce agreement-why would respondent disagree with such a statement?\n\nTwo items exhibit a double-barreled structure: ctrl3-\"I believe that online privacy is invaded when control (i) is lost or (ii) unwillingly reduced. . . \" We find for awa3-\"It is very important to me that I am (i) aware and (ii) knowledgeable. . . In both cases, we can ask how a participant will answer if only one of the two clauses is fulfilled, or both.\n\nFinally, we find that the questionnaire only contains positively-oriented items. The absence of reverse-coding may lead to nondifferentiation, a risk also observed by Preibusch [34]. This can set up the respondents' acquiescent response bias.\n\n\nSample\n\nThe samples were obtained by \"students in a marketing research class at a large southeastern university in the United States [. . . ] collecting the survey data\" [30, p. 343] from households in the catchment area of the university in one-to-one interviews. No explicit survey population or sampling frame was reported, placing the sampling process in the realm of judgment sampling. While there was no information given how the sam- ple size was determined, the total sample for Study 2 (N IUIPC,2 = 449) was not unreasonable.\n\n\nConstruct Validity\n\n\nAssumptions\n\nIn terms of assumptions and requirements of Maximum Likelihood estimation, the paper did not mention how distribution, univariate and multivariate outliers were handled. Kim [23] clarified that they \"did not check the distribution or outliers\" and that they \"relied on the robustness of maximum likelihood estimation\", a case Bovaird and Koziol [5, p. 497] called \"ignoring ordinality.\" In the field, there are practitioners considering the ML estimator robust enough to handle ordinal data with more than five levels as well as empirical analyses cautioning against this practice [5,11]. We found IUIPC-10 surveys to yield non-normal data with a negative skew throughout, rendering the questionnaire scores less suitable to be covered by ML-robustness results.\n\n\nFactorial Validity\n\nIn terms of global fit as evidence for factorial validity, we outlined the fit measures reported for the original IUIPC instrument [30] in Table 1. Though not reported, we estimated the χ 2 p-value, the RMSEA 90% confidence interval, and p 0≤.05 from the χ 2 test statistic. In terms of statistical inferences, we observed that the original IUIPC model failed the exact-fit test and the not-close fit test (ˆ UL < .05). It passed the the closefit test, poor-fit test and the combination rule (HBR). The authors did not report the model's SRMR.\n\nThe original IUIPC paper did not contain an analysis of residuals. We did not have the data at our disposal to compute it ourselves [23] and could, thereby, not evaluate the local fit. Hence, the evidence for factorial validity was incomplete. Note: Value on the diagonal is the square root of AVE.\n\n\nConvergent and Discriminant Validity\n\nIn the item-level evaluation of convergent validity, we first examined the factor loadings reported for IUIPC. The EFA of IUIPC (of unspecified rotation/transformation) is stated by the authors to have retained items that loaded greater than .70 on their designated factors, and less than .40 on other factors. The CFA of the measurement model was reported to have had a minimal factor loading of .61 for Awareness. Neither a detailed factor loading table was reported, nor standardized loadings or R 2 for individual items. Criteria for AVE and composite reliability were fulfilled, just so for AVE. In terms of discriminant validity, we find that the Fornell-Larcker criterion is violated for Awareness (awa) and Control (ctrl), where the their correlation is greater than the square root of their respective AVE.\n\n\nReliability\n\nConsidering the internal consistency criteria vis-à-vis of Table 2, we find that the Average Variance Extracted criterion AVE > .50 is just so fulfilled, with awareness on the boundary of acceptable. The composite reliability ω is greater than .70 throughout, with coll achieving the best value (.83). The reported reliability is low for AVE but decent for composite reliability.\n\n\nSummary\n\nConcerning RQ 1, content validity is a strong point of IUIPC as the argument on relevance seems compelling. We observed problems in the questionnaire wording that could introduce systematic biases into the scale, though.\n\nConsidering the two-step process with a preliminary EFA and a subsequent CFA, there is an impression that IUIPC has been diligently done. In terms of construct validity, we found that IUIPC reported a satisfactory global fit, while unchecked assumptions, an estimation at odds with non-normal, ordinal data, and the missing information on local fit weakened the case. While evidence of convergent validity was scarce without a factor loading table or standardized loadings to work with, discriminant validity was counter-indicated. Finally, the low-if not disqualifying-AVE in the reliability inquiry will caution privacy researchers to expect an only moderate signal-to-noise ratio (S/R ω between 2.85 and 4.88) and attenuation of effects on other variables.\n\n\nQuantitative Results\n\n\nSample\n\nWe refined the three samples A, B and V in stages, where Table 3 accounts for the refinement process. First, we removed incomplete cases without replacement. Second, we removed duplicates across samples by the participants' Prolific ID. Third, we removed cases in which participants failed more than one attention check (FailedAC > 1). Overall, of the N C = 1074 complete cases, only 5.3% were removed due to duplicates or failed attention checks. The demographics the samples are outlined in Table 4. In samples B and V meant to be UK representative, we found a slight under-representation of elderly participants compared to the UK census age distribution.   \n\n\nDescriptive Statistics\n\nFollowing Kline's guidance on distribution assumptions [25, pp. 74], we found all indicator variables of all samples to be substantively negatively skewed, meaning that there are relatively few small values and that the distribution tails off to the left, with the most extreme skew being −2.09. In general, all indicators apart from coll1 showed a substantive positive kurtosis, that is, peakedness, less than 2.4. While this pattern of substantive non-normality was present in the indicator distributions, we also found it in the IUIPC sub-scales and illustrate these distributions in Table 5 and Figure 3. We observed that the three samples had approximately equal distributions by sub-scales. Our IUIPC-10 samples yielded 5% univariate outliers by the robust outlier labeling rule and 3% multivariate outliers with a Mahalanobis distance of 12 or greater [25, pp. 72].\n\nRegarding the requirements for ML estimation, we find a situation of non-continuous measurement in which multi-variate normality is violated. Our data preparation handled the outliers as recommended. \n\n\nConstruct Validity\n\n\nFactorial Validity\n\nTo confirm the hypothesized factor structure of IUIPC-10, we computed confirmatory factor analyses on one-factor, two-factor and the hypothesized threedimensional second-order model. We present the fit of the respective estimations in Table 12. By a likelihoodratio χ 2 difference test, we concluded that the two-factor solution was statistically significantly better than the one-factor solution, χ 2 (1) = 138.761, p < .001. In turn, the three-factor solutions were statistically significantly better than the two-factor solution, χ 2 (2) = 49.957, p < .001. We accepted the hypothesized three-factor secondorder model, offering confirming evidence for its factorial validity. To further test the construct validity of the three-factor second-order model, we conducted a confirmatory factor analysis of the IUIPC-10 measurement model on Sample B. We included the model's path plot in Figure 5 in Appendix B.\n\n\nGlobal Fit\n\nOur first point of call for further evaluating the factorial validity of IUIPC-10 is global fit. We included an overview of the fit measures on different samples in Table 7, drawing attention to the top row.\n\nFirst, we observed that the exact-fit test failed for IUIPC-10 irrespective of estimator, that is, the exactfit null hypotheses H χ 2 ,0 were rejected with the χ 2tests being statistically signficant. For the RMSEA- Overall, we conclude that the global fit of the model was poor and that we found disconfirming evidence for IUIPC-10's factorial validity. This disconfirmation of the CFA held irrespective of the data preparation and estimator employed. Our further examination of construct validity will be on the touch-stone MLM model.\n\n\nLocal Fit\n\nThe correlation residuals showed appreciable patterns of positive correlations greater than .10 with ctrl3 and awa3, matched with statistically significant standardized covariances. This indicated considerable misloading on these indicators and disconfirmed the unidimensionality of the corresponding sub-scales.\n\n\nConvergent and Discriminant Validity\n\nWe first analyzed the standardized loadings and the variance explained in Table 6. Therein, we found that ctrl3 and awa3 only exhibited .17 and .20 of the common factor variance, respectively. Those values were considerably below par (R 2 > .50). The corresponding loadings would be classified according to Hair et al. [17, p. 153] as just past minimally acceptable, but not pracitally significant. In the evaluation of the second-order model, we found the standardized loading of Collection on IUIPC on the low side. In terms of convergent validity, we evaluated the Average Variance Extracted (AVE) and Composite Reliability (CR) ω in Table 6. While the CR ω being greater than the AVE for all three dimensions indicated support, we observed that the AVE was less than .50 for both Control and Awareness and thereby showed that there is little common factor variance extracted on average. Similarly, their ω < .70 implied sub-par convergent validity.\n\nFor discriminant validity, we found the Fornell-Larcker and HTMT criteria fulfilled, offering support for the specified models.\n\n\nReliability: Internal Consistency\n\nLet us consider the reliability criteria derived from the MLM CFA model in Table 6. Considering Cronbach's α, we observed estimates for Control and Awareness less than the .70, what Nunnally classified only acceptable to \"save time and energy.\" The Composite Reliability estimate ω = .66 was equally below this just acceptable threshold. Table 6. Factor loadings and their standardized solution of the MLM CFA of IUIPC-10 on Sample B. We find sub-par standardized loadings β < .70 for ctrl3 and awa3, yielding a poor variance extracted R 2 ≤ .20 and, thereby, low AVE < .50 for control and awareness, indicating sub-par internal consistency. The equally sub-par construct reliability ω < .70 yields a low signal-to-noise ratio less than 2.\n\n\nFactor Indicator\n\nFactor Loading Standardized Solution Reliability \nλ SE λ Z λ p λ β SE β Z β p β R 2 AVE α ω S/N\n\nRespecification\n\nIn face of the disconfirming evidence discovered on construct validity and reliability, we decided to remove the items ctrl3 and awa3 from the scale, at the risk of losing identification. We stress that this step is not rooted in seeking a better fit, cautioned against a questionable specification practice [17, p. 641], but born from the disadvantagous properties of the items discussed. We compared the non-nesteds models IUIPC-10 and IUIPC-8 with the Vuong test on the ML estimation. The variance test indicated the two models as distinguishable, ω 2 = 1.926, p < .001. The Vuong non-nested likelihood-ratio test rejected the null hypothesis that both models were equal. The IUIPC-8 model fitted statistically significantly better than the IUIPC-10 model, LRT z = −34.541, p < .001. \n\n\nValidation\n\nWe validated the respecified IUIPC-8 model on the independent validation sample V and compared against the performance of IUIPC-10. We offered this comparison under consideration of all three estimators in Table 16.\n\nFirst, we observed under ML estimation that the two models are indeed statistically significantly distinguishable with the variance test, ω 2 = 2.489, p < .001. Furthermore, applied to the validation sample V, IUIPC-8 was the statistically significantly better model according to the Vuong test, LRT z = −34.541, p < .001.\n\nFor IUIPC-10 on V, we noticed that the ML estimation failed all test criteria, incl. the poor-fit hypothesis with aˆ = .08 andˆ UL ≥ . 10 Overall, we concluded that IUIPC-8 could be validated on an independent dataset as a well fitting model, whereas IUIPC-10 was disconfirmed once more. \n\n\nSummary\n\nThe construct validity of IUIPC according to RQ 2 bears a deliberate discussion. On the one hand, we could confirm the three-dimensionality and second-order model that Malhotra et al. [30] postulated. On the other hand, factorial validity evidenced in global and local fitespecially the unidimensionality of the first-order factors Control and Awareness-does not seem to be given, neither on the main Sample B nor on the validation Sample V. The convergent validity and reliability of these subscales is equally in question, our estimates having been lower than Malhotra et al.'s.\n\n\nEstimator Appraisal\n\nWhile we have already shown estimator invariance according to RQ 3 throughout confirmation and validation, we are now turning to the question of estimator viability asked in RQ 4. Considering the viability of each estimator in their own right, ML without outlier treatment showed the worst performance of the ML-based estimations. We would discourage its use. Let us consider the remaining estimations with outlier treatment. Comparing between ML and MLM, both estimators behaved similarly on the relative changes between the misspecified IUIPC-10 and the respecified IUIPC-8. MLM consistently offered the stronger fit.\n\nEven though robust WLS is estimating more parameters (loadings, errors, thresholds) than its ML counter-parts, we still believe it is fair to say that WLSMVS seemed most affected by deviations from a close fit. On both samples, we observed a great improvement of fit indices when comparing between the WLSMVS IUIPC-10 and IUIPC-8 models. Hence, the robust WLS estimation is certainly viable in its own right, in fact, we would consider it quite robust against Type I errors.\n\nHaving assessed MLM and WLSMVS as viable on their global fit, let us further appraise their model interpretations and mean structures. To that end, the extended version of this paper [16] contains the complete threshold tables of the robust WLS estimation. For this inquiry, we follow the reasoning of Bovaird and Koziol [5, pp]. Let us train our lens on a single indicator for illustration: awa2. Here, the MLM estimation tells us that individuals with average levels of Awareness will have an expected response on item awa2 of 6.62. Of course, this value does not exist on the 7-point Likert scale. For each increase of one unit of Awareness, we would expect awa2 to increase by 1.13 points. For a single unit of increase from the mean, the prediction 7.75 is obviously out-of-bounds of the scale, hence, an invalid prediction. This phenomenon is an artefact of ML-based estimation on heavily non-normal, ordinal data.\n\nFollowing the same line of inquiry for the robust WLS estimation, these issues do not exist. Here, the loading of awa2 λ awa2 = 1.07 indicates the expected change of the probit of an individuals's response to awa2 for each unit of Awareness. Under this estimation, an Awareness of −1.88 is required to choose response option 6-\"Agree\" or higher with a 50% probability; of −0.4 for option 7-\"Strongly Agree\" with a 50% probability.\n\nClearly, the robust WLS prediction of the individual's choice yields a more informative model.\n\n\nDiscussion\n\n\nIUIPC-10 Could Not Be Confirmed\n\nWhile we could attest to strengths in the underpinning of its content validity and the three-dimensionality of IUIPC-10, our CFA revealed a range of weaknesses in IUIPC's construct validity (cf. Table 8): (i) we could not confirm factorial validity in terms of global fit, meaning that the corresponding models did not approximate the corresponding observations well; (ii) the inspection of the residuals showed an unsatisfactory local fit for two items of the sub-scales of Control and Awareness, calling the the unidimensionality of these sub-scales into question. (iii) we found disconfirming evidence on the convergent validity. We further observed a sub-par reliability of the sub-scales Control and Awareness . As these assessments held true on main and validation samples, irrespective of estimators used, they offer disconfirming evidence against the scale itself.\n\nFor privacy researchers, the issues in construct validity mean that the IUIPC-10 scale shows weaknesses in measuring its hidden construct Information Privacy Concern. The observed sub-par reliability entails that IUIPC-10 measurements contain less common factor variance, which entails a low signal-to-noise ratio and can lead to spurious and erratic results.\n\n\nIUIPC-8 Asserts a Stronger Validity\n\nWith IUIPC-8, we proposed a refined version of IUIPC that performed consistently well in terms of construct validity and reliability. We give an overview of a range of criteria in Table 8. In terms of factorial validity, we observed good global and local fits. Criteria for convergent and discriminant validity were fulfilled consistently. The respecified scale also showed appreciable improvements in reliability, yielding a 33% to 82% better signal-tonoise ratio for Awareness and Control, respectively.\n\nWe encourage privacy researchers consider carefully: On the one hand, the 10-item version of IUIPC exhibits a wider theoretical domain and contains more information on privacy concern they will care about. It has at least three items per factor and, thereby, creates favorable conditions for CFA model identification and more robust estimation of the true value of the latent factors. However, given that two items seem to misload to a considerable degree and to yield low reliability, those items may confound the model. The tight fit we obtained for the 8-item version of IUIPC is encouraging: it will approximate the data well and yield sound measurement models for subsequent analyses. The good concurrent validity with IUIPC-10 further supports using the respecified scale. Given the evidence in this study, we endorse adopting IUIPC-8 as a brief questionnaire for Internet users' privacy concern.\n\n\nQuestionnaire Wording as Culprit\n\nWhile our reviews of IUIPC in Section 6 asserted sound content validity foundations, we equally found evidence for biases rooted in the questionnaire wording. Our analysis of the observed sample distributions of IUIPC-10 from Section 7.2 and especially the distribution graphs in Figure 3 showed a substantial negative skew and positive kurtosis. This seems to confirm our observation that the use of loaded words incl. \"privacy\" and \"autonomy\" may create a systematic bias through priming, further aggravated by leading questions. All these observations point towards the instrument itself influencing the respondents towards agreement.\n\nIUIPC also suffers from instances of question wording yielding nondifferentiation. While the entire questionnaire can be subject to straightlining due to the absence of reverse-coded items, we believe that items ctrl3 and awa3 were especially impacted because of the presence of double-barreled constructions. This observation could explain why these items yielded a low reliability and why they needed to be removed altogether.\n\nFor privacy researchers, these observations stress the importance of inspecting the question wording of instruments carefully and to assess them against commonly known biases [8,33].\n\n\nHow to Use IUIPC\n\nOur analysis has a range of implications for privacy researchers, not just for the use of IUIPC but any multidimensional privacy concern scale. Let us consider assessing IUIPC scores for a given sample. Given the evidence that the instrument seems to bias responses towards agreement, it is invalid to call a particular sample \"especially privacy-sensitive,\" should the mean IUIPC score be greater than 4-\"Neither agree nor disagree.\"  While allowing for factor-analysis models also yielding estimates, overall, naïve score computations, such as flat averaging, lose information over more sophisticated factor scores.\n\nBecause IUIPC-10 exhibits a lower than desired reliability, privacy researchers need to be conscious of the low signal-to-noise ratio. The considerable uniqueness (specific and error variance of items) may mask information about the respondents' true IUIPC score.\n\nThe most important consequence of the low reliability for privacy researchers will be the expected attenuation of relations to other latent factors [36]: the magnitude of effects of IUIPC-measured privacy concern on other variables, say behavior, will be reduced. This means that it will be more difficult to show the impact of privacy concern-even if the true relation between the latent variables is substantive.\n\nPrivacy researchers focusing on simple statistical tools not factoring out error variance, such as linear regressions on summarized sub-scale scores, are most affected by these shortcomings: the specific and error variance is folded into the scores they use, masking the signal. For these researchers, IUIPC-8 offers considerable advantages by offering stronger validity and reliability. It comes at the price of eliminating two concern-items the researchers might be interested in. Let us consider the comparison of score approximations with the CFAestimated factor in Figure 4 and Hair et al.'s introduction to summarized scales [17, pp. 160]. We assert that privacy researchers would be worst off ignoring the factor structure altogether by simply summing/averaging all items of IUIPC into one \"flat\" summarized score (r = .74). It is usually better to take into account the factor structure, the simplest approach averaging the sub-scale scores into a \"coarse\" summarized score. They could further improve their approximation by computing factor scores, for instance \"weighted\" by factor loadings (r = .89) or linearly combined with CFA-derived \"regression\" coefficients. While there is a great deal of discussion on correct and incorrect uses of those factor scores, a common pragmatic approach computes a weighting by the factor loading. However, this approach comes at a price of largely applying to the original sample and of offering less transferability. Given IUIPC-8's better factorial validity and reliability, coarse summarized score will be more generalizable.\n\nPrivacy researchers using advanced tools that exclude error variances, such as confirmatory factor analysis, face a different trade-off. The analysis will esti-mate the loading of each indicator on the corresponding latent factor as well as the error variance. Hence, the separated-out error variance does not contaminate regression equations. However, the problematic construct validity of IUIPC-10 will affect their studies through appreciably weak global and local fit. They might discover their measurement model misspecified. For them, IUIPC-8 offers a better construct validity, especially useful for investigating comprehensive latent variable models in investigations of the privacy paradox.\n\nIn terms of choice of estimators for CFA and SEM (cf. Section 7.8), privacy researchers can viably opt for robust WLS as an estimator tailored to the non-normal, ordinal distributions of IUIPC indicators. As we have shown, a robust WLS estimation on IUIPC-8 offers a good fit at decent sample sizes. While the privacy community might not be accustomed to the interpretation of these probit models, they offer more nuanced model interpretability than the ML or MLM estimations. If privacy researchers decide against robust WLS, we would still advocate using a robust ML estimation (such as MLM or MLR) after a careful data preparation.\n\n\nLimitations\n\nIn terms of generalizability, this study encountered the usual limitations of self-report instruments, where we sought to ward against straightlining with instructional manipulation checks/attention checks. While the sampling aimed at representing a UK population, the sampling process was non-randomized and affected by a selfselection bias due to Prolific's matchmaking.\n\nFactor analyses like ours are affected by sampling and measurement errors. To ensure our findings yielded cross-sample validity, we considered three independent samples. To ensure our findings were valid irrespective of design decisions, we created a direct replication of the IUIPC-10 as well as analyses following methodological recommendations [24, p. 122]. The results were invariant to outlier inclusion and estimation method.\n\n\nConclusion\n\nWe independently evaluated the validity and reliability of IUIPC-10 in covariance-based confirmatory factor analyses. Acknowledging the sound content validity foundations presented by Malhotra et al. [30] and the instrumental role the scale played in advancing the field, we observed that (i) we could confirm the threedimensionality of IUIPC-10 with the factors Control, Awareness, and Collection, (ii) we found disconfirming evidence for the factorial validity and convergent validity, largely rooted in evidence against the unidimensionality of Control and Awareness. These results were consistent in main analysis and validation, irrespective of the estimator used, (iii) we proposed a respecified IUIPC-8 that outperformed the original IUIPC-10 on construct validity and reliability consistently. (iv) we offered empirically grounded recommendations how to use IUIPC and similar privacy concern scales. Future work specifically for IUIPC would ideally offer further carefully evaluated revisions to the scale, eliminating identified problems in question wording, e.g., eliminating loaded words, aiming for four items per factor, and establishing unassailable construct validity and an internal consistency ω > .80 for all sub-scales.\n\nWe started this paper referring to instruments as measuring stick for privacy concern. If such a measurement stick is warped, the community's investigation of human factors of PETs and of the privacy paradox may be severely undermined and misled. We believe that we would benefit from concerted efforts to diligently evaluate standard instruments in the field along similar lines we have pursued in this study. While reaching consensus on sound measurement instruments on the construct Information Privacy Concern and its siblings is essential, we would also benefit from following unified recommendations their use.\n\n\nAcknowledgments\n\nWe would like to thank Naresh K. Malhotra, James Agarwal and especially Sung S. Kim for promptly responding with succinct information on the original research process at the conception of IUIPC. We are grateful for the insightful comments of the anonymous reviewers of the Privacy-Enhancing Technology Symposium and especially for the guidance and time of our shepherd Michelle Mazurek. This work was supported by ERC Starting Grant CASCAde (GA n o 716980).\n\n\nA Materials & Sample\n\nWe included the used IUIPC-10 questionnaire in Table 9. The questionnaire was administered in the first section of a greater survey, which included six instructional manipulation checks (IMCs) as attention checks shown in Table 10.\n\nFor the reproducibility of the maximum likelihood estimation, Table 11 contains the correlations and standard deviations (SDs) of Sample B. The OSF supplementary materials contain more precise covariance matrices of all samples.\n\n\nB Additional Evidence\n\nWith respect to factorial validity in Section 7.3.1, Table 12 shows the comparison of candidate factor solutions. The path model from Figure 5 shows the se-lected IUIPC-10 model. Table 13 highlights the residuals founding the assessment of that model's local fit. Table 14 then offers the loadings and reliability of the respecified model from Section 7.5. Finally, Table 16 offers the fit comparison for the validation. The extended version of this paper [16] contains further tables on all aspects of the analysis.\n\n\nC Factor Analysis\n\nFactor analysis is a powerful tool for evaluating the construct validity and reliability of privacy concern instruments. Factor analysis refers to a set of statistical methods that are meant to determine the number and nature of latent variables (LVs) or factors that account for the variation and covariation among a set of observed measures commonly referred to as indicators.\n\nIn general, we distinguish exploratory factor analysis (EFA) and confirmatory factor analysis (CFA), both of which are used to establish and evaluate psychometric instruments, respectively. They are both based on the common factor model, which holds that each indicator variable contributes to the variance of one or more common factors and one unique factor. Thereby, common variance (communality) of related observed measures is attributed to the corresponding latent factor, and unique variance (uniqueness) seen either as variance associated with the indicator or as error variance. IUIPC is based on a reflective measurement, that is, the observed measure of an indicator variable is seen as caused by some latent factor. Indicators are thereby endogenous variables, latent variables exogenous variables. Reflective measurement requires that all items of the sub-scale are interchangeable [25, pp. 196].\n\nIn this paper, we are largely concerned with covariance-based confirmatory factor analysis (CB-CFA). Therein, the statistical tools aim at estimating coefficients for parameters of the measurement model that best fit the covariance matrix of the observed data. The difference between an observed covariance of the sample and an implied covariance of the model is called a residual.\n\n\nC.1 Estimators and Their Assumptions\n\nThe purpose of a factor analysis is to estimate free parameters of the model (such as loadings or error variance), which is facilitated by estimators. The choice of Table 9. Items of the instrument Internet users' information privacy concerns (IUIPC-10) [30] Construct\n\nItem Question\nControl (ctrl) ctrl1\nConsumer online privacy is really a matter of consumers' right to exercise control and autonomy over decisions about how their information is collected, used, and shared. ctrl2\n\nConsumer control of personal information lies at the heart of consumer privacy. ctrl3 I believe that online privacy is invaded when control is lost or unwillingly reduced as a result of a marketing transaction.\n\n\nAwareness (awa)\n\nawa1 Companies seeking information online should disclose the way the data are collected, processed, and used. awa2 A good consumer online privacy policy should have a clear and conspicuous disclosure. awa3 It is very important to me that I am aware and knowledgeable about how my personal information will be used.\nCollection (coll) coll1\nIt usually bothers me when online companies ask me for personal information. coll2\n\nWhen online companies ask me for personal information, I sometimes think twice before providing it. coll3\n\nIt bothers me to give personal information to so many online companies. coll4\n\nI'm concerned that online companies are collecting too much personal information about me.\n\nNote: The questionnaire is administered with 7-point Likert items, anchored on 1=\"Strongly Disagree\" to 7=\"Strongly Agree\"  [17, p. 11] in nature, that is, ordered categories in which the distance between categories is not constant; they thereby require special treatment [25, pp. 323].\n\nLei and Wu [28] held based on a number of empirical studies that the fit indices of approximately normal ordinal variables with at least five categories are not greatly misleading. However, when ordinal and non-normal is treated as continuous and normal, the fit is underestimated and there is a more pronounced negative bias in estimates and standard errors. While Bovaird and Kozoil [5] acknowledge robustness of the ML estimator with normally distributed ordinal data, they stress that increasingly skewed and kurtotic ordinal data inflate the Type I error rate. In the same vein, Kline [24, p. 122] holds the normality assumption for endogenous variables-the indicators-to be critical.\n\n\nC.2 Global and Local Fit\n\nThe closeness of fit of a factor model to an observed sample is evaluated globally with fit indices as well as locally by inspecting the residuals. We shall focus on the ones Kline [25, p. 269] required as minimal reporting. χ 2 (df ): The χ 2 for given degrees of freedom is the likelihood ratio chi-square, as a measure of exact fit.   \n\n\nCFI:\n\nThe Bentler Comparative Fit Index is an incremental fit index based on the non-centrality measure comparing selected against the null model.\n\n\nRMSEA: Root Mean Square Estimate of Approximation\n\n(ε) is an absolute index of bad fit, reported with its 90% Confidence Interval [ε UL ,ε LL ]. SRMR: Standardized Root Mean Square Residual is a standardized version of the mean absolute covariance residual, where zero indicates excellent fit. We mention the Goodness-of-Fit index (GFI) reported by IUIPC, which approximates the proportion of variance explained in relation to the estimated population covariance. It is not recommended as it is substantially impacted by sample size and number of indicators.\n\nMalhotra et al. [30] adopted a combination rule referring to Hu and Bentler, which we will report as HBR, staying comparable with their analysis: \"A model is considered to be satisfactory if (i) CFI > .95, (ii) GFI > .90, and (iii) RMSEA < .06.\"\n\nNested models [25, p. 280], that is, models with can be derived from each other by restricting free parameters, can be well-compared with a Likelihood Ra-tio χ 2 Difference Test (LRT) [25, p. 270]. However, the models we are interested in are non-nested [25, p. 287], because they differ in their observed variables. On ML-estimations, we have the Vuong Likelihood Ratio Test [42] at our disposal to establish statistical inferences on such models.\n\nIn addition, we introduce the AIC/BIC family of metrics with formulas proposed by Kline [25, p. 287]:\nAIC := χ 2 + 2q BIC := χ 2 + q ln(N ),\nwhere q is the number of free parameters and N the sample size. We compute CAIC as the even-weighted mean between AIC and BIC. These criteria can be used to compare different models estimated on the same samples, on the same variables, but theoretically also on different subsets of variables. Smaller is better.\n\n\nStatistical Inference\n\nThe χ 2 and RMSEA indices offer us statistical inferences of global fit. Such tests can either be accept-support, that is, accepting the null hypothesis supports the selected    \n\nFinal\nSample N A = 201 N B = 370 N V = 419 Note: N A = 205, N B = 379, N V = 433 are after attention checks.\n\nFig. 3 .\n3Density of IUIPC-10 subscale responses across samples (A: violet, B: green, V: yellow). Note: All graphs are on the same scale. The dotted mid-line represents the neutral option of the 7-point Likert scale based hypotheses we have: (i) The close-fit test evaluating whether RMSEA is likely less or equal .05 failed irrespective of estimator. (ii) The not-close-fit hypothesis could not be rejected for either estimator, withholding support for the models. (iii) Finally, the poor-fit hypothesis could not be rejected either for any models, with the upper bound of the RMSEA CI being greater than or equal as .10, indicating a poor fit. The fit indices CFI and SRMR yielded .92 and .10 for the ML based models, respectively, not supporting the models. None of the models passed the HBR combination rule used by Malhotra et al. The direct replication of IUIPC with ML estimation and outliers present fared more poorly than the corresponding ML models implementing the stated assumptions: χ 2 (32) = 202.789, p < .001; CFI=.90; RMSEA=.12 [.10, .13]; SRMR=.11; CAIC=333.8.\n\nTable 8 .H χ 2 , 0\n80Selected evidence for construct validity and reliability criteria on Samples B and V under MLM estimation. The factorial validity shows IUIPC-10 consistently failing fit measures; IUIPC-8 fared better, especially on the validation sample V. The convergent validity of IUIPC-10 is evidenced to be consistently flawed; IUIPC-8 showed suitable results, where some standardized loadings β were shown to be border-line without violating AVE > .50. Divergent validity of IUIPC-10 suffers from the low AVE; IUIPC-8 fulfills all requirements. IUIPC-10 fails the requirements on internal consistency, especially ω > .70; Hε ≤.05,0 HBR β > .70 AVE > .50 √ AV E > ∀r HTMT < .85 α > .Note: HBR = Hu and Bentler combination rule used by Malhotra et al. [30]; β = standardized loading; AVE = Average Variance Extracted;r = correlation with other factor; HTMT = Heterotrait-Monotrait Ratio; ω = Composite Reliability.\n\nFig. 4 .\n4Relation of the IUIPC-10 factors to approximate scores.\n\n\nCorrelation residuals in absolute > 0.1 are marked (b) Standardized residuals\n\n\n] (i) if the variance extracted by an item R 2 > .50 entailing that the standardized factor loading are significant and β > .70, and (ii) if the internal consistency (defined in Section 2.2.3) is sufficient (AVE > .50, ω > AVE, and ω > .70). The analysis yields empirical evidence of discriminant validity [17, pp. 676] (i) if the square root of AVE of a latent variable is greater than the max correlation with any other latent variable (Fornell-Larcker criterion\n\n\nestimation increasingly fit for non-normal, ordinal data Factor Structure Respecification on disconfirming evidence on construct validity & reliabilityFig. 1. Analysis approach Fig. 2. Which steps were taken on what sampleML \n(w/ outliers) \nML \nMLM \nWLSMVS \n\nDirect Replication \nConceptual Replication \nby IUIPC-10 \n\nML respec \nMLM respec \nWLSMVS respec \n\nData \nPreparation \n\nDiagnostic \nE/CFA \n\nPrimary \nCFA \n\nValidation \nCFA \n\nCFA IUIPC-10 \nAnalysis \n\nSample A \n(auxiliary) \n\nSample B \n(base) \n\nSample V \n(validation) \n\nFactor Structure \n\nValidity \n\nRespecification \nIUIPC-8 \n\nCFA \nIUIPC-8/10 \n\nCompleteness \n\nAttention Check \n\nDistribution \nOutliers \n\n\n\nTable 1 .\n1Fit of IUIPC-10's second-order model[30, p. 346].The tests of the exact-fit hypothesis on the χ 2 and the not-close fit hypothesis on the RMSEA failed. The tests of close-fit and poor-fit hypotheses passed. The combination of CFI, GFI, and RMSEA supports a satisfactory fit.Note: N IUIPC = 449. RMSEA with inferred 90% CI.χ 2 df \np CFI GFI \nRMSEA p 0 ≤.05 \n\n73.19 32 < .001 \n.98 \n.97 .054 [.037, .070] \n.338 \n\n\n\nTable 2 .\n2Validity and reliability evidence on IUIPC[30, Tab.  2]. Low AVE with awa shy of the AVE > .50 criterion cautions against low internal consistency, even if construct reliability ω > .70 is sufficient, entailing a moderate signal-to-noise ratio S/N ω . That the √ AVE of awa and ctrl on the diagonal of the correlation table is less than the correlation with the respective other factor violates the Fornell-Larcker criterion for discriminant validity.Correlations \n\nM \nSD AVE \nω S/N ω \n1 \n5 \n6 \n\n1. coll \n5.63 1.09 \n.55 .83 \n4.88 .74 \n5. awa 6.21 0.87 \n.50 .74 \n2.85 .66 .71 \n6. ctrl \n5.67 1.06 \n.54 .78 \n3.55 .53 .75 .73 \n\n\n\nTable 3 .\n3Sample RefinementPhase \nA \nB \nV \n\nExcl. Size \nExcl. Size \nExcl. Size \n\nStarting Sample \n226 \n473 \n467 \nIncomplete \n0 226 \n58 415 \n34 433 \nDuplicate \n7 219 \n25 390 \n0 \n433 \nFailedAC> 1 \n14 205 \n11 379 \n0 \n433 \nMV Outlier \n4 201 \n9 370 \n14 419 \n\n\n\nTable 4 .\n4DemographicsNote: Samples B and V were drawn to be representative of the UK census by age and gender; Sample A was not.(a) Sample A \n\nOverall \n\nN A \n205 \nGender (%) \nFemale \n80 (39.0) \nMale \n125 (61.0) \nRather not say 0 ( 0.0) \n\nAge (%) \n18-24 \n109 (53.2) \n25-34 \n71 (34.6) \n35-44 \n18 ( 8.8) \n\n45-54 \n4 ( 2.0) \n55-64 \n3 ( 1.5) \n65+ \n0 ( 0.0) \n\n(b) Sample B \n\nOverall \n\nN B \n379 \nGender (%) \nFemale \n197 (52.0) \nMale \n179 (47.2) \nRather not say 3 ( 0.8) \n\nAge (%) \n18-24 \n41 (10.9) \n25-34 \n72 (19.0) \n35-44 \n84 (22.2) \n\n45-54 \n57 (15.0) \n55-64 \n97 (25.6) \n65+ \n28 ( 7.4) \n\n(c) Sample V \n\nOverall \n\nN V \n433 \nGender (%) \nFemale \n217 (50.1) \nMale \n212 (49.0) \nRather not say 4 ( 0.9) \n\nAge (%) \n18-24 \n92 (21.2) \n25-34 \n143 (33.0) \n35-44 \n83 (19.2) \n\n45-54 \n58 (13.4) \n55-64 \n44 (10.2) \n65+ \n13 ( 3.0) \n\n\n\nTable 5 .\n5Means (SDs) of the summarized sub-scales of IUIPC-10Sample A \nSample B \nSample V \nMalhotra et al. \n\nctrl 5.82 (0.99) 5.93 (0.78) 5.86 (0.84) 5.67 (1.06) \nawa 6.22 (0.78) 6.51 (0.52) 6.43 (0.66) 6.21 (0.87) \ncoll 5.48 (1.12) 5.58 (1.12) 5.60 (1.04) 5.63 (1.09) \niuipc 5.84 (0.75) 6.00 (0.61) 5.96 (0.64) 5.84 (1.01) \n\n\n\nTable 7\n7ctrl, r = .91, 95% CI [.89, .93]; (ii) awa, r = .86, 95% CI [.83, .88]; (iii) iuipc, r = .96, 95% CI [.96, .97], all statistically significant at p < .001, yielding evidence for IUIPC-8's concurrent validity.illustrates the com-\nparison of the two models. This consitutes evidence of \nthe factorial validity of the revised scale, including a \nconfirmation of the unidimensionality of its sub-scales. \nThe respecification is still well correlated with \nIUIPC-10: (i) \n\n\n. The residuals showed a similar pattern as on Sample B. Again, the direct replication of IUIPC with outliers showed a poorer fit than the other ML estimations: χ 2 (32) = 137.368, p < .001; CFI=.93; RMSEA=.09 [.07, .10]; SRMR=.09; CAIC=270.5.The respecified IUIPC-8 fared better. The ML estimator already offered a good fit. The estimators, MLM and WLSMVS, performed equally well, if not better.\n\nTable 7 .\n7Respecification of IUIPC-10 to IUIPC-8 on Sample B. All IUIPC-10 models failed the poor-fit tests irrespective of estimator. The respecified IUIPC-8 yielded a statistically significantly better fit by the Vuong test on the ML estimation, with better CAIC throughout. The RMSEA on IUIPC-8 still asks us to mind the residuals.Note: ‡ Robust estimation with scaled test statistic. RMSEA reported wih 90% CI.Instrument Respecification \nEstimator \n\nML \nMLM  ‡ \nWLSMVS  ‡ \n\nIUIPC-10 \n\nχ 2 (32) = 163.691, p < .001 \nχ 2 (32) = 131.417, p < .001 \nχ 2 (15) = 181.149, p < .001 \nCFI=.92; GFI=1.00 \nCFI  ‡ =.92; GFI=1.00 \nCFI  ‡ =.95; GFI=.99 \nRMSEA=.11 [.09, .12] \nRMSEA  ‡ =.10 [.08, .12] \nRMSEA  ‡ =.17 [.15, .19] \nSRMR=.10; CAIC=294.3 \nSRMR=.10; CAIC  ‡ =262 \nSRMR=.10; CAIC  ‡ =414.6 \n\n↑ \n↑ \n↑ \n\nTrim ctrl3 & awa3 \n∆CFI = 0.05; ∆CAIC = −132.57 \n∆CFI = 0.05; ∆CAIC = −112.32 ∆CFI = 0.04; ∆CAIC = −191.39 \nVuong LRT z = −34.541, p < .001 \n↓ \n↓ \n↓ \n\nIUIPC-8 \nχ 2 (17) = 54.863, p < .001 \nχ 2 (17) = 42.836, p < .001 \nχ 2 (10) = 33.282, p < .001 \nCFI=.97; GFI=1.00 \nCFI  ‡ =.98; GFI=1.00 \nCFI  ‡ =.99; GFI=1.00 \nRMSEA=.08 [.06, .10] \nRMSEA  ‡ =.07 [.05, .10] \nRMSEA  ‡ =.08 [.04, .12] \nSRMR=.03; CAIC=161.7 \nSRMR=.03; CAIC  ‡ =149.7 \nSRMR=.04; CAIC  ‡ =223.2 \n\n\n\nTable 10 .\n10Items of our instructional manipulation checks Item Question A1 It is important you pay attention to the statements. Please agree by choosing 'strongly agree'. A2 To confirm that you are paying attention to the questions in the questionnaire, please select the first option from the left on the scale. A3 I'm paying attention to the questions in this questionnaire. I confirm this by choosing 'somewhat agree'. A4 I recognise the importance of paying attention to the questions in this questionnaire. Please select 'agree' to confirm your agreement. A5 Paying attention to the questions in this questionnaire is important. I agree by choosing the third option from the left of the scale. A6 When you're responding to the questions in the questionnaire it is important that you're paying attention. Please agree by selecting the second option from the left on the scale. estimator matters, because each comes with different strengths and weaknesses, requirements and assumptions that need to be fulfilled for the validity of their use. The most commonly used method for confirmatory factor analysis is maximum likelihood (ML) estimation. Among other assumptions, this estimator requires according to Kline [25, pp. 71]: (i) a continuous measurement level, (ii) multi-variate normal distribution (entailing the absence of extreme skewness) [25, pp. 74], and (iii) treatment of influential cases and outliers. The distribution requirements are placed on the endogenous variables: the indicators. These requirements are not always fulfilled in samples researchers are interested in. For instance, a common case at odds with ML-based CFA is the use of Likert items as indicator variables. Likert items are ordinal\n\nTable 11 .\n11Correlations and Standard Deviations of Sample B1 \n2 \n3 \n4 \n5 \n6 \n7 \n8 \n9 \n10 \n\n1. ctrl1 \n2. ctrl2 0.56 \n3. ctrl3 0.25 0.\n\nTable 12 .\n12Comparison of different model structures of IUIPC-10 on Sample B with MLM estimation. The models show increasingly better fits in scaled χ 2 , CFI, and CAIC, supporting the predicted hierarchical three-factor model.One Factor \nTwo Factors \nThree Factors (1 st Order) Three Factors (2 nd Order) \n\nχ 2 (df ) 481.87 (35) \n239.28 (34) \n163.69 (32) \n163.69 (32) \nχ 2 /df \n13.77 \n7.04 \n5.12 \n5.12 \nCFI \n.73 \n.87 \n.92 \n.92 \nGFI \n1.00 \n1.00 \n1.00 \n1.00 \nRMSEA \n.19 [.17, .20] \n.13 [.11, .14] \n.11 \n[.09, .12] \n.10 \n[.09, .12] \nSRMR \n.14 \n.09 \n.10 \n.10 \nScaled χ 2 (df ) 377.87 (35) \n189.71 (34) \n131.42 (32) \n131.42 (32) \nCAIC \n600.572 \n361.941 \n294.264 \n294.264 \nScaled CAIC \n496.570 \n312.366 \n261.990 \n261.990 \n\n\n\nTable 13 .\n13Residuals of the MLM-estimated CFA of IUIPC-10 on Sample B. The highlighted distinctive residual patterns show a poor local fit. They indicate misloadings of ctrl3 and awa3.\n\n\n. coll1 -2.304 -2.617 3.324 -4.525 -3.544 3.878 -Note: Statistically significant residuals (abs > 1.96) are markedTable 14. Factor loadings and their standardized solution of the MLM CFA of IUIPC-8 on Sample B. The standardized factor loadings β are largely greater than .70, yielding satisfactory AVE > .50. The construct reliability ω > .70 passes the threshold for control and awareness yielding moderate signal-to-noise ratios; the reliability of collection is excellent.Note: + fixed parameter; the standardized solution is STDALLFig. 5. CFA paths plot with standardized estimates of IUIPC-10 on Sample B. Note: The coefficients are standardized Table 15. Evidence for discriminant validity of IUIPC-10 (Fornell-Larcker Criterion and Heterotrait-Monotrait Ratio) on Sample B. The Fornell-Larcker criterion of √ AVE greater than any correlation with any other factor and the HTMT < .85 are fulfilled.1 \n2 \n3 \n4 \n5 \n6 \n7 \n8 \n9 \n10 \n\n1. ctrl1 -\n2. ctrl2 3.703 \n-\n3. ctrl3 -2.345 -1.016 \n-\n4. awa1 -1.585 \n-2.466 1.921 \n-\n5. awa2 -0.457 \n0.003 \n2.597 4.618 \n-\n6. awa3 0.972 \n0.379 \n3.012 -0.36 \n-3.891 -\n78. coll2 -0.669 \n-1.843 \n4.334 0.706 \n0.845 \n3.971 2.035 \n-\n9. coll3 0.031 \n-2.609 4.142 -2.448 -1.365 \n5.144 -1.384 0.405 \n-\n10. coll4 1.293 \n-1.429 \n4.284 0.688 \n0.101 \n5.912 0.475 \n-2.636 1.397 -\n\nFactor Indicator \nFactor Loading \nStandardized Solution \nReliability \n\nλ \nSE λ \nZ λ \np λ \nβ SE β \nZ β \np β \nR 2 AVE \nα \nω S/N ω \n\nctrl \nctrl1 \n1.00 + \n0.76 \n0.06 13.40 < .001 0.57 \n0.56 0.72 0.72 \n2.52 \nctrl2 \n0.98 \n0.14 \n7.01 < .001 0.74 \n0.06 11.58 < .001 0.54 \naware \nawa1 \n1.00 + \n0.69 \n0.05 13.45 < .001 0.48 \n0.64 0.76 0.78 \n3.55 \nawa2 \n1.33 \n0.18 \n7.33 < .001 0.90 \n0.05 17.34 < .001 0.80 \ncollect coll1 \n1.00 + \n0.81 \n0.02 39.01 < .001 0.66 \n0.72 0.91 0.91 \n10.13 \ncoll2 \n0.76 \n0.05 14.83 < .001 0.76 \n0.04 20.90 < .001 0.58 \ncoll3 \n1.06 \n0.04 23.67 < .001 0.94 \n0.01 70.72 < .001 0.88 \ncoll4 \n0.95 \n0.05 18.15 < .001 0.86 \n0.03 33.67 < .001 0.74 \niuipc \ncollect \n0.34 \n0.08 \n4.28 < .001 0.31 \n0.07 \n4.31 < .001 0.09 \nctrl \n0.39 \n0.08 \n4.90 < .001 0.56 \n0.11 \n5.01 < .001 0.31 \naware \n0.33 \n0.07 \n4.99 < .001 0.86 \n0.14 \n6.03 < .001 0.74 \n\n0.73 0.73 0.41 \n0.74 0.81 0.44 \n0.81 0.76 0.94 0.86 \n\n0.37 \n0.61 \n0.89 \n\n0.46 \n0.47 \n0.83 \n0.46 \n0.34 \n0.80 \n0.34 \n0.42 \n0.12 \n0.26 \n\n0.62 \n\n0.21 \n0.86 \n\nct1 \nct2 \nct3 \naw1 \naw2 \naw3 \ncl1 \ncl2 \ncl3 \ncl4 \n\nctr \nawr \ncll \n\nipc \n\n\n\nTable 16 .\n16Comparison of IUIPC-10 and IUIPC-8 on Validation Sample V. The IUIPC-10 models fail the fit tests irrespective of estimator. By Vuong test on the ML estimation and the CAIC, the IUIPC-8 models are better fits than their corresponding IUIPC-10 equivalents. The IUIPC-8 models show very good fit, with the MLM estimation passing even the exact-fit test.\nweighted least squares with robust standard errors and a Satterthwaite mean-and variance-adjusted test statistic\nOSF: https://osf.io/5pywm\n(a)Fornell10.Even with excellent global fit indices, the inspection of the local fit-evidenced by the residuals-must not be neglected. In fact, Kline[25, p. 269] drives home \"Any report of the results without information about the residuals is incomplete.\" Simply put, a large absolute residual indicates covariation that the model does not approximate well and that may thereby lead to spurious results.\nDiscriminant validity assessment: Use of Fornell & Larcker criterion versus HTMT criterion. M Hamid, W Sami, M Sidek, Journal of Physics: Conference Series. IOP Publishing89012163M. Ab Hamid, W. Sami, and M. Sidek. Discriminant validity assessment: Use of Fornell & Larcker criterion versus HTMT criterion. In Journal of Physics: Conference Series, volume 890, page 012163. IOP Publishing, 2017.\n\nOn the assessment of unidimensional measurement: Internal and external consistency, and overall consistency criteria. J C Anderson, D W Gerbing, J E Hunter, Journal of marketing research. 244J. C. Anderson, D. W. Gerbing, and J. E. Hunter. On the assessment of unidimensional measurement: Internal and external consistency, and overall consistency criteria. Journal of marketing research, 24(4):432-437, 1987.\n\nwhat if?\" predicting individual users' smart home privacy preferences and their changes. N M Barbosa, J S Park, Y Yao, Y Wang, Proceedings on Privacy Enhancing Technologies. on Privacy Enhancing Technologies2019N. M. Barbosa, J. S. Park, Y. Yao, and Y. Wang. \"what if?\" predicting individual users' smart home privacy prefer- ences and their changes. Proceedings on Privacy Enhancing Technologies, 2019(4):211-231, 2019.\n\nUser acceptance factors for anonymous credentials: An empirical investigation. Z Benenson, A Girard, I Krontiris, WEIS. Z. Benenson, A. Girard, and I. Krontiris. User acceptance factors for anonymous credentials: An empirical investiga- tion. In WEIS, 2015.\n\nMeasurement models for ordered-categorical indicators. J A Bovaird, N A Koziol, Handbook of Structural Equation Modeling. R. H. HoyleThe Guilford PressJ. A. Bovaird and N. A. Koziol. Measurement models for ordered-categorical indicators. In R. H. Hoyle, editor, Handbook of Structural Equation Modeling, pages 495-511. The Guilford Press, 2012.\n\nIndirect content privacy surveys: measuring privacy without asking about it. A Braunstein, L Granka, J Staddon, Proceedings of the Seventh Symposium on Usable Privacy and Security. the Seventh Symposium on Usable Privacy and SecurityA. Braunstein, L. Granka, and J. Staddon. Indirect content privacy surveys: measuring privacy without asking about it. In Proceedings of the Seventh Symposium on Usable Privacy and Security, pages 1-14, 2011.\n\nDevelopment of measures of online privacy concern and protection for use on the internet. T Buchanan, C Paine, A N Joinson, U.-D Reips, Journal of the American society for information science and technology. 582T. Buchanan, C. Paine, A. N. Joinson, and U.-D. Reips. Development of measures of online privacy concern and protection for use on the internet. Journal of the American society for information science and technology, 58(2):157- 165, 2007.\n\nPeer reviewed: a catalog of biases in questionnaires. B C Choi, A W Pak, Preventing chronic disease. 21B. C. Choi and A. W. Pak. Peer reviewed: a catalog of biases in questionnaires. Preventing chronic disease, 2(1), 2005.\n\nInternet privacy concerns and their antecedents-measurement validity and a regression model. T Dinev, P Hart, Behaviour & Information Technology. 236T. Dinev and P. Hart. Internet privacy concerns and their antecedents-measurement validity and a regression model. Behaviour & Information Technology, 23(6):413-422, 2004.\n\nThe impact of categorization with confirmatory factor analysis. C Distefano, Structural equation modeling. 93C. DiStefano. The impact of categorization with confirma- tory factor analysis. Structural equation modeling, 9(3):327- 346, 2002.\n\nNon-normal and categorical data in structural equation modeling. S J Finney, C Distefano, 10Structural equation modeling: A second courseS. J. Finney and C. DiStefano. Non-normal and categorical data in structural equation modeling. Structural equation modeling: A second course, 10(6):269-314, 2006.\n\nEvaluating structural equation models with unobservable variables and measurement error. C Fornell, D F Larcker, Journal of marketing research. 181C. Fornell and D. F. Larcker. Evaluating structural equation models with unobservable variables and measurement error. Journal of marketing research, 18(1):39-50, 1981.\n\nExplaining the privacy paradox: A systematic review of literature investigating privacy attitude and behavior. N Gerber, P Gerber, M Volkamer, Computers & Security. 77N. Gerber, P. Gerber, and M. Volkamer. Explaining the privacy paradox: A systematic review of literature investigat- ing privacy attitude and behavior. Computers & Security, 77:226-261, 2018.\n\nInvestigating people's privacy risk perception. N Gerber, B Reinheimer, M Volkamer, Proceedings on Privacy Enhancing Technologies. on Privacy Enhancing Technologies2019N. Gerber, B. Reinheimer, and M. Volkamer. Investigating people's privacy risk perception. Proceedings on Privacy Enhancing Technologies, 2019(3):267-288, 2019.\n\nAn updated paradigm for scale development incorporating unidimensionality and its assessment. D W Gerbing, J C Anderson, Journal of marketing research. 252D. W. Gerbing and J. C. Anderson. An updated paradigm for scale development incorporating unidimensionality and its assessment. Journal of marketing research, 25(2):186-192, 1988.\n\nValidity and reliability of the scale internet users' information privacy concern (iuipc). T Groß, extended versionT. Groß. Validity and reliability of the scale internet users' information privacy concern (iuipc) [extended version].\n\nJ F Hair, W C Black, B J Babin, R E Anderson, Multivariate data analysis. Cengage Learning. 8th editionJ. F. Hair, W. C. Black, B. J. Babin, and R. E. Anderson. Multivariate data analysis. Cengage Learning, 8th edition, 2019.\n\nGerman translation of the concerns for information privacy (cfip) construct. SSRN 3112207. D Harborth, S Pape, D. Harborth and S. Pape. German translation of the concerns for information privacy (cfip) construct. SSRN 3112207, 2018.\n\nJondonym users' information privacy concerns. D Harborth, S Pape, IFIP International Conference on ICT Systems Security and Privacy Protection. SpringerD. Harborth and S. Pape. Jondonym users' information privacy concerns. In IFIP International Conference on ICT Systems Security and Privacy Protection, pages 170-184. Springer, 2018.\n\nHow privacy concerns and trust and risk beliefs influence users' intentions to use privacyenhancing technologies-the case of tor. D Harborth, S Pape, Proceedings of the 52nd Hawaii International Conference on System Sciences. the 52nd Hawaii International Conference on System SciencesD. Harborth and S. Pape. How privacy concerns and trust and risk beliefs influence users' intentions to use privacy- enhancing technologies-the case of tor. In Proceedings of the 52nd Hawaii International Conference on System Sciences, 2019.\n\nExplaining the technology use behavior of privacy-enhancing technologies: The case of tor and jondonym. D Harborth, S Pape, K Rannenberg, Proceedings on Privacy Enhancing Technologies. on Privacy Enhancing Technologies2020D. Harborth, S. Pape, and K. Rannenberg. Explaining the technology use behavior of privacy-enhancing technologies: The case of tor and jondonym. Proceedings on Privacy Enhancing Technologies, 2020(2):111-128, 2020.\n\nA new criterion for assessing discriminant validity in variance-based structural equation modeling. J Henseler, C M Ringle, M Sarstedt, Journal of the academy of marketing science. 431J. Henseler, C. M. Ringle, and M. Sarstedt. A new cri- terion for assessing discriminant validity in variance-based structural equation modeling. Journal of the academy of marketing science, 43(1):115-135, 2015.\n\nData on context/reproducibility of iuipc. Personal Communication. S S Kim, S. S. Kim. Data on context/reproducibility of iuipc. Per- sonal Communication, May 2020.\n\nAssumptions in structural equation modeling. R B Kline, Handbook of Structural Equation Modeling. R. H. HoyleThe Guilford PressR. B. Kline. Assumptions in structural equation modeling. In R. H. Hoyle, editor, Handbook of Structural Equation Modeling, pages 111-125. The Guilford Press, 2012.\n\nPrinciples and practice of structural equation modeling. R B Kline, The Guilford Press4th ed. editionR. B. Kline. Principles and practice of structural equation modeling. The Guilford Press, 4th ed. edition, 2015.\n\nPrivacy attitudes and privacy behaviour: A review of current research on the privacy paradox phenomenon. S Kokolakis, Computers & security. 64S. Kokolakis. Privacy attitudes and privacy behaviour: A review of current research on the privacy paradox phe- nomenon. Computers & security, 64:122-134, 2017.\n\nThe sources of four commonly reported cutoff criteria: What did they really say?. C E Lance, M M Butts, L C Michels, Organizational research methods. 92C. E. Lance, M. M. Butts, and L. C. Michels. The sources of four commonly reported cutoff criteria: What did they really say? Organizational research methods, 9(2):202-220, 2006.\n\nEstimation in structural equation modeling. P.-W Lei, Q Wu, Handbook of structural equation modeling. R. H. HoyleThe Guilford PressP.-W. Lei and Q. Wu. Estimation in structural equation modeling. In R. H. Hoyle, editor, Handbook of structural equation modeling, pages 164-179. The Guilford Press, 2012.\n\nConfirmatory factor analysis with ordinal data: Comparing robust maximum likelihood and diagonally weighted least squares. C.-H Li, Behavior Research Methods. 483C.-H. Li. Confirmatory factor analysis with ordinal data: Comparing robust maximum likelihood and diagonally weighted least squares. Behavior Research Methods, 48(3):936-949, 2016.\n\nInternet users' information privacy concerns (IUIPC): The construct, the scale, and a causal model. N K Malhotra, S S Kim, J Agarwal, Information systems research. 154N. K. Malhotra, S. S. Kim, and J. Agarwal. Internet users' information privacy concerns (IUIPC): The construct, the scale, and a causal model. Information systems research, 15(4):336-355, 2004.\n\n. S Messick, Validity. ETS Research Report Series. 19872208S. Messick. Validity. ETS Research Report Series, 1987(2):i- 208, 1987.\n\nMeasuring inherent privacy concern and desire for privacy-a pilot survey study of an instrument to measure dispositional privacy concern. A Morton, 2013 International Conference on Social Computing. IEEEA. Morton. Measuring inherent privacy concern and desire for privacy-a pilot survey study of an instrument to mea- sure dispositional privacy concern. In 2013 International Conference on Social Computing, pages 468-477. IEEE, 2013.\n\nQuestionnaire design, interviewing and attitude measurement. A N Oppenheim, Continuum. A. N. Oppenheim. Questionnaire design, interviewing and attitude measurement. Continuum, 1992.\n\nGuide to measuring privacy concern: Review of survey and observational instruments. S Preibusch, International Journal of Human-Computer Studies. 7112S. Preibusch. Guide to measuring privacy concern: Review of survey and observational instruments. International Journal of Human-Computer Studies, 71(12):1133-1143, 2013.\n\nTowards a model on the factors influencing social app users' valuation of interdependent privacy. Y Pu, J Grossklags, Proceedings on privacy enhancing technologies. on privacy enhancing technologies2016Y. Pu and J. Grossklags. Towards a model on the factors influencing social app users' valuation of interdependent privacy. Proceedings on privacy enhancing technologies, 2016(2):61-81, 2016.\n\nW Revelle, D M Condon, Reliability, The Wiley Handbook of Psychometric Testing: A Multidisciplinary Reference on Survey, Scale and Test Development. Wiley1st editionW. Revelle and D. M. Condon. Reliability. In The Wiley Handbook of Psychometric Testing: A Multidisciplinary Reference on Survey, Scale and Test Development, pages 709-749. Wiley, 1st edition, 2018.\n\nA model of consumers' perceptions of the invasion of information privacy. K S Schwaig, A H Segars, V Grover, K D Fiedler, Information & Management. 501K. S. Schwaig, A. H. Segars, V. Grover, and K. D. Fiedler. A model of consumers' perceptions of the invasion of infor- mation privacy. Information & Management, 50(1):1-12, 2013.\n\nEmpirically assessing the continued applicability of the iuipc construct. J C Sipior, B T Ward, R Connolly, Journal of Enterprise Information Management. J. C. Sipior, B. T. Ward, and R. Connolly. Empirically as- sessing the continued applicability of the iuipc construct. Journal of Enterprise Information Management, 2013.\n\nInformation privacy research: an interdisciplinary review. H J Smith, T Dinev, H Xu, MIS quarterly. H. J. Smith, T. Dinev, and H. Xu. Information privacy research: an interdisciplinary review. MIS quarterly, pages 989-1015, 2011.\n\nInformation privacy: measuring individuals' concerns about organizational practices. H J Smith, S J Milberg, S J Burke, MIS quarterly. H. J. Smith, S. J. Milberg, and S. J. Burke. Information privacy: measuring individuals' concerns about organizational practices. MIS quarterly, pages 167-196, 1996.\n\nAn empirical examination of the concern for information privacy instrument. K A Stewart, A H Segars, Information systems research. 131K. A. Stewart and A. H. Segars. An empirical examina- tion of the concern for information privacy instrument. Information systems research, 13(1):36-49, 2002.\n\nLikelihood ratio tests for model selection and non-nested hypotheses. Q H Vuong, Econometrica: Journal of the Econometric Society. Q. H. Vuong. Likelihood ratio tests for model selection and non-nested hypotheses. Econometrica: Journal of the Econometric Society, pages 307-333, 1989.\n\nExamining the formation of individual's privacy concerns: Toward an integrative view. H Xu, T Dinev, H J Smith, P Hart, proceedings. 6ICISH. Xu, T. Dinev, H. J. Smith, and P. Hart. Examining the formation of individual's privacy concerns: Toward an inte- grative view. ICIS 2008 proceedings, page 6, 2008.\n", "annotations": {"author": "[{\"end\":135,\"start\":94},{\"end\":135,\"start\":94}]", "publisher": null, "author_last_name": "[{\"end\":105,\"start\":101},{\"end\":105,\"start\":101}]", "author_first_name": "[{\"end\":100,\"start\":94},{\"end\":100,\"start\":94}]", "author_affiliation": null, "title": "[{\"end\":91,\"start\":1},{\"end\":226,\"start\":136},{\"end\":91,\"start\":1},{\"end\":226,\"start\":136}]", "venue": "[{\"end\":273,\"start\":228},{\"end\":273,\"start\":228}]", "abstract": "[{\"end\":2255,\"start\":441},{\"end\":2255,\"start\":441}]", "bib_ref": "[{\"attributes\":{\"ref_id\":\"b5\"},\"end\":2721,\"start\":2718},{\"attributes\":{\"ref_id\":\"b6\"},\"end\":2723,\"start\":2721},{\"attributes\":{\"ref_id\":\"b8\"},\"end\":2725,\"start\":2723},{\"attributes\":{\"ref_id\":\"b29\"},\"end\":2728,\"start\":2725},{\"attributes\":{\"ref_id\":\"b33\"},\"end\":2731,\"start\":2728},{\"attributes\":{\"ref_id\":\"b39\"},\"end\":2734,\"start\":2731},{\"attributes\":{\"ref_id\":\"b42\"},\"end\":2737,\"start\":2734},{\"attributes\":{\"ref_id\":\"b12\"},\"end\":2803,\"start\":2799},{\"attributes\":{\"ref_id\":\"b25\"},\"end\":2806,\"start\":2803},{\"attributes\":{\"ref_id\":\"b29\"},\"end\":2865,\"start\":2861},{\"attributes\":{\"ref_id\":\"b39\"},\"end\":3055,\"start\":3051},{\"attributes\":{\"ref_id\":\"b17\"},\"end\":3196,\"start\":3192},{\"attributes\":{\"ref_id\":\"b40\"},\"end\":3199,\"start\":3196},{\"attributes\":{\"ref_id\":\"b33\"},\"end\":3264,\"start\":3260},{\"attributes\":{\"ref_id\":\"b31\"},\"end\":3618,\"start\":3614},{\"attributes\":{\"ref_id\":\"b37\"},\"end\":3621,\"start\":3618},{\"attributes\":{\"ref_id\":\"b29\"},\"end\":4150,\"start\":4146},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":4235,\"start\":4232},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":4238,\"start\":4235},{\"attributes\":{\"ref_id\":\"b23\"},\"end\":4241,\"start\":4238},{\"attributes\":{\"ref_id\":\"b29\"},\"end\":5603,\"start\":5599},{\"attributes\":{\"ref_id\":\"b24\"},\"end\":5711,\"start\":5707},{\"end\":5872,\"start\":5860},{\"attributes\":{\"ref_id\":\"b38\"},\"end\":6416,\"start\":6412},{\"attributes\":{\"ref_id\":\"b12\"},\"end\":6712,\"start\":6708},{\"attributes\":{\"ref_id\":\"b33\"},\"end\":7410,\"start\":7406},{\"attributes\":{\"ref_id\":\"b39\"},\"end\":7558,\"start\":7554},{\"attributes\":{\"ref_id\":\"b8\"},\"end\":8050,\"start\":8047},{\"attributes\":{\"ref_id\":\"b6\"},\"end\":8680,\"start\":8677},{\"attributes\":{\"ref_id\":\"b29\"},\"end\":9319,\"start\":9315},{\"attributes\":{\"ref_id\":\"b39\"},\"end\":9445,\"start\":9441},{\"attributes\":{\"ref_id\":\"b40\"},\"end\":9606,\"start\":9602},{\"attributes\":{\"ref_id\":\"b17\"},\"end\":9642,\"start\":9638},{\"end\":9699,\"start\":9687},{\"attributes\":{\"ref_id\":\"b12\"},\"end\":10604,\"start\":10600},{\"attributes\":{\"ref_id\":\"b36\"},\"end\":10699,\"start\":10695},{\"attributes\":{\"ref_id\":\"b20\"},\"end\":10844,\"start\":10840},{\"attributes\":{\"ref_id\":\"b3\"},\"end\":10874,\"start\":10871},{\"attributes\":{\"ref_id\":\"b18\"},\"end\":11048,\"start\":11044},{\"attributes\":{\"ref_id\":\"b19\"},\"end\":11061,\"start\":11057},{\"attributes\":{\"ref_id\":\"b34\"},\"end\":11234,\"start\":11230},{\"attributes\":{\"ref_id\":\"b13\"},\"end\":11439,\"start\":11435},{\"attributes\":{\"ref_id\":\"b2\"},\"end\":11534,\"start\":11531},{\"attributes\":{\"ref_id\":\"b38\"},\"end\":11666,\"start\":11662},{\"attributes\":{\"ref_id\":\"b33\"},\"end\":11744,\"start\":11740},{\"attributes\":{\"ref_id\":\"b30\"},\"end\":12806,\"start\":12802},{\"end\":13400,\"start\":13388},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":14555,\"start\":14551},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":14782,\"start\":14779},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":14785,\"start\":14782},{\"attributes\":{\"ref_id\":\"b24\"},\"end\":14788,\"start\":14785},{\"end\":15423,\"start\":15411},{\"end\":15634,\"start\":15622},{\"end\":16462,\"start\":16450},{\"attributes\":{\"ref_id\":\"b21\"},\"end\":17074,\"start\":17070},{\"end\":17147,\"start\":17135},{\"attributes\":{\"ref_id\":\"b11\"},\"end\":17152,\"start\":17148},{\"attributes\":{\"ref_id\":\"b0\"},\"end\":17222,\"start\":17219},{\"attributes\":{\"ref_id\":\"b21\"},\"end\":17225,\"start\":17222},{\"end\":17339,\"start\":17328},{\"end\":17433,\"start\":17421},{\"end\":17513,\"start\":17501},{\"end\":17730,\"start\":17720},{\"end\":17968,\"start\":17955},{\"end\":18010,\"start\":17999},{\"end\":18089,\"start\":18076},{\"attributes\":{\"ref_id\":\"b26\"},\"end\":18412,\"start\":18408},{\"attributes\":{\"ref_id\":\"b26\"},\"end\":18568,\"start\":18564},{\"end\":18716,\"start\":18705},{\"end\":19322,\"start\":19311},{\"end\":19347,\"start\":19336},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":19508,\"start\":19505},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":19511,\"start\":19508},{\"end\":19592,\"start\":19581},{\"end\":19701,\"start\":19689},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":20955,\"start\":20952},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":21225,\"start\":21221},{\"attributes\":{\"ref_id\":\"b28\"},\"end\":21228,\"start\":21225},{\"attributes\":{\"ref_id\":\"b37\"},\"end\":21727,\"start\":21723},{\"end\":22493,\"start\":22482},{\"attributes\":{\"ref_id\":\"b29\"},\"end\":24240,\"start\":24236},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":25045,\"start\":25042},{\"end\":25046,\"start\":25045},{\"attributes\":{\"ref_id\":\"b29\"},\"end\":25120,\"start\":25116},{\"attributes\":{\"ref_id\":\"b2\"},\"end\":25590,\"start\":25589},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":28054,\"start\":28050},{\"attributes\":{\"ref_id\":\"b29\"},\"end\":30330,\"start\":30326},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":31169,\"start\":31166},{\"attributes\":{\"ref_id\":\"b29\"},\"end\":32314,\"start\":32310},{\"attributes\":{\"ref_id\":\"b41\"},\"end\":33154,\"start\":33150},{\"attributes\":{\"ref_id\":\"b29\"},\"end\":33599,\"start\":33595},{\"attributes\":{\"ref_id\":\"b22\"},\"end\":33918,\"start\":33914},{\"end\":34041,\"start\":34029},{\"attributes\":{\"ref_id\":\"b33\"},\"end\":36978,\"start\":36974},{\"end\":37223,\"start\":37212},{\"attributes\":{\"ref_id\":\"b22\"},\"end\":37791,\"start\":37787},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":38197,\"start\":38194},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":38200,\"start\":38197},{\"attributes\":{\"ref_id\":\"b29\"},\"end\":38532,\"start\":38528},{\"attributes\":{\"ref_id\":\"b22\"},\"end\":39078,\"start\":39074},{\"end\":43077,\"start\":43065},{\"end\":45686,\"start\":45679},{\"end\":47672,\"start\":47661},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":48833,\"start\":48831},{\"attributes\":{\"ref_id\":\"b29\"},\"end\":49184,\"start\":49180},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":50884,\"start\":50880},{\"end\":51025,\"start\":51018},{\"attributes\":{\"ref_id\":\"b7\"},\"end\":56160,\"start\":56157},{\"attributes\":{\"ref_id\":\"b32\"},\"end\":56163,\"start\":56160},{\"attributes\":{\"ref_id\":\"b35\"},\"end\":57221,\"start\":57217},{\"end\":58128,\"start\":58116},{\"end\":61145,\"start\":61134},{\"attributes\":{\"ref_id\":\"b29\"},\"end\":61437,\"start\":61433},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":64538,\"start\":64534},{\"end\":65903,\"start\":65890},{\"attributes\":{\"ref_id\":\"b29\"},\"end\":66586,\"start\":66582},{\"end\":67878,\"start\":67867},{\"end\":68027,\"start\":68015},{\"attributes\":{\"ref_id\":\"b27\"},\"end\":68046,\"start\":68042},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":68419,\"start\":68416},{\"end\":68632,\"start\":68621},{\"end\":68941,\"start\":68930},{\"attributes\":{\"ref_id\":\"b29\"},\"end\":69819,\"start\":69815},{\"end\":70072,\"start\":70060},{\"end\":70241,\"start\":70230},{\"end\":70311,\"start\":70300},{\"attributes\":{\"ref_id\":\"b41\"},\"end\":70426,\"start\":70422},{\"end\":70596,\"start\":70584},{\"attributes\":{\"ref_id\":\"b29\"},\"end\":75022,\"start\":75018},{\"attributes\":{\"ref_id\":\"b5\"},\"end\":2721,\"start\":2718},{\"attributes\":{\"ref_id\":\"b6\"},\"end\":2723,\"start\":2721},{\"attributes\":{\"ref_id\":\"b8\"},\"end\":2725,\"start\":2723},{\"attributes\":{\"ref_id\":\"b29\"},\"end\":2728,\"start\":2725},{\"attributes\":{\"ref_id\":\"b33\"},\"end\":2731,\"start\":2728},{\"attributes\":{\"ref_id\":\"b39\"},\"end\":2734,\"start\":2731},{\"attributes\":{\"ref_id\":\"b42\"},\"end\":2737,\"start\":2734},{\"attributes\":{\"ref_id\":\"b12\"},\"end\":2803,\"start\":2799},{\"attributes\":{\"ref_id\":\"b25\"},\"end\":2806,\"start\":2803},{\"attributes\":{\"ref_id\":\"b29\"},\"end\":2865,\"start\":2861},{\"attributes\":{\"ref_id\":\"b39\"},\"end\":3055,\"start\":3051},{\"attributes\":{\"ref_id\":\"b17\"},\"end\":3196,\"start\":3192},{\"attributes\":{\"ref_id\":\"b40\"},\"end\":3199,\"start\":3196},{\"attributes\":{\"ref_id\":\"b33\"},\"end\":3264,\"start\":3260},{\"attributes\":{\"ref_id\":\"b31\"},\"end\":3618,\"start\":3614},{\"attributes\":{\"ref_id\":\"b37\"},\"end\":3621,\"start\":3618},{\"attributes\":{\"ref_id\":\"b29\"},\"end\":4150,\"start\":4146},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":4235,\"start\":4232},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":4238,\"start\":4235},{\"attributes\":{\"ref_id\":\"b23\"},\"end\":4241,\"start\":4238},{\"attributes\":{\"ref_id\":\"b29\"},\"end\":5603,\"start\":5599},{\"attributes\":{\"ref_id\":\"b24\"},\"end\":5711,\"start\":5707},{\"end\":5872,\"start\":5860},{\"attributes\":{\"ref_id\":\"b38\"},\"end\":6416,\"start\":6412},{\"attributes\":{\"ref_id\":\"b12\"},\"end\":6712,\"start\":6708},{\"attributes\":{\"ref_id\":\"b33\"},\"end\":7410,\"start\":7406},{\"attributes\":{\"ref_id\":\"b39\"},\"end\":7558,\"start\":7554},{\"attributes\":{\"ref_id\":\"b8\"},\"end\":8050,\"start\":8047},{\"attributes\":{\"ref_id\":\"b6\"},\"end\":8680,\"start\":8677},{\"attributes\":{\"ref_id\":\"b29\"},\"end\":9319,\"start\":9315},{\"attributes\":{\"ref_id\":\"b39\"},\"end\":9445,\"start\":9441},{\"attributes\":{\"ref_id\":\"b40\"},\"end\":9606,\"start\":9602},{\"attributes\":{\"ref_id\":\"b17\"},\"end\":9642,\"start\":9638},{\"end\":9699,\"start\":9687},{\"attributes\":{\"ref_id\":\"b12\"},\"end\":10604,\"start\":10600},{\"attributes\":{\"ref_id\":\"b36\"},\"end\":10699,\"start\":10695},{\"attributes\":{\"ref_id\":\"b20\"},\"end\":10844,\"start\":10840},{\"attributes\":{\"ref_id\":\"b3\"},\"end\":10874,\"start\":10871},{\"attributes\":{\"ref_id\":\"b18\"},\"end\":11048,\"start\":11044},{\"attributes\":{\"ref_id\":\"b19\"},\"end\":11061,\"start\":11057},{\"attributes\":{\"ref_id\":\"b34\"},\"end\":11234,\"start\":11230},{\"attributes\":{\"ref_id\":\"b13\"},\"end\":11439,\"start\":11435},{\"attributes\":{\"ref_id\":\"b2\"},\"end\":11534,\"start\":11531},{\"attributes\":{\"ref_id\":\"b38\"},\"end\":11666,\"start\":11662},{\"attributes\":{\"ref_id\":\"b33\"},\"end\":11744,\"start\":11740},{\"attributes\":{\"ref_id\":\"b30\"},\"end\":12806,\"start\":12802},{\"end\":13400,\"start\":13388},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":14555,\"start\":14551},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":14782,\"start\":14779},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":14785,\"start\":14782},{\"attributes\":{\"ref_id\":\"b24\"},\"end\":14788,\"start\":14785},{\"end\":15423,\"start\":15411},{\"end\":15634,\"start\":15622},{\"end\":16462,\"start\":16450},{\"attributes\":{\"ref_id\":\"b21\"},\"end\":17074,\"start\":17070},{\"end\":17147,\"start\":17135},{\"attributes\":{\"ref_id\":\"b11\"},\"end\":17152,\"start\":17148},{\"attributes\":{\"ref_id\":\"b0\"},\"end\":17222,\"start\":17219},{\"attributes\":{\"ref_id\":\"b21\"},\"end\":17225,\"start\":17222},{\"end\":17339,\"start\":17328},{\"end\":17433,\"start\":17421},{\"end\":17513,\"start\":17501},{\"end\":17730,\"start\":17720},{\"end\":17968,\"start\":17955},{\"end\":18010,\"start\":17999},{\"end\":18089,\"start\":18076},{\"attributes\":{\"ref_id\":\"b26\"},\"end\":18412,\"start\":18408},{\"attributes\":{\"ref_id\":\"b26\"},\"end\":18568,\"start\":18564},{\"end\":18716,\"start\":18705},{\"end\":19322,\"start\":19311},{\"end\":19347,\"start\":19336},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":19508,\"start\":19505},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":19511,\"start\":19508},{\"end\":19592,\"start\":19581},{\"end\":19701,\"start\":19689},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":20955,\"start\":20952},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":21225,\"start\":21221},{\"attributes\":{\"ref_id\":\"b28\"},\"end\":21228,\"start\":21225},{\"attributes\":{\"ref_id\":\"b37\"},\"end\":21727,\"start\":21723},{\"end\":22493,\"start\":22482},{\"attributes\":{\"ref_id\":\"b29\"},\"end\":24240,\"start\":24236},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":25045,\"start\":25042},{\"end\":25046,\"start\":25045},{\"attributes\":{\"ref_id\":\"b29\"},\"end\":25120,\"start\":25116},{\"attributes\":{\"ref_id\":\"b2\"},\"end\":25590,\"start\":25589},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":28054,\"start\":28050},{\"attributes\":{\"ref_id\":\"b29\"},\"end\":30330,\"start\":30326},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":31169,\"start\":31166},{\"attributes\":{\"ref_id\":\"b29\"},\"end\":32314,\"start\":32310},{\"attributes\":{\"ref_id\":\"b41\"},\"end\":33154,\"start\":33150},{\"attributes\":{\"ref_id\":\"b29\"},\"end\":33599,\"start\":33595},{\"attributes\":{\"ref_id\":\"b22\"},\"end\":33918,\"start\":33914},{\"end\":34041,\"start\":34029},{\"attributes\":{\"ref_id\":\"b33\"},\"end\":36978,\"start\":36974},{\"end\":37223,\"start\":37212},{\"attributes\":{\"ref_id\":\"b22\"},\"end\":37791,\"start\":37787},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":38197,\"start\":38194},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":38200,\"start\":38197},{\"attributes\":{\"ref_id\":\"b29\"},\"end\":38532,\"start\":38528},{\"attributes\":{\"ref_id\":\"b22\"},\"end\":39078,\"start\":39074},{\"end\":43077,\"start\":43065},{\"end\":45686,\"start\":45679},{\"end\":47672,\"start\":47661},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":48833,\"start\":48831},{\"attributes\":{\"ref_id\":\"b29\"},\"end\":49184,\"start\":49180},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":50884,\"start\":50880},{\"end\":51025,\"start\":51018},{\"attributes\":{\"ref_id\":\"b7\"},\"end\":56160,\"start\":56157},{\"attributes\":{\"ref_id\":\"b32\"},\"end\":56163,\"start\":56160},{\"attributes\":{\"ref_id\":\"b35\"},\"end\":57221,\"start\":57217},{\"end\":58128,\"start\":58116},{\"end\":61145,\"start\":61134},{\"attributes\":{\"ref_id\":\"b29\"},\"end\":61437,\"start\":61433},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":64538,\"start\":64534},{\"end\":65903,\"start\":65890},{\"attributes\":{\"ref_id\":\"b29\"},\"end\":66586,\"start\":66582},{\"end\":67878,\"start\":67867},{\"end\":68027,\"start\":68015},{\"attributes\":{\"ref_id\":\"b27\"},\"end\":68046,\"start\":68042},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":68419,\"start\":68416},{\"end\":68632,\"start\":68621},{\"end\":68941,\"start\":68930},{\"attributes\":{\"ref_id\":\"b29\"},\"end\":69819,\"start\":69815},{\"end\":70072,\"start\":70060},{\"end\":70241,\"start\":70230},{\"end\":70311,\"start\":70300},{\"attributes\":{\"ref_id\":\"b41\"},\"end\":70426,\"start\":70422},{\"end\":70596,\"start\":70584},{\"attributes\":{\"ref_id\":\"b29\"},\"end\":75022,\"start\":75018}]", "figure": "[{\"attributes\":{\"id\":\"fig_0\"},\"end\":71263,\"start\":71154},{\"attributes\":{\"id\":\"fig_1\"},\"end\":72343,\"start\":71264},{\"attributes\":{\"id\":\"fig_2\"},\"end\":73268,\"start\":72344},{\"attributes\":{\"id\":\"fig_3\"},\"end\":73335,\"start\":73269},{\"attributes\":{\"id\":\"fig_5\"},\"end\":73415,\"start\":73336},{\"attributes\":{\"id\":\"tab_0\",\"type\":\"table\"},\"end\":73882,\"start\":73416},{\"attributes\":{\"id\":\"tab_1\",\"type\":\"table\"},\"end\":74540,\"start\":73883},{\"attributes\":{\"id\":\"tab_2\",\"type\":\"table\"},\"end\":74963,\"start\":74541},{\"attributes\":{\"id\":\"tab_3\",\"type\":\"table\"},\"end\":75600,\"start\":74964},{\"attributes\":{\"id\":\"tab_4\",\"type\":\"table\"},\"end\":75857,\"start\":75601},{\"attributes\":{\"id\":\"tab_5\",\"type\":\"table\"},\"end\":76671,\"start\":75858},{\"attributes\":{\"id\":\"tab_6\",\"type\":\"table\"},\"end\":77001,\"start\":76672},{\"attributes\":{\"id\":\"tab_8\",\"type\":\"table\"},\"end\":77478,\"start\":77002},{\"attributes\":{\"id\":\"tab_9\",\"type\":\"table\"},\"end\":77877,\"start\":77479},{\"attributes\":{\"id\":\"tab_10\",\"type\":\"table\"},\"end\":79141,\"start\":77878},{\"attributes\":{\"id\":\"tab_11\",\"type\":\"table\"},\"end\":80864,\"start\":79142},{\"attributes\":{\"id\":\"tab_12\",\"type\":\"table\"},\"end\":81000,\"start\":80865},{\"attributes\":{\"id\":\"tab_13\",\"type\":\"table\"},\"end\":81721,\"start\":81001},{\"attributes\":{\"id\":\"tab_14\",\"type\":\"table\"},\"end\":81909,\"start\":81722},{\"attributes\":{\"id\":\"tab_15\",\"type\":\"table\"},\"end\":84293,\"start\":81910},{\"attributes\":{\"id\":\"tab_16\",\"type\":\"table\"},\"end\":84659,\"start\":84294},{\"attributes\":{\"id\":\"fig_0\"},\"end\":71263,\"start\":71154},{\"attributes\":{\"id\":\"fig_1\"},\"end\":72343,\"start\":71264},{\"attributes\":{\"id\":\"fig_2\"},\"end\":73268,\"start\":72344},{\"attributes\":{\"id\":\"fig_3\"},\"end\":73335,\"start\":73269},{\"attributes\":{\"id\":\"fig_5\"},\"end\":73415,\"start\":73336},{\"attributes\":{\"id\":\"tab_0\",\"type\":\"table\"},\"end\":73882,\"start\":73416},{\"attributes\":{\"id\":\"tab_1\",\"type\":\"table\"},\"end\":74540,\"start\":73883},{\"attributes\":{\"id\":\"tab_2\",\"type\":\"table\"},\"end\":74963,\"start\":74541},{\"attributes\":{\"id\":\"tab_3\",\"type\":\"table\"},\"end\":75600,\"start\":74964},{\"attributes\":{\"id\":\"tab_4\",\"type\":\"table\"},\"end\":75857,\"start\":75601},{\"attributes\":{\"id\":\"tab_5\",\"type\":\"table\"},\"end\":76671,\"start\":75858},{\"attributes\":{\"id\":\"tab_6\",\"type\":\"table\"},\"end\":77001,\"start\":76672},{\"attributes\":{\"id\":\"tab_8\",\"type\":\"table\"},\"end\":77478,\"start\":77002},{\"attributes\":{\"id\":\"tab_9\",\"type\":\"table\"},\"end\":77877,\"start\":77479},{\"attributes\":{\"id\":\"tab_10\",\"type\":\"table\"},\"end\":79141,\"start\":77878},{\"attributes\":{\"id\":\"tab_11\",\"type\":\"table\"},\"end\":80864,\"start\":79142},{\"attributes\":{\"id\":\"tab_12\",\"type\":\"table\"},\"end\":81000,\"start\":80865},{\"attributes\":{\"id\":\"tab_13\",\"type\":\"table\"},\"end\":81721,\"start\":81001},{\"attributes\":{\"id\":\"tab_14\",\"type\":\"table\"},\"end\":81909,\"start\":81722},{\"attributes\":{\"id\":\"tab_15\",\"type\":\"table\"},\"end\":84293,\"start\":81910},{\"attributes\":{\"id\":\"tab_16\",\"type\":\"table\"},\"end\":84659,\"start\":84294}]", "paragraph": "[{\"end\":2629,\"start\":2271},{\"end\":2991,\"start\":2631},{\"end\":3286,\"start\":2993},{\"end\":3777,\"start\":3288},{\"end\":4445,\"start\":3779},{\"end\":5712,\"start\":4468},{\"end\":6281,\"start\":5757},{\"end\":7154,\"start\":6283},{\"end\":8013,\"start\":7156},{\"end\":8589,\"start\":8015},{\"end\":9089,\"start\":8591},{\"end\":9199,\"start\":9091},{\"end\":9669,\"start\":9220},{\"end\":10380,\"start\":9671},{\"end\":11062,\"start\":10448},{\"end\":11614,\"start\":11064},{\"end\":12055,\"start\":11616},{\"end\":12462,\"start\":12084},{\"end\":12966,\"start\":12464},{\"end\":13684,\"start\":12987},{\"end\":14213,\"start\":13686},{\"end\":15389,\"start\":14236},{\"end\":16464,\"start\":15391},{\"end\":16829,\"start\":16466},{\"end\":17226,\"start\":16873},{\"end\":18748,\"start\":17242},{\"end\":19152,\"start\":18787},{\"end\":19512,\"start\":19154},{\"end\":20498,\"start\":19514},{\"end\":21096,\"start\":20500},{\"end\":21692,\"start\":21098},{\"end\":22473,\"start\":21709},{\"end\":23487,\"start\":22475},{\"end\":23753,\"start\":23489},{\"end\":23928,\"start\":23796},{\"end\":24106,\"start\":23966},{\"end\":24295,\"start\":24145},{\"end\":24627,\"start\":24406},{\"end\":25261,\"start\":24629},{\"end\":25866,\"start\":25376},{\"end\":26027,\"start\":25890},{\"end\":26469,\"start\":26163},{\"end\":26654,\"start\":26471},{\"end\":27033,\"start\":26766},{\"end\":27229,\"start\":27035},{\"end\":27714,\"start\":27231},{\"end\":28224,\"start\":27725},{\"end\":28942,\"start\":28235},{\"end\":29123,\"start\":28953},{\"end\":29359,\"start\":29125},{\"end\":29911,\"start\":29361},{\"end\":30247,\"start\":29913},{\"end\":30590,\"start\":30269},{\"end\":31062,\"start\":30592},{\"end\":32073,\"start\":31064},{\"end\":32677,\"start\":32075},{\"end\":33283,\"start\":32679},{\"end\":33516,\"start\":33285},{\"end\":33996,\"start\":33539},{\"end\":34598,\"start\":34017},{\"end\":35491,\"start\":34600},{\"end\":35964,\"start\":35493},{\"end\":36436,\"start\":35966},{\"end\":36795,\"start\":36438},{\"end\":37039,\"start\":36797},{\"end\":37576,\"start\":37050},{\"end\":38374,\"start\":37613},{\"end\":38940,\"start\":38397},{\"end\":39240,\"start\":38942},{\"end\":40096,\"start\":39281},{\"end\":40491,\"start\":40112},{\"end\":40723,\"start\":40503},{\"end\":41484,\"start\":40725},{\"end\":42179,\"start\":41518},{\"end\":43078,\"start\":42206},{\"end\":43280,\"start\":43080},{\"end\":44233,\"start\":43324},{\"end\":44455,\"start\":44248},{\"end\":44993,\"start\":44457},{\"end\":45319,\"start\":45007},{\"end\":46312,\"start\":45360},{\"end\":46441,\"start\":46314},{\"end\":47218,\"start\":46479},{\"end\":47288,\"start\":47239},{\"end\":48140,\"start\":47353},{\"end\":48370,\"start\":48155},{\"end\":48694,\"start\":48372},{\"end\":48984,\"start\":48696},{\"end\":49576,\"start\":48996},{\"end\":50219,\"start\":49600},{\"end\":50695,\"start\":50221},{\"end\":51617,\"start\":50697},{\"end\":52049,\"start\":51619},{\"end\":52145,\"start\":52051},{\"end\":53066,\"start\":52194},{\"end\":53427,\"start\":53068},{\"end\":53972,\"start\":53467},{\"end\":54876,\"start\":53974},{\"end\":55550,\"start\":54913},{\"end\":55980,\"start\":55552},{\"end\":56164,\"start\":55982},{\"end\":56802,\"start\":56185},{\"end\":57067,\"start\":56804},{\"end\":57483,\"start\":57069},{\"end\":59060,\"start\":57485},{\"end\":59761,\"start\":59062},{\"end\":60397,\"start\":59763},{\"end\":60785,\"start\":60413},{\"end\":61218,\"start\":60787},{\"end\":62471,\"start\":61233},{\"end\":63089,\"start\":62473},{\"end\":63566,\"start\":63109},{\"end\":63822,\"start\":63591},{\"end\":64052,\"start\":63824},{\"end\":64594,\"start\":64078},{\"end\":64994,\"start\":64616},{\"end\":65904,\"start\":64996},{\"end\":66287,\"start\":65906},{\"end\":66596,\"start\":66328},{\"end\":66611,\"start\":66598},{\"end\":66809,\"start\":66633},{\"end\":67021,\"start\":66811},{\"end\":67356,\"start\":67041},{\"end\":67463,\"start\":67381},{\"end\":67570,\"start\":67465},{\"end\":67649,\"start\":67572},{\"end\":67741,\"start\":67651},{\"end\":68029,\"start\":67743},{\"end\":68720,\"start\":68031},{\"end\":69087,\"start\":68749},{\"end\":69236,\"start\":69096},{\"end\":69797,\"start\":69290},{\"end\":70044,\"start\":69799},{\"end\":70494,\"start\":70046},{\"end\":70597,\"start\":70496},{\"end\":70949,\"start\":70637},{\"end\":71153,\"start\":70975},{\"end\":2629,\"start\":2271},{\"end\":2991,\"start\":2631},{\"end\":3286,\"start\":2993},{\"end\":3777,\"start\":3288},{\"end\":4445,\"start\":3779},{\"end\":5712,\"start\":4468},{\"end\":6281,\"start\":5757},{\"end\":7154,\"start\":6283},{\"end\":8013,\"start\":7156},{\"end\":8589,\"start\":8015},{\"end\":9089,\"start\":8591},{\"end\":9199,\"start\":9091},{\"end\":9669,\"start\":9220},{\"end\":10380,\"start\":9671},{\"end\":11062,\"start\":10448},{\"end\":11614,\"start\":11064},{\"end\":12055,\"start\":11616},{\"end\":12462,\"start\":12084},{\"end\":12966,\"start\":12464},{\"end\":13684,\"start\":12987},{\"end\":14213,\"start\":13686},{\"end\":15389,\"start\":14236},{\"end\":16464,\"start\":15391},{\"end\":16829,\"start\":16466},{\"end\":17226,\"start\":16873},{\"end\":18748,\"start\":17242},{\"end\":19152,\"start\":18787},{\"end\":19512,\"start\":19154},{\"end\":20498,\"start\":19514},{\"end\":21096,\"start\":20500},{\"end\":21692,\"start\":21098},{\"end\":22473,\"start\":21709},{\"end\":23487,\"start\":22475},{\"end\":23753,\"start\":23489},{\"end\":23928,\"start\":23796},{\"end\":24106,\"start\":23966},{\"end\":24295,\"start\":24145},{\"end\":24627,\"start\":24406},{\"end\":25261,\"start\":24629},{\"end\":25866,\"start\":25376},{\"end\":26027,\"start\":25890},{\"end\":26469,\"start\":26163},{\"end\":26654,\"start\":26471},{\"end\":27033,\"start\":26766},{\"end\":27229,\"start\":27035},{\"end\":27714,\"start\":27231},{\"end\":28224,\"start\":27725},{\"end\":28942,\"start\":28235},{\"end\":29123,\"start\":28953},{\"end\":29359,\"start\":29125},{\"end\":29911,\"start\":29361},{\"end\":30247,\"start\":29913},{\"end\":30590,\"start\":30269},{\"end\":31062,\"start\":30592},{\"end\":32073,\"start\":31064},{\"end\":32677,\"start\":32075},{\"end\":33283,\"start\":32679},{\"end\":33516,\"start\":33285},{\"end\":33996,\"start\":33539},{\"end\":34598,\"start\":34017},{\"end\":35491,\"start\":34600},{\"end\":35964,\"start\":35493},{\"end\":36436,\"start\":35966},{\"end\":36795,\"start\":36438},{\"end\":37039,\"start\":36797},{\"end\":37576,\"start\":37050},{\"end\":38374,\"start\":37613},{\"end\":38940,\"start\":38397},{\"end\":39240,\"start\":38942},{\"end\":40096,\"start\":39281},{\"end\":40491,\"start\":40112},{\"end\":40723,\"start\":40503},{\"end\":41484,\"start\":40725},{\"end\":42179,\"start\":41518},{\"end\":43078,\"start\":42206},{\"end\":43280,\"start\":43080},{\"end\":44233,\"start\":43324},{\"end\":44455,\"start\":44248},{\"end\":44993,\"start\":44457},{\"end\":45319,\"start\":45007},{\"end\":46312,\"start\":45360},{\"end\":46441,\"start\":46314},{\"end\":47218,\"start\":46479},{\"end\":47288,\"start\":47239},{\"end\":48140,\"start\":47353},{\"end\":48370,\"start\":48155},{\"end\":48694,\"start\":48372},{\"end\":48984,\"start\":48696},{\"end\":49576,\"start\":48996},{\"end\":50219,\"start\":49600},{\"end\":50695,\"start\":50221},{\"end\":51617,\"start\":50697},{\"end\":52049,\"start\":51619},{\"end\":52145,\"start\":52051},{\"end\":53066,\"start\":52194},{\"end\":53427,\"start\":53068},{\"end\":53972,\"start\":53467},{\"end\":54876,\"start\":53974},{\"end\":55550,\"start\":54913},{\"end\":55980,\"start\":55552},{\"end\":56164,\"start\":55982},{\"end\":56802,\"start\":56185},{\"end\":57067,\"start\":56804},{\"end\":57483,\"start\":57069},{\"end\":59060,\"start\":57485},{\"end\":59761,\"start\":59062},{\"end\":60397,\"start\":59763},{\"end\":60785,\"start\":60413},{\"end\":61218,\"start\":60787},{\"end\":62471,\"start\":61233},{\"end\":63089,\"start\":62473},{\"end\":63566,\"start\":63109},{\"end\":63822,\"start\":63591},{\"end\":64052,\"start\":63824},{\"end\":64594,\"start\":64078},{\"end\":64994,\"start\":64616},{\"end\":65904,\"start\":64996},{\"end\":66287,\"start\":65906},{\"end\":66596,\"start\":66328},{\"end\":66611,\"start\":66598},{\"end\":66809,\"start\":66633},{\"end\":67021,\"start\":66811},{\"end\":67356,\"start\":67041},{\"end\":67463,\"start\":67381},{\"end\":67570,\"start\":67465},{\"end\":67649,\"start\":67572},{\"end\":67741,\"start\":67651},{\"end\":68029,\"start\":67743},{\"end\":68720,\"start\":68031},{\"end\":69087,\"start\":68749},{\"end\":69236,\"start\":69096},{\"end\":69797,\"start\":69290},{\"end\":70044,\"start\":69799},{\"end\":70494,\"start\":70046},{\"end\":70597,\"start\":70496},{\"end\":70949,\"start\":70637},{\"end\":71153,\"start\":70975}]", "formula": "[{\"attributes\":{\"id\":\"formula_0\"},\"end\":25375,\"start\":25262},{\"attributes\":{\"id\":\"formula_1\"},\"end\":47334,\"start\":47289},{\"attributes\":{\"id\":\"formula_2\"},\"end\":66632,\"start\":66612},{\"attributes\":{\"id\":\"formula_3\"},\"end\":67380,\"start\":67357},{\"attributes\":{\"id\":\"formula_4\"},\"end\":70636,\"start\":70598},{\"attributes\":{\"id\":\"formula_0\"},\"end\":25375,\"start\":25262},{\"attributes\":{\"id\":\"formula_1\"},\"end\":47334,\"start\":47289},{\"attributes\":{\"id\":\"formula_2\"},\"end\":66632,\"start\":66612},{\"attributes\":{\"id\":\"formula_3\"},\"end\":67380,\"start\":67357},{\"attributes\":{\"id\":\"formula_4\"},\"end\":70636,\"start\":70598}]", "table_ref": "[{\"end\":34777,\"start\":34770},{\"attributes\":{\"ref_id\":\"tab_2\"},\"end\":38543,\"start\":38536},{\"attributes\":{\"ref_id\":\"tab_3\"},\"end\":40178,\"start\":40171},{\"attributes\":{\"ref_id\":\"tab_4\"},\"end\":41582,\"start\":41575},{\"attributes\":{\"ref_id\":\"tab_6\"},\"end\":42800,\"start\":42793},{\"attributes\":{\"ref_id\":\"tab_2\"},\"end\":43567,\"start\":43559},{\"attributes\":{\"ref_id\":\"tab_8\"},\"end\":44420,\"start\":44413},{\"end\":45441,\"start\":45434},{\"end\":46004,\"start\":45997},{\"end\":46561,\"start\":46554},{\"end\":46824,\"start\":46817},{\"attributes\":{\"ref_id\":\"tab_2\"},\"end\":48369,\"start\":48361},{\"end\":52396,\"start\":52389},{\"end\":53654,\"start\":53647},{\"attributes\":{\"ref_id\":\"tab_2\"},\"end\":63821,\"start\":63813},{\"attributes\":{\"ref_id\":\"tab_2\"},\"end\":63894,\"start\":63886},{\"attributes\":{\"ref_id\":\"tab_2\"},\"end\":64265,\"start\":64257},{\"attributes\":{\"ref_id\":\"tab_2\"},\"end\":64350,\"start\":64342},{\"attributes\":{\"ref_id\":\"tab_2\"},\"end\":64452,\"start\":64444},{\"end\":66500,\"start\":66493},{\"end\":34777,\"start\":34770},{\"attributes\":{\"ref_id\":\"tab_2\"},\"end\":38543,\"start\":38536},{\"attributes\":{\"ref_id\":\"tab_3\"},\"end\":40178,\"start\":40171},{\"attributes\":{\"ref_id\":\"tab_4\"},\"end\":41582,\"start\":41575},{\"attributes\":{\"ref_id\":\"tab_6\"},\"end\":42800,\"start\":42793},{\"attributes\":{\"ref_id\":\"tab_2\"},\"end\":43567,\"start\":43559},{\"attributes\":{\"ref_id\":\"tab_8\"},\"end\":44420,\"start\":44413},{\"end\":45441,\"start\":45434},{\"end\":46004,\"start\":45997},{\"end\":46561,\"start\":46554},{\"end\":46824,\"start\":46817},{\"attributes\":{\"ref_id\":\"tab_2\"},\"end\":48369,\"start\":48361},{\"end\":52396,\"start\":52389},{\"end\":53654,\"start\":53647},{\"attributes\":{\"ref_id\":\"tab_2\"},\"end\":63821,\"start\":63813},{\"attributes\":{\"ref_id\":\"tab_2\"},\"end\":63894,\"start\":63886},{\"attributes\":{\"ref_id\":\"tab_2\"},\"end\":64265,\"start\":64257},{\"attributes\":{\"ref_id\":\"tab_2\"},\"end\":64350,\"start\":64342},{\"attributes\":{\"ref_id\":\"tab_2\"},\"end\":64452,\"start\":64444},{\"end\":66500,\"start\":66493}]", "section_header": "[{\"attributes\":{\"n\":\"1\"},\"end\":2269,\"start\":2257},{\"end\":4466,\"start\":4448},{\"attributes\":{\"n\":\"2\"},\"end\":5725,\"start\":5715},{\"attributes\":{\"n\":\"2.1\"},\"end\":5755,\"start\":5728},{\"attributes\":{\"n\":\"2.1.1\"},\"end\":9218,\"start\":9202},{\"attributes\":{\"n\":\"2.1.2\"},\"end\":10446,\"start\":10383},{\"attributes\":{\"n\":\"2.2\"},\"end\":12082,\"start\":12058},{\"attributes\":{\"n\":\"2.2.1\"},\"end\":12985,\"start\":12969},{\"attributes\":{\"n\":\"2.2.2\"},\"end\":14234,\"start\":14216},{\"end\":16871,\"start\":16832},{\"attributes\":{\"n\":\"2.2.3\"},\"end\":17240,\"start\":17229},{\"attributes\":{\"n\":\"2.3\"},\"end\":18785,\"start\":18751},{\"attributes\":{\"n\":\"3\"},\"end\":21707,\"start\":21695},{\"attributes\":{\"n\":\"4\"},\"end\":23760,\"start\":23756},{\"attributes\":{\"n\":\"4.1\"},\"end\":23794,\"start\":23763},{\"end\":23964,\"start\":23931},{\"attributes\":{\"n\":\"4.2\"},\"end\":24143,\"start\":24109},{\"end\":24404,\"start\":24298},{\"attributes\":{\"n\":\"4.3\"},\"end\":25888,\"start\":25869},{\"end\":26161,\"start\":26030},{\"end\":26764,\"start\":26657},{\"attributes\":{\"n\":\"5\"},\"end\":27723,\"start\":27717},{\"attributes\":{\"n\":\"5.1\"},\"end\":28233,\"start\":28227},{\"attributes\":{\"n\":\"5.2\"},\"end\":28951,\"start\":28945},{\"attributes\":{\"n\":\"5.3\"},\"end\":30267,\"start\":30250},{\"attributes\":{\"n\":\"6\"},\"end\":33537,\"start\":33519},{\"attributes\":{\"n\":\"6.1\"},\"end\":34015,\"start\":33999},{\"attributes\":{\"n\":\"6.2\"},\"end\":37048,\"start\":37042},{\"attributes\":{\"n\":\"6.3\"},\"end\":37597,\"start\":37579},{\"attributes\":{\"n\":\"6.3.1\"},\"end\":37611,\"start\":37600},{\"attributes\":{\"n\":\"6.3.2\"},\"end\":38395,\"start\":38377},{\"attributes\":{\"n\":\"6.3.3\"},\"end\":39279,\"start\":39243},{\"attributes\":{\"n\":\"6.4\"},\"end\":40110,\"start\":40099},{\"attributes\":{\"n\":\"6.5\"},\"end\":40501,\"start\":40494},{\"attributes\":{\"n\":\"7\"},\"end\":41507,\"start\":41487},{\"attributes\":{\"n\":\"7.1\"},\"end\":41516,\"start\":41510},{\"attributes\":{\"n\":\"7.2\"},\"end\":42204,\"start\":42182},{\"attributes\":{\"n\":\"7.3\"},\"end\":43301,\"start\":43283},{\"attributes\":{\"n\":\"7.3.1\"},\"end\":43322,\"start\":43304},{\"end\":44246,\"start\":44236},{\"end\":45005,\"start\":44996},{\"attributes\":{\"n\":\"7.3.2\"},\"end\":45358,\"start\":45322},{\"attributes\":{\"n\":\"7.4\"},\"end\":46477,\"start\":46444},{\"end\":47237,\"start\":47221},{\"attributes\":{\"n\":\"7.5\"},\"end\":47351,\"start\":47336},{\"attributes\":{\"n\":\"7.6\"},\"end\":48153,\"start\":48143},{\"attributes\":{\"n\":\"7.7\"},\"end\":48994,\"start\":48987},{\"attributes\":{\"n\":\"7.8\"},\"end\":49598,\"start\":49579},{\"attributes\":{\"n\":\"8\"},\"end\":52158,\"start\":52148},{\"attributes\":{\"n\":\"8.1\"},\"end\":52192,\"start\":52161},{\"attributes\":{\"n\":\"8.2\"},\"end\":53465,\"start\":53430},{\"attributes\":{\"n\":\"8.3\"},\"end\":54911,\"start\":54879},{\"attributes\":{\"n\":\"8.4\"},\"end\":56183,\"start\":56167},{\"attributes\":{\"n\":\"8.5\"},\"end\":60411,\"start\":60400},{\"attributes\":{\"n\":\"9\"},\"end\":61231,\"start\":61221},{\"end\":63107,\"start\":63092},{\"end\":63589,\"start\":63569},{\"end\":64076,\"start\":64055},{\"end\":64614,\"start\":64597},{\"end\":66326,\"start\":66290},{\"end\":67039,\"start\":67024},{\"end\":68747,\"start\":68723},{\"end\":69094,\"start\":69090},{\"end\":69288,\"start\":69239},{\"end\":70973,\"start\":70952},{\"end\":71160,\"start\":71155},{\"end\":71273,\"start\":71265},{\"end\":72363,\"start\":72345},{\"end\":73278,\"start\":73270},{\"end\":74551,\"start\":74542},{\"end\":74974,\"start\":74965},{\"end\":75611,\"start\":75602},{\"end\":75868,\"start\":75859},{\"end\":76682,\"start\":76673},{\"end\":77010,\"start\":77003},{\"end\":77888,\"start\":77879},{\"end\":79153,\"start\":79143},{\"end\":80876,\"start\":80866},{\"end\":81012,\"start\":81002},{\"end\":81733,\"start\":81723},{\"end\":84305,\"start\":84295},{\"attributes\":{\"n\":\"1\"},\"end\":2269,\"start\":2257},{\"end\":4466,\"start\":4448},{\"attributes\":{\"n\":\"2\"},\"end\":5725,\"start\":5715},{\"attributes\":{\"n\":\"2.1\"},\"end\":5755,\"start\":5728},{\"attributes\":{\"n\":\"2.1.1\"},\"end\":9218,\"start\":9202},{\"attributes\":{\"n\":\"2.1.2\"},\"end\":10446,\"start\":10383},{\"attributes\":{\"n\":\"2.2\"},\"end\":12082,\"start\":12058},{\"attributes\":{\"n\":\"2.2.1\"},\"end\":12985,\"start\":12969},{\"attributes\":{\"n\":\"2.2.2\"},\"end\":14234,\"start\":14216},{\"end\":16871,\"start\":16832},{\"attributes\":{\"n\":\"2.2.3\"},\"end\":17240,\"start\":17229},{\"attributes\":{\"n\":\"2.3\"},\"end\":18785,\"start\":18751},{\"attributes\":{\"n\":\"3\"},\"end\":21707,\"start\":21695},{\"attributes\":{\"n\":\"4\"},\"end\":23760,\"start\":23756},{\"attributes\":{\"n\":\"4.1\"},\"end\":23794,\"start\":23763},{\"end\":23964,\"start\":23931},{\"attributes\":{\"n\":\"4.2\"},\"end\":24143,\"start\":24109},{\"end\":24404,\"start\":24298},{\"attributes\":{\"n\":\"4.3\"},\"end\":25888,\"start\":25869},{\"end\":26161,\"start\":26030},{\"end\":26764,\"start\":26657},{\"attributes\":{\"n\":\"5\"},\"end\":27723,\"start\":27717},{\"attributes\":{\"n\":\"5.1\"},\"end\":28233,\"start\":28227},{\"attributes\":{\"n\":\"5.2\"},\"end\":28951,\"start\":28945},{\"attributes\":{\"n\":\"5.3\"},\"end\":30267,\"start\":30250},{\"attributes\":{\"n\":\"6\"},\"end\":33537,\"start\":33519},{\"attributes\":{\"n\":\"6.1\"},\"end\":34015,\"start\":33999},{\"attributes\":{\"n\":\"6.2\"},\"end\":37048,\"start\":37042},{\"attributes\":{\"n\":\"6.3\"},\"end\":37597,\"start\":37579},{\"attributes\":{\"n\":\"6.3.1\"},\"end\":37611,\"start\":37600},{\"attributes\":{\"n\":\"6.3.2\"},\"end\":38395,\"start\":38377},{\"attributes\":{\"n\":\"6.3.3\"},\"end\":39279,\"start\":39243},{\"attributes\":{\"n\":\"6.4\"},\"end\":40110,\"start\":40099},{\"attributes\":{\"n\":\"6.5\"},\"end\":40501,\"start\":40494},{\"attributes\":{\"n\":\"7\"},\"end\":41507,\"start\":41487},{\"attributes\":{\"n\":\"7.1\"},\"end\":41516,\"start\":41510},{\"attributes\":{\"n\":\"7.2\"},\"end\":42204,\"start\":42182},{\"attributes\":{\"n\":\"7.3\"},\"end\":43301,\"start\":43283},{\"attributes\":{\"n\":\"7.3.1\"},\"end\":43322,\"start\":43304},{\"end\":44246,\"start\":44236},{\"end\":45005,\"start\":44996},{\"attributes\":{\"n\":\"7.3.2\"},\"end\":45358,\"start\":45322},{\"attributes\":{\"n\":\"7.4\"},\"end\":46477,\"start\":46444},{\"end\":47237,\"start\":47221},{\"attributes\":{\"n\":\"7.5\"},\"end\":47351,\"start\":47336},{\"attributes\":{\"n\":\"7.6\"},\"end\":48153,\"start\":48143},{\"attributes\":{\"n\":\"7.7\"},\"end\":48994,\"start\":48987},{\"attributes\":{\"n\":\"7.8\"},\"end\":49598,\"start\":49579},{\"attributes\":{\"n\":\"8\"},\"end\":52158,\"start\":52148},{\"attributes\":{\"n\":\"8.1\"},\"end\":52192,\"start\":52161},{\"attributes\":{\"n\":\"8.2\"},\"end\":53465,\"start\":53430},{\"attributes\":{\"n\":\"8.3\"},\"end\":54911,\"start\":54879},{\"attributes\":{\"n\":\"8.4\"},\"end\":56183,\"start\":56167},{\"attributes\":{\"n\":\"8.5\"},\"end\":60411,\"start\":60400},{\"attributes\":{\"n\":\"9\"},\"end\":61231,\"start\":61221},{\"end\":63107,\"start\":63092},{\"end\":63589,\"start\":63569},{\"end\":64076,\"start\":64055},{\"end\":64614,\"start\":64597},{\"end\":66326,\"start\":66290},{\"end\":67039,\"start\":67024},{\"end\":68747,\"start\":68723},{\"end\":69094,\"start\":69090},{\"end\":69288,\"start\":69239},{\"end\":70973,\"start\":70952},{\"end\":71160,\"start\":71155},{\"end\":71273,\"start\":71265},{\"end\":72363,\"start\":72345},{\"end\":73278,\"start\":73270},{\"end\":74551,\"start\":74542},{\"end\":74974,\"start\":74965},{\"end\":75611,\"start\":75602},{\"end\":75868,\"start\":75859},{\"end\":76682,\"start\":76673},{\"end\":77010,\"start\":77003},{\"end\":77888,\"start\":77879},{\"end\":79153,\"start\":79143},{\"end\":80876,\"start\":80866},{\"end\":81012,\"start\":81002},{\"end\":81733,\"start\":81723},{\"end\":84305,\"start\":84295}]", "table": "[{\"end\":74540,\"start\":74107},{\"end\":74963,\"start\":74875},{\"end\":75600,\"start\":75427},{\"end\":75857,\"start\":75630},{\"end\":76671,\"start\":75989},{\"end\":77001,\"start\":76736},{\"end\":77478,\"start\":77220},{\"end\":79141,\"start\":78294},{\"end\":81000,\"start\":80927},{\"end\":81721,\"start\":81230},{\"end\":84293,\"start\":82816},{\"end\":74540,\"start\":74107},{\"end\":74963,\"start\":74875},{\"end\":75600,\"start\":75427},{\"end\":75857,\"start\":75630},{\"end\":76671,\"start\":75989},{\"end\":77001,\"start\":76736},{\"end\":77478,\"start\":77220},{\"end\":79141,\"start\":78294},{\"end\":81000,\"start\":80927},{\"end\":81721,\"start\":81230},{\"end\":84293,\"start\":82816}]", "figure_caption": "[{\"end\":71263,\"start\":71161},{\"end\":72343,\"start\":71275},{\"end\":73268,\"start\":72366},{\"end\":73335,\"start\":73280},{\"end\":73415,\"start\":73338},{\"end\":73882,\"start\":73418},{\"end\":74107,\"start\":73885},{\"end\":74875,\"start\":74553},{\"end\":75427,\"start\":74976},{\"end\":75630,\"start\":75613},{\"end\":75989,\"start\":75870},{\"end\":76736,\"start\":76684},{\"end\":77220,\"start\":77012},{\"end\":77877,\"start\":77481},{\"end\":78294,\"start\":77890},{\"end\":80864,\"start\":79156},{\"end\":80927,\"start\":80879},{\"end\":81230,\"start\":81015},{\"end\":81909,\"start\":81736},{\"end\":82816,\"start\":81912},{\"end\":84659,\"start\":84308},{\"end\":71263,\"start\":71161},{\"end\":72343,\"start\":71275},{\"end\":73268,\"start\":72366},{\"end\":73335,\"start\":73280},{\"end\":73415,\"start\":73338},{\"end\":73882,\"start\":73418},{\"end\":74107,\"start\":73885},{\"end\":74875,\"start\":74553},{\"end\":75427,\"start\":74976},{\"end\":75630,\"start\":75613},{\"end\":75989,\"start\":75870},{\"end\":76736,\"start\":76684},{\"end\":77220,\"start\":77012},{\"end\":77877,\"start\":77481},{\"end\":78294,\"start\":77890},{\"end\":80864,\"start\":79156},{\"end\":80927,\"start\":80879},{\"end\":81230,\"start\":81015},{\"end\":81909,\"start\":81736},{\"end\":82816,\"start\":81912},{\"end\":84659,\"start\":84308}]", "figure_ref": "[{\"end\":26003,\"start\":25995},{\"end\":26447,\"start\":26439},{\"end\":30788,\"start\":30780},{\"end\":31589,\"start\":31581},{\"end\":31999,\"start\":31991},{\"end\":41852,\"start\":41838},{\"attributes\":{\"ref_id\":\"fig_1\"},\"end\":42813,\"start\":42805},{\"end\":44218,\"start\":44210},{\"attributes\":{\"ref_id\":\"fig_1\"},\"end\":55201,\"start\":55193},{\"attributes\":{\"ref_id\":\"fig_3\"},\"end\":58063,\"start\":58055},{\"end\":64220,\"start\":64212},{\"end\":26003,\"start\":25995},{\"end\":26447,\"start\":26439},{\"end\":30788,\"start\":30780},{\"end\":31589,\"start\":31581},{\"end\":31999,\"start\":31991},{\"end\":41852,\"start\":41838},{\"attributes\":{\"ref_id\":\"fig_1\"},\"end\":42813,\"start\":42805},{\"end\":44218,\"start\":44210},{\"attributes\":{\"ref_id\":\"fig_1\"},\"end\":55201,\"start\":55193},{\"attributes\":{\"ref_id\":\"fig_3\"},\"end\":58063,\"start\":58055},{\"end\":64220,\"start\":64212}]", "bib_author_first_name": "[{\"end\":85297,\"start\":85296},{\"end\":85306,\"start\":85305},{\"end\":85314,\"start\":85313},{\"end\":85720,\"start\":85719},{\"end\":85722,\"start\":85721},{\"end\":85734,\"start\":85733},{\"end\":85736,\"start\":85735},{\"end\":85747,\"start\":85746},{\"end\":85749,\"start\":85748},{\"end\":86102,\"start\":86101},{\"end\":86104,\"start\":86103},{\"end\":86115,\"start\":86114},{\"end\":86117,\"start\":86116},{\"end\":86125,\"start\":86124},{\"end\":86132,\"start\":86131},{\"end\":86514,\"start\":86513},{\"end\":86526,\"start\":86525},{\"end\":86536,\"start\":86535},{\"end\":86749,\"start\":86748},{\"end\":86751,\"start\":86750},{\"end\":86762,\"start\":86761},{\"end\":86764,\"start\":86763},{\"end\":87117,\"start\":87116},{\"end\":87131,\"start\":87130},{\"end\":87141,\"start\":87140},{\"end\":87573,\"start\":87572},{\"end\":87585,\"start\":87584},{\"end\":87594,\"start\":87593},{\"end\":87596,\"start\":87595},{\"end\":87610,\"start\":87606},{\"end\":87988,\"start\":87987},{\"end\":87990,\"start\":87989},{\"end\":87998,\"start\":87997},{\"end\":88000,\"start\":87999},{\"end\":88251,\"start\":88250},{\"end\":88260,\"start\":88259},{\"end\":88544,\"start\":88543},{\"end\":88786,\"start\":88785},{\"end\":88788,\"start\":88787},{\"end\":88798,\"start\":88797},{\"end\":89112,\"start\":89111},{\"end\":89123,\"start\":89122},{\"end\":89125,\"start\":89124},{\"end\":89451,\"start\":89450},{\"end\":89461,\"start\":89460},{\"end\":89471,\"start\":89470},{\"end\":89748,\"start\":89747},{\"end\":89758,\"start\":89757},{\"end\":89772,\"start\":89771},{\"end\":90124,\"start\":90123},{\"end\":90126,\"start\":90125},{\"end\":90137,\"start\":90136},{\"end\":90139,\"start\":90138},{\"end\":90457,\"start\":90456},{\"end\":90601,\"start\":90600},{\"end\":90603,\"start\":90602},{\"end\":90611,\"start\":90610},{\"end\":90613,\"start\":90612},{\"end\":90622,\"start\":90621},{\"end\":90624,\"start\":90623},{\"end\":90633,\"start\":90632},{\"end\":90635,\"start\":90634},{\"end\":90919,\"start\":90918},{\"end\":90931,\"start\":90930},{\"end\":91108,\"start\":91107},{\"end\":91120,\"start\":91119},{\"end\":91528,\"start\":91527},{\"end\":91540,\"start\":91539},{\"end\":92030,\"start\":92029},{\"end\":92042,\"start\":92041},{\"end\":92050,\"start\":92049},{\"end\":92464,\"start\":92463},{\"end\":92476,\"start\":92475},{\"end\":92478,\"start\":92477},{\"end\":92488,\"start\":92487},{\"end\":92827,\"start\":92826},{\"end\":92829,\"start\":92828},{\"end\":92971,\"start\":92970},{\"end\":92973,\"start\":92972},{\"end\":93276,\"start\":93275},{\"end\":93278,\"start\":93277},{\"end\":93539,\"start\":93538},{\"end\":93820,\"start\":93819},{\"end\":93822,\"start\":93821},{\"end\":93831,\"start\":93830},{\"end\":93833,\"start\":93832},{\"end\":93842,\"start\":93841},{\"end\":93844,\"start\":93843},{\"end\":94117,\"start\":94113},{\"end\":94124,\"start\":94123},{\"end\":94500,\"start\":94496},{\"end\":94818,\"start\":94817},{\"end\":94820,\"start\":94819},{\"end\":94832,\"start\":94831},{\"end\":94834,\"start\":94833},{\"end\":94841,\"start\":94840},{\"end\":95082,\"start\":95081},{\"end\":95350,\"start\":95349},{\"end\":95709,\"start\":95708},{\"end\":95711,\"start\":95710},{\"end\":95915,\"start\":95914},{\"end\":96251,\"start\":96250},{\"end\":96257,\"start\":96256},{\"end\":96547,\"start\":96546},{\"end\":96558,\"start\":96557},{\"end\":96560,\"start\":96559},{\"end\":96986,\"start\":96985},{\"end\":96988,\"start\":96987},{\"end\":96999,\"start\":96998},{\"end\":97001,\"start\":97000},{\"end\":97011,\"start\":97010},{\"end\":97021,\"start\":97020},{\"end\":97023,\"start\":97022},{\"end\":97317,\"start\":97316},{\"end\":97319,\"start\":97318},{\"end\":97329,\"start\":97328},{\"end\":97331,\"start\":97330},{\"end\":97339,\"start\":97338},{\"end\":97628,\"start\":97627},{\"end\":97630,\"start\":97629},{\"end\":97639,\"start\":97638},{\"end\":97648,\"start\":97647},{\"end\":97885,\"start\":97884},{\"end\":97887,\"start\":97886},{\"end\":97896,\"start\":97895},{\"end\":97898,\"start\":97897},{\"end\":97909,\"start\":97908},{\"end\":97911,\"start\":97910},{\"end\":98178,\"start\":98177},{\"end\":98180,\"start\":98179},{\"end\":98191,\"start\":98190},{\"end\":98193,\"start\":98192},{\"end\":98466,\"start\":98465},{\"end\":98468,\"start\":98467},{\"end\":98768,\"start\":98767},{\"end\":98774,\"start\":98773},{\"end\":98783,\"start\":98782},{\"end\":98785,\"start\":98784},{\"end\":98794,\"start\":98793},{\"end\":85297,\"start\":85296},{\"end\":85306,\"start\":85305},{\"end\":85314,\"start\":85313},{\"end\":85720,\"start\":85719},{\"end\":85722,\"start\":85721},{\"end\":85734,\"start\":85733},{\"end\":85736,\"start\":85735},{\"end\":85747,\"start\":85746},{\"end\":85749,\"start\":85748},{\"end\":86102,\"start\":86101},{\"end\":86104,\"start\":86103},{\"end\":86115,\"start\":86114},{\"end\":86117,\"start\":86116},{\"end\":86125,\"start\":86124},{\"end\":86132,\"start\":86131},{\"end\":86514,\"start\":86513},{\"end\":86526,\"start\":86525},{\"end\":86536,\"start\":86535},{\"end\":86749,\"start\":86748},{\"end\":86751,\"start\":86750},{\"end\":86762,\"start\":86761},{\"end\":86764,\"start\":86763},{\"end\":87117,\"start\":87116},{\"end\":87131,\"start\":87130},{\"end\":87141,\"start\":87140},{\"end\":87573,\"start\":87572},{\"end\":87585,\"start\":87584},{\"end\":87594,\"start\":87593},{\"end\":87596,\"start\":87595},{\"end\":87610,\"start\":87606},{\"end\":87988,\"start\":87987},{\"end\":87990,\"start\":87989},{\"end\":87998,\"start\":87997},{\"end\":88000,\"start\":87999},{\"end\":88251,\"start\":88250},{\"end\":88260,\"start\":88259},{\"end\":88544,\"start\":88543},{\"end\":88786,\"start\":88785},{\"end\":88788,\"start\":88787},{\"end\":88798,\"start\":88797},{\"end\":89112,\"start\":89111},{\"end\":89123,\"start\":89122},{\"end\":89125,\"start\":89124},{\"end\":89451,\"start\":89450},{\"end\":89461,\"start\":89460},{\"end\":89471,\"start\":89470},{\"end\":89748,\"start\":89747},{\"end\":89758,\"start\":89757},{\"end\":89772,\"start\":89771},{\"end\":90124,\"start\":90123},{\"end\":90126,\"start\":90125},{\"end\":90137,\"start\":90136},{\"end\":90139,\"start\":90138},{\"end\":90457,\"start\":90456},{\"end\":90601,\"start\":90600},{\"end\":90603,\"start\":90602},{\"end\":90611,\"start\":90610},{\"end\":90613,\"start\":90612},{\"end\":90622,\"start\":90621},{\"end\":90624,\"start\":90623},{\"end\":90633,\"start\":90632},{\"end\":90635,\"start\":90634},{\"end\":90919,\"start\":90918},{\"end\":90931,\"start\":90930},{\"end\":91108,\"start\":91107},{\"end\":91120,\"start\":91119},{\"end\":91528,\"start\":91527},{\"end\":91540,\"start\":91539},{\"end\":92030,\"start\":92029},{\"end\":92042,\"start\":92041},{\"end\":92050,\"start\":92049},{\"end\":92464,\"start\":92463},{\"end\":92476,\"start\":92475},{\"end\":92478,\"start\":92477},{\"end\":92488,\"start\":92487},{\"end\":92827,\"start\":92826},{\"end\":92829,\"start\":92828},{\"end\":92971,\"start\":92970},{\"end\":92973,\"start\":92972},{\"end\":93276,\"start\":93275},{\"end\":93278,\"start\":93277},{\"end\":93539,\"start\":93538},{\"end\":93820,\"start\":93819},{\"end\":93822,\"start\":93821},{\"end\":93831,\"start\":93830},{\"end\":93833,\"start\":93832},{\"end\":93842,\"start\":93841},{\"end\":93844,\"start\":93843},{\"end\":94117,\"start\":94113},{\"end\":94124,\"start\":94123},{\"end\":94500,\"start\":94496},{\"end\":94818,\"start\":94817},{\"end\":94820,\"start\":94819},{\"end\":94832,\"start\":94831},{\"end\":94834,\"start\":94833},{\"end\":94841,\"start\":94840},{\"end\":95082,\"start\":95081},{\"end\":95350,\"start\":95349},{\"end\":95709,\"start\":95708},{\"end\":95711,\"start\":95710},{\"end\":95915,\"start\":95914},{\"end\":96251,\"start\":96250},{\"end\":96257,\"start\":96256},{\"end\":96547,\"start\":96546},{\"end\":96558,\"start\":96557},{\"end\":96560,\"start\":96559},{\"end\":96986,\"start\":96985},{\"end\":96988,\"start\":96987},{\"end\":96999,\"start\":96998},{\"end\":97001,\"start\":97000},{\"end\":97011,\"start\":97010},{\"end\":97021,\"start\":97020},{\"end\":97023,\"start\":97022},{\"end\":97317,\"start\":97316},{\"end\":97319,\"start\":97318},{\"end\":97329,\"start\":97328},{\"end\":97331,\"start\":97330},{\"end\":97339,\"start\":97338},{\"end\":97628,\"start\":97627},{\"end\":97630,\"start\":97629},{\"end\":97639,\"start\":97638},{\"end\":97648,\"start\":97647},{\"end\":97885,\"start\":97884},{\"end\":97887,\"start\":97886},{\"end\":97896,\"start\":97895},{\"end\":97898,\"start\":97897},{\"end\":97909,\"start\":97908},{\"end\":97911,\"start\":97910},{\"end\":98178,\"start\":98177},{\"end\":98180,\"start\":98179},{\"end\":98191,\"start\":98190},{\"end\":98193,\"start\":98192},{\"end\":98466,\"start\":98465},{\"end\":98468,\"start\":98467},{\"end\":98768,\"start\":98767},{\"end\":98774,\"start\":98773},{\"end\":98783,\"start\":98782},{\"end\":98785,\"start\":98784},{\"end\":98794,\"start\":98793}]", "bib_author_last_name": "[{\"end\":85303,\"start\":85298},{\"end\":85311,\"start\":85307},{\"end\":85320,\"start\":85315},{\"end\":85731,\"start\":85723},{\"end\":85744,\"start\":85737},{\"end\":85756,\"start\":85750},{\"end\":86112,\"start\":86105},{\"end\":86122,\"start\":86118},{\"end\":86129,\"start\":86126},{\"end\":86137,\"start\":86133},{\"end\":86523,\"start\":86515},{\"end\":86533,\"start\":86527},{\"end\":86546,\"start\":86537},{\"end\":86759,\"start\":86752},{\"end\":86771,\"start\":86765},{\"end\":87128,\"start\":87118},{\"end\":87138,\"start\":87132},{\"end\":87149,\"start\":87142},{\"end\":87582,\"start\":87574},{\"end\":87591,\"start\":87586},{\"end\":87604,\"start\":87597},{\"end\":87616,\"start\":87611},{\"end\":87995,\"start\":87991},{\"end\":88004,\"start\":88001},{\"end\":88257,\"start\":88252},{\"end\":88265,\"start\":88261},{\"end\":88554,\"start\":88545},{\"end\":88795,\"start\":88789},{\"end\":88808,\"start\":88799},{\"end\":89120,\"start\":89113},{\"end\":89133,\"start\":89126},{\"end\":89458,\"start\":89452},{\"end\":89468,\"start\":89462},{\"end\":89480,\"start\":89472},{\"end\":89755,\"start\":89749},{\"end\":89769,\"start\":89759},{\"end\":89781,\"start\":89773},{\"end\":90134,\"start\":90127},{\"end\":90148,\"start\":90140},{\"end\":90462,\"start\":90458},{\"end\":90608,\"start\":90604},{\"end\":90619,\"start\":90614},{\"end\":90630,\"start\":90625},{\"end\":90644,\"start\":90636},{\"end\":90928,\"start\":90920},{\"end\":90936,\"start\":90932},{\"end\":91117,\"start\":91109},{\"end\":91125,\"start\":91121},{\"end\":91537,\"start\":91529},{\"end\":91545,\"start\":91541},{\"end\":92039,\"start\":92031},{\"end\":92047,\"start\":92043},{\"end\":92061,\"start\":92051},{\"end\":92473,\"start\":92465},{\"end\":92485,\"start\":92479},{\"end\":92497,\"start\":92489},{\"end\":92833,\"start\":92830},{\"end\":92979,\"start\":92974},{\"end\":93284,\"start\":93279},{\"end\":93549,\"start\":93540},{\"end\":93828,\"start\":93823},{\"end\":93839,\"start\":93834},{\"end\":93852,\"start\":93845},{\"end\":94121,\"start\":94118},{\"end\":94127,\"start\":94125},{\"end\":94503,\"start\":94501},{\"end\":94829,\"start\":94821},{\"end\":94838,\"start\":94835},{\"end\":94849,\"start\":94842},{\"end\":95090,\"start\":95083},{\"end\":95357,\"start\":95351},{\"end\":95721,\"start\":95712},{\"end\":95925,\"start\":95916},{\"end\":96254,\"start\":96252},{\"end\":96268,\"start\":96258},{\"end\":96555,\"start\":96548},{\"end\":96567,\"start\":96561},{\"end\":96580,\"start\":96569},{\"end\":96996,\"start\":96989},{\"end\":97008,\"start\":97002},{\"end\":97018,\"start\":97012},{\"end\":97031,\"start\":97024},{\"end\":97326,\"start\":97320},{\"end\":97336,\"start\":97332},{\"end\":97348,\"start\":97340},{\"end\":97636,\"start\":97631},{\"end\":97645,\"start\":97640},{\"end\":97651,\"start\":97649},{\"end\":97893,\"start\":97888},{\"end\":97906,\"start\":97899},{\"end\":97917,\"start\":97912},{\"end\":98188,\"start\":98181},{\"end\":98200,\"start\":98194},{\"end\":98474,\"start\":98469},{\"end\":98771,\"start\":98769},{\"end\":98780,\"start\":98775},{\"end\":98791,\"start\":98786},{\"end\":98799,\"start\":98795},{\"end\":85303,\"start\":85298},{\"end\":85311,\"start\":85307},{\"end\":85320,\"start\":85315},{\"end\":85731,\"start\":85723},{\"end\":85744,\"start\":85737},{\"end\":85756,\"start\":85750},{\"end\":86112,\"start\":86105},{\"end\":86122,\"start\":86118},{\"end\":86129,\"start\":86126},{\"end\":86137,\"start\":86133},{\"end\":86523,\"start\":86515},{\"end\":86533,\"start\":86527},{\"end\":86546,\"start\":86537},{\"end\":86759,\"start\":86752},{\"end\":86771,\"start\":86765},{\"end\":87128,\"start\":87118},{\"end\":87138,\"start\":87132},{\"end\":87149,\"start\":87142},{\"end\":87582,\"start\":87574},{\"end\":87591,\"start\":87586},{\"end\":87604,\"start\":87597},{\"end\":87616,\"start\":87611},{\"end\":87995,\"start\":87991},{\"end\":88004,\"start\":88001},{\"end\":88257,\"start\":88252},{\"end\":88265,\"start\":88261},{\"end\":88554,\"start\":88545},{\"end\":88795,\"start\":88789},{\"end\":88808,\"start\":88799},{\"end\":89120,\"start\":89113},{\"end\":89133,\"start\":89126},{\"end\":89458,\"start\":89452},{\"end\":89468,\"start\":89462},{\"end\":89480,\"start\":89472},{\"end\":89755,\"start\":89749},{\"end\":89769,\"start\":89759},{\"end\":89781,\"start\":89773},{\"end\":90134,\"start\":90127},{\"end\":90148,\"start\":90140},{\"end\":90462,\"start\":90458},{\"end\":90608,\"start\":90604},{\"end\":90619,\"start\":90614},{\"end\":90630,\"start\":90625},{\"end\":90644,\"start\":90636},{\"end\":90928,\"start\":90920},{\"end\":90936,\"start\":90932},{\"end\":91117,\"start\":91109},{\"end\":91125,\"start\":91121},{\"end\":91537,\"start\":91529},{\"end\":91545,\"start\":91541},{\"end\":92039,\"start\":92031},{\"end\":92047,\"start\":92043},{\"end\":92061,\"start\":92051},{\"end\":92473,\"start\":92465},{\"end\":92485,\"start\":92479},{\"end\":92497,\"start\":92489},{\"end\":92833,\"start\":92830},{\"end\":92979,\"start\":92974},{\"end\":93284,\"start\":93279},{\"end\":93549,\"start\":93540},{\"end\":93828,\"start\":93823},{\"end\":93839,\"start\":93834},{\"end\":93852,\"start\":93845},{\"end\":94121,\"start\":94118},{\"end\":94127,\"start\":94125},{\"end\":94503,\"start\":94501},{\"end\":94829,\"start\":94821},{\"end\":94838,\"start\":94835},{\"end\":94849,\"start\":94842},{\"end\":95090,\"start\":95083},{\"end\":95357,\"start\":95351},{\"end\":95721,\"start\":95712},{\"end\":95925,\"start\":95916},{\"end\":96254,\"start\":96252},{\"end\":96268,\"start\":96258},{\"end\":96555,\"start\":96548},{\"end\":96567,\"start\":96561},{\"end\":96580,\"start\":96569},{\"end\":96996,\"start\":96989},{\"end\":97008,\"start\":97002},{\"end\":97018,\"start\":97012},{\"end\":97031,\"start\":97024},{\"end\":97326,\"start\":97320},{\"end\":97336,\"start\":97332},{\"end\":97348,\"start\":97340},{\"end\":97636,\"start\":97631},{\"end\":97645,\"start\":97640},{\"end\":97651,\"start\":97649},{\"end\":97893,\"start\":97888},{\"end\":97906,\"start\":97899},{\"end\":97917,\"start\":97912},{\"end\":98188,\"start\":98181},{\"end\":98200,\"start\":98194},{\"end\":98474,\"start\":98469},{\"end\":98771,\"start\":98769},{\"end\":98780,\"start\":98775},{\"end\":98791,\"start\":98786},{\"end\":98799,\"start\":98795}]", "bib_entry": "[{\"attributes\":{\"id\":\"b0\",\"matched_paper_id\":5027169},\"end\":85599,\"start\":85204},{\"attributes\":{\"id\":\"b1\",\"matched_paper_id\":147166024},\"end\":86010,\"start\":85601},{\"attributes\":{\"id\":\"b2\",\"matched_paper_id\":199546183},\"end\":86432,\"start\":86012},{\"attributes\":{\"id\":\"b3\",\"matched_paper_id\":11886888},\"end\":86691,\"start\":86434},{\"attributes\":{\"id\":\"b4\",\"matched_paper_id\":220768522},\"end\":87037,\"start\":86693},{\"attributes\":{\"id\":\"b5\",\"matched_paper_id\":1942293},\"end\":87480,\"start\":87039},{\"attributes\":{\"id\":\"b6\",\"matched_paper_id\":19339064},\"end\":87931,\"start\":87482},{\"attributes\":{\"id\":\"b7\",\"matched_paper_id\":76687198},\"end\":88155,\"start\":87933},{\"attributes\":{\"id\":\"b8\",\"matched_paper_id\":36014877},\"end\":88477,\"start\":88157},{\"attributes\":{\"id\":\"b9\",\"matched_paper_id\":121335083},\"end\":88718,\"start\":88479},{\"attributes\":{\"id\":\"b10\"},\"end\":89020,\"start\":88720},{\"attributes\":{\"id\":\"b11\",\"matched_paper_id\":168139204},\"end\":89337,\"start\":89022},{\"attributes\":{\"id\":\"b12\",\"matched_paper_id\":52884338},\"end\":89697,\"start\":89339},{\"attributes\":{\"id\":\"b13\",\"matched_paper_id\":198490120},\"end\":90027,\"start\":89699},{\"attributes\":{\"id\":\"b14\",\"matched_paper_id\":144344294},\"end\":90363,\"start\":90029},{\"attributes\":{\"id\":\"b15\"},\"end\":90598,\"start\":90365},{\"attributes\":{\"id\":\"b16\"},\"end\":90825,\"start\":90600},{\"attributes\":{\"id\":\"b17\"},\"end\":91059,\"start\":90827},{\"attributes\":{\"id\":\"b18\",\"matched_paper_id\":52189087},\"end\":91395,\"start\":91061},{\"attributes\":{\"id\":\"b19\",\"matched_paper_id\":102351121},\"end\":91923,\"start\":91397},{\"attributes\":{\"id\":\"b20\",\"matched_paper_id\":211219231},\"end\":92361,\"start\":91925},{\"attributes\":{\"id\":\"b21\",\"matched_paper_id\":207313094},\"end\":92758,\"start\":92363},{\"attributes\":{\"id\":\"b22\"},\"end\":92923,\"start\":92760},{\"attributes\":{\"id\":\"b23\",\"matched_paper_id\":220764253},\"end\":93216,\"start\":92925},{\"attributes\":{\"id\":\"b24\"},\"end\":93431,\"start\":93218},{\"attributes\":{\"id\":\"b25\",\"matched_paper_id\":422308},\"end\":93735,\"start\":93433},{\"attributes\":{\"id\":\"b26\",\"matched_paper_id\":144195175},\"end\":94067,\"start\":93737},{\"attributes\":{\"id\":\"b27\",\"matched_paper_id\":149856916},\"end\":94371,\"start\":94069},{\"attributes\":{\"id\":\"b28\",\"matched_paper_id\":20927628},\"end\":94715,\"start\":94373},{\"attributes\":{\"id\":\"b29\",\"matched_paper_id\":35194306},\"end\":95077,\"start\":94717},{\"attributes\":{\"id\":\"b30\"},\"end\":95209,\"start\":95079},{\"attributes\":{\"id\":\"b31\",\"matched_paper_id\":15787063},\"end\":95645,\"start\":95211},{\"attributes\":{\"id\":\"b32\",\"matched_paper_id\":63104345},\"end\":95828,\"start\":95647},{\"attributes\":{\"id\":\"b33\",\"matched_paper_id\":13558904},\"end\":96150,\"start\":95830},{\"attributes\":{\"id\":\"b34\",\"matched_paper_id\":13084640},\"end\":96544,\"start\":96152},{\"attributes\":{\"id\":\"b35\"},\"end\":96909,\"start\":96546},{\"attributes\":{\"id\":\"b36\",\"matched_paper_id\":40508593},\"end\":97240,\"start\":96911},{\"attributes\":{\"id\":\"b37\",\"matched_paper_id\":11723671},\"end\":97566,\"start\":97242},{\"attributes\":{\"id\":\"b38\",\"matched_paper_id\":33233573},\"end\":97797,\"start\":97568},{\"attributes\":{\"id\":\"b39\",\"matched_paper_id\":1284770},\"end\":98099,\"start\":97799},{\"attributes\":{\"id\":\"b40\",\"matched_paper_id\":207228127},\"end\":98393,\"start\":98101},{\"attributes\":{\"id\":\"b41\",\"matched_paper_id\":56312024},\"end\":98679,\"start\":98395},{\"attributes\":{\"id\":\"b42\",\"matched_paper_id\":13915528},\"end\":98986,\"start\":98681},{\"attributes\":{\"id\":\"b0\",\"matched_paper_id\":5027169},\"end\":85599,\"start\":85204},{\"attributes\":{\"id\":\"b1\",\"matched_paper_id\":147166024},\"end\":86010,\"start\":85601},{\"attributes\":{\"id\":\"b2\",\"matched_paper_id\":199546183},\"end\":86432,\"start\":86012},{\"attributes\":{\"id\":\"b3\",\"matched_paper_id\":11886888},\"end\":86691,\"start\":86434},{\"attributes\":{\"id\":\"b4\",\"matched_paper_id\":220768522},\"end\":87037,\"start\":86693},{\"attributes\":{\"id\":\"b5\",\"matched_paper_id\":1942293},\"end\":87480,\"start\":87039},{\"attributes\":{\"id\":\"b6\",\"matched_paper_id\":19339064},\"end\":87931,\"start\":87482},{\"attributes\":{\"id\":\"b7\",\"matched_paper_id\":76687198},\"end\":88155,\"start\":87933},{\"attributes\":{\"id\":\"b8\",\"matched_paper_id\":36014877},\"end\":88477,\"start\":88157},{\"attributes\":{\"id\":\"b9\",\"matched_paper_id\":121335083},\"end\":88718,\"start\":88479},{\"attributes\":{\"id\":\"b10\"},\"end\":89020,\"start\":88720},{\"attributes\":{\"id\":\"b11\",\"matched_paper_id\":168139204},\"end\":89337,\"start\":89022},{\"attributes\":{\"id\":\"b12\",\"matched_paper_id\":52884338},\"end\":89697,\"start\":89339},{\"attributes\":{\"id\":\"b13\",\"matched_paper_id\":198490120},\"end\":90027,\"start\":89699},{\"attributes\":{\"id\":\"b14\",\"matched_paper_id\":144344294},\"end\":90363,\"start\":90029},{\"attributes\":{\"id\":\"b15\"},\"end\":90598,\"start\":90365},{\"attributes\":{\"id\":\"b16\"},\"end\":90825,\"start\":90600},{\"attributes\":{\"id\":\"b17\"},\"end\":91059,\"start\":90827},{\"attributes\":{\"id\":\"b18\",\"matched_paper_id\":52189087},\"end\":91395,\"start\":91061},{\"attributes\":{\"id\":\"b19\",\"matched_paper_id\":102351121},\"end\":91923,\"start\":91397},{\"attributes\":{\"id\":\"b20\",\"matched_paper_id\":211219231},\"end\":92361,\"start\":91925},{\"attributes\":{\"id\":\"b21\",\"matched_paper_id\":207313094},\"end\":92758,\"start\":92363},{\"attributes\":{\"id\":\"b22\"},\"end\":92923,\"start\":92760},{\"attributes\":{\"id\":\"b23\",\"matched_paper_id\":220764253},\"end\":93216,\"start\":92925},{\"attributes\":{\"id\":\"b24\"},\"end\":93431,\"start\":93218},{\"attributes\":{\"id\":\"b25\",\"matched_paper_id\":422308},\"end\":93735,\"start\":93433},{\"attributes\":{\"id\":\"b26\",\"matched_paper_id\":144195175},\"end\":94067,\"start\":93737},{\"attributes\":{\"id\":\"b27\",\"matched_paper_id\":149856916},\"end\":94371,\"start\":94069},{\"attributes\":{\"id\":\"b28\",\"matched_paper_id\":20927628},\"end\":94715,\"start\":94373},{\"attributes\":{\"id\":\"b29\",\"matched_paper_id\":35194306},\"end\":95077,\"start\":94717},{\"attributes\":{\"id\":\"b30\"},\"end\":95209,\"start\":95079},{\"attributes\":{\"id\":\"b31\",\"matched_paper_id\":15787063},\"end\":95645,\"start\":95211},{\"attributes\":{\"id\":\"b32\",\"matched_paper_id\":63104345},\"end\":95828,\"start\":95647},{\"attributes\":{\"id\":\"b33\",\"matched_paper_id\":13558904},\"end\":96150,\"start\":95830},{\"attributes\":{\"id\":\"b34\",\"matched_paper_id\":13084640},\"end\":96544,\"start\":96152},{\"attributes\":{\"id\":\"b35\"},\"end\":96909,\"start\":96546},{\"attributes\":{\"id\":\"b36\",\"matched_paper_id\":40508593},\"end\":97240,\"start\":96911},{\"attributes\":{\"id\":\"b37\",\"matched_paper_id\":11723671},\"end\":97566,\"start\":97242},{\"attributes\":{\"id\":\"b38\",\"matched_paper_id\":33233573},\"end\":97797,\"start\":97568},{\"attributes\":{\"id\":\"b39\",\"matched_paper_id\":1284770},\"end\":98099,\"start\":97799},{\"attributes\":{\"id\":\"b40\",\"matched_paper_id\":207228127},\"end\":98393,\"start\":98101},{\"attributes\":{\"id\":\"b41\",\"matched_paper_id\":56312024},\"end\":98679,\"start\":98395},{\"attributes\":{\"id\":\"b42\",\"matched_paper_id\":13915528},\"end\":98986,\"start\":98681}]", "bib_title": "[{\"end\":85294,\"start\":85204},{\"end\":85717,\"start\":85601},{\"end\":86099,\"start\":86012},{\"end\":86511,\"start\":86434},{\"end\":86746,\"start\":86693},{\"end\":87114,\"start\":87039},{\"end\":87570,\"start\":87482},{\"end\":87985,\"start\":87933},{\"end\":88248,\"start\":88157},{\"end\":88541,\"start\":88479},{\"end\":89109,\"start\":89022},{\"end\":89448,\"start\":89339},{\"end\":89745,\"start\":89699},{\"end\":90121,\"start\":90029},{\"end\":91105,\"start\":91061},{\"end\":91525,\"start\":91397},{\"end\":92027,\"start\":91925},{\"end\":92461,\"start\":92363},{\"end\":92968,\"start\":92925},{\"end\":93536,\"start\":93433},{\"end\":93817,\"start\":93737},{\"end\":94111,\"start\":94069},{\"end\":94494,\"start\":94373},{\"end\":94815,\"start\":94717},{\"end\":95347,\"start\":95211},{\"end\":95706,\"start\":95647},{\"end\":95912,\"start\":95830},{\"end\":96248,\"start\":96152},{\"end\":96983,\"start\":96911},{\"end\":97314,\"start\":97242},{\"end\":97625,\"start\":97568},{\"end\":97882,\"start\":97799},{\"end\":98175,\"start\":98101},{\"end\":98463,\"start\":98395},{\"end\":98765,\"start\":98681},{\"end\":85294,\"start\":85204},{\"end\":85717,\"start\":85601},{\"end\":86099,\"start\":86012},{\"end\":86511,\"start\":86434},{\"end\":86746,\"start\":86693},{\"end\":87114,\"start\":87039},{\"end\":87570,\"start\":87482},{\"end\":87985,\"start\":87933},{\"end\":88248,\"start\":88157},{\"end\":88541,\"start\":88479},{\"end\":89109,\"start\":89022},{\"end\":89448,\"start\":89339},{\"end\":89745,\"start\":89699},{\"end\":90121,\"start\":90029},{\"end\":91105,\"start\":91061},{\"end\":91525,\"start\":91397},{\"end\":92027,\"start\":91925},{\"end\":92461,\"start\":92363},{\"end\":92968,\"start\":92925},{\"end\":93536,\"start\":93433},{\"end\":93817,\"start\":93737},{\"end\":94111,\"start\":94069},{\"end\":94494,\"start\":94373},{\"end\":94815,\"start\":94717},{\"end\":95347,\"start\":95211},{\"end\":95706,\"start\":95647},{\"end\":95912,\"start\":95830},{\"end\":96248,\"start\":96152},{\"end\":96983,\"start\":96911},{\"end\":97314,\"start\":97242},{\"end\":97625,\"start\":97568},{\"end\":97882,\"start\":97799},{\"end\":98175,\"start\":98101},{\"end\":98463,\"start\":98395},{\"end\":98765,\"start\":98681}]", "bib_author": "[{\"end\":85305,\"start\":85296},{\"end\":85313,\"start\":85305},{\"end\":85322,\"start\":85313},{\"end\":85733,\"start\":85719},{\"end\":85746,\"start\":85733},{\"end\":85758,\"start\":85746},{\"end\":86114,\"start\":86101},{\"end\":86124,\"start\":86114},{\"end\":86131,\"start\":86124},{\"end\":86139,\"start\":86131},{\"end\":86525,\"start\":86513},{\"end\":86535,\"start\":86525},{\"end\":86548,\"start\":86535},{\"end\":86761,\"start\":86748},{\"end\":86773,\"start\":86761},{\"end\":87130,\"start\":87116},{\"end\":87140,\"start\":87130},{\"end\":87151,\"start\":87140},{\"end\":87584,\"start\":87572},{\"end\":87593,\"start\":87584},{\"end\":87606,\"start\":87593},{\"end\":87618,\"start\":87606},{\"end\":87997,\"start\":87987},{\"end\":88006,\"start\":87997},{\"end\":88259,\"start\":88250},{\"end\":88267,\"start\":88259},{\"end\":88556,\"start\":88543},{\"end\":88797,\"start\":88785},{\"end\":88810,\"start\":88797},{\"end\":89122,\"start\":89111},{\"end\":89135,\"start\":89122},{\"end\":89460,\"start\":89450},{\"end\":89470,\"start\":89460},{\"end\":89482,\"start\":89470},{\"end\":89757,\"start\":89747},{\"end\":89771,\"start\":89757},{\"end\":89783,\"start\":89771},{\"end\":90136,\"start\":90123},{\"end\":90150,\"start\":90136},{\"end\":90464,\"start\":90456},{\"end\":90610,\"start\":90600},{\"end\":90621,\"start\":90610},{\"end\":90632,\"start\":90621},{\"end\":90646,\"start\":90632},{\"end\":90930,\"start\":90918},{\"end\":90938,\"start\":90930},{\"end\":91119,\"start\":91107},{\"end\":91127,\"start\":91119},{\"end\":91539,\"start\":91527},{\"end\":91547,\"start\":91539},{\"end\":92041,\"start\":92029},{\"end\":92049,\"start\":92041},{\"end\":92063,\"start\":92049},{\"end\":92475,\"start\":92463},{\"end\":92487,\"start\":92475},{\"end\":92499,\"start\":92487},{\"end\":92835,\"start\":92826},{\"end\":92981,\"start\":92970},{\"end\":93286,\"start\":93275},{\"end\":93551,\"start\":93538},{\"end\":93830,\"start\":93819},{\"end\":93841,\"start\":93830},{\"end\":93854,\"start\":93841},{\"end\":94123,\"start\":94113},{\"end\":94129,\"start\":94123},{\"end\":94505,\"start\":94496},{\"end\":94831,\"start\":94817},{\"end\":94840,\"start\":94831},{\"end\":94851,\"start\":94840},{\"end\":95092,\"start\":95081},{\"end\":95359,\"start\":95349},{\"end\":95723,\"start\":95708},{\"end\":95927,\"start\":95914},{\"end\":96256,\"start\":96250},{\"end\":96270,\"start\":96256},{\"end\":96557,\"start\":96546},{\"end\":96569,\"start\":96557},{\"end\":96582,\"start\":96569},{\"end\":96998,\"start\":96985},{\"end\":97010,\"start\":96998},{\"end\":97020,\"start\":97010},{\"end\":97033,\"start\":97020},{\"end\":97328,\"start\":97316},{\"end\":97338,\"start\":97328},{\"end\":97350,\"start\":97338},{\"end\":97638,\"start\":97627},{\"end\":97647,\"start\":97638},{\"end\":97653,\"start\":97647},{\"end\":97895,\"start\":97884},{\"end\":97908,\"start\":97895},{\"end\":97919,\"start\":97908},{\"end\":98190,\"start\":98177},{\"end\":98202,\"start\":98190},{\"end\":98476,\"start\":98465},{\"end\":98773,\"start\":98767},{\"end\":98782,\"start\":98773},{\"end\":98793,\"start\":98782},{\"end\":98801,\"start\":98793},{\"end\":85305,\"start\":85296},{\"end\":85313,\"start\":85305},{\"end\":85322,\"start\":85313},{\"end\":85733,\"start\":85719},{\"end\":85746,\"start\":85733},{\"end\":85758,\"start\":85746},{\"end\":86114,\"start\":86101},{\"end\":86124,\"start\":86114},{\"end\":86131,\"start\":86124},{\"end\":86139,\"start\":86131},{\"end\":86525,\"start\":86513},{\"end\":86535,\"start\":86525},{\"end\":86548,\"start\":86535},{\"end\":86761,\"start\":86748},{\"end\":86773,\"start\":86761},{\"end\":87130,\"start\":87116},{\"end\":87140,\"start\":87130},{\"end\":87151,\"start\":87140},{\"end\":87584,\"start\":87572},{\"end\":87593,\"start\":87584},{\"end\":87606,\"start\":87593},{\"end\":87618,\"start\":87606},{\"end\":87997,\"start\":87987},{\"end\":88006,\"start\":87997},{\"end\":88259,\"start\":88250},{\"end\":88267,\"start\":88259},{\"end\":88556,\"start\":88543},{\"end\":88797,\"start\":88785},{\"end\":88810,\"start\":88797},{\"end\":89122,\"start\":89111},{\"end\":89135,\"start\":89122},{\"end\":89460,\"start\":89450},{\"end\":89470,\"start\":89460},{\"end\":89482,\"start\":89470},{\"end\":89757,\"start\":89747},{\"end\":89771,\"start\":89757},{\"end\":89783,\"start\":89771},{\"end\":90136,\"start\":90123},{\"end\":90150,\"start\":90136},{\"end\":90464,\"start\":90456},{\"end\":90610,\"start\":90600},{\"end\":90621,\"start\":90610},{\"end\":90632,\"start\":90621},{\"end\":90646,\"start\":90632},{\"end\":90930,\"start\":90918},{\"end\":90938,\"start\":90930},{\"end\":91119,\"start\":91107},{\"end\":91127,\"start\":91119},{\"end\":91539,\"start\":91527},{\"end\":91547,\"start\":91539},{\"end\":92041,\"start\":92029},{\"end\":92049,\"start\":92041},{\"end\":92063,\"start\":92049},{\"end\":92475,\"start\":92463},{\"end\":92487,\"start\":92475},{\"end\":92499,\"start\":92487},{\"end\":92835,\"start\":92826},{\"end\":92981,\"start\":92970},{\"end\":93286,\"start\":93275},{\"end\":93551,\"start\":93538},{\"end\":93830,\"start\":93819},{\"end\":93841,\"start\":93830},{\"end\":93854,\"start\":93841},{\"end\":94123,\"start\":94113},{\"end\":94129,\"start\":94123},{\"end\":94505,\"start\":94496},{\"end\":94831,\"start\":94817},{\"end\":94840,\"start\":94831},{\"end\":94851,\"start\":94840},{\"end\":95092,\"start\":95081},{\"end\":95359,\"start\":95349},{\"end\":95723,\"start\":95708},{\"end\":95927,\"start\":95914},{\"end\":96256,\"start\":96250},{\"end\":96270,\"start\":96256},{\"end\":96557,\"start\":96546},{\"end\":96569,\"start\":96557},{\"end\":96582,\"start\":96569},{\"end\":96998,\"start\":96985},{\"end\":97010,\"start\":96998},{\"end\":97020,\"start\":97010},{\"end\":97033,\"start\":97020},{\"end\":97328,\"start\":97316},{\"end\":97338,\"start\":97328},{\"end\":97350,\"start\":97338},{\"end\":97638,\"start\":97627},{\"end\":97647,\"start\":97638},{\"end\":97653,\"start\":97647},{\"end\":97895,\"start\":97884},{\"end\":97908,\"start\":97895},{\"end\":97919,\"start\":97908},{\"end\":98190,\"start\":98177},{\"end\":98202,\"start\":98190},{\"end\":98476,\"start\":98465},{\"end\":98773,\"start\":98767},{\"end\":98782,\"start\":98773},{\"end\":98793,\"start\":98782},{\"end\":98801,\"start\":98793}]", "bib_venue": "[{\"end\":85359,\"start\":85322},{\"end\":85787,\"start\":85758},{\"end\":86184,\"start\":86139},{\"end\":86552,\"start\":86548},{\"end\":86813,\"start\":86773},{\"end\":87218,\"start\":87151},{\"end\":87688,\"start\":87618},{\"end\":88032,\"start\":88006},{\"end\":88301,\"start\":88267},{\"end\":88584,\"start\":88556},{\"end\":88783,\"start\":88720},{\"end\":89164,\"start\":89135},{\"end\":89502,\"start\":89482},{\"end\":89828,\"start\":89783},{\"end\":90179,\"start\":90150},{\"end\":90454,\"start\":90365},{\"end\":90690,\"start\":90646},{\"end\":90916,\"start\":90827},{\"end\":91203,\"start\":91127},{\"end\":91621,\"start\":91547},{\"end\":92108,\"start\":92063},{\"end\":92542,\"start\":92499},{\"end\":92824,\"start\":92760},{\"end\":93021,\"start\":92981},{\"end\":93273,\"start\":93218},{\"end\":93571,\"start\":93551},{\"end\":93885,\"start\":93854},{\"end\":94169,\"start\":94129},{\"end\":94530,\"start\":94505},{\"end\":94879,\"start\":94851},{\"end\":95128,\"start\":95092},{\"end\":95408,\"start\":95359},{\"end\":95732,\"start\":95723},{\"end\":95974,\"start\":95927},{\"end\":96315,\"start\":96270},{\"end\":96693,\"start\":96582},{\"end\":97057,\"start\":97033},{\"end\":97394,\"start\":97350},{\"end\":97666,\"start\":97653},{\"end\":97932,\"start\":97919},{\"end\":98230,\"start\":98202},{\"end\":98524,\"start\":98476},{\"end\":98812,\"start\":98801},{\"end\":85359,\"start\":85322},{\"end\":85787,\"start\":85758},{\"end\":86184,\"start\":86139},{\"end\":86552,\"start\":86548},{\"end\":86813,\"start\":86773},{\"end\":87218,\"start\":87151},{\"end\":87688,\"start\":87618},{\"end\":88032,\"start\":88006},{\"end\":88301,\"start\":88267},{\"end\":88584,\"start\":88556},{\"end\":88783,\"start\":88720},{\"end\":89164,\"start\":89135},{\"end\":89502,\"start\":89482},{\"end\":89828,\"start\":89783},{\"end\":90179,\"start\":90150},{\"end\":90454,\"start\":90365},{\"end\":90690,\"start\":90646},{\"end\":90916,\"start\":90827},{\"end\":91203,\"start\":91127},{\"end\":91621,\"start\":91547},{\"end\":92108,\"start\":92063},{\"end\":92542,\"start\":92499},{\"end\":92824,\"start\":92760},{\"end\":93021,\"start\":92981},{\"end\":93273,\"start\":93218},{\"end\":93571,\"start\":93551},{\"end\":93885,\"start\":93854},{\"end\":94169,\"start\":94129},{\"end\":94530,\"start\":94505},{\"end\":94879,\"start\":94851},{\"end\":95128,\"start\":95092},{\"end\":95408,\"start\":95359},{\"end\":95732,\"start\":95723},{\"end\":95974,\"start\":95927},{\"end\":96315,\"start\":96270},{\"end\":96693,\"start\":96582},{\"end\":97057,\"start\":97033},{\"end\":97394,\"start\":97350},{\"end\":97666,\"start\":97653},{\"end\":97932,\"start\":97919},{\"end\":98230,\"start\":98202},{\"end\":98524,\"start\":98476},{\"end\":98812,\"start\":98801},{\"end\":86219,\"start\":86186},{\"end\":87272,\"start\":87220},{\"end\":89863,\"start\":89830},{\"end\":91682,\"start\":91623},{\"end\":92143,\"start\":92110},{\"end\":96350,\"start\":96317},{\"end\":86219,\"start\":86186},{\"end\":87272,\"start\":87220},{\"end\":89863,\"start\":89830},{\"end\":91682,\"start\":91623},{\"end\":92143,\"start\":92110},{\"end\":96350,\"start\":96317}]"}}}, "year": 2023, "month": 12, "day": 17}