{"id": 231718989, "updated": "2023-10-06 06:51:00.599", "metadata": {"title": "Change point detection and image segmentation for time series of astrophysical images", "authors": "[{\"first\":\"Cong\",\"last\":\"Xu\",\"middle\":[]},{\"first\":\"Hans\",\"last\":\"Gunther\",\"middle\":[\"Moritz\"]},{\"first\":\"Vinay\",\"last\":\"Kashyap\",\"middle\":[\"L.\"]},{\"first\":\"Thomas\",\"last\":\"Lee\",\"middle\":[\"C.\",\"M.\"]},{\"first\":\"Andreas\",\"last\":\"Zezas\",\"middle\":[]}]", "venue": null, "journal": "The Astronomical Journal", "publication_date": {"year": 2021, "month": null, "day": null}, "abstract": "Many astrophysical phenomena are time-varying, in the sense that their intensity, energy spectrum, and/or the spatial distribution of the emission suddenly change. This paper develops a method for modeling a time series of images. Under the assumption that the arrival times of the photons follow a Poisson process, the data are binned into 4D grids of voxels (time, energy band, and x-y coordinates), and viewed as a time series of non-homogeneous Poisson images. The method assumes that at each time point, the corresponding multi-band image stack is an unknown 3D piecewise constant function including Poisson noise. It also assumes that all image stacks between any two adjacent change points (in time domain) share the same unknown piecewise constant function. The proposed method is designed to estimate the number and the locations of all the change points (in time domain), as well as all the unknown piecewise constant functions between any pairs of the change points. The method applies the minimum description length (MDL) principle to perform this task. A practical algorithm is also developed to solve the corresponding complicated optimization problem. Simulation experiments and applications to real datasets show that the proposed method enjoys very promising empirical properties. Applications to two real datasets, the XMM observation of a flaring star and an emerging solar coronal loop, illustrate the usage of the proposed method and the scientific insight gained from it.", "fields_of_study": "[\"Physics\",\"Mathematics\"]", "external_ids": {"arxiv": "2101.11202", "mag": "3137119683", "acl": null, "pubmed": null, "pubmedcentral": null, "dblp": null, "doi": "10.3847/1538-3881/abe0b6"}}, "content": {"source": {"pdf_hash": "39e8282d6459db6d931cbb03edc680257b19529c", "pdf_src": "Arxiv", "pdf_uri": "[\"https://arxiv.org/pdf/2101.11202v1.pdf\"]", "oa_url_match": true, "oa_info": {"license": null, "open_access_url": "http://arxiv.org/pdf/2101.11202", "status": "GREEN"}}, "grobid": {"id": "6ca3c749fa0f183049a0916bd0b4286f134adfcd", "type": "plain-text", "url": "s3://ai2-s2-pdf-extraction-prod/parse-results/s2orc_worker/39e8282d6459db6d931cbb03edc680257b19529c.txt", "contents": "\nChange point detection and image segmentation for time series of astrophysical images\nJanuary 28, 2021 27 Jan 2021\n\nCong Xu \nDepartment of Statistics\nUniversity of California\nOne Shields Avenue95616Davis, DavisCAUSA\n\nHans Moritz Günther \nMIT\nKavli Institute for Astrophysics and Space Research\n77 Massachusetts Avenue02139CambridgeMAUSA\n\nVinay L Kashyap \nCenter for Astrophysics |\nHarvard & Smithsonian\n60 Garden Street02138CambridgeMAUSA\n\nThomas C M Lee \nDepartment of Statistics\nUniversity of California\nOne Shields Avenue95616Davis, DavisCAUSA\n\nAndreas Zezas \nDepartment of Physics\nUniversity of Crete\n710 03Heraklion, CreteGreece\n\nChange point detection and image segmentation for time series of astrophysical images\nJanuary 28, 2021 27 Jan 2021Draft version Typeset using L A T E X twocolumn style in AASTeX63 2Poisson distribution (1898)Maximum likelihood estimation (1901)Detection (1911)Spa- tial point processes (1915)Time series analysis (1916)Astronomy data analysis (1858)\nMany astrophysical phenomena are time-varying, in the sense that their intensity, energy spectrum, and/or the spatial distribution of the emission suddenly change. This paper develops a method for modeling a time series of images. Under the assumption that the arrival times of the photons follow a Poisson process, the data are binned into 4D grids of voxels (time, energy band, and x-y coordinates), and viewed as a time series of non-homogeneous Poisson images. The method assumes that at each time point, the corresponding multi-band image stack is an unknown 3D piecewise constant function including Poisson noise. It also assumes that all image stacks between any two adjacent change points (in time domain) share the same unknown piecewise constant function. The proposed method is designed to estimate the number and the locations of all the change points (in time domain), as well as all the unknown piecewise constant functions between any pairs of the change points. The method applies the minimum description length (MDL) principle to perform this task. A practical algorithm is also developed to solve the corresponding complicated optimization problem. Simulation experiments and applications to real datasets show that the proposed method enjoys very promising empirical properties. Applications to two real datasets, the XMM observation of a flaring star and an emerging solar coronal loop, illustrate the usage of the proposed method and the scientific insight gained from it.\n\nINTRODUCTION\n\nMany phenomena in the high-energy universe are time-variable, from coronal flares on the smallest stars to accretion events in the most massive black holes. Often, this variability can just be seen \"by-eye\" but at other times, we need to use robust methods founded in statistics to distinguish random noise from significant variability. Realizing where the change has occurred is critical for subsequent scientific analyses, e.g., spectral fitting and light curve modeling. Such analyses must focus on those intervals in data space which are properly tied to the changes in the physical processes that generate the observed photons. Therefore, it is of importance to identify sources as well as to locate their spatial boundaries. Our goal is to detect change points in the time direction; that is, the times at which sudden changes happened during the underlying astrophysical process.\n\nChange point detection in time series is well studied, and several algorithms employing different philosophies have been developed. For example, Aue & Horváth (2013) employed hypothesis testing to study structural break detection, using both non-parametric approaches like cumulative sum (CUSUM) and parametric methods like likelihood ratio statistic to deal with different kinds of structural breaks. Another likelihood-based approach commonly used to analyze astronomical time series is Bayesian Blocks (Scargle et al. 2013) which finds change points by fitting piecewise constant models between change points. A good example of the model driven approach is the Auto-PARM procedure developed by Davis et al. (2006). By modeling the piecewise-stationary time series, the procedure is able to simultaneously estimate the number of change points, their locations and the parametric model for each piece. Here the minimum description length (MDL) principle by Rissanen (1989Rissanen ( , 2007 is applied in the model selection procedure. Davis & Yau (2013) proved the strong consistency of the MDLbased change point detection procedure. Another example is Automark by Wong et al. (2016), who developed an MDL-based methodology which detects the changes in observed emission from astronomical sources in 2-D time-wavelength space. Dey et al. (2010) loosely classified image segmentation techniques into two categories: (i) image driven approaches and (ii) model driven approaches. Image driven segmentation techniques are mainly based on the discrete pixel values of the image. For example, the graph-based algorithm by Felzenszwalb & Huttenlocher (2004) treats pixels as vertices, and the weights of the edges are based on the similarity between the features of pixels. The evidence for a boundary between two re-gions can be measured based on the graph. Such methods work in many complicated cases as there is no underlying model for images. Model driven approaches rely upon the information of the structure of the image. These methods are based on the assumption that the pixels in the same region have similar characteristics. The Blobworld framework by Carson et al. (1999) assumes that the features of pixels are from a underlying multivariate Gaussian mixture model. Neighboring pixels whose features are from the same Gaussian distribution are grouped into the same region.\n\nHere we follow the model driven approach. In order to develop a change point detection method for image time series data, we begin by specifying an underlying statistical model for the images between any two consecutive change points. In doing so we also study the statistical properties of the change point detection method. We assume the underlying Poisson rate for each of the images follows a piecewise constant function. Therefore, the region growing algorithm developed by Adams & Bischof (1994) for greyvalue images can be naturally applied.\n\nGiven the previous successes of applying the MDL principle (Rissanen 1989(Rissanen , 2007 to other time series change point detection and image segmentation problems (e.g., Davis et al. 2006;Lee 2000;Wong et al. 2016), here we also use MDL to tackle our problem of joint change point detection and image segmentation for time series of astronomical images. Briefly, MDL defines the best model as the one that produces the best lossless compression of the data. There are different versions of MDL, and the one we use is the so-called two-part code; a gentle introduction can be found in Lee (2001). When comparing with other versions of MDL such as normalized maximum likelihood, one advantage of the two-part version is that it tends to be more computationally tractable for complex problems such as the one this paper considers. It has also been shown to enjoy excellent theoretical and empirical properties in other model selection tasks (e.g., Aue & Lee 2011;Lee 2000;Davis et al. 2006;Davis & Yau 2013) Based on MDL, we develop a practical algorithm that can be applied to simultaneously estimate the number and locations of the change points, as well as to perform image segmentation on each of the images.\n\n\nMETHODOLOGY\n\nOur method is applied to 4-D data cubes where 2-D spatial slices in several energy passbands are stacked in time. Such data cubes are commonly available, though in high-energy astrophysics, data are usually obtained in the form of a list of photons. The list contains the twodimensional spatial coordinates where the photons were recorded on the detector, the times they were recorded, and their energies or wavelengths. To facilitate our analysis, we bin these data into a 4-D rectangular grid of boxes. After the binning of the original data, we obtain a 4D table of photon counts indexed by the twodimensional coordinates (x, y), time index t and energy band w. The dataset is thus a series of multi-band images with counts of photons as the values of the pixels. Since the emission times of photons can be considered a non-homogeneous Poisson process, and the grids do not overlap with each other, the counts in each pixel are independent, and the image slices are also independent.\n\nWe first partition these images into a set of nonoverlapping region segments using a seeded region growing (SRG) method, and then merging adjacent segments to minimize MDL (see Section 2.1). The counts in each segment are modeled as Poisson counts (see Section 2.2; the implementation details of the algorithm are described in Section 2.3). We minimize the MDL criterion across the images by iteratively removing change points along the time axis and applying the SRG segmentation onto the images in each of the time intervals. Key pixels that are influential in how the segmentations and change points are determined are then identified through searching for changes in the fitted intensities (see Section 2.4). Such regions are the focus of followup analyses.\n\nWe list the variables, parameters, and notation used here in Table 1.\n\n\nRegion Growing and Merging\n\nAs a first step in the analysis, a suitable segmentation method must be applied to the images to delineate regions of interest (ROIs). For this, we use the seeded region growing (SRG) method of Adams & Bischof (1994) to obtain a segmentation of the image. We choose SRG over other image segmentation algorithms for its speed and reliability (Fan & Lee 2015). Also, it can be straightforwardly incorporated to the Poisson setting.\n\nAt the beginning of SRG, we select a set of seeds, manually or automatically, from the image. Each seed can be a single pixel or a set of connected pixels. A seed comprises an initial region. Then each region starts to grow outward until the whole image is covered. (See Section 2.3.2 offers some suggestions on the selection of initial seeds.) At each step, the unlabelled pixels which are neighbors to at least one of the current regions comprise the set of candidates for growing the region. One of these candidates is selected to merge into the region, based on the Poisson likelihood that measures the similarity between a candidate pixel and the corresponding region.\n\nWe repeat this process until all the pixels are labeled, thus producing an initial segmentation by SRG.\n\nAt the end of the SRG process, we are left with an oversegmentation, i.e., with the image split into a larger than optimal number of segments. We then merge these segments based on the largest reduction or smallest increase in the MDL criterion (see below). From this sequence of segmentations, we select the one that gives the smallest value of the MDL criterion as the final ROIs.\n\n\nModeling a Poisson Image Series\n\n\nInput Data Type\n\nWe require that the data are binned into photon counts in an N I × N T × N W tensor {y i,t,w }, i = 1, ..., N I , t = 1, ..., N T , w = 1, ..., N W , where y i,t,w is the photon counts within the i th spatial rectangular region, the t th time interval [T t−1 , T t ) and the w th energy range [W w−1 , W w ). After binning, the data can be viewed as a time series of images in different energy bands. The values of each pixel are the photon counts in the different bands in the corresponding spatial region.\n\nNotice that compared with Automark (Wong et al. 2016), we incorporate 2-D spatial information into the model, thus extending the analysis from two (wavelength/energy and time) to four dimensions (wavelength/energy, time, and projected sky location). We also relax the restriction that the bin sizes along any of the axes are held fixed. Thus, sharp changes are more easily detected.\n\nAs the data in high-energy astrophysics are photon counts, we use a Poisson process to model the data,\ny i,t,w i.i.d. ∼ Poisson(λ i,t,w ∆T t ),(1)\nwhere ∆T t = (T t − T t−1 ). Our goal is to infer model intensities λ i,t,w from the observed counts data {y i,t,w }. We are especially interested in detecting significant changes of λ i,t,w over time. If there are changes, we also want to estimate the number and locations of the change points.\n\nTo simplify the presentation, we first develop a timehomogeneous model, i.e., one where there are no change points and λ i,t,w is unchanging with t (Section 2.2.2). We will then consider more complex cases, where change points are added to the model so that λ i,t,w is allowed to change over time (Section 2.2.3)\n\n\nPiecewise Constant Model\n\nFirst consider a temporally homogeneous Poisson model without any change points. Then each image can be treated as an independent Poisson realization of the same, unknown, true image. photon counts within the i th spatial pixel, the t th time interval and the w th energy range λi,t,w\n\nPoisson rate for the i th spatial pixel, the t th time interval and the w th energy range K number of change points τ k location of the k th change point m (k) number of region segments for the k th interval between two consecutive change points a (k) h the area (number of pixels) of the h th region segment of the k th interval between two consecutive change points b (k) h the \"perimeter\" (number of pixel edges between this and neighboring regions) of the h th region of the k th interval µ\n(k) h,w\nPoisson rate for the h th region segment and the w th energy range of the k th interval µ (k) h,w fitted Poisson rate for the h th region segment and the w th energy range of the k th interval We model the image as a 3-dimensional piecewise constant function. That is, the 2-dimensional space of xy coordinates is partitioned into m non-overlapping regions such that all the pixels in a given region have the same Poisson intensity. Different energy bands share the same spatial partitioning. Rigorously, the Poisson parameter λ i,t,w can be written as a summation of regionspecific Poisson rates µ h,w times the corresponding indicator functions of regions (I {i∈R h } is 1 for pixel i in region R h and 0 otherwise) in the following format:\nλ i,t,w = m h=1 µ h,w I {i∈R h } .(2)\nHere i ∈ R h means \"the i th pixel in the h th region\" and I is the indicator function. R h is the index set of the pixels within the h th region, with R h ⊆ {1, ..., N I }.\n\nAlso, µ h,w is the Poisson rate for the w th band of the h th region. The partition of the image is specified by R = {R h |h = 1, ..., m}.\n\n\nAdding Change Points to the Model\n\nNow we allow the underlying Poisson parameter λ i,t,w to change over time t. We model λ i,t,w as a piecewise constant function of t.\n\nSuppose these N T images can be partitioned into K+1 homogeneous intervals by K change points τ = {τ 0 = 0, τ 1 , τ 2 , ..., τ K , τ K+1 = N T } For the t th image, suppose that it belongs to the k th time interval; i.e., t ∈ (τ k−1 , τ k ]. For each given t, let λ be a two-dimensional piecewise constant function with m (k) constant regions. Then λ can be represented by\nλ i,t,w = K+1 k=1 I {t∈(τ k−1 ,τ k ]} m (k) h=1 µ (k) h,w I {i∈R (k) h } ,(3)\nwhere m (k) is the number of regions within the k th interval. Let M = {m (k) |k = 1, 2, ..., K + 1}. The partition of the images within interval k is specified by h means \"the i th pixel is in the h th region of the k th interval\".\nR (k) = {R\n\nModel Selection Using MDL\n\nGiven the observed images {y i,t,w }, we aim to obtain an estimate of λ i,t,w . In other words, we want an estimate of the image partitions and the Poisson rates of the regions for each band. It is straightforward to estimate the Poisson intensities given the region partitioning, but the partitioning is a much more complicated model selection problem.\n\nWe will apply MDL to select the best fitting model. Loosely speaking, the idea behind MDL for model selection is to first obtain a MDL criterion for each possible model, and then define the best fitting model as the minimizer of this criterion. MDL defines the best model as the one that produces the best compression of the data. The criterion can be treated as the code length, or amount of hardware memory required to store the data.\n\nFirst we present the MDL criterion for the homogeneous Poisson model, then follow it by the MDL criterion for the general case (i.e., with change points).\n\nFollowing similar arguments as in Lee (2000) (see their Appendix B), the MDL criterion for segmenting N T homogeneous images is\nMDL(m, R,μ) = m log(N I ) + log(3) 2 m h=1 b h + N W 2 m h=1 log(N T a h ) − NW w=1 NT t=1 m h=1 i∈R h y i,t,w log(μ h,w ),(4)\nwhere a h and b h are, respectively, the \"area\" (number of pixels) and \"perimeter\" (number of pixel edges) of region R h , and\nµ h,w = 1 NT t=1 ∆T t a h NT t=1 i∈R h y i,t,w(5)\nis the maximum likelihood estimate of the Poisson rate in the corresponding region. Note that the indices of µ = {μ hw } run over the region segments h = 1..m and the passbands w = 1..N W . For the Poisson model with change points, once the number of change points K and the locations τ = {τ 1 , ..., τ K } are specified, for each k ∈ (1, 2, ..., K + 1), m (k) and R (k) can be estimated independently. Using the previous argument, the MDL criterion for images within the same homogeneous interval is\nMDL(τ k−1 , τ k , m (k) , R (k) ,μ (k) ) = m (k) log(N I ) + log(3) 2 m (k) h=1 b (k) h + N W 2 m (k) h=1 log((τ k − τ k−1 )a (k) h ) − NW w=1 τ k t=τ k−1 +1 m (k) h=1 i∈R (k) h y i,t,w log(μ (k) h,w ). (6)\nThen the overall MDL criterion for the model with change points is\nMDL overall (K, τ, M, R,μ) = K log(N T ) + K+1 k=1 MDL(τ k−1 , τ k , m (k) , R (k) ,μ (k) ).(7)\nTo sum up, using the MDL principle, the best-fit model is defined as the minimizer of the criterion (7). The next subsection presents a practical algorithm for carrying out this minimization.\n\n\nStatistical Consistency\n\nAn important step to demonstrating the efficacy of our method is to establish its statistical consistency. That is, if it is shown that as the size of the data increases, the differences between the estimated model parameters and the true values decrease to zero, then the method can be said to be free of asymptotic bias, can be applied in the general case, and is elevated above a heuristic. We prove in Appendix A that the MDL-based model selection to choose the region partitioning, as well as the corresponding Poisson intensity parameters, is indeed strongly statistically consistent under mild assumptions of maintaining the temporal variability structure of λ i,t,w .\n\n\nPractical Minimization\n\n\nAn Iterative Algorithm\n\nGiven its complicated structure, global minimization of MDL overall (K, τ, M, R,μ) (Equation 7) is virtually infeasible when the number of images N T and the number of pixels N I are not small, because the time complexity of the exhaustive search is of order 2 NTNI .\n\n\nFigure 1. Schematic illustration of the minimization algorithm\n\nWe iterate the following two steps to (approximately) minimize the MDL criterion (7).\n\n1. Given a set of change points, apply the image segmentation method to all the images belonging to the first homogeneous time interval and obtain the MDL best-fitting image for this interval. Repeat this for all remaining intervals. Calculate the MDL criterion (7).\n\n2. Modify the set of change points by, for example, adding or removing one change point.\n\nIn terms of what modification should be made, we use the greedy strategy to select the one that achieves the largest reduction of the overall MDL value in (7).\n\nFor\n\nStep 1 we begin with a large set of change points (i.e., an over-fitted model). In\n\nStep 2 we remove one change point (i.e., merge two neighboring intervals) to maximize the reduction of the MDL value. The procedure stops and declares the optimization is done if no further MDL reduction can be achieved by removing change points. This is similar to backward elimination for statistical model selection problems. See Figure 1 for a flowchart of the whole procedure.\n\n\nPractical Considerations\n\nHere we list some practical issues that are crucial to the success of the above minimization algorithm.\n\nInitial seed allocation for SRG: The selection of the initial seeds in SRG plays an important role in the performance of the algorithm. To obtain a good initial oversegmentation, there must be at least one seed within each true region. Currently we use all the local maxima as well as a subset of the square lattice as the initial seeds. Based on simulation results (see Section 3.2), when the number of initial seeds is inadequate, the SRG will underfit the images, which will in turn lead to an overfitting of the change points and will lead to an increased false positive rate. On the other hand, it could be time-consuming when the number of initial seeds is very large, especially for high resolution images. We developed an algorithm that allocates initial seeds automatically based on locating local maxima. However, an optimal selection of initial seeds almost certainly requires expert intervention, as it depends on the type of data that we work with. To reduce the chance of obtaining a poor oversegmentation with SRG, in practice one could try using different sets of initial seeds and select the oversegmentation that gives the smallest MDL value.\n\nCounts per bin: The photon counts in the image pixels cannot be too small, otherwise the algorithm could fail to produce meaningful output; see Section 3.2. In some sense, small photon counts can be seen as low signal level, which means that the proposed method requires a minimum level of signal to operate with. Therefore, care must be exercised when deciding the size for the bin. As a rule of thumb, it should be enough to have around 100 counts for each pixel belonging to an astronomical object, while pixels from the background can have very low or even zero count.\n\nInitial change point selection: Although the stepwise greedy algorithm is capable of saving a significant amount of computation time, it could still be time con-suming if the initial set of change points is too large, as it might need many iterations to reach a local minimum. It is recommended to select the initial change points based on prior knowledge, if available, in order to accelerate the algorithm.\n\nComputation Time: In each iteration, the main timeconsuming part is to apply the SRG. When the total number of pixels and the number of seeds are large, during the process, the number of candidates is large. Therefore, the comparison among all the candidates and the following updating manner lead to most of the computation burden. As an example, we found that it takes about 40 minutes for applying SRG and merging once on 64×64 images with about 200 seeds on a Linux machine with an octa-core 2.90 GHz Intel Xeon processor.\n\n\nHighlighting the Key Pixels\n\nAfter the change points are located, it is necessary to locate the pixels or regions that contribute to the estimation of the change points. The manner by which such key pixels are identified depends on the scientific context. Below we present two methods that are applicable to the real-world examples we discuss in Section 4\n\nWe focus here on images in a single passband, i.e., grey-valued images. For multi-band images, one can first transform a multi-band image into a single-band image by, for example, summing the pixel values in different bands, or by using only first principal component image of the multi-band image. Alternatively, one can also apply the method to each band individually, and merge the results from each band.\n\n\nBased on Pixel Differences\n\nThe first method is to highlight key pixels based on the distribution of pixel differences before and after change points. The rationale is that a pixel with different fitted values before and after a change point is a strong indicator that it is a key pixel.\n\nSuppose the fitted values for pixel i in time intervals k and (k + 1) areλ\n(k) i andλ (k+1) i\n, respectively. Given the Poisson nature of the data, we first apply a square-root transformation to normalize the fitted values. Define the difference d i for pixel i as\nd i = λ (k+1) i − λ (k) i .(8)\nA pixel is labelled as a key pixel if its d i is far away from the mean of all the differences. To be specific, pixel i is labelled as a key pixel if\nd i −μ σ > Φ −1 1 − 1 2 p ,(9)whereμ = 1 NI NI 1 d i andσ = 1 Φ −1 (3/4) MAD.\nHere MAD = median(|d i −d|) is the median absolute deviation withd = median(d i ), and is used to obtain a robust estimate (i.e., a measure that minimizes the effect of outliers) of the standard deviation of the d i 's (see e.g., Rousseeuw & Croux 1993). Φ −1 (·) is the quantile of the standard normal distribution, and p is the prespecified significance level 1 . Notice that by checking the sign of d i −μ, we can deduce if pixel i has increased or decreased after this change point.\n\n\nBased on Region Differences\n\nAnother method to locate key pixels is to compare pairs of regions. For any region in the time interval k, there must exist at least one region in time interval (k + 1) such that these two regions have overlapping pixels. We then test if the difference between the means of the pixels from these two regions is significant or not.\n\nAs before, we apply the square-root transformation to the pixels within each of the regions. Then we calculate the sample meansμ 1 andμ 2 and sample varianceŝ σ 2 1 andσ 2 2 of these two groups of square-rooted values. Then we can for example test whether the difference betweenμ 1 andμ 2 is large enough with\nμ 2 −μ 1 σ 2 1 +σ 2 2 > Φ −1 1 − 1 2 p .(10)\nSee Section 4 for the applications of these two methods on some real data sets.\n\nLastly we note that the selection of p, the significance level, deserves a more careful consideration. As in reality one may need to do comparisons for many change points and energy bands, this becomes a multiple-testing problem where the number of tests is large. Therefore, one should adjust the value of p in order to control false positives.\n\n\nSIMULATIONS\n\nTwo groups of simulations were conducted to evaluate the empirical performance of the proposed method. A specially designed λ i,t,w was used for each of the experiments. For each experiment, we tested 13 signal levels, defined as the average number of photon counts per pixel. For each signal level, 100 datasets were generated according to (1) spectral bands N W = 3 so w = 1, 2, 3 and the number of time points N T = 60.\n\n\nGroup 1: Single Pixel\n\nThe first group of experiments were designed to evaluate the ability of the proposed method for detecting change points, under the condition that there are no spatial variations. To be more specific, the size of the images is 1 × 1; i.e., only one pixel. In other words, N I = 1 and the i in λ i,t,w is a dummy index. Three λ i,t,w 's of increasing complexity were used:\n\n1. λ i,t,w is constant; i.e., no change point (as depicted in Figure 2 (a)).\n\n2. λ i,t,w shows intensity changes but all three bands are identical at any given t (see Figure 2 (b)).\n\n3. λ i,t,w shows spectral changes (see Figure 2 (c)).\n\nThe first λ i,t,w was used to study the level of false positives, while the remaining two were used to study false negatives. \n\n\nNo Change Point\n\nAs there is no change point in λ i,t,w , this experiment is ideal for studying the relationship between the false positive rate and the signal level; recall the latter is defined as the average number of photon counts per pixel.\n\nThe results of this experiment (together with the next two experiments) are summarized as the blue curves in Figure 3. The figure captures how well the simulation recovers the location of the change points (top left), the number of change points (top right), the excess number of change points (false positives; bottom left), and the deficit in change points (false negatives; bottom right). The top left plot reports the fraction of simulated datasets for which the set of the fitted change pointsτ is identical to the set of true change points τ . The top right plot presents the fraction of simulated datasets for which the fitted number of change pointŝ K equals to the true number of change points K. The bottom left plot shows the average false positive rate, which is defined as the average number of falsely detected change points per possible location. The bottom right plot presents the fraction of simulated datasets for whichτ contains τ , i.e., τ ⊆τ . One can see that the false discovery rate seems to be quite stable across different signal levels. Notice that the last curve is always 1 because τ is empty for this experiment.  \n\n\nVarying Intensity\n\nIn this experiment we introduced variation in λ i,t,w by multiplying (a) and (b) in Figure 2 together.\n\nThe results are reported as the green curve in Figure 3. One can see that when the signal level is small (log 10 (average signal level) < 1.0), increasing the signal level leads to more false positives: this range of signals levels are too small to provide enough information for the detection of the true change points.\n\nWhen log 10 (average signal level) is between 1.0 and 2.0, the proposed method starts to be able to detect the true change points as the signal level increases. Also, the false positive rate begins to drop. One possible explanation is that for any two consecutive homogeneous time intervals, the location of the change point might not be clear when the signal level is relatively small.\n\nAs the signal level continues to increase, the proposed method becomes more successful in detecting the true change point locations. For example, when the average number of counts in each bin is greater than 100 (i.e., log 10 (average signal level) > 2.0), the signal is strong enough so that all the true change points can be detected successfully. We note that there are always some false positives due to the Poisson randomness, and it seems that the false positive rate stabilizes as the signal level increases.\n\n\nVarying Spectrum\n\nHere we allow different bands w to change differently at the change points. The rate λ i,t,w was obtained by multiplying (a) and (c) in Figure 2 together. The results, which are about the same as the previous experiment (varying intensity), are reported as the red curve in Figure 3. When the signal level is small (log 10 (average signal level) < 1.0), the proposed method fails to detect the true change points. When log 10 (average signal level) is between 1.0 and 2.0, as the signal level increases, the false positive rate begins to decrease while the true positive rate increases. When log 10 (average signal level) > 2.0, all the true change points can be detected successfully, while the false positive rate stays at the same level as signal level increases.\n\n\nGroup 2: Spatial Structure\n\nInstead of having a constant spatial signal (i.e., single pixel), in this second group of experiments a spatial varying structure is introduced to study the empirical performance of the proposed method. As before, three Poisson rate functions λ i,t,w are considered. The size of the image is set to N I = 8 × 8. To illustrate the importance of initial seed placement, we tested two allocation strategies: (i) we deliberately placed an inadequate number of initial seeds and (ii) we used every pixel as an initial seed.\n\n\nNo Change Point\n\nThere was no change point in this experiment and the spatial variation of λ i,t,w is given in the bottom right plot of Figure 2. The results are reported as the blue curves in Figure 4. One can see that if the number of initial seeds is inadequate, the false positive rate increases as the signal level increases above log 10 (average signal level) > 2.5. However, this does not happen when there are a large number of initial seeds; see the blue dotted curves in Figure 4. In fact, for this and the following two experiments, our method did not detect any false positive change points. This suggests that when the images are under-segmented, the method tends to place more false change points to compensate for data variability not explainable by image segmentation.  \n\n\nVarying Intensity\n\nIn this experiment λ i,t,w was obtained by multiplying (b) and (d) of Figure 2 together, so there are three change points over time. The results are similar to the no change point case, and revsummarized as the green curves in Figure 4.\n\n\nVarying Spectrum\n\nIn this last experiment the energy bands were allowed to be different, and λ i,t,w was obtained by multiplying (c) and (d) of Figure 2 together. The results, reported as the red curves in Figure 4, are similar to the previous two experiments.\n\n\nEmpirical Conclusions\n\nThe following empirical conclusions can be drawn from the above experimental results.\n\n• The method works well in all cases when the signal level is sufficiently large. As a rule of thumb, for binning of the original data, it would be ideal to have 100 counts or more for each bin covering an astronomical source.\n\n• It is important to place enough initial seeds when applying SRG; otherwise the false positive rate will increase with the signal level. See the second paragraph of Section 2.3.2 for some practical guidelines for initial seed selection.\n\n\nAPPLICATIONS TO REAL DATA\n\nTo illustrate the usage in the astrophysics field, we apply the proposed method on two real datasets, which are more complicated than those in the previous section. Specifically, we select these datasets with some obvious time-evolving variations to demonstrate the performance of our method.  Proxima Centauri is the nearest star to the Sun and as such is well suited for studies of coronal activity. Like our Sun, Proxima Centauri operates an internal dynamo, which generates a stellar magnetic field. In the standard model for stellar dynamos, the magnetic field lines wind up through differential rotation. When some of the magnetic field lines reconnect, the energy is released in the stellar flare. Such flares typically show a sudden rise in X-ray emission and a more gradual decay over several hours. In flares, flux and temperature are correlated such that a higher X-ray flux corresponds to a higher temperature and thus a higher energy of the average detected photons (see Güdel 2004, for a review of X-ray emission in stellar coronae and further references).\n\n\nXMM-Newton Observations of Proxima Centauri\n\nDespite its proximity, Proxima Centauri and its corona are unresolved in X-ray observations; it is just the point-spread function (PSF) of the telescope that distributes the incoming flux over many pixels on the detector.\n\n\nData\n\nWe use a dataset from XMM-Newton (Obs.ID 0049350101), where Proxima Centauri was observed for 67 ks on 2001-08-12. Because of the high flux, the MOS cameras on XMM-Newton are highly piled-up and we restrict our analysis to the data from the PN camera. We obtained the data from the XMM-Newton science archive hosted by the European Space Agency (ESA) 2 . The data we received was processed by ODS version 12.0.0. Our analysis is based on the filtered PN event data from the automated reduction pipeline (PPS). Güdel et al. (2002) presented a detailed analysis and interpretation of this dataset.\n\nIn our analysis, we only used a subset of photons with spatial coordinates within [25500, 27500] × [26500, 28500], and it was binned as images of size 64 × 64. We used the temporal bins of width 1100.4 seconds to generate 60 images. We binned the data into three energy bands, (200,1000], (1000, 3000] and (3000, 10000] in eV. The fitted images can be found in Figure 6. The source of most photons, a point source, is modeled by different piecewise constant models at all these time intervals. The center of the point source and the wings of the PSF region nearby were fitted by models with shapes like concentric circles.\n\n\nResults\n\nTo test our method for finding the regions of significant change, we also apply it here because we know what the answer should be. For this dataset, as the observations for different bands change simultaneously, we combine all the three bands to highlight the key pixels. That is, we highlight the regions for each band and take the intersection of these regions. Examples of the results based on the method in Section 2.4.2 can be found in Figure 6. The method indeed picks out the point source. With significance level p = 10 −2 , the abrupt increase in brightness of the source at time point 41 and 42, as well as the sudden decrease at time point 43 can be detected successfully. By modifying the significance level, different sensitivity can be achieved.\n\n\nIsolated Evolving Solar Coronal Loop\n\nImages of the solar corona constitute a legitimate Big Data problem. Several observatories have been collect-   Figure 7 in spatial segments. The images are arranged in the same manner, and demonstrate that the loop structure is locatable and identifiable. The number of region segments found are also marked.\n\ning images in extreme ultra-violet (EUV) filters and in X-ray passbands for several decades, and analyzing them to pick out interesting changes using automated routines have been largely unsuccessful. Catalogs like the HEK (Heliophysics Events Knowledgebase Hurlburt et al. 2012;Martens et al. 2012) can detect and mark features of particular varieties, though these compilations remain beset by incompleteness (see, e.g., Aggar-wal et al. 2018;Hughes et al. 2019;Barnes et al. 2017). In this context, our method provides a way to model solar features without limiting it to a particular feature set to identify and locate regions in images where something interesting has transpired. As a proof of concept, we apply the method to a simple case of an isolated coronal loop filling with plasma, as observed with the Solar Dynamics Observatory's Atmospheric Imaging As-sembly (SDO/AIA) filters (Pesnell et al. 2012;Lemen et al. 2012). Considerable enhancements must still be made in order to lower the computational cost before the method can be applied to full size images at faster than observed cadence; however, we demonstrate here that a well-defined region of interest can be selected without manual intervention for a dataset that consists of images in several filters.\n\n\nData\n\nIn particular, here we consider AIA observations carried out on 2014-Dec-11 between 19:12 UT and 19:23 UT, and focus on a 64×64 pixel region located (+1 , −271 ) from disk center, in which a small, isolated, well-defined loop appeared at approximately 19:19 UT. This region was selected solely as a test case to demonstrate our method; the appearance of the loop is clear and unambiguous, with no other event occurring nearby to confuse the issue; see Figure 7. We apply our method to these data, downloaded using the SDO AIA Cutout Service, 3 and demonstrate that the loop (and it alone) is detected and identified; see Figures 8,9 and 10. AIA data are available in 6 filter bands, centered at 211, 94, 335, 193, 131, 171Å. Here, we have limited our analysis to 3 bands: 94, 335, and 131Å in which the isolated loop is easily discernible to the eye (a full analysis including all the filters does not change the results). Each filter consists of a sequence of 54 images, and while they are not obtained simultaneously, the difference in time between the bands is ignorable on the timescale over which the loop evolves.\n\n\nResults\n\nThe fitted images for the 3-band case can be found in Figure 8. Notice that there is a loop-shaped object that is of interest. Based on the fitted result, this object starts to appear at time point c.36 and becomes brighter after that for the first band. In the second band, this object appears at time point c.26 and stays bright throughout the duration considered. However in the third band, the object becomes bright at time point c.36 and vanishes soon after time point c.38. The proposed method is able to catch these changes in different bands and to detect the corresponding change points.\n\nAfter detecting these change points, we find the key pixels that contribute to the change points using the methods in Section 2.4.1. This method is appropriate to highlight the regions that change rapidly after the change point because different bands may not change in the same direction for this dataset. Here we apply this 3 https://www.lmsal.com/get aia data/ Figure 9. Demonstrating the isolation of key pixels of interest. Each set of three shows the fitted intensity in one passband in the 3 rd interval (left), followed by a bitmap of pixels (middle) showing where intensity increases (blue) and decreases (red), followed by the fitted intensity image in the same filter in the 4 th time interval (right). The upper row shows the transition in the 94Å filter, and the lower row shows the transition in the 131Å filter. Notice that the loop continues to brighten at 94Å, even as it starts to fade at 131Å. method on a single band, 94, as an example. We use p = 10 −15 . See Figure 9 for an illustration. We find that the method could highlight the loop-shape object which starts to appear at time point c.36, and also detect the region that becomes much brighter after time point c.38. We also compute the light curves of the intensities in a region comprised of the set of pixels formed from the union of all key pixels found at all change points in all the filters; see Figure 10. Notice that the event of interest is fully incorporated within the key pixels, with no spillover into the background, and the change points are post facto found to be reasonably located from a temporal perspective in that they are located where a researcher seeking to manually place them would do so. The first segment is characterized by steady emission in all three bands, the second segment shows the isolated loop beginning to form, the third segment catches the time when it reaches a peak, and the last segment tracks the slow decline in intensity.\n\n\nSUMMARY\n\nWe have developed an approach to model photon emissions by astronomical sources. Also, we propose a practical algorithm to detect the change points as well as to segment the astronomical images, based on the MDL principle for model selection. We test this method on a series of simulation experiments and apply it to two real astrophysical datasets. We are able to recover the time-evolving variations.\n\nBased on the results of simulation experiments, it is recommended that the average number of photon counts within each bin should be from 100 to 1000 for pixels belonging to an astrophysical object, so that the proposed method is able to find change points and limit false positives.\n\nFor future work, it will be helpful to quantify the evidence of the existence of a change point by deriving a test statistic based on Monte Carlo simulations or other methods. Another possible extension is to relax the piecewise constant assumption and allow piecewise linear/quadratic modeling so that the method is able to capture more complicated and realistic patterns. ACKNOWLEDGMENTS Support for CX and TCML was partially provided by the National Science Foundation under grants DMS-1811405, DMS-1811661 and DMS-1916125. Support for HMG was provided by the National Aeronautics and Space Administration through the Smithsonian Astrophysical Observatory contract SV3-73016 to MIT for Support of the Chandra X-Ray Center, which is operated by the Smithsonian Astrophysical Observatory for and on behalf of the National Aeronautics Space Administration under contract NAS8-03060. VLK acknowledges support from NASA Contract NAS8-03060 to the Chandra X-ray Center. VLK thanks Durgesh Tripathi for the solar dataset used in this analysis.\n\n\nFacilities: XMM-Newton (EPIC), SDO (AIA)\n\nSoftware: CIAO (Fruscione et al. 2006). astropy (Astropy Collaboration et al. 2013. IDL https: //www.l3harrisgeospatial.com/Software-Technology/ IDL. SolarSoft (Freeland & Handy 2012). Automark (Wong et al. 2016). 4D Automark, a Python package for the proposed method can be downloaded from https://github.com/kevinxucong/4D Automark. (doi:10.5281/zenodo.4451396) Figure 10. Light curves of the key pixels where changes are found, for the three filters used in the analysis: 94Å (top), 335Å (middle), and 131Å (bottom). The average of the observed intensities, weighted by the number of times each pixel is flagged as a key pixel, are shown as dots, along with the similarly weighted sample standard deviation as vertical bars. The shaded regions represent the envelope of the sample standard deviation seen outside the flagged pixels. The vertical lines denote the change points found by our algorithm.\n\n\nAPPENDIX\n\n\nA. STATISTICAL CONSISTENCY\n\nHere we prove that the MDL scheme is statistically consistent (see Section 2.2.5), thereby ensuring that the estimates of region segmentations and the Poisson intensities are reliable measures of the data. In the following, we assume that the size of the time bins ∆T t = 1, ∀1 ≤ t ≤ N T , as N T increases to infinity. That is to say, first, we study that as these underlying nonhomogeneous Poisson processes are extending at the same rate, the size of the bins keeps fixed, which leads to increasing number of independent observations for any given part of this Poisson process. And by keeping the size of the bins fixed, we get rid of the case that the Poisson parameters keep varying as N T increases. Second, by setting ∆T t = 1, the Poisson parameter is numerically equal to the Poisson rate, which ease the arguments. The proof can be extended if we relax this assumption.\n\nGiven the above assumption, the photon counts have the following Poisson model,\ny i,t,w i.i.d. ∼ Poisson(λ i,t,w ).(A1)\nGiven change points τ = (τ 1 , τ 2 , ..., τ K ), we set τ 0 = 0 and τ K+1 = N T , and let ν k = τ k /N T , k = 0, 1, ...N T to be the normalized change points. The consistency results are based on ν k 's being fixed as N T increases.\n\nThe observed images within the same interval follow the same corresponding piecewise constant model given change h,w |h = 1, ..., m (k) , w = 1, ..., N W }. That is to say,\npoints τ . Let x (k) i,t−τ k−1 ,w = y i,t,w , τ k−1 + 1 ≤ t ≤ τ k , X (k) t−τ k−1 = Y t = {y i,t,w |i = 1, ..., N I , w = 1, ..., N W }, τ k−1 + 1 ≤ t ≤ τ k , and X (k) = {X (k) t |1 ≤ t ≤ T k } where T k = τ k − τ k−1 . Let λ i,t,λ i,t,w = K+1 k=1 I {t∈(τ k−1 ,τ k ]} µ (k) R (k) (i),w .(A2)\nIn all, for pixel i ∈ R\n(k) h , x (k) i,t,w i.i.d. ∼ Poisson(µ (k) h,w ).(A3)\nFor each 1 ≤ t ≤ T k , the log-likelihood function for regions assignment R (k) and Poisson parameters µ (k) is\nl k ((R (k) , µ (k) ); X (k) t ) = NW w=1 m (k) h=1 i,s.t.R (k) (i)=h [x (k) i,t,w log(µ (k) h,w ) − µ (k) h,w − log(x (k) i,t,w !)].(A4)\nAs some of the terms in the log-likelihood function have nothing to do with the parameters to estimate, we remove these terms and write down the log-likelihood to be\nl k ((R (k) , µ (k) ); X (k) t ) = NW w=1 m (k) h=1 i,s.t.R (k) (i)=h [x (k) i,t,w log(µ (k) h,w ) − µ (k) h,w ].(A5)\nDefine ψ k = (R (k) , µ (k) ) to be the parameter set for the k th interval, and M to be the class of models ψ k can take value from. Then the log-likelihood for the k th interval can be written as\nL (k) T (ψ k ; X (k) ) = T k t=1 l k ((R (k) , µ (k) ); X (k) t ).(A6)\nLet ν = (ν 1 , ..., ν K ) be the normalized change point location vector, and ψ = (ψ 1 , ..., ψ K+1 ) be the parameter vector. Then vector (K, ν, ψ) can specify a model for this sequence of images. The MDL is derived to be\nMDL(K, ν, ψ) = K log(N T ) + K+1 k=1 [m (k) log(N I ) + log(3) 2 m (k) h=1 b (k) h + N W 2 m (k) h=1 log(([T ν k ] − [T ν k−1 ] + 1)a (k) h )] − K+1 k=1 L (k) T (ψ k ; X (k) ).(A7)\nHere the \"area\" (number of pixels) and \"perimeter\" (number of pixel edges) of region R\n(k) h are denoted by a (k) h and b (k) h .\nIn order to make sure that the change points are identifiable, we assume that there exists a ν > 0 such that min 1≤k≤K+1 |ν k − ν k−1 | > ν . Therefore, the number of change points is bounded by K ≤ [1/ ν ] + 1. And there exists a constraint A K ν of ν where\nA K ν = {ν ∈ (0, 1) K |0 < ν 1 < ... < ν K < 1, ν k − ν k−1 > ν , ∀1 ≤ k ≤ K + 1}.(A8)\nThen the estimation of the model based on MDL is given by\n(K T ,ν T ,ψ T ) = arg min K≤[1/ ν ]+1,ν∈A K ν ,ψ∈M 1 N T MDL(K, ν, ψ).(A9)\nHere MDL(K, ν, ψ) is defined in (A7),ν T = (ν 1 , ...,νK) andψ T = (ψ 1 , ...,ψK +1 ), whereψ k = (R (k) ,μ (k) ). Andμ (k) is defined asμ (k) = arg max\nµ (k) ∈Θ k (R (k) ) L (k) T ((R (k) , µ (k) );X (k) ) (A10) withX (k) = {Y t |[Tν k−1 ] < t ≤ [\nTν k ]} denotes the estimated k th interval of the sequence of images. We further define the log-likelihood formed by a portion of the observations in the k th interval by\nL (k) T (ψ k , ν d , ν u ; X (k) ) = [T k νu] t=[T k ν d ]+1 l k ((R (k) , µ (k) ); X (k) t ),(A11)\nwhere 0 ≤ ν d < ν u ≤ 1 and ν u − ν d > ν . We denote sup ν d ,νu\n:= sup 0≤ν d <νu≤1,νu−ν d > ν(A12)\nto simplify the notation. In this setting, an extension need to be made such that ν d and ν u can be slightly outside [0, 1]. It means that the k th estimated interval could cover a part of the observations that belong to the (k − 1) th and (k + 1) th true intervals. Based on the formula (3.4) in Davis & Yau (2013), for a real-value function f T (ν d , ν u ) on R 2 ,\nsup ν d ,νu f T (ν d , ν u ) a.s. − − → 0 (A13) is used to denote sup −h T <ν d <νu<1+r T ,νu−ν d > ν f T (ν d , ν u ) a.s. − − → 0 (A14)\nfor any pre-specified positive-valued sequences h T and r T , which cover to 0 as N T → ∞.\n\nThe following assumptions on true Poisson parameters µ \no(k) h,w , 1 ≤ h ≤ m (k) , 1 ≤ w ≤ N W , 1 ≤ k ≤ (K o + 1)|µ o(k) p,w − µ o(k) q,w | > 0.(A16)\nAssumption 3. For any two neighboring intervals (k − 1) and k δ 2 := min\nk max i,w |µ o(k) R (k) (i),w − µ o(k−1) R (k−1) (i),w | > 0. (A17)\nProposition A.1 (v). For k = 1, ..., K + 1 and any fixed R (k) , there exists a > 0 such that,\nsup µ (k) ∈Θ k (R (k) ) E|l k ((R (k) , µ (k) ); X (k) t )| v+ < ∞, sup µ (k) ∈Θ k (R (k) ) E|l k ((R (k) , µ (k) ); X (k) t )| v+ < ∞, sup µ (k) ∈Θ k (R (k) ) E|l k ((R (k) , µ (k) ); X (k) t )| < ∞.(A18)\nThis proposition holds for v = 1, 2, 4 due to the compactness of parameter space (Assumption 1) and bounded E [(x (k) i,t,w ) v+ ]. Proposition A.2. For k = 1, ..., K + 1 and any fixed R (k) ,\nsup µ (k) ∈Θ k (R (k) ) | 1 N T (ν k − ν k−1 ) L (k) T ((R (k) , µ (k) ); X (k) ) − L k ((R (k) , µ (k) ))| a.s. − − → 0, sup µ (k) ∈Θ k (R (k) ) | 1 N T (ν k − ν k−1 ) L (k) T ((R (k) , µ (k) ); X (k) ) − L k ((R (k) , µ (k) ))| a.s. − − → 0, sup µ (k) ∈Θ k (R (k) ) | 1 N T (ν k − ν k−1 ) L (k) T ((R (k) , µ (k) ); X (k) ) − L k ((R (k) , µ (k) ))| a.s. − − → 0, (A19) where L k ((R (k) , µ (k) )) := E(l k ((R (k) , µ (k) ); X (k) t )), L k ((R (k) , µ (k) )) := E(l k ((R (k) , µ (k) ); X (k) t )), L k ((R (k) , µ (k) )) := E(l k ((R (k) , µ (k) ); X (k) t )). (A20)\nThe estimated locations of change points are used to define the likelihood in practice. Therefore, the two ends of the k th interval might contain observations from the (k − 1) th and (k + 1) th true intervals, though the estimated change points are close to the true change points. It is necessary to control the effect at the two ends of the fitted interval. Proposition A.3 (w). For k = 1, ..., K + 1 and any fixed ψ and any sequence of integers {g(N T )} NT≥1 that satisfies g(N T ) > cN w T for some c > 0 when N T is large enough, then\n1 g(N T ) NT t=NT−g(NT)+1 l k (ψ; X (k) t ) a.s. − − → E(l k (ψ; X (k) t )), 1 g(N T ) NT t=NT−g(NT)+1 l k (ψ; X (k) t ) a.s. − − → E(l k (ψ; X (k) t )).(A21)\nBased on Lemma 1 in Davis & Yau (2013), Proposition A.3 holds when Proposition A.1(2) holds and the Assumption 4* in Davis & Yau (2013) is satisfied. And Assumption 4* is satisfied because an independent process, like the current setting, must be mixing.\n\nIt is necessary to discuss the identifiability of models in M. First we define R b an oversegmentation compared with \nR s if R b (i) = R b (j) leads to R s (i) = R s (j).b k = (R b , µ b ) such that l k (ψ b k ; X (k) t ) = l k (ψ o k ; X (k)\nt ) almost everywhere, then R b must be an oversegmentation compared with R o . And\nµ b satisfies µ b R b (i),w = µ o R o (i),w , ∀i, w.\nProof. Suppose on the contrary there exist a model ψ * = (R * , µ * ) that satisfies ψ * = arg max ψ∈M E(l k (ψ; X (k) t ))), and ψ * is neither the true model nor an oversegmentation of the true model. Then there exist two pixels i 0 and j 0 , such that they are neighboring pixels, R o(k) (i 0 ) = R o(k) (j 0 ) and R * (i 0 ) = R * (j 0 ). Therefore, by Assumption 2, we have\n|µ o(k) R o(k) (i0),w − µ o(k) R o(k) (j0),w | ≥ δ 1 > 0. (A22) Defineμ h,w (R) := 1 a h (R) i,R(i)=h µ o(k) R o (i),w ,(A23)\nwhere a h (R) denotes the number of pixels in region h given segmentation R. And in a special case,\nµ h,w (R o(k) ) = µ o(k) h,w .(A24)\nThen for all possible µ * ∈ Θ k (R * ), we have\nE(l k ((R * , µ * ); X (k) t )) = E( NW w=1 m * h=1 i,s.t.R * (i)=h [x (k) i,t,w log(µ * h,w ) − µ * h,w ]) = NW w=1 m * h=1 i,s.t.R * (i)=h [µ o(k) R o(k) (i),w log(µ * h,w ) − µ * h,w ] = NW w=1 m * h=1 a h (R * )[μ h,w (R) log(µ * h,w ) − µ * h,w ] ≤ NW w=1 m * h=1 a h (R * ) max µ h,w [μ h,w (R) log(µ h,w ) − µ h,w ] = NW w=1 m * h=1\na h (R * )[μ h,w (R * ) log(μ h,w (R * )) −μ h,w (R * )]\n\n= E(l k ((R * ,μ(R * )); X (k) t )).\n\n(A25) Also, we have E(l k ((R * ,μ(R * )); X (k)\nt )) = NW w=1 m * h=1 a h (R * ) max µ h,w [μ h,w (R * ) log(µ h,w ) − µ h,w ] ≤ NW w=1 NI i=1,i / ∈{i0,j0} max λi,w [µ o(k) R o(k) (i),w log(λ i,w ) − λ i,w ] + NW w=1 [µ o(k) R o(k) (i0),w log(µ * R * (i0),w ) − µ * R * (i0),w + µ o(k) R o(k) (j0),w log(µ * R * (j0),w ) − µ * R * (j0),w ] < NW w=1 NI i=1,i / ∈{i0,j0} max λi,w [µ o(k) R o(k) (i),w log(λ i,w ) − λ i,w ] + NW w=1 max λi 0 ,w [µ o(k) R o(k) (i0),w log(λ i0,w ) − λ i0,w ] + NW w=1 max λj 0 ,w [µ o(k) R o(k) (j0),w log(λ j0,w ) − λ j0,w ] = NW w=1 NI i=1 [µ o(k) R o(k) (i),w log(µ o(k) R o(k) (i),w ) − µ o(k) R o(k) (i),w ] = NW w=1 m o(k) h=1 a o(k) h [µ o(k) R o(k) (i),w log(µ o(k) R o(k) (i),w ) − µ o(k) R o(k) (i),w ] =E(l k ((R o(k) , µ o(k) ); X (k) t )).(A26)\nHere the strict inequities must hold because of (A22) Finally combining (A25) and (A26), we have E(l k ((R * , µ * ); X (k) t )) < E(l k ((R o(k) , µ o(k) ); X (k) t )),\n\nwhich is a contradiction. This finishes the proof.\n\nLemma 1. For any fixed R (k) ,\nsup ν d ,νu sup µ (k) ∈Θ k (R (k) ) | 1 N T (ν k − ν k−1 ) L (k)\nT ((R (k) , µ (k) ), ν d , ν u ; X (k) ) − (ν u − ν d )L k ((R (k) , µ (k) ))| a.s.\n− − → 0, sup ν d ,νu sup µ (k) ∈Θ k (R (k) ) | 1 N T (ν k − ν k−1 ) L (k) T ((R (k) , µ (k) ), ν d , ν u ; X (k) ) − (ν u − ν d )L k ((R (k) , µ (k) ))| a.s. − − → 0, sup ν d ,νu sup µ (k) ∈Θ k (R (k) ) | 1 N T (ν k − ν k−1 ) L (k) T ((R (k) , µ (k) ), ν d , ν u ; X (k) ) − (ν u − ν d )L k ((R (k) , µ (k) ))| a.s. − − → 0.(A28)\nSee Proposition 1 and 2 in Davis & Yau (2013) for the proof.\n\nLemma 2. Suppose the true parameters for interval k is ψ o(k) = (R o(k) , µ o(k) ). And suppose a region segmentation R (k) is specified for estimation. Let µ T =μ L k ((R (k) , µ (k) )).\n\n\n(A29)\n\nThen sup ν d ,νu\n| 1 N T (ν k − ν k−1 ) L (k)\nT ((R (k) ,μ T ), ν d , ν u ; X (k) ) − (ν u − ν d )L k ((R (k) , µ * (k) ))| a.s.\n\n\n− − → 0, (A30)\n\nwhere the supremum is defined in (A13). And if R (k) = R o(k) , we further have\nsup ν d ,νu |μ (k) T (ν d , ν u ) − µ o(k) | a.s. − − → 0.(A31)\nIf R (k) is an oversegmentation than R o(k) , then we have\nsup ν d ,νu |μ T,R (k) (i),w (ν d , ν u ) − µ o(k) R o(k) (i),w | a.s. − − → 0 ∀i, w.(A32)\nProof.\n\n(ν u − ν d )(L k ((R (k) , µ * (k) )) − L k ((R (k) ,μ T )))\n≤ sup ν d ,νu |(ν u − ν d )L k ((R (k) , µ * (k) )) − 1 N T (ν k − ν k−1 ) L (k)\nT ((R (k) , µ * (k) ), ν d , ν u ; X (k) )\n+ 1 N T (ν k − ν k−1 ) L (k) T ((R (k) ,μ T ), ν d , ν u ; X (k) ) − (ν u − ν d )L k ((R (k) ,μ T ))| ≤2 sup ν d ,νu sup µ (k) ∈Θ k (R (k) ) | 1 N T (ν k − ν k−1 ) L (k) T ((R (k) ,μ T ), ν d , ν u ; X (k) ) − (ν u − ν d )L k ((R (k) , µ (k) ))| a.s. − − →0.(A33)\nThe first inequity is obtained by the definition of maximum likelihood estimator, and the last convergence comes from Lemma 1. As µ * (k) maximizes L k ((R (k) , µ (k) )) and ν u − ν d > 0, we have |L k ((R (k) , µ * (k) )) − L k ((R (k) ,μ T ))| a.s. − − → 0.\n\nCombining (A33), (A34) and Proposition A.1(1), A30 holds. If R (k) = R o(k) , by Proposition A.4, L k ((R (k) , µ (k) )) has a unique maximizer at µ o(k) , so (A31) holds. If R (k) is an oversegmentation compared with R o(k) , by Proposition A.4, (A32) holds. Now we give a preliminary result of the convergence when the number of change points is known. − − → ν o and for each interval, the estimatedR (k) must be an oversegmentation comparing to the true region segmentation.\n\nWe skip the proof of this theorem because it is quite similar to the proof of Theorem 1 in Davis & Yau (2013). Notice that we need to use Assumption 3 in the proof.\n\nCorollary 1. (Corollary 1 in Davis & Yau (2013)) Under the conditions of Theorem 1, if the number of changepoints is unknown and is estimated from the data , then\n\n\n= 1, ..., m (k) }. And the overall partition is R = {R (k) |k = 1, 2, ..., K + 1}. The Poisson rates µ (k) h,w is the value for the w th band in the h th region of the k th interval. Let µ (k) = {µ (k) h,w |h = 1, ..., m (k) , w = 1, ..., N W }. And let µ = {µ (k) |k = 1, ..., K + 1}, and i ∈ R (k)\n\n\n, with ∆T = 1. The number of 1 Φ −1 is related to the standard Normal error function, with exemplar values Φ −1 ({0.75, 0.841, 0.977, 0.9986, 1 − 10 −5 2 , 1 − 10 −10 2 , 1 − 10 −15 2 }) = {0.6745, 1, 2, 3, 4.417, 6.467, 8.014}. We typically choose p = 1 − 10 −15 2 as our threshold.\n\nFigure 2 .\n2The Poisson rate functions λi,t,w used in the simulation experiments. (a): λi,t,w used in the single pixel experiment without change point (Section 3.1.1). The x-axis denotes the time points, while the y-axis shows the values of λi,t,w for different band w. (b): the λi,t,w relative to the nochange case (top left), used in the single pixel simulation with changing intensity (Section 3.1.2). (c): the λi,t,w for different passbands (marked in blue, orange and green) relative to the no-change case (top left), used in the single pixel simulation with changing intensity and spectra (Section 3.1.3). (d): the spatial structure used for the second group of experiments. Size of the image is m = n = 8.\n\nFigure 3 .\n3Simulation results for Group 1 experiments (single pixel). For all four plots, the x-axes denote the logarithm of the average counts of photons over all time points and all bands. Top left: fraction of the fitted change pointsτ that are identical to the true change points τ . Top right: fraction of the fitted number of change pointK that equals to the true number of change point K. Bottom left: false positive rate. Bottom right: fraction of fitted change points contains true change points; i.e., τ ⊆τ . Note that the legend in the bottom right plot holds for all four plots.\n\nFigure 4 .\n4Simulation results for Group 2 experiments (with spatial structure). For all four plots, the x-axes denote the logarithm of average count of photons over all time points and all bands. Solid curves denote the results when the number of initial seeds was inadequate, while the dotted curves show the results when every pixel was assigned as a initial seed. Top left: fraction of the fitted change pointsτ that are identical to the true change points τ . Top right: fraction of the fitted number of change pointsK that equals to the true number of change points K. Bottom left: false positive rates. Bottom right: fraction of fitted change points contains the true change points; i.e., τ ⊆τ . The legend in the bottom right plot holds for all these four plots.\n\n\nphoton count\n\nFigure 5 .\n5Light curves of Proxima Cen in different bands. Each curve denotes the number of photons within the corresponding band at a given time point index. Vertical black lines denote the locations of the detected change points.\n\nFigure 5 Figure 6 .\n56presents the light curves for different bands as well as the locations of the detected change points. As there is only a single source of photons with negligible background signal level, the detected change points coincide with the changes of the light curves. Many change points are detected for the abrupt increase and then decrease in brightness for all the bands at the time points between 42 and 50. The time interval between 15 and 36 is detected as a homogeneous time interval, and the variation in light curves within this interval is viewed2 https://www.cosmos.esa.int/web/xmm-newton/Results for Proxima Centauri. (a): the data image at time point 42 for the first band (200, 1000] in eV. (b): the corresponding fitted value λi,t,w. (c): regions that show an increase (blue) and decrease (red) in intensity prior to this time point. Compared with the previous time interval, there was a significant increase in the source at this time point. (d): as in panel c, but for the epoch after this time point. After this time point, the brightness in the source decreased. Notices that these two bottom plots share the colorbar, where the value 1 denotes increasing and −1 denotes decreasing intensities. as common Poisson variations. A few change points are detected for the time interval before time point 15 and the interval after 50. A piecewise constant model is used to fit these gradual changes in intensities.\n\nFigure 7 .\n7An isolated loop structure shown lighting up in 3 SDO/AIA passbands. Each row corresponds to the intensities in AIA filter images, averaged over the time duration found by our method, going from interval 1 (top) to interval 4 (bottom). The columns, going from left to right, show the 94, 335, and 131Å filter band images. The filter name, time duration, and the image sequence indices are marked at the top of the image and the intensity scale is marked at the bottom. The grid at the bottom of each image denotes the pixelation, with each image having a size of 64×64 pixels. Notice that the isolated loop becomes bright enough for detection in the 3 rd interval.\n\nFigure 8 .\n8Intensities λi,t,w as fit to the data from\n\n\nw 's within the k th interval follow the same corresponding two-dimensional piecewise constant model with m (k) constant regions. The partition of the images within interval k is specified by a region assignment function R (k) (.) : {1, ..., N I } → {1, ..., m (k) }. The Poisson parameters µ (k) h,w is the value for the w th band in the h th region of the k th interval. Let µ (k) = {µ (k)\n\nProposition A. 4 .\n4For the k th interval, the true model ψ o k ∈ M satisfies ψ o k = arg max ψ∈M E(l k (ψ; X (k) t )). Also, ψ o k is uniquely identifiable, which means that if there exists a µ * such that l k ((R o , µ o ); X (k) t ) = l k ((R o , µ * ); X (k) t ) almost everywhere for X (k) t , then µ o = µ * . And suppose there exists another model ψ\n\nT\n(ν d , ν u ) := arg maxµ (k) ∈Θ k (R (k) ) L (k) T ((R (k) , µ (k) ), ν d , ν u ; X k ), µ * (k) := arg max µ (k) ∈Θ k (R (k) )\n\nTheorem 1 .\n1(Theorem 1 inDavis & Yau (2013)) Let {Y t |t = 1, ..., N T } be the observed images specified by (K o , ν o , ψ o ). And suppose the number of change points K o is known. The change points and parameters are estimated by (ν T ,ψ T ) = arg min\n\nTable 1 .\n1Statistical NotationsNotation \n\n. The number of change points cannot be underestimated. That is to say,K ≥ K o almost surely when N T is large enough.2. WhenK > K o , ν o must be a subset of the limit ofν T for large enough N T .\n3. In each fitted interval, the region segmentation must be equal to or be an oversegmentation comparing with the corresponding true region segmentation.See Corollary 1 inDavis & Yau (2013)for more details.Theorem 2. (Theorem 2 inDavis & Yau (2013)See the proof of Theorem 2 inDavis & Yau (2013).Lemma 3. Suppose the true region segmentation R o(k) is specified for the k th interval, thenWhen the specific region segmentation R (k) is an oversegmentation compared with R o(k) , then we havêSee Lemma 2 inDavis & Yau (2013)for more details.Then we come to the main result.\n. R Adams, L Bischof, IEEE Transactions on Pattern Analysis and Machine Intelligence. 641Adams, R., & Bischof, L. 1994, IEEE Transactions on Pattern Analysis and Machine Intelligence, 641\n\n. A Aggarwal, N Schanche, K K Reeves, D Kempton, R Angryk, 10.3847/1538-4365/aab77fApJS. 23615Aggarwal, A., Schanche, N., Reeves, K. K., Kempton, D., & Angryk, R. 2018, ApJS, 236, 15, doi: 10.3847/1538-4365/aab77f\n\n. T P Robitaille, Astropy CollaborationE J Tollerud, Astropy Collaboration10.1051/0004-6361/201322068A&A. 55833Astropy Collaboration, Robitaille, T. P., Tollerud, E. J., et al. 2013, A&A, 558, A33, doi: 10.1051/0004-6361/201322068\n\n. A M Price-Whelan, Astropy CollaborationB M Sipőcz, Astropy Collaboration10.3847/1538-3881/aabc4fAJ. 156123Astropy Collaboration, Price-Whelan, A. M., Sipőcz, B. M., et al. 2018, AJ, 156, 123, doi: 10.3847/1538-3881/aabc4f\n\n. A Aue, L Horváth, 10.1111/j.1467-9892.2012.00819.xJournal of Time Series Analysis. 341Aue, A., & Horváth, L. 2013, Journal of Time Series Analysis, 34, 1, doi: 10.1111/j.1467-9892.2012.00819.x\n\n. A Aue, T C M Lee, The Annals of Statistics. 392912Aue, A., & Lee, T. C. M. 2011, The Annals of Statistics, 39, 2912\n\n. G Barnes, N Schanche, K D Leka, A Aggarwal, K Reeves, Astroinformatics. M. Brescia, S. G. Djorgovski, E. D. Feigelson, G. Longo, &Barnes, G., Schanche, N., Leka, K. D., Aggarwal, A., & Reeves, K. 2017, in Astroinformatics, ed. M. Brescia, S. G. Djorgovski, E. D. Feigelson, G. Longo, &\n\n. S Cavuoti, 10.1017/S1743921316012758325S. Cavuoti, Vol. 325, 201-204, doi: 10.1017/S1743921316012758\n\n. C Carson, S Belongie, H Greenspan, J Malik, IEEE Transactions on Pattern Analysis and Machine Intelligence. 167Carson, C., Belongie, S., Greenspan, H., & Malik, J. 1999, IEEE Transactions on Pattern Analysis and Machine Intelligence, 167\n\n. R A Davis, T C M Lee, G A Rodriguez-Yam, Journal of the American Statistical Association. 101223Davis, R. A., Lee, T. C. M., & Rodriguez-Yam, G. A. 2006, Journal of the American Statistical Association, 101, 223\n\n. R A Davis, C Y Yau, Electronic Journal of Statistics. 7381Davis, R. A., & Yau, C. Y. 2013, Electronic Journal of Statistics, 7, 381\n\nV Dey, Y Zhang, M Zhong, The International Society for Photogrammetry and Remote Sensing Symposium (ISPRS) TC VII Symposium-100 Years ISPRS. Vienna, Austria, XXXVIII31Dey, V., Zhang, Y., & Zhong, M. 2010, The International Society for Photogrammetry and Remote Sensing Symposium (ISPRS) TC VII Symposium-100 Years ISPRS, Vienna, Austria, XXXVIII, 31\n\nM Fan, T C Lee, 10.1049/iet-ipr.2014.0490IET Image Processing. 9478Fan, M., & Lee, T. C. 2015, IET Image Processing, 9, 478, doi: https://doi.org/10.1049/iet-ipr.2014.0490\n\n. P F Felzenszwalb, D P Huttenlocher, International Journal of Computer Vision. 592167Felzenszwalb, P. F., & Huttenlocher, D. P. 2004, International Journal of Computer Vision, 59(2), 167\n\nSolarSoft: Programming and data analysis environment for solar physics. S L Freeland, B N Handy, Freeland, S. L., & Handy, B. N. 2012, SolarSoft: Programming and data analysis environment for solar physics. http://ascl.net/1208.013\n\nA Fruscione, J C Mcdowell, G E Allen, 10.1117/12.671760Society of Photo-Optical Instrumentation Engineers (SPIE) Conference Series. D. R. Silva & R. E. Doxsey627062701Society of Photo-Optical Instrumentation Engineers (SPIE) Conference SeriesFruscione, A., McDowell, J. C., Allen, G. E., et al. 2006, in Society of Photo-Optical Instrumentation Engineers (SPIE) Conference Series, Vol. 6270, Society of Photo-Optical Instrumentation Engineers (SPIE) Conference Series, ed. D. R. Silva & R. E. Doxsey, 62701V, doi: 10.1117/12.671760\n\n. M Güdel, 10.1007/s00159-004-0023-2The Astronomy and Astrophysics Review. 1271Güdel, M. 2004, The Astronomy and Astrophysics Review, 12, 71, doi: 10.1007/s00159-004-0023-2\n\n. M Güdel, M Audard, S L Skinner, M I Horvath, 10.1086/345404The Astrophysical Journal. 58073Güdel, M., Audard, M., Skinner, S. L., & Horvath, M. I. 2002, The Astrophysical Journal, 580, L73, doi: 10.1086/345404\n\n. J M Hughes, V W Hsu, D B Seaton, 10.1051/swsc/2019036Journal of Space Weather and Space Climate. 938Hughes, J. M., Hsu, V. W., Seaton, D. B., et al. 2019, Journal of Space Weather and Space Climate, 9, A38, doi: 10.1051/swsc/2019036\n\n. N Hurlburt, M Cheung, C Schrijver, 10.1007/s11207-010-9624-2SoPh. 27567Hurlburt, N., Cheung, M., Schrijver, C., et al. 2012, SoPh, 275, 67, doi: 10.1007/s11207-010-9624-2\n\n. T C M Lee, Journal of the American Statistical Association. 259Lee, T. C. M. 2000, Journal of the American Statistical Association, 259\n\n. International Statistical Review. 69169-. 2001, International Statistical Review, 69, 169\n\n. J R Lemen, A M Title, D J Akin, 10.1007/s11207-011-9776-8SoPh. 27517Lemen, J. R., Title, A. M., Akin, D. J., et al. 2012, SoPh, 275, 17, doi: 10.1007/s11207-011-9776-8\n\n. P C H Martens, G D R Attrill, A R Davey, 10.1007/s11207-010-9697-ySoPh. 27579Martens, P. C. H., Attrill, G. D. R., Davey, A. R., et al. 2012, SoPh, 275, 79, doi: 10.1007/s11207-010-9697-y\n\n. W D Pesnell, B J Thompson, P C Chamberlin, 10.1007/s11207-011-9841-3SoPh. 275Pesnell, W. D., Thompson, B. J., & Chamberlin, P. C. 2012, SoPh, 275, 3, doi: 10.1007/s11207-011-9841-3\n\nJ Rissanen, Stochastic Complexity in Statistical Inquiry Theory. USAWorld Scientific Publishing Co., IncRissanen, J. 1989, Stochastic Complexity in Statistical Inquiry Theory (USA: World Scientific Publishing Co., Inc.)\n\n10.1007/978-0-387-68812-1Information and Complexity in Statistical Modeling. -. 2007, Information and Complexity in Statistical Modeling, doi: 10.1007/978-0-387-68812-1\n\n. P J Rousseeuw, C Croux, 10.1080/01621459.1993.10476408Journal of the American Statistical Association. 881273Rousseeuw, P. J., & Croux, C. 1993, Journal of the American Statistical Association, 88, 1273, doi: 10.1080/01621459.1993.10476408\n\n. J D Scargle, J P Norris, B Jackson, J Chiang, 10.1088/0004-637x/764/2/167The Astrophysical Journal. 764167Scargle, J. D., Norris, J. P., Jackson, B., & Chiang, J. 2013, The Astrophysical Journal, 764, 167, doi: 10.1088/0004-637x/764/2/167\n\n. R K W Wong, V L Kashyap, T C M Lee, D A Van Dyk, 10.1214/16-AOAS933Annals of Applied Statistics. 101107Wong, R. K. W., Kashyap, V. L., Lee, T. C. M., & van Dyk, D. A. 2016, Annals of Applied Statistics, 10, 1107, doi: 10.1214/16-AOAS933\n", "annotations": {"author": "[{\"end\":217,\"start\":117},{\"end\":338,\"start\":218},{\"end\":440,\"start\":339},{\"end\":548,\"start\":441},{\"end\":635,\"start\":549}]", "publisher": null, "author_last_name": "[{\"end\":124,\"start\":122},{\"end\":237,\"start\":230},{\"end\":354,\"start\":347},{\"end\":455,\"start\":452},{\"end\":562,\"start\":557}]", "author_first_name": "[{\"end\":121,\"start\":117},{\"end\":222,\"start\":218},{\"end\":229,\"start\":223},{\"end\":344,\"start\":339},{\"end\":346,\"start\":345},{\"end\":447,\"start\":441},{\"end\":451,\"start\":448},{\"end\":556,\"start\":549}]", "author_affiliation": "[{\"end\":216,\"start\":126},{\"end\":337,\"start\":239},{\"end\":439,\"start\":356},{\"end\":547,\"start\":457},{\"end\":634,\"start\":564}]", "title": "[{\"end\":86,\"start\":1},{\"end\":721,\"start\":636}]", "venue": null, "abstract": "[{\"end\":2479,\"start\":986}]", "bib_ref": "[{\"attributes\":{\"ref_id\":\"b4\"},\"end\":3548,\"start\":3528},{\"attributes\":{\"ref_id\":\"b28\"},\"end\":3908,\"start\":3888},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":4099,\"start\":4080},{\"attributes\":{\"ref_id\":\"b25\"},\"end\":4355,\"start\":4341},{\"end\":4372,\"start\":4355},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":4436,\"start\":4418},{\"attributes\":{\"ref_id\":\"b29\"},\"end\":4566,\"start\":4548},{\"attributes\":{\"ref_id\":\"b11\"},\"end\":4727,\"start\":4710},{\"attributes\":{\"ref_id\":\"b13\"},\"end\":5033,\"start\":4999},{\"attributes\":{\"ref_id\":\"b8\"},\"end\":5558,\"start\":5538},{\"attributes\":{\"ref_id\":\"b0\"},\"end\":6264,\"start\":6242},{\"attributes\":{\"ref_id\":\"b25\"},\"end\":6386,\"start\":6372},{\"end\":6402,\"start\":6386},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":6504,\"start\":6486},{\"attributes\":{\"ref_id\":\"b20\"},\"end\":6513,\"start\":6504},{\"attributes\":{\"ref_id\":\"b29\"},\"end\":6529,\"start\":6513},{\"end\":6910,\"start\":6900},{\"attributes\":{\"ref_id\":\"b5\"},\"end\":7276,\"start\":7261},{\"attributes\":{\"ref_id\":\"b20\"},\"end\":7285,\"start\":7276},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":7303,\"start\":7285},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":7319,\"start\":7303},{\"attributes\":{\"ref_id\":\"b0\"},\"end\":9608,\"start\":9586},{\"attributes\":{\"ref_id\":\"b12\"},\"end\":9749,\"start\":9733},{\"attributes\":{\"ref_id\":\"b29\"},\"end\":11601,\"start\":11583},{\"end\":13162,\"start\":13159},{\"attributes\":{\"ref_id\":\"b20\"},\"end\":16488,\"start\":16478},{\"attributes\":{\"ref_id\":\"b27\"},\"end\":24746,\"start\":24723},{\"attributes\":{\"ref_id\":\"b16\"},\"end\":34317,\"start\":34307},{\"attributes\":{\"ref_id\":\"b17\"},\"end\":35200,\"start\":35181},{\"end\":35550,\"start\":35545},{\"end\":35555,\"start\":35550},{\"attributes\":{\"ref_id\":\"b19\"},\"end\":37292,\"start\":37271},{\"attributes\":{\"ref_id\":\"b23\"},\"end\":37312,\"start\":37292},{\"end\":37458,\"start\":37436},{\"attributes\":{\"ref_id\":\"b18\"},\"end\":37477,\"start\":37458},{\"attributes\":{\"ref_id\":\"b6\"},\"end\":37496,\"start\":37477},{\"attributes\":{\"ref_id\":\"b24\"},\"end\":37926,\"start\":37905},{\"attributes\":{\"ref_id\":\"b22\"},\"end\":37944,\"start\":37926},{\"end\":38927,\"start\":38917},{\"end\":38935,\"start\":38927},{\"end\":39019,\"start\":38991},{\"end\":43793,\"start\":43765},{\"end\":43837,\"start\":43803},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":43938,\"start\":43915},{\"attributes\":{\"ref_id\":\"b29\"},\"end\":43967,\"start\":43949},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":49235,\"start\":49217},{\"end\":50229,\"start\":50222},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":51617,\"start\":51599},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":51714,\"start\":51696},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":54906,\"start\":54888},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":56868,\"start\":56850},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":56972,\"start\":56954},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":63109,\"start\":63091}]", "figure": "[{\"attributes\":{\"id\":\"fig_0\"},\"end\":57389,\"start\":57088},{\"attributes\":{\"id\":\"fig_1\"},\"end\":57675,\"start\":57390},{\"attributes\":{\"id\":\"fig_2\"},\"end\":58389,\"start\":57676},{\"attributes\":{\"id\":\"fig_4\"},\"end\":58982,\"start\":58390},{\"attributes\":{\"id\":\"fig_6\"},\"end\":59754,\"start\":58983},{\"attributes\":{\"id\":\"fig_7\"},\"end\":59769,\"start\":59755},{\"attributes\":{\"id\":\"fig_8\"},\"end\":60003,\"start\":59770},{\"attributes\":{\"id\":\"fig_9\"},\"end\":61446,\"start\":60004},{\"attributes\":{\"id\":\"fig_10\"},\"end\":62124,\"start\":61447},{\"attributes\":{\"id\":\"fig_11\"},\"end\":62180,\"start\":62125},{\"attributes\":{\"id\":\"fig_12\"},\"end\":62574,\"start\":62181},{\"attributes\":{\"id\":\"fig_13\"},\"end\":62932,\"start\":62575},{\"attributes\":{\"id\":\"fig_14\"},\"end\":63063,\"start\":62933},{\"attributes\":{\"id\":\"fig_15\"},\"end\":63320,\"start\":63064},{\"attributes\":{\"id\":\"tab_0\",\"type\":\"table\"},\"end\":63364,\"start\":63321}]", "paragraph": "[{\"end\":3381,\"start\":2495},{\"end\":5761,\"start\":3383},{\"end\":6311,\"start\":5763},{\"end\":7525,\"start\":6313},{\"end\":8527,\"start\":7541},{\"end\":9290,\"start\":8529},{\"end\":9361,\"start\":9292},{\"end\":9821,\"start\":9392},{\"end\":10496,\"start\":9823},{\"end\":10601,\"start\":10498},{\"end\":10985,\"start\":10603},{\"end\":11546,\"start\":11039},{\"end\":11930,\"start\":11548},{\"end\":12034,\"start\":11932},{\"end\":12374,\"start\":12079},{\"end\":12688,\"start\":12376},{\"end\":13001,\"start\":12717},{\"end\":13497,\"start\":13003},{\"end\":14248,\"start\":13506},{\"end\":14460,\"start\":14287},{\"end\":14600,\"start\":14462},{\"end\":14770,\"start\":14638},{\"end\":15144,\"start\":14772},{\"end\":15455,\"start\":15223},{\"end\":15848,\"start\":15495},{\"end\":16286,\"start\":15850},{\"end\":16442,\"start\":16288},{\"end\":16571,\"start\":16444},{\"end\":16825,\"start\":16699},{\"end\":17376,\"start\":16876},{\"end\":17650,\"start\":17584},{\"end\":17938,\"start\":17747},{\"end\":18641,\"start\":17966},{\"end\":18960,\"start\":18693},{\"end\":19112,\"start\":19027},{\"end\":19380,\"start\":19114},{\"end\":19470,\"start\":19382},{\"end\":19631,\"start\":19472},{\"end\":19636,\"start\":19633},{\"end\":19720,\"start\":19638},{\"end\":20103,\"start\":19722},{\"end\":20235,\"start\":20132},{\"end\":21397,\"start\":20237},{\"end\":21971,\"start\":21399},{\"end\":22381,\"start\":21973},{\"end\":22909,\"start\":22383},{\"end\":23267,\"start\":22941},{\"end\":23677,\"start\":23269},{\"end\":23967,\"start\":23708},{\"end\":24043,\"start\":23969},{\"end\":24233,\"start\":24063},{\"end\":24414,\"start\":24265},{\"end\":24979,\"start\":24493},{\"end\":25341,\"start\":25011},{\"end\":25652,\"start\":25343},{\"end\":25777,\"start\":25698},{\"end\":26124,\"start\":25779},{\"end\":26562,\"start\":26140},{\"end\":26958,\"start\":26588},{\"end\":27036,\"start\":26960},{\"end\":27141,\"start\":27038},{\"end\":27196,\"start\":27143},{\"end\":27324,\"start\":27198},{\"end\":27572,\"start\":27344},{\"end\":28718,\"start\":27574},{\"end\":28842,\"start\":28740},{\"end\":29164,\"start\":28844},{\"end\":29552,\"start\":29166},{\"end\":30069,\"start\":29554},{\"end\":30856,\"start\":30090},{\"end\":31405,\"start\":30887},{\"end\":32194,\"start\":31425},{\"end\":32452,\"start\":32216},{\"end\":32715,\"start\":32473},{\"end\":32826,\"start\":32741},{\"end\":33054,\"start\":32828},{\"end\":33293,\"start\":33056},{\"end\":34393,\"start\":33323},{\"end\":34662,\"start\":34441},{\"end\":35266,\"start\":34671},{\"end\":35890,\"start\":35268},{\"end\":36661,\"start\":35902},{\"end\":37011,\"start\":36702},{\"end\":38287,\"start\":37013},{\"end\":39415,\"start\":38296},{\"end\":40023,\"start\":39427},{\"end\":41970,\"start\":40025},{\"end\":42384,\"start\":41982},{\"end\":42669,\"start\":42386},{\"end\":43710,\"start\":42671},{\"end\":44658,\"start\":43755},{\"end\":45579,\"start\":44700},{\"end\":45660,\"start\":45581},{\"end\":45934,\"start\":45701},{\"end\":46108,\"start\":45936},{\"end\":46425,\"start\":46402},{\"end\":46591,\"start\":46480},{\"end\":46895,\"start\":46730},{\"end\":47211,\"start\":47014},{\"end\":47505,\"start\":47283},{\"end\":47773,\"start\":47687},{\"end\":48075,\"start\":47817},{\"end\":48220,\"start\":48163},{\"end\":48449,\"start\":48297},{\"end\":48717,\"start\":48546},{\"end\":48883,\"start\":48818},{\"end\":49288,\"start\":48919},{\"end\":49517,\"start\":49427},{\"end\":49574,\"start\":49519},{\"end\":49742,\"start\":49670},{\"end\":49905,\"start\":49811},{\"end\":50304,\"start\":50112},{\"end\":51419,\"start\":50878},{\"end\":51833,\"start\":51579},{\"end\":51952,\"start\":51835},{\"end\":52161,\"start\":52078},{\"end\":52593,\"start\":52215},{\"end\":52819,\"start\":52720},{\"end\":52903,\"start\":52856},{\"end\":53300,\"start\":53244},{\"end\":53338,\"start\":53302},{\"end\":53388,\"start\":53340},{\"end\":54297,\"start\":54128},{\"end\":54349,\"start\":54299},{\"end\":54381,\"start\":54351},{\"end\":54530,\"start\":54447},{\"end\":54921,\"start\":54861},{\"end\":55110,\"start\":54923},{\"end\":55136,\"start\":55120},{\"end\":55248,\"start\":55166},{\"end\":55346,\"start\":55267},{\"end\":55469,\"start\":55411},{\"end\":55567,\"start\":55561},{\"end\":55629,\"start\":55569},{\"end\":55753,\"start\":55711},{\"end\":56278,\"start\":56018},{\"end\":56757,\"start\":56280},{\"end\":56923,\"start\":56759},{\"end\":57087,\"start\":56925}]", "formula": "[{\"attributes\":{\"id\":\"formula_0\"},\"end\":12078,\"start\":12035},{\"attributes\":{\"id\":\"formula_1\"},\"end\":13505,\"start\":13498},{\"attributes\":{\"id\":\"formula_2\"},\"end\":14286,\"start\":14249},{\"attributes\":{\"id\":\"formula_3\"},\"end\":15222,\"start\":15145},{\"attributes\":{\"id\":\"formula_4\"},\"end\":15466,\"start\":15456},{\"attributes\":{\"id\":\"formula_5\"},\"end\":16698,\"start\":16572},{\"attributes\":{\"id\":\"formula_6\"},\"end\":16875,\"start\":16826},{\"attributes\":{\"id\":\"formula_7\"},\"end\":17583,\"start\":17377},{\"attributes\":{\"id\":\"formula_8\"},\"end\":17746,\"start\":17651},{\"attributes\":{\"id\":\"formula_9\"},\"end\":24062,\"start\":24044},{\"attributes\":{\"id\":\"formula_10\"},\"end\":24264,\"start\":24234},{\"attributes\":{\"id\":\"formula_11\"},\"end\":24445,\"start\":24415},{\"attributes\":{\"id\":\"formula_12\"},\"end\":24492,\"start\":24445},{\"attributes\":{\"id\":\"formula_13\"},\"end\":25697,\"start\":25653},{\"attributes\":{\"id\":\"formula_14\"},\"end\":45700,\"start\":45661},{\"attributes\":{\"id\":\"formula_15\"},\"end\":46340,\"start\":46109},{\"attributes\":{\"id\":\"formula_16\"},\"end\":46401,\"start\":46340},{\"attributes\":{\"id\":\"formula_17\"},\"end\":46479,\"start\":46426},{\"attributes\":{\"id\":\"formula_18\"},\"end\":46729,\"start\":46592},{\"attributes\":{\"id\":\"formula_19\"},\"end\":47013,\"start\":46896},{\"attributes\":{\"id\":\"formula_20\"},\"end\":47282,\"start\":47212},{\"attributes\":{\"id\":\"formula_21\"},\"end\":47686,\"start\":47506},{\"attributes\":{\"id\":\"formula_22\"},\"end\":47816,\"start\":47774},{\"attributes\":{\"id\":\"formula_23\"},\"end\":48162,\"start\":48076},{\"attributes\":{\"id\":\"formula_24\"},\"end\":48296,\"start\":48221},{\"attributes\":{\"id\":\"formula_25\"},\"end\":48545,\"start\":48450},{\"attributes\":{\"id\":\"formula_26\"},\"end\":48817,\"start\":48718},{\"attributes\":{\"id\":\"formula_27\"},\"end\":48918,\"start\":48884},{\"attributes\":{\"id\":\"formula_28\"},\"end\":49426,\"start\":49289},{\"attributes\":{\"id\":\"formula_29\"},\"end\":49633,\"start\":49575},{\"attributes\":{\"id\":\"formula_30\"},\"end\":49669,\"start\":49633},{\"attributes\":{\"id\":\"formula_31\"},\"end\":49810,\"start\":49743},{\"attributes\":{\"id\":\"formula_32\"},\"end\":50111,\"start\":49906},{\"attributes\":{\"id\":\"formula_33\"},\"end\":50877,\"start\":50305},{\"attributes\":{\"id\":\"formula_34\"},\"end\":51578,\"start\":51420},{\"attributes\":{\"id\":\"formula_35\"},\"end\":52005,\"start\":51953},{\"attributes\":{\"id\":\"formula_36\"},\"end\":52077,\"start\":52005},{\"attributes\":{\"id\":\"formula_37\"},\"end\":52214,\"start\":52162},{\"attributes\":{\"id\":\"formula_38\"},\"end\":52719,\"start\":52594},{\"attributes\":{\"id\":\"formula_39\"},\"end\":52855,\"start\":52820},{\"attributes\":{\"id\":\"formula_40\"},\"end\":53243,\"start\":52904},{\"attributes\":{\"id\":\"formula_41\"},\"end\":54127,\"start\":53389},{\"attributes\":{\"id\":\"formula_43\"},\"end\":54446,\"start\":54382},{\"attributes\":{\"id\":\"formula_44\"},\"end\":54860,\"start\":54531},{\"attributes\":{\"id\":\"formula_45\"},\"end\":55165,\"start\":55137},{\"attributes\":{\"id\":\"formula_46\"},\"end\":55410,\"start\":55347},{\"attributes\":{\"id\":\"formula_47\"},\"end\":55560,\"start\":55470},{\"attributes\":{\"id\":\"formula_48\"},\"end\":55710,\"start\":55630},{\"attributes\":{\"id\":\"formula_49\"},\"end\":56017,\"start\":55754}]", "table_ref": "[{\"attributes\":{\"ref_id\":\"tab_0\"},\"end\":9360,\"start\":9353}]", "section_header": "[{\"attributes\":{\"n\":\"1.\"},\"end\":2493,\"start\":2481},{\"attributes\":{\"n\":\"2.\"},\"end\":7539,\"start\":7528},{\"attributes\":{\"n\":\"2.1.\"},\"end\":9390,\"start\":9364},{\"attributes\":{\"n\":\"2.2.\"},\"end\":11019,\"start\":10988},{\"attributes\":{\"n\":\"2.2.1.\"},\"end\":11037,\"start\":11022},{\"attributes\":{\"n\":\"2.2.2.\"},\"end\":12715,\"start\":12691},{\"attributes\":{\"n\":\"2.2.3.\"},\"end\":14636,\"start\":14603},{\"attributes\":{\"n\":\"2.2.4.\"},\"end\":15493,\"start\":15468},{\"attributes\":{\"n\":\"2.2.5.\"},\"end\":17964,\"start\":17941},{\"attributes\":{\"n\":\"2.3.\"},\"end\":18666,\"start\":18644},{\"attributes\":{\"n\":\"2.3.1.\"},\"end\":18691,\"start\":18669},{\"end\":19025,\"start\":18963},{\"attributes\":{\"n\":\"2.3.2.\"},\"end\":20130,\"start\":20106},{\"attributes\":{\"n\":\"2.4.\"},\"end\":22939,\"start\":22912},{\"attributes\":{\"n\":\"2.4.1.\"},\"end\":23706,\"start\":23680},{\"attributes\":{\"n\":\"2.4.2.\"},\"end\":25009,\"start\":24982},{\"attributes\":{\"n\":\"3.\"},\"end\":26138,\"start\":26127},{\"attributes\":{\"n\":\"3.1.\"},\"end\":26586,\"start\":26565},{\"attributes\":{\"n\":\"3.1.1.\"},\"end\":27342,\"start\":27327},{\"attributes\":{\"n\":\"3.1.2.\"},\"end\":28738,\"start\":28721},{\"attributes\":{\"n\":\"3.1.3.\"},\"end\":30088,\"start\":30072},{\"attributes\":{\"n\":\"3.2.\"},\"end\":30885,\"start\":30859},{\"attributes\":{\"n\":\"3.2.1.\"},\"end\":31423,\"start\":31408},{\"attributes\":{\"n\":\"3.2.2.\"},\"end\":32214,\"start\":32197},{\"attributes\":{\"n\":\"3.2.3.\"},\"end\":32471,\"start\":32455},{\"attributes\":{\"n\":\"3.3.\"},\"end\":32739,\"start\":32718},{\"attributes\":{\"n\":\"4.\"},\"end\":33321,\"start\":33296},{\"attributes\":{\"n\":\"4.1.\"},\"end\":34439,\"start\":34396},{\"attributes\":{\"n\":\"4.1.1.\"},\"end\":34669,\"start\":34665},{\"attributes\":{\"n\":\"4.1.2.\"},\"end\":35900,\"start\":35893},{\"attributes\":{\"n\":\"4.2.\"},\"end\":36700,\"start\":36664},{\"attributes\":{\"n\":\"4.2.1.\"},\"end\":38294,\"start\":38290},{\"attributes\":{\"n\":\"4.2.2.\"},\"end\":39425,\"start\":39418},{\"attributes\":{\"n\":\"5.\"},\"end\":41980,\"start\":41973},{\"end\":43753,\"start\":43713},{\"end\":44669,\"start\":44661},{\"end\":44698,\"start\":44672},{\"end\":55118,\"start\":55113},{\"end\":55265,\"start\":55251},{\"end\":57687,\"start\":57677},{\"end\":58401,\"start\":58391},{\"end\":58994,\"start\":58984},{\"end\":59781,\"start\":59771},{\"end\":60024,\"start\":60005},{\"end\":61458,\"start\":61448},{\"end\":62136,\"start\":62126},{\"end\":62594,\"start\":62576},{\"end\":62935,\"start\":62934},{\"end\":63076,\"start\":63065},{\"end\":63331,\"start\":63322}]", "table": "[{\"end\":63364,\"start\":63354}]", "figure_caption": "[{\"end\":57389,\"start\":57090},{\"end\":57675,\"start\":57392},{\"end\":58389,\"start\":57689},{\"end\":58982,\"start\":58403},{\"end\":59754,\"start\":58996},{\"end\":59769,\"start\":59757},{\"end\":60003,\"start\":59783},{\"end\":61446,\"start\":60027},{\"end\":62124,\"start\":61460},{\"end\":62180,\"start\":62138},{\"end\":62574,\"start\":62183},{\"end\":62932,\"start\":62596},{\"end\":63063,\"start\":62936},{\"end\":63320,\"start\":63078},{\"end\":63354,\"start\":63333}]", "figure_ref": "[{\"attributes\":{\"ref_id\":\"fig_15\"},\"end\":20063,\"start\":20055},{\"attributes\":{\"ref_id\":\"fig_2\"},\"end\":27030,\"start\":27022},{\"attributes\":{\"ref_id\":\"fig_2\"},\"end\":27135,\"start\":27127},{\"attributes\":{\"ref_id\":\"fig_2\"},\"end\":27190,\"start\":27182},{\"attributes\":{\"ref_id\":\"fig_4\"},\"end\":27691,\"start\":27683},{\"attributes\":{\"ref_id\":\"fig_2\"},\"end\":28832,\"start\":28824},{\"attributes\":{\"ref_id\":\"fig_4\"},\"end\":28899,\"start\":28891},{\"attributes\":{\"ref_id\":\"fig_2\"},\"end\":30234,\"start\":30226},{\"attributes\":{\"ref_id\":\"fig_4\"},\"end\":30372,\"start\":30364},{\"attributes\":{\"ref_id\":\"fig_2\"},\"end\":31552,\"start\":31544},{\"attributes\":{\"ref_id\":\"fig_6\"},\"end\":31609,\"start\":31601},{\"attributes\":{\"ref_id\":\"fig_6\"},\"end\":31897,\"start\":31889},{\"attributes\":{\"ref_id\":\"fig_2\"},\"end\":32294,\"start\":32286},{\"attributes\":{\"ref_id\":\"fig_6\"},\"end\":32451,\"start\":32443},{\"attributes\":{\"ref_id\":\"fig_2\"},\"end\":32607,\"start\":32599},{\"attributes\":{\"ref_id\":\"fig_6\"},\"end\":32669,\"start\":32661},{\"end\":35637,\"start\":35629},{\"end\":36351,\"start\":36343},{\"attributes\":{\"ref_id\":\"fig_10\"},\"end\":36822,\"start\":36814},{\"attributes\":{\"ref_id\":\"fig_10\"},\"end\":38756,\"start\":38748},{\"attributes\":{\"ref_id\":\"fig_11\"},\"end\":39489,\"start\":39481},{\"end\":40397,\"start\":40389},{\"end\":41014,\"start\":41006},{\"attributes\":{\"ref_id\":\"fig_15\"},\"end\":41413,\"start\":41404},{\"attributes\":{\"ref_id\":\"fig_15\"},\"end\":44128,\"start\":44119}]", "bib_author_first_name": "[{\"end\":64139,\"start\":64138},{\"end\":64148,\"start\":64147},{\"end\":64328,\"start\":64327},{\"end\":64340,\"start\":64339},{\"end\":64352,\"start\":64351},{\"end\":64354,\"start\":64353},{\"end\":64364,\"start\":64363},{\"end\":64375,\"start\":64374},{\"end\":64543,\"start\":64542},{\"end\":64545,\"start\":64544},{\"end\":64580,\"start\":64579},{\"end\":64582,\"start\":64581},{\"end\":64775,\"start\":64774},{\"end\":64777,\"start\":64776},{\"end\":64814,\"start\":64813},{\"end\":64816,\"start\":64815},{\"end\":65000,\"start\":64999},{\"end\":65007,\"start\":65006},{\"end\":65196,\"start\":65195},{\"end\":65203,\"start\":65202},{\"end\":65207,\"start\":65204},{\"end\":65315,\"start\":65314},{\"end\":65325,\"start\":65324},{\"end\":65337,\"start\":65336},{\"end\":65339,\"start\":65338},{\"end\":65347,\"start\":65346},{\"end\":65359,\"start\":65358},{\"end\":65604,\"start\":65603},{\"end\":65708,\"start\":65707},{\"end\":65718,\"start\":65717},{\"end\":65730,\"start\":65729},{\"end\":65743,\"start\":65742},{\"end\":65949,\"start\":65948},{\"end\":65951,\"start\":65950},{\"end\":65960,\"start\":65959},{\"end\":65964,\"start\":65961},{\"end\":65971,\"start\":65970},{\"end\":65973,\"start\":65972},{\"end\":66164,\"start\":66163},{\"end\":66166,\"start\":66165},{\"end\":66175,\"start\":66174},{\"end\":66177,\"start\":66176},{\"end\":66297,\"start\":66296},{\"end\":66304,\"start\":66303},{\"end\":66313,\"start\":66312},{\"end\":66648,\"start\":66647},{\"end\":66655,\"start\":66654},{\"end\":66657,\"start\":66656},{\"end\":66823,\"start\":66822},{\"end\":66825,\"start\":66824},{\"end\":66841,\"start\":66840},{\"end\":66843,\"start\":66842},{\"end\":67082,\"start\":67081},{\"end\":67084,\"start\":67083},{\"end\":67096,\"start\":67095},{\"end\":67098,\"start\":67097},{\"end\":67243,\"start\":67242},{\"end\":67256,\"start\":67255},{\"end\":67258,\"start\":67257},{\"end\":67270,\"start\":67269},{\"end\":67272,\"start\":67271},{\"end\":67778,\"start\":67777},{\"end\":67952,\"start\":67951},{\"end\":67961,\"start\":67960},{\"end\":67971,\"start\":67970},{\"end\":67973,\"start\":67972},{\"end\":67984,\"start\":67983},{\"end\":67986,\"start\":67985},{\"end\":68165,\"start\":68164},{\"end\":68167,\"start\":68166},{\"end\":68177,\"start\":68176},{\"end\":68179,\"start\":68178},{\"end\":68186,\"start\":68185},{\"end\":68188,\"start\":68187},{\"end\":68401,\"start\":68400},{\"end\":68413,\"start\":68412},{\"end\":68423,\"start\":68422},{\"end\":68575,\"start\":68574},{\"end\":68579,\"start\":68576},{\"end\":68807,\"start\":68806},{\"end\":68809,\"start\":68808},{\"end\":68818,\"start\":68817},{\"end\":68820,\"start\":68819},{\"end\":68829,\"start\":68828},{\"end\":68831,\"start\":68830},{\"end\":68978,\"start\":68977},{\"end\":68982,\"start\":68979},{\"end\":68993,\"start\":68992},{\"end\":68997,\"start\":68994},{\"end\":69008,\"start\":69007},{\"end\":69010,\"start\":69009},{\"end\":69169,\"start\":69168},{\"end\":69171,\"start\":69170},{\"end\":69182,\"start\":69181},{\"end\":69184,\"start\":69183},{\"end\":69196,\"start\":69195},{\"end\":69198,\"start\":69197},{\"end\":69351,\"start\":69350},{\"end\":69744,\"start\":69743},{\"end\":69746,\"start\":69745},{\"end\":69759,\"start\":69758},{\"end\":69987,\"start\":69986},{\"end\":69989,\"start\":69988},{\"end\":70000,\"start\":69999},{\"end\":70002,\"start\":70001},{\"end\":70012,\"start\":70011},{\"end\":70023,\"start\":70022},{\"end\":70229,\"start\":70228},{\"end\":70233,\"start\":70230},{\"end\":70241,\"start\":70240},{\"end\":70243,\"start\":70242},{\"end\":70254,\"start\":70253},{\"end\":70258,\"start\":70255},{\"end\":70265,\"start\":70264},{\"end\":70267,\"start\":70266}]", "bib_author_last_name": "[{\"end\":64145,\"start\":64140},{\"end\":64156,\"start\":64149},{\"end\":64337,\"start\":64329},{\"end\":64349,\"start\":64341},{\"end\":64361,\"start\":64355},{\"end\":64372,\"start\":64365},{\"end\":64382,\"start\":64376},{\"end\":64556,\"start\":64546},{\"end\":64591,\"start\":64583},{\"end\":64790,\"start\":64778},{\"end\":64823,\"start\":64817},{\"end\":65004,\"start\":65001},{\"end\":65015,\"start\":65008},{\"end\":65200,\"start\":65197},{\"end\":65211,\"start\":65208},{\"end\":65322,\"start\":65316},{\"end\":65334,\"start\":65326},{\"end\":65344,\"start\":65340},{\"end\":65356,\"start\":65348},{\"end\":65366,\"start\":65360},{\"end\":65612,\"start\":65605},{\"end\":65715,\"start\":65709},{\"end\":65727,\"start\":65719},{\"end\":65740,\"start\":65731},{\"end\":65749,\"start\":65744},{\"end\":65957,\"start\":65952},{\"end\":65968,\"start\":65965},{\"end\":65987,\"start\":65974},{\"end\":66172,\"start\":66167},{\"end\":66181,\"start\":66178},{\"end\":66301,\"start\":66298},{\"end\":66310,\"start\":66305},{\"end\":66319,\"start\":66314},{\"end\":66652,\"start\":66649},{\"end\":66661,\"start\":66658},{\"end\":66838,\"start\":66826},{\"end\":66856,\"start\":66844},{\"end\":67093,\"start\":67085},{\"end\":67104,\"start\":67099},{\"end\":67253,\"start\":67244},{\"end\":67267,\"start\":67259},{\"end\":67278,\"start\":67273},{\"end\":67784,\"start\":67779},{\"end\":67958,\"start\":67953},{\"end\":67968,\"start\":67962},{\"end\":67981,\"start\":67974},{\"end\":67994,\"start\":67987},{\"end\":68174,\"start\":68168},{\"end\":68183,\"start\":68180},{\"end\":68195,\"start\":68189},{\"end\":68410,\"start\":68402},{\"end\":68420,\"start\":68414},{\"end\":68433,\"start\":68424},{\"end\":68583,\"start\":68580},{\"end\":68815,\"start\":68810},{\"end\":68826,\"start\":68821},{\"end\":68836,\"start\":68832},{\"end\":68990,\"start\":68983},{\"end\":69005,\"start\":68998},{\"end\":69016,\"start\":69011},{\"end\":69179,\"start\":69172},{\"end\":69193,\"start\":69185},{\"end\":69209,\"start\":69199},{\"end\":69360,\"start\":69352},{\"end\":69756,\"start\":69747},{\"end\":69765,\"start\":69760},{\"end\":69997,\"start\":69990},{\"end\":70009,\"start\":70003},{\"end\":70020,\"start\":70013},{\"end\":70030,\"start\":70024},{\"end\":70238,\"start\":70234},{\"end\":70251,\"start\":70244},{\"end\":70262,\"start\":70259},{\"end\":70275,\"start\":70268}]", "bib_entry": "[{\"attributes\":{\"id\":\"b0\"},\"end\":64323,\"start\":64136},{\"attributes\":{\"id\":\"b1\"},\"end\":64538,\"start\":64325},{\"attributes\":{\"id\":\"b2\"},\"end\":64770,\"start\":64540},{\"attributes\":{\"id\":\"b3\"},\"end\":64995,\"start\":64772},{\"attributes\":{\"id\":\"b4\"},\"end\":65191,\"start\":64997},{\"attributes\":{\"id\":\"b5\"},\"end\":65310,\"start\":65193},{\"attributes\":{\"id\":\"b6\"},\"end\":65599,\"start\":65312},{\"attributes\":{\"id\":\"b7\"},\"end\":65703,\"start\":65601},{\"attributes\":{\"id\":\"b8\"},\"end\":65944,\"start\":65705},{\"attributes\":{\"id\":\"b9\"},\"end\":66159,\"start\":65946},{\"attributes\":{\"id\":\"b10\"},\"end\":66294,\"start\":66161},{\"attributes\":{\"id\":\"b11\"},\"end\":66645,\"start\":66296},{\"attributes\":{\"id\":\"b12\"},\"end\":66818,\"start\":66647},{\"attributes\":{\"id\":\"b13\"},\"end\":67007,\"start\":66820},{\"attributes\":{\"id\":\"b14\"},\"end\":67240,\"start\":67009},{\"attributes\":{\"id\":\"b15\"},\"end\":67773,\"start\":67242},{\"attributes\":{\"id\":\"b16\"},\"end\":67947,\"start\":67775},{\"attributes\":{\"id\":\"b17\"},\"end\":68160,\"start\":67949},{\"attributes\":{\"id\":\"b18\"},\"end\":68396,\"start\":68162},{\"attributes\":{\"id\":\"b19\"},\"end\":68570,\"start\":68398},{\"attributes\":{\"id\":\"b20\"},\"end\":68709,\"start\":68572},{\"attributes\":{\"id\":\"b21\"},\"end\":68802,\"start\":68711},{\"attributes\":{\"id\":\"b22\"},\"end\":68973,\"start\":68804},{\"attributes\":{\"id\":\"b23\"},\"end\":69164,\"start\":68975},{\"attributes\":{\"id\":\"b24\"},\"end\":69348,\"start\":69166},{\"attributes\":{\"id\":\"b25\"},\"end\":69569,\"start\":69350},{\"attributes\":{\"id\":\"b26\"},\"end\":69739,\"start\":69571},{\"attributes\":{\"id\":\"b27\"},\"end\":69982,\"start\":69741},{\"attributes\":{\"id\":\"b28\"},\"end\":70224,\"start\":69984},{\"attributes\":{\"id\":\"b29\"},\"end\":70464,\"start\":70226}]", "bib_title": null, "bib_author": "[{\"end\":64147,\"start\":64138},{\"end\":64158,\"start\":64147},{\"end\":64339,\"start\":64327},{\"end\":64351,\"start\":64339},{\"end\":64363,\"start\":64351},{\"end\":64374,\"start\":64363},{\"end\":64384,\"start\":64374},{\"end\":64579,\"start\":64542},{\"end\":64614,\"start\":64579},{\"end\":64813,\"start\":64774},{\"end\":64846,\"start\":64813},{\"end\":65006,\"start\":64999},{\"end\":65017,\"start\":65006},{\"end\":65202,\"start\":65195},{\"end\":65213,\"start\":65202},{\"end\":65324,\"start\":65314},{\"end\":65336,\"start\":65324},{\"end\":65346,\"start\":65336},{\"end\":65358,\"start\":65346},{\"end\":65368,\"start\":65358},{\"end\":65614,\"start\":65603},{\"end\":65717,\"start\":65707},{\"end\":65729,\"start\":65717},{\"end\":65742,\"start\":65729},{\"end\":65751,\"start\":65742},{\"end\":65959,\"start\":65948},{\"end\":65970,\"start\":65959},{\"end\":65989,\"start\":65970},{\"end\":66174,\"start\":66163},{\"end\":66183,\"start\":66174},{\"end\":66303,\"start\":66296},{\"end\":66312,\"start\":66303},{\"end\":66321,\"start\":66312},{\"end\":66654,\"start\":66647},{\"end\":66663,\"start\":66654},{\"end\":66840,\"start\":66822},{\"end\":66858,\"start\":66840},{\"end\":67095,\"start\":67081},{\"end\":67106,\"start\":67095},{\"end\":67255,\"start\":67242},{\"end\":67269,\"start\":67255},{\"end\":67280,\"start\":67269},{\"end\":67786,\"start\":67777},{\"end\":67960,\"start\":67951},{\"end\":67970,\"start\":67960},{\"end\":67983,\"start\":67970},{\"end\":67996,\"start\":67983},{\"end\":68176,\"start\":68164},{\"end\":68185,\"start\":68176},{\"end\":68197,\"start\":68185},{\"end\":68412,\"start\":68400},{\"end\":68422,\"start\":68412},{\"end\":68435,\"start\":68422},{\"end\":68585,\"start\":68574},{\"end\":68817,\"start\":68806},{\"end\":68828,\"start\":68817},{\"end\":68838,\"start\":68828},{\"end\":68992,\"start\":68977},{\"end\":69007,\"start\":68992},{\"end\":69018,\"start\":69007},{\"end\":69181,\"start\":69168},{\"end\":69195,\"start\":69181},{\"end\":69211,\"start\":69195},{\"end\":69362,\"start\":69350},{\"end\":69758,\"start\":69743},{\"end\":69767,\"start\":69758},{\"end\":69999,\"start\":69986},{\"end\":70011,\"start\":69999},{\"end\":70022,\"start\":70011},{\"end\":70032,\"start\":70022},{\"end\":70240,\"start\":70228},{\"end\":70253,\"start\":70240},{\"end\":70264,\"start\":70253},{\"end\":70277,\"start\":70264}]", "bib_venue": "[{\"end\":64220,\"start\":64158},{\"end\":64412,\"start\":64408},{\"end\":64644,\"start\":64641},{\"end\":64872,\"start\":64870},{\"end\":65080,\"start\":65049},{\"end\":65237,\"start\":65213},{\"end\":65384,\"start\":65368},{\"end\":65813,\"start\":65751},{\"end\":66036,\"start\":65989},{\"end\":66215,\"start\":66183},{\"end\":66435,\"start\":66321},{\"end\":66708,\"start\":66688},{\"end\":66898,\"start\":66858},{\"end\":67079,\"start\":67009},{\"end\":67372,\"start\":67297},{\"end\":67848,\"start\":67811},{\"end\":68035,\"start\":68010},{\"end\":68259,\"start\":68217},{\"end\":68464,\"start\":68460},{\"end\":68632,\"start\":68585},{\"end\":68745,\"start\":68713},{\"end\":68867,\"start\":68863},{\"end\":69047,\"start\":69043},{\"end\":69240,\"start\":69236},{\"end\":69413,\"start\":69362},{\"end\":69646,\"start\":69596},{\"end\":69844,\"start\":69797},{\"end\":70084,\"start\":70059},{\"end\":70323,\"start\":70295},{\"end\":66461,\"start\":66437},{\"end\":69418,\"start\":69415}]"}}}, "year": 2023, "month": 12, "day": 17}