{"id": 231827022, "updated": "2022-01-15 08:25:37.303", "metadata": {"title": "Tropical Cyclone Intensity Classification and Estimation Using Infrared Satellite Images With Deep Learning", "authors": "[{\"middle\":[],\"last\":\"Zhang\",\"first\":\"Chang-Jiang\"},{\"middle\":[],\"last\":\"Wang\",\"first\":\"Xiao-Jie\"},{\"middle\":[],\"last\":\"Ma\",\"first\":\"Lei-Ming\"},{\"middle\":[],\"last\":\"Lu\",\"first\":\"Xiao-Qin\"}]", "venue": "IEEE Journal of Selected Topics in Applied Earth Observations and Remote Sensing", "journal": "IEEE Journal of Selected Topics in Applied Earth Observations and Remote Sensing", "publication_date": {"year": 2021, "month": null, "day": null}, "abstract": "A novel tropical cyclone (TC) intensity classification and estimation model (TCICENet) is proposed using infrared geostationary satellite images from the northwest Pacific Ocean basin in combination with a cascading deep convolutional neural network (CNN). The proposed model consists of two CNN network modules: a TC intensity classification (TCIC) module and a TC intensity estimation (TCIE) module. First, the TCIC module is utilized to divide TC intensity into three categories using infrared satellite images. Next, three TCIE models based on the CNN regression network that combine different intensity types of infrared satellite images with the TC best track data are presented. The three TCIE models consider classification error with the TCIC module in order to improve TCIE accuracy. A total of 1001 TCs from 1981–2019 were used to verify the proposed TCICENet model, with 844 TCs from 1981–2013 employed as training samples, 76 TCs from 2014–2016 used as validation samples, and 81 TCs from 2017–2019 used as testing samples. In order to reduce the computation burden of training the TCICENet model, various input image sizes were explored. An image size of 170 × 170 pixels achieved the best performance, with an overall root mean square error of 8.60 kt and a mean absolute error of 6.67 kt compared to the best track.", "fields_of_study": "[\"Computer Science\"]", "external_ids": {"arxiv": null, "mag": null, "acl": null, "pubmed": null, "pubmedcentral": null, "dblp": "journals/staeors/ZhangWML21", "doi": "10.1109/jstars.2021.3050767"}}, "content": {"source": {"pdf_hash": "1b490acfc1f7eb433bb00cd8a506602d606c89c7", "pdf_src": "IEEE", "pdf_uri": null, "oa_url_match": false, "oa_info": {"license": "CCBYNCND", "open_access_url": "https://ieeexplore.ieee.org/ielx7/4609443/9314330/09320562.pdf", "status": "GOLD"}}, "grobid": {"id": "fe143c06dae46dd9849aacc76736ac0ba6c46ff1", "type": "plain-text", "url": "s3://ai2-s2-pdf-extraction-prod/parse-results/s2orc_worker/1b490acfc1f7eb433bb00cd8a506602d606c89c7.txt", "contents": "\nTropical Cyclone Intensity Classification and Estimation Using Infrared Satellite Images With Deep Learning\n\n\nChang-Jiang Zhang \nXiao-Jie Wang \nLei-Ming Ma \nXiao-Qin Lu \nTropical Cyclone Intensity Classification and Estimation Using Infrared Satellite Images With Deep Learning\n\nIEEE JOURNAL OF SELECTED TOPICS IN APPLIED EARTH OBSERVATIONS AND REMOTE SENSING\n14202110.1109/JSTARS.2021.30507672070Index Terms-Deep convolutional neural network (CNN)intensity estimationintensity grade classificationtropical cyclone (TC)\nA novel tropical cyclone (TC) intensity classification and estimation model (TCICENet) is proposed using infrared geostationary satellite images from the northwest Pacific Ocean basin in combination with a cascading deep convolutional neural network (CNN). The proposed model consists of two CNN network modules: a TC intensity classification (TCIC) module and a TC intensity estimation (TCIE) module. First, the TCIC module is utilized to divide TC intensity into three categories using infrared satellite images. Next, three TCIE models based on the CNN regression network that combine different intensity types of infrared satellite images with the TC best track data are presented. The three TCIE models consider classification error with the TCIC module in order to improve TCIE accuracy. A total of 1001 TCs from 1981-2019 were used to verify the proposed TCICENet model, with 844 TCs from 1981-2013 employed as training samples, 76 TCs from 2014-2016 used as validation samples, and 81 TCs from 2017-2019 used as testing samples. In order to reduce the computation burden of training the TCICENet model, various input image sizes were explored. An image size of 170 × 170 pixels achieved the best performance, with an overall root mean square error of 8.60 kt and a mean absolute error of 6.67 kt compared to the best track. Index Terms-Deep convolutional neural network (CNN), intensity estimation, intensity grade classification, tropical cyclone (TC).\n\n(STS; 48-63 kt), strong typhoon (STY; 64-84 kt), very strong typhoon (VSTY; 85-104 kt), and violent typhoon (ViolentTY; ≥ 105 kt). In the 1940s, aircraft detection was first utilized as an effective means of monitoring the current position, intensity, and development status of TCs. However, aircraft detection primarily focuses on the Atlantic Ocean basin. In recent years, the development of various means of observation and numerical forecasting has improved storm track prediction, but improving intensity estimation has been very slow.\n\nCurrent TC intensity estimation primarily depends on microwave data from polar-orbiting [1]- [6] and geostationary satellite imagery. The microwave data are easily disturbed by harsh environments, such as heavy rainfall. Compared with polar-orbiting satellite data, the geostationary satellites are unable to obtain near-surface structure of TC but have a higher temporal resolution and the stable image quality, thus are currently more commonly used for TC intensity estimation. Dvorak proposed and developed methods [7]- [10] for TC intensity estimation using infrared satellite images, which rely upon the experience of the forecaster [11]. Although some improved Dvorak techniques [12], [13] reduce the subjective steps, most of them are not suitable for estimating the intensity of weak TCs [14]. Olander and Velden [15] further improved the Dvorak technique, creating a method known as the advanced Dvorak technique (ADT) version 9 to improve the intensity estimation for weak TCs. The deviation-angle variance technique (DAT) introduced by Pineros et al. [16] is a method that quantifies the axisymmetry of a TC from infrared satellite imagery in order to investigate structural and intensity changes of TCs [17]. The DAT and its improved versions produce good TC intensity estimation results [18], [19].\n\nResearchers have utilized traditional machine learning with infrared satellite images for TC intensity estimation. The multivariate linear regression models [14]- [20], the K-nearest neighbors algorithm [21], [22], the multilayer perceptron [23], support vector machine (SVM) [24], and relevance vector machine (RVM) [25]- [27] have been successfully used to estimate TC intensity. These methods mainly focus on the manual extraction of statistical features [1], [2], [14], [23], [25]- [27] or structural features [7]- [10], [12], [13], [15]- [17], [42] of TC. These characteristics are mainly as follows: the TC center, rain band features, brightness temperature gradient of cloud tops, statistics of radial cloud top brightness temperature, slope of TC inner-core cloud top, the deviation angle, spiral rain band fitting, and the symmetry of inner core. Furthermore, these features (usually <10) [36] are largely dependent on human subjectivity and experience, as well as prior information concerning satellite data. It is difficult for a meteorologist to determine whether one feature is suitable for the intensity regression of all of the various TCs in different basins and developing stages.\n\nThe convolutional neural network (CNN) of deep learning is very suitable for extracting the deep features (usually more than 1000) from an image using convolutional, pooling, and fully connected layers. It is unnecessary to extract the TC intensity indicating factors from infrared satellite images in advance for CNNs. Pradhan et al. [35], for example, used the CNN classification output vector to directly weight the average the intensity of the two highest possible categories in order to obtain the estimated TC intensity. This is straightforward, but it is easy to misclassify TCs. Recent studies [38]- [41] used CNN-based models to estimate the TC intensity as a regression task. The regression method is relatively simple and straightforward, but TCs exhibit rich and varied forms as well as a wide range of TC wind speed fluctuations, making it difficult for these single models to fully cover TC changes, especially when the TC samples of different intensities are not balanced. Existing TC intensity estimation models based on CNNs have only focused on basic and relatively simple deep learning network structures, such as AlexNet or VGGNet [34]- [41].\n\nUnlike the methods above, we propose a cascade-double CNN model for estimating TC intensity (TCICENet) from infrared geostationary satellite images. The infrared satellite images are adopted as the input of the TCICENet model. The TCI-CENet model consists of two modules: the TC intensity grade classification (TCIC) module and the TC intensity estimation (TCIE) module from three TC categories as a regression task. Compared with the method of directly weighting the average TC intensity of the two highest possible categories [35], TCIE takes the characteristics of the infrared satellite image into account again, which is more reliable because of rough classification and fine-tuning. TC intensity grade classifications are different from the conventional rigid targets (cars, animals, and etc.). TCs are not rigid bodies, and the structure of it will change greatly in different development stages with continuous rotation and translation. The characteristics of adjacent intensity categories of TC are quite similar, leading to a high probability of misclassification between adjacent intensity categories. Also, TC images with very different cloud structures may belong to the same intensity category. Conversely, cloud structure images that look similar may also belong to two different intensity categories, such as in the life cycle of the same TC. For these reasons, LeNet and other CNN networks with simple structure have difficulty achieving high-precision classification of TC intensity grade. A deeper and wider CNN network is required to extract more deep semantic information. The Inception module of GoogLeNet performs multiscale feature extraction on the input feature map. This model is wider, but the problem of gradient dispersion caused by network deepening still exists. ResNet learns the difference between the input and output of the network, which greatly alleviates performance degradation when the network is deeper. Inception-Resnet-v2 combined inception and residual structure, and achieved the best classification performance on the ImageNet dataset in 2016 [33]. Some deeper and broader CNN models have also been proposed recently, although no significant improvement in image classification has been obtained. Therefore, Inception-Resnet-v2 is suitable for the challenging task for the challenging task of TCIC.\n\nAfter obtaining more accurate classification results of a TCIC module, the TCIE module need not be as deep and wide as that of the TCIC module considering both the calculation cost and intensity estimation accuracy of the TCIE module. Now, simple CNN models mainly include LeNet [28], AlexNet [29], and VGGNet [30]. Compared with LeNet, AlexNet has deeper layers, and its activation function is Relu, which can accelerate the convergence speed of stochastic gradient descent and alleviate the problem of gradient dispersion. Finally, our TCIE model combines the lightweight characteristics of AlexNet and the advantages of the small convolution kernel of VGGNet to increase the nonlinear expression ability of the network model, which can meet the requirements of TC intensity estimation.\n\nOur contributions can be summarized as follows. 1) We propose a cascading CNN model to objectively estimate the TC intensity. 2) We improve Inception-ResNet-v2 using the channel and spatial attention modules to implement the challenging task of TC intensity grade classification. 3) We improve the AlexNet model and respectively build TC intensity estimation models for different categories of TCs. The misclassification ratio of the validation data of TCIC is used to guide the training of the TCIE module.\n\n\nII. TCICENET MODEL\n\n\nA. Overall Model Architecture\n\nThe TCICENet model is used to implement the TC-image-tocategory-to-intensity estimation task. The TCICENet evolved from an improvement of the Inception-ResNet-v2 [33] and AlexNet [29] and is well suited to learning features of TC representation and distinguishing different TC categories from satellite images. The framework of the proposed TCICENet model architecture is shown in Fig. 1. The TCICENet consists of two modules: TC intensity classification (TCIC) and TC intensity estimation (TCIE). First, infrared satellite images are divided into three categories (category1, category2, and cate-gory3) using the TCIC module, where category1 is comprised of TS+STS, category2 consists of STY, and category3 comprises VSTY+ViolentTY. Second, three TC intensity estimation models corresponding to the three different TC intensity categories are respectively built using the TCIE module.\n\n\nB. TCIC Module Architecture\n\nExisting TC intensity estimation models rarely consider the intensity grade classification before intensity estimation, although some researchers have recently divided the TC intensity grades into many categories using CNNs [34], [35]. Due to the high misclassification probability when directly dividing TC intensity grades into too many categories, the accuracy of the intensity estimation is bound to be affected. We classified the TC intensity grades into three categories (TS+STS, STY, and VSTY+ViolentTY) in order to improve the classification accuracy. The Inception-ResNet-v2 was adopted as the basic network of the TCIC module, which is a very deep and wide CNN that has been successfully applied to different image feature extraction tasks. In addition, the convolutional block attention module (CBAM) [43] was integrated into the network structure of the Inception-ResNet-v2. The CBAM includes the channel attention module and the spatial attention module in order to make the network focus on the important features of the TC categories and suppress the unnecessary ones. The flowchart of the TCIC internal network architecture is presented in Fig. 2.\n\nFirst, the infrared satellite image is input through the Stem module to initially extract the low-level features, and the output size is 18 × 18 × 384 pixels. Next, five linearly stacked Inception-ResNet-A+CBAM modules are used to extract richer features, and then the Reduction-A module is used to reduce the feature map size and increase the number of channels so that the output size is 8 × 8 × 1152 pixels. After ten linearly stacked Inception-ResNet-B+CBAM modules, the model further extracts richer features and semantic features. The Reduction-B module then continues to reduce the size of the feature map, while increasing the number of channels to improve the model performance so that the output size is 3 × 3 × 2144 pixels. After five linearly stacked Inception-ResNet-C+CBAM modules, feature extraction is complete. Average pooling is used to convert the feature map into a one-dimensional vector. A dropout layer is used to prevent overfitting, followed by a fully connected layer. Finally, softmax outputs a one-dimensional vector with a size  of three, which represents the possibility of each category. The category with the highest possibility is the final TC category.\n\n\nC. TCIE Module Architecture\n\nThe TCIE module is based on AlexNet. Fig. 3 presents the schematic diagram of the TCIE network structure. The network structure parameters of the TCIE module are listed in Table I. The network consists of six convolutional layers, two pooling layers, and three fully connected layers. We discarded the large 11 × 11 convolutional layer in AlexNet layer 1 since large filters tend to increase computation time and will lose too many details in infrared (IR) images. The convolutional layer with a convolution kernel size of 5 × 5 in the second layer of AlexNet is directly used as the convolutional layer of the first layer of the TCIE, which is used to extract low-level features (contours and textures) from the input satellite image. We use a convolution kernel size of 3 × 3 from the second layer to the sixth layer. After the first pooling layer, three consecutive convolutional layers are used to extract the features of the satellite image, due to the complex relationship between satellite image information and TC intensity. After the pooling layer, two more successive Terms-Shape: Size of the convolutional filter; Activation: Nonlinear \"signal gate\" processing method following the layer process; Leaky ReLU: \"Leaky rectified linear unit\" (a type of activation function that prevents neuron saturation in deep networks); Output size: Row×column size of the product of convolution/pooling/fully connected layer. b Terms-s: Stride (Spacing of the convolutional/pooling filter application); p: Padding (Padding pixel to the edge of the input feature map) convolutional layers are added in the TCIE. The first and fourth convolutional layers are connected with the pooling layers, with the goal of cutting down the size of the input image. The last convolutional layer has no pooling layer. We also use max pooling [29] to reduce the number of features by only keeping the maximum value of features in a sliding window. After max pooling the layers, the features are reduced sharply. \"Leaky ReLU\" [44] activation is used for nonlinearity, which is a fairly rapid and streamlined activation function.\n\nCompared to AlexNet, our model has the following differences. The TCIE model discards the large 11 × 11 convolutional layer in the first layer and adds the last two consecutive convolutional layers Conv5 and Conv6. The number of channels in Conv1 is 8, that in Conv2-Conv4 is 32, and that in Conv5 and Conv6 is 64. The numbers of neurons in the full connection layers are 512, 16, and 1, respectively.\n\n\nD. Loss Function\n\nThe cross-entropy is used as the loss function of the TCIC, as shown in the following equation:\nH y (y) = − i y i log (y i )(1)\nwhere y i is the actual tag value and y i is the predict label value of the output. The L 2 regularization term Ω is added to the loss function, as shown in the following equation:\nΩ = α ω 2 2 (2)\nwhere ω is the total weight of the network model and α is the weighted decay.\n\nThe weight decay of the regularization term Ω is expressed as α, and has a value of 0.0005. By reducing the numerical value of the weight, the complexity of the model is reduced and overfitting is prevented. The total loss function is expressed as follows:\nL = H y (y) + Ω.(3)\nThe loss function of the TCIE training process is smooth L1 loss [45] \nsmooth L 1 (x) = 0.5x 2 , if |x| < 1 |x| − 0.5, otherwise .(4)\nL 2 loss converges faster and has a derivative at 0 to facilitate convergence. L 1 loss makes the network more robust to outliers. Smooth L1 loss combines the advantages of both L 1 loss and L 2 loss.\n\n\nIII. DATA\n\nThe data of 1001 TCs from 1981 to 2019, comprising five categories-TS, STS, STY, VSTY, and ViolentTY-were obtained from the National Institute of Informatics of Japan (http://agora.ex.nii.ac.jp/digital-typhoon/year/wnp/), and were then used to verify the performance of the proposed model. The infrared satellite images used in this study derive from the GMS1-5, GEO 9, MTSAT-1R, MTSAT-2, and Himawari 8 satellites in the northwest Pacific Ocean basin. The wavelength of the images is 10.2-12.5 μm. A total of 19 451 satellite images of 844 TCs from 1981 to 2013 were selected to train the proposed TCICENet model, 1907 images of 76 TCs from 2014 to 2016 were selected for validation, and 1794 images of 81 TCs from 2017 to 2019 were selected for testing. Please refer to http://www.jmanet.go.jp/sat/himawari/enkaku.html#nheader for more information pertaining to our data. Since the deep learning training process requires a large dataset of balanced types, the existing data did not meet the requirements of the training samples. Therefore, the original 19 451 infrared satellite images were expanded by rotation and were provided with additional noise. Fig. 4 shows an example of the sample expansion. The  Table II.\n\nIn this investigation, we also explored the direct classification of the five TC intensity grades. The original STY data were expanded from 5036 to 6043 images after being rotated 90°i n order to balance the data proportions among the five TC categories, as listed in Expanding_5 of Table II.\n\nFurthermore, all of the imagery, including duplicate imagery, was varied by rotating and adding noise, as delineated in Table II. This approach is necessary for the model to assign equal importance to all of the TC intensities during training, and is common practice in CNN training in order to prevent the model from inherently increasing its skill with the greater sampled image types at the expense of the lesser sampled image types. The testing dataset did not need to be balanced in this way.\n\nAs previously mentioned, the TCICENet model proposed in this study contains two modules: the TC intensity classification module (TCIC) and the TC intensity estimation module (TCIE). For the TCIC module, we divided the TC intensity level into three categories according to the input infrared satellite images: TS+STS, STY, and VSTY+ViolentTY. We then attempted to balance the proportions of each of the three types of typhoon data. Therefore, in the TCIC module experiment, the TS and STS data were directly combined, so that the number of TS+STS sample images was 11574. The original STY data were expanded from 5036 to 10 072 after being rotated 90°. The VSTY data were expanded from 2498 samples to 7494 by rotating 90°and 180°. After the ViolentTY data were rotated by 90°, 180°, and 270°, Gaussian noise and salt-and-pepper noise were added to the rotated ViolentTY data to expand the original 343 samples to 4116. The data before and after the expansion are listed in Table III. After the above expansion, the proportions of the expanded sample data of the three categories were basically balanced, as shown in Table III.\n\nFor the intensity estimation stage (i.e., the TCIE module), our training data are still the data after the classification expansion. In the TCIE module, three intensity estimation models are established for TS+STS, STY, and VSTY+ViolentTY, designated TCIE_Model_1, TCIE_Model_2, and TCIE_Model_3, respectively. In order to enhance the diversity of the training samples in the TS+STS category and improve the robustness of its intensity estimation performance, we expanded the training samples from the original 11 574 to 23 148 by rotating them 90°. The training samples of the three categories without considering the misclassification percent of the TCIC are listed in Table IV by no wrong proportion (NWP), and comprise 23 148, 10 072, and 11 610 images, respectively. Since the training samples of the STY and VSTY+ViolentTY intensity levels were already expanded in the TCIC module, their training samples were not expanded in the TCIE module.\n\nIn addition, in order to improve the accuracy of the TCIE intensity estimation, we considered the percent of intensity level misclassification in the three categories of the TCIC validation set in the TCIE module. Finally, the three training datasets of the intensity estimation model were expanded. In total, 3443 samples were selected from the original STY training samples in order of wind speed from low to high, along with 101 samples from the original VSTY+ViolentTY training samples in order of wind speed from low to high to join the training set of the intensity estimation model TCIE_Model_1. From the original TS+STS training samples, 3046 samples were selected in order of wind speed from high to low, and from the original VSTY+ViolentTY training samples, 2977 samples were selected in order of wind speed from low to high to join the training set of TCIE_Model_2.  IV  NUMBER OF TRAINING, VALIDATION, AND TEST SAMPLES FOR THE THREE TCIE MODELS From the original TS+STS training samples, 69 samples were selected in order of wind speed from high to low, and from the original STY training samples, 1374 samples were selected in the order of wind speed from high to low to join the training set of TCIE_Model_3. When adding the wrong-proportion samples, if the raw samples were insufficient (mainly VSTY+ViolentTY), the selection was continued in the same way to expand the dataset. The training data (WP) for the three intensity estimation models in the TCICENet model were expanded to 26 692, 16 095, and 13 053 sample images, respectively (listed in Table IV). In Table IV, NWP indicates that the wrong-proportion samples were not added, whereas WP indicates that the wrong-proportion samples were added.\n\n\nIV. EXPERIMENTAL RESULTS AND ANALYSIS\n\nAll of the models were trained using the TensorFlow framework (in Python 3.6), running on an NVIDIA 2080 Ti. The TCICENet model contains two modules: the TCIC and the TCIE. The experiment was divided into two stages: the training stage and the testing stage. Each stage employed the same data preprocessing method. In the data preprocessing stage, the mean value and the normalized satellite image data ranged from [-1,1] in order to improve the training speed and accuracy. Both the TCIC and TCIE were trained from scratch. The batch size of the TCIC training was 8, we used the Adadelta Optimizer (Zeiler) [46], the learning rate was 0.1, and the learning rate was reduced 0.1 times every 50 epochs. The batch size of the TCIE training was 64, we used the Adam optimizer [47] with the default parameters in the experiment, and the learning rate was 0.001.\n\n\nA. Effect of Input Image Size on TCIC and TCIE Performance\n\nWe designed a two-stage experiment to investigate the effect of input image size on TC intensity classification and TC intensity estimation. In both stages, we compared the precision input images of seven sizes, including the 256 × 256 pixel input images cropped from the original satellite images, which were then reduced in size to between 230 × 230 and 80 × 80. The impacts of scaling the image size on the performance of the TCIC and TCIE modules are presented in Fig. 5.\n\nThe  \n\n\nB. TC Intensity Grade Classification\n\nAs mentioned above, the existing TC intensity classification models based on deep learning are divided into multiple categories based on the TC intensity grade classification standard. According to the JMA's TC intensity classification standard, TC intensity grade is divided into a total of six categories. In this study, we only focused on TC intensity estimation for systems with an intensity level of TS and above, i.e., TC intensity estimation with five intensity levels. In order to explain the reason for our three-category classification, we designed direct five-category classification and three-category classification experiments in the TCIC module. We used the Expanding_5 training, validation, and test data presented in Table II to verify the performance of the TCIC module. Precision (P), recall (R, probability of detection), and F1-score (F1) were utilized to evaluate the performance of our model.\n\nAfter the iteration of 35 epochs for the TCIC module, the validation data loss reached its minimum and the accuracy levels of the five classifications reached their maximum. Table V lists the results of the five classifications. For these classifications, the average precision, recall, and F1-score ranged from approximately  V  PRECISION, RECALL, AND F1-SCORE FOR THE FIVE TC CATEGORIES, AND THE  TOTAL NUMBER OF SAMPLE TEST TC IMAGES FOR THE TCIC MODULE 0.60 to 0.62. Thus, if the five classification results were directly applied to the subsequent classification intensity estimation, this would lead to a large intensity estimation error. Fig. 6(a) is the confusion matrix of the five classifications for the test samples. The recall levels from weak to strong intensity of the five TC categories were 0.81, 0.42, 0.58, 0.54, and 0.75, respectively. As can be seen from Fig. 6(a), TCs of all five intensity levels were misclassified. Misclassification to an adjacent intensity level was the most likely occurrence. Therefore, we combined TS and STS into one category. Although the misclassification ratio between STY and VSTY was also high, VSTY and ViolentTY also tended to be misclassified for one another. Considering that the number of ViolentTY samples is small, VSTY and ViolentTY were combined into one category, and STY was taken as a separate category. Hence, we divided the TC intensity levels into three categories: TS+STS, STY, and VSTY+ViolentTY. We used the training, validation, and test data in Table III to verify the performance of the TCIC module for the three classifications of TC intensity grades. The iterative curves for recognition rate and loss function are presented in Fig. 7. As shown in Fig. 7(a) and (b), the total loss function value of the training set gradually decreased with the increasing number of epochs, stabilizing after 80 epochs. The accuracy of the training set gradually increased with the increasing number of epochs, increasing rapidly during the early stage with high accuracy, which is related to the fact that our TCIC module is good at extracting complex features from infrared images. After 50 epochs, the classification accuracy of the TCIC module had basically stabilized. As can be seen from Fig. 7(c) and (d), the loss function value of the validation set initially exhibited a decreasing trend and then rose slowly after 50 epochs due to overfitting. In the 31st epoch, the loss of validation data reached its minimum and the classification accuracy reached its maximum, which are denoted by red dots in Fig. 7(c) and (d). We saved the model of the 31st epoch, and the validation results of this epoch were then employed to guide the subsequent three TCIE models in order to produce the proper training samples according to the misclassification percentages among the three intensity categories.\n\nWe used the test samples listed in Table III to analyze the classification performance of the trained TCIC module. The average accuracy of the three classifications for the test set was  TABLE VI  PRECISION, RECALL, AND F1-SCORE FOR THE THREE TC CATEGORIES, AND  THE TOTAL NUMBER OF SAMPLE TEST TC IMAGES FOR THE TCIC MODULE 80.49%, which was a substantial improvement over the accuracy of the previously derived direct division into five categories.\n\nIt can be seen from Table VI that the classification indices of the TS+STS category were the highest, followed by the VSTY+ViolentTY category. The precision, recall, and F1-score of the STY category were significantly lower, indicating that it had more classification errors. The average precision, recall, and F1-score ranged from approximately 0.74 to 0.77. Fig. 7(a) and (b) reveal that the misclassifications of the TCIC module for the three classifications of TC intensity grades were smaller. Therefore, in this study, we divided the TC intensity grades into three categories based on infrared satellite images.\n\n\nC. TC Intensity Estimation\n\nIn order to illustrate the advantages and performance of the proposed TCICENet model, three other models were explored: the TCIDENet, TCICENet-NWPS, and TCICENet-S. The TCIDENet is a method of direct intensity estimation by the TCIE module without classification. The TCICENet-NWPS uses the TCIC module for classification, in which the TCIE module for intensity estimation does not include the misclassified proportion of the TCIC module. The TCICENet-S represents the TCICENet model whose intensity estimation results are smoothed with the results of adjacent satellite images prior to the current time. Among these models, the training data of the TCI-DENet and TCICENet-NWPS consisted of the data in Table IV without the addition of the misclassification samples, whereas the training data of TCICENet and TCICENet-S consisted the data in Table IV with the misclassification samples added. In order to verify the performances of the different models, the RMSE, MAE, bias (the difference between the best-track data and the estimated intensity), and absolute error were employed as evaluation indicators on the test dataset. RMSE, MAE, and absolute error measure the differences between two variables, whereas bias indicates the absolute degree of overestimation and underestimation of each variable.\n\n\n1) TCIDENet:\n\nAll three TC intensity categories were combined to create an intensity estimation model known as the TC direct intensity estimation model (TCIDENet). The intensity estimation error of the STY category was the largest, with an MAE of 10.2 kt and an RMSE of 12.6 kt. The intensity estimations of the other four categories were not appreciably different. The TCIDENet achieved an overall MAE of 7.89 kt and an RMSE of 10.25 kt, exhibiting an intensity estimation accuracy similar to that of the models in Chen et al. [36] and Zhang et al. [26].\n\n2) TCICENet-NWPS: The STY category was the largest, with an MAE of 11.42 kt and an RMSE of 14.15 kt. The TCICENet-NWPS achieved an overall MAE of 7.85 kt and an RMSE of 10.18 kt. The MAE and RMSE values of TS, STS, and ViolentTY for the TCICENet-NWPS were less than those of the TCIDENet, although the TCIDENet was better at estimating STY and VSTY.\n\n3) TCICENet: In this study, we separately built three TC intensity estimation models to correspond to the three TC intensity categories, referred to as the separate models of the TCICENet. Fig. 8 shows the loss function curves of the training and validation data of the three intensity estimation models, revealing that the loss of the training set gradually converged. The validation set loss of the three TCIE models reached its minimum value at 19, 82, and 71 epochs, respectively. The TC intensity estimation results of the proposed TCICENet are listed in Table VII.\n\nCompared with the TCIDENet and TCICENet-NWPS, the final TC intensity estimation performance of the TCICENet achieved an MAE of 7.45 kt and an RMSE of 9.59 kt, due to the addition of misclassification samples during the training of the three intensity estimation models. With the exception of no obvious improvement to STS, the intensity estimation accuracy of all the other four categories improved.\n\n\n4) TCICENet-S:\n\nIn order to reduce the influence of model time evolution and TC intensity noise over time, we used the weighted average of the estimated TC intensity values of the TCICENet at the current time and the previous two times as the TCICENet-S intensity estimation at the current time. Since the data used in our model were not interpolated, the previous two times were the previous 6 h and the previous 12 h. This smoothing scheme is similar or equivalent to those of some existing TC intensity estimation models [12]- [21]. In this study, the TC intensity estimation at time t was smoothed by the following formula:\np (x t ) = 0.49f (x t ) + 0.29f (x t−1 ) + 0.22 f (x t−2 ) . (5)\n\n5) Comparison of the Four Models:\n\nIn order to facilitate the comparison of the performances of the above four models, the structure and intensity estimation evaluation indices of the models are listed in Table VIII. It can be seen from this table that the intensity estimation capabilities of the TCIDENet and TCICENet-NWPS models were basically the same. This indicates that the effect of direct TCIE intensity estimation after TCIC classification is not significantly improved compared with the direct TCIE module. The TCIDENet model is also the current model used for most TC intensity estimation based on deep   learning [36], [38], [41]. Compared with the TCIDENet and TCICENet-NWPS, the TCICENet exhibited the best intensity estimation performance, indicating that the misclassification percent of TC intensity classification can be effectively used to improve the intensity estimation performance. As mentioned above, utilizing three categories of TCs will produce different degrees of misclassification. This phenomenon is particularly obvious for the STY category, because this category is very similar in terms of cloud structure and inner core features, such as spiral rain bands, appearing on satellite images during certain development stages of the TS+STS and VSTY+ViolentTY categories. Compared with the VSTY+ViolentTY category, the possibility of misclassifying the STY category as the TS+STS category is high. The probability of the TS category being misclassified as VSTY+ViolentTY is very small because the TS+STS and VSTY+ViolentTY categories differ greatly in intensity level, cloud pattern, and inner core characteristics. The same is true for the VSTY+ViolentTY category. After classification, the TCICENet takes into account the misclassification of the intensity classification, expands the training samples of the TCIE model according to the misclassification percent, and reduces the subsequent intensity estimation error caused by the classification error to a certain extent. Therefore, the comprehensive performance of the TCICENet intensity estimation is better than the performances of the TCIDENet and TCICENet-NWPS models.\n\nThe TC is a dynamic system, exhibiting continuous development and change over time. The current intensity of a TC is not only closely related to the cloud pattern and inner core characteristics it displays in the most recent satellite image, but is also related to the development and change of the cloud and inner core characteristics of the previous several temporally adjacent satellite images, a relationship that is not considered in the first three models. Therefore, the performance of the  Fig. 9(a) shows the scatter plot of the best track intensities versus the estimated intensities. The red straight line is a linear fitting line of the estimated intensities versus the best track intensities. The linear fitting equation can be expressed as y = 1.0164x−1.0839. Its correlation coefficient (CC) is 0.891. The estimated intensities ranged from 30.11 to 113.15 kt. Fig. 9(b) shows the bias curve of the test samples. Based on Fig. 9(b), the difference between overestimation and underestimation was not very obvious. The average bias of the test samples was 0.13 kt. Fig. 9(c) represents the probability distribution curve of the absolute error. The percentages of absolute error between the best track intensity and the estimated intensity less than 3, 5, 10, and 15 kt were 27%, 43%, 73%, and 89%, respectively.\n\n\nV. ANALYSIS AND DISCUSSION\n\n\nA. Analysis of Error Distribution\n\n\nB. Intensity Estimation for Different TC Categories\n\nThe box plot of the bias in each TC category is presented in Fig. 10(a). The green line represents the position of the median, the black lines at both ends represent the upper and lower limits of the deviation, and the blue boxes represent the first and third quartiles of the deviation. Consistent with the MAE of each TC category, the TS category exhibited the lowest MAE, with a median of 4.82 kt (except for outliers; the same below). The lower and upper limits of the TS category bias were −8.08 and 18.57 kt, respectively. The maximum absolute error in the TS category was 39.  The violin plot of the bias of each TC category is shown in Fig. 10(b). The violin plot can help us to understand the predicted bias distribution more intuitively. The deviations of TS and ViolentTY were concentrated, with the TS deviation concentrated between 0-10 kt, and the ViolentTY deviation concentrated from 0 to -15 kt. The STS and VSTY deviations were relatively dispersed, generally ranging from -20 to 10 kt. STY was the most dispersed, with most of deviations ranging from -20 to 10 kt.\n\nThe TC intensity estimation results of the TCICENet, TCICENet-S, and the best track intensities for the 81 TCs from 2017 to 2019 are presented in Fig. 11. TCs in 2017 were estimated by the TCICENet with an MAE of 6.86 kt, an RMSE of 8.77 kt, and a bias of 0.95 kt. TCs in 2018 were estimated by the TCICENet with an MAE of 7.62 kt, an RMSE of 9.73 kt, and a bias of 0.07 kt. TCs in 2019 were estimated by the TCICENet with an MAE of 7.63 kt, an RMSE of 9.89 kt, and a bias of 0.16 kt. Overall, we can see that the intensity curves estimated by the TCICENet and TCICENet-S were basically consistent with the intensity of JMA's best track data, and the intensity estimation results of the TCICENet-S were superior to those of the TCICENet. The satellite image of the TS category was overestimated and the ViolentTY category was clearly underestimated. The estimated bias was not large, so the estimated MAE of these two categories was small. For the satellite images of STS, STY, and VSTY, the bias distributions of the intensity estimation ranges were larger, and the overestimation and underestimation were almost balanced. The TCICENet-S estimated results were slightly lower than those of the TCICENet during the TC formation stage, i.e., the stage in which the TC intensity is increasing, whereas the TCICENet-S results were slightly higher than those of the TCICENet during the TC dissipation stage. This is because the TCICENet-S estimation results are those of the smoothed TCICENet using the previous two adjacent intensities.\n\n\nC. Comparison to Other Satellite Estimation Methods\n\nIn order to verify the performance of our model, it was compared with the existing TC intensity estimation models listed in Table IX. Using our IR satellite image dataset, the performance between our model and nine other models-the ETCI [22], DAVT [18], PHURIE-SVR [24], MLR [20], RVM+DADI [27], RVM+DAGCOM [26], DeepCNN [35], VGG19 [41], and Deep-PHURIE [38]-was compared.\n\nIt can be seen from Table IX that the intensity estimation results based on deep learning were generally better than the results of traditional machine learning, such as ETCI [22], DAVT [18], PHURIE-SVR [24], MLR [20], RVM+DADI [27], and RVM+DAGCOM [26]. Most TC intensity estimation models based on traditional machine learning mainly focus on extracting some statistical features from infrared satellite images, such as infrared brightness temperature gradient, deviation angle variance, or probability density of mean deviation angle (P_MDA). Although linear regression, support vector regression (SVR), and RVM exhibited good performance in TC intensity estimation, compared with the CNN models, the performance of these models still have a large amount of room for improvement. Some CNN models have been applied to TC intensity estimation. For example, a CNN-based hurricane intensity estimation network known as Deep-PHURIE [38] from IR satellite imagery can reduce the dependence on the artificial labeling of the TC center. The estimated intensity can be directly determined as the weighted average of the two highest possible categories with respect to their probabilities, a method known as the DeepCNN model [35]. In contrast, we can obtain more accurate results using our three TCIE models.\n\nOur TC intensity model only uses infrared satellite images as the input data of the model. The datasets of the other nine models in Table IX mainly focus on microwave datasets [4], [5], [40] or combinations of various datasets (e.g., infrared, water vapor, and microwave data) [6], [15], [34], [36], [39], [48]. For example, the Hong WS algorithm used a combination of satellite-observed microwave data to estimate TC intensity [4]. The PMW-IE combined model employed both Tropical Rainfall Measuring Mission Microwave Imager (TMI) 85-GHz brightness temperatures and near-surface rain-rate retrievals to estimate TC intensity [5]. The MLR-TB-SS model used both sea surface wind speed and SSMIS microwave radiometer data to estimate TC intensity [6]. The CNN-TC model used both infrared and microwave images to estimate TC intensity [36]. The TCIENet model [34] and WIRa-based model [39] used both the water vapor channel and infrared satellite images for TC estimation.\n\nDvorak is the most mature TC intensity estimation technique in the world. Olander and Velden [15] further improved the ADT in combination with aircraft observation data, microwave data, and multispectral satellite images, an approach that is known as the ADT version 9. This method is used to analyze many typhoon-intensive regions in the world. Our model is only for the northwest Pacific Ocean basin, and the results are slightly better. The state-of-the-art objective method from several different satellite sources is known as Satellite Consensus (SATCON), which is used operationally at TC analysis centers worldwide (Herndon and Velden [48]). Wimmers et al. [40] used a CNN model known as \"DeepMicroNet\" to explore the possibilities of estimating TC intensity from satellite imagery of the 37 and 85-92 GHz bands. The uncertainty of TC best track information is considered when making TC classifications and calculating classification losses. Microwave images are often obscured and not very clear, so our method based on infrared satellite images can be used as a supplement to this method.\n\nStrictly speaking, it is not fair to directly compare our model with these nine models [4]- [6], [15], [34], [36], [39], [40], [48], due to the use of different datasets. However, in order to illustrate the performance and advantages of our model, we still listed the performance indices of these nine models in Table IX (these indices were taken directly from the corresponding literature). The objective was to demonstrate that relatively satisfactory results could still be obtained using only infrared channel data combined with the CNN model to estimate TC intensity.   IX  COMPARISONS OF RMSE AND MAE OF TC INTENSITY ESTIMATION OF THE TCICENET MODEL AND OTHER SATELLITE-BASED MODELS In summary, the RMSE and MAE values of the intensities estimated by the TCICENet model were both smaller than those of the machine learning model [4]- [6], [20], [22], [24], [27], WIRa model [39], deviation angle variance model [18], SAT-CON model [48], Dvorak model [15], and deep learning model [34]- [36], [38], [40], [41]. The overall performance of our model is roughly comparable to the performances of the SATCON, CNN-TC, TCIENet, and Deep-PHURIE (smoothed) models.\n\nOur model is a promising TC intensity estimation technique compared to other similar models using only infrared satellite images.\n\n\nD. Error Analysis of Individual Cases\n\nWe selected three typical TCs to verify the performance of the TCICENet model.   Fig. 12(a). During the development period, Mangkhut's estimated intensities were near 35 kt. At this point, it was slightly overestimated, after which the wind speed increased. The period 0600 UTC 9 September-0600 UTC 10 September was continuously underestimated. From 1800 UTC 10 September-0600 UTC 14 September, the estimated intensities were almost the same as those of the best-track. Fig. 12(b) and (c) shows two infrared satellite images of Mangkhut. In Fig. 12(b) and (c), the absolute error of the wind speed estimation was <2.3 kt. The absolute error in Fig. 12(b) was smaller than that of Fig. 13(b). By comparison, the weaker Typhoon Kalmaegi was more likely to be overestimated. In Fig. 12(b), Mangkhut's cloud system was more scattered and its spiral structure was not obvious, which is the reason it was not easily overestimated at this stage. Fig. 12(c) shows the cloud image of Mangkhut when its best track intensity was 110 kt. At this time, the wind speed was high, the cloud system size was large, and the cloud structure was relatively sprawling and uniform. Our model could obtain a good intensity estimation result for the development stage shown in Fig. 12(c).\n\n2) Overestimation Case: Typhoon Kalmaegi in 2018 was estimated by the TCICENet with an MAE of 5.40 kt, an RMSE of 6.87 kt, and a bias of 3.45 kt, as shown in Fig. 13(a). During the entire life cycle of Kalmaegi, there were a total of 28 satellite images, and 79% of the TC intensities were overestimated. In particular, the best tracks corresponding to the satellite images with wind speeds of 35 kt constituted a high proportion, totaling 12 images, and all of them were overestimated. Fig. 13(b) and (c) is the infrared satellite images at 1200 UTC November 14, 2019 and 0600 UTC November 18, 2019, respectively. Although the spiral cloud structure is not obvious, the cloud structure is compact and the brightness is high, resulting in intensity overestimation. In Fig. 13(c), the TC is more compact and the spiral structure is obvious, resulting in intensity overestimation. In addition, as can be seen from Fig. 13, our method failed to estimate the rapid intensity changes that occurred in Kalmaegi, such as a sudden weakening, resulting in overestimation.\n\n3) Underestimation Case: It can be seen from Table VII that our TCICENet model has estimated bias of -6.20 kt and -4.66 kt for the intensity of the satellite images in STY and VSTY, respectively, indicating that the model underestimates the satellite images at these two stages. The main reason can be seen from Fig. 6 that 32% of the STYs in the test set were misclassified to a weaker category (TS+STS).\n\nAs show in Fig. 14(a), 31 satellite images of Typhoon Kammuri belonging to the STY category were misclassified as the TS+STS category. This was the main reason for the underestimation of Kammuri. For the complete life cycle of it, the RMSE was 13.52 kt, and approximately 64% of the samples were underestimated. During the TC formation stage, the wind speed gradually increased, and the wind speed was continuously underestimated from 0600 UTC November 27-1200 UTC December 1, 2019. In particular, during Kammuri's life cycle, 31% of the samples had best track wind speeds of 80 kt, of which 92% were underestimated. In Fig. 14(b), the satellite image appears as a cloud cluster with no obvious spiral structure and no eye, which may also have caused the underestimation. In Fig. 14(c), the TC image is more compact, the spiral rain band is obvious, and the eye has begun to appear. The TC wind speed estimated by the TCICENet model also increased rapidly, as shown in Fig. 14(a), approaching that of the best track intensity.\n\n\nVI. CONCLUSION\n\nIn this study, TCIC and TCIE cascaded CNN models were used to construct TCICENet models for TC intensity estimation. Based on the analysis of the intensity estimation error, the following conclusions were drawn.\n\n1) There is essentially no significant difference between direct CNN intensity estimation and CNN intensity estimation after intensity classification without considering the misclassification percent. The classification accuracy of TC intensity categories had a greater impact on the final intensity estimation results. In addition, in terms of the TCICENet model, the intensity estimation error of the TCICENet-S model was smaller after applying time-weighted smoothing to the estimated intensities of the TCICENet model. This indicates that the current TC intensity is strongly correlated with previous adjacent intensities.\n\n2) The RMSE and MAE values of the TCICENet model for the test samples were 9.59 kt and 7.45 kt, respectively. Compared with the TCICENet model, the intensity estimation results of the TCICENet-S model were more consistent with the best track data of the JMA, as indicated by the CC of 0.891. The RMSE and MAE of the test samples were 8.60 kt and 6.67 kt, respectively. Although the proposed TCICENet model has achieved good accuracy in the estimation of TC intensity, there is still additional work to be done in order to further improve its TC intensity estimation accuracy.\n\n1) We will further expand the training dataset in order to enhance the generalization ability and robustness of the TC intensity estimation model. All of the data used in our intensity estimation model have been from the northwest Pacific Ocean basin, and best track data have been used as the reference intensities. Subsequently, we can extend our model to other basins, such as the Atlantic Ocean, and use aircraft observations to guide, verify, and improve our model performance. 2) Next, we will attempt to combine a CNN with along short-term memory model [49], [50], which can efficiently extract the temporal features from the adjacent TC satellite images, in order to further improve the TC intensity estimation accuracy. 3) At present, we only use infrared satellite images for intensity estimation. In the future, we will consider combining other data, such as water vapor channel data and microwave data, and make full use of the advantages of various data to improve the performance of the model. 4) Currently, our intensity estimation model does not consider some physical factors, such as vertical wind shear [51], [52], ocean surface temperature [53], latitude and longitude of the TC center [36], and TC size [54], even though they may be important influencing factors for the rapid change of TC intensity. In the future, the above physical characteristics will be added to our model in order to improve its TC intensity estimation performance, and especially to provide new ideas for investigating sudden changes of TC intensity.\n\nFig. 1 .\n1Framework of the proposed TCICENet model architecture.\n\nFig. 2 .\n2Flowchart of the TCIC internal network architecture (the numbers 5, 10, and 5 indicate that there are 5, 10, and 5 duplicate blocks.).\n\nFig. 3 .\n3Schematic block diagram of the TCIE network architecture.\n\nFig. 4 .\n4Expansion of sample data set by different methods (original image from 0000 UTC December 22, 2001). (a) Original. (b) Rotated 90°. (c) Rotated 180°. (d) Rotated 270°. (e) With added salt-and-pepper noise. (f) With added Gaussian noise.\n\n\naccuracy of TCIC classification is low when the input image size is 110 × 110 or 140 × 140, whereas the classification accuracy can reach approximately 80% for an image size of 170 × 170. The accuracy of TC intensity classification is basically the same for input image sizes of 170 × 170 and 200 × 200. On the premise of ensuring classification accuracy while reducing\n\nFig. 5 .\n5Classification accuracy in the TCIC module and the intensity estimation of the MAE and RMSE in the TCIE module of the input image size. computation, we selected 170 × 170 as the input image size of the TCIC. During the reduction of the input image size, the MAE and RMSE of the intensity estimated by the TCIE decrease initially and then rise, reaching minimum values at 170 × 170. Therefore, input images with a size of 170 × 170 pixels were used for the TCIC and TCIE modules.\n\nFig. 6 .\n6(a) Confusion matrix of the test samples of five intensity categories for the TCIC. (b) Confusion matrix of the test samples of three intensity categories for the TCIC.\n\nFig. 7 .\n7Accuracy curve and loss function curve for the TCIC module. (a) Training loss function curve. (b) Training accuracy curve. (c) Validation loss function curve. (d) Validation accuracy curve.\n\nFig. 8 .\n8Loss function curves of training and validation for each TC category using the TCICENet model. (a) TS+STS. (b) STY. (c) VSTY+ViolentTY.\n\nFig. 9 .\n9(a) Scatter plot of best-track intensities versus estimated intensities using the TCICENet model. (b) Bias curve between the best track intensities and the estimated intensities using the TCICENet model for 2017-2019 TC samples. (c) Absolute error curve related to the percentage of absolute errors using the TCICENet model. TCICENet-S model can be significantly improved when the sequential characteristics of intensity changes are considered.\n\n\n51 kt, which was the largest of all of the test TC samples. Meanwhile, the bias of the STY category displayed the highest MAE, with a median of −6.50 kt and lower and upper limits of −37.09 and 22.66 kt, respectively. The bias of the STS category exhibited a distribution ranging from −18.72 to 21.38 kt, with a median of 0.89 kt. The bias of the VSTY category showed a distribution ranging from −28.42 to 15.53 kt, with a median of −4.88 kt. The bias of the ViolentTY category had the lowest RMSE, with a median of -6.97 kt and lower and upper limits of −14.55 and 8.79 kt, respectively. The overall bias\n\nFig. 10 .\n10Box plot and violin plot of bias in each TC category using the TCICENet model. fluctuated around 0. The upper and lower limits of the deviation distributions of STS, STY, and VSTY were large, whereas the upper and lower limits of the deviation distributions of TS and ViolentTY were small. The median deviation of the TS category was positive, whereas the median prediction deviations of the other categories were negative.\n\nFig. 11 .\n11TC intensity estimation results of the TCICENet, TCICENet-S, and the best-track intensities for 81 TCs from 2017 to 2019. The black solid line represents best track, the blue solid line represents the intensity curve estimated by the TCICENet, and the red dashed line represents the intensity curve estimated by the TCICENet-S.\n\nFig. 12 .\n12(a) Time evolution of the estimated intensities and best track intensities for ViolentTY Mangkhut. (b) Mangkhut satellite image at 0600 UTC 8 September 2018. (c) Mangkhut satellite image at 1800 UTC 13 September 2018.\n\nFig. 13 .\n13(a) Time evolution of the estimated intensities and best track intensities for STY Kalmaegi. (b) Kalmaegi satellite image at 1200 UTC 14 November 2019. (c) Kalmaegi satellite image at 0600 UTC 18 November 2019. 1) Well-Performing Case: Typhoon Mangkhut in 2018 was chosen as a case to verify the performance of the TCICENet model. Its intensities estimated by the TCICENet had MAE, RMSE, and bias values of 5.38, 7.22, and -0.96 kt, respectively, as shown in\n\nFig. 14 .\n14(a) Time evolution of the estimated intensities and best-track intensities for VSTY Kammuri. (b) Kammuri satellite image at 0000 UTC 29 November 2019. (c) Kammuri satellite image at 0600 UTC 02 December 2019.\n\nTABLE I NETWORK\nISTRUCTURE OF TCIE MODEL aa \n\nTABLE II NUMBER\nIIOF TRAINING AND TEST SAMPLES IN EACH CATEGORY TABLE III NUMBER OF TRAINING, VALIDATION, AND TEST SAMPLES IN TCIC MODULE numbers of training and test samples in each intensity category are listed in\n\nTABLE\n\n\nTABLE\n\n\nTABLE VII RMSE\nVII, MAE, AND BIAS (KT) FOR EACH TC CATEGORY, AND THE NUMBER OF TEST TC IMAGES OVERESTIMATED AND UNDERESTIMATED IN EACH CATEGORY USING THE TCICENET MODEL\n\nTABLE VIII FOUR\nVIIITC INTENSITY ESTIMATION MODELS AND THEIR COMPREHENSIVE EVALUATION INDICESThe bold entities in tables represent our proposed method.\n\nTABLE\n\nACKNOWLEDGMENT Part of the TCIC code refers to the code written by Kobiso (https://github.com/kobiso/CBAM-tensorflow). Code is available on the website (https://github.com/cherry-and-leaves/ TCICENet). The authors would like to thank LetPub (www. letpub.com) for its linguistic assistance during the preparation of this manuscript.Xiao-Jie Wang was born inShe is currently an Associate Researcher with Shanghai Typhoon Institute of the China Meteorological Administration, Shanghai, China. Her research interests include data and information processing for tropical cyclone and geographical information systems.\nSatellite analysis of tropical cyclones using the advanced microwave sounding unit (ASMU). S Q Kidder, Bull. Amer. Meteor. Soc. 816S. Q. Kidder et al., \"Satellite analysis of tropical cyclones using the advanced microwave sounding unit (ASMU),\" Bull. Amer. Meteor. Soc., vol. 81, no. 6, pp. 1241-1259, Jun. 2000.\n\nAutomatic estimation of tropical cyclone intensity using multi-channel TMI data: A genetic algorithm approach. C M Kishtawal, F Patadia, R Singh, S Basu, M S Narayanan, Geophys. Res. Lett. 3211Art. no. L11804C. M. Kishtawal, F. Patadia, R. Singh, S. Basu, and M. S. Narayanan, \"Automatic estimation of tropical cyclone intensity using multi-channel TMI data: A genetic algorithm approach,\" Geophys. Res. Lett., vol. 32, no. 11, Jun. 2005, Art. no. L11804.\n\nPrediction of tropical cyclogenesis using scatterometer data. N , C M , IEEE Geosci. Remote Sens. Lett. 4912N. Jaiswal and C. M. Kishtawal, \"Prediction of tropical cyclogenesis using scatterometer data,\" IEEE Geosci. Remote Sens. Lett., vol. 49, no. 12, pp. 4904-4909, Dec. 2011.\n\nA unique satellite-based sea surface wind speed algorithm and its application in tropical cyclone intensity analysis. S Hong, H J Seo, Y J Kwon, J. Atmos. Ocean. Technol. 337S. Hong, H. J. Seo, and Y. J. Kwon, \"A unique satellite-based sea surface wind speed algorithm and its application in tropical cyclone intensity anal- ysis,\" J. Atmos. Ocean. Technol., vol. 33, no. 7, pp. 1363-1375, Jul. 2016.\n\nEstimation of tropical cyclone intensity in the north Atlantic and northeastern Pacific basins using TRMM satellite passive microwave observations. H Y Jiang, C Tao, Y X Pei, J. Appl. Meteor. 582H. Y. Jiang, C. Tao, and Y. X. Pei, \"Estimation of tropical cyclone intensity in the north Atlantic and northeastern Pacific basins using TRMM satellite passive microwave observations,\" J. Appl. Meteor., vol. 58, no. 2, pp. 185-197, Feb. 2019.\n\nSynergistic use of satellite active and passive microwave observations to estimate typhoon intensity. X Yang, K Xiang, Proc. Photon. Electromagn. Res. Symp.-Spring. Photon. Electromagn. Res. Symp.-SpringX. Yang and K. Xiang, \"Synergistic use of satellite active and passive microwave observations to estimate typhoon intensity,\" in Proc. Photon. Electromagn. Res. Symp.-Spring, Jun. 2019, pp. 1612-1617.\n\nA technique for the analysis and forecasting of tropicalcyclone intensities from satellite pictures. V F Dvorak, NOAA Tech. Memorandum NESS. 4519V. F. Dvorak, \"A technique for the analysis and forecasting of tropical- cyclone intensities from satellite pictures,\" NOAA Tech. Memorandum NESS, vol. 45, p. 19, 1973.\n\nTropical cyclone intensity analysis and forecasting from satellite imagery. C A Dvorak, Monthly Weather Rev. 1035C. A. Dvorak, \"Tropical cyclone intensity analysis and forecasting from satellite imagery,\" Monthly Weather Rev., vol. 103, no. 5, pp. 420-430, May 1975.\n\nTropical cyclone intensity analysis using satellite data. V F Dvorak, NOAA Tech. Rep., NOAA/NESDIS. 1147V. F. Dvorak, \"Tropical cyclone intensity analysis using satellite data,\" NOAA Tech. Rep., NOAA/NESDIS, Washington, DC, USA, vol. 11, p. 47, 1984.\n\nTropical cyclone intensity analysis using enhanced infrared satellite data. V Dvorak, S Wright, Proc. 11th Tech. Conf. Hurricanes Trop. 11th Tech. Conf. Hurricanes TropV. Dvorak and S. Wright, \"Tropical cyclone intensity analysis using enhanced infrared satellite data,\" in Proc. 11th Tech. Conf. Hurricanes Trop. Meteorol., 1977, pp. 268-273.\n\nSatellite applications at the joint typhoon warning center. G Engel, Proc. 5th WMO Int. Workshop Tropical Cyclones. 5th WMO Int. Workshop Tropical Cyclones1136Rapporteur ReportTopic 0.1 eG. Engel, \"Satellite applications at the joint typhoon warning center. Rapporteur Report, Topic 0.1 e,\" in Proc. 5th WMO Int. Workshop Tropical Cyclones, 2002, vol. 1136.\n\nThe advanced Dvorak technique: Continued development of an objective scheme to estimate tropical cyclone intensity using geostationary infrared satellite imagery. T L Olander, C S Velden, Wea. Forecasting. 222T. L. Olander and C. S. Velden, \"The advanced Dvorak technique: Con- tinued development of an objective scheme to estimate tropical cyclone intensity using geostationary infrared satellite imagery,\" Wea. Forecasting, vol. 22, no. 2, pp. 287-298, Apr. 2007.\n\nEstimating hurricane wind structure in the absence of aircraft reconnaissance. J P Kossin, Weather Forecasting. 221J. P. Kossin et al., \"Estimating hurricane wind structure in the absence of aircraft reconnaissance,\" Weather Forecasting, vol. 22, no. 1, pp. 89-101, Feb. 2007.\n\nObjective estimation of tropical cyclone intensity based on satellite data. X Q Lu, X T Lei, H Yu, B K Zhao, J. Appl. Meteorol. 251X. Q. Lu, X. T. Lei, H. Yu, and B. K. Zhao, \"Objective estimation of tropical cyclone intensity based on satellite data,\" J. Appl. Meteorol., vol. 25, no. 1, pp. 52-58, Jan. 2014.\n\nThe advanced Dvorak technique (ADT) for estimating tropical cyclone intensity: Update and new capabilities. T L Olander, C S Velden, Weather Forecasting. 344T. L. Olander and C. S. Velden, \"The advanced Dvorak technique (ADT) for estimating tropical cyclone intensity: Update and new capabilities,\" Weather Forecasting, vol. 34, no. 4, pp. 905-922, 2019.\n\nObjective measures of tropical cyclone structure and intensity change from remotely sensed infrared image data. M F Pineros, E A Ritchie, J S Tyo, IEEE Trans. Geosci. Remote Sens. 4611M. F. Pineros, E. A. Ritchie, and J. S. Tyo, \"Objective measures of tropical cyclone structure and intensity change from remotely sensed infrared image data,\" IEEE Trans. Geosci. Remote Sens., vol. 46, no. 11, pp. 3574-3580, Nov. 2008.\n\nEstimating tropical cyclone intensity from infrared image data. M F Pineros, E A Ritchie, J S Tyo, Weather Forecasting. 265M. F. Pineros, E. A. Ritchie, and J. S. Tyo, \"Estimating tropical cyclone intensity from infrared image data,\" Weather Forecasting, vol. 26, no. 5, pp. 690-698, Oct. 2011.\n\nSatellite-derived tropical cyclone intensity in the north Pacific ocean using the deviation-angle variance technique. E A Ritchie, K M Wood, O G Rodriguez-Herrera, M F Pineros, J S Tyo, Weather Forecasting. 293E. A. Ritchie, K. M. Wood, O. G. Rodriguez-Herrera, M. F. Pineros, and J. S. Tyo, \"Satellite-derived tropical cyclone intensity in the north Pacific ocean using the deviation-angle variance technique,\" Weather Forecasting, vol. 29, no. 3, pp. 505-516, Jun. 2014.\n\nA satellite-derived typhoon intensity index using a deviation angle technique. C.-C Liu, C.-Y Liu, T.-H Lin, L.-D Chen, Int. J. Remote. Sens. 364C.-C. Liu, C.-Y. Liu, T.-H. Lin, and L.-D. Chen, \"A satellite-derived typhoon intensity index using a deviation angle technique,\" Int. J. Remote. Sens., vol. 36, no. 4, pp. 1216-1234, Feb. 2015.\n\nA multiple linear regression model for tropical cyclone intensity estimation from satellite infrared images. Y Zhao, C Zhao, R Sun, Z Wang, Atmosphere. 73Y. Zhao, C. Zhao, R. Sun, and Z. Wang, \"A multiple linear regression model for tropical cyclone intensity estimation from satellite infrared images,\" Atmosphere, vol. 7, no. 3, Mar. 2016, Art. no. 40.\n\nObjective tropical cyclone intensity estimation using analogs of spatial features in satellite data. G Fetanat, A Homaifar, Weather Forecasting. 286G. Fetanat and A. Homaifar, \"Objective tropical cyclone intensity estima- tion using analogs of spatial features in satellite data,\" Weather Forecasting, vol. 28, no. 6, pp. 1446-1459, Dec. 2013.\n\nEstimation of tropical cyclone intensity using infrared data from a geostationary satellite. J Liu, X Xu, X Luo, Sci. Online Lett. Atmos. 15J. Liu, X. Xu, and X. Luo, \"Estimation of tropical cyclone intensity using infrared data from a geostationary satellite,\" Sci. Online Lett. Atmos., vol. 15, pp. 189-192, 2019.\n\nTropical cyclone intensity detection by geometric features of cyclone images and multilayer perceptron. C Kar, A Kumar, S Banerjee, SN Appl. Sci. 19Art. no. 1099C. Kar, A. Kumar, and S. Banerjee, \"Tropical cyclone intensity detection by geometric features of cyclone images and multilayer perceptron,\" SN Appl. Sci., vol. 1, no. 9, Aug. 2019, Art. no. 1099.\n\nPhurie: Hurricane intensity estimation from infrared satellite imagery using machine learning. A Asif, Neural Comput. Appl. 329A. Asif et al., \"Phurie: Hurricane intensity estimation from infrared satellite imagery using machine learning,\" Neural Comput. Appl., vol. 32, no. 9, pp. 4821-4834, 2020.\n\nEyed tropical cyclone intensity objective estimation model based on infrared satellite image and relevance vector machine. L J Dai, C J Zhang, L C Xue, L M Ma, X Q Lu, J. Remote Sens. 224L. J. Dai, C. J. Zhang, L. C. Xue, L. M. Ma, and X. Q. Lu, \"Eyed tropical cyclone intensity objective estimation model based on infrared satellite image and relevance vector machine,\" J. Remote Sens., vol. 22, no. 4, pp. 581-590, Jan. 2018.\n\nIntensity estimation of tropical cyclones using the relevance vector machine from infrared satellite image data. C J Zhang, Q Luo, L J Dai, L M Ma, X Q Lu, IEEE J. Sel. Top. Appl. Earth Obs. Remote Sens. 123C. J. Zhang, Q. Luo, L. J. Dai, L. M. Ma, and X. Q. Lu, \"Intensity estimation of tropical cyclones using the relevance vector machine from infrared satellite image data,\" IEEE J. Sel. Top. Appl. Earth Obs. Remote Sens., vol. 12, no. 3, pp. 763-773, Mar. 2019.\n\nTropical cyclone intensity estimation using RVM and DADI based on infrared brightness temperature. C J Zhang, J F Qian, L M Ma, X Q Lu, Weather Forecasting. 315C. J. Zhang, J. F. Qian, L. M. Ma, and X. Q. Lu, \"Tropical cyclone intensity estimation using RVM and DADI based on infrared brightness tempera- ture,\" Weather Forecasting, vol. 31, no. 5, pp. 1643-1654, Oct. 2016.\n\nGradient-based learning applied to document recognition. Y Lecun, L Bottou, Y Bengio, P Haffner, Proc. IEEE. IEEE86Y. LeCun, L. Bottou, Y. Bengio, and P. Haffner, \"Gradient-based learn- ing applied to document recognition,\" Proc. IEEE, vol. 86, no. 11, pp. 2278-2324, Nov. 1998.\n\nImageNet classification with deep convolutional neural networks. A Krizhevsky, I Sutskever, G E Hinton, Proc. Adv. Neural Inf. Adv. Neural InfProcess. SystA. Krizhevsky, I. Sutskever, and G. E. Hinton, \"ImageNet classification with deep convolutional neural networks,\" in Proc. Adv. Neural Inf. Pro- cess. Syst., 2012, pp. 1097-1105.\n\nVery deep convolutional networks for large-scale image recognition. K Simonyan, A Zisserman, arXiv:1409.1556K. Simonyan and A. Zisserman, \"Very deep convolutional networks for large-scale image recognition,\" 2014, arXiv:1409.1556.\n\nGoing deeper with convolutions. C Szegedy, Proc. IEEE Conf. Comput. Vision Pattern Recognit. IEEE Conf. Comput. Vision Pattern RecognitC. Szegedy et al., ''Going deeper with convolutions,\" in Proc. IEEE Conf. Comput. Vision Pattern Recognit., Jun. 2015, pp. 1-9.\n\nDeep residual learning for image recognition. K He, X Zhang, S Ren, J Sun, Proc. IEEE Conf. Comput. Vision Pattern Recognit. IEEE Conf. Comput. Vision Pattern RecognitK. He, X. Zhang, S. Ren, and J. Sun, \"Deep residual learning for image recognition,\" in Proc. IEEE Conf. Comput. Vision Pattern Recognit., 2016, pp. 770-778.\n\nInception-v4, inception-ResNet and the impact of residual connections on learning. C Szegedy, S Ioffffe, V Vanhoucke, A Alemi, 31st AAAI Conf. Artif. Intell. C. Szegedy, S. Ioffffe, V. Vanhoucke, and A. Alemi, \"Inception-v4, inception-ResNet and the impact of residual connections on learning,\" in 31st AAAI Conf. Artif. Intell., 2017, pp. 4278-4284.\n\nTropical cyclone intensity estimation using two-branch convolutional neural network from infrared and water vapor images. R Zhang, Q Liu, R Hang, IEEE Trans. Geosci. Remote. Sens. 581R. Zhang, Q. Liu, and R. Hang, \"Tropical cyclone intensity estimation using two-branch convolutional neural network from infrared and wa- ter vapor images,\" IEEE Trans. Geosci. Remote. Sens, vol. 58, no. 1, pp. 586-597, Jan. 2019.\n\nTropical cyclone intensity estimation using a deep convolutional neural network. R Pradhan, R S Aygun, M Maskey, R Ramachandran, D J Cecil, IEEE Trans. Image Process. 272R. Pradhan, R. S. Aygun, M. Maskey, R. Ramachandran, and D. J. Cecil, \"Tropical cyclone intensity estimation using a deep convolutional neural network,\" IEEE Trans. Image Process., vol. 27, no. 2, pp. 692-702, Feb. 2018.\n\nEstimating tropical cyclone intensity by satellite imagery utilizing convolutional neural networks. B.-F Chen, B Chen, H.-T Lin, R L Elsberry, Weather Forecasting. 342B.-F. Chen, B. Chen, H.-T. Lin, and R. L. Elsberry, \"Estimating tropi- cal cyclone intensity by satellite imagery utilizing convolutional neural networks,\" Weather Forecasting, vol. 34, no. 2, pp. 447-465, 2019.\n\nA semisupervised deep learning framework for tropical cyclone intensity estimation. G Chen, Z Chen, F Zhou, X Yu, H Zhang, L Zhu, Proc. 10th Int. Workshop Anal. Multitemporal Remote Sens. Images. 10th Int. Workshop Anal. Multitemporal Remote Sens. ImagesG. Chen, Z. Chen, F. Zhou, X. Yu, H. Zhang, and L. Zhu, \"A semisuper- vised deep learning framework for tropical cyclone intensity estimation,\" in Proc. 10th Int. Workshop Anal. Multitemporal Remote Sens. Images, Aug. 2019, pp. 1-4.\n\nDeep-PHURIE: Deep learning based hurricane intensity estimation from infrared satellite imagery. M Dawood, Neural Comput. Appl. 325M. Dawood et al., \"Deep-PHURIE: Deep learning based hurricane inten- sity estimation from infrared satellite imagery,\" Neural Comput. Appl., vol. 32, no. 5, pp. 1-9, Jan. 2019.\n\nA new satellite-based indicator for estimation of the western north Pacific tropical cyclone current intensity. X.-Y Zhuge, J Guan, F Yu, Y Wang, IEEE Trans. Geosci. Remote. Sens. 5310X.-Y. Zhuge, J. Guan, F. Yu, and Y. Wang, \"A new satellite-based indicator for estimation of the western north Pacific tropical cyclone current inten- sity,\" IEEE Trans. Geosci. Remote. Sens, vol. 53, no. 10, pp. 5661-5676, Oct. 2015.\n\nUsing deep learning to estimate tropical cyclone intensity from satellite passive microwave imagery. A Wimmers, C Velden, J H Cossuth, Monthly Weather Rev. 1476A. Wimmers, C. Velden, and J. H. Cossuth, \"Using deep learning to esti- mate tropical cyclone intensity from satellite passive microwave imagery,\" Monthly Weather Rev., vol. 147, no. 6, pp. 2261-2282, Jun. 2019.\n\nA convolutional neural network approach for estimating tropical cyclone intensity using satellite-based infrared images. J S Combinido, J R Mendoza, J Aborot, Proc. 24th Int. Conf. Pattern Recognit. 24th Int. Conf. Pattern RecognitJ. S. Combinido, J. R. Mendoza, and J. Aborot, \"A convolutional neu- ral network approach for estimating tropical cyclone intensity using satellite-based infrared images,\" in Proc. 24th Int. Conf. Pattern Recognit., Aug. 2018, pp. 1474-1480.\n\nTropical cyclone intensity estimation in the north Atlantic basin using an improved deviation angle variance technique. E A Ritchie, K G Valliere, Weather Forecasting. 27E. A. Ritchie and K. G. Valliere, \"Tropical cyclone intensity estimation in the north Atlantic basin using an improved deviation angle variance technique,\" Weather Forecasting, vol. 27, no. 5, pp. 1264-1277, Oct. 2012.\n\nCBAM: Convolutional block attention module. S Woo, J Park, J.-Y. Lee, I So Kweon, Proc. Eur. Conf. Comput. Vis. Eur. Conf. Comput. VisS. Woo, J. Park, J.-Y. Lee, and I. So Kweon, \"CBAM: Convolutional block attention module,\" in Proc. Eur. Conf. Comput. Vis., 2018, pp. 3-19.\n\nRectifier nonlinearities improve neural network acoustic models. A L Maas, A Y Hannun, A Y Ng, Proc. Int. Conf. Mach. Learn. Int. Conf. Mach. Learn303A. L. Maas, A. Y. Hannun, and A. Y. Ng, \"Rectifier nonlinearities im- prove neural network acoustic models,\" in Proc. Int. Conf. Mach. Learn., Jun. 2013, vol. 30, p. 3.\n\nFast R-CNN. R Girshick, Proc. IEEE Int. Conf. Comput. Vision. IEEE Int. Conf. Comput. VisionR. Girshick, \"Fast R-CNN,\" in Proc. IEEE Int. Conf. Comput. Vision, 2015, pp. 1440-1448.\n\nADADELTA: An adaptive learning rate method. M D Zeiler, arXiv:1212.5701M. D. Zeiler, \"ADADELTA: An adaptive learning rate method,\" 2012, arXiv:1212.5701.\n\nAdam: A method for stochastic optimization. D P Kingma, J Ba, arXiv:1412.6980D. P. Kingma and J. Ba, \"Adam: A method for stochastic optimization,\" 2014, arXiv:1412.6980.\n\nAn update on the CIMSS SATellite CONsensus (SATCON) tropical cyclone intensity algorithm. C Velden, D Herndon, Proc. Joint Satell. Conf. Joint Satell. ConfC. Velden and D. Herndon, \"An update on the CIMSS SATellite CONsen- sus (SATCON) tropical cyclone intensity algorithm,\" in Proc. Joint Satell. Conf., 2019.\n\nLong short-term memory. S Hochreiter, J Schmidhuber, Neural Comput. 98S. Hochreiter and J. Schmidhuber, \"Long short-term memory,\" Neural Comput., vol. 9, no. 8, pp. 1735-1780, Nov. 1997.\n\nConvolutional LSTM network: A machine learning approach for precipitation nowcasting. X Shi, Z Chen, H Wang, D.-Y Yeung, W.-K Wong, W.-C Woo, Adv. Neural Inf. Process. Syst. 28X. Shi, Z. Chen, H. Wang, D.-Y. Yeung, W.-K. Wong, and W.-C. Woo, \"Convolutional LSTM network: A machine learning approach for precip- itation nowcasting,\" Adv. Neural Inf. Process. Syst., vol. 28, pp. 802-810, 2015.\n\nThe relative importance of factors influencing tropical cyclone rapid intensity changes. S Bhalachandran, Z S Haddad, S M Hristova-Veleva, F MarksJr, Geophys. Res. Lett. 464S. Bhalachandran, Z. S. Haddad, S. M. Hristova-Veleva, and F. Marks, Jr., \"The relative importance of factors influencing tropical cyclone rapid intensity changes,\" Geophys. Res. Lett., vol. 46, no. 4, pp. 2282-2292, 2019.\n\nOn the rapid weakening of very intense Tropical Cyclone. A Colomb, T Kriat, M.-D Leroux, Monthly Weather Rev. 1478A. Colomb, T. Kriat, and M.-D. Leroux, \"On the rapid weakening of very intense Tropical Cyclone Hellen (2014),\" Monthly Weather Rev., vol. 147, no. 8, pp. 2717-2737, 2019.\n\nRelationship between sea surface temperature and the maximum intensity of tropical cyclones affecting Vietnam's coastline. N T Thanh, H D Cuong, N X Hien, C Kieu, Int. J. Climatol. 405N. T. Thanh, H. D. Cuong, N. X. Hien, and C. Kieu, \"Relationship between sea surface temperature and the maximum intensity of tropical cyclones affecting Vietnam's coastline,\" Int. J. Climatol., vol. 40, no. 5, pp. 2527-2538, 2020.\n\nImpact of storm size on prediction of storm track and intensity using the 2016 Operational GFDL Hurricane Model. M A Bender, T P Marchok, C R Sampson, J A Knaffff, M J Morin, Weather Forecasting. 324M. A. Bender, T. P. Marchok, C. R. Sampson, J. A. Knaffff, and M. J. Morin, \"Impact of storm size on prediction of storm track and intensity using the 2016 Operational GFDL Hurricane Model,\" Weather Forecasting, vol. 32, no. 4, pp. 1491-1508, 2017.\n", "annotations": {"author": "[{\"start\":\"111\",\"end\":\"129\"},{\"start\":\"130\",\"end\":\"144\"},{\"start\":\"145\",\"end\":\"157\"},{\"start\":\"158\",\"end\":\"170\"}]", "publisher": null, "author_last_name": "[{\"start\":\"123\",\"end\":\"128\"},{\"start\":\"139\",\"end\":\"143\"},{\"start\":\"154\",\"end\":\"156\"},{\"start\":\"167\",\"end\":\"169\"}]", "author_first_name": "[{\"start\":\"111\",\"end\":\"122\"},{\"start\":\"130\",\"end\":\"138\"},{\"start\":\"145\",\"end\":\"153\"},{\"start\":\"158\",\"end\":\"166\"}]", "author_affiliation": null, "title": "[{\"start\":\"1\",\"end\":\"108\"},{\"start\":\"171\",\"end\":\"278\"}]", "venue": "[{\"start\":\"280\",\"end\":\"360\"}]", "abstract": "[{\"start\":\"521\",\"end\":\"1982\"}]", "bib_ref": "[{\"start\":\"2614\",\"end\":\"2617\",\"attributes\":{\"ref_id\":\"b0\"}},{\"start\":\"2619\",\"end\":\"2622\",\"attributes\":{\"ref_id\":\"b5\"}},{\"start\":\"3044\",\"end\":\"3047\",\"attributes\":{\"ref_id\":\"b6\"}},{\"start\":\"3049\",\"end\":\"3053\",\"attributes\":{\"ref_id\":\"b9\"}},{\"start\":\"3164\",\"end\":\"3168\",\"attributes\":{\"ref_id\":\"b10\"}},{\"start\":\"3211\",\"end\":\"3215\",\"attributes\":{\"ref_id\":\"b11\"}},{\"start\":\"3217\",\"end\":\"3221\",\"attributes\":{\"ref_id\":\"b12\"}},{\"start\":\"3322\",\"end\":\"3326\",\"attributes\":{\"ref_id\":\"b13\"}},{\"start\":\"3347\",\"end\":\"3351\",\"attributes\":{\"ref_id\":\"b14\"}},{\"start\":\"3588\",\"end\":\"3592\",\"attributes\":{\"ref_id\":\"b15\"}},{\"start\":\"3741\",\"end\":\"3745\",\"attributes\":{\"ref_id\":\"b16\"}},{\"start\":\"3826\",\"end\":\"3830\",\"attributes\":{\"ref_id\":\"b17\"}},{\"start\":\"3832\",\"end\":\"3836\",\"attributes\":{\"ref_id\":\"b18\"}},{\"start\":\"3996\",\"end\":\"4000\",\"attributes\":{\"ref_id\":\"b13\"}},{\"start\":\"4002\",\"end\":\"4006\",\"attributes\":{\"ref_id\":\"b19\"}},{\"start\":\"4042\",\"end\":\"4046\",\"attributes\":{\"ref_id\":\"b20\"}},{\"start\":\"4048\",\"end\":\"4052\",\"attributes\":{\"ref_id\":\"b21\"}},{\"start\":\"4080\",\"end\":\"4084\",\"attributes\":{\"ref_id\":\"b22\"}},{\"start\":\"4115\",\"end\":\"4119\",\"attributes\":{\"ref_id\":\"b23\"}},{\"start\":\"4156\",\"end\":\"4160\",\"attributes\":{\"ref_id\":\"b24\"}},{\"start\":\"4162\",\"end\":\"4166\",\"attributes\":{\"ref_id\":\"b26\"}},{\"start\":\"4297\",\"end\":\"4300\",\"attributes\":{\"ref_id\":\"b0\"}},{\"start\":\"4302\",\"end\":\"4305\",\"attributes\":{\"ref_id\":\"b1\"}},{\"start\":\"4307\",\"end\":\"4311\",\"attributes\":{\"ref_id\":\"b13\"}},{\"start\":\"4313\",\"end\":\"4317\",\"attributes\":{\"ref_id\":\"b22\"}},{\"start\":\"4319\",\"end\":\"4323\",\"attributes\":{\"ref_id\":\"b24\"}},{\"start\":\"4325\",\"end\":\"4329\",\"attributes\":{\"ref_id\":\"b26\"}},{\"start\":\"4353\",\"end\":\"4356\",\"attributes\":{\"ref_id\":\"b6\"}},{\"start\":\"4358\",\"end\":\"4362\",\"attributes\":{\"ref_id\":\"b9\"}},{\"start\":\"4364\",\"end\":\"4368\",\"attributes\":{\"ref_id\":\"b11\"}},{\"start\":\"4370\",\"end\":\"4374\",\"attributes\":{\"ref_id\":\"b12\"}},{\"start\":\"4376\",\"end\":\"4380\",\"attributes\":{\"ref_id\":\"b14\"}},{\"start\":\"4382\",\"end\":\"4386\",\"attributes\":{\"ref_id\":\"b16\"}},{\"start\":\"4388\",\"end\":\"4392\",\"attributes\":{\"ref_id\":\"b41\"}},{\"start\":\"4737\",\"end\":\"4741\",\"attributes\":{\"ref_id\":\"b35\"}},{\"start\":\"5373\",\"end\":\"5377\",\"attributes\":{\"ref_id\":\"b34\"}},{\"start\":\"5640\",\"end\":\"5644\",\"attributes\":{\"ref_id\":\"b37\"}},{\"start\":\"5646\",\"end\":\"5650\",\"attributes\":{\"ref_id\":\"b40\"}},{\"start\":\"6189\",\"end\":\"6193\",\"attributes\":{\"ref_id\":\"b33\"}},{\"start\":\"6195\",\"end\":\"6199\",\"attributes\":{\"ref_id\":\"b40\"}},{\"start\":\"6730\",\"end\":\"6734\",\"attributes\":{\"ref_id\":\"b34\"}},{\"start\":\"8292\",\"end\":\"8296\",\"attributes\":{\"ref_id\":\"b32\"}},{\"start\":\"8828\",\"end\":\"8832\",\"attributes\":{\"ref_id\":\"b27\"}},{\"start\":\"8842\",\"end\":\"8846\",\"attributes\":{\"ref_id\":\"b28\"}},{\"start\":\"8859\",\"end\":\"8863\",\"attributes\":{\"ref_id\":\"b29\"}},{\"start\":\"10063\",\"end\":\"10067\",\"attributes\":{\"ref_id\":\"b32\"}},{\"start\":\"10080\",\"end\":\"10084\",\"attributes\":{\"ref_id\":\"b28\"}},{\"start\":\"11042\",\"end\":\"11046\",\"attributes\":{\"ref_id\":\"b33\"}},{\"start\":\"11048\",\"end\":\"11052\",\"attributes\":{\"ref_id\":\"b34\"}},{\"start\":\"11630\",\"end\":\"11634\",\"attributes\":{\"ref_id\":\"b42\"}},{\"start\":\"15023\",\"end\":\"15027\",\"attributes\":{\"ref_id\":\"b28\"}},{\"start\":\"15205\",\"end\":\"15209\",\"attributes\":{\"ref_id\":\"b43\"}},{\"start\":\"16477\",\"end\":\"16481\",\"attributes\":{\"ref_id\":\"b44\"}},{\"start\":\"23028\",\"end\":\"23034\"},{\"start\":\"23221\",\"end\":\"23225\",\"attributes\":{\"ref_id\":\"b45\"}},{\"start\":\"23386\",\"end\":\"23390\",\"attributes\":{\"ref_id\":\"b46\"}},{\"start\":\"30765\",\"end\":\"30769\",\"attributes\":{\"ref_id\":\"b35\"}},{\"start\":\"30787\",\"end\":\"30791\",\"attributes\":{\"ref_id\":\"b25\"}},{\"start\":\"32643\",\"end\":\"32647\",\"attributes\":{\"ref_id\":\"b11\"}},{\"start\":\"32649\",\"end\":\"32653\",\"attributes\":{\"ref_id\":\"b20\"}},{\"start\":\"33439\",\"end\":\"33443\",\"attributes\":{\"ref_id\":\"b35\"}},{\"start\":\"33445\",\"end\":\"33449\",\"attributes\":{\"ref_id\":\"b37\"}},{\"start\":\"33451\",\"end\":\"33455\",\"attributes\":{\"ref_id\":\"b40\"}},{\"start\":\"39327\",\"end\":\"39331\",\"attributes\":{\"ref_id\":\"b21\"}},{\"start\":\"39338\",\"end\":\"39342\",\"attributes\":{\"ref_id\":\"b17\"}},{\"start\":\"39355\",\"end\":\"39359\",\"attributes\":{\"ref_id\":\"b23\"}},{\"start\":\"39365\",\"end\":\"39369\",\"attributes\":{\"ref_id\":\"b19\"}},{\"start\":\"39380\",\"end\":\"39384\",\"attributes\":{\"ref_id\":\"b26\"}},{\"start\":\"39397\",\"end\":\"39401\",\"attributes\":{\"ref_id\":\"b25\"}},{\"start\":\"39411\",\"end\":\"39415\",\"attributes\":{\"ref_id\":\"b34\"}},{\"start\":\"39423\",\"end\":\"39427\",\"attributes\":{\"ref_id\":\"b40\"}},{\"start\":\"39445\",\"end\":\"39449\",\"attributes\":{\"ref_id\":\"b37\"}},{\"start\":\"39640\",\"end\":\"39644\",\"attributes\":{\"ref_id\":\"b21\"}},{\"start\":\"39651\",\"end\":\"39655\",\"attributes\":{\"ref_id\":\"b17\"}},{\"start\":\"39668\",\"end\":\"39672\",\"attributes\":{\"ref_id\":\"b23\"}},{\"start\":\"39678\",\"end\":\"39682\",\"attributes\":{\"ref_id\":\"b19\"}},{\"start\":\"39693\",\"end\":\"39697\",\"attributes\":{\"ref_id\":\"b26\"}},{\"start\":\"39714\",\"end\":\"39718\",\"attributes\":{\"ref_id\":\"b25\"}},{\"start\":\"40395\",\"end\":\"40399\",\"attributes\":{\"ref_id\":\"b37\"}},{\"start\":\"40684\",\"end\":\"40688\",\"attributes\":{\"ref_id\":\"b34\"}},{\"start\":\"40945\",\"end\":\"40948\",\"attributes\":{\"ref_id\":\"b3\"}},{\"start\":\"40950\",\"end\":\"40953\",\"attributes\":{\"ref_id\":\"b4\"}},{\"start\":\"40955\",\"end\":\"40959\",\"attributes\":{\"ref_id\":\"b39\"}},{\"start\":\"41046\",\"end\":\"41049\",\"attributes\":{\"ref_id\":\"b5\"}},{\"start\":\"41051\",\"end\":\"41055\",\"attributes\":{\"ref_id\":\"b14\"}},{\"start\":\"41057\",\"end\":\"41061\",\"attributes\":{\"ref_id\":\"b33\"}},{\"start\":\"41063\",\"end\":\"41067\",\"attributes\":{\"ref_id\":\"b35\"}},{\"start\":\"41069\",\"end\":\"41073\",\"attributes\":{\"ref_id\":\"b38\"}},{\"start\":\"41075\",\"end\":\"41079\",\"attributes\":{\"ref_id\":\"b47\"}},{\"start\":\"41197\",\"end\":\"41200\",\"attributes\":{\"ref_id\":\"b3\"}},{\"start\":\"41395\",\"end\":\"41398\",\"attributes\":{\"ref_id\":\"b4\"}},{\"start\":\"41514\",\"end\":\"41517\",\"attributes\":{\"ref_id\":\"b5\"}},{\"start\":\"41601\",\"end\":\"41605\",\"attributes\":{\"ref_id\":\"b35\"}},{\"start\":\"41625\",\"end\":\"41629\",\"attributes\":{\"ref_id\":\"b33\"}},{\"start\":\"41651\",\"end\":\"41655\",\"attributes\":{\"ref_id\":\"b38\"}},{\"start\":\"41833\",\"end\":\"41837\",\"attributes\":{\"ref_id\":\"b14\"}},{\"start\":\"42382\",\"end\":\"42386\",\"attributes\":{\"ref_id\":\"b47\"}},{\"start\":\"42404\",\"end\":\"42408\",\"attributes\":{\"ref_id\":\"b39\"}},{\"start\":\"42926\",\"end\":\"42929\",\"attributes\":{\"ref_id\":\"b3\"}},{\"start\":\"42931\",\"end\":\"42934\",\"attributes\":{\"ref_id\":\"b5\"}},{\"start\":\"42936\",\"end\":\"42940\",\"attributes\":{\"ref_id\":\"b14\"}},{\"start\":\"42942\",\"end\":\"42946\",\"attributes\":{\"ref_id\":\"b33\"}},{\"start\":\"42948\",\"end\":\"42952\",\"attributes\":{\"ref_id\":\"b35\"}},{\"start\":\"42954\",\"end\":\"42958\",\"attributes\":{\"ref_id\":\"b38\"}},{\"start\":\"42960\",\"end\":\"42964\",\"attributes\":{\"ref_id\":\"b39\"}},{\"start\":\"42966\",\"end\":\"42970\",\"attributes\":{\"ref_id\":\"b47\"}},{\"start\":\"43674\",\"end\":\"43677\",\"attributes\":{\"ref_id\":\"b3\"}},{\"start\":\"43679\",\"end\":\"43682\",\"attributes\":{\"ref_id\":\"b5\"}},{\"start\":\"43684\",\"end\":\"43688\",\"attributes\":{\"ref_id\":\"b19\"}},{\"start\":\"43690\",\"end\":\"43694\",\"attributes\":{\"ref_id\":\"b21\"}},{\"start\":\"43696\",\"end\":\"43700\",\"attributes\":{\"ref_id\":\"b23\"}},{\"start\":\"43702\",\"end\":\"43706\",\"attributes\":{\"ref_id\":\"b26\"}},{\"start\":\"43719\",\"end\":\"43723\",\"attributes\":{\"ref_id\":\"b38\"}},{\"start\":\"43756\",\"end\":\"43760\",\"attributes\":{\"ref_id\":\"b17\"}},{\"start\":\"43776\",\"end\":\"43780\",\"attributes\":{\"ref_id\":\"b47\"}},{\"start\":\"43795\",\"end\":\"43799\",\"attributes\":{\"ref_id\":\"b14\"}},{\"start\":\"43825\",\"end\":\"43829\",\"attributes\":{\"ref_id\":\"b33\"}},{\"start\":\"43831\",\"end\":\"43835\",\"attributes\":{\"ref_id\":\"b35\"}},{\"start\":\"43837\",\"end\":\"43841\",\"attributes\":{\"ref_id\":\"b37\"}},{\"start\":\"43843\",\"end\":\"43847\",\"attributes\":{\"ref_id\":\"b39\"}},{\"start\":\"43849\",\"end\":\"43853\",\"attributes\":{\"ref_id\":\"b40\"}},{\"start\":\"49933\",\"end\":\"49937\",\"attributes\":{\"ref_id\":\"b48\"}},{\"start\":\"49939\",\"end\":\"49943\",\"attributes\":{\"ref_id\":\"b49\"}},{\"start\":\"50495\",\"end\":\"50499\",\"attributes\":{\"ref_id\":\"b50\"}},{\"start\":\"50501\",\"end\":\"50505\",\"attributes\":{\"ref_id\":\"b51\"}},{\"start\":\"50533\",\"end\":\"50537\",\"attributes\":{\"ref_id\":\"b52\"}},{\"start\":\"50579\",\"end\":\"50583\",\"attributes\":{\"ref_id\":\"b35\"}},{\"start\":\"50597\",\"end\":\"50601\",\"attributes\":{\"ref_id\":\"b53\"}}]", "figure": "[{\"start\":\"50919\",\"end\":\"50984\",\"attributes\":{\"id\":\"fig_0\"}},{\"start\":\"50985\",\"end\":\"51130\",\"attributes\":{\"id\":\"fig_1\"}},{\"start\":\"51131\",\"end\":\"51199\",\"attributes\":{\"id\":\"fig_2\"}},{\"start\":\"51200\",\"end\":\"51446\",\"attributes\":{\"id\":\"fig_3\"}},{\"start\":\"51447\",\"end\":\"51818\",\"attributes\":{\"id\":\"fig_4\"}},{\"start\":\"51819\",\"end\":\"52308\",\"attributes\":{\"id\":\"fig_5\"}},{\"start\":\"52309\",\"end\":\"52488\",\"attributes\":{\"id\":\"fig_6\"}},{\"start\":\"52489\",\"end\":\"52689\",\"attributes\":{\"id\":\"fig_7\"}},{\"start\":\"52690\",\"end\":\"52836\",\"attributes\":{\"id\":\"fig_8\"}},{\"start\":\"52837\",\"end\":\"53292\",\"attributes\":{\"id\":\"fig_9\"}},{\"start\":\"53293\",\"end\":\"53900\",\"attributes\":{\"id\":\"fig_10\"}},{\"start\":\"53901\",\"end\":\"54337\",\"attributes\":{\"id\":\"fig_11\"}},{\"start\":\"54338\",\"end\":\"54678\",\"attributes\":{\"id\":\"fig_12\"}},{\"start\":\"54679\",\"end\":\"54909\",\"attributes\":{\"id\":\"fig_13\"}},{\"start\":\"54910\",\"end\":\"55381\",\"attributes\":{\"id\":\"fig_14\"}},{\"start\":\"55382\",\"end\":\"55603\",\"attributes\":{\"id\":\"fig_15\"}},{\"start\":\"55604\",\"end\":\"55649\",\"attributes\":{\"id\":\"tab_0\",\"type\":\"table\"}},{\"start\":\"55650\",\"end\":\"55866\",\"attributes\":{\"id\":\"tab_1\",\"type\":\"table\"}},{\"start\":\"55867\",\"end\":\"55874\",\"attributes\":{\"id\":\"tab_2\",\"type\":\"table\"}},{\"start\":\"55875\",\"end\":\"55882\",\"attributes\":{\"id\":\"tab_3\",\"type\":\"table\"}},{\"start\":\"55883\",\"end\":\"56052\",\"attributes\":{\"id\":\"tab_4\",\"type\":\"table\"}},{\"start\":\"56053\",\"end\":\"56205\",\"attributes\":{\"id\":\"tab_5\",\"type\":\"table\"}},{\"start\":\"56206\",\"end\":\"56213\",\"attributes\":{\"id\":\"tab_6\",\"type\":\"table\"}}]", "paragraph": "[{\"start\":\"1984\",\"end\":\"2524\"},{\"start\":\"2526\",\"end\":\"3837\"},{\"start\":\"3839\",\"end\":\"5036\"},{\"start\":\"5038\",\"end\":\"6200\"},{\"start\":\"6202\",\"end\":\"8547\"},{\"start\":\"8549\",\"end\":\"9337\"},{\"start\":\"9339\",\"end\":\"9846\"},{\"start\":\"9901\",\"end\":\"10786\"},{\"start\":\"10818\",\"end\":\"11981\"},{\"start\":\"11983\",\"end\":\"13169\"},{\"start\":\"13201\",\"end\":\"15307\"},{\"start\":\"15309\",\"end\":\"15710\"},{\"start\":\"15731\",\"end\":\"15826\"},{\"start\":\"15859\",\"end\":\"16039\"},{\"start\":\"16056\",\"end\":\"16133\"},{\"start\":\"16135\",\"end\":\"16391\"},{\"start\":\"16412\",\"end\":\"16482\"},{\"start\":\"16546\",\"end\":\"16746\"},{\"start\":\"16760\",\"end\":\"17979\"},{\"start\":\"17981\",\"end\":\"18273\"},{\"start\":\"18275\",\"end\":\"18772\"},{\"start\":\"18774\",\"end\":\"19900\"},{\"start\":\"19902\",\"end\":\"20850\"},{\"start\":\"20852\",\"end\":\"22571\"},{\"start\":\"22613\",\"end\":\"23470\"},{\"start\":\"23533\",\"end\":\"24008\"},{\"start\":\"24010\",\"end\":\"24015\"},{\"start\":\"24056\",\"end\":\"24971\"},{\"start\":\"24973\",\"end\":\"27830\"},{\"start\":\"27832\",\"end\":\"28282\"},{\"start\":\"28284\",\"end\":\"28901\"},{\"start\":\"28932\",\"end\":\"30234\"},{\"start\":\"30251\",\"end\":\"30792\"},{\"start\":\"30794\",\"end\":\"31143\"},{\"start\":\"31145\",\"end\":\"31715\"},{\"start\":\"31717\",\"end\":\"32116\"},{\"start\":\"32135\",\"end\":\"32746\"},{\"start\":\"32848\",\"end\":\"34970\"},{\"start\":\"34972\",\"end\":\"36295\"},{\"start\":\"36416\",\"end\":\"37499\"},{\"start\":\"37501\",\"end\":\"39034\"},{\"start\":\"39090\",\"end\":\"39463\"},{\"start\":\"39465\",\"end\":\"40767\"},{\"start\":\"40769\",\"end\":\"41738\"},{\"start\":\"41740\",\"end\":\"42837\"},{\"start\":\"42839\",\"end\":\"44000\"},{\"start\":\"44002\",\"end\":\"44131\"},{\"start\":\"44173\",\"end\":\"45437\"},{\"start\":\"45439\",\"end\":\"46501\"},{\"start\":\"46503\",\"end\":\"46908\"},{\"start\":\"46910\",\"end\":\"47936\"},{\"start\":\"47955\",\"end\":\"48166\"},{\"start\":\"48168\",\"end\":\"48794\"},{\"start\":\"48796\",\"end\":\"49371\"},{\"start\":\"49373\",\"end\":\"50918\"}]", "formula": "[{\"start\":\"15827\",\"end\":\"15858\",\"attributes\":{\"id\":\"formula_0\"}},{\"start\":\"16040\",\"end\":\"16055\",\"attributes\":{\"id\":\"formula_1\"}},{\"start\":\"16392\",\"end\":\"16411\",\"attributes\":{\"id\":\"formula_2\"}},{\"start\":\"16483\",\"end\":\"16545\",\"attributes\":{\"id\":\"formula_3\"}},{\"start\":\"32747\",\"end\":\"32811\",\"attributes\":{\"id\":\"formula_4\"}}]", "table_ref": "[{\"start\":\"13373\",\"end\":\"13380\",\"attributes\":{\"ref_id\":\"tab_0\"}},{\"start\":\"17970\",\"end\":\"17978\",\"attributes\":{\"ref_id\":\"tab_0\"}},{\"start\":\"18264\",\"end\":\"18272\",\"attributes\":{\"ref_id\":\"tab_0\"}},{\"start\":\"18395\",\"end\":\"18403\",\"attributes\":{\"ref_id\":\"tab_0\"}},{\"start\":\"19747\",\"end\":\"19756\",\"attributes\":{\"ref_id\":\"tab_0\"}},{\"start\":\"19890\",\"end\":\"19899\",\"attributes\":{\"ref_id\":\"tab_0\"}},{\"start\":\"20573\",\"end\":\"20581\",\"attributes\":{\"ref_id\":\"tab_0\"}},{\"start\":\"21731\",\"end\":\"21809\",\"attributes\":{\"ref_id\":\"tab_0\"}},{\"start\":\"22417\",\"end\":\"22425\",\"attributes\":{\"ref_id\":\"tab_0\"}},{\"start\":\"22431\",\"end\":\"22439\",\"attributes\":{\"ref_id\":\"tab_0\"}},{\"start\":\"24790\",\"end\":\"24798\",\"attributes\":{\"ref_id\":\"tab_0\"}},{\"start\":\"25147\",\"end\":\"25154\"},{\"start\":\"25300\",\"end\":\"25429\",\"attributes\":{\"ref_id\":\"tab_0\"}},{\"start\":\"26489\",\"end\":\"26498\",\"attributes\":{\"ref_id\":\"tab_0\"}},{\"start\":\"27867\",\"end\":\"27876\",\"attributes\":{\"ref_id\":\"tab_0\"}},{\"start\":\"28019\",\"end\":\"28156\",\"attributes\":{\"ref_id\":\"tab_0\"}},{\"start\":\"29635\",\"end\":\"29643\",\"attributes\":{\"ref_id\":\"tab_0\"}},{\"start\":\"29774\",\"end\":\"29782\",\"attributes\":{\"ref_id\":\"tab_0\"}},{\"start\":\"31705\",\"end\":\"31714\",\"attributes\":{\"ref_id\":\"tab_0\"}},{\"start\":\"33018\",\"end\":\"33028\",\"attributes\":{\"ref_id\":\"tab_0\"}},{\"start\":\"39214\",\"end\":\"39222\",\"attributes\":{\"ref_id\":\"tab_0\"}},{\"start\":\"39485\",\"end\":\"39493\",\"attributes\":{\"ref_id\":\"tab_0\"}},{\"start\":\"40901\",\"end\":\"40909\",\"attributes\":{\"ref_id\":\"tab_0\"}},{\"start\":\"43151\",\"end\":\"43159\",\"attributes\":{\"ref_id\":\"tab_0\"}},{\"start\":\"43414\",\"end\":\"43527\",\"attributes\":{\"ref_id\":\"tab_0\"}}]", "section_header": "[{\"start\":\"9849\",\"end\":\"9867\"},{\"start\":\"9870\",\"end\":\"9899\"},{\"start\":\"10789\",\"end\":\"10816\"},{\"start\":\"13172\",\"end\":\"13199\"},{\"start\":\"15713\",\"end\":\"15729\"},{\"start\":\"16749\",\"end\":\"16758\"},{\"start\":\"22574\",\"end\":\"22611\"},{\"start\":\"23473\",\"end\":\"23531\"},{\"start\":\"24018\",\"end\":\"24054\"},{\"start\":\"28904\",\"end\":\"28930\"},{\"start\":\"30237\",\"end\":\"30249\"},{\"start\":\"32119\",\"end\":\"32133\"},{\"start\":\"32813\",\"end\":\"32846\"},{\"start\":\"36298\",\"end\":\"36324\"},{\"start\":\"36327\",\"end\":\"36360\"},{\"start\":\"36363\",\"end\":\"36414\"},{\"start\":\"39037\",\"end\":\"39088\"},{\"start\":\"44134\",\"end\":\"44171\"},{\"start\":\"47939\",\"end\":\"47953\"},{\"start\":\"50920\",\"end\":\"50928\"},{\"start\":\"50986\",\"end\":\"50994\"},{\"start\":\"51132\",\"end\":\"51140\"},{\"start\":\"51201\",\"end\":\"51209\"},{\"start\":\"51820\",\"end\":\"51828\"},{\"start\":\"52310\",\"end\":\"52318\"},{\"start\":\"52490\",\"end\":\"52498\"},{\"start\":\"52691\",\"end\":\"52699\"},{\"start\":\"52838\",\"end\":\"52846\"},{\"start\":\"53902\",\"end\":\"53911\"},{\"start\":\"54339\",\"end\":\"54348\"},{\"start\":\"54680\",\"end\":\"54689\"},{\"start\":\"54911\",\"end\":\"54920\"},{\"start\":\"55383\",\"end\":\"55392\"},{\"start\":\"55605\",\"end\":\"55620\"},{\"start\":\"55651\",\"end\":\"55666\"},{\"start\":\"55868\",\"end\":\"55873\"},{\"start\":\"55876\",\"end\":\"55881\"},{\"start\":\"55884\",\"end\":\"55898\"},{\"start\":\"56054\",\"end\":\"56069\"},{\"start\":\"56207\",\"end\":\"56212\"}]", "table": "[{\"start\":\"55647\",\"end\":\"55649\"}]", "figure_caption": "[{\"start\":\"50930\",\"end\":\"50984\"},{\"start\":\"50996\",\"end\":\"51130\"},{\"start\":\"51142\",\"end\":\"51199\"},{\"start\":\"51211\",\"end\":\"51446\"},{\"start\":\"51449\",\"end\":\"51818\"},{\"start\":\"51830\",\"end\":\"52308\"},{\"start\":\"52320\",\"end\":\"52488\"},{\"start\":\"52500\",\"end\":\"52689\"},{\"start\":\"52701\",\"end\":\"52836\"},{\"start\":\"52848\",\"end\":\"53292\"},{\"start\":\"53295\",\"end\":\"53900\"},{\"start\":\"53914\",\"end\":\"54337\"},{\"start\":\"54351\",\"end\":\"54678\"},{\"start\":\"54692\",\"end\":\"54909\"},{\"start\":\"54923\",\"end\":\"55381\"},{\"start\":\"55395\",\"end\":\"55603\"},{\"start\":\"55622\",\"end\":\"55647\"},{\"start\":\"55669\",\"end\":\"55866\"},{\"start\":\"55902\",\"end\":\"56052\"},{\"start\":\"56074\",\"end\":\"56205\"}]", "figure_ref": "[{\"start\":\"10282\",\"end\":\"10288\",\"attributes\":{\"ref_id\":\"fig_0\"}},{\"start\":\"11974\",\"end\":\"11980\",\"attributes\":{\"ref_id\":\"fig_1\"}},{\"start\":\"13238\",\"end\":\"13244\",\"attributes\":{\"ref_id\":\"fig_2\"}},{\"start\":\"17916\",\"end\":\"17922\",\"attributes\":{\"ref_id\":\"fig_3\"}},{\"start\":\"24001\",\"end\":\"24007\",\"attributes\":{\"ref_id\":\"fig_5\"}},{\"start\":\"25617\",\"end\":\"25623\",\"attributes\":{\"ref_id\":\"fig_6\"}},{\"start\":\"25848\",\"end\":\"25857\",\"attributes\":{\"ref_id\":\"fig_6\"}},{\"start\":\"26675\",\"end\":\"26681\",\"attributes\":{\"ref_id\":\"fig_7\"}},{\"start\":\"26695\",\"end\":\"26704\",\"attributes\":{\"ref_id\":\"fig_7\"}},{\"start\":\"27225\",\"end\":\"27242\",\"attributes\":{\"ref_id\":\"fig_7\"}},{\"start\":\"27539\",\"end\":\"27556\",\"attributes\":{\"ref_id\":\"fig_7\"}},{\"start\":\"28644\",\"end\":\"28653\",\"attributes\":{\"ref_id\":\"fig_7\"}},{\"start\":\"31334\",\"end\":\"31340\",\"attributes\":{\"ref_id\":\"fig_8\"}},{\"start\":\"35470\",\"end\":\"35479\",\"attributes\":{\"ref_id\":\"fig_9\"}},{\"start\":\"35847\",\"end\":\"35856\",\"attributes\":{\"ref_id\":\"fig_9\"}},{\"start\":\"35908\",\"end\":\"35917\",\"attributes\":{\"ref_id\":\"fig_9\"}},{\"start\":\"36049\",\"end\":\"36055\",\"attributes\":{\"ref_id\":\"fig_9\"}},{\"start\":\"36477\",\"end\":\"36487\",\"attributes\":{\"ref_id\":\"fig_0\"}},{\"start\":\"37060\",\"end\":\"37070\",\"attributes\":{\"ref_id\":\"fig_0\"}},{\"start\":\"37647\",\"end\":\"37654\",\"attributes\":{\"ref_id\":\"fig_0\"}},{\"start\":\"44254\",\"end\":\"44264\",\"attributes\":{\"ref_id\":\"fig_0\"}},{\"start\":\"44643\",\"end\":\"44653\",\"attributes\":{\"ref_id\":\"fig_0\"}},{\"start\":\"44714\",\"end\":\"44724\",\"attributes\":{\"ref_id\":\"fig_0\"}},{\"start\":\"44817\",\"end\":\"44827\",\"attributes\":{\"ref_id\":\"fig_0\"}},{\"start\":\"44853\",\"end\":\"44863\",\"attributes\":{\"ref_id\":\"fig_0\"}},{\"start\":\"44948\",\"end\":\"44958\",\"attributes\":{\"ref_id\":\"fig_0\"}},{\"start\":\"45112\",\"end\":\"45122\",\"attributes\":{\"ref_id\":\"fig_0\"}},{\"start\":\"45426\",\"end\":\"45436\",\"attributes\":{\"ref_id\":\"fig_0\"}},{\"start\":\"45597\",\"end\":\"45607\",\"attributes\":{\"ref_id\":\"fig_0\"}},{\"start\":\"45926\",\"end\":\"45936\",\"attributes\":{\"ref_id\":\"fig_0\"}},{\"start\":\"46207\",\"end\":\"46217\",\"attributes\":{\"ref_id\":\"fig_0\"}},{\"start\":\"46351\",\"end\":\"46358\",\"attributes\":{\"ref_id\":\"fig_0\"}},{\"start\":\"46815\",\"end\":\"46821\",\"attributes\":{\"ref_id\":\"fig_6\"}},{\"start\":\"46921\",\"end\":\"46931\",\"attributes\":{\"ref_id\":\"fig_0\"}},{\"start\":\"47530\",\"end\":\"47540\",\"attributes\":{\"ref_id\":\"fig_0\"}},{\"start\":\"47685\",\"end\":\"47695\",\"attributes\":{\"ref_id\":\"fig_0\"}},{\"start\":\"47879\",\"end\":\"47889\",\"attributes\":{\"ref_id\":\"fig_0\"}}]", "bib_author_first_name": "[{\"start\":\"56917\",\"end\":\"56918\"},{\"start\":\"56919\",\"end\":\"56920\"},{\"start\":\"57251\",\"end\":\"57252\"},{\"start\":\"57253\",\"end\":\"57254\"},{\"start\":\"57266\",\"end\":\"57267\"},{\"start\":\"57277\",\"end\":\"57278\"},{\"start\":\"57286\",\"end\":\"57287\"},{\"start\":\"57294\",\"end\":\"57295\"},{\"start\":\"57296\",\"end\":\"57297\"},{\"start\":\"57659\",\"end\":\"57660\"},{\"start\":\"57663\",\"end\":\"57664\"},{\"start\":\"57665\",\"end\":\"57666\"},{\"start\":\"57996\",\"end\":\"57997\"},{\"start\":\"58004\",\"end\":\"58005\"},{\"start\":\"58006\",\"end\":\"58007\"},{\"start\":\"58013\",\"end\":\"58014\"},{\"start\":\"58015\",\"end\":\"58016\"},{\"start\":\"58428\",\"end\":\"58429\"},{\"start\":\"58430\",\"end\":\"58431\"},{\"start\":\"58439\",\"end\":\"58440\"},{\"start\":\"58446\",\"end\":\"58447\"},{\"start\":\"58448\",\"end\":\"58449\"},{\"start\":\"58822\",\"end\":\"58823\"},{\"start\":\"58830\",\"end\":\"58831\"},{\"start\":\"59226\",\"end\":\"59227\"},{\"start\":\"59228\",\"end\":\"59229\"},{\"start\":\"59516\",\"end\":\"59517\"},{\"start\":\"59518\",\"end\":\"59519\"},{\"start\":\"59766\",\"end\":\"59767\"},{\"start\":\"59768\",\"end\":\"59769\"},{\"start\":\"60036\",\"end\":\"60037\"},{\"start\":\"60046\",\"end\":\"60047\"},{\"start\":\"60365\",\"end\":\"60366\"},{\"start\":\"60827\",\"end\":\"60828\"},{\"start\":\"60829\",\"end\":\"60830\"},{\"start\":\"60840\",\"end\":\"60841\"},{\"start\":\"60842\",\"end\":\"60843\"},{\"start\":\"61210\",\"end\":\"61211\"},{\"start\":\"61212\",\"end\":\"61213\"},{\"start\":\"61485\",\"end\":\"61486\"},{\"start\":\"61487\",\"end\":\"61488\"},{\"start\":\"61493\",\"end\":\"61494\"},{\"start\":\"61495\",\"end\":\"61496\"},{\"start\":\"61502\",\"end\":\"61503\"},{\"start\":\"61508\",\"end\":\"61509\"},{\"start\":\"61510\",\"end\":\"61511\"},{\"start\":\"61829\",\"end\":\"61830\"},{\"start\":\"61831\",\"end\":\"61832\"},{\"start\":\"61842\",\"end\":\"61843\"},{\"start\":\"61844\",\"end\":\"61845\"},{\"start\":\"62189\",\"end\":\"62190\"},{\"start\":\"62191\",\"end\":\"62192\"},{\"start\":\"62202\",\"end\":\"62203\"},{\"start\":\"62204\",\"end\":\"62205\"},{\"start\":\"62215\",\"end\":\"62216\"},{\"start\":\"62217\",\"end\":\"62218\"},{\"start\":\"62562\",\"end\":\"62563\"},{\"start\":\"62564\",\"end\":\"62565\"},{\"start\":\"62575\",\"end\":\"62576\"},{\"start\":\"62577\",\"end\":\"62578\"},{\"start\":\"62588\",\"end\":\"62589\"},{\"start\":\"62590\",\"end\":\"62591\"},{\"start\":\"62912\",\"end\":\"62913\"},{\"start\":\"62914\",\"end\":\"62915\"},{\"start\":\"62925\",\"end\":\"62926\"},{\"start\":\"62927\",\"end\":\"62928\"},{\"start\":\"62935\",\"end\":\"62936\"},{\"start\":\"62937\",\"end\":\"62938\"},{\"start\":\"62958\",\"end\":\"62959\"},{\"start\":\"62960\",\"end\":\"62961\"},{\"start\":\"62971\",\"end\":\"62972\"},{\"start\":\"62973\",\"end\":\"62974\"},{\"start\":\"63347\",\"end\":\"63351\"},{\"start\":\"63357\",\"end\":\"63361\"},{\"start\":\"63367\",\"end\":\"63371\"},{\"start\":\"63377\",\"end\":\"63381\"},{\"start\":\"63718\",\"end\":\"63719\"},{\"start\":\"63726\",\"end\":\"63727\"},{\"start\":\"63734\",\"end\":\"63735\"},{\"start\":\"63741\",\"end\":\"63742\"},{\"start\":\"64066\",\"end\":\"64067\"},{\"start\":\"64077\",\"end\":\"64078\"},{\"start\":\"64403\",\"end\":\"64404\"},{\"start\":\"64410\",\"end\":\"64411\"},{\"start\":\"64416\",\"end\":\"64417\"},{\"start\":\"64731\",\"end\":\"64732\"},{\"start\":\"64738\",\"end\":\"64739\"},{\"start\":\"64747\",\"end\":\"64748\"},{\"start\":\"65081\",\"end\":\"65082\"},{\"start\":\"65409\",\"end\":\"65410\"},{\"start\":\"65411\",\"end\":\"65412\"},{\"start\":\"65418\",\"end\":\"65419\"},{\"start\":\"65420\",\"end\":\"65421\"},{\"start\":\"65429\",\"end\":\"65430\"},{\"start\":\"65431\",\"end\":\"65432\"},{\"start\":\"65438\",\"end\":\"65439\"},{\"start\":\"65440\",\"end\":\"65441\"},{\"start\":\"65446\",\"end\":\"65447\"},{\"start\":\"65448\",\"end\":\"65449\"},{\"start\":\"65828\",\"end\":\"65829\"},{\"start\":\"65830\",\"end\":\"65831\"},{\"start\":\"65839\",\"end\":\"65840\"},{\"start\":\"65846\",\"end\":\"65847\"},{\"start\":\"65848\",\"end\":\"65849\"},{\"start\":\"65855\",\"end\":\"65856\"},{\"start\":\"65857\",\"end\":\"65858\"},{\"start\":\"65863\",\"end\":\"65864\"},{\"start\":\"65865\",\"end\":\"65866\"},{\"start\":\"66282\",\"end\":\"66283\"},{\"start\":\"66284\",\"end\":\"66285\"},{\"start\":\"66293\",\"end\":\"66294\"},{\"start\":\"66295\",\"end\":\"66296\"},{\"start\":\"66303\",\"end\":\"66304\"},{\"start\":\"66305\",\"end\":\"66306\"},{\"start\":\"66311\",\"end\":\"66312\"},{\"start\":\"66313\",\"end\":\"66314\"},{\"start\":\"66616\",\"end\":\"66617\"},{\"start\":\"66625\",\"end\":\"66626\"},{\"start\":\"66635\",\"end\":\"66636\"},{\"start\":\"66645\",\"end\":\"66646\"},{\"start\":\"66904\",\"end\":\"66905\"},{\"start\":\"66918\",\"end\":\"66919\"},{\"start\":\"66931\",\"end\":\"66932\"},{\"start\":\"66933\",\"end\":\"66934\"},{\"start\":\"67242\",\"end\":\"67243\"},{\"start\":\"67254\",\"end\":\"67255\"},{\"start\":\"67438\",\"end\":\"67439\"},{\"start\":\"67716\",\"end\":\"67717\"},{\"start\":\"67722\",\"end\":\"67723\"},{\"start\":\"67731\",\"end\":\"67732\"},{\"start\":\"67738\",\"end\":\"67739\"},{\"start\":\"68079\",\"end\":\"68080\"},{\"start\":\"68090\",\"end\":\"68091\"},{\"start\":\"68101\",\"end\":\"68102\"},{\"start\":\"68114\",\"end\":\"68115\"},{\"start\":\"68470\",\"end\":\"68471\"},{\"start\":\"68479\",\"end\":\"68480\"},{\"start\":\"68486\",\"end\":\"68487\"},{\"start\":\"68844\",\"end\":\"68845\"},{\"start\":\"68855\",\"end\":\"68856\"},{\"start\":\"68857\",\"end\":\"68858\"},{\"start\":\"68866\",\"end\":\"68867\"},{\"start\":\"68876\",\"end\":\"68877\"},{\"start\":\"68892\",\"end\":\"68893\"},{\"start\":\"68894\",\"end\":\"68895\"},{\"start\":\"69255\",\"end\":\"69259\"},{\"start\":\"69266\",\"end\":\"69267\"},{\"start\":\"69274\",\"end\":\"69278\"},{\"start\":\"69284\",\"end\":\"69285\"},{\"start\":\"69286\",\"end\":\"69287\"},{\"start\":\"69619\",\"end\":\"69620\"},{\"start\":\"69627\",\"end\":\"69628\"},{\"start\":\"69635\",\"end\":\"69636\"},{\"start\":\"69643\",\"end\":\"69644\"},{\"start\":\"69649\",\"end\":\"69650\"},{\"start\":\"69658\",\"end\":\"69659\"},{\"start\":\"70120\",\"end\":\"70121\"},{\"start\":\"70444\",\"end\":\"70448\"},{\"start\":\"70456\",\"end\":\"70457\"},{\"start\":\"70464\",\"end\":\"70465\"},{\"start\":\"70470\",\"end\":\"70471\"},{\"start\":\"70853\",\"end\":\"70854\"},{\"start\":\"70864\",\"end\":\"70865\"},{\"start\":\"70874\",\"end\":\"70875\"},{\"start\":\"70876\",\"end\":\"70877\"},{\"start\":\"71246\",\"end\":\"71247\"},{\"start\":\"71248\",\"end\":\"71249\"},{\"start\":\"71261\",\"end\":\"71262\"},{\"start\":\"71263\",\"end\":\"71264\"},{\"start\":\"71274\",\"end\":\"71275\"},{\"start\":\"71719\",\"end\":\"71720\"},{\"start\":\"71721\",\"end\":\"71722\"},{\"start\":\"71732\",\"end\":\"71733\"},{\"start\":\"71734\",\"end\":\"71735\"},{\"start\":\"72033\",\"end\":\"72034\"},{\"start\":\"72040\",\"end\":\"72041\"},{\"start\":\"72048\",\"end\":\"72053\"},{\"start\":\"72059\",\"end\":\"72060\"},{\"start\":\"72330\",\"end\":\"72331\"},{\"start\":\"72332\",\"end\":\"72333\"},{\"start\":\"72340\",\"end\":\"72341\"},{\"start\":\"72342\",\"end\":\"72343\"},{\"start\":\"72352\",\"end\":\"72353\"},{\"start\":\"72354\",\"end\":\"72355\"},{\"start\":\"72597\",\"end\":\"72598\"},{\"start\":\"72811\",\"end\":\"72812\"},{\"start\":\"72813\",\"end\":\"72814\"},{\"start\":\"72966\",\"end\":\"72967\"},{\"start\":\"72968\",\"end\":\"72969\"},{\"start\":\"72978\",\"end\":\"72979\"},{\"start\":\"73183\",\"end\":\"73184\"},{\"start\":\"73193\",\"end\":\"73194\"},{\"start\":\"73429\",\"end\":\"73430\"},{\"start\":\"73443\",\"end\":\"73444\"},{\"start\":\"73679\",\"end\":\"73680\"},{\"start\":\"73686\",\"end\":\"73687\"},{\"start\":\"73694\",\"end\":\"73695\"},{\"start\":\"73702\",\"end\":\"73706\"},{\"start\":\"73714\",\"end\":\"73718\"},{\"start\":\"73725\",\"end\":\"73729\"},{\"start\":\"74076\",\"end\":\"74077\"},{\"start\":\"74093\",\"end\":\"74094\"},{\"start\":\"74095\",\"end\":\"74096\"},{\"start\":\"74105\",\"end\":\"74106\"},{\"start\":\"74107\",\"end\":\"74108\"},{\"start\":\"74126\",\"end\":\"74127\"},{\"start\":\"74441\",\"end\":\"74442\"},{\"start\":\"74451\",\"end\":\"74452\"},{\"start\":\"74460\",\"end\":\"74464\"},{\"start\":\"74794\",\"end\":\"74795\"},{\"start\":\"74796\",\"end\":\"74797\"},{\"start\":\"74805\",\"end\":\"74806\"},{\"start\":\"74807\",\"end\":\"74808\"},{\"start\":\"74816\",\"end\":\"74817\"},{\"start\":\"74818\",\"end\":\"74819\"},{\"start\":\"74826\",\"end\":\"74827\"},{\"start\":\"75201\",\"end\":\"75202\"},{\"start\":\"75203\",\"end\":\"75204\"},{\"start\":\"75213\",\"end\":\"75214\"},{\"start\":\"75215\",\"end\":\"75216\"},{\"start\":\"75226\",\"end\":\"75227\"},{\"start\":\"75228\",\"end\":\"75229\"},{\"start\":\"75239\",\"end\":\"75240\"},{\"start\":\"75241\",\"end\":\"75242\"},{\"start\":\"75252\",\"end\":\"75253\"},{\"start\":\"75254\",\"end\":\"75255\"}]", "bib_author_last_name": "[{\"start\":\"56921\",\"end\":\"56927\"},{\"start\":\"57255\",\"end\":\"57264\"},{\"start\":\"57268\",\"end\":\"57275\"},{\"start\":\"57279\",\"end\":\"57284\"},{\"start\":\"57288\",\"end\":\"57292\"},{\"start\":\"57298\",\"end\":\"57307\"},{\"start\":\"57998\",\"end\":\"58002\"},{\"start\":\"58008\",\"end\":\"58011\"},{\"start\":\"58017\",\"end\":\"58021\"},{\"start\":\"58432\",\"end\":\"58437\"},{\"start\":\"58441\",\"end\":\"58444\"},{\"start\":\"58450\",\"end\":\"58453\"},{\"start\":\"58824\",\"end\":\"58828\"},{\"start\":\"58832\",\"end\":\"58837\"},{\"start\":\"59230\",\"end\":\"59236\"},{\"start\":\"59520\",\"end\":\"59526\"},{\"start\":\"59770\",\"end\":\"59776\"},{\"start\":\"60038\",\"end\":\"60044\"},{\"start\":\"60048\",\"end\":\"60054\"},{\"start\":\"60367\",\"end\":\"60372\"},{\"start\":\"60831\",\"end\":\"60838\"},{\"start\":\"60844\",\"end\":\"60850\"},{\"start\":\"61214\",\"end\":\"61220\"},{\"start\":\"61489\",\"end\":\"61491\"},{\"start\":\"61497\",\"end\":\"61500\"},{\"start\":\"61504\",\"end\":\"61506\"},{\"start\":\"61512\",\"end\":\"61516\"},{\"start\":\"61833\",\"end\":\"61840\"},{\"start\":\"61846\",\"end\":\"61852\"},{\"start\":\"62193\",\"end\":\"62200\"},{\"start\":\"62206\",\"end\":\"62213\"},{\"start\":\"62219\",\"end\":\"62222\"},{\"start\":\"62566\",\"end\":\"62573\"},{\"start\":\"62579\",\"end\":\"62586\"},{\"start\":\"62592\",\"end\":\"62595\"},{\"start\":\"62916\",\"end\":\"62923\"},{\"start\":\"62929\",\"end\":\"62933\"},{\"start\":\"62939\",\"end\":\"62956\"},{\"start\":\"62962\",\"end\":\"62969\"},{\"start\":\"62975\",\"end\":\"62978\"},{\"start\":\"63352\",\"end\":\"63355\"},{\"start\":\"63362\",\"end\":\"63365\"},{\"start\":\"63372\",\"end\":\"63375\"},{\"start\":\"63382\",\"end\":\"63386\"},{\"start\":\"63720\",\"end\":\"63724\"},{\"start\":\"63728\",\"end\":\"63732\"},{\"start\":\"63736\",\"end\":\"63739\"},{\"start\":\"63743\",\"end\":\"63747\"},{\"start\":\"64068\",\"end\":\"64075\"},{\"start\":\"64079\",\"end\":\"64087\"},{\"start\":\"64405\",\"end\":\"64408\"},{\"start\":\"64412\",\"end\":\"64414\"},{\"start\":\"64418\",\"end\":\"64421\"},{\"start\":\"64733\",\"end\":\"64736\"},{\"start\":\"64740\",\"end\":\"64745\"},{\"start\":\"64749\",\"end\":\"64757\"},{\"start\":\"65083\",\"end\":\"65087\"},{\"start\":\"65413\",\"end\":\"65416\"},{\"start\":\"65422\",\"end\":\"65427\"},{\"start\":\"65433\",\"end\":\"65436\"},{\"start\":\"65442\",\"end\":\"65444\"},{\"start\":\"65450\",\"end\":\"65452\"},{\"start\":\"65832\",\"end\":\"65837\"},{\"start\":\"65841\",\"end\":\"65844\"},{\"start\":\"65850\",\"end\":\"65853\"},{\"start\":\"65859\",\"end\":\"65861\"},{\"start\":\"65867\",\"end\":\"65869\"},{\"start\":\"66286\",\"end\":\"66291\"},{\"start\":\"66297\",\"end\":\"66301\"},{\"start\":\"66307\",\"end\":\"66309\"},{\"start\":\"66315\",\"end\":\"66317\"},{\"start\":\"66618\",\"end\":\"66623\"},{\"start\":\"66627\",\"end\":\"66633\"},{\"start\":\"66637\",\"end\":\"66643\"},{\"start\":\"66647\",\"end\":\"66654\"},{\"start\":\"66906\",\"end\":\"66916\"},{\"start\":\"66920\",\"end\":\"66929\"},{\"start\":\"66935\",\"end\":\"66941\"},{\"start\":\"67244\",\"end\":\"67252\"},{\"start\":\"67256\",\"end\":\"67265\"},{\"start\":\"67440\",\"end\":\"67447\"},{\"start\":\"67718\",\"end\":\"67720\"},{\"start\":\"67724\",\"end\":\"67729\"},{\"start\":\"67733\",\"end\":\"67736\"},{\"start\":\"67740\",\"end\":\"67743\"},{\"start\":\"68081\",\"end\":\"68088\"},{\"start\":\"68092\",\"end\":\"68099\"},{\"start\":\"68103\",\"end\":\"68112\"},{\"start\":\"68116\",\"end\":\"68121\"},{\"start\":\"68472\",\"end\":\"68477\"},{\"start\":\"68481\",\"end\":\"68484\"},{\"start\":\"68488\",\"end\":\"68492\"},{\"start\":\"68846\",\"end\":\"68853\"},{\"start\":\"68859\",\"end\":\"68864\"},{\"start\":\"68868\",\"end\":\"68874\"},{\"start\":\"68878\",\"end\":\"68890\"},{\"start\":\"68896\",\"end\":\"68901\"},{\"start\":\"69260\",\"end\":\"69264\"},{\"start\":\"69268\",\"end\":\"69272\"},{\"start\":\"69279\",\"end\":\"69282\"},{\"start\":\"69288\",\"end\":\"69296\"},{\"start\":\"69621\",\"end\":\"69625\"},{\"start\":\"69629\",\"end\":\"69633\"},{\"start\":\"69637\",\"end\":\"69641\"},{\"start\":\"69645\",\"end\":\"69647\"},{\"start\":\"69651\",\"end\":\"69656\"},{\"start\":\"69660\",\"end\":\"69663\"},{\"start\":\"70122\",\"end\":\"70128\"},{\"start\":\"70449\",\"end\":\"70454\"},{\"start\":\"70458\",\"end\":\"70462\"},{\"start\":\"70466\",\"end\":\"70468\"},{\"start\":\"70472\",\"end\":\"70476\"},{\"start\":\"70855\",\"end\":\"70862\"},{\"start\":\"70866\",\"end\":\"70872\"},{\"start\":\"70878\",\"end\":\"70885\"},{\"start\":\"71250\",\"end\":\"71259\"},{\"start\":\"71265\",\"end\":\"71272\"},{\"start\":\"71276\",\"end\":\"71282\"},{\"start\":\"71723\",\"end\":\"71730\"},{\"start\":\"71736\",\"end\":\"71744\"},{\"start\":\"72035\",\"end\":\"72038\"},{\"start\":\"72042\",\"end\":\"72046\"},{\"start\":\"72054\",\"end\":\"72057\"},{\"start\":\"72061\",\"end\":\"72069\"},{\"start\":\"72334\",\"end\":\"72338\"},{\"start\":\"72344\",\"end\":\"72350\"},{\"start\":\"72356\",\"end\":\"72358\"},{\"start\":\"72599\",\"end\":\"72607\"},{\"start\":\"72815\",\"end\":\"72821\"},{\"start\":\"72970\",\"end\":\"72976\"},{\"start\":\"72980\",\"end\":\"72982\"},{\"start\":\"73185\",\"end\":\"73191\"},{\"start\":\"73195\",\"end\":\"73202\"},{\"start\":\"73431\",\"end\":\"73441\"},{\"start\":\"73445\",\"end\":\"73456\"},{\"start\":\"73681\",\"end\":\"73684\"},{\"start\":\"73688\",\"end\":\"73692\"},{\"start\":\"73696\",\"end\":\"73700\"},{\"start\":\"73707\",\"end\":\"73712\"},{\"start\":\"73719\",\"end\":\"73723\"},{\"start\":\"73730\",\"end\":\"73733\"},{\"start\":\"74078\",\"end\":\"74091\"},{\"start\":\"74097\",\"end\":\"74103\"},{\"start\":\"74109\",\"end\":\"74124\"},{\"start\":\"74128\",\"end\":\"74133\"},{\"start\":\"74443\",\"end\":\"74449\"},{\"start\":\"74453\",\"end\":\"74458\"},{\"start\":\"74465\",\"end\":\"74471\"},{\"start\":\"74798\",\"end\":\"74803\"},{\"start\":\"74809\",\"end\":\"74814\"},{\"start\":\"74820\",\"end\":\"74824\"},{\"start\":\"74828\",\"end\":\"74832\"},{\"start\":\"75205\",\"end\":\"75211\"},{\"start\":\"75217\",\"end\":\"75224\"},{\"start\":\"75230\",\"end\":\"75237\"},{\"start\":\"75243\",\"end\":\"75250\"},{\"start\":\"75256\",\"end\":\"75261\"}]", "bib_entry": "[{\"start\":\"56826\",\"end\":\"57138\",\"attributes\":{\"matched_paper_id\":\"18073018\",\"id\":\"b0\"}},{\"start\":\"57140\",\"end\":\"57595\",\"attributes\":{\"matched_paper_id\":\"129514633\",\"id\":\"b1\"}},{\"start\":\"57597\",\"end\":\"57876\",\"attributes\":{\"matched_paper_id\":\"23066214\",\"id\":\"b2\"}},{\"start\":\"57878\",\"end\":\"58278\",\"attributes\":{\"matched_paper_id\":\"96483515\",\"id\":\"b3\"}},{\"start\":\"58280\",\"end\":\"58718\",\"attributes\":{\"matched_paper_id\":\"126107311\",\"id\":\"b4\"}},{\"start\":\"58720\",\"end\":\"59123\",\"attributes\":{\"matched_paper_id\":\"208038470\",\"id\":\"b5\"}},{\"start\":\"59125\",\"end\":\"59438\",\"attributes\":{\"matched_paper_id\":\"133986392\",\"id\":\"b6\"}},{\"start\":\"59440\",\"end\":\"59706\",\"attributes\":{\"matched_paper_id\":\"122471461\",\"id\":\"b7\"}},{\"start\":\"59708\",\"end\":\"59958\",\"attributes\":{\"matched_paper_id\":\"204255065\",\"id\":\"b8\"}},{\"start\":\"59960\",\"end\":\"60303\",\"attributes\":{\"id\":\"b9\"}},{\"start\":\"60305\",\"end\":\"60662\",\"attributes\":{\"id\":\"b10\"}},{\"start\":\"60664\",\"end\":\"61129\",\"attributes\":{\"matched_paper_id\":\"120903253\",\"id\":\"b11\"}},{\"start\":\"61131\",\"end\":\"61407\",\"attributes\":{\"matched_paper_id\":\"10540360\",\"id\":\"b12\"}},{\"start\":\"61409\",\"end\":\"61719\",\"attributes\":{\"id\":\"b13\"}},{\"start\":\"61721\",\"end\":\"62075\",\"attributes\":{\"matched_paper_id\":\"181637375\",\"id\":\"b14\"}},{\"start\":\"62077\",\"end\":\"62496\",\"attributes\":{\"matched_paper_id\":\"9213593\",\"id\":\"b15\"}},{\"start\":\"62498\",\"end\":\"62792\",\"attributes\":{\"matched_paper_id\":\"14623536\",\"id\":\"b16\"}},{\"start\":\"62794\",\"end\":\"63266\",\"attributes\":{\"matched_paper_id\":\"17696166\",\"id\":\"b17\"}},{\"start\":\"63268\",\"end\":\"63607\",\"attributes\":{\"matched_paper_id\":\"123476255\",\"id\":\"b18\"}},{\"start\":\"63609\",\"end\":\"63963\",\"attributes\":{\"matched_paper_id\":\"17356158\",\"id\":\"b19\"}},{\"start\":\"63965\",\"end\":\"64308\",\"attributes\":{\"matched_paper_id\":\"121977007\",\"id\":\"b20\"}},{\"start\":\"64310\",\"end\":\"64625\",\"attributes\":{\"matched_paper_id\":\"201315010\",\"id\":\"b21\"}},{\"start\":\"64627\",\"end\":\"64984\",\"attributes\":{\"matched_paper_id\":\"201090391\",\"id\":\"b22\"}},{\"start\":\"64986\",\"end\":\"65284\",\"attributes\":{\"matched_paper_id\":\"53874755\",\"id\":\"b23\"}},{\"start\":\"65286\",\"end\":\"65713\",\"attributes\":{\"id\":\"b24\"}},{\"start\":\"65715\",\"end\":\"66181\",\"attributes\":{\"matched_paper_id\":\"90263582\",\"id\":\"b25\"}},{\"start\":\"66183\",\"end\":\"66557\",\"attributes\":{\"matched_paper_id\":\"125965455\",\"id\":\"b26\"}},{\"start\":\"66559\",\"end\":\"66837\",\"attributes\":{\"matched_paper_id\":\"14542261\",\"id\":\"b27\"}},{\"start\":\"66839\",\"end\":\"67172\",\"attributes\":{\"matched_paper_id\":\"195908774\",\"id\":\"b28\"}},{\"start\":\"67174\",\"end\":\"67404\",\"attributes\":{\"id\":\"b29\",\"doi\":\"arXiv:1409.1556\"}},{\"start\":\"67406\",\"end\":\"67668\",\"attributes\":{\"matched_paper_id\":\"206592484\",\"id\":\"b30\"}},{\"start\":\"67670\",\"end\":\"67994\",\"attributes\":{\"matched_paper_id\":\"206594692\",\"id\":\"b31\"}},{\"start\":\"67996\",\"end\":\"68346\",\"attributes\":{\"matched_paper_id\":\"1023605\",\"id\":\"b32\"}},{\"start\":\"68348\",\"end\":\"68761\",\"attributes\":{\"matched_paper_id\":\"204201172\",\"id\":\"b33\"}},{\"start\":\"68763\",\"end\":\"69153\",\"attributes\":{\"matched_paper_id\":\"7113724\",\"id\":\"b34\"}},{\"start\":\"69155\",\"end\":\"69533\",\"attributes\":{\"matched_paper_id\":\"126747591\",\"id\":\"b35\"}},{\"start\":\"69535\",\"end\":\"70021\",\"attributes\":{\"matched_paper_id\":\"204701835\",\"id\":\"b36\"}},{\"start\":\"70023\",\"end\":\"70330\",\"attributes\":{\"matched_paper_id\":\"199511451\",\"id\":\"b37\"}},{\"start\":\"70332\",\"end\":\"70750\",\"attributes\":{\"matched_paper_id\":\"34812784\",\"id\":\"b38\"}},{\"start\":\"70752\",\"end\":\"71123\",\"attributes\":{\"matched_paper_id\":\"133111253\",\"id\":\"b39\"}},{\"start\":\"71125\",\"end\":\"71597\",\"attributes\":{\"matched_paper_id\":\"54443158\",\"id\":\"b40\"}},{\"start\":\"71599\",\"end\":\"71987\",\"attributes\":{\"matched_paper_id\":\"14110182\",\"id\":\"b41\"}},{\"start\":\"71989\",\"end\":\"72263\",\"attributes\":{\"matched_paper_id\":\"49867180\",\"id\":\"b42\"}},{\"start\":\"72265\",\"end\":\"72583\",\"attributes\":{\"matched_paper_id\":\"16489696\",\"id\":\"b43\"}},{\"start\":\"72585\",\"end\":\"72765\",\"attributes\":{\"matched_paper_id\":\"206770307\",\"id\":\"b44\"}},{\"start\":\"72767\",\"end\":\"72920\",\"attributes\":{\"id\":\"b45\",\"doi\":\"arXiv:1212.5701\"}},{\"start\":\"72922\",\"end\":\"73091\",\"attributes\":{\"id\":\"b46\",\"doi\":\"arXiv:1412.6980\"}},{\"start\":\"73093\",\"end\":\"73403\",\"attributes\":{\"matched_paper_id\":\"134693408\",\"id\":\"b47\"}},{\"start\":\"73405\",\"end\":\"73591\",\"attributes\":{\"matched_paper_id\":\"1915014\",\"id\":\"b48\"}},{\"start\":\"73593\",\"end\":\"73985\",\"attributes\":{\"matched_paper_id\":\"6352419\",\"id\":\"b49\"}},{\"start\":\"73987\",\"end\":\"74382\",\"attributes\":{\"matched_paper_id\":\"135372048\",\"id\":\"b50\"}},{\"start\":\"74384\",\"end\":\"74669\",\"attributes\":{\"matched_paper_id\":\"197472921\",\"id\":\"b51\"}},{\"start\":\"74671\",\"end\":\"75086\",\"attributes\":{\"matched_paper_id\":\"210303908\",\"id\":\"b52\"}},{\"start\":\"75088\",\"end\":\"75535\",\"attributes\":{\"matched_paper_id\":\"44411771\",\"id\":\"b53\"}}]", "bib_title": "[{\"start\":\"56826\",\"end\":\"56915\"},{\"start\":\"57140\",\"end\":\"57249\"},{\"start\":\"57597\",\"end\":\"57657\"},{\"start\":\"57878\",\"end\":\"57994\"},{\"start\":\"58280\",\"end\":\"58426\"},{\"start\":\"58720\",\"end\":\"58820\"},{\"start\":\"59125\",\"end\":\"59224\"},{\"start\":\"59440\",\"end\":\"59514\"},{\"start\":\"59708\",\"end\":\"59764\"},{\"start\":\"59960\",\"end\":\"60034\"},{\"start\":\"60305\",\"end\":\"60363\"},{\"start\":\"60664\",\"end\":\"60825\"},{\"start\":\"61131\",\"end\":\"61208\"},{\"start\":\"61409\",\"end\":\"61483\"},{\"start\":\"61721\",\"end\":\"61827\"},{\"start\":\"62077\",\"end\":\"62187\"},{\"start\":\"62498\",\"end\":\"62560\"},{\"start\":\"62794\",\"end\":\"62910\"},{\"start\":\"63268\",\"end\":\"63345\"},{\"start\":\"63609\",\"end\":\"63716\"},{\"start\":\"63965\",\"end\":\"64064\"},{\"start\":\"64310\",\"end\":\"64401\"},{\"start\":\"64627\",\"end\":\"64729\"},{\"start\":\"64986\",\"end\":\"65079\"},{\"start\":\"65286\",\"end\":\"65407\"},{\"start\":\"65715\",\"end\":\"65826\"},{\"start\":\"66183\",\"end\":\"66280\"},{\"start\":\"66559\",\"end\":\"66614\"},{\"start\":\"66839\",\"end\":\"66902\"},{\"start\":\"67406\",\"end\":\"67436\"},{\"start\":\"67670\",\"end\":\"67714\"},{\"start\":\"67996\",\"end\":\"68077\"},{\"start\":\"68348\",\"end\":\"68468\"},{\"start\":\"68763\",\"end\":\"68842\"},{\"start\":\"69155\",\"end\":\"69253\"},{\"start\":\"69535\",\"end\":\"69617\"},{\"start\":\"70023\",\"end\":\"70118\"},{\"start\":\"70332\",\"end\":\"70442\"},{\"start\":\"70752\",\"end\":\"70851\"},{\"start\":\"71125\",\"end\":\"71244\"},{\"start\":\"71599\",\"end\":\"71717\"},{\"start\":\"71989\",\"end\":\"72031\"},{\"start\":\"72265\",\"end\":\"72328\"},{\"start\":\"72585\",\"end\":\"72595\"},{\"start\":\"73093\",\"end\":\"73181\"},{\"start\":\"73405\",\"end\":\"73427\"},{\"start\":\"73593\",\"end\":\"73677\"},{\"start\":\"73987\",\"end\":\"74074\"},{\"start\":\"74384\",\"end\":\"74439\"},{\"start\":\"74671\",\"end\":\"74792\"},{\"start\":\"75088\",\"end\":\"75199\"}]", "bib_author": "[{\"start\":\"56917\",\"end\":\"56929\"},{\"start\":\"57251\",\"end\":\"57266\"},{\"start\":\"57266\",\"end\":\"57277\"},{\"start\":\"57277\",\"end\":\"57286\"},{\"start\":\"57286\",\"end\":\"57294\"},{\"start\":\"57294\",\"end\":\"57309\"},{\"start\":\"57659\",\"end\":\"57663\"},{\"start\":\"57663\",\"end\":\"57669\"},{\"start\":\"57996\",\"end\":\"58004\"},{\"start\":\"58004\",\"end\":\"58013\"},{\"start\":\"58013\",\"end\":\"58023\"},{\"start\":\"58428\",\"end\":\"58439\"},{\"start\":\"58439\",\"end\":\"58446\"},{\"start\":\"58446\",\"end\":\"58455\"},{\"start\":\"58822\",\"end\":\"58830\"},{\"start\":\"58830\",\"end\":\"58839\"},{\"start\":\"59226\",\"end\":\"59238\"},{\"start\":\"59516\",\"end\":\"59528\"},{\"start\":\"59766\",\"end\":\"59778\"},{\"start\":\"60036\",\"end\":\"60046\"},{\"start\":\"60046\",\"end\":\"60056\"},{\"start\":\"60365\",\"end\":\"60374\"},{\"start\":\"60827\",\"end\":\"60840\"},{\"start\":\"60840\",\"end\":\"60852\"},{\"start\":\"61210\",\"end\":\"61222\"},{\"start\":\"61485\",\"end\":\"61493\"},{\"start\":\"61493\",\"end\":\"61502\"},{\"start\":\"61502\",\"end\":\"61508\"},{\"start\":\"61508\",\"end\":\"61518\"},{\"start\":\"61829\",\"end\":\"61842\"},{\"start\":\"61842\",\"end\":\"61854\"},{\"start\":\"62189\",\"end\":\"62202\"},{\"start\":\"62202\",\"end\":\"62215\"},{\"start\":\"62215\",\"end\":\"62224\"},{\"start\":\"62562\",\"end\":\"62575\"},{\"start\":\"62575\",\"end\":\"62588\"},{\"start\":\"62588\",\"end\":\"62597\"},{\"start\":\"62912\",\"end\":\"62925\"},{\"start\":\"62925\",\"end\":\"62935\"},{\"start\":\"62935\",\"end\":\"62958\"},{\"start\":\"62958\",\"end\":\"62971\"},{\"start\":\"62971\",\"end\":\"62980\"},{\"start\":\"63347\",\"end\":\"63357\"},{\"start\":\"63357\",\"end\":\"63367\"},{\"start\":\"63367\",\"end\":\"63377\"},{\"start\":\"63377\",\"end\":\"63388\"},{\"start\":\"63718\",\"end\":\"63726\"},{\"start\":\"63726\",\"end\":\"63734\"},{\"start\":\"63734\",\"end\":\"63741\"},{\"start\":\"63741\",\"end\":\"63749\"},{\"start\":\"64066\",\"end\":\"64077\"},{\"start\":\"64077\",\"end\":\"64089\"},{\"start\":\"64403\",\"end\":\"64410\"},{\"start\":\"64410\",\"end\":\"64416\"},{\"start\":\"64416\",\"end\":\"64423\"},{\"start\":\"64731\",\"end\":\"64738\"},{\"start\":\"64738\",\"end\":\"64747\"},{\"start\":\"64747\",\"end\":\"64759\"},{\"start\":\"65081\",\"end\":\"65089\"},{\"start\":\"65409\",\"end\":\"65418\"},{\"start\":\"65418\",\"end\":\"65429\"},{\"start\":\"65429\",\"end\":\"65438\"},{\"start\":\"65438\",\"end\":\"65446\"},{\"start\":\"65446\",\"end\":\"65454\"},{\"start\":\"65828\",\"end\":\"65839\"},{\"start\":\"65839\",\"end\":\"65846\"},{\"start\":\"65846\",\"end\":\"65855\"},{\"start\":\"65855\",\"end\":\"65863\"},{\"start\":\"65863\",\"end\":\"65871\"},{\"start\":\"66282\",\"end\":\"66293\"},{\"start\":\"66293\",\"end\":\"66303\"},{\"start\":\"66303\",\"end\":\"66311\"},{\"start\":\"66311\",\"end\":\"66319\"},{\"start\":\"66616\",\"end\":\"66625\"},{\"start\":\"66625\",\"end\":\"66635\"},{\"start\":\"66635\",\"end\":\"66645\"},{\"start\":\"66645\",\"end\":\"66656\"},{\"start\":\"66904\",\"end\":\"66918\"},{\"start\":\"66918\",\"end\":\"66931\"},{\"start\":\"66931\",\"end\":\"66943\"},{\"start\":\"67242\",\"end\":\"67254\"},{\"start\":\"67254\",\"end\":\"67267\"},{\"start\":\"67438\",\"end\":\"67449\"},{\"start\":\"67716\",\"end\":\"67722\"},{\"start\":\"67722\",\"end\":\"67731\"},{\"start\":\"67731\",\"end\":\"67738\"},{\"start\":\"67738\",\"end\":\"67745\"},{\"start\":\"68079\",\"end\":\"68090\"},{\"start\":\"68090\",\"end\":\"68101\"},{\"start\":\"68101\",\"end\":\"68114\"},{\"start\":\"68114\",\"end\":\"68123\"},{\"start\":\"68470\",\"end\":\"68479\"},{\"start\":\"68479\",\"end\":\"68486\"},{\"start\":\"68486\",\"end\":\"68494\"},{\"start\":\"68844\",\"end\":\"68855\"},{\"start\":\"68855\",\"end\":\"68866\"},{\"start\":\"68866\",\"end\":\"68876\"},{\"start\":\"68876\",\"end\":\"68892\"},{\"start\":\"68892\",\"end\":\"68903\"},{\"start\":\"69255\",\"end\":\"69266\"},{\"start\":\"69266\",\"end\":\"69274\"},{\"start\":\"69274\",\"end\":\"69284\"},{\"start\":\"69284\",\"end\":\"69298\"},{\"start\":\"69619\",\"end\":\"69627\"},{\"start\":\"69627\",\"end\":\"69635\"},{\"start\":\"69635\",\"end\":\"69643\"},{\"start\":\"69643\",\"end\":\"69649\"},{\"start\":\"69649\",\"end\":\"69658\"},{\"start\":\"69658\",\"end\":\"69665\"},{\"start\":\"70120\",\"end\":\"70130\"},{\"start\":\"70444\",\"end\":\"70456\"},{\"start\":\"70456\",\"end\":\"70464\"},{\"start\":\"70464\",\"end\":\"70470\"},{\"start\":\"70470\",\"end\":\"70478\"},{\"start\":\"70853\",\"end\":\"70864\"},{\"start\":\"70864\",\"end\":\"70874\"},{\"start\":\"70874\",\"end\":\"70887\"},{\"start\":\"71246\",\"end\":\"71261\"},{\"start\":\"71261\",\"end\":\"71274\"},{\"start\":\"71274\",\"end\":\"71284\"},{\"start\":\"71719\",\"end\":\"71732\"},{\"start\":\"71732\",\"end\":\"71746\"},{\"start\":\"72033\",\"end\":\"72040\"},{\"start\":\"72040\",\"end\":\"72048\"},{\"start\":\"72048\",\"end\":\"72059\"},{\"start\":\"72059\",\"end\":\"72071\"},{\"start\":\"72330\",\"end\":\"72340\"},{\"start\":\"72340\",\"end\":\"72352\"},{\"start\":\"72352\",\"end\":\"72360\"},{\"start\":\"72597\",\"end\":\"72609\"},{\"start\":\"72811\",\"end\":\"72823\"},{\"start\":\"72966\",\"end\":\"72978\"},{\"start\":\"72978\",\"end\":\"72984\"},{\"start\":\"73183\",\"end\":\"73193\"},{\"start\":\"73193\",\"end\":\"73204\"},{\"start\":\"73429\",\"end\":\"73443\"},{\"start\":\"73443\",\"end\":\"73458\"},{\"start\":\"73679\",\"end\":\"73686\"},{\"start\":\"73686\",\"end\":\"73694\"},{\"start\":\"73694\",\"end\":\"73702\"},{\"start\":\"73702\",\"end\":\"73714\"},{\"start\":\"73714\",\"end\":\"73725\"},{\"start\":\"73725\",\"end\":\"73735\"},{\"start\":\"74076\",\"end\":\"74093\"},{\"start\":\"74093\",\"end\":\"74105\"},{\"start\":\"74105\",\"end\":\"74126\"},{\"start\":\"74126\",\"end\":\"74137\"},{\"start\":\"74441\",\"end\":\"74451\"},{\"start\":\"74451\",\"end\":\"74460\"},{\"start\":\"74460\",\"end\":\"74473\"},{\"start\":\"74794\",\"end\":\"74805\"},{\"start\":\"74805\",\"end\":\"74816\"},{\"start\":\"74816\",\"end\":\"74826\"},{\"start\":\"74826\",\"end\":\"74834\"},{\"start\":\"75201\",\"end\":\"75213\"},{\"start\":\"75213\",\"end\":\"75226\"},{\"start\":\"75226\",\"end\":\"75239\"},{\"start\":\"75239\",\"end\":\"75252\"},{\"start\":\"75252\",\"end\":\"75263\"}]", "bib_venue": "[{\"start\":\"56929\",\"end\":\"56952\"},{\"start\":\"57309\",\"end\":\"57327\"},{\"start\":\"57669\",\"end\":\"57699\"},{\"start\":\"58023\",\"end\":\"58047\"},{\"start\":\"58455\",\"end\":\"58470\"},{\"start\":\"58839\",\"end\":\"58883\"},{\"start\":\"59238\",\"end\":\"59264\"},{\"start\":\"59528\",\"end\":\"59547\"},{\"start\":\"59778\",\"end\":\"59806\"},{\"start\":\"60056\",\"end\":\"60094\"},{\"start\":\"60374\",\"end\":\"60419\"},{\"start\":\"60852\",\"end\":\"60868\"},{\"start\":\"61222\",\"end\":\"61241\"},{\"start\":\"61518\",\"end\":\"61535\"},{\"start\":\"61854\",\"end\":\"61873\"},{\"start\":\"62224\",\"end\":\"62255\"},{\"start\":\"62597\",\"end\":\"62616\"},{\"start\":\"62980\",\"end\":\"62999\"},{\"start\":\"63388\",\"end\":\"63408\"},{\"start\":\"63749\",\"end\":\"63759\"},{\"start\":\"64089\",\"end\":\"64108\"},{\"start\":\"64423\",\"end\":\"64446\"},{\"start\":\"64759\",\"end\":\"64771\"},{\"start\":\"65089\",\"end\":\"65108\"},{\"start\":\"65454\",\"end\":\"65468\"},{\"start\":\"65871\",\"end\":\"65917\"},{\"start\":\"66319\",\"end\":\"66338\"},{\"start\":\"66656\",\"end\":\"66666\"},{\"start\":\"66943\",\"end\":\"66964\"},{\"start\":\"67174\",\"end\":\"67240\"},{\"start\":\"67449\",\"end\":\"67497\"},{\"start\":\"67745\",\"end\":\"67793\"},{\"start\":\"68123\",\"end\":\"68152\"},{\"start\":\"68494\",\"end\":\"68526\"},{\"start\":\"68903\",\"end\":\"68928\"},{\"start\":\"69298\",\"end\":\"69317\"},{\"start\":\"69665\",\"end\":\"69729\"},{\"start\":\"70130\",\"end\":\"70149\"},{\"start\":\"70478\",\"end\":\"70510\"},{\"start\":\"70887\",\"end\":\"70906\"},{\"start\":\"71284\",\"end\":\"71322\"},{\"start\":\"71746\",\"end\":\"71765\"},{\"start\":\"72071\",\"end\":\"72099\"},{\"start\":\"72360\",\"end\":\"72388\"},{\"start\":\"72609\",\"end\":\"72645\"},{\"start\":\"72767\",\"end\":\"72809\"},{\"start\":\"72922\",\"end\":\"72964\"},{\"start\":\"73204\",\"end\":\"73228\"},{\"start\":\"73458\",\"end\":\"73471\"},{\"start\":\"73735\",\"end\":\"73765\"},{\"start\":\"74137\",\"end\":\"74155\"},{\"start\":\"74473\",\"end\":\"74492\"},{\"start\":\"74834\",\"end\":\"74850\"},{\"start\":\"75263\",\"end\":\"75282\"},{\"start\":\"58885\",\"end\":\"58923\"},{\"start\":\"60096\",\"end\":\"60128\"},{\"start\":\"60421\",\"end\":\"60460\"},{\"start\":\"66668\",\"end\":\"66672\"},{\"start\":\"66966\",\"end\":\"66981\"},{\"start\":\"67499\",\"end\":\"67541\"},{\"start\":\"67795\",\"end\":\"67837\"},{\"start\":\"69731\",\"end\":\"69789\"},{\"start\":\"71324\",\"end\":\"71356\"},{\"start\":\"72101\",\"end\":\"72123\"},{\"start\":\"72390\",\"end\":\"72412\"},{\"start\":\"72647\",\"end\":\"72677\"},{\"start\":\"73230\",\"end\":\"73248\"}]"}}}, "year": 2023, "month": 12, "day": 17}