{"id": 231930289, "updated": "2022-01-15 05:31:18.789", "metadata": {"title": "Multimodal temporal-clinical note network for mortality prediction", "authors": "[{\"middle\":[],\"last\":\"Yang\",\"first\":\"Haiyang\"},{\"middle\":[],\"last\":\"Kuang\",\"first\":\"Li\"},{\"middle\":[],\"last\":\"Xia\",\"first\":\"FengQiang\"}]", "venue": "Journal of Biomedical Semantics", "journal": "Journal of Biomedical Semantics", "publication_date": {"year": 2021, "month": null, "day": null}, "abstract": "Background Mortality prediction is an important task to achieve smart healthcare, especially for the management of intensive care unit. It can provide a reference for doctors to quickly predict the course of disease and customize early intervention programs for the patients in need. With the development of the electronic medical records, deep learning methods are introduced to deal with the prediction task. In the electronic medical records, clinical notes always contain rich and diverse medical information, including the clinical histories and reports during admission. Mortality prediction methods mostly rely on the temporal events such as medical examinations and ignore the related reports and history information in the clinical notes. We hope that we can utilize both temporal events and clinical notes information to get better mortality prediction results. Results We propose a multimodal temporal-clinical note network to model both temporal and clinical notes. Specifically, the clinical text are further processed for differentiating the chronic illness patients in the historical information of clinical notes from non-chronic illness patients. In order to further mine the information related to the mortality in the text, we learn the time series embedding with Long Short Term Memory networks and the clinical notes embedding with a label aware convolutional neural network. We also propose a scoring function to measure the importance of clinical note sections. Our approach achieved a better AUCPR and AUCROC than competing methods and visual explanations for word importance showed the interpretability improvement of the model. Conclusions We have tested our methodology on the MIMIC-III dataset. Contributions of different clinical note sections were uncovered by visualization methods. Our work demonstrates that the introduction of the medical history related information can improve the performance of the mortality prediction. Using label aware convolutional neural networks can further improve the results.", "fields_of_study": "[\"Medicine\"]", "external_ids": {"arxiv": null, "mag": null, "acl": null, "pubmed": "33588949", "pubmedcentral": "7885612", "dblp": "journals/biomedsem/YangKX21", "doi": "10.1186/s13326-021-00235-3"}}, "content": {"source": {"pdf_hash": "dc6f69360338da8285da9b50c1acfe503fef425f", "pdf_src": "PubMedCentral", "pdf_uri": null, "oa_url_match": false, "oa_info": {"license": "CCBY", "open_access_url": "https://jbiomedsem.biomedcentral.com/track/pdf/10.1186/s13326-021-00235-3", "status": "GOLD"}}, "grobid": {"id": "49806210256e25811e8ff352af5a41fbf5ad6648", "type": "plain-text", "url": "s3://ai2-s2-pdf-extraction-prod/parse-results/s2orc_worker/dc6f69360338da8285da9b50c1acfe503fef425f.txt", "contents": "\nMultimodal temporal-clinical note network for mortality prediction\n2021\n\nHaiyang Yang \nLi Kuang \nFengqiang Xia \nMultimodal temporal-clinical note network for mortality prediction\n\nJournal of Biomedical Semantics\n123202110.1186/s13326-021-00235-3RESEARCH Open AccessElectronic medical recordsMortality predictionDeep learningMultimodal learning\nBackground: Mortality prediction is an important task to achieve smart healthcare, especially for the management of intensive care unit. It can provide a reference for doctors to quickly predict the course of disease and customize early intervention programs for the patients in need. With the development of the electronic medical records, deep learning methods are introduced to deal with the prediction task. In the electronic medical records, clinical notes always contain rich and diverse medical information, including the clinical histories and reports during admission. Mortality prediction methods mostly rely on the temporal events such as medical examinations and ignore the related reports and history information in the clinical notes. We hope that we can utilize both temporal events and clinical notes information to get better mortality prediction results. Results: We propose a multimodal temporal-clinical note network to model both temporal and clinical notes. Specifically, the clinical text are further processed for differentiating the chronic illness patients in the historical information of clinical notes from non-chronic illness patients. In order to further mine the information related to the mortality in the text, we learn the time series embedding with Long Short Term Memory networks and the clinical notes embedding with a label aware convolutional neural network. We also propose a scoring function to measure the importance of clinical note sections. Our approach achieved a better AUCPR and AUCROC than competing methods and visual explanations for word importance showed the interpretability improvement of the model.Conclusions:We have tested our methodology on the MIMIC-III dataset. Contributions of different clinical note sections were uncovered by visualization methods. Our work demonstrates that the introduction of the medical history related information can improve the performance of the mortality prediction. Using label aware convolutional neural networks can further improve the results.\n\nBackground\n\nThe development of the information science and technology makes lasting contributions to the evolution of the management of intensive care unit (ICU). With the increasing number and complexity of biosensors used in ICU, a great deal of data needs to be processed. Electronic Medical Records (EMR) consists of multitype data that records the patients' visits in hospitals (as shown in Fig. 1).\n\n*Correspondence: kuangli@csu.edu.cn 1 School of Computer Science and Engineering, Central South University, 410083 Changsha, China Full list of author information is available at the end of the article EMR contains the numerical results of physical examination in time series, which will be called time series data in the following paper. In addition to these laboratory examination data, doctors will also record patients' relevant information as clinical notes during ward round, such as the history of present illness, social history, family history, chief complaint, clinical history, past medical history, and so on.\n\nThe field of estimation on the health status of ICU patients have produced throughout the years. Medical researchers have proposed a lot of scoring systems to evaluate the prognosis, severity and effectiveness of clini- cal treatments. Almost all of these systems widely applied in the hospitals refer to the specific symptoms and vital signs of patients for statistical calculation. Knaus et al. [1] established the world's first health scoring system, as early as 1981, namely acute physiology and chronic health evaluation (Apache). APACHE II [2] is still, after many years, the most widely used and mature system, which is used to predict the mortality of ICU patients, detect and treat abnormal changes in acute physiology. However, such scoring methods mechanically divide the numerical outcomes into several established thresholds for scoring, which leads to the overestimation of mortality [3].\n\nOn the other hand, machine learning methods have demonstrated state of the art performance in modeling the mortality problem mining the time series vital data of the EMR data [4,5]. The researchers often choose the corresponding signals of the existing medical evaluation methods mentioned above as the features to train the time series model. However, there are still a lot of multitype data in ICU database that have not been utilized effectively, especially clinical notes. In fact, in the actual medical diagnosis process, the contents involved in clinical notes are also important information that doctors need to measure. Furthermore, the history of the illness and other historical information should be considered for patients with chronic diseases, but not for people with non-chronic diseases. Specially the two research challenges are summarized as follows:\n\n• Making more use of the historical clinical notes:\n\nMost of the existing studies have not introduced clinical notes into the prediction model. The model [6] considering clinical notes only took account of the contents which are synchronized with vital information. However, this part of content is partially duplicated with the information contained in time series and does not contain the patient's historical information. In practice, the patients' chief complaint, disease history, family history and allergy history are the important factors when doctors diagnosing. At the same time, the history of illness and other related information are treated differently for chronic patients and non-chronic ones. • Exploring the contribution of notes in different sections to mortality: As mentioned above, there are many sections in clinical notes. There is no difference in the contribution degree of these sections in the model of previous work. Thus, it is crucial to learn the text representation that captures the dependencies to mortality prediction task.\n\nTo address the questions above, we propose a multimodal deep neural network that considers the time series data and more clinical notes at the same time. Moreover, we treat chronic and non-chronic patients differently when dealing with clinical notes. The visualization results show the importance that the model assigns to each text. Our main contributions are summarized as follows:\n\n• We first distinguish the treatment of clinical notes for chronic patients and non-chronic patients. In addition to the report during admission, the history of present illness, family history and other history information in clinical notes are introduced to the model. For the chronic patients, the medical related histories in clinical notes are taken into account. For the non-chronic ones, only the recent notes are considered. In this way, more information of clinical notes are used and more clinical text representation of patients can be extracted. We propose a label-aware CNN model to extract the text feature, in which the label attention layer can learn the clinical notes representation from the joint space. In results, the relevant words are weighted higher in the mortality prediction task than others. We visualize the weights of the words to detect the most contributing notes for the patients for providing interpretability.\n\n• To further capture the dependencies of the clinical text in different sections, we propose a scoring function to capture the clinical note section contributions with respect to model predictions. In this way, we can understand which part of the notes has the most impact on mortality. • We evaluate the effectiveness of the proposed model on the real-world dataset MIMIC-III. The results show that our model outperforms the baseline approaches.\n\n\nRelated work\n\nThere are mainly two groups of related works: Clinical time series data mining and clinical text mining.\n\n\nClinical time series data mining\n\nEMR data is a collection of patients' clinical event tables with timestamp. Most existing works focus on mining the relationship and medical statistics by modeling clinical event outcomes.\n\nBecause of the effective solution to the problem of long-term dependence, Long Short-Term Memory Neural Network (LSTM) [7] is chosen to tackle with medical series data [8][9][10], since the PhysioNet Challenge 2012. Harutyunyan et al. [4] provided researchers with the data preprocessing standard on MIMIC III database [11]. According to the acute physiology score table in Apache II, they selected the corresponding characteristics and used LSTM model to deal with four tasks including inhospital mortality prediction, decompensation prediction, length-of-stay prediction and phenotyping. Choi et al. [12] conducted multilevel medical embedding model, which consists of treatment level, diagnosis level, visit level and patient level, to improve the performance of prediction tasks. They found that the effectiveness of the model can be improved only by using the internal structure of EMR without introducing external knowledge.\n\nAs the attention mechanism is proposed [13], more and more people employed attention to capture the dependencies within a neighborhood of the sequence. Song et al. [14] only used masked multi-head self-attention and position encoding in SAnD architecture, which were applied to determine the dependence of different information and maintain the order of the sequence. Ma et al. [15] introduced and modified multi-head self-attention layer into the multi-channel GRU [16] to extract personal healthcare context. Furthermore, they leveraged a cross-head decorrelation to enhance the peculiarity of the different heads. Their called ConCare framework has been proved to have better performance in in-hospital prediction tasks. Although more and more numerical information is taken into account, it is still limited to the examinations performed during the admission period.\n\nInformation of reference significance such as the past disease history has not been mentioned. This is not enough for the actual treatment process, especially for chronic patients.\n\n\nNatural language processing in medical text\n\nSome researchers try to apply Natural Language Processing (NLP) to solve the medical tasks. Grnarova et al. [17] proposed a convolutional document embedding approach and evaluated it on the clinical notes from the MIMIC III. Agrawal et al. [18] extracted the date of the medical events from the clinical text and label the timeline of the documents. Cai et al. [19] employed the attention mechanism to the continuous bag of words (CBOW) [20] model to learn clinical concepts and their temporal scopes. The relations among the medical concepts are extracted and categorized influences of the concepts into three types with the help of doctors: stable influence, peak influence and sequela influence. Gehrmann et al. [21] used Convolutional neural networks (CNN) for medical text classification and compared it with other most used basic models in NLP. They proved the superiority of CNN in the phenotyping tasks and evaluated the interpretability of the proposed method by calculating the most common phrases for predicitons.\n\nMullenbach et al. [22] presented a convolutional neural network with attention, which is called CAML, to predict medical codes from the clinical notes and showed an interpretability evaluation. The attention weights are applied to calculate the likelihood of each medical code. Following the same idea, Darabi et al. [23] learned the code representation with a Skip-gram model which is based on transformer network and trained a BERT model on the clinical notes leading to the results with time-stamps. The patient embedding obtained demonstrated the effectiveness of the utilization of the unstructured text data. Obviously, the processing of clinical text makes the model enhance the interpretability of the results and the history information contained in the text cannot be replaced by other data in the database.\n\n\nMulti-modal learning\n\nMoreover, multi-modal learning has been shown to be beneficial to prediction tasks in many fields such as traffic flow prediction, recommendation systems and also EMR data mining. According to the diversity of influencing factors of traffic flow, researchers [24][25][26] integrated Point of Interest (POI), weather and time trend characteristics as additional information into the prediction of vehicle trajectory time series data. They confirmed that extra information improved the validity of the prediction results. The network platform can accurately recommend products to users by integrating the users' operation sequence data with the description information of platform prod-ucts or short comments of users [27,28]. Khadanga et al. [6] merged clinical time series embedding and clinical notes embedding together to improve the performance of the model. They are currently the only people who combine time series information with text information and proved its effectiveness. Although both the outcomes of medical examination and clinical notes are taken into account, they did not explore the different dependences of medical texts on different type of patients. In this paper, inspired by them, we made further improvements to the multi-modal learning algorithm proposed by them.\n\n\nMethods\n\nIn this section, we provide details of our proposed model. As shown in Fig. 2, the approach consists of two major components: Time series embedding model and Clinical time series data mining. We first describe the definition of the mortality task, some notations and overview of the approch . Then, we present the input feature representation of the time series and clinical text. Next, we describe the Time series embedding model and Clinical time series data mining. Finally, we present the loss function of the approach.\n\n\nProblem definition\n\nIn-hospital mortality prediction task is to predict whether the patient died in 48 hours after the admission of the patient. As depicted in the Fig. 1, the medical event series for every patients is denoted as S P = (< S 1,t , · · · , S 17,t >| t ∈[ 1, 2, · · · , T] ), in which S i,t represents the i-th feature of the t-th record and total 17 features according to the acute physiology score table in APACHE II. The features extracted from the dataset for each patient are shown in the Table 1. And N P = {N with48h , N history i | i ∈[ 1, 2, · · · , K] } denotes the clinical notes of patients, where N w ith48h represents the clinical notes of 48 hours before discharge and N h istory i represents the ones before 48 hours. And N h istory i is the i-th doctor note out of K history related notes. In particular, the clinical notes of chronic patients contain both parts, while non-chronic patients only contain the former part. During the training, a series of {< S P , N P >| P ∈ (1, 0)} are given to train the model, where P is defined as the mortality label in 48 hours, which means whether the patient dies in hospital before discharge. In the process of prediction, the death labels are predicted according to the given new < S P , N P >. It is worth noting that because the physical indicators of minors and adults are inconsistent, patients under 16 years old are not be considered in this paper.\n\nThe architecture of our proposed model consists of two parts: Time series embedding model and Clinical time series data mining. The temporal events such as lab test results are learned by Time series embedding model and the text in clinical notes are captured by Clinical time  \n\n\nTime series embedding model\n\nTime series embedding model learn the temporal representation of the patients with 17 different concepts mentioned above. In the case of several measurements in the same hour, the average result of the concepts is employed to keep the temporal value frequency of 48 hours before discharge. Same as [6], time series data is modeled by LSTM [7]. LSTM is a neural network structure which can learn the sequential relations and long-term temporal dependencies in the time series data. This function is achieved by the gate and state of the network, in which the forget gate is the key to decide whether to delete the previous state or not. In this paper, the input state at time step t is S t and let h t represents the current hidden state. And the last hidden state of the LSTM will be the time series embedding for further prediction.\nh t = LSTM(S P , h t−1 )(1)\n\nClinical notes embedding model\n\nAs shown in Fig. 2, the clinical notes are extracted to improve the effectiveness of the prediction. Patients are divided into two groups, which are people with chronic diseases and one with non-chronic diseases, to further deal with the clinical history information in the notes. Then the context feature module with label-aware attention is developed to learn the representation of the patients' clinical notes. Clinical Notes Processing for Chronic Patients: There are several types of clinical notes in the database. In more detail, there are more sections in these notes, which consist of clinical history, history of present illness, past medical history, allergies, family history, social history, service and so on. In previous studies, whether a section of patients' clinical notes will be extracted is determined by the filling time of the chart. If the chart time is within 48 hours, it will be taken into account. In contrast, the time of filling chart for the clinical history related sections in the NOTESEVENT table are always before 48 hours. So, they are not considered during the extraction of notes although they are important for diagnosis. Therefore, it is particularly important to choose appropriate notes as additional information.\n\nIn addition, according to the length of time of onset and duration of disease, diseases can be divided into acute diseases and chronic diseases. There are two scoring sections in APACHE II correspondingly: Acute Physiology and Chronic Health Evaluation. In chronic health evaluation section, patients are given extra points when suffering from chronic diseases such as liver, cardiovascular disease, respiratory disease, kidney disease and immune function suppression. At the same time, Buchan et al. [29] studied on the use of clinical notes to predict coronary artery disease. They found that clinical narratives, which mean the chief complaint and other clinical history related information, are of great significance for the prediction of the disease, and it may be necessary to consider medical records of more than 12 months or even longer periods. According to the review of Sheikhalishahi el al. [30], many researchers have reached similar conclusions in their studies on chronic diseases. This shows that for chronic patients, the medical history information has a great influence on the evaluation. According to the past diagnosis records and clinical records of patients, chronic patients often have persistent complications or be affected by diseases. However, acute patients have a short onset period and have little continuous impact on their bodies, and the possibility of inducing other diseases is very low.\n\nTaking this as a guide, the related sections are extracted from the notes as historical information of chronic patients, some of which are shown in Table 2, while non-chronic patients do not consider these cases. This means that information related to the disease history from the beginning of the medical record to the present is used as the initial information of the clinical notes for chronic patients. For other notes during admission, the relevant text within 48 hours will be extracted according to the table recording time. Therefore, we first identify the chronic patients based on the ICD 9 chronic disease name and code. With this result, the patients in the data set can be effectively divided into chronic patients and non-chronic patients. For non-chronic patients, we only include clinical notes within 48 hours before discharge. For chronic patients, clinical notes since the patient was admitted to hospital will be introduced in addition. All these clinical notes are fed to the label-aware CNN for training.\n\nLabel-aware CNN for Clinical Notes: To capture the contributions of the different sections from clinical notes and extract text features more effectively, a convolutional neural network with label-aware attention module is introduced to learn the joint embedding of clinical notes and mortality label similar to [31], from which different contributions of the notes to mortality results can be learned. For medical related predictions, people want to know which paragraph of text has a main impact on the final prediction results. The algorithm proposed by them is to learn the degree of similarity between different parts of the text and the final prediction labels, that is, the degree of association. Therefore, we introduced this module to learn the contributions of different parts of the clinical notes on the prediction of patient mortality.\n\nThe clinical notes N P are embedded to a text vector v N by projecting every word with Word2Vec [20], which is trained in the PubMed -a professional medical citation datasets with amount of science journals and books. Then given the clinical notes feature representation of a patient v N v N ∈ R D , in which D is the size of the vocabulary, the projection for a note feature in the joint space can be derived as v N = W v1 v N v ∈ R P . In the same way, the projection of the label\nembedding v m v m ∈ R O to joint space v m = W v2 v m v ∈ R P ,\nwhere O is the number of the label class. The label for the mortality prediction task is denoted as a one-hot embedding. For more details, W v1 ∈ R P×D is the transformation matrix that maps the note vectors into the joint embedding and P is the dimensionality of the joint space. In the same way, W v2 ∈ R P×O projects the label vector into the joint embedding space. The compatibility of the clinical note vector and label vector are obtained by G = v N ⊗ v m . For more detail, for the i-th word in the sentence, G i represents the compatibility between the word and labels. The similarity between the word and the label is:\nu i = ReLU(G i W i + b i )(2)\nwhere W i and b i b i ∈ R O are learned parameters. And the total max-pooling output of all u i is m.\n\nIn the joint embedding space, it is expected that the dependency between the word in notes and mortality labels to be more reflective of semantic closeness between clinical notes and mortality results. The effective way to measure the dependency is to add an attention layer. According to the definition of the attention [13]:\nAttention(Q, K, V ) = softmax QK T √ d V(3)\n\nTable 2\n\nDescription of some medical history information added in this paper\n\n\nSection name Description\n\nClinical History Patients' clinical treatment history.\n\n\nHistory of Present Illness\n\nThe patients' basic condition and previous treatment plan.\n\nPast Medical History Treatment, examination, medicine taken before admission, etc.\n\n\nAllergies\n\nPatients' allergic history.\n\nFamily History Family history of chronic diseases.\n\n\nChief Complaint\n\nThe patients' self-reported pathogenesis process and symptoms.\n\nMajor Surgical or Invasive Procedure The treatment and invasive surgery that the patients had received.\n\nwhere the query Q, key K, and value V are set to the joint vector embeddings G, and d is the embedding dimension. So, the label attention weights for i-th words are denoted as:\nα i = exp(m i ) L j=1 exp(m j )(4)\nThe total attention score α = Attention(m). The joint embedding is finally defined by multiply the word embeddings and the attention score:\nq = αv N(5)\nThe label attention here describes the relationship between the words and mortality label and considers which words have been attended to in the clinical notes extracting process. Then the output of the embedding layer is fed to a convolutional layer to further prediction. The i-th text feature extracted by the convolutional is obtained by:\nc i = f (W q q i + b)(6)\nwhere W q and b are weight matrix and bias respectively. And f is an activation function, which is usually nonlinear. The output of the CNN layer will be concatenated with the temporal embedding to further predict.\n\n\nPrediction component\n\nTo predict whether a patient will die after 48-hour admission, the time series embedding and clinical notes embedding are joined together by concatenating them. So, the concatenate vector is denoted as:\nz = h t ⊕ c(7)\nwhere c is the output of a CNN layer. The concatenate embedding z is finally fed to a fully connected network to predict aŷ for every patient. The prediction function is:\ny = σ (W f z + b f )(8)\nwhere W f and b f are learnable parameters. And σ is a sigmoid function, which is defined as σ (x) = 1/(1 + e −x ). The goal of the joint embedding is to minimize the similarity between the clinical text representation and patients' labels. So, the cross entropy (CE) loss and joint embedding objective are combined to train the model. The Tensorflow [32] and Keras [33] are used to implement the proposed model, in which the CE loss is defined as:\nCE(y i ,ŷ i ) = − i y i log(ŷ i )(9)\nwhereŷ i is the prediction labels and y i are the ground truth labels. Note that the labels are not used in the test set, because we already get the similarity scores between the words and labels. The loss function used in training process is:\nloss(θ) = CE(y,ŷ) + 1 k l n=1 CE (y k , σ (c k ))(10)\nwhere θ represents the all learnable parameters in the model and σ (x) is also the sigmoid function in the clinical notes embedding model. And this regularization means the penalty of the joint embedding, which results in the interpretability. Furthermore, the optimization in this implement is Adam [34]. Quantifying Section Importance: The label aware CNN mentioned above describes the contribution of each word to the final prediction, and as mentioned before, usually the clinical notes of the patient contain many sections, such as nursing notes, clinical history, family history and so on. So, it is necessary to capture how the contribution of each section can be more effective to know the role of each section for prediction. To further measure the contribution of different sections to the mortality prediction, we define the importance score as:\nScore N i,i+l = α N i,i+l K n=1 α (N n )(11)\nwhere α(N i ) is the attention score of i-th word. And for each section of the clinical notes, suppose the . For every patients notes, suppose the total number of words is n. The first character of each section is the l-th, and the total number of sections is m. The attention score here are the obtained by training and each of them can be interpreted as the contribution to a specific mortality label. Therefore, the importance of each section can be derived from the sum of the importance of all its words in the entire notes.\n\nThe effectiveness of this equation as scoring function is visualized and verified in the Results section.\n\n\nResults\n\n\nDataset\n\nIn this paper, the MIMIC-III [11]  In the experiment, the data for mortality prediction is collected following the benchmark research [4]. Then the patients stayed in the ICU for at least 48 hours are selected same as the research [6]. The distribution of the collected data for prediction is shown in Fig. 3 which is visualized by t-SNE [35]. It can be seen from the figure that the data used in the experiment has a problem of label imbalance. Only a small number of people eventually died within 48 hours, and most people survived.\n\n\nDataset analysis\n\nIn the MIMIC-III dataset, patients suffer from various diseases. According to the diagnosis results of patients, we make a statistical analysis of the top 20 diseases with the largest number of patients in the diagnosis results. As shown in the Fig. 4, patients with hypertension are the most in the data set. This is because most patients in ICU have basic diseases and the first five items are the most common chronic diseases in reality. On the whole, only three diseases are non-chronic diseases. And the number of acute patients is very small compared with that of chronic patients. It means that the majority of patients suffer from the chronic diseases. At the same time, it shows that a large number of clinical historical data of chronic patientshave not been taken into account in the previous research. Therefore, the introduction and processing of this part of information are considered in this work.\n\n\nEvaluation metric\n\nAs mentioned in above section, the dataset used is very imbalanced. According to the research [36], it may not be appropriate to use precision or recall alone that is often used as evaluation indicators in the classification. The Precision-Recall is more informative for classification on the imbalance datasets. So, Area Under Precision-Recall (AUCPR) and Area Under Receiver Operating Characteristic (AUCROC) are chosen to evaluate the proposed method.\n\nAUCPR is defined as the area under the curve, where recall and precision are the abscissa and ordinate, respectively. And AUCROC is also the area under the curve, but abscissa is False Positive Rate (FPR) and ordinate is True Positive Rate (TPR) instead.\n\n\nMethods for comparison\n\nOur model is compared with the following methods, and the performance of them will be discussed later. LSTM [4]: The time series data selected in this paper is fed to the pure LSTM model to predict the probability of death in 48 hours after admission. Clinical Notes Only (CN): This paper [22] used CNN to predict medical codes of the patients. Similar to the cited paper, the clinical text representation is fed to a CNN model to predict the mortality. Multimodal with Clinical Notes (Muti-CN) [6]: This method combine the LSTM time series embedding and clinical notes representation to address the task. CNN is used to extract features from the clinical notes. Note that the notes here are same as our preprocessing. With these three methods, we can study the effect of different part of our proposed multimodal approach. We use the same time series embedding for the LSTM, Multi-CN and our method. We also studied the influence of the processing of the clinical notes of chronic patients we proposed: Multimodal with Label aware CNN (Multi-atten): In this variant, we treat chronic patients and non-chronic patients in the same way. Both of the clinical reports  \n\n\nSetup and performance comparison\n\nSetup:All these experiments were run on a NVIDIA RTX 2080Ti GPU. The timestep is set as 1.0 in LSTM. The output dimension of LSTM is set to 256. The max length of the clinical notes is 1000 and if the length of the text is less than it zero padding will be used. Batch normalization is used, and the batch size is set to 5. The learning rate is 0.0001. The early-stop round is set to 20 and the max epoch is 100.\n\nComparison with the methods: Table 3 shows the performance of our proposed approach and the methods mentioned above Multi-atten-chronic achieves the highest AUCPR and Multi-atten achieves the highest AUCROC. Comparison results can be divided into three parts. LSTM is a baseline that only considers time series data and only the clinical notes are considered in CN. Multi-CN is by far the best model considering both of them at the same time. More specifically, we can see that the LSTM and the clinical notes only methods are the lowest and similar in the comparison in both of AUCPR and AUCROC. This is because the clinical notes contain a part of physical examination result data, which will be duplicated with the time series data. The result of multicn is better than that of considering only one kind of data, which indicates that the fusion of time series data and clinical notes is effective. And our model has been improved on this basis. The performance of Multi-atten proves that the overall performance of our model has been improved after joining label-CNN. Furthermore, the clinical notes of chronic patients are treated differently, and the overall effect of the model has been improved. This comparison proves the effectiveness of our proposed model. Visualizing contributions of the clinical notes Figure 5 shows the visualization of the dependencies of the clinical notes text to the death and survival prediction.\n\nThe darker the color of the words, the greater the contribution to the prediction result. That means the words with white colors are less important in the sentence, while the dark blue words denote the evidence for death of the patients. Here the rows represent the sentences in the clinical notes while the columns are the joint embeddings of the words. The first fifty words in clinical notes with clinical history related notes of a chronic patient are presented in the Fig. 5a. According to the meaning of the rows and the columns, it can be seen that the color blocks of the We present the attention scores with the actual text in Fig. 5b. Also, the shade of the blue indicates that how much the words contribute the final label. The darker words are more important in the death label prediction. It should be noted that the importance score for stop words is not calculated. In this case, the color of \"systolic blood pressure\" is almost the deepest. Similarly, medical related nouns such as \"foley catheter\", \"urine\" and \"purulent discharge\" are also darker in color. These are the parts that doctors compare in actual diagnosis, which shows that our model has paid attention to these places effectively. At the same time, words like \"rehabilitation facility\" are also important for prediction.\n\nThe importance scores of different sections are showed with the actual text in Fig. 6. The representation here is the same as Fig. 5, which means the darker sections are more important. In this case, the color of \"HISTORY OF PRESENT ILLNESS\" is almost the deepest and the color of \"SOCIAL HISTORY\" is the lightest. The characteristic of section with deep color is that it contains more medical related contents. Correspondingly, it contains more related words, which leads to a higher score. The visualization results of these two figures fully show the effectiveness of scoring function.\n\n\nHyper-parameter analysis\n\nIn this section, the influence of hyper-parameters is analyzed. During the training process, the early stopping method is adopted, and almost all models showed no significant performance changes after the 50th epoch. Therefore, for different hyperparameters, we compare the model performance with every 10 epochs during the training process.\n\nThe influence of hyper-parameters of CNN is shown in Figs. 7 and 8. The impact of input embedding dimensions in CNN layer is depicted in Fig. 7a, from which we can see that AUCROC has improved with the increase of embedding dimension. Because the input embedding represents the dimension of the word vector, the higher the dimension, the better the representation of the word. In the end, the improvement of the notes feature brought an improvement in the prediction results. Another impor- Fig. 6 The importance sample of the clinical note sections. The darker the blue is, the more important the section to the prediction tant hyper-parameter in CNN is the filter size. Unlike images that use pixels as a unit, word vectors require a certain dimension to extract a complete word or phrase representation. Figure 7b describes the impact of filter sizes commonly used in text classification CNN model. It can be seen from the figure that when the filter size is 2 or 5, the model performs almost the same and the Fig. 7 AUCROC of different CNN hyper parameters every 10 epochs effect is relatively best. Finally, we observed the experimental results of different dropout. Finally, we observed the experimental results of different dropout. It can be seen from Fig. 8 that when dropout is 0.9, the model reaches the best at both values. Therefore, we set dropout to 0.9 during training.\n\n\nDiscussion\n\nWe first analyzed the distribution of non-chronic and chronic patients in the dataset. It can be seen from the results that chronic patients account for the majority in the MIMIC-III data set. Therefore, it is necessary to treat the data of chronic patients differently in the process of predicting mortality. The comparison results in Table 3 show the advantages of the multimodal learning methods. However, multi-CN does not consider the different contributions of the clinical notes and lacks clinical history related notes. In the Multi-atten model, both of chronic patients and non-chronic patients are treated with clinical notes which include the clinical history related text. The result of the Multi-atten demonstrates that the label aware attention layer makes the model more sensitive to the context of the clinical notes compared to the multi-CN. Furthermore, the additional introduction of clinical notes to chronic patients can respond to the different needs for clinical history information. The process of this operation is closer to the diagnosis process of actual doctors. So, the AUCPR as a measure of the overall performance of the model reached the highest. This proves that it is necessary to treat the clinical notes of chronic patients and nonchronic patients differently. At the same time, for chronic patients, it is necessary to add historical information.\n\nIn the visualization experiments, it can be seen in the Fig. 6 that the total contributions of the history of present illness and past medical history sections are the highest in these seven sections. Meanwhile allergies and social history are the least important ones. The reason is that there are few words in this part. And most of them do not contain professional medical terminology related vocabu- Fig. 8 The influence of dropout lary. Through the visualization of words in Fig. 5, it can be found that medical related words usually have higher attention score. The visualization of the results shows the interpretability of the model with label attention layer and the attention score can detect the words associated with death label. According to this experiment, we can see which part of clinical notes has a practical influence on the death of patients. This not only makes the prediction result more explicit, but also proves the effectiveness of scoring function. This result can tell the main inducement that affects the development of the patient's illness, which has certain significance for the follow-up study.\n\nTo sum up, in the study of electronic medical records, tasks like mortality prediction are the focus of researchers. In the existing research, to our best konwledge,few people use time series data features and text features at the same time. With the rapid development of multimodal learning models, we consider making full use of these two types of data. In this article, we further extend the model on the basis of existing research [6] and hope to improve its performance.\n\nFor the most important interpretability aspect in medical research, we propose a simple but very effective scoring function. We can find which section in the clinical notes has the most influence on the final prediction results through this function. These sections have very specific medical significance for the patient's treatment process. The visualization of the influence of sction can provide some auxiliary opinions for the doctor's diagnosis and treatment process.\n\n\nConclusions\n\nIn this paper, a multimodal network are proposed for the mortality prediction by using time series data and clinical text at the same time. The time series data is modeled by LSTM and the clinical notes are learned by a convolutional neural network with label aware attention layer. Furthermore, the history information of the chronic patients is treated with independently and the processing of the reports during admission is the same to chronic patients and non-chronic patients by processing of chronic clinical notes. The model is evaluated on the collected data from MIMIC-III dataset. The experiment results show that our proposed approach outperforms the competing methods. The results are not only better than the existing multimodal model with the best results, but also far more than the model that only considers single type of data. And the visualization results show that the model pays more attention to the vocabulary related to medical process and indicate the interpretability improvement of our model.\n\nAlthough the APACHE II scoring system is used as feature selection guide, it is still far from the actual diagnosis process of doctors. For future work, it is crucial to introduce the existing medical knowledge to the deep learning model. Knowledge graph is a popular tool to capture the background knowledge, which can be utilized to bring further improvements in several aspects in the model. So, incorporating more medical information is the direction of our future work.\n\nFig. 1\n1Patient visit timeline. A sample of patient electronic medical records\n\nFig. 2\n2The architecture of the proposed model. a is the time series embedding and b is the clinical notes embedding. For chronic patient clinical notes include clinical history related notes and clinical reports during admission, while non-chronic patients only consider the later one\n\nFig. 3\n3The t-SNE visualization of the collected data. The red points represent the survival patients and the blue ones are death patients\n\nFig. 4\n4The distribution of twenty diseases with the largest number of patients during admission and clinical history related text are considered and fed to the label aware attention CNN model to train. Multimodal with Label Attention for chronic patients (Multi-atten-chronic): our proposed model, which consists of processing of the chronic patients history information and label aware CNN model.\n\nFig. 5\n5Text heatmap and visualization sample. a is text heatmap of the learned clinical notes. The darker the blue is, the more important the words to the context. And b shows that the color of color block is related to the attention score words show the degree of contribution and dependence of each word to the labels.\n\nTable 1\n1Features from the MIMIC-III for each patient series data mining. Both of temporal feature vectors and text vectors are concatenated and fed to a fully connected layer to predict the mortality labels. The details of the model are described below.Feature \n\n\nTable 3\n3Comparison with baselinesMethod \n\nAcknowledgementsThe authors would like to thank MIMIC-III program for access to the database.Authors' contributions H.Y. and L.K. conceived and designed the study. H.Y. performed the experiments and wrote the paper. L.K. and F.X. reviewed the manuscript. All authors read and approved the manuscript.Availability of data and materialsThe datasets analyzed during the current study are available from the Medical Information Mart for Intensive Care (MIMIC-III). More information about MIMIC-III can be found on their website (https://mimic.mit.edu/about/mimic/).Ethics approval and consent to participateEthical consent was not required in this study, since the MIMIC-III data were analyzed namelessly.Consent for publicationThe manuscript does not include individual person's data.Competing interestsThe authors declare that they have no competing interests.Author details\n. W Knaus, J Zimmerman, D Wagner, E Draper, D Lawrence, Knaus W, Zimmerman J, Wagner D, Draper E, Lawrence D.\n\nApache-acute physiology and chronic health evaluation: a physiologically based classification system. Crit Care Med. 9591Apache-acute physiology and chronic health evaluation: a physiologically based classification system. Crit Care Med. 1981;9:591.\n\nApache ii: a severity of disease classification system. W Knaus, E Draper, D Wagner, J Zimmerman, Crit Care Med. 13Knaus W, Draper E, Wagner D, Zimmerman J. Apache ii: a severity of disease classification system. Crit Care Med. 1985;13:818-29.\n\nRisk prediction of hospital mortality for adult patients admitted to australian and new zealand intensive care units: development and validation of the australian and new zealand risk of death model. E Paul, M Bailey, D Pilcher, J Crit Care. 28Paul E, Bailey M, Pilcher D. Risk prediction of hospital mortality for adult patients admitted to australian and new zealand intensive care units: development and validation of the australian and new zealand risk of death model. J Crit Care. 2013;28:935-41.\n\nMultitask learning and benchmarking with clinical time series data. H Harutyunyan, H Khachatrian, D Kale, Ver Steeg, G Galstyan, A , Sci Data. 6Harutyunyan H, Khachatrian H, Kale D, Ver Steeg G, Galstyan A. Multitask learning and benchmarking with clinical time series data. Sci Data. 2019;6:1-18.\n\nInterpolation-prediction networks for irregularly sampled time series. S Shukla, B Marlin, International Conference on Learning Representations. New Orleans: ICLRShukla S, Marlin B. Interpolation-prediction networks for irregularly sampled time series. In: International Conference on Learning Representations. New Orleans: ICLR; 2019. p. 1-14.\n\nUsing clinical notes with time series data for icu management. S Khadanga, K Aggarwal, S Joty, J Srivastava, 10.18653/v1/D19-1678Proceedings of the 2019 Conference on Empirical Methods in Natural Language Processing and the 9th International Joint Conference on Natural Language Processing (EMNLP-IJCNLP). the 2019 Conference on Empirical Methods in Natural Language Processing and the 9th International Joint Conference on Natural Language Processing (EMNLP-IJCNLP)Hong KongAssociation for Computational LinguisticsKhadanga S, Aggarwal K, Joty S, Srivastava J. Using clinical notes with time series data for icu management. In: Proceedings of the 2019 Conference on Empirical Methods in Natural Language Processing and the 9th International Joint Conference on Natural Language Processing (EMNLP-IJCNLP). Hong Kong: Association for Computational Linguistics; 2019. p. 6433-6438. https://doi.org/10.18653/v1/D19-1678.\n\nLong short-term memory. S Hochreiter, J Schmidhuber, Neural Comput. 9Hochreiter S, Schmidhuber J. Long short-term memory. Neural Comput. 1997;9:1735-80.\n\nLearning to diagnose with lstm recurrent neural networks. Z Lipton, D Kale, C Elkan, R Wetzel, arXiv:1511.03677arXiv preprintLipton Z, Kale D, Elkan C, Wetzel R. Learning to diagnose with lstm recurrent neural networks. arXiv preprint arXiv:1511.03677. 2015;1-18.\n\nPatient subtyping via time-aware lstm networks. I Baytas, C Xiao, X Zhang, F Wang, A Jain, J Zhou, 10.1145/3097983.3097997Proceedings of the 23rd ACM SIGKDD International Conference on Knowledge Discovery and Data Mining. KDD '17. the 23rd ACM SIGKDD International Conference on Knowledge Discovery and Data Mining. KDD '17New YorkAssociation for Computing MachineryBaytas I, Xiao C, Zhang X, Wang F, Jain A, Zhou J. Patient subtyping via time-aware lstm networks. In: Proceedings of the 23rd ACM SIGKDD International Conference on Knowledge Discovery and Data Mining. KDD '17. New York: Association for Computing Machinery; 2017. p. 65-74. https://doi.org/10.1145/3097983.3097997.\n\nDeepcare: A deep dynamic memory model for predictive medicine. T Pham, T Tran, D Phung, S Venkatesh, Pacific-Asia Conference on Knowledge Discovery and Data Mining. AucklandSpringerPham T, Tran T, Phung D, Venkatesh S. Deepcare: A deep dynamic memory model for predictive medicine. In: Pacific-Asia Conference on Knowledge Discovery and Data Mining. Auckland: Springer; 2016. p. 30-41.\n\nMimic-iii, a freely accessible critical care database. A Johnson, T Pollard, L Shen, H Li-Wei, M Feng, M Ghassemi, B Moody, P Szolovits, L Celi, R Mark, Sci Data. 3Johnson A, Pollard T, Shen L, Li-Wei H, Feng M, Ghassemi M, Moody B, Szolovits P, Celi L, Mark R. Mimic-iii, a freely accessible critical care database. Sci Data. 2016;3:1-9.\n\nMultilevel medical embedding of electronic health records for predictive healthcare. E Choi, C Xiao, W Stewart, Sun J Mime, Proceedings of the 32nd International Conference on Neural Information Processing Systems. NIPS'18. the 32nd International Conference on Neural Information Processing Systems. NIPS'18Red HookCurran Associates IncChoi E, Xiao C, Stewart W, Sun J. Mime: Multilevel medical embedding of electronic health records for predictive healthcare. In: Proceedings of the 32nd International Conference on Neural Information Processing Systems. NIPS'18. Red Hook: Curran Associates Inc.; 2018. p. 4552-62.\n\nAttention is all you need. A Vaswani, N Shazeer, N Parmar, J Uszkoreit, L Jones, A Gomez, Ł Kaiser, I Polosukhin, Advances in Neural Information Processing Systems. Long Beach: NIPS. Vaswani A, Shazeer N, Parmar N, Uszkoreit J, Jones L, Gomez A, Kaiser Ł, Polosukhin I. Attention is all you need. In: Advances in Neural Information Processing Systems. Long Beach: NIPS; 2017. p. 5998-6008.\n\nAttend and diagnose: Clinical time series analysis using attention models. H Song, D Rajan, J Thiagarajan, A Spanias, 32nd AAAI Conference on Artificial Intelligence, AAAI 2018. New OrleansAAAI pressSong H, Rajan D, Thiagarajan J, Spanias A. Attend and diagnose: Clinical time series analysis using attention models. In: 32nd AAAI Conference on Artificial Intelligence, AAAI 2018. New Orleans: AAAI press; 2018. p. 4091-8.\n\nPersonalized clinical feature embedding via capturing the healthcare context. L Ma, C Zhang, Y Wang, W Ruan, J Wang, W Tang, X Ma, X Gao, J Gao, Concare, Proceedings of the AAAI Conference on Artificial Intelligence. the AAAI Conference on Artificial IntelligenceNew YorkAAAI34Ma L, Zhang C, Wang Y, Ruan W, Wang J, Tang W, Ma X, Gao X, Gao J. Concare: Personalized clinical feature embedding via capturing the healthcare context. In: Proceedings of the AAAI Conference on Artificial Intelligence, vol. 34. New York: AAAI; 2020. p. 833-40.\n\nLearning phrase representations using rnn encoder.decoder for statistical machine translation. K Cho, B Van Merriënboer, C Gulcehre, D Bahdanau, F Bougares, H Schwenk, Y Bengio, Proceedings of the 2014 Conference on Empirical Methods in Natural Language Processing (EMNLP). the 2014 Conference on Empirical Methods in Natural Language Processing (EMNLP)DohaAssociation for Computational LinguisticsCho K, van Merriënboer B, Gulcehre C, Bahdanau D, Bougares F, Schwenk H, Bengio Y. Learning phrase representations using rnn encoder.decoder for statistical machine translation. In: Proceedings of the 2014 Conference on Empirical Methods in Natural Language Processing (EMNLP). Doha: Association for Computational Linguistics; 2014. p. 1724-34.\n\nNeural document embeddings for intensive care patient mortality prediction. P Grnarova, F Schmidt, S Hyland, C Eickhoff, arXiv:1612.00467arXiv preprintGrnarova P, Schmidt F, Hyland S, Eickhoff C. Neural document embeddings for intensive care patient mortality prediction. arXiv preprint arXiv:1612.00467. 2016;1-5.\n\nTifti: A framework for extracting drug intervals from longitudinal clinic notes. M Agrawal, G Adams, N Nussbaum, B Birnbaum, arXiv:1811.12793arXiv preprintAgrawal M, Adams G, Nussbaum N, Birnbaum B. Tifti: A framework for extracting drug intervals from longitudinal clinic notes. arXiv preprint arXiv:1811.12793. 2018;1-5.\n\nMedical concept embedding with time-aware attention. X Cai, J Gao, K Ngiam, B Ooi, Y Zhang, X Yuan, Proceedings of the 27th International Joint Conference on Artificial Intelligence. the 27th International Joint Conference on Artificial IntelligenceCai X, Gao J, Ngiam K, Ooi B, Zhang Y, Yuan X. Medical concept embedding with time-aware attention. In: Proceedings of the 27th International Joint Conference on Artificial Intelligence; 2018. p. 3984-90.\n\nEfficient estimation of word representations in vector space. T Mikolov, K Chen, G Corrado, J Dean, Proceedings of the International Conference on Learning Representations (ICLR 2013). the International Conference on Learning Representations (ICLR 2013)Scottsdale: ICLRMikolov T, Chen K, Corrado G, Dean J. Efficient estimation of word representations in vector space. In: Proceedings of the International Conference on Learning Representations (ICLR 2013). Scottsdale: ICLR; 2013. p. 1-12.\n\nComparing deep learning and concept extraction based methods for patient phenotyping from clinical narratives. S Gehrmann, F Dernoncourt, Y Li, E Carlson, J Wu, J Welt, J FooteJr, E Moseley, D Grant, P Tyler, PloS one. 13192360Gehrmann S, Dernoncourt F, Li Y, Carlson E, Wu J, Welt J, Foote Jr J, Moseley E, Grant D, Tyler P, et al. Comparing deep learning and concept extraction based methods for patient phenotyping from clinical narratives. PloS one. 2018;13:0192360.\n\nExplainable prediction of medical codes from clinical text. J Mullenbach, S Wiegreffe, J Duke, J Sun, J Eisenstein, Proceedings of the 2018 Conference of the North American Chapter of the Association for Computational Linguistics: Human Language Technologies. the 2018 Conference of the North American Chapter of the Association for Computational Linguistics: Human Language TechnologiesNew OrleansAssociation for Computational Linguistics1Mullenbach J, Wiegreffe S, Duke J, Sun J, Eisenstein J. Explainable prediction of medical codes from clinical text. In: Proceedings of the 2018 Conference of the North American Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 1 (Long Papers). New Orleans: Association for Computational Linguistics; 2018. p. 1101-11.\n\nTaper: Time-aware patient ehr representation. S Darabi, M Kachuee, S Fazeli, M Sarrafzadeh, IEEE J Biomed Health Inform. Darabi S, Kachuee M, Fazeli S, Sarrafzadeh M. Taper: Time-aware patient ehr representation. IEEE J Biomed Health Inform. 2020.\n\nPredicting taxi demand based on 3d convolutional neural network and multi-task learning. L Kuang, X Yan, X Tan, S Li, X Yang, Remote Sens. 111265Kuang L, Yan X, Tan X, Li S, Yang X. Predicting taxi demand based on 3d convolutional neural network and multi-task learning. Remote Sens. 2019;11:1265.\n\nDeep multi-view spatial-temporal network for taxi demand prediction. H Yao, F Wu, J Ke, X Tang, Y Jia, S Lu, P Gong, J Ye, Z Li, 2018 AAAI Conference on Artificial Intelligence (AAAI'18). New OrleansAAAIYao H, Wu F, Ke J, Tang X, Jia Y, Lu S, Gong P, Ye J, Li Z. Deep multi-view spatial-temporal network for taxi demand prediction. In: 2018 AAAI Conference on Artificial Intelligence (AAAI'18). New Orleans: AAAI; 2018. p. 2588-95.\n\nDeepstn+: Context-aware spatial-temporal neural network for crowd flow prediction in metropolis. Z Lin, J Feng, Z Lu, Y Li, Jin D , Proceedings of the AAAI Conference on Artificial Intelligence. the AAAI Conference on Artificial IntelligenceHawaiian Village, HonoluluAAAI33Lin Z, Feng J, Lu Z, Li Y, Jin D. Deepstn+: Context-aware spatial-temporal neural network for crowd flow prediction in metropolis. In: Proceedings of the AAAI Conference on Artificial Intelligence, vol. 33. Hilton Hawaiian Village, Honolulu: AAAI; 2019. p. 1020-7.\n\nDeep neural networks for youtube recommendations. P Covington, J Adams, E Sargin, Proceedings of the 10th ACM Conference on. the 10th ACM Conference onCovington P, Adams J, Sargin E. Deep neural networks for youtube recommendations. In: Proceedings of the 10th ACM Conference on\n\nDeep session interest network for click-through rate prediction. Y Feng, F Lv, W Shen, M Wang, F Sun, Y Zhu, K Yang, Proceedings of the 28th International Joint Conference on Artificial Intelligence. the 28th International Joint Conference on Artificial IntelligenceMacaoAAAI PressFeng Y, Lv F, Shen W, Wang M, Sun F, Zhu Y, Yang K. Deep session interest network for click-through rate prediction. In: Proceedings of the 28th International Joint Conference on Artificial Intelligence. Macao: AAAI Press; 2019. p. 2301-7.\n\nAutomatic prediction of coronary artery disease from clinical narratives. K Buchan, M Filannino, O Uzuner, J Biomed Inform. 72Buchan K, Filannino M, Uzuner O. Automatic prediction of coronary artery disease from clinical narratives. J Biomed Inform. 2017;72:23-32.\n\nNatural language processing of clinical notes on chronic diseases: systematic review. S Sheikhalishahi, R Miotto, J Dudley, A Lavelli, F Rinaldi, V Osmani, JMIR Med Inform. 712239Sheikhalishahi S, Miotto R, Dudley J, Lavelli A, Rinaldi F, Osmani V. Natural language processing of clinical notes on chronic diseases: systematic review. JMIR Med Inform. 2019;7:12239.\n\nJoint embedding of words and labels for text classification. G Wang, C Li, W Wang, Y Zhang, D Shen, X Zhang, R Henao, Carin L , Proceedings of the 56th Annual Meeting of the Association for Computational Linguistics. the 56th Annual Meeting of the Association for Computational Linguistics1Wang G, Li C, Wang W, Zhang Y, Shen D, Zhang X, Henao R, Carin L. Joint embedding of words and labels for text classification. In: Proceedings of the 56th Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers). Melbourne: Association for Computational Linguistics; 2018. p. 2321-31.\n\nTensorflow: A system for large-scale machine learning. M Abadi, P Barham, J Chen, Z Chen, A Davis, J Dean, M Devin, S Ghemawat, G Irving, M Isard, 12th USENIX Symposium on Operating Systems Design and Implementation. Abadi M, Barham P, Chen J, Chen Z, Davis A, Dean J, Devin M, Ghemawat S, Irving G, Isard M, et al. Tensorflow: A system for large-scale machine learning. In: 12th USENIX Symposium on Operating Systems Design and Implementation (OSDI 16); 2016. p. 265-83.\n\nIntroduction to keras. N Ketkar, Deep Learning with Python. SpringerKetkar N. Introduction to keras. In: Deep Learning with Python. Springer; 2017. p. 97-111.\n\nA method for stochastic optimization. D Kingma, J Ba, Adam, ICLR (Poster). San Diego: ICLRKingma D, Ba J. Adam: A method for stochastic optimization. In: ICLR (Poster). San Diego: ICLR; 2015. p. 1-15. http://arxiv.org/abs/1412.6980.\n\nVisualizing data using t-sne. Maaten Lvd, G Hinton, J Mach Learn Res. 9Maaten Lvd, Hinton G. Visualizing data using t-sne. J Mach Learn Res. 2008;9:2579-605.\n\nThe relationship between precision-recall and roc curves. J Davis, M Goadrich, Proceedings of the 23rd International Conference on Machine Learning. the 23rd International Conference on Machine LearningNew York, PittsburghAssociation for Computing MachineryDavis J, Goadrich M. The relationship between precision-recall and roc curves. In: Proceedings of the 23rd International Conference on Machine Learning. New York, Pittsburgh: Association for Computing Machinery; 2006. p. 233-40.\n\nPublisher's Note. Publisher's Note\n\nSpringer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations.\n", "annotations": {"author": "[{\"start\":\"74\",\"end\":\"87\"},{\"start\":\"88\",\"end\":\"97\"},{\"start\":\"98\",\"end\":\"112\"}]", "publisher": null, "author_last_name": "[{\"start\":\"82\",\"end\":\"86\"},{\"start\":\"91\",\"end\":\"96\"},{\"start\":\"108\",\"end\":\"111\"}]", "author_first_name": "[{\"start\":\"74\",\"end\":\"81\"},{\"start\":\"88\",\"end\":\"90\"},{\"start\":\"98\",\"end\":\"107\"}]", "author_affiliation": null, "title": "[{\"start\":\"1\",\"end\":\"67\"},{\"start\":\"113\",\"end\":\"179\"}]", "venue": "[{\"start\":\"181\",\"end\":\"212\"}]", "abstract": "[{\"start\":\"345\",\"end\":\"2384\"}]", "bib_ref": "[{\"start\":\"3812\",\"end\":\"3815\",\"attributes\":{\"ref_id\":\"b0\"}},{\"start\":\"3961\",\"end\":\"3964\",\"attributes\":{\"ref_id\":\"b2\"}},{\"start\":\"4313\",\"end\":\"4316\",\"attributes\":{\"ref_id\":\"b3\"}},{\"start\":\"4494\",\"end\":\"4497\",\"attributes\":{\"ref_id\":\"b4\"}},{\"start\":\"4497\",\"end\":\"4499\",\"attributes\":{\"ref_id\":\"b5\"}},{\"start\":\"5343\",\"end\":\"5346\",\"attributes\":{\"ref_id\":\"b6\"}},{\"start\":\"8494\",\"end\":\"8497\",\"attributes\":{\"ref_id\":\"b7\"}},{\"start\":\"8543\",\"end\":\"8546\",\"attributes\":{\"ref_id\":\"b8\"}},{\"start\":\"8546\",\"end\":\"8549\",\"attributes\":{\"ref_id\":\"b9\"}},{\"start\":\"8549\",\"end\":\"8553\",\"attributes\":{\"ref_id\":\"b10\"}},{\"start\":\"8610\",\"end\":\"8613\",\"attributes\":{\"ref_id\":\"b4\"}},{\"start\":\"8694\",\"end\":\"8698\",\"attributes\":{\"ref_id\":\"b11\"}},{\"start\":\"8977\",\"end\":\"8981\",\"attributes\":{\"ref_id\":\"b12\"}},{\"start\":\"9346\",\"end\":\"9350\",\"attributes\":{\"ref_id\":\"b13\"}},{\"start\":\"9471\",\"end\":\"9475\",\"attributes\":{\"ref_id\":\"b14\"}},{\"start\":\"9685\",\"end\":\"9689\",\"attributes\":{\"ref_id\":\"b15\"}},{\"start\":\"9773\",\"end\":\"9777\",\"attributes\":{\"ref_id\":\"b16\"}},{\"start\":\"10515\",\"end\":\"10519\",\"attributes\":{\"ref_id\":\"b17\"}},{\"start\":\"10647\",\"end\":\"10651\",\"attributes\":{\"ref_id\":\"b18\"}},{\"start\":\"10768\",\"end\":\"10772\",\"attributes\":{\"ref_id\":\"b19\"}},{\"start\":\"10844\",\"end\":\"10848\",\"attributes\":{\"ref_id\":\"b20\"}},{\"start\":\"11122\",\"end\":\"11126\",\"attributes\":{\"ref_id\":\"b21\"}},{\"start\":\"11451\",\"end\":\"11455\",\"attributes\":{\"ref_id\":\"b22\"}},{\"start\":\"11750\",\"end\":\"11754\",\"attributes\":{\"ref_id\":\"b23\"}},{\"start\":\"12534\",\"end\":\"12538\",\"attributes\":{\"ref_id\":\"b24\"}},{\"start\":\"12538\",\"end\":\"12542\",\"attributes\":{\"ref_id\":\"b25\"}},{\"start\":\"12542\",\"end\":\"12546\",\"attributes\":{\"ref_id\":\"b26\"}},{\"start\":\"12991\",\"end\":\"12995\",\"attributes\":{\"ref_id\":\"b27\"}},{\"start\":\"12995\",\"end\":\"12998\",\"attributes\":{\"ref_id\":\"b28\"}},{\"start\":\"13016\",\"end\":\"13019\",\"attributes\":{\"ref_id\":\"b6\"}},{\"start\":\"16140\",\"end\":\"16143\",\"attributes\":{\"ref_id\":\"b6\"}},{\"start\":\"16181\",\"end\":\"16184\",\"attributes\":{\"ref_id\":\"b7\"}},{\"start\":\"18495\",\"end\":\"18499\",\"attributes\":{\"ref_id\":\"b29\"}},{\"start\":\"18898\",\"end\":\"18902\",\"attributes\":{\"ref_id\":\"b30\"}},{\"start\":\"20760\",\"end\":\"20764\",\"attributes\":{\"ref_id\":\"b31\"}},{\"start\":\"21394\",\"end\":\"21398\",\"attributes\":{\"ref_id\":\"b20\"}},{\"start\":\"22927\",\"end\":\"22931\",\"attributes\":{\"ref_id\":\"b13\"}},{\"start\":\"25327\",\"end\":\"25331\",\"attributes\":{\"ref_id\":\"b32\"}},{\"start\":\"25342\",\"end\":\"25346\",\"attributes\":{\"ref_id\":\"b33\"}},{\"start\":\"26060\",\"end\":\"26064\",\"attributes\":{\"ref_id\":\"b34\"}},{\"start\":\"27349\",\"end\":\"27353\",\"attributes\":{\"ref_id\":\"b11\"}},{\"start\":\"27454\",\"end\":\"27457\",\"attributes\":{\"ref_id\":\"b4\"}},{\"start\":\"27551\",\"end\":\"27554\",\"attributes\":{\"ref_id\":\"b6\"}},{\"start\":\"27658\",\"end\":\"27662\",\"attributes\":{\"ref_id\":\"b35\"}},{\"start\":\"28904\",\"end\":\"28908\",\"attributes\":{\"ref_id\":\"b36\"}},{\"start\":\"29655\",\"end\":\"29658\",\"attributes\":{\"ref_id\":\"b4\"}},{\"start\":\"29836\",\"end\":\"29840\",\"attributes\":{\"ref_id\":\"b22\"}},{\"start\":\"30042\",\"end\":\"30045\",\"attributes\":{\"ref_id\":\"b6\"}},{\"start\":\"39210\",\"end\":\"39213\",\"attributes\":{\"ref_id\":\"b6\"}}]", "figure": "[{\"start\":\"41238\",\"end\":\"41317\",\"attributes\":{\"id\":\"fig_0\"}},{\"start\":\"41318\",\"end\":\"41604\",\"attributes\":{\"id\":\"fig_1\"}},{\"start\":\"41605\",\"end\":\"41744\",\"attributes\":{\"id\":\"fig_2\"}},{\"start\":\"41745\",\"end\":\"42144\",\"attributes\":{\"id\":\"fig_3\"}},{\"start\":\"42145\",\"end\":\"42467\",\"attributes\":{\"id\":\"fig_4\"}},{\"start\":\"42468\",\"end\":\"42732\",\"attributes\":{\"id\":\"tab_0\",\"type\":\"table\"}},{\"start\":\"42733\",\"end\":\"42776\",\"attributes\":{\"id\":\"tab_2\",\"type\":\"table\"}}]", "paragraph": "[{\"start\":\"2398\",\"end\":\"2790\"},{\"start\":\"2792\",\"end\":\"3413\"},{\"start\":\"3415\",\"end\":\"4317\"},{\"start\":\"4319\",\"end\":\"5187\"},{\"start\":\"5189\",\"end\":\"5240\"},{\"start\":\"5242\",\"end\":\"6248\"},{\"start\":\"6250\",\"end\":\"6634\"},{\"start\":\"6636\",\"end\":\"7579\"},{\"start\":\"7581\",\"end\":\"8027\"},{\"start\":\"8044\",\"end\":\"8148\"},{\"start\":\"8185\",\"end\":\"8373\"},{\"start\":\"8375\",\"end\":\"9305\"},{\"start\":\"9307\",\"end\":\"10177\"},{\"start\":\"10179\",\"end\":\"10359\"},{\"start\":\"10407\",\"end\":\"11431\"},{\"start\":\"11433\",\"end\":\"12250\"},{\"start\":\"12275\",\"end\":\"13565\"},{\"start\":\"13577\",\"end\":\"14100\"},{\"start\":\"14123\",\"end\":\"15530\"},{\"start\":\"15532\",\"end\":\"15810\"},{\"start\":\"15842\",\"end\":\"16675\"},{\"start\":\"16737\",\"end\":\"17992\"},{\"start\":\"17994\",\"end\":\"19418\"},{\"start\":\"19420\",\"end\":\"20446\"},{\"start\":\"20448\",\"end\":\"21296\"},{\"start\":\"21298\",\"end\":\"21780\"},{\"start\":\"21845\",\"end\":\"22472\"},{\"start\":\"22503\",\"end\":\"22604\"},{\"start\":\"22606\",\"end\":\"22932\"},{\"start\":\"22987\",\"end\":\"23054\"},{\"start\":\"23083\",\"end\":\"23137\"},{\"start\":\"23168\",\"end\":\"23226\"},{\"start\":\"23228\",\"end\":\"23310\"},{\"start\":\"23324\",\"end\":\"23351\"},{\"start\":\"23353\",\"end\":\"23403\"},{\"start\":\"23423\",\"end\":\"23485\"},{\"start\":\"23487\",\"end\":\"23590\"},{\"start\":\"23592\",\"end\":\"23768\"},{\"start\":\"23804\",\"end\":\"23943\"},{\"start\":\"23956\",\"end\":\"24298\"},{\"start\":\"24324\",\"end\":\"24538\"},{\"start\":\"24563\",\"end\":\"24765\"},{\"start\":\"24781\",\"end\":\"24951\"},{\"start\":\"24976\",\"end\":\"25424\"},{\"start\":\"25462\",\"end\":\"25705\"},{\"start\":\"25760\",\"end\":\"26616\"},{\"start\":\"26662\",\"end\":\"27191\"},{\"start\":\"27193\",\"end\":\"27298\"},{\"start\":\"27320\",\"end\":\"27854\"},{\"start\":\"27875\",\"end\":\"28788\"},{\"start\":\"28810\",\"end\":\"29264\"},{\"start\":\"29266\",\"end\":\"29520\"},{\"start\":\"29547\",\"end\":\"30713\"},{\"start\":\"30750\",\"end\":\"31162\"},{\"start\":\"31164\",\"end\":\"32596\"},{\"start\":\"32598\",\"end\":\"33899\"},{\"start\":\"33901\",\"end\":\"34489\"},{\"start\":\"34518\",\"end\":\"34859\"},{\"start\":\"34861\",\"end\":\"36246\"},{\"start\":\"36261\",\"end\":\"37644\"},{\"start\":\"37646\",\"end\":\"38773\"},{\"start\":\"38775\",\"end\":\"39250\"},{\"start\":\"39252\",\"end\":\"39725\"},{\"start\":\"39741\",\"end\":\"40761\"},{\"start\":\"40763\",\"end\":\"41237\"}]", "formula": "[{\"start\":\"16676\",\"end\":\"16703\",\"attributes\":{\"id\":\"formula_0\"}},{\"start\":\"21781\",\"end\":\"21844\",\"attributes\":{\"id\":\"formula_1\"}},{\"start\":\"22473\",\"end\":\"22502\",\"attributes\":{\"id\":\"formula_2\"}},{\"start\":\"22933\",\"end\":\"22976\",\"attributes\":{\"id\":\"formula_3\"}},{\"start\":\"23769\",\"end\":\"23803\",\"attributes\":{\"id\":\"formula_4\"}},{\"start\":\"23944\",\"end\":\"23955\",\"attributes\":{\"id\":\"formula_5\"}},{\"start\":\"24299\",\"end\":\"24323\",\"attributes\":{\"id\":\"formula_6\"}},{\"start\":\"24766\",\"end\":\"24780\",\"attributes\":{\"id\":\"formula_7\"}},{\"start\":\"24952\",\"end\":\"24975\",\"attributes\":{\"id\":\"formula_8\"}},{\"start\":\"25425\",\"end\":\"25461\",\"attributes\":{\"id\":\"formula_9\"}},{\"start\":\"25706\",\"end\":\"25759\",\"attributes\":{\"id\":\"formula_10\"}},{\"start\":\"26617\",\"end\":\"26661\",\"attributes\":{\"id\":\"formula_11\"}}]", "table_ref": "[{\"start\":\"14611\",\"end\":\"14618\",\"attributes\":{\"ref_id\":\"tab_0\"}},{\"start\":\"19568\",\"end\":\"19575\"},{\"start\":\"31193\",\"end\":\"31200\",\"attributes\":{\"ref_id\":\"tab_2\"}},{\"start\":\"36597\",\"end\":\"36604\",\"attributes\":{\"ref_id\":\"tab_2\"}}]", "section_header": "[{\"start\":\"2386\",\"end\":\"2396\"},{\"start\":\"8030\",\"end\":\"8042\"},{\"start\":\"8151\",\"end\":\"8183\"},{\"start\":\"10362\",\"end\":\"10405\"},{\"start\":\"12253\",\"end\":\"12273\"},{\"start\":\"13568\",\"end\":\"13575\"},{\"start\":\"14103\",\"end\":\"14121\"},{\"start\":\"15813\",\"end\":\"15840\"},{\"start\":\"16705\",\"end\":\"16735\"},{\"start\":\"22978\",\"end\":\"22985\"},{\"start\":\"23057\",\"end\":\"23081\"},{\"start\":\"23140\",\"end\":\"23166\"},{\"start\":\"23313\",\"end\":\"23322\"},{\"start\":\"23406\",\"end\":\"23421\"},{\"start\":\"24541\",\"end\":\"24561\"},{\"start\":\"27301\",\"end\":\"27308\"},{\"start\":\"27311\",\"end\":\"27318\"},{\"start\":\"27857\",\"end\":\"27873\"},{\"start\":\"28791\",\"end\":\"28808\"},{\"start\":\"29523\",\"end\":\"29545\"},{\"start\":\"30716\",\"end\":\"30748\"},{\"start\":\"34492\",\"end\":\"34516\"},{\"start\":\"36249\",\"end\":\"36259\"},{\"start\":\"39728\",\"end\":\"39739\"},{\"start\":\"41239\",\"end\":\"41245\"},{\"start\":\"41319\",\"end\":\"41325\"},{\"start\":\"41606\",\"end\":\"41612\"},{\"start\":\"41746\",\"end\":\"41752\"},{\"start\":\"42146\",\"end\":\"42152\"},{\"start\":\"42469\",\"end\":\"42476\"},{\"start\":\"42734\",\"end\":\"42741\"}]", "table": "[{\"start\":\"42723\",\"end\":\"42732\"},{\"start\":\"42768\",\"end\":\"42776\"}]", "figure_caption": "[{\"start\":\"41247\",\"end\":\"41317\"},{\"start\":\"41327\",\"end\":\"41604\"},{\"start\":\"41614\",\"end\":\"41744\"},{\"start\":\"41754\",\"end\":\"42144\"},{\"start\":\"42154\",\"end\":\"42467\"},{\"start\":\"42478\",\"end\":\"42723\"},{\"start\":\"42743\",\"end\":\"42768\"}]", "figure_ref": "[{\"start\":\"2782\",\"end\":\"2788\",\"attributes\":{\"ref_id\":\"fig_0\"}},{\"start\":\"13648\",\"end\":\"13654\",\"attributes\":{\"ref_id\":\"fig_1\"}},{\"start\":\"14267\",\"end\":\"14273\",\"attributes\":{\"ref_id\":\"fig_0\"}},{\"start\":\"16749\",\"end\":\"16755\",\"attributes\":{\"ref_id\":\"fig_1\"}},{\"start\":\"27622\",\"end\":\"27628\",\"attributes\":{\"ref_id\":\"fig_2\"}},{\"start\":\"28120\",\"end\":\"28126\",\"attributes\":{\"ref_id\":\"fig_3\"}},{\"start\":\"32479\",\"end\":\"32487\",\"attributes\":{\"ref_id\":\"fig_4\"}},{\"start\":\"33071\",\"end\":\"33078\",\"attributes\":{\"ref_id\":\"fig_4\"}},{\"start\":\"33234\",\"end\":\"33241\",\"attributes\":{\"ref_id\":\"fig_4\"}},{\"start\":\"33980\",\"end\":\"33986\"},{\"start\":\"34027\",\"end\":\"34033\",\"attributes\":{\"ref_id\":\"fig_4\"}},{\"start\":\"34914\",\"end\":\"34927\"},{\"start\":\"34998\",\"end\":\"35005\"},{\"start\":\"35352\",\"end\":\"35358\"},{\"start\":\"35668\",\"end\":\"35677\"},{\"start\":\"35874\",\"end\":\"35880\"},{\"start\":\"36121\",\"end\":\"36127\"},{\"start\":\"37702\",\"end\":\"37708\"},{\"start\":\"38050\",\"end\":\"38056\"},{\"start\":\"38126\",\"end\":\"38132\",\"attributes\":{\"ref_id\":\"fig_4\"}}]", "bib_author_first_name": "[{\"start\":\"43652\",\"end\":\"43653\"},{\"start\":\"43661\",\"end\":\"43662\"},{\"start\":\"43674\",\"end\":\"43675\"},{\"start\":\"43684\",\"end\":\"43685\"},{\"start\":\"43694\",\"end\":\"43695\"},{\"start\":\"44068\",\"end\":\"44069\"},{\"start\":\"44077\",\"end\":\"44078\"},{\"start\":\"44087\",\"end\":\"44088\"},{\"start\":\"44097\",\"end\":\"44098\"},{\"start\":\"44457\",\"end\":\"44458\"},{\"start\":\"44465\",\"end\":\"44466\"},{\"start\":\"44475\",\"end\":\"44476\"},{\"start\":\"44828\",\"end\":\"44829\"},{\"start\":\"44843\",\"end\":\"44844\"},{\"start\":\"44858\",\"end\":\"44859\"},{\"start\":\"44866\",\"end\":\"44869\"},{\"start\":\"44877\",\"end\":\"44878\"},{\"start\":\"44889\",\"end\":\"44890\"},{\"start\":\"45130\",\"end\":\"45131\"},{\"start\":\"45140\",\"end\":\"45141\"},{\"start\":\"45468\",\"end\":\"45469\"},{\"start\":\"45480\",\"end\":\"45481\"},{\"start\":\"45492\",\"end\":\"45493\"},{\"start\":\"45500\",\"end\":\"45501\"},{\"start\":\"46348\",\"end\":\"46349\"},{\"start\":\"46362\",\"end\":\"46363\"},{\"start\":\"46536\",\"end\":\"46537\"},{\"start\":\"46546\",\"end\":\"46547\"},{\"start\":\"46554\",\"end\":\"46555\"},{\"start\":\"46563\",\"end\":\"46564\"},{\"start\":\"46791\",\"end\":\"46792\"},{\"start\":\"46801\",\"end\":\"46802\"},{\"start\":\"46809\",\"end\":\"46810\"},{\"start\":\"46818\",\"end\":\"46819\"},{\"start\":\"46826\",\"end\":\"46827\"},{\"start\":\"46834\",\"end\":\"46835\"},{\"start\":\"47489\",\"end\":\"47490\"},{\"start\":\"47497\",\"end\":\"47498\"},{\"start\":\"47505\",\"end\":\"47506\"},{\"start\":\"47514\",\"end\":\"47515\"},{\"start\":\"47868\",\"end\":\"47869\"},{\"start\":\"47879\",\"end\":\"47880\"},{\"start\":\"47890\",\"end\":\"47891\"},{\"start\":\"47898\",\"end\":\"47899\"},{\"start\":\"47908\",\"end\":\"47909\"},{\"start\":\"47916\",\"end\":\"47917\"},{\"start\":\"47928\",\"end\":\"47929\"},{\"start\":\"47937\",\"end\":\"47938\"},{\"start\":\"47950\",\"end\":\"47951\"},{\"start\":\"47958\",\"end\":\"47959\"},{\"start\":\"48238\",\"end\":\"48239\"},{\"start\":\"48246\",\"end\":\"48247\"},{\"start\":\"48254\",\"end\":\"48255\"},{\"start\":\"48265\",\"end\":\"48268\"},{\"start\":\"48269\",\"end\":\"48270\"},{\"start\":\"48798\",\"end\":\"48799\"},{\"start\":\"48809\",\"end\":\"48810\"},{\"start\":\"48820\",\"end\":\"48821\"},{\"start\":\"48830\",\"end\":\"48831\"},{\"start\":\"48843\",\"end\":\"48844\"},{\"start\":\"48852\",\"end\":\"48853\"},{\"start\":\"48861\",\"end\":\"48862\"},{\"start\":\"48871\",\"end\":\"48872\"},{\"start\":\"49237\",\"end\":\"49238\"},{\"start\":\"49245\",\"end\":\"49246\"},{\"start\":\"49254\",\"end\":\"49255\"},{\"start\":\"49269\",\"end\":\"49270\"},{\"start\":\"49664\",\"end\":\"49665\"},{\"start\":\"49670\",\"end\":\"49671\"},{\"start\":\"49679\",\"end\":\"49680\"},{\"start\":\"49687\",\"end\":\"49688\"},{\"start\":\"49695\",\"end\":\"49696\"},{\"start\":\"49703\",\"end\":\"49704\"},{\"start\":\"49711\",\"end\":\"49712\"},{\"start\":\"49717\",\"end\":\"49718\"},{\"start\":\"49724\",\"end\":\"49725\"},{\"start\":\"50222\",\"end\":\"50223\"},{\"start\":\"50229\",\"end\":\"50230\"},{\"start\":\"50248\",\"end\":\"50249\"},{\"start\":\"50260\",\"end\":\"50261\"},{\"start\":\"50272\",\"end\":\"50273\"},{\"start\":\"50284\",\"end\":\"50285\"},{\"start\":\"50295\",\"end\":\"50296\"},{\"start\":\"50947\",\"end\":\"50948\"},{\"start\":\"50959\",\"end\":\"50960\"},{\"start\":\"50970\",\"end\":\"50971\"},{\"start\":\"50980\",\"end\":\"50981\"},{\"start\":\"51268\",\"end\":\"51269\"},{\"start\":\"51279\",\"end\":\"51280\"},{\"start\":\"51288\",\"end\":\"51289\"},{\"start\":\"51300\",\"end\":\"51301\"},{\"start\":\"51564\",\"end\":\"51565\"},{\"start\":\"51571\",\"end\":\"51572\"},{\"start\":\"51578\",\"end\":\"51579\"},{\"start\":\"51587\",\"end\":\"51588\"},{\"start\":\"51594\",\"end\":\"51595\"},{\"start\":\"51603\",\"end\":\"51604\"},{\"start\":\"52028\",\"end\":\"52029\"},{\"start\":\"52039\",\"end\":\"52040\"},{\"start\":\"52047\",\"end\":\"52048\"},{\"start\":\"52058\",\"end\":\"52059\"},{\"start\":\"52569\",\"end\":\"52570\"},{\"start\":\"52581\",\"end\":\"52582\"},{\"start\":\"52596\",\"end\":\"52597\"},{\"start\":\"52602\",\"end\":\"52603\"},{\"start\":\"52613\",\"end\":\"52614\"},{\"start\":\"52619\",\"end\":\"52620\"},{\"start\":\"52627\",\"end\":\"52628\"},{\"start\":\"52638\",\"end\":\"52639\"},{\"start\":\"52649\",\"end\":\"52650\"},{\"start\":\"52658\",\"end\":\"52659\"},{\"start\":\"52990\",\"end\":\"52991\"},{\"start\":\"53004\",\"end\":\"53005\"},{\"start\":\"53017\",\"end\":\"53018\"},{\"start\":\"53025\",\"end\":\"53026\"},{\"start\":\"53032\",\"end\":\"53033\"},{\"start\":\"53779\",\"end\":\"53780\"},{\"start\":\"53789\",\"end\":\"53790\"},{\"start\":\"53800\",\"end\":\"53801\"},{\"start\":\"53810\",\"end\":\"53811\"},{\"start\":\"54071\",\"end\":\"54072\"},{\"start\":\"54080\",\"end\":\"54081\"},{\"start\":\"54087\",\"end\":\"54088\"},{\"start\":\"54094\",\"end\":\"54095\"},{\"start\":\"54100\",\"end\":\"54101\"},{\"start\":\"54350\",\"end\":\"54351\"},{\"start\":\"54357\",\"end\":\"54358\"},{\"start\":\"54363\",\"end\":\"54364\"},{\"start\":\"54369\",\"end\":\"54370\"},{\"start\":\"54377\",\"end\":\"54378\"},{\"start\":\"54384\",\"end\":\"54385\"},{\"start\":\"54390\",\"end\":\"54391\"},{\"start\":\"54398\",\"end\":\"54399\"},{\"start\":\"54404\",\"end\":\"54405\"},{\"start\":\"54811\",\"end\":\"54812\"},{\"start\":\"54818\",\"end\":\"54819\"},{\"start\":\"54826\",\"end\":\"54827\"},{\"start\":\"54832\",\"end\":\"54833\"},{\"start\":\"54838\",\"end\":\"54841\"},{\"start\":\"54842\",\"end\":\"54843\"},{\"start\":\"55303\",\"end\":\"55304\"},{\"start\":\"55316\",\"end\":\"55317\"},{\"start\":\"55325\",\"end\":\"55326\"},{\"start\":\"55598\",\"end\":\"55599\"},{\"start\":\"55606\",\"end\":\"55607\"},{\"start\":\"55612\",\"end\":\"55613\"},{\"start\":\"55620\",\"end\":\"55621\"},{\"start\":\"55628\",\"end\":\"55629\"},{\"start\":\"55635\",\"end\":\"55636\"},{\"start\":\"55642\",\"end\":\"55643\"},{\"start\":\"56129\",\"end\":\"56130\"},{\"start\":\"56139\",\"end\":\"56140\"},{\"start\":\"56152\",\"end\":\"56153\"},{\"start\":\"56407\",\"end\":\"56408\"},{\"start\":\"56425\",\"end\":\"56426\"},{\"start\":\"56435\",\"end\":\"56436\"},{\"start\":\"56445\",\"end\":\"56446\"},{\"start\":\"56456\",\"end\":\"56457\"},{\"start\":\"56467\",\"end\":\"56468\"},{\"start\":\"56749\",\"end\":\"56750\"},{\"start\":\"56757\",\"end\":\"56758\"},{\"start\":\"56763\",\"end\":\"56764\"},{\"start\":\"56771\",\"end\":\"56772\"},{\"start\":\"56780\",\"end\":\"56781\"},{\"start\":\"56788\",\"end\":\"56789\"},{\"start\":\"56797\",\"end\":\"56798\"},{\"start\":\"56806\",\"end\":\"56811\"},{\"start\":\"56812\",\"end\":\"56813\"},{\"start\":\"57350\",\"end\":\"57351\"},{\"start\":\"57359\",\"end\":\"57360\"},{\"start\":\"57369\",\"end\":\"57370\"},{\"start\":\"57377\",\"end\":\"57378\"},{\"start\":\"57385\",\"end\":\"57386\"},{\"start\":\"57394\",\"end\":\"57395\"},{\"start\":\"57402\",\"end\":\"57403\"},{\"start\":\"57411\",\"end\":\"57412\"},{\"start\":\"57423\",\"end\":\"57424\"},{\"start\":\"57433\",\"end\":\"57434\"},{\"start\":\"57791\",\"end\":\"57792\"},{\"start\":\"57966\",\"end\":\"57967\"},{\"start\":\"57976\",\"end\":\"57977\"},{\"start\":\"58192\",\"end\":\"58198\"},{\"start\":\"58204\",\"end\":\"58205\"},{\"start\":\"58379\",\"end\":\"58380\"},{\"start\":\"58388\",\"end\":\"58389\"}]", "bib_author_last_name": "[{\"start\":\"43654\",\"end\":\"43659\"},{\"start\":\"43663\",\"end\":\"43672\"},{\"start\":\"43676\",\"end\":\"43682\"},{\"start\":\"43686\",\"end\":\"43692\"},{\"start\":\"43696\",\"end\":\"43704\"},{\"start\":\"44070\",\"end\":\"44075\"},{\"start\":\"44079\",\"end\":\"44085\"},{\"start\":\"44089\",\"end\":\"44095\"},{\"start\":\"44099\",\"end\":\"44108\"},{\"start\":\"44459\",\"end\":\"44463\"},{\"start\":\"44467\",\"end\":\"44473\"},{\"start\":\"44477\",\"end\":\"44484\"},{\"start\":\"44830\",\"end\":\"44841\"},{\"start\":\"44845\",\"end\":\"44856\"},{\"start\":\"44860\",\"end\":\"44864\"},{\"start\":\"44870\",\"end\":\"44875\"},{\"start\":\"44879\",\"end\":\"44887\"},{\"start\":\"45132\",\"end\":\"45138\"},{\"start\":\"45142\",\"end\":\"45148\"},{\"start\":\"45470\",\"end\":\"45478\"},{\"start\":\"45482\",\"end\":\"45490\"},{\"start\":\"45494\",\"end\":\"45498\"},{\"start\":\"45502\",\"end\":\"45512\"},{\"start\":\"46350\",\"end\":\"46360\"},{\"start\":\"46364\",\"end\":\"46375\"},{\"start\":\"46538\",\"end\":\"46544\"},{\"start\":\"46548\",\"end\":\"46552\"},{\"start\":\"46556\",\"end\":\"46561\"},{\"start\":\"46565\",\"end\":\"46571\"},{\"start\":\"46793\",\"end\":\"46799\"},{\"start\":\"46803\",\"end\":\"46807\"},{\"start\":\"46811\",\"end\":\"46816\"},{\"start\":\"46820\",\"end\":\"46824\"},{\"start\":\"46828\",\"end\":\"46832\"},{\"start\":\"46836\",\"end\":\"46840\"},{\"start\":\"47491\",\"end\":\"47495\"},{\"start\":\"47499\",\"end\":\"47503\"},{\"start\":\"47507\",\"end\":\"47512\"},{\"start\":\"47516\",\"end\":\"47525\"},{\"start\":\"47870\",\"end\":\"47877\"},{\"start\":\"47881\",\"end\":\"47888\"},{\"start\":\"47892\",\"end\":\"47896\"},{\"start\":\"47900\",\"end\":\"47906\"},{\"start\":\"47910\",\"end\":\"47914\"},{\"start\":\"47918\",\"end\":\"47926\"},{\"start\":\"47930\",\"end\":\"47935\"},{\"start\":\"47939\",\"end\":\"47948\"},{\"start\":\"47952\",\"end\":\"47956\"},{\"start\":\"47960\",\"end\":\"47964\"},{\"start\":\"48240\",\"end\":\"48244\"},{\"start\":\"48248\",\"end\":\"48252\"},{\"start\":\"48256\",\"end\":\"48263\"},{\"start\":\"48271\",\"end\":\"48275\"},{\"start\":\"48800\",\"end\":\"48807\"},{\"start\":\"48811\",\"end\":\"48818\"},{\"start\":\"48822\",\"end\":\"48828\"},{\"start\":\"48832\",\"end\":\"48841\"},{\"start\":\"48845\",\"end\":\"48850\"},{\"start\":\"48854\",\"end\":\"48859\"},{\"start\":\"48863\",\"end\":\"48869\"},{\"start\":\"48873\",\"end\":\"48883\"},{\"start\":\"49239\",\"end\":\"49243\"},{\"start\":\"49247\",\"end\":\"49252\"},{\"start\":\"49256\",\"end\":\"49267\"},{\"start\":\"49271\",\"end\":\"49278\"},{\"start\":\"49666\",\"end\":\"49668\"},{\"start\":\"49672\",\"end\":\"49677\"},{\"start\":\"49681\",\"end\":\"49685\"},{\"start\":\"49689\",\"end\":\"49693\"},{\"start\":\"49697\",\"end\":\"49701\"},{\"start\":\"49705\",\"end\":\"49709\"},{\"start\":\"49713\",\"end\":\"49715\"},{\"start\":\"49719\",\"end\":\"49722\"},{\"start\":\"49726\",\"end\":\"49729\"},{\"start\":\"49731\",\"end\":\"49738\"},{\"start\":\"50224\",\"end\":\"50227\"},{\"start\":\"50231\",\"end\":\"50246\"},{\"start\":\"50250\",\"end\":\"50258\"},{\"start\":\"50262\",\"end\":\"50270\"},{\"start\":\"50274\",\"end\":\"50282\"},{\"start\":\"50286\",\"end\":\"50293\"},{\"start\":\"50297\",\"end\":\"50303\"},{\"start\":\"50949\",\"end\":\"50957\"},{\"start\":\"50961\",\"end\":\"50968\"},{\"start\":\"50972\",\"end\":\"50978\"},{\"start\":\"50982\",\"end\":\"50990\"},{\"start\":\"51270\",\"end\":\"51277\"},{\"start\":\"51281\",\"end\":\"51286\"},{\"start\":\"51290\",\"end\":\"51298\"},{\"start\":\"51302\",\"end\":\"51310\"},{\"start\":\"51566\",\"end\":\"51569\"},{\"start\":\"51573\",\"end\":\"51576\"},{\"start\":\"51580\",\"end\":\"51585\"},{\"start\":\"51589\",\"end\":\"51592\"},{\"start\":\"51596\",\"end\":\"51601\"},{\"start\":\"51605\",\"end\":\"51609\"},{\"start\":\"52030\",\"end\":\"52037\"},{\"start\":\"52041\",\"end\":\"52045\"},{\"start\":\"52049\",\"end\":\"52056\"},{\"start\":\"52060\",\"end\":\"52064\"},{\"start\":\"52571\",\"end\":\"52579\"},{\"start\":\"52583\",\"end\":\"52594\"},{\"start\":\"52598\",\"end\":\"52600\"},{\"start\":\"52604\",\"end\":\"52611\"},{\"start\":\"52615\",\"end\":\"52617\"},{\"start\":\"52621\",\"end\":\"52625\"},{\"start\":\"52629\",\"end\":\"52634\"},{\"start\":\"52640\",\"end\":\"52647\"},{\"start\":\"52651\",\"end\":\"52656\"},{\"start\":\"52660\",\"end\":\"52665\"},{\"start\":\"52992\",\"end\":\"53002\"},{\"start\":\"53006\",\"end\":\"53015\"},{\"start\":\"53019\",\"end\":\"53023\"},{\"start\":\"53027\",\"end\":\"53030\"},{\"start\":\"53034\",\"end\":\"53044\"},{\"start\":\"53781\",\"end\":\"53787\"},{\"start\":\"53791\",\"end\":\"53798\"},{\"start\":\"53802\",\"end\":\"53808\"},{\"start\":\"53812\",\"end\":\"53823\"},{\"start\":\"54073\",\"end\":\"54078\"},{\"start\":\"54082\",\"end\":\"54085\"},{\"start\":\"54089\",\"end\":\"54092\"},{\"start\":\"54096\",\"end\":\"54098\"},{\"start\":\"54102\",\"end\":\"54106\"},{\"start\":\"54352\",\"end\":\"54355\"},{\"start\":\"54359\",\"end\":\"54361\"},{\"start\":\"54365\",\"end\":\"54367\"},{\"start\":\"54371\",\"end\":\"54375\"},{\"start\":\"54379\",\"end\":\"54382\"},{\"start\":\"54386\",\"end\":\"54388\"},{\"start\":\"54392\",\"end\":\"54396\"},{\"start\":\"54400\",\"end\":\"54402\"},{\"start\":\"54406\",\"end\":\"54408\"},{\"start\":\"54813\",\"end\":\"54816\"},{\"start\":\"54820\",\"end\":\"54824\"},{\"start\":\"54828\",\"end\":\"54830\"},{\"start\":\"54834\",\"end\":\"54836\"},{\"start\":\"55305\",\"end\":\"55314\"},{\"start\":\"55318\",\"end\":\"55323\"},{\"start\":\"55327\",\"end\":\"55333\"},{\"start\":\"55600\",\"end\":\"55604\"},{\"start\":\"55608\",\"end\":\"55610\"},{\"start\":\"55614\",\"end\":\"55618\"},{\"start\":\"55622\",\"end\":\"55626\"},{\"start\":\"55630\",\"end\":\"55633\"},{\"start\":\"55637\",\"end\":\"55640\"},{\"start\":\"55644\",\"end\":\"55648\"},{\"start\":\"56131\",\"end\":\"56137\"},{\"start\":\"56141\",\"end\":\"56150\"},{\"start\":\"56154\",\"end\":\"56160\"},{\"start\":\"56409\",\"end\":\"56423\"},{\"start\":\"56427\",\"end\":\"56433\"},{\"start\":\"56437\",\"end\":\"56443\"},{\"start\":\"56447\",\"end\":\"56454\"},{\"start\":\"56458\",\"end\":\"56465\"},{\"start\":\"56469\",\"end\":\"56475\"},{\"start\":\"56751\",\"end\":\"56755\"},{\"start\":\"56759\",\"end\":\"56761\"},{\"start\":\"56765\",\"end\":\"56769\"},{\"start\":\"56773\",\"end\":\"56778\"},{\"start\":\"56782\",\"end\":\"56786\"},{\"start\":\"56790\",\"end\":\"56795\"},{\"start\":\"56799\",\"end\":\"56804\"},{\"start\":\"57352\",\"end\":\"57357\"},{\"start\":\"57361\",\"end\":\"57367\"},{\"start\":\"57371\",\"end\":\"57375\"},{\"start\":\"57379\",\"end\":\"57383\"},{\"start\":\"57387\",\"end\":\"57392\"},{\"start\":\"57396\",\"end\":\"57400\"},{\"start\":\"57404\",\"end\":\"57409\"},{\"start\":\"57413\",\"end\":\"57421\"},{\"start\":\"57425\",\"end\":\"57431\"},{\"start\":\"57435\",\"end\":\"57440\"},{\"start\":\"57793\",\"end\":\"57799\"},{\"start\":\"57968\",\"end\":\"57974\"},{\"start\":\"57978\",\"end\":\"57980\"},{\"start\":\"57982\",\"end\":\"57986\"},{\"start\":\"58199\",\"end\":\"58202\"},{\"start\":\"58206\",\"end\":\"58212\"},{\"start\":\"58381\",\"end\":\"58386\"},{\"start\":\"58390\",\"end\":\"58398\"}]", "bib_entry": "[{\"start\":\"43650\",\"end\":\"43759\",\"attributes\":{\"id\":\"b0\"}},{\"start\":\"43761\",\"end\":\"44010\",\"attributes\":{\"matched_paper_id\":\"44301003\",\"id\":\"b1\"}},{\"start\":\"44012\",\"end\":\"44255\",\"attributes\":{\"matched_paper_id\":\"39168814\",\"id\":\"b2\"}},{\"start\":\"44257\",\"end\":\"44758\",\"attributes\":{\"matched_paper_id\":\"12040834\",\"id\":\"b3\"}},{\"start\":\"44760\",\"end\":\"45057\",\"attributes\":{\"matched_paper_id\":\"14502739\",\"id\":\"b4\"}},{\"start\":\"45059\",\"end\":\"45403\",\"attributes\":{\"matched_paper_id\":\"108300573\",\"id\":\"b5\"}},{\"start\":\"45405\",\"end\":\"46322\",\"attributes\":{\"matched_paper_id\":\"202719390\",\"id\":\"b6\",\"doi\":\"10.18653/v1/D19-1678\"}},{\"start\":\"46324\",\"end\":\"46476\",\"attributes\":{\"matched_paper_id\":\"1915014\",\"id\":\"b7\"}},{\"start\":\"46478\",\"end\":\"46741\",\"attributes\":{\"id\":\"b8\",\"doi\":\"arXiv:1511.03677\"}},{\"start\":\"46743\",\"end\":\"47424\",\"attributes\":{\"matched_paper_id\":\"685369\",\"id\":\"b9\",\"doi\":\"10.1145/3097983.3097997\"}},{\"start\":\"47426\",\"end\":\"47811\",\"attributes\":{\"matched_paper_id\":\"5307128\",\"id\":\"b10\"}},{\"start\":\"47813\",\"end\":\"48151\",\"attributes\":{\"matched_paper_id\":\"33285731\",\"id\":\"b11\"}},{\"start\":\"48153\",\"end\":\"48769\",\"attributes\":{\"matched_paper_id\":\"53037206\",\"id\":\"b12\"}},{\"start\":\"48771\",\"end\":\"49160\",\"attributes\":{\"matched_paper_id\":\"13756489\",\"id\":\"b13\"}},{\"start\":\"49162\",\"end\":\"49584\",\"attributes\":{\"matched_paper_id\":\"5985448\",\"id\":\"b14\"}},{\"start\":\"49586\",\"end\":\"50125\",\"attributes\":{\"matched_paper_id\":\"208310294\",\"id\":\"b15\"}},{\"start\":\"50127\",\"end\":\"50869\",\"attributes\":{\"matched_paper_id\":\"5590763\",\"id\":\"b16\"}},{\"start\":\"50871\",\"end\":\"51185\",\"attributes\":{\"id\":\"b17\",\"doi\":\"arXiv:1612.00467\"}},{\"start\":\"51187\",\"end\":\"51509\",\"attributes\":{\"id\":\"b18\",\"doi\":\"arXiv:1811.12793\"}},{\"start\":\"51511\",\"end\":\"51964\",\"attributes\":{\"matched_paper_id\":\"47012730\",\"id\":\"b19\"}},{\"start\":\"51966\",\"end\":\"52456\",\"attributes\":{\"matched_paper_id\":\"5959482\",\"id\":\"b20\"}},{\"start\":\"52458\",\"end\":\"52928\",\"attributes\":{\"matched_paper_id\":\"3634775\",\"id\":\"b21\"}},{\"start\":\"52930\",\"end\":\"53731\",\"attributes\":{\"matched_paper_id\":\"3305987\",\"id\":\"b22\"}},{\"start\":\"53733\",\"end\":\"53980\",\"attributes\":{\"matched_paper_id\":\"199543354\",\"id\":\"b23\"}},{\"start\":\"53982\",\"end\":\"54279\",\"attributes\":{\"matched_paper_id\":\"189991835\",\"id\":\"b24\"}},{\"start\":\"54281\",\"end\":\"54712\",\"attributes\":{\"matched_paper_id\":\"3600371\",\"id\":\"b25\"}},{\"start\":\"54714\",\"end\":\"55251\",\"attributes\":{\"matched_paper_id\":\"70300566\",\"id\":\"b26\"}},{\"start\":\"55253\",\"end\":\"55531\",\"attributes\":{\"matched_paper_id\":\"207240067\",\"id\":\"b27\"}},{\"start\":\"55533\",\"end\":\"56053\",\"attributes\":{\"matched_paper_id\":\"155099980\",\"id\":\"b28\"}},{\"start\":\"56055\",\"end\":\"56319\",\"attributes\":{\"matched_paper_id\":\"3897922\",\"id\":\"b29\"}},{\"start\":\"56321\",\"end\":\"56686\",\"attributes\":{\"matched_paper_id\":\"147706962\",\"id\":\"b30\"}},{\"start\":\"56688\",\"end\":\"57293\",\"attributes\":{\"matched_paper_id\":\"13701579\",\"id\":\"b31\"}},{\"start\":\"57295\",\"end\":\"57766\",\"attributes\":{\"matched_paper_id\":\"6287870\",\"id\":\"b32\"}},{\"start\":\"57768\",\"end\":\"57926\",\"attributes\":{\"matched_paper_id\":\"64680219\",\"id\":\"b33\"}},{\"start\":\"57928\",\"end\":\"58160\",\"attributes\":{\"id\":\"b34\"}},{\"start\":\"58162\",\"end\":\"58319\",\"attributes\":{\"matched_paper_id\":\"5855042\",\"id\":\"b35\"}},{\"start\":\"58321\",\"end\":\"58806\",\"attributes\":{\"matched_paper_id\":\"207159665\",\"id\":\"b36\"}},{\"start\":\"58808\",\"end\":\"58842\",\"attributes\":{\"id\":\"b37\"}},{\"start\":\"58844\",\"end\":\"59081\",\"attributes\":{\"id\":\"b38\"}}]", "bib_title": "[{\"start\":\"43761\",\"end\":\"43861\"},{\"start\":\"44012\",\"end\":\"44066\"},{\"start\":\"44257\",\"end\":\"44455\"},{\"start\":\"44760\",\"end\":\"44826\"},{\"start\":\"45059\",\"end\":\"45128\"},{\"start\":\"45405\",\"end\":\"45466\"},{\"start\":\"46324\",\"end\":\"46346\"},{\"start\":\"46743\",\"end\":\"46789\"},{\"start\":\"47426\",\"end\":\"47487\"},{\"start\":\"47813\",\"end\":\"47866\"},{\"start\":\"48153\",\"end\":\"48236\"},{\"start\":\"48771\",\"end\":\"48796\"},{\"start\":\"49162\",\"end\":\"49235\"},{\"start\":\"49586\",\"end\":\"49662\"},{\"start\":\"50127\",\"end\":\"50220\"},{\"start\":\"51511\",\"end\":\"51562\"},{\"start\":\"51966\",\"end\":\"52026\"},{\"start\":\"52458\",\"end\":\"52567\"},{\"start\":\"52930\",\"end\":\"52988\"},{\"start\":\"53733\",\"end\":\"53777\"},{\"start\":\"53982\",\"end\":\"54069\"},{\"start\":\"54281\",\"end\":\"54348\"},{\"start\":\"54714\",\"end\":\"54809\"},{\"start\":\"55253\",\"end\":\"55301\"},{\"start\":\"55533\",\"end\":\"55596\"},{\"start\":\"56055\",\"end\":\"56127\"},{\"start\":\"56321\",\"end\":\"56405\"},{\"start\":\"56688\",\"end\":\"56747\"},{\"start\":\"57295\",\"end\":\"57348\"},{\"start\":\"57768\",\"end\":\"57789\"},{\"start\":\"57928\",\"end\":\"57964\"},{\"start\":\"58162\",\"end\":\"58190\"},{\"start\":\"58321\",\"end\":\"58377\"}]", "bib_author": "[{\"start\":\"43652\",\"end\":\"43661\"},{\"start\":\"43661\",\"end\":\"43674\"},{\"start\":\"43674\",\"end\":\"43684\"},{\"start\":\"43684\",\"end\":\"43694\"},{\"start\":\"43694\",\"end\":\"43706\"},{\"start\":\"44068\",\"end\":\"44077\"},{\"start\":\"44077\",\"end\":\"44087\"},{\"start\":\"44087\",\"end\":\"44097\"},{\"start\":\"44097\",\"end\":\"44110\"},{\"start\":\"44457\",\"end\":\"44465\"},{\"start\":\"44465\",\"end\":\"44475\"},{\"start\":\"44475\",\"end\":\"44486\"},{\"start\":\"44828\",\"end\":\"44843\"},{\"start\":\"44843\",\"end\":\"44858\"},{\"start\":\"44858\",\"end\":\"44866\"},{\"start\":\"44866\",\"end\":\"44877\"},{\"start\":\"44877\",\"end\":\"44889\"},{\"start\":\"44889\",\"end\":\"44893\"},{\"start\":\"45130\",\"end\":\"45140\"},{\"start\":\"45140\",\"end\":\"45150\"},{\"start\":\"45468\",\"end\":\"45480\"},{\"start\":\"45480\",\"end\":\"45492\"},{\"start\":\"45492\",\"end\":\"45500\"},{\"start\":\"45500\",\"end\":\"45514\"},{\"start\":\"46348\",\"end\":\"46362\"},{\"start\":\"46362\",\"end\":\"46377\"},{\"start\":\"46536\",\"end\":\"46546\"},{\"start\":\"46546\",\"end\":\"46554\"},{\"start\":\"46554\",\"end\":\"46563\"},{\"start\":\"46563\",\"end\":\"46573\"},{\"start\":\"46791\",\"end\":\"46801\"},{\"start\":\"46801\",\"end\":\"46809\"},{\"start\":\"46809\",\"end\":\"46818\"},{\"start\":\"46818\",\"end\":\"46826\"},{\"start\":\"46826\",\"end\":\"46834\"},{\"start\":\"46834\",\"end\":\"46842\"},{\"start\":\"47489\",\"end\":\"47497\"},{\"start\":\"47497\",\"end\":\"47505\"},{\"start\":\"47505\",\"end\":\"47514\"},{\"start\":\"47514\",\"end\":\"47527\"},{\"start\":\"47868\",\"end\":\"47879\"},{\"start\":\"47879\",\"end\":\"47890\"},{\"start\":\"47890\",\"end\":\"47898\"},{\"start\":\"47898\",\"end\":\"47908\"},{\"start\":\"47908\",\"end\":\"47916\"},{\"start\":\"47916\",\"end\":\"47928\"},{\"start\":\"47928\",\"end\":\"47937\"},{\"start\":\"47937\",\"end\":\"47950\"},{\"start\":\"47950\",\"end\":\"47958\"},{\"start\":\"47958\",\"end\":\"47966\"},{\"start\":\"48238\",\"end\":\"48246\"},{\"start\":\"48246\",\"end\":\"48254\"},{\"start\":\"48254\",\"end\":\"48265\"},{\"start\":\"48265\",\"end\":\"48277\"},{\"start\":\"48798\",\"end\":\"48809\"},{\"start\":\"48809\",\"end\":\"48820\"},{\"start\":\"48820\",\"end\":\"48830\"},{\"start\":\"48830\",\"end\":\"48843\"},{\"start\":\"48843\",\"end\":\"48852\"},{\"start\":\"48852\",\"end\":\"48861\"},{\"start\":\"48861\",\"end\":\"48871\"},{\"start\":\"48871\",\"end\":\"48885\"},{\"start\":\"49237\",\"end\":\"49245\"},{\"start\":\"49245\",\"end\":\"49254\"},{\"start\":\"49254\",\"end\":\"49269\"},{\"start\":\"49269\",\"end\":\"49280\"},{\"start\":\"49664\",\"end\":\"49670\"},{\"start\":\"49670\",\"end\":\"49679\"},{\"start\":\"49679\",\"end\":\"49687\"},{\"start\":\"49687\",\"end\":\"49695\"},{\"start\":\"49695\",\"end\":\"49703\"},{\"start\":\"49703\",\"end\":\"49711\"},{\"start\":\"49711\",\"end\":\"49717\"},{\"start\":\"49717\",\"end\":\"49724\"},{\"start\":\"49724\",\"end\":\"49731\"},{\"start\":\"49731\",\"end\":\"49740\"},{\"start\":\"50222\",\"end\":\"50229\"},{\"start\":\"50229\",\"end\":\"50248\"},{\"start\":\"50248\",\"end\":\"50260\"},{\"start\":\"50260\",\"end\":\"50272\"},{\"start\":\"50272\",\"end\":\"50284\"},{\"start\":\"50284\",\"end\":\"50295\"},{\"start\":\"50295\",\"end\":\"50305\"},{\"start\":\"50947\",\"end\":\"50959\"},{\"start\":\"50959\",\"end\":\"50970\"},{\"start\":\"50970\",\"end\":\"50980\"},{\"start\":\"50980\",\"end\":\"50992\"},{\"start\":\"51268\",\"end\":\"51279\"},{\"start\":\"51279\",\"end\":\"51288\"},{\"start\":\"51288\",\"end\":\"51300\"},{\"start\":\"51300\",\"end\":\"51312\"},{\"start\":\"51564\",\"end\":\"51571\"},{\"start\":\"51571\",\"end\":\"51578\"},{\"start\":\"51578\",\"end\":\"51587\"},{\"start\":\"51587\",\"end\":\"51594\"},{\"start\":\"51594\",\"end\":\"51603\"},{\"start\":\"51603\",\"end\":\"51611\"},{\"start\":\"52028\",\"end\":\"52039\"},{\"start\":\"52039\",\"end\":\"52047\"},{\"start\":\"52047\",\"end\":\"52058\"},{\"start\":\"52058\",\"end\":\"52066\"},{\"start\":\"52569\",\"end\":\"52581\"},{\"start\":\"52581\",\"end\":\"52596\"},{\"start\":\"52596\",\"end\":\"52602\"},{\"start\":\"52602\",\"end\":\"52613\"},{\"start\":\"52613\",\"end\":\"52619\"},{\"start\":\"52619\",\"end\":\"52627\"},{\"start\":\"52627\",\"end\":\"52638\"},{\"start\":\"52638\",\"end\":\"52649\"},{\"start\":\"52649\",\"end\":\"52658\"},{\"start\":\"52658\",\"end\":\"52667\"},{\"start\":\"52990\",\"end\":\"53004\"},{\"start\":\"53004\",\"end\":\"53017\"},{\"start\":\"53017\",\"end\":\"53025\"},{\"start\":\"53025\",\"end\":\"53032\"},{\"start\":\"53032\",\"end\":\"53046\"},{\"start\":\"53779\",\"end\":\"53789\"},{\"start\":\"53789\",\"end\":\"53800\"},{\"start\":\"53800\",\"end\":\"53810\"},{\"start\":\"53810\",\"end\":\"53825\"},{\"start\":\"54071\",\"end\":\"54080\"},{\"start\":\"54080\",\"end\":\"54087\"},{\"start\":\"54087\",\"end\":\"54094\"},{\"start\":\"54094\",\"end\":\"54100\"},{\"start\":\"54100\",\"end\":\"54108\"},{\"start\":\"54350\",\"end\":\"54357\"},{\"start\":\"54357\",\"end\":\"54363\"},{\"start\":\"54363\",\"end\":\"54369\"},{\"start\":\"54369\",\"end\":\"54377\"},{\"start\":\"54377\",\"end\":\"54384\"},{\"start\":\"54384\",\"end\":\"54390\"},{\"start\":\"54390\",\"end\":\"54398\"},{\"start\":\"54398\",\"end\":\"54404\"},{\"start\":\"54404\",\"end\":\"54410\"},{\"start\":\"54811\",\"end\":\"54818\"},{\"start\":\"54818\",\"end\":\"54826\"},{\"start\":\"54826\",\"end\":\"54832\"},{\"start\":\"54832\",\"end\":\"54838\"},{\"start\":\"54838\",\"end\":\"54846\"},{\"start\":\"55303\",\"end\":\"55316\"},{\"start\":\"55316\",\"end\":\"55325\"},{\"start\":\"55325\",\"end\":\"55335\"},{\"start\":\"55598\",\"end\":\"55606\"},{\"start\":\"55606\",\"end\":\"55612\"},{\"start\":\"55612\",\"end\":\"55620\"},{\"start\":\"55620\",\"end\":\"55628\"},{\"start\":\"55628\",\"end\":\"55635\"},{\"start\":\"55635\",\"end\":\"55642\"},{\"start\":\"55642\",\"end\":\"55650\"},{\"start\":\"56129\",\"end\":\"56139\"},{\"start\":\"56139\",\"end\":\"56152\"},{\"start\":\"56152\",\"end\":\"56162\"},{\"start\":\"56407\",\"end\":\"56425\"},{\"start\":\"56425\",\"end\":\"56435\"},{\"start\":\"56435\",\"end\":\"56445\"},{\"start\":\"56445\",\"end\":\"56456\"},{\"start\":\"56456\",\"end\":\"56467\"},{\"start\":\"56467\",\"end\":\"56477\"},{\"start\":\"56749\",\"end\":\"56757\"},{\"start\":\"56757\",\"end\":\"56763\"},{\"start\":\"56763\",\"end\":\"56771\"},{\"start\":\"56771\",\"end\":\"56780\"},{\"start\":\"56780\",\"end\":\"56788\"},{\"start\":\"56788\",\"end\":\"56797\"},{\"start\":\"56797\",\"end\":\"56806\"},{\"start\":\"56806\",\"end\":\"56816\"},{\"start\":\"57350\",\"end\":\"57359\"},{\"start\":\"57359\",\"end\":\"57369\"},{\"start\":\"57369\",\"end\":\"57377\"},{\"start\":\"57377\",\"end\":\"57385\"},{\"start\":\"57385\",\"end\":\"57394\"},{\"start\":\"57394\",\"end\":\"57402\"},{\"start\":\"57402\",\"end\":\"57411\"},{\"start\":\"57411\",\"end\":\"57423\"},{\"start\":\"57423\",\"end\":\"57433\"},{\"start\":\"57433\",\"end\":\"57442\"},{\"start\":\"57791\",\"end\":\"57801\"},{\"start\":\"57966\",\"end\":\"57976\"},{\"start\":\"57976\",\"end\":\"57982\"},{\"start\":\"57982\",\"end\":\"57988\"},{\"start\":\"58192\",\"end\":\"58204\"},{\"start\":\"58204\",\"end\":\"58214\"},{\"start\":\"58379\",\"end\":\"58388\"},{\"start\":\"58388\",\"end\":\"58400\"}]", "bib_venue": "[{\"start\":\"43863\",\"end\":\"43876\"},{\"start\":\"44110\",\"end\":\"44123\"},{\"start\":\"44486\",\"end\":\"44497\"},{\"start\":\"44893\",\"end\":\"44901\"},{\"start\":\"45150\",\"end\":\"45202\"},{\"start\":\"45534\",\"end\":\"45709\"},{\"start\":\"46377\",\"end\":\"46390\"},{\"start\":\"46478\",\"end\":\"46534\"},{\"start\":\"46865\",\"end\":\"46972\"},{\"start\":\"47527\",\"end\":\"47589\"},{\"start\":\"47966\",\"end\":\"47974\"},{\"start\":\"48277\",\"end\":\"48375\"},{\"start\":\"48885\",\"end\":\"48952\"},{\"start\":\"49280\",\"end\":\"49338\"},{\"start\":\"49740\",\"end\":\"49801\"},{\"start\":\"50305\",\"end\":\"50399\"},{\"start\":\"50871\",\"end\":\"50945\"},{\"start\":\"51187\",\"end\":\"51266\"},{\"start\":\"51611\",\"end\":\"51692\"},{\"start\":\"52066\",\"end\":\"52149\"},{\"start\":\"52667\",\"end\":\"52675\"},{\"start\":\"53046\",\"end\":\"53188\"},{\"start\":\"53825\",\"end\":\"53852\"},{\"start\":\"54108\",\"end\":\"54119\"},{\"start\":\"54410\",\"end\":\"54467\"},{\"start\":\"54846\",\"end\":\"54907\"},{\"start\":\"55335\",\"end\":\"55376\"},{\"start\":\"55650\",\"end\":\"55731\"},{\"start\":\"56162\",\"end\":\"56177\"},{\"start\":\"56477\",\"end\":\"56492\"},{\"start\":\"56816\",\"end\":\"56903\"},{\"start\":\"57442\",\"end\":\"57510\"},{\"start\":\"57801\",\"end\":\"57826\"},{\"start\":\"57988\",\"end\":\"58001\"},{\"start\":\"58214\",\"end\":\"58230\"},{\"start\":\"58400\",\"end\":\"58468\"},{\"start\":\"58808\",\"end\":\"58824\"},{\"start\":\"58844\",\"end\":\"58961\"},{\"start\":\"45204\",\"end\":\"45221\"},{\"start\":\"45711\",\"end\":\"45880\"},{\"start\":\"46974\",\"end\":\"47074\"},{\"start\":\"47591\",\"end\":\"47599\"},{\"start\":\"48377\",\"end\":\"48468\"},{\"start\":\"49340\",\"end\":\"49351\"},{\"start\":\"49803\",\"end\":\"49857\"},{\"start\":\"50401\",\"end\":\"50484\"},{\"start\":\"51694\",\"end\":\"51760\"},{\"start\":\"52151\",\"end\":\"52219\"},{\"start\":\"53190\",\"end\":\"53328\"},{\"start\":\"54469\",\"end\":\"54480\"},{\"start\":\"54909\",\"end\":\"54981\"},{\"start\":\"55378\",\"end\":\"55404\"},{\"start\":\"55733\",\"end\":\"55804\"},{\"start\":\"56905\",\"end\":\"56977\"},{\"start\":\"58470\",\"end\":\"58543\"}]"}}}, "year": 2023, "month": 12, "day": 17}