{"id": 232035915, "updated": "2023-10-06 05:37:08.109", "metadata": {"title": "A generative, predictive model for menstrual cycle lengths that accounts for potential self-tracking artifacts in mobile health data", "authors": "[{\"first\":\"Kathy\",\"last\":\"Li\",\"middle\":[]},{\"first\":\"Inigo\",\"last\":\"Urteaga\",\"middle\":[]},{\"first\":\"Amanda\",\"last\":\"Shea\",\"middle\":[]},{\"first\":\"Virginia\",\"last\":\"Vitzthum\",\"middle\":[\"J.\"]},{\"first\":\"Chris\",\"last\":\"Wiggins\",\"middle\":[\"H.\"]},{\"first\":\"No'emie\",\"last\":\"Elhadad\",\"middle\":[]}]", "venue": "ArXiv", "journal": "ArXiv", "publication_date": {"year": 2021, "month": 2, "day": 24}, "abstract": "Mobile health (mHealth) apps such as menstrual trackers provide a rich source of self-tracked health observations that can be leveraged for health-relevant research. However, such data streams have questionable reliability since they hinge on user adherence to the app. Therefore, it is crucial for researchers to separate true behavior from self-tracking artifacts. By taking a machine learning approach to modeling self-tracked cycle lengths, we can both make more informed predictions and learn the underlying structure of the observed data. In this work, we propose and evaluate a hierarchical, generative model for predicting next cycle length based on previously-tracked cycle lengths that accounts explicitly for the possibility of users skipping tracking their period. Our model offers several advantages: 1) accounting explicitly for self-tracking artifacts yields better prediction accuracy as likelihood of skipping increases; 2) because it is a generative model, predictions can be updated online as a given cycle evolves, and we can gain interpretable insight into how these predictions change over time; and 3) its hierarchical nature enables modeling of an individual's cycle length history while incorporating population-level information. Our experiments using mHealth cycle length data encompassing over 186,000 menstruators with over 2 million natural menstrual cycles show that our method yields state-of-the-art performance against neural network-based and summary statistic-based baselines, while providing insights on disentangling menstrual patterns from self-tracking artifacts. This work can benefit users, mHealth app developers, and researchers in better understanding cycle patterns and user adherence.", "fields_of_study": "[\"Computer Science\",\"Biology\",\"Mathematics\"]", "external_ids": {"arxiv": "2102.12439", "mag": null, "acl": null, "pubmed": null, "pubmedcentral": null, "dblp": "journals/corr/abs-2102-12439", "doi": null}}, "content": {"source": {"pdf_hash": "84c36f8ab926029c3d2610d03db2ab9cc23117af", "pdf_src": "Arxiv", "pdf_uri": "[\"https://arxiv.org/pdf/2102.12439v2.pdf\"]", "oa_url_match": false, "oa_info": null}, "grobid": {"id": "429b88040b8e7a3e635707936e71510576127042", "type": "plain-text", "url": "s3://ai2-s2-pdf-extraction-prod/parse-results/s2orc_worker/84c36f8ab926029c3d2610d03db2ab9cc23117af.txt", "contents": "\nA generative, predictive model for menstrual cycle lengths that accounts for potential self-tracking artifacts in mobile health data\nMarch 18, 2021\n\nKathy Li \nDepartment of Applied Physics and Applied Mathematics\nColumbia University\n10027New YorkNY\n\nData Science Institute\nColumbia University\n10027New YorkNY\n\nIñigo Urteaga \nDepartment of Applied Physics and Applied Mathematics\nColumbia University\n10027New YorkNY\n\nData Science Institute\nColumbia University\n10027New YorkNY\n\nAmanda Shea \nClue by BioWink\nAdalbertstraße 7-810999BerlinGermany\n\nVirginia J Vitzthum \nClue by BioWink\nAdalbertstraße 7-810999BerlinGermany\n\nDepartment of Anthropology\nKinsey Institute\nIndiana University\n47405BloomingtonIN\n\nChris H Wiggins \nDepartment of Applied Physics and Applied Mathematics\nColumbia University\n10027New YorkNY\n\nData Science Institute\nColumbia University\n10027New YorkNY\n\nNoémie Elhadad \nData Science Institute\nColumbia University\n10027New YorkNY\n\nDepartment of Biomedical Informatics\nColumbia University\n10032New YorkNY\n\nA generative, predictive model for menstrual cycle lengths that accounts for potential self-tracking artifacts in mobile health data\nMarch 18, 2021* Corresponding author: Noémie Elhadad (noemie.elhadad@columbia.edu)\nMobile health (mHealth) apps such as menstrual trackers provide a rich source of self-tracked health observations that can be leveraged for health-relevant research. However, such data streams have questionable reliability since they hinge on user adherence to the app. Therefore, it is crucial for researchers to separate true behavior from self-tracking artifacts. By taking a machine learning approach to modeling self-tracked cycle lengths, we can both make more informed predictions and learn the underlying structure of the observed data. In this work, we propose and evaluate a hierarchical, generative model for predicting next cycle length based on previously-tracked cycle lengths that accounts explicitly for the possibility of users skipping tracking their period. Our model offers several advantages: 1) accounting explicitly for self-tracking artifacts yields better prediction accuracy as likelihood of skipping increases; 2) because it is a generative model, predictions can be updated online as a given cycle evolves, and we can gain interpretable insight into how these predictions change over time; and 3) its hierarchical nature enables modeling of an individual's cycle length history while incorporating population-level information. Our experiments using mHealth cycle length data encompassing over 186,000 menstruators with over 2 million natural menstrual cycles show that our method yields state-of-the-art performance against neural network-based and summary statistic-based baselines, while providing insights on disentangling menstrual patterns from self-tracking artifacts. This work can benefit users, mHealth app developers, and researchers in better understanding cycle patterns and user adherence.Regardless of the role that menstruation plays in women's lives, it has been consistently overlooked as an important area of research, due to a variety of factors, including societal stigma, normalization of women's pain, lack of knowledge of uterine and menstrual physiology, and limited access to reliable datasets (12, 13). Gender bias in medicine has resulted in the systemic neglect of conditions that disproportionately affect women, leaving them with misdiagnoses and unaddressed pain (14). Improved understanding of physiological processes like menstruation can aid in closing these gaps (15). The vast difference in understanding and solutions for male and female health conditions, despite the fact that menstruation affects half of the world's population, demonstrates how far the field of menstrual research has yet to go.The varied, fluctuating nature of the individual menstrual experience can make it difficult to understand and characterize. Traditionally, it has been primarily studied through survey results; studies have shown that experiences vary both within and between individuals, encompassing not only period length and cycle length (the number of days between subsequent periods(16)), but also qualitative symptoms like period flow, physical pain, and quality of life characteristics (16-26). Efforts have also been made to model and predict menstrual cycle lengths, including representing menstrual cycle lengths as a combination of standard and nonstandard cycles with mixture modeling(27)and linear random effects models (28), accounting for the fact that menstrual cycle behavior evolves with age (29); linear mixed models that include clustering to account for between-women variance (30); and state-space modeling that accounts for between-women and within-women variation (31).More recently, efforts have been made to describe menstrual cycles and symptoms (32-34), as well as related physiological events like ovulation (35, 36) in a quantitative way using self-tracking mobile health (mHealth) data from apps. Such data provide a new opportunity to investigate menstruation on a large-scale, but also require special consideration due to their user-tracked nature. While existing studies importantly acknowledge the necessity of modeling menstrual variability (27-31), there is also a need to understand the underlying mechanisms of menstruation and to develop models that account for the specific nature of mHealth data. mHealth data has opened opportunities to better understand a diverse range of individuals across geographies -we can phenotype various behaviors like physical activity and stress (37, 38), as well as characterize diseases like endometriosis, schizophrenia, and Parkinson's (39-42). The rise of popularity in menstrual trackers, which are the second most popular app for adolescent girls and the fourth most popular for adult women (43, 44), has in particular enabled access to large-scale, longitudinal cycle length data for rigorous inquiry into how to best characterize menstruation(33)(34)(35)45). However, while such mHealth data opens the possibilities of menstrual research, it can be prone to inconsistent adherence from users. Therefore, the difficulty of modeling menstruation holds especially true for such self-tracking data -researchers must not only take into consideration the inherent variability of users' menstrual experience, but their tracking behavior as well. In this paper, we argue that a generative machine learning model allows us to distinguish true menstrual cycle behavior from these self-tracking artifacts.We take a machine learning approach to modeling menstrual cycle lengths: we infer underlying cycle dynamics and make predictions for future cycle lengths. Probabilistic models, including generative models, have proven useful for healthcare research, as they allow researchers to explicitly represent dependencies across observed and unobserved variables, consider missing values, and characterize model uncertainty (46). In particular, we propose a generative model, a statistical framework that defines how data (in this case, cycle lengths) are generated and specifies the relationships between different variables of interest (i.e., cycle lengths and self-tracking adherence).This provides interpretability, because in addition to learning how to predict menstrual cycle lengths accurately, we also learn the underlying probability distributions that characterize them. It also provides flexibility, because we can explicitly encode variables that we want to represent in the data generation process, such as the presence of potential cycle length skips. In particular, our model encodes a measure of per-user \"typical\" cycle length (i.e., cycle length regularity) and parameterizes explicitly a per-user propensity to skip tracking (i.e., self-tracking adherence) separately. By explicitly accounting for potential tracking artifacts, we can alert users when they are likely to have misstracked a cycle in their history, which has the potential to improve the efficacy of self-reporting. In addition, our model is hierarchical, meaning that we can represent different levels of information about our population. Namely, we can learn shared cycle length characteristics that describe the whole population of users, as well as individual-specific patterns describing each user's behavior. This hierarchy allows us to represent individual-level variability, while also accounting for behaviors and patterns that describe the broader population.\n\nIntroduction\n\nMenstruation has been historically misunderstood and understudied, despite its importance to women's health; it impacts women's emotional, physical, and mental well-being, influencing reproductive ability, cardiovascular health, and the presence of chronic diseases (1)(2)(3)(4)(5)(6). Note that while in this paper we may refer to menstruators as 'women,' we acknowledge that not all menstruators are women and vice versa. Many menstruators experience the adverse effects of menstruation at some point in their lifetimes -for instance, dysmenorrhea, or painful menstruation characterized by symptoms such as abdominal cramps and headaches, is estimated to affect up to 91% of women of reproductive age (7). Studies on risk factors and comorbidities of dysmenorrhea have shown its association with quality of life symptoms like depression, anxiety, decreased productivity, and fatigue (8,9). Certain menstruation-related disorders are associated with dysmenorrhea, including polycystic ovary syndrome (PCOS) and endometriosis, which are characterized by symptoms like infertility, intense pelvic pain, decreased mobility, and depression (10,11). Better understanding of the day-to-day patterns of menstruation can empower women and healthcare professionals to identify and manage such conditions. By using cycle length information only (users most commonly utilize menstrual health apps for period tracking), we attain valuable insights into cycle dynamics and user adherence, ultimately delivering accurate cycle length predictions. We train our model on self-tracked mHealth data from Clue by BioWink (47), one of the most popular and accurate menstrual trackers worldwide (48). To assess our model's predictive ability, we compare it against alternative baselines, including predicting next cycle length based on the mean or median of each user's training cycles, as well as neural network-based baselines. We find that our model's predictive performance is superior, especially as we update predictions over subsequent days of the next cycle. We also generate daily predictions of both cycle length and how likely a user is to skip tracking a cycle, which can aid menstruators in better understanding their cycle timing, allow researchers to identify tracking artifacts, and enable mHealth app developers to enhance app design for improved user engagement.\n\n\nResults\n\nWe utilize the first 11 self-tracked cycles from a cohort of 186, 108 Clue users for our analysis of menstruator data. See Table 1 for summary statistics and Methods for cohort definition details. Summary statistics for selected self-tracked menstruator dataset for the whole dataset, as well as the selected first 11 cycles only. Average number of cycles, cycle length, period length, and age statistics are per-user. Total number of users and age are the same for the selected cohort and selected cohort's first 11 cycles only, since they represent the same set of users. We see that cycle length and period length statistics differ very minimally between the selected cohort and the selected cohort's first 11 cycles only, indicating that using the first 11 cycles is a reasonable representation of each user's history. Note that the Clue app does not collect information from users on race or ethnicity.\n\nWe showcase our proposed model's ability to outperform alternative baselines on the menstruator data, especially on later days of the next cycle. This demonstrates the benefit of being able to dynamically update beliefs about both cycle length and likelihood of cycle skips and can help users better understand their cycles as they proceed. In addition, we examine the effect of individual variability on cycle length predictions and the importance of considering individual experiences. We also demonstrate our model's ability to successfully detect self-tracking artifacts on simulated data, which can be utilized in mHealth apps to alert users of possible missed tracking. Finally, we examine the probability distribution that characterizes predicted cycle lengths (the posterior predictive distribution) and showcase how our proposed model lends itself to accurately characterizing the underlying data distribution.\n\nProposed model outperforms baselines in cycle length prediction, particularly as cycle proceeds. Our generative model allows us to make predictions on each day of the next cycle as it proceeds; we refer to this day as d current . On day 0 of the next cycle (d current = 0), our model outperforms all alternative baselines, as seen in Table 2. This performance is consistent across different dataset sizes; for instance, we achieve similar root mean square error, or RMSE (see Methods for mathematical definition), on a smaller subset of individuals, about 20% of the full dataset size (see Table 2). For further demonstration of our model's robustness to dataset size (across number of individuals, I and cycles per individual, C) and different alternative baselines (i.e., different neural network settings), see Section B in Appendix. Figure 1: Prediction RMSE for proposed model and baselines over current day of the next cycle on the menstruator data. \"Proposed model (s = 0)\" indicates an alternative version of our proposed model, assuming the next observed cycle contains no self-tracking artifacts; \"Proposed model\" indicates the full version of our proposed model, accounting for the presence of potential self-tracking artifacts. Both models' superior performance is magnified past around day 30 of the next cycle; they are able to update predictions dynamically, as compared to static baselines. In particular, accounting for skipped cycles (full version of our proposed model, blue line) proves especially beneficial to prediction accuracy versus assuming the next reported cycle is truth (alternative version of our proposed model, gray line) -by anticipating the possible presence of skipped cycles, we are able to make more accurate predictions and avoid the bump in RMSE seen in the gray line.\n\nOur model's superior performance relative to baselines is especially apparent as the cycle proceeds, as seen in Figure 1 and specific RMSE values on day 40 of the next cycle in Table 3. In Figure 1, we see that past d current = 30, our models (gray line, s = 0 and blue line, s ≥ 0) display much lower RMSE than baselines. Note that s represents the number of possible skipped cycles in the observed cycle lengths = 0 indicates that we assume the next observed cycle length to be the true cycle length, while s ≥ 0 indicates that we account for the possibility of the observed cycle length containing skipped tracking. In particular, accounting for potential skipped cycles (blue line) proves more advantageous as the cycle proceeds, in comparison to assuming the next observed cycle contains no self-tracking artifacts (gray line). Our model's ability to outperform baselines as the cycle proceeds demonstrates the value in being able to explicitly condition on cycle day and dynamically update predictions, a benefit offered by our proposed generative model.\n\nVariability in cycle tracking history impacts prediction accuracy. The menstrual experience is unique, differing within and between individuals. In addition to averaging results over the whole population, we also consider results on an individual level and examine the role that menstrual variability may play in producing accurate predictions. The ability to learn population-wide information while also making individualized predictions is a direct benefit of our hierarchical modeling approach. To assess how predictive accuracy depends on cycle length variability, we showcase a violin plot of per-user median cycle length difference (CLD) versus absolute error in predicted cycle length in Figure 2. Median CLD is a metric for menstrual variability based on previous work (34) -users with higher median CLD are generally more Prediction RMSE for proposed model and baselines on day 0 for a subset of the menstruator data, I = 37, 222, and the full menstruator data, I = 186, 108. Note that here we train on C = 10 cycles and predict the next one. \"Proposed model (s = 0)\" indicates an alternative version of our proposed model, assuming the next observed cycle contains no self-tracking artifacts; \"Proposed model\" indicates the full version of our proposed model, accounting for the presence of potential self-tracking artifacts. Our model outperforms summary statistic-based and neural network-based baselines on day 0 when we account for skipped cycles and does so on only a subset of the data. Prediction RMSE for proposed model and baselines on day 40 for a subset of the menstruator data, I = 37, 222, and the full menstruator data, I = 186, 108. Note that here train on C = 10 cycles and predict the next one. \"Proposed model (s = 0)\" indicates an alternative version of our proposed model, assuming the next observed cycle contains no self-tracking artifacts; \"Proposed model\" indicates the full version of our proposed model, accounting for the presence of potential self-tracking artifacts. Our model outperforms summary statistic-based and neural network-based baselines on day 40 when we account for skipped cycles and does so on only a subset of the data.\n\nvolatile in their cycle tracking histories, and vice versa (see Methods for mathematical definition). We see that variability impacts prediction accuracy, with more variable users being generally more difficult to predict. This underscores the importance of considering each individual's experience. We also note the presence of outliers within a user's cycle length history, e.g., instances where users may have never skipped in their history, but skip the last cycle. These represent a small proportion of the user base, but skew RMSE computations; for instance, for users with very consistent cycle lengths (i.e., a median CLD of 0), the median absolute error, or MAE (see Methods for mathematical definition) is as low as 1.5 days, despite the RMSE for this group being 6.15.\n\nAccounting for potential cycle skips enables detection of tracking artifacts. Identifying skipped cycles is vital to modeling self-tracked cycle lengths accurately, since a skipped period results in an artificiallyinflated observed cycle length. Because we define a generative process that explicitly separates cycle patterns from cycle-skipping behavior, we can examine the likelihood of skipped cycles specifically. We display our model's ability to detect skipped cycles by illustrating the probabilities of possible cycle skips, shorthanded Absolute error of predicted next cycle Figure 2: Violin plot of absolute error of predicted next cycle length, stratified by user median cycle length difference (CLD) on the menstruator data. We see from the increasing trend in absolute error with median CLD that more variable users are typically more difficult to predict, showcasing that consideration of per-individual behavior is vital to the integrity of our model. as p(s * |d current ), on simulated data in Figure 3 -see full modeling and simulated data experiment details in Methods. (a) showcases a simulated user who has skipped in their history, and (b) showcases a simulated user who has never skipped in their history. The vertical lines represent specific days of the next cycle (days 30 and 40), and the markers represent the predicted probability of skipping zero or one cycle on those days. We choose days 30 and 40 because 30 days is around the average cycle length for these two simulated users, and day 40 represents when the user has surpassed their typical cycle length. These plots showcase how our model is able to detect differences in the underlying skipping phenomena between the two users: as each user passes their 'typical' cycle length without tracking, the model adjusts their likelihood of having skipped tracking a cycle based on their previous skipping behavior. Specifically, (a) for the user who has skipped in their history, their probability of skipping one cycle on day 40 is around 0.8, and their probability of skipping zero cycles on day 40 is around 0.2, a significant drop from a near 0.8 probability on day 30. This showcases how the model is able to incorporate knowledge about this user having previously skipped in computing their propensity to skip their next cycle. In comparison, (b) the user who has never skipped has a probability of skipping one cycle on day 40 of around 0.5 -it is not as clear that this user may have skipped a cycle, because they have never skipped before (i.e., this might be an occasional long cycle for this user, which may occur across menstruators in response to other internal or external stimuli). While we focus on s * = 0, 1 in Figure 3, note that this behavior holds analogously for s * = 2 and beyond. For instance, p(s * = 2) is low early in the next cycle and peaks past day 60, similar to how p(s * = 1) starts low and peaks past day 30. The ability to detect and alert users of potential tracking artifacts is important not only to accurately predicting the occurrence of the next cycle, but also to improving the design of mHealth apps as well as the quality of mHealth data for menstrual health research.\n\nThe posterior predictive distribution for cycle length is interpretable and representative of data. In Figure 4, we showcase our model's posterior predictive distribution for cycle length p(d * |û, Figure 3: Individual posterior predictive probability of skipping upcoming cycle, p i (s * |d current ), over current day of next cycle d current for two users from simulated data: one who has skipped a cycle in their history (a) and one who has never skipped a cycle (b). Our personalized model detects differences in predicted skipping behavior for the two users. Blue and orange curves represent probabilities of skipping zero or one cycle, respectively; markers indicate probability of skipping zero or one cycle on day 30 or 40 of the upcoming cycle. Note that users can also skip more than one cycle. For both example users, we see that the probability of having skipped zero cycles in the upcoming cycle (p i (s * = 0|d current )) is high until day 30. However, past day 30, the model detects that the user (a) who has skipped in their history is more likely to have skipped the upcoming cycle than for the user (b) who has never skipped. This demonstrates how the model takes into account the previous non-skipping behavior of this user. Because data in this experiment is simulated, we know that the user in (a) does actually skip the next cycle, while the user in (b) does not. Our inferred probabilities recover this, showing that our model can accurately detect when a user is likely to have skipped an upcoming cycle based on their individual cycle length histories and update these beliefs over time.\nd i , d * > d current ), (a) (b)\ni.e., the probabilistic next cycle length predictions provided by our model, for a specific user (learned as per their previous cycle length history) as the days of the next cycle proceed. In particular, Figure 4 shows the probability (z-axis) of a user's next cycle being of an specific length (x-axis) for the current day of the cycle (y-axis), assuming (a) that their next observed cycle is truth (no skipped cycles, s = 0) or (b) that their next observed cycle may contain skipped cycles (possible skipped cycles, s ≥ 0).\n\nWe are able to accurately update our model's cycle length predictions by updating its beliefs about the likelihood of skipping a cycle over time. When (a) we assume the next cycle is truth, the posterior predictive distribution is unimodal; however, when (b) we assume the next cycle may not be truth, the posterior predictive distribution is multimodal, with peaks around d * = 30, 60, 90. Such multimodality occurs as a result of (i) conditioning on the day of the next cycle d current and (ii) the explicit modeling of cycle skips, s. This multimodal distribution mirrors the skipping phenomena observed in the dataset -when a user passes their 'typical' cycle length (around 30 days), they may have skipped tracking of a cycle. The multimodal posterior predictive distribution is not only easily interpretable, but is also crucial to representing self-tracking artifacts in mHealth data and providing accurate cycle length predictions.\n\n\nDiscussion\n\nA hierarchical, generative model offers opportunities to characterize the underlying mechanisms of the varied experience of menstruation as collected via mHealth apps, the first step to a deeper understanding of menstruation as a whole. By developing a generative model, we are able to interpret the variables learned from per-user cycle length histories -we can trace a prediction of cycle length back to the hyperparameters, parameters, and latent variables that underlie it.\n\nOther attempts to model menstrual cycle lengths using user-reported data focus on issues like how to represent between-women and within-women variability. Researchers have represented this variability utilizing  Figure 4: Posterior predictive distribution for cycle length over prediction day d * (i.e., what the next reported cycle is predicted to be) and current day d current (i.e., day in next cycle) for the same user from menstruator data, assuming either that next observed cycle is truth (a) or that next observed cycle may contain skipped cycles (b). (a) When we assume the next observed cycle is true as reported (s = 0), our posterior predictive distribution is unimodal. The probability of the next cycle length is peaked around 30 until around day 30 of the next cycle, after which the peak moves consistently to the right, indicating that our cycle length predictions are consistently increasing past day 30 and not adjusting for the likelihood of skipped cycles. (b) When we account for the possibility of skipped cycles with s ≥ 0, our posterior predictive distribution is multimodal. Prior to day 30 of the next cycle, the distribution is similarly peaked around 30 days, as with the s = 0 case. However, when the cycle passes day 30, the distribution shows a peak around day 60, indicating the possibility that a user may have skipped a cycle. This behavior holds analogously past day 60. Our explicit modeling of cycle skips allows us to identify when a user may have missed tracking a cycle.\n\nhierarchical models (31), as well as mixture models of standard cycles (cycles 43 days and shorter) and nonstandard cycles (cycles longer than 43 days) (27). While these studies capture many important aspects of menstruation (such as the importance of considering each woman's individual cycle behavior) and include exclusion criteria for women who they suspect may not have reported their cycles accurately, they do not explicitly address the user adherence issues encountered when using self-reported mHealth data. Without this consideration, it may be difficult to determine whether nonstandard cycles are the result of individuals skipping tracking. In addition, the definition of a standard or nonstandard cycle may be limiting in itself, and these studies may also be limited in size or scope of the dataset used. For instance, one advantage of our analysis is that we are able to utilize a large dataset of natural menstrual cycles only.\n\nUsing observed cycle lengths as our only data source allows us to achieve comparable error to prior studies. In (49) for instance, an RMSE of 1.6 is achieved; however, this RMSE is based on standard cycles only and uses self-tracking data from a mHealth app designed for female athletes, a specific subset of individuals that does not necessarily represent the diversity of women. In our study, when we consider non-variable cycles only (based on the definition of menstrual regularity as represented in Figure 2), our model is able to achieve a similar median absolute error of 1.5 days, but the presence of outliers in more broadly used mHealth apps like Clue (due to unexpected cycle skips) increases the RMSE.\n\nThe hierarchical nature of our model means that once we infer population-level hyperparameters, we can make individualized predictions for new users without using other users' cycle length information. Furthermore, we have seen that our model is robust to dataset size -performance is consistent across relatively small sample sizes (see Appendix Section B for details). This is advantageous because once we have reasonable population-level hyperparameter estimates, there is no need to retrain our model. Therefore, our hierarchical model helps account for privacy concerns; as new users join the app, there is no need to retrain our model or share data between users before we can make predictions. This not only accounts for user concerns about how their data is used, but also makes our model more time-efficient -only a small subset of users is required for training to then make predictions on any number of individuals.\n\nOur work showcases the importance of considering the potential unreliability of real-world mHealth data and outlines the performance and interpretability benefits of doing so. Computing both cycle length and cycle skip predictions allows us to confront the nature of real-world mHealth data and has practical applications for mHealth apps. By explicitly accounting for potential cycle tracking artifacts, we can provide estimates of both next cycle length and probability of skipping tracking. This holds many beneficial implications: it aids users in better understanding their own data and menstrual patterns, helps researchers better disentangle true behavior from self-tracking artifacts by lending insight into the underlying structure of the observed data, and informs mHealth app designers about how to improve user adherence.\n\nOur model for predicting menstrual patterns showcases the potential that self-tracking mHealth data holds to further understanding of previously enigmatic physiological processes. By utilizing a generative model, we have gained insight into the mechanisms of self-tracking behavior, and in particular, users' propensity to skip tracking. Our dual predictions (i.e., predictions of both cycle length and possible cycle skips) offer a practical application for mHealth apps -rather than providing an option for users to exclude self-identified faulty cycles after the fact, they can proactively alert users when their probability of skipping tracking is high. For instance, users could be alerted when their cycle skipping probability is near a peak, as in Figure 3. Note that cycle variability is common, and therefore longer cycle lengths can also be the result of physiological phenomena and not just skipped tracking -this context, captured by our proposed model, can be provided to users in such alerts. This type of informed alerting helps avoid user notification fatigue (i.e., targeting alerts instead of alerting users everyday to ensure they are tracking) and increases efficacy and accuracy of self-reporting, which is crucial to creating more reliable datasets for the future. This is a vital demonstration of the importance of considering the specific nature of mHealth data that not only enables researchers and users alike to better understand menstruation and the underlying reason behind the observed cycle length, but also provides insight for mHealth app developers of how to alert users to possible inconsistent adherence in an informed way. As mHealth apps continue to grow in popularity and serve as an increasingly important source of information for healthcare interventions, it is vital to consider how to improve the quality of mHealth data and ensure it is being treated responsibly; these insights can aid researchers using such data sources to do so.\n\nThere is also great potential to extend our model to include other covariates, namely symptom observations. Including information beyond cycle lengths is crucial to understanding cycle variability more holistically (15) and may have significant impact on cycle prediction accuracy. In our previous work (34), we found that there is a relationship between cycle timing and symptom experiences; other studies have also included symptom covariates, like cramps and period flow, to examine how these impact reported menstrual cycle length (49). By extending our fully generative model to a hybrid deep generative model with symptom information, we can better understand this relationship from a mechanistic perspective and incorporate more context of each individual's menstrual experience. In particular, the model we've proposed here is the necessary first step to a proven hybrid deep learning approach (50) that models experimental details in a generative framework and complex biological details in a deep way. While our model is able to outperform baselines by using only previous cycle lengths as predictors for next cycle length, a hybrid model where cycles are generated from the proposed generative model with latent variables and parameters learned by a deep model that uses both symptom (e.g., headache, abdominal pain) and cycle length information as input will allow us to leverage the full potential of large self-tracking datasets to gain further insight into women's menstrual experiences and empower users to better track and predict their cycles.\n\n\nMethods\n\nProposed hierarchical, generative model.\n\nOur hierarchical, generative model for self-tracked menstrual cycle lengths incorporates population-wide knowledge (via informative priors for hyperparameters) and learns individualized cycle length patterns (via per-user parameters and predictions).\n\nIts hierarchical nature allows for the representation of different levels of information: individual-specific patterns (i.e., user-specific tracking histories), as well as population-wide characteristics (i.e., common patterns that exist across the studied population). We learn population-level information as population-level distributions and their hyperparameters and characterize the unique nature of each individual's menstrual experience through individual-level parameters and predictions.\n\nA generative model indicates that we propose the distributions from which each variable is generated, allowing for greater interpretability. The proposed generative model represents expected cycle length patterns λ i for individual i and probability of skipping tracking π i separately, as shown in Figure 5. By doing so, we are able to disentangle true, per-user cycle behavior from self-tracking artifacts; in addition to predicting cycle length,we can also gain insight into cycle skipping behavior, i.e., our model is interpretable and produces accurate individualized predictions.\n\nThe proposed model outlined in Figure 5 extends Poisson regression (which represents expected user cycle lengths via parameter λ i ) with individual latent variables π i that accommodate each user's propensity for skipping tracking. We decouple true from observed cycle lengths d i,c ≥ 0: the variable s i,c ≥ 0 indicates the number of not reported (skipped) cycles for user i during observed cycle c. We represent each individual's cycle tracking history as d i = {d i,c }∀c and each user's history of number of skipped cycles as s i = {s i,c }∀c. The proposed generative process is detailed in Section A of the Appendix. \n\n\nSelf-tracked menstruator data.\n\nWe leverage a de-identified self-tracked dataset from Clue by BioWink (47), comprised of 117, 014, 597 self-tracking events over 378, 694 users. For this full dataset, users have a median age of 25 years, a median of 11 cycles tracked, and a median cycle length of 29 days. Clue app users input overall personal information at sign-up, such as age and hormonal birth control (HBC) type. The dataset contains information from 2015-2018 for users worldwide, covering countries within North and South America, Europe, Asia and Africa. Users can self-track symptoms over time -for this paper, we focus on period data (i.e., the users' self-reports on which days they have their period). A period consists of sequential days of bleeding (greater than spotting and within ten days after the first greater than spotting bleeding event) unbroken by no more than one day on which only spotting or no bleeding occurred. Note that Clue considers a menses duration longer than 10 days as an outlier, as it would exceed mean period length plus 3 standard deviations for any studied population (16). We only use cycle lengths as input to our proposed model, where we define a menstrual cycle as the span of days from the first day of a period through to and including the day before the first day of the next period (16). In addition, a user has the opportunity to specify whether a cycle should be excluded from their Clue history -for instance, if the user feels that the cycle is not representative of their typical menstrual behavior due to a medical procedure or changes in birth control, they may elect to exclude it.\n\nOur cohort consists of users aged 21-33 (because cycles are more likely to be ovulatory and less variable in their lengths during this age interval (16,18,19,51,52)) with natural menstrual cycles (i.e., no hormonal birth control or intrauterine device). To rule out cases that indicate insufficient engagement with the app, we remove users from our cohort who have only tracked two cycles and cycles for which the user has not provided period data within 90 days. We use the first 11 cycles for all 186, 108 menstruators with more than 11 cycles tracked (since 11 is the median number of cycles tracked in the full Clue dataset). For summary statistics on this selected cohort, see Table 1. Results reflected in Figures 1, 2, and 4 and Tables 2 and 3 use this real menstruator dataset.\n\n\nSimulated data.\n\nIn order to assess the ability of our model to recover skipped cycles, we separately train our model on simulated cycle length data for 10, 000 users (with C = 10 cycles each), generated from our proposed generative process. We then take two cohorts of users: those who have never skipped a cycle in their history, and those who have skipped a cycle in their history. Note that we have access to ground truth cycle length and skipping information in this simulated case. For a sample user from each of these cohorts, we predict their probabilities of possible cycle skips p(s * |û, d i , d * > d current ) for the 11th cycle, utilizing the inferred population-wide hyperparametersû and individual cycle length histories d i . Results in Figure 3 use this simulated dataset.\n\n\nModel training.\n\nWe train our model on the full eligible dataset of 186, 108 users described in Table 1, training on the first 10 cycles and predicting the quantities of interest for the 11th cycle of each user. Population-level hyperparameter inference is achieved via type-II maximum likelihood estimation. Expert knowledge is incorporated via hyperparameter priors. The data log-likelihood under the proposed model is computed by a Monte Carlo approach (see Section A in Appendix for details).\n\nWe have evaluated the robustness of our training and predictive performance with respect to the dataset size (both with respect to individuals in the population, as well as cycles per individual) in order to quantify the predictive power of different modeling choices. We find that our model is generally stable across different training set sizes (see Section B in Appendix for details). To account for possible time dependency of tracked cycles, we also experimented with shuffling the order of each user's cycles and found no significant difference in results, i.e., the predictive performance of the model is not dependent on the specific cycle length ordering (see Section B in Appendix for details).\n\n\nIndividualized predictions.\n\nOur generative model allows for computation of both each user's cycle length and cycle skip posterior predictive distributions, which are updated online. For next cycle length d * prediction, we compute p(d * |û, d i , d * > d current ), whereû represents learned hyperparameters, d i refers to the individual's cycle length history, and d current is the current day of the next cycle (i.e., if d current = 1, then d * must be at least 2). Our proposed generative model allows for updating predictions online by conditioning on the current day of the next cycle (see posterior predictive distribution in Figure 4). For pointwise predictions updated by day (d current ), we use the expected value E[d * |û, d i , d * > d current ]. Beyond cycle length information, our model allows for computation of the probability of each user skipping tracking of the next cycle: p(s * |û, d i , d * > d current ), also conditioning on learned hyperparameters, user's cycle length history only, and current day of the cycle.\n\nTo compute cycle length predictions, our model offers two possibilities: 1) set s = 0 and assume that the next reported cycle will be truth (i.e., that the next observed cycle will not be skipped); or 2) set s ≥ 0 and integrate it out, assuming the next reported cycle may not be truth (i.e., accounting for the user possibly skipping their next cycle tracking). We evaluate and show the performance of our model for these two versions, with details on the prediction procedure provided in Section A of the Appendix .\n\n\nEvaluation metrics.\n\nWe use root mean square error (RMSE) to evaluate the average prediction accuracy of our model across all users. RMSE of N actual data points d i and predictionsd i is computed as\nRMSE = N i=1 d i −d i 2 ) N(1)\nWe use absolute error and median absolute error (MAE) to evaluate prediction accuracy of our model on a per-user basis, as in Figure 2. Absolute error between an actual data point d i and predictiond i is computed as\nAbsolute error = |d i −d i | (2)\nWe use median CLD as a metric for evaluating menstrual regularity, based on previous work characterizing menstruation (34). CLDs are computed per-user as the absolute differences between consecutive cycle lengths -for a user whose C cycles are defined as d = [d 0 , d 1 , d 2 , ...d C ], the CLDs are computed as\nCLDs = [|d 1 − d 0 |, |d 2 − d 1 |, ...|d C − d C−1 |](3)\nFor instance, a user with cycle lengths d = [30,40,25,30] will have CLDs of [10,15,5] and a median CLD of 10.\n\n\nAlternative baselines.\n\nTo evaluate the predictive performance of our proposed model, we consider summary statistic-based and neural network-based baselines (all details are provided in Section B of the Appendix):\n\n• Mean and median baselines: the predicted next cycle for each user is the average (or median) of their previously observed cycle lengths.\n\n• CNN: a 1-layer convolutional neural network with a 3-dimensional kernel.\n\n• RNN: a 1-layer bidirectional recurrent neural network with a 3-dimensional hidden state.\n\n• LSTM: a 1-layer Long Short-Term Memory neural network with a 3-dimensional hidden state.\n\nNote that we also test other neural network architectures (increasing number of layers and changing kernel or hidden state dimensionality) and find no meaningful performance difference -see Section B of the Appendix.\n\n\nData availability\n\nThe database that supports the findings of this study was made available by Clue by BioWink. While it is de-identified, it cannot be made directly available to the reader. Researchers interested in gaining access to the data should contact Clue by BioWink to establish a data use agreement.\n\n\nAcknowledgements\n\nThe authors are deeply grateful to all Clue users whose de-identified data have been used for this study.  \n\n\nA The generative model\n\nWe provide details on the generative process for self-tracked mHealth cycle lengths, which draws per-user specific parameters from population level shared priors:\n\n• Observed variables: Observed cycle length d i,c , with c = {1, · · · , C i } cycle lengths for each individual i = {1, · · · , I}. Each true cycle length (for user i, cycle c, out of the number of skipped cycles j) is drawn from a Poisson distribution, d i,j,c ∼ p(d i,j,c |λ i ) = P ois(d i,j,c |λ i ). The sum of independent Poissons is a different Poisson distribution, so the observed cycle length (d i,c = si,c+1 j=0 d i,j,c ) is also drawn from a Poisson, conditioned on the number of skipped cycles,\nd i,c ∼ P ois(λ i (s i,c + 1)) .(4)\n• Latent variables: s i,c denotes the number of skipped (not reported) cycles, with c = {1, · · · , C i } cycle lengths for each individual i = {1, · · · , I}. The number of skipped cycles is drawn from a truncated Geometric distribution with a maximum number of skipped cycles S,\ns i,c ∼ p(s|π i ) = π s i (1 − π i ) S s=0 π s i (1 − π i ) = π s i S s=0 π s i = π s i (1 − π i ) (1 − π (S+1) i ) for s ∈ N .(5)\n• Parameters λ i : the Poisson rate parameters for each individual i = {1, · · · , I}. Per-user Poisson rate parameters λ i are drawn from a population-level Gamma distribution\nλ i ∼ p(λ|κ, γ) = γ κ Γ(κ) λ κ−1 e −γλ for λ > 0 and κ, γ > 0.(6)\n• Hyperparameters of the Poisson rate parameter: κ, γ of a Gamma distribution prior for the Poisson rate at the population level.\n\n• Parameters π i : the probability of skipping a cycle for each individual i = {1, · · · , I}. The probability of an individual skipping a cycle is drawn from a population-level Beta distribution π i ∼ p(π|α, β) = Γ(α + β) Γ(α)Γ(β) π α−1 (1 − π) β−1 , for π ∈ [0, 1] and α, β > 0.\n\n• Hyperparameters of the geometric distribution parameters: α, β of the population level Beta distribution prior on skipping probabilities.\n\n\nInference details\n\nGiven a dataset of C i cycle lengths for I users, we perform hyperparameter inference via type-II maximum likelihood estimation. We compute a Monte Carlo (MC) approximation to the negative log-likelihood: − ln(p(d|u)) = − ln( i p(d i |u)). Due to the impossibility of integrating out the number of skipped cycles s i,c analytically, we compute a MC approximation to each cycle length likelihood p(d i |u) with M samples,\np(d i |u) = 1 M m p(d i |θ m ) , θ m ∼ p(u)(8)\nwhere u represents the hyperparameters [α, β, κ, γ] of the distributions from where samples θ m , representing the parameters [λ m , π m ], are drawn. We compute the probability p(d i |θ m ) by integrating out the probability of skipping s i,c , which is drawn from a truncated geometric distribution as in Eqn. (5):\np(d i |θ m ) = Ci c=1 p(d i,c |θ m ) = Ci c=1 S s=0 p(d i,c |λ m , s)p(s|π m ) (9a) = Ci c=1 S s=0 ((λ m (s + 1)) di,c e −λm(s+1) /d i,c !) π s m (1 − π m ) S s=0 π s m (1 − π m ) (9b) = Ci c=1 λ di,c m e −λm d i,c ! S s=0 ((s + 1) di,c e −λms ) π s m S s=0 π s m (9c) = Ci c=1 φ(λ m ) S s=0 (s + 1) di,c (π m e −λm ) s S s=0 π s m (9d) = Ci c=1 φ(λ m ) S s=0 (s + 1) di,c (π m e −λm ) s 1−π S+1 m 1−πm (9e) = Ci c=1 1 − π m 1 − π S+1 m φ(λ m ) S s=0 (s + 1) di,c (π m e −λm ) s (9f)\nwhere d i,c represents one cycle length c for a given user i, C i is the number of cycles for user i, S is the maximum value of s, and φ is the Poisson density.\n\n\nPrediction details\n\nIn order to update our predictions of per-user cycle length as each subsequent day passes, we are interested in the posterior of the next reported cycle length d * , conditioned on previous cycle lengths d i for a user i and the day of the current cycle d current ,\np(d * |d * > d current , d i ,û) = p(d * , d * > d current |d i ,û) p(d * > d current |d i ,û) = p(d * |d i ,û)I(d * > d current ) p(d * > d current |d i ,û) (10a) where we explicitly indicate that p(d * , d * > d current |d i ,û) = 0 if d * ≤ d current .\nIn addition to characterizing the full distribution, we are interested in computing the expectation of the conditional predictive posterior as a point estimate for the next cycle length,\nE[p(d * |d * > d current , d i ,û)] = d * d * p(d * |d * > d current , d i ,û) (11a) = d * d * p(d * |d i ,û)I(d * > d current ) p(d * > d current |d i ,û) (11b) = d * d * p(d * |d i ,û)I(d * > d current ) p(d * > d current |d i ,û) (11c) = d * >dcurrent d * p(d * |d i ,û) p(d * > d current |d i ,û) (11d) = D d * =dcurrent+1 d * p(d * |d i ,û) D d * =dcurrent+1 p(d * |d i ,û) (11e)\nThe key term above is p(d * |d i ,û):\np(d * |d i ,û) = dλdπq(λ)b(π) s * p(s * |π)p(d * |s * , λ)p(d i |λ, π) dλdπq(λ)b(π)p(d i |λ, π) ,(12)\nwhere d i are the cycle lengths for a user i and s i are the number of skipped cycles for a user, and d * , s * are the next reported cycle length and next number of skipped cycles, respectively. For the truncated geometric distribution on skipping probabilities, we compute the above as\np(d * |d i ,û) = M m=1 1−πm 1−π S+1 m S s * =0 π s * m p(d * |s * , λ m )p(d i |λ m , π m ) M m=1 p(d i |λ m , π m ) . (13a)\nWe compute p(d * |d i ,û) for a range of cycle length days d * = {0, · · · , D}, normalizing appropriately over d * for each value of d current , using p(d i |λ m , π m ) (as specified in Eqn. (9) of the description of inference) and p(d * |s * , λ m ) = P ois(λ(s * + 1)) (i.e., the Poisson PMF), where we must also normalize p(d * |s * , λ) over d * = {0, · · · , D}.\n\n\nImplementation details\n\nWe optimize the negative log-likelihood − ln(p(d|u)) = − ln( i p(d i |u)) with p(d i |u) as in Eqn. (9) with respect to hyperparameters u via stochastic gradient descent. Specifically, we utilize Adam (53), an adaptive gradient method. All models have been implemented using PyTorch, and trained with minibatches of size 100. All neural network-based models are trained (with dropout) on the observed cycle lengths for the whole cohort. Predictions are based on each per-user available cycle lengths.\n\nSince we sequentially predict next cycle length, our train-test split is over the number of cycle lengths available, i.e., we train the models on C cycles and predict the C + 1th cycle, where C = {2, · · · , 10}.\n\nFor reproducibility, we provide the settings for priors, learning rate, and other details for each of the models below:\n\n• CNN: number of layers = 1, kernel size = 3, stride = 1, padding = 0, dilation = 1, nonlinearity = tanh, dropout = 0.9, training criterion = MSE, epoch convergence criteria as maximum number of epochs = 1000, loss convergence criteria loss = 1e − 3, optimizer = Adam, learning rate = 0.01.\n\n• RNN: number of layers = 1, hidden size = 3, nonlinearity = tanh, dropout = 0.9, epoch convergence criteria as maximum number of epochs = 1000, loss convergence criteria loss = 1e − 3, optimizer = Adam, learning rate = 0.01.\n\n• LSTM: number of layers = 1, hidden size = 3, nonlinearity = tanh, dropout = 0.9, epoch convergence criteria as maximum number of epochs = 1000, loss convergence criteria loss = 1e − 3, optimizer = Adam, learning rate = 0.01.\n\n• Proposed model: u 0 = [κ 0 = 180, γ 0 = 6, α 0 = 2, β 0 = 20], S = 100 (for both inference and prediction), M = 1000 (for both inference and prediction), epoch convergence criteria as maximum number of epochs = 1000, loss convergence criteria loss = 1e − 3, optimizer = Adam, learning rate = 0.01.\n\n• Proposed model (s=0): same as above, with S = 100 in inference but S = 0 for next-cycle length prediction.\n\n\nB Supplementary results\n\nFor the results presented in the main text, we utilize a prior u 0 = [κ 0 = 180, γ 0 = 6, α 0 = 2, β 0 = 20], from which we draw our initial θ = [λ, π]. This is informed by expert knowledge about average cycle length (around 30 days) and the likelihood of skipping (relatively low) in our dataset.\n\n\nPerformance stability across different priors\n\nIn order to assess the impact of the prior, we evaluate the impact of training the model on different ones, namely a uniform prior on π (no prior knowledge on skipping likelihood), as well as a less informative (i.e., flatter) prior on both λ and π.\n\nWe showcase the prediction RMSE results on day 0 of the next cycle for both priors in Figures 6 and 7, where the blue line represents results for s ≥ 0 and the green line represents results for s = 0. Note that these results look similar in magnitude and spread as the prior we have chosen, and we therefore conclude that our method is stable to different choices of priors. \n\n\nPerformance stability across different dataset sizes and ordering of cycles\n\nTo demonstrate our model's robustness across different dataset sizes, we showcase prediction RMSE results across different numbers of individuals, I (left) and training cycles, C (right) in Figure 8. We see that our model performance is robust to different I and C values -our model's prediction RMSE remains around 7.5 even with relatively small I or C.  In addition, our model produces sharper estimates (lower variance) and is stable across I -with less than 40, 000 users, we have an RMSE less than 7.5. (b) Our model is robust to different C, as shown by consistent RMSE with at least 4 training cycles. Note that all models experience some fluctuations in RMSE depending on number of training cycles; this is due to data randomness, see Figure 9.\n\nWhile our model performance is generally stable to dataset size as in Figure 8, we note also that there is some very small magnitude fluctuation in performance with C = 10. This is due to data randomness -that is, since we utilize the first C cycles in each training subset, there may be users who happened to have less adherent tracking near the end of their tracking history (i.e., with C = 10), resulting in a small uptick in prediction RMSE. To showcase this, we perform an experiment utilizing I = 10, 000 users across 10 runs of our model; for each run, we randomly draw I = 10, 000 users from the full dataset, train our model, and compute predictions. The results of this experiment averaged over the 10 runs are shown in Figure 9, where we see that there is some fluctuation in prediction RMSE across C (not just for C = 10), verifying that the small fluctuation for C = 10 on the full dataset is an artifact of data randomness. To further test the dependency of model predictive performance on the ordering of the observed training cycles, we also run the same experiment with a random shuffling of a user's cycle history before selecting the first C cycles for training. We showcase these results in Figure 10 and see again that there are small fluctuations in performance across C, verifying further the impact of data randomness. This also showcases the negligible effect of choosing to either take the first C cycles without shuffling (as in Figure 9) or with shuffling (as in Figure 10). Here, before we take the first C cycles from each user, we randomly shuffle them.\n\n\nBaseline results with different neural network settings\n\nIn the results of our main manuscript, we utilize neural network-based baselines with one layer and a kernel size or hidden size of 3. To assess the performance of neural network-based baselines with different settings, we test (i) different numbers of layers and (ii) different kernel and hidden sizes (using a kernel or hidden size equal to the number of training cycles C instead of fixed at 3). Figures 11, 12, and 13 showcase the performance RMSEs across I for 1, 2, 5, and 10-layer CNNs, LSTMs, and RNNs, respectively (with fixed kernel or hidden size of 3). Figures 11, 12, and 13 showcase the performance RMSEs across I for 1, 2, 5, and 10-layer CNNs, LSTMs, and RNNs, respectively (with kernel or hidden size of C = 10). We see that across the number of layers and kernel or hidden size of 3 or C = 10, the prediction RMSE is stable, with average differences of at most 0.5 between different settings. Therefore, we conclude that one-layer neural networks, with fixed kernel or hidden size of 3, are reasonable baselines.   \n\nFigure 5 :\n5Hierarchical graphical model for proposed generative process. Individual-level parameters λ i (average cycle length without skipping) and π i (probability of skipping a cycle) are drawn from populationlevel distributions characterized by hyperparameters u = [κ, γ, α, β]. Shaded circles represent observed data, open circles represent latent variables, and dots represent hyperparameters.\n\n\nIU, CHW, and NE conceived the proposed research and designed the experiments. KL and IU processed the dataset and conducted the experiments. KL wrote the first draft of the manuscript. IU, CHW, AD, AS, VJV, and NE reviewed and edited it. All authors read and approved the manuscript.\n\n\nis supported by NSF's Graduate Research Fellowship Program Award #1644869. IU and NE are supported by NLM award R01 LM013043. KL, IU, CW, and NE declare that they have no competing interests. AS and VJV were employed by Clue by BioWink at the time of this research project.\n\nFigure 6 :Figure 7 :\n67Prediction RMSE over number of training individuals for a less informative (i.e., a more uncertain) prior on λ and π, u 0 = [60, Prediction RMSE over number of training individuals for a less informative prior on λ and a completely uniformative (i.e., uniform) one on π, u 0 = [60, 2, 1, 1].\n\nFigure 8 :\n8Prediction RMSE for proposed model and baselines on day 0 over number of individuals, I (a) and number of training cycles, C (on the full set of I) (b). C = 2 means 2 input cycles were used to predict the third and so on. (a) Our model outperforms summary statistic-based and neural network-based baselines on day 0 when we account for skipped cycles (blue line), across all subsets of I.\n\nFigure 9 :\n9Prediction RMSE over number of training cycles, averaged over 10 runs of different randomly-drawn datasets of I = 10, 000 users.\n\nFigure 10 :\n10Prediction RMSE over number of training cycles, averaged over 10 runs of different randomly-drawn datasets of I = 10, 000 users.\n\nFigure 11 :Figure 14 :\n1114Prediction RMSE over number of individuals for CNNs with 1, 2, 5, and 10 layers (blue, green, red, and purple lines, respectively) and a kernel size of 3. Prediction RMSE over number of individuals for CNNs with 1, 2, 5, and 10 layers (blue, green, red, and purple lines, respectively) and a kernel size of C = 10.\n\nFigure 15 :Figure 16 :\n1516Prediction RMSE over number of individuals for LSTMs with 1, 2, 5, and 10 layers (blue, green, red, and purple lines, respectively) and a hidden size of C = 10. Prediction RMSE over number of individuals for RNNs with 1, 2, 5, and 10 layers (blue, green, red, and purple lines, respectively) and a hidden size of C = 10.\n\nTable 1 :\n1Summary statistics for selected self-tracked menstruator datasetSummary statistic \nSelected cohort \nSelected cohort (first 11 cycles only) \nTotal number of users \n186,108 \n186,108 \nTotal number of cycles \n3,857,535 \n2,047,166 \nNumber of cycles (mean±sd, median) \n20.73±8.35, 18.00 11.00±0.00, 11.00 \nCycle length (mean±sd, median) \n30.75±7.73, 29.00 30.71±7.90, 29.00 \nPeriod length (mean±sd, median) \n4.06±1.76, 4.00 \n4.13±1.80, 4.00 \nAge (mean±sd, median) \n27.00±3.74, 27.00 27.00±3.74, 27.00 \n\n\n\nTable 2 :\n2Prediction RMSE results by model on day 0Model \n\n\nTable 3 :\n3Prediction RMSE results by model on day 40Model \n\n\nThe menstrual cycle: a biological marker of general health in adolescents. V B Popat, T Prodanov, K A Calis, L M Nelson, Annals of the New York Academy of Sciences. 1135Popat, V. B., Prodanov, T., Calis, K. A. & Nelson, L. M. The menstrual cycle: a biological marker of general health in adolescents. Annals of the New York Academy of Sciences 1135, 43-51 (2008). URL https://www.ncbi.nlm.nih.govhttp://europepmc.org/articles/PMC2755071/.\n\nA Prospective Exploration of Cognitive Dietary Restraint, Subclinical Ovulatory Disturbances, Cortisol, and Change in Bone Density over Two Years in Healthy Young Women. J L Bedford, J C Prior, S I Barr, The Journal of Clinical Endocrinology & Metabolism. 95Bedford, J. L., Prior, J. C. & Barr, S. I. A Prospective Exploration of Cognitive Dietary Restraint, Subclinical Ovulatory Disturbances, Cortisol, and Change in Bone Density over Two Years in Healthy Young Women. The Journal of Clinical Endocrinology & Metabolism 95, 3291-3299 (2010). URL https://academic.oup.com/jcem/article/95/7/3291/2596346.\n\nPhysiologic fluctuations of serum estradiol levels influence biochemical markers of bone resorption in young women. A Zittermann, The Journal of Clinical Endocrinology and Metabolism. 85Zittermann, A. et al. Physiologic fluctuations of serum estradiol levels influence biochemical markers of bone resorption in young women. The Journal of Clinical Endocrinology and Metabolism 85, 95-101 (2000).\n\nMenstrual cycle irregularity and risk for future cardiovascular disease. C G Solomon, The Journal of Clinical Endocrinology and Metabolism. 87Solomon, C. G. et al. Menstrual cycle irregularity and risk for future cardiovascular disease. The Journal of Clinical Endocrinology and Metabolism 87, 2013-2017 (2002).\n\nPolycystic Ovary Syndrome (PCOS): Arguably the Most Common Endocrinopathy Is Associated with Significant Morbidity in Women. E Carmina, R A Lobo, 10.1210/jcem.84.6.5803The Journal of Clinical Endocrinology & Metabolism. 84Carmina, E. & Lobo, R. A. Polycystic Ovary Syndrome (PCOS): Arguably the Most Common Endocrinopathy Is Associated with Significant Morbidity in Women. The Journal of Clinical En- docrinology & Metabolism 84, 1897-1899 (1999). URL http://dx.doi.org/10.1210/jcem.84.6.5803. /oup/backfile/content_public/journal/jcem/84/6/10.1210_jcem.84.6.5803/1/jcem1897.pdf.\n\nPremature menopause or early menopause: long-term health consequences. L T Shuster, D J Rhodes, B S Gostout, B R Grossardt, W A Rocca, Maturitas. 65Shuster, L. T., Rhodes, D. J., Gostout, B. S., Grossardt, B. R. & Rocca, W. A. Premature menopause or early menopause: long-term health consequences. Maturitas 65, 161-166 (2010).\n\nThe Prevalence and Risk Factors of Dysmenorrhea. H Ju, M Jones, G Mishra, 10.1093/epirev/mxt009Epidemiologic Reviews. 36Ju, H., Jones, M. & Mishra, G. The Prevalence and Risk Factors of Dysmenorrhea. Epidemiologic Reviews 36, 104-113 (2013). URL https://doi.org/10.1093/epirev/mxt009. https://academic. oup.com/epirev/article-pdf/36/1/104/16731532/mxt009.pdf.\n\n. A Unsal, U Ayranci, M Tozun, G Arslan, Unsal, A., Ayranci, U., Tozun, M., Arslan, G. .\n\nPrevalence of dysmenorrhea and its effect on quality of life among a group of female university students. E Calik, Upsala Journal of Medical Sciences. 115& Calik, E. Prevalence of dysmenorrhea and its effect on quality of life among a group of female university students. Upsala Journal of Medical Sciences 115, 138-145 (2010). URL https://www.ncbi.nlm.nih.gov/pmc/articles/PMC2853792/.\n\nThe comorbidities of dysmenorrhea: a clinical survey comparing symptom profile in women with and without endometriosis. S F Evans, T A Brooks, A J Esterman, M L Hull, P E Rolan, Journal of Pain Research. 11Evans, S. F., Brooks, T. A., Esterman, A. J., Hull, M. L. & Rolan, P. E. The comorbidities of dysmenorrhea: a clinical survey comparing symptom profile in women with and without endometriosis. Journal of Pain Research 11, 3181-3194 (2018). URL https://www.ncbi.nlm.nih.gov/pmc/articles/ PMC6300370/.\n\nThe social and psychological impact of endometriosis on women's lives: a critical narrative review. L Culley, 10.1093/humupd/dmt027Human Reproduction Update. 19Culley, L. et al. The social and psychological impact of endometriosis on women's lives: a critical narrative review. Human Reproduction Update 19, 625-639 (2013). URL https://doi.org/10.1093/humupd/ dmt027. https://academic.oup.com/humupd/article-pdf/19/6/625/2498455/dmt027.pdf.\n\nImpact of endometriosis on women's lives: a qualitative study. M Moradi, M Parker, A Sneddon, V Lopez, D Ellwood, BMC Womens Health. 14Moradi, M., Parker, M., Sneddon, A., Lopez, V. & Ellwood, D. Impact of endometriosis on women's lives: a qualitative study. BMC Womens Health 14 (2014). URL https://www.ncbi.nlm.nih.gov/ pmc/articles/PMC4287196/.\n\nMenstruation: science and society. H O Critchley, American Journal of Obstetrics and Gynecology. 223Critchley, H. O. et al. Menstruation: science and society. American Journal of Obstetrics and Gynecology 223, 624 -664 (2020). URL http://www.sciencedirect.com/science/article/pii/ S0002937820306190.\n\nAssessing research gaps and unmet needs in endometriosis. S As-Sanie, American Journal of Obstetrics and Gynecology. 221As-Sanie, S. et al. Assessing research gaps and unmet needs in endometriosis. American Journal of Obstetrics and Gynecology 221, 86 -94 (2019). URL http://www.sciencedirect.com/science/ article/pii/S0002937819303850.\n\nDoing Harm: The Truth (HarperOne. M Dusenbery, Dusenbery, M. Doing Harm: The Truth (HarperOne, 2018).\n\nThe extent and causes of natural variation in menstrual cycles: Integrating empirically-based models of ovarian cycling into research on women's health. A A Shea, V J Vitzthum, Drug Discovery Today: Disease Models. 32Shea, A. A. & Vitzthum, V. J. The extent and causes of natural variation in menstrual cycles: Integrating empirically-based models of ovarian cycling into research on women's health. Drug Discovery Today: Disease Models 32, 41-49 (2020).\n\nThe ecology and evolutionary endocrinology of reproduction in the human female. V J Vitzthum, https:/onlinelibrary.wiley.com/doi/pdf/10.1002/ajpa.21195American Journal of Physical Anthropology. 140Vitzthum, V. J. The ecology and evolutionary endocrinology of reproduction in the human female. Amer- ican Journal of Physical Anthropology 140, 95-136 (2009). URL https://onlinelibrary.wiley.com/ doi/abs/10.1002/ajpa.21195. https://onlinelibrary.wiley.com/doi/pdf/10.1002/ajpa.21195.\n\nThe Degree of Normal Menstrual Irregularity. L B Arey, American Journal of Obstetrics & Gynecology. 37Arey, L. B. The Degree of Normal Menstrual Irregularity. American Journal of Obstetrics & Gynecology 37, 12-29 (1939).\n\nVariation of the human menstrual cycle through reproductive life. A E Treloar, R E Boynton, B G Behn, B W Brown, International journal of fertility. 12Treloar, A. E., Boynton, R. E., Behn, B. G. & Brown, B. W. Variation of the human menstrual cycle through reproductive life. International journal of fertility 12, 77-126 (1967). URL http: //europepmc.org/abstract/MED/5419031.\n\nThe Length and Variability of the Human Menstrual Cycle. L Chiazze, F T Brayer, J John, J Macisco, M P Parker, B J Duffy, The Journal of the American Medical Association. 203Chiazze, L., Brayer, F. T., John J. Macisco, J., Parker, M. P. & Duffy, B. J. The Length and Variability of the Human Menstrual Cycle. The Journal of the American Medical Association 203, 377-380 (1968).\n\nLength and variation in the menstrual cycle -a cross-sectional study from a Danish county. K Münster, L Schmidt, P Helm, The British Journal of Obstetrics and Gynaecology. 99Münster, K., Schmidt, L. & Helm, P. Length and variation in the menstrual cycle -a cross-sectional study from a Danish county. The British Journal of Obstetrics and Gynaecology 99, 422 -429 (1992).\n\nMenstrual bleeding patterns in untreated women. Task Force on Long-Acting Systemic Agents for Fertility Regulation. E M Belsey, A P Pinol, Contraception. 55Belsey, E. M. & Pinol, A. P. Menstrual bleeding patterns in untreated women. Task Force on Long-Acting Systemic Agents for Fertility Regulation. Contraception 55, 57-65 (1997).\n\nIncidence of irregular cycles among Mayan women who reported having regular cycles: implications for fertility awareness methods. M C Burkhart, L De Mazariegos, S Salazar, T Hess, Contraception. 59Burkhart, M. C., de Mazariegos, L., Salazar, S. & Hess, T. Incidence of irregular cycles among Mayan women who reported having regular cycles: implications for fertility awareness methods. Contraception 59, 271 -275 (1999).\n\nMenstrual patterns and fecundity among non-lactating and lactating cycling women in rural highland Bolivia: implications for contraceptive choice. V J Vitzthum, H Spielvogel, E Caceres, J Gaines, Contraception. 62Vitzthum, V. J., Spielvogel, H., Caceres, E. & Gaines, J. Menstrual patterns and fecundity among non-lactating and lactating cycling women in rural highland Bolivia: implications for contraceptive choice. Contraception 62, 181 -187 (2000).\n\nHow regular is regular? An analysis of menstrual cycle regularity. M D Creinin, S Keverline, L A Meyn, Contraception. 70Creinin, M. D., Keverline, S. & Meyn, L. A. How regular is regular? An analysis of menstrual cycle regularity. Contraception 70, 289-292 (2004).\n\nMenstrual cycle characteristics and predictability of ovulation of Bhutia women in Sikkim. S R Williams, India. Journal of physiological anthropology. 25Williams, S. R. Menstrual cycle characteristics and predictability of ovulation of Bhutia women in Sikkim, India. Journal of physiological anthropology 25, 85-90 (2006).\n\nThe normal variabilities of the menstrual cycle. L A Cole, D G Ladner, F W Byrn, Fertility and Sterility. 91Cole, L. A., Ladner, D. G. & Byrn, F. W. The normal variabilities of the menstrual cycle. Fertility and Sterility 91, 522-527 (2009). URL https://www.fertstert.org/article/S0015-0282(07)04138-6/ fulltext.\n\nModeling menstrual cycle length using a mixture distribution. Y Guo, A K Manatunga, S Chen, M Marcus, 10.1093/biostatistics/kxi043Biostatistics. 7Guo, Y., Manatunga, A. K., Chen, S. & Marcus, M. Modeling menstrual cycle length using a mixture distribution. Biostatistics 7, 100-114 (2005). URL https://doi.org/10.1093/biostatistics/kxi043. https://academic.oup.com/biostatistics/article-pdf/7/1/100/669902/kxi043.pdf.\n\nAn application of longitudinal methods to the analysis of menstrual diary data. S D Harlow, S L Zeger, Journal of Clinical Epidemiology. 44Harlow, S. D. & Zeger, S. L. An application of longitudinal methods to the analysis of menstrual diary data. Journal of Clinical Epidemiology 44, 1015 -1025 (1991). URL http://www.sciencedirect.com/ science/article/pii/089543569190003R.\n\nAnalysis of menstrual diary data across the reproductive life span applicability of the bipartite model approach and the importance of within-woman variance. S D Harlow, X Lin, M Ho, Journal of Clinical Epidemiology. 53Harlow, S. D., Lin, X. & Ho, M. Analysis of menstrual diary data across the reproductive life span applicability of the bipartite model approach and the importance of within-woman variance. Journal of Clinical Epidemiology 53, 722 -733 (2000). URL http://www.sciencedirect.com/science/article/ pii/S0895435699002024.\n\nLinear mixed models with heterogeneous within-cluster variances. X Lin, J Raz, S D Harlow, Biometrics. 53Lin, X., Raz, J. & Harlow, S. D. Linear mixed models with heterogeneous within-cluster variances. Biometrics 53, 910-923 (1997). URL http://www.jstor.org/stable/2533552.\n\nSequential predictions of menstrual cycle lengths. P Bortot, G Masarotto, B Scarpa, 10.1093/biostatistics/kxq020Biostatistics. 11Bortot, P., Masarotto, G. & Scarpa, B. Sequential predictions of menstrual cycle lengths. Biostatistics 11, 741-755 (2010). URL https://doi.org/10.1093/biostatistics/kxq020. https://academic. oup.com/biostatistics/article-pdf/11/4/741/17738013/kxq020.pdf.\n\nDaily, weekly, seasonal and menstrual cycles in women's mood, behaviour and vital signs. E Pierson, T Althoff, D Thomas, P Hillard, J Leskovec, Nature Human Behaviour. 110Pierson, E., Althoff, T., Thomas, D., Hillard, P. & Leskovec, J. Daily, weekly, seasonal and menstrual cycles in women's mood, behaviour and vital signs. Nature Human Behaviour 1-10 (2021).\n\nReal-world menstrual cycle characteristics of more than 600,000 menstrual cycles. J R Bull, Nature Digital Medicine. 2Bull, J. R. et al. Real-world menstrual cycle characteristics of more than 600,000 menstrual cycles. Nature Digital Medicine 2 (2019).\n\nCharacterizing physiological and symptomatic variation in menstrual cycles using self-tracked mobile health data. K Li, 1808.02932Nature Digital Medicine. 3Li, K. et al. Characterizing physiological and symptomatic variation in menstrual cycles using self-tracked mobile health data. Nature Digital Medicine 3 (2020). 1808.02932.\n\nAssessment of menstrual health status and evolution through mobile apps for fertility awareness. L Symul, K Wac, P Hillard, M Salathé, Nature Digital Medicine. 2Symul, L., Wac, K., Hillard, P. & Salathé, M. Assessment of menstrual health status and evolution through mobile apps for fertility awareness. Nature Digital Medicine 2 (2019).\n\nReal-life insights on menstrual cycles and ovulation using big data. I Soumpasis, B Grace, S Johnson, Human Reproduction Open. 2020Soumpasis, I., Grace, B. & Johnson, S. Real-life insights on menstrual cycles and ovulation using big data. Human Reproduction Open 2020 (2020). URL https://www.ncbi.nlm.nih.gov/pmc/articles/ PMC7164578/.\n\nLarge-scale physical activity data reveal worldwide activity inequality. T Althoff, Nature. 547Althoff, T. et al. Large-scale physical activity data reveal worldwide activity inequality. Nature 547 (2017).\n\nLarge-scale wearable data reveal digital phenotypes for daily-life stress detection. E Smets, Nature Digital Medicine. 1Smets, E. et al. Large-scale wearable data reveal digital phenotypes for daily-life stress detection. Nature Digital Medicine 1 (2018).\n\nThe mPower study, Parkinson disease mobile data collected using ResearchKit. B M Bot, Scientific data. 3160011Bot, B. M. et al. The mPower study, Parkinson disease mobile data collected using ResearchKit. Scientific data 3, 160011 (2016).\n\nCharacterizing the clinical relevance of digital phenotyping data quality with applications to a cohort with schizophrenia. J Torous, Nature Digital Medicine. 1Torous, J. et al. Characterizing the clinical relevance of digital phenotyping data quality with applications to a cohort with schizophrenia. Nature Digital Medicine 1 (2018).\n\nPhenotyping Endometriosis through Mixed Membership Models of Self-Tracking Data. I Urteaga, M Mckillop, S Lipsky-Gorman, N Elhadad, Machine Learning for Healthcare (MLHC). Urteaga, I., McKillop, M., Lipsky-Gorman, S. & Elhadad, N. Phenotyping Endometriosis through Mixed Membership Models of Self-Tracking Data. In 2018 Machine Learning for Healthcare (MLHC) (2018). URL https://www.mlforhc.org/s/27.pdf.\n\nLearning endometriosis phenotypes from patient-generated data. I Urteaga, M Mckillop, N Elhadad, 10.1038/s41746-020-0292-9npj Digital Medicine. 3Urteaga, I., McKillop, M. & Elhadad, N. Learning endometriosis phenotypes from patient-generated data. npj Digital Medicine 3 (2020). URL https://doi.org/10.1038/s41746-020-0292-9. https: //www.nature.com/articles/s41746-020-0292-9.\n\nTeens, health and technology: A national survey. E Wartella, V Rideout, H Montague, L Beaudoin-Ryan, A Lauricella, 4Wartella, E., Rideout, V., Montague, H., Beaudoin-Ryan, L. & Lauricella, A. Teens, health and technology: A national survey. Media and Communication 4, 13-23 (2016).\n\nMobile Health. S Fox, M Duggan, Pew Research Center. Tech. Rep.Fox, S. & Duggan, M. Mobile Health 2012. Tech. Rep., Pew Research Center (2012). URL http: //www.pewinternet.org/2012/11/08/mobile-health-2012/.\n\nModeling Individual Cyclic Variation in Human Behavior. E Pierson, T Althoff, J Leskovec, 10.1145/3178876.3186052International World Wide Web Conferences Steering Committee, Republic and Canton of. Geneva, SwitzerlandWWW18Proceedings of the 2018 World Wide Web ConferencePierson, E., Althoff, T. & Leskovec, J. Modeling Individual Cyclic Variation in Human Behavior. In Proceedings of the 2018 World Wide Web Conference, WWW '18, 107-116 (International World Wide Web Conferences Steering Committee, Republic and Canton of Geneva, Switzerland, 2018). URL https://doi.org/10.1145/3178876.3186052.\n\nProbabilistic machine learning for healthcare. I Chen, S Joshi, M Ghassemi, R Ranganath, abs/2009.11087Chen, I., Joshi, S., Ghassemi, M. & Ranganath, R. Probabilistic machine learning for healthcare. ArXiv abs/2009.11087 (2020).\n\nEvaluation of Smartphone Menstrual Cycle Tracking Applications Using an Adapted Applications Scoring System. M L Moglia, H V Nguyen, K Chyjek, K T Chen, P M Castaño, Obstetrics and Gynecology. 127Moglia, M. L., Nguyen, H. V., Chyjek, K., Chen, K. T. & Castaño, P. M. Evaluation of Smartphone Menstrual Cycle Tracking Applications Using an Adapted Applications Scoring System. Obstetrics and Gynecology 127, 1153-1160 (2016).\n\nModelling menstrual cycle length in athletes using state-space models. T Oliveira, G Bruinvels, C Pedlar, J Newell, Oliveira, T., Bruinvels, G., Pedlar, C. & Newell, J. Modelling menstrual cycle length in athletes using state-space models (2020).\n\nDose-response modeling in high-throughput cancer drug screenings: An end-to-end approach. W Tansey, 1812.05691to appear in BiostatisticsTansey, W. et al. Dose-response modeling in high-throughput cancer drug screenings: An end-to-end approach (2020 (to appear in Biostatistics)). 1812.05691.\n\nMonitoring reproductive aging in a 5-year prospective study: aggregate and individual changes in steroid hormones and menstrual cycle lengths with age. R J Ferrell, Menopause. 12Ferrell, R. J. et al. Monitoring reproductive aging in a 5-year prospective study: aggregate and individual changes in steroid hormones and menstrual cycle lengths with age. Menopause 12, 567-757 (2005).\n\nExecutive Summary of the Stages of Reproductive Aging Workshop + 10: Addressing the Unfinished Agenda of Staging Reproductive Aging. S D Harlow, 10.1210/jc.2011-3362The Journal of Clinical Endocrinology & Metabolism. 97Harlow, S. D. et al. Executive Summary of the Stages of Reproductive Aging Workshop + 10: Addressing the Unfinished Agenda of Staging Reproductive Aging. The Journal of Clinical Endocrinology & Metabolism 97, 1159-1168 (2012). URL https://doi.org/10.1210/jc.2011-3362.\n\nA method for stochastic optimization. D P Kingma, J Ba, Adam, 1412.6980Number of training individuals. Kingma, D. P. & Ba, J. Adam: A method for stochastic optimization (2017). 1412.6980. Number of training individuals\n\nPrediction RMSE over number of individuals for LSTMs with 1, 2, 5, and 10 layers (blue, green, red, and purple lines, respectively) and a hidden size of. 3. 40000 60000 80000 100000 120000 140000 160000 180000Figure. 12Figure 12: Prediction RMSE over number of individuals for LSTMs with 1, 2, 5, and 10 layers (blue, green, red, and purple lines, respectively) and a hidden size of 3. 40000 60000 80000 100000 120000 140000 160000 180000\n\nPrediction RMSE over number of individuals for RNNs with 1, 2, 5, and 10 layers (blue, green, red, and purple lines, respectively) and a hidden size of 3. Figure. 13Figure 13: Prediction RMSE over number of individuals for RNNs with 1, 2, 5, and 10 layers (blue, green, red, and purple lines, respectively) and a hidden size of 3.\n", "annotations": {"author": "[{\"end\":310,\"start\":150},{\"end\":476,\"start\":311},{\"end\":543,\"start\":477},{\"end\":701,\"start\":544},{\"end\":869,\"start\":702},{\"end\":1019,\"start\":870}]", "publisher": null, "author_last_name": "[{\"end\":158,\"start\":156},{\"end\":324,\"start\":317},{\"end\":488,\"start\":484},{\"end\":563,\"start\":555},{\"end\":717,\"start\":710},{\"end\":884,\"start\":877}]", "author_first_name": "[{\"end\":155,\"start\":150},{\"end\":316,\"start\":311},{\"end\":483,\"start\":477},{\"end\":552,\"start\":544},{\"end\":554,\"start\":553},{\"end\":707,\"start\":702},{\"end\":709,\"start\":708},{\"end\":876,\"start\":870}]", "author_affiliation": "[{\"end\":249,\"start\":160},{\"end\":309,\"start\":251},{\"end\":415,\"start\":326},{\"end\":475,\"start\":417},{\"end\":542,\"start\":490},{\"end\":617,\"start\":565},{\"end\":700,\"start\":619},{\"end\":808,\"start\":719},{\"end\":868,\"start\":810},{\"end\":944,\"start\":886},{\"end\":1018,\"start\":946}]", "title": "[{\"end\":133,\"start\":1},{\"end\":1152,\"start\":1020}]", "venue": null, "abstract": "[{\"end\":8505,\"start\":1236}]", "bib_ref": "[{\"attributes\":{\"ref_id\":\"b0\"},\"end\":8790,\"start\":8787},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":8793,\"start\":8790},{\"attributes\":{\"ref_id\":\"b2\"},\"end\":8796,\"start\":8793},{\"attributes\":{\"ref_id\":\"b3\"},\"end\":8799,\"start\":8796},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":8802,\"start\":8799},{\"attributes\":{\"ref_id\":\"b5\"},\"end\":8805,\"start\":8802},{\"attributes\":{\"ref_id\":\"b6\"},\"end\":9227,\"start\":9224},{\"attributes\":{\"ref_id\":\"b7\"},\"end\":9409,\"start\":9406},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":9411,\"start\":9409},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":9662,\"start\":9658},{\"attributes\":{\"ref_id\":\"b11\"},\"end\":9665,\"start\":9662},{\"attributes\":{\"ref_id\":\"b47\"},\"end\":10200,\"start\":10196},{\"attributes\":{\"ref_id\":\"b31\"},\"end\":26890,\"start\":26886},{\"attributes\":{\"ref_id\":\"b27\"},\"end\":27022,\"start\":27018},{\"attributes\":{\"ref_id\":\"b48\"},\"end\":27928,\"start\":27924},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":32488,\"start\":32484},{\"attributes\":{\"ref_id\":\"b48\"},\"end\":32808,\"start\":32804},{\"attributes\":{\"ref_id\":\"b16\"},\"end\":36964,\"start\":36960},{\"attributes\":{\"ref_id\":\"b16\"},\"end\":37186,\"start\":37182},{\"attributes\":{\"ref_id\":\"b16\"},\"end\":37643,\"start\":37639},{\"attributes\":{\"ref_id\":\"b18\"},\"end\":37646,\"start\":37643},{\"attributes\":{\"ref_id\":\"b19\"},\"end\":37649,\"start\":37646},{\"attributes\":{\"ref_id\":\"b50\"},\"end\":37652,\"start\":37649},{\"attributes\":{\"ref_id\":\"b51\"},\"end\":37655,\"start\":37652},{\"attributes\":{\"ref_id\":\"b34\"},\"end\":42442,\"start\":42438},{\"attributes\":{\"ref_id\":\"b30\"},\"end\":42739,\"start\":42735},{\"attributes\":{\"ref_id\":\"b40\"},\"end\":42742,\"start\":42739},{\"attributes\":{\"ref_id\":\"b25\"},\"end\":42745,\"start\":42742},{\"attributes\":{\"ref_id\":\"b30\"},\"end\":42748,\"start\":42745},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":42771,\"start\":42767},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":42774,\"start\":42771},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":42776,\"start\":42774},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":46822,\"start\":46819},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":49334,\"start\":49331},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":49637,\"start\":49634},{\"attributes\":{\"ref_id\":\"b52\"},\"end\":49739,\"start\":49735}]", "figure": "[{\"attributes\":{\"id\":\"fig_2\"},\"end\":56441,\"start\":56040},{\"attributes\":{\"id\":\"fig_3\"},\"end\":56727,\"start\":56442},{\"attributes\":{\"id\":\"fig_4\"},\"end\":57003,\"start\":56728},{\"attributes\":{\"id\":\"fig_5\"},\"end\":57319,\"start\":57004},{\"attributes\":{\"id\":\"fig_6\"},\"end\":57721,\"start\":57320},{\"attributes\":{\"id\":\"fig_7\"},\"end\":57863,\"start\":57722},{\"attributes\":{\"id\":\"fig_8\"},\"end\":58007,\"start\":57864},{\"attributes\":{\"id\":\"fig_10\"},\"end\":58350,\"start\":58008},{\"attributes\":{\"id\":\"fig_11\"},\"end\":58699,\"start\":58351},{\"attributes\":{\"id\":\"tab_0\",\"type\":\"table\"},\"end\":59209,\"start\":58700},{\"attributes\":{\"id\":\"tab_1\",\"type\":\"table\"},\"end\":59270,\"start\":59210},{\"attributes\":{\"id\":\"tab_2\",\"type\":\"table\"},\"end\":59332,\"start\":59271}]", "paragraph": "[{\"end\":10881,\"start\":8521},{\"end\":11800,\"start\":10893},{\"end\":12721,\"start\":11802},{\"end\":14532,\"start\":12723},{\"end\":15594,\"start\":14534},{\"end\":17769,\"start\":15596},{\"end\":18550,\"start\":17771},{\"end\":21745,\"start\":18552},{\"end\":23359,\"start\":21747},{\"end\":23918,\"start\":23393},{\"end\":24859,\"start\":23920},{\"end\":25351,\"start\":24874},{\"end\":26864,\"start\":25353},{\"end\":27810,\"start\":26866},{\"end\":28525,\"start\":27812},{\"end\":29453,\"start\":28527},{\"end\":30288,\"start\":29455},{\"end\":32267,\"start\":30290},{\"end\":33830,\"start\":32269},{\"end\":33882,\"start\":33842},{\"end\":34134,\"start\":33884},{\"end\":34633,\"start\":34136},{\"end\":35220,\"start\":34635},{\"end\":35845,\"start\":35222},{\"end\":37489,\"start\":35880},{\"end\":38276,\"start\":37491},{\"end\":39069,\"start\":38296},{\"end\":39568,\"start\":39089},{\"end\":40275,\"start\":39570},{\"end\":41317,\"start\":40307},{\"end\":41836,\"start\":41319},{\"end\":42038,\"start\":41860},{\"end\":42286,\"start\":42070},{\"end\":42632,\"start\":42320},{\"end\":42800,\"start\":42691},{\"end\":43016,\"start\":42827},{\"end\":43156,\"start\":43018},{\"end\":43232,\"start\":43158},{\"end\":43324,\"start\":43234},{\"end\":43416,\"start\":43326},{\"end\":43634,\"start\":43418},{\"end\":43946,\"start\":43656},{\"end\":44074,\"start\":43967},{\"end\":44263,\"start\":44101},{\"end\":44773,\"start\":44265},{\"end\":45090,\"start\":44810},{\"end\":45398,\"start\":45222},{\"end\":45594,\"start\":45465},{\"end\":45876,\"start\":45596},{\"end\":46017,\"start\":45878},{\"end\":46459,\"start\":46039},{\"end\":46823,\"start\":46507},{\"end\":47468,\"start\":47308},{\"end\":47756,\"start\":47491},{\"end\":48199,\"start\":48013},{\"end\":48622,\"start\":48585},{\"end\":49012,\"start\":48725},{\"end\":49507,\"start\":49138},{\"end\":50034,\"start\":49534},{\"end\":50248,\"start\":50036},{\"end\":50369,\"start\":50250},{\"end\":50661,\"start\":50371},{\"end\":50888,\"start\":50663},{\"end\":51116,\"start\":50890},{\"end\":51417,\"start\":51118},{\"end\":51527,\"start\":51419},{\"end\":51852,\"start\":51555},{\"end\":52151,\"start\":51902},{\"end\":52528,\"start\":52153},{\"end\":53360,\"start\":52608},{\"end\":54946,\"start\":53362},{\"end\":56039,\"start\":55006}]", "formula": "[{\"attributes\":{\"id\":\"formula_0\"},\"end\":23392,\"start\":23360},{\"attributes\":{\"id\":\"formula_1\"},\"end\":42069,\"start\":42039},{\"attributes\":{\"id\":\"formula_2\"},\"end\":42319,\"start\":42287},{\"attributes\":{\"id\":\"formula_3\"},\"end\":42690,\"start\":42633},{\"attributes\":{\"id\":\"formula_4\"},\"end\":44809,\"start\":44774},{\"attributes\":{\"id\":\"formula_5\"},\"end\":45221,\"start\":45091},{\"attributes\":{\"id\":\"formula_6\"},\"end\":45464,\"start\":45399},{\"attributes\":{\"id\":\"formula_8\"},\"end\":46506,\"start\":46460},{\"attributes\":{\"id\":\"formula_9\"},\"end\":47307,\"start\":46824},{\"attributes\":{\"id\":\"formula_10\"},\"end\":48012,\"start\":47757},{\"attributes\":{\"id\":\"formula_11\"},\"end\":48584,\"start\":48200},{\"attributes\":{\"id\":\"formula_12\"},\"end\":48724,\"start\":48623},{\"attributes\":{\"id\":\"formula_13\"},\"end\":49137,\"start\":49013}]", "table_ref": "[{\"attributes\":{\"ref_id\":\"tab_0\"},\"end\":11023,\"start\":11016},{\"attributes\":{\"ref_id\":\"tab_1\"},\"end\":13064,\"start\":13057},{\"attributes\":{\"ref_id\":\"tab_1\"},\"end\":13320,\"start\":13313},{\"attributes\":{\"ref_id\":\"tab_2\"},\"end\":14718,\"start\":14711},{\"attributes\":{\"ref_id\":\"tab_0\"},\"end\":38180,\"start\":38173},{\"attributes\":{\"ref_id\":\"tab_1\"},\"end\":38241,\"start\":38227},{\"attributes\":{\"ref_id\":\"tab_0\"},\"end\":39175,\"start\":39168}]", "section_header": "[{\"attributes\":{\"n\":\"1\"},\"end\":8519,\"start\":8507},{\"attributes\":{\"n\":\"2\"},\"end\":10891,\"start\":10884},{\"attributes\":{\"n\":\"3\"},\"end\":24872,\"start\":24862},{\"attributes\":{\"n\":\"4\"},\"end\":33840,\"start\":33833},{\"end\":35878,\"start\":35848},{\"end\":38294,\"start\":38279},{\"end\":39087,\"start\":39072},{\"end\":40305,\"start\":40278},{\"end\":41858,\"start\":41839},{\"end\":42825,\"start\":42803},{\"attributes\":{\"n\":\"5\"},\"end\":43654,\"start\":43637},{\"attributes\":{\"n\":\"6\"},\"end\":43965,\"start\":43949},{\"end\":44099,\"start\":44077},{\"end\":46037,\"start\":46020},{\"end\":47489,\"start\":47471},{\"end\":49532,\"start\":49510},{\"end\":51553,\"start\":51530},{\"end\":51900,\"start\":51855},{\"end\":52606,\"start\":52531},{\"end\":55004,\"start\":54949},{\"end\":56051,\"start\":56041},{\"end\":57025,\"start\":57005},{\"end\":57331,\"start\":57321},{\"end\":57733,\"start\":57723},{\"end\":57876,\"start\":57865},{\"end\":58031,\"start\":58009},{\"end\":58374,\"start\":58352},{\"end\":58710,\"start\":58701},{\"end\":59220,\"start\":59211},{\"end\":59281,\"start\":59272}]", "table": "[{\"end\":59209,\"start\":58776},{\"end\":59270,\"start\":59263},{\"end\":59332,\"start\":59325}]", "figure_caption": "[{\"end\":56441,\"start\":56053},{\"end\":56727,\"start\":56444},{\"end\":57003,\"start\":56730},{\"end\":57319,\"start\":57028},{\"end\":57721,\"start\":57333},{\"end\":57863,\"start\":57735},{\"end\":58007,\"start\":57879},{\"end\":58350,\"start\":58036},{\"end\":58699,\"start\":58379},{\"end\":58776,\"start\":58712},{\"end\":59263,\"start\":59222},{\"end\":59325,\"start\":59283}]", "figure_ref": "[{\"end\":13568,\"start\":13560},{\"end\":14654,\"start\":14646},{\"end\":14731,\"start\":14723},{\"end\":16299,\"start\":16291},{\"end\":19144,\"start\":19136},{\"end\":19571,\"start\":19563},{\"end\":21269,\"start\":21261},{\"end\":21858,\"start\":21850},{\"end\":21953,\"start\":21945},{\"end\":23605,\"start\":23597},{\"end\":25573,\"start\":25565},{\"end\":28325,\"start\":28316},{\"end\":31053,\"start\":31045},{\"attributes\":{\"ref_id\":\"fig_2\"},\"end\":34942,\"start\":34934},{\"attributes\":{\"ref_id\":\"fig_2\"},\"end\":35261,\"start\":35253},{\"end\":38222,\"start\":38203},{\"end\":39041,\"start\":39033},{\"end\":40919,\"start\":40911},{\"end\":42204,\"start\":42196},{\"end\":42606,\"start\":42575},{\"end\":52254,\"start\":52239},{\"attributes\":{\"ref_id\":\"fig_6\"},\"end\":52806,\"start\":52798},{\"attributes\":{\"ref_id\":\"fig_7\"},\"end\":53359,\"start\":53351},{\"attributes\":{\"ref_id\":\"fig_6\"},\"end\":53440,\"start\":53432},{\"attributes\":{\"ref_id\":\"fig_7\"},\"end\":54100,\"start\":54092},{\"attributes\":{\"ref_id\":\"fig_8\"},\"end\":54582,\"start\":54573},{\"attributes\":{\"ref_id\":\"fig_7\"},\"end\":54826,\"start\":54818},{\"attributes\":{\"ref_id\":\"fig_8\"},\"end\":54862,\"start\":54853},{\"end\":55419,\"start\":55405},{\"end\":55585,\"start\":55571}]", "bib_author_first_name": "[{\"end\":59410,\"start\":59409},{\"end\":59412,\"start\":59411},{\"end\":59421,\"start\":59420},{\"end\":59433,\"start\":59432},{\"end\":59435,\"start\":59434},{\"end\":59444,\"start\":59443},{\"end\":59446,\"start\":59445},{\"end\":59945,\"start\":59944},{\"end\":59947,\"start\":59946},{\"end\":59958,\"start\":59957},{\"end\":59960,\"start\":59959},{\"end\":59969,\"start\":59968},{\"end\":59971,\"start\":59970},{\"end\":60497,\"start\":60496},{\"end\":60851,\"start\":60850},{\"end\":60853,\"start\":60852},{\"end\":61216,\"start\":61215},{\"end\":61227,\"start\":61226},{\"end\":61229,\"start\":61228},{\"end\":61743,\"start\":61742},{\"end\":61745,\"start\":61744},{\"end\":61756,\"start\":61755},{\"end\":61758,\"start\":61757},{\"end\":61768,\"start\":61767},{\"end\":61770,\"start\":61769},{\"end\":61781,\"start\":61780},{\"end\":61783,\"start\":61782},{\"end\":61796,\"start\":61795},{\"end\":61798,\"start\":61797},{\"end\":62050,\"start\":62049},{\"end\":62056,\"start\":62055},{\"end\":62065,\"start\":62064},{\"end\":62364,\"start\":62363},{\"end\":62373,\"start\":62372},{\"end\":62384,\"start\":62383},{\"end\":62393,\"start\":62392},{\"end\":62558,\"start\":62557},{\"end\":62960,\"start\":62959},{\"end\":62962,\"start\":62961},{\"end\":62971,\"start\":62970},{\"end\":62973,\"start\":62972},{\"end\":62983,\"start\":62982},{\"end\":62985,\"start\":62984},{\"end\":62997,\"start\":62996},{\"end\":62999,\"start\":62998},{\"end\":63007,\"start\":63006},{\"end\":63009,\"start\":63008},{\"end\":63447,\"start\":63446},{\"end\":63852,\"start\":63851},{\"end\":63862,\"start\":63861},{\"end\":63872,\"start\":63871},{\"end\":63883,\"start\":63882},{\"end\":63892,\"start\":63891},{\"end\":64173,\"start\":64172},{\"end\":64175,\"start\":64174},{\"end\":64497,\"start\":64496},{\"end\":64811,\"start\":64810},{\"end\":65033,\"start\":65032},{\"end\":65035,\"start\":65034},{\"end\":65043,\"start\":65042},{\"end\":65045,\"start\":65044},{\"end\":65416,\"start\":65415},{\"end\":65418,\"start\":65417},{\"end\":65864,\"start\":65863},{\"end\":65866,\"start\":65865},{\"end\":66107,\"start\":66106},{\"end\":66109,\"start\":66108},{\"end\":66120,\"start\":66119},{\"end\":66122,\"start\":66121},{\"end\":66133,\"start\":66132},{\"end\":66135,\"start\":66134},{\"end\":66143,\"start\":66142},{\"end\":66145,\"start\":66144},{\"end\":66477,\"start\":66476},{\"end\":66488,\"start\":66487},{\"end\":66490,\"start\":66489},{\"end\":66500,\"start\":66499},{\"end\":66508,\"start\":66507},{\"end\":66519,\"start\":66518},{\"end\":66521,\"start\":66520},{\"end\":66531,\"start\":66530},{\"end\":66533,\"start\":66532},{\"end\":66890,\"start\":66889},{\"end\":66901,\"start\":66900},{\"end\":66912,\"start\":66911},{\"end\":67288,\"start\":67287},{\"end\":67290,\"start\":67289},{\"end\":67300,\"start\":67299},{\"end\":67302,\"start\":67301},{\"end\":67636,\"start\":67635},{\"end\":67638,\"start\":67637},{\"end\":67650,\"start\":67649},{\"end\":67667,\"start\":67666},{\"end\":67678,\"start\":67677},{\"end\":68075,\"start\":68074},{\"end\":68077,\"start\":68076},{\"end\":68089,\"start\":68088},{\"end\":68103,\"start\":68102},{\"end\":68114,\"start\":68113},{\"end\":68449,\"start\":68448},{\"end\":68451,\"start\":68450},{\"end\":68462,\"start\":68461},{\"end\":68475,\"start\":68474},{\"end\":68477,\"start\":68476},{\"end\":68739,\"start\":68738},{\"end\":68741,\"start\":68740},{\"end\":69021,\"start\":69020},{\"end\":69023,\"start\":69022},{\"end\":69031,\"start\":69030},{\"end\":69033,\"start\":69032},{\"end\":69043,\"start\":69042},{\"end\":69045,\"start\":69044},{\"end\":69348,\"start\":69347},{\"end\":69355,\"start\":69354},{\"end\":69357,\"start\":69356},{\"end\":69370,\"start\":69369},{\"end\":69378,\"start\":69377},{\"end\":69785,\"start\":69784},{\"end\":69787,\"start\":69786},{\"end\":69797,\"start\":69796},{\"end\":69799,\"start\":69798},{\"end\":70240,\"start\":70239},{\"end\":70242,\"start\":70241},{\"end\":70252,\"start\":70251},{\"end\":70259,\"start\":70258},{\"end\":70684,\"start\":70683},{\"end\":70691,\"start\":70690},{\"end\":70698,\"start\":70697},{\"end\":70700,\"start\":70699},{\"end\":70946,\"start\":70945},{\"end\":70956,\"start\":70955},{\"end\":70969,\"start\":70968},{\"end\":71370,\"start\":71369},{\"end\":71381,\"start\":71380},{\"end\":71392,\"start\":71391},{\"end\":71402,\"start\":71401},{\"end\":71413,\"start\":71412},{\"end\":71725,\"start\":71724},{\"end\":71727,\"start\":71726},{\"end\":72011,\"start\":72010},{\"end\":72325,\"start\":72324},{\"end\":72334,\"start\":72333},{\"end\":72341,\"start\":72340},{\"end\":72352,\"start\":72351},{\"end\":72636,\"start\":72635},{\"end\":72649,\"start\":72648},{\"end\":72658,\"start\":72657},{\"end\":72977,\"start\":72976},{\"end\":73196,\"start\":73195},{\"end\":73445,\"start\":73444},{\"end\":73447,\"start\":73446},{\"end\":73732,\"start\":73731},{\"end\":74026,\"start\":74025},{\"end\":74037,\"start\":74036},{\"end\":74049,\"start\":74048},{\"end\":74066,\"start\":74065},{\"end\":74414,\"start\":74413},{\"end\":74425,\"start\":74424},{\"end\":74437,\"start\":74436},{\"end\":74779,\"start\":74778},{\"end\":74791,\"start\":74790},{\"end\":74802,\"start\":74801},{\"end\":74814,\"start\":74813},{\"end\":74831,\"start\":74830},{\"end\":75028,\"start\":75027},{\"end\":75035,\"start\":75034},{\"end\":75278,\"start\":75277},{\"end\":75289,\"start\":75288},{\"end\":75300,\"start\":75299},{\"end\":75866,\"start\":75865},{\"end\":75874,\"start\":75873},{\"end\":75883,\"start\":75882},{\"end\":75895,\"start\":75894},{\"end\":76158,\"start\":76157},{\"end\":76160,\"start\":76159},{\"end\":76170,\"start\":76169},{\"end\":76172,\"start\":76171},{\"end\":76182,\"start\":76181},{\"end\":76192,\"start\":76191},{\"end\":76194,\"start\":76193},{\"end\":76202,\"start\":76201},{\"end\":76204,\"start\":76203},{\"end\":76546,\"start\":76545},{\"end\":76558,\"start\":76557},{\"end\":76571,\"start\":76570},{\"end\":76581,\"start\":76580},{\"end\":76813,\"start\":76812},{\"end\":77168,\"start\":77167},{\"end\":77170,\"start\":77169},{\"end\":77532,\"start\":77531},{\"end\":77534,\"start\":77533},{\"end\":77926,\"start\":77925},{\"end\":77928,\"start\":77927},{\"end\":77938,\"start\":77937}]", "bib_author_last_name": "[{\"end\":59418,\"start\":59413},{\"end\":59430,\"start\":59422},{\"end\":59441,\"start\":59436},{\"end\":59453,\"start\":59447},{\"end\":59955,\"start\":59948},{\"end\":59966,\"start\":59961},{\"end\":59976,\"start\":59972},{\"end\":60508,\"start\":60498},{\"end\":60861,\"start\":60854},{\"end\":61224,\"start\":61217},{\"end\":61234,\"start\":61230},{\"end\":61753,\"start\":61746},{\"end\":61765,\"start\":61759},{\"end\":61778,\"start\":61771},{\"end\":61793,\"start\":61784},{\"end\":61804,\"start\":61799},{\"end\":62053,\"start\":62051},{\"end\":62062,\"start\":62057},{\"end\":62072,\"start\":62066},{\"end\":62370,\"start\":62365},{\"end\":62381,\"start\":62374},{\"end\":62390,\"start\":62385},{\"end\":62400,\"start\":62394},{\"end\":62564,\"start\":62559},{\"end\":62968,\"start\":62963},{\"end\":62980,\"start\":62974},{\"end\":62994,\"start\":62986},{\"end\":63004,\"start\":63000},{\"end\":63015,\"start\":63010},{\"end\":63454,\"start\":63448},{\"end\":63859,\"start\":63853},{\"end\":63869,\"start\":63863},{\"end\":63880,\"start\":63873},{\"end\":63889,\"start\":63884},{\"end\":63900,\"start\":63893},{\"end\":64185,\"start\":64176},{\"end\":64506,\"start\":64498},{\"end\":64821,\"start\":64812},{\"end\":65040,\"start\":65036},{\"end\":65054,\"start\":65046},{\"end\":65427,\"start\":65419},{\"end\":65871,\"start\":65867},{\"end\":66117,\"start\":66110},{\"end\":66130,\"start\":66123},{\"end\":66140,\"start\":66136},{\"end\":66151,\"start\":66146},{\"end\":66485,\"start\":66478},{\"end\":66497,\"start\":66491},{\"end\":66505,\"start\":66501},{\"end\":66516,\"start\":66509},{\"end\":66528,\"start\":66522},{\"end\":66539,\"start\":66534},{\"end\":66898,\"start\":66891},{\"end\":66909,\"start\":66902},{\"end\":66917,\"start\":66913},{\"end\":67297,\"start\":67291},{\"end\":67308,\"start\":67303},{\"end\":67647,\"start\":67639},{\"end\":67664,\"start\":67651},{\"end\":67675,\"start\":67668},{\"end\":67683,\"start\":67679},{\"end\":68086,\"start\":68078},{\"end\":68100,\"start\":68090},{\"end\":68111,\"start\":68104},{\"end\":68121,\"start\":68115},{\"end\":68459,\"start\":68452},{\"end\":68472,\"start\":68463},{\"end\":68482,\"start\":68478},{\"end\":68750,\"start\":68742},{\"end\":69028,\"start\":69024},{\"end\":69040,\"start\":69034},{\"end\":69050,\"start\":69046},{\"end\":69352,\"start\":69349},{\"end\":69367,\"start\":69358},{\"end\":69375,\"start\":69371},{\"end\":69385,\"start\":69379},{\"end\":69794,\"start\":69788},{\"end\":69805,\"start\":69800},{\"end\":70249,\"start\":70243},{\"end\":70256,\"start\":70253},{\"end\":70262,\"start\":70260},{\"end\":70688,\"start\":70685},{\"end\":70695,\"start\":70692},{\"end\":70707,\"start\":70701},{\"end\":70953,\"start\":70947},{\"end\":70966,\"start\":70957},{\"end\":70976,\"start\":70970},{\"end\":71378,\"start\":71371},{\"end\":71389,\"start\":71382},{\"end\":71399,\"start\":71393},{\"end\":71410,\"start\":71403},{\"end\":71422,\"start\":71414},{\"end\":71732,\"start\":71728},{\"end\":72014,\"start\":72012},{\"end\":72331,\"start\":72326},{\"end\":72338,\"start\":72335},{\"end\":72349,\"start\":72342},{\"end\":72360,\"start\":72353},{\"end\":72646,\"start\":72637},{\"end\":72655,\"start\":72650},{\"end\":72666,\"start\":72659},{\"end\":72985,\"start\":72978},{\"end\":73202,\"start\":73197},{\"end\":73451,\"start\":73448},{\"end\":73739,\"start\":73733},{\"end\":74034,\"start\":74027},{\"end\":74046,\"start\":74038},{\"end\":74063,\"start\":74050},{\"end\":74074,\"start\":74067},{\"end\":74422,\"start\":74415},{\"end\":74434,\"start\":74426},{\"end\":74445,\"start\":74438},{\"end\":74788,\"start\":74780},{\"end\":74799,\"start\":74792},{\"end\":74811,\"start\":74803},{\"end\":74828,\"start\":74815},{\"end\":74842,\"start\":74832},{\"end\":75032,\"start\":75029},{\"end\":75042,\"start\":75036},{\"end\":75286,\"start\":75279},{\"end\":75297,\"start\":75290},{\"end\":75309,\"start\":75301},{\"end\":75871,\"start\":75867},{\"end\":75880,\"start\":75875},{\"end\":75892,\"start\":75884},{\"end\":75905,\"start\":75896},{\"end\":76167,\"start\":76161},{\"end\":76179,\"start\":76173},{\"end\":76189,\"start\":76183},{\"end\":76199,\"start\":76195},{\"end\":76212,\"start\":76205},{\"end\":76555,\"start\":76547},{\"end\":76568,\"start\":76559},{\"end\":76578,\"start\":76572},{\"end\":76588,\"start\":76582},{\"end\":76820,\"start\":76814},{\"end\":77178,\"start\":77171},{\"end\":77541,\"start\":77535},{\"end\":77935,\"start\":77929},{\"end\":77941,\"start\":77939},{\"end\":77947,\"start\":77943}]", "bib_entry": "[{\"attributes\":{\"id\":\"b0\"},\"end\":59772,\"start\":59334},{\"attributes\":{\"id\":\"b1\",\"matched_paper_id\":14017319},\"end\":60378,\"start\":59774},{\"attributes\":{\"id\":\"b2\",\"matched_paper_id\":24940318},\"end\":60775,\"start\":60380},{\"attributes\":{\"id\":\"b3\",\"matched_paper_id\":21489608},\"end\":61088,\"start\":60777},{\"attributes\":{\"doi\":\"10.1210/jcem.84.6.5803\",\"id\":\"b4\",\"matched_paper_id\":38451201},\"end\":61669,\"start\":61090},{\"attributes\":{\"id\":\"b5\",\"matched_paper_id\":5502172},\"end\":61998,\"start\":61671},{\"attributes\":{\"doi\":\"10.1093/epirev/mxt009\",\"id\":\"b6\",\"matched_paper_id\":12689497},\"end\":62359,\"start\":62000},{\"attributes\":{\"id\":\"b7\"},\"end\":62449,\"start\":62361},{\"attributes\":{\"id\":\"b8\",\"matched_paper_id\":10837528},\"end\":62837,\"start\":62451},{\"attributes\":{\"id\":\"b9\",\"matched_paper_id\":56895003},\"end\":63344,\"start\":62839},{\"attributes\":{\"doi\":\"10.1093/humupd/dmt027\",\"id\":\"b10\",\"matched_paper_id\":10370929},\"end\":63786,\"start\":63346},{\"attributes\":{\"id\":\"b11\",\"matched_paper_id\":6799583},\"end\":64135,\"start\":63788},{\"attributes\":{\"id\":\"b12\",\"matched_paper_id\":220746984},\"end\":64436,\"start\":64137},{\"attributes\":{\"id\":\"b13\",\"matched_paper_id\":73480251},\"end\":64774,\"start\":64438},{\"attributes\":{\"id\":\"b14\"},\"end\":64877,\"start\":64776},{\"attributes\":{\"id\":\"b15\",\"matched_paper_id\":230598196},\"end\":65333,\"start\":64879},{\"attributes\":{\"doi\":\"https:/onlinelibrary.wiley.com/doi/pdf/10.1002/ajpa.21195\",\"id\":\"b16\",\"matched_paper_id\":38772422},\"end\":65816,\"start\":65335},{\"attributes\":{\"id\":\"b17\",\"matched_paper_id\":57080210},\"end\":66038,\"start\":65818},{\"attributes\":{\"id\":\"b18\",\"matched_paper_id\":7653718},\"end\":66417,\"start\":66040},{\"attributes\":{\"id\":\"b19\",\"matched_paper_id\":12389477},\"end\":66796,\"start\":66419},{\"attributes\":{\"id\":\"b20\",\"matched_paper_id\":21966218},\"end\":67169,\"start\":66798},{\"attributes\":{\"id\":\"b21\",\"matched_paper_id\":33426018},\"end\":67503,\"start\":67171},{\"attributes\":{\"id\":\"b22\",\"matched_paper_id\":36308609},\"end\":67925,\"start\":67505},{\"attributes\":{\"id\":\"b23\",\"matched_paper_id\":25573307},\"end\":68379,\"start\":67927},{\"attributes\":{\"id\":\"b24\",\"matched_paper_id\":7327083},\"end\":68645,\"start\":68381},{\"attributes\":{\"id\":\"b25\",\"matched_paper_id\":17511944},\"end\":68969,\"start\":68647},{\"attributes\":{\"id\":\"b26\",\"matched_paper_id\":554393},\"end\":69283,\"start\":68971},{\"attributes\":{\"doi\":\"10.1093/biostatistics/kxi043\",\"id\":\"b27\",\"matched_paper_id\":15183214},\"end\":69702,\"start\":69285},{\"attributes\":{\"id\":\"b28\",\"matched_paper_id\":26215728},\"end\":70079,\"start\":69704},{\"attributes\":{\"id\":\"b29\",\"matched_paper_id\":46072144},\"end\":70616,\"start\":70081},{\"attributes\":{\"id\":\"b30\",\"matched_paper_id\":24851192},\"end\":70892,\"start\":70618},{\"attributes\":{\"doi\":\"10.1093/biostatistics/kxq020\",\"id\":\"b31\",\"matched_paper_id\":5876825},\"end\":71278,\"start\":70894},{\"attributes\":{\"id\":\"b32\",\"matched_paper_id\":231760124},\"end\":71640,\"start\":71280},{\"attributes\":{\"id\":\"b33\",\"matched_paper_id\":201645684},\"end\":71894,\"start\":71642},{\"attributes\":{\"doi\":\"1808.02932\",\"id\":\"b34\",\"matched_paper_id\":202750236},\"end\":72225,\"start\":71896},{\"attributes\":{\"id\":\"b35\",\"matched_paper_id\":92219202},\"end\":72564,\"start\":72227},{\"attributes\":{\"id\":\"b36\",\"matched_paper_id\":216081533},\"end\":72901,\"start\":72566},{\"attributes\":{\"id\":\"b37\",\"matched_paper_id\":4443408},\"end\":73108,\"start\":72903},{\"attributes\":{\"id\":\"b38\",\"matched_paper_id\":54480850},\"end\":73365,\"start\":73110},{\"attributes\":{\"id\":\"b39\",\"matched_paper_id\":40369149},\"end\":73605,\"start\":73367},{\"attributes\":{\"id\":\"b40\",\"matched_paper_id\":4662438},\"end\":73942,\"start\":73607},{\"attributes\":{\"id\":\"b41\",\"matched_paper_id\":53213190},\"end\":74348,\"start\":73944},{\"attributes\":{\"doi\":\"10.1038/s41746-020-0292-9\",\"id\":\"b42\",\"matched_paper_id\":219988530},\"end\":74727,\"start\":74350},{\"attributes\":{\"id\":\"b43\"},\"end\":75010,\"start\":74729},{\"attributes\":{\"id\":\"b44\",\"matched_paper_id\":4910027},\"end\":75219,\"start\":75012},{\"attributes\":{\"doi\":\"10.1145/3178876.3186052\",\"id\":\"b45\",\"matched_paper_id\":3418973},\"end\":75816,\"start\":75221},{\"attributes\":{\"doi\":\"abs/2009.11087\",\"id\":\"b46\"},\"end\":76046,\"start\":75818},{\"attributes\":{\"id\":\"b47\",\"matched_paper_id\":20907361},\"end\":76472,\"start\":76048},{\"attributes\":{\"id\":\"b48\"},\"end\":76720,\"start\":76474},{\"attributes\":{\"doi\":\"1812.05691\",\"id\":\"b49\"},\"end\":77013,\"start\":76722},{\"attributes\":{\"id\":\"b50\",\"matched_paper_id\":13603757},\"end\":77396,\"start\":77015},{\"attributes\":{\"doi\":\"10.1210/jc.2011-3362\",\"id\":\"b51\",\"matched_paper_id\":18754990},\"end\":77885,\"start\":77398},{\"attributes\":{\"doi\":\"1412.6980\",\"id\":\"b52\"},\"end\":78105,\"start\":77887},{\"attributes\":{\"doi\":\"3. 40000 60000 80000 100000 120000 140000 160000 180000\",\"id\":\"b53\"},\"end\":78545,\"start\":78107},{\"attributes\":{\"id\":\"b54\"},\"end\":78877,\"start\":78547}]", "bib_title": "[{\"end\":59407,\"start\":59334},{\"end\":59942,\"start\":59774},{\"end\":60494,\"start\":60380},{\"end\":60848,\"start\":60777},{\"end\":61213,\"start\":61090},{\"end\":61740,\"start\":61671},{\"end\":62047,\"start\":62000},{\"end\":62555,\"start\":62451},{\"end\":62957,\"start\":62839},{\"end\":63444,\"start\":63346},{\"end\":63849,\"start\":63788},{\"end\":64170,\"start\":64137},{\"end\":64494,\"start\":64438},{\"end\":65030,\"start\":64879},{\"end\":65413,\"start\":65335},{\"end\":65861,\"start\":65818},{\"end\":66104,\"start\":66040},{\"end\":66474,\"start\":66419},{\"end\":66887,\"start\":66798},{\"end\":67285,\"start\":67171},{\"end\":67633,\"start\":67505},{\"end\":68072,\"start\":67927},{\"end\":68446,\"start\":68381},{\"end\":68736,\"start\":68647},{\"end\":69018,\"start\":68971},{\"end\":69345,\"start\":69285},{\"end\":69782,\"start\":69704},{\"end\":70237,\"start\":70081},{\"end\":70681,\"start\":70618},{\"end\":70943,\"start\":70894},{\"end\":71367,\"start\":71280},{\"end\":71722,\"start\":71642},{\"end\":72008,\"start\":71896},{\"end\":72322,\"start\":72227},{\"end\":72633,\"start\":72566},{\"end\":72974,\"start\":72903},{\"end\":73193,\"start\":73110},{\"end\":73442,\"start\":73367},{\"end\":73729,\"start\":73607},{\"end\":74023,\"start\":73944},{\"end\":74411,\"start\":74350},{\"end\":75025,\"start\":75012},{\"end\":75275,\"start\":75221},{\"end\":76155,\"start\":76048},{\"end\":77165,\"start\":77015},{\"end\":77529,\"start\":77398},{\"end\":77923,\"start\":77887},{\"end\":78259,\"start\":78107},{\"end\":78700,\"start\":78547}]", "bib_author": "[{\"end\":59420,\"start\":59409},{\"end\":59432,\"start\":59420},{\"end\":59443,\"start\":59432},{\"end\":59455,\"start\":59443},{\"end\":59957,\"start\":59944},{\"end\":59968,\"start\":59957},{\"end\":59978,\"start\":59968},{\"end\":60510,\"start\":60496},{\"end\":60863,\"start\":60850},{\"end\":61226,\"start\":61215},{\"end\":61236,\"start\":61226},{\"end\":61755,\"start\":61742},{\"end\":61767,\"start\":61755},{\"end\":61780,\"start\":61767},{\"end\":61795,\"start\":61780},{\"end\":61806,\"start\":61795},{\"end\":62055,\"start\":62049},{\"end\":62064,\"start\":62055},{\"end\":62074,\"start\":62064},{\"end\":62372,\"start\":62363},{\"end\":62383,\"start\":62372},{\"end\":62392,\"start\":62383},{\"end\":62402,\"start\":62392},{\"end\":62566,\"start\":62557},{\"end\":62970,\"start\":62959},{\"end\":62982,\"start\":62970},{\"end\":62996,\"start\":62982},{\"end\":63006,\"start\":62996},{\"end\":63017,\"start\":63006},{\"end\":63456,\"start\":63446},{\"end\":63861,\"start\":63851},{\"end\":63871,\"start\":63861},{\"end\":63882,\"start\":63871},{\"end\":63891,\"start\":63882},{\"end\":63902,\"start\":63891},{\"end\":64187,\"start\":64172},{\"end\":64508,\"start\":64496},{\"end\":64823,\"start\":64810},{\"end\":65042,\"start\":65032},{\"end\":65056,\"start\":65042},{\"end\":65429,\"start\":65415},{\"end\":65873,\"start\":65863},{\"end\":66119,\"start\":66106},{\"end\":66132,\"start\":66119},{\"end\":66142,\"start\":66132},{\"end\":66153,\"start\":66142},{\"end\":66487,\"start\":66476},{\"end\":66499,\"start\":66487},{\"end\":66507,\"start\":66499},{\"end\":66518,\"start\":66507},{\"end\":66530,\"start\":66518},{\"end\":66541,\"start\":66530},{\"end\":66900,\"start\":66889},{\"end\":66911,\"start\":66900},{\"end\":66919,\"start\":66911},{\"end\":67299,\"start\":67287},{\"end\":67310,\"start\":67299},{\"end\":67649,\"start\":67635},{\"end\":67666,\"start\":67649},{\"end\":67677,\"start\":67666},{\"end\":67685,\"start\":67677},{\"end\":68088,\"start\":68074},{\"end\":68102,\"start\":68088},{\"end\":68113,\"start\":68102},{\"end\":68123,\"start\":68113},{\"end\":68461,\"start\":68448},{\"end\":68474,\"start\":68461},{\"end\":68484,\"start\":68474},{\"end\":68752,\"start\":68738},{\"end\":69030,\"start\":69020},{\"end\":69042,\"start\":69030},{\"end\":69052,\"start\":69042},{\"end\":69354,\"start\":69347},{\"end\":69369,\"start\":69354},{\"end\":69377,\"start\":69369},{\"end\":69387,\"start\":69377},{\"end\":69796,\"start\":69784},{\"end\":69807,\"start\":69796},{\"end\":70251,\"start\":70239},{\"end\":70258,\"start\":70251},{\"end\":70264,\"start\":70258},{\"end\":70690,\"start\":70683},{\"end\":70697,\"start\":70690},{\"end\":70709,\"start\":70697},{\"end\":70955,\"start\":70945},{\"end\":70968,\"start\":70955},{\"end\":70978,\"start\":70968},{\"end\":71380,\"start\":71369},{\"end\":71391,\"start\":71380},{\"end\":71401,\"start\":71391},{\"end\":71412,\"start\":71401},{\"end\":71424,\"start\":71412},{\"end\":71734,\"start\":71724},{\"end\":72016,\"start\":72010},{\"end\":72333,\"start\":72324},{\"end\":72340,\"start\":72333},{\"end\":72351,\"start\":72340},{\"end\":72362,\"start\":72351},{\"end\":72648,\"start\":72635},{\"end\":72657,\"start\":72648},{\"end\":72668,\"start\":72657},{\"end\":72987,\"start\":72976},{\"end\":73204,\"start\":73195},{\"end\":73453,\"start\":73444},{\"end\":73741,\"start\":73731},{\"end\":74036,\"start\":74025},{\"end\":74048,\"start\":74036},{\"end\":74065,\"start\":74048},{\"end\":74076,\"start\":74065},{\"end\":74424,\"start\":74413},{\"end\":74436,\"start\":74424},{\"end\":74447,\"start\":74436},{\"end\":74790,\"start\":74778},{\"end\":74801,\"start\":74790},{\"end\":74813,\"start\":74801},{\"end\":74830,\"start\":74813},{\"end\":74844,\"start\":74830},{\"end\":75034,\"start\":75027},{\"end\":75044,\"start\":75034},{\"end\":75288,\"start\":75277},{\"end\":75299,\"start\":75288},{\"end\":75311,\"start\":75299},{\"end\":75873,\"start\":75865},{\"end\":75882,\"start\":75873},{\"end\":75894,\"start\":75882},{\"end\":75907,\"start\":75894},{\"end\":76169,\"start\":76157},{\"end\":76181,\"start\":76169},{\"end\":76191,\"start\":76181},{\"end\":76201,\"start\":76191},{\"end\":76214,\"start\":76201},{\"end\":76557,\"start\":76545},{\"end\":76570,\"start\":76557},{\"end\":76580,\"start\":76570},{\"end\":76590,\"start\":76580},{\"end\":76822,\"start\":76812},{\"end\":77180,\"start\":77167},{\"end\":77543,\"start\":77531},{\"end\":77937,\"start\":77925},{\"end\":77943,\"start\":77937},{\"end\":77949,\"start\":77943}]", "bib_venue": "[{\"end\":75438,\"start\":75419},{\"end\":59497,\"start\":59455},{\"end\":60028,\"start\":59978},{\"end\":60562,\"start\":60510},{\"end\":60915,\"start\":60863},{\"end\":61308,\"start\":61258},{\"end\":61815,\"start\":61806},{\"end\":62116,\"start\":62095},{\"end\":62600,\"start\":62566},{\"end\":63041,\"start\":63017},{\"end\":63502,\"start\":63477},{\"end\":63919,\"start\":63902},{\"end\":64232,\"start\":64187},{\"end\":64553,\"start\":64508},{\"end\":64808,\"start\":64776},{\"end\":65092,\"start\":65056},{\"end\":65527,\"start\":65486},{\"end\":65916,\"start\":65873},{\"end\":66187,\"start\":66153},{\"end\":66588,\"start\":66541},{\"end\":66968,\"start\":66919},{\"end\":67323,\"start\":67310},{\"end\":67698,\"start\":67685},{\"end\":68136,\"start\":68123},{\"end\":68497,\"start\":68484},{\"end\":68796,\"start\":68752},{\"end\":69075,\"start\":69052},{\"end\":69428,\"start\":69415},{\"end\":69839,\"start\":69807},{\"end\":70296,\"start\":70264},{\"end\":70719,\"start\":70709},{\"end\":71019,\"start\":71006},{\"end\":71446,\"start\":71424},{\"end\":71757,\"start\":71734},{\"end\":72049,\"start\":72026},{\"end\":72385,\"start\":72362},{\"end\":72691,\"start\":72668},{\"end\":72993,\"start\":72987},{\"end\":73227,\"start\":73204},{\"end\":73468,\"start\":73453},{\"end\":73764,\"start\":73741},{\"end\":74114,\"start\":74076},{\"end\":74492,\"start\":74472},{\"end\":74776,\"start\":74729},{\"end\":75063,\"start\":75044},{\"end\":75417,\"start\":75334},{\"end\":75863,\"start\":75818},{\"end\":76239,\"start\":76214},{\"end\":76543,\"start\":76474},{\"end\":76810,\"start\":76722},{\"end\":77189,\"start\":77180},{\"end\":77613,\"start\":77563},{\"end\":77988,\"start\":77958},{\"end\":78322,\"start\":78316},{\"end\":78708,\"start\":78702}]"}}}, "year": 2023, "month": 12, "day": 17}