{"id": 235390650, "updated": "2023-10-06 02:04:42.528", "metadata": {"title": "DiffCloth: Differentiable Cloth Simulation with Dry Frictional Contact", "authors": "[{\"first\":\"Yifei\",\"last\":\"Li\",\"middle\":[]},{\"first\":\"Tao\",\"last\":\"Du\",\"middle\":[]},{\"first\":\"Kui\",\"last\":\"Wu\",\"middle\":[]},{\"first\":\"Jie\",\"last\":\"Xu\",\"middle\":[]},{\"first\":\"Wojciech\",\"last\":\"Matusik\",\"middle\":[]}]", "venue": "ACM Transactions on Graphics (TOG), 2022", "journal": "ArXiv", "publication_date": {"year": 2021, "month": null, "day": null}, "abstract": "Cloth simulation has wide applications in computer animation, garment design, and robot-assisted dressing. This work presents a differentiable cloth simulator whose additional gradient information facilitates cloth-related applications. Our differentiable simulator extends a state-of-the-art cloth simulator based on Projective Dynamics (PD) and with dry frictional contact. We draw inspiration from previous work to propose a fast and novel method for deriving gradients in PD-based cloth simulation with dry frictional contact. Furthermore, we conduct a comprehensive analysis and evaluation of the usefulness of gradients in contact-rich cloth simulation. Finally, we demonstrate the efficacy of our simulator in a number of downstream applications, including system identification, trajectory optimization for assisted dressing, closed-loop control, inverse design, and real-to-sim transfer. We observe a substantial speedup obtained from using our gradient information in solving most of these applications.", "fields_of_study": "[\"Computer Science\"]", "external_ids": {"arxiv": "2106.05306", "mag": null, "acl": null, "pubmed": null, "pubmedcentral": null, "dblp": "journals/tog/LiDWXM23", "doi": "10.1145/3527660"}}, "content": {"source": {"pdf_hash": "2df1d01140ee24cd109a0157c9b6a871c7cc26ff", "pdf_src": "Arxiv", "pdf_uri": "[\"https://arxiv.org/pdf/2106.05306v3.pdf\"]", "oa_url_match": false, "oa_info": {"license": null, "open_access_url": "https://dl.acm.org/doi/pdf/10.1145/3527660", "status": "BRONZE"}}, "grobid": {"id": "ecc40d5c9c117138d0609e21a007710bd551ae5a", "type": "plain-text", "url": "s3://ai2-s2-pdf-extraction-prod/parse-results/s2orc_worker/2df1d01140ee24cd109a0157c9b6a871c7cc26ff.txt", "contents": "\nDiffCloth: Differentiable Cloth Simulation with Dry Frictional Contact\n\n\nDiffCloth: Differentiable Cloth Simulation with Dry Frictional Contact\n10.1145/3527660\n\n Fig. 1\n. We present a differentiable cloth simulator with dry frictional contact and demonstrate its efficacy in multiple downstream applications, including designing this twirl dress (10902 degrees of freedom and 125 time steps with a step size of 1/120 seconds). The goal is to optimize the material parameters of the dress so that the apex angle of the cone it forms after a twirl reaches a desired value (100 degrees in this example). Left and middle: the optimized dress before and after a twirl. Top right and bottom right: motion sequences of the twirl dress before and after material parameter optimization using our differentiable simulator. The final apex angles before and after optimization are 39.06 and 100.30 degrees, respectively.\n\nCloth simulation has wide applications in computer animation, garment design, and robot-assisted dressing. This work presents a differentiable cloth simulator whose additional gradient information facilitates cloth-related applications. Our differentiable simulator extends a state-of-the-art cloth simulator based on Projective Dynamics (PD) and with dry frictional contact [Ly et al. 2020]. We draw inspiration from previous work [Du et al. 2021] to propose a fast and novel method for deriving gradients in PD-based cloth simulation with dry frictional contact. Furthermore, we conduct a comprehensive analysis and evaluation of the usefulness of gradients in contact-rich cloth simulation. Finally, we demonstrate the efficacy of our simulator in a number of downstream applications, including system identification, trajectory optimization for assisted dressing, closed-loop control, inverse design, and real-to-sim transfer. We observe a substantial speedup obtained from using our gradient information in solving most of these applications.\n\n\nINTRODUCTION\n\nClothing is ubiquitous in our daily lives. With the widespread appearance of clothing in the fashion industry, film industry, computer animation, and video games, simulating cloth has been an active research topic for more than two decades. Today, research advancement in cloth simulation has unlocked various applications such as virtual try-on [Guan et al. 2012], garment design [Bartle et al. 2016;Montes et al. 2020;Umetani et al. 2011;Wang 2018], fold design [Li et al. 2018c], garment grading [Brouet et al. 2012], sagging-free inversion [Ly et al. 2018], and robot-assisted dressing [Clegg et al. 2020[Clegg et al. , 2018.\n\nInspired by the recent development of differentiable physics simulation and its success in rigid-body systems [de Avila Belbute-Peres et al. 2018a;Geilinger et al. 2020], fluidic systems [Du et al. 2020;Hu et al. 2020], and deformable-body systems [Geilinger et al. 2020;Hahn et al. 2019], we argue in this paper that a large number of cloth-related applications would also benefit from a high-quality differentiable cloth simulator. The critical ingredient in previous differentiable simulators is their ability to compute gradients by backpropagating any differentiable performance metrics through simulation. Such additional gradient information unlocks gradientbased continuous optimization methods, which often bring a substantial speedup compared with their gradient-free counterparts in downstream applications.\n\nCompared with the recent active development of differentiable simulators for rigid-body and soft-body dynamics, research work about differentiable cloth simulation is still relatively sparse. Indeed, cloth simulation introduces unique challenges from its codimensional dynamics and, in particular, rich contact events. While many differentiable simulators have provided solutions to derive gradients for contact models of varying complexity, their techniques typically do not expect contact to be as frequent as in cloth simulation. Deriving gradients with frequent contact and self-collisions in cloth simulation is not fully resolved even in the state-of-the-art differentiable cloth simulators [Liang et al. 2019], and our work attempts to fill this gap.\n\nIn this work, we present a differentiable cloth simulator with extra care of its contact model. We base our method on the state-of-the-art cloth simulator from Ly et al. [2020] and employ its Projective Dynamics (PD) simulation method and dry frictional contact described by the Signorini-Coulomb law. Therefore, our differentiable cloth simulator inherits both the speedup from Projective Dynamics and the physical accuracy from the dry frictional contact model. Unlike previous papers relying on automatic differentiation tools to derive gradients, we present an iterative solver modified from Du et al. [2021] to accommodate the dry frictional contact model. We show that the modified iterative solver leads to a substantial speedup over a standard linear solver in gradient computation.\n\nTo have well-defined gradients, a differentiable simulator expects all quantities computed in simulation to be sufficiently smooth. However, the non-smooth position and force changes from large numbers of contact events question this fundamental assumption. To fully understand the usefulness of a differentiable simulator in contact-rich environments, our work conducts comprehensive evaluation and analysis of the behavior of our differentiable cloth simulation with a varying number of contact events. While previous papers have provided similar discussions, they primarily focus on understanding penalty-based contact models [Geilinger et al. 2020] or discussing collisions in rigid-body dynamics [Werling et al. 2021] where contact events are not as frequent as in cloth simulation. To our best knowledge, our work is the first to present such evaluation and discussion of the usefulness of gradients in a differentiable cloth simulator with dry frictional contact.\n\nWe demonstrate the efficacy of our simulator in various applications, including system identification of frictional coefficients in cloth simulation, inverse garment design for computer animation, and motion planning of robotic manipulators in robot-assisted dressing. Many of these applications would either be impossible or require a much longer time to solve with existing methods. With the extra gradient information from our differentiable simulator, we unlock gradient-based optimizers to solve these problems with a much higher sample efficiency than traditional gradient-free methods.\n\nTo summarize, our work contributes the following:\n\n• We present a novel differentiable cloth simulator with dry frictional contact and an iterative solver for speeding up its gradient computation. • We evaluate the source of non-differentiability in the dry frictional contact model and discuss the usefulness of gradients in differentiable, contact-rich cloth simulation. • We show the efficacy of our simulator in various applications, including system identification, trajectory optimization for assisted dressing, closed-loop control, inverse design, and real-to-sim transfer.\n\n\nRELATED WORK\n\nOur work is closely related to cloth simulation and its applications in computer graphics. It is also relevant to the more recent differentiable simulation methods developed in the graphics and machine learning communities.\n\nCloth simulation. Physics-based cloth simulation has been a popular topic in the graphics community for decades since clothing has been widely used in our daily lives. The implicit Euler integration is used to simulate cloth robustly with large time steps [Baraff and Witkin 1998;Terzopoulos et al. 1987] while introducing excessive numerical damping. To alleviate this problem, implicit and explicit methods (IMEX) [Bridson et al. 2003;Stern and Grinspun 2009] explicitly integrate elastic forces and implicitly integrate damping forces. Researchers have also introduced other variational integrators, e.g., BDF2 [Choi and Ko 2002] and Symplectic integrator [Stern and Desbrun 2006], to conserve the total energy of the system.\n\nFor cloth modeled as a mass-spring system, Liu et al. [2013] treat the implicit Euler integration as an energy minimization problem. The global linear system then remains constant on run-time, and each spring constraint can be solved separately in a local step. That global/local solver idea is generalized as Projective Dynamics (PD) [Bouaziz et al. 2014], which supports material models whose elastic energy has a specific quadratic form. Projective Dynamic is further extended to support more general materials [Liu et al. 2017;Overby et al. 2017]. Though a local step in PD can be processed in parallel, the global step still needs to maintain a large pre-factorized sparse matrix and do back substitutions in each step. Another relevant idea is Position-Based Dynamics (PBD) [Macklin et al. 2016;Müller et al. 2007], which iteratively projects each constraint in a non-linear Gauss-Seidel-like fashion, leading to highly parallelizable computation on GPUs.\n\nBoth PD and PBD have led to a few follow-up works on more advanced speedup techniques. Komaritzan and Botsch [2018] present techniques to speed up PD with contact for physics-based character skinning. For PD and PBD in cloth simulation, Wang [2015] and a follow-up work [Wang and Yang 2016] propose a Chebyshev acceleration technique that can be applied to both PD and PBD to speed up convergence. Fratarcangeli et al. [2016] also introduce a parallel randomized Gauss-Seidel method that re-organizes the unknowns of the sparse linear system into a few independent blocks, which can be solved in parallel with a single Gauss-Seidel step. Recently, the computation of integration is further accelerated by the multigrid method, e.g., geometric multigrid scheme , algebraic multigrid scheme [Tamstorf et al. 2015], and Galerkin multigrid scheme [Xian et al. 2019].\n\nLastly, our work is also relevant to previous attempts to matching cloth simulation with real fabric behaviors [Clyde et al. 2017;Miguel et al. 2012Miguel et al. , 2013Wang et al. 2011], which is typically done by fitting constitutive material models with real material properties and can benefit from extra gradient information from a differentiable simulator [Hahn et al. 2019].\n\nCloth contact and friction. Contact and friction are key ingredients in modern cloth simulation. Provot [1997] proposes a method called \"impact zones\" to collect the nodes involved in multiple collisions into impact zones, which are treated as rigid bodies. Harmon et al. [2008] improve the failsafe of impact zones by allowing some sliding motion of the incriminated vertices. Bridson et al. [2002] introduce a hybrid method to combine the idea of applying repulsion impulses, frictions, and impact zones to handle cloth collision robustly, which is still widely used in modern cloth simulators [Li et al. 2020b;Narain et al. 2012]. To model friction fully implicitly,  treat friction as an additional dissipative term in optimization. Regarding contact handling, repulsive forces or penalty methods have been widely used [Bouaziz et al. 2014;Geilinger et al. 2020;Macklin et al. 2020;Wang 2015] since they are easy to implement. However, these methods often need high stiffness in the penalty energy, leading to disturbing jittering artifacts that demand careful tuning. Recently, Li et al. [2020aLi et al. [ , 2021 define a smooth dissipative potential for friction using barrier methods. Their method can guarantee interpenetration-free states after each time step without the need for parameter tuning.\n\nUnlike penalty-based methods, constraint-based collision handling methods formulate contact as constraints in the physics system. Otaduy et al. [2009] first formulate cloth contacts as a sparse linear complementarity problem (LCP). Their key idea is to interleave frictional contact iterations with normal contact iterations. Instead of using a pyramidal approximation of the Coulomb friction cone [Otaduy et al. 2009], Li et al. [2018b] rely upon the exact Coulomb friction cone and adaptively refine nodes to ensure an accurate treatment of frictional contact. Although constraint-based methods typically ensure the physics-based constraints characterizing contact and friction are satisfied after time integration, their computation cost is typically much more expensive than a penalty-based method. Recently, Ly et al. [2020] propose an efficient algorithm to incorporate frictional contact into Projective Dynamics so that nonpenetration and Coulomb constraints are satisfied simultaneously in a semi-implicit way.\n\nInverse dynamics. Inverse dynamics have been studied in robotics for decades to reconstruct internal forces or torques from the observations of robotic systems. However, existing methods usually focus on rigid-body systems only, which have less than a hundred degrees of freedom (DoFs) [Dario Bellicoso et al. 2016;Kang et al. 2021;Mistry et al. 2010]. Inverse dynamics for high-DoF systems like soft bodies, fluids, and cloth are still under exploration due to the lack of high-quality numerical solutions in robotics for both simulation and differentiation. One noticeable distinction between inverse dynamics and differentiable simulation is that differentiable simulation computes additional gradients for initial states, system parameters, and design parameters. Therefore, differentiable simulation enables more applications like system identification, inverse design, and real-to-sim matching that traditional inverse dynamics typically do not consider.\n\nDifferentiable simulation. Differentiable simulation is a relatively recent concept explored in the graphics and machine learning community, but its original idea can be traced back to much earlier works in graphics decades ago. Perhaps one of the earliest such papers is Witkin and Kass [1988], which shows optimizing simulation to minimize an objective. Despite the recent advances in differentiable simulators in rigid-body dynamics [de Avila Belbute-Peres et al. 2018b;Degrave et al. 2019;Qiao et al. 2020;Toussaint et al. 2018;Xu et al. 2021], soft-body dynamics [Du et al. 2021;Geilinger et al. 2020;Hahn et al. 2019;Hu et al. 2020Hu et al. , 2019, and fluid dynamics [Holl et al. 2020;McNamara et al. 2004;Schenck and Fox 2018;Treuille et al. 2003;Wojtan et al. 2006], differentiable cloth simulation still lacks a good solution. One natural idea is to use particle-based strategies that approximate a nodal system of cloth with graph neural networks [Li et al. 2019;Sanchez-Gonzalez et al. 2020]. Although the neural networks are naturally differentiable, the physical accuracy is hard to guarantee.\n\nTo accurately predict the behavior of real-world objects, recent papers [Geilinger et al. 2020;Hahn et al. 2019] present differentiable soft-body systems and mass-spring systems with implicit Euler time integration and penalty-based contacts. Although a few recent papers [Li et al. 2020a[Li et al. , 2021Macklin et al. 2020] have introduced differentiable contact handling methods, none of them show a clothing example using the differentiability besides demonstrating the differentiability of their methods in theory. Liang et al. [2019] are the first to introduce a fully functional differentiable cloth simulation with contact, friction, and self-collision. Instead of constructing a static LCP problem, they develop a quadratic programming (QP) problem to minimize the change between the collision-free state and the original mesh state. Murthy et al. [2021] also present a differentiable cloth simulator with penalty-based frictional contact in their fully differentiable simulation and rendering pipeline. In this paper, we build upon the differentiable PD framework [Du et al. 2021] to simulate cloth dynamics with dry frictional contact [Ly et al. 2020] and augment it with gradient computation.\n\nA significant challenge in differentiable simulation is the presence of non-smooth contact events, where non-smoothness can arise from discontinuous contact shapes [Popović et al. 2000], impulsive forces [Hu et al. 2019], or branches in contact laws [Ly et al. 2020], to name a few. Many existing differentiable simulators assume such non-smoothness does not affect the usability of gradients. Indeed, they present empirical results that observe the benefits of using gradients in downstream applications [de Avila Belbute-Peres et al. 2018a;Du et al. 2021;Geilinger et al. 2020;Liang et al. 2019]. While our work also observes the advantages of gradients over gradient-free methods in several applications, we take one step further by analyzing the source of non-smoothness and discontinuities in contact-rich cloth simulation. We hope that our experience can serve as useful heuristics for applying differentiable simulation methods in the future.\n\n\nBACKGROUND\n\nIn this section, we briefly review the Projective Dynamics cloth simulation method with dry frictional contact described in Ly et al. [2020], on which our differentiable cloth simulator is based. Our core contribution lies in the development of gradient computation in this PD framework with dry frictional contact, which we detail in the next section.\n\n\nProjective Dynamics Method\n\nImplicit time integration. We model cloth as a nodal system with 3D nodes. Let x( ) and v( ) be two vector functions from R + to R 3 indicating the positions and velocities of all nodes at time . We consider the standard implicit time-stepping scheme discretizing x( ) and v( ) as follows:\nx +1 =x + ℎv +1 , v +1 =v + ℎM −1 [f int (x +1 ) + f ext ],(1)\n( 2) where ℎ is the time step size, M a positive diagonal mass matrix of size 3 × 3 , and f int and f ext the internal and external forces at each node stacked as two 3 -dimensional vectors, respectively. Note that we assume for now f int and f ext do not contain contact forces, which will be discussed separately in Sec. 3.2. We use the cloth material model described in Bouaziz et al. [2014] to define f int . The implicit time-stepping scheme connects the state of the nodal system (x , v ) at time to (x +1 , v +1 ) at new time +1 = + ℎ.\n\nOptimization view. As discussed by Martin et al. [2011], the implicit time-stepping scheme can be rephrased as finding a saddle point of the following energy minimization problem:\nmin x +1 1 2ℎ 2 (x +1 − y) ⊤ M(x +1 − y) + (x +1 ) (x +1 ) ,(3)\nwhere y = x + ℎv + ℎ 2 M −1 f ext is a constant vector that can be precomputed at the beginning of the current time step. The potential energy defines the internal force f int by its spatial gradients: f int = −∇ (x +1 ). It is easy to verify that setting the gradient of the objective function to zero leads to a system of equations identical to Eqns. (1) and (2).\n\nLocal and global solvers in PD. The key assumptions in PD is that the internal energy can be written as a sum of quadratic forms [Bouaziz et al. 2014;Liu et al. 2017]:\n(x) = min p ∈M 2 ∥A x − p ∥ 2 2 (x,p ) , (x) = ∑︁ (x).(4)\nHere, each energy projects A x, a linear transformation of x, to its closest point in the set M and scales its squared distance by a prespecified stiffness . Both A and M are predefined and independent of x. Here, M is the constraint manifold, and p is the auxiliary projection variable as defined in Bouaziz et al. [2014].\n\nWith such an assumption on , PD proposes a local-global solver to minimize a surrogate objective function:\n(x +1 , p) = 1 2ℎ 2 (x +1 − y) ⊤ M(x +1 − y) + ∑︁ (x +1 , p ),(6)\nwhere p stacks up all p from each . In the local step, PD fixes x +1 and projects each p to its corresponding M by solving Eqn.\n\n(4). Such a local step can be done in parallel for each . In the global step, PD fixes p and minimizes as a function of x +1 , which turns out to have a closed-form solution:\n(M + ℎ 2 ∑︁ A ⊤ A ) P x +1 = My + ℎ 2 ∑︁ A ⊤ p b(p) .(7)\nBy alternating between the local and global steps, PD monotonically decreases the surrogate energy until convergence, which can be shown to agree with the saddle point of [Liu et al. 2017]. The source of efficiency in PD comes from the observation that P is a constant matrix that can be prefactorized at the beginning of the simulation, leading to an efficient global step requiring back-substitution only.\n\n\nDry Frictional Contact in Projective Dynamics\n\nSignorini-Coulomb law. Ly et al. [2020] augment the standard PD framework described above with non-penetration collision and Coulomb friction by assuming contact applies to nodes only. At each time step, assuming a collision detection algorithm has identified a set I ⊆ {1, 2, 3, · · · , } which describes the indices of contact nodes. For each node ∈ I, the Signorini-Coulomb law [Brogliato 2016] requires its local force r and velocity u to satisfy one of the following three conditions:\n         Take off: r = 0, u | > 0, Stick: ∥r | ∥ < r | , u = 0, Slip: ∥r | ∥ = r | , u | = 0, r | ∥ u | , r | · u | ≤ 0. (8a) (8b) (8c)\nHere, is the frictional coefficient, and u and r are the nodal velocity and contact force represented in the local contact frame spanned by the tangential plane and contact normal on the contact surface. The notations | and | represent the tangential and normal components of a 3D vector defined in the local frame. We further define C ⊆ R 3 × R 3 as the set of valid (r , u ) pairs described by the conditions above, allowing us to rewrite Eqn. 8 compactly: (r , u ) ∈ C .\n\nImplicit time integration with dry frictional contact. The original implicit time integration now needs to be augmented with additional constraints describing contact conditions [Ly et al. 2020]:\n           x +1 = x + ℎv +1 , v +1 = v + ℎM −1 [f int (x +1 ) + f ext + J ⊤ (x , v )r +1 ], u +1 = J (x , v )v +1 , (r +1, , u +1, ) ∈ C , ∀ ∈ I .(9)\nHere, we have added the subscript in the definitions of the contact set I and the contact condition C described above to specify the time step they are defined from. The notation r +1, and u +1, select the 3D force and velocity corresponding to the -th node from r +1 and u +1 , respectively. The Jacobian matrix J of size 3|I | × 3 selects global vectors defined on the contact nodes and computes their coordinates in the local contact frames. Note that our definition of J implies that it is computed in an explicit manner, i.e., it relies on the last state (x , v ) entering the -th time step. For brevity, this background section will describe simple contact events between a node and a static plane, in which case J is a constant matrix that does not need to be computed from (x , v ). Extensions to more sophisticated contact events, e.g., self-collisions between multiple contact nodes or contact events between a node and a non-planar obstacle, can be found in Ly et al. [2020] and in our implementation and experiments.\n\nProjective Dynamics with dry frictional contact. The core idea in Ly et al. [2020] is an additional local step in PD that solves each contact node independently. Noting that the contact conditions are primarily defined on nodal velocities instead of nodal positions, Ly et al. [2020] first rewrite the global step in Eqn. (7) as an equation of velocities:\nPv +1 = 1 ℎ [b(p) − Px ] b(p) .(10)\nThe velocity-based PD global-local steps then alternate between this new global solver and the original local step, which is unaffected by this change of variables. By comparing Eqn. (9) and Eqn. (10), we can see that incorporating the contact force adds an additional impulse ℎJ ⊤ r +1 to the right-hand side of the global step:\nPv +1 = b(p) + ℎJ ⊤ r +1 .(11)\nThe goal of the global solver is now to find (v +1 , r +1 ) that satisfy contact conditions at each . Noting that in Eqn. (11), P is the only operator that couples unknown contact forces from different , Ly et al. [2020] propose the following iterative solver based on the decomposition of P to solve Eqn. (11):\nMv +1 +1 = b(p) − (ℎ 2 ∑︁ A ⊤ A ) P−M v +1 + ℎJ ⊤ r +1 +1 ,(12)\nwhere the superscripts and + 1 indicate two consecutive iterations in the iterative solver at fixed time step + 1. After iteration , r +1 +1 is updated using v +1 to enforce the Signorini-Coulomb law, which is then used to update v +1 +1 according to Eqn. (12). It is easy to see that the proposed iterative solver fully decouples the momentum equation on each node, allowing Ly et al. [2020] to enforce the Signorini-Columb law by adjusting (v +1, , r +1, ) on each contact node independently in a straightforward manner. When the iterative solver converges, Ly et al. [2020] prove that the result is indeed a solution to Eqn. (9). We refer the readers to the original paper for the details.\n\n\nDIFFERENTIABLE CLOTH SIMULATION\n\nWe now describe in detail how we extend the forward simulator in Sec. 3 to build a differentiable cloth simulator. We start by differentiating implicit time integration in PD without contact, followed by explaining how contact gradients can be added to this framework. Compared with other differentiable simulators, our simulator is unique because of its treatment of the contact-rich nature of cloth simulation: many existing differentiable simulators focus on sparse contact events in rigid-body or deformable-body dynamics [Du et al. 2021;Geilinger et al. 2020;Hu et al. 2019], and the state-of-the-art differentiable cloth simulation method [Liang et al. 2019] handles rich contact events but without physics-based contact forces or friction. To our best knowledge, our work is the first to present a differentiable cloth simulator that can handle rich contact events with Coulomb's law of friction.\n\n\nGradients without Contact\n\nDifferentiating implicit time integration. The core step in building a differentiable simulator based on implicit time-stepping scheme is to backpropgate gradients through the implicit integration described in Eqns. (1) and (2), or equivalently, to derive the Jacobian of the output (x +1 , v +1 ) with respect to the input (x , v ). Mature techniques such as sensitivity analysis, adjoint method, and implicit function theorem have proven to be successful in computing such gradients [Du et al. 2021;Geilinger et al. 2020;Hahn et al. 2019]. To sketch the idea, we plug v +1 from Eqn. (2) into Eqn. (1):\nx +1 = x + ℎv + ℎ 2 M −1 [f int (x +1 ) + f ext ] = y + ℎ 2 M −1 f int (x +1 ),(13)\nwhich is essentially the first-order optimality condition in Eqn. (3). Differentiating x on both sides gives\nx +1 x = I + ℎ 2 M −1 f int (x +1 ) x +1 x +1 x = I − ℎ 2 M −1 ∇ 2 (x +1 ) x +1 x ,(14)\nor equivalently,\nx +1 x = [I + ℎ 2 M −1 ∇ 2 (x +1 )] −1 = [M + ℎ 2 ∇ 2 (x +1 )] −1 M.(15)\nIn backpropagation, such a Jacobian matrix is coupled with the gradients of a loss function which are passed to the previous state (assuming the gradients below are both column vectors):\nx = ( x +1 x ) ⊤ x +1 = M [M + ℎ 2 ∇ 2 (x +1 )] −1 x +1 z +1 .(16)\nHere, we obtain the adjoint vector z +1 by solving the linear system of equations with the matrix M + ℎ 2 ∇ 2 (x +1 ) on the left-hand side, which avoids an explicit inversion of the large and sparse matrix. Backpropagating gradients of with respect to v and v +1\n\ncan be derived similarly. In fact, it solves the same linear system but with a different vector v +1 on the right-hand side.\n\nDifferentiating with Projective Dynamics. With assumptions on the energy form in PD, Du et al. [2021] show that we can speed up the computation in z +1 by exploiting the special form of ∇ 2 . The first-and second-order derivatives in Eqn. (5) are given by the following equations [Du et al. 2021;Liu et al. 2017]:\n∇ (x) = A ⊤ [A x − p * (x)], ∇ 2 (x) = A ⊤ A − A ⊤ p * x ,(17)\nwhere p * (x) = arg min p ∈M (x, p ) is the projection of A x onto M obtained in the local step. Interested readers can refer to the appendix of Liu et al. [2017] for their derivation details. We plug them to z +1 and rewrite the linear system as follows:\n(P − ℎ 2 ∑︁ A ⊤ p * x x +1 ΔP )z +1 = x +1 .(19)\nNoting that a prefactorization of P exists in Projective Dynamics, Du et al. [2021] propose the following iterations to solve z +1 :\nPz +1 +1 = ΔPz +1 + x +1 .(20)\nSimilar to the local-global steps in Projective Dynamics, a local step can evaluate ΔP across each ∇ 2 in parallel, and a global step, which reuses P, can solve z +1 +1 with backsubstitution only. Du et al. [2021] show that such a local-global solver is empirically faster than directly solving Eqn. (16), which resembles the source of efficiency in the original PD method.\n\n\nGradients with Contact\n\nWhile Du et al. [2021] have discussed extensively how to fuse backpropagation into the Projective Dynamics framework, its support of contact is limited to non-penetration conditions without a proper treatment on friction. On the other hand, other prior papers have provided solutions to deriving gradients with contact governed by Signorini-Coulomb law, but they focus on either small-scale problems (e.g., rigid bodies in de Avila Belbute-Peres et al. [2018a]) or sparse contact events on a static ground only [Geilinger et al. 2020]. Here, we present our differentiable cloth simulator that both inherits the speedup from PD and handles gradients with complicated contact events like self-collisions, which are overlooked in many existing differentiable simulators but common in cloth simulation.\n\nDifferentiating implicit time integration with contact. Consider the -th time step in simulation with contact which takes as input (x , v ) and computes (x +1 , v +1 , r +1 , u +1 ) that satisfy Eqn. (9). In particular, for each contact node , the forward simulation identifies which one of the contact conditions in Eqn. (8) applies to (r +1, , u +1, ). As an example, assuming a contact node satisfies Eqn. (8c), its constraints can be summarized as follows:\n∥r +1, | ∥ − r +1, | = 0, u +1, | = 0, (u +1, | ) (r +1, | ) − (u +1, | ) (r +1, | ) = 0, u | · r | ≤ 0, (21a) (21b) (21c) (21d)\nwhere (·) and (·) extract the and components of a twodimensional vector, respectively. The other two cases of Eqn. (8) similarly enforce three equality constraints (r +1, = 0 for taking off and u +1, = 0 for sticking) and a number of inequality constraints on (r +1, , u +1, ). If the inequality constraint is inactive, slightly perturbing the inputs to the simulator will keep (r +1, , u +1, ) inside its interior. Therefore, we can remove the inactive inequality when deducing the gradients during backpropagation. When the inequality constraint is active, the gradients of the simulation are not well defined because it represents corner cases that can be categorized into more than one contact types. These corner cases introduce non-smoothness to the simulator, but it is worth mentioning that they do not create discontinuities, just like the standard rectifier (ReLU) activation function is still continuous despite the non-smoothness at its turning point.\n\nAfter removing the inequality constraint, we further define a nonlinear vector function C (r +1, , u +1, ) for the left-hand side of the three equality constraints and compactly represent the constraints as C (r +1, , u +1, ) = 0. It is convenient that C for all three cases in Eqn. (8) have three dimensional outputs. We can stack C from all contact nodes ∈ I into a nonlinear function C (·, ·) : R 3 |I | × R 3 |I | → R 3 |I | (note that we only evaluate the function at valid input pairs that lie in C ), allowing us to restate Eqn. (9) as follows:\nv +1 = v + ℎM −1 [f int (x + ℎv +1 ) + f ext + J ⊤ r +1 ], C (r +1 , J v +1 ) = 0.(22)\nNote that we choose v +1 instead of x +1 as our variable in order to be consistent with the forward PD simulation with contact described by Ly et al. [2020]. Differentiating both sides of the first equation with respect to v leads to the following result:\nv +1 v = I + ℎM −1 [−ℎ∇ 2 (x + ℎv +1 ) + J ⊤ r +1 v +1 ] v +1 v v +1 v = [I + ℎ 2 M −1 ∇ 2 (x + ℎv +1 ) − ℎM −1 J ⊤ r +1 v +1 ] −1 = [M + ℎ 2 ∇ 2 (x + ℎv +1 ) − ℎJ ⊤ r +1 v +1 ΔR ⊤ ] −1 M.(23)\nComparing it with Eqn. (15), we see the matrix to be inverted now has an additional component dependent on r +1 v +1 , which we obtain from differentiating the constraint C = 0 in Eqn. (22):\nC r r +1 r +1 v +1 + C u J v +1 J = 0, r +1 v +1 = −( C r r +1 ) −1 C u J v +1 J .(26)\nWe stress that computing C r and C u is trivial because both partial derivatives are 3 × 3 block-diagonal matrices. Therefore, ΔR can be parallelized among all contact nodes. Backpropagation through v +1 to v can be implemented with the same adjoint method before, which we give in the equation below for completeness with the notation z +1 overloaded:\nv = M [M + ℎ 2 ∇ 2 (x + ℎv +1 ) − ΔR] −1 v +1 z +1 .(28)\nSpeedup with Projective Dynamics. With additional information about from PD, we can rewrite the adjoint vector z +1 in Eqn. (28) by comparing it with Eqn. (19):\n(P − ΔP − ΔR)z +1 = v +1 ,(29)\nwhich naturally leads to the following iterative solver:\nPz +1 +1 = (ΔP + ΔR)z +1 + v +1 .(30)\nComparing it with Eqn. (20), we see the role of ΔP is replaced with ΔP+ΔR. Since we have shown that computing ΔR can be massively parallelized among contact nodes, it is suitable for contact-rich cloth simulation and preserves the efficiency of the local-global solver.\n\nConvergence. In theory, such an iterative solver is guaranteed to converge from any initial guesses of z +1 when the spectral radius [P −1 (ΔP + ΔR)] < 1. Empirically, we notice in our cloth simulation that divergence is uncommon, especially when high-precision back-propagation is not required (Sec. 6). When the iterative solver fails to converge, we switch back to a direct sparse matrix solver to solve Eqn. (29).\n\nExtensions. We deliberately skipped the full definition of J in all equations above for a clearer presentation of the main idea behind our differentiable cloth simulation. We now elaborate on the role of J and discuss its implications on more complex collisions. When the contact surface is static but non-planar with spatially varying surface normals, J is dependent on the positions of the nodes where the contact events occur. In this case, we estimate the contact normal based on the positions where the contact events occur, which are given by any collision detection algorithms. Replacing J with J (x , v ) requires very minimal extra work to the gradients in Sec. 4.2, as it contributes to the gradients with respect to v in a straightforward manner. Another type of collisions we consider is self-collisions between nodes. In this case, contact occurs between pairs of nodes where the contact normals are defined by the relative position between two nodes in the pair. Therefore, we can still define J as a function of x with each row block now consisting of two blocks of nonzero elements corresponding to the two contact nodes in the pair. Similarly, the gradient derivation remains unchanged except that the dependencies between J and (x , v ) need to be added to Eqn. (23) . As we inherit from Ly et al. [2020] the contact model on nodes only, we also inherit its limitation of not handling other types of self-collisions like edge-edge collisions or vertex-face collisions. We leave the derivation of gradients with such cases as future work.\n\n\nEVALUATIONS\n\nThis section evaluates and discusses numerical properties of the proposed differentiable cloth simulation method in Sec. 4. We first evaluate its gradients by analyzing their source of non-smoothness and studying their usefulness in high-dimensional optimization problems. Next, we compare the dry frictional model with the contact model in the state-of-the-art differentiable cloth simulation method [Liang et al. 2019] and discuss their differences. Finally, we analyze the numerical properties of our iterative solver in backpropagation and compare its performance with a direct linear solver.\n\n\nContinuity and Smoothness\n\nA fundamental assumption in any differentiable simulators is that the underlying physics system is smooth so that gradients can be well-defined. Eqn. (9) contains three possible sources of discontinuities and non-smoothness in the order of their occurrences: determining the contact set I , computing J that represents the local contact frames, and choosing between three branches from C in Eqn. (8). Below we discuss the effects from each of them in detail.\n\nContinuity of branches in contact conditions. First, we empirically demonstrate through an experiment below that switching between the three branches in Eqn. (8) does not create discontinuity in Eqn. (9). In particular, consider the -th time step and assume that C is fixed and that J is a continuous function of (x , v ), if we treat Eqn. (9) as a function that takes as input (x , v ) and returns (x +1 , v +1 ), we will validate that this function is continuous. In other words, perturbing (x , v ) a little will not cause jumps in the resultant (x +1 , v +1 ) even though the corresponding r +1 may need to switch between branches during the perturbation. The intuition is that the three branches in Eqn. (8) together define a connect set C in which (r +1, , u +1, ) from one branch can smoothly transition to another.\n\nWe empirically validate the continuity of branch switching with the following experiment. We simulate a piece of cloth on a rigid, static, and frictional sphere for 200 timesteps. The sphere has one frictional coefficient , and we repeat the experiments by varying from 0 to 0.35 (Fig. 2). When is large, all nodes are fixed on the sphere due to their large static friction. When is close to 0, the cloth slides on the sphere under gravity and takes off from the sphere near the end of the simulation. As changes from 0.35 to 0, each node on the cloth undergoes the transition from sticking to slipping, and eventually takes off. However, since each node has a different contact normal, the turning point for each of them to switch between these branches is different. Overall, when we gradually change , the ratio among the numbers of nodes with static friction, dynamic friction, and no friction at the end of the simulation also changes gradually, allowing us to observe how switching between these branches affects the continuity of the physical quantities in simulation.\n\nWe summarize the quantitative results from this simulation experiment in Fig. 2 (green curves). Specifically, we plot the velocity of three nodes , , and as a function of at an intermediate time step (50) and near the end of simulation (200). We select three nodes from the corners, edge centers, and the center of the cloth, respectively. All velocities converge to 0 when becomes large, which is as expected because a large leads to static friction that freezes these nodes. We also notice a turning point in the velocity curve for each node, indicating a switch between static and dynamic friction. The turning points are located at slightly different values for each node because their normals on the sphere surface are different. We observe from the figure that the branches in Eqn. (8) do not cause discontinuities.\n\nWhile the above experiment confirms that these branches do not create discontinuities, we note that branch switching does introduce non-smoothness due to corner cases that can be arbitrarily classified into either branch, e.g., when a node is static but about to slip. Gradients at these corner cases are not well-defined, but the subset these corner cases occupy in C has measure zero. Therefore, we still expect gradient-based optimization to be functional, just like we have observed the success of gradient-based optimization in modern deep learning with non-smooth but continuous operators, e.g., ReLU, max pooling, and so on.\n\nContinuity of local frames at contact nodes. A second source of possible discontinuity and non-smoothness comes from computing J , which consists of two steps: determining a contact point on the contact surfaces and calculating the local normal and tangent vectors. Both steps depend on the geometric representation of the contact surfaces. As pointed out by previous papers in rigid body dynamics [Popović et al. 2000;Werling et al. 2021], contact surface discretization causes jumps in surface normals, and therefore they create discontinuities in velocity and position calculation. To confirm this observation in cloth simulation, we repeat the previous experiment by replacing the analytically described sphere with a triangulated one (pink triangulated sphere surface in Fig. 2 right). After such replacement, we clearly observe jumps in the intermediate and final velocity from the selected contact nodes (pink curves in Fig. 2). Note that the jumps in velocities from the final velocities are less evident than from the intermediate velocities because the vertical axes have different ranges. This observation agrees with similar experiments from previous papers about rigid body dynamics and suggests that one should favor analytical surfaces in differentiable cloth simulation whenever possible.\n\nWe end our discussion on the discontinuities from J with two more remarks. First, we notice the contact node velocity curves in Fig. 2 are partitioned into a small number of continuous segments, which is consistent with the result reported by previous work [Popović et al. 2000] discussing contact events on rigid body dynamics. Second, if the scene contains multiple objects the cloth can be in contact with, it is not uncommon to see jumps in the locations of contact events, e.g., from one object to another, even with a continuous representation of each object. Such jumps naturally lead to large discontinuities in simulation. While we do not provide solutions to it in this work, a closely related issue has been extensively studied in differentiable rendering [Li et al. 2018a] from which we may borrow inspirations in the future.\n\nContinuity of contact sets. The last and most common source of discontinuity comes from deciding the contact set at each time step, i.e., whether a node should be added to the contact set or not. Obviously, this selection process is not continuous. It is worth noting that having a constant contact set does not cause too much trouble for gradient computation regardless of its size (Fig. 2). Instead, it is the change in the contact set from time to time that brings in discontinuities because whenever a new node is put in the contact set, it adds an impulsive force to the right-hand side of Eqn. (9).\n\nTo better understand the effects of changes in contact sets, we hang a piece of cloth above a static sphere in simulation and let the lower half of the cloth fall and slide on the sphere due to gravity (Fig. 3 top). We equip this experiment with a system identification task of the frictional coefficient and the stiffness parameter of the cloth: given a motion sequence of the cloth generated from a pair of unknown and , we define a loss function that sums over all time steps the squared distance between each node position in simulation and its corresponding location in the given motion sequence. We repeat the task with four settings of the sphere at different horizontal offsets, leading to a varying frequency of contact events among them.\n\nWe plot the landscape of the loss function in Fig. 3 (middle) and compare its smoothness among the four settings with different frequencies of contact events. At first glance, it seems that all four landscapes are equally smooth. However, magnifying a small region of each landscape shows that there is a profound distinction between their continuity and smoothness (Fig. 3 bottom): as establishing and breaking contact becomes more frequent, the local landscape tends to be bumpier.\n\n\nSummary.\n\nWe have discussed the three sources of potential discontinuities and non-smoothness in our differentiable cloth simulator ordered by their damage to the gradients: the branches in the contact conditions only introduce non-smoothness and maintain continuity; contact surface discretization creates discontinuities due to the jumps of normals across adjacent triangles, but we still expect continuity almost everywhere; adding or deleting nodes in the contact set creates frequent and the most severe discontinuities due to the introduction or removal of impulsive forces.\n\n\nUsefulness of Gradients\n\nOne advantage of gradient-based approaches over their gradientfree counterparts is their faster convergence rate: typically, gradientfree methods explore the local landscape of an objective function by evaluating it with massive samples in the neighborhood. However, such a sampling approach quickly becomes less efficient as the dimension of the decision variables grows higher. Due to this reason, we hypothesize that using gradients from our differentiable simulator will become most beneficial when we have a large number of decision variables. We verify this hypothesis using a control optimization problem: we simulate a piece of cloth with time-invariant external forces applied to each node. The goal is to design the force We simulate a piece of cloth sliding on a rigid sphere (right) to study the discontinuities and non-smoothness from contact conditions and surface geometry (Sec. 5.1). The two columns of plots show the velocities of three contact nodes at the 50-th and 200-th time steps. The \"discretized\" and \"continuous\" labels indicate whether these velocities are computed with a triangulated sphere (visualized as pink triangles on the spherical surface) or a smooth sphere (visualized as green sphere surface).\n\nat each node to pull the center of the cloth to a target position in the end (Fig. 4 top). We simulate the cloth with four settings on its DoFs: 4 × 4 nodes, 5 × 5 nodes, 7 × 7 nodes, and 10 × 10 nodes. Therefore, the number of variables in the optimization problem is 48, 75, 147, and 300, respectively. Fig. 4 reports in this problem the convergence rates of L-BFGS-B [Liu and Nocedal 1989] and CMA-ES [Hansen 2006], two representative gradient-based and gradient-free approaches, with varying DoFs. We start with the largest setting of the cloth (300 DoFs) and run both L-BFGS-B and CMA-ES with five randomly chosen initial guesses on the force values in parallel. We then plot the loss vs. time step curves for both methods in Fig. 4 bottom left. Here, the loss is the minimum loss from each method's five parallel runs as a function of the time steps they have consumed during the optimization process. It is clear to see the obvious speedup of L-BFGS-B over CMA-ES in this 300-DoF optimization problem, just as we expected.\n\nAdditionally, we repeat the experiment with three other settings of the cloth and plot the speedup vs. DoF curves in Fig. 4 bottom right, where the speedup is the ratio between the number of time steps used by CMA-ES and L-BFGS-B when their losses reach 0.01. Again, we observe significant speedup from L-BFGS-B across the board, with the largest speedup from the cloth with the highest DoFs. This observation confirms the benefits of using gradients from our differentiable cloth simulator in inverse design problems.\n\n\nBenefits of Dry Frictional Contact\n\nWe compare the contact model in our differentiable simulator with that in the state-of-the-art differentiable cloth simulator from Liang et al. [2019]. Both models ensure penetration-free simulation and detect self-collisions (node-node collisions in ours and vertex-face and edge-edge collisions in Liang et al. [2019]). However, the contact model in Liang et al. [2019] does not take into account complementarity conditions on either contact forces or frictional forces, which may lead to undesirable artifacts. To visualize this issue, we consider a test scenario in which a napkin falls freely onto the inner surface of a bowl (Fig. 5). The differentiable simulators from both Liang et al. [2019] and our work manage to simulate the napkin without numerical explosion. However, the dry frictional contact model in our differentiable simulator shows more physically realistic motion (Fig. 5 middle), whereas the contact model from Liang et al. [2019] leads to more drastic changes in the size of the napkin with a popping artifact after its contact with the bowl (Fig. 5 top and bottom). These artifacts are explainable because the collision handling algorithm in Liang et al. [2019] modifies node positions after penetration without verifying whether such an update requires sticky contact forces. When the napkin becomes in contact with the concave inner surface of the bowl, such a direct modification injects extra elastic energies. This experiment confirms supporting a more advanced contact and friction model in differentiable cloth simulation is both viable and beneficial.\n\n\nEvaluation of Iterative Solver in Backpropagation\n\nAnother key component in our differentiable cloth simulation is the iterative solver in Eqn. (29) that utilizes the prefactorized P in PD. In a standard differentiable simulator, solving Eqn. (29) would be done with a sparse matrix solver treating (P − ΔP − ΔR) as a whole. To understand the performance of the proposed iterative solver, we design two benchmark tests: a \"Wind\" test where a hanging napkin moves under synthetic wind and a \"Slope\" test where a ribbon slides on a slanted plane (Fig. 6). These two tests represent two extreme cases in contact handling: the napkin in \"Wind\" barely has any contact or self-collisions, whereas every single node of the ribbon in \"Slope\" is in contact with the plane. We then compare the time cost of our iterative solver with a sparse LU solver in both tests. We implement both solvers using Eigen [Guennebaud et al. 2010] and choose LU factorization because (P − ΔP − ΔR) is usually not a symmetric or positive definite matrix, preventing us from using more specialized sparse matrix solvers like Cholesky factorization or Conjugate Gradient methods. For the iterative solver, we report two results from low-precision (1e-4) and high-precision (1e-6) convergence thresholds that control the termination condition in the iterations. We find these thresholds by varying it from 1e-1 to 1e-9 until the gradients computed from the iterative solver start to agree with the direct solver, which we treat as the ground-truth gradients. We repeat the experiments with three mesh resolutions to test the scalability of our method. We summarize the statistics from both tests in Table 1. Overall, the iterative solver in backpropagation is faster than the direct solver, and the speedup becomes more substantial as we increase the mesh resolution. The speedup is also more evident with low-precision threshold, which is consistent with the results reported in previous PD papers [Bouaziz et al. 2014;Du et al. 2021;Liu et al. 2017]. A further decomposition of time confirms that solving the linear system takes up the majority of backpropagation time, so any improvement in the choice of solver has a dominating positive effect. Although the low-precision results may not match the ground-truth gradients as closely as their high-precision counterparts, their backpropagation is significantly faster and can still benefit gradient-based optimization. This is because even an imperfect gradient can still guide gradient descent algorithms to converge as long as it is along Fig. 4. Flying Napkin. Comparisons between gradient-based and gradientfree methods for optimizing high-dimensional decision variables in differentiable cloth simulation. Top: the motion sequence of a piece of cloth with external forces parametrized with 300 variables. The goal is to find proper external forces with which the cloth ends at a target position. The loss function is defined as the position discrepancy between the simulated motion sequence and the reference motion. Bottom left: the loss vs. time step curves (300 DoF) from gradient-based (L-BFGS-B) and gradient-free (CMA-ES) methods. Both L-BFGS-B and CMA-ES use the same random seeds. Bottom right: we vary the degrees of freedom in the external force parametrization and repeat the experiment three times. For each experiment, we compute the ratio between the number of time steps used by gradient-free and gradient-based methods until they converge or use up the time budget and plot them as a speedup vs. DoFs curve.\n\nthe descending direction. This is confirmed empirically by our experiments in Sec. 6, in most of which we use low-precision convergence threshold and still observe successful gradient-based optimization results. It is also worth mentioning that contact-related operators, whose time cost is included in the \"Other\" and \"ΔR\" columns in Table 1, add very little extra overhead to the backpropagation. Finally, we observe uncommon but non-negligible failure cases of the iterative solvers in one experiment (48 × 48 with 1e-6 as the threshold in Table 1) \"Wind\". For the 15% failed timesteps, we switch to the sparse LU solver, adding an extra 11.5% time in backpropagation.\n\n\nAPPLICATIONS\n\nIn this section, we demonstrate a variety of cloth-related applications that can benefit from our proposed differentiable cloth simulation with dry frictional contact. We repeat all experiments with multiple random seeds and use the same random seed set (therefore same initial parameter set) for all methods. We report the optimization results and comparisons with other gradient-free algorithms in Table 2. In Table 3, We report the time steps used by each optimization method to reach minimum final loss as well as the convergence ratio of our iterative solver during back-propagation. For gradientfree algorithms, the number of time steps counts the total steps of forward simulation (each steps the simulation forward in time by ℎ). For our gradient-based method, we double this number to include the number of back-propagation steps. Note that in practice, Table 1. Comparison between the iterative solver (ours) and the sparse LU direct solver in backpropagation under various mesh resolutions in the \"Wind\" and \"Slope\" tests. The numbers in the \"Res.\" column report the mesh resolution. The number in parentheses in the \"Solver\" column indicates the epsilon value controlling the convergence of the Jacobi solver. The \"Backprop Time\" column reports the net time in backpropagation and is further decomposed into the next five columns, from which the sum of ratios is 100%: \"ΔP\" and \"ΔR\" report the time spent on assembling ΔP and ΔR respectively, \"Iter. \" and \"Direct\" shows the time cost by either solver, and operations not covered by these four columns are in the \"Other\" column. The \"Fail\" column reports the ratio between the number of timesteps seeing nonconvergence in our iterative solver and the number of total timesteps. The \"Speedup\" column is the ratio between the direct solver's time and our time in \"Backprop. Time\" in each test.\n\n\nTest\n\nRes  Table 2 and all loss vs. time steps plot below, we report the minimum loss or plot the minimum loss envelop achieved across all random seeds. See Appendix C for the complete optimization results for each random seed. Below we describe each application and highlight major results. More information of each example is detailed in Appendix B.\n\nImplementations. We write the backbone of our simulator in C++ and use Eigen for matrix and vector operations. Each application defines an optimization problem which we solve with L-BFGS-B, a classic gradient-based optimizer that can leverage the differentiability of our cloth simulator while limiting parameters to physicallyplausible ranges . We use the implementation of LBFGS++ [Yixuan 2021] for L-BFGS-B, which implements the Moré-Thuente line search [Moré and Thuente 1994].\n\n\nSystem Identification\n\nWe start by showing two system identification examples: \"T-shirt\" (Fig. 7) and \"Sphere\" (Fig. 8).\n\nT-shirt. In the \"T-shirt\" example, we are given a sequence of motions of a hanging T-shirt under synthetic wind generated from a parameterized sinusoidal function. The goal is to estimate a material parameter in the cloth (1 DoF) and identify the wind model parameters (5 DoFs controlling the amplitude, phase, and frequency of the sinusoidal function in three dimensions) from the motion data. We define the loss function as the L2-distance between the nodal positions of the T-shirt from the simulation and the given motion sequence.\n\nUnlike the \"Wind\" example in Sec. 5, contacts and frictions are much more frequent in this example due to self-collision between the front and back layer of the T-shirt under the wind. We show the simulation of the T-shirt with parameters before and after optimization in Fig. 7 and compare the three optimizers in Table 2 and Table 3: L-BFGS-B, CMA-ES, and (1+1)-ES. Both CMA-ES and (1+1)-ES are standard gradient-free evolutionary strategies (ES). We can conclude from Fig. 7 and Table 2 and 3 that all three methods manage to optimize system parameters leading to motion sequences visually identical to the given input, but L-BFGS-B converges much faster due to the extra knowledge of gradients.\n\nSphere. To highlight the effect of dry frictional contact in our simulator, we create the \"Sphere\" example with the goal of matching the motion sequence of a cloth interacting with a sphere by estimating the frictional coefficient between the sphere and the cloth. In this example, we let a piece of square cloth fall freely on a sphere, whose motion after being in contact with the sphere is largely controlled by the frictional coefficient. This example involves both self-collisions Table 2. Comparison between the performance of gradient-based and gradient-free optimization on all examples (except \"Hat Controller\") in Sec. 6. The \"Param #\" and \"Seed #\" columns report the number of optimization parameters and random seeds used in the experiments, respectively. All methods start the optimization with the same initial random seed set. The \"Min Init. Loss\" column reports the minimum initial loss across all random seeds. The \"Optimized Loss Percentage\" column reports the optimized loss as a percentage (0-100%) of the minimum initial loss reached across all random seeds for each method: \"Final\" reports the loss reached when the optimization stops, and \"Equal Step #\" reports the loss reached by CMA-ES and (1+1)-ES using the same number of time steps for L-BFGS-B convergence. We color the values of loss percentage using a green-orange color scale: green corresponds to 0% and orange corresponds to 100%.   Fig. 5. Bowl. We simulate the motion sequence of the napkin (50 × 50 × 2 triangles, ℎ = 5ms, 500 time steps) with the contact models from two differentiable cloth simulators: Liang et al. [2019] (top) and ours (middle). The area ratio (bottom) is the ratio between the napkin's area at the current timestep and in the rest shape. Refer to our video for the full motions.\n\n\nOptimized Loss\n\nbetween nodes on the cloth and external contacts with the sphere. Similar to the example above, we run both L-BFGS-B and two ES baselines and report their statistics in Table 2 and 3. All methods can optimize to a frictional coefficient that generates a motion sequence visually identical to the given input. However, this optimization problem is special in that it only has one parameter and the landscape of the loss function is bumpy due to the large variation in the collision set as a function of the frictional coefficient, as suggested by the Continuity of contact sets experiment in Sec. 5.1 . In this case, evolutionary strategies can achieve a lower final loss because the samples can freely explore the full range of frictional contact, while L-BFGS-B can get trapped in a local optimum. \n\n\nSlope\n\n\nRobot-Assisted Dressing\n\nAnother line of research that can benefit from a differentiable cloth simulator is robot-assisted dressing. The mainstream solution to these tasks is typically gradient-free methods like evolutionary strategies, reinforcement learning, or inverse dynamics before a differentiable cloth simulator becomes available. We present two examples to demonstrate the usage of gradients in robot-assisted dressing: \"Hat\" (Fig. 9) and \"Sock\" (Fig. 10).\n\nIn both examples, the goal is to find trajectories for a kinematic robotic manipulator to put on the hat or the sock. The end effectors of the manipulator pick a few prespecified vertices on the cloth meshes and pull them along the kinematic trajectories, which are parametrized as B-splines. By optimizing the parameters of the B-splines (18 DoFs in \"Hat\" and 36 DoFs in \"Sock\"), we can direct the manipulator to move the hat until it reaches the target location on top of the sphere. We define the loss function in \"Hat\" as the L2-distance between the hat's final  position at the last time step and a predefined target position, which we generate by translating the hat's rest shape onto the top of the sphere. The loss function for \"Sock\" is defined as the L2-distance between the desired and simulated locations of a few key points manually chosen on the sock and evaluated at the middle and the end of the simulation. With the gradient information at hand, we run the L-BFGS-B optimizer to tune the parameters of the trajectories and compare its performance with CMA-ES and (1+1)-ES (Table 2 and  that within the same time steps, L-BFGS-B converges substantially faster than the gradient-free baselines to a better solution ( Fig. 9 and Fig. 10). We can safely conclude that the fast convergence of L-BFGS-B unlocked by our differentiable cloth simulator is a clear advantage over gradient-free methods.\n\n\nInverse Design\n\nThe next application we present is \"Dress\", an inverse design example that aims to optimize cloth material parameters in a dress so that its dynamic motion can satisfy certain design intents. Specifically, we optimize the material parameters of a twirl dress so that after the dress spins, the apex angle of the cone-like dress agrees with the target value (100 degrees in our experiment). We define the loss function as the difference between the hemline height corresponding to the target apex angle and the estimated apex angle from points on the hemline of the dress at the last frame of the simulation. We report the optimization results from L-BFGS-B and two ES baselines in Table 2 and visualize the simulation results before and after optimization in Fig. 1. Similar to the previous tasks, we notice that L-BFGS-B achieves better optimized results using fewer time steps.\n\n\nA Real-to-Sim Example\n\nIn this section, we present a real-to-sim \"Flag\" example ( Fig. 11). In this example, we use the real-world motion sequence captured on a flag flapping in the wind from previous work [White et al. 2007] and aim to reconstruct a digital twin of the scene in simulation. This includes not only estimating the material parameters of the flag but also modeling the unknown wind condition at the capture time, which is particularly challenging due to its intricate stochastic model with unknown degrees of freedom. We model the wind force at each time step as a 3D force applied near the center of the scene and spatially decaying proportional to the inverse distance to the center. To model the transient nature of the wind force, we modulate magnitude of the 3D vector of a sinusoidal wave as a function of time with parameterized frequency and phase offset. Together, the material and wind model define an eight-dimensional parameter space to be optimized. We define the loss function as the L2-distance between the positions of all nodes at each time step in simulation and the ground-truth motion sequence. We solve this task using L-BFGS-B and the two ES methods and report their performance in Table 2, 3, and Fig. 11. All three methods substantially reduce the loss after optimization, but L-BFGS-B achieves a lower final loss. We plot the trajectories of 6 key nodes before and after optimization (orange) along with the ground-truth reference trajectories (yellow) from the motion-captured data in Fig. 11. By comparing the left and right images in Fig. 11, we can see that the L-BFGS-B optimizer reduces the discrepancy substantially between the simulated and actual trajectories after optimization. The real-to-sim matching is still imperfect as indicated by the nonzero final loss, which we suspect could be due to the simplistic nature of our synthetic wind model. A more sophisticated and expressive wind model, e.g., a neural network, may serve a better role in modeling and matching the real-world physics, which we leave as future work.\n\n\nBefore Optimization After Optimization\n\nGuess Trajectory Groundtruth Trajectory Loss Timesteps Fig. 11. Flag. A real-to-sim example that reconstructs a digital flapping flag (540 vertices, 1026 triangles, ℎ = 1/120s, 100 time steps) based on motion data captured from real-world experiments. Top: We plot the trajectories of 6 nodes on the cloth from the ground-truth motion (yellow curves) and the simulation results with guesses on the material and wind parameters before optimization (orange curves, left) and after optimization (orange curves, right). Bottom: The loss vs. time step curves for all methods.\n\n\nHat Controller\n\nWe end this section with an advanced \"Hat\" task. Unlike the previous open-loop trajectory optimization with a fixed starting position, the goal of this new task is to train a generalizable closed-loop controller that can put on the hat from a random starting position sampled from a fixed-radius hemisphere around the head. Specifically, we  Fig. 13. We present the computation graph of the \"Hat Controller\" task in Sec. 6.5. We embed the neural network policy into our differentiable simulation pipeline. At time step during forward simulation (blue arrows), the current particle states (x , v ) are transformed into a state vector s , which is input to the neural network policy to produce an action vector a = (s ). DiffCloth then simulates a new state (x +1 , v +1 ) using current particle state and the generated action vector. The whole simulation sequence { , } is used to compute a loss. During backward propagation (red arrows), the above computation pass is reversed.\n\ntrain a closed-loop control policy a = (s ), which takes as input the current state s of the task and outputs an action vector a at each time step . The state vector s includes the hat node positions, the orientation of the hat, and the distance between the two end effectors, and the action vector a represents the position of the two end effectors at the next time step. We represent the control policy as a neural network parametrized by consisting of two fully-connected hidden layers with 64 neurons and tanh activation functions (117126 parameters in total). To train the controller with gradient-based optimization, we integrate the neural network policy with our differentiable simulator as described in Fig. 13. In each epoch during training, we randomly sample 20 starting positions of the hat and compute a loss averaged from all simulation sequences. The loss function of each sequence is defined by = deform + target + dir , where deform measures the stretching of the hat using the distance change between the two end-effectors, target measures the L2-distance between the last-time-step pose of the hat and the target pose, and dir is the orientation difference between the last-time-step pose and the target pose of the hat. The gradient of the loss is then computed by our differentiable simulation framework and used by a gradient-based optimizer (Adam [Kingma and Ba 2017]) to update the policy parameters. For testing, we evaluate the controller from 20 fixed starting position configurations uniformly sampled on the hemisphere surface.\n\nTo compare our method with gradient-free methods, we also solve the task with Reinforcement Learning (RL), which has been widely used to train complex neural network policies for robot-assisted dressing problems [Clegg et al. 2018]. Specifically, we compare our gradient-based method with PPO [Schulman et al. 2017], a stateof-the-art RL algorithm. We similarly sample a starting position from the hemisphere in each iteration when training PPO. For a fair comparison, we design the reward function to be the sum of the negative counterpart of plus a constant to avoid negative rewards, and observation of the environment to be s . We evaluate Adam and PPO using as the common metric and plot the optimization curve at the bottom of Fig. 12. We see that both methods reach a similar final loss, but with our differentiable simulation framework, the gradient-based method reaches its final loss with a 85x speedup (Adam uses 23200 time steps; PPO uses 1978000 time steps).\n\nAfter the training process converges, both our gradient-based method and PPO successfully move the hat onto the head from all 20 testing positions. We visualize the trajectories generated by Adam's trained policy from 10 testing starting positions at the top of Fig. 12. Unlike existing differentiable simulation papers [Du et al. 2021;Hu et al. 2020Hu et al. , 2019Liang et al. 2019] that train a closed-loop network controller only for a fixed state, we highlight that we use differentiable simulation to train the network from multiple, random states and study its generalizability in a test set of unseen states. This allows us to conduct a fairer comparison between gradient-based optimization method and RL methods, which is typically overlooked in previous papers.\n\n\nCONCLUSIONS, LIMITATION, AND FUTURE WORK\n\nIn this paper, we presented a differentiable cloth simulator built on PD with Signorini-Coulomb frictional contact. Our differentiable simulator is different from existing papers in its simultaneous accommodation of rich and frequent (self-)contact, Signorini-Coulomb contact law, and differentiability in cloth simulation. We analyzed the numerical properties of gradients from our differentiable simulator, including the source of discontinuities and its empirical speedup over gradient-free approaches in high-dimensional problems. We additionally presented an iterative solver that exploits the contact gradients to speed up the backpropagation and observed a substantial speedup (up to an order of magnitude with low-precision simulation) over direct solvers. Our differentiable cloth simulator enabled gradient-based optimization methods in a diverse set of applications, for which traditional gradient-free methods are generally much less sampling efficient. In particular, we presented a preliminary study on training a generalizable closed-loop controller using differentiable simulation, in which our approach and PPO achieved comparable performance and generalizability, but we used much less time.\n\nThere are still quite a few limitations in our method that are worth further investigation. First, since our method is built on PD, it also limits the choice of material models. It would be useful to generalize the current framework and support more physically accurate cloth material models, e.g., the piecewise linear elastic model described in Wang et al. [2011].\n\nSecond, the contact model we use from Ly et al. [2020] does not take into account vertex-face or edge-edge self-collisions. While we empirically observed that handling only vertex-vertex self-collisions managed to produce plausible results with medium mesh resolution, vertex-face and edge-edge collision detection and handling is still highly desirable for a more physically realistic cloth simulator.\n\nThird, although we have identified some possible sources of discontinuities and non-smoothness in our differentiable simulator with empirical experiments, their effects on gradient-based optimization still require a thorough investigation. In particular, the locally bumpy energy landscape we observed in Fig. 3 due to changes in contact sets makes us question both the necessity and the usefulness of exact gradients in optimization, although Sec. 6 implies that gradients were still helpful in many downstream applications. Noting that the bumpiness in Fig. 3 is local and the global view of the energy landscape is still smooth, we hypothesize an inexact but smoothed gradients would be more powerful, which we leave as future work.\n\nFourth, there is no theoretical guarantee on the convergence of the iterative solver we implemented in backpropagation. Although non-convergence is uncommon in our experiments, it introduces a costly switch to the slower direct solver, which we hope to fully resolve in future work.\n\nFinally, many of our applications were in simulation only. It would be more exciting if these results could be replicated in real-world settings. We consider connecting our differentiable cloth simulator to more real-world applications, including real-world robot-assisted dressing, material parameter identification for real-world fabric samples, computational design for sports suits, and so on. Closing the sim-to-real gap is a nontrivial problem, in which we believe our differentiable simulator could play a beneficial role.\n\n\nA EXPERIMENT RUN TIME\n\nWe run all optimizations on a workstation of 80 CPU cores and 80G memory. Depending on the problem complexity, the wallclock time of running these optimizations varies from less than 30 minutes to 2 hours for all methods. We report the run time for optimizing the examples shown in Sec. 6 using our gradient-based method in Table 4. Table 4. Run time for our gradient-based optimization. We report the average wall-clock time for optimizing the examples shown in Sec. 6. We recall the simulation complexity of each example by reiterating its total Degrees of Freedom (\"Dof\"), number of time steps in each forward simulation sequence and back-propagation (\"Time Steps\") and time interval (\"ℎ [ ]\"). \"Fwd.[s]\"\" and \"Back.[s]\"\" report the mean wall-clock time for performing one iteration of forward simulation and back-propagation respectively, averaged across all optimization iterations for all initial seeds.\n\n\nName\n\nDof \n\n\nB EXPERIMENT DETAILS\n\nWe provide detailed information for the examples shown in Sec. 6, including their setup, the exact form of their loss function, and their decision variables in optimization.\n\n\nB.1 System Identification\n\nT-shirt. The loss function is defined as\n= ∑︁ =1 ∥x current − x target ∥ 2 ,(31)\nwhere = 240 is the total number of time steps, x current the position of the mesh during optimization, and x target the position of the ground-truth simulation generated using our system. There are 4 parameters (6 DoFs) to be optimized: T-shirt = ( stretch , , , d), where stretch controls the stretching stiffness of the cloth material and ( , , d) controls the parameterized external wind force: each node receives a three-dimensional wind force 0.5[sin( + ) + 1.0]d.\n\nSphere. The loss function is defined the same as in the \"T-shirt\" example above except that the total time = 300. The decision variable is the 1-DoF frictional coefficient of the sphere.\n\n\nB.2 Robot-Assisted Dressing\n\nHat. The loss function is defined as the L2 norm between the lasttime-step position of the hat x current and a target position x target generated by translating the initial pose of the hat onto the head:\n= ∥x current − x current ∥ 2 ,(32)\nwhere = 400 is the total number of time steps. The trajectory of each of the two end effectors is controlled by a cubic Hermite spline. Each spline has 3 parameters (9 DoFs): spline = (t 1 , t 2 , p end ), where t 1 and t 2 are the two tangents of the spline and p end is the endpoint of the spline.\n\nSock. The goal is to optimize for the trajectory of the three end effectors holding onto a sock so that the sock can be put onto a synthetic foot model from an initial starting position. To guide the end effectors to first hook the opening of the sock onto the tip of the foot, then slide the sock upward onto the leg, the loss function is designed as\n= ∑︁ ∈ { 2 , } ∑︁ ( foot , sock ) ∈ P ∥x target , foot − x current , sock ∥ 2 ,(33)\nwhere P defines a set of manually selected keypoint correspondence pairs ( foot , sock ) between the sock mesh x current and the foot model x target at halfway = 2 and the end of the simulation = , respectively. We sum up the L-2 norm of the position difference between each correspondence. The optimization parameters are the Hermite spline parameters for each of the four end effectors defined similarly as in the \"Hat\" example (36 DoFs in total).\n\n\nB.3 Inverse Design\n\nDress. The loss function is defined as\n= ∑︁ ∈ P (ℎ − ℎ) 2 ,(34)\nwhere ℎ is the calculated target height of the bottom of the dress when the desired apex angle is reached. P is the set of all points located at the bottom of the dress, and ℎ is the height of the point (corresponding to the y coordinate of the point in our implementation). There are 2 parameters (2 DoFs) that are being optimized: Dress = ( , bend ) where is the density of the fabric and bend is the bending stiffness of the fabric.\n\n\nB.4 Real-to-Sim Example\n\nIn this task, we optimize for the material parameters of the flag and the parameters of a simple wind model to match the motion trajectory of a flag to real-world captured data. The wind model is defined as\nf ext = sin( + ) + 1.0 2 kd ⊤ ,(35)\nwhere d is a 3D vector to be optimized and k ∈ R a constant coefficient vector with each entry equal to a node's inverse distance to the flag center evaluated at the first time step. There are 8 parameters to be optimized flag = ( stretch , bend , , , , d), where stretch and bend are the stretching and bending stiffness of the fabric, the density of the fabric, and , , d the parameters of the wind model defined above.\n\n\nB.5 Hat Controller\n\nIn this task, the goal is to optimize for the neural network parameters of the hat controller so that the two end effectors put a hat on a head model from any starting position defined on a fixed-radius hemisphere centered at the head model. During training, we uniformly sample 20 starting positions on the hemisphere for each epoch, and compute the loss averaged from all simulation sequences. We define the loss function as\n= deform + target + dir .(36)\ndeform minimizes the distance change between the two end effectors and is defined as deform = =1 ∥x , 1 − x , 2 ∥ 2 where 1 and 2 are the indices of the nodes pulled by the two end effectors. target minimizes the L2-distance between the poses of the hat and the target pose at the last few frames (20 in our implementation) and is defined as\ntarget = ∑︁ = −20 ∥x current − x target ∥ 2 .(37)\ndir minimizes the orientation difference between the last-time-step pose and the target pose of the hat and is defined as\ndir = d target · d current(38)\nwhere d target is the up vector of the hat at the target pose and d current is defined similarly to the hat at the last time step.\n\n\nC OPTIMIZATION RESULTS FOR ALL RANDOM SEEDS\n\nIn this section we report the optimization results for all random seeds in Table 5 and Table 6. For most experiments, L-BFGS-B achieves lower or comparable optimized loss than the gradientfree methods using a fraction (often to an order of magnitude) of time steps, thanks to the gradient information provided by our differentiable simulator. For some random seeds, L-BFGS-B converges to a relatively large final loss percentage, possibly due to being stuck in a local minimum. In practice, it is common and recommended to run gradient-based optimizations with several initial seeds to alleviate this problem, and is the rationale behind why we choose to report the minimum loss achieved across all random seeds in the results shown in Table 2 and plot the minimum loss envelop in Fig 4, 9, 10, 11. It is also worth mentioning that the examples shown Sec. 6 have a relative low number of design variables, while the speed-up of gradient-based methods becomes more evident with more design variables as demonstrated by the \"Flying Napkin\" experiment in Fig. 4. Table 5. We report the optimization results for all random seeds of all methods in the \"T-shirt\" and \"Flag\" examples. For each random seed, we report its initial loss and final loss achieved by each optimization method. \"Final Loss Percentage (%)\" reports the optimized loss as a percentage (0-100%) of the initial loss. \"Convergence Time Steps\" reports the number of time steps used by each method to reach its final loss. For all tasks, we also summarize the minimum, average and median statistics across all random seeds for each column. For each metric (\"Final Loss\", \"Final Loss Percentage (%)\", \"Convergence Time Steps\") and each row, the minimum number across the three optimization methods is marked in bold.   Table 6. Similar table as Table 5 for the \"Hat\", \"Sock\", \"Sphere\" and \"Dress\" examples. \n\n\nFinal Loss\n\n\nFinal Loss\n\n\nFig. 2. We simulate a piece of cloth sliding on a rigid sphere (right) to study the discontinuities and non-smoothness from contact conditions and surface geometry (Sec. 5.1). The two columns of plots show the velocities of three contact nodes at the 50-th and 200-th time steps. The \"discretized\" and \"continuous\" labels indicate whether these velocities are computed with a triangulated sphere (visualized as pink triangles on the spherical surface) or a smooth sphere (visualized as green sphere surface).\n\nFig. 3 .\n3We simulate collisions between a piece of cloth and a rigid sphere at four different horizontal locations to study the effects of varying numbers of collisions on the smoothness of the simulation. Top: rendering of one of the time steps when the cloth is expected to be in contact with the sphere. The four scenes are ordered by their number of collisions. Bottom: landscapes of the loss defined as a function of the frictional coefficient and the stiffness of the cloth (Sec. 5.1). The zoomed-in views of the landscapes show increasing discontinuity and non-smoothness as more collisions occur.\n\n\nStep # (%) Final (%) Equal Step # (%)\n\nFig. 6 .\n6Wind and Slope. Motion sequences from the two benchmark tests for comparing iterative and direct solvers in back-propagation. Top: the \"Wind\" test (ℎ = 1/90s, 200 time steps) where a piece of cloth moves under synthetic wind. Bottom: the \"Slope\" test (ℎ = 1/100s, 300 time steps) where a ribbon slides along a slanted plane.\n\nFig. 7 .\n7T-shirt (4278 DoFs, ℎ = 1/90s, 250 time steps). Estimating the cloth material and wind parameters based on a given synthetic motion sequence of the T-shirt. From left to right we show the simulated T-shirt at 0, 80, 160, and 240 time steps. Top: the ground-truth motion sequence; Middle: simulation with the initial guess on the cloth and wind parameters; Bottom: simulation after optimization with L-BFGS-B.\n\nFig. 8 .\n8Sphere (1875 DoFs, ℎ = 1/180s, 350 time steps). Estimating the frictional coefficient between the sphere and the cloth based on the cloth's contact with the sphere. From top to bottom we show the simulation at 0, 100, 200, and 300 time steps. Top: the ground-truth motion sequence; Middle: simulation with the initial guess on ; Bottom: simulation after optimization with L-BFGS-B.\n\nFig. 9 .Fig. 10 .\n910Hat (1737 DoFs, ℎ = 1/100s, 400 time steps). Optimizing trajectories for a manipulator to move a hat onto the sphere. Top left: Initial trajectory from one random seed before optimization overlaid with intermediate hat positions in simulation. Top right: the optimized trajectory from L-BFGS-B (which shares a visually similar trajectory with the ones optimized by ES algorithms). Bottom: The loss vs. time step curves for all methods. Sock (3165 DoFs, ℎ = 1/160s, 400 time steps). Optimizing trajectories for a manipulator to put a sock onto the foot model. Top left: One initial trajectory before optimization. We show the intermediate time steps on the left and the final state of the sock on the right. Top right: one control trajectory optimized by L-BFGS-B. The end effectors successfully put the sock onto the foot using the optimized trajectory. Bottom: the loss vs. time step curves for all methods.\n\n\nL-BFGS-B CMA-ES (1+1)-ES L-BFGS-B CMA-ES (1+1)-ES L-BFGS-B CMA-ES (1+1)-ES\n\nTable 3 .\n3The \"Convergence Time Steps\" column reports the number of \nsimulation time steps used for each optimization method until convergence \non all examples shown in Sec. 6. For a fair comparison, the time steps shown \nfor L-BFGS-B include both forward simulation and backward propagation \ntime. The \"Iter. Conv. %\" column reports the percentage of time steps in \nbackward propagation where the iterative solver converges. \n\nName \nConvergence Time Steps \nIter. Conv. % \nL-BFGS-B CMA-ES (1+1)-ES \n\nT-shirt \n4500 \n53500 \n47750 \n99.75 \nSphere \n2450 \n18900 \n11200 \n100.00 \nHat \n11200 \n159200 \n106000 \n90.58 \nSock \n17600 \n176800 \n91600 \n99.41 \nDress \n2750 \n3125 \n10000 \n84.80 \nFlag \n6800 \n17300 \n24800 \n96.00 \n\n\n\n\nTime Steps ℎ [s] Fwd.[s] Back.[s]T-shirt 4278 \n250 \n1/90 \n141.5 \n13.2 \nSphere 1875 \n350 \n1/180 \n5.1 \n4.2 \nHat \n1737 \n400 \n1/100 \n57.9 \n20.7 \nSock \n3165 \n400 \n1/160 \n89.9 \n14.3 \nDress 10902 \n125 \n1/120 \n266.3 \n84.7 \nFlag \n1620 \n100 \n1/120 \n13.7 \n1.6 \n\n\nACM Trans. Graph., Vol. 1, No. 1, Article 1. Publication date: January 2022.DiffCloth: Differentiable Cloth Simulation with Dry Frictional Contact • 1:13\nACKNOWLEDGMENTSWe thank Marco Renedo for his helpful discussions on the preconditioners, Junbang Liang for his help with running the baseline comparison code, and the anonymous reviewers for their helpful comments. This work was supported in part by the Defense Advanced Research Projects Agency (DARPA) under grant No. FA8750-20-C-0075.\nLarge Steps in Cloth Simulation. David Baraff, Andrew Witkin, Proceedings of the 25th Annual Conference on Computer Graphics and Interactive Techniques (SIGGRAPH '98). the 25th Annual Conference on Computer Graphics and Interactive Techniques (SIGGRAPH '98)New York, NY, USAAssociation for Computing MachineryDavid Baraff and Andrew Witkin. 1998. Large Steps in Cloth Simulation. In Proceedings of the 25th Annual Conference on Computer Graphics and Interactive Techniques (SIGGRAPH '98). Association for Computing Machinery, New York, NY, USA, 43-54.\n\nPhysics-Driven Pattern Adjustment for Direct 3D Garment Editing. Aric Bartle, Alla Sheffer, Vladimir G Kim, Danny M Kaufman, Nicholas Vining, Floraine Berthouzoz, ACM Trans. Graph. 35Article. 11 pagesAric Bartle, Alla Sheffer, Vladimir G. Kim, Danny M. Kaufman, Nicholas Vining, and Flo- raine Berthouzoz. 2016. Physics-Driven Pattern Adjustment for Direct 3D Garment Editing. ACM Trans. Graph. 35, 4, Article 50 (July 2016), 11 pages.\n\nProjective Dynamics: Fusing Constraint Projections for Fast Simulation. Sofien Bouaziz, Sebastian Martin, Tiantian Liu, Ladislav Kavan, Mark Pauly, 10.1145/2601097.2601116ACM Trans. Graph. 33ArticleSofien Bouaziz, Sebastian Martin, Tiantian Liu, Ladislav Kavan, and Mark Pauly. 2014. Projective Dynamics: Fusing Constraint Projections for Fast Simulation. ACM Trans. Graph. 33, 4, Article 154 (July 2014), 11 pages. https://doi.org/10.1145/2601097. 2601116\n\nRobust Treatment of Collisions, Contact and Friction for Cloth Animation. Robert Bridson, Ronald Fedkiw, John Anderson, ACM Trans. Graph. 213Robert Bridson, Ronald Fedkiw, and John Anderson. 2002. Robust Treatment of Col- lisions, Contact and Friction for Cloth Animation. ACM Trans. Graph. 21, 3 (July 2002), 594-603.\n\nSimulation of Clothing with Folds and Wrinkles. R Bridson, S Marino, R Fedkiw, Proceedings of the 2003 ACM SIGGRAPH/Eurographics Symposium on Computer Animation. the 2003 ACM SIGGRAPH/Eurographics Symposium on Computer AnimationSan Diego, California; Goslar, DEUSCA '03)R. Bridson, S. Marino, and R. Fedkiw. 2003. Simulation of Clothing with Folds and Wrinkles. In Proceedings of the 2003 ACM SIGGRAPH/Eurographics Symposium on Computer Animation (San Diego, California) (SCA '03). Eurographics Association, Goslar, DEU, 28-36.\n\nNonsmooth Lagrangian Systems. Bernard Brogliato, Springer International PublishingChamBernard Brogliato. 2016. Nonsmooth Lagrangian Systems. Springer International Publishing, Cham, 241-370.\n\nDesign Preserving Garment Transfer. Remi Brouet, Alla Sheffer, Laurence Boissieux, Marie-Paule Cani, ACM Trans. Graph. 31ArticleRemi Brouet, Alla Sheffer, Laurence Boissieux, and Marie-Paule Cani. 2012. Design Preserving Garment Transfer. ACM Trans. Graph. 31, 4, Article 36 (July 2012), 11 pages.\n\nAccurate Dissipative Forces in Optimization Integrators. George E Brown, Matthew Overby, ACM Trans. Graph. 37282Zahra Forootaninia, and Rahul NarainGeorge E. Brown, Matthew Overby, Zahra Forootaninia, and Rahul Narain. 2018. Accu- rate Dissipative Forces in Optimization Integrators. ACM Trans. Graph. 37, 6, Article 282 (Dec. 2018), 14 pages.\n\nStable but Responsive Cloth. Jin Kwang, Hyeong-Seok Choi, Ko, ACM Trans. Graph. 213Kwang-Jin Choi and Hyeong-Seok Ko. 2002. Stable but Responsive Cloth. ACM Trans. Graph. 21, 3 (July 2002), 604-611.\n\nLearning to Collaborate From Simulation for Robot-Assisted Dressing. Alexander Clegg, Zackory Erickson, Patrick Grady, Greg Turk, Charles C Kemp, C Karen Liu, IEEE Robotics and Automation Letters. 5Alexander Clegg, Zackory Erickson, Patrick Grady, Greg Turk, Charles C. Kemp, and C. Karen Liu. 2020. Learning to Collaborate From Simulation for Robot-Assisted Dressing. IEEE Robotics and Automation Letters 5, 2 (2020), 2746-2753.\n\nLearning to Dress: Synthesizing Human Dressing Motion via Deep Reinforcement Learning. Alexander Clegg, Wenhao Yu, Jie Tan, C Karen Liu, Greg Turk, ACM Trans. Graph. 37179Alexander Clegg, Wenhao Yu, Jie Tan, C. Karen Liu, and Greg Turk. 2018. Learning to Dress: Synthesizing Human Dressing Motion via Deep Reinforcement Learning. ACM Trans. Graph. 37, 6, Article 179 (Dec. 2018), 10 pages.\n\nModeling and Data-Driven Parameter Estimation for Woven Fabrics. David Clyde, Joseph Teran, Rasmus Tamstorf, Proceedings of the ACM SIGGRAPH / Eurographics Symposium on Computer Animation. the ACM SIGGRAPH / Eurographics Symposium on Computer AnimationLos Angeles, California; New York, NY, USAAssociation for Computing Machinery17SCA '17)David Clyde, Joseph Teran, and Rasmus Tamstorf. 2017. Modeling and Data-Driven Parameter Estimation for Woven Fabrics. In Proceedings of the ACM SIGGRAPH / Eurographics Symposium on Computer Animation (Los Angeles, California) (SCA '17). Association for Computing Machinery, New York, NY, USA, Article 17, 11 pages.\n\nPerception-less terrain adaptation through whole body control and hierarchical optimization. C , Dario Bellicoso, Christian Gehring, Jemin Hwangbo, Péter Fankhauser, Marco Hutter, 10.1109/HUMANOIDS.2016.78033302016 IEEE-RAS 16th International Conference on Humanoid Robots (Humanoids). C. Dario Bellicoso, Christian Gehring, Jemin Hwangbo, Péter Fankhauser, and Marco Hutter. 2016. Perception-less terrain adaptation through whole body control and hi- erarchical optimization. In 2016 IEEE-RAS 16th International Conference on Humanoid Robots (Humanoids). 558-564. https://doi.org/10.1109/HUMANOIDS.2016.7803330\n\nDiffCloth: Differentiable Cloth Simulation with Dry Frictional Contact. 117Publication dateACM Trans. Graph., Vol. 1, No. 1, Article 1. Publication date: January 2022. DiffCloth: Differentiable Cloth Simulation with Dry Frictional Contact • 1:17\n\nEnd-to-end differentiable physics for learning and control. Filipe De Avila Belbute-Peres, Kevin Smith, Kelsey Allen, Josh Tenenbaum, J Zico Kolter, Advances in neural information processing systems. 31Filipe de Avila Belbute-Peres, Kevin Smith, Kelsey Allen, Josh Tenenbaum, and J Zico Kolter. 2018a. End-to-end differentiable physics for learning and control. Advances in neural information processing systems 31 (2018), 7178-7189.\n\nEnd-to-End Differentiable Physics for Learning and Control. Filipe De Avila Belbute-Peres, Kevin Smith, Kelsey Allen, Josh Tenenbaum, Zico Kolter, Advances in Neural Information Processing Systems. Filipe de Avila Belbute-Peres, Kevin Smith, Kelsey Allen, Josh Tenenbaum, and Zico Kolter. 2018b. End-to-End Differentiable Physics for Learning and Control. In Advances in Neural Information Processing Systems. 7178-7189.\n\nA Differentiable Physics Engine for Deep Learning in Robotics. Jonas Degrave, Michiel Hermans, Joni Dambre, Francis Wyffels, Frontiers in Neurorobotics. 136Jonas Degrave, Michiel Hermans, Joni Dambre, and Francis wyffels. 2019. A Differen- tiable Physics Engine for Deep Learning in Robotics. Frontiers in Neurorobotics 13 (2019), 6.\n\nTao Du, Kui Wu, Pingchuan Ma, Sebastien Wah, Andrew Spielberg, 10.1145/3490168Daniela Rus, and Wojciech Matusik. 2021. DiffPD: Differentiable Projective Dynamics. 4113Tao Du, Kui Wu, Pingchuan Ma, Sebastien Wah, Andrew Spielberg, Daniela Rus, and Wojciech Matusik. 2021. DiffPD: Differentiable Projective Dynamics. ACM Trans. Graph. 41, 2, Article 13 (Oct. 2021), 21 pages. https://doi.org/10.1145/3490168\n\nFunctional Optimization of Fluidic Devices with Differentiable Stokes Flow. Tao Du, Kui Wu, Andrew Spielberg, Wojciech Matusik, Bo Zhu, Eftychios Sifakis, 10.1145/3414685.3417795ACM Trans. Graph. 39197Tao Du, Kui Wu, Andrew Spielberg, Wojciech Matusik, Bo Zhu, and Eftychios Sifakis. 2020. Functional Optimization of Fluidic Devices with Differentiable Stokes Flow. ACM Trans. Graph. 39, 6, Article 197 (Dec. 2020), 15 pages. https://doi.org/10.1145/ 3414685.3417795\n\nVivace: A Practical Gauss-Seidel Method for Stable Soft Body Dynamics. Marco Fratarcangeli, Valentina Tibaldo, Fabio Pellacini, ACM Trans. Graph. 35214Marco Fratarcangeli, Valentina Tibaldo, and Fabio Pellacini. 2016. Vivace: A Practical Gauss-Seidel Method for Stable Soft Body Dynamics. ACM Trans. Graph. 35, 6, Article 214 (Nov. 2016), 9 pages.\n\nADD: analytically differentiable dynamics for multi-body systems with frictional contact. Moritz Geilinger, David Hahn, Jonas Zehnder, Moritz Bächer, Bernhard Thomaszewski, Stelian Coros, ACM Transactions on Graphics (TOG). 39Moritz Geilinger, David Hahn, Jonas Zehnder, Moritz Bächer, Bernhard Thomaszewski, and Stelian Coros. 2020. ADD: analytically differentiable dynamics for multi-body systems with frictional contact. ACM Transactions on Graphics (TOG) 39, 6 (2020), 1-15.\n\nDRAPE: DRessing Any PErson. Loretta Peng Guan, David A Reiss, Alexander Hirshberg, Michael J Weiss, Black, ACM Trans. Graph. 31ArticlePeng Guan, Loretta Reiss, David A. Hirshberg, Alexander Weiss, and Michael J. Black. 2012. DRAPE: DRessing Any PErson. ACM Trans. Graph. 31, 4, Article 35 (July 2012), 10 pages.\n\nGaël Guennebaud, Benoît Jacob, Eigen v3. Gaël Guennebaud, Benoît Jacob, et al. 2010. Eigen v3. http://eigen.tuxfamily.org.\n\nReal2sim: Visco-elastic parameter estimation from dynamic motion. David Hahn, Pol Banzet, M James, Stelian Bern, Coros, ACM Transactions on Graphics (TOG). 38David Hahn, Pol Banzet, James M Bern, and Stelian Coros. 2019. Real2sim: Visco-elastic parameter estimation from dynamic motion. ACM Transactions on Graphics (TOG) 38, 6 (2019), 1-13.\n\nThe CMA Evolution Strategy: A Comparing Review. Nikolaus Hansen, Nikolaus Hansen. 2006. The CMA Evolution Strategy: A Comparing Review.\n\nRobust Treatment of Simultaneous Collisions. David Harmon, Etienne Vouga, Rasmus Tamstorf, Eitan Grinspun, ACM SIGGRAPH 2008 Papers. Los Angeles, California; New York, NY, USAAssociation for Computing MachinerySIGGRAPH '08). Article 23, 4 pagesDavid Harmon, Etienne Vouga, Rasmus Tamstorf, and Eitan Grinspun. 2008. Robust Treatment of Simultaneous Collisions. In ACM SIGGRAPH 2008 Papers (Los Angeles, California) (SIGGRAPH '08). Association for Computing Machinery, New York, NY, USA, Article 23, 4 pages.\n\nLearning to Control PDEs with Differentiable Physics. Philipp Holl, Nils Thuerey, Vladlen Koltun, International Conference on Learning Representations. Philipp Holl, Nils Thuerey, and Vladlen Koltun. 2020. Learning to Control PDEs with Differentiable Physics. In International Conference on Learning Representations.\n\nYuanming Hu, Luke Anderson, Tzu-Mao Li, Qi Sun, Nathan Carr, Jonathan Ragan-Kelley, Frédo Durand, 2020. DiffTaichi: Differentiable Programming for Physical Simulation. International Conference on Learning Representations. Yuanming Hu, Luke Anderson, Tzu-Mao Li, Qi Sun, Nathan Carr, Jonathan Ragan- Kelley, and Frédo Durand. 2020. DiffTaichi: Differentiable Programming for Physical Simulation. International Conference on Learning Representations (2020).\n\nChainqueen: A real-time differentiable physical simulator for soft robotics. Yuanming Hu, Jiancheng Liu, Andrew Spielberg, Joshua B Tenenbaum, T William, Jiajun Freeman, Daniela Wu, Wojciech Rus, Matusik, 2019 International conference on robotics and automation (ICRA). IEEEYuanming Hu, Jiancheng Liu, Andrew Spielberg, Joshua B Tenenbaum, William T Freeman, Jiajun Wu, Daniela Rus, and Wojciech Matusik. 2019. Chainqueen: A real-time differentiable physical simulator for soft robotics. In 2019 International conference on robotics and automation (ICRA). IEEE, 6265-6271.\n\nAnimal Gaits on Quadrupedal Robots Using Motion Matching and Model-Based Control. Dongho Kang, Simon Zimmermann, Stelian Coros, 2021Dongho Kang, Simon Zimmermann, and Stelian Coros. 2021. Animal Gaits on Quadrupedal Robots Using Motion Matching and Model-Based Control. In 2021\n\nIEEE/RSJ International Conference on Intelligent Robots and Systems (IROS). IEEEIEEE/RSJ International Conference on Intelligent Robots and Systems (IROS). IEEE.\n\nAdam: A Method for Stochastic Optimization. P Diederik, Jimmy Kingma, Ba, arXiv:1412.6980cs.LGDiederik P. Kingma and Jimmy Ba. 2017. Adam: A Method for Stochastic Optimization. arXiv:1412.6980 [cs.LG]\n\n. Martin Komaritzan, Mario Botsch, 10.1145/3203203Projective Skinning. Proc. ACM Comput. Graph. Interact. Tech. 1, 1, Article. 12Martin Komaritzan and Mario Botsch. 2018. Projective Skinning. Proc. ACM Comput. Graph. Interact. Tech. 1, 1, Article 12 (July 2018), 19 pages. https://doi.org/10.1145/ 3203203\n\nP-Cloth: Interactive Complex Cloth Simulation on Multi-GPU Systems Using Dynamic Matrix Assembly and Pipelined Implicit Integrators. Cheng Li, Min Tang, Ruofeng Tong, Ming Cai, Jieyi Zhao, Dinesh Manocha, ACM Trans. Graph. 3915Cheng Li, Min Tang, Ruofeng Tong, Ming Cai, Jieyi Zhao, and Dinesh Manocha. 2020b. P- Cloth: Interactive Complex Cloth Simulation on Multi-GPU Systems Using Dynamic Matrix Assembly and Pipelined Implicit Integrators. ACM Trans. Graph. 39, 6, Article 180 (Nov. 2020), 15 pages.\n\nAn Implicit Frictional Contact Solver for Adaptive Cloth Simulation. Jie Li, Gilles Daviet, Rahul Narain, Florence Bertails-Descoubes, Matthew Overby, George E Brown, Laurence Boissieux, ACM Trans. Graph. 37Article. 15 pagesJie Li, Gilles Daviet, Rahul Narain, Florence Bertails-Descoubes, Matthew Overby, George E. Brown, and Laurence Boissieux. 2018b. An Implicit Frictional Contact Solver for Adaptive Cloth Simulation. ACM Trans. Graph. 37, 4, Article 52 (July 2018), 15 pages.\n\nIncremental Potential Contact: Intersection-and Inversion-Free, Large-Deformation Dynamics. Minchen Li, Zachary Ferguson, Teseo Schneider, Timothy Langlois, Denis Zorin, Daniele Panozzo, Chenfanfu Jiang, Danny M Kaufman, ACM Trans. Graph. 394Article. 20 pagesMinchen Li, Zachary Ferguson, Teseo Schneider, Timothy Langlois, Denis Zorin, Daniele Panozzo, Chenfanfu Jiang, and Danny M. Kaufman. 2020a. Incremental Potential Contact: Intersection-and Inversion-Free, Large-Deformation Dynamics. ACM Trans. Graph. 39, 4, Article 49 (July 2020), 20 pages.\n\n. Minchen Li, Danny M Kaufman, Chenfanfu Jiang, Codimensional Incremental Potential Contact. ACM Trans. Graph. (SIGGRAPH). 40ArticleMinchen Li, Danny M. Kaufman, and Chenfanfu Jiang. 2021. Codimensional Incremental Potential Contact. ACM Trans. Graph. (SIGGRAPH) 40, 4, Article 170 (2021).\n\nFoldsketch: Enriching Garments with Physically Reproducible Folds. Minchen Li, Alla Sheffer, Eitan Grinspun, Nicholas Vining, ACM Trans. Graph. 37ArticleMinchen Li, Alla Sheffer, Eitan Grinspun, and Nicholas Vining. 2018c. Foldsketch: Enriching Garments with Physically Reproducible Folds. ACM Trans. Graph. 37, 4, Article 133 (July 2018), 13 pages.\n\nDifferentiable Monte Carlo Ray Tracing through Edge Sampling. Tzu-Mao Li, Miika Aittala, Frédo Durand, Jaakko Lehtinen, ACM Trans. Graph. (Proc. SIG-GRAPH Asia). 3711Tzu-Mao Li, Miika Aittala, Frédo Durand, and Jaakko Lehtinen. 2018a. Differentiable Monte Carlo Ray Tracing through Edge Sampling. ACM Trans. Graph. (Proc. SIG- GRAPH Asia) 37, 6 (2018), 222:1-222:11.\n\nLearning Particle Dynamics for Manipulating Rigid Bodies, Deformable Objects, and Fluids. Yunzhu Li, Jiajun Wu, Russ Tedrake, Joshua Tenenbaum, Antonio Torralba, International Conference on Learning Representations. Yunzhu Li, Jiajun Wu, Russ Tedrake, Joshua Tenenbaum, and Antonio Torralba. 2019. Learning Particle Dynamics for Manipulating Rigid Bodies, Deformable Objects, and Fluids. In International Conference on Learning Representations.\n\nDifferentiable Cloth Simulation for Inverse Problems. Junbang Liang, Ming Lin, Vladlen Koltun, Advances in Neural Information Processing Systems. H. Wallach, H. Larochelle, A. Beygelzimer, F. d'Alché-Buc, E. Fox, and R. GarnettCurran Associates, Inc32Junbang Liang, Ming Lin, and Vladlen Koltun. 2019. Differentiable Cloth Simulation for Inverse Problems. In Advances in Neural Information Processing Systems, H. Wal- lach, H. Larochelle, A. Beygelzimer, F. d'Alché-Buc, E. Fox, and R. Garnett (Eds.), Vol. 32. Curran Associates, Inc. https://proceedings.neurips.cc/paper/2019/file/ 28f0b864598a1291557bed248a998d4e-Paper.pdf\n\nOn the Limited Memory BFGS Method for Large Scale Optimization. C Dong, Jorge Liu, Nocedal, MATHEMATICAL PROGRAMMING. 45Dong C. Liu and Jorge Nocedal. 1989. On the Limited Memory BFGS Method for Large Scale Optimization. MATHEMATICAL PROGRAMMING 45 (1989), 503-528.\n\nFast Simulation of Mass-Spring Systems. Tiantian Liu, Adam W Bargteil, James F O&apos;brien, Ladislav Kavan, ACM Trans. Graph. 32214Tiantian Liu, Adam W. Bargteil, James F. O'Brien, and Ladislav Kavan. 2013. Fast Simulation of Mass-Spring Systems. ACM Trans. Graph. 32, 6, Article 214 (Nov. 2013), 7 pages.\n\nQuasi-newton methods for real-time simulation of hyperelastic materials. Tiantian Liu, Sofien Bouaziz, Ladislav Kavan, Acm Transactions on Graphics (TOG). 36Tiantian Liu, Sofien Bouaziz, and Ladislav Kavan. 2017. Quasi-newton methods for real-time simulation of hyperelastic materials. Acm Transactions on Graphics (TOG) 36, 3 (2017), 1-16.\n\nInverse Elastic Shell Design with Contact and Friction. Mickaël Ly, Romain Casati, Florence Bertails-Descoubes, Mélina Skouras, Laurence Boissieux, ACM Trans. Graph. 3716Mickaël Ly, Romain Casati, Florence Bertails-Descoubes, Mélina Skouras, and Laurence Boissieux. 2018. Inverse Elastic Shell Design with Contact and Friction. ACM Trans. Graph. 37, 6, Article 201 (Dec. 2018), 16 pages.\n\nProjective Dynamics with Dry Frictional Contact. Mickaël Ly, Jean Jouve, Laurence Boissieux, Florence Bertails-Descoubes, ACM Trans. Graph. 39, 4, Article. 57pagesMickaël Ly, Jean Jouve, Laurence Boissieux, and Florence Bertails-Descoubes. 2020. Projective Dynamics with Dry Frictional Contact. ACM Trans. Graph. 39, 4, Article 57 (July 2020), 8 pages.\n\nPrimal/Dual Descent Methods for Dynamics. M Macklin, K Erleben, M Müller, N Chentanez, S Jeschke, T Y Kim, Proceedings of the ACM SIG-GRAPH/Eurographics Symposium on Computer Animation (Virtual Event, Canada) (SCA '20). the ACM SIG-GRAPH/Eurographics Symposium on Computer Animation (Virtual Event, Canada) (SCA '20)Goslar, DEU, Article 912 pagesM. Macklin, K. Erleben, M. Müller, N. Chentanez, S. Jeschke, and T. Y. Kim. 2020. Primal/Dual Descent Methods for Dynamics. In Proceedings of the ACM SIG- GRAPH/Eurographics Symposium on Computer Animation (Virtual Event, Canada) (SCA '20). Eurographics Association, Goslar, DEU, Article 9, 12 pages.\n\nXPBD: Position-Based Simulation of Compliant Constrained Dynamics. Miles Macklin, Matthias Müller, Nuttapong Chentanez, Proceedings of the 9th International Conference on Motion in Games. the 9th International Conference on Motion in GamesBurlingame, California; New York, NY, USAAssociation for Computing MachineryMIG '16)Miles Macklin, Matthias Müller, and Nuttapong Chentanez. 2016. XPBD: Position- Based Simulation of Compliant Constrained Dynamics. In Proceedings of the 9th International Conference on Motion in Games (Burlingame, California) (MIG '16). Association for Computing Machinery, New York, NY, USA, 49-54.\n\nExample-Based Elastic Materials. Sebastian Martin, Bernhard Thomaszewski, Eitan Grinspun, Markus Gross, 10.1145/2010324.1964967ACM Trans. Graph. 3072Sebastian Martin, Bernhard Thomaszewski, Eitan Grinspun, and Markus Gross. 2011. Example-Based Elastic Materials. ACM Trans. Graph. 30, 4, Article 72 (July 2011), 8 pages. https://doi.org/10.1145/2010324.1964967\n\nFluid Control Using the Adjoint Method. Antoine Mcnamara, Adrien Treuille, Zoran Popović, Jos Stam, ACM Trans. Graph. 23Antoine McNamara, Adrien Treuille, Zoran Popović, and Jos Stam. 2004. Fluid Control Using the Adjoint Method. ACM Trans. Graph. 23, 3 (Aug. 2004), 449-456.\n\nData-Driven Estimation of Cloth Simulation Models. E Miguel, D Bradley, B Thomaszewski, B Bickel, W Matusik, M A Otaduy, S Marschner, Comput. Graph. Forum. 31E. Miguel, D. Bradley, B. Thomaszewski, B. Bickel, W. Matusik, M. A. Otaduy, and S. Marschner. 2012. Data-Driven Estimation of Cloth Simulation Models. Comput. Graph. Forum 31, 2pt2 (May 2012), 519-528.\n\nModeling and Estimation of Internal Friction in Cloth. Eder Miguel, Rasmus Tamstorf, Derek Bradley, Sara C Schvartzman, Bernhard Thomaszewski, Bernd Bickel, Wojciech Matusik, Steve Marschner, Miguel A Otaduy, ACM Trans. Graph. 32212Eder Miguel, Rasmus Tamstorf, Derek Bradley, Sara C. Schvartzman, Bernhard Thomaszewski, Bernd Bickel, Wojciech Matusik, Steve Marschner, and Miguel A. Otaduy. 2013. Modeling and Estimation of Internal Friction in Cloth. ACM Trans. Graph. 32, 6, Article 212 (Nov. 2013), 10 pages.\n\nInverse dynamics control of floating base systems using orthogonal decomposition. Michael Mistry, Jonas Buchli, Stefan Schaal, 10.1109/ROBOT.2010.55096462010 IEEE International Conference on Robotics and Automation. Michael Mistry, Jonas Buchli, and Stefan Schaal. 2010. Inverse dynamics control of floating base systems using orthogonal decomposition. In 2010 IEEE International Conference on Robotics and Automation. 3406-3412. https://doi.org/10.1109/ROBOT. 2010.5509646\n\nComputational Design of Skintight Clothing. Juan Montes, Bernhard Thomaszewski, Sudhir Mudur, Tiberiu Popa, ACM Trans. Graph. 39, 4, Article. 105Juan Montes, Bernhard Thomaszewski, Sudhir Mudur, and Tiberiu Popa. 2020. Compu- tational Design of Skintight Clothing. ACM Trans. Graph. 39, 4, Article 105 (July 2020), 12 pages.\n\nLine Search Algorithms with Guaranteed Sufficient Decrease. Jorge J Moré, David J Thuente, 10.1145/192115.192132ACM Trans. Math. Softw. 20Jorge J. Moré and David J. Thuente. 1994. Line Search Algorithms with Guaranteed Sufficient Decrease. ACM Trans. Math. Softw. 20, 3 (Sept. 1994), 286-307. https: //doi.org/10.1145/192115.192132\n\nPosition Based Dynamics. Matthias Müller, Bruno Heidelberger, Marcus Hennix, John Ratcliff, J. Vis. Comun. Image Represent. 18Matthias Müller, Bruno Heidelberger, Marcus Hennix, and John Ratcliff. 2007. Position Based Dynamics. J. Vis. Comun. Image Represent. 18, 2 (April 2007), 109-118.\n\nDerek Nowrouzezahrai, and Sanja Fidler. 2021. gradSim: Differentiable simulation for system identification and visuomotor control. J , Krishna Murthy, Miles Macklin, Florian Golemo, Vikram Voleti, Linda Petrini, Martin Weiss, Breandan Considine, Jérôme Parent-Lévesque, Kevin Xie, Kenny Erleben, Liam Paull, Florian Shkurti, International Conference on Learning Representations. J. Krishna Murthy, Miles Macklin, Florian Golemo, Vikram Voleti, Linda Petrini, Martin Weiss, Breandan Considine, Jérôme Parent-Lévesque, Kevin Xie, Kenny Erleben, Liam Paull, Florian Shkurti, Derek Nowrouzezahrai, and Sanja Fidler. 2021. gradSim: Differentiable simulation for system identification and visuo- motor control. In International Conference on Learning Representations. https: //openreview.net/forum?id=c_E8kFWfhp0\n\nAdaptive Anisotropic Remeshing for Cloth Simulation. Rahul Narain, Armin Samii, James F O&apos;brien, ACM Trans. Graph. 31152Rahul Narain, Armin Samii, and James F. O'Brien. 2012. Adaptive Anisotropic Remesh- ing for Cloth Simulation. ACM Trans. Graph. 31, 6, Article 152 (Nov. 2012), 10 pages.\n\nImplicit Contact Handling for Deformable Objects. Miguel A Otaduy, Rasmus Tamstorf, Denis Steinemann, Markus Gross, Computer Graphics Forum. 28Miguel A. Otaduy, Rasmus Tamstorf, Denis Steinemann, and Markus Gross. 2009. Implicit Contact Handling for Deformable Objects. Computer Graphics Forum 28, 2 (2009), 559-568.\n\nADMM ⊇ Projective Dynamics: Fast Simulation of Hyperelastic Models with Dynamic Constraints. Matthew Overby, George E Brown, Jie Li, Rahul Narain, IEEE Transactions on Visualization and Computer Graphics. 23Matthew Overby, George E. Brown, Jie Li, and Rahul Narain. 2017. ADMM ⊇ Projective Dynamics: Fast Simulation of Hyperelastic Models with Dynamic Constraints. IEEE Transactions on Visualization and Computer Graphics 23, 10 (Oct 2017), 2222-2234.\n\nMotion Sketching for Control of Rigid-Body Simulations. Jovan Popović, Steven Seitz, Michael Erdmann, ACM Trans. Graph. 22Jovan Popović, Steven Seitz, and Michael Erdmann. 2003. Motion Sketching for Control of Rigid-Body Simulations. ACM Trans. Graph. 22, 4 (Oct. 2003), 1034-1054.\n\nInteractive Manipulation of Rigid Body Simulations. Jovan Popović, Steven M Seitz, Michael Erdmann, Zoran Popović, Andrew Witkin, 10.1145/344779.344880Proceedings of the 27th Annual Conference on Computer Graphics and Interactive Techniques (SIGGRAPH '00). the 27th Annual Conference on Computer Graphics and Interactive Techniques (SIGGRAPH '00)USAACM Press/Addison-Wesley Publishing CoJovan Popović, Steven M. Seitz, Michael Erdmann, Zoran Popović, and Andrew Witkin. 2000. Interactive Manipulation of Rigid Body Simulations. In Proceedings of the 27th Annual Conference on Computer Graphics and Interactive Techniques (SIGGRAPH '00). ACM Press/Addison-Wesley Publishing Co., USA, 209-217. https://doi.org/10. 1145/344779.344880\n\nCollision and self-collision handling in cloth model dedicated to design garments. Xavier Provot, Computer Animation and Simulation '97. Daniel Thalmann and Michiel van de PanneVienna, ViennaSpringerXavier Provot. 1997. Collision and self-collision handling in cloth model dedicated to design garments. In Computer Animation and Simulation '97, Daniel Thalmann and Michiel van de Panne (Eds.). Springer Vienna, Vienna, 177-189.\n\nScalable Differentiable Physics for Learning and Control. Yi-Ling Qiao, Junbang Liang, Vladlen Koltun, Ming Lin, International Conference on Machine Learning. Yi-Ling Qiao, Junbang Liang, Vladlen Koltun, and Ming Lin. 2020. Scalable Differentiable Physics for Learning and Control. In International Conference on Machine Learning.\n\nLearning to Simulate Complex Physics with Graph Networks. Alvaro Sanchez-Gonzalez, Jonathan Godwin, Tobias Pfaff, Rex Ying, Jure Leskovec, Peter Battaglia, International Conference on Machine Learning. Alvaro Sanchez-Gonzalez, Jonathan Godwin, Tobias Pfaff, Rex Ying, Jure Leskovec, and Peter Battaglia. 2020. Learning to Simulate Complex Physics with Graph Networks. In International Conference on Machine Learning.\n\nConnor Schenck, Dieter Fox, SPNets: Differentiable Fluid Dynamics for Deep Neural Networks. Conference on Robot Learning. Connor Schenck and Dieter Fox. 2018. SPNets: Differentiable Fluid Dynamics for Deep Neural Networks. Conference on Robot Learning (CoRL) (2018).\n\nJohn Schulman, Filip Wolski, Prafulla Dhariwal, Alec Radford, Oleg Klimov, arXiv:1707.06347Proximal policy optimization algorithms. arXiv preprintJohn Schulman, Filip Wolski, Prafulla Dhariwal, Alec Radford, and Oleg Klimov. 2017. Proximal policy optimization algorithms. arXiv preprint arXiv:1707.06347 (2017).\n\nDiscrete Geometric Mechanics for Variational Time Integrators. Ari Stern, Mathieu Desbrun, ACM SIGGRAPH 2006 Courses. Boston, Massachusetts; New York, NY, USAAssociation for Computing MachinerySIG-GRAPH '06)Ari Stern and Mathieu Desbrun. 2006. Discrete Geometric Mechanics for Variational Time Integrators. In ACM SIGGRAPH 2006 Courses (Boston, Massachusetts) (SIG- GRAPH '06). Association for Computing Machinery, New York, NY, USA, 75-80.\n\nImplicit-Explicit Variational Integration of Highly Oscillatory Problems. Ari Stern, Eitan Grinspun, Multiscale Modeling & Simulation. 7Ari Stern and Eitan Grinspun. 2009. Implicit-Explicit Variational Integration of Highly Oscillatory Problems. Multiscale Modeling & Simulation 7, 4 (2009), 1779-1794.\n\nSmoothed Aggregation Multigrid for Cloth Simulation. Rasmus Tamstorf, Toby Jones, Stephen F Mccormick, ACM Trans. Graph. 34245Rasmus Tamstorf, Toby Jones, and Stephen F. McCormick. 2015. Smoothed Aggregation Multigrid for Cloth Simulation. ACM Trans. Graph. 34, 6, Article 245 (Oct. 2015), 13 pages.\n\nElastically Deformable Models. Demetri Terzopoulos, John Platt, Alan Barr, Kurt Fleischer, SIGGRAPH Comput. Graph. 21Demetri Terzopoulos, John Platt, Alan Barr, and Kurt Fleischer. 1987. Elastically De- formable Models. SIGGRAPH Comput. Graph. 21, 4 (Aug. 1987), 205-214.\n\nDifferentiable Physics and Stable Modes for Tool-Use and Manipulation Planning. Marc Toussaint, Kelsey Allen, Kevin Smith, Joshua Tenenbaum, Robotics: Science and Systems. 2Marc Toussaint, Kelsey Allen, Kevin Smith, and Joshua Tenenbaum. 2018. Differentiable Physics and Stable Modes for Tool-Use and Manipulation Planning. In Robotics: Science and Systems, Vol. 2.\n\nKeyframe Control of Smoke Simulations. Adrien Treuille, Antoine Mcnamara, Zoran Popović, Jos Stam, ACM Trans. Graph. 223Adrien Treuille, Antoine McNamara, Zoran Popović, and Jos Stam. 2003. Keyframe Control of Smoke Simulations. ACM Trans. Graph. 22, 3 (July 2003), 716-723.\n\nSensitive Couture for Interactive Garment Modeling and Editing. Nobuyuki Umetani, Danny M Kaufman, Takeo Igarashi, Eitan Grinspun, ACM Trans. Graph. 30ArticleNobuyuki Umetani, Danny M. Kaufman, Takeo Igarashi, and Eitan Grinspun. 2011. Sensitive Couture for Interactive Garment Modeling and Editing. ACM Trans. Graph. 30, 4, Article 90 (July 2011), 12 pages.\n\nA Chebyshev Semi-Iterative Approach for Accelerating Projective and Position-Based Dynamics. Huamin Wang, ACM Trans. Graph. 34246Huamin Wang. 2015. A Chebyshev Semi-Iterative Approach for Accelerating Projective and Position-Based Dynamics. ACM Trans. Graph. 34, 6, Article 246 (Oct. 2015), 9 pages.\n\nRule-Free Sewing Pattern Adjustment with Precision and Efficiency. Huamin Wang, ACM Trans. Graph. 3753Huamin Wang. 2018. Rule-Free Sewing Pattern Adjustment with Precision and Effi- ciency. ACM Trans. Graph. 37, 4, Article 53 (July 2018), 13 pages.\n\nData-Driven Elastic Models for Cloth: Modeling and Measurement. Huamin Wang, James F O&apos;brien, Ravi Ramamoorthi, ACM SIGGRAPH 2011 Papers. Vancouver, British Columbia, Canada; New York, NY, USAAssociation for Computing MachinerySIGGRAPH '11). Article 71, 12 pagesHuamin Wang, James F. O'Brien, and Ravi Ramamoorthi. 2011. Data-Driven Elastic Models for Cloth: Modeling and Measurement. In ACM SIGGRAPH 2011 Papers (Vancouver, British Columbia, Canada) (SIGGRAPH '11). Association for Computing Machinery, New York, NY, USA, Article 71, 12 pages.\n\nDescent Methods for Elastic Body Simulation on the GPU. Huamin Wang, Yin Yang, ACM Trans. Graph. 35212Huamin Wang and Yin Yang. 2016. Descent Methods for Elastic Body Simulation on the GPU. ACM Trans. Graph. 35, 6, Article 212 (Nov. 2016), 10 pages.\n\nParallel Multigrid for Nonlinear Cloth Simulation. Zhendong Wang, Longhua Wu, Marco Fratarcangeli, Min Tang, Huamin Wang, Computer Graphics Forum. 37Zhendong Wang, Longhua Wu, Marco Fratarcangeli, Min Tang, and Huamin Wang. 2018. Parallel Multigrid for Nonlinear Cloth Simulation. Computer Graphics Forum 37, 7 (2018), 131-141.\n\nFast and Feature-Complete Differentiable Physics Engine for Articulated Rigid Bodies with Contact Constraints. Keenon Werling, Dalton Omens, Jeongseok Lee, Ioannis Exarchos, C Karen Liu, 10.15607/RSS.2021.XVII.034Proceedings of Robotics: Science and Systems. Robotics: Science and SystemsKeenon Werling, Dalton Omens, Jeongseok Lee, Ioannis Exarchos, and C. Karen Liu. 2021. Fast and Feature-Complete Differentiable Physics Engine for Articulated Rigid Bodies with Contact Constraints. In Proceedings of Robotics: Science and Systems. Virtual. https://doi.org/10.15607/RSS.2021.XVII.034\n\nCapturing and Animating Occluded Cloth. Ryan White, Keenan Crane, David Forsyth, In ACM Transactions on Graphics. Ryan White, Keenan Crane, and David Forsyth. 2007. Capturing and Animating Occluded Cloth. In ACM Transactions on Graphics (SIGGRAPH).\n\nSpacetime Constraints. Andrew Witkin, Michael Kass, 10.1145/54852.378507Proceedings of the 15th Annual Conference on Computer Graphics and Interactive Techniques (SIGGRAPH '88). the 15th Annual Conference on Computer Graphics and Interactive Techniques (SIGGRAPH '88)New York, NY, USAAssociation for Computing MachineryAndrew Witkin and Michael Kass. 1988. Spacetime Constraints. In Proceedings of the 15th Annual Conference on Computer Graphics and Interactive Techniques (SIGGRAPH '88). Association for Computing Machinery, New York, NY, USA, 159-168. https: //doi.org/10.1145/54852.378507\n\nKeyframe Control of Complex Particle Systems Using the Adjoint Method. Chris Wojtan, Peter Mucha, Greg Turk, Proceedings of the 2006 ACM SIG-GRAPH/Eurographics Symposium on Computer Animation. the 2006 ACM SIG-GRAPH/Eurographics Symposium on Computer AnimationVienna, Austria; Goslar, DEUSCA '06)Chris Wojtan, Peter Mucha, and Greg Turk. 2006. Keyframe Control of Complex Particle Systems Using the Adjoint Method. In Proceedings of the 2006 ACM SIG- GRAPH/Eurographics Symposium on Computer Animation (Vienna, Austria) (SCA '06). Eurographics Association, Goslar, DEU, 15-23.\n\nA Scalable Galerkin Multigrid Method for Real-Time Simulation of Deformable Objects. Zangyueyang Xian, Xin Tong, Tiantian Liu, ACM Trans. Graph. 3813Zangyueyang Xian, Xin Tong, and Tiantian Liu. 2019. A Scalable Galerkin Multigrid Method for Real-Time Simulation of Deformable Objects. ACM Trans. Graph. 38, 6, Article 162 (Nov. 2019), 13 pages.\n\nShinjiro Sueda, and Pulkit Agrawal. 2021. An End-to-End Differentiable Framework for Contact-Aware Robot Design. Jie Xu, Tao Chen, Lara Zlokapa, Michael Foshey, Wojciech Matusik, 10.15607/RSS.2021.XVII.008Proceedings of Robotics: Science and Systems. Robotics: Science and SystemsJie Xu, Tao Chen, Lara Zlokapa, Michael Foshey, Wojciech Matusik, Shinjiro Sueda, and Pulkit Agrawal. 2021. An End-to-End Differentiable Framework for Contact- Aware Robot Design. In Proceedings of Robotics: Science and Systems. Virtual. https: //doi.org/10.15607/RSS.2021.XVII.008\n\n. Qiu Yixuan, Qiu Yixuan. 2021. LBFGS++. https://github.com/yixuan/LBFGSpp/.\n", "annotations": {"author": null, "publisher": null, "author_last_name": null, "author_first_name": null, "author_affiliation": null, "title": "[{\"end\":71,\"start\":1},{\"end\":144,\"start\":74}]", "venue": null, "abstract": null, "bib_ref": "[{\"attributes\":{\"ref_id\":\"b45\"},\"end\":1302,\"start\":1286},{\"attributes\":{\"ref_id\":\"b17\"},\"end\":1359,\"start\":1343},{\"attributes\":{\"ref_id\":\"b21\"},\"end\":2338,\"start\":2321},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":2376,\"start\":2356},{\"attributes\":{\"ref_id\":\"b53\"},\"end\":2395,\"start\":2376},{\"attributes\":{\"ref_id\":\"b73\"},\"end\":2415,\"start\":2395},{\"attributes\":{\"ref_id\":\"b75\"},\"end\":2425,\"start\":2415},{\"attributes\":{\"ref_id\":\"b37\"},\"end\":2455,\"start\":2439},{\"attributes\":{\"ref_id\":\"b6\"},\"end\":2494,\"start\":2474},{\"attributes\":{\"ref_id\":\"b44\"},\"end\":2535,\"start\":2519},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":2583,\"start\":2565},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":2603,\"start\":2583},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":2753,\"start\":2716},{\"attributes\":{\"ref_id\":\"b20\"},\"end\":2774,\"start\":2753},{\"attributes\":{\"ref_id\":\"b18\"},\"end\":2809,\"start\":2793},{\"attributes\":{\"ref_id\":\"b27\"},\"end\":2824,\"start\":2809},{\"attributes\":{\"ref_id\":\"b20\"},\"end\":2877,\"start\":2854},{\"attributes\":{\"ref_id\":\"b23\"},\"end\":2894,\"start\":2877},{\"attributes\":{\"ref_id\":\"b40\"},\"end\":4142,\"start\":4123},{\"attributes\":{\"ref_id\":\"b45\"},\"end\":4361,\"start\":4345},{\"attributes\":{\"ref_id\":\"b17\"},\"end\":4797,\"start\":4781},{\"attributes\":{\"ref_id\":\"b20\"},\"end\":5629,\"start\":5606},{\"attributes\":{\"ref_id\":\"b79\"},\"end\":5699,\"start\":5678},{\"attributes\":{\"ref_id\":\"b0\"},\"end\":7645,\"start\":7621},{\"attributes\":{\"ref_id\":\"b70\"},\"end\":7668,\"start\":7645},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":7802,\"start\":7781},{\"attributes\":{\"ref_id\":\"b68\"},\"end\":7826,\"start\":7802},{\"end\":7997,\"start\":7974},{\"attributes\":{\"ref_id\":\"b67\"},\"end\":8048,\"start\":8024},{\"attributes\":{\"ref_id\":\"b42\"},\"end\":8155,\"start\":8138},{\"attributes\":{\"ref_id\":\"b2\"},\"end\":8451,\"start\":8430},{\"attributes\":{\"ref_id\":\"b43\"},\"end\":8626,\"start\":8609},{\"attributes\":{\"ref_id\":\"b59\"},\"end\":8645,\"start\":8626},{\"attributes\":{\"ref_id\":\"b47\"},\"end\":8896,\"start\":8875},{\"attributes\":{\"ref_id\":\"b55\"},\"end\":8914,\"start\":8896},{\"attributes\":{\"ref_id\":\"b32\"},\"end\":9173,\"start\":9145},{\"attributes\":{\"ref_id\":\"b74\"},\"end\":9306,\"start\":9295},{\"attributes\":{\"ref_id\":\"b77\"},\"end\":9348,\"start\":9328},{\"attributes\":{\"ref_id\":\"b19\"},\"end\":9483,\"start\":9456},{\"attributes\":{\"ref_id\":\"b69\"},\"end\":9869,\"start\":9847},{\"attributes\":{\"ref_id\":\"b83\"},\"end\":9919,\"start\":9901},{\"attributes\":{\"ref_id\":\"b11\"},\"end\":10052,\"start\":10033},{\"attributes\":{\"ref_id\":\"b50\"},\"end\":10070,\"start\":10052},{\"attributes\":{\"ref_id\":\"b51\"},\"end\":10090,\"start\":10070},{\"attributes\":{\"ref_id\":\"b76\"},\"end\":10107,\"start\":10090},{\"attributes\":{\"ref_id\":\"b23\"},\"end\":10301,\"start\":10283},{\"attributes\":{\"ref_id\":\"b62\"},\"end\":10414,\"start\":10401},{\"attributes\":{\"ref_id\":\"b25\"},\"end\":10582,\"start\":10562},{\"attributes\":{\"ref_id\":\"b3\"},\"end\":10703,\"start\":10682},{\"attributes\":{\"ref_id\":\"b33\"},\"end\":10917,\"start\":10900},{\"attributes\":{\"ref_id\":\"b57\"},\"end\":10936,\"start\":10917},{\"attributes\":{\"ref_id\":\"b2\"},\"end\":11148,\"start\":11127},{\"attributes\":{\"ref_id\":\"b20\"},\"end\":11170,\"start\":11148},{\"attributes\":{\"ref_id\":\"b46\"},\"end\":11190,\"start\":11170},{\"attributes\":{\"ref_id\":\"b74\"},\"end\":11200,\"start\":11190},{\"attributes\":{\"ref_id\":\"b35\"},\"end\":11403,\"start\":11387},{\"attributes\":{\"ref_id\":\"b36\"},\"end\":11421,\"start\":11403},{\"attributes\":{\"ref_id\":\"b58\"},\"end\":11763,\"start\":11743},{\"attributes\":{\"ref_id\":\"b58\"},\"end\":12030,\"start\":12011},{\"attributes\":{\"ref_id\":\"b34\"},\"end\":12050,\"start\":12033},{\"attributes\":{\"ref_id\":\"b45\"},\"end\":12442,\"start\":12426},{\"attributes\":{\"ref_id\":\"b12\"},\"end\":12949,\"start\":12920},{\"attributes\":{\"ref_id\":\"b29\"},\"end\":12966,\"start\":12949},{\"attributes\":{\"ref_id\":\"b52\"},\"end\":12985,\"start\":12966},{\"attributes\":{\"ref_id\":\"b81\"},\"end\":13890,\"start\":13868},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":14069,\"start\":14032},{\"attributes\":{\"ref_id\":\"b16\"},\"end\":14089,\"start\":14069},{\"attributes\":{\"ref_id\":\"b63\"},\"end\":14106,\"start\":14089},{\"attributes\":{\"ref_id\":\"b71\"},\"end\":14128,\"start\":14106},{\"end\":14143,\"start\":14128},{\"attributes\":{\"ref_id\":\"b17\"},\"end\":14180,\"start\":14164},{\"attributes\":{\"ref_id\":\"b20\"},\"end\":14202,\"start\":14180},{\"attributes\":{\"ref_id\":\"b23\"},\"end\":14219,\"start\":14202},{\"attributes\":{\"ref_id\":\"b27\"},\"end\":14233,\"start\":14219},{\"attributes\":{\"ref_id\":\"b28\"},\"end\":14249,\"start\":14233},{\"attributes\":{\"ref_id\":\"b26\"},\"end\":14288,\"start\":14270},{\"attributes\":{\"ref_id\":\"b49\"},\"end\":14309,\"start\":14288},{\"attributes\":{\"ref_id\":\"b65\"},\"end\":14330,\"start\":14309},{\"attributes\":{\"ref_id\":\"b72\"},\"end\":14351,\"start\":14330},{\"attributes\":{\"ref_id\":\"b82\"},\"end\":14369,\"start\":14351},{\"attributes\":{\"ref_id\":\"b39\"},\"end\":14570,\"start\":14554},{\"attributes\":{\"ref_id\":\"b64\"},\"end\":14599,\"start\":14570},{\"attributes\":{\"ref_id\":\"b20\"},\"end\":14800,\"start\":14777},{\"attributes\":{\"ref_id\":\"b23\"},\"end\":14816,\"start\":14800},{\"attributes\":{\"ref_id\":\"b35\"},\"end\":14993,\"start\":14977},{\"attributes\":{\"ref_id\":\"b36\"},\"end\":15010,\"start\":14993},{\"attributes\":{\"ref_id\":\"b46\"},\"end\":15029,\"start\":15010},{\"attributes\":{\"ref_id\":\"b40\"},\"end\":15244,\"start\":15225},{\"end\":15568,\"start\":15548},{\"attributes\":{\"ref_id\":\"b17\"},\"end\":15794,\"start\":15779},{\"attributes\":{\"ref_id\":\"b45\"},\"end\":15866,\"start\":15851},{\"attributes\":{\"ref_id\":\"b61\"},\"end\":16095,\"start\":16075},{\"attributes\":{\"ref_id\":\"b28\"},\"end\":16131,\"start\":16115},{\"attributes\":{\"ref_id\":\"b45\"},\"end\":16177,\"start\":16161},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":16453,\"start\":16416},{\"attributes\":{\"ref_id\":\"b17\"},\"end\":16468,\"start\":16453},{\"attributes\":{\"ref_id\":\"b20\"},\"end\":16490,\"start\":16468},{\"attributes\":{\"ref_id\":\"b40\"},\"end\":16508,\"start\":16490},{\"attributes\":{\"ref_id\":\"b45\"},\"end\":17015,\"start\":16999},{\"attributes\":{\"ref_id\":\"b2\"},\"end\":18005,\"start\":17984},{\"attributes\":{\"ref_id\":\"b48\"},\"end\":18210,\"start\":18190},{\"attributes\":{\"ref_id\":\"b2\"},\"end\":18916,\"start\":18895},{\"attributes\":{\"ref_id\":\"b43\"},\"end\":18932,\"start\":18916},{\"attributes\":{\"ref_id\":\"b2\"},\"end\":19314,\"start\":19293},{\"attributes\":{\"ref_id\":\"b43\"},\"end\":20038,\"start\":20022},{\"attributes\":{\"ref_id\":\"b45\"},\"end\":20347,\"start\":20331},{\"attributes\":{\"ref_id\":\"b5\"},\"end\":20704,\"start\":20689},{\"attributes\":{\"ref_id\":\"b45\"},\"end\":21612,\"start\":21596},{\"attributes\":{\"ref_id\":\"b45\"},\"end\":22760,\"start\":22744},{\"attributes\":{\"ref_id\":\"b45\"},\"end\":22887,\"start\":22871},{\"attributes\":{\"ref_id\":\"b45\"},\"end\":23088,\"start\":23072},{\"attributes\":{\"ref_id\":\"b45\"},\"end\":23778,\"start\":23762},{\"attributes\":{\"ref_id\":\"b45\"},\"end\":24326,\"start\":24310},{\"attributes\":{\"ref_id\":\"b45\"},\"end\":24510,\"start\":24494},{\"attributes\":{\"ref_id\":\"b17\"},\"end\":25204,\"start\":25188},{\"attributes\":{\"ref_id\":\"b20\"},\"end\":25226,\"start\":25204},{\"attributes\":{\"ref_id\":\"b28\"},\"end\":25241,\"start\":25226},{\"attributes\":{\"ref_id\":\"b40\"},\"end\":25325,\"start\":25307},{\"attributes\":{\"ref_id\":\"b17\"},\"end\":26096,\"start\":26080},{\"attributes\":{\"ref_id\":\"b20\"},\"end\":26118,\"start\":26096},{\"attributes\":{\"ref_id\":\"b23\"},\"end\":26134,\"start\":26118},{\"attributes\":{\"ref_id\":\"b17\"},\"end\":27316,\"start\":27300},{\"attributes\":{\"ref_id\":\"b17\"},\"end\":27511,\"start\":27495},{\"attributes\":{\"ref_id\":\"b43\"},\"end\":27527,\"start\":27511},{\"attributes\":{\"ref_id\":\"b43\"},\"end\":27754,\"start\":27737},{\"attributes\":{\"ref_id\":\"b17\"},\"end\":27980,\"start\":27964},{\"attributes\":{\"ref_id\":\"b17\"},\"end\":28274,\"start\":28258},{\"attributes\":{\"ref_id\":\"b17\"},\"end\":28483,\"start\":28467},{\"end\":28921,\"start\":28914},{\"attributes\":{\"ref_id\":\"b20\"},\"end\":28994,\"start\":28972},{\"attributes\":{\"ref_id\":\"b45\"},\"end\":31611,\"start\":31595},{\"attributes\":{\"ref_id\":\"b45\"},\"end\":34891,\"start\":34875},{\"attributes\":{\"ref_id\":\"b40\"},\"end\":35559,\"start\":35541},{\"attributes\":{\"ref_id\":\"b61\"},\"end\":40002,\"start\":39981},{\"attributes\":{\"ref_id\":\"b79\"},\"end\":40022,\"start\":40002},{\"attributes\":{\"ref_id\":\"b61\"},\"end\":41166,\"start\":41146},{\"attributes\":{\"ref_id\":\"b38\"},\"end\":41672,\"start\":41656},{\"attributes\":{\"ref_id\":\"b41\"},\"end\":45803,\"start\":45781},{\"attributes\":{\"ref_id\":\"b24\"},\"end\":45827,\"start\":45815},{\"attributes\":{\"ref_id\":\"b40\"},\"end\":47149,\"start\":47130},{\"attributes\":{\"ref_id\":\"b40\"},\"end\":47318,\"start\":47299},{\"attributes\":{\"ref_id\":\"b40\"},\"end\":47370,\"start\":47351},{\"attributes\":{\"ref_id\":\"b40\"},\"end\":47699,\"start\":47680},{\"attributes\":{\"ref_id\":\"b40\"},\"end\":47952,\"start\":47933},{\"attributes\":{\"ref_id\":\"b40\"},\"end\":48185,\"start\":48166},{\"attributes\":{\"ref_id\":\"b22\"},\"end\":49504,\"start\":49481},{\"attributes\":{\"ref_id\":\"b2\"},\"end\":50574,\"start\":50553},{\"attributes\":{\"ref_id\":\"b17\"},\"end\":50589,\"start\":50574},{\"attributes\":{\"ref_id\":\"b43\"},\"end\":50605,\"start\":50589},{\"attributes\":{\"ref_id\":\"b54\"},\"end\":55513,\"start\":55490},{\"attributes\":{\"ref_id\":\"b40\"},\"end\":58488,\"start\":58469},{\"attributes\":{\"ref_id\":\"b80\"},\"end\":62496,\"start\":62477},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":67743,\"start\":67725},{\"attributes\":{\"ref_id\":\"b66\"},\"end\":67827,\"start\":67806},{\"attributes\":{\"ref_id\":\"b17\"},\"end\":68822,\"start\":68806},{\"attributes\":{\"ref_id\":\"b27\"},\"end\":68836,\"start\":68822},{\"attributes\":{\"ref_id\":\"b28\"},\"end\":68852,\"start\":68836},{\"attributes\":{\"ref_id\":\"b40\"},\"end\":68869,\"start\":68852},{\"attributes\":{\"ref_id\":\"b76\"},\"end\":70878,\"start\":70860},{\"attributes\":{\"ref_id\":\"b45\"},\"end\":70935,\"start\":70919}]", "figure": "[{\"attributes\":{\"id\":\"fig_0\"},\"end\":81027,\"start\":80517},{\"attributes\":{\"id\":\"fig_1\"},\"end\":81634,\"start\":81028},{\"attributes\":{\"id\":\"fig_2\"},\"end\":81674,\"start\":81635},{\"attributes\":{\"id\":\"fig_3\"},\"end\":82010,\"start\":81675},{\"attributes\":{\"id\":\"fig_4\"},\"end\":82430,\"start\":82011},{\"attributes\":{\"id\":\"fig_5\"},\"end\":82823,\"start\":82431},{\"attributes\":{\"id\":\"fig_6\"},\"end\":83754,\"start\":82824},{\"attributes\":{\"id\":\"fig_7\"},\"end\":83831,\"start\":83755},{\"attributes\":{\"id\":\"tab_2\",\"type\":\"table\"},\"end\":84543,\"start\":83832},{\"attributes\":{\"id\":\"tab_4\",\"type\":\"table\"},\"end\":84797,\"start\":84544}]", "paragraph": "[{\"end\":909,\"start\":170},{\"end\":1958,\"start\":911},{\"end\":2604,\"start\":1975},{\"end\":3424,\"start\":2606},{\"end\":4183,\"start\":3426},{\"end\":4975,\"start\":4185},{\"end\":5947,\"start\":4977},{\"end\":6541,\"start\":5949},{\"end\":6592,\"start\":6543},{\"end\":7123,\"start\":6594},{\"end\":7363,\"start\":7140},{\"end\":8093,\"start\":7365},{\"end\":9056,\"start\":8095},{\"end\":9920,\"start\":9058},{\"end\":10302,\"start\":9922},{\"end\":11611,\"start\":10304},{\"end\":12632,\"start\":11613},{\"end\":13594,\"start\":12634},{\"end\":14703,\"start\":13596},{\"end\":15909,\"start\":14705},{\"end\":16860,\"start\":15911},{\"end\":17227,\"start\":16875},{\"end\":17547,\"start\":17258},{\"end\":18153,\"start\":17611},{\"end\":18334,\"start\":18155},{\"end\":18764,\"start\":18399},{\"end\":18933,\"start\":18766},{\"end\":19315,\"start\":18992},{\"end\":19423,\"start\":19317},{\"end\":19617,\"start\":19490},{\"end\":19793,\"start\":19619},{\"end\":20258,\"start\":19851},{\"end\":20797,\"start\":20308},{\"end\":21416,\"start\":20943},{\"end\":21613,\"start\":21418},{\"end\":22803,\"start\":21775},{\"end\":23160,\"start\":22805},{\"end\":23526,\"start\":23197},{\"end\":23869,\"start\":23558},{\"end\":24626,\"start\":23934},{\"end\":25565,\"start\":24662},{\"end\":26198,\"start\":25595},{\"end\":26391,\"start\":26283},{\"end\":26496,\"start\":26480},{\"end\":26756,\"start\":26570},{\"end\":27087,\"start\":26824},{\"end\":27213,\"start\":27089},{\"end\":27528,\"start\":27215},{\"end\":27847,\"start\":27592},{\"end\":28029,\"start\":27897},{\"end\":28434,\"start\":28061},{\"end\":29259,\"start\":28461},{\"end\":29721,\"start\":29261},{\"end\":30814,\"start\":29851},{\"end\":31367,\"start\":30816},{\"end\":31710,\"start\":31455},{\"end\":32094,\"start\":31904},{\"end\":32534,\"start\":32182},{\"end\":32752,\"start\":32592},{\"end\":32840,\"start\":32784},{\"end\":33148,\"start\":32879},{\"end\":33567,\"start\":33150},{\"end\":35124,\"start\":33569},{\"end\":35736,\"start\":35140},{\"end\":36224,\"start\":35766},{\"end\":37048,\"start\":36226},{\"end\":38125,\"start\":37050},{\"end\":38948,\"start\":38127},{\"end\":39581,\"start\":38950},{\"end\":40887,\"start\":39583},{\"end\":41726,\"start\":40889},{\"end\":42332,\"start\":41728},{\"end\":43081,\"start\":42334},{\"end\":43566,\"start\":43083},{\"end\":44149,\"start\":43579},{\"end\":45409,\"start\":44177},{\"end\":46440,\"start\":45411},{\"end\":46960,\"start\":46442},{\"end\":48583,\"start\":46999},{\"end\":52134,\"start\":48637},{\"end\":52807,\"start\":52136},{\"end\":54677,\"start\":52824},{\"end\":55031,\"start\":54686},{\"end\":55514,\"start\":55033},{\"end\":55637,\"start\":55540},{\"end\":56174,\"start\":55639},{\"end\":56874,\"start\":56176},{\"end\":58664,\"start\":56876},{\"end\":59482,\"start\":58683},{\"end\":59959,\"start\":59518},{\"end\":61370,\"start\":59961},{\"end\":62268,\"start\":61389},{\"end\":64343,\"start\":62294},{\"end\":64956,\"start\":64386},{\"end\":65952,\"start\":64975},{\"end\":67511,\"start\":65954},{\"end\":68484,\"start\":67513},{\"end\":69257,\"start\":68486},{\"end\":70511,\"start\":69302},{\"end\":70879,\"start\":70513},{\"end\":71283,\"start\":70881},{\"end\":72020,\"start\":71285},{\"end\":72304,\"start\":72022},{\"end\":72835,\"start\":72306},{\"end\":73770,\"start\":72861},{\"end\":73783,\"start\":73779},{\"end\":73981,\"start\":73808},{\"end\":74051,\"start\":74011},{\"end\":74561,\"start\":74092},{\"end\":74749,\"start\":74563},{\"end\":74984,\"start\":74781},{\"end\":75319,\"start\":75020},{\"end\":75672,\"start\":75321},{\"end\":76206,\"start\":75757},{\"end\":76267,\"start\":76229},{\"end\":76728,\"start\":76293},{\"end\":76962,\"start\":76756},{\"end\":77420,\"start\":76999},{\"end\":77869,\"start\":77443},{\"end\":78241,\"start\":77900},{\"end\":78413,\"start\":78292},{\"end\":78575,\"start\":78445},{\"end\":80490,\"start\":78623}]", "formula": "[{\"attributes\":{\"id\":\"formula_0\"},\"end\":17610,\"start\":17548},{\"attributes\":{\"id\":\"formula_1\"},\"end\":18398,\"start\":18335},{\"attributes\":{\"id\":\"formula_2\"},\"end\":18991,\"start\":18934},{\"attributes\":{\"id\":\"formula_4\"},\"end\":19489,\"start\":19424},{\"attributes\":{\"id\":\"formula_5\"},\"end\":19850,\"start\":19794},{\"attributes\":{\"id\":\"formula_6\"},\"end\":20942,\"start\":20798},{\"attributes\":{\"id\":\"formula_7\"},\"end\":21774,\"start\":21614},{\"attributes\":{\"id\":\"formula_8\"},\"end\":23196,\"start\":23161},{\"attributes\":{\"id\":\"formula_9\"},\"end\":23557,\"start\":23527},{\"attributes\":{\"id\":\"formula_10\"},\"end\":23933,\"start\":23870},{\"attributes\":{\"id\":\"formula_11\"},\"end\":26282,\"start\":26199},{\"attributes\":{\"id\":\"formula_12\"},\"end\":26479,\"start\":26392},{\"attributes\":{\"id\":\"formula_13\"},\"end\":26569,\"start\":26497},{\"attributes\":{\"id\":\"formula_14\"},\"end\":26823,\"start\":26757},{\"attributes\":{\"id\":\"formula_15\"},\"end\":27591,\"start\":27529},{\"attributes\":{\"id\":\"formula_17\"},\"end\":27896,\"start\":27848},{\"attributes\":{\"id\":\"formula_18\"},\"end\":28060,\"start\":28030},{\"attributes\":{\"id\":\"formula_19\"},\"end\":29850,\"start\":29722},{\"attributes\":{\"id\":\"formula_20\"},\"end\":31454,\"start\":31368},{\"attributes\":{\"id\":\"formula_21\"},\"end\":31903,\"start\":31711},{\"attributes\":{\"id\":\"formula_23\"},\"end\":32181,\"start\":32095},{\"attributes\":{\"id\":\"formula_25\"},\"end\":32591,\"start\":32535},{\"attributes\":{\"id\":\"formula_26\"},\"end\":32783,\"start\":32753},{\"attributes\":{\"id\":\"formula_27\"},\"end\":32878,\"start\":32841},{\"attributes\":{\"id\":\"formula_28\"},\"end\":74091,\"start\":74052},{\"attributes\":{\"id\":\"formula_29\"},\"end\":75019,\"start\":74985},{\"attributes\":{\"id\":\"formula_30\"},\"end\":75756,\"start\":75673},{\"attributes\":{\"id\":\"formula_31\"},\"end\":76292,\"start\":76268},{\"attributes\":{\"id\":\"formula_32\"},\"end\":76998,\"start\":76963},{\"attributes\":{\"id\":\"formula_33\"},\"end\":77899,\"start\":77870},{\"attributes\":{\"id\":\"formula_34\"},\"end\":78291,\"start\":78242},{\"attributes\":{\"id\":\"formula_35\"},\"end\":78444,\"start\":78414}]", "table_ref": "[{\"end\":50260,\"start\":50253},{\"end\":52686,\"start\":52679},{\"attributes\":{\"ref_id\":\"tab_2\"},\"end\":53243,\"start\":53236},{\"end\":53694,\"start\":53687},{\"end\":54698,\"start\":54691},{\"end\":56498,\"start\":56491},{\"attributes\":{\"ref_id\":\"tab_2\"},\"end\":56510,\"start\":56503},{\"end\":57369,\"start\":57362},{\"end\":58859,\"start\":58852},{\"end\":61062,\"start\":61050},{\"end\":62077,\"start\":62070},{\"end\":63497,\"start\":63490},{\"end\":73192,\"start\":73185},{\"end\":73201,\"start\":73194},{\"end\":78705,\"start\":78698},{\"end\":78717,\"start\":78710},{\"end\":79366,\"start\":79359},{\"end\":79690,\"start\":79683},{\"end\":80435,\"start\":80402}]", "section_header": "[{\"attributes\":{\"n\":\"1\"},\"end\":1973,\"start\":1961},{\"attributes\":{\"n\":\"2\"},\"end\":7138,\"start\":7126},{\"attributes\":{\"n\":\"3\"},\"end\":16873,\"start\":16863},{\"attributes\":{\"n\":\"3.1\"},\"end\":17256,\"start\":17230},{\"attributes\":{\"n\":\"3.2\"},\"end\":20306,\"start\":20261},{\"attributes\":{\"n\":\"4\"},\"end\":24660,\"start\":24629},{\"attributes\":{\"n\":\"4.1\"},\"end\":25593,\"start\":25568},{\"attributes\":{\"n\":\"4.2\"},\"end\":28459,\"start\":28437},{\"attributes\":{\"n\":\"5\"},\"end\":35138,\"start\":35127},{\"attributes\":{\"n\":\"5.1\"},\"end\":35764,\"start\":35739},{\"end\":43577,\"start\":43569},{\"attributes\":{\"n\":\"5.2\"},\"end\":44175,\"start\":44152},{\"attributes\":{\"n\":\"5.3\"},\"end\":46997,\"start\":46963},{\"attributes\":{\"n\":\"5.4\"},\"end\":48635,\"start\":48586},{\"attributes\":{\"n\":\"6\"},\"end\":52822,\"start\":52810},{\"end\":54684,\"start\":54680},{\"attributes\":{\"n\":\"6.1\"},\"end\":55538,\"start\":55517},{\"end\":58681,\"start\":58667},{\"end\":59490,\"start\":59485},{\"attributes\":{\"n\":\"6.2\"},\"end\":59516,\"start\":59493},{\"attributes\":{\"n\":\"6.3\"},\"end\":61387,\"start\":61373},{\"attributes\":{\"n\":\"6.4\"},\"end\":62292,\"start\":62271},{\"end\":64384,\"start\":64346},{\"attributes\":{\"n\":\"6.5\"},\"end\":64973,\"start\":64959},{\"attributes\":{\"n\":\"7\"},\"end\":69300,\"start\":69260},{\"end\":72859,\"start\":72838},{\"end\":73777,\"start\":73773},{\"end\":73806,\"start\":73786},{\"end\":74009,\"start\":73984},{\"end\":74779,\"start\":74752},{\"end\":76227,\"start\":76209},{\"end\":76754,\"start\":76731},{\"end\":77441,\"start\":77423},{\"end\":78621,\"start\":78578},{\"end\":80503,\"start\":80493},{\"end\":80516,\"start\":80506},{\"end\":81037,\"start\":81029},{\"end\":81684,\"start\":81676},{\"end\":82020,\"start\":82012},{\"end\":82440,\"start\":82432},{\"end\":82842,\"start\":82825},{\"end\":83842,\"start\":83833}]", "table": "[{\"end\":84543,\"start\":83844},{\"end\":84797,\"start\":84579}]", "figure_caption": "[{\"end\":81027,\"start\":80519},{\"end\":81634,\"start\":81039},{\"end\":81674,\"start\":81637},{\"end\":82010,\"start\":81686},{\"end\":82430,\"start\":82022},{\"end\":82823,\"start\":82442},{\"end\":83754,\"start\":82846},{\"end\":83831,\"start\":83757},{\"end\":84579,\"start\":84546}]", "figure_ref": "[{\"end\":169,\"start\":163},{\"end\":37338,\"start\":37330},{\"end\":38221,\"start\":38200},{\"end\":40372,\"start\":40359},{\"end\":40517,\"start\":40510},{\"end\":41023,\"start\":41017},{\"end\":42119,\"start\":42111},{\"attributes\":{\"ref_id\":\"fig_1\"},\"end\":42548,\"start\":42536},{\"attributes\":{\"ref_id\":\"fig_1\"},\"end\":43135,\"start\":43129},{\"attributes\":{\"ref_id\":\"fig_1\"},\"end\":43464,\"start\":43449},{\"end\":45500,\"start\":45488},{\"end\":45722,\"start\":45716},{\"end\":46148,\"start\":46142},{\"end\":46565,\"start\":46559},{\"end\":47638,\"start\":47630},{\"end\":47900,\"start\":47885},{\"end\":48088,\"start\":48065},{\"attributes\":{\"ref_id\":\"fig_3\"},\"end\":49138,\"start\":49130},{\"end\":51153,\"start\":51147},{\"attributes\":{\"ref_id\":\"fig_4\"},\"end\":55614,\"start\":55606},{\"attributes\":{\"ref_id\":\"fig_5\"},\"end\":55636,\"start\":55628},{\"attributes\":{\"ref_id\":\"fig_4\"},\"end\":56454,\"start\":56448},{\"attributes\":{\"ref_id\":\"fig_4\"},\"end\":56653,\"start\":56647},{\"end\":58300,\"start\":58294},{\"end\":59936,\"start\":59929},{\"end\":59958,\"start\":59949},{\"end\":61199,\"start\":61193},{\"end\":61212,\"start\":61204},{\"end\":62154,\"start\":62148},{\"end\":62361,\"start\":62353},{\"end\":63513,\"start\":63506},{\"end\":63804,\"start\":63797},{\"end\":63855,\"start\":63848},{\"end\":64448,\"start\":64441},{\"attributes\":{\"ref_id\":\"fig_1\"},\"end\":65324,\"start\":65317},{\"attributes\":{\"ref_id\":\"fig_1\"},\"end\":66673,\"start\":66666},{\"end\":68253,\"start\":68246},{\"end\":68755,\"start\":68748},{\"attributes\":{\"ref_id\":\"fig_1\"},\"end\":71596,\"start\":71590},{\"attributes\":{\"ref_id\":\"fig_1\"},\"end\":71846,\"start\":71840},{\"end\":79412,\"start\":79404},{\"end\":79681,\"start\":79675}]", "bib_author_first_name": "[{\"end\":85328,\"start\":85323},{\"end\":85343,\"start\":85337},{\"end\":85912,\"start\":85908},{\"end\":85925,\"start\":85921},{\"end\":85943,\"start\":85935},{\"end\":85945,\"start\":85944},{\"end\":85956,\"start\":85951},{\"end\":85958,\"start\":85957},{\"end\":85976,\"start\":85968},{\"end\":85993,\"start\":85985},{\"end\":86358,\"start\":86352},{\"end\":86377,\"start\":86368},{\"end\":86394,\"start\":86386},{\"end\":86408,\"start\":86400},{\"end\":86420,\"start\":86416},{\"end\":86818,\"start\":86812},{\"end\":86834,\"start\":86828},{\"end\":86847,\"start\":86843},{\"end\":87107,\"start\":87106},{\"end\":87118,\"start\":87117},{\"end\":87128,\"start\":87127},{\"end\":87624,\"start\":87617},{\"end\":87819,\"start\":87815},{\"end\":87832,\"start\":87828},{\"end\":87850,\"start\":87842},{\"end\":87873,\"start\":87862},{\"end\":88141,\"start\":88135},{\"end\":88143,\"start\":88142},{\"end\":88158,\"start\":88151},{\"end\":88455,\"start\":88452},{\"end\":88474,\"start\":88463},{\"end\":88701,\"start\":88692},{\"end\":88716,\"start\":88709},{\"end\":88734,\"start\":88727},{\"end\":88746,\"start\":88742},{\"end\":88760,\"start\":88753},{\"end\":88762,\"start\":88761},{\"end\":88770,\"start\":88769},{\"end\":88776,\"start\":88771},{\"end\":89150,\"start\":89141},{\"end\":89164,\"start\":89158},{\"end\":89172,\"start\":89169},{\"end\":89179,\"start\":89178},{\"end\":89185,\"start\":89180},{\"end\":89195,\"start\":89191},{\"end\":89515,\"start\":89510},{\"end\":89529,\"start\":89523},{\"end\":89543,\"start\":89537},{\"end\":90195,\"start\":90194},{\"end\":90203,\"start\":90198},{\"end\":90224,\"start\":90215},{\"end\":90239,\"start\":90234},{\"end\":90254,\"start\":90249},{\"end\":90272,\"start\":90267},{\"end\":91027,\"start\":91021},{\"end\":91057,\"start\":91052},{\"end\":91071,\"start\":91065},{\"end\":91083,\"start\":91079},{\"end\":91101,\"start\":91095},{\"end\":91462,\"start\":91456},{\"end\":91492,\"start\":91487},{\"end\":91506,\"start\":91500},{\"end\":91518,\"start\":91514},{\"end\":91534,\"start\":91530},{\"end\":91886,\"start\":91881},{\"end\":91903,\"start\":91896},{\"end\":91917,\"start\":91913},{\"end\":91933,\"start\":91926},{\"end\":92156,\"start\":92153},{\"end\":92164,\"start\":92161},{\"end\":92178,\"start\":92169},{\"end\":92192,\"start\":92183},{\"end\":92204,\"start\":92198},{\"end\":92639,\"start\":92636},{\"end\":92647,\"start\":92644},{\"end\":92658,\"start\":92652},{\"end\":92678,\"start\":92670},{\"end\":92690,\"start\":92688},{\"end\":92705,\"start\":92696},{\"end\":93104,\"start\":93099},{\"end\":93129,\"start\":93120},{\"end\":93144,\"start\":93139},{\"end\":93473,\"start\":93467},{\"end\":93490,\"start\":93485},{\"end\":93502,\"start\":93497},{\"end\":93518,\"start\":93512},{\"end\":93535,\"start\":93527},{\"end\":93557,\"start\":93550},{\"end\":93892,\"start\":93885},{\"end\":93909,\"start\":93904},{\"end\":93911,\"start\":93910},{\"end\":93928,\"start\":93919},{\"end\":93947,\"start\":93940},{\"end\":93949,\"start\":93948},{\"end\":94174,\"start\":94170},{\"end\":94193,\"start\":94187},{\"end\":94365,\"start\":94360},{\"end\":94375,\"start\":94372},{\"end\":94385,\"start\":94384},{\"end\":94400,\"start\":94393},{\"end\":94693,\"start\":94685},{\"end\":94824,\"start\":94819},{\"end\":94840,\"start\":94833},{\"end\":94854,\"start\":94848},{\"end\":94870,\"start\":94865},{\"end\":95344,\"start\":95337},{\"end\":95355,\"start\":95351},{\"end\":95372,\"start\":95365},{\"end\":95609,\"start\":95601},{\"end\":95618,\"start\":95614},{\"end\":95636,\"start\":95629},{\"end\":95643,\"start\":95641},{\"end\":95655,\"start\":95649},{\"end\":95670,\"start\":95662},{\"end\":95690,\"start\":95685},{\"end\":96143,\"start\":96135},{\"end\":96157,\"start\":96148},{\"end\":96169,\"start\":96163},{\"end\":96187,\"start\":96181},{\"end\":96189,\"start\":96188},{\"end\":96202,\"start\":96201},{\"end\":96218,\"start\":96212},{\"end\":96235,\"start\":96228},{\"end\":96248,\"start\":96240},{\"end\":96720,\"start\":96714},{\"end\":96732,\"start\":96727},{\"end\":96752,\"start\":96745},{\"end\":97119,\"start\":97118},{\"end\":97135,\"start\":97130},{\"end\":97284,\"start\":97278},{\"end\":97302,\"start\":97297},{\"end\":97721,\"start\":97716},{\"end\":97729,\"start\":97726},{\"end\":97743,\"start\":97736},{\"end\":97754,\"start\":97750},{\"end\":97765,\"start\":97760},{\"end\":97778,\"start\":97772},{\"end\":98160,\"start\":98157},{\"end\":98171,\"start\":98165},{\"end\":98185,\"start\":98180},{\"end\":98202,\"start\":98194},{\"end\":98230,\"start\":98223},{\"end\":98245,\"start\":98239},{\"end\":98247,\"start\":98246},{\"end\":98263,\"start\":98255},{\"end\":98670,\"start\":98663},{\"end\":98682,\"start\":98675},{\"end\":98698,\"start\":98693},{\"end\":98717,\"start\":98710},{\"end\":98733,\"start\":98728},{\"end\":98748,\"start\":98741},{\"end\":98767,\"start\":98758},{\"end\":98780,\"start\":98775},{\"end\":98782,\"start\":98781},{\"end\":99132,\"start\":99125},{\"end\":99142,\"start\":99137},{\"end\":99144,\"start\":99143},{\"end\":99163,\"start\":99154},{\"end\":99488,\"start\":99481},{\"end\":99497,\"start\":99493},{\"end\":99512,\"start\":99507},{\"end\":99531,\"start\":99523},{\"end\":99834,\"start\":99827},{\"end\":99844,\"start\":99839},{\"end\":99859,\"start\":99854},{\"end\":99874,\"start\":99868},{\"end\":100229,\"start\":100223},{\"end\":100240,\"start\":100234},{\"end\":100249,\"start\":100245},{\"end\":100265,\"start\":100259},{\"end\":100284,\"start\":100277},{\"end\":100640,\"start\":100633},{\"end\":100652,\"start\":100648},{\"end\":100665,\"start\":100658},{\"end\":101271,\"start\":101270},{\"end\":101283,\"start\":101278},{\"end\":101521,\"start\":101513},{\"end\":101531,\"start\":101527},{\"end\":101533,\"start\":101532},{\"end\":101549,\"start\":101544},{\"end\":101551,\"start\":101550},{\"end\":101574,\"start\":101566},{\"end\":101862,\"start\":101854},{\"end\":101874,\"start\":101868},{\"end\":101892,\"start\":101884},{\"end\":102186,\"start\":102179},{\"end\":102197,\"start\":102191},{\"end\":102214,\"start\":102206},{\"end\":102241,\"start\":102235},{\"end\":102259,\"start\":102251},{\"end\":102568,\"start\":102561},{\"end\":102577,\"start\":102573},{\"end\":102593,\"start\":102585},{\"end\":102613,\"start\":102605},{\"end\":102909,\"start\":102908},{\"end\":102920,\"start\":102919},{\"end\":102931,\"start\":102930},{\"end\":102941,\"start\":102940},{\"end\":102954,\"start\":102953},{\"end\":102965,\"start\":102964},{\"end\":102967,\"start\":102966},{\"end\":103586,\"start\":103581},{\"end\":103604,\"start\":103596},{\"end\":103622,\"start\":103613},{\"end\":104180,\"start\":104171},{\"end\":104197,\"start\":104189},{\"end\":104217,\"start\":104212},{\"end\":104234,\"start\":104228},{\"end\":104547,\"start\":104540},{\"end\":104564,\"start\":104558},{\"end\":104580,\"start\":104575},{\"end\":104593,\"start\":104590},{\"end\":104829,\"start\":104828},{\"end\":104839,\"start\":104838},{\"end\":104850,\"start\":104849},{\"end\":104866,\"start\":104865},{\"end\":104876,\"start\":104875},{\"end\":104887,\"start\":104886},{\"end\":104889,\"start\":104888},{\"end\":104899,\"start\":104898},{\"end\":105198,\"start\":105194},{\"end\":105213,\"start\":105207},{\"end\":105229,\"start\":105224},{\"end\":105243,\"start\":105239},{\"end\":105245,\"start\":105244},{\"end\":105267,\"start\":105259},{\"end\":105287,\"start\":105282},{\"end\":105304,\"start\":105296},{\"end\":105319,\"start\":105314},{\"end\":105337,\"start\":105331},{\"end\":105339,\"start\":105338},{\"end\":105742,\"start\":105735},{\"end\":105756,\"start\":105751},{\"end\":105771,\"start\":105765},{\"end\":106176,\"start\":106172},{\"end\":106193,\"start\":106185},{\"end\":106214,\"start\":106208},{\"end\":106229,\"start\":106222},{\"end\":106519,\"start\":106514},{\"end\":106521,\"start\":106520},{\"end\":106533,\"start\":106528},{\"end\":106535,\"start\":106534},{\"end\":106820,\"start\":106812},{\"end\":106834,\"start\":106829},{\"end\":106855,\"start\":106849},{\"end\":106868,\"start\":106864},{\"end\":107209,\"start\":107208},{\"end\":107219,\"start\":107212},{\"end\":107233,\"start\":107228},{\"end\":107250,\"start\":107243},{\"end\":107265,\"start\":107259},{\"end\":107279,\"start\":107274},{\"end\":107295,\"start\":107289},{\"end\":107311,\"start\":107303},{\"end\":107329,\"start\":107323},{\"end\":107352,\"start\":107347},{\"end\":107363,\"start\":107358},{\"end\":107377,\"start\":107373},{\"end\":107392,\"start\":107385},{\"end\":107943,\"start\":107938},{\"end\":107957,\"start\":107952},{\"end\":107970,\"start\":107965},{\"end\":107972,\"start\":107971},{\"end\":108237,\"start\":108231},{\"end\":108239,\"start\":108238},{\"end\":108254,\"start\":108248},{\"end\":108270,\"start\":108265},{\"end\":108289,\"start\":108283},{\"end\":108599,\"start\":108592},{\"end\":108614,\"start\":108608},{\"end\":108616,\"start\":108615},{\"end\":108627,\"start\":108624},{\"end\":108637,\"start\":108632},{\"end\":109013,\"start\":109008},{\"end\":109029,\"start\":109023},{\"end\":109044,\"start\":109037},{\"end\":109292,\"start\":109287},{\"end\":109308,\"start\":109302},{\"end\":109310,\"start\":109309},{\"end\":109325,\"start\":109318},{\"end\":109340,\"start\":109335},{\"end\":109356,\"start\":109350},{\"end\":110056,\"start\":110050},{\"end\":110461,\"start\":110454},{\"end\":110475,\"start\":110468},{\"end\":110490,\"start\":110483},{\"end\":110503,\"start\":110499},{\"end\":110792,\"start\":110786},{\"end\":110819,\"start\":110811},{\"end\":110834,\"start\":110828},{\"end\":110845,\"start\":110842},{\"end\":110856,\"start\":110852},{\"end\":110872,\"start\":110867},{\"end\":111152,\"start\":111146},{\"end\":111168,\"start\":111162},{\"end\":111418,\"start\":111414},{\"end\":111434,\"start\":111429},{\"end\":111451,\"start\":111443},{\"end\":111466,\"start\":111462},{\"end\":111480,\"start\":111476},{\"end\":111793,\"start\":111790},{\"end\":112246,\"start\":112243},{\"end\":112259,\"start\":112254},{\"end\":112532,\"start\":112526},{\"end\":112547,\"start\":112543},{\"end\":112562,\"start\":112555},{\"end\":112564,\"start\":112563},{\"end\":112812,\"start\":112805},{\"end\":112830,\"start\":112826},{\"end\":112842,\"start\":112838},{\"end\":112853,\"start\":112849},{\"end\":113131,\"start\":113127},{\"end\":113149,\"start\":113143},{\"end\":113162,\"start\":113157},{\"end\":113176,\"start\":113170},{\"end\":113459,\"start\":113453},{\"end\":113477,\"start\":113470},{\"end\":113493,\"start\":113488},{\"end\":113506,\"start\":113503},{\"end\":113762,\"start\":113754},{\"end\":113777,\"start\":113772},{\"end\":113779,\"start\":113778},{\"end\":113794,\"start\":113789},{\"end\":113810,\"start\":113805},{\"end\":114149,\"start\":114143},{\"end\":114424,\"start\":114418},{\"end\":114671,\"start\":114665},{\"end\":114683,\"start\":114678},{\"end\":114685,\"start\":114684},{\"end\":114704,\"start\":114700},{\"end\":115214,\"start\":115208},{\"end\":115224,\"start\":115221},{\"end\":115462,\"start\":115454},{\"end\":115476,\"start\":115469},{\"end\":115486,\"start\":115481},{\"end\":115505,\"start\":115502},{\"end\":115518,\"start\":115512},{\"end\":115849,\"start\":115843},{\"end\":115865,\"start\":115859},{\"end\":115882,\"start\":115873},{\"end\":115895,\"start\":115888},{\"end\":115907,\"start\":115906},{\"end\":115913,\"start\":115908},{\"end\":116364,\"start\":116360},{\"end\":116378,\"start\":116372},{\"end\":116391,\"start\":116386},{\"end\":116599,\"start\":116593},{\"end\":116615,\"start\":116608},{\"end\":117239,\"start\":117234},{\"end\":117253,\"start\":117248},{\"end\":117265,\"start\":117261},{\"end\":117837,\"start\":117826},{\"end\":117847,\"start\":117844},{\"end\":117862,\"start\":117854},{\"end\":118204,\"start\":118201},{\"end\":118212,\"start\":118209},{\"end\":118223,\"start\":118219},{\"end\":118240,\"start\":118233},{\"end\":118257,\"start\":118249},{\"end\":118656,\"start\":118653}]", "bib_author_last_name": "[{\"end\":85335,\"start\":85329},{\"end\":85350,\"start\":85344},{\"end\":85919,\"start\":85913},{\"end\":85933,\"start\":85926},{\"end\":85949,\"start\":85946},{\"end\":85966,\"start\":85959},{\"end\":85983,\"start\":85977},{\"end\":86004,\"start\":85994},{\"end\":86366,\"start\":86359},{\"end\":86384,\"start\":86378},{\"end\":86398,\"start\":86395},{\"end\":86414,\"start\":86409},{\"end\":86426,\"start\":86421},{\"end\":86826,\"start\":86819},{\"end\":86841,\"start\":86835},{\"end\":86856,\"start\":86848},{\"end\":87115,\"start\":87108},{\"end\":87125,\"start\":87119},{\"end\":87135,\"start\":87129},{\"end\":87634,\"start\":87625},{\"end\":87826,\"start\":87820},{\"end\":87840,\"start\":87833},{\"end\":87860,\"start\":87851},{\"end\":87878,\"start\":87874},{\"end\":88149,\"start\":88144},{\"end\":88165,\"start\":88159},{\"end\":88461,\"start\":88456},{\"end\":88479,\"start\":88475},{\"end\":88483,\"start\":88481},{\"end\":88707,\"start\":88702},{\"end\":88725,\"start\":88717},{\"end\":88740,\"start\":88735},{\"end\":88751,\"start\":88747},{\"end\":88767,\"start\":88763},{\"end\":88780,\"start\":88777},{\"end\":89156,\"start\":89151},{\"end\":89167,\"start\":89165},{\"end\":89176,\"start\":89173},{\"end\":89189,\"start\":89186},{\"end\":89200,\"start\":89196},{\"end\":89521,\"start\":89516},{\"end\":89535,\"start\":89530},{\"end\":89552,\"start\":89544},{\"end\":90213,\"start\":90204},{\"end\":90232,\"start\":90225},{\"end\":90247,\"start\":90240},{\"end\":90265,\"start\":90255},{\"end\":90279,\"start\":90273},{\"end\":91050,\"start\":91028},{\"end\":91063,\"start\":91058},{\"end\":91077,\"start\":91072},{\"end\":91093,\"start\":91084},{\"end\":91108,\"start\":91102},{\"end\":91485,\"start\":91463},{\"end\":91498,\"start\":91493},{\"end\":91512,\"start\":91507},{\"end\":91528,\"start\":91519},{\"end\":91541,\"start\":91535},{\"end\":91894,\"start\":91887},{\"end\":91911,\"start\":91904},{\"end\":91924,\"start\":91918},{\"end\":91941,\"start\":91934},{\"end\":92159,\"start\":92157},{\"end\":92167,\"start\":92165},{\"end\":92181,\"start\":92179},{\"end\":92196,\"start\":92193},{\"end\":92214,\"start\":92205},{\"end\":92642,\"start\":92640},{\"end\":92650,\"start\":92648},{\"end\":92668,\"start\":92659},{\"end\":92686,\"start\":92679},{\"end\":92694,\"start\":92691},{\"end\":92713,\"start\":92706},{\"end\":93118,\"start\":93105},{\"end\":93137,\"start\":93130},{\"end\":93154,\"start\":93145},{\"end\":93483,\"start\":93474},{\"end\":93495,\"start\":93491},{\"end\":93510,\"start\":93503},{\"end\":93525,\"start\":93519},{\"end\":93548,\"start\":93536},{\"end\":93563,\"start\":93558},{\"end\":93902,\"start\":93893},{\"end\":93917,\"start\":93912},{\"end\":93938,\"start\":93929},{\"end\":93955,\"start\":93950},{\"end\":93962,\"start\":93957},{\"end\":94185,\"start\":94175},{\"end\":94199,\"start\":94194},{\"end\":94370,\"start\":94366},{\"end\":94382,\"start\":94376},{\"end\":94391,\"start\":94386},{\"end\":94405,\"start\":94401},{\"end\":94412,\"start\":94407},{\"end\":94700,\"start\":94694},{\"end\":94831,\"start\":94825},{\"end\":94846,\"start\":94841},{\"end\":94863,\"start\":94855},{\"end\":94879,\"start\":94871},{\"end\":95349,\"start\":95345},{\"end\":95363,\"start\":95356},{\"end\":95379,\"start\":95373},{\"end\":95612,\"start\":95610},{\"end\":95627,\"start\":95619},{\"end\":95639,\"start\":95637},{\"end\":95647,\"start\":95644},{\"end\":95660,\"start\":95656},{\"end\":95683,\"start\":95671},{\"end\":95697,\"start\":95691},{\"end\":96146,\"start\":96144},{\"end\":96161,\"start\":96158},{\"end\":96179,\"start\":96170},{\"end\":96199,\"start\":96190},{\"end\":96210,\"start\":96203},{\"end\":96226,\"start\":96219},{\"end\":96238,\"start\":96236},{\"end\":96252,\"start\":96249},{\"end\":96261,\"start\":96254},{\"end\":96725,\"start\":96721},{\"end\":96743,\"start\":96733},{\"end\":96758,\"start\":96753},{\"end\":97128,\"start\":97120},{\"end\":97142,\"start\":97136},{\"end\":97146,\"start\":97144},{\"end\":97295,\"start\":97285},{\"end\":97309,\"start\":97303},{\"end\":97724,\"start\":97722},{\"end\":97734,\"start\":97730},{\"end\":97748,\"start\":97744},{\"end\":97758,\"start\":97755},{\"end\":97770,\"start\":97766},{\"end\":97786,\"start\":97779},{\"end\":98163,\"start\":98161},{\"end\":98178,\"start\":98172},{\"end\":98192,\"start\":98186},{\"end\":98221,\"start\":98203},{\"end\":98237,\"start\":98231},{\"end\":98253,\"start\":98248},{\"end\":98273,\"start\":98264},{\"end\":98673,\"start\":98671},{\"end\":98691,\"start\":98683},{\"end\":98708,\"start\":98699},{\"end\":98726,\"start\":98718},{\"end\":98739,\"start\":98734},{\"end\":98756,\"start\":98749},{\"end\":98773,\"start\":98768},{\"end\":98790,\"start\":98783},{\"end\":99135,\"start\":99133},{\"end\":99152,\"start\":99145},{\"end\":99169,\"start\":99164},{\"end\":99491,\"start\":99489},{\"end\":99505,\"start\":99498},{\"end\":99521,\"start\":99513},{\"end\":99538,\"start\":99532},{\"end\":99837,\"start\":99835},{\"end\":99852,\"start\":99845},{\"end\":99866,\"start\":99860},{\"end\":99883,\"start\":99875},{\"end\":100232,\"start\":100230},{\"end\":100243,\"start\":100241},{\"end\":100257,\"start\":100250},{\"end\":100275,\"start\":100266},{\"end\":100293,\"start\":100285},{\"end\":100646,\"start\":100641},{\"end\":100656,\"start\":100653},{\"end\":100672,\"start\":100666},{\"end\":101276,\"start\":101272},{\"end\":101287,\"start\":101284},{\"end\":101296,\"start\":101289},{\"end\":101525,\"start\":101522},{\"end\":101542,\"start\":101534},{\"end\":101564,\"start\":101552},{\"end\":101580,\"start\":101575},{\"end\":101866,\"start\":101863},{\"end\":101882,\"start\":101875},{\"end\":101898,\"start\":101893},{\"end\":102189,\"start\":102187},{\"end\":102204,\"start\":102198},{\"end\":102233,\"start\":102215},{\"end\":102249,\"start\":102242},{\"end\":102269,\"start\":102260},{\"end\":102571,\"start\":102569},{\"end\":102583,\"start\":102578},{\"end\":102603,\"start\":102594},{\"end\":102632,\"start\":102614},{\"end\":102917,\"start\":102910},{\"end\":102928,\"start\":102921},{\"end\":102938,\"start\":102932},{\"end\":102951,\"start\":102942},{\"end\":102962,\"start\":102955},{\"end\":102971,\"start\":102968},{\"end\":103594,\"start\":103587},{\"end\":103611,\"start\":103605},{\"end\":103632,\"start\":103623},{\"end\":104187,\"start\":104181},{\"end\":104210,\"start\":104198},{\"end\":104226,\"start\":104218},{\"end\":104240,\"start\":104235},{\"end\":104556,\"start\":104548},{\"end\":104573,\"start\":104565},{\"end\":104588,\"start\":104581},{\"end\":104598,\"start\":104594},{\"end\":104836,\"start\":104830},{\"end\":104847,\"start\":104840},{\"end\":104863,\"start\":104851},{\"end\":104873,\"start\":104867},{\"end\":104884,\"start\":104877},{\"end\":104896,\"start\":104890},{\"end\":104909,\"start\":104900},{\"end\":105205,\"start\":105199},{\"end\":105222,\"start\":105214},{\"end\":105237,\"start\":105230},{\"end\":105257,\"start\":105246},{\"end\":105280,\"start\":105268},{\"end\":105294,\"start\":105288},{\"end\":105312,\"start\":105305},{\"end\":105329,\"start\":105320},{\"end\":105346,\"start\":105340},{\"end\":105749,\"start\":105743},{\"end\":105763,\"start\":105757},{\"end\":105778,\"start\":105772},{\"end\":106183,\"start\":106177},{\"end\":106206,\"start\":106194},{\"end\":106220,\"start\":106215},{\"end\":106234,\"start\":106230},{\"end\":106526,\"start\":106522},{\"end\":106543,\"start\":106536},{\"end\":106827,\"start\":106821},{\"end\":106847,\"start\":106835},{\"end\":106862,\"start\":106856},{\"end\":106877,\"start\":106869},{\"end\":107226,\"start\":107220},{\"end\":107241,\"start\":107234},{\"end\":107257,\"start\":107251},{\"end\":107272,\"start\":107266},{\"end\":107287,\"start\":107280},{\"end\":107301,\"start\":107296},{\"end\":107321,\"start\":107312},{\"end\":107345,\"start\":107330},{\"end\":107356,\"start\":107353},{\"end\":107371,\"start\":107364},{\"end\":107383,\"start\":107378},{\"end\":107400,\"start\":107393},{\"end\":107950,\"start\":107944},{\"end\":107963,\"start\":107958},{\"end\":107985,\"start\":107973},{\"end\":108246,\"start\":108240},{\"end\":108263,\"start\":108255},{\"end\":108281,\"start\":108271},{\"end\":108295,\"start\":108290},{\"end\":108606,\"start\":108600},{\"end\":108622,\"start\":108617},{\"end\":108630,\"start\":108628},{\"end\":108644,\"start\":108638},{\"end\":109021,\"start\":109014},{\"end\":109035,\"start\":109030},{\"end\":109052,\"start\":109045},{\"end\":109300,\"start\":109293},{\"end\":109316,\"start\":109311},{\"end\":109333,\"start\":109326},{\"end\":109348,\"start\":109341},{\"end\":109363,\"start\":109357},{\"end\":110063,\"start\":110057},{\"end\":110466,\"start\":110462},{\"end\":110481,\"start\":110476},{\"end\":110497,\"start\":110491},{\"end\":110507,\"start\":110504},{\"end\":110809,\"start\":110793},{\"end\":110826,\"start\":110820},{\"end\":110840,\"start\":110835},{\"end\":110850,\"start\":110846},{\"end\":110865,\"start\":110857},{\"end\":110882,\"start\":110873},{\"end\":111160,\"start\":111153},{\"end\":111172,\"start\":111169},{\"end\":111427,\"start\":111419},{\"end\":111441,\"start\":111435},{\"end\":111460,\"start\":111452},{\"end\":111474,\"start\":111467},{\"end\":111487,\"start\":111481},{\"end\":111799,\"start\":111794},{\"end\":111816,\"start\":111801},{\"end\":112252,\"start\":112247},{\"end\":112268,\"start\":112260},{\"end\":112541,\"start\":112533},{\"end\":112553,\"start\":112548},{\"end\":112574,\"start\":112565},{\"end\":112824,\"start\":112813},{\"end\":112836,\"start\":112831},{\"end\":112847,\"start\":112843},{\"end\":112863,\"start\":112854},{\"end\":113141,\"start\":113132},{\"end\":113155,\"start\":113150},{\"end\":113168,\"start\":113163},{\"end\":113186,\"start\":113177},{\"end\":113468,\"start\":113460},{\"end\":113486,\"start\":113478},{\"end\":113501,\"start\":113494},{\"end\":113511,\"start\":113507},{\"end\":113770,\"start\":113763},{\"end\":113787,\"start\":113780},{\"end\":113803,\"start\":113795},{\"end\":113819,\"start\":113811},{\"end\":114154,\"start\":114150},{\"end\":114429,\"start\":114425},{\"end\":114676,\"start\":114672},{\"end\":114698,\"start\":114686},{\"end\":114716,\"start\":114705},{\"end\":115219,\"start\":115215},{\"end\":115229,\"start\":115225},{\"end\":115467,\"start\":115463},{\"end\":115479,\"start\":115477},{\"end\":115500,\"start\":115487},{\"end\":115510,\"start\":115506},{\"end\":115523,\"start\":115519},{\"end\":115857,\"start\":115850},{\"end\":115871,\"start\":115866},{\"end\":115886,\"start\":115883},{\"end\":115904,\"start\":115896},{\"end\":115917,\"start\":115914},{\"end\":116370,\"start\":116365},{\"end\":116384,\"start\":116379},{\"end\":116399,\"start\":116392},{\"end\":116606,\"start\":116600},{\"end\":116620,\"start\":116616},{\"end\":117246,\"start\":117240},{\"end\":117259,\"start\":117254},{\"end\":117270,\"start\":117266},{\"end\":117842,\"start\":117838},{\"end\":117852,\"start\":117848},{\"end\":117866,\"start\":117863},{\"end\":118207,\"start\":118205},{\"end\":118217,\"start\":118213},{\"end\":118231,\"start\":118224},{\"end\":118247,\"start\":118241},{\"end\":118265,\"start\":118258},{\"end\":118663,\"start\":118657}]", "bib_entry": "[{\"attributes\":{\"id\":\"b0\",\"matched_paper_id\":326544},\"end\":85841,\"start\":85290},{\"attributes\":{\"id\":\"b1\",\"matched_paper_id\":15260194},\"end\":86278,\"start\":85843},{\"attributes\":{\"doi\":\"10.1145/2601097.2601116\",\"id\":\"b2\",\"matched_paper_id\":236955776},\"end\":86736,\"start\":86280},{\"attributes\":{\"id\":\"b3\",\"matched_paper_id\":5632716},\"end\":87056,\"start\":86738},{\"attributes\":{\"id\":\"b4\",\"matched_paper_id\":6206151},\"end\":87585,\"start\":87058},{\"attributes\":{\"id\":\"b5\"},\"end\":87777,\"start\":87587},{\"attributes\":{\"id\":\"b6\",\"matched_paper_id\":13901713},\"end\":88076,\"start\":87779},{\"attributes\":{\"id\":\"b7\",\"matched_paper_id\":54146119},\"end\":88421,\"start\":88078},{\"attributes\":{\"id\":\"b8\",\"matched_paper_id\":12501863},\"end\":88621,\"start\":88423},{\"attributes\":{\"id\":\"b9\",\"matched_paper_id\":209414677},\"end\":89052,\"start\":88623},{\"attributes\":{\"id\":\"b10\"},\"end\":89443,\"start\":89054},{\"attributes\":{\"id\":\"b11\",\"matched_paper_id\":22710918},\"end\":90099,\"start\":89445},{\"attributes\":{\"doi\":\"10.1109/HUMANOIDS.2016.7803330\",\"id\":\"b12\",\"matched_paper_id\":23119046},\"end\":90712,\"start\":90101},{\"attributes\":{\"id\":\"b13\"},\"end\":90959,\"start\":90714},{\"attributes\":{\"id\":\"b14\",\"matched_paper_id\":54091129},\"end\":91394,\"start\":90961},{\"attributes\":{\"id\":\"b15\",\"matched_paper_id\":54091129},\"end\":91816,\"start\":91396},{\"attributes\":{\"id\":\"b16\",\"matched_paper_id\":5763832},\"end\":92151,\"start\":91818},{\"attributes\":{\"doi\":\"10.1145/3490168\",\"id\":\"b17\"},\"end\":92558,\"start\":92153},{\"attributes\":{\"doi\":\"10.1145/3414685.3417795\",\"id\":\"b18\",\"matched_paper_id\":221652009},\"end\":93026,\"start\":92560},{\"attributes\":{\"id\":\"b19\",\"matched_paper_id\":13446255},\"end\":93375,\"start\":93028},{\"attributes\":{\"id\":\"b20\",\"matched_paper_id\":220302161},\"end\":93855,\"start\":93377},{\"attributes\":{\"id\":\"b21\",\"matched_paper_id\":207194165},\"end\":94168,\"start\":93857},{\"attributes\":{\"id\":\"b22\"},\"end\":94292,\"start\":94170},{\"attributes\":{\"id\":\"b23\",\"matched_paper_id\":202741480},\"end\":94635,\"start\":94294},{\"attributes\":{\"id\":\"b24\"},\"end\":94772,\"start\":94637},{\"attributes\":{\"id\":\"b25\",\"matched_paper_id\":3153369},\"end\":95281,\"start\":94774},{\"attributes\":{\"id\":\"b26\",\"matched_paper_id\":209334533},\"end\":95599,\"start\":95283},{\"attributes\":{\"id\":\"b27\"},\"end\":96056,\"start\":95601},{\"attributes\":{\"id\":\"b28\",\"matched_paper_id\":52911940},\"end\":96630,\"start\":96058},{\"attributes\":{\"id\":\"b29\"},\"end\":96909,\"start\":96632},{\"attributes\":{\"id\":\"b30\"},\"end\":97072,\"start\":96911},{\"attributes\":{\"doi\":\"arXiv:1412.6980\",\"id\":\"b31\"},\"end\":97274,\"start\":97074},{\"attributes\":{\"doi\":\"10.1145/3203203\",\"id\":\"b32\"},\"end\":97581,\"start\":97276},{\"attributes\":{\"id\":\"b33\",\"matched_paper_id\":229144344},\"end\":98086,\"start\":97583},{\"attributes\":{\"id\":\"b34\",\"matched_paper_id\":51875045},\"end\":98569,\"start\":98088},{\"attributes\":{\"id\":\"b35\",\"matched_paper_id\":218610947},\"end\":99121,\"start\":98571},{\"attributes\":{\"id\":\"b36\"},\"end\":99412,\"start\":99123},{\"attributes\":{\"id\":\"b37\",\"matched_paper_id\":207568381},\"end\":99763,\"start\":99414},{\"attributes\":{\"id\":\"b38\",\"matched_paper_id\":52839714},\"end\":100131,\"start\":99765},{\"attributes\":{\"id\":\"b39\",\"matched_paper_id\":52917627},\"end\":100577,\"start\":100133},{\"attributes\":{\"id\":\"b40\",\"matched_paper_id\":202780283},\"end\":101204,\"start\":100579},{\"attributes\":{\"id\":\"b41\",\"matched_paper_id\":5681609},\"end\":101471,\"start\":101206},{\"attributes\":{\"id\":\"b42\",\"matched_paper_id\":2636678},\"end\":101779,\"start\":101473},{\"attributes\":{\"id\":\"b43\",\"matched_paper_id\":19463977},\"end\":102121,\"start\":101781},{\"attributes\":{\"id\":\"b44\",\"matched_paper_id\":54162598},\"end\":102510,\"start\":102123},{\"attributes\":{\"id\":\"b45\",\"matched_paper_id\":218939028},\"end\":102864,\"start\":102512},{\"attributes\":{\"id\":\"b46\",\"matched_paper_id\":227121260},\"end\":103512,\"start\":102866},{\"attributes\":{\"id\":\"b47\",\"matched_paper_id\":4633463},\"end\":104136,\"start\":103514},{\"attributes\":{\"doi\":\"10.1145/2010324.1964967\",\"id\":\"b48\",\"matched_paper_id\":12590968},\"end\":104498,\"start\":104138},{\"attributes\":{\"id\":\"b49\",\"matched_paper_id\":7303918},\"end\":104775,\"start\":104500},{\"attributes\":{\"id\":\"b50\",\"matched_paper_id\":1386427},\"end\":105137,\"start\":104777},{\"attributes\":{\"id\":\"b51\",\"matched_paper_id\":17611675},\"end\":105651,\"start\":105139},{\"attributes\":{\"doi\":\"10.1109/ROBOT.2010.5509646\",\"id\":\"b52\",\"matched_paper_id\":206545729},\"end\":106126,\"start\":105653},{\"attributes\":{\"id\":\"b53\",\"matched_paper_id\":221105077},\"end\":106452,\"start\":106128},{\"attributes\":{\"doi\":\"10.1145/192115.192132\",\"id\":\"b54\",\"matched_paper_id\":207184388},\"end\":106785,\"start\":106454},{\"attributes\":{\"id\":\"b55\",\"matched_paper_id\":6159986},\"end\":107075,\"start\":106787},{\"attributes\":{\"id\":\"b56\",\"matched_paper_id\":233033848},\"end\":107883,\"start\":107077},{\"attributes\":{\"id\":\"b57\",\"matched_paper_id\":2749951},\"end\":108179,\"start\":107885},{\"attributes\":{\"id\":\"b58\",\"matched_paper_id\":655791},\"end\":108497,\"start\":108181},{\"attributes\":{\"id\":\"b59\",\"matched_paper_id\":28057059},\"end\":108950,\"start\":108499},{\"attributes\":{\"id\":\"b60\",\"matched_paper_id\":207647967},\"end\":109233,\"start\":108952},{\"attributes\":{\"doi\":\"10.1145/344779.344880\",\"id\":\"b61\",\"matched_paper_id\":7044194},\"end\":109965,\"start\":109235},{\"attributes\":{\"id\":\"b62\",\"matched_paper_id\":7421415},\"end\":110394,\"start\":109967},{\"attributes\":{\"id\":\"b63\",\"matched_paper_id\":220361704},\"end\":110726,\"start\":110396},{\"attributes\":{\"id\":\"b64\",\"matched_paper_id\":211252550},\"end\":111144,\"start\":110728},{\"attributes\":{\"id\":\"b65\"},\"end\":111412,\"start\":111146},{\"attributes\":{\"doi\":\"arXiv:1707.06347\",\"id\":\"b66\"},\"end\":111725,\"start\":111414},{\"attributes\":{\"id\":\"b67\",\"matched_paper_id\":2179227},\"end\":112167,\"start\":111727},{\"attributes\":{\"id\":\"b68\",\"matched_paper_id\":14090027},\"end\":112471,\"start\":112169},{\"attributes\":{\"id\":\"b69\",\"matched_paper_id\":17134507},\"end\":112772,\"start\":112473},{\"attributes\":{\"id\":\"b70\",\"matched_paper_id\":52800005},\"end\":113045,\"start\":112774},{\"attributes\":{\"id\":\"b71\",\"matched_paper_id\":46980516},\"end\":113412,\"start\":113047},{\"attributes\":{\"id\":\"b72\",\"matched_paper_id\":129235},\"end\":113688,\"start\":113414},{\"attributes\":{\"id\":\"b73\",\"matched_paper_id\":1325695},\"end\":114048,\"start\":113690},{\"attributes\":{\"id\":\"b74\",\"matched_paper_id\":14068248},\"end\":114349,\"start\":114050},{\"attributes\":{\"id\":\"b75\",\"matched_paper_id\":51879626},\"end\":114599,\"start\":114351},{\"attributes\":{\"id\":\"b76\",\"matched_paper_id\":4370381},\"end\":115150,\"start\":114601},{\"attributes\":{\"id\":\"b77\",\"matched_paper_id\":17747035},\"end\":115401,\"start\":115152},{\"attributes\":{\"id\":\"b78\",\"matched_paper_id\":53080370},\"end\":115730,\"start\":115403},{\"attributes\":{\"doi\":\"10.15607/RSS.2021.XVII.034\",\"id\":\"b79\",\"matched_paper_id\":236151202},\"end\":116318,\"start\":115732},{\"attributes\":{\"id\":\"b80\",\"matched_paper_id\":13956666},\"end\":116568,\"start\":116320},{\"attributes\":{\"doi\":\"10.1145/54852.378507\",\"id\":\"b81\",\"matched_paper_id\":2887054},\"end\":117161,\"start\":116570},{\"attributes\":{\"id\":\"b82\",\"matched_paper_id\":14077908},\"end\":117739,\"start\":117163},{\"attributes\":{\"id\":\"b83\",\"matched_paper_id\":207997791},\"end\":118086,\"start\":117741},{\"attributes\":{\"doi\":\"10.15607/RSS.2021.XVII.008\",\"id\":\"b84\",\"matched_paper_id\":235651322},\"end\":118649,\"start\":118088},{\"attributes\":{\"id\":\"b85\"},\"end\":118727,\"start\":118651}]", "bib_title": "[{\"end\":85321,\"start\":85290},{\"end\":85906,\"start\":85843},{\"end\":86350,\"start\":86280},{\"end\":86810,\"start\":86738},{\"end\":87104,\"start\":87058},{\"end\":87813,\"start\":87779},{\"end\":88133,\"start\":88078},{\"end\":88450,\"start\":88423},{\"end\":88690,\"start\":88623},{\"end\":89139,\"start\":89054},{\"end\":89508,\"start\":89445},{\"end\":90192,\"start\":90101},{\"end\":91019,\"start\":90961},{\"end\":91454,\"start\":91396},{\"end\":91879,\"start\":91818},{\"end\":92634,\"start\":92560},{\"end\":93097,\"start\":93028},{\"end\":93465,\"start\":93377},{\"end\":93883,\"start\":93857},{\"end\":94358,\"start\":94294},{\"end\":94817,\"start\":94774},{\"end\":95335,\"start\":95283},{\"end\":96133,\"start\":96058},{\"end\":97714,\"start\":97583},{\"end\":98155,\"start\":98088},{\"end\":98661,\"start\":98571},{\"end\":99479,\"start\":99414},{\"end\":99825,\"start\":99765},{\"end\":100221,\"start\":100133},{\"end\":100631,\"start\":100579},{\"end\":101268,\"start\":101206},{\"end\":101511,\"start\":101473},{\"end\":101852,\"start\":101781},{\"end\":102177,\"start\":102123},{\"end\":102559,\"start\":102512},{\"end\":102906,\"start\":102866},{\"end\":103579,\"start\":103514},{\"end\":104169,\"start\":104138},{\"end\":104538,\"start\":104500},{\"end\":104826,\"start\":104777},{\"end\":105192,\"start\":105139},{\"end\":105733,\"start\":105653},{\"end\":106170,\"start\":106128},{\"end\":106512,\"start\":106454},{\"end\":106810,\"start\":106787},{\"end\":107206,\"start\":107077},{\"end\":107936,\"start\":107885},{\"end\":108229,\"start\":108181},{\"end\":108590,\"start\":108499},{\"end\":109006,\"start\":108952},{\"end\":109285,\"start\":109235},{\"end\":110048,\"start\":109967},{\"end\":110452,\"start\":110396},{\"end\":110784,\"start\":110728},{\"end\":111788,\"start\":111727},{\"end\":112241,\"start\":112169},{\"end\":112524,\"start\":112473},{\"end\":112803,\"start\":112774},{\"end\":113125,\"start\":113047},{\"end\":113451,\"start\":113414},{\"end\":113752,\"start\":113690},{\"end\":114141,\"start\":114050},{\"end\":114416,\"start\":114351},{\"end\":114663,\"start\":114601},{\"end\":115206,\"start\":115152},{\"end\":115452,\"start\":115403},{\"end\":115841,\"start\":115732},{\"end\":116358,\"start\":116320},{\"end\":116591,\"start\":116570},{\"end\":117232,\"start\":117163},{\"end\":117824,\"start\":117741},{\"end\":118199,\"start\":118088}]", "bib_author": "[{\"end\":85337,\"start\":85323},{\"end\":85352,\"start\":85337},{\"end\":85921,\"start\":85908},{\"end\":85935,\"start\":85921},{\"end\":85951,\"start\":85935},{\"end\":85968,\"start\":85951},{\"end\":85985,\"start\":85968},{\"end\":86006,\"start\":85985},{\"end\":86368,\"start\":86352},{\"end\":86386,\"start\":86368},{\"end\":86400,\"start\":86386},{\"end\":86416,\"start\":86400},{\"end\":86428,\"start\":86416},{\"end\":86828,\"start\":86812},{\"end\":86843,\"start\":86828},{\"end\":86858,\"start\":86843},{\"end\":87117,\"start\":87106},{\"end\":87127,\"start\":87117},{\"end\":87137,\"start\":87127},{\"end\":87636,\"start\":87617},{\"end\":87828,\"start\":87815},{\"end\":87842,\"start\":87828},{\"end\":87862,\"start\":87842},{\"end\":87880,\"start\":87862},{\"end\":88151,\"start\":88135},{\"end\":88167,\"start\":88151},{\"end\":88463,\"start\":88452},{\"end\":88481,\"start\":88463},{\"end\":88485,\"start\":88481},{\"end\":88709,\"start\":88692},{\"end\":88727,\"start\":88709},{\"end\":88742,\"start\":88727},{\"end\":88753,\"start\":88742},{\"end\":88769,\"start\":88753},{\"end\":88782,\"start\":88769},{\"end\":89158,\"start\":89141},{\"end\":89169,\"start\":89158},{\"end\":89178,\"start\":89169},{\"end\":89191,\"start\":89178},{\"end\":89202,\"start\":89191},{\"end\":89523,\"start\":89510},{\"end\":89537,\"start\":89523},{\"end\":89554,\"start\":89537},{\"end\":90198,\"start\":90194},{\"end\":90215,\"start\":90198},{\"end\":90234,\"start\":90215},{\"end\":90249,\"start\":90234},{\"end\":90267,\"start\":90249},{\"end\":90281,\"start\":90267},{\"end\":91052,\"start\":91021},{\"end\":91065,\"start\":91052},{\"end\":91079,\"start\":91065},{\"end\":91095,\"start\":91079},{\"end\":91110,\"start\":91095},{\"end\":91487,\"start\":91456},{\"end\":91500,\"start\":91487},{\"end\":91514,\"start\":91500},{\"end\":91530,\"start\":91514},{\"end\":91543,\"start\":91530},{\"end\":91896,\"start\":91881},{\"end\":91913,\"start\":91896},{\"end\":91926,\"start\":91913},{\"end\":91943,\"start\":91926},{\"end\":92161,\"start\":92153},{\"end\":92169,\"start\":92161},{\"end\":92183,\"start\":92169},{\"end\":92198,\"start\":92183},{\"end\":92216,\"start\":92198},{\"end\":92644,\"start\":92636},{\"end\":92652,\"start\":92644},{\"end\":92670,\"start\":92652},{\"end\":92688,\"start\":92670},{\"end\":92696,\"start\":92688},{\"end\":92715,\"start\":92696},{\"end\":93120,\"start\":93099},{\"end\":93139,\"start\":93120},{\"end\":93156,\"start\":93139},{\"end\":93485,\"start\":93467},{\"end\":93497,\"start\":93485},{\"end\":93512,\"start\":93497},{\"end\":93527,\"start\":93512},{\"end\":93550,\"start\":93527},{\"end\":93565,\"start\":93550},{\"end\":93904,\"start\":93885},{\"end\":93919,\"start\":93904},{\"end\":93940,\"start\":93919},{\"end\":93957,\"start\":93940},{\"end\":93964,\"start\":93957},{\"end\":94187,\"start\":94170},{\"end\":94201,\"start\":94187},{\"end\":94372,\"start\":94360},{\"end\":94384,\"start\":94372},{\"end\":94393,\"start\":94384},{\"end\":94407,\"start\":94393},{\"end\":94414,\"start\":94407},{\"end\":94702,\"start\":94685},{\"end\":94833,\"start\":94819},{\"end\":94848,\"start\":94833},{\"end\":94865,\"start\":94848},{\"end\":94881,\"start\":94865},{\"end\":95351,\"start\":95337},{\"end\":95365,\"start\":95351},{\"end\":95381,\"start\":95365},{\"end\":95614,\"start\":95601},{\"end\":95629,\"start\":95614},{\"end\":95641,\"start\":95629},{\"end\":95649,\"start\":95641},{\"end\":95662,\"start\":95649},{\"end\":95685,\"start\":95662},{\"end\":95699,\"start\":95685},{\"end\":96148,\"start\":96135},{\"end\":96163,\"start\":96148},{\"end\":96181,\"start\":96163},{\"end\":96201,\"start\":96181},{\"end\":96212,\"start\":96201},{\"end\":96228,\"start\":96212},{\"end\":96240,\"start\":96228},{\"end\":96254,\"start\":96240},{\"end\":96263,\"start\":96254},{\"end\":96727,\"start\":96714},{\"end\":96745,\"start\":96727},{\"end\":96760,\"start\":96745},{\"end\":97130,\"start\":97118},{\"end\":97144,\"start\":97130},{\"end\":97148,\"start\":97144},{\"end\":97297,\"start\":97278},{\"end\":97311,\"start\":97297},{\"end\":97726,\"start\":97716},{\"end\":97736,\"start\":97726},{\"end\":97750,\"start\":97736},{\"end\":97760,\"start\":97750},{\"end\":97772,\"start\":97760},{\"end\":97788,\"start\":97772},{\"end\":98165,\"start\":98157},{\"end\":98180,\"start\":98165},{\"end\":98194,\"start\":98180},{\"end\":98223,\"start\":98194},{\"end\":98239,\"start\":98223},{\"end\":98255,\"start\":98239},{\"end\":98275,\"start\":98255},{\"end\":98675,\"start\":98663},{\"end\":98693,\"start\":98675},{\"end\":98710,\"start\":98693},{\"end\":98728,\"start\":98710},{\"end\":98741,\"start\":98728},{\"end\":98758,\"start\":98741},{\"end\":98775,\"start\":98758},{\"end\":98792,\"start\":98775},{\"end\":99137,\"start\":99125},{\"end\":99154,\"start\":99137},{\"end\":99171,\"start\":99154},{\"end\":99493,\"start\":99481},{\"end\":99507,\"start\":99493},{\"end\":99523,\"start\":99507},{\"end\":99540,\"start\":99523},{\"end\":99839,\"start\":99827},{\"end\":99854,\"start\":99839},{\"end\":99868,\"start\":99854},{\"end\":99885,\"start\":99868},{\"end\":100234,\"start\":100223},{\"end\":100245,\"start\":100234},{\"end\":100259,\"start\":100245},{\"end\":100277,\"start\":100259},{\"end\":100295,\"start\":100277},{\"end\":100648,\"start\":100633},{\"end\":100658,\"start\":100648},{\"end\":100674,\"start\":100658},{\"end\":101278,\"start\":101270},{\"end\":101289,\"start\":101278},{\"end\":101298,\"start\":101289},{\"end\":101527,\"start\":101513},{\"end\":101544,\"start\":101527},{\"end\":101566,\"start\":101544},{\"end\":101582,\"start\":101566},{\"end\":101868,\"start\":101854},{\"end\":101884,\"start\":101868},{\"end\":101900,\"start\":101884},{\"end\":102191,\"start\":102179},{\"end\":102206,\"start\":102191},{\"end\":102235,\"start\":102206},{\"end\":102251,\"start\":102235},{\"end\":102271,\"start\":102251},{\"end\":102573,\"start\":102561},{\"end\":102585,\"start\":102573},{\"end\":102605,\"start\":102585},{\"end\":102634,\"start\":102605},{\"end\":102919,\"start\":102908},{\"end\":102930,\"start\":102919},{\"end\":102940,\"start\":102930},{\"end\":102953,\"start\":102940},{\"end\":102964,\"start\":102953},{\"end\":102973,\"start\":102964},{\"end\":103596,\"start\":103581},{\"end\":103613,\"start\":103596},{\"end\":103634,\"start\":103613},{\"end\":104189,\"start\":104171},{\"end\":104212,\"start\":104189},{\"end\":104228,\"start\":104212},{\"end\":104242,\"start\":104228},{\"end\":104558,\"start\":104540},{\"end\":104575,\"start\":104558},{\"end\":104590,\"start\":104575},{\"end\":104600,\"start\":104590},{\"end\":104838,\"start\":104828},{\"end\":104849,\"start\":104838},{\"end\":104865,\"start\":104849},{\"end\":104875,\"start\":104865},{\"end\":104886,\"start\":104875},{\"end\":104898,\"start\":104886},{\"end\":104911,\"start\":104898},{\"end\":105207,\"start\":105194},{\"end\":105224,\"start\":105207},{\"end\":105239,\"start\":105224},{\"end\":105259,\"start\":105239},{\"end\":105282,\"start\":105259},{\"end\":105296,\"start\":105282},{\"end\":105314,\"start\":105296},{\"end\":105331,\"start\":105314},{\"end\":105348,\"start\":105331},{\"end\":105751,\"start\":105735},{\"end\":105765,\"start\":105751},{\"end\":105780,\"start\":105765},{\"end\":106185,\"start\":106172},{\"end\":106208,\"start\":106185},{\"end\":106222,\"start\":106208},{\"end\":106236,\"start\":106222},{\"end\":106528,\"start\":106514},{\"end\":106545,\"start\":106528},{\"end\":106829,\"start\":106812},{\"end\":106849,\"start\":106829},{\"end\":106864,\"start\":106849},{\"end\":106879,\"start\":106864},{\"end\":107212,\"start\":107208},{\"end\":107228,\"start\":107212},{\"end\":107243,\"start\":107228},{\"end\":107259,\"start\":107243},{\"end\":107274,\"start\":107259},{\"end\":107289,\"start\":107274},{\"end\":107303,\"start\":107289},{\"end\":107323,\"start\":107303},{\"end\":107347,\"start\":107323},{\"end\":107358,\"start\":107347},{\"end\":107373,\"start\":107358},{\"end\":107385,\"start\":107373},{\"end\":107402,\"start\":107385},{\"end\":107952,\"start\":107938},{\"end\":107965,\"start\":107952},{\"end\":107987,\"start\":107965},{\"end\":108248,\"start\":108231},{\"end\":108265,\"start\":108248},{\"end\":108283,\"start\":108265},{\"end\":108297,\"start\":108283},{\"end\":108608,\"start\":108592},{\"end\":108624,\"start\":108608},{\"end\":108632,\"start\":108624},{\"end\":108646,\"start\":108632},{\"end\":109023,\"start\":109008},{\"end\":109037,\"start\":109023},{\"end\":109054,\"start\":109037},{\"end\":109302,\"start\":109287},{\"end\":109318,\"start\":109302},{\"end\":109335,\"start\":109318},{\"end\":109350,\"start\":109335},{\"end\":109365,\"start\":109350},{\"end\":110065,\"start\":110050},{\"end\":110468,\"start\":110454},{\"end\":110483,\"start\":110468},{\"end\":110499,\"start\":110483},{\"end\":110509,\"start\":110499},{\"end\":110811,\"start\":110786},{\"end\":110828,\"start\":110811},{\"end\":110842,\"start\":110828},{\"end\":110852,\"start\":110842},{\"end\":110867,\"start\":110852},{\"end\":110884,\"start\":110867},{\"end\":111162,\"start\":111146},{\"end\":111174,\"start\":111162},{\"end\":111429,\"start\":111414},{\"end\":111443,\"start\":111429},{\"end\":111462,\"start\":111443},{\"end\":111476,\"start\":111462},{\"end\":111489,\"start\":111476},{\"end\":111801,\"start\":111790},{\"end\":111818,\"start\":111801},{\"end\":112254,\"start\":112243},{\"end\":112270,\"start\":112254},{\"end\":112543,\"start\":112526},{\"end\":112555,\"start\":112543},{\"end\":112576,\"start\":112555},{\"end\":112826,\"start\":112805},{\"end\":112838,\"start\":112826},{\"end\":112849,\"start\":112838},{\"end\":112865,\"start\":112849},{\"end\":113143,\"start\":113127},{\"end\":113157,\"start\":113143},{\"end\":113170,\"start\":113157},{\"end\":113188,\"start\":113170},{\"end\":113470,\"start\":113453},{\"end\":113488,\"start\":113470},{\"end\":113503,\"start\":113488},{\"end\":113513,\"start\":113503},{\"end\":113772,\"start\":113754},{\"end\":113789,\"start\":113772},{\"end\":113805,\"start\":113789},{\"end\":113821,\"start\":113805},{\"end\":114156,\"start\":114143},{\"end\":114431,\"start\":114418},{\"end\":114678,\"start\":114665},{\"end\":114700,\"start\":114678},{\"end\":114718,\"start\":114700},{\"end\":115221,\"start\":115208},{\"end\":115231,\"start\":115221},{\"end\":115469,\"start\":115454},{\"end\":115481,\"start\":115469},{\"end\":115502,\"start\":115481},{\"end\":115512,\"start\":115502},{\"end\":115525,\"start\":115512},{\"end\":115859,\"start\":115843},{\"end\":115873,\"start\":115859},{\"end\":115888,\"start\":115873},{\"end\":115906,\"start\":115888},{\"end\":115919,\"start\":115906},{\"end\":116372,\"start\":116360},{\"end\":116386,\"start\":116372},{\"end\":116401,\"start\":116386},{\"end\":116608,\"start\":116593},{\"end\":116622,\"start\":116608},{\"end\":117248,\"start\":117234},{\"end\":117261,\"start\":117248},{\"end\":117272,\"start\":117261},{\"end\":117844,\"start\":117826},{\"end\":117854,\"start\":117844},{\"end\":117868,\"start\":117854},{\"end\":118209,\"start\":118201},{\"end\":118219,\"start\":118209},{\"end\":118233,\"start\":118219},{\"end\":118249,\"start\":118233},{\"end\":118267,\"start\":118249},{\"end\":118665,\"start\":118653}]", "bib_venue": "[{\"end\":85456,\"start\":85352},{\"end\":86022,\"start\":86006},{\"end\":86467,\"start\":86451},{\"end\":86874,\"start\":86858},{\"end\":87218,\"start\":87137},{\"end\":87615,\"start\":87587},{\"end\":87896,\"start\":87880},{\"end\":88183,\"start\":88167},{\"end\":88501,\"start\":88485},{\"end\":88818,\"start\":88782},{\"end\":89218,\"start\":89202},{\"end\":89632,\"start\":89554},{\"end\":90385,\"start\":90311},{\"end\":90784,\"start\":90714},{\"end\":91159,\"start\":91110},{\"end\":91592,\"start\":91543},{\"end\":91969,\"start\":91943},{\"end\":92314,\"start\":92231},{\"end\":92754,\"start\":92738},{\"end\":93172,\"start\":93156},{\"end\":93599,\"start\":93565},{\"end\":93980,\"start\":93964},{\"end\":94209,\"start\":94201},{\"end\":94448,\"start\":94414},{\"end\":94683,\"start\":94637},{\"end\":94905,\"start\":94881},{\"end\":95433,\"start\":95381},{\"end\":95821,\"start\":95699},{\"end\":96326,\"start\":96263},{\"end\":96712,\"start\":96632},{\"end\":96985,\"start\":96911},{\"end\":97116,\"start\":97074},{\"end\":97401,\"start\":97326},{\"end\":97804,\"start\":97788},{\"end\":98291,\"start\":98275},{\"end\":98808,\"start\":98792},{\"end\":99244,\"start\":99171},{\"end\":99556,\"start\":99540},{\"end\":99925,\"start\":99885},{\"end\":100347,\"start\":100295},{\"end\":100723,\"start\":100674},{\"end\":101322,\"start\":101298},{\"end\":101598,\"start\":101582},{\"end\":101934,\"start\":101900},{\"end\":102287,\"start\":102271},{\"end\":102666,\"start\":102634},{\"end\":103084,\"start\":102973},{\"end\":103700,\"start\":103634},{\"end\":104281,\"start\":104265},{\"end\":104616,\"start\":104600},{\"end\":104931,\"start\":104911},{\"end\":105364,\"start\":105348},{\"end\":105867,\"start\":105806},{\"end\":106268,\"start\":106236},{\"end\":106588,\"start\":106566},{\"end\":106909,\"start\":106879},{\"end\":107454,\"start\":107402},{\"end\":108003,\"start\":107987},{\"end\":108320,\"start\":108297},{\"end\":108702,\"start\":108646},{\"end\":109070,\"start\":109054},{\"end\":109490,\"start\":109386},{\"end\":110102,\"start\":110065},{\"end\":110553,\"start\":110509},{\"end\":110928,\"start\":110884},{\"end\":111266,\"start\":111174},{\"end\":111544,\"start\":111505},{\"end\":111843,\"start\":111818},{\"end\":112302,\"start\":112270},{\"end\":112592,\"start\":112576},{\"end\":112887,\"start\":112865},{\"end\":113217,\"start\":113188},{\"end\":113529,\"start\":113513},{\"end\":113837,\"start\":113821},{\"end\":114172,\"start\":114156},{\"end\":114447,\"start\":114431},{\"end\":114742,\"start\":114718},{\"end\":115247,\"start\":115231},{\"end\":115548,\"start\":115525},{\"end\":115989,\"start\":115945},{\"end\":116432,\"start\":116401},{\"end\":116746,\"start\":116642},{\"end\":117354,\"start\":117272},{\"end\":117884,\"start\":117868},{\"end\":118337,\"start\":118293},{\"end\":85564,\"start\":85458},{\"end\":87320,\"start\":87220},{\"end\":89739,\"start\":89634},{\"end\":94949,\"start\":94907},{\"end\":103204,\"start\":103086},{\"end\":103794,\"start\":103702},{\"end\":109584,\"start\":109492},{\"end\":110158,\"start\":110144},{\"end\":111885,\"start\":111845},{\"end\":114798,\"start\":114744},{\"end\":116020,\"start\":115991},{\"end\":116854,\"start\":116748},{\"end\":117451,\"start\":117356},{\"end\":118368,\"start\":118339}]"}}}, "year": 2023, "month": 12, "day": 17}