{"id": 236715448, "updated": "2023-09-22 04:06:59.4", "metadata": {"title": "Intrusion Detection, Measurement Correction, and Attack Localization of PMU Networks", "authors": "[{\"first\":\"Zahra\",\"last\":\"Khalafi\",\"middle\":[\"Sadat\"]},{\"first\":\"Maryam\",\"last\":\"Dehghani\",\"middle\":[]},{\"first\":\"Abdullah\",\"last\":\"Khalili\",\"middle\":[]},{\"first\":\"Ashkan\",\"last\":\"Sami\",\"middle\":[]},{\"first\":\"Navid\",\"last\":\"Vafamand\",\"middle\":[]},{\"first\":\"Tomislav\",\"last\":\"Dragičević\",\"middle\":[]}]", "venue": "IEEE Transactions on Industrial Electronics", "journal": "IEEE Transactions on Industrial Electronics", "publication_date": {"year": 2022, "month": 5, "day": 1}, "abstract": "Accurate state estimation is essential for correct supervision of power grids. With the existence of cyber-attacks, state estimation may become inaccurate, which can eventually lead to wrong supervisory decision making. To detect cyber-attacks in power grids equipped with phasor measurement units (PMUs), a new intrusion detection system based on clustering approach, called PMU Intrusion Detection System (PMUIDS), is proposed in this article. After solving the optimal PMU placement in N-1 contingency, several static state estimations are obtained by removing the measurements of one PMU in each time. The resulting state vectors are clustered in two steps: First, subtractive clustering is employed to obtain the number of clusters, which determines the number of integrity attacks; and second, fuzzy C-means clustering assigns the state vectors to the corresponding clusters, which determines the attacked PMUs. In addition, two theorems are proved, which indicate that the attacker cannot coordinate successful stealth attacks in cases that by removing attacked PMUs from state estimation, the power system still remains full observable. Furthermore, in the case of possible stealth attacks, the attacker cannot falsify the estimation of any arbitrary state variable. The hardware-in-the-loop results on a sample power system show that the proposed approach can detect integrity attacks, determine the number of attacks, obtain the correct state vector, and localize the attacks, even in case of multiple simultaneous attacks.", "fields_of_study": "[\"Computer Science\"]", "external_ids": {"arxiv": null, "mag": "3160036611", "acl": null, "pubmed": null, "pubmedcentral": null, "dblp": "journals/tie/KhalafiDKSVD22", "doi": "10.1109/tie.2021.3080212"}}, "content": {"source": {"pdf_hash": "4493f2c121783913eec99f86ebb147401f635250", "pdf_src": "IEEE", "pdf_uri": null, "oa_url_match": false, "oa_info": {"license": null, "open_access_url": "https://backend.orbit.dtu.dk/ws/files/255766865/HKKR_09436045.pdf", "status": "GREEN"}}, "grobid": {"id": "5ba57383361492a9958cb669a8dbd357e0c5671f", "type": "plain-text", "url": "s3://ai2-s2-pdf-extraction-prod/parse-results/s2orc_worker/4493f2c121783913eec99f86ebb147401f635250.txt", "contents": "\nIntrusion Detection, Measurement Correction, and Attack Localization of PMU Networks\nMAY 2022\n\nZahra Sadat Khalafi z.khalafi@shirazu.ac.ir \nSchool of Electrical and Computer Engineering\nDepartment of Electrical and Computer Engineering\nShiraz University\n71946-84636ShirazIran\n\nSenior Member, IEEEMaryam Dehghani \nSchool of Electrical and Computer Engineering\nDepartment of Electrical and Computer Engineering\nShiraz University\n71946-84636ShirazIran\n\nAbdullah Khalili khalili@hormozgan.ac.ir. \nSchool of Electrical and Computer Engineering\nDepartment of Electrical and Computer Engineering\nShiraz University\n71946-84636ShirazIran\n\nAshkan Sami sami@shirazu.ac.ir \nSchool of Electrical and Computer Engineering\nDepartment of Electrical and Computer Engineering\nShiraz University\n71946-84636ShirazIran\n\nNavid Vafamand n.vafamand@shirazu.ac.ir. \nSchool of Electrical and Computer Engineering\nDepartment of Electrical and Computer Engineering\nShiraz University\n71946-84636ShirazIran\n\nSenior Member, IEEETomislav Dragičević \nSchool of Electrical and Computer Engineering\nDepartment of Electrical and Computer Engineering\nShiraz University\n71946-84636ShirazIran\n\nZahra Sadat Khalafi \nDepartment of Electrical Engineering\nTomislav Dragičević is with the Center for Electric Power and Energy\nUniversity of Hormozgan\n79177Bandar AbbasIran\n\nMaryam Dehghani mdehghani@shirazu.ac.ir \nDepartment of Electrical Engineering\nTomislav Dragičević is with the Center for Electric Power and Energy\nUniversity of Hormozgan\n79177Bandar AbbasIran\n\nAshkan Sami \nDepartment of Electrical Engineering\nTomislav Dragičević is with the Center for Electric Power and Energy\nUniversity of Hormozgan\n79177Bandar AbbasIran\n\nNavid Vafamand \nDepartment of Electrical Engineering\nTomislav Dragičević is with the Center for Electric Power and Energy\nUniversity of Hormozgan\n79177Bandar AbbasIran\n\nAbdullah Khalili \nTechnical University of Denmark\n2800Kongens LyngbyDenmark\n\nIntrusion Detection, Measurement Correction, and Attack Localization of PMU Networks\n\nIEEE TRANSACTIONS ON INDUSTRIAL ELECTRONICS\n6954697MAY 202210.1109/TIE.2021.3080212Manuscript received September 5, 2020; revised January 2, 2021 and April 1, 2021; accepted April 30, 2021. Date of publication May 19, 2021; date of current version January 7, 2022. (Correspsonding author: Navid Vafamand and Maryam Dehghani.)Color versions of one or more figures in this article are available atIndex Terms-Attack localizationintrusion detectionmeasurement correctionPMU networkstatic state estimation\nAccurate state estimation is essential for correct supervision of power grids. With the existence of cyber-attacks, state estimation may become inaccurate, which can eventually lead to wrong supervisory decision making. To detect cyber-attacks in power grids equipped with phasor measurement units (PMUs), a new intrusion detection system based on clustering approach, called PMU Intrusion Detection System (PMUIDS), is proposed in this article. After solving the optimal PMU placement in N-1 contingency, several static state estimations are obtained by removing the measurements of one PMU in each time. The resulting state vectors are clustered in two steps: First, subtractive clustering is employed to obtain the number of clusters, which determines the number of integrity attacks; and second, fuzzy C-means clustering assigns the state vectors to the corresponding clusters, which determines the attacked PMUs. In addition, two theorems are proved, which indicate that the attacker cannot coordinate successful stealth attacks in cases that by removing attacked PMUs from state estimation, the power system still remains full observable. Furthermore, in the case of possible stealth attacks, the attacker cannot falsify the estimation of any arbitrary state variable. The hardware-in-the-loop results on a sample power system show that the proposed approach can detect integrity attacks, determine the number of attacks, obtain the correct state vector, and localize the attacks, even in case of multiple simultaneous attacks.\n\nI. INTRODUCTION\n\nS ECURE state estimation is a challenging issue in future smart grids equipped with Phasor Measurement Units (PMUs) [1]- [5]. The PMU network is based on information technology (IT) networks and protocols that are vulnerable to a variety of cyber-attacks [6]. These attacks may impose false information on the control center, which could lead to false control decisions [7]- [9].\n\nAmong the cyber-attacks, those attacks that make power system state estimation inaccurate are especially dangerous since they can lead to wrong supervisory decision makings. Attacks in this class are usually referred to as false (bad) data injection (or integrity) attacks [10], [11]. Such attacks are usually detected by a number of bad data detection methods [12]- [14], such as sum detector [15], χ 2 detector [16], and learning-based methods [17], [18]. However, these approaches only detect the attack and they fail to localize the attack and present correct measurements. On the other hand, invaders can orchestrate coordinated false data injection attacks (FDIAs) (such as those in [19]- [21]) to make them unobservable by conventional detection methods. Such attacks are called stealth (or interacting) attacks.\n\nTo detect stealth attacks, a number of methods have been proposed in the literature [1], [22]- [25]. It should be noted that in addition to these researches, several methods are available to mitigate the stealth attacks using authentication, multipath routing, or encryption devices. However, they increase the implementation cost and complexity, and also impose additional delay [26], [27].\n\nIn this article, a new intrusion detection system based on clustering techniques, called PMU intrusion detection system (PMUIDS), is proposed, which has some advantages over the previous research works, which are described next. In PMUIDS, first, the optimal PMU placement is employed such that the network remains full observable even if a single contingency happens (observability in N−1 contingency). Then, in each time step, measurements of one PMU are removed and the state vector is calculated. In the next step, the resulting state vectors are clustered. For this purpose, subtractive clustering obtains the number of clusters and, fuzzy C-means (FCM) clustering assigns the state vectors to the correct cluster. The number of one-member clusters indicates the number of integrity attacks. These one-member clusters are also used to determine the attacked PMUs and obtain the correct state vector. In this article, the most related works on stealth attack detection are also reviewed and quantitatively compared with the proposed method. For this purpose, the following properties are checked for each of the algorithms.\n\n1) Obtaining correct measurement (OCM): The capability of the attack detection methods in obtaining the correct value of state vector is checked through this property. 2) Attack localization (AL): This feature checks whether the algorithm is able to determine the location of attacks or not.\n\n\n3) Concurrent random attacks detection (CRAD)\n\n: This property shows the capability of the algorithm in detecting several random (noncoordinated) attacks. 4) Stealth attack detection (SAD): Obviously, this feature investigates the ability of detection methods in detecting stealth attacks. 5) Obtaining the number of attacks (ONA): The ability of attack detection methods in obtaining the number of random (or coordinated) attacks is shown through this feature. 6) Requiring nonelectrical information (RNEI): This feature deals with this property that whether an attack detection method requires nonelectrical (e.g., cyber security) information to detect stealth attacks or not. For example, in addition to power grid information, the research work in [28] needs security information such as data collected from intrusion detection sensors or a database of firewall rules. However, this approach causes the design process to be more complicated and imposes additional delays. By specifying the above-mentioned properties in Table I, comparison between the previous researches and PMUIDS is straightforward. Results in Table I demonstrate that methods proposed in [25] and [28] are more similar to PMUIDS. However, as discussed earlier, the method in [28] requires nonelectrical information and the method proposed in [25] requires secure PMUs for detecting stealth attacks. Secure PMUs need security controls such as encryption and authentication, which impose additional delays [25].\n\nIn summary, the PMUIDS features are as follows.\n\n1) Detecting integrity attacks on power grids using a novel clustering approach. 2) Localizing the attacks.\n\n3) Obtaining the correct state vector when by removing the measurements of attacked PMUs, the power system still remains full observable. 4) Requiring only electrical information (by placing additional PMUs) which does not cause additional delay. 5) Decreasing the probability of successful stealth attacks. The main contributions of this article are the novel PMUIDS based on clustering technique with the above-mentioned features, and two theorems that one mathematically proves by an appropriate PMU placement, the successful interacting attack cannot happen, and the other one proves if PMUs are not placed appropriately, then the successful interacting attack can happen. However, even in this situation, the measurements of some parts of the power system can be corrected by the PMUIDS.\n\nThe rest of this article is organized as follows. Section II reviews the overall structure of PMU networks and static state estimation algorithm. In addition, two theorems about coordination of interacting attacks are presented in this section. Section III presents the suggested PMUIDS and the clusteringbased approach. The hardware-in-the-loop (HiL) results on a sample power system are given in Section IV. Finally, Section V concludes this article.\n\n\nII. INTEGRITY ATTACK DETECTION IN PMU NETWORKS EXPLOITING STATIC STATE ESTIMATION\n\nPMU networks are set up on the IT-based protocols. They are constituted from PMUs, phasor data concentrators (PDCs), and communication networks for data transmission in a hierarchical structure, which is expanded in a wide area measurement system (WAMS), and at the top level, transfers data to the control center [33], [34]. The network has two different parts: regional and backbone networks (see Fig. 1). While the regional networks are responsible for transferring data from each PMU to the related PDC [3], the backbone network has the main role of communication at a higher level among PDCs and the control center. The received data in the control center can be exploited for different studies, i.e., state estimation and stability assessment [35]. The main difference between the PMU and supervisory control and data acquisition (SCADA) systems is that in the PMU system, the real and imaginary parts of the voltages and currents are available and the measurement model is inherently linear. Moreover, the PMU systems are more resilient against attacks, although they are still vulnerable to some kinds of attacks [36].\n\nIn [36], an FDIA on power systems equipped with PMUs is studied, and by exploiting static state estimation, the voltages in the power system are estimated. Then, some solutions (such as redundant PMU) are suggested to avoid load shedding in the power system. Similarly, in [32], FDIA on WAMSs is considered and an algorithmic solution is proposed to address the issue of additional PMU installation and placement with cyber security consideration. However, those approaches do not offer all properties of the suggested PMUIDS listed in Table I. For detecting integrity attacks in such networks, this article combines the theories of static state estimation and data clustering approaches. In the static state estimation and static attack detection method, the system operating point changes slowly that the fast transient response is negligible [37]. Then, the values of currents and voltages for that operating point are used.\n\nIn the following, the theory is briefly reviewed and its capability in integrity attack detection is discussed. Furthermore, two theorems about the possibility of interacting attacks in PMU networks are presented.\n\n\nA. Static State Estimation\n\nIn general, the measurement equation for an n -bus system is as follows [38]:\nZ n = HV + e = (H r + jH m ) . (E v + jF v ) + e(1)\nwhere (H r + jH m ) ∈ C m×n is the Jacobian matrix of measurements, e = (e 1 , . . . , e m ) T is the measurement noise vector,\nand V = (E v + jF v ) ∈ C n×1 and Z n = (A + jB) ∈ C m×1\nare the state vector and the measurements vector, respectively,\nsuch that A = H r E v − H m F v and B = H m E v + H r F v .\nDefine a new measurement vector Z as follows [38]:\nZ = A B = H r −H m H m H r E v F v + e = HX + e (2)\nwhere X ∈ R (2n−1)×1 is the new state vector and H ∈ R 2m×(2n−1) is the new linear measurement Jacobian matrix. The estimation of state vectorX is procured as follows [39]:\nX = Ê v F v = H T RH −1 H T R A B = H T RH −1 H T RZ (3)\nwhere R is the covariance matrix and determines the weight of each array in the measurement vector Z. Without loss of generality, in the rest of this article, it is assumed that R is equal to I. It means that we used the known least square method to find the optimal static state estimation. Additionally, the matrix H should be nonsingular so that H T RH is inversible. This issue is treated by the so-called numerical observability [38], in which not only the system is topological observable, but also as much PMUs are allocated as needed to make the system full observable.\n\n\nB. Interacting Attack Detection\n\nAssume that an integrity attack happens in the PMU network and some measurements are altered. The vector of observed measurements after attack is Z a = Z + a, consisting of two parts: the real measurements Z = (z 1 , . . . , z 2m ) T and the false data added to the real measurements a = (a 1 , . . . , a 2m ) T that is called the attack vector. Assume thatX a refers to false estimation of state vector, i.e.,X a =X + W , where W is the state estimation error due to the vector injected by the attacker.\n\nIn [12]- [14], for detection of bad data (such as attack), the constraint is to check Z − HX 2 with a threshold and if this norm is less than the predefined threshold, it is concluded that there is no bad data in measurements. A category of attacks is interacting attacks, in which the attack vector has the specific form a = HW and do not result in a large deviation from threshold and cannot be detected by these methods. This kind of attack can be organized in the following two ways [20].\n\n1) The attacker's only intention is to deceive the result of state estimation. Therefore, W is assumed to be a random vector.\n\n2) The attacker aims to add specific errors to the estimation of particular state variables. Consequently, this kind of attack is called targeted FDIA. In other words, in targeted attacks, W is not a random vector. Assume that the attacker wants to orchestrate a random interacting attack. The matrices Q and K are defined as follows:\nQ = H H T H −1 H T , K = Q − I.(4)\nNotice that QH = H. Multiplying this equation and a = HW by W and Q, respectively, it can be concluded that\na = HW → Qa = QHW QH = H → QHW = HW = a ⇒ Qa = a → (Q − I) a = Ka = 0.(5)\nSolving (5), the attack vector can be obtained. Assume that the attacker's access is limited and he can only forge few PMU's data. Therefore, only the elements of vector a that correspond to falsified PMUs can be nonzero. Showing the nonzero elements of a with vector a and the corresponding columns of matrix K with matrix K , (5) results in the following:\nK a = 0.(6)\nIf K is a full rank matrix, (6) has a unique solution a = 0. Therefore, it is highly unlikely for successful interacting attacks to happen. Otherwise, the equation has infinite number of nonzero solutions with the following general form [20]:\na = I − K + K η (7)\nwhere η is an arbitrary nonzero vector with the same length as a and K + is pseudo inverse of matrix K . Consequently, when the attacker only has access to the measurements of few PMUs, the interacting attack may be detectable in some cases. In the following, two theorems are presented to determine whether or not a successful random interacting attack can be organized in PMU networks. In addition, if possible interacting attack happens, it is significant to know how the affected state variables are limited (successful targeted interacting attacks are restricted). Before mentioning the theorems, some definitions are given as follows. \n7) S = {s i |s i = L − o i , i = 12, . . . N o } , where s i is a\nset of PMUs which omitting their measurements' still makes the power system full observable.\n8)S = {s i |s i =L − u i , i = 1, 2, . . . N u } , wheres i is a\nset of PMUs that omitting their measurements' results in the power system not be full observable anymore. 9) L A : The set of buses that the attacker gain access to the measurements of their PMUs. 10) m: the number of all measurements obtained from ϕ 2 PMUs. Theorem 1: Assume that ϕ 2 PMUs are installed in the system. If the attacker only has access to a set of PMUs which belong to S (i.e., L − L A ∈ O), the matrix K is full rank and successful interacting attacks will not happen.\n\nProof: Select one observable set o i from the set O. The number of measurements related to eliminated PMUs (s i ) is shown by m e . These measurements are the ones that the attacker has access to them and can falsify them. The number of remaining PMU measurements which cannot be altered by the attacker is equal to m r = (m − m e ) ≥ n. Since, interchanging rows or columns of a matrix does not change the rank of matrix, without loss of generality, the matrix H can be considered as follows:\nH 2m × (2n−1) = H T r H T e T(8)\nwhere H e is a 2m e × (2n − 1) matrix and consists of the rows of H that correspond to measurements of eliminated PMUs and H r is a 2m r × (2n − 1) matrix, which is related to the remaining PMUs. The full observability (topologically and numerically) of power system before and after elimination of the specified PMUs (s i ) results in\nrowspace (H) = rowspace (H r ) = R 2n−1 (9) rank (H) = rank (H r ) = 2n − 1.\nIn other words, any vector in R 2n−1 can be written as a linear combination of rows of H or H r . Define matrix Y as follows:\nY = H T H −1 = H T r H T e H r H e −1(10)\nThe matrix Q will be obtained as the following:\nQ = H H T H −1 H T = H r Y H T r H r Y H T e H e Y H T r H e Y H T e .(11)\nTherefore, the matrix K will be represented as follows:\nK = Q − I = H r Y H T r − I 2(m−m e ) H r Y H T e H e Y H T r H e Y H T e − I 2m e .(12)\nHere, vector a consists of the last 2 m e elements of vector a (those elements that the attacker has access to). Therefore, matrix K 2m×2m e is as follows:\nK = H r Y H T e H e Y H T e − I 2m e .(13)\nAs it is mentioned before, if K is a full rank matrix, the successful interacting attacks will not happen. If each vector in R 2m e is presented as a linear combination of rows of matrix K , then the row space of K is R 2m e and this matrix is full rank. Therefore, to prove the nonexistence of successful interacting attack, we need to prove that for each vector F ∈ R 2m e the equation G T K = F T has an appropriate solution. Partitioning vector G T as\nG T = [g T 1 g T 2 ]\n, where g 1 and g 2 are (2m r × 1) and (2m e × 1) vectors, respectively, concludes\nG T K = g T 1 H r Y H T e + g T 2 H e Y H T e − g T 2 .(14)\nOn the other hand, each arbitrary vector F T H e ∈ R 2n−1 can be written as a linear combination of rows of H r . Therefore, for each arbitrary vector F, the equation g T 1 H r = F T H e has a solution that is calledḡ 1 . As it is shown in the following, for each arbitrary vector F, the vectorḠ = [ḡ T\n1 −F T ] T is a solution for the equation G T K = F T G T K =ḡ T 1 H r Y H T e − F T H e Y H T e + F T g T 1 H r = F T H e ⇒Ḡ T K = F T .(15)\nTherefore, it is shown that if the attacker has access to the measurements of a set of PMUs that belongs to S, each vector F ∈ R 2m e can be presented as a linear combination of rows of K , which means that the matrix K is full rank. Therefore, the equation K a = 0 has a unique solution a = 0 and the successful interacting attacks will not happen.\n\nTheorem 2: Assume that the attacker only gain access to a set of PMUs that belongs toS (i.e., L − L A ∈ U ) and can organize an interacting attack in the form of a = HW . In this case, the estimation error vector (W) will have a specified structure and all of its elements related to the buses that are still observable after removing the attacked PMUs (L A ) are zero. Therefore, the attacker can only falsify estimation of buses that become unobservable after omitting L A Proof: Consider the case that the attacker gain access to a set of PMUs that belongs toS and can manage a successful interacting attack a = HW . The estimation of state vector using all measurements after the attack is as follows:\nX a = H T H −1 H T Z a = H T H −1 H T (Z + HW ) =X + W.(16)\nSince L − L A ∈ U , omitting measurements of attacked PMUs makes some buses unobservable. Those elements of vectors W,X, andX a that are related to observable buses are shown by W o ,X o , andX a o . Define vector a r by removing the elements related to L A from a. In addition, define matrix H r by removing the corresponding rows of H. Therefore, the equation a r = H r W still holds.\n\nAssume that matrix H rc is obtained by removing the zero columns related to unobservable state variables from matrix H r . Since these zero columns have no effect on the value of vector a r , after removing them, the equation a r = H rc W o still holds. Although the power system is not full observable after omitting the measurements related to L A , the voltages of observable buses can be estimated as follows:\nX a o = H T rc H rc −1 H T rc Z a r = H T rc H rc −1 H T rc (Z r + a r ) = H T rc H rc −1 H T rc (Z r + H rc W o ) =X o + W o . (17)\nOn the other hand, the remaining measurements after omitting the attacked PMUs (L A ) are correct. Therefore, the estimation of observable buses will be correct, too\nZ a r = Z r ⇒X a o = H T rc H rc −1 H T rc Z r =X o .(18)\nComparing (17) to (18), it is concluded that W o = 0. Therefore, the attacker cannot target any arbitrary bus and only estimation of buses that become unobservable by removing measurements of attacked PMUs may be wrong.\n\nIn Theorems 1 and 2, the PMUs belong to the sets S andS, respectively. Depending the attacker access to the sets S and S, the attack success changes. From Theorem 1, one infers that gaining access to the measurement of those PMUs that belong to S does not result in successful interacting attacks. Based on Theorem 2, gaining access to those PMUs that belong tō S may falsify the estimation of buses that become unobservable after omitting the attacked PMUs. By using these two theorems, all set of PMUs that by gaining access to their measurements, organizing a successful interacting attack might be possible (i.e.,S) can be determined and the buses that falsifying their estimation is much easier than other buses (i.e., buses that become unobservable in most cases) can be identified.\n\n\nIII. PMUIDS\n\nIn this section, the steps of PMUIDS for detecting attacks, localizing them, determining the number of attacks, and obtaining the correct measurements are presented. In the suggested approach, different state estimation vectors are calculated and compared in the control center. The redundancy of PMUs is increased to make it possible to obtain several solutions for the state estimation problem. Then, clustering is employed to detect the number and location of attacks and obtain the correct estimation of state vector. Notice that in case of multiple simultaneous attacks, if by omitting measurements of falsified PMUs, the power system remains full observable, the state vector can be estimated correctly. Otherwise, only the correct voltages of observable buses will be obtained.\n\nThe PMUIDS algorithm is as follows. 1) Perform PMU placement by taking N − 1 contingency conditions into account. 2) Install PMUs on the buses determined in the previous step. 3) Omit the measurements received from one of the PMUs and calculate the estimation of the state vector V 1 by using the measurements of other PMUs. 4) In a row, consider each PMU data to be omitted once and exploit the other measurements for the required estimation data. After elimination of the ith PMU data, go to\n\nStep 3 and calculate state vector V i and ϕ 2 . Thus, different estimation results (V 1 , V 2 . . . , V ϕ 2 ) will be acquired. 5) Use the following formula to calculate the mean of all state vectors:\nV Ave = mean (V 1 , V 2 . . . , V ϕ 2 ) = 1 ϕ 2 ϕ 2 i = 1 V i .(19)\n6) Choose Euclidean norm as an appropriate measure to find the distance between each state and the mean.\nDis i = V i − V Ave 2 .(20)\n7) Find the state vector with the largest distance from the mean\nDis * = max i (Dis i ) .(21)\nIf this distance is smaller than a threshold, i.e., ε, PMUIDS ignores it and concludes that no attack has occurred. Otherwise, if the largest distance from the mean is larger than a threshold, it can be concluded that an attack has occurred. The threshold ε is considered to remove the effect of measurement noises and it is the key to identify the integrity attack from the noisy measurements.\n\n1) In this step, the number and locations of the attacks will be detected. First, by using subtractive clustering algorithm, the number of clusters will be obtained. Then, by using fuzzy C-means clustering, each state vector will be assigned to the right cluster. The number of single-member clusters shows the number of attacks. In addition, those PMUs whose data were omitted in calculating the state vectors associated with single-member clusters are the attacked ones. 2) For single-attack cases, the state vector with maximum distance from the mean which was found in Step 7 shows the correct measurements. For multiple simultaneous attacks, the measurements of detected attacked PMUs will be omitted and state estimation will be done based on the remaining measurements. If the remaining measurements make the power system full observable, the correct estimation of state vector will be obtained. Otherwise, only the correct voltages of observable buses will be estimated. To prove the capability of PMUIDS, assume that only measurements of PMU i are forged. Implementing the above algorithm, it is obvious that when data of PMU i is omitted, the state estimation result is correct (Estimation 1 ). All the other cases contain the forged data and will lead to wrong estimations. Since the forged data affect all these estimated state vectors similarly, their results will be very close to each other, but different from Estimation 1 . In other words, the state estimation results will form two clusters, where one of them is a single-member cluster (Estimation 1 ). This scheme can be extended to the cases that measurements of more PMUs are altered by attackers.\n\nIt should be noted that the proposed algorithm does not have any limitation for N − 2 or further assumption. Furthermore, the algorithm does not have any limitation for large-scale systems. It is just needed to have enough measurement to be sure that the matrix H of (3) is nonsingular. Thereby, it is required to install as much PMUs as they guarantee the matrix nonsingularity, which is the limitation of all static state estimation approaches.\n\n\nIV. HIL RESULTS\n\nThe approach proposed in Section III is applied on the known IEEE 14-bus test system through the OPAL-RT HiL environment, shown in Fig. 2. The structure of the HiL setup consists of an OPAL-RT as a real-time simulator, which simulates the IEEE 14-bus grid, seven virtual phasor PMUs, and the static attack detection; a PC as the programming host; an amplifier that generates the current and voltage for the PMUs; two real PMU devices; and a satellite-synchronized clock. The optimal PMU locations are found by the method introduced in [40] and [41]. The optimal numbers of PMUs in normal and N − 1  contingency conditions are equal to 4 and 9, respectively. The locations of PMUs in N − 1 contingency condition is shown with S 2 = {24,56,78,911,13}. In Fig. 3, the modified version of the IEEE 14-bus system benchmark with the assumption of no connection between the buses 5 and 6 is shown. The PMU network is designed and nine PMUs (PMU A , PMU B , …,PMU I ) are allocated. Additionally, the network for transferring data from PMU to PDC and the CC are selected. It is assumed that the network requires three PDCs, corresponding regional networks (R1, R2, and R3) and ring interface units, and a backbone network.\n\nIn the part of the static attack detection, initially an integrity attack is generated and added to data of the attacked real/virtual PMU devices to falsify the measurements. Then, the static attack detection method is performed.\n\n\nA. Analyzing the Results of Theorems 1 and 2\n\nIn this part, it is considered that the proposed PMUIDS detects the attacked PMUs and the applicability of Theorems 1 and 2 is investigated. These theorems facilitate analyzing the feasibility of successful interacting attacks. To do this, the sets S (or O) andS (or U ) are required and can be obtained based on the topology of IEEE 14-bus and the places of PMUs and PDC.  Table II shows the number of observable and unobservable sets for different PMU numbers 4 ≤ γ ≤ 9.\n\nThese sets are utilized in Theorems 1 and 2 to analyze the possible attacks. The results are as follows.\n\nSingle attack: Since nine PMUs are placed in the grid, if one random PMU is attacked (and detected by the PMUIDS), still eight PMU measurements are available. Based on Table II, there is no set of unobservable set (i.e., U ∈ ∅) and all possible sets are observable. Thereby, based on Theorem 1, the system is full observable; and no successful attack can be performed.\n\nTwo attacks: If two random PMUs are attacked, they are detected and the power system still has seven available PMUs. In this case, 29 sets out of 36 sets are full observable and based on Theorem 1, system states are full observable; and seven sets out of 36 sets are unobservable, and based on Theorem 2, their corresponding states are lost, meanwhile the other states are observable. This shows that only seven out of 36 possible sets of 2 simultaneous attacks can be a successful interacting attack, which results into the loss of some buses' states. Consequently, the probability of organizing targeted FDIA is highly unlikely. The possible interacting attacks on two PMUs and the buses that their estimation could be wrong are shown in Table III. Moreover, the following statements hold.\n\n1) No one can deceive the estimation of buses (2, 4, 5, 6, 7, and 9) without being detected. 2) To deceive the estimation of bus 10 without being detected, the attacker should have access to the measurements of buses 9 and 11, otherwise a successful interacting attack is impossible. Three attacks: In this case, six available PMUs' measurements are available. Based on Table II, this means that only 45 out of 83 possible sets of 3 simultaneous attacks can be a successful interacting attack. Furthermore, the following statements hold.\n\n1) No one can falsify the estimation of buses (4, 5, 6, and 7) without being detected. 2) To falsify the estimation of bus 9 without being detected, the attacker should have access to the data of buses 4, 7 and 9, otherwise a successful interacting attack is impossible.\n\n\nB. Evaluating the Proposed PMUIDS\n\nIn this part, three scenarios are considered for evaluating PMUIDS on the IEEE 14-bus system. In the first scenario, the power system is working normal and no attack is carried out. This scenario indicates whether PMUIDS produces any false results or not. In the second scenario, one integrity attack is carried out. Results of this scenario show whether PMUIDS can successfully detect the attack, obtain the correct measurements, and localize the attack in case of one attack at a time or not. Finally, in the third scenario, three attacks are simultaneously orchestrated on the IEEE 14-bus system. This test investigates whether PMUIDS can still detect intrusion, determine the number and location of attacks, and correct estimation in case of simultaneous attacks or not. It should be noted that since PMUIDS employs mathematically proven techniques, in similar scenarios, similar results will be obtained.\n\n\n1) Scenario 1: No Attack:\n\nFirst, consider the case that no attack happened in the PMU network. At each step, eight out of nine PMUs are selected and the state vector is estimated based on the method described in Section III-A. Therefore, for calculating V A , all measurements except information gathered from PMU A is used. Similarly, this procedure is repeated for all PMUs. Therefore, nine solutions (V A , V B ….,V I ) are obtained for different state estimation problems, which are shown in Fig. 4. It is obvious that all solutions are very close to each other. The small differences between the state vectors in this case are due to measurement noises. The Euclidean distance of each state vector to V ave is presented in Table IV. 2) Scenario 2: One Attack: Assume that the measurements of PMU A (shown in Fig. 3) are falsified to simulate an integrity attack. This PMU transfers the information to PDC 1 . Here, a series of actions are needed to check whether integrity attack [man-in-the-middle (MitM)] modified the PMU data. A similar procedure to Section IV-B.1 is repeated to find nine state vectors while data from one of the PMUs are eliminated. The Euclidean distance of computed state vectors to V ave are presented in Table IV. According to the Results, V A has the largest Euclidean distance to V ave which is greater than ε = 0.05. Therefore, PMUIDS can effectively detect the attack. The subtractive and fuzzy C-means clustering methods are exploited to determine the clustering information useful in attack determination.\n\nThe number of clusters that is calculated by subtractive clustering algorithm equals 2. One of these clusters consists of eight vectors (V B , V C …., V I ) and the second one is a single-member  cluster (V A ) shown in Fig. 5. Thus, there is only one attack and PMU A that was not used in the calculation of V A contains the falsified data and its data are compromised. Since only one attack has happened in the network, state vector V A represents the accurate estimations.\n\n\n3) Scenario 3: Three Attacks:\n\nAssume that the measurements of PMU A , PMU D , and PMU G are altered to simulate three integrity attacks. The same detection procedure is used here. The estimation results (V A ,V B , V C …., V I ) are presented in Fig. 6 and the corresponding Euclidean distance is presented in Table IV. The results show that the norm of difference between V D and V ave is the largest value, equal to 0.84103. Therefore, the attack is detected properly. The number of clusters in this case equals 4. Three of these clusters, which are marked with dashed lines in Fig. 6, only consist of one state vector. Other state vectors (V B , V C , V E , V F , V H , V I ) form a cluster together. Therefore, the number of attacks is identified correctly. The PMUs, whose data were omitted in calculating the state vectors associated with single-member clusters, will be effectively determined as the location of attacks. Since after removing the detected forged PMUs, the power system remains full observable, the true values of bus voltages can be obtained.\n\nBy using the proposed PMUIDS, the system state vector is estimated and clustered via the approach presented in Appendix. If one gets no specific cluster, it shows that all solutions are very close to each other and no attack does happen, which is evident in Scenario 1. However, if more clusters are achieved, an attack is detected. Based on the number of clusters, it is possible to determine the number of simultaneous attacks. As can be seen in Scenarios 2 and 3, one and three clusters are obtained, respectively, which is consistent with the number of the simultaneous attacks.\n\n\nV. CONCLUSION\n\nIn this article, integrity attack on power systems was studied and a procedure based on the static state estimation and data clustering algorithms was presented to accurately detect the number and location of attacks and determine which PMU in the network contained malicious data. This detection can be done in the control center by comparing different state estimation results and data clustering approaches and it was called PMUIDS. The theory of detecting attacks by PMUIDS was proved by two theorems. The theorems showed that in most cases, the successful interacting attacks could not happen and PMUIDS could effectively detect any arbitrary false data that were added to the measurements. However, in some special cases, in which many PMUs were forged and the remained ones could not make the whole power system observable, the successful interacting attacks could happen. Even in such a case, the algorithm was still able to provide correct measurements for some parts of the system based on the number of unfalsified PMUs. The HiL results on a sample power system proved the PMUIDS capability in finding the forged PMU data. For the future work, considering more complex large-scale systems is suggested. Furthermore, considering the issue of PMU faulty measurements and distinguishing it from the attacked PMUs can be an interesting work.\n\n\nAPPENDIX DATA CLUSTERING ALGORITHM\n\nEach clustering analysis has two prerequisites: determining the number of clusters and the clustering method. Here, for determining the number of clusters, the subtractive clustering technique is utilized [42]. In each step of this iterative algorithm, the potential to be a cluster center is evaluated for all points in the dataset and the point with the highest potential value, which has more data in its neighborhood, will be found. Then, by using some criteria, it is determined whether that point is a new cluster center or not. After obtaining a new cluster center, the potential values of the remaining data points will be modified and the process repeats for the remaining points till no new cluster center can be found. Based on subtractive clustering, the number of clusters and a good initial guess for cluster centers are obtained. However, data points of each cluster cannot be found in this method. This information can be derived by FCM clustering. The FCM algorithm iteratively minimizes the following objective function [43]:\nJ = n d j=1 n c i=1 μ 2 ij d j − c i 2(22)\nwhere n d refers to the number of data samples, n c refers to the number of clusters determined by subtracting clustering method, d j is the jth data point, c i is the ith cluster center, and μ ij refers to the membership degree of the jth data in the ith cluster and is computed as follows:\nμ ij = 1 n c l=1 d j −c i d j −c l 2 .(23)\nIn the initial step of the FCM algorithm, prefixed n c and initial values for cluster centers are determined. Then, the optimum value of the cluster centers and membership degrees are procured iteratively by minimizing the objective function.\n\nFig. 1 .\n1Hierarchical structure of PMU networks[34].\n\n1 ) ϕ 1 & ϕ 2 :\n112The number of PMUs to guarantee full observability (topologically and numerically) in normal condition and N − 1 contingency, respectively (ϕ 2 > ϕ 1 ) 2) L = {l 1 , . . . , l ϕ 2 } : The set of buses which define the locations of installed PMUs in N − 1 contingency condition. 3) o i : Each subset of L, which makes power system full observable (observable set). 4) O = {o i |i = 1, . . . , N o } : The set of observable sets. 5) u i : Each subset of L, which cannot make power system full observable (unobservable set). 6) U = {u i |i = 1, . . . , N u } : The set of unobservable sets.\n\nFig. 2 .\n2OPAL-RT HiL setup for testing the attack detection method on an IEEE 14-bus system.\n\nFig. 3 .\n3PMU-PDC-CC network of IEEE 14-bus test system.\n\nFig. 4 .\n4Estimation results prior to experiencing any attack.\n\nFig. 5 .\n5All solutions for the state estimation problem after one attack.\n\nFig. 6 .\n6All solutions for the state estimation problem after three attacks.\n\nTABLE I PROPERTIES\nIOF PMUIDS AND SOME METHODS IN LITERATURE FOR FALSE DATA INJECTION ATTACK DETECTION\n\nTABLE II NUMBER\nIIOF OBSERVABLE AND UNOBSERVABLE SETS\n\nTABLE III POSSIBLE\nIIIINTERACTING ATTACK ON TWO PMUS\nShe is currently an Associate Professor with the School of Electrical and Computer Engineering, Shiraz University, Shiraz. Her research interests include linear matrix inequalities and bilinear matrix inequalities applications in control, linear parameter varying systems, and control applications in biomedical and power systems.Abdullah Khalili received the M.Sc. degree in software engineering in 2011 from the Iran University of Science and Technology, Tehran, Iran, where he worked on \"dynamic malware detection\" as his thesis title, and received the Ph.D. degree in computer engineering-software systems from CSE and IT Department, Shiraz University, Shiraz, Iran, in 2016. Title of his Ph.D. thesis was \"A multi-tier intrusion detection for industrial control systems.\"He is currently an Assistant Professor with the Department of Electrical and Computer Engineering, University of Hormozgan, Bandar Abbas, Iran. His research interests include cyber physical system (CPS) security, industrial control systems (ICS) and supervisory control and data acquisition (SCADA) security, power system security, machine learning, and pattern recognition.Ashkan Sami received the B.S.E.E. degree from Virginia Polytechnic Institute and State University (Virgina Tech), USA, in 1990, the M.S. degree in computer science-artificial intelligence and robotics from Shiraz University, Iran, and the Ph.D. degree in engineering-data engineering from Tohoku University, Japan, in 2006 from Tohoku University, Sendai, Japan, where his Ph.D. work became a Japanese national project and earned him a tenured faculty position at Tohoku University. He is currently an Associate Professor of Computer Science and Software Engineering with Shiraz University, Shiraz, Iran, and has been a National Elite's Foundation Professor since 2019s. He has graduated more than 100 M.S. and Ph.D. students under his supervision. He teaches and conducts multidisciplinary research on data science, applied AI, cyber security, and software engineering. His current research focuses on AI-based system design.Navid\nSmart grid data integrity attacks. A Giani, E Bitar, M Garcia, M Mcqueen, P Khargonekar, K Poolla, IEEE Trans. Smart Grid. 43A. Giani, E. Bitar, M. Garcia, M. McQueen, P. Khargonekar, and K. Poolla, \"Smart grid data integrity attacks,\" IEEE Trans. Smart Grid, vol. 4, no. 3, pp. 1244-1253, Sep. 2013.\n\nCyber security of a power grid: State-of-the-art. C.-C Sun, A Hahn, C.-C Liu, Int. J. Electr. Power Energy Syst. 99C.-C. Sun, A. Hahn, and C.-C. Liu, \"Cyber security of a power grid: State-of-the-art,\" Int. J. Electr. Power Energy Syst., vol. 99, pp. 45-56, 2018.\n\nIntegrity attack detection in PMU networks using static state estimation algorithm. M Dehghani, Z Khalafi, A Khalili, A Sami, Proc. IEEE Eindhoven PowerTech. IEEE Eindhoven PowerTechM. Dehghani, Z. Khalafi, A. Khalili, and A. Sami, \"Integrity attack detection in PMU networks using static state estimation algorithm,\" in Proc. IEEE Eindhoven PowerTech., 2015, pp. 1-6.\n\nOnline identification and data recovery for PMU data manipulation attack. X Wang, D Shi, J Wang, Z Yu, Z Wang, IEEE Trans. Smart Grid. 106X. Wang, D. Shi, J. Wang, Z. Yu, and Z. Wang, \"Online identification and data recovery for PMU data manipulation attack,\" IEEE Trans. Smart Grid, vol. 10, no. 6, pp. 5889-5898, Nov. 2019.\n\nDiagnosis of outliers and cyber attacks in dynamic PMU-Based power state estimation. Y Chakhchoukh, H Lei, B K Johnson, IEEE Trans. Power Syst. 352Y. Chakhchoukh, H. Lei, and B. K. Johnson, \"Diagnosis of outliers and cyber attacks in dynamic PMU-Based power state estimation,\" IEEE Trans. Power Syst., vol. 35, no. 2, pp. 1188-1197, Mar. 2020.\n\nDynamic GPS spoofing attack detection, localization, and measurement correction exploiting PMU and SCADA. S Siamak, M Dehghani, M Mohammadi, 10.1109/JSYST.2020.3001016IEEE Syst. J. S. Siamak, M. Dehghani, and M. Mohammadi, \"Dynamic GPS spoofing at- tack detection, localization, and measurement correction exploiting PMU and SCADA,\" IEEE Syst. J., 2020, doi: 10.1109/JSYST.2020.3001016.\n\nA prediction algorithm to enhance grid resilience toward cyber attacks in WAMCS applications. A S Musleh, H M Khalid, S M Muyeen, A Al-Durra, IEEE Syst. J. 131A. S. Musleh, H. M. Khalid, S. M. Muyeen, and A. Al-Durra, \"A prediction algorithm to enhance grid resilience toward cyber attacks in WAMCS applications,\" IEEE Syst. J., vol. 13, no. 1, pp. 710-719, Mar. 2019.\n\nCyber security in control of grid-tied power electronic converters-challenges and vulnerabilities. S Sahoo, T Dragicevic, F Blaabjerg, 10.1109/JESTPE.2019.2953480IEEE J. Emerg. Sel. Topics Power Electron. S. Sahoo, T. Dragicevic, and F. Blaabjerg, \"Cyber security in con- trol of grid-tied power electronic converters-challenges and vul- nerabilities,\" IEEE J. Emerg. Sel. Topics Power Electron., 2019, doi: 10.1109/JESTPE.2019.2953480.\n\nDistributed screening of hijacking attacks in DC microgrids. S Sahoo, J C Peng, S Mishra, T Dragicevic, IEEE Trans. Power Electron. 357S. Sahoo, J. C.-H. Peng, S. Mishra, and T. Dragicevic, \"Distributed screening of hijacking attacks in DC microgrids,\" IEEE Trans. Power Electron., vol. 35, no. 7, pp. 7574-7582, Jul. 2020.\n\nA survey on bad data injection attack in smart grid. D Wang, X Guan, T Liu, Y Gu, Y Sun, Y Liu, Proc. IEEE PES Asia-Pac. IEEE PES Asia-PacPower Energy Eng. Conf.D. Wang, X. Guan, T. Liu, Y. Gu, Y. Sun, and Y. Liu, \"A survey on bad data injection attack in smart grid,\" in Proc. IEEE PES Asia-Pac. Power Energy Eng. Conf., Dec. 2013, pp. 1-6.\n\nBMI-based load frequency control in microgrids under false data injection attacks. H Javanmardi, M Dehghani, M Mohammadi, S Siamak, M R Hesamzadeh, 10.1109/JSYST.2021.3054947IEEE Syst. J. H. Javanmardi, M. Dehghani, M. Mohammadi, S. Siamak, and M. R. Hesamzadeh, \"BMI-based load frequency control in mi- crogrids under false data injection attacks,\" IEEE Syst. J., 2021, doi: 10.1109/JSYST.2021.3054947.\n\nPlacement of PMUs to enable bad data detection in state estimation. J Chen, A Abur, IEEE Trans. Power Syst. 214J. Chen and A. Abur, \"Placement of PMUs to enable bad data detection in state estimation,\" IEEE Trans. Power Syst., vol. 21, no. 4, pp. 1608-1615, Nov. 2006.\n\nBad data identification when using phasor measurements. J Zhu, A Abur, Proc. IEEE Lausanne Power Tech. IEEE Lausanne Power TechJ. Zhu and A. Abur, \"Bad data identification when using phasor measure- ments,\" in Proc. IEEE Lausanne Power Tech, Jul. 2007, pp. 1676-1681.\n\nBad data detection of unequal magnitudes in state estimation of power systems. J Duran-Paz, F Perez-Hidalgo, M J Duran-Martinez, IEEE Power Eng. Rev. 224power engineering lettersJ. l. Duran-Paz, F. Perez-Hidalgo, and M. J. Duran-Martinez, \"Bad data de- tection of unequal magnitudes in state estimation of power systems [power engineering letters],\" IEEE Power Eng. Rev., vol. 22, no. 4, pp. 57-60, Apr. 2002.\n\nSummation detector for false data-injection attack in cyber-physical systems. D Ye, T.-Y Zhang, IEEE Trans. Cybern. 506D. Ye and T.-Y. Zhang, \"Summation detector for false data-injection attack in cyber-physical systems,\" IEEE Trans. Cybern., vol. 50, no. 6, pp. 2338-2345, Jun. 2020.\n\nDetection of faults and attacks including false data injection attack in smart grid using kalman filter. K Manandhar, X Cao, F Hu, Y Liu, IEEE Trans. Control Netw. Syst. 14K. Manandhar, X. Cao, F. Hu, and Y. Liu, \"Detection of faults and attacks including false data injection attack in smart grid using kalman filter,\" IEEE Trans. Control Netw. Syst., vol. 1, no. 4, pp. 370-379, Dec. 2014.\n\nReal-time detection of false data injection attacks in smart grid: A deep learning-based intelligent mechanism. Y He, G J Mendis, J Wei, IEEE Trans. Smart Grid. 85Y. He, G. J. Mendis, and J. Wei, \"Real-time detection of false data injection attacks in smart grid: A deep learning-based intelligent mechanism,\" IEEE Trans. Smart Grid, vol. 8, no. 5, pp. 2505-2516, Sep. 2017.\n\nA novel detection algorithm to identify false data injection attacks on power system state estimation. M Ganjkhani, S N Fallah, S Badakhshan, S Shamshirband, K Chau, Energies. 1211Art. no. 2209M. Ganjkhani, S. N. Fallah, S. Badakhshan, S. Shamshirband, and K. Chau, \"A novel detection algorithm to identify false data injection attacks on power system state estimation,\" Energies, vol. 12, no. 11, Jun. 2019, Art. no. 2209.\n\nFalse data injection attacks in electricity markets. L Xie, Y Mo, B Sinopoli, Proc. 1st IEEE Int. Conf. Smart Grid Commun. 1st IEEE Int. Conf. Smart Grid CommunL. Xie, Y. Mo, and B. Sinopoli, \"False data injection attacks in electricity markets,\" in Proc. 1st IEEE Int. Conf. Smart Grid Commun., Oct. 2010, pp. 226-231.\n\nFalse data injection attacks against state estimation in electric power grids. Y Liu, P Ning, M K Reiter, ACM Trans. Inf. Syst. Secur. 141Y. Liu, P. Ning, and M. K. Reiter, \"False data injection attacks against state estimation in electric power grids,\" ACM Trans. Inf. Syst. Secur., vol. 14, no. 1, pp. 1-33, May 2011.\n\nBlind false data injection attack using PCA approximation method in smart grid. Z.-H Yu, W.-L Chin, IEEE Trans. Smart Grid. 63Z.-H. Yu and W.-L. Chin, \"Blind false data injection attack using PCA approximation method in smart grid,\" IEEE Trans. Smart Grid, vol. 6, no. 3, pp. 1219-1226, May 2015.\n\nMalicious data detection in state estimation leveraging system losses & estimation of perturbed parameters. W Niemira, R B Bobba, P Sauer, W H Sanders, Proc. IEEE Int. Conf. Smart Grid Commun. IEEE Int. Conf. Smart Grid CommunW. Niemira, R. B. Bobba, P. Sauer, and W. H. Sanders, \"Malicious data detection in state estimation leveraging system losses & estimation of perturbed parameters,\" in Proc. IEEE Int. Conf. Smart Grid Commun., Oct. 2013, pp. 402-407.\n\nBad data detection method for smart grids based on distributed state estimation. Y Gu, T Liu, D Wang, X Guan, Z Xu, Proc. IEEE Int. Conf. Commun. IEEE Int. Conf. CommunY. Gu, T. Liu, D. Wang, X. Guan, and Z. Xu, \"Bad data detection method for smart grids based on distributed state estimation,\" in Proc. IEEE Int. Conf. Commun., Jun. 2013, pp. 4483-4487.\n\nCyber-attack detection system of largescale power systems using decentralized unknown input observer. H Varmaziari, M Dehghani, Proc. Iranian Conf. Elect. Eng. Iranian Conf. Elect. EngH. Varmaziari and M. Dehghani, \"Cyber-attack detection system of large- scale power systems using decentralized unknown input observer,\" in Proc. Iranian Conf. Elect. Eng., May 2017, pp. 621-626.\n\nOn phasor measurement unit placement against state and topology attacks. J Kim, L Tong, Proc. IEEE Int. Conf. Smart Grid Commun. IEEE Int. Conf. Smart Grid CommunJ. Kim and L. Tong, \"On phasor measurement unit placement against state and topology attacks,\" in Proc. IEEE Int. Conf. Smart Grid Commun., Oct. 2013, pp. 396-401.\n\nSecurity of fully distributed power system state estimation: Detection and mitigation of data integrity attacks. O Vukovic, G Dan, IEEE J. Sel. Areas Commun. 327O. Vukovic and G. Dan, \"Security of fully distributed power system state estimation: Detection and mitigation of data integrity attacks,\" IEEE J. Sel. Areas Commun., vol. 32, no. 7, pp. 1500-1508, Jul. 2014.\n\nNetwork-aware mitigation of data integrity attacks on power system state estimation. O Vukovic, K C Sou, G Dan, H Sandberg, IEEE J. Sel. Areas Commun. 306O. Vukovic, K. C. Sou, G. Dan, and H. Sandberg, \"Network-aware miti- gation of data integrity attacks on power system state estimation,\" IEEE J. Sel. Areas Commun., vol. 30, no. 6, pp. 1108-1118, Jul. 2012.\n\nSCPSE: Security-oriented cyber-physical state estimation for power grid critical infrastructures. S Zonouz, K M Rogers, R Berthier, R B Bobba, W H Sanders, T J Overbye, IEEE Trans. Smart Grid. 34S. Zonouz, K. M. Rogers, R. Berthier, R. B. Bobba, W. H. Sanders, and T. J. Overbye, \"SCPSE: Security-oriented cyber-physical state estimation for power grid critical infrastructures,\" IEEE Trans. Smart Grid, vol. 3, no. 4, pp. 1790-1799, Dec. 2012.\n\nPartial grid false data injection attacks against state estimation. H Margossian, M A Sayed, W Fawaz, Z Nakad, Int. J. Electr. Power Energy Syst. 110H. Margossian, M. A. Sayed, W. Fawaz, and Z. Nakad, \"Partial grid false data injection attacks against state estimation,\" Int. J. Electr. Power Energy Syst., vol. 110, pp. 623-629, Sep. 2019.\n\nFalse data injection attacks targeting DC model-based state estimation. G Liang, S R Weller, J Zhao, F Luo, Z Y Dong, Proc. IEEE Power Energy Soc. Gen. Meeting. IEEE Power Energy Soc. Gen. MeetingG. Liang, S. R. Weller, J. Zhao, F. Luo, and Z. Y. Dong, \"False data injection attacks targeting DC model-based state estimation,\" in Proc. IEEE Power Energy Soc. Gen. Meeting, Jul. 2017, pp. 1-5.\n\nDefending against false data injection attacks on power system state estimation. R Deng, G Xiao, R Lu, IEEE Trans. Ind. Informat. 131R. Deng, G. Xiao, and R. Lu, \"Defending against false data injection attacks on power system state estimation,\" IEEE Trans. Ind. Informat., vol. 13, no. 1, pp. 198-207, Feb. 2017.\n\nPMU placement in electric transmission networks for reliable state estimation against false data injection attacks. Q Yang, L Jiang, W Hao, B Zhou, P Yang, Z Lv, IEEE Internet Things J. 46Q. Yang, L. Jiang, W. Hao, B. Zhou, P. Yang, and Z. Lv, \"PMU placement in electric transmission networks for reliable state estimation against false data injection attacks,\" IEEE Internet Things J., vol. 4, no. 6, pp. 1978-1986, Dec. 2017.\n\n. A G Phadke, J S Thorp, Synchronized Phasor Measurements and Their Applications. 1SpringerA. G. Phadke and J. S. Thorp, Synchronized Phasor Measurements and Their Applications, vol. 1. New York, NY, USA: Springer, 2008.\n\nEvaluating multiple reliability indices of regional networks in wide area measurement system. Y Wang, W Li, J Lu, H Liu, Electr. Power Syst. Res. 7910Y. Wang, W. Li, J. Lu, and H. Liu, \"Evaluating multiple reliability indices of regional networks in wide area measurement system,\" Electr. Power Syst. Res., vol. 79, no. 10, pp. 1353-1359, Oct. 2009.\n\nSynchronized phasor measurement applications in power systems. J De La Ree, V Centeno, J S Thorp, A G Phadke, IEEE Trans. Smart Grid. 11J. De La Ree, V. Centeno, J. S. Thorp, and A. G. Phadke, \"Synchronized phasor measurement applications in power systems,\" IEEE Trans. Smart Grid, vol. 1, no. 1, pp. 20-27, Jun. 2010.\n\nA two-layer game theoretical attack-defense model for a false data injection attack against power systems. Q Wang, W Tai, Y Tang, M Ni, S You, Int. J. Electr. Power Energy Syst. 104Q. Wang, W. Tai, Y. Tang, M. Ni, and S. You, \"A two-layer game theoretical attack-defense model for a false data injection attack against power systems,\" Int. J. Electr. Power Energy Syst., vol. 104, pp. 169-177, Jan. 2019.\n\nA survey on the detection algorithms for false data injection attacks in smart grids. A S Musleh, G Chen, Z Y Dong, IEEE Trans. Smart Grid. 113A. S. Musleh, G. Chen, and Z. Y. Dong, \"A survey on the detection algorithms for false data injection attacks in smart grids,\" IEEE Trans. Smart Grid, vol. 11, no. 3, pp. 2218-2234, Oct. 2019.\n\nOptimal PMU placement method for complete topological and numerical observability of power system. R Sodhi, S C Srivastava, S N Singh, Electr. Power Syst. Res. 809R. Sodhi, S. C. Srivastava, and S. N. Singh, \"Optimal PMU place- ment method for complete topological and numerical observability of power system,\" Electr. Power Syst. Res., vol. 80, no. 9, pp. 1154-1159, Sep. 2010.\n\nPower system state estimation with PMU (phasor measurement unit). P G Praviraj, MATLAB Central File Exchange. P. G. Praviraj, \"Power system state estimation with PMU (phasor measure- ment unit),\" MATLAB Central File Exchange, 2020. [Online]. Available: https://www.mathworks.com/matlabcentral/fileexchange/65621-power- system-state-estimation-with-pmu-phasor-measurement-unit, Retrieved May 24, 2020\n\nPMU ranking based on singular value decomposition of dynamic stability matrix. M Dehghani, B Shayanfard, A R Khayatian, IEEE Trans. Power Syst. 283M. Dehghani, B. Shayanfard, and A. R. Khayatian, \"PMU ranking based on singular value decomposition of dynamic stability matrix,\" IEEE Trans. Power Syst., vol. 28, no. 3, pp. 2263-2270, Aug. 2013.\n\nPMU based observability reliability evaluation in electric power systems. M Dehghani, L Goel, W Li, Electr. Power Syst. Res. 116M. Dehghani, L. Goel, and W. Li, \"PMU based observability reliability evaluation in electric power systems,\" Electr. Power Syst. Res., vol. 116, pp. 347-354, Nov. 2014.\n\nFuzzy identification of cutting acoustic emission with extended subtractive cluster analysis. Q Ren, L Baron, M Balazinski, Nonlinear Dyn. 674Q. Ren, L. Baron, and M. Balazinski, \"Fuzzy identification of cutting acoustic emission with extended subtractive cluster analysis,\" Nonlinear Dyn, vol. 67, no. 4, pp. 2599-2608, Mar. 2012.\n\nFuzzy C-means and fuzzy swarm for fuzzy clustering problem. H Izakian, A Abraham, Expert Syst. Appl. 383H. Izakian and A. Abraham, \"Fuzzy C-means and fuzzy swarm for fuzzy clustering problem,\" Expert Syst. Appl., vol. 38, no. 3, pp. 1835-1838, Mar. 2011.\n", "annotations": {"author": "[{\"end\":277,\"start\":96},{\"end\":450,\"start\":278},{\"end\":630,\"start\":451},{\"end\":799,\"start\":631},{\"end\":978,\"start\":800},{\"end\":1155,\"start\":979},{\"end\":1329,\"start\":1156},{\"end\":1523,\"start\":1330},{\"end\":1689,\"start\":1524},{\"end\":1858,\"start\":1690},{\"end\":1935,\"start\":1859}]", "publisher": null, "author_last_name": "[{\"end\":115,\"start\":108},{\"end\":467,\"start\":460},{\"end\":642,\"start\":638},{\"end\":814,\"start\":806},{\"end\":1017,\"start\":1007},{\"end\":1175,\"start\":1168},{\"end\":1345,\"start\":1337},{\"end\":1535,\"start\":1531},{\"end\":1704,\"start\":1696},{\"end\":1875,\"start\":1868}]", "author_first_name": "[{\"end\":101,\"start\":96},{\"end\":107,\"start\":102},{\"end\":303,\"start\":297},{\"end\":312,\"start\":304},{\"end\":459,\"start\":451},{\"end\":637,\"start\":631},{\"end\":805,\"start\":800},{\"end\":1006,\"start\":998},{\"end\":1161,\"start\":1156},{\"end\":1167,\"start\":1162},{\"end\":1336,\"start\":1330},{\"end\":1530,\"start\":1524},{\"end\":1695,\"start\":1690},{\"end\":1867,\"start\":1859}]", "author_affiliation": "[{\"end\":276,\"start\":141},{\"end\":449,\"start\":314},{\"end\":629,\"start\":494},{\"end\":798,\"start\":663},{\"end\":977,\"start\":842},{\"end\":1154,\"start\":1019},{\"end\":1328,\"start\":1177},{\"end\":1522,\"start\":1371},{\"end\":1688,\"start\":1537},{\"end\":1857,\"start\":1706},{\"end\":1934,\"start\":1877}]", "title": "[{\"end\":85,\"start\":1},{\"end\":2020,\"start\":1936}]", "venue": "[{\"end\":2065,\"start\":2022}]", "abstract": "[{\"end\":4057,\"start\":2524}]", "bib_ref": "[{\"attributes\":{\"ref_id\":\"b0\"},\"end\":4195,\"start\":4192},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":4200,\"start\":4197},{\"attributes\":{\"ref_id\":\"b5\"},\"end\":4334,\"start\":4331},{\"attributes\":{\"ref_id\":\"b6\"},\"end\":4449,\"start\":4446},{\"attributes\":{\"ref_id\":\"b8\"},\"end\":4454,\"start\":4451},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":4734,\"start\":4730},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":4740,\"start\":4736},{\"attributes\":{\"ref_id\":\"b11\"},\"end\":4822,\"start\":4818},{\"attributes\":{\"ref_id\":\"b13\"},\"end\":4828,\"start\":4824},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":4855,\"start\":4851},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":4874,\"start\":4870},{\"attributes\":{\"ref_id\":\"b16\"},\"end\":4907,\"start\":4903},{\"attributes\":{\"ref_id\":\"b17\"},\"end\":4913,\"start\":4909},{\"attributes\":{\"ref_id\":\"b18\"},\"end\":5150,\"start\":5146},{\"attributes\":{\"ref_id\":\"b20\"},\"end\":5156,\"start\":5152},{\"attributes\":{\"ref_id\":\"b0\"},\"end\":5365,\"start\":5362},{\"attributes\":{\"ref_id\":\"b21\"},\"end\":5371,\"start\":5367},{\"attributes\":{\"ref_id\":\"b24\"},\"end\":5377,\"start\":5373},{\"attributes\":{\"ref_id\":\"b25\"},\"end\":5662,\"start\":5658},{\"attributes\":{\"ref_id\":\"b26\"},\"end\":5668,\"start\":5664},{\"attributes\":{\"ref_id\":\"b27\"},\"end\":7850,\"start\":7846},{\"attributes\":{\"ref_id\":\"b24\"},\"end\":8261,\"start\":8257},{\"attributes\":{\"ref_id\":\"b27\"},\"end\":8270,\"start\":8266},{\"attributes\":{\"ref_id\":\"b27\"},\"end\":8348,\"start\":8344},{\"attributes\":{\"ref_id\":\"b24\"},\"end\":8415,\"start\":8411},{\"attributes\":{\"ref_id\":\"b24\"},\"end\":8577,\"start\":8573},{\"attributes\":{\"ref_id\":\"b32\"},\"end\":10388,\"start\":10384},{\"attributes\":{\"ref_id\":\"b33\"},\"end\":10394,\"start\":10390},{\"attributes\":{\"ref_id\":\"b2\"},\"end\":10580,\"start\":10577},{\"attributes\":{\"ref_id\":\"b34\"},\"end\":10823,\"start\":10819},{\"attributes\":{\"ref_id\":\"b35\"},\"end\":11195,\"start\":11191},{\"attributes\":{\"ref_id\":\"b35\"},\"end\":11205,\"start\":11201},{\"attributes\":{\"ref_id\":\"b31\"},\"end\":11475,\"start\":11471},{\"attributes\":{\"ref_id\":\"b36\"},\"end\":12047,\"start\":12043},{\"attributes\":{\"ref_id\":\"b37\"},\"end\":12447,\"start\":12443},{\"attributes\":{\"ref_id\":\"b37\"},\"end\":12859,\"start\":12855},{\"attributes\":{\"ref_id\":\"b38\"},\"end\":13084,\"start\":13080},{\"attributes\":{\"ref_id\":\"b37\"},\"end\":13581,\"start\":13577},{\"attributes\":{\"ref_id\":\"b11\"},\"end\":14269,\"start\":14265},{\"attributes\":{\"ref_id\":\"b13\"},\"end\":14275,\"start\":14271},{\"attributes\":{\"ref_id\":\"b19\"},\"end\":14753,\"start\":14749},{\"attributes\":{\"ref_id\":\"b19\"},\"end\":16046,\"start\":16042},{\"attributes\":{\"ref_id\":\"b16\"},\"end\":22351,\"start\":22347},{\"attributes\":{\"ref_id\":\"b17\"},\"end\":22359,\"start\":22355},{\"attributes\":{\"ref_id\":\"b39\"},\"end\":28211,\"start\":28207},{\"attributes\":{\"ref_id\":\"b40\"},\"end\":28220,\"start\":28216},{\"attributes\":{\"ref_id\":\"b41\"},\"end\":37955,\"start\":37951},{\"attributes\":{\"ref_id\":\"b42\"},\"end\":38788,\"start\":38784},{\"attributes\":{\"ref_id\":\"b33\"},\"end\":39464,\"start\":39460}]", "figure": "[{\"attributes\":{\"id\":\"fig_0\"},\"end\":39465,\"start\":39411},{\"attributes\":{\"id\":\"fig_1\"},\"end\":40073,\"start\":39466},{\"attributes\":{\"id\":\"fig_2\"},\"end\":40168,\"start\":40074},{\"attributes\":{\"id\":\"fig_3\"},\"end\":40226,\"start\":40169},{\"attributes\":{\"id\":\"fig_4\"},\"end\":40290,\"start\":40227},{\"attributes\":{\"id\":\"fig_5\"},\"end\":40366,\"start\":40291},{\"attributes\":{\"id\":\"fig_6\"},\"end\":40445,\"start\":40367},{\"attributes\":{\"id\":\"tab_0\",\"type\":\"table\"},\"end\":40549,\"start\":40446},{\"attributes\":{\"id\":\"tab_1\",\"type\":\"table\"},\"end\":40604,\"start\":40550},{\"attributes\":{\"id\":\"tab_2\",\"type\":\"table\"},\"end\":40658,\"start\":40605}]", "paragraph": "[{\"end\":4455,\"start\":4076},{\"end\":5276,\"start\":4457},{\"end\":5669,\"start\":5278},{\"end\":6798,\"start\":5671},{\"end\":7091,\"start\":6800},{\"end\":8578,\"start\":7141},{\"end\":8627,\"start\":8580},{\"end\":8736,\"start\":8629},{\"end\":9530,\"start\":8738},{\"end\":9984,\"start\":9532},{\"end\":11196,\"start\":10070},{\"end\":12125,\"start\":11198},{\"end\":12340,\"start\":12127},{\"end\":12448,\"start\":12371},{\"end\":12628,\"start\":12501},{\"end\":12749,\"start\":12686},{\"end\":12860,\"start\":12810},{\"end\":13085,\"start\":12913},{\"end\":13720,\"start\":13143},{\"end\":14260,\"start\":13756},{\"end\":14754,\"start\":14262},{\"end\":14881,\"start\":14756},{\"end\":15217,\"start\":14883},{\"end\":15360,\"start\":15253},{\"end\":15792,\"start\":15435},{\"end\":16047,\"start\":15805},{\"end\":16709,\"start\":16068},{\"end\":16868,\"start\":16776},{\"end\":17419,\"start\":16934},{\"end\":17914,\"start\":17421},{\"end\":18283,\"start\":17948},{\"end\":18486,\"start\":18361},{\"end\":18576,\"start\":18529},{\"end\":18707,\"start\":18652},{\"end\":18952,\"start\":18797},{\"end\":19451,\"start\":18996},{\"end\":19555,\"start\":19473},{\"end\":19918,\"start\":19616},{\"end\":20410,\"start\":20061},{\"end\":21117,\"start\":20412},{\"end\":21564,\"start\":21178},{\"end\":21979,\"start\":21566},{\"end\":22278,\"start\":22113},{\"end\":22556,\"start\":22337},{\"end\":23346,\"start\":22558},{\"end\":24146,\"start\":23362},{\"end\":24641,\"start\":24148},{\"end\":24843,\"start\":24643},{\"end\":25016,\"start\":24912},{\"end\":25109,\"start\":25045},{\"end\":25533,\"start\":25139},{\"end\":27204,\"start\":25535},{\"end\":27652,\"start\":27206},{\"end\":28886,\"start\":27672},{\"end\":29117,\"start\":28888},{\"end\":29638,\"start\":29166},{\"end\":29744,\"start\":29640},{\"end\":30114,\"start\":29746},{\"end\":30907,\"start\":30116},{\"end\":31446,\"start\":30909},{\"end\":31718,\"start\":31448},{\"end\":32665,\"start\":31756},{\"end\":34211,\"start\":32695},{\"end\":34688,\"start\":34213},{\"end\":35757,\"start\":34722},{\"end\":36341,\"start\":35759},{\"end\":37707,\"start\":36359},{\"end\":38789,\"start\":37746},{\"end\":39124,\"start\":38833},{\"end\":39410,\"start\":39168}]", "formula": "[{\"attributes\":{\"id\":\"formula_0\"},\"end\":12500,\"start\":12449},{\"attributes\":{\"id\":\"formula_1\"},\"end\":12685,\"start\":12629},{\"attributes\":{\"id\":\"formula_2\"},\"end\":12809,\"start\":12750},{\"attributes\":{\"id\":\"formula_3\"},\"end\":12912,\"start\":12861},{\"attributes\":{\"id\":\"formula_4\"},\"end\":13142,\"start\":13086},{\"attributes\":{\"id\":\"formula_5\"},\"end\":15252,\"start\":15218},{\"attributes\":{\"id\":\"formula_6\"},\"end\":15434,\"start\":15361},{\"attributes\":{\"id\":\"formula_7\"},\"end\":15804,\"start\":15793},{\"attributes\":{\"id\":\"formula_8\"},\"end\":16067,\"start\":16048},{\"attributes\":{\"id\":\"formula_9\"},\"end\":16775,\"start\":16710},{\"attributes\":{\"id\":\"formula_10\"},\"end\":16933,\"start\":16869},{\"attributes\":{\"id\":\"formula_11\"},\"end\":17947,\"start\":17915},{\"attributes\":{\"id\":\"formula_12\"},\"end\":18360,\"start\":18284},{\"attributes\":{\"id\":\"formula_13\"},\"end\":18528,\"start\":18487},{\"attributes\":{\"id\":\"formula_14\"},\"end\":18651,\"start\":18577},{\"attributes\":{\"id\":\"formula_15\"},\"end\":18796,\"start\":18708},{\"attributes\":{\"id\":\"formula_16\"},\"end\":18995,\"start\":18953},{\"attributes\":{\"id\":\"formula_17\"},\"end\":19472,\"start\":19452},{\"attributes\":{\"id\":\"formula_18\"},\"end\":19615,\"start\":19556},{\"attributes\":{\"id\":\"formula_19\"},\"end\":20060,\"start\":19919},{\"attributes\":{\"id\":\"formula_20\"},\"end\":21177,\"start\":21118},{\"attributes\":{\"id\":\"formula_21\"},\"end\":22112,\"start\":21980},{\"attributes\":{\"id\":\"formula_22\"},\"end\":22336,\"start\":22279},{\"attributes\":{\"id\":\"formula_23\"},\"end\":24911,\"start\":24844},{\"attributes\":{\"id\":\"formula_24\"},\"end\":25044,\"start\":25017},{\"attributes\":{\"id\":\"formula_25\"},\"end\":25138,\"start\":25110},{\"attributes\":{\"id\":\"formula_26\"},\"end\":38832,\"start\":38790},{\"attributes\":{\"id\":\"formula_27\"},\"end\":39167,\"start\":39125}]", "table_ref": "[{\"attributes\":{\"ref_id\":\"tab_0\"},\"end\":8125,\"start\":8118},{\"attributes\":{\"ref_id\":\"tab_0\"},\"end\":8219,\"start\":8212},{\"attributes\":{\"ref_id\":\"tab_0\"},\"end\":11741,\"start\":11734},{\"attributes\":{\"ref_id\":\"tab_0\"},\"end\":29548,\"start\":29540},{\"attributes\":{\"ref_id\":\"tab_0\"},\"end\":29922,\"start\":29914},{\"attributes\":{\"ref_id\":\"tab_0\"},\"end\":30865,\"start\":30856},{\"attributes\":{\"ref_id\":\"tab_0\"},\"end\":31287,\"start\":31279},{\"attributes\":{\"ref_id\":\"tab_0\"},\"end\":33406,\"start\":33397},{\"attributes\":{\"ref_id\":\"tab_0\"},\"end\":33913,\"start\":33904},{\"attributes\":{\"ref_id\":\"tab_0\"},\"end\":35010,\"start\":35002}]", "section_header": "[{\"end\":4074,\"start\":4059},{\"end\":7139,\"start\":7094},{\"end\":10068,\"start\":9987},{\"end\":12369,\"start\":12343},{\"end\":13754,\"start\":13723},{\"end\":23360,\"start\":23349},{\"end\":27670,\"start\":27655},{\"end\":29164,\"start\":29120},{\"end\":31754,\"start\":31721},{\"end\":32693,\"start\":32668},{\"end\":34720,\"start\":34691},{\"end\":36357,\"start\":36344},{\"end\":37744,\"start\":37710},{\"end\":39420,\"start\":39412},{\"end\":39482,\"start\":39467},{\"end\":40083,\"start\":40075},{\"end\":40178,\"start\":40170},{\"end\":40236,\"start\":40228},{\"end\":40300,\"start\":40292},{\"end\":40376,\"start\":40368},{\"end\":40465,\"start\":40447},{\"end\":40566,\"start\":40551},{\"end\":40624,\"start\":40606}]", "table": null, "figure_caption": "[{\"end\":39465,\"start\":39422},{\"end\":40073,\"start\":39486},{\"end\":40168,\"start\":40085},{\"end\":40226,\"start\":40180},{\"end\":40290,\"start\":40238},{\"end\":40366,\"start\":40302},{\"end\":40445,\"start\":40378},{\"end\":40549,\"start\":40467},{\"end\":40604,\"start\":40569},{\"end\":40658,\"start\":40628}]", "figure_ref": "[{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":10475,\"start\":10469},{\"attributes\":{\"ref_id\":\"fig_2\"},\"end\":27809,\"start\":27803},{\"attributes\":{\"ref_id\":\"fig_3\"},\"end\":28431,\"start\":28425},{\"attributes\":{\"ref_id\":\"fig_4\"},\"end\":33171,\"start\":33165},{\"attributes\":{\"ref_id\":\"fig_3\"},\"end\":33488,\"start\":33482},{\"attributes\":{\"ref_id\":\"fig_5\"},\"end\":34439,\"start\":34433},{\"attributes\":{\"ref_id\":\"fig_6\"},\"end\":34944,\"start\":34938},{\"attributes\":{\"ref_id\":\"fig_6\"},\"end\":35278,\"start\":35272}]", "bib_author_first_name": "[{\"end\":42776,\"start\":42775},{\"end\":42785,\"start\":42784},{\"end\":42794,\"start\":42793},{\"end\":42804,\"start\":42803},{\"end\":42815,\"start\":42814},{\"end\":42830,\"start\":42829},{\"end\":43096,\"start\":43092},{\"end\":43103,\"start\":43102},{\"end\":43114,\"start\":43110},{\"end\":43392,\"start\":43391},{\"end\":43404,\"start\":43403},{\"end\":43415,\"start\":43414},{\"end\":43426,\"start\":43425},{\"end\":43752,\"start\":43751},{\"end\":43760,\"start\":43759},{\"end\":43767,\"start\":43766},{\"end\":43775,\"start\":43774},{\"end\":43781,\"start\":43780},{\"end\":44090,\"start\":44089},{\"end\":44105,\"start\":44104},{\"end\":44112,\"start\":44111},{\"end\":44114,\"start\":44113},{\"end\":44456,\"start\":44455},{\"end\":44466,\"start\":44465},{\"end\":44478,\"start\":44477},{\"end\":44832,\"start\":44831},{\"end\":44834,\"start\":44833},{\"end\":44844,\"start\":44843},{\"end\":44846,\"start\":44845},{\"end\":44856,\"start\":44855},{\"end\":44858,\"start\":44857},{\"end\":44868,\"start\":44867},{\"end\":45207,\"start\":45206},{\"end\":45216,\"start\":45215},{\"end\":45230,\"start\":45229},{\"end\":45607,\"start\":45606},{\"end\":45616,\"start\":45615},{\"end\":45618,\"start\":45617},{\"end\":45626,\"start\":45625},{\"end\":45636,\"start\":45635},{\"end\":45924,\"start\":45923},{\"end\":45932,\"start\":45931},{\"end\":45940,\"start\":45939},{\"end\":45947,\"start\":45946},{\"end\":45953,\"start\":45952},{\"end\":45960,\"start\":45959},{\"end\":46297,\"start\":46296},{\"end\":46311,\"start\":46310},{\"end\":46323,\"start\":46322},{\"end\":46336,\"start\":46335},{\"end\":46346,\"start\":46345},{\"end\":46348,\"start\":46347},{\"end\":46687,\"start\":46686},{\"end\":46695,\"start\":46694},{\"end\":46945,\"start\":46944},{\"end\":46952,\"start\":46951},{\"end\":47237,\"start\":47236},{\"end\":47250,\"start\":47249},{\"end\":47267,\"start\":47266},{\"end\":47269,\"start\":47268},{\"end\":47647,\"start\":47646},{\"end\":47656,\"start\":47652},{\"end\":47960,\"start\":47959},{\"end\":47973,\"start\":47972},{\"end\":47980,\"start\":47979},{\"end\":47986,\"start\":47985},{\"end\":48360,\"start\":48359},{\"end\":48366,\"start\":48365},{\"end\":48368,\"start\":48367},{\"end\":48378,\"start\":48377},{\"end\":48727,\"start\":48726},{\"end\":48740,\"start\":48739},{\"end\":48742,\"start\":48741},{\"end\":48752,\"start\":48751},{\"end\":48766,\"start\":48765},{\"end\":48782,\"start\":48781},{\"end\":49102,\"start\":49101},{\"end\":49109,\"start\":49108},{\"end\":49115,\"start\":49114},{\"end\":49449,\"start\":49448},{\"end\":49456,\"start\":49455},{\"end\":49464,\"start\":49463},{\"end\":49466,\"start\":49465},{\"end\":49774,\"start\":49770},{\"end\":49783,\"start\":49779},{\"end\":50097,\"start\":50096},{\"end\":50108,\"start\":50107},{\"end\":50110,\"start\":50109},{\"end\":50119,\"start\":50118},{\"end\":50128,\"start\":50127},{\"end\":50130,\"start\":50129},{\"end\":50530,\"start\":50529},{\"end\":50536,\"start\":50535},{\"end\":50543,\"start\":50542},{\"end\":50551,\"start\":50550},{\"end\":50559,\"start\":50558},{\"end\":50907,\"start\":50906},{\"end\":50921,\"start\":50920},{\"end\":51259,\"start\":51258},{\"end\":51266,\"start\":51265},{\"end\":51626,\"start\":51625},{\"end\":51637,\"start\":51636},{\"end\":51968,\"start\":51967},{\"end\":51979,\"start\":51978},{\"end\":51981,\"start\":51980},{\"end\":51988,\"start\":51987},{\"end\":51995,\"start\":51994},{\"end\":52343,\"start\":52342},{\"end\":52353,\"start\":52352},{\"end\":52355,\"start\":52354},{\"end\":52365,\"start\":52364},{\"end\":52377,\"start\":52376},{\"end\":52379,\"start\":52378},{\"end\":52388,\"start\":52387},{\"end\":52390,\"start\":52389},{\"end\":52401,\"start\":52400},{\"end\":52403,\"start\":52402},{\"end\":52759,\"start\":52758},{\"end\":52773,\"start\":52772},{\"end\":52775,\"start\":52774},{\"end\":52784,\"start\":52783},{\"end\":52793,\"start\":52792},{\"end\":53105,\"start\":53104},{\"end\":53114,\"start\":53113},{\"end\":53116,\"start\":53115},{\"end\":53126,\"start\":53125},{\"end\":53134,\"start\":53133},{\"end\":53141,\"start\":53140},{\"end\":53143,\"start\":53142},{\"end\":53508,\"start\":53507},{\"end\":53516,\"start\":53515},{\"end\":53524,\"start\":53523},{\"end\":53857,\"start\":53856},{\"end\":53865,\"start\":53864},{\"end\":53874,\"start\":53873},{\"end\":53881,\"start\":53880},{\"end\":53889,\"start\":53888},{\"end\":53897,\"start\":53896},{\"end\":54172,\"start\":54171},{\"end\":54174,\"start\":54173},{\"end\":54184,\"start\":54183},{\"end\":54186,\"start\":54185},{\"end\":54486,\"start\":54485},{\"end\":54494,\"start\":54493},{\"end\":54500,\"start\":54499},{\"end\":54506,\"start\":54505},{\"end\":54806,\"start\":54805},{\"end\":54819,\"start\":54818},{\"end\":54830,\"start\":54829},{\"end\":54832,\"start\":54831},{\"end\":54841,\"start\":54840},{\"end\":54843,\"start\":54842},{\"end\":55170,\"start\":55169},{\"end\":55178,\"start\":55177},{\"end\":55185,\"start\":55184},{\"end\":55193,\"start\":55192},{\"end\":55199,\"start\":55198},{\"end\":55555,\"start\":55554},{\"end\":55557,\"start\":55556},{\"end\":55567,\"start\":55566},{\"end\":55575,\"start\":55574},{\"end\":55577,\"start\":55576},{\"end\":55905,\"start\":55904},{\"end\":55914,\"start\":55913},{\"end\":55916,\"start\":55915},{\"end\":55930,\"start\":55929},{\"end\":55932,\"start\":55931},{\"end\":56252,\"start\":56251},{\"end\":56254,\"start\":56253},{\"end\":56666,\"start\":56665},{\"end\":56678,\"start\":56677},{\"end\":56692,\"start\":56691},{\"end\":56694,\"start\":56693},{\"end\":57006,\"start\":57005},{\"end\":57018,\"start\":57017},{\"end\":57026,\"start\":57025},{\"end\":57324,\"start\":57323},{\"end\":57331,\"start\":57330},{\"end\":57340,\"start\":57339},{\"end\":57623,\"start\":57622},{\"end\":57634,\"start\":57633}]", "bib_author_last_name": "[{\"end\":42782,\"start\":42777},{\"end\":42791,\"start\":42786},{\"end\":42801,\"start\":42795},{\"end\":42812,\"start\":42805},{\"end\":42827,\"start\":42816},{\"end\":42837,\"start\":42831},{\"end\":43100,\"start\":43097},{\"end\":43108,\"start\":43104},{\"end\":43118,\"start\":43115},{\"end\":43401,\"start\":43393},{\"end\":43412,\"start\":43405},{\"end\":43423,\"start\":43416},{\"end\":43431,\"start\":43427},{\"end\":43757,\"start\":43753},{\"end\":43764,\"start\":43761},{\"end\":43772,\"start\":43768},{\"end\":43778,\"start\":43776},{\"end\":43786,\"start\":43782},{\"end\":44102,\"start\":44091},{\"end\":44109,\"start\":44106},{\"end\":44122,\"start\":44115},{\"end\":44463,\"start\":44457},{\"end\":44475,\"start\":44467},{\"end\":44488,\"start\":44479},{\"end\":44841,\"start\":44835},{\"end\":44853,\"start\":44847},{\"end\":44865,\"start\":44859},{\"end\":44877,\"start\":44869},{\"end\":45213,\"start\":45208},{\"end\":45227,\"start\":45217},{\"end\":45240,\"start\":45231},{\"end\":45613,\"start\":45608},{\"end\":45623,\"start\":45619},{\"end\":45633,\"start\":45627},{\"end\":45647,\"start\":45637},{\"end\":45929,\"start\":45925},{\"end\":45937,\"start\":45933},{\"end\":45944,\"start\":45941},{\"end\":45950,\"start\":45948},{\"end\":45957,\"start\":45954},{\"end\":45964,\"start\":45961},{\"end\":46308,\"start\":46298},{\"end\":46320,\"start\":46312},{\"end\":46333,\"start\":46324},{\"end\":46343,\"start\":46337},{\"end\":46359,\"start\":46349},{\"end\":46692,\"start\":46688},{\"end\":46700,\"start\":46696},{\"end\":46949,\"start\":46946},{\"end\":46957,\"start\":46953},{\"end\":47247,\"start\":47238},{\"end\":47264,\"start\":47251},{\"end\":47284,\"start\":47270},{\"end\":47650,\"start\":47648},{\"end\":47662,\"start\":47657},{\"end\":47970,\"start\":47961},{\"end\":47977,\"start\":47974},{\"end\":47983,\"start\":47981},{\"end\":47990,\"start\":47987},{\"end\":48363,\"start\":48361},{\"end\":48375,\"start\":48369},{\"end\":48382,\"start\":48379},{\"end\":48737,\"start\":48728},{\"end\":48749,\"start\":48743},{\"end\":48763,\"start\":48753},{\"end\":48779,\"start\":48767},{\"end\":48787,\"start\":48783},{\"end\":49106,\"start\":49103},{\"end\":49112,\"start\":49110},{\"end\":49124,\"start\":49116},{\"end\":49453,\"start\":49450},{\"end\":49461,\"start\":49457},{\"end\":49473,\"start\":49467},{\"end\":49777,\"start\":49775},{\"end\":49788,\"start\":49784},{\"end\":50105,\"start\":50098},{\"end\":50116,\"start\":50111},{\"end\":50125,\"start\":50120},{\"end\":50138,\"start\":50131},{\"end\":50533,\"start\":50531},{\"end\":50540,\"start\":50537},{\"end\":50548,\"start\":50544},{\"end\":50556,\"start\":50552},{\"end\":50562,\"start\":50560},{\"end\":50918,\"start\":50908},{\"end\":50930,\"start\":50922},{\"end\":51263,\"start\":51260},{\"end\":51271,\"start\":51267},{\"end\":51634,\"start\":51627},{\"end\":51641,\"start\":51638},{\"end\":51976,\"start\":51969},{\"end\":51985,\"start\":51982},{\"end\":51992,\"start\":51989},{\"end\":52004,\"start\":51996},{\"end\":52350,\"start\":52344},{\"end\":52362,\"start\":52356},{\"end\":52374,\"start\":52366},{\"end\":52385,\"start\":52380},{\"end\":52398,\"start\":52391},{\"end\":52411,\"start\":52404},{\"end\":52770,\"start\":52760},{\"end\":52781,\"start\":52776},{\"end\":52790,\"start\":52785},{\"end\":52799,\"start\":52794},{\"end\":53111,\"start\":53106},{\"end\":53123,\"start\":53117},{\"end\":53131,\"start\":53127},{\"end\":53138,\"start\":53135},{\"end\":53148,\"start\":53144},{\"end\":53513,\"start\":53509},{\"end\":53521,\"start\":53517},{\"end\":53527,\"start\":53525},{\"end\":53862,\"start\":53858},{\"end\":53871,\"start\":53866},{\"end\":53878,\"start\":53875},{\"end\":53886,\"start\":53882},{\"end\":53894,\"start\":53890},{\"end\":53900,\"start\":53898},{\"end\":54181,\"start\":54175},{\"end\":54192,\"start\":54187},{\"end\":54491,\"start\":54487},{\"end\":54497,\"start\":54495},{\"end\":54503,\"start\":54501},{\"end\":54510,\"start\":54507},{\"end\":54816,\"start\":54807},{\"end\":54827,\"start\":54820},{\"end\":54838,\"start\":54833},{\"end\":54850,\"start\":54844},{\"end\":55175,\"start\":55171},{\"end\":55182,\"start\":55179},{\"end\":55190,\"start\":55186},{\"end\":55196,\"start\":55194},{\"end\":55203,\"start\":55200},{\"end\":55564,\"start\":55558},{\"end\":55572,\"start\":55568},{\"end\":55582,\"start\":55578},{\"end\":55911,\"start\":55906},{\"end\":55927,\"start\":55917},{\"end\":55938,\"start\":55933},{\"end\":56263,\"start\":56255},{\"end\":56675,\"start\":56667},{\"end\":56689,\"start\":56679},{\"end\":56704,\"start\":56695},{\"end\":57015,\"start\":57007},{\"end\":57023,\"start\":57019},{\"end\":57029,\"start\":57027},{\"end\":57328,\"start\":57325},{\"end\":57337,\"start\":57332},{\"end\":57351,\"start\":57341},{\"end\":57631,\"start\":57624},{\"end\":57642,\"start\":57635}]", "bib_entry": "[{\"attributes\":{\"id\":\"b0\",\"matched_paper_id\":10886316},\"end\":43040,\"start\":42740},{\"attributes\":{\"id\":\"b1\",\"matched_paper_id\":116632238},\"end\":43305,\"start\":43042},{\"attributes\":{\"id\":\"b2\",\"matched_paper_id\":11555818},\"end\":43675,\"start\":43307},{\"attributes\":{\"id\":\"b3\",\"matched_paper_id\":116188102},\"end\":44002,\"start\":43677},{\"attributes\":{\"id\":\"b4\",\"matched_paper_id\":203119893},\"end\":44347,\"start\":44004},{\"attributes\":{\"doi\":\"10.1109/JSYST.2020.3001016\",\"id\":\"b5\",\"matched_paper_id\":226484169},\"end\":44735,\"start\":44349},{\"attributes\":{\"id\":\"b6\",\"matched_paper_id\":67868456},\"end\":45105,\"start\":44737},{\"attributes\":{\"doi\":\"10.1109/JESTPE.2019.2953480\",\"id\":\"b7\",\"matched_paper_id\":209102208},\"end\":45543,\"start\":45107},{\"attributes\":{\"id\":\"b8\",\"matched_paper_id\":213838162},\"end\":45868,\"start\":45545},{\"attributes\":{\"id\":\"b9\",\"matched_paper_id\":2195544},\"end\":46211,\"start\":45870},{\"attributes\":{\"doi\":\"10.1109/JSYST.2021.3054947\",\"id\":\"b10\",\"matched_paper_id\":234112702},\"end\":46616,\"start\":46213},{\"attributes\":{\"id\":\"b11\",\"matched_paper_id\":7331541},\"end\":46886,\"start\":46618},{\"attributes\":{\"id\":\"b12\",\"matched_paper_id\":5968811},\"end\":47155,\"start\":46888},{\"attributes\":{\"id\":\"b13\",\"matched_paper_id\":109962454},\"end\":47566,\"start\":47157},{\"attributes\":{\"id\":\"b14\",\"matched_paper_id\":174817591},\"end\":47852,\"start\":47568},{\"attributes\":{\"id\":\"b15\",\"matched_paper_id\":3866942},\"end\":48245,\"start\":47854},{\"attributes\":{\"id\":\"b16\",\"matched_paper_id\":30397074},\"end\":48621,\"start\":48247},{\"attributes\":{\"id\":\"b17\",\"matched_paper_id\":197433447},\"end\":49046,\"start\":48623},{\"attributes\":{\"id\":\"b18\",\"matched_paper_id\":16814580},\"end\":49367,\"start\":49048},{\"attributes\":{\"id\":\"b19\",\"matched_paper_id\":838905},\"end\":49688,\"start\":49369},{\"attributes\":{\"id\":\"b20\",\"matched_paper_id\":33602997},\"end\":49986,\"start\":49690},{\"attributes\":{\"id\":\"b21\",\"matched_paper_id\":1623815},\"end\":50446,\"start\":49988},{\"attributes\":{\"id\":\"b22\",\"matched_paper_id\":7219190},\"end\":50802,\"start\":50448},{\"attributes\":{\"id\":\"b23\",\"matched_paper_id\":9239079},\"end\":51183,\"start\":50804},{\"attributes\":{\"id\":\"b24\",\"matched_paper_id\":16375707},\"end\":51510,\"start\":51185},{\"attributes\":{\"id\":\"b25\",\"matched_paper_id\":13974817},\"end\":51880,\"start\":51512},{\"attributes\":{\"id\":\"b26\",\"matched_paper_id\":17077427},\"end\":52242,\"start\":51882},{\"attributes\":{\"id\":\"b27\",\"matched_paper_id\":9507111},\"end\":52688,\"start\":52244},{\"attributes\":{\"id\":\"b28\",\"matched_paper_id\":132127069},\"end\":53030,\"start\":52690},{\"attributes\":{\"id\":\"b29\",\"matched_paper_id\":12834276},\"end\":53424,\"start\":53032},{\"attributes\":{\"id\":\"b30\",\"matched_paper_id\":2748696},\"end\":53738,\"start\":53426},{\"attributes\":{\"id\":\"b31\",\"matched_paper_id\":4684739},\"end\":54167,\"start\":53740},{\"attributes\":{\"id\":\"b32\"},\"end\":54389,\"start\":54169},{\"attributes\":{\"id\":\"b33\",\"matched_paper_id\":109322948},\"end\":54740,\"start\":54391},{\"attributes\":{\"id\":\"b34\",\"matched_paper_id\":1971775},\"end\":55060,\"start\":54742},{\"attributes\":{\"id\":\"b35\",\"matched_paper_id\":116314404},\"end\":55466,\"start\":55062},{\"attributes\":{\"id\":\"b36\",\"matched_paper_id\":209777546},\"end\":55803,\"start\":55468},{\"attributes\":{\"id\":\"b37\",\"matched_paper_id\":111195952},\"end\":56183,\"start\":55805},{\"attributes\":{\"id\":\"b38\"},\"end\":56584,\"start\":56185},{\"attributes\":{\"id\":\"b39\",\"matched_paper_id\":9722495},\"end\":56929,\"start\":56586},{\"attributes\":{\"id\":\"b40\",\"matched_paper_id\":111018475},\"end\":57227,\"start\":56931},{\"attributes\":{\"id\":\"b41\",\"matched_paper_id\":123005380},\"end\":57560,\"start\":57229},{\"attributes\":{\"id\":\"b42\",\"matched_paper_id\":29652707},\"end\":57816,\"start\":57562}]", "bib_title": "[{\"end\":42773,\"start\":42740},{\"end\":43090,\"start\":43042},{\"end\":43389,\"start\":43307},{\"end\":43749,\"start\":43677},{\"end\":44087,\"start\":44004},{\"end\":44453,\"start\":44349},{\"end\":44829,\"start\":44737},{\"end\":45204,\"start\":45107},{\"end\":45604,\"start\":45545},{\"end\":45921,\"start\":45870},{\"end\":46294,\"start\":46213},{\"end\":46684,\"start\":46618},{\"end\":46942,\"start\":46888},{\"end\":47234,\"start\":47157},{\"end\":47644,\"start\":47568},{\"end\":47957,\"start\":47854},{\"end\":48357,\"start\":48247},{\"end\":48724,\"start\":48623},{\"end\":49099,\"start\":49048},{\"end\":49446,\"start\":49369},{\"end\":49768,\"start\":49690},{\"end\":50094,\"start\":49988},{\"end\":50527,\"start\":50448},{\"end\":50904,\"start\":50804},{\"end\":51256,\"start\":51185},{\"end\":51623,\"start\":51512},{\"end\":51965,\"start\":51882},{\"end\":52340,\"start\":52244},{\"end\":52756,\"start\":52690},{\"end\":53102,\"start\":53032},{\"end\":53505,\"start\":53426},{\"end\":53854,\"start\":53740},{\"end\":54483,\"start\":54391},{\"end\":54803,\"start\":54742},{\"end\":55167,\"start\":55062},{\"end\":55552,\"start\":55468},{\"end\":55902,\"start\":55805},{\"end\":56249,\"start\":56185},{\"end\":56663,\"start\":56586},{\"end\":57003,\"start\":56931},{\"end\":57321,\"start\":57229},{\"end\":57620,\"start\":57562}]", "bib_author": "[{\"end\":42784,\"start\":42775},{\"end\":42793,\"start\":42784},{\"end\":42803,\"start\":42793},{\"end\":42814,\"start\":42803},{\"end\":42829,\"start\":42814},{\"end\":42839,\"start\":42829},{\"end\":43102,\"start\":43092},{\"end\":43110,\"start\":43102},{\"end\":43120,\"start\":43110},{\"end\":43403,\"start\":43391},{\"end\":43414,\"start\":43403},{\"end\":43425,\"start\":43414},{\"end\":43433,\"start\":43425},{\"end\":43759,\"start\":43751},{\"end\":43766,\"start\":43759},{\"end\":43774,\"start\":43766},{\"end\":43780,\"start\":43774},{\"end\":43788,\"start\":43780},{\"end\":44104,\"start\":44089},{\"end\":44111,\"start\":44104},{\"end\":44124,\"start\":44111},{\"end\":44465,\"start\":44455},{\"end\":44477,\"start\":44465},{\"end\":44490,\"start\":44477},{\"end\":44843,\"start\":44831},{\"end\":44855,\"start\":44843},{\"end\":44867,\"start\":44855},{\"end\":44879,\"start\":44867},{\"end\":45215,\"start\":45206},{\"end\":45229,\"start\":45215},{\"end\":45242,\"start\":45229},{\"end\":45615,\"start\":45606},{\"end\":45625,\"start\":45615},{\"end\":45635,\"start\":45625},{\"end\":45649,\"start\":45635},{\"end\":45931,\"start\":45923},{\"end\":45939,\"start\":45931},{\"end\":45946,\"start\":45939},{\"end\":45952,\"start\":45946},{\"end\":45959,\"start\":45952},{\"end\":45966,\"start\":45959},{\"end\":46310,\"start\":46296},{\"end\":46322,\"start\":46310},{\"end\":46335,\"start\":46322},{\"end\":46345,\"start\":46335},{\"end\":46361,\"start\":46345},{\"end\":46694,\"start\":46686},{\"end\":46702,\"start\":46694},{\"end\":46951,\"start\":46944},{\"end\":46959,\"start\":46951},{\"end\":47249,\"start\":47236},{\"end\":47266,\"start\":47249},{\"end\":47286,\"start\":47266},{\"end\":47652,\"start\":47646},{\"end\":47664,\"start\":47652},{\"end\":47972,\"start\":47959},{\"end\":47979,\"start\":47972},{\"end\":47985,\"start\":47979},{\"end\":47992,\"start\":47985},{\"end\":48365,\"start\":48359},{\"end\":48377,\"start\":48365},{\"end\":48384,\"start\":48377},{\"end\":48739,\"start\":48726},{\"end\":48751,\"start\":48739},{\"end\":48765,\"start\":48751},{\"end\":48781,\"start\":48765},{\"end\":48789,\"start\":48781},{\"end\":49108,\"start\":49101},{\"end\":49114,\"start\":49108},{\"end\":49126,\"start\":49114},{\"end\":49455,\"start\":49448},{\"end\":49463,\"start\":49455},{\"end\":49475,\"start\":49463},{\"end\":49779,\"start\":49770},{\"end\":49790,\"start\":49779},{\"end\":50107,\"start\":50096},{\"end\":50118,\"start\":50107},{\"end\":50127,\"start\":50118},{\"end\":50140,\"start\":50127},{\"end\":50535,\"start\":50529},{\"end\":50542,\"start\":50535},{\"end\":50550,\"start\":50542},{\"end\":50558,\"start\":50550},{\"end\":50564,\"start\":50558},{\"end\":50920,\"start\":50906},{\"end\":50932,\"start\":50920},{\"end\":51265,\"start\":51258},{\"end\":51273,\"start\":51265},{\"end\":51636,\"start\":51625},{\"end\":51643,\"start\":51636},{\"end\":51978,\"start\":51967},{\"end\":51987,\"start\":51978},{\"end\":51994,\"start\":51987},{\"end\":52006,\"start\":51994},{\"end\":52352,\"start\":52342},{\"end\":52364,\"start\":52352},{\"end\":52376,\"start\":52364},{\"end\":52387,\"start\":52376},{\"end\":52400,\"start\":52387},{\"end\":52413,\"start\":52400},{\"end\":52772,\"start\":52758},{\"end\":52783,\"start\":52772},{\"end\":52792,\"start\":52783},{\"end\":52801,\"start\":52792},{\"end\":53113,\"start\":53104},{\"end\":53125,\"start\":53113},{\"end\":53133,\"start\":53125},{\"end\":53140,\"start\":53133},{\"end\":53150,\"start\":53140},{\"end\":53515,\"start\":53507},{\"end\":53523,\"start\":53515},{\"end\":53529,\"start\":53523},{\"end\":53864,\"start\":53856},{\"end\":53873,\"start\":53864},{\"end\":53880,\"start\":53873},{\"end\":53888,\"start\":53880},{\"end\":53896,\"start\":53888},{\"end\":53902,\"start\":53896},{\"end\":54183,\"start\":54171},{\"end\":54194,\"start\":54183},{\"end\":54493,\"start\":54485},{\"end\":54499,\"start\":54493},{\"end\":54505,\"start\":54499},{\"end\":54512,\"start\":54505},{\"end\":54818,\"start\":54805},{\"end\":54829,\"start\":54818},{\"end\":54840,\"start\":54829},{\"end\":54852,\"start\":54840},{\"end\":55177,\"start\":55169},{\"end\":55184,\"start\":55177},{\"end\":55192,\"start\":55184},{\"end\":55198,\"start\":55192},{\"end\":55205,\"start\":55198},{\"end\":55566,\"start\":55554},{\"end\":55574,\"start\":55566},{\"end\":55584,\"start\":55574},{\"end\":55913,\"start\":55904},{\"end\":55929,\"start\":55913},{\"end\":55940,\"start\":55929},{\"end\":56265,\"start\":56251},{\"end\":56677,\"start\":56665},{\"end\":56691,\"start\":56677},{\"end\":56706,\"start\":56691},{\"end\":57017,\"start\":57005},{\"end\":57025,\"start\":57017},{\"end\":57031,\"start\":57025},{\"end\":57330,\"start\":57323},{\"end\":57339,\"start\":57330},{\"end\":57353,\"start\":57339},{\"end\":57633,\"start\":57622},{\"end\":57644,\"start\":57633}]", "bib_venue": "[{\"end\":43489,\"start\":43465},{\"end\":46008,\"start\":45991},{\"end\":47015,\"start\":46991},{\"end\":49208,\"start\":49171},{\"end\":50214,\"start\":50181},{\"end\":50616,\"start\":50594},{\"end\":50988,\"start\":50964},{\"end\":51347,\"start\":51314},{\"end\":53228,\"start\":53193},{\"end\":42861,\"start\":42839},{\"end\":43153,\"start\":43120},{\"end\":43463,\"start\":43433},{\"end\":43810,\"start\":43788},{\"end\":44146,\"start\":44124},{\"end\":44528,\"start\":44516},{\"end\":44891,\"start\":44879},{\"end\":45310,\"start\":45269},{\"end\":45675,\"start\":45649},{\"end\":45989,\"start\":45966},{\"end\":46399,\"start\":46387},{\"end\":46724,\"start\":46702},{\"end\":46989,\"start\":46959},{\"end\":47305,\"start\":47286},{\"end\":47682,\"start\":47664},{\"end\":48022,\"start\":47992},{\"end\":48406,\"start\":48384},{\"end\":48797,\"start\":48789},{\"end\":49169,\"start\":49126},{\"end\":49502,\"start\":49475},{\"end\":49812,\"start\":49790},{\"end\":50179,\"start\":50140},{\"end\":50592,\"start\":50564},{\"end\":50962,\"start\":50932},{\"end\":51312,\"start\":51273},{\"end\":51668,\"start\":51643},{\"end\":52031,\"start\":52006},{\"end\":52435,\"start\":52413},{\"end\":52834,\"start\":52801},{\"end\":53191,\"start\":53150},{\"end\":53554,\"start\":53529},{\"end\":53924,\"start\":53902},{\"end\":54249,\"start\":54194},{\"end\":54535,\"start\":54512},{\"end\":54874,\"start\":54852},{\"end\":55238,\"start\":55205},{\"end\":55606,\"start\":55584},{\"end\":55963,\"start\":55940},{\"end\":56293,\"start\":56265},{\"end\":56728,\"start\":56706},{\"end\":57054,\"start\":57031},{\"end\":57366,\"start\":57353},{\"end\":57661,\"start\":57644}]"}}}, "year": 2023, "month": 12, "day": 17}