{"id": 237690594, "updated": "2022-03-27 14:56:48.101", "metadata": {"title": "A Multi‐Purpose Heliophysics L4 Mission", "authors": "[{\"first\":\"A.\",\"last\":\"Posner\",\"middle\":[]},{\"first\":\"C. N.\",\"last\":\"Arge\",\"middle\":[]},{\"first\":\"J.\",\"last\":\"Staub\",\"middle\":[]},{\"first\":\"O. C.\",\"last\":\"StCyr\",\"middle\":[]},{\"first\":\"D.\",\"last\":\"Folta\",\"middle\":[]},{\"first\":\"S. K.\",\"last\":\"Solanki\",\"middle\":[]},{\"first\":\"R. D. T.\",\"last\":\"Strauss\",\"middle\":[]},{\"first\":\"F.\",\"last\":\"Effenberger\",\"middle\":[]},{\"first\":\"A.\",\"last\":\"Gandorfer\",\"middle\":[]},{\"first\":\"B.\",\"last\":\"Heber\",\"middle\":[]},{\"first\":\"C. J.\",\"last\":\"Henney\",\"middle\":[]},{\"first\":\"J.\",\"last\":\"Hirzberger\",\"middle\":[]},{\"first\":\"S. I.\",\"last\":\"Jones\",\"middle\":[]},{\"first\":\"P.\",\"last\":\"Kühl\",\"middle\":[]},{\"first\":\"O.\",\"last\":\"Malandraki\",\"middle\":[]},{\"first\":\"V. J.\",\"last\":\"Sterken\",\"middle\":[]}]", "venue": null, "journal": "Space Weather", "publication_date": {"year": 2021, "month": null, "day": null}, "abstract": "The Earth‐Sun Lagrangian point 4 is a meta‐stable location at 1 AU from the Sun, 60° ahead of Earth's orbit. It has an uninterrupted view of the solar photosphere centered on W60, the Earth's nominal magnetic field connection to the Sun. Such a mission on its own would serve as a solar remote sensing observatory that would oversee the entire solar radiation hemisphere with significant relevance for protecting Moon and Mars explorers from radiation exposure. In combination with appropriately planned observatories at L1 and L5, the three spacecraft would provide 300° longitude coverage of photospheric magnetic field structure, and allow continuous viewing of both solar poles, with >3.6° elevation. Ideally, the L4 and L5 missions would orbit the Sun with a 7.2° inclination out of the heliographic equator, 14.5° out of the ecliptic plane. We discuss the impact of extending solar magnetic field observations in both longitude and latitude to improve global solar wind modeling and, with the development of local helioseismology, the potential for long‐term solar activity forecasting. Such a mission would provide a unique opportunity for interplanetary and interstellar dust science. It would significantly add to reliability of operational observations on fast coronal mass ejections directed at Earth and for human Mars explorers on their round‐trip journey. The L4 mission concept is technically feasible, and is scientifically compelling.", "fields_of_study": "[\"Physics\"]", "external_ids": {"arxiv": null, "mag": "3178449037", "acl": null, "pubmed": null, "pubmedcentral": null, "dblp": null, "doi": "10.1029/2021sw002777"}}, "content": {"source": {"pdf_hash": "ac9125866ad6bdd3a00dd7c1777da8b41c2e5a44", "pdf_src": "Wiley", "pdf_uri": null, "oa_url_match": false, "oa_info": {"license": "CCBYNCND", "open_access_url": "https://onlinelibrary.wiley.com/doi/pdfdirect/10.1029/2021SW002777", "status": "HYBRID"}}, "grobid": {"id": "c3bc8f0260996f84748bec642ce803537a4826d4", "type": "plain-text", "url": "s3://ai2-s2-pdf-extraction-prod/parse-results/s2orc_worker/ac9125866ad6bdd3a00dd7c1777da8b41c2e5a44.txt", "contents": "\n. Introduction A Multi-Purpose Heliophysics L4 Mission\n\n\nA Posner \nNASA/HQ\nWashingtonDCUSA\n\nC N Arge \nNASA Goddard Space Flight Center\nGreenbeltMDUSA\n\nJ Staub \nMax-Planck-Institut für Sonnensystemforschung\nGöttingen, Germany\n\nO C Stcyr \nNASA Goddard Space Flight Center\nGreenbeltMDUSA\n\nUniversities Space Research Association\nColumbiaMDUSA\n\nD Folta \nNASA Goddard Space Flight Center\nGreenbeltMDUSA\n\nS K Solanki \nMax-Planck-Institut für Sonnensystemforschung\nGöttingen, Germany\n\nKyung Hee University\nYonginSouth Korea\n\nR D T Strauss \nNorth-West University\nPotchefstroomSouth Africa\n\nF Effenberger \nRuhr-Universität Bochum\nBochum, Germany\n\nBay Area Environmental Research Institute\nMoffett FieldCAUSA\n\nA Gandorfer \nMax-Planck-Institut für Sonnensystemforschung\nGöttingen, Germany\n\nB Heber \nChristian Albrechts-Universität\nKiel, Germany\n\nC J Henney \nAir Force Research Laboratory\nKirtland AFB\nKirtlandNMUSA\n\nJ Hirzberger \nMax-Planck-Institut für Sonnensystemforschung\nGöttingen, Germany\n\nS I Jones \nNASA Goddard Space Flight Center\nGreenbeltMDUSA\n\nCatholic University of America\nWashingtonDCUSA\n\nP Kühl \nChristian Albrechts-Universität\nKiel, Germany\n\nO Malandraki \nNational Observatory of Athens/IAASARS\nPenteliGreece\n\nV J Sterken \nETH Zurich\nZurichSwitzerland\n\n. Introduction A Multi-Purpose Heliophysics L4 Mission\n10.1029/2021SW002777This is an open access article under the terms of the Creative Commons Attribution-NonCommercial-NoDerivs License, which permits use and distribution in any medium, provided the original work is properly cited, the use is non-commercial and no modifications or adaptations are made.\nSpace weather (SWx) forecasting is a complex problem, spanning vastly different regions of space and involving several scientific disciplines within and beyond Heliophysics. The main pillar that all SWx forecasts rely on is rapid availability of sets of observations of the Sun and inner heliosphere measured on the ground and on space platforms. Budgetary realism dictates the locations of observatories and their instrumentation to be chosen carefully so they address short-term needs and lead to long-term improvements.It is important to note that much of the underlying physics of SWx is not yet understood. This includes, to name just a subset of phenomena, the initiation of flares and coronal mass ejections (CMEs), the Abstract The Earth-Sun Lagrangian point 4 is a meta-stable location at 1 AU from the Sun, 60° ahead of Earth's orbit. It has an uninterrupted view of the solar photosphere centered on W60, the Earth's nominal magnetic field connection to the Sun. Such a mission on its own would serve as a solar remote sensing observatory that would oversee the entire solar radiation hemisphere with significant relevance for protecting Moon and Mars explorers from radiation exposure. In combination with appropriately planned observatories at L1 and L5, the three spacecraft would provide 300° longitude coverage of photospheric magnetic field structure, and allow continuous viewing of both solar poles, with >3.6° elevation. Ideally, the L4 and L5 missions would orbit the Sun with a 7.2° inclination out of the heliographic equator, 14.5° out of the ecliptic plane. We discuss the impact of extending solar magnetic field observations in both longitude and latitude to improve global solar wind modeling and, with the development of local helioseismology, the potential for long-term solar activity forecasting. Such a mission would provide a unique opportunity for interplanetary and interstellar dust science. It would significantly add to reliability of operational observations on fast coronal mass ejections directed at Earth and for human Mars explorers on their round-trip journey. The L4 mission concept is technically feasible, and is scientifically compelling.Plain Language SummaryThis work describes the advantages of placing a spacecraft at a point 60° ahead of Earth in its orbit, which offers advantages for viewing areas on the surface of the Sun that hold critical clues about solar ionizing radiation that may affect astronauts on/at the moon or on the way to and from Mars. We describe that a combination of missions ahead and behind the Earth in its orbit would provide additional benefits, even more so if injected in an orbital plane that is tilted by ∼14°. Solar remote sensing observations from these platforms would significantly improve models of the magnetic field and solar wind of the Sun and in the inner solar system, by covering more solar surface area in longitude, but also of the polar regions. This would help us better understand when solar eruptions affect the Earth's magnetosphere. Other benefits, including long-term advance forecasting of solar activity and the understanding of dust populations in the near-Sun environment are also discussed. An analysis of launch capabilities shows that such a mission concept, even launching both suggested missions together, is feasible.POSNER ET AL.\n\nacceleration of the solar wind and that of particles to high energies. At the time of writing, the Parker Solar Probe (PSP) and Solar Orbiter missions are exploring the immediate vicinity of the solar corona and the inner heliosphere. They will likely provide observations that advance understanding of some of the above listed unsolved physics problems.\n\nWhat is already understood is that the most severe SWx in the inner heliosphere, including the Earth-Moon system and Mars, originates at the Sun. The difficulty in forecasting solar eruptions is expressed well in the quote from Schrijver (2009): \"Flux rope-emergence may lead to major flares within about a quarter of a day\" …\"the vast majority of major flares are associated with flux emergence (within the preceding day or so) in the form of tightly wound flux ropes in active regions with large-scale twist…\"; \"Conversely, no major flares occur in regions that have a largely potential appearance, or more than about a day after the emergence of substantial flux ropes…\"\n\nThe severity of the impact depends on the relative locations of the source of SWx on the Sun, often an active region or filamentary magnetic neutral line, with respect to the observer, and the type of SWx in question. This work focuses on two aspects of severe SWx: arrival time forecasts of CMEs, the main source of geomagnetic storms, and other geoeffective solar wind structures, and SEP events in which particles are accelerated to high energies near the Sun. Geomagnetically active structures propagate near-radially from the Sun to 1 AU, therefore it is important to view the Sun's central meridian region and to have knowledge of the structure of the solar wind between the Sun and Earth. The propagation of energetic particles is generally guided by magnetic fields in the heliosphere, which, on average, connect Earth with regions near the W limb of the Sun.\n\n\nSpace Weather Observations From Lagrangian Points\n\nThe Earth-Sun Lagrangian points 4 and 5 (L4, L5) form equilateral triangles with the Earth-Moon system (hereafter \"Earth\") and the Sun. L4 is located in Earth orbit 60° ahead of the Earth, whereas L5 lags 60° behind the Earth. As compared to the remainder of Lagrangian points in a three-body system, L4 and L5 are stable, and natural objects are known to populate them, which is particularly true for the Sun-Jupiter system. In 1978, the International Sun-Earth Explorer 3 (ISEE-3) spacecraft was the first one to be placed as an \"interplanetary monitoring system\" in a halo orbit near any Lagrangian point (Earth-Sun L1) (Tsurutani & Baker, 1979).\n\nWhile ISEE-3's mission was to provide context observations for its sister spacecraft ISEE1 and 2 in the magnetosphere, the value of Lagrange point observations for SWx forecasting and nowcasting was soon realized, including its unobstructed view of the Sun, and its placement that exposes it to solar wind flow unobstructed by magnetospheric interference. Since then, several missions have been placed in Earth-Sun L1. In terms of L4 and L5, there have not been attempts of placing spacecraft, despite the advantages of viewpoints that would allow the observation of the Sun-Earth line from the \"side.\" The two-spacecraft STE-REO mission -drifted through the Earth-Sun L4 (STEREO A) and L5 (STEREO-B) in the 2009/2010 time frame and attempted for the first time to image the heliosphere between Sun and Earth with a wide field of view. However, the Sun passed the deepest solar minimum conditions in nearly 100 years at the time of this passage. While there were many CMEs, they have not resulted in significant geomagnetic activity nor were any accompanied by significant SEP events. Studies about observations from beyond L4 and L5 (e.g., Hess & Zhang, 2014) during the rising phase of solar activity were able to demonstrate that CME disturbances could be traced successfully from the Sun all the way to Earth.\n\nOther uses of L4 or L5 were proposed. These include the early detection of active regions (ARs) from behind the East limb of the Sun from L5, and the early detection of co-rotating (quasi-stationary) interaction regions Gopalswamy, Davila, StCyr, et al., 2011). Pevtsov et al. (2020) compared placement options for solar magnetographs at L5 and L4 and came to the conclusion that the L5 position would be more advantageous of increasing the accuracy of models that attempt to simulate the inner-heliosphere solar wind structure based on two-point magnetographic remote sensing of the Sun, in particular because the eastern limb region is the \"oldest\" directly observed data that would flow into these global models. Any addition of undetected active region flux would lead to effects unaccounted for in these models unless a spacecraft records the solar magnetic field from a position at or near L5.\n\nNot a significant part of the discussions in the published literature regarding L4 and L5 missions are precursors of SEP events, a main source of ionizing radiation in the inner heliosphere that can, under extreme conditions, lead to temporary or permanent loss of hardware in space, but also to severe radiation effects on humans exploring the Moon or Mars. Another aspect that has not been discussed elsewhere is the inclination of spacecraft \"parked\" in L4 and L5, and whether inclinations out of the ecliptic plane can improve critical SWx forecasting products.\n\n\nManuscript Organization\n\nThe manuscript is organized as follows: Section 2 discusses solar radiation hazards for human exploration, introduces the solar radiation hemisphere (SRH) and the concept of the magnetic horizon, and discusses the potential of an L4 mission to contribute to advance knowledge of radiation hazards; Section 3 discusses the value of missions in the three Lagrangian points L1, L4, and L5 for modeling of the inner heliosphere solar wind and forecasting of the arrival of geomagnetic disturbances at Earth; Section 4 explores the opportunities for studying interplanetary and interstellar dust (ISD) with the suggested mission concept. Section 5 discusses a plausible L4/L5 mission architecture, including the results of an initial L4 mission design study, and specific suggestions for the combined L4/L5 mission architecture. Section 6 discusses and summarizes our analyses.\n\n\nAn L4 Mission That is Critical for Human Exploration\n\nExtreme SEP events were discovered in ionization effects they create at ground level (Lange & Forbush, 1942), therefore later referred to as Ground Level Enhancements (GLEs). Ions in GLEs reach energies of ∼1 GeV or more. With multi-spacecraft missions it has been found that extreme SEPs can be detected all around the Sun, filling the entire inner heliosphere with elevated fluxes of ions and electrons. Their most rapid onset, highest overall intensity and shortest time from onset to peak intensity in the heliosphere is usually observed along the direct magnetic connection to the source region. At 1 AU in-ecliptic distance from the Sun, SEPs with the potential to be most severe in intensity and with the most rapid rise in intensity are linked to flares/CMEs that originate near ∼W60. Or, in other words, if one had the option to place the source of a specific SEP at a specific solar longitude, the intensity of this SEP would be largest at Earth if it were placed at or near W60 (see, e.g., Richardson et al., 2014, Figure 23).\n\nSeveral factors influence the actual magnetic connection distance of an observer from the best magnetic connection to the solar source region. Highly non-radial fields near ARs can play a major role, as shown recently by the PSP mission, which in April 2019 observed a set of two small SEP events while nominally connected about 80°E of the source region (Leske et al., 2020), concluding that \"the field lines expanded over a wide longitudinal range between the active region in the photosphere and the corona.\" The source of these small SEPs were jets emanating from AR 12738, which erupted in a westward (i.e., PSP-ward) direction. Moreover, overarching magnetic field lines of the active region suggest a broad, overlaying non-radial extension of this AR westward. It remains an open question as to whether small, jet-associated SEP events are more susceptible to non-radial coronal magnetic forces than larger SEP events that often occur alongside fast CMEs, which disrupt the large-scale magnetic structures in the quiet corona.\n\nAnother influence on solar source longitude stems from solar wind speed. Note. Source longitudes are given with respect to the planet's location. Magnetic field lines anchored at the solar limb (90°W) are at the edge of remote-sensing visibility from the respective planet, the magnetic horizon. The right column lists approximate solar wind speed likelihoods measured at Earth, based on the OMNI data set (Li et al., 2016). also shown.) The likelihood of solar wind speed intervals, derived from long-term observations at 1 AU that is combined in the OMNI data set, is shown in the right column (Li et al., 2016).\n\nThe solar region of ∼W60 as viewed from Earth coincides with the central meridian of an L4 mission but is hidden from view from the L5 vantage point. Please note that SEP events are considered well-connected to Earth if their source longitude does not differ dramatically from W60, certainly within 60° in longitude of the W60 location. This also means that from the Earth/Moon point of view SEPs originating from the region behind the solar west limb (highlighted in bold in Table 1) are still well connected and can reach high intensities rather rapidly. Even taking into account non-radial magnetic forces in the solar corona, remote-sensing from a combination of L1 and L4 would be able to observe all well-connected sources for solar energetic particles that pose a radiation hazard for the Earth-Moon system.\n\nThe sudden exposure to energetic protons from SEP events beyond the Earth's magnetosphere and en-route to the Moon or Mars can, in extreme cases, lead to acute radiation sickness, an impairing, mission-endangering condition for astronauts. Timely warnings of their impending occurrence may significantly reduce radiation exposure by allowing astronauts enough time to move to a radiation shelter. Longer-term warnings would even allow for better mission planning, ideally avoiding the most severe SEP events.\n\nSeveral techniques currently exist to provide short-term forecasts of hazards from SEP events, tailored to a variation of proton energy ranges or integral fluxes. \"Protons\" (Balch, 2008) relies upon a combination of inputs, the time-integrated and peak soft X-ray flux, along with simultaneous Types II and IV radio bursts, for determining the probability of occurrence of a proton event. \"UMASEP\" (Núñez, 2011) exploits the rise of relativistic protons at Earth, in combination with a near-simultaneous flare X-ray event from the Sun. The \"PPS\" model (Smart & Shea, 1979) is in use by the Air Force Research Laboratory (AFRL). Needed inputs of the AFRL PPS model are solar flare locations, peak or time-integrated X-ray or radio fluxes of the flare and their times of onsets and maxima. The ESPERTA concept (Laurenza et al., 2009(Laurenza et al., , 2018 is not currently in use due to the lack of near-real-time data is the that uses time-integrated low-frequency (<1 MHz) type III radio burst intensity along with flare X-ray size and location parameters. Richardson et al. (2014) have found that about 30% of the most hazardous SEP events in the two-STEREO era originate from behind the western solar limb of a 1 AU observer (including Earth). The lack of behind-the-west-limb flare observations affects the accuracy of many of the leading current SEP forecasting systems, including protons, UMASEP, PPS and ESPERTA. Even though methods exist that do not require direct flare observations for forecasting the occurrence of a SEP event (REleASE, see Section 2.3), such methods combined with those methods that do require flare inputs would likely result in improved accuracy and reliability. The lack of flare observations beyond the western limb of the Sun is therefore identified as a significant hindrance.\n\n\nThe Solar Radiation Hemisphere and Magnetic Horizon\n\nLonger-term SEP forecasts would first and foremost depend on understanding and predicting solar activity more generally. Recently, progress has been made in flare forecasting (e.g., , Kusano et al., 2020, and it is expected that with machine learning patterns leading up to eruptions (flares and CMEs) can be recognized even more reliably.\n\nAll these methods have in common, when applied to solar radiation forecasting, that the area of the Sun where most significant SEP events affecting the Earth environment originate, needs continuous observations. We introduce the definition of the SRH as the solar hemisphere stretching from 30°E to 150°W with respect to Earth. We would like to stress, in order to avoid any misunderstanding, that this hemisphere is not more likely to generate solar activity and/or SEPs than its counterpart, but it represents the area of the Sun that is best magnetically connected with Earth, so that any solar particle event originating from there has a high likelihood to be observable at and affecting the near-Earth environment. Moreover, as Figure 1 shows, the most vulnerable phase of the transfer of human explorers to Mars and back from Mars is exposed to the SRH. This aspect will be discussed in more detail in the next section.\n\nThe concept of the SRH is not merely theoretical. As mentioned above, Richardson et al. (2014) have identified the proportion of SEP events measured at 1 AU by STEREO A, B, and Earth (SoHO), originated from behind the western solar limb. Moreover, the origin of most three-spacecraft events analyzed by them originated in the SRH, here reproduced as a histogram surrounding the Sun in Figure 1.\n\nAn observatory stationed at L4, ahead of the Earth in its orbit, could provide remote sensing of the entire SRH, as shown in Figure 1. Thus, the necessary flare observations, so far unavailable to forecasters responsible for radiation protection of astronauts, would become available for post-eruption models such as protons, PPS, UMASEP and ESPERTA and add a significant level of safety for exploration plans.\n\nAll-clear forecasts refer to probabilistic, pre-eruption predictions of the occurrences of solar eruptive phenomena, such as flares, radio bursts or CMEs, which often are linked also with SEPs.   The Solar Radiation Hemisphere is the relative solar hemisphere from a 1 AU observer (such as the Earth-Moon system in this case) that has the potential to severely affect its local radiation environment. It spans solar longitudes from 30°E to 150°W relative to the observer and is centered around and fully observable from a location 60° ahead in the observers' orbit (here the Sun-Earth L4 location). The histogram shows the relative source longitudes of maximum solar energetic particle (SEP) 14-24 MeV proton intensity of all three-spacecraft SEP events in the STEREO era as described in Richardson et al. (2014). The relative trajectories of the Earth/Moon system with respect to sample Hohmann transfer orbits to and from Mars, and the Earth/Sun Lagrangian Point 4. The narrow, dashed lines indicate the relative orbital distances of Earth and Mars from the Sun. The thicker dashed line indicates an idealized interplanetary magnetic field line for a solar wind speed near average in the ecliptic plane. It connects to a location near 60°W on the Sun. Simulated 2-D SEP electron intensity contours (Strauss et al., 2017) for an event that is well connected with Earth are shown as well.\n\nan all-clear forecast can be extended to with sufficient reliability, even scheduling entire round-trip missions to the Moon may become possible. Yet the issuance of such an all-clear would depend critically on the observations of the SRH.\n\nThe concept of the SRH is also closely related to the concept of the Magnetic Horizon (MH). The (wider) MH is defined as the surface that the full set of magnetic field lines originating from the solar limb form. It separates the regions, in which magnetic field lines directly connected to flaring can or cannot be fully detected from the viewpoint of the observer. A second definition of the MH applies to the maximum angle at which three-dimensional vector magnetic fields on the Sun may still be resolved, or EUV features assigned their respective solar source longitude/latitude. Such a (narrower) MH is located approximately 20° from the solar limb. This aspect is discussed in the context of solar polarimetry in Section 3.2.\n\nThe wider MH extends into a three-dimensional shape that ideally intersects the ecliptic plane along the Parker magnetic field lines emanating from the solar E and W limbs. The location of the MH in the heliosphere is dependent on the speed of the solar wind. As inferred from Table 1, in which a magnetic connection of 300 km/s solar wind speed to 81.8°W is established, the MH intersects 1 AU only about 8.2°W of the observer's location. At higher solar wind speeds, such as 500 km/s, the MH's intersection with 1 AU is located about 40°W.\n\n\nL4 and Lunar Exploration\n\nWe utilize 2-D particle transport simulations in order to illustrate the hazard posed by eruptions from just beyond the MH, far enough behind the W limb so that the associated flare would not be visible from the Earth-Sun line. The simulation is observation driven with respect to heliospheric turbulence quantities and relies on first principles for deriving transport coefficients (Strauss, et al., 2017). The model is successful in reproducing anisotropies, longitudinal distributions, and times of onset, initially for electrons at or below 100 keV. More recently, the model has been used to simulate higher-energy (∼1 MeV) electrons and ∼40 MeV protons as well (Posner & Strauss, 2020). The calculated mean-free-paths for 40 MeV protons are shown in the insert of Figure 2 as a function of radial distance. For the parallel mean-free-path, at Earth's position, we obtain a value of ∼0.3AU, while the ratio of the perpendicular to the parallel mean-free-path is ∼4%. Note, however, that these parameters have a significant and non-trivial radial dependence. We use the same set-up as Posner and Strauss (2020) with the exception that the source region is narrower, spanning 5° in longitude.\n\nFigures 2-4 show the outcomes of simulation runs, with the source of the eruption in each case located at 105°W, that is, the flare would not be visible from Earth. From L4, this source would be located at 45°W of the central meridian, well within view and, importantly, given appropriate instrumentation would be measurable without being adversely affected by limb foreshortening. For Figure 2, solar wind speed of 500 km/s is used. Figure 3 assumes slow, 300 km/s solar wind for the simulation, for comparison. Figure 4 provides the absolute flux differences between the two runs. The heliospheric magnetic field under slow solar wind conditions connects the Earth-Moon system with a region near the MH (or solar W limb), 82°W for 300 km/s. As the difference in simulations shows, slow solar wind shifts the particle flux significantly eastward, toward the Earth-Moon system. The threat of rapid flux enhancements posed by SEPs from just behind the MH is quite significant. Figure 5 shows the intensities of the Earth-Moon system as compared to the maximum flux at 1 AU, for both 300 km/s solar wind and 500 km/s solar wind. The flux at the Earth-Moon system is only marginally lower, by a factor of ∼3.75, than that of the direct magnetic connection to the source region further west.  Kim et al. (2005) show that the dose rate from high-energy protons in extreme SEPs behind moderate amounts of shielding can rise rapidly and can reach up to 20 cGy/ hr, while the lower threshold of short-term radiation exposure that can cause acute radiation syndrome is around 1 cGy/hr. Assuming the magnetic-connection-distance reduction in proton flux of a factor of 3.75 alone from a hypothetical worst-case SEP event originating behind the W limb as shown in Figure 5 would not sufficiently reduce biological effects. As discussed in Posner and Strauss (2020) in more detail, timely warnings of extreme SEPs can lead to significant reductions in radiation exposure. This set of figures is chosen to stress how important it is for Lunar exploration alone to view the region behind the solar W limb, ideally from L4. Alternatively, the occurrence of slow solar wind should be considered as high risk for Lunar exploration. The likelihood of occurrence of such slow solar wind is not negligible, ∼8% according to Li et al. (2016) (see Table 1).\n\nMoreover, SEP forecasting capabilities that require information from imaging instruments may have difficulties with eruptions that arise at the W limb, or even just on the near side of the Sun, but outside the \"narrow\" MH as defined earlier. Such eruptions can reach even higher relative proton intensities in the Earth-Moon system than our example of 105°W has shown. An L4 mission would support forecasting in such instances as the source location would be well inside the narrow MH from that vantage point.\n\n\nL4 and Mars Exploration\n\nA circumstance of note in the discussion of radiation safety for human exploration of Mars is the recurring relative positions of human Mars explorers at any phase of their journey with respect to Earth and its associated Lagrangian points. Human explorers will typically follow the Hohmann (1925) minimum-energy trajectory to and from Mars, which allows the transport of the maximum payload and shielding mass for a given energy expenditure. Please note that we discuss the rationale for and the consequences of faster trajectories in Section 2.4. Due to its non-negligible orbital eccentricity, the departure/arrival distances of Mars from the Sun have moderate influence on those positions but don't change the overall picture. Figure  Intensity contours of ∼40 MeV protons, 2 h after the injection at the Sun as simulated with a 2-D particle transport code. The source of the injection is 5° wide and located 15° behind the solar W limb. A magnetic field line from the location of the eruption out to 1 AU is included. Views of the Sun from L1 (dashed) and L4 (solid) are highlighted. The assumed solar wind speed is 500 km/s in this simulation. The insert in the lower left shows the transport coefficients, used in this work to simulate the transport of 40 MeV solar energetic particle protons, as a function of radial distance. The parallel (solid line) and perpendicular (dashed line) mean-free-paths are shown, as well as the magnetic field focusing length (L, dotted line), and the ratio of the perpendicular to parallel mean-free-path (dash-dotted line).\n\n(orange) Mars in a coordinate system co-rotating with the Sun-Earth line. As Figure 1 shows, the outward Hohmann trajectory follows closely the outward extension of the magnetic field line that connects the Earth with the Sun, a phenomenon that is referred to as the Hohmann-Parker effect (Posner et al., 2013). The term magnetic connection distance refers to the distance in longitude between the magnetic foot points at the Sun of two locations in the heliosphere, such as a SWx warning system and the Mars transfer vehicle. Note that during the return journey the Hohmann-Parker effect of small magnetic connection distances of the Mars transfer vehicle is also present but applies to explorers following the field line connecting Mars with the Sun, best shown in a coordinate system rotating with the Mars-Sun line.\n\nWith an appropriately equipped s/c at the Sun-Earth L4 location, short-term SEP forecasting schemes would be in a position to incorporate solar remote sensing information (characterized by EUV/X-ray intensities and magnetograms) from behind the W limb, effectively covering all relevant SEPs that affect the Earth/ Moon system. SEP transport is known to be most effective along magnetic field lines in the heliosphere (Richardson et al., 2014). Traveling outward to Mars under the influence of the Hohmann-Parker effect, the explorers' field line would be anchored near the region where Earth's magnetic field line is in the Sun, that is, near the W limb. Therefore, information from L4 would also help protect much of the outbound trajectory from Earth to Mars.\n\nTimely short-term forecasts based on the REleASE system (Posner, 2007) from Earth-Sun L1 and Mars-Sun L1 can save astronauts from acute radiation sickness and would limit their lifetime exposure (Posner & Strauss, 2020). Depending on available shielding and radiation shelter, up to 10 cGy blood-forming organ dose can be saved in a worst-case scenario.\n\nUMASEP and ESPERTA both suffer from a lack of observations from behind the W limb though, and would directly benefit from L4 observations, filling a critical gap, flares from behind the W limb, in their observational input streams. It appears likely that combining aspects of REleASE, UMASEP and ESPERTA, and taking into account all their required model inputs (relativistic electrons and protons, flare brightness and location, and low-frequency type-III radio burst occurrence) would make short-term SEP forecasting very POSNER ET AL.\n\n10.1029/2021SW002777 8 of 27 robust and reliable. UMASEP and ESPERTA with full coverage of the SRH have not yet been considered for providing forecasts for the outbound journey to Mars.\n\nThe inward (or return) journey poses a different problem for short-term radiation forecast systems. As discussed in detail in Posner et al. (2013), the return journey's Hohmann-Parker effect influence is expressed predominantly in the exploration vehicle's proximity to the magnetic field line that connects Mars with the Sun. It has therefore been suggested to place a s/c with the needed input stream for the REleASE forecast, a relativistic electron instrument, at Mars-Sun L1. It has been shown that even a warning system placed farther away from the Sun than the explorers, there will be significant net advance warning time available.\n\nHowever, while the maximum magnetic connection distance of the explorers from Earth as prescribed by the Hohmann-Parker effect (for average solar wind speed of ∼400 km/s) is 9° for the outward journey, it is larger from Mars, about 15°, during the return journey (see Table 1 in Posner and Strauss [2020]). It is expected that the accuracy of the REleASE forecast decreases with increasing magnetic connection distance of the location the forecast is intended for.\n\nThe Earth-Sun L4 location would potentially offer another vantage point for the source of a REleASE forecast. We analyzed this scenario and found, as shown in Figure 6, that the maximum connection distance would decrease for a significant amount of time during the return journey, The reason for this decrease in magnetic connection distance is the favorable passage of the Earth-Sun L4 s/c in the early/mid-phase of the return journey. Depending on solar wind speed conditions, assuming 300-500 km/s, on days 75-100 after injection of the transfer vehicle into the transfer orbit to Earth, the exploration vehicle can be directly aligned along the Parker spiral with Earth-Sun L4. During the more extended period of days ∼60-∼130, depending on the solar wind speed conditions, the REleASE forecast can potentially be more accurate than the forecast from Mars-Sun L1 alone. We calculate that the average connection distance under 300 km/s solar POSNER ET AL.\n\n10.1029/2021SW002777 9 of 27 wind speed conditions would be 8.7° (400 km/s: 6.8°; 500 km/s: 5.6°) without the addition of Earth-Sun L4, and would decrease to 7.6° (400 km/s: 6.2°; 500 km/s: 5.3°) with the Earth-Sun L4 warning system included.\n\nAnother aspect of SEP radiation hazards is that of energetic storm particles (ESPs) directly associated with the passage of a CME-driven shock over the spacecraft. In rare circumstances, such as during the August 1972 event, ESPs can become a serious radiation hazard. While coronagraphic remote sensing can give indications for such events that are likely associated with extremely fast CMEs, there can be considerable uncertainty in the resulting energy spectrum and intensity at 1 AU and beyond unless directly observed by in-situ particle detectors. As seen in Figure 6, during days 80-120, the L4 location moves away from the Mars-Sun line. However, during the early phase, L4 is nearly radially aligned with the Exploration Vehicle. Such a scenario could provide several hours to days advance warning of hazardous conditions stemming from ESPs that often peak near the outward-moving CME shock. During the entire phase of the return journey, the combination of Earth-Sun L1 and Earth-Sun L4 bound the Mars-Sun line from both sides, adding key observations that would very likely detect hazardous conditions heading toward the Exploration Vehicle. We argue that the occurrence of hazardous ESPs, while rare, would not be missed during the return journey from Mars to Earth. Several studies have discussed SWx opportunities provided by Earth-Sun-L5-point observations , Gopalswamy, Davila, StCyr, et al., 2011Pevtsov et al., 2020). We add to these arguments the added protection from extreme energetic storm particle events during the late phase of the journey from Earth to Mars, as much of that journey occurs east of the Earth-Sun line, in or near the direction toward L5.\n\nIt is noteworthy that during the return journey, Earth-Sun L4 remote sensing would cover a continuously growing fraction of the SRH relevant for the Exploration Vehicle. It is centered approximately 70°W of the POSNER ET AL.\n\n10.1029/2021SW002777 10 of 27 Earth's SRH on day 80, decreasing to ∼50°W on day 120. While likely less relevant immediately after injection from Mars-given the EV's large distance from the Sun at the time-SRH coverage from L4 becomes more and more relevant during the return journey, as SEPs can become more intense with decreasing radial distance from the Sun.\n\nWe conclude that both the remote-sensing and the in-situ aspects of an Earth-Sun L4 mission add significantly to radiation hazard safety for human exploration of the Moon and Mars, including the outward and inward journey.\n\n\nThe Non-Hohmann Scenario\n\nThe radiation exposure to Galactic Cosmic Ray ions on a journey to and from Mars, which are difficult to shield against due to their hard spectra, may only be reduced through reduction in total travel time. While the usage of the Hohmann trajectory is optimized for total payload delivery and will most likely be used for cargo ships, a compromise solution between payload and radiation exposure may lead to flight trajectory solutions for human explorers that are shorter, more direct. Such faster transfers can reduce the radiation exposure from galactic cosmic rays at a rate of ∼500 μGy/day .\n\nFor the sake of simplicity, express outward journeys are modeled here by travel along a Hohmann trajectories from Earth to destinations beyond Mars orbit, which result in a delayed launch window as compared to the nominal Hohmann launch window to Mars. Such trajectories also have on average higher radial velocities. (There may be other, similar solutions that assume both a smaller perihelion and a larger aphelion distance in order to optimize energy usage, but such solutions would not have significant impact on this discussion. The differences from the scenarios discussed here would be a small velocity component in the radial direction immediately after injection from Earth.) The higher initial tangential acceleration after launch would result in an outward velocity vector with respect to Mars when the exploration vehicle arrives at Mars, requiring additional deceleration energy.\n\nFigure 7 depicts sample paths of five fast Mars trajectories and the Hohmann trajectory (red) for comparison. These trajectories appear to fan out from Earth, reaching their Mars destination at different times, that is, at different relative orbital phases. Figure 8 shows the relative paths of return journeys for the Hohmann (red) and faster trajectories. A common theme of both the outward and inward trajectories is the systematic excursion toward west of the Sun-Earth-connecting magnetic field line. For the outward journey of Figure 7, the westward shift is limited, but is relatively larger for faster trajectories. Explorers on faster trajectories tend to spend a larger fraction of the journey behind the Earth's magnetic horizon (as shown for slow solar wind conditions, dark blue dash-dotted line). Yet, all outward trajectories are well covered by remote-sensing observations from L4, for which the (slow-wind) magnetic horizon is depicted as well, near the top of the Figure ( Explorers on the return journey would start out from much further west, even beyond the MH of an L4 observatory as shown in Figure 8. However, as the addition of an Earth-Sun L4 mission would move the MH by 60°, a significant fraction of the return journey would be supported, in particular the phase of the return journey that is closest to the Sun. POSNER ET AL.  The bottom graph, adapted from Posner et al. (2013), shows the magnetic connection distances of the exploration vehicle for three different solar wind speeds, 300 km/s (red), 400 km/s (black) and 500 km/s (blue) from Mars (all originating at 0° on day 0), L4 (diagonal lines on left-hand side), and Earth (right-hand side only). Thicker segments indicate the minimum connection distance for any phase of the return journey under the given solar wind speed scenario.\n\n\nL5-L1-L4 in Tandem: Improving Accuracy and Reliability of Forecasting Geomagnetic Disturbance Arrival at Earth\n\n\nIntroduction/Current State of Inner Heliospheric Solar Wind Modeling\n\nThere are several models capable of predicting the background or ambient solar wind. They vary from relatively simple, quick running models such as the Wang-Sheeley-Arge (WSA) model (Arge et al., 2004;McGregor et al., 2008;Wallace et al., 2019) to highly advanced MHD models such as Enlil (Odstrҫil et al., 2004(Odstrҫil et al., , 2005, CORHEL (Riley et al., 2012), MS-FLUKSS (T. K. Kim et al., 2014), Gamera (Zhang et al., 2019), SWMF (Tóth et al., 2012), and EUHFORIA (Pomoell & Poedts, 2018). WSA + Enlil (Odstrҫil et al., 2020) is a hybrid model that runs relatively quickly and has been used to make operational forecasts at NOAA since 2011 (Pizzo et al., 2011). Reliable forecasts of the ambient solar wind are critical for accurately predicting the arrival time of CMEs (Kilpua et al., 2019;Pizzo et al., 2015) or the magnetic connectivity of a spacecraft back to the Sun. There have been numerous validation studies evaluating the reliability and forecast capability of these models (e.g., MacNeice, 2009aMacNeice, , 2009bMacNeice et al., 2011;Norquist, 2013;Norquist & Meeks, 2010;Owens et al., 2005Owens et al., , 2008.\n\nVirtually all coronal and solar wind models use global maps of the Sun's photospheric magnetic field as their primary driver. Historically, these maps have been constructed from magnetograms of the LOS magnetic field that have been converted to radial orientation, where it is assumed the field is radial (Svalgaard et al., 1978;Y.-M. Wang & Sheeley, 1992). More recently, global maps of the radial field are being constructed from vector magnetograms from SOLIS, SDO/HMI (Schou et al., 2012), and soon the PHI instrument on Solar Orbiter (SolO). However, as discussed below, there are a number of uncertainties and complexities intrinsic to these maps that often introduce errors into the coronal and solar wind solutions. Efforts to bypass some of these problems include using interplanetary scintillation (IPS) measurements of solar wind speed and density to drive solar wind models such as Enlil (Jackson et al., 2020) and MS-FLUKSS (Manoharan et al., 2015). All solar wind models require extrapolations of the photospheric magnetic field to provide the magnetic field used to drive them. While there have recently been successful attempts to measure the coronal magnetic field directly (see, e.g., Lagg et al., 2017), these measurements are generally low in the corona and in the plane of the sky and therefore not currently practical for direct use in solar wind modeling. However, such observations could be used to constrain and thus improve the reliability of magnetic field extrapolations.\n\nUntil the recent launch of SolO, constructing global maps of the photospheric magnetic field required acquiring about 27 days of magnetograms and then assembling them into maps, typically by using a weighting function that is sharply peaked at central meridian. Other approaches include constructing maps by taking narrow strips along the central meridians (as seen by the observer) from a series of magnetograms. The resulting maps represent the time history of central meridian-, that is, diachronic maps. But they do not represent what the Sun's field looks like at any given moment in time, that is, synchronic maps, which are the real need. Attempts to produce maps that are more nearly synchronic have been generated using flux transport models (e.g., Arge et al., 2011;Hickmann et al., 2015;Schrijver & DeRosa, 2003;Upton & Hathaway, 2014). While these models can generate maps that are more nearly synchronic in nature, they are still rife with problems. They have two critical limitations that have been discussed previously resulting from the lack of global, simultaneous observations: a) flux emergence on the solar far-side and b) large measurement uncertainties near the solar limb. These two issues create several problems in the maps used to drive models as summarized in Table 2  (e.g., Arge et al., 2013;Cash et al., 2015). Their subsequent, artificially sudden appearance on the east limb and their inclusion (often only partially) in the photospheric maps produce abrupt non-physical changes in the coronal and solar wind model solutions. This is especially troublesome for time-dependent modeling, as they produce non-physical effects that propagate throughout the model solution. Additionally, the lack of simultaneous observations, unreliable or lacking measurements of the polar fields, or the inclusion of only part of an active region produce artificial monopoles. These monopoles must be removed from the magnetic field maps before they can be used in coronal models to ensure the global magnetic field is divergence free. In general, there is no real way to do this properly, and correcting the input maps results in non-physical changes in the global solution. Both issues described above (and listed in Table 2) would be addressed by the addition of solar magnetic field measurements from L4 and L5. Another aspect we intend to address with missions inclined to the ecliptic plane as described in Section 5 is unreliable measurements of the Sun's polar field. These cause a major issue for coronal and solar wind models, as they are extremely sensitive to the field strengths there. This makes sense, because the large-scale coronal and heliospheric magnetic fields are normally controlled by the Sun's magnetic dipole moment, which is usually dominated by the polar fields. In fact, this problem makes solar wind predictions very unreliable whenever the heliospheric current sheet is flat and lies near the ecliptic plane (e.g., near solar minimum). The large uncertainties in the polar fields can easily shift model predictions of the current sheet up or down causing them to incorrectly predict polarities and solar wind source regions. Figure 9 shows a recent example of this problem (as viewed from Earth) during the time of the PSP fourth perihelion when both Earth and PSP were nearly co-aligned with respect to the Sun.\n\n\nPolarimetry From L4 and L5\n\nThere are many advantages of adding observations of the photospheric magnetic field from the Lagrange point L4, especially when combined with simultaneous observations from vantage points at or near Earth and L5. The most obvious advantage is the increased instantaneous field of view, when combining the data from multiple observatories (e.g., Earth + L4 + L5). While combining magnetogram data from different instruments is generally non-trivial due differences in the instrumentation (e.g., wavelengths used, resolutions, etc.) and the complexities of intercalibration, simultaneous overlapping observations should help to accomplish this. Given that most global photospheric magnetic field maps are constructed using observations from as far away from disk center POSNER ET AL.  to Earth that range from the slowest (Hohmann) trajectory (red) to faster trajectories in a reference system that keeps the Sun-Earth line fixed. Unlike the outward trajectories, the paths cross at ∼1.25 AU distance from the Sun. The magnetic horizons (MHs) for 300 km/s solar wind speed for L1 and L4 are included, showing that the early, distant phases of the return trajectories occur beyond the L4 MH. The addition of an L4 observatory would extend solar activity coverage of the foot point region of the Sun for all return trajectories as soon as they reach inside ∼1.4 AU from the Sun. Much later in the return trajectory, the exploration vehicle would also cross the L1 magnetic horizon, applicable to Earth-bound solar observatories.\n\n\nObservational issue\n\nProblems Impact\n\nMissing solar far-side magnetic field measurements ARs on solar far-side not included or partially included in photospheric magnetic field maps • ARs affect global magnetic field configuration • Partial incorporation of ARs at limb produce nonphysical magnetic monopoles and timedependent effects in coronal/SW models Large uncertainties in magnetic field measurements near limb Unreliable polar magnetic field estimates • Coronal/SW model solutions highly sensitive to polar fields • Monopole moments introduced into maps Abbreviations: ARs, active regions; SW, space weather.\n\n\nTable 2\n\nObservational Issues, Problems, and Impacts Resulting From the Lack of Global Solar Magnetic Field Observations as 70°, this implies that maps generated from simultaneous Earth + L4 + L5 observations will lack current observations spanning only about 100° in heliographic longitude, except for the polar regions (discussed in greater detail below). Since the Sun rotates about ∼13.2° per day, this means no data in the map will be older than about 8 days, with the oldest data residing at the eastern edge of the Sun as viewed from an L5 observatory. This compares to current photospheric magnetic field maps, which lack upwards of 220° longitude (∼61% of the total map!) in new and simultaneous observations. Measurements in these maps can be POSNER ET AL.  as old as ∼17 days. If only Earth and L4 or L5 are available, then the longitudinal span in the maps missing simultaneous observation expands to ∼160° or roughly 12 days. Flux transport models can be used to help keep the portions of the maps lacking in new observations current by evolving the magnetic field forward in time, but presently they cannot address flux emergence. With simultaneous magnetograms from Earth + L4 + L5, only about a quarter of the Sun's surface magnetic field will lack new observations at any given moment in time, which will greatly reduce the likelihood of missing significant flux emergence and its subsequent adverse impact on SWx model forecasts. Flux transport models will also be able to manage these narrower gap regions much more effectively.\n\nHelioseismic holography (Gizon et al., 2018;Liewer et al., 2014;Lindsey & Braun, 2000;Yang, 2018) and time-distance helioseismology (Duvall et al., 1993;Zhao et al., 2019) could be a further interesting application of magnetograph data from the Lagrange points L5 and particularly L4. Both techniques enable the detection and specification of active regions on the far side of the Sun. They can thus be monitored and even inserted into photospheric maps before they enter the field-of-view as seen from L5, which would further improve SWx predictions. In fact, Arge et al. (2013) demonstrated that this approach can improve solar wind forecasts.\n\nObservatories at L4 and L5 in addition to an Earth-based one would enhance the quality, not only the quantity of observations of the photosphere seen over most of the solar disk as viewed from Earth. By combining the LOS components recorded from different vantage points, the magnetic field vector can be determined with higher precision, as the LOS component is usually measured with much greater reliability. Since all three spacecraft will be roughly in the ecliptic, mainly two components of the field can be determined in this manner. Similarly, such \"stereoscopic observations\" will also allow determining two components of the velocity vector instead of just the LOS component.\n\nAnother significant improvement would be the removal of the 180° ambiguity in the direction of the transverse component of the magnetic field vector innate to the Zeeman effect. This ambiguity is a bane for the accurate extrapolation of the magnetic field from the photosphere to the corona. Whereas potential fields only require measurements of the longitudinal component of the magnetic field, the more realistic non-linear force-free fields require the full magnetic vector (e.g., Wiegelmann et al., 2014). The methods currently available for removing the ambiguity all suffer from having to make assumptions about the magnetic field (Leka et al., 2009;Metcalf et al., 2006). By combining observations from L4 and Earth, overcoming this ambiguity will be possible without additional assumptions for a swathe of the solar surface covering roughly 60° in longitude (between the Sun-L4 and the Sun-Earth lines). If an identical magnetograph is also present at L5, then the ambiguity can be overcome over most of the visible disk of the Sun, allowing for greatly improved magnetic field extrapolations into the corona. The method is illustrated in Figure 10. The SolO/ PHI instrument, that is, the Polarimetric and Helioseismic Imager (Solanki et al., 2020) on board the Solar Orbiter mission (Müller et al., 2020), will provide the first observational data with which to test and validate these techniques (Rouillard et al., 2020).\n\nAnother advantage of having a spacecraft at L4 (best in conjunction with observations along the Sun-Earth line and at L5) is that it extends the time that a given solar pole is visible. As described in Section 3.1, coronal and solar wind models are highly sensitive to the strengths of the polar fields, which are poorly observed due to the Sun's small 7.23° axial tilt. While a given solar pole is technically visible for 6 months per year, it is only well observed (i.e., pole inclined toward Earth by more than 3.5°) for only about 4 months per year. This is illustrated in Figure 11. If an L4 mission orbiting in the ecliptic is included, then this length of time increases to 6 months. Adding an L5 mission to the mix increases it to 8 months for each pole. This also leads to the interesting situation where twice a year both poles are visible for 2 months at the same time at an angle greater than 3.5°. While magnetic field measurements taken so near the limb may not seem all that POSNER ET AL.\n\n\n10.1029/2021SW002777\n\n15 of 27 Figure 10. Illustration of the method by which the 180° ambiguity in the magnetic field azimuth can be removed with measurements carried out from two directions. Shown is the solar limb (curved yellow line), observed from two locations (magnetograph 1&2). The longitudinal component of the fields as seen from the observers (B LOS,1 and B LOS,2 ) is uniquely determined, but there is an ambiguity in the according azimuthal components (B T,1,true , B T,1,false and B T,2,true , B T,2,false ). That is, the Zeeman effect cannot distinguish between the purple arrows (B T,1/2,true and B T,1/2,false ). If the observations from the two vantage points are carried out simultaneously, then only the green arrow (B true ) satisfies both constraints, thus resolving the 180° ambiguity. useful, they can, nonetheless, be used to estimate the average polar field strengths and help constrain magnetic field flux transport models that generate global photospheric field maps. Figure 11 show the polar field strengths, as computed using Mount Wilson Solar Observatory (MWO) Carrington maps from 2003-2013. The values shown in the plot (colored dots) are calculated by separately averaging the northern and southern most pixels in the maps, with the vertical bars representing the standard deviation. Only polar values having a B angle greater than |±5°| are used, which explains the periodic gaps in the values. Four of the 12 Air Force Data Assimilative Photospheric Flux Transport (ADAPT) model (Arge et al., 2011;Hickmann et al., 2015) simulations (or realizations) are shown for the 13-year period spanning ∼2003-2016. The model is initially provided with estimated poles at the beginning of the simulation, but from that point on the polar regions are filled thereafter by the model flux transport process. ADAPT only assimilates magnetic field measurements less than 70° from disk center, so no new polar measurements are assimilated at the poles. The MWO data are thus used to constrain and validate the model parameters (e.g., meridional flows) so that it matches the observed mean polar field values. As can be seen, the polar fields produced by the model agree well with the observations for a decade. Note, MWO had a serious hardware failure in 2013 and no further observations are available after this time.\n\nPutting aside the challenges of the required orbital dynamics, suppose two spacecraft are launched from Earth and sent to L4 and L5 such that they lie in a plane offset from the ecliptic by 14.5° (see the sketch at the top of Figure 13). This plane is tilted 7.23° from the heliographic equator. In this configuration, both solar poles can be kept in view by one of the spacecraft at an angle above 3.6° essentially for all times. In addition, the polar field measurements obtained from the magnetographs located at L4 and L5 would basically fill more of the gaps in the observations seen in Figure 11 and help to further constrain the ADAPT model flux transport parameters.\n\nIf the spacecraft could be launched to even higher inclinations to the ecliptic, it would almost certainly reduce the sizes of the error bars display in Figure 11. It is likely that an increase of a few degrees would result in important reductions in the observational uncertainties and thus further improve the flux transport model polar field predictions and enhance the accuracy of solar wind forecasts even more. The Solar Orbiter mission will spearhead high-latitude solar remote sensing observations. While two solar polar orbiters would be needed to permanently cover both solar poles simultaneously to drive solar wind models, overlap of a POSNER ET AL. possible combination of L4-L1-L5 with the Solar Orbiter mission could directly quantify the level of accuracy provided by the lower-latitude-only observations. This will give us insight in what latitude coverage will be needed in the long term to optimize solar wind forecasting models.\n\nAs discussed in Section 3.1, the lack of global, simultaneous observations of the Sun's photospheric magnetic field results in a number of issues and problems in current global magnetic field maps used to drive coronal and solar wind models, which can severely impact their forecast reliability. Minimizing the portions of these maps having very old observations will significantly improve the temporal consistency of the photospheric boundary conditions used to model the corona and thus answers the need of SWx for timely observational data (see e.g., Pevtsov et al., 2020;Vourlidas, 2015).\n\nFrom a basic scientific standpoint, without reliable global and simultaneous observations of the Sun's magnetic field, it is difficult to determine whether a model solution disagrees with observations because of inadequate physics or due to problems with the input maps themselves. In general, no matter how good the physics is in a model, if the boundary conditions used to drive it are wrong, its solutions will be, to greater or lesser degree, wrong too. This problem is slowing progress in our understanding of the physics of the corona and solar wind, as well as the ability to model them for practical purposes (e.g., SWx forecasting).\n\n\nSolar Wind Low-Latitude Structure and Temporal Evolution\n\nAs discussed in Section 3.1, the solar magnetic poles tend to have significant influence over the in-ecliptic portion of the solar wind. In particular, under near solar minimum conditions, both solar poles alternately control parts of the heliographic equator by filling it with plasma of its magnetic polarity. Extensions of polar coronal holes into lower latitudes can create fast solar wind streams that form corotating interaction regions at Earth. As shown in the PSP example, the latitudinal extents of fast streams, and the exact location of the heliographic current sheet are variable, and lack of solar polar magnetic field measurements make predictions uncertain.\n\nThe driving of these models and their in-situ validation has relied mostly on observations taken from Earth's direction. While driving with magnetograph data is still limited in this way, the in-ecliptic STEREO mission allowed increasing latitude coverage for validation of solar wind models with in-situ observations while drifting away from Earth. When the STEREOs passed the L4 and L5 points, the latitude coverage over the course of the year matched that shown in Figure 12. Here, in the first half of the year all three observing locations predominantly covered the southern heliographic latitude range, while moving as an ensemble to the northern hemisphere over the latter half of the year. The maximum latitude span of in-situ observations covered here is ∼10° (January and May, 3°N to 7°S, and July and November, 3°S to 7°N), followed by converging to ∼4° latitude coverage in early March and September. This ensemble-type movement in latitudes would be the result of both L4 and L5 launched into the ecliptic plane, or only one of them launched into the suggested orbit with 14.5° tilt toward the ecliptic (in that case, the times of maximum latitude coverage would be shifted, but then ensemble motion would be similar).\n\nThe maximum extent of in-situ latitude coverage would be reached by launching L4 and L5 into the suggested orbits, matching the latitudes shown in Figure 13. For the STEREO/Earth L1 combination, latitude coverage culminated in the late 2012 time frame, when the STEREOs were separated by ∼120° in longitude from each other and Earth. Figure 14  lines for each s/c trace. These are bounded by WSA model predictions for the three s/c at their given locations in longitude and latitude.\n\nGiven the different longitudes of the s/c, STEREO A and B observations start at approximately 120 CL and 240 CL, respectively. At this time, Earth was near its northernmost heliographic latitude (HLat), while STEREO A reached its southernmost HLat, and STEREO B skimmed the heliographic equator. This period is the only time in which this wide latitude range has been covered by the L1/STEREO combination. As there are ∼9 days between in situ observations at the same Carrington Longitude, a significant change in solar wind structure may have occurred. Despite the high solar activity level, there are significant similarities in observed solar wind speed between all the s/c at ∼340 CL. The relatively fast solar wind observed here also has the same magnetic polarity, outward, at all three locations. Adjacent to that to the east, near 270 CL, inward polarity at mostly northern heliographic latitudes is observed, including a relatively fast solar wind stream at Earth. This magnetic sector is much narrower in CL extent in the south at STEREO A and lacking any fast solar wind. Please note that these observations are not mapped back to the Sun, but over s/c location. Assuming ∼3 days of propagation to ∼1 AU, a simple backmapping would add ∼40° in CL to the observations, leading us, for example, to look for a source of the northern polarity magnetic sector of 270 CL at the s/c to a solar source CL of ∼310 CL.\n\nAs the WSA output has the option to provide predictions by s/c location, there was no need for us to map back to the Sun. The inclusion of the WSA output makes clear that there are significant challenges of driving a global solar wind model with a single, Earth-based input of photospheric magnetic field observations. In order to give an accurate account, we did not select the best match of WSA output with the observations. While the model fits the STEREO-A POSNER ET AL.\n\n\n10.1029/2021SW002777\n\n18 of 27 Figure 13. Same as Figure 12, but here both the L4 and L5 s/c are injected into an orbit that is inclined by 7.2° as shown in the insert on top. The absolute value of the inclination is the same as that for the ecliptic plane, but mirrored at the heliographic equator. Their longitudinal elongations of 60° with respect to L1 provide the set of three s/c with the best possible heliographic latitude coverage for solar remote sensing for a three-s/c combo. Partially, the model-observation mismatch can be explained by this period coinciding with a very active phase of the solar cycle. A quasi-stationary solar minimum period would provide a much better basis for the analysis of solar-wind structure and morphology. On the other hand, capturing the solar wind structure accurately during active phases of the solar cycle is crucial in order to better understand and predict the propagation of CMEs. The additional benefit of the L4-L1-L5 combination we suggest is that their relative longitudes are closer together than in the example shown, so that identical CL scans are performed with only ∼4.5 days of solar rotation delay between L4 and L1, and L1 and L5, a significant step toward synchronic in-situ solar wind and magnetic field maps, which have significant value for calibrating inner-heliosphere solar wind models.\n\n\nAdvancing Understanding of Interplanetary and Interstellar Dust Populations From L4 and L5\n\nThe main component of interplanetary dust is zodiacal dust, a disk of debris which is ordered approximately by ecliptic latitude, unlike the solar wind and energetic particles in the heliosphere, which are generally ordered by heliographic or heliomagnetic latitude. Ulysses was the only spacecraft that carried a dust detector into high ecliptic latitudes, both north and south of the ecliptic plane, and thus for the first time measured a latitudinal profile of interplanetary dust (Wenzel et al., 1992). Yet, the three orbits of Ulysses and limited number of particles detected in the inner heliosphere, during its \"fast latitude scans\" were insufficient to fully characterize the orientation of the disk. Science questions related to the zodiacal dust cloud to be addressed by a mission to L4 or L5 that is inclined by 14.5° versus the ecliptic plane include: What is the vertical extent of the zodiacal dust cloud? What is its symmetry plane and what dynamics cause it to be inclined? What amount of β-meteoroids are escaping the system? Is there nanodust to be detected that is related to solar phenomena? Can interplanetary dust particles reside in the L4/L5 points and for how long?\n\nThe last question is long-standing: Ever since 1961, the existence of the Kordylewski clouds in the Moon-Earth system has been debated. These are (observed) clouds of interplanetary dust particles, residing in the Moon-Earth system's L5 point, which serves us here as an analogy to the Earth-Sun Lagrange points. Several observational and simulation studies have been undertaken of dust particles in the Moon-Earth system's L4 and L5 Lagrange points, concluding that it is in principle possible for these clouds to exist (e.g., Sliz-Balogh et al., 2018, but observational evidence (astronomical as well as in situ) remains weak. For the Venus-Sun system, simulations were performed where the stability of the Lagrange points for micron and sub-micron sized dust particles was examined, and these degraded quickly due to solar radiation pressure force and electromagnetic forces (Zhou et al., 2021). For the Earth-Sun system, mainly studies of the Trojans exist. One Trojan has been observationally confirmed to reside in Earth-Sun L4 Lagrange point (Connors et al., 2011). Note that the STEREO A and B s/c did not measure excess dust when they passed through the L4 and L5 regions, respectively, in late 2009 (Malaspina et al., 2015). This mission-if a dust detector is on board-may thus possibly give or exclude evidence of longer residence times of (large) dust in the Earth-Sun's Lagrange points. Impact speeds may be low though.\n\nAnother important aspect of dust science that is accessible from the inner heliosphere is ISD. Far outside of the ecliptic plane, the ISD flux (∼1.5 10 −4 m −2 sec −1 ) by far dominates the total flux while in the ecliptic plane, it makes up about up to 30% of the flux (Grün et al., 1997). Ulysses was thus an ideal platform for monitoring the ISD flow, and it did so for 16 years with a 0.1 m 2 detector. This time span is important, because the ISD flux depends on the solar cycle. Every other 11 years, the ISD particles, in particular those smaller than about half a micrometer in radius, focus and defocus toward and from the solar equatorial plane throughout the 22-year Hale cycle. Ulysses detected about 500-1,000 ISD particles with masses between 10 −12 and 10 −19 kg and provided the first ever direct detection of interstellar dust in the solar system (Grün et al., 1993(Grün et al., , 2019. More missions followed, even including composition analysis and sample return.\n\nThe suggested orbits of L4 and L5 have several advantages for the interstellar dust investigations: L4 will reach its highest latitude of 14.5° above the ecliptic plane in the early January time frame each year, while L5 will be at this point in early November. There, the IDP density is reduced to ∼30% of the density in the ecliptic plane. Both L4 and L5 will be at a longitude in the heliocentric ecliptic frame of ca. 240° and will thus be ideally moving into the ISD flow coming from approximately longitude 255° (Strub et al., 2015). This yields high dust impact velocities of nominally 40 km/s. Depending on particle size, velocities may vary between ca. 30 and 45 km/s. Moving \"against\" the stream of ISD also yields higher fluxes (Ulysses \"only\" had average impact velocities of about 26 km/s of the interstellar dust on the detector and thus lower fluxes), and higher impact speeds also augments composition analyses of ISD particles, since time-of-flight mass spectrometers are based on ionization of dust particles and target material upon impact, which depends on impact speed. The motion of the s/c against the stream of ISD at the orbit phase between ascending node and highest ecliptic latitude not only yields higher fluxes and higher impact velocities, but it is also here where the interplanetary and interstellar dust come from opposite directions, which simplifies distinguishing between the two populations.\n\nIf L4/L5 missions are launched around 2030 with a lifetime of 5 years, then they would be in place during solar minimum of the \"focusing phase\" of the solar magnetic cycle. The L1-L4-L5 missions would thus be ideally positioned in the focusing zone of ISD near the ecliptic plane. At this time, the portion of small ISD particles that can reach 1 AU is enhanced. An orbit with varying ecliptic latitudes provides a compelling opportunity to study the predicted ISD variability with the solar cycle (Sterken et al., 2012).\n\n\nL4 Mission Architecture\n\nThere have been numerous design studies published about stationing a spacecraft at L5, but we are not aware of any examinations of L4 as a vantage point. Since many of the aspects of operating from an L4 vantage point are equivalent to L5, it is useful to review some of the published studies before presenting our findings.\n\nA short description of an instrument and processor development needed for a possible L5 mission was provided by Akioka et al. (2005), but details of the mission design were not discussed.  described the mission design details for an L5 observatory carrying both remote sensing and in situ instrumentation. They reported that a hybrid propulsion architecture containing both solar electric and chemical propulsion was the most effective solution for the cruise and station-keeping phases of their proposed 900 kg spacecraft. Strugarek et al. (2015) proposed a pair of >500 kg spacecraft carrying remote sensing and in situ instrumentation. A single launch would put both in heliocentric drift orbits, but they did not specify what propulsion system would provide the necessary delta-V such that one leads Earth by 34° and the other lags Earth by the same amount. Lavraud et al. (2016) described a single micro satellite based on the PROBA platform with a separate propulsion module, with the estimated mass for the entire space vehicle more than 550 kg. They proposed a slow drift orbit toward L5 for 3 years, followed by a >1 year delta-V stopping maneuver using low thrust electrical propulsion before entering a stabilized 0.1 AU halo orbit around L5. Vourlidas (2015) reviewed several proposed implementation concepts and argued that an L5 mission should take priority over L4; however, he also noted that L4 is a natural follow-on because of the invisibility of energetic particle sources that affect Earth without warning.\n\nThe STEREO mission  provides a useful baseline in terms of payload composition [multiple remote sensing and in situ instrumentation]; a 1 A.U. environment; and communication of continuous low latency beacon data as well as daily downloads of full-resolution telemetry from comparable distances (Driesman et al., 2008). Of course, the STEREO spacecraft were in a heliocentric drift orbit, as they did not have onboard propulsion to stop and remain at L4/L5. But the actual communications rates for the full-resolution telemetry stream as the STEREO spacecraft drifted through L4/L5 were 240-360 kbps using the DSN 34 m antennas. Comparable data downlink capability is also found on PSP with conservatively estimated 138 kbs at a spacecraft-Earth distance of 1 AU, using a 0.6 m high-gain antenna with a 40 W RF system in Ka-band (Kinnison et al., 2013). The combined launch mass of the twin STEREO spacecraft was ∼1,300 kg, which included a 62 kg of hydrazine mono-propellant system that was capable of providing ∼180 m/s delta-V on each spacecraft.\n\n\nMission Design and Resource Assessment\n\nWe have examined conceptual mission design criteria for transfer to L4 with the following goals: Minimize cruise time to L4; increase the ecliptic inclination to optimize simultaneous view of both Sun's poles in conjunction with any Earth-bound mission and a simultaneous, similarly inclined L5 mission; and a stable orbit in the L4 region for multiple years. We examined three possibilities for propulsion requirements to increase the orbital inclination and drift-then-dwell at L4: launch vehicle performance; onboard chemical propulsion only; and onboard solar electric propulsion (SEPr). But like the mission concept described by  we found that the volumetric requirements for relying solely on onboard chemical propulsion were prohibitive, so we examined combinations of these techniques as an alternate possibility.\n\nThe launch energy (known as C3 and defined as the square of the hyperbolic excess velocity of the spacecraft with respect to Earth) is a measure of the velocity that must be supplied to the spacecraft by a launch vehicle. For example, assuming C3 values < 0 km 2 /s 2 , after a cruise phase of ∼4 years an additional 650 m/s delta-V would be necessary for an in-ecliptic orbital insertion at L4. To increase the orbital inclination to ∼14° at that time would cost an additional 7.5 km/s delta-V.\n\nAn alternative approach would be to have the launch vehicle supply sufficient C3 to change the orbital inclination initially. Our study found that with a C3 ∼25 km 2 /s 2 then an orbital inclination of ∼10° could be achieved, requiring onboard SEPr to provide an additional 2.5 km/s delta-V for about 90 days at L4 to achieve the desired 14.5° inclination. There are several existing launch services that can meet this C3 requirements today assuming a ∼2,000 kg spacecraft.\n\nWe also examined the possibility of launching two nearly identical spacecraft on a single vehicle, with one targeted to L4 and the other to L5 as shown in Figures 15 and 16. Each spacecraft would achieve the desired 14.5° inclination at their respective libration point. The orbits would be phased by choosing launch windows centered around the periods when Earth crossed the heliographic equator to maximize viewing the Sun's poles from Earth, L4, and L5 (see Figure 13) so that the improved background solar wind modeling discussed in Section 3.3 could be accomplished. An initial study indicates that, without altering the delta-V requirement for the L4 vehicle, only a small amount of additional mass would be needed as propulsion for the vehicle destined for L5. It appears there are numerous solutions in the trade space between launch vehicle-supplied C3 and onboard propulsion for delta-V on the L4 and L5 vehicles. It is likely there will be numerous cost-effective options for launch vehicles in the foreseeable future that will meet the C3 requirements for this conceptual mission.\n\n\nL4/L5 Payload Options\n\nWhile a detailed assessment of the mission payload is beyond the scope of this work, we list in Table 3 estimated resource requirements of instrumentation that would support the various science and SWx aspects we discussed in previous sections.\n\nIn this context, instrumentation missing from the STEREO payload are a photospheric vector magnetograph, whose measurements are to characterize the Sun's magnetic field and to drive many relevant physics-based models of eruptive events. A candidate instrument has been described recently by Staub et al. (2020) for a potential L5 mission led by ESA Space Situational Awareness Programme (Kraft et al., 2016) Pers. comm. R. Srama/Univ. Stuttgart. h Adjusted bit rate to take into account higher expected particle intensities. i Minimum telemetry, instrument could provide much higher cadence magnetograms.\n\n\nTable 3\n\nResource Requirements for a Sample Payload of Instruments of the Necessary Capabilities for an L4 Mission X-ray imager (e.g., Krucker et al., 2020) would allow to study the link between X-ray non-thermal emission and SEPs in more detail. Moreover, a dedicated dust detector would support the objectives we laid out in Section 4. This detector would require placement on the ram side of the s/c. While L4 would have significant accommodation space for a dust detector there, this would likely not be the case for L5, where the ram side would be used by the communications system and the heliospheric imaging system.\n\nThe tabulation of resource requirements shows that power, mass and telemetry requirements for the L4 mission are within the capabilities of current deep-space missions with Ka-band communications. The STEREO example shows that the full telemetry listed in Table 3 can be communicated to the ground with 1/3 coverage (8 h/day). While latency requirements may impose continuous beacon downlink for a subset of data, the bulk of the data is produced by vector magnetograph, EUV imager and coronagraphic and heliospheric imaging, part of which could be communicated to the ground with several hours latency.\n\n\nSummary and Conclusions\n\nThis work highlights several benefits for scientific understanding and for human space exploration stemming from a mission to the L4 Lagrangian point. The SRH, which coincides with the hemisphere in view from L4, is the source of all potentially hazardous solar energetic particle events at Earth. In combination with existing assets at Earth, continuous, detailed surveillance of active regions of 2/3 of a solar rotation would be established. An L4 mission would fill observational gaps near and beyond the W limb of the Sun that hamper current short-term radiation forecasting schemes for the Earth-Moon system, and similarly would provide inputs that would advance probabilistic long-term SEP forecasting tools that may in the future provide both SEP-and all-clear forecasts, both critical for operations to and at the Moon.\n\nWe expanded the analysis also to Mars explorers, which, on their journeys to and from Mars, would be particularly vulnerable to SEPs. On fast journeys to Mars, which would reduce exposure to cosmic rays considerably, explorers would be magnetically connected to regions behind the solar W limb as viewed from Earth, but well within view from L4. This along with the expanded longitude coverage that L4 provides for solar observations during astronauts' stay at Mars, would make an L4 mission a vital part of human Mars exploration plans.\n\nWe also analyzed potential contributions of an L4 observatory in the context of L1 and L5 observations on modeling and scientific understanding of the inner-heliosphere solar wind structure. This understanding is vital for our ability to predict the most severe geomagnetic storms at Earth, which are driven by Earth-directed CMEs. At current, coronal and solar wind models use global maps of the Sun's photospheric magnetic field. These maps are diachronic, that is, not all regions of the Sun are observed simultaneously but recorded over time, currently based only on Earth-bound observations. L4 and L5 missions would reduce the wait time for a complete map to ∼12 days. This alone would drastically improve inner heliosphere solar wind modeling. Flux emergence could be constrained further, even on the Sun's far side, through helioseismic holography, which would benefit from L4 observations. Moreover, L4 offers another platform for viewing the entire Sun-Earth line with coronographic and heliospheric imaging technology, but well out of the way of the associated SEPs that are associated with the Earth-directed CME (Posner et al., 2014).\n\nWe discussed the advantage an L4 mission would provide if combined with an Earth-bound mission for the reduction of ambiguity in the observation of solar magnetic fields through Zeeman polarimetry. Two magnetographs when placed 60° apart would resolve the inherent ambiguity in azimuthal magnetic field components, as illustrated in Figure 10, applying to quiet background fields, but also to active regions that rotate into the SRH. The added knowledge of vector magnetic fields combined with growing machine learning and AI technology could lead to breakthroughs in solar activity forecasting and understanding.\n\nBesides lack of longitudinal coverage, current solar wind models driven by magnetograms also suffer from lack of polar magnetic field constraints. We showed an example of solar wind model predictions for the PSP under solar minimum conditions. These predictions are extremely sensitive to polar fields, a problem that can only be improved with better observations, hence we suggest a specific change the orbital plane for L4 and L5. The ecliptic view angle of the solar poles varies between ±7.23° of heliographic latitude over the course of the year, with generally only one pole visible at a time. If L4 and L5 are added, the lack of visibility of both poles would be reduced to 1/3 (as shown in Figure 12). A significant step forward, though, would be an inclined injection of missions to L4 and L5, so that their orbits are located on the opposite side of the heliographic equator. If injected at the same absolute inclination as Earth, both solar poles would always be visible from at least one s/c. Moreover, in-situ observations of solar wind and magnetic field from L4-L5-L1 would systematically scan the region around the heliospheric current sheet and help determine its location and movement, adding the means to independently test the accuracy of inner-heliosphere solar wind models.\n\nPolar viewing angles as suggested are, admittedly, still shallow (∼3.6-7.2°), but we find that they would have direct impact on existing models, such as ADAPT. The Solar Orbiter mission, if operated simultaneously with our suggested L4-L1-L5 architecture, could provide a means for testing the required inclination of L4 and L5 missions so that a future operational space weather architecture would be optimized for driving inner heliosphere models.\n\nNew generations of cosmic dust instruments in combination with the suggested orbits for L4 and L5 can also provide the next big step in interplanetary and interstellar dust research close to our home planet. \n\nFigure 1 .\n1Figure 1. The Solar Radiation Hemisphere is the relative solar hemisphere from a 1 AU observer (such as the Earth-Moon system in this case) that has the potential to severely affect its local radiation environment. It spans solar longitudes from 30°E to 150°W relative to the observer and is centered around and fully observable from a location 60° ahead in the observers' orbit (here the Sun-Earth L4 location). The histogram shows the relative source longitudes of maximum solar energetic particle (SEP) 14-24 MeV proton intensity of all three-spacecraft SEP events in the STEREO era as described in Richardson et al. (2014). The relative trajectories of the Earth/Moon system with respect to sample Hohmann transfer orbits to and from Mars, and the Earth/Sun Lagrangian Point 4. The narrow, dashed lines indicate the relative orbital distances of Earth and Mars from the Sun. The thicker dashed line indicates an idealized interplanetary magnetic field line for a solar wind speed near average in the ecliptic plane. It connects to a location near 60°W on the Sun. Simulated 2-D SEP electron intensity contours (Strauss et al., 2017) for an event that is well connected with Earth are shown as well.\n\nFor perspective ,\nperspectiveFigures 5 and 7 of M.-H. Y.\n\nFigure 2 .\n21 outlines the ∼8-9-month trajectories of human explorers on the way to Mars (red dashed line)\n\nFigure 3 .\n3Same asFigure 2but the assumed solar wind speed is 300 km/s in this simulation.\n\nFigure 4 .\n4Contours of ∼40 MeV solar energetic particle proton intensity differences between the 300 km/s and the 500 km/s scenarios of Figures 2 and 3. All protons are emitted from the same 5° wide region located 15° behind the solar W limb Higher intensities are shifted significantly eastward (Earthward) in the heliosphere out to 1 AU.\n\nFigure 5 .\n5This figure shows the time profiles of 40 MeV solar energetic particle proton intensity (top) from a 105°W solar source region for the Earth-Moon system, derived from the energetic particle simulations shown in Figures 2 and 3. The peak intensity level in the Earth-Moon system (L1) for 300 km/s solar wind is within a factor of 5 of the highest intensity level at 1 AU, a four-fold increase over the 500 km/s simulation. Note that the intensity can rise very rapidly at L1, indicative of the good magnetic connection of the region behind the W solar limb.\n\n\nlight blue).\n\nFigure 6 .\n6The top graph shows a view of the inner heliosphere in a system that holds the Mars-Sun line fixed. The relative positions of Earth (blue), Earth-Sun L4 (black), and the Exploration Vehicle (orange) are indicated in 20-day intervals for the days 80-120 during the Hohmann return journey from Mars to Earth (red track). The nominal Parker magnetic field line connecting Mars with the Sun is also shown, alongside magnetic field line extensions from 1 AU outwards (all in black), indicating the magnetic field connections with Earth-Sun L4 during the same interval.\n\n\n. Missing ARs in the maps can and do impact the global magnetic\n\nFigure 7 .\n7A segment of the inner heliosphere in a system rotating with the Sun-Earth line is shown. The locations of Earth, Sun and Earth-Sun L4 are highlighted. Several trajectories to Mars are shown, from the Hohmann trajectory (red) to much faster transfers (green). Also indicated is the magnetic field connection of Earth (solid blue line) for slow (300 km/s) solar wind, and a magnetic field line that extends from the W limb of the Sun as viewed from Earth (dash-dotted blue line). The same applies to the W limb from Earth-Sun L4 (light blue).\n\nFigure 8 .\n8The figure shows return trajectories from Mars\n\nFigure 9 .\n9(Top) W ang-Sheeley-Arge (WSA) coronal magnetic field at 5Rs with light (dark) gray indicating positive (negative) field polarity. The yellow line shows the heliospheric current sheet. The red crosses indicate the daily subearth points (bottom). WSA derived coronal holes (colored regions). The field polarity at the photosphere is indicated by the light (positive polarity) and dark (negative polarity) gray contours, while the colored dots identify the footpoints of the open field lines (i.e., the coronal holes) at the photosphere. The dot color indicates the solar wind speed at 5.0 Rs (see color bar to the right of the figure) as predicted by the model. The white crosses near the equator mark the daily positions of the sub-earth point. The black straight lines identify the connectivity between the outer (open) boundary located at 5.0 Rs and the source regions of the solar wind at the photosphere (1.0 Rs). Note how extremely flat the current sheet is from January 11-25, and further how a very minor shift in latitude of the heliospheric current sheet (e.g., January 12 and 16) results in an abrupt transition of the solar wind source region from the southern to northern polar coronal hole.\n\nFigure 11 .\n11Comparison of Mount Wilson Solar Observatory (MWO) polar fields (colored dots) versus a subset of Air Force Data Assimilative Photospheric Flux Transport (ADAPT) model generated polar fields (colored lines) from late 2003 through the end of 2012. Each red (blue) dot corresponds to the longitudinally averaged magnetic field values residing in the northern(southern) most pixels in each of the available individual MWO Carrington maps. The magnetic field values have been converted to radial with the solar B angle accounted for. The vertical bars represent the standard deviation in the MWO values. ADAPT generates 12 model realizations but only four are shown here. This subset selected provides a realistic sense of the spread in the model values.\n\nFigure 12 .\n12shows select solar wind and magnetic field observations from Earth, STEREO A and STEREO B for CR 2129 (October 8-November 4, 2012). The figure displays the observations over the Carrington Longitude (CL) of the s/c, with time increasing from right to left. The top panel indicates the heliographic latitudes of the s/c during this Carrington rotation. In the second panel, we show magnetic polarities at the s/c latitudes. The magnetic polarities of the observations are shown as the The viewgraph shows the approximate heliographic latitude of s/c in L1, L4, and L5 for the ecliptic-plane scenario, taking into account the tilt of the ecliptic plane versus the heliographic equator. Assuming they are all equipped with solar remote-sensing instrumentation, the s/c would cover the widest range of heliographic latitudes during the months of May/June and November/December. During the months February/March (south) and August/September (north), all s/c would be located in one hemisphere. The insert on the top right shows the approximate inclination of the orbital planes of L1, L4, and L5 versus the heliographic equator.\n\nFigure 14 .\n14Earth L1 (OMNI), Stereo A and B observations arranged by the Carrington Longitude of the spacecraft location over the Sun's surface. Top: Heliographic latitude of the s/c. Second from top: Observed (inner traces) and Wang-Sheeley-Arge-model predicted (bounding traces) magnetic polarity at s/c longitude and latitude. Third from top: Solar wind speed over CL. Bottom: Magnetic field azimuth over CL. All observations were recorded in the October 8-November 4, 2012 time frame. Time resolution is one hour.magnetic sector observations of the range between 180 and 360° rather accurately, there are obvious challenges for many of the other locations.\n\nFigure 15 .\n15Transfer trajectory shown in solar rotating coordinate frame viewed from north ecliptic pole. Showing Sun-Earth vector and L4 and L5 locations.\n\n\nC. N. Arge and the Wang-Sheeley-Arge (WSA) model is supported by the NASA Internal Scientist Funding Model (ISFM). R. D. T. Strauss' contribution is based on research supported in part by the National Research Foundation of South Africa (NRF grant numbers: 119424, 120847, and 120345). Opinions expressed and conclusions arrived at are those of the authors and are not necessarily to be attributed to the NRF. C. J. Henney acknowledges that the ADAPT results are produced collaboratively between AFRL and NSO. V. J. Sterken received funding from the European Union's Horizon 2020 research and innovation programme under grant agreement N 851544.\n\n\nTable 1lists the nominal magnetic connection longitude of Earth based on solar wind speed, assuming it expands at constant speed between the Sun and 1 AU. (For comparison, the nominal connection longitudes from the Mars point of view are POSNER ET AL.10.1029/2021SW002777 \n\n3 of 27 \n\nSolar wind \nspeed \nEarth \n\nMars \nsemim. \nAxis \ndistance \n\nMars \nperihelion \n\nMars \naphelion \n\nLikelihood \n(at 1 AU) \n\n275-325 km/s 81.8°W 124.7°W 113.0°W 136.3°W \n8% \n\n325-375 km/s 70.1°W 106.9°W \n96.8°W 116.8°W \n22% \n\n375-425 km/s 61.4°W \n93.5°W \n84.7°W 102.2°W \n23% \n\n425-475 km/s 54.5°W \n83.1°W \n75.3°W \n90.9°W \n16% \n\n475-525 km/s 49.1°W \n74.8°W \n67.8°W \n81.8°W \n11% \n\n525-575 km/s 44.6°W \n68.0°W \n61.6°W \n74.3°W \n7% \n\n575-625 km/s 40.9°W \n62.3°W \n56.5°W \n68.1°W \n5% \n\n625-675 km/s 37.8°W \n57.5°W \n52.1°W \n62.9°W \n4% \n\n675-725 km/s 35.1°W \n53.4°W \n48.4°W \n58.4°W \n3% \n\n725-775 km/s 32.7°W \n49.9°W \n45.2°W \n54.5°W \n1% \n\n775-825 km/s 30.7°W \n46.8°W \n42.4°W \n51.1°W \n<0.5% \n\n\n\nTable 1\n1Nominal Magnetic Connection Longitudes in Dependence of Solar Wind Speed for Earth, Mars at Semimajor Axis Distance From the Sun, Mars at Perihelion and Mars at Aphelion\n\n\n. Similarly, an POSNER ET AL.Figure 16. Transfer trajectory shown in solar rotating coordinate frame viewed toward the Sun. Initial departure toward south ecliptic pole achieves 10° ecliptic inclination. SEPs, solar energetic particles; SW, space weather. a Gopalswamy, Davila, Auchère, et al. (2011) and Howard et al. (2008). bKrucker et al. (2020). cBougeret et al. (2008). dPosner et al. (2005) andHassler et al. (2012).Staub et al. (2020) for a recent resource estimate andSolanki et al. (2020) for the SO/PHI heritage instrument.f  .10.1029/2021SW002777 \n\n22 of 27 \n\nInstrument type \nApprox. power \nApprox. mass \nApprox. telemetry \nInstr. heritage \nSection reference \n\nCoronagr./Heliosph. Imager \n45 W \n35 kg \n20,000 bps \nSTEREO/SECCHI a \n1.1 \n\nSolar X Rays \n8 W \n7 kg \n700 bps \nSolar Orbiter/STIX b \n2, 2.3, 2.4 \n\nSolar Radio \n16 W \n14 kg \n2,200 bps \nSTEREO/SWAVES c \n2, 2.3, 2.4 \n\nSolar EUV Imager \n8 W \n10 kg \n30,000 bps \nSTEREO/SECCHI a \n2.1, 2.3 \n\nSEPs (e−, p+, Heavy Ions) \n5 W \n2 kg \n1,000 bps h \nMSL/RAD d \n2.3 \n\nSol. Magnetograph \n40 W \n28 kg \n54,000 bps i \nSolar Orbiter/PHI e \n3.1, 3.2 \n\nSW Plasma \n5 W \n10 kg \n3,000 bps \n(multiple) f \n3.3 \n\nSW Magn. Field \n3 W \n3 kg \n3,000 bps \n(multiple) f \n3.3 \n\nHeliosph. Dust (only L4) \n19 W \n8 kg \n1,000 bps \nDESTINY/DDA g \n4 \n\nTotal \n149 W \n117 kg \n114,900 bps \n\ne \n\ng \n\n\nData Availability StatementGONG global photospheric field map data used forFigure 9are available at ftp://gong2.nso.edu/QR/zqs/. ADAPT VSM global photospheric field map used inFigure 11can be obtained from https://gong.nso.edu/ adapt/maps/vsm/. Polar field data from Mount Wilson Solar Observatory (MWO) used forFigure 11are located at ftp://howard.astro.ucla.edu/pub/. AGONG global photospheric field map data used to generate WSA results forFigure 14are found at https://gong.nso.edu/adapt/maps/gong/. The STEREO and OMNI data for this figure are available at the Space Physics Data Facility https://spdf.gsfc.nasa.gov.\nThe L5 mission for space weather forecasting. M Akioka, T Nagatsuma, W Miyake, K Ohtaka, K Marubashi, 10.1016/j.asr.2004.09.014Advances in Space Research. 35Akioka, M., Nagatsuma, T., Miyake, W., Ohtaka, K., & Marubashi, K. (2005). The L5 mission for space weather forecasting. Advances in Space Research, 35, 65-69. https://doi.org/10.1016/j.asr.2004.09.014\n\nModeling the corona and solar wind using ADAPT maps that include far-side. C N Arge, C Henney, I Gonzalez-Hernandez, W Toussaint, J Koller, H Godinez, 10.1063/1.4810977Solar Wind 13. 1539Arge, C. N., Henney, C., Gonzalez-Hernandez, I., Toussaint, W., Koller, J., & Godinez, H. (2013). Modeling the corona and solar wind using ADAPT maps that include far-side. In Solar Wind 13, AIP Conference Series (Vol. 1539, p. 11-14). https://doi.org/10.1063/1.4810977\n\nImproving data drivers for coronal and solar wind models. C N Arge, C J Henney, J Koller, W A Toussaint, J W Harvey, S Young, ASTRONUM 2010, ASP Conference Series. 4499Arge, C. N., Henney, C. J., Koller, J., Toussaint, W. A., Harvey, J. W., & Young, S. (2011). Improving data drivers for coronal and solar wind models. In ASTRONUM 2010, ASP Conference Series (Vol. 44, p. 99).\n\nStream structure and coronal sources of the solar wind during the May 12th. C N Arge, J G Luhmann, D Odstrcil, C J Schrijver, Y Li, 10.1016/j.jastp.2004.03.018CME. Journal of Atmospheric and Solar-Terrestrial Physics. 66Arge, C. N., Luhmann, J. G., Odstrcil, D., Schrijver, C. J., & Li, Y. (2004). Stream structure and coronal sources of the solar wind dur- ing the May 12th, 1997 CME. Journal of Atmospheric and Solar-Terrestrial Physics, 66(15-16), 1295-1309. https://doi.org/10.1016/j. jastp.2004.03.018\n\nUpdated verification of the Space Weather Prediction Center's solar energetic particle prediction model. C C Balch, 10.1029/2007SW000337Space Weather. 6Balch, C. C. (2008). Updated verification of the Space Weather Prediction Center's solar energetic particle prediction model. Space Weath- er, 6, S01001. https://doi.org/10.1029/2007SW000337\n\nS/WAVES: The radio and plasma wave investigation on the STEREO mission. J L Bougeret, K Goetz, M L Kaiser, S D Bale, P J Kellogg, M Maksimovic, 10.1007/s11214-007-9298-8Space Science Reviews. 136Bougeret, J. L., Goetz, K., Kaiser, M. L., Bale, S. D., Kellogg, P. J., Maksimovic, M., et al. (2008). S/WAVES: The radio and plasma wave investigation on the STEREO mission. Space Science Reviews, 136, 487-528. https://doi.org/10.1007/s11214-007-9298-8\n\nEnsemble modeling of the 23 July 2012 coronal mass ejection. M D Cash, D A Biesecker, V Pizzo, C A De Koning, G Millward, C N Arge, 10.1002/2015SW001232Space Weather. 13Cash, M. D., Biesecker, D. A., Pizzo, V., de Koning, C. A., Millward, G., Arge, C. N., et al. (2015). Ensemble modeling of the 23 July 2012 coronal mass ejection. Space Weather, 13, 611-625. https://doi.org/10.1002/2015SW001232\n\nOn the possibility of predicting flare index and CME velocity using vector magnetograms. A Q Chen, J X Wang, 10.1007/s11433-019-1489-0Science China Physics, Mechanics & Astronomy. 636Chen, A. Q., & Wang, J. X. (2020), On the possibility of predicting flare index and CME velocity using vector magnetograms, Science China Physics, Mechanics & Astronomy, 63(6), 269512. https://doi.org/10.1007/s11433-019-1489-0\n\nEarth's Trojan asteroid. M Connors, P Wiegert, C Veillet, 10.1038/nature10233Nature. 475Connors, M., Wiegert, P., & Veillet, C. (2011). Earth's Trojan asteroid. Nature, 475, 4481-4483. https://doi.org/10.1038/nature10233\n\nThe STEREO observatory. A Driesman, S Hynes, G Cancro, 10.1007/s11214-007-9286%2DzSpace Science Reviews. 136Driesman, A., Hynes, S., & Cancro, G. (2008). The STEREO observatory. Space Science Reviews, 136, 17-44. https://doi.org/10.1007/ s11214-007-9286-z\n\nTime-distance helioseismology. T L Duvall, Jr, S M Jefferies, J W Harvey, M A Pomerantz, 10.1038/362430a0Nature. 3626419Duvall, T. L., Jr., Jefferies, S. M., Harvey, J. W., & Pomerantz, M. A. (1993). Time-distance helioseismology. Nature, 362(6419), 430-432. https://doi.org/10.1038/362430a0\n\nA tool for empirical forecasting of major flares, coronal mass ejections, and solar particle events from a proxy of active-region free magnetic energy. D Falconer, A F Barghouty, I Khazanov, R Moore, 10.1029/2009SW000537Space Weather. 9Falconer, D., Barghouty, A. F., Khazanov, I., & Moore, R. (2011). A tool for empirical forecasting of major flares, coronal mass ejections, and solar particle events from a proxy of active-region free magnetic energy. Space Weather, 9, S04003. https://doi.org/10.1029/2009SW000537\n\nSignal and noise in helioseismic holography. L Gizon, D Fournier, D Yang, A C Birch, H Barucq, 10.1051/0004-6361/201833825Astronomy and Astrophysics. 620Gizon, L., Fournier, D., Yang, D., Birch, A. C., & Barucq, H. (2018). Signal and noise in helioseismic holography. Astronomy and Astrophys- ics, 620, A136. https://doi.org/10.1051/0004-6361/201833825\n\nEarth-Affecting Solar Causes Observatory (EASCO): A mission at the Sun-Earth L5. N Gopalswamy, J M Davila, F Auchère, J Schou, C M Korendyke, A Shih, 10.1117/12.901538Proceedings of SPIE 8148. Solar Physics and Space Weather Instrumentation. SPIE 8148. Solar Physics and Space Weather InstrumentationIVGopalswamy, N., Davila, J. M., Auchère, F., Schou, J., Korendyke, C. M., Shih, A., et al. (2011). Earth-Affecting Solar Causes Observatory (EASCO): A mission at the Sun-Earth L5. Proceedings of SPIE 8148. Solar Physics and Space Weather Instrumentation, IV, 81480Z. https://doi.org/10.1117/12.901538\n\nEarth-affecting solar causes observatory (EASCO): A potential international living with a star mission from Sun-Earth L5. N Gopalswamy, J M Davila, O C Stcyr, E C Sittler, F Auchère, T L Duvall, Jr, 10.1016/j.jastp.2011.01.013Journal of Atmospheric and Solar-Terrestrial Physics. 73Gopalswamy, N., Davila, J. M., StCyr, O. C., Sittler, E. C., Auchère, F., Duvall, T. L., Jr., et al. (2011). Earth-affecting solar causes observatory (EASCO): A potential international living with a star mission from Sun-Earth L5. Journal of Atmospheric and Solar-Terrestrial Physics, 73, 658-663. https://doi.org/10.1016/j.jastp.2011.01.013\n\nThe dawn of dust astronomy. E Grün, H Krüger, R Srama, 10.1007/s11214-019-0610-1Space Science Reviews. 215Grün, E., Krüger, H., & Srama, R. (2019). The dawn of dust astronomy. Space Science Reviews, 215, 46. https://doi.org/10.1007/ s11214-019-0610-1\n\nSouth-north and radial traverses through the interplanetary dust cloud. E Grün, P Staubach, M Baguhl, D P Hamilton, H A Zook, S Dermott, 10.1006/icar.1997.5789Icarus. 129Grün, E., Staubach, P., Baguhl, M., Hamilton, D. P., Zook, H. A., Dermott, S., et al. (1997). South-north and radial traverses through the interplanetary dust cloud. Icarus, 129, 270-288. https://doi.org/10.1006/icar.1997.5789\n\nDiscovery of Jovian dust streams and interstellar grains by the Ulysses spacecraft. E Grün, H A Zook, M Baguhl, A Balogh, S J Bame, H Fechtig, 10.1038/362428a0Nature. 362Grün, E., Zook, H. A., Baguhl, M., Balogh, A., Bame, S. J., Fechtig, H., et al. (1993). Discovery of Jovian dust streams and interstellar grains by the Ulysses spacecraft. Nature, 362, 428-430. https://doi.org/10.1038/362428a0\n\nThe radiation assessment detector (RAD) investigation. D M Hassler, C Zeitlin, R F Wimmer-Schweingruber, S Böttcher, C Martin, J Andrews, 10.1007/s11214-012-9913-1Space Science Reviews. 170Hassler, D. M., Zeitlin, C., Wimmer-Schweingruber, R. F., Böttcher, S., Martin, C., Andrews, J., et al. (2012). The radiation assessment detector (RAD) investigation. Space Science Reviews, 170, 503-558. https://doi.org/10.1007/s11214-012-9913-1\n\nStereoscopic study of the kinematic evolution of a coronal mass ejection and its driven shock from the Sun to the Earth and the prediction of their arrival times. P Hess, J Zhang, 10.1088/0004-637X/792/1/49The Astrophysical Journal. 792149Hess, P., & Zhang, J. (2014). Stereoscopic study of the kinematic evolution of a coronal mass ejection and its driven shock from the Sun to the Earth and the prediction of their arrival times. The Astrophysical Journal, 792(1), 49. https://doi.org/10.1088/0004-637X/792/1/49\n\nData assimilation in the ADAPT photospheric flux transport model. K S Hickmann, H C Godinez, C J Henney, C N Arge, 10.1007/s11207-015-0666-3Solar Physics. 290Hickmann, K. S., Godinez, H. C., Henney, C. J., & Arge, C. N. (2015). Data assimilation in the ADAPT photospheric flux transport model. Solar Physics, 290, 1105-1118. https://doi.org/10.1007/s11207-015-0666-3\n\nDie Erreichbarkeit der Himmelskörper. R. Oldenbourg Munich-Berlin (Reprinted as NASA Techn. Transl. F-44. W Hohmann, Langley Field, VAHohmann, W. (1925). Die Erreichbarkeit der Himmelskörper. R. Oldenbourg Munich-Berlin (Reprinted as NASA Techn. Transl. F-44, Langley Field, VA, 1960).\n\nSun Earth connection coronal and heliospheric investigation (SECCHI). R A Howard, J D Moses, A Vourlidas, J S Newmark, D G Socker, S P Plunkett, 10.1007/s11214-008-9341-4Space Science Reviews. 136Howard, R. A., Moses, J. D., Vourlidas, A., Newmark, J. S., Socker, D. G., Plunkett, S. P., et al. (2008). Sun Earth connection coronal and heliospheric investigation (SECCHI). Space Science Reviews, 136, 67-115. https://doi.org/10.1007/s11214-008-9341-4\n\nIterative tomography: A key to providing time-dependent 3-D reconstructions of the inner heliosphere and the unification of space weather forecasting techniques. B V Jackson, A Buffington, L Cota, D Odstrcil, M M Bisi, R F Fallows, M Tokumaru, 10.3389/fspas.2020.568429Frontiers in Astronomy and Space Sciences. Jackson, B. V., Buffington, A., Cota, L., Odstrcil, D., Bisi, M. M., Fallows, R. F., & Tokumaru, M. (2020). Iterative tomography: A key to providing time-dependent 3-D reconstructions of the inner heliosphere and the unification of space weather forecasting techniques. Frontiers in Astronomy and Space Sciences, 7. https://doi.org/10.3389/fspas.2020.568429\n\nThe STEREO mission: An introduction. M L Kaiser, T A Kucera, J M Davila, O C Stcyr, M Guhathakurta, E Christian, 10.1007/s11214-007-9277-0Space Science Reviews. 136Kaiser, M. L., Kucera, T. A., Davila, J. M., StCyr, O. C., Guhathakurta, M., & Christian, E. (2008). The STEREO mission: An introduction. Space Science Reviews, 136, 5-16. https://doi.org/10.1007/s11214-007-9277-0\n\nForecasting the structure and orientation of earthbound coronal mass ejections. E K J Kilpua, N Lugaz, M L Mays, M Temmer, 10.1029/2018SW001944Space Weather. 17Kilpua, E. K. J., Lugaz, N., Mays, M. L., & Temmer, M. (2019). Forecasting the structure and orientation of earthbound coronal mass ejec- tions. Space Weather, 17, 498-526. https://doi.org/10.1029/2018SW001944\n\nEffect of shielding materials from SPEs on the lunar and Mars surface. M.-H Y Kim, X Hu, F A Cucinotta, 10.2514/6.2005-6653Proceedings of SPIE. Kim, M.-H. Y., Hu, X., & Cucinotta, F. A. (2005). Effect of shielding materials from SPEs on the lunar and Mars surface. Proceedings of SPIE, 2005-6653. https://doi.org/10.2514/6.2005-6653\n\nMHD heliosphere with boundary conditions from a tomographic reconstruction using interplanetary scintillation data. T K Kim, N V Pogorelov, S N Borovikov, B V Jackson, H S Yu, M Tokumaru, 10.1002/2013JA019755Journal of Geophysical Research: Space Physics. 119Kim, T. K., Pogorelov, N. V., Borovikov, S. N., Jackson, B. V., Yu, H. S., & Tokumaru, M. (2014). MHD heliosphere with boundary condi- tions from a tomographic reconstruction using interplanetary scintillation data. Journal of Geophysical Research: Space Physics, 119, 7981-7997. https://doi.org/10.1002/2013JA019755\n\nSolar Probe Plus: A mission to touch the sun. J Kinnison, M K Lockwood, N Fox, R Conde, A Driesman, 10.1109/AERO.2013.6496957IEEE Aerospace Conference. Kinnison, J., Lockwood, M. K., Fox, N., Conde, R., & Driesman, A. (2013). Solar Probe Plus: A mission to touch the sun, 2013. IEEE Aero- space Conference, 1-11. https://doi.org/10.1109/AERO.2013.6496957\n\nRemote sensing optical instrumentation for enhanced space weather monitoring from the L1 and L5 Lagrange points. S Kraft, K G Puschmann, J P Luntama, 10.1117/12.2296100Proceedings of SPIE. 10562Kraft, S., Puschmann, K. G., & Luntama, J. P. (2016). Remote sensing optical instrumentation for enhanced space weather monitoring from the L1 and L5 Lagrange points. Proceedings of SPIE, 10562, 1-9. https://doi.org/10.1117/12.2296100\n\nThe spectrometer/telescope for imaging X-rays (STIX). S Krucker, G J Hurford, O Grimm, S Kögl, H P Gröbelbauer, L Etesi, 10.1051/0004-6361/201937362Astronomy and Astrophysics. 642A15Krucker, S., Hurford, G. J., Grimm, O., Kögl, S., Gröbelbauer, H. P., Etesi, L., et al. (2020). The spectrometer/telescope for imaging X-rays (STIX). Astronomy and Astrophysics, 642(A15), 21. https://doi.org/10.1051/0004-6361/201937362\n\nA physics-based method that can predict imminent large solar flares. K Kusano, T Iju, Y Bamba, S Inoue, 10.1126/science.aaz2511Science. 3696503Kusano, K., Iju, T., Bamba, Y., & Inoue, S. (2020) ,A physics-based method that can predict imminent large solar flares, Science, 369(6503), 587-591. https://doi.org/10.1126/science.aaz2511\n\nMeasurements of photospheric and chromospheric magnetic fields. A Lagg, B Lites, J Harvey, S Gosain, R Centeno, 10.1007/s11214-015-0219%2DySpace Science Reviews. 210Lagg, A., Lites, B., Harvey, J., Gosain, S., & Centeno, R. (2017). Measurements of photospheric and chromospheric magnetic fields. Space Science Reviews, 210, 37-76. https://doi.org/10.1007/s11214-015-0219-y\n\nFurther note on the effect on cosmic-ray intensity of the magnetic storm of March 1, 1942. Terrestrial Magnetism and Atmospheric Electricity. I Lange, S E Forbush, 10.1029/TE047i004p0033147Lange, I., & Forbush, S. E. (1942). Further note on the effect on cosmic-ray intensity of the magnetic storm of March 1, 1942. Terrestrial Magnetism and Atmospheric Electricity, 47(4), 331. https://doi.org/10.1029/TE047i004p00331\n\nA short-term ESPERTA-based forecast tool for moderate-to-extreme solar proton events. M Laurenza, T Alberti, E W Cliver, 10.3847/1538-4357/aab712The Astrophysical Journal. 857Laurenza, M., Alberti, T., & Cliver, E. W. (2018). A short-term ESPERTA-based forecast tool for moderate-to-extreme solar proton events. The Astrophysical Journal, 857, 2. https://doi.org/10.3847/1538-4357/aab712\n\nA technique for short-term warning of solar energetic particle events based on flare location, flare size, and evidence of particle escape. M Laurenza, E W Cliver, J Hewitt, M Storini, A G Ling, C C Balch, M L Kaiser, 10.1029/2007SW000379Space Weather. 7Laurenza, M., Cliver, E. W., Hewitt, J., Storini, M., Ling, A. G., Balch, C. C., & Kaiser, M. L. (2009). A technique for short-term warning of solar energetic particle events based on flare location, flare size, and evidence of particle escape. Space Weather, 7, S04008. https://doi. org/10.1029/2007SW000379\n\nA small mission concept to the Sun-Earth Lagrangian L5 point for innovative solar, heliospheric and space weather science. B Lavraud, Y Liu, K Segura, J He, G Qin, M Temmer, 10.1016/j.jastp.2016.06.004Journal of Atmospheric and Solar-Terrestrial Physics. 146Lavraud, B., Liu, Y., Segura, K., He, J., Qin, G., Temmer, M., et al. (2016). A small mission concept to the Sun-Earth Lagrangian L5 point for innovative solar, heliospheric and space weather science. Journal of Atmospheric and Solar-Terrestrial Physics, 146, 171-185. https:// doi.org/10.1016/j.jastp.2016.06.004\n\nResolving the 180° ambiguity in solar vector magnetic field data: Evaluating the effects of noise, spatial resolution, and method assumptions. K D Leka, G Barnes, A D Crouch, T R Metcalf, Allen Gary, G , 10.1007/s11207-009-9440-8Solar Physics. 260Leka, K. D., Barnes, G., Crouch, A. D., Metcalf, T. R., Allen Gary, G., et al. (2009). Resolving the 180° ambiguity in solar vector mag- netic field data: Evaluating the effects of noise, spatial resolution, and method assumptions. Solar Physics, 260, 83-108. https://doi. org/10.1007/s11207-009-9440-8\n\n. R A Leske, E R Christian, C M S Cohen, A C Cummings, A J Davis, M I Desai, Observations of theLeske, R. A., Christian, E. R., Cohen, C. M. S., Cummings, A. C., Davis, A. J., Desai, M. I., et al. (2020). Observations of the 2019\n\nApril 4 solar energetic particle event at the Parker Solar Probe. 10.3847/1538-4365/ab5712The Astrophysical Journal Supplement Series. 24635April 4 solar energetic particle event at the Parker Solar Probe. The Astrophysical Journal Supplement Series, 246, 35. https://doi. org/10.3847/1538-4365/ab5712\n\nA statistical analysis of 50 years of daily solar wind velocity data. K J Li, J Zhanng, W Feng, 10.3847/0004-6256/151/5/128The Astrophysical Journal. 151Li, K. J., Zhanng, J., & Feng, W. (2016). A statistical analysis of 50 years of daily solar wind velocity data. The Astrophysical Journal, 151, 128. https://doi.org/10.3847/0004-6256/151/5/128\n\nTesting the reliability of predictions of far-side active regions from helioseismology using STEREO far-side observations of solar activity. P C Liewer, I González Hernández, J R Hall, C Lindsey, X Lin, 10.1007/s11207-014-0542-6Solar Physics. 289Liewer, P. C., González Hernández, I., Hall, J. R., Lindsey, C., & Lin, X. (2014). Testing the reliability of predictions of far-side active re- gions from helioseismology using STEREO far-side observations of solar activity. Solar Physics, 289, 3617-3640. https://doi.org/10.1007/ s11207-014-0542-6\n\nSeismic images of the far side of the Sun. C Lindsey, D C Braun, 10.1126/science.287.5459.1799Science. 287Lindsey, C., & Braun, D. C. (2000). Seismic images of the far side of the Sun. Science, 287, 1799-1801. https://doi.org/10.1126/ science.287.5459.1799\n\nThe Solar Orbiter mission. Science overview. D Müller, O C Stcyr, I Zouganelis, H R Gilbert, R Marsden, T Nieves-Chinchilla, 10.1051/0004-6361/202038467Astronomy and Astrophysics. 642Müller, D., StCyr, O. C., Zouganelis, I., Gilbert, H. R., Marsden, R., Nieves-Chinchilla, T., et al. (2020). The Solar Orbiter mission. Science overview. Astronomy and Astrophysics, 642, A1. https://doi.org/10.1051/0004-6361/202038467\n\nValidation of community models: Identifying events in space weather model timelines. P Macneice, 10.1029/2009SW000463Space Weather. 7MacNeice, P. (2009a). Validation of community models: Identifying events in space weather model timelines. Space Weather, 7, S06004. https://doi.org/10.1029/2009SW000463\n\nValidation of community models: 2. Development of a baseline using the Wang-Sheeley-Arge model. P Macneice, 10.1029/2009SW000489Space Weather. 7MacNeice, P. (2009b). Validation of community models: 2. Development of a baseline using the Wang-Sheeley-Arge model. Space Weather, 7, S12002. https://doi.org/10.1029/2009SW000489\n\nValidation of community models: 3. Tracing field lines in heliospheric models. P Macneice, B Elliott, A Acebal, 10.1029/2011SW000665Space Weather. 9MacNeice, P., Elliott, B., & Acebal, A. (2011). Validation of community models: 3. Tracing field lines in heliospheric models. Space Weather, 9, S10003. https://doi.org/10.1029/2011SW000665\n\nRevisiting STEREO interplanetary and interstellar dust flux and mass estimates. D M Malaspina, L E O&apos;brien, F Thayer, Z Sternovsky, A Collette, 10.1002/2015JA021352Journal of Geophysical Research: Space Research. 120Malaspina, D. M., O'Brien, L. E., Thayer, F., Sternovsky, Z., & Collette, A. (2015). Revisiting STEREO interplanetary and interstellar dust flux and mass estimates. Journal of Geophysical Research: Space Research, 120, 6085-6100. https://doi.org/10.1002/2015JA021352\n\nModeling solar wind with boundary conditions from interplanetary scintillations. P Manoharan, T Kim, N V Pogorelov, C N Arge, P K Manoharan, 10.1088/1742-6596/642/1/012016Journal of Physics: Conference Series. 64212016Manoharan, P., Kim, T., Pogorelov, N. V., Arge, C. N., & Manoharan, P. K. (2015). Modeling solar wind with boundary conditions from interplanetary scintillations. Journal of Physics: Conference Series, 642, 012016. https://doi.org/10.1088/1742-6596/642/1/012016\n\nAnalysis of the magnetic field discontinuity at the PFSS and Schatten current sheet interface in the WSA model. S L Mcgregor, W J Hughes, C N Arge, M J Owens, 10.1029/2007JA012330Journal of Geophysical Research. 113McGregor, S. L., Hughes, W. J., Arge, C. N., & Owens, M. J. (2008). Analysis of the magnetic field discontinuity at the PFSS and Schatten current sheet interface in the WSA model. Journal of Geophysical Research, 113, A08112. https://doi.org/10.1029/2007JA012330\n\nAn overview of existing algorithms for resolving the 180° ambiguity in vector magnetic fields: Quantitative tests with synthetic data. T R Metcalf, K D Leka, G Barnes, B W Lites, M K Georgoulis, A A Pevtsov, 10.1007/s11207-006-0170%2DxSolar Physics. 237Metcalf, T. R., Leka, K. D., Barnes, G., Lites, B. W., Georgoulis, M. K., Pevtsov, A. A., et al. (2006). An overview of existing algorithms for resolving the 180° ambiguity in vector magnetic fields: Quantitative tests with synthetic data. Solar Physics, 237, 267-296. https://doi. org/10.1007/s11207-006-0170-x\n\nForecast performance assessment of a kinematic and a magnetohydrodynamic solar wind model. Space Weather. D C Norquist, 10.1029/2012SW00085311Norquist, D. C. (2013). Forecast performance assessment of a kinematic and a magnetohydrodynamic solar wind model. Space Weather, 11, 17-33. https://doi.org/10.1029/2012SW000853\n\nA comparative verification of forecasts from two operational solar wind models. D C Norquist, W C Meeks, 10.1029/2010SW000598Space Weather, 8, S12005. Norquist, D. C., & Meeks, W. C. (2010). A comparative verification of forecasts from two operational solar wind models. Space Weather, 8, S12005. https://doi.org/10.1029/2010SW000598\n\nPredicting solar energetic proton events (E > 10 MeV). Space Weather. M Núñez, 10.1029/2010SW0006409Núñez, M. (2011). Predicting solar energetic proton events (E > 10 MeV). Space Weather, 9, S07003. https://doi.org/10.1029/2010SW000640\n\nOperational modeling of heliospheric space weather for the Parker Solar Probe. D Odstrçil, M L Mays, P Hess, S I Jones, C J Henney, C N Arge, 10.3847/1538-4365/ab77cbThe Astrophysical Journal Supplement Series. 2246Odstrçil, D., Mays, M. L., Hess, P., Jones, S. I., Henney, C. J., & Arge, C. N. (2020). Operational modeling of heliospheric space weather for the Parker Solar Probe. The Astrophysical Journal Supplement Series, 246(2). https://doi.org/10.3847/1538-4365/ab77cb\n\nPropagation of the 12 May 1997 interplanetary coronal mass ejection in evolving solar wind structures. D Odstrçil, V J Pizzo, C N Arge, 10.1029/2004JA010745Journal of Geophysical Research. 110Odstrçil, D., Pizzo, V. J., & Arge, C. N. (2005). Propagation of the 12 May 1997 interplanetary coronal mass ejection in evolving solar wind structures. Journal of Geophysical Research, 110, A02106. https://doi.org/10.1029/2004JA010745\n\nNumerical simulation of the 12 May 1997 interplanetary CME event. D Odstrçil, P Riley, X P Zhao, 10.1029/2003JA010135Journal of Geophysical Research. 109Odstrçil, D., Riley, P., & Zhao, X. P. (2004). Numerical simulation of the 12 May 1997 interplanetary CME event. Journal of Geophysical Research, 109, A02116. https://doi.org/10.1029/2003JA010135\n\nAn event-based approach to validating solar wind speed predictions: High speed enhancements in the Wang-Sheeley-Arge model. M J Owens, C N Arge, H E Spence, A Pembroke, 10.1029/2005JA011343Journal of Geophysical Research. 110Owens, M. J., Arge, C. N., Spence, H. E., & Pembroke, A. (2005). An event-based approach to validating solar wind speed predic- tions: High speed enhancements in the Wang-Sheeley-Arge model. Journal of Geophysical Research, 110, A12105. https://doi. org/10.1029/2005JA011343\n\nMetrics for solar wind prediction models: Comparison of empirical, hybrid and physics-based schemes with 8-years of L1 observations. M J Owens, H E Spence, S Mcgregor, W J Hughes, J M Quinn, C N Arge, 10.1029/2007SW000380Space Weather. 6Owens, M. J., Spence, H. E., McGregor, S., Hughes, W. J., Quinn, J. M., Arge, C. N., et al. (2008). Metrics for solar wind prediction models: Comparison of empirical, hybrid and physics-based schemes with 8-years of L1 observations. Space Weather, 6, S08001. https://doi. org/10.1029/2007SW000380\n\nEffect of additional magnetograph observations from different Lagrangian points in Sun-Earth system on predicted properties of quasi-steady solar wind at 1 AU. Space Weather. A A Pevtsov, G Petrie, P Macneice, I I Virtanen, 10.1029/2020SW00244818Pevtsov, A. A., Petrie, G., MacNeice, P., & Virtanen, I. I. (2020). Effect of additional magnetograph observations from different Lagrangian points in Sun-Earth system on predicted properties of quasi-steady solar wind at 1 AU. Space Weather, 18, e2020SW002448. https://doi. org/10.1029/2020SW002448\n\nWang-Sheeley-Arge-Enlil cone model transitions to operations. V Pizzo, G Millward, A Parsons, D Biesecker, S Hill, D Odstrcil, 10.1029/2011SW000663Space Weather. 9Pizzo, V., Millward, G., Parsons, A., Biesecker, D., Hill, S., & Odstrcil, D. (2011). Wang-Sheeley-Arge-Enlil cone model transitions to oper- ations. Space Weather, 9, S03004. https://doi.org/10.1029/2011SW000663\n\nTheoretical basis for operational ensemble forecasting of coronal mass ejections. V J Pizzo, C De Koning, M Cash, G Millward, D A Biesecker, L Puga, 10.1002/2015SW001221Space Weather. 1310Pizzo, V. J., de Koning, C., Cash, M., Millward, G., Biesecker, D. A., Puga, L., et al. (2015). Theoretical basis for operational ensemble fore- casting of coronal mass ejections. Space Weather, 13(10), 676-697. https://doi.org/10.1002/2015SW001221\n\nEUHFORIA: European heliospheric forecasting information asset. J Pomoell, S Poedts, 10.1051/swsc/2018020Journal of Space Weather and Space Climate. 827Pomoell, J., & Poedts, S. (2018). EUHFORIA: European heliospheric forecasting information asset. Journal of Space Weather and Space Climate, 8(27), A35. https://doi.org/10.1051/swsc/2018020\n\nUp to 1-hour forecasting of radiation hazards from solar energetic ion events with relativistic electrons. A Posner, 10.1029/2006SW000268Space Weather. 5Posner, A. (2007). Up to 1-hour forecasting of radiation hazards from solar energetic ion events with relativistic electrons. Space Weather, 5, S05001. https://doi.org/10.1029/2006SW000268\n\nA high energy telescope for the Solar Orbiter. A Posner, D M Hassler, D J Mccomas, S Rafkin, R F Wimmer-Schweingruber, E Böhm, 10.1016/j.asr.2004.11.040Advances in Space Research. 36Posner, A., Hassler, D. M., McComas, D. J., Rafkin, S., Wimmer-Schweingruber, R. F., Böhm, E., et al. (2005). A high energy telescope for the Solar Orbiter. Advances in Space Research, 36, 1426-1431. https://doi.org/10.1016/j.asr.2004.11.040\n\nThe main pillar: Assessment of space weather operational asset performance supporting nowcasting, forecasting and research to operations. A Posner, M Hesse, St, O C Cyr, 10.1002/2013SW001007Space Weather. 124Posner, A., Hesse, M., & St. Cyr, O. C. (2014). The main pillar: Assessment of space weather operational asset performance supporting nowcasting, forecasting and research to operations. Space Weather, 12(4), 257-276. https://doi.org/10.1002/2013SW001007\n\nThe Hohmann-Parker effect measured by the Mars science laboratory on the transfer from Earth to Mars: Consequences and opportunities. A Posner, D Odstrçil, P Macneice, L Rastaetter, C Zeitlin, B Heber, 10.1016/j.pss.2013.09.013Planetary and Space Science. 89Posner, A., Odstrçil, D., MacNeice, P., Rastaetter, L., Zeitlin, C., Heber, B., et al. (2013). The Hohmann-Parker effect measured by the Mars science laboratory on the transfer from Earth to Mars: Consequences and opportunities. Planetary and Space Science, 89, 127-139. https://doi.org/10.1016/j.pss.2013.09.013\n\nWarning time analysis from SEP simulations of a two-tier REleASE system applied to Mars exploration. Space Weather. A Posner, R D Strauss, 10.1029/2019SW00235418Posner, A., & Strauss, R. D. (2020). Warning time analysis from SEP simulations of a two-tier REleASE system applied to Mars exploration. Space Weather, 18, e2019SW002354. https://doi.org/10.1029/2019SW002354\n\n>25 MeV proton events observed by the high-energy telescopes on the STEREO A and B spacecraft and/or at the Earth during the first ∼seven years of the STEREO mission. I G Richardson, T T Von Rosenvinge, H V Cane, E R Christian, C M S Cohen, A W Labrador, 10.1007/s11207-014-0524-8Solar Physics. 289Richardson, I. G., von Rosenvinge, T. T., Cane, H. V., Christian, E. R., Cohen, C. M. S., Labrador, A. W., et al. (2014). >25 MeV proton events observed by the high-energy telescopes on the STEREO A and B spacecraft and/or at the Earth during the first ∼seven years of the STEREO mission. Solar Physics, 289, 3059-3107. https://doi.org/10.1007/s11207-014-0524-8\n\nCorotating interaction regions during the recent solar minimum: The power and limitations of global MHD modeling. P Riley, J A Linker, R Lionello, Z Mikic, 10.1016/j.jastp.2011.12.013Journal of Atmospheric and Solar-Terrestrial Physics. 83Riley, P., Linker, J. A., Lionello, R., & Mikic, Z. (2012). Corotating interaction regions during the recent solar minimum: The power and limitations of global MHD modeling. Journal of Atmospheric and Solar-Terrestrial Physics, 83, 1-10. https://doi.org/10.1016/j. jastp.2011.12.013\n\nModels and data analysis tools for the Solar Orbiter mission. A P Rouillard, R F Pinto, A Vourlidas, A De Groof, W T Thompson, A Bemporad, 10.1051/0004-6361/201935305Astronomy and Astrophysics. 642Rouillard, A. P., Pinto, R. F., Vourlidas, A., De Groof, A., Thompson, W. T., Bemporad, A., et al. (2020). Models and data analysis tools for the Solar Orbiter mission. Astronomy and Astrophysics, 642, A2. https://doi.org/10.1051/0004-6361/201935305\n\nDesign and ground calibration of the helioseismic and magnetic imager (HMI) instrument on the solar dynamics observatory (SDO). Solar Physics. J Schou, P H Scherrer, R I Bush, R Wachter, S Couvidat, M C Rabello-Soares, 10.1007/s11207-011-9842-2275Schou, J., Scherrer, P. H., Bush, R. I., Wachter, R., Couvidat, S., Rabello-Soares, M. C., et al. (2012). Design and ground calibration of the helioseismic and magnetic imager (HMI) instrument on the solar dynamics observatory (SDO). Solar Physics, 275, 229-259. https://doi. org/10.1007/s11207-011-9842-2\n\nDriving major solar flares and eruptions: A review. C J Schrijver, 10.1016/j.asr.2008.11.004Advances in Space Research. 43Schrijver, C. J. (2009). Driving major solar flares and eruptions: A review. Advances in Space Research, 43, 739-755. https://doi.org/10.1016/j. asr.2008.11.004\n\nPhotospheric and heliospheric magnetic fields. C J Schrijver, M L Derosa, 10.1023/A%3A1022908504100Solar Physics. 212Schrijver, C. J., & DeRosa, M. L. (2003). Photospheric and heliospheric magnetic fields. Solar Physics, 212, 165-200. https://doi. org/10.1023/A:1022908504100\n\nCelestial mechanics and polarization optics of the Kordylewski dust cloud in the Earth-Moon Lagrange point L5-I. Three-dimensional celestial mechanical modelling of dust cloud formation. J Sliz-Balogh, A Barta, G Horvath, 10.1093/mnras/sty2049Monthly Notices of the Royal Astronomical Society. 480Sliz-Balogh, J., Barta, A., & Horvath, G. (2018). Celestial mechanics and polarization optics of the Kordylewski dust cloud in the Earth- Moon Lagrange point L5-I. Three-dimensional celestial mechanical modelling of dust cloud formation. Monthly Notices of the Royal Astronomical Society, 480, 5550-5559. https://doi.org/10.1093/mnras/sty2049\n\nCelestial mechanics and polarization optics of the Kordylewski dust cloud in the Earth-Moon Lagrange point L5-Part II. J Sliz-Balogh, A Barta, G Horvath, 10.1093/mnras/sty263Monthly Notices of the Royal Astronomical Society. 482Imaging polarimetric observation: New evidence for the existence of Kordylewski dust cloudSliz-Balogh, J., Barta, A., & Horvath, G. (2019). Celestial mechanics and polarization optics of the Kordylewski dust cloud in the Earth- Moon Lagrange point L5-Part II. Imaging polarimetric observation: New evidence for the existence of Kordylewski dust cloud. Monthly Notices of the Royal Astronomical Society, 482, 762-770. https://doi.org/10.1093/mnras/sty263\n\nPPS76: A computerized event mode solar proton forecasting technique. D F Smart, M A Shea, NOAA Solar-Terrest. Predictions, Proc. 1Smart, D. F., & Shea, M. A. (1979). PPS76: A computerized event mode solar proton forecasting technique. NOAA Solar-Terrest. Predictions, Proc (Vol. 1, pp. 406-427).\n\nThe polarimetric and helioseismic imager on solar orbiter. S K Solanki, J C Del Toro Iniesta, J Woch, A Gandorfer, J Hirzberger, A Alvarez-Herrero, 10.1051/0004-6361/201935325Astronomy and Astrophysics. 642Solanki, S. K., del Toro Iniesta, J. C., Woch, J., Gandorfer, A., Hirzberger, J., Alvarez-Herrero, A., et al. (2020). The polarimetric and helio- seismic imager on solar orbiter. Astronomy and Astrophysics, 642, A11. https://doi.org/10.1051/0004-6361/201935325\n\nPMI: The photospheric magnetic field imager. J Staub, G Fernandez-Rico, A Gandorfer, L Gizon, J Hirzberger, S Kraft, 10.1051/swsc/2020059Journal of Space Weather and Space Climate. 10Staub, J., Fernandez-Rico, G., Gandorfer, A., Gizon, L., Hirzberger, J., Kraft, S., et al. (2020). PMI: The photospheric magnetic field imager. Journal of Space Weather and Space Climate, 10, 54. https://doi.org/10.1051/swsc/2020059\n\nThe flow of interstellar dust into the solar system. V J Sterken, N Altobelli, S Kempf, G Schwehm, R Srama, E Grün, 10.1051/0004-6361/201117119Astronomy and Astrophysics. 538Sterken, V. J., Altobelli, N., Kempf, S., Schwehm, G., Srama, R., & Grün, E. (2012). The flow of interstellar dust into the solar system. As- tronomy and Astrophysics, 538, A102. https://doi.org/10.1051/0004-6361/201117119\n\nPerpendicular diffusion of solar energetic particles: Model results and implications for electrons. R D Strauss, N Dresing, N E Engelbrecht, 10.3847/1538-4357/aa5df5The Astrophysical Journal. Strauss, R. D., Dresing, N., & Engelbrecht, N. E. (2017), Perpendicular diffusion of solar energetic particles: Model results and implications for electrons, The Astrophysical Journal, 837-843. https://doi.org/10.3847/1538-4357/aa5df5\n\nSixteen years of Ulysses interstellar dust measurements in the solar system. P Strub, H Krüger, V J Sterken, 10.1088/0004-637X/812/2/140The Astrophysical Journal. 812140II. Fluctuations in the dust flow from the dataStrub, P., Krüger, H., & Sterken, V. J. (2015). Sixteen years of Ulysses interstellar dust measurements in the solar system. II. Fluctuations in the dust flow from the data. The Astrophysical Journal, 812, 140. https://doi.org/10.1088/0004-637X/812/2/140\n\nA space weather mission concept: Observatories of the solar corona and active regions (OSCAR). A Strugarek, N Janitzek, A Lee, P Löschl, B Seifert, S Hoilijoki, 10.1051/swsc/2015003Journal of Space Weather and Space Climate. 5Strugarek, A., Janitzek, N., Lee, A., Löschl, P., Seifert, B., Hoilijoki, S., et al. (2015). A space weather mission concept: Observatories of the solar corona and active regions (OSCAR). Journal of Space Weather and Space Climate, 5, A4. https://doi.org/10.1051/swsc/2015003\n\nThe strength of the Sun's polar fields. Solar Physics. L Svalgaard, T L Duvall, P H Scherrer, 10.1007/BF0015726858Svalgaard, L., Duvall, T. L., & Scherrer, P. H. (1978). The strength of the Sun's polar fields. Solar Physics, 58, 225-239. https://doi. org/10.1007/BF00157268\n\nAdaptive numerical algorithms in space weather modeling. G Tóth, B Van Der Holst, I V Sokolov, D L De Zeeuw, T I Gombosi, F Fang, 10.1016/j.jcp.2011.02.006Journal of Computational Physics. 231Tóth, G., van der Holst, B., Sokolov, I. V., De Zeeuw, D. L., Gombosi, T. I., Fang, F., et al. (2012). Adaptive numerical algorithms in space weather modeling. Journal of Computational Physics, 231, 870-903. https://doi.org/10.1016/j.jcp.2011.02.006\n\nSubstorm warnings: An ISEE-3 real time data system. B Tsurutani, D N Baker, 10.1029/eo060i041p00701Eos. 6041Tsurutani, B., & Baker, D. N. (1979). Substorm warnings: An ISEE-3 real time data system. Eos, 60(41), 701-703. https://doi.org/10.1029/ eo060i041p00701\n\nPredicting the Sun's polar magnetic fields with a surface flux transport model. L Upton, D H Hathaway, 10.1088/0004-637X/780/1/5The Astrophysical Journal. 780Upton, L., & Hathaway, D. H. (2014). Predicting the Sun's polar magnetic fields with a surface flux transport model. The Astrophysical Journal, 780, 1. https://doi.org/10.1088/0004-637X/780/1/5\n\nMission to the Sun-Earth L5 Lagrangian point: An optimal platform for space weather research. A Vourlidas, 10.1002/2015SW001173Space Weather. 13Vourlidas, A. (2015). Mission to the Sun-Earth L5 Lagrangian point: An optimal platform for space weather research. Space Weather, 13, 197-201. https://doi.org/10.1002/2015SW001173\n\nEstimating total open Heliospheric magnetic flux. S Wallace, C N Arge, M Pattichis, R A Hock-Mysliwiec, C J Henney, 10.1007/s11207-019-1402-1Solar Physics. 294220Wallace, S., Arge, C. N., Pattichis, M., Hock-Mysliwiec, R. A., & Henney, C. J. (2019). Estimating total open Heliospheric magnetic flux. Solar Physics, 294(2), 20. https://doi.org/10.1007/s11207-019-1402-1\n\nPredicting solar flares with machine learning: Investigating solar cycle dependence. X Wang, Y Chen, G Toth, W B Manchester, T I Gombosi, A O Hero, 10.3847/1538-4357/ab89acThe Astrophysical Journal. 895113Wang, X., Chen, Y., Toth, G., Manchester, W. B., Gombosi, T. I., Hero, A. O., et al. (2020). Predicting solar flares with machine learning: Investigating solar cycle dependence. The Astrophysical Journal, 895(1), 13. https://doi.org/10.3847/1538-4357/ab89ac\n\nOn potential field models of the Solar corona. Y.-M Wang, N R Sheeley, Jr, 10.1086/171430The Astrophysical Journal. 392310Wang, Y.-M., & Sheeley, N. R., Jr. (1992). On potential field models of the Solar corona. The Astrophysical Journal, 392, 310. https://doi. org/10.1086/171430\n\nThe ULYSSES mission. K P Wenzel, R G Marsden, D E Page, E J Smith, Astronomy & Astrophysics Supplement Series. 92207Wenzel, K. P., Marsden, R. G., Page, D. E., & Smith, E. J. (1992). The ULYSSES mission. Astronomy & Astrophysics Supplement Series, 92, 207.\n\nThe magnetic field in the solar atmosphere. T Wiegelmann, J K Thalmann, S K Solanki, 10.1007/s00159-014-0078-7Astronomy and Astrophysics Review. 22Wiegelmann, T., Thalmann, J. K., & Solanki, S. K. (2014). The magnetic field in the solar atmosphere. Astronomy and Astrophysics Review, 22, 78. https://doi.org/10.1007/s00159-014-0078-7\n\nModeling experiments in helioseismic holography. D Yang, Ph.D. ThesisGeorg-August-Universität GöttingenYang, D. (2018). Modeling experiments in helioseismic holography (Ph.D. Thesis). Georg-August-Universität Göttingen. Retrieved from http://hdl.handle.net/21.11130/00-1735-0000-0003-C115-B\n\nMeasurements of energetic particle radiation in transit to Mars on MSL. C Zeitlin, D M Hassler, F A Cucinotta, B Ehresmann, R F Wimmer-Schweingruber, D E Brinza, 10.1126/science.1235989Science. 3406136Zeitlin, C., Hassler, D. M., Cucinotta, F. A., Ehresmann, B., Wimmer-Schweingruber, R. F., Brinza, D. E., et al. (2013). Measurements of energetic particle radiation in transit to Mars on MSL. Science, 340(6136), 1080-1084. https://doi.org/10.1126/science.1235989\n\nGAMERA: A three-dimensional finite-volume MHD solver for non-orthogonal curvilinear geometries. B Zhang, K A Sorathia, J G Lyon, V G Merkin, J S Garretson, M Wiltberger, 10.3847/1538-4365/ab3a4cThe Astrophysical Journal Supplement Series. 244120Zhang, B., Sorathia, K. A., Lyon, J. G., Merkin, V. G., Garretson, J. S., & Wiltberger, M. (2019). GAMERA: A three-dimensional finite-vol- ume MHD solver for non-orthogonal curvilinear geometries. The Astrophysical Journal Supplement Series, 244(1), 20. https://doi. org/10.3847/1538-4365/ab3a4c\n\nImaging the Sun's far-side active regions by applying multiple measurement schemes on multiskip acoustic waves. J Zhao, D Hing, R Chen, S Hess Webber, 10.3847/1538-4357/ab5951The Astrophysical Journal. 8872216Zhao, J., Hing, D., Chen, R., & Hess Webber, S. (2019). Imaging the Sun's far-side active regions by applying multiple measurement schemes on multiskip acoustic waves. The Astrophysical Journal, 887(2), 216. https://doi.org/10.3847/1538-4357/ab5951\n\nDynamics of charged dust in the orbit of Venus. L Zhou, C Lhotka, C Galees, N Yasuhito, L.-Y Zhou, 10.1051/0004-6361/202039617Astronomy and Astrophysics. 645Zhou, L., Lhotka, C., Galees, C., Yasuhito, N., & Zhou, L.-Y. (2021). Dynamics of charged dust in the orbit of Venus. Astronomy and Astro- physics, 645, A63. https://doi.org/10.1051/0004-6361/202039617\n", "annotations": {"author": "[{\"end\":92,\"start\":58},{\"end\":151,\"start\":93},{\"end\":226,\"start\":152},{\"end\":341,\"start\":227},{\"end\":399,\"start\":342},{\"end\":518,\"start\":400},{\"end\":582,\"start\":519},{\"end\":700,\"start\":583},{\"end\":779,\"start\":701},{\"end\":835,\"start\":780},{\"end\":905,\"start\":836},{\"end\":985,\"start\":906},{\"end\":1093,\"start\":986},{\"end\":1148,\"start\":1094},{\"end\":1216,\"start\":1149},{\"end\":1259,\"start\":1217}]", "publisher": null, "author_last_name": "[{\"end\":66,\"start\":60},{\"end\":101,\"start\":97},{\"end\":159,\"start\":154},{\"end\":236,\"start\":231},{\"end\":349,\"start\":344},{\"end\":411,\"start\":404},{\"end\":532,\"start\":525},{\"end\":596,\"start\":585},{\"end\":712,\"start\":703},{\"end\":787,\"start\":782},{\"end\":846,\"start\":840},{\"end\":918,\"start\":908},{\"end\":995,\"start\":990},{\"end\":1100,\"start\":1096},{\"end\":1161,\"start\":1151},{\"end\":1228,\"start\":1221}]", "author_first_name": "[{\"end\":59,\"start\":58},{\"end\":94,\"start\":93},{\"end\":96,\"start\":95},{\"end\":153,\"start\":152},{\"end\":228,\"start\":227},{\"end\":230,\"start\":229},{\"end\":343,\"start\":342},{\"end\":401,\"start\":400},{\"end\":403,\"start\":402},{\"end\":520,\"start\":519},{\"end\":524,\"start\":521},{\"end\":584,\"start\":583},{\"end\":702,\"start\":701},{\"end\":781,\"start\":780},{\"end\":837,\"start\":836},{\"end\":839,\"start\":838},{\"end\":907,\"start\":906},{\"end\":987,\"start\":986},{\"end\":989,\"start\":988},{\"end\":1095,\"start\":1094},{\"end\":1150,\"start\":1149},{\"end\":1218,\"start\":1217},{\"end\":1220,\"start\":1219}]", "author_affiliation": "[{\"end\":91,\"start\":68},{\"end\":150,\"start\":103},{\"end\":225,\"start\":161},{\"end\":285,\"start\":238},{\"end\":340,\"start\":287},{\"end\":398,\"start\":351},{\"end\":477,\"start\":413},{\"end\":517,\"start\":479},{\"end\":581,\"start\":534},{\"end\":637,\"start\":598},{\"end\":699,\"start\":639},{\"end\":778,\"start\":714},{\"end\":834,\"start\":789},{\"end\":904,\"start\":848},{\"end\":984,\"start\":920},{\"end\":1044,\"start\":997},{\"end\":1092,\"start\":1046},{\"end\":1147,\"start\":1102},{\"end\":1215,\"start\":1163},{\"end\":1258,\"start\":1230}]", "title": "[{\"end\":55,\"start\":1},{\"end\":1314,\"start\":1260}]", "venue": null, "abstract": "[{\"end\":4965,\"start\":1618}]", "bib_ref": "[{\"attributes\":{\"ref_id\":\"b72\"},\"end\":5567,\"start\":5551},{\"attributes\":{\"ref_id\":\"b85\"},\"end\":7567,\"start\":7542},{\"attributes\":{\"ref_id\":\"b19\"},\"end\":8730,\"start\":8711},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":9145,\"start\":9105},{\"attributes\":{\"ref_id\":\"b59\"},\"end\":9168,\"start\":9147},{\"attributes\":{\"ref_id\":\"b33\"},\"end\":11416,\"start\":11393},{\"end\":12343,\"start\":12309},{\"attributes\":{\"ref_id\":\"b38\"},\"end\":12722,\"start\":12702},{\"attributes\":{\"ref_id\":\"b40\"},\"end\":13805,\"start\":13788},{\"attributes\":{\"ref_id\":\"b40\"},\"end\":13995,\"start\":13978},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":15510,\"start\":15497},{\"attributes\":{\"ref_id\":\"b53\"},\"end\":15735,\"start\":15722},{\"attributes\":{\"ref_id\":\"b76\"},\"end\":15896,\"start\":15876},{\"attributes\":{\"ref_id\":\"b35\"},\"end\":16154,\"start\":16132},{\"attributes\":{\"ref_id\":\"b34\"},\"end\":16178,\"start\":16154},{\"attributes\":{\"ref_id\":\"b68\"},\"end\":16406,\"start\":16382},{\"attributes\":{\"ref_id\":\"b31\"},\"end\":17394,\"start\":17373},{\"attributes\":{\"ref_id\":\"b68\"},\"end\":18553,\"start\":18529},{\"attributes\":{\"ref_id\":\"b68\"},\"end\":20079,\"start\":20055},{\"attributes\":{\"ref_id\":\"b80\"},\"end\":20589,\"start\":20567},{\"attributes\":{\"ref_id\":\"b80\"},\"end\":22607,\"start\":22585},{\"attributes\":{\"ref_id\":\"b67\"},\"end\":22892,\"start\":22868},{\"attributes\":{\"ref_id\":\"b67\"},\"end\":23315,\"start\":23290},{\"attributes\":{\"ref_id\":\"b26\"},\"end\":24704,\"start\":24687},{\"attributes\":{\"ref_id\":\"b67\"},\"end\":25251,\"start\":25226},{\"attributes\":{\"ref_id\":\"b40\"},\"end\":25718,\"start\":25702},{\"attributes\":{\"ref_id\":\"b66\"},\"end\":28149,\"start\":28128},{\"attributes\":{\"ref_id\":\"b68\"},\"end\":29103,\"start\":29078},{\"attributes\":{\"ref_id\":\"b63\"},\"end\":29494,\"start\":29480},{\"attributes\":{\"ref_id\":\"b67\"},\"end\":29643,\"start\":29619},{\"attributes\":{\"ref_id\":\"b66\"},\"end\":30650,\"start\":30630},{\"attributes\":{\"ref_id\":\"b67\"},\"end\":31450,\"start\":31425},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":34229,\"start\":34188},{\"attributes\":{\"ref_id\":\"b59\"},\"end\":34250,\"start\":34229},{\"attributes\":{\"ref_id\":\"b66\"},\"end\":38237,\"start\":38217},{\"attributes\":{\"ref_id\":\"b3\"},\"end\":39038,\"start\":39019},{\"attributes\":{\"ref_id\":\"b49\"},\"end\":39060,\"start\":39038},{\"attributes\":{\"ref_id\":\"b88\"},\"end\":39081,\"start\":39060},{\"end\":39148,\"start\":39126},{\"end\":39172,\"start\":39148},{\"attributes\":{\"ref_id\":\"b69\"},\"end\":39201,\"start\":39181},{\"attributes\":{\"ref_id\":\"b27\"},\"end\":39237,\"start\":39220},{\"attributes\":{\"ref_id\":\"b95\"},\"end\":39266,\"start\":39246},{\"attributes\":{\"ref_id\":\"b84\"},\"end\":39292,\"start\":39273},{\"attributes\":{\"ref_id\":\"b62\"},\"end\":39331,\"start\":39307},{\"attributes\":{\"ref_id\":\"b60\"},\"end\":39503,\"start\":39483},{\"attributes\":{\"ref_id\":\"b25\"},\"end\":39635,\"start\":39614},{\"attributes\":{\"ref_id\":\"b61\"},\"end\":39654,\"start\":39635},{\"attributes\":{\"ref_id\":\"b44\"},\"end\":39850,\"start\":39835},{\"attributes\":{\"ref_id\":\"b45\"},\"end\":39867,\"start\":39850},{\"attributes\":{\"ref_id\":\"b46\"},\"end\":39889,\"start\":39867},{\"attributes\":{\"ref_id\":\"b51\"},\"end\":39904,\"start\":39889},{\"attributes\":{\"ref_id\":\"b52\"},\"end\":39927,\"start\":39904},{\"attributes\":{\"ref_id\":\"b57\"},\"end\":39945,\"start\":39927},{\"attributes\":{\"ref_id\":\"b58\"},\"end\":39965,\"start\":39945},{\"attributes\":{\"ref_id\":\"b83\"},\"end\":40297,\"start\":40273},{\"attributes\":{\"ref_id\":\"b90\"},\"end\":40324,\"start\":40297},{\"attributes\":{\"ref_id\":\"b71\"},\"end\":40460,\"start\":40440},{\"attributes\":{\"ref_id\":\"b23\"},\"end\":40890,\"start\":40868},{\"attributes\":{\"ref_id\":\"b48\"},\"end\":40929,\"start\":40905},{\"attributes\":{\"ref_id\":\"b32\"},\"end\":41189,\"start\":41171},{\"attributes\":{\"ref_id\":\"b2\"},\"end\":42245,\"start\":42227},{\"attributes\":{\"ref_id\":\"b20\"},\"end\":42267,\"start\":42245},{\"attributes\":{\"ref_id\":\"b73\"},\"end\":42292,\"start\":42267},{\"attributes\":{\"ref_id\":\"b86\"},\"end\":42315,\"start\":42292},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":42790,\"start\":42772},{\"attributes\":{\"ref_id\":\"b6\"},\"end\":42808,\"start\":42790},{\"attributes\":{\"ref_id\":\"b12\"},\"end\":48594,\"start\":48574},{\"attributes\":{\"ref_id\":\"b41\"},\"end\":48614,\"start\":48594},{\"attributes\":{\"ref_id\":\"b42\"},\"end\":48636,\"start\":48614},{\"attributes\":{\"ref_id\":\"b93\"},\"end\":48647,\"start\":48636},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":48703,\"start\":48682},{\"attributes\":{\"ref_id\":\"b96\"},\"end\":48721,\"start\":48703},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":49129,\"start\":49111},{\"attributes\":{\"ref_id\":\"b92\"},\"end\":50391,\"start\":50367},{\"attributes\":{\"ref_id\":\"b37\"},\"end\":50539,\"start\":50520},{\"attributes\":{\"ref_id\":\"b50\"},\"end\":50560,\"start\":50539},{\"attributes\":{\"ref_id\":\"b77\"},\"end\":51139,\"start\":51117},{\"attributes\":{\"ref_id\":\"b43\"},\"end\":51196,\"start\":51175},{\"attributes\":{\"ref_id\":\"b70\"},\"end\":51313,\"start\":51289},{\"attributes\":{\"ref_id\":\"b2\"},\"end\":53858,\"start\":53839},{\"attributes\":{\"ref_id\":\"b20\"},\"end\":53880,\"start\":53858},{\"attributes\":{\"ref_id\":\"b59\"},\"end\":56864,\"start\":56843},{\"attributes\":{\"ref_id\":\"b87\"},\"end\":56880,\"start\":56864},{\"attributes\":{\"ref_id\":\"b91\"},\"end\":63831,\"start\":63811},{\"attributes\":{\"ref_id\":\"b74\"},\"end\":65071,\"start\":65047},{\"attributes\":{\"ref_id\":\"b97\"},\"end\":65416,\"start\":65397},{\"attributes\":{\"ref_id\":\"b8\"},\"end\":65590,\"start\":65568},{\"attributes\":{\"ref_id\":\"b47\"},\"end\":65752,\"start\":65728},{\"attributes\":{\"ref_id\":\"b16\"},\"end\":66242,\"start\":66223},{\"attributes\":{\"ref_id\":\"b17\"},\"end\":66835,\"start\":66817},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":66855,\"start\":66835},{\"attributes\":{\"ref_id\":\"b81\"},\"end\":67475,\"start\":67455},{\"attributes\":{\"ref_id\":\"b79\"},\"end\":68888,\"start\":68866},{\"attributes\":{\"ref_id\":\"b0\"},\"end\":69375,\"start\":69355},{\"attributes\":{\"ref_id\":\"b82\"},\"end\":69790,\"start\":69767},{\"attributes\":{\"ref_id\":\"b36\"},\"end\":70126,\"start\":70105},{\"attributes\":{\"ref_id\":\"b87\"},\"end\":70513,\"start\":70497},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":71089,\"start\":71066},{\"attributes\":{\"ref_id\":\"b28\"},\"end\":71623,\"start\":71600},{\"attributes\":{\"ref_id\":\"b78\"},\"end\":75332,\"start\":75313},{\"attributes\":{\"ref_id\":\"b29\"},\"end\":75429,\"start\":75409},{\"attributes\":{\"ref_id\":\"b30\"},\"end\":75785,\"start\":75764},{\"attributes\":{\"ref_id\":\"b65\"},\"end\":79400,\"start\":79379},{\"attributes\":{\"ref_id\":\"b30\"},\"end\":91721,\"start\":91700},{\"attributes\":{\"ref_id\":\"b5\"},\"end\":91746,\"start\":91724},{\"attributes\":{\"ref_id\":\"b64\"},\"end\":91769,\"start\":91749},{\"attributes\":{\"ref_id\":\"b18\"},\"end\":91794,\"start\":91773},{\"attributes\":{\"ref_id\":\"b78\"},\"end\":91814,\"start\":91795},{\"attributes\":{\"ref_id\":\"b77\"},\"end\":91870,\"start\":91849}]", "figure": "[{\"attributes\":{\"id\":\"fig_1\"},\"end\":83190,\"start\":81975},{\"attributes\":{\"id\":\"fig_2\"},\"end\":83248,\"start\":83191},{\"attributes\":{\"id\":\"fig_3\"},\"end\":83356,\"start\":83249},{\"attributes\":{\"id\":\"fig_4\"},\"end\":83449,\"start\":83357},{\"attributes\":{\"id\":\"fig_5\"},\"end\":83791,\"start\":83450},{\"attributes\":{\"id\":\"fig_6\"},\"end\":84361,\"start\":83792},{\"attributes\":{\"id\":\"fig_7\"},\"end\":84376,\"start\":84362},{\"attributes\":{\"id\":\"fig_9\"},\"end\":84953,\"start\":84377},{\"attributes\":{\"id\":\"fig_10\"},\"end\":85019,\"start\":84954},{\"attributes\":{\"id\":\"fig_11\"},\"end\":85574,\"start\":85020},{\"attributes\":{\"id\":\"fig_13\"},\"end\":85634,\"start\":85575},{\"attributes\":{\"id\":\"fig_15\"},\"end\":86851,\"start\":85635},{\"attributes\":{\"id\":\"fig_16\"},\"end\":87617,\"start\":86852},{\"attributes\":{\"id\":\"fig_17\"},\"end\":88756,\"start\":87618},{\"attributes\":{\"id\":\"fig_18\"},\"end\":89420,\"start\":88757},{\"attributes\":{\"id\":\"fig_19\"},\"end\":89579,\"start\":89421},{\"attributes\":{\"id\":\"fig_20\"},\"end\":90227,\"start\":89580},{\"attributes\":{\"id\":\"tab_0\",\"type\":\"table\"},\"end\":91189,\"start\":90228},{\"attributes\":{\"id\":\"tab_1\",\"type\":\"table\"},\"end\":91369,\"start\":91190},{\"attributes\":{\"id\":\"tab_3\",\"type\":\"table\"},\"end\":92700,\"start\":91370}]", "paragraph": "[{\"end\":5321,\"start\":4967},{\"end\":5996,\"start\":5323},{\"end\":6865,\"start\":5998},{\"end\":7568,\"start\":6919},{\"end\":8883,\"start\":7570},{\"end\":9784,\"start\":8885},{\"end\":10351,\"start\":9786},{\"end\":11251,\"start\":10379},{\"end\":12345,\"start\":11308},{\"end\":13380,\"start\":12347},{\"end\":13996,\"start\":13382},{\"end\":14812,\"start\":13998},{\"end\":15322,\"start\":14814},{\"end\":17135,\"start\":15324},{\"end\":17530,\"start\":17191},{\"end\":18457,\"start\":17532},{\"end\":18853,\"start\":18459},{\"end\":19265,\"start\":18855},{\"end\":20655,\"start\":19267},{\"end\":20896,\"start\":20657},{\"end\":21630,\"start\":20898},{\"end\":22173,\"start\":21632},{\"end\":23396,\"start\":22202},{\"end\":25733,\"start\":23398},{\"end\":26244,\"start\":25735},{\"end\":27837,\"start\":26272},{\"end\":28658,\"start\":27839},{\"end\":29422,\"start\":28660},{\"end\":29777,\"start\":29424},{\"end\":30315,\"start\":29779},{\"end\":30502,\"start\":30317},{\"end\":31144,\"start\":30504},{\"end\":31610,\"start\":31146},{\"end\":32570,\"start\":31612},{\"end\":32814,\"start\":32572},{\"end\":34495,\"start\":32816},{\"end\":34721,\"start\":34497},{\"end\":35084,\"start\":34723},{\"end\":35308,\"start\":35086},{\"end\":35933,\"start\":35337},{\"end\":36827,\"start\":35935},{\"end\":38651,\"start\":36829},{\"end\":39966,\"start\":38837},{\"end\":41467,\"start\":39968},{\"end\":44825,\"start\":41469},{\"end\":46380,\"start\":44856},{\"end\":46419,\"start\":46404},{\"end\":46998,\"start\":46421},{\"end\":48548,\"start\":47010},{\"end\":49195,\"start\":48550},{\"end\":49881,\"start\":49197},{\"end\":51314,\"start\":49883},{\"end\":52319,\"start\":51316},{\"end\":54661,\"start\":52344},{\"end\":55337,\"start\":54663},{\"end\":56287,\"start\":55339},{\"end\":56881,\"start\":56289},{\"end\":57524,\"start\":56883},{\"end\":58258,\"start\":57585},{\"end\":59491,\"start\":58260},{\"end\":59976,\"start\":59493},{\"end\":61397,\"start\":59978},{\"end\":61873,\"start\":61399},{\"end\":63232,\"start\":61898},{\"end\":64517,\"start\":63327},{\"end\":65951,\"start\":64519},{\"end\":66935,\"start\":65953},{\"end\":68366,\"start\":66937},{\"end\":68889,\"start\":68368},{\"end\":69241,\"start\":68917},{\"end\":70770,\"start\":69243},{\"end\":71820,\"start\":70772},{\"end\":72684,\"start\":71863},{\"end\":73181,\"start\":72686},{\"end\":73656,\"start\":73183},{\"end\":74750,\"start\":73658},{\"end\":75020,\"start\":74776},{\"end\":75626,\"start\":75022},{\"end\":76252,\"start\":75638},{\"end\":76857,\"start\":76254},{\"end\":77713,\"start\":76885},{\"end\":78252,\"start\":77715},{\"end\":79401,\"start\":78254},{\"end\":80016,\"start\":79403},{\"end\":81313,\"start\":80018},{\"end\":81764,\"start\":81315},{\"end\":81974,\"start\":81766}]", "formula": null, "table_ref": "[{\"attributes\":{\"ref_id\":\"tab_1\"},\"end\":14481,\"start\":14474},{\"attributes\":{\"ref_id\":\"tab_1\"},\"end\":21916,\"start\":21909},{\"attributes\":{\"ref_id\":\"tab_1\"},\"end\":25731,\"start\":25724},{\"attributes\":{\"ref_id\":\"tab_1\"},\"end\":31421,\"start\":31414},{\"end\":42763,\"start\":42756},{\"end\":43708,\"start\":43701},{\"end\":74879,\"start\":74872},{\"end\":76517,\"start\":76510}]", "section_header": "[{\"attributes\":{\"n\":\"1.1.\"},\"end\":6917,\"start\":6868},{\"attributes\":{\"n\":\"1.2.\"},\"end\":10377,\"start\":10354},{\"attributes\":{\"n\":\"2.\"},\"end\":11306,\"start\":11254},{\"attributes\":{\"n\":\"2.1.\"},\"end\":17189,\"start\":17138},{\"attributes\":{\"n\":\"2.2.\"},\"end\":22200,\"start\":22176},{\"attributes\":{\"n\":\"2.3.\"},\"end\":26270,\"start\":26247},{\"attributes\":{\"n\":\"2.4.\"},\"end\":35335,\"start\":35311},{\"attributes\":{\"n\":\"3.\"},\"end\":38764,\"start\":38654},{\"attributes\":{\"n\":\"3.1.\"},\"end\":38835,\"start\":38767},{\"attributes\":{\"n\":\"3.2.\"},\"end\":44854,\"start\":44828},{\"end\":46402,\"start\":46383},{\"end\":47008,\"start\":47001},{\"end\":52342,\"start\":52322},{\"attributes\":{\"n\":\"3.3.\"},\"end\":57583,\"start\":57527},{\"end\":61896,\"start\":61876},{\"attributes\":{\"n\":\"4.\"},\"end\":63325,\"start\":63235},{\"attributes\":{\"n\":\"5.\"},\"end\":68915,\"start\":68892},{\"attributes\":{\"n\":\"5.1.\"},\"end\":71861,\"start\":71823},{\"attributes\":{\"n\":\"5.2.\"},\"end\":74774,\"start\":74753},{\"end\":75636,\"start\":75629},{\"attributes\":{\"n\":\"6.\"},\"end\":76883,\"start\":76860},{\"end\":81986,\"start\":81976},{\"end\":83209,\"start\":83192},{\"end\":83260,\"start\":83250},{\"end\":83368,\"start\":83358},{\"end\":83461,\"start\":83451},{\"end\":83803,\"start\":83793},{\"end\":84388,\"start\":84378},{\"end\":85031,\"start\":85021},{\"end\":85586,\"start\":85576},{\"end\":85646,\"start\":85636},{\"end\":86864,\"start\":86853},{\"end\":87630,\"start\":87619},{\"end\":88769,\"start\":88758},{\"end\":89433,\"start\":89422},{\"end\":91198,\"start\":91191}]", "table": "[{\"end\":91189,\"start\":90481},{\"end\":92700,\"start\":91910}]", "figure_caption": "[{\"end\":83190,\"start\":81988},{\"end\":83248,\"start\":83221},{\"end\":83356,\"start\":83262},{\"end\":83449,\"start\":83370},{\"end\":83791,\"start\":83463},{\"end\":84361,\"start\":83805},{\"end\":84376,\"start\":84364},{\"end\":84953,\"start\":84390},{\"end\":85019,\"start\":84956},{\"end\":85574,\"start\":85033},{\"end\":85634,\"start\":85588},{\"end\":86851,\"start\":85648},{\"end\":87617,\"start\":86867},{\"end\":88756,\"start\":87633},{\"end\":89420,\"start\":88772},{\"end\":89579,\"start\":89436},{\"end\":90227,\"start\":89582},{\"end\":90481,\"start\":90230},{\"end\":91369,\"start\":91200},{\"end\":91910,\"start\":91372}]", "figure_ref": "[{\"attributes\":{\"ref_id\":\"fig_1\"},\"end\":18273,\"start\":18265},{\"attributes\":{\"ref_id\":\"fig_1\"},\"end\":18852,\"start\":18844},{\"attributes\":{\"ref_id\":\"fig_1\"},\"end\":18988,\"start\":18980},{\"attributes\":{\"ref_id\":\"fig_3\"},\"end\":22979,\"start\":22971},{\"attributes\":{\"ref_id\":\"fig_3\"},\"end\":23792,\"start\":23784},{\"attributes\":{\"ref_id\":\"fig_4\"},\"end\":23840,\"start\":23832},{\"attributes\":{\"ref_id\":\"fig_5\"},\"end\":23919,\"start\":23911},{\"attributes\":{\"ref_id\":\"fig_6\"},\"end\":24382,\"start\":24374},{\"attributes\":{\"ref_id\":\"fig_6\"},\"end\":25159,\"start\":25151},{\"end\":27009,\"start\":27003},{\"attributes\":{\"ref_id\":\"fig_1\"},\"end\":27924,\"start\":27916},{\"attributes\":{\"ref_id\":\"fig_9\"},\"end\":31779,\"start\":31771},{\"attributes\":{\"ref_id\":\"fig_9\"},\"end\":33389,\"start\":33381},{\"attributes\":{\"ref_id\":\"fig_13\"},\"end\":37095,\"start\":37087},{\"attributes\":{\"ref_id\":\"fig_11\"},\"end\":37370,\"start\":37362},{\"end\":37819,\"start\":37811},{\"attributes\":{\"ref_id\":\"fig_13\"},\"end\":37952,\"start\":37944},{\"attributes\":{\"ref_id\":\"fig_15\"},\"end\":44646,\"start\":44638},{\"attributes\":{\"ref_id\":\"fig_1\"},\"end\":51039,\"start\":51030},{\"attributes\":{\"ref_id\":\"fig_1\"},\"end\":51902,\"start\":51893},{\"attributes\":{\"ref_id\":\"fig_1\"},\"end\":52362,\"start\":52353},{\"attributes\":{\"ref_id\":\"fig_1\"},\"end\":53328,\"start\":53319},{\"attributes\":{\"ref_id\":\"fig_1\"},\"end\":54898,\"start\":54889},{\"attributes\":{\"ref_id\":\"fig_1\"},\"end\":55264,\"start\":55255},{\"attributes\":{\"ref_id\":\"fig_1\"},\"end\":55501,\"start\":55492},{\"attributes\":{\"ref_id\":\"fig_1\"},\"end\":58737,\"start\":58728},{\"attributes\":{\"ref_id\":\"fig_1\"},\"end\":59649,\"start\":59640},{\"attributes\":{\"ref_id\":\"fig_1\"},\"end\":59836,\"start\":59827},{\"attributes\":{\"ref_id\":\"fig_1\"},\"end\":61916,\"start\":61907},{\"attributes\":{\"ref_id\":\"fig_1\"},\"end\":61935,\"start\":61926},{\"attributes\":{\"ref_id\":\"fig_1\"},\"end\":73830,\"start\":73813},{\"attributes\":{\"ref_id\":\"fig_1\"},\"end\":74128,\"start\":74119},{\"attributes\":{\"ref_id\":\"fig_1\"},\"end\":79745,\"start\":79736},{\"attributes\":{\"ref_id\":\"fig_1\"},\"end\":80726,\"start\":80716}]", "bib_author_first_name": "[{\"end\":93370,\"start\":93369},{\"end\":93380,\"start\":93379},{\"end\":93393,\"start\":93392},{\"end\":93403,\"start\":93402},{\"end\":93413,\"start\":93412},{\"end\":93759,\"start\":93758},{\"end\":93761,\"start\":93760},{\"end\":93769,\"start\":93768},{\"end\":93779,\"start\":93778},{\"end\":93801,\"start\":93800},{\"end\":93814,\"start\":93813},{\"end\":93824,\"start\":93823},{\"end\":94200,\"start\":94199},{\"end\":94202,\"start\":94201},{\"end\":94210,\"start\":94209},{\"end\":94212,\"start\":94211},{\"end\":94222,\"start\":94221},{\"end\":94232,\"start\":94231},{\"end\":94234,\"start\":94233},{\"end\":94247,\"start\":94246},{\"end\":94249,\"start\":94248},{\"end\":94259,\"start\":94258},{\"end\":94596,\"start\":94595},{\"end\":94598,\"start\":94597},{\"end\":94606,\"start\":94605},{\"end\":94608,\"start\":94607},{\"end\":94619,\"start\":94618},{\"end\":94631,\"start\":94630},{\"end\":94633,\"start\":94632},{\"end\":94646,\"start\":94645},{\"end\":95133,\"start\":95132},{\"end\":95135,\"start\":95134},{\"end\":95444,\"start\":95443},{\"end\":95446,\"start\":95445},{\"end\":95458,\"start\":95457},{\"end\":95467,\"start\":95466},{\"end\":95469,\"start\":95468},{\"end\":95479,\"start\":95478},{\"end\":95481,\"start\":95480},{\"end\":95489,\"start\":95488},{\"end\":95491,\"start\":95490},{\"end\":95502,\"start\":95501},{\"end\":95883,\"start\":95882},{\"end\":95885,\"start\":95884},{\"end\":95893,\"start\":95892},{\"end\":95895,\"start\":95894},{\"end\":95908,\"start\":95907},{\"end\":95917,\"start\":95916},{\"end\":95919,\"start\":95918},{\"end\":95932,\"start\":95931},{\"end\":95944,\"start\":95943},{\"end\":95946,\"start\":95945},{\"end\":96309,\"start\":96308},{\"end\":96311,\"start\":96310},{\"end\":96319,\"start\":96318},{\"end\":96321,\"start\":96320},{\"end\":96656,\"start\":96655},{\"end\":96667,\"start\":96666},{\"end\":96678,\"start\":96677},{\"end\":96877,\"start\":96876},{\"end\":96889,\"start\":96888},{\"end\":96898,\"start\":96897},{\"end\":97141,\"start\":97140},{\"end\":97143,\"start\":97142},{\"end\":97157,\"start\":97156},{\"end\":97159,\"start\":97158},{\"end\":97172,\"start\":97171},{\"end\":97174,\"start\":97173},{\"end\":97184,\"start\":97183},{\"end\":97186,\"start\":97185},{\"end\":97555,\"start\":97554},{\"end\":97567,\"start\":97566},{\"end\":97569,\"start\":97568},{\"end\":97582,\"start\":97581},{\"end\":97594,\"start\":97593},{\"end\":97966,\"start\":97965},{\"end\":97975,\"start\":97974},{\"end\":97987,\"start\":97986},{\"end\":97995,\"start\":97994},{\"end\":97997,\"start\":97996},{\"end\":98006,\"start\":98005},{\"end\":98356,\"start\":98355},{\"end\":98370,\"start\":98369},{\"end\":98372,\"start\":98371},{\"end\":98382,\"start\":98381},{\"end\":98393,\"start\":98392},{\"end\":98402,\"start\":98401},{\"end\":98404,\"start\":98403},{\"end\":98417,\"start\":98416},{\"end\":99000,\"start\":98999},{\"end\":99014,\"start\":99013},{\"end\":99016,\"start\":99015},{\"end\":99026,\"start\":99025},{\"end\":99028,\"start\":99027},{\"end\":99037,\"start\":99036},{\"end\":99039,\"start\":99038},{\"end\":99050,\"start\":99049},{\"end\":99061,\"start\":99060},{\"end\":99063,\"start\":99062},{\"end\":99531,\"start\":99530},{\"end\":99539,\"start\":99538},{\"end\":99549,\"start\":99548},{\"end\":99827,\"start\":99826},{\"end\":99835,\"start\":99834},{\"end\":99847,\"start\":99846},{\"end\":99857,\"start\":99856},{\"end\":99859,\"start\":99858},{\"end\":99871,\"start\":99870},{\"end\":99873,\"start\":99872},{\"end\":99881,\"start\":99880},{\"end\":100237,\"start\":100236},{\"end\":100245,\"start\":100244},{\"end\":100247,\"start\":100246},{\"end\":100255,\"start\":100254},{\"end\":100265,\"start\":100264},{\"end\":100275,\"start\":100274},{\"end\":100277,\"start\":100276},{\"end\":100285,\"start\":100284},{\"end\":100606,\"start\":100605},{\"end\":100608,\"start\":100607},{\"end\":100619,\"start\":100618},{\"end\":100630,\"start\":100629},{\"end\":100632,\"start\":100631},{\"end\":100656,\"start\":100655},{\"end\":100668,\"start\":100667},{\"end\":100678,\"start\":100677},{\"end\":101150,\"start\":101149},{\"end\":101158,\"start\":101157},{\"end\":101568,\"start\":101567},{\"end\":101570,\"start\":101569},{\"end\":101582,\"start\":101581},{\"end\":101584,\"start\":101583},{\"end\":101595,\"start\":101594},{\"end\":101597,\"start\":101596},{\"end\":101607,\"start\":101606},{\"end\":101609,\"start\":101608},{\"end\":101976,\"start\":101975},{\"end\":102227,\"start\":102226},{\"end\":102229,\"start\":102228},{\"end\":102239,\"start\":102238},{\"end\":102241,\"start\":102240},{\"end\":102250,\"start\":102249},{\"end\":102263,\"start\":102262},{\"end\":102265,\"start\":102264},{\"end\":102276,\"start\":102275},{\"end\":102278,\"start\":102277},{\"end\":102288,\"start\":102287},{\"end\":102290,\"start\":102289},{\"end\":102771,\"start\":102770},{\"end\":102773,\"start\":102772},{\"end\":102784,\"start\":102783},{\"end\":102798,\"start\":102797},{\"end\":102806,\"start\":102805},{\"end\":102818,\"start\":102817},{\"end\":102820,\"start\":102819},{\"end\":102828,\"start\":102827},{\"end\":102830,\"start\":102829},{\"end\":102841,\"start\":102840},{\"end\":103317,\"start\":103316},{\"end\":103319,\"start\":103318},{\"end\":103329,\"start\":103328},{\"end\":103331,\"start\":103330},{\"end\":103341,\"start\":103340},{\"end\":103343,\"start\":103342},{\"end\":103353,\"start\":103352},{\"end\":103355,\"start\":103354},{\"end\":103364,\"start\":103363},{\"end\":103380,\"start\":103379},{\"end\":103739,\"start\":103738},{\"end\":103743,\"start\":103740},{\"end\":103753,\"start\":103752},{\"end\":103762,\"start\":103761},{\"end\":103764,\"start\":103763},{\"end\":103772,\"start\":103771},{\"end\":104104,\"start\":104100},{\"end\":104106,\"start\":104105},{\"end\":104113,\"start\":104112},{\"end\":104119,\"start\":104118},{\"end\":104121,\"start\":104120},{\"end\":104480,\"start\":104479},{\"end\":104482,\"start\":104481},{\"end\":104489,\"start\":104488},{\"end\":104491,\"start\":104490},{\"end\":104504,\"start\":104503},{\"end\":104506,\"start\":104505},{\"end\":104519,\"start\":104518},{\"end\":104521,\"start\":104520},{\"end\":104532,\"start\":104531},{\"end\":104534,\"start\":104533},{\"end\":104540,\"start\":104539},{\"end\":104987,\"start\":104986},{\"end\":104999,\"start\":104998},{\"end\":105001,\"start\":105000},{\"end\":105013,\"start\":105012},{\"end\":105020,\"start\":105019},{\"end\":105029,\"start\":105028},{\"end\":105410,\"start\":105409},{\"end\":105419,\"start\":105418},{\"end\":105421,\"start\":105420},{\"end\":105434,\"start\":105433},{\"end\":105436,\"start\":105435},{\"end\":105781,\"start\":105780},{\"end\":105792,\"start\":105791},{\"end\":105794,\"start\":105793},{\"end\":105805,\"start\":105804},{\"end\":105814,\"start\":105813},{\"end\":105822,\"start\":105821},{\"end\":105824,\"start\":105823},{\"end\":105839,\"start\":105838},{\"end\":106215,\"start\":106214},{\"end\":106225,\"start\":106224},{\"end\":106232,\"start\":106231},{\"end\":106241,\"start\":106240},{\"end\":106544,\"start\":106543},{\"end\":106552,\"start\":106551},{\"end\":106561,\"start\":106560},{\"end\":106571,\"start\":106570},{\"end\":106581,\"start\":106580},{\"end\":106996,\"start\":106995},{\"end\":107005,\"start\":107004},{\"end\":107007,\"start\":107006},{\"end\":107360,\"start\":107359},{\"end\":107372,\"start\":107371},{\"end\":107383,\"start\":107382},{\"end\":107385,\"start\":107384},{\"end\":107803,\"start\":107802},{\"end\":107815,\"start\":107814},{\"end\":107817,\"start\":107816},{\"end\":107827,\"start\":107826},{\"end\":107837,\"start\":107836},{\"end\":107848,\"start\":107847},{\"end\":107850,\"start\":107849},{\"end\":107858,\"start\":107857},{\"end\":107860,\"start\":107859},{\"end\":107869,\"start\":107868},{\"end\":107871,\"start\":107870},{\"end\":108350,\"start\":108349},{\"end\":108361,\"start\":108360},{\"end\":108368,\"start\":108367},{\"end\":108378,\"start\":108377},{\"end\":108384,\"start\":108383},{\"end\":108391,\"start\":108390},{\"end\":108943,\"start\":108942},{\"end\":108945,\"start\":108944},{\"end\":108953,\"start\":108952},{\"end\":108963,\"start\":108962},{\"end\":108965,\"start\":108964},{\"end\":108975,\"start\":108974},{\"end\":108977,\"start\":108976},{\"end\":108992,\"start\":108987},{\"end\":109000,\"start\":108999},{\"end\":109353,\"start\":109352},{\"end\":109355,\"start\":109354},{\"end\":109364,\"start\":109363},{\"end\":109366,\"start\":109365},{\"end\":109379,\"start\":109378},{\"end\":109383,\"start\":109380},{\"end\":109392,\"start\":109391},{\"end\":109394,\"start\":109393},{\"end\":109406,\"start\":109405},{\"end\":109408,\"start\":109407},{\"end\":109417,\"start\":109416},{\"end\":109419,\"start\":109418},{\"end\":109955,\"start\":109954},{\"end\":109957,\"start\":109956},{\"end\":109963,\"start\":109962},{\"end\":109973,\"start\":109972},{\"end\":110373,\"start\":110372},{\"end\":110375,\"start\":110374},{\"end\":110385,\"start\":110384},{\"end\":110407,\"start\":110406},{\"end\":110409,\"start\":110408},{\"end\":110417,\"start\":110416},{\"end\":110428,\"start\":110427},{\"end\":110822,\"start\":110821},{\"end\":110833,\"start\":110832},{\"end\":110835,\"start\":110834},{\"end\":111082,\"start\":111081},{\"end\":111092,\"start\":111091},{\"end\":111094,\"start\":111093},{\"end\":111103,\"start\":111102},{\"end\":111117,\"start\":111116},{\"end\":111119,\"start\":111118},{\"end\":111130,\"start\":111129},{\"end\":111141,\"start\":111140},{\"end\":111541,\"start\":111540},{\"end\":111856,\"start\":111855},{\"end\":112165,\"start\":112164},{\"end\":112177,\"start\":112176},{\"end\":112188,\"start\":112187},{\"end\":112505,\"start\":112504},{\"end\":112507,\"start\":112506},{\"end\":112520,\"start\":112519},{\"end\":112522,\"start\":112521},{\"end\":112538,\"start\":112537},{\"end\":112548,\"start\":112547},{\"end\":112562,\"start\":112561},{\"end\":112995,\"start\":112994},{\"end\":113008,\"start\":113007},{\"end\":113015,\"start\":113014},{\"end\":113017,\"start\":113016},{\"end\":113030,\"start\":113029},{\"end\":113032,\"start\":113031},{\"end\":113040,\"start\":113039},{\"end\":113042,\"start\":113041},{\"end\":113507,\"start\":113506},{\"end\":113509,\"start\":113508},{\"end\":113521,\"start\":113520},{\"end\":113523,\"start\":113522},{\"end\":113533,\"start\":113532},{\"end\":113535,\"start\":113534},{\"end\":113543,\"start\":113542},{\"end\":113545,\"start\":113544},{\"end\":114009,\"start\":114008},{\"end\":114011,\"start\":114010},{\"end\":114022,\"start\":114021},{\"end\":114024,\"start\":114023},{\"end\":114032,\"start\":114031},{\"end\":114042,\"start\":114041},{\"end\":114044,\"start\":114043},{\"end\":114053,\"start\":114052},{\"end\":114055,\"start\":114054},{\"end\":114069,\"start\":114068},{\"end\":114071,\"start\":114070},{\"end\":114546,\"start\":114545},{\"end\":114548,\"start\":114547},{\"end\":114841,\"start\":114840},{\"end\":114843,\"start\":114842},{\"end\":114855,\"start\":114854},{\"end\":114857,\"start\":114856},{\"end\":115166,\"start\":115165},{\"end\":115412,\"start\":115411},{\"end\":115424,\"start\":115423},{\"end\":115426,\"start\":115425},{\"end\":115434,\"start\":115433},{\"end\":115442,\"start\":115441},{\"end\":115444,\"start\":115443},{\"end\":115453,\"start\":115452},{\"end\":115455,\"start\":115454},{\"end\":115465,\"start\":115464},{\"end\":115467,\"start\":115466},{\"end\":115913,\"start\":115912},{\"end\":115925,\"start\":115924},{\"end\":115927,\"start\":115926},{\"end\":115936,\"start\":115935},{\"end\":115938,\"start\":115937},{\"end\":116305,\"start\":116304},{\"end\":116317,\"start\":116316},{\"end\":116326,\"start\":116325},{\"end\":116328,\"start\":116327},{\"end\":116713,\"start\":116712},{\"end\":116715,\"start\":116714},{\"end\":116724,\"start\":116723},{\"end\":116726,\"start\":116725},{\"end\":116734,\"start\":116733},{\"end\":116736,\"start\":116735},{\"end\":116746,\"start\":116745},{\"end\":117223,\"start\":117222},{\"end\":117225,\"start\":117224},{\"end\":117234,\"start\":117233},{\"end\":117236,\"start\":117235},{\"end\":117246,\"start\":117245},{\"end\":117258,\"start\":117257},{\"end\":117260,\"start\":117259},{\"end\":117270,\"start\":117269},{\"end\":117272,\"start\":117271},{\"end\":117281,\"start\":117280},{\"end\":117283,\"start\":117282},{\"end\":117800,\"start\":117799},{\"end\":117802,\"start\":117801},{\"end\":117813,\"start\":117812},{\"end\":117823,\"start\":117822},{\"end\":117835,\"start\":117834},{\"end\":117837,\"start\":117836},{\"end\":118234,\"start\":118233},{\"end\":118243,\"start\":118242},{\"end\":118255,\"start\":118254},{\"end\":118266,\"start\":118265},{\"end\":118279,\"start\":118278},{\"end\":118287,\"start\":118286},{\"end\":118631,\"start\":118630},{\"end\":118633,\"start\":118632},{\"end\":118642,\"start\":118641},{\"end\":118655,\"start\":118654},{\"end\":118663,\"start\":118662},{\"end\":118675,\"start\":118674},{\"end\":118677,\"start\":118676},{\"end\":118690,\"start\":118689},{\"end\":119050,\"start\":119049},{\"end\":119061,\"start\":119060},{\"end\":119436,\"start\":119435},{\"end\":119719,\"start\":119718},{\"end\":119729,\"start\":119728},{\"end\":119731,\"start\":119730},{\"end\":119742,\"start\":119741},{\"end\":119744,\"start\":119743},{\"end\":119755,\"start\":119754},{\"end\":119765,\"start\":119764},{\"end\":119767,\"start\":119766},{\"end\":119791,\"start\":119790},{\"end\":120235,\"start\":120234},{\"end\":120245,\"start\":120244},{\"end\":120258,\"start\":120257},{\"end\":120260,\"start\":120259},{\"end\":120694,\"start\":120693},{\"end\":120704,\"start\":120703},{\"end\":120716,\"start\":120715},{\"end\":120728,\"start\":120727},{\"end\":120742,\"start\":120741},{\"end\":120753,\"start\":120752},{\"end\":121248,\"start\":121247},{\"end\":121258,\"start\":121257},{\"end\":121260,\"start\":121259},{\"end\":121670,\"start\":121669},{\"end\":121672,\"start\":121671},{\"end\":121686,\"start\":121685},{\"end\":121688,\"start\":121687},{\"end\":121706,\"start\":121705},{\"end\":121708,\"start\":121707},{\"end\":121716,\"start\":121715},{\"end\":121718,\"start\":121717},{\"end\":121731,\"start\":121730},{\"end\":121735,\"start\":121732},{\"end\":121744,\"start\":121743},{\"end\":121746,\"start\":121745},{\"end\":122278,\"start\":122277},{\"end\":122287,\"start\":122286},{\"end\":122289,\"start\":122288},{\"end\":122299,\"start\":122298},{\"end\":122311,\"start\":122310},{\"end\":122749,\"start\":122748},{\"end\":122751,\"start\":122750},{\"end\":122764,\"start\":122763},{\"end\":122766,\"start\":122765},{\"end\":122775,\"start\":122774},{\"end\":122788,\"start\":122787},{\"end\":122800,\"start\":122799},{\"end\":122802,\"start\":122801},{\"end\":122814,\"start\":122813},{\"end\":123278,\"start\":123277},{\"end\":123287,\"start\":123286},{\"end\":123289,\"start\":123288},{\"end\":123301,\"start\":123300},{\"end\":123303,\"start\":123302},{\"end\":123311,\"start\":123310},{\"end\":123322,\"start\":123321},{\"end\":123334,\"start\":123333},{\"end\":123336,\"start\":123335},{\"end\":123741,\"start\":123740},{\"end\":123743,\"start\":123742},{\"end\":124020,\"start\":124019},{\"end\":124022,\"start\":124021},{\"end\":124035,\"start\":124034},{\"end\":124037,\"start\":124036},{\"end\":124437,\"start\":124436},{\"end\":124452,\"start\":124451},{\"end\":124461,\"start\":124460},{\"end\":125010,\"start\":125009},{\"end\":125025,\"start\":125024},{\"end\":125034,\"start\":125033},{\"end\":125643,\"start\":125642},{\"end\":125645,\"start\":125644},{\"end\":125654,\"start\":125653},{\"end\":125656,\"start\":125655},{\"end\":125930,\"start\":125929},{\"end\":125932,\"start\":125931},{\"end\":125943,\"start\":125942},{\"end\":125945,\"start\":125944},{\"end\":125965,\"start\":125964},{\"end\":125973,\"start\":125972},{\"end\":125986,\"start\":125985},{\"end\":126000,\"start\":125999},{\"end\":126384,\"start\":126383},{\"end\":126393,\"start\":126392},{\"end\":126411,\"start\":126410},{\"end\":126424,\"start\":126423},{\"end\":126433,\"start\":126432},{\"end\":126447,\"start\":126446},{\"end\":126809,\"start\":126808},{\"end\":126811,\"start\":126810},{\"end\":126822,\"start\":126821},{\"end\":126835,\"start\":126834},{\"end\":126844,\"start\":126843},{\"end\":126855,\"start\":126854},{\"end\":126864,\"start\":126863},{\"end\":127254,\"start\":127253},{\"end\":127256,\"start\":127255},{\"end\":127267,\"start\":127266},{\"end\":127278,\"start\":127277},{\"end\":127280,\"start\":127279},{\"end\":127659,\"start\":127658},{\"end\":127668,\"start\":127667},{\"end\":127678,\"start\":127677},{\"end\":127680,\"start\":127679},{\"end\":128149,\"start\":128148},{\"end\":128162,\"start\":128161},{\"end\":128174,\"start\":128173},{\"end\":128181,\"start\":128180},{\"end\":128191,\"start\":128190},{\"end\":128202,\"start\":128201},{\"end\":128612,\"start\":128611},{\"end\":128625,\"start\":128624},{\"end\":128627,\"start\":128626},{\"end\":128637,\"start\":128636},{\"end\":128639,\"start\":128638},{\"end\":128889,\"start\":128888},{\"end\":128897,\"start\":128896},{\"end\":128914,\"start\":128913},{\"end\":128916,\"start\":128915},{\"end\":128927,\"start\":128926},{\"end\":128929,\"start\":128928},{\"end\":128941,\"start\":128940},{\"end\":128943,\"start\":128942},{\"end\":128954,\"start\":128953},{\"end\":129327,\"start\":129326},{\"end\":129340,\"start\":129339},{\"end\":129342,\"start\":129341},{\"end\":129617,\"start\":129616},{\"end\":129626,\"start\":129625},{\"end\":129628,\"start\":129627},{\"end\":129984,\"start\":129983},{\"end\":130266,\"start\":130265},{\"end\":130277,\"start\":130276},{\"end\":130279,\"start\":130278},{\"end\":130287,\"start\":130286},{\"end\":130300,\"start\":130299},{\"end\":130302,\"start\":130301},{\"end\":130320,\"start\":130319},{\"end\":130322,\"start\":130321},{\"end\":130671,\"start\":130670},{\"end\":130679,\"start\":130678},{\"end\":130687,\"start\":130686},{\"end\":130695,\"start\":130694},{\"end\":130697,\"start\":130696},{\"end\":130711,\"start\":130710},{\"end\":130713,\"start\":130712},{\"end\":130724,\"start\":130723},{\"end\":130726,\"start\":130725},{\"end\":131100,\"start\":131096},{\"end\":131108,\"start\":131107},{\"end\":131110,\"start\":131109},{\"end\":131353,\"start\":131352},{\"end\":131355,\"start\":131354},{\"end\":131365,\"start\":131364},{\"end\":131367,\"start\":131366},{\"end\":131378,\"start\":131377},{\"end\":131380,\"start\":131379},{\"end\":131388,\"start\":131387},{\"end\":131390,\"start\":131389},{\"end\":131634,\"start\":131633},{\"end\":131648,\"start\":131647},{\"end\":131650,\"start\":131649},{\"end\":131662,\"start\":131661},{\"end\":131664,\"start\":131663},{\"end\":131974,\"start\":131973},{\"end\":132289,\"start\":132288},{\"end\":132300,\"start\":132299},{\"end\":132302,\"start\":132301},{\"end\":132313,\"start\":132312},{\"end\":132315,\"start\":132314},{\"end\":132328,\"start\":132327},{\"end\":132341,\"start\":132340},{\"end\":132343,\"start\":132342},{\"end\":132367,\"start\":132366},{\"end\":132369,\"start\":132368},{\"end\":132779,\"start\":132778},{\"end\":132788,\"start\":132787},{\"end\":132790,\"start\":132789},{\"end\":132802,\"start\":132801},{\"end\":132804,\"start\":132803},{\"end\":132812,\"start\":132811},{\"end\":132814,\"start\":132813},{\"end\":132824,\"start\":132823},{\"end\":132826,\"start\":132825},{\"end\":132839,\"start\":132838},{\"end\":133337,\"start\":133336},{\"end\":133345,\"start\":133344},{\"end\":133353,\"start\":133352},{\"end\":133361,\"start\":133360},{\"end\":133732,\"start\":133731},{\"end\":133740,\"start\":133739},{\"end\":133750,\"start\":133749},{\"end\":133760,\"start\":133759},{\"end\":133775,\"start\":133771}]", "bib_author_last_name": "[{\"end\":93377,\"start\":93371},{\"end\":93390,\"start\":93381},{\"end\":93400,\"start\":93394},{\"end\":93410,\"start\":93404},{\"end\":93423,\"start\":93414},{\"end\":93766,\"start\":93762},{\"end\":93776,\"start\":93770},{\"end\":93798,\"start\":93780},{\"end\":93811,\"start\":93802},{\"end\":93821,\"start\":93815},{\"end\":93832,\"start\":93825},{\"end\":94207,\"start\":94203},{\"end\":94219,\"start\":94213},{\"end\":94229,\"start\":94223},{\"end\":94244,\"start\":94235},{\"end\":94256,\"start\":94250},{\"end\":94265,\"start\":94260},{\"end\":94603,\"start\":94599},{\"end\":94616,\"start\":94609},{\"end\":94628,\"start\":94620},{\"end\":94643,\"start\":94634},{\"end\":94649,\"start\":94647},{\"end\":95141,\"start\":95136},{\"end\":95455,\"start\":95447},{\"end\":95464,\"start\":95459},{\"end\":95476,\"start\":95470},{\"end\":95486,\"start\":95482},{\"end\":95499,\"start\":95492},{\"end\":95513,\"start\":95503},{\"end\":95890,\"start\":95886},{\"end\":95905,\"start\":95896},{\"end\":95914,\"start\":95909},{\"end\":95929,\"start\":95920},{\"end\":95941,\"start\":95933},{\"end\":95951,\"start\":95947},{\"end\":96316,\"start\":96312},{\"end\":96326,\"start\":96322},{\"end\":96664,\"start\":96657},{\"end\":96675,\"start\":96668},{\"end\":96686,\"start\":96679},{\"end\":96886,\"start\":96878},{\"end\":96895,\"start\":96890},{\"end\":96905,\"start\":96899},{\"end\":97150,\"start\":97144},{\"end\":97154,\"start\":97152},{\"end\":97169,\"start\":97160},{\"end\":97181,\"start\":97175},{\"end\":97196,\"start\":97187},{\"end\":97564,\"start\":97556},{\"end\":97579,\"start\":97570},{\"end\":97591,\"start\":97583},{\"end\":97600,\"start\":97595},{\"end\":97972,\"start\":97967},{\"end\":97984,\"start\":97976},{\"end\":97992,\"start\":97988},{\"end\":98003,\"start\":97998},{\"end\":98013,\"start\":98007},{\"end\":98367,\"start\":98357},{\"end\":98379,\"start\":98373},{\"end\":98390,\"start\":98383},{\"end\":98399,\"start\":98394},{\"end\":98414,\"start\":98405},{\"end\":98422,\"start\":98418},{\"end\":99011,\"start\":99001},{\"end\":99023,\"start\":99017},{\"end\":99034,\"start\":99029},{\"end\":99047,\"start\":99040},{\"end\":99058,\"start\":99051},{\"end\":99070,\"start\":99064},{\"end\":99074,\"start\":99072},{\"end\":99536,\"start\":99532},{\"end\":99546,\"start\":99540},{\"end\":99555,\"start\":99550},{\"end\":99832,\"start\":99828},{\"end\":99844,\"start\":99836},{\"end\":99854,\"start\":99848},{\"end\":99868,\"start\":99860},{\"end\":99878,\"start\":99874},{\"end\":99889,\"start\":99882},{\"end\":100242,\"start\":100238},{\"end\":100252,\"start\":100248},{\"end\":100262,\"start\":100256},{\"end\":100272,\"start\":100266},{\"end\":100282,\"start\":100278},{\"end\":100293,\"start\":100286},{\"end\":100616,\"start\":100609},{\"end\":100627,\"start\":100620},{\"end\":100653,\"start\":100633},{\"end\":100665,\"start\":100657},{\"end\":100675,\"start\":100669},{\"end\":100686,\"start\":100679},{\"end\":101155,\"start\":101151},{\"end\":101164,\"start\":101159},{\"end\":101579,\"start\":101571},{\"end\":101592,\"start\":101585},{\"end\":101604,\"start\":101598},{\"end\":101614,\"start\":101610},{\"end\":101984,\"start\":101977},{\"end\":102236,\"start\":102230},{\"end\":102247,\"start\":102242},{\"end\":102260,\"start\":102251},{\"end\":102273,\"start\":102266},{\"end\":102285,\"start\":102279},{\"end\":102299,\"start\":102291},{\"end\":102781,\"start\":102774},{\"end\":102795,\"start\":102785},{\"end\":102803,\"start\":102799},{\"end\":102815,\"start\":102807},{\"end\":102825,\"start\":102821},{\"end\":102838,\"start\":102831},{\"end\":102850,\"start\":102842},{\"end\":103326,\"start\":103320},{\"end\":103338,\"start\":103332},{\"end\":103350,\"start\":103344},{\"end\":103361,\"start\":103356},{\"end\":103377,\"start\":103365},{\"end\":103390,\"start\":103381},{\"end\":103750,\"start\":103744},{\"end\":103759,\"start\":103754},{\"end\":103769,\"start\":103765},{\"end\":103779,\"start\":103773},{\"end\":104110,\"start\":104107},{\"end\":104116,\"start\":104114},{\"end\":104131,\"start\":104122},{\"end\":104486,\"start\":104483},{\"end\":104501,\"start\":104492},{\"end\":104516,\"start\":104507},{\"end\":104529,\"start\":104522},{\"end\":104537,\"start\":104535},{\"end\":104549,\"start\":104541},{\"end\":104996,\"start\":104988},{\"end\":105010,\"start\":105002},{\"end\":105017,\"start\":105014},{\"end\":105026,\"start\":105021},{\"end\":105038,\"start\":105030},{\"end\":105416,\"start\":105411},{\"end\":105431,\"start\":105422},{\"end\":105444,\"start\":105437},{\"end\":105789,\"start\":105782},{\"end\":105802,\"start\":105795},{\"end\":105811,\"start\":105806},{\"end\":105819,\"start\":105815},{\"end\":105836,\"start\":105825},{\"end\":105845,\"start\":105840},{\"end\":106222,\"start\":106216},{\"end\":106229,\"start\":106226},{\"end\":106238,\"start\":106233},{\"end\":106247,\"start\":106242},{\"end\":106549,\"start\":106545},{\"end\":106558,\"start\":106553},{\"end\":106568,\"start\":106562},{\"end\":106578,\"start\":106572},{\"end\":106589,\"start\":106582},{\"end\":107002,\"start\":106997},{\"end\":107015,\"start\":107008},{\"end\":107369,\"start\":107361},{\"end\":107380,\"start\":107373},{\"end\":107392,\"start\":107386},{\"end\":107812,\"start\":107804},{\"end\":107824,\"start\":107818},{\"end\":107834,\"start\":107828},{\"end\":107845,\"start\":107838},{\"end\":107855,\"start\":107851},{\"end\":107866,\"start\":107861},{\"end\":107878,\"start\":107872},{\"end\":108358,\"start\":108351},{\"end\":108365,\"start\":108362},{\"end\":108375,\"start\":108369},{\"end\":108381,\"start\":108379},{\"end\":108388,\"start\":108385},{\"end\":108398,\"start\":108392},{\"end\":108950,\"start\":108946},{\"end\":108960,\"start\":108954},{\"end\":108972,\"start\":108966},{\"end\":108985,\"start\":108978},{\"end\":108997,\"start\":108993},{\"end\":109361,\"start\":109356},{\"end\":109376,\"start\":109367},{\"end\":109389,\"start\":109384},{\"end\":109403,\"start\":109395},{\"end\":109414,\"start\":109409},{\"end\":109425,\"start\":109420},{\"end\":109960,\"start\":109958},{\"end\":109970,\"start\":109964},{\"end\":109978,\"start\":109974},{\"end\":110382,\"start\":110376},{\"end\":110404,\"start\":110386},{\"end\":110414,\"start\":110410},{\"end\":110425,\"start\":110418},{\"end\":110432,\"start\":110429},{\"end\":110830,\"start\":110823},{\"end\":110841,\"start\":110836},{\"end\":111089,\"start\":111083},{\"end\":111100,\"start\":111095},{\"end\":111114,\"start\":111104},{\"end\":111127,\"start\":111120},{\"end\":111138,\"start\":111131},{\"end\":111159,\"start\":111142},{\"end\":111550,\"start\":111542},{\"end\":111865,\"start\":111857},{\"end\":112174,\"start\":112166},{\"end\":112185,\"start\":112178},{\"end\":112195,\"start\":112189},{\"end\":112517,\"start\":112508},{\"end\":112535,\"start\":112523},{\"end\":112545,\"start\":112539},{\"end\":112559,\"start\":112549},{\"end\":112571,\"start\":112563},{\"end\":113005,\"start\":112996},{\"end\":113012,\"start\":113009},{\"end\":113027,\"start\":113018},{\"end\":113037,\"start\":113033},{\"end\":113052,\"start\":113043},{\"end\":113518,\"start\":113510},{\"end\":113530,\"start\":113524},{\"end\":113540,\"start\":113536},{\"end\":113551,\"start\":113546},{\"end\":114019,\"start\":114012},{\"end\":114029,\"start\":114025},{\"end\":114039,\"start\":114033},{\"end\":114050,\"start\":114045},{\"end\":114066,\"start\":114056},{\"end\":114079,\"start\":114072},{\"end\":114557,\"start\":114549},{\"end\":114852,\"start\":114844},{\"end\":114863,\"start\":114858},{\"end\":115172,\"start\":115167},{\"end\":115421,\"start\":115413},{\"end\":115431,\"start\":115427},{\"end\":115439,\"start\":115435},{\"end\":115450,\"start\":115445},{\"end\":115462,\"start\":115456},{\"end\":115472,\"start\":115468},{\"end\":115922,\"start\":115914},{\"end\":115933,\"start\":115928},{\"end\":115943,\"start\":115939},{\"end\":116314,\"start\":116306},{\"end\":116323,\"start\":116318},{\"end\":116333,\"start\":116329},{\"end\":116721,\"start\":116716},{\"end\":116731,\"start\":116727},{\"end\":116743,\"start\":116737},{\"end\":116755,\"start\":116747},{\"end\":117231,\"start\":117226},{\"end\":117243,\"start\":117237},{\"end\":117255,\"start\":117247},{\"end\":117267,\"start\":117261},{\"end\":117278,\"start\":117273},{\"end\":117288,\"start\":117284},{\"end\":117810,\"start\":117803},{\"end\":117820,\"start\":117814},{\"end\":117832,\"start\":117824},{\"end\":117846,\"start\":117838},{\"end\":118240,\"start\":118235},{\"end\":118252,\"start\":118244},{\"end\":118263,\"start\":118256},{\"end\":118276,\"start\":118267},{\"end\":118284,\"start\":118280},{\"end\":118296,\"start\":118288},{\"end\":118639,\"start\":118634},{\"end\":118652,\"start\":118643},{\"end\":118660,\"start\":118656},{\"end\":118672,\"start\":118664},{\"end\":118687,\"start\":118678},{\"end\":118695,\"start\":118691},{\"end\":119058,\"start\":119051},{\"end\":119068,\"start\":119062},{\"end\":119443,\"start\":119437},{\"end\":119726,\"start\":119720},{\"end\":119739,\"start\":119732},{\"end\":119752,\"start\":119745},{\"end\":119762,\"start\":119756},{\"end\":119788,\"start\":119768},{\"end\":119796,\"start\":119792},{\"end\":120242,\"start\":120236},{\"end\":120251,\"start\":120246},{\"end\":120255,\"start\":120253},{\"end\":120264,\"start\":120261},{\"end\":120701,\"start\":120695},{\"end\":120713,\"start\":120705},{\"end\":120725,\"start\":120717},{\"end\":120739,\"start\":120729},{\"end\":120750,\"start\":120743},{\"end\":120759,\"start\":120754},{\"end\":121255,\"start\":121249},{\"end\":121268,\"start\":121261},{\"end\":121683,\"start\":121673},{\"end\":121703,\"start\":121689},{\"end\":121713,\"start\":121709},{\"end\":121728,\"start\":121719},{\"end\":121741,\"start\":121736},{\"end\":121755,\"start\":121747},{\"end\":122284,\"start\":122279},{\"end\":122296,\"start\":122290},{\"end\":122308,\"start\":122300},{\"end\":122317,\"start\":122312},{\"end\":122761,\"start\":122752},{\"end\":122772,\"start\":122767},{\"end\":122785,\"start\":122776},{\"end\":122797,\"start\":122789},{\"end\":122811,\"start\":122803},{\"end\":122823,\"start\":122815},{\"end\":123284,\"start\":123279},{\"end\":123298,\"start\":123290},{\"end\":123308,\"start\":123304},{\"end\":123319,\"start\":123312},{\"end\":123331,\"start\":123323},{\"end\":123351,\"start\":123337},{\"end\":123753,\"start\":123744},{\"end\":124032,\"start\":124023},{\"end\":124044,\"start\":124038},{\"end\":124449,\"start\":124438},{\"end\":124458,\"start\":124453},{\"end\":124469,\"start\":124462},{\"end\":125022,\"start\":125011},{\"end\":125031,\"start\":125026},{\"end\":125042,\"start\":125035},{\"end\":125651,\"start\":125646},{\"end\":125661,\"start\":125657},{\"end\":125940,\"start\":125933},{\"end\":125962,\"start\":125946},{\"end\":125970,\"start\":125966},{\"end\":125983,\"start\":125974},{\"end\":125997,\"start\":125987},{\"end\":126016,\"start\":126001},{\"end\":126390,\"start\":126385},{\"end\":126408,\"start\":126394},{\"end\":126421,\"start\":126412},{\"end\":126430,\"start\":126425},{\"end\":126444,\"start\":126434},{\"end\":126453,\"start\":126448},{\"end\":126819,\"start\":126812},{\"end\":126832,\"start\":126823},{\"end\":126841,\"start\":126836},{\"end\":126852,\"start\":126845},{\"end\":126861,\"start\":126856},{\"end\":126869,\"start\":126865},{\"end\":127264,\"start\":127257},{\"end\":127275,\"start\":127268},{\"end\":127292,\"start\":127281},{\"end\":127665,\"start\":127660},{\"end\":127675,\"start\":127669},{\"end\":127688,\"start\":127681},{\"end\":128159,\"start\":128150},{\"end\":128171,\"start\":128163},{\"end\":128178,\"start\":128175},{\"end\":128188,\"start\":128182},{\"end\":128199,\"start\":128192},{\"end\":128212,\"start\":128203},{\"end\":128622,\"start\":128613},{\"end\":128634,\"start\":128628},{\"end\":128648,\"start\":128640},{\"end\":128894,\"start\":128890},{\"end\":128911,\"start\":128898},{\"end\":128924,\"start\":128917},{\"end\":128938,\"start\":128930},{\"end\":128951,\"start\":128944},{\"end\":128959,\"start\":128955},{\"end\":129337,\"start\":129328},{\"end\":129348,\"start\":129343},{\"end\":129623,\"start\":129618},{\"end\":129637,\"start\":129629},{\"end\":129994,\"start\":129985},{\"end\":130274,\"start\":130267},{\"end\":130284,\"start\":130280},{\"end\":130297,\"start\":130288},{\"end\":130317,\"start\":130303},{\"end\":130329,\"start\":130323},{\"end\":130676,\"start\":130672},{\"end\":130684,\"start\":130680},{\"end\":130692,\"start\":130688},{\"end\":130708,\"start\":130698},{\"end\":130721,\"start\":130714},{\"end\":130731,\"start\":130727},{\"end\":131105,\"start\":131101},{\"end\":131118,\"start\":131111},{\"end\":131122,\"start\":131120},{\"end\":131362,\"start\":131356},{\"end\":131375,\"start\":131368},{\"end\":131385,\"start\":131381},{\"end\":131396,\"start\":131391},{\"end\":131645,\"start\":131635},{\"end\":131659,\"start\":131651},{\"end\":131672,\"start\":131665},{\"end\":131979,\"start\":131975},{\"end\":132297,\"start\":132290},{\"end\":132310,\"start\":132303},{\"end\":132325,\"start\":132316},{\"end\":132338,\"start\":132329},{\"end\":132364,\"start\":132344},{\"end\":132376,\"start\":132370},{\"end\":132785,\"start\":132780},{\"end\":132799,\"start\":132791},{\"end\":132809,\"start\":132805},{\"end\":132821,\"start\":132815},{\"end\":132836,\"start\":132827},{\"end\":132850,\"start\":132840},{\"end\":133342,\"start\":133338},{\"end\":133350,\"start\":133346},{\"end\":133358,\"start\":133354},{\"end\":133373,\"start\":133362},{\"end\":133737,\"start\":133733},{\"end\":133747,\"start\":133741},{\"end\":133757,\"start\":133751},{\"end\":133769,\"start\":133761},{\"end\":133780,\"start\":133776}]", "bib_entry": "[{\"attributes\":{\"doi\":\"10.1016/j.asr.2004.09.014\",\"id\":\"b0\",\"matched_paper_id\":121011304},\"end\":93681,\"start\":93323},{\"attributes\":{\"doi\":\"10.1063/1.4810977\",\"id\":\"b1\",\"matched_paper_id\":123061032},\"end\":94139,\"start\":93683},{\"attributes\":{\"id\":\"b2\",\"matched_paper_id\":120976228},\"end\":94517,\"start\":94141},{\"attributes\":{\"doi\":\"10.1016/j.jastp.2004.03.018\",\"id\":\"b3\",\"matched_paper_id\":123520307},\"end\":95025,\"start\":94519},{\"attributes\":{\"doi\":\"10.1029/2007SW000337\",\"id\":\"b4\",\"matched_paper_id\":118222752},\"end\":95369,\"start\":95027},{\"attributes\":{\"doi\":\"10.1007/s11214-007-9298-8\",\"id\":\"b5\",\"matched_paper_id\":122280908},\"end\":95819,\"start\":95371},{\"attributes\":{\"doi\":\"10.1002/2015SW001232\",\"id\":\"b6\",\"matched_paper_id\":123031189},\"end\":96217,\"start\":95821},{\"attributes\":{\"doi\":\"10.1007/s11433-019-1489-0\",\"id\":\"b7\",\"matched_paper_id\":212836437},\"end\":96628,\"start\":96219},{\"attributes\":{\"doi\":\"10.1038/nature10233\",\"id\":\"b8\",\"matched_paper_id\":205225571},\"end\":96850,\"start\":96630},{\"attributes\":{\"doi\":\"10.1007/s11214-007-9286%2Dz\",\"id\":\"b9\",\"matched_paper_id\":123239123},\"end\":97107,\"start\":96852},{\"attributes\":{\"doi\":\"10.1038/362430a0\",\"id\":\"b10\",\"matched_paper_id\":4244835},\"end\":97400,\"start\":97109},{\"attributes\":{\"doi\":\"10.1029/2009SW000537\",\"id\":\"b11\",\"matched_paper_id\":41282162},\"end\":97918,\"start\":97402},{\"attributes\":{\"doi\":\"10.1051/0004-6361/201833825\",\"id\":\"b12\",\"matched_paper_id\":55476528},\"end\":98272,\"start\":97920},{\"attributes\":{\"doi\":\"10.1117/12.901538\",\"id\":\"b13\",\"matched_paper_id\":119221528},\"end\":98875,\"start\":98274},{\"attributes\":{\"doi\":\"10.1016/j.jastp.2011.01.013\",\"id\":\"b14\",\"matched_paper_id\":121722988},\"end\":99500,\"start\":98877},{\"attributes\":{\"doi\":\"10.1007/s11214-019-0610-1\",\"id\":\"b15\",\"matched_paper_id\":208527737},\"end\":99752,\"start\":99502},{\"attributes\":{\"doi\":\"10.1006/icar.1997.5789\",\"id\":\"b16\",\"matched_paper_id\":21019118},\"end\":100150,\"start\":99754},{\"attributes\":{\"doi\":\"10.1038/362428a0\",\"id\":\"b17\",\"matched_paper_id\":4315361},\"end\":100548,\"start\":100152},{\"attributes\":{\"doi\":\"10.1007/s11214-012-9913-1\",\"id\":\"b18\",\"matched_paper_id\":123101332},\"end\":100984,\"start\":100550},{\"attributes\":{\"doi\":\"10.1088/0004-637X/792/1/49\",\"id\":\"b19\",\"matched_paper_id\":123186876},\"end\":101499,\"start\":100986},{\"attributes\":{\"doi\":\"10.1007/s11207-015-0666-3\",\"id\":\"b20\",\"matched_paper_id\":119147096},\"end\":101867,\"start\":101501},{\"attributes\":{\"id\":\"b21\"},\"end\":102154,\"start\":101869},{\"attributes\":{\"doi\":\"10.1007/s11214-008-9341-4\",\"id\":\"b22\",\"matched_paper_id\":56247282},\"end\":102606,\"start\":102156},{\"attributes\":{\"doi\":\"10.3389/fspas.2020.568429\",\"id\":\"b23\",\"matched_paper_id\":227154972},\"end\":103277,\"start\":102608},{\"attributes\":{\"doi\":\"10.1007/s11214-007-9277-0\",\"id\":\"b24\",\"matched_paper_id\":96476140},\"end\":103656,\"start\":103279},{\"attributes\":{\"doi\":\"10.1029/2018SW001944\",\"id\":\"b25\",\"matched_paper_id\":127136954},\"end\":104027,\"start\":103658},{\"attributes\":{\"doi\":\"10.2514/6.2005-6653\",\"id\":\"b26\",\"matched_paper_id\":58944864},\"end\":104361,\"start\":104029},{\"attributes\":{\"doi\":\"10.1002/2013JA019755\",\"id\":\"b27\",\"matched_paper_id\":122819165},\"end\":104938,\"start\":104363},{\"attributes\":{\"doi\":\"10.1109/AERO.2013.6496957\",\"id\":\"b28\",\"matched_paper_id\":28216459},\"end\":105294,\"start\":104940},{\"attributes\":{\"doi\":\"10.1117/12.2296100\",\"id\":\"b29\",\"matched_paper_id\":134935417},\"end\":105724,\"start\":105296},{\"attributes\":{\"doi\":\"10.1051/0004-6361/201937362\",\"id\":\"b30\",\"matched_paper_id\":209903143},\"end\":106143,\"start\":105726},{\"attributes\":{\"doi\":\"10.1126/science.aaz2511\",\"id\":\"b31\",\"matched_paper_id\":220872237},\"end\":106477,\"start\":106145},{\"attributes\":{\"doi\":\"10.1007/s11214-015-0219%2Dy\",\"id\":\"b32\",\"matched_paper_id\":118667531},\"end\":106851,\"start\":106479},{\"attributes\":{\"doi\":\"10.1029/TE047i004p00331\",\"id\":\"b33\"},\"end\":107271,\"start\":106853},{\"attributes\":{\"doi\":\"10.3847/1538-4357/aab712\",\"id\":\"b34\",\"matched_paper_id\":125281538},\"end\":107660,\"start\":107273},{\"attributes\":{\"doi\":\"10.1029/2007SW000379\",\"id\":\"b35\",\"matched_paper_id\":28104005},\"end\":108224,\"start\":107662},{\"attributes\":{\"doi\":\"10.1016/j.jastp.2016.06.004\",\"id\":\"b36\",\"matched_paper_id\":26284655},\"end\":108797,\"start\":108226},{\"attributes\":{\"doi\":\"10.1007/s11207-009-9440-8\",\"id\":\"b37\",\"matched_paper_id\":120266458},\"end\":109348,\"start\":108799},{\"attributes\":{\"id\":\"b38\"},\"end\":109579,\"start\":109350},{\"attributes\":{\"doi\":\"10.3847/1538-4365/ab5712\",\"id\":\"b39\"},\"end\":109882,\"start\":109581},{\"attributes\":{\"doi\":\"10.3847/0004-6256/151/5/128\",\"id\":\"b40\",\"matched_paper_id\":123384646},\"end\":110229,\"start\":109884},{\"attributes\":{\"doi\":\"10.1007/s11207-014-0542-6\",\"id\":\"b41\",\"matched_paper_id\":122628827},\"end\":110776,\"start\":110231},{\"attributes\":{\"doi\":\"10.1126/science.287.5459.1799\",\"id\":\"b42\",\"matched_paper_id\":21446120},\"end\":111034,\"start\":110778},{\"attributes\":{\"doi\":\"10.1051/0004-6361/202038467\",\"id\":\"b43\"},\"end\":111453,\"start\":111036},{\"attributes\":{\"doi\":\"10.1029/2009SW000463\",\"id\":\"b44\",\"matched_paper_id\":117441486},\"end\":111757,\"start\":111455},{\"attributes\":{\"doi\":\"10.1029/2009SW000489\",\"id\":\"b45\",\"matched_paper_id\":119899827},\"end\":112083,\"start\":111759},{\"attributes\":{\"doi\":\"10.1029/2011SW000665\",\"id\":\"b46\",\"matched_paper_id\":120816134},\"end\":112422,\"start\":112085},{\"attributes\":{\"doi\":\"10.1002/2015JA021352\",\"id\":\"b47\",\"matched_paper_id\":120151665},\"end\":112911,\"start\":112424},{\"attributes\":{\"doi\":\"10.1088/1742-6596/642/1/012016\",\"id\":\"b48\",\"matched_paper_id\":125482184},\"end\":113392,\"start\":112913},{\"attributes\":{\"doi\":\"10.1029/2007JA012330\",\"id\":\"b49\"},\"end\":113871,\"start\":113394},{\"attributes\":{\"doi\":\"10.1007/s11207-006-0170%2Dx\",\"id\":\"b50\",\"matched_paper_id\":55481957},\"end\":114437,\"start\":113873},{\"attributes\":{\"doi\":\"10.1029/2012SW000853\",\"id\":\"b51\"},\"end\":114758,\"start\":114439},{\"attributes\":{\"doi\":\"10.1029/2010SW000598\",\"id\":\"b52\",\"matched_paper_id\":13546572},\"end\":115093,\"start\":114760},{\"attributes\":{\"doi\":\"10.1029/2010SW000640\",\"id\":\"b53\"},\"end\":115330,\"start\":115095},{\"attributes\":{\"doi\":\"10.3847/1538-4365/ab77cb\",\"id\":\"b54\",\"matched_paper_id\":216307921},\"end\":115807,\"start\":115332},{\"attributes\":{\"doi\":\"10.1029/2004JA010745\",\"id\":\"b55\",\"matched_paper_id\":123268285},\"end\":116236,\"start\":115809},{\"attributes\":{\"doi\":\"10.1029/2003JA010135\",\"id\":\"b56\",\"matched_paper_id\":123631779},\"end\":116586,\"start\":116238},{\"attributes\":{\"doi\":\"10.1029/2005JA011343\",\"id\":\"b57\",\"matched_paper_id\":12206893},\"end\":117087,\"start\":116588},{\"attributes\":{\"doi\":\"10.1029/2007SW000380\",\"id\":\"b58\",\"matched_paper_id\":28653009},\"end\":117622,\"start\":117089},{\"attributes\":{\"doi\":\"10.1029/2020SW002448\",\"id\":\"b59\"},\"end\":118169,\"start\":117624},{\"attributes\":{\"doi\":\"10.1029/2011SW000663\",\"id\":\"b60\",\"matched_paper_id\":120992652},\"end\":118546,\"start\":118171},{\"attributes\":{\"doi\":\"10.1002/2015SW001221\",\"id\":\"b61\",\"matched_paper_id\":120988308},\"end\":118984,\"start\":118548},{\"attributes\":{\"doi\":\"10.1051/swsc/2018020\",\"id\":\"b62\",\"matched_paper_id\":126095092},\"end\":119326,\"start\":118986},{\"attributes\":{\"doi\":\"10.1029/2006SW000268\",\"id\":\"b63\",\"matched_paper_id\":11226985},\"end\":119669,\"start\":119328},{\"attributes\":{\"doi\":\"10.1016/j.asr.2004.11.040\",\"id\":\"b64\",\"matched_paper_id\":7934713},\"end\":120094,\"start\":119671},{\"attributes\":{\"doi\":\"10.1002/2013SW001007\",\"id\":\"b65\",\"matched_paper_id\":13985062},\"end\":120557,\"start\":120096},{\"attributes\":{\"doi\":\"10.1016/j.pss.2013.09.013\",\"id\":\"b66\",\"matched_paper_id\":54832271},\"end\":121129,\"start\":120559},{\"attributes\":{\"doi\":\"10.1029/2019SW002354\",\"id\":\"b67\"},\"end\":121500,\"start\":121131},{\"attributes\":{\"doi\":\"10.1007/s11207-014-0524-8\",\"id\":\"b68\",\"matched_paper_id\":121648633},\"end\":122161,\"start\":121502},{\"attributes\":{\"doi\":\"10.1016/j.jastp.2011.12.013\",\"id\":\"b69\",\"matched_paper_id\":120170017},\"end\":122684,\"start\":122163},{\"attributes\":{\"doi\":\"10.1051/0004-6361/201935305\",\"id\":\"b70\",\"matched_paper_id\":203096605},\"end\":123132,\"start\":122686},{\"attributes\":{\"doi\":\"10.1007/s11207-011-9842-2\",\"id\":\"b71\"},\"end\":123686,\"start\":123134},{\"attributes\":{\"doi\":\"10.1016/j.asr.2008.11.004\",\"id\":\"b72\",\"matched_paper_id\":18616476},\"end\":123970,\"start\":123688},{\"attributes\":{\"doi\":\"10.1023/A%3A1022908504100\",\"id\":\"b73\",\"matched_paper_id\":119750536},\"end\":124247,\"start\":123972},{\"attributes\":{\"doi\":\"10.1093/mnras/sty2049\",\"id\":\"b74\",\"matched_paper_id\":125609141},\"end\":124888,\"start\":124249},{\"attributes\":{\"doi\":\"10.1093/mnras/sty263\",\"id\":\"b75\",\"matched_paper_id\":126286187},\"end\":125571,\"start\":124890},{\"attributes\":{\"id\":\"b76\",\"matched_paper_id\":118281382},\"end\":125868,\"start\":125573},{\"attributes\":{\"doi\":\"10.1051/0004-6361/201935325\",\"id\":\"b77\",\"matched_paper_id\":85530123},\"end\":126336,\"start\":125870},{\"attributes\":{\"doi\":\"10.1051/swsc/2020059\",\"id\":\"b78\",\"matched_paper_id\":225120204},\"end\":126753,\"start\":126338},{\"attributes\":{\"doi\":\"10.1051/0004-6361/201117119\",\"id\":\"b79\",\"matched_paper_id\":56369582},\"end\":127151,\"start\":126755},{\"attributes\":{\"doi\":\"10.3847/1538-4357/aa5df5\",\"id\":\"b80\",\"matched_paper_id\":59495563},\"end\":127579,\"start\":127153},{\"attributes\":{\"doi\":\"10.1088/0004-637X/812/2/140\",\"id\":\"b81\",\"matched_paper_id\":119282907},\"end\":128051,\"start\":127581},{\"attributes\":{\"doi\":\"10.1051/swsc/2015003\",\"id\":\"b82\",\"matched_paper_id\":53994656},\"end\":128554,\"start\":128053},{\"attributes\":{\"doi\":\"10.1007/BF00157268\",\"id\":\"b83\"},\"end\":128829,\"start\":128556},{\"attributes\":{\"doi\":\"10.1016/j.jcp.2011.02.006\",\"id\":\"b84\",\"matched_paper_id\":34755409},\"end\":129272,\"start\":128831},{\"attributes\":{\"doi\":\"10.1029/eo060i041p00701\",\"id\":\"b85\",\"matched_paper_id\":129497112},\"end\":129534,\"start\":129274},{\"attributes\":{\"doi\":\"10.1088/0004-637X/780/1/5\",\"id\":\"b86\",\"matched_paper_id\":15610490},\"end\":129887,\"start\":129536},{\"attributes\":{\"doi\":\"10.1002/2015SW001173\",\"id\":\"b87\",\"matched_paper_id\":118843274},\"end\":130213,\"start\":129889},{\"attributes\":{\"doi\":\"10.1007/s11207-019-1402-1\",\"id\":\"b88\",\"matched_paper_id\":88516694},\"end\":130583,\"start\":130215},{\"attributes\":{\"doi\":\"10.3847/1538-4357/ab89ac\",\"id\":\"b89\",\"matched_paper_id\":208527738},\"end\":131047,\"start\":130585},{\"attributes\":{\"doi\":\"10.1086/171430\",\"id\":\"b90\",\"matched_paper_id\":121299403},\"end\":131329,\"start\":131049},{\"attributes\":{\"id\":\"b91\",\"matched_paper_id\":118848329},\"end\":131587,\"start\":131331},{\"attributes\":{\"doi\":\"10.1007/s00159-014-0078-7\",\"id\":\"b92\",\"matched_paper_id\":118961589},\"end\":131922,\"start\":131589},{\"attributes\":{\"id\":\"b93\"},\"end\":132214,\"start\":131924},{\"attributes\":{\"doi\":\"10.1126/science.1235989\",\"id\":\"b94\"},\"end\":132680,\"start\":132216},{\"attributes\":{\"doi\":\"10.3847/1538-4365/ab3a4c\",\"id\":\"b95\",\"matched_paper_id\":189998360},\"end\":133222,\"start\":132682},{\"attributes\":{\"doi\":\"10.3847/1538-4357/ab5951\",\"id\":\"b96\",\"matched_paper_id\":209376246},\"end\":133681,\"start\":133224},{\"attributes\":{\"doi\":\"10.1051/0004-6361/202039617\",\"id\":\"b97\",\"matched_paper_id\":228063843},\"end\":134041,\"start\":133683}]", "bib_title": "[{\"end\":93367,\"start\":93323},{\"end\":93756,\"start\":93683},{\"end\":94197,\"start\":94141},{\"end\":94593,\"start\":94519},{\"end\":95130,\"start\":95027},{\"end\":95441,\"start\":95371},{\"end\":95880,\"start\":95821},{\"end\":96306,\"start\":96219},{\"end\":96653,\"start\":96630},{\"end\":96874,\"start\":96852},{\"end\":97138,\"start\":97109},{\"end\":97552,\"start\":97402},{\"end\":97963,\"start\":97920},{\"end\":98353,\"start\":98274},{\"end\":98997,\"start\":98877},{\"end\":99528,\"start\":99502},{\"end\":99824,\"start\":99754},{\"end\":100234,\"start\":100152},{\"end\":100603,\"start\":100550},{\"end\":101147,\"start\":100986},{\"end\":101565,\"start\":101501},{\"end\":102224,\"start\":102156},{\"end\":102768,\"start\":102608},{\"end\":103314,\"start\":103279},{\"end\":103736,\"start\":103658},{\"end\":104098,\"start\":104029},{\"end\":104477,\"start\":104363},{\"end\":104984,\"start\":104940},{\"end\":105407,\"start\":105296},{\"end\":105778,\"start\":105726},{\"end\":106212,\"start\":106145},{\"end\":106541,\"start\":106479},{\"end\":107357,\"start\":107273},{\"end\":107800,\"start\":107662},{\"end\":108347,\"start\":108226},{\"end\":108940,\"start\":108799},{\"end\":109645,\"start\":109581},{\"end\":109952,\"start\":109884},{\"end\":110370,\"start\":110231},{\"end\":110819,\"start\":110778},{\"end\":111079,\"start\":111036},{\"end\":111538,\"start\":111455},{\"end\":111853,\"start\":111759},{\"end\":112162,\"start\":112085},{\"end\":112502,\"start\":112424},{\"end\":112992,\"start\":112913},{\"end\":113504,\"start\":113394},{\"end\":114006,\"start\":113873},{\"end\":114838,\"start\":114760},{\"end\":115409,\"start\":115332},{\"end\":115910,\"start\":115809},{\"end\":116302,\"start\":116238},{\"end\":116710,\"start\":116588},{\"end\":117220,\"start\":117089},{\"end\":118231,\"start\":118171},{\"end\":118628,\"start\":118548},{\"end\":119047,\"start\":118986},{\"end\":119433,\"start\":119328},{\"end\":119716,\"start\":119671},{\"end\":120232,\"start\":120096},{\"end\":120691,\"start\":120559},{\"end\":121667,\"start\":121502},{\"end\":122275,\"start\":122163},{\"end\":122746,\"start\":122686},{\"end\":123738,\"start\":123688},{\"end\":124017,\"start\":123972},{\"end\":124434,\"start\":124249},{\"end\":125007,\"start\":124890},{\"end\":125640,\"start\":125573},{\"end\":125927,\"start\":125870},{\"end\":126381,\"start\":126338},{\"end\":126806,\"start\":126755},{\"end\":127251,\"start\":127153},{\"end\":127656,\"start\":127581},{\"end\":128146,\"start\":128053},{\"end\":128886,\"start\":128831},{\"end\":129324,\"start\":129274},{\"end\":129614,\"start\":129536},{\"end\":129981,\"start\":129889},{\"end\":130263,\"start\":130215},{\"end\":130668,\"start\":130585},{\"end\":131094,\"start\":131049},{\"end\":131350,\"start\":131331},{\"end\":131631,\"start\":131589},{\"end\":132286,\"start\":132216},{\"end\":132776,\"start\":132682},{\"end\":133334,\"start\":133224},{\"end\":133729,\"start\":133683}]", "bib_author": "[{\"end\":93379,\"start\":93369},{\"end\":93392,\"start\":93379},{\"end\":93402,\"start\":93392},{\"end\":93412,\"start\":93402},{\"end\":93425,\"start\":93412},{\"end\":93768,\"start\":93758},{\"end\":93778,\"start\":93768},{\"end\":93800,\"start\":93778},{\"end\":93813,\"start\":93800},{\"end\":93823,\"start\":93813},{\"end\":93834,\"start\":93823},{\"end\":94209,\"start\":94199},{\"end\":94221,\"start\":94209},{\"end\":94231,\"start\":94221},{\"end\":94246,\"start\":94231},{\"end\":94258,\"start\":94246},{\"end\":94267,\"start\":94258},{\"end\":94605,\"start\":94595},{\"end\":94618,\"start\":94605},{\"end\":94630,\"start\":94618},{\"end\":94645,\"start\":94630},{\"end\":94651,\"start\":94645},{\"end\":95143,\"start\":95132},{\"end\":95457,\"start\":95443},{\"end\":95466,\"start\":95457},{\"end\":95478,\"start\":95466},{\"end\":95488,\"start\":95478},{\"end\":95501,\"start\":95488},{\"end\":95515,\"start\":95501},{\"end\":95892,\"start\":95882},{\"end\":95907,\"start\":95892},{\"end\":95916,\"start\":95907},{\"end\":95931,\"start\":95916},{\"end\":95943,\"start\":95931},{\"end\":95953,\"start\":95943},{\"end\":96318,\"start\":96308},{\"end\":96328,\"start\":96318},{\"end\":96666,\"start\":96655},{\"end\":96677,\"start\":96666},{\"end\":96688,\"start\":96677},{\"end\":96888,\"start\":96876},{\"end\":96897,\"start\":96888},{\"end\":96907,\"start\":96897},{\"end\":97152,\"start\":97140},{\"end\":97156,\"start\":97152},{\"end\":97171,\"start\":97156},{\"end\":97183,\"start\":97171},{\"end\":97198,\"start\":97183},{\"end\":97566,\"start\":97554},{\"end\":97581,\"start\":97566},{\"end\":97593,\"start\":97581},{\"end\":97602,\"start\":97593},{\"end\":97974,\"start\":97965},{\"end\":97986,\"start\":97974},{\"end\":97994,\"start\":97986},{\"end\":98005,\"start\":97994},{\"end\":98015,\"start\":98005},{\"end\":98369,\"start\":98355},{\"end\":98381,\"start\":98369},{\"end\":98392,\"start\":98381},{\"end\":98401,\"start\":98392},{\"end\":98416,\"start\":98401},{\"end\":98424,\"start\":98416},{\"end\":99013,\"start\":98999},{\"end\":99025,\"start\":99013},{\"end\":99036,\"start\":99025},{\"end\":99049,\"start\":99036},{\"end\":99060,\"start\":99049},{\"end\":99072,\"start\":99060},{\"end\":99076,\"start\":99072},{\"end\":99538,\"start\":99530},{\"end\":99548,\"start\":99538},{\"end\":99557,\"start\":99548},{\"end\":99834,\"start\":99826},{\"end\":99846,\"start\":99834},{\"end\":99856,\"start\":99846},{\"end\":99870,\"start\":99856},{\"end\":99880,\"start\":99870},{\"end\":99891,\"start\":99880},{\"end\":100244,\"start\":100236},{\"end\":100254,\"start\":100244},{\"end\":100264,\"start\":100254},{\"end\":100274,\"start\":100264},{\"end\":100284,\"start\":100274},{\"end\":100295,\"start\":100284},{\"end\":100618,\"start\":100605},{\"end\":100629,\"start\":100618},{\"end\":100655,\"start\":100629},{\"end\":100667,\"start\":100655},{\"end\":100677,\"start\":100667},{\"end\":100688,\"start\":100677},{\"end\":101157,\"start\":101149},{\"end\":101166,\"start\":101157},{\"end\":101581,\"start\":101567},{\"end\":101594,\"start\":101581},{\"end\":101606,\"start\":101594},{\"end\":101616,\"start\":101606},{\"end\":101986,\"start\":101975},{\"end\":102238,\"start\":102226},{\"end\":102249,\"start\":102238},{\"end\":102262,\"start\":102249},{\"end\":102275,\"start\":102262},{\"end\":102287,\"start\":102275},{\"end\":102301,\"start\":102287},{\"end\":102783,\"start\":102770},{\"end\":102797,\"start\":102783},{\"end\":102805,\"start\":102797},{\"end\":102817,\"start\":102805},{\"end\":102827,\"start\":102817},{\"end\":102840,\"start\":102827},{\"end\":102852,\"start\":102840},{\"end\":103328,\"start\":103316},{\"end\":103340,\"start\":103328},{\"end\":103352,\"start\":103340},{\"end\":103363,\"start\":103352},{\"end\":103379,\"start\":103363},{\"end\":103392,\"start\":103379},{\"end\":103752,\"start\":103738},{\"end\":103761,\"start\":103752},{\"end\":103771,\"start\":103761},{\"end\":103781,\"start\":103771},{\"end\":104112,\"start\":104100},{\"end\":104118,\"start\":104112},{\"end\":104133,\"start\":104118},{\"end\":104488,\"start\":104479},{\"end\":104503,\"start\":104488},{\"end\":104518,\"start\":104503},{\"end\":104531,\"start\":104518},{\"end\":104539,\"start\":104531},{\"end\":104551,\"start\":104539},{\"end\":104998,\"start\":104986},{\"end\":105012,\"start\":104998},{\"end\":105019,\"start\":105012},{\"end\":105028,\"start\":105019},{\"end\":105040,\"start\":105028},{\"end\":105418,\"start\":105409},{\"end\":105433,\"start\":105418},{\"end\":105446,\"start\":105433},{\"end\":105791,\"start\":105780},{\"end\":105804,\"start\":105791},{\"end\":105813,\"start\":105804},{\"end\":105821,\"start\":105813},{\"end\":105838,\"start\":105821},{\"end\":105847,\"start\":105838},{\"end\":106224,\"start\":106214},{\"end\":106231,\"start\":106224},{\"end\":106240,\"start\":106231},{\"end\":106249,\"start\":106240},{\"end\":106551,\"start\":106543},{\"end\":106560,\"start\":106551},{\"end\":106570,\"start\":106560},{\"end\":106580,\"start\":106570},{\"end\":106591,\"start\":106580},{\"end\":107004,\"start\":106995},{\"end\":107017,\"start\":107004},{\"end\":107371,\"start\":107359},{\"end\":107382,\"start\":107371},{\"end\":107394,\"start\":107382},{\"end\":107814,\"start\":107802},{\"end\":107826,\"start\":107814},{\"end\":107836,\"start\":107826},{\"end\":107847,\"start\":107836},{\"end\":107857,\"start\":107847},{\"end\":107868,\"start\":107857},{\"end\":107880,\"start\":107868},{\"end\":108360,\"start\":108349},{\"end\":108367,\"start\":108360},{\"end\":108377,\"start\":108367},{\"end\":108383,\"start\":108377},{\"end\":108390,\"start\":108383},{\"end\":108400,\"start\":108390},{\"end\":108952,\"start\":108942},{\"end\":108962,\"start\":108952},{\"end\":108974,\"start\":108962},{\"end\":108987,\"start\":108974},{\"end\":108999,\"start\":108987},{\"end\":109003,\"start\":108999},{\"end\":109363,\"start\":109352},{\"end\":109378,\"start\":109363},{\"end\":109391,\"start\":109378},{\"end\":109405,\"start\":109391},{\"end\":109416,\"start\":109405},{\"end\":109427,\"start\":109416},{\"end\":109962,\"start\":109954},{\"end\":109972,\"start\":109962},{\"end\":109980,\"start\":109972},{\"end\":110384,\"start\":110372},{\"end\":110406,\"start\":110384},{\"end\":110416,\"start\":110406},{\"end\":110427,\"start\":110416},{\"end\":110434,\"start\":110427},{\"end\":110832,\"start\":110821},{\"end\":110843,\"start\":110832},{\"end\":111091,\"start\":111081},{\"end\":111102,\"start\":111091},{\"end\":111116,\"start\":111102},{\"end\":111129,\"start\":111116},{\"end\":111140,\"start\":111129},{\"end\":111161,\"start\":111140},{\"end\":111552,\"start\":111540},{\"end\":111867,\"start\":111855},{\"end\":112176,\"start\":112164},{\"end\":112187,\"start\":112176},{\"end\":112197,\"start\":112187},{\"end\":112519,\"start\":112504},{\"end\":112537,\"start\":112519},{\"end\":112547,\"start\":112537},{\"end\":112561,\"start\":112547},{\"end\":112573,\"start\":112561},{\"end\":113007,\"start\":112994},{\"end\":113014,\"start\":113007},{\"end\":113029,\"start\":113014},{\"end\":113039,\"start\":113029},{\"end\":113054,\"start\":113039},{\"end\":113520,\"start\":113506},{\"end\":113532,\"start\":113520},{\"end\":113542,\"start\":113532},{\"end\":113553,\"start\":113542},{\"end\":114021,\"start\":114008},{\"end\":114031,\"start\":114021},{\"end\":114041,\"start\":114031},{\"end\":114052,\"start\":114041},{\"end\":114068,\"start\":114052},{\"end\":114081,\"start\":114068},{\"end\":114559,\"start\":114545},{\"end\":114854,\"start\":114840},{\"end\":114865,\"start\":114854},{\"end\":115174,\"start\":115165},{\"end\":115423,\"start\":115411},{\"end\":115433,\"start\":115423},{\"end\":115441,\"start\":115433},{\"end\":115452,\"start\":115441},{\"end\":115464,\"start\":115452},{\"end\":115474,\"start\":115464},{\"end\":115924,\"start\":115912},{\"end\":115935,\"start\":115924},{\"end\":115945,\"start\":115935},{\"end\":116316,\"start\":116304},{\"end\":116325,\"start\":116316},{\"end\":116335,\"start\":116325},{\"end\":116723,\"start\":116712},{\"end\":116733,\"start\":116723},{\"end\":116745,\"start\":116733},{\"end\":116757,\"start\":116745},{\"end\":117233,\"start\":117222},{\"end\":117245,\"start\":117233},{\"end\":117257,\"start\":117245},{\"end\":117269,\"start\":117257},{\"end\":117280,\"start\":117269},{\"end\":117290,\"start\":117280},{\"end\":117812,\"start\":117799},{\"end\":117822,\"start\":117812},{\"end\":117834,\"start\":117822},{\"end\":117848,\"start\":117834},{\"end\":118242,\"start\":118233},{\"end\":118254,\"start\":118242},{\"end\":118265,\"start\":118254},{\"end\":118278,\"start\":118265},{\"end\":118286,\"start\":118278},{\"end\":118298,\"start\":118286},{\"end\":118641,\"start\":118630},{\"end\":118654,\"start\":118641},{\"end\":118662,\"start\":118654},{\"end\":118674,\"start\":118662},{\"end\":118689,\"start\":118674},{\"end\":118697,\"start\":118689},{\"end\":119060,\"start\":119049},{\"end\":119070,\"start\":119060},{\"end\":119445,\"start\":119435},{\"end\":119728,\"start\":119718},{\"end\":119741,\"start\":119728},{\"end\":119754,\"start\":119741},{\"end\":119764,\"start\":119754},{\"end\":119790,\"start\":119764},{\"end\":119798,\"start\":119790},{\"end\":120244,\"start\":120234},{\"end\":120253,\"start\":120244},{\"end\":120257,\"start\":120253},{\"end\":120266,\"start\":120257},{\"end\":120703,\"start\":120693},{\"end\":120715,\"start\":120703},{\"end\":120727,\"start\":120715},{\"end\":120741,\"start\":120727},{\"end\":120752,\"start\":120741},{\"end\":120761,\"start\":120752},{\"end\":121257,\"start\":121247},{\"end\":121270,\"start\":121257},{\"end\":121685,\"start\":121669},{\"end\":121705,\"start\":121685},{\"end\":121715,\"start\":121705},{\"end\":121730,\"start\":121715},{\"end\":121743,\"start\":121730},{\"end\":121757,\"start\":121743},{\"end\":122286,\"start\":122277},{\"end\":122298,\"start\":122286},{\"end\":122310,\"start\":122298},{\"end\":122319,\"start\":122310},{\"end\":122763,\"start\":122748},{\"end\":122774,\"start\":122763},{\"end\":122787,\"start\":122774},{\"end\":122799,\"start\":122787},{\"end\":122813,\"start\":122799},{\"end\":122825,\"start\":122813},{\"end\":123286,\"start\":123277},{\"end\":123300,\"start\":123286},{\"end\":123310,\"start\":123300},{\"end\":123321,\"start\":123310},{\"end\":123333,\"start\":123321},{\"end\":123353,\"start\":123333},{\"end\":123755,\"start\":123740},{\"end\":124034,\"start\":124019},{\"end\":124046,\"start\":124034},{\"end\":124451,\"start\":124436},{\"end\":124460,\"start\":124451},{\"end\":124471,\"start\":124460},{\"end\":125024,\"start\":125009},{\"end\":125033,\"start\":125024},{\"end\":125044,\"start\":125033},{\"end\":125653,\"start\":125642},{\"end\":125663,\"start\":125653},{\"end\":125942,\"start\":125929},{\"end\":125964,\"start\":125942},{\"end\":125972,\"start\":125964},{\"end\":125985,\"start\":125972},{\"end\":125999,\"start\":125985},{\"end\":126018,\"start\":125999},{\"end\":126392,\"start\":126383},{\"end\":126410,\"start\":126392},{\"end\":126423,\"start\":126410},{\"end\":126432,\"start\":126423},{\"end\":126446,\"start\":126432},{\"end\":126455,\"start\":126446},{\"end\":126821,\"start\":126808},{\"end\":126834,\"start\":126821},{\"end\":126843,\"start\":126834},{\"end\":126854,\"start\":126843},{\"end\":126863,\"start\":126854},{\"end\":126871,\"start\":126863},{\"end\":127266,\"start\":127253},{\"end\":127277,\"start\":127266},{\"end\":127294,\"start\":127277},{\"end\":127667,\"start\":127658},{\"end\":127677,\"start\":127667},{\"end\":127690,\"start\":127677},{\"end\":128161,\"start\":128148},{\"end\":128173,\"start\":128161},{\"end\":128180,\"start\":128173},{\"end\":128190,\"start\":128180},{\"end\":128201,\"start\":128190},{\"end\":128214,\"start\":128201},{\"end\":128624,\"start\":128611},{\"end\":128636,\"start\":128624},{\"end\":128650,\"start\":128636},{\"end\":128896,\"start\":128888},{\"end\":128913,\"start\":128896},{\"end\":128926,\"start\":128913},{\"end\":128940,\"start\":128926},{\"end\":128953,\"start\":128940},{\"end\":128961,\"start\":128953},{\"end\":129339,\"start\":129326},{\"end\":129350,\"start\":129339},{\"end\":129625,\"start\":129616},{\"end\":129639,\"start\":129625},{\"end\":129996,\"start\":129983},{\"end\":130276,\"start\":130265},{\"end\":130286,\"start\":130276},{\"end\":130299,\"start\":130286},{\"end\":130319,\"start\":130299},{\"end\":130331,\"start\":130319},{\"end\":130678,\"start\":130670},{\"end\":130686,\"start\":130678},{\"end\":130694,\"start\":130686},{\"end\":130710,\"start\":130694},{\"end\":130723,\"start\":130710},{\"end\":130733,\"start\":130723},{\"end\":131107,\"start\":131096},{\"end\":131120,\"start\":131107},{\"end\":131124,\"start\":131120},{\"end\":131364,\"start\":131352},{\"end\":131377,\"start\":131364},{\"end\":131387,\"start\":131377},{\"end\":131398,\"start\":131387},{\"end\":131647,\"start\":131633},{\"end\":131661,\"start\":131647},{\"end\":131674,\"start\":131661},{\"end\":131981,\"start\":131973},{\"end\":132299,\"start\":132288},{\"end\":132312,\"start\":132299},{\"end\":132327,\"start\":132312},{\"end\":132340,\"start\":132327},{\"end\":132366,\"start\":132340},{\"end\":132378,\"start\":132366},{\"end\":132787,\"start\":132778},{\"end\":132801,\"start\":132787},{\"end\":132811,\"start\":132801},{\"end\":132823,\"start\":132811},{\"end\":132838,\"start\":132823},{\"end\":132852,\"start\":132838},{\"end\":133344,\"start\":133336},{\"end\":133352,\"start\":133344},{\"end\":133360,\"start\":133352},{\"end\":133375,\"start\":133360},{\"end\":133739,\"start\":133731},{\"end\":133749,\"start\":133739},{\"end\":133759,\"start\":133749},{\"end\":133771,\"start\":133759},{\"end\":133782,\"start\":133771}]", "bib_venue": "[{\"end\":98576,\"start\":98516},{\"end\":93476,\"start\":93450},{\"end\":93864,\"start\":93851},{\"end\":94303,\"start\":94267},{\"end\":94735,\"start\":94678},{\"end\":95176,\"start\":95163},{\"end\":95561,\"start\":95540},{\"end\":95986,\"start\":95973},{\"end\":96397,\"start\":96353},{\"end\":96713,\"start\":96707},{\"end\":96955,\"start\":96934},{\"end\":97220,\"start\":97214},{\"end\":97635,\"start\":97622},{\"end\":98068,\"start\":98042},{\"end\":98514,\"start\":98441},{\"end\":99155,\"start\":99103},{\"end\":99603,\"start\":99582},{\"end\":99919,\"start\":99913},{\"end\":100317,\"start\":100311},{\"end\":100734,\"start\":100713},{\"end\":101217,\"start\":101192},{\"end\":101654,\"start\":101641},{\"end\":101973,\"start\":101869},{\"end\":102347,\"start\":102326},{\"end\":102918,\"start\":102877},{\"end\":103438,\"start\":103417},{\"end\":103814,\"start\":103801},{\"end\":104171,\"start\":104152},{\"end\":104617,\"start\":104571},{\"end\":105090,\"start\":105065},{\"end\":105483,\"start\":105464},{\"end\":105900,\"start\":105874},{\"end\":106279,\"start\":106272},{\"end\":106639,\"start\":106618},{\"end\":106993,\"start\":106853},{\"end\":107443,\"start\":107418},{\"end\":107913,\"start\":107900},{\"end\":108479,\"start\":108427},{\"end\":109041,\"start\":109028},{\"end\":109714,\"start\":109671},{\"end\":110032,\"start\":110007},{\"end\":110472,\"start\":110459},{\"end\":110879,\"start\":110872},{\"end\":111214,\"start\":111188},{\"end\":111585,\"start\":111572},{\"end\":111900,\"start\":111887},{\"end\":112230,\"start\":112217},{\"end\":112640,\"start\":112593},{\"end\":113121,\"start\":113084},{\"end\":113604,\"start\":113573},{\"end\":114121,\"start\":114108},{\"end\":114543,\"start\":114439},{\"end\":114909,\"start\":114885},{\"end\":115163,\"start\":115095},{\"end\":115541,\"start\":115498},{\"end\":115996,\"start\":115965},{\"end\":116386,\"start\":116355},{\"end\":116808,\"start\":116777},{\"end\":117323,\"start\":117310},{\"end\":117797,\"start\":117624},{\"end\":118331,\"start\":118318},{\"end\":118730,\"start\":118717},{\"end\":119132,\"start\":119090},{\"end\":119478,\"start\":119465},{\"end\":119849,\"start\":119823},{\"end\":120299,\"start\":120286},{\"end\":120813,\"start\":120786},{\"end\":121245,\"start\":121131},{\"end\":121795,\"start\":121782},{\"end\":122398,\"start\":122346},{\"end\":122878,\"start\":122852},{\"end\":123275,\"start\":123134},{\"end\":123806,\"start\":123780},{\"end\":124084,\"start\":124071},{\"end\":124541,\"start\":124492},{\"end\":125113,\"start\":125064},{\"end\":125700,\"start\":125663},{\"end\":126071,\"start\":126045},{\"end\":126517,\"start\":126475},{\"end\":126924,\"start\":126898},{\"end\":127343,\"start\":127318},{\"end\":127742,\"start\":127717},{\"end\":128276,\"start\":128234},{\"end\":128609,\"start\":128556},{\"end\":129018,\"start\":128986},{\"end\":129376,\"start\":129373},{\"end\":129689,\"start\":129664},{\"end\":130029,\"start\":130016},{\"end\":130369,\"start\":130356},{\"end\":130782,\"start\":130757},{\"end\":131163,\"start\":131138},{\"end\":131440,\"start\":131398},{\"end\":131732,\"start\":131699},{\"end\":131971,\"start\":131924},{\"end\":132408,\"start\":132401},{\"end\":132919,\"start\":132876},{\"end\":133424,\"start\":133399},{\"end\":133835,\"start\":133809}]"}}}, "year": 2023, "month": 12, "day": 17}