{"id": 23857591, "updated": "2022-03-12 13:46:39.213", "metadata": {"title": "On the Design of a Solar-Panel Receiver for Optical Wireless Communications With Simultaneous Energy Harvesting", "authors": "[{\"first\":\"Zixiong\",\"last\":\"Wang\",\"middle\":[]},{\"first\":\"Dobroslav\",\"last\":\"Tsonev\",\"middle\":[]},{\"first\":\"Stefan\",\"last\":\"Videv\",\"middle\":[]},{\"first\":\"Harald\",\"last\":\"Haas\",\"middle\":[]}]", "venue": "IEEE Journal on Selected Areas in Communications", "journal": "IEEE Journal on Selected Areas in Communications", "publication_date": {"year": 2015, "month": null, "day": null}, "abstract": "This paper proposes a novel design of an optical wireless communications (OWC) receiver using a solar panel as a photodetector. The proposed system is capable of simultaneous data transmission and energy harvesting. The solar panel can convert a modulated light signal into an electrical signal without any external power requirements. Furthermore, the direct current (DC) component of the modulated light can be harvested in the proposed receiver. The generated energy can potentially be used to power a user terminal or at least to prolong its operation time. The current work discusses the various parameters which need to be considered in the design of a system using a solar panel for simultaneous communication and energy harvesting. The presented theory is supported with an experimental implementation of orthogonal frequency division multiplexing (OFDM), thus, proving the validity of the analysis and demonstrating the feasibility of the proposed receiver. Using the propounded system, a communication link with a data rate of 11.84 Mbps is established for a received optical signal with a peak-to-peak amplitude of 0.7 × 10-3 W/cm2.", "fields_of_study": "[\"Computer Science\"]", "external_ids": {"arxiv": null, "mag": "2063874488", "acl": null, "pubmed": null, "pubmedcentral": null, "dblp": "journals/jsac/WangTVH15", "doi": "10.1109/jsac.2015.2391811"}}, "content": {"source": {"pdf_hash": "3f33e4d2c26ecfe45a5caa4abf2eb91b3bf7b3bd", "pdf_src": "MergedPDFExtraction", "pdf_uri": null, "oa_url_match": false, "oa_info": {"license": "CCBY", "open_access_url": "https://doi.org/10.1109/jsac.2015.2391811", "status": "HYBRID"}}, "grobid": {"id": "83559982142dd4bf59ac1ca3266e0c652242b851", "type": "plain-text", "url": "s3://ai2-s2-pdf-extraction-prod/parse-results/s2orc_worker/3f33e4d2c26ecfe45a5caa4abf2eb91b3bf7b3bd.txt", "contents": "\nOn the Design of a Solar-Panel Receiver for Optical Wireless Communications With Simultaneous Energy Harvesting\nAUGUST 2015\n\nMember, IEEEZixiong Wang \nMember, IEEEDobroslav Tsonev \nStefan Videv \nMember, IEEEHarald Haas \nOn the Design of a Solar-Panel Receiver for Optical Wireless Communications With Simultaneous Energy Harvesting\n\nIEEE JOURNAL ON SELECTED AREAS IN COMMUNICATIONS\n338AUGUST 201510.1109/JSAC.2015.23918111612\nThis paper proposes a novel design of an optical wireless communications (OWC) receiver using a solar panel as a photodetector. The proposed system is capable of simultaneous data transmission and energy harvesting. The solar panel can convert a modulated light signal into an electrical signal without any external power requirements. Furthermore, the direct current (DC) component of the modulated light can be harvested in the proposed receiver. The generated energy can potentially be used to power a user terminal or at least to prolong its operation time. The current work discusses the various parameters which need to be considered in the design of a system using a solar panel for simultaneous communication and energy harvesting. The presented theory is supported with an experimental implementation of orthogonal frequency division multiplexing (OFDM), thus, proving the validity of the analysis and demonstrating the feasibility of the proposed receiver. Using the propounded system, a communication link with a data rate of 11.84 Mbps is established for a received optical signal with a peak-to-peak amplitude of 0.7 × 10 −3 W/cm 2 .Index Terms-Solar panel, energy harvesting, optical wireless communication (OWC), orthogonal frequency division multiplexing (OFDM), receiver design.\n\ntop [4], [5]; and 2) LEDs that consist of individual red-greenblue (RGB) chips whose output is precisely mixed in order to generate white light [6], [7]. The phosphor coating of the first type of LED decreases the device's modulation bandwidth due to the relatively slow absorption and re-emission times of yellow phosphor. That is why a narrow band blue filter is often used at the receiver in order to eliminate the slow components of the emitted spectrum. Using this technique, a data rate of 1 Gbps has been achieved with a white off-the-shelf phosphor coated LED [4]. However, the increase in bandwidth comes at a penalty in the received signal power due to signal filtering. Therefore, RGB LEDs could present a better solution for highdata-rate VLC. A data rate of 3.4 Gbps has been reported with a white commercially-available RGB LED [7]. To the best of the authors' knowledge, Tsonev et al. have recently demonstrated a record-setting 3 Gbps transmission using a single blue Gallium Nitride light emitting diode with a diameter of 50 µm (µLED) [8]. These results demonstrate the significant potential of OWC for future high speed mobile communications.\n\nOn the receiver side, positive-intrinsic-negative (PIN) PDs and avalanche photodiodes (APDs) are the most common photodetectors in OWC systems due to their ability to provide highspeed linear photodetection at practical illumination levels. PIN PDs are diodes with a wide intrinsic semiconductor region in between a p-type and an n-type semiconductor region, hence the abbreviation used to refer to them. However, the disadvantage of such photodetectors is that they require external power to operate. This disadvantage could be overcome by using a solar panel in place of the PD. The solar panel can directly convert the optical signal to an electrical signal, without the need of an external power supply. The use of a solar panel instead of a conventional PD further simplifies the receiver circuitry by removing the need for a transimpedance amplifier.\n\nThe modern solar cell was invented in 1954 at the Bell Laboratories [9], [10], and since then has gone through three generations of development. Single-crystalline and multi-crystalline silicon solar panels have a conversion efficiency of more than 20% and are currently dominant in the market [9], [11]. Thinfilm solar cells have a reduced cost compared to crystalline silicon panels, but at a reduction in conversion efficiency down to approximately 10% [12]. The current generation of solar panels have up to 40% conversion efficiency at a cost comparable to thin-film technology [12]- [15]. In this paper, a first-generation multi-crystalline silicon solar panel is investigated in an indoor environment. Energy harvesting in the RF domain has recently received significant interest [16]- [18]. Its application is based This work is licensed under a Creative Commons Attribution 3.0 License. For more information, see http://creativecommons.org/licenses/by/3.0/ on the idea that information and energy can be transmitted simultaneously over the communication channel [19]. In the context of the \"Internet of Things,\" it appears that this topic is of particular relevance.\n\nIn this paper, we propose a set of steps which allow for the analysis and the design of a solar-panel-based OWC receiver, capable of simultaneous energy harvesting and communication. Firstly, the well-known direct current (DC) model of a solar panel is presented for the purposes of energy harvesting. The derivation of all relevant parameters is described in detail. Secondly, an alternating current (AC) model of the solar panel for the purposes of communication is provided. The derivation of all parameters from the AC model is described in detail. Thirdly, a receiver circuit and general steps for the design of a system with simultaneous energy harvesting and communication are proposed. Finally, the performance of the proposed system is investigated in a practical experimental set-up. The demonstrated data transfer reaches a rate of up to 11.84 Mbps. This implies that every single device with an integrated solar panel could potentially be used as a high speed data receiver. The presented results could have great implications for the connectivity of future self-powered smart devices which are expected to become an integral part of the \"Internet of Things.\"\n\nThe rest of this paper is organized as follows. Section II describes the relevant solar panel models and proposes a receiver circuit design for simultaneous energy harvesting and communication. Section III describes the derivation of the relevant parameters for the presented models. Section IV discusses the communication capabilities of the proposed receiver. The paper gives concluding remarks in Section V.\n\n\nII. PRINCIPLES OF OPERATION OF A SOLAR PANEL FOR SIMULTANEOUS ENERGY HARVESTING AND COMMUNICATION\n\n\nA. A Solar Panel Model for Energy Harvesting\n\nThe DC model of a solar panel has been established and well studied since the second half of the last century [10], [20]- [23]. The equivalent circuit model is illustrated in Fig. 1. The voltage and the current at the output of the solar panel have a non-linear relationship. This is modelled by a diode which is connected in parallel to the photocurrent source I PH . The forward current of the diode is denoted as I D . A shunt resistor R SH models leakage current in the solar panel, and a series resistor R S represents the internal voltage loss due to cell interconnections [23]. Using the model in Fig. 1, the I-V characteristic of the solar panel could be obtained as: where V = R L I and\nI = I PH − I D − (V + IR S ) R SH ,(1)I D = I 0 exp (V + IR S ) n s V T − 1 .(2)\nIn (2), I 0 is the reverse saturation current of the diode, n S is the number of cells in the solar panel connected in series [21], and V T is the junction thermal voltage of the diode, which is given by:\nV T = AkT q ,(3)\nwhere A is the diode ideality factor, k is Boltzmann's constant, T is the temperature in Kelvin and q is the electron charge [21]. The parameters n S , k, T , and q are known in advance, while I PH , I 0 , A, R SH , and R S , are unknown parameters. They depend on the overall light irradiance over the solar panel. A procedure for determining their values is described in Section III-B.\n\n\nB. A Solar Panel Model for Communication\n\nFor the purpose of communication performance modelling, a solar panel model that captures the AC characteristics of the device is required. Therefore, a modification of the model from Section II-A is needed. As shown in Fig. 2, a capacitor C is inserted in parallel with the shunt resistor R SH in order to capture the internal capacitive effects of the solar cell. The diode is replaced by its small-signal equivalent resistor r since it is considered that the AC component of the light signal has a small variation compared to the magnitude of the DC component which sets the DC parameters of the solar panel. A series inductor L is also added to model the inductance of any wire connections to the solar panel [24], [25]. Since only the AC component of the photo-generated current i PH (ω) is used for communication, it is assumed that a capacitor C 0 is added before the load resistor R C to block the DC component of the signal. The information signal is represented by the voltage of the load resistor R C . Then, the frequency response of the solar panel configuration for communication is given by:\nv(ω) i PH (ω) 2 = R C R X 1 r + 1 1 jωC + 1 R SH + 1 R X 2 ,(4)\nwhere ω is the angular frequency and j = √ −1. R X is the resistance that is parallel with R SH , which is given by:\nR X = R S + jωL + 1 jωC 0 + R C .(5)\nIn (4), parameters R SH and R S are set by the DC operation point of the solar panel described in Section II-A. A procedure for determining parameters r, C, and L is described in Section III-B. \n\n\nC. A Solar Panel Model for Simultaneous Energy Harvesting and Communication\n\nIn order to facilitate simultaneous communication and energy harvesting with a solar panel, the receiver circuit shown in Fig. 3 is proposed. The load R C and the capacitor C 0 form the communication branch. Another branch for energy harvesting is added in parallel to the communication branch. The branch for energy harvesting consists of an inductor L 0 as the RF choke and a resistor R L , which could be a battery in a real world application. The inductor L 0 is used to attenuate the AC signal, thus removing ripples from the DC signal and at the same time improving the gain in the communication signal. The frequency response of the whole system in Fig. 3 could be evaluated as:\nv(ω) i PH (ω) 2 = R LC R S + jωL+R LC R C 1 jωC 0 +R C 1 r + 1 1 jωC + 1 R SH + 1 R S + jωL+R LC 2 .(6)\nIn (6), R LC is the resistance of the parallel network after the inductor L and is calculated as:\nR LC = 1 1 jωL 0 +R L + 1 1 jωC 0 +R C .(7)\nNote that the photocurrent consists of both the DC and AC signal components, i.e., I PH and i PH (ω). The DC component I PH is blocked by the capacitor C 0 , and only passes through the energy harvesting branch. The AC component i PH (ω) passes through both branches. However, in the branch for energy harvesting, it is highly attenuated by the inductor L 0 . Therefore, most of the AC component passes through the branch for communication provided L 0 and R L are sufficiently large in comparison to 1/C 0 and R c .\n\n\nD. Noise Analysis\n\nWhen designing a communication system, noise contribution factors should be analysed as well. Three main contributors of noise are expected in the described system. First, the opticalto-electrical conversion in the solar panel generates shot noise. The second noise component is thermal additive white Gaussian noise (AWGN) caused by the resistors within the receiver system. The third noise component that has to be considered is caused by the non-linear relationship between light and current in the solar panel.\n\n1) Shot Noise: Due to the fact that intensity modulation/ direct detection is used in the proposed communication system and due to the fact that the area of the employed solar cell collects a large number of photons, this noise component can be modelled as AWGN [26]. In the equivalent-circuit diagram presented in Fig. 3 this noise component would appear as a current source in parallel to the current source of the solar panel. The noise source would generate random current values with Gaussian distribution and a power spectral density (PSD) profile which is flat for all practical considerations. The output of this noise source is subjected to the frequency profile of the subsequent circuit elements and experiences the same frequency gains that the information signal experiences, as described by (6). The one-sided PSD of the shot noise, expressed in A 2 /Hz, is calculated as [26]:\nN sh o = 2qρΦ a ,(8)\nwhere Φ a is the average light irradiance over the receiver area (including ambient light), ρ is the optical-to-electrical conversion efficiency of the solar panel expressed in A/W, and q = 1.60217657 × 10 −19 C is the charge of an electron. 1 2) Thermal Noise: Thermal noise is generated by each of the five resistors presented in Fig. 3. It can be modelled as a voltage source which appears in series with the respective resistor whose noise it represents. For example, the equivalent circuit, which can be used to calculate the noise contribution of resistor R c from Fig. 3 is presented in Fig. 4(a). The power spectral density of the signal generated by V c (ω) can be calculated as [26]:\nN th o,R c = 4kT R c (9)\nwhere T is the resistor temperature in Kelvin, k = 1.3806488 × 10 −23 J/K and R c is in ohms. The contribution of V c (ω) to the PSD of the noise at the output (over the resistor R c ) can be determined by multiplying (9) by the inductor-resistor-capacitor (LRC) gain that the noise signal from V c (ω) experiences in the receiver circuit:\n|h R c (ω)| 2 = v c c (ω) V c (ω) 2 = R c R c + 1 jωC 0 + 1 1 R 1,C + 1 R L + jωL 0 2 ,(10)\nwhere\nR 1,C = 1 1 1 1/r+ jωC+1/R SH +R s + jωL + 1 R L + jωL .0 .\nSimilarly, the equivalent circuit which represents the contribution of resistor R SH to the overall noise variance at the output is presented in Fig. 4(b). The power spectral density of the signal generated by V SH (ω) can be calculated as:\nN th o,R SH = 4kT R SH .(11)\nThe LRC gain that the noise signal from V SH (ω) experiences in the receiver circuit can be calculated as:\n|h R SH (ω)| 2 = v SH c (ω) V SH (ω) 2 = R 2,R SH R SH +R 2,R SH × R 1,R SH R 1,R SH +R s + jωL × R c R c + 1 jωC 0 2 ,(12)\nwhere\nR 1,SH = 1 1 R c + 1 jωC 0 + 1 R L + jωL 0 , and R 2,SH = 1 1 jωL+R s +R 1,SH + 1 r + jωC .\nThe equivalent circuit which represents the contribution of resistor R L to the overall noise variance at the output is presented in Fig. 4(c). The power spectral density of the signal generated by V L (ω) can be calculated as:\nN th o,R L = 4kT R L .(13)\nThe LRC gain that the noise signal from V L (ω) experiences in the receiver circuit can be calculated as:\n|h R L (ω)| 2 = v L c (ω) V L (ω) 2 = R c R c + 1 jωC 0 × R 3,L R L + R 3,L + jωL 0 2 ,(14)\nwhere\nR 3,L = 1 1/R 1,L + 1/R 2,L , R 2,L = R c + 1 jωC 0 , and R 1,L = 1 1/r + jωC + 1/R SH + R s + jωL.\nThe equivalent circuit which represents the contribution of resistor r to the overall noise variance at the output is presented in Fig. 4(d). The power spectral density of the signal generated by V r (ω) can be calculated as:\nN th o,r = 4kT r.(15)\nThe LRC gain that the noise signal from V r (ω) experiences in the receiver circuit can be calculated as:\n|h r (ω)| 2 = v r c (ω) V r (ω) 2 = R 2,r r + R 2,r × R 1,r R 1,r + R s + jωL × R c R c + 1 jωC 0 2 ,(16)\nwhere\nR 1,r = 1 1 R c + 1 jωC 0 + 1 R L + jωL 0 , and R 2,r = 1 1 jωL+R s +R 1,r + 1 R SH + jωC .\nThe equivalent circuit which represents the contribution of resistor R s to the overall noise variance at the output is presented in Fig. 4(e). The power spectral density of the signal generated by V s (ω) can be calculated as:\nN th o,R s = 4kT R s .(17)\nThe LRC gain that the noise signal from V s (ω) experiences in the receiver circuit can be calculated as:\n|h R s (ω)| 2 = v s c (ω) V s (ω) 2 = R 2,s R s + jωL + R 1,s + R 2,s × R c R c + 1 jωC 0 2 ,(18)\nwhere\nR 1,s = 1 1/r + jωC + 1/R SH , and R 2,s = 1 1 jωL 0 +R L + 1 R c + 1 jωC 0 .\nThe overall PSD of the thermal noise at the output can be calculated as: (19) and the variance of the thermal noise can be calculated by integrating N th o (ω) within the bandwidth of the receiver system. 3) Non-Linear Distortion: Non-linear distortion is often not trivial to model and its effects have to be evaluated in relation to the specific modulation scheme that is used for communication. The theoretical approach for modelling non-linear distortion in OWC is still an open subject of investigation. As a result, the current manuscript adopts an empirical approach developed by the authors for evaluating the effects of the non-linear distortion on the system performance. This approach is presented in Section IV.\nN th o (ω) = |h R C (ω)| 2 N th o,R C + |h R SH (ω)| 2 N th o,R SH + |h R L (ω)| 2 N th o,R L + |h r (ω)| 2 N th o,r + |h R C (ω)| 2 N th o,R C ,\n\nIII. ESTIMATION OF SYSTEM PARAMETERS\n\n\nA. LED Light Parameters\n\nThe parameters of the solar panel model change with variations in the irradiance. Hence, in order to evaluate the frequency response and thereby the communication performance of the solar panel, the light irradiance should be established first. In this experiment, the VESTA 165 mm down-lighter is used as the LED transmitter, and the irradiance is measured by using a commercial spectral irradiance receiver, Labsphere E 1000, with a 1-cm 2 concentrator. The size of the solar panel, British Petroleum SX305M, is 432 cm 2 (24 cm × 18 cm). This is much larger than the active receiver area of the spectral irradiance receiver. Therefore, the average light irradiance over the solar panel is estimated in a semi-analytical fashion by using measurements as well as the radiation pattern of the LED source. The LED radiation is assumed to follow a generalized Lambertian pattern [26]- [28]. The optical channel gain, G, in an OWC system is given by:\nG = (m + 1)S 2πd 2 cos(φ) m cos(ψ),(20)\nwhere m is the order of the Lambertian radiation pattern; S is the physical area of the photodetector; d is the transmission distance; φ and ψ are the radiation and incidence angles, respectively. Note that the LED's front panel is set to be parallel with the spectral irradiance receiver and with the solar panel in the following experiments. Hence, the radiation and the incidence angles in (20) are identical. Therefore, the measured irradiance I r is proportional to cos m+1 (φ) and inversely proportional to d 2 , i.e.:\nI r ∝ cos(φ) m+1 d 2 .(21)\nUsing (21) and a set of measurements, the parameter m can be obtained by solving a system of equations for the irradiance pattern I r . Two sets of measurements are carried out. In the first set, the distance between the LED and the spectral irradiance receiver is fixed, and then the spectral irradiance receiver is moved horizontally away from the center axis of the LED. The corresponding irradiance is measured. The normalized irradiance in this measurement is presented in Fig. 5(a)-(c), where the transmission distance is set to 75 cm, 85 cm and 95 cm, respectively. In the second measurement set, the spectral irradiance receiver is well aligned with the LED without any horizontal shift, and then the irradiance is measured as the transmission distance is varied from 65 cm to 95 cm. The normalized irradiance in this measurement is shown in Fig. 5(d). Based on the measured irradiance data sets, the corresponding parameter m is estimated to be 11.14. As shown in Fig. 5, the measured and the theoretical irradiance match well in all of the four cases.\n\nHence, by using the spectral irradiance receiver, the irradiance at the center of the solar panel could be measured when the solar panel is well aligned with the LED source. The irradiance at any other point on the solar panel can be derived according to (21) using the estimated parameter m. In this way, the average irradiance over the entire solar panel can be estimated. Note that in the following parts of this paper, irradiance refers to the average irradiance over the entire solar panel unless explicitly stated otherwise.\n\n\nB. Solar Panel Parameters\n\nAccording to Fig. 3, five parameters of the solar panel-R SH , R S , r, C and L-need to be obtained before the performance can be analysed. Two procedures are carried out to obtain estimates for the five parameters. First, the I-V characteristics of the solar panel under various light irradiance levels are measured. The parameters R SH and R S can be obtained by plugging in the measurement I-V data into (1) and solving the resulting system of equations. Afterwards, the frequency response of the solar panel is measured as a function of the load R C for the configuration in Fig. 2. The parameters r, C and L can be  estimated similarly to R SH and R S by making use of (4) and the set of frequency response measurement data.\n\nSeven I-V curves for the solar panel are measured under light irradiance levels ranging from 1.561 × 10 −3 W/cm 2 to 1.184 × 10 −2 W/cm 2 . Fig. 6 summarizes the results. The seven measured curves have similar trends. Using (1), a non-linear system of equations has been solved for the seven sets of I-V measurement data employing a least-square-error fitting method and numerical optimization techniques. With this approach, R SH and R S are estimated to be 20 kΩ and 1 Ω, respectively. The theoretical estimates of the I-V curves based on (1) and on the estimated values for R SH and R S show a very good match with the measured curves. This suggests that it can be safely assumed that the values of R SH and R S are constant within the irradiance interval [1.561 × 10 −3 W/cm 2 ; 1.184 × 10 −2 W/cm 2 ]. Hence, the small-signal model is applicable for an optical AC signal with optical intensity which falls within the interval [1.561 × 10 −3 W/cm 2 ; 1.184 × 10 −2 W/cm 2 ].\n\nA set of experimentally estimated power-voltage (P-V) energy harvesting curves for the solar panel as well as the corresponding maximum power points under various light irradiance levels are shown in Fig. 7. The measurements are taken by varying the value of R L at each irradiance level. We can see that when the light irradiance is 1.561 × 10 −3 W/cm 2 , which is the bottom curve in Fig. 7, the load R L that achieves the maximum output power is 4.6 kΩ. When the light irradiance is increased to 1.184 × 10 −2 W/cm 2 , the corresponding load for achieving the maximum output power is decreased to 1.3 kΩ. Therefore, it seems that the optimal load for energy harvesting decreases as the light irradiance on the overall solar panel increases. It should be kept in mind that irradiance in this case signifies the average irradiance of the light incident on the solar panel. Hence, the optimum load R L for the configurations in Figs. 1 and 3 should be selected based on the estimated P-V curves and based on the ambient light levels as well as the DC component of the optical information signal.\n\nThe frequency response of the solar panel configuration presented in Fig. 2 is measured for different values of R C in the range from 10 Ω to 500 Ω and for different values of C 0 in the range from 100 nF to 1 µF. Afterwards, the values of r, L and C are estimated by solving (4) simultaneously for all the values from the measurements. Note that the average light irradiance over the solar panel in this measurement is 3.619 × 10 −3 W/cm 2 , which is within the irradiance range used in the I-V curve measurements. Hence, the estimated values of parameters R SH and R S can be assumed constant and applied directly in the current estimation procedure. Fig. 8 shows that the measured frequency response values match well with the theoretical predictions based on the estimated values of r = 720 Ω, C = 34 nF and L = 120 nH. From the results in Fig. 8(a) and (b) it can be concluded that as the resistor R C increases, the overall gain of the frequency response increases. However, the corresponding 3-dB bandwidth decreases, i.e., the channel response becomes steeper and the gain in the high frequencies deteriorates more relative to the gain in the low frequencies.\n\nIn addition, as the capacitor C 0 increases, the channel response in the low frequency range is improved. Hence, the use of a larger capacitor C 0 would reduce the DC-wander effect as the loss of low frequency components is reduced. This is beneficial to the performance of single-carrier modulation schemes such as on-off keying (OOK) and M-ary pulse-amplitude modulation M-PAM. However, in the high frequency range, a higher value for C 0 translates into a reduction of the gain, which overall can effectively deteriorate the frequency response of the system.\n\n\nC. Frequency Response of the Solar Panel for Simultaneous Energy Harvesting and Communication\n\nAfter all the necessary parameters-R SH , R S , r, C, and L, depicted in Fig. 3, have been obtained, they can be applied in (6) to evaluate the frequency response of the solar panel for the purpose of simultaneous energy harvesting and communication. As already described in Section III-B, the optimal load R L for energy harvesting is determined by the light irradiance on the overall solar panel. Since the capacitor C 0 in the communication branch blocks the DC component and the inductor L 0 passes the DC component without attenuation, the optimal value of resistor R L is the optimal value estimated in Section III-B for the configuration in Fig. 1.\n\nThe effects of capacitor C 0 and resistor R C have already been described in Section III-B. The effect of inductor L 0 is illustrated in Fig. 9. The values of L 0 are varied from 10 mH to 1 H. The exact effect of L 0 depends on the values of the other parameters. However, the overall trend indicates an improvement of the channel response in the low frequencies as the inductance value of L 0 increases. This occurs because the larger the inductor value is, the more ability it has to block the AC signal, which is then channelled through the communication branch. For the high frequencies, the channel response does not seem to change significantly with L 0 . \n\n\nIV. COMMUNICATION RESULTS\n\nAn experimental procedure has been set up in order to verify the communication properties of the solar-panel-based receiver described in this work. A diagram describing the experimental setup can be found in Fig. 10. A discrete orthogonal frequency division multiplexing (OFDM) signal is generated through MATLAB with a series of steps that include: pseudorandom bit generation, M-ary quadrature amplitude modulation (M-QAM), adaptive bit and energy loading, inverse fast Fourier transform (IFFT), oversampling and pulse shaping. The samples of the OFDM signal are passed onto an arbitrary waveform generator (AWG), Agilent 81180A, which supplies a custombuilt transmitter circuit with an analog waveform, suitable to modulate the light source. The solar panel captures the emitted light from the transmitter and generates an electrical signal. The latter is decoupled in the receiver circuit from Fig. 3, where the DC component is dissipated through the energyharvesting load while the communication signal over R C is buffered with a voltage amplifier and passed to an oscilloscope, Agilent MSO7104B. The latter performs the digital to analog conversion. The digitized signal is retrieved from the oscilloscope and processed back in MATLAB through a series of steps that include: synchronization, matched filtering, downsampling, fast Fourier transform (FFT), channel estimation, equalization, and M-QAM demodulation.\n\nOFDM has been selected as a modulation scheme because it allows for the investigation of the communication properties in individual frequency bands, which is highly beneficial for the analysis of a system with a non-flat frequency profile. The adaptive bit and energy loading algorithms for OFDM allow the non-flat communication profile to be exploited in an optimal fashion, approaching the channel capacity [29]. The relevant OFDM parameters are: 1) FFT size of N fft = 1024, which means that only 511 subcarriers can be modulated with unique information because Hermitian symmetry has to be imposed in the frequency domain in order to generate a real timedomain OFDM frame [29], [30]; 2) cyclic prefix size of N cp = 10; 3) single-sided communication bandwidth of B = 2 MHz; 4) digital clipping of the OFDM signal at −3.2σ s and 3.2σ s , where σ s is the standard deviation of the time-domain OFDM signal, in order to limit any high peaks, typical for the OFDM signal; 5) root-raised cosine (RRC) pulse shaping with an oversampling factor of 4.\n\nIn order to enable the adaptive bit and energy loading procedure, the communication channel has to be known in advance. Therefore, a suitable channel estimation technique is required. The received signal is assumed to take the following form:\nS r ( f ) = H( f )S t ( f ) + N sh ( f ) + N th ( f ),(22)\nwhere H( f ) denotes the complex channel gain as a function of frequency, S t ( f ) is the frequency component of the transmitted signal, N sh ( f ) denotes the AWGN contribution of the shot noise, and N th ( f ) is the AWGN realization of the thermal noise. The communication channel combines the effects of all linear elements in the communication system, i.e.,\nH( f ) = H t ( f )H o ( f )ρH LRC ( f ),(23)\nwhere H t ( f ) is the frequency response of the transmitter circuit including any amplification gains as well as electrical-to-optical conversion gains, H o ( f ) is the gain of the optical channel due to light propagation, ρ is the responsivity of the solar panel in A/W and H LRC ( f ) is the frequency response of the LRC circuit in Fig. 3. The conversion from an optical signal to an electrical signal is assumed to be linear at first. The experiment is set up in a line-of-sight (LOS) configuration and the transmitter has been designed to have a flat response within the communication bandwidth of DC to 2 MHz. Therefore, it can be assumed that the non-flat frequency profile of the communication channel is entirely due to the frequency profile of the solar cell. Two estimation techniques have been applied in order to thoroughly characterize the communication channel. In the first technique, multiple copies of an OFDM pilot frame, assumed to be known at the receiver, are transmitted in a sequence. The AWGN is zero-mean, so if N copies of the pilot frame are sent to the receiver, the channel can be estimated with a conventional mean estimator as:Ĥ\n( f ) = ∑ N i=1 S i r ( f ) NS t ( f ) .(24)\nThe noise variance, i.e., the noise energy, can be estimated with a conventional variance estimator as:\nσ 2 n ( f ) = ∑ N i=1 S i r ( f ) −Ĥ( f )S t ( f ) 2 N − 1 .(25)\nIn the rest of this paper, the currently presented channel and noise estimation technique is called Estimator I. The channel gain and the noise variance are sufficient quantities in order to estimate the achievable signal-to-noise ration (SNR) on each frequency subcarrier, which in turn, determines the information which can be successfully encoded. One thing to note, however, is the inherent non-linearity of the OWC channel. Nonlinear distortion occurs in the digital-to-analog conversion process, in the transition from an electrical signal to an optical signal in the LED transmitter as well as possibly in the transition from an optical signal to an electrical signal in the solar cell. The digital-toanalog converter (DAC) in the AWG has high precision (12 bits) and the LED transmitter is operated in a range which makes any non-linear distortion from this element negligible. Therefore, the assumption can be made that the non-linear distortion in the system would be mainly caused by the solar panel. Let's assume that the time-domain information signal right after the optical-to-electrical conversion has the following form: where z(·) denotes the non-linear optical-to-electrical conversion in the solar panel, * is the convolution operator, h t (t) and h o (t) denote the impulse responses of the transmitter circuit and the optical communications channel, respectively. A timedomain non-linear distortion of an OFDM signal translates into an SNR penalty in the frequency domain [29], [30]. Estimator I works well in a linear AWGN channel. However, if significant non-linear distortion is present in the system, the presented estimator is unable to capture its effect. This occurs because (24) actually estimates:\ns r (t) = z (h o (t) * h t (t) * s t (t)) ,(26)H( f ) = H LRC ( f )F {ŝ r (t)} S t ( f ) = H( f )S t ( f ) + d( f ) S t ( f ) ,(27)\nrather than the desired communication channel frequency response H( f ). In this equation, F{·} denotes the FFT operation and d( f ) denotes the non-linear distortion term in the frequency domain. For very strong non-linear distortion, the distortion term could lead to significantly impaired channel estimation. This effect also compromises the noise estimation technique presented in (25), because the non-linear distortion term does not contribute to the estimated noise variance. Hence, in high SNR regions, where the non-linear distortion limits the performance, the estimated SNR using Estimator I will be inaccurate. Therefore, a second estimation technique, named Estimator II, has been adopted in conjunction with Estimator I. In this technique, different realizations of a pilot frame are sent one after the other rather than the same copy being sent multiple times as in the previous channel estimation technique. Then, the frequency profile of the channel can be estimated as:\nH( f ) = 1 N N ∑ i=1 S i r ( f ) S i t ( f ) = 1 N N ∑ i=1 H( f ) S i t ( f ) + d i ( f ) S i t ( f ) .(28)\nClearly, in this case, not only the AWGN is averaged out during the channel estimation, but the non-linear distortion as well. Hence, the channel estimation is expected to be more accurate in the presence of non-linear distortion. Furthermore, this technique improves the noise variance estimation as well, since the distortion term now contributes to the sum in (25). In a lot of practical scenarios, where the non-linearity distortion is significant, but still much lower than the signal energy, applying both techniques can be beneficial for evaluating the amount of non-linear distortion in the system. An experimental measure-ment has been conducted with a 4-QAM OFDM signal for a range of values of the parameter R C . This parameter influences the channel gain of the receiver circuit the most as predicted in Section III-B and III-C. The other relevant parameters have been set to C 0 = 1 µF, L 0 = 10 mH and R L = 1000 Ω in the experiment. Fig. 11 presents the estimated channel gain from the OFDM experiment in comparison to the projected channel gain using the theoretical framework from Section III. The curves in all three cases are in good agreement with an absolute difference of no more than 2 dB at each frequency point. The slight tipping of the estimated curves around 2 MHz is caused by the application of a passive low-pass filter, Mini Circuits SLP − 50+, before the input to the oscilloscope in order to filter out some of the excess AWGN. Fig. 13(a) presents an experimental estimation of the channel gain for R C = [1 Ω, 5 Ω, 10 Ω, 50 Ω, 100 Ω]. Estimator I and Estimator II provide very similar results with negligible variations in the curves. Nevertheless, a close inspection reveals that Estimator I produces smoother curves. Therefore, some non-linearity is present in the system.\n\nThe achievable received SNR is also estimated in this experiment. Before the discussion of the results obtained through Estimator I and Estimator II and presented in Fig. 13(b), it is worth to discuss the expected achievable SNR values.\n\nBased on the data presented in Fig. 6 and the equivalent circuit presented in Fig. 1, the responsivity of the solar panel can be estimated to ρ ≈ 4.5 mA/W, which is low due to the low efficiency of the cell at these illumination levels. However, given the large area of the solar panel (432 cm 2 ) and the peakto-peak swing of the received optical signal, which is measured at around 0.7 × 10 −3 W/cm 2 , the received information signal has a swing in the order of 1.36 mA. As already described at the beginning of this section, the information signal is clipped at −3.2σ s and 3.2σ s , which makes the standard deviation of the received signal ≈ 212.5 µA. Hence, the variance of the information signal is 4.52 × 10 −8 A 2 . The variance of the shot noise can be estimated using (8). For reasons of simplicity, let's assume that the receiver system bandwidth is limited by the applied low-pass filter, i.e., B = 50 MHz (in reality, it would be lower due to the limited response of the receiver circuit and due to the limited response of the applied buffer amplifier). The average intensity over the solar panel is measured at ≈ 3.65 × 10 −3 W/cm 2 . Therefore, the variance of the shot noise can be calculated as σ 2 shot = BN shot o = 1.14 × 10 −13 A 2 . Therefore, if shot noise is the main contributor to the noise in the system, the estimated SNR is expected to be at least in the range of 56 dB and the estimated SNR profile is expected to be approximately flat since the only part of the system with a non-flat frequency response is the LRC circuit at the receiver which attenuates the information signal and the shot noise equivalently. The variance of the thermal noise can be estimated using (19). Since each noise component is subjected to a different LRC gain before it reaches the output, it is interesting to investigate how the different noise components influence the output. The power spectral density of each noise component for R c = 50 Ω is presented in Fig. 12. The value of R c = 50 Ω is selected because it happens to give the highest communication rates as presented later in this section. The results in Fig. 12(a) clearly show that the main noise contribution, which dominates the noise PSD comes from R c . Even though the other resistors have higher values, their noise components experience significantly higher attenuation due to the LRC circuit. The LRC gain factors are presented in Fig. 12(b). The only noise source, which experiences LRC attenuation comparable to the attenuation for R c , is R s . However, its value is only 1 Ω. If the value of R c is set in the vicinity of 1 Ω, then R s is also going to begin contributing significantly to the thermal noise in the system. Another interesting observation to make is that the PSD of the thermal noise appears flat at the output for a large range of frequencies. This means that an additional lowpass filter should be included at the output of the receiver circuit in order to limit the variance of the thermal noise. Using (19), the variance of the thermal noise over a bandwidth of 50 MHz is ≈ 5 × 10 −11 V 2 . Using (6), the LRC gain to the information signal variance can be estimated at around 1.94 × 10 3 at the low frequencies, which makes the information signal variance at the output (over R c ) approximately 4.52 × 10 −8 A 2 × 1.94 × 10 3 = 8.77 × 10 −5 V 2 . The frequency response of the LRC circuit which affects the information signal is not flat. However, in the lower frequencies, where the attenuation is small, the expected SNR due to the thermal noise should be in the vicinity of at least 60 dB and should slowly drop following the channel gain profile presented in Fig. 13(a).\n\nThe SNR values estimated during the experiment are presented in Fig. 13(b). All SNR curves estimated with Estimator I tend to follow the estimated channel impulse response for the respective configuration of R c . It is interesting to note that in terms of absolute value, the estimated SNR curves are lower than predicted by theory. This occurs because the noise at the input of the oscilloscope tends to dominate the shot noise and the thermal noise components. Despite being tuned for precise measurements, oscilloscopes usually have very high bandwidth-1 GHz for the Agilent MSO7104B. The SNR curves estimated with Estimator II reveal a more interesting result. As the signal is amplified, due to the higher values of R c , the non-linearity slowly becomes the dominant noise factor. For R c > 10 Ω, the SNR is limited by the non-linear distortion and cannot reach more than ≈ 27 dB. The result leads to an interesting conclusion. Very high SNRs can be expected for large-sized solar cells. However, the non-linear distortion is likely to limit the system performance. Therefore, for communication purposes, the size of the solar cell should not be bigger than the cell-size which allows the system to reach the maximum SNR allowed by the non-linear distortion. A bigger cell would only lead to a worse frequency response without any improvement in the achievable SNR.\n\nAn estimate of the achievable SNR can be obtained in a purely experimental fashion, as presented in this section, or in an analytical way using the theory from Section II and Section III. Afterwards, the M-QAM analytical formula for bir error rate (BER) calculation as a function of SNR can be used for accurate estimation of the achievable data rate in an OFDM scenario. The formula can be used to establish the maximum constellation size that can be modulated on each OFDM subcarrier for a target BER. This approach has been adopted in the current work. Following the work of Levin [31], an adaptive bit and energy loading algorithm has been designed based on the analytical formula for the M-QAM performance. An experimental measurement has been conducted for a range of values of the parameters R C and C 0 . The maximum data rate achieved experimentally with M-QAM OFDM is presented in Fig. 14. The parameters L 0 and R L do not seem to influence the communication performance significantly as predicted in Section III-C. They have been set to L 0 = 10 mH and R L = 1000 Ω during the experiment. The amplitude swing of the received optical signal varies between 3.3 × 10 −3 W/cm 2 and 4 × 10 −3 W/cm 2 , i.e., the peak-to-peak amplitude swing is 0.7 × 10 −3 W/cm 2 -well-within the assumed small-signal range. The target BER has been selected at < 2 × 10 −3 -wellwithin forward error correction limits [32]. As predicted by the analysis from Section III-B, increasing the value of C 0 improves the channel gain and so the data rate. The effect, however, quickly levels off at around C 0 = 100 nF, again consistent with the analysis. The data rate increases with the resistor R C up until R C = 50 Ω, after which, it decreases for R C = [100 Ω, 500 Ω]. The maximum data rate of 11.84 Mbps with a BER of 1.6 × 10 −3 was achieved for R C = 50 Ω in combination with C 0 = 10 nF. At that point, the power over R L = 1000 Ω was measured at ≈ 30 mW. The result is consistent with the power levels measured under similar illumination conditions. Therefore, the use of the solar panel for communication purposes does not limit its energy harvesting capabilities.\n\n\nV. CONCLUSION\n\nThis paper proposed a novel receiver for optical wireless communication using a solar panel as the photodetector. The solar panel can convert the modulated light into an electrical signal without the need for a power supply. Under this scheme, simultaneous communication and energy harvesting can be realized. The operating parameters of the solar panel have a strong non-linear relationship with the irradiance levels over the device. Nonetheless, it was demonstrated that a smallsignal linear model is capable of capturing the communication functionality of the solar-panel-based receiver. Experimental results showed close agreement with the presented theory, and demonstrated the feasibility of a communication link at a data rate of 11.84 Mbps with a BER of 1.6 × 10 −3 for a received optical signal with a peak-to-peak amplitude swing of 0.7 × 10 −3 W/cm −2 . The conducted experiment demonstrated the existence of an optimal set of design parameters for the receiver circuitry. The presented theory can be used for the prediction of the optimized parameters that maximize the receiver SNR. Non-linear distortion showed significant effects on the performance in a high-SNR scenario. This limits the achievable SNR levels and puts a constraint on the achievable data rate. Future work will study the non-linear distortion in more detail in an attempt to improve the performance characterization of the solar-panel-based receiver.\n\nFig. 1 .\n1Solar panel model for energy harvesting.\n\nFig. 2 .\n2Solar panel model for communication.\n\nFig. 3 .\n3Solar panel configuration for simultaneous energy harvesting and communication.\n\nFig. 4 .\n4Noise-equivalent circuits for the different thermal-noise contributors in the receiver system. (a) Noise-equivalent circuit for resistor R C . (b) Noiseequivalent circuit for resistor R SH . (c) Noise-equivalent circuit for resistor R L . (d) Noise-equivalent circuit for resistor r. (e) Noise-equivalent circuit for resistor R S .\n\nFig. 5 .\n5Normalized light irradiance under various measurement scenarios. (a) Normalized irradiance vs. horizontal shift of the spectral irradiance receiver at a transmission distance of 75 cm. (b) Normalized irradiance vs. horizontal shift of the spectral irradiance receiver at a transmission distance of 85 cm. (c) Normalized irradiance vs. horizontal shift of the spectral irradiance receiver at a transmission distance of 95 cm. (d) Normalized irradiance vs. transmission distance for horizontal alignment of the LED and the spectral irradiance receiver.\n\nFig. 6 .\n6Measured and fitted I-V curves of the solar panel under various light irradiance. From top to bottom, the light irradiance levels are: 1.184 × 10 −2 W/cm 2 , 8.291 × 10 −3 W/cm 2 , 5.922 × 10 −3 W/cm 2 , 4.401 × 10 −3 W/cm 2 , 3.383 × 10 −3 W/cm 2 , 2.186 × 10 −3 W/cm 2 , 1.561 × 10 −3 W/cm 2 .\n\nFig. 7 .\n7Estimated P-V curves of the solar panel under various light irradiance levels. Star: maximum power point. From top to bottom, the light irradiance levels are: 1.184 × 10 −2 W/cm 2 , 8.291 × 10 −3 W/cm 2 , 5.922 × 10 −3 W/cm 2 , 4.401 × 10 −3 W/cm 2 , 3.383 × 10 −3 W/cm 2 , 2.186 × 10 −3 W/cm 2 , 1.561 × 10 −3 W/cm 2 .\n\nFig. 8 .\n8Frequency response of the communication circuit for various values of R C . Marker: Measurement; line: Fitting. (a) C 0 = 1 µF. (b) C 0 = 100 nF.\n\nFig. 9 .\n9Frequency response of the solar panel for both energy harvesting and communication, with various values of inductor L 0 . The other relevant parameters are set to R L = 1000 Ω, R C = 500 Ω. (a) C 0 = 1 µF. (b) C 0 = 100 nF.\n\nFig. 10 .\n10Experimental setup.\n\nFig. 11 .\n11Predicted channel gain vs. experimentally estimated channel gain for different values of the resistor R C . (a) Theoretically predicted channel gain. (b) Experimentally estimated channel gain.\n\nFig. 12 .\n12Theoretical estimation of the different thermal noise components in the receiver system. (a) Thermal noise PSD. (b) Thermal noise LRC gain.\n\nFig. 13 .\n13Experimental SNR estimation for OFDM using Estimator I and Estimator II. (a) Estimated channel. (b) Estimated SNR.\n\nFig. 14 .\n14Maximum experimentally achieved data rate.\nIn this calculation, it is assumed that the relationship between incident light and generated electrical current is linear. In reality, this is not entirely true and leads to the non-linear distortion put forward in the rest of this subsection. Furthermore, it is assumed that the DC component of the received light (due to the information signal and due to ambient light) is much stronger than the AC components where the information is encoded. If this is not true, then the shot noise would be correlated to the information signal, but for a large number of received photons in intensity modulation/direct detection systems its effect on the system performance is likely to be insignificant.\nHis main research interests are in optical wireless communications, hybrid optical wireless and RF communications, spatial modulation, and interference coordination in wireless networks. He first introduced and coined spatial modulation and \"Li-Fi.\" Li-Fi was listed among the 50 best inventions in TIME Magazine 2011. He was an invited speaker at TED Global 2011, and his talk has been watched online more than 1.5 million times. He is co-founder and chief scientific officer (CSO) of pureLiFi Ltd. He holds 31 patents and has more than 30 pending patent applications. He has published 300 conference and journal papers including a paper in Science. He was co-recipient of a best paper award at the IEEE Vehicular Technology Conference in Las Vegas in 2013. In 2012, he was the only recipient of the prestigious Established Career Fellowship from the Engineering and Physical Sciences Research Council (EPSRC) within Information and Communications Technology in the U.K. Dr. Haas is recipient of the Tam Dalyell Prize 2013 awarded by the University of Edinburgh for excellence in engaging the public with science. In 2014, he was selected by EPSRC as one of ten Recognising Inspirational Scientists and Engineers (RISE) Leaders in the U.K.\nGlobal mobile data traffic forecast update. San Cisco, Francisco, Usa Ca, White Paper, Cisco Visual Networking Index.Cisco Visual Networking Index. (2014, Feb.). Global mobile data traffic forecast update, 2012-2019, CISCO, San Francisco, CA, USA, White Paper. [Online]. Available: http://www.cisco.com/c/en/us/ solutions/collateral/service-provider/visual-networking-index-vni/ white_paper_c11-520862.pdf\n\nLight-comm. F Mims, Elem. Electron. F. Mims, \"Light-comm,\" Elem. Electron., pp. 29-95, May/Jun. 1972.\n\nIndoor optical wireless communication: Potential and state-of-the-art. H Elgala, R Mesleh, H Haas, IEEE Commun. Mag. 499H. Elgala, R. Mesleh, and H. Haas, \"Indoor optical wireless communica- tion: Potential and state-of-the-art,\" IEEE Commun. Mag., vol. 49, no. 9, pp. 56-62, Sep. 2011.\n\n1-Gb/s transmission over a phosphorescent white LED by using rateadaptive discrete multitone modulation. A M Khalid, G Cossu, R Corsini, P Choudhury, E Ciaramella, IEEE Photon. J. 45A. M. Khalid, G. Cossu, R. Corsini, P. Choudhury, and E. Ciaramella, \"1-Gb/s transmission over a phosphorescent white LED by using rate- adaptive discrete multitone modulation,\" IEEE Photon. J., vol. 4, no. 5, pp. 1465-1473, Oct. 2012.\n\n513 Mbit/s visible light communications link based on DMT-modulation of a white LED. J Vucic, C Kottke, S Nerreter, K.-D Langer, J Walewski, J. Lightw. Technol. 2824J. Vucic, C. Kottke, S. Nerreter, K.-D. Langer, and J. Walewski, \"513 Mbit/s visible light communications link based on DMT-modulation of a white LED,\" J. Lightw. Technol., vol. 28, no. 24, pp. 3512-3518, Dec. 2010.\n\n803 Mbit/s visible light WDM link based on DMT modulation of a single RGB LED luminary. J Vucic, C Kottke, K Habel, K.-D Langer, Proc. OFC/NFOEC. OFC/NFOECJ. Vucic, C. Kottke, K. Habel, and K.-D. Langer, \"803 Mbit/s visible light WDM link based on DMT modulation of a single RGB LED luminary,\" in Proc. OFC/NFOEC, 2011, pp. 1-3.\n\n3.4 Gbit/s visible optical wireless transmission based on RGB LED. G Cossu, A M Khalid, P Choudhury, R Corsini, E Ciaramella, Opt. Exp. 2026G. Cossu, A. M. Khalid, P. Choudhury, R. Corsini, and E. Ciaramella, \"3.4 Gbit/s visible optical wireless transmission based on RGB LED,\" Opt. Exp., vol. 20, no. 26, pp. B501-B506, Dec. 2012.\n\nA 3-gb/s single-led ofdm-based wireless vlc link using a gallium nitride µled. D Tsonev, IEEE Photon. Technol. Lett. 267D. Tsonev et al., \"A 3-gb/s single-led ofdm-based wireless vlc link using a gallium nitride µled,\" IEEE Photon. Technol. Lett., vol. 26, no. 7, pp. 637- 640, Apr. 2014.\n\nProspects of nanotechnology for high-efficiency solar cells. A Dutta, Proc. 7th ICECE. 7th ICECEA. Dutta, \"Prospects of nanotechnology for high-efficiency solar cells,\" in Proc. 7th ICECE, 2012, pp. 347-350.\n\nP J Reddy, Science & Technology of Photovoltaics. Leiden, The NetherlandsCRC Press2nd ed.P. J. Reddy, Science & Technology of Photovoltaics, 2nd ed. Leiden, The Netherlands: CRC Press, 2010.\n\nNanotechnology in the development of photovoltaic cells. T K Manna, S Mahajan, Proc. ICCEP. ICCEPT. K. Manna and S. Mahajan, \"Nanotechnology in the development of photovoltaic cells,\" in Proc. ICCEP, 2007, pp. 379-386.\n\nThird generation photovoltaics: Ultra-high conversion efficiency at low cost. M A Green, Progr. Photovolt., Res. Appl. 92M. A. Green, \"Third generation photovoltaics: Ultra-high conversion efficiency at low cost,\" Progr. Photovolt., Res. Appl., vol. 9, no. 2, pp. 123- 135, Mar./Apr. 2001.\n\nSolar photovoltaic electricity: Current status and future prospects. T Razykov, Sol. Energy. 858T. Razykov et al., \"Solar photovoltaic electricity: Current status and future prospects,\" Sol. Energy, vol. 85, no. 8, pp. 1580-1608, Aug. 2011.\n\nSolar cell generations over 40% efficiency. R R King, Progr. Photovolt, Res. Appl. 206R. R. King et al., \"Solar cell generations over 40% efficiency,\" Progr. Photovolt, Res. Appl., vol. 20, no. 6, pp. 801-815, Sep. 2012.\n\nSolar cell efficiency tables (version 37). M A Green, K Emery, Y Hishikawa, W Warta, Progr. Photovolt, Res. Appl. 191M. A. Green, K. Emery, Y. Hishikawa, and W. Warta, \"Solar cell ef- ficiency tables (version 37),\" Progr. Photovolt, Res. Appl., vol. 19, no. 1, pp. 84-92, Jan. 2011.\n\nTransporting information and energy simultaneously. L Varshney, Proc. IEEE ISIT. IEEE ISITL. Varshney, \"Transporting information and energy simultaneously,\" in Proc. IEEE ISIT, 2008, pp. 1612-1616.\n\nWireless information and power transfer: A dynamic power splitting approach. L Liu, R Zhang, K.-C Chua, IEEE Trans. Commun. 619L. Liu, R. Zhang, and K.-C. Chua, \"Wireless information and power transfer: A dynamic power splitting approach,\" IEEE Trans. Commun., vol. 61, no. 9, pp. 3990-4001, Sep. 2013.\n\nAchievable throughput of energy harvesting cognitive radio networks. S Park, D Hong, IEEE Trans. Wireless Commun. 132S. Park and D. Hong, \"Achievable throughput of energy harvesting cog- nitive radio networks,\" IEEE Trans. Wireless Commun., vol. 13, no. 2, pp. 1010-1022, Feb. 2014.\n\nMimo broadcasting for simultaneous wireless information and power transfer. R Zhang, C K Ho, IEEE Trans. Wireless Commun. 125R. Zhang and C. K. Ho, \"Mimo broadcasting for simultaneous wireless information and power transfer,\" IEEE Trans. Wireless Commun., vol. 12, no. 5, pp. 1989-2001, May 2013.\n\nAnalysis of performance degradation in CdS solar cells. K L Kennerud, IEEE Trans. Aerosp. Electron. Syst. 6K. L. Kennerud, \"Analysis of performance degradation in CdS solar cells,\" IEEE Trans. Aerosp. Electron. Syst., vol. AES-5, no. 6, pp. 912-917, Nov. 1969.\n\nPV panel model based on datasheet values. D Sera, R Teodorescu, P Rodriguez, Proc. IEEE ISIE. IEEE ISIED. Sera, R. Teodorescu, and P. Rodriguez, \"PV panel model based on datasheet values,\" in Proc. IEEE ISIE, 2007, pp. 2392-2396.\n\nAccurate analytical method for the extraction of solar cell model parameters. J C H Phang, D S H Chan, J R Phillips, Electron. Lett. 2010J. C. H. Phang, D. S. H. Chan, and J. R. Phillips, \"Accurate analytical method for the extraction of solar cell model parameters,\" Electron. Lett., vol. 20, no. 10, pp. 406-408, May 1984.\n\nCharacterization and testing of a tool for photovoltaic panel modeling. F Adamo, F Attivissimo, A Di Nisio, M Spadavecchia, IEEE Trans. Instrum. Meas. 605F. Adamo, F. Attivissimo, A. Di Nisio, and M. Spadavecchia, \"Characteri- zation and testing of a tool for photovoltaic panel modeling,\" IEEE Trans. Instrum. Meas., vol. 60, no. 5, pp. 1613-1622, May 2011.\n\nFrequency domain characterization of a solar cell. M A Stosovic, D Lukac, I Litovski, V Litovski, Proc. 11th Symp. NEUREL. 11th Symp. NEURELM. A. Stosovic, D. Lukac, I. Litovski, and V. Litovski, \"Frequency domain characterization of a solar cell,\" in Proc. 11th Symp. NEUREL, Sep. 2012, pp. 259-264.\n\nCapacitance measurements on multi-junction solar cells. P Rueda, E F Lisbona, M Diez Herrero, Proc. 3rd World Conf. Photovolt. Energy Convers. 3rd World Conf. Photovolt. Energy Convers1P. Rueda, E. F. Lisbona, and M. Diez Herrero, \"Capacitance measure- ments on multi-junction solar cells,\" in Proc. 3rd World Conf. Photovolt. Energy Convers., May 2003, vol. 1, pp. 817-820.\n\nWireless infrared communications. J M Kahn, J R Barry, Proc. IEEE. 852J. M. Kahn and J. R. Barry, \"Wireless infrared communications,\" Proc. IEEE, vol. 85, no. 2, pp. 265-298, Feb. 1997.\n\nFundamental analysis for visiblelight communication system using LED lights. T Komine, M Nakagawa, IEEE Trans. Consum. Electron. 501T. Komine and M. Nakagawa, \"Fundamental analysis for visible- light communication system using LED lights,\" IEEE Trans. Consum. Electron., vol. 50, no. 1, pp. 100-107, Feb. 2004.\n\nImprovement of date rate by using equalization in an indoor visible light communication system. L Zeng, Proc. 4th IEEE ICCSC. 4th IEEE ICCSCL. Zeng et al., \"Improvement of date rate by using equalization in an indoor visible light communication system,\" in Proc. 4th IEEE ICCSC, 2008, pp. 678-682.\n\nInformation rate of OFDM-based optical wireless communication systems with nonlinear distortion. S Dimitrov, H Haas, J. Lightw. Technol. 316S. Dimitrov and H. Haas, \"Information rate of OFDM-based optical wireless communication systems with nonlinear distortion,\" J. Lightw. Technol., vol. 31, no. 6, pp. 918-929, Mar. 2013.\n\nComplete modeling of nonlinear distortion in OFDM-based optical wireless communication. D Tsonev, S Sinanovic, H Haas, J. Lightw. Technol. 3118D. Tsonev, S. Sinanovic, and H. Haas, \"Complete modeling of nonlinear distortion in OFDM-based optical wireless communication,\" J. Lightw. Technol., vol. 31, no. 18, pp. 3064-3076, Sep. 15, 2013.\n\nA complete and optimal data allocation method for practical discrete multitone systems. H E Levin, Proc. IEEE Global Telecommun. Conf. IEEE Global Telecommun. ConfSan Antonio, TX, USA1H. E. Levin, \"A complete and optimal data allocation method for practical discrete multitone systems,\" in Proc. IEEE Global Telecommun. Conf., San Antonio, TX, USA, Nov. 25-29, 2001, vol. 1, pp. 369-374.\n\nForward error correction for high bit-rate DWDM submarine systems. Itu-T, Geneva, SwitzerlandITUTech. RepITU-T. (2004). Forward error correction for high bit-rate DWDM sub- marine systems, ITU, Geneva, Switzerland, Tech. Rep. ITU-T G.975.1, Retrieved Nov. 19, 2013. [Online]. Available: http://www.itu.int/rec/ T-REC-G.975.1-200402-I/en\n\nHis research interests includes free-space optical (FSO) communications. Zixiong Wang (S'09-M'13) received the B.Eng. and M.Eng. degrees in electronic information engineering from Tianjin University. Tianjin, China; Singapore; Edinburgh, United KingdomCenter at the University of EdinburghIn the same year, he joined the Li-Fi R&D. visible light communications (VLC) and photonicsZixiong Wang (S'09-M'13) received the B.Eng. and M.Eng. degrees in electronic information engi- neering from Tianjin University, Tianjin, China, in 2006 and 2008, respectively, and the Ph.D. degree in optical communication from Nanyang Technological University, Singapore, in 2013. In the same year, he joined the Li-Fi R&D Center at the University of Edinburgh, Edinburgh, United Kingdom. His re- search interests includes free-space optical (FSO) communications, visible light communications (VLC) and photonics.\n", "annotations": {"author": "[{\"end\":151,\"start\":126},{\"end\":181,\"start\":152},{\"end\":195,\"start\":182},{\"end\":220,\"start\":196}]", "publisher": null, "author_last_name": "[{\"end\":150,\"start\":146},{\"end\":180,\"start\":174},{\"end\":194,\"start\":189},{\"end\":219,\"start\":215}]", "author_first_name": "[{\"end\":145,\"start\":138},{\"end\":173,\"start\":164},{\"end\":188,\"start\":182},{\"end\":214,\"start\":208}]", "author_affiliation": null, "title": "[{\"end\":112,\"start\":1},{\"end\":332,\"start\":221}]", "venue": "[{\"end\":382,\"start\":334}]", "abstract": "[{\"end\":1722,\"start\":427}]", "bib_ref": "[{\"attributes\":{\"ref_id\":\"b3\"},\"end\":1731,\"start\":1728},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":1736,\"start\":1733},{\"attributes\":{\"ref_id\":\"b5\"},\"end\":1871,\"start\":1868},{\"attributes\":{\"ref_id\":\"b6\"},\"end\":1876,\"start\":1873},{\"attributes\":{\"ref_id\":\"b3\"},\"end\":2295,\"start\":2292},{\"attributes\":{\"ref_id\":\"b6\"},\"end\":2569,\"start\":2566},{\"end\":2623,\"start\":2610},{\"attributes\":{\"ref_id\":\"b7\"},\"end\":2780,\"start\":2777},{\"attributes\":{\"ref_id\":\"b8\"},\"end\":3816,\"start\":3813},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":3822,\"start\":3818},{\"attributes\":{\"ref_id\":\"b8\"},\"end\":4042,\"start\":4039},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":4048,\"start\":4044},{\"attributes\":{\"ref_id\":\"b11\"},\"end\":4205,\"start\":4201},{\"attributes\":{\"ref_id\":\"b11\"},\"end\":4332,\"start\":4328},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":4338,\"start\":4334},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":4536,\"start\":4532},{\"attributes\":{\"ref_id\":\"b17\"},\"end\":4542,\"start\":4538},{\"attributes\":{\"ref_id\":\"b18\"},\"end\":4820,\"start\":4816},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":6768,\"start\":6764},{\"attributes\":{\"ref_id\":\"b19\"},\"end\":6774,\"start\":6770},{\"attributes\":{\"ref_id\":\"b22\"},\"end\":6780,\"start\":6776},{\"attributes\":{\"ref_id\":\"b22\"},\"end\":7237,\"start\":7233},{\"attributes\":{\"ref_id\":\"b20\"},\"end\":7561,\"start\":7557},{\"attributes\":{\"ref_id\":\"b20\"},\"end\":7782,\"start\":7778},{\"attributes\":{\"ref_id\":\"b23\"},\"end\":8802,\"start\":8798},{\"attributes\":{\"ref_id\":\"b24\"},\"end\":8808,\"start\":8804},{\"attributes\":{\"ref_id\":\"b25\"},\"end\":11936,\"start\":11932},{\"attributes\":{\"ref_id\":\"b5\"},\"end\":12478,\"start\":12475},{\"attributes\":{\"ref_id\":\"b25\"},\"end\":12560,\"start\":12556},{\"attributes\":{\"ref_id\":\"b0\"},\"end\":12826,\"start\":12825},{\"attributes\":{\"ref_id\":\"b25\"},\"end\":13275,\"start\":13271},{\"attributes\":{\"ref_id\":\"b18\"},\"end\":16136,\"start\":16132},{\"attributes\":{\"ref_id\":\"b25\"},\"end\":17874,\"start\":17870},{\"attributes\":{\"ref_id\":\"b27\"},\"end\":17880,\"start\":17876},{\"attributes\":{\"ref_id\":\"b19\"},\"end\":18378,\"start\":18374},{\"attributes\":{\"ref_id\":\"b20\"},\"end\":19855,\"start\":19851},{\"attributes\":{\"ref_id\":\"b5\"},\"end\":24919,\"start\":24916},{\"attributes\":{\"ref_id\":\"b28\"},\"end\":27975,\"start\":27971},{\"attributes\":{\"ref_id\":\"b28\"},\"end\":28242,\"start\":28238},{\"attributes\":{\"ref_id\":\"b29\"},\"end\":28248,\"start\":28244},{\"attributes\":{\"ref_id\":\"b28\"},\"end\":32197,\"start\":32193},{\"attributes\":{\"ref_id\":\"b29\"},\"end\":32203,\"start\":32199},{\"attributes\":{\"ref_id\":\"b24\"},\"end\":32950,\"start\":32946},{\"attributes\":{\"ref_id\":\"b24\"},\"end\":34024,\"start\":34020},{\"attributes\":{\"ref_id\":\"b7\"},\"end\":36489,\"start\":36486},{\"attributes\":{\"ref_id\":\"b18\"},\"end\":37412,\"start\":37408},{\"attributes\":{\"ref_id\":\"b18\"},\"end\":38720,\"start\":38716},{\"attributes\":{\"ref_id\":\"b30\"},\"end\":41354,\"start\":41350},{\"attributes\":{\"ref_id\":\"b31\"},\"end\":42177,\"start\":42173}]", "figure": "[{\"attributes\":{\"id\":\"fig_0\"},\"end\":44428,\"start\":44377},{\"attributes\":{\"id\":\"fig_1\"},\"end\":44476,\"start\":44429},{\"attributes\":{\"id\":\"fig_2\"},\"end\":44567,\"start\":44477},{\"attributes\":{\"id\":\"fig_3\"},\"end\":44910,\"start\":44568},{\"attributes\":{\"id\":\"fig_4\"},\"end\":45472,\"start\":44911},{\"attributes\":{\"id\":\"fig_5\"},\"end\":45779,\"start\":45473},{\"attributes\":{\"id\":\"fig_6\"},\"end\":46110,\"start\":45780},{\"attributes\":{\"id\":\"fig_7\"},\"end\":46267,\"start\":46111},{\"attributes\":{\"id\":\"fig_8\"},\"end\":46502,\"start\":46268},{\"attributes\":{\"id\":\"fig_9\"},\"end\":46535,\"start\":46503},{\"attributes\":{\"id\":\"fig_10\"},\"end\":46741,\"start\":46536},{\"attributes\":{\"id\":\"fig_11\"},\"end\":46894,\"start\":46742},{\"attributes\":{\"id\":\"fig_12\"},\"end\":47022,\"start\":46895},{\"attributes\":{\"id\":\"fig_13\"},\"end\":47078,\"start\":47023}]", "paragraph": "[{\"end\":2885,\"start\":1724},{\"end\":3743,\"start\":2887},{\"end\":4920,\"start\":3745},{\"end\":6093,\"start\":4922},{\"end\":6505,\"start\":6095},{\"end\":7349,\"start\":6654},{\"end\":7635,\"start\":7431},{\"end\":8040,\"start\":7653},{\"end\":9191,\"start\":8085},{\"end\":9372,\"start\":9256},{\"end\":9604,\"start\":9410},{\"end\":10369,\"start\":9684},{\"end\":10571,\"start\":10474},{\"end\":11132,\"start\":10616},{\"end\":11668,\"start\":11154},{\"end\":12561,\"start\":11670},{\"end\":13276,\"start\":12583},{\"end\":13641,\"start\":13302},{\"end\":13739,\"start\":13734},{\"end\":14040,\"start\":13800},{\"end\":14176,\"start\":14070},{\"end\":14306,\"start\":14301},{\"end\":14626,\"start\":14399},{\"end\":14759,\"start\":14654},{\"end\":14857,\"start\":14852},{\"end\":15183,\"start\":14958},{\"end\":15311,\"start\":15206},{\"end\":15423,\"start\":15418},{\"end\":15743,\"start\":15516},{\"end\":15876,\"start\":15771},{\"end\":15980,\"start\":15975},{\"end\":16782,\"start\":16059},{\"end\":17940,\"start\":16994},{\"end\":18505,\"start\":17981},{\"end\":19594,\"start\":18533},{\"end\":20126,\"start\":19596},{\"end\":20885,\"start\":20156},{\"end\":21865,\"start\":20887},{\"end\":22962,\"start\":21867},{\"end\":24131,\"start\":22964},{\"end\":24694,\"start\":24133},{\"end\":25447,\"start\":24792},{\"end\":26111,\"start\":25449},{\"end\":27560,\"start\":26141},{\"end\":28609,\"start\":27562},{\"end\":28853,\"start\":28611},{\"end\":29276,\"start\":28913},{\"end\":30484,\"start\":29322},{\"end\":30633,\"start\":30530},{\"end\":32427,\"start\":30699},{\"end\":33548,\"start\":32560},{\"end\":35467,\"start\":33657},{\"end\":35705,\"start\":35469},{\"end\":39390,\"start\":35707},{\"end\":40764,\"start\":39392},{\"end\":42924,\"start\":40766},{\"end\":44376,\"start\":42942}]", "formula": "[{\"attributes\":{\"id\":\"formula_0\"},\"end\":7388,\"start\":7350},{\"attributes\":{\"id\":\"formula_1\"},\"end\":7430,\"start\":7388},{\"attributes\":{\"id\":\"formula_2\"},\"end\":7652,\"start\":7636},{\"attributes\":{\"id\":\"formula_3\"},\"end\":9255,\"start\":9192},{\"attributes\":{\"id\":\"formula_4\"},\"end\":9409,\"start\":9373},{\"attributes\":{\"id\":\"formula_5\"},\"end\":10473,\"start\":10370},{\"attributes\":{\"id\":\"formula_6\"},\"end\":10615,\"start\":10572},{\"attributes\":{\"id\":\"formula_7\"},\"end\":12582,\"start\":12562},{\"attributes\":{\"id\":\"formula_8\"},\"end\":13301,\"start\":13277},{\"attributes\":{\"id\":\"formula_9\"},\"end\":13733,\"start\":13642},{\"attributes\":{\"id\":\"formula_10\"},\"end\":13799,\"start\":13740},{\"attributes\":{\"id\":\"formula_11\"},\"end\":14069,\"start\":14041},{\"attributes\":{\"id\":\"formula_12\"},\"end\":14300,\"start\":14177},{\"attributes\":{\"id\":\"formula_13\"},\"end\":14398,\"start\":14307},{\"attributes\":{\"id\":\"formula_14\"},\"end\":14653,\"start\":14627},{\"attributes\":{\"id\":\"formula_15\"},\"end\":14851,\"start\":14760},{\"attributes\":{\"id\":\"formula_16\"},\"end\":14957,\"start\":14858},{\"attributes\":{\"id\":\"formula_17\"},\"end\":15205,\"start\":15184},{\"attributes\":{\"id\":\"formula_18\"},\"end\":15417,\"start\":15312},{\"attributes\":{\"id\":\"formula_19\"},\"end\":15515,\"start\":15424},{\"attributes\":{\"id\":\"formula_20\"},\"end\":15770,\"start\":15744},{\"attributes\":{\"id\":\"formula_21\"},\"end\":15974,\"start\":15877},{\"attributes\":{\"id\":\"formula_22\"},\"end\":16058,\"start\":15981},{\"attributes\":{\"id\":\"formula_23\"},\"end\":16928,\"start\":16783},{\"attributes\":{\"id\":\"formula_24\"},\"end\":17980,\"start\":17941},{\"attributes\":{\"id\":\"formula_25\"},\"end\":18532,\"start\":18506},{\"attributes\":{\"id\":\"formula_26\"},\"end\":28912,\"start\":28854},{\"attributes\":{\"id\":\"formula_27\"},\"end\":29321,\"start\":29277},{\"attributes\":{\"id\":\"formula_28\"},\"end\":30529,\"start\":30485},{\"attributes\":{\"id\":\"formula_29\"},\"end\":30698,\"start\":30634},{\"attributes\":{\"id\":\"formula_30\"},\"end\":32475,\"start\":32428},{\"attributes\":{\"id\":\"formula_31\"},\"end\":32559,\"start\":32475},{\"attributes\":{\"id\":\"formula_32\"},\"end\":33656,\"start\":33549}]", "table_ref": null, "section_header": "[{\"end\":6605,\"start\":6508},{\"end\":6652,\"start\":6608},{\"end\":8083,\"start\":8043},{\"end\":9682,\"start\":9607},{\"end\":11152,\"start\":11135},{\"end\":16966,\"start\":16930},{\"end\":16992,\"start\":16969},{\"end\":20154,\"start\":20129},{\"end\":24790,\"start\":24697},{\"end\":26139,\"start\":26114},{\"end\":42940,\"start\":42927},{\"end\":44386,\"start\":44378},{\"end\":44438,\"start\":44430},{\"end\":44486,\"start\":44478},{\"end\":44577,\"start\":44569},{\"end\":44920,\"start\":44912},{\"end\":45482,\"start\":45474},{\"end\":45789,\"start\":45781},{\"end\":46120,\"start\":46112},{\"end\":46277,\"start\":46269},{\"end\":46513,\"start\":46504},{\"end\":46546,\"start\":46537},{\"end\":46752,\"start\":46743},{\"end\":46905,\"start\":46896},{\"end\":47033,\"start\":47024}]", "table": null, "figure_caption": "[{\"end\":44428,\"start\":44388},{\"end\":44476,\"start\":44440},{\"end\":44567,\"start\":44488},{\"end\":44910,\"start\":44579},{\"end\":45472,\"start\":44922},{\"end\":45779,\"start\":45484},{\"end\":46110,\"start\":45791},{\"end\":46267,\"start\":46122},{\"end\":46502,\"start\":46279},{\"end\":46535,\"start\":46516},{\"end\":46741,\"start\":46549},{\"end\":46894,\"start\":46755},{\"end\":47022,\"start\":46908},{\"end\":47078,\"start\":47036}]", "figure_ref": "[{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":6835,\"start\":6829},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":7264,\"start\":7258},{\"attributes\":{\"ref_id\":\"fig_1\"},\"end\":8311,\"start\":8305},{\"attributes\":{\"ref_id\":\"fig_2\"},\"end\":9812,\"start\":9806},{\"attributes\":{\"ref_id\":\"fig_2\"},\"end\":10346,\"start\":10340},{\"attributes\":{\"ref_id\":\"fig_2\"},\"end\":11991,\"start\":11985},{\"attributes\":{\"ref_id\":\"fig_2\"},\"end\":12921,\"start\":12915},{\"attributes\":{\"ref_id\":\"fig_2\"},\"end\":13160,\"start\":13154},{\"attributes\":{\"ref_id\":\"fig_3\"},\"end\":13183,\"start\":13177},{\"attributes\":{\"ref_id\":\"fig_3\"},\"end\":13951,\"start\":13945},{\"attributes\":{\"ref_id\":\"fig_3\"},\"end\":14538,\"start\":14532},{\"attributes\":{\"ref_id\":\"fig_3\"},\"end\":15095,\"start\":15089},{\"attributes\":{\"ref_id\":\"fig_3\"},\"end\":15655,\"start\":15649},{\"attributes\":{\"ref_id\":\"fig_4\"},\"end\":19017,\"start\":19011},{\"attributes\":{\"ref_id\":\"fig_4\"},\"end\":19389,\"start\":19383},{\"attributes\":{\"ref_id\":\"fig_4\"},\"end\":19512,\"start\":19506},{\"attributes\":{\"ref_id\":\"fig_2\"},\"end\":20175,\"start\":20169},{\"attributes\":{\"ref_id\":\"fig_1\"},\"end\":20741,\"start\":20735},{\"attributes\":{\"ref_id\":\"fig_5\"},\"end\":21033,\"start\":21027},{\"attributes\":{\"ref_id\":\"fig_6\"},\"end\":22073,\"start\":22067},{\"attributes\":{\"ref_id\":\"fig_6\"},\"end\":22259,\"start\":22253},{\"attributes\":{\"ref_id\":\"fig_1\"},\"end\":23039,\"start\":23033},{\"attributes\":{\"ref_id\":\"fig_7\"},\"end\":23623,\"start\":23617},{\"attributes\":{\"ref_id\":\"fig_7\"},\"end\":23817,\"start\":23808},{\"attributes\":{\"ref_id\":\"fig_2\"},\"end\":24871,\"start\":24865},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":25446,\"start\":25440},{\"attributes\":{\"ref_id\":\"fig_8\"},\"end\":25592,\"start\":25586},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":26356,\"start\":26349},{\"attributes\":{\"ref_id\":\"fig_2\"},\"end\":27045,\"start\":27039},{\"attributes\":{\"ref_id\":\"fig_2\"},\"end\":29665,\"start\":29659},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":34613,\"start\":34606},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":35127,\"start\":35120},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":35645,\"start\":35635},{\"attributes\":{\"ref_id\":\"fig_5\"},\"end\":35744,\"start\":35738},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":35791,\"start\":35785},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":37687,\"start\":37680},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":37842,\"start\":37835},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":38131,\"start\":38121},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":39389,\"start\":39379},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":39466,\"start\":39456},{\"end\":41661,\"start\":41657}]", "bib_author_first_name": "[{\"end\":49062,\"start\":49059},{\"end\":49084,\"start\":49081},{\"end\":49094,\"start\":49089},{\"end\":49435,\"start\":49434},{\"end\":49597,\"start\":49596},{\"end\":49607,\"start\":49606},{\"end\":49617,\"start\":49616},{\"end\":49919,\"start\":49918},{\"end\":49921,\"start\":49920},{\"end\":49931,\"start\":49930},{\"end\":49940,\"start\":49939},{\"end\":49951,\"start\":49950},{\"end\":49964,\"start\":49963},{\"end\":50318,\"start\":50317},{\"end\":50327,\"start\":50326},{\"end\":50337,\"start\":50336},{\"end\":50352,\"start\":50348},{\"end\":50362,\"start\":50361},{\"end\":50703,\"start\":50702},{\"end\":50712,\"start\":50711},{\"end\":50722,\"start\":50721},{\"end\":50734,\"start\":50730},{\"end\":51012,\"start\":51011},{\"end\":51021,\"start\":51020},{\"end\":51023,\"start\":51022},{\"end\":51033,\"start\":51032},{\"end\":51046,\"start\":51045},{\"end\":51057,\"start\":51056},{\"end\":51357,\"start\":51356},{\"end\":51629,\"start\":51628},{\"end\":51777,\"start\":51776},{\"end\":51779,\"start\":51778},{\"end\":52026,\"start\":52025},{\"end\":52028,\"start\":52027},{\"end\":52037,\"start\":52036},{\"end\":52267,\"start\":52266},{\"end\":52269,\"start\":52268},{\"end\":52549,\"start\":52548},{\"end\":52766,\"start\":52765},{\"end\":52768,\"start\":52767},{\"end\":52987,\"start\":52986},{\"end\":52989,\"start\":52988},{\"end\":52998,\"start\":52997},{\"end\":53007,\"start\":53006},{\"end\":53020,\"start\":53019},{\"end\":53280,\"start\":53279},{\"end\":53504,\"start\":53503},{\"end\":53511,\"start\":53510},{\"end\":53523,\"start\":53519},{\"end\":53800,\"start\":53799},{\"end\":53808,\"start\":53807},{\"end\":54091,\"start\":54090},{\"end\":54100,\"start\":54099},{\"end\":54102,\"start\":54101},{\"end\":54369,\"start\":54368},{\"end\":54371,\"start\":54370},{\"end\":54617,\"start\":54616},{\"end\":54625,\"start\":54624},{\"end\":54639,\"start\":54638},{\"end\":54884,\"start\":54883},{\"end\":54888,\"start\":54885},{\"end\":54897,\"start\":54896},{\"end\":54901,\"start\":54898},{\"end\":54909,\"start\":54908},{\"end\":54911,\"start\":54910},{\"end\":55204,\"start\":55203},{\"end\":55213,\"start\":55212},{\"end\":55228,\"start\":55227},{\"end\":55231,\"start\":55229},{\"end\":55240,\"start\":55239},{\"end\":55543,\"start\":55542},{\"end\":55545,\"start\":55544},{\"end\":55557,\"start\":55556},{\"end\":55566,\"start\":55565},{\"end\":55578,\"start\":55577},{\"end\":55850,\"start\":55849},{\"end\":55859,\"start\":55858},{\"end\":55861,\"start\":55860},{\"end\":55872,\"start\":55871},{\"end\":55877,\"start\":55873},{\"end\":56204,\"start\":56203},{\"end\":56206,\"start\":56205},{\"end\":56214,\"start\":56213},{\"end\":56216,\"start\":56215},{\"end\":56434,\"start\":56433},{\"end\":56444,\"start\":56443},{\"end\":56765,\"start\":56764},{\"end\":57065,\"start\":57064},{\"end\":57077,\"start\":57076},{\"end\":57382,\"start\":57381},{\"end\":57392,\"start\":57391},{\"end\":57405,\"start\":57404},{\"end\":57722,\"start\":57721},{\"end\":57724,\"start\":57723}]", "bib_author_last_name": "[{\"end\":49068,\"start\":49063},{\"end\":49079,\"start\":49070},{\"end\":49087,\"start\":49085},{\"end\":49100,\"start\":49095},{\"end\":49440,\"start\":49436},{\"end\":49604,\"start\":49598},{\"end\":49614,\"start\":49608},{\"end\":49622,\"start\":49618},{\"end\":49928,\"start\":49922},{\"end\":49937,\"start\":49932},{\"end\":49948,\"start\":49941},{\"end\":49961,\"start\":49952},{\"end\":49975,\"start\":49965},{\"end\":50324,\"start\":50319},{\"end\":50334,\"start\":50328},{\"end\":50346,\"start\":50338},{\"end\":50359,\"start\":50353},{\"end\":50371,\"start\":50363},{\"end\":50709,\"start\":50704},{\"end\":50719,\"start\":50713},{\"end\":50728,\"start\":50723},{\"end\":50741,\"start\":50735},{\"end\":51018,\"start\":51013},{\"end\":51030,\"start\":51024},{\"end\":51043,\"start\":51034},{\"end\":51054,\"start\":51047},{\"end\":51068,\"start\":51058},{\"end\":51364,\"start\":51358},{\"end\":51635,\"start\":51630},{\"end\":51785,\"start\":51780},{\"end\":52034,\"start\":52029},{\"end\":52045,\"start\":52038},{\"end\":52275,\"start\":52270},{\"end\":52557,\"start\":52550},{\"end\":52773,\"start\":52769},{\"end\":52995,\"start\":52990},{\"end\":53004,\"start\":52999},{\"end\":53017,\"start\":53008},{\"end\":53026,\"start\":53021},{\"end\":53289,\"start\":53281},{\"end\":53508,\"start\":53505},{\"end\":53517,\"start\":53512},{\"end\":53528,\"start\":53524},{\"end\":53805,\"start\":53801},{\"end\":53813,\"start\":53809},{\"end\":54097,\"start\":54092},{\"end\":54105,\"start\":54103},{\"end\":54380,\"start\":54372},{\"end\":54622,\"start\":54618},{\"end\":54636,\"start\":54626},{\"end\":54649,\"start\":54640},{\"end\":54894,\"start\":54889},{\"end\":54906,\"start\":54902},{\"end\":54920,\"start\":54912},{\"end\":55210,\"start\":55205},{\"end\":55225,\"start\":55214},{\"end\":55237,\"start\":55232},{\"end\":55253,\"start\":55241},{\"end\":55554,\"start\":55546},{\"end\":55563,\"start\":55558},{\"end\":55575,\"start\":55567},{\"end\":55587,\"start\":55579},{\"end\":55856,\"start\":55851},{\"end\":55869,\"start\":55862},{\"end\":55885,\"start\":55878},{\"end\":56211,\"start\":56207},{\"end\":56222,\"start\":56217},{\"end\":56441,\"start\":56435},{\"end\":56453,\"start\":56445},{\"end\":56770,\"start\":56766},{\"end\":57074,\"start\":57066},{\"end\":57082,\"start\":57078},{\"end\":57389,\"start\":57383},{\"end\":57402,\"start\":57393},{\"end\":57410,\"start\":57406},{\"end\":57730,\"start\":57725},{\"end\":58094,\"start\":58089}]", "bib_entry": "[{\"attributes\":{\"id\":\"b0\"},\"end\":49420,\"start\":49015},{\"attributes\":{\"id\":\"b1\"},\"end\":49523,\"start\":49422},{\"attributes\":{\"id\":\"b2\",\"matched_paper_id\":14744575},\"end\":49811,\"start\":49525},{\"attributes\":{\"id\":\"b3\",\"matched_paper_id\":29365337},\"end\":50230,\"start\":49813},{\"attributes\":{\"id\":\"b4\",\"matched_paper_id\":35629285},\"end\":50612,\"start\":50232},{\"attributes\":{\"id\":\"b5\",\"matched_paper_id\":29901222},\"end\":50942,\"start\":50614},{\"attributes\":{\"id\":\"b6\",\"matched_paper_id\":39939911},\"end\":51275,\"start\":50944},{\"attributes\":{\"id\":\"b7\",\"matched_paper_id\":1699959},\"end\":51565,\"start\":51277},{\"attributes\":{\"id\":\"b8\",\"matched_paper_id\":15616923},\"end\":51774,\"start\":51567},{\"attributes\":{\"id\":\"b9\"},\"end\":51966,\"start\":51776},{\"attributes\":{\"id\":\"b10\",\"matched_paper_id\":20134682},\"end\":52186,\"start\":51968},{\"attributes\":{\"id\":\"b11\",\"matched_paper_id\":97582910},\"end\":52477,\"start\":52188},{\"attributes\":{\"id\":\"b12\",\"matched_paper_id\":55540244},\"end\":52719,\"start\":52479},{\"attributes\":{\"id\":\"b13\",\"matched_paper_id\":93097528},\"end\":52941,\"start\":52721},{\"attributes\":{\"id\":\"b14\",\"matched_paper_id\":97915368},\"end\":53225,\"start\":52943},{\"attributes\":{\"id\":\"b15\",\"matched_paper_id\":60854},\"end\":53424,\"start\":53227},{\"attributes\":{\"id\":\"b16\",\"matched_paper_id\":7151441},\"end\":53728,\"start\":53426},{\"attributes\":{\"id\":\"b17\",\"matched_paper_id\":33072635},\"end\":54012,\"start\":53730},{\"attributes\":{\"id\":\"b18\",\"matched_paper_id\":15715298},\"end\":54310,\"start\":54014},{\"attributes\":{\"id\":\"b19\",\"matched_paper_id\":51675101},\"end\":54572,\"start\":54312},{\"attributes\":{\"id\":\"b20\",\"matched_paper_id\":24200348},\"end\":54803,\"start\":54574},{\"attributes\":{\"id\":\"b21\",\"matched_paper_id\":110830804},\"end\":55129,\"start\":54805},{\"attributes\":{\"id\":\"b22\",\"matched_paper_id\":5269508},\"end\":55489,\"start\":55131},{\"attributes\":{\"id\":\"b23\",\"matched_paper_id\":16087647},\"end\":55791,\"start\":55491},{\"attributes\":{\"id\":\"b24\",\"matched_paper_id\":97565079},\"end\":56167,\"start\":55793},{\"attributes\":{\"id\":\"b25\",\"matched_paper_id\":15806586},\"end\":56354,\"start\":56169},{\"attributes\":{\"id\":\"b26\",\"matched_paper_id\":206631525},\"end\":56666,\"start\":56356},{\"attributes\":{\"id\":\"b27\",\"matched_paper_id\":9088707},\"end\":56965,\"start\":56668},{\"attributes\":{\"id\":\"b28\",\"matched_paper_id\":14158040},\"end\":57291,\"start\":56967},{\"attributes\":{\"id\":\"b29\",\"matched_paper_id\":532295},\"end\":57631,\"start\":57293},{\"attributes\":{\"id\":\"b30\",\"matched_paper_id\":5998},\"end\":58020,\"start\":57633},{\"attributes\":{\"id\":\"b31\"},\"end\":58358,\"start\":58022},{\"attributes\":{\"id\":\"b32\"},\"end\":59254,\"start\":58360}]", "bib_title": "[{\"end\":49432,\"start\":49422},{\"end\":49594,\"start\":49525},{\"end\":49916,\"start\":49813},{\"end\":50315,\"start\":50232},{\"end\":50700,\"start\":50614},{\"end\":51009,\"start\":50944},{\"end\":51354,\"start\":51277},{\"end\":51626,\"start\":51567},{\"end\":52023,\"start\":51968},{\"end\":52264,\"start\":52188},{\"end\":52546,\"start\":52479},{\"end\":52763,\"start\":52721},{\"end\":52984,\"start\":52943},{\"end\":53277,\"start\":53227},{\"end\":53501,\"start\":53426},{\"end\":53797,\"start\":53730},{\"end\":54088,\"start\":54014},{\"end\":54366,\"start\":54312},{\"end\":54614,\"start\":54574},{\"end\":54881,\"start\":54805},{\"end\":55201,\"start\":55131},{\"end\":55540,\"start\":55491},{\"end\":55847,\"start\":55793},{\"end\":56201,\"start\":56169},{\"end\":56431,\"start\":56356},{\"end\":56762,\"start\":56668},{\"end\":57062,\"start\":56967},{\"end\":57379,\"start\":57293},{\"end\":57719,\"start\":57633},{\"end\":58431,\"start\":58360}]", "bib_author": "[{\"end\":49070,\"start\":49059},{\"end\":49081,\"start\":49070},{\"end\":49089,\"start\":49081},{\"end\":49102,\"start\":49089},{\"end\":49442,\"start\":49434},{\"end\":49606,\"start\":49596},{\"end\":49616,\"start\":49606},{\"end\":49624,\"start\":49616},{\"end\":49930,\"start\":49918},{\"end\":49939,\"start\":49930},{\"end\":49950,\"start\":49939},{\"end\":49963,\"start\":49950},{\"end\":49977,\"start\":49963},{\"end\":50326,\"start\":50317},{\"end\":50336,\"start\":50326},{\"end\":50348,\"start\":50336},{\"end\":50361,\"start\":50348},{\"end\":50373,\"start\":50361},{\"end\":50711,\"start\":50702},{\"end\":50721,\"start\":50711},{\"end\":50730,\"start\":50721},{\"end\":50743,\"start\":50730},{\"end\":51020,\"start\":51011},{\"end\":51032,\"start\":51020},{\"end\":51045,\"start\":51032},{\"end\":51056,\"start\":51045},{\"end\":51070,\"start\":51056},{\"end\":51366,\"start\":51356},{\"end\":51637,\"start\":51628},{\"end\":51787,\"start\":51776},{\"end\":52036,\"start\":52025},{\"end\":52047,\"start\":52036},{\"end\":52277,\"start\":52266},{\"end\":52559,\"start\":52548},{\"end\":52775,\"start\":52765},{\"end\":52997,\"start\":52986},{\"end\":53006,\"start\":52997},{\"end\":53019,\"start\":53006},{\"end\":53028,\"start\":53019},{\"end\":53291,\"start\":53279},{\"end\":53510,\"start\":53503},{\"end\":53519,\"start\":53510},{\"end\":53530,\"start\":53519},{\"end\":53807,\"start\":53799},{\"end\":53815,\"start\":53807},{\"end\":54099,\"start\":54090},{\"end\":54107,\"start\":54099},{\"end\":54382,\"start\":54368},{\"end\":54624,\"start\":54616},{\"end\":54638,\"start\":54624},{\"end\":54651,\"start\":54638},{\"end\":54896,\"start\":54883},{\"end\":54908,\"start\":54896},{\"end\":54922,\"start\":54908},{\"end\":55212,\"start\":55203},{\"end\":55227,\"start\":55212},{\"end\":55239,\"start\":55227},{\"end\":55255,\"start\":55239},{\"end\":55556,\"start\":55542},{\"end\":55565,\"start\":55556},{\"end\":55577,\"start\":55565},{\"end\":55589,\"start\":55577},{\"end\":55858,\"start\":55849},{\"end\":55871,\"start\":55858},{\"end\":55887,\"start\":55871},{\"end\":56213,\"start\":56203},{\"end\":56224,\"start\":56213},{\"end\":56443,\"start\":56433},{\"end\":56455,\"start\":56443},{\"end\":56772,\"start\":56764},{\"end\":57076,\"start\":57064},{\"end\":57084,\"start\":57076},{\"end\":57391,\"start\":57381},{\"end\":57404,\"start\":57391},{\"end\":57412,\"start\":57404},{\"end\":57732,\"start\":57721},{\"end\":58096,\"start\":58089}]", "bib_venue": "[{\"end\":50769,\"start\":50760},{\"end\":51663,\"start\":51654},{\"end\":51849,\"start\":51826},{\"end\":52065,\"start\":52060},{\"end\":53317,\"start\":53308},{\"end\":54677,\"start\":54668},{\"end\":55631,\"start\":55614},{\"end\":55977,\"start\":55936},{\"end\":56808,\"start\":56794},{\"end\":57816,\"start\":57768},{\"end\":58612,\"start\":58560},{\"end\":49057,\"start\":49015},{\"end\":49456,\"start\":49442},{\"end\":49640,\"start\":49624},{\"end\":49991,\"start\":49977},{\"end\":50391,\"start\":50373},{\"end\":50758,\"start\":50743},{\"end\":51078,\"start\":51070},{\"end\":51392,\"start\":51366},{\"end\":51652,\"start\":51637},{\"end\":51824,\"start\":51787},{\"end\":52058,\"start\":52047},{\"end\":52305,\"start\":52277},{\"end\":52570,\"start\":52559},{\"end\":52802,\"start\":52775},{\"end\":53055,\"start\":53028},{\"end\":53306,\"start\":53291},{\"end\":53548,\"start\":53530},{\"end\":53842,\"start\":53815},{\"end\":54134,\"start\":54107},{\"end\":54416,\"start\":54382},{\"end\":54666,\"start\":54651},{\"end\":54936,\"start\":54922},{\"end\":55280,\"start\":55255},{\"end\":55612,\"start\":55589},{\"end\":55934,\"start\":55887},{\"end\":56234,\"start\":56224},{\"end\":56483,\"start\":56455},{\"end\":56792,\"start\":56772},{\"end\":57102,\"start\":57084},{\"end\":57430,\"start\":57412},{\"end\":57766,\"start\":57732},{\"end\":58087,\"start\":58022},{\"end\":58558,\"start\":58433}]"}}}, "year": 2023, "month": 12, "day": 17}