{"id": 244575663, "updated": "2022-09-29 21:44:47.846", "metadata": {"title": "High-Efficiency Modulation and Harmonic Beam Scanning in Time Modulated Array", "authors": "[{\"first\":\"Gang\",\"last\":\"Ni\",\"middle\":[]},{\"first\":\"Chong\",\"last\":\"He\",\"middle\":[]},{\"first\":\"Yanchang\",\"last\":\"Gao\",\"middle\":[]},{\"first\":\"Jingfeng\",\"last\":\"Chen\",\"middle\":[]},{\"first\":\"Ronghong\",\"last\":\"Jin\",\"middle\":[]}]", "venue": "IEEE Transactions on Antennas and Propagation", "journal": "IEEE Transactions on Antennas and Propagation", "publication_date": {"year": 2021, "month": null, "day": null}, "abstract": "A general high-efficiency time-modulated module and harmonic beam scanning time-modulated array (TMA) are proposed and investigated in this paper. By introducing the periodically controlled phased-shifters, a significant improvement on theoretical overall efficiency and transmitted bandwidth can be realized in harmonic beam scanning. Then equivalent cascade structure of the general modulation module is proposed for RF circuit simplification and practicability in actual applications. Theoretical derivation and simulation results show that increased efficiency, 100% feeding network efficiency and theoretical overall efficiency tending to 100% without consideration of insertion loss, can be achieved with the increase the phase-shifter states when only a single sideband is utilized. Compared to the existing state-of-the-art harmonic beam scanning TMAs, the proposed TMA exhibits a much higher overall efficiency while keeps a similar hardware complexity. Additionally, with acceptable increase of circuit complexity less than existing works, similar level of the wide transmission bandwidth can also be achieved. To experimentally verify the feasibility of the proposed general design, a 4-bit time-modulated module with reconfigurable states and the corresponding 8-element harmonic beam scanning TMA are fabricated and tested. The experiments on signal transmission and harmonic beam scanning demonstrate the effectiveness of power loss reduction and improvement in transmitted bandwidth with the increase of modulation phase states.", "fields_of_study": "[\"Materials Science\"]", "external_ids": {"arxiv": null, "mag": "3205153783", "acl": null, "pubmed": null, "pubmedcentral": null, "dblp": null, "doi": "10.1109/tap.2021.3119046"}}, "content": {"source": {"pdf_hash": "2929ccf71e02602aae22d00d0b7d5ce07f859f64", "pdf_src": "IEEE", "pdf_uri": null, "oa_url_match": false, "oa_info": null}, "grobid": {"id": "1de56ea4743d8e82e47513193b7a0adcb1fed1a5", "type": "plain-text", "url": "s3://ai2-s2-pdf-extraction-prod/parse-results/s2orc_worker/2929ccf71e02602aae22d00d0b7d5ce07f859f64.txt", "contents": "\nTransactions on Antennas and Propagation High-Efficiency Modulation and Harmonic Beam Scanning in Time Modulated Array\n\n\nGang Ni \nMember, IEEEChong He \nYanchang Gao \nJingfeng Chen \nFellow, IEEERonghong Jin \nTransactions on Antennas and Propagation High-Efficiency Modulation and Harmonic Beam Scanning in Time Modulated Array\n10.1109/TAP.2021.31190460018-926X ( This article has been accepted for publication in a future issue of this journal, but has not been fully edited. Content may change prior to final publication. Citation information: 1Index Terms-high efficiencyharmonic beam scanningmultiple-branch time modulationtime-modulated array\nA general high-efficiency time-modulated module and harmonic beam scanning time-modulated array (TMA) are proposed and investigated in this paper. By introducing the periodically controlled phased-shifters, a significant improvement on theoretical overall efficiency and transmitted bandwidth can be realized in harmonic beam scanning. Then equivalent cascade structure of the general modulation module is proposed for RF circuit simplification and practicability in actual applications. Theoretical derivation and simulation results show that increased efficiency, 100% feeding network efficiency and theoretical overall efficiency tending to 100% without consideration of insertion loss, can be achieved with the increase the phase-shifter states when only a single sideband is utilized. Compared to the existing state-of-the-art harmonic beam scanning TMAs, the proposed TMA exhibits a much higher overall efficiency while keeps a similar hardware complexity. Additionally, with acceptable increase of circuit complexity less than existing works, similar level of the wide transmission bandwidth can also be achieved. To experimentally verify the feasibility of the proposed general design, a 4-bit time-modulated module with reconfigurable states and the corresponding 8-element harmonic beam scanning TMA are fabricated and tested. The experiments on signal transmission and harmonic beam scanning demonstrate the effectiveness of power loss reduction and improvement in transmitted bandwidth with the increase of modulation phase states.\n\nI. INTRODUCTION\n\nPattern synthesis and beamforming are fundamental research orientations in array signal processing field for radar and wireless communication applications [1]. Therein the digital phase shifters and attenuators are widely used for phase and amplitude weighting. However, the discrete steps of digital phase shifters and attenuators due to the internal structure which allows only a discrete number will result in quantization errors, which introduce raised side lobes [2] and beam pointing errors [3]. The effects of the phase and attenuation steps can be alleviated with larger number of bits to meet practical demands, whereas the increased high hardware complexity and cost cause severely limit in engineering applications.\n\nRecently, TMA has been another promising way to realize phase and amplitude weighting and work as the phased array. Unlike the conventional digital phase shifters and attenuators, TMA introduces the time dimension for phase and amplitude weighting. By controlling the \"ON\" times and time delays in all channels, approximately continuous equivalent phase and amplitude weighting in the first positive harmonic can be realized. Resulting from the periodic modulation of the RF switches, both desired and undesired harmonic components occur at the corresponding harmonic frequencies. Aiming to suppress or eliminate the undesired harmonics, numerous methods and modulation strategies were proposed and verified, including evolutionary optimization algorithms [4][5][6], nonuniform period modulation [7] and pulse shaping strategy [8]. Additionally, introducing proper time sequences and extra circuits, the harmonic components can be efficiently implemented in various fields, such as direction-finding [9], multiple-beams pattern synthesis [10], secure communication [11] or multiuser communication [12].\n\nIn terms of harmonic beamforming or beam scanning, various time modulation (TM) schemes have been proposed and verified to improve the efficiency or transmission bandwidth [13][14][15][16][17][18][19][20][21][22][23]. As for existing state-of-the-art TMAs, the performance comparisons of bandwidth B max , harmonic efficiency η TMA , feeding network efficiency η mod , overall efficiency η and whether fabricated or not are shown in Table I. In [13][14][15], the basic harmonic beamforming methods with singlepole single-throw (SPST) switches were introduced, showing advantages on simple system, low cost and ease to implement. Due to the switch-off times and harmonic loss, the overall efficiency is 10.13% and the transmitted bandwidth is limited to be lower than the modulation frequency. To alleviate these drawbacks, methods based on extra power divider/combiner and fixed phase shifters, so called fixed delay lines, were proposed and verified recently. By introducing moderate increase of RF circuits, the TMAs with fixed phase shifters show remarkable performance improvement in theoretical overall efficiency, harmonic efficiency and achieved transmitted bandwidth. For instance, the \"OFF\" times were eliminated by delivering the signal to the oppositely oriented elements of the array in [16,17], and replaced by the delay lines with phase shift π in [18], leading to a 6 dB increase of useful power due to the utilization of inverted signal in extra half of the period. Subsequently, by introducing 1-bit phase shifters and extra fixed delay lines, the single-sideband (SSB) TM method [19] and enhanced SSB circuits with reconfigurable power divider [20] or multiple sub-branch [21] were proposed to eliminate undesired harmonics for high harmonic efficiency and wide transmission bandwidth. However, similar overall efficiencies, 30.40%, 47.48% and 40.53% in [19][20][21], are achieved due to the decrease of the feeding network efficiency resulting from the power divider networks. Furthermore, extra attenuators were introduced in [22] and [23] for stair-step approximation of a sinusoidal pulse waveform. The bandwidth and overall  [22] and [23], which are also limited by the feeding network efficiency, 50% and 58%, respectively. Additionally, with several fixed delay lines and proper time sequences, beam scanning was also realizable utilizing the carrier frequency component with an efficiency less than 50% [24][25][26].\n\nTo sum up, the literature review shows that the existing works on harmonic beam scanning limit the overall efficiency to about or less than 50%, 3 dB theoretical power loss, due to the power divider network, switch-off times or attenuators. Simultaneously, high complicated circuits are applied for wider transmission bandwidth. Meanwhile, there are few experiment results for verification of the feasibility and improved efficiency, especially for improved transmission bandwidth due to the complicated circuit hard to implement. Therefore, it is necessary to establish a general high-efficiency time modulation model for a practical tradeoff between overall efficiency, transmission bandwidth and circuit complexity from theory, simulation and experiment results.\n\nReferring to the existing beam steering or scanning TMAs with fixed phase shifters and inspired by our previous work in [26], a general high-efficiency time-modulated module and corresponding harmonic beam scanning TMA are proposed in this paper. Utilizing the periodically controlled phase shifters satisfying phase gradient and allocating same switchon times for all phase states, most of the input power can be concentrated on the positive first harmonic, realizing the high-efficiency time modulation and harmonic beam scanning. Meanwhile, the equivalent cascade structure is presented for RF circuit simplification and practicability in actual applications. Theoretical derivation and simulation results show that a much higher theoretical overall efficiency can be realized with the increase of the phase states, demonstrating by a 4-bit state-reconfigurable TMA system experimentally. Even with 4 or 6 modulated phase states, the overall efficiency can reach 81.06% and 91.19%, while the control and hardware complexity are similar or lower than most of the existing works. Additionally, the proposed general high efficiency module can make a nice and convenient tradeoff between overall efficiency, transmission bandwidth and circuit complexity.\n\nThe rest of the paper is organized as follows. In section II, the general time-modulated module and equivalent cascade structure are proposed and analyzed from signal transmission and high-efficiency beam scanning. Several simulation results are provided in section III to verify the high efficiency  modulation, followed by comparisons with existing works. In section IV, the proposed module and beam scanning TMA are fabricated and validated experimentally. Finally, conclusion is drawn in section V.\n\n\nII. THEORY A. High-Efficiency Modulation Module\n\nThe basic diagram of the proposed module with M (M ≥ 2) phase states is shown in Fig. 1(a). It consists of two singlepole M -throw (SPMT) RF switches controlled by a digital controller and M fixed phase states with phase 2πm/M, m = 0, 1, . . . , M − 1. In each modulation period, each phase status has the same switch-on time 1/M T p .\n\nThe periodic time sequences U (M, t) generated by the controller are shown in Fig. 1(b) and can be arranged as\nU (M, t) = ∞ i=−∞ M −1 m=0 e j 2π M m g(M, t − m M T p − iT p ),(1)\nwhere T p represents the time modulation period, g(M, t) is a gate function written as\ng(M, t) = 1, 0 ≤ t ≤ 1 M T p 0, other .(2)\nAs can be seen, utilizing the time sequences in (1), the M phase states are selected in series with T p /M in each modulation period. There are no \"OFF\" times resulting in power loss in the feeding network. To analyze the harmonic distribution after the modulation structure, a RF carrier signal e j2πfct with carrier frequency f c is considered as the input. The output signal S o (t) after modulation is shown as\nS o (t) = U (M, t)e j2πfct .(3)\nDue to the periodicity, U (M, t) can be decomposed into the Fourier series given by\nU (M, t) = +∞ q=−∞ α q e j2πqfpt ,(4)\nwhere f p = 1/T p is the modulation frequency, α q is the Fourier coefficient at the q th harmonic, calculated by\nα q = 1 T p Tp 0 U (M, t)e −j2πqfpt dt = M−1 m=0 e j2π m M · 1 T p m+1 M Tp m M Tp e −j2πqfpt dt = ( M πq sin πq M ) · e −j πq M · Ψ(q),(5)\nwhere Ψ(q) is the output factor determining the existence of q th harmonic and shown as\nΨ(q) = 1 M M −1 m=0 e j2π m M (1−q) = 1, q = iM + 1 0, q = iM + 1 , i ∈ Z(6)\nEquation (6) indicates that when the RF signal passes through the proposed module, only the harmonics with order q = iM + 1, i ∈ Z exist in the final output signal. The harmonics with order q = iM + 1, i ∈ Z are suppressed due to Ψ(q) = 0. The spacing of the adjacent harmonics is M T p .\n\nThen, inserting (4-6) into (3), the output modulated signal can be rearranged as\nS o (t) = +∞ q=−∞ α q e j2π(fc+qfp)t = +∞ i=−∞ α iM +1 e j2π[fc+(iM +1)fp]t(7)\nObviously, the output signal consists of multiple harmonics with harmonic frequency f c +(iM +1)f p , i ∈ Z. According to (5), the first harmonic signal has the highest amplitude among all the harmonics and always exists when M changes. It is proper to choose the first harmonic signal for harmonic beam scanning as the works in [13][14][15][16][17][18][19][20][21][22][23]. The first harmonic signal can be written as\nS o,1 (t) = ( M π sin π M ) · e −j π M · e j2π(fc+fp)t .(8)\nIt is worth noting that when M is large enough, the amplitude of the first harmonic signal can be close to the input signal, shown as\nlim M →∞ |α 1 | = lim M →∞ M π sin π M = 1.(9)\nWhen M → ∞, the proposed module is equivalent to a frequency mixer with center frequency f p . In the actual applications, the increase of M will lead to more complex hardware and higher insertion loss. Thus, the proper M should be chosen and evaluated.\n\nFor the case of larger M , the RF switch with enough or specific number of switching states is infrequent in actual applications. Generally, SP2T, SP3T and SP4T are more practical and accessible for time modulation. Thus, an equivalent cascade structure for the high-efficiency module is proposed as shown in Fig. 2(a). When M = K 1 × K 2 × . . . × K L , K 1 ≥ K 2 ≥ . . . ≥ K L , the M -state digital phase-shifter can be replaced by L-level cascading of digital phase-shifter with less states K 1 , K 2 , . . . , K L . The l th module consists of two SPK l T switches and K l fixed phase states with phase 2πk/(K 1 K 2 . . . K l ), k = 0, 1, . . . , K l − 1.     \nM = K 1 × K 2 × . . . × K L , K 1 ≥ K 2 ≥ . . . ≥ K L . (b) Example with M = 3 × 2.\n\nB. Phase-only Beam Scanning\n\nUtilizing the proposed module, the configuration of an Nelement TMA for phased-only beam scanning is shown in Fig.  3. The RF signal is fed into the single RF channel and divided into N ways in RF front with the power divider network. Then, equivalent phases in all elements are generated by the proposed TM modules through the controller.\n\nThe reason to only consider the phased-only beam scanning is that the amplitude-weighting will cause the loss of efficiency [21]. In this paper, in order to analyze the theoretical limitations of efficiency with the proposed modules, only the equivalent phase distribution for beam scanning in all array elements is achieved utilizing proper time sequences. The time sequence U n (t) of the n th TM module is shown as\nU n (t) = U (M, t − t n ),(10)\nwhere t n is the time delay of the n th channel determined by the designed phase distribution and satisfies 0 < t n ≤ T p . Considering uniform amplitude and phase excitation, the farfiled array factor is given as\nAF (θ, t) = e j2πfct N n=1 U n (t)e jβ(n−1)d sin θ ,(11)\nwhere β = 2π/λ is the wavenumber, λ is the carrier wavelength, d is the element spacing and θ represents the angle with respect to the normal direction of the TMA. Following the deviations as (4) and (5), the far-field array factor can be rearranged as\nAF (θ, t) = ∞ q=−∞ N n=1\nα q e −j2πqfptn e j2π(fc+qfp)t e jβ(n−1)d sin θ .\n\n(12) Since the first harmonic component is used for beam scanning, the corresponding array factor AF 1 (θ, t) is shown as\nAF 1 (θ, t) = N n=1 α 1 e −j2πfptn e j2π(fc+fp)t e jβ(n−1)d sin θ .(13)\nTo steer at the desired angle θ 0 , the phase distribution of the array should satisfy\nphase(α 1 ) − 2πf p t n = −β(n − 1)d sin θ 0 ,(14)\nwhere phase(·) denotes extracting the phase of the value. From (5), the phases of the Fourier coefficients are constant when M is fixed. Thus, the beam scanning can be achieved by designing the time delay t n in (14). Due to the modulation of RF switches and power dividers in each channel, part of power is wasted in the undesired harmonics and the feeding network. Then, the overall efficiency of TMA η with the proposed modules can be divided into two separate parts and written as [22], [27] \nη = η TMA η mod = P TM U P TM R P TM R P ST R ,(15)\nwhere the efficiency η TMA = P TM U /P TM R represents the harmonic efficiency defined by the ratio of the power in useful harmonics to that in all harmonics, P TM R = +∞ q=−∞ P q is the total mean power radiated by the TMA with the proposed modules, P q denotes the mean radiated power at the q th harmonic and P TM U is the useful mean radiated power. Since the first harmonic is utilized for phased-only beam scanning in this paper, P TM U = P 1 is satisfied. The efficiency η mod =P TM R /P ST R accounts for the reduction of the total mean power radiated by the uniform static array caused by the proposed TM modules, P ST R is the total mean power radiated by a uniform static N -element array. Notice that η mod can also be calculated with the modulation function U n (t) shown as [20] \nη mod = 1 T p Tp 0 |U n (t)| 2 dt.(16)\nThe two methods are equivalent due to the Parseval's theorem. Additionally, the relationship between the efficiency and power loss (in dB) is shown as\nδ = −10 lg η.(17)\nAs for a single carrier with normalized power, the analytical form of P ST R have been deduced in [27] and written as P ST R = 4πN . The mean radiated power P q at the q th harmonic is calculated by P q = 4π the same amplitude and different phases. Then the useful mean radiated power P TM U can be calculated by\nP TM U = 4π N n=1 |α 1 | 2 = 4πN sinc 2 π M .(18)\nFrom (16) and Fig. 1(b), η mod = 100% in the proposed TMA system. Then P TM R = P ST R = 4πN satisfies, leading to the overall efficiency η = sinc 2 (π/M ). When M is large enough, the overall efficiency will tend to 100% and is written as lim\nM →∞ η = lim M →∞ sin c 2 π M = 1.(19)\nAs for the example in Fig. 2(b) for M = 3 × 2, the overall efficiency is η = 91.19%, and the overall power loss is δ = 0.4 dB.\n\nTherefore, with the proposed modules, most of the power is concentrated on the +1 harmonic, which realizes highefficiency phase-only beam scanning. The efficiency can be improved with the increase of the total phase states.\n\nAdditionally, the proposed TMA system also shows advantages on the transmitted signal bandwidth. According to (5), (6) and (7), only the harmonics with frequency f c + (iM + 1)f p , i ∈ Z exist in the final radiated signal. The spacing of the output signal spectrum is obviously M f p . To avoid spectrum aliasing between adjacent harmonics, the transmitted signal bandwidth B should not be larger than M f p . The condition without spectrum aliasing is required, shown as\nf p ≥ B/M.(20)\nSince the modulation frequency f p is restricted by the RF switch, including rising/falling times and switching speed, the proposed module can reduce the dependence of RF switch and increase transmitted signal bandwidth with larger M . It means that the proposed module can improve the efficiency and bandwidth simultaneously. In actual applications, considering the hardware complexity and phase accuracy of the fixed phase states, a tradeoff should be made when realizing higher efficiency and larger transmitted bandwidth.\n\n\nC. Influence of Transitions Between Phase States\n\nAs for realistic RF switches, there are inevitable rise/fall times between the switching of different phase states, which will result in the decrease of overall efficiency. To analyze the influence of the transition on the high-efficiency modulation, the trapezoidal modulation waveforms in [28] and [19] are considered in this part. Same as that in [19], the transitions of rise and fall are supposed to have the same durations, denoted as σT p , shown in Fig. 4. To keep the trapezoidal transitions, σT p should satisfy\n0 ≤ σT p ≤ 1 2M T p .(21)\n0018-926X (c) 2021 IEEE. Personal use is permitted, but republication/redistribution requires IEEE permission. See http://www.ieee.org/publications_standards/publications/rights/index.html for more information.\n\nThis article has been accepted for publication in a future issue of this journal, but has not been fully edited. Content may change prior to final publication. The equivalent amplitude of the time sequences U Trap (M, t) with trapezoidal rise/fall transitions is shown in Fig. 4. Then U Trap (M, t) can be arranged as\nU Trap (M, t) = ∞ i=−∞ M −1 m=0 e j 2π M m g Trap (M, t − m M T p − iT p ),(22)\nwhere g Trap (M, t) is the gate function with trapezoidal rise/fall transitions shown as\ng Trap (M, t) =    t σTp , 0 ≤ t < σT p 1, σT p ≤ t < ( 1 M − σ)T p 1 σTp (t − 1 M T p ), ( 1 M − σ)T p ≤ t < 1 M T p .\n(23) From (16), the feeding network efficiency decreases to\nη Trap mod = 1 T p Tp 0 U Trap (M, t) 2 dt = 1 − 4 3 M σ.(24)\nApplying the same Fourier decomposition as (4), the Fourier coefficient α Trap q is calculated by\nα Trap q = 1 T p Tp 0 U Trap (M, t)e −j2πqfpt dt = M −1 m=1 e j2π m M T p m+1 M Tp m M Tp g Trap (M, t− m + 1 M T p )e −j2πqfpt dt = (1 − M σ) sin cπq( 1 M − σ) sin cπqσ · e −j πq M · Ψ(q).(25)\nFor phased-only beam scanning, the useful mean radiated power P TM,Trap U is calculated by\nP TM,Trap U = 4π N n=1 α Trap 1 2 = 4πN (1 − M σ) sin cπq( 1 M − σ) sin cπqσ 2 .(26)\nSince the total mean power radiated by a N -element array is P ST R = 4πN , the theoretical overall efficiency under trapezoidal transitions is shown as\nη Trap = (1 − M σ) sin cπq( 1 M − σ) sin cπqσ 2 .(27)\nBesides, the limit of the modulation frequency in (20) should be extended due to the transition [29], [30], rearranged as\nB/M ≤ f p ≤ 1/(2M σT p ).(28)\nEq. (25) shows that the existence and phase of the q th harmonic keep the same as those in (5), while the amplitude decreases. It is convenient to verify that decreased overall efficiency η Trap is obtained with larger M or transition σT p . Therefore, proper M depends on the ratio of transition time in one modulation period except for the hardware complexity.  \n(a) (b) (c) (d)\n\nIII. SIMULATION RESULTS\n\nIn this section, the effectiveness and performance of the proposed modulation module and corresponding beam-scanning TMA system are evaluated and verified through several numeric simulations.\n\n\nA. Signal After High-Efficiency Module\n\nA single modulation module is considered firstly to investigate the proposed structure from the frequency domain. Suppose that a RF carrier signal e j2πfct with center frequency f c = 2 GHz is fed into the module. The modulation frequency f p is set as 10 MHz. The number M of the phase states in the module is chosen as 2, 4 6 and 8 to compare the power efficiency, where the phase shifts are 2πi/M (i = 0, 1, . . . , M − 1), M = 2, 4, 6, 8. Then, the input RF signal is modulated utilizing the time sequences U (M, t) in (1) and Fig. 1(b). Fig. 5 shows the simulated output signal spectra with different M (M = 2, 4, 6, 8). For the comparison of power loss, the power spectrum of the input signal is also plotted, which locates at f = 2 GHz. As can be seen, the +1 st harmonic has the maximum amplitude and is proper for beamscanning. As (4) and (5) show, only the harmonics locate at f c + (iM + 1)f p , i ∈ Z exist. The harmonic spacing of the four types of modules are 2f p , 4f p , 6f p and 8f p , respectively, which means the transmitted signal bandwidth is improved with larger M . Additionally, compared to the power spectrum of the input RF signal, the power losses of the four types of modules are -3.92 dB, -0.91 dB, -0.4 dB and -0.22 dB, demonstrating a significant improvement of efficiency when larger M is chosen.\n\nFor completeness, the harmonic distributions of the four types of modules are shown in Fig. 6. It can be observed that the overall harmonic power increases with larger M ,  which is consistent with the (5) and satisfies amplitude 20 log(sinc(π(iM +1)/M )), i ∈ Z. Meanwhile, the maximum amplitude of the useless harmonic with frequency f c +(−M + 1)f p decreases since the transmitted bandwidth is extended. Fig. 7 plots the relationship between the overall efficiency η, the corresponding power loss δ and the number of phase states M with different transition ratios σ = 0, 1/64, 1/32. Note that the overall efficiency of beam scanning in the array is the equivalent to the single module since only the time delay t n is different across all channels. As can be seen, for σ = 0, the overall efficiency increases rapidly with the increase of M when M is relatively small, while the growth is not obvious in larger M . Besides, the overall efficiency shows distinct decrease with the increase of transition time. And the decrease is more severe in larger M , which results from the increased ratio of transition time in the \"ON\" time of one phase state. For example, when M = 8 and σ = 1/32, half the \"ON\" time of each phase state are transition time. Considering the equivalent cascade structure in Fig. 2 and the hardware complexity, it is a nice choice to employ 4 or 6 phase states when realizing high-efficiency beam scanning.\n\n\nB. High-Efficiency Beam Scanning\n\nConsider an 8-element TMA with element spacing λ/2 and the proposed modules in RF front as shown in Fig. 3. The time sequences of each module are set as (10), the time delay t n is calculated in (14) and used for phase-weighting.  Other parameters keep the same as those in the single module simulations. Firstly, the beam patterns of the +1 harmonic are designed to steer at 20 • . Fig. 8 shows the power spectra from the designed steering angle under different configuration of phase states (M = 2, 4, 6, 8). Similar to the power spectra in Fig. 4, the spectrum spacing under the four types of configurations are 2f p , 4f p , 6f p and 8f p , indicating the improvement of transmitted bandwidth. Since the power spectra are from the designed angle of the +1 harmonics, the +1 harmonics has the maximum amplitude gains, 5. Furthermore, consider the configuration of higher efficiency (M = 6). The normalized beam patterns of the +1 st , −5 th , +7 th harmonics and the corresponding time sequences are shown in Fig. 10(a) and (b). The desired angle of the +1 harmonic is set as 10 • . It is observed that the maximum sideband level (SBL) comes from the -5 harmonic with a decrease of -13.97 dB compared to the +1 harmonic, which is consistent with theoretical value 20 log(|α n,−5 /α n,1 |). The time sequences of the 6 phase states (0 • , 60 • , 120 • , 180 • ,   \n\n\nC. Performance Comparison with Existing Works\n\nTo compare both the theoretical modulation power loss and possible insertion loss in practical hardware, we provide several commercial devices which may be used in the existing state-of-the-art TMAs, as shown in Table II. All the RF devices are chosen to have similar parameters and ability to work from 2 to 3 GHz to evaluate the insertion loss under similar conditions. Referring to [17] and [30], the insertion loss of modulation module is calculated by including the insertion loss from the RF switches and power divider/combiner. The losses from the delay lines are far less than those from power divider/combiner or RF switch [30] and thus neglected for convenience. Then, the insertion loss IL is given by\nIL = IL sw (dB) + IL P D/C (dB).(29)\nwhere IL sw and IL P D/C are the insertion loss from the RF switches and power dividers/combiners. The performance comparisons of bandwidth B max , theoretical modulation power loss δ, hardware insertion loss IL, sideband level (SBL) and ability of multibeam are shown in Table III. The SBLs in [15], [17] and [18] are zero since the first positive and negative sidebands have the same amplitude  after the time modulation when the TMAs are used for singlesideband beam scanning. As can be seen, for typical value M = 6, the corresponding system has a low theoretical power loss, moderate transmitted bandwidth, insertion loss and SBL. The theoretical loss is 0.40 dB, much smaller than the existing works, while the module circuit has a similar complexity as these in [18][19][20]. Additionally, M = 32 is chosen for lower theoretical power loss, wider transmitted bandwidth and lower SBL. The theoretical power loss is 0.014 dB and can be neglected. Notice that the achieved bandwidth is 32f p and the SBL is -29.83 dB, the same as those in [22]. However, the proposed 32-branch module can be equivalent to a 5-level (2 5 ) or 3-level (4 × 4 × 2) cascade structure, compared to the structure with 2 two-way and four 4-way power divider networks and three extra attenuators (one fixed and two variable) in [22] and hence higher hardware complexity but with multibeam features. Moreover, the IL values when M = 16, 3.6 and 2.5 dB derived from (29) and commercially digital phase-shifter (typical value), show an obvious improved efficiency with commercial chip. Therefore, utilizing the proposed module and the equivalent cascade structure, harmonic beam scanning with high efficiency, wide transmitted bandwidth and low hardware complexity can be achieved under proper M . \n\n\nIV. EXPERIMENT RESULTS\n\nIn this section, aiming to validate the proposed highefficiency module and corresponding beam scanning system, a uniformly excited beam scanning TMA with statereconfigurable modules working on S band is fabricated and tested.\n\n\nA. Experiment Setup\n\nTo verify the harmonic beam-scanning capability and subsequently prove that the theoretical overall efficiency increases with the increase of the number of phase states, it is necessary to compare the performance of signal transmission between modules with different M . However, different structures of RF circuits show different insertion loss and the insertion loss may also increases with the increase of M , as shown in Table  III. Then the opposite effect will make the experiment results unreliable. Therefore, the commercial 4-bit digital variable phase shifter (MA/COM's MAPS-010144) is chosen as the basic device to perform the experiment. By changing the controlled word, the 4-bit phase shifter can be easily equivalent to modules with M = 2, 4, 8, 16. Furthermore, referring to typical phase accuracy ±4 • in the datasheet and neglecting the fixed maximum phase errors up to 7.5 • and 9 • , modules with small M (M = 3 and 5) can also be equivalently controlled with the phase shifter. Then the experiment on the validation of increased theoretical overall efficiency with M up to 16 can be performed, simultaneously with the influence of RF switches on the efficiency avoided.\n\nThe experiment environment is shown in Fig. 11. Both the performance of a single module and the beam scanning system are tested. Fig. 11(a) shows the experiments on a single module. Specifically, a sinusoidal RF signal with center frequency 2.6 GHz generated by the signal generator (Agilent E8267D) is input into the integrated scanning system. Then the output signal of the channel 1 is analyzed by the spectrum analyzer (Agilent E4447A). The corresponding integrated scanning system consists of 8 channel high-efficiency modulation modules, an 8-way power divider (Mini Circuits' ZB8PD-4-S+) and a control board with Altera's Cyclone IV FPGA EP4CE10F17,  as shown in Fig. 11(b). The time sequences are chosen as (1). Additionally, Fig.11 (c) gives the experiments on the harmonic beam scanning in the out-field. The same RF signal is sent to a horn antenna and then radiated to the TMA system. The TMA system working on receiving state is fastened on a turntable and about 9 m away from the horn antenna to meet the farfield condition. An 8-element patch antenna array designed at 2.6 GHz is used to receive the signal and the substrate is FR-4. The element spacing is half of the wavelength, 57.69 mm. The received signals on each patch antenna are then modulated by the TM modules and combined together by a power combiner. Then the combined RF signal is sent into the spectrum analyzer for the harmonic analysis. The time modulation sequences controlled by the FPGA are set as (14) to steer the beam of the +1 harmonic to the desired direction.\n\nThe datasheet of the 4-bit phase shifter shows that the typical rise/fall time between adjacent phase states is about 50 ns. Considering the influence of transition times analyzed in Section II.C, a lower modulation frequency 100 KHz is chosen to avoid the unexpected decrease of efficiency maximally, especially in the experiment with M = 16. The ratio of the transition time σ is about 1/200 and small enough to neglect the influence of transition time. Meanwhile, the unbalances of insertion loss and phase shifts of the module influence the performance of harmonic elimination and beam steering. Therefore, the S parameters of the proposed prototype are also provided. Fig. 12 shows the insertion loss and phase shifts of the 16   phase shifter. As can be seen, the measured insertion loss of the 16 phase states at 2.6 GHz is between 3.14 dB and 4.28 dB. The unbalances of the insertion losses and phase shifts across the 16 phase states are no more than 1.14 dB and 4.0 • , ensuring the comparison of theoretical modulation efficiency with M up to 16. Besides, as for the designed beam-scanning TMA with discrete RF components, the measured gains without time modulation and with time modulation for M = 4 is 0.84 dBi and 0.01 dBi for reference, which mainly results from the exploitation of discrete components, especially the loss from several long coaxial cables and many interfaces shown in Fig.  11. For further applications, it is a good choice to design the array, modulation modules and power divider as an integrated circuit, as shown in [17]. Nevertheless, the proposed TMA is enough to verify the beam-scanning function of the proposed modulation modules.\n\n\nB. Signal Transmission with The Proposed Module\n\nA single module equivalent to M = 2, 4, 8, 16 for RF carrier signal transmission is considered first. The center frequency of the input signal is 2.6 GHz. By changing the control words of the 4-bit phase shifter utilizing the FPGA and keeping the same experiment environment, the output modulated signals with modulation of M = 2, 4, 8, 16 phase states can be obtained and used to compare the efficiency. Fig. 13 plots the measured output power spectra under the four circumstances. It can be observed that with the modulation of digital phase shifter, most of the signal power is modulated to the first harmonic with frequency 2.6001 GHz. The harmonic spectrum spacing for M = 2, 4, 8, 16 is 200 KHz, 400 KHz, 800 KHz and 1.6 MHz, satisfying the theoretical value 2f p , 4f p , 8f p and 16f p . Due to the unbalances of amplitude and phase shifts among the 16 phase states in the digital phase shifter as shown in Fig. 12, the unexpected harmonics with frequency f c + qf p , (q = iM + 1, i ∈ Z) also exist, occupying maximum power levels 32.9 dB, 34.6 dB, 31.2 dB and 33.2 dB less than the +1 harmonic for M = 2, 4, 8, 16, respectively. Notice that the module with M = 2 has better performance on the elimination of all unexpected harmonics. The power level of the only visible unexpected harmonic is 32.9 dB lower than the +1 harmonic, which is similar to the result in [17]. As M increases, the phase-precision demand increases, while the phase error of the prototype increases. Thus, the modulation results show increased number of unexpected harmonics with other M in Fig. 13.\n\nMeanwhile, the power levels of the +1 harmonic under the four circumstances and the input RF signal are compared in Fig. 14. For comparison under the same conditions, the spectrum of the input signal is from the static output signal when phase 0-state in the modulation module keeps switch-on all the time. In Fig. 14 Fig.  12. For larger M , the required phase step is smaller, then the unbalances in insertion loss and phase shift will have a more obvious effect on the time-modulation results. According to Fig. 13, the extra power loss mainly results from the unexpected harmonics with frequency f c +qf p , (q = iM +1, i ∈ Z) directly.\n\nFor completeness, a comparison between the normalized measured and simulated output power spectra is provided in Fig. 15 when four phase states are equivalent (M = 4). The measured unbalances of the insertion losses and phase shifts are also considered in the simulated results. In Fig. 15, the correct peaks with frequency f c + qf p , (q = iM + 1, i ∈ Z) and the error peaks of several higher harmonics are marked. It can be seen that the measured correct peaks are consistent with the simulated correct peaks. Additionally, with the unbalances, the simulated power spectrum also has unexpected harmonics and is consistent with that in the measured power spectrum. The extra difference mainly comes from the nonideal characteristic of the waveforms. In the experiment, the equivalent waveforms are non-ideal rectangular due to the rising/falling of the RF signal, part of the power distributes on all the frequency axis, raising the other useless harmonics and noise level, especially.\n\nMoreover, experiments on higher modulation frequencies for M = 4 are provided. Fig. 16 shows the measured output power spectra of a single module with f p = 1 MHz and 5 MHz. As can be seen, compared to Fig. 13 (b), the power levels of the +1 harmonic decrease by 0.35 dB and 0.91 dB with the increase of f p . The maximum power levels of the unexpected harmonics also increase, 27.0 dB and 22.4 dB less than the +1 harmonics, respectively. Similar to [17], it is possible to transmit signals with maximum bandwidth of 400 KHz, 4 MHz and 20 MHz for f p = 100 KHz, 1 MHz and 5 MHz. There are three main factors that influence the absolute bandwidth. The modulation frequency limits the upper bound of the transmitted bandwidth. The transitions of the RF switch, reflecting the switching speed, influence the overall efficiency and may influence the modulation result when the ratio of transitions is too large. Besides, the unbalances of the amplitude and phase shifts influence the elimination of unexpected harmonics.\n\n\nC. Beam scanning with improved efficiency\n\nConsider 8-channel TM modules and the corresponding 8element beam scanning TMA system as shown in Fig. 11 (c). The process of TMA equivalent to different M is the same as the experiments on a single module. The time delay t n , (n = 1, 2, . . . , N ) of each module is designed by (14) and used for phase-weighting to steer beam at the desired direction. In this subsection, M = 3 and M = 5 are also designed for harmonic beam scanning. Fig. 17 shows the comparison of measured receiving power spectra with equivalences of different delay lines (M = 2, 3,4,5). Notice that the normal direction of the TMA is consistent with the designed direction 0 • . Same as Fig. 13, the correct peaks with frequency f c + qf p ,    are marked. When the steering angle is 0 • and the direction of array is also 0 • , all the expected harmonics have the maximum amplitude from (12) and (14). Then it is convenient to see that the harmonic spacing in Fig. 17 is 2f p , 3f p , 4f p , 5f p , respectively. Unexpected harmonics also exist and have higher power levels than these in the experiments on a single modulation module, resulting from the unbalance of the 8 channels and quantization errors of 3-state and 5-state modulation modules additionally. Due to different M (2, 3, 4, 5), different amplitudes of the +1 harmonic are achieved, -32.34 dBm, -31.33 dBm, -30.34 dBm and -30.23 dBm, respectively, demonstrating the improvement of the overall efficiency. For comparison of the scanning efficiency, the power patterns of the +1 harmonic designed to steer at -20 • with different phase equivalences (M = 2, 3, 4, 5) are measured and compared in Fig. 18. As for different M , the designed normalized power patterns are the same as these in Fig. 9 since the phaseweighting keeps the same. The only difference reflects on the absolute values of the power levels due to different scanning efficiency. In Fig. 18, we chose the main lobe and two higher and unbroken side lobes for comparison. As can be seen, with the increase of M , the absolute level of the pattern has an obvious increase, indicating the improvement of the overall efficiency. The differences of the absolute levels in M = 2 and M = 5 are 3.61 dB, 3.06 dB and 3.53 dB, compared to the theoretical value 3.34 dB. The errors come from the channel unbalances of the insertion loss and phase shifts, the fixed errors of the turntable and the TMA layout, except for the unbalances of the single modules. Finally, M = 3 is chosen for harmonic beam scanning. The measured power patterns of the +1 harmonic designed to steer at -50 • ∼50 • with 10 • stepping are shown in Fig.  19(a). Patterns of the -2 harmonic with +1 harmonic designed to steer at 0 • ∼50 • are also provided in Fig. 19(b). It can be observed that all the designed beam patterns steer at the desired directions with 3.01 dB and 2.88 dB scanning loss in -50 • and 50 • , validating the feasibility of the harmonic beam scanning. The total scanning range is about ±50 • . Similar to the +1 harmonic, the -2 harmonic also shows decreased power level as the scanning angle increases. Therefore, improvedefficiency modulation and harmonic beam scanning can be achieved utilizing the proposed modulation modules.\n(q = iM + 1, i ∈ Z) (a)(b)\nV. CONCLUSION High-efficiency time modulation and harmonic beam scanning with periodically controlled phased shifters are proposed and investigated in this paper. By introducing the phasedshifter modulation module and the corresponding equivalent cascade structure for circuit simplification, time modulation with improved efficiency and transmitted bandwidth are achieved and used for high-efficiency harmonic beam scanning. The theoretical derivations, simulations and experiment results on harmonic characteristic analysis and harmonic beam scanning demonstrate the feasibility and effectiveness of the proposed modules and TMA system. Compared to the existing works for harmonic beamforming or beam scanning, the proposed TMA can realize a much higher overall efficiency with a similar hardware complexity. Additionally, with acceptable increase of circuit complexity less than existing works, similar level of wide transmission bandwidth can also be achieved. However, the transitions of the RF switches and unbalances of amplitude/phase deteriorate the overall efficiency, bandwidth and elimination of unexpected harmonics. Therefore, the further research work concentrates on the suppression of undesired harmonics and circuit design with high phaseaccuracy phase states.\n\n\nThis work was supported by the National Natural Science Foundation of China 61901263, 62001291. The authors are with the Department of Electronic Engineering, Shanghai Jiao Tong University, Shanghai 200240, China (e-mail: hechong@sjtu.edu.cn).\n\nFig. 1 .\n1Diagram of the proposed modulation module and the corresponding time sequences U (M, t) with amplitude and phase. (a) General diagram. (b) Time sequences U (M, t) of the M phase states.\n\n\nBy controlling the switch-on state of the L RF switches simultaneously, M phase states with phase 2πm/M, m = 0, 1, . . . , M − 1 can be generated. For instance, Fig. 2(b) shows an 2-level cascading of switches for M = 3×2. Different combinations of the states in the SP3T and SP2T will lead to the equivalent phases 0 • , 60 • , 120 • , 180 • , 240 • and 300 • .\n\nFig. 2 .\n2Equivalent cascade structure and example of the proposed module using RF switches with less branches. (a) Equivalent cascade structure with\n\nFig. 3 .\n3Configuration of an N -element TMA for phased-only beam scanning with the proposed modules.\n\nFig. 4 .\n4N n=1 |α n,q | 2[27], where α n,q is the Fourier coefficient of the n th channel and the q th harmonic. From the time sequences in (10) for phased-only beam scanning, the Fourier coefficients in all channels have The equivalent amplitude of the time sequences with trapezoidal rise/fall transitions.\n\nFig. 5 .\n5The comparison of the input power spectrum and the output power spectra with different number of modulated branches. (a) M = 2. (b) M = 4. (c) M = 6. (d) M = 8.\n\nFig. 6 .\n6The harmonic distributions of the output signal spectra in a single module (M = 2, 4, 6, 8).\n\nFig. 7 .\n7The relationship between the overall efficiency, power loss and the number of phase states M with different transition ratios (σ = 0, 1/64, 1/32). (a) Overall efficiency. (b) Power loss.\n\nFig. 8 .\n8The power spectra from the designed steering angle 20 • when different fixed phase states are deployed. (a) M = 2. (b) M = 4. (c) M = 6. (d) M = 8.\n\n\n11 dB, 8.12 dB, 8.63 dB and 8.81 dB for M = 2, 4, 6, 8, respectively. The amplitudes of other harmonics satisfy different distribution from these in Fig. 6 due to different harmonic beam pointing. Additionally, Fig. 9 plots the beam patterns of the +1 harmonics designed to steer at 25 • under different configurations. As can be seen, all the simulated beam patterns point to the designed angle 25 • . Due to the differences of the overall modulation efficiency, different gains of the beams are achieved, 5.11 dB, 8.12 dB, 8.63 dB and 8.81 dB for M = 2, 4, 6, 8, which shows higher efficiency for larger M . Note that the gain values are consistent with the theoretical values 20 log( √ N sin c(π/M )). The results demonstrate that both the transmitted bandwidth and overall efficiency can be improved significantly utilizing the proposed modules. Even the configuration with fewer phase states such as M = 4 can realize an acceptable overall efficiency.\n\nFig. 9 .\n9Power patterns of the +1 harmonic designed to steer at 25 • when different fixed phase states are deployed (M = 2, 4, 6, 8).\n\nFig. 10 .\n10Normalized harmonic patterns designed to steer at 10 • and the corresponding time sequences (M = 6). (a) Power patterns of the +1, -5 and +7 harmonic. (b) Time sequences of the 6 phase states.240 • and 300 • ) inFig. 9(b)show that only the time delay t n of each modulation period in all channel is different. t n only depends on the phase distribution of all the channel.\n\nFig. 11 .\n11The experiment environment. (a) The experiments on a single module. (b) The integrated beam scanning system with the proposed modules. (c) The experiments on the harmonic beam scanning in the out-field.\n\nig. 12 .\n12Insertion loss and relative phase shifts of the 16 phase states (0 • to 337.5 • with 22.5 • stepping) in one modulation module. (a) Insertion loss. (b) Phase shifts.\n\nFig. 13 .\n13Measured output power spectra of a single module with different phase states. (a) M = 2. (b) M = 4. (c) M = 8. (d) M = 16.\n\nFig. 14 .\n14Comparison of the output modulated-signal power and input RF signal under different phase states (M = 2, 4, 6, 8).\n\n\n, the power losses in italic represent the measured values, while the values in parenthesis are the theoretical values. As can be seen, with the increase of M , the power levels of the +1 harmonic have a corresponding increase, indicating the improvement of the overall efficiency. The measured power losses for M = 2, 4, 8, 16 are -3.880 dB, -0.969 dB, -0.425 dB and -0.288 dB, close to the theoretical loss, -3.92 dB, -0.91 dB, -0.224 dB and -0.056 dB, respectively. The differences of power loss mainly result from the unbalances of the insertion loss and phase shifts in\n\nFig. 15 .\n15Comparison of the normalized measured and simulated output power spectra when M = 4, where the unbalances of the insertion loss and phase shifts are also considered.\n\nFig. 16 .\n16Measured output power spectra of a single module with different modulation frequencies. (a) fp = 1 MHz. (b) fp = 5 MHz.\n\nFig. 17 .\n17Comparison of the measured receiving power spectra with different phase states (M = 2, 3, 4, 5).\n\nFig. 18 .\n18Measured power patterns of the +1 harmonic designed to steer at -20 • when M = 2, 3, 4, 5.\n\nTABLE I PERFORMANCE\nICOMPARISONS OF EXISTING TMASRef. \nBmax \nη TMA \nη mod \nη \nFabricated or not \n\n[15] \nfp \n20.26% \n50 % \n10.13% \n\n[17] \n2fp \n40.5% \n100% \n40.5% \n\n[19] \n4fp \n91.2% \n33.3% \n30.4% \n− \n\n[18] \n2fp \n40.5% \n100% \n40.5% \n\n[21] \n8fp \n94.96% \n42.7% \n40.5% \n− \n\n[20] \n8fp \n94.96% \n50% \n47.48% \n\n[22] \n32fp \n99.68% \n50% \n49.84% \n− \n\n[23] \n8fp \n96% \n58% \n55.68% \n− \n\nefficiency can be improved to 49.84% and 55.68% in \n\n\nCitation information: DOI 10.1109/TAP.2021.3119046, IEEE Transactions on Antennas and Propagation5 \n\n\n\nTABLE II EXAMPLES\nIIOF PRODUCTS WITH ABILITY TO WORK IN 2-3 GHZ WITH SIMILAR PARAMETERSDevice \nFrequency \nInsertion Loss \nRef. \n\nSPST RF switch \nDC-6.0 GHz \n0.7 dB \n[31] \n\nSPDT RF switch \nDC-3.0 GHz \n0.5 dB \n[32] \n\nSP3T RF switch \nDC-3.0 GHz \n0.8 dB \n[33] \n\nSP4T RF switch \nDC-3.0 GHz \n0.9 dB \n[34] \n\nSP6T RF switch \nDC-3.0 GHz \n1.2 dB \n[35] \n\n2-way power divider \n1.8-3.2 GHz \n0.7 dB \n[36] \n\n3-way power divider \n0.7-3.0 GHz \n0.9 dB \n[37] \n\n4-way power divider \n0.38-4.6 GHz \n0.9 dB \n[38] \n\n4-bit digital phase shifter \n2.3-3.8 GHz \n2.5 dB \n[39] \n\n\n\nTABLE III\nIIIPERFORMANCE COMPARISON WITH EXISTING WORKS FOR HARMONIC \nPHASE WEIGHTING \n\nRef. \nBmax \nδ (dB) \nIL (dB) SBL (dB) Multibeam \n\n[15] \nfp \n9.94 \n0.7 \n0 \n− \n\n[17] \n2fp \n3.92 \n1.2 \n0 \n− \n\n[19] \n4fp \n5.17 \n2.4 \n-13.97 \n− \n\n[18] \n2fp \n3.92 \n1.0 \n0 \n− \n\n[21] \n8fp \n3.92 \n2.8 \n-25 \n− \n\n[20] \n8fp \n3.23 \n3.7 \n-16.9 \n− \n\n[22] \n32fp \n3.02 \n4.2 \n-29.83 \n\n[23] \n8fp \n2.54 \n3.9 \n-16.9 \n− \n\nProposed \nM fp \nsinc 2 ( π \nM ) \n− \n− \n− \n\nM = 6 *  \n6fp \n0.40 \n2.4 \n-13.97 \n− \n\nM = 16 *  \n16fp \n0.056 \n3.6/2.5 \n-23.52 \n− \n\nM = 32 *  \n32fp \n0.014 \n4.6 \n-29.83 \n− \n\n*Typical values: M = 6 for higher overall efficiency, lower hardware \ncomplexity and acceptable bandwidth, M = 16 and 32 for higher overall \nefficiency, wider bandwidth and acceptable hardware complexity. \n\n\n. 5 9 9 6 2 . 5 9 9 8 2 . 6 0 0 0 2 . 6 0 0 2 2 . 6 0 0 4 -3 0 -2 8 -2 6\nPattern\nPhased Array Antenna Handbook. R J Mailloux, Artech HouseNorwood, MA, USAR. J. Mailloux, Phased Array Antenna Handbook. Norwood, MA, USA: Artech House, 2005.\n\nA comparison of methods for randomizing phase quantization errors in phased arrays. M S Smith, Y C Guo, IEEE Trans. Antennas Propag. 316M. S. Smith and Y. C. Guo, \"A comparison of methods for randomiz- ing phase quantization errors in phased arrays,\" IEEE Trans. Antennas Propag., vol. 31, no. 6, pp. 821-828, Nov. 1983.\n\nArray grating lobes due to periodic phase, amplitude, and time delay quantization. R J Mailloux, IEEE Trans. Antennas Propag. 3212R. J. Mailloux, \"Array grating lobes due to periodic phase, amplitude, and time delay quantization,\" IEEE Trans. Antennas Propag., vol. 32, no. 12, pp. 1364-1368, Dec. 1984.\n\nOptimizing uniformly excited linear arrays through time modulation. J Fondevila, J Bregains, F Ares, E Moreno, IEEE Antennas Wirel. Propag. Lett. 31J. Fondevila, J. Bregains, F. Ares, and E. Moreno, \"Optimizing uniformly excited linear arrays through time modulation,\" IEEE Antennas Wirel. Propag. Lett., vol. 3, no. 1, pp. 298-301, 2004.\n\nDesign of a uniform amplitude time modulated linear array with optimized time sequences. S Yang, Y B Gan, A Qing, P K Tan, IEEE Trans. Antennas Propag. 537S. Yang, Y. B. Gan, A. Qing, and P. K. Tan, \"Design of a uniform amplitude time modulated linear array with optimized time sequences,\" IEEE Trans. Antennas Propag., vol. 53, no. 7, pp. 2337-2339, 2005.\n\nHandling sideband radiations in time-modulated arrays through particle swarm optimization. L Poli, P Rocca, L Manica, A Massa, IEEE Trans. Antennas Propag. 584L. Poli, P. Rocca, L. Manica, and A. Massa, \"Handling sideband radiations in time-modulated arrays through particle swarm optimization,\" IEEE Trans. Antennas Propag., vol. 58, no. 4, pp. 1408-1411, 2010.\n\nSideband radiation level suppression in time-modulated array by nonuniform period modulation. C He, H Yu, X Liang, J Geng, R Jin, IEEE Antennas Wirel. Propag. Lett. 14C. He, H. Yu, X. Liang, J. Geng, and R. Jin, \"Sideband radiation level suppression in time-modulated array by nonuniform period modulation,\" IEEE Antennas Wirel. Propag. Lett., vol. 14, pp. 606-609, 2014.\n\nPulse shaping strategy for time modulated arrays-analysis and design. E T Bekele, L Poli, P Rocca, IEEE Trans. Antennas Propag. 617E. T. Bekele, L. Poli, P. Rocca, et al, \"Pulse shaping strategy for time modulated arrays-analysis and design,\" IEEE Trans. Antennas Propag., vol. 61, no, 7, pp. 3525-3537, Jul. 2013.\n\nDirection finding by timemodulated array with harmonic characteristic analysis. C He, X Liang, Z Li, J Geng, R Jin, IEEE Antennas Wirel. Propag. Lett. 14C. He, X. Liang, Z. Li, J. Geng, and R. Jin, \"Direction finding by timem- odulated array with harmonic characteristic analysis,\" IEEE Antennas Wirel. Propag. Lett., vol. 14, pp. 642-645, 2014.\n\nTime-Modulated Multibeam Phased Arrays With Periodic Nyquist Pulses. R Maneiro-Catoira, J Brégains, J A Garcia-Naya, L Castedo, IEEE Antennas Wirel. Propag. Lett. 17R. Maneiro-Catoira, J. Brégains, J. A. Garcia-Naya and L. Castedo, \"Time-Modulated Multibeam Phased Arrays With Periodic Nyquist Pulses,\" IEEE Antennas Wirel. Propag. Lett., vol. 17, pp. 2508-2512, Dec 2018.\n\n4-D arrays as enabling technology for cognitive radio systems. P Rocca, Q Zhu, E T Bekele, S Yang, A Massa, IEEE Trans. Antennas Propag. 623P. Rocca, Q. Zhu, E. T. Bekele, S. Yang, and A. Massa, \"4-D arrays as enabling technology for cognitive radio systems,\" IEEE Trans. Antennas Propag., vol. 62, no. 3, pp. 1102-1116, Mar. 2014.\n\nMultiuser Communication by Electromagnetic Vortex Based on Time-Modulated Array. Y Liu, C He, X Liang, W Zhu, J Geng, R Jin, IEEE Antennas Wirel. Propag. Lett. 192Y. Liu, C. He, X. Liang, W. Zhu, J. Geng and R. Jin, \"Multiuser Communication by Electromagnetic Vortex Based on Time-Modulated Array,\" IEEE Antennas Wirel. Propag. Lett., vol. 19, no. 2, pp. 282-286, Feb. 2020.\n\nA novel electronic beam steering technique in time modulated antenna arrays. G Li, S Yang, Y Chen, Z Nie, Progr. Electromagn. Res. 97G. Li, S. Yang, Y. Chen, and Z. Nie, \"A novel electronic beam steering technique in time modulated antenna arrays,\" Progr. Electromagn. Res., vol. 97, pp. 391-405, 2009.\n\nHarmonic Beamforming in Time-Modulated Linear Arrays. L Poli, P Rocca, G Oliveri, A Massa, IEEE Trans. Antennas Propag. 597L. Poli, P. Rocca, G. Oliveri and A. Massa, \"Harmonic Beamforming in Time-Modulated Linear Arrays,\" IEEE Trans. Antennas Propag., vol. 59, no. 7, pp. 2538-2545, July 2011.\n\nX-band antenna array for low-cost beam scanning. Y Yashchyshyn, K Godziszewski, G Bogdan, IET Microwaves Antennas Propag. Yashchyshyn Y, Godziszewski K, Bogdan G, et al. \"X-band antenna array for low-cost beam scanning\". IET Microwaves Antennas Propag., pp. 2174-2178, 2017.\n\nTime-Modulated Antenna Array With Lossless Switching Network. G Bogdan, Y Yashchyshyn, M Jarzynka, IEEE Antennas Wirel. Propag. Lett. 15G. Bogdan, Y. Yashchyshyn and M. Jarzynka, \"Time-Modulated An- tenna Array With Lossless Switching Network,\" IEEE Antennas Wirel. Propag. Lett., vol. 15, pp. 1827-1830, 2016.\n\nTime-Modulated Antenna Array for Real-Time Adaptation in Wideband Wireless Systems-Part I: Design and Characterization. G Bogdan, K Godziszewski, Y Yashchyshyn, C H Kim, S. -B Hyun, IEEE Trans. Antennas Propag. 6810G. Bogdan, K. Godziszewski, Y. Yashchyshyn, C. H. Kim and S. - B. Hyun, \"Time-Modulated Antenna Array for Real-Time Adaptation in Wideband Wireless Systems-Part I: Design and Characterization,\" IEEE Trans. Antennas Propag., vol. 68, no. 10, pp. 6964-6972, Oct. 2020.\n\nMicrowave Sampling Beamformer-Prototype Verification and Switch Design. S Farzaneh, A Sebak, IEEE Trans. Microw. Theory Techn. 571S. Farzaneh and A. Sebak, \"Microwave Sampling Beam- former-Prototype Verification and Switch Design,\" IEEE Trans. Microw. Theory Techn., vol. 57, no. 1, pp. 36-44, Jan. 2009.\n\nSingle-sideband time-modulated phased array. A.-M Yao, W Wu, D.-G Fang, IEEE Trans. Antennas Propag. 635A.-M. Yao, W. Wu, and D.-G. Fang, \"Single-sideband time-modulated phased array,\" IEEE Trans. Antennas Propag., vol. 63, no. 5, pp. 1957-1968, May 2015.\n\nEnhanced Single-Sideband Time-Modulated Phased Array With Lower Sideband Level and Loss. Q Chen, J Zhang, W Wu, D Fang, IEEE Trans. Antennas Propag. 681Q. Chen, J. Zhang, W. Wu and D. Fang, \"Enhanced Single-Sideband Time-Modulated Phased Array With Lower Sideband Level and Loss,\" IEEE Trans. Antennas Propag., vol. 68, no. 1, pp. 275-286, Jan. 2020.\n\nHarmonic Beamforming in Antenna Array With Time-Modulated Amplitude-Phase Weighting Technique. H Li, Y Chen, S Yang, IEEE Trans. Antennas Propag. 6710H. Li, Y. Chen and S. Yang, \"Harmonic Beamforming in Antenna Array With Time-Modulated Amplitude-Phase Weighting Technique,\" IEEE Trans. Antennas Propag., vol. 67, no. 10, pp. 6461-6472, Oct. 2019.\n\nTime-Modulated Arrays with Haar Wavelets. R Maneiro-Catoira, J Brégains, J A Garcia-Naya, L Castedo, 10.1109/LAWP.2020.2986832IEEE Antennas Wirel. Propag. Lett. R. Maneiro-Catoira, J. Brégains, J. A. Garcia-Naya and L. Castedo, \"Time-Modulated Arrays with Haar Wavelets,\" IEEE Antennas Wirel. Propag. Lett., doi: 10.1109/LAWP.2020.2986832.\n\nTime-modulated array beamforming with periodic stair-step pulses. R Maneiro-Catoira, J Brégains, J A Garcia-Naya, L Castedo, Signal Processing. 166107247R. Maneiro-Catoira, J. Brégains, J. A. Garcia-Naya and L. Castedo, \"Time-modulated array beamforming with periodic stair-step pulses,\" Signal Processing, vol. 166, p. 107247, 2020.\n\nPhase modulation technique for fourdimensional arrays. J Yang, W Li, X Shi, IEEE Antennas Wirel. Propag. Lett. 13J. Yang, W. Li, and X. Shi, \"Phase modulation technique for four- dimensional arrays,\" IEEE Antennas Wirel. Propag. Lett., vol. 13, pp. 1393-1396, 2014.\n\nAn improved phase modulation technique based on four-dimensional arrays. C Sun, S Yang, Y Chen, J Guo, Z Nie, IEEE Antennas Wirel. Propag. Lett. 16C. Sun, S. Yang, Y. Chen, J. Guo, and Z. Nie, \"An improved phase modulation technique based on four-dimensional arrays,\" IEEE Antennas Wirel. Propag. Lett., vol. 16, pp. 1175-1178, 2016.\n\nLow Sideband Radiation Beam Scanning at Carrier Frequency for Time-Modulated Array by Non-Uniform Period Modulation. G Ni, C He, J Chen, Y Liu, R Jin, IEEE Trans. Antennas Propag. 685G. Ni, C. He, J. Chen, Y. Liu and R. Jin, \"Low Sideband Radiation Beam Scanning at Carrier Frequency for Time-Modulated Array by Non- Uniform Period Modulation,\" IEEE Trans. Antennas Propag., vol. 68, no. 5, pp. 3695-3704, May 2020.\n\nPerformance analysis of time-modulated arrays for the angle diversity reception of digital linear modulated signals. R Maneiro-Catoira, J C Brégains, J A García-Naya, L Castedo, P Rocca, L Poli, IEEE J. Sel. Topics Signal Process. 112R. Maneiro-Catoira, J. C. Brégains, J. A. García-Naya, L. Castedo, P. Rocca, and L. Poli, \"Performance analysis of time-modulated arrays for the angle diversity reception of digital linear modulated signals,\" IEEE J. Sel. Topics Signal Process., vol. 11, no. 2, pp. 247-258, Mar. 2017.\n\nPulseshaping strategy for time modulated arrays-analysis and design. E T Bekele, L Poli, P Rocca, M D&apos;urso, A Massa, IEEE Trans. Antennas Propag. 617E. T. Bekele, L. Poli, P. Rocca, M. D'Urso, and A. Massa, \"Pulse- shaping strategy for time modulated arrays-analysis and design,\" IEEE Trans. Antennas Propag., vol. 61, no. 7, pp. 3525-3537, Jul. 2013.\n\nOn the feasibility of time-modulated arrays for digital linear modulations: A theoretical analysis. R Maneiro-Catoira, J C Brégains, J A García-Naya, L Castedo, IEEE Trans. Antennas Propag. 6212R. Maneiro-Catoira, J. C. Brégains, J. A. García-Naya, and L. Castedo, \"On the feasibility of time-modulated arrays for digital linear modula- tions: A theoretical analysis,\" IEEE Trans. Antennas Propag., vol. 62, no. 12, pp. 6114-6122, Dec. 2014.\n\nMultibeam Single-Sideband Time-Modulated Arrays. R Maneiro-Catoira, J A García-Naya, J C Brégains, L Castedo, IEEE Access. 8R. Maneiro-Catoira, J. A. García-Naya, J. C. Brégains and L. Castedo, \"Multibeam Single-Sideband Time-Modulated Arrays,\" IEEE Access, vol. 8, pp. 151976-151989, 2020.\n\n. A Devices Gaas, Mmic Spst, Switch, 6A. DEVICES. GaAs MMIC SPST FAILSAFE SWITCH, DC -6\n\n. Ghz, GHz. [Online]. Available: https://www.analog.com/media/en/technical- documentation/data-sheets/hmc550ae.pdf.\n\n. A Devices Gaas Mmic T/R Switch, Dc -4 Ghz, A. DEVICES. GaAs MMIC T/R SWITCH, DC -4 GHz. [Online].\n\nA Devices, DC -3.5GaAs MMIC SP3T Non-REFLECTIVE SWITCH. A. DEVICES. GaAs MMIC SP3T Non-REFLECTIVE SWITCH, DC -3.5\n\n. Ghz, GHz. [Online]. Available: https //www.analog.com/media/en/technical- documentation/data-sheets/HMC245AQS16E.pdf.\n\n. A Devices Gaas, Mmic Sp4t Non-Reflective Switch, Dc -, A. DEVICES. GaAs MMIC SP4T NON-REFLECTIVE SWITCH, DC -\n\n. Ghz, GHz. [Online]. Available: https://www.analog.com/media/en/technical- documentation/data-sheets/hmc244a.pdf.\n\n. A Devices Gaas, Mmic Sp6t Non-Reflective Switch, Dc -, A. DEVICES. GaAs MMIC SP6T NON-REFLECTIVE SWITCH, DC -\n\n. Ghz, GHz. [Online]. Available: https://www.analog.com/media/en/technical- documentation/data-sheets/hmc252A.pdf.\n\nSCG-2-322+: 2 Ways LTCC Power Splitter. Minicircuits, Minicircuits. SCG-2-322+: 2 Ways LTCC Power Splitter, 1800 -3200\n\n. Mhz, MHz, 50Ω. [Online]. Available: https://www.minicircuits.com/pdfs/SCG- 2-322+.pdf.\n\nSEPS-3-33+: 3 Ways Microstrip Power Splitter. Minicircuits, Minicircuits. SEPS-3-33+: 3 Ways Microstrip Power Splitter, 700 -3000\n\n. Mhz, MHz, 50Ω. [Online]. Available: https://www.minicircuits.com/pdfs/SEPS- 3-33+.pdf.\n\nMinicircuits. ZB4PD-462W-N+: 4 Ways DC Pass Power Splitter. Minicircuits. ZB4PD-462W-N+: 4 Ways DC Pass Power Splitter, 380 - 4600\n\n. 50ω Mhz, MHz, 50Ω. [Online].\n\nGang Ni received the B.S. degree in electronic information engineering from Beihang University. Macom. MAPS-010144: Digital Phase Shifter, 4-Bit, 2.3 -3.8 GHzBeijing, China; Shanghai, ChinaDepartment of Electronic Engineering, Shanghai Jiao Tong UniversityOnline. He is currently pursuing the Ph.D. degree in. His research interests include DOA estimation, digital beamforming and wireless communicationMacom. MAPS-010144: Digital Phase Shifter, 4-Bit, 2.3 -3.8 GHz [On- line]. Available: https://cdn.macom.com/datasheets/MAPS-010144.pdf. Gang Ni received the B.S. degree in electronic information engineering from Beihang University, Beijing, China, in 2018. Since 2018, He is currently pursuing the Ph.D. degree in Department of Elec- tronic Engineering, Shanghai Jiao Tong University, Shanghai, China. His research interests include DOA estimation, digital beamforming and wireless communication.\n\nSince 2019, he has jointed Shanghai Jiao Tong University as an assistant professor. His research interests include phased arrays, DOA estimation, digital beamforming, location and multi-address wireless communication. Yanchang Gao received the B.S. degree in electronic engineering from Xidian University. Chong He, Member, IEEE) received the B.Sc. degree in electronic and information engineering and M.S. degree in electromagnetic and microwave technology from Huazhong University of Science and Technology. Wuhan, China; Shanghai, China; Xi'an, China; Shanghai, ChinaShanghai Jiao Tong University ; Department of Electronic Engineering, Shanghai Jiao Tong UniversityHe is currently pursuing the Ph.D. degree in electromagnetic and microwave technology with Shanghai Jiao Tong University (SJTU). His current research interests include microstrip circuit, microstrip antenna and array, and timemodulated arrayChong He (Member, IEEE) received the B.Sc. degree in electronic and information engineering and M.S. degree in electromagnetic and microwave technology from Huazhong University of Science and Technology, Wuhan, China, in 2007 and 2009 respectively, and the Ph. D. degree in electromag- netic and microwave technology from Shanghai Jiao Tong University, Shanghai, China, in 2015. From 2016 to 2018, he was a post doctor researcher in Department of Electronic Engineering, Shanghai Jiao Tong University. Since 2019, he has jointed Shanghai Jiao Tong University as an assistant professor. His research interests include phased arrays, DOA estimation, digital beamforming, location and multi-address wireless communication. Yanchang Gao received the B.S. degree in elec- tronic engineering from Xidian University, Xi'an, China, in 2018. He is currently pursuing the Ph.D. degree in electromagnetic and microwave technol- ogy with Shanghai Jiao Tong University (SJTU), Shanghai, China. His current research interests include microstrip circuit, microstrip antenna and array, and time- modulated array.\n\nHe has been a post doctor researcher in Department of Electronic Engineering. Jingfeng Chen received the B.S. degree in electronics and information engineering and M.S. degree in signal and information processing from Nanjing University of Information Science and Technology. Nanjing, China; Shanghai, ChinaShanghai Jiao Tong Universityrespectively, and the Ph. D. degree in electromagnetic and microwave technology from Shanghai Jiao Tong University. His research interests include antenna arrays, unconventional array design, DBF, and DOA estimationJingfeng Chen received the B.S. degree in elec- tronics and information engineering and M.S. degree in signal and information processing from Nanjing University of Information Science and Technology, Nanjing, China, in 2009 and 2012, respectively, and the Ph. D. degree in electromagnetic and microwave technology from Shanghai Jiao Tong University, Shanghai, China, in 2018. Since 2019, He has been a post doctor researcher in Department of Electronic Engineering, Shanghai Jiao Tong University. His research interests include antenna arrays, un- conventional array design, DBF, and DOA estimation.\n\nHe has authored or co-authored over 300 papers in refereed journals and conference proceedings and co-authored four books. He holds about 60 patents in antenna and wireless technologies. Ronghong Jin (Fellow, IEEE) received the B.S. degree in electronic engineering, the M.S. degree in electromagnetic and microwave technology, and the Ph.D. degree in communication and electronic systems from Shanghai Jiao Tong University (SJTU). Shanghai, China; Tokyo, Japan; Wollongong, NSW, Australia; Sydney, NSW, AustraliaDepartment of Electrical and Electronic Engineering, Tokyo Institute of Technology ; Guest Professor with the University of Wollongonghe joined the faculty of the Department of Electronic Engineering, SJTU, where he has been an Assistant, a Lecturer, an Associate Professor, and is currently a Professor. His current research interests include antennas, electromagnetic theory, numerical techniques of solving field problems, and wireless communicationRonghong Jin (Fellow, IEEE) received the B.S. degree in electronic engineering, the M.S. degree in electromagnetic and microwave technology, and the Ph.D. degree in communication and electronic sys- tems from Shanghai Jiao Tong University (SJTU), Shanghai, China, in 1983, 1986, and 1993, respec- tively. In 1986, he joined the faculty of the Department of Electronic Engineering, SJTU, where he has been an Assistant, a Lecturer, an Associate Professor, and is currently a Professor. From 1997 to 1999, he was a Visiting Scholar with the Department of Electrical and Electronic Engineering, Tokyo Institute of Technology, Meguro, Japan. From 2001 to 2002, he was a Special Invited Research Fellow with the Communication Research Laboratory, Tokyo, Japan. From 2006 to 2009, he was a Guest Professor with the University of Wollongong, Wollongong, NSW, Australia. He is also a Distinguish Guest Scientist with the Commonwealth Scientific and Industrial Research Organization, Sydney, NSW, Australia. He has authored or co-authored over 300 papers in refereed journals and conference proceedings and co-authored four books. He holds about 60 patents in antenna and wireless technologies. His current research interests include antennas, electromagnetic theory, numerical techniques of solving field problems, and wireless commu- nication.\n\nHe was a recipient of the National Technology Innovation Award, the National Nature Science Award, the 2012 Nomination of National Excellent Doctoral Dissertation (Supervisor), the Shanghai Nature Science Award, and the Shanghai Science and Technology Progress Award. Dr, Beijing, ChinaJin is a Committee Member of the Antenna Branch of the Chinese Institute of ElectronicsDr. Jin is a Committee Member of the Antenna Branch of the Chinese Institute of Electronics, Beijing, China. He was a recipient of the National Technology Innovation Award, the National Nature Science Award, the 2012 Nomination of National Excellent Doctoral Dissertation (Supervisor), the Shanghai Nature Science Award, and the Shanghai Science and Technology Progress Award.\n", "annotations": {"author": "[{\"end\":130,\"start\":122},{\"end\":152,\"start\":131},{\"end\":166,\"start\":153},{\"end\":181,\"start\":167},{\"end\":207,\"start\":182}]", "publisher": null, "author_last_name": "[{\"end\":129,\"start\":127},{\"end\":151,\"start\":149},{\"end\":165,\"start\":162},{\"end\":180,\"start\":176},{\"end\":206,\"start\":203}]", "author_first_name": "[{\"end\":126,\"start\":122},{\"end\":148,\"start\":143},{\"end\":161,\"start\":153},{\"end\":175,\"start\":167},{\"end\":202,\"start\":194}]", "author_affiliation": null, "title": "[{\"end\":119,\"start\":1},{\"end\":326,\"start\":208}]", "venue": null, "abstract": "[{\"end\":2190,\"start\":647}]", "bib_ref": "[{\"attributes\":{\"ref_id\":\"b0\"},\"end\":2367,\"start\":2364},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":2680,\"start\":2677},{\"end\":2709,\"start\":2706},{\"end\":3696,\"start\":3693},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":3699,\"start\":3696},{\"attributes\":{\"ref_id\":\"b5\"},\"end\":3702,\"start\":3699},{\"attributes\":{\"ref_id\":\"b6\"},\"end\":3736,\"start\":3733},{\"attributes\":{\"ref_id\":\"b7\"},\"end\":3767,\"start\":3764},{\"attributes\":{\"ref_id\":\"b8\"},\"end\":3940,\"start\":3937},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":3979,\"start\":3975},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":4006,\"start\":4002},{\"attributes\":{\"ref_id\":\"b11\"},\"end\":4038,\"start\":4034},{\"attributes\":{\"ref_id\":\"b12\"},\"end\":4217,\"start\":4213},{\"attributes\":{\"ref_id\":\"b13\"},\"end\":4221,\"start\":4217},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":4225,\"start\":4221},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":4229,\"start\":4225},{\"attributes\":{\"ref_id\":\"b16\"},\"end\":4233,\"start\":4229},{\"attributes\":{\"ref_id\":\"b17\"},\"end\":4237,\"start\":4233},{\"attributes\":{\"ref_id\":\"b18\"},\"end\":4241,\"start\":4237},{\"attributes\":{\"ref_id\":\"b19\"},\"end\":4245,\"start\":4241},{\"attributes\":{\"ref_id\":\"b20\"},\"end\":4249,\"start\":4245},{\"attributes\":{\"ref_id\":\"b21\"},\"end\":4253,\"start\":4249},{\"attributes\":{\"ref_id\":\"b22\"},\"end\":4257,\"start\":4253},{\"attributes\":{\"ref_id\":\"b12\"},\"end\":4490,\"start\":4486},{\"attributes\":{\"ref_id\":\"b13\"},\"end\":4494,\"start\":4490},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":4498,\"start\":4494},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":5344,\"start\":5340},{\"attributes\":{\"ref_id\":\"b16\"},\"end\":5347,\"start\":5344},{\"attributes\":{\"ref_id\":\"b17\"},\"end\":5407,\"start\":5403},{\"attributes\":{\"ref_id\":\"b18\"},\"end\":5642,\"start\":5638},{\"attributes\":{\"ref_id\":\"b19\"},\"end\":5707,\"start\":5703},{\"attributes\":{\"ref_id\":\"b20\"},\"end\":5735,\"start\":5731},{\"attributes\":{\"ref_id\":\"b29\"},\"end\":5886,\"start\":5884},{\"attributes\":{\"ref_id\":\"b18\"},\"end\":5917,\"start\":5913},{\"attributes\":{\"ref_id\":\"b19\"},\"end\":5921,\"start\":5917},{\"attributes\":{\"ref_id\":\"b20\"},\"end\":5925,\"start\":5921},{\"attributes\":{\"ref_id\":\"b21\"},\"end\":6091,\"start\":6087},{\"attributes\":{\"ref_id\":\"b22\"},\"end\":6100,\"start\":6096},{\"attributes\":{\"ref_id\":\"b21\"},\"end\":6193,\"start\":6189},{\"attributes\":{\"ref_id\":\"b22\"},\"end\":6202,\"start\":6198},{\"attributes\":{\"ref_id\":\"b23\"},\"end\":6474,\"start\":6470},{\"attributes\":{\"ref_id\":\"b24\"},\"end\":6478,\"start\":6474},{\"attributes\":{\"ref_id\":\"b25\"},\"end\":6482,\"start\":6478},{\"attributes\":{\"ref_id\":\"b25\"},\"end\":7376,\"start\":7372},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":11270,\"start\":11267},{\"attributes\":{\"ref_id\":\"b12\"},\"end\":11478,\"start\":11474},{\"attributes\":{\"ref_id\":\"b13\"},\"end\":11482,\"start\":11478},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":11486,\"start\":11482},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":11490,\"start\":11486},{\"attributes\":{\"ref_id\":\"b16\"},\"end\":11494,\"start\":11490},{\"attributes\":{\"ref_id\":\"b17\"},\"end\":11498,\"start\":11494},{\"attributes\":{\"ref_id\":\"b18\"},\"end\":11502,\"start\":11498},{\"attributes\":{\"ref_id\":\"b19\"},\"end\":11506,\"start\":11502},{\"attributes\":{\"ref_id\":\"b20\"},\"end\":11510,\"start\":11506},{\"attributes\":{\"ref_id\":\"b21\"},\"end\":11514,\"start\":11510},{\"attributes\":{\"ref_id\":\"b22\"},\"end\":11518,\"start\":11514},{\"attributes\":{\"ref_id\":\"b20\"},\"end\":13309,\"start\":13305},{\"attributes\":{\"ref_id\":\"b13\"},\"end\":14778,\"start\":14774},{\"attributes\":{\"ref_id\":\"b21\"},\"end\":15051,\"start\":15047},{\"attributes\":{\"ref_id\":\"b26\"},\"end\":15057,\"start\":15053},{\"attributes\":{\"ref_id\":\"b19\"},\"end\":15903,\"start\":15899},{\"attributes\":{\"ref_id\":\"b26\"},\"end\":16215,\"start\":16211},{\"attributes\":{\"ref_id\":\"b27\"},\"end\":18473,\"start\":18469},{\"attributes\":{\"ref_id\":\"b18\"},\"end\":18482,\"start\":18478},{\"attributes\":{\"ref_id\":\"b18\"},\"end\":18532,\"start\":18528},{\"attributes\":{\"ref_id\":\"b19\"},\"end\":20399,\"start\":20395},{\"attributes\":{\"ref_id\":\"b28\"},\"end\":20445,\"start\":20441},{\"attributes\":{\"ref_id\":\"b29\"},\"end\":20451,\"start\":20447},{\"attributes\":{\"ref_id\":\"b24\"},\"end\":20505,\"start\":20501},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":21989,\"start\":21986},{\"attributes\":{\"ref_id\":\"b13\"},\"end\":24137,\"start\":24133},{\"attributes\":{\"ref_id\":\"b16\"},\"end\":25743,\"start\":25739},{\"attributes\":{\"ref_id\":\"b29\"},\"end\":25752,\"start\":25748},{\"attributes\":{\"ref_id\":\"b29\"},\"end\":25990,\"start\":25986},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":26403,\"start\":26399},{\"attributes\":{\"ref_id\":\"b16\"},\"end\":26409,\"start\":26405},{\"attributes\":{\"ref_id\":\"b17\"},\"end\":26418,\"start\":26414},{\"attributes\":{\"ref_id\":\"b17\"},\"end\":26877,\"start\":26873},{\"attributes\":{\"ref_id\":\"b18\"},\"end\":26881,\"start\":26877},{\"attributes\":{\"ref_id\":\"b19\"},\"end\":26885,\"start\":26881},{\"attributes\":{\"ref_id\":\"b21\"},\"end\":27151,\"start\":27147},{\"attributes\":{\"ref_id\":\"b21\"},\"end\":27415,\"start\":27411},{\"attributes\":{\"ref_id\":\"b28\"},\"end\":27551,\"start\":27547},{\"attributes\":{\"ref_id\":\"b13\"},\"end\":30833,\"start\":30829},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":31630,\"start\":31628},{\"end\":31955,\"start\":31952},{\"attributes\":{\"ref_id\":\"b16\"},\"end\":32455,\"start\":32451},{\"attributes\":{\"ref_id\":\"b16\"},\"end\":33999,\"start\":33995},{\"attributes\":{\"ref_id\":\"b16\"},\"end\":36292,\"start\":36288},{\"attributes\":{\"ref_id\":\"b13\"},\"end\":37185,\"start\":37181},{\"end\":37455,\"start\":37453},{\"end\":37457,\"start\":37455},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":37459,\"start\":37457},{\"attributes\":{\"ref_id\":\"b13\"},\"end\":37775,\"start\":37771},{\"attributes\":{\"ref_id\":\"b26\"},\"end\":42521,\"start\":42517}]", "figure": "[{\"attributes\":{\"id\":\"fig_0\"},\"end\":41673,\"start\":41428},{\"attributes\":{\"id\":\"fig_2\"},\"end\":41870,\"start\":41674},{\"attributes\":{\"id\":\"fig_3\"},\"end\":42235,\"start\":41871},{\"attributes\":{\"id\":\"fig_5\"},\"end\":42386,\"start\":42236},{\"attributes\":{\"id\":\"fig_7\"},\"end\":42489,\"start\":42387},{\"attributes\":{\"id\":\"fig_8\"},\"end\":42800,\"start\":42490},{\"attributes\":{\"id\":\"fig_9\"},\"end\":42972,\"start\":42801},{\"attributes\":{\"id\":\"fig_10\"},\"end\":43076,\"start\":42973},{\"attributes\":{\"id\":\"fig_11\"},\"end\":43274,\"start\":43077},{\"attributes\":{\"id\":\"fig_12\"},\"end\":43433,\"start\":43275},{\"attributes\":{\"id\":\"fig_13\"},\"end\":44392,\"start\":43434},{\"attributes\":{\"id\":\"fig_15\"},\"end\":44528,\"start\":44393},{\"attributes\":{\"id\":\"fig_16\"},\"end\":44914,\"start\":44529},{\"attributes\":{\"id\":\"fig_17\"},\"end\":45130,\"start\":44915},{\"attributes\":{\"id\":\"fig_18\"},\"end\":45308,\"start\":45131},{\"attributes\":{\"id\":\"fig_19\"},\"end\":45444,\"start\":45309},{\"attributes\":{\"id\":\"fig_20\"},\"end\":45572,\"start\":45445},{\"attributes\":{\"id\":\"fig_21\"},\"end\":46149,\"start\":45573},{\"attributes\":{\"id\":\"fig_22\"},\"end\":46328,\"start\":46150},{\"attributes\":{\"id\":\"fig_23\"},\"end\":46461,\"start\":46329},{\"attributes\":{\"id\":\"fig_24\"},\"end\":46571,\"start\":46462},{\"attributes\":{\"id\":\"fig_25\"},\"end\":46675,\"start\":46572},{\"attributes\":{\"id\":\"tab_0\",\"type\":\"table\"},\"end\":47099,\"start\":46676},{\"attributes\":{\"id\":\"tab_1\",\"type\":\"table\"},\"end\":47203,\"start\":47100},{\"attributes\":{\"id\":\"tab_4\",\"type\":\"table\"},\"end\":47754,\"start\":47204},{\"attributes\":{\"id\":\"tab_5\",\"type\":\"table\"},\"end\":48516,\"start\":47755}]", "paragraph": "[{\"end\":2935,\"start\":2209},{\"end\":4039,\"start\":2937},{\"end\":6483,\"start\":4041},{\"end\":7250,\"start\":6485},{\"end\":8505,\"start\":7252},{\"end\":9009,\"start\":8507},{\"end\":9396,\"start\":9061},{\"end\":9508,\"start\":9398},{\"end\":9663,\"start\":9577},{\"end\":10121,\"start\":9707},{\"end\":10237,\"start\":10154},{\"end\":10389,\"start\":10276},{\"end\":10617,\"start\":10530},{\"end\":10983,\"start\":10695},{\"end\":11065,\"start\":10985},{\"end\":11563,\"start\":11145},{\"end\":11757,\"start\":11624},{\"end\":12058,\"start\":11805},{\"end\":12725,\"start\":12060},{\"end\":13179,\"start\":12840},{\"end\":13598,\"start\":13181},{\"end\":13843,\"start\":13630},{\"end\":14153,\"start\":13901},{\"end\":14228,\"start\":14179},{\"end\":14351,\"start\":14230},{\"end\":14510,\"start\":14424},{\"end\":15058,\"start\":14562},{\"end\":15904,\"start\":15111},{\"end\":16094,\"start\":15944},{\"end\":16425,\"start\":16113},{\"end\":16719,\"start\":16476},{\"end\":16885,\"start\":16759},{\"end\":17110,\"start\":16887},{\"end\":17584,\"start\":17112},{\"end\":18125,\"start\":17600},{\"end\":18699,\"start\":18178},{\"end\":18936,\"start\":18726},{\"end\":19255,\"start\":18938},{\"end\":19424,\"start\":19336},{\"end\":19607,\"start\":19548},{\"end\":19767,\"start\":19670},{\"end\":20052,\"start\":19962},{\"end\":20290,\"start\":20138},{\"end\":20466,\"start\":20345},{\"end\":20861,\"start\":20497},{\"end\":21095,\"start\":20904},{\"end\":22468,\"start\":21138},{\"end\":23901,\"start\":22470},{\"end\":25304,\"start\":23938},{\"end\":26066,\"start\":25354},{\"end\":27878,\"start\":26104},{\"end\":28130,\"start\":27905},{\"end\":29344,\"start\":28154},{\"end\":30896,\"start\":29346},{\"end\":32570,\"start\":30898},{\"end\":34204,\"start\":32622},{\"end\":34846,\"start\":34206},{\"end\":35835,\"start\":34848},{\"end\":36854,\"start\":35837},{\"end\":40121,\"start\":36900},{\"end\":41427,\"start\":40149}]", "formula": "[{\"attributes\":{\"id\":\"formula_0\"},\"end\":9576,\"start\":9509},{\"attributes\":{\"id\":\"formula_1\"},\"end\":9706,\"start\":9664},{\"attributes\":{\"id\":\"formula_2\"},\"end\":10153,\"start\":10122},{\"attributes\":{\"id\":\"formula_3\"},\"end\":10275,\"start\":10238},{\"attributes\":{\"id\":\"formula_4\"},\"end\":10529,\"start\":10390},{\"attributes\":{\"id\":\"formula_5\"},\"end\":10694,\"start\":10618},{\"attributes\":{\"id\":\"formula_6\"},\"end\":11144,\"start\":11066},{\"attributes\":{\"id\":\"formula_7\"},\"end\":11623,\"start\":11564},{\"attributes\":{\"id\":\"formula_8\"},\"end\":11804,\"start\":11758},{\"attributes\":{\"id\":\"formula_9\"},\"end\":12809,\"start\":12726},{\"attributes\":{\"id\":\"formula_10\"},\"end\":13629,\"start\":13599},{\"attributes\":{\"id\":\"formula_11\"},\"end\":13900,\"start\":13844},{\"attributes\":{\"id\":\"formula_12\"},\"end\":14178,\"start\":14154},{\"attributes\":{\"id\":\"formula_13\"},\"end\":14423,\"start\":14352},{\"attributes\":{\"id\":\"formula_14\"},\"end\":14561,\"start\":14511},{\"attributes\":{\"id\":\"formula_15\"},\"end\":15110,\"start\":15059},{\"attributes\":{\"id\":\"formula_16\"},\"end\":15943,\"start\":15905},{\"attributes\":{\"id\":\"formula_17\"},\"end\":16112,\"start\":16095},{\"attributes\":{\"id\":\"formula_18\"},\"end\":16475,\"start\":16426},{\"attributes\":{\"id\":\"formula_19\"},\"end\":16758,\"start\":16720},{\"attributes\":{\"id\":\"formula_20\"},\"end\":17599,\"start\":17585},{\"attributes\":{\"id\":\"formula_21\"},\"end\":18725,\"start\":18700},{\"attributes\":{\"id\":\"formula_22\"},\"end\":19335,\"start\":19256},{\"attributes\":{\"id\":\"formula_23\"},\"end\":19547,\"start\":19425},{\"attributes\":{\"id\":\"formula_24\"},\"end\":19669,\"start\":19608},{\"attributes\":{\"id\":\"formula_25\"},\"end\":19961,\"start\":19768},{\"attributes\":{\"id\":\"formula_26\"},\"end\":20137,\"start\":20053},{\"attributes\":{\"id\":\"formula_27\"},\"end\":20344,\"start\":20291},{\"attributes\":{\"id\":\"formula_28\"},\"end\":20496,\"start\":20467},{\"attributes\":{\"id\":\"formula_29\"},\"end\":20877,\"start\":20862},{\"attributes\":{\"id\":\"formula_30\"},\"end\":26103,\"start\":26067},{\"attributes\":{\"id\":\"formula_32\"},\"end\":40148,\"start\":40122}]", "table_ref": "[{\"attributes\":{\"ref_id\":\"tab_0\"},\"end\":4481,\"start\":4474},{\"attributes\":{\"ref_id\":\"tab_0\"},\"end\":25574,\"start\":25566},{\"attributes\":{\"ref_id\":\"tab_0\"},\"end\":26385,\"start\":26376},{\"attributes\":{\"ref_id\":\"tab_0\"},\"end\":28589,\"start\":28579}]", "section_header": "[{\"end\":2207,\"start\":2192},{\"end\":9059,\"start\":9012},{\"end\":12838,\"start\":12811},{\"end\":18176,\"start\":18128},{\"end\":20902,\"start\":20879},{\"end\":21136,\"start\":21098},{\"end\":23936,\"start\":23904},{\"end\":25352,\"start\":25307},{\"end\":27903,\"start\":27881},{\"end\":28152,\"start\":28133},{\"end\":32620,\"start\":32573},{\"end\":36898,\"start\":36857},{\"end\":41683,\"start\":41675},{\"end\":42245,\"start\":42237},{\"end\":42396,\"start\":42388},{\"end\":42499,\"start\":42491},{\"end\":42810,\"start\":42802},{\"end\":42982,\"start\":42974},{\"end\":43086,\"start\":43078},{\"end\":43284,\"start\":43276},{\"end\":44402,\"start\":44394},{\"end\":44539,\"start\":44530},{\"end\":44925,\"start\":44916},{\"end\":45140,\"start\":45132},{\"end\":45319,\"start\":45310},{\"end\":45455,\"start\":45446},{\"end\":46160,\"start\":46151},{\"end\":46339,\"start\":46330},{\"end\":46472,\"start\":46463},{\"end\":46582,\"start\":46573},{\"end\":46696,\"start\":46677},{\"end\":47222,\"start\":47205},{\"end\":47765,\"start\":47756}]", "table": "[{\"end\":47099,\"start\":46726},{\"end\":47203,\"start\":47199},{\"end\":47754,\"start\":47292},{\"end\":48516,\"start\":47769}]", "figure_caption": "[{\"end\":41673,\"start\":41430},{\"end\":41870,\"start\":41685},{\"end\":42235,\"start\":41873},{\"end\":42386,\"start\":42247},{\"end\":42489,\"start\":42398},{\"end\":42800,\"start\":42501},{\"end\":42972,\"start\":42812},{\"end\":43076,\"start\":42984},{\"end\":43274,\"start\":43088},{\"end\":43433,\"start\":43286},{\"end\":44392,\"start\":43436},{\"end\":44528,\"start\":44404},{\"end\":44914,\"start\":44542},{\"end\":45130,\"start\":44928},{\"end\":45308,\"start\":45143},{\"end\":45444,\"start\":45322},{\"end\":45572,\"start\":45458},{\"end\":46149,\"start\":45575},{\"end\":46328,\"start\":46163},{\"end\":46461,\"start\":46342},{\"end\":46571,\"start\":46475},{\"end\":46675,\"start\":46585},{\"end\":46726,\"start\":46698},{\"end\":47199,\"start\":47102},{\"end\":47292,\"start\":47225}]", "figure_ref": "[{\"attributes\":{\"ref_id\":\"fig_2\"},\"end\":9151,\"start\":9142},{\"attributes\":{\"ref_id\":\"fig_2\"},\"end\":9482,\"start\":9476},{\"attributes\":{\"ref_id\":\"fig_5\"},\"end\":12378,\"start\":12369},{\"attributes\":{\"ref_id\":\"fig_7\"},\"end\":12957,\"start\":12950},{\"attributes\":{\"ref_id\":\"fig_2\"},\"end\":16499,\"start\":16490},{\"attributes\":{\"ref_id\":\"fig_5\"},\"end\":16787,\"start\":16781},{\"attributes\":{\"ref_id\":\"fig_8\"},\"end\":18641,\"start\":18635},{\"attributes\":{\"ref_id\":\"fig_8\"},\"end\":19216,\"start\":19210},{\"attributes\":{\"ref_id\":\"fig_2\"},\"end\":21678,\"start\":21669},{\"attributes\":{\"ref_id\":\"fig_9\"},\"end\":21686,\"start\":21680},{\"attributes\":{\"ref_id\":\"fig_10\"},\"end\":22563,\"start\":22557},{\"attributes\":{\"ref_id\":\"fig_11\"},\"end\":22884,\"start\":22878},{\"attributes\":{\"ref_id\":\"fig_5\"},\"end\":23776,\"start\":23770},{\"attributes\":{\"ref_id\":\"fig_7\"},\"end\":24044,\"start\":24038},{\"attributes\":{\"ref_id\":\"fig_12\"},\"end\":24327,\"start\":24321},{\"attributes\":{\"ref_id\":\"fig_8\"},\"end\":24487,\"start\":24481},{\"attributes\":{\"ref_id\":\"fig_2\"},\"end\":24968,\"start\":24950},{\"attributes\":{\"ref_id\":\"fig_2\"},\"end\":29392,\"start\":29385},{\"attributes\":{\"ref_id\":\"fig_2\"},\"end\":29485,\"start\":29475},{\"attributes\":{\"ref_id\":\"fig_2\"},\"end\":30026,\"start\":30016},{\"attributes\":{\"ref_id\":\"fig_2\"},\"end\":30090,\"start\":30080},{\"attributes\":{\"ref_id\":\"fig_2\"},\"end\":31578,\"start\":31571},{\"attributes\":{\"ref_id\":\"fig_2\"},\"end\":32307,\"start\":32299},{\"attributes\":{\"ref_id\":\"fig_2\"},\"end\":33034,\"start\":33027},{\"attributes\":{\"ref_id\":\"fig_2\"},\"end\":33544,\"start\":33537},{\"attributes\":{\"ref_id\":\"fig_2\"},\"end\":34203,\"start\":34196},{\"attributes\":{\"ref_id\":\"fig_2\"},\"end\":34330,\"start\":34322},{\"attributes\":{\"ref_id\":\"fig_2\"},\"end\":34523,\"start\":34516},{\"attributes\":{\"ref_id\":\"fig_2\"},\"end\":34532,\"start\":34524},{\"attributes\":{\"ref_id\":\"fig_2\"},\"end\":34723,\"start\":34716},{\"attributes\":{\"ref_id\":\"fig_2\"},\"end\":34968,\"start\":34961},{\"attributes\":{\"ref_id\":\"fig_2\"},\"end\":35137,\"start\":35130},{\"attributes\":{\"ref_id\":\"fig_2\"},\"end\":35923,\"start\":35916},{\"attributes\":{\"ref_id\":\"fig_2\"},\"end\":36050,\"start\":36039},{\"attributes\":{\"ref_id\":\"fig_2\"},\"end\":37009,\"start\":36998},{\"attributes\":{\"ref_id\":\"fig_2\"},\"end\":37344,\"start\":37337},{\"attributes\":{\"ref_id\":\"fig_2\"},\"end\":37568,\"start\":37561},{\"attributes\":{\"ref_id\":\"fig_2\"},\"end\":37842,\"start\":37835},{\"attributes\":{\"ref_id\":\"fig_2\"},\"end\":38541,\"start\":38534},{\"attributes\":{\"ref_id\":\"fig_15\"},\"end\":38634,\"start\":38628},{\"attributes\":{\"ref_id\":\"fig_2\"},\"end\":38796,\"start\":38789},{\"attributes\":{\"ref_id\":\"fig_2\"},\"end\":39528,\"start\":39517},{\"attributes\":{\"ref_id\":\"fig_2\"},\"end\":39637,\"start\":39627}]", "bib_author_first_name": "[{\"end\":48630,\"start\":48629},{\"end\":48632,\"start\":48631},{\"end\":48842,\"start\":48841},{\"end\":48844,\"start\":48843},{\"end\":48853,\"start\":48852},{\"end\":48855,\"start\":48854},{\"end\":49163,\"start\":49162},{\"end\":49165,\"start\":49164},{\"end\":49453,\"start\":49452},{\"end\":49466,\"start\":49465},{\"end\":49478,\"start\":49477},{\"end\":49486,\"start\":49485},{\"end\":49814,\"start\":49813},{\"end\":49822,\"start\":49821},{\"end\":49824,\"start\":49823},{\"end\":49831,\"start\":49830},{\"end\":49839,\"start\":49838},{\"end\":49841,\"start\":49840},{\"end\":50174,\"start\":50173},{\"end\":50182,\"start\":50181},{\"end\":50191,\"start\":50190},{\"end\":50201,\"start\":50200},{\"end\":50541,\"start\":50540},{\"end\":50547,\"start\":50546},{\"end\":50553,\"start\":50552},{\"end\":50562,\"start\":50561},{\"end\":50570,\"start\":50569},{\"end\":50890,\"start\":50889},{\"end\":50892,\"start\":50891},{\"end\":50902,\"start\":50901},{\"end\":50910,\"start\":50909},{\"end\":51216,\"start\":51215},{\"end\":51222,\"start\":51221},{\"end\":51231,\"start\":51230},{\"end\":51237,\"start\":51236},{\"end\":51245,\"start\":51244},{\"end\":51552,\"start\":51551},{\"end\":51571,\"start\":51570},{\"end\":51583,\"start\":51582},{\"end\":51585,\"start\":51584},{\"end\":51600,\"start\":51599},{\"end\":51920,\"start\":51919},{\"end\":51929,\"start\":51928},{\"end\":51936,\"start\":51935},{\"end\":51938,\"start\":51937},{\"end\":51948,\"start\":51947},{\"end\":51956,\"start\":51955},{\"end\":52271,\"start\":52270},{\"end\":52278,\"start\":52277},{\"end\":52284,\"start\":52283},{\"end\":52293,\"start\":52292},{\"end\":52300,\"start\":52299},{\"end\":52308,\"start\":52307},{\"end\":52643,\"start\":52642},{\"end\":52649,\"start\":52648},{\"end\":52657,\"start\":52656},{\"end\":52665,\"start\":52664},{\"end\":52924,\"start\":52923},{\"end\":52932,\"start\":52931},{\"end\":52941,\"start\":52940},{\"end\":52952,\"start\":52951},{\"end\":53215,\"start\":53214},{\"end\":53230,\"start\":53229},{\"end\":53246,\"start\":53245},{\"end\":53504,\"start\":53503},{\"end\":53514,\"start\":53513},{\"end\":53529,\"start\":53528},{\"end\":53874,\"start\":53873},{\"end\":53884,\"start\":53883},{\"end\":53900,\"start\":53899},{\"end\":53915,\"start\":53914},{\"end\":53917,\"start\":53916},{\"end\":53928,\"start\":53923},{\"end\":54309,\"start\":54308},{\"end\":54321,\"start\":54320},{\"end\":54591,\"start\":54587},{\"end\":54598,\"start\":54597},{\"end\":54607,\"start\":54603},{\"end\":54889,\"start\":54888},{\"end\":54897,\"start\":54896},{\"end\":54906,\"start\":54905},{\"end\":54912,\"start\":54911},{\"end\":55247,\"start\":55246},{\"end\":55253,\"start\":55252},{\"end\":55261,\"start\":55260},{\"end\":55543,\"start\":55542},{\"end\":55562,\"start\":55561},{\"end\":55574,\"start\":55573},{\"end\":55576,\"start\":55575},{\"end\":55591,\"start\":55590},{\"end\":55908,\"start\":55907},{\"end\":55927,\"start\":55926},{\"end\":55939,\"start\":55938},{\"end\":55941,\"start\":55940},{\"end\":55956,\"start\":55955},{\"end\":56232,\"start\":56231},{\"end\":56240,\"start\":56239},{\"end\":56246,\"start\":56245},{\"end\":56517,\"start\":56516},{\"end\":56524,\"start\":56523},{\"end\":56532,\"start\":56531},{\"end\":56540,\"start\":56539},{\"end\":56547,\"start\":56546},{\"end\":56896,\"start\":56895},{\"end\":56902,\"start\":56901},{\"end\":56908,\"start\":56907},{\"end\":56916,\"start\":56915},{\"end\":56923,\"start\":56922},{\"end\":57313,\"start\":57312},{\"end\":57332,\"start\":57331},{\"end\":57334,\"start\":57333},{\"end\":57346,\"start\":57345},{\"end\":57348,\"start\":57347},{\"end\":57363,\"start\":57362},{\"end\":57374,\"start\":57373},{\"end\":57383,\"start\":57382},{\"end\":57786,\"start\":57785},{\"end\":57788,\"start\":57787},{\"end\":57798,\"start\":57797},{\"end\":57806,\"start\":57805},{\"end\":57815,\"start\":57814},{\"end\":57830,\"start\":57829},{\"end\":58175,\"start\":58174},{\"end\":58194,\"start\":58193},{\"end\":58196,\"start\":58195},{\"end\":58208,\"start\":58207},{\"end\":58210,\"start\":58209},{\"end\":58225,\"start\":58224},{\"end\":58567,\"start\":58566},{\"end\":58586,\"start\":58585},{\"end\":58588,\"start\":58587},{\"end\":58603,\"start\":58602},{\"end\":58605,\"start\":58604},{\"end\":58617,\"start\":58616},{\"end\":58812,\"start\":58811},{\"end\":58820,\"start\":58813},{\"end\":58831,\"start\":58827},{\"end\":59018,\"start\":59017},{\"end\":59026,\"start\":59019},{\"end\":59117,\"start\":59116},{\"end\":59355,\"start\":59354},{\"end\":59363,\"start\":59356},{\"end\":59394,\"start\":59370},{\"end\":59584,\"start\":59583},{\"end\":59592,\"start\":59585},{\"end\":59623,\"start\":59599},{\"end\":60378,\"start\":60375},{\"end\":61617,\"start\":61612}]", "bib_author_last_name": "[{\"end\":48641,\"start\":48633},{\"end\":48850,\"start\":48845},{\"end\":48859,\"start\":48856},{\"end\":49174,\"start\":49166},{\"end\":49463,\"start\":49454},{\"end\":49475,\"start\":49467},{\"end\":49483,\"start\":49479},{\"end\":49493,\"start\":49487},{\"end\":49819,\"start\":49815},{\"end\":49828,\"start\":49825},{\"end\":49836,\"start\":49832},{\"end\":49845,\"start\":49842},{\"end\":50179,\"start\":50175},{\"end\":50188,\"start\":50183},{\"end\":50198,\"start\":50192},{\"end\":50207,\"start\":50202},{\"end\":50544,\"start\":50542},{\"end\":50550,\"start\":50548},{\"end\":50559,\"start\":50554},{\"end\":50567,\"start\":50563},{\"end\":50574,\"start\":50571},{\"end\":50899,\"start\":50893},{\"end\":50907,\"start\":50903},{\"end\":50916,\"start\":50911},{\"end\":51219,\"start\":51217},{\"end\":51228,\"start\":51223},{\"end\":51234,\"start\":51232},{\"end\":51242,\"start\":51238},{\"end\":51249,\"start\":51246},{\"end\":51568,\"start\":51553},{\"end\":51580,\"start\":51572},{\"end\":51597,\"start\":51586},{\"end\":51608,\"start\":51601},{\"end\":51926,\"start\":51921},{\"end\":51933,\"start\":51930},{\"end\":51945,\"start\":51939},{\"end\":51953,\"start\":51949},{\"end\":51962,\"start\":51957},{\"end\":52275,\"start\":52272},{\"end\":52281,\"start\":52279},{\"end\":52290,\"start\":52285},{\"end\":52297,\"start\":52294},{\"end\":52305,\"start\":52301},{\"end\":52312,\"start\":52309},{\"end\":52646,\"start\":52644},{\"end\":52654,\"start\":52650},{\"end\":52662,\"start\":52658},{\"end\":52669,\"start\":52666},{\"end\":52929,\"start\":52925},{\"end\":52938,\"start\":52933},{\"end\":52949,\"start\":52942},{\"end\":52958,\"start\":52953},{\"end\":53227,\"start\":53216},{\"end\":53243,\"start\":53231},{\"end\":53253,\"start\":53247},{\"end\":53511,\"start\":53505},{\"end\":53526,\"start\":53515},{\"end\":53538,\"start\":53530},{\"end\":53881,\"start\":53875},{\"end\":53897,\"start\":53885},{\"end\":53912,\"start\":53901},{\"end\":53921,\"start\":53918},{\"end\":53933,\"start\":53929},{\"end\":54318,\"start\":54310},{\"end\":54327,\"start\":54322},{\"end\":54595,\"start\":54592},{\"end\":54601,\"start\":54599},{\"end\":54612,\"start\":54608},{\"end\":54894,\"start\":54890},{\"end\":54903,\"start\":54898},{\"end\":54909,\"start\":54907},{\"end\":54917,\"start\":54913},{\"end\":55250,\"start\":55248},{\"end\":55258,\"start\":55254},{\"end\":55266,\"start\":55262},{\"end\":55559,\"start\":55544},{\"end\":55571,\"start\":55563},{\"end\":55588,\"start\":55577},{\"end\":55599,\"start\":55592},{\"end\":55924,\"start\":55909},{\"end\":55936,\"start\":55928},{\"end\":55953,\"start\":55942},{\"end\":55964,\"start\":55957},{\"end\":56237,\"start\":56233},{\"end\":56243,\"start\":56241},{\"end\":56250,\"start\":56247},{\"end\":56521,\"start\":56518},{\"end\":56529,\"start\":56525},{\"end\":56537,\"start\":56533},{\"end\":56544,\"start\":56541},{\"end\":56551,\"start\":56548},{\"end\":56899,\"start\":56897},{\"end\":56905,\"start\":56903},{\"end\":56913,\"start\":56909},{\"end\":56920,\"start\":56917},{\"end\":56927,\"start\":56924},{\"end\":57329,\"start\":57314},{\"end\":57343,\"start\":57335},{\"end\":57360,\"start\":57349},{\"end\":57371,\"start\":57364},{\"end\":57380,\"start\":57375},{\"end\":57388,\"start\":57384},{\"end\":57795,\"start\":57789},{\"end\":57803,\"start\":57799},{\"end\":57812,\"start\":57807},{\"end\":57827,\"start\":57816},{\"end\":57836,\"start\":57831},{\"end\":58191,\"start\":58176},{\"end\":58205,\"start\":58197},{\"end\":58222,\"start\":58211},{\"end\":58233,\"start\":58226},{\"end\":58583,\"start\":58568},{\"end\":58600,\"start\":58589},{\"end\":58614,\"start\":58606},{\"end\":58625,\"start\":58618},{\"end\":58825,\"start\":58821},{\"end\":58836,\"start\":58832},{\"end\":58844,\"start\":58838},{\"end\":58903,\"start\":58900},{\"end\":59047,\"start\":59027},{\"end\":59058,\"start\":59049},{\"end\":59125,\"start\":59118},{\"end\":59236,\"start\":59233},{\"end\":59368,\"start\":59364},{\"end\":59401,\"start\":59395},{\"end\":59407,\"start\":59403},{\"end\":59470,\"start\":59467},{\"end\":59597,\"start\":59593},{\"end\":59630,\"start\":59624},{\"end\":59636,\"start\":59632},{\"end\":59699,\"start\":59696},{\"end\":59862,\"start\":59850},{\"end\":59935,\"start\":59932},{\"end\":60078,\"start\":60066},{\"end\":60156,\"start\":60153},{\"end\":60382,\"start\":60379},{\"end\":61620,\"start\":61618},{\"end\":67039,\"start\":67037}]", "bib_entry": "[{\"attributes\":{\"id\":\"b0\"},\"end\":48755,\"start\":48598},{\"attributes\":{\"id\":\"b1\",\"matched_paper_id\":119840568},\"end\":49077,\"start\":48757},{\"attributes\":{\"id\":\"b2\",\"matched_paper_id\":85536503},\"end\":49382,\"start\":49079},{\"attributes\":{\"id\":\"b3\",\"matched_paper_id\":34770795},\"end\":49722,\"start\":49384},{\"attributes\":{\"id\":\"b4\",\"matched_paper_id\":23485099},\"end\":50080,\"start\":49724},{\"attributes\":{\"id\":\"b5\",\"matched_paper_id\":30904304},\"end\":50444,\"start\":50082},{\"attributes\":{\"id\":\"b6\",\"matched_paper_id\":7289069},\"end\":50817,\"start\":50446},{\"attributes\":{\"id\":\"b7\",\"matched_paper_id\":26247738},\"end\":51133,\"start\":50819},{\"attributes\":{\"id\":\"b8\",\"matched_paper_id\":24850573},\"end\":51480,\"start\":51135},{\"attributes\":{\"id\":\"b9\",\"matched_paper_id\":54435651},\"end\":51854,\"start\":51482},{\"attributes\":{\"id\":\"b10\",\"matched_paper_id\":11996047},\"end\":52187,\"start\":51856},{\"attributes\":{\"id\":\"b11\",\"matched_paper_id\":211118877},\"end\":52563,\"start\":52189},{\"attributes\":{\"id\":\"b12\",\"matched_paper_id\":27836559},\"end\":52867,\"start\":52565},{\"attributes\":{\"id\":\"b13\",\"matched_paper_id\":27535434},\"end\":53163,\"start\":52869},{\"attributes\":{\"id\":\"b14\",\"matched_paper_id\":116037527},\"end\":53439,\"start\":53165},{\"attributes\":{\"id\":\"b15\",\"matched_paper_id\":25143265},\"end\":53751,\"start\":53441},{\"attributes\":{\"id\":\"b16\",\"matched_paper_id\":115947548},\"end\":54234,\"start\":53753},{\"attributes\":{\"id\":\"b17\",\"matched_paper_id\":18709865},\"end\":54540,\"start\":54236},{\"attributes\":{\"id\":\"b18\",\"matched_paper_id\":7176484},\"end\":54797,\"start\":54542},{\"attributes\":{\"id\":\"b19\",\"matched_paper_id\":203030064},\"end\":55149,\"start\":54799},{\"attributes\":{\"id\":\"b20\",\"matched_paper_id\":197498591},\"end\":55498,\"start\":55151},{\"attributes\":{\"doi\":\"10.1109/LAWP.2020.2986832\",\"id\":\"b21\",\"matched_paper_id\":218793914},\"end\":55839,\"start\":55500},{\"attributes\":{\"id\":\"b22\",\"matched_paper_id\":201237477},\"end\":56174,\"start\":55841},{\"attributes\":{\"id\":\"b23\",\"matched_paper_id\":19282561},\"end\":56441,\"start\":56176},{\"attributes\":{\"id\":\"b24\",\"matched_paper_id\":39169712},\"end\":56776,\"start\":56443},{\"attributes\":{\"id\":\"b25\",\"matched_paper_id\":212933835},\"end\":57193,\"start\":56778},{\"attributes\":{\"id\":\"b26\",\"matched_paper_id\":16452403},\"end\":57714,\"start\":57195},{\"attributes\":{\"id\":\"b27\"},\"end\":58072,\"start\":57716},{\"attributes\":{\"id\":\"b28\",\"matched_paper_id\":8866430},\"end\":58515,\"start\":58074},{\"attributes\":{\"id\":\"b29\",\"matched_paper_id\":221385479},\"end\":58807,\"start\":58517},{\"attributes\":{\"id\":\"b30\"},\"end\":58896,\"start\":58809},{\"attributes\":{\"id\":\"b31\"},\"end\":59013,\"start\":58898},{\"attributes\":{\"id\":\"b32\"},\"end\":59114,\"start\":59015},{\"attributes\":{\"doi\":\"DC -3.5\",\"id\":\"b33\"},\"end\":59229,\"start\":59116},{\"attributes\":{\"id\":\"b34\"},\"end\":59350,\"start\":59231},{\"attributes\":{\"id\":\"b35\"},\"end\":59463,\"start\":59352},{\"attributes\":{\"id\":\"b36\"},\"end\":59579,\"start\":59465},{\"attributes\":{\"id\":\"b37\"},\"end\":59692,\"start\":59581},{\"attributes\":{\"id\":\"b38\"},\"end\":59808,\"start\":59694},{\"attributes\":{\"id\":\"b39\"},\"end\":59928,\"start\":59810},{\"attributes\":{\"id\":\"b40\"},\"end\":60018,\"start\":59930},{\"attributes\":{\"id\":\"b41\"},\"end\":60149,\"start\":60020},{\"attributes\":{\"id\":\"b42\"},\"end\":60239,\"start\":60151},{\"attributes\":{\"id\":\"b43\"},\"end\":60371,\"start\":60241},{\"attributes\":{\"id\":\"b44\"},\"end\":60403,\"start\":60373},{\"attributes\":{\"id\":\"b45\"},\"end\":61304,\"start\":60405},{\"attributes\":{\"id\":\"b46\"},\"end\":63312,\"start\":61306},{\"attributes\":{\"id\":\"b47\"},\"end\":64464,\"start\":63314},{\"attributes\":{\"id\":\"b48\"},\"end\":66767,\"start\":64466},{\"attributes\":{\"id\":\"b49\"},\"end\":67518,\"start\":66769}]", "bib_title": "[{\"end\":48839,\"start\":48757},{\"end\":49160,\"start\":49079},{\"end\":49450,\"start\":49384},{\"end\":49811,\"start\":49724},{\"end\":50171,\"start\":50082},{\"end\":50538,\"start\":50446},{\"end\":50887,\"start\":50819},{\"end\":51213,\"start\":51135},{\"end\":51549,\"start\":51482},{\"end\":51917,\"start\":51856},{\"end\":52268,\"start\":52189},{\"end\":52640,\"start\":52565},{\"end\":52921,\"start\":52869},{\"end\":53212,\"start\":53165},{\"end\":53501,\"start\":53441},{\"end\":53871,\"start\":53753},{\"end\":54306,\"start\":54236},{\"end\":54585,\"start\":54542},{\"end\":54886,\"start\":54799},{\"end\":55244,\"start\":55151},{\"end\":55540,\"start\":55500},{\"end\":55905,\"start\":55841},{\"end\":56229,\"start\":56176},{\"end\":56514,\"start\":56443},{\"end\":56893,\"start\":56778},{\"end\":57310,\"start\":57195},{\"end\":57783,\"start\":57716},{\"end\":58172,\"start\":58074},{\"end\":58564,\"start\":58517},{\"end\":61610,\"start\":61306},{\"end\":63390,\"start\":63314},{\"end\":64651,\"start\":64466}]", "bib_author": "[{\"end\":48643,\"start\":48629},{\"end\":48852,\"start\":48841},{\"end\":48861,\"start\":48852},{\"end\":49176,\"start\":49162},{\"end\":49465,\"start\":49452},{\"end\":49477,\"start\":49465},{\"end\":49485,\"start\":49477},{\"end\":49495,\"start\":49485},{\"end\":49821,\"start\":49813},{\"end\":49830,\"start\":49821},{\"end\":49838,\"start\":49830},{\"end\":49847,\"start\":49838},{\"end\":50181,\"start\":50173},{\"end\":50190,\"start\":50181},{\"end\":50200,\"start\":50190},{\"end\":50209,\"start\":50200},{\"end\":50546,\"start\":50540},{\"end\":50552,\"start\":50546},{\"end\":50561,\"start\":50552},{\"end\":50569,\"start\":50561},{\"end\":50576,\"start\":50569},{\"end\":50901,\"start\":50889},{\"end\":50909,\"start\":50901},{\"end\":50918,\"start\":50909},{\"end\":51221,\"start\":51215},{\"end\":51230,\"start\":51221},{\"end\":51236,\"start\":51230},{\"end\":51244,\"start\":51236},{\"end\":51251,\"start\":51244},{\"end\":51570,\"start\":51551},{\"end\":51582,\"start\":51570},{\"end\":51599,\"start\":51582},{\"end\":51610,\"start\":51599},{\"end\":51928,\"start\":51919},{\"end\":51935,\"start\":51928},{\"end\":51947,\"start\":51935},{\"end\":51955,\"start\":51947},{\"end\":51964,\"start\":51955},{\"end\":52277,\"start\":52270},{\"end\":52283,\"start\":52277},{\"end\":52292,\"start\":52283},{\"end\":52299,\"start\":52292},{\"end\":52307,\"start\":52299},{\"end\":52314,\"start\":52307},{\"end\":52648,\"start\":52642},{\"end\":52656,\"start\":52648},{\"end\":52664,\"start\":52656},{\"end\":52671,\"start\":52664},{\"end\":52931,\"start\":52923},{\"end\":52940,\"start\":52931},{\"end\":52951,\"start\":52940},{\"end\":52960,\"start\":52951},{\"end\":53229,\"start\":53214},{\"end\":53245,\"start\":53229},{\"end\":53255,\"start\":53245},{\"end\":53513,\"start\":53503},{\"end\":53528,\"start\":53513},{\"end\":53540,\"start\":53528},{\"end\":53883,\"start\":53873},{\"end\":53899,\"start\":53883},{\"end\":53914,\"start\":53899},{\"end\":53923,\"start\":53914},{\"end\":53935,\"start\":53923},{\"end\":54320,\"start\":54308},{\"end\":54329,\"start\":54320},{\"end\":54597,\"start\":54587},{\"end\":54603,\"start\":54597},{\"end\":54614,\"start\":54603},{\"end\":54896,\"start\":54888},{\"end\":54905,\"start\":54896},{\"end\":54911,\"start\":54905},{\"end\":54919,\"start\":54911},{\"end\":55252,\"start\":55246},{\"end\":55260,\"start\":55252},{\"end\":55268,\"start\":55260},{\"end\":55561,\"start\":55542},{\"end\":55573,\"start\":55561},{\"end\":55590,\"start\":55573},{\"end\":55601,\"start\":55590},{\"end\":55926,\"start\":55907},{\"end\":55938,\"start\":55926},{\"end\":55955,\"start\":55938},{\"end\":55966,\"start\":55955},{\"end\":56239,\"start\":56231},{\"end\":56245,\"start\":56239},{\"end\":56252,\"start\":56245},{\"end\":56523,\"start\":56516},{\"end\":56531,\"start\":56523},{\"end\":56539,\"start\":56531},{\"end\":56546,\"start\":56539},{\"end\":56553,\"start\":56546},{\"end\":56901,\"start\":56895},{\"end\":56907,\"start\":56901},{\"end\":56915,\"start\":56907},{\"end\":56922,\"start\":56915},{\"end\":56929,\"start\":56922},{\"end\":57331,\"start\":57312},{\"end\":57345,\"start\":57331},{\"end\":57362,\"start\":57345},{\"end\":57373,\"start\":57362},{\"end\":57382,\"start\":57373},{\"end\":57390,\"start\":57382},{\"end\":57797,\"start\":57785},{\"end\":57805,\"start\":57797},{\"end\":57814,\"start\":57805},{\"end\":57829,\"start\":57814},{\"end\":57838,\"start\":57829},{\"end\":58193,\"start\":58174},{\"end\":58207,\"start\":58193},{\"end\":58224,\"start\":58207},{\"end\":58235,\"start\":58224},{\"end\":58585,\"start\":58566},{\"end\":58602,\"start\":58585},{\"end\":58616,\"start\":58602},{\"end\":58627,\"start\":58616},{\"end\":58827,\"start\":58811},{\"end\":58838,\"start\":58827},{\"end\":58846,\"start\":58838},{\"end\":58905,\"start\":58900},{\"end\":59049,\"start\":59017},{\"end\":59060,\"start\":59049},{\"end\":59127,\"start\":59116},{\"end\":59238,\"start\":59233},{\"end\":59370,\"start\":59354},{\"end\":59403,\"start\":59370},{\"end\":59409,\"start\":59403},{\"end\":59472,\"start\":59467},{\"end\":59599,\"start\":59583},{\"end\":59632,\"start\":59599},{\"end\":59638,\"start\":59632},{\"end\":59701,\"start\":59696},{\"end\":59864,\"start\":59850},{\"end\":59937,\"start\":59932},{\"end\":60080,\"start\":60066},{\"end\":60158,\"start\":60153},{\"end\":60384,\"start\":60375},{\"end\":61622,\"start\":61612},{\"end\":67041,\"start\":67037}]", "bib_venue": "[{\"end\":61876,\"start\":61816},{\"end\":63621,\"start\":63590},{\"end\":64979,\"start\":64898},{\"end\":48627,\"start\":48598},{\"end\":48888,\"start\":48861},{\"end\":49203,\"start\":49176},{\"end\":49528,\"start\":49495},{\"end\":49874,\"start\":49847},{\"end\":50236,\"start\":50209},{\"end\":50609,\"start\":50576},{\"end\":50945,\"start\":50918},{\"end\":51284,\"start\":51251},{\"end\":51643,\"start\":51610},{\"end\":51991,\"start\":51964},{\"end\":52347,\"start\":52314},{\"end\":52694,\"start\":52671},{\"end\":52987,\"start\":52960},{\"end\":53285,\"start\":53255},{\"end\":53573,\"start\":53540},{\"end\":53962,\"start\":53935},{\"end\":54361,\"start\":54329},{\"end\":54641,\"start\":54614},{\"end\":54946,\"start\":54919},{\"end\":55295,\"start\":55268},{\"end\":55659,\"start\":55626},{\"end\":55983,\"start\":55966},{\"end\":56285,\"start\":56252},{\"end\":56586,\"start\":56553},{\"end\":56956,\"start\":56929},{\"end\":57424,\"start\":57390},{\"end\":57865,\"start\":57838},{\"end\":58262,\"start\":58235},{\"end\":58638,\"start\":58627},{\"end\":59170,\"start\":59134},{\"end\":59848,\"start\":59810},{\"end\":60064,\"start\":60020},{\"end\":60299,\"start\":60241},{\"end\":60499,\"start\":60405},{\"end\":61814,\"start\":61622},{\"end\":63588,\"start\":63392},{\"end\":64896,\"start\":64653},{\"end\":67035,\"start\":66769}]"}}}, "year": 2023, "month": 12, "day": 17}