{"id": 246517799, "updated": "2022-05-03 16:32:26.589", "metadata": {"title": "Adaptive Hierarchical Cyber Attack Detection and Localization in Active Distribution Systems", "authors": "[{\"first\":\"Qi\",\"last\":\"Li\",\"middle\":[]},{\"first\":\"Jinan\",\"last\":\"Zhang\",\"middle\":[]},{\"first\":\"Junbo\",\"last\":\"Zhao\",\"middle\":[]},{\"first\":\"\",\"last\":\"Jin\",\"middle\":[]},{\"first\":\"\",\"last\":\"Ye\",\"middle\":[]},{\"first\":\"WenZhan\",\"last\":\"Song\",\"middle\":[]},{\"first\":\"Fangyu\",\"last\":\"Li\",\"middle\":[]}]", "venue": "IEEE Transactions on Smart Grid", "journal": "IEEE Transactions on Smart Grid", "publication_date": {"year": 2022, "month": null, "day": null}, "abstract": "Development of a cyber security strategy for the active distribution systems is challenging due to the inclusion of distributed renewable energy generations. This paper proposes an adaptive hierarchical cyber attack detection and localization framework for distributed active distribution systems via analyzing electrical waveforms. Cyber attack detection is based on a sequential deep learning model, via which even minor cyber attacks can be identified. The two-stage cyber attack localization algorithm first estimates the cyber attack sub-region, and then localize the specified cyber attack within the estimated subregion. We propose a modified spectral clustering-based network partitioning method for the hierarchical cyber attack ‘coarse’ localization. Next, to further narrow down the cyber attack location, a normalized impact score based on waveform statistical metrics is proposed to obtain a ‘fine’ cyber attack location by characterizing different waveform properties. Finally, compared with classical and state-of-art methods, a comprehensive quantitative evaluation with two case studies shows promising estimation results of the proposed framework.", "fields_of_study": "[\"Computer Science\"]", "external_ids": {"arxiv": null, "mag": null, "acl": null, "pubmed": null, "pubmedcentral": null, "dblp": "journals/tsg/LiZZYSL22", "doi": "10.1109/tsg.2022.3148233"}}, "content": {"source": {"pdf_hash": "7353033d3fe4a3ed2f8edb671814fc1d3be48730", "pdf_src": "MergedPDFExtraction", "pdf_uri": null, "oa_url_match": false, "oa_info": null}, "grobid": {"id": "b49edeeec73079e48bcdbddbccc5a94f4c395cf2", "type": "plain-text", "url": "s3://ai2-s2-pdf-extraction-prod/parse-results/s2orc_worker/7353033d3fe4a3ed2f8edb671814fc1d3be48730.txt", "contents": "\nAdaptive Hierarchical Cyber Attack Detection and Localization in Active Distribution Systems\n2021\n\nIeee Transactions \nSmart Grid \nX Vol \nX No \nXx \nAdaptive Hierarchical Cyber Attack Detection and Localization in Active Distribution Systems\n12021Index Terms-cyber attack localizationadaptivehierarchicalonlinedistribution networks\nDevelopment of a cyber security strategy for the active distribution systems is challenging due to the inclusion of distributed renewable energy generations. This paper proposes an adaptive hierarchical cyber attack detection and localization framework for distributed active distribution systems via analyzing electrical waveforms. Cyber attack detection is based on a sequential deep learning model, via which even minor cyber attacks can be identified. The two-stage cyber attack localization algorithm first estimates the cyber attack sub-region, and then localize the specified cyber attack within the estimated subregion. We propose a modified spectral clustering-based network partitioning method for the hierarchical cyber attack 'coarse' localization. Next, to further narrow down the cyber attack location, a normalized impact score based on waveform statistical metrics is proposed to obtain a 'fine' cyber attack location by characterizing different waveform properties. Finally, compared with classical and state-of-art methods, a comprehensive quantitative evaluation with two case studies shows promising estimation results of the proposed framework.\n\npower networks [4]; a power electronics or electric machine in fault or under attack may cause unusual harmonics or energy profile in electrical networks [5].\n\nBy analyzing the electrical waveform signals and their root cause, waveform analytics can present utilities with a complete picture of the health and status of their system, both during outages and normal operating conditions. It could also provide a variety of operational benefits to system operators, asset management personnel, and repair crew. Electronic sensors placed on power grids and distribution systems can either measure the electricity properties, such as phasor measurement unit (PMU) sensors [6], [7] or directly record the raw electrical waveform using waveform measurement unit (WMU) [8]- [12], depending on the needed fidelity of monitoring applications. Thanks to developed network connectivity, the streaming monitoring data flow can be obtained and analyzed online and in real-time [13].\n\nThe network of the waveform sensors form an Internet of Things (IoT) system [4], [14], where the waveform sensors are viewed as networked IoT sensing devices. Therefore, we can potentially use the information embedded in electrical signals to enable security monitoring, diagnosis, and prognosis in the power networks. The possibility may be well beyond what we can imagine now. It broadly applies to many cyber-physical systems (CPS) and applications, such as power distribution networks, multi-stage manufacturing systems, electric vehicles, and so on [15]- [17]. Cyber attacks towards connected IoT devices trigger anomalies in system statistics, energy consumption, as well as electrical waveforms [4], [14], [18], [19]. Thus, recorded waveform which carries high fidelity current and voltage information should be adequate for cyber attack characterization. Furthermore, the transmission of the high-frequency waveform data is feasible in practice [20]- [22].\n\nData-driven methods have been widely adopted for event localization in power electronics networks and active distribution systems. Rule-based data-driven analytics [23], signal property-based approach [24], and neural networks (NN) based algorithms, such as autoencoders [25], convolutional neural network (CNN) [26], have been developed. However, NNbased algorithms typically require a large amount of training data to capture the sophisticated features, which cannot be fully simulated or acquired from real applications. Thus, combining the rule-based signal processing methods and machine learning methods could lead to a solution tackling the challenging problem using an affordable data size.\n\nThere have been numerous works targeting the event and cyber attack localization problem [1], [2], [27]. Dynamic data analytics based localization is always a major branch for the distribution networks [1], DC microgrid [2], islanded microgrid [27]. This paper proposes a new adaptive hierarchical framework for efficient and accurate cyber attack detection and localization by taking advantage of the electrical waveforms (Fig. 1). The proposed approach has a hierarchical architecture that divides the whole network into sub-groups and then locates the cyber attack within one local cluster. Based on a modified unsupervised clustering and an deep learning based anomaly detection method, cyber attacks in the active distribution systems can be adaptively detected and located. The performance of the proposed approach has been tested by multiple cyber attack scenarios in two representative case studies. Our contributions are summarized as follows:\n\n• We propose an adaptive hierarchical cyber attack detection and localization framework for active distribution systems with DERs using the electrical waveform; • High fidelity models of DER and cyber attacks are built to analyze the impacts of cyber attacks towards the distribution networks; • Extensive experiments are utilized to evaluate the proposed approach performances with quantitative analytics; The remainder of this paper is organized as follows. In Section II, the cyber attack model of active distribution systems is discussed. In Section III, we describe the proposed approaches with the details of each key component, which are cyber attack detection, network partition and cyber attack localization. Experiments and evaluations can be found in Section IV. In the end, a conclusion is drawn in Section V.\n\n\nII. CYBER ATTACK MODEL\n\nCyber attacks on power systems and smart grids have become more common, especially with the increasing number of power electronics converters. Specifically, PV embedded active distribution system is one of the most representative examples. For smart inverters in the distribution systems, false data integrity (FDI) attack is one of the common cyberattacks when an enormous amount of DERs are connected to the power system [28], [29]. Besides the high order abnormal harmonics caused by the cyber attacks towards the power electronics devices in the power system, FDI attack could also manipulate the critical threshold in relays [30] and transformers [31] to induce the short circuit faults. In addition, the research on FDI attacks against distribution system SE (DSSE) is an interesting open area. In [32], the vulnerability of distribution system SE (DSSE) to FDI attack was investigated. The work in [33] provides a basis to study the attack behaviors in distribution systems and a theoretical guide to develop protective countermeasures. Authors in [34] attempt to optimize the effectiveness and hiddenness of Moving Target Defense (MTD) while considering voltage stability. MTD is a new technology to defend against the FDI attack on DSSE.\n\nIn this paper, to simulate cyber attacks that occurred in the active distribution grid, FDI attack is modeled here, which is assumed to falsify the sensor measurements and degrade controller performance. FDI attack is defined as\nY = α Y f + β Y 0 ,(1)\nwhere Y is the falsified data vector that is eventually used by the controller, Y 0 is the original measurement, Y f is a fake data vector which can be independent or determined by Y 0 , α is a coefficient that determines the weight of the attack vector, β is a coefficient that defines the weight of the measurement. Fig. 2: The adopted cyber attack model of the studied active distribution systems. The vulnerability of the smart inverter due to FDI attacks is shown.\n\nIn the PV (photovotaic) converter controller in the Fig. 2, Y 0 is shown as\nY 0 = [U pv , I pv , U dc , I f , U c , I g ] T .(2)\nwhere U pv , I pv are the PV array voltage and current, respectively. U dc is DC link voltage, I f is the inverter-side current in LCL filter, U f is the capacitor voltage in LCL filter, I g is the grid-side current in LCL filter. As for the phase voltage source inverter (VSI), Y 0 only includes I f , U c and I g . Both Fig. 2 and Fig. A.1 show the vulnerability of the inverter due to FDI attacks. More detailed model of DERs in this paper is illustrated in the Appendix A.\n\n\nIII. PROPOSED APPROACH\n\nThe workflow of the proposed adaptive hierarchical cyber attack localization approach is shown in Fig. 1. It includes online processing procedures, such as cyber attack detection, network partitioning, sub-region determination, and cyber attack localization. In this section, we introduce the methodologies in detail with thorough discussions. Note that we assume the optimal sensor placement (OSP) has been done offline. The purpose of OSP to achieve the observability of the whole distribution system with the minimum number of waveform sensors [35].\n\n\nA. Cyber Attack Detection\n\nDistribution power systems typically operate under steadystate. Therefore, the cyber attack can be detected based on the deviation of the monitoring metrics from steady-state, which, in our study, is an anomaly detection problem. For time-series sensor streaming data, statistical analysis is typically used for cyber attack detection [13], [14]. Our previous studies [13], [15] utilizing the data-driven methods have shown remarkable performance regarding the electrical waveform data. By applying the cyber attack detection algorithm on streaming waveform measurement unit (WMU) data, we can determine if there is a cyber attack in real time. In this case, cyber attack detection is treated as a one-class classification problem. A Multi-layer Long Short-Term Memory Network (MLSTM) from our previous work has been applied, which not only remembers sequential information but also carries out a more rigorous screening of time information. So, we can generalize the behavior complexity of the active distribution systems without a huge dataset. Besides, detectors such as CUSUM, DBSCAN, and our MLSTM, are compared.\n\n\nB. Network Partition based on Modified Spectral Clustering\n\nTo efficiently locate the cyber attacks, we propose to first partition the active distribution systems into several subregions. It is similar to divide a centralized problem into smaller problems and solving them in a distributed manner. Spectral clustering is a classic unsupervised learning method based on the graph theory to partition a graph into several sub-graphs [36], [37], which is easy to implement and performs well. Therefore it is suitable for the active distribution system partition in our study. We propose a modified spectral clustering to search for the optimal partition results. [v 1 , v 2 , . . . , v K ]. 5: Stack the vectors to form a matrix with the vectors as columns. 6: Represent every node by the corresponding row of the stacked matrix, which forms the feature matrix. 7: Use K-means clustering to cluster data samples into K clusters {C 1 , C 2 , . . . , C K }.\n\nLet A ∈ R N ×N be the adjacency matrix of our WMU sensor topology and its entry is defined as\nA ij = 1\nZij , if node i and j are connected. 0, otherwise.\n\nwhere Z ij is the impedance between vertex i and vertex j. In this case, A ij = 1 Zij if vertex i and vertex j are connected in the original active distribution system topology and A ij = 0 if vertex i and vertex j are not connected directly. Let D = diag(A1 n ) be the diagonal matrix where D ii is the degree d i of node i, i.e., d i = N j=1 A ij . In addition, let S ∈ R N ×N be the affinity matrix calculated based on the measurement correlations. This measurement correlation could be customized as long as it could represent the electrical distance among nodes. Since we have considered three-phase unbalance in our models, it should be pointed out that we use the average of three-phase current and voltage to calculate the measurement correlation.\n\nThe modified Laplacian matrix L can be defined as\nL = (D − S) + µ(D − A),(4)\nwhere µ is a penalty term, without losing generality, to balance the influences on grid partition result from static topology and dynamic data structure. Then, the eigenstructure of the Laplacian matrix L is analyzed to decide which cluster the nodes belong to. The details of the modified spectral clustering can be found in Algorithm 1.\n\n\nC. Cyber Attack Localization within Sub-regions\n\nCombining our proposed cyber attack detection and modified spectral clustering, the cyber attack can be located into a sub-region of the large-scale networks. Furthermore, we need to locate the cyber attack within the sub-regions. Following the assumption that the affected waveform signals show different influences according to the distances between the sensor locations and the cyber attack location, we propose a signal anomaly strength-based approach to detect the exact location of the cyber attack. The location of WMU's placement plays a vital role in better observability and localization of cyber attacks. Note that, in our study, we assume the topology is known beforehand. Comparing the abnormal scales, the relative distances can be determined. Therefore, the relative locations in the topology can be inferred. However, sometimes, this approach may provide a range instead of a node point, which is already an improvement using limited sensors.\n\nThe disturbance at the point of impact of stone is stronger, but it fades out soon, and at the other end of the lake, no such disturbance can be visibly detected. Similarly, the WMU can detect the cyber attacks if they are near the cyber attack location, and in some cases, multiple WMU can detect the cyber attacks. Cyber attacks which have a more significant impact will generate obvious signatures and can be detected in multiple WMU. However, some minor cyber attacks or cyber attacks are local, and their signatures are not strong enough to be picked up by WMUs far in the electrical distance in the network. Therefore, we compute statistical parameters and get a normalized score to determine the WMU with the strongest signal for a particular. This method helps extract information based on WMU data.\n\n1) Impact Scores of WMUs: To characterize the pattern of the waveform data, we proposed the following four (4) statistical measures:\n\n• Standard Deviation σ: σ is suitable for measuring the data distribution and in our case the disturbance caused by the attack in waveform data. σ can be calculated as:\nσ = 1 N N i=1 (X i − µ) 2 ,(5)\nwhere 'X' is the stream data, 'i' is the index of the stream data window length 'N ', and µ is the mean of data window. • Range: Range measures the pattern variation of WMU data during the cyber attack. It can be expressed as:\nRange = |max(X i ) − min(X i )| ,(6)\nwhere the data ranges from 'i = 1' to 'i = N ' and N is the window length. • Mean Difference (MD): MD is calculated using data points in previous and current windows. MD captures the information on the magnitude shift, and is defined as:\nM D = |µ previous − µ current | ,(7)\nwhere µ previous and µ current are the mean value of the previous and current data windows, respectively. • Peak Factor (PF): PF measures the severity of the crest of the data during cyber attacks. A WMU close to the cyber attack would have a larger PF than a WMU which is far away from the cyber attack. PF is calculated following:\nP F = max(X i ) 1 N N i=1 (X i ) 2 .(8)\nThe nearest WMU from the cyber attack location regarding electrical distance will see more prominent cyber attack signatures. The respective values of the above discussed statistical measures would be higher. However, it is unfeasible to compare the scores of each measure computed above across WMUs. Normalization helps in the identification of prominent WMUs for a particular cyber attack by comparing the singlepoint scores. In our case, the normalized impact score is calculated as:\nIS = P F × (σ + Range + M D).(9)\n2) forming subgraph and subgraph scanning: After calculating the normalized impact score, the next step is to select the top WMUs based on the scores. Several WMUs detect specific cyber attacks as their system-level impact is higher. A cyber attack would be seen by multiple WMUs, and a transformer tap change or a load change would be sensed locally by WMUs at those buses, at adjacent buses, or WMUs placed close to the cyber attack bus in terms of electrical distance.\n\nThe process of the subgraph scanning and cyber attack localization are explained in Algorithm 2. It takes the clustering result matrix and cyber attack detection result as the inputs. From the cyber attack detection result, the cluster including the cyber attack nodes will be selected. Then, the normalized IS score of each element in the selected cluster will be calculated. Depending on if the cyber attack location is on the WMU bus or not, the output cyber attack location will be the node with the highest IS score or between the first highest IS score node and the second highest IS score node. CyberAttackLocation is in between the 1st highest IS WMU and 2nd highest IS WMU return SubGraph, CyberAttackLocation\n\n\nIV. EXPERIMENT\n\nOur design is designed for the cyber attacks towards active distribution systems, while the experiment is evaluated and demonstrated with DERs in the study cases.\n\n\nA. Simulation Setup\n\nFirst, an IEEE 37-node distributed grid is built in OPAL-RT. Based on the power grid topology, two PV farms and a VSI based DER are connected to the grid shown in Fig. 3. The smart grid system is connected to the main power grid via node 799, so node 799 can be viewed as a voltage source. The PV farm I (node 727) has a power generation of 390kW; PV farm II (node 710) has a power generation of 120kW; The DER (node 744) has a power generation of 130kW. The FDI attacks modeled in section II are implemented in PV farms and DER. Three FDI attacks, which are shown in Table I, are designed for compromising the converter controller of different DERs. In addition, an FDI induced three-phase short circuit fault is also simulated to verify the algorithm feasibility.  Using the OSP method [35], the sensor placement results in the IEEE 37-node distribution network model are obtained (Fig. 3), where 14 waveform sensors should be placed at the corresponding nodes to make the system numerically observable. Therefore, we collect 98 (7×14) dimension streaming data, where 3 phase currents, 3 phase voltages, and 1d time stamp are included. To fully observe the power system behaviors, including both normal and abnormal activities, we simulated one (1) minute long data. Because of the 10000 Hz sampling frequency, the data length is 600001, resulting in a data measurement matrix 98×600001 for each case. Thus, efficient data analysis is required to process the extensive amount of data.  \n\n\nB. Cyber Attack Detection\n\nAs described in section III-A, our previous MLSTM model is adopted to implement real-time cyber attack detection. We also compare it with linear regression, CUSUM [38], and DBSCAN [39]. The comparison results are shown in Table II. In a quantitative data-driven experiment evaluation, there are four important metrics: true positives (TP), true negatives (TN), false positives (FP), and false negatives (FN). TP denotes the rate of actual attack correctly predicted as an attack, TN denotes the rate of actual normal correctly predicted as normal,  \n\n\nC. Active Distribution System Partition Results\n\nTo compare, we applied both the traditional spectral clustering algorithm and the modified spectral clustering defined in Algorithm 1 to implement the grid partitioning. We demonstrate the power grid partitioning result based on the traditional spectral clustering method in Fig. 6, and the result based on the proposed method in Fig. 7. Our proposed method brings in a more condensed and connected clustering result, making more sense in the sub-region partitioning.\n\nTwo cases are discussed here. The first case is that a cyber attack towards the PV farm inverter (node 727) happens. different output labels, such as nodes 702 and 732. The clustering results in Fig. 8 has some problems, such as node 742, which should belong to the same cluster as nodes 705 and 702 because they were clustered together in the normal case shown in Fig. 7 and the cyber attack does not happen near this sub-region. The second case is that an FDI induced three-phase ground fault (short circuit) at node 706.   Fig. 11. Intuitively speaking, the modified spectral clustering generates a better result, as the nodes belonging to the same clusters are also geographically located in the same sub-regions. In contrast, some node clustering results in Fig. 10 do not entirely make sense.   To quantitatively analyze the grid partitioning results, we employ the Silhouette score [40] as the index to evaluate the performance of the clustering results. In general, a higher Silhouette value indicates a closer electrical connection inside the sub-region and a looser connection among various sub-regions. The results of the average Silhouette scores of three different clustering methods in two cases are shown in Table. III. We can observe that in both cases, the average Silhouette scores of the proposed modified spectral clustering results are generally higher than the other ways. A higher average Silhouette score indicates that our proposed approach obtains a superior supervised clustering result in terms of the correlation or inner distance. Thus, in both qualitative and quantitative analysis, our proposed approach achieves better results.\n\n\nD. Cyber Attack Location in the Sub-regions\n\nAfter clustering nodes into different groups, a more accurate cyber attack location should be estimated. To confirm the cyber attack location, our proposed subgraph scanning and localization algorithm is conducted, whose detail is explained in Algorithm 2. The statistical IS (impact score) of every potential cyber attack location would be calculated, and the node getting highest IS score would be considered as the cyber attack location or the place nearest to the cyber attack location. Taking the FDI attack case at node 727 ( Fig. 9) and fault case at node 706 (Fig. 11) as the examples, we calculate the IS score to determine the cyber attack location. For the FDI attack case, combined with detection result and clustering results, we located the target locations to node 709, 744, 727 as shown Fig. 9. There IS results are shown in the right-side figure in Fig. 12, which shows that node 727's IS is the highest when the attack is happening, indicating the cyber attack should be located in there, and it is actually correct. The left figure shows the IS scores for all the nodes in our power network. Among all the nodes, the node 727's IS is still the highest. It could capture some global topology information but not exactly. Moreover, calculating global IS would cost much more time than just calculating the nodes in the sub-graph. For the cyber attack case at node 706, combined with detection result and clustering results, we located the target locations to node 707, 714, 725 as shown Fig. 11. Fig. 13 shows two sub-regions with cyber attack (Fig. 13(a)) and without cyber attack (Fig. 13(b)). Their IS results are shown in Fig. 14. It shows that node 725's IS is the highest when the fault is happening, but in this case, it's not the same node; otherwise, the difference between each node should be more significant.Therefore, the cyber attack location should be node 706, which is correct.\n\nWe evaluate our localization performance by comparing with the NS (Normalized Score) in the reference [41], which is calculated to locate the cyber attack location in the network using micro-PMU data. Fig. 15 shows the NS results for the nodes of the subgraph in both FDI attack cases. From the figure, we can see that the NS score works well in the ground fault case. However, for the attack on node 727, the result leads us to the wrong location. The NS scores of Node 744 and 727 are higher than the cyber attack location node 725, and they are not distinguishable, which means ours IS score is more robust in terms of the waveform data.   \n\n\nE. Robustness and Sensitivity Analysis\n\nTo investigate the robustness and sensitivity of the proposed method against various measurement noises, we add white Gaussian noise to the signal with different Signal Noise Ratios (SNRs). Table IV shows the result of an attack on node 744. To get the detection accuracy and Silhouette score in the table, we conduct 20 times experiments with random noise and calculate the average. For the localization accuracy, we only take account when the subgraph is correctly located. Then calculate the average of 20 times experiments. From the result, our proposed method has great robustness against noise, even doing good when SNR is 5dB. When SNR equals 0dB, the signal is submerged by the noise. Since the measurement noise may not follow Gaussian distribution, we also considered adding Laplace noise (µ = 0 and b = 1) to the signal. Compared with normal distribution, the Laplace distribution has more flatten or long tails data, which means it has bigger variance. The result is shown in Table V. From the result, we can tell there is no significant difference between Laplace noise and Gaussion noise. Both of them perform well until the signal is almost overwhelmed by noise. It shows that our method captures the characteristics of the sequential data as a whole, which makes it of good robustness.\n\n\nF. Performance in a Larger-Scale System\n\nTo show the scalability of the proposed method, we test the proposed method on the widely used IEEE 123-bus distribution system (Fig. 16), which contains the distribution lines and loads in single-phase, two-phase, and three-phase [42]. To guarantee the observability, WMU sensors are installed on 51 buses which is 41.5% of the total amount (details can be found in Table VI). Following the same setup of the previous IEEE 37-node distributed grid experiment, the IEEE 123-bus system is built in OPAL-RT as well. Three FDI attacks against DER1 and DER2 have been modeled. Figs. 17 and 18 illustrate the partition results when an FDI-induced three-phase ground short circuit fault happens for traditional spectral clustering and our proposed method, respectively. The quantitative results for all cases are shown in Table VII. The proposed approach not only works in this larger grid, but also generates superior results compared to other methods.    \n\n\nG. Approach Feasibility Discussion\n\nThe voltage and current waveform measurements in our study are provided by WMUs (Section. III-A). Such emerging sensors are well-suited to study transient events in power distribution systems [43]. Till now, WMU has been adopted in a few applications, such as harmonic addition and cancellation in transformers [8], sub-synchronous resonance analysis [12], and power quality event localization [44]. Typically, a WMU can report 256 readings per cycle [45]. To support synchro-nized measurements at a such high rate, WMUs have a time accuracy of 1 µ second [45]. In our IEEE 123-bus study case, the sampling rate is 5000 Hz, namely around 83 readings per cycle, which means the measurement provided by a typical WMU is more than enough to locate nodes under attack.\n\nV. CONCLUSION In this paper, we proposed an adaptive hierarchical cyber attack localization approach for active distribution systems. Electric waveform signals obtained by WMU sensors are used to capture the abnormal features, which would be otherwise ignored. To improve the efficiency, we propose a modified spectral clustering method to first partition the whole large network into smaller 'coarse' sub-regions. Next, the accurate 'fine' cyber attack location can be determined by calculating and analyzing Impact Score of each sensor in the potential sub-region. Furthermore, we compare our method with other methods in each step in cyber attack detection, sub-graph clustering, and localization, respectively. The results from two representative distribution grids show that our method shows promising performances.\n\n\nAPPENDIX A MODELING DISTRIBUTED ENERGY RESOURCES\n\nWith more and more DERs integrated into power system, a growing number of security problems are being exposed constantly. Also, the cyber-phyiscal security becomes priority especially considering the evolution of smart inverters in DERs. Here, FDI attacks on PV converter and voltage source inverter are modeled. \n\n\nTwo-stage two-level PV Converter Model\n\nAs shown in the Fig. 2, two-stage PV converters are constructed. The first stage includes PV array and DC/DC converter. The PV array voltage U pv and current I pv are the input of DC/DC controller. The MPPT algorithm is applied in DC/DC controller so that PV array generates maximum power to inverter. And the second stage comprises DC/AC inverter and LCL filter. In the DC/AC controller, voltage control loop is used to maintain DC link voltage and generate the current reference I * f d for the current control loop. The reactive power control loop is built in the controller and determines the I f q . The current loop can be expressed as,\nU * id = k p (I * f d − I f d ) + k i (I * f d − I f d ) s − ωL f I f q , U * iq = k p (I * f d − I f d ) + k i (I * f d − I f d ) s + ωL f I f d , (A.1)\nwhere, I f d,q is inverter side current in the LCL filter, and L f is the inductance in LCL filter, k p , k i are the PI parameters, U * id,q is the control signal to PWM. The inverter and LCL filter can be modeled as follow,\nI f d = 1 L f (U id − U cd ) + ωI f q , I f q = 1 L f (U iq − U cq ) − ωI f d , U cd = 1 C f (I f d − I gd ) + ωU cq , U cq = 1 C f (I f q − I gq ) − ωU cd , I gd = 1 L g (U cd − U gd ) + ωI gq , I gq = 1 L g (U cq − U gq ) − ωI gd . (A.2)\n\nModel of DER Based on Voltage Source Inverter (VSI)\n\nBesides the PV farm, some DERs do not only offer power to the grid but also maintain stability of frequency and voltage. As shown in Fig. A.1, a DER model based on voltage source inverter is built. DC capacitor voltage represents the renewable energy, e.g. wind turbine, battery, etc. The droop control loop is constructed in the controller, which can be expressed as,\nω = ω n − m p P, θ = ω n t − m p P dt, v * d = V n − n q Q, v * q = 0, (A.3)\nwhere ω n is the rated frequency, m p is active power droop coefficient, n q is active power droop coefficient, P and Q are power reference. Also, the voltage and current control loop is modeled in the controller. Both of two control loop is achieved with a standard PI controller. The current control loop in the VSI is same as in the PV converter. Thus, the model of voltage control loop is only introduced as follow,\nI * f d = k pv (U * cd − U cd ) + k iv (U * cd − U cd ) s − ωC f U cq , I * f q = k pv (U * cd − U cd ) + k iv (U * cd − U cd ) s + ωC f U cd , (A.4)\nwhere, I * f d,q is current reference for current control loop, and C f is the capacitor in LCL filter, k pv , k iv are the PI parameters, U * cd,q is voltage reference for voltage control loop, U cd,q is the capacitor voltage in d,q framework. \n\nFig. 1 :\n1The proposed adaptive hierarchical online cyber attack localization workflow. The details are discussed in Section III.\n\n\nInput: Adjacency matrix A, data matrix X and cluster number K.2: Compute the Affinity matrix S based on the data matrix. 3: Compute the modified Laplacian matrix L = (D − S) + µ(D − A). 4: For K clusters, compute the first K eigenvectors\n\nFig. 3 :\n3A smart grid example with solar farms, which is based on the IEEE 37 node model. And the sensor locations from OSP are indicated by the black filled circles.\n\n\nFigs. 4 and 5 show the examples of the WMU current and voltage data samples in different cases, respectively.\n\nFig. 4 :\n4Current waveform examples captured by WMU sensors: (a) Node 744 under normal case; (b) Node 744 under cyber attack; (c) Node 744 when node 706 is under cyber attack; (d) Node 733 when node 710 is under cyber attack.\n\nFig. 5 :\n5Corresponding voltage waveforms to the current waveforms shown inFig. 4captured by WMU sensors. Note that the waveform distortions are more obvious in the current waveforms.FP denotes the rate of actual attack is incorrectly predicted as normal, FN denotes the rate of actual normal incorrectly predicted as normal. Precision (P recision = T P/(T P + F P )) and recall (Recall= T P/(T P +F N )) are used to evaluate the model's performance in a more comprehensive way. Precision shows what proportion of positive identifications was actually correct, which quantifies the number of positive class predictions that actually belong to the positive class. Recall tells what proportion of actual positives was identified correctly, which quantifies the number of positive class predictions made out of all positive examples in the dataset. By combining both Precision and Recall, we could have a more accurate understanding of our model's performance, especially when dealing with an unbalanced dataset.\n\nFig. 6 :\n6Figs. 8 and 9show the network partitioning results based on the traditional spectral clustering and the proposed modified spectral clustering method, respectively. Although most nodes have the same clustering results, some nodes are showing Power grid partitioning result based on the traditional spectral clustering method in the IEEE 37-node model. Clustered grid nodes are in different colors.\n\nFig. 7 :\n7Power grid partitioning result based on the modified spectral clustering method in the IEEE 37-node model. Clustered grid nodes are in different colors.\n\nFig. 10\n10demonstrates the dynamic grid partitioning via traditional spectral clustering, while the proposed modified spectral clustering result is shown in\n\nFig. 8 :Fig. 9 :\n89Network partitioning result based on the traditional spectral clustering when a FDI attack occurs at node 727. Network partitioning result based on the proposed clustering method when a FDI attack occurs at node 727.\n\nFig. 10 :\n10Network partitioning result based on the traditional spectral clustering when a FDI attack occurs at node 706.\n\nFig. 11 :\n11Network partitioning result based on the proposed modified spectral clustering when a FDI attack occurs at node 706.\n\nFig. 12 :\n12IS scores for attack on node 727: (a) the whole topology and (b) the subgraph. In both figures, node 727 obviously has the highest IS.\n\nFig. 13 :\n13Sub-regions (a) with the cyber attack and (b) without the cyber attack inFig. 11.\n\nFig. 14 :\n14(a) IS score for FDI induced three phase short circuit fault on node 706. (b) zoom in version of (a). From both figures, node 725 obviously has the highest IS, which is nearest to the cyber attack location.\n\nFig. 15 :\n15NS score results: (a) FDI attack case and (b) FDI attack induced fault case.\n\nFig. 16 :\n16IEEE 123-bus distribution system. The WMU sensors are marked in yellow.\n\nFig. 17 :\n17Power grid partitioning result based on the proposed spectral clustering method in the IEEE 123-bus model. Clustered grid nodes are in different colors.\n\nFig. 18 :\n18Power grid partitioning result based on the traditional spectral clustering method in the IEEE 123-bus model. Clustered grid nodes are in different colors.\n\nFig. A. 1 :\n1Voltage source inverter (VSI) DER model.\n\nJinan\nZhang received the B.S. degree from North China Electric Power University in 2012 and M.S. in Electrical Engineering from Tianjin University, Tianjin, China, in 2015. Currently he is pursuing a Ph.D. degree with the University of Georgia, Athens, GA, USA. He is also a Research Assistant with the University of Georgia, USA. His current research focuses on security and resilience in powerelectronics-based power systems. Junbo Zhao is an assistant professor of the Department of Electrical and Computer Engineering at the University of Connecticut. He was an assistant professor and research assistant professor at Mississippi State University and Virginia Tech from 2019-2021 and 2018-2019, respectively. He received the Ph.D. degree from Bradley Department of Electrical and Computer Engineering Virginia Tech, in 2018. He did the summer internship at Pacific Northwest National Laboratory in 2017. He is the Principal Investigator for a multitude of projects funded by the National Science Foundation, the Department of Energy, National Laboratories, and Eversource Energy. He is now the chair of IEEE Task Force on Power System Dynamic State and Parameter Estimation and IEEE Task Force on Cyber-Physical Interdependency for Power System Operation and Control, co-chair of the IEEE Working Group on Power System Static and Dynamic State Estimation, the secretary of IEEE PES Bulk Power System Operation Subcommittee and IEEE Task Force on Synchrophasor Applications in Power System Operation and Control. He has published three book chapters and more than 100 peer-reviewed journal and conference papers. He serves as the Associate Editor of IEEE Transactions on Power Systems, IEEE Transactions on Smart Grid, International Journal of Electrical Power Energy Systems, North America Regional Editor of the IET Renewable Power Generation, and subject editor of IET Generation, Transmission Distribution. He has been listed as the 2020 and 2021 World's Top 2% Scientists released by Stanford University in both Single-Year and Career tracks. He is the receipt of the best paper awards of the 2020 and 2021 IEEE PES General Meeting (3 papers), IEEE I&CPS Asia 2021, and the 2020 Journal of Modern Power Systems and Clean Energy, Top 3 Associate Editor award of IEEE Transactions Smart Grid in 2020, the 2020 IEEE PES Chapter Outstanding Engineer Award, and the 2021 IEEE PES Chapter Outstanding Volunteer Award. My research interests are cyber-physical power system modeling, monitoring, uncertainty quantification, learning, dynamics, stability control, and cyber security with DERs. Jin Ye received the B.S. and M.S. degrees in electrical engineering from Xi'an Jiaotong University, Xi'an, China, in 2008 and 2011, respectively, and the Ph.D. degree in electrical engineering from Mc-Master University, Hamilton, ON, Canada, in 2014. She is currently an Assistant Professor of electrical engineering and the Director of the Intelligent Power Electronics and Electric Machines Laboratory, University of Georgia, Athens, GA, USA. Her current research interests include power electronics, electric machines, energy management systems, smart grids, electrified transportation, and cyber-physical systems. Dr. Jin Ye is the General Chair of 2019 IEEE Transportation Electrification Conference and Expo (ITEC), and the Publication Chair and Women in Engineering Chair of 2019 IEEE Energy Conversion Congress and Expo (ECCE). She is an Associate Editor for IEEE TRANSACTIONS ON POWER ELECTRONICS, IEEE OPEN JOURNAL OF POWER ELECTRONICS, IEEE TRANSACTIONS ON TRANSPORTATION ELECTRIFICATION, and IEEE TRANSACTIONS ON VEHICULAR TECHNOLOGY. WenZhan Song received his Ph.D. in Computer Science from Illinois Institute of Technology (2005), B.S. and M.S. degrees from Nanjing University of Science and Technology (1997 and 1999). He is a Chair Professor of Electrical and Computer Engineering in the University of Georgia. Dr. Song's research focuses on cyber-physical systems and their applications in energy, environment, food and health sectors. He received NSF CAREER award in 2010. Fangyu Li received the Ph.D. in Computational Geophysics from The University of Oklahoma in 2017. His Master (2013) and Bachelor (2009) degrees were both in Electrical Engineering, obtained from Tsinghua University and Beihang University, respectively. From 2017 to 2020, he was a postdoctoral fellow with the College of Engineering, University of Georgia. From 2020 to 2021, he was an assistant professor with the Department of Electrical and Computer Engineering at Kennesaw State University. Dr. Li is currently a full professor and PhD supervisor with the Faculty of Information Technology at Beijing University of Technology. His research interests include complex signal processing, machine learning, deep learning, distributed computing, complex system modeling and monitoring, Internet of things (IoT), and cyber-physical systems (CPS).\n\n\nAlgorithm 2 Subgraph scanning and localization Input clustering result matrix, cyber attack detection result. Output Subgraph, Cyber Attack location 1: From the proposed spectral clustering result, select the cluster which comprises the cyber attack nodes based on the detection result. 2: Subgraph = selected cluster 3: Compute the Normalized Impact Score [Eq. (9)] for each element in subgraph. 4: CyberAttackLocation = W M U with highest IS 5: if Cyber attack location is not on the WMU bus then6: \n\nPick the WMU with 2nd highest IS \n\n7: \n\n\n\nTABLE I :\nIDetails about FDI attacks towards the power grid.\n\nTABLE II :\nIIPerformance of different detectorsMethods \nPrecision \nRecall \n\nLinear Regression \n0.8803 \n0.6425 \n\nDBSCAN \n0.6213 \n0.5977 \n\nCUSUM \n0.7296 \n0.7401 \nProposed \n0.9523 \n0.9662 \n\n\n\nTABLE III :\nIIISilhouette score table for IEEE 37-node modelCases \nMethods \nAverage Silhouette score \n\nCyber attack \n\nproposed method \n0.8176 \n\nspectral clustering \n0.7611 \nKmeans \n0.5707 \n\nGround fault \n\nproposed method \n0.8056 \n\nspectral clustering \n0.7678 \nKmeans \n0.7822 \n\n\n\nTABLE IV :\nIVPerformance with different levels of Gaussian White Noise (cyber attack on the node 744).SNR level \n20dB \n15dB \n10dB \n5dB \n0dB \n\nDetection accuracy \n100% \n100% \n90% \n70% \n55% \n\nSilhouette score \n0.7624 \n0.7601 \n0.6912 \n0.6110 \n0.5411 \n\nLocalization accuracy \n100% \n100% \n95% \n85% \n70% \n\n\n\nTABLE V :\nVPerformance with different levels of Laplace Noise \n(cyber attack on the node 744). \n\nSNR level \n20dB \n15dB \n10dB \n5dB \n0dB \n\nDetection accuracy \n100% \n100% \n90% \n68% \n56% \n\nSilhouette score \n0.7615 \n0.7603 \n0.6933 \n0.6102 \n0.5451 \n\nLocalization accuracy \n100% \n100% \n93% \n82% \n70% \n\n\n\nTABLE VI :\nVIWMU sensors in IEEE 123-BUS systemWMU Sensors Installed Bus \nTotal No. \nPercentage \n\n1, 3, 5, 8, 14, 15, 19, 21, 23, 27, 29, 31, 36, \n38, 40, 42, 45, 47, 50, 53, 55, 58, 60, 62, \n65, 67, 70, 72, 74, 78, 82, 84, 87, 89, 91, \n93, 95, 99, 103, 105, 106, 110, 113, 135, \n149, 152, 160, 197, 250, 300, 450 \n\n51 \n41.5% \n\n\nTABLE VII :\nVIISilhouette score table for IEEE 123-bus modelCases \nMethods \nAverage Silhouette score \n\nFDI attack #1 \n\nproposed method \n0.7689 \n\nspectral clustering \n0.6529 \nKmeans \n0.5322 \n\nFDI attack #2 \n\nproposed method \n0.7815 \n\nspectral clustering \n0.5923 \nKmeans \n0.5328 \n\nFDI-induced fault \n\nproposed method \n0.7615 \n\nspectral clustering \n0.5119 \nKmeans \n0.5262 \n\n\n\nFault location in distribution networks through graph marking. I Džafić, R A Jabr, S Henselmeyer, T Onlagić, IEEE Transactions on Smart Grid. 92I. Džafić, R. A. Jabr, S. Henselmeyer, and T. onlagić, \"Fault location in distribution networks through graph marking,\" IEEE Transactions on Smart Grid, vol. 9, no. 2, pp. 1345-1353, 2016.\n\nNovel fault detection and localization algorithm for low voltage dc microgrid. R Bhargav, B R Bhalja, C P Gupta, IEEE Transactions on Industrial Informatics. R. Bhargav, B. R. Bhalja, and C. P. Gupta, \"Novel fault detection and localization algorithm for low voltage dc microgrid,\" IEEE Transactions on Industrial Informatics, 2019.\n\nOptimal partial feedback attacks in cyber-physical power systems. G Wu, G Wang, J Sun, J Chen, IEEE Transactions on Automatic Control. 659G. Wu, G. Wang, J. Sun, and J. Chen, \"Optimal partial feedback attacks in cyber-physical power systems,\" IEEE Transactions on Automatic Control, vol. 65, no. 9, pp. 3919-3926, 2020.\n\nEnhanced cyberphysical security in internet of things through energy auditing. F Li, Y Shi, A Shinde, J Ye, W.-Z Song, IEEE Internet of Things Journal. 63F. Li, Y. Shi, A. Shinde, J. Ye, and W.-Z. Song, \"Enhanced cyber- physical security in internet of things through energy auditing,\" IEEE Internet of Things Journal, vol. 6, no. 3, pp. 5224-5231, 2019.\n\nAutomated identification of electrical disturbance waveforms within an operational smart power grid. A J Wilson, D R Reising, R W Hay, R C Johnson, A A Karrar, T D Loveless, IEEE Transactions on Smart Grid. 115A. J. Wilson, D. R. Reising, R. W. Hay, R. C. Johnson, A. A. Karrar, and T. D. Loveless, \"Automated identification of electrical disturbance waveforms within an operational smart power grid,\" IEEE Transactions on Smart Grid, vol. 11, no. 5, pp. 4380-4389, 2020.\n\nTransmission-line fault analysis using synchronized sampling. P Dutta, A Esmaeilian, M Kezunovic, IEEE transactions on power delivery. 29P. Dutta, A. Esmaeilian, and M. Kezunovic, \"Transmission-line fault analysis using synchronized sampling,\" IEEE transactions on power delivery, vol. 29, no. 2, pp. 942-950, 2014.\n\nTransient monitoring function-based fault detection for inverter-interfaced microgrids. I Sadeghkhani, M E H Golshan, A Mehrizi-Sani, J M Guerrero, A Ketabi, IEEE Transactions on Smart Grid. 93I. Sadeghkhani, M. E. H. Golshan, A. Mehrizi-Sani, J. M. Guerrero, and A. Ketabi, \"Transient monitoring function-based fault detection for inverter-interfaced microgrids,\" IEEE Transactions on Smart Grid, vol. 9, no. 3, pp. 2097-2107, 2016.\n\nSynchrowaveform measurement units and applications. A F Bastos, S Santoso, W Freitas, W Xu, 2019 IEEE Power & Energy Society General Meeting (PESGM). IEEEA. F. Bastos, S. Santoso, W. Freitas, and W. Xu, \"Synchrowaveform measurement units and applications,\" in 2019 IEEE Power & Energy Society General Meeting (PESGM). IEEE, 2019, pp. 1-5.\n\nSEL-T400L Time Domain Line Protection. W A Pullman, Usa , Last AccessSchweitzer Engineering LaboratoriesSchweitzer Engineering Laboratories, Pullman, WA, USA., \"SEL-T400L Time Domain Line Protection,\" https://selinc.com/ products/T400L/, Last Access: July 31, 2020.\n\niPSR intelligent Power System Recorder. Candura, Oakville, Canada On, Last AccessCandura instruments, Oakville, ON, Canada., \"iPSR intelligent Power System Recorder,\" https://www.candura.com/ products/ipsr.html, Last Access: July 31, 2020.\n\nContactless measurement of substation busbars voltages and waveforms reconstruction using electric field sensors and artificial neural network. D Borkowski, A Wetula, A Bień, IEEE Transactions on Smart Grid. 63D. Borkowski, A. Wetula, and A. Bień, \"Contactless measurement of substation busbars voltages and waveforms reconstruction using electric field sensors and artificial neural network,\" IEEE Transactions on Smart Grid, vol. 6, no. 3, pp. 1560-1569, 2014.\n\nWaveform-based method for fast and accurate identification of subsynchronous resonance events. B Gao, R Torquato, W Xu, W Freitas, IEEE Transactions on Power Systems. 345B. Gao, R. Torquato, W. Xu, and W. Freitas, \"Waveform-based method for fast and accurate identification of subsynchronous resonance events,\" IEEE Transactions on Power Systems, vol. 34, no. 5, pp. 3626-3636, 2019.\n\nOnline distributed iot security monitoring with multidimensional streaming big data. F Li, R Xie, Z Wang, L Guo, J Ye, P Ma, W Song, IEEE Internet of Things Journal. 75F. Li, R. Xie, Z. Wang, L. Guo, J. Ye, P. Ma, and W. Song, \"Online distributed iot security monitoring with multidimensional streaming big data,\" IEEE Internet of Things Journal, vol. 7, no. 5, pp. 4387-4394, 2020.\n\nSystem statistics learning-based iot security: Feasibility and suitability. F Li, A Shinde, Y Shi, J Ye, X.-Y. Li, W.-Z Song, IEEE Internet of Things Journal. 64F. Li, A. Shinde, Y. Shi, J. Ye, X.-Y. Li, and W.-Z. Song, \"System statistics learning-based iot security: Feasibility and suitability,\" IEEE Internet of Things Journal, vol. 6, no. 4, pp. 6396-6403, 2019.\n\nDetection and diagnosis of data integrity attacks in solar farms based on multilayer long short-term memory network. F Li, Q Li, J Zhang, J Kou, J Ye, W Song, H A Mantooth, IEEE Transactions on Power Electronics. 363F. Li, Q. Li, J. Zhang, J. Kou, J. Ye, W. Song, and H. A. Mantooth, \"Detection and diagnosis of data integrity attacks in solar farms based on multilayer long short-term memory network,\" IEEE Transactions on Power Electronics, vol. 36, no. 3, pp. 2495-2498, 2021.\n\nHolistic modeling and analysis of multistage manufacturing processes with sparse effective inputs and mixed profile outputs. A Wang, J Shi, IISE Transactions. 535A. Wang and J. Shi, \"Holistic modeling and analysis of multistage manufacturing processes with sparse effective inputs and mixed profile outputs,\" IISE Transactions, vol. 53, no. 5, pp. 582-596, 2021.\n\nCyber-physical security of powertrain systems in modern electric vehicles: Vulnerabilities, challenges, and future visions. J Ye, L Guo, B Yang, F Li, L Du, L Guan, W Song, IEEE Journal of Emerging and Selected Topics in Power Electronics. 94J. Ye, L. Guo, B. Yang, F. Li, L. Du, L. Guan, and W. Song, \"Cyber-physical security of powertrain systems in modern electric vehicles: Vulnerabilities, challenges, and future visions,\" IEEE Journal of Emerging and Selected Topics in Power Electronics, vol. 9, no. 4, pp. 4639-4657, 2021.\n\nDetection and identification of cyber and physical attacks on distribution power grids with pvs: An online high-dimensional data-driven approach. F Li, R Xie, B Yang, L Guo, P Ma, J Shi, J Ye, W Song, IEEE Journal of Emerging and Selected Topics in Power Electronics. Early AccessF. Li, R. Xie, B. Yang, L. Guo, P. Ma, J. Shi, J. Ye, and W. Song, \"Detection and identification of cyber and physical attacks on distri- bution power grids with pvs: An online high-dimensional data-driven approach,\" IEEE Journal of Emerging and Selected Topics in Power Electronics, Early Access.\n\nMitigating concurrent false data injection attacks in cooperative dc microgrids. J Zhang, S Sahoo, J C , .-H Peng, F G Blaabjerg, IEEE Transactions on Power Electronics. early accessJ. Zhang, S. Sahoo, J. C.-H. Peng, and F. G. Blaabjerg, \"Mitigating concurrent false data injection attacks in cooperative dc microgrids,\" IEEE Transactions on Power Electronics, 2021, early access.\n\nThe compression of electric signal waveforms for smart grids: State of the art and future trends. M P Tcheou, L Lovisolo, M V Ribeiro, E A Silva, M A Rodrigues, J M Romano, P S Diniz, IEEE Transactions on Smart Grid. 51M. P. Tcheou, L. Lovisolo, M. V. Ribeiro, E. A. Da Silva, M. A. Rodrigues, J. M. Romano, and P. S. Diniz, \"The compression of electric signal waveforms for smart grids: State of the art and future trends,\" IEEE Transactions on Smart Grid, vol. 5, no. 1, pp. 291-302, 2013.\n\nAn interactive smart grid communication approach for big data traffic. Y.-C Chang, T.-C Huang, Computers & Electrical Engineering. 67Y.-C. Chang and T.-C. Huang, \"An interactive smart grid communication approach for big data traffic,\" Computers & Electrical Engineering, vol. 67, pp. 170-181, 2018.\n\nData processing of high-rate low-voltage distribution grid recordings for smart grid monitoring and analysis. H Maaß, H K Cakmak, F Bach, R Mikut, A Harrabi, W Süß, W Jakob, K.-U Stucky, U G Kühnapfel, V Hagenmeyer, EURASIP Journal on Advances in Signal Processing. 20151H. Maaß, H. K. Cakmak, F. Bach, R. Mikut, A. Harrabi, W. Süß, W. Jakob, K.-U. Stucky, U. G. Kühnapfel, and V. Hagenmeyer, \"Data processing of high-rate low-voltage distribution grid recordings for smart grid monitoring and analysis,\" EURASIP Journal on Advances in Signal Processing, vol. 2015, no. 1, pp. 1-21, 2015.\n\nRule-based data-driven analytics for wide-area fault detection using synchrophasor data. X Liang, S A Wallace, D Nguyen, IEEE Transactions on Industry Applications. 533X. Liang, S. A. Wallace, and D. Nguyen, \"Rule-based data-driven analytics for wide-area fault detection using synchrophasor data,\" IEEE Transactions on Industry Applications, vol. 53, no. 3, pp. 1789-1798, 2016.\n\nA datadriven method to detect and localize the single-phase grounding fault in distribution network based on synchronized phasor measurement. B Wang, H Wang, L Zhang, D Zhu, D Lin, S Wan, EURASIP Journal on Wireless Communications and Networking. 20191195B. Wang, H. Wang, L. Zhang, D. Zhu, D. Lin, and S. Wan, \"A data- driven method to detect and localize the single-phase grounding fault in distribution network based on synchronized phasor measurement,\" EURASIP Journal on Wireless Communications and Networking, vol. 2019, no. 1, p. 195, 2019.\n\nA pmu-data-driven disruptive event classification in distribution systems. I Niazazari, H Livani, Electric Power Systems Research. 157I. Niazazari and H. Livani, \"A pmu-data-driven disruptive event classi- fication in distribution systems,\" Electric Power Systems Research, vol. 157, pp. 251-260, 2018.\n\nCause identification of electromagnetic transient events using spatiotemporal feature learning. I Niazazari, R J Hamidi, H Livani, R Arghandeh, International Journal of Electrical Power & Energy Systems. 123106255I. Niazazari, R. J. Hamidi, H. Livani, and R. Arghandeh, \"Cause identification of electromagnetic transient events using spatiotemporal feature learning,\" International Journal of Electrical Power & Energy Systems, vol. 123, p. 106255, 2020.\n\nFault detection and protection strategy for islanded inverter-based microgrids. S F Zarei, H Mokhtari, F Blaabjerg, IEEE Journal of Emerging and Selected Topics in Power Electronics. S. F. Zarei, H. Mokhtari, and F. Blaabjerg, \"Fault detection and protec- tion strategy for islanded inverter-based microgrids,\" IEEE Journal of Emerging and Selected Topics in Power Electronics, 2019.\n\nReal-time detection of false data injection attacks in smart grid: A deep learning-based intelligent mechanism. Y He, G J Mendis, J Wei, IEEE Transactions on Smart Grid. 85Y. He, G. J. Mendis, and J. Wei, \"Real-time detection of false data injection attacks in smart grid: A deep learning-based intelligent mech- anism,\" IEEE Transactions on Smart Grid, vol. 8, no. 5, pp. 2505-2516, 2017.\n\nLocational detection of the false data injection attack in a smart grid: A multilabel classification approach. S Wang, S Bi, Y.-J A Zhang, IEEE Internet of Things Journal. 79S. Wang, S. Bi, and Y.-J. A. Zhang, \"Locational detection of the false data injection attack in a smart grid: A multilabel classification approach,\" IEEE Internet of Things Journal, vol. 7, no. 9, pp. 8218- 8227, 2020.\n\nCyber attacks in smart grid-dynamic impacts, analyses and recommendations. B R Amin, S Taghizadeh, M S Rahman, M J Hossain, V Varadharajan, Z Chen, IET Cyber-Physical Systems: Theory & Applications. 54B. R. Amin, S. Taghizadeh, M. S. Rahman, M. J. Hossain, V. Varad- harajan, and Z. Chen, \"Cyber attacks in smart grid-dynamic impacts, analyses and recommendations,\" IET Cyber-Physical Systems: Theory & Applications, vol. 5, no. 4, pp. 321-329, 2020.\n\nA case study of an industrial power plant under cyberattack: Simulation and analysis. M Stȃnculescu, S Deleanu, P C Andrei, H Andrei, Energies. 1492568M. Stȃnculescu, S. Deleanu, P. C. Andrei, and H. Andrei, \"A case study of an industrial power plant under cyberattack: Simulation and analysis,\" Energies, vol. 14, no. 9, p. 2568, 2021.\n\nFalse data injection attacks against state estimation in multiphase and unbalanced smart distribution systems. P Zhuang, R Deng, H Liang, IEEE Transactions on Smart Grid. 106P. Zhuang, R. Deng, and H. Liang, \"False data injection attacks against state estimation in multiphase and unbalanced smart distribution systems,\" IEEE Transactions on Smart Grid, vol. 10, no. 6, pp. 6000- 6013, 2019.\n\nFalse data injection attacks against state estimation in power distribution systems. R Deng, P Zhuang, H Liang, IEEE Transactions on Smart Grid. 103R. Deng, P. Zhuang, and H. Liang, \"False data injection attacks against state estimation in power distribution systems,\" IEEE Transactions on Smart Grid, vol. 10, no. 3, pp. 2871-2881, 2018.\n\nAnalysis of moving target defense in unbalanced and multiphase distribution systems considering voltage stability. M Liu, C Zhao, Z Zhang, R Deng, P Cheng, 2021 IEEE International Conference on Communications, Control, and Computing Technologies for Smart Grids (SmartGridComm). IEEEM. Liu, C. Zhao, Z. Zhang, R. Deng, and P. Cheng, \"Analysis of moving target defense in unbalanced and multiphase distribution systems considering voltage stability,\" in 2021 IEEE International Conference on Communications, Control, and Computing Technologies for Smart Grids (SmartGridComm). IEEE, 2021, pp. 207-213.\n\nPhasor measurement units optimal placement and performance limits for fault localization. M Jamei, R Ramakrishna, T Tesfay, R Gentz, C Roberts, A Scaglione, S Peisert, IEEE Journal on Selected Areas in Communications. 381M. Jamei, R. Ramakrishna, T. Tesfay, R. Gentz, C. Roberts, A. Scaglione, and S. Peisert, \"Phasor measurement units optimal place- ment and performance limits for fault localization,\" IEEE Journal on Selected Areas in Communications, vol. 38, no. 1, pp. 180-192, 2020.\n\nNormalized cuts and image segmentation. J Shi, J Malik, IEEE Transactions. 228J. Shi and J. Malik, \"Normalized cuts and image segmentation,\" IEEE Transactions on pattern analysis and machine intelligence, vol. 22, no. 8, pp. 888-905, 2000.\n\nA tutorial on spectral clustering. U , Von Luxburg, Statistics and computing. 174U. Von Luxburg, \"A tutorial on spectral clustering,\" Statistics and computing, vol. 17, no. 4, pp. 395-416, 2007.\n\nA note on multivariate cusum procedures. J D Healy, Technometrics. 294J. D. Healy, \"A note on multivariate cusum procedures,\" Technometrics, vol. 29, no. 4, pp. 409-412, 1987.\n\nDbscan revisited, revisited: why and how you should (still) use dbscan. E Schubert, J Sander, M Ester, H P Kriegel, X Xu, ACM Transactions on Database Systems (TODS). 423E. Schubert, J. Sander, M. Ester, H. P. Kriegel, and X. Xu, \"Dbscan revisited, revisited: why and how you should (still) use dbscan,\" ACM Transactions on Database Systems (TODS), vol. 42, no. 3, pp. 1-21, 2017.\n\nSurvey of clustering algorithms. R Xu, D Wunsch, IEEE Transactions on neural networks. 163R. Xu and D. Wunsch, \"Survey of clustering algorithms,\" IEEE Trans- actions on neural networks, vol. 16, no. 3, pp. 645-678, 2005.\n\nA real time event detection, classification and localization using synchrophasor data. S Pandey, A K Srivastava, B G Amidan, IEEE Transactions on Power Systems. 356S. Pandey, A. K. Srivastava, and B. G. Amidan, \"A real time event detection, classification and localization using synchrophasor data,\" IEEE Transactions on Power Systems, vol. 35, no. 6, pp. 4421-4431, 2020.\n\nShort-term distribution system state forecast based on optimal synchrophasor sensor placement and extreme learning machine. H Jiang, Y Zhang, 2016 IEEE Power and Energy Society General Meeting (PESGM). IEEEH. Jiang and Y. Zhang, \"Short-term distribution system state forecast based on optimal synchrophasor sensor placement and extreme learning machine,\" in 2016 IEEE Power and Energy Society General Meeting (PESGM). IEEE, 2016, pp. 1-5.\n\nSynchronous waveform measurements to locate transient events and incipient faults in power distribution networks. M Izadi, H Mohsenian-Rad, IEEE Transactions on Smart Grid. 125M. Izadi and H. Mohsenian-Rad, \"Synchronous waveform measurements to locate transient events and incipient faults in power distribution networks,\" IEEE Transactions on Smart Grid, vol. 12, no. 5, pp. 4295- 4307, 2021.\n\nEvent Location Identification in Distribution Networks Using Waveform Measurement Units. IEEE--, Event Location Identification in Distribution Networks Using Waveform Measurement Units. IEEE, 2020.\n\nipsr intelligent power system recorder. C Instruments, C. instruments. ipsr intelligent power system recorder. [Online]. Available: https://www.candura.com/ products/ipsr.html\n\nCurrently he is pursuing a Ph.D. degree at the University of Georgia. His current research focuses on cyber-physical systems and distributed system. Chongqing, China; Athens, GA, USA; Georgia, USAQi Li received the B.S. degree in Optoelectric Information Science and Engineering from Chongqing University in 2014 and M.S. in Computer Engineering from Chongqing UniversityHe is also a Research Assistant at the University ofQi Li received the B.S. degree in Optoelectric In- formation Science and Engineering from Chongqing University in 2014 and M.S. in Computer Engineer- ing from Chongqing University, Chongqing, China, in 2019. Currently he is pursuing a Ph.D. degree at the University of Georgia, Athens, GA, USA. He is also a Research Assistant at the University of Georgia, USA. His current research focuses on cyber-physical systems and distributed system.\n", "annotations": {"author": "[{\"end\":118,\"start\":100},{\"end\":130,\"start\":119},{\"end\":137,\"start\":131},{\"end\":143,\"start\":138},{\"end\":147,\"start\":144}]", "publisher": null, "author_last_name": "[{\"end\":117,\"start\":105},{\"end\":129,\"start\":119},{\"end\":136,\"start\":133},{\"end\":142,\"start\":140},{\"end\":146,\"start\":144}]", "author_first_name": "[{\"end\":104,\"start\":100},{\"end\":132,\"start\":131},{\"end\":139,\"start\":138}]", "author_affiliation": null, "title": "[{\"end\":93,\"start\":1},{\"end\":240,\"start\":148}]", "venue": null, "abstract": "[{\"end\":1496,\"start\":331}]", "bib_ref": "[{\"attributes\":{\"ref_id\":\"b3\"},\"end\":1516,\"start\":1513},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":1655,\"start\":1652},{\"attributes\":{\"ref_id\":\"b5\"},\"end\":2169,\"start\":2166},{\"attributes\":{\"ref_id\":\"b6\"},\"end\":2174,\"start\":2171},{\"attributes\":{\"ref_id\":\"b7\"},\"end\":2263,\"start\":2260},{\"attributes\":{\"ref_id\":\"b11\"},\"end\":2269,\"start\":2265},{\"attributes\":{\"ref_id\":\"b12\"},\"end\":2466,\"start\":2462},{\"attributes\":{\"ref_id\":\"b3\"},\"end\":2548,\"start\":2545},{\"attributes\":{\"ref_id\":\"b13\"},\"end\":2554,\"start\":2550},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":3027,\"start\":3023},{\"attributes\":{\"ref_id\":\"b16\"},\"end\":3033,\"start\":3029},{\"attributes\":{\"ref_id\":\"b3\"},\"end\":3174,\"start\":3171},{\"attributes\":{\"ref_id\":\"b13\"},\"end\":3180,\"start\":3176},{\"attributes\":{\"ref_id\":\"b17\"},\"end\":3186,\"start\":3182},{\"attributes\":{\"ref_id\":\"b18\"},\"end\":3192,\"start\":3188},{\"attributes\":{\"ref_id\":\"b19\"},\"end\":3426,\"start\":3422},{\"attributes\":{\"ref_id\":\"b21\"},\"end\":3432,\"start\":3428},{\"attributes\":{\"ref_id\":\"b22\"},\"end\":3603,\"start\":3599},{\"attributes\":{\"ref_id\":\"b23\"},\"end\":3640,\"start\":3636},{\"attributes\":{\"ref_id\":\"b24\"},\"end\":3710,\"start\":3706},{\"attributes\":{\"ref_id\":\"b25\"},\"end\":3751,\"start\":3747},{\"attributes\":{\"ref_id\":\"b0\"},\"end\":4227,\"start\":4224},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":4232,\"start\":4229},{\"attributes\":{\"ref_id\":\"b26\"},\"end\":4238,\"start\":4234},{\"attributes\":{\"ref_id\":\"b0\"},\"end\":4340,\"start\":4337},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":4358,\"start\":4355},{\"attributes\":{\"ref_id\":\"b26\"},\"end\":4383,\"start\":4379},{\"attributes\":{\"ref_id\":\"b27\"},\"end\":6364,\"start\":6360},{\"attributes\":{\"ref_id\":\"b28\"},\"end\":6370,\"start\":6366},{\"attributes\":{\"ref_id\":\"b29\"},\"end\":6571,\"start\":6567},{\"attributes\":{\"ref_id\":\"b30\"},\"end\":6593,\"start\":6589},{\"attributes\":{\"ref_id\":\"b31\"},\"end\":6745,\"start\":6741},{\"attributes\":{\"ref_id\":\"b32\"},\"end\":6846,\"start\":6842},{\"attributes\":{\"ref_id\":\"b33\"},\"end\":6996,\"start\":6992},{\"attributes\":{\"ref_id\":\"b34\"},\"end\":9091,\"start\":9087},{\"attributes\":{\"ref_id\":\"b12\"},\"end\":9461,\"start\":9457},{\"attributes\":{\"ref_id\":\"b13\"},\"end\":9467,\"start\":9463},{\"attributes\":{\"ref_id\":\"b12\"},\"end\":9494,\"start\":9490},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":9500,\"start\":9496},{\"attributes\":{\"ref_id\":\"b35\"},\"end\":10677,\"start\":10673},{\"attributes\":{\"ref_id\":\"b36\"},\"end\":10683,\"start\":10679},{\"attributes\":{\"ref_id\":\"b34\"},\"end\":18298,\"start\":18294},{\"attributes\":{\"ref_id\":\"b37\"},\"end\":19191,\"start\":19187},{\"attributes\":{\"ref_id\":\"b38\"},\"end\":19208,\"start\":19204},{\"attributes\":{\"ref_id\":\"b39\"},\"end\":20987,\"start\":20983},{\"attributes\":{\"ref_id\":\"b40\"},\"end\":23821,\"start\":23817},{\"attributes\":{\"ref_id\":\"b41\"},\"end\":25981,\"start\":25977},{\"attributes\":{\"ref_id\":\"b42\"},\"end\":26932,\"start\":26928},{\"attributes\":{\"ref_id\":\"b7\"},\"end\":27050,\"start\":27047},{\"attributes\":{\"ref_id\":\"b11\"},\"end\":27091,\"start\":27087},{\"attributes\":{\"ref_id\":\"b43\"},\"end\":27134,\"start\":27130},{\"attributes\":{\"ref_id\":\"b44\"},\"end\":27191,\"start\":27187},{\"attributes\":{\"ref_id\":\"b44\"},\"end\":27296,\"start\":27292}]", "figure": "[{\"attributes\":{\"id\":\"fig_0\"},\"end\":31440,\"start\":31310},{\"attributes\":{\"id\":\"fig_1\"},\"end\":31680,\"start\":31441},{\"attributes\":{\"id\":\"fig_2\"},\"end\":31849,\"start\":31681},{\"attributes\":{\"id\":\"fig_4\"},\"end\":31961,\"start\":31850},{\"attributes\":{\"id\":\"fig_5\"},\"end\":32188,\"start\":31962},{\"attributes\":{\"id\":\"fig_6\"},\"end\":33199,\"start\":32189},{\"attributes\":{\"id\":\"fig_7\"},\"end\":33607,\"start\":33200},{\"attributes\":{\"id\":\"fig_8\"},\"end\":33771,\"start\":33608},{\"attributes\":{\"id\":\"fig_9\"},\"end\":33929,\"start\":33772},{\"attributes\":{\"id\":\"fig_10\"},\"end\":34166,\"start\":33930},{\"attributes\":{\"id\":\"fig_11\"},\"end\":34290,\"start\":34167},{\"attributes\":{\"id\":\"fig_12\"},\"end\":34420,\"start\":34291},{\"attributes\":{\"id\":\"fig_13\"},\"end\":34568,\"start\":34421},{\"attributes\":{\"id\":\"fig_14\"},\"end\":34663,\"start\":34569},{\"attributes\":{\"id\":\"fig_15\"},\"end\":34883,\"start\":34664},{\"attributes\":{\"id\":\"fig_16\"},\"end\":34973,\"start\":34884},{\"attributes\":{\"id\":\"fig_17\"},\"end\":35058,\"start\":34974},{\"attributes\":{\"id\":\"fig_18\"},\"end\":35224,\"start\":35059},{\"attributes\":{\"id\":\"fig_19\"},\"end\":35393,\"start\":35225},{\"attributes\":{\"id\":\"fig_20\"},\"end\":35448,\"start\":35394},{\"attributes\":{\"id\":\"fig_21\"},\"end\":40378,\"start\":35449},{\"attributes\":{\"id\":\"tab_0\",\"type\":\"table\"},\"end\":40924,\"start\":40379},{\"attributes\":{\"id\":\"tab_1\",\"type\":\"table\"},\"end\":40986,\"start\":40925},{\"attributes\":{\"id\":\"tab_2\",\"type\":\"table\"},\"end\":41175,\"start\":40987},{\"attributes\":{\"id\":\"tab_3\",\"type\":\"table\"},\"end\":41454,\"start\":41176},{\"attributes\":{\"id\":\"tab_4\",\"type\":\"table\"},\"end\":41756,\"start\":41455},{\"attributes\":{\"id\":\"tab_5\",\"type\":\"table\"},\"end\":42053,\"start\":41757},{\"attributes\":{\"id\":\"tab_6\",\"type\":\"table\"},\"end\":42382,\"start\":42054},{\"attributes\":{\"id\":\"tab_7\",\"type\":\"table\"},\"end\":42755,\"start\":42383}]", "paragraph": "[{\"end\":1656,\"start\":1498},{\"end\":2467,\"start\":1658},{\"end\":3433,\"start\":2469},{\"end\":4133,\"start\":3435},{\"end\":5087,\"start\":4135},{\"end\":5910,\"start\":5089},{\"end\":7183,\"start\":5937},{\"end\":7413,\"start\":7185},{\"end\":7906,\"start\":7437},{\"end\":7983,\"start\":7908},{\"end\":8513,\"start\":8037},{\"end\":9092,\"start\":8540},{\"end\":10239,\"start\":9122},{\"end\":11194,\"start\":10302},{\"end\":11289,\"start\":11196},{\"end\":11349,\"start\":11299},{\"end\":12106,\"start\":11351},{\"end\":12157,\"start\":12108},{\"end\":12523,\"start\":12185},{\"end\":13533,\"start\":12575},{\"end\":14342,\"start\":13535},{\"end\":14476,\"start\":14344},{\"end\":14646,\"start\":14478},{\"end\":14904,\"start\":14678},{\"end\":15179,\"start\":14942},{\"end\":15549,\"start\":15217},{\"end\":16076,\"start\":15590},{\"end\":16581,\"start\":16110},{\"end\":17301,\"start\":16583},{\"end\":17482,\"start\":17320},{\"end\":18994,\"start\":17506},{\"end\":19573,\"start\":19024},{\"end\":20092,\"start\":19625},{\"end\":21754,\"start\":20094},{\"end\":23713,\"start\":21802},{\"end\":24358,\"start\":23715},{\"end\":25702,\"start\":24401},{\"end\":26697,\"start\":25746},{\"end\":27500,\"start\":26736},{\"end\":28322,\"start\":27502},{\"end\":28688,\"start\":28375},{\"end\":29373,\"start\":28731},{\"end\":29753,\"start\":29528},{\"end\":30416,\"start\":30048},{\"end\":30913,\"start\":30494},{\"end\":31309,\"start\":31064}]", "formula": "[{\"attributes\":{\"id\":\"formula_0\"},\"end\":7436,\"start\":7414},{\"attributes\":{\"id\":\"formula_1\"},\"end\":8036,\"start\":7984},{\"attributes\":{\"id\":\"formula_2\"},\"end\":11298,\"start\":11290},{\"attributes\":{\"id\":\"formula_4\"},\"end\":12184,\"start\":12158},{\"attributes\":{\"id\":\"formula_5\"},\"end\":14677,\"start\":14647},{\"attributes\":{\"id\":\"formula_6\"},\"end\":14941,\"start\":14905},{\"attributes\":{\"id\":\"formula_7\"},\"end\":15216,\"start\":15180},{\"attributes\":{\"id\":\"formula_8\"},\"end\":15589,\"start\":15550},{\"attributes\":{\"id\":\"formula_9\"},\"end\":16109,\"start\":16077},{\"attributes\":{\"id\":\"formula_10\"},\"end\":29527,\"start\":29374},{\"attributes\":{\"id\":\"formula_11\"},\"end\":29993,\"start\":29754},{\"attributes\":{\"id\":\"formula_12\"},\"end\":30493,\"start\":30417},{\"attributes\":{\"id\":\"formula_13\"},\"end\":31063,\"start\":30914}]", "table_ref": "[{\"attributes\":{\"ref_id\":\"tab_1\"},\"end\":18081,\"start\":18074},{\"attributes\":{\"ref_id\":\"tab_1\"},\"end\":19254,\"start\":19246},{\"end\":21323,\"start\":21317},{\"attributes\":{\"ref_id\":\"tab_1\"},\"end\":24599,\"start\":24591},{\"attributes\":{\"ref_id\":\"tab_5\"},\"end\":25396,\"start\":25389},{\"attributes\":{\"ref_id\":\"tab_1\"},\"end\":26121,\"start\":26113},{\"attributes\":{\"ref_id\":\"tab_1\"},\"end\":26571,\"start\":26562}]", "section_header": "[{\"end\":5935,\"start\":5913},{\"end\":8538,\"start\":8516},{\"end\":9120,\"start\":9095},{\"end\":10300,\"start\":10242},{\"end\":12573,\"start\":12526},{\"end\":17318,\"start\":17304},{\"end\":17504,\"start\":17485},{\"end\":19022,\"start\":18997},{\"end\":19623,\"start\":19576},{\"end\":21800,\"start\":21757},{\"end\":24399,\"start\":24361},{\"end\":25744,\"start\":25705},{\"end\":26734,\"start\":26700},{\"end\":28373,\"start\":28325},{\"end\":28729,\"start\":28691},{\"end\":30046,\"start\":29995},{\"end\":31319,\"start\":31311},{\"end\":31690,\"start\":31682},{\"end\":31971,\"start\":31963},{\"end\":32198,\"start\":32190},{\"end\":33209,\"start\":33201},{\"end\":33617,\"start\":33609},{\"end\":33780,\"start\":33773},{\"end\":33947,\"start\":33931},{\"end\":34177,\"start\":34168},{\"end\":34301,\"start\":34292},{\"end\":34431,\"start\":34422},{\"end\":34579,\"start\":34570},{\"end\":34674,\"start\":34665},{\"end\":34894,\"start\":34885},{\"end\":34984,\"start\":34975},{\"end\":35069,\"start\":35060},{\"end\":35235,\"start\":35226},{\"end\":35406,\"start\":35395},{\"end\":35455,\"start\":35450},{\"end\":40935,\"start\":40926},{\"end\":40998,\"start\":40988},{\"end\":41188,\"start\":41177},{\"end\":41466,\"start\":41456},{\"end\":41767,\"start\":41758},{\"end\":42065,\"start\":42055},{\"end\":42395,\"start\":42384}]", "table": "[{\"end\":40924,\"start\":40879},{\"end\":41175,\"start\":41035},{\"end\":41454,\"start\":41237},{\"end\":41756,\"start\":41558},{\"end\":42053,\"start\":41769},{\"end\":42382,\"start\":42102},{\"end\":42755,\"start\":42444}]", "figure_caption": "[{\"end\":31440,\"start\":31321},{\"end\":31680,\"start\":31443},{\"end\":31849,\"start\":31692},{\"end\":31961,\"start\":31852},{\"end\":32188,\"start\":31973},{\"end\":33199,\"start\":32200},{\"end\":33607,\"start\":33211},{\"end\":33771,\"start\":33619},{\"end\":33929,\"start\":33783},{\"end\":34166,\"start\":33950},{\"end\":34290,\"start\":34180},{\"end\":34420,\"start\":34304},{\"end\":34568,\"start\":34434},{\"end\":34663,\"start\":34582},{\"end\":34883,\"start\":34677},{\"end\":34973,\"start\":34897},{\"end\":35058,\"start\":34987},{\"end\":35224,\"start\":35072},{\"end\":35393,\"start\":35238},{\"end\":35448,\"start\":35408},{\"end\":40378,\"start\":35456},{\"end\":40879,\"start\":40381},{\"end\":40986,\"start\":40937},{\"end\":41035,\"start\":41001},{\"end\":41237,\"start\":41192},{\"end\":41558,\"start\":41469},{\"end\":42102,\"start\":42068},{\"end\":42444,\"start\":42399}]", "figure_ref": "[{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":4566,\"start\":4558},{\"end\":7761,\"start\":7755},{\"end\":7966,\"start\":7960},{\"end\":8365,\"start\":8359},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":8378,\"start\":8370},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":8644,\"start\":8638},{\"attributes\":{\"ref_id\":\"fig_2\"},\"end\":17675,\"start\":17669},{\"attributes\":{\"ref_id\":\"fig_2\"},\"end\":18397,\"start\":18389},{\"attributes\":{\"ref_id\":\"fig_7\"},\"end\":19906,\"start\":19900},{\"attributes\":{\"ref_id\":\"fig_8\"},\"end\":19961,\"start\":19955},{\"end\":20295,\"start\":20289},{\"attributes\":{\"ref_id\":\"fig_8\"},\"end\":20465,\"start\":20459},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":20627,\"start\":20620},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":20864,\"start\":20857},{\"end\":22341,\"start\":22334},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":22378,\"start\":22369},{\"end\":22611,\"start\":22605},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":22675,\"start\":22668},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":23313,\"start\":23306},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":23322,\"start\":23315},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":23374,\"start\":23363},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":23412,\"start\":23401},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":23452,\"start\":23445},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":23923,\"start\":23916},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":25883,\"start\":25874},{\"end\":28753,\"start\":28747},{\"end\":30188,\"start\":30181}]", "bib_author_first_name": "[{\"end\":42821,\"start\":42820},{\"end\":42831,\"start\":42830},{\"end\":42833,\"start\":42832},{\"end\":42841,\"start\":42840},{\"end\":42856,\"start\":42855},{\"end\":43171,\"start\":43170},{\"end\":43182,\"start\":43181},{\"end\":43184,\"start\":43183},{\"end\":43194,\"start\":43193},{\"end\":43196,\"start\":43195},{\"end\":43492,\"start\":43491},{\"end\":43498,\"start\":43497},{\"end\":43506,\"start\":43505},{\"end\":43513,\"start\":43512},{\"end\":43826,\"start\":43825},{\"end\":43832,\"start\":43831},{\"end\":43839,\"start\":43838},{\"end\":43849,\"start\":43848},{\"end\":43858,\"start\":43854},{\"end\":44204,\"start\":44203},{\"end\":44206,\"start\":44205},{\"end\":44216,\"start\":44215},{\"end\":44218,\"start\":44217},{\"end\":44229,\"start\":44228},{\"end\":44231,\"start\":44230},{\"end\":44238,\"start\":44237},{\"end\":44240,\"start\":44239},{\"end\":44251,\"start\":44250},{\"end\":44253,\"start\":44252},{\"end\":44263,\"start\":44262},{\"end\":44265,\"start\":44264},{\"end\":44638,\"start\":44637},{\"end\":44647,\"start\":44646},{\"end\":44661,\"start\":44660},{\"end\":44981,\"start\":44980},{\"end\":44996,\"start\":44995},{\"end\":45000,\"start\":44997},{\"end\":45011,\"start\":45010},{\"end\":45027,\"start\":45026},{\"end\":45029,\"start\":45028},{\"end\":45041,\"start\":45040},{\"end\":45380,\"start\":45379},{\"end\":45382,\"start\":45381},{\"end\":45392,\"start\":45391},{\"end\":45403,\"start\":45402},{\"end\":45414,\"start\":45413},{\"end\":45707,\"start\":45706},{\"end\":45709,\"start\":45708},{\"end\":45722,\"start\":45719},{\"end\":45999,\"start\":45993},{\"end\":46320,\"start\":46319},{\"end\":46333,\"start\":46332},{\"end\":46343,\"start\":46342},{\"end\":46735,\"start\":46734},{\"end\":46742,\"start\":46741},{\"end\":46754,\"start\":46753},{\"end\":46760,\"start\":46759},{\"end\":47110,\"start\":47109},{\"end\":47116,\"start\":47115},{\"end\":47123,\"start\":47122},{\"end\":47131,\"start\":47130},{\"end\":47138,\"start\":47137},{\"end\":47144,\"start\":47143},{\"end\":47150,\"start\":47149},{\"end\":47485,\"start\":47484},{\"end\":47491,\"start\":47490},{\"end\":47501,\"start\":47500},{\"end\":47508,\"start\":47507},{\"end\":47518,\"start\":47513},{\"end\":47527,\"start\":47523},{\"end\":47894,\"start\":47893},{\"end\":47900,\"start\":47899},{\"end\":47906,\"start\":47905},{\"end\":47915,\"start\":47914},{\"end\":47922,\"start\":47921},{\"end\":47928,\"start\":47927},{\"end\":47936,\"start\":47935},{\"end\":47938,\"start\":47937},{\"end\":48383,\"start\":48382},{\"end\":48391,\"start\":48390},{\"end\":48746,\"start\":48745},{\"end\":48752,\"start\":48751},{\"end\":48759,\"start\":48758},{\"end\":48767,\"start\":48766},{\"end\":48773,\"start\":48772},{\"end\":48779,\"start\":48778},{\"end\":48787,\"start\":48786},{\"end\":49300,\"start\":49299},{\"end\":49306,\"start\":49305},{\"end\":49313,\"start\":49312},{\"end\":49321,\"start\":49320},{\"end\":49328,\"start\":49327},{\"end\":49334,\"start\":49333},{\"end\":49341,\"start\":49340},{\"end\":49347,\"start\":49346},{\"end\":49814,\"start\":49813},{\"end\":49823,\"start\":49822},{\"end\":49832,\"start\":49831},{\"end\":49834,\"start\":49833},{\"end\":49840,\"start\":49837},{\"end\":49848,\"start\":49847},{\"end\":49850,\"start\":49849},{\"end\":50213,\"start\":50212},{\"end\":50215,\"start\":50214},{\"end\":50225,\"start\":50224},{\"end\":50237,\"start\":50236},{\"end\":50239,\"start\":50238},{\"end\":50250,\"start\":50249},{\"end\":50252,\"start\":50251},{\"end\":50261,\"start\":50260},{\"end\":50263,\"start\":50262},{\"end\":50276,\"start\":50275},{\"end\":50278,\"start\":50277},{\"end\":50288,\"start\":50287},{\"end\":50290,\"start\":50289},{\"end\":50682,\"start\":50678},{\"end\":50694,\"start\":50690},{\"end\":51018,\"start\":51017},{\"end\":51026,\"start\":51025},{\"end\":51028,\"start\":51027},{\"end\":51038,\"start\":51037},{\"end\":51046,\"start\":51045},{\"end\":51055,\"start\":51054},{\"end\":51066,\"start\":51065},{\"end\":51073,\"start\":51072},{\"end\":51085,\"start\":51081},{\"end\":51095,\"start\":51094},{\"end\":51097,\"start\":51096},{\"end\":51110,\"start\":51109},{\"end\":51587,\"start\":51586},{\"end\":51596,\"start\":51595},{\"end\":51598,\"start\":51597},{\"end\":51609,\"start\":51608},{\"end\":52021,\"start\":52020},{\"end\":52029,\"start\":52028},{\"end\":52037,\"start\":52036},{\"end\":52046,\"start\":52045},{\"end\":52053,\"start\":52052},{\"end\":52060,\"start\":52059},{\"end\":52503,\"start\":52502},{\"end\":52516,\"start\":52515},{\"end\":52828,\"start\":52827},{\"end\":52841,\"start\":52840},{\"end\":52843,\"start\":52842},{\"end\":52853,\"start\":52852},{\"end\":52863,\"start\":52862},{\"end\":53268,\"start\":53267},{\"end\":53270,\"start\":53269},{\"end\":53279,\"start\":53278},{\"end\":53291,\"start\":53290},{\"end\":53685,\"start\":53684},{\"end\":53691,\"start\":53690},{\"end\":53693,\"start\":53692},{\"end\":53703,\"start\":53702},{\"end\":54075,\"start\":54074},{\"end\":54083,\"start\":54082},{\"end\":54092,\"start\":54088},{\"end\":54094,\"start\":54093},{\"end\":54433,\"start\":54432},{\"end\":54435,\"start\":54434},{\"end\":54443,\"start\":54442},{\"end\":54457,\"start\":54456},{\"end\":54459,\"start\":54458},{\"end\":54469,\"start\":54468},{\"end\":54471,\"start\":54470},{\"end\":54482,\"start\":54481},{\"end\":54498,\"start\":54497},{\"end\":54896,\"start\":54895},{\"end\":54911,\"start\":54910},{\"end\":54922,\"start\":54921},{\"end\":54924,\"start\":54923},{\"end\":54934,\"start\":54933},{\"end\":55259,\"start\":55258},{\"end\":55269,\"start\":55268},{\"end\":55277,\"start\":55276},{\"end\":55626,\"start\":55625},{\"end\":55634,\"start\":55633},{\"end\":55644,\"start\":55643},{\"end\":55996,\"start\":55995},{\"end\":56003,\"start\":56002},{\"end\":56011,\"start\":56010},{\"end\":56020,\"start\":56019},{\"end\":56028,\"start\":56027},{\"end\":56573,\"start\":56572},{\"end\":56582,\"start\":56581},{\"end\":56597,\"start\":56596},{\"end\":56607,\"start\":56606},{\"end\":56616,\"start\":56615},{\"end\":56627,\"start\":56626},{\"end\":56640,\"start\":56639},{\"end\":57013,\"start\":57012},{\"end\":57020,\"start\":57019},{\"end\":57249,\"start\":57248},{\"end\":57255,\"start\":57252},{\"end\":57451,\"start\":57450},{\"end\":57453,\"start\":57452},{\"end\":57659,\"start\":57658},{\"end\":57671,\"start\":57670},{\"end\":57681,\"start\":57680},{\"end\":57690,\"start\":57689},{\"end\":57692,\"start\":57691},{\"end\":57703,\"start\":57702},{\"end\":58002,\"start\":58001},{\"end\":58008,\"start\":58007},{\"end\":58278,\"start\":58277},{\"end\":58288,\"start\":58287},{\"end\":58290,\"start\":58289},{\"end\":58304,\"start\":58303},{\"end\":58306,\"start\":58305},{\"end\":58689,\"start\":58688},{\"end\":58698,\"start\":58697},{\"end\":59119,\"start\":59118},{\"end\":59128,\"start\":59127},{\"end\":59639,\"start\":59638}]", "bib_author_last_name": "[{\"end\":42828,\"start\":42822},{\"end\":42838,\"start\":42834},{\"end\":42853,\"start\":42842},{\"end\":42864,\"start\":42857},{\"end\":43179,\"start\":43172},{\"end\":43191,\"start\":43185},{\"end\":43202,\"start\":43197},{\"end\":43495,\"start\":43493},{\"end\":43503,\"start\":43499},{\"end\":43510,\"start\":43507},{\"end\":43518,\"start\":43514},{\"end\":43829,\"start\":43827},{\"end\":43836,\"start\":43833},{\"end\":43846,\"start\":43840},{\"end\":43852,\"start\":43850},{\"end\":43863,\"start\":43859},{\"end\":44213,\"start\":44207},{\"end\":44226,\"start\":44219},{\"end\":44235,\"start\":44232},{\"end\":44248,\"start\":44241},{\"end\":44260,\"start\":44254},{\"end\":44274,\"start\":44266},{\"end\":44644,\"start\":44639},{\"end\":44658,\"start\":44648},{\"end\":44671,\"start\":44662},{\"end\":44993,\"start\":44982},{\"end\":45008,\"start\":45001},{\"end\":45024,\"start\":45012},{\"end\":45038,\"start\":45030},{\"end\":45048,\"start\":45042},{\"end\":45389,\"start\":45383},{\"end\":45400,\"start\":45393},{\"end\":45411,\"start\":45404},{\"end\":45417,\"start\":45415},{\"end\":45717,\"start\":45710},{\"end\":45981,\"start\":45974},{\"end\":45991,\"start\":45983},{\"end\":46002,\"start\":46000},{\"end\":46330,\"start\":46321},{\"end\":46340,\"start\":46334},{\"end\":46348,\"start\":46344},{\"end\":46739,\"start\":46736},{\"end\":46751,\"start\":46743},{\"end\":46757,\"start\":46755},{\"end\":46768,\"start\":46761},{\"end\":47113,\"start\":47111},{\"end\":47120,\"start\":47117},{\"end\":47128,\"start\":47124},{\"end\":47135,\"start\":47132},{\"end\":47141,\"start\":47139},{\"end\":47147,\"start\":47145},{\"end\":47155,\"start\":47151},{\"end\":47488,\"start\":47486},{\"end\":47498,\"start\":47492},{\"end\":47505,\"start\":47502},{\"end\":47511,\"start\":47509},{\"end\":47521,\"start\":47519},{\"end\":47532,\"start\":47528},{\"end\":47897,\"start\":47895},{\"end\":47903,\"start\":47901},{\"end\":47912,\"start\":47907},{\"end\":47919,\"start\":47916},{\"end\":47925,\"start\":47923},{\"end\":47933,\"start\":47929},{\"end\":47947,\"start\":47939},{\"end\":48388,\"start\":48384},{\"end\":48395,\"start\":48392},{\"end\":48749,\"start\":48747},{\"end\":48756,\"start\":48753},{\"end\":48764,\"start\":48760},{\"end\":48770,\"start\":48768},{\"end\":48776,\"start\":48774},{\"end\":48784,\"start\":48780},{\"end\":48792,\"start\":48788},{\"end\":49303,\"start\":49301},{\"end\":49310,\"start\":49307},{\"end\":49318,\"start\":49314},{\"end\":49325,\"start\":49322},{\"end\":49331,\"start\":49329},{\"end\":49338,\"start\":49335},{\"end\":49344,\"start\":49342},{\"end\":49352,\"start\":49348},{\"end\":49820,\"start\":49815},{\"end\":49829,\"start\":49824},{\"end\":49845,\"start\":49841},{\"end\":49860,\"start\":49851},{\"end\":50222,\"start\":50216},{\"end\":50234,\"start\":50226},{\"end\":50247,\"start\":50240},{\"end\":50258,\"start\":50253},{\"end\":50273,\"start\":50264},{\"end\":50285,\"start\":50279},{\"end\":50296,\"start\":50291},{\"end\":50688,\"start\":50683},{\"end\":50700,\"start\":50695},{\"end\":51023,\"start\":51019},{\"end\":51035,\"start\":51029},{\"end\":51043,\"start\":51039},{\"end\":51052,\"start\":51047},{\"end\":51063,\"start\":51056},{\"end\":51070,\"start\":51067},{\"end\":51079,\"start\":51074},{\"end\":51092,\"start\":51086},{\"end\":51107,\"start\":51098},{\"end\":51121,\"start\":51111},{\"end\":51593,\"start\":51588},{\"end\":51606,\"start\":51599},{\"end\":51616,\"start\":51610},{\"end\":52026,\"start\":52022},{\"end\":52034,\"start\":52030},{\"end\":52043,\"start\":52038},{\"end\":52050,\"start\":52047},{\"end\":52057,\"start\":52054},{\"end\":52064,\"start\":52061},{\"end\":52513,\"start\":52504},{\"end\":52523,\"start\":52517},{\"end\":52838,\"start\":52829},{\"end\":52850,\"start\":52844},{\"end\":52860,\"start\":52854},{\"end\":52873,\"start\":52864},{\"end\":53276,\"start\":53271},{\"end\":53288,\"start\":53280},{\"end\":53301,\"start\":53292},{\"end\":53688,\"start\":53686},{\"end\":53700,\"start\":53694},{\"end\":53707,\"start\":53704},{\"end\":54080,\"start\":54076},{\"end\":54086,\"start\":54084},{\"end\":54100,\"start\":54095},{\"end\":54440,\"start\":54436},{\"end\":54454,\"start\":54444},{\"end\":54466,\"start\":54460},{\"end\":54479,\"start\":54472},{\"end\":54495,\"start\":54483},{\"end\":54503,\"start\":54499},{\"end\":54908,\"start\":54897},{\"end\":54919,\"start\":54912},{\"end\":54931,\"start\":54925},{\"end\":54941,\"start\":54935},{\"end\":55266,\"start\":55260},{\"end\":55274,\"start\":55270},{\"end\":55283,\"start\":55278},{\"end\":55631,\"start\":55627},{\"end\":55641,\"start\":55635},{\"end\":55650,\"start\":55645},{\"end\":56000,\"start\":55997},{\"end\":56008,\"start\":56004},{\"end\":56017,\"start\":56012},{\"end\":56025,\"start\":56021},{\"end\":56034,\"start\":56029},{\"end\":56579,\"start\":56574},{\"end\":56594,\"start\":56583},{\"end\":56604,\"start\":56598},{\"end\":56613,\"start\":56608},{\"end\":56624,\"start\":56617},{\"end\":56637,\"start\":56628},{\"end\":56648,\"start\":56641},{\"end\":57017,\"start\":57014},{\"end\":57026,\"start\":57021},{\"end\":57263,\"start\":57256},{\"end\":57459,\"start\":57454},{\"end\":57668,\"start\":57660},{\"end\":57678,\"start\":57672},{\"end\":57687,\"start\":57682},{\"end\":57700,\"start\":57693},{\"end\":57706,\"start\":57704},{\"end\":58005,\"start\":58003},{\"end\":58015,\"start\":58009},{\"end\":58285,\"start\":58279},{\"end\":58301,\"start\":58291},{\"end\":58313,\"start\":58307},{\"end\":58695,\"start\":58690},{\"end\":58704,\"start\":58699},{\"end\":59125,\"start\":59120},{\"end\":59142,\"start\":59129},{\"end\":59651,\"start\":59640}]", "bib_entry": "[{\"attributes\":{\"id\":\"b0\",\"matched_paper_id\":3388305},\"end\":43089,\"start\":42757},{\"attributes\":{\"id\":\"b1\",\"matched_paper_id\":203709327},\"end\":43423,\"start\":43091},{\"attributes\":{\"id\":\"b2\",\"matched_paper_id\":216276710},\"end\":43744,\"start\":43425},{\"attributes\":{\"id\":\"b3\",\"matched_paper_id\":86650353},\"end\":44100,\"start\":43746},{\"attributes\":{\"id\":\"b4\",\"matched_paper_id\":219055973},\"end\":44573,\"start\":44102},{\"attributes\":{\"id\":\"b5\",\"matched_paper_id\":17109132},\"end\":44890,\"start\":44575},{\"attributes\":{\"id\":\"b6\",\"matched_paper_id\":5031308},\"end\":45325,\"start\":44892},{\"attributes\":{\"id\":\"b7\",\"matched_paper_id\":210993807},\"end\":45665,\"start\":45327},{\"attributes\":{\"id\":\"b8\"},\"end\":45932,\"start\":45667},{\"attributes\":{\"id\":\"b9\"},\"end\":46173,\"start\":45934},{\"attributes\":{\"id\":\"b10\",\"matched_paper_id\":30034076},\"end\":46637,\"start\":46175},{\"attributes\":{\"id\":\"b11\",\"matched_paper_id\":115821768},\"end\":47022,\"start\":46639},{\"attributes\":{\"id\":\"b12\",\"matched_paper_id\":209898928},\"end\":47406,\"start\":47024},{\"attributes\":{\"id\":\"b13\",\"matched_paper_id\":86415552},\"end\":47774,\"start\":47408},{\"attributes\":{\"id\":\"b14\",\"matched_paper_id\":221224588},\"end\":48255,\"start\":47776},{\"attributes\":{\"id\":\"b15\",\"matched_paper_id\":225359783},\"end\":48619,\"start\":48257},{\"attributes\":{\"id\":\"b16\",\"matched_paper_id\":234537584},\"end\":49151,\"start\":48621},{\"attributes\":{\"id\":\"b17\",\"matched_paper_id\":203584884},\"end\":49730,\"start\":49153},{\"attributes\":{\"id\":\"b18\",\"matched_paper_id\":234007243},\"end\":50112,\"start\":49732},{\"attributes\":{\"id\":\"b19\",\"matched_paper_id\":22718221},\"end\":50605,\"start\":50114},{\"attributes\":{\"id\":\"b20\",\"matched_paper_id\":49417827},\"end\":50905,\"start\":50607},{\"attributes\":{\"id\":\"b21\",\"matched_paper_id\":32014587},\"end\":51495,\"start\":50907},{\"attributes\":{\"id\":\"b22\",\"matched_paper_id\":17307295},\"end\":51876,\"start\":51497},{\"attributes\":{\"id\":\"b23\",\"matched_paper_id\":199435818},\"end\":52425,\"start\":51878},{\"attributes\":{\"id\":\"b24\",\"matched_paper_id\":116302471},\"end\":52729,\"start\":52427},{\"attributes\":{\"id\":\"b25\",\"matched_paper_id\":75137525},\"end\":53185,\"start\":52731},{\"attributes\":{\"id\":\"b26\",\"matched_paper_id\":213695357},\"end\":53570,\"start\":53187},{\"attributes\":{\"id\":\"b27\",\"matched_paper_id\":30397074},\"end\":53961,\"start\":53572},{\"attributes\":{\"id\":\"b28\",\"matched_paper_id\":216496153},\"end\":54355,\"start\":53963},{\"attributes\":{\"id\":\"b29\",\"matched_paper_id\":225465064},\"end\":54807,\"start\":54357},{\"attributes\":{\"id\":\"b30\",\"matched_paper_id\":235527178},\"end\":55145,\"start\":54809},{\"attributes\":{\"id\":\"b31\",\"matched_paper_id\":115846278},\"end\":55538,\"start\":55147},{\"attributes\":{\"id\":\"b32\",\"matched_paper_id\":115595056},\"end\":55878,\"start\":55540},{\"attributes\":{\"id\":\"b33\",\"matched_paper_id\":245146183},\"end\":56480,\"start\":55880},{\"attributes\":{\"id\":\"b34\",\"matched_paper_id\":209080873},\"end\":56970,\"start\":56482},{\"attributes\":{\"id\":\"b35\",\"matched_paper_id\":14848918},\"end\":57211,\"start\":56972},{\"attributes\":{\"id\":\"b36\",\"matched_paper_id\":3264198},\"end\":57407,\"start\":57213},{\"attributes\":{\"id\":\"b37\",\"matched_paper_id\":119785692},\"end\":57584,\"start\":57409},{\"attributes\":{\"id\":\"b38\"},\"end\":57966,\"start\":57586},{\"attributes\":{\"id\":\"b39\",\"matched_paper_id\":191396},\"end\":58188,\"start\":57968},{\"attributes\":{\"id\":\"b40\",\"matched_paper_id\":219048839},\"end\":58562,\"start\":58190},{\"attributes\":{\"id\":\"b41\",\"matched_paper_id\":24373223},\"end\":59002,\"start\":58564},{\"attributes\":{\"id\":\"b42\",\"matched_paper_id\":235235241},\"end\":59397,\"start\":59004},{\"attributes\":{\"id\":\"b43\"},\"end\":59596,\"start\":59399},{\"attributes\":{\"id\":\"b44\"},\"end\":59773,\"start\":59598},{\"attributes\":{\"id\":\"b45\"},\"end\":60638,\"start\":59775}]", "bib_title": "[{\"end\":42818,\"start\":42757},{\"end\":43168,\"start\":43091},{\"end\":43489,\"start\":43425},{\"end\":43823,\"start\":43746},{\"end\":44201,\"start\":44102},{\"end\":44635,\"start\":44575},{\"end\":44978,\"start\":44892},{\"end\":45377,\"start\":45327},{\"end\":46317,\"start\":46175},{\"end\":46732,\"start\":46639},{\"end\":47107,\"start\":47024},{\"end\":47482,\"start\":47408},{\"end\":47891,\"start\":47776},{\"end\":48380,\"start\":48257},{\"end\":48743,\"start\":48621},{\"end\":49297,\"start\":49153},{\"end\":49811,\"start\":49732},{\"end\":50210,\"start\":50114},{\"end\":50676,\"start\":50607},{\"end\":51015,\"start\":50907},{\"end\":51584,\"start\":51497},{\"end\":52018,\"start\":51878},{\"end\":52500,\"start\":52427},{\"end\":52825,\"start\":52731},{\"end\":53265,\"start\":53187},{\"end\":53682,\"start\":53572},{\"end\":54072,\"start\":53963},{\"end\":54430,\"start\":54357},{\"end\":54893,\"start\":54809},{\"end\":55256,\"start\":55147},{\"end\":55623,\"start\":55540},{\"end\":55993,\"start\":55880},{\"end\":56570,\"start\":56482},{\"end\":57010,\"start\":56972},{\"end\":57246,\"start\":57213},{\"end\":57448,\"start\":57409},{\"end\":57656,\"start\":57586},{\"end\":57999,\"start\":57968},{\"end\":58275,\"start\":58190},{\"end\":58686,\"start\":58564},{\"end\":59116,\"start\":59004},{\"end\":59843,\"start\":59775}]", "bib_author": "[{\"end\":42830,\"start\":42820},{\"end\":42840,\"start\":42830},{\"end\":42855,\"start\":42840},{\"end\":42866,\"start\":42855},{\"end\":43181,\"start\":43170},{\"end\":43193,\"start\":43181},{\"end\":43204,\"start\":43193},{\"end\":43497,\"start\":43491},{\"end\":43505,\"start\":43497},{\"end\":43512,\"start\":43505},{\"end\":43520,\"start\":43512},{\"end\":43831,\"start\":43825},{\"end\":43838,\"start\":43831},{\"end\":43848,\"start\":43838},{\"end\":43854,\"start\":43848},{\"end\":43865,\"start\":43854},{\"end\":44215,\"start\":44203},{\"end\":44228,\"start\":44215},{\"end\":44237,\"start\":44228},{\"end\":44250,\"start\":44237},{\"end\":44262,\"start\":44250},{\"end\":44276,\"start\":44262},{\"end\":44646,\"start\":44637},{\"end\":44660,\"start\":44646},{\"end\":44673,\"start\":44660},{\"end\":44995,\"start\":44980},{\"end\":45010,\"start\":44995},{\"end\":45026,\"start\":45010},{\"end\":45040,\"start\":45026},{\"end\":45050,\"start\":45040},{\"end\":45391,\"start\":45379},{\"end\":45402,\"start\":45391},{\"end\":45413,\"start\":45402},{\"end\":45419,\"start\":45413},{\"end\":45719,\"start\":45706},{\"end\":45725,\"start\":45719},{\"end\":45983,\"start\":45974},{\"end\":45993,\"start\":45983},{\"end\":46004,\"start\":45993},{\"end\":46332,\"start\":46319},{\"end\":46342,\"start\":46332},{\"end\":46350,\"start\":46342},{\"end\":46741,\"start\":46734},{\"end\":46753,\"start\":46741},{\"end\":46759,\"start\":46753},{\"end\":46770,\"start\":46759},{\"end\":47115,\"start\":47109},{\"end\":47122,\"start\":47115},{\"end\":47130,\"start\":47122},{\"end\":47137,\"start\":47130},{\"end\":47143,\"start\":47137},{\"end\":47149,\"start\":47143},{\"end\":47157,\"start\":47149},{\"end\":47490,\"start\":47484},{\"end\":47500,\"start\":47490},{\"end\":47507,\"start\":47500},{\"end\":47513,\"start\":47507},{\"end\":47523,\"start\":47513},{\"end\":47534,\"start\":47523},{\"end\":47899,\"start\":47893},{\"end\":47905,\"start\":47899},{\"end\":47914,\"start\":47905},{\"end\":47921,\"start\":47914},{\"end\":47927,\"start\":47921},{\"end\":47935,\"start\":47927},{\"end\":47949,\"start\":47935},{\"end\":48390,\"start\":48382},{\"end\":48397,\"start\":48390},{\"end\":48751,\"start\":48745},{\"end\":48758,\"start\":48751},{\"end\":48766,\"start\":48758},{\"end\":48772,\"start\":48766},{\"end\":48778,\"start\":48772},{\"end\":48786,\"start\":48778},{\"end\":48794,\"start\":48786},{\"end\":49305,\"start\":49299},{\"end\":49312,\"start\":49305},{\"end\":49320,\"start\":49312},{\"end\":49327,\"start\":49320},{\"end\":49333,\"start\":49327},{\"end\":49340,\"start\":49333},{\"end\":49346,\"start\":49340},{\"end\":49354,\"start\":49346},{\"end\":49822,\"start\":49813},{\"end\":49831,\"start\":49822},{\"end\":49837,\"start\":49831},{\"end\":49847,\"start\":49837},{\"end\":49862,\"start\":49847},{\"end\":50224,\"start\":50212},{\"end\":50236,\"start\":50224},{\"end\":50249,\"start\":50236},{\"end\":50260,\"start\":50249},{\"end\":50275,\"start\":50260},{\"end\":50287,\"start\":50275},{\"end\":50298,\"start\":50287},{\"end\":50690,\"start\":50678},{\"end\":50702,\"start\":50690},{\"end\":51025,\"start\":51017},{\"end\":51037,\"start\":51025},{\"end\":51045,\"start\":51037},{\"end\":51054,\"start\":51045},{\"end\":51065,\"start\":51054},{\"end\":51072,\"start\":51065},{\"end\":51081,\"start\":51072},{\"end\":51094,\"start\":51081},{\"end\":51109,\"start\":51094},{\"end\":51123,\"start\":51109},{\"end\":51595,\"start\":51586},{\"end\":51608,\"start\":51595},{\"end\":51618,\"start\":51608},{\"end\":52028,\"start\":52020},{\"end\":52036,\"start\":52028},{\"end\":52045,\"start\":52036},{\"end\":52052,\"start\":52045},{\"end\":52059,\"start\":52052},{\"end\":52066,\"start\":52059},{\"end\":52515,\"start\":52502},{\"end\":52525,\"start\":52515},{\"end\":52840,\"start\":52827},{\"end\":52852,\"start\":52840},{\"end\":52862,\"start\":52852},{\"end\":52875,\"start\":52862},{\"end\":53278,\"start\":53267},{\"end\":53290,\"start\":53278},{\"end\":53303,\"start\":53290},{\"end\":53690,\"start\":53684},{\"end\":53702,\"start\":53690},{\"end\":53709,\"start\":53702},{\"end\":54082,\"start\":54074},{\"end\":54088,\"start\":54082},{\"end\":54102,\"start\":54088},{\"end\":54442,\"start\":54432},{\"end\":54456,\"start\":54442},{\"end\":54468,\"start\":54456},{\"end\":54481,\"start\":54468},{\"end\":54497,\"start\":54481},{\"end\":54505,\"start\":54497},{\"end\":54910,\"start\":54895},{\"end\":54921,\"start\":54910},{\"end\":54933,\"start\":54921},{\"end\":54943,\"start\":54933},{\"end\":55268,\"start\":55258},{\"end\":55276,\"start\":55268},{\"end\":55285,\"start\":55276},{\"end\":55633,\"start\":55625},{\"end\":55643,\"start\":55633},{\"end\":55652,\"start\":55643},{\"end\":56002,\"start\":55995},{\"end\":56010,\"start\":56002},{\"end\":56019,\"start\":56010},{\"end\":56027,\"start\":56019},{\"end\":56036,\"start\":56027},{\"end\":56581,\"start\":56572},{\"end\":56596,\"start\":56581},{\"end\":56606,\"start\":56596},{\"end\":56615,\"start\":56606},{\"end\":56626,\"start\":56615},{\"end\":56639,\"start\":56626},{\"end\":56650,\"start\":56639},{\"end\":57019,\"start\":57012},{\"end\":57028,\"start\":57019},{\"end\":57252,\"start\":57248},{\"end\":57265,\"start\":57252},{\"end\":57461,\"start\":57450},{\"end\":57670,\"start\":57658},{\"end\":57680,\"start\":57670},{\"end\":57689,\"start\":57680},{\"end\":57702,\"start\":57689},{\"end\":57708,\"start\":57702},{\"end\":58007,\"start\":58001},{\"end\":58017,\"start\":58007},{\"end\":58287,\"start\":58277},{\"end\":58303,\"start\":58287},{\"end\":58315,\"start\":58303},{\"end\":58697,\"start\":58688},{\"end\":58706,\"start\":58697},{\"end\":59127,\"start\":59118},{\"end\":59144,\"start\":59127},{\"end\":59653,\"start\":59638}]", "bib_venue": "[{\"end\":42897,\"start\":42866},{\"end\":43247,\"start\":43204},{\"end\":43558,\"start\":43520},{\"end\":43896,\"start\":43865},{\"end\":44307,\"start\":44276},{\"end\":44708,\"start\":44673},{\"end\":45081,\"start\":45050},{\"end\":45475,\"start\":45419},{\"end\":45704,\"start\":45667},{\"end\":45972,\"start\":45934},{\"end\":46381,\"start\":46350},{\"end\":46804,\"start\":46770},{\"end\":47188,\"start\":47157},{\"end\":47565,\"start\":47534},{\"end\":47987,\"start\":47949},{\"end\":48414,\"start\":48397},{\"end\":48859,\"start\":48794},{\"end\":49419,\"start\":49354},{\"end\":49900,\"start\":49862},{\"end\":50329,\"start\":50298},{\"end\":50736,\"start\":50702},{\"end\":51171,\"start\":51123},{\"end\":51660,\"start\":51618},{\"end\":52123,\"start\":52066},{\"end\":52556,\"start\":52525},{\"end\":52933,\"start\":52875},{\"end\":53368,\"start\":53303},{\"end\":53740,\"start\":53709},{\"end\":54133,\"start\":54102},{\"end\":54554,\"start\":54505},{\"end\":54951,\"start\":54943},{\"end\":55316,\"start\":55285},{\"end\":55683,\"start\":55652},{\"end\":56157,\"start\":56036},{\"end\":56698,\"start\":56650},{\"end\":57045,\"start\":57028},{\"end\":57289,\"start\":57265},{\"end\":57474,\"start\":57461},{\"end\":57751,\"start\":57708},{\"end\":58053,\"start\":58017},{\"end\":58349,\"start\":58315},{\"end\":58764,\"start\":58706},{\"end\":59175,\"start\":59144},{\"end\":59486,\"start\":59399},{\"end\":59636,\"start\":59598},{\"end\":59922,\"start\":59845},{\"end\":59971,\"start\":59924}]"}}}, "year": 2023, "month": 12, "day": 17}