{"id": 247058528, "updated": "2022-11-01 07:29:22.217", "metadata": {"title": "AI-empowered Joint Communication and Radar Systems with Adaptive Waveform for Autonomous Vehicles", "authors": "[{\"first\":\"Nam\",\"last\":\"Chu\",\"middle\":[\"H.\"]},{\"first\":\"Diep\",\"last\":\"Nguyen\",\"middle\":[\"N.\"]},{\"first\":\"Dinh\",\"last\":\"Hoang\",\"middle\":[\"Thai\"]},{\"first\":\"Quoc-Viet\",\"last\":\"Pham\",\"middle\":[]},{\"first\":\"Won-Joo\",\"last\":\"Hwang\",\"middle\":[]},{\"first\":\"Eryk\",\"last\":\"Dutkiewicz\",\"middle\":[]}]", "venue": "ArXiv", "journal": "ArXiv", "publication_date": {"year": 2022, "month": null, "day": null}, "abstract": "In Joint Communication and Radar (JCR)-based Autonomous Vehicle (AV) systems, optimizing waveform structure is one of the most challenging tasks due to strong influences between radar and data communication functions. Specifically, the preamble of a data communication frame is typically leveraged for the radar function. As such, the higher number of preambles in a Coherent Processing Interval (CPI) is, the greater radar’s performance is. In contrast, communication efficiency decreases as the number of preambles increases. Moreover, AVs’ surrounding radio environments are usually dynamic with high uncertainties due to their high mobility, making the JCR’s waveform optimization problem even more challenging. To that end, this paper develops a novel JCR framework based on the Markov decision process framework and recent advanced techniques in deep reinforcement learning. By doing so, without requiring complete knowledge of the surrounding environment in advance, the JCR-AV can adaptively optimize its waveform structure (i.e., number of frames in the CPI) to maximize radar and data communication performance under the surrounding environment’s dynamic and uncertainty. Extensive simulations show that our proposed approach can improve the joint communication and radar Nam H. Chu, Diep N. Nguyen, Dinh Thai Hoang, and Eryk Dutkiewicz are with the School of Electrical and Data Engineering, University of Technology Sydney, Australia (e-mails: namhoai.chu@student.uts.edu.au, diep.nguyen@uts.edu.au, hoang.dinh@uts.edu.au, and eryk.dutkiewicz@uts.edu.au). Quoc-Viet Pham is with the Korean Southeast Center for the 4th Industrial Revolution Leader Education, Pusan National University, Busan 46241, Korea (e-mail: vietpq@pusan.ac.kr). Won-Joo Hwang is with the Department of Biomedical Convergence Engineering, Pusan National University, Yangsan 50612, Korea (e-mail: wjhwang@pusan.ac.kr).", "fields_of_study": "[\"Computer Science\"]", "external_ids": {"arxiv": null, "mag": null, "acl": null, "pubmed": null, "pubmedcentral": null, "dblp": "journals/corr/abs-2202-11508", "doi": null}}, "content": {"source": {"pdf_hash": "a1c5e818842d06e3a8d3091ce53ede5b5e09791c", "pdf_src": "MergedPDFExtraction", "pdf_uri": "[\"https://arxiv.org/pdf/2202.11508v2.pdf\"]", "oa_url_match": false, "oa_info": null}, "grobid": {"id": "6511f9bc5b6a243d76d1e1667e796bf0e6ff198a", "type": "plain-text", "url": "s3://ai2-s2-pdf-extraction-prod/parse-results/s2orc_worker/a1c5e818842d06e3a8d3091ce53ede5b5e09791c.txt", "contents": "\nAI-empowered Joint Communication and Radar Systems with Adaptive Waveform for Autonomous Vehicles\n23 Feb 2022\n\nNam H Chu \nDinhDiep N Nguyen diep.nguyen@uts.edu.au \nThai Hoang \nQuoc-Viet Pham \nWon-Joo Hwang wjhwang@pusan.ac.kr \nEryk Dutkiewicz eryk.dutkiewicz@uts.edu.au. \nNam H Chu \nDinhDiep N Nguyen \nThai Hoang \nEryk Dutkiewicz \n\nSchool of Electrical and Data Engineering\nUniversity of Technology Sydney\nAustralia\n\n\nDepartment of Biomedical Convergence Engineering\nPusan National University\n46241BusanKorea\n\n\nPusan National University\n50612YangsanKorea\n\nAI-empowered Joint Communication and Radar Systems with Adaptive Waveform for Autonomous Vehicles\n23 Feb 20221 Quoc-Viet Pham is with the Korean Southeast Center for the 4th Industrial Revolution Leader Education, Won-Joo Hwang is with theIndex Terms Autonomous vehiclesjoint communication and radarMDPdeep reinforcement learningwaveform structure optimization\nIn Joint Communication and Radar (JCR)-based Autonomous Vehicle (AV) systems, optimizing waveform structure is one of the most challenging tasks due to strong influences between radar and data communication functions. Specifically, the preamble of a data communication frame is typically leveraged for the radar function. As such, the higher number of preambles in a Coherent Processing Interval (CPI) is, the greater radar's performance is. In contrast, communication efficiency decreases as the number of preambles increases. Moreover, AVs' surrounding radio environments are usually dynamic with high uncertainties due to their high mobility, making the JCR's waveform optimization problem even more challenging. To that end, this paper develops a novel JCR framework based on the Markov decision process framework and recent advanced techniques in deep reinforcement learning. By doing so, without requiring complete knowledge of the surrounding environment in advance, the JCR-AV can adaptively optimize its waveform structure (i.e., number of frames in the CPI) to maximize radar and data communication performance under the surrounding environment's dynamic and uncertainty.Extensive simulations show that our proposed approach can improve the joint communication and radar ). 2 performance up to 46.26% compared with those of conventional methods (e.g., greedy policy-and fixed waveform-based approaches).Index TermsAutonomous vehicles, joint communication and radar, MDP, deep reinforcement learning, waveform structure optimization.I. INTRODUCTIONIn Autonomous Vehicles (AVs), e.g., self-driving cars and Unmanned Aerial Vehicles (UAV), radar and data communications are two important functions. The radar enables AVs to detect objects around them and estimate their distance and velocity for safety management (e.g., collision avoidance). The data communication ability allows AVs to exchange information with other AVs or infrastructure. For example, they can send/receive safety messages and even their own raw sensory data (e.g., traffic data around the AV) for applications such as transportation safety, transportation monitoring, and user services distributed to the AVs [1]. Although automotive radar and vehicular communication share many commonalities, such as signal processing algorithms and the system architecture [2], they are typically designed and implemented separately. As such, radar and communication functions require separate hardware components operating at different frequency bands that become increasingly expensive and congested because of an ever-growing number of connected devices and services. Consequently, this makes the implementation of radar and communication functions in AVs more costly in hardware, complexity, and radio spectrum resources. These challenges can be handled by combining communication and radar functions into a single system, called Joint Communication-Radar (JCR), that utilizes an existing communication waveform, e.g., vehicular communication waveforms (e.g., Cooperative Intelligent Transport Systems (C-ITS) [3] and Dedicated Short-Range Communication (DSRC) [4]), WiFi waveform, and cellular waveform, to extract radar information from targets' echoes. Note that there is another type of joint communication and radar system, called Joint Radar-Communication (JRC), where radar waveforms, e.g., Frequency-Modulated Continuous-Wave (FMCW) waveform, can be used to transfer data. However, it cannot provide a high data rate as that required in AVs because the communication signal has to be spread to avoid degrading the radar performance [5]. By sharing 3 the same hardware and signals, JCR significantly reduces the power consumption, cost, spectrum usage, and system size compared to conventional approaches where radar and communication functions are implemented separately, making it more applicable to AVs. Hereinafter, an AV equipped with JCR is called JCR-AV. Currently, two standards operating at 5.9 GHz for vehicular communication in ITS are C-ITS based on IEEE 802.11bd in Europe [3] and DSRC based on IEEE 802.11p in the U.S. [4].Unfortunately, their data rates, i.e., up to 27 Mbps, do not meet the requirements of AVs' applications. For example, precise navigation that needs to download a high definition threedimension map and raw sensor data exchange between AVs to support fully automated driving may require connections up to a few Gbps[6]. In addition, the performance of communication and radar in JCR systems operating at sub-6 GHz is limited due to the bandwidth availability[5].In this context, millimeter wave (mmWave), whose frequency is from 30 GHz to 300 GHz, has been emerging as a promising solution to address the above challenges in JCR systems. First, owing to the high-resolution sensing and small antenna size, mmWave is predominantly utilized for automotive Long-Range Radar (LRR)[7]. Second, an mmWave system, e.g., a wireless local area network (WLAN) operating at the 60 GHz band, can provide a very high data rate to meet AVs' intensive communication requirements.However, several challenges are hindering the applications of the mmWave JCR system in AVs.In particular, unlike the conventional approaches where radar and communication are separated, the JCR-AV leverages a single waveform for both radar and communication functions. Thus, it needs to jointly optimize these two functions simultaneously to achieve high performance of communication and radar for JCR systems. In addition, since the JCR operates while JCR-AVs are moving, the surrounding environments of AVs are highly dynamic and uncertain. This makes JCR-AVs' performance is unstable as mmWave is more severely impacted by wireless environments than those of the sub-6 GHz bands[17]. Therefore, the highly dynamic and uncertainty of mmWave JCR's environment is another critical challenge that needs to be addressed. To that end, mmWave JCR systems have been demanding effective and flexible solutions that can not only jointly optimize communication and radar functions but also adaptively handle the highly dynamic and uncertainty of the surrounding environment to best sustain high data rate communications links (given the highly directional mmWave communications) and radar accuracy, e.g., low target miss-detection probability and estimation error of target's range 4 and velocity. A few works in the literature have recently studied communication mmWave waveforms for JCR systems [5], [9]-[13]. In [9] and [10], the authors exploit a single IEEE 802.11ad data communication frame to provide the radar function. Specifically, the authors in [9] propose to use the preamble of the single carrier physical layer (SC-PHY) frame in IEEE 802.11adto extract radar information. The simulation results show that this system can achieve a data rate of up to 1 Gbps with high accuracy in target detection and range estimation. However, the velocity estimation is poor because the preamble is pretty short. Particularly, the proposed approach achieves the desired velocity accuracy (i.e., 0.1 m/s) only when the Signal-to-Noise Ratio (SNR) is high, i.e., greater than 28 dB. In [10], the authors aim to overcome this issue by using the IEEE 802.11ad control physical layer (C-PHY) frame that has a longer preamble than that of IEEE 802.11ad SC-PHY. However, it is still not large enough to improve the velocity estimation, whereas the data rate is only 27.5 Mbps, significantly lower than the desired data rate for AV's communication. These results from the above studies (i.e., [9] and [10]) suggest that a single frame processing is unable to satisfy the desired velocity estimation accuracy or automotive radar.Multi-frame radar processing has been recently considered to be a potential solution for JCR systems to improve radar information extracted from targets' echoes, e.g.,[5], [11]-[13]. The authors in[11]propose velocity estimation algorithms that leverage multiple fixed-size frames based on IEEE 802.11ad SC-PHY in a CPI. Their results demonstrate that the proposed solution can achieve the desired velocity accuracy (i.e., 0.1 m/s [7]) when the number of frames is greater than 20. In [12], the authors develop a similar multi-frame processing method to embed radar functionality in IEEE 802.11ad physical layer frame for a Vehicle-to-Infrastructure (V2I) scenario. By doing so, they can reduce the beam training time of 802.11ad up to 83%. Instead of using the 802.11ad standard, the authors in [13] propose a JCR waveform based on Orthogonal Frequency-Division Multiple Access (OFDMA) for a bi-static automotive JCR system, in which the sensing area is extended to non-light-of-sight positions by exploiting reflected signals from other obstacles. However, in this work, the maximum communication data rate is only up to 0.1Mbps which is dwarfed compared to the desired data rate in AVs.A common drawback in the above studies (i.e., [11]-[13]) is that the waveform structures (e.g., number of frames in CPI) are not optimized. Instead, these parameters are manually set. In\n\npractice, the dynamic and uncertainty of the JCR's environment (e.g., SNR and data arrival rate) can significantly influence the JCR's data transmission rate as well as radar accuracy in velocity/range detection. Thus, finding the optimal waveform structure according to the surrounding environment and timely adapting the selected structure with the dynamics of the surrounding environment play vital roles. To address this problem, in [5], the authors propose an adaptive virtual waveform design for mmWave JCR based on the 802.11ad standard to achieve the optimal waveform structure (i.e., number of frames in CPI) that can balance between communication and radar performance. The results show that given a fixed length of CPI, increasing the number of frames in CPI can increase the radar performance, but it will degrade the communication performance (i.e., data rate). However, this approach requires complete information about the surrounding environment in advance, which may be impossible to obtain in practice. As such, their proposed solution needs to be rerun from scratch if there is any change in the environment.\n\nIn addition, none of the above studies (i.e., [5], [9]- [13]) considers the dynamic and uncertainty problem of the information and environment, e.g., the changes of the wireless channel quality and the arrival rate of data that need to be transmitted via JCR. This problem is critical to the performance of the JCR system because the surrounding environment consistently changes as the JCR-AV is moving. In particular, the rapid change of the wireless channel quality (e.g., SNR) highly impacts the JCR's communication efficiency (i.e., packet loss due to transmission failure) and radar performance (i.e., target detection and targets' range and speed estimation accuracy). The problem is even more acute for mmWave systems that are highly directional and prone to blockages/fading. Moreover, the data arrival rate at the JCR-AV is often unknown in advance since it varies in different applications (e.g., navigation and automated driving), each requires a different data transmission rate. When the data arrival rate at the AV is higher than its maximum transmission rate, data starts to pile up in a data queue/buffer. Since a data queue/buffer size is always limited, packet loss will occur when the queue is full. This problem can cause serious issues for AVs as they cannot communicate with other AVs and infrastructure. Given above, adaptively optimizing the waveform of JCR is an effective approach to not only jointly optimize both radar and communication functions but also effectively deal with the dynamic and uncertainty of the surrounding environment. However, to the best of our knowledge, this approach has not been investigated in the literature.\n\nTo fill this gap, this paper aims to propose a novel framework to maximize its performance of a JCR system by adaptively optimizing the waveform structure under the dynamic and uncertainty of the surrounding environment when the AV is moving. It is worth noting that since the radar processing for the 802.11ad-based JCR is well-investigated in [5], [9]- [12], this study only focuses on addressing the waveform structure optimization problem for mmWave JCR AVs under the dynamic and uncertainty of surrounding environments. To that end, we first model the problem as a Markov Decision Process (MDP) because it can allow the AV to determine the optimal waveform (e.g., the number of frames in CPI) based on its current observation (e.g., channel state and number of data packets in the data queue). Then, we adopt the Q-learning algorithm, which is widely used in Reinforcement Learning (RL) due to its simplicity and convergence guarantee, to help the JCR-AV gradually learn the optimal policy via interactions with the surrounding environment. However, Q-learning may face the curse of dimensionality and overestimation problems that lead to a low converge rate and an unstable learning process when the state space is large [22]. In our case, the state space that consists of all possible observations of the surrounding environment is very large, while JCR-AV requires fast learning to promptly respond to the highly dynamic and uncertainty of the JCR-AV's environment. Therefore, we develop a highly-effective learning algorithm based on the most recent advances in RL, namely i-JCR, to deal with these problems. First, i-JCR addresses the high dimensional state space problem by utilizing a deep neural network (DNN) to estimate the values of states [23]. Second, the overestimation is handled by using the deep double Q-learning [22]. Finally, the learning process is further stabilized and accelerated by leveraging the dueling neural network architecture that separately and simultaneously estimates the advantage values and state values [24]. Our major contributions are as follows.\n\n• Design a novel framework by which the JCR-AV can dynamically and automatically optimize the waveform structure under the highly dynamic and uncertainty of its surrounding environment to jointly optimize the communication efficiency and radar accuracy, thereby maximizing the JCR's performance.\n\n• Develop a highly-effective deep RL (DRL) algorithm taking advantages of recent advances in RL, including deep Q-learning, deep double Q-learning, and dueling neural network architecture, that can help the JCR-AV quickly obtain the optimal policy. different scenarios and reveal key factors that can significantly influence the performance of the JCR system.\n\nThe rest of this paper is organized as follows. Sections II and III introduce the JCR system model and the problem formulation, respectively. Then, the Q-learning-based and the proposed j-JCR algorithms are proposed in Section IV. In Section V, simulation results are analyzed. Finally, we conclude our study in Section VI.\n\n\nII. SYSTEM MODEL\n\nIn this work, we consider an autonomous vehicle, namely JCR-AV, that is equipped with an intelligent millimeter wave joint communication radar (mm-Wave JCR) system based on the IEEE 802.11ad SC-PHY specification. The JCR-AV maintains a communication link at a wavelength λ with another vehicle AV X , called the recipient vehicle. Let d X and v X denote the distance and the relative speed between JCR-AV and AV X , respectively. At the same time, the JCR-AV gathers echoes of transmitted signals from surrounding targets (e.g., moving vehicles AV 1 , . . . , AV X ) to perform the radar function, as depicted in Fig. 1. In this work, we assume that time is divided into equal slots. The time slot is small enough so that the velocities of targets can be considered constant in a time slot [5], [11]. At the beginning of a time slot, the JCR-AV decides the mm-Wave JCR waveform structure, i.e., the number of frames in the CPI, that will be used to transmit data in this time slot. Then, it observes feedback from the receiving vehicle AV X (i.e., the acknowledgment of frame) and echoes signals from its surrounding targets at the end of this time slot.\n\nThe JCR-AV has a data queue with a maximum of Q packets, each with B Bytes. When a new packet arrives, it will be stored in the data queue if this queue is not full. Otherwise, this packet will be dropped. The packet arrival is assumed to follow the Poisson distribution with the mean µ packets per time slot. Note that the 802.11ad frame has a varying data field; therefore, each frame can contain one or multiple packets. In the following, we first elaborate the proposed JCR transmit and receive signal models, then discuss the radar processing and JCR performance metrics.\n\nA. Signal Models 1) Transmitted Signal Model: In IEEE 802.11ad, the SC-PHY frame consists of a fixedsize preamble and a varying length data field. The preamble contains multiple Golay sequences whose Ambiguity Function (AF) exhibits an ideal auto-correlation without a side-lobe along the zero Doppler axis, making it perfect to be utilized for radar function, e.g., range estimation and multi-target detection [11]. However, its AF is very susceptible to Doppler shifts, leading to a poor velocity estimation. To that end, multi-frame processing is proposed to address this problem [5], [11]. By doing so, the preambles across frames act as radar pulses in a Coherence The maximum target's relative velocity, denoted by v max , can only be explicitly estimated when frames are located at specific locations in the CPI time [5]. Specifically, the n-th frame is located at nT d (as illustrated in Fig. 1), where n ∈ [0, 1, . . . , N − 1] and T d ≤ 1/(2∆f max ) is a sub Doppler Nyquist sampling interval with a maximum Doppler shift ∆f max = 2v max /λ [16].\n\nIt is worth noting that the desired JCR system performance can be achieved by optimizing the JCR waveform parameters (e.g., the number of frames in the CPI), which will be described in more details in Section II-C. The transmit signal model is then defined as follows. Let s n [k]\n\ndenote the symbol sequence corresponding to n-th transmitted frame with K n symbols. Then, the complex-baseband continuous time of transmitted signal in the CPI can be given by [19]:\nx(t) = N −1 n=0 Kn−1 k=0 s n [k]g T X (t − kT s − nT d ),(1)\nwhere g T X (t) is the unit energy pulse shaping filter at the transmitter of JCR-AV and T s is the symbol duration.\n\nIn this study, we assume that the communication and radar channels are light-of-sight (LoS), as in [5], [14]. In addition, this work considers a single data stream model where the adaptive analog beamforming can be applied to achieve higher directionality beamforming. The above communication and radar received signals can be modelled in the following.\n\n\n2) Received Signal Models:\n\na) Data communication received signal: After beamforming, symbol and frequency synchronization phases, the discrete-time received communication signal corresponding to symbol k in the frame n can be represented as follows [19]:\ny c n [k] = h c s n [k] + z c n [k],(2)\nwhere h c is the communication complex channel gain and z c n [k] is the complex white Gaussian noise with zero mean and variance σ 2 c , denoted by N C (0, σ 2 c ). The SNR of the communication received signal is defined as SNR c = E s |h c | 2 /σ 2 c , where E s is the energy per symbol of the transmitted signal. b) Radar received signal: The radar channel of a target vehicle AV i moving at a speed v i is determined by its radar channel gain g i at the range bin d i and Doppler shift ∆f i 2v i /λ.\n\nWe assume that the interference of the data part on the preamble part in a frame is completely cancelled, and the channel is time-invariant during the preamble period (as in [5], [11]). Then, the discrete-time received radar signal corresponding to the preamble of n-th frame that is located at nT d can be given as follows [5]:\ny i n [k] = g i e −j2π∆f i nT d s n [k − d i ] + z i n [k],(3)\nwhere s n [k − d i ] is the preamble part of the n-th frame, and z i n [k] is the complex Gaussian noise N C (0, σ 2 n ).\n\n\nB. Radar Processing\n\nWe now discuss radar processing in the JCR system. Based on the cross-correlation output between the transmitted preamble of a single 802.11ad frame and the received signal, the JCR system can detect a target with high probability (more than 99.99%) and achieve the desired range resolution (i.e., 0.1 m [7]) for automotive LRR [11]. However, the AF of IEEE 802.11ad\n\npreamble is sensitive to Doppler shift, making it less accurate in velocity estimation. Therefore, this work only considers the velocity estimation of the JCR system, which is more challenging to obtain a high accuracy than those of target detection and range estimation processes.\n\nFor the target AV i in range bin d i moving at speed v i , the radar channel corresponding to n-th frame is expressed as follows [5]:\nh i n [d i ] = γ E s g i e −j2π∆f i nT d + z i n [d i ],(4)\nwhere γ is the correlation integration gain, z i n [d i ] is the complex Gaussian noise N C (0, σ 2 n ). The SNR of the radar signal is defined as SNR r = (γ √ E s g i ) 2 /σ 2 n . Then, the radar channel vector for N frames in a CPI is derived as\nh[d i ] = v(v i )γ E s g i + z[d i ],(5)where h[d i ] = h i 0 [d i ], h i 1 [d i ], . . . , h i N −1 [d i ] T and v(v i ) = 0, e j2π∆f i T d , . . . , e j2π∆f i (N −1)T d T are\nthe channel vector and the velocity vector, respectively, and z[d i ] is the noise vector. The target velocity can be estimated based on (5) by using Fast Fourier transform (FFT)-based algorithms that are widely used in the classical radar processing [11], [16].\n\n\nC. JCR Performance Metrics\n\nIn this work, the radar performance for the JCR can be determined by the velocity estimation accuracy (i.e., velocity resolution). For the FFT-based velocity estimation approach, the velocity resolution is defined by [11]:\n∆ v = λ 2NT d .(6)\nThen, the velocity measurement accuracy can be characterized by the root mean square error that depends on the SNR of the received radar signal as follows [7]:\nδ = λ 2NT d √ 2SNR r .(7)\nIn (7), it indicates that given a fixed CPI time and a constant data rate, the velocity estimation accuracy increases (i.e., δ decreases) as the number of frames in the CPI increases. Note that as the number of frames in the CPI increases, the size of each frame decreases since the CPI time is a constant.\n\nThe communication metrics for the JCR must represent the data transmission performance.\n\nTwo typical communication metrics are the transmission rate and reliability (e.g., packet loss).\n\nThus, this work considers two metrics, 1) the length of the data queue representing the efficiency of data transmission, and 2) the number of dropped packets demonstrating the system reliability.\n\nIt is also worth noting that a large frame has a higher drop probability than that of a smaller frame in the same wireless environment. Thus, using a small-size frame can increase not only the reliability of transmission but also the radar performance (i.e., the velocity estimation accuracy).\n\nHowever, it leads to an overhead because it increases the number of preambles that do not contain user data. Consequently, packets pile up at the JCR-AV, leading to packet drop in the queue. In addition, the characteristics of the JCR-AV's surrounding environment (e.g., the wireless channel quality, which can be represented through the packet drop probability and SNR, and the packet arrival rate) highly influence the JCR performance in regard to data transmission reliability and radar accuracy.\n\nTherefore, the JCR system needs to obtain an optimal policy that optimizes the JCR waveform (i.e., number of frames in the CPI) to achieve the desired performance in terms of data transmission and radar accuracy. Furthermore, the JCR-AV's surrounding environment may change significantly from time to time, especially in the JCR environment where AVs usually travel.\n\nThus, optimizing the JCR waveform in each time slot is an intractable problem. The following sections will describe our proposed MDP framework for the JCR operation problem that enables the JCR-AV to quickly and effectively learn the optimal policy without requiring complete information from the surrounding environment, thereby achieving the best performance compared with traditional solutions.\n\n\nIII. PROBLEM FORMULATION\n\nThe JCR-AV's operation problem is formulated using the MDP framework to deal with the highly dynamic and uncertain of the surrounding environment. The MDP framework can helps the JCR-AV adaptively decide the best action (i.e., the JCR waveform structure) based on its current observations (i.e., the current data queue length and channel quality) at each time slot to maximize the JCR system performance without requiring complete knowledge on the packet arrival rate, data transmission process, and channel quality in advance. An MDP is generally defined by the state space S, the action space A, and the immediate reward r. In the following, we will discuss more details about the components of our proposed framework.\n\n\nA. State Space\n\nAs we aim to maximize the performance of the JCR system with regard to data transmission efficiency and radar accuracy, we need to consider the following key factors. The first one is the current data queue length (i.e., the number of packets in the data queue) because it reflects the efficiency of the data transmission process. For example, given a packet arrival rate, the lower the number of packets in the queue is, the higher the data transmission efficiency is. The second one\n\nis the link quality that can be estimated by using the SNR metric at the transmitter of JCR-AV.\n\nAt the beginning of a time slot, the link quality is estimated based on the feedback (i.e., the recipient vehicle's ACK frame and targets' echoes) of the transmitted frame in the previous time slot. Although it does not represent the instantaneous channel state, it help to provide valuable information about the surrounding environment.\n\nIn this work, we consider that the channel quality level can be grouped into C different classes, which are analogous to the Modulation and Coding Scheme (MCS) levels in IEEE 802.11ad [15].\n\nThese classes have different probabilities of bit errors due to the different wireless channel qualities, denoted by a probability vector p e = [p 1 , p 2 , . . . , p C ]. Note that given the transmission link with bit error probability p b , the error probability of an F -bit frame can be calculated by [18]. In addition, if a frame drops, all packets in this frame will be lost. To that end, the JCR's state space can be given as follows:\np f = 1 − (1 − p b ) FS = (q, c) : q ∈ {0, . . . , Q}; c ∈ {0, . . . , C} ,(8)\nwhere q is the current number of packets in the data queue and c is the channel quality. Here, Q is the maximum number of packets that the data queue can store. In this way, the system state can be represented by a tuple s = (q, c). By this design, the JCR system continuously operates without falling into the terminal state.\n\n\nB. Action Space\n\nAs discussed in Section II-C, the JCR waveform plays a critical role in the system performance.\n\nIn particular, given a fixed CPI time T , using a large number of frames results in a high reliability of data transmission and a high radar accuracy. However, it reduces the efficiency of data transfer as there are more overhead data. At each time slot, the JCR-AV needs to select the most suitable JCR waveform structure (i.e., the number of frames in the CPI) to maximize the system performance. Thus, the action space can be defined as follows:\nA = 1, . . . , N ,(9)\nwhere N is the maximum number of frame in the CPI. Recall that the beginning of each frame needs to be placed at the multiple of T d consecutively, and thus N = ⌊ T CP I T d ⌋, where T CP I is the CPI time and ⌊.⌋ is the floor function. As such, if the number of frames in the CPI selected by the JCR-AV is less than N, the last frame will be longer than others. It is worth noting that when the data queue is empty, the JCR-AV can still send dummy frames (e.g., frames whose data fields contain random bits) to maintain the JCR's radar function continuously.\n\n\nC. Reward Function\n\nSince the JCR system performs two functions simultaneously, i.e., data transmission and radar, we aim to maximize the JCR system performance by balancing the data transmission efficiency and the radar accuracy. Thus, the reward function needs to capture both of them. The data transmission efficiency can be defined according to the number of packets waiting in the queue and the number of dropped packets. Specifically, the lower the number of packets in the data queue and the number of dropped packets are, the higher the efficiency of the JCR system is.\n\nSuppose that at time slot t, the JCR-AV observes state s t and takes action a t . Let q t , δ t , and l t denote the current size of the data queue, the radar accuracy, and the number of dropped packets that the JCR-AV observes at the end of t, respectively. Then, the immediate reward function can be defined as follows:\nr t (s t , a t ) = −(w 1 q t + w 2 δ t + w 3 l t ),(10)\nwhere w 1 , w 2 , and w 3 are the weights to tradeoff between the number of packets waiting in the queue, the radar accuracy, and the number of dropped packets due to the data queue full. The negative function in (10) implies that the JCR-AV should take an action that can quickly free the data queue, lower the number of dropped packets, and achieve a high radar accuracy. Note that the lower the value of δ t is, the higher the radar accuracy of the system is.\n\n\nD. Optimization Formulation\n\nThe objective of this study is to find an optimal policy for the JCR-AV that maximizes the long-term reward function. Let R(π) denote the long-term average reward function under policy π : S → A, then the problem can be formulated as:\nmax π R(π) = lim T →∞ 1 T T t=1 E r t (s t , π(s t )) ,(11)\nwhere π(s t ) is the action at time t according to policy π. Thus, given the JCR-AV's current data queue length and wireless channel quality, the optimal policy π * gives an optimal action that maximizes R(π). In addition, Theorem 1 shows that the average reward function is well defined regardless of the initial state.\n\nTheorem 1. With the proposed MDP framework, the average reward function R(π) is well defined under any policy π and regardless of a starting state.\n\nProof. We first prove that the Markov chain of the considered problem is irreducible as follows.\n\nRecall that the state of the JCR consists of two factors, i.e., the current queue length q and the wireless channel quality c. For each time slot, the data arrival rate is assumed to follow the Poison distribution and the channel quality is derived from C class accordingly a probability vector p e = [p 1 , p 2 , . . . , p C ]. Therefore, given the JCR is at state s at time t, it can move to any other states s ′ ∈ S{s} after finite time steps. As such, the proposed MDP is irreducible with the state space S, thereby making the average reward function R(π) is well defined under any policy π and regardless of a starting state.\n\n\nIV. REINFORCEMENT LEARNING BASED SOLUTION FOR JCR-AV OPERATION POLICY\n\nDue to the highly dynamic and uncertainty of the environment (e.g., packet drop probability due to the channel quality and the data arrival rate), the JCR-AV is unable to obtain this knowledge in advance. In this context, RL can help the JCR-AV obtain the optimal policy without requiring prior knowledge of the environment. The idea is that the JCR-AV can gradually learn through interacting with its surrounding environment. In the following, we first present a Qlearning based approach that is one of the most popular algorithms in RL due to its simplicity and convergence guarantee. We then develop an intelligent solution that can effectively overcome limitations of Q-learning by adopting three recent advanced techniques in RL, namely deep Qlearning, deep double Q-learning, and dueling neural network architecture.\n\n\nA. Q-learning based JCR's Waveform Structure Optimization\n\nIn RL, the value of state s at any time step t under policy π : S → A is calculated by the\nstate value function, i.e., v π (s) = E π ∞ m=0 η m r t+m s t = s , ∀s ∈ S,(12)\nwhere E π [.] is the expectation under policy π and η is the discount factor that indicates the importance of future rewards. Similarly, the state-action function evaluates how good to performing action a at state s then following policy π, which is given by:\nq π (s, a) = E π ∞ m=0 η m r t+m s t = s, a t = a ,(13)\nUnder the optimal policy π * , the optimal state-action value function, i.e., q * (s, a), is given by [20]:\nq * (s, a) = E r t + η max a ′ ∈A q * (s t+1 , a ′ ) s t = s, a t = a .(14)\nThus, once q * (s, a) is obtained, the optimal policy is achieved by taking actions that maximize q * (s, a) for all state s ∈ S.\n\nQ-learning algorithm uses a table, namely Q-table, to learn q * (s, a), making its implementation simple. The Q-learning based approach for the JCR-AV is presented in details in Algorithm 1.\n\nSpecifically, each cell of the Q- The JCR-AV performs an action following the ǫ-greedy policy as follows:\na t =      argmax a∈A Q(s t , a), with probability 1 − ǫ,\nrandom action a ∈ A, otherwise.\n\n4:\n\nJCR-AV observes next state s t+1 and reward r t , then updates Q(s t , a t ) and reduces ǫ by (15).\n\n\n5: end for\n\ninteractions with the surrounding environment. Given action a t is selected under the ǫ−policy (17) at state s t at time t, the JCR-AV obtains the immediate reward r t and moves to a next state s t+1 .\n\nThen, q(s t , a t ) is updated as follows:\nq(s t , a t ) ←q(s t , a t ) + α t r t (s t , a t ) + η max a t+1 q(s t+1 , a t+1 ) Target Q-value Yt −q(s t , a t ) Temporal difference (TD) ,(15)\nwhere α t is the learning rate that controls how important of new knowledge (i.e., TD) to the update of Q-function. By using (15) and α t that satisfies (16) to iteratively updating the Qfunction, it is proven that q(s, a) will converge to q * (s, a) [21].\nα t ∈ [0, 1), ∞ t=1 α t = ∞, and ∞ t=1 (α t ) 2 < ∞.(16)\nHowever, the usage of a table in Q-learning leads to the curse of dimensionality problem that results in a long time for learning, especially in the considered JCR system with a high dimensional state space. In addition, the uncertainty and dynamic of the JCR's environment (e.g., the probability of frame loss and the packet arrival rate) make it more challenging for the JCR-AV to achieve an optimal policy. Furthermore, Q-learning is prone to overestimate the Q-values due to the max operation in (15), i.e., the Q-value of a state-action pair is estimated higher than its actual value [22]. It may not be crucial if all Q-values are uniformly shifted. Nevertheless, they are typically non-uniform in practice, thereby substantially slowing down the JCR-AV's learning process. To that end, we will discuss our highly-effective intelligent algorithm (namely i-JCR) to quickly achieve the optimal operation policy for the JCR-AV, thus maximizing the data transmission efficiency and radar accuracy of the system.\n\n\nB. Deep Reinforcement Learning based JCR's Waveform Structure Optimization\n\nInstead of using a Q-table, a DNN can be employed to quickly learn the optimal Q-function and address the high dimensional state and action spaces effectively [23]. The employment of DNN in RL forms a new group of RL algorithms, i.e., DRL. Thus, this paper develops a DRL algorithm, i.e., i-JCR, that can efficiently overcome the slow convergence and overestimation problems of Q-learning by adopting three innovation techniques in RL, including 1) deep Qlearning (DQ) [23], 2) double deep Q-learning (DDQ) [22], and 3) dueling architecture [24]. In this way, our proposed approach can inherit all advantages of these techniques, thereby stabilizing the learning process, improving the learning speed, and reducing the overestimation. As a result, the JCR-AV can quickly obtain the optimal policy to maximize both data transmission efficiency and radar accuracy.\n\nThe details of i-JCR are presented in Algorithm 2. In particular, the major steps are an analogy to those of Q-learning. However, the experience at time t is not used directly to train the neural network, but it is stored in a buffer E instead. The reason is that the successive experiences are highly correlated, resulting in severely slowing the learning process [25]. Then, a mini-batch of experiences is sampled uniformly at random from E to train the neural network. By doing so, the high correlation between successive experiences decreases so that the convergence is acceleration. In addition, the usage of the experience buffer increases the data usage efficiency since each experience can be utilized multiple times to train the DNN. In i-JCR, the optimal Q-function is estimated by a DNN where the input layer consists of two inputs corresponding to the dimension of JCR-AV's state (i.e., the data queue size and the channel quality), whereas the number of neurons in the output layer is the maximum number of frames in the CPI, i.e., N.\n\nSpecifically, given that state s is passed to the DNN, each output layer's neuron value corresponds to a Q-value of one action in this state.\n\nTo stabilize the learning process, we introduce a dueling neural network architecture where the DNN is split into two streams, one for estimating the state value function v(s) and another for estimating the advantage function d(s, a), as shown in Fig. 2. Recall that q(s, a) evaluates Based on ǫ-greedy policy (17), select action a t . 6:\n\nPerform a t , observe next state s t+1 and receive reward r t .\n\n\n7:\n\nStore (s t , a t , r t , s t+1 ) in E.\n\n\n8:\n\nCreate an experience mini-batch by sampling from E randomly, denoted by (s, a, r, s ′ ) ∼ U(E).\n\n\n9:\n\nCompute Q(s t , a t ; θ) and Y t by (19) and (22), respectively.\n\n\n10:\n\nUpdate the Q-network's parameters by SGD.\n\n\n11:\n\nReduce ǫ.\n\n\n12:\n\nReplaceQ ← Q at every U steps. 13: end for the value of executing an action at a state, whereas v(s) describes how good to end up at a state.\n\nThen, d(s, a) is defined by the relationship between v(s) and q(s, a) under a policy π as: d π (s, a) = q π (s, a) − v π (s).\n\nThus, d(s, a) demonstrates the importance of action a compared to other actions at state s. \n\nNote that (19) is unidentifiable, i.e., for a given Q-value, it is unable to uniquely determine V (s; φ) and D(s, a; ψ) since the Q-value is unchanged if V (s; φ) decreases the same amount that D(s, a; ψ) increases. Therefore, a learning algorithm may have poor performance if it uses (19) directly. This issue can be addressed as follows (20). \n\nBy doing so, the estimation of the advantage function is forced to zero at the selected action.\n\nSpecifically, given a * = argmax a∈A Q(s, a; φ, ψ) = argmax a∈A D(s, a; ψ), we have Q(s, a * ; φ, ψ) = V (s; φ). Thus, V (s; φ) gives an estimation of the state value function, while D(s, a ′ ; ψ) provides an estimation of the advantage function [24]. Nevertheless, because the change of the advantage stream is as fast as that of the predicted optimal action's advantage, the estimation of Q-function may be unstable. To overcome this problem, the max operation in (20) can be replaced by the mean as follows [24]:\nQ(s, a; φ, ψ) = V (s; φ)+ D(s, a; ψ)− 1 |A| a ′ D(s, a ′ ; ψ) .(21)\nThe proposed i-JCR addresses the Q-learning's overestimation by adopting the double deep Q-learning [22]. In particular, i-JCR utilizes two dueling neural networks whose architectures are identical: 1) Q-network Q for selecting an action and 2) target Q-networkQ for evaluating an action. Hereinafter, let θ t denote the Q-network's parameters and θ − t denote the target Qnetwork's parameters at time t. Thus, the target Q-value of performing action a at state s at time t is given by:\nY t = r t + ηQ s t+1 , argmax a ′ Q(s t+1 , a ′ ; θ t ); θ − t .(22)\nSince minimizing the TD is the purpose of training the Q-network, the loss function can be given as:\nL t (θ t ) = E (s,a,r,s ′ ) Y t − Q(s, a; θ t ) 2 ,(23)\nwhere (s, a, r, s ′ ) is a data point (i.e., an experience) in memory E.\n\nIn deep learning, Gradient Descent (GD) is widely employed to minimize the loss function since it can obtain global minima and is straightforward to be implemented [26]. At time t, the cost function in GD is computed as follows:\nC t (θ t ) = 1 |E| (s,a,r,s ′ )∈E L t (θ t ).(24)\nThen, GD updates neural network parameters as:\nθ t+1 = θ t −β t ∇ θt C t (θ t ),\nwhere β t is a step size at time t and ∇ θt [.] is the gradient function with respect to parameters θ t . The main shortcoming of GD is that it requires all data points in E to compute the loss and the gradient of the cost function for each update of parameters, making it sluggish when the data pool is enormous.\n\nTherefore, we propose to use stochastic gradient descent (SGD) to minimize the loss function in (24) since it can accelerate the learning convergence [27]. In particular, for each iteration, SGD only computes the cost and its gradient for a mini-batch of experiences that is uniformly sampled from M, making its computational complexity much lower than that of SGD. Note that in (23), the target Q-value Y t looks like labels in supervised deep learning, which are fixed before the raining process. Nevertheless, Y t will change if there is any change in the target Q-network's parameters θ − t , making the training process unstable. To that end, θ − t is only updated by copying from θ t at every U steps, as shown in Fig. 3.\n\n\nC. Computational Complexity Analysis\n\nThe computational complexity of our proposed algorithm, i.e., i-JCR, mostly depends on the Q-network's training process. The Q-network includes one input layer with I neurons, one hidden layer with H neurons, and two output layers with V and D neurons corresponding to the value stream and advantage stream, respectively. Typically, DNN's training phase is conducted with matrix multiplication [29]. Thus, the complexity of one training epoch of Q-network with a batch size S b is O S b (IH + HV + HD) . Supposed that Q-network's training phase consists of T epochs, the complexity of i-JCR is O T S b (IH + HV + HD) Generally, training a DNN requires a high computing resource, especially for complex neural architectures. Nevertheless, the Q-network in i-JCR only contains three layers in which only the hidden layer is fully connected. As such, our proposed approach can be effectively implemented on AVs that are usually equipped with sufficient computing resources. In practice, there are some deep learning applications have been deployed in AVs such as Tesla Autopilot [30] and ALVINN [31]. Thus, our proposed learning algorithm, i.e., i-JCR, can be effectively implemented on AVs.\n\n\nV. PERFORMANCE EVALUATION\n\n\nA. Simulation Parameters\n\nIn this paper, we investigate our proposed solutions in a scenario that includes three types of objects: 1) JCR-AV, which is an autonomous vehicle equipped with 802.11ad based JCR, 2) a receiving vehicle AV X that maintains communication with JCR-AV, and 3) a target AV 1 moving at a distance of around the JCR-AV, as illustrated in Fig. 1. Specifically, the maximum related velocity that the JCR system can estimate is 50 m/s. The CPI time T CP I is set to 10T d , meaning that the maximum number of frames in the CPI is 10. Note that one frame in the CPI can contain multiple packets. The JCR-AV has a data queue containing a maximum of 50 packets.\n\nRecall that the data queue is used to store data packets when the amount of arrival data at the JCR transmitter excesses the JCR maximum transmission rate. All packets' sizes are assumed to be equal to 1500 Bytes, which is the typical value of the maximum transfer unit (MTU) in WiFi networks and the Internet [28]. Other parameters of the JCR system are set based on IEEE 802.11ad standard, e.g., a carrier frequency of 60 GHz and a sampling rate of 1.76 GHz [15].\n\nThe 802.11ad standard requires that the packet error ratio (PER) to be less than 1% [15].\n\nIn practice, the PER depends on many factors such as wireless channel quality, modulation technique, and transmit power [18]. Therefore, for demonstration purposes, we consider three levels with different values of PER: 1) level 1 with 10%, 2) level 2 with 1%, and 3) level 3 with 0.3%. Based on these quality levels, we assume that the wireless channel can fall into one of the three groups. The first one is the poor channel, in which the probability of channel quality at level 1, level 2, or level 3 at a time slot corresponds to a probability vector p p c = [0.6, 0.2, 0.2], i.e., at a time slot the probability of the channel quality at level 1 is 60% and so on. Two other groups are normal channel and strong channel whose probability vectors are p n c = [0.2, 0.6, 0.2], and p g c = [0.2, 0.2, 0.6], respectively. Note that these above settings are just for simulation purposes, our proposed learning algorithm (i.e. i-JCR) does not require to know these parameters in advance and can adapt with them through real-time interactions with the surrounding environment.\n\nThe parameters for the proposed learning algorithms are set as typical values, as in [22]- [24].\n\nSpecifically, the value of ǫ in ǫ-greedy policy is 1 at the beginning of the learning process.\n\nThen, it is decreased at each time slot until ǫ = 0.01. The discount factor η is 0.9 for both the Q-learning based algorithm and the i-JCR. For Q-learning based approach, the learning rate is Recall that the JCR-AV does not have any prior information about its surrounding environment's uncertainties and dynamics, e.g., the packet drop probabilities and packet arrival rate.\n\nTherefore, the proposed solutions are compared with two baseline policies: 1) a greedy policy where the JCR-AV selects an action to maximize the reward function without caring about the uncertainties and dynamics of the environment and 2) a deterministic policy in which the JCR-AV always sends n dp frames in the CPI time. Here, we set n dp to a half of N (i.e., 5) to demonstrate the JCR's average performance when the number of frames in the CPI is fixed.\n\n\nB. Simulation Results\n\nTo evaluate the JCR system performance, we first examine the convergence rates of our proposed approaches, i.e., Q-learning based algorithm and i-JCR. We then study the influences of several key factors (e.g., the packet arrival rate, wireless channel quality, and weights in the immediate reward function) on the performance of the JCR system. Fig. 4 illustrates the convergence rates of our proposed algorithms for the JCR system, i.e., the Q-learning and the i-JCR. Here, we compare their performance in the normal channel, and the mean number of arrived packets µ is set to 14. It can be observed that average radar accuracy, and average packet drop. Here, to make the demonstration consistent across system performance metrics (i.e., the smaller value, the better system performance), we use a cost metric that is the negation of reward.\n\n\n1) Convergence Rate:\n\nWe first set the wireless channel to normal quality. The weights of the immediate reward function are presented by a weights vectors W 1 = [0.05, 0.4, 0.5], i.e., w 1 = 0.05, w 2 = 0.4, w 3 = 0.5, as in Fig. 5. Clearly, the average costs of all policies increase as the packet arrival rate increases, i.e., µ increases from 2 to 20, as shown in Fig. 5 (a). It stems from the fact that given a data queue with fixed capacity and the JCR system operates under the same environment's characteristics, the higher the value of µ, the higher the number of dropped packets due to the full packet queue. Indeed, this is obviously illustrated in Fig. 5 (b) and (d) that when the packet arrival rate increases, the average queue length and average packet drop increase for all policies. Regarding the radar metric, i-JCR and Q-learning achieve the highest radar accuracy (i.e., the lowest value of average radar accuracy) when µ is less than 12. Whereas their average radar accuracy results are not good compared to other policies if µ is larger than 12. The reasons are as follows. When the packet arrival rate is low (i.e., µ < 12), the average numbers of packets in the queue of all policies never pass 30% of the data queue capacity, as shown in Fig. 5 (b).\n\nThus, the JCR-AV can increase the number of frames in the CPI, meaning a decrease in the packet sent in the CPI, to achieve a higher radar performance without worrying about packet loss due to a full queue. Fig. 5 (c) clearly shows that the Q-learning and i-JCR can learn this strategy to obtain the best performance in terms of average radar accuracy when µ < 12.\n\nAs µ increases from 12 to 20, the average queue lengths of the greedy and deterministic policies quickly reach the maximum number of packets that can be stored in the data queue, i.e., 50, as shown in Fig. 5 (b). This can lead to a high possibility of packet drop due to the full data queue. Interestingly, radar performance of Q-learning and i-JCR policies decreases to the worst at µ = 16 and µ = 18, respectively. Then, they manage to increase the radar accuracy when the packet queue is mostly always full at µ = 20. The reason is that the data transmission efficiency is unable to be improved because of a very high packet arrival rate that the system cannot handle.\n\nThus, it might be better to improve the radar accuracy instead of communication efficiency. On the other hand, since the greedy and deterministic policies do not care about the uncertainty of the environment (e.g., the packet drop possibility), they can maintain better radar accuracy when the packet arrival rate is high. However, their transmission quality is very low. As can be seen in Fig. 5 (d), the average numbers of packet drops of the greedy and deterministic policies are up to 50% higher than that of our proposed learning algorithm, i.e., i-JCR. Thus, the proposed algorithm can help the JCR-AV to obtain an optimal policy that strikes a balance between radar and data transmission metrics, thereby achieving the best overall system's performance compared with those of other policies. Although i-JCR and Q-learning experience a similar trend when µ increases from 2 to 20, i-JCR consistently outperforms Q-learning. This stems from the fact that i-JCR can effectively address the high dimensional state in a complicated problem.\n\nNext, we investigate how the immediate function's weights can influence the system performance by changing the weight vector to W 2 = [0.025, 0.8, 0.5] and varying the packet arrival rate.\n\nIn Fig. 6, it can be observed that the results of deterministic policy are mostly unchanged, except the average cost result, when changing these weights because the JCR-AV's environment is still the same as the previous experiment, and this policy does not rely on the immediate function. As the weight of radar metric (i.e., w 2 ) is doubled, i-JCR, Q-learning, and greedy policies achieve radar accuracy results that are much better than those in the previous experiment. In addition, except for the Q-learning, they also consistently outperform the deterministic policy in terms of radar metric. In contrast, these policies' data transmission metrics (i.e., the average packet drop and average queue length) become worse than those in the first experiment, as shown in Fig. 6 (b) and (d). The reason is that when the ratios w 1 /w 2 and w 3 /w 2 become smaller, the JCR system pays more attention to the radar accuracy. Thus, Fig. 6 clearly shows that in practice, these weights can be adjusted so that our proposed learning algorithm can obtain a policy that fulfils different requirements of a JCR system at different times. Thanks to the ability to learn without requiring complete information of the surrounding environment, i-JCR still achieves the best overall performance when increasing the radar metric's weight.\n\nWe now examine the robustness of our proposed approach by letting it work under different channel qualities, i.e., poor quality with the PER probability vector p p c = [0.6, 0.2, 0.2] and good quality with the probability vector p g c = [0.2, 0.2, 0.6]. For each of channel qualities, two sets of results are collected according to W 1 and W 2 when varying the packet arrival rate, as shown in Figs. 7 to 10. Overall, all policies' results experience similar trends as those in normal channel quality. It can be observed that the channel quality significantly affects the system performance.\n\nSpecifically, the overall system performance (i.e., the average cost) increases as the channel quality changes from poor to normal and then to good regardless of the weight vector. The reason is that as the channel quality becomes worst, the probability of packet drop decreases, leading to a better performance of the JCR system. Among the policies, i-JCR achieves the highest overall performance boost when channel quality changes from poor to good, e.g., with W 1 , i-JCR's average cost decreases up to 51.7% while those of the greedy and deterministic policies reduce up to 41.17%. This is because our proposed approach can effectively adapt its behaviour according to the changes in its surrounding environment to improve the system performance significantly.\n\n\nVI. CONCLUSION\n\nIn this paper, we have developed a novel MDP-based framework that allows a JCR-AV to automatically and adaptively decide its optimal waveform structure based on the observations to maximize the overall performance of the JCR system. Then, we have proposed an advanced learning algorithm, i.e., i-JCR, that can help the JCR-AV gradually learn an optimal policy through interactions with the surrounding environment without requiring complete knowledge about its environment in advance. As such, our proposed approach can effectively handle the environment's dynamic and uncertainty as well as the high dimensional state space problem of the underlying MDP framework. The extensive simulation results have clearly shown that the proposed solution can strike a balance between communication efficiency and radar accuracy, thereby consistently outperforming the conventional methods in different scenarios.\n\n•Fig. 1 :\n1Perform extensive simulations to investigate the effectiveness of our proposed solution under IFS: Interframe spacing PRE: Preamble ACK: The JCR system model in which the JCR-AV maintains a data communication with AV X based on IEEE 802.11ad. At the same time, the JCR-AV senses its surrounding environment by utilizing echoes of its transmitted waveform.\n\n\nLet φ and ψ denote the state value and advantage streams' parameters of the dueling DNN, respectively. Then, we denote Q(s, a; φ, ψ), V (s; φ), and D(s, a; ψ) as the estimations of q(s, a), v(s), and d(s, a) given by the dueling network, respectively. Hence, the value of taking action a at state s given by the dueling DNN is expressed as: Q(s, a; φ, ψ) = V (s; φ) + D(s, a; ψ).\n\nFig. 2 :\n2The dueling architecture for i-JCR in which a DNN is divided into two streams, one for estimating the state value function v(s) and another for estimating the advantage function d(s, a).\n\nQ\n(s, a; φ, ψ) = V (s; φ) + D(s, a; ψ) − max a ′ ∈A D(s, a ′ ; ψ) .\n\nFig. 3 :\n3The proposed i-JCR model, in which the JCR-AV obtains an optimal policy by gradually updating its policy based on its observations of the surrounding environment.\n\nFig. 4 :\n4Convergence rate of proposed algorithms. 0.1. For i-JCR, the Adam optimizer is used to train the Q-network with a learning rate of 10 −4 and the target Q-network's parameters are updated at every 10 4 time steps.\n\nFig. 5 :Fig. 6 :Fig. 7 :Fig. 8 :\n5678Varying data arrival rate with normal channel quality, w 1 = 0.05, w 2 = 0.4, and w 3 Average queue length (c) Average radar accuracy (d) Average packet drop Varying data arrival rate with normal channel quality, w 1 = 0.025, w 2 = 0.8, and w 3 = 0.5. the i-JCR achieves a superior result in terms of average reward compared with that of the Qlearning. Specifically, at the beginning of the learning process, the Q-learning and i-JCR obtain similar results. However, after 2×10 4 iterations, the i-JCR's average reward is 20% greater than that of the Q-learning. Then, the i-JCR eventually converges to the optimal policy after 4.5×10 4 while Q-learning still struggles with a mediocre policy. Under the optimal policy obtained by i-JCR, the JCR-AV's average reward is stable at around −1.75, approximately 40% higher than that of the policy learned by the Q-learning.2) Performance Evaluation:We then evaluate the robustness of our proposed approach, i.e., i-JCR, by varying the mean number of packets arrived at a time slot µ from 2 to 20. The learned policies of Q-learning and i-JCR are obtained after 2×10 5 training iterations. To evaluate the performance of JCR system, four possible metrics are the average reward, average queue length, Varying data arrival rate with poor channel quality, w 1 = 0.05, w 2 = 0.4, and w 3 Average queue length (c) Average radar accuracy (d) Average packet drop Varying data arrival rate with poor channel quality, w 1 = 0.025, w 2 = 0.8, and w 3 = 0.5.\n\nFig. 9 :\n9Varying data arrival rate with strong channel quality, w 1 = 0.05, w 2 = 0.4, and w 3 Average queue length (c) Average radar accuracy (d) Average packet drop Fig. 10: Varying data arrival rate with strong channel quality, w 1 = 0.025, w 2 = 0.8, and w 3 = 0.5. It can be observed that our proposed algorithm (i.e., i-JCR) achieves the lowest average cost, up to 64.9% (equivalent to an decrease of 35.1%) compared with those of other policies. Similarly, i-JCR has the lowest average packet drop regardless of the packet arrival rate, and it consistently maintains the average number of packets in the queue as one of the lowest values.\n\n\nProcessing Interval (CPI). This paper considers a JCR waveform structure that consists of N IEEE 802.11ad frames in a CPI. The IEEE 802.11ad system can recognize this aggregated frame as the block/no acknowledgment policy[15].\n\n\nCreate target Q-networkQ with parameters θ − = θ.Algorithm 2 The i-JCR \n\n1: Initialize buffer E and ǫ. \n\n2: Create Q-network Q with arbitrary parameters θ. \n\n3: 4: for t = 1 to T do \n\n5: \n\n\n4 6 8 10 12 14 16 18 20\n4 6 8 10 12 14 16 18 20\n4 6 8 10 12 14 16 18 20\n\nVehicular communication systems: Enabling technologies, applications, and future outlook on intelligent transportation. P Papadimitratos, A Fortelle, K Evenssen, R Brignolo, S Cosenza, IEEE Communication Magazine. 4711P. Papadimitratos, A. La Fortelle, K. Evenssen, R. Brignolo, and S. Cosenza, \"Vehicular communication systems: Enabling technologies, applications, and future outlook on intelligent transportation,\" IEEE Communication Magazine, vol. 47, no. 11, pp. 84-95, Nov. 2009.\n\nAn overview of signal processing techniques for joint communication and radar sensing. J A Zhang, IEEE Journal of Selected Topics in Signal Processing. 156J. A. Zhang et al., \"An overview of signal processing techniques for joint communication and radar sensing,\" IEEE Journal of Selected Topics in Signal Processing, vol. 15, no. 6, pp. 1295-1315, Nov. 2021.\n\nIEEE 802.11bd & 5G NR V2X: Evolution of radio access technologies for V2X communications. G Naik, B Choudhury, J Park, IEEE Access. 7G. Naik, B. Choudhury and J. Park, \"IEEE 802.11bd & 5G NR V2X: Evolution of radio access technologies for V2X communications,\" IEEE Access, vol. 7, pp. 70169-70184, May 2019.\n\nDedicated short-range communications (DSRC) standards in the United States. J B Kenney, Proceedings of the IEEE. 997J. B. Kenney, \"Dedicated short-range communications (DSRC) standards in the United States,\" Proceedings of the IEEE, vol. 99, no. 7, pp. 1162-1182, Jul. 2011.\n\nAdaptive virtual waveform design for millimeter-wave joint communicationradar. P Kumari, S A Vorobyov, R W Heath, IEEE Transactions on Signal Processing. 68P. Kumari, S. A. Vorobyov and R. W. Heath, \"Adaptive virtual waveform design for millimeter-wave joint communication- radar,\" IEEE Transactions on Signal Processing, vol. 68, pp. 715-730, Nov. 2019.\n\nMillimeter-wave vehicular communication to support massive automotive sensing. J Choi, V Va, N Gonzalez-Prelcic, R Daniels, C R Bhat, R W HeathJr, IEEE Communication Magazine. 5412J. Choi, V. Va, N. Gonzalez-Prelcic, R. Daniels, C. R. Bhat, and R. W. Heath Jr., \"Millimeter-wave vehicular communication to support massive automotive sensing,\" IEEE Communication Magazine, vol. 54, no. 12, pp. 160-167, Dec. 2016.\n\nMillimeter-wave technology for automotive radar sensors in the 77 GHz frequency band. J Hasch, E Topak, R Schnabel, T Zwick, R Weigel, C Waldschmidt, IEEE Transactions on Microwave Theory and Techniques. 603J. Hasch, E. Topak, R. Schnabel, T. Zwick, R. Weigel, and C. Waldschmidt,\"Millimeter-wave technology for automotive radar sensors in the 77 GHz frequency band,\" IEEE Transactions on Microwave Theory and Techniques, vol. 60, no. 3, pp. 845-860, Mar. 2012.\n\nRadio resource management in joint radar and communication: A comprehensive survey. N C Luong, X Lu, D T Hoang, D Niyato, D I Kim, IEEE Communications Surveys & Tutorials. 232N. C. Luong, X. Lu, D. T. Hoang, D. Niyato and D. I. Kim,\"Radio resource management in joint radar and communication: A comprehensive survey,\" IEEE Communications Surveys & Tutorials, vol. 23, no. 2, pp. 780-814, Apr. 2021.\n\nInvestigating the IEEE 802.11ad Standard for Millimeter Wave Automotive Radar. P Kumari, N Gonzalez-Prelcic, R W HeathJr, Proceedings of Vehicular Technology Conference. Vehicular Technology ConferenceP. Kumari, N. Gonzalez-Prelcic, and R. W. Heath Jr, \"Investigating the IEEE 802.11ad Standard for Millimeter Wave Automotive Radar,\" in Proceedings of Vehicular Technology Conference, September 2015, pp. 3587-3591.\n\nOpportunistic radar in IEEE 802.11ad networks. E Grossi, M Lops, L Venturino, A Zappone, IEEE Transactions on Signal Processing. 669E. Grossi, M. Lops, L. Venturino, and A. Zappone, \"Opportunistic radar in IEEE 802.11ad networks,\" IEEE Transactions on Signal Processing, vol. 66, no. 9, pp. 2441-2454, May 2018.\n\nIEEE 802.11ad-based radar: An approach to joint vehicular communication-radar system. P Kumari, J Choi, N Gonzalez-Prelcic, R W Heath, IEEE Transactions on Vehicular Technology. 674P. Kumari, J. Choi, N. Gonzalez-Prelcic and R. W. Heath, \"IEEE 802.11ad-based radar: An approach to joint vehicular communication-radar system,\" IEEE Transactions on Vehicular Technology, vol. 67, no. 4, pp. 3012-3027, Nov. 2017.\n\nBeam alignment and tracking for autonomous vehicular communication using IEEE 802.11ad-based radar. G R Muns, K V Mishra, C B Guerra, Y C Eldar, K R Chowdhury, IEEE INFOCOM 2019 -IEEE Conference on Computer Communications Workshops. G. R. Muns, K. V. Mishra, C. B. Guerra, Y. C. Eldar and K. R. Chowdhury, \"Beam alignment and tracking for autonomous vehicular communication using IEEE 802.11ad-based radar,\" IEEE INFOCOM 2019 -IEEE Conference on Computer Communications Workshops, 2019, pp. 535-540.\n\nA mmWave automotive joint radar-communications system. S H Dokhanchi, B S Mysore, K V Mishra, B Ottersten, IEEE Trans. on Aerospace and Electronic Systems. S. H. Dokhanchi, B. S. Mysore, K. V. Mishra, and B. Ottersten, \"A mmWave automotive joint radar-communications system,\" IEEE Trans. on Aerospace and Electronic Systems, pp. 1241-1260, Feb. 2019.\n\nV Va, T Shimizu, G Bansal, R W HeathJr, Millimeter wave vehicular communications: A survey, Now: Foundations and Trends in Networking. 10V. Va, T. Shimizu, G. Bansal, and R. W. Heath Jr, Millimeter wave vehicular communications: A survey, Now: Foundations and Trends in Networking, vol. 10, no. 1, 2016.\n\nEnhancements for Very High Throughput in the 60 GHz Band. Wireless LAN Medium Access Control (MAC) and Physical Layer (PHY) Specifications. Amendment. 3IEEE Std. 802.11adWireless LAN Medium Access Control (MAC) and Physical Layer (PHY) Specifications. Amendment 3: Enhancements for Very High Throughput in the 60 GHz Band,\" IEEE Std. 802.11ad, 2012.\n\nM A Richard, Fundamentals of Radar Signal Processing. McGraw-Hill EducationM. A. Richard, Fundamentals of Radar Signal Processing, McGraw-Hill Education, 2014\n\nWideband millimeter-wave propagation measurements and channel models for future wireless communication system design. T S Rappaport, G R Maccartney, M K Samimi, S Sun, IEEE Trans. on Communications. 639T. S. Rappaport, G. R. MacCartney, M. K. Samimi, and S. Sun, \"Wideband millimeter-wave propagation measurements and channel models for future wireless communication system design,\" IEEE Trans. on Communications, vol. 63, no. 9, pp. 3029-3056, Sep. 2015.\n\nA new analytic approach to evaluation of packet error rate in wireless networks. R Khalili, K Salamatian, 3rd Annual Communication Networks and Services Research Conference (CNSR'05). R. Khalili and K. Salamatian, \"A new analytic approach to evaluation of packet error rate in wireless networks,\" 3rd Annual Communication Networks and Services Research Conference (CNSR'05), pp. 333-338, May 2005.\n\nFoundations of MIMO Communication. R W HeathJr, A Lozano, Cambridge University PressR. W. Heath Jr and A. Lozano, Foundations of MIMO Communication. Cambridge University Press, 2019.\n\nIntroduction to reinforcement learning. R S Sutton, A G Barto, MIT press135CambridgeR. S. Sutton and A. G. Barto, Introduction to reinforcement learning. Vol. 135. Cambridge: MIT press, 1998.\n\nQ-learning. C J C H Watkins, P Dayan, Machine Learning. 8C. J. C. H. Watkins and P. Dayan, \"Q-learning,\" Machine Learning, vol. 8, no. 3-4, pp. 279-292, 1992.\n\nDeep reinforcement learning with double Q-learning. H Hasselt, A Guez, D Silver, Proceedings of the Thirtieth AAAI Conference on Artificial Intelligence (AAAI'16). the Thirtieth AAAI Conference on Artificial Intelligence (AAAI'16)AAAI PressH. Hasselt, A. Guez, and D. Silver, \"Deep reinforcement learning with double Q-learning.\" in Proceedings of the Thirtieth AAAI Conference on Artificial Intelligence (AAAI'16), AAAI Press, 2016, pp. 2094-2100.\n\nHuman-level control through deep reinforcement learning. V Mnih, Nature. 5187540V. Mnih et al., \"Human-level control through deep reinforcement learning,\" Nature, vol. 518, no. 7540, pp. 529-533, Feb. 2015.\n\nDueling network architectures for deep reinforcement learning. Z Wang, Proceedings of The 33rd International Conference on Machine Learning. The 33rd International Conference on Machine LearningZ. Wang et al., \"Dueling network architectures for deep reinforcement learning,\" in Proceedings of The 33rd International Conference on Machine Learning, 2016, pp. 1995-2003.\n\nThe effect of correlated input data on the dynamics of learning. S Halkjear, O Winther, Proceedings of the 9th International Conference on Neural Information Processing Systems. the 9th International Conference on Neural Information Processing SystemsS. Halkjear and O. Winther, \"The effect of correlated input data on the dynamics of learning.\" in Proceedings of the 9th International Conference on Neural Information Processing Systems, 1996, pp. 169-175.\n\nGradient descent finds global minima of deep neural networks. S Du, J Lee, H Li, L Wang, X Zhai, Proceedings of the 36th International Conference on Machine Learning. the 36th International Conference on Machine LearningProceedings of Machine Learning ResearchS. Du, J. Lee, H. Li, L. Wang, and X. Zhai, \"Gradient descent finds global minima of deep neural networks,\" in Proceedings of the 36th International Conference on Machine Learning, in Proceedings of Machine Learning Research, 2019, pp. 1675- 1685.\n\nA stochastic approximation method. H Robbins, S Monro, Ann. Math. Stat. 223H. Robbins and S. Monro, \"A stochastic approximation method,\" Ann. Math. Stat., vol. 22, no. 3, pp. 400-407, 1951.\n\nPerformance evaluation of IEEE 802.11ad in evolving Wi-Fi networks. K Nguyen, M G Kibria, K Ishizu, F Kojima, Wireless Communications and Mobile Computing. 2019K. Nguyen, M. G. Kibria, K. Ishizu, and F. Kojima, \"Performance evaluation of IEEE 802.11ad in evolving Wi-Fi networks\", Wireless Communications and Mobile Computing, vol. 2019, Feb. 2019.\n\nDeep learning. I Goodfellow, Y Bengio, A Courville, MIT pressI. Goodfellow, Y. Bengio, and A. Courville. Deep learning. MIT press, 2016.\n\nArtificial Intelligence & Autopilot. Accessed onTesla, \"Artificial Intelligence & Autopilot.\" Accessed on: Jan. 19, 2021. [Online]. Available: https://www.tesla.com/en AU/AI\n\nALVINN: an autonomous land vehicle in a neural network. D A Pomerleau, Advances in neural information processing systems 1. San Francisco, CA, USAMorgan Kaufmann Publishers IncD. A. Pomerleau, \"ALVINN: an autonomous land vehicle in a neural network,\" in Advances in neural information processing systems 1, Morgan Kaufmann Publishers Inc., San Francisco, CA, USA, 1989, pp. 305-313.\n", "annotations": {"author": "[{\"end\":122,\"start\":112},{\"end\":164,\"start\":123},{\"end\":176,\"start\":165},{\"end\":192,\"start\":177},{\"end\":227,\"start\":193},{\"end\":272,\"start\":228},{\"end\":283,\"start\":273},{\"end\":302,\"start\":284},{\"end\":314,\"start\":303},{\"end\":331,\"start\":315},{\"end\":417,\"start\":332},{\"end\":510,\"start\":418},{\"end\":556,\"start\":511},{\"end\":122,\"start\":112},{\"end\":164,\"start\":123},{\"end\":176,\"start\":165},{\"end\":192,\"start\":177},{\"end\":227,\"start\":193},{\"end\":272,\"start\":228},{\"end\":283,\"start\":273},{\"end\":302,\"start\":284},{\"end\":314,\"start\":303},{\"end\":331,\"start\":315},{\"end\":417,\"start\":332},{\"end\":510,\"start\":418},{\"end\":556,\"start\":511}]", "publisher": null, "author_last_name": "[{\"end\":121,\"start\":118},{\"end\":140,\"start\":134},{\"end\":175,\"start\":170},{\"end\":191,\"start\":187},{\"end\":206,\"start\":201},{\"end\":243,\"start\":233},{\"end\":282,\"start\":279},{\"end\":301,\"start\":295},{\"end\":313,\"start\":308},{\"end\":330,\"start\":320},{\"end\":121,\"start\":118},{\"end\":140,\"start\":134},{\"end\":175,\"start\":170},{\"end\":191,\"start\":187},{\"end\":206,\"start\":201},{\"end\":243,\"start\":233},{\"end\":282,\"start\":279},{\"end\":301,\"start\":295},{\"end\":313,\"start\":308},{\"end\":330,\"start\":320}]", "author_first_name": "[{\"end\":115,\"start\":112},{\"end\":117,\"start\":116},{\"end\":131,\"start\":127},{\"end\":133,\"start\":132},{\"end\":169,\"start\":165},{\"end\":186,\"start\":177},{\"end\":200,\"start\":193},{\"end\":232,\"start\":228},{\"end\":276,\"start\":273},{\"end\":278,\"start\":277},{\"end\":292,\"start\":288},{\"end\":294,\"start\":293},{\"end\":307,\"start\":303},{\"end\":319,\"start\":315},{\"end\":115,\"start\":112},{\"end\":117,\"start\":116},{\"end\":131,\"start\":127},{\"end\":133,\"start\":132},{\"end\":169,\"start\":165},{\"end\":186,\"start\":177},{\"end\":200,\"start\":193},{\"end\":232,\"start\":228},{\"end\":276,\"start\":273},{\"end\":278,\"start\":277},{\"end\":292,\"start\":288},{\"end\":294,\"start\":293},{\"end\":307,\"start\":303},{\"end\":319,\"start\":315}]", "author_affiliation": "[{\"end\":416,\"start\":333},{\"end\":509,\"start\":419},{\"end\":555,\"start\":512},{\"end\":416,\"start\":333},{\"end\":509,\"start\":419},{\"end\":555,\"start\":512}]", "title": "[{\"end\":98,\"start\":1},{\"end\":654,\"start\":557},{\"end\":98,\"start\":1},{\"end\":654,\"start\":557}]", "venue": null, "abstract": "[{\"end\":9979,\"start\":918},{\"end\":9979,\"start\":918}]", "bib_ref": "[{\"attributes\":{\"ref_id\":\"b4\"},\"end\":10421,\"start\":10418},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":11159,\"start\":11156},{\"attributes\":{\"ref_id\":\"b8\"},\"end\":11164,\"start\":11161},{\"attributes\":{\"ref_id\":\"b12\"},\"end\":11170,\"start\":11166},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":13123,\"start\":13120},{\"attributes\":{\"ref_id\":\"b8\"},\"end\":13128,\"start\":13125},{\"attributes\":{\"ref_id\":\"b11\"},\"end\":13134,\"start\":13130},{\"attributes\":{\"ref_id\":\"b21\"},\"end\":14006,\"start\":14002},{\"attributes\":{\"ref_id\":\"b22\"},\"end\":14535,\"start\":14531},{\"attributes\":{\"ref_id\":\"b21\"},\"end\":14615,\"start\":14611},{\"attributes\":{\"ref_id\":\"b23\"},\"end\":14826,\"start\":14822},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":16664,\"start\":16661},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":16670,\"start\":16666},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":18020,\"start\":18016},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":18191,\"start\":18188},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":18197,\"start\":18193},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":18432,\"start\":18429},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":18660,\"start\":18656},{\"attributes\":{\"ref_id\":\"b18\"},\"end\":19126,\"start\":19122},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":19409,\"start\":19406},{\"attributes\":{\"ref_id\":\"b13\"},\"end\":19415,\"start\":19411},{\"attributes\":{\"ref_id\":\"b18\"},\"end\":19917,\"start\":19913},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":20642,\"start\":20639},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":20648,\"start\":20644},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":20792,\"start\":20789},{\"attributes\":{\"ref_id\":\"b6\"},\"end\":21309,\"start\":21306},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":21334,\"start\":21330},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":21785,\"start\":21782},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":22527,\"start\":22523},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":22533,\"start\":22529},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":22786,\"start\":22782},{\"attributes\":{\"ref_id\":\"b6\"},\"end\":22965,\"start\":22962},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":27124,\"start\":27120},{\"attributes\":{\"ref_id\":\"b17\"},\"end\":27436,\"start\":27432},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":30298,\"start\":30294},{\"attributes\":{\"ref_id\":\"b19\"},\"end\":33620,\"start\":33616},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":34892,\"start\":34888},{\"attributes\":{\"ref_id\":\"b20\"},\"end\":34990,\"start\":34986},{\"attributes\":{\"ref_id\":\"b21\"},\"end\":35642,\"start\":35638},{\"attributes\":{\"ref_id\":\"b22\"},\"end\":36304,\"start\":36300},{\"attributes\":{\"ref_id\":\"b22\"},\"end\":36614,\"start\":36610},{\"attributes\":{\"ref_id\":\"b21\"},\"end\":36652,\"start\":36648},{\"attributes\":{\"ref_id\":\"b23\"},\"end\":36686,\"start\":36682},{\"attributes\":{\"ref_id\":\"b24\"},\"end\":37374,\"start\":37370},{\"attributes\":{\"ref_id\":\"b5\"},\"end\":38534,\"start\":38533},{\"attributes\":{\"ref_id\":\"b12\"},\"end\":38925,\"start\":38923},{\"attributes\":{\"ref_id\":\"b18\"},\"end\":39270,\"start\":39266},{\"attributes\":{\"ref_id\":\"b18\"},\"end\":39545,\"start\":39541},{\"attributes\":{\"ref_id\":\"b19\"},\"end\":39599,\"start\":39595},{\"attributes\":{\"ref_id\":\"b23\"},\"end\":39950,\"start\":39946},{\"attributes\":{\"ref_id\":\"b19\"},\"end\":40170,\"start\":40166},{\"attributes\":{\"ref_id\":\"b23\"},\"end\":40214,\"start\":40210},{\"attributes\":{\"ref_id\":\"b21\"},\"end\":40388,\"start\":40384},{\"attributes\":{\"ref_id\":\"b25\"},\"end\":41239,\"start\":41235},{\"end\":41478,\"start\":41475},{\"attributes\":{\"ref_id\":\"b23\"},\"end\":41846,\"start\":41842},{\"attributes\":{\"ref_id\":\"b26\"},\"end\":41900,\"start\":41896},{\"attributes\":{\"ref_id\":\"b22\"},\"end\":42129,\"start\":42125},{\"attributes\":{\"ref_id\":\"b28\"},\"end\":42912,\"start\":42908},{\"attributes\":{\"ref_id\":\"b29\"},\"end\":43594,\"start\":43590},{\"attributes\":{\"ref_id\":\"b30\"},\"end\":43610,\"start\":43606},{\"attributes\":{\"ref_id\":\"b27\"},\"end\":44725,\"start\":44721},{\"attributes\":{\"ref_id\":\"b17\"},\"end\":45093,\"start\":45089},{\"attributes\":{\"ref_id\":\"b21\"},\"end\":46133,\"start\":46129},{\"attributes\":{\"ref_id\":\"b23\"},\"end\":46139,\"start\":46135},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":58918,\"start\":58914},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":10421,\"start\":10418},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":11159,\"start\":11156},{\"attributes\":{\"ref_id\":\"b8\"},\"end\":11164,\"start\":11161},{\"attributes\":{\"ref_id\":\"b12\"},\"end\":11170,\"start\":11166},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":13123,\"start\":13120},{\"attributes\":{\"ref_id\":\"b8\"},\"end\":13128,\"start\":13125},{\"attributes\":{\"ref_id\":\"b11\"},\"end\":13134,\"start\":13130},{\"attributes\":{\"ref_id\":\"b21\"},\"end\":14006,\"start\":14002},{\"attributes\":{\"ref_id\":\"b22\"},\"end\":14535,\"start\":14531},{\"attributes\":{\"ref_id\":\"b21\"},\"end\":14615,\"start\":14611},{\"attributes\":{\"ref_id\":\"b23\"},\"end\":14826,\"start\":14822},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":16664,\"start\":16661},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":16670,\"start\":16666},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":18020,\"start\":18016},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":18191,\"start\":18188},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":18197,\"start\":18193},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":18432,\"start\":18429},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":18660,\"start\":18656},{\"attributes\":{\"ref_id\":\"b18\"},\"end\":19126,\"start\":19122},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":19409,\"start\":19406},{\"attributes\":{\"ref_id\":\"b13\"},\"end\":19415,\"start\":19411},{\"attributes\":{\"ref_id\":\"b18\"},\"end\":19917,\"start\":19913},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":20642,\"start\":20639},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":20648,\"start\":20644},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":20792,\"start\":20789},{\"attributes\":{\"ref_id\":\"b6\"},\"end\":21309,\"start\":21306},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":21334,\"start\":21330},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":21785,\"start\":21782},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":22527,\"start\":22523},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":22533,\"start\":22529},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":22786,\"start\":22782},{\"attributes\":{\"ref_id\":\"b6\"},\"end\":22965,\"start\":22962},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":27124,\"start\":27120},{\"attributes\":{\"ref_id\":\"b17\"},\"end\":27436,\"start\":27432},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":30298,\"start\":30294},{\"attributes\":{\"ref_id\":\"b19\"},\"end\":33620,\"start\":33616},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":34892,\"start\":34888},{\"attributes\":{\"ref_id\":\"b20\"},\"end\":34990,\"start\":34986},{\"attributes\":{\"ref_id\":\"b21\"},\"end\":35642,\"start\":35638},{\"attributes\":{\"ref_id\":\"b22\"},\"end\":36304,\"start\":36300},{\"attributes\":{\"ref_id\":\"b22\"},\"end\":36614,\"start\":36610},{\"attributes\":{\"ref_id\":\"b21\"},\"end\":36652,\"start\":36648},{\"attributes\":{\"ref_id\":\"b23\"},\"end\":36686,\"start\":36682},{\"attributes\":{\"ref_id\":\"b24\"},\"end\":37374,\"start\":37370},{\"attributes\":{\"ref_id\":\"b5\"},\"end\":38534,\"start\":38533},{\"attributes\":{\"ref_id\":\"b12\"},\"end\":38925,\"start\":38923},{\"attributes\":{\"ref_id\":\"b18\"},\"end\":39270,\"start\":39266},{\"attributes\":{\"ref_id\":\"b18\"},\"end\":39545,\"start\":39541},{\"attributes\":{\"ref_id\":\"b19\"},\"end\":39599,\"start\":39595},{\"attributes\":{\"ref_id\":\"b23\"},\"end\":39950,\"start\":39946},{\"attributes\":{\"ref_id\":\"b19\"},\"end\":40170,\"start\":40166},{\"attributes\":{\"ref_id\":\"b23\"},\"end\":40214,\"start\":40210},{\"attributes\":{\"ref_id\":\"b21\"},\"end\":40388,\"start\":40384},{\"attributes\":{\"ref_id\":\"b25\"},\"end\":41239,\"start\":41235},{\"end\":41478,\"start\":41475},{\"attributes\":{\"ref_id\":\"b23\"},\"end\":41846,\"start\":41842},{\"attributes\":{\"ref_id\":\"b26\"},\"end\":41900,\"start\":41896},{\"attributes\":{\"ref_id\":\"b22\"},\"end\":42129,\"start\":42125},{\"attributes\":{\"ref_id\":\"b28\"},\"end\":42912,\"start\":42908},{\"attributes\":{\"ref_id\":\"b29\"},\"end\":43594,\"start\":43590},{\"attributes\":{\"ref_id\":\"b30\"},\"end\":43610,\"start\":43606},{\"attributes\":{\"ref_id\":\"b27\"},\"end\":44725,\"start\":44721},{\"attributes\":{\"ref_id\":\"b17\"},\"end\":45093,\"start\":45089},{\"attributes\":{\"ref_id\":\"b21\"},\"end\":46133,\"start\":46129},{\"attributes\":{\"ref_id\":\"b23\"},\"end\":46139,\"start\":46135},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":58918,\"start\":58914}]", "figure": "[{\"attributes\":{\"id\":\"fig_0\"},\"end\":55464,\"start\":55097},{\"attributes\":{\"id\":\"fig_1\"},\"end\":55846,\"start\":55465},{\"attributes\":{\"id\":\"fig_2\"},\"end\":56044,\"start\":55847},{\"attributes\":{\"id\":\"fig_3\"},\"end\":56113,\"start\":56045},{\"attributes\":{\"id\":\"fig_4\"},\"end\":56287,\"start\":56114},{\"attributes\":{\"id\":\"fig_5\"},\"end\":56511,\"start\":56288},{\"attributes\":{\"id\":\"fig_6\"},\"end\":58042,\"start\":56512},{\"attributes\":{\"id\":\"fig_7\"},\"end\":58690,\"start\":58043},{\"attributes\":{\"id\":\"tab_0\",\"type\":\"table\"},\"end\":58919,\"start\":58691},{\"attributes\":{\"id\":\"tab_2\",\"type\":\"table\"},\"end\":59111,\"start\":58920},{\"attributes\":{\"id\":\"fig_0\"},\"end\":55464,\"start\":55097},{\"attributes\":{\"id\":\"fig_1\"},\"end\":55846,\"start\":55465},{\"attributes\":{\"id\":\"fig_2\"},\"end\":56044,\"start\":55847},{\"attributes\":{\"id\":\"fig_3\"},\"end\":56113,\"start\":56045},{\"attributes\":{\"id\":\"fig_4\"},\"end\":56287,\"start\":56114},{\"attributes\":{\"id\":\"fig_5\"},\"end\":56511,\"start\":56288},{\"attributes\":{\"id\":\"fig_6\"},\"end\":58042,\"start\":56512},{\"attributes\":{\"id\":\"fig_7\"},\"end\":58690,\"start\":58043},{\"attributes\":{\"id\":\"tab_0\",\"type\":\"table\"},\"end\":58919,\"start\":58691},{\"attributes\":{\"id\":\"tab_2\",\"type\":\"table\"},\"end\":59111,\"start\":58920}]", "paragraph": "[{\"end\":11108,\"start\":9981},{\"end\":12773,\"start\":11110},{\"end\":14867,\"start\":12775},{\"end\":15164,\"start\":14869},{\"end\":15525,\"start\":15166},{\"end\":15850,\"start\":15527},{\"end\":17025,\"start\":15871},{\"end\":17603,\"start\":17027},{\"end\":18661,\"start\":17605},{\"end\":18943,\"start\":18663},{\"end\":19127,\"start\":18945},{\"end\":19305,\"start\":19189},{\"end\":19660,\"start\":19307},{\"end\":19918,\"start\":19691},{\"end\":20463,\"start\":19959},{\"end\":20793,\"start\":20465},{\"end\":20978,\"start\":20857},{\"end\":21368,\"start\":21002},{\"end\":21651,\"start\":21370},{\"end\":21786,\"start\":21653},{\"end\":22094,\"start\":21847},{\"end\":22534,\"start\":22272},{\"end\":22787,\"start\":22565},{\"end\":22966,\"start\":22807},{\"end\":23299,\"start\":22993},{\"end\":23388,\"start\":23301},{\"end\":23486,\"start\":23390},{\"end\":23683,\"start\":23488},{\"end\":23978,\"start\":23685},{\"end\":24479,\"start\":23980},{\"end\":24847,\"start\":24481},{\"end\":25246,\"start\":24849},{\"end\":25995,\"start\":25275},{\"end\":26498,\"start\":26014},{\"end\":26595,\"start\":26500},{\"end\":26934,\"start\":26597},{\"end\":27125,\"start\":26936},{\"end\":27568,\"start\":27127},{\"end\":27974,\"start\":27648},{\"end\":28089,\"start\":27994},{\"end\":28539,\"start\":28091},{\"end\":29121,\"start\":28562},{\"end\":29701,\"start\":29144},{\"end\":30024,\"start\":29703},{\"end\":30543,\"start\":30081},{\"end\":30809,\"start\":30575},{\"end\":31190,\"start\":30870},{\"end\":31339,\"start\":31192},{\"end\":31437,\"start\":31341},{\"end\":32069,\"start\":31439},{\"end\":32965,\"start\":32143},{\"end\":33117,\"start\":33027},{\"end\":33457,\"start\":33198},{\"end\":33621,\"start\":33514},{\"end\":33827,\"start\":33698},{\"end\":34019,\"start\":33829},{\"end\":34126,\"start\":34021},{\"end\":34221,\"start\":34190},{\"end\":34225,\"start\":34223},{\"end\":34326,\"start\":34227},{\"end\":34542,\"start\":34341},{\"end\":34586,\"start\":34544},{\"end\":34991,\"start\":34735},{\"end\":36062,\"start\":35049},{\"end\":37003,\"start\":36141},{\"end\":38052,\"start\":37005},{\"end\":38195,\"start\":38054},{\"end\":38535,\"start\":38197},{\"end\":38600,\"start\":38537},{\"end\":38645,\"start\":38607},{\"end\":38747,\"start\":38652},{\"end\":38818,\"start\":38754},{\"end\":38867,\"start\":38826},{\"end\":38884,\"start\":38875},{\"end\":39033,\"start\":38892},{\"end\":39160,\"start\":39035},{\"end\":39254,\"start\":39162},{\"end\":39601,\"start\":39256},{\"end\":39698,\"start\":39603},{\"end\":40215,\"start\":39700},{\"end\":40770,\"start\":40284},{\"end\":40940,\"start\":40840},{\"end\":41069,\"start\":40997},{\"end\":41299,\"start\":41071},{\"end\":41396,\"start\":41350},{\"end\":41744,\"start\":41431},{\"end\":42473,\"start\":41746},{\"end\":43702,\"start\":42514},{\"end\":44409,\"start\":43759},{\"end\":44876,\"start\":44411},{\"end\":44967,\"start\":44878},{\"end\":46042,\"start\":44969},{\"end\":46140,\"start\":46044},{\"end\":46236,\"start\":46142},{\"end\":46613,\"start\":46238},{\"end\":47073,\"start\":46615},{\"end\":47941,\"start\":47099},{\"end\":49217,\"start\":47966},{\"end\":49583,\"start\":49219},{\"end\":50256,\"start\":49585},{\"end\":51300,\"start\":50258},{\"end\":51490,\"start\":51302},{\"end\":52816,\"start\":51492},{\"end\":53409,\"start\":52818},{\"end\":54175,\"start\":53411},{\"end\":55096,\"start\":54194},{\"end\":11108,\"start\":9981},{\"end\":12773,\"start\":11110},{\"end\":14867,\"start\":12775},{\"end\":15164,\"start\":14869},{\"end\":15525,\"start\":15166},{\"end\":15850,\"start\":15527},{\"end\":17025,\"start\":15871},{\"end\":17603,\"start\":17027},{\"end\":18661,\"start\":17605},{\"end\":18943,\"start\":18663},{\"end\":19127,\"start\":18945},{\"end\":19305,\"start\":19189},{\"end\":19660,\"start\":19307},{\"end\":19918,\"start\":19691},{\"end\":20463,\"start\":19959},{\"end\":20793,\"start\":20465},{\"end\":20978,\"start\":20857},{\"end\":21368,\"start\":21002},{\"end\":21651,\"start\":21370},{\"end\":21786,\"start\":21653},{\"end\":22094,\"start\":21847},{\"end\":22534,\"start\":22272},{\"end\":22787,\"start\":22565},{\"end\":22966,\"start\":22807},{\"end\":23299,\"start\":22993},{\"end\":23388,\"start\":23301},{\"end\":23486,\"start\":23390},{\"end\":23683,\"start\":23488},{\"end\":23978,\"start\":23685},{\"end\":24479,\"start\":23980},{\"end\":24847,\"start\":24481},{\"end\":25246,\"start\":24849},{\"end\":25995,\"start\":25275},{\"end\":26498,\"start\":26014},{\"end\":26595,\"start\":26500},{\"end\":26934,\"start\":26597},{\"end\":27125,\"start\":26936},{\"end\":27568,\"start\":27127},{\"end\":27974,\"start\":27648},{\"end\":28089,\"start\":27994},{\"end\":28539,\"start\":28091},{\"end\":29121,\"start\":28562},{\"end\":29701,\"start\":29144},{\"end\":30024,\"start\":29703},{\"end\":30543,\"start\":30081},{\"end\":30809,\"start\":30575},{\"end\":31190,\"start\":30870},{\"end\":31339,\"start\":31192},{\"end\":31437,\"start\":31341},{\"end\":32069,\"start\":31439},{\"end\":32965,\"start\":32143},{\"end\":33117,\"start\":33027},{\"end\":33457,\"start\":33198},{\"end\":33621,\"start\":33514},{\"end\":33827,\"start\":33698},{\"end\":34019,\"start\":33829},{\"end\":34126,\"start\":34021},{\"end\":34221,\"start\":34190},{\"end\":34225,\"start\":34223},{\"end\":34326,\"start\":34227},{\"end\":34542,\"start\":34341},{\"end\":34586,\"start\":34544},{\"end\":34991,\"start\":34735},{\"end\":36062,\"start\":35049},{\"end\":37003,\"start\":36141},{\"end\":38052,\"start\":37005},{\"end\":38195,\"start\":38054},{\"end\":38535,\"start\":38197},{\"end\":38600,\"start\":38537},{\"end\":38645,\"start\":38607},{\"end\":38747,\"start\":38652},{\"end\":38818,\"start\":38754},{\"end\":38867,\"start\":38826},{\"end\":38884,\"start\":38875},{\"end\":39033,\"start\":38892},{\"end\":39160,\"start\":39035},{\"end\":39254,\"start\":39162},{\"end\":39601,\"start\":39256},{\"end\":39698,\"start\":39603},{\"end\":40215,\"start\":39700},{\"end\":40770,\"start\":40284},{\"end\":40940,\"start\":40840},{\"end\":41069,\"start\":40997},{\"end\":41299,\"start\":41071},{\"end\":41396,\"start\":41350},{\"end\":41744,\"start\":41431},{\"end\":42473,\"start\":41746},{\"end\":43702,\"start\":42514},{\"end\":44409,\"start\":43759},{\"end\":44876,\"start\":44411},{\"end\":44967,\"start\":44878},{\"end\":46042,\"start\":44969},{\"end\":46140,\"start\":46044},{\"end\":46236,\"start\":46142},{\"end\":46613,\"start\":46238},{\"end\":47073,\"start\":46615},{\"end\":47941,\"start\":47099},{\"end\":49217,\"start\":47966},{\"end\":49583,\"start\":49219},{\"end\":50256,\"start\":49585},{\"end\":51300,\"start\":50258},{\"end\":51490,\"start\":51302},{\"end\":52816,\"start\":51492},{\"end\":53409,\"start\":52818},{\"end\":54175,\"start\":53411},{\"end\":55096,\"start\":54194}]", "formula": "[{\"attributes\":{\"id\":\"formula_0\"},\"end\":19188,\"start\":19128},{\"attributes\":{\"id\":\"formula_1\"},\"end\":19958,\"start\":19919},{\"attributes\":{\"id\":\"formula_2\"},\"end\":20856,\"start\":20794},{\"attributes\":{\"id\":\"formula_3\"},\"end\":21846,\"start\":21787},{\"attributes\":{\"id\":\"formula_4\"},\"end\":22135,\"start\":22095},{\"attributes\":{\"id\":\"formula_5\"},\"end\":22271,\"start\":22135},{\"attributes\":{\"id\":\"formula_6\"},\"end\":22806,\"start\":22788},{\"attributes\":{\"id\":\"formula_7\"},\"end\":22992,\"start\":22967},{\"attributes\":{\"id\":\"formula_8\"},\"end\":27591,\"start\":27569},{\"attributes\":{\"id\":\"formula_9\"},\"end\":27647,\"start\":27591},{\"attributes\":{\"id\":\"formula_10\"},\"end\":28561,\"start\":28540},{\"attributes\":{\"id\":\"formula_11\"},\"end\":30080,\"start\":30025},{\"attributes\":{\"id\":\"formula_12\"},\"end\":30869,\"start\":30810},{\"attributes\":{\"id\":\"formula_13\"},\"end\":33197,\"start\":33118},{\"attributes\":{\"id\":\"formula_14\"},\"end\":33513,\"start\":33458},{\"attributes\":{\"id\":\"formula_15\"},\"end\":33697,\"start\":33622},{\"attributes\":{\"id\":\"formula_16\"},\"end\":34189,\"start\":34127},{\"attributes\":{\"id\":\"formula_18\"},\"end\":34734,\"start\":34587},{\"attributes\":{\"id\":\"formula_19\"},\"end\":35048,\"start\":34992},{\"attributes\":{\"id\":\"formula_23\"},\"end\":40283,\"start\":40216},{\"attributes\":{\"id\":\"formula_24\"},\"end\":40839,\"start\":40771},{\"attributes\":{\"id\":\"formula_25\"},\"end\":40996,\"start\":40941},{\"attributes\":{\"id\":\"formula_26\"},\"end\":41349,\"start\":41300},{\"attributes\":{\"id\":\"formula_27\"},\"end\":41430,\"start\":41397},{\"attributes\":{\"id\":\"formula_0\"},\"end\":19188,\"start\":19128},{\"attributes\":{\"id\":\"formula_1\"},\"end\":19958,\"start\":19919},{\"attributes\":{\"id\":\"formula_2\"},\"end\":20856,\"start\":20794},{\"attributes\":{\"id\":\"formula_3\"},\"end\":21846,\"start\":21787},{\"attributes\":{\"id\":\"formula_4\"},\"end\":22135,\"start\":22095},{\"attributes\":{\"id\":\"formula_5\"},\"end\":22271,\"start\":22135},{\"attributes\":{\"id\":\"formula_6\"},\"end\":22806,\"start\":22788},{\"attributes\":{\"id\":\"formula_7\"},\"end\":22992,\"start\":22967},{\"attributes\":{\"id\":\"formula_8\"},\"end\":27591,\"start\":27569},{\"attributes\":{\"id\":\"formula_9\"},\"end\":27647,\"start\":27591},{\"attributes\":{\"id\":\"formula_10\"},\"end\":28561,\"start\":28540},{\"attributes\":{\"id\":\"formula_11\"},\"end\":30080,\"start\":30025},{\"attributes\":{\"id\":\"formula_12\"},\"end\":30869,\"start\":30810},{\"attributes\":{\"id\":\"formula_13\"},\"end\":33197,\"start\":33118},{\"attributes\":{\"id\":\"formula_14\"},\"end\":33513,\"start\":33458},{\"attributes\":{\"id\":\"formula_15\"},\"end\":33697,\"start\":33622},{\"attributes\":{\"id\":\"formula_16\"},\"end\":34189,\"start\":34127},{\"attributes\":{\"id\":\"formula_18\"},\"end\":34734,\"start\":34587},{\"attributes\":{\"id\":\"formula_19\"},\"end\":35048,\"start\":34992},{\"attributes\":{\"id\":\"formula_23\"},\"end\":40283,\"start\":40216},{\"attributes\":{\"id\":\"formula_24\"},\"end\":40839,\"start\":40771},{\"attributes\":{\"id\":\"formula_25\"},\"end\":40996,\"start\":40941},{\"attributes\":{\"id\":\"formula_26\"},\"end\":41349,\"start\":41300},{\"attributes\":{\"id\":\"formula_27\"},\"end\":41430,\"start\":41397}]", "table_ref": null, "section_header": "[{\"end\":15869,\"start\":15853},{\"end\":19689,\"start\":19663},{\"end\":21000,\"start\":20981},{\"end\":22563,\"start\":22537},{\"end\":25273,\"start\":25249},{\"end\":26012,\"start\":25998},{\"end\":27992,\"start\":27977},{\"end\":29142,\"start\":29124},{\"end\":30573,\"start\":30546},{\"end\":32141,\"start\":32072},{\"end\":33025,\"start\":32968},{\"end\":34339,\"start\":34329},{\"end\":36139,\"start\":36065},{\"end\":38605,\"start\":38603},{\"end\":38650,\"start\":38648},{\"end\":38752,\"start\":38750},{\"end\":38824,\"start\":38821},{\"end\":38873,\"start\":38870},{\"end\":38890,\"start\":38887},{\"end\":42512,\"start\":42476},{\"end\":43730,\"start\":43705},{\"end\":43757,\"start\":43733},{\"end\":47097,\"start\":47076},{\"end\":47964,\"start\":47944},{\"end\":54192,\"start\":54178},{\"end\":55107,\"start\":55098},{\"end\":55856,\"start\":55848},{\"end\":56047,\"start\":56046},{\"end\":56123,\"start\":56115},{\"end\":56297,\"start\":56289},{\"end\":56545,\"start\":56513},{\"end\":58052,\"start\":58044},{\"end\":15869,\"start\":15853},{\"end\":19689,\"start\":19663},{\"end\":21000,\"start\":20981},{\"end\":22563,\"start\":22537},{\"end\":25273,\"start\":25249},{\"end\":26012,\"start\":25998},{\"end\":27992,\"start\":27977},{\"end\":29142,\"start\":29124},{\"end\":30573,\"start\":30546},{\"end\":32141,\"start\":32072},{\"end\":33025,\"start\":32968},{\"end\":34339,\"start\":34329},{\"end\":36139,\"start\":36065},{\"end\":38605,\"start\":38603},{\"end\":38650,\"start\":38648},{\"end\":38752,\"start\":38750},{\"end\":38824,\"start\":38821},{\"end\":38873,\"start\":38870},{\"end\":38890,\"start\":38887},{\"end\":42512,\"start\":42476},{\"end\":43730,\"start\":43705},{\"end\":43757,\"start\":43733},{\"end\":47097,\"start\":47076},{\"end\":47964,\"start\":47944},{\"end\":54192,\"start\":54178},{\"end\":55107,\"start\":55098},{\"end\":55856,\"start\":55848},{\"end\":56047,\"start\":56046},{\"end\":56123,\"start\":56115},{\"end\":56297,\"start\":56289},{\"end\":56545,\"start\":56513},{\"end\":58052,\"start\":58044}]", "table": "[{\"end\":59111,\"start\":58971},{\"end\":59111,\"start\":58971}]", "figure_caption": "[{\"end\":55464,\"start\":55109},{\"end\":55846,\"start\":55467},{\"end\":56044,\"start\":55858},{\"end\":56113,\"start\":56048},{\"end\":56287,\"start\":56125},{\"end\":56511,\"start\":56299},{\"end\":58042,\"start\":56550},{\"end\":58690,\"start\":58054},{\"end\":58919,\"start\":58693},{\"end\":58971,\"start\":58922},{\"end\":55464,\"start\":55109},{\"end\":55846,\"start\":55467},{\"end\":56044,\"start\":55858},{\"end\":56113,\"start\":56048},{\"end\":56287,\"start\":56125},{\"end\":56511,\"start\":56299},{\"end\":58042,\"start\":56550},{\"end\":58690,\"start\":58054},{\"end\":58919,\"start\":58693},{\"end\":58971,\"start\":58922}]", "figure_ref": "[{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":16490,\"start\":16484},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":18508,\"start\":18501},{\"attributes\":{\"ref_id\":\"fig_2\"},\"end\":38450,\"start\":38444},{\"attributes\":{\"ref_id\":\"fig_4\"},\"end\":42472,\"start\":42466},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":44098,\"start\":44092},{\"attributes\":{\"ref_id\":\"fig_5\"},\"end\":47450,\"start\":47444},{\"end\":48175,\"start\":48169},{\"end\":48321,\"start\":48311},{\"end\":48613,\"start\":48603},{\"end\":49216,\"start\":49206},{\"end\":49432,\"start\":49426},{\"end\":49796,\"start\":49786},{\"end\":50658,\"start\":50648},{\"end\":51501,\"start\":51495},{\"end\":52274,\"start\":52264},{\"end\":52427,\"start\":52421},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":16490,\"start\":16484},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":18508,\"start\":18501},{\"attributes\":{\"ref_id\":\"fig_2\"},\"end\":38450,\"start\":38444},{\"attributes\":{\"ref_id\":\"fig_4\"},\"end\":42472,\"start\":42466},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":44098,\"start\":44092},{\"attributes\":{\"ref_id\":\"fig_5\"},\"end\":47450,\"start\":47444},{\"end\":48175,\"start\":48169},{\"end\":48321,\"start\":48311},{\"end\":48613,\"start\":48603},{\"end\":49216,\"start\":49206},{\"end\":49432,\"start\":49426},{\"end\":49796,\"start\":49786},{\"end\":50658,\"start\":50648},{\"end\":51501,\"start\":51495},{\"end\":52274,\"start\":52264},{\"end\":52427,\"start\":52421}]", "bib_author_first_name": "[{\"end\":59306,\"start\":59305},{\"end\":59324,\"start\":59323},{\"end\":59336,\"start\":59335},{\"end\":59348,\"start\":59347},{\"end\":59360,\"start\":59359},{\"end\":59759,\"start\":59758},{\"end\":59761,\"start\":59760},{\"end\":60123,\"start\":60122},{\"end\":60131,\"start\":60130},{\"end\":60144,\"start\":60143},{\"end\":60418,\"start\":60417},{\"end\":60420,\"start\":60419},{\"end\":60697,\"start\":60696},{\"end\":60707,\"start\":60706},{\"end\":60709,\"start\":60708},{\"end\":60721,\"start\":60720},{\"end\":60723,\"start\":60722},{\"end\":61053,\"start\":61052},{\"end\":61061,\"start\":61060},{\"end\":61067,\"start\":61066},{\"end\":61087,\"start\":61086},{\"end\":61098,\"start\":61097},{\"end\":61100,\"start\":61099},{\"end\":61108,\"start\":61107},{\"end\":61110,\"start\":61109},{\"end\":61474,\"start\":61473},{\"end\":61483,\"start\":61482},{\"end\":61492,\"start\":61491},{\"end\":61504,\"start\":61503},{\"end\":61513,\"start\":61512},{\"end\":61523,\"start\":61522},{\"end\":61935,\"start\":61934},{\"end\":61937,\"start\":61936},{\"end\":61946,\"start\":61945},{\"end\":61952,\"start\":61951},{\"end\":61954,\"start\":61953},{\"end\":61963,\"start\":61962},{\"end\":61973,\"start\":61972},{\"end\":61975,\"start\":61974},{\"end\":62330,\"start\":62329},{\"end\":62340,\"start\":62339},{\"end\":62360,\"start\":62359},{\"end\":62362,\"start\":62361},{\"end\":62715,\"start\":62714},{\"end\":62725,\"start\":62724},{\"end\":62733,\"start\":62732},{\"end\":62746,\"start\":62745},{\"end\":63067,\"start\":63066},{\"end\":63077,\"start\":63076},{\"end\":63085,\"start\":63084},{\"end\":63105,\"start\":63104},{\"end\":63107,\"start\":63106},{\"end\":63493,\"start\":63492},{\"end\":63495,\"start\":63494},{\"end\":63503,\"start\":63502},{\"end\":63505,\"start\":63504},{\"end\":63515,\"start\":63514},{\"end\":63517,\"start\":63516},{\"end\":63527,\"start\":63526},{\"end\":63529,\"start\":63528},{\"end\":63538,\"start\":63537},{\"end\":63540,\"start\":63539},{\"end\":63949,\"start\":63948},{\"end\":63951,\"start\":63950},{\"end\":63964,\"start\":63963},{\"end\":63966,\"start\":63965},{\"end\":63976,\"start\":63975},{\"end\":63978,\"start\":63977},{\"end\":63988,\"start\":63987},{\"end\":64246,\"start\":64245},{\"end\":64252,\"start\":64251},{\"end\":64263,\"start\":64262},{\"end\":64273,\"start\":64272},{\"end\":64275,\"start\":64274},{\"end\":64902,\"start\":64901},{\"end\":64904,\"start\":64903},{\"end\":65180,\"start\":65179},{\"end\":65182,\"start\":65181},{\"end\":65195,\"start\":65194},{\"end\":65197,\"start\":65196},{\"end\":65211,\"start\":65210},{\"end\":65213,\"start\":65212},{\"end\":65223,\"start\":65222},{\"end\":65600,\"start\":65599},{\"end\":65611,\"start\":65610},{\"end\":65953,\"start\":65952},{\"end\":65955,\"start\":65954},{\"end\":65966,\"start\":65965},{\"end\":66142,\"start\":66141},{\"end\":66144,\"start\":66143},{\"end\":66154,\"start\":66153},{\"end\":66156,\"start\":66155},{\"end\":66307,\"start\":66306},{\"end\":66313,\"start\":66308},{\"end\":66324,\"start\":66323},{\"end\":66507,\"start\":66506},{\"end\":66518,\"start\":66517},{\"end\":66526,\"start\":66525},{\"end\":66962,\"start\":66961},{\"end\":67176,\"start\":67175},{\"end\":67548,\"start\":67547},{\"end\":67560,\"start\":67559},{\"end\":68004,\"start\":68003},{\"end\":68010,\"start\":68009},{\"end\":68017,\"start\":68016},{\"end\":68023,\"start\":68022},{\"end\":68031,\"start\":68030},{\"end\":68486,\"start\":68485},{\"end\":68497,\"start\":68496},{\"end\":68710,\"start\":68709},{\"end\":68720,\"start\":68719},{\"end\":68722,\"start\":68721},{\"end\":68732,\"start\":68731},{\"end\":68742,\"start\":68741},{\"end\":69007,\"start\":69006},{\"end\":69021,\"start\":69020},{\"end\":69031,\"start\":69030},{\"end\":69361,\"start\":69360},{\"end\":69363,\"start\":69362},{\"end\":59306,\"start\":59305},{\"end\":59324,\"start\":59323},{\"end\":59336,\"start\":59335},{\"end\":59348,\"start\":59347},{\"end\":59360,\"start\":59359},{\"end\":59759,\"start\":59758},{\"end\":59761,\"start\":59760},{\"end\":60123,\"start\":60122},{\"end\":60131,\"start\":60130},{\"end\":60144,\"start\":60143},{\"end\":60418,\"start\":60417},{\"end\":60420,\"start\":60419},{\"end\":60697,\"start\":60696},{\"end\":60707,\"start\":60706},{\"end\":60709,\"start\":60708},{\"end\":60721,\"start\":60720},{\"end\":60723,\"start\":60722},{\"end\":61053,\"start\":61052},{\"end\":61061,\"start\":61060},{\"end\":61067,\"start\":61066},{\"end\":61087,\"start\":61086},{\"end\":61098,\"start\":61097},{\"end\":61100,\"start\":61099},{\"end\":61108,\"start\":61107},{\"end\":61110,\"start\":61109},{\"end\":61474,\"start\":61473},{\"end\":61483,\"start\":61482},{\"end\":61492,\"start\":61491},{\"end\":61504,\"start\":61503},{\"end\":61513,\"start\":61512},{\"end\":61523,\"start\":61522},{\"end\":61935,\"start\":61934},{\"end\":61937,\"start\":61936},{\"end\":61946,\"start\":61945},{\"end\":61952,\"start\":61951},{\"end\":61954,\"start\":61953},{\"end\":61963,\"start\":61962},{\"end\":61973,\"start\":61972},{\"end\":61975,\"start\":61974},{\"end\":62330,\"start\":62329},{\"end\":62340,\"start\":62339},{\"end\":62360,\"start\":62359},{\"end\":62362,\"start\":62361},{\"end\":62715,\"start\":62714},{\"end\":62725,\"start\":62724},{\"end\":62733,\"start\":62732},{\"end\":62746,\"start\":62745},{\"end\":63067,\"start\":63066},{\"end\":63077,\"start\":63076},{\"end\":63085,\"start\":63084},{\"end\":63105,\"start\":63104},{\"end\":63107,\"start\":63106},{\"end\":63493,\"start\":63492},{\"end\":63495,\"start\":63494},{\"end\":63503,\"start\":63502},{\"end\":63505,\"start\":63504},{\"end\":63515,\"start\":63514},{\"end\":63517,\"start\":63516},{\"end\":63527,\"start\":63526},{\"end\":63529,\"start\":63528},{\"end\":63538,\"start\":63537},{\"end\":63540,\"start\":63539},{\"end\":63949,\"start\":63948},{\"end\":63951,\"start\":63950},{\"end\":63964,\"start\":63963},{\"end\":63966,\"start\":63965},{\"end\":63976,\"start\":63975},{\"end\":63978,\"start\":63977},{\"end\":63988,\"start\":63987},{\"end\":64246,\"start\":64245},{\"end\":64252,\"start\":64251},{\"end\":64263,\"start\":64262},{\"end\":64273,\"start\":64272},{\"end\":64275,\"start\":64274},{\"end\":64902,\"start\":64901},{\"end\":64904,\"start\":64903},{\"end\":65180,\"start\":65179},{\"end\":65182,\"start\":65181},{\"end\":65195,\"start\":65194},{\"end\":65197,\"start\":65196},{\"end\":65211,\"start\":65210},{\"end\":65213,\"start\":65212},{\"end\":65223,\"start\":65222},{\"end\":65600,\"start\":65599},{\"end\":65611,\"start\":65610},{\"end\":65953,\"start\":65952},{\"end\":65955,\"start\":65954},{\"end\":65966,\"start\":65965},{\"end\":66142,\"start\":66141},{\"end\":66144,\"start\":66143},{\"end\":66154,\"start\":66153},{\"end\":66156,\"start\":66155},{\"end\":66307,\"start\":66306},{\"end\":66313,\"start\":66308},{\"end\":66324,\"start\":66323},{\"end\":66507,\"start\":66506},{\"end\":66518,\"start\":66517},{\"end\":66526,\"start\":66525},{\"end\":66962,\"start\":66961},{\"end\":67176,\"start\":67175},{\"end\":67548,\"start\":67547},{\"end\":67560,\"start\":67559},{\"end\":68004,\"start\":68003},{\"end\":68010,\"start\":68009},{\"end\":68017,\"start\":68016},{\"end\":68023,\"start\":68022},{\"end\":68031,\"start\":68030},{\"end\":68486,\"start\":68485},{\"end\":68497,\"start\":68496},{\"end\":68710,\"start\":68709},{\"end\":68720,\"start\":68719},{\"end\":68722,\"start\":68721},{\"end\":68732,\"start\":68731},{\"end\":68742,\"start\":68741},{\"end\":69007,\"start\":69006},{\"end\":69021,\"start\":69020},{\"end\":69031,\"start\":69030},{\"end\":69361,\"start\":69360},{\"end\":69363,\"start\":69362}]", "bib_author_last_name": "[{\"end\":59321,\"start\":59307},{\"end\":59333,\"start\":59325},{\"end\":59345,\"start\":59337},{\"end\":59357,\"start\":59349},{\"end\":59368,\"start\":59361},{\"end\":59767,\"start\":59762},{\"end\":60128,\"start\":60124},{\"end\":60141,\"start\":60132},{\"end\":60149,\"start\":60145},{\"end\":60427,\"start\":60421},{\"end\":60704,\"start\":60698},{\"end\":60718,\"start\":60710},{\"end\":60729,\"start\":60724},{\"end\":61058,\"start\":61054},{\"end\":61064,\"start\":61062},{\"end\":61084,\"start\":61068},{\"end\":61095,\"start\":61088},{\"end\":61105,\"start\":61101},{\"end\":61116,\"start\":61111},{\"end\":61480,\"start\":61475},{\"end\":61489,\"start\":61484},{\"end\":61501,\"start\":61493},{\"end\":61510,\"start\":61505},{\"end\":61520,\"start\":61514},{\"end\":61535,\"start\":61524},{\"end\":61943,\"start\":61938},{\"end\":61949,\"start\":61947},{\"end\":61960,\"start\":61955},{\"end\":61970,\"start\":61964},{\"end\":61979,\"start\":61976},{\"end\":62337,\"start\":62331},{\"end\":62357,\"start\":62341},{\"end\":62368,\"start\":62363},{\"end\":62722,\"start\":62716},{\"end\":62730,\"start\":62726},{\"end\":62743,\"start\":62734},{\"end\":62754,\"start\":62747},{\"end\":63074,\"start\":63068},{\"end\":63082,\"start\":63078},{\"end\":63102,\"start\":63086},{\"end\":63113,\"start\":63108},{\"end\":63500,\"start\":63496},{\"end\":63512,\"start\":63506},{\"end\":63524,\"start\":63518},{\"end\":63535,\"start\":63530},{\"end\":63550,\"start\":63541},{\"end\":63961,\"start\":63952},{\"end\":63973,\"start\":63967},{\"end\":63985,\"start\":63979},{\"end\":63998,\"start\":63989},{\"end\":64249,\"start\":64247},{\"end\":64260,\"start\":64253},{\"end\":64270,\"start\":64264},{\"end\":64281,\"start\":64276},{\"end\":64912,\"start\":64905},{\"end\":65192,\"start\":65183},{\"end\":65208,\"start\":65198},{\"end\":65220,\"start\":65214},{\"end\":65227,\"start\":65224},{\"end\":65608,\"start\":65601},{\"end\":65622,\"start\":65612},{\"end\":65961,\"start\":65956},{\"end\":65973,\"start\":65967},{\"end\":66151,\"start\":66145},{\"end\":66162,\"start\":66157},{\"end\":66321,\"start\":66314},{\"end\":66330,\"start\":66325},{\"end\":66515,\"start\":66508},{\"end\":66523,\"start\":66519},{\"end\":66533,\"start\":66527},{\"end\":66967,\"start\":66963},{\"end\":67181,\"start\":67177},{\"end\":67557,\"start\":67549},{\"end\":67568,\"start\":67561},{\"end\":68007,\"start\":68005},{\"end\":68014,\"start\":68011},{\"end\":68020,\"start\":68018},{\"end\":68028,\"start\":68024},{\"end\":68036,\"start\":68032},{\"end\":68494,\"start\":68487},{\"end\":68503,\"start\":68498},{\"end\":68717,\"start\":68711},{\"end\":68729,\"start\":68723},{\"end\":68739,\"start\":68733},{\"end\":68749,\"start\":68743},{\"end\":69018,\"start\":69008},{\"end\":69028,\"start\":69022},{\"end\":69041,\"start\":69032},{\"end\":69373,\"start\":69364},{\"end\":59321,\"start\":59307},{\"end\":59333,\"start\":59325},{\"end\":59345,\"start\":59337},{\"end\":59357,\"start\":59349},{\"end\":59368,\"start\":59361},{\"end\":59767,\"start\":59762},{\"end\":60128,\"start\":60124},{\"end\":60141,\"start\":60132},{\"end\":60149,\"start\":60145},{\"end\":60427,\"start\":60421},{\"end\":60704,\"start\":60698},{\"end\":60718,\"start\":60710},{\"end\":60729,\"start\":60724},{\"end\":61058,\"start\":61054},{\"end\":61064,\"start\":61062},{\"end\":61084,\"start\":61068},{\"end\":61095,\"start\":61088},{\"end\":61105,\"start\":61101},{\"end\":61116,\"start\":61111},{\"end\":61480,\"start\":61475},{\"end\":61489,\"start\":61484},{\"end\":61501,\"start\":61493},{\"end\":61510,\"start\":61505},{\"end\":61520,\"start\":61514},{\"end\":61535,\"start\":61524},{\"end\":61943,\"start\":61938},{\"end\":61949,\"start\":61947},{\"end\":61960,\"start\":61955},{\"end\":61970,\"start\":61964},{\"end\":61979,\"start\":61976},{\"end\":62337,\"start\":62331},{\"end\":62357,\"start\":62341},{\"end\":62368,\"start\":62363},{\"end\":62722,\"start\":62716},{\"end\":62730,\"start\":62726},{\"end\":62743,\"start\":62734},{\"end\":62754,\"start\":62747},{\"end\":63074,\"start\":63068},{\"end\":63082,\"start\":63078},{\"end\":63102,\"start\":63086},{\"end\":63113,\"start\":63108},{\"end\":63500,\"start\":63496},{\"end\":63512,\"start\":63506},{\"end\":63524,\"start\":63518},{\"end\":63535,\"start\":63530},{\"end\":63550,\"start\":63541},{\"end\":63961,\"start\":63952},{\"end\":63973,\"start\":63967},{\"end\":63985,\"start\":63979},{\"end\":63998,\"start\":63989},{\"end\":64249,\"start\":64247},{\"end\":64260,\"start\":64253},{\"end\":64270,\"start\":64264},{\"end\":64281,\"start\":64276},{\"end\":64912,\"start\":64905},{\"end\":65192,\"start\":65183},{\"end\":65208,\"start\":65198},{\"end\":65220,\"start\":65214},{\"end\":65227,\"start\":65224},{\"end\":65608,\"start\":65601},{\"end\":65622,\"start\":65612},{\"end\":65961,\"start\":65956},{\"end\":65973,\"start\":65967},{\"end\":66151,\"start\":66145},{\"end\":66162,\"start\":66157},{\"end\":66321,\"start\":66314},{\"end\":66330,\"start\":66325},{\"end\":66515,\"start\":66508},{\"end\":66523,\"start\":66519},{\"end\":66533,\"start\":66527},{\"end\":66967,\"start\":66963},{\"end\":67181,\"start\":67177},{\"end\":67557,\"start\":67549},{\"end\":67568,\"start\":67561},{\"end\":68007,\"start\":68005},{\"end\":68014,\"start\":68011},{\"end\":68020,\"start\":68018},{\"end\":68028,\"start\":68024},{\"end\":68036,\"start\":68032},{\"end\":68494,\"start\":68487},{\"end\":68503,\"start\":68498},{\"end\":68717,\"start\":68711},{\"end\":68729,\"start\":68723},{\"end\":68739,\"start\":68733},{\"end\":68749,\"start\":68743},{\"end\":69018,\"start\":69008},{\"end\":69028,\"start\":69022},{\"end\":69041,\"start\":69032},{\"end\":69373,\"start\":69364}]", "bib_entry": "[{\"attributes\":{\"id\":\"b0\",\"matched_paper_id\":15476734},\"end\":59669,\"start\":59185},{\"attributes\":{\"id\":\"b1\",\"matched_paper_id\":232046086},\"end\":60030,\"start\":59671},{\"attributes\":{\"id\":\"b2\",\"matched_paper_id\":84187311},\"end\":60339,\"start\":60032},{\"attributes\":{\"id\":\"b3\",\"matched_paper_id\":1257163},\"end\":60615,\"start\":60341},{\"attributes\":{\"id\":\"b4\",\"matched_paper_id\":119303417},\"end\":60971,\"start\":60617},{\"attributes\":{\"id\":\"b5\",\"matched_paper_id\":2920396},\"end\":61385,\"start\":60973},{\"attributes\":{\"id\":\"b6\",\"matched_paper_id\":17069433},\"end\":61848,\"start\":61387},{\"attributes\":{\"id\":\"b7\",\"matched_paper_id\":220793643},\"end\":62248,\"start\":61850},{\"attributes\":{\"id\":\"b8\",\"matched_paper_id\":34404048},\"end\":62665,\"start\":62250},{\"attributes\":{\"id\":\"b9\",\"matched_paper_id\":4591750},\"end\":62978,\"start\":62667},{\"attributes\":{\"id\":\"b10\",\"matched_paper_id\":5035634},\"end\":63390,\"start\":62980},{\"attributes\":{\"id\":\"b11\",\"matched_paper_id\":66950080},\"end\":63891,\"start\":63392},{\"attributes\":{\"id\":\"b12\",\"matched_paper_id\":117530196},\"end\":64243,\"start\":63893},{\"attributes\":{\"id\":\"b13\"},\"end\":64548,\"start\":64245},{\"attributes\":{\"id\":\"b14\"},\"end\":64899,\"start\":64550},{\"attributes\":{\"id\":\"b15\"},\"end\":65059,\"start\":64901},{\"attributes\":{\"id\":\"b16\",\"matched_paper_id\":3013154},\"end\":65516,\"start\":65061},{\"attributes\":{\"id\":\"b17\",\"matched_paper_id\":14622564},\"end\":65915,\"start\":65518},{\"attributes\":{\"id\":\"b18\"},\"end\":66099,\"start\":65917},{\"attributes\":{\"id\":\"b19\"},\"end\":66292,\"start\":66101},{\"attributes\":{\"id\":\"b20\",\"matched_paper_id\":208910339},\"end\":66452,\"start\":66294},{\"attributes\":{\"id\":\"b21\",\"matched_paper_id\":6208256},\"end\":66902,\"start\":66454},{\"attributes\":{\"id\":\"b22\",\"matched_paper_id\":205242740},\"end\":67110,\"start\":66904},{\"attributes\":{\"id\":\"b23\",\"matched_paper_id\":5389801},\"end\":67480,\"start\":67112},{\"attributes\":{\"id\":\"b24\",\"matched_paper_id\":781349},\"end\":67939,\"start\":67482},{\"attributes\":{\"id\":\"b25\",\"matched_paper_id\":53250419},\"end\":68448,\"start\":67941},{\"attributes\":{\"id\":\"b26\",\"matched_paper_id\":16945044},\"end\":68639,\"start\":68450},{\"attributes\":{\"id\":\"b27\",\"matched_paper_id\":86848505},\"end\":68989,\"start\":68641},{\"attributes\":{\"id\":\"b28\"},\"end\":69127,\"start\":68991},{\"attributes\":{\"id\":\"b29\"},\"end\":69302,\"start\":69129},{\"attributes\":{\"id\":\"b30\",\"matched_paper_id\":18420840},\"end\":69686,\"start\":69304},{\"attributes\":{\"id\":\"b0\",\"matched_paper_id\":15476734},\"end\":59669,\"start\":59185},{\"attributes\":{\"id\":\"b1\",\"matched_paper_id\":232046086},\"end\":60030,\"start\":59671},{\"attributes\":{\"id\":\"b2\",\"matched_paper_id\":84187311},\"end\":60339,\"start\":60032},{\"attributes\":{\"id\":\"b3\",\"matched_paper_id\":1257163},\"end\":60615,\"start\":60341},{\"attributes\":{\"id\":\"b4\",\"matched_paper_id\":119303417},\"end\":60971,\"start\":60617},{\"attributes\":{\"id\":\"b5\",\"matched_paper_id\":2920396},\"end\":61385,\"start\":60973},{\"attributes\":{\"id\":\"b6\",\"matched_paper_id\":17069433},\"end\":61848,\"start\":61387},{\"attributes\":{\"id\":\"b7\",\"matched_paper_id\":220793643},\"end\":62248,\"start\":61850},{\"attributes\":{\"id\":\"b8\",\"matched_paper_id\":34404048},\"end\":62665,\"start\":62250},{\"attributes\":{\"id\":\"b9\",\"matched_paper_id\":4591750},\"end\":62978,\"start\":62667},{\"attributes\":{\"id\":\"b10\",\"matched_paper_id\":5035634},\"end\":63390,\"start\":62980},{\"attributes\":{\"id\":\"b11\",\"matched_paper_id\":66950080},\"end\":63891,\"start\":63392},{\"attributes\":{\"id\":\"b12\",\"matched_paper_id\":117530196},\"end\":64243,\"start\":63893},{\"attributes\":{\"id\":\"b13\"},\"end\":64548,\"start\":64245},{\"attributes\":{\"id\":\"b14\"},\"end\":64899,\"start\":64550},{\"attributes\":{\"id\":\"b15\"},\"end\":65059,\"start\":64901},{\"attributes\":{\"id\":\"b16\",\"matched_paper_id\":3013154},\"end\":65516,\"start\":65061},{\"attributes\":{\"id\":\"b17\",\"matched_paper_id\":14622564},\"end\":65915,\"start\":65518},{\"attributes\":{\"id\":\"b18\"},\"end\":66099,\"start\":65917},{\"attributes\":{\"id\":\"b19\"},\"end\":66292,\"start\":66101},{\"attributes\":{\"id\":\"b20\",\"matched_paper_id\":208910339},\"end\":66452,\"start\":66294},{\"attributes\":{\"id\":\"b21\",\"matched_paper_id\":6208256},\"end\":66902,\"start\":66454},{\"attributes\":{\"id\":\"b22\",\"matched_paper_id\":205242740},\"end\":67110,\"start\":66904},{\"attributes\":{\"id\":\"b23\",\"matched_paper_id\":5389801},\"end\":67480,\"start\":67112},{\"attributes\":{\"id\":\"b24\",\"matched_paper_id\":781349},\"end\":67939,\"start\":67482},{\"attributes\":{\"id\":\"b25\",\"matched_paper_id\":53250419},\"end\":68448,\"start\":67941},{\"attributes\":{\"id\":\"b26\",\"matched_paper_id\":16945044},\"end\":68639,\"start\":68450},{\"attributes\":{\"id\":\"b27\",\"matched_paper_id\":86848505},\"end\":68989,\"start\":68641},{\"attributes\":{\"id\":\"b28\"},\"end\":69127,\"start\":68991},{\"attributes\":{\"id\":\"b29\"},\"end\":69302,\"start\":69129},{\"attributes\":{\"id\":\"b30\",\"matched_paper_id\":18420840},\"end\":69686,\"start\":69304}]", "bib_title": "[{\"end\":59303,\"start\":59185},{\"end\":59756,\"start\":59671},{\"end\":60120,\"start\":60032},{\"end\":60415,\"start\":60341},{\"end\":60694,\"start\":60617},{\"end\":61050,\"start\":60973},{\"end\":61471,\"start\":61387},{\"end\":61932,\"start\":61850},{\"end\":62327,\"start\":62250},{\"end\":62712,\"start\":62667},{\"end\":63064,\"start\":62980},{\"end\":63490,\"start\":63392},{\"end\":63946,\"start\":63893},{\"end\":64606,\"start\":64550},{\"end\":65177,\"start\":65061},{\"end\":65597,\"start\":65518},{\"end\":66304,\"start\":66294},{\"end\":66504,\"start\":66454},{\"end\":66959,\"start\":66904},{\"end\":67173,\"start\":67112},{\"end\":67545,\"start\":67482},{\"end\":68001,\"start\":67941},{\"end\":68483,\"start\":68450},{\"end\":68707,\"start\":68641},{\"end\":69358,\"start\":69304},{\"end\":59303,\"start\":59185},{\"end\":59756,\"start\":59671},{\"end\":60120,\"start\":60032},{\"end\":60415,\"start\":60341},{\"end\":60694,\"start\":60617},{\"end\":61050,\"start\":60973},{\"end\":61471,\"start\":61387},{\"end\":61932,\"start\":61850},{\"end\":62327,\"start\":62250},{\"end\":62712,\"start\":62667},{\"end\":63064,\"start\":62980},{\"end\":63490,\"start\":63392},{\"end\":63946,\"start\":63893},{\"end\":64606,\"start\":64550},{\"end\":65177,\"start\":65061},{\"end\":65597,\"start\":65518},{\"end\":66304,\"start\":66294},{\"end\":66504,\"start\":66454},{\"end\":66959,\"start\":66904},{\"end\":67173,\"start\":67112},{\"end\":67545,\"start\":67482},{\"end\":68001,\"start\":67941},{\"end\":68483,\"start\":68450},{\"end\":68707,\"start\":68641},{\"end\":69358,\"start\":69304}]", "bib_author": "[{\"end\":59323,\"start\":59305},{\"end\":59335,\"start\":59323},{\"end\":59347,\"start\":59335},{\"end\":59359,\"start\":59347},{\"end\":59370,\"start\":59359},{\"end\":59769,\"start\":59758},{\"end\":60130,\"start\":60122},{\"end\":60143,\"start\":60130},{\"end\":60151,\"start\":60143},{\"end\":60429,\"start\":60417},{\"end\":60706,\"start\":60696},{\"end\":60720,\"start\":60706},{\"end\":60731,\"start\":60720},{\"end\":61060,\"start\":61052},{\"end\":61066,\"start\":61060},{\"end\":61086,\"start\":61066},{\"end\":61097,\"start\":61086},{\"end\":61107,\"start\":61097},{\"end\":61120,\"start\":61107},{\"end\":61482,\"start\":61473},{\"end\":61491,\"start\":61482},{\"end\":61503,\"start\":61491},{\"end\":61512,\"start\":61503},{\"end\":61522,\"start\":61512},{\"end\":61537,\"start\":61522},{\"end\":61945,\"start\":61934},{\"end\":61951,\"start\":61945},{\"end\":61962,\"start\":61951},{\"end\":61972,\"start\":61962},{\"end\":61981,\"start\":61972},{\"end\":62339,\"start\":62329},{\"end\":62359,\"start\":62339},{\"end\":62372,\"start\":62359},{\"end\":62724,\"start\":62714},{\"end\":62732,\"start\":62724},{\"end\":62745,\"start\":62732},{\"end\":62756,\"start\":62745},{\"end\":63076,\"start\":63066},{\"end\":63084,\"start\":63076},{\"end\":63104,\"start\":63084},{\"end\":63115,\"start\":63104},{\"end\":63502,\"start\":63492},{\"end\":63514,\"start\":63502},{\"end\":63526,\"start\":63514},{\"end\":63537,\"start\":63526},{\"end\":63552,\"start\":63537},{\"end\":63963,\"start\":63948},{\"end\":63975,\"start\":63963},{\"end\":63987,\"start\":63975},{\"end\":64000,\"start\":63987},{\"end\":64251,\"start\":64245},{\"end\":64262,\"start\":64251},{\"end\":64272,\"start\":64262},{\"end\":64285,\"start\":64272},{\"end\":64914,\"start\":64901},{\"end\":65194,\"start\":65179},{\"end\":65210,\"start\":65194},{\"end\":65222,\"start\":65210},{\"end\":65229,\"start\":65222},{\"end\":65610,\"start\":65599},{\"end\":65624,\"start\":65610},{\"end\":65965,\"start\":65952},{\"end\":65975,\"start\":65965},{\"end\":66153,\"start\":66141},{\"end\":66164,\"start\":66153},{\"end\":66323,\"start\":66306},{\"end\":66332,\"start\":66323},{\"end\":66517,\"start\":66506},{\"end\":66525,\"start\":66517},{\"end\":66535,\"start\":66525},{\"end\":66969,\"start\":66961},{\"end\":67183,\"start\":67175},{\"end\":67559,\"start\":67547},{\"end\":67570,\"start\":67559},{\"end\":68009,\"start\":68003},{\"end\":68016,\"start\":68009},{\"end\":68022,\"start\":68016},{\"end\":68030,\"start\":68022},{\"end\":68038,\"start\":68030},{\"end\":68496,\"start\":68485},{\"end\":68505,\"start\":68496},{\"end\":68719,\"start\":68709},{\"end\":68731,\"start\":68719},{\"end\":68741,\"start\":68731},{\"end\":68751,\"start\":68741},{\"end\":69020,\"start\":69006},{\"end\":69030,\"start\":69020},{\"end\":69043,\"start\":69030},{\"end\":69375,\"start\":69360},{\"end\":59323,\"start\":59305},{\"end\":59335,\"start\":59323},{\"end\":59347,\"start\":59335},{\"end\":59359,\"start\":59347},{\"end\":59370,\"start\":59359},{\"end\":59769,\"start\":59758},{\"end\":60130,\"start\":60122},{\"end\":60143,\"start\":60130},{\"end\":60151,\"start\":60143},{\"end\":60429,\"start\":60417},{\"end\":60706,\"start\":60696},{\"end\":60720,\"start\":60706},{\"end\":60731,\"start\":60720},{\"end\":61060,\"start\":61052},{\"end\":61066,\"start\":61060},{\"end\":61086,\"start\":61066},{\"end\":61097,\"start\":61086},{\"end\":61107,\"start\":61097},{\"end\":61120,\"start\":61107},{\"end\":61482,\"start\":61473},{\"end\":61491,\"start\":61482},{\"end\":61503,\"start\":61491},{\"end\":61512,\"start\":61503},{\"end\":61522,\"start\":61512},{\"end\":61537,\"start\":61522},{\"end\":61945,\"start\":61934},{\"end\":61951,\"start\":61945},{\"end\":61962,\"start\":61951},{\"end\":61972,\"start\":61962},{\"end\":61981,\"start\":61972},{\"end\":62339,\"start\":62329},{\"end\":62359,\"start\":62339},{\"end\":62372,\"start\":62359},{\"end\":62724,\"start\":62714},{\"end\":62732,\"start\":62724},{\"end\":62745,\"start\":62732},{\"end\":62756,\"start\":62745},{\"end\":63076,\"start\":63066},{\"end\":63084,\"start\":63076},{\"end\":63104,\"start\":63084},{\"end\":63115,\"start\":63104},{\"end\":63502,\"start\":63492},{\"end\":63514,\"start\":63502},{\"end\":63526,\"start\":63514},{\"end\":63537,\"start\":63526},{\"end\":63552,\"start\":63537},{\"end\":63963,\"start\":63948},{\"end\":63975,\"start\":63963},{\"end\":63987,\"start\":63975},{\"end\":64000,\"start\":63987},{\"end\":64251,\"start\":64245},{\"end\":64262,\"start\":64251},{\"end\":64272,\"start\":64262},{\"end\":64285,\"start\":64272},{\"end\":64914,\"start\":64901},{\"end\":65194,\"start\":65179},{\"end\":65210,\"start\":65194},{\"end\":65222,\"start\":65210},{\"end\":65229,\"start\":65222},{\"end\":65610,\"start\":65599},{\"end\":65624,\"start\":65610},{\"end\":65965,\"start\":65952},{\"end\":65975,\"start\":65965},{\"end\":66153,\"start\":66141},{\"end\":66164,\"start\":66153},{\"end\":66323,\"start\":66306},{\"end\":66332,\"start\":66323},{\"end\":66517,\"start\":66506},{\"end\":66525,\"start\":66517},{\"end\":66535,\"start\":66525},{\"end\":66969,\"start\":66961},{\"end\":67183,\"start\":67175},{\"end\":67559,\"start\":67547},{\"end\":67570,\"start\":67559},{\"end\":68009,\"start\":68003},{\"end\":68016,\"start\":68009},{\"end\":68022,\"start\":68016},{\"end\":68030,\"start\":68022},{\"end\":68038,\"start\":68030},{\"end\":68496,\"start\":68485},{\"end\":68505,\"start\":68496},{\"end\":68719,\"start\":68709},{\"end\":68731,\"start\":68719},{\"end\":68741,\"start\":68731},{\"end\":68751,\"start\":68741},{\"end\":69020,\"start\":69006},{\"end\":69030,\"start\":69020},{\"end\":69043,\"start\":69030},{\"end\":69375,\"start\":69360}]", "bib_venue": "[{\"end\":59397,\"start\":59370},{\"end\":59821,\"start\":59769},{\"end\":60162,\"start\":60151},{\"end\":60452,\"start\":60429},{\"end\":60769,\"start\":60731},{\"end\":61147,\"start\":61120},{\"end\":61589,\"start\":61537},{\"end\":62020,\"start\":61981},{\"end\":62418,\"start\":62372},{\"end\":62794,\"start\":62756},{\"end\":63156,\"start\":63115},{\"end\":63623,\"start\":63552},{\"end\":64047,\"start\":64000},{\"end\":64378,\"start\":64285},{\"end\":64699,\"start\":64608},{\"end\":64953,\"start\":64914},{\"end\":65258,\"start\":65229},{\"end\":65700,\"start\":65624},{\"end\":65950,\"start\":65917},{\"end\":66139,\"start\":66101},{\"end\":66348,\"start\":66332},{\"end\":66616,\"start\":66535},{\"end\":66975,\"start\":66969},{\"end\":67251,\"start\":67183},{\"end\":67658,\"start\":67570},{\"end\":68106,\"start\":68038},{\"end\":68520,\"start\":68505},{\"end\":68795,\"start\":68751},{\"end\":69004,\"start\":68991},{\"end\":69164,\"start\":69129},{\"end\":69426,\"start\":69375},{\"end\":59397,\"start\":59370},{\"end\":59821,\"start\":59769},{\"end\":60162,\"start\":60151},{\"end\":60452,\"start\":60429},{\"end\":60769,\"start\":60731},{\"end\":61147,\"start\":61120},{\"end\":61589,\"start\":61537},{\"end\":62020,\"start\":61981},{\"end\":62418,\"start\":62372},{\"end\":62794,\"start\":62756},{\"end\":63156,\"start\":63115},{\"end\":63623,\"start\":63552},{\"end\":64047,\"start\":64000},{\"end\":64378,\"start\":64285},{\"end\":64699,\"start\":64608},{\"end\":64953,\"start\":64914},{\"end\":65258,\"start\":65229},{\"end\":65700,\"start\":65624},{\"end\":65950,\"start\":65917},{\"end\":66139,\"start\":66101},{\"end\":66348,\"start\":66332},{\"end\":66616,\"start\":66535},{\"end\":66975,\"start\":66969},{\"end\":67251,\"start\":67183},{\"end\":67658,\"start\":67570},{\"end\":68106,\"start\":68038},{\"end\":68520,\"start\":68505},{\"end\":68795,\"start\":68751},{\"end\":69004,\"start\":68991},{\"end\":69164,\"start\":69129},{\"end\":69426,\"start\":69375},{\"end\":62451,\"start\":62420},{\"end\":66684,\"start\":66618},{\"end\":67306,\"start\":67253},{\"end\":67733,\"start\":67660},{\"end\":68161,\"start\":68108},{\"end\":69450,\"start\":69428},{\"end\":62451,\"start\":62420},{\"end\":66684,\"start\":66618},{\"end\":67306,\"start\":67253},{\"end\":67733,\"start\":67660},{\"end\":68161,\"start\":68108},{\"end\":69450,\"start\":69428}]"}}}, "year": 2023, "month": 12, "day": 17}