{"id": 247359170, "updated": "2023-10-05 16:31:32.212", "metadata": {"title": "VinDr-Mammo: A large-scale benchmark dataset for computer-aided diagnosis in full-field digital mammography", "authors": "[{\"first\":\"Hieu\",\"last\":\"Nguyen\",\"middle\":[\"T.\"]},{\"first\":\"Ha\",\"last\":\"Nguyen\",\"middle\":[\"Q.\"]},{\"first\":\"Hieu\",\"last\":\"Pham\",\"middle\":[\"H.\"]},{\"first\":\"Khanh\",\"last\":\"Lam\",\"middle\":[]},{\"first\":\"Linh\",\"last\":\"Le\",\"middle\":[\"T.\"]},{\"first\":\"Minh\",\"last\":\"Dao\",\"middle\":[]},{\"first\":\"Van\",\"last\":\"Vu\",\"middle\":[]}]", "venue": "Scientific Data", "journal": "Scientific Data", "publication_date": {"year": 2023, "month": 5, "day": 12}, "abstract": "Mammography, or breast X-ray imaging, is the most widely used imaging modality to detect cancer and other breast diseases. Recent studies have shown that deep learning-based computer-assisted detection and diagnosis (CADe/x) tools have been developed to support physicians and improve the accuracy of interpreting mammography. A number of large-scale mammography datasets from different populations with various associated annotations and clinical data have been introduced to study the potential of learning-based methods in the field of breast radiology. With the aim to develop more robust and more interpretable support systems in breast imaging, we introduce VinDr-Mammo, a Vietnamese dataset of digital mammography with breast-level assessment and extensive lesion-level annotations, enhancing the diversity of the publicly available mammography data. The dataset consists of 5,000 mammography exams, each of which has four standard views and is double read with disagreement (if any) being resolved by arbitration. The purpose of this dataset is to assess Breast Imaging Reporting and Data System (BI-RADS) and breast density at the individual breast level. In addition, the dataset also provides the category, location, and BI-RADS assessment of non-benign findings. We make VinDr-Mammo publicly available as a new imaging resource to promote advances in developing CADe/x tools for mammography interpretation.", "fields_of_study": "[\"Engineering\",\"Computer Science\"]", "external_ids": {"arxiv": "2203.11205", "mag": null, "acl": null, "pubmed": "37173336", "pubmedcentral": "10182079", "dblp": "journals/corr/abs-2203-11205", "doi": "10.1038/s41597-023-02100-7"}}, "content": {"source": {"pdf_hash": "d69c5e98d5a8c2a0ded41627a010cc18d88f6a74", "pdf_src": "PubMedCentral", "pdf_uri": "[\"https://export.arxiv.org/pdf/2203.11205v2.pdf\"]", "oa_url_match": false, "oa_info": {"license": "CCBY", "open_access_url": null, "status": null}}, "grobid": {"id": "dd5e604c2b900fc85426df6832843056ac399649", "type": "plain-text", "url": "s3://ai2-s2-pdf-extraction-prod/parse-results/s2orc_worker/d69c5e98d5a8c2a0ded41627a010cc18d88f6a74.txt", "contents": "\nSupplementary materials\n\n\nSupplementary materials\n1/3\nTable 1. Definition of findings used in the study.Finding Definition1. Mass A mass is 3-dimensional and occupies space. It has completely or partially convex-outward borders and (when radiodense) appears denser in the center than at the periphery. If a potential mass is seen only on a single projection, it should be called an asymmetry until its 3-dimensionality is confirmed.Suspicious CalcificationCalcification with suspicious morphology (amorphous, coarse heterogeneous, fine pleiomorphic, fine linear, or fine linear branching) or probably benign (BI-RADS 3).AsymmetriesAsymmetryThis is an area of fibroglandular-density tissue that is visible on only one mammographic projection. Most such findings represent summation artifacts, a superimposition of normal breast structures, whereas those confirmed to be real lesions (by a subsequent demonstration on at least one more projection) may represent one of the other types of asymmetry or a mass.\n\nGlobal Asymmetry\n\nGlobal asymmetry is judged relative to the corresponding area in the contralateral breast and represents a large amount of fibroglandular-density tissue over a substantial portion of the breast (at least one quadrant). There is no mass, distorted architecture, or associated suspicious calcifications.\n\n\nFocal Asymmetry\n\nA focal asymmetry is judged relative to the corresponding location in the contralateral breast, and represents a relatively small amount of fibroglandulardensity tissue over a confined portion of the breast (less than one quadrant). It is visible on and has a similar shape on different mammographic projections (hence, a real finding rather than the superimposition of normal breast structures), but it lacks the convex-outward borders and the conspicuity of a mass. Rather, the borders of a focal asymmetry are concave-outward, and it is usually seen to be interspersed with fat.\n\n\nArchitecture Distortion\n\nThe parenchyma is distorted with no definite mass visible. This includes thin straight lines or spiculations radiating from a point, and focal retraction, distortion, or straightening at the anterior or posterior edge of the parenchyma.\n\n\nSuspicious Lymph Node\n\nAxillary lymph nodes receive lymph from vessels that drain the arm, the walls of the thorax, the breast, and the upper walls of the abdomen. Features of suspicious lymph nodes include loss or disruption of central fatty hilum, loss or pericapsular fat line, irregular outer margins, hyperattenuating, and calcified.\n\n\nSkin Thickening\n\nSkin thickening may be focal or diffuse and is defined as being greater than 2 mm in thickness. This finding is of particular concern if it represents a change from previous mammography examinations. However, unilateral skin thickening is an expected finding after radiation therapy.\n\n\nSkin Retraction\n\nThe skin is pulled in abnormally.\n\n\nNipple Retraction\n\nThe nipple is pulled in. This should not be confused with nipple inversion, which is often bilateral and which in the absence of any suspicious findings and when stable for a long period of time, is not a sign of malignancy. However, if nipple retraction is new, suspicion of underlying malignancy is increased.  \n\nTable 2 .\n2DICOM tags (a). The list of DICOM tags that were retained for loading and processing raw images. All other tags were removed for protecting patient privacy. Details about all these tags can be found from DICOM Standard Browser at https://dicom.innolitics.com/ciods.Free form explanation of the meaning of the Window Center and Width. Multiple values corresponding to multiple Window Center and Width values. data stream of the pixel samples that comprise the Image. Required if Pixel Data Provider URL (0028,7FE0) is not present.DICOM Tag Attribute Name \nDescription \n\n(0010,0040) \nPatient's Sex \nSex of named Patient. \n\n(0010,1010) \nPatient's Age \nAge of the Patient. \n\n(0010,1020) \nPatient's Size \nLength or size of the Patient, in meters. \n\n(0010,1030) \nPatient's Weight \nWeight of the Patient, in kilograms \n\n(0028,0010) \nRows \nNumber of rows in the image. \n\n(0028,0011) \nColumns \nNumber of columns in the image. \n\n(0028,0030) \nPixel Spacing \nPhysical distance in the patient between the center of each pixel, specified by \na numeric pair -adjacent row spacing (delimiter) adjacent column spacing, \nin mm. \n\n(0018,1164) \nImager Pixel Spacing \nPhysical distance measured at the front plane of the Image Receptor housing \nbetween the center of each pixel. Specified by a numeric pair -adjacent row \nspacing (delimiter) adjacent column spacing, in mm. \n\n(0028,0120) \nPixel Padding Value \nSingle pixel value or one limit (inclusive) of a range of pixel values used in \nan image to pad to rectangular format or to signal background that may be \nsuppressed. \n\n(0028,0121) \nPixel Padding Range Limit \nPixel value that represents one limit (inclusive) of a range of padding values \nused together with Pixel Padding Value (0028,0120) as defined above. \n\n(0028,0100) \nBits Allocated \nNumber of bits allocated for each pixel sample. Each sample shall have the \nsame number of bits allocated. Bits Allocated (0028,0100) shall be either 1, \nor a multiple of 8. \n\n(0028,0101) \nBits Stored \nNumber of bits stored for each pixel sample. Each sample shall have the \nsame number of bits stored. \n\n(0028,0102) \nHigh Bit \nMost significant bit for pixel sample data. Each sample shall have the same \nhigh bit. High Bit (0028,0102) shall be one less than Bits Stored (0028,0101) \n\n(0028,0103) \nPixel Representation \nData representation of the pixel samples. Each sample shall have the same \npixel representation. \n\n(2050,0020) \nPresentation LUT Shape \nSpecified predefined Presentation LUT transformation. Required of Presen-\ntation LUT Sequence (2050,0010) is absent. \n\n(0028,0106) \nSmallest Image Pixel Value \nThe minimum actual pixel value encountered in this image. \n\n(0028,0107) \nLargest Image Pixel Value \nThe maximum actual pixel value encountered in this image. \n\n(0028,1050) \nWindow Center \nWindow Center for display. \n\n(0028,1051) \nWindow Width \nWindow Width for display. \n\n(0028,1055) \nWindow Center & Width Ex-\nplanation \n\n(7FE0,0010) \nPixel Data \nA \n\nTable 3 .\n3DICOM tags (b). The list of DICOM tags that were retained for loading and processing raw images. All other tags were removed to protect patient privacy. Details about all these tags can be found from DICOM Standard Browser at https://dicom.innolitics.com/ciods.\n(0020,0060) Laterality Laterality of (paired) body part examined. Required if the body part examined is a paired structure and Image Laterality (0020,0062) or Frame Laterality (0020,9072) or Measurement Laterality (0024,0113) are not present.(0020,0062) Image Laterality Laterality of (possibly paired) body part (as described in Anatomic Region Sequence (0008,2218)) examined.", "annotations": {"author": null, "publisher": null, "author_last_name": null, "author_first_name": null, "author_affiliation": null, "title": "[{\"end\":24,\"start\":1},{\"end\":50,\"start\":27}]", "venue": null, "abstract": "[{\"end\":1007,\"start\":55}]", "bib_ref": null, "figure": "[{\"attributes\":{\"id\":\"tab_0\",\"type\":\"table\"},\"end\":6182,\"start\":3226},{\"attributes\":{\"id\":\"tab_1\",\"type\":\"table\"},\"end\":6456,\"start\":6183}]", "paragraph": "[{\"end\":1328,\"start\":1027},{\"end\":1929,\"start\":1348},{\"end\":2193,\"start\":1957},{\"end\":2534,\"start\":2219},{\"end\":2837,\"start\":2554},{\"end\":2890,\"start\":2857},{\"end\":3225,\"start\":2912}]", "formula": null, "table_ref": null, "section_header": "[{\"attributes\":{\"n\":\"4.\"},\"end\":1025,\"start\":1009},{\"attributes\":{\"n\":\"5.\"},\"end\":1346,\"start\":1331},{\"attributes\":{\"n\":\"6.\"},\"end\":1955,\"start\":1932},{\"attributes\":{\"n\":\"7.\"},\"end\":2217,\"start\":2196},{\"attributes\":{\"n\":\"10.\"},\"end\":2552,\"start\":2537},{\"attributes\":{\"n\":\"11.\"},\"end\":2855,\"start\":2840},{\"attributes\":{\"n\":\"12.\"},\"end\":2910,\"start\":2893},{\"end\":3236,\"start\":3227},{\"end\":6193,\"start\":6184}]", "table": "[{\"end\":6182,\"start\":3767}]", "figure_caption": "[{\"end\":3767,\"start\":3238},{\"end\":6456,\"start\":6195}]", "figure_ref": null, "bib_author_first_name": null, "bib_author_last_name": null, "bib_entry": null, "bib_title": null, "bib_author": null, "bib_venue": null}}}, "year": 2023, "month": 12, "day": 17}