{"id": 247839661, "updated": "2023-10-05 15:45:18.955", "metadata": {"title": "From well-known tensor mesons to yet unknown axial-tensor mesons", "authors": "[{\"first\":\"Shahriyar\",\"last\":\"Jafarzade\",\"middle\":[]},{\"first\":\"Arthur\",\"last\":\"Vereijken\",\"middle\":[]},{\"first\":\"Milena\",\"last\":\"Piotrowska\",\"middle\":[]},{\"first\":\"Francesco\",\"last\":\"Giacosa\",\"middle\":[]}]", "venue": "ArXiv", "journal": null, "publication_date": {"year": 2022, "month": null, "day": null}, "abstract": "While the ground-state tensor ($J^{PC}=2^{++}$) mesons $a_{2}(1320)$, $K_{2}^{\\ast}(1430)$, $f_{2}(1270)$, and $f_{2}^{\\prime}(1525)$ are well known experimentally and form an almost ideal nonet of quark-antiquark states, their chiral partners, the ground-states axial-tensor ($J^{PC}=2^{--}$) mesons are poorly settled: only the kaonic member $K_2(1820)$ of the nonet has been experimentally found, whereas the isovector state $\\rho_2$ and two isoscalar states $\\omega_2$ and $\\phi_2$ are still missing. Here, we study masses, strong, and radiative decays of tensor and axial-tensor mesons within a chiral model that links them: the established tensor mesons are used to test the model and to determine its parameters, and subsequently various predictions for their chiral partners, the axial-tensor mesons, are obtained. The results are compared to current lattice QCD outcomes as well as to other theoretical approaches and show that the ground-state axial-tensor mesons are expected to be quite broad, the vector-pseudoscalar mode being the most prominent decay mode followed by the tensor-pseudoscalar one. Nonetheless, their experimental finding seems to be possible in ongoing and/or future experiments.", "fields_of_study": "[\"Physics\"]", "external_ids": {"arxiv": "2203.16585", "mag": null, "acl": null, "pubmed": null, "pubmedcentral": null, "dblp": null, "doi": "10.1103/physrevd.106.036008"}}, "content": {"source": {"pdf_hash": "dbd3ead6b943dae2435e2b9897b3983cef6f4b5b", "pdf_src": "Arxiv", "pdf_uri": "[\"https://export.arxiv.org/pdf/2203.16585v2.pdf\"]", "oa_url_match": false, "oa_info": null}, "grobid": {"id": "8aa52a5b0968f1e4db4cd2dc1a3553cefeeac7b2", "type": "plain-text", "url": "s3://ai2-s2-pdf-extraction-prod/parse-results/s2orc_worker/dbd3ead6b943dae2435e2b9897b3983cef6f4b5b.txt", "contents": "\nFrom well-known tensor mesons to yet unknown axial-tensor mesons\n25 Jul 2022\n\nShahriyar Jafarzade shahriyar.jzade@gmail.com2arthur.vereijken@gmail.com3milena.piotrowska@ujk.edu.pl4fgiacosa@ujk.edu.pl \nInstitute of Physics\nJan Kochanowski University\nul. Uniwersytecka 7, 25-406KielcePoland\n\nArthur Vereijken \nInstitute of Physics\nJan Kochanowski University\nul. Uniwersytecka 7, 25-406KielcePoland\n\nMilena Piotrowska \nInstitute of Physics\nJan Kochanowski University\nul. Uniwersytecka 7, 25-406KielcePoland\n\nFrancesco Giacosa \nInstitute of Physics\nJan Kochanowski University\nul. Uniwersytecka 7, 25-406KielcePoland\n\nInstitute for Theoretical Physics\nJ. W. Goethe University\nMax-von-Laue-Str. 160438Frankfurt am MainGermany\n\nFrom well-known tensor mesons to yet unknown axial-tensor mesons\n25 Jul 20221\nWhile the ground-state tensor (J P C = 2 ++ ) mesons a 2 (1320), K * 2 (1430), f 2 (1270), and f ′ 2 (1525) are well known experimentally and form an almost ideal nonet of quark-antiquark states, their chiral partners, the ground-states axial-tensor (J P C = 2 −− ) mesons are poorly settled: only the kaonic member K 2 (1820) of the nonet has been experimentally found, whereas the isovector state ρ 2 and two isoscalar states ω 2 and φ 2 are still missing. Here, we study masses, strong, and radiative decays of tensor and axial-tensor mesons within a chiral model that links them: the established tensor mesons are used to test the model and to determine its parameters, and subsequently various predictions for their chiral partners, the axial-tensor mesons, are obtained. The results are compared to current lattice QCD outcomes as well as to other theoretical approaches and show that the ground-state axial-tensor mesons are expected to be quite broad, the vector-pseudoscalar mode being the most prominent decay mode followed by the tensor-pseudoscalar one. Nonetheless, their experimental finding seems to be possible in ongoing and/or future experiments. 1 1Examples of very well-known qq mesonic nonets include the pseudoscalar mesons with J P C = 0 −+ (spectroscopic notation: 1 S 0 ), the vector mesons with J P C = 1 −− ( 3 S 1 ), and the axial-vector mesons with J P C = 1 ++ ( 3 P 1 ) [1]. The above resonances are in good agreement with the quark model of Ref.[2] and the Bethe-Salpeter approach of Ref.[3]. The scalar mesons with J P C = 0 ++ ( 1 S 0 ) are in the centre of a long-standing debate, e.g. Ref.[4][5][6][7][8][9][10][11]: there is no lack of candidates, on the contrary there are more states than expected from qq alone, in agreement with the intrusion of four-quark states and the scalar glueball. Summarizing, upon including the nonet of pseudovector mesons with J P C = 1 +− ( 1 P 1 ) and the orbitally excited vector mesons with J P C = 1 −− ( 3 D 1 ), for all nonets with n = 1 and J < 2 there are corresponding resonances in the PDG (with the interesting exception of the missing orbitally excited vector state φ(?), with an expected mass at about 1.9 GeV, see Ref.[12]).Moving to J ≥ 2, one recognizes the well established nonet of tensor mesons with J P C = 2 ++ ( 3 P 2 ), see e.g Refs.[6,13,14], and the quite well-known nonet of pseudotensor mesons with J P C = 2 −+ ( 1 D 2 ), even if, for the latter, some questions are still open[15,16]. The nonet of mesons with J P C = 3 −− ( 3 D 3 ) is also well known, as the recent detailed report of Ref.[17]shows.2On the other hand, as it is visible fromTable 1, the nonet of the so-called axial-tensor mesons with J P C = 2 −− ( 3 D 2 ) is extremely poorly known. Only the kaonic member K 2 (1820) (with eventual mixing with K 2 (1770)) is listed. The isovector member ρ 2 and the isotensor ones ω 2 and φ 2 were not yet discovered. One may actually regard this nonet as a sort of \"missing multiplet\". It is then evident that it deserves further theoretical and experimental investigations.One of the main goals of the present paper is a phenomenological study of masses, strong, and radiative decays of tensor and, most importantly, of axial-tensor mesons. In the latter case, predictions for the missing states are delivered. For our purposes, we shall use a well defined chiral model of QCD, called extended Linear Sigma Model (eLSM), that was previously successfully applied to pseudoscalar mesons and vector mesons and their chiral partners, the scalar and the axial-vector mesons[18](see the first 4 entries ofTable 1). Within this context, the linear realization of chiral symmetry, together with its explicit and spontaneous breaking patterns, allows to study chiral partners (that is, qq mesons with the same J related by chiral transformations) on the same footing. Applications of the eLSM to the excited (pseudo)scalar mesons [19,20], to pseudovector and orbitally excited vector mesons [21] and more recently to hybrid mesons[22]were undertaken.It then seems quite natural to apply the eLSM to the tensor sector, thus describing in a chiral framework both tensor and axial-tensor mesons. Since masses and decays of the ground-state tensor mesons are well-established, the tensor mesons allow for the determination of the (additional) parameters of the model and for a test of its validity in the energy range between 1-1.6 GeV. As we shall see, the overall agreement of theory with experiments is rather good and therefore confirms the predominant qq nature of the ground-state tensor mesons. [For different interpretations of tensor mesons and some other states listed inTable 1, see e.g. Refs.[23][24][25]].Next, we move to the yet mostly unknown axial-tensor mesons. The estimate of masses for the nonet members is possible thanks to the tensor states and to the known axial-tensor kaonic state K * 2 (1820). The decays of axial-tensor mesons into a vector-pseudoscalar pair turns out to be quite large and dominant. Also the decays into tensor-pseudoscalar and axial-vector-pseudoscalar are sizable and represent interesting decay modes for the future search of the missing states of this nonet. Light mesons (both conventional and exotic) are in the centre of various experimental searches, such as the BESIII [26,27], CLAS12 [28], COMPASS [29], GlueX [30-32] experiments as well as the planned PANDA experiment [33]. In particular, photoproduction of tensor mesons represents an active experimental [34]and phenomenological [35-37] topic. It is well possible that the missing axial-tensor mesons discussed in this work can be discovered in the future.This work is organized as follows: in Sec. 2 we introduce the fields and the Lagrangian terms describing masses and decays of (axial-)tensor states; in Sec. 3 we show the corresponding results. Finally, in Sec. 4 our conclusions are outlined.3\nn 2S+1 L J J P C I=1 ud, du dd−uu √ 2 I=1/2\nus, ds sd, su\nI=0 ≈ uu+dd √ 2 I=0\n≈ ss Meson names Chiral Partners 1 1 S 0 0 −+ π K η(547) η ′ (958) Pseudoscalar J = 0 1 3 P 0 0 ++ a 0 (1450) K ⋆ 0 (1430) f 0 (1370) f 0 (1500)/f 0 (1710) Scalar 1 3 S 1 1 −− ρ(770) K ⋆ (892) ω(782) φ(1020) Vector J = 1 1 3 P 1 1 ++ a 1 (1260) K 1A f 1 (1285) f ′ 1 (1420) Axial-vector  Table 1. List of conventional qq mesons following the quark model review of Ref. [1] up to J = 3 and for the lowest radial excitation. The columns refer to different values of the isospin I. The first eight nonets are grouped into four chiral partners. The kaonic states K 1,A and K 1,B mix and give rise to K 1 (1270) and K 1 (1400). Note, the entries for which no assignment is proposed are the orbitally excited vector φ(???) [12] as well as three axial-tensor states ρ 2 (???) ≡ ρ 2 , ω 2 (???) ≡ ω 2 and φ 2 (???) ≡ φ 2 , which represent one of the main subject of this work.\n1 1 P 1 1 +− b 1 (1235) K 1B h 1 (1170) h 1 (1415) Pseudovector J = 1 ⋆ 1 3 D 1 1 −− ρ(\n\nChiral model for spin-2 mesons\n\nIn this Section, we first recall the form of flavour and chiral multiplets and then we present the novel chiral Lagrangian terms that involve (axial-)tensor mesons.\n\nFor conventional qq pairs, the spin S can take the value S ∈ {0 , 1}, while the angular momentum L any value L = 0, 1, 2, .... As a consequence, the parity eigenvalue P = (−1) L+1 and the charge conjugation eigenvalue C = (−1) L+S follow. The spin and angular momentum couple to the total angular momentum J = L + S.\n\nFor S = 0, the qq state reads |S = 0 = 1 √ 2 |↑ q ↓ q − ↓ q ↑ q , while for S = 1 is |S = 1 = { |↑ q ↑ q , 1 √ 2 |↑ q ↓ q + ↓ q ↑ q , |↓ q ↓ q }. Thus, for S = 0 the possible quantum numbers for conventional qq mesons are J P C ∈ even −+ , odd +− , while for S = 1 they are J P C ∈ {0, 1, 2, ...} ++ , {1, 2, ...} −− . [Mesons with J P C ∈ even +− , odd −+ as well as 0 −− are considered exotic.]\n\nIn this work, we concentrate on (pseudo)scalar, (axial-)vector, as well as (axial-)tensor multiplets. These fields enter into appropriate chirally invariant Lagrangian terms that describes the masses and the decays of (axial-)tensor mesons.\n\n2.1. Mesonic nonets. The ground-state pseudoscalar mesons with J P C = 0 −+ ( 1 S 0 ) comprise 3 pions, four kaons, the η(547) and the η ′ (958). They can be collected into the following nonet with light-quark 4 elements P ij ≡ 2 −1/2q j iγ 5 q i : (2.1) where η N ≡ 1/2 (ūu +dd) stands for the purely non-strange state and η S ≡ss for the purely strange one. The isoscalar physical fields emerge upon mixing reported in e.g. Ref. [38] as:\nP = 1 √ 2     ηN +π 0 √ 2 π + K + π − ηN −π 0 √ 2 K 0 K −K 0 η S     ,η(547) η ′ ≡ η(958) = cos β P sin β P − sin β P cos β P η N η S , (2.2)\nwith a large mixing angle β P = −43.4 • . This sizable admixture is a consequence of the so-called U A (1) axial anomaly [39,40]. Namely, pseudoscalar mesons belong to a so-called \"heterochiral\" multiplet [41], see below.\n\nScalar mesons with J P C = 0 ++ (following from L = S = 1, thus 3 P 0 ) are the chiral partners of the pseudoscalar ones. The discussion about their assignment is still ongoing and there is not yet a general agreement. Nevertheless, the set of resonances {a 0 (1450), K * 0 (1430), f 0 (1370), f 0 (1500)/f 0 (1710)} reported in Table 1 is favoured (here, also the scalar glueball is expected to enter with f 0 (1710) being a good candidate). Having the quantum numbers of the vacuum, the isoscalar members of this nonet may condense, see Sec. 2.2. By introducing the currents S ij ≡ 2 −1/2q j q i , the nonet of scalar states can be written as\nS = 1 √ 2     σN +a 0 0 √ 2 a + 0 K ⋆+ 0 a − 0 σN −a 0 0 √ 2 K ⋆0 0 K ⋆− 0K ⋆0 0 σ S     . (2.3)\nThe isoscalar sector cannot be described by a simple 2 × 2 mixing because (at least) the scalar glueball should be taken into account, thus implying a more complicated 3 × 3 mixing patter leading to the resonances f 0 (1370), f 0 (1500), and f 0 (1710), e.g. Refs. [20,[42][43][44][45][46]. Yet, these fields do not appear as final states of decays of (axial-)tensor mesons, therefore its detailed treatment of the scalar-isoscalar mixing is not required in this work.\n\nThe third entry in Table 1 refers to the J P C = 1 −− ( 3 S 1 ) nonet with L = 0 and S = 1. These are the very well known vector states {ρ(770), K * (892), ω(782), φ(1020)}. The matrix V µ with elements 4) where ω N and ω S are purely non-strange and strange, respectively. Similar to the pseudoscalar case, the physical fields arise upon mixing\nV µ ij = 2 −1/2q j γ µ q i has the form V µ = 1 √ 2     ω µ N +ρ 0µ √ 2 ρ +µ K * +µ ρ −µ ω µ N −ρ 0µ √ 2 K * 0µ K * −µK * 0µ ω µ S     ,(2.ω(782) φ(1020) = cos β V sin β V − sin β V cos β V ω N ω S ,(2.5)\nwhere the small isoscalar-vector mixing angle β V = −3.9 • is taken from the PDG [1]. Thus, the physical states ω and φ are dominated by non-strange and strange components, respectively. This is in agreement with the so-called \"homochiral\" nature of these states [41], see also below.\n\nThe chiral partners of the vector mesons [47] are realized for the quantum numbers L = S = 1 (just as for the scalar mesons discussed previously) coupled to J P C = 1 ++ ( 3 P 1 ): this is the so-called axial-vector meson nonet A 1 , that arises from the microscopic current A µ 1,ij ≡ 2 −1/2q j γ 5 γ µ q i :\nA µ 1 = 1 √ 2     f µ 1,N +a 0µ 1 √ 2 a +µ 1 K +µ 1A a −µ 1 f µ 1,N −a 0µ 1 √ 2 K 0µ 1A K −µ 1AK 0µ 1A f µ 1,S     .\n(2.6)\n\nThe isoscalar sector reads\nf 1 (1285) f 1 (1420) = cos β A1 sin β A1 − sin β A1 cos β A1 f µ 1,N f µ 1,S , (2.7)\nwhere the mixing angle β A1 is expected to be small because of the homochiral nature of the multiplet [41], see also Ref. [48]. Here, we shall set this angle to zero for simplicity.\n\nAn important digression is needed for the kaonic axial-vector mesons. Since these states are not eigenstates of C, the state K 1,A belonging to the J P C = 1 ++ ( 3 P 1 ) axial-vector nonet and K 1,B belonging to the J P C = 1 +− ( 1 P 1 ) pseudovector nonet mix:\nK 1 (1270) K 1 (1400) µ = cos ϕ K −i sin ϕ K −i sin ϕ K cos ϕ K K 1,A K 1,B µ . (2.8)\nFor a detailed study on the K 1 (1270)/K 1 (1400) system using an approach similar to the one used in this work, see Ref. [48]. The numerical value ϕ K = (56.4 ± 4.3)\n\n• [47,48] implies that K 1 (1270) is predominantly K 1,B and K 1 (1400) is predominantly K 1,A (but the mixing is large). The study of this mixing angle via semileptonic decays can be found in e.g. Ref. [49].\n\nThe next (fifth and sixth) entries of Table 1 are the pseudovector (from which the K 1,B above stems) and their chiral partners, the (orbitally) excited vector mesons. One can build similar nonets (see Refs. [21,22]), yet they are not part of the decay products of the (axial-)tensor mesons studied in this paper, therefore we omit them in the following.\n\nFinally, we present the two tensor (J = 2) meson nonets (seventh and eighth rows of Table 1), which constitute the main subject of this work.\n\nThe well-known J P C = 2 ++ ( 3 P 2 ) tensor states with elements T µν ij = 2 −1/2q j (iγ µ ∂ ν + · · · )q i form an almost ideal nonet of quark-antiquark states:\nω µν 2,S     . (2.11)\nThe isoscalar mixing is expected to be small in view of the homochiral nature of the corresponding chiral multiplet in which this nonet is embedded [41] (see also below). Thus, for the isoscalar members:  Table 2.\n\n\nNonet\n\nParity (P ) Charge conjugation (C) Flavour (U V (3)) Table 2. Mesonic nonet transformations under P, C and U V (3). The pseudoscalar and scalar nonets build the matrix Φ = S + iP , (2.12) whose \"heterochiral\" transformation can be found in Table 3. As a consequence, the strange-nonstrange mixing angle can be large, as it is the case for the pseudoscalar mesons (the scalar one is not easy to determine because one has a three-state mixing problem) and possibly for the pseudotesnor mesons [15,41].\n0 −+ = P −P (t, − x) P t U P U † 0 ++ = S S(t, − x) S t U SU † 1 −− = V µ V µ (t, − x) −(V µ ) t U V µ U † 1 ++ = A µ 1 −A 1 µ (t, − x) (A µ 1 ) t U A µ 1 U † 2 ++ = T µν T µν (t, − x) (T µν ) t U T µν U † 2 −− = A µν 2 −A 2 µν (t, − x) −(A µν 2 ) t U A µν 2 U †\nVector and axial-vector nonets and similarly tensor and axial-tensor nonets build the following lefthanded and right-handed objects:\nL µ := V µ + A µ 1 , R µ := V µ − A µ 1 , (2.13) L µν := T µν + A µν 2 , R µν := T µν − A µν 2 .\n(2.14)\n\nTheir homochiral transformations are also listed in Table 3. One expects small isoscalar mixing angles in these four nonets [41].\n\nThe fields listed in Table 3 are the needed ingredients to write down chiral Lagrangian terms, as we shall show in the next subsection.\n\nNonet Table 3. Transformations of the chiral multiplets under P, C, and U R (3) × U L (3).\nParity (P ) Charge conjugation (C) U R (3) × U L (3) Φ(t, x) Φ † (t, − x) Φ t (t, x) U L ΦU † R R µ (t, x) L µ (t, − x) −(L µ (t, x)) t U R R µ U † R L µ (t, x) R µ (t, − x) −(R µ (t, x)) t U L L µ U † L R µν (t, x) L µν (t, − x) (L µν (t, x)) t U R R µν U † R L µν (t, x) R µν (t, − x) (R µν (t, x)) t U L L µν U † L\n\nChiral invariant Lagrangian terms.\n\nThe standard eLSM Lagrangian is a function of (pseudo)scalar and (axial-)vector mesons as well as a dilaton (or scalar glueball) field G, see Refs. [18,20,22]:\nL eLSM = L dil + Tr D µ Φ † D µ Φ − m 2 0 G G 0 2 Tr Φ † Φ − 1 4 Tr L 2 µν + R 2 µν +Tr m 2 vec G 2 2G 2 0 + ∆ L 2 µ + R 2 µ + · · · , (2.15)\nwhere L dil is the dilaton Lagrangian for the field G [54,55] and G 0 is the corresponding vacuum expectation value (v.e.v.). [Note, the dilaton field G will not be relevant but is formally important for dilatation invariance, but will not appear as a decay product.] The covariant derivative entering in the previous\nequation reads D µ Φ := ∂ µ Φ − ig 1 L µ Φ − ΦR µ .\nThe matrix ∆ breaks flavour symmetry by including a different mass for mesons carrying the strange quark:\n∆ =    δ N 0 0 0 δ N 0 0 0 δ S    where δ N ∼ m 2 u , δ S ∼ m 2 s . (2.16)\nThe eLSM is based on the proper treatment of dilatation and chiral invariances and their explicit and spontaneous breaking patterns. [For other chiral models that make use of dilatation invariance, see e.g.\n\nRefs. [56,57] and refs. therein]. The results for masses and decays of (pseudo)scalar and (axial-)vector mesons can be found in the afore mentioned Refs. [18,20]. For our present work, we need to recall some of its basic features.\n\n(i) The scalar-isoscalar fields of the model acquire nonzero v.e.v. The dilaton field G condenses to a certain value G 0 (whose numerical value is not needed here), which is related to the breaking of dilatation invariance. Similarly, qq scalar-isoscalar fields develop a v.e.v. as a consequence of spontaneous symmetry breaking (SSB), which in simple terms is due to the Mexican hat form of the effective potential when m 2 0 < 0. As a consequence, shifts are necessary:\nG → G + G 0 , S → S + Φ 0 with Φ 0 := 1 √ 2     φN √ 2 0 0 0 φN √ 2 0 0 0 φ S     . (2.17)\nwhere the numerical values are reported in Table 4.\n\n(ii) The axial-vector matrix must be shifted because SSB induces a mixing of scalar and axial-vector fields, which is proportional to the parameter g 1 = [18,19]. This operation amounts to:\nma 1 Zπ fπ 1 − 1 Z 2 π ≃ 5.8A 1 µ → A 1 µ + ∂ µ P, P := 1 √ 2     Zπ wπ(ηN +π 0 ) √ 2 Z π w π π + Z K w K K + Z π w π π − Zπwπ(ηN −π 0 ) √ 2 Z K w K K 0 Z K w K K − Z K w KK 0 Z ηS w ηS η S     , (2.18)\nwhere the constant terms are also given in  Table 4. Numerical values of (scalar and axial-vector) shift-related quantities needed in this work. 9 Next, we turn to the chirally invariant Lagrangian terms that contain (axial-)tensor mesons. For convenience, we shall split them into four distinct ones.\nZ π = Z ηN ma 1 √ m 2 a 1 −g 2 1 φ 2 S 1.709 w π = w ηN g1φN m 2 a 1 0.683 GeV −1 Z K 2mK 1A 4m 2 K 1A −g 2 1 (φN + √ 2φS ) 2 1.604 w K g1(φN + √ 2φS) 2m 2 K 1,A 0.611 GeV −1 Z ηS m f 1,S m 2 f 1,S −2g 2 1 φ 2 S 1.539 w ηS √ 2g1φS m 2 f 1,S 0.554 GeV −1 φ N Z π f π 0.158 GeV φ S 2ZK fK −φN √ 2 0.138 GeV g 1 ma 1 Zπfπ 1 − 1 Z 2 π 5.8\nFirst, the chiral invariant Lagrangian that generates, among other interactions, the masses of the spin-2 mesons reads\nL mass = Tr m 2 ten G 2 2 G 2 0 + ∆ ten L 2 µν + R 2 µν + h ten 1 2 Tr Φ † Φ Tr L µν L µν + R µν R µν (2.19) +h ten 2 Tr Φ † L µν L µν Φ + ΦR µν R µν Φ † + 2h ten 3 Tr ΦR µν Φ † L µν ,\nwhere ∆ ten = diag{δ ten N , δ ten N , δ ten S }; one may set the (anyhow small) light-quark contribution δ ten N = 0, since a term proportional to the identity matrix can be reabsorbed into the term proportional to m ten ; the element δ ten S is then obtained from the mass relation δ ten S = m 2 K2 − m 2 a2 ≃ 0.3 GeV 2 using PDG values for the tensor mesons (details in Sec. 2.18). Besides the term proportional to ∆ ten , all the other terms involve dimensionless coupling constants.\n\nAccording to the large-N c limit, the coupling constants h ten 2 and h ten 3 scale as N −1 c , while h ten 1 as N −3 c , thus being suppressed. The mass term m ten is N c -independent (it is a mass term that sets the mass scale of (axial-)tensor mesons), while the condensate G 0 scales as N c . As a consequence, the dimensionless coupling m 2 ten /G 2 0 scales as N −2 c .\n\nWe then turn to other interaction terms that generate the decays of (axial-)tensor mesons. The first of such terms involves solely left-and right-handed chiral fields: sation of G, the term above is reobtained; this is omitted here, since no relevant additional interactions emerge). The Lagrangian L g ten 2 enables us to compute the following two types of decays:\nL g ten 2 = g ten 2 2 Tr L µν {L µ , L ν } + Tr R µν {R µ , R ν } + g ′ ten 2 6 Tr L µν + R µν Tr {L µ , L ν } + {R µ , R ν } ,(2.(1) 2 ++ −→ 0 −+ + 0 −+ ; (2) 2 −− −→ 0 −+ + 1 −− .\nBoth decays are extremely relevant in this work, since the pseudoscalar-pseudoscalar mode is the dominant one for the tensor mesons, while the pseudoscalar-vector one is the dominant channel for the axial-tensor states. Eq. (2.20) shows that they are related by chiral transformations, and hence depend on the same coupling constant(s).\n\nThe next Lagrangian that couples left-handed and right-handed fields involves derivatives:\nL a ten = a ten 2 Tr L µν {L µ β , L νβ } + R µν {R µ β , R νβ } + a ′ ten 6 Tr L µν + R µν Tr {L µ β , L νβ } + {R µ β , R νβ } ,(2.21)\nwhere L µν := ∂ µ L ν − ∂ ν L µ and analogously for R µν . The large-N c scaling behaviors are a ten ∝ N inclusion of the photon field via vector meson dominance (VMD), it describes the decay of the tensor mesons to two photons, one photon and one vector mesons, as well as giving a subleading but important contribution to the decay into two vector mesons.\n\nThe next chiral interaction term reads\nL c ten = c ten 1 Tr ∂ µ L ναL µν ∂ α Φ Φ † − ∂ µ R να Φ † ∂ α ΦR µν − ∂ µ R ναR µν ∂ α Φ † Φ + ∂ µ L να Φ∂ α Φ †L µν +c ten 2 Tr ∂ µ L να ∂ α ΦR µν Φ † − ∂ µ R να Φ †L µν ∂ α Φ − ∂ µ R να ∂ α Φ †L µν Φ + ∂ µ L να ΦR µν ∂ α Φ † , (2.22) whereL µν := εµνρσ 2 (∂ ρ L σ − ∂ σ L ρ )\nand similarly forR µν . This Lagrangian breaks also dilatation invariance as it is typical for terms involving the Levi-Civita tensor. Both constants c ten 1 and c ten 2 scale as N −1/2 c . Large-N c suppressed terms are possible but are omitted here since present data do not allow to constrain them. The relevant decay terms are:\n(1) 2 ++ −→ 0 −+ + 1 −− ; (2) 2 −− −→ 0 −+ + 1 ++ .\nThese decay channels are related by chiral symmetry and for tensor mesons they are quite relevant. Note, the pseudoscalar meson as a decay product is a consequence of the shift of Eq. (2.18).\n\nThe decay of a generic spin-2 state has the form:\nΓ tl T →A+B = | k a,b | 40 π m 2 t × |M| 2 × κ i × Θ(m t − m a − m b ) , (2.23)\nwhere m t is the mass of the decaying (axial-)tensor particle, m a and m b are the masses of the decay products, Θ(x) denotes the Heaviside step-function, and the modulus of the outgoing particles momentum has the following analytic expression:\n| k a,b | := 1 2 m t (m 2 t − m 2 a − m 2 b ) 2 − 4m 2 a m 2 b . (2.24)\nWe obtain the (eventually dimensionful) factors κ i entering in Eq. (2.23) for the i-th decay channel from the explicit forms of the Lagrangian (the index i runs over the flavor channels, see the following). The decay amplitudes |M| 2 , derived via Feynman rules under the use of the polarization vectors (tensors) and their corresponding completeness relations, are listed in Table 5. To this end, we recall that one has to average over all incoming spin-polarizations, sum up all possible outgoing ones, as well as considering Decay Mode Table 5. Decay amplitudes for different decay modes. the following completeness relations (for further details see e.g. [58]):\n1 5 × |M| 2 2 ++ −→ 0 −+ + 0 −+ g ten 2 2 × 2| k p (1) ,p (2) | 4 15 2 −− −→ 0 −+ + 1 −− g ten 2 2 × | kv,p| 2 15 5 + 2| kv,p| 2 m 2 v 2 −− −→ 0 −+ + 2 ++ 4h ten 2 3 45 45 + 4| kt,p| 4 m 4 t + 30| kt,p| 2 m 2 t 2 ++ −→ 0 −+ + 1 −− (c ten 1 +c ten 2 ) 2 m 2 t | kv,p| 4 5 2 −− −→ 0 −+ + 1 ++ (c ten 1 −c ten 2 ) 2 m 2 a 2 | ka 1 ,p | 4 53 λ=1 ǫ µ (λ, k) ǫ ν (λ, k) = −G µν , (2.25) 5 λ=1 ǫ µν (λ, k) ǫ αβ (λ, k) = − G µν G αβ 3 + G µα G νβ + G µβ G να 2 , (2.26) where G µν ≡ η µν − k µ k ν m 2 , η µν ≡       1 0 0 0 0 −1 0 0 0 0 −1 0 0 0 0 −1       . (2.27)\n\nResults\n\nIn this section we present the results for the (axial-)tensor mesons. First, we discuss the masses of the well established tensor mesons and of their poorly known chiral partners, the axial-tensor ones. Then, we turn to the decays, first those of tensor mesons (that are well measured and serve as a test of the approach and for parameter determination), and then to the decays of the ground-state axial-tensor mesons (that are mostly experimentally unknown). For the reader's convenience, in Table 6 we summarize the parameters of the eLSM related to the (axial-)tensor sector that will be obtained via various fit procedures later on. \nm 2 a2 = m 2 ten + 2δ ten N + h ten 3 φ 2 N 2 + h ten 2 φ 2 N 2 + h ten 1 2 (φ 2 N + φ 2 S ) ,(3.1)\nm 2 K2 = m 2 ten + δ ten N + δ ten\nS + h ten 1 2 (φ 2 N + φ 2 S ) + 1 √ 2 h ten 3 φ N φ S + h ten 2 4 (φ 2 N + 2φ 2 S ) ,(3.\n2) m 2 f2,N = m 2 ten + 2δ ten  Table 7 δ ten S 0.3 GeV 2 Table 7 g ten 2 (1.392 ± 0.024) · 10 4 (MeV) Table 9 g ′ ten 2 (0.024 ± 0.041) · 10 4 (MeV) Table 9 g ten 2 lat\nN + h ten 3 φ 2 N 2 + h ten 1 2 (φ 2 N + φ 2 S ) + h ten 2 φ 2 N 2 ,(3.\n(0.7 ± 0.4) · 10 4 (MeV) Table 16 c ten (4.8 ± 0.9) · 10 −7 (MeV) −3 Table 10 a ten (−2.09 ± 0.06) · 10 −2 (MeV) −1 Table 12 a ′ ten (3.5 ± 0.4) · 10 −3 (MeV) −1 Table 12 β T (3.16 ± 0.81) • Table 9  Table 6. Parameters of the eLSM connected to the (axial-)tensor mesons as determined by fits to known experimental data (see the following for details). Note, the suffix \"lat\" in g ten 2 lat indicates that it was obtained via a comparison to lattice results. m 2 f2,S = m 2 ten + 2δ ten\nS + h ten 1 2 (φ 2 N + φ 2 S ) + h ten 3 φ 2 S + h ten 2 φ 2 S . (3.4)\nThe analogous expressions for the axial-tensor mesons read:\nm 2 ρ2 = m 2 ten + 2δ ten N − h ten 3 φ 2 N 2 + h ten 2 φ 2 N 2 + h ten 1 2 (φ 2 N + φ 2 S ) ,(3.\n\n5)\n\nm 2 K2A = m 2 ten + δ ten N + δ ten\nS + h ten 1 2 (φ 2 N + φ 2 S ) − 1 √ 2 h ten 3 φ N φ S + h ten 2 4 (φ 2 N + 2φ 2 S ) , (3.6) m 2 ω2,N = m 2 ten + 2δ ten N − h ten 3 φ 2 N 2 + h ten 2 φ 2 N 2 + h ten 1 2 (φ 2 N + φ 2 S ) ,(3.7)\nm 2 ω2,S = m 2 ten + 2δ ten S − h ten 3 φ 2 S + h ten 2 φ 2 S + h ten\n1 2 (φ 2 N + φ 2 S ) . (3.8)\nWe observe that in each nonet the masses of the isovector and the nonstrange isoscalar members are identical:\nm 2 ρ2 = m 2 ω2,N and m 2 a2 = m 2 f2,N . (3.9)\nThis degeneracy is broken by the (small) isoscalar mixing angle.\n\nThe following three equations relate the masses of chiral partners:\nm 2 ρ2 = m 2 a2 − h ten 3 φ 2 N ,(3.10)m 2 K2A = m 2 K2 − √ 2h ten 3 φ N φ S , (3.11) m 2 ω2,S = m 2 f2,S − 2h ten 3 φ 2 S ,(3.12)\nout of which one obtains the following numerical estimate (using K 2 (1820) and K * 2 (1430) as inputs):\nh ten 3 = m 2 K2A − m 2 K2 √ 2φ N φ S ≃ −41 .(3.13)\nNext, by using the PDG masses of the two tensor mesons and considering δ ten N ≃ 0 and φ 2 N ≃ 2φ 2 S , one gets:\nδ ten S = m 2 K2 − m 2 a2 ≃ 0.3 GeV 2 .\n(3.14)\n\nThe following considerations are in order:\n\n(1) The mass of the purely strange resonance ω 2,S ≃ φ 2 is predicted to be:\nm 2 φ2 ≃ m 2 ω2,S = m 2 a2 + 2δ ten S − 3 2 h ten 3 φ 2 N ,(3.15)\nwhich implies the numerical value for the missing resonance φ 2 ≃ ω 2,S as:\nm φ2 ≈ 1971 MeV . (3.16)\nIn other words, the missing state φ 2 (???) of Table 1 could appear as a novel resonance φ 2 (1971). (2) Using the following relation between the masses of chiral partners\nm 2 ρ2 = m 2 a2 − h ten 3 φ 2 N ,\nwe get the following prediction for the not-yet discovered resonance ρ 2 :\nm ρ2 = 1663 MeV . (3.17)\nSince we neglect the isoscalar mixing, we also have m ρ2 ≃ 1663 MeV. Thus, the new resonances ρ 2 (1663) and ω 2 (1663) could possibly appear in the mesonic spectrum. The small departures of the two isoscalar-tensor states can be easily explained by introducing a small isoscalar mixing angle. In our case, we shall study this mixing angle in the context of two-pseudoscalar and two-photon decay processes. When including the isoscalar mixing in the tensor sector, Table 7 summarizes our results for the (axial-)tensor masses. Table 7. Masses of the mesons predicted by the eLSM. Bold entries are the PDG values. The (small) mixing for the tensor-isoscalar mesons has been taken into account.\n\n\nResonances Masses (in MeV) Resonances Masses (in MeV)\na 2 (1320) 1317 ρ 2 (?) 1663 K * 2 (1430) 1427 K 2 (1820) 1819 f 2 (1270) 1297 ω 2,N 1663 f ′ 2 (1525) 1538 ω 2,S 1971\n\n3.2.\n\nDecays of tensor mesons. In this subsection, we compare the predictions for the strong and radiative decay of tensor mesons with available PDG data. L tpp = g ten 2 Tr T µν (∂ µ P) , (∂ ν P) + g ′ ten 2 3\n\nTr T µν Tr (∂ µ P) , (∂ ν P) .\n\n(\n\n\n3.19)\n\nThe factor 1/3 in front of the second term is chosen in such a way that for the singlet state the same normalization occurs. Namely, by using the decomposition √ 2T 2,µν = 8 a=0 T a µν λ a √ 2 together with λ 0 = The tree-level decay rate is\nΓ tl T −→P (1) +P (2) (m t , m p (1) , m p (2) ) = κ tpp ,i | k p (1) ,p (2) | 5 60 π m 2 t Θ(m t − m p (1) − m p (2) ) ,(3.20)\nwhere the coefficients κ tpp ,i (with dimension [Energy −2 ]) are listed in Table 8.\n\nDecay process κ tpp ,i a 2 (1320) −→K K 2 g ten 2 Z 2 k w 2 k 2 2 a 2 (1320) −→ π η g ten 2 Z π Z ηN w π w ηN cos β P 2 a 2 (1320) −→ π η ′ − g ten 2 Z π Z ηN w π w ηN sin β P 2 K * 2 (1430) −→ πK 3 g ten 2 Z k w k Zπ wπ 2 2 f 2 (1270) −→K K 2 Z 2 k w 2 k (4g ′ ten 2 +3g ten 2 ) cos βT + √ 2(2g ′ ten 2 +3g ten 2 ) sin βT 6 2 f 2 (1270) −→ π π 6 Z 2 π w 2 π (2g ′ ten 2 +3g ten 2 ) cos βT + √ 2g ′ ten 2 sin βT 6\n2 f 2 (1270) −→ η η 2 Z 2 η N w 2 η N\ncos β 2 P (2g ′ ten 2 +3g ten 2 ) cos βT + √ 2g ′ ten 2 sin βT +Z 2 η S w 2 η S sin β 2 P √ 2(g ′ ten 2 +3g ten 2 ) sin βT +2g ′ ten 2 cos βT 6 2 f ′ 2 (1525) −→K K 2 Z 2 k w 2 k −(4g ′ ten 2 +3g ten 2 ) sin βT + √ 2(2g ′ ten 2 +3g ten 2 ) cos βT 6 2 f ′ 2 (1525) −→ π π 6 Z 2 π w 2 π −(2g ′ ten 2 +3g ten 2 ) sin βT + √ 2g ′ ten 2 cos βT 6\n2 f ′ 2 (1525) −→ η η 2 Z 2 η N w 2 η N cos β 2 P −(2g ′ ten 2 +3g ten 2 ) sin βT + √ 2g ′ ten 2 cos βT +Z 2 η S w 2 η S sin β 2 P √ 2(g ′ ten 2\n+3g ten 2 ) cos βT −2g ′ ten 2 sin βT 6 2 Table 8. Coefficients for the decay channel T −→ P (1) + P (2) .\n\nWe perform a fit to the PDG data of Table 9 with three parameters: two coupling constants, the large-N c dominant g ten 2 and the subdominant g ′ ten 2 , as well as the mixing anlge β T . The fit gives: 2)% f ′ 2 (1525) −→ π π 0.67 ± 0.14 0.71 ± 0.14 ↔ (0.83 ± 0.16)% f ′ 2 (1525) −→ η η 1.81 ± 0.05 9.9 ± 1.9 ↔ (11.6 ± 2.2)% Table 9. Decay rates for T −→ P (1) + P (2) .\n\nAs predicted by large-N c arguments, the results confirm that the coupling constant g ′ ten 2 is much smaller than g ten 2 . Due to the quite large error, it is also compatible with zero. Yet, the phenomenology of large-N c suppressed decay (as e.g. the decays of the J/ψ [59]) shows that such terms, even if small, do not vanish. Moreover, the following prediction is obtained which due to large uncertainties was excluded from the fitting procedure.\n\nNote, the isospin mixing angle β T = 3.16 • is close (albeit not equal) to the value β T = 5.7 • of PDG calculated via the following formula\nβ T = 35.3 • − arctan 4m 2 K2 − m 2 a2 − 3m 2 f ′ 2 −4m 2 K2 + m 2 a2 + 3m 2 f2 . (3.23)\nIn general, the results of Table 9 show a good qualitative agreement. Yet, some entries are at odds with experimental ones, but one should recall that the experimental data are quite precise and only three parameters were used. The results could be improved by adding further large-N c suppressed terms as well as flavor-symmetry breaking contributions. In this way a more accurate description of the tensor decays could be possible. Such a precision study of tensor states could be interesting on its own but is not the main goal of this paper, thus it is left for the future. \nL tvp = (c ten 1 + c ten 2 ) ε µνρσ Tr ∂ µ T να ∂ ρ V σ (∂ α P )Φ 0 − Φ 0 (∂ α P ∂ ρ V σ ) . (3.24)\nDefining c ten := c ten 1 + c ten 2 , the tree-level decay rate formula reads\nΓ tl T −→V +P (m t , m v , m p ) = c ten 2 | k v,p | 5 40 π κ tvp ,i Θ(m t − m v − m p ) , (3.25)\nwhere the factors κ tvp ,i of mass dimension 2 are reported in Table 10.\n\nWe obtain the value for the coupling c ten by performing a χ 2 -fit to the data of Table 10 \nV µν → V µν + e g ρ F µν Q , (3.27) where V µν ≡ ∂ µ V ν − ∂ ν V µ , Q = diag{2/3, −1/3, −1/3} is the quark charge matrix, F µν = ∂ µ A ν − ∂ ν A µ\nis the electromagnetic field tensor, e = √ 4πα is the electric coupling constant, and g ρ ≃ 5.5 ± 0.5 parametrizes the photon-vector-meson transition. As a first application, we consider T −→ γP by applying the VMD shift of Eq. (3.27) into Eq. (3.24) that leads to the Lagrangian 28) and to the corresponding decay rate Γ tl T −→γ+P (m t , m p ) = c ten 2 | k γ,p | 5 40 π κ tγp ,i Θ(m t − m p ) .  Table 11. Decay rates and coefficients for the decay channel T −→ γ + P .\nL tγp = e g ρ c ten Tr ∂ µ T να F µν Q(∂ α P )Φ 0 − Φ 0 (∂ α P F µν Q ,(3.\nTaking into account c ten in Eq. (3.26) as well as g ρ = 5.5 ± 0.5, we use the following equation to calculate the theoretical errors in Table 11:\nδΓ T →γP (m t , m p ) = ∂Γ T →γP (m t , m p ) ∂c ten δc ten 2 + ∂Γ T →γP (m t , m p ) ∂g ρ δg ρ 2 .\n(3.30)\n\nOur results for the photon-vector decays are reported in Table 11: they are somewhat larger but, in consideration of the large errors, in qualitative agreement with the PDG results.\n\nNext, we describe the two-photon decays. We note that the chiral Lagrangian of Eq. (2.21) delivers the following TVV interaction term: where m t = 2| k| was used.\nL tvv = a ten Tr T µν {V µ β , V νβ } + a ′ ten 3 Tr T µν Tr {V µ β , V νβ } .\nBy using the experimental values of Table 12, a standard χ 2 approach with two free parameters (the coupling constants a ten and a ′ ten , β T = 3.16 • kept fixed) and three experimental data-points, gives:\na ten = (−2.09 ± 0.06) · 10 −2 (MeV) −1 , a ′ ten = (3.5 ± 0.4) · 10 −3 (MeV) −1 (3.34)\nThe theoretical results are also listed in Table 12. Thus, in this case the coupling constants are directly fitted to the decay rates. The fact that all 3 data points are well described confirm that the value the mixing angle β T = 3.16 • is consistent with data. Moreover, the parameter a ′ ten turns out to be much smaller than a ten in agreement with the large-N c expectations. [Note: in the fit, we fixed g ρ = 5.5 and determined the coupling constant a ten ; actually, the combination a ten /g 2 ρ enters into the expressions. Yet, allowing for a variation of g ρ would not lead to any significant changes here, since it could be reabsorbed by a change of a ten .]\n\nThese radiative decay channels also show that the coupling with photons is sizable, thus the production of these not-yet discovered states ρ 2 , ω 2 , and φ 2 in photoproduction experiments is well upheld.\n\nDecay process (in model) eLSM (keV) PDG-2020 (keV) κ tγγ ,i a 2 (1320) −→ γγ 1.01 ± 0.06 1.00 ± 0.06 a ten 2 36 f 2 (1270) −→ γγ 1.95 ± 0.10 2.6 ± 0.5 (5a ten +4a ′ ten ) cos βT + √ 2(a ten +2a ′ ten ) sin βT 18 2 f ′ 2 (1525) −→ γγ 0.083 ± 0.009 0.082 ± 0.009 −(5a ten +4a ′ ten ) sin βT + √ 2(a ten +2a ′ ten ) cos βT 18 2 Table 12. Decay rates and coefficients for the decay channel T −→ γγ .\n\nIt is possible to use the two parameters presented in Eq. \nL tγV = 2a ten e g ρ Tr T µν {QF µ β , V νβ } + 2a ′ ten 3 e g ρ Tr T µν Tr {QF µ β , V νβ } . (3.35)\nThe vector-photon decay rates take the form\nΓ tl T −→γ+V (m t , m v ) = κ tγv ,i e 2 15 π m 2 t m 2 v g 2 ρ 3| k v,γ | 7 + 5| k v,γ | 3 m 2 v + 5| k v,γ | 4 m 2 v | k v,γ | 2 + m 2 v + | k v,γ | 5 10m 2 v − 3(| k v,γ | 2 + m 2 v ) . (3.36)\nThe corresponding coefficients are reported in Table 13 and the numerical predictions for the not-yet measured decay rates in Table 14. The corresponding errors are obtained by considering Eq. (3.34) together with g ρ = 5.5 ± 0.5. [Note, the variation for g ρ = 5.5 ± 0.5 must be taken into account for the evaluation of the errors since the different ratio a ten /g ρ enters into the expressions.] Additional sources of errors, such as the uncertainties of masses, were neglected for simplicity. Thus, the actual errors can be somewhat larger but of the same order of the ones reported in Table 14. 3.3.1. Vector-vector decay mode of tensor mesons. We conclude the present subsection by considering the following PDG data: It is natural to interpret these decays as vector-vector decay modes (ρ(770)ρ(770), ω(782)ρ(770), and K * (892)ρ(770)), in which the ρ(770) meson further decays into two pions. In order to describe them, we introduce the properly normalized \"Sill\" spectral function discussed in Ref. [61] for the ρ-meson as (3.38) in which Γ ρ→2π = 149.1 MeV and m ρ = 775.11 MeV are taken from the PDG (small errors omitted).\nPDG : Γ[f 2 (1270) −→ π + π − 2π 0 ] ≈d ρ (y) = 2y π y 2 − 4m 2 πΓρ (y 2 − m 2 ρ ) 2 + ( y 2 − 4m 2 πΓρ ) 2 Θ(x − 2m π ), ∞ 0 dy d ρ (y) = 1 , (3.37) whereΓ ρ is defined asΓ ρ ≡ Γ ρ→2π m ρ m 2 ρ − 4m 2 π ,\n\n19\n\nDecay process (in model) κ tγv ,i a 2 (1320) −→ ρ(770) γ a ten 6 2 a 0 2 (1320) −→ ω(782) γ a ten cos βV 2 2 a 2 (1320) −→ φ(1020) γ a ten sin βV 2 2 K * ± 2 (1430) −→K * ± (892) γ a ten 6 2 K * 0 2 (1430) −→K * 0 (892) γ a ten 3 2 f 2 (1270) −→ ρ(770) γ (a ten +2a ′ ten ) cos βT + √ 2a ′ ten sin βT 2 2 f 2 (1270) −→ ω(782) γ cos βV (a ten +2a ′ ten ) cos βT + √ 2a ′ ten sin βT −2 sin βV (a ten +a ′ ten ) sin βT + √ 2a ′ ten cos βT 6 2 f 2 (1270) −→ φ(1020) γ sin βV (a ten +2a ′ ten ) cos βT + √ 2a ′ ten sin βT +2 cos βV (a ten +a ′ ten ) sin βT + √ 2a ′ ten cos βT 6\n2 f ′ 2 (1525) −→ ρ(770) γ −(a ten +2a ′ ten ) sin βT + √ 2a ′ ten cos βT 2 2 f ′ 2 (1525) −→ ω(782) γ\nsin βT −(a ten +2a ′ ten ) cos βV +2 √ 2a ′ ten sin βV +cos βT √ 2a ′ ten cos βV −2(a ten +a ′ ten ) sin βV 6 2 f ′ 2 (1525) −→ φ(1020) γ cos βT −2(a ten +a ′ ten ) cos βV − √ 2a ′ ten sin βV +sin βT 2 √ 2a ′ ten cos βV +(a ten +2a ′ ten ) sin βV 6 2 Table 13. Coefficients for the decay channel T −→ γ + V decays.  Table 14. Predictions for T −→ γ + V .\nf 2 (1270) −→ φ(1020) γ 0.007 ± 0.002 f ′ 2 (1525) −→ ρ(770) γ 0.32 ± 0.08 f ′ 2 (1525) −→ ω(782) γ 0.012 ± 0.005 f ′ 2 (1525) −→ φ(1020) γ 0.61 ± 0.12\nThe Sill spectral function is useful because the normalization is guaranteed also for broad states and because the contribution of virtual particles (the pion-pion loop for the ρ meson) has a vanishing real part, thus only the imaginary part describing the decay width is sufficient (in other words, no modification of the ρ(770)-mass part of the denominator appears), see details in Ref. [61].\n\nThere are two chiral invariant Lagrangians, Eq. (2.20) and Eq. (2.21), that contribute to the coupling of tensor mesons to two vector mesons. We present the following approximate results by considering destructive interference between the corresponding amplitudes (the constructive case delivers too large decay rates):\nΓ f2→ρρ→4π ≃ ∞ 0 dy 1 d ρ (y 1 ) ∞ 0 dy 2 d ρ (y 2 ) Γ f2→ρρ (m f2 , y 1 , y 2 ) ≈ 29.9 MeV ; (3.39) Γ a2→ωρ→ω2π ≃ ∞ 0 dy 1 d ρ (y 1 ) Γ a2→ρω (m a2 , m ω1 , y 1 ) ≈ 11.1 MeV ; (3.40) Γ K2→K ⋆ ρ→K2π ≃ ∞ 0 dy 1 d ρ (y 1 ) Γ K2→ρω (m K2 , m K1 , y 1 ) ≈ 6.6 MeV . (3.41)\nThe results are in qualitative agreement with the experimental ones: this is quite remarkable since no additional parameter is requested. Moreover, this is a nontrivial process that involves two distinct interaction terms (with destructive interference) as well as the integral over the spectral function of the ρ-meson. \nL a2vp = g ten 2 Tr A µν 2 (∂ µ P) , V ν . (3.42)\nThe tree-level decay rate takes the form:\nΓ tl A2−→V +P (m a2 , m v , m p ) = g ten 2 2 | k v,p | 3 120 π m 2 a2 5 + 2 | k v,p | 2 m 2 v κ a2vp ,i Θ(m a2 − m v − m p ) ,(3.43)\nwhere the κ a2vp ,i can be found in Table 15 together with the decay widths. We observe quite large decay rates for this decay mode. Yet, our results can be considered qualitative for various reasons:\n\n(i) the interaction strength is determined solely by the knowledge on tensor mesons: while this is in agreement with chiral symmetry, no corrections to it have been taken into account, but chiral symmetry breaking effects are expected to be relevant between 1-2 GeV;\n\n(ii) the result depends on quantities of the type (Zw) 2 ∝ g 4 1 (see Tables 15 and 4), thus an even small uncertainty in this parameter of the original eLSM generates a quite large change of the results of the decays of axial-tensor states;\n\n(iii) the parameter g 1 (as well as others, such as g ten 2 ) is taken as a constant over a large range of energies, yet it is reasonable to assume that it has a (soft) energy dependence. One might expect that it becomes smaller when the mass of the decaying particle increases, thus embedding the effect of form factors (and eventually corrections due to quantum fluctuations). Also in this case, even a small change would have a non-negligible consequence leading to the left side of the quoted ranges in table 15.\n\nSummarizing, the used parameters (in particular g 1 ) imply a quite large and difficult to determine source of uncertainty of our decays of axial-tensor states. In order to be on the safe side, we thus estimate a quite large error of about 50%, for the reported numbers in Table 15.\n\nExperimental data is missing for the ρ 2 , ω 2,N ≃ ω 2 , and ω 2,S ≃ φ 2 . In the kaonic sectors, the resonances K 2 (1820) and K 2 (1770) are expected to emerge from the bare axial-tensor and pseudotensor mesons which can mix in a way that resembles the mixing of the axial-vector and pseudovector mesons described in Eq. (2.8).\n\nAccording to the assignment of Table 1, K 2A is closer to K 2 (1820), (but this is not yet settled). The decay width for the K 2A state described in our work is approximately twice of the experimentally measured decay of K 2 (1820). This fact suggests that the left sides of the range of Table 15 for the K 2A state is favoured.\n\nThis interpretation can be extended to the other decay rates by a comparison with the lattice QCD results reported in Table 16. Namely, our theoretical results for decays are of the same order of magnitude but about 2-3 times larger than the LQCD ones. Even though both approaches have large uncertainties, this comparison (as well as the previous arguments) signalizes that the low side of the range of each decay mode of the eLSM should be preferred.\n\nFor completeness we also perform a parameter determination by directly using the LQCD results, that leads to g ten 2 lat ≃ (0.7 ± 0.4) · 10 4 (MeV) (assuming 50 percent error in [62]) 6 . This value is within two sigma of the previous determination in Eq. (3.21). In Table 16, we present the corresponding results.\n\nQuite interestingly, the various entries are consistent with each other, thus showing that any ratio of decays constructed with lattice results is in agreement with the corresponding eLSM one.\n\nIn summary, the outcome of our theoretical study is pretty clear: although the uncertainties are still large, the axial-tensor states are expected to be broad even when taking the low side of our results. This fact could eventually explain the missing experimental observation of the putative states ρ 2 , ω 2 , and φ 2 up to now.\n\n3.4.2. A 2 −→ A 1 + P decay mode. The chiral Lagrangian of Eq. (2.22) contains the decay into an axial-tensor and pseudoscalar pair:\nL a2a1p = c ′ ten ε µνρσ Tr ∂ µ A να 2 (∂ ρ A σ 1 )(∂ α P )Φ 0 − Φ 0 (∂ α P )(∂ ρ A σ 1 ) ,(3.44)\nwhere c ′ ten := c ten 1 − c ten 2 . The corresponding decay is:\n\nΓ tl A2−→A1+P (m a2 , m a1 , m p ) = c ′ ten 2 | k a1,p | 5 40 π κ a2ap ,i Θ(m a2 − m a1 − m p ) . (3.45) The theoretical predictions (as well as the κ a2ap ,i values) for each channel proportional to the factor c ′ ten c ten are presented in Table 17 (we assume here, for simplicity, that K 1A ≈ K 1 (1400)). 6 Note that, in the SU (3) flavor symmetry based LQCD calculation, the lightest pseudoscalar states have a mass of about 700 MeV. Table 18. Predictions and coefficients for the decay channel A 2 → T + P .\n\nIn the end, it should be stressed that the sum of the various decay rates for the axial-tensor mesons generates quite large decay widths for these states, even by taking the lowest side of the given ranges.\n\nNevertheless, the discovery of the missing axial-tensor states seems possible, especially by looking into the decay channels described in this subsection.\n\n\nConclusions\n\nIn this work we have studied the well known lightest tensor mesons and their (still poorly known) chiral partners, the axial-tensor mesons, in the framework of a chiral model for low-energy QCD, the eLSM.\n\nThe masses as well as the strong and radiative decays of the ground-state tensor nonet fit well into the quark-antiquark picture, thus confirming the assignment of the quark model review of the PDG. Thanks to chiral symmetry, the parameters determined in the tensor sector allow to make predictions for masses and decays for the basically unknown ground-state axial-tensor resonances (the states ρ 2 , ω 2,N ≃ ω 2 ,\n\nand ω 2,S ≃ φ 2 were not yet seen in experiments; only the kaonic state K 2 (1820) is listed in the quark model review of the PDG). Even though the uncertainties are large -the widths are determined solely by the chiral link of tensors to axial-tensors and small changes in some key parameters generate quite sizable variations-the emerging picture is quite clear: the axial-tensor mesons are broad, the largest decay channel is the one into vector-pseudoscalar, followed by tensor-pseudoscalar and axial-vectorpseudoscalar pairs, respectively. Large decay widths into vector-pseudoscalar pairs are also obtained by LQCD and the corresponding decay ratios from lattice fit well with the ones determined by our model calculations.\n\nWe may conclude that the states ρ 2 , ω 2 , and φ 2 can be discovered in ongoing and future experiments (see e.g. Refs. [26][27][28][29][30][31][32][33][34][35][36][37] and refs. therein), even if that shall not be an easy task, due to the expected large decay widths.\n\nThe study of partial wave analysis [16,63] of the decays of (axial-)tensor mesons represents an interesting direction to further constrain models in the future. Moreover, a detailed investigation of the tensor glueball (whose LQCD predicted mass is about 2.2 GeV [64]) in a chiral framework is a promising outlook, since the topic of glueballs is a relevant one in low-energy QCD and various tensor mesons in the energy region at about 2 GeV exist. 25 \n\n\nω 2,N ≃ ω 2 and ω 2,S ≃ φ 2 . The transformation rules under parity, charge conjugation, and flavor transformations for all the relevant nonets of this work (P, S, V, A 1 , T, A 2 ) are summarized in\n\nFinally\n, we introduce the chiral multiplets which contain chiral partners and have simple transformations under the chiral group U R (3) × U L (3).\n\n\nare possible, but are not considered here. The coupling constants have dimension [Energy], thus the Lagrangian can be made dilatation invariant by multiplying by G/G 0 . (Upon conden-\n\n( 3 )\n3As a consistency check, the eLSM predicts the mass of the purely strange isoscalar tensor which m f2,S ≃ 1520 MeV, slightly lighter than the physical value of the resonance f ′ 2 (1525) that amounts to 1538 MeV. According to the relation m 2 a2 = m 2 f2,N , one has m f2,N = 1317 MeV, to be compared with the mass of f 2 (1270) of about 1297 MeV.\n\n\n. T −→ P (1) + P(2) decay mode. The interaction Lagrangian describing the decay of spin-2 tensor mesons to two pseudoscalar mesons follows from the chiral Lagrangian of Eq. (2.20) by applying the shift of Eq. (2.18):\n\n\n1 + ... . For the singlet state the Lagrangian reduces to L tpp = (g ten 2 + g ′ten 2 )T 0 µν Tr (∂ µ P) , (∂ ν P) + ... . This convention (which of course does not affect the results) is used in other terms as well.\n\n\n1.392 ± 0.024) · 10 4 (MeV) , g ′ ten 2 = (0.024 ± 0.041) · 10 4 (MeV) , β T = (3.16 ± 0.81) • . 1525) −→K K 23.72 ± 0.60 75 ± 4 ↔ (87.6 ± 2.\n\n\nTh : Γ K * 2 (1430) −→ ηK = (1.13 ± 0.03) · 10 −3 MeV, PDG : 0.15 +0.34 −0.10 MeV. (3.22)\n\n\n3.2.2.T −→ V + P decay mode. The next experimentally well-known decay channel is the one into a vector-pseudoscalar pair. Upon considering the shift of Eq. (2.17), the chiral Lagrangian of Eq.(2.22)   contains the term:\n\n\n(for a brief overview of this procedure including the determination of the error of the obtained parameter(s), see the Appendix of Ref.[12]):c ten = (4.8 ± 0.9) · 10 −7 (MeV) −3 .(3.26) In the very same table the theoretical results are also presented. The model results are in good agreement Decay process (in model) eLSM (MeV) PDG-2020 (MeV) κ tvp ,i a 2 (1320) −→ ρ(770) π 71.0 ± 2.6 73.61 ± 3.35 ↔ (70.1 ± 2.1525) −→K * (892) K + c.c. 19.89 ± 0.73 4 2φS cos βT +φN sin βT 8 ) 2\n\n\nthrough the VMD shift (3.27) for both vector fields, we get the Lagrangian L tγγ = a ten e 2 g 2 ρ Tr T µν {QF µ β , QF νβ } +\n\n\n(3.34)  for the predictions of numerous photonvector decay mode by shifting only one vector field of the Lagrangian of Equation(3.31)    \n\n\n19.5 MeV; PDG : Γ[a 2 (1320) −→ ω(782)ππ] ≈ 11.3 MeV; PDG : Γ[K ⋆ 2 (1430) −→ K ⋆ (892)ππ] = 13.5 ± 2.3 MeV.\n\n\n1430) −→K * ± (892) γ 0.23 ± 0.04 K * 0 2 (1430) −→K * 0 (892) γ 0.94 ± 0.18 f 2 (1270) −→ ρ(770) γ 0.70 ± 0.17 f 2 (1270) −→ ω(782) γ 0.068 ± 0.017\n\n3. 4 .\n4Decays of axial-tensor mesons. The ground-state mesons with J P C = 2 −− are elusive. In this section we use the eLSM to predict their decay rates and compare with the available lattice QCD (LQCD) and other theoretical results. 3.4.1. A 2 −→ V + P decay mode. The chiral Lagrangian (2.20) contains the decay of axial-vector states into a vector and pseudoscalar pair:\n\nTable 4 .\n4The matrix P contains the pseudoscalar fields, justas the matrix P of Eq. (2.1), but proper renormalization factors have been included. The shifts in Eqs. \n(2.17) and (2.18) shall also be applied to the novel Lagrangian terms introduced below. \n\nParameters \nExpressions \nNumerical values [18] \n\n\n\n\n(subdominant). This Lagrangian cannot be made dilatation invariant 5 because the coupling constants have dimension [Energy −1 ], thus it is expected to deliver suppressed decays into mesons (as it turns out to be the case). Yet, it is relevant because, after an appropriate−1/2 \nc \n\n(dominant) and a ′ten ∝ N \n\n−3/2 \nc \n\n\n\nTable 10 .\n10Decay rates and coefficients for the decay channel T −→ P + V . Radiative decays. Radiative decays can be obtained via vector meson dominance[60] by applying the additional shiftwith the experimental data. Moreover, a noteworthy prediction concerning f ′ \n2 (1525) →K  *  (892) K + c.c. \nis obtained. \n\n3.3. \nNote, formally one could multiply the Lagrangian of Eq. (2.21) by G 0 /G, but that implies a non-analytic point of the interaction potential for G → 0; this is why only terms with coupling constants with zero or positive dimension can be made dilatation invariant.\nAcknowledgementWe are thankful to Adrian Königstein for fruitful discussions on the tensor mesons. S. J. acknowledges financial support through the project \"Development Accelerator of the Jan Kochanowski University ofeLSM (MeV)κ a2vp ,i ρ 2 (?) −→ ρ(770) η ≈ 99 ± 50 − w ηN Z ηN cos β P 2 ρ 2 (?) −→K * (892) K + c.c. ≈ 85 ± 43 4 ZK wK 2 2 ρ 2 (?) −→ ω(782) π ≈ 419 ± 210 − w π Z π cos β V 2 ρ 2 (?) −→ φ(1020) π ≈ 0.8 w π Z π sin β V 2 K 2,A −→ ρ(770) K ≈ 195 ± 98 3 ZK wK 2 2 K 2,A −→K * (892) π ≈ 316 ± 158 3 ZπwπTable 15. Predictions and coefficients for the decay channel A 2 −→ V + P .Thus, in this case the decay of the tensor mesons does not fix the strength for the axial-tensor since two equivalent terms are present in the original Lagrangian of Eq. (2.22), and their sum/difference appears for tensors and axial-tensors, respectively. Nevertheless, it is reasonable to expect that c ′ ten is of the same order of c ten . In general, rather small decay widths are therefore expected. Within this context, it is worth to mention that our prediction for the ρ 2 → a 1 (1260)π is quite similar to the prediction in Ref.[50]for the case of c ′ ten c ten ≃ 1 .3.4.3.A 2 −→ T + P decay mode. The last term of the Lagrangian (2.19) enables us to make some predictions for the decay of the axial-tensor mesons into a tensor and pseudoscalar pair. Namely, that Lagrangian reduces to the following interactionTable 16. Predictions for the A 2 −→ V + P based on LQCD results.Decay process (in model) eLSM (MeV) κ a2ap ,i ρ 2 (?) −→ a 1 (1260) π ≃ 13 c ′ ten c ten 2 2 φNThe theoretical results are reported inTable 18. As it is visible, quite sizable decays are obtained in some channels, which are then promising for future investigations of the axial-tensor states. Note, in[50]the decay rate of ρ 2 (?) −→ a 2 (1320) π is calculated to be about 200 MeV.24Decay process (in model)\nReview of particle physics. P A Zyla, Particle Data Group Collaboration10.1093/ptep/ptaa104PTEP. 8Particle Data Group Collaboration, P. A. Zyla et al., \"Review of particle physics,\" PTEP 2020 no. 8, (8, 2020) 083C01.\n\nMesons in a relativized quark model with chromodynamics. S Godfrey, N Isgur, S. Godfrey and N. Isgur, \"Mesons in a relativized quark model with chromodynamics,\"\n\n. 10.1103/PhysRevD.32.189Phys. Rev. D. 32Phys. Rev. D 32 (Jul, 1985) 189-231.\n\nMass spectra and Regge trajectories of light mesons in the Bethe-Salpeter approach. C S Fischer, S Kubrak, R Williams, 10.1140/epja/i2014-14126-6arXiv:1406.4370Eur. Phys. J. A. 50126hep-phC. S. Fischer, S. Kubrak, and R. Williams, \"Mass spectra and Regge trajectories of light mesons in the Bethe-Salpeter approach,\" Eur. Phys. J. A 50 (2014) 126, arXiv:1406.4370 [hep-ph].\n\nFrom controversy to precision on the sigma meson: a review on the status of the non-ordinary f 0 (500) resonance. J R Pelaez, 10.1016/j.physrep.2016.09.001arXiv:1510.00653Phys. Rept. 6581hep-phJ. R. Pelaez, \"From controversy to precision on the sigma meson: a review on the status of the non-ordinary f 0 (500) resonance,\" Phys. Rept. 658 (2016) 1, arXiv:1510.00653 [hep-ph].\n\nScalar isoscalar mesons and the scalar glueball from radiative J/ψ decays. A V Sarantsev, I Denisenko, U Thoma, E Klempt, 10.1016/j.physletb.2021.136227arXiv:2103.09680Phys. Lett. B. 816136227hep-phA. V. Sarantsev, I. Denisenko, U. Thoma, and E. Klempt, \"Scalar isoscalar mesons and the scalar glueball from radiative J/ψ decays,\" Phys. Lett. B 816 (2021) 136227, arXiv:2103.09680 [hep-ph].\n\nScalar and tensor resonances in J/ψ radiative decays. A Rodas, Physics Analysis Center CollaborationA Pilloni, Physics Analysis Center CollaborationM Albaladejo, Physics Analysis Center CollaborationC Fernandez-Ramirez, Physics Analysis Center CollaborationV Mathieu, Physics Analysis Center CollaborationA P Szczepaniak, Physics Analysis Center Collaboration10.1140/epjc/s10052-022-10014-8arXiv:2110.00027Eur. Phys. J. C. 82180hep-phJoint Physics Analysis Center Collaboration, A. Rodas, A. Pilloni, M. Albaladejo, C. Fernandez- Ramirez, V. Mathieu, and A. P. Szczepaniak, \"Scalar and tensor resonances in J/ψ radiative decays,\" Eur. Phys. J. C 82 no. 1, (2022) 80, arXiv:2110.00027 [hep-ph].\n\nStudy for a model-independent pole determination of overlapping resonances. D Binosi, A Pilloni, R.-A Tripolt, arXiv:2205.02690hep-phD. Binosi, A. Pilloni, and R.-A. Tripolt, \"Study for a model-independent pole determination of overlapping resonances,\" arXiv:2205.02690 [hep-ph].\n\nSearch for the tensor glueball. E Klempt, A V Sarantsev, I Denisenko, K V Nikonov, 10.1016/j.physletb.2022.137171arXiv:2205.07239Phys. Lett. B. 830137171hep-phE. Klempt, A. V. Sarantsev, I. Denisenko, and K. V. Nikonov, \"Search for the tensor glueball,\" Phys. Lett. B 830 (2022) 137171, arXiv:2205.07239 [hep-ph].\n\nScalar mesons and the fragmented glueball. E Klempt, 10.1016/j.physletb.2021.136512arXiv:2104.09922Phys. Lett. B. 820136512hep-phE. Klempt, \"Scalar mesons and the fragmented glueball,\" Phys. Lett. B 820 (2021) 136512, arXiv:2104.09922 [hep-ph].\n\nSinglet-octet-glueball mixing of scalar mesons. E Klempt, A V Sarantsev, 10.1016/j.physletb.2022.136906arXiv:2112.04348Phys. Lett. B. 826136906hep-phE. Klempt and A. V. Sarantsev, \"Singlet-octet-glueball mixing of scalar mesons,\" Phys. Lett. B 826 (2022) 136906, arXiv:2112.04348 [hep-ph].\n\nNewly observed a0(1817) as the scaling point of constructing the scalar meson spectroscopy. D Guo, W Chen, H.-X Chen, X Liu, S.-L Zhu, 10.1103/PhysRevD.105.114014arXiv:2204.13092Phys. Rev. D. 10511114014hep-phD. Guo, W. Chen, H.-X. Chen, X. Liu, and S.-L. Zhu, \"Newly observed a0(1817) as the scaling point of constructing the scalar meson spectroscopy,\" Phys. Rev. D 105 no. 11, (2022) 114014, arXiv:2204.13092 [hep-ph].\n\nStrong and radiative decays of excited vector mesons and predictions for a new φ(1930) resonance. M Piotrowska, C Reisinger, F Giacosa, 10.1103/PhysRevD.96.054033arXiv:1708.02593Phys. Rev. D. 96554033hep-phM. Piotrowska, C. Reisinger, and F. Giacosa, \"Strong and radiative decays of excited vector mesons and predictions for a new φ(1930) resonance,\" Phys. Rev. D 96 no. 5, (9, 2017) 054033, arXiv:1708.02593 [hep-ph].\n\nRegarding the enigmas of P -wave meson spectroscopy. L Burakovsky, T J Goldman, L. Burakovsky and T. J. Goldman, \"Regarding the enigmas of P -wave meson spectroscopy,\"\n\n. 10.1103/PhysRevD.57.2879arXiv:hep-ph/9703271Phys. Rev. D. 573Phys. Rev. D 57 (3, 1998) 2879-2888, arXiv:hep-ph/9703271.\n\nDecays of tensor mesons and the tensor glueball in an effective field approach. F Giacosa, T Gutsche, V E Lyubovitskij, A Faessler, 10.1103/PhysRevD.72.114021arXiv:hep-ph/0511171Phys. Rev. D. 72114021F. Giacosa, T. Gutsche, V. E. Lyubovitskij, and A. Faessler, \"Decays of tensor mesons and the tensor glueball in an effective field approach,\" Phys. Rev. D 72 (2005) 114021, arXiv:hep-ph/0511171.\n\nPhenomenology of pseudotensor mesons and the pseudotensor glueball. A Koenigstein, F Giacosa, 10.1140/epja/i2016-16356-xarXiv:1608.08777Eur. Phys. J. A. 5212356hep-phA. Koenigstein and F. Giacosa, \"Phenomenology of pseudotensor mesons and the pseudotensor glueball,\" Eur. Phys. J. A 52 no. 12, (12, 2016) 356, arXiv:1608.08777 [hep-ph].\n\nConstraints imposed by the partial wave amplitudes on the decays of J = 1, 2 mesons. V Shastry, E Trotti, F Giacosa, arXiv:2107.13501hep-phV. Shastry, E. Trotti, and F. Giacosa, \"Constraints imposed by the partial wave amplitudes on the decays of J = 1, 2 mesons,\" arXiv:2107.13501 [hep-ph].\n\nPhenomenology of J P C = 3 −− tensor mesons. S Jafarzade, A Koenigstein, F Giacosa, 10.1103/PhysRevD.103.096027arXiv:2101.03195Phys. Rev. D. 103996027hep-phS. Jafarzade, A. Koenigstein, and F. Giacosa, \"Phenomenology of J P C = 3 −− tensor mesons,\" Phys. Rev. D 103 no. 9, (2021) 096027, arXiv:2101.03195 [hep-ph].\n\nMeson vacuum phenomenology in a three-flavor linear sigma model with (axial-)vector mesons. D Parganlija, P Kovacs, G Wolf, F Giacosa, D H Rischke, 10.1103/PhysRevD.87.014011arXiv:1208.0585Phys. Rev. D. 87114011hep-phD. Parganlija, P. Kovacs, G. Wolf, F. Giacosa, and D. H. Rischke, \"Meson vacuum phenomenology in a three-flavor linear sigma model with (axial-)vector mesons,\" Phys. Rev. D 87 no. 1, (2013) 014011, arXiv:1208.0585 [hep-ph].\n\nExcited Scalar and Pseudoscalar Mesons in the Extended Linear Sigma Model. D Parganlija, F Giacosa, 10.1140/epjc/s10052-017-4962-yarXiv:1612.09218Eur. Phys. J. C. 777450hep-phD. Parganlija and F. Giacosa, \"Excited Scalar and Pseudoscalar Mesons in the Extended Linear Sigma Model,\" Eur. Phys. J. C 77 no. 7, (2017) 450, arXiv:1612.09218 [hep-ph].\n\nIs f0(1710) a glueball?. S Janowski, F Giacosa, D H Rischke, 10.1103/PhysRevD.90.114005arXiv:1408.4921Phys. Rev. D. 9011114005hep-phS. Janowski, F. Giacosa, and D. H. Rischke, \"Is f0(1710) a glueball?,\" Phys. Rev. D 90 no. 11, (2014) 114005, arXiv:1408.4921 [hep-ph].\n\nDecays of the vector glueball. F Giacosa, J Sammet, S Janowski, 10.1103/PhysRevD.95.114004arXiv:1607.03640Phys. Rev. D. 9511114004hep-phF. Giacosa, J. Sammet, and S. Janowski, \"Decays of the vector glueball,\" Phys. Rev. D 95 no. 11, (2017) 114004, arXiv:1607.03640 [hep-ph].\n\nHybrid phenomenology in a chiral approach. W I Eshraim, C S Fischer, F Giacosa, D Parganlija, 10.1140/epjp/s13360-020-00900-zarXiv:2001.06106Eur. Phys. J. Plus. 13512945hep-phW. I. Eshraim, C. S. Fischer, F. Giacosa, and D. Parganlija, \"Hybrid phenomenology in a chiral approach,\" Eur. Phys. J. Plus 135 no. 12, (2020) 945, arXiv:2001.06106 [hep-ph].\n\nThe rho rho interaction in the hidden gauge formalism and the f(0)(1370) and f(2)(1270) resonances. R Molina, D Nicmorus, E Oset, 10.1103/PhysRevD.78.114018arXiv:0809.2233Phys. Rev. D. 78114018hep-phR. Molina, D. Nicmorus, and E. Oset, \"The rho rho interaction in the hidden gauge formalism and the f(0)(1370) and f(2)(1270) resonances,\" Phys. Rev. D 78 (2008) 114018, arXiv:0809.2233 [hep-ph].\n\nStudy of the f(2)(1270), f(2)-prime(1525), f(0)(1370) and f(0)(1710) in the J/psi radiative decays. L S Geng, F K Guo, C Hanhart, R Molina, E Oset, B S Zou, 10.1140/epja/i2010-10971-5arXiv:0910.5192Eur. Phys. J. A. 44hep-phL. S. Geng, F. K. Guo, C. Hanhart, R. Molina, E. Oset, and B. S. Zou, \"Study of the f(2)(1270), f(2)-prime(1525), f(0)(1370) and f(0)(1710) in the J/psi radiative decays,\" Eur. Phys. J. A 44 (2010) 305-311, arXiv:0910.5192 [hep-ph].\n\nScattering of unstable particles in a finite volume: the case of πρ scattering and the a 1 (1260) resonance. L Roca, E Oset, 10.1103/PhysRevD.85.054507arXiv:1201.0438Phys. Rev. D. 8554507hep-latL. Roca and E. Oset, \"Scattering of unstable particles in a finite volume: the case of πρ scattering and the a 1 (1260) resonance,\" Phys. Rev. D 85 (2012) 054507, arXiv:1201.0438 [hep-lat].\n\nLight hadron spectroscopy at BESIII. G Mezzadri, 10.22323/1.234.0423The European Physical Society Conference on High Energy Physics (EPS-HEP2015). 234423G. Mezzadri, \"Light hadron spectroscopy at BESIII,\" PoS 234 (3, 2015) 423. The European Physical Society Confer- ence on High Energy Physics (EPS-HEP2015).\n\nHadron Physics from BESIII. S Marcello, BESIII Collaboration10.7566/JPSCP.10.010009Proceedings of the 10th International Workshop on the Physics of Excited Nucleons (NSTAR2015). the 10th International Workshop on the Physics of Excited Nucleons (NSTAR2015)1010009BESIII Collaboration, S. Marcello, \"Hadron Physics from BESIII,\" JPS Conf. Proc. 10 (2016) 010009. Proceedings of the 10th International Workshop on the Physics of Excited Nucleons (NSTAR2015).\n\nThe meson spectroscopy program with CLAS12 at Jefferson Laboratory. A Rizzo, CLAS Collaboration10.22323/1.253.0060The 8th International Workshop on Chiral Dynamics. 253CLAS Collaboration, A. Rizzo, \"The meson spectroscopy program with CLAS12 at Jefferson Laboratory,\" PoS 253 (2, 2016) 8. The 8th International Workshop on Chiral Dynamics.\n\nMeson spectroscopy at VES and COMPASS. D Ryabchikov, COMPASS CollaborationVES groupVES group, COMPASS Collaboration, D. Ryabchikov, \"Meson spectroscopy at VES and COMPASS,\"\n\n10.1051/epjconf/201921203010EPJ Web Conf. 212 (6, 2019) 03010. The 12th International Workshop on e + e − Collisions from Phi to Psi. EPJ Web Conf. 212 (6, 2019) 03010. The 12th International Workshop on e + e − Collisions from Phi to Psi (PhiPsi 2019).\n\nFirst results from the GlueX experiment. H , GlueX CollaborationAl Ghoul, GlueX CollaborationGlueX Collaboration, H. Al Ghoul et al., \"First results from the GlueX experiment,\"\n\n10.1063/1.4949369arXiv:1512.03699AIP Conf. Proc. 1735. 20001nucl-exAIP Conf. Proc. 1735 no. 1, (5, 2016) 020001, arXiv:1512.03699 [nucl-ex].\n\nGlueX a new facility to search for gluonic degrees of freedom in mesons. B Zihlmann, GlueX Collaboration10.1063/1.3483306AIP Conf. Proc. 12571GlueX Collaboration, B. Zihlmann, \"GlueX a new facility to search for gluonic degrees of freedom in mesons,\" AIP Conf. Proc. 1257 no. 1, (8, 2010) 116-120.\n\nGlueX at Jefferson Lab: a search for exotic states ofmatter in photon-proton collisions. M Shepherd, GlueX Collaboration10.22323/1.212.000452nd International Winter Meeting on Nuclear Physics. 212GlueX Collaboration, M. Shepherd, \"GlueX at Jefferson Lab: a search for exotic states ofmatter in photon-proton collisions,\" PoS 212 (10, 2014) 12. 52nd International Winter Meeting on Nuclear Physics.\n\nPhysics Performance Report for PANDA: Strong Interaction Studies with Antiprotons. M F M Lutz, PANDA CollaborationPANDA Collaboration, M. F. M. Lutz et al., \"Physics Performance Report for PANDA: Strong Interaction Studies with Antiprotons,\" 3, 2009.\n\nPhotoproduction of the f 2 (1270) meson using the CLAS detector. M Carver, CLAS Collaboration10.1103/PhysRevLett.126.082002arXiv:2010.16006Phys. Rev. Lett. 126882002nucl-exCLAS Collaboration, M. Carver et al., \"Photoproduction of the f 2 (1270) meson using the CLAS detector,\" Phys. Rev. Lett. 126 no. 8, (2021) 082002, arXiv:2010.16006 [nucl-ex].\n\nExclusive tensor meson photoproduction. V Mathieu, JPAC CollaborationA Pilloni, JPAC CollaborationM Albaladejo, JPAC CollaborationL Bibrzycki, JPAC CollaborationA Celentano, JPAC CollaborationC Fernández-Ramírez, JPAC CollaborationA P Szczepaniak, JPAC Collaboration10.1103/PhysRevD.102.014003arXiv:2005.01617Phys. Rev. D. 102114003hep-phJPAC Collaboration, V. Mathieu, A. Pilloni, M. Albaladejo, L. Bibrzycki, A. Celentano, C. Fernández- Ramírez, and A. P. Szczepaniak, \"Exclusive tensor meson photoproduction,\" Phys. Rev. D 102 no. 1, (2020) 014003, arXiv:2005.01617 [hep-ph].\n\nGlobal analysis of charge exchange meson production at high energies. J Nys, JPAC CollaborationA N Hiller Blin, JPAC CollaborationV Mathieu, JPAC CollaborationC Fernández-Ramírez, JPAC CollaborationA Jackura, JPAC CollaborationA Pilloni, JPAC CollaborationJ Ryckebusch, JPAC CollaborationA P Szczepaniak, JPAC CollaborationG Fox, JPAC Collaboration10.1103/PhysRevD.98.034020arXiv:1806.01891Phys. Rev. D. 98334020hep-phJPAC Collaboration, J. Nys, A. N. Hiller Blin, V. Mathieu, C. Fernández-Ramírez, A. Jackura, A. Pilloni, J. Rycke- busch, A. P. Szczepaniak, and G. Fox, \"Global analysis of charge exchange meson production at high energies,\" Phys. Rev. D 98 no. 3, (2018) 034020, arXiv:1806.01891 [hep-ph].\n\nTensor meson photoproduction as a final state interaction effect. L Bibrzycki, R Kaminski, 10.1103/PhysRevD.87.114010arXiv:1306.4882Phys. Rev. D. 8711114010hep-phL. Bibrzycki and R. Kaminski, \"Tensor meson photoproduction as a final state interaction effect,\" Phys. Rev. D 87 no. 11, (2013) 114010, arXiv:1306.4882 [hep-ph].\n\nPhysics with the KLOE-2 experiment at the upgraded DAφNE. G Amelino-Camelia, 10.1140/epjc/s10052-010-1351-1arXiv:1003.3868Eur. Phys. J. C. 68hep-exG. Amelino-Camelia et al., \"Physics with the KLOE-2 experiment at the upgraded DAφNE,\" Eur. Phys. J. C 68 (2010) 619-681, arXiv:1003.3868 [hep-ex].\n\nMixing and decay constants of pseudoscalar mesons. T Feldmann, P Kroll, B Stech, 10.1103/PhysRevD.58.114006arXiv:hep-ph/9802409Phys. Rev. D. 5810114006T. Feldmann, P. Kroll, and B. Stech, \"Mixing and decay constants of pseudoscalar mesons,\" Phys. Rev. D 58 (10, 1998) 114006, arXiv:hep-ph/9802409.\n\nHow instantons solve the U (1) problem. G Hooft, 10.1016/0370-1573(86)90117-1Phys. Rept. 1426G. 't Hooft, \"How instantons solve the U (1) problem,\" Phys. Rept. 142 no. 6, (9, 1986) 357-387.\n\nHow the axial anomaly controls flavor mixing among mesons. F Giacosa, A Koenigstein, R D Pisarski, 10.1103/PhysRevD.97.091901arXiv:1709.07454Phys. Rev. D. 97991901hep-phF. Giacosa, A. Koenigstein, and R. D. Pisarski, \"How the axial anomaly controls flavor mixing among mesons,\" Phys. Rev. D 97 no. 9, (2018) 091901, arXiv:1709.07454 [hep-ph].\n\nGlueballs as the Ithaca of meson spectroscopy: From simple theory to challenging detection. F J Llanes-Estrada, 10.1140/epjs/s11734-021-00143-8arXiv:2101.05366Eur. Phys. J. ST. 2306hep-phF. J. Llanes-Estrada, \"Glueballs as the Ithaca of meson spectroscopy: From simple theory to challenging detection,\" Eur. Phys. J. ST 230 no. 6, (2021) 1575-1592, arXiv:2101.05366 [hep-ph].\n\nScalar glueball, scalar quarkonia, and their mixing. H.-Y Cheng, C.-K Chua, K.-F Liu, 10.1103/PhysRevD.74.094005arXiv:hep-ph/0607206Phys. Rev. D. 741194005H.-Y. Cheng, C.-K. Chua, and K.-F. Liu, \"Scalar glueball, scalar quarkonia, and their mixing,\" Phys. Rev. D 74 (11, 2006) 094005, arXiv:hep-ph/0607206.\n\nScalar nonet quarkonia and the scalar glueball: Mixing and decays in an effective chiral approach. F Giacosa, T Gutsche, V E Lyubovitskij, A Faessler, 10.1103/PhysRevD.72.094006arXiv:hep-ph/0509247Phys. Rev. D. 721194006F. Giacosa, T. Gutsche, V. E. Lyubovitskij, and A. Faessler, \"Scalar nonet quarkonia and the scalar glueball: Mixing and decays in an effective chiral approach,\" Phys. Rev. D 72 (11, 2005) 094006, arXiv:hep-ph/0509247.\n\nIs f 0 (1500) a scalar glueball?. C Amsler, F E Close, 10.1103/PhysRevD.53.295arXiv:hep-ph/9507326Phys. Rev. D. 531C. Amsler and F. E. Close, \"Is f 0 (1500) a scalar glueball?,\" Phys. Rev. D 53 (1, 1996) 295-311, arXiv:hep-ph/9507326.\n\nEvidence for a scalar glueball. C Amsler, F E Close, 10.1016/0370-2693(95)00579-AarXiv:hep-ph/9505219Phys. Lett. B. 3532-3C. Amsler and F. E. Close, \"Evidence for a scalar glueball,\" Phys. Lett. B 353 no. 2-3, (6, 1995) 385-390, arXiv:hep-ph/9505219.\n\nK 1 (1270) -K 1 (1400) mixing angle and new-physics effects in B → K 1 l + l − decays. H Hatanaka, K.-C Yang, 10.1103/PhysRevD.78.074007arXiv:0808.3731Phys. Rev. D. 781074007hep-phH. Hatanaka and K.-C. Yang, \"K 1 (1270) -K 1 (1400) mixing angle and new-physics effects in B → K 1 l + l − decays,\" Phys. Rev. D 78 (10, 2008) 074007, arXiv:0808.3731 [hep-ph].\n\nPhenomenology of axial-vector and pseudovector mesons: decays and mixing in the kaonic sector. F Divotgey, L Olbrich, F Giacosa, 10.1140/epja/i2013-13135-3arXiv:1306.1193Eur. Phys. J. A. 4910135hep-phF. Divotgey, L. Olbrich, and F. Giacosa, \"Phenomenology of axial-vector and pseudovector mesons: decays and mixing in the kaonic sector,\" Eur. Phys. J. A 49 (10, 2013) 135, arXiv:1306.1193 [hep-ph].\n\nBranching fractions of semileptonic D and Ds decays from the covariant light-front quark model. H.-Y Cheng, X.-W Kang, 10.1140/epjc/s10052-017-5170-5arXiv:1707.02851Eur. Phys. J. C. 779863Eur.Phys.J.CH.-Y. Cheng and X.-W. Kang, \"Branching fractions of semileptonic D and Ds decays from the covariant light-front quark model,\" Eur. Phys. J. C 77 no. 9, (2017) 587, arXiv:1707.02851 [hep-ph]. [Erratum: Eur.Phys.J.C 77, 863 (2017)].\n\nStudy of unflavored light mesons with J P C = 2 −−. D Guo, C.-Q Pang, Z.-W Liu, X Liu, 10.1103/PhysRevD.99.056001arXiv:1901.03518Phys. Rev. D. 99556001hep-phD. Guo, C.-Q. Pang, Z.-W. Liu, and X. Liu, \"Study of unflavored light mesons with J P C = 2 −− ,\" Phys. Rev. D 99 no. 5, (2019) 056001, arXiv:1901.03518 [hep-ph].\n\nRevisiting the tensor J P C = 2 −− meson spectrum. L M Abreu, F M Da Costa Júnior, A G Favero, 10.1103/PhysRevD.101.116016arXiv:2004.10736Phys. Rev. D. 10111116016hep-phL. M. Abreu, F. M. da Costa Júnior, and A. G. Favero, \"Revisiting the tensor J P C = 2 −− meson spectrum,\" Phys. Rev. D 101 no. 11, (2020) 116016, arXiv:2004.10736 [hep-ph].\n\nHot medium effects on pseudotensor K 2 (1820) meson. A Türkan, H Dag, J Y Süngü, E V Veliev, 10.1051/epjconf/201919903007EPJ Web Conf. 1993007A. Türkan, H. Dag, J. Y. Süngü, and E. V. Veliev, \"Hot medium effects on pseudotensor K 2 (1820) meson,\" EPJ Web Conf. 199 (2019) 03007.\n\nAxial-tensor Meson family at T = 0. J Y Süngü, A Türkan, E Sertbakan, E V Veliev, 10.1140/epjc/s10052-020-08439-0arXiv:2005.11526Eur. Phys. J. C. 8010943hep-phJ. Y. Süngü, A. Türkan, E. Sertbakan, and E. V. Veliev, \"Axial-tensor Meson family at T = 0,\" Eur. Phys. J. C 80 no. 10, (2020) 943, arXiv:2005.11526 [hep-ph].\n\nDilaton Effective Lagrangian in Gluodynamics. A A Migdal, M A Shifman, 10.1016/0370-2693(82)90089-2Phys. Lett. B. 114A. A. Migdal and M. A. Shifman, \"Dilaton Effective Lagrangian in Gluodynamics,\" Phys. Lett. B 114 (1982) 445-449.\n\nProperties of Scalar Gluonium. A Salomone, J Schechter, T Tudron, 10.1103/PhysRevD.23.1143Phys. Rev. D. 231143A. Salomone, J. Schechter, and T. Tudron, \"Properties of Scalar Gluonium,\" Phys. Rev. D 23 (1981) 1143.\n\nPhenomenology of scalar and vector mesons in the linear sigma model. P Ko, S Rudaz, 10.1103/PhysRevD.50.6877Phys. Rev. D. 50P. Ko and S. Rudaz, \"Phenomenology of scalar and vector mesons in the linear sigma model,\" Phys. Rev. D 50 (1994) 6877-6894.\n\nAn Effective Lagrangian with broken scale and chiral symmetry: 2. Pion phenomenology. G W Carter, P J Ellis, S Rudaz, 10.1016/0375-9474(96)80007-EarXiv:nucl-th/9512033Nucl. Phys. A. 603Nucl.Phys.AG. W. Carter, P. J. Ellis, and S. Rudaz, \"An Effective Lagrangian with broken scale and chiral symmetry: 2. Pion phenomenology,\" Nucl. Phys. A 603 (1996) 367-386, arXiv:nucl-th/9512033. [Erratum: Nucl.Phys.A 608, 514-514 (1996)].\n\nClassical and quantum theory of the massive spin-two field. A Koenigstein, F Giacosa, D H Rischke, 10.1016/j.aop.2016.01.024arXiv:1508.00110Annals Phys. 3685hep-thA. Koenigstein, F. Giacosa, and D. H. Rischke, \"Classical and quantum theory of the massive spin-two field,\" Annals Phys. 368 (5, 2016) 16-55, arXiv:1508.00110 [hep-th].\n\nJ/psi Decays. L Kopke, N Wermes, 10.1016/0370-1573(89)90074-4Phys. Rept. 17467L. Kopke and N. Wermes, \"J/psi Decays,\" Phys. Rept. 174 (1989) 67.\n\nρ − ω mixing, vector meson dominance and the pion form-factor. H B O&apos;connell, B C Pearce, A W Thomas, A G Williams, 10.1016/S0146-6410(97)00044-6arXiv:hep-ph/9501251Prog. Part. Nucl. Phys. 39H. B. O'Connell, B. C. Pearce, A. W. Thomas, and A. G. Williams, \"ρ − ω mixing, vector meson dominance and the pion form-factor,\" Prog. Part. Nucl. Phys. 39 (1997) 201-252, arXiv:hep-ph/9501251.\n\nA simple alternative to the relativistic Breit-Wigner distribution. F Giacosa, A Okopińska, V Shastry, 10.1140/epja/s10050-021-00641-2arXiv:2106.03749Eur. Phys. J. A. 5712336hep-phF. Giacosa, A. Okopińska, and V. Shastry, \"A simple alternative to the relativistic Breit-Wigner distribution,\" Eur. Phys. J. A 57 no. 12, (2021) 336, arXiv:2106.03749 [hep-ph].\n\nExcited J −− meson resonances at the SU(3) flavor point from lattice QCD. C T Johnson, Hadron Spectrum CollaborationJ J Dudek, Hadron Spectrum Collaboration10.1103/PhysRevD.103.074502arXiv:2012.00518Phys. Rev. D. 103774502hep-latHadron Spectrum Collaboration, C. T. Johnson and J. J. Dudek, \"Excited J −− meson resonances at the SU(3) flavor point from lattice QCD,\" Phys. Rev. D 103 no. 7, (2021) 074502, arXiv:2012.00518 [hep-lat].\n\nRatios of Partial Wave Amplitudes in the Decays of J = 1 and J = 2 Mesons. V Shastry, arXiv:2112.1322119th International Conference on Hadron Spectroscopy and Structure. 122021hep-phV. Shastry, \"Ratios of Partial Wave Amplitudes in the Decays of J = 1 and J = 2 Mesons,\" in 19th International Conference on Hadron Spectroscopy and Structure. 12, 2021. arXiv:2112.13221 [hep-ph].\n\nGlueball spectrum and matrix elements on anisotropic lattices. Y Chen, 10.1103/PhysRevD.73.014516arXiv:hep-lat/0510074Phys. Rev. D. 73114516Y. Chen et al., \"Glueball spectrum and matrix elements on anisotropic lattices,\" Phys. Rev. D 73 (1, 2006) 014516, arXiv:hep-lat/0510074.\n", "annotations": {"author": "[{\"end\":290,\"start\":79},{\"end\":397,\"start\":291},{\"end\":505,\"start\":398},{\"end\":721,\"start\":506}]", "publisher": null, "author_last_name": "[{\"end\":98,\"start\":89},{\"end\":307,\"start\":298},{\"end\":415,\"start\":405},{\"end\":523,\"start\":516}]", "author_first_name": "[{\"end\":88,\"start\":79},{\"end\":297,\"start\":291},{\"end\":404,\"start\":398},{\"end\":515,\"start\":506}]", "author_affiliation": "[{\"end\":289,\"start\":202},{\"end\":396,\"start\":309},{\"end\":504,\"start\":417},{\"end\":612,\"start\":525},{\"end\":720,\"start\":614}]", "title": "[{\"end\":65,\"start\":1},{\"end\":786,\"start\":722}]", "venue": null, "abstract": "[{\"end\":6699,\"start\":800}]", "bib_ref": "[{\"attributes\":{\"ref_id\":\"b0\"},\"end\":7006,\"start\":7005},{\"attributes\":{\"ref_id\":\"b0\"},\"end\":7150,\"start\":7147},{\"attributes\":{\"ref_id\":\"b12\"},\"end\":7499,\"start\":7495},{\"end\":9146,\"start\":9141},{\"attributes\":{\"ref_id\":\"b41\"},\"end\":9327,\"start\":9323},{\"attributes\":{\"ref_id\":\"b0\"},\"end\":9588,\"start\":9585},{\"attributes\":{\"ref_id\":\"b42\"},\"end\":9607,\"start\":9603},{\"attributes\":{\"ref_id\":\"b43\"},\"end\":9610,\"start\":9607},{\"attributes\":{\"ref_id\":\"b44\"},\"end\":9691,\"start\":9687},{\"attributes\":{\"ref_id\":\"b21\"},\"end\":10724,\"start\":10720},{\"end\":10728,\"start\":10724},{\"attributes\":{\"ref_id\":\"b46\"},\"end\":10732,\"start\":10728},{\"attributes\":{\"ref_id\":\"b47\"},\"end\":10736,\"start\":10732},{\"attributes\":{\"ref_id\":\"b48\"},\"end\":10740,\"start\":10736},{\"attributes\":{\"ref_id\":\"b49\"},\"end\":10744,\"start\":10740},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":11130,\"start\":11128},{\"attributes\":{\"ref_id\":\"b0\"},\"end\":11568,\"start\":11565},{\"attributes\":{\"ref_id\":\"b44\"},\"end\":11751,\"start\":11747},{\"attributes\":{\"ref_id\":\"b50\"},\"end\":11815,\"start\":11811},{\"attributes\":{\"ref_id\":\"b44\"},\"end\":12431,\"start\":12427},{\"attributes\":{\"ref_id\":\"b51\"},\"end\":12451,\"start\":12447},{\"attributes\":{\"ref_id\":\"b51\"},\"end\":12984,\"start\":12980},{\"attributes\":{\"ref_id\":\"b50\"},\"end\":13032,\"start\":13028},{\"attributes\":{\"ref_id\":\"b51\"},\"end\":13035,\"start\":13032},{\"attributes\":{\"ref_id\":\"b52\"},\"end\":13233,\"start\":13229},{\"attributes\":{\"ref_id\":\"b22\"},\"end\":13448,\"start\":13444},{\"attributes\":{\"ref_id\":\"b23\"},\"end\":13451,\"start\":13448},{\"attributes\":{\"ref_id\":\"b44\"},\"end\":14076,\"start\":14072},{\"attributes\":{\"ref_id\":\"b16\"},\"end\":14642,\"start\":14638},{\"attributes\":{\"ref_id\":\"b44\"},\"end\":14645,\"start\":14642},{\"attributes\":{\"ref_id\":\"b44\"},\"end\":15276,\"start\":15272},{\"attributes\":{\"ref_id\":\"b19\"},\"end\":16014,\"start\":16010},{\"attributes\":{\"ref_id\":\"b21\"},\"end\":16017,\"start\":16014},{\"attributes\":{\"ref_id\":\"b23\"},\"end\":16020,\"start\":16017},{\"attributes\":{\"ref_id\":\"b57\"},\"end\":16222,\"start\":16218},{\"attributes\":{\"ref_id\":\"b58\"},\"end\":16225,\"start\":16222},{\"attributes\":{\"ref_id\":\"b59\"},\"end\":16939,\"start\":16935},{\"attributes\":{\"ref_id\":\"b60\"},\"end\":16942,\"start\":16939},{\"attributes\":{\"ref_id\":\"b19\"},\"end\":17087,\"start\":17083},{\"attributes\":{\"ref_id\":\"b21\"},\"end\":17090,\"start\":17087},{\"attributes\":{\"ref_id\":\"b19\"},\"end\":17943,\"start\":17939},{\"end\":17946,\"start\":17943},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":18332,\"start\":18331},{\"end\":20770,\"start\":20764},{\"attributes\":{\"ref_id\":\"b61\"},\"end\":23471,\"start\":23467},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":28624,\"start\":28623},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":30169,\"start\":30166},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":30542,\"start\":30539},{\"attributes\":{\"ref_id\":\"b62\"},\"end\":30822,\"start\":30818},{\"attributes\":{\"ref_id\":\"b29\"},\"end\":32682,\"start\":32679},{\"end\":35798,\"start\":35792},{\"attributes\":{\"ref_id\":\"b64\"},\"end\":36611,\"start\":36607},{\"end\":36637,\"start\":36631},{\"attributes\":{\"ref_id\":\"b64\"},\"end\":38522,\"start\":38518},{\"end\":38594,\"start\":38588},{\"attributes\":{\"ref_id\":\"b65\"},\"end\":42474,\"start\":42470},{\"attributes\":{\"ref_id\":\"b6\"},\"end\":42477,\"start\":42476},{\"end\":42554,\"start\":42548},{\"end\":43536,\"start\":43530},{\"attributes\":{\"ref_id\":\"b6\"},\"end\":43742,\"start\":43741},{\"attributes\":{\"ref_id\":\"b27\"},\"end\":45803,\"start\":45799},{\"attributes\":{\"ref_id\":\"b28\"},\"end\":45807,\"start\":45803},{\"attributes\":{\"ref_id\":\"b29\"},\"end\":45811,\"start\":45807},{\"attributes\":{\"ref_id\":\"b30\"},\"end\":45815,\"start\":45811},{\"attributes\":{\"ref_id\":\"b32\"},\"end\":45819,\"start\":45815},{\"attributes\":{\"ref_id\":\"b34\"},\"end\":45823,\"start\":45819},{\"attributes\":{\"ref_id\":\"b35\"},\"end\":45827,\"start\":45823},{\"attributes\":{\"ref_id\":\"b36\"},\"end\":45831,\"start\":45827},{\"attributes\":{\"ref_id\":\"b37\"},\"end\":45835,\"start\":45831},{\"attributes\":{\"ref_id\":\"b38\"},\"end\":45839,\"start\":45835},{\"attributes\":{\"ref_id\":\"b39\"},\"end\":45843,\"start\":45839},{\"attributes\":{\"ref_id\":\"b40\"},\"end\":45847,\"start\":45843},{\"attributes\":{\"ref_id\":\"b17\"},\"end\":45988,\"start\":45984},{\"attributes\":{\"ref_id\":\"b66\"},\"end\":45991,\"start\":45988},{\"attributes\":{\"ref_id\":\"b67\"},\"end\":46216,\"start\":46212},{\"attributes\":{\"ref_id\":\"b26\"},\"end\":46400,\"start\":46398},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":47316,\"start\":47313},{\"attributes\":{\"ref_id\":\"b12\"},\"end\":48332,\"start\":48328},{\"attributes\":{\"ref_id\":\"b63\"},\"end\":50374,\"start\":50370}]", "figure": "[{\"attributes\":{\"id\":\"fig_1\"},\"end\":46603,\"start\":46402},{\"attributes\":{\"id\":\"fig_2\"},\"end\":46753,\"start\":46604},{\"attributes\":{\"id\":\"fig_3\"},\"end\":46939,\"start\":46754},{\"attributes\":{\"id\":\"fig_4\"},\"end\":47294,\"start\":46940},{\"attributes\":{\"id\":\"fig_5\"},\"end\":47513,\"start\":47295},{\"attributes\":{\"id\":\"fig_6\"},\"end\":47732,\"start\":47514},{\"attributes\":{\"id\":\"fig_7\"},\"end\":47876,\"start\":47733},{\"attributes\":{\"id\":\"fig_8\"},\"end\":47968,\"start\":47877},{\"attributes\":{\"id\":\"fig_9\"},\"end\":48190,\"start\":47969},{\"attributes\":{\"id\":\"fig_10\"},\"end\":48674,\"start\":48191},{\"attributes\":{\"id\":\"fig_12\"},\"end\":48803,\"start\":48675},{\"attributes\":{\"id\":\"fig_13\"},\"end\":48943,\"start\":48804},{\"attributes\":{\"id\":\"fig_14\"},\"end\":49054,\"start\":48944},{\"attributes\":{\"id\":\"fig_15\"},\"end\":49205,\"start\":49055},{\"attributes\":{\"id\":\"fig_16\"},\"end\":49582,\"start\":49206},{\"attributes\":{\"id\":\"tab_0\",\"type\":\"table\"},\"end\":49890,\"start\":49583},{\"attributes\":{\"id\":\"tab_1\",\"type\":\"table\"},\"end\":50214,\"start\":49891},{\"attributes\":{\"id\":\"tab_4\",\"type\":\"table\"},\"end\":50537,\"start\":50215}]", "paragraph": "[{\"end\":6757,\"start\":6744},{\"end\":7646,\"start\":6778},{\"end\":7932,\"start\":7768},{\"end\":8250,\"start\":7934},{\"end\":8648,\"start\":8252},{\"end\":8890,\"start\":8650},{\"end\":9331,\"start\":8892},{\"end\":9703,\"start\":9482},{\"end\":10349,\"start\":9705},{\"end\":10923,\"start\":10455},{\"end\":11270,\"start\":10925},{\"end\":11768,\"start\":11484},{\"end\":12079,\"start\":11770},{\"end\":12210,\"start\":12205},{\"end\":12238,\"start\":12212},{\"end\":12506,\"start\":12325},{\"end\":12771,\"start\":12508},{\"end\":13024,\"start\":12858},{\"end\":13234,\"start\":13026},{\"end\":13590,\"start\":13236},{\"end\":13733,\"start\":13592},{\"end\":13897,\"start\":13735},{\"end\":14137,\"start\":13924},{\"end\":14646,\"start\":14147},{\"end\":15042,\"start\":14910},{\"end\":15146,\"start\":15140},{\"end\":15277,\"start\":15148},{\"end\":15414,\"start\":15279},{\"end\":15506,\"start\":15416},{\"end\":16021,\"start\":15862},{\"end\":16481,\"start\":16164},{\"end\":16639,\"start\":16534},{\"end\":16927,\"start\":16721},{\"end\":17159,\"start\":16929},{\"end\":17632,\"start\":17161},{\"end\":17783,\"start\":17732},{\"end\":17974,\"start\":17785},{\"end\":18487,\"start\":18186},{\"end\":18941,\"start\":18823},{\"end\":19614,\"start\":19127},{\"end\":19990,\"start\":19616},{\"end\":20357,\"start\":19992},{\"end\":20876,\"start\":20540},{\"end\":20968,\"start\":20878},{\"end\":21463,\"start\":21106},{\"end\":21503,\"start\":21465},{\"end\":22114,\"start\":21783},{\"end\":22358,\"start\":22167},{\"end\":22409,\"start\":22360},{\"end\":22734,\"start\":22490},{\"end\":23473,\"start\":22807},{\"end\":24692,\"start\":24055},{\"end\":24827,\"start\":24793},{\"end\":25087,\"start\":24918},{\"end\":25646,\"start\":25160},{\"end\":25777,\"start\":25718},{\"end\":25916,\"start\":25881},{\"end\":26181,\"start\":26112},{\"end\":26320,\"start\":26211},{\"end\":26433,\"start\":26369},{\"end\":26502,\"start\":26435},{\"end\":26738,\"start\":26634},{\"end\":26904,\"start\":26791},{\"end\":26951,\"start\":26945},{\"end\":26995,\"start\":26953},{\"end\":27073,\"start\":26997},{\"end\":27215,\"start\":27140},{\"end\":27412,\"start\":27241},{\"end\":27521,\"start\":27447},{\"end\":28239,\"start\":27547},{\"end\":28626,\"start\":28422},{\"end\":28658,\"start\":28628},{\"end\":28661,\"start\":28660},{\"end\":28912,\"start\":28671},{\"end\":29125,\"start\":29041},{\"end\":29540,\"start\":29127},{\"end\":29919,\"start\":29579},{\"end\":30171,\"start\":30065},{\"end\":30544,\"start\":30173},{\"end\":30997,\"start\":30546},{\"end\":31139,\"start\":30999},{\"end\":31807,\"start\":31229},{\"end\":31985,\"start\":31908},{\"end\":32156,\"start\":32084},{\"end\":32250,\"start\":32158},{\"end\":32871,\"start\":32399},{\"end\":33093,\"start\":32947},{\"end\":33200,\"start\":33194},{\"end\":33383,\"start\":33202},{\"end\":33547,\"start\":33385},{\"end\":33833,\"start\":33627},{\"end\":34592,\"start\":33922},{\"end\":34799,\"start\":34594},{\"end\":35196,\"start\":34801},{\"end\":35256,\"start\":35198},{\"end\":35402,\"start\":35359},{\"end\":36733,\"start\":35599},{\"end\":37518,\"start\":36945},{\"end\":37976,\"start\":37622},{\"end\":38523,\"start\":38129},{\"end\":38844,\"start\":38525},{\"end\":39435,\"start\":39114},{\"end\":39527,\"start\":39486},{\"end\":39862,\"start\":39662},{\"end\":40130,\"start\":39864},{\"end\":40373,\"start\":40132},{\"end\":40891,\"start\":40375},{\"end\":41175,\"start\":40893},{\"end\":41506,\"start\":41177},{\"end\":41836,\"start\":41508},{\"end\":42290,\"start\":41838},{\"end\":42606,\"start\":42292},{\"end\":42800,\"start\":42608},{\"end\":43132,\"start\":42802},{\"end\":43266,\"start\":43134},{\"end\":43429,\"start\":43365},{\"end\":43945,\"start\":43431},{\"end\":44153,\"start\":43947},{\"end\":44309,\"start\":44155},{\"end\":44529,\"start\":44325},{\"end\":44946,\"start\":44531},{\"end\":45677,\"start\":44948},{\"end\":45947,\"start\":45679},{\"end\":46401,\"start\":45949}]", "formula": "[{\"attributes\":{\"id\":\"formula_0\"},\"end\":6743,\"start\":6700},{\"attributes\":{\"id\":\"formula_1\"},\"end\":6777,\"start\":6758},{\"attributes\":{\"id\":\"formula_2\"},\"end\":7734,\"start\":7647},{\"attributes\":{\"id\":\"formula_3\"},\"end\":9410,\"start\":9332},{\"attributes\":{\"id\":\"formula_4\"},\"end\":9481,\"start\":9410},{\"attributes\":{\"id\":\"formula_5\"},\"end\":10454,\"start\":10350},{\"attributes\":{\"id\":\"formula_6\"},\"end\":11418,\"start\":11271},{\"attributes\":{\"id\":\"formula_7\"},\"end\":11483,\"start\":11418},{\"attributes\":{\"id\":\"formula_8\"},\"end\":12204,\"start\":12080},{\"attributes\":{\"id\":\"formula_9\"},\"end\":12324,\"start\":12239},{\"attributes\":{\"id\":\"formula_10\"},\"end\":12857,\"start\":12772},{\"attributes\":{\"id\":\"formula_11\"},\"end\":13923,\"start\":13898},{\"attributes\":{\"id\":\"formula_12\"},\"end\":14909,\"start\":14647},{\"attributes\":{\"id\":\"formula_13\"},\"end\":15139,\"start\":15043},{\"attributes\":{\"id\":\"formula_14\"},\"end\":15824,\"start\":15507},{\"attributes\":{\"id\":\"formula_15\"},\"end\":16163,\"start\":16022},{\"attributes\":{\"id\":\"formula_16\"},\"end\":16533,\"start\":16482},{\"attributes\":{\"id\":\"formula_17\"},\"end\":16720,\"start\":16640},{\"attributes\":{\"id\":\"formula_18\"},\"end\":17731,\"start\":17633},{\"attributes\":{\"id\":\"formula_19\"},\"end\":18003,\"start\":17975},{\"attributes\":{\"id\":\"formula_20\"},\"end\":18185,\"start\":18003},{\"attributes\":{\"id\":\"formula_21\"},\"end\":18822,\"start\":18488},{\"attributes\":{\"id\":\"formula_22\"},\"end\":19126,\"start\":18942},{\"attributes\":{\"id\":\"formula_23\"},\"end\":20488,\"start\":20358},{\"attributes\":{\"id\":\"formula_24\"},\"end\":20539,\"start\":20488},{\"attributes\":{\"id\":\"formula_25\"},\"end\":21105,\"start\":20969},{\"attributes\":{\"id\":\"formula_26\"},\"end\":21782,\"start\":21504},{\"attributes\":{\"id\":\"formula_27\"},\"end\":22166,\"start\":22115},{\"attributes\":{\"id\":\"formula_28\"},\"end\":22489,\"start\":22410},{\"attributes\":{\"id\":\"formula_29\"},\"end\":22806,\"start\":22735},{\"attributes\":{\"id\":\"formula_30\"},\"end\":23810,\"start\":23474},{\"attributes\":{\"id\":\"formula_31\"},\"end\":24044,\"start\":23810},{\"attributes\":{\"id\":\"formula_32\"},\"end\":24792,\"start\":24693},{\"attributes\":{\"id\":\"formula_33\"},\"end\":24917,\"start\":24828},{\"attributes\":{\"id\":\"formula_34\"},\"end\":25159,\"start\":25088},{\"attributes\":{\"id\":\"formula_35\"},\"end\":25717,\"start\":25647},{\"attributes\":{\"id\":\"formula_36\"},\"end\":25875,\"start\":25778},{\"attributes\":{\"id\":\"formula_37\"},\"end\":26111,\"start\":25917},{\"attributes\":{\"id\":\"formula_38\"},\"end\":26210,\"start\":26182},{\"attributes\":{\"id\":\"formula_39\"},\"end\":26368,\"start\":26321},{\"attributes\":{\"id\":\"formula_40\"},\"end\":26542,\"start\":26503},{\"attributes\":{\"id\":\"formula_41\"},\"end\":26633,\"start\":26542},{\"attributes\":{\"id\":\"formula_42\"},\"end\":26790,\"start\":26739},{\"attributes\":{\"id\":\"formula_43\"},\"end\":26944,\"start\":26905},{\"attributes\":{\"id\":\"formula_44\"},\"end\":27139,\"start\":27074},{\"attributes\":{\"id\":\"formula_45\"},\"end\":27240,\"start\":27216},{\"attributes\":{\"id\":\"formula_46\"},\"end\":27446,\"start\":27413},{\"attributes\":{\"id\":\"formula_47\"},\"end\":27546,\"start\":27522},{\"attributes\":{\"id\":\"formula_48\"},\"end\":28414,\"start\":28296},{\"attributes\":{\"id\":\"formula_49\"},\"end\":29040,\"start\":28913},{\"attributes\":{\"id\":\"formula_50\"},\"end\":29578,\"start\":29541},{\"attributes\":{\"id\":\"formula_51\"},\"end\":30064,\"start\":29920},{\"attributes\":{\"id\":\"formula_52\"},\"end\":31228,\"start\":31140},{\"attributes\":{\"id\":\"formula_53\"},\"end\":31907,\"start\":31808},{\"attributes\":{\"id\":\"formula_54\"},\"end\":32083,\"start\":31986},{\"attributes\":{\"id\":\"formula_55\"},\"end\":32398,\"start\":32251},{\"attributes\":{\"id\":\"formula_56\"},\"end\":32946,\"start\":32872},{\"attributes\":{\"id\":\"formula_57\"},\"end\":33193,\"start\":33094},{\"attributes\":{\"id\":\"formula_58\"},\"end\":33626,\"start\":33548},{\"attributes\":{\"id\":\"formula_59\"},\"end\":33921,\"start\":33834},{\"attributes\":{\"id\":\"formula_60\"},\"end\":35358,\"start\":35257},{\"attributes\":{\"id\":\"formula_61\"},\"end\":35598,\"start\":35403},{\"attributes\":{\"id\":\"formula_62\"},\"end\":36772,\"start\":36734},{\"attributes\":{\"id\":\"formula_63\"},\"end\":36939,\"start\":36772},{\"attributes\":{\"id\":\"formula_64\"},\"end\":37621,\"start\":37519},{\"attributes\":{\"id\":\"formula_65\"},\"end\":38128,\"start\":37977},{\"attributes\":{\"id\":\"formula_66\"},\"end\":39113,\"start\":38845},{\"attributes\":{\"id\":\"formula_67\"},\"end\":39485,\"start\":39436},{\"attributes\":{\"id\":\"formula_68\"},\"end\":39661,\"start\":39528},{\"attributes\":{\"id\":\"formula_69\"},\"end\":43364,\"start\":43267}]", "table_ref": "[{\"end\":7073,\"start\":7066},{\"end\":10041,\"start\":10034},{\"end\":10951,\"start\":10944},{\"end\":13281,\"start\":13274},{\"end\":13683,\"start\":13676},{\"end\":14136,\"start\":14129},{\"end\":14207,\"start\":14200},{\"end\":14394,\"start\":14387},{\"end\":15207,\"start\":15200},{\"end\":15307,\"start\":15300},{\"end\":15429,\"start\":15422},{\"attributes\":{\"ref_id\":\"tab_0\"},\"end\":17782,\"start\":17775},{\"attributes\":{\"ref_id\":\"tab_0\"},\"end\":18237,\"start\":18230},{\"end\":23191,\"start\":23184},{\"end\":23354,\"start\":23347},{\"end\":24555,\"start\":24548},{\"end\":24957,\"start\":24950},{\"end\":24983,\"start\":24976},{\"end\":25028,\"start\":25021},{\"end\":25075,\"start\":25068},{\"end\":25193,\"start\":25185},{\"attributes\":{\"ref_id\":\"tab_4\"},\"end\":25237,\"start\":25229},{\"end\":25284,\"start\":25276},{\"end\":25330,\"start\":25322},{\"end\":25367,\"start\":25351},{\"end\":27295,\"start\":27288},{\"end\":28019,\"start\":28012},{\"end\":28081,\"start\":28074},{\"end\":29124,\"start\":29117},{\"end\":30114,\"start\":30107},{\"end\":30216,\"start\":30209},{\"end\":30506,\"start\":30499},{\"end\":31263,\"start\":31256},{\"attributes\":{\"ref_id\":\"tab_4\"},\"end\":32155,\"start\":32147},{\"attributes\":{\"ref_id\":\"tab_4\"},\"end\":32249,\"start\":32241},{\"end\":32806,\"start\":32798},{\"end\":33092,\"start\":33084},{\"end\":33267,\"start\":33259},{\"end\":33671,\"start\":33663},{\"end\":33973,\"start\":33965},{\"end\":35134,\"start\":35126},{\"end\":35654,\"start\":35646},{\"attributes\":{\"ref_id\":\"tab_0\"},\"end\":35733,\"start\":35725},{\"attributes\":{\"ref_id\":\"tab_0\"},\"end\":36198,\"start\":36189},{\"end\":37881,\"start\":37873},{\"attributes\":{\"ref_id\":\"tab_0\"},\"end\":37946,\"start\":37938},{\"end\":39706,\"start\":39698},{\"attributes\":{\"ref_id\":\"tab_0\"},\"end\":40218,\"start\":40202},{\"end\":41174,\"start\":41166},{\"end\":41546,\"start\":41539},{\"end\":41804,\"start\":41796},{\"end\":41964,\"start\":41956},{\"end\":42567,\"start\":42559},{\"end\":43682,\"start\":43674},{\"end\":43879,\"start\":43871}]", "section_header": "[{\"attributes\":{\"n\":\"2.\"},\"end\":7766,\"start\":7736},{\"end\":14145,\"start\":14140},{\"attributes\":{\"n\":\"2.2.\"},\"end\":15860,\"start\":15826},{\"attributes\":{\"n\":\"3.\"},\"end\":24053,\"start\":24046},{\"end\":25879,\"start\":25877},{\"end\":28295,\"start\":28242},{\"end\":28420,\"start\":28416},{\"end\":28669,\"start\":28664},{\"end\":36943,\"start\":36941},{\"attributes\":{\"n\":\"4.\"},\"end\":44323,\"start\":44312},{\"end\":46612,\"start\":46605},{\"end\":46946,\"start\":46941},{\"end\":49213,\"start\":49207},{\"end\":49593,\"start\":49584},{\"end\":50226,\"start\":50216}]", "table": "[{\"end\":49890,\"start\":49646},{\"end\":50214,\"start\":50166},{\"end\":50537,\"start\":50407}]", "figure_caption": "[{\"end\":46603,\"start\":46404},{\"end\":46753,\"start\":46613},{\"end\":46939,\"start\":46756},{\"end\":47294,\"start\":46948},{\"end\":47513,\"start\":47297},{\"end\":47732,\"start\":47516},{\"end\":47876,\"start\":47735},{\"end\":47968,\"start\":47879},{\"end\":48190,\"start\":47971},{\"end\":48674,\"start\":48193},{\"end\":48803,\"start\":48677},{\"end\":48943,\"start\":48806},{\"end\":49054,\"start\":48946},{\"end\":49205,\"start\":49057},{\"end\":49582,\"start\":49215},{\"end\":49646,\"start\":49595},{\"end\":50166,\"start\":49893},{\"end\":50407,\"start\":50229}]", "figure_ref": null, "bib_author_first_name": "[{\"end\":52715,\"start\":52714},{\"end\":52717,\"start\":52716},{\"end\":52962,\"start\":52961},{\"end\":52973,\"start\":52972},{\"end\":53230,\"start\":53229},{\"end\":53232,\"start\":53231},{\"end\":53243,\"start\":53242},{\"end\":53253,\"start\":53252},{\"end\":53635,\"start\":53634},{\"end\":53637,\"start\":53636},{\"end\":53973,\"start\":53972},{\"end\":53975,\"start\":53974},{\"end\":53988,\"start\":53987},{\"end\":54001,\"start\":54000},{\"end\":54010,\"start\":54009},{\"end\":54344,\"start\":54343},{\"end\":54390,\"start\":54389},{\"end\":54438,\"start\":54437},{\"end\":54489,\"start\":54488},{\"end\":54547,\"start\":54546},{\"end\":54595,\"start\":54594},{\"end\":54597,\"start\":54596},{\"end\":55061,\"start\":55060},{\"end\":55071,\"start\":55070},{\"end\":55085,\"start\":55081},{\"end\":55298,\"start\":55297},{\"end\":55308,\"start\":55307},{\"end\":55310,\"start\":55309},{\"end\":55323,\"start\":55322},{\"end\":55336,\"start\":55335},{\"end\":55338,\"start\":55337},{\"end\":55624,\"start\":55623},{\"end\":55875,\"start\":55874},{\"end\":55885,\"start\":55884},{\"end\":55887,\"start\":55886},{\"end\":56210,\"start\":56209},{\"end\":56217,\"start\":56216},{\"end\":56228,\"start\":56224},{\"end\":56236,\"start\":56235},{\"end\":56246,\"start\":56242},{\"end\":56639,\"start\":56638},{\"end\":56653,\"start\":56652},{\"end\":56666,\"start\":56665},{\"end\":57014,\"start\":57013},{\"end\":57028,\"start\":57027},{\"end\":57030,\"start\":57029},{\"end\":57333,\"start\":57332},{\"end\":57344,\"start\":57343},{\"end\":57355,\"start\":57354},{\"end\":57357,\"start\":57356},{\"end\":57373,\"start\":57372},{\"end\":57718,\"start\":57717},{\"end\":57733,\"start\":57732},{\"end\":58073,\"start\":58072},{\"end\":58084,\"start\":58083},{\"end\":58094,\"start\":58093},{\"end\":58326,\"start\":58325},{\"end\":58339,\"start\":58338},{\"end\":58354,\"start\":58353},{\"end\":58689,\"start\":58688},{\"end\":58703,\"start\":58702},{\"end\":58713,\"start\":58712},{\"end\":58721,\"start\":58720},{\"end\":58732,\"start\":58731},{\"end\":58734,\"start\":58733},{\"end\":59114,\"start\":59113},{\"end\":59128,\"start\":59127},{\"end\":59412,\"start\":59411},{\"end\":59424,\"start\":59423},{\"end\":59435,\"start\":59434},{\"end\":59437,\"start\":59436},{\"end\":59687,\"start\":59686},{\"end\":59698,\"start\":59697},{\"end\":59708,\"start\":59707},{\"end\":59975,\"start\":59974},{\"end\":59977,\"start\":59976},{\"end\":59988,\"start\":59987},{\"end\":59990,\"start\":59989},{\"end\":60001,\"start\":60000},{\"end\":60012,\"start\":60011},{\"end\":60384,\"start\":60383},{\"end\":60394,\"start\":60393},{\"end\":60406,\"start\":60405},{\"end\":60780,\"start\":60779},{\"end\":60782,\"start\":60781},{\"end\":60790,\"start\":60789},{\"end\":60792,\"start\":60791},{\"end\":60799,\"start\":60798},{\"end\":60810,\"start\":60809},{\"end\":60820,\"start\":60819},{\"end\":60828,\"start\":60827},{\"end\":60830,\"start\":60829},{\"end\":61246,\"start\":61245},{\"end\":61254,\"start\":61253},{\"end\":61559,\"start\":61558},{\"end\":61860,\"start\":61859},{\"end\":62358,\"start\":62357},{\"end\":62670,\"start\":62669},{\"end\":63101,\"start\":63100},{\"end\":63125,\"start\":63123},{\"end\":63453,\"start\":63452},{\"end\":63768,\"start\":63767},{\"end\":64161,\"start\":64160},{\"end\":64165,\"start\":64162},{\"end\":64395,\"start\":64394},{\"end\":64719,\"start\":64718},{\"end\":64748,\"start\":64747},{\"end\":64777,\"start\":64776},{\"end\":64809,\"start\":64808},{\"end\":64840,\"start\":64839},{\"end\":64871,\"start\":64870},{\"end\":64910,\"start\":64909},{\"end\":64912,\"start\":64911},{\"end\":65329,\"start\":65328},{\"end\":65354,\"start\":65353},{\"end\":65356,\"start\":65355},{\"end\":65389,\"start\":65388},{\"end\":65418,\"start\":65417},{\"end\":65457,\"start\":65456},{\"end\":65486,\"start\":65485},{\"end\":65515,\"start\":65514},{\"end\":65547,\"start\":65546},{\"end\":65549,\"start\":65548},{\"end\":65582,\"start\":65581},{\"end\":66034,\"start\":66033},{\"end\":66047,\"start\":66046},{\"end\":66352,\"start\":66351},{\"end\":66641,\"start\":66640},{\"end\":66653,\"start\":66652},{\"end\":66662,\"start\":66661},{\"end\":66929,\"start\":66928},{\"end\":67139,\"start\":67138},{\"end\":67150,\"start\":67149},{\"end\":67165,\"start\":67164},{\"end\":67167,\"start\":67166},{\"end\":67516,\"start\":67515},{\"end\":67518,\"start\":67517},{\"end\":67857,\"start\":67853},{\"end\":67869,\"start\":67865},{\"end\":67880,\"start\":67876},{\"end\":68208,\"start\":68207},{\"end\":68219,\"start\":68218},{\"end\":68230,\"start\":68229},{\"end\":68232,\"start\":68231},{\"end\":68248,\"start\":68247},{\"end\":68583,\"start\":68582},{\"end\":68593,\"start\":68592},{\"end\":68595,\"start\":68594},{\"end\":68817,\"start\":68816},{\"end\":68827,\"start\":68826},{\"end\":68829,\"start\":68828},{\"end\":69124,\"start\":69123},{\"end\":69139,\"start\":69135},{\"end\":69491,\"start\":69490},{\"end\":69503,\"start\":69502},{\"end\":69514,\"start\":69513},{\"end\":69895,\"start\":69891},{\"end\":69907,\"start\":69903},{\"end\":70280,\"start\":70279},{\"end\":70290,\"start\":70286},{\"end\":70301,\"start\":70297},{\"end\":70308,\"start\":70307},{\"end\":70600,\"start\":70599},{\"end\":70602,\"start\":70601},{\"end\":70611,\"start\":70610},{\"end\":70613,\"start\":70612},{\"end\":70632,\"start\":70631},{\"end\":70634,\"start\":70633},{\"end\":70946,\"start\":70945},{\"end\":70956,\"start\":70955},{\"end\":70963,\"start\":70962},{\"end\":70965,\"start\":70964},{\"end\":70974,\"start\":70973},{\"end\":70976,\"start\":70975},{\"end\":71209,\"start\":71208},{\"end\":71211,\"start\":71210},{\"end\":71220,\"start\":71219},{\"end\":71230,\"start\":71229},{\"end\":71243,\"start\":71242},{\"end\":71245,\"start\":71244},{\"end\":71539,\"start\":71538},{\"end\":71541,\"start\":71540},{\"end\":71551,\"start\":71550},{\"end\":71553,\"start\":71552},{\"end\":71756,\"start\":71755},{\"end\":71768,\"start\":71767},{\"end\":71781,\"start\":71780},{\"end\":72009,\"start\":72008},{\"end\":72015,\"start\":72014},{\"end\":72276,\"start\":72275},{\"end\":72278,\"start\":72277},{\"end\":72288,\"start\":72287},{\"end\":72290,\"start\":72289},{\"end\":72299,\"start\":72298},{\"end\":72677,\"start\":72676},{\"end\":72692,\"start\":72691},{\"end\":72703,\"start\":72702},{\"end\":72705,\"start\":72704},{\"end\":72965,\"start\":72964},{\"end\":72974,\"start\":72973},{\"end\":73160,\"start\":73159},{\"end\":73162,\"start\":73161},{\"end\":73180,\"start\":73179},{\"end\":73182,\"start\":73181},{\"end\":73192,\"start\":73191},{\"end\":73194,\"start\":73193},{\"end\":73204,\"start\":73203},{\"end\":73206,\"start\":73205},{\"end\":73557,\"start\":73556},{\"end\":73568,\"start\":73567},{\"end\":73581,\"start\":73580},{\"end\":73922,\"start\":73921},{\"end\":73924,\"start\":73923},{\"end\":73964,\"start\":73963},{\"end\":73966,\"start\":73965},{\"end\":74358,\"start\":74357},{\"end\":74726,\"start\":74725}]", "bib_author_last_name": "[{\"end\":52722,\"start\":52718},{\"end\":52970,\"start\":52963},{\"end\":52979,\"start\":52974},{\"end\":53240,\"start\":53233},{\"end\":53250,\"start\":53244},{\"end\":53262,\"start\":53254},{\"end\":53644,\"start\":53638},{\"end\":53985,\"start\":53976},{\"end\":53998,\"start\":53989},{\"end\":54007,\"start\":54002},{\"end\":54017,\"start\":54011},{\"end\":54350,\"start\":54345},{\"end\":54398,\"start\":54391},{\"end\":54449,\"start\":54439},{\"end\":54507,\"start\":54490},{\"end\":54555,\"start\":54548},{\"end\":54609,\"start\":54598},{\"end\":55068,\"start\":55062},{\"end\":55079,\"start\":55072},{\"end\":55093,\"start\":55086},{\"end\":55305,\"start\":55299},{\"end\":55320,\"start\":55311},{\"end\":55333,\"start\":55324},{\"end\":55346,\"start\":55339},{\"end\":55631,\"start\":55625},{\"end\":55882,\"start\":55876},{\"end\":55897,\"start\":55888},{\"end\":56214,\"start\":56211},{\"end\":56222,\"start\":56218},{\"end\":56233,\"start\":56229},{\"end\":56240,\"start\":56237},{\"end\":56250,\"start\":56247},{\"end\":56650,\"start\":56640},{\"end\":56663,\"start\":56654},{\"end\":56674,\"start\":56667},{\"end\":57025,\"start\":57015},{\"end\":57038,\"start\":57031},{\"end\":57341,\"start\":57334},{\"end\":57352,\"start\":57345},{\"end\":57370,\"start\":57358},{\"end\":57382,\"start\":57374},{\"end\":57730,\"start\":57719},{\"end\":57741,\"start\":57734},{\"end\":58081,\"start\":58074},{\"end\":58091,\"start\":58085},{\"end\":58102,\"start\":58095},{\"end\":58336,\"start\":58327},{\"end\":58351,\"start\":58340},{\"end\":58362,\"start\":58355},{\"end\":58700,\"start\":58690},{\"end\":58710,\"start\":58704},{\"end\":58718,\"start\":58714},{\"end\":58729,\"start\":58722},{\"end\":58742,\"start\":58735},{\"end\":59125,\"start\":59115},{\"end\":59136,\"start\":59129},{\"end\":59421,\"start\":59413},{\"end\":59432,\"start\":59425},{\"end\":59445,\"start\":59438},{\"end\":59695,\"start\":59688},{\"end\":59705,\"start\":59699},{\"end\":59717,\"start\":59709},{\"end\":59985,\"start\":59978},{\"end\":59998,\"start\":59991},{\"end\":60009,\"start\":60002},{\"end\":60023,\"start\":60013},{\"end\":60391,\"start\":60385},{\"end\":60403,\"start\":60395},{\"end\":60411,\"start\":60407},{\"end\":60787,\"start\":60783},{\"end\":60796,\"start\":60793},{\"end\":60807,\"start\":60800},{\"end\":60817,\"start\":60811},{\"end\":60825,\"start\":60821},{\"end\":60834,\"start\":60831},{\"end\":61251,\"start\":61247},{\"end\":61259,\"start\":61255},{\"end\":61568,\"start\":61560},{\"end\":61869,\"start\":61861},{\"end\":62364,\"start\":62359},{\"end\":62681,\"start\":62671},{\"end\":63131,\"start\":63126},{\"end\":63462,\"start\":63454},{\"end\":63777,\"start\":63769},{\"end\":64170,\"start\":64166},{\"end\":64402,\"start\":64396},{\"end\":64727,\"start\":64720},{\"end\":64756,\"start\":64749},{\"end\":64788,\"start\":64778},{\"end\":64819,\"start\":64810},{\"end\":64850,\"start\":64841},{\"end\":64889,\"start\":64872},{\"end\":64924,\"start\":64913},{\"end\":65333,\"start\":65330},{\"end\":65368,\"start\":65357},{\"end\":65397,\"start\":65390},{\"end\":65436,\"start\":65419},{\"end\":65465,\"start\":65458},{\"end\":65494,\"start\":65487},{\"end\":65526,\"start\":65516},{\"end\":65561,\"start\":65550},{\"end\":65586,\"start\":65583},{\"end\":66044,\"start\":66035},{\"end\":66056,\"start\":66048},{\"end\":66368,\"start\":66353},{\"end\":66650,\"start\":66642},{\"end\":66659,\"start\":66654},{\"end\":66668,\"start\":66663},{\"end\":66935,\"start\":66930},{\"end\":67147,\"start\":67140},{\"end\":67162,\"start\":67151},{\"end\":67176,\"start\":67168},{\"end\":67533,\"start\":67519},{\"end\":67863,\"start\":67858},{\"end\":67874,\"start\":67870},{\"end\":67884,\"start\":67881},{\"end\":68216,\"start\":68209},{\"end\":68227,\"start\":68220},{\"end\":68245,\"start\":68233},{\"end\":68257,\"start\":68249},{\"end\":68590,\"start\":68584},{\"end\":68601,\"start\":68596},{\"end\":68824,\"start\":68818},{\"end\":68835,\"start\":68830},{\"end\":69133,\"start\":69125},{\"end\":69144,\"start\":69140},{\"end\":69500,\"start\":69492},{\"end\":69511,\"start\":69504},{\"end\":69522,\"start\":69515},{\"end\":69901,\"start\":69896},{\"end\":69912,\"start\":69908},{\"end\":70284,\"start\":70281},{\"end\":70295,\"start\":70291},{\"end\":70305,\"start\":70302},{\"end\":70312,\"start\":70309},{\"end\":70608,\"start\":70603},{\"end\":70629,\"start\":70614},{\"end\":70641,\"start\":70635},{\"end\":70953,\"start\":70947},{\"end\":70960,\"start\":70957},{\"end\":70971,\"start\":70966},{\"end\":70983,\"start\":70977},{\"end\":71217,\"start\":71212},{\"end\":71227,\"start\":71221},{\"end\":71240,\"start\":71231},{\"end\":71252,\"start\":71246},{\"end\":71548,\"start\":71542},{\"end\":71561,\"start\":71554},{\"end\":71765,\"start\":71757},{\"end\":71778,\"start\":71769},{\"end\":71788,\"start\":71782},{\"end\":72012,\"start\":72010},{\"end\":72021,\"start\":72016},{\"end\":72285,\"start\":72279},{\"end\":72296,\"start\":72291},{\"end\":72305,\"start\":72300},{\"end\":72689,\"start\":72678},{\"end\":72700,\"start\":72693},{\"end\":72713,\"start\":72706},{\"end\":72971,\"start\":72966},{\"end\":72981,\"start\":72975},{\"end\":73177,\"start\":73163},{\"end\":73189,\"start\":73183},{\"end\":73201,\"start\":73195},{\"end\":73215,\"start\":73207},{\"end\":73565,\"start\":73558},{\"end\":73578,\"start\":73569},{\"end\":73589,\"start\":73582},{\"end\":73932,\"start\":73925},{\"end\":73972,\"start\":73967},{\"end\":74366,\"start\":74359},{\"end\":74731,\"start\":74727}]", "bib_entry": "[{\"attributes\":{\"doi\":\"10.1093/ptep/ptaa104\",\"id\":\"b0\",\"matched_paper_id\":40016674},\"end\":52902,\"start\":52686},{\"attributes\":{\"id\":\"b1\"},\"end\":53064,\"start\":52904},{\"attributes\":{\"doi\":\"10.1103/PhysRevD.32.189\",\"id\":\"b2\"},\"end\":53143,\"start\":53066},{\"attributes\":{\"doi\":\"10.1140/epja/i2014-14126-6\",\"id\":\"b3\",\"matched_paper_id\":119220149},\"end\":53518,\"start\":53145},{\"attributes\":{\"id\":\"b4\",\"matched_paper_id\":118569293},\"end\":53895,\"start\":53520},{\"attributes\":{\"id\":\"b5\",\"matched_paper_id\":232258124},\"end\":54287,\"start\":53897},{\"attributes\":{\"id\":\"b6\"},\"end\":54982,\"start\":54289},{\"attributes\":{\"id\":\"b7\"},\"end\":55263,\"start\":54984},{\"attributes\":{\"id\":\"b8\",\"matched_paper_id\":248781573},\"end\":55578,\"start\":55265},{\"attributes\":{\"id\":\"b9\",\"matched_paper_id\":233307421},\"end\":55824,\"start\":55580},{\"attributes\":{\"id\":\"b10\",\"matched_paper_id\":244954736},\"end\":56115,\"start\":55826},{\"attributes\":{\"id\":\"b11\",\"matched_paper_id\":248406066},\"end\":56538,\"start\":56117},{\"attributes\":{\"id\":\"b12\",\"matched_paper_id\":118863192},\"end\":56958,\"start\":56540},{\"attributes\":{\"id\":\"b13\"},\"end\":57127,\"start\":56960},{\"attributes\":{\"id\":\"b14\"},\"end\":57250,\"start\":57129},{\"attributes\":{\"id\":\"b15\",\"matched_paper_id\":119470881},\"end\":57647,\"start\":57252},{\"attributes\":{\"id\":\"b16\",\"matched_paper_id\":119200297},\"end\":57985,\"start\":57649},{\"attributes\":{\"id\":\"b17\"},\"end\":58278,\"start\":57987},{\"attributes\":{\"id\":\"b18\",\"matched_paper_id\":231572729},\"end\":58594,\"start\":58280},{\"attributes\":{\"id\":\"b19\",\"matched_paper_id\":118548456},\"end\":59036,\"start\":58596},{\"attributes\":{\"id\":\"b20\",\"matched_paper_id\":876908},\"end\":59384,\"start\":59038},{\"attributes\":{\"id\":\"b21\"},\"end\":59653,\"start\":59386},{\"attributes\":{\"id\":\"b22\",\"matched_paper_id\":119308580},\"end\":59929,\"start\":59655},{\"attributes\":{\"id\":\"b23\",\"matched_paper_id\":210714164},\"end\":60281,\"start\":59931},{\"attributes\":{\"id\":\"b24\",\"matched_paper_id\":9165985},\"end\":60677,\"start\":60283},{\"attributes\":{\"id\":\"b25\"},\"end\":61134,\"start\":60679},{\"attributes\":{\"id\":\"b26\",\"matched_paper_id\":53654653},\"end\":61519,\"start\":61136},{\"attributes\":{\"id\":\"b27\",\"matched_paper_id\":54662836},\"end\":61829,\"start\":61521},{\"attributes\":{\"id\":\"b28\",\"matched_paper_id\":124652371},\"end\":62287,\"start\":61831},{\"attributes\":{\"id\":\"b29\",\"matched_paper_id\":125965500},\"end\":62628,\"start\":62289},{\"attributes\":{\"id\":\"b30\"},\"end\":62802,\"start\":62630},{\"attributes\":{\"id\":\"b31\"},\"end\":63057,\"start\":62804},{\"attributes\":{\"id\":\"b32\"},\"end\":63235,\"start\":63059},{\"attributes\":{\"id\":\"b33\"},\"end\":63377,\"start\":63237},{\"attributes\":{\"id\":\"b34\",\"matched_paper_id\":122353153},\"end\":63676,\"start\":63379},{\"attributes\":{\"id\":\"b35\",\"matched_paper_id\":55639185},\"end\":64075,\"start\":63678},{\"attributes\":{\"id\":\"b36\"},\"end\":64327,\"start\":64077},{\"attributes\":{\"id\":\"b37\",\"matched_paper_id\":226222269},\"end\":64676,\"start\":64329},{\"attributes\":{\"id\":\"b38\",\"matched_paper_id\":218487812},\"end\":65256,\"start\":64678},{\"attributes\":{\"id\":\"b39\",\"matched_paper_id\":49552846},\"end\":65965,\"start\":65258},{\"attributes\":{\"id\":\"b40\",\"matched_paper_id\":119233896},\"end\":66291,\"start\":65967},{\"attributes\":{\"id\":\"b41\",\"matched_paper_id\":118671653},\"end\":66587,\"start\":66293},{\"attributes\":{\"id\":\"b42\",\"matched_paper_id\":9991662},\"end\":66886,\"start\":66589},{\"attributes\":{\"id\":\"b43\",\"matched_paper_id\":14190581},\"end\":67077,\"start\":66888},{\"attributes\":{\"id\":\"b44\",\"matched_paper_id\":119446644},\"end\":67421,\"start\":67079},{\"attributes\":{\"id\":\"b45\",\"matched_paper_id\":231602984},\"end\":67798,\"start\":67423},{\"attributes\":{\"id\":\"b46\",\"matched_paper_id\":119367160},\"end\":68106,\"start\":67800},{\"attributes\":{\"id\":\"b47\",\"matched_paper_id\":41175946},\"end\":68546,\"start\":68108},{\"attributes\":{\"id\":\"b48\",\"matched_paper_id\":6610684},\"end\":68782,\"start\":68548},{\"attributes\":{\"id\":\"b49\",\"matched_paper_id\":18183952},\"end\":69034,\"start\":68784},{\"attributes\":{\"id\":\"b50\",\"matched_paper_id\":118693840},\"end\":69393,\"start\":69036},{\"attributes\":{\"id\":\"b51\",\"matched_paper_id\":119001547},\"end\":69793,\"start\":69395},{\"attributes\":{\"id\":\"b52\",\"matched_paper_id\":119091582},\"end\":70225,\"start\":69795},{\"attributes\":{\"id\":\"b53\",\"matched_paper_id\":119362637},\"end\":70546,\"start\":70227},{\"attributes\":{\"id\":\"b54\",\"matched_paper_id\":216056182},\"end\":70890,\"start\":70548},{\"attributes\":{\"id\":\"b55\",\"matched_paper_id\":126452288},\"end\":71170,\"start\":70892},{\"attributes\":{\"id\":\"b56\"},\"end\":71490,\"start\":71172},{\"attributes\":{\"id\":\"b57\",\"matched_paper_id\":120038380},\"end\":71722,\"start\":71492},{\"attributes\":{\"id\":\"b58\",\"matched_paper_id\":122767396},\"end\":71937,\"start\":71724},{\"attributes\":{\"id\":\"b59\",\"matched_paper_id\":29458850},\"end\":72187,\"start\":71939},{\"attributes\":{\"id\":\"b60\",\"matched_paper_id\":16088345},\"end\":72614,\"start\":72189},{\"attributes\":{\"id\":\"b61\",\"matched_paper_id\":119028696},\"end\":72948,\"start\":72616},{\"attributes\":{\"id\":\"b62\"},\"end\":73094,\"start\":72950},{\"attributes\":{\"id\":\"b63\"},\"end\":73486,\"start\":73096},{\"attributes\":{\"id\":\"b64\",\"matched_paper_id\":235358988},\"end\":73845,\"start\":73488},{\"attributes\":{\"id\":\"b65\",\"matched_paper_id\":227238850},\"end\":74280,\"start\":73847},{\"attributes\":{\"id\":\"b66\",\"matched_paper_id\":245502775},\"end\":74660,\"start\":74282},{\"attributes\":{\"id\":\"b67\",\"matched_paper_id\":15741174},\"end\":74939,\"start\":74662}]", "bib_title": "[{\"end\":52712,\"start\":52686},{\"end\":53227,\"start\":53145},{\"end\":53632,\"start\":53520},{\"end\":53970,\"start\":53897},{\"end\":54341,\"start\":54289},{\"end\":55295,\"start\":55265},{\"end\":55621,\"start\":55580},{\"end\":55872,\"start\":55826},{\"end\":56207,\"start\":56117},{\"end\":56636,\"start\":56540},{\"end\":57330,\"start\":57252},{\"end\":57715,\"start\":57649},{\"end\":58323,\"start\":58280},{\"end\":58686,\"start\":58596},{\"end\":59111,\"start\":59038},{\"end\":59409,\"start\":59386},{\"end\":59684,\"start\":59655},{\"end\":59972,\"start\":59931},{\"end\":60381,\"start\":60283},{\"end\":60777,\"start\":60679},{\"end\":61243,\"start\":61136},{\"end\":61556,\"start\":61521},{\"end\":61857,\"start\":61831},{\"end\":62355,\"start\":62289},{\"end\":63450,\"start\":63379},{\"end\":63765,\"start\":63678},{\"end\":64392,\"start\":64329},{\"end\":64716,\"start\":64678},{\"end\":65326,\"start\":65258},{\"end\":66031,\"start\":65967},{\"end\":66349,\"start\":66293},{\"end\":66638,\"start\":66589},{\"end\":66926,\"start\":66888},{\"end\":67136,\"start\":67079},{\"end\":67513,\"start\":67423},{\"end\":67851,\"start\":67800},{\"end\":68205,\"start\":68108},{\"end\":68580,\"start\":68548},{\"end\":68814,\"start\":68784},{\"end\":69121,\"start\":69036},{\"end\":69488,\"start\":69395},{\"end\":69889,\"start\":69795},{\"end\":70277,\"start\":70227},{\"end\":70597,\"start\":70548},{\"end\":70943,\"start\":70892},{\"end\":71206,\"start\":71172},{\"end\":71536,\"start\":71492},{\"end\":71753,\"start\":71724},{\"end\":72006,\"start\":71939},{\"end\":72273,\"start\":72189},{\"end\":72674,\"start\":72616},{\"end\":72962,\"start\":72950},{\"end\":73157,\"start\":73096},{\"end\":73554,\"start\":73488},{\"end\":73919,\"start\":73847},{\"end\":74355,\"start\":74282},{\"end\":74723,\"start\":74662}]", "bib_author": "[{\"end\":52757,\"start\":52714},{\"end\":52972,\"start\":52961},{\"end\":52981,\"start\":52972},{\"end\":53242,\"start\":53229},{\"end\":53252,\"start\":53242},{\"end\":53264,\"start\":53252},{\"end\":53646,\"start\":53634},{\"end\":53987,\"start\":53972},{\"end\":54000,\"start\":53987},{\"end\":54009,\"start\":54000},{\"end\":54019,\"start\":54009},{\"end\":54389,\"start\":54343},{\"end\":54437,\"start\":54389},{\"end\":54488,\"start\":54437},{\"end\":54546,\"start\":54488},{\"end\":54594,\"start\":54546},{\"end\":54648,\"start\":54594},{\"end\":55070,\"start\":55060},{\"end\":55081,\"start\":55070},{\"end\":55095,\"start\":55081},{\"end\":55307,\"start\":55297},{\"end\":55322,\"start\":55307},{\"end\":55335,\"start\":55322},{\"end\":55348,\"start\":55335},{\"end\":55633,\"start\":55623},{\"end\":55884,\"start\":55874},{\"end\":55899,\"start\":55884},{\"end\":56216,\"start\":56209},{\"end\":56224,\"start\":56216},{\"end\":56235,\"start\":56224},{\"end\":56242,\"start\":56235},{\"end\":56252,\"start\":56242},{\"end\":56652,\"start\":56638},{\"end\":56665,\"start\":56652},{\"end\":56676,\"start\":56665},{\"end\":57027,\"start\":57013},{\"end\":57040,\"start\":57027},{\"end\":57343,\"start\":57332},{\"end\":57354,\"start\":57343},{\"end\":57372,\"start\":57354},{\"end\":57384,\"start\":57372},{\"end\":57732,\"start\":57717},{\"end\":57743,\"start\":57732},{\"end\":58083,\"start\":58072},{\"end\":58093,\"start\":58083},{\"end\":58104,\"start\":58093},{\"end\":58338,\"start\":58325},{\"end\":58353,\"start\":58338},{\"end\":58364,\"start\":58353},{\"end\":58702,\"start\":58688},{\"end\":58712,\"start\":58702},{\"end\":58720,\"start\":58712},{\"end\":58731,\"start\":58720},{\"end\":58744,\"start\":58731},{\"end\":59127,\"start\":59113},{\"end\":59138,\"start\":59127},{\"end\":59423,\"start\":59411},{\"end\":59434,\"start\":59423},{\"end\":59447,\"start\":59434},{\"end\":59697,\"start\":59686},{\"end\":59707,\"start\":59697},{\"end\":59719,\"start\":59707},{\"end\":59987,\"start\":59974},{\"end\":60000,\"start\":59987},{\"end\":60011,\"start\":60000},{\"end\":60025,\"start\":60011},{\"end\":60393,\"start\":60383},{\"end\":60405,\"start\":60393},{\"end\":60413,\"start\":60405},{\"end\":60789,\"start\":60779},{\"end\":60798,\"start\":60789},{\"end\":60809,\"start\":60798},{\"end\":60819,\"start\":60809},{\"end\":60827,\"start\":60819},{\"end\":60836,\"start\":60827},{\"end\":61253,\"start\":61245},{\"end\":61261,\"start\":61253},{\"end\":61570,\"start\":61558},{\"end\":61891,\"start\":61859},{\"end\":62384,\"start\":62357},{\"end\":62704,\"start\":62669},{\"end\":63123,\"start\":63100},{\"end\":63152,\"start\":63123},{\"end\":63483,\"start\":63452},{\"end\":63798,\"start\":63767},{\"end\":64191,\"start\":64160},{\"end\":64422,\"start\":64394},{\"end\":64747,\"start\":64718},{\"end\":64776,\"start\":64747},{\"end\":64808,\"start\":64776},{\"end\":64839,\"start\":64808},{\"end\":64870,\"start\":64839},{\"end\":64909,\"start\":64870},{\"end\":64944,\"start\":64909},{\"end\":65353,\"start\":65328},{\"end\":65388,\"start\":65353},{\"end\":65417,\"start\":65388},{\"end\":65456,\"start\":65417},{\"end\":65485,\"start\":65456},{\"end\":65514,\"start\":65485},{\"end\":65546,\"start\":65514},{\"end\":65581,\"start\":65546},{\"end\":65606,\"start\":65581},{\"end\":66046,\"start\":66033},{\"end\":66058,\"start\":66046},{\"end\":66370,\"start\":66351},{\"end\":66652,\"start\":66640},{\"end\":66661,\"start\":66652},{\"end\":66670,\"start\":66661},{\"end\":66937,\"start\":66928},{\"end\":67149,\"start\":67138},{\"end\":67164,\"start\":67149},{\"end\":67178,\"start\":67164},{\"end\":67535,\"start\":67515},{\"end\":67865,\"start\":67853},{\"end\":67876,\"start\":67865},{\"end\":67886,\"start\":67876},{\"end\":68218,\"start\":68207},{\"end\":68229,\"start\":68218},{\"end\":68247,\"start\":68229},{\"end\":68259,\"start\":68247},{\"end\":68592,\"start\":68582},{\"end\":68603,\"start\":68592},{\"end\":68826,\"start\":68816},{\"end\":68837,\"start\":68826},{\"end\":69135,\"start\":69123},{\"end\":69146,\"start\":69135},{\"end\":69502,\"start\":69490},{\"end\":69513,\"start\":69502},{\"end\":69524,\"start\":69513},{\"end\":69903,\"start\":69891},{\"end\":69914,\"start\":69903},{\"end\":70286,\"start\":70279},{\"end\":70297,\"start\":70286},{\"end\":70307,\"start\":70297},{\"end\":70314,\"start\":70307},{\"end\":70610,\"start\":70599},{\"end\":70631,\"start\":70610},{\"end\":70643,\"start\":70631},{\"end\":70955,\"start\":70945},{\"end\":70962,\"start\":70955},{\"end\":70973,\"start\":70962},{\"end\":70985,\"start\":70973},{\"end\":71219,\"start\":71208},{\"end\":71229,\"start\":71219},{\"end\":71242,\"start\":71229},{\"end\":71254,\"start\":71242},{\"end\":71550,\"start\":71538},{\"end\":71563,\"start\":71550},{\"end\":71767,\"start\":71755},{\"end\":71780,\"start\":71767},{\"end\":71790,\"start\":71780},{\"end\":72014,\"start\":72008},{\"end\":72023,\"start\":72014},{\"end\":72287,\"start\":72275},{\"end\":72298,\"start\":72287},{\"end\":72307,\"start\":72298},{\"end\":72691,\"start\":72676},{\"end\":72702,\"start\":72691},{\"end\":72715,\"start\":72702},{\"end\":72973,\"start\":72964},{\"end\":72983,\"start\":72973},{\"end\":73179,\"start\":73159},{\"end\":73191,\"start\":73179},{\"end\":73203,\"start\":73191},{\"end\":73217,\"start\":73203},{\"end\":73567,\"start\":73556},{\"end\":73580,\"start\":73567},{\"end\":73591,\"start\":73580},{\"end\":73963,\"start\":73921},{\"end\":74003,\"start\":73963},{\"end\":74368,\"start\":74357},{\"end\":74733,\"start\":74725}]", "bib_venue": "[{\"end\":62087,\"start\":62009},{\"end\":52781,\"start\":52777},{\"end\":52959,\"start\":52904},{\"end\":53103,\"start\":53091},{\"end\":53320,\"start\":53305},{\"end\":53701,\"start\":53691},{\"end\":54078,\"start\":54065},{\"end\":54710,\"start\":54695},{\"end\":55058,\"start\":54984},{\"end\":55407,\"start\":55394},{\"end\":55692,\"start\":55679},{\"end\":55958,\"start\":55945},{\"end\":56307,\"start\":56295},{\"end\":56730,\"start\":56718},{\"end\":57011,\"start\":56960},{\"end\":57187,\"start\":57175},{\"end\":57442,\"start\":57430},{\"end\":57800,\"start\":57785},{\"end\":58070,\"start\":57987},{\"end\":58419,\"start\":58407},{\"end\":58797,\"start\":58785},{\"end\":59199,\"start\":59184},{\"end\":59500,\"start\":59488},{\"end\":59773,\"start\":59761},{\"end\":60090,\"start\":60072},{\"end\":60466,\"start\":60454},{\"end\":60892,\"start\":60877},{\"end\":61314,\"start\":61302},{\"end\":61666,\"start\":61589},{\"end\":62007,\"start\":61914},{\"end\":62452,\"start\":62403},{\"end\":62667,\"start\":62630},{\"end\":62936,\"start\":62832},{\"end\":63098,\"start\":63059},{\"end\":63290,\"start\":63270},{\"end\":63514,\"start\":63500},{\"end\":63869,\"start\":63817},{\"end\":64158,\"start\":64077},{\"end\":64483,\"start\":64468},{\"end\":64999,\"start\":64987},{\"end\":65660,\"start\":65648},{\"end\":66111,\"start\":66099},{\"end\":66430,\"start\":66415},{\"end\":66728,\"start\":66716},{\"end\":66975,\"start\":66965},{\"end\":67232,\"start\":67220},{\"end\":67598,\"start\":67582},{\"end\":67944,\"start\":67932},{\"end\":68317,\"start\":68305},{\"end\":68658,\"start\":68646},{\"end\":68898,\"start\":68885},{\"end\":69199,\"start\":69187},{\"end\":69580,\"start\":69565},{\"end\":69975,\"start\":69960},{\"end\":70368,\"start\":70356},{\"end\":70698,\"start\":70686},{\"end\":71025,\"start\":71013},{\"end\":71316,\"start\":71301},{\"end\":71604,\"start\":71591},{\"end\":71826,\"start\":71814},{\"end\":72059,\"start\":72047},{\"end\":72369,\"start\":72356},{\"end\":72767,\"start\":72756},{\"end\":73021,\"start\":73011},{\"end\":73288,\"start\":73266},{\"end\":73653,\"start\":73638},{\"end\":74058,\"start\":74046},{\"end\":74450,\"start\":74384},{\"end\":74792,\"start\":74780}]"}}}, "year": 2023, "month": 12, "day": 17}