{"id": 248282792, "updated": "2023-10-01 11:59:33.592", "metadata": {"title": "Deep Reinforcement Learning Based Cooperative Partial Task Offloading and Resource Allocation for IIoT Applications", "authors": "[{\"first\":\"Fan\",\"last\":\"Zhang\",\"middle\":[]},{\"first\":\"Guangjie\",\"last\":\"Han\",\"middle\":[]},{\"first\":\"Li\",\"last\":\"Liu\",\"middle\":[]},{\"first\":\"Miguel\",\"last\":\"Martínez-García\",\"middle\":[]},{\"first\":\"Yan\",\"last\":\"Peng\",\"middle\":[]}]", "venue": "IEEE Transactions on Network Science and Engineering", "journal": "IEEE Transactions on Network Science and Engineering", "publication_date": {"year": 2023, "month": 9, "day": 1}, "abstract": "The Industrial Internet of Things (IIoT) has been regarded as one of the pillars supporting the conceptual paradigm of the Industry 4.0. Compared with traditional cloud computing schemes, edge computing provides an effective solution towards easing congestion in backhaul links and core networks, while meeting real-time, security and reliability demands of compute-intensive and delay-sensitive IIoT applications. Many existing studies only optimize end-edge-cloud cooperative task offloading, and neglect the optimization of the communication and computation resource allocation. In this paper, the cooperative partial task offloading and resource allocation (CPTORA) framework is designed, which jointly considers cooperation among various IIoT devices, local edge computing servers (ECSs), non-local ECSs, and cloud computing servers – for balancing the workload of the ECSs and increasing the resource utilization rate. Then, considering the complex dynamics and unpredictability in IIoT environments, the joint optimization problem is modeled as a constrained Markov decision process. Furthermore, we propose an improved soft actor-critic-based CPTORA (ISAC-CPTORA) algorithm, able to make task offloading and resource allocation decisions for each IIoT device. This algorithm innovatively introduces the idea of distributional reinforcement learning to the soft actor-critic, which can effectively reduce Q-value overestimations or underestimations. Meanwhile, this algorithm employs the prioritized experience replay to enhance its learning efficiency. Extensive laboratory experiments indicate that our CPTORA framework and ISAC-CPTORA algorithm efficiently decrease the total system costs (i.e., latency costs and energy costs), in contrast to various baseline frameworks and algorithms.", "fields_of_study": "[\"Computer Science\"]", "external_ids": {"arxiv": null, "mag": null, "acl": null, "pubmed": null, "pubmedcentral": null, "dblp": "journals/tnse/ZhangHLMP23", "doi": "10.1109/tnse.2022.3167949"}}, "content": {"source": {"pdf_hash": "19f69a767a33a855720dc8677299f8aea5ac4d2e", "pdf_src": "IEEE", "pdf_uri": null, "oa_url_match": false, "oa_info": null}, "grobid": {"id": "3439c8ea3395071847646abbad08875832795943", "type": "plain-text", "url": "s3://ai2-s2-science-parse-plus-prod/parse-results/s2orc_worker/19f69a767a33a855720dc8677299f8aea5ac4d2e.txt", "contents": "\nDeep Reinforcement Learning Based Cooperative Partial Task Offloading and Resource Allocation for IIoT Applications\n\n\nFan Zhang zhangfanhhuc@gmail.com 0000-0002-5563-7688\nLi Li 0000-0003-0730-9230\nMember, IEEEMiguel Mart Inez-Garc Ia m.martinez-garcia@lboro.ac.uk 0000-0003-2984-3231\nYan Peng pengyan@shu.edu.cn 0000-0003-1312-9527\nGuangjie Han hanguangjie@gmail.com \nLi Liu \nMiguel Mart Inez-Garc \n\nCollege of Internet of Things Engineering, Hohai University,\nChangzhou 213022, China Loughborough LE113TU, U.K. Shanghai 200444, China\n\n\nDepartment of Aeronautical and Automotive Engineering, Loughborough University,\n\n\n\nArtificial Intelligence Institute, Shanghai University,\n\n\nDeep Reinforcement Learning Based Cooperative Partial Task Offloading and Resource Allocation for IIoT Applications\nE34CBBE2231A8E72476BDF4831B4DF7D10.1109/TNSE.2022.3167949received 19 November 2021; revised 5 March 2022; accepted 13 April 2022. Date of publication 19 April 2022; date of current version 20 September 2023.Cooperative partial offloadingIIoTimproved soft actor-criticresource allocation\nThe Industrial Internet of Things (IIoT) has been regarded as one of the pillars supporting the conceptual paradigm of the Industry 4.0.Compared with traditional cloud computing schemes, edge computing provides an effective solution towards easing congestion in backhaul links and core networks, while meeting real-time, security and reliability demands of computeintensive and delay-sensitive IIoT applications.Many existing studies only optimize end-edge-cloud cooperative task offloading, and neglect the optimization of the communication and computation resource allocation.In this paper, the cooperative partial task offloading and resource allocation (CPTORA) framework is designed, which jointly considers cooperation among various IIoT devices, local edge computing servers (ECSs), non-local ECSs, and cloud computing servers -for balancing the workload of the ECSs and increasing the resource utilization rate.Then, considering the complex dynamics and unpredictability in IIoT environments, the joint optimization problem is modeled as a constrained Markov decision process.Furthermore, we propose an improved soft actor-critic-based CPTORA (ISAC-CPTORA) algorithm, able to make task offloading and resource allocation decisions for each IIoT device.This algorithm innovatively introduces the idea of distributional reinforcement learning to the soft actor-critic, which can effectively reduce Q-value overestimations or underestimations.Meanwhile, this algorithm employs the prioritized experience replay to enhance its learning efficiency.Extensive laboratory experiments indicate that our CPTORA framework and ISAC-CPTORA algorithm efficiently decrease the total system costs (i.e., latency costs and energy costs), in contrast to various baseline frameworks and algorithms.\n\nI. INTRODUCTION\n\nA CTING as one of the most relevant applications within the Internet of Things (IoT), the industrial IoT (IIoT) solution concept [1]- [6] enables the interconnection among heterogeneous IIoT devices (e.g., smart sensors, machines, robots and vehicles), and introduces artificial intelligence (AI) and intelligent signal processing technologies into the industrial manufacturing processes -with the aim of enhancing manufacturing efficiency and reducing the production costs.Hence, the IIoT has emerged as a promising paradigm for supporting the Industry 4.0 paradigm [7], [8].Nevertheless, as the computational capability and battery capacity are typically constraint, it is challenging for the IIoT devices to achieve actual implementation of computationally expensive and delay-sensitive applications.In traditional cloud computingbased schemes, the IIoT devices need to offload their tasks to remote cloud computing servers (CCSs).The data traffic, which grows dramatically with the number of IIoT devices and tasks, induces network congestion, higher task latency, and lower quality of service (QoS).Fortunately, edge computing [9], [10], which deploys computing resources in proximity to the IIoT devices, provides an effective solution towards mitigating these issues.This technique enables the IIoT devices to offload their tasks into the edge computing servers (ECS) rather than into remote CCSs, which can meet the realtime, security and reliability demands of computationally expensive and delay-sensitive IIoT applications.\n\nIt has been noted that the computational capability of a single ECS is also restricted [11].Furthermore, on account of the heterogeneous characteristics of the IIoT networks, the workload of the ECSs varies from one another [12].Thus, several studies have leveraged the horizontal cooperation between multiple ECSs to balance their workload and make the most of idle computing resources [12], [13].However, these studies have neglected the abundant computational resources of CCSs, which can serve as a complement to the ECSs for mitigating the resource bottleneck of the ECSs [14].Therefore, a number of studies have considered the vertical collaboration between the ECSs and CCSs to increase the resource utilization rate and reduce task latency [14], [15].In addition, partial offloading schemes assume that the computation task can be divided into several parts, each to be executed in parallel on different platforms.This can effectively reduce task execution latency [11], [15].Thus, this study jointly considers the endedge, edge-edge, edge-cloud cooperative partial task offloading (TO) scheme.\n\nHowever, the existing literature has focused on optimizing cooperative TO only, while the optimization of the communication and computation resource allocation (RA) has been neglected [11], [12], [14], [16]- [19].In fact, solutions to TO and RA can complement each other.For instance, the offloading decisions can influence the optimization results of the RA process.Moreover, the resource competition of a multiplicity of IIoT devices can impact the offloading decisions.Hence, cooperative TO and RA should be jointly optimized for reducing the task latency and enhancing the resource utilization rate.\n\nTo date, a number of studies have formulated the joint optimization problem of TO and RA as a single time slot optimization problem, and employed iterative optimization methods (e.g., heuristic algorithms) to find the optimal solutions [15], [20].These studies have the following two disadvantages:\n\n1) Realistic IIoT environments are dynamically complex and unpredictable, which often display time-varying task parameters, IIoT device states and channel gains.Thus, the problem needs to be resolved via the iterative methods when the environment's state changes, which will fail to satisfy the real-time decision-making demands of IIoT applications.\n\n2) The past states and decisions are valuable for making the current decisions.Therefore, these studies can easily fall into local optima because they make greedy decisions in each time slot.Fortunately, AI methods such as deep reinforcement learning (DRL) [21] have paved the way to overcome these two drawbacks.By integrating the powerful perception of deep neural networks (DNN) and sequential decision-making ability of RL, DRL can obtain an optimal policy by interacting with the dynamic and high-dimensional environment, with no need for prior knowledge of the environment dynamics [16].Then, the agent can utilize the trained DRL models to make real-time TO and RA decisions [22], [23].For instance, Huang et al. [24] adopted a Deep Q-Network (DQN) algorithm to make TO and bandwidth RA decisions for each mobile terminals, aiming at minimizing the total offloading cost.In [25], the authors utilized a Double DQN algorithm to obtain the optimal TO and RA strategy for all the user devices, attempting to maximize the computation efficiency.In [26], the authors employed a deep deterministic policy gradients (DDPG) algorithm to make TO and computing RA decisions for multiple user devices towards minimizing the system energy consumption.In [27], the authors exploited an asynchronous actor-critic algorithm to jointly optimize TO and RA, with the goal of minimizing energy consumption and maximizing the size of finished tasks.\n\nThe purpose of this study is to develop a method to jointly optimize cooperative partial TO and RA (i.e., communication and computation resources) for IIoT applications.First, it is designed a cooperative partial TO and RA (CPTORA) framework, which jointly considers the cooperation among IIoT devices, local ECSs, non-local ECSs and CCSs -balancing the workload of the ECSs and enhancing the resource utilization rate.Then, based on the CPTORA, a joint optimization problem is posed.On account of the dynamic and unpredictable characteristics of actual IIoT environments, we utilize DRL methods to tackle the problem.Specifically, we propose an improved soft actor-critic (SAC)-based CPTORA (ISAC-CPTORA) algorithm to learn the optimal policy.This algorithm innovatively introduces the idea of distributional RL [28] to the SAC [29], which can effectively reduce Q-value overestimations or underestimations of the traditional SAC algorithm.Moreover, this algorithm exploits the prioritized experience replay (PER) [30] for enhancing its learning efficiency.The main contributions of this paper are:\n\n1) Cooperative partial TO and RA are jointly optimized, which is a NP-hard and long-term non-linear programming (LT-NLP) problem.The optimization goal is to minimize the long-term total system costs, while simultaneously satisfying the task processing delay and energy consumption constraints.2) Considering the dynamics and unpredictability of realistic IIoT environments, the optimization task is modeled as a constrained Markov decision process (CMDP), aiming at maximizing the long-term cumulative discounted reward (i.e., the return).3) Since the CMDP exhibits high-dimensional and continuous state and action spaces, and multimodal reward, we propose the ISAC-CPTORA algorithm to make the optimal decisions.This algorithm can upgrade the estimation precision of the Q-value via modeling the distribution function of the soft state-action returns.Moreover, this algorithm employs the PER to improve its learning efficiency.In the following, Section II reviews related literature.Section III describes the system model of the CPTORA framework, while Section IV formulates the joint cooperative partial TO and RA problem.Then, in Section V, the ISAC-CPTORA algorithm is described.In Section VI the experiment results are presented.The conclusions are drawn in Section VII.\n\n\nII. RELATED WORK\n\n\nA. Complete Offloading Versus Partial Offloading\n\nComplete offloading schemes assume that the task at hand is indivisible and that the offloading decisions are integer variables.This simplifies the task execution.In [31], the authors assumed that the tasks for each vehicle are inseparable, and can be processed locally or offloaded to the roadside ECS.In [12], the tasks were also assumed to be indivisible and that they can be processed locally -or offloaded to the local ECS or other adjacent ECSs.Similarly, Guo et al. [14] assumed that the task of each mobile device could not be divided, and each device could process its task locally, or offload it to the local ECS or remote CCSs.\n\nPartial offloading schemes assume that the computation task can be divided into several parts, each to be executed in parallel on different platforms (e.g., local devices, ECSs and CCSs).This can effectively reduce task latency, making the method more applicable in a wider range of scenarios.In [15], the offloading decisions incorporated the TO proportion from the local device to the local ECS, and the ratio of task offloaded from the local ECS to the CCSs.Li et al. [11] further considered the collaboration among ECSs.Thus, their offloading strategy encompassed the percentage of task offloaded from the local device to the local ECS, from the local ECS to other cooperative ECSs, and from the local ECS to the CCSs.In [20], [32], the task of each user equipment could be divided into multiple subtasks, and it was further considered the dependencies among the various subtasks.\n\n\nB. Cooperative Versus Non-Cooperative\n\nNon-cooperative schemes neglect the rich computing resources of the CCSs and the cooperation between ECSs, which induce workload imbalances between the ECSs and result in low resource utilization rate.In [32], the authors assumed that each task could only be processed locally or offloaded to a local ECS.In [33], each IoT device could discard its task, process it locally, or offload it to the local ECS.In [34], the IoT device could execute some tasks locally, offload some tasks to its local fog node -and store the remaining tasks into its task queue for future processing.\n\nDue to the restricted computational resources of any individual ECS and the heterogeneity of the networks, the collaboration between ECSs can balance the workload of the ECSs and increase the resource utilization rate.Moreover, considering the powerful computing capability of CCSs, the cooperation between ECSs and CCSs plays an essential role in lowering the task execution delay.With that purpose in mind, Chen et al. [13] designed a collaborative edge computing framework, wherein each task was partially processed by the mobile device, the local ECS and the collaborative ECSs.Then, Kai et al. [15] proposed a end-edge-cloud collaborative TO and RA scheme, leveraging the abundant computing resources of CCSs.In [11], the authors jointly considered the cooperation among the local ECS, adjacent ECSs and CCSs, with the aim of enhancing the resource utilization rate in heterogeneous edge networks.\n\n\nC. Centralized Versus Distributed\n\nCentralized schemes often utilize a centralized controller to periodically collect the system state information and make task offloading and resource allocation decisions.In [16], [24], the authors proposed a DQN-based algorithm to make discrete decisions for all the devices.In [25], the authors further adopted a Double DQN algorithm to mitigate the Q-value overestimations of the DQN.He et al. [18] proposed a Double Dueling DDPG algorithm to determine TO proportion for each mobile user, which could reduce Q-value overestimations of the DDPG and accelerate training speed.In [19], the authors employed a SAC algorithm to learn the optimal TO strategy for each ECS, which could improve exploration and stability.Centralized schemes have the advantage of control multiple devices and ECSs for meeting the global resource constraints.However, the computation complexity of centralized schemes grows dramatically with the number of devices and ECSs.Additionally, centralized schemes incur more communication overhead as the data flows should be transmitted between the devices and centralized controller.\n\nTo decrease the computation complexity and communication overhead, a number of studies have paid particular attention to distributed schemes.Tang et al. [34] proposed a policy gradient-based decentralized offloading scheme in which each IoT device could independently make the offloading decisions based on its local observed environment state.In [35], the authors proposed a game theory-based task offloading algorithm, wherein each mobile device was deemed as a rational game player to autonomously make the optimal offloading decisions.Cao et al. [36] employed a multiagent DDPG algorithm in which each smart device was considered as an agent to learn its optimal task offloading and channel selection strategy.However, distributed schemes often fail to realize the global resource constraints.Moreover, the convergence of distributed schemes also become poorer as the number of devices and ECSs grows.\n\n\nD. Single Optimization Versus Joint Optimization\n\nSo far, several studies have concentrated on optimizing cooperative TO only, without considering the communication and computation RA.In [11], the authors proposed a distributed DDPG-based algorithm to make partial TO decisions for each edge device.In [12], the authors utilized an asynchronous advantage actor-critic algorithm to select an appropriate ECS for each user equipment.In [14], the authors employed the game theory to make discrete TO decisions for each mobile device.However, these studies can induce higher task delays and reduced resource utilization rate.\n\nThe cooperative TO and RA should be jointly optimized to improve offloading performance.Huang et al. [24] studied the problem of jointly optimizing TO and bandwidth RA for multi-user edge networks.In [26], the authors analyzed the joint optimization problem of TO and computation RA for 5G beyond networks.In [27], the authors jointly optimize TO and RA for digital twin networks.\n\nTo satisfy the global communication and computational resource constraints, we exploit a centralized DRL method to make the optimal decisions.However, there is a current paucity of existing research investigating both the Q-value overestimation and underestimation issues of DRL methods for continuous action spaces, thus inducing a suboptimal TO strategy.Moreover, existing studies often adopt a uniform experience replay (UER) method to tackle the non-convergence of DRL methods, irrespective of the importance of each experience sample.This can lower learning efficiency.Therefore, we propose an ISAC-CPTORA algorithm to tackle these two issues.\n\n\nIII. SYSTEM MODEL\n\nIn this section, the proposed CPTORA framework is described.The CPTORA is composed of a network model, a communication model, a computational model and an energy model.The mathematical notations used throughout this paper are listed in Table I.\n\n\nA. Network Model\n\nFig. 1 diagrammatically displays the proposed CPTORA framework for IIoT applications.This framework is composed of three distinct layers: IIoT device layer, ECS layer, and Cloud layer [2], [37].\n\n1) IIoT Device Layer: This layer incorporates multiple types of IIoT devices (e.g., smart sensors, instruments, vehicles, machines and robots).These devices periodically collect environmental data, and generate computationally intensive and delay-sensitive tasks.Each device can connect to its local BS via wireless networks.Furthermore, each device is equipped with a battery that can be charged in a wired or wireless manner.\n\n2) ECS Layer: This layer consists of M BSs and a software defined network (SDN) controller.The set of BSs is denoted by M ¼ f1; 2; . . .; Mg.Each BS m 2 M is equipped with an ECS, also expressed as m, to offer edge computing resources to the IIoT devices.Let f m (in cycle/s) denote the computational capability of ECS m.Each BS connects to the SDN controller via optical fiber links.The SDN controller, denoted by s, enables the BSs to connect to the remote cloud layer via core backbone networks.Moreover, the SDN controller can implement centralized management over all the ECSs and the IIoT devices (i.e., make TO and RA decisions).\n\n3) Cloud Layer: This layer encompasses multiple CCSs with large computing resources.Therefore, this layer supports the more computationally expensive applications.We will denote by f c (in cycle/s) the computational capability of CCSs c.\n\nThe whole timeline is divided into T time slots of equal length.Each time slot is indexed by t.The quasi-static model [38] is here employed, in which the system state parameters remain invariable during one time slot.\n\n\nB. Task Offloading Model\n\nAt the beginning of t, each IIoT device u in each BS m randomly generates a task, denoted by r t u;m ¼ fd t u;m ; c t u;m ; ' t u;m g, where d t u;m (in MB) represents the input data size of task r t u;m , c t u;m indicates the number of CPU cycles needed for completing the task r t u;m , and ' t u;m (in s) signifies the maximum permissible latency for completing task r t u;m .Let U t m denote the set of IIoT devices generating tasks in BS m during t.The number of IIoT devices generating tasks in BS m during t is denoted by N t m .In this paper, we adopt a cooperative partial TO scheme [11].If the IIoT device has sufficient computational resources, it processes the whole task locally.Otherwise, it processes a part of the task locally based on its computational capability, and offloads the remainder to its local ECS.After receiving the offloaded task, the local ECS also processes a part of the task according to its own computational capability, and offloads the remainder to a non-local ECS and CCSs.\n\n\nC. Communication Model\n\nIn this work, all the BSs share the same frequency band.The total bandwidth of each BS is denoted by B w (in MHz).B w is separated into several orthogonal subchannels to avert intra-cell interference [38].Moreover, it is also supposed that the BSs have the same communication radius and that the coverage areas of various BSs are virtually non-overlapping, thus avoiding inter-cell interference [13], [16].We define the bandwidth RA decision of IIoT device u 2 U t m at t as b t u;m 2 ½0; B w .If IIoT device u executes the whole task locally, there\ns 2 ;(1)\nwhere p t;tran u;m (in W) represents the transmission power of IIoT device u, g t u;m is the channel gain and s 2 (in W) is the variance of the modeled additive white Gaussian noise.Then, the uplink data transmission speed from IIoT device u to BS m at t is expressed as\n# t;tran u;m ¼ b t u;m log 2 ð1 þ t t;tran u;m Þ:(2)\nNext, let the constant # m;s (in MB/s) be the data transmission speed between SDN controller s and each BS m, and let the constant # s;c (in MB/s) be the data transmission speed between SDN controller s and CCSs c.Moreover, # m;s > # s;c must be satisfied.\n\n\nD. Computational Model 1) Local Computational Model:\n\nWe define the computational capability of IIoT device u 2 U t m as f l u;m (in cycle/s).When the task r t u;m is processed locally on IIoT device u, the execution latency of this task can be calculated by\nL t;loc u;m ¼ c t u;m ð1 À o t u;m Þ f l u;m :\n(3)\n\n2) Local Edge Computing Model: If the computing capability of IIoT device u is limited, the IIoT device u can offload a part of the task at hand to its local ECS m.Thus, the uplink transmission latency of task r t u;m is\nL t;tran u;m ¼ d t u;m o t u;m # t;tran u;m :(4)\nThe computational resources allocated for processing this task by the local ECS m are defined by f t u;m 2 ½0; f m .The computing latency of task r t u;m on local ECS m can be expressed by\nL t;comp u;m ¼ c t u;m o t u;m ð1 À o t u;m;n À o t u;m;c Þ f t u;m :(5)\n3) Cooperative Edge Computing Model: When extensive tasks are offloaded to the local ECS, its limited computational resources may produce bottlenecks.To take full advantage of idle resources of other non-local ECSs, and realize load balance, the local ECS m can offload a portion of the task to a non-local ECS n.The transmission latency of task r t u;m from local ECS m to non-local ECS n is given by\n\nThen, the computing delay on CCSs c is\nL t;comp u;m;c ¼ c t u;m o t u;m o t u;m;c f c :(9)\nAs the size of task computation outputs is usually quite small [13], [14], the downloading latency of outputs can be neglected.Therefore, the total latency for completing task r t u;m is given by\nL t u;m ¼ maxfL t;loc u;m ; L t;tran u;m þ L t;comp u;m ; L t;tran u;m þ L t;tran u;m;n þ L t;comp u;m;n ; L t;tran u;m þ L t;tran u;m;c þ L t;comp u;m;c g:(10)\n\nE. Energy Model\n\nThe energy consumption of IIoT device u for processing task r t u;m locally is given by\nE t;loc u;m ¼ p t;comp u;m c t u;m ð1 À o t u;m Þ;(11)\nwhere p t;comp u;m (in J/cycle) represents the total energy consumed by IIoT device u per cycle [35].Then, the energy consumed by IIoT device u to offload the remaining task to its local ECS m is given by\nE t;\nThus, the total energy consumption of IIoT device u is\nE t u;m ¼ E t;loc u;m þ E t;tran u;m :(13)\nMoreover, the wired or wireless charging process is modeled via energy packets arriving sequentially [33], [34].\n\n\nIV. PROBLEM FORMULATION\n\nThis section describes the joint cooperative partial TO and RA problem.Considering the dynamic and unpredictable properties of actual IIoT environments (e.g., time-varying task parameters, IIoT device states and channel gains), the joint optimization problem is modeled as a CMDP, with the aim of maximizing the cumulative discounted rewards in the long term (i.e., the return).\n\n\nA. Joint Optimization of Cooperative Partial Task Offloading and Resource Allocation\n\nThe cost of IIoT device u at t is defined to be the weighted sum of the total latency and energy consumption for accomplishing its task.Further, we define the total system costs at t as the total cost incurred by all the IIoT devices.Hence, the problem of minimizing the long-term total system costs is posed accordingly: ProblemP\nmin X T t¼1 X M m¼1 X N t m u¼1 ðv 1 L t u;m þ v 2 E t u;m Þ;(15)X N t m u¼1 b t u;m ¼ B w ;(19)f t u;m 2 f0g; 1 À o t u;m;n À o t u;m;c ¼ 0; ð0; f m ; 1 À o t u;m;n À o t u;m;c > 0; ((20)f t u;m;n 2 f0g; o t u;m;n ¼ 0; ð0; f n ; o t u;m;n > 0; ((21)X N t m u¼1 f t u;m þ X n2fMnfmgg X N t n v¼1 f t v;n;m ¼ f m ; 8v 2 U t n ;(22)L t u;m 2 ½0; ' t u;m ;(23)B t u;m 2 ½0; B max u;m ;(24)E t u;m 2 ½0; B t u;m þ E t;char u;m ;(25)\nwhere w 1 2 ð0; 1Þ and w 2 2 ð0; 1Þ are weights satisfying is within the computational capability of the ECS.Moreover, (24) limits the total latency for completing task r t u;m , avoiding it to go beyond the maximum permissible latency.Constraint (25) delimits the range of values of the remaining battery level of IIoT device u at t. Finally, constraint (26) implies that the total energy consumed by IIoT device u at t is within its available energy.As all the decision variables of problem P are continuous and tightly coupled, problem P is a NP-hard LT-NLP problem.\nw 1 þ w 2 ¼ 1.\n\nB. The CMDP\n\nAccording to the outlined considerations, problem P is formulated as a CMDP maximizing the return.Fig. 2 presents the general architecture of the CMDP, wherein the agent can realize its target through continually interacting with the environment.The SDN controller is deemed as the agent that makes TO and RA decisions.The CMDP is defined as a five-tuple < S; A; R; P r ; C > .The detailed definitions are indicated as follows:\n\n1) The state space is denoted by S. 3) When the agent takes an action a t under state s t , it will obtain a reward R t ðs t ; a t Þ, which is given by\nR t ðs t ; a t Þ ¼ À X M m¼1 X N t m u¼1 ðv 1 L t u;m þ v 2 E t u;m Þ:(27)\nTherefore, the reward is inversely proportional to the total system costs.4) P r is the state transition probability.Thus, P r ðs tþ1 js t ; a t Þ refers to the probability of the event in which the environment moves to the next state s tþ1 after executing an action a t under state s t , meeting the following condition X s tþ1 2S P r ðs tþ1 js t ; a t Þ ¼ 1:\n\n5) C are the constraints.The action a t selected by the agent at t should satisfy the constraints (16-26).\n\n\nV. DEEP REINFORCEMENT LEARNING FOR COOPERATIVE PARTIAL TASK OFFLOADING AND RESOURCE ALLOCATION\n\n\nA. Soft Actor-Critic\n\nAs opposed to other machine learning approaches, DRL can find an optimal policy by interacting with the high-dimensional and complex environment, with no need for prior knowledge of the environment dynamics.(e.g., the probability distribution of P r ) [16].Specifically, DRL leverages DNN models to approximate the policy and value functions of the RL approach.\n\nAccording to the numerical discretization level of the action space, DRL algorithms can be divided into two categories: iÞ discrete action space -for instance, DQN [21], Double DQN [39], and Dueling DQN [40]; iiÞ continuous action space -e.g., DDPG [41], twin delayed DDPG (TD3) [42], and SAC.Compared with existing DRL algorithms for continuous action spaces, the SAC has the following three advantages: 1) Unlike the deterministic policy gradient (DPG), that can only output an action under each state, the actor network of the SAC adopts the stochastic policy gradient (SPG) to yield the probability distribution of continuous actions in each state -facilitating the exploration of the action space and avoiding potential local optima.\n\n2) The SAC employs the off-policy learning to reuse historical samples, thus enhancing the sample efficiency.\n\n3) The SAC utilizes the maximum entropy reinforcement learning (MERL) [43] to obtain an optimal strategy.The MERL renders the probability distribution of continuous actions yielded by the actor network more uniformly, and more existing optimal policies can be learned.It is applicable to the CMDP with multimodal rewards, and further improves exploration and stability.As the CMDP presented in this paper displays high-dimensional and continuous state and action spaces, and multimodal rewards (i.e., latency and energy consumption), we employ the SAC algorithm to make TO and RA decisions.The SAC adopts the MERL to obtain an optimal policy p Ã that maximizes both its expected return and expected entropy, which is defined as\np Ã ¼ arg max p X 1 t¼1 E½R t ðs t ; a t Þ þ aHðpðÁjs t ÞÞ;(29)\nwhere E½Á denotes the expectation of a random variable, HðpðÁjs t ÞÞ is the entropy of policy p in state s t , and a is the weight of the entropy.Thus, the soft Q-value function for policy p, denoted by Q p soft ðs t ; a t Þ, is defined as the sum of the expected return and expected policy entropy when performing an action a t under state s t , and following policy p.According to the soft Bellman equation [29], Q p soft ðs t ; a t Þ is expressed by the relation\nQ p soft ðs t ; a t Þ ¼ E½G p soft ðs t ; a t Þ ¼ R t ðs t ; a t Þ þ E½g½V p soft ðs tþ1 Þ ¼ R t ðs t ; a t Þ þ E h X 1 k¼tþ1 g kÀt ½R k ðs k ; a k Þ þ aHðpðÁjs k ÞÞ i ; ¼ R t ðs t ; a t Þ þ E h X 1 k¼tþ1 g kÀt ½R k ðs k ; a k Þ À alogpða k js k Þ i ; ¼ R t ðs t ; a t Þ þ E½g½Q p soft ðs tþ1 ; a tþ1 Þ À alogpða tþ1 js tþ1 Þ;(30)\nwhere G p soft ðs t ; a t Þ refers to the soft state-action return of policy p under the state-action pair ðs t ; a t Þ, g 2 ½0; 1 indicates a discount factor, and V p soft ðs tþ1 Þ is the soft state value function of policy p under state s tþ1 .\n\n\nB. Improved SAC-Based Cooperative Partial Offloading and Resource Allocation Algorithm\n\nIn spite of its advantages, the conventional SAC only models the expectation of soft state-action returns, and neglects its complete distribution information -which inevitably induces the overestimations or underestimations of the Q-values.Since the estimated Q-values (i.e., Q-value function) is utilized to guide the update of the policy function, the inaccurate Q-value estimations can directly contribute to suboptimal policies.Moreover, the traditional SAC adopts a UER method to reuse historical experience samples, and ignores the importance of each sample -which can lower learning efficiency.\n\nTo mitigate these two issues, we propose the ISAC-CPTORA algorithm, which first combines the SAC, distributional RL and PER.Distributional RL models the distribution function of the soft state-action return, rather than its expected value -for enhancing the Q-value estimation precision of SAC.The PER measures the importance of each experience sample according to its temporal-difference (TD) error [30], and samples the significant samples more frequently to enhance the learning efficiency.As shown in Fig. 3, the proposed ISAC-CPTORA algorithm encompasses three components: the evaluation networks, the target networks, and the replay pool 1) Training Stage: Algorithm 1 describes the training stage of the proposed ISAC-CPTORA algorithm.At time step t, the SDN controller gathers the environment's state s t and inputs s t into p m .Then, it outputs the probability distribution p m ðÁjs t Þ of all the possible continuous actions that satisfy the constraints (16)(17)(18)(19)(20)(21)(22)(23)(24)(25)(26).Accordingly, an action a t is randomly chosen based on p m ðÁjs t Þ and executed.After that, the SDN controller obtains a reward R t ðs t ; a t Þ and the environment moves to the next state s tþ1 .Next, the SDN controller stores the experience tuple e t ¼ ðs t ; a t ; R t ðs t ; a t Þ; s tþ1 Þ into the replay pool.\n\nZ experience tuples are sampled from the replay pool via the PER, and used to update the parameters of D c and p m .The priority of e i is defined by\nP i ¼ jd i j þ ;(31)\nwhere indicates a small positive constant (guaranteeing that P i 6 ¼ 0), and d i is the TD error of e i , which is defined as the difference between the target soft Q-value and the estimated soft Q-value of e i .Based on (30), the target soft Q-value of e i can be given by\ny i tar ¼ R i ðs i ; a i Þ; i ¼ NS; R i ðs i ; a i Þ þ gE½ e Q e c ðs iþ1 ; a iþ1 Þ Àaloge p e m ða iþ1 js iþ1 Þ; i < NS; 8 > < > :(32)\nwhere NS represents the number of time steps per episode.Action a iþ1 is randomly selected according to e p e m ðÁjs iþ1 Þ, and e Q e c ðs iþ1 ; a iþ1 Þ is calculated by E½ e D e c ðs iþ1 ; a iþ1 Þ.After that,\nd i is obtained from d i ¼ R i ðs i ; a i Þ À Q c ðs i ; a i Þ; i¼ NS; R i ðs i ; a i Þ þ gE½ e Q e c ðs iþ1 ; a iþ1 Þ Àaloge p e m ða iþ1 js iþ1 Þ À Q c ðs i ; a i Þ; i < NS; 8 > < > :(33)\nwhere the action a i is randomly chosen by p m ðÁjs i Þ, and Q c ðs i ; a i Þ represents the estimated soft Q-value of e i and is obtained from E½D c ðs i ; a i Þ.\n\nHence, according to (31)(32)(33), the priority of each experience tuple in the replay pool is computed.Then, the sum-tree data structure [30] is adopted to sample Z experience tuples from the replay pool.The advantage of utilizing the sum-tree is that it can efficiently sample significant tuples without the need of sorting all the tuples by their priorities.The detailed sampling process is described in our previous work [44].\n\nThen, in the soft policy evaluation phase, we define the loss function for training the parameters c of D c :\nLossðcÞ ¼ E½KL½ e D e c\nðs t ; a t ÞjjD c ðs t ; a t Þ; (34) where KL½AjjB denotes the Kullback-Leibler (KL) divergence and is used as a metric to assess the difference between two probability distributions.According to the distributional Bellman equation [28], e D e c ðs t ; a t Þ is derived as\ne D e c ðs t ; a t Þ ¼ D R t ðs t ; a t Þ þ g½ e D e cðs\ntþ1 ; a tþ1 Þ À aloge p e m ða tþ1 js tþ1 Þ: (35) where ¼ D indicates that two random variables are governed by the same probability distribution.To minimize LossðcÞ, the mini-batch gradient descent method is employed.However, the gradients r c LossðcÞ are susceptible to exploding or vanishing when the variance of D c ðs t ; a t Þ approaches zero or 1.To tackle this problem, we keep the soft state-action return e G e c ðs t ; a t Þ of e D e c ðs t ; a t Þ close to the expected value Next, during the soft policy improvement stage, the parameters m of p m can be trained by maximizing the soft state value function of policy p m :\nQ c ðs t ; a t Þ of D c ðs t ; a t Þ, namely e G e c ðs t ; a t Þ 2 ½Q c ðs t ; a t Þ À b; Q c ðs t ; a t Þ þ b,JðmÞ ¼ E½Q c ðs t ; a t Þ À alogp m ða t js t Þ;(36)\nwhere Q c ðs t ; a t Þ is calculated by E½D c ðs t ; a t Þ.To decrease the gradient estimation variance, we utilize the reparameterization trick [29], in order to compute the gradients r m JðmÞ.Specifically, we first randomly take a sample t from a known distribution (e.g., a standard normal distribution).Then, we calculate a t (i.e., reparameterize the policy p m ) from\na t ¼ & t þ t s t ;(37)\nwhere & t denotes the mean value of policy p m , s t represents the standard deviation of policy p m , and indicates the Hadamard product.Then, the gradients r m JðmÞ can be directly obtained via sampling a known distribution.Next, an adaptive gradient-based method is adopted to adjust the entropy weight a. Specifically, a must be large enough to encourage exploration when the optimal action is not determined, and it should gradually decrease as the optimal action is determined.Thus, the weight a can be updated by minimizing the following objective function:\nJðaÞ ¼ E½Àalogp m ða t js t Þ À aH; (38)\nwhere H is a predefined minimum entropy threshold.Finally, in order to enhance the learning stability, the parameters e c and e m of the target networks are updated via slowly tracking the parameters of the evaluation networks [41], which are given by\ne c uc þ ð1 À uÞ e c;(39)e m um þ ð1 À uÞe m;(40)\nwhere u represents the smoothing coefficient of the target networks, u 2 ð0; 1Þ and u ( 1.In addition, the update frequency of p m is often lower than that of D c , leading to high-quality policy updates [42].\n\n2) The Execution Stage: After the execution of Algorithm 1, we can obtain the optimal parameters m Ã of the evaluation actor network.Then, the agent leverages the trained evaluation actor network p m Ã to execute the proposed ISAC-CPTORA algorithm (Algorithm 2).\n\n\nC. Computational Complexity Analysis\n\nThe computational complexity of the proposed ISAC-CPTORA algorithm largely relies on the number and structure of DNNs [45].At the training stage, Algorithm 1 incorporates the parameter updating of four DNNs, so the computation complexity of Algorithm 1 is\n2 Â X JÀ1 j¼0 n act j n act jþ1 þ 2 Â X KÀ1 k¼0 n cri k n cri kþ1 ¼ O X JÀ1 j¼0 n act j n act jþ1 þ X KÀ1 k¼0 n cri k n cri kþ1 !(41)\nwhere J and K denote the number of fully connected layers of the actor network and critic network respectively, n act j and n cri k represent the number of neurons at the jth actor layer and the kth critic layer, j ¼ 0 and k ¼ 0 are the input layers.At the execution stage, Algorithm 2 only needs to execute the trained actor network, so the computation complexity of Algorithm 2 is Oð P JÀ1 j¼0 n act j n act jþ1 Þ.\n\nAlgorithm 2: Execution Stage of ISAC-CPTORA algorithm.\n\n1: Initialize an evaluation actor network p m Ã with parameters m Ã 2: for t 2 f1; 2; . . .; T g do 3: Gather the state s t 4:\n\nRandomly choose an action a t according to p m Ã ðÁjs t Þ and perform it 5:\n\nObtain a reward R t ðs t ; a t Þ and a next state s tþ1 6:\nt t þ\n\nVI. EXPERIMENT RESULTS\n\nThe field experiments that were carried out to assess the performance of the CPTORA framework and ISAC-CPTORA algorithm are discussed in this section.First, we present the experiment parameters.Then, we display the training convergence of the ISAC-CPTORA algorithm and the baseline algorithms.After that, we compare the CPTORA framework with the following baseline frameworks, which are the three most common cooperative frameworks in existing research:\n\n1) End-edge cooperative (EEC) framework [32]: This framework only considers the cooperation between the IIoT devices and local ECSs.Specifically, each IIoT device can process only a part of the task locally and offload the remaining to its local ECS.2) End-edge-edge cooperative (EEEC) framework [13]:\n\nThis framework considers the collaboration among the IIoT devices, local ECSs and non-local ECSs.Specifically, the task of each IIoT device can be divided into three parts to be executed in parallel on the local device, local ECS and non-local ECS. 3) End-edge-cloud cooperative (EECC) framework [15], [20]: This framework considers the collaboration among the IIoT devices, local ECSs and CCSs.Specifically, the task of each IIoT device can be divided into three parts to be executed in parallel on the local device, local ECS and CCSs.Finally, we compare the ISAC-CPTORA algorithm with the following baseline algorithms, which are the state-of-the-art DRL methods for continuous action spaces:\n\n1) DDPG algorithm [17]: The actor network of this algorithm employs the DPG method to map the current state to a specific action.\n\n\nA. Experiment Parameters\n\nWe utilized a high-performance desktop as a SDN controller to make centralized TO and RA decisions.This desktop is equipped with Intel Core(TM) i7-8700 3.20 GHz CPU, 32 GB RAM and NVIDIA GTX 1080.It is also installed with Python, Pytorch and Numpy for training and executing all the algorithms.EdgeForce G1000 is a widely employed IIoT edge computing platform (Fig. 4), so each EdgeForce G1000 acted as an ECS for offering edge computing resources to the IIoT devices.The different types as IIoT devices were mimicked via single board computers (e.g., Raspberry Pi B plus, 2B, 3B and 3B plus).Further, it was assumed that w 1 ¼ w 2 ¼ 0:5.All the actual experiment parameters are provided in Table II according to the user's manual.\n\nThe hyperparameters of the training stage for the ISAC-CPTORA algorithm and the three baseline algorithms are presented in Table III.All the algorithms were implemented by Python, Pytorch and Numpy.We employed the multi-layer perceptron models to represent the actor and critic networks.The number of hidden layers was set to 4. Each hidden layer had 256 neurons [29] and incorporated Gaussian Error Linear Units (GELU) activation functions [46].The minimum entropy threshold was set to the dimension of the action space [47].In the DDPG algorithms, the exploration noise added to the evaluation actor network obeyed a normal distribution [42].In addition, the Adam optimizer [48] was utilized to step-wise optimize the parameters c, m and a.\n\n\nB. Convergence Performance\n\nAt the training stage, the DNNs are trained many times via increasing the number of episodes.Meanwhile, the average reward is utilized as the judgement basis of convergence, which can reduce the chance and increase the credibility of the experimental results.The average reward over NE episodes is defined as\nP NE ne¼1 P NS t¼1 R t ne NEÁNS\n, where R t ne denotes the reward at time step t of episode ne.\n\n\nC. Performance Assessment\n\nAfter training the ISAC-CPTORA and the baseline algorithms, all the algorithms were tested in a experiment consisting of 120 time steps.Moreover, three performance metrics were utilized to assess the CPTORA framework and ISAC-CPTORA algorithm: the average total system costs (ATSC), the average task execution latency (ATEL) and the average energy consumption (AEC).\n\nFirst, we discuss the performance of the CPTORA framework.Specifically, the ISAC-CPTORA is leveraged to make TO and RA decisions within the EEC, EEEC and EECC frameworks.Fig. 6 illustrates the impact of the number of BSs on the ATSC, the ATEL and the AEC for the four different frameworks (f m ¼ 30 Gcycle/s, and N t m ¼ 5).By inspecting the figure, a dramatical increasing trend is observed as the number of BSs increases, within the ATSC, ATEL and AEC of all the four frameworks.The reason is that the number of IIoT devices generating the tasks grows with the number of BSs, so it will take more time and energy to finish these tasks.Furthermore, the ATSC, ATEL and AEC of the CPTORA framework display the slowest increase, and always outperform those of other three baseline frameworks.This is a consequence of the CPTORA dividing the computational tasks, each to be executed in parallel on IIoT devices, local ECSs, non-local ECSs and CCSs -thus effectively balancing the workload of ECSs and enhance the resource utilization rate.Then, the EEEC framework is superior to the EECC.This is because the task tends to be offloaded to the nearby ECSs for reducing the system costs when the computational resources of the ECSs are sufficient.In addition, the EECC framework performs better than the EEC.The reason is that the EECC framework takes full advantage of the abundant computational resources of CCSs.Fig. 7 demonstrates the influence of the computational capability for each ECS on the ATSC, ATEL and AEC for the four different frameworks (M ¼ 2, and N t m ¼ 5).It is clearly seen in the figure that there is a steady drop in the ATSC, ATEL and AEC of the the CPTORA, EEC, EEEC and EECC frameworks as the computational capability for each ECS grows.This is because more tasks are offloaded to the ECSs for decreasing the system costs as the computational capability of each ECS grows.Moreover, the ATSC, ATEL and AEC of the CPTORA display always lower curves than those of other three baseline frameworks.Additionally, the EEEC outperforms the EECC and the latter displays better performance than the EEC.The reasons are the same as those discussed for Fig. 6.\n\nFig. 8 shows the effect of the number of IIoT devices on the ATSC, ATEL and AEC on the four different frameworks (M ¼ 2, and f m ¼ 30 Gcycle/s).What stands out in this figure is a sharp increase in the ATSC, ATEL and AEC of all the four frameworks when the number of IIoT devices rises.The reason is also that more IIoT devices produce more tasks to be processed.Furthermore, the ATSC, ATEL and AEC of the CPTORA framework exhibit the slowest increase, and are always better than those of other three baseline frameworks.On  the other EECC framework performs better than the EEEC framework, indicating that the task tends to be offloaded to the CCSs for decreasing the system costs when the computing resources of the ECSs are insufficient.In addition, the EEEC outperforms the EEC.The reason is that the EEEC considers the collaboration among multiple ECSs to make the best of the idle resources of other ECSs.Thus, these results justify the effective performance of the CPTORA framework as compared to the three baseline frameworks, especially when the IIoT network has a large number of BSs and IIoT devices.\n\nNext, the performance of the ISAC-CPTORA algorithm is assessed.Specifically, we adopt the ISAC-CPTORA, SAC, Double Dueling DDPG and DDPG algorithms to make TO and RA decisions for the CPTORA framework.DDPG algorithms.This compared with the SAC algorithm, the ISAC-CPTORA algorithm employs the distributional RL to reduce the Q-value overestimations or underestimations, and utilizes the PER to learn the optimal strategy more efficiently from the higher-dimensional action space.Besides, the ISAC-CPTORA algorithm adopts the DPG and MERL to facilitate exploration as compared to the Double Dueling DDPG and DDPG algorithms.and DDPG reasons are also the same as those in Fig. 9. What emerges from these results is that our ISAC-CPTORA algorithm exhibits superior performance within the tested scenarios, with respect to the baseline algorithms, especially when the state and action spaces of the IIoT environment are complex and high-dimensional (i.e., the IIoT environment with a mass of BSs and IIoT devices).\n\n\nVII. CONCLUSION\n\nThis study has investigated the joint optimization problem of cooperative partial task offloading and resource allocation for IIoT applications.First, a new framework, which we term CPTORA, was designed to balance the workload of the ECSs and to enhance the resource utilization rate.Then, to tackle the posed joint optimization problem, the ISAC-CPTORA algorithm was developed.The proposed algorithm makes task offloading and resource allocation decisions for each IIoT device, and can efficiently reduce the Q-value overestimations or underestimations yielded by the traditional SAC algorithm, while enhancing the learning efficiency.Experiment results have indicated that the CPTORA framework and the ISAC-CPTORA algorithm effectively decrease the total system costs, as compared to the other baseline frameworks and algorithms.\n\nNevertheless, the ISAC-CPTORA algorithm is a centralized single agent DRL method, thus it is not the most appropriate choice for networks with massive IIoT devices and BSs.Further studies are required to implement the proposed algorithm within multi-agent scenarios, where each IIoT device is regarded as an agent that makes its own decisions autonomously.\n\nFig. 1 .\n1\nFig. 1.Diagram depicting the inter-connectivity setup in the CPTORA framework.\n\n\n\n\nThe first constraint(16) denotes the possible range of values for the offloading decision variables of IIoT device u.Then,(17) ensures that the sum of the TO proportion from local ECS m to a non-local ECS n and CCSs c does not exceed 1, while constraint(18) guarantees that each local ECS m can only choose one non-local ECS to execute collaborative edge computing.Constraint (19) limits the value range of the bandwidth RA decision variable of IIoT device u, and constraint(20) ensures that the total amount of bandwidth resourcesallocated to all the IIoT devices in BS m -does not surpass the total bandwidth of BS m.Then, (21) limits the range values of the computational RA decision variable of local ECS m, while(22) constraints the range of values of the computational RA decision variable of non-local ECS n.(23) ensures that the total amount of computing resources, assigned to all the tasks of each ECS (i.e., local tasks and tasks offloaded by other ECSs),\n\n\nFig. 2 .\n2\nFig. 2. General architecture of the CMDP.\n\n\n\n\n. The evaluation networks consist of an evaluation actor networkdenoted by p m with parameters m, and an evaluation critic network -denoted by D c with parameters c.The target networks incorporate a target actor network -denoted by e p e m with parameters e m, and a target critic network -denoted by e D e c with parameters e c. p m represents the estimated policy function and it is used to choose an action.D c indicates the estimated distribution function of soft state-action returns, and is used to guide the update of p m .e p e m denotes the target policy function.e D e c refers to the target distribution function of soft state-action returns.The parameters c of D c can be trained by minimizing the loss function, to enable the estimated distribution function to approximate the target distribution function.The parameters m of p m can be updated iteratively through maximizing the soft state value function of policy p m .The replay pool is responsible for storing the experience tuple e t at each time slot t, and Z tuples are randomly sampled from the replay pool via the PER every replay period -to train the parameters of D c and p m .In addition, both the policy functions and distribution functions are modeled as the normal distribution.The training stage and execution stage of the ISAC-CPTORA algorithm are described next.\n\n\n\n\nand b represents the clipping boundary.\n\n\nFig. 3 .\n3\nFig. 3. Architecture diagram of the ISAC-CPTORA algorithm.\n\n\n2 )\n2\nDouble Dueling DDPG algorithm [18]: This algorithm first combines the Double DQN, Dueling DQN and DDPG.3) SAC algorithm [19]: This algorithm adopts the SPG and MERL to facilitate exploration and improve stability.\n\n\nFig. 5\n5\ndisplays the convergence performance of the training stage for the ISAC-CPTORA and the\n\n\nFig. 4 . 5 .\n45\nFig. 4. EdgeForce G1000.\n\n\nFig. 5 .\n5\nFig. 5. Convergence performance of the training for the ISAC-CPTORA and three baseline algorithms in terms of average reward over different episodes (M ¼ 2; f m ¼ 30 Gcycle/s, and N t m ¼ 5).\n\n\nFig. 9\n9\ndisplays the influence of the number of BSs on the ATSC, ATEL and AEC for the four different algorithms (f m ¼ 30 Gcycle/s, and N t m ¼ 5).The figure shows that there has been a rise of the ATSC, ATEL and AEC when the number of BSs increases.Furthermore, the ATSC, ATEL and AEC in the ISAC-CPTORA algorithm present the slowest increase, and are always lower than those of the SAC, the Double Dueling DDPG and the\n\n\nFig. 7 .\n7\nFig. 7. Influence of the computational capability for each ECS on the (a) ATSC, (b) ATEL and (c) AEC for the four different frameworks (M ¼ 2, and N t m ¼ 5).\n\n\nFig. 8 .\n8\nFig. 8. Effect of the number of IIoT devices on the (a) ATSC, (b) ATEL and (c) AEC for the four different frameworks (M ¼ 2, and f m ¼ 30 Gcycle/s).\n\n\nFig. 6 .\n6\nFig. 6.Impact of the number of BSs on the (a) ATSC, (b) ATEL and (c) AEC for the four different frameworks (f m ¼ 30 Gcycle/s, and N t m ¼ 5).\n\n\nFig. 10\n10\ndisplays the effect of the computational capability for each ECS on the ATSC, ATEL and AEC for the four different algorithms (M ¼ 2, and N t m ¼ 5).It can be seen from the figure that there has been a gradual fall of the ATSC, ATEL and AEC as the computational capability for each ECS grows.Moreover, the ATSC, ATEL and AEC in the ISAC-CPTORA algorithm always outperform those of the SAC, Double Dueling DDPG and DDPG algorithms.The reasons also are the same as those in Fig.9.Fig.11demonstrates the impact of the number of IIoT devices on the ATSC, ATEL and AEC with four different algorithms (M ¼ 2, and f m ¼ 30 Gcycle/s).As can be seen from the figure, the ATSC, ATEL and AEC grow sharply when the number of IIoT devices increases.In addition, the ATSC, ATEL and AEC of the ISAC-CPTORA algorithm display the slowest rise, and are always better than those of the SAC, Double Dueling DDPG\n\n\nFig. 10 .\n10\nFig. 10.Effect of the computational capability for each ECS on the (a) ATSC, (b) ATEL and (c) AEC for the four different algorithms (M ¼ 2, and N t m ¼ 5).\n\n\nFig. 9 .\n9\nFig. 9. Influence of the number of BSs on the (a) ATSC, (b) ATEL and (c) AEC for the four different algorithms (f m ¼ 30 Gcycle/s, and N t m ¼ 5).\n\n\nFig. 11 .\n11\nFig. 11.Impact of the number of IIoT devices on the (a) ATSC, (b) ATEL and (c) AEC for the four different algorithms (M ¼ 2, and f m ¼ 30 Gcycle/s).\n\n\n\n\nindicates the ratio of task offloaded from local ECS m to a nonlocal ECS n 2 fMnfmgg, and o t u;m;c 2 ½0; 1 represents the TO percentage from local ECS m to CCSs c. Herein, it is assumed that each local ECS m can select only one non-local ECS to perform collaborative edge computing.\n\nFurther, let O t u;m ¼ fo t u;m ; o t u;m;n ; o t u;m;c g be the TO decisions of IIoT device u 2 U t m at t, where o t u;m 2 ½0; 1 denotes the TO proportion from IIoT device u to local ECS m, o t u;m;n 2 ½0; 1\n\n\nTABLE I NOTATIONS\nI\nis no need for allocating bandwidth resources to it, namely b t u;m ¼ 0. t t;tran u;m will denote the uplink signal-to-noise ratio (SNR) from IIoT device u to BS m at t, which is given by t t;tran u;m ¼ p t;tran u;m g t u;m\n\n\n\n\nWhen the computing resources of all the ECSs are insufficient, the local ECS m needs to offload the remaining task to the CCSs c for fully leveraging the vast computing resources available in the CCSs.The transmission delay of task r t u;m from the local ECS m to CCSs c is represented by\nL t;tran u;m;n ¼2 d t u;m o t u;m o t u;m;n # m;s:(6)Let f t u;m;n 2 ½0; f n be the computing resources allocatedfor executing this task by a non-local ECS n. Then, thecomputational latency of task r t u;m on n can be calculated bythe relationL t;comp u;m;n ¼c t u;m o t u;m o t u;m;n u;m;n f t:(7)4) Cloud Computing Model: L t;tran u;m;c ¼ d t u;m o t u;m o t u;m;c # m;sþd t u;m o t u;m o t u;m;c # s;c:\n\n\n\nConsequently, the remaining battery level of IIoT device u at t þ 1 is\nB tþ1 u;m ¼ minfmaxfB t u;m þ E t;char u;m À E t u;m ; 0g; B max u;m g: (14)\nThe amount of energy obtained by IIoT device u at t is represented by E t;char u;m (in J), while the maximum battery capacity of IIoT device u by B max u;m (in Wh).\n\n\n\n\nThe total bandwidth B w of each BS.d) The computational capability f m of each ECS m. e) The computational capability f c of CCSs c. f) The data transmission speed # m;s between each BS m and the SDN controller s. g) The data transmission speed # s;c between SDN controller s and CCSs c. 2) A represents the action space.According to the received state s t , the SDN controller chooses an action a t 2 A for making TO and RA decisions.The action a t\nharvested energy E t;char u;m capacity B max u;m .and the maximum batteryc) incorporates the following elements:a) The TO decisions O t u;m ¼ fo t u;m ; o t u;m;n ; o t u;m;c g foreach IIoT device u.b) The bandwidth RA decision b t u;m of each IIoTdevice u.c) The local computing RA decision f t u;m of each IIoTdevice u.d) The non-local computing RA decision f t u;m;n ofeach IIoT device u.At t, the SDN control-ler gathers the environment's state s t 2 S, whichencompasses the following parameters:a) The task parameters r t u;m ¼ fd t u;m ; c t u;m ; ' t u;m g ofeach IIoT device u.b) The device parameters of each IIoT device u,including the computational capability f l u;m , the transmission power p t;tran u;m , the uplink SNR t t;tran u;m , the amount of energy consumed per cycle p t;comp u;m , the remaining battery level B t u;m , the amount of\n\n\n\n1 7: end for Algorithm 1: Training Stage of ISAC-CPTORA algorithm.Initialize an evaluation actor network p m with parameters m and an evaluation critic network D c with parameters c 2: Initialize a target actor network ep e m with parameters e Initialize the number of time steps NS per episode, number of episodes NE, replay pool size RS, replay period RP , number of samples Z per minibatch, discount factor g, entropy weight a, minimum entropy threshold H, smoothing coefficient u of target networks, and update period UP of p m , a and target networks 4: Initialize the learning rates c , m , a 5: for ne 2 f1; 2; . . .Output the optimal parameters m Ã of the evaluation actor network\nmm anda target critic network e D e cwith parameters e cc3: ; NEg do6:for t 2 f1; 2; . . . ; NSg do7:Gather the state s t8:Randomly select an action a t based on p m ðÁjs t Þ andexecute it9:Obtain a reward R t ðs t ; a t Þ and a next state s tþ110:Store the experience tuple ðs t ; a t ; R t ðs t ; a t Þ; s tþ1 Þ into thereplay pool11:if t < RS 2 then//Accumulate some experience tuples12:tt þ 113:go to step 614:else15:if t%RP ¼¼ 0 then//Sample Z tuples every replay period16:Compute the priority of each tuple in the replay poolbased on (31), (32) and (33)17:Sample Z tuples from the replay pool via thesum-tree data structure18:Update the evaluation critic network D c viaminimizing LossðcÞ: cc À c r c LossðcÞ19:if t%UP ¼¼ 0 then/*The update frequency of p m , a and target networksis lower than that of D c */20:Update the evaluation actor network p m bymaximizing JðmÞ:mm þ m r m JðmÞ21:Update the entropy weight a via minimizing JðaÞ:aa À a r a JðaÞ22:Update the target networks:e cuc þ ð1 À uÞ e ce mum þ ð1 À uÞe m23:end if24:end if25:tt þ 126:go to step 627:end if28:end for29:nene þ 130:go to step 531: end for32:\n1:\n\n\nTABLE III HYPERPARAMETERS\nIII\nOF THE ISAC-CPTORA AND BASELINE ALGORITHMS\n\nAuthorized licensed use limited to the terms of the applicable license agreement with IEEE. Restrictions apply.\nIEEE TRANSACTIONS ON NETWORK SCIENCE AND ENGINEERING, VOL. 10, NO. 5, SEPTEMBER/OCTOBER 2023Authorized licensed use limited to the terms of the applicable license agreement with IEEE. Restrictions apply.\nThe work was supported in part by the National Key Research and Development Program of China under Grant 2017YFE0125300, in part by the National Natural Science Foundation of China-Guangdong Joint Fund under Grant U1801264, and in part by Jiangsu Provincial Key Research and Development Program under Grant BE2019648.Recommended for acceptance by Dr. Varun G Menon.Authorized licensed use limited to the terms of the applicable license agreement with IEEE.Restrictions apply.Authorized licensed use limited to the terms of the applicable license agreement with IEEE.Restrictions apply.\nMobile-edge-computing-based hierarchical machine learning tasks distribution for IIoT. B Yang, X Cao, X Li, Q Zhang, L Qian, IEEE Internet Things J. 73Mar. 2020\n\nEdge computing in industrial Internet of Things: Architecture, advances and challenges. T Qiu, J Chi, X Zhou, Z Ning, M Atiquzzaman, D O Wu, IEEE Commun. Surv. Tut. 224Oct.-Dec. 2020\n\nAdaptive DE algorithm for novel energy control framework based on edge computing in IIoT applications. G Han, Z Xu, H Zhu, L Liu, M Guizani, IEEE Trans. Ind. Informat. 177Jul. 2021\n\nLDC: A lightweight dada consensus algorithm based on the blockchain for the industrial Internet of Things for smart city applications. W Zhang, Z Wu, G Han, Y Feng, L Shu, Future Gener. Comput. Syst.-Int. J. Escience. 108Jul. 2020\n\nFault-tolerant event region detection on trajectory pattern extraction for industrial wireless sensor networks. L Liu, G Han, Y He, J Jiang, IEEE Trans. Ind. Informat. 163Mar. 2020\n\nAn intelligent signal processing data denoising method for control systems protection in the industrial Internet of Things. G Han, J Tu, L Liu, M Mart Inez-Garc Ia, C Choi, IEEE Trans. Ind. Informat. 184Apr. 2022\n\nSoftware-defined industrial Internet of Things in the context of industry 4.0. J Wan, IEEE Sensors J. 1620Oct. 2016\n\nA review of industrial wireless networks in the context of industry 4.0. X Li, D Li, J Wan, A V Vasilakos, C.-F Lai, S Wang, Wireless Netw. 231Jan. 2017\n\nMobile edge computing: A survey. N Abbas, Y Zhang, A Taherkordi, T Skeie, IEEE Internet Things J. 51Feb. 2018\n\nToward edge intelligence: Multiaccess edge computing for 5G and Internet of Things. Y Liu, M Peng, G Shou, Y Chen, S Chen, IEEE Internet Things J. 78Aug. 2020\n\nDistributed edge computing offloading algorithm based on deep reinforcement learning. Y Li, F Qi, Z Wang, X Yu, S Shao, IEEE Access. 82020\n\nA3C-DO: A regional resource scheduling framework based on deep reinforcement learning in edge scenario. J Zou, T Hao, C Yu, H Jin, IEEE Trans. Comput. 702Feb. 2021\n\niRAF: A deep reinforcement learning approach for collaborative mobile edge computing IoT networks. J Chen, S Chen, Q Wang, B Cao, G Feng, J Hu, IEEE Internet Things J. 64Aug. 2019\n\nCollaborative computation offloading for multiaccess edge computing over fiber-wireless networks. H Guo, J Liu, IEEE Trans. Veh. Technol. 675May 2018\n\nCollaborative cloud-edge-end task offloading in mobile-edge computing networks with limited communication capability. C Kai, H Zhou, Y Yi, W Huang, IEEE Trans. Cogn. Commun. Netw. 72Jun. 2021\n\nResource allocation with edge computing in IoT networks via machine learning. X Liu, J Yu, J Wang, Y Gao, IEEE Internet Things J. 74Apr. 2020\n\nIntelligent delay-aware partial computing task offloading for multi-user industrial Internet of Things through edge computing. X Deng, J Yin, P Guan, N N Xiong, L Zhang, S Mumtaz, 10.1109/JIOT.2021.3123406IEEE Internet Things J. to be published\n\nQoE-based cooperative task offloading with deep reinforcement learning in mobile edge networks. X He, H Lu, H Huang, Y Mao, K Wang, S Guo, IEEE Wireless Commun. 273Jun. 2020\n\nCooperative computation offloading for multi-access edge computing in 6G mobile networks via soft actor critic. C Sun, 10.1109/TNSE.2021.3076795IEEE Trans. Netw. Sci. Eng. to be published\n\nA cooperative partial computation offloading scheme for mobile edge computing enabled Internet of Things. Z Ning, P Dong, X Kong, F Xia, IEEE Internet Things J. 63Jun. 2019\n\nHuman-level control through deep reinforcement learning. V Mnih, Nature. 5187540Feb. 2015\n\nResource management at the network edge: A deep reinforcement learning approach. D Zeng, L Gu, S Pan, J Cai, S Guo, IEEE Netw. 333May/Jun. 2019\n\nIntelligent VNF orchestration and flow scheduling via model-assisted deep reinforcement learning. L Gu, D Zeng, W Li, S Guo, A Y Zomaya, H Jin, IEEE J. Sel. Areas Commun. 382Feb. 2020\n\nDeep reinforcement learning-based joint task offloading and bandwidth allocation for multiuser mobile edge computing. L Huang, X Feng, C Zhang, L Qian, Y Wu, Digit. Commun. Netw. 51Feb. 2019\n\nOn joint offloading and resource allocation: A. double deep Q-network approach. F Khoramnejad, M Erol-Kantarci, IEEE Trans. Cogn. Commun. Netw. 74Dec. 2021\n\nEdge intelligence for energy-efficient computation offloading and resource allocation in 5G beyond. Y Dai, K Zhang, S Maharjan, Y Zhang, IEEE Trans. Veh. Technol. 6910Oct. 2020\n\nDeep reinforcement learning for stochastic computation offloading in digital twin networks. Y Dai, K Zhang, S Maharjan, Y Zhang, IEEE Trans. Ind. Informat. 177Jul. 2021\n\nA distributional perspective on reinforcement learning. M G Bellemare, W Dabney, R Munos, Proc. 34th Int. Conf. Mach. Learn. 34th Int. Conf. Mach. Learn2017\n\nSoft actor-critic: Offpolicy maximum entropy deep reinforcement learning with a stochastic actor. T Haarnoja, A Zhou, P Abbeel, S Levine, the Proc. 35th Int. Conf. 2018\n\nPrioritized experience replay. T Schaul, J Quan, I Antonoglou, D Silver, Proc. 4th Int. Conf. Learn. Representations. 4th Int. Conf. Learn. Representations2016\n\nA game-based computation offloading method in vehicular multiaccess edge computing networks. Y Wang, IEEE Internet Things J. 76Jun. 2020\n\nOffloading and resource allocation with general task graph in mobile edge computing: A deep reinforcement learning approach. J Yan, S Bi, Y.-J A Zhang, IEEE Trans. Wireless Commun. 198Aug. 2020\n\nDynamic edge computation offloading for Internet of Things with energy harvesting: A learning method. Z Wei, J Su, X Lu, IEEE Internet Things J. 63Jun. 2019\n\nDecentralized computation offloading in IoT fog computing system with energy harvesting: A Dec-POMDP approach. Q Tang, R Xie, F R Yu, T Huang, Y Liu, IEEE Internet Things J. 76Jun. 2020\n\nEnergy-latency tradeoff for computation offloading in UAV-assisted multiaccess edge computing system. K Zhang, X Gui, D Ren, D Li, IEEE Internet Things J. 88Apr. 2021\n\nMultiagent deep reinforcement learning for joint multichannel access and task offloading of mobile-edge computing in industry 4.0. Z Cao, P Zhou, R Li, S Huang, D Wu, IEEE Internet Things J. 77Jul. 2020\n\nAdaptive transmission optimization in SDN-based industrial Internet of Things with edge computing. X Li, D Li, J Wan, C Liu, M Imran, IEEE Internet Things J. 53Jun. 2018\n\nJoint optimization of caching, computing, and radio resources for fog-enabled IoT using natural actorcritic deep reinforcement learning. Y Wei, F R Yu, M Song, Z Han, IEEE Internet Things J. 62Apr. 2019\n\nDeep reinforcement learning with double Q-learning. H Van Hasselt, A Guez, D Silver, Proc. 30th AAAI Conf. 30th AAAI Conf2016\n\nDueling network architectures for deep reinforcement learning. Z Wang, Proc. 33rd Int. Conf. Mach. Learn. 33rd Int. Conf. Mach. Learn2016\n\nContinuous control with deep reinforcement learning. T P Lillicrap, Proc. 4th Int. Conf. Learn. Representations. 4th Int. Conf. Learn. Representations2016\n\nAddressing function approximation error in actor-critic methods. S Fujimoto, H Van Hoof, D Meger, Proc. 35th Int. Conf. 35th Int. Conf2018\n\nReinforcement learning with deep energy-based policies. T Haarnoja, H Tang, P Abbeel, S Levine, Proc. 34th Int. Conf. Mach. Learn. 34th Int. Conf. Mach. Learn2017\n\nJoint optimization of cooperative edge caching and radio resource allocation in 5G-enabled massive IoT networks. F Zhang, G Han, L Liu, M Mart Inez-Garc Ia, Y Peng, IEEE Internet Things J. 818Sep. 2021\n\nDeep deterministic policy gradient (DDPG)-Based energy harvesting wireless communications. C Qiu, Y Hu, Y Chen, B Zeng, IEEE Internet Things J. 65Oct. 2019\n\nA baseline for detecting misclassified and out-ofdistribution examples in neural networks. H Dan, G Kevin, Proc. 5th Int. Conf. Learn. Representations. 5th Int. Conf. Learn. Representations2017\n\nLatent space policies for hierarchical reinforcement learning. T Haarnoja, Proc. 35th Int. Conf. 35th Int. Conf2018\n\nAdam: A method for stochastic optimization. P Diederik Kingma, J Ba, Proc. 3rd Int. Conf. Learn. Representations. 3rd Int. Conf. Learn. Representations2015\n\nHe has authored or coauthored more than 20 papers in related international conferences and journals, including IEEE TMC, IEEE TII, IEEE IOTJ, and IEEE Communications Magazine. His research interests include wireless sensor networks, industrial Internet of Things, and machine learning. Miguel Mart ınez-Garc ıa (Member, IEEE) received the B.Sc. degree in mathematics and the M.Sc. degree in advanced mathematics and mathematical engineering from the Polytechnic University of Catalonia, Barcelona. South Gwangju, Telecommunication SystemsHong Korea, Telecommunication SystemsHong Kong, Telecommunication Systems; Kong, Telecommunication SystemsIeee Systems, Telecommunication SystemsIeee/Cca Jas, Telecommunication SystemsIeee Access ;, Telecommunication SystemsIeee Communications, Telecommunication SystemsIeee Wireless Communications, Telecommunication SystemsIeee Transac-Tions On Industrial Informatics, Telecommunication SystemsComputer Networks, Telecommunication SystemsHe has been awarded 2020 IEEE Systems Journal Annual Best Paper Award and the 2017-2019 IEEE Access Outstanding Associate Editor Award. Li Liu received the Ph.D. degree in Internet of Things technology from the Hohai University, Nanjing. Changzhou, China; Shenyang, China; Changzhou, China; Suita, Japan; Dalian, China; China; Hong Kong; Changzhou, China; Spain; Lincoln, U.K.; Loughborough, U.K. Since; Shenyang; Shanghai, China; Shanghai, China2004. February 2008. October 2010 to October 2011. January 2017 to February 2017. July 2017 to July 2020. 2019. October 2017 to February 2018. 2013. 2014. 2018. 20172019 from Hohai University ; Guangjie Han (Senior Member, IEEE) received the Ph.D. degree from Northeastern University ; Internet of Things Engineering, Hohai University ; Department of Computer Science, Chonnam National University ; Visiting Research Scholar with Osaka University ; University of Technology ; U.K. Institution of Engineering and Technology (FIET) ; City University of Hong Kong ; Hohai University ; University of Lincoln and Advanced Virtual Reality Research Centre, Loughborough University ; Shanghai UniversityHis research interests include human-machine integration, machine learning, artificial intelligence, intelligent signal processing, and complex systems -with particular focus in the analysis of non-linear signals representing phenomena of interest between humans and machines. Yan Peng received the Ph.D. degrees in pattern recognition and intelligent systems from the Shenyang Institute of Automation, Chinese Academy of Sciences. China in 2009. She is currently a Professor with. and the Dean of Research Institute of USV Engineering. Her research interests include modeling and control of unmanned surface vehicles, field robotics, and locomotion systems\n", "annotations": {"author": "[{\"end\":171,\"start\":119},{\"end\":197,\"start\":172},{\"end\":284,\"start\":198},{\"end\":332,\"start\":285},{\"end\":368,\"start\":333},{\"end\":376,\"start\":369},{\"end\":399,\"start\":377},{\"end\":536,\"start\":400},{\"end\":619,\"start\":537},{\"end\":678,\"start\":620}]", "publisher": null, "author_last_name": "[{\"end\":128,\"start\":123},{\"end\":177,\"start\":175},{\"end\":234,\"start\":217},{\"end\":293,\"start\":289},{\"end\":345,\"start\":342},{\"end\":375,\"start\":372},{\"end\":398,\"start\":384}]", "author_first_name": "[{\"end\":122,\"start\":119},{\"end\":174,\"start\":172},{\"end\":216,\"start\":210},{\"end\":288,\"start\":285},{\"end\":341,\"start\":333},{\"end\":371,\"start\":369},{\"end\":383,\"start\":377}]", "author_affiliation": "[{\"end\":535,\"start\":401},{\"end\":618,\"start\":538},{\"end\":677,\"start\":621}]", "title": "[{\"end\":116,\"start\":1},{\"end\":794,\"start\":679}]", "venue": null, "abstract": "[{\"end\":2869,\"start\":1082}]", "bib_ref": "[{\"attributes\":{\"ref_id\":\"b0\"},\"end\":3020,\"start\":3017},{\"attributes\":{\"ref_id\":\"b5\"},\"end\":3025,\"start\":3022},{\"attributes\":{\"ref_id\":\"b6\"},\"end\":3458,\"start\":3455},{\"attributes\":{\"ref_id\":\"b7\"},\"end\":3463,\"start\":3460},{\"attributes\":{\"ref_id\":\"b8\"},\"end\":4023,\"start\":4020},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":4029,\"start\":4025},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":4515,\"start\":4511},{\"attributes\":{\"ref_id\":\"b11\"},\"end\":4652,\"start\":4648},{\"attributes\":{\"ref_id\":\"b11\"},\"end\":4815,\"start\":4811},{\"attributes\":{\"ref_id\":\"b12\"},\"end\":4821,\"start\":4817},{\"attributes\":{\"ref_id\":\"b13\"},\"end\":5005,\"start\":5001},{\"attributes\":{\"ref_id\":\"b13\"},\"end\":5176,\"start\":5172},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":5182,\"start\":5178},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":5401,\"start\":5397},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":5407,\"start\":5403},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":5716,\"start\":5712},{\"attributes\":{\"ref_id\":\"b11\"},\"end\":5722,\"start\":5718},{\"attributes\":{\"ref_id\":\"b13\"},\"end\":5728,\"start\":5724},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":5734,\"start\":5730},{\"attributes\":{\"ref_id\":\"b18\"},\"end\":5740,\"start\":5736},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":6373,\"start\":6369},{\"attributes\":{\"ref_id\":\"b19\"},\"end\":6379,\"start\":6375},{\"attributes\":{\"ref_id\":\"b20\"},\"end\":7046,\"start\":7042},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":7377,\"start\":7373},{\"attributes\":{\"ref_id\":\"b21\"},\"end\":7471,\"start\":7467},{\"attributes\":{\"ref_id\":\"b22\"},\"end\":7477,\"start\":7473},{\"attributes\":{\"ref_id\":\"b23\"},\"end\":7509,\"start\":7505},{\"attributes\":{\"ref_id\":\"b24\"},\"end\":7670,\"start\":7666},{\"attributes\":{\"ref_id\":\"b25\"},\"end\":7840,\"start\":7836},{\"attributes\":{\"ref_id\":\"b26\"},\"end\":8038,\"start\":8034},{\"attributes\":{\"ref_id\":\"b27\"},\"end\":9040,\"start\":9036},{\"attributes\":{\"ref_id\":\"b28\"},\"end\":9056,\"start\":9052},{\"attributes\":{\"ref_id\":\"b29\"},\"end\":9242,\"start\":9238},{\"attributes\":{\"ref_id\":\"b30\"},\"end\":10841,\"start\":10837},{\"attributes\":{\"ref_id\":\"b11\"},\"end\":10981,\"start\":10977},{\"attributes\":{\"ref_id\":\"b13\"},\"end\":11148,\"start\":11144},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":11611,\"start\":11607},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":11786,\"start\":11782},{\"attributes\":{\"ref_id\":\"b19\"},\"end\":12040,\"start\":12036},{\"attributes\":{\"ref_id\":\"b31\"},\"end\":12046,\"start\":12042},{\"attributes\":{\"ref_id\":\"b31\"},\"end\":12445,\"start\":12441},{\"attributes\":{\"ref_id\":\"b32\"},\"end\":12549,\"start\":12545},{\"attributes\":{\"ref_id\":\"b33\"},\"end\":12649,\"start\":12645},{\"attributes\":{\"ref_id\":\"b12\"},\"end\":13241,\"start\":13237},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":13419,\"start\":13415},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":13537,\"start\":13533},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":13934,\"start\":13930},{\"attributes\":{\"ref_id\":\"b23\"},\"end\":13940,\"start\":13936},{\"attributes\":{\"ref_id\":\"b24\"},\"end\":14039,\"start\":14035},{\"attributes\":{\"ref_id\":\"b17\"},\"end\":14157,\"start\":14153},{\"attributes\":{\"ref_id\":\"b18\"},\"end\":14340,\"start\":14336},{\"attributes\":{\"ref_id\":\"b33\"},\"end\":15020,\"start\":15016},{\"attributes\":{\"ref_id\":\"b34\"},\"end\":15214,\"start\":15210},{\"attributes\":{\"ref_id\":\"b35\"},\"end\":15417,\"start\":15413},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":15962,\"start\":15958},{\"attributes\":{\"ref_id\":\"b11\"},\"end\":16077,\"start\":16073},{\"attributes\":{\"ref_id\":\"b13\"},\"end\":16209,\"start\":16205},{\"attributes\":{\"ref_id\":\"b23\"},\"end\":16499,\"start\":16495},{\"attributes\":{\"ref_id\":\"b25\"},\"end\":16598,\"start\":16594},{\"attributes\":{\"ref_id\":\"b26\"},\"end\":16707,\"start\":16703},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":17898,\"start\":17895},{\"attributes\":{\"ref_id\":\"b36\"},\"end\":17904,\"start\":17900},{\"attributes\":{\"ref_id\":\"b37\"},\"end\":19335,\"start\":19331},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":20056,\"start\":20052},{\"attributes\":{\"ref_id\":\"b37\"},\"end\":20703,\"start\":20699},{\"attributes\":{\"ref_id\":\"b12\"},\"end\":20898,\"start\":20894},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":20904,\"start\":20900},{\"attributes\":{\"ref_id\":\"b12\"},\"end\":23045,\"start\":23041},{\"attributes\":{\"ref_id\":\"b13\"},\"end\":23051,\"start\":23047},{\"attributes\":{\"ref_id\":\"b34\"},\"end\":23596,\"start\":23592},{\"attributes\":{\"ref_id\":\"b32\"},\"end\":23909,\"start\":23905},{\"attributes\":{\"ref_id\":\"b33\"},\"end\":23915,\"start\":23911},{\"attributes\":{\"ref_id\":\"b25\"},\"end\":25530,\"start\":25526},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":27272,\"start\":27268},{\"attributes\":{\"ref_id\":\"b20\"},\"end\":27547,\"start\":27543},{\"attributes\":{\"ref_id\":\"b38\"},\"end\":27564,\"start\":27560},{\"attributes\":{\"ref_id\":\"b39\"},\"end\":27586,\"start\":27582},{\"attributes\":{\"ref_id\":\"b40\"},\"end\":27632,\"start\":27628},{\"attributes\":{\"ref_id\":\"b41\"},\"end\":27662,\"start\":27658},{\"attributes\":{\"ref_id\":\"b42\"},\"end\":28304,\"start\":28300},{\"attributes\":{\"ref_id\":\"b28\"},\"end\":29435,\"start\":29431},{\"attributes\":{\"ref_id\":\"b29\"},\"end\":31163,\"start\":31159},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":31728,\"start\":31724},{\"attributes\":{\"ref_id\":\"b16\"},\"end\":31732,\"start\":31728},{\"attributes\":{\"ref_id\":\"b17\"},\"end\":31736,\"start\":31732},{\"attributes\":{\"ref_id\":\"b18\"},\"end\":31740,\"start\":31736},{\"attributes\":{\"ref_id\":\"b19\"},\"end\":31744,\"start\":31740},{\"attributes\":{\"ref_id\":\"b20\"},\"end\":31748,\"start\":31744},{\"attributes\":{\"ref_id\":\"b21\"},\"end\":31752,\"start\":31748},{\"attributes\":{\"ref_id\":\"b22\"},\"end\":31756,\"start\":31752},{\"attributes\":{\"ref_id\":\"b23\"},\"end\":31760,\"start\":31756},{\"attributes\":{\"ref_id\":\"b24\"},\"end\":31764,\"start\":31760},{\"attributes\":{\"ref_id\":\"b25\"},\"end\":31768,\"start\":31764},{\"attributes\":{\"ref_id\":\"b29\"},\"end\":32483,\"start\":32479},{\"attributes\":{\"ref_id\":\"b30\"},\"end\":33257,\"start\":33253},{\"attributes\":{\"ref_id\":\"b31\"},\"end\":33261,\"start\":33257},{\"attributes\":{\"ref_id\":\"b32\"},\"end\":33265,\"start\":33261},{\"attributes\":{\"ref_id\":\"b29\"},\"end\":33374,\"start\":33370},{\"attributes\":{\"ref_id\":\"b43\"},\"end\":33661,\"start\":33657},{\"attributes\":{\"ref_id\":\"b33\"},\"end\":33834,\"start\":33830},{\"attributes\":{\"ref_id\":\"b27\"},\"end\":34034,\"start\":34030},{\"attributes\":{\"ref_id\":\"b34\"},\"end\":34177,\"start\":34173},{\"attributes\":{\"ref_id\":\"b28\"},\"end\":35077,\"start\":35073},{\"attributes\":{\"ref_id\":\"b40\"},\"end\":36163,\"start\":36159},{\"attributes\":{\"ref_id\":\"b41\"},\"end\":36442,\"start\":36438},{\"attributes\":{\"ref_id\":\"b44\"},\"end\":36870,\"start\":36866},{\"attributes\":{\"ref_id\":\"b31\"},\"end\":38406,\"start\":38402},{\"attributes\":{\"ref_id\":\"b12\"},\"end\":38662,\"start\":38658},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":38965,\"start\":38961},{\"attributes\":{\"ref_id\":\"b19\"},\"end\":38971,\"start\":38967},{\"attributes\":{\"ref_id\":\"b16\"},\"end\":39384,\"start\":39380},{\"attributes\":{\"ref_id\":\"b28\"},\"end\":40620,\"start\":40616},{\"attributes\":{\"ref_id\":\"b45\"},\"end\":40698,\"start\":40694},{\"attributes\":{\"ref_id\":\"b46\"},\"end\":40778,\"start\":40774},{\"attributes\":{\"ref_id\":\"b41\"},\"end\":40896,\"start\":40892},{\"attributes\":{\"ref_id\":\"b47\"},\"end\":40933,\"start\":40929},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":47451,\"start\":47447},{\"attributes\":{\"ref_id\":\"b16\"},\"end\":47553,\"start\":47549},{\"attributes\":{\"ref_id\":\"b17\"},\"end\":47684,\"start\":47680},{\"attributes\":{\"ref_id\":\"b19\"},\"end\":47905,\"start\":47901},{\"attributes\":{\"ref_id\":\"b21\"},\"end\":48148,\"start\":48144},{\"attributes\":{\"ref_id\":\"b22\"},\"end\":48246,\"start\":48242}]", "figure": "[{\"attributes\":{\"id\":\"fig_0\"},\"end\":47423,\"start\":47332},{\"attributes\":{\"id\":\"fig_1\"},\"end\":48394,\"start\":47424},{\"attributes\":{\"id\":\"fig_2\"},\"end\":48449,\"start\":48395},{\"attributes\":{\"id\":\"fig_3\"},\"end\":49797,\"start\":48450},{\"attributes\":{\"id\":\"fig_4\"},\"end\":49841,\"start\":49798},{\"attributes\":{\"id\":\"fig_5\"},\"end\":49913,\"start\":49842},{\"attributes\":{\"id\":\"fig_6\"},\"end\":50135,\"start\":49914},{\"attributes\":{\"id\":\"fig_7\"},\"end\":50233,\"start\":50136},{\"attributes\":{\"id\":\"fig_8\"},\"end\":50276,\"start\":50234},{\"attributes\":{\"id\":\"fig_9\"},\"end\":50481,\"start\":50277},{\"attributes\":{\"id\":\"fig_10\"},\"end\":50905,\"start\":50482},{\"attributes\":{\"id\":\"fig_11\"},\"end\":51077,\"start\":50906},{\"attributes\":{\"id\":\"fig_12\"},\"end\":51239,\"start\":51078},{\"attributes\":{\"id\":\"fig_13\"},\"end\":51395,\"start\":51240},{\"attributes\":{\"id\":\"fig_14\"},\"end\":52299,\"start\":51396},{\"attributes\":{\"id\":\"fig_15\"},\"end\":52470,\"start\":52300},{\"attributes\":{\"id\":\"fig_16\"},\"end\":52630,\"start\":52471},{\"attributes\":{\"id\":\"fig_17\"},\"end\":52794,\"start\":52631},{\"attributes\":{\"id\":\"tab_0\",\"type\":\"table\"},\"end\":53293,\"start\":52795},{\"attributes\":{\"id\":\"tab_1\",\"type\":\"table\"},\"end\":53539,\"start\":53294},{\"attributes\":{\"id\":\"tab_2\",\"type\":\"table\"},\"end\":54237,\"start\":53540},{\"attributes\":{\"id\":\"tab_4\",\"type\":\"table\"},\"end\":54554,\"start\":54238},{\"attributes\":{\"id\":\"tab_6\",\"type\":\"table\"},\"end\":55863,\"start\":54555},{\"attributes\":{\"id\":\"tab_7\",\"type\":\"table\"},\"end\":57685,\"start\":55864},{\"attributes\":{\"id\":\"tab_8\",\"type\":\"table\"},\"end\":57760,\"start\":57686}]", "paragraph": "[{\"end\":4422,\"start\":2888},{\"end\":5526,\"start\":4424},{\"end\":6131,\"start\":5528},{\"end\":6431,\"start\":6133},{\"end\":6783,\"start\":6433},{\"end\":8221,\"start\":6785},{\"end\":9322,\"start\":8223},{\"end\":10599,\"start\":9324},{\"end\":11309,\"start\":10671},{\"end\":12195,\"start\":11311},{\"end\":12814,\"start\":12237},{\"end\":13718,\"start\":12816},{\"end\":14861,\"start\":13756},{\"end\":15768,\"start\":14863},{\"end\":16392,\"start\":15821},{\"end\":16774,\"start\":16394},{\"end\":17424,\"start\":16776},{\"end\":17690,\"start\":17446},{\"end\":17905,\"start\":17711},{\"end\":18334,\"start\":17907},{\"end\":18972,\"start\":18336},{\"end\":19211,\"start\":18974},{\"end\":19430,\"start\":19213},{\"end\":20472,\"start\":19459},{\"end\":21048,\"start\":20499},{\"end\":21328,\"start\":21058},{\"end\":21638,\"start\":21382},{\"end\":21899,\"start\":21695},{\"end\":21950,\"start\":21947},{\"end\":22172,\"start\":21952},{\"end\":22410,\"start\":22222},{\"end\":22885,\"start\":22484},{\"end\":22925,\"start\":22887},{\"end\":23173,\"start\":22978},{\"end\":23440,\"start\":23353},{\"end\":23700,\"start\":23496},{\"end\":23760,\"start\":23706},{\"end\":23916,\"start\":23804},{\"end\":24322,\"start\":23944},{\"end\":24741,\"start\":24411},{\"end\":25740,\"start\":25171},{\"end\":26197,\"start\":25770},{\"end\":26350,\"start\":26199},{\"end\":26786,\"start\":26426},{\"end\":26894,\"start\":26788},{\"end\":27377,\"start\":27016},{\"end\":28117,\"start\":27379},{\"end\":28228,\"start\":28119},{\"end\":28957,\"start\":28230},{\"end\":29487,\"start\":29022},{\"end\":30065,\"start\":29819},{\"end\":30757,\"start\":30156},{\"end\":32085,\"start\":30759},{\"end\":32236,\"start\":32087},{\"end\":32531,\"start\":32258},{\"end\":32877,\"start\":32668},{\"end\":33231,\"start\":33068},{\"end\":33662,\"start\":33233},{\"end\":33773,\"start\":33664},{\"end\":34070,\"start\":33798},{\"end\":34762,\"start\":34128},{\"end\":35301,\"start\":34928},{\"end\":35890,\"start\":35326},{\"end\":36183,\"start\":35932},{\"end\":36443,\"start\":36234},{\"end\":36707,\"start\":36445},{\"end\":37003,\"start\":36748},{\"end\":37554,\"start\":37138},{\"end\":37610,\"start\":37556},{\"end\":37738,\"start\":37612},{\"end\":37815,\"start\":37740},{\"end\":37875,\"start\":37817},{\"end\":38360,\"start\":37907},{\"end\":38663,\"start\":38362},{\"end\":39360,\"start\":38665},{\"end\":39491,\"start\":39362},{\"end\":40251,\"start\":39520},{\"end\":40995,\"start\":40253},{\"end\":41334,\"start\":41026},{\"end\":41430,\"start\":41367},{\"end\":41826,\"start\":41460},{\"end\":43997,\"start\":41828},{\"end\":45110,\"start\":43999},{\"end\":46122,\"start\":45112},{\"end\":46973,\"start\":46142},{\"end\":47331,\"start\":46975},{\"end\":47422,\"start\":47344},{\"end\":48393,\"start\":47427},{\"end\":48448,\"start\":48407},{\"end\":49796,\"start\":48453},{\"end\":49840,\"start\":49801},{\"end\":49912,\"start\":49854},{\"end\":50134,\"start\":49921},{\"end\":50232,\"start\":50146},{\"end\":50275,\"start\":50251},{\"end\":50480,\"start\":50289},{\"end\":50904,\"start\":50492},{\"end\":51076,\"start\":50918},{\"end\":51238,\"start\":51090},{\"end\":51394,\"start\":51252},{\"end\":52298,\"start\":51408},{\"end\":52469,\"start\":52314},{\"end\":52629,\"start\":52483},{\"end\":52793,\"start\":52645},{\"end\":53081,\"start\":52798},{\"end\":53292,\"start\":53083},{\"end\":53538,\"start\":53315},{\"end\":53831,\"start\":53543},{\"end\":54311,\"start\":54241},{\"end\":54553,\"start\":54389},{\"end\":55007,\"start\":54558},{\"end\":56555,\"start\":55867},{\"end\":57684,\"start\":57682},{\"end\":57759,\"start\":57717}]", "formula": "[{\"attributes\":{\"id\":\"formula_0\"},\"end\":21057,\"start\":21049},{\"attributes\":{\"id\":\"formula_1\"},\"end\":21381,\"start\":21329},{\"attributes\":{\"id\":\"formula_2\"},\"end\":21946,\"start\":21900},{\"attributes\":{\"id\":\"formula_3\"},\"end\":22221,\"start\":22173},{\"attributes\":{\"id\":\"formula_4\"},\"end\":22483,\"start\":22411},{\"attributes\":{\"id\":\"formula_6\"},\"end\":22977,\"start\":22926},{\"attributes\":{\"id\":\"formula_7\"},\"end\":23334,\"start\":23174},{\"attributes\":{\"id\":\"formula_8\"},\"end\":23495,\"start\":23441},{\"attributes\":{\"id\":\"formula_9\"},\"end\":23705,\"start\":23701},{\"attributes\":{\"id\":\"formula_11\"},\"end\":23803,\"start\":23761},{\"attributes\":{\"id\":\"formula_12\"},\"end\":24807,\"start\":24742},{\"attributes\":{\"id\":\"formula_13\"},\"end\":24838,\"start\":24807},{\"attributes\":{\"id\":\"formula_14\"},\"end\":24930,\"start\":24838},{\"attributes\":{\"id\":\"formula_15\"},\"end\":24992,\"start\":24930},{\"attributes\":{\"id\":\"formula_16\"},\"end\":25072,\"start\":24992},{\"attributes\":{\"id\":\"formula_17\"},\"end\":25099,\"start\":25072},{\"attributes\":{\"id\":\"formula_18\"},\"end\":25128,\"start\":25099},{\"attributes\":{\"id\":\"formula_19\"},\"end\":25170,\"start\":25128},{\"attributes\":{\"id\":\"formula_21\"},\"end\":25755,\"start\":25741},{\"attributes\":{\"id\":\"formula_22\"},\"end\":26425,\"start\":26351},{\"attributes\":{\"id\":\"formula_24\"},\"end\":29021,\"start\":28958},{\"attributes\":{\"id\":\"formula_25\"},\"end\":29818,\"start\":29488},{\"attributes\":{\"id\":\"formula_26\"},\"end\":32257,\"start\":32237},{\"attributes\":{\"id\":\"formula_27\"},\"end\":32667,\"start\":32532},{\"attributes\":{\"id\":\"formula_28\"},\"end\":33067,\"start\":32878},{\"attributes\":{\"id\":\"formula_29\"},\"end\":33797,\"start\":33774},{\"attributes\":{\"id\":\"formula_30\"},\"end\":34127,\"start\":34071},{\"attributes\":{\"id\":\"formula_31\"},\"end\":34875,\"start\":34763},{\"attributes\":{\"id\":\"formula_32\"},\"end\":34927,\"start\":34875},{\"attributes\":{\"id\":\"formula_33\"},\"end\":35325,\"start\":35302},{\"attributes\":{\"id\":\"formula_34\"},\"end\":35930,\"start\":35891},{\"attributes\":{\"id\":\"formula_35\"},\"end\":35931,\"start\":35930},{\"attributes\":{\"id\":\"formula_36\"},\"end\":36209,\"start\":36184},{\"attributes\":{\"id\":\"formula_37\"},\"end\":36233,\"start\":36209},{\"attributes\":{\"id\":\"formula_38\"},\"end\":37137,\"start\":37004},{\"attributes\":{\"id\":\"formula_39\"},\"end\":37881,\"start\":37876},{\"attributes\":{\"id\":\"formula_40\"},\"end\":41366,\"start\":41335}]", "table_ref": "[{\"attributes\":{\"ref_id\":\"tab_1\"},\"end\":17689,\"start\":17688},{\"attributes\":{\"ref_id\":\"tab_1\"},\"end\":40219,\"start\":40217},{\"attributes\":{\"ref_id\":\"tab_8\"},\"end\":40385,\"start\":40382}]", "section_header": "[{\"end\":2886,\"start\":2871},{\"end\":10618,\"start\":10602},{\"end\":10669,\"start\":10621},{\"end\":12235,\"start\":12198},{\"end\":13754,\"start\":13721},{\"end\":15819,\"start\":15771},{\"end\":17444,\"start\":17427},{\"end\":17709,\"start\":17693},{\"end\":19457,\"start\":19433},{\"end\":20497,\"start\":20475},{\"end\":21693,\"start\":21641},{\"end\":23351,\"start\":23336},{\"end\":23942,\"start\":23919},{\"end\":24409,\"start\":24325},{\"end\":25768,\"start\":25757},{\"end\":26991,\"start\":26897},{\"end\":27014,\"start\":26994},{\"end\":30154,\"start\":30068},{\"end\":36746,\"start\":36710},{\"end\":37905,\"start\":37883},{\"end\":39518,\"start\":39494},{\"end\":41024,\"start\":40998},{\"end\":41458,\"start\":41433},{\"end\":46140,\"start\":46125},{\"end\":47341,\"start\":47333},{\"end\":48404,\"start\":48396},{\"end\":49851,\"start\":49843},{\"end\":49918,\"start\":49915},{\"end\":50143,\"start\":50137},{\"end\":50247,\"start\":50235},{\"end\":50286,\"start\":50278},{\"end\":50489,\"start\":50483},{\"end\":50915,\"start\":50907},{\"end\":51087,\"start\":51079},{\"end\":51249,\"start\":51241},{\"end\":51404,\"start\":51397},{\"end\":52310,\"start\":52301},{\"end\":52480,\"start\":52472},{\"end\":52641,\"start\":52632},{\"end\":53312,\"start\":53295},{\"end\":57712,\"start\":57687}]", "table": "[{\"end\":54237,\"start\":53832},{\"end\":54388,\"start\":54312},{\"end\":55863,\"start\":55008},{\"end\":57681,\"start\":56556}]", "figure_caption": "[{\"end\":47423,\"start\":47343},{\"end\":48394,\"start\":47426},{\"end\":48449,\"start\":48406},{\"end\":49797,\"start\":48452},{\"end\":49841,\"start\":49800},{\"end\":49913,\"start\":49853},{\"end\":50135,\"start\":49920},{\"end\":50233,\"start\":50145},{\"end\":50276,\"start\":50250},{\"end\":50481,\"start\":50288},{\"end\":50905,\"start\":50491},{\"end\":51077,\"start\":50917},{\"end\":51239,\"start\":51089},{\"end\":51395,\"start\":51251},{\"end\":52299,\"start\":51407},{\"end\":52470,\"start\":52313},{\"end\":52630,\"start\":52482},{\"end\":52794,\"start\":52644},{\"end\":53082,\"start\":52797},{\"end\":53832,\"start\":53542},{\"end\":54312,\"start\":54240},{\"end\":55008,\"start\":54557},{\"end\":56556,\"start\":55866},{\"end\":57760,\"start\":57716}]", "figure_ref": "[{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":17717,\"start\":17716},{\"attributes\":{\"ref_id\":\"fig_2\"},\"end\":25874,\"start\":25873},{\"attributes\":{\"ref_id\":\"fig_5\"},\"end\":31270,\"start\":31269},{\"end\":39887,\"start\":39886},{\"attributes\":{\"ref_id\":\"fig_13\"},\"end\":42004,\"start\":42003},{\"attributes\":{\"ref_id\":\"fig_11\"},\"end\":43243,\"start\":43242},{\"attributes\":{\"ref_id\":\"fig_13\"},\"end\":43996,\"start\":43995},{\"attributes\":{\"ref_id\":\"fig_12\"},\"end\":44005,\"start\":44004},{\"attributes\":{\"ref_id\":\"fig_10\"},\"end\":45788,\"start\":45787}]", "bib_author_first_name": "[{\"end\":58751,\"start\":58750},{\"end\":58759,\"start\":58758},{\"end\":58766,\"start\":58765},{\"end\":58772,\"start\":58771},{\"end\":58781,\"start\":58780},{\"end\":58914,\"start\":58913},{\"end\":58921,\"start\":58920},{\"end\":58928,\"start\":58927},{\"end\":58936,\"start\":58935},{\"end\":58944,\"start\":58943},{\"end\":58959,\"start\":58958},{\"end\":58961,\"start\":58960},{\"end\":59113,\"start\":59112},{\"end\":59120,\"start\":59119},{\"end\":59126,\"start\":59125},{\"end\":59133,\"start\":59132},{\"end\":59140,\"start\":59139},{\"end\":59327,\"start\":59326},{\"end\":59336,\"start\":59335},{\"end\":59342,\"start\":59341},{\"end\":59349,\"start\":59348},{\"end\":59357,\"start\":59356},{\"end\":59536,\"start\":59535},{\"end\":59543,\"start\":59542},{\"end\":59550,\"start\":59549},{\"end\":59556,\"start\":59555},{\"end\":59730,\"start\":59729},{\"end\":59737,\"start\":59736},{\"end\":59743,\"start\":59742},{\"end\":59750,\"start\":59749},{\"end\":59771,\"start\":59770},{\"end\":59899,\"start\":59898},{\"end\":60010,\"start\":60009},{\"end\":60016,\"start\":60015},{\"end\":60022,\"start\":60021},{\"end\":60029,\"start\":60028},{\"end\":60031,\"start\":60030},{\"end\":60047,\"start\":60043},{\"end\":60054,\"start\":60053},{\"end\":60124,\"start\":60123},{\"end\":60133,\"start\":60132},{\"end\":60142,\"start\":60141},{\"end\":60156,\"start\":60155},{\"end\":60286,\"start\":60285},{\"end\":60293,\"start\":60292},{\"end\":60301,\"start\":60300},{\"end\":60309,\"start\":60308},{\"end\":60317,\"start\":60316},{\"end\":60448,\"start\":60447},{\"end\":60454,\"start\":60453},{\"end\":60460,\"start\":60459},{\"end\":60468,\"start\":60467},{\"end\":60474,\"start\":60473},{\"end\":60606,\"start\":60605},{\"end\":60613,\"start\":60612},{\"end\":60620,\"start\":60619},{\"end\":60626,\"start\":60625},{\"end\":60766,\"start\":60765},{\"end\":60774,\"start\":60773},{\"end\":60782,\"start\":60781},{\"end\":60790,\"start\":60789},{\"end\":60797,\"start\":60796},{\"end\":60805,\"start\":60804},{\"end\":60946,\"start\":60945},{\"end\":60953,\"start\":60952},{\"end\":61117,\"start\":61116},{\"end\":61124,\"start\":61123},{\"end\":61132,\"start\":61131},{\"end\":61138,\"start\":61137},{\"end\":61270,\"start\":61269},{\"end\":61277,\"start\":61276},{\"end\":61283,\"start\":61282},{\"end\":61291,\"start\":61290},{\"end\":61462,\"start\":61461},{\"end\":61470,\"start\":61469},{\"end\":61477,\"start\":61476},{\"end\":61485,\"start\":61484},{\"end\":61487,\"start\":61486},{\"end\":61496,\"start\":61495},{\"end\":61505,\"start\":61504},{\"end\":61677,\"start\":61676},{\"end\":61683,\"start\":61682},{\"end\":61689,\"start\":61688},{\"end\":61698,\"start\":61697},{\"end\":61705,\"start\":61704},{\"end\":61713,\"start\":61712},{\"end\":61868,\"start\":61867},{\"end\":62051,\"start\":62050},{\"end\":62059,\"start\":62058},{\"end\":62067,\"start\":62066},{\"end\":62075,\"start\":62074},{\"end\":62176,\"start\":62175},{\"end\":62291,\"start\":62290},{\"end\":62299,\"start\":62298},{\"end\":62305,\"start\":62304},{\"end\":62312,\"start\":62311},{\"end\":62319,\"start\":62318},{\"end\":62453,\"start\":62452},{\"end\":62459,\"start\":62458},{\"end\":62467,\"start\":62466},{\"end\":62473,\"start\":62472},{\"end\":62480,\"start\":62479},{\"end\":62482,\"start\":62481},{\"end\":62492,\"start\":62491},{\"end\":62658,\"start\":62657},{\"end\":62667,\"start\":62666},{\"end\":62675,\"start\":62674},{\"end\":62684,\"start\":62683},{\"end\":62692,\"start\":62691},{\"end\":62812,\"start\":62811},{\"end\":62827,\"start\":62826},{\"end\":62989,\"start\":62988},{\"end\":62996,\"start\":62995},{\"end\":63005,\"start\":63004},{\"end\":63017,\"start\":63016},{\"end\":63159,\"start\":63158},{\"end\":63166,\"start\":63165},{\"end\":63175,\"start\":63174},{\"end\":63187,\"start\":63186},{\"end\":63293,\"start\":63292},{\"end\":63295,\"start\":63294},{\"end\":63308,\"start\":63307},{\"end\":63318,\"start\":63317},{\"end\":63493,\"start\":63492},{\"end\":63505,\"start\":63504},{\"end\":63513,\"start\":63512},{\"end\":63523,\"start\":63522},{\"end\":63596,\"start\":63595},{\"end\":63606,\"start\":63605},{\"end\":63614,\"start\":63613},{\"end\":63628,\"start\":63627},{\"end\":63819,\"start\":63818},{\"end\":63989,\"start\":63988},{\"end\":63996,\"start\":63995},{\"end\":64005,\"start\":64001},{\"end\":64007,\"start\":64006},{\"end\":64161,\"start\":64160},{\"end\":64168,\"start\":64167},{\"end\":64174,\"start\":64173},{\"end\":64328,\"start\":64327},{\"end\":64336,\"start\":64335},{\"end\":64343,\"start\":64342},{\"end\":64345,\"start\":64344},{\"end\":64351,\"start\":64350},{\"end\":64360,\"start\":64359},{\"end\":64506,\"start\":64505},{\"end\":64515,\"start\":64514},{\"end\":64522,\"start\":64521},{\"end\":64529,\"start\":64528},{\"end\":64703,\"start\":64702},{\"end\":64710,\"start\":64709},{\"end\":64718,\"start\":64717},{\"end\":64724,\"start\":64723},{\"end\":64733,\"start\":64732},{\"end\":64875,\"start\":64874},{\"end\":64881,\"start\":64880},{\"end\":64887,\"start\":64886},{\"end\":64894,\"start\":64893},{\"end\":64901,\"start\":64900},{\"end\":65084,\"start\":65083},{\"end\":65091,\"start\":65090},{\"end\":65093,\"start\":65092},{\"end\":65099,\"start\":65098},{\"end\":65107,\"start\":65106},{\"end\":65203,\"start\":65202},{\"end\":65218,\"start\":65217},{\"end\":65226,\"start\":65225},{\"end\":65341,\"start\":65340},{\"end\":65470,\"start\":65469},{\"end\":65472,\"start\":65471},{\"end\":65638,\"start\":65637},{\"end\":65650,\"start\":65649},{\"end\":65662,\"start\":65661},{\"end\":65769,\"start\":65768},{\"end\":65781,\"start\":65780},{\"end\":65789,\"start\":65788},{\"end\":65799,\"start\":65798},{\"end\":65990,\"start\":65989},{\"end\":65999,\"start\":65998},{\"end\":66006,\"start\":66005},{\"end\":66013,\"start\":66012},{\"end\":66034,\"start\":66033},{\"end\":66171,\"start\":66170},{\"end\":66178,\"start\":66177},{\"end\":66184,\"start\":66183},{\"end\":66192,\"start\":66191},{\"end\":66328,\"start\":66327},{\"end\":66335,\"start\":66334},{\"end\":66495,\"start\":66494},{\"end\":66593,\"start\":66592},{\"end\":66602,\"start\":66594},{\"end\":66612,\"start\":66611},{\"end\":67208,\"start\":67203},{\"end\":67247,\"start\":67243},{\"end\":67284,\"start\":67280},{\"end\":67317,\"start\":67316},{\"end\":67353,\"start\":67349},{\"end\":67396,\"start\":67388},{\"end\":67431,\"start\":67427},{\"end\":67471,\"start\":67467},{\"end\":67526,\"start\":67513},{\"end\":67600,\"start\":67568},{\"end\":67647,\"start\":67639}]", "bib_author_last_name": "[{\"end\":58756,\"start\":58752},{\"end\":58763,\"start\":58760},{\"end\":58769,\"start\":58767},{\"end\":58778,\"start\":58773},{\"end\":58786,\"start\":58782},{\"end\":58918,\"start\":58915},{\"end\":58925,\"start\":58922},{\"end\":58933,\"start\":58929},{\"end\":58941,\"start\":58937},{\"end\":58956,\"start\":58945},{\"end\":58964,\"start\":58962},{\"end\":59117,\"start\":59114},{\"end\":59123,\"start\":59121},{\"end\":59130,\"start\":59127},{\"end\":59137,\"start\":59134},{\"end\":59148,\"start\":59141},{\"end\":59333,\"start\":59328},{\"end\":59339,\"start\":59337},{\"end\":59346,\"start\":59343},{\"end\":59354,\"start\":59350},{\"end\":59361,\"start\":59358},{\"end\":59540,\"start\":59537},{\"end\":59547,\"start\":59544},{\"end\":59553,\"start\":59551},{\"end\":59562,\"start\":59557},{\"end\":59734,\"start\":59731},{\"end\":59740,\"start\":59738},{\"end\":59747,\"start\":59744},{\"end\":59768,\"start\":59751},{\"end\":59776,\"start\":59772},{\"end\":59903,\"start\":59900},{\"end\":60013,\"start\":60011},{\"end\":60019,\"start\":60017},{\"end\":60026,\"start\":60023},{\"end\":60041,\"start\":60032},{\"end\":60051,\"start\":60048},{\"end\":60059,\"start\":60055},{\"end\":60130,\"start\":60125},{\"end\":60139,\"start\":60134},{\"end\":60153,\"start\":60143},{\"end\":60162,\"start\":60157},{\"end\":60290,\"start\":60287},{\"end\":60298,\"start\":60294},{\"end\":60306,\"start\":60302},{\"end\":60314,\"start\":60310},{\"end\":60322,\"start\":60318},{\"end\":60451,\"start\":60449},{\"end\":60457,\"start\":60455},{\"end\":60465,\"start\":60461},{\"end\":60471,\"start\":60469},{\"end\":60479,\"start\":60475},{\"end\":60610,\"start\":60607},{\"end\":60617,\"start\":60614},{\"end\":60623,\"start\":60621},{\"end\":60630,\"start\":60627},{\"end\":60771,\"start\":60767},{\"end\":60779,\"start\":60775},{\"end\":60787,\"start\":60783},{\"end\":60794,\"start\":60791},{\"end\":60802,\"start\":60798},{\"end\":60808,\"start\":60806},{\"end\":60950,\"start\":60947},{\"end\":60957,\"start\":60954},{\"end\":61121,\"start\":61118},{\"end\":61129,\"start\":61125},{\"end\":61135,\"start\":61133},{\"end\":61144,\"start\":61139},{\"end\":61274,\"start\":61271},{\"end\":61280,\"start\":61278},{\"end\":61288,\"start\":61284},{\"end\":61295,\"start\":61292},{\"end\":61467,\"start\":61463},{\"end\":61474,\"start\":61471},{\"end\":61482,\"start\":61478},{\"end\":61493,\"start\":61488},{\"end\":61502,\"start\":61497},{\"end\":61512,\"start\":61506},{\"end\":61680,\"start\":61678},{\"end\":61686,\"start\":61684},{\"end\":61695,\"start\":61690},{\"end\":61702,\"start\":61699},{\"end\":61710,\"start\":61706},{\"end\":61717,\"start\":61714},{\"end\":61872,\"start\":61869},{\"end\":62056,\"start\":62052},{\"end\":62064,\"start\":62060},{\"end\":62072,\"start\":62068},{\"end\":62079,\"start\":62076},{\"end\":62181,\"start\":62177},{\"end\":62296,\"start\":62292},{\"end\":62302,\"start\":62300},{\"end\":62309,\"start\":62306},{\"end\":62316,\"start\":62313},{\"end\":62323,\"start\":62320},{\"end\":62456,\"start\":62454},{\"end\":62464,\"start\":62460},{\"end\":62470,\"start\":62468},{\"end\":62477,\"start\":62474},{\"end\":62489,\"start\":62483},{\"end\":62496,\"start\":62493},{\"end\":62664,\"start\":62659},{\"end\":62672,\"start\":62668},{\"end\":62681,\"start\":62676},{\"end\":62689,\"start\":62685},{\"end\":62695,\"start\":62693},{\"end\":62824,\"start\":62813},{\"end\":62841,\"start\":62828},{\"end\":62993,\"start\":62990},{\"end\":63002,\"start\":62997},{\"end\":63014,\"start\":63006},{\"end\":63023,\"start\":63018},{\"end\":63163,\"start\":63160},{\"end\":63172,\"start\":63167},{\"end\":63184,\"start\":63176},{\"end\":63193,\"start\":63188},{\"end\":63305,\"start\":63296},{\"end\":63315,\"start\":63309},{\"end\":63324,\"start\":63319},{\"end\":63502,\"start\":63494},{\"end\":63510,\"start\":63506},{\"end\":63520,\"start\":63514},{\"end\":63530,\"start\":63524},{\"end\":63603,\"start\":63597},{\"end\":63611,\"start\":63607},{\"end\":63625,\"start\":63615},{\"end\":63635,\"start\":63629},{\"end\":63824,\"start\":63820},{\"end\":63993,\"start\":63990},{\"end\":63999,\"start\":63997},{\"end\":64013,\"start\":64008},{\"end\":64165,\"start\":64162},{\"end\":64171,\"start\":64169},{\"end\":64177,\"start\":64175},{\"end\":64333,\"start\":64329},{\"end\":64340,\"start\":64337},{\"end\":64348,\"start\":64346},{\"end\":64357,\"start\":64352},{\"end\":64364,\"start\":64361},{\"end\":64512,\"start\":64507},{\"end\":64519,\"start\":64516},{\"end\":64526,\"start\":64523},{\"end\":64532,\"start\":64530},{\"end\":64707,\"start\":64704},{\"end\":64715,\"start\":64711},{\"end\":64721,\"start\":64719},{\"end\":64730,\"start\":64725},{\"end\":64736,\"start\":64734},{\"end\":64878,\"start\":64876},{\"end\":64884,\"start\":64882},{\"end\":64891,\"start\":64888},{\"end\":64898,\"start\":64895},{\"end\":64907,\"start\":64902},{\"end\":65088,\"start\":65085},{\"end\":65096,\"start\":65094},{\"end\":65104,\"start\":65100},{\"end\":65111,\"start\":65108},{\"end\":65215,\"start\":65204},{\"end\":65223,\"start\":65219},{\"end\":65233,\"start\":65227},{\"end\":65346,\"start\":65342},{\"end\":65482,\"start\":65473},{\"end\":65647,\"start\":65639},{\"end\":65659,\"start\":65651},{\"end\":65668,\"start\":65663},{\"end\":65778,\"start\":65770},{\"end\":65786,\"start\":65782},{\"end\":65796,\"start\":65790},{\"end\":65806,\"start\":65800},{\"end\":65996,\"start\":65991},{\"end\":66003,\"start\":66000},{\"end\":66010,\"start\":66007},{\"end\":66031,\"start\":66014},{\"end\":66039,\"start\":66035},{\"end\":66175,\"start\":66172},{\"end\":66181,\"start\":66179},{\"end\":66189,\"start\":66185},{\"end\":66197,\"start\":66193},{\"end\":66332,\"start\":66329},{\"end\":66341,\"start\":66336},{\"end\":66504,\"start\":66496},{\"end\":66609,\"start\":66603},{\"end\":66615,\"start\":66613},{\"end\":67216,\"start\":67209},{\"end\":67253,\"start\":67248},{\"end\":67289,\"start\":67285},{\"end\":67322,\"start\":67318},{\"end\":67361,\"start\":67354},{\"end\":67400,\"start\":67397},{\"end\":67440,\"start\":67432},{\"end\":67486,\"start\":67472},{\"end\":67541,\"start\":67527},{\"end\":67612,\"start\":67601},{\"end\":67656,\"start\":67648}]", "bib_entry": "[{\"attributes\":{\"id\":\"b0\",\"matched_paper_id\":213177573},\"end\":58823,\"start\":58663},{\"attributes\":{\"id\":\"b1\",\"matched_paper_id\":226527444},\"end\":59007,\"start\":58825},{\"attributes\":{\"id\":\"b2\",\"matched_paper_id\":226722676},\"end\":59189,\"start\":59009},{\"attributes\":{\"id\":\"b3\",\"matched_paper_id\":215901044},\"end\":59421,\"start\":59191},{\"attributes\":{\"id\":\"b4\",\"matched_paper_id\":201133068},\"end\":59603,\"start\":59423},{\"attributes\":{\"id\":\"b5\",\"matched_paper_id\":238825761},\"end\":59817,\"start\":59605},{\"attributes\":{\"id\":\"b6\",\"matched_paper_id\":27999524},\"end\":59934,\"start\":59819},{\"attributes\":{\"id\":\"b7\",\"matched_paper_id\":4620692},\"end\":60088,\"start\":59936},{\"attributes\":{\"id\":\"b8\",\"matched_paper_id\":31429854},\"end\":60199,\"start\":60090},{\"attributes\":{\"id\":\"b9\",\"matched_paper_id\":221120871},\"end\":60359,\"start\":60201},{\"attributes\":{\"id\":\"b10\",\"matched_paper_id\":218676571},\"end\":60499,\"start\":60361},{\"attributes\":{\"id\":\"b11\",\"matched_paper_id\":218777665},\"end\":60664,\"start\":60501},{\"attributes\":{\"id\":\"b12\",\"matched_paper_id\":149948875},\"end\":60845,\"start\":60666},{\"attributes\":{\"id\":\"b13\",\"matched_paper_id\":21657281},\"end\":60996,\"start\":60847},{\"attributes\":{\"id\":\"b14\",\"matched_paper_id\":226702680},\"end\":61189,\"start\":60998},{\"attributes\":{\"id\":\"b15\",\"matched_paper_id\":213783013},\"end\":61332,\"start\":61191},{\"attributes\":{\"doi\":\"10.1109/JIOT.2021.3123406\",\"id\":\"b16\",\"matched_paper_id\":240134192},\"end\":61578,\"start\":61334},{\"attributes\":{\"id\":\"b17\",\"matched_paper_id\":219017276},\"end\":61753,\"start\":61580},{\"attributes\":{\"doi\":\"10.1109/TNSE.2021.3076795\",\"id\":\"b18\",\"matched_paper_id\":236630194},\"end\":61942,\"start\":61755},{\"attributes\":{\"id\":\"b19\",\"matched_paper_id\":69819191},\"end\":62116,\"start\":61944},{\"attributes\":{\"id\":\"b20\",\"matched_paper_id\":205242740},\"end\":62207,\"start\":62118},{\"attributes\":{\"id\":\"b21\",\"matched_paper_id\":171096810},\"end\":62352,\"start\":62209},{\"attributes\":{\"id\":\"b22\",\"matched_paper_id\":211298378},\"end\":62537,\"start\":62354},{\"attributes\":{\"id\":\"b23\"},\"end\":62729,\"start\":62539},{\"attributes\":{\"id\":\"b24\",\"matched_paper_id\":244232181},\"end\":62886,\"start\":62731},{\"attributes\":{\"id\":\"b25\",\"matched_paper_id\":226229725},\"end\":63064,\"start\":62888},{\"attributes\":{\"id\":\"b26\",\"matched_paper_id\":226309467},\"end\":63234,\"start\":63066},{\"attributes\":{\"id\":\"b27\",\"matched_paper_id\":966543},\"end\":63392,\"start\":63236},{\"attributes\":{\"id\":\"b28\",\"matched_paper_id\":28202810},\"end\":63562,\"start\":63394},{\"attributes\":{\"id\":\"b29\",\"matched_paper_id\":13022595},\"end\":63723,\"start\":63564},{\"attributes\":{\"id\":\"b30\",\"matched_paper_id\":214524486},\"end\":63861,\"start\":63725},{\"attributes\":{\"id\":\"b31\",\"matched_paper_id\":211171623},\"end\":64056,\"start\":63863},{\"attributes\":{\"id\":\"b32\",\"matched_paper_id\":69358745},\"end\":64214,\"start\":64058},{\"attributes\":{\"id\":\"b33\",\"matched_paper_id\":214303391},\"end\":64401,\"start\":64216},{\"attributes\":{\"id\":\"b34\",\"matched_paper_id\":226713453},\"end\":64569,\"start\":64403},{\"attributes\":{\"id\":\"b35\",\"matched_paper_id\":215971834},\"end\":64773,\"start\":64571},{\"attributes\":{\"id\":\"b36\",\"matched_paper_id\":49182591},\"end\":64944,\"start\":64775},{\"attributes\":{\"id\":\"b37\",\"matched_paper_id\":70032223},\"end\":65148,\"start\":64946},{\"attributes\":{\"id\":\"b38\",\"matched_paper_id\":6208256},\"end\":65275,\"start\":65150},{\"attributes\":{\"id\":\"b39\",\"matched_paper_id\":5389801},\"end\":65414,\"start\":65277},{\"attributes\":{\"id\":\"b40\",\"matched_paper_id\":16326763},\"end\":65570,\"start\":65416},{\"attributes\":{\"id\":\"b41\",\"matched_paper_id\":3544558},\"end\":65710,\"start\":65572},{\"attributes\":{\"id\":\"b42\",\"matched_paper_id\":11227891},\"end\":65874,\"start\":65712},{\"attributes\":{\"id\":\"b43\",\"matched_paper_id\":233710144},\"end\":66077,\"start\":65876},{\"attributes\":{\"id\":\"b44\",\"matched_paper_id\":204246968},\"end\":66234,\"start\":66079},{\"attributes\":{\"id\":\"b45\",\"matched_paper_id\":13046179},\"end\":66429,\"start\":66236},{\"attributes\":{\"id\":\"b46\",\"matched_paper_id\":4718601},\"end\":66546,\"start\":66431},{\"attributes\":{\"id\":\"b47\",\"matched_paper_id\":6628106},\"end\":66703,\"start\":66548},{\"attributes\":{\"id\":\"b48\"},\"end\":69481,\"start\":66705}]", "bib_title": "[{\"end\":58748,\"start\":58663},{\"end\":58911,\"start\":58825},{\"end\":59110,\"start\":59009},{\"end\":59324,\"start\":59191},{\"end\":59533,\"start\":59423},{\"end\":59727,\"start\":59605},{\"end\":59896,\"start\":59819},{\"end\":60007,\"start\":59936},{\"end\":60121,\"start\":60090},{\"end\":60283,\"start\":60201},{\"end\":60445,\"start\":60361},{\"end\":60603,\"start\":60501},{\"end\":60763,\"start\":60666},{\"end\":60943,\"start\":60847},{\"end\":61114,\"start\":60998},{\"end\":61267,\"start\":61191},{\"end\":61459,\"start\":61334},{\"end\":61674,\"start\":61580},{\"end\":61865,\"start\":61755},{\"end\":62048,\"start\":61944},{\"end\":62173,\"start\":62118},{\"end\":62288,\"start\":62209},{\"end\":62450,\"start\":62354},{\"end\":62655,\"start\":62539},{\"end\":62809,\"start\":62731},{\"end\":62986,\"start\":62888},{\"end\":63156,\"start\":63066},{\"end\":63290,\"start\":63236},{\"end\":63490,\"start\":63394},{\"end\":63593,\"start\":63564},{\"end\":63816,\"start\":63725},{\"end\":63986,\"start\":63863},{\"end\":64158,\"start\":64058},{\"end\":64325,\"start\":64216},{\"end\":64503,\"start\":64403},{\"end\":64700,\"start\":64571},{\"end\":64872,\"start\":64775},{\"end\":65081,\"start\":64946},{\"end\":65200,\"start\":65150},{\"end\":65338,\"start\":65277},{\"end\":65467,\"start\":65416},{\"end\":65635,\"start\":65572},{\"end\":65766,\"start\":65712},{\"end\":65987,\"start\":65876},{\"end\":66168,\"start\":66079},{\"end\":66325,\"start\":66236},{\"end\":66492,\"start\":66431},{\"end\":66590,\"start\":66548},{\"end\":67201,\"start\":66705}]", "bib_author": "[{\"end\":58758,\"start\":58750},{\"end\":58765,\"start\":58758},{\"end\":58771,\"start\":58765},{\"end\":58780,\"start\":58771},{\"end\":58788,\"start\":58780},{\"end\":58920,\"start\":58913},{\"end\":58927,\"start\":58920},{\"end\":58935,\"start\":58927},{\"end\":58943,\"start\":58935},{\"end\":58958,\"start\":58943},{\"end\":58966,\"start\":58958},{\"end\":59119,\"start\":59112},{\"end\":59125,\"start\":59119},{\"end\":59132,\"start\":59125},{\"end\":59139,\"start\":59132},{\"end\":59150,\"start\":59139},{\"end\":59335,\"start\":59326},{\"end\":59341,\"start\":59335},{\"end\":59348,\"start\":59341},{\"end\":59356,\"start\":59348},{\"end\":59363,\"start\":59356},{\"end\":59542,\"start\":59535},{\"end\":59549,\"start\":59542},{\"end\":59555,\"start\":59549},{\"end\":59564,\"start\":59555},{\"end\":59736,\"start\":59729},{\"end\":59742,\"start\":59736},{\"end\":59749,\"start\":59742},{\"end\":59770,\"start\":59749},{\"end\":59778,\"start\":59770},{\"end\":59905,\"start\":59898},{\"end\":60015,\"start\":60009},{\"end\":60021,\"start\":60015},{\"end\":60028,\"start\":60021},{\"end\":60043,\"start\":60028},{\"end\":60053,\"start\":60043},{\"end\":60061,\"start\":60053},{\"end\":60132,\"start\":60123},{\"end\":60141,\"start\":60132},{\"end\":60155,\"start\":60141},{\"end\":60164,\"start\":60155},{\"end\":60292,\"start\":60285},{\"end\":60300,\"start\":60292},{\"end\":60308,\"start\":60300},{\"end\":60316,\"start\":60308},{\"end\":60324,\"start\":60316},{\"end\":60453,\"start\":60447},{\"end\":60459,\"start\":60453},{\"end\":60467,\"start\":60459},{\"end\":60473,\"start\":60467},{\"end\":60481,\"start\":60473},{\"end\":60612,\"start\":60605},{\"end\":60619,\"start\":60612},{\"end\":60625,\"start\":60619},{\"end\":60632,\"start\":60625},{\"end\":60773,\"start\":60765},{\"end\":60781,\"start\":60773},{\"end\":60789,\"start\":60781},{\"end\":60796,\"start\":60789},{\"end\":60804,\"start\":60796},{\"end\":60810,\"start\":60804},{\"end\":60952,\"start\":60945},{\"end\":60959,\"start\":60952},{\"end\":61123,\"start\":61116},{\"end\":61131,\"start\":61123},{\"end\":61137,\"start\":61131},{\"end\":61146,\"start\":61137},{\"end\":61276,\"start\":61269},{\"end\":61282,\"start\":61276},{\"end\":61290,\"start\":61282},{\"end\":61297,\"start\":61290},{\"end\":61469,\"start\":61461},{\"end\":61476,\"start\":61469},{\"end\":61484,\"start\":61476},{\"end\":61495,\"start\":61484},{\"end\":61504,\"start\":61495},{\"end\":61514,\"start\":61504},{\"end\":61682,\"start\":61676},{\"end\":61688,\"start\":61682},{\"end\":61697,\"start\":61688},{\"end\":61704,\"start\":61697},{\"end\":61712,\"start\":61704},{\"end\":61719,\"start\":61712},{\"end\":61874,\"start\":61867},{\"end\":62058,\"start\":62050},{\"end\":62066,\"start\":62058},{\"end\":62074,\"start\":62066},{\"end\":62081,\"start\":62074},{\"end\":62183,\"start\":62175},{\"end\":62298,\"start\":62290},{\"end\":62304,\"start\":62298},{\"end\":62311,\"start\":62304},{\"end\":62318,\"start\":62311},{\"end\":62325,\"start\":62318},{\"end\":62458,\"start\":62452},{\"end\":62466,\"start\":62458},{\"end\":62472,\"start\":62466},{\"end\":62479,\"start\":62472},{\"end\":62491,\"start\":62479},{\"end\":62498,\"start\":62491},{\"end\":62666,\"start\":62657},{\"end\":62674,\"start\":62666},{\"end\":62683,\"start\":62674},{\"end\":62691,\"start\":62683},{\"end\":62697,\"start\":62691},{\"end\":62826,\"start\":62811},{\"end\":62843,\"start\":62826},{\"end\":62995,\"start\":62988},{\"end\":63004,\"start\":62995},{\"end\":63016,\"start\":63004},{\"end\":63025,\"start\":63016},{\"end\":63165,\"start\":63158},{\"end\":63174,\"start\":63165},{\"end\":63186,\"start\":63174},{\"end\":63195,\"start\":63186},{\"end\":63307,\"start\":63292},{\"end\":63317,\"start\":63307},{\"end\":63326,\"start\":63317},{\"end\":63504,\"start\":63492},{\"end\":63512,\"start\":63504},{\"end\":63522,\"start\":63512},{\"end\":63532,\"start\":63522},{\"end\":63605,\"start\":63595},{\"end\":63613,\"start\":63605},{\"end\":63627,\"start\":63613},{\"end\":63637,\"start\":63627},{\"end\":63826,\"start\":63818},{\"end\":63995,\"start\":63988},{\"end\":64001,\"start\":63995},{\"end\":64015,\"start\":64001},{\"end\":64167,\"start\":64160},{\"end\":64173,\"start\":64167},{\"end\":64179,\"start\":64173},{\"end\":64335,\"start\":64327},{\"end\":64342,\"start\":64335},{\"end\":64350,\"start\":64342},{\"end\":64359,\"start\":64350},{\"end\":64366,\"start\":64359},{\"end\":64514,\"start\":64505},{\"end\":64521,\"start\":64514},{\"end\":64528,\"start\":64521},{\"end\":64534,\"start\":64528},{\"end\":64709,\"start\":64702},{\"end\":64717,\"start\":64709},{\"end\":64723,\"start\":64717},{\"end\":64732,\"start\":64723},{\"end\":64738,\"start\":64732},{\"end\":64880,\"start\":64874},{\"end\":64886,\"start\":64880},{\"end\":64893,\"start\":64886},{\"end\":64900,\"start\":64893},{\"end\":64909,\"start\":64900},{\"end\":65090,\"start\":65083},{\"end\":65098,\"start\":65090},{\"end\":65106,\"start\":65098},{\"end\":65113,\"start\":65106},{\"end\":65217,\"start\":65202},{\"end\":65225,\"start\":65217},{\"end\":65235,\"start\":65225},{\"end\":65348,\"start\":65340},{\"end\":65484,\"start\":65469},{\"end\":65649,\"start\":65637},{\"end\":65661,\"start\":65649},{\"end\":65670,\"start\":65661},{\"end\":65780,\"start\":65768},{\"end\":65788,\"start\":65780},{\"end\":65798,\"start\":65788},{\"end\":65808,\"start\":65798},{\"end\":65998,\"start\":65989},{\"end\":66005,\"start\":65998},{\"end\":66012,\"start\":66005},{\"end\":66033,\"start\":66012},{\"end\":66041,\"start\":66033},{\"end\":66177,\"start\":66170},{\"end\":66183,\"start\":66177},{\"end\":66191,\"start\":66183},{\"end\":66199,\"start\":66191},{\"end\":66334,\"start\":66327},{\"end\":66343,\"start\":66334},{\"end\":66506,\"start\":66494},{\"end\":66611,\"start\":66592},{\"end\":66617,\"start\":66611},{\"end\":67243,\"start\":67203},{\"end\":67280,\"start\":67243},{\"end\":67316,\"start\":67280},{\"end\":67349,\"start\":67316},{\"end\":67388,\"start\":67349},{\"end\":67427,\"start\":67388},{\"end\":67467,\"start\":67427},{\"end\":67513,\"start\":67467},{\"end\":67568,\"start\":67513},{\"end\":67639,\"start\":67568},{\"end\":67683,\"start\":67639}]", "bib_venue": "[{\"end\":63388,\"start\":63361},{\"end\":63719,\"start\":63682},{\"end\":65271,\"start\":65257},{\"end\":65410,\"start\":65383},{\"end\":65566,\"start\":65529},{\"end\":65706,\"start\":65692},{\"end\":65870,\"start\":65843},{\"end\":66425,\"start\":66388},{\"end\":66542,\"start\":66528},{\"end\":66699,\"start\":66662},{\"end\":68129,\"start\":67921},{\"end\":58810,\"start\":58788},{\"end\":58988,\"start\":58966},{\"end\":59175,\"start\":59150},{\"end\":59407,\"start\":59363},{\"end\":59589,\"start\":59564},{\"end\":59803,\"start\":59778},{\"end\":59919,\"start\":59905},{\"end\":60074,\"start\":60061},{\"end\":60186,\"start\":60164},{\"end\":60346,\"start\":60324},{\"end\":60492,\"start\":60481},{\"end\":60650,\"start\":60632},{\"end\":60832,\"start\":60810},{\"end\":60983,\"start\":60959},{\"end\":61176,\"start\":61146},{\"end\":61319,\"start\":61297},{\"end\":61561,\"start\":61539},{\"end\":61739,\"start\":61719},{\"end\":61925,\"start\":61899},{\"end\":62103,\"start\":62081},{\"end\":62189,\"start\":62183},{\"end\":62334,\"start\":62325},{\"end\":62523,\"start\":62498},{\"end\":62716,\"start\":62697},{\"end\":62873,\"start\":62843},{\"end\":63049,\"start\":63025},{\"end\":63220,\"start\":63195},{\"end\":63359,\"start\":63326},{\"end\":63556,\"start\":63532},{\"end\":63680,\"start\":63637},{\"end\":63848,\"start\":63826},{\"end\":64042,\"start\":64015},{\"end\":64201,\"start\":64179},{\"end\":64388,\"start\":64366},{\"end\":64556,\"start\":64534},{\"end\":64760,\"start\":64738},{\"end\":64931,\"start\":64909},{\"end\":65135,\"start\":65113},{\"end\":65255,\"start\":65235},{\"end\":65381,\"start\":65348},{\"end\":65527,\"start\":65484},{\"end\":65690,\"start\":65670},{\"end\":65841,\"start\":65808},{\"end\":66063,\"start\":66041},{\"end\":66221,\"start\":66199},{\"end\":66386,\"start\":66343},{\"end\":66526,\"start\":66506},{\"end\":66660,\"start\":66617},{\"end\":67919,\"start\":67683}]"}}}, "year": 2023, "month": 12, "day": 17}