{"id": 250245023, "updated": "2022-10-21 17:12:24.97", "metadata": {"title": "An empirical model-based framework for operational monitoring and prediction of heatwaves based on temperature data", "authors": "[{\"first\":\"Neetin\",\"last\":\"Narkhede\",\"middle\":[]},{\"first\":\"Rajib\",\"last\":\"Chattopadhyay\",\"middle\":[]},{\"first\":\"S.\",\"last\":\"Lekshmi\",\"middle\":[]},{\"first\":\"Pulak\",\"last\":\"Guhathakurta\",\"middle\":[]},{\"first\":\"Naresh\",\"last\":\"Kumar\",\"middle\":[]},{\"first\":\"M.\",\"last\":\"Mohapatra\",\"middle\":[]}]", "venue": "Modeling Earth Systems and Environment", "journal": "Modeling Earth Systems and Environment", "publication_date": {"year": 2022, "month": null, "day": null}, "abstract": "Heatwaves are a major cause of environmental and health hazards. In a global warming scenario, the effect of heat stress associated with the increased frequency of heatwaves makes a large number of people vulnerable over the Indian subcontinent. For the development of a proper heatwave action plan in this region, heatwaves are required to be monitored, tracked, and predicted in real-time. In this study, we propose an operationally deployable empirical model using a set of indices to monitor and predict the heatwaves in the short range over the Indian region in real-time using gridded observation data and reanalysis data. The empirical operational model framework has two major components, (a) index-based monitoring over a spatial domain, and (b) temporal prediction over different locations (i.e. grid points). In the current version of the model framework, three heatwave indices are calculated for component (a), e.g., excess heat index, heat stress index, and excess heat factor index which were found suitable for the Indian region, and elsewhere. The advantage of these percentile-based and mean monthly exceedance-based indices is that they can be used to identify the heatwave affected blocks/districts/cities masking the local fluctuations. In addition, we also incorporate the effect of synoptic information like wind and humidity on heatwave intensity and duration in this component. This model component closely follows the existing operational criteria and the results from several cases are verified. For the second component (b), we have used a simple machine learning based method for the prediction of excess heat factor index to understand the recurrence properties of these indices. This simplistic method provides some reference skills for heatwave based on evolution memories. The results indicate that the overall heatwave indices can be predicted using this simplistic model up to a lead-time of 2–3 days for most of the regions of India.", "fields_of_study": null, "external_ids": {"arxiv": null, "mag": null, "acl": null, "pubmed": null, "pubmedcentral": null, "dblp": null, "doi": "10.1007/s40808-022-01450-2"}}, "content": {"source": {"pdf_hash": "fe83db0205979e5d48f6552ed9269351d4f157a2", "pdf_src": "Springer", "pdf_uri": null, "oa_url_match": false, "oa_info": null}, "grobid": {"id": "438541a67728102b804ae9fc57cc7dc6672c2e4e", "type": "plain-text", "url": "s3://ai2-s2-pdf-extraction-prod/parse-results/s2orc_worker/fe83db0205979e5d48f6552ed9269351d4f157a2.txt", "contents": "\nAn empirical model-based framework for operational monitoring and prediction of heatwaves based on temperature data\n2022\n\nNeetin Narkhede \n· Rajib Chattopadhyay \n· S Lekshmi \n· Pulak Guhathakurta \nNaresh Kumar \n· M Mohapatra \nAn empirical model-based framework for operational monitoring and prediction of heatwaves based on temperature data\n\n(0123456789) 1 3 Modeling Earth Systems and Environment\n8202210.1007/s40808-022-01450-2Received: 19 April 2022 / Accepted: 10 June 2022 / Published online: 4 July 2022ORIGINAL ARTICLEIndices of heatwave monitoring · Empirical forecast · Spatial extent of heatwave\nHeatwaves are a major cause of environmental and health hazards. In a global warming scenario, the effect of heat stress associated with the increased frequency of heatwaves makes a large number of people vulnerable over the Indian subcontinent. For the development of a proper heatwave action plan in this region, heatwaves are required to be monitored, tracked, and predicted in real-time. In this study, we propose an operationally deployable empirical model using a set of indices to monitor and predict the heatwaves in the short range over the Indian region in real-time using gridded observation data and reanalysis data. The empirical operational model framework has two major components, (a) index-based monitoring over a spatial domain, and (b) temporal prediction over different locations (i.e. grid points). In the current version of the model framework, three heatwave indices are calculated for component (a), e.g., excess heat index, heat stress index, and excess heat factor index which were found suitable for the Indian region, and elsewhere. The advantage of these percentile-based and mean monthly exceedance-based indices is that they can be used to identify the heatwave affected blocks/districts/cities masking the local fluctuations. In addition, we also incorporate the effect of synoptic information like wind and humidity on heatwave intensity and duration in this component. This model component closely follows the existing operational criteria and the results from several cases are verified. For the second component (b), we have used a simple machine learning based method for the prediction of excess heat factor index to understand the recurrence properties of these indices. This simplistic method provides some reference skills for heatwave based on evolution memories. The results indicate that the overall heatwave indices can be predicted using this simplistic model up to a lead-time of 2-3 days for most of the regions of India.\n\nIntroduction\n\nHeatwaves are periods of hotter temperature spells (relative to local climatology) causing hazardous weather anomalies that affect several regions across the globe. Persisting higher temperature anomalies relative to regional climatology are also often associated with high humidity and can cause severe physiological distress. Besides health impacts, the disastrous effects of heatwaves on the agriculture and energy sector are also well known. Crop growth is negatively impacted by high daytime temperatures and extreme heat stress (Deryng et al. 2014;Siebert and Ewert 2014;Hatfield and Prueger 2015). Similarly, livestock also feels heat stress which reduces their development and productivity (e.g., milk production in dairies and mortality rate in bovines Vitali et al. 2015;Lees et al. 2019). High temperature also increases energy demand, e.g., the need for electricity increases manifolds when there are heatwave-like conditions (Villa 2021). A sudden rise in electricity demand causes an increased burden on the electricity generating companies, which can impact the transmission line capacity. As per the National Disaster Management Authority (NDMA) of India report (Guleria and Gupta 2018), heatwaves are the cause of high morbidity and mortality in several districts of India during the summer season (May-June).\n\nIn a global warming scenario, hot days are getting hotter and are more frequent, while we are experiencing fewer cold days (Perkins-Kirkpatrick and Lewis 2020). As per the IPCC summary report (Masson-Delmotte et al. 2018), climate change is rapidly progressing and is intensifying. It also says that for a warming of 1.5 °C, there will be an increase in the frequency of heatwaves associated with longer warm and shorter cold seasons. For warming of 2 °C, the report predicts that heat extremes would more often reach critical tolerance thresholds for agriculture and health (https:// www. ipcc. ch/ 2021/ 08/ 09/ ar6-wg1-20210 809-pr/). Over the Indian region also, the increasing trend in the past, current, and future scenarios is well documented. Several studies have pointed out an increase in heatwave conditions and its effects on the Indian region, especially on agricultural production and human health (Pai et al. 2013;Panda et al. 2014;Rohini et al. 2016;Mazdiyasni Omid et al. 2017;Chakraborty et al. 2019;Satyanarayana and Rao 2020;Dubey et al. 2021).\n\nHence, monitoring and modeling of heatwaves are of topmost priority for operational use and academic research. Heat Action plans in different countries are based on such efforts. World Meteorological Organization (WMO) does not define heatwave as a global index for modeling and monitoring, and the definition is country-specific. However, there are several objective guidelines endorsed by WMO, followed by all countries. The definition of heatwaves in a broad sense quantifies the duration, extent, and severity (McCarthy et al. 2019). India Meteorological Department (IMD) has been monitoring the heatwave based on specific objective criteria for many decades based on station data. The first criterion is based on the maximum temperature associated with each type of station and the second one accounts for the departure from pentad normal for any pentad. But this way of defining heatwave can only give an idea of rising temperature at the station (or a group of stations) and not the extent to which it will be experienced, i.e., the spatial pattern of heatwave-type of situations cannot be assessed directly or defined systematically. The spatial extent of the heatwave is often considerable, and it affects multiple districts and states. Hence, it becomes essential to determine heatwave conditions in such a way as to incorporate their spatial distribution over India besides the station-wise criteria.\n\nIn recent times, gridded reanalysis are available from different operational meteorological centers worldwide. Gridded data cover the whole globe at regular latitude and longitude intervals and is based on balanced flow dynamics based on dynamical equations. Hence, monitoring weather fields during heatwaves using gridded reanalysis data can provide quantitative information on the spatial extent of heatwave conditions, provided a suitable index is defined. IMD generates gridded temperature data based on station data, and the database now extends for more than 70 years. This study defines a framework for heatwave monitoring and short-term prediction using gridded data. The framework has two major components, as shown in Fig. 1: (a) and (b). Component (a) proposes to use indices based on the gridded temperature data produced at IMD Pune and Relative humidity data (IMDAA data) from a recent reanalysis from the National Centre for Medium-range Weather Forecasting (NCMRWF) to demonstrate the spatial extent of heatwave-type conditions. The heatwave indices defined and proposed by earlier studies with well-defined applications show the validity of these indices (Nairn et al. 2009;Fischer and Schär 2010;Fischer et al. 2011;Perkins and Alexander 2013;Nissan et al. 2017;Nairn and Fawcett 2013). Rohini et al., (2016) have briefly discussed its application and proposed that the same indices could be used for the Indian region. This study examines the applicability of the heatwave indices obtained using gridded data over the Indian region for monitoring purposes in the first component. The monitoring verification is made through case studies using five selected events, and a comparison is made using IMD's existing daily weather (IDWR) report. The five cases are chosen based on the NDMA report (Chapter 2, Figure 4(b) of Guleria and Gupta (2018), which reported high mortality during the heatwave situations over India. In addition to these indices, the current study also proposes the inclusion of moisture or relative humidity-based spatial maps to warn potential health hazards over different regions of India.\n\nIn the second component (b) in the framework, the study proposes a framework to predict the heatwaves in the shortrange using these indices (Fig. 1). The data is prepared based on Indian surface observation data. For this, we have proposed a Long-Short Term Memory (LSTM)-based machine learning model (Hochreiter and Schmidhuber 1997;Gers et al. 1999) to predict the heatwave indices using gridded data. The LSTM models are recurrent memory-based models and find a wide range of applications in time series prediction in the data science field and meteorological time series prediction problems (Yu et al. 2019;Emmert-Streib et al. 2020;Miao et al. 2020;Van Houdt et al. 2020;Ouma et al. 2022). The purpose of the analysis is to describe the heatwaves, their evolution, and trends using trend analysis and predictability and recurrent nature of the indices defined here.\n\n\nData and methodology\n\nFor this, the IMD daily mean gridded surface temperature data (Srivastava et al. 2009) of 1° × 1° resolution for a period from 1951 to 2020 has been used. The daily mean surface relative humidity (2 m) and wind at 850 hPa data are obtained from the NCMRWF-IMDAA (Indian Monsoon Data Assimilation and Analysis) reanalysis dataset (Rani As discussed in the introduction, we propose the following empirical model-based framework for monitoring and predicting heatwaves, as shown in Fig. 1. This model framework has two components: (a) and (b). Component (a) is for monitoring purposes, and component (b) is for prediction purposes. Both the components are based on defining a heatwave index. The indices for a grid point as defined for daily temperature (T) values at ith day by Parkins and Alexander (2013) and Rohini et al. (2016) and are shown below:\n\n(i) Excess heat signature index:\n\nT 95 is the 95 percentiles of mean Temperature for the day \"i.\" (ii) Heat Stress index:\n\nwhere the terminology is the same as earlier.\n\n(iii) Excess heat Factor index:\n\nA positive value of the EHF (> 0) indicates the extreme heatwave-like condition.\n\nThe above indices are calculated first. Then they are used to describe the spatial pattern of 5 cases of heatwaves in different parts of India. These five cases are shown in Table 1. The cases are selected for the years when the NDMA has shown high heatwave-related deaths (Fig. 4a of the NDMA report (Guleria and Gupta 2018)). Once we obtain the spatial distribution of the indices for the heatwave, we have\n(1) EHI sig (i) = T i + T i−1 + T i−2 3 − T 95\n(2)\nEHI accl , i = T i + T i−1 + T i−2 3 − T i−3 + ⋯ + T i−32 30\n(3) EHF i = max 1, EHI accl,i × EHI sig,i examined the prevailing synoptic conditions by analyzing the spatial pattern of surface relative humidity and 850 hPa wind. The daily mean wind and relative humidity fields are generated by taking an average of the 3-hourly datasets from IMDAA. For verification, we will compare the heatwave incidents obtained from these indices with IMD daily weather report (IDWR). This will provide a qualitative verification for the selected cases. Then the trend of these three indices during March-May for the period 1951-2020 is also studied, showing the increase/decrease in amplitude of the extreme heatwaves over different regions of India. The trend would show the increase or decrease in amplitude of the index of extreme heatwaves over different spatial locations of India.\n\nThe Long Short Term Memory (LSTM) based prediction model is used here. The simplest form or the so-called \"Vanilla\" LSTM form, is used. We have used the 'Keras' library, and the prediction model parameters are described in Table 2. The purpose of the prediction exercise is to use the EHF data at any grid during time stepst 0 , t 0 − 1, t 0 − 2 and predict the same up to lead-timet 0 + . We have shown prediction up to lead-time = 1, 2, 3, 4, 5, 6 . Statistically, it is a simple lag-regression problem in which the hyperparameters are trained based on a training period , and the trained model is used in the test period (2011)(2012)(2013)(2014)(2015)(2016)(2017)(2018)(2019)(2020). For every grid point, there is a separate model. The plots are shown as a spatial map of the forecast of EHF at any lead-time. The skill of the model is then evaluated using correlation coefficient, and root mean square error (RMSE). The details of the model and results will be discussed in Sect. 3(d).\n\n\nResult\n\nThe indices are calculated using the temperature data. For the implementation of the index for monitoring purposes (component (a) in Fig. 1), first, a few cases of heatwaves  are identified. Then, we have analyzed the spatial extent of extreme conditions during these events. Then, the trend in the three indices is discussed.\n\n\nVerification of heatwave cases using the computed indices\n\nCase studies validate the heat indices and assess their applicability in predicting and evaluating the severity of heatwaves over different parts of India. The selected cases are already well referred to in media, international agencies, and the NDMA report. These cases are also chosen so that these heatwaves affect different parts of India: western India, southern and peninsular part, eastern region, etc.\n\nThe following few sections describe those cases.\n\n\nCase1: Heatwave date 27/05/2020\n\nThe spatial pattern of the heatwave indices for the event, along with the prevailing synoptic conditions, are shown in Fig. 2a-d. Figure 2a, b shows the spatial distribution of EHI sig. and EHI accl with the regions with positive values denoted as the dotted region. Figure 2c shows the pattern of maximum temperature (T max ) overlaid by the excess heat factor (EHF), with the dotted parts showing positive values of EHF. For reference, the 40 °C temperature contour is also indicated. The prevailed synoptic conditions (relative humidity and surface wind condition) during the heatwave day are shown in Fig. 2d. There was an intense heatwave event on 27/05/2020 with EHF values ranging between 4 and 5 (plot not shown), which was observed over central Rajasthan. From Fig. 2 Similar plots as in Fig. 2 have been plotted for the heatwave event on 25/05/2015 and are shown in Fig. 3. EHI sig (Fig. 3a) with positive values ranging from 1 to 2 are seen over western Gujarat and eastern and southeastern India (coastal Andhra Pradesh to southern parts of West Bengal). A positive heat stress condition is observed all over India except north Jammu and Kashmir and central to the far eastern part of northeastern India. Positive EHF values are observed over west Gujarat, and Andhra Pradesh (coastal and interior parts), with a maximum temperature of above 40 °C and above, observed over coastal Odisha and West Bengal (Fig. 3c). These regions were found to experience heatwave conditions of considerable intensity (EHF ≥ 3; plot not shown). These condition in coastal Andhra Pradesh was associated with a low relative humidity condition. At the same time, the northern region of Odisha coast and adjoining regions have positive EHF and high relative humidity experiencing oppressiveness with a lesser intensity of heatwave. Similar conditions of oppressiveness with ample humidity conditions and positive EHF values are also noted over western Gujarat. Due to weak westerly winds, moisture supply is less over Uttar Pradesh, and central India experiences a hot, dry climate. It shows that in such situations of ample moisture supply, it becomes essential to monitor humidity conditions also, along with the temperature, for better monitoring of heatwave conditions. As per IDWR, severe heatwave condition was noted at a few places in coastal Andhra Pradesh and a few places in Odisha. In Tuni (coastal AP), a maximum temperature of 47.2 °C was recorded.\n\n\nCase3: Heatwave date 14/5/2010\n\nThe plots in Fig. 4 analyze the spatial pattern of heat indices and the prevailing synoptic conditions during the heatwave event on 14/5/2010, as in Fig. 2. Positive values for EHI sig can be found over two regions, one over west Rajasthan and adjoining Gujarat (central to the north) and the second one extending over south Maharashtra, Karnataka, Andhra Pradesh, Kerala, and west Tamil Nadu (Fig. 4a). The heat stress is positive all over India, including the northeastern states, as shown in Fig. 4b. Severe heatwave condition has been experienced over the two regions mentioned earlier with positive EHF values (Fig. 4c) in the range 2-3 (values not shown). Rajasthan and the inner Gujarat region show a dry heatwave condition, while the coastal Gujarat experience oppressive conditions due to the supply of moisture. Similar conditions as in coastal Gujarat could be experienced  conditions also occurred in Rajasthan, UP (west), Madhya Pradesh, Gujarat, Haryana, north-central Maharashtra, Marathwada, and Rayalaseema, Tamil Nadu, and north interior Karnataka.\n\n\nCase4: Heatwave date 21/05/2005\n\nThe positive EHI sig and EHF (Fig. 5a, b) conditions for the event on 21/05/2005 can be noted over south Maharashtra, Karnataka, Kerala, and adjoining Tamil Nadu. Meanwhile, positive heat stress is observed all over India except in northeast India, as shown in Fig. 5b. From the prevailing synoptic conditions, it can be seen that extreme dry heatwave conditions are noted over south-central Maharashtra and north interior Karnataka because of low humidity and the maximum temperature reaching 40 °C. While similar dry heatwave conditions are also noted over north, northwest, and central India, high humidity (RH > 55%) and oppressive conditions are observed over coastal south Maharashtra, coastal Karnataka, Kerala, and adjoining parts of Tamil Nadu (Fig. 5d). Low relative humidity and weak wind field contribute to the dry weather condition over the northwest to central India up to Odisha and Andhra Pradesh.\n\n\nCase5: Heatwave date 12/05/1995\n\nA positive EHI sig and EHF for the event on 12/05/1995 (Fig. 6a, c) is seen over northwestern Gujarat and the neck of northeastern states above Bangladesh. EHF was found to be in the range of 3-4 (map not shown) in northwestern Gujarat (Kutch and Saurashtra) and far western Rajasthan. A positive value of heat stress is seen over northern parts of India, northwest India to east-northeast India through central India, as seen in Fig. 6b. The prevailing conditions show that west Rajasthan and adjoining Gujarat experience an intense heatwave due to the low humidity conditions (40-50%). The adjoining regions such as central and north India (up to east UP) also experience intense heatwave conditions due to even lower humidity conditions (< 35%; Fig. 6d) and the maximum temperature reaching above 40 °C (Fig. 6c).\n\n\nStatistical properties of heat indices: trend map (spatial) for March-June period (MAMJ)\n\nIt is seen that EHI sig shows (Fig. 7a) positive trend in the month of March over almost all regions of India except some part in north Maharashtra spanning north part of districts Jalgaon, Buldhana, Akola, Amaravati, and the area spanning central Uttar Pradesh to Central Bihar extending southward to the upper northeastern part of Madhya Pradesh (MP), the northern part of Chhattisgarh and Central to western Jharkhand state. In the month of April (Fig. 7b), all Indian regions except the region spanning far eastern UP, Jharkhand, upper eastern Odisha to northeast India have the positive trend of EHI sig . In the month of May (Fig. 7c), Uttarakhand, UP, Bihar, Jharkhand, West Bengal (WB), Chhattisgarh, Odisha, eastern MP, and far east AP have a negative trend of EHI sig , while the rest of India shows positive trend. In the month of June (Fig. 7d) Western India spanning Rajasthan (except northern belt adjoining Punjab and Haryana), Gujarat, west MP, West, and Central Maharashtra, south India spanning Karnataka, Kerala, Tamil Nadu, South to Central AP, and East Indian region from east Odisha, east Jharkhand to northeast India shows a positive trend in EHI sig . Magnitude-wise and by spatial extent (EHI sig ), Rajasthan was leading followed by Gujarat, Kerala, Tamil Nadu, AP, Karnataka, Maharashtra, MP, Odisha, Chhattisgarh lastly, Northeast India. Heat stress (EHI accl ) which is a rise in the mean temperature of the last three days over the last 30 days mean temperature, shows a positive trend in the month of march (Fig. 8a), over the Indian region except for the southern tip of Kerala and another region extending from Central UP to east end Northeast India spanning Bihar, north Chhattisgarh, Jharkhand, WB to Far End North East. For the Month of April, (Fig. 8b), this area of positive trend reduces to the belt extending from Rajasthan, Punjab, Haryana to Kerala and Tamil Nadu spanning North Karnataka, Maharashtra, and MP state. The rest of India shows a negative trend for heat stress. In the month of May, (Fig. 8c), positive heat stress trend further reduced to a region extending from West southwest MP to Upper Kerala Spanning Karnataka, Maharashtra (western and Central), Andhra Pradesh, in addition to the belt extending to Northeast India from Assam. In the Month of June, (Fig. 8d), the eastern region extending from Central UP to central Odisha and Gujarat shows a positive trend.\n\nExcess Heat Factor (EHF) is a measure of heatwave intensity. In the month of March, it shows a negative trend (Fig. 9a) at the Himalayan range at north to eastern belt which extends up to Punjab, upper Haryana, East MP, Central Chhattisgarh, the upper part of Odisha spanning Jharkhand and Bihar in addition to, south MP and adjoining part of North and East Maharashtra. The rest of India shows a positive trend in EHF, especially the western part of Gujarat and Rajasthan shows a significantly positive trend. In the month of April, as in Fig. 9b, excess heat factor shows positive trend in Rajasthan state with the positive trend extending from Rajasthan to MP, Gujarat, Chhattisgarh, Punjab, Himachal Pradesh, Uttarakhand, and up to central UP with a reduced magnitude. This positive trend starts decreasing from Maharashtra to Kerala with less magnitude (moderate) and eastward up to Odisha. The negative trend of EHF is seen in eastern states like Bihar, West Bengal, and the whole North East region of India. In the month of May, shown in Fig. 9c, a negative trend of EHF is seen in Eastern states such as Bihar, West Bengal, Chhattisgarh, Jharkhand, Odisha, UP, Eastern MP, and Eastern part of Uttarakhand. The rest of India shows a moderately positive trend of Excessive Heat factors, including northeastern states. In the month of June (Fig. 9d), this negative trend extends more toward west up to eastern Rajasthan, Central MP and Central \n\n\nPrediction of the heatwave indices using machine learning (LSTM) algorithm\n\nTo see if the indices could be predicted using machine learning model, we have used a vanilla Long-Short-Term-Memory (LSTM) architecture as defined in Table 2 to predict the EHF index during the month of May. The model is employed at each grid point. The model training period is 1951-2010 and the test period is 2011-2020 for the 31 daily values of May. The model uses past three days data [(t), (t − 1), (t − 2)] of EHF and predicts the same up to lead time (t + ), wheret = 1, 2, … , 6 . The skill of prediction for the test period at different lead-times is shown in Figs. 10 and 11 respectively. Figure 10 shows the spatial pattern of correlation skill and Fig. 11 shows the root mean square error (RMSE). The correlation plot shows that the skill decreases drastically as the lead time increases. The effective skill of 0.7 and above (representing ~ 50% variance in the data) for up to 3 days can be observed and skill reduces for higher lead times. The RMSE increase as the lead-time increases. It may be noted that there is a higher RMSE in the model over the north west India. The low pan India prediction skill up to 4-5 days or so indicates that the raw model has to be refined further. Within India, the prediction skill of 0.6 and above is observed over northern states north of 20° N up to 5-6 days of lead-time. Thus, the plot indicates that we have better predictability for the north Indian states. The reason will be explored in a latter study. We have compared the prediction skill of this model with a simple linear regression-based model. The improvement is marginal (result not shown). Figure 12 shows an example of the predicted time series of EHF using the LSTM model for a grid over Ajmer in the state of Rajasthan representing an arid location. It can be seen that the strong heatwave over Rajasthan during the end of May as shown in Fig. 2 is captured efficiently up to 2-3 lead days in the model. More work is required to understand the predictability of the EHF index and improve this model.\n\n\nDiscussion\n\nThis study proposes a framework of heatwave tracking (monitoring) and prediction using gridded data (maximum and minimum temperature, humidity, and wind The prediction using LSTM model is performed at each (x, y) grid point and the spatial map of skill is computed. Certain grid points where data is not available for every year, it is skipped in computation 1 3 data) for the Indian region. The framework has two main components as shown in Fig. 1. The first component is monitoring which is done using few pre-defined heatwave indices (Sect. 2). Verification of the component (a) is done by selecting five cases of severe heatwaves based on an existing NDMA report and is compared with the India daily weather Report (IDWR) of the India Meteorological Department (IMD). It is observed that its first three cases are matching perfectly with the IDWR description for a heatwave for that day. In the case of Event1, (for the heatwave date 27/05/2020, as per IDWR, heatwave condition occurs at isolated pockets over different locations, namely, west Rajasthan, Haryana, Delhi, and East Uttar Pradesh, Vidarbha, north Madhya Pradesh, Marathwada, West Uttar Pradesh (UP) and isolated pockets of Saurashtra. The figure based on computed indices, Fig. 2c, shows that the spatial extent of Event-1 defined by these indices reflects the belts of heatwave conditions very precisely when compared to the IMD daily weather reports. In the case of Event2, (heatwave date 25/05/2015), as per IDWR, severe heatwave condition occurred at coastal Andhra Pradesh (AP) and a few places of Odisha. The Maximum temperature of 47.2 °C was recorded at Tuni (Coastal AP). The heatwave indices were able to capture the geospatial extent of the severity of the extreme event (Fig. 3c). In the case of Event3 (Heatwave date 14/05/2010), as per IDWR, severe heatwave condition occurred in some parts of the state of Bihar. Heatwave condition also prevailed at different states and meteorological subdivisions namely, Rajasthan, UP (west), Madhya Pradesh, Gujarat, Haryana, North Madhya Maharashtra, Marathwada, Rayalaseema, Tamil Nadu, and North Interior Karnataka. Figure 4a, c establishes its accuracy. In addition to these three indices, we had also studied the wind and humidity profile on the days for the above cases (Fig. 2, 3, 4d). It is seen that humidity plays an essential role in assessing comfortability at that place. Winds are agents of the transport of moisture at a place. Westerly winds play an important role in deciding the effect of heatwaves. High humidity (RH%) with EFH ≥ 0 may give rise to discomfort; oppressive conditions are seen along the coastline while interior regions are prone to low humidity conditions which leads to dry and intense heatwave conditions. These indices are also studied with their trends. It is seen that heat indices show increasing trends over Northwest and western India extending toward the southern peninsula through central and west India for the months of April and May month prominently (Figs. 7,8,9).\n\nWe propose to use the index-based method for day-today (operational) work so that we can track heatwaves as mentioned in Fig. 1. We also studied the synoptic conditions based on wind and humidity on specific regions using wind and humidity profiles generated using spatial images. To operationalize this study, we require gridded data for the current day (maximum and minimum temperature), which is generated by IMD-Pune on a regular basis. In addition to this, we need humidity and wind profile data. For this study, we have used the humidity and wind data generated by NCMRWF (IMDAA dataset) to assess the heatwave effect in the Indian region and potential health hazards. The same variables are also required to be available on a realtime basis to include excess humidity maps over the Indian region. Finally, to implement component (b) (in Fig. 1) we have used a vanilla LSTM model to understand the empirical prediction skill of these indices. The analysis indicates that the prediction skill of the LSTM model is modest with higher correlation values persisting over northern India up to 5-6 lead days. We propose to use and improve this machine learning model for future operational studies.\n\n\nDeclarations\n\nConflict of interest Authors declare that there is no conflict of interest. Fig. 12 Prediction of EHF for the 31 days of May during the test period (2011-2020) using a vanilla LSTM model over a grid in Rajasthan. The vertical line shows the start of May of every test year mentioned as x axis. The grid location is taken from Fig. 9. The black curve shows the EHF from observation. Forecasts for different lead-times are also shown\n\nFig. 1\n1A schematic diagram of proposed model framework for monitoring of heatwaves and prediction using heatwave indices et al. 2021) with a spatial resolution of 12 km for the for the 1979-2020 period.\n\nFig. 2 Fig. 3\n23Case 1 plot different heatwave indices on a heatwave day(27.05.2020)  to capture the heatwave pattern over Indian region. a Excess Heat Index (°C) (shaded) with value above 0 is dotted, b heat stress (°C) (shaded) with value above 0 is dotted, c maximum temperature (°C) from daily IMD gridded data (shaded) and positive values of Excess heat factor (EHF) (°C) is overlaid as dotted pattern. Also shown 40 °C temperature as a separate contour (aqua blue), d Relative Humidity (shaded), wind Vector at 850hpa from IMDAA data with positive values of EHF overlaid as dotted pattern. (The white portion seen at fig. a-c at northern tip of Jammu and Kashmir is due to non-availability of grid point data) Case 2 plot showing different heatwave indices on a heatwave day (25.05.2015) to capture the heatwave pattern over Indian region. a Excess Heat Index (°C) (shaded) with value above 0 is dotted, b heat stress(°C) (shaded) with value above 0 is dotted, c maximum temperature (°C) from daily IMD gridded data (shaded) and positive values of Excess heat factor (EHF) (°C) is overlaid as dotted pattern.Also shown 40 °C temperature as a separate contour (aqua blue), (d) Relative Humidity (shaded), wind Vector at 850hpa from IMDAA data with positive values of EHF overlaid as dotted pattern. (The white portion seen atfig. a-cat northern tip of Jammu and Kashmir is due to non-availability of grid point data) by the lower Konkan and the Western Ghats extending up to Kerala. The remaining inner regions with positive EHF and maximum temperature ≥ 40 °C in central India to the foothills of the Himalayas may feel dry heatwave conditions due to reduced humidity. The northeastern states experience rainfall activity indicated by the negative EHF values and moisture availability. According to the IDWR, severe heatwave conditions prevailed in some parts of Bihar. Such\n\nFig. 4\n4Case 3 plot showing different heatwave indices on a heatwave day (14.05.2010) to capture the heatwave pattern over Indian region. a Excess Heat Index (°C) (shaded) with value above 0 is dotted, b Heat stress (°C) (shaded) with value above 0 is dotted, c maximum temperature (°C) from daily IMD gridded data (shaded) and positive values of Excess heat factor (EHF) (°C) is overlaid as dotted pattern. Also shown 40 °C temperature as a separate contour (aqua blue), d Relative Humidity (shaded), wind Vector at 850hpa from IMDAA data with positive values of EHF overlaid as dotted pattern. (The white portion seen at fig. a-c at northern tip of Jammu and Kashmir is due to non-availability of grid point data)\n\nFig. 5\n5Case 4 plot showing different heatwave indices on a heatwave day(21.05.2005)  to capture the heatwave pattern over Indian region. a Excess Heat Index (°C) (shaded) with value above 0 is dotted, b heat stress (°C) (shaded) with value above 0 is dotted, c Maximum temperature (°C) from daily IMD gridded data (shaded) and positive values of Excess heat factor (EHF) (°C) is overlaid as dotted pattern.Also shown 40 °C temperature as a separate contour (aqua blue), d Relative Humidity(shaded), wind Vector at 850hpa from IMDAA data with positive values of EHF overlaid as dotted pattern. (The white portion seen atfig. a-cat northern tip of Jammu and Kashmir is due to non-availability of grid point data)\n\nFig. 6\n6Case 5 plot showing different heatwave indices on a heatwave day(12.05.1995)  to capture the heatwave pattern over Indian region. a Excess Heat Index (°C) (shaded) with value above 0 is dotted, b Heat stress (°C) (shaded) with value above 0 is dotted, c maximum temperature (°C) from daily IMD gridded data(shaded) and positive values of Excess heat factor (EHF) (°C) is overlaid as dotted pattern.Also shown 40 °C temperature as a separate contour (aqua blue), d Relative Humidity (shaded), wind Vector at 850hpa from IMDAA data with positive values of EHF overlaid as dotted pattern. (The white portion seen atfig. a-cat northern tip of Jammu and Kashmir is due to non-availability of grid point data)Maharashtra eastward up to the Northern part of Coastal Andhra Pradesh.\n\nFig. 7\n7Trend (°C) (per month per year) maps for Heatwave Index (EHI_sig), Excess Heat Index (°C) shaded and contoured for values greater than 0 (blue color) for the month of a March, b April, c May, d June. (The white portion seen at fig. a-d at northern tip of Jammu and Kashmir is due to non-availability of grid point data)\n\nFig. 8\n8Trend (°C) (per month per year) maps for Heatwave Index (EHI_accl), Heat Stress (°C) shaded and contoured for values greater than 0 (blue color) for the month of a March, b April, c May, d June. (The white portion seen at fig. a-d at northern tip of Jammu and Kashmir is due to non-availability of grid point data) 1 3\n\nFig. 9\n9Trend (°C) (per month per year) maps for Heatwave Index (EHF), Excess Heat factor (°C) shaded and contoured for values greater than 0 (blue color) for the month of a March, b April, c May, d June. (The white portion seen at fig. a-d at northern tip of Jammu and Kashmir is due to non-availability of grid point data)\n\nFig. 10\n10The correlation coefficient (cc) of the LSTM model predictions of EHF index at different lead-times (mentioned at the top of each panel).\n\nFig. 11\n11Same as Fig. 10 but showing the spatial map of root mean square error (RMSE) for different lead-times\n\nTable 1\n1Table showingthe dates identified as heatwave dates based on IMD daily weather report and is documented in NDMA report. The heatwave indices reported in this study are verified for these casesCase no \nDates (heatwave days as \nper IMD daily weather \nreport) \n\n1 \n27-05-2020 \n2 \n25-05-2015 \n3 \n14-05-2010 \n4 \n21-05-2005 \n5 \n12-05-1995 \n\n\n\nTable 2\n2Brief configuration of the Vanilla LSTM model used in this studyModel type \nSequential LSTM \n\nSoftware library \nKeras/Python \nNumber of layers \n10 \nActivation \nRelu \nOptimizer \nAdam \nLoss \nMSE \nDense layer \n1 \nBatch size \n31 × 5 \nEpoch \n100 \n\n\n\n, it can be seen that heat stress is observed over almost all parts of India except in the northeastern states. The area under heat stress are Rajasthan (central and western parts), Eastern and Central Gujarat, Central and Western Maharashtra, Karnataka, Kerala, and the Western part of Tamil Nadu adjoining Kerala. To understand the prevailing synoptic conditions, we have analyzed the surface relative humidity and wind (850 hPa) obtained from IMDAA(Fig. 2d). The westerly wind over regions such as Chhattisgarh, Madhya Pradesh (MP), Rajasthan, and Punjab leads to dry heatwave conditions. At the same time, coastal Gujarat, Maharashtra, Karnataka, Kerala, and west Tamil Nadu show increased surface humidity conditions, in addition to the excess EHF leading to oppressive conditions and is a cause of potential health hazards. The northeastern states through western Uttar Pradesh (UP), Jharkhand, Bihar, and the southern tip of Kerala have excess moisture and negative EHF values. The official IMD press release (imd.gov.in (IMD, 2020) also mentioned these heatwave conditions over the Indian region. As per IDWR for this event, the heatwave condition occurred at isolated pockets over different locations, west Rajasthan, Haryana, Delhi, east Uttar Pradesh (UP) Vidarbha, north Madhya Pradesh, Marathwada, West UP, and Saurashtra.Case2: Heatwave date 25/05/2015 \n\n\nAcknowledgements Authors acknowledge the anonymous Reviewer/s for constructive comments. The authors acknowledge Head CRS, IMD his support and encouragement. Authors also gratefully acknowledge NCMRWF, Ministry of Earth Sciences, Government of India, for IMDAA reanalysis. IMDAA reanalysis was produced under the collaboration between UK Met Office, NCMRWF, and IMD with financial support from the Ministry of Earth Sciences, under the National Monsoon Mission Program.\nSpatio-temporal trend in heat waves over India and its impact assessment on wheat crop. D Chakraborty, V K Sehgal, R Dhakar, 10.1007/s00704-019-02939-0Theoret Appl Climatol. 138Chakraborty D, Sehgal VK, Dhakar R et al (2019) Spatio-temporal trend in heat waves over India and its impact assessment on wheat crop. Theoret Appl Climatol 138:1925-1937. https:// doi. org/ 10. 1007/ s00704-019-02939-0\n\nGlobal crop yield response to extreme heat stress under multiple climate change futures. D Deryng, D Conway, N Ramankutty, 10.1088/1748-9326/9/3/034011Environ Res Lett. 934011Deryng D, Conway D, Ramankutty N et al (2014) Global crop yield response to extreme heat stress under multiple climate change futures. Environ Res Lett 9:034011. https:// doi. org/ 10. 1088/ 1748- 9326/9/ 3/ 034011\n\nPresent and future projections of heatwave hazard-risk over India: A regional earth system model assessment. A K Dubey, P Lal, P Kumar, 10.1016/j.envres.2021.111573Environ Res. 201111573Dubey AK, Lal P, Kumar P et al (2021) Present and future projections of heatwave hazard-risk over India: A regional earth system model assessment. Environ Res 201:111573. https:// doi. org/ 10. 1016/j. envres. 2021. 111573\n\nAn introductory review of deep learning for prediction models with big data. F Emmert-Streib, Yang Z Feng, H , Front Artif Intell. 3Emmert-Streib F, Yang Z, Feng H, et al (2020) An introductory review of deep learning for prediction models with big data. Front Artif Intell 3\n\nConsistent geographical patterns of changes in high-impact European heatwaves. E M Fischer, C Schär, 10.1038/ngeo866Nat Geosci. 3Fischer EM, Schär C (2010) Consistent geographical patterns of changes in high-impact European heatwaves. Nat Geosci 3:398- 403. https:// doi. org/ 10. 1038/ ngeo8 66\n\nQuantifying uncertainties in projections of extremes-a perturbed land surface parameter experiment. E M Fischer, D M Lawrence, B M Sanderson, 10.1007/s00382-010-0915-yClim Dyn. 37Fischer EM, Lawrence DM, Sanderson BM (2011) Quantifying uncer- tainties in projections of extremes-a perturbed land surface parameter experiment. Clim Dyn 37:1381-1398. https:// doi. org/ 10. 1007/ s00382-010-0915-y\n\nLearning to forget: continual prediction with LSTM. F A Gers, J Schmidhuber, F Cummins, Ninth international conference on artificial neural networks ICANN 99. (Conf. Publ. No. 470). 2Gers FA, Schmidhuber J, Cummins F (1999) Learning to forget: continual prediction with LSTM. In: 1999 Ninth international conference on artificial neural networks ICANN 99. (Conf. Publ. No. 470), vol 2, pp 850-855\n\nHeat wave in India documentation of state of Telangana and Odisha. S Guleria, A K Gupta, New DelhiNational Institute of Disaster Management. last accessed 01July2022Guleria S, Gupta AK (2018) Heat wave in India documentation of state of Telangana and Odisha (2016). National Institute of Dis- aster Management, New Delhi. https:// nidm. gov. in/ PDF/ pubs/ heat_ wave_ 18. pdf (last accessed 01July2022)\n\nTemperature extremes: effect on plant growth and development. J L Hatfield, J H Prueger, 10.1016/j.wace.2015.08.001Weather Clim Extrem. 10Hatfield JL, Prueger JH (2015) Temperature extremes: effect on plant growth and development. Weather Clim Extrem 10:4-10. https:// doi. org/ 10. 1016/j. wace. 2015. 08. 001\n\nLong short-term memory. S Hochreiter, J Schmidhuber, 10.1162/neco.1997.9.8.1735Neural Comput. 9Hochreiter S, Schmidhuber J (1997) Long short-term memory. Neu- ral Comput 9:1735-1780. https:// doi. org/ 10. 1162/ neco. 1997.9. 8. 1735\n\nThe impact of heat load on cattle. A M Lees, V Sejian, A L Wallage, 10.3390/ani9060322Animals (Basel). 9322Lees AM, Sejian V, Wallage AL et al (2019) The impact of heat load on cattle. Animals (Basel) 9:322. https:// doi. org/ 10. 3390/ ani90 60322\n\nGlobal warming of 1.5°C. An IPCC Special Report on the impacts of global warming of 1.5°C above pre-industrial levels and related global greenhouse gas emission pathways, in the context of strengthening the global response to the threat of climate change. V Masson-Delmotte, P Zhai, H-O Portner, sustainable development, and efforts to eradicate povertyMasson-Delmotte V, Zhai P, Portner H-O, et al (2018) Global warm- ing of 1.5°C. An IPCC Special Report on the impacts of global warming of 1.5°C above pre-industrial levels and related global greenhouse gas emission pathways, in the context of strengthen- ing the global response to the threat of climate change, sustain- able development, and efforts to eradicate poverty\n\nA new heatwave definition for the UK. M Mccarthy, L Armstrong, N Armstrong, 10.1002/wea.3629Weather. 74McCarthy M, Armstrong L, Armstrong N (2019) A new heatwave definition for the UK. Weather 74:382-387. https:// doi. org/ 10. 1002/ wea. 3629\n\nApplication of LSTM for short term fog forecasting based on meteorological elements. K Miao, T Han, Y Yao, 10.1016/j.neucom.2019.12.129Neurocomputing. 408Miao K, Han T, Yao Y et al (2020) Application of LSTM for short term fog forecasting based on meteorological elements. Neu- rocomputing 408:285-291. https:// doi. org/ 10. 1016/j. neucom. 2019. 12. 129\n\nDefining heatwaves: heatwave defined as a heatimpact event servicing all community and business sectors in Australia. J Nairn, R Fawcett, AustraliaCSIRO and the Bureau of MeteorologyNairn J, Fawcett R (2013) Defining heatwaves: heatwave defined as a heatimpact event servicing all community and business sectors in Australia. CSIRO and the Bureau of Meteorology, Australia\n\nDefining and predicting excessive heat events, a national system. J Nairn, R Fawcett, D Ray, CAWCR. Nairn J, Fawcett R, Ray D (2009) Defining and predicting excessive heat events, a national system. CAWCR, Melbourne\n\nDefining and predicting heat waves in Bangladesh. H Nissan, K Burkart, Coughlan De Perez, E , 10.1175/JAMC-D-17-0035.1J Appl Meteorol Climatol. 56Nissan H, Burkart K, Coughlan de Perez E et al (2017) Defining and predicting heat waves in Bangladesh. J Appl Meteorol Climatol 56:2653-2670. https:// doi. org/ 10. 1175/ JAMC-D-17-0035.1\n\nIncreasing probability of mortality during Indian heat waves. M Omid, Amir Aghakouchak, S J Davis, 10.1126/sciadv.1700066Sci Adv. 3Omid M, Amir AghaKouchak, Davis SJ et al (2017) Increasing probability of mortality during Indian heat waves. Sci Adv 3:e1700066. https:// doi. org/ 10. 1126/ sciadv. 17000 66\n\nRainfall and runoff timeseries trend analysis using LSTM recurrent neural network and wavelet neural network with satellite-based meteorological data: case study of Nzoia hydrologic basin. Y O Ouma, R Cheruyot, A N Wachera, 10.1007/s40747-021-00365-2Complex Intell Syst. 8Ouma YO, Cheruyot R, Wachera AN (2022) Rainfall and runoff time- series trend analysis using LSTM recurrent neural network and wavelet neural network with satellite-based meteorological data: case study of Nzoia hydrologic basin. Complex Intell Syst 8:213- 236. https:// doi. org/ 10. 1007/ s40747-021-00365-2\n\nLong term climatology and trends of heat waves over India during the recent 50 years. D S Pai, S A Nair, A N Ramanathan, Mausam. 64Pai DS, Nair SA, Ramanathan AN (2013) Long term climatology and trends of heat waves over India during the recent 50 years (1961- 2010). Mausam 64:585-604\n\nSpatiotemporal patterns in the mean and extreme temperature indices of India. D K Panda, A Mishra, A Kumar, 10.1002/joc.3931Panda DK, Mishra A, Kumar A et al (2014) Spatiotemporal patterns in the mean and extreme temperature indices of India, 1971-2005.\n\n. 10.1002/joc.3931Int J Climatol. 34Int J Climatol 34:3585-3603. https:// doi. org/ 10. 1002/ joc. 3931\n\nOn the measurement of heat waves. S E Perkins, L V Alexander, 10.1175/JCLI-D-12-00383.1J Clim. 26Perkins SE, Alexander LV (2013) On the measurement of heat waves. J Clim 26:4500-4517. https:// doi. org/ 10. 1175/ JCLI-D-12-00383.1\n\nIncreasing trends in regional heatwaves. S E Perkins-Kirkpatrick, S C Lewis, 10.1038/s41467-020-16970-7Nat Commun. 113357Perkins-Kirkpatrick SE, Lewis SC (2020) Increasing trends in regional heatwaves. Nat Commun 11:3357. https:// doi. org/ 10. 1038/ s41467-020-16970-7\n\nIMDAA: high-resolution satellite-era reanalysis for the Indian monsoon region. S I Rani, T Arulalan, J P George, 10.1175/JCLI-D-20-0412.1J Clim. 34Rani SI, Arulalan T, George JP et al (2021) IMDAA: high-resolution satellite-era reanalysis for the Indian monsoon region. J Clim 34:5109-5133. https:// doi. org/ 10. 1175/ JCLI-D-20-0412.1\n\nOn the variability and increasing trends of heat waves over. P Rohini, M Rajeevan, A K Srivastava, 10.1038/srep26153India. Sci Rep. 66153Rohini P, Rajeevan M, Srivastava AK (2016) On the variability and increasing trends of heat waves over India. Sci Rep 6:26153. https:// doi. org/ 10. 1038/ srep2 6153\n\nPhenology of heat waves over India. Satyanarayana Gch, Dvb Rao, 10.1016/j.atmosres.2020.105078Atmos Res. 245105078Satyanarayana GCh, Rao DVB (2020) Phenology of heat waves over India. Atmos Res 245:105078. https:// doi. org/ 10. 1016/j. atmos res. 2020. 105078\n\nFuture crop production threatened by extreme heat. S Siebert, F Ewert, 10.1088/1748-9326/9/4/041001Environ Res Lett. 941001Siebert S, Ewert F (2014) Future crop production threatened by extreme heat. Environ Res Lett 9:041001. https:// doi. org/ 10. 1088/ 1748-9326/9/ 4/ 041001\n\nDevelopment of a high resolution daily gridded temperature data set (1969-2005) for the Indian region. A K Srivastava, M Rajeevan, S R Kshirsagar, 10.1002/asl.232Atmos Sci Lett. 10Srivastava AK, Rajeevan M, Kshirsagar SR (2009) Development of a high resolution daily gridded temperature data set (1969-2005) for the Indian region. Atmos Sci Lett 10:249-254. https:// doi. org/ 10. 1002/ asl. 232\n\nA review on the long short-term memory model. G Van Houdt, C Mosquera, G Nápoles, 10.1007/s10462-020-09838-1Artif Intell Rev. 53Van Houdt G, Mosquera C, Nápoles G (2020) A review on the long short-term memory model. Artif Intell Rev 53:5929-5955. https:// doi. org/ 10. 1007/ s10462-020-09838-1\n\nInstitutional heat wave analysis by building energy modeling fleet and meter data. D L Villa, 10.1016/j.enbuild.2021.110774Energy Build. 237110774Villa DL (2021) Institutional heat wave analysis by building energy modeling fleet and meter data. Energy Build 237:110774. https:// doi. org/ 10. 1016/j. enbui ld. 2021. 110774\n\nThe effect of heat waves on dairy cow mortality. A Vitali, A Felici, S Esposito, 10.3168/jds.2015-9331J Dairy Sci. 98Vitali A, Felici A, Esposito S et al (2015) The effect of heat waves on dairy cow mortality. J Dairy Sci 98:4572-4579. https:// doi. org/ 10. 3168/ jds. 2015-9331\n\nA review of recurrent neural networks: LSTM cells and network architectures. Y Yu, X Si, C Hu, J Zhang, 10.1162/neco_a_01199Neural Comput. 311199Yu Y, Si X, Hu C, Zhang J (2019) A review of recurrent neural net- works: LSTM cells and network architectures. Neural Comput 31:1235-1270. https:// doi. org/ 10. 1162/ neco_a_ 01199\n\nPublisher's Note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Publisher's Note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations.\n", "annotations": {"author": "[{\"end\":139,\"start\":123},{\"end\":162,\"start\":140},{\"end\":175,\"start\":163},{\"end\":197,\"start\":176},{\"end\":211,\"start\":198},{\"end\":226,\"start\":212}]", "publisher": null, "author_last_name": "[{\"end\":138,\"start\":130},{\"end\":161,\"start\":148},{\"end\":174,\"start\":167},{\"end\":196,\"start\":178},{\"end\":210,\"start\":205},{\"end\":225,\"start\":216}]", "author_first_name": "[{\"end\":129,\"start\":123},{\"end\":141,\"start\":140},{\"end\":147,\"start\":142},{\"end\":164,\"start\":163},{\"end\":166,\"start\":165},{\"end\":177,\"start\":176},{\"end\":204,\"start\":198},{\"end\":213,\"start\":212},{\"end\":215,\"start\":214}]", "author_affiliation": null, "title": "[{\"end\":116,\"start\":1},{\"end\":342,\"start\":227}]", "venue": "[{\"end\":399,\"start\":344}]", "abstract": "[{\"end\":2577,\"start\":608}]", "bib_ref": "[{\"attributes\":{\"ref_id\":\"b1\"},\"end\":3147,\"start\":3127},{\"attributes\":{\"ref_id\":\"b27\"},\"end\":3170,\"start\":3147},{\"attributes\":{\"ref_id\":\"b8\"},\"end\":3196,\"start\":3170},{\"attributes\":{\"ref_id\":\"b31\"},\"end\":3374,\"start\":3355},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":3391,\"start\":3374},{\"attributes\":{\"ref_id\":\"b30\"},\"end\":3543,\"start\":3531},{\"attributes\":{\"ref_id\":\"b7\"},\"end\":3795,\"start\":3771},{\"attributes\":{\"ref_id\":\"b23\"},\"end\":4080,\"start\":4044},{\"attributes\":{\"ref_id\":\"b11\"},\"end\":4142,\"start\":4113},{\"attributes\":{\"ref_id\":\"b19\"},\"end\":4850,\"start\":4833},{\"attributes\":{\"ref_id\":\"b20\"},\"end\":4868,\"start\":4850},{\"attributes\":{\"ref_id\":\"b25\"},\"end\":4887,\"start\":4868},{\"end\":4915,\"start\":4887},{\"attributes\":{\"ref_id\":\"b0\"},\"end\":4939,\"start\":4915},{\"attributes\":{\"ref_id\":\"b26\"},\"end\":4966,\"start\":4939},{\"attributes\":{\"ref_id\":\"b2\"},\"end\":4984,\"start\":4966},{\"attributes\":{\"ref_id\":\"b12\"},\"end\":5523,\"start\":5501},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":7591,\"start\":7572},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":7614,\"start\":7591},{\"attributes\":{\"ref_id\":\"b5\"},\"end\":7634,\"start\":7614},{\"attributes\":{\"ref_id\":\"b22\"},\"end\":7661,\"start\":7634},{\"attributes\":{\"ref_id\":\"b16\"},\"end\":7680,\"start\":7661},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":7703,\"start\":7680},{\"attributes\":{\"ref_id\":\"b25\"},\"end\":7726,\"start\":7705},{\"attributes\":{\"ref_id\":\"b7\"},\"end\":8261,\"start\":8237},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":8865,\"start\":8832},{\"attributes\":{\"ref_id\":\"b6\"},\"end\":8882,\"start\":8865},{\"attributes\":{\"ref_id\":\"b32\"},\"end\":9142,\"start\":9126},{\"attributes\":{\"ref_id\":\"b3\"},\"end\":9168,\"start\":9142},{\"attributes\":{\"ref_id\":\"b13\"},\"end\":9185,\"start\":9168},{\"attributes\":{\"ref_id\":\"b29\"},\"end\":9207,\"start\":9185},{\"attributes\":{\"ref_id\":\"b18\"},\"end\":9224,\"start\":9207},{\"attributes\":{\"ref_id\":\"b28\"},\"end\":9511,\"start\":9488},{\"attributes\":{\"ref_id\":\"b25\"},\"end\":10255,\"start\":10235},{\"attributes\":{\"ref_id\":\"b7\"},\"end\":10888,\"start\":10864},{\"end\":12528,\"start\":12522},{\"end\":12534,\"start\":12528},{\"end\":12540,\"start\":12534},{\"end\":12546,\"start\":12540},{\"end\":12552,\"start\":12546},{\"end\":12558,\"start\":12552},{\"end\":12564,\"start\":12558},{\"end\":12570,\"start\":12564},{\"end\":12576,\"start\":12570},{\"end\":12582,\"start\":12576},{\"end\":27524,\"start\":27518},{\"end\":28241,\"start\":28232},{\"end\":28243,\"start\":28241},{\"end\":28245,\"start\":28243}]", "figure": "[{\"attributes\":{\"id\":\"fig_0\"},\"end\":30099,\"start\":29895},{\"attributes\":{\"id\":\"fig_1\"},\"end\":31981,\"start\":30100},{\"attributes\":{\"id\":\"fig_2\"},\"end\":32698,\"start\":31982},{\"attributes\":{\"id\":\"fig_3\"},\"end\":33411,\"start\":32699},{\"attributes\":{\"id\":\"fig_4\"},\"end\":34195,\"start\":33412},{\"attributes\":{\"id\":\"fig_5\"},\"end\":34524,\"start\":34196},{\"attributes\":{\"id\":\"fig_6\"},\"end\":34852,\"start\":34525},{\"attributes\":{\"id\":\"fig_7\"},\"end\":35178,\"start\":34853},{\"attributes\":{\"id\":\"fig_8\"},\"end\":35327,\"start\":35179},{\"attributes\":{\"id\":\"fig_9\"},\"end\":35440,\"start\":35328},{\"attributes\":{\"id\":\"tab_0\",\"type\":\"table\"},\"end\":35786,\"start\":35441},{\"attributes\":{\"id\":\"tab_1\",\"type\":\"table\"},\"end\":36039,\"start\":35787},{\"attributes\":{\"id\":\"tab_2\",\"type\":\"table\"},\"end\":37411,\"start\":36040}]", "paragraph": "[{\"end\":3919,\"start\":2593},{\"end\":4985,\"start\":3921},{\"end\":6398,\"start\":4987},{\"end\":8529,\"start\":6400},{\"end\":9401,\"start\":8531},{\"end\":10276,\"start\":9426},{\"end\":10310,\"start\":10278},{\"end\":10399,\"start\":10312},{\"end\":10446,\"start\":10401},{\"end\":10479,\"start\":10448},{\"end\":10561,\"start\":10481},{\"end\":10971,\"start\":10563},{\"end\":11022,\"start\":11019},{\"end\":11896,\"start\":11084},{\"end\":12887,\"start\":11898},{\"end\":13224,\"start\":12898},{\"end\":13695,\"start\":13286},{\"end\":13745,\"start\":13697},{\"end\":16232,\"start\":13781},{\"end\":17333,\"start\":16267},{\"end\":18283,\"start\":17369},{\"end\":19135,\"start\":18319},{\"end\":21648,\"start\":19228},{\"end\":23099,\"start\":21650},{\"end\":25198,\"start\":23178},{\"end\":28246,\"start\":25213},{\"end\":29446,\"start\":28248},{\"end\":29894,\"start\":29463}]", "formula": "[{\"attributes\":{\"id\":\"formula_0\"},\"end\":11018,\"start\":10972},{\"attributes\":{\"id\":\"formula_1\"},\"end\":11083,\"start\":11023}]", "table_ref": "[{\"attributes\":{\"ref_id\":\"tab_0\"},\"end\":10744,\"start\":10737},{\"attributes\":{\"ref_id\":\"tab_1\"},\"end\":12128,\"start\":12121},{\"attributes\":{\"ref_id\":\"tab_1\"},\"end\":23336,\"start\":23329}]", "section_header": "[{\"end\":2591,\"start\":2579},{\"end\":9424,\"start\":9404},{\"end\":12896,\"start\":12890},{\"end\":13284,\"start\":13227},{\"end\":13779,\"start\":13748},{\"end\":16265,\"start\":16235},{\"end\":17367,\"start\":17336},{\"end\":18317,\"start\":18286},{\"end\":19226,\"start\":19138},{\"end\":23176,\"start\":23102},{\"end\":25211,\"start\":25201},{\"end\":29461,\"start\":29449},{\"end\":29902,\"start\":29896},{\"end\":30114,\"start\":30101},{\"end\":31989,\"start\":31983},{\"end\":32706,\"start\":32700},{\"end\":33419,\"start\":33413},{\"end\":34203,\"start\":34197},{\"end\":34532,\"start\":34526},{\"end\":34860,\"start\":34854},{\"end\":35187,\"start\":35180},{\"end\":35336,\"start\":35329},{\"end\":35449,\"start\":35442},{\"end\":35795,\"start\":35788}]", "table": "[{\"end\":35786,\"start\":35643},{\"end\":36039,\"start\":35861},{\"end\":37411,\"start\":37377}]", "figure_caption": "[{\"end\":30099,\"start\":29904},{\"end\":31981,\"start\":30117},{\"end\":32698,\"start\":31991},{\"end\":33411,\"start\":32708},{\"end\":34195,\"start\":33421},{\"end\":34524,\"start\":34205},{\"end\":34852,\"start\":34534},{\"end\":35178,\"start\":34862},{\"end\":35327,\"start\":35190},{\"end\":35440,\"start\":35339},{\"end\":35643,\"start\":35451},{\"end\":35861,\"start\":35797},{\"end\":37377,\"start\":36042}]", "figure_ref": "[{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":7134,\"start\":7128},{\"attributes\":{\"ref_id\":\"fig_2\"},\"end\":8230,\"start\":8222},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":8679,\"start\":8671},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":9911,\"start\":9905},{\"attributes\":{\"ref_id\":\"fig_2\"},\"end\":10844,\"start\":10836},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":13037,\"start\":13031},{\"end\":13907,\"start\":13900},{\"end\":13920,\"start\":13911},{\"end\":14057,\"start\":14048},{\"end\":14393,\"start\":14386},{\"end\":14557,\"start\":14546},{\"end\":14584,\"start\":14578},{\"end\":14663,\"start\":14657},{\"end\":14682,\"start\":14673},{\"end\":15206,\"start\":15197},{\"attributes\":{\"ref_id\":\"fig_2\"},\"end\":16286,\"start\":16280},{\"end\":16422,\"start\":16416},{\"attributes\":{\"ref_id\":\"fig_2\"},\"end\":16669,\"start\":16660},{\"attributes\":{\"ref_id\":\"fig_2\"},\"end\":16769,\"start\":16762},{\"attributes\":{\"ref_id\":\"fig_2\"},\"end\":16890,\"start\":16882},{\"attributes\":{\"ref_id\":\"fig_3\"},\"end\":17410,\"start\":17398},{\"attributes\":{\"ref_id\":\"fig_3\"},\"end\":17637,\"start\":17630},{\"attributes\":{\"ref_id\":\"fig_3\"},\"end\":18131,\"start\":18122},{\"attributes\":{\"ref_id\":\"fig_4\"},\"end\":18386,\"start\":18374},{\"attributes\":{\"ref_id\":\"fig_4\"},\"end\":18756,\"start\":18749},{\"attributes\":{\"ref_id\":\"fig_4\"},\"end\":19074,\"start\":19067},{\"attributes\":{\"ref_id\":\"fig_4\"},\"end\":19133,\"start\":19125},{\"attributes\":{\"ref_id\":\"fig_5\"},\"end\":19267,\"start\":19258},{\"attributes\":{\"ref_id\":\"fig_5\"},\"end\":19687,\"start\":19678},{\"attributes\":{\"ref_id\":\"fig_5\"},\"end\":19868,\"start\":19859},{\"attributes\":{\"ref_id\":\"fig_5\"},\"end\":20083,\"start\":20075},{\"attributes\":{\"ref_id\":\"fig_6\"},\"end\":20775,\"start\":20766},{\"attributes\":{\"ref_id\":\"fig_6\"},\"end\":21017,\"start\":21008},{\"attributes\":{\"ref_id\":\"fig_6\"},\"end\":21275,\"start\":21266},{\"attributes\":{\"ref_id\":\"fig_6\"},\"end\":21548,\"start\":21539},{\"attributes\":{\"ref_id\":\"fig_7\"},\"end\":21769,\"start\":21760},{\"attributes\":{\"ref_id\":\"fig_7\"},\"end\":22197,\"start\":22190},{\"attributes\":{\"ref_id\":\"fig_7\"},\"end\":22702,\"start\":22695},{\"attributes\":{\"ref_id\":\"fig_7\"},\"end\":23004,\"start\":22995},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":23788,\"start\":23779},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":23847,\"start\":23840},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":24795,\"start\":24786},{\"end\":25044,\"start\":25038},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":25661,\"start\":25655},{\"end\":26461,\"start\":26454},{\"end\":26972,\"start\":26963},{\"attributes\":{\"ref_id\":\"fig_2\"},\"end\":27361,\"start\":27352},{\"end\":27517,\"start\":27509},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":28375,\"start\":28369},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":29098,\"start\":29092},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":29546,\"start\":29539},{\"attributes\":{\"ref_id\":\"fig_7\"},\"end\":29795,\"start\":29789}]", "bib_author_first_name": "[{\"end\":37971,\"start\":37970},{\"end\":37986,\"start\":37985},{\"end\":37988,\"start\":37987},{\"end\":37998,\"start\":37997},{\"end\":38371,\"start\":38370},{\"end\":38381,\"start\":38380},{\"end\":38391,\"start\":38390},{\"end\":38782,\"start\":38781},{\"end\":38784,\"start\":38783},{\"end\":38793,\"start\":38792},{\"end\":38800,\"start\":38799},{\"end\":39160,\"start\":39159},{\"end\":39180,\"start\":39176},{\"end\":39182,\"start\":39181},{\"end\":39190,\"start\":39189},{\"end\":39439,\"start\":39438},{\"end\":39441,\"start\":39440},{\"end\":39452,\"start\":39451},{\"end\":39757,\"start\":39756},{\"end\":39759,\"start\":39758},{\"end\":39770,\"start\":39769},{\"end\":39772,\"start\":39771},{\"end\":39784,\"start\":39783},{\"end\":39786,\"start\":39785},{\"end\":40106,\"start\":40105},{\"end\":40108,\"start\":40107},{\"end\":40116,\"start\":40115},{\"end\":40131,\"start\":40130},{\"end\":40519,\"start\":40518},{\"end\":40530,\"start\":40529},{\"end\":40532,\"start\":40531},{\"end\":40919,\"start\":40918},{\"end\":40921,\"start\":40920},{\"end\":40933,\"start\":40932},{\"end\":40935,\"start\":40934},{\"end\":41193,\"start\":41192},{\"end\":41207,\"start\":41206},{\"end\":41439,\"start\":41438},{\"end\":41441,\"start\":41440},{\"end\":41449,\"start\":41448},{\"end\":41459,\"start\":41458},{\"end\":41461,\"start\":41460},{\"end\":41910,\"start\":41909},{\"end\":41929,\"start\":41928},{\"end\":41939,\"start\":41936},{\"end\":42419,\"start\":42418},{\"end\":42431,\"start\":42430},{\"end\":42444,\"start\":42443},{\"end\":42711,\"start\":42710},{\"end\":42719,\"start\":42718},{\"end\":42726,\"start\":42725},{\"end\":43101,\"start\":43100},{\"end\":43110,\"start\":43109},{\"end\":43423,\"start\":43422},{\"end\":43432,\"start\":43431},{\"end\":43443,\"start\":43442},{\"end\":43624,\"start\":43623},{\"end\":43634,\"start\":43633},{\"end\":43652,\"start\":43644},{\"end\":43664,\"start\":43663},{\"end\":43972,\"start\":43971},{\"end\":43983,\"start\":43979},{\"end\":43998,\"start\":43997},{\"end\":44000,\"start\":43999},{\"end\":44407,\"start\":44406},{\"end\":44409,\"start\":44408},{\"end\":44417,\"start\":44416},{\"end\":44429,\"start\":44428},{\"end\":44431,\"start\":44430},{\"end\":44887,\"start\":44886},{\"end\":44889,\"start\":44888},{\"end\":44896,\"start\":44895},{\"end\":44898,\"start\":44897},{\"end\":44906,\"start\":44905},{\"end\":44908,\"start\":44907},{\"end\":45166,\"start\":45165},{\"end\":45168,\"start\":45167},{\"end\":45177,\"start\":45176},{\"end\":45187,\"start\":45186},{\"end\":45482,\"start\":45481},{\"end\":45484,\"start\":45483},{\"end\":45495,\"start\":45494},{\"end\":45497,\"start\":45496},{\"end\":45721,\"start\":45720},{\"end\":45723,\"start\":45722},{\"end\":45746,\"start\":45745},{\"end\":45748,\"start\":45747},{\"end\":46030,\"start\":46029},{\"end\":46032,\"start\":46031},{\"end\":46040,\"start\":46039},{\"end\":46052,\"start\":46051},{\"end\":46054,\"start\":46053},{\"end\":46350,\"start\":46349},{\"end\":46360,\"start\":46359},{\"end\":46372,\"start\":46371},{\"end\":46374,\"start\":46373},{\"end\":46642,\"start\":46629},{\"end\":46651,\"start\":46648},{\"end\":46907,\"start\":46906},{\"end\":46918,\"start\":46917},{\"end\":47239,\"start\":47238},{\"end\":47241,\"start\":47240},{\"end\":47255,\"start\":47254},{\"end\":47267,\"start\":47266},{\"end\":47269,\"start\":47268},{\"end\":47579,\"start\":47578},{\"end\":47592,\"start\":47591},{\"end\":47604,\"start\":47603},{\"end\":47912,\"start\":47911},{\"end\":47914,\"start\":47913},{\"end\":48203,\"start\":48202},{\"end\":48213,\"start\":48212},{\"end\":48223,\"start\":48222},{\"end\":48512,\"start\":48511},{\"end\":48518,\"start\":48517},{\"end\":48524,\"start\":48523},{\"end\":48530,\"start\":48529}]", "bib_author_last_name": "[{\"end\":37983,\"start\":37972},{\"end\":37995,\"start\":37989},{\"end\":38005,\"start\":37999},{\"end\":38378,\"start\":38372},{\"end\":38388,\"start\":38382},{\"end\":38402,\"start\":38392},{\"end\":38790,\"start\":38785},{\"end\":38797,\"start\":38794},{\"end\":38806,\"start\":38801},{\"end\":39174,\"start\":39161},{\"end\":39187,\"start\":39183},{\"end\":39449,\"start\":39442},{\"end\":39458,\"start\":39453},{\"end\":39767,\"start\":39760},{\"end\":39781,\"start\":39773},{\"end\":39796,\"start\":39787},{\"end\":40113,\"start\":40109},{\"end\":40128,\"start\":40117},{\"end\":40139,\"start\":40132},{\"end\":40527,\"start\":40520},{\"end\":40538,\"start\":40533},{\"end\":40930,\"start\":40922},{\"end\":40943,\"start\":40936},{\"end\":41204,\"start\":41194},{\"end\":41219,\"start\":41208},{\"end\":41446,\"start\":41442},{\"end\":41456,\"start\":41450},{\"end\":41469,\"start\":41462},{\"end\":41926,\"start\":41911},{\"end\":41934,\"start\":41930},{\"end\":41947,\"start\":41940},{\"end\":42428,\"start\":42420},{\"end\":42441,\"start\":42432},{\"end\":42454,\"start\":42445},{\"end\":42716,\"start\":42712},{\"end\":42723,\"start\":42720},{\"end\":42730,\"start\":42727},{\"end\":43107,\"start\":43102},{\"end\":43118,\"start\":43111},{\"end\":43429,\"start\":43424},{\"end\":43440,\"start\":43433},{\"end\":43447,\"start\":43444},{\"end\":43631,\"start\":43625},{\"end\":43642,\"start\":43635},{\"end\":43661,\"start\":43653},{\"end\":43977,\"start\":43973},{\"end\":43995,\"start\":43984},{\"end\":44006,\"start\":44001},{\"end\":44414,\"start\":44410},{\"end\":44426,\"start\":44418},{\"end\":44439,\"start\":44432},{\"end\":44893,\"start\":44890},{\"end\":44903,\"start\":44899},{\"end\":44919,\"start\":44909},{\"end\":45174,\"start\":45169},{\"end\":45184,\"start\":45178},{\"end\":45193,\"start\":45188},{\"end\":45492,\"start\":45485},{\"end\":45507,\"start\":45498},{\"end\":45743,\"start\":45724},{\"end\":45754,\"start\":45749},{\"end\":46037,\"start\":46033},{\"end\":46049,\"start\":46041},{\"end\":46061,\"start\":46055},{\"end\":46357,\"start\":46351},{\"end\":46369,\"start\":46361},{\"end\":46385,\"start\":46375},{\"end\":46646,\"start\":46643},{\"end\":46655,\"start\":46652},{\"end\":46915,\"start\":46908},{\"end\":46924,\"start\":46919},{\"end\":47252,\"start\":47242},{\"end\":47264,\"start\":47256},{\"end\":47280,\"start\":47270},{\"end\":47589,\"start\":47580},{\"end\":47601,\"start\":47593},{\"end\":47612,\"start\":47605},{\"end\":47920,\"start\":47915},{\"end\":48210,\"start\":48204},{\"end\":48220,\"start\":48214},{\"end\":48232,\"start\":48224},{\"end\":48515,\"start\":48513},{\"end\":48521,\"start\":48519},{\"end\":48527,\"start\":48525},{\"end\":48536,\"start\":48531}]", "bib_entry": "[{\"attributes\":{\"doi\":\"10.1007/s00704-019-02939-0\",\"id\":\"b0\",\"matched_paper_id\":198176255},\"end\":38279,\"start\":37882},{\"attributes\":{\"doi\":\"10.1088/1748-9326/9/3/034011\",\"id\":\"b1\",\"matched_paper_id\":4861886},\"end\":38670,\"start\":38281},{\"attributes\":{\"doi\":\"10.1016/j.envres.2021.111573\",\"id\":\"b2\",\"matched_paper_id\":235654484},\"end\":39080,\"start\":38672},{\"attributes\":{\"id\":\"b3\",\"matched_paper_id\":211554002},\"end\":39357,\"start\":39082},{\"attributes\":{\"doi\":\"10.1038/ngeo866\",\"id\":\"b4\",\"matched_paper_id\":27061892},\"end\":39654,\"start\":39359},{\"attributes\":{\"doi\":\"10.1007/s00382-010-0915-y\",\"id\":\"b5\",\"matched_paper_id\":129856082},\"end\":40051,\"start\":39656},{\"attributes\":{\"id\":\"b6\",\"matched_paper_id\":11598600},\"end\":40449,\"start\":40053},{\"attributes\":{\"id\":\"b7\"},\"end\":40854,\"start\":40451},{\"attributes\":{\"doi\":\"10.1016/j.wace.2015.08.001\",\"id\":\"b8\",\"matched_paper_id\":126927916},\"end\":41166,\"start\":40856},{\"attributes\":{\"doi\":\"10.1162/neco.1997.9.8.1735\",\"id\":\"b9\",\"matched_paper_id\":1915014},\"end\":41401,\"start\":41168},{\"attributes\":{\"doi\":\"10.3390/ani9060322\",\"id\":\"b10\",\"matched_paper_id\":182951087},\"end\":41651,\"start\":41403},{\"attributes\":{\"id\":\"b11\"},\"end\":42378,\"start\":41653},{\"attributes\":{\"doi\":\"10.1002/wea.3629\",\"id\":\"b12\",\"matched_paper_id\":209923433},\"end\":42623,\"start\":42380},{\"attributes\":{\"doi\":\"10.1016/j.neucom.2019.12.129\",\"id\":\"b13\",\"matched_paper_id\":218947051},\"end\":42980,\"start\":42625},{\"attributes\":{\"id\":\"b14\"},\"end\":43354,\"start\":42982},{\"attributes\":{\"id\":\"b15\"},\"end\":43571,\"start\":43356},{\"attributes\":{\"doi\":\"10.1175/JAMC-D-17-0035.1\",\"id\":\"b16\",\"matched_paper_id\":125410751},\"end\":43907,\"start\":43573},{\"attributes\":{\"doi\":\"10.1126/sciadv.1700066\",\"id\":\"b17\",\"matched_paper_id\":2334180},\"end\":44215,\"start\":43909},{\"attributes\":{\"doi\":\"10.1007/s40747-021-00365-2\",\"id\":\"b18\",\"matched_paper_id\":234854915},\"end\":44798,\"start\":44217},{\"attributes\":{\"id\":\"b19\",\"matched_paper_id\":55278238},\"end\":45085,\"start\":44800},{\"attributes\":{\"doi\":\"10.1002/joc.3931\",\"id\":\"b20\"},\"end\":45340,\"start\":45087},{\"attributes\":{\"doi\":\"10.1002/joc.3931\",\"id\":\"b21\"},\"end\":45445,\"start\":45342},{\"attributes\":{\"doi\":\"10.1175/JCLI-D-12-00383.1\",\"id\":\"b22\",\"matched_paper_id\":129438880},\"end\":45677,\"start\":45447},{\"attributes\":{\"doi\":\"10.1038/s41467-020-16970-7\",\"id\":\"b23\",\"matched_paper_id\":220306081},\"end\":45948,\"start\":45679},{\"attributes\":{\"doi\":\"10.1175/JCLI-D-20-0412.1\",\"id\":\"b24\",\"matched_paper_id\":233609830},\"end\":46286,\"start\":45950},{\"attributes\":{\"doi\":\"10.1038/srep26153\",\"id\":\"b25\",\"matched_paper_id\":4073292},\"end\":46591,\"start\":46288},{\"attributes\":{\"doi\":\"10.1016/j.atmosres.2020.105078\",\"id\":\"b26\",\"matched_paper_id\":225735204},\"end\":46853,\"start\":46593},{\"attributes\":{\"doi\":\"10.1088/1748-9326/9/4/041001\",\"id\":\"b27\",\"matched_paper_id\":154676614},\"end\":47133,\"start\":46855},{\"attributes\":{\"doi\":\"10.1002/asl.232\",\"id\":\"b28\",\"matched_paper_id\":56330807},\"end\":47530,\"start\":47135},{\"attributes\":{\"doi\":\"10.1007/s10462-020-09838-1\",\"id\":\"b29\",\"matched_paper_id\":218605692},\"end\":47826,\"start\":47532},{\"attributes\":{\"doi\":\"10.1016/j.enbuild.2021.110774\",\"id\":\"b30\",\"matched_paper_id\":233535052},\"end\":48151,\"start\":47828},{\"attributes\":{\"doi\":\"10.3168/jds.2015-9331\",\"id\":\"b31\",\"matched_paper_id\":21269433},\"end\":48432,\"start\":48153},{\"attributes\":{\"doi\":\"10.1162/neco_a_01199\",\"id\":\"b32\",\"matched_paper_id\":160013244},\"end\":48761,\"start\":48434},{\"attributes\":{\"id\":\"b33\"},\"end\":49034,\"start\":48763}]", "bib_title": "[{\"end\":37968,\"start\":37882},{\"end\":38368,\"start\":38281},{\"end\":38779,\"start\":38672},{\"end\":39157,\"start\":39082},{\"end\":39436,\"start\":39359},{\"end\":39754,\"start\":39656},{\"end\":40103,\"start\":40053},{\"end\":40916,\"start\":40856},{\"end\":41190,\"start\":41168},{\"end\":41436,\"start\":41403},{\"end\":42416,\"start\":42380},{\"end\":42708,\"start\":42625},{\"end\":43420,\"start\":43356},{\"end\":43621,\"start\":43573},{\"end\":43969,\"start\":43909},{\"end\":44404,\"start\":44217},{\"end\":44884,\"start\":44800},{\"end\":45479,\"start\":45447},{\"end\":45718,\"start\":45679},{\"end\":46027,\"start\":45950},{\"end\":46347,\"start\":46288},{\"end\":46627,\"start\":46593},{\"end\":46904,\"start\":46855},{\"end\":47236,\"start\":47135},{\"end\":47576,\"start\":47532},{\"end\":47909,\"start\":47828},{\"end\":48200,\"start\":48153},{\"end\":48509,\"start\":48434}]", "bib_author": "[{\"end\":37985,\"start\":37970},{\"end\":37997,\"start\":37985},{\"end\":38007,\"start\":37997},{\"end\":38380,\"start\":38370},{\"end\":38390,\"start\":38380},{\"end\":38404,\"start\":38390},{\"end\":38792,\"start\":38781},{\"end\":38799,\"start\":38792},{\"end\":38808,\"start\":38799},{\"end\":39176,\"start\":39159},{\"end\":39189,\"start\":39176},{\"end\":39193,\"start\":39189},{\"end\":39451,\"start\":39438},{\"end\":39460,\"start\":39451},{\"end\":39769,\"start\":39756},{\"end\":39783,\"start\":39769},{\"end\":39798,\"start\":39783},{\"end\":40115,\"start\":40105},{\"end\":40130,\"start\":40115},{\"end\":40141,\"start\":40130},{\"end\":40529,\"start\":40518},{\"end\":40540,\"start\":40529},{\"end\":40932,\"start\":40918},{\"end\":40945,\"start\":40932},{\"end\":41206,\"start\":41192},{\"end\":41221,\"start\":41206},{\"end\":41448,\"start\":41438},{\"end\":41458,\"start\":41448},{\"end\":41471,\"start\":41458},{\"end\":41928,\"start\":41909},{\"end\":41936,\"start\":41928},{\"end\":41949,\"start\":41936},{\"end\":42430,\"start\":42418},{\"end\":42443,\"start\":42430},{\"end\":42456,\"start\":42443},{\"end\":42718,\"start\":42710},{\"end\":42725,\"start\":42718},{\"end\":42732,\"start\":42725},{\"end\":43109,\"start\":43100},{\"end\":43120,\"start\":43109},{\"end\":43431,\"start\":43422},{\"end\":43442,\"start\":43431},{\"end\":43449,\"start\":43442},{\"end\":43633,\"start\":43623},{\"end\":43644,\"start\":43633},{\"end\":43663,\"start\":43644},{\"end\":43667,\"start\":43663},{\"end\":43979,\"start\":43971},{\"end\":43997,\"start\":43979},{\"end\":44008,\"start\":43997},{\"end\":44416,\"start\":44406},{\"end\":44428,\"start\":44416},{\"end\":44441,\"start\":44428},{\"end\":44895,\"start\":44886},{\"end\":44905,\"start\":44895},{\"end\":44921,\"start\":44905},{\"end\":45176,\"start\":45165},{\"end\":45186,\"start\":45176},{\"end\":45195,\"start\":45186},{\"end\":45494,\"start\":45481},{\"end\":45509,\"start\":45494},{\"end\":45745,\"start\":45720},{\"end\":45756,\"start\":45745},{\"end\":46039,\"start\":46029},{\"end\":46051,\"start\":46039},{\"end\":46063,\"start\":46051},{\"end\":46359,\"start\":46349},{\"end\":46371,\"start\":46359},{\"end\":46387,\"start\":46371},{\"end\":46648,\"start\":46629},{\"end\":46657,\"start\":46648},{\"end\":46917,\"start\":46906},{\"end\":46926,\"start\":46917},{\"end\":47254,\"start\":47238},{\"end\":47266,\"start\":47254},{\"end\":47282,\"start\":47266},{\"end\":47591,\"start\":47578},{\"end\":47603,\"start\":47591},{\"end\":47614,\"start\":47603},{\"end\":47922,\"start\":47911},{\"end\":48212,\"start\":48202},{\"end\":48222,\"start\":48212},{\"end\":48234,\"start\":48222},{\"end\":48517,\"start\":48511},{\"end\":48523,\"start\":48517},{\"end\":48529,\"start\":48523},{\"end\":48538,\"start\":48529}]", "bib_venue": "[{\"end\":38054,\"start\":38033},{\"end\":38448,\"start\":38432},{\"end\":38847,\"start\":38836},{\"end\":39211,\"start\":39193},{\"end\":39485,\"start\":39475},{\"end\":39831,\"start\":39823},{\"end\":40233,\"start\":40141},{\"end\":40516,\"start\":40451},{\"end\":40990,\"start\":40971},{\"end\":41260,\"start\":41247},{\"end\":41504,\"start\":41489},{\"end\":41907,\"start\":41653},{\"end\":42479,\"start\":42472},{\"end\":42774,\"start\":42760},{\"end\":43098,\"start\":42982},{\"end\":43454,\"start\":43449},{\"end\":43715,\"start\":43691},{\"end\":44037,\"start\":44030},{\"end\":44486,\"start\":44467},{\"end\":44927,\"start\":44921},{\"end\":45163,\"start\":45087},{\"end\":45374,\"start\":45360},{\"end\":45540,\"start\":45534},{\"end\":45792,\"start\":45782},{\"end\":46093,\"start\":46087},{\"end\":46418,\"start\":46404},{\"end\":46696,\"start\":46687},{\"end\":46970,\"start\":46954},{\"end\":47311,\"start\":47297},{\"end\":47656,\"start\":47640},{\"end\":47963,\"start\":47951},{\"end\":48266,\"start\":48255},{\"end\":48571,\"start\":48558},{\"end\":48897,\"start\":48763}]"}}}, "year": 2023, "month": 12, "day": 17}