{"id": 250572839, "updated": "2023-03-03 15:18:59.576", "metadata": {"title": "Computationally Efficient Stability-Based Nonlinear Model Predictive Control Design for Quadrotor Aerial Vehicles", "authors": "[{\"first\":\"Mahmoud\",\"last\":\"Gomaa\",\"middle\":[\"A.\",\"K.\"]},{\"first\":\"Oscar\",\"last\":\"De Silva\",\"middle\":[]},{\"first\":\"George\",\"last\":\"Mann\",\"middle\":[\"K.\",\"I.\"]},{\"first\":\"Raymond\",\"last\":\"Gosine\",\"middle\":[\"G.\"]}]", "venue": "IEEE Transactions on Control Systems Technology", "journal": "IEEE Transactions on Control Systems Technology", "publication_date": {"year": 2023, "month": 3, "day": 1}, "abstract": "This article presents the design of a stability-guaranteed nonlinear model predictive controller for quadrotor-type microaerial vehicles to operate robustly on fast trajectories. The basic controller structure operates without having to use terminal conditions in the optimization problem. As a result, the controller is computationally less demanding and provides more stable closed-loop performance than traditional nonlinear predictive control schemes. This article presents a detailed stability analysis without terminal costs or terminal constraints and proves the asymptotic stability and necessary conditions for the recursive feasibility of the system. This article derives the growth-bound sequence that enables obtaining the shortest possible prediction horizon for stability. The proposed analysis provides the necessary conditions to implement the controller while using the shortest stabilizing prediction horizon compared to major traditional predictive control schemes reported in the literature. This particular feature enables the proposed controller to perform fast optimization and, hence, the capability to implement fast trajectories using feedback regularization. In order to demonstrate the validity of this new proposed control scheme, first, several MATLAB simulations are conducted to demonstrate the improved performance of the controller especially when the quadrotor vehicle follows fast trajectories. Real-time lab experiments are also conducted to validate the performance of the proposed scheme for point stabilization (hovering) and trajectory tracking problems. The results show that the proposed scheme can stabilize the system with a relatively short prediction horizon, a fast convergence rate, and a small tracking error.", "fields_of_study": "[\"Computer Science\"]", "external_ids": {"arxiv": null, "mag": null, "acl": null, "pubmed": null, "pubmedcentral": null, "dblp": "journals/tcst/GomaaSMG23", "doi": "10.1109/tcst.2022.3188399"}}, "content": {"source": {"pdf_hash": "7a23c8074c2c0a5c2ebc53651828ba7adea74f88", "pdf_src": "IEEE", "pdf_uri": null, "oa_url_match": false, "oa_info": null}, "grobid": {"id": "d9dc1152935ea9f791234433193c38ed627fa627", "type": "plain-text", "url": "s3://ai2-s2-pdf-extraction-prod/parse-results/s2orc_worker/7a23c8074c2c0a5c2ebc53651828ba7adea74f88.txt", "contents": "\nComputationally Efficient Stability-Based Nonlinear Model Predictive Control Design for Quadrotor Aerial Vehicles\nMARCH 2023\n\nMahmoud A K Gomaa \nMember, IEEEOscar De Silva \nMember, IEEEGeorge K I Mann \nRaymond G Gosine \nComputationally Efficient Stability-Based Nonlinear Model Predictive Control Design for Quadrotor Aerial Vehicles\n\nIEEE TRANSACTIONS ON CONTROL SYSTEMS TECHNOLOGY\n312MARCH 202310.1109/TCST.2022.3188399615\nThis article presents the design of a stability-guaranteed nonlinear model predictive controller for quadrotor-type microaerial vehicles to operate robustly on fast trajectories. The basic controller structure operates without having to use terminal conditions in the optimization problem. As a result, the controller is computationally less demanding and provides more stable closed-loop performance than traditional nonlinear predictive control schemes. This article presents a detailed stability analysis without terminal costs or terminal constraints and proves the asymptotic stability and necessary conditions for the recursive feasibility of the system. This article derives the growth-bound sequence that enables obtaining the shortest possible prediction horizon for stability. The proposed analysis provides the necessary conditions to implement the controller while using the shortest stabilizing prediction horizon compared to major traditional predictive control schemes reported in the literature. This particular feature enables the proposed controller to perform fast optimization and, hence, the capability to implement fast trajectories using feedback regularization. In order to demonstrate the validity of this new proposed control scheme, first, several MATLAB simulations are conducted to demonstrate the improved performance of the controller especially when the quadrotor vehicle follows fast trajectories. Real-time lab experiments are also conducted to validate the performance of the proposed scheme for point stabilization (hovering) and trajectory tracking problems. The results show that the proposed scheme can stabilize the system with a relatively short prediction horizon, a fast convergence rate, and a small tracking error.Index Terms-Microaerial vehicle (MAV), motion control, nonlinear model predictive control (MPC), nonlinear systems, stability analysis.1063-6536\n\nI. INTRODUCTION\n\nM ICROAERIAL vehicles (MAVs) are multirotor aircrafts that are designed to increase maneuverability in constrained environments while carrying small payloads. They Manuscript  can be used in a wide range of indoor/outdoor applications including, inspection and surveillance missions [1], package delivery [2], and aerial photography [3]. An MAV can be controlled remotely by a human operator or autonomously by its independent controller [4]. Each rotor speed can be controlled to generate a desired total thrust and torque, so changing the blade pitch requires neither mechanisms nor flaps. The use of multirotor MAVs, such as quadrotors, assures simple configurations, agile dynamics, limited maintenance requirements, and low safety concerns [5]. On the other hand, the control of quadrotor MAVs is quite challenging because the system is open-loop unstable, has 3-D geometric nonlinearity invoked by the rigid body dynamics, and is underactuated, i.e., it has only four control actions (inputs) from the four rotors and six degrees of freedom parameterizing the quadrotor pose in space. As a result, an inner-outer loop control structure, i.e., cascade control, is often used for the control of quadrotor MAVs to facilitate the design procedure [6]. The outer loop (position controller) generates the reference thrust and roll/pitch angles, while the inner loop (attitude controller) tracks these input commands and computes the torques required to obtain a stable desired attitude [6]. Many studies [7]- [16] have been conducted on the control problem of MAVs to improve their stabilization and tracking performance, i.e., the stability characteristics of the vehicle under different operating speeds, tracking error, and computational time. Some of this research studies resulted several advanced quadrotor MAV control algorithms, such as nonlinear PID control [7], high gain feedback control [8], robust control [9], [10], adaptive control [11], [12], and feedback linearization, backstepping control, and sliding mode control [13]- [16]. Despite their promising results and performance, often, these controllers require intensive tuning in order to accomplish stable performance, which is quite challenging. Moreover, the majority of those controllers cannot guarantee input or state constraints and demands careful selection of feasible trajectories for stable maneuvering.\n\nOn the other hand, the control problem of the quadrotor MAV could be formulated as an optimization problem with a predefined objective function, where the minimization of this function over a finite time horizon leads to the optimal control input values. Moreover, input and state constraints can be included directly in the optimization problem, which is crucial for real systems with physical constraints. This optimization-based control algorithm is called model predictive control (MPC) or receding horizon control since the prediction horizon keeps shifting over the processing time [17], [18]. The objective function of the MAV could be designed based on the tracking error and control effort [19], minimum jerk [20], or minimum-time mission accomplishment [21]. The minimum-time optimization problem is important for certain applications, including package delivery, landing, and searchand-rescue problems.\n\nNonlinear MPC (NMPC) is an MPC variant that uses the nonlinear system model in its prediction [22]. NMPC showed promising stabilization and tracking performance for ground and aerial vehicles [19], [23], [24]. The work in [25] highlights impressive collision and obstacle avoidance performance, where an NMPC scheme was proposed for the quadrotor MAV trajectory tracking that allows aggressive navigation within cluttered environments with unknown obstacles. The proposed scheme was formulated on the special Euclidean group SE (3) for quadrotor trajectory tracking, while considering the state and input constraints, with constant disturbance rejection and aggressive maneuvers to support obstacle avoidance performance.\n\nFor operations, an NMPC requires to iteratively solve in real time a nonconvex, nonlinear, dynamic optimal control problem (OCP) on a finite prediction horizon, and only the first element of the computed control sequence is applied to the system [22]. This process needs to be repeated for each subsequent time instant during control. Hence, NMPC demands more computational time for the optimization, and implementing such a controller on a fast-moving quadcopter in real time needs to address several challenges, as explained in the following.\n\nThe first challenge is related to the closed-loop stability of the control system. Generally, closed-loop stability of receding horizon problems is not ensured except for special cases under certain conditions. For instance, closed-loop stability of the NMPC scheme with an infinite horizon (prediction horizon tends to infinity) can be ensured under some controllability assumptions (e.g., there exists a suitable upper bound on the optimal value function) [26]. However, the infinite horizon control problem is not usually practical for online implementations mainly due to the computational complexity, which is heavily governed by the length of the prediction horizon and the number of manipulated variables. As a result, relevant concern has been given to the formulation of finite receding horizon problems whose solutions provide stabilizing control. Researchers were able to ensure the closed-loop stability by adding terminal cost, terminal constraint, terminal set, or a combination of them to the optimization problem [27] (for a thorough review see [17]). However, imposing terminal cost requires the solution of the algebraic Riccati equation to calculate the terminal weight [28]. Imposing terminal constraints makes the real-time implementation of the control problem difficult since it requires obtaining a satisfying solution to the nonlinear equality constraints in a limited computational time frame. Under those conditions, the optimization process may terminate prematurely before reaching an optimized solution that may affect the system stability due to the errors caused by the forced termination of the optimization [29]. On the other hand, designing the finite receding horizon control problem without stabilizing terminal costs or constraints [30]- [32] is computationally less demanding and provides larger stability regions and better closed-loop performance. In this article, we are addressing these issues by designing a novel NMPC without terminal costs or terminal constraints incorporated in its cost function. In this respect, distinct formulations of the running cost are proposed for the stability of the NMPC. The techniques proposed in [30]- [32] have been adopted to perform the stability analysis on the proposed tailored cost function to ensure the asymptotic stability of the quadrotor MAV, i.e., whenever close to the neighborhood of an equilibrium point stay in this neighborhood or otherwise convergence to this equilibrium point [22,Sec. 2.3].\n\nThe second challenge is addressing the computational complexity of the finite receding horizon problem. In the literature, adopting an NMPC with stabilizing terminal costs has been more popular than NMPCs with terminal constraints since the former design is less complex. However, the prediction horizon must be large enough to achieve the closed-loop stability [19]. It was proven in [33] that extending the prediction horizon of the finite receding horizon problem leads to a good approximation to the optimal solution of the infinite receding horizon problem. However, extending the prediction horizon increases the complexity of the optimization problem and demands a higher computational time to obtain the optimal solution [34]. On the other hand, most small-sized aerial vehicles carry low-cost computer resources and demand fast control actions to maintain stable and smooth flights. However, MPC without stabilizing terminal costs or constraints ensures asymptotic stability for much shorter prediction horizons [32] while yielding an approximately optimal infinite-horizon performance [18]. This article derives a growth bound on the proposed NMPC value function that can be used to determine the minimal stabilizing prediction horizon for the finite optimization problem of the MAV that guarantees asymptotic stability.\n\nThe third challenge is related to the recursive feasibility of the solution of the OCP for any given constraints. The feasibility of the infinite horizon problem may turn into a critical concern while implementing the receding horizon schemes because of using a finite horizon. Finite receding horizon may result in loss of feasibility [35] or lead to an unsolvable infinite horizon OCP [28]. The recursive feasibility is automatically ensured by imposing terminal costs or constraints on the optimization problem or by using a long enough prediction horizon [22], [28]. However, using terminal conditions reduces the region of attraction, i.e., reduces the feasible operating region of the MPC scheme. On the other hand, MPC schemes without terminal conditions can yield large (even unbounded) feasibility and stability regions for finite prediction horizon [22]. Grüne and Pannek [22] and Grüne [36] have shown that the recursive feasibility of an NMPC scheme without terminal conditions can be inherited from the closed-loop stability where the finite horizon cost acts as a Lyapunov function. Therefore, the calculation of the stabilizing prediction horizon from the derived growth bound can ensure both asymptotic stability and recursive feasibility.\n\nWhile addressing the above three challenges, this article develops a stability-guaranteed NMPC scheme that allows controlling the quadcopter MAV on fast trajectories with superior performance. Thus, this article results in the following key contributions.\n\n1) Proposing the design of a novel computationally efficient NMPC scheme (by tailoring an objective function) with improved stability characteristics for the control of quadrotor MAVs without the use of terminal costs or constraints while ensuring recursive feasibility. The design provides a unique analytical methodology that requires minimal tuning parameters compared to other controllers in the literature. 2) Performing the stability analysis required to prove the asymptotic stability of the proposed controller by deriving a growth bound on the proposed MPC value function. 3) Calculating the minimal stabilizing prediction horizon, which effectively minimizes the computational cost, and providing a formula for the estimation of the performance of the closed-loop scheme. 4) Providing intensive numerical and experimental validations of the proposed controller at various initial conditions, system configurations, and various trajectories, and demonstrating its robustness against the traditional NMPC scheme used in [19].\n\n\nII. RELATED WORK\n\nPioneering work reported in [37] and [38] introduced a novel method to design a finite OCP for MPC without using the stabilizing terminal costs or constraints. This method adopts a Lyapunov function to represent the finite horizon value function without terminal conditions, which allows the stability to be implied by the monotonicity of the value function [38]. Grimm et al. [38] showed that the asymptotic stability of the closed-loop system can be guaranteed for a sufficiently long prediction horizon. However, this initial study did not provide explicit bounds for the length of the prediction horizon. A series of recent studies [30]- [32] has ensured the closed-loop asymptotic stability relying on the concept of cost controllability, i.e., local controllability condition (see [39] and [40] for thorough details). This was achieved through computing a growth function that bounds the MPC value function. This growth function can then be used to calculate a performance measure of the finite horizon scheme, i.e., the proximity to the infinite horizon problem. This in turn provided a way to estimate a stabilizing prediction horizon that guarantees a monotonically decreasing value function and closed-loop asymptotic stability. This particular feature allows the NMPC to be implemented at a faster rate for nonlinear robotic systems while ensuring closed-loop stability [22,Sec. 7.4].\n\nContinued with this pioneering work, research work in [23] and [41] effectively demonstrated a real-time implementation of this method to stabilize a ground robotic system to operate fast on a given trajectory. This ground robot uses the holonomic/nonholonomic kinematic model, where, at zero inputs, this robot is already stabilized at the current equilibrium point (which is not the same in the case of MAVs, where there should be a feedback control to stabilize the vehicle at the current equilibrium point). This ground robotic application constructed specific open-loop trajectories to derive the growth bounds on the proposed value function and then verify the cost controllability condition. The proposed scheme was implemented successfully on a ground robot for a point stabilization problem. However, the method was not tested on trajectory tracking problems.\n\nAn early study in [42] has proposed the first application of NMPC for the position and heading tracking control of an aerial-type vehicle, e.g., rotorcraft-based unmanned aerial vehicle. This traditional NMPC demonstrated in this work was then adopted by many researchers, and these conducted researches were able to demonstrate successful trajectory control of quadrotor MAV [19], [43], [44]. However, this traditional NMPC has incorporated terminal costs in the MPC objective function, which caused those controllers to adopt a longer prediction horizon to achieve the expected stability of the system. In the absence of proper stability analysis, these methods require adopting a trial-and-error approach in order to obtain a prediction horizon value for satisfactory performance. This particular drawback generally prohibits the traditional NMPC-based MAVs to operate at a higher frequency owing to their higher computational cost, as we have demonstrated in our experimental results in this article. Similarly, the work in [25] did not incorporate terminal costs nor terminal constraints; however, it used a very large prediction horizon to ensure stability and avoid collision with obstacles. A recent work in [45] has proposed a robust NMPC scheme for the visual servoing of quadrotors MAVs subject to external disturbances. The developed NMPC scheme incorporates terminal costs and constraints, which reduces the feasibility region of the closed-loop system, as shown in the recursive feasibility and stability analysis in [45]. The system was proven to be recursive feasible and stable only under some derived conditions, e.g., the system is locally Lipschitz continuous with a Lipschitz constant bounded by the maximum eigenvalues of the terminal weight matrix. The proposed controller was numerically able to stabilize the system within a small region around the desired position. However, in the experimental validation, it was only able to steer the quadrotor to the neighborhood of the desired position. This shortcoming might have happened due to excluding the terminal constraint from the optimization problem in the real-time implementation of the experiment. Another recent work in [46] explains an NMPC scheme without terminal constraints. However, the controller contained a feedback linearized system that requires the vehicle to be at an initial position closer to an equilibrium point in order for the system to be stable. This will result in a narrow stability region for the vehicle and make the flying envelope smaller. The control bounds are chosen based on this linearized model, and as a result, more tuning parameters are required to be adjusted for better performance. In addition, the prediction length is quite high for stability, which makes the implementation of this controller quite difficult.\n\n\nIII. PROBLEM SETUP\n\nIn this section, we present the dynamic model of the quadrotor MAV and its corresponding discrete-time model, which is required for the design of the MPC. Then, an NMPC scheme without stabilizing costs or constraints is presented in order to asymptotically stabilize the system. Throughout this article, Q, R, and N denote the sets of rational, real, and natural numbers, respectively, and Q ≥0 , R ≥0 , and N 0 := N ∪ {0} are the sets of nonnegative rational, real, and integer numbers, respectively. A function ξ : R ≥0 → R ≥0 belongs to class K if it is continuous and strictly increasing with\nξ(0) = 0. In addition, if ξ ∈ K is unbounded, it is of class K ∞ . A function ζ : R ≥0 × R ≥0 → R ≥0 belongs to class KL if it is continuous, ζ(·, k) ∈ K ∞ ∀k ∈ R ≥0\n, and ζ(h, ·) is strictly monotonically decaying to zero for each h > 0.\n\n\nA. Quadrotor MAV Dynamics\n\nThe location of the MAV can be defined by its position and orientation, as shown in Fig. 1, where the position can be defined relative to the body frame {B} attached to its center of gravity and the global inertial frame {G}. The orientation of the MAV is defined by the three Euler angles, namely, roll, pitch, and yaw angles, symbolized as φ, θ , and ψ, respectively, where the pitch and roll angles are limited in the optimization problem to zones that do not trigger singularity in the system model used by the NMPC, i.e., the pitch and roll angles are limited to 60 • . In this work, we adopt the inner-outer loop control structure, as shown in Fig. 2, where the inner loop controller (low-level attitude controller) is approximated by a first-order system, as proposed in [19]. The attitude controller tracks the commanded roll and pitch angles: φ cmd and θ cmd , and the reference yaw angle ψ r generates the desired torques accordingly. The proposed first-order model sufficiently represents the behavior of the inner loop controller, which is necessary for the design of the outer loop controller (NMPC). The parameters of the proposed model can be identified through classic system identification techniques. The nonlinear model of the quadrotor MAV is defined as follows:ṗ\n(t) = R B v(t) Bv (t) = Tē 3 − R Tē 3 g − D B v(t) φ(t) = K φ τ φ φ cmd (t) − 1 τ φ φ(t) θ (t) = K θ τ θ θ cmd (t) − 1 τ θ θ (t) (1) where p is the position of the MAV {B} relative to {G} expressed in {G}, B v is the MAV velocity vector of {B} relative to {G} expressed in {B}, R := R z (ψ) · R y (θ ) · R x (φ) is the rotation matrix from frame {B} to {G}, g is the gravitational acceleration,\nT is the mass normalized thrust, τ φ and τ θ are the time constants of the inner loop first-order model for the roll and pitch angles, respectively, K φ and K θ are the gains of the same model, andē 3 is the standard basis vector\ne 3 = 0 0 1 T . D = diag(d x , d y , d z )\nis the drag coefficient matrix with normalized drag coefficients, d x , d y , and d z , in the three axes. The aerodynamic rotor drag force (D B v) of the MAV is one of the main aerodynamics effects that highly influence the tracking errors of the feedback controllers. As a result, incorporating this force in the system model improves the controller performance at aggressive and agile maneuvers with high speeds and accelerations [47]. The work in [48] has shown that the induced rotor drag force, associated with rigidity of the rotor, is significant for small multirotor aerial vehicles and can be reasonably approximated as linearly proportional to the vehicle's velocity. The yaw angle ψ is omitted from the analysis since it is fully decoupled from the rest of the plant as the MAV heading angle has no effect on the MAV position. Also, its dynamic is simple and is linearly proportional to the commanded yaw asψ =ψ cmd . For simplicity, letK\nφ = (K φ /τ φ ),τ φ = (1/τ φ ),K θ = (K θ /τ θ ), andτ θ = (1/τ θ ). Therefore, system (1) can be written in state-space representation,ẋ(t) = f (x(t), u(t)), aṡ x(t) = ⎡ ⎢ ⎢ ⎣ẋ 13 x 46 x 7 x 8 ⎤ ⎥ ⎥ ⎦ = ⎡ ⎢ ⎢ ⎣ Rx 46 −R Tē 3 g − Dx 46 −τ φ x 7 −τ θ x 8 ⎤ ⎥ ⎥ ⎦ + ⎡ ⎢ ⎢ ⎣ 0 3×1 u 1ē3 K φ u 2 K θ u 3 ⎤ ⎥ ⎥ ⎦(2)\nwhere f : R n × R m → R n is an analytic mapping, n is the number of states, m is the number of control inputs, x(t) ∈ X ⊆ R n is the state vector, u(t) ∈ U ⊆ R m is the input vector, x 13 := p, x 46 := v, x 7 := φ, x 8 := θ , u 1 := T , u 2 := φ cmd , and u 3 := θ cmd . Assuming piecewise constant control inputs on each sampling interval, model (2) can be discretized by the sampling time δ (in seconds) using the forward Euler method as follows:\n\nx\n+ = f δ (x, u) = x + δ · ⎡ ⎢ ⎢ ⎣ Rx 46 −R T gē 3 − Dx 46 −τ φ x 7 −τ θ x 8 ⎤ ⎥ ⎥ ⎦ + δ · ⎡ ⎢ ⎢ ⎣ 0 3×1 u 1ē3 K φ u 2 K θ u 3 ⎤ ⎥ ⎥ ⎦(3)\nwhere x + is the next evolution of the state vector. The state vector could be constrained as\nX := x ∈ R n | x i min ≤ x i (k) ≤ x i max(4)\n∀ i = 1, . . . , 8 and ∀ k ∈ N 0 , while the control input constraints are defined as\nU := ⎧ ⎨ ⎩ u ∈ R m ⎛ ⎝ u 1min −u 2max −u 3max ⎞ ⎠ ≤ u(k) ≤ ⎛ ⎝ u 1max u 2max u 3max ⎞ ⎠ ⎫ ⎬ ⎭ (5) ∀k ∈ N 0 , where 0 < u 1min < u 1max and u = [u 1 , u 2 , u 3 ] T .\nThus, the admissibility of an input function can be defined as follows.\n\nDefinition 1: For a given feasible set of states X and an admissible set of control values U, and for initial states\nx 0 ∈ X and N ∈ N, a sequence of control values u = (u(0), u(1), . . . , u(N − 1)) ∈ U N is said to be admissible if the state trajectory x u (·; x 0 ) = (x u (0; x 0 ), x u (1; x 0 ), . . . , x u (N; x 0 ))\niteratively generated by system (3) and proceeded from\nx u (0; x 0 ) = x 0 satisfies x u (k; x 0 ) ∈ X ∀k ∈ {0, 1, . . . , N}.\nWe denote this admissible control sequence for x 0 up to time N by u ∈ U N (x 0 ).\n\n\nB. Model Predictive Control\n\nThe objective of the control system for the quadrotor MAV is to drive the vehicle from an initial state x 0 to a desired reference state x r . Without loss of generality, the desired state is chosen as the hovering point\nx r = x r,1 x r,2 x r,3 0 1×5 T ,\nwhere 0 1×5 is a 1 × 5 zero matrix. For this purpose, the NMPC scheme will be used to stabilize the MAV with the following proposed running cost : R n × R m → R ≥0 , which is one of the key contributions in our work where this method is used to derive the growth bound and ensure the stability:\n(x, u) = x − x r 2 Q + u −ũ 2 R u .(6)\nIn (6), Q and R u are the weighting matrices of the tracking error and control actions, respectively. The first term in (6) penalizes the tracking error, and the second term is the penalty imposed on the control inputs. Expanding (6) yields the following:\n(x, u) = 8 i=1 q i x i − x r,i 2 + r 1 (u 1 −ũ 1 ) 2 +r 2 (u 2 −ũ 2 ) 2 + r 3 (u 3 −ũ 3 ) 2 .(7)\nThe above is designed to satisfy the asymptotic stability conditions presented in Theorem 1 in Section IV, wherẽ\nu 1 = g cos(x 7 ) cos(x 8 ) + d z x 6 ,ũ 2 =τ φ K φ x 7 ,ũ 3 =τ θ K θ x 8 .\nUsing (1) and (7), it can be shown that (u 1 −ũ 1 ) penalizes the acceleration along Z B , (u 2 −ũ 2 ) penalizes the roll rate, (u 3 −ũ 3 ) penalizes the pitch rate, q i ∈ R ≥0 , i = 1, 2, . . . , 8, are the i th diagonal elements of the matrix Q, and r 1 , r 2 , and r 3 ∈ R ≥0 are the i th diagonal elements of the matrix R u .\n\nThe proposed NMPC algorithm makes use of the nonlinear system model (3) to compute a feedback law. The NMPC algorithm solves iteratively an OCP at each time instant with the sampling time δ > 0 and prediction horizon N ∈ N ≥2 (see [22,Ch. 3] for more details). The solution of the OCP includes the minimization of a cost function J N : X × U N → R ≥0 that sums up the proposed running costs (7) along the predicted trajectories. The cost function is defined as\nJ N (x k , u) := k+N −1 r=k (x u (r, x k ), u(r ))(8)\nwith an optimal value function V N : X → R ≥0 defined as\nV N (x k ) := inf u∈U N (x k ) J N (x k , u)(9)\nfor N ∈ N∪{∞}. Solving the OCP while attaining the infimum induces an optimal control function u * = u * (·,\nx k ) with V N (x k ) = J N (x k , u * )\n. Algorithm 1 summarizes the proposed NMPC scheme without stabilizing costs or constraints. The NMPC algorithm aims at computing a feedback law μ N :\nX → U [defined as μ N (k, x) = u * (0, x k )]\nsuch that, for each x k ∈ X, the resulting closed-loop trajectory x u (.; x k ) generated by (3), where x u (0; x 0 ) = x 0 , satisfies the constraints x u (k; x 0 ) ∈ X and μ N (x u (k; x 0 )) ∈ U for all k ∈ N 0 and is asymptotically stable. Neither the asymptotic stability of system (3) nor the recursive feasibility can be guaranteed under the proposed NMPC algorithm since no stabilizing costs or constraints are incorporated in the proposed OCP, and u ≡ 0 R m / ∈ U N (x k ), i.e., u 1 min > 0 as in (5); therefore, U N (x k ) = ∅ is not guaranteed. In Section IV, we will show that the asymptotic stability and recursive stability can be ensured by computing a stabilizing prediction horizon N through deriving a growth sequence that satisfies the cost controllability condition [39]. A closed-loop system is asymptotic stable (e.g., at the origin) if there exists a function β ∈ KL such that the closed-loop trajectory x μ N (k, x 0 ) has the following condition, that is:\nx μ N (k, x 0 ) ≤ β( x 0 , k) ∀k ∈ N 0(10)\nfor all x 0 ∈ X.\n\n\nIV. STABILITY AND RECURSIVE FEASIBILITY OF MPC WITHOUT STABILIZING COSTS OR CONSTRAINTS\n\nThis section summarizes the findings from [22], [32], and [36]; then, these findings will be utilized in Section V to prove the asymptotic stability and recursive feasibility of the discrete-time model of the quadrotor MAV defined in (3). We first formulate the following assumptions that are crucial Compute a minimizing control sequence u * = (u * (0), u * (1), . . . , u * (N − 1)) ∈ U N (x k ) by solving the OCP that satisfies\n3 J N (x k , u * ) = V N (x k ). 4 Implement the control input u(k) := μ N (k, x) := u * (0, x k ) at the MAV plant. 5 Measure the current state x μ N (k; x 0 ) := x u * (k; x k ) and set x k = x μ N (k; x 0 ) and k = k + 1.\nfor proving the asymptotic stability of the proposed NMPC algorithm without stabilizing terminal costs or constraints. Assumption 1: Assume that there exist the following.\n\n\nA1.1: A monotonically increasing and bounded sequence\n(γ i ) i∈N such that V i (x 0 ) ≤ γ i x 0 − x r 2 Q ∀i ∈ N(11)\nholds for each x 0 ∈ X, where x 2 Q represents the quadratic form x T Qx and Q ∈ R n×n is a diagonal matrix composed of the penalty parameters of the state error such that Q 0.\nA1.2: Two functionsᾱ, ᾱ ∈ K ∞ satisfyinḡ α( x − x r ) ≤ * (x) ≤ ᾱ ( x − x r ) ∀x ∈ X(12)\nwhere * (x) := inf u∈U 1 (x) (x, u). The stability of the NMPC closed loop is established by showing that the optimal value function V N is a Lyapunov function for the system. Therefore, if conditions given in Assumption 1 are satisfied, V N is called a Lyapunov function; thus, x converges to x r , and the system is asymptotically stable.\n\n\nA. Stability\n\nThe performance bound of the NMPC closed loop can be defined as follows.\n\nDefinition 2: Let the closed-loop control sequence μ N (k, x) be admissible and given, and J cl N (k, x)) be the closed-loop costs on the infinite horizon. Then, the performance bound of the proposed NMPC scheme can be defined as follows:\n∞ (x, μ N ) := ∞ k=0 (x μ N (k, x), μJ cl ∞ (x, μ N ) ≤ α −1 N V ∞ (x)(13)\nwhere α N is the performance index, i.e., degree of suboptimality.\n\nThe asymptotic stability can be ensured using Assumption 1, as shown in the following theorem.\n\nTheorem 1: Consider an NMPC problem satisfying Assumption 1, and let the performance index α N be governed by\nα N := 1 − (γ N − 1) N k=2 (γ k − 1) N k=2 γ k − N k=2 (γ k − 1) .(14)\nThen, if α N > 0, the relaxed Lyapunov inequality\nV N ( f δ (x, μ N (x))) ≤ V N (x) − α N (x, μ N (x))(15)\nholds for all x ∈ X, and the NMPC closed loop with prediction horizon N is asymptotically stable. In addition, inequality (13) holds.\n\nFor the proof of Theorem 1 (see [22,Ch. 6] and [30]), the upper and lower bounds in A1.2 exist and can be simply guaranteed for quadratic and positive definite running costs, as given in [22] and [35]; however, ensuring A1.1 is not straightforward since the derivation of the growth bound γ i , i ∈ N is generally involved, as given in Section V.\n\n\nB. Recursive Feasibility\n\nIn order to guarantee that the proposed NMPC scheme is well defined, it is crucial that, at each time step k, an admissible control sequence should exist for the closed-loop state\nx k := x μ N (k, x 0 ) for all k ∈ N, i.e., U N (x k ) = ∅.\nHowever, it is difficult to ensure that there are no terminal constraints or costs. Therefore, we first show the necessary conditions for recursive feasibility in the following definition and then show how to ensure it in the following theorem.\n\nDefinition 3: Consider an NMPC scheme with optimization horizon N and the feasible set X N defined as\nX N := x k ∈ X | U N (x k ) = ∅(16)\nand a set B ⊆ X N . The scheme is called recursively feasible on B if, for each x k ∈ B and each optimal control sequence u * ∈ U N (x k ) of (9), the condition x u * (1, x k ) ∈ B holds. The concept of recursive feasibility requires that, for each optimal admissible trajectory, starting in B remains in B for at least one step. The recursive feasibility can be ensured by means of stability, as shown in the following theorem.\n\nTheorem 2: Let there be an NMPC scheme with a state constraint set X, and let Assumption 1 hold on X N , as given by (16). Then, for each c > 0, there exists N c > 0 such that the NMPC algorithm is recursively feasible on the set\n{x k ∈ X N | V N c ≤ c}.\nFor the proof of the theorem, we refer to [36,Sec. 5.2]. Therefore, if we can derive a bounding sequence γ i that ensures A1.1 and find the stabilizing prediction horizon N from (14) that satisfies α N ∈ (0, 1], we can guarantee the asymptotic stability and recursive feasibility of Algorithm 1 on the set {x k ∈ X N | V N c ≤ c}, as will be shown in Section V.\n\n\nV. STABILITY ANALYSIS OF THE QUADROTOR MAV AND\n\nTHE GROWTH FUNCTION In this section, we will derive the growth bound γ i in Assumption 1 and find the shortest possible (minimal) prediction horizon N that stabilizes the NMPC scheme proposed in Algorithm 1.\n\n\nA. Derivation of the Growth Bound\n\nThe derivation of the growth bound γ i is generally difficult. One of the alternative ways to obtain it is by constructing a summable sequence\nc j ⊆ R ≥0 , j ∈ N 0 , where ∞ j =0 c j < ∞, such that γ i = i−1 j =0 c j , i ∈ N ≥2 .\nIn addition, for an admissible control actions u x 0 = u x 0 ( j ), j ∈ N 0 , the sequence c j satisfies the following inequality:\nx u x 0 ( j ; x 0 ), u x 0 ( j ) ≤ c j x 0 − x r 2 Q(17)\nfor all j ∈ N 0 and x 0 ∈ X (see [23,Sec. 3] for more details). The computation of the sequence c j and, thus, the growth bound γ i is governed by the following proposition.\n\nProposition 1: Suppose that the penalty parameters of the control inputs in (7) are satisfying\nr 1 ≤ σ q 6 , r 2 ≤ σK 2 φ q 7 , r 3 ≤ σK 2 θ q 8(18)\nwith weighting ratio σ ∈ N. Therefore, condition (11) holds\nwith γ i = i−1 j =0 c j , i ∈ N ≥2\n, where the sequence c j is governed by\nc j := ⎡ ⎣ λ ρ − j ρ λ ρ 2 + σ δ 2 λ 2 ρ−1 i=0 ρ C i 2 ⎤ ⎦(19)\nfor j ∈ {0, 1, . . . , λ−1}, where λ ∈ N ≥2 is the number of steps required to perform any given maneuver and the exponent ρ ∈ Q ≥0 is adjusted for different trajectory shapes.\n\nProof: The quadrotor MAV may move in straight lines, curves, or lattice shape [49] based on the initial and final states, prediction horizon, and sampling time. Therefore, the trajectory for each initial state x 0 ∈ X to the reference state x r is defined as follows: (20) where λ ∈ N ≥2 is the number of steps required to perform the maneuver and is chosen large enough such that the constraints (5) are satisfied for all x 0 ∈ X, and the exponent ρ ∈ Q ≥0 depends on the shape of the trajectory. If ρ = 1, (20) provides a straight line between the initial and desired positions, and when ρ = 2, it provides a quadratic curve, and higher exponent ρ values provide higher order curves. The desired trajectory can be approximated as a combination of trajectory segments given by (20). Substitute (3) into (20) to find the open-loop control inputs (u x 0 ) required to perform the maneuver. The first control input u 1 was given in (3) as\nx[ j ] = λ ρ − j ρ λ ρ x 0 + j ρ λ ρ x r = x 0 + j ρ λ ρ (x r − x 0 ) ∀ j ∈ {0, 1, . . . , λ − 1}x 6 [ j + 1] = x 6 [ j ] − δ R 33 g + δu 1 [ j ] − δd z x 6 [ j ]\nwhere R 33 = cos(x 7 ) cos(x 8 ) is the element in the third row and the third column in the rotation matrix R. Thus, control input u 1 x 0 for all x 0 ∈ X (or u 1 for the sake of simplicity) can be calculated as follows:\nλ ρ − ( j + 1) ρ λ ρ x 0,6 − (1 − δd z ) λ ρ − j ρ λ ρ x 0,6 = −δ R 33 g + δu 1 .(21)\nReplacing ( j + 1) ρ with the binomial expansion, (21) reduces to\n− ρ−1 i=0 ρ C i j i + δd z (λ ρ − j ρ ) δλ ρ x 0,6 = u 1 − R 33 g where ρ C i = (ρ!/i !(ρ − i )!), which yields u 1 = − ρ−1 i=0 ρ C i j i + δd z (λ ρ − j ρ )\nδλ ρ x 0,6 + R 33 g (22) for all j ∈ {0, . . . , λ − 1}. The second control input u 2 was given in (3) as\nx 7 [ j + 1] = 1 − δτ φ x 7 [ j ] + δK φ u 2 [ j ].\nThus, u 2 is calculated as follows:\nλ ρ − ( j + 1) ρ λ ρ x 0,7 − 1 − δτ φ λ ρ − j ρ λ ρ x 0,7 = δK φ u 2 reduces to − ρ−1 i=0 ρ C i j i + δτ φ (λ ρ − j ρ ) λ ρ x 0,7 = δK φ u 2 .\nThe above simplifies as\nu 2 = − ρ−1 i=0 ρ C i j i + δτ φ (λ ρ − j ρ ) δK φ λ ρ x 0,7(23)\nfor all j ∈ {0, . . . , λ − 1}. The calculation of the third input u 3 is similar to u 2 and given by\nu 3 = − ρ−1 i=0 ρ C i j i + δτ θ (λ ρ − j ρ ) δK θ λ ρ x 0,8(24)\nfor all j ∈ {0, . . . , λ − 1}. It is worth mentioning that (u 1 , u 2 , u 3 ) ≡ (0, 0, 0) is a feasible solution for arbitrary x 0 ∈ X since φ cmd and θ cmd could be zeros, and the thrust is equal to the gravitational weight, i.e., u 1 x 0 = 0. According to Grüne et al. [22], Worthmann et al. [23], and Boccia et al. [35], the NMPC OCP solution is called feasible for the initial value x 0 if U N (x 0 ) = ∅ holds. Therefore, the control inputs (22)- (24) are feasible. Applying (20) and (22)-(24) into (7) yields the running costs (25), as shown at the bottom of the next page, along the resulting open-loop trajectories.\n\nTo this end, the bounding sequence c j can be found by bounding the running costs (25) such that condition (17) is satisfied. The second term in (25) can be bounded using condition (18) and by recalling that j ≤ λ as follows:\nr 1 ρ−1 i=0 ρ C i j i δλ ρ 2 x 2 0,6 ≤ r 1 λ ρ−1 ρ−1 i=0 ρ C i δλ ρ 2 x 2 0,6 ≤ σ q 6 ρ−1 i=0 ρ C i 2 δ 2 λ 2 x 2 0,6 . (26)\nMoreover, the third term in (25) can be bounded in the same manner as follows:\nr 2 ρ−1 i=0 ρ C i j i δK φ λ ρ 2 x 2 0,7 ≤ r 2 1 K 2 φ ρ−1 i=0 ρ C i 2 δ 2 λ 2 x 2 0,7 ≤ σ q 7 ρ−1 i=0 ρ C i 2 δ 2 λ 2 x 2 0,7 . (27)\nSimilarly, the fourth term in (25) is bounded as follows:\nr 3 ρ−1 i=0 ρ C i j i δK θ λ ρ 2 x 2 0,8 ≤ r 3 1 K 2 θ ρ−1 i=0 ρ C i 2 δ 2 λ 2 x 2 0,8 ≤ σ q 8 ρ−1 i=0 ρ C i 2 δ 2 λ 2 x 2 0,8 . (28)\nAs a result, the running costs (25) can be estimated by\nx u x 0 ( j ; x 0 ), u x 0 ( j ) ≤ λ ρ − j ρ λ ρ 2 x 0 − x f 2 Q + σ δ 2 λ 2 ρ−1 i=0 ρ C i 2 8 i=6 q i x 0,i ≤ ⎡ ⎣ λ ρ − j ρ λ ρ 2 + σ δ 2 λ 2 ρ−1 i=0 ρ C i 2 ⎤ ⎦ x 0 − x f 2 Q (29)\nfor all j ∈ {0, . . . , λ − 1}. Therefore, the bounding sequence c j in (17) can be attained as in (19).\n\nFinally, the growth bound γ k , k ∈ N 0 , can be obtained as given in Proposition 1 by\nγ k := k−1 j =0 c j = k−1 j =0 ⎡ ⎣ λ ρ − j ρ λ ρ 2 + σ δ 2 λ 2 ρ−1 i=0 ρ C i 2 ⎤ ⎦\nwhich can be written as\nγ k = 1 λ 2ρ k−1 j =0 ⎡ ⎣ (λ ρ − j ρ ) 2 + σ δ 2 λ 2ρ−2 ρ−1 i=0 ρ C i 2 ⎤ ⎦ . (30)\nIt can be noticed from (30) that the growth bound γ k depends only on the sampling time δ, the exponent value ρ, the number of steps λ, and the weight ratio σ .\n\n\nB. Calculation of the Minimal Stabilizing Horizon\n\nIn this section, we will calculate the shortest stabilizing prediction horizon using the growth bound γ k such that α N ∈ (0, 1] holds. Equation (30) has been expanded and simplified to the form given in the following:\nγ k = 1 λ 2ρ k−1 j =0 ⎡ ⎣ λ 2ρ − 2λ ρ j ρ + j 2ρ + σ δ 2 λ 2ρ−2 ρ−1 i=0 ρ C i 2 ⎤ ⎦ .\nFor the sake of simplicity and for tractable analysis, without loss of generality, assume that ρ = 1, which yields\nγ k = 1 λ 2 k−1 j =0 λ 2 − 2λj + j 2 + σ δ 2 = 1 λ 2 ⎡ ⎣ k−1 j =0 j 2 − 2λ 2 k−1 j =0 j + λ 2 + σ δ 2 k ⎤ ⎦ . (31)\nUsing the sum formulas\nk−1 j =0 j 2 = k(k − 1)(2k − 1) 6 and k−1 j =0 j = k(k − 1) 2 (32)\nγ k can be formulated as\nγ k = 1 λ 2 kλ 2 − k 2 − k λ + k 3 3 − k 2 2 + k 6 + σ δ 2 k . (33)\nThus, the following theorem defines the shortest prediction horizon required to stabilize the proposed NMPC scheme.\n\nTheorem 3: Let the prediction horizon N = 4, the sampling time δ > 0, and the weight ratio σ > 0 be given. If there exist maneuver steps of length λ * such that, for all λ > λ * , the performance index α N governed by (14) satisfies α 4 > 0; thus, the closed-loop asymptotic stability of the quadrotor MAV under the NMPC scheme without terminal costs or constraints is ensured for the shortest possible prediction horizon. In addition, the inequality\nV μ 4 ∞ ≤ α −1 4 V ∞ (x)(34)\nholds.\n\nProof: The motion primitives of the quadrotor MAV can be generated in the quadrotor's jerk [50]. Thus, in order to guarantee a feasible trajectory, the thrust and attitude inputs are recovered from such a thrice differentiable trajectory. As a result, a minimum of four points are required, i.e., the prediction horizon should be selected as N ≥ 4. Therefore, the performance estimate α N given in (14) for N = 4 is formulated as\nα 4 = 1 − (γ 2 − 1)(γ 3 − 1)(γ 4 − 1) 2 γ 2 γ 3 γ 4 − (γ 2 − 1)(γ 3 − 1)(γ 4 − 1)\n.\n\nThus, the conditions for asymptotic stability to be ensured can be determined as\n0 < (γ 2 − 1)(γ 3 − 1)(γ 4 − 1) 2 γ 2 γ 3 γ 4 − (γ 2 − 1)(γ 3 − 1)(γ 4 − 1) < 1.(36)\nThe left inequality in (36) can be ensured with γ k > 1. Thus, selecting λ as yields γ K > k > 1, which ensures the left inequality of (36). In addition, substituting the value of λ defined in (37) into (36) ensures the right inequality. Therefore, N ≥ 4 ensures the asymptotic stability of the system. If λ is selected as λ = 2λ * , the performance index becomes\nλ > λ * := k 3 3 − k 2 2 + k 6 + σ δ 2 k k 2 − k > 0 ∀k ≥ 2 (37) (x u x 0 ( j ; x 0 ), u x 0 ( j )) = λ ρ − j ρ λ ρ 2 8 i=1 q i x 0,i − x r,i 2 + r 1 ρ−1 i=0 ρ C i j i δλ ρ 2 x 2 0,6 +r 2 ρ−1 i=0 ρ C i j i δK φ λ ρ 2 x 2 0,7 + r 3 ρ−1 i=0 ρ C i j i δK θ λ ρ 2 x 2 0,8(25)α 4 = 360 σ δ 2 3 + 766 σ δ 2 2 + 451 σ δ 2 + 70 72 σ δ 2 4 + 444 σ δ 2 3 + 796 σ δ 2 2 + 454 σ δ 2 + 70 .(38)\nEquation (38) shows that the performance index depends only on the weight parameter σ and the sampling time δ. The index α 4 is always positive and converges to 1 as σ/δ 2 is chosen small, as shown in Fig. 3.\n\nTheorem 3 shows that the performance of NMPC with infinite prediction horizon can be approached by reducing σ/δ 2 regardless of the shortest prediction horizon, i.e., N = 4, used in the NMPC scheme proposed in Algorithm 1. By satisfying Assumption 1 and ensuring the conditions of Theorems 1 and 3, the asymptotic stability of the overall cascade system is ensured, as discussed in [51,Th. 3].\n\n\nVI. RESULTS\n\nThis section presents several numerical simulations and laboratory experiments in order to validate the proposed NMPC scheme. In the numerical simulations, the dynamic model (1) is used as the system of the quadrotor MAV, while the AscTec Hummingbird Quadrotor [52] is used for all laboratory experiments. In order to obtain the solution of the OCP for both numerical and lab experiments, the dynamic model in (3) is implemented for the state prediction process, and the running cost in (7) is used to construct the cost function (8), as shown in Fig. 4. Only parameters that need tuning are q i (i = 1, 2, . . . , 8) of the Q weighting matrix given that r i (i = 1, 2, 3) parameters are constrained by (18), and σ/δ 2 is selected very small for higher performance index, as observed in Fig. 3. The sampling time δ was selected in the range of [0.01,0.5] s, as the controller can operate up to 1 KHz [53]. For all test validations, the parameters in system (1) are given in Table I,   Hummingbird helicopter, provided by Kamel et al. [19]. 1 The drag coefficient matrix is given as D = diag(0.01, 0.01, 0). The control inputs given in (5) \n⎞ ⎠ ≤ ⎛ ⎝ u 1 (k) u 2 (k) u 3 (k) ⎞ ⎠ ≤ ⎛ ⎝ 15 m/s 2 10 • 10 • ⎞ ⎠ .(39)\nThe symbolic toolbox CasADi [54] is used to set up the OCP proposed in Algorithm 1. CasADi was selected due to its high efficiency in implementing nonlinear optimizations and flexibility to be used from C++, Python, or MATLAB/Octave. A discretization, using direct multiple-shooting method [55], is employed to turn the OCP into a nonlinear programming problem (NLP) (see [54,Sec. 5.4] for more details). Then, the Interior Point OPTimizer (IPOPT), which is already interfaced with CasADi, is used to solve this NLP. Two main control problems are evaluated: 1) point stabilization (hovering) and 2) trajectory tracking problems. In the point stabilization problem, the algorithm terminates when the following stopping criterion is met:\nx(k) − x r ≤ ∀k ∈ N(40)\nwhere > 0 is the error value; otherwise, the process will terminate after reaching the maximum time t max .\n\nA. Numerical Validation 1) Proposed NMPC Scheme: The following simulations were conducted on MATLAB. The simulation was run for 12 various initial positions while stabilizing the MAV to the reference point x r = 0 0 1 0 1×5 T . The prediction horizon was set to N = 4 by means of Theorem 3 and the sampling time to δ = 0.1 s. In addition, the weight ratio σ was selected such that σ/δ 2 = 0.1; thus, the corresponding performance index is α 4 = 0.994. The parameters of the weighting matrix Q are selected similar to [19] with some fine tuning as Q = diag(100, 100, 120, 80, 80, 100, 10, 10). The stopping error value in (40) was selected as = 1 mm and the maximum time t max = 120 s. The trajectories of the 12 runs are shown in Fig. 5(a). The results show that the MAV may go from the initial position to the final position in straight lines, curves, or lattice shape, as proposed in the proof of Proposition 1. Moreover, the proposed NMPC algorithm with N = 4 is able to stabilize the MAV from any random initial state while satisfying the OCP's input constraints given in (39) for all time steps, as shown in Fig. 5(b), which verifies the fulfillment of the conditions of Theorem 2.\n\nThe asymptotic stability of the system can be verified by studying the evolution of the value function V 4 at N = 4. Fig. 5(c) shows that V 4 is monotonically decreasing with time for all initial positions, which is leading to the conclusion that the conditions of Theorem 1 are successfully met, and the system is asymptotically stable for any given initial position. The convergence rate of the MAV to the reference point depends on the prediction horizon N. Increasing the prediction horizon tends to a faster convergence rate and less convergence time, as shown in Fig. 6(a), i.e., the convergence time is reduced by more than 50% when N increases from N = 4 to N = 5. In addition, Fig. 6(b) shows the effect of changing the sampling time δ on the evolution of V 4 and the convergence rate. It is clearly seen that increasing δ decreases the convergence time.  The performance of the proposed controller is also tested for trajectory tracking problems, and the results show outstanding tracking performance with the shortest prediction horizon N = 4. Figs. 7 and 8 show the tracking results of circular and 8-shaped trajectories, respectively. The root mean square error is less than 0.017 m for both trajectories.\n\n2) Comparison With Traditional NMPC: In this section, the performance of the proposed NMPC scheme without stabilizing costs or constraints is compared against the traditional NMPC scheme, which requires the addition of the terminal costs in its cost function (see [19] 2 for more details). The cost function of the traditional NMPC is given by 2 The work in [19] was considered in our comparative study because it proposes an NMPC with terminal costs for the control of a quadrotor with a similar dynamic model to our used model that includes the position, velocity, orientation dynamics. For the comparison with linear MPC, this work [56] demonstrates the improved performance of the NMPC over the linear MPC. in which Q N ∈ R n×n is the terminal weight matrix that needs to be computed by solving the following algebraic Riccati equation:\nJ N (x k , u) := N k=1 x − x r 2 Q + u − u r 2 R u + x N − x r 2 Q N(41)Q N A + A T Q N − Q N BR −1 u B T Q N + Q = 0(42)\nwhere A and B are the state and input matrices of the linearized system. For the point stabilization problem, the weighting matrices Q and R of the traditional NMPC are selected as in [19], while the Q matrix of the proposed NMPC is selected similar to [19], as given in Section VI-A. The comparison results are given in Table II. The table shows that the proposed NMPC has asymptotically stabilized the MAV at the reference point while achieving condition (40) in the finite number of time steps at various prediction horizons N and sampling times δ except for N = 4 and δ = 0.01, where the simulation terminated at t max , while the MAV was very close to the reference point. This could happen at very small sampling times and prediction horizons because the controller requires more iterations to converge, as shown in Fig. 6(a) and (b). However, the traditional NMPC requires a higher number of iterations to stabilize the MAV (more than double the number of iterations in some cases). In addition, at low sampling time, the traditional NMPC could not achieve the stopping criteria in three cases, as shown in Table II, and failed to stabilize the MAV at δ = 0.01 s and N = 4 because the traditional controller with stabilizing cost function requires a large prediction duration (N × δ) to guarantee the asymptomatic stability. Two samples of the comparison results have been illustrated in Fig. 9(a) and (b). The figures show that the proposed NMPC has a faster convergence rate and smoother and shorter trajectory than the traditional scheme. Moreover, the traditional NMPC controller was tested with the same weighting parameters as the proposed NMPC to accelerate the convergence rate, but the traditional NMPC has failed to asymptotically stabilize the system as well, as shown in Fig. 9(c), where V 4 is no longer monotonically decreasing.\n\nBoth controllers were evaluated for the trajectory tracking problems, where the weighting parameters are selected similar to [19]. Table II and Fig. 10 show the trajectory tracking performance of the circular and 8-shaped trajectories. It can be observed that the proposed NMPC scheme is robust against changing the controller parameters (N and δ) and outperforms the traditional scheme in terms of the tracking accuracy and computation time of the MPC problem. Furthermore, at sampling times δ = 0.1 s and δ = 0.05 s, the proposed NMPC can achieve outstanding tracking performance with only N = 4 similar to the traditional NMPC with N = 10 or N = 20 while saving more than 40% of the computation time that saves more time and power for the MAV's CPU to accomplish other autonomy tasks. Similarly, at low sampling time, the proposed NMPC provides better tracking performance than the traditional NMPC without the need of tuning the controller parameters; however, the traditional NMPC (with N = 4) failed to stabilize the MAV with very high tracking errors.  II   SIMULATION COMPARISON RESULTS OF THE PROPOSED NMPC AND TRADITIONAL NMPC FOR THREE DIFFERENT PROBLEMS: 1) POINT STABILIZA-TION; 2) CIRCULAR TRAJECTORY TRACKING; AND 3) 8-SHAPED TRAJECTORY TRACKING. RMSE IS THE ROOT MEAN SQUARE ERROR IN  METERS. # ITER. IS THE NUMBER OF ITERATIONS (TIME STEPS) REQUIRED TO STABILIZE THE MAV AT THE REFERENCE POINT. T MPC IS  THE AVERAGE COMPUTATION TIME OF THE OPTIMIZATION PROCESS AT EACH ITERATION IN \n\n\nB. Experimental Validation\n\nThe proposed NMPC scheme has been experimentally evaluated in the lab using the AscTec Hummingbird Quadrotor Helicopter [52], as shown in Fig. 11(a). The experimental platform, including the proposed NMPC algorithm, has been conducted on the robot operating system (ROS). The NMPC node was written in Python since it is compatible with the CasADi toolbox. The feedback control actions are sent to the quadrotor via XBee Bluetooth communication, as shown in Fig. 12. The OptiTrack motion capture system (with six cameras) has been used to provide the quadrotor pose as a feedback to the control system to guarantee accurate measurements since the OptiTrack system can accurately estimate the 6 DOF pose of the quadrotor at a high rate of up to 120 Hz. For this purpose, five markers have been mounted on the quadrotor to be detected by the OptiTrack system, as shown in Fig. 11(b). A Kalman filter has been used to estimate the velocity of the quadrotor from the measured position since the OptiTrack system does not provide tracked object velocity.\n\nThe lab experiments on the point stabilization problem were conducted at sampling time δ = 0.1 s and various prediction horizons. The weight ratio σ was selected as given in the numerical simulation (see Section VI-A). The stopping error value in (40) was selected as = 50 mm and the maximum time t max = 60 s. The results of four point stabilization  experiments of the proposed and traditional schemes are given in Fig. 13 and Table III. Both controllers reached the maximum time before achieving the stopping criteria at N = 4, as can be seen in Fig. 13(a); however, the traditional controller provided a larger RMSE error than the proposed controller and failed to stabilize the MAV close to the reference point. The corresponding value function V 4 of both controllers is monotonically decreasing until some point and then keeps almost constant that reflects the reason for the errors. Starting from N = 5, the proposed controller was able to stabilize the MAV and achieve the stopping criteria at a faster convergence rate than the traditional controller, as shown in Fig. 13(b)-(d).  An instance of the quadrotor under the proposed controller at hovering is shown in Fig. 11(a). In order to evaluate the controller performance for the trajectory tracking problem, another ROS node has been created to generate the reference trajectory, as shown in Fig. 12. The ROS node generates a circular trajectory of a radius of 1 m and an elevation of 1.5 m. Both controllers were tested at two different controller parameters at an angular speed of 0.7 rad/s, as shown in Fig. 14. The figure shows that the proposed NMPC provides better tracking performance than the traditional controller in both cases. Both controllers are also tested at a higher angular velocity of 1.0 rad/s and lower sampling time. We could not go below δ = 0.03 s due to the limitations of the used PC, as shown in Fig. 15. This figure shows that the traditional controller failed to track the reference trajectory, and the MAV diverged out of the arena, as shown in Fig. 15(a).\n\nThe RMSE of the four cases is given in Fig. 16, where the outliers come from the fact that the start point of the MAV is the origin; however, the reference trajectory starts from a different point, as seen in Figs. 14 and 15. Therefore, all the experiments have the same maximum outlier. From Figs. 14 to 16, it can be observed that the proposed NMPC outperforms the traditional NMPC regardless of the prediction horizon and the sampling time.\n\nIn all the experiments of our real system, the controller performed as expected in the simulation study and the closed-loop system has converged to the stabilizing point but used N = 5 as opposed to N = 4 in the simulation. Also, the error threshold that we defined for the point stabilization problem (hovering) is 50 mm as opposed to 1 mm in simulations. These changes were performed to accommodate for noise in the measurement system.  \n\n\nVII. CONCLUSION\n\nThis article has successfully developed and demonstrated a computationally efficient NMPC scheme for quadrotor MAVs to navigate on fast trajectories. In order to achieve fast trajectories, the NMPC scheme was designed with minimum computational cost with the shortest possible prediction horizon. In all experiments, this controller has shown robust performance against the traditional NMPC controller since the proposed controller can stabilize the system under numerous initial conditions with varied system configurations. The stability for this controller was performed without having to follow any constraints or conditions, and as a result, the controller has a larger region of attraction as opposed to many other stability-based controllers reported in the literature. Due to this reason, the controller was able to perform well even under small sampling time intervals. The results showed that the proposed NMPC scheme outperforms the traditional schemes that incorporate terminal conditions in its cost function in terms of tracking accuracy and convergence rate. The proposed scheme (with prediction horizon, N = 4 or N = 5) can achieve the same task done by the traditional scheme (with N = 10 or N = 20) while attaining better tracking and stabilization accuracy, and saving more than 40% of the computation time. In addition, it still can provide high tracking performance at low sampling time without the need of tuning the controller parameters. Future work will include onboard implementation of the proposed scheme and testing on outdoor aggressive trajectories under wind disturbances while designing a robust NMPC to address external disturbances and model uncertainties.\n\nOscar De Silva (Member, IEEE) received the\n\nFig. 1 .\n1Coordinate frames of the quadrotor MAV system. {G} is the global frame, and {B} is the body frame located at the center of gravity of the MAV.\n\nFig. 2 .\n2Inner-outer loop control scheme for quadrotor MAV system. ζ is the Euler angles vector, ω is the angular velocity vector, v is the MAV velocity vector of {B} relative to {G} expressed in {G}, M φ , M θ , and M ψ are the applied torques for the three Euler angles, and the subscript r denotes the reference value.\n\nAlgorithm 1 :\n1NMPC Scheme Input: Prediction horizon N, sampling time δ Output: NMPC feedback law μ N Initialization: Set the time index k = 0 and x k :\n\nFig. 3 .\n3Plot of α 4 versus σ δ 2 . The performance index α 4 , at N = 4, converges to 1 at small values of the ratio σ δ 2 .\n\n\nin which the time constant and gain of the roll and pitch angles were extracted using the open-source code of the system identification of the attitude dynamics of the\n\nFig. 5 .\n5(a) 3-D trajectories of 12 simulation runs starting from various initial positions (Si) for i = 1, 2, . . . , 12 and stabilizing at the final position (E). (b) Feedback control inputs and the input limits given in (39) for one simulation run at initial states x 0 = (1, 1, 0.07, 0 1×6 ) T . (c) Evolution of the value function V 4 for the 12 various initial positions.\n\nFig. 6 .\n6(a) Evolution of the value function for various prediction horizon lengths N for one simulation run at initial states x 0 = (1, 1, 0.07, 0 1×6 ) T . (b) Evolution of the value function V 4 for various sampling times at the same initial states.\n\nFig. 7 .\n7Simulation performance of the circular trajectory tracking of the proposed NMPC scheme at N = 4 and δ = 0.1 s. Left: 3-D trajectories of the reference and actual trajectories. Right: magnitude of error in the x-, y-, and z-axes.\n\nFig. 8 .\n8Simulation performance of the 8-shaped trajectory tracking of the proposed NMPC scheme at N = 4 and δ = 0.1 s. Left: 3-D trajectories of the reference and actual trajectories. Right: magnitude of error in the x-, y-, and z-axes.\n\nFig. 9 .\n9Simulation point stabilization comparison of the proposed and traditional NMPC schemes at (a) N = 4 and δ = 0.01 s and (b) N = 4 and δ = 0.05 s. (c) Same as (a) but after tuning the weighting parameters of the traditional NMPC to be similar to the proposed NMPC to accelerate the convergence rate.\n\nms Fig. 10 .\nms10Simulation trajectory tracking comparison of the proposed and traditional NMPC schemes at N = 4 and δ = 0.01 s for (a) circular trajectory and (b) 8-shaped trajectory. The proposed NMPC has superior tracking performance even at small prediction horizons and sampling times; however, the traditional NMPC has failed to track the reference trajectory.\n\nFig. 11 .\n11(a) Instance of the Asctec Hummingbird quadrotor at hovering position with the proposed NMPC in the lab. Five markers are attached to the quadrotor for visual localization purposes. (b) Screenshot of the OptiTrack Motive with the six cameras around the arena and the quadrotor.\n\nFig. 12 .\n12Configuration of the OptiTrack motion capture system and the experimental setup.\n\nFig. 13 .\n13Experimental point stabilization performance of the proposed and traditional NMPC schemes at δ = 0.1 s and (a) N = 4, (b) N = 5, (c) N = 7, and (d) N = 20.\n\nFig. 14 .\n14Experimental trajectory tracking performance at an angular velocity of 0.7 rad/s of the proposed and traditional NMPC schemes at (a) N = 4 and δ = 0.1 s and (b) N = 20 and δ = 0.1 s.\n\nFig. 15 .\n15Experimental trajectory tracking performance at an angular velocity of 1.0 rad/s of the proposed and traditional NMPC schemes at (a) N = 4 and δ = 0.05 s and (b) N = 4 and δ = 0.03 s.\n\nFig. 16 .\n16RMSE of the lab experiments at various controller configurations.\n\n\nreceived 14 February 2022; revised 19 May 2022; accepted 27 June 2022. Date of publication 14 July 2022; date of current version 23 February 2023. This work was supported in part by the Natural Sciences and Engineering Research Council of Canada (NSERC) and in part by the Memorial University of Newfoundland, St. John's, NL, Canada. Recommended by Associate Editor S. Galeani. (Corresponding author: Mahmoud A. K. Gomaa.) The authors are with the Intelligent Systems Laboratory, Memorial University of Newfoundland, St. John's, NL A1B 3X9, Canada Color versions of one or more figures in this article are available at https://doi.org/10.1109/TCST.2022.3188399. Digital Object Identifier 10.1109/TCST.2022.3188399(e-mail: \nmakamel@mun.ca; \noscar.desilva@mun.ca; \ngmann@mun.ca; \nrgosine@mun.ca). \n\n\nTABLE I\nIQUADROTOR MAV PARAMETERS Fig. 4. Block diagram of the NMPC and the closed-loop system.\n\nTABLE\n\n\nTABLE III EXPERIMENTAL\nIIICOMPARISON RESULTS OF THE POINT STABILIZATION. RMSE IS THE ROOT MEAN SQUARE ERROR IN METERS. # ITER. IS THE NUMBER OF ITERATIONS (TIME STEPS) REQUIRED TO STABILIZE THE MAV AT THE REFERENCE POINT. THE SAMPLING TIME δ = 0.1 s\nAvailable at https://github.com/ethz-asl/mav_system_identification and last accessed on December 2020.\n\nToward a fully autonomous UAV: Research platform for indoor and outdoor urban search and rescue. T Tomic, IEEE Robot. Autom. Mag. 193T. Tomic et al., \"Toward a fully autonomous UAV: Research platform for indoor and outdoor urban search and rescue,\" IEEE Robot. Autom. Mag., vol. 19, no. 3, pp. 46-56, Sep. 2012.\n\nTowards model-predictive control for aerial pick-and-place. G Garimella, M Kobilarov, Proc. IEEE Int. Conf. Robot. Autom. (ICRA). IEEE Int. Conf. Robot. Autom. (ICRA)G. Garimella and M. Kobilarov, \"Towards model-predictive control for aerial pick-and-place,\" in Proc. IEEE Int. Conf. Robot. Autom. (ICRA), May 2015, pp. 4692-4697.\n\nUsing unmanned aerial vehicles (UAV) for highresolution reconstruction of topography: The structure from motion approach on coastal environments. F Mancini, M Dubbini, M Gattelli, F Stecchi, S Fabbri, G Gabbianelli, Remote Sens. 512F. Mancini, M. Dubbini, M. Gattelli, F. Stecchi, S. Fabbri, and G. Gabbianelli, \"Using unmanned aerial vehicles (UAV) for high- resolution reconstruction of topography: The structure from motion approach on coastal environments,\" Remote Sens., vol. 5, no. 12, pp. 6880-6898, Dec. 2013.\n\nOpportunities and Challenges With Autonomous Micro Aerial Vehicles. V Kumar, N Michael, SpringerCham, SwitzerlandV. Kumar and N. Michael, Opportunities and Challenges With Autonomous Micro Aerial Vehicles. Cham, Switzerland: Springer, 2017, pp. 41-58.\n\nQuadrotor helicopter trajectory tracking control. G Hoffmann, S Waslander, C Tomlin, Proc. AIAA Guid., Navigat. Control Conf. Exhibit. AIAA Guid., Navigat. Control Conf. ExhibitG. Hoffmann, S. Waslander, and C. Tomlin, \"Quadrotor helicopter trajectory tracking control,\" in Proc. AIAA Guid., Navigat. Control Conf. Exhibit, Aug. 2008, pp. 1-14.\n\nInner-outer loop control for quadrotor UAVs with input and state constraints. N Cao, A F Lynch, IEEE Trans. Control Syst. Technol. 245N. Cao and A. F. Lynch, \"Inner-outer loop control for quadrotor UAVs with input and state constraints,\" IEEE Trans. Control Syst. Technol., vol. 24, no. 5, pp. 1797-1804, Sep. 2016.\n\nGeometric nonlinear PID control of a quadrotor UAV on SE(3). F Goodarzi, D Lee, T Lee, Proc. Eur. Control Conf. (ECC). Eur. Control Conf. (ECC)F. Goodarzi, D. Lee, and T. Lee, \"Geometric nonlinear PID control of a quadrotor UAV on SE(3),\" in Proc. Eur. Control Conf. (ECC), Jul. 2013, pp. 3845-3850.\n\nTrajectory generation and control for precise aggressive maneuvers with quadrotors. D Mellinger, N Michael, V Kumar, Int. J. Robot. Res. 315D. Mellinger, N. Michael, and V. Kumar, \"Trajectory generation and control for precise aggressive maneuvers with quadrotors,\" Int. J. Robot. Res., vol. 31, no. 5, pp. 664-674, 2012.\n\nNonlinear robust tracking control of a quadrotor UAV on SE(3). T Lee, M Leok, N H Mcclamroch, Proc. Amer. Control Conf. (ACC). Amer. Control Conf. (ACC)T. Lee, M. Leok, and N. H. McClamroch, \"Nonlinear robust tracking control of a quadrotor UAV on SE(3),\" in Proc. Amer. Control Conf. (ACC), Jun. 2012, pp. 4649-4654.\n\nRobust global trajectory tracking for underactuated VTOL aerial vehicles using innerouter loop control paradigms. R Naldi, M Furci, R G Sanfelice, L Marconi, IEEE Trans. Autom. Control. 621R. Naldi, M. Furci, R. G. Sanfelice, and L. Marconi, \"Robust global trajectory tracking for underactuated VTOL aerial vehicles using inner- outer loop control paradigms,\" IEEE Trans. Autom. Control, vol. 62, no. 1, pp. 97-112, Jan. 2017.\n\nRobust adaptive tracking control for quadrotors by combining PI and self-tuning regulator. W Lei, C Li, M Z Q Chen, IEEE Trans. Control Syst. Technol. 276W. Lei, C. Li, and M. Z. Q. Chen, \"Robust adaptive tracking control for quadrotors by combining PI and self-tuning regulator,\" IEEE Trans. Control Syst. Technol., vol. 27, no. 6, pp. 2663-2671, Nov. 2019.\n\nAdaptive control of quadrotor UAVs: A design trade study with flight evaluations. Z T Dydek, A M Annaswamy, E Lavretsky, IEEE Trans. Control Syst. Technol. 214Z. T. Dydek, A. M. Annaswamy, and E. Lavretsky, \"Adaptive control of quadrotor UAVs: A design trade study with flight evaluations,\" IEEE Trans. Control Syst. Technol., vol. 21, no. 4, pp. 1400-1406, Jul. 2013.\n\nAccurate tracking of aggressive quadrotor trajectories using incremental nonlinear dynamic inversion and differential flatness. E Tal, S Karaman, IEEE Trans. Control Syst. Technol. 293E. Tal and S. Karaman, \"Accurate tracking of aggressive quadrotor trajectories using incremental nonlinear dynamic inversion and differ- ential flatness,\" IEEE Trans. Control Syst. Technol., vol. 29, no. 3, pp. 1203-1218, May 2021.\n\nBackstepping control for a quadrotor helicopter. T Madani, A Benallegue, Proc. IEEE/RSJ Int. Conf. Intell. Robots Syst. IEEE/RSJ Int. Conf. Intell. Robots SystT. Madani and A. Benallegue, \"Backstepping control for a quadrotor helicopter,\" in Proc. IEEE/RSJ Int. Conf. Intell. Robots Syst., Oct. 2006, pp. 3255-3260.\n\nQuadcopter robust adaptive second order sliding mode control based on PID sliding surface. H L N N Thanh, S K Hong, IEEE Access. 6H. L. N. N. Thanh and S. K. Hong, \"Quadcopter robust adaptive second order sliding mode control based on PID sliding surface,\" IEEE Access, vol. 6, pp. 66850-66860, 2018.\n\nAn introduction to nonlinear robust control for unmanned quadrotor aircraft: How to design control algorithms for quadrotors using sliding mode control and adaptive control techniques. A Afflitto, R B Anderson, K Mohammadi, IEEE Control Syst. 383focus on educationA. L'Afflitto, R. B. Anderson, and K. Mohammadi, \"An introduction to nonlinear robust control for unmanned quadrotor aircraft: How to design control algorithms for quadrotors using sliding mode control and adaptive control techniques [focus on education],\" IEEE Control Syst., vol. 38, no. 3, pp. 102-121, Jun. 2018.\n\nConstrained model predictive control: Stability and optimality. D Q Mayne, J B Rawlings, C V Rao, P O M Scokaert, Automatica. 366D. Q. Mayne, J. B. Rawlings, C. V. Rao, and P. O. M. Scokaert, \"Con- strained model predictive control: Stability and optimality,\" Automatica, vol. 36, no. 6, pp. 789-814, 2000.\n\nModel predictive control: Recent developments and future promise. D Q Mayne, Automatica. 5012D. Q. Mayne, \"Model predictive control: Recent developments and future promise,\" Automatica, vol. 50, no. 12, pp. 2967-2986, Dec. 2014.\n\nModel Predictive Control for Trajectory Tracking of Unmanned Aerial Vehicles Using Robot Operating System. M Kamel, T Stastny, K Alexis, R Siegwart, SpringerCham, SwitzerlandM. Kamel, T. Stastny, K. Alexis, and R. Siegwart, Model Predictive Control for Trajectory Tracking of Unmanned Aerial Vehicles Using Robot Operating System. Cham, Switzerland: Springer, 2017, pp. 3-39.\n\nMinimum jerk trajectory generation of a quadrotor based on the differential flatness. J Yu, Z Cai, Y Wang, Proc. IEEE Chin. Guid., Navigat. Control Conf. IEEE Chin. Guid., Navigat. Control ConfJ. Yu, Z. Cai, and Y. Wang, \"Minimum jerk trajectory generation of a quadrotor based on the differential flatness,\" in Proc. IEEE Chin. Guid., Navigat. Control Conf., Aug. 2014, pp. 832-837.\n\nMinimum-time trajectory generation for quadrotors in constrained environments. S Spedicato, G Notarstefano, IEEE Trans. Control Syst. Technol. 264S. Spedicato and G. Notarstefano, \"Minimum-time trajectory generation for quadrotors in constrained environments,\" IEEE Trans. Control Syst. Technol., vol. 26, no. 4, pp. 1335-1344, Jul. 2018.\n\nL Grüne, J Pannek, Nonlinear Model Predictive Control: Theory and Algorithms. London, U.KSpringerL. Grüne and J. Pannek, Nonlinear Model Predictive Control: Theory and Algorithms. London, U.K.: Springer, Jan. 2011.\n\nModel predictive control of nonholonomic mobile robots without stabilizing constraints and costs. K Worthmann, M Mehrez, M Zanon, G Mann, IEEE Trans. Control Syst. Technol. 244K. Worthmann, M. Mehrez, M. Zanon, and G. Mann, \"Model predic- tive control of nonholonomic mobile robots without stabilizing con- straints and costs,\" IEEE Trans. Control Syst. Technol., vol. 24, no. 4, pp. 1394-1406, Jul. 2016.\n\nROS based real-time motion control for robotic visual arts exhibit using decawave local positioning system. M A K Gomaa, O Silva, G K I Mann, R G Gosine, R Hengeveld, Proc. Amer. Control Conf. (ACC). Amer. Control Conf. (ACC)M. A. K. Gomaa, O. De Silva, G. K. I. Mann, R. G. Gosine, and R. Hengeveld, \"ROS based real-time motion control for robotic visual arts exhibit using decawave local positioning system,\" in Proc. Amer. Control Conf. (ACC), Jul. 2020, pp. 653-658.\n\nNonlinear model predictive control on SE(3) for quadrotor aggressive maneuvers. J C Pereira, V J S Leite, G V Raffo, J. Intell. Robot. Syst. 1013J. C. Pereira, V. J. S. Leite, and G. V. Raffo, \"Nonlinear model predictive control on SE(3) for quadrotor aggressive maneuvers,\" J. Intell. Robot. Syst., vol. 101, no. 3, pp. 1-15, Mar. 2021.\n\nQuadratic costs do not always work in MPC. M A Müller, K Worthmann, Automatica. 82M. A. Müller and K. Worthmann, \"Quadratic costs do not always work in MPC,\" Automatica, vol. 82, pp. 269-277, Aug. 2017.\n\nA quasi-infinite horizon nonlinear model predictive control scheme with guaranteed stability. H Chen, F Allgöwer, Automatica. 3410H. Chen and F. Allgöwer, \"A quasi-infinite horizon nonlinear model predictive control scheme with guaranteed stability,\" Automatica, vol. 34, no. 10, pp. 1205-1217, Oct. 1998.\n\nFeasibility and stability of constrained finite receding horizon control. J A Primbs, V Nevistić, Automatica. 367J. A. Primbs and V. Nevistić, \"Feasibility and stability of constrained finite receding horizon control,\" Automatica, vol. 36, no. 7, pp. 965-971, Jul. 2000.\n\nSuboptimal model predictive control (feasibility implies stability). P O M Scokaert, D Q Mayne, J B Rawlings, IEEE Trans. Autom. Control. 443P. O. M. Scokaert, D. Q. Mayne, and J. B. Rawlings, \"Suboptimal model predictive control (feasibility implies stability),\" IEEE Trans. Autom. Control, vol. 44, no. 3, pp. 648-654, Mar. 1999.\n\nAnalysis and design of unconstrained nonlinear MPC schemes for finite and infinite dimensional systems. L Grüne, SIAM J. Control Optim. 482L. Grüne, \"Analysis and design of unconstrained nonlinear MPC schemes for finite and infinite dimensional systems,\" SIAM J. Control Optim., vol. 48, no. 2, pp. 1206-1228, 2009.\n\nStability analysis of unconstrained receding horizon control schemes. K Worthmann, Ph.D. dissertation, Dept. Math., Phys. Comput. Sci., Bayreuth Univ. K. Worthmann, \"Stability analysis of unconstrained receding horizon control schemes,\" Ph.D. dissertation, Dept. Math., Phys. Comput. Sci., Bayreuth Univ., Bayreuth, Germany, 2011.\n\nEstimates of the prediction horizon length in MPC: A numerical case study. K Worthmann, IFAC Proc. Volumes. 45K. Worthmann, \"Estimates of the prediction horizon length in MPC: A numerical case study,\" IFAC Proc. Volumes, vol. 45, no. 17, pp. 232-237, 2012.\n\nOptimal infinite-horizon feedback laws for a general class of constrained discrete-time systems: Stability and moving-horizon approximations. S S Keertht, E G Gilbert, J. Optim. Theory Appl. 57S. S. Keertht and E. G. Gilbert, \"Optimal infinite-horizon feedback laws for a general class of constrained discrete-time systems: Stability and moving-horizon approximations,\" J. Optim. Theory Appl., vol. 57, pp. 265-293, 1988.\n\nInteraction of open and closed loop control in MPC. K Worthmann, M W Mehrez, G K I Mann, R G Gosine, J Pannek, Automatica. 82K. Worthmann, M. W. Mehrez, G. K. I. Mann, R. G. Gosine, and J. Pannek, \"Interaction of open and closed loop control in MPC,\" Automatica, vol. 82, pp. 243-250, Aug. 2017.\n\nStability and feasibility of state constrained MPC without stabilizing terminal constraints. A Boccia, L Grüne, K Worthmann, Syst. Control Lett. 72A. Boccia, L. Grüne, and K. Worthmann, \"Stability and feasibility of state constrained MPC without stabilizing terminal constraints,\" Syst. Control Lett., vol. 72, pp. 14-21, Oct. 2014.\n\nNMPC without terminal constraints. L Grüne, IFAC Proc. Volumes. 45L. Grüne, \"NMPC without terminal constraints,\" IFAC Proc. Volumes, vol. 45, no. 17, pp. 1-13, 2012.\n\nReceding horizon quadratic optimal control: Performance bounds for a finite horizon strategy. V Nevistic, J A Primbs, Proc. Eur. Control Conf. (ECC. Eur. Control Conf. (ECCV. Nevistic and J. A. Primbs, \"Receding horizon quadratic optimal control: Performance bounds for a finite horizon strategy,\" in Proc. Eur. Control Conf. (ECC), 1997, pp. 3584-3589.\n\nModel predictive control: For want of a local control Lyapunov function, all is not lost. G Grimm, M J Messina, S E Tuna, A R Teel, IEEE Trans. Autom. Control. 505G. Grimm, M. J. Messina, S. E. Tuna, and A. R. Teel, \"Model predictive control: For want of a local control Lyapunov function, all is not lost,\" IEEE Trans. Autom. Control, vol. 50, no. 5, pp. 546-558, May 2005.\n\nModel predictive control, cost controllability, and homogeneity. J.-M Coron, L Grüne, K Worthmann, SIAM J. Control Optim. 585J.-M. Coron, L. Grüne, and K. Worthmann, \"Model predictive control, cost controllability, and homogeneity,\" SIAM J. Control Optim., vol. 58, no. 5, pp. 2979-2996, Jan. 2020.\n\nShorter horizons for model predictive control. S E Tuna, M J Messina, A R Teel, Proc. Amer. Control Conf. Amer. Control ConfS. E. Tuna, M. J. Messina, and A. R. Teel, \"Shorter horizons for model predictive control,\" in Proc. Amer. Control Conf., 2006, pp. 863-868.\n\nModel predictive control without terminal constraints or costs for holonomic mobile robots. M W Mehrez, K Worthmann, J P V Cenerini, M Osman, W W Melek, S Jeon, Robot. Auto. Syst. 127Art. no. 103468M. W. Mehrez, K. Worthmann, J. P. V. Cenerini, M. Osman, W. W. Melek, and S. Jeon, \"Model predictive control without terminal constraints or costs for holonomic mobile robots,\" Robot. Auto. Syst., vol. 127, May 2020, Art. no. 103468.\n\nNonlinear model predictive tracking control for rotorcraft-based unmanned aerial vehicles. H J Kim, D H Shim, S Sastry, Proc. Amer. Control Conf. Amer. Control Conf5H. J. Kim, D. H. Shim, and S. Sastry, \"Nonlinear model predictive tracking control for rotorcraft-based unmanned aerial vehicles,\" in Proc. Amer. Control Conf., vol. 5, 2002, pp. 3576-3581.\n\nQuadrotor trajectory tracking control using non-linear model predictive control with ROS implementation. M Owis, S El-Bouhy, A El-Badawy, Proc. 7th Int. Conf. Control, Mechatronics Autom. (ICCMA). 7th Int. Conf. Control, Mechatronics Autom. (ICCMA)M. Owis, S. El-Bouhy, and A. El-Badawy, \"Quadrotor trajectory tracking control using non-linear model predictive control with ROS implemen- tation,\" in Proc. 7th Int. Conf. Control, Mechatronics Autom. (ICCMA), Nov. 2019, pp. 243-247.\n\nModel predictive tracking controller for quadcopters with setpoint convergence guarantees. A Andrien, D Kremers, D Kooijman, D Antunes, Proc. Amer. Control Conf. (ACC). Amer. Control Conf. (ACC)A. Andrien, D. Kremers, D. Kooijman, and D. Antunes, \"Model predic- tive tracking controller for quadcopters with setpoint convergence guar- antees,\" in Proc. Amer. Control Conf. (ACC), Jul. 2020, pp. 3205-3210.\n\nRobust nonlinear model predictive control based visual servoing of quadrotor UAVs. K Zhang, Y Shi, H Sheng, IEEE/ASME Trans. Mechatronics. 262K. Zhang, Y. Shi, and H. Sheng, \"Robust nonlinear model predictive control based visual servoing of quadrotor UAVs,\" IEEE/ASME Trans. Mechatronics, vol. 26, no. 2, pp. 700-708, Apr. 2021.\n\nStability guarantees for translational thrust-propelled vehicles dynamics through NMPC designs. N T Nguyen, I Prodan, L Lefevre, IEEE Trans. Control Syst. Technol. 291N. T. Nguyen, I. Prodan, and L. Lefevre, \"Stability guarantees for trans- lational thrust-propelled vehicles dynamics through NMPC designs,\" IEEE Trans. Control Syst. Technol., vol. 29, no. 1, pp. 207-219, Jan. 2021.\n\nDifferential flatness of quadrotor dynamics subject to rotor drag for accurate tracking of highspeed trajectories. M Faessler, A Franchi, D Scaramuzza, IEEE Robot. Autom. Lett. 32M. Faessler, A. Franchi, and D. Scaramuzza, \"Differential flatness of quadrotor dynamics subject to rotor drag for accurate tracking of high- speed trajectories,\" IEEE Robot. Autom. Lett., vol. 3, no. 2, pp. 620-626, Apr. 2018.\n\nNonlinear dynamic modeling for high performance control of a quadrotor. M Bangura, R Mahony, Proc. Australas. Conf. Robot. Autom. (ACRA). Australas. Conf. Robot. Autom. (ACRA)Wellington, New ZealandVictoria Univ. of WellingtonM. Bangura and R. Mahony, \"Nonlinear dynamic modeling for high performance control of a quadrotor,\" in Proc. Australas. Conf. Robot. Autom. (ACRA). Wellington, New Zealand: Victoria Univ. of Wellington, Dec. 2012, pp. 1-10.\n\nReceding-horizon lattice-based motion planning with dynamic obstacle avoidance. O Andersson, O Ljungqvist, M Tiger, D Axehill, F Heintz, Proc. IEEE Conf. Decis. Control (CDC). IEEE Conf. Decis. Control (CDC)O. Andersson, O. Ljungqvist, M. Tiger, D. Axehill, and F. Heintz, \"Receding-horizon lattice-based motion planning with dynamic obstacle avoidance,\" in Proc. IEEE Conf. Decis. Control (CDC), Dec. 2018, pp. 4467-4474.\n\nA computationally efficient motion primitive for quadrocopter trajectory generation. M W Mueller, M Hehn, R D&apos;andrea, IEEE Trans. Robot. 316M. W. Mueller, M. Hehn, and R. D'Andrea, \"A computationally efficient motion primitive for quadrocopter trajectory generation,\" IEEE Trans. Robot., vol. 31, no. 6, pp. 1294-1310, Dec. 2015.\n\nAsymptotic stability of hierarchical inner-outer loop-based flight controllers. I Fantoni, R Lozano, F Kendoul, IFAC Proc. Volumes. 41I. Fantoni, R. Lozano, and F. Kendoul, \"Asymptotic stability of hierar- chical inner-outer loop-based flight controllers,\" IFAC Proc. Volumes, vol. 41, no. 2, pp. 1741-1746, 2008.\n\nAscTec Hummingbird With Autopilot User's Manual. Ascending TechnologiesAscending Technologies. AscTec Hummingbird With Autopilot User's Manual. Accessed: Apr. 1, 2021. [Online]. Available: http://robotics. caltech.edu/~ndutoit/wiki/images/7/70/AscTec_AutoPilot_manual_ v1.0_small.pdf\n\nEnergy-efficient autonomous four-rotor flying robot controlled at 1 kHz. D Gurdan, J Stumpf, M Achtelik, K.-M Doth, G Hirzinger, D Rus, Proc. IEEE Int. Conf. Robot. Autom. IEEE Int. Conf. Robot. AutomD. Gurdan, J. Stumpf, M. Achtelik, K.-M. Doth, G. Hirzinger, and D. Rus, \"Energy-efficient autonomous four-rotor flying robot controlled at 1 kHz,\" in Proc. IEEE Int. Conf. Robot. Autom., Apr. 2007, pp. 361-366.\n\nCasADi: A software framework for nonlinear optimization and optimal control. J A E Andersson, J Gillis, G Horn, J B Rawlings, M Diehl, Math. Program. Comput. 111J. A. E. Andersson, J. Gillis, G. Horn, J. B. Rawlings, and M. Diehl, \"CasADi: A software framework for nonlinear optimization and optimal control,\" Math. Program. Comput., vol. 11, no. 1, pp. 1-36, Mar. 2019.\n\nA multiple shooting algorithm for direct solution of optimal control problems. H G Bock, K.-J Plitt, IFAC Proc. Volumes. 17H. G. Bock and K.-J. Plitt, \"A multiple shooting algorithm for direct solution of optimal control problems,\" IFAC Proc. Volumes, vol. 17, no. 2, pp. 1603-1608, Jul. 1984.\n\nLinear vs nonlinear MPC for trajectory tracking applied to rotary wing micro aerial vehicles. M Kamel, M Burri, R Siegwart, IFAC-PapersOnLine. 501M. Kamel, M. Burri, and R. Siegwart, \"Linear vs nonlinear MPC for trajectory tracking applied to rotary wing micro aerial vehicles,\" IFAC- PapersOnLine, vol. 50, no. 1, pp. 3463-3469, Jul. 2017.\n", "annotations": {"author": "[{\"end\":145,\"start\":127},{\"end\":173,\"start\":146},{\"end\":202,\"start\":174},{\"end\":220,\"start\":203}]", "publisher": null, "author_last_name": "[{\"end\":144,\"start\":139},{\"end\":172,\"start\":164},{\"end\":201,\"start\":197},{\"end\":219,\"start\":213}]", "author_first_name": "[{\"end\":134,\"start\":127},{\"end\":138,\"start\":135},{\"end\":163,\"start\":158},{\"end\":192,\"start\":186},{\"end\":196,\"start\":193},{\"end\":210,\"start\":203},{\"end\":212,\"start\":211}]", "author_affiliation": null, "title": "[{\"end\":114,\"start\":1},{\"end\":334,\"start\":221}]", "venue": "[{\"end\":383,\"start\":336}]", "abstract": "[{\"end\":2329,\"start\":426}]", "bib_ref": "[{\"end\":2522,\"start\":2512},{\"attributes\":{\"ref_id\":\"b0\"},\"end\":2634,\"start\":2631},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":2656,\"start\":2653},{\"attributes\":{\"ref_id\":\"b2\"},\"end\":2684,\"start\":2681},{\"attributes\":{\"ref_id\":\"b3\"},\"end\":2789,\"start\":2786},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":3096,\"start\":3093},{\"attributes\":{\"ref_id\":\"b5\"},\"end\":3600,\"start\":3597},{\"attributes\":{\"ref_id\":\"b5\"},\"end\":3837,\"start\":3834},{\"attributes\":{\"ref_id\":\"b6\"},\"end\":3855,\"start\":3852},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":3861,\"start\":3857},{\"attributes\":{\"ref_id\":\"b6\"},\"end\":4218,\"start\":4215},{\"attributes\":{\"ref_id\":\"b7\"},\"end\":4250,\"start\":4247},{\"attributes\":{\"ref_id\":\"b8\"},\"end\":4270,\"start\":4267},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":4276,\"start\":4272},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":4299,\"start\":4295},{\"attributes\":{\"ref_id\":\"b11\"},\"end\":4305,\"start\":4301},{\"attributes\":{\"ref_id\":\"b12\"},\"end\":4386,\"start\":4382},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":4392,\"start\":4388},{\"attributes\":{\"ref_id\":\"b16\"},\"end\":5324,\"start\":5320},{\"attributes\":{\"ref_id\":\"b17\"},\"end\":5330,\"start\":5326},{\"attributes\":{\"ref_id\":\"b18\"},\"end\":5435,\"start\":5431},{\"attributes\":{\"ref_id\":\"b19\"},\"end\":5454,\"start\":5450},{\"attributes\":{\"ref_id\":\"b20\"},\"end\":5499,\"start\":5495},{\"attributes\":{\"ref_id\":\"b21\"},\"end\":5745,\"start\":5741},{\"attributes\":{\"ref_id\":\"b18\"},\"end\":5843,\"start\":5839},{\"attributes\":{\"ref_id\":\"b22\"},\"end\":5849,\"start\":5845},{\"attributes\":{\"ref_id\":\"b23\"},\"end\":5855,\"start\":5851},{\"attributes\":{\"ref_id\":\"b24\"},\"end\":5873,\"start\":5869},{\"attributes\":{\"ref_id\":\"b2\"},\"end\":6178,\"start\":6175},{\"attributes\":{\"ref_id\":\"b21\"},\"end\":6620,\"start\":6616},{\"attributes\":{\"ref_id\":\"b25\"},\"end\":7378,\"start\":7374},{\"attributes\":{\"ref_id\":\"b26\"},\"end\":7949,\"start\":7945},{\"attributes\":{\"ref_id\":\"b16\"},\"end\":7981,\"start\":7977},{\"attributes\":{\"ref_id\":\"b27\"},\"end\":8109,\"start\":8105},{\"attributes\":{\"ref_id\":\"b28\"},\"end\":8561,\"start\":8557},{\"attributes\":{\"ref_id\":\"b29\"},\"end\":8690,\"start\":8686},{\"attributes\":{\"ref_id\":\"b31\"},\"end\":8696,\"start\":8692},{\"attributes\":{\"ref_id\":\"b29\"},\"end\":9095,\"start\":9091},{\"attributes\":{\"ref_id\":\"b31\"},\"end\":9101,\"start\":9097},{\"attributes\":{\"ref_id\":\"b21\"},\"end\":9396,\"start\":9392},{\"end\":9405,\"start\":9396},{\"attributes\":{\"ref_id\":\"b18\"},\"end\":9774,\"start\":9770},{\"attributes\":{\"ref_id\":\"b32\"},\"end\":9797,\"start\":9793},{\"attributes\":{\"ref_id\":\"b33\"},\"end\":10141,\"start\":10137},{\"attributes\":{\"ref_id\":\"b31\"},\"end\":10433,\"start\":10429},{\"attributes\":{\"ref_id\":\"b17\"},\"end\":10507,\"start\":10503},{\"attributes\":{\"ref_id\":\"b34\"},\"end\":11080,\"start\":11076},{\"attributes\":{\"ref_id\":\"b27\"},\"end\":11131,\"start\":11127},{\"attributes\":{\"ref_id\":\"b21\"},\"end\":11303,\"start\":11299},{\"attributes\":{\"ref_id\":\"b27\"},\"end\":11309,\"start\":11305},{\"attributes\":{\"ref_id\":\"b21\"},\"end\":11603,\"start\":11599},{\"attributes\":{\"ref_id\":\"b21\"},\"end\":11626,\"start\":11622},{\"attributes\":{\"ref_id\":\"b35\"},\"end\":11641,\"start\":11637},{\"attributes\":{\"ref_id\":\"b18\"},\"end\":13286,\"start\":13282},{\"attributes\":{\"ref_id\":\"b36\"},\"end\":13340,\"start\":13336},{\"attributes\":{\"ref_id\":\"b37\"},\"end\":13349,\"start\":13345},{\"attributes\":{\"ref_id\":\"b37\"},\"end\":13670,\"start\":13666},{\"attributes\":{\"ref_id\":\"b37\"},\"end\":13689,\"start\":13685},{\"attributes\":{\"ref_id\":\"b29\"},\"end\":13948,\"start\":13944},{\"attributes\":{\"ref_id\":\"b31\"},\"end\":13954,\"start\":13950},{\"attributes\":{\"ref_id\":\"b38\"},\"end\":14099,\"start\":14095},{\"attributes\":{\"ref_id\":\"b39\"},\"end\":14108,\"start\":14104},{\"attributes\":{\"ref_id\":\"b21\"},\"end\":14693,\"start\":14689},{\"end\":14702,\"start\":14693},{\"attributes\":{\"ref_id\":\"b22\"},\"end\":14763,\"start\":14759},{\"attributes\":{\"ref_id\":\"b40\"},\"end\":14772,\"start\":14768},{\"attributes\":{\"ref_id\":\"b41\"},\"end\":15597,\"start\":15593},{\"attributes\":{\"ref_id\":\"b18\"},\"end\":15955,\"start\":15951},{\"attributes\":{\"ref_id\":\"b42\"},\"end\":15961,\"start\":15957},{\"attributes\":{\"ref_id\":\"b43\"},\"end\":15967,\"start\":15963},{\"attributes\":{\"ref_id\":\"b24\"},\"end\":16607,\"start\":16603},{\"attributes\":{\"ref_id\":\"b44\"},\"end\":16795,\"start\":16791},{\"attributes\":{\"ref_id\":\"b44\"},\"end\":17110,\"start\":17106},{\"attributes\":{\"ref_id\":\"b45\"},\"end\":17779,\"start\":17775},{\"attributes\":{\"ref_id\":\"b18\"},\"end\":20075,\"start\":20071},{\"attributes\":{\"ref_id\":\"b46\"},\"end\":21682,\"start\":21678},{\"attributes\":{\"ref_id\":\"b47\"},\"end\":21700,\"start\":21696},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":22858,\"start\":22855},{\"attributes\":{\"ref_id\":\"b5\"},\"end\":24839,\"start\":24836},{\"attributes\":{\"ref_id\":\"b21\"},\"end\":25824,\"start\":25820},{\"end\":25830,\"start\":25824},{\"attributes\":{\"ref_id\":\"b38\"},\"end\":27346,\"start\":27342},{\"attributes\":{\"ref_id\":\"b21\"},\"end\":27734,\"start\":27730},{\"attributes\":{\"ref_id\":\"b31\"},\"end\":27740,\"start\":27736},{\"attributes\":{\"ref_id\":\"b35\"},\"end\":27750,\"start\":27746},{\"attributes\":{\"ref_id\":\"b12\"},\"end\":30225,\"start\":30221},{\"attributes\":{\"ref_id\":\"b21\"},\"end\":30270,\"start\":30266},{\"end\":30275,\"start\":30270},{\"attributes\":{\"ref_id\":\"b29\"},\"end\":30285,\"start\":30281},{\"attributes\":{\"ref_id\":\"b21\"},\"end\":30425,\"start\":30421},{\"attributes\":{\"ref_id\":\"b34\"},\"end\":30434,\"start\":30430},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":31784,\"start\":31780},{\"attributes\":{\"ref_id\":\"b35\"},\"end\":31964,\"start\":31960},{\"end\":31973,\"start\":31964},{\"attributes\":{\"ref_id\":\"b22\"},\"end\":33030,\"start\":33026},{\"end\":33037,\"start\":33030},{\"attributes\":{\"ref_id\":\"b48\"},\"end\":33775,\"start\":33771},{\"attributes\":{\"ref_id\":\"b19\"},\"end\":34475,\"start\":34471},{\"attributes\":{\"ref_id\":\"b19\"},\"end\":34501,\"start\":34497},{\"attributes\":{\"ref_id\":\"b21\"},\"end\":35349,\"start\":35345},{\"attributes\":{\"ref_id\":\"b21\"},\"end\":36194,\"start\":36190},{\"attributes\":{\"ref_id\":\"b22\"},\"end\":36217,\"start\":36213},{\"attributes\":{\"ref_id\":\"b34\"},\"end\":36241,\"start\":36237},{\"attributes\":{\"ref_id\":\"b23\"},\"end\":36375,\"start\":36371},{\"attributes\":{\"ref_id\":\"b19\"},\"end\":36403,\"start\":36399},{\"attributes\":{\"ref_id\":\"b24\"},\"end\":36456,\"start\":36452},{\"attributes\":{\"ref_id\":\"b24\"},\"end\":36630,\"start\":36626},{\"attributes\":{\"ref_id\":\"b24\"},\"end\":36693,\"start\":36689},{\"attributes\":{\"ref_id\":\"b17\"},\"end\":36729,\"start\":36725},{\"attributes\":{\"ref_id\":\"b24\"},\"end\":36927,\"start\":36923},{\"attributes\":{\"ref_id\":\"b24\"},\"end\":37335,\"start\":37331},{\"attributes\":{\"ref_id\":\"b18\"},\"end\":37641,\"start\":37637},{\"attributes\":{\"ref_id\":\"b29\"},\"end\":38284,\"start\":38280},{\"attributes\":{\"ref_id\":\"b13\"},\"end\":39192,\"start\":39188},{\"attributes\":{\"ref_id\":\"b49\"},\"end\":39553,\"start\":39549},{\"attributes\":{\"ref_id\":\"b13\"},\"end\":39860,\"start\":39856},{\"attributes\":{\"ref_id\":\"b35\"},\"end\":40166,\"start\":40162},{\"attributes\":{\"ref_id\":\"b37\"},\"end\":40898,\"start\":40894},{\"attributes\":{\"ref_id\":\"b50\"},\"end\":41481,\"start\":41477},{\"end\":41487,\"start\":41481},{\"attributes\":{\"ref_id\":\"b51\"},\"end\":41769,\"start\":41765},{\"attributes\":{\"ref_id\":\"b17\"},\"end\":42211,\"start\":42207},{\"attributes\":{\"ref_id\":\"b52\"},\"end\":42408,\"start\":42404},{\"attributes\":{\"ref_id\":\"b18\"},\"end\":42542,\"start\":42538},{\"attributes\":{\"ref_id\":\"b0\"},\"end\":42545,\"start\":42544},{\"attributes\":{\"ref_id\":\"b53\"},\"end\":42749,\"start\":42745},{\"attributes\":{\"ref_id\":\"b54\"},\"end\":43011,\"start\":43007},{\"attributes\":{\"ref_id\":\"b53\"},\"end\":43093,\"start\":43089},{\"end\":43101,\"start\":43093},{\"attributes\":{\"ref_id\":\"b18\"},\"end\":44107,\"start\":44103},{\"attributes\":{\"ref_id\":\"b39\"},\"end\":44211,\"start\":44207},{\"attributes\":{\"ref_id\":\"b38\"},\"end\":44666,\"start\":44662},{\"attributes\":{\"ref_id\":\"b18\"},\"end\":46262,\"start\":46258},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":46339,\"start\":46338},{\"attributes\":{\"ref_id\":\"b18\"},\"end\":46356,\"start\":46352},{\"attributes\":{\"ref_id\":\"b55\"},\"end\":46633,\"start\":46629},{\"attributes\":{\"ref_id\":\"b18\"},\"end\":47145,\"start\":47141},{\"attributes\":{\"ref_id\":\"b18\"},\"end\":47214,\"start\":47210},{\"attributes\":{\"ref_id\":\"b39\"},\"end\":47418,\"start\":47414},{\"attributes\":{\"ref_id\":\"b18\"},\"end\":48937,\"start\":48933},{\"attributes\":{\"ref_id\":\"b51\"},\"end\":50463,\"start\":50459}]", "figure": "[{\"attributes\":{\"id\":\"fig_0\"},\"end\":56233,\"start\":56080},{\"attributes\":{\"id\":\"fig_1\"},\"end\":56557,\"start\":56234},{\"attributes\":{\"id\":\"fig_2\"},\"end\":56711,\"start\":56558},{\"attributes\":{\"id\":\"fig_3\"},\"end\":56839,\"start\":56712},{\"attributes\":{\"id\":\"fig_4\"},\"end\":57009,\"start\":56840},{\"attributes\":{\"id\":\"fig_5\"},\"end\":57389,\"start\":57010},{\"attributes\":{\"id\":\"fig_6\"},\"end\":57644,\"start\":57390},{\"attributes\":{\"id\":\"fig_7\"},\"end\":57884,\"start\":57645},{\"attributes\":{\"id\":\"fig_8\"},\"end\":58124,\"start\":57885},{\"attributes\":{\"id\":\"fig_9\"},\"end\":58433,\"start\":58125},{\"attributes\":{\"id\":\"fig_10\"},\"end\":58801,\"start\":58434},{\"attributes\":{\"id\":\"fig_11\"},\"end\":59092,\"start\":58802},{\"attributes\":{\"id\":\"fig_12\"},\"end\":59186,\"start\":59093},{\"attributes\":{\"id\":\"fig_13\"},\"end\":59355,\"start\":59187},{\"attributes\":{\"id\":\"fig_14\"},\"end\":59551,\"start\":59356},{\"attributes\":{\"id\":\"fig_15\"},\"end\":59748,\"start\":59552},{\"attributes\":{\"id\":\"fig_16\"},\"end\":59827,\"start\":59749},{\"attributes\":{\"id\":\"tab_0\",\"type\":\"table\"},\"end\":60626,\"start\":59828},{\"attributes\":{\"id\":\"tab_1\",\"type\":\"table\"},\"end\":60723,\"start\":60627},{\"attributes\":{\"id\":\"tab_3\",\"type\":\"table\"},\"end\":60731,\"start\":60724},{\"attributes\":{\"id\":\"tab_4\",\"type\":\"table\"},\"end\":60982,\"start\":60732}]", "paragraph": "[{\"end\":4730,\"start\":2348},{\"end\":5645,\"start\":4732},{\"end\":6368,\"start\":5647},{\"end\":6914,\"start\":6370},{\"end\":9406,\"start\":6916},{\"end\":10738,\"start\":9408},{\"end\":11995,\"start\":10740},{\"end\":12252,\"start\":11997},{\"end\":13287,\"start\":12254},{\"end\":14703,\"start\":13308},{\"end\":15573,\"start\":14705},{\"end\":18405,\"start\":15575},{\"end\":19024,\"start\":18428},{\"end\":19263,\"start\":19191},{\"end\":20576,\"start\":19293},{\"end\":21201,\"start\":20972},{\"end\":22195,\"start\":21245},{\"end\":22956,\"start\":22507},{\"end\":22959,\"start\":22958},{\"end\":23189,\"start\":23096},{\"end\":23321,\"start\":23236},{\"end\":23559,\"start\":23488},{\"end\":23677,\"start\":23561},{\"end\":23940,\"start\":23886},{\"end\":24095,\"start\":24013},{\"end\":24347,\"start\":24127},{\"end\":24676,\"start\":24382},{\"end\":24971,\"start\":24716},{\"end\":25181,\"start\":25069},{\"end\":25587,\"start\":25258},{\"end\":26049,\"start\":25589},{\"end\":26160,\"start\":26104},{\"end\":26317,\"start\":26209},{\"end\":26508,\"start\":26359},{\"end\":27536,\"start\":26555},{\"end\":27596,\"start\":27580},{\"end\":28119,\"start\":27688},{\"end\":28516,\"start\":28345},{\"end\":28812,\"start\":28636},{\"end\":29242,\"start\":28902},{\"end\":29331,\"start\":29259},{\"end\":29571,\"start\":29333},{\"end\":29713,\"start\":29647},{\"end\":29809,\"start\":29715},{\"end\":29920,\"start\":29811},{\"end\":30041,\"start\":29992},{\"end\":30232,\"start\":30099},{\"end\":30580,\"start\":30234},{\"end\":30788,\"start\":30609},{\"end\":31093,\"start\":30849},{\"end\":31196,\"start\":31095},{\"end\":31661,\"start\":31233},{\"end\":31892,\"start\":31663},{\"end\":32279,\"start\":31918},{\"end\":32537,\"start\":32330},{\"end\":32717,\"start\":32575},{\"end\":32935,\"start\":32805},{\"end\":33166,\"start\":32993},{\"end\":33262,\"start\":33168},{\"end\":33376,\"start\":33317},{\"end\":33451,\"start\":33412},{\"end\":33691,\"start\":33515},{\"end\":34629,\"start\":33693},{\"end\":35014,\"start\":34793},{\"end\":35166,\"start\":35101},{\"end\":35430,\"start\":35325},{\"end\":35518,\"start\":35483},{\"end\":35685,\"start\":35662},{\"end\":35852,\"start\":35751},{\"end\":36542,\"start\":35918},{\"end\":36769,\"start\":36544},{\"end\":36973,\"start\":36895},{\"end\":37165,\"start\":37108},{\"end\":37355,\"start\":37300},{\"end\":37642,\"start\":37538},{\"end\":37730,\"start\":37644},{\"end\":37837,\"start\":37814},{\"end\":38081,\"start\":37921},{\"end\":38353,\"start\":38135},{\"end\":38554,\"start\":38440},{\"end\":38692,\"start\":38670},{\"end\":38784,\"start\":38760},{\"end\":38968,\"start\":38853},{\"end\":39420,\"start\":38970},{\"end\":39456,\"start\":39450},{\"end\":39887,\"start\":39458},{\"end\":39971,\"start\":39970},{\"end\":40053,\"start\":39973},{\"end\":40502,\"start\":40139},{\"end\":41093,\"start\":40885},{\"end\":41488,\"start\":41095},{\"end\":42643,\"start\":41504},{\"end\":43452,\"start\":42717},{\"end\":43584,\"start\":43477},{\"end\":44772,\"start\":43586},{\"end\":45992,\"start\":44774},{\"end\":46834,\"start\":45994},{\"end\":48806,\"start\":46957},{\"end\":50308,\"start\":48808},{\"end\":51387,\"start\":50339},{\"end\":53438,\"start\":51389},{\"end\":53883,\"start\":53440},{\"end\":54324,\"start\":53885},{\"end\":56035,\"start\":54344},{\"end\":56079,\"start\":56037}]", "formula": "[{\"attributes\":{\"id\":\"formula_0\"},\"end\":19190,\"start\":19025},{\"attributes\":{\"id\":\"formula_1\"},\"end\":20971,\"start\":20577},{\"attributes\":{\"id\":\"formula_2\"},\"end\":21244,\"start\":21202},{\"attributes\":{\"id\":\"formula_3\"},\"end\":22506,\"start\":22196},{\"attributes\":{\"id\":\"formula_4\"},\"end\":23095,\"start\":22960},{\"attributes\":{\"id\":\"formula_5\"},\"end\":23235,\"start\":23190},{\"attributes\":{\"id\":\"formula_6\"},\"end\":23487,\"start\":23322},{\"attributes\":{\"id\":\"formula_7\"},\"end\":23885,\"start\":23678},{\"attributes\":{\"id\":\"formula_8\"},\"end\":24012,\"start\":23941},{\"attributes\":{\"id\":\"formula_9\"},\"end\":24381,\"start\":24348},{\"attributes\":{\"id\":\"formula_10\"},\"end\":24715,\"start\":24677},{\"attributes\":{\"id\":\"formula_11\"},\"end\":25068,\"start\":24972},{\"attributes\":{\"id\":\"formula_12\"},\"end\":25257,\"start\":25182},{\"attributes\":{\"id\":\"formula_13\"},\"end\":26103,\"start\":26050},{\"attributes\":{\"id\":\"formula_14\"},\"end\":26208,\"start\":26161},{\"attributes\":{\"id\":\"formula_15\"},\"end\":26358,\"start\":26318},{\"attributes\":{\"id\":\"formula_16\"},\"end\":26554,\"start\":26509},{\"attributes\":{\"id\":\"formula_17\"},\"end\":27579,\"start\":27537},{\"attributes\":{\"id\":\"formula_18\"},\"end\":28344,\"start\":28120},{\"attributes\":{\"id\":\"formula_19\"},\"end\":28635,\"start\":28573},{\"attributes\":{\"id\":\"formula_20\"},\"end\":28901,\"start\":28813},{\"attributes\":{\"id\":\"formula_21\"},\"end\":29609,\"start\":29572},{\"attributes\":{\"id\":\"formula_22\"},\"end\":29646,\"start\":29609},{\"attributes\":{\"id\":\"formula_23\"},\"end\":29991,\"start\":29921},{\"attributes\":{\"id\":\"formula_24\"},\"end\":30098,\"start\":30042},{\"attributes\":{\"id\":\"formula_25\"},\"end\":30848,\"start\":30789},{\"attributes\":{\"id\":\"formula_26\"},\"end\":31232,\"start\":31197},{\"attributes\":{\"id\":\"formula_27\"},\"end\":31917,\"start\":31893},{\"attributes\":{\"id\":\"formula_28\"},\"end\":32804,\"start\":32718},{\"attributes\":{\"id\":\"formula_29\"},\"end\":32992,\"start\":32936},{\"attributes\":{\"id\":\"formula_30\"},\"end\":33316,\"start\":33263},{\"attributes\":{\"id\":\"formula_31\"},\"end\":33411,\"start\":33377},{\"attributes\":{\"id\":\"formula_32\"},\"end\":33514,\"start\":33452},{\"attributes\":{\"id\":\"formula_33\"},\"end\":34727,\"start\":34630},{\"attributes\":{\"id\":\"formula_34\"},\"end\":34792,\"start\":34727},{\"attributes\":{\"id\":\"formula_35\"},\"end\":35100,\"start\":35015},{\"attributes\":{\"id\":\"formula_36\"},\"end\":35324,\"start\":35167},{\"attributes\":{\"id\":\"formula_37\"},\"end\":35482,\"start\":35431},{\"attributes\":{\"id\":\"formula_38\"},\"end\":35661,\"start\":35519},{\"attributes\":{\"id\":\"formula_39\"},\"end\":35750,\"start\":35686},{\"attributes\":{\"id\":\"formula_40\"},\"end\":35917,\"start\":35853},{\"attributes\":{\"id\":\"formula_41\"},\"end\":36894,\"start\":36770},{\"attributes\":{\"id\":\"formula_42\"},\"end\":37107,\"start\":36974},{\"attributes\":{\"id\":\"formula_43\"},\"end\":37299,\"start\":37166},{\"attributes\":{\"id\":\"formula_44\"},\"end\":37537,\"start\":37356},{\"attributes\":{\"id\":\"formula_45\"},\"end\":37813,\"start\":37731},{\"attributes\":{\"id\":\"formula_46\"},\"end\":37920,\"start\":37838},{\"attributes\":{\"id\":\"formula_47\"},\"end\":38439,\"start\":38354},{\"attributes\":{\"id\":\"formula_48\"},\"end\":38669,\"start\":38555},{\"attributes\":{\"id\":\"formula_49\"},\"end\":38759,\"start\":38693},{\"attributes\":{\"id\":\"formula_50\"},\"end\":38852,\"start\":38785},{\"attributes\":{\"id\":\"formula_51\"},\"end\":39449,\"start\":39421},{\"attributes\":{\"id\":\"formula_52\"},\"end\":39969,\"start\":39888},{\"attributes\":{\"id\":\"formula_54\"},\"end\":40138,\"start\":40054},{\"attributes\":{\"id\":\"formula_55\"},\"end\":40774,\"start\":40503},{\"attributes\":{\"id\":\"formula_56\"},\"end\":40884,\"start\":40774},{\"attributes\":{\"id\":\"formula_57\"},\"end\":42716,\"start\":42644},{\"attributes\":{\"id\":\"formula_58\"},\"end\":43476,\"start\":43453},{\"attributes\":{\"id\":\"formula_59\"},\"end\":46907,\"start\":46835},{\"attributes\":{\"id\":\"formula_60\"},\"end\":46956,\"start\":46907}]", "table_ref": "[{\"attributes\":{\"ref_id\":\"tab_1\"},\"end\":42486,\"start\":42478},{\"attributes\":{\"ref_id\":\"tab_1\"},\"end\":47286,\"start\":47278},{\"attributes\":{\"ref_id\":\"tab_1\"},\"end\":48079,\"start\":48071},{\"attributes\":{\"ref_id\":\"tab_1\"},\"end\":48951,\"start\":48939},{\"attributes\":{\"ref_id\":\"tab_1\"},\"end\":50307,\"start\":49868},{\"attributes\":{\"ref_id\":\"tab_1\"},\"end\":51827,\"start\":51818}]", "section_header": "[{\"end\":2346,\"start\":2331},{\"end\":13306,\"start\":13290},{\"end\":18426,\"start\":18408},{\"end\":19291,\"start\":19266},{\"end\":24125,\"start\":24098},{\"end\":27686,\"start\":27599},{\"end\":28572,\"start\":28519},{\"end\":29257,\"start\":29245},{\"end\":30607,\"start\":30583},{\"end\":32328,\"start\":32282},{\"end\":32573,\"start\":32540},{\"end\":38133,\"start\":38084},{\"end\":41502,\"start\":41491},{\"end\":50337,\"start\":50311},{\"end\":54342,\"start\":54327},{\"end\":56089,\"start\":56081},{\"end\":56243,\"start\":56235},{\"end\":56572,\"start\":56559},{\"end\":56721,\"start\":56713},{\"end\":57019,\"start\":57011},{\"end\":57399,\"start\":57391},{\"end\":57654,\"start\":57646},{\"end\":57894,\"start\":57886},{\"end\":58134,\"start\":58126},{\"end\":58447,\"start\":58435},{\"end\":58812,\"start\":58803},{\"end\":59103,\"start\":59094},{\"end\":59197,\"start\":59188},{\"end\":59366,\"start\":59357},{\"end\":59562,\"start\":59553},{\"end\":59759,\"start\":59750},{\"end\":60635,\"start\":60628},{\"end\":60730,\"start\":60725},{\"end\":60755,\"start\":60733}]", "table": "[{\"end\":60626,\"start\":60543}]", "figure_caption": "[{\"end\":56233,\"start\":56091},{\"end\":56557,\"start\":56245},{\"end\":56711,\"start\":56574},{\"end\":56839,\"start\":56723},{\"end\":57009,\"start\":56842},{\"end\":57389,\"start\":57021},{\"end\":57644,\"start\":57401},{\"end\":57884,\"start\":57656},{\"end\":58124,\"start\":57896},{\"end\":58433,\"start\":58136},{\"end\":58801,\"start\":58452},{\"end\":59092,\"start\":58815},{\"end\":59186,\"start\":59106},{\"end\":59355,\"start\":59200},{\"end\":59551,\"start\":59369},{\"end\":59748,\"start\":59565},{\"end\":59827,\"start\":59762},{\"end\":60543,\"start\":59830},{\"end\":60723,\"start\":60637},{\"end\":60982,\"start\":60759}]", "figure_ref": "[{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":19383,\"start\":19377},{\"attributes\":{\"ref_id\":\"fig_1\"},\"end\":19949,\"start\":19943},{\"end\":29437,\"start\":29429},{\"attributes\":{\"ref_id\":\"fig_3\"},\"end\":41092,\"start\":41086},{\"end\":42057,\"start\":42051},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":42121,\"start\":42103},{\"attributes\":{\"ref_id\":\"fig_3\"},\"end\":42297,\"start\":42291},{\"attributes\":{\"ref_id\":\"fig_5\"},\"end\":44325,\"start\":44316},{\"attributes\":{\"ref_id\":\"fig_5\"},\"end\":44708,\"start\":44699},{\"attributes\":{\"ref_id\":\"fig_5\"},\"end\":44900,\"start\":44891},{\"attributes\":{\"ref_id\":\"fig_6\"},\"end\":45352,\"start\":45343},{\"attributes\":{\"ref_id\":\"fig_6\"},\"end\":45469,\"start\":45460},{\"attributes\":{\"ref_id\":\"fig_7\"},\"end\":45842,\"start\":45829},{\"attributes\":{\"ref_id\":\"fig_6\"},\"end\":47796,\"start\":47779},{\"attributes\":{\"ref_id\":\"fig_9\"},\"end\":48369,\"start\":48352},{\"attributes\":{\"ref_id\":\"fig_9\"},\"end\":48756,\"start\":48747},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":48959,\"start\":48952},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":50487,\"start\":50477},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":50803,\"start\":50796},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":51218,\"start\":51208},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":51813,\"start\":51806},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":51948,\"start\":51938},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":52477,\"start\":52463},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":52573,\"start\":52563},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":52751,\"start\":52744},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":52965,\"start\":52958},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":53282,\"start\":53275},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":53437,\"start\":53427},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":53486,\"start\":53479}]", "bib_author_first_name": "[{\"end\":61185,\"start\":61184},{\"end\":61461,\"start\":61460},{\"end\":61474,\"start\":61473},{\"end\":61879,\"start\":61878},{\"end\":61890,\"start\":61889},{\"end\":61901,\"start\":61900},{\"end\":61913,\"start\":61912},{\"end\":61924,\"start\":61923},{\"end\":61934,\"start\":61933},{\"end\":62320,\"start\":62319},{\"end\":62329,\"start\":62328},{\"end\":62555,\"start\":62554},{\"end\":62567,\"start\":62566},{\"end\":62580,\"start\":62579},{\"end\":62929,\"start\":62928},{\"end\":62936,\"start\":62935},{\"end\":62938,\"start\":62937},{\"end\":63229,\"start\":63228},{\"end\":63241,\"start\":63240},{\"end\":63248,\"start\":63247},{\"end\":63553,\"start\":63552},{\"end\":63566,\"start\":63565},{\"end\":63577,\"start\":63576},{\"end\":63855,\"start\":63854},{\"end\":63862,\"start\":63861},{\"end\":63870,\"start\":63869},{\"end\":63872,\"start\":63871},{\"end\":64225,\"start\":64224},{\"end\":64234,\"start\":64233},{\"end\":64243,\"start\":64242},{\"end\":64245,\"start\":64244},{\"end\":64258,\"start\":64257},{\"end\":64630,\"start\":64629},{\"end\":64637,\"start\":64636},{\"end\":64643,\"start\":64642},{\"end\":64647,\"start\":64644},{\"end\":64981,\"start\":64980},{\"end\":64983,\"start\":64982},{\"end\":64992,\"start\":64991},{\"end\":64994,\"start\":64993},{\"end\":65007,\"start\":65006},{\"end\":65397,\"start\":65396},{\"end\":65404,\"start\":65403},{\"end\":65735,\"start\":65734},{\"end\":65745,\"start\":65744},{\"end\":66094,\"start\":66093},{\"end\":66100,\"start\":66095},{\"end\":66109,\"start\":66108},{\"end\":66111,\"start\":66110},{\"end\":66490,\"start\":66489},{\"end\":66502,\"start\":66501},{\"end\":66504,\"start\":66503},{\"end\":66516,\"start\":66515},{\"end\":66951,\"start\":66950},{\"end\":66953,\"start\":66952},{\"end\":66962,\"start\":66961},{\"end\":66964,\"start\":66963},{\"end\":66976,\"start\":66975},{\"end\":66978,\"start\":66977},{\"end\":66985,\"start\":66984},{\"end\":66989,\"start\":66986},{\"end\":67261,\"start\":67260},{\"end\":67263,\"start\":67262},{\"end\":67532,\"start\":67531},{\"end\":67541,\"start\":67540},{\"end\":67552,\"start\":67551},{\"end\":67562,\"start\":67561},{\"end\":67888,\"start\":67887},{\"end\":67894,\"start\":67893},{\"end\":67901,\"start\":67900},{\"end\":68266,\"start\":68265},{\"end\":68279,\"start\":68278},{\"end\":68527,\"start\":68526},{\"end\":68536,\"start\":68535},{\"end\":68841,\"start\":68840},{\"end\":68854,\"start\":68853},{\"end\":68864,\"start\":68863},{\"end\":68873,\"start\":68872},{\"end\":69258,\"start\":69257},{\"end\":69262,\"start\":69259},{\"end\":69271,\"start\":69270},{\"end\":69280,\"start\":69279},{\"end\":69284,\"start\":69281},{\"end\":69292,\"start\":69291},{\"end\":69294,\"start\":69293},{\"end\":69304,\"start\":69303},{\"end\":69702,\"start\":69701},{\"end\":69704,\"start\":69703},{\"end\":69715,\"start\":69714},{\"end\":69719,\"start\":69716},{\"end\":69728,\"start\":69727},{\"end\":69730,\"start\":69729},{\"end\":70004,\"start\":70003},{\"end\":70006,\"start\":70005},{\"end\":70016,\"start\":70015},{\"end\":70259,\"start\":70258},{\"end\":70267,\"start\":70266},{\"end\":70546,\"start\":70545},{\"end\":70548,\"start\":70547},{\"end\":70558,\"start\":70557},{\"end\":70813,\"start\":70812},{\"end\":70817,\"start\":70814},{\"end\":70829,\"start\":70828},{\"end\":70831,\"start\":70830},{\"end\":70840,\"start\":70839},{\"end\":70842,\"start\":70841},{\"end\":71181,\"start\":71180},{\"end\":71464,\"start\":71463},{\"end\":71801,\"start\":71800},{\"end\":72126,\"start\":72125},{\"end\":72128,\"start\":72127},{\"end\":72139,\"start\":72138},{\"end\":72141,\"start\":72140},{\"end\":72459,\"start\":72458},{\"end\":72472,\"start\":72471},{\"end\":72474,\"start\":72473},{\"end\":72484,\"start\":72483},{\"end\":72488,\"start\":72485},{\"end\":72496,\"start\":72495},{\"end\":72498,\"start\":72497},{\"end\":72508,\"start\":72507},{\"end\":72797,\"start\":72796},{\"end\":72807,\"start\":72806},{\"end\":72816,\"start\":72815},{\"end\":73073,\"start\":73072},{\"end\":73299,\"start\":73298},{\"end\":73311,\"start\":73310},{\"end\":73313,\"start\":73312},{\"end\":73650,\"start\":73649},{\"end\":73659,\"start\":73658},{\"end\":73661,\"start\":73660},{\"end\":73672,\"start\":73671},{\"end\":73674,\"start\":73673},{\"end\":73682,\"start\":73681},{\"end\":73684,\"start\":73683},{\"end\":74004,\"start\":74000},{\"end\":74013,\"start\":74012},{\"end\":74022,\"start\":74021},{\"end\":74283,\"start\":74282},{\"end\":74285,\"start\":74284},{\"end\":74293,\"start\":74292},{\"end\":74295,\"start\":74294},{\"end\":74306,\"start\":74305},{\"end\":74308,\"start\":74307},{\"end\":74594,\"start\":74593},{\"end\":74596,\"start\":74595},{\"end\":74606,\"start\":74605},{\"end\":74619,\"start\":74618},{\"end\":74623,\"start\":74620},{\"end\":74635,\"start\":74634},{\"end\":74644,\"start\":74643},{\"end\":74646,\"start\":74645},{\"end\":74655,\"start\":74654},{\"end\":75026,\"start\":75025},{\"end\":75028,\"start\":75027},{\"end\":75035,\"start\":75034},{\"end\":75037,\"start\":75036},{\"end\":75045,\"start\":75044},{\"end\":75396,\"start\":75395},{\"end\":75404,\"start\":75403},{\"end\":75416,\"start\":75415},{\"end\":75866,\"start\":75865},{\"end\":75877,\"start\":75876},{\"end\":75888,\"start\":75887},{\"end\":75900,\"start\":75899},{\"end\":76265,\"start\":76264},{\"end\":76274,\"start\":76273},{\"end\":76281,\"start\":76280},{\"end\":76609,\"start\":76608},{\"end\":76611,\"start\":76610},{\"end\":76621,\"start\":76620},{\"end\":76631,\"start\":76630},{\"end\":77013,\"start\":77012},{\"end\":77025,\"start\":77024},{\"end\":77036,\"start\":77035},{\"end\":77378,\"start\":77377},{\"end\":77389,\"start\":77388},{\"end\":77837,\"start\":77836},{\"end\":77850,\"start\":77849},{\"end\":77864,\"start\":77863},{\"end\":77873,\"start\":77872},{\"end\":77884,\"start\":77883},{\"end\":78266,\"start\":78265},{\"end\":78268,\"start\":78267},{\"end\":78279,\"start\":78278},{\"end\":78287,\"start\":78286},{\"end\":78597,\"start\":78596},{\"end\":78608,\"start\":78607},{\"end\":78618,\"start\":78617},{\"end\":79190,\"start\":79189},{\"end\":79200,\"start\":79199},{\"end\":79210,\"start\":79209},{\"end\":79225,\"start\":79221},{\"end\":79233,\"start\":79232},{\"end\":79246,\"start\":79245},{\"end\":79607,\"start\":79606},{\"end\":79611,\"start\":79608},{\"end\":79624,\"start\":79623},{\"end\":79634,\"start\":79633},{\"end\":79642,\"start\":79641},{\"end\":79644,\"start\":79643},{\"end\":79656,\"start\":79655},{\"end\":79981,\"start\":79980},{\"end\":79983,\"start\":79982},{\"end\":79994,\"start\":79990},{\"end\":80291,\"start\":80290},{\"end\":80300,\"start\":80299},{\"end\":80309,\"start\":80308}]", "bib_author_last_name": "[{\"end\":61191,\"start\":61186},{\"end\":61471,\"start\":61462},{\"end\":61484,\"start\":61475},{\"end\":61887,\"start\":61880},{\"end\":61898,\"start\":61891},{\"end\":61910,\"start\":61902},{\"end\":61921,\"start\":61914},{\"end\":61931,\"start\":61925},{\"end\":61946,\"start\":61935},{\"end\":62326,\"start\":62321},{\"end\":62337,\"start\":62330},{\"end\":62564,\"start\":62556},{\"end\":62577,\"start\":62568},{\"end\":62587,\"start\":62581},{\"end\":62933,\"start\":62930},{\"end\":62944,\"start\":62939},{\"end\":63238,\"start\":63230},{\"end\":63245,\"start\":63242},{\"end\":63252,\"start\":63249},{\"end\":63563,\"start\":63554},{\"end\":63574,\"start\":63567},{\"end\":63583,\"start\":63578},{\"end\":63859,\"start\":63856},{\"end\":63867,\"start\":63863},{\"end\":63883,\"start\":63873},{\"end\":64231,\"start\":64226},{\"end\":64240,\"start\":64235},{\"end\":64255,\"start\":64246},{\"end\":64266,\"start\":64259},{\"end\":64634,\"start\":64631},{\"end\":64640,\"start\":64638},{\"end\":64652,\"start\":64648},{\"end\":64989,\"start\":64984},{\"end\":65004,\"start\":64995},{\"end\":65017,\"start\":65008},{\"end\":65401,\"start\":65398},{\"end\":65412,\"start\":65405},{\"end\":65742,\"start\":65736},{\"end\":65756,\"start\":65746},{\"end\":66106,\"start\":66101},{\"end\":66116,\"start\":66112},{\"end\":66499,\"start\":66491},{\"end\":66513,\"start\":66505},{\"end\":66526,\"start\":66517},{\"end\":66959,\"start\":66954},{\"end\":66973,\"start\":66965},{\"end\":66982,\"start\":66979},{\"end\":66998,\"start\":66990},{\"end\":67269,\"start\":67264},{\"end\":67538,\"start\":67533},{\"end\":67549,\"start\":67542},{\"end\":67559,\"start\":67553},{\"end\":67571,\"start\":67563},{\"end\":67891,\"start\":67889},{\"end\":67898,\"start\":67895},{\"end\":67906,\"start\":67902},{\"end\":68276,\"start\":68267},{\"end\":68292,\"start\":68280},{\"end\":68533,\"start\":68528},{\"end\":68543,\"start\":68537},{\"end\":68851,\"start\":68842},{\"end\":68861,\"start\":68855},{\"end\":68870,\"start\":68865},{\"end\":68878,\"start\":68874},{\"end\":69268,\"start\":69263},{\"end\":69277,\"start\":69272},{\"end\":69289,\"start\":69285},{\"end\":69301,\"start\":69295},{\"end\":69314,\"start\":69305},{\"end\":69712,\"start\":69705},{\"end\":69725,\"start\":69720},{\"end\":69736,\"start\":69731},{\"end\":70013,\"start\":70007},{\"end\":70026,\"start\":70017},{\"end\":70264,\"start\":70260},{\"end\":70276,\"start\":70268},{\"end\":70555,\"start\":70549},{\"end\":70567,\"start\":70559},{\"end\":70826,\"start\":70818},{\"end\":70837,\"start\":70832},{\"end\":70851,\"start\":70843},{\"end\":71187,\"start\":71182},{\"end\":71474,\"start\":71465},{\"end\":71811,\"start\":71802},{\"end\":72136,\"start\":72129},{\"end\":72149,\"start\":72142},{\"end\":72469,\"start\":72460},{\"end\":72481,\"start\":72475},{\"end\":72493,\"start\":72489},{\"end\":72505,\"start\":72499},{\"end\":72515,\"start\":72509},{\"end\":72804,\"start\":72798},{\"end\":72813,\"start\":72808},{\"end\":72826,\"start\":72817},{\"end\":73079,\"start\":73074},{\"end\":73308,\"start\":73300},{\"end\":73320,\"start\":73314},{\"end\":73656,\"start\":73651},{\"end\":73669,\"start\":73662},{\"end\":73679,\"start\":73675},{\"end\":73689,\"start\":73685},{\"end\":74010,\"start\":74005},{\"end\":74019,\"start\":74014},{\"end\":74032,\"start\":74023},{\"end\":74290,\"start\":74286},{\"end\":74303,\"start\":74296},{\"end\":74313,\"start\":74309},{\"end\":74603,\"start\":74597},{\"end\":74616,\"start\":74607},{\"end\":74632,\"start\":74624},{\"end\":74641,\"start\":74636},{\"end\":74652,\"start\":74647},{\"end\":74660,\"start\":74656},{\"end\":75032,\"start\":75029},{\"end\":75042,\"start\":75038},{\"end\":75052,\"start\":75046},{\"end\":75401,\"start\":75397},{\"end\":75413,\"start\":75405},{\"end\":75426,\"start\":75417},{\"end\":75874,\"start\":75867},{\"end\":75885,\"start\":75878},{\"end\":75897,\"start\":75889},{\"end\":75908,\"start\":75901},{\"end\":76271,\"start\":76266},{\"end\":76278,\"start\":76275},{\"end\":76287,\"start\":76282},{\"end\":76618,\"start\":76612},{\"end\":76628,\"start\":76622},{\"end\":76639,\"start\":76632},{\"end\":77022,\"start\":77014},{\"end\":77033,\"start\":77026},{\"end\":77047,\"start\":77037},{\"end\":77386,\"start\":77379},{\"end\":77396,\"start\":77390},{\"end\":77847,\"start\":77838},{\"end\":77861,\"start\":77851},{\"end\":77870,\"start\":77865},{\"end\":77881,\"start\":77874},{\"end\":77891,\"start\":77885},{\"end\":78276,\"start\":78269},{\"end\":78284,\"start\":78280},{\"end\":78301,\"start\":78288},{\"end\":78605,\"start\":78598},{\"end\":78615,\"start\":78609},{\"end\":78626,\"start\":78619},{\"end\":79197,\"start\":79191},{\"end\":79207,\"start\":79201},{\"end\":79219,\"start\":79211},{\"end\":79230,\"start\":79226},{\"end\":79243,\"start\":79234},{\"end\":79250,\"start\":79247},{\"end\":79621,\"start\":79612},{\"end\":79631,\"start\":79625},{\"end\":79639,\"start\":79635},{\"end\":79653,\"start\":79645},{\"end\":79662,\"start\":79657},{\"end\":79988,\"start\":79984},{\"end\":80000,\"start\":79995},{\"end\":80297,\"start\":80292},{\"end\":80306,\"start\":80301},{\"end\":80318,\"start\":80310}]", "bib_entry": "[{\"attributes\":{\"id\":\"b0\",\"matched_paper_id\":9932267},\"end\":61398,\"start\":61087},{\"attributes\":{\"id\":\"b1\",\"matched_paper_id\":12962583},\"end\":61730,\"start\":61400},{\"attributes\":{\"id\":\"b2\",\"matched_paper_id\":17793710},\"end\":62249,\"start\":61732},{\"attributes\":{\"id\":\"b3\"},\"end\":62502,\"start\":62251},{\"attributes\":{\"id\":\"b4\",\"matched_paper_id\":14542814},\"end\":62848,\"start\":62504},{\"attributes\":{\"id\":\"b5\",\"matched_paper_id\":10048449},\"end\":63165,\"start\":62850},{\"attributes\":{\"id\":\"b6\",\"matched_paper_id\":16800521},\"end\":63466,\"start\":63167},{\"attributes\":{\"id\":\"b7\",\"matched_paper_id\":1597660},\"end\":63789,\"start\":63468},{\"attributes\":{\"id\":\"b8\",\"matched_paper_id\":12978285},\"end\":64108,\"start\":63791},{\"attributes\":{\"id\":\"b9\",\"matched_paper_id\":3169302},\"end\":64536,\"start\":64110},{\"attributes\":{\"id\":\"b10\",\"matched_paper_id\":125963688},\"end\":64896,\"start\":64538},{\"attributes\":{\"id\":\"b11\",\"matched_paper_id\":7599691},\"end\":65266,\"start\":64898},{\"attributes\":{\"id\":\"b12\",\"matched_paper_id\":52187337},\"end\":65683,\"start\":65268},{\"attributes\":{\"id\":\"b13\",\"matched_paper_id\":2308108},\"end\":66000,\"start\":65685},{\"attributes\":{\"id\":\"b14\",\"matched_paper_id\":54211648},\"end\":66302,\"start\":66002},{\"attributes\":{\"id\":\"b15\",\"matched_paper_id\":46898485},\"end\":66884,\"start\":66304},{\"attributes\":{\"id\":\"b16\",\"matched_paper_id\":8363289},\"end\":67192,\"start\":66886},{\"attributes\":{\"id\":\"b17\",\"matched_paper_id\":28062750},\"end\":67422,\"start\":67194},{\"attributes\":{\"id\":\"b18\"},\"end\":67799,\"start\":67424},{\"attributes\":{\"id\":\"b19\",\"matched_paper_id\":3088094},\"end\":68184,\"start\":67801},{\"attributes\":{\"id\":\"b20\",\"matched_paper_id\":30180674},\"end\":68524,\"start\":68186},{\"attributes\":{\"id\":\"b21\"},\"end\":68740,\"start\":68526},{\"attributes\":{\"id\":\"b22\",\"matched_paper_id\":13539770},\"end\":69147,\"start\":68742},{\"attributes\":{\"id\":\"b23\",\"matched_paper_id\":220891533},\"end\":69619,\"start\":69149},{\"attributes\":{\"id\":\"b24\",\"matched_paper_id\":232118108},\"end\":69958,\"start\":69621},{\"attributes\":{\"id\":\"b25\",\"matched_paper_id\":5215275},\"end\":70162,\"start\":69960},{\"attributes\":{\"id\":\"b26\",\"matched_paper_id\":17642013},\"end\":70469,\"start\":70164},{\"attributes\":{\"id\":\"b27\",\"matched_paper_id\":6694982},\"end\":70741,\"start\":70471},{\"attributes\":{\"id\":\"b28\",\"matched_paper_id\":206478784},\"end\":71074,\"start\":70743},{\"attributes\":{\"id\":\"b29\",\"matched_paper_id\":6235536},\"end\":71391,\"start\":71076},{\"attributes\":{\"id\":\"b30\",\"matched_paper_id\":124676871},\"end\":71723,\"start\":71393},{\"attributes\":{\"id\":\"b31\",\"matched_paper_id\":40946595},\"end\":71981,\"start\":71725},{\"attributes\":{\"id\":\"b32\",\"matched_paper_id\":11353325},\"end\":72404,\"start\":71983},{\"attributes\":{\"id\":\"b33\",\"matched_paper_id\":43740122},\"end\":72701,\"start\":72406},{\"attributes\":{\"id\":\"b34\",\"matched_paper_id\":40748802},\"end\":73035,\"start\":72703},{\"attributes\":{\"id\":\"b35\",\"matched_paper_id\":67754433},\"end\":73202,\"start\":73037},{\"attributes\":{\"id\":\"b36\",\"matched_paper_id\":2997198},\"end\":73557,\"start\":73204},{\"attributes\":{\"id\":\"b37\",\"matched_paper_id\":24081375},\"end\":73933,\"start\":73559},{\"attributes\":{\"id\":\"b38\",\"matched_paper_id\":186206922},\"end\":74233,\"start\":73935},{\"attributes\":{\"id\":\"b39\",\"matched_paper_id\":27218055},\"end\":74499,\"start\":74235},{\"attributes\":{\"id\":\"b40\",\"matched_paper_id\":213088509},\"end\":74932,\"start\":74501},{\"attributes\":{\"id\":\"b41\",\"matched_paper_id\":14268556},\"end\":75288,\"start\":74934},{\"attributes\":{\"id\":\"b42\",\"matched_paper_id\":211118499},\"end\":75772,\"start\":75290},{\"attributes\":{\"id\":\"b43\",\"matched_paper_id\":220891942},\"end\":76179,\"start\":75774},{\"attributes\":{\"id\":\"b44\",\"matched_paper_id\":233333961},\"end\":76510,\"start\":76181},{\"attributes\":{\"id\":\"b45\",\"matched_paper_id\":213880836},\"end\":76895,\"start\":76512},{\"attributes\":{\"id\":\"b46\",\"matched_paper_id\":12866},\"end\":77303,\"start\":76897},{\"attributes\":{\"id\":\"b47\",\"matched_paper_id\":13387660},\"end\":77754,\"start\":77305},{\"attributes\":{\"id\":\"b48\",\"matched_paper_id\":58669604},\"end\":78178,\"start\":77756},{\"attributes\":{\"id\":\"b49\",\"matched_paper_id\":2251543},\"end\":78514,\"start\":78180},{\"attributes\":{\"id\":\"b50\",\"matched_paper_id\":31381450},\"end\":78829,\"start\":78516},{\"attributes\":{\"id\":\"b51\"},\"end\":79114,\"start\":78831},{\"attributes\":{\"id\":\"b52\",\"matched_paper_id\":11666069},\"end\":79527,\"start\":79116},{\"attributes\":{\"id\":\"b53\",\"matched_paper_id\":53559074},\"end\":79899,\"start\":79529},{\"attributes\":{\"id\":\"b54\",\"matched_paper_id\":118650140},\"end\":80194,\"start\":79901},{\"attributes\":{\"id\":\"b55\",\"matched_paper_id\":16723027},\"end\":80536,\"start\":80196}]", "bib_title": "[{\"end\":61182,\"start\":61087},{\"end\":61458,\"start\":61400},{\"end\":61876,\"start\":61732},{\"end\":62552,\"start\":62504},{\"end\":62926,\"start\":62850},{\"end\":63226,\"start\":63167},{\"end\":63550,\"start\":63468},{\"end\":63852,\"start\":63791},{\"end\":64222,\"start\":64110},{\"end\":64627,\"start\":64538},{\"end\":64978,\"start\":64898},{\"end\":65394,\"start\":65268},{\"end\":65732,\"start\":65685},{\"end\":66091,\"start\":66002},{\"end\":66487,\"start\":66304},{\"end\":66948,\"start\":66886},{\"end\":67258,\"start\":67194},{\"end\":67885,\"start\":67801},{\"end\":68263,\"start\":68186},{\"end\":68838,\"start\":68742},{\"end\":69255,\"start\":69149},{\"end\":69699,\"start\":69621},{\"end\":70001,\"start\":69960},{\"end\":70256,\"start\":70164},{\"end\":70543,\"start\":70471},{\"end\":70810,\"start\":70743},{\"end\":71178,\"start\":71076},{\"end\":71461,\"start\":71393},{\"end\":71798,\"start\":71725},{\"end\":72123,\"start\":71983},{\"end\":72456,\"start\":72406},{\"end\":72794,\"start\":72703},{\"end\":73070,\"start\":73037},{\"end\":73296,\"start\":73204},{\"end\":73647,\"start\":73559},{\"end\":73998,\"start\":73935},{\"end\":74280,\"start\":74235},{\"end\":74591,\"start\":74501},{\"end\":75023,\"start\":74934},{\"end\":75393,\"start\":75290},{\"end\":75863,\"start\":75774},{\"end\":76262,\"start\":76181},{\"end\":76606,\"start\":76512},{\"end\":77010,\"start\":76897},{\"end\":77375,\"start\":77305},{\"end\":77834,\"start\":77756},{\"end\":78263,\"start\":78180},{\"end\":78594,\"start\":78516},{\"end\":79187,\"start\":79116},{\"end\":79604,\"start\":79529},{\"end\":79978,\"start\":79901},{\"end\":80288,\"start\":80196}]", "bib_author": "[{\"end\":61193,\"start\":61184},{\"end\":61473,\"start\":61460},{\"end\":61486,\"start\":61473},{\"end\":61889,\"start\":61878},{\"end\":61900,\"start\":61889},{\"end\":61912,\"start\":61900},{\"end\":61923,\"start\":61912},{\"end\":61933,\"start\":61923},{\"end\":61948,\"start\":61933},{\"end\":62328,\"start\":62319},{\"end\":62339,\"start\":62328},{\"end\":62566,\"start\":62554},{\"end\":62579,\"start\":62566},{\"end\":62589,\"start\":62579},{\"end\":62935,\"start\":62928},{\"end\":62946,\"start\":62935},{\"end\":63240,\"start\":63228},{\"end\":63247,\"start\":63240},{\"end\":63254,\"start\":63247},{\"end\":63565,\"start\":63552},{\"end\":63576,\"start\":63565},{\"end\":63585,\"start\":63576},{\"end\":63861,\"start\":63854},{\"end\":63869,\"start\":63861},{\"end\":63885,\"start\":63869},{\"end\":64233,\"start\":64224},{\"end\":64242,\"start\":64233},{\"end\":64257,\"start\":64242},{\"end\":64268,\"start\":64257},{\"end\":64636,\"start\":64629},{\"end\":64642,\"start\":64636},{\"end\":64654,\"start\":64642},{\"end\":64991,\"start\":64980},{\"end\":65006,\"start\":64991},{\"end\":65019,\"start\":65006},{\"end\":65403,\"start\":65396},{\"end\":65414,\"start\":65403},{\"end\":65744,\"start\":65734},{\"end\":65758,\"start\":65744},{\"end\":66108,\"start\":66093},{\"end\":66118,\"start\":66108},{\"end\":66501,\"start\":66489},{\"end\":66515,\"start\":66501},{\"end\":66528,\"start\":66515},{\"end\":66961,\"start\":66950},{\"end\":66975,\"start\":66961},{\"end\":66984,\"start\":66975},{\"end\":67000,\"start\":66984},{\"end\":67271,\"start\":67260},{\"end\":67540,\"start\":67531},{\"end\":67551,\"start\":67540},{\"end\":67561,\"start\":67551},{\"end\":67573,\"start\":67561},{\"end\":67893,\"start\":67887},{\"end\":67900,\"start\":67893},{\"end\":67908,\"start\":67900},{\"end\":68278,\"start\":68265},{\"end\":68294,\"start\":68278},{\"end\":68535,\"start\":68526},{\"end\":68545,\"start\":68535},{\"end\":68853,\"start\":68840},{\"end\":68863,\"start\":68853},{\"end\":68872,\"start\":68863},{\"end\":68880,\"start\":68872},{\"end\":69270,\"start\":69257},{\"end\":69279,\"start\":69270},{\"end\":69291,\"start\":69279},{\"end\":69303,\"start\":69291},{\"end\":69316,\"start\":69303},{\"end\":69714,\"start\":69701},{\"end\":69727,\"start\":69714},{\"end\":69738,\"start\":69727},{\"end\":70015,\"start\":70003},{\"end\":70028,\"start\":70015},{\"end\":70266,\"start\":70258},{\"end\":70278,\"start\":70266},{\"end\":70557,\"start\":70545},{\"end\":70569,\"start\":70557},{\"end\":70828,\"start\":70812},{\"end\":70839,\"start\":70828},{\"end\":70853,\"start\":70839},{\"end\":71189,\"start\":71180},{\"end\":71476,\"start\":71463},{\"end\":71813,\"start\":71800},{\"end\":72138,\"start\":72125},{\"end\":72151,\"start\":72138},{\"end\":72471,\"start\":72458},{\"end\":72483,\"start\":72471},{\"end\":72495,\"start\":72483},{\"end\":72507,\"start\":72495},{\"end\":72517,\"start\":72507},{\"end\":72806,\"start\":72796},{\"end\":72815,\"start\":72806},{\"end\":72828,\"start\":72815},{\"end\":73081,\"start\":73072},{\"end\":73310,\"start\":73298},{\"end\":73322,\"start\":73310},{\"end\":73658,\"start\":73649},{\"end\":73671,\"start\":73658},{\"end\":73681,\"start\":73671},{\"end\":73691,\"start\":73681},{\"end\":74012,\"start\":74000},{\"end\":74021,\"start\":74012},{\"end\":74034,\"start\":74021},{\"end\":74292,\"start\":74282},{\"end\":74305,\"start\":74292},{\"end\":74315,\"start\":74305},{\"end\":74605,\"start\":74593},{\"end\":74618,\"start\":74605},{\"end\":74634,\"start\":74618},{\"end\":74643,\"start\":74634},{\"end\":74654,\"start\":74643},{\"end\":74662,\"start\":74654},{\"end\":75034,\"start\":75025},{\"end\":75044,\"start\":75034},{\"end\":75054,\"start\":75044},{\"end\":75403,\"start\":75395},{\"end\":75415,\"start\":75403},{\"end\":75428,\"start\":75415},{\"end\":75876,\"start\":75865},{\"end\":75887,\"start\":75876},{\"end\":75899,\"start\":75887},{\"end\":75910,\"start\":75899},{\"end\":76273,\"start\":76264},{\"end\":76280,\"start\":76273},{\"end\":76289,\"start\":76280},{\"end\":76620,\"start\":76608},{\"end\":76630,\"start\":76620},{\"end\":76641,\"start\":76630},{\"end\":77024,\"start\":77012},{\"end\":77035,\"start\":77024},{\"end\":77049,\"start\":77035},{\"end\":77388,\"start\":77377},{\"end\":77398,\"start\":77388},{\"end\":77849,\"start\":77836},{\"end\":77863,\"start\":77849},{\"end\":77872,\"start\":77863},{\"end\":77883,\"start\":77872},{\"end\":77893,\"start\":77883},{\"end\":78278,\"start\":78265},{\"end\":78286,\"start\":78278},{\"end\":78303,\"start\":78286},{\"end\":78607,\"start\":78596},{\"end\":78617,\"start\":78607},{\"end\":78628,\"start\":78617},{\"end\":79199,\"start\":79189},{\"end\":79209,\"start\":79199},{\"end\":79221,\"start\":79209},{\"end\":79232,\"start\":79221},{\"end\":79245,\"start\":79232},{\"end\":79252,\"start\":79245},{\"end\":79623,\"start\":79606},{\"end\":79633,\"start\":79623},{\"end\":79641,\"start\":79633},{\"end\":79655,\"start\":79641},{\"end\":79664,\"start\":79655},{\"end\":79990,\"start\":79980},{\"end\":80002,\"start\":79990},{\"end\":80299,\"start\":80290},{\"end\":80308,\"start\":80299},{\"end\":80320,\"start\":80308}]", "bib_venue": "[{\"end\":61566,\"start\":61530},{\"end\":62681,\"start\":62639},{\"end\":63310,\"start\":63286},{\"end\":63943,\"start\":63918},{\"end\":65844,\"start\":65805},{\"end\":67994,\"start\":67955},{\"end\":68615,\"start\":68604},{\"end\":69374,\"start\":69349},{\"end\":73376,\"start\":73353},{\"end\":74359,\"start\":74341},{\"end\":75098,\"start\":75080},{\"end\":75538,\"start\":75487},{\"end\":75968,\"start\":75943},{\"end\":77503,\"start\":77443},{\"end\":77963,\"start\":77932},{\"end\":79316,\"start\":79288},{\"end\":61215,\"start\":61193},{\"end\":61528,\"start\":61486},{\"end\":61959,\"start\":61948},{\"end\":62317,\"start\":62251},{\"end\":62637,\"start\":62589},{\"end\":62979,\"start\":62946},{\"end\":63284,\"start\":63254},{\"end\":63603,\"start\":63585},{\"end\":63916,\"start\":63885},{\"end\":64294,\"start\":64268},{\"end\":64687,\"start\":64654},{\"end\":65052,\"start\":65019},{\"end\":65447,\"start\":65414},{\"end\":65803,\"start\":65758},{\"end\":66129,\"start\":66118},{\"end\":66545,\"start\":66528},{\"end\":67010,\"start\":67000},{\"end\":67281,\"start\":67271},{\"end\":67529,\"start\":67424},{\"end\":67953,\"start\":67908},{\"end\":68327,\"start\":68294},{\"end\":68602,\"start\":68545},{\"end\":68913,\"start\":68880},{\"end\":69347,\"start\":69316},{\"end\":69760,\"start\":69738},{\"end\":70038,\"start\":70028},{\"end\":70288,\"start\":70278},{\"end\":70579,\"start\":70569},{\"end\":70879,\"start\":70853},{\"end\":71210,\"start\":71189},{\"end\":71542,\"start\":71476},{\"end\":71831,\"start\":71813},{\"end\":72172,\"start\":72151},{\"end\":72527,\"start\":72517},{\"end\":72846,\"start\":72828},{\"end\":73099,\"start\":73081},{\"end\":73351,\"start\":73322},{\"end\":73717,\"start\":73691},{\"end\":74055,\"start\":74034},{\"end\":74339,\"start\":74315},{\"end\":74679,\"start\":74662},{\"end\":75078,\"start\":75054},{\"end\":75485,\"start\":75428},{\"end\":75941,\"start\":75910},{\"end\":76318,\"start\":76289},{\"end\":76674,\"start\":76641},{\"end\":77072,\"start\":77049},{\"end\":77441,\"start\":77398},{\"end\":77930,\"start\":77893},{\"end\":78320,\"start\":78303},{\"end\":78646,\"start\":78628},{\"end\":78878,\"start\":78831},{\"end\":79286,\"start\":79252},{\"end\":79685,\"start\":79664},{\"end\":80020,\"start\":80002},{\"end\":80337,\"start\":80320}]"}}}, "year": 2023, "month": 12, "day": 17}