{"id": 251518412, "updated": "2023-04-29 14:38:21.395", "metadata": {"title": "Graph-Flashback Network for Next Location Recommendation", "authors": "[{\"first\":\"Xuan\",\"last\":\"Rao\",\"middle\":[]},{\"first\":\"Lisi\",\"last\":\"Chen\",\"middle\":[]},{\"first\":\"Yong\",\"last\":\"Liu\",\"middle\":[]},{\"first\":\"Shuo\",\"last\":\"Shang\",\"middle\":[]},{\"first\":\"Bin\",\"last\":\"Yao\",\"middle\":[]},{\"first\":\"Peng\",\"last\":\"Han\",\"middle\":[]}]", "venue": null, "journal": "Proceedings of the 28th ACM SIGKDD Conference on Knowledge Discovery and Data Mining", "publication_date": {"year": 2022, "month": null, "day": null}, "abstract": "Next Point-of Interest (POI) recommendation plays an important role in location-based applications, which aims to recommend the next POIs to users that they are most likely to visit based on their historical trajectories. Existing methods usually use rich side information, or customized POI graphs to capture the sequential patterns among POIs. However, the graphs only focus on connectivity between POIs. Few studies propose to explicitly learn a weighted POI graph, which could reflect the transition patterns among POIs and show the importance of its different neighbors for each POI. In addition, these approaches simply utilize the user characteristics for personalized POI recommendation without sufficient consideration. To this end, we construct a novel User-POI Knowledge Graph with strong representation ability, called Spatial-Temporal Knowledge Graph (STKG). STKG is used to learn the representations of each node (i.e., user, POI) and each edge. Then, we design a similarity function to construct our POI transition graph based on the learned representations. To incorporate the learned graph into sequential model, we propose a novel network Graph-Flashback for recommendation. Graph-Flashback applies a simplified Graph Convolution Network (GCN) on the POI transition graph to enrich the representation of each POI. Further, we define a similarity function to consider both spatiotemporal information and user preference in modelling sequential regularity. Experimental results on two real-world datasets show that our proposed method achieves the state-of-the-art performance and significantly outperforms all existing solutions.", "fields_of_study": "[\"Computer Science\"]", "external_ids": {"arxiv": null, "mag": null, "acl": null, "pubmed": null, "pubmedcentral": null, "dblp": "conf/kdd/RaoCLSYH22", "doi": "10.1145/3534678.3539383"}}, "content": {"source": {"pdf_hash": "f51e223d6f5030874c89f40386ad35ee5c6e99d1", "pdf_src": "ACM", "pdf_uri": null, "oa_url_match": false, "oa_info": null}, "grobid": {"id": "cde4299ca68de764c65e307ac5eb7b2802a89a53", "type": "plain-text", "url": "s3://ai2-s2-pdf-extraction-prod/parse-results/s2orc_worker/f51e223d6f5030874c89f40386ad35ee5c6e99d1.txt", "contents": "\nGraph-Flashback Network for Next Location Recommendation\nAugust 14-18, 2022\n\nXuan Rao raoxuanzzz@gmail.com \nLisi Chen \nYong Liu \nShuo Shang \nBin Yao yaobin@cs.sjtu.edu.cn \nPeng Han pengh@cs.aau.dk \nXuan Rao \nLisi Chen \nYong Liu \nShuo Shang \nBin Yao \nHan \n\nUniversity of Electronic Science and Technology of China Chengdu\nChina\n\n\nScience and Technology of China Chengdu\nUniversity of Electronic\nChina\n\n\nNanyang Technological University\nSingapore\n\n\nScience and Technology of China Chengdu\nUniversity of Electronic\nChina\n\n\nShanghai Jiao Tong University Shanghai\nChina\n\n\nACM Reference Format\nAalborg University\nAalborgDenmark, Denmark\n\nGraph-Flashback Network for Next Location Recommendation\n\nKDD\nWashington, DC, USA22August 14-18, 202210.1145/3534678.3539383Graph-Flashback Network for Next Location Recommendation. In Proceed-ings of the 28th ACM SIGKDD Conference on Knowledge Discovery and Data Mining (KDD '22), August 14-18, 2022, Washington, DC, USA. ACM, New York, NY, USA, 9 pages. https://CCS CONCEPTS • Information systems → Location based servicesData min- ing• Computing methodologies → Machine learning KEYWORDS Point-of-Interestrecommendationknowledge graph\nNext Point-of Interest (POI) recommendation plays an important role in location-based applications, which aims to recommend the next POIs to users that they are most likely to visit based on their historical trajectories. Existing methods usually use rich side information, or customized POI graphs to capture the sequential patterns among POIs. However, the graphs only focus on connectivity between POIs. Few studies propose to explicitly learn a weighted POI graph, which could reflect the transition patterns among POIs and show the importance of its different neighbors for each POI. In addition, these approaches simply utilize the user characteristics for personalized POI recommendation without sufficient consideration. To this end, we construct a novel User-POI Knowledge Graph with strong representation ability, called Spatial-Temporal Knowledge Graph (STKG). STKG is used to learn the representations of each node (i.e., user, POI) and each edge. Then, we design a similarity function to construct our POI transition graph based on the learned representations. To incorporate the learned graph into sequential model, we propose a novel network Graph-Flashback for recommendation. Graph-Flashback applies a simplified Graph Convolution Network (GCN) on the POI transition graph to enrich the representation of each POI. Further, we define a similarity function to consider both spatiotemporal information and user preference in modelling sequential regularity. Experimental results on two real-world datasets show that our proposed method achieves the state-of-the-art performance and significantly outperforms all existing solutions. * Equal Contribution † Corresponding Author\n\nINTRODUCTION\n\nWith the development of location based social media, people are becoming increasingly willing to record and share their life status along with geographical updates through mobile devices. As such, it is of great importance to make use of these geographical updates (e.g., check-in records) for understanding users' preference regarding their next movements. For the purpose, many studies focus on the problem of next POI recommendation [10,26,34]. As a fundamental functionality in smart city applications, next POI recommendation is generally defined as predicting the next POI a particular user will be most likely to visit based on his/her historical trajectory [2,15,19], aiming to help users plan their trips and explore more locations that may appeal to them based on their past preferences [4,7,22,29,32,36].\n\nExisting solutions to the next POI recommendation problem can be classified into two categories: sequence-based solutions and graph-based solutions. Sequence-based solutions include Markov chains, RNNs-based models, and attention-based models. Early studies use Markov chains to model sequential transitions patterns [2]. RNNs-based methods aims to combine the classic RNN architectures such as Long Short-Term Memory (LSTM) with temporal and spatial contexts for improving the model ability on capturing sequential regularity [15,36]. Besides, attention-based models have been proposed for recommendation due to the great success of Transformer [24] in natural language processing (NLP) field [3,5,12,20]. Recently, graph-based models have been proposed to enrich the POI representation by considering the property that similar users are likely to visit similar POIs [11,13]. They propose different methods to construct POI graphs based on the spatial proximities among POIs or historical trajectories of different users.\n\nAlthough existing approaches to next POI recommendation have gained much attention in their lines of research, they face the following limitations that significantly affect their effectiveness:\n\n• Graph construction. Previous approaches construct customized homogeneous POI graphs, which only have one type of nodes and edges [8,11,13]. Moreover, the graphs only focus on the connectivity between POIs, neglecting the weight of edges. Few of researches propose to use heterogeneous graph that contains multiple types of nodes and edges to obtain a learning-based homogeneous graph. • POI representation. Existing graph-based models apply Graph Neural Networks (GNNs) directly on the customized graphs to refine the representation of each POI through its neighbors based on neighbor sampling strategy without justification. As such, it is difficult to avoid some useless operations (e.g., feature transformation) in GNNs [9]. Besides, their learning process on the importance (i.e., weight coefficient) of its neighbors for each POI is non-transparent, which may degrade model effectiveness. • Personalized recommendation. Most existing methods simply concatenate user feature vector (i.e., embedding) and model output to perform personalized POI recommendation. However, using such a simple operation fail take into account users' general preferences towards different POIs. Some other studies concatenate user and POI representations and regard them as the input of model to reflect the personalized user preferences. However, user preferences may be influenced by many factors (e.g., time, location, POI categories, etc.). It is hard to acquire accurate personalized user preferences simply by concatenating user and POI representations.\n\nTo this end, we propose the Graph-Flashback model to address the aforementioned three challenges. For addressing the first limitation, we first construct a Spatial-Temporal Knowledge Graph (STKG), which has strong representation ability. Based on our STKG, we use Knowledge Graph Embedding (KGE) algorithms to learn representations of each node and each edge. Next, we use the learned representations to construct POI transition graph, which is a weighted and learning-based graph. Our learned POI transition graph is derived from the STKG and the weight coefficients are constant in the next learning process. Figure 1 shows the difference between our learned graph and customized graphs. The learned POI graph explicitly shows the importance of its different neighbors (excluding itself) for each POI. However, previous graph-based methods apply GNN on constructed connectivity graph to learn the weight coefficients of its neighbors for each POI, which are time-varying and non-transparent [11,13]. For addressing the second limitation, we apply a simplified Graph Convolution Network (GCN) [9] on the POI transition graph to enrich the representation of each POI, which could be then fed into RNN-based models to provide better recommendation service for users. Note that our POI transition graph is capable of reflecting the transition patterns among POIs. Meanwhile, it can be seamlessly integrated into other sequential models to enhance the ability of capturing sequential  Figure 1: A simple example that illustrates the difference between customized POI graph and our learned POI transition graph. We use purple circle and green circle to indicate current POI and neighbor POI, respectively.\n\ntransition regularity. For addressing the third limitation, we design a similarity function to measure the preferences of different users based on current location and time to perform personalized POI recommendation.\n\nIn summary, we make the following contributions to next-POI recommendation:\n\n• We propose a novel Spatial-Temporal Knowledge Graph (STKG), which can be directly used to learn POI graph that reflects transition patterns between POIs. To our best knowledge, this is the first method that learns homogeneous weighted POI graph by using heterogeneous knowledge graph. • We propose a novel RNN-based model, Graph-Flashback, to incorporate the learned POI transition graph into RNNbased models seamlessly for better capturing the sequential transition patterns. In addition, to further improve the effectiveness of personalized POI recommendation, we augment our model with a novel carefully-designed similarity function that measures preferences of different users. • We conduct extensive experiments on two real-world datasets to evaluate the performance of Graph-Flashback. The results show that Graph-Flashback significantly outperforms the existing solutions in terms of accuracy. The remaining parts of this paper are organized as follows. Section 2 investigates existing studies of next POI recommendation. Section 3 presents the problem formulation with relevant preliminaries. Section 4 presents our transition graph learning method. Next, Section 5 presents the overview of Graph-Flashback model. Section 6 reports the experimental results. Finally, Section 7 concludes the paper.\n\n\nRELATED WORK\n\nIn this section, we will briefly review some works on next POI recommendation and knowledge graph embedding.\n\n\nNext POI Recommendation\n\nGeneral POI recommendation mainly utilizes the collaborative filtering technique to mine intrinsic correlations among users, POIs, and context features, which takes into account geographical information and temporal effects [7,[16][17][18][19]25]. Differently, next POI recommendation focus more on recommending POIs that are most likely to be visited next based on a user's most recent check-ins [23,31]. It is challenging for those approaches used in general recommendation to capture the transition patterns between users' check-ins. Consequently, plenty of approaches have been proposed to solve the task, which can be classified into two categories: sequence-based methods and graph-based methods.\n\nSequence-based methods usually focus on individual user sequence, which models the transition patterns between POIs based on the sequence. On the early phase, Markov Chains (MC) models have been widely used for recommending next POI given a user's most recent check-ins [2,4,21]. FPMC [2] incorporates the Markov chain into matrix factorization model to learn a personalized transition matrix. PRME [4] proposes to utilize two different embedding spaces to capture the user preferences on POIs and sequential transitions between POIs, respectively. Recently, Recurrent Neural Networks (RNNs) and Attention mechanism have been extensively employed in next POI recommendation task due to the superior performance in modeling sequential information [12,35]. DeepMove [3] combines an attention layer with gated recurrent units (GRU) to learn long-term periodicity and short-term sequential patterns, respectively. STGN [36] extends the LSTM by introducing spatial and temporal gates for learning the users' longterm and short-term preferences. CatDM [33] proposes to use POI categories and spatial distance to reduce candidate POIs. STAN [20] designs two attention layers to explicitly extract relative spatiotemporal information between consecutive and non-consecutive POIs. Graph-based methods mainly models sequential regularity from a global view, which refines the representation of POI within the sequence through those POIs outside the sequence. STP-UDGAT [13] uses GAT to learn correlations between POIs from both local and global views based on their customized graphs. ARNN [5] directly use meta-path based method to find related neighbor POIs in their knowledge graph. SGRec [11] combines graph-augmented POI sequence with transition patterns between POI categories to enrich POI representations and enhance model performance. However, none of the above methods consider to explicitly learn a weighted POI transition graph from a heterogeneous graph, which reflects transition pattern to some extent.\n\n\nKnowledge Graph Embedding\n\nA Knowledge Graph (KG) is a heterogeneous network, which contains multiple types of entities (nodes) and relations (edges) in the graph [6]. In this light, multiple attributes of an entity could be obtained based on different edges in the graph. In addition, high-order correlations between entities could also be found through these different relations. In a nutshell, a KG has strong representation ability. Knowledge Graph Embedding (KGE) is to embed a KG into a low dimensional space to learn the representations of each entity and each relation. The learned embedding could still preserve the inherent property of the graph. KGE algorithms can be divided into two categories: translation distance models, such as TransE [1], TransH [27], TransR [14], etc., and semantic matching models, such as DistMult [28]. In this work, we mainly focus on translation distance models, which regard relations as translation operation and calculate the distances (scores) between different entities based on different relations. \n\n\nPROBLEM STATEMENT\n\nThis section presents our formulation of next POI recommendation problem and relevant preliminary concepts. Here, we let U = { 1 , 2 , . . . | U | } be a set of users and L = { 1 , 2 , . . . , | L | } be a set of locations (POIs). Here, each location is associated with a geographical coordinates ( , ) denoting its latitude and longitude, respectively.\nDefinition 1: (Check-in) A check-in is represented by = ( , , )\n, which denotes that user visits location at time . □ Definition 2: (User trajectory) A user trajectory is defined by a sequence of temporally ordered check-in records for a particular user. We use = { 1 , 2 , . . . , } to represent the historical trajectory of user , where denotes the most recent check-in record of . □ Definition 3: (Knowledge graph) A knowledge graph, denoted by G = ( , , A, B, , , R), is a directed graph with entity type function :\n\n→ A and relation type function : → B. Each entity ∈ belongs to an entity type ( ) ∈ A and each edge ∈ belongs to a relation type ( ) ∈ B. R denotes a set of subject-property-object triples where each triple = (ℎ, , ) denotes a subject-property-object relation. Specifically, (ℎ, , ) denotes a relationship of from head entity ℎ to tail entity . □ For example, (Bob, visit, aquarium) indicates that Bob visits the aquarium. The problem of next POI recommendation is defined as follow. Definition 4: (Next POI recommendation) Given knowledge graph G, user , and the trajectory of user . The next POI recommendation problem aims to output the top-POIs that user will be most likely to visit next. □\n\n\nTRANSITION GRAPH LEARNING\n\nIn this section, we present our approach to explicitly learning the transition patterns between POIs. The approach works with a knowledge graph to generate the representations for each entity and each relation in the graph. By properly defining a neighborhood based on the learned representations, we could obtain a graph representing the transition patterns between POIs, which can then be used for next POI recommendation task.\n\n\nSpatial-Temporal Knowledge Graph\n\nUnlike traditional knowledge graph, we design a novel knowledge graph called Spatial-Temporal Knowledge Graph (STKG) as shown in Figure 2. STKG integrates the tradition User-POI interaction graph with spatiotemporal correlations among POIs and friend relationships between users. Formally, STKG is G = ( , , A, B, , , R), where is the union of user set and location set ( U L), and denotes the edges that belong to one of the following four types of relation: visiting, temporal, spatial, and social. Note that the visiting and temporal relations are directed. Here, our objective is to make full use of the check-ins recorded by all users to learn the transition patterns between POIs. We proceed to present how to construct the aforementioned four relations respectively.\n\nConstruction of visiting relation. We first construct the visiting (i.e., ) relation, which is represented by triplet ( , , ), denoting that user visits location .\n\nConstruction of temporal relation. Next, we construct temporal (i.e., ) relation, which is represented by triplet ( 1 , , 2 ), denoting that 1 is visited just before 2 based on a user's historical trajectory.\n\nConstruction of spatial relation. Given a POI , we construct its spatial relations in two methods, threshold-based method and rankbased method. For threshold-based method, we set a pre-defined distance threshold (e.g., 0.5km) and construct spatial relations between and all of the other POIs whose distances to are smaller than . As for rank-based method, we construct spatial relations between and 's top-(e.g., 50) nearest neighbors. Note that given POIs and ′ , and ′ form a spatial relation if ′ is a spatial neighbor of or is a spatial neighbor of ′ .\n\nConstruction of social relation. Finally, we construct social (i.e., ) relation, which is represented by triplet ( 1 , , 2 ), denoting that user 1 and 2 are friends. The rationale of taking friend relation into consideration is that a POI visited by 1 is likely to attract 2 if 1 and 2 are friends.\n\n\nObjective function\n\nGiven STKG G, our next goal is to find an embedding function : ( ) → R that maps each entity ∈ G. or each relation ∈ G. into an -dimensional feature vector (i.e., embedding). The embedding function (·) is expected to preserve the inherent property of G. For the purpose, we use Knowledge Graph Embedding (KGE) algorithms based on translation distance models: TransE [1], TransH [27], and TransR [14] to learn the representation of each entity and each relation in the knowledge graph. For ease of understanding, we use boldface to indicate the learned embedding of an entity or relation. For example, given an entity ℎ, = (ℎ) represents the corresponding embedding. To illustrate our embedding scheme, we take TransH [27] as an example. The basic idea of TransH is to use different hyperplanes to represent different relation spaces and regard relations as translation operation on hyperplanes. Specifically, for a triplet (ℎ, , ), the corresponding entity embeddings and are first projected to the hyperplane with constraint || || 2 = 1, which is detailed by Equation 1.\n⊥ = − , ⊥ = − ,(1)\nwhere ⊥ and ⊥ denote the projection embeddings of and , respectively. Next, we use a scoring function (·) to measure the plausibility that the triplet is incorrect, which is presented by Equation 2.\n( , ) = || ⊥ + − ⊥ || 2 2 ,(2)\nwhere denotes the translation embedding on the hyperplane. Here, a lower value of ( , ) indicates that the triplet is more likely to be correct, while a higher value denotes that the triplet is less likely to be correct.\n\nSo far, the representations of each entity and each relation have been learned. The next goal is to design a function (·) for capturing the transition patterns among POIs. Inspired by the KGE algorithms, we compute the similarity between POI 1 and 2 by defining a temporal similarity function (·), which is expected to reflect the temporal relation between 1 and 2 . We take TransE [1] as an example, the similarity function is presented by Equation 3:\n( 1 , 2 ) = − ( 1 , 2 ) , ( 1 , 2 ) = || 1 + − 2 ||,(3)\nwhere denotes the exponential function, (·) is the distance function, 1 and 2 denote the learned embeddings of POI 1 and 2 , respectively, is the temporal relation embedding, and || · || represents the 1 or 2 norm. Next, we construct the POI transition matrix ∈ R | L |× | L | based on Equation 3. However, maintaining can be memory consuming when the number of POIs (i.e., |L|) is large, which is common in recommendation scenarios. To reduce the space cost, we construct a sparse transition graph, which is denoted by . Specifically, we calculate -nearest neighbor set N ( ) for each POI . Then, we have:\n( , ) = ( , ), if POI ∈ N ( ), 0, otherwise,(4)\nwhere , = 1, 2, · · · , |L|. Finally, in order to normalize the sparse graph between 0 and 1, we pick the maximum value in each row of to construct a diagonal matrix . We obtain the learned POI transition graph by Equation 5.\n= −1 .(5)\nIt is worthy of noting that our experiment results show that the model performance when we use both spatial and temporal relations 1 is not better than the performance when we use temporal relation only. The reason may be explained by the fact that temporal relation has contained the property implicitly that users usually prefer to visit those POIs with shorter distance. Further considering spatial relation may bring no benefits or even degrades model performance. Thus, we choose to purely consider the temporal relation to construct POI transition graph. \n\n\nMODEL FRAMEWORK\n\nThis section presents the framework of our Graph-Flashback network, which consists of: (i) Embedding layer that learns the dense representations of users and POIs, (ii) GCN layer that enriches the representations of POIs by our learned POI transition graph, (iii) Aggregation layer that learns the aggregated hidden states by a weighted spatiotemporal and user preference effect as the output, and (iv) Prediction layer that recommends next POI by the aggregated output and user embedding. Figure 3 shows the network architecture of our proposed Graph-Flashback model.\n\n\nEmbedding layer\n\nWe design a multi-modal embedding layer to jointly learn the representations of the users and POIs. The representations encode user and POI information, which will later be combined with other modules for recommendation. In this light, it is important to learn the vector representations effectively. User and POI information contained in each check-in record is initially represented as one-hot vectors. However, it is difficult for a model to capture user preferences by using one-hot vector due to its sparsity. To this end, we propose to learn low dimensional dense representation for each user and each POI. Specifically, we first split the user historical trajectory into multiple length-equally sub-sequences for each user . Next, each sub-sequence are fed into the embedding layer as shown in the bottom right of Figure 3. Each POI is represented by a |L|-dimensional one-hot vector. Besides, different users have different preferences, we represent each user as a |U|-dimensional one-hot vector. The embedding layer will transform the user and POIs one-hot vectors into the corresponding low-dimensional dense representations, denoted by ∈ R and ∈ R , respectively.\n\n\nGCN Layer\n\nTo accurately reflect the characteristics of each POI, we find it insufficient to exclusively rely on the learned low-dimensional dense representation. As such, we use Graph Convolution Network (GCN) to refine the representation. Motivated by the success of LightGCN [9], we only focus on the core function of GCN: neighbor aggregation in our GCN layer. Note that transition graph cannot reflect the impact of itself for each POI. To address the issue, we add identity matrix into (i.e., self-connection) to obtain a new transition graphˆ:ˆ= + .\n\nNext, we normalize the new transition graph by Equation 7\n\n=ˆ− 1ˆ,\n\nwhereˆ= diag ˆ denotes the out-degree diagonal matrix derived fromˆ. We employ the transition graphˆto enrich the representation for each POI as shown in the bottom left of Figure 3. Finally, we haveˆ=ˆ,\n\nwhere ∈ R | L |× denotes the previous embeddings of all POIs, andˆ∈ R | L |× is the updated POI embeddings.\n\n\nAggregation Layer\n\nThe aggregation layer consists of a recurrent module that captures the sequential patterns and an aggregation module that considers the impact of historical hidden states on current hidden state. The output of GCN layer, namely updated POIs embeddings, and user preference embedding are fed into the aggregation layer. Specifically, we use the basic RNNs as recurrent module to obtain all hidden states. However, using these hidden states directly for recommendation is incapable of making full use of the temporal periodicity and spatial context contained in user check-in trajectory. In particular, users are most likely to visit some POIs (e.g., home, office, etc.) regularly and those POIs with short distance. Inspired by Flashback [29], we explicitly utilize the spatiotemporal contexts to design a similarity function (·), which reflects the correlation between historical hidden state and current one , < . Then, we have\n(Δ , , Δ , ) = ℎ (2 Δ , ) − Δ , − Δ , ,(9)\nwhere ℎ ( ) = 1+cos 2 reflects the temporal periodicity, Δ , and Δ , denote the spatial and temporal interval between two POIs and , and and represent temporal and spatial decay weight, respectively. Note that the similarity function (·) only focuses on the similarity correlation between POIs, neglecting the user general preference on POIs. Besides, the output of function (·) is limited in [0,1]. To this end, we propose to integrate user preference into the function (·). As shown in the upper left of Figure 3, the visiting relation is used to construct a sparse User-POI preference graph G ∈ R |U |×| L | in the same way as we introduced in Section 4 2 . Then, we could obtain the general preference on POIs of each user by Equation 10.\n= Gˆ,(10)\nwhere ∈ R |U |× is the user preference matrix. Finally, for each user , we obtain new similarity functionˆ(·) (Equation 11) that takes both user preference weight and spatiotemporal weight into consideration.\n(Δ , , Δ , ) = (Δ , , Δ , ) − | | − | | ,(11)\nwhere denotes the preference embedding of user , || · || is the 2 distance. The aggregation module incorporates similarity function (·) and historical hidden states into current one at each time step . Thus, we haveˆ= =0ˆ * =0ˆ, (12) whereˆdenotes the similarityˆ(Δ , , Δ , ).\n\n\nPrediction Layer\n\nThe outputˆof aggregation layer at each time step and user embedding is concatenated into a new vector, which is then fed into a fully connected layer to generate the final output through Equation 13:ˆ=\n[ˆ|| ],(13)\nwhere ∈ R | L |×2 is the learnable weight matrix, || denotes the concatenation operation. We use the cross-entropy function, denoted by Equation 14, as our loss function.\n− |U | ∑︁ =1 ∑︁ =1 log ( ) + | L | ∑︁ =1, ≠ log(1 − (ˆ)) ,(14)\nwhere denotes the length of check-in sequence of each user, ∈ˆandˆ∈ˆrepresent the corresponding prediction value of label and other POIs ≠ for current location of user , respectively, and is the softmax function.\n\n\nEXPERIMENTS\n\nThis section presents our experiments that demonstrate the effectiveness of our approach. We first present the datasets and baseline methods. Next, we present our experimental results and analysis by comparing our proposal against the state-of-the-art baselines. We also conduct ablation experiments to show the effect of each component in our framework, contrast experiments to show the effect of our learned transition graph, and parameter-tuning experiments to perform parameter sensitivity analysis.   [29], we discard inactive users who have less than 100 check-ins and sort each user's check-ins in ascending order of timestamp. The first 80% check-ins of each user are split into multiple length-equally (e.g., 20) sequences, which are chosen as training set. Likewise, the remaining 20% are regarded as testing set. In addition, the training set is also used to construct our Spatial-Temporal knowledge graph. Table 1 shows the statistics of the two datasets used in our experiments.\n\n\nBaselines\n\nWe consider the following state-of-the-art methods as the baselines in the experiments.\n\n• PRME [4]: A metric embedding method, which captures the personalized sequential transition patterns by learning user and POI embeddings. • STRNN [15]: Extends RNNs by customized spatiotemporal transition matrices. • DeepMove [3]: Combines an attention layer with gated recurrent units (GRU) to learn long-term periodicity and shortterm sequential patterns. • LBSN2Vec [30]: A hypergraph embedding method, which ranks POIs based on their similarity with user and time embeddings. • STGN [36]: Extends the LSTM by introducing spatial and temporal gates for learning the users' long-term and shortterm preferences. • LightGCN [9]: Simplifies Graph Convolution Netwotk (GCN) to learns user's preferences on POIs with pairwise ranking loss. • Flashback [29]: An RNN-based model, which is good at dealing with past historical check-in records. • STAN [20]: An attention-based model, which explicitly uses relative spatiotemporal information between POIs within the user trajectory. \n\n\nEvaluation Metrices\n\nWe use two widely used evaluation metrics: average Accuracy@K (Acc@K), and Mean Reciprocal Rank (MRR) following [29] to evaluate the performance of Graph-Flashback. Acc@K is the rate of true positive samples in the predicted top-positive samples, In our experiment, we adopt = {1, 5, 10} to evaluate recommendation performance. The Acc@K is computed as follows:\n@ = 1 | | ∑︁ ∈ | | | | ,(15)\nwhere is the set of predicted top-POIs for user , denotes the ground truth label of user . Unlike Acc@K, which focuses on top-, MRR aims to measure the overall recommendation performance of the model. The formulation of MRR is presented as follows:\n= 1 | | ∑︁ ∈ 1 ,(16)\nwhere denotes the rank of in for user .\n\n\nSettings\n\nWe use the second scheme (i.e., rank-based) to construct knowledge graph and TransE [1] is chosen to construct our POI transition graph. When constructing the POI transition graph and User-POI preference graph G , we consider and = {10, 20, 30, 50, 100} nearest neighbors for each POI (user). In addition, the dimension of hidden states and user (POI) embedding is set to 10 empirically. And the temporal decay factor and spatial decay factor follow the default setting in [29]. We evaluate the model performance every 5 epochs. Our implementation is available in Pytorch 5 .  \n\n\nResults and Analysis\n\n\nAblation Study\n\nThere are two main components in our framework: (i) the GCN layer, and (ii) the aggregation layer. To show the effects of these components, we conduct an ablation experiment on Graph-Flashback and the results on Gowalla dataset are shown in Table 3. Based on the statistics from Table 3, we have the following findings:\n\n• We observe that the POI transition graph used in GCN layer help to improve the model performance. The learned graph could enrich the representation of each POI, which further helps sequential models capture the transition patterns among POIs. • We find that using user preference properly can improve the model performance. When we integrate the learned User-POI preference graph into spatiotemporal contexts, the performance regarding personalized POI recommendation can be boosted. • We notice that Graph-Flashback performs slightly better than Graph-Flashback / Preference. The reason is that the impact of user preference has been partially reflected by the GCN.\n\n\nContrast Study\n\nWe conduct different contrast experiments to show the effects of our learned graphs. To this end, we construct customized graph by calculating POI similarity based on whether the two POIs are visited by the same user on the same day. Specifically, the similarity between POI pair indicates the number of days when both POIs are visited by same user. Next, the POI similarity graph is normalized by Equation 4 and Equation 5. From the results shown in Figure 4 and Figure 5, we have the following observations:\n\n• Figure 4 shows that the POI transition graph learned from the Spatial-Temporal knowledge graph constructed by the second scheme (i.e., rank-based) and TransE algorithm could obtain better model performance on Gowalla dataset. The    reason might be that the Spatial-Temporal knowledge graph constructed by the second scheme contains more spatial edges, which could help to learn better representation of each POI implicitly. In addition, simpler algorithm TransE might be more suitable for our knowledge graph. • As shown in Figure 5, the results are significantly better with POI graphs than without any graph on Foursquare dataset. Moreover, we could find that our POI transition graphs learned by different KGE algorithms outperform the customized graph. This shows that our learned POI graph could reflect the correlation among POIs more accurately.\n\n\nHyperparameter Sensitivity Analysis\n\nWe conduct parameter sensitivity experiment and then introduce our analyses. As shown in Figure 6, we have the following two findings:\n\n• Figure 6 (a) shows that = 100 and = 20 are the best number of nearest neighbors for POI transition graph on Gowalla and Foursquare datasets respectively. On Gowalla dataset, the model performance improves with the increasement of . However, as increases, we could find that the performance improves firstly and then degrades on Foursquare dataset. The reason might be that the check-ins data of Gowalla is more sparse than that of Foursquare. Therefore, each POI needs more neighbors and proper neighbors to enrich the representation of itself on Gowalla and Foursquare dataset, respectively. • We find that = 100 obtains better model performance on both Gowalla and Foursquare datasets from the results in Figure 6 (b). And the model performance remains almost stable on Acc@10 metric. In a nutshell, the performance of our Graph-Flashback method is insensitive to the hyperparameter .\n\n\nCONCLUSION AND FUTURE WORK\n\nTo the end, we present a learning-based method to learn a POI graph, which reflects the transition patterns among POIs. We design a novel model called Graph-Flashback that integrates the learned graph into existing sequential models seamlessly for better capturing the transition patterns. In addition, the property that the same user may have different preferences on different spatiotemporal contexts is sufficiently considered by a carefully-designed similarity function. Experimental results on Gowalla and Foursquare datasets show the superiority of Graph-Flashback in term of accuracy. Moreover, we give the ablation experiments and analysis of different components in our framework, which confirm the effectiveness of each component.\n\nIn the future, we will consider other side information (e.g., POI categories, user information) in the construction of Spatial-Temporal knowledge graph. Besides, we will consider the similarity correlation between users to further improve the model performance. Moreover, personalized POI transition graph is a promising direction as well.\n\nFigure 2 :\n2A simple illustration of our Spatial-Temporal Knowledge Graph.\n\nFigure 3 :\n3The overview of Graph-Flashback.\n\n2\n( , ) = | | + − | |, where denotes visiting relation in Equation (3).\n\nFigure 5 :\n5The performance comparison among learned POI graphs and customized POI graph. NG denotes not using any graph, CG represents the customized graph, and EG denotes the POI graph learned by TransE algorithm.\n\nFigure 6 :\n6The performance comparison about the number of nearest neighbors and .\n\nTable 1 :\n1Datasets StatisticsDataset \nGowalla \nFoursquare \n#Users \n7,768 \n45,343 \n#POIs \n106,994 \n68,879 \n#Check-ins \n1,823,598 \n9,361,228 \n\n#Entities \n114,762 \n114,222 \n#Relations \n4 \n4 \n#Triplets \n6,420,914 \n7,200,989 \n\n6.1 Datasets \n\nWe evaluate our Graph-Flashback model on two widely used real-\nworld datasets: Gowalla 3 and Foursquare 4 . Gowalla contains the \ncheck-ins from February 2009 to October 2010. Foursquare [30] is \ncollected from April 2012 to January 2014. Each check-in consists \nof userID, POIID, latitude, longitude, and timestamp. Following \nthe pre-processing technique in \n\nTable 2 :\n2Performance comparison against baselines on Gowalla and Foursquare datasets.In each column, we use boldface and \n\n\nTable 2\n2shows the experiment results on Gowalla and Foursquare datasets. Based on these results, we have the following observations and corresponding analysis: 5 https://github.com/kevin-xuan/Graph-Flashback\n\nTable 3 :\n3Ablation experiments on Gowalla dataset. Graph-Flashback / GCN denotes disabling the GCN layer, and Graph-Flashback / Preference represents disabling the User-POI preference graph. considering the effect of past historical checkins. However, it performs poorly based on our experimental results. The reason is that its training scheme may make model performance rely on the selected users. • Comparing the performance improvement on Foursquare datasets, we see that Graph-Flashback performs better on the Gowalla datasets. Meanwhile, we observe that the densityFigure 4: The performance comparison among different KGE algorithms used in different knowledge graphs constructed by different schemes on Gowalla dataset. is TransE, 1 denotes that knowledge graph is constructed by first scheme.(0.002) of check-in records on Gowalla dataset is lower than that (0.003) on Foursquare dataset. It is obvious that our proposed Graph-Flashback model has a strong ability to handle sparse data.Methods \nGowalla \nAcc@1 Acc@5 Acc@10 MRR \n\nFlashback \n0.1158 0.2754 0.3479 0.1925 \nGraph-Flashback / GCN \n0.1356 0.3055 0.3762 0.2163 \nGraph-Flashback / Preference 0.1506 0.3419 0.4253 0.2419 \nGraph-Flashback \n0.1512 0.3425 0.4256 0.2422 \n\n• The results on Gowalla and Foursquare datasets show that \nour proposed Graph-Flashback significantly outperforms \nall other state-of-the-art baseline methods under all evalua-\ntion metrics. Specifically, Graph-Flashback outperforms the \nsecond-best method Flashback with ratios 30.57%, 24.36%, \n22.33%, and 25.82% on Acc@1, Acc@5, Acc@10, and MRR re-\nspectively on Gowalla dataset. In addition, Graph-Flashback \ngains 8.04% average improvement compared with Flashback \non Foursquare dataset. In a nutshell, the aforementioned \nfindings clearly show the superiority of Graph-Flashback. \n• Compared with Flashback, our Graph-Flashback exhibits sub-\nstantial improvement in general. The reason is that the POI \ntransition graph may help to better capture the transition \npatterns among POIs by refining POI embeddings. In addi-\ntion, personalized POI recommendation may significantly \nbenefit from tackling user preference with sufficient con-\nsideration properly. Similarly, STAN is an attention-based \nlatest model \n( 1 , 2 ) = − ( 1 , 2 ) − ( 1 , 2 ) , where anddenote the temporal and spatial similarity function, respectively.\nhttp://snap.stanford.edu/data/loc-gowalla.html 4 https://sites.google.com/site/yangdingqi/home\nACKNOWLEDGEMENTS\nTranslating Embeddings for Modeling Multi-relational Data. Antoine Bordes, Nicolas Usunier, Alberto García-Durán, Jason Weston, Oksana Yakhnenko, NIPS. Antoine Bordes, Nicolas Usunier, Alberto García-Durán, Jason Weston, and Ok- sana Yakhnenko. 2013. Translating Embeddings for Modeling Multi-relational Data. In NIPS.\n\nWhere You Like to Go Next: Successive Point-of-Interest Recommendation. Chen Cheng, Haiqin Yang, Michael R Lyu, Irwin King, IJCAI. Chen Cheng, Haiqin Yang, Michael R. Lyu, and Irwin King. 2013. Where You Like to Go Next: Successive Point-of-Interest Recommendation. In IJCAI.\n\nDeepMove: Predicting Human Mobility with Attentional Recurrent Networks. Jie Feng, Yong Li, Chao Zhang, Funing Sun, Fanchao Meng, Ang Guo, Depeng Jin, WWW. Jie Feng, Yong Li, Chao Zhang, Funing Sun, Fanchao Meng, Ang Guo, and Depeng Jin. 2018. DeepMove: Predicting Human Mobility with Attentional Recurrent Networks. In WWW.\n\nPersonalized Ranking Metric Embedding for Next New POI Recommendation. Shanshan Feng, Xutao Li, Yifeng Zeng, Gao Cong, Yeow Meng Chee, Quan Yuan, IJCAI. Shanshan Feng, Xutao Li, Yifeng Zeng, Gao Cong, Yeow Meng Chee, and Quan Yuan. 2015. Personalized Ranking Metric Embedding for Next New POI Recom- mendation. In IJCAI.\n\nAn Attentional Recurrent Neural Network for Personalized Next Location Recommendation. Qing Guo, Zhu Sun, Jie Zhang, Yin-Leng Theng, AAAI. Qing Guo, Zhu Sun, Jie Zhang, and Yin-Leng Theng. 2020. An Attentional Recurrent Neural Network for Personalized Next Location Recommendation. In AAAI.\n\n. Qingyu Guo, Fuzhen Zhuang, Chuan Qin, Hengshu Zhu, Xing Xie, Hui Xiong, Qing He, 2020. A Survey on Knowledge Graph-Based Recommender Systems. CoRR. Qingyu Guo, Fuzhen Zhuang, Chuan Qin, Hengshu Zhu, Xing Xie, Hui Xiong, and Qing He. 2020. A Survey on Knowledge Graph-Based Recommender Systems. CoRR (2020).\n\nContextualized Point-of-Interest Recommendation. Peng Han, Zhongxiao Li, Yong Liu, Peilin Zhao, Jing Li, Hao Wang, Shuo Shang, IJCAI. Peng Han, Zhongxiao Li, Yong Liu, Peilin Zhao, Jing Li, Hao Wang, and Shuo Shang. 2020. Contextualized Point-of-Interest Recommendation. In IJCAI.\n\nA Graphbased Approach for Trajectory Similarity Computation in Spatial Networks. Peng Han, Jin Wang, Di Yao, Shuo Shang, Xiangliang Zhang, 10.1145/3447548.3467337ACM SIGKDD. Peng Han, Jin Wang, Di Yao, Shuo Shang, and Xiangliang Zhang. 2021. A Graph- based Approach for Trajectory Similarity Computation in Spatial Networks. In ACM SIGKDD. https://doi.org/10.1145/3447548.3467337\n\nLightGCN: Simplifying and Powering Graph Convolution Network for Recommendation. Xiangnan He, Kuan Deng, Xiang Wang, Yan Li, Yong-Dong Zhang, Meng Wang, SIGIR. Xiangnan He, Kuan Deng, Xiang Wang, Yan Li, Yong-Dong Zhang, and Meng Wang. 2020. LightGCN: Simplifying and Powering Graph Convolution Network for Recommendation. In SIGIR.\n\nHST-LSTM: A Hierarchical Spatial-Temporal Long-Short Term Memory Network for Location Prediction. Dejiang Kong, Fei Wu, IJCAI. Dejiang Kong and Fei Wu. 2018. HST-LSTM: A Hierarchical Spatial-Temporal Long-Short Term Memory Network for Location Prediction. In IJCAI.\n\nDiscovering Collaborative Signals for Next POI Recommendation with Iterative Seq2Graph Augmentation. Yang Li, Tong Chen, Yadan Luo, Hongzhi Yin, Zi Huang, IJCAI. Yang Li, Tong Chen, Yadan Luo, Hongzhi Yin, and Zi Huang. 2021. Discovering Collaborative Signals for Next POI Recommendation with Iterative Seq2Graph Augmentation. In IJCAI.\n\nXing Xie, and Enhong Chen. 2020. Geography-Aware Sequential Location Recommendation. Defu Lian, Yongji Wu, Yong Ge, SIGKDD. Defu Lian, Yongji Wu, Yong Ge, Xing Xie, and Enhong Chen. 2020. Geography- Aware Sequential Location Recommendation. In SIGKDD.\n\nSTP-UDGAT: Spatial-Temporal-Preference User Dimensional Graph Attention Network for Next POI Recommendation. Nicholas Lim, Bryan Hooi, See-Kiong Ng, Xueou Wang, Yong Liang Goh, Renrong Weng, Jagannadan Varadarajan, CIKM. Nicholas Lim, Bryan Hooi, See-Kiong Ng, Xueou Wang, Yong Liang Goh, Ren- rong Weng, and Jagannadan Varadarajan. 2020. STP-UDGAT: Spatial-Temporal- Preference User Dimensional Graph Attention Network for Next POI Recom- mendation. In CIKM.\n\nLearning Entity and Relation Embeddings for Knowledge Graph Completion. Yankai Lin, Zhiyuan Liu, Maosong Sun, Yang Liu, Xuan Zhu, AAAI. Yankai Lin, Zhiyuan Liu, Maosong Sun, Yang Liu, and Xuan Zhu. 2015. Learning Entity and Relation Embeddings for Knowledge Graph Completion. In AAAI.\n\nPredicting the Next Location: A Recurrent Model with Spatial and Temporal Contexts. Qiang Liu, Shu Wu, Liang Wang, Tieniu Tan, AAAI. Qiang Liu, Shu Wu, Liang Wang, and Tieniu Tan. 2016. Predicting the Next Location: A Recurrent Model with Spatial and Temporal Contexts. In AAAI.\n\nPersonalized point-ofinterest recommendation by mining users' preference transition. Xin Liu, Yong Liu, Karl Aberer, Chunyan Miao, CIKM. Xin Liu, Yong Liu, Karl Aberer, and Chunyan Miao. 2013. Personalized point-of- interest recommendation by mining users' preference transition. In CIKM.\n\nExploring the Context of Locations for Personalized Location Recommendations. Xin Liu, Yong Liu, Xiaoli Li, IJCAI. Xin Liu, Yong Liu, and Xiaoli Li. 2016. Exploring the Context of Locations for Personalized Location Recommendations. In IJCAI.\n\nExploiting Geographical Neighborhood Characteristics for Location Recommendation. Yong Liu, Wei Wei, Aixin Sun, Chunyan Miao, CIKM. Yong Liu, Wei Wei, Aixin Sun, and Chunyan Miao. 2014. Exploiting Geographical Neighborhood Characteristics for Location Recommendation. In CIKM.\n\nDynamic Bayesian Logistic Matrix Factorization for Recommendation with Implicit Feedback. Yong Liu, Lifan Zhao, Guimei Liu, Xinyan Lu, Peng Gao, Xiao-Li Li, Zhihui Jin, IJCAI. Yong Liu, Lifan Zhao, Guimei Liu, Xinyan Lu, Peng Gao, Xiao-Li Li, and Zhihui Jin. 2018. Dynamic Bayesian Logistic Matrix Factorization for Recommendation with Implicit Feedback. In IJCAI.\n\nSTAN: Spatio-Temporal Attention Network for Next Location Recommendation. Yingtao Luo, Qiang Liu, Zhaocheng Liu, WWWYingtao Luo, Qiang Liu, and Zhaocheng Liu. 2021. STAN: Spatio-Temporal Attention Network for Next Location Recommendation. In WWW.\n\nPredicting future locations with hidden Markov models. Wesley Mathew, Ruben Raposo, Bruno Martins, UbiComp. Wesley Mathew, Ruben Raposo, and Bruno Martins. 2012. Predicting future locations with hidden Markov models. In UbiComp.\n\nQuoc Viet Hung Nguyen, and Hongzhi Yin. 2020. Where to Go Next: Modeling Long-and Short-Term User Preferences for Point-of-Interest Recommendation. Ke Sun, Tieyun Qian, Tong Chen, Yile Liang, AAAI. Ke Sun, Tieyun Qian, Tong Chen, Yile Liang, Quoc Viet Hung Nguyen, and Hongzhi Yin. 2020. Where to Go Next: Modeling Long-and Short-Term User Preferences for Point-of-Interest Recommendation. In AAAI.\n\nHaining Tan, Di Yao, Tao Huang, Baoli Wang, Quanliang Jing, and Jingping Bi. 2021. Meta-Learning Enhanced Neural ODE for Citywide Next POI Recommendation. MDMHaining Tan, Di Yao, Tao Huang, Baoli Wang, Quanliang Jing, and Jingping Bi. 2021. Meta-Learning Enhanced Neural ODE for Citywide Next POI Recommen- dation. In MDM.\n\nAttention is All you Need. Ashish Vaswani, Noam Shazeer, Niki Parmar, Jakob Uszkoreit, Llion Jones, Aidan N Gomez, Lukasz Kaiser, Illia Polosukhin, NIPS. Ashish Vaswani, Noam Shazeer, Niki Parmar, Jakob Uszkoreit, Llion Jones, Aidan N. Gomez, Lukasz Kaiser, and Illia Polosukhin. 2017. Attention is All you Need. In NIPS.\n\nExploiting POI-Specific Geographical Influence for Point-of-Interest Recommendation. Hao Wang, Huawei Shen, Wentao Ouyang, Xueqi Cheng, IJCAI. Hao Wang, Huawei Shen, Wentao Ouyang, and Xueqi Cheng. 2018. Exploiting POI-Specific Geographical Influence for Point-of-Interest Recommendation. In IJCAI.\n\nVery Important Person Localization in Unconstrained Conditions: A New Benchmark. Xiao Wang, Zheng Wang, Toshihiko Yamasaki, Wenjun Zeng, AAAI. Xiao Wang, Zheng Wang, Toshihiko Yamasaki, and Wenjun Zeng. 2021. Very Important Person Localization in Unconstrained Conditions: A New Benchmark. In AAAI.\n\nKnowledge Graph Embedding by Translating on Hyperplanes. Zhen Wang, Jianwen Zhang, Jianlin Feng, Zheng Chen, AAAI. Zhen Wang, Jianwen Zhang, Jianlin Feng, and Zheng Chen. 2014. Knowledge Graph Embedding by Translating on Hyperplanes. In AAAI.\n\nEmbedding Entities and Relations for Learning and Inference in Knowledge Bases. Bishan Yang, Wen-Tau Yih, Xiaodong He, Jianfeng Gao, Li Deng, ICLR. Bishan Yang, Wen-tau Yih, Xiaodong He, Jianfeng Gao, and Li Deng. 2015. Em- bedding Entities and Relations for Learning and Inference in Knowledge Bases. In ICLR.\n\nLocation Prediction over Sparse User Mobility Traces Using RNNs: Flashback in Hidden States!. Dingqi Yang, Benjamin Fankhauser, Paolo Rosso, Philippe Cudré-Mauroux, IJCAI. Dingqi Yang, Benjamin Fankhauser, Paolo Rosso, and Philippe Cudré-Mauroux. 2020. Location Prediction over Sparse User Mobility Traces Using RNNs: Flash- back in Hidden States!. In IJCAI.\n\nRevisiting User Mobility and Social Relationships in LBSNs: A Hypergraph Embedding Approach. Dingqi Yang, Bingqing Qu, Jie Yang, Philippe Cudré-Mauroux, WWW. Dingqi Yang, Bingqing Qu, Jie Yang, and Philippe Cudré-Mauroux. 2019. Revisit- ing User Mobility and Social Relationships in LBSNs: A Hypergraph Embedding Approach. In WWW.\n\nSERM: A Recurrent Model for Next Location Prediction in Semantic Trajectories. Di Yao, Chao Zhang, Jian-Hui Huang, Jingping Bi, CIKM. Di Yao, Chao Zhang, Jian-Hui Huang, and Jingping Bi. 2017. SERM: A Recurrent Model for Next Location Prediction in Semantic Trajectories. In CIKM.\n\nExploiting geographical influence for collaborative point-of-interest recommendation. Mao Ye, Peifeng Yin, Wang-Chien Lee, Dik Lun Lee, SIGIR. Mao Ye, Peifeng Yin, Wang-Chien Lee, and Dik Lun Lee. 2011. Exploiting geo- graphical influence for collaborative point-of-interest recommendation. In SIGIR.\n\nA Category-Aware Deep Model for Successive POI Recommendation on Sparse Check-in Data. Fuqiang Yu, Lizhen Cui, Wei Guo, Xudong Lu, Qingzhong Li, Hua Lu, WWW. Fuqiang Yu, Lizhen Cui, Wei Guo, Xudong Lu, Qingzhong Li, and Hua Lu. 2020. A Category-Aware Deep Model for Successive POI Recommendation on Sparse Check-in Data. In WWW.\n\nAdaptive User Modeling with Long and Short-Term Preferences for Personalized Recommendation. Zeping Yu, Jianxun Lian, Ahmad Mahmoody, Gongshen Liu, Xing Xie, IJCAI. Zeping Yu, Jianxun Lian, Ahmad Mahmoody, Gongshen Liu, and Xing Xie. 2019. Adaptive User Modeling with Long and Short-Term Preferences for Personalized Recommendation. In IJCAI.\n\nSequential Click Prediction for Sponsored Search with Recurrent Neural Networks. Yuyu Zhang, Hanjun Dai, Chang Xu, Jun Feng, Taifeng Wang, Jiang Bian, Bin Wang, Tie-Yan Liu, AAAI. Yuyu Zhang, Hanjun Dai, Chang Xu, Jun Feng, Taifeng Wang, Jiang Bian, Bin Wang, and Tie-Yan Liu. 2014. Sequential Click Prediction for Sponsored Search with Recurrent Neural Networks. In AAAI.\n\nWhere to Go Next: A Spatio-Temporal Gated Network for Next POI Recommendation. Pengpeng Zhao, Haifeng Zhu, Yanchi Liu, Jiajie Xu, Zhixu Li, Fuzhen Zhuang, Victor S Sheng, Xiaofang Zhou, AAAI. Pengpeng Zhao, Haifeng Zhu, Yanchi Liu, Jiajie Xu, Zhixu Li, Fuzhen Zhuang, Victor S. Sheng, and Xiaofang Zhou. 2019. Where to Go Next: A Spatio-Temporal Gated Network for Next POI Recommendation. In AAAI.\n", "annotations": {"author": "[{\"end\":108,\"start\":78},{\"end\":119,\"start\":109},{\"end\":129,\"start\":120},{\"end\":141,\"start\":130},{\"end\":172,\"start\":142},{\"end\":198,\"start\":173},{\"end\":208,\"start\":199},{\"end\":219,\"start\":209},{\"end\":229,\"start\":220},{\"end\":241,\"start\":230},{\"end\":250,\"start\":242},{\"end\":255,\"start\":251},{\"end\":328,\"start\":256},{\"end\":401,\"start\":329},{\"end\":446,\"start\":402},{\"end\":519,\"start\":447},{\"end\":566,\"start\":520},{\"end\":632,\"start\":567}]", "publisher": null, "author_last_name": "[{\"end\":86,\"start\":83},{\"end\":118,\"start\":114},{\"end\":128,\"start\":125},{\"end\":140,\"start\":135},{\"end\":149,\"start\":146},{\"end\":181,\"start\":178},{\"end\":207,\"start\":204},{\"end\":218,\"start\":214},{\"end\":228,\"start\":225},{\"end\":240,\"start\":235},{\"end\":249,\"start\":246}]", "author_first_name": "[{\"end\":82,\"start\":78},{\"end\":113,\"start\":109},{\"end\":124,\"start\":120},{\"end\":134,\"start\":130},{\"end\":145,\"start\":142},{\"end\":177,\"start\":173},{\"end\":203,\"start\":199},{\"end\":213,\"start\":209},{\"end\":224,\"start\":220},{\"end\":234,\"start\":230},{\"end\":245,\"start\":242},{\"end\":254,\"start\":251}]", "author_affiliation": "[{\"end\":327,\"start\":257},{\"end\":400,\"start\":330},{\"end\":445,\"start\":403},{\"end\":518,\"start\":448},{\"end\":565,\"start\":521},{\"end\":631,\"start\":568}]", "title": "[{\"end\":57,\"start\":1},{\"end\":689,\"start\":633}]", "venue": "[{\"end\":694,\"start\":691}]", "abstract": "[{\"end\":2861,\"start\":1171}]", "bib_ref": "[{\"attributes\":{\"ref_id\":\"b9\"},\"end\":3317,\"start\":3313},{\"attributes\":{\"ref_id\":\"b25\"},\"end\":3320,\"start\":3317},{\"attributes\":{\"ref_id\":\"b33\"},\"end\":3323,\"start\":3320},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":3545,\"start\":3542},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":3548,\"start\":3545},{\"attributes\":{\"ref_id\":\"b18\"},\"end\":3551,\"start\":3548},{\"attributes\":{\"ref_id\":\"b3\"},\"end\":3677,\"start\":3674},{\"attributes\":{\"ref_id\":\"b6\"},\"end\":3679,\"start\":3677},{\"attributes\":{\"ref_id\":\"b21\"},\"end\":3682,\"start\":3679},{\"attributes\":{\"ref_id\":\"b28\"},\"end\":3685,\"start\":3682},{\"attributes\":{\"ref_id\":\"b31\"},\"end\":3688,\"start\":3685},{\"attributes\":{\"ref_id\":\"b35\"},\"end\":3691,\"start\":3688},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":4014,\"start\":4011},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":4225,\"start\":4221},{\"attributes\":{\"ref_id\":\"b35\"},\"end\":4228,\"start\":4225},{\"attributes\":{\"ref_id\":\"b23\"},\"end\":4344,\"start\":4340},{\"attributes\":{\"ref_id\":\"b2\"},\"end\":4391,\"start\":4388},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":4393,\"start\":4391},{\"attributes\":{\"ref_id\":\"b11\"},\"end\":4396,\"start\":4393},{\"attributes\":{\"ref_id\":\"b19\"},\"end\":4399,\"start\":4396},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":4566,\"start\":4562},{\"attributes\":{\"ref_id\":\"b12\"},\"end\":4569,\"start\":4566},{\"attributes\":{\"ref_id\":\"b7\"},\"end\":5047,\"start\":5044},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":5050,\"start\":5047},{\"attributes\":{\"ref_id\":\"b12\"},\"end\":5053,\"start\":5050},{\"attributes\":{\"ref_id\":\"b8\"},\"end\":5641,\"start\":5638},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":7456,\"start\":7452},{\"attributes\":{\"ref_id\":\"b12\"},\"end\":7459,\"start\":7456},{\"attributes\":{\"ref_id\":\"b8\"},\"end\":7556,\"start\":7553},{\"attributes\":{\"ref_id\":\"b6\"},\"end\":10144,\"start\":10141},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":10148,\"start\":10144},{\"attributes\":{\"ref_id\":\"b16\"},\"end\":10152,\"start\":10148},{\"attributes\":{\"ref_id\":\"b17\"},\"end\":10156,\"start\":10152},{\"attributes\":{\"ref_id\":\"b18\"},\"end\":10160,\"start\":10156},{\"attributes\":{\"ref_id\":\"b24\"},\"end\":10163,\"start\":10160},{\"attributes\":{\"ref_id\":\"b22\"},\"end\":10318,\"start\":10314},{\"attributes\":{\"ref_id\":\"b30\"},\"end\":10321,\"start\":10318},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":10894,\"start\":10891},{\"attributes\":{\"ref_id\":\"b3\"},\"end\":10896,\"start\":10894},{\"attributes\":{\"ref_id\":\"b20\"},\"end\":10899,\"start\":10896},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":10909,\"start\":10906},{\"attributes\":{\"ref_id\":\"b3\"},\"end\":11023,\"start\":11020},{\"attributes\":{\"ref_id\":\"b11\"},\"end\":11371,\"start\":11367},{\"attributes\":{\"ref_id\":\"b34\"},\"end\":11374,\"start\":11371},{\"attributes\":{\"ref_id\":\"b2\"},\"end\":11388,\"start\":11385},{\"attributes\":{\"ref_id\":\"b35\"},\"end\":11540,\"start\":11536},{\"attributes\":{\"ref_id\":\"b32\"},\"end\":11671,\"start\":11667},{\"attributes\":{\"ref_id\":\"b19\"},\"end\":11759,\"start\":11755},{\"attributes\":{\"ref_id\":\"b12\"},\"end\":12084,\"start\":12080},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":12204,\"start\":12201},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":12307,\"start\":12303},{\"attributes\":{\"ref_id\":\"b5\"},\"end\":12797,\"start\":12794},{\"attributes\":{\"ref_id\":\"b0\"},\"end\":13386,\"start\":13383},{\"attributes\":{\"ref_id\":\"b26\"},\"end\":13399,\"start\":13395},{\"attributes\":{\"ref_id\":\"b13\"},\"end\":13412,\"start\":13408},{\"attributes\":{\"ref_id\":\"b27\"},\"end\":13471,\"start\":13467},{\"attributes\":{\"ref_id\":\"b0\"},\"end\":18163,\"start\":18160},{\"attributes\":{\"ref_id\":\"b26\"},\"end\":18176,\"start\":18172},{\"attributes\":{\"ref_id\":\"b13\"},\"end\":18193,\"start\":18189},{\"attributes\":{\"ref_id\":\"b26\"},\"end\":18515,\"start\":18511},{\"attributes\":{\"ref_id\":\"b0\"},\"end\":19722,\"start\":19719},{\"end\":19788,\"start\":19778},{\"attributes\":{\"ref_id\":\"b8\"},\"end\":23364,\"start\":23361},{\"attributes\":{\"ref_id\":\"b28\"},\"end\":24784,\"start\":24780},{\"end\":25411,\"start\":25408},{\"attributes\":{\"ref_id\":\"b0\"},\"end\":25413,\"start\":25411},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":25756,\"start\":25754},{\"attributes\":{\"ref_id\":\"b11\"},\"end\":26256,\"start\":26252},{\"attributes\":{\"ref_id\":\"b12\"},\"end\":26519,\"start\":26517},{\"attributes\":{\"ref_id\":\"b28\"},\"end\":27507,\"start\":27503},{\"attributes\":{\"ref_id\":\"b19\"},\"end\":27718,\"start\":27715},{\"attributes\":{\"ref_id\":\"b3\"},\"end\":28101,\"start\":28098},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":28242,\"start\":28238},{\"attributes\":{\"ref_id\":\"b2\"},\"end\":28321,\"start\":28318},{\"attributes\":{\"ref_id\":\"b29\"},\"end\":28465,\"start\":28461},{\"attributes\":{\"ref_id\":\"b35\"},\"end\":28583,\"start\":28579},{\"attributes\":{\"ref_id\":\"b8\"},\"end\":28719,\"start\":28716},{\"attributes\":{\"ref_id\":\"b28\"},\"end\":28845,\"start\":28841},{\"attributes\":{\"ref_id\":\"b19\"},\"end\":28942,\"start\":28938},{\"attributes\":{\"ref_id\":\"b28\"},\"end\":29209,\"start\":29205},{\"attributes\":{\"ref_id\":\"b0\"},\"end\":29893,\"start\":29890},{\"attributes\":{\"ref_id\":\"b28\"},\"end\":30283,\"start\":30279},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":31856,\"start\":31855}]", "figure": "[{\"attributes\":{\"id\":\"fig_1\"},\"end\":35051,\"start\":34976},{\"attributes\":{\"id\":\"fig_2\"},\"end\":35097,\"start\":35052},{\"attributes\":{\"id\":\"fig_3\"},\"end\":35170,\"start\":35098},{\"attributes\":{\"id\":\"fig_5\"},\"end\":35387,\"start\":35171},{\"attributes\":{\"id\":\"fig_7\"},\"end\":35471,\"start\":35388},{\"attributes\":{\"id\":\"tab_0\",\"type\":\"table\"},\"end\":36071,\"start\":35472},{\"attributes\":{\"id\":\"tab_1\",\"type\":\"table\"},\"end\":36197,\"start\":36072},{\"attributes\":{\"id\":\"tab_2\",\"type\":\"table\"},\"end\":36407,\"start\":36198},{\"attributes\":{\"id\":\"tab_3\",\"type\":\"table\"},\"end\":38660,\"start\":36408}]", "paragraph": "[{\"end\":3692,\"start\":2877},{\"end\":4716,\"start\":3694},{\"end\":4911,\"start\":4718},{\"end\":6457,\"start\":4913},{\"end\":8160,\"start\":6459},{\"end\":8378,\"start\":8162},{\"end\":8455,\"start\":8380},{\"end\":9764,\"start\":8457},{\"end\":9889,\"start\":9781},{\"end\":10619,\"start\":9917},{\"end\":12628,\"start\":10621},{\"end\":13677,\"start\":12658},{\"end\":14052,\"start\":13699},{\"end\":14572,\"start\":14117},{\"end\":15269,\"start\":14574},{\"end\":15728,\"start\":15299},{\"end\":16538,\"start\":15765},{\"end\":16703,\"start\":16540},{\"end\":16913,\"start\":16705},{\"end\":17471,\"start\":16915},{\"end\":17771,\"start\":17473},{\"end\":18865,\"start\":17794},{\"end\":19083,\"start\":18885},{\"end\":19335,\"start\":19115},{\"end\":19789,\"start\":19337},{\"end\":20452,\"start\":19846},{\"end\":20726,\"start\":20501},{\"end\":21298,\"start\":20737},{\"end\":21886,\"start\":21318},{\"end\":23080,\"start\":21906},{\"end\":23639,\"start\":23094},{\"end\":23698,\"start\":23641},{\"end\":23707,\"start\":23700},{\"end\":23912,\"start\":23709},{\"end\":24021,\"start\":23914},{\"end\":24971,\"start\":24043},{\"end\":25757,\"start\":25015},{\"end\":25976,\"start\":25768},{\"end\":26299,\"start\":26023},{\"end\":26522,\"start\":26320},{\"end\":26705,\"start\":26535},{\"end\":26981,\"start\":26769},{\"end\":27988,\"start\":26997},{\"end\":28089,\"start\":28002},{\"end\":29069,\"start\":28091},{\"end\":29454,\"start\":29093},{\"end\":29732,\"start\":29484},{\"end\":29793,\"start\":29754},{\"end\":30383,\"start\":29806},{\"end\":30744,\"start\":30425},{\"end\":31414,\"start\":30746},{\"end\":31942,\"start\":31433},{\"end\":32799,\"start\":31944},{\"end\":32973,\"start\":32839},{\"end\":33863,\"start\":32975},{\"end\":34634,\"start\":33894},{\"end\":34975,\"start\":34636}]", "formula": "[{\"attributes\":{\"id\":\"formula_0\"},\"end\":14116,\"start\":14053},{\"attributes\":{\"id\":\"formula_1\"},\"end\":18884,\"start\":18866},{\"attributes\":{\"id\":\"formula_2\"},\"end\":19114,\"start\":19084},{\"attributes\":{\"id\":\"formula_3\"},\"end\":19845,\"start\":19790},{\"attributes\":{\"id\":\"formula_4\"},\"end\":20500,\"start\":20453},{\"attributes\":{\"id\":\"formula_5\"},\"end\":20736,\"start\":20727},{\"attributes\":{\"id\":\"formula_9\"},\"end\":25014,\"start\":24972},{\"attributes\":{\"id\":\"formula_10\"},\"end\":25767,\"start\":25758},{\"attributes\":{\"id\":\"formula_11\"},\"end\":26022,\"start\":25977},{\"attributes\":{\"id\":\"formula_12\"},\"end\":26534,\"start\":26523},{\"attributes\":{\"id\":\"formula_13\"},\"end\":26768,\"start\":26706},{\"attributes\":{\"id\":\"formula_14\"},\"end\":29483,\"start\":29455},{\"attributes\":{\"id\":\"formula_15\"},\"end\":29753,\"start\":29733}]", "table_ref": "[{\"attributes\":{\"ref_id\":\"tab_0\"},\"end\":27922,\"start\":27915},{\"attributes\":{\"ref_id\":\"tab_3\"},\"end\":30673,\"start\":30666},{\"attributes\":{\"ref_id\":\"tab_3\"},\"end\":30711,\"start\":30704}]", "section_header": "[{\"attributes\":{\"n\":\"1\"},\"end\":2875,\"start\":2863},{\"attributes\":{\"n\":\"2\"},\"end\":9779,\"start\":9767},{\"attributes\":{\"n\":\"2.1\"},\"end\":9915,\"start\":9892},{\"attributes\":{\"n\":\"2.2\"},\"end\":12656,\"start\":12631},{\"attributes\":{\"n\":\"3\"},\"end\":13697,\"start\":13680},{\"attributes\":{\"n\":\"4\"},\"end\":15297,\"start\":15272},{\"attributes\":{\"n\":\"4.1\"},\"end\":15763,\"start\":15731},{\"attributes\":{\"n\":\"4.2\"},\"end\":17792,\"start\":17774},{\"attributes\":{\"n\":\"5\"},\"end\":21316,\"start\":21301},{\"attributes\":{\"n\":\"5.1\"},\"end\":21904,\"start\":21889},{\"attributes\":{\"n\":\"5.2\"},\"end\":23092,\"start\":23083},{\"attributes\":{\"n\":\"5.3\"},\"end\":24041,\"start\":24024},{\"attributes\":{\"n\":\"5.4\"},\"end\":26318,\"start\":26302},{\"attributes\":{\"n\":\"6\"},\"end\":26995,\"start\":26984},{\"attributes\":{\"n\":\"6.2\"},\"end\":28000,\"start\":27991},{\"attributes\":{\"n\":\"6.3\"},\"end\":29091,\"start\":29072},{\"attributes\":{\"n\":\"6.4\"},\"end\":29804,\"start\":29796},{\"attributes\":{\"n\":\"6.5\"},\"end\":30406,\"start\":30386},{\"attributes\":{\"n\":\"6.6\"},\"end\":30423,\"start\":30409},{\"attributes\":{\"n\":\"6.7\"},\"end\":31431,\"start\":31417},{\"attributes\":{\"n\":\"6.8\"},\"end\":32837,\"start\":32802},{\"attributes\":{\"n\":\"7\"},\"end\":33892,\"start\":33866},{\"end\":34987,\"start\":34977},{\"end\":35063,\"start\":35053},{\"end\":35100,\"start\":35099},{\"end\":35182,\"start\":35172},{\"end\":35399,\"start\":35389},{\"end\":35482,\"start\":35473},{\"end\":36082,\"start\":36073},{\"end\":36206,\"start\":36199},{\"end\":36418,\"start\":36409}]", "table": "[{\"end\":36071,\"start\":35503},{\"end\":36197,\"start\":36160},{\"end\":38660,\"start\":37404}]", "figure_caption": "[{\"end\":35051,\"start\":34989},{\"end\":35097,\"start\":35065},{\"end\":35170,\"start\":35101},{\"end\":35387,\"start\":35184},{\"end\":35471,\"start\":35401},{\"end\":35503,\"start\":35484},{\"end\":36160,\"start\":36084},{\"end\":36407,\"start\":36208},{\"end\":37404,\"start\":36420}]", "figure_ref": "[{\"end\":7078,\"start\":7070},{\"end\":7949,\"start\":7941},{\"attributes\":{\"ref_id\":\"fig_1\"},\"end\":15902,\"start\":15894},{\"end\":16085,\"start\":16067},{\"end\":18724,\"start\":18689},{\"attributes\":{\"ref_id\":\"fig_2\"},\"end\":21816,\"start\":21808},{\"attributes\":{\"ref_id\":\"fig_2\"},\"end\":22735,\"start\":22727},{\"attributes\":{\"ref_id\":\"fig_2\"},\"end\":23890,\"start\":23882},{\"attributes\":{\"ref_id\":\"fig_2\"},\"end\":25529,\"start\":25521},{\"end\":31892,\"start\":31884},{\"attributes\":{\"ref_id\":\"fig_5\"},\"end\":31905,\"start\":31897},{\"end\":31954,\"start\":31946},{\"attributes\":{\"ref_id\":\"fig_5\"},\"end\":32479,\"start\":32471},{\"attributes\":{\"ref_id\":\"fig_7\"},\"end\":32936,\"start\":32928},{\"attributes\":{\"ref_id\":\"fig_7\"},\"end\":32985,\"start\":32977},{\"attributes\":{\"ref_id\":\"fig_7\"},\"end\":33692,\"start\":33684}]", "bib_author_first_name": "[{\"end\":38953,\"start\":38946},{\"end\":38969,\"start\":38962},{\"end\":38986,\"start\":38979},{\"end\":39006,\"start\":39001},{\"end\":39021,\"start\":39015},{\"end\":39283,\"start\":39279},{\"end\":39297,\"start\":39291},{\"end\":39311,\"start\":39304},{\"end\":39313,\"start\":39312},{\"end\":39324,\"start\":39319},{\"end\":39560,\"start\":39557},{\"end\":39571,\"start\":39567},{\"end\":39580,\"start\":39576},{\"end\":39594,\"start\":39588},{\"end\":39607,\"start\":39600},{\"end\":39617,\"start\":39614},{\"end\":39629,\"start\":39623},{\"end\":39889,\"start\":39881},{\"end\":39901,\"start\":39896},{\"end\":39912,\"start\":39906},{\"end\":39922,\"start\":39919},{\"end\":39933,\"start\":39929},{\"end\":39949,\"start\":39945},{\"end\":40223,\"start\":40219},{\"end\":40232,\"start\":40229},{\"end\":40241,\"start\":40238},{\"end\":40257,\"start\":40249},{\"end\":40432,\"start\":40426},{\"end\":40444,\"start\":40438},{\"end\":40458,\"start\":40453},{\"end\":40471,\"start\":40464},{\"end\":40481,\"start\":40477},{\"end\":40490,\"start\":40487},{\"end\":40502,\"start\":40498},{\"end\":40787,\"start\":40783},{\"end\":40802,\"start\":40793},{\"end\":40811,\"start\":40807},{\"end\":40823,\"start\":40817},{\"end\":40834,\"start\":40830},{\"end\":40842,\"start\":40839},{\"end\":40853,\"start\":40849},{\"end\":41101,\"start\":41097},{\"end\":41110,\"start\":41107},{\"end\":41119,\"start\":41117},{\"end\":41129,\"start\":41125},{\"end\":41147,\"start\":41137},{\"end\":41486,\"start\":41478},{\"end\":41495,\"start\":41491},{\"end\":41507,\"start\":41502},{\"end\":41517,\"start\":41514},{\"end\":41531,\"start\":41522},{\"end\":41543,\"start\":41539},{\"end\":41836,\"start\":41829},{\"end\":41846,\"start\":41843},{\"end\":42103,\"start\":42099},{\"end\":42112,\"start\":42108},{\"end\":42124,\"start\":42119},{\"end\":42137,\"start\":42130},{\"end\":42145,\"start\":42143},{\"end\":42425,\"start\":42421},{\"end\":42438,\"start\":42432},{\"end\":42447,\"start\":42443},{\"end\":42706,\"start\":42698},{\"end\":42717,\"start\":42712},{\"end\":42733,\"start\":42724},{\"end\":42743,\"start\":42738},{\"end\":42754,\"start\":42750},{\"end\":42760,\"start\":42755},{\"end\":42773,\"start\":42766},{\"end\":42790,\"start\":42780},{\"end\":43128,\"start\":43122},{\"end\":43141,\"start\":43134},{\"end\":43154,\"start\":43147},{\"end\":43164,\"start\":43160},{\"end\":43174,\"start\":43170},{\"end\":43425,\"start\":43420},{\"end\":43434,\"start\":43431},{\"end\":43444,\"start\":43439},{\"end\":43457,\"start\":43451},{\"end\":43704,\"start\":43701},{\"end\":43714,\"start\":43710},{\"end\":43724,\"start\":43720},{\"end\":43740,\"start\":43733},{\"end\":43987,\"start\":43984},{\"end\":43997,\"start\":43993},{\"end\":44009,\"start\":44003},{\"end\":44236,\"start\":44232},{\"end\":44245,\"start\":44242},{\"end\":44256,\"start\":44251},{\"end\":44269,\"start\":44262},{\"end\":44522,\"start\":44518},{\"end\":44533,\"start\":44528},{\"end\":44546,\"start\":44540},{\"end\":44558,\"start\":44552},{\"end\":44567,\"start\":44563},{\"end\":44580,\"start\":44573},{\"end\":44591,\"start\":44585},{\"end\":44875,\"start\":44868},{\"end\":44886,\"start\":44881},{\"end\":44901,\"start\":44892},{\"end\":45103,\"start\":45097},{\"end\":45117,\"start\":45112},{\"end\":45131,\"start\":45126},{\"end\":45422,\"start\":45420},{\"end\":45434,\"start\":45428},{\"end\":45445,\"start\":45441},{\"end\":45456,\"start\":45452},{\"end\":45679,\"start\":45672},{\"end\":45687,\"start\":45685},{\"end\":45696,\"start\":45693},{\"end\":45709,\"start\":45704},{\"end\":46029,\"start\":46023},{\"end\":46043,\"start\":46039},{\"end\":46057,\"start\":46053},{\"end\":46071,\"start\":46066},{\"end\":46088,\"start\":46083},{\"end\":46101,\"start\":46096},{\"end\":46103,\"start\":46102},{\"end\":46117,\"start\":46111},{\"end\":46131,\"start\":46126},{\"end\":46407,\"start\":46404},{\"end\":46420,\"start\":46414},{\"end\":46433,\"start\":46427},{\"end\":46447,\"start\":46442},{\"end\":46704,\"start\":46700},{\"end\":46716,\"start\":46711},{\"end\":46732,\"start\":46723},{\"end\":46749,\"start\":46743},{\"end\":46980,\"start\":46976},{\"end\":46994,\"start\":46987},{\"end\":47009,\"start\":47002},{\"end\":47021,\"start\":47016},{\"end\":47249,\"start\":47243},{\"end\":47263,\"start\":47256},{\"end\":47277,\"start\":47269},{\"end\":47290,\"start\":47282},{\"end\":47298,\"start\":47296},{\"end\":47575,\"start\":47569},{\"end\":47590,\"start\":47582},{\"end\":47608,\"start\":47603},{\"end\":47624,\"start\":47616},{\"end\":47934,\"start\":47928},{\"end\":47949,\"start\":47941},{\"end\":47957,\"start\":47954},{\"end\":47972,\"start\":47964},{\"end\":48248,\"start\":48246},{\"end\":48258,\"start\":48254},{\"end\":48274,\"start\":48266},{\"end\":48290,\"start\":48282},{\"end\":48538,\"start\":48535},{\"end\":48550,\"start\":48543},{\"end\":48566,\"start\":48556},{\"end\":48579,\"start\":48572},{\"end\":48845,\"start\":48838},{\"end\":48856,\"start\":48850},{\"end\":48865,\"start\":48862},{\"end\":48877,\"start\":48871},{\"end\":48891,\"start\":48882},{\"end\":48899,\"start\":48896},{\"end\":49180,\"start\":49174},{\"end\":49192,\"start\":49185},{\"end\":49204,\"start\":49199},{\"end\":49223,\"start\":49215},{\"end\":49233,\"start\":49229},{\"end\":49510,\"start\":49506},{\"end\":49524,\"start\":49518},{\"end\":49535,\"start\":49530},{\"end\":49543,\"start\":49540},{\"end\":49557,\"start\":49550},{\"end\":49569,\"start\":49564},{\"end\":49579,\"start\":49576},{\"end\":49593,\"start\":49586},{\"end\":49886,\"start\":49878},{\"end\":49900,\"start\":49893},{\"end\":49912,\"start\":49906},{\"end\":49924,\"start\":49918},{\"end\":49934,\"start\":49929},{\"end\":49945,\"start\":49939},{\"end\":49960,\"start\":49954},{\"end\":49962,\"start\":49961},{\"end\":49978,\"start\":49970}]", "bib_author_last_name": "[{\"end\":38960,\"start\":38954},{\"end\":38977,\"start\":38970},{\"end\":38999,\"start\":38987},{\"end\":39013,\"start\":39007},{\"end\":39031,\"start\":39022},{\"end\":39289,\"start\":39284},{\"end\":39302,\"start\":39298},{\"end\":39317,\"start\":39314},{\"end\":39329,\"start\":39325},{\"end\":39565,\"start\":39561},{\"end\":39574,\"start\":39572},{\"end\":39586,\"start\":39581},{\"end\":39598,\"start\":39595},{\"end\":39612,\"start\":39608},{\"end\":39621,\"start\":39618},{\"end\":39633,\"start\":39630},{\"end\":39894,\"start\":39890},{\"end\":39904,\"start\":39902},{\"end\":39917,\"start\":39913},{\"end\":39927,\"start\":39923},{\"end\":39943,\"start\":39934},{\"end\":39954,\"start\":39950},{\"end\":40227,\"start\":40224},{\"end\":40236,\"start\":40233},{\"end\":40247,\"start\":40242},{\"end\":40263,\"start\":40258},{\"end\":40436,\"start\":40433},{\"end\":40451,\"start\":40445},{\"end\":40462,\"start\":40459},{\"end\":40475,\"start\":40472},{\"end\":40485,\"start\":40482},{\"end\":40496,\"start\":40491},{\"end\":40505,\"start\":40503},{\"end\":40791,\"start\":40788},{\"end\":40805,\"start\":40803},{\"end\":40815,\"start\":40812},{\"end\":40828,\"start\":40824},{\"end\":40837,\"start\":40835},{\"end\":40847,\"start\":40843},{\"end\":40859,\"start\":40854},{\"end\":41105,\"start\":41102},{\"end\":41115,\"start\":41111},{\"end\":41123,\"start\":41120},{\"end\":41135,\"start\":41130},{\"end\":41153,\"start\":41148},{\"end\":41489,\"start\":41487},{\"end\":41500,\"start\":41496},{\"end\":41512,\"start\":41508},{\"end\":41520,\"start\":41518},{\"end\":41537,\"start\":41532},{\"end\":41548,\"start\":41544},{\"end\":41841,\"start\":41837},{\"end\":41849,\"start\":41847},{\"end\":42106,\"start\":42104},{\"end\":42117,\"start\":42113},{\"end\":42128,\"start\":42125},{\"end\":42141,\"start\":42138},{\"end\":42151,\"start\":42146},{\"end\":42430,\"start\":42426},{\"end\":42441,\"start\":42439},{\"end\":42450,\"start\":42448},{\"end\":42710,\"start\":42707},{\"end\":42722,\"start\":42718},{\"end\":42736,\"start\":42734},{\"end\":42748,\"start\":42744},{\"end\":42764,\"start\":42761},{\"end\":42778,\"start\":42774},{\"end\":42802,\"start\":42791},{\"end\":43132,\"start\":43129},{\"end\":43145,\"start\":43142},{\"end\":43158,\"start\":43155},{\"end\":43168,\"start\":43165},{\"end\":43178,\"start\":43175},{\"end\":43429,\"start\":43426},{\"end\":43437,\"start\":43435},{\"end\":43449,\"start\":43445},{\"end\":43461,\"start\":43458},{\"end\":43708,\"start\":43705},{\"end\":43718,\"start\":43715},{\"end\":43731,\"start\":43725},{\"end\":43745,\"start\":43741},{\"end\":43991,\"start\":43988},{\"end\":44001,\"start\":43998},{\"end\":44012,\"start\":44010},{\"end\":44240,\"start\":44237},{\"end\":44249,\"start\":44246},{\"end\":44260,\"start\":44257},{\"end\":44274,\"start\":44270},{\"end\":44526,\"start\":44523},{\"end\":44538,\"start\":44534},{\"end\":44550,\"start\":44547},{\"end\":44561,\"start\":44559},{\"end\":44571,\"start\":44568},{\"end\":44583,\"start\":44581},{\"end\":44595,\"start\":44592},{\"end\":44879,\"start\":44876},{\"end\":44890,\"start\":44887},{\"end\":44905,\"start\":44902},{\"end\":45110,\"start\":45104},{\"end\":45124,\"start\":45118},{\"end\":45139,\"start\":45132},{\"end\":45426,\"start\":45423},{\"end\":45439,\"start\":45435},{\"end\":45450,\"start\":45446},{\"end\":45462,\"start\":45457},{\"end\":45683,\"start\":45680},{\"end\":45691,\"start\":45688},{\"end\":45702,\"start\":45697},{\"end\":45714,\"start\":45710},{\"end\":46037,\"start\":46030},{\"end\":46051,\"start\":46044},{\"end\":46064,\"start\":46058},{\"end\":46081,\"start\":46072},{\"end\":46094,\"start\":46089},{\"end\":46109,\"start\":46104},{\"end\":46124,\"start\":46118},{\"end\":46142,\"start\":46132},{\"end\":46412,\"start\":46408},{\"end\":46425,\"start\":46421},{\"end\":46440,\"start\":46434},{\"end\":46453,\"start\":46448},{\"end\":46709,\"start\":46705},{\"end\":46721,\"start\":46717},{\"end\":46741,\"start\":46733},{\"end\":46754,\"start\":46750},{\"end\":46985,\"start\":46981},{\"end\":47000,\"start\":46995},{\"end\":47014,\"start\":47010},{\"end\":47026,\"start\":47022},{\"end\":47254,\"start\":47250},{\"end\":47267,\"start\":47264},{\"end\":47280,\"start\":47278},{\"end\":47294,\"start\":47291},{\"end\":47303,\"start\":47299},{\"end\":47580,\"start\":47576},{\"end\":47601,\"start\":47591},{\"end\":47614,\"start\":47609},{\"end\":47638,\"start\":47625},{\"end\":47939,\"start\":47935},{\"end\":47952,\"start\":47950},{\"end\":47962,\"start\":47958},{\"end\":47986,\"start\":47973},{\"end\":48252,\"start\":48249},{\"end\":48264,\"start\":48259},{\"end\":48280,\"start\":48275},{\"end\":48293,\"start\":48291},{\"end\":48541,\"start\":48539},{\"end\":48554,\"start\":48551},{\"end\":48570,\"start\":48567},{\"end\":48583,\"start\":48580},{\"end\":48848,\"start\":48846},{\"end\":48860,\"start\":48857},{\"end\":48869,\"start\":48866},{\"end\":48880,\"start\":48878},{\"end\":48894,\"start\":48892},{\"end\":48902,\"start\":48900},{\"end\":49183,\"start\":49181},{\"end\":49197,\"start\":49193},{\"end\":49213,\"start\":49205},{\"end\":49227,\"start\":49224},{\"end\":49237,\"start\":49234},{\"end\":49516,\"start\":49511},{\"end\":49528,\"start\":49525},{\"end\":49538,\"start\":49536},{\"end\":49548,\"start\":49544},{\"end\":49562,\"start\":49558},{\"end\":49574,\"start\":49570},{\"end\":49584,\"start\":49580},{\"end\":49597,\"start\":49594},{\"end\":49891,\"start\":49887},{\"end\":49904,\"start\":49901},{\"end\":49916,\"start\":49913},{\"end\":49927,\"start\":49925},{\"end\":49937,\"start\":49935},{\"end\":49952,\"start\":49946},{\"end\":49968,\"start\":49963},{\"end\":49983,\"start\":49979}]", "bib_entry": "[{\"attributes\":{\"id\":\"b0\",\"matched_paper_id\":14941970},\"end\":39205,\"start\":38887},{\"attributes\":{\"id\":\"b1\",\"matched_paper_id\":12592499},\"end\":39482,\"start\":39207},{\"attributes\":{\"id\":\"b2\",\"matched_paper_id\":4883741},\"end\":39808,\"start\":39484},{\"attributes\":{\"id\":\"b3\",\"matched_paper_id\":14873341},\"end\":40130,\"start\":39810},{\"attributes\":{\"id\":\"b4\",\"matched_paper_id\":214249112},\"end\":40422,\"start\":40132},{\"attributes\":{\"id\":\"b5\"},\"end\":40732,\"start\":40424},{\"attributes\":{\"id\":\"b6\",\"matched_paper_id\":220485058},\"end\":41014,\"start\":40734},{\"attributes\":{\"doi\":\"10.1145/3447548.3467337\",\"id\":\"b7\",\"matched_paper_id\":236980245},\"end\":41395,\"start\":41016},{\"attributes\":{\"id\":\"b8\",\"matched_paper_id\":211043589},\"end\":41729,\"start\":41397},{\"attributes\":{\"id\":\"b9\",\"matched_paper_id\":51606411},\"end\":41996,\"start\":41731},{\"attributes\":{\"id\":\"b10\",\"matched_paper_id\":235683193},\"end\":42334,\"start\":41998},{\"attributes\":{\"id\":\"b11\"},\"end\":42587,\"start\":42336},{\"attributes\":{\"id\":\"b12\",\"matched_paper_id\":222341740},\"end\":43048,\"start\":42589},{\"attributes\":{\"id\":\"b13\",\"matched_paper_id\":2949428},\"end\":43334,\"start\":43050},{\"attributes\":{\"id\":\"b14\",\"matched_paper_id\":10894889},\"end\":43614,\"start\":43336},{\"attributes\":{\"id\":\"b15\",\"matched_paper_id\":14139321},\"end\":43904,\"start\":43616},{\"attributes\":{\"id\":\"b16\",\"matched_paper_id\":12203396},\"end\":44148,\"start\":43906},{\"attributes\":{\"id\":\"b17\",\"matched_paper_id\":6121276},\"end\":44426,\"start\":44150},{\"attributes\":{\"id\":\"b18\",\"matched_paper_id\":51607933},\"end\":44792,\"start\":44428},{\"attributes\":{\"id\":\"b19\"},\"end\":45040,\"start\":44794},{\"attributes\":{\"id\":\"b20\",\"matched_paper_id\":1053146},\"end\":45270,\"start\":45042},{\"attributes\":{\"id\":\"b21\"},\"end\":45670,\"start\":45272},{\"attributes\":{\"id\":\"b22\"},\"end\":45994,\"start\":45672},{\"attributes\":{\"id\":\"b23\",\"matched_paper_id\":13756489},\"end\":46317,\"start\":45996},{\"attributes\":{\"id\":\"b24\",\"matched_paper_id\":51607087},\"end\":46617,\"start\":46319},{\"attributes\":{\"id\":\"b25\",\"matched_paper_id\":235306383},\"end\":46917,\"start\":46619},{\"attributes\":{\"id\":\"b26\",\"matched_paper_id\":15027084},\"end\":47161,\"start\":46919},{\"attributes\":{\"id\":\"b27\",\"matched_paper_id\":2768038},\"end\":47473,\"start\":47163},{\"attributes\":{\"id\":\"b28\",\"matched_paper_id\":220484601},\"end\":47833,\"start\":47475},{\"attributes\":{\"id\":\"b29\",\"matched_paper_id\":86810496},\"end\":48165,\"start\":47835},{\"attributes\":{\"id\":\"b30\",\"matched_paper_id\":12035768},\"end\":48447,\"start\":48167},{\"attributes\":{\"id\":\"b31\",\"matched_paper_id\":4237425},\"end\":48749,\"start\":48449},{\"attributes\":{\"id\":\"b32\",\"matched_paper_id\":215851198},\"end\":49079,\"start\":48751},{\"attributes\":{\"id\":\"b33\",\"matched_paper_id\":199466436},\"end\":49423,\"start\":49081},{\"attributes\":{\"id\":\"b34\",\"matched_paper_id\":9655225},\"end\":49797,\"start\":49425},{\"attributes\":{\"id\":\"b35\",\"matched_paper_id\":70270425},\"end\":50196,\"start\":49799}]", "bib_title": "[{\"end\":38944,\"start\":38887},{\"end\":39277,\"start\":39207},{\"end\":39555,\"start\":39484},{\"end\":39879,\"start\":39810},{\"end\":40217,\"start\":40132},{\"end\":40781,\"start\":40734},{\"end\":41095,\"start\":41016},{\"end\":41476,\"start\":41397},{\"end\":41827,\"start\":41731},{\"end\":42097,\"start\":41998},{\"end\":42419,\"start\":42336},{\"end\":42696,\"start\":42589},{\"end\":43120,\"start\":43050},{\"end\":43418,\"start\":43336},{\"end\":43699,\"start\":43616},{\"end\":43982,\"start\":43906},{\"end\":44230,\"start\":44150},{\"end\":44516,\"start\":44428},{\"end\":45095,\"start\":45042},{\"end\":45418,\"start\":45272},{\"end\":46021,\"start\":45996},{\"end\":46402,\"start\":46319},{\"end\":46698,\"start\":46619},{\"end\":46974,\"start\":46919},{\"end\":47241,\"start\":47163},{\"end\":47567,\"start\":47475},{\"end\":47926,\"start\":47835},{\"end\":48244,\"start\":48167},{\"end\":48533,\"start\":48449},{\"end\":48836,\"start\":48751},{\"end\":49172,\"start\":49081},{\"end\":49504,\"start\":49425},{\"end\":49876,\"start\":49799}]", "bib_author": "[{\"end\":38962,\"start\":38946},{\"end\":38979,\"start\":38962},{\"end\":39001,\"start\":38979},{\"end\":39015,\"start\":39001},{\"end\":39033,\"start\":39015},{\"end\":39291,\"start\":39279},{\"end\":39304,\"start\":39291},{\"end\":39319,\"start\":39304},{\"end\":39331,\"start\":39319},{\"end\":39567,\"start\":39557},{\"end\":39576,\"start\":39567},{\"end\":39588,\"start\":39576},{\"end\":39600,\"start\":39588},{\"end\":39614,\"start\":39600},{\"end\":39623,\"start\":39614},{\"end\":39635,\"start\":39623},{\"end\":39896,\"start\":39881},{\"end\":39906,\"start\":39896},{\"end\":39919,\"start\":39906},{\"end\":39929,\"start\":39919},{\"end\":39945,\"start\":39929},{\"end\":39956,\"start\":39945},{\"end\":40229,\"start\":40219},{\"end\":40238,\"start\":40229},{\"end\":40249,\"start\":40238},{\"end\":40265,\"start\":40249},{\"end\":40438,\"start\":40426},{\"end\":40453,\"start\":40438},{\"end\":40464,\"start\":40453},{\"end\":40477,\"start\":40464},{\"end\":40487,\"start\":40477},{\"end\":40498,\"start\":40487},{\"end\":40507,\"start\":40498},{\"end\":40793,\"start\":40783},{\"end\":40807,\"start\":40793},{\"end\":40817,\"start\":40807},{\"end\":40830,\"start\":40817},{\"end\":40839,\"start\":40830},{\"end\":40849,\"start\":40839},{\"end\":40861,\"start\":40849},{\"end\":41107,\"start\":41097},{\"end\":41117,\"start\":41107},{\"end\":41125,\"start\":41117},{\"end\":41137,\"start\":41125},{\"end\":41155,\"start\":41137},{\"end\":41491,\"start\":41478},{\"end\":41502,\"start\":41491},{\"end\":41514,\"start\":41502},{\"end\":41522,\"start\":41514},{\"end\":41539,\"start\":41522},{\"end\":41550,\"start\":41539},{\"end\":41843,\"start\":41829},{\"end\":41851,\"start\":41843},{\"end\":42108,\"start\":42099},{\"end\":42119,\"start\":42108},{\"end\":42130,\"start\":42119},{\"end\":42143,\"start\":42130},{\"end\":42153,\"start\":42143},{\"end\":42432,\"start\":42421},{\"end\":42443,\"start\":42432},{\"end\":42452,\"start\":42443},{\"end\":42712,\"start\":42698},{\"end\":42724,\"start\":42712},{\"end\":42738,\"start\":42724},{\"end\":42750,\"start\":42738},{\"end\":42766,\"start\":42750},{\"end\":42780,\"start\":42766},{\"end\":42804,\"start\":42780},{\"end\":43134,\"start\":43122},{\"end\":43147,\"start\":43134},{\"end\":43160,\"start\":43147},{\"end\":43170,\"start\":43160},{\"end\":43180,\"start\":43170},{\"end\":43431,\"start\":43420},{\"end\":43439,\"start\":43431},{\"end\":43451,\"start\":43439},{\"end\":43463,\"start\":43451},{\"end\":43710,\"start\":43701},{\"end\":43720,\"start\":43710},{\"end\":43733,\"start\":43720},{\"end\":43747,\"start\":43733},{\"end\":43993,\"start\":43984},{\"end\":44003,\"start\":43993},{\"end\":44014,\"start\":44003},{\"end\":44242,\"start\":44232},{\"end\":44251,\"start\":44242},{\"end\":44262,\"start\":44251},{\"end\":44276,\"start\":44262},{\"end\":44528,\"start\":44518},{\"end\":44540,\"start\":44528},{\"end\":44552,\"start\":44540},{\"end\":44563,\"start\":44552},{\"end\":44573,\"start\":44563},{\"end\":44585,\"start\":44573},{\"end\":44597,\"start\":44585},{\"end\":44881,\"start\":44868},{\"end\":44892,\"start\":44881},{\"end\":44907,\"start\":44892},{\"end\":45112,\"start\":45097},{\"end\":45126,\"start\":45112},{\"end\":45141,\"start\":45126},{\"end\":45428,\"start\":45420},{\"end\":45441,\"start\":45428},{\"end\":45452,\"start\":45441},{\"end\":45464,\"start\":45452},{\"end\":45685,\"start\":45672},{\"end\":45693,\"start\":45685},{\"end\":45704,\"start\":45693},{\"end\":45716,\"start\":45704},{\"end\":46039,\"start\":46023},{\"end\":46053,\"start\":46039},{\"end\":46066,\"start\":46053},{\"end\":46083,\"start\":46066},{\"end\":46096,\"start\":46083},{\"end\":46111,\"start\":46096},{\"end\":46126,\"start\":46111},{\"end\":46144,\"start\":46126},{\"end\":46414,\"start\":46404},{\"end\":46427,\"start\":46414},{\"end\":46442,\"start\":46427},{\"end\":46455,\"start\":46442},{\"end\":46711,\"start\":46700},{\"end\":46723,\"start\":46711},{\"end\":46743,\"start\":46723},{\"end\":46756,\"start\":46743},{\"end\":46987,\"start\":46976},{\"end\":47002,\"start\":46987},{\"end\":47016,\"start\":47002},{\"end\":47028,\"start\":47016},{\"end\":47256,\"start\":47243},{\"end\":47269,\"start\":47256},{\"end\":47282,\"start\":47269},{\"end\":47296,\"start\":47282},{\"end\":47305,\"start\":47296},{\"end\":47582,\"start\":47569},{\"end\":47603,\"start\":47582},{\"end\":47616,\"start\":47603},{\"end\":47640,\"start\":47616},{\"end\":47941,\"start\":47928},{\"end\":47954,\"start\":47941},{\"end\":47964,\"start\":47954},{\"end\":47988,\"start\":47964},{\"end\":48254,\"start\":48246},{\"end\":48266,\"start\":48254},{\"end\":48282,\"start\":48266},{\"end\":48295,\"start\":48282},{\"end\":48543,\"start\":48535},{\"end\":48556,\"start\":48543},{\"end\":48572,\"start\":48556},{\"end\":48585,\"start\":48572},{\"end\":48850,\"start\":48838},{\"end\":48862,\"start\":48850},{\"end\":48871,\"start\":48862},{\"end\":48882,\"start\":48871},{\"end\":48896,\"start\":48882},{\"end\":48904,\"start\":48896},{\"end\":49185,\"start\":49174},{\"end\":49199,\"start\":49185},{\"end\":49215,\"start\":49199},{\"end\":49229,\"start\":49215},{\"end\":49239,\"start\":49229},{\"end\":49518,\"start\":49506},{\"end\":49530,\"start\":49518},{\"end\":49540,\"start\":49530},{\"end\":49550,\"start\":49540},{\"end\":49564,\"start\":49550},{\"end\":49576,\"start\":49564},{\"end\":49586,\"start\":49576},{\"end\":49599,\"start\":49586},{\"end\":49893,\"start\":49878},{\"end\":49906,\"start\":49893},{\"end\":49918,\"start\":49906},{\"end\":49929,\"start\":49918},{\"end\":49939,\"start\":49929},{\"end\":49954,\"start\":49939},{\"end\":49970,\"start\":49954},{\"end\":49985,\"start\":49970}]", "bib_venue": "[{\"end\":39037,\"start\":39033},{\"end\":39336,\"start\":39331},{\"end\":39638,\"start\":39635},{\"end\":39961,\"start\":39956},{\"end\":40269,\"start\":40265},{\"end\":40572,\"start\":40507},{\"end\":40866,\"start\":40861},{\"end\":41188,\"start\":41178},{\"end\":41555,\"start\":41550},{\"end\":41856,\"start\":41851},{\"end\":42158,\"start\":42153},{\"end\":42458,\"start\":42452},{\"end\":42808,\"start\":42804},{\"end\":43184,\"start\":43180},{\"end\":43467,\"start\":43463},{\"end\":43751,\"start\":43747},{\"end\":44019,\"start\":44014},{\"end\":44280,\"start\":44276},{\"end\":44602,\"start\":44597},{\"end\":44866,\"start\":44794},{\"end\":45148,\"start\":45141},{\"end\":45468,\"start\":45464},{\"end\":45825,\"start\":45716},{\"end\":46148,\"start\":46144},{\"end\":46460,\"start\":46455},{\"end\":46760,\"start\":46756},{\"end\":47032,\"start\":47028},{\"end\":47309,\"start\":47305},{\"end\":47645,\"start\":47640},{\"end\":47991,\"start\":47988},{\"end\":48299,\"start\":48295},{\"end\":48590,\"start\":48585},{\"end\":48907,\"start\":48904},{\"end\":49244,\"start\":49239},{\"end\":49603,\"start\":49599},{\"end\":49989,\"start\":49985}]"}}}, "year": 2023, "month": 12, "day": 17}