{"id": 251923231, "updated": "2023-10-06 12:14:36.306", "metadata": {"title": "Augmented Hill-Climb increases reinforcement learning efficiency for language-based de novo molecule generation", "authors": "[{\"first\":\"Morgan\",\"last\":\"Thomas\",\"middle\":[]},{\"first\":\"Noel\",\"last\":\"O’Boyle\",\"middle\":[\"M.\"]},{\"first\":\"Andreas\",\"last\":\"Bender\",\"middle\":[]},{\"first\":\"Chris\",\"last\":\"de Graaf\",\"middle\":[]}]", "venue": "Journal of Cheminformatics", "journal": "Journal of Cheminformatics", "publication_date": {"year": 2022, "month": 10, "day": 3}, "abstract": "A plethora of AI-based techniques now exists to conduct de novo molecule generation that can devise molecules conditioned towards a particular endpoint in the context of drug design. One popular approach is using reinforcement learning to update a recurrent neural network or language-based de novo molecule generator. However, reinforcement learning can be inefficient, sometimes requiring up to 105 molecules to be sampled to optimize more complex objectives, which poses a limitation when using computationally expensive scoring functions like docking or computer-aided synthesis planning models. In this work, we propose a reinforcement learning strategy called Augmented Hill-Climb based on a simple, hypothesis-driven hybrid between REINVENT and Hill-Climb that improves sample-efficiency by addressing the limitations of both currently used strategies. We compare its ability to optimize several docking tasks with REINVENT and benchmark this strategy against other commonly used reinforcement learning strategies including REINFORCE, REINVENT (version 1 and 2), Hill-Climb and best agent reminder. We find that optimization ability is improved ~ 1.5-fold and sample-efficiency is improved ~ 45-fold compared to REINVENT while still delivering appealing chemistry as output. Diversity filters were used, and their parameters were tuned to overcome observed failure modes that take advantage of certain diversity filter configurations. We find that Augmented Hill-Climb outperforms the other reinforcement learning strategies used on six tasks, especially in the early stages of training or for more difficult objectives. Lastly, we show improved performance not only on recurrent neural networks but also on a reinforcement learning stabilized transformer architecture. Overall, we show that Augmented Hill-Climb improves sample-efficiency for language-based de novo molecule generation conditioning via reinforcement learning, compared to the current state-of-the-art. This makes more computationally expensive scoring functions, such as docking, more accessible on a relevant timescale. Supplementary Information The online version contains supplementary material available at 10.1186/s13321-022-00646-z.", "fields_of_study": "[\"Medicine\"]", "external_ids": {"arxiv": null, "mag": null, "acl": null, "pubmed": "36192789", "pubmedcentral": "9531503", "dblp": "journals/jcheminf/ThomasOBG22", "doi": "10.1186/s13321-022-00646-z"}}, "content": {"source": {"pdf_hash": "c2ad68226d4fcd96a64bdbca15bb555671e7974f", "pdf_src": "PubMedCentral", "pdf_uri": null, "oa_url_match": false, "oa_info": {"license": "CCBY", "open_access_url": null, "status": null}}, "grobid": {"id": "9ba45dc3fa15e29a0312bf1d22eb9a46bd2a5b58", "type": "plain-text", "url": "s3://ai2-s2-pdf-extraction-prod/parse-results/s2orc_worker/c2ad68226d4fcd96a64bdbca15bb555671e7974f.txt", "contents": "\nSupporting Information for Augmented Hill-Climb increases reinforcement learning efficiency for language-based de novo molecule generation\n\n\nMorgan Thomas \nCentre for Molecular Informatics\nDepartment of Chemistry\nUniversity of Cambridge\nCB2 1EWCambridgeUK\n\nNoel M O&apos;boyle \nComputational Chemistry\nSosei Heptares\nSteinmetz Building, Great AbingtonCB21 6DGGranta Park, CambridgeUK\n\nAndreas Bender \nCentre for Molecular Informatics\nDepartment of Chemistry\nUniversity of Cambridge\nCB2 1EWCambridgeUK\n\nChris De Graaf chris.degraaf@soseiheptares.com \nComputational Chemistry\nSosei Heptares\nSteinmetz Building, Great AbingtonCB21 6DGGranta Park, CambridgeUK\n\nSupporting Information for Augmented Hill-Climb increases reinforcement learning efficiency for language-based de novo molecule generation\n1\n\n Table S1\n: Intrinsic metrics of 10,000 sampled de novo molecules from the recurrent neural network (RNN), Transformer (Tr) and Gated Transformer (GTr) used in this work when trained on the GuacaMol training dataset. These metrics include the ratio of valid, unique, scaffold unique and novel molecules, as well as sphere exclusion diverse (ECFP4 of length 1,204 with sphere radius equal to Tanimoto distance of 0.65), functional group diverse (FG) and ring system diverse (RS). Lastly, the ratio of molecules passing MOSES filters.\n\n\nModel\n\nValid  Table S2: Extrinsic metrics of 10,000 sampled de novo molecules from the recurrent neural network (RNN), Transformer (Tr) and Gated Transformer (GTr) used in this work when trained on the GuacaMol training dataset. These metrics measure the similarity of de novo molecules to the GuacaMol test dataset. Including the analogue similarity (ratio of de novo molecules that have test set analogues), analogue coverage (ratio of test set with de novo analogues), average single nearest neighbour similarity (SNN), cosine similarity of functional groups (FG) and ring systems (RS), fragments (Frag) and scaffolds (Scaff), and Wasserstein distance of LogP, natural product likeness (NP), synthetic accessibility (SA), quantitative estimate of drug-likeness (QED) and molecular weight distributions. Note that fingerprints similarities are based on ECFP4 fingerprints of length 1,024 and analogues are defined as having a Tanimoto similarity greater than 0.4.\n(↑) Unique (↑) Novel (↑) SEDiv@1k (↑) Scaffold Unique (↑) FG (↑) RS(\n\nModel\n\n\nAnalogue\n\nSimilarity    Figure S1: Retrospective classification performance of docking protocol on the four targets investigated in this work. In each case, the accuracy, precision and recall are traced with varying docking score decision thresholds. Thresholds corresponding to ~ 80% precision are annotated by black dashed lines.        Figure S11: Uniqueness for objective optimization using different RL strategies. HC* suffers from a drop in uniqueness. Figure S12: Centroid of the top 5 largest clusters for the top 100 molecules in the heavy atom task for different RL strategies. Cluster size (CS), centroid score (S) and the average cluster score (AvS) is annotated below. Figure S13: Centroid of the top 5 largest clusters for the top 100 molecules in the Risperidone similarity task for different RL strategies. Cluster size (CS), centroid score (S) and the average cluster score (AvS) is annotated below. Figure S14: Centroid of the top 5 largest clusters for the top 100 molecules in the DRD2 activity task for different RL strategies. Cluster size (CS), centroid score (S) and the average cluster score (AvS) is annotated below. Figure S15: Centroid of the top 5 largest clusters for the top 100 molecules in the DRD2 docking score task for different RL strategies. Cluster size (CS), centroid score (S) and the average cluster score (AvS) is annotated below. Figure S16: Centroid of the top 5 largest clusters for the top 100 molecules in the DRD2-DRD3 QSAR dual predicted probability of activity task for different RL strategies. Cluster size (CS), centroid score (S) and the average cluster score (AvS) is annotated below. Note where AHC generates cationic species due to imperfections in the neutralization of training data resulting in charge symbols in the RNN vocabulary. Figure S17: Centroid of the top 5 largest clusters for the top 100 molecules in the DRD2/DRD3 QSAR predicted probability of selective activity task for different RL strategies. Cluster size (CS), centroid score (S) and the average cluster score (AvS) is annotated below. Figure S18: Validity for objective optimization using REINVENT and Augmented Hill-Climb with a transformer or gated transformer model. Figure S19: Uniqueness for objective optimization using REINVENT and Augmented Hill-Climb with a transformer or gated transformer model. Transformer model is more prone to undergoing a drop in uniqueness. Figure S20: Centroid of the top 5 largest clusters for the top 100 molecules in the heavy atom task for transformer models. Cluster size (CS), centroid score (S) and the average cluster score (AvS) is annotated below. Figure S21: Centroid of the top 5 largest clusters for the top 100 molecules in the Risperidone similarity task for transformer models. Cluster size (CS), centroid score (S) and the average cluster score (AvS) is annotated below. Figure S22: Centroid of the top 5 largest clusters for the top 100 molecules in the DRD2 activity task for transformer models. Cluster size (CS), centroid score (S) and the average cluster score (AvS) is annotated below. Figure S23: Centroid of the top 5 largest clusters for the top 100 molecules in the DRD2 docking score task for transformer models. Cluster size (CS), centroid score (S) and the average cluster score (AvS) is annotated below. Figure S24: Centroid of the top 5 largest clusters for the top 100 molecules in the DRD2-DRD3 QSAR dual predicted probability of activity task for transformer models. Cluster size (CS), centroid score (S) and the average cluster score (AvS) is annotated below. Figure S25: Centroid of the top 5 largest clusters for the top 100 molecules in the DRD2/DRD3 QSAR predicted probability of selective activity task for different transformer models. Cluster size (CS), centroid score (S) and the average cluster score (AvS) is annotated below.\n(↑) Analogue Coverage (↑) SNN (↑) FG (↑) RS (↑) Frag (↑) Scaff (↑) logP (↓) NP (↓) SA (↓) QED (↓) Weight(\n\nSupplementary Figures\n\nFigure S2 :Figure S3 :\nS2S3QSAR model performance of RF models trained on DRD2 and DRD3 active and inactive molecules, based on 5-fold stratified, clustered cross-validation with GHOST [85] decision threshold identification. Centroid of the top 5 largest clusters for the top 100 molecules generated by REINVENT and Augmented Hill-Climb (both with DF1) according to docking score against DRD2 receptor for varying values of sigma (σ). Cluster size (CS), centroid docking score (DS) and the average cluster docking score (AvDS) is annotated below.\n\nFigure S4 :\nS4Optimization of Aripiprazole similarity task with different diversity filters and their parameters. Three endpoints are measured: (a) unique area under the curve (AUC), (b) goal AUC (c) and run time.\n\nFigure S5 :\nS5Optimization of C11H24 isomers task with different diversity filters and their parameters. Three endpoints are measured: (a) unique area under the curve (AUC), (b) goal AUC (c) and run time. Note: scaffold-based diversity filters aren't shown as C11H24 isomers cannot form rings and satisfy the molecular formula and so no scaffolds will be detected.\n\nFigure S6 :\nS6Optimization of Osimertinib MPO task with different diversity filters and their parameters. Three endpoints are measured: (a) unique area under the curve (AUC), (b) goal AUC (c) and run time.\n\nFigure S7 :\nS7Docked poses of the centroid molecules (cyan) shown inFigure 5generated by AHC + DF2 compared to the co-crystallized ligand (green) for each respective target. For (a) DRD2 and (b) OPRM1, RL and docking results in sensible pose generation satisfying crucial residue interactions with D114 3x32 . While for (c) AGTR1 poses occupy only one relevant sub-pocket compared to the cocrystal ligand and form no interactions with R167 4x65 . Only one pose for (d) OX1R mimics the horseshoe shape adopted by the co-crystal ligand, however, most form an interaction with N318 6x55 .\n\nFigure S8 :\nS8Per-molecule optimization for objective optimization using different RL strategies. In all cases, except the number of heavy atoms, AHC outperforms all other RL strategies with respect to objective optimization while maintaining validity and uniqueness. Only valid molecules are plotted, therefore gaps seen with HC* denote regions where no valid molecules were generated.\n\nFigure S9 :\nS9Wall time for objective optimization using different RL strategies. Run using an AMD Threadripper 1920x CPU and Nvidia GeForce RTX 2060 super GPU. The docking tasks were parallelized over 10 CPU cores while all other tasks used only 1 CPU core.\n\nFigure S10 :\nS10Validity for objective optimization using different RL strategies. HC* suffers from a drop in validity.\n\nTable S3 :\nS3Default hyperparameters used for reinforcement learning strategies benchmarked in this work. Additional configurations with regularization and disclosed in square brackets.RL strategy \nTraining steps Batch size \nREINFORCE [+reg] \n500 \n64 \n-\n-\n[10] \n1×10 -4 \n-\nREINVENT \n500 \n64 \n60 \n-\n-\n5×10 -4 \n-\nREINVENT 2.0 \n250 \n128 \n120 \n-\n-\n5×10 -4 \n-\nBAR \n500 \n64 \n60 \n-\n-\n5×10 -4 \n0.5 \nAugmented Hill-Climb \n500 \n64 \n60 \n50% \n-\n5×10 -4 \n-\nHill-Climb [+reg] \n32 \n1024 \n-\n50% \n[10] \n5×10 -4 \n-\nHill-Climb* [+reg] \n500 \n64 \n-\n50% \n[10] \n5×10 -4 \n-\n\n\nTable S4 :\nS4Diversity filter configurations used in this work.DF1 \nDF2 \nDF3 \nTopology simplification \nBM scaffold \nBM scaffold \nBM scaffold \nFingerprint type \nECFP (Morgan) \nECFP (Morgan) \nECFP (Morgan) \nFingerprint radius \n2 \n2 \n2 \nFingerprint bits \n1024 \n1024 \n1024 \nSimilarity metric \nTanimoto \nTanimoto \nTanimoto \nMinimum score threshold \n0.8 \n0.5 \n0.0 \nBin size \n25 \n50 \n50 \nOutput mode \nBinary \nLinear \nLinear \n\nTable S5: Number of molecules downloaded from ExCAPE-DB and those docked against targets \nused in this work to assess retrospective performance. \n\nExCAPE-DB \nDocked \nActive \nInactive \nActive \nInactive \nDRD2 \n4613 \n343076 \n3734 \n9538 \nOPRM1 \n3128 \n2786 \n3125 \n2573 \nAGTR1 \n671 \n558 \n270 \n516 \nOX1R \n681 \n322795 \n564 \n9860 \n\n", "annotations": {"author": "[{\"end\":257,\"start\":142},{\"end\":385,\"start\":258},{\"end\":502,\"start\":386},{\"end\":657,\"start\":503}]", "publisher": null, "author_last_name": "[{\"end\":155,\"start\":149},{\"end\":277,\"start\":265},{\"end\":400,\"start\":394},{\"end\":517,\"start\":509}]", "author_first_name": "[{\"end\":148,\"start\":142},{\"end\":262,\"start\":258},{\"end\":264,\"start\":263},{\"end\":393,\"start\":386},{\"end\":508,\"start\":503}]", "author_affiliation": "[{\"end\":256,\"start\":157},{\"end\":384,\"start\":279},{\"end\":501,\"start\":402},{\"end\":656,\"start\":551}]", "title": "[{\"end\":139,\"start\":1},{\"end\":796,\"start\":658}]", "venue": null, "abstract": null, "bib_ref": null, "figure": "[{\"attributes\":{\"id\":\"fig_0\"},\"end\":6891,\"start\":6344},{\"attributes\":{\"id\":\"fig_1\"},\"end\":7106,\"start\":6892},{\"attributes\":{\"id\":\"fig_2\"},\"end\":7472,\"start\":7107},{\"attributes\":{\"id\":\"fig_3\"},\"end\":7679,\"start\":7473},{\"attributes\":{\"id\":\"fig_4\"},\"end\":8266,\"start\":7680},{\"attributes\":{\"id\":\"fig_5\"},\"end\":8654,\"start\":8267},{\"attributes\":{\"id\":\"fig_6\"},\"end\":8914,\"start\":8655},{\"attributes\":{\"id\":\"fig_7\"},\"end\":9035,\"start\":8915},{\"attributes\":{\"id\":\"tab_2\",\"type\":\"table\"},\"end\":9587,\"start\":9036},{\"attributes\":{\"id\":\"tab_3\",\"type\":\"table\"},\"end\":10330,\"start\":9588}]", "paragraph": "[{\"end\":1332,\"start\":810},{\"end\":2300,\"start\":1342},{\"end\":6214,\"start\":2389}]", "formula": "[{\"attributes\":{\"id\":\"formula_0\"},\"end\":2369,\"start\":2301},{\"attributes\":{\"id\":\"formula_1\"},\"end\":6320,\"start\":6215}]", "table_ref": "[{\"end\":809,\"start\":801},{\"end\":1357,\"start\":1349}]", "section_header": "[{\"end\":1340,\"start\":1335},{\"end\":2376,\"start\":2371},{\"end\":2387,\"start\":2379},{\"end\":6343,\"start\":6322},{\"end\":6367,\"start\":6345},{\"end\":6904,\"start\":6893},{\"end\":7119,\"start\":7108},{\"end\":7485,\"start\":7474},{\"end\":7692,\"start\":7681},{\"end\":8279,\"start\":8268},{\"end\":8667,\"start\":8656},{\"end\":8928,\"start\":8916},{\"end\":9047,\"start\":9037},{\"end\":9599,\"start\":9589}]", "table": "[{\"end\":9587,\"start\":9222},{\"end\":10330,\"start\":9652}]", "figure_caption": "[{\"end\":6891,\"start\":6372},{\"end\":7106,\"start\":6907},{\"end\":7472,\"start\":7122},{\"end\":7679,\"start\":7488},{\"end\":8266,\"start\":7695},{\"end\":8654,\"start\":8282},{\"end\":8914,\"start\":8670},{\"end\":9035,\"start\":8932},{\"end\":9222,\"start\":9050},{\"end\":9652,\"start\":9602}]", "figure_ref": "[{\"end\":2412,\"start\":2403},{\"end\":2848,\"start\":2838},{\"end\":3071,\"start\":3061},{\"end\":3306,\"start\":3296},{\"end\":3532,\"start\":3522},{\"end\":3763,\"start\":3753},{\"end\":4182,\"start\":4172},{\"end\":4453,\"start\":4443},{\"end\":4588,\"start\":4578},{\"end\":4793,\"start\":4783},{\"end\":5011,\"start\":5001},{\"end\":5241,\"start\":5231},{\"end\":5462,\"start\":5452},{\"end\":5688,\"start\":5678},{\"end\":5949,\"start\":5939}]", "bib_author_first_name": null, "bib_author_last_name": null, "bib_entry": null, "bib_title": null, "bib_author": null, "bib_venue": null}}}, "year": 2023, "month": 12, "day": 17}