{"id": 252216573, "updated": "2022-09-27 13:22:29.42", "metadata": {"title": "Learning to Ride a Buy-Cycle: A Hyper-Convolutional Model for Next Basket Repurchase Recommendation", "authors": "[{\"first\":\"Ori\",\"last\":\"Katz\",\"middle\":[]},{\"first\":\"Oren\",\"last\":\"Barkan\",\"middle\":[]},{\"first\":\"Noam\",\"last\":\"Koenigstein\",\"middle\":[]},{\"first\":\"Nir\",\"last\":\"Zabari\",\"middle\":[]}]", "venue": null, "journal": "Proceedings of the 16th ACM Conference on Recommender Systems", "publication_date": {"year": 2022, "month": null, "day": null}, "abstract": "The problem of Next Basket Recommendation (NBR) addresses the challenge of recommending items for the next basket of a user, based on her sequence of prior baskets. In this paper, we focus on a variation of this problem in which we aim to predict repurchases, i.e. we wish to recommend a user only items she had purchased before. We coin this problem Next Basket Repurchase Recommendation (NBRR). Over the years, a variety of models have been proposed to address the problem of NBR, however, the problem of NBRR has been overlooked. Although being highly related problems, which are often solved by the same methods, the problem of repurchase recommendation calls for a different approach. In this paper, we share insights from our experience of facing the challenge of NBRR. In light of these insights, we propose a novel hyper-convolutional model to leverage the behavioral patterns of repeated purchases. We demonstrate the effectiveness of the proposed model on three publicly available datasets, where it is shown to outperform other existing methods across multiple metrics.", "fields_of_study": "[\"Computer Science\"]", "external_ids": {"arxiv": null, "mag": null, "acl": null, "pubmed": null, "pubmedcentral": null, "dblp": "conf/recsys/KatzBKZ22", "doi": "10.1145/3523227.3546763"}}, "content": {"source": {"pdf_hash": "9137eeb7664ee75e2fcbc26fb5d7e9f67169f2a6", "pdf_src": "ACM", "pdf_uri": null, "oa_url_match": false, "oa_info": null}, "grobid": {"id": "8d26f0206872f723bc299025c1627d3686a9de38", "type": "plain-text", "url": "s3://ai2-s2-pdf-extraction-prod/parse-results/s2orc_worker/9137eeb7664ee75e2fcbc26fb5d7e9f67169f2a6.txt", "contents": "\nLearning to Ride a Buy-Cycle: A Hyper-Convolutional Model for Next Basket Repurchase Recommendation\nSeptember 18-23, 2022\n\nOri Katz \nMicrosoft Technion\nIsrael\n\nOren Barkan \nThe Open University Microsoft\nIsrael\n\nNir Zabari \nMicrosoft The Hebrew University\nIsrael\n\nNoam Koenigstein \nMicrosoft Tel-Aviv University\nIsrael\n\nLearning to Ride a Buy-Cycle: A Hyper-Convolutional Model for Next Basket Repurchase Recommendation\nSeattle, WA, USA22September 18-23, 202210.1145/3523227.3546763ACM Reference Format: Ori Katz, Oren Barkan, Nir Zabari, and Noam Koenigstein. 2022. Learning to Ride a Buy-Cycle: A Hyper-Convolutional Model for Next Basket Re-purchase Recommendation. In Sixteenth ACM Conference on Recommender Systems (RecSys '22), September 18-23, 2022, Seattle, WA, USA. ACM, New York, NY, USA, 11 pages. https:// ACM ISBN 978-1-4503-9278-5/22/09. . . $15.00CCS CONCEPTS • Information systems → Recommender systemsPersonaliza- tionDecision support systems• Computing methodologies → Machine learning KEYWORDS Recommender Systems, Collaborative Filtering, Next Basket Rec- ommendation\nThe problem of Next Basket Recommendation (NBR) addresses the challenge of recommending items for the next basket of a user, based on her sequence of prior baskets. In this paper, we focus on a variation of this problem in which we aim to predict repurchases, i.e. we wish to recommend a user only items she had purchased before. We coin this problem Next Basket Repurchase Recommendation (NBRR). Over the years, a variety of models have been proposed to address the problem of NBR, however, the problem of NBRR has been overlooked. Although being highly related problems, which are often solved by the same methods, the problem of repurchase recommendation calls for a different approach. In this paper, we share insights from our experience of facing the challenge of NBRR. In light of these insights, we propose a novel hyper-convolutional model to leverage the behavioral patterns of repeated purchases. We demonstrate the effectiveness of the proposed model on three publicly available datasets, where it is shown to outperform other existing methods across multiple metrics.\n\nINTRODUCTION\n\nThe Next Basket Recommendation (NBR) problem is an active research field that deals with recommending items for users' next baskets based on sequences of their prior baskets [3,25,28,33]. However, it has been shown that the majority of the baskets are composed of previously consumed items i.e., repurchased items [25]. The problem of recommending new items is at the core of countless recommendation algorithms, but it is inherently different from the problem of recommending repurchases. Moreover, a recent survey of state-of-the-art (SOTA) NBR solutions by [25] showed that most NBR algorithms, even when capable of recommending new items, rarely do so and instead produce recommendations that exclusively consist of repurchased items. Hence, in this work, we wish to investigate the problem of Next Basket Repurchase Recommendation (NBRR). Namely, the problem of recommending previously purchased items.\n\nImportantly, both NBR and NBRR are different from next-item recommendation e.g., [30,31], in which the model is required to recommend additional items to an existing basket. In NBR and NBRR an empty basket is assumed at the time of recommendations, hence the recommendations are generated based on historical baskets only. Specifically, the NBRR problem is relevant in various recommendation scenarios: For example, recommending coupons that anticipate users' needs and reminders for potentially forgotten items [23]. As such, NBRR is especially relevant for grocery retailers (both online and brick and mortar), where users repeatedly repurchase items they have purchased in the past.\n\nThe NBRR problem may initially appear as an easy task. However, different users exhibit different repurchase cycles for different items. For example, a user who is single probably has a longer buycycle for toilet paper than a parent who buys for the entire family. However, both have shorter buy-cycles for bananas due to their short expiry date. In the former case, the buy-cycle is determined by the consumption rate of different users, whereas in the latter example, it is determined by the item's durability. Unfortunately, both users' metadata as well as items' durability are often unknown to the recommender system, and in any case, they are not the sole factors that determine repurchase cycles. Hence, the main difficulty in NBRR stems from the need to estimate different repurchase cycles for every combination of user and item based on historical purchases only.\n\nWe investigate the NBRR problem and explore key patterns in users' repurchase cycles. Based on these insights, we developed an algorithm for repurchases recommendations. Our solution employs a novel hypernetwork model that predicts the repurchase probability for every user and previously purchased item, hence facilitates personalization.\n\nThe remainder of this paper is organized as follows: In Section 2, we provide an analysis of several user behavioral patterns that characterize the NBRR problem: (1) \"loyalty\", (2) quasi-stationarity, (3) buy-cycles, and (4) item correlations. Then, in Section 3, we highlight important methods for NBR and relate them to the NBRR problem. In Section 4, we provide notations and use them to formulate the NBRR problem. In Section 5 we provide two motivating examples for the development of our model: (1) the importance of considering explicit timestamps, and (2) the importance of modeling buy-cycles. Then, in Section 6, we describe our proposed model based on a novel hypernetwork architecture. Finally, in Section 7 we describe an extensive evaluation study of our proposed approach and compare it to SOTA alternative models.\n\n\nANALYZING REPURCHASE BEHAVIORAL PATTERNS\n\nIn this section, we present important behavioral patterns of repurchases. These patterns will be demonstrated via case-studies taken from a real-world dataset provided by Instacart [16], however these behavioral patterns are relevant in many other cases where repeating customers purchase items repeatedly e.g., grocery stores.\n\n\nRepetitiveness and Loyalty\n\nPerhaps the most notable behavioral pattern of repurchases is the tendency of users to exhibit \"loyalty\" towards certain products, i.e., users prefer to repeatedly purchase the same items rather than switch to another brand or an alternative. Of course, switching products do occur occasionally, but \"loyalty\" refers to the much more dominant trend to repeat a previous purchase. Specifically, in online groceries \"loyalty\" is even more prevalent [7,14,23,34]. The term \"loyalty\" was first coined by [29], however this behavioral pattern was well known for a long time as pointed in earlier literature [1,24]. \"Loyalty\" dictates the design of many modern models for next basket recommendations (NBR) [10,15,29] which may explain their tendency to produce recommendations based on previously purchased items exclusively [25]. As pointed by [25], such a behavior makes popularity-per-user, i.e., a user-wise product purchase frequency, a descent competitor for many SOTA algorithms. For more details the reader is referred to Table 2 in [25]. However, despite the importance of \"loyalty\", non-stationary effects make this naive, yet highly effective baseline, prone to failures. This leads us to the next pattern -quasi-stationarity of users' preferences.\n\n\nQuasi-Stationarity of Users' Preferences\n\nAs pointed in [10], seasonality and drifts in users' preferences are common phenomena. These phenomena can be originated by an item (for example -the item's availability), the user (for example -a dietary change or a need to cut expenses), or some common confounder (for example -an upcoming holiday or sport event). A classic example for an item related quasi-stationarity is the seasonality of some fresh produce e.g., vegetables, that affects the item's demand and popularity at the peak of the season and suppresses demand and availability when off-season. In Figure 1, we present the overall consumption of 4 items from the Instacart catalog during a period of 100 days. Evidently, some items exhibit increasingly high demand during specific time periods, while others exhibit relatively constant demand throughout.\n\nIn order to demonstrate a user related temporal phenomenon, we pick a user from the Instacart dataset that consumed two types of almond milk and present her purchases w.r.t to both products. These purchases are shown in Figure 2 (d). As can be seen, for some reason the user changed her preference around week 10 from \"Organic original almond milk\" to \"Unsweetened almond milk\". Ideally, a recommeder model should be aware to these kind of recent changes and to react accordingly.\n\n\nBuy-Cycles\n\nAlthough users tend to exhibit \"loyalty\" towards specific products, it does not mean that they purchase these items in every visit. For example, a typical user buys milk more often than olive oil or toothpaste. This behavior was noticed also by [4][5][6]15], where the authors utilized recurrent neural networks (RNNs) and a timedecay mechanisms to model these temporal dynamics. In order to demonstrate this pattern on real data, we present the buy-cycles of two items, bread and paper towels, for two different users from the Instacart dataset. The purchase patterns are presented in Figure 2 in (b) and (c). As can be seen, the user in Figure 2 (b) exhibit a weekly buy-cycle of bread, while the user in Figure 2 (c) exhibits a longer buy-cycle of paper towels. The buy-cycles of products depend on the durability of the products i.e., while some product such as paper towels can last for a long time, others such as fresh bread or dairy products perish and need to be repurchased more frequently. Importantly, the buy-cycle of the same product varies also between different users. For example, a family may exhibit shorter buycycles compared to singles, as their consumption rate is higher. In conclusion, a repeated buy-cycle is a strongly indicative information pattern that depends both on the specific user and the specific item. Unfortunately, the information regarding the factors that determine these buy-cycles are often unavailable for the recommender. For example, item catalogs usually do not contain information regrading the durability of products, and users' metadata is often unknown to grocery retailers. However, the repetitive nature of buy-cycles can and should be deduced from the observations with a user-item granularity.\n\n\nItem Correlations\n\nA common phenomenon in market basket analysis is the existence of frequently co-occurring items [12,21,27]. The common interpretation for this phenomenon is that baskets tend to contain several items that serve a specific need or intent of the user. For example, ingredients for a recipe, or a combination of items for a picnic or a party. Anticipating the users' intent is mainly the focus of next-item recommendation models [30,31] but it is also a main component in NBR models [20,22,29]. For NBRR, we wish to emphasize a useful, but often overlooked, type of correlations which can be  In each figure we present the purchase pattern of a specific user with respect to a specific item during a period of 20 weeks. Each pixel in the image represents a day, where the days are ordered in a roworder as seen in (a). A yellow pixel denotes that the user has purchased the item that day, a turquoise pixel denotes that the user has placed an order that day, but did not included the item in the order, the blue background pixels denote that the user has not placed an order that day. In (b) we present the purchase pattern of bread, in (c) we present the purchase pattern of paper towels. In (d) we present the purchase pattern of the same user with respect to two different items -organic almond milk and unsweetened almonds milk. Observing (b) and (c) one can impress different buy-cycles, observing (d) we can witness the quasi-stationarity of the user's preferences. demonstrated via the popular example of \"beer and diapers\". Regardless of the question if this correlation is an urban legend or not [8], this example comes to show that some correlations do not stem from a specific need or an intent of the user. Instead, some correlations are related to the context of the user's order / visit. For example, weekly orders may form large coalitions of correlated items which are not related to a specific need or intent. Hence, this type of correlations can only be observed at the level of a single user. In order to illustrate this phenomenon, we pick a user from the Instacrt dataset and present the temporal correlations between all the items in her purchase history. The result is depicted in Figure 3. As can be seen, analyzing the temporal correlations reveal distinct cliques representing sets of correlated items which are purchased together. Moreover, we note that some items exhibit negative correlations which may indicate the existence of alternative items, e.g., a similar product from different brands or different portions of the same thing that are rarely purchased together, as demonstrated in Figure 2 (d).\n\n\nRELATED WORK\n\nWe wish to highlight important methods for NBRR and relate them to the previously discussed behavioral patterns. Since the problem of NBRR is a key component in NBR, we also included methods designed for the broad mission of NBR and not specifically for the problem of NBRR. These methods, allegedly, have the ability to recommend items that a user has never purchased before. However, as pointed by a recently published survey [25], in practice, these methods focus on repurchases only (see Table 3 in [25]). For a broader discussion regarding NBR and NBRR we refer the reader to [25], in which the authors provide a critical review and evaluations of current SOTA methods.\n\nThe evolution of methodologies for NBR and NBRR holds a resemblance to the evolution of trends in the wider community of recommender systems. Starting from representation learning [29], through RNN models [6,22], on to attention mechanisms [4,5], and recently returning to the roots of traditional nearest-neighbor models [15], and collaborative filtering [10]. In what follows, we provide a brief overview of these advances.\n\nIn [29], the authors present a representation learning approach for grocery shopping and show it's applicability in various scenarios. Inspired by the seminal Word2vec [26] model, [29] leverage the observed item associations (Section 2.4) to produce a latent space for representing users, items, and baskets. For the task of NBR the authors propose an additional algorithm named \"Adaptive Loyalty\". This algorithm incorporates the \"loyalty\" exhibited by the users towards certain items (Section 2.1) via an adaptive mechanism to support the quasi-stationary nature of users' preferences (Section 2.2). The adaptive mechanism is implemented using a latent \"loyalty\" indicator that acts as a binary switch to decide whether a user is \"loyal\" to an item or not. However, this inherent \"loyalty\" dichotomy hinders the model's ability to support different buy-cycles (Section 2.3) e.g., every other week, or only on certain days of the week. In [6,22,33], the authors present a generalization of this approach by introducing a sequence based model using RNNs in order to mitigate the dichotomy in [29]. In [4,5] the authors further extend this approach and introduce a combination of RNNs with neural self-attention which improves upon the existing RNN based methods. Recently, it was pointed by [15] that RNNs struggle to capture simple patterns like item frequency information (the number of times that each item was purchased by a user). In order to face this inherent limitation of RNNs, the authors proposed a hierarchical time-decayed weights mechanism combined with a nearest-neighbor model. A similar approach was adopted by [10], where the authors proposed a combination of collaborative filtering and user-to-item \"loyalty\" estimation in a sliding window. Hence, facilitating the use of item correlations (Section 2.4) together with \"loyalty\" (Section 2.1), while preserving recency-awareness (Section 2.2).\n\nBroadly speaking, these existing methods address the challenge that emerges from the inherent trade-off between recommending the most likable items to a user (\"loyalty\") with an attempt to detect when one of these items is no longer relevant to the user (quasi-stationairty). However, the buy-cycles of the items are often overlooked. In other words, a key limitation of all these methods is that if an item was purchased in the last order / visit, then its estimated probability to appear in the next basket would necessarily be magnified. I.e., its estimated probability to appear in the next basket can only be higher, regardless of the time that passed since this last order / visit. This is in contrast to the model that will be presented in this paper, which learns an adaptive probability that changes according to the time that passed since the last purchase. For example, in Section 5.2 we show that at least in some cases, the probability to purchase the same item on the immediate few next days, should actually decrease before it increases again when sufficient time has passed. Moreover, these temporal patterns are both user and item dependant, which in our case achieved through the utilization of a hypernetwork architecture as we shall explain. During the review process of this paper, we encountered a concurrent work, [2], which also proposes to model temporal patterns with both user and item dependents, but with the main difference that the modeling is carried out using LSTMs.\n\n\nNOTATION AND PROBLEM FORMULATION\nLet U = {u} N U u=1 and I = {i} N I i=1 denote\nthe sets of N U users and N I items, respectively. The associated baskets (orders) of a user u are denoted by the set B u = {b r u } B u r =1 , where r denotes the index of the basket, B u denotes the total number of baskets associated with the user u, and b r u denotes the r th basket, i.e. the set of purchased products in the r th order / visit. We denote the explicit timestamp a basket was placed (ordered) by t r u and assume the baskets are ordered according to these timestamps, i.e. t 1\nu ≤ t 2 u ≤ . . . ≤ t B u u .\nFor simplicity, throughout this paper we consider timestamps in resolution of days. Let H u be the set of all items that appears in the purchase history of user u, i.e., H u := ∪ B u r =1 b r u . Given the user's purchase history B u , and the day of the next order t B u +1 u , our goal is to predict which items in H u will appear in the next basket b B u +1 u . We define two representations of the user's purchase history. The first representation is based on the implicit timestamps, i.e. the indices of user's orders / visits - \nH im u ∈ R N I ×B u , where H im u [i, j] = 1 if item i appeared in the jth basket (b j u ) and zero otherwise. The second representation is a sparse representation which is based on the explicit timestamp -H ex u ∈ R N I ×t Bu u , where H ex u [i, t j u ] = 1 item i was purchased on the t\n\nMOTIVATING EXAMPLES\n\nNext, we describe some motivating examples for the need for our new approach.\n\n\nOn the Importance of Explicit Timestamps\n\nPrevious works, most notably works that employ RNNs [5,6,22], utilize an ordered sequence of historical orders / visits, but ignore the exact time stamp of these purchases i.e., the exact day of the purchase [10,15,22,29]. These works ignore the time that passed For convenience of visualization, the rows and columns of the correlation matrix are ordered according to the matrix's Fiedler vector [11].\n\nbetween two consecutive purchases. Hence, they are oblivious to whether a purchase occurred on the previous day or two week ago. In contrast to these works, the model in this paper utilizes the exact timestamps of purchases which enables it to better distinguish buycycles that cannot be detected otherwise. Next, we demonstrate the importance of using explicit timestamps using real-world examples.\n\nWe define a quantity named \"Jaccard auto-correlation\" (JA). The JA is a generalization of the standard auto-correlation of discretetime signals, applied for time-ordered sets. Given a vector s, recall that the standard auto-correlation at m can be interpreted as the average multiplication between each entry and it's mth dilated   We pose that just by observation one can witness the importance of utilizing explicit timestamps (days) rather than an ordered sequence of visits: The periodic pattern on the left plot (days) is completely averaged and disappears on the right plot (visit). Moreover, we see that utilizing the explicit timestamps results with a higher Jaccard values. This example showcases the importance of utilizing the explicit timestamps.\nJA[m] = 1 N U u 1 |B ∆m u | (b,b ′ )∈B ∆m u J (b, b ′ ),(1)\nNext, we expand our formulation from Section 4 with the common baseline of popularity-per-user [10,15,25]. The popularityper-user (PPU) of a user u with respect to an item i is defined as the number of times the user u purchased the item i divided by the total number of baskets associated with user u, i.e.:\nPPU (i |u) = B u r =1 1 b r u (i) B u ,(2)\nwhere 1 b r u (i) is an indicator function that outputs \"1\" if the r th basket of user u contains item i, and \"0\" otherwise. Note that PPU (i |u) equals to the sum of the ith row in H im u or H ex u , up to the constant of B u . In [10], the authors extend the notion of PPU and present a window-based modification denoted by PPU@R, where the PPU is computed only from the recent R baskets. Note that using the notation from Section 4, PPU@R can be computed by applying a 1-dimensional moving average of size R to the rows of H im u as follows:\nPPU @R(i |u, r ) = R s=1 H im u [i, r − s],(3)\nwhere r denotes the index of the order / visit at which PPU @R(i |u, r ) is computed. For brevity of notation we assume zero-padding of H im u . Similarly to PPU@R, the PPU@T is defined as the PPU computed only from baskets placed in the past T days. PPU@T can be computed by applying a 1-dimensional moving average of size T to the rows of H ex u . I.e.:\nPPU @T (i |u, r ) = T s=1 H ex u [i, t r u − s],(4)\nwhere H ex u is assumed to be zero-padded as well. We refer to PPU@R as popularity per user in an implicit time window, and to PPU@T as popularity per user within an explicit time window. We compute the scores attained by PPU @R and PPU @T for various of values of R andT and compute the Recall@10 of the last basket of each user in the Instacart's dataset. The results are presented in Figure 5. As we can see, both methods exhibit poor results when utilizing extremely small or large windows. However, one should notice that the best Recall@10 attained by PPU @T is superior to that attained by PPU @R, which again come to showcase the importance of considering the explicit timestamps.\n\n\nOn the Importance of Modeling Buy-Cycles\n\nIn order to illustrate the importance of leveraging buy-cycles, we perform the following experiment. Recall that the PPU @T can be recast as a moving average applied to the rows of H ex u (Equation (4)). Consider a specific choice of T and let w ∈ R T be a learnable vector of T filter taps. We define the optimized PPU @T by:\nOPPU @T (i |u, r ) = T s=1 H ex u [i, t r u − s]w[s].\nNote that PPU @T is a private case of OPPU @T when w is set to be all-ones vector. Then, we optimize the vector w to minimize a ranking-based loss function on the baskets in the Instacart's dataset. For brevity, we defer the technical details of the loss and the optimization process to Section 6.2. In Figure 6 we present the obtained filter taps after the optimization. We wish to highlight three important phenomena in Figure 6: First, we can see the emergence of a periodic pattern (annotated by 1). This pattern can be associated with the common pattern of weekly orders and admits the pattern observed in the left plot of Figure 4. Second, we can see that this periodic pattern exhibits a time-decay (annotated by 2), giving priority to recently purchased items. Third, and probably the most important, we can see that the weights given to items that were purchased in the three days preceding to the order / visit are negative (annotated by 3), i.e., a purchase of an item in the last three days will decrease its probability to be repurchased in the current order / visit.\n\n\nPROPOSED METHOD 6.1 Hyper-Convolutional Model\n\nMotivated by the above examples, and equipped with the insights from Section 2, we present our proposed hyper-convolutional model: A convolution-based model for NBRR which employs a hypernetwork architecture [13]. Hypernetworks in a nutshell is a novel approach in which two networks are employed. The first network, also known as the hypernetwork, generates the weights for the second network which makes the ultimate prediction. Hypernetworks provide an efficient alternative to neural attention and were shown to provide SOTA results on a variety of vision and natural language tasks [13,19,32]. In our case, the second network is a 1-dimensional convolutional neural net. It's weights (filter taps) are predicted by a hypernetwork that learns the personalized buy-cycle of the users with respect to each item in their purchase history.\n\nLet T denote a hyperparameter indicating the size of the model's window. Our hypernetwork is a personalized filter taps prediction function that predicts a 1-dimensional filter that matches the personalized buy-cycle. This function is parametrized by θ f and denoted by f θ f :\nR d U × R d I → R T . For each pair of vectors (ψ u , ϕ i ) ∈ R d U × R d I ,\nindicating the user and item, the hypernetwork outputs a vector of filter taps w u,i ∈ R T , which serves as parameters to configure the second network.\n\nLet\nΨ = {ψ u } N U u=1 and Φ = {ϕ i } N I i=1\nbe the unobserved user and item CF representations (Ψ ⊂ R d U and Φ U ⊂ R d I ). Consider a user u and it's purchase history H ex u ∈ R N I ×t Bu u , for each item in the catalog we employ the hypernetwork in order to compute the corresponding vector taps: {w u,i = f θ f (ψ u , ϕ i )} i=1, ..., N I . Then, we apply a 1-dimensional convolution between each row in H ex u and it's corresponding taps w u,i . The result is denoted byS u ∈ R N I ×t Bu u ,\nwhereS u [i, n] = T m=1 H ex u [i, n − m]w u,i [m]\n, for convenience of notation we assume input-padding, soS u has the same dimensions of H ex u . Lets n u denote the nth column ofS u , we relate tos n u as the predicted scores to purchase each item from the catalog on the nth day, note thats n u [i] > 0 only for item in the user's history (i ∈ H u ). In order to further refine these predictions we introduce a successive component that leverages pairwise temporal correlations between the user's items. Let q θ q and k θ k denote two mapping functions: R T → R d T , where d T is a hyperparameter and θ q , θ k denote the parameters of q θ q and k θ k , respectively. The pairwise items correlation matrix exhibited by user u at day n is denoted by A n u ∈ R N I ×N I , where 1 ≤ n ≤ t B u u . It's computation is done using the following attention-like procedure. First we apply q θ q and k θ k to each row in the sub-matrix spanned between columns (n − T − 1) and (n − 1) of H ex u . the results are denoted by Q n u and K n u , where Q n u , K n u ∈ R N I ×d T . Then, A n u is computed by the following multiplication: A n u = Q n u K n u T . Finally, the predicted scores for a user u to repurchase each item from the catalog on the nth day are  \n\n\nOptimization and Implementation Details\n\nLet Θ denote the parameters of the model, i.e.: Θ = {θ f , θ q , θ k , Ψ, Φ}.\n\nIn what follows we describe how to derive these parameters. In our implementation, we set q θ q and k θ k to be a fully connected neural networks with a single Leaky-ReLU activated hidden layer, so θ q , θ k are consisted of a weight matrix in R T ×d T and a bias vector in R d T . The function f θ f is implemented via a concatenation of the input vectors followed by a single Leaky-ReLU activated hidden layer, so θ f is consisted of a weight matrix in R (d U +d I )×T and a bias vector in R T . In order to derive the parameters in Θ, we optimize a multi label one-versus-all loss based on max-entropy, between each basket in the training set and the model's prediction. Consider a user u and it's rth basket b r u , the corresponding loss term is:\nL r u (Θ, b r u ) = − 1 |b r u | i ∈ | H u | H ex u [i, t r u ] log σ s t r u u [i] + 1 − H ex u [i, t r u ] log 1 − σ s t r u u [i] ,\nwhere σ (x) = 1/(1 + exp(x)). The average loss term for user u is given by L u (Θ, B u ) = 1\nB u B u r =1 L r u (Θ, b r u )\n, and Θ is given by the solution to the following optimization problem:\nΘ * = arg min Θ N U u=1 L u (Θ, B u )\nIn practice, the optimization proceeds with stochastic gradient descent, and the reader is referred to Section 7.3 for the exact hyperparameters configuration. We finalize this section with a remark regarding the computational costs of our proposed model. Since H ex u is a sparse matrix, the matricesS u , A n u and Q n u are sparse matrices as well and consist of |H u | non-zero rows. Therefore, in practice, w u,i and the 1-dimensional convolutions can be computed only for i ∈ H u , facilitating efficient computation with a complexity of O(|H u |).\n\n\nEXPERIMENTAL EVALUATION 7.1 Datasets\n\nOur experimental evaluations are based on the following publicly available datasets:\n\n• Instacart [16] -To the best of our knowledge, this is the most comprehensive publicly available online groceries dataset. The dataset consists of transactional data and items' metadata. The items' metadata was used for the analysis in Section 2 but it is not part of our solution which utilizes transactional data only. Transactional data in Instacart contains 30M Figure 7: Schematic illustration of our proposed model for computing repurchase scores for user u on the (n + 1)th day. The first step, described in the upper panel, is carried separately for each item. In this step, the personalized buy-cycle with respect to each item is taken into account. The second step, described in the lower panel, incorporates the personalized pairwise items correlations as exhibited by the user in the last T days. Finally, in the right panel, the predicted score is given by the multiplication of the computed scores from the first step and the personalized pairwise items correlations computed in the second step. See Section 6 for details.\n\ntransactions collected over a year from Instacart's grocery service. These transactions are associated with 3M baskets corresponding to 206K users. 7.1.1 Pre-processing. For all the datasets, we removed items that were purchased less than 20 times and discarded users with less than 11 baskets. For the sake of reproducibility, we note the following remarks: (1) The timestamps in the Instacart dataset are given in a differential manner. Allegedly, the real timestamps can be computed using an accumulative sum. However, we noticed that the maximal difference between two consecutive baskets is trimmed by the maximal value of 30 days, making it irreversible to compute the original timestamps. Hence, we discarded users that did not place any order for more than 30 days. (2) ValuedShoppers -Unlike the rest of the datasets, this dataset does not contain unique product ids. In order to mitigate this, we created unique product ids by hashing the concatenation of the product's brand id, company id, and category id, which are all available in the dataset. (3) Users sampling -In order to face the large amounts of transactional data in the ValuedShopper dataset, we followed the same procedure from [15] and randomly sampled 10K users. The same procedure was also carried out for the Instacart dataset.\n\n7.1.2 Train/Test Partitioning. We followed the same procedure as in [10]: The training data for each user consists of all baskets except for the last one. The remaining baskets are randomly split into test (50%) and validation (50%).\n\n\nEvaluation Measures\n\nWe consider the following evaluation measures: Recall@K, NDCG@K, and MRR@K. Let r denote a recommendation list, b denote a test basket, and letb denote its counterpart that consists of repurchased items only. Then, the abovementioned metrics are computed as follows:\n\n• Recall@K is computed as the number of items inb that appeared in the first K entries of r , divided by |b |. • NDCG@K is computed by dividing the DCG@K with the IDCG@K. DCG@K is defined as: K k =1\n1 b (r [k ])\n1+log k , and IDCG@K is:\nmin(K, |b |) k =1 1 1+log k , where 1 b (i)\nis an indicator function that outputs 1 if the basket b contains item i, and 0 otherwise. • MRR@K is computed as the average reciprocal rank of each item inb. If the item does not appear in the first K entries of r then its reciprocal rank is set to 0.\n\nThese quantities are computed for each test basket and averaged across all users.\n\n\nEvaluated Methods and Hyperparameters Configuration\n\nWe consider three simple methods, two SOTA methods that showed the best result in a recently published survey [25], and two ablated versions of our proposed model:\n\n• Global Popularity (GP): This is a non-personalized recommender that represents a simple approach of recommending the most frequent items that appeared in the dataset for all the users. This model combines PPU@R (see Equation (3) from Section 5.1) with user/item-wise collaborative filtering, the first model (user-wise) is denoted by RACF@R-UW, the latter (item-wise) is denoted by RACF@R-IW. • Temporal-Item-Frequency-based User-KNN (TIFU-KNN) [15]: This model combines a hierarchical time-decayed weights mechanism to model the temporal frequency dynamics of the user with a nearest-neighbor model to collaborate information between different users. • Personalized Filter Ablation (PF-Ab) -This model is an ablated version of our proposed method that utilizes the same filter taps for all the users and items. I.e., in this model we replaces n u with the predictions from the OPPU@T model from Section 5.2. Comparing to this method can help us to assess the benefit of leveraging personalized buy-cycles using the hypernetwork architecture (f θ f ).\n\n\n• Personalized Pairwise Items Correlation Ablation (PPIC-\n\nAb) -This model is an ablated version of our proposed method that discards pairwise items correlations. I.e., in this model we avoid utilizing A n u , so s n u =s n u . Comparing to this method can help us to assess the benefit of utilizing the personalized item correlations (using k θ k and q θ q ).\n\nNote that we do not include evaluations of DREAM [33] and FPMC [28] since both methods were already shown to be inferior to TIFU-KNN and RACF@R [10,15,25]. Evaluations of ANAM [3] and CTRec [4] are also excluded since these two methods assume the availability of items' attributes, while our model is purely based on transactional data.\n\nOur proposed model was optimized using a default Adam [18] optimizer with a batch size of 8. The model was trained with an early stopping procedure that monitors the Recall@10 on the validation set (which was further used for hyperparameters optimization). We noticed a relative robustness to the dimensionality of the user and item embeddings which were set to d U = d I = 10 in all datasets. The window-length (T ) was found to be the most influencing hyperparameter, as will be explained later in Section 7.4. Finally, the hyperparameters for RACF@R and TIFU-KNN were set according to the authors suggestions ( Table 3 in [15] and Section 4.5.2 in [10]), the window-lengths for PPU@T and the ablated versions were optimized using the validation set.\n\n\nResults\n\nWe begin with general tables summarizing the averaged results across all metrics and datasets. Tables 1 to 3 depict the results for the Instacart, Dunnhumby, and ValuedShopper datasets, respectively. In each table, the upper part describes competitive methods and the lower part (last three rows) describes our method and its ablations. The reported Recall@10 of the best performing models are significant w.r.t. the second best performing with p-value < 0.05. In general, the model presented in this paper (\"Ours\") outperforms all baselines across all metrics and datasets, except for a single case (MRR@10 on the ValueShopper dataset), in which TIFU-KNN performs the best, and our model came second. These results showcase the superior accuracy of our approach across the board. Moreover, the results of the ablated versions PF-Ab and PPIC-Ab showcase the contributions of the hypernetwork architecture as well as the use of personalized item correlations, respectively. In what follows, we wish to further provide a deeper understanding of these results as well as highlight several key insights.\n\nAs mentioned in Section 7.3, the hyperparameters for the models were optimized using the validation set. During our experiments, we found that one of the most influencing hyperparameter for window-based methods (Ours@T, PPU@T, and RACF@R) is the window-length (T or R, respectively). In Figure 8, we present the computed Recall@10 as a function of the window-length for the Instacart dataset. On the right side, we present the results for explicit timestamps-based methods (Ours@T and PPU@T) and on the left side we present the results for implicit timestamps-based methods (RACF@R and PPU@R). In addition to the benefit of using explicit timestamps (as discussed in Section 5.1) we see that in contrast to the rest of the window-based baselines, Ours@T exhibits significantly higher robustness with respect to the window-length. We relate this property to the ability of the hypernetwork to learn matched filter taps per each user-item pair. More specifically, revisit the experiment from Section 5.2 and recall the results depicted in Figure 6. The ability of the model to learn a smooth time-decay (annotated by 2 in Figure 6) while still focusing on relevant days (annotated by 1 in Figure 6) enables the model to support large windows. In light of these findings, we conclude that our model does not necessitate window-length optimization as long it is set to a sufficiently high number.    \n\n\nCONCLUSIONS AND FUTURE WORK\n\nIn this paper, we presented a novel hypernetwork based convolutional model for NBRR. Our model outperforms the SOTA models on several datasets across multiple metrics. In the future, we plan to address the challenge of incorporating users' and items' metadata. In addition, we plan to assess the applicability of the proposed method for the problem of within-basket (next-item) recommendations.\n\nFigure 1 :\n1Examples for item's popularity during a period of 100 days. For each item we compute the number of purchases at each day divided by the overall number of purchases during the whole period. We see that Organic Cherries, Ataulfo Mango and Organic Banana are characterized by a limited availability periods, while Banana exhibits relatively constant availability during the whole period.\n\nFigure 2 :\n2Purchase patterns of 4 different items.\n\nFigure 3 :\n3Temporal correlations between the purchases (co-occurrences within baskets) of different items of a specific user.\n\n\nentry in the vector (A[m] = n ∈Z s[n−m]s[n]). Similarly, the JA[m] is defined as the average Jaccard score between two consecutive baskets spaced with a time interval of m. More specifically, let B ∆m u denote all the pairs of baskets of user u, spaced with a time interval of m. Then, we compute the JA[m] as follows:\n\n\nwhere J (b, b ′ ) = |b∩b ′ | |b∪b ′ | is the Jaccard score between baskets b and b ′ . The interval m can be computed via the explicit timestamps of the baskets (in units of days), or via the indices of the baskets (in units of orders).\n\nFigure 4\n4depicts the JA[m] from Equation (1) on the Instacart dataset. On the left plot in Figure 4 we present the JA[m] where m represents a gap of m days, i.e. B ∆m u from Equation (1) denote all the pairs of baskets of user u, spaced with a time interval of m days. Next to it, on the right plot of Figure 4 m, we depict JA[m] again but this time m represents a gap of m visits (rather than days), i.e. B ∆m u denote all the pairs of baskets of user u, spaced with a time interval of m visits.\n\nFigure 4 :\n4The 'Jaccard auto-correlation' from Equation(1)computed on the Instacart dataset with respect to explicit timestamps (left) and implicit timestamps (right).\n\nFigure 5 :\n5Recall@10 attained by explicit timestamps using PPU@T (left) and by implicit timestamps using PPU@R (right).\n\nFigure 6 :\n6The obtained filter taps (w[t], t = 1, . . . , 70) after the optimization process. The weekly periodic pattern is annotated by 1. The time-decay is annotated by 2. The negative weights of recently purchased items are annotated by 3.given by the multiplication of the nth column inS u with the personalized pairwise items correlations matrix: s n u = A n us n u . A schematic illustration of our proposed model is described inFigure 7.\n\n•\nDunnhumby [9]  -This dataset is based on two years of house-hold transactions associated with 2.5K frequent shoppers. The dataset comprises 2M transactions associated with 270K baskets.• ValuedShopper [17] -This dataset contains 350M transactions collected over a year from an online grocery service. These transactions are associated with 30M baskets corresponding to 300K users.\n\n•\nPopularity-per-user (PPU): This baseline recommends the most frequent items that appeared in the user's past baskets as the predicted next basket, see Equation (2) from Section 5.1 for further details. • Popularity-per-user within a time window (PPU@T):This baseline is a modification of PPU that considers only baskets placed in the past T days, where T is a hyperparameter, see Equation (4) from Section 5.1 for further details. • Recency Aware Collaborative Filtering (RACF@R)[10]:\n\nFigure 8 :\n8Recall@10 attained by compared methods. On the left side -explicit timestamps-based methods (Ours@T and PPU@T) and on the right side -implicit timestamps-based methods (RACF@R and PPU@R).\n\nTable 1 :\n1Results for the Instacart dataset.Model \nRecall@10 MRR@10 NDCG@10 \nRecall@20 MRR@20 NDCG@20 \n\nGP \n0.081 \n0.071 \n0.072 \n0.11 \n0.074 \n0.073 \nPPU \n0.428 \n0.181 \n0.454 \n0.588 \n0.192 \n0.501 \nPPU@T \n0.484 \n0.206 \n0.515 \n0.644 \n0.218 \n0.561 \nRACF@R-UW \n0.488 \n0.207 \n0.515 \n0.648 \n0.218 \n0.559 \nRACF@R-IW \n0.483 \n0.206 \n0.512 \n0.640 \n0.217 \n0.556 \nTIFU-KNN \n0.495 \n0.206 \n0.516 \n0.661 \n0.217 \n0.562 \nOurs \n0.506 \n0.211 \n0.531 \n0.667 \n0.228 \n0.575 \nPF-Ab \n0.491 \n0.210 \n0.525 \n0.648 \n0.220 \n0.567 \nPPIC-Ab \n0.494 \n0.211 \n0.524 \n0.649 \n0.222 \n0.567 \n\n\n\nTable 2 :\n2Results for the Dunnhumby dataset.Model \nRecall@10 MRR@10 NDCG@10 \nRecall@20 MRR@20 NDCG@20 \n\nGP \n0.086 \n0.074 \n0.061 \n0.12 \n0.074 \n0.062 \nPPU \n0.345 \n0.176 \n0.317 \n0.450 \n0.183 \n0.345 \nPPU@T \n0.354 \n0.179 \n0.326 \n0.467 \n0.187 \n0.355 \nRACF@R-UW \n0.352 \n0.136 \n0.284 \n0.481 \n0.145 \n0.321 \nRACF@R-IW \n0.355 \n0.171 \n0.323 \n0.465 \n0.178 \n0.352 \nTIFU-KNN \n0.354 \n0.182 \n0.331 \n0.462 \n0.189 \n0.356 \nOurs \n0.378 \n0.196 \n0.350 \n0.503 \n0.201 \n0.376 \nPF-Ab \n0.356 \n0.181 \n0.329 \n0.471 \n0.189 \n0.356 \nPPIC-Ab \n0.371 \n0.192 \n0.346 \n0.495 \n0.191 \n0.363 \n\n\n\nTable 3 :\n3Results for the ValuedShopper dataset.Model \nRecall@10 MRR@10 NDCG@10 \nRecall@20 MRR@20 NDCG@20 \n\nGP \n0.091 \n0.076 \n0.078 \n0.096 \n0.081 \n0.087 \nPPU \n0.273 \n0.125 \n0.279 \n0.374 \n0.132 \n0.305 \nPPU@T \n0.282 \n0.132 \n0.290 \n0.383 \n0.139 \n0.316 \nRACF@R-UW \n0.286 \n0.131 \n0.291 \n0.39 \n0.138 \n0.319 \nRACF@R-IW \n0.284 \n0.131 \n0.290 \n0.387 \n0.138 \n0.316 \nTIFU-KNN \n0.286 \n0.145 \n0.301 \n0.376 \n0.149 \n0.321 \nOurs \n0.301 \n0.144 \n0.316 \n0.413 \n0.149 \n0.340 \nPF-Ab \n0.286 \n0.133 \n0.290 \n0.393 \n0.141 \n0.327 \nPPIC-Ab \n0.298 \n0.138 \n0.304 \n0.401 \n0.145 \n0.335 \n\n\n\nThe dynamics of repeat consumption. Ashton Anderson, Ravi Kumar, Andrew Tomkins, Sergei Vassilvitskii, Proceedings of the 23rd international conference on World wide web. the 23rd international conference on World wide webAshton Anderson, Ravi Kumar, Andrew Tomkins, and Sergei Vassilvitskii. 2014. The dynamics of repeat consumption. In Proceedings of the 23rd international conference on World wide web. 419-430.\n\nReCANet: A Repeat Consumption-Aware Neural Network for Next Basket Recommendation in Grocery Shopping. Mozhdeh Ariannezhad, Sami Jullien, Ming Li, Min Fang, Sebastian Schelter, Maarten De Rijke, Mozhdeh Ariannezhad, Sami Jullien, Ming Li, Min Fang, Sebastian Schelter, and Maarten de Rijke. 2022. ReCANet: A Repeat Consumption-Aware Neural Network for Next Basket Recommendation in Grocery Shopping. (2022).\n\nAn Attribute-Aware Neural Attentive Model for Next Basket Recommendation. Ting Bai, Jian-Yun Nie, Wayne Xin Zhao, Yutao Zhu, Pan Du, Ji-Rong Wen, 10.1145/3209978.3210129The 41st International ACM SIGIR Conference on Research & Development in Information Retrieval. Ann Arbor, MI, USA; New York, NY, USASIGIR '18). Association for Computing MachineryTing Bai, Jian-Yun Nie, Wayne Xin Zhao, Yutao Zhu, Pan Du, and Ji-Rong Wen. 2018. An Attribute-Aware Neural Attentive Model for Next Basket Rec- ommendation. In The 41st International ACM SIGIR Conference on Research & Development in Information Retrieval (Ann Arbor, MI, USA) (SIGIR '18). As- sociation for Computing Machinery, New York, NY, USA, 1201-1204. https: //doi.org/10.1145/3209978.3210129\n\nCtrec: A long-short demands evolution model for continuoustime recommendation. Ting Bai, Lixin Zou, Wayne Xin Zhao, Pan Du, Weidong Liu, Jian-Yun Nie, Ji-Rong Wen, Proceedings of the 42nd International ACM SIGIR Conference on Research and Development in Information Retrieval. the 42nd International ACM SIGIR Conference on Research and Development in Information RetrievalTing Bai, Lixin Zou, Wayne Xin Zhao, Pan Du, Weidong Liu, Jian-Yun Nie, and Ji-Rong Wen. 2019. Ctrec: A long-short demands evolution model for continuous- time recommendation. In Proceedings of the 42nd International ACM SIGIR Con- ference on Research and Development in Information Retrieval. 675-684.\n\nA recurrent model with self-attention for product repurchase recommendation. Pengda Chen, Jian Li, Proceedings of the 2019 4th International Conference on Mathematics and Artificial Intelligence. the 2019 4th International Conference on Mathematics and Artificial IntelligencePengda Chen and Jian Li. 2019. A recurrent model with self-attention for prod- uct repurchase recommendation. In Proceedings of the 2019 4th International Conference on Mathematics and Artificial Intelligence. 199-203.\n\nWeighted sequence loss based recurrent model for repurchase recommendation. Pengda Chen, Jian Li, IOP Conference Series: Materials Science and Engineering. IOP Publishing49062062Pengda Chen and Jian Li. 2019. Weighted sequence loss based recurrent model for repurchase recommendation. In IOP Conference Series: Materials Science and Engineering, Vol. 490. IOP Publishing, 062062.\n\nComparing retailer purchase patterns and brand metrics for in-store and online grocery purchasing. John Dawes, Magda Nenycz-Thiel, Journal of Marketing Management. 30John Dawes and Magda Nenycz-Thiel. 2014. Comparing retailer purchase pat- terns and brand metrics for in-store and online grocery purchasing. Journal of Marketing Management 30, 3-4 (2014), 364-382.\n\nWhat is the \"true story\" about data mining, beer and diapers. Dssresources, DSSResources. 2002. What is the \"true story\" about data mining, beer and diapers. http://www.dssresources.com/newsletters/66.php\n\nDunnhumby, The Complete Journey. Dunnhumby. 2017. The Complete Journey. https://www.dunnhumby.com/source- files/\n\nRecency aware collaborative filtering for next basket recommendation. Guglielmo Faggioli, Mirko Polato, Fabio Aiolli, Proceedings of the 28th ACM Conference on User Modeling, Adaptation and Personalization. the 28th ACM Conference on User Modeling, Adaptation and PersonalizationGuglielmo Faggioli, Mirko Polato, and Fabio Aiolli. 2020. Recency aware collabo- rative filtering for next basket recommendation. In Proceedings of the 28th ACM Conference on User Modeling, Adaptation and Personalization. 80-87.\n\nAlgebraic connectivity of graphs. Miroslav Fiedler, Czechoslovak mathematical journal. 23Miroslav Fiedler. 1973. Algebraic connectivity of graphs. Czechoslovak mathe- matical journal 23, 2 (1973), 298-305.\n\nA survey on association rule mining in market basket analysis. Savi Gupta, Roopal Mamtora, International Journal of Information and Computation Technology. 4Savi Gupta and Roopal Mamtora. 2014. A survey on association rule mining in market basket analysis. International Journal of Information and Computation Technology 4, 4 (2014), 409-414.\n\n. David Ha, Andrew M Dai, V Quoc, Le, abs/1609.09106David Ha, Andrew M. Dai, and Quoc V. Le. 2016. HyperNetworks. CoRR abs/1609.09106 (2016). http://arxiv.org/abs/1609.09106\n\nConsumer values, the theory of planned behaviour and online grocery shopping. Torben Hansen, International Journal of Consumer Studies. 32Torben Hansen. 2008. Consumer values, the theory of planned behaviour and online grocery shopping. International Journal of Consumer Studies 32, 2 (2008), 128-137.\n\nModeling personalized item frequency information for next-basket recommendation. Haoji Hu, Xiangnan He, Jinyang Gao, Zhi-Li Zhang, Proceedings of the 43rd International ACM SIGIR Conference on Research and Development in Information Retrieval. the 43rd International ACM SIGIR Conference on Research and Development in Information RetrievalHaoji Hu, Xiangnan He, Jinyang Gao, and Zhi-Li Zhang. 2020. Modeling personal- ized item frequency information for next-basket recommendation. In Proceedings of the 43rd International ACM SIGIR Conference on Research and Development in Information Retrieval. 1071-1080.\n\nThe Instacart Online Grocery Shopping Dataset. Instacart. 2017. The Instacart Online Grocery Shopping Dataset 2017. https: //www.instacart.com/datasets/grocery-shopping-2017\n\nAcquire Valued Shoppers. Kaggle, Kaggle. 2013. Acquire Valued Shoppers. https://www.kaggle.com/c/acquire- valued-shoppers-challenge/overview\n\nAdam: A method for stochastic optimization. P Diederik, Jimmy Kingma, Ba, arXiv:1412.6980arXiv preprintDiederik P Kingma and Jimmy Ba. 2014. Adam: A method for stochastic opti- mization. arXiv preprint arXiv:1412.6980 (2014).\n\nA dynamic convolutional layer for short range weather prediction. Benjamin Klein, Lior Wolf, Yehuda Afek, Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. the IEEE Conference on Computer Vision and Pattern RecognitionBenjamin Klein, Lior Wolf, and Yehuda Afek. 2015. A dynamic convolutional layer for short range weather prediction. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. 4840-4848.\n\nPersonalized purchase prediction of market baskets with Wasserstein-based sequence matching. Mathias Kraus, Stefan Feuerriegel, Proceedings of the 25th ACM SIGKDD International Conference on Knowledge Discovery & Data Mining. the 25th ACM SIGKDD International Conference on Knowledge Discovery & Data MiningMathias Kraus and Stefan Feuerriegel. 2019. Personalized purchase prediction of market baskets with Wasserstein-based sequence matching. In Proceedings of the 25th ACM SIGKDD International Conference on Knowledge Discovery & Data Mining. 2643-2652.\n\nMarket Basket Analysis to identify customer behaviours by way of transaction data. Fachrul Kurniawan, Binti Umayah, Jihad Hammad, Knowledge Engineering and Data Science. 120Supeno Mardi Susiki Nugroho, and Mochammad HariadiFachrul Kurniawan, Binti Umayah, Jihad Hammad, Supeno Mardi Susiki Nugroho, and Mochammad Hariadi. 2018. Market Basket Analysis to identify customer behaviours by way of transaction data. Knowledge Engineering and Data Science 1, 1 (2018), 20.\n\nCorrelation-sensitive nextbasket recommendation. Duc-Trong Le, W Hady, Yuan Lauw, Fang, Duc-Trong Le, Hady W Lauw, and Yuan Fang. 2019. Correlation-sensitive next- basket recommendation. (2019).\n\nOn the value of reminders within e-commerce recommendations. Lukas Lerche, Dietmar Jannach, Malte Ludewig, Proceedings of the 2016 Conference on User Modeling Adaptation and Personalization. the 2016 Conference on User Modeling Adaptation and PersonalizationLukas Lerche, Dietmar Jannach, and Malte Ludewig. 2016. On the value of reminders within e-commerce recommendations. In Proceedings of the 2016 Con- ference on User Modeling Adaptation and Personalization. 27-35.\n\nGrocery shopping recommendations based on basket-sensitive random walk. Ming Li, M Benjamin, Ian Dias, Wael Jarman, Paulo Jg El-Deredy, Lisboa, Proceedings of the 15th ACM SIGKDD international conference on Knowledge discovery and data mining. the 15th ACM SIGKDD international conference on Knowledge discovery and data miningMing Li, Benjamin M Dias, Ian Jarman, Wael El-Deredy, and Paulo JG Lisboa. 2009. Grocery shopping recommendations based on basket-sensitive random walk. In Proceedings of the 15th ACM SIGKDD international conference on Knowledge discovery and data mining. 1215-1224.\n\nMing Li, Sami Jullien, arXiv:2109.14233Mozhdeh Ariannezhad, and Maarten de Rijke. 2021. A Next Basket Recommendation Reality Check. arXiv preprintMing Li, Sami Jullien, Mozhdeh Ariannezhad, and Maarten de Rijke. 2021. A Next Basket Recommendation Reality Check. arXiv preprint arXiv:2109.14233 (2021).\n\nEfficient estimation of word representations in vector space. Tomas Mikolov, Kai Chen, Greg Corrado, Jeffrey Dean, arXiv:1301.3781arXiv preprintTomas Mikolov, Kai Chen, Greg Corrado, and Jeffrey Dean. 2013. Efficient estimation of word representations in vector space. arXiv preprint arXiv:1301.3781 (2013).\n\nA comparative study on market basket analysis and apriori association technique. Warnia Nengsih, 2015 3rd international conference on information and communication technology (ICoICT). IEEEWarnia Nengsih. 2015. A comparative study on market basket analysis and apriori association technique. In 2015 3rd international conference on information and communication technology (ICoICT). IEEE, 461-464.\n\nFactorizing Personalized Markov Chains for Next-Basket Recommendation. Steffen Rendle, Christoph Freudenthaler, Lars Schmidt-Thieme, 10.1145/1772690.1772773Proceedings of the 19th International Conference on World Wide Web. the 19th International Conference on World Wide WebRaleigh, North Carolina, USA; New York, NY, USAAssociation for Computing MachineryWWW '10)Steffen Rendle, Christoph Freudenthaler, and Lars Schmidt-Thieme. 2010. Fac- torizing Personalized Markov Chains for Next-Basket Recommendation. In Pro- ceedings of the 19th International Conference on World Wide Web (Raleigh, North Carolina, USA) (WWW '10). Association for Computing Machinery, New York, NY, USA, 811-820. https://doi.org/10.1145/1772690.1772773\n\nRepresenting and recommending shopping baskets with complementarity, compatibility and loyalty. Mengting Wan, Di Wang, Jie Liu, Paul Bennett, Julian Mcauley, Proceedings of the 27th ACM International Conference on Information and Knowledge Management. the 27th ACM International Conference on Information and Knowledge ManagementMengting Wan, Di Wang, Jie Liu, Paul Bennett, and Julian McAuley. 2018. Rep- resenting and recommending shopping baskets with complementarity, compat- ibility and loyalty. In Proceedings of the 27th ACM International Conference on Information and Knowledge Management. 1133-1142.\n\nAttention-based transactional context embedding for next-item recommendation. Shoujin Wang, Liang Hu, Longbing Cao, Xiaoshui Huang, Defu Lian, Wei Liu, Proceedings of the AAAI Conference on Artificial Intelligence. the AAAI Conference on Artificial Intelligence32Shoujin Wang, Liang Hu, Longbing Cao, Xiaoshui Huang, Defu Lian, and Wei Liu. 2018. Attention-based transactional context embedding for next-item rec- ommendation. In Proceedings of the AAAI Conference on Artificial Intelligence, Vol. 32.\n\nModeling multi-purpose sessions for next-item recommendations via mixture-channel purpose routing networks. Shoujin Wang, Liang Hu, Yan Wang, Z Quan, Mehmet Sheng, Longbing Orgun, Cao, International Joint Conference on Artificial Intelligence. International Joint Conferences on Artificial Intelligence. Shoujin Wang, Liang Hu, Yan Wang, Quan Z Sheng, Mehmet Orgun, and Long- bing Cao. 2019. Modeling multi-purpose sessions for next-item recommendations via mixture-channel purpose routing networks. In International Joint Conference on Artificial Intelligence. International Joint Conferences on Artificial Intelligence.\n\nFelix Wu, Angela Fan, Alexei Baevski, Michael Yann N Dauphin, Auli, arXiv:1901.10430Pay less attention with lightweight and dynamic convolutions. arXiv preprintFelix Wu, Angela Fan, Alexei Baevski, Yann N Dauphin, and Michael Auli. 2019. Pay less attention with lightweight and dynamic convolutions. arXiv preprint arXiv:1901.10430 (2019).\n\nA Dynamic Recurrent Model for Next Basket Recommendation. Feng Yu, Qiang Liu, Shu Wu, Liang Wang, Tieniu Tan, 10.1145/2911451.2914683Proceedings of the 39th International ACM SIGIR Conference on Research and Development in Information Retrieval. the 39th International ACM SIGIR Conference on Research and Development in Information RetrievalPisa, Italy; New York, NY, USAAssociation for Computing MachinerySIGIR '16)Feng Yu, Qiang Liu, Shu Wu, Liang Wang, and Tieniu Tan. 2016. A Dynamic Recurrent Model for Next Basket Recommendation. In Proceedings of the 39th International ACM SIGIR Conference on Research and Development in Information Retrieval (Pisa, Italy) (SIGIR '16). Association for Computing Machinery, New York, NY, USA, 729-732. https://doi.org/10.1145/2911451.2914683\n\nWalmart online grocery personalization: Behavioral insights and basket recommendations. Mindi Yuan, Yannis Pavlidis, Mukesh Jain, Kristy Caster, International Conference on Conceptual Modeling. SpringerMindi Yuan, Yannis Pavlidis, Mukesh Jain, and Kristy Caster. 2016. Walmart online grocery personalization: Behavioral insights and basket recommendations. In International Conference on Conceptual Modeling. Springer, 49-64.\n", "annotations": {"author": "[{\"end\":160,\"start\":124},{\"end\":211,\"start\":161},{\"end\":263,\"start\":212},{\"end\":319,\"start\":264}]", "publisher": null, "author_last_name": "[{\"end\":132,\"start\":128},{\"end\":172,\"start\":166},{\"end\":222,\"start\":216},{\"end\":280,\"start\":269}]", "author_first_name": "[{\"end\":127,\"start\":124},{\"end\":165,\"start\":161},{\"end\":215,\"start\":212},{\"end\":268,\"start\":264}]", "author_affiliation": "[{\"end\":159,\"start\":134},{\"end\":210,\"start\":174},{\"end\":262,\"start\":224},{\"end\":318,\"start\":282}]", "title": "[{\"end\":100,\"start\":1},{\"end\":419,\"start\":320}]", "venue": null, "abstract": "[{\"end\":2168,\"start\":1088}]", "bib_ref": "[{\"attributes\":{\"ref_id\":\"b2\"},\"end\":2361,\"start\":2358},{\"attributes\":{\"ref_id\":\"b24\"},\"end\":2364,\"start\":2361},{\"attributes\":{\"ref_id\":\"b27\"},\"end\":2367,\"start\":2364},{\"attributes\":{\"ref_id\":\"b32\"},\"end\":2370,\"start\":2367},{\"attributes\":{\"ref_id\":\"b24\"},\"end\":2502,\"start\":2498},{\"attributes\":{\"ref_id\":\"b24\"},\"end\":2748,\"start\":2744},{\"attributes\":{\"ref_id\":\"b29\"},\"end\":3178,\"start\":3174},{\"attributes\":{\"ref_id\":\"b30\"},\"end\":3181,\"start\":3178},{\"attributes\":{\"ref_id\":\"b22\"},\"end\":3609,\"start\":3605},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":6055,\"start\":6051},{\"attributes\":{\"ref_id\":\"b6\"},\"end\":6678,\"start\":6675},{\"attributes\":{\"ref_id\":\"b13\"},\"end\":6681,\"start\":6678},{\"attributes\":{\"ref_id\":\"b22\"},\"end\":6684,\"start\":6681},{\"attributes\":{\"ref_id\":\"b33\"},\"end\":6687,\"start\":6684},{\"attributes\":{\"ref_id\":\"b28\"},\"end\":6732,\"start\":6728},{\"attributes\":{\"ref_id\":\"b0\"},\"end\":6833,\"start\":6830},{\"attributes\":{\"ref_id\":\"b23\"},\"end\":6836,\"start\":6833},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":6932,\"start\":6928},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":6935,\"start\":6932},{\"attributes\":{\"ref_id\":\"b28\"},\"end\":6938,\"start\":6935},{\"attributes\":{\"ref_id\":\"b24\"},\"end\":7051,\"start\":7047},{\"attributes\":{\"ref_id\":\"b24\"},\"end\":7071,\"start\":7067},{\"attributes\":{\"ref_id\":\"b24\"},\"end\":7267,\"start\":7263},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":7544,\"start\":7540},{\"attributes\":{\"ref_id\":\"b3\"},\"end\":9091,\"start\":9088},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":9094,\"start\":9091},{\"attributes\":{\"ref_id\":\"b5\"},\"end\":9097,\"start\":9094},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":9100,\"start\":9097},{\"attributes\":{\"ref_id\":\"b11\"},\"end\":10712,\"start\":10708},{\"attributes\":{\"ref_id\":\"b20\"},\"end\":10715,\"start\":10712},{\"attributes\":{\"ref_id\":\"b26\"},\"end\":10718,\"start\":10715},{\"attributes\":{\"ref_id\":\"b29\"},\"end\":11042,\"start\":11038},{\"attributes\":{\"ref_id\":\"b30\"},\"end\":11045,\"start\":11042},{\"attributes\":{\"ref_id\":\"b19\"},\"end\":11096,\"start\":11092},{\"attributes\":{\"ref_id\":\"b21\"},\"end\":11099,\"start\":11096},{\"attributes\":{\"ref_id\":\"b28\"},\"end\":11102,\"start\":11099},{\"attributes\":{\"ref_id\":\"b7\"},\"end\":12217,\"start\":12214},{\"attributes\":{\"ref_id\":\"b24\"},\"end\":13689,\"start\":13685},{\"attributes\":{\"ref_id\":\"b24\"},\"end\":13764,\"start\":13760},{\"attributes\":{\"ref_id\":\"b24\"},\"end\":13842,\"start\":13838},{\"attributes\":{\"ref_id\":\"b28\"},\"end\":14117,\"start\":14113},{\"attributes\":{\"ref_id\":\"b5\"},\"end\":14141,\"start\":14138},{\"attributes\":{\"ref_id\":\"b21\"},\"end\":14144,\"start\":14141},{\"attributes\":{\"ref_id\":\"b3\"},\"end\":14176,\"start\":14173},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":14178,\"start\":14176},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":14259,\"start\":14255},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":14293,\"start\":14289},{\"attributes\":{\"ref_id\":\"b28\"},\"end\":14367,\"start\":14363},{\"attributes\":{\"ref_id\":\"b25\"},\"end\":14532,\"start\":14528},{\"attributes\":{\"ref_id\":\"b28\"},\"end\":14544,\"start\":14540},{\"attributes\":{\"ref_id\":\"b5\"},\"end\":15303,\"start\":15300},{\"attributes\":{\"ref_id\":\"b21\"},\"end\":15306,\"start\":15303},{\"attributes\":{\"ref_id\":\"b32\"},\"end\":15309,\"start\":15306},{\"attributes\":{\"ref_id\":\"b28\"},\"end\":15456,\"start\":15452},{\"attributes\":{\"ref_id\":\"b3\"},\"end\":15464,\"start\":15461},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":15466,\"start\":15464},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":15655,\"start\":15651},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":15992,\"start\":15988},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":17614,\"start\":17611},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":19408,\"start\":19405},{\"attributes\":{\"ref_id\":\"b5\"},\"end\":19410,\"start\":19408},{\"attributes\":{\"ref_id\":\"b21\"},\"end\":19413,\"start\":19410},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":19565,\"start\":19561},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":19568,\"start\":19565},{\"attributes\":{\"ref_id\":\"b21\"},\"end\":19571,\"start\":19568},{\"attributes\":{\"ref_id\":\"b28\"},\"end\":19574,\"start\":19571},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":19754,\"start\":19750},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":21076,\"start\":21072},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":21079,\"start\":21076},{\"attributes\":{\"ref_id\":\"b24\"},\"end\":21082,\"start\":21079},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":21565,\"start\":21561},{\"attributes\":{\"ref_id\":\"b12\"},\"end\":24785,\"start\":24781},{\"attributes\":{\"ref_id\":\"b12\"},\"end\":25164,\"start\":25160},{\"attributes\":{\"ref_id\":\"b18\"},\"end\":25167,\"start\":25164},{\"attributes\":{\"ref_id\":\"b31\"},\"end\":25170,\"start\":25167},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":31850,\"start\":31846},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":32023,\"start\":32019},{\"attributes\":{\"ref_id\":\"b24\"},\"end\":33262,\"start\":33258},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":33764,\"start\":33760},{\"attributes\":{\"ref_id\":\"b32\"},\"end\":34784,\"start\":34780},{\"attributes\":{\"ref_id\":\"b27\"},\"end\":34798,\"start\":34794},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":34879,\"start\":34875},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":34882,\"start\":34879},{\"attributes\":{\"ref_id\":\"b24\"},\"end\":34885,\"start\":34882},{\"attributes\":{\"ref_id\":\"b2\"},\"end\":34910,\"start\":34907},{\"attributes\":{\"ref_id\":\"b3\"},\"end\":34924,\"start\":34921},{\"attributes\":{\"ref_id\":\"b17\"},\"end\":35127,\"start\":35123},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":35698,\"start\":35694},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":35724,\"start\":35720},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":42005,\"start\":42001}]", "figure": "[{\"attributes\":{\"id\":\"fig_0\"},\"end\":39154,\"start\":38757},{\"attributes\":{\"id\":\"fig_1\"},\"end\":39207,\"start\":39155},{\"attributes\":{\"id\":\"fig_3\"},\"end\":39335,\"start\":39208},{\"attributes\":{\"id\":\"fig_4\"},\"end\":39656,\"start\":39336},{\"attributes\":{\"id\":\"fig_5\"},\"end\":39895,\"start\":39657},{\"attributes\":{\"id\":\"fig_6\"},\"end\":40394,\"start\":39896},{\"attributes\":{\"id\":\"fig_7\"},\"end\":40564,\"start\":40395},{\"attributes\":{\"id\":\"fig_8\"},\"end\":40686,\"start\":40565},{\"attributes\":{\"id\":\"fig_9\"},\"end\":41134,\"start\":40687},{\"attributes\":{\"id\":\"fig_10\"},\"end\":41518,\"start\":41135},{\"attributes\":{\"id\":\"fig_11\"},\"end\":42006,\"start\":41519},{\"attributes\":{\"id\":\"fig_12\"},\"end\":42207,\"start\":42007},{\"attributes\":{\"id\":\"tab_0\",\"type\":\"table\"},\"end\":42762,\"start\":42208},{\"attributes\":{\"id\":\"tab_1\",\"type\":\"table\"},\"end\":43317,\"start\":42763},{\"attributes\":{\"id\":\"tab_2\",\"type\":\"table\"},\"end\":43876,\"start\":43318}]", "paragraph": "[{\"end\":3091,\"start\":2184},{\"end\":3778,\"start\":3093},{\"end\":4653,\"start\":3780},{\"end\":4994,\"start\":4655},{\"end\":5825,\"start\":4996},{\"end\":6197,\"start\":5870},{\"end\":7481,\"start\":6228},{\"end\":8346,\"start\":7526},{\"end\":8828,\"start\":8348},{\"end\":10590,\"start\":8843},{\"end\":13240,\"start\":10612},{\"end\":13931,\"start\":13257},{\"end\":14358,\"start\":13933},{\"end\":16272,\"start\":14360},{\"end\":17773,\"start\":16274},{\"end\":18352,\"start\":17856},{\"end\":18917,\"start\":18383},{\"end\":19308,\"start\":19231},{\"end\":19755,\"start\":19353},{\"end\":20156,\"start\":19757},{\"end\":20916,\"start\":20158},{\"end\":21285,\"start\":20977},{\"end\":21873,\"start\":21329},{\"end\":22276,\"start\":21921},{\"end\":23017,\"start\":22329},{\"end\":23388,\"start\":23062},{\"end\":24523,\"start\":23443},{\"end\":25412,\"start\":24573},{\"end\":25691,\"start\":25414},{\"end\":25922,\"start\":25770},{\"end\":25927,\"start\":25924},{\"end\":26423,\"start\":25970},{\"end\":27680,\"start\":26475},{\"end\":27801,\"start\":27724},{\"end\":28554,\"start\":27803},{\"end\":28782,\"start\":28690},{\"end\":28885,\"start\":28814},{\"end\":29478,\"start\":28924},{\"end\":29603,\"start\":29519},{\"end\":30642,\"start\":29605},{\"end\":31949,\"start\":30644},{\"end\":32184,\"start\":31951},{\"end\":32474,\"start\":32208},{\"end\":32674,\"start\":32476},{\"end\":32712,\"start\":32688},{\"end\":33009,\"start\":32757},{\"end\":33092,\"start\":33011},{\"end\":33311,\"start\":33148},{\"end\":34366,\"start\":33313},{\"end\":34729,\"start\":34428},{\"end\":35067,\"start\":34731},{\"end\":35821,\"start\":35069},{\"end\":36932,\"start\":35833},{\"end\":38330,\"start\":36934},{\"end\":38756,\"start\":38362}]", "formula": "[{\"attributes\":{\"id\":\"formula_0\"},\"end\":17855,\"start\":17809},{\"attributes\":{\"id\":\"formula_1\"},\"end\":18382,\"start\":18353},{\"attributes\":{\"id\":\"formula_2\"},\"end\":19208,\"start\":18918},{\"attributes\":{\"id\":\"formula_3\"},\"end\":20976,\"start\":20917},{\"attributes\":{\"id\":\"formula_4\"},\"end\":21328,\"start\":21286},{\"attributes\":{\"id\":\"formula_5\"},\"end\":21920,\"start\":21874},{\"attributes\":{\"id\":\"formula_6\"},\"end\":22328,\"start\":22277},{\"attributes\":{\"id\":\"formula_7\"},\"end\":23442,\"start\":23389},{\"attributes\":{\"id\":\"formula_8\"},\"end\":25769,\"start\":25692},{\"attributes\":{\"id\":\"formula_9\"},\"end\":25969,\"start\":25928},{\"attributes\":{\"id\":\"formula_10\"},\"end\":26474,\"start\":26424},{\"attributes\":{\"id\":\"formula_11\"},\"end\":28689,\"start\":28555},{\"attributes\":{\"id\":\"formula_12\"},\"end\":28813,\"start\":28783},{\"attributes\":{\"id\":\"formula_13\"},\"end\":28923,\"start\":28886},{\"attributes\":{\"id\":\"formula_14\"},\"end\":32687,\"start\":32675},{\"attributes\":{\"id\":\"formula_15\"},\"end\":32756,\"start\":32713}]", "table_ref": "[{\"attributes\":{\"ref_id\":\"tab_1\"},\"end\":7259,\"start\":7252},{\"attributes\":{\"ref_id\":\"tab_2\"},\"end\":13756,\"start\":13749},{\"attributes\":{\"ref_id\":\"tab_2\"},\"end\":35690,\"start\":35683}]", "section_header": "[{\"attributes\":{\"n\":\"1\"},\"end\":2182,\"start\":2170},{\"attributes\":{\"n\":\"2\"},\"end\":5868,\"start\":5828},{\"attributes\":{\"n\":\"2.1\"},\"end\":6226,\"start\":6200},{\"attributes\":{\"n\":\"2.2\"},\"end\":7524,\"start\":7484},{\"attributes\":{\"n\":\"2.3\"},\"end\":8841,\"start\":8831},{\"attributes\":{\"n\":\"2.4\"},\"end\":10610,\"start\":10593},{\"attributes\":{\"n\":\"3\"},\"end\":13255,\"start\":13243},{\"attributes\":{\"n\":\"4\"},\"end\":17808,\"start\":17776},{\"attributes\":{\"n\":\"5\"},\"end\":19229,\"start\":19210},{\"attributes\":{\"n\":\"5.1\"},\"end\":19351,\"start\":19311},{\"attributes\":{\"n\":\"5.2\"},\"end\":23060,\"start\":23020},{\"attributes\":{\"n\":\"6\"},\"end\":24571,\"start\":24526},{\"attributes\":{\"n\":\"6.2\"},\"end\":27722,\"start\":27683},{\"attributes\":{\"n\":\"7\"},\"end\":29517,\"start\":29481},{\"attributes\":{\"n\":\"7.2\"},\"end\":32206,\"start\":32187},{\"attributes\":{\"n\":\"7.3\"},\"end\":33146,\"start\":33095},{\"end\":34426,\"start\":34369},{\"attributes\":{\"n\":\"7.4\"},\"end\":35831,\"start\":35824},{\"attributes\":{\"n\":\"8\"},\"end\":38360,\"start\":38333},{\"end\":38768,\"start\":38758},{\"end\":39166,\"start\":39156},{\"end\":39219,\"start\":39209},{\"end\":39905,\"start\":39897},{\"end\":40406,\"start\":40396},{\"end\":40576,\"start\":40566},{\"end\":40698,\"start\":40688},{\"end\":41137,\"start\":41136},{\"end\":41521,\"start\":41520},{\"end\":42018,\"start\":42008},{\"end\":42218,\"start\":42209},{\"end\":42773,\"start\":42764},{\"end\":43328,\"start\":43319}]", "table": "[{\"end\":42762,\"start\":42254},{\"end\":43317,\"start\":42809},{\"end\":43876,\"start\":43368}]", "figure_caption": "[{\"end\":39154,\"start\":38770},{\"end\":39207,\"start\":39168},{\"end\":39335,\"start\":39221},{\"end\":39656,\"start\":39338},{\"end\":39895,\"start\":39659},{\"end\":40394,\"start\":39907},{\"end\":40564,\"start\":40408},{\"end\":40686,\"start\":40578},{\"end\":41134,\"start\":40700},{\"end\":41518,\"start\":41138},{\"end\":42006,\"start\":41522},{\"end\":42207,\"start\":42020},{\"end\":42254,\"start\":42220},{\"end\":42809,\"start\":42775},{\"end\":43368,\"start\":43330}]", "figure_ref": "[{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":8098,\"start\":8090},{\"attributes\":{\"ref_id\":\"fig_1\"},\"end\":8576,\"start\":8568},{\"attributes\":{\"ref_id\":\"fig_1\"},\"end\":9437,\"start\":9429},{\"attributes\":{\"ref_id\":\"fig_1\"},\"end\":9490,\"start\":9482},{\"attributes\":{\"ref_id\":\"fig_1\"},\"end\":9558,\"start\":9550},{\"attributes\":{\"ref_id\":\"fig_3\"},\"end\":12821,\"start\":12813},{\"attributes\":{\"ref_id\":\"fig_1\"},\"end\":13235,\"start\":13227},{\"attributes\":{\"ref_id\":\"fig_8\"},\"end\":22724,\"start\":22716},{\"attributes\":{\"ref_id\":\"fig_9\"},\"end\":23754,\"start\":23746},{\"attributes\":{\"ref_id\":\"fig_9\"},\"end\":23873,\"start\":23865},{\"attributes\":{\"ref_id\":\"fig_6\"},\"end\":24079,\"start\":24071},{\"end\":29980,\"start\":29972},{\"attributes\":{\"ref_id\":\"fig_12\"},\"end\":37229,\"start\":37221},{\"attributes\":{\"ref_id\":\"fig_9\"},\"end\":37979,\"start\":37971},{\"attributes\":{\"ref_id\":\"fig_9\"},\"end\":38062,\"start\":38054},{\"attributes\":{\"ref_id\":\"fig_9\"},\"end\":38129,\"start\":38121}]", "bib_author_first_name": "[{\"end\":43920,\"start\":43914},{\"end\":43935,\"start\":43931},{\"end\":43949,\"start\":43943},{\"end\":43965,\"start\":43959},{\"end\":44404,\"start\":44397},{\"end\":44422,\"start\":44418},{\"end\":44436,\"start\":44432},{\"end\":44444,\"start\":44441},{\"end\":44460,\"start\":44451},{\"end\":44478,\"start\":44471},{\"end\":44781,\"start\":44777},{\"end\":44795,\"start\":44787},{\"end\":44806,\"start\":44801},{\"end\":44810,\"start\":44807},{\"end\":44822,\"start\":44817},{\"end\":44831,\"start\":44828},{\"end\":44843,\"start\":44836},{\"end\":45536,\"start\":45532},{\"end\":45547,\"start\":45542},{\"end\":45558,\"start\":45553},{\"end\":45562,\"start\":45559},{\"end\":45572,\"start\":45569},{\"end\":45584,\"start\":45577},{\"end\":45598,\"start\":45590},{\"end\":45611,\"start\":45604},{\"end\":46213,\"start\":46207},{\"end\":46224,\"start\":46220},{\"end\":46708,\"start\":46702},{\"end\":46719,\"start\":46715},{\"end\":47110,\"start\":47106},{\"end\":47123,\"start\":47118},{\"end\":47772,\"start\":47763},{\"end\":47788,\"start\":47783},{\"end\":47802,\"start\":47797},{\"end\":48244,\"start\":48236},{\"end\":48476,\"start\":48472},{\"end\":48490,\"start\":48484},{\"end\":48760,\"start\":48755},{\"end\":48771,\"start\":48765},{\"end\":48773,\"start\":48772},{\"end\":48780,\"start\":48779},{\"end\":49012,\"start\":49006},{\"end\":49317,\"start\":49312},{\"end\":49330,\"start\":49322},{\"end\":49342,\"start\":49335},{\"end\":49354,\"start\":49348},{\"end\":50204,\"start\":50203},{\"end\":50220,\"start\":50215},{\"end\":50460,\"start\":50452},{\"end\":50472,\"start\":50468},{\"end\":50485,\"start\":50479},{\"end\":50943,\"start\":50936},{\"end\":50957,\"start\":50951},{\"end\":51490,\"start\":51483},{\"end\":51507,\"start\":51502},{\"end\":51521,\"start\":51516},{\"end\":51926,\"start\":51917},{\"end\":51932,\"start\":51931},{\"end\":51943,\"start\":51939},{\"end\":52130,\"start\":52125},{\"end\":52146,\"start\":52139},{\"end\":52161,\"start\":52156},{\"end\":52612,\"start\":52608},{\"end\":52618,\"start\":52617},{\"end\":52632,\"start\":52629},{\"end\":52643,\"start\":52639},{\"end\":52660,\"start\":52652},{\"end\":53135,\"start\":53131},{\"end\":53144,\"start\":53140},{\"end\":53501,\"start\":53496},{\"end\":53514,\"start\":53511},{\"end\":53525,\"start\":53521},{\"end\":53542,\"start\":53535},{\"end\":53830,\"start\":53824},{\"end\":54220,\"start\":54213},{\"end\":54238,\"start\":54229},{\"end\":54258,\"start\":54254},{\"end\":54976,\"start\":54968},{\"end\":54984,\"start\":54982},{\"end\":54994,\"start\":54991},{\"end\":55004,\"start\":55000},{\"end\":55020,\"start\":55014},{\"end\":55567,\"start\":55560},{\"end\":55579,\"start\":55574},{\"end\":55592,\"start\":55584},{\"end\":55606,\"start\":55598},{\"end\":55618,\"start\":55614},{\"end\":55628,\"start\":55625},{\"end\":56100,\"start\":56093},{\"end\":56112,\"start\":56107},{\"end\":56120,\"start\":56117},{\"end\":56128,\"start\":56127},{\"end\":56141,\"start\":56135},{\"end\":56157,\"start\":56149},{\"end\":56613,\"start\":56608},{\"end\":56624,\"start\":56618},{\"end\":56636,\"start\":56630},{\"end\":56653,\"start\":56646},{\"end\":57011,\"start\":57007},{\"end\":57021,\"start\":57016},{\"end\":57030,\"start\":57027},{\"end\":57040,\"start\":57035},{\"end\":57053,\"start\":57047},{\"end\":57827,\"start\":57822},{\"end\":57840,\"start\":57834},{\"end\":57857,\"start\":57851},{\"end\":57870,\"start\":57864}]", "bib_author_last_name": "[{\"end\":43929,\"start\":43921},{\"end\":43941,\"start\":43936},{\"end\":43957,\"start\":43950},{\"end\":43979,\"start\":43966},{\"end\":44416,\"start\":44405},{\"end\":44430,\"start\":44423},{\"end\":44439,\"start\":44437},{\"end\":44449,\"start\":44445},{\"end\":44469,\"start\":44461},{\"end\":44487,\"start\":44479},{\"end\":44785,\"start\":44782},{\"end\":44799,\"start\":44796},{\"end\":44815,\"start\":44811},{\"end\":44826,\"start\":44823},{\"end\":44834,\"start\":44832},{\"end\":44847,\"start\":44844},{\"end\":45540,\"start\":45537},{\"end\":45551,\"start\":45548},{\"end\":45567,\"start\":45563},{\"end\":45575,\"start\":45573},{\"end\":45588,\"start\":45585},{\"end\":45602,\"start\":45599},{\"end\":45615,\"start\":45612},{\"end\":46218,\"start\":46214},{\"end\":46227,\"start\":46225},{\"end\":46713,\"start\":46709},{\"end\":46722,\"start\":46720},{\"end\":47116,\"start\":47111},{\"end\":47136,\"start\":47124},{\"end\":47447,\"start\":47435},{\"end\":47588,\"start\":47579},{\"end\":47781,\"start\":47773},{\"end\":47795,\"start\":47789},{\"end\":47809,\"start\":47803},{\"end\":48252,\"start\":48245},{\"end\":48482,\"start\":48477},{\"end\":48498,\"start\":48491},{\"end\":48763,\"start\":48761},{\"end\":48777,\"start\":48774},{\"end\":48785,\"start\":48781},{\"end\":48789,\"start\":48787},{\"end\":49019,\"start\":49013},{\"end\":49320,\"start\":49318},{\"end\":49333,\"start\":49331},{\"end\":49346,\"start\":49343},{\"end\":49360,\"start\":49355},{\"end\":50048,\"start\":50042},{\"end\":50213,\"start\":50205},{\"end\":50227,\"start\":50221},{\"end\":50231,\"start\":50229},{\"end\":50466,\"start\":50461},{\"end\":50477,\"start\":50473},{\"end\":50490,\"start\":50486},{\"end\":50949,\"start\":50944},{\"end\":50969,\"start\":50958},{\"end\":51500,\"start\":51491},{\"end\":51514,\"start\":51508},{\"end\":51528,\"start\":51522},{\"end\":51929,\"start\":51927},{\"end\":51937,\"start\":51933},{\"end\":51948,\"start\":51944},{\"end\":51954,\"start\":51950},{\"end\":52137,\"start\":52131},{\"end\":52154,\"start\":52147},{\"end\":52169,\"start\":52162},{\"end\":52615,\"start\":52613},{\"end\":52627,\"start\":52619},{\"end\":52637,\"start\":52633},{\"end\":52650,\"start\":52644},{\"end\":52670,\"start\":52661},{\"end\":52678,\"start\":52672},{\"end\":53138,\"start\":53136},{\"end\":53152,\"start\":53145},{\"end\":53509,\"start\":53502},{\"end\":53519,\"start\":53515},{\"end\":53533,\"start\":53526},{\"end\":53547,\"start\":53543},{\"end\":53838,\"start\":53831},{\"end\":54227,\"start\":54221},{\"end\":54252,\"start\":54239},{\"end\":54273,\"start\":54259},{\"end\":54980,\"start\":54977},{\"end\":54989,\"start\":54985},{\"end\":54998,\"start\":54995},{\"end\":55012,\"start\":55005},{\"end\":55028,\"start\":55021},{\"end\":55572,\"start\":55568},{\"end\":55582,\"start\":55580},{\"end\":55596,\"start\":55593},{\"end\":55612,\"start\":55607},{\"end\":55623,\"start\":55619},{\"end\":55632,\"start\":55629},{\"end\":56105,\"start\":56101},{\"end\":56115,\"start\":56113},{\"end\":56125,\"start\":56121},{\"end\":56133,\"start\":56129},{\"end\":56147,\"start\":56142},{\"end\":56163,\"start\":56158},{\"end\":56168,\"start\":56165},{\"end\":56616,\"start\":56614},{\"end\":56628,\"start\":56625},{\"end\":56644,\"start\":56637},{\"end\":56668,\"start\":56654},{\"end\":56674,\"start\":56670},{\"end\":57014,\"start\":57012},{\"end\":57025,\"start\":57022},{\"end\":57033,\"start\":57031},{\"end\":57045,\"start\":57041},{\"end\":57057,\"start\":57054},{\"end\":57832,\"start\":57828},{\"end\":57849,\"start\":57841},{\"end\":57862,\"start\":57858},{\"end\":57877,\"start\":57871}]", "bib_entry": "[{\"attributes\":{\"id\":\"b0\",\"matched_paper_id\":18018389},\"end\":44292,\"start\":43878},{\"attributes\":{\"id\":\"b1\"},\"end\":44701,\"start\":44294},{\"attributes\":{\"doi\":\"10.1145/3209978.3210129\",\"id\":\"b2\",\"matched_paper_id\":49648997},\"end\":45451,\"start\":44703},{\"attributes\":{\"id\":\"b3\",\"matched_paper_id\":197928508},\"end\":46128,\"start\":45453},{\"attributes\":{\"id\":\"b4\",\"matched_paper_id\":195357326},\"end\":46624,\"start\":46130},{\"attributes\":{\"id\":\"b5\",\"matched_paper_id\":187395259},\"end\":47005,\"start\":46626},{\"attributes\":{\"id\":\"b6\",\"matched_paper_id\":167777368},\"end\":47371,\"start\":47007},{\"attributes\":{\"id\":\"b7\"},\"end\":47577,\"start\":47373},{\"attributes\":{\"id\":\"b8\"},\"end\":47691,\"start\":47579},{\"attributes\":{\"id\":\"b9\",\"matched_paper_id\":220497498},\"end\":48200,\"start\":47693},{\"attributes\":{\"id\":\"b10\",\"matched_paper_id\":117770486},\"end\":48407,\"start\":48202},{\"attributes\":{\"id\":\"b11\",\"matched_paper_id\":15953566},\"end\":48751,\"start\":48409},{\"attributes\":{\"doi\":\"abs/1609.09106\",\"id\":\"b12\"},\"end\":48926,\"start\":48753},{\"attributes\":{\"id\":\"b13\",\"matched_paper_id\":154343308},\"end\":49229,\"start\":48928},{\"attributes\":{\"id\":\"b14\",\"matched_paper_id\":219176775},\"end\":49840,\"start\":49231},{\"attributes\":{\"id\":\"b15\"},\"end\":50015,\"start\":49842},{\"attributes\":{\"id\":\"b16\"},\"end\":50157,\"start\":50017},{\"attributes\":{\"doi\":\"arXiv:1412.6980\",\"id\":\"b17\"},\"end\":50384,\"start\":50159},{\"attributes\":{\"id\":\"b18\",\"matched_paper_id\":14120146},\"end\":50841,\"start\":50386},{\"attributes\":{\"id\":\"b19\",\"matched_paper_id\":170079161},\"end\":51398,\"start\":50843},{\"attributes\":{\"id\":\"b20\",\"matched_paper_id\":55300240},\"end\":51866,\"start\":51400},{\"attributes\":{\"id\":\"b21\"},\"end\":52062,\"start\":51868},{\"attributes\":{\"id\":\"b22\",\"matched_paper_id\":17592006},\"end\":52534,\"start\":52064},{\"attributes\":{\"id\":\"b23\",\"matched_paper_id\":3037243},\"end\":53129,\"start\":52536},{\"attributes\":{\"doi\":\"arXiv:2109.14233\",\"id\":\"b24\"},\"end\":53432,\"start\":53131},{\"attributes\":{\"doi\":\"arXiv:1301.3781\",\"id\":\"b25\"},\"end\":53741,\"start\":53434},{\"attributes\":{\"id\":\"b26\",\"matched_paper_id\":12147181},\"end\":54140,\"start\":53743},{\"attributes\":{\"doi\":\"10.1145/1772690.1772773\",\"id\":\"b27\",\"matched_paper_id\":207178809},\"end\":54870,\"start\":54142},{\"attributes\":{\"id\":\"b28\",\"matched_paper_id\":53036978},\"end\":55480,\"start\":54872},{\"attributes\":{\"id\":\"b29\",\"matched_paper_id\":19100030},\"end\":55983,\"start\":55482},{\"attributes\":{\"id\":\"b30\",\"matched_paper_id\":199466144},\"end\":56606,\"start\":55985},{\"attributes\":{\"doi\":\"arXiv:1901.10430\",\"id\":\"b31\"},\"end\":56947,\"start\":56608},{\"attributes\":{\"doi\":\"10.1145/2911451.2914683\",\"id\":\"b32\",\"matched_paper_id\":2023817},\"end\":57732,\"start\":56949},{\"attributes\":{\"id\":\"b33\",\"matched_paper_id\":42932401},\"end\":58159,\"start\":57734}]", "bib_title": "[{\"end\":43912,\"start\":43878},{\"end\":44775,\"start\":44703},{\"end\":45530,\"start\":45453},{\"end\":46205,\"start\":46130},{\"end\":46700,\"start\":46626},{\"end\":47104,\"start\":47007},{\"end\":47761,\"start\":47693},{\"end\":48234,\"start\":48202},{\"end\":48470,\"start\":48409},{\"end\":49004,\"start\":48928},{\"end\":49310,\"start\":49231},{\"end\":50450,\"start\":50386},{\"end\":50934,\"start\":50843},{\"end\":51481,\"start\":51400},{\"end\":52123,\"start\":52064},{\"end\":52606,\"start\":52536},{\"end\":53822,\"start\":53743},{\"end\":54211,\"start\":54142},{\"end\":54966,\"start\":54872},{\"end\":55558,\"start\":55482},{\"end\":56091,\"start\":55985},{\"end\":57005,\"start\":56949},{\"end\":57820,\"start\":57734}]", "bib_author": "[{\"end\":43931,\"start\":43914},{\"end\":43943,\"start\":43931},{\"end\":43959,\"start\":43943},{\"end\":43981,\"start\":43959},{\"end\":44418,\"start\":44397},{\"end\":44432,\"start\":44418},{\"end\":44441,\"start\":44432},{\"end\":44451,\"start\":44441},{\"end\":44471,\"start\":44451},{\"end\":44489,\"start\":44471},{\"end\":44787,\"start\":44777},{\"end\":44801,\"start\":44787},{\"end\":44817,\"start\":44801},{\"end\":44828,\"start\":44817},{\"end\":44836,\"start\":44828},{\"end\":44849,\"start\":44836},{\"end\":45542,\"start\":45532},{\"end\":45553,\"start\":45542},{\"end\":45569,\"start\":45553},{\"end\":45577,\"start\":45569},{\"end\":45590,\"start\":45577},{\"end\":45604,\"start\":45590},{\"end\":45617,\"start\":45604},{\"end\":46220,\"start\":46207},{\"end\":46229,\"start\":46220},{\"end\":46715,\"start\":46702},{\"end\":46724,\"start\":46715},{\"end\":47118,\"start\":47106},{\"end\":47138,\"start\":47118},{\"end\":47449,\"start\":47435},{\"end\":47590,\"start\":47579},{\"end\":47783,\"start\":47763},{\"end\":47797,\"start\":47783},{\"end\":47811,\"start\":47797},{\"end\":48254,\"start\":48236},{\"end\":48484,\"start\":48472},{\"end\":48500,\"start\":48484},{\"end\":48765,\"start\":48755},{\"end\":48779,\"start\":48765},{\"end\":48787,\"start\":48779},{\"end\":48791,\"start\":48787},{\"end\":49021,\"start\":49006},{\"end\":49322,\"start\":49312},{\"end\":49335,\"start\":49322},{\"end\":49348,\"start\":49335},{\"end\":49362,\"start\":49348},{\"end\":50050,\"start\":50042},{\"end\":50215,\"start\":50203},{\"end\":50229,\"start\":50215},{\"end\":50233,\"start\":50229},{\"end\":50468,\"start\":50452},{\"end\":50479,\"start\":50468},{\"end\":50492,\"start\":50479},{\"end\":50951,\"start\":50936},{\"end\":50971,\"start\":50951},{\"end\":51502,\"start\":51483},{\"end\":51516,\"start\":51502},{\"end\":51530,\"start\":51516},{\"end\":51931,\"start\":51917},{\"end\":51939,\"start\":51931},{\"end\":51950,\"start\":51939},{\"end\":51956,\"start\":51950},{\"end\":52139,\"start\":52125},{\"end\":52156,\"start\":52139},{\"end\":52171,\"start\":52156},{\"end\":52617,\"start\":52608},{\"end\":52629,\"start\":52617},{\"end\":52639,\"start\":52629},{\"end\":52652,\"start\":52639},{\"end\":52672,\"start\":52652},{\"end\":52680,\"start\":52672},{\"end\":53140,\"start\":53131},{\"end\":53154,\"start\":53140},{\"end\":53511,\"start\":53496},{\"end\":53521,\"start\":53511},{\"end\":53535,\"start\":53521},{\"end\":53549,\"start\":53535},{\"end\":53840,\"start\":53824},{\"end\":54229,\"start\":54213},{\"end\":54254,\"start\":54229},{\"end\":54275,\"start\":54254},{\"end\":54982,\"start\":54968},{\"end\":54991,\"start\":54982},{\"end\":55000,\"start\":54991},{\"end\":55014,\"start\":55000},{\"end\":55030,\"start\":55014},{\"end\":55574,\"start\":55560},{\"end\":55584,\"start\":55574},{\"end\":55598,\"start\":55584},{\"end\":55614,\"start\":55598},{\"end\":55625,\"start\":55614},{\"end\":55634,\"start\":55625},{\"end\":56107,\"start\":56093},{\"end\":56117,\"start\":56107},{\"end\":56127,\"start\":56117},{\"end\":56135,\"start\":56127},{\"end\":56149,\"start\":56135},{\"end\":56165,\"start\":56149},{\"end\":56170,\"start\":56165},{\"end\":56618,\"start\":56608},{\"end\":56630,\"start\":56618},{\"end\":56646,\"start\":56630},{\"end\":56670,\"start\":56646},{\"end\":56676,\"start\":56670},{\"end\":57016,\"start\":57007},{\"end\":57027,\"start\":57016},{\"end\":57035,\"start\":57027},{\"end\":57047,\"start\":57035},{\"end\":57059,\"start\":57047},{\"end\":57834,\"start\":57822},{\"end\":57851,\"start\":57834},{\"end\":57864,\"start\":57851},{\"end\":57879,\"start\":57864}]", "bib_venue": "[{\"end\":44100,\"start\":44049},{\"end\":45005,\"start\":44968},{\"end\":45826,\"start\":45730},{\"end\":46406,\"start\":46326},{\"end\":47972,\"start\":47900},{\"end\":49571,\"start\":49475},{\"end\":50633,\"start\":50571},{\"end\":51150,\"start\":51069},{\"end\":52322,\"start\":52255},{\"end\":52863,\"start\":52780},{\"end\":54464,\"start\":54366},{\"end\":55201,\"start\":55124},{\"end\":55743,\"start\":55697},{\"end\":57321,\"start\":57195},{\"end\":44047,\"start\":43981},{\"end\":44395,\"start\":44294},{\"end\":44966,\"start\":44872},{\"end\":45728,\"start\":45617},{\"end\":46324,\"start\":46229},{\"end\":46780,\"start\":46724},{\"end\":47169,\"start\":47138},{\"end\":47433,\"start\":47373},{\"end\":47610,\"start\":47590},{\"end\":47898,\"start\":47811},{\"end\":48287,\"start\":48254},{\"end\":48563,\"start\":48500},{\"end\":49062,\"start\":49021},{\"end\":49473,\"start\":49362},{\"end\":49887,\"start\":49842},{\"end\":50040,\"start\":50017},{\"end\":50201,\"start\":50159},{\"end\":50569,\"start\":50492},{\"end\":51067,\"start\":50971},{\"end\":51568,\"start\":51530},{\"end\":51915,\"start\":51868},{\"end\":52253,\"start\":52171},{\"end\":52778,\"start\":52680},{\"end\":53261,\"start\":53170},{\"end\":53494,\"start\":53434},{\"end\":53926,\"start\":53840},{\"end\":54364,\"start\":54298},{\"end\":55122,\"start\":55030},{\"end\":55695,\"start\":55634},{\"end\":56287,\"start\":56170},{\"end\":56752,\"start\":56692},{\"end\":57193,\"start\":57082},{\"end\":57926,\"start\":57879}]"}}}, "year": 2023, "month": 12, "day": 17}