{"id": 252873629, "updated": "2023-10-05 09:55:32.309", "metadata": {"title": "A Stream Learning Approach for Real-Time Identification of False Data Injection Attacks in Cyber-Physical Power Systems", "authors": "[{\"first\":\"Ehsan\",\"last\":\"Hallaji\",\"middle\":[]},{\"first\":\"Roozbeh\",\"last\":\"Razavi-Far\",\"middle\":[]},{\"first\":\"Meng\",\"last\":\"Wang\",\"middle\":[]},{\"first\":\"Mehrdad\",\"last\":\"Saif\",\"middle\":[]},{\"first\":\"Bruce\",\"last\":\"Fardanesh\",\"middle\":[]}]", "venue": "IEEE Transactions on Information Forensics and Security, vol. 17, pp. 3934-3945, 2022", "journal": null, "publication_date": {"year": 2022, "month": null, "day": null}, "abstract": "This paper presents a novel data-driven framework to aid in system state estimation when the power system is under unobservable false data injection attacks. The proposed framework dynamically detects and classifies false data injection attacks. Then, it retrieves the control signal using the acquired information. This process is accomplished in three main modules, with novel designs, for detection, classification, and control signal retrieval. The detection module monitors historical changes in phasor measurements and captures any deviation pattern caused by an attack on a complex plane. This approach can help to reveal characteristics of the attacks including the direction, magnitude, and ratio of the injected false data. Using this information, the signal retrieval module can easily recover the original control signal and remove the injected false data. Further information regarding the attack type can be obtained through the classifier module. The proposed ensemble learner is compatible with harsh learning conditions including the lack of labeled data, concept drift, concept evolution, recurring classes, and independence from external updates. The proposed novel classifier can dynamically learn from data and classify attacks under all these harsh learning conditions. The introduced framework is evaluated w.r.t. real-world data captured from the Central New York Power System. The obtained results indicate the efficacy and stability of the proposed framework.", "fields_of_study": "[\"Computer Science\",\"Engineering\"]", "external_ids": {"arxiv": "2210.06729", "mag": null, "acl": null, "pubmed": null, "pubmedcentral": null, "dblp": "journals/tifs/HallajiRWSF22", "doi": "10.1109/tifs.2022.3216948"}}, "content": {"source": {"pdf_hash": "42f1d2f7c7f1fb1ef7498a1864ce0007b2758ffc", "pdf_src": "Arxiv", "pdf_uri": "[\"https://export.arxiv.org/pdf/2210.06729v1.pdf\"]", "oa_url_match": false, "oa_info": null}, "grobid": {"id": "9f0e9eb35744cde211d3c5988f78ae7f7b8b5da8", "type": "plain-text", "url": "s3://ai2-s2-pdf-extraction-prod/parse-results/s2orc_worker/42f1d2f7c7f1fb1ef7498a1864ce0007b2758ffc.txt", "contents": "\nIEEE TRANSACTIONS ON INFORMATION FORENSICS AND SECURITY 1 A Stream Learning Approach for Real-Time Identification of False Data Injection Attacks in Cyber-Physical Power Systems\n\n\nGraduate Student Member, IEEEEhsan Hallaji \nSenior Member, IEEERoozbeh Razavi-Far \nMember, IEEE, Mehrdad Saif, Senior Member, IEEEMeng Wang \nFellow, IEEEBruce Fardanesh \nIEEE TRANSACTIONS ON INFORMATION FORENSICS AND SECURITY 1 A Stream Learning Approach for Real-Time Identification of False Data Injection Attacks in Cyber-Physical Power Systems\nIndex Terms-Attack identificationfalse data injectionun- observable attackspower systemscyber-physical systemssta- tistical learningchange detectionnon-stationary environments\nThis paper presents a novel data-driven framework to aid in system state estimation when the power system is under unobservable false data injection attacks. The proposed framework dynamically detects and classifies false data injection attacks. Then, it retrieves the control signal using the acquired information. This process is accomplished in three main modules, with novel designs, for detection, classification, and control signal retrieval. The detection module monitors historical changes in phasor measurements and captures any deviation pattern caused by an attack on a complex plane. This approach can help to reveal characteristics of the attacks including the direction, magnitude, and ratio of the injected false data. Using this information, the signal retrieval module can easily recover the original control signal and remove the injected false data. Further information regarding the attack type can be obtained through the classifier module. The proposed ensemble learner is compatible with harsh learning conditions including the lack of labeled data, concept drift, concept evolution, recurring classes, and independence from external updates. The proposed novel classifier can dynamically learn from data and classify attacks under all these harsh learning conditions. The introduced framework is evaluated w.r.t. real-world data captured from the Central New York Power System. The obtained results indicate the efficacy and stability of the proposed framework.\n\nthe obtained phasor measurements and prevent the control system to correctly estimate the system state. This can, in turn, cause a malfunction that entails potentially catastrophic consequences [3], [4].\n\nAlthough various approaches can be used to enhance the security of the power networks, they may not ideally replace a robust Intrusion Detection System (IDS). For instance, encryption does not always guarantee the safety of the system, and grid hardening may not be applicable to large-scale power systems [5], [6]. Although various approaches are available for eliminating security issues in power systems, not all of them can cope with the unobservable FDI attacks. Such attacks manipulate multiple phasor measurements and deceive the control system by bypassing the bad data detectors. These FDI attacks are called unobservable since the system is no longer observable if the affected measurements are removed [5], [6]. Perhaps, unobservable attacks can be considered as the most challenging type of cyber data attacks [6]. System state estimation under unobservable FDI attacks requires a robust IDS to ensure the safe operation of the control system. Despite numerous efforts dedicated to addressing this problem, finding a comprehensive design for an IDS is still very challenging.\n\nThe available solutions for handling unobservable FDI attacks in power systems generally fall under two categories of matrix decomposition and statistical learning. The former models the problem as a type of matrix decomposition process [5]- [7]. Devising matrix decomposition can facilitate the injected error estimation and the control signal retrieval through solving an optimization problem. However, the performance is usually dependent on the sparsity of attacks [5]. Another approach with more generalization ability is reformulating the intrusion detection problem from the perspective of statistical learning [1], [8], [9]. Using this technique, one can find the relationships between data samples w.r.t. different states such as normal and under attack. Statistical learning can also facilitate the classification of different types of data attacks, which can be informative for taking the right action when the system is under attack.\n\nOn the other hand, FDI attack detection and classification using data-driven approaches is followed by a number of challenges. To begin with, multi-class classification is the most common problem that is well studied in the literature [10], [11]. Tackling with insufficient labeled samples is another obstacle, which has been recently addressed by means of semisupervised learning [10]- [12]. However, most of these studies consider a stationary environment, in which the feature space remains intact. This is while streaming phasor measurements in a power system resemble a non-stationary environment, where different factors such as system events and intrusions can alter the feature space. Such changes can be generally categorized into three types, namely concept drift [13], [14], concept evolution [14] and reoccurring classes [15]. In nonstationary environments, the primary step is to detect any changes and anomalies in the data stream. The classification model can then be adapted to the detected changes using adaptive algorithms [13], [16]. Besides, most of the available solutions rely on external updates for adaptation, which is impractical in our case study. Each of the aforementioned problems, in both stationary and non-stationary environments, requires a different solution. Unfortunately, these problems are rarely addressed simultaneously for handling unobservable FDI attacks in power systems.\n\nThe aim of this work is to design a novel data-driven framework that aids in system state estimation, when the power system is under unobservable FDI attacks. In this process, we mainly rely on data mining and try to overcome all the aforementioned challenges for this approach. The proposed framework consists of three main modules, namely detection, classification, and control signal retrieval. The first module initially detects any unobservable FDI attacks and passes them to the attack classifier. The classification module then determines the type of these attacks. The last module retrieves the control signal and passes it to the control unit, using the patterns that have been captured by the other modules. Multiple challenges have been tackled in the design of the proposed framework including anomaly detection based on the historical behavior of the signal, extraction of attack patterns from the complex signals, scarce labeled data, concept drift, concept evolution, recurring classes, and fast signal retrieval.\n\nThe main contribution of this work is threefold: updates.\n\n3) The introduced signal retrieval method, that is used within ORIGIN, is also unique to this algorithm. It dynamically computes and removes the injected error from the control signal, in a sample-by-sample manner. Moreover, we evaluate the proposed methods by enabling a comparative study on real-world data, collected from the Central New York Power System (CNYPS). The remainder of this paper is organized as follows: Section II contains the background for this work. Section III explains the proposed framework. Experimental results are analyzed in Section IV. Finally, the paper is concluded in Section V.\n\n\nII. BACKGROUND\n\nHere, we initially explain the considered problem and the selected case study. Then, the additional challenges of our case study, which resembles a non-stationary environment, and available methods to address them are elaborated. Fig. 1 shows the structure of the CNYPS, on which the phasor measurement unit (PMU) data has been recorded and used in this work [6]. Assuming that an intruder has partial knowledge of this system, data attacks can be planned by corrupting multiple PMU measurements. Failure to detect these attacks prevents the prompt retrieval of the control signal. This results in the malfunction of the control system.\n\n\nA. Problem Statement\n\nMost of cyber data attacks are usually in the form of FDI attacks [7], [17]. Among various types of data attacks, unobservable FDI attacks are often known as the most challenging ones since they can bypass the bad data detectors (BDD) and manipulate the the control unit [6]. In order to make the FDI attack unobservable to the BDD, the intruder must have at least partial knowledge of the system. Generally we assume that the attacker has control over a set of measurements and knows the network topology (at least partially). Appendix 1 formally explains how unobservable FDI attacks can bypass conventional, or residue-based, BDD. Unobservable attacks are particularly based on a corruption matrix C, which represents the additive error to the targeted bus voltages due to data attacks. Thus, an accurate IDS is necessary to know when the control signal misleads the control system. Once an attack is detected, a control signal retrieval process should be initiated to make the power system observable again.\n\nAlthough a proper IDS and control signal retrieval scheme may usually guarantee the safe operation of the control unit, having more information about the strategy of the unobservable FDI attacks can help further secure the network. This means that detected unobservable attacks need to be classified into different categories in order to clarify the intention of an intruder. For instance, repetitious attacks with similar patterns indicate an intruder has targeted a specific component of the network, and, thus, security protocols need to be enhanced for the respective component.\n\nHence, a threefold problem is addressed in this paper: a) unobservable FDI attack detection; b) classification of the detected attacks in non-stationary environments; and c) control signal retrieval. This is while the classification in a nonstationary environment, similar to that of CNYPS, has multiple additional challenges, that further complicate this process. These challenges are explained in the following subsection.\n\n\nB. Dynamic State Estimation\n\nA common trend often seen in the literature is to consider the steady state model in the design of monitoring applications at the control center of power systems [18], [19]. However, power systems rarely operate in a stationary or steady-state condition due to the stochastic variations in demand and generation. Therefore, this assumption becomes problematic since approaches using static state estimation cannot capture system dynamics in non-stationary environments [20]. To address this issue, dynamic state estimation methods emerged and new monitoring tools were proposed in the wake of them [21], [22]. Dynamic state estimation enables capturing the history of dynamic events in power systems, which in turn facilitates the understanding and analysis of the behaviour, performance, and control decisions of the system.\n\n\nC. Model-based Approaches\n\nDynamic state estimation using model-based methods requires the mathematical system model to be available. These methods usually apply estimation techniques to observe the state of a system and detect cyber-attacks based on analytical redundancies [23]. Observer-based methods can be categorized into three groups, namely Kalman filtering [21], observerbased methods [24], [25], and sliding mode observation [26].\n\nKalman filtering techniques devise a state-space model and can employ an optimal recursive algorithm by means of previously estimated states and previous measurements. These techniques can accurately estimate the state vectors and are computationally inexpensive [21]. Despite the effectiveness of Kalman filtering, they may not apply to some cases since they assume system and observation models equations are both linear. It is worth mentioning that the non-linear extension of Kalman filter is not often as optimal as the linear version. Moreover, it assumes that the state belief is Gaussian distributed.\n\nObserver-based methods usually estimate the state of system by means of a deterministic state-space mathematical model [23]. For instance, an methodology is proposed in [27] for mitigating FDI attacks by considering unknown nonlinear constant power loads. This nonlinear and adaptive observerbased method also takes uncertainty, noise, and unobservable states into account. [28] proposes an unknown input observer to detect FDI attacks by means of its residuals. A residual threshold is then considered to adaptively monitor the effect of disturbance. An unknown input interval observer-based approach is also designed in [29] to defend against FDI attacks. The proposed method is a global detection algorithm and works based on the interval residuals. The main problem of observer-based methods is that the convergence and stability of closed-loop control system must be assured for all operating space. However, in control of non-linear systems these conditions are validated only locally or they are dependent of some hypothesis which reduce its effectiveness in real applications.\n\nSliding mode techniques are non-linear and devise a statespace model for estimating the state on a manifold w.r.t. estimated error and state trajectories. State estimation under this category comes with several benefits, including ease of use, disturbance rejection, and robustness [30], [31]. On the negative side, such methods may excite unmodeled dynamics and cause chattering. Therefore, instrumental damages and energy loss can take place in case of high-frequency switching around the sliding surface [30].\n\n\nD. Intelligent Data-driven Approaches\n\nAs opposed to model-based techniques, intelligent datadriven methods are able to operate without any prior knowledge regarding the physics of the system, and the mathematical system model is not required [32]- [34]. System state estimation using cyber-secure data-driven techniques mainly involves a classification task, which facilitates the detection of FDI attacks and the decision making process. Although intelligent methods for FDI detection and state estimation are have shown outstanding performance and flexibility in the literature, their main drawbacks are usually the assumption of a stationary environment or the high computational cost in non-stationary environments, where real-time model updating is required. However, this can be potentially addressed via an efficient design, and, thus, extensive research endeavours have been dedicated to address this issue [14], [15], [35].\n\n\nE. Challenges of Non-stationary Environments\n\nThe classification procedure is often performed in a static manner, where a classification model is firstly constructed offline and, then, used in a dynamic environment. This setting works well for stationary environments, where the data flow resembles a feature space similar to that of the constructed model. However, in the intrusion detection problem, an intrusion may bring about unexpected anomalies in the upcoming data, whether gradually or abruptly, which alter the mapping between the input samples and class labels. This will consequently deteriorates the performance of the trained model, as it cannot interpret the new data generating process. This phenomenon is known as concept drift. Note that the standard  i.i.d. assumptions do not hold anymore in non-stationary data steams.\n\nAnother issue of concern is the presence of new classes of attacks in the network. The presence of a new class in feature space is also referred to as concept evolution [14], [15]. Failure to detect new classes of attacks results in misclassifying attack patterns and generation of incorrect information. Various research efforts have been dedicated to the realtime classification in non-stationary environments [13], [14]. The problem has been adequately addressed in these works; however, they are not designed to handle reoccurring classes. This means that if a class of attack is absent for a while, the dynamic classification model will forget that class, and it will be detected as a new class when it reoccurs. This problem may be eliminated by resorting to an active learning setting [36], in which a request for an external update is sent to an operator whenever an algorithm cannot decide confidently about a sample. Nevertheless, dependency to human experts for the intrusion detection is a time consuming and expensive task.\n\nA more realistic approach is then presented in [15], called Class-based ensemble (CLAM), which relies on periodical updates rather than waiting for an operator response. It uses an ensemble of one-class classifiers that models clusters of data by means of their centroid and radius. CLAM detects new classes using silhouette coefficients and updates the classification model. Stream Classifier And Novel and Recurring class detector (SCANR) [37] is another algorithm proposed for addressing concept evolution and recurring class, which uses the same approach as CLAM for modelling the data clusters. However, it makes use of a primary ensemble for classification and an auxiliary ensemble for detecting recurring classes.\n\nAlthough CLAM and SCANR address most of the aforementioned challenges, there are still a few factors that limit their use for the application of intrusion detection. To begin with, dependency on human-generated periodical updates is not preferable for this application since an attack should be isolated as soon as it is detected. Secondly, relying only on cluster-based modeling may not be the best strategy for cases such as PMU data, in which samples are presented using complex numbers. These issues motivated us to propose ICON especially for unobservable FDI attack classification, which can address all the aforementioned problems independently. Note that many classifiers that use computationally expensive approaches, e.g., deep learning, are not compatible with this case study, as they cannot be rapidly retrained or updated.\n\n\nIII. DESIGN OF THE INTRUSION DETECTION AND CLASSIFICATION SYSTEM\n\nHere, we formally explain the the proposed framework, which is also detailed in Algorithm 1 and illustrated in Fig.  2. Supposing that data is being captured through a set of PMUs p = {P 1 , P 2 , ..., P ς }, each PMU P contains ϑ channels resulting in a data matrix M ∈ C n×ϑ , where n is the number of samples.\n\n\nA. Dynamic Intrusion Detection using ORIGIN\n\nAssuming that M j represents the j-th column of M ,\nM j = {z i } n i=1 , where z i ∈ C.\nFor a set of points in a sliding window W = {z 1 , z 2 , ..., z ω }, where ω < n, a circle can be algebraically fitted to W . Considering the algebraic \n1 Initialize FIFO queue Q = ∅. 2 Set intrusion detection flag F = F alse. 3 Set counter j = 1.\nTraining: 4 Compute c 0 on P 0 using Equations (13)- (17).\n\nTesting: 5 while P do 6 Update the sliding window W t = P (r), j ≤ r < j + ω. Computeĉ t on W t using Equations (13)-(17).\n8 j = j + 1. 9 d t = c 0 −ĉ t . 10 Update FIFO queue Q ← d t . 11 if d t > δ ∧ Card(Q) = τ then 12\nSet intrusion detection flag on F = T rue. 13 Create an attack sample α t = Q.\n\n14 Call the attack classifier h t = ICON(α t ). 15 ∀α t compute M rj using Equation (5) to retrieve the control signal S. 16 end if 17 end while representation of a circle F (x) = 0 for a set of coordinate vectors x ∈ W , where x consists of real and imaginary parts of samples in W , an algebraic fit is attained by determining the parameters of this equation w.r.t. least-squares. By doing so, the estimated circular path via the least-square fitting reflects the historical changes in the dynamic system, where older samples locate at the end of this window, and vice versa.\n\nAssumption 1: Given that a center c 0 = [x 0 , y 0 ] can be estimated by fitting a circle to training samples P 0 with n 0 samples (see Fig. 2.a), it is assumed that when the system is not under attack or injected error e = 0 then c 0 − c t ≤ δ, where c t is the estimated centers w.r.t. the sliding window W t at time t, and δ is a threshold indicating the degree of center deviation when e = 0.\n\nIntrusion detection can then be performed based on the following proposition, which is proved in the Appendix 2 of this paper.\n\nProposition 1: The presence of an unobservable FDI attack at time t, when e t > δ , is sufficient to deviate c t in an extent that exceeds the threshold δ.\n\nThus, we first create a model using the original center c 0 in the training set (Line 4 in Algorithm 1). Then, at each timestep t, the sliding window W t moves on the incoming data (see Fig. 2.b), andĉ t is computed on the current window (Line 6 and 7 in Algorithm 1). After computing the deviation d t between these two coordinates, it is added to a First-In-First-Out (FIFO) queue Q (Lines 9 and 10 in algorithm 1). Once Q reaches its capacity, an intrusion is being detected any time d t > δ (Lines 10 and 11 in Algorithm 1). Thereafter, Q is exported as an attack sample and sent to the attack classifier module, which will be explained shortly, and the control signal is retrieved afterwards (Lines 13-15 in Algorithm 1).\n\n\nB. Online Modeling of Attack Patterns in ORIGIN\n\nIn order to classify the detected attack, the model needs to capture of the changes each type of unobservable FDI attack makes in the system. For instance, the injected errors can increase or decrease the signal magnitude, with various ratios. Thus, variations of unobservable FDI attack create unique patterns in the PMU signal based on these variables. Henceforth, we refer to these historical patterns as attack patterns.\n\nOnce an attack is detected, the attack pattern should be modeled properly in order to create a set of useful samples for attack classification. To do so, a FIFO queue Q is considered with a constant size τ (see Fig. 2\n.b). At each time-step t, a scalar d t = c 0 −ĉ t is stored in Q. When Card(Q) = τ ,\nwhere Card(·) gives the cardinality of a set, an attack pattern α is given by extracting the sequence in Q (Line 14 in Algorithm 1). This pattern shows the deviation of c t over time (see Fig.  2.a). These generated samples, or attack patterns, are then fed to the attack classification module, for which variant attack patterns are indicators of different classes.\n\n\nC. Real-Time Attack Classification via ICON\n\nInitially, an offline training phase is performed to create a base model for attack classification (Line 3-8 in Algorithm 2). Afterwards, the model keeps getting updated automatically during the attack classification, if needed.\n\nFirstly, an empty ensemble E = ∅ is initialized (Line 1 in Algorithm 2). For a set of training samples X 0 = {α 1 , α 2 , ..., α n0 }, α 1 is selected to create the first class ε 1 (Line 2 in Algorithm 2). For α r , 2 < r ≤ n 0 , the crosscorrelation of α r and ε j ∈ E, where 1 ≤ j ≤ ν t and ν t is the number of classes until time t, is computed (Line 4 in Algorithm 2). We consider the symmetry of this crosscorrelation as the similarity measure:\nΞ rj (m) =    N −m−1 i=0 α r (i + m)ε * j (i), m ≥ 0. Ξ * jr (−m), m < 0. ,(1)\nwhere the asterisk indicates complex conjugation, (·) is used for indexing on a sequence, and N is the length of the pattern in α r and ε j . Then, the output vector ρ is resulted from Ξ ∈ R 1×N 2 , where ρ i = Ξ rj (m − N ) and 1 ≤ m ≤ 2N − 1, m ∈ N (Line 5 in Algorithm 2). The similarity measure υ is then calculated (Line 6 in Algorithm 2) as follows:\nυ = κ i=1 ρ i − 2N −1 i=κ+1 ρ i , κ = Card(ρ) 2 .(2)\nAlgorithm 2: ICON Input: Attack sample α t , sensitivity parameter γ.\n\n\nOutput:\n\nAttack classification result h t . Definition: X 0 is the training set, ← inserts into a FIFO queue, Label(·) returns the label. Initialization: 1 Initialize an empty ensemble E = ∅. 2 Initialize first class-memory ε 1 = α 1 .\n\nTraining: 3 for ∀α r , 2 ≤ r ≤ n 0 do 4 Compute Ξ rj (m) using Equation (1).\n5 ρ r = Ξ rj (m − N ), 1 ≤ m ≤ 2N − 1 ∧ m ∈ N. 6\nCalculate similarity measure υ using Equation (2). 7 Update E 0 using Equation (3). 8 \n\n\nend for\n\nTesting: A parameter γ ∈ R + is then considered to adjust the sensitivity of the classifier. By this mean, ∀α r ∈ X 0 :\n9 while X t = ∅ do 10 E t = E t−1 . 11 if υ > γ then 12 h t = Label(ε new ). 13 E t ∪ ε new : ε new = α i . 14 else 15 h t = Label(ε i ). 16 if Card(ε i ) < λ then 17 ε i = ε i ∪ α i : ε i ∈ E t . 18 else 19 ε i = {ε i α out } ∪ α i : ε i ∈ E t .         E 0 ∪ ε new : ε new = α r , υ > γ. ε i = ε i ∪ α r : ε i ∈ E 0 , υ ≤ γ ∧ Card(ε i ) < λ. ε i = {ε i α out } , υ ≤ γ ∧ Card(ε i ) ≥ λ. ∪ α r : ε i ∈ E 0 ,(3)\nwhere λ is the memory size of each class model ε, ε new denotes to a new model for a new class, and α out ∈ ε i is the oldest pattern in the class model (Line 7 in Algorithm 2).\n\nOnce the ensemble is trained, it can operate by receiving new samples. At each time-step t, E t − 1 is used to start the classification (Line 10 in Algorithm 2). Then, similar to Equation (3), if a new class is detected, a new-class label is assigned to the attack sample and a new model is assigned to it before updating E t (Lines 11-13 in Algorithm 2). Otherwise, the detected attack is classified under its most similar class of attack and the associated class-memory will be updated (Lines 14-21 in Algorithm 2). Finally, the classification result will be returned to ORIGIN.\n\n\nD. Control Signal Retrieval\n\nOnce the attack sample is classified, the original phasor measurement can be estimated as in the following:\n∀α r : M rj = x r − 1 τ τ ι=1 d ι cos tan −1 x t y t + i y r − 1 τ τ ι=1 d ι sin tan −1 x t y t ,(4)\nwhich can be further simplified to the following form:\nM rj = x r + iy r − 1 τ √ 1 + θ 2 τ ι=1 d ι (1 + iθ 2 ),(5)\nwhere θ = x t /y t . Therefore, the control signal is retrieved in a sample by sample manner and without delay. This is mainly due to the usage of overlapping windows. In other words, when a new sample arrives, W t moves forward for one sample. However, in Fig. 2.b windows are merely shown for non-overlapping parts of the signal for the sake of simplicity. While the proposed framework is compatible with all power systems, there are a few points to be considered for optimal adaptation to different systems. Firstly, the ORIGIN method requires the input data to be in the form of sinusoidal waveforms (e.g., PMU signal). Secondly, for each selected PMU, the δ and γ parameters should be adjusted for ORIGIN and ICON, respectively.\n\n\nIV. EXPERIMENTAL RESULTS\n\nWe first describe the captured PMU data and the designed scenarios. Then the experimental setting is explained prior to the analysis of results.\n\n\nA. PMU Data and Scenarios\n\nIn this work, we use real-world PMU data that were recorded through the CNYPS. The data is captured within a 20-s period with a 30 Hz sampling rate resulting in 600 samples. Six PMUs are used for this purpose, which contain 37 channels in total. Here, four scenarios are designed in which the intruder select different numbers of PMUs and channels are selected to launch unobservable FDI attacks, as listed in Table I. Table I also shows the phasor measurements for both voltage and current in each scenario. In this data, an event (i.e., a slip in a generator) takes place around two seconds, which is observable in Fig. 3.\n\nIn order to simulate longer scenarios, the described data has been repeated for thirty cycles. The unobservable attacks are then injected to the data numerically through the corrpution matrix C (see Appendix 1). There are different approaches to achieve C. For instance, [6] formulates C randomly selecting column supports and fills non-zero values with Gaussian noise. [38] uses a diagonal full-rank matrix in which indices corresponding to the targeted buses will be replaced with the exponent of the product of the index and a scalar. times the column index of the targeted bus. Similarly, our work uses the replacement of indices of C that correspond to the targeted buses w.r.t. the network topology. Four different strategies are  considered for attempting an unobservable attack to the power system, as shown in Fig. 4. The first strategy contains only additive errors (see Fig. 4.a), while the second one consists of deductive errors (see Fig. 4.b). The last two strategies, on the other hand, blend both additive and deductive classes of attack listed in Table II. As illustrated in Fig. 4.c, the third strategy increases the error magnitude equally for additive and deductive errors, whereas in the last one the error magnitude increases for each class of attack regardless of the error type (see Fig. 4.d).\n\n\nB. Experimental Setting\n\nAll experiments are conducted within a 10-fold stratified cross-validation procedure, which consists of an inner and an outer loop. The outer loop keeps one fold for testing and the rest for the training, while the inner loop performs another cross-validation procedure on the training folds to find the optimal parameters. CLAM, SCANR, and Fast-COMPOSE [35] are provided with periodical updates, as it is required by them, since their performance would decrease drastically without updates.\n\n\nC. Results Analysis\n\nThe results are reported and analyzed separately for each module.\n\n1) Intrusion Detection: Table III shows the result of attack detection of ORIGIN and the matrix decomposition approach (DM) over four different scenarios. Overall accuracy, precision, and recall (i.e., sensitivity) are used as performance measures in this work, as listed in Table III.   0  50  100  150  200  250  300  350  400  450  500  550   The reported recall values in Table III indicate the high sensitivity of ORIGIN to the presence of unobservable attacks. The attained precision values, on the other hand, display high true positive prediction rates, which imply a very low percentage of false alarms for the intrusion detection module. ORIGIN outperforms DM w.r.t. any of the considered performance  measures.\n\nCompared to ORIGIN, the main disadvantage of the traditional detectors that are based on the MD process is that their performance is highly bound to the sparsity of the attacks. In other words, as the number of channels under attack increases, the success rate of these detectors is more likely to deteriorate. For instance, [6] uses a DM-based detection approach. While this method has shown somewhat acceptable robustness against moderate sparsity on the NYPS case study, its performance drops for high degrees of sparsity. Table III clearly shows this issue for scenarios one to four, in which 47, 60, 65, and 82 percent of the channels are under attack, respectively. In contrast, ORIGIN is completely robust against the sparsity of attacks and does not show any sensitivity in this sense.\n\n2) Attack Classification: Fig. 5 clarifies the intention behind using the symmetry of cross-correlation sequence as a similarity measures for comparing generated attack samples. It can be seen that the more a pair of samples are similar (see Fig. 5.a) the more symmetry is attained, and vice versa (see   Fig. 6 shows the result of the cross-validation for attack classification in each scenario. Considering the distribution of obtained accuracies by each algorithm, it can be inferred that ICON is the most stable method among the others. Moreover, the average accuracy of ICON, denoted by a solid square in Fig. 6, is always higher than CLAM, SCANR, and Fast-COMPOSE. This is while CLAM is ranked second in terms of accuracy and stability. However, the stability difference between CLAM and SCANR is negligible, and Fast-COMPOSE is ranked as fourth.\n\nA more detailed report about the achieved performance measures for the conducted experiments can be found in Table IV. Looking into the resulted accuracies, ICON shows superior performance for the task of attack classification, and it is ranked as first. Moreover, precision and recall values in Table IV indicate higher sensitivity of ICON to all classes of unobservable FDI attacks in the designed scenarios. This is while, CLAM, SCANR, and Fast-COMPOSE are ranked from second to fourth, respectively.\n\nSo far, the experiments were based on the CNYPS dataset, which was a collection of real-world PMU signals. In order to further complicate the classification task for the classifiers and the detector, we additionally add independent Gaussian noise N (0, σ 2 ) to half of the columns in each scenario, where the noise degree σ changes from 5 to 25 percents. Fig. 8 shows the averaged accuracy of classifiers over different scenarios and noise ratios. Changes in the color spectrum of each column indicates the sensitivity of accuracy performance to σ. As expected, Fig. 8 shows that the injected noise degrades the performance. However, ICON exhibits superior robustness against the added noise compared to the rest of the data-driven methods. The same pattern can be observed for precision and recall in Fig. 9 and Fig. 10, respectively. Interestingly, the ranking among the selected classifiers is similar to cases without Gaussian noise, and previous conclusions also hold for this analysis. 3) Signal Retrieval: Fig. 7 compares the outcome of signal retrieval procedure with the original and the disrupted control signals. To evaluate the retrieved signal, we compute the root mean square error (RMSE) for each channel of the PMU data. The averaged RMSE values for each scenario are shown in Fig. 11. The attained results indicate promising performance for signal retrieval over all scenarios. Moreover, the difference between noiseless and noisy cases are negligible.\n\nApparently, when unobservable FDI attacks change the signal magnitude with a slower rate, they are more difficult to deal with, and vice versa. For instance, within the 1:150s time interval, the unobservable attack slightly changes the signal magnitude in all scenarios (see Fig. 4), whereas changes are more noticeable during the 451:600s interval. Accordingly, the highest and lowest RMSE values are related to the first and last time intervals (see Fig. 7), respectively. However, even for the first interval, the retrieved signal is very precise, as shown in Fig. 12. Small RMSE values obtained through our experiments imply high accuracy of the control signal retrieval module. The simulations are performed using MATLAB on a computer with an Intel Core i7-6700HQ CPU and 8Gb of RAM. The average run time of the proposed framework for each scenario is roughly 4.82 seconds. This includes processing 18000 samples of multiple channels through detection, classification, signal retrieval, and self-updates.\n\n\nV. CONCLUSION\n\nIn this paper, a framework is proposed for the detection and classification of unobservable FDI attacks, which consists of three newly designed modules. The first module enables the detection of unobservable FDI attacks. This module is designed based on sliding least-squares fitting on a sliding window that moves over the PMU signal on a complex plane. Using this approach, one can model historical changes w.r.t. the deviations caused by an attack from the origin on the complex plane and extract attack patterns from the signal. These attack patterns are then used by the second module to perform online semi-supervised classification. The proposed classifier can operate in non-stationary environments and update itself without dependence on external updates. The last module uses the extracted knowledge by other modules to retrieve the control signal before sending it to the control unit. In order to evaluate the designed system, a case study on the CNYPS is given. Additionally, two advanced real-time classifiers are selected for the sake of comparison. The obtained results indicate that the proposed framework is satisfyingly robust, even when FDI attacks are aligned with a disturbance in the system. The detection module is very sensitive to unobservable attacks. The classification module shows superior stability and accuracy over its rivals. The control signal retrieval module results in minimal RMSE.\n\n\nAPPENDIX 1\n\nAssume that the PMU measurement vectors at each time instant t can be modeled as:\nm t = Hs t + t ,(6)\nwhere m t is a row of M ; s t is the p×1 state vector of complex bus voltages; t is an i.i.d n×1 additive Gaussian noise vector;\n\nH is the measurement Jacobian matrix of size n × p. The least squares estimate of s t ,ŝ t , can be obtained by:\ns t = H + M t(7)\nwhere (·) + indicates pseudo-inverse operation. The associated residual vector can be defined as:\nr = m t − Hŝ t = m t − HH + m t .(8)\nConventional bad data detectors (BDD) monitor r to detect bad measurements.\n\nAssuming that the attacker has control over a subset of measurements J ⊆ {1, . . . , n}, the attacker can manipulate M as:\nM = M + D,(9)\nwhere the column support of the measurement attack matrix D, Sup(D), is contained in J. An attack can bypass the conventional residual-based BDD if D = CH T for some nonzero matrix C:M = M + CH T\n\nFrom (7), the estimated state matrix without attack is given byS =M H +T + CH T H +T =Ŝ + C.\n\nTherefore, the residual matrix under attack can be obtained as:\nR =M −SH T = M + CH T − (Ŝ + C)H T = M −ŜH T ,(12)\nwhich is the same as the residual without attack. Thus, attacks in the form above cannot be detected by residue-based BDD.\n\n\nAPPENDIX 2\n\nThe proof of Proposition 1 is explained in the following. Proof 1: ∀W t ∧ e t > 0, the fitted circle to z r ∈ W t , 1 ≤ r ≤ ω has the algebraic representation in the following form:\n\nF (x + e) = a(x + e) T (x + e) + b T (x + e) + c = 0 , (13) where a = 0, and x is the coordinate vector. The coefficients u = (a, b 1 , b 2 , c) T in Equation (13) can be found by forming a linear equation system Bu = 0, in which B contains the coordinates of data points attained by considering the imaginary and real part of z i ∈ W t as follows:\nB t =   \nx 1 + y 1 + e 11 + e 12 x 1 + e 11 y 1 + e 12 1 . . . . . . . . . . . .\n\nx ω + y ω + e ω1 + e ω2 x ω + e ω1 y ω + e ω2 1    (14) However, for ω > 3, this linear system only has a solution when z i ∈ W t are all located exactly on one circle, which is not always the case. Thus, an optimization problem is used instead to find the best possible fit on z i ∈ W t as follows:\nmin B t u s. t. u = 1 ,(15)\nwhich is equivalent to finding the right singular vector associated with the smallest singular value of B t . Assuming a = 0, Equation (13) can be converted to the following form:\n\nx + e 1 + b 1 2a\n2 + y + e 2 + b 2 2a 2 = b 2 4a 2 − c a (16) =⇒ĉ t = −e 1 − b 1 2a , −e 2 − b 2 2a = − b 1 2a , − b 2 2a + (−e 1 , −e 2 ) =c t + c t ,(17)\nwhere, based on Assumption 1,c t can be modeled as excessive deviation of c t from c 0 , and, therefore, Proposition 1 is proved.\n\nFig. 2 .\n2Illustration of the designed hybrid framework. (a) shows how changes in the PMU measurements result in deviation of the estimated centers from the origin computed on the training data. The solid line denotes the clean control signal whereas the dotted line indicates the disrupted signal. (b) contains the block diagram of the ORIGIN framework.\n\nFig. 3 .\n3Visualization of current magnitudes in the PMU data.\n\nFig. 4 .\n4Generation of unobservable attacks in four different strategies. Each strategy consists of four different classes of attack that are shown with numbers around the generated errors.\n\nFig. 5 .\n5Visualization of cross-correlation sequence between two random pairs of samples in the training set. (a) shows a symmetric pattern resulted by high cross-correlation, while (b) illustrates an asymmetric pattern resulted by low cross-correlation.\n\nFig. 6 .\n6Boxplot of the achieved accuracies for attack classification within each scenario. Solid dots shows the attained accuracies in each iteration of cross-validation, while the solid square denotes the mean of these accuracies.\n\nFig. 7 .\n7RMSE of signal retrieval over time for four different scenarios.\n\nFig. 5 .\n5b).\n\nFig. 11 .Fig. 12 .\n1112Averaged root mean square errors (RMSE) upon signal retrieval for all channels in different time intervals. Signal retrieval on the second channel of the first scenario within a 15-s time period with σ = 0.\n\n\n1) A new framework, unObservable thReat modelInG usIng least-squares fittiNg (ORIGIN), is proposed for detecting unobservable FDI attacks in power systems. The novel idea behind ORIGIN is to model historical changes of PMU signal w.r.t. the deviation of the circular path it creates on a complex plane. For the normal signal, even if the radius of the signal changes, the path is still centeredFig. 1. Network topology of the Central New York Power System[6].around the origin. Conversely, unobservable FDI attacks \ncause a deviation from the origin. To model the pattern \nof this deviation, we fit a least square circle to a sliding \nwindow on the streaming signal so that the resulted center \ncan show the extent and direction of the deviation from \nthe origin. \n2) A novel ensemble learner, classIfication using Cross-\ncOrrelatioN (ICON), is proposed to facilitate unobserv-\nable FDI attack classification in non-stationary environ-\nments. ICON is well-adapted to the selected case study \nand can address all the mentioned challenges in this \nprocess. It performs semi-supervised multi-class classifi-\ncation, detects new classes of unobservable FDI attacks, \nperforms self-update, and handles recurring classes. Un-\nlike most of the available work, ICON addresses all these \nchallenges simultaneously and does not rely on external \n\n' \nϭ \n\n' \nϮ \n\n' \nϯ \n\n' \nϰ \n\n' \nϱ \n\nϭ \nϮ \n\nϭ \nϯ \n\nϴ \n\nϳ \n\nϯ \n\nϭ \nϭ \n\nǭ \n\nϭ \n\nϭ \nϬ \n\nϮ \n\nϲ \n\nϰ \nϱ \n\nϵ \n\nBus with PMU installed. \nBus without PMU installed. \nLine Current measured by PMU. \nUnmeasured line Current. \n\n\n\n\nAlgorithm 1: ORIGIN Input: PMU data P , threshold δ. Output: Intrusion detection result F, attack classification result h, retrieved control signal S. Definition: X 0 is the training set, ← inserts into a FIFO queue. Initialization:\n\nTABLE I CHARACTERISTICS\nIOF THE DESIGNED SCENARIOS.Scenarios \n#. PMUs \n#. Channels \nTotal \nV \nI \nScenario 1 \n3 \n16 \n6 \n10 \nScenario 2 \n3 \n21 \n5 \n16 \nScenario 3 \n4 \n23 \n7 \n17 \nScenario 4 \n4 \n27 \n7 \n20 \n\n\n\nTABLE II MAGNITUDE\nIIOF ADDITIVE OR DEDUCTIVE ERRORS FOR EACH CLASS OF ATTACK THAT SHOULD BE INJECTED BY AN INTRUDER PER 1/30 s.Attack class \n1 \n2 \n3 \n4 \n5 \n6 \n7 \n8 \nError (×10 −3 ) \n0.1 \n0.5 \n1 \n5 \n0.1 \n0.5 \n1 \n5 \nAdditive \nDeductive \n\nTABLE III \nATTACK DETECTION RESULTS OVER FOUR DIFFERENT SCENARIOS. \nACCURACY MEASUREMENTS ARE REPORTED IN PERCENTAGE. \n\nExperiments \nAccuracy \nSafe \nIntrusion \nPrecision Recall Precision Recall \n\nORIGIN \nScenario 1 \n97.4 \n99.3 \n96 \n95.2 \n99.1 \nScenario 2 \n97.4 \n99.4 \n96 \n95.2 \n99.2 \nScenario 3 \n95.8 \n96.7 \n95.7 \n94.7 \n95.9 \nScenario 4 \n97.3 \n99.1 \n96 \n95.2 \n99 \n\nDM \n\nScenario 1 \n92.1 \n93.8 \n90.7 \n90 \n93.7 \nScenario 2 \n87.2 \n88.7 \n86.1 \n85.3 \n88.9 \nScenario 3 \n84.1 \n85 \n84.9 \n83.2 \n84.2 \nScenario 4 \n79.5 \n81.1 \n78.9 \n77.9 \n80.9 \n\n\n\nTABLE IV AVERAGED\nIVCLASS SPECIFIC PERFORMANCE MEASURES (%) FOR ATTACK CLASSIFICATION W.R.T. EACH SCENARIO OBTAINED THROUGH A 10-FOLD CROSS-VALIDATION.Scenarios \nAttacks \nICON \nCLAM \nSCANR \nFast-COMPOSE \nAccuracy Precision Recall Accuracy Precision Recall Accuracy Precision Recall Accuracy Precision Recall \n\nScenario 1 \n\nClass 0 \n97.67 \n99.29 \n96.11 \n96.02 \n97.64 \n94.46 \n92.87 \n94.44 \n91.36 88.2265 \n89.718 \n86.792 \nClass 1 \n96.57 \n94.32 \n98.93 \n94.92 \n92.67 \n97.29 \n91.76 \n89.37 \n94.29 \n87.172 \n84.9015 89.5755 \nClass 2 \n96.95 \n94.91 \n99.08 \n95.16 \n93.27 \n97.13 \n91.96 \n90.07 \n93.94 \n87.362 \n85.5665 89.243 \nClass 3 \n97.13 \n95.18 \n99.18 \n95.50 \n93.55 \n97.55 \n92.23 \n90.25 \n94.31 87.6185 \n85.7375 89.5945 \nClass 4 \n97.95 \n96.41 \n99.54 \n96.28 \n94.76 \n97.85 \n93.06 \n91.52 \n94.66 \n88.407 \n86.944 \n89.927 \n\nScenario 2 \n\nClass 0 \n97.77 \n99.37 \n96.23 \n96.14 \n97.75 \n94.59 \n93.67 \n95.81 \n91.64 88.9865 \n91.0195 87.058 \nClass 5 \n96.61 \n94.38 \n98.96 \n94.98 \n92.75 \n97.32 \n92.09 \n89.91 \n94.38 87.4855 \n85.4145 89.661 \nClass 6 \n97.02 \n95.01 \n99.12 \n95.37 \n93.36 \n97.48 \n92.45 \n90.45 \n94.55 87.8275 \n85.9275 89.8225 \nClass 7 \n97.16 \n95.20 \n99.21 \n95.52 \n93.58 \n97.56 \n92.71 \n90.63 \n94.89 88.0745 \n86.0985 90.1455 \nClass 8 \n97.93 \n96.34 \n99.58 \n96.30 \n94.71 \n97.95 \n91.90 \n91.79 \n92.03 \n87.305 \n87.2005 87.4285 \n\nScenario 3 \n\nClass 0 \n96.19 \n96.69 \n95.71 \n94.99 \n95.48 \n94.51 \n90.26 \n90.75 \n89.78 \n85.747 \n86.2125 85.291 \nClass 5 \n95.15 \n94.41 \n95.91 \n93.92 \n93.21 \n94.66 \n89.12 \n88.34 \n89.93 \n84.664 \n83.923 85.4335 \nClass 1 \n95.10 \n94.38 \n95.84 \n93.87 \n93.14 \n94.63 \n89.15 \n88.41 \n89.91 84.6925 \n83.9895 85.4145 \nClass 6 \n95.58 \n95.10 \n96.08 \n94.36 \n93.86 \n94.87 \n91.66 \n91.16 \n92.17 \n87.077 \n86.602 87.5615 \nClass 2 \n95.57 \n95.01 \n96.14 \n94.35 \n93.80 \n94.91 \n92.20 \n92.23 \n92.17 \n87.59 \n87.6185 87.5615 \n\nScenario 4 \n\nClass 0 \n97.61 \n99.19 \n96.09 \n95.88 \n97.43 \n94.39 \n92.67 \n94.21 \n91.18 88.0365 \n89.4995 86.621 \nClass 1 \n96.55 \n94.38 \n98.84 \n94.80 \n92.62 \n97.09 \n91.59 \n89.43 \n93.87 87.0105 \n84.9585 89.1765 \nClass 6 \n96.93 \n95.10 \n98.98 \n95.26 \n93.37 \n97.23 \n92.05 \n90.17 \n94.01 87.4475 \n85.6615 89.3095 \nClass 3 \n97.09 \n95.21 \n99.05 \n95.34 \n93.46 \n97.31 \n92.17 \n90.26 \n94.17 87.5615 \n85.747 89.4615 \nClass 8 \n97.87 \n96.42 \n99.38 \n96.13 \n94.68 \n97.63 \n92.96 \n91.48 \n94.49 \n88.312 \n86.906 89.7655 \n\n\n\n\nFig. 9. Average precision w.r.t. noise degree σ. Labels on the Y-axis show the scenario number versus σ.ICON \nCLAM \nSCANR \nFast-COMPOSE \n\n1:5% \n\n2:5% \n\n3:5% \n\n4:5% \n\n1:10% \n\n2:10% \n\n3:10% \n\n4:10% \n\n1:15% \n\n2:15% \n\n3:15% \n\n4:15% \n\n1:20% \n\n2:20% \n\n3:20% \n\n4:20% \n\n1:25% \n\n2:25% \n\n3:25% \n\n4:25% \n\nAverage accuracy \n\n91.7 \n\n91.75 \n\n91.84 \n\n90.53 \n\n91.66 \n\n87.93 \n\n88.01 \n\n86.75 \n\n87.84 \n\n84.11 \n\n84.18 \n\n82.98 \n\n84.02 \n\n91.45 \n\n91.64 \n\n89.57 \n\n91.37 \n\n90.53 \n\n90.71 \n\n88.67 \n\n90.44 \n\n88.68 \n\n88.86 \n\n86.86 \n\n88.6 \n\n84.99 \n\n85.16 \n\n83.24 \n\n84.9 \n\n86.88 \n\n87.06 \n\n85.09 \n\n86.8 \n\n86 \n\n86.18 \n\n84.24 \n\n85.92 \n\n84.25 \n\n84.42 \n\n82.52 \n\n84.17 \n\n96.77 \n\n96.81 \n\n95.04 \n\n96.72 \n\n96.28 \n\n96.33 \n\n94.56 \n\n96.24 \n\n95.8 \n\n95.84 \n\n94.09 \n\n95.75 \n\n94.34 \n\n94.38 \n\n92.65 \n\n94.29 \n\n93.36 \n\n93.41 \n\n93.32 \n\n94.62 \n\n94.71 \n\n93.36 \n\n94.53 \n\n93.66 \n\n93.75 \n\n92.41 \n\n93.57 \n\n81.29 \n\n81.46 \n\n79.62 \n\n81.21 \n\n80.74 \n\n80.9 \n\n79.08 \n\n80.66 \n\n77.23 \n\n77.38 \n\n75.64 \n\n77.15 \n\n76 \n\n78 \n\n80 \n\n82 \n\n84 \n\n86 \n\n88 \n\n90 \n\n92 \n\n94 \n\n96 \n\nFig. 8. Average accuracy w.r.t. noise degree σ. Labels on the Y-axis show \nthe scenario number versus σ. \n\nICON \nCLAM \nSCANR \nFast-COMPOSE \n\n1:5% \n\n2:5% \n\n3:5% \n\n4:5% \n\n1:10% \n\n2:10% \n\n3:10% \n\n4:10% \n\n1:15% \n\n2:15% \n\n3:15% \n\n4:15% \n\n1:20% \n\n2:20% \n\n3:20% \n\n4:20% \n\n1:25% \n\n2:25% \n\n3:25% \n\n4:25% \n\nAverage precision \n\n90.6 \n\n90.65 \n\n90.14 \n\n90.54 \n\n86.83 \n\n86.88 \n\n86.39 \n\n86.77 \n\n83.05 \n\n83.1 \n\n82.63 \n\n82.99 \n\n90.22 \n\n90.8 \n\n89.28 \n\n90.2 \n\n89.31 \n\n89.88 \n\n88.37 \n\n89.29 \n\n87.48 \n\n88.05 \n\n86.57 \n\n87.47 \n\n83.84 \n\n84.38 \n\n82.96 \n\n83.82 \n\n85.71 \n\n86.26 \n\n84.81 \n\n85.69 \n\n84.84 \n\n85.39 \n\n83.96 \n\n84.82 \n\n83.11 \n\n83.65 \n\n82.24 \n\n83.09 \n\n95.54 \n\n95.58 \n\n94.64 \n\n95.58 \n\n95.06 \n\n95.1 \n\n94.17 \n\n95.1 \n\n94.58 \n\n94.62 \n\n93.69 \n\n94.62 \n\n93.14 \n\n93.18 \n\n92.26 \n\n93.18 \n\n92.18 \n\n92.22 \n\n91.31 \n\n92.22 \n\n93.43 \n\n93.49 \n\n92.96 \n\n93.37 \n\n92.49 \n\n92.54 \n\n92.02 \n\n92.43 \n\n80.19 \n\n80.71 \n\n79.36 \n\n80.18 \n\n79.65 \n\n80.16 \n\n78.82 \n\n79.63 \n\n76.18 \n\n76.68 \n\n75.39 \n\n76.17 \n\n76 \n\n78 \n\n80 \n\n82 \n\n84 \n\n86 \n\n88 \n\n90 \n\n92 \n\n94 \n\n\n\n\nFig. 10. Average recall w.r.t. noise degree σ. Labels on the Y-axis show the scenario number versus σ.ICON \nCLAM \nSCANR \nFast-COMPOSE \n\n1:5% \n\n2:5% \n\n3:5% \n\n4:5% \n\n1:10% \n\n2:10% \n\n3:10% \n\n4:10% \n\n1:15% \n\n2:15% \n\n3:15% \n\n4:15% \n\n1:20% \n\n2:20% \n\n3:20% \n\n4:20% \n\n1:25% \n\n2:25% \n\n3:25% \n\n4:25% \n\nAverage recall \n\n93.06 \n\n92.1 \n\n92.82 \n\n92.98 \n\n93.1 \n\n90.93 \n\n92.86 \n\n89.11 \n\n89.22 \n\n87.14 \n\n88.99 \n\n85.23 \n\n85.34 \n\n83.35 \n\n85.12 \n\n92.77 \n\n92.56 \n\n89.88 \n\n92.61 \n\n91.84 \n\n91.63 \n\n88.98 \n\n91.67 \n\n89.96 \n\n89.76 \n\n87.16 \n\n89.8 \n\n86.22 \n\n86.02 \n\n83.53 \n\n86.06 \n\n82.47 \n\n82.28 \n\n82.32 \n\n88.14 \n\n87.93 \n\n85.39 \n\n87.98 \n\n87.25 \n\n87.05 \n\n84.53 \n\n87.09 \n\n85.47 \n\n85.27 \n\n82.8 \n\n85.31 \n\n98.08 \n\n98.13 \n\n95.46 \n\n97.98 \n\n97.58 \n\n97.63 \n\n94.98 \n\n97.48 \n\n97.09 \n\n97.14 \n\n94.5 \n\n96.99 \n\n95.61 \n\n95.66 \n\n95.51 \n\n94.63 \n\n94.68 \n\n94.53 \n\n95.89 \n\n96.01 \n\n93.77 \n\n95.76 \n\n94.92 \n\n95.04 \n\n94.8 \n\n79.9 \n\n81.9 \n\n81.72 \n\n79.35 \n\n81.76 \n\n78.34 \n\n78.16 \n\n75.9 \n\n78.2 \n\n80 \n\n85 \n\n90 \n\n95 \n\n\nACKNOWLEDGMENT This work is supported by the Natural Sciences and Engineering Research Council of Canada (NSERC) under funding reference numbers CGSD3-569341-2022 and RGPIN-2021-02968.\nStealthy mtd against unsupervised learning-based blind fdi attacks in power systems. M Higgins, F Teng, T Parisini, IEEE Trans. Inf. Forensics Security. 16M. Higgins, F. Teng, and T. Parisini, \"Stealthy mtd against unsupervised learning-based blind fdi attacks in power systems,\" IEEE Trans. Inf. Forensics Security, vol. 16, pp. 1275-1287, 2021.\n\nUnsupervised machine learning-based detection of covert data integrity assault in smart grid networks utilizing isolation forest. S Ahmed, Y Lee, S.-H Hyun, I Koo, IEEE Trans. Inf. Forensics Security. 1410S. Ahmed, Y. Lee, S.-H. Hyun, and I. Koo, \"Unsupervised machine learning-based detection of covert data integrity assault in smart grid networks utilizing isolation forest,\" IEEE Trans. Inf. Forensics Security, vol. 14, no. 10, pp. 2765-2777, 2019.\n\nModeling and mitigating impact of false data injection attacks on automatic generation control. R Tan, H H Nguyen, E Y S Foo, D K Y Yau, Z Kalbarczyk, R K Iyer, H B Gooi, IEEE Trans. Inf. Forensics Security. 127R. Tan, H. H. Nguyen, E. Y. S. Foo, D. K. Y. Yau, Z. Kalbarczyk, R. K. Iyer, and H. B. Gooi, \"Modeling and mitigating impact of false data injection attacks on automatic generation control,\" IEEE Trans. Inf. Forensics Security, vol. 12, no. 7, pp. 1609-1624, 2017.\n\nMasking transmission line outages via false data injection attacks. X Liu, Z Li, X Liu, Z Li, IEEE Trans. Inf. Forensics Security. 117X. Liu, Z. Li, X. Liu, and Z. Li, \"Masking transmission line outages via false data injection attacks,\" IEEE Trans. Inf. Forensics Security, vol. 11, no. 7, pp. 1592-1602, 2016.\n\nMinimum sparsity of unobservable power network attacks. Y Zhao, A Goldsmith, H V Poor, IEEE Trans. Autom. Control. 627Y. Zhao, A. Goldsmith, and H. V. Poor, \"Minimum sparsity of unob- servable power network attacks,\" IEEE Trans. Autom. Control, vol. 62, no. 7, pp. 3354-3368, July 2017.\n\nIdentification of successive \"unobservable\" cyber data attacks in power systems through matrix decomposition. P Gao, M Wang, J H Chow, S G Ghiocel, B Fardanesh, G Stefopoulos, M P Razanousky, IEEE Trans. Signal Process. 6421P. Gao, M. Wang, J. H. Chow, S. G. Ghiocel, B. Fardanesh, G. Stefopou- los, and M. P. Razanousky, \"Identification of successive \"unobservable\" cyber data attacks in power systems through matrix decomposition,\" IEEE Trans. Signal Process., vol. 64, no. 21, pp. 5557-5570, Nov 2016.\n\nJoint detection and mitigation of false data injection attacks in agc systems. M Khalaf, A Youssef, E El-Saadany, IEEE Trans. Smart Grid. M. Khalaf, A. Youssef, and E. El-Saadany, \"Joint detection and mitiga- tion of false data injection attacks in agc systems,\" IEEE Trans. Smart Grid, pp. 1-1, 2018.\n\nReal-time detection of hybrid and stealthy cyber-attacks in smart grid. M N Kurt, Y Yılmaz, X Wang, IEEE Trans. Inf. Forensics Security. 142M. N. Kurt, Y. Yılmaz, and X. Wang, \"Real-time detection of hybrid and stealthy cyber-attacks in smart grid,\" IEEE Trans. Inf. Forensics Security, vol. 14, no. 2, pp. 498-513, 2019.\n\nMalicious data attacks on the smart grid. O Kosut, L Jia, R J Thomas, L Tong, IEEE Trans. Smart Grid. 24O. Kosut, L. Jia, R. J. Thomas, and L. Tong, \"Malicious data attacks on the smart grid,\" IEEE Trans. Smart Grid, vol. 2(4), pp. 645-658, 2011.\n\nSemiboost: Boosting for semi-supervised learning. P K Mallapragada, R Jin, A K Jain, Y Liu, IEEE Trans. Pattern Anal. Mach. Intell. 3111P. K. Mallapragada, R. Jin, A. K. Jain, and Y. Liu, \"Semiboost: Boosting for semi-supervised learning,\" IEEE Trans. Pattern Anal. Mach. Intell., vol. 31, no. 11, pp. 2000-2014, 2009.\n\nSemi-supervised learning via regularized boosting working on multiple semi-supervised assumptions. K Chen, S Wang, IEEE Trans. Pattern Anal. Mach. Intell. 331K. Chen and S. Wang, \"Semi-supervised learning via regularized boost- ing working on multiple semi-supervised assumptions,\" IEEE Trans. Pattern Anal. Mach. Intell., vol. 33, no. 1, pp. 129-143, 2011.\n\nSemi-supervised multivariate statistical network monitoring for learning security threats. J Camacho, G Maciá-Fernández, N M Fuentes-García, E Saccenti, IEEE Trans. Inf. Forensics Security. 148J. Camacho, G. Maciá-Fernández, N. M. Fuentes-García, and E. Sac- centi, \"Semi-supervised multivariate statistical network monitoring for learning security threats,\" IEEE Trans. Inf. Forensics Security, vol. 14, no. 8, pp. 2179-2189, 2019.\n\nCompose: A semisupervised learning framework for initially labeled nonstationary streaming data. K B Dyer, R Capo, R Polikar, IEEE Trans. Neural Netw. 251K. B. Dyer, R. Capo, and R. Polikar, \"Compose: A semisupervised learning framework for initially labeled nonstationary streaming data,\" IEEE Trans. Neural Netw., vol. 25, no. 1, pp. 12-26, Jan 2014.\n\nClassification and novel class detection in concept-drifting data streams under time constraints. M Masud, J Gao, L Khan, J Han, B M Thuraisingham, IEEE Trans. Knowl. Data Eng. 236M. Masud, J. Gao, L. Khan, J. Han, and B. M. Thuraisingham, \"Classification and novel class detection in concept-drifting data streams under time constraints,\" IEEE Trans. Knowl. Data Eng., vol. 23, no. 6, pp. 859-874, June 2011.\n\nRecurring and novel class detection using class-based ensemble for evolving data stream. T Al-Khateeb, M M Masud, K M Al-Naami, S E Seker, A M Mustafa, L Khan, Z Trabelsi, C Aggarwal, J Han, IEEE Trans. Knowl. Data Eng. 2810T. Al-Khateeb, M. M. Masud, K. M. Al-Naami, S. E. Seker, A. M. Mustafa, L. Khan, Z. Trabelsi, C. Aggarwal, and J. Han, \"Recurring and novel class detection using class-based ensemble for evolving data stream,\" IEEE Trans. Knowl. Data Eng., vol. 28, no. 10, pp. 2752-2764, Oct 2016.\n\nHyperspectral anomaly detection by graph pixel selection. Y Yuan, D Ma, Q Wang, IEEE Trans. Cybern. 4612Y. Yuan, D. Ma, and Q. Wang, \"Hyperspectral anomaly detection by graph pixel selection,\" IEEE Trans. Cybern., vol. 46, no. 12, pp. 3123- 3134, Dec 2016.\n\nShort-term state forecasting-aided method for detection of smart grid general false data injection attacks. J Zhao, G Zhang, M L Scala, Z Y Dong, C Chen, J Wang, IEEE Trans. Smart Grid. 84J. Zhao, G. Zhang, M. L. Scala, Z. Y. Dong, C. Chen, and J. Wang, \"Short-term state forecasting-aided method for detection of smart grid general false data injection attacks,\" IEEE Trans. Smart Grid, vol. 8, no. 4, pp. 1580-1590, July 2017.\n\nA Abur, A Gomez-Exposito, Power System State Estimation: Theory and Implementation. 24A. Abur and A. Gomez-Exposito, Power System State Estimation: Theory and Implementation, 03 2004, vol. 24.\n\nPower system static-state estimation, part i: Exact model. F C Schweppe, J Wildes, IEEE Trans. Power App. Syst. 1F. C. Schweppe and J. Wildes, \"Power system static-state estimation, part i: Exact model,\" IEEE Trans. Power App. Syst., vol. PAS-89, no. 1, pp. 120-125, 1970.\n\nPower system dynamic state estimation: Motivations, definitions, methodologies, and future work. J Zhao, A Gómez-Expósito, M Netto, L Mili, A Abur, V Terzija, I Kamwa, B Pal, A K Singh, J Qi, Z Huang, A P S Meliopoulos, IEEE Trans. Power Syst. 344J. Zhao, A. Gómez-Expósito, M. Netto, L. Mili, A. Abur, V. Terzija, I. Kamwa, B. Pal, A. K. Singh, J. Qi, Z. Huang, and A. P. S. Meliopoulos, \"Power system dynamic state estimation: Motivations, definitions, methodologies, and future work,\" IEEE Trans. Power Syst., vol. 34, no. 4, pp. 3188-3198, 2019.\n\nDistributed quickest detection of cyber-attacks in smart grid. M N Kurt, Y Yılmaz, X Wang, IEEE Trans. Inf. Forensics Security. 138M. N. Kurt, Y. Yılmaz, and X. Wang, \"Distributed quickest detection of cyber-attacks in smart grid,\" IEEE Trans. Inf. Forensics Security, vol. 13, no. 8, pp. 2015-2030, 2018.\n\nSecure distributed dynamic state estimation in wide-area smart grids. IEEE Trans. Inf. Forensics Security. 15--, \"Secure distributed dynamic state estimation in wide-area smart grids,\" IEEE Trans. Inf. Forensics Security, vol. 15, pp. 800-815, 2020.\n\nObserver-based attack detection and mitigation for cyberphysical systems: A review. M Kordestani, M Saif, Man, Cybern. Mag. 72IEEE SystM. Kordestani and M. Saif, \"Observer-based attack detection and miti- gation for cyberphysical systems: A review,\" IEEE Syst., Man, Cybern. Mag., vol. 7, no. 2, pp. 35-60, 2021.\n\nObserverbased resilient integrated distributed control against cyberattacks on sensors and actuators in islanded ac microgrids. M Shi, X Chen, M Shahidehpour, Q Zhou, J Wen, IEEE Trans. Smart Grid. 123M. Shi, X. Chen, M. Shahidehpour, Q. Zhou, and J. Wen, \"Observer- based resilient integrated distributed control against cyberattacks on sensors and actuators in islanded ac microgrids,\" IEEE Trans. Smart Grid, vol. 12, no. 3, pp. 1953-1963, 2021.\n\nInterval observer-based detection and localization against false data injection attack in smart grids. X Luo, Y Li, X Wang, X Guan, IEEE Internet Things J. 82X. Luo, Y. Li, X. Wang, and X. Guan, \"Interval observer-based detection and localization against false data injection attack in smart grids,\" IEEE Internet Things J., vol. 8, no. 2, pp. 657-671, 2021.\n\nFinite-time sliding-mode control of markovian jump cyber-physical systems against randomly occurring injection attacks. Z Cao, Y Niu, J Song, IEEE Trans. Autom. Control. 653Z. Cao, Y. Niu, and J. Song, \"Finite-time sliding-mode control of markovian jump cyber-physical systems against randomly occurring injection attacks,\" IEEE Trans. Autom. Control, vol. 65, no. 3, pp. 1264- 1271, 2020.\n\nOn addressing the security and stability issues due to false data injection attacks in dc microgrids an adaptive observer approach. A Cecilia, S Sahoo, T Dragicevic, R Costa-Castello, F Blaabjerg, IEEE Trans. Power Electron. A. Cecilia, S. Sahoo, T. Dragicevic, R. Costa-Castello, and F. Blaabjerg, \"On addressing the security and stability issues due to false data injection attacks in dc microgrids an adaptive observer approach,\" IEEE Trans. Power Electron., pp. 1-1, 2021.\n\nSliding Mode Observers and Their Application in Fault Diagnosis. M Saif, Y Xiong, SpringerBerlin, Heidelberg; Berlin HeidelbergM. Saif and Y. Xiong, Sliding Mode Observers and Their Application in Fault Diagnosis. Berlin, Heidelberg: Springer Berlin Heidelberg, 2003, pp. 1-57.\n\nDetection and isolation of false data injection attacks in smart grid via unknown input interval observer. X Wang, X Luo, M Zhang, Z Jiang, X Guan, IEEE Internet Things J. 74X. Wang, X. Luo, M. Zhang, Z. Jiang, and X. Guan, \"Detection and isolation of false data injection attacks in smart grid via unknown input interval observer,\" IEEE Internet Things J., vol. 7, no. 4, pp. 3214-3229, 2020.\n\nSliding mode control on electro-mechanical systems. V Utkin, H.-C Chang, Math. Problems in Eng. 8V. Utkin and H.-C. Chang, \"Sliding mode control on electro-mechanical systems,\" Math. Problems in Eng., vol. 8, 09 2002.\n\nTerminal sliding mode-based consensus tracking control for networked uncertain mechanical systems on digraphs. G Chen, Y Song, Y Guan, IEEE Trans. Neural Netw. Learn. Syst. 293G. Chen, Y. Song, and Y. Guan, \"Terminal sliding mode-based con- sensus tracking control for networked uncertain mechanical systems on digraphs,\" IEEE Trans. Neural Netw. Learn. Syst, vol. 29, no. 3, pp. 749-756, 2018.\n\nExtreme learning machine-based state reconstruction for automatic attack filtering in cyber physical power system. T Wu, W Xue, H Wang, C Y Chung, G Wang, J Peng, Q Yang, IEEE Trans. Ind. Informat. 173T. Wu, W. Xue, H. Wang, C. Y. Chung, G. Wang, J. Peng, and Q. Yang, \"Extreme learning machine-based state reconstruction for automatic attack filtering in cyber physical power system,\" IEEE Trans. Ind. Informat., vol. 17, no. 3, pp. 1892-1904, 2021.\n\nSecure state estimation against integrity attacks: A gaussian mixture model approach. Z Guo, D Shi, D E Quevedo, L Shi, IEEE Trans. Signal Process. 671Z. Guo, D. Shi, D. E. Quevedo, and L. Shi, \"Secure state estimation against integrity attacks: A gaussian mixture model approach,\" IEEE Trans. Signal Process., vol. 67, no. 1, pp. 194-207, 2019.\n\nDeveloping graphical detection techniques for maintaining state estimation integrity against false data injection attack in integrated electric cyber-physical system. Y Li, Y Wang, J. Syst. Architecture. 105101705Y. Li and Y. Wang, \"Developing graphical detection techniques for maintaining state estimation integrity against false data injection attack in integrated electric cyber-physical system,\" J. Syst. Architecture, vol. 105, p. 101705, 2020.\n\nA novelty detector and extreme verification latency model for nonstationary environments. R Razavi-Far, E Hallaji, M Saif, G Ditzler, IEEE Trans. Ind. Electron. 661R. Razavi-Far, E. Hallaji, M. Saif, and G. Ditzler, \"A novelty detector and extreme verification latency model for nonstationary environments,\" IEEE Trans. Ind. Electron., vol. 66, no. 1, pp. 561-570, Jan 2019.\n\nAldocx: Detection of unknown malicious microsoft office documents using designated active learning methods based on new structural feature extraction methodology. N Nissim, A Cohen, Y Elovici, IEEE Trans. Inf. Forensics Security. 123N. Nissim, A. Cohen, and Y. Elovici, \"Aldocx: Detection of unknown malicious microsoft office documents using designated active learning methods based on new structural feature extraction methodology,\" IEEE Trans. Inf. Forensics Security, vol. 12, no. 3, pp. 631-646, 2017.\n\nDetecting recurring and novel classes in concept-drifting data streams. M M Masud, T M Al-Khateeb, L Khan, C Aggarwal, J Gao, J Han, B Thuraisingham, IEEE 11th Int. Conf. Data Mining. M. M. Masud, T. M. Al-Khateeb, L. Khan, C. Aggarwal, J. Gao, J. Han, and B. Thuraisingham, \"Detecting recurring and novel classes in concept-drifting data streams,\" in IEEE 11th Int. Conf. Data Mining, Dec 2011, pp. 1176-1181.\n\nUnobservable false data injection attacks against pmus: Feasible conditions and multiplicative attacks. Z Chu, J Zhang, O Kosut, L Sankar, IEEE Int. Conf. Commun., Control, and Computing Technologies for Smart Grids. Z. Chu, J. Zhang, O. Kosut, and L. Sankar, \"Unobservable false data injection attacks against pmus: Feasible conditions and multiplicative attacks,\" in IEEE Int. Conf. Commun., Control, and Computing Tech- nologies for Smart Grids, 2018, pp. 1-6.\n\nHis current research interests include machine learning, data mining. Ehsan Hallaji, Graduate Student Member, IEEE) received the B.Sc. degree in software engineering, in 2015, and the M.A.Sc. degree in electrical and computer engineering from the University of Windsor. Windsor, ON, CanadaElectrical and Computer Engineering, University of WindsorHe is currently a Ph.D. candidate at the Department of. and cybersecurityEhsan Hallaji (Graduate Student Member, IEEE) received the B.Sc. degree in software engineering, in 2015, and the M.A.Sc. degree in electrical and computer engineering from the University of Windsor, Windsor, ON, Canada, in 2018. He is currently a Ph.D. candidate at the Department of Electrical and Computer Engineering, University of Windsor. His current research interests include machine learning, data mining, and cybersecurity.\n", "annotations": {"author": "[{\"end\":224,\"start\":181},{\"end\":263,\"start\":225},{\"end\":321,\"start\":264},{\"end\":350,\"start\":322}]", "publisher": null, "author_last_name": "[{\"end\":223,\"start\":216},{\"end\":262,\"start\":252},{\"end\":320,\"start\":316},{\"end\":349,\"start\":340}]", "author_first_name": "[{\"end\":215,\"start\":210},{\"end\":251,\"start\":244},{\"end\":315,\"start\":311},{\"end\":339,\"start\":334}]", "author_affiliation": null, "title": "[{\"end\":178,\"start\":1},{\"end\":528,\"start\":351}]", "venue": null, "abstract": "[{\"end\":2190,\"start\":705}]", "bib_ref": "[{\"attributes\":{\"ref_id\":\"b2\"},\"end\":2389,\"start\":2386},{\"attributes\":{\"ref_id\":\"b3\"},\"end\":2394,\"start\":2391},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":2706,\"start\":2703},{\"attributes\":{\"ref_id\":\"b5\"},\"end\":2711,\"start\":2708},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":3113,\"start\":3110},{\"attributes\":{\"ref_id\":\"b5\"},\"end\":3118,\"start\":3115},{\"attributes\":{\"ref_id\":\"b5\"},\"end\":3222,\"start\":3219},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":3726,\"start\":3723},{\"attributes\":{\"ref_id\":\"b6\"},\"end\":3731,\"start\":3728},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":3958,\"start\":3955},{\"attributes\":{\"ref_id\":\"b0\"},\"end\":4107,\"start\":4104},{\"attributes\":{\"ref_id\":\"b7\"},\"end\":4112,\"start\":4109},{\"attributes\":{\"ref_id\":\"b8\"},\"end\":4117,\"start\":4114},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":4672,\"start\":4668},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":4678,\"start\":4674},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":4818,\"start\":4814},{\"attributes\":{\"ref_id\":\"b11\"},\"end\":4824,\"start\":4820},{\"attributes\":{\"ref_id\":\"b12\"},\"end\":5211,\"start\":5207},{\"attributes\":{\"ref_id\":\"b13\"},\"end\":5217,\"start\":5213},{\"attributes\":{\"ref_id\":\"b13\"},\"end\":5241,\"start\":5237},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":5270,\"start\":5266},{\"attributes\":{\"ref_id\":\"b12\"},\"end\":5478,\"start\":5474},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":5484,\"start\":5480},{\"attributes\":{\"ref_id\":\"b5\"},\"end\":7931,\"start\":7928},{\"attributes\":{\"ref_id\":\"b6\"},\"end\":8299,\"start\":8296},{\"attributes\":{\"ref_id\":\"b16\"},\"end\":8305,\"start\":8301},{\"attributes\":{\"ref_id\":\"b5\"},\"end\":8504,\"start\":8501},{\"attributes\":{\"ref_id\":\"b17\"},\"end\":10449,\"start\":10445},{\"attributes\":{\"ref_id\":\"b18\"},\"end\":10455,\"start\":10451},{\"attributes\":{\"ref_id\":\"b19\"},\"end\":10756,\"start\":10752},{\"attributes\":{\"ref_id\":\"b20\"},\"end\":10885,\"start\":10881},{\"attributes\":{\"ref_id\":\"b21\"},\"end\":10891,\"start\":10887},{\"attributes\":{\"ref_id\":\"b22\"},\"end\":11390,\"start\":11386},{\"attributes\":{\"ref_id\":\"b20\"},\"end\":11481,\"start\":11477},{\"attributes\":{\"ref_id\":\"b23\"},\"end\":11509,\"start\":11505},{\"attributes\":{\"ref_id\":\"b24\"},\"end\":11515,\"start\":11511},{\"attributes\":{\"ref_id\":\"b25\"},\"end\":11550,\"start\":11546},{\"attributes\":{\"ref_id\":\"b20\"},\"end\":11820,\"start\":11816},{\"attributes\":{\"ref_id\":\"b22\"},\"end\":12286,\"start\":12282},{\"attributes\":{\"ref_id\":\"b26\"},\"end\":12336,\"start\":12332},{\"attributes\":{\"ref_id\":\"b27\"},\"end\":12541,\"start\":12537},{\"attributes\":{\"ref_id\":\"b28\"},\"end\":12789,\"start\":12785},{\"attributes\":{\"ref_id\":\"b29\"},\"end\":13535,\"start\":13531},{\"attributes\":{\"ref_id\":\"b30\"},\"end\":13541,\"start\":13537},{\"attributes\":{\"ref_id\":\"b29\"},\"end\":13760,\"start\":13756},{\"attributes\":{\"ref_id\":\"b31\"},\"end\":14011,\"start\":14007},{\"attributes\":{\"ref_id\":\"b33\"},\"end\":14017,\"start\":14013},{\"attributes\":{\"ref_id\":\"b13\"},\"end\":14684,\"start\":14680},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":14690,\"start\":14686},{\"attributes\":{\"ref_id\":\"b34\"},\"end\":14696,\"start\":14692},{\"attributes\":{\"ref_id\":\"b13\"},\"end\":15714,\"start\":15710},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":15720,\"start\":15716},{\"attributes\":{\"ref_id\":\"b12\"},\"end\":15957,\"start\":15953},{\"attributes\":{\"ref_id\":\"b13\"},\"end\":15963,\"start\":15959},{\"attributes\":{\"ref_id\":\"b35\"},\"end\":16337,\"start\":16333},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":16630,\"start\":16626},{\"attributes\":{\"ref_id\":\"b36\"},\"end\":17024,\"start\":17020},{\"attributes\":{\"ref_id\":\"b16\"},\"end\":18960,\"start\":18956},{\"attributes\":{\"ref_id\":\"b5\"},\"end\":18986,\"start\":18985},{\"attributes\":{\"ref_id\":\"b12\"},\"end\":19230,\"start\":19228},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":19315,\"start\":19313},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":19389,\"start\":19387},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":23883,\"start\":23882},{\"attributes\":{\"ref_id\":\"b3\"},\"end\":23966,\"start\":23965},{\"attributes\":{\"ref_id\":\"b6\"},\"end\":24105,\"start\":24104},{\"attributes\":{\"ref_id\":\"b7\"},\"end\":24138,\"start\":24137},{\"attributes\":{\"ref_id\":\"b5\"},\"end\":27643,\"start\":27640},{\"attributes\":{\"ref_id\":\"b37\"},\"end\":27743,\"start\":27739},{\"attributes\":{\"ref_id\":\"b34\"},\"end\":29072,\"start\":29068},{\"attributes\":{\"ref_id\":\"b5\"},\"end\":30347,\"start\":30344},{\"attributes\":{\"ref_id\":\"b12\"},\"end\":37603,\"start\":37599},{\"attributes\":{\"ref_id\":\"b12\"},\"end\":38448,\"start\":38444},{\"attributes\":{\"ref_id\":\"b5\"},\"end\":40662,\"start\":40659}]", "figure": "[{\"attributes\":{\"id\":\"fig_0\"},\"end\":39131,\"start\":38776},{\"attributes\":{\"id\":\"fig_3\"},\"end\":39195,\"start\":39132},{\"attributes\":{\"id\":\"fig_4\"},\"end\":39387,\"start\":39196},{\"attributes\":{\"id\":\"fig_5\"},\"end\":39644,\"start\":39388},{\"attributes\":{\"id\":\"fig_6\"},\"end\":39879,\"start\":39645},{\"attributes\":{\"id\":\"fig_7\"},\"end\":39955,\"start\":39880},{\"attributes\":{\"id\":\"fig_8\"},\"end\":39970,\"start\":39956},{\"attributes\":{\"id\":\"fig_9\"},\"end\":40201,\"start\":39971},{\"attributes\":{\"id\":\"tab_0\",\"type\":\"table\"},\"end\":41754,\"start\":40202},{\"attributes\":{\"id\":\"tab_2\",\"type\":\"table\"},\"end\":41989,\"start\":41755},{\"attributes\":{\"id\":\"tab_3\",\"type\":\"table\"},\"end\":42193,\"start\":41990},{\"attributes\":{\"id\":\"tab_4\",\"type\":\"table\"},\"end\":42967,\"start\":42194},{\"attributes\":{\"id\":\"tab_5\",\"type\":\"table\"},\"end\":45263,\"start\":42968},{\"attributes\":{\"id\":\"tab_6\",\"type\":\"table\"},\"end\":47266,\"start\":45264},{\"attributes\":{\"id\":\"tab_7\",\"type\":\"table\"},\"end\":48228,\"start\":47267}]", "paragraph": "[{\"end\":2395,\"start\":2192},{\"end\":3484,\"start\":2397},{\"end\":4431,\"start\":3486},{\"end\":5849,\"start\":4433},{\"end\":6879,\"start\":5851},{\"end\":6938,\"start\":6881},{\"end\":7550,\"start\":6940},{\"end\":8205,\"start\":7569},{\"end\":9241,\"start\":8230},{\"end\":9825,\"start\":9243},{\"end\":10251,\"start\":9827},{\"end\":11108,\"start\":10283},{\"end\":11551,\"start\":11138},{\"end\":12161,\"start\":11553},{\"end\":13247,\"start\":12163},{\"end\":13761,\"start\":13249},{\"end\":14697,\"start\":13803},{\"end\":15539,\"start\":14746},{\"end\":16577,\"start\":15541},{\"end\":17300,\"start\":16579},{\"end\":18138,\"start\":17302},{\"end\":18519,\"start\":18207},{\"end\":18618,\"start\":18567},{\"end\":18807,\"start\":18655},{\"end\":18961,\"start\":18903},{\"end\":19085,\"start\":18963},{\"end\":19263,\"start\":19185},{\"end\":19842,\"start\":19265},{\"end\":20240,\"start\":19844},{\"end\":20368,\"start\":20242},{\"end\":20525,\"start\":20370},{\"end\":21253,\"start\":20527},{\"end\":21729,\"start\":21305},{\"end\":21948,\"start\":21731},{\"end\":22399,\"start\":22034},{\"end\":22675,\"start\":22447},{\"end\":23126,\"start\":22677},{\"end\":23564,\"start\":23209},{\"end\":23687,\"start\":23618},{\"end\":23925,\"start\":23699},{\"end\":24003,\"start\":23927},{\"end\":24139,\"start\":24053},{\"end\":24270,\"start\":24151},{\"end\":24869,\"start\":24692},{\"end\":25451,\"start\":24871},{\"end\":25590,\"start\":25483},{\"end\":25746,\"start\":25692},{\"end\":26540,\"start\":25807},{\"end\":26713,\"start\":26569},{\"end\":27367,\"start\":26743},{\"end\":28686,\"start\":27369},{\"end\":29205,\"start\":28714},{\"end\":29294,\"start\":29229},{\"end\":30017,\"start\":29296},{\"end\":30812,\"start\":30019},{\"end\":31666,\"start\":30814},{\"end\":32171,\"start\":31668},{\"end\":33643,\"start\":32173},{\"end\":34654,\"start\":33645},{\"end\":36092,\"start\":34672},{\"end\":36188,\"start\":36107},{\"end\":36337,\"start\":36209},{\"end\":36451,\"start\":36339},{\"end\":36566,\"start\":36469},{\"end\":36679,\"start\":36604},{\"end\":36803,\"start\":36681},{\"end\":37013,\"start\":36818},{\"end\":37107,\"start\":37015},{\"end\":37172,\"start\":37109},{\"end\":37346,\"start\":37224},{\"end\":37542,\"start\":37361},{\"end\":37892,\"start\":37544},{\"end\":37976,\"start\":37905},{\"end\":38280,\"start\":37978},{\"end\":38488,\"start\":38309},{\"end\":38506,\"start\":38490},{\"end\":38775,\"start\":38646}]", "formula": "[{\"attributes\":{\"id\":\"formula_0\"},\"end\":18654,\"start\":18619},{\"attributes\":{\"id\":\"formula_1\"},\"end\":18902,\"start\":18808},{\"attributes\":{\"id\":\"formula_2\"},\"end\":19184,\"start\":19086},{\"attributes\":{\"id\":\"formula_3\"},\"end\":22033,\"start\":21949},{\"attributes\":{\"id\":\"formula_4\"},\"end\":23208,\"start\":23127},{\"attributes\":{\"id\":\"formula_5\"},\"end\":23617,\"start\":23565},{\"attributes\":{\"id\":\"formula_6\"},\"end\":24052,\"start\":24004},{\"attributes\":{\"id\":\"formula_7\"},\"end\":24517,\"start\":24271},{\"attributes\":{\"id\":\"formula_8\"},\"end\":24691,\"start\":24517},{\"attributes\":{\"id\":\"formula_9\"},\"end\":25691,\"start\":25591},{\"attributes\":{\"id\":\"formula_10\"},\"end\":25806,\"start\":25747},{\"attributes\":{\"id\":\"formula_11\"},\"end\":36208,\"start\":36189},{\"attributes\":{\"id\":\"formula_12\"},\"end\":36468,\"start\":36452},{\"attributes\":{\"id\":\"formula_13\"},\"end\":36603,\"start\":36567},{\"attributes\":{\"id\":\"formula_14\"},\"end\":36817,\"start\":36804},{\"attributes\":{\"id\":\"formula_17\"},\"end\":37223,\"start\":37173},{\"attributes\":{\"id\":\"formula_18\"},\"end\":37904,\"start\":37893},{\"attributes\":{\"id\":\"formula_19\"},\"end\":38308,\"start\":38281},{\"attributes\":{\"id\":\"formula_20\"},\"end\":38645,\"start\":38507}]", "table_ref": "[{\"attributes\":{\"ref_id\":\"tab_3\"},\"end\":27169,\"start\":27153},{\"attributes\":{\"ref_id\":\"tab_3\"},\"end\":28441,\"start\":28433},{\"attributes\":{\"ref_id\":\"tab_3\"},\"end\":29329,\"start\":29320},{\"attributes\":{\"ref_id\":\"tab_3\"},\"end\":29639,\"start\":29571},{\"attributes\":{\"ref_id\":\"tab_3\"},\"end\":29681,\"start\":29672},{\"attributes\":{\"ref_id\":\"tab_3\"},\"end\":30554,\"start\":30545},{\"attributes\":{\"ref_id\":\"tab_3\"},\"end\":31785,\"start\":31777},{\"attributes\":{\"ref_id\":\"tab_3\"},\"end\":31972,\"start\":31964}]", "section_header": "[{\"end\":7567,\"start\":7553},{\"end\":8228,\"start\":8208},{\"end\":10281,\"start\":10254},{\"end\":11136,\"start\":11111},{\"end\":13801,\"start\":13764},{\"end\":14744,\"start\":14700},{\"end\":18205,\"start\":18141},{\"end\":18565,\"start\":18522},{\"end\":21303,\"start\":21256},{\"end\":22445,\"start\":22402},{\"end\":23697,\"start\":23690},{\"end\":24149,\"start\":24142},{\"end\":25481,\"start\":25454},{\"end\":26567,\"start\":26543},{\"end\":26741,\"start\":26716},{\"end\":28712,\"start\":28689},{\"end\":29227,\"start\":29208},{\"end\":34670,\"start\":34657},{\"end\":36105,\"start\":36095},{\"end\":37359,\"start\":37349},{\"end\":38785,\"start\":38777},{\"end\":39141,\"start\":39133},{\"end\":39205,\"start\":39197},{\"end\":39397,\"start\":39389},{\"end\":39654,\"start\":39646},{\"end\":39889,\"start\":39881},{\"end\":39965,\"start\":39957},{\"end\":39990,\"start\":39972},{\"end\":42014,\"start\":41991},{\"end\":42213,\"start\":42195},{\"end\":42986,\"start\":42969}]", "table": "[{\"end\":41754,\"start\":40663},{\"end\":42193,\"start\":42042},{\"end\":42967,\"start\":42323},{\"end\":45263,\"start\":43120},{\"end\":47266,\"start\":45370},{\"end\":48228,\"start\":47371}]", "figure_caption": "[{\"end\":39131,\"start\":38787},{\"end\":39195,\"start\":39143},{\"end\":39387,\"start\":39207},{\"end\":39644,\"start\":39399},{\"end\":39879,\"start\":39656},{\"end\":39955,\"start\":39891},{\"end\":39970,\"start\":39967},{\"end\":40201,\"start\":39995},{\"end\":40663,\"start\":40204},{\"end\":41989,\"start\":41757},{\"end\":42042,\"start\":42016},{\"end\":42323,\"start\":42216},{\"end\":43120,\"start\":42989},{\"end\":45370,\"start\":45266},{\"end\":47371,\"start\":47269}]", "figure_ref": "[{\"end\":7805,\"start\":7799},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":18325,\"start\":18318},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":19986,\"start\":19980},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":20722,\"start\":20713},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":21948,\"start\":21942},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":22229,\"start\":22222},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":26070,\"start\":26064},{\"attributes\":{\"ref_id\":\"fig_3\"},\"end\":27366,\"start\":27360},{\"attributes\":{\"ref_id\":\"fig_4\"},\"end\":28194,\"start\":28188},{\"attributes\":{\"ref_id\":\"fig_4\"},\"end\":28256,\"start\":28250},{\"attributes\":{\"ref_id\":\"fig_4\"},\"end\":28322,\"start\":28316},{\"attributes\":{\"ref_id\":\"fig_4\"},\"end\":28467,\"start\":28461},{\"attributes\":{\"ref_id\":\"fig_4\"},\"end\":28682,\"start\":28676},{\"attributes\":{\"ref_id\":\"fig_5\"},\"end\":30846,\"start\":30840},{\"attributes\":{\"ref_id\":\"fig_5\"},\"end\":31062,\"start\":31056},{\"attributes\":{\"ref_id\":\"fig_6\"},\"end\":31125,\"start\":31119},{\"attributes\":{\"ref_id\":\"fig_6\"},\"end\":31430,\"start\":31424},{\"end\":32535,\"start\":32529},{\"end\":32742,\"start\":32736},{\"end\":32982,\"start\":32976},{\"end\":32994,\"start\":32987},{\"attributes\":{\"ref_id\":\"fig_7\"},\"end\":33193,\"start\":33187},{\"end\":33474,\"start\":33467},{\"attributes\":{\"ref_id\":\"fig_4\"},\"end\":33926,\"start\":33920},{\"attributes\":{\"ref_id\":\"fig_7\"},\"end\":34103,\"start\":34097},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":34215,\"start\":34208}]", "bib_author_first_name": "[{\"end\":48500,\"start\":48499},{\"end\":48511,\"start\":48510},{\"end\":48519,\"start\":48518},{\"end\":48893,\"start\":48892},{\"end\":48902,\"start\":48901},{\"end\":48912,\"start\":48908},{\"end\":48920,\"start\":48919},{\"end\":49314,\"start\":49313},{\"end\":49321,\"start\":49320},{\"end\":49323,\"start\":49322},{\"end\":49333,\"start\":49332},{\"end\":49337,\"start\":49334},{\"end\":49344,\"start\":49343},{\"end\":49348,\"start\":49345},{\"end\":49355,\"start\":49354},{\"end\":49369,\"start\":49368},{\"end\":49371,\"start\":49370},{\"end\":49379,\"start\":49378},{\"end\":49381,\"start\":49380},{\"end\":49763,\"start\":49762},{\"end\":49770,\"start\":49769},{\"end\":49776,\"start\":49775},{\"end\":49783,\"start\":49782},{\"end\":50064,\"start\":50063},{\"end\":50072,\"start\":50071},{\"end\":50085,\"start\":50084},{\"end\":50087,\"start\":50086},{\"end\":50406,\"start\":50405},{\"end\":50413,\"start\":50412},{\"end\":50421,\"start\":50420},{\"end\":50423,\"start\":50422},{\"end\":50431,\"start\":50430},{\"end\":50433,\"start\":50432},{\"end\":50444,\"start\":50443},{\"end\":50457,\"start\":50456},{\"end\":50472,\"start\":50471},{\"end\":50474,\"start\":50473},{\"end\":50881,\"start\":50880},{\"end\":50891,\"start\":50890},{\"end\":50902,\"start\":50901},{\"end\":51177,\"start\":51176},{\"end\":51179,\"start\":51178},{\"end\":51187,\"start\":51186},{\"end\":51197,\"start\":51196},{\"end\":51470,\"start\":51469},{\"end\":51479,\"start\":51478},{\"end\":51486,\"start\":51485},{\"end\":51488,\"start\":51487},{\"end\":51498,\"start\":51497},{\"end\":51726,\"start\":51725},{\"end\":51728,\"start\":51727},{\"end\":51744,\"start\":51743},{\"end\":51751,\"start\":51750},{\"end\":51753,\"start\":51752},{\"end\":51761,\"start\":51760},{\"end\":52095,\"start\":52094},{\"end\":52103,\"start\":52102},{\"end\":52446,\"start\":52445},{\"end\":52457,\"start\":52456},{\"end\":52476,\"start\":52475},{\"end\":52478,\"start\":52477},{\"end\":52496,\"start\":52495},{\"end\":52886,\"start\":52885},{\"end\":52888,\"start\":52887},{\"end\":52896,\"start\":52895},{\"end\":52904,\"start\":52903},{\"end\":53241,\"start\":53240},{\"end\":53250,\"start\":53249},{\"end\":53257,\"start\":53256},{\"end\":53265,\"start\":53264},{\"end\":53272,\"start\":53271},{\"end\":53274,\"start\":53273},{\"end\":53643,\"start\":53642},{\"end\":53657,\"start\":53656},{\"end\":53659,\"start\":53658},{\"end\":53668,\"start\":53667},{\"end\":53670,\"start\":53669},{\"end\":53682,\"start\":53681},{\"end\":53684,\"start\":53683},{\"end\":53693,\"start\":53692},{\"end\":53695,\"start\":53694},{\"end\":53706,\"start\":53705},{\"end\":53714,\"start\":53713},{\"end\":53726,\"start\":53725},{\"end\":53738,\"start\":53737},{\"end\":54119,\"start\":54118},{\"end\":54127,\"start\":54126},{\"end\":54133,\"start\":54132},{\"end\":54427,\"start\":54426},{\"end\":54435,\"start\":54434},{\"end\":54444,\"start\":54443},{\"end\":54446,\"start\":54445},{\"end\":54455,\"start\":54454},{\"end\":54457,\"start\":54456},{\"end\":54465,\"start\":54464},{\"end\":54473,\"start\":54472},{\"end\":54749,\"start\":54748},{\"end\":54757,\"start\":54756},{\"end\":55002,\"start\":55001},{\"end\":55004,\"start\":55003},{\"end\":55016,\"start\":55015},{\"end\":55314,\"start\":55313},{\"end\":55322,\"start\":55321},{\"end\":55340,\"start\":55339},{\"end\":55349,\"start\":55348},{\"end\":55357,\"start\":55356},{\"end\":55365,\"start\":55364},{\"end\":55376,\"start\":55375},{\"end\":55385,\"start\":55384},{\"end\":55392,\"start\":55391},{\"end\":55394,\"start\":55393},{\"end\":55403,\"start\":55402},{\"end\":55409,\"start\":55408},{\"end\":55418,\"start\":55417},{\"end\":55422,\"start\":55419},{\"end\":55831,\"start\":55830},{\"end\":55833,\"start\":55832},{\"end\":55841,\"start\":55840},{\"end\":55851,\"start\":55850},{\"end\":56410,\"start\":56409},{\"end\":56424,\"start\":56423},{\"end\":56768,\"start\":56767},{\"end\":56775,\"start\":56774},{\"end\":56783,\"start\":56782},{\"end\":56799,\"start\":56798},{\"end\":56807,\"start\":56806},{\"end\":57193,\"start\":57192},{\"end\":57200,\"start\":57199},{\"end\":57206,\"start\":57205},{\"end\":57214,\"start\":57213},{\"end\":57570,\"start\":57569},{\"end\":57577,\"start\":57576},{\"end\":57584,\"start\":57583},{\"end\":57973,\"start\":57972},{\"end\":57984,\"start\":57983},{\"end\":57993,\"start\":57992},{\"end\":58007,\"start\":58006},{\"end\":58025,\"start\":58024},{\"end\":58384,\"start\":58383},{\"end\":58392,\"start\":58391},{\"end\":58705,\"start\":58704},{\"end\":58713,\"start\":58712},{\"end\":58720,\"start\":58719},{\"end\":58729,\"start\":58728},{\"end\":58738,\"start\":58737},{\"end\":59045,\"start\":59044},{\"end\":59057,\"start\":59053},{\"end\":59323,\"start\":59322},{\"end\":59331,\"start\":59330},{\"end\":59339,\"start\":59338},{\"end\":59723,\"start\":59722},{\"end\":59729,\"start\":59728},{\"end\":59736,\"start\":59735},{\"end\":59744,\"start\":59743},{\"end\":59746,\"start\":59745},{\"end\":59755,\"start\":59754},{\"end\":59763,\"start\":59762},{\"end\":59771,\"start\":59770},{\"end\":60146,\"start\":60145},{\"end\":60153,\"start\":60152},{\"end\":60160,\"start\":60159},{\"end\":60162,\"start\":60161},{\"end\":60173,\"start\":60172},{\"end\":60574,\"start\":60573},{\"end\":60580,\"start\":60579},{\"end\":60949,\"start\":60948},{\"end\":60963,\"start\":60962},{\"end\":60974,\"start\":60973},{\"end\":60982,\"start\":60981},{\"end\":61398,\"start\":61397},{\"end\":61408,\"start\":61407},{\"end\":61417,\"start\":61416},{\"end\":61815,\"start\":61814},{\"end\":61817,\"start\":61816},{\"end\":61826,\"start\":61825},{\"end\":61828,\"start\":61827},{\"end\":61842,\"start\":61841},{\"end\":61850,\"start\":61849},{\"end\":61862,\"start\":61861},{\"end\":61869,\"start\":61868},{\"end\":61876,\"start\":61875},{\"end\":62259,\"start\":62258},{\"end\":62266,\"start\":62265},{\"end\":62275,\"start\":62274},{\"end\":62284,\"start\":62283},{\"end\":62694,\"start\":62689}]", "bib_author_last_name": "[{\"end\":48508,\"start\":48501},{\"end\":48516,\"start\":48512},{\"end\":48528,\"start\":48520},{\"end\":48899,\"start\":48894},{\"end\":48906,\"start\":48903},{\"end\":48917,\"start\":48913},{\"end\":48924,\"start\":48921},{\"end\":49318,\"start\":49315},{\"end\":49330,\"start\":49324},{\"end\":49341,\"start\":49338},{\"end\":49352,\"start\":49349},{\"end\":49366,\"start\":49356},{\"end\":49376,\"start\":49372},{\"end\":49386,\"start\":49382},{\"end\":49767,\"start\":49764},{\"end\":49773,\"start\":49771},{\"end\":49780,\"start\":49777},{\"end\":49786,\"start\":49784},{\"end\":50069,\"start\":50065},{\"end\":50082,\"start\":50073},{\"end\":50092,\"start\":50088},{\"end\":50410,\"start\":50407},{\"end\":50418,\"start\":50414},{\"end\":50428,\"start\":50424},{\"end\":50441,\"start\":50434},{\"end\":50454,\"start\":50445},{\"end\":50469,\"start\":50458},{\"end\":50485,\"start\":50475},{\"end\":50888,\"start\":50882},{\"end\":50899,\"start\":50892},{\"end\":50913,\"start\":50903},{\"end\":51184,\"start\":51180},{\"end\":51194,\"start\":51188},{\"end\":51202,\"start\":51198},{\"end\":51476,\"start\":51471},{\"end\":51483,\"start\":51480},{\"end\":51495,\"start\":51489},{\"end\":51503,\"start\":51499},{\"end\":51741,\"start\":51729},{\"end\":51748,\"start\":51745},{\"end\":51758,\"start\":51754},{\"end\":51765,\"start\":51762},{\"end\":52100,\"start\":52096},{\"end\":52108,\"start\":52104},{\"end\":52454,\"start\":52447},{\"end\":52473,\"start\":52458},{\"end\":52493,\"start\":52479},{\"end\":52505,\"start\":52497},{\"end\":52893,\"start\":52889},{\"end\":52901,\"start\":52897},{\"end\":52912,\"start\":52905},{\"end\":53247,\"start\":53242},{\"end\":53254,\"start\":53251},{\"end\":53262,\"start\":53258},{\"end\":53269,\"start\":53266},{\"end\":53288,\"start\":53275},{\"end\":53654,\"start\":53644},{\"end\":53665,\"start\":53660},{\"end\":53679,\"start\":53671},{\"end\":53690,\"start\":53685},{\"end\":53703,\"start\":53696},{\"end\":53711,\"start\":53707},{\"end\":53723,\"start\":53715},{\"end\":53735,\"start\":53727},{\"end\":53742,\"start\":53739},{\"end\":54124,\"start\":54120},{\"end\":54130,\"start\":54128},{\"end\":54138,\"start\":54134},{\"end\":54432,\"start\":54428},{\"end\":54441,\"start\":54436},{\"end\":54452,\"start\":54447},{\"end\":54462,\"start\":54458},{\"end\":54470,\"start\":54466},{\"end\":54478,\"start\":54474},{\"end\":54754,\"start\":54750},{\"end\":54772,\"start\":54758},{\"end\":55013,\"start\":55005},{\"end\":55023,\"start\":55017},{\"end\":55319,\"start\":55315},{\"end\":55337,\"start\":55323},{\"end\":55346,\"start\":55341},{\"end\":55354,\"start\":55350},{\"end\":55362,\"start\":55358},{\"end\":55373,\"start\":55366},{\"end\":55382,\"start\":55377},{\"end\":55389,\"start\":55386},{\"end\":55400,\"start\":55395},{\"end\":55406,\"start\":55404},{\"end\":55415,\"start\":55410},{\"end\":55434,\"start\":55423},{\"end\":55838,\"start\":55834},{\"end\":55848,\"start\":55842},{\"end\":55856,\"start\":55852},{\"end\":56421,\"start\":56411},{\"end\":56429,\"start\":56425},{\"end\":56772,\"start\":56769},{\"end\":56780,\"start\":56776},{\"end\":56796,\"start\":56784},{\"end\":56804,\"start\":56800},{\"end\":56811,\"start\":56808},{\"end\":57197,\"start\":57194},{\"end\":57203,\"start\":57201},{\"end\":57211,\"start\":57207},{\"end\":57219,\"start\":57215},{\"end\":57574,\"start\":57571},{\"end\":57581,\"start\":57578},{\"end\":57589,\"start\":57585},{\"end\":57981,\"start\":57974},{\"end\":57990,\"start\":57985},{\"end\":58004,\"start\":57994},{\"end\":58022,\"start\":58008},{\"end\":58035,\"start\":58026},{\"end\":58389,\"start\":58385},{\"end\":58398,\"start\":58393},{\"end\":58710,\"start\":58706},{\"end\":58717,\"start\":58714},{\"end\":58726,\"start\":58721},{\"end\":58735,\"start\":58730},{\"end\":58743,\"start\":58739},{\"end\":59051,\"start\":59046},{\"end\":59063,\"start\":59058},{\"end\":59328,\"start\":59324},{\"end\":59336,\"start\":59332},{\"end\":59344,\"start\":59340},{\"end\":59726,\"start\":59724},{\"end\":59733,\"start\":59730},{\"end\":59741,\"start\":59737},{\"end\":59752,\"start\":59747},{\"end\":59760,\"start\":59756},{\"end\":59768,\"start\":59764},{\"end\":59776,\"start\":59772},{\"end\":60150,\"start\":60147},{\"end\":60157,\"start\":60154},{\"end\":60170,\"start\":60163},{\"end\":60177,\"start\":60174},{\"end\":60577,\"start\":60575},{\"end\":60585,\"start\":60581},{\"end\":60960,\"start\":60950},{\"end\":60971,\"start\":60964},{\"end\":60979,\"start\":60975},{\"end\":60990,\"start\":60983},{\"end\":61405,\"start\":61399},{\"end\":61414,\"start\":61409},{\"end\":61425,\"start\":61418},{\"end\":61823,\"start\":61818},{\"end\":61839,\"start\":61829},{\"end\":61847,\"start\":61843},{\"end\":61859,\"start\":61851},{\"end\":61866,\"start\":61863},{\"end\":61873,\"start\":61870},{\"end\":61890,\"start\":61877},{\"end\":62263,\"start\":62260},{\"end\":62272,\"start\":62267},{\"end\":62281,\"start\":62276},{\"end\":62291,\"start\":62285},{\"end\":62702,\"start\":62695}]", "bib_entry": "[{\"attributes\":{\"id\":\"b0\",\"matched_paper_id\":215769095},\"end\":48760,\"start\":48414},{\"attributes\":{\"id\":\"b1\",\"matched_paper_id\":86842359},\"end\":49215,\"start\":48762},{\"attributes\":{\"id\":\"b2\",\"matched_paper_id\":6109468},\"end\":49692,\"start\":49217},{\"attributes\":{\"id\":\"b3\",\"matched_paper_id\":10273270},\"end\":50005,\"start\":49694},{\"attributes\":{\"id\":\"b4\",\"matched_paper_id\":5481478},\"end\":50293,\"start\":50007},{\"attributes\":{\"id\":\"b5\",\"matched_paper_id\":539049},\"end\":50799,\"start\":50295},{\"attributes\":{\"id\":\"b6\",\"matched_paper_id\":115286243},\"end\":51102,\"start\":50801},{\"attributes\":{\"id\":\"b7\",\"matched_paper_id\":3648770},\"end\":51425,\"start\":51104},{\"attributes\":{\"id\":\"b8\",\"matched_paper_id\":6323985},\"end\":51673,\"start\":51427},{\"attributes\":{\"id\":\"b9\",\"matched_paper_id\":1047097},\"end\":51993,\"start\":51675},{\"attributes\":{\"id\":\"b10\",\"matched_paper_id\":17387366},\"end\":52352,\"start\":51995},{\"attributes\":{\"id\":\"b11\",\"matched_paper_id\":86494191},\"end\":52786,\"start\":52354},{\"attributes\":{\"id\":\"b12\",\"matched_paper_id\":11918274},\"end\":53140,\"start\":52788},{\"attributes\":{\"id\":\"b13\",\"matched_paper_id\":7553359},\"end\":53551,\"start\":53142},{\"attributes\":{\"id\":\"b14\",\"matched_paper_id\":15793182},\"end\":54058,\"start\":53553},{\"attributes\":{\"id\":\"b15\",\"matched_paper_id\":206668929},\"end\":54316,\"start\":54060},{\"attributes\":{\"id\":\"b16\",\"matched_paper_id\":8846603},\"end\":54746,\"start\":54318},{\"attributes\":{\"id\":\"b17\"},\"end\":54940,\"start\":54748},{\"attributes\":{\"id\":\"b18\",\"matched_paper_id\":88508195},\"end\":55214,\"start\":54942},{\"attributes\":{\"id\":\"b19\",\"matched_paper_id\":115809115},\"end\":55765,\"start\":55216},{\"attributes\":{\"id\":\"b20\",\"matched_paper_id\":5033462},\"end\":56072,\"start\":55767},{\"attributes\":{\"id\":\"b21\",\"matched_paper_id\":67771161},\"end\":56323,\"start\":56074},{\"attributes\":{\"id\":\"b22\",\"matched_paper_id\":233332761},\"end\":56637,\"start\":56325},{\"attributes\":{\"id\":\"b23\",\"matched_paper_id\":233333139},\"end\":57087,\"start\":56639},{\"attributes\":{\"id\":\"b24\",\"matched_paper_id\":226466954},\"end\":57447,\"start\":57089},{\"attributes\":{\"id\":\"b25\",\"matched_paper_id\":198458738},\"end\":57838,\"start\":57449},{\"attributes\":{\"id\":\"b26\",\"matched_paper_id\":244210983},\"end\":58316,\"start\":57840},{\"attributes\":{\"id\":\"b27\"},\"end\":58595,\"start\":58318},{\"attributes\":{\"id\":\"b28\",\"matched_paper_id\":215817383},\"end\":58990,\"start\":58597},{\"attributes\":{\"id\":\"b29\",\"matched_paper_id\":119848553},\"end\":59209,\"start\":58992},{\"attributes\":{\"id\":\"b30\",\"matched_paper_id\":3569214},\"end\":59605,\"start\":59211},{\"attributes\":{\"id\":\"b31\",\"matched_paper_id\":216421783},\"end\":60057,\"start\":59607},{\"attributes\":{\"id\":\"b32\",\"matched_paper_id\":54194893},\"end\":60404,\"start\":60059},{\"attributes\":{\"id\":\"b33\",\"matched_paper_id\":213030707},\"end\":60856,\"start\":60406},{\"attributes\":{\"id\":\"b34\",\"matched_paper_id\":52161901},\"end\":61232,\"start\":60858},{\"attributes\":{\"id\":\"b35\",\"matched_paper_id\":206711357},\"end\":61740,\"start\":61234},{\"attributes\":{\"id\":\"b36\",\"matched_paper_id\":7458500},\"end\":62152,\"start\":61742},{\"attributes\":{\"id\":\"b37\",\"matched_paper_id\":49193946},\"end\":62617,\"start\":62154},{\"attributes\":{\"id\":\"b38\"},\"end\":63472,\"start\":62619}]", "bib_title": "[{\"end\":48497,\"start\":48414},{\"end\":48890,\"start\":48762},{\"end\":49311,\"start\":49217},{\"end\":49760,\"start\":49694},{\"end\":50061,\"start\":50007},{\"end\":50403,\"start\":50295},{\"end\":50878,\"start\":50801},{\"end\":51174,\"start\":51104},{\"end\":51467,\"start\":51427},{\"end\":51723,\"start\":51675},{\"end\":52092,\"start\":51995},{\"end\":52443,\"start\":52354},{\"end\":52883,\"start\":52788},{\"end\":53238,\"start\":53142},{\"end\":53640,\"start\":53553},{\"end\":54116,\"start\":54060},{\"end\":54424,\"start\":54318},{\"end\":54999,\"start\":54942},{\"end\":55311,\"start\":55216},{\"end\":55828,\"start\":55767},{\"end\":56142,\"start\":56074},{\"end\":56407,\"start\":56325},{\"end\":56765,\"start\":56639},{\"end\":57190,\"start\":57089},{\"end\":57567,\"start\":57449},{\"end\":57970,\"start\":57840},{\"end\":58702,\"start\":58597},{\"end\":59042,\"start\":58992},{\"end\":59320,\"start\":59211},{\"end\":59720,\"start\":59607},{\"end\":60143,\"start\":60059},{\"end\":60571,\"start\":60406},{\"end\":60946,\"start\":60858},{\"end\":61395,\"start\":61234},{\"end\":61812,\"start\":61742},{\"end\":62256,\"start\":62154},{\"end\":62687,\"start\":62619}]", "bib_author": "[{\"end\":48510,\"start\":48499},{\"end\":48518,\"start\":48510},{\"end\":48530,\"start\":48518},{\"end\":48901,\"start\":48892},{\"end\":48908,\"start\":48901},{\"end\":48919,\"start\":48908},{\"end\":48926,\"start\":48919},{\"end\":49320,\"start\":49313},{\"end\":49332,\"start\":49320},{\"end\":49343,\"start\":49332},{\"end\":49354,\"start\":49343},{\"end\":49368,\"start\":49354},{\"end\":49378,\"start\":49368},{\"end\":49388,\"start\":49378},{\"end\":49769,\"start\":49762},{\"end\":49775,\"start\":49769},{\"end\":49782,\"start\":49775},{\"end\":49788,\"start\":49782},{\"end\":50071,\"start\":50063},{\"end\":50084,\"start\":50071},{\"end\":50094,\"start\":50084},{\"end\":50412,\"start\":50405},{\"end\":50420,\"start\":50412},{\"end\":50430,\"start\":50420},{\"end\":50443,\"start\":50430},{\"end\":50456,\"start\":50443},{\"end\":50471,\"start\":50456},{\"end\":50487,\"start\":50471},{\"end\":50890,\"start\":50880},{\"end\":50901,\"start\":50890},{\"end\":50915,\"start\":50901},{\"end\":51186,\"start\":51176},{\"end\":51196,\"start\":51186},{\"end\":51204,\"start\":51196},{\"end\":51478,\"start\":51469},{\"end\":51485,\"start\":51478},{\"end\":51497,\"start\":51485},{\"end\":51505,\"start\":51497},{\"end\":51743,\"start\":51725},{\"end\":51750,\"start\":51743},{\"end\":51760,\"start\":51750},{\"end\":51767,\"start\":51760},{\"end\":52102,\"start\":52094},{\"end\":52110,\"start\":52102},{\"end\":52456,\"start\":52445},{\"end\":52475,\"start\":52456},{\"end\":52495,\"start\":52475},{\"end\":52507,\"start\":52495},{\"end\":52895,\"start\":52885},{\"end\":52903,\"start\":52895},{\"end\":52914,\"start\":52903},{\"end\":53249,\"start\":53240},{\"end\":53256,\"start\":53249},{\"end\":53264,\"start\":53256},{\"end\":53271,\"start\":53264},{\"end\":53290,\"start\":53271},{\"end\":53656,\"start\":53642},{\"end\":53667,\"start\":53656},{\"end\":53681,\"start\":53667},{\"end\":53692,\"start\":53681},{\"end\":53705,\"start\":53692},{\"end\":53713,\"start\":53705},{\"end\":53725,\"start\":53713},{\"end\":53737,\"start\":53725},{\"end\":53744,\"start\":53737},{\"end\":54126,\"start\":54118},{\"end\":54132,\"start\":54126},{\"end\":54140,\"start\":54132},{\"end\":54434,\"start\":54426},{\"end\":54443,\"start\":54434},{\"end\":54454,\"start\":54443},{\"end\":54464,\"start\":54454},{\"end\":54472,\"start\":54464},{\"end\":54480,\"start\":54472},{\"end\":54756,\"start\":54748},{\"end\":54774,\"start\":54756},{\"end\":55015,\"start\":55001},{\"end\":55025,\"start\":55015},{\"end\":55321,\"start\":55313},{\"end\":55339,\"start\":55321},{\"end\":55348,\"start\":55339},{\"end\":55356,\"start\":55348},{\"end\":55364,\"start\":55356},{\"end\":55375,\"start\":55364},{\"end\":55384,\"start\":55375},{\"end\":55391,\"start\":55384},{\"end\":55402,\"start\":55391},{\"end\":55408,\"start\":55402},{\"end\":55417,\"start\":55408},{\"end\":55436,\"start\":55417},{\"end\":55840,\"start\":55830},{\"end\":55850,\"start\":55840},{\"end\":55858,\"start\":55850},{\"end\":56423,\"start\":56409},{\"end\":56431,\"start\":56423},{\"end\":56774,\"start\":56767},{\"end\":56782,\"start\":56774},{\"end\":56798,\"start\":56782},{\"end\":56806,\"start\":56798},{\"end\":56813,\"start\":56806},{\"end\":57199,\"start\":57192},{\"end\":57205,\"start\":57199},{\"end\":57213,\"start\":57205},{\"end\":57221,\"start\":57213},{\"end\":57576,\"start\":57569},{\"end\":57583,\"start\":57576},{\"end\":57591,\"start\":57583},{\"end\":57983,\"start\":57972},{\"end\":57992,\"start\":57983},{\"end\":58006,\"start\":57992},{\"end\":58024,\"start\":58006},{\"end\":58037,\"start\":58024},{\"end\":58391,\"start\":58383},{\"end\":58400,\"start\":58391},{\"end\":58712,\"start\":58704},{\"end\":58719,\"start\":58712},{\"end\":58728,\"start\":58719},{\"end\":58737,\"start\":58728},{\"end\":58745,\"start\":58737},{\"end\":59053,\"start\":59044},{\"end\":59065,\"start\":59053},{\"end\":59330,\"start\":59322},{\"end\":59338,\"start\":59330},{\"end\":59346,\"start\":59338},{\"end\":59728,\"start\":59722},{\"end\":59735,\"start\":59728},{\"end\":59743,\"start\":59735},{\"end\":59754,\"start\":59743},{\"end\":59762,\"start\":59754},{\"end\":59770,\"start\":59762},{\"end\":59778,\"start\":59770},{\"end\":60152,\"start\":60145},{\"end\":60159,\"start\":60152},{\"end\":60172,\"start\":60159},{\"end\":60179,\"start\":60172},{\"end\":60579,\"start\":60573},{\"end\":60587,\"start\":60579},{\"end\":60962,\"start\":60948},{\"end\":60973,\"start\":60962},{\"end\":60981,\"start\":60973},{\"end\":60992,\"start\":60981},{\"end\":61407,\"start\":61397},{\"end\":61416,\"start\":61407},{\"end\":61427,\"start\":61416},{\"end\":61825,\"start\":61814},{\"end\":61841,\"start\":61825},{\"end\":61849,\"start\":61841},{\"end\":61861,\"start\":61849},{\"end\":61868,\"start\":61861},{\"end\":61875,\"start\":61868},{\"end\":61892,\"start\":61875},{\"end\":62265,\"start\":62258},{\"end\":62274,\"start\":62265},{\"end\":62283,\"start\":62274},{\"end\":62293,\"start\":62283},{\"end\":62704,\"start\":62689}]", "bib_venue": "[{\"end\":48565,\"start\":48530},{\"end\":48961,\"start\":48926},{\"end\":49423,\"start\":49388},{\"end\":49823,\"start\":49788},{\"end\":50120,\"start\":50094},{\"end\":50513,\"start\":50487},{\"end\":50937,\"start\":50915},{\"end\":51239,\"start\":51204},{\"end\":51527,\"start\":51505},{\"end\":51805,\"start\":51767},{\"end\":52148,\"start\":52110},{\"end\":52542,\"start\":52507},{\"end\":52937,\"start\":52914},{\"end\":53317,\"start\":53290},{\"end\":53771,\"start\":53744},{\"end\":54158,\"start\":54140},{\"end\":54502,\"start\":54480},{\"end\":54830,\"start\":54774},{\"end\":55052,\"start\":55025},{\"end\":55458,\"start\":55436},{\"end\":55893,\"start\":55858},{\"end\":56179,\"start\":56144},{\"end\":56447,\"start\":56431},{\"end\":56835,\"start\":56813},{\"end\":57243,\"start\":57221},{\"end\":57617,\"start\":57591},{\"end\":58063,\"start\":58037},{\"end\":58381,\"start\":58318},{\"end\":58767,\"start\":58745},{\"end\":59086,\"start\":59065},{\"end\":59382,\"start\":59346},{\"end\":59803,\"start\":59778},{\"end\":60205,\"start\":60179},{\"end\":60608,\"start\":60587},{\"end\":61017,\"start\":60992},{\"end\":61462,\"start\":61427},{\"end\":61924,\"start\":61892},{\"end\":62369,\"start\":62293},{\"end\":62887,\"start\":62704},{\"end\":62908,\"start\":62889}]"}}}, "year": 2023, "month": 12, "day": 17}