{"id": 252905014, "updated": "2022-10-20 13:25:27.974", "metadata": {"title": "Dual-Task Learning for Multi-Behavior Sequential Recommendation", "authors": "[{\"first\":\"Jinwei\",\"last\":\"Luo\",\"middle\":[]},{\"first\":\"Mingkai\",\"last\":\"He\",\"middle\":[]},{\"first\":\"Xiaolin\",\"last\":\"Lin\",\"middle\":[]},{\"first\":\"Weike\",\"last\":\"Pan\",\"middle\":[]},{\"first\":\"Zhong\",\"last\":\"Ming\",\"middle\":[]}]", "venue": null, "journal": "Proceedings of the 31st ACM International Conference on Information & Knowledge Management", "publication_date": {"year": 2022, "month": null, "day": null}, "abstract": "Recently, sequential recommendation has become a research hotspot while multi-behavior sequential recommendation (MBSR) that exploits users' heterogeneous interactions in sequences has received relatively little attention. Existing works often overlook the complementary effect of different perspectives when addressing the MBSR problem. In addition, there are two specific challenges remained to be addressed. One is the heterogeneity of a user's intention and the context information, the other one is the sparsity of the interactions of target behavior. To release the potential of multi-behavior interaction sequences, we propose a novel framework named NextIP that adopts a dual-task learning strategy to convert the problem to two specific tasks, i.e., next-item prediction and purchase prediction. For next-item prediction, we design a target-behavior aware context aggregator (TBCG), which utilizes the next behavior to guide all kinds of behavior-specific item sub-sequences to jointly predict the next item. For purchase prediction, we design a behavior-aware self-attention (BSA) mechanism to extract a user's behavior-specific interests and treat them as negative samples to learn the user's purchase preferences. Extensive experimental results on two public datasets show that our NextIP performs significantly better than the state-of-the-art methods.", "fields_of_study": "[\"Computer Science\"]", "external_ids": {"arxiv": null, "mag": null, "acl": null, "pubmed": null, "pubmedcentral": null, "dblp": "conf/cikm/LuoHLP022", "doi": "10.1145/3511808.3557298"}}, "content": {"source": {"pdf_hash": "b529b43c637949f340459278958b054184693276", "pdf_src": "ACM", "pdf_uri": null, "oa_url_match": false, "oa_info": null}, "grobid": {"id": "33410aeca1c7640cfb20b891d453f4404b718543", "type": "plain-text", "url": "s3://ai2-s2-pdf-extraction-prod/parse-results/s2orc_worker/b529b43c637949f340459278958b054184693276.txt", "contents": "\nDual-Task Learning for Multi-Behavior Sequential Recommendation\nOctober 17-21, 2022. October 17-21, 2022\n\nJinwei Luo luojinwei2016@email.szu.edu.cn \nMingkai He \nXiaolin Lin \nWeike Pan panweike@szu.edu.cn \nZhong Ming mingz@szu.edu.cn \n\nShenzhen University Shenzhen\nChina\n\n\nShenzhen University Shenzhen\nChina\n\n\nShenzhen University Shenzhen\nChina\n\n\nShenzhen University Shenzhen\nChina\n\nDual-Task Learning for Multi-Behavior Sequential Recommendation\n\nProceedings of the 31st ACM International Conference on Information and Knowledge Management (CIKM '22)\nthe 31st ACM International Conference on Information and Knowledge Management (CIKM '22)Atlanta, GA, USAOctober 17-21, 2022. October 17-21, 202210.1145/3511808.3557298ACM Reference Format: Jinwei Luo, Mingkai He, Xiaolin Lin, Weike Pan, and Zhong Ming. 2022. Dual-Task Learning for Multi-Behavior Sequential Recommendation. In, GA, USA. ACM, New York, NY, USA, 10 pages. https://doi.org/10.1145/3511808.3557298 * co-corresponding authorsMulti-Behavior Sequential RecommendationNext-Item PredictionPurchase PredictionSelf-Attention\nRecently, sequential recommendation has become a research hotspot while multi-behavior sequential recommendation (MBSR) that exploits users' heterogeneous interactions in sequences has received relatively little attention. Existing works often overlook the complementary effect of different perspectives when addressing the MBSR problem. In addition, there are two specific challenges remained to be addressed. One is the heterogeneity of a user's intention and the context information, the other one is the sparsity of the interactions of target behavior. To release the potential of multi-behavior interaction sequences, we propose a novel framework named NextIP that adopts a dual-task learning strategy to convert the problem to two specific tasks, i.e., next-item prediction and purchase prediction. For next-item prediction, we design a target-behavior aware context aggregator (TBCG), which utilizes the next behavior to guide all kinds of behavior-specific item sub-sequences to jointly predict the next item. For purchase prediction, we design a behavior-aware self-attention (BSA) mechanism to extract a user's behavior-specific interests and treat them as negative samples to learn the user's purchase preferences. Extensive experimental results on two public datasets show that our NextIP performs significantly better than the state-of-the-art methods.CCS CONCEPTS• Information systems → Recommender systems.\n\nINTRODUCTION\n\nRecommender systems are often deemed indispensable for alleviating the information overload problem and assisting users to find their preferred items efficiently in many applications, e.g., e-commerce, news and entertainment [11]. Among the different research branches of recommender systems, sequential recommendation that aims to predict the next interaction (e.g., examination on an item) based on a user's previous interaction sequence of a certain type of behavior (e.g., examination) has become a research hotspot.\n\nHowever, sequential recommendation that solely leverages the interaction data of one single type of behavior may result in unsatisfactory recommendation performance especially when the behavior data is sparse [22]. Taking the e-commerce scenario as an example, on one hand, a company's ultimate goal is to guide users to purchase items while the purchase data is usually very rare. On the other hand, a real-world e-commerce platform often contains some more abundant auxiliary behaviors (e.g., examinations, adds-to-cart and adds-to-favorite). Therefore, we have the potential to mine and transfer knowledge from the auxiliary behaviors to improve the performance in predicting the target behaviors, i.e., purchases. We name this type of research problem as multi-behavior sequential recommendation (MBSR) in this paper. Although there are so far very few studies on MBSR, we believe that MBSR is often more in line with the settings of various real-world scenarios, which thus deserves more attention.\n\nThe previous works on MBSR can be roughly classified into two branches: one is to model the behavior-agnostic item sequences and the corresponding behavior sequences [18,29], and the other is to divide a multi-behavior interaction sequence into some behaviorspecific item sub-sequences for later joint modeling [32]. In addition, modeling the transitions from some auxiliary behaviors to a target behavior is essential for understanding a user's target-oriented preferences. For example, a user may examine some different brands of earphones for comparison before making a purchase decision, where the transitions from previous examinations to a final purchase usually indicate the user's real purchase-oriented preferences.\n\nMotivated by the above observations, we take a step forward and propose a novel solution named NextIP, which models a multibehavior interaction sequence in a new perspective and models the transitions from some auxiliary behaviors to the target behavior from a user's perspective. Firstly, to unlock the potential of a multi-behavior interaction sequence, we treat it as a behavior sequence, some behavior-specific item sub-sequences, and a behavioragnostic item sequence. Secondly, we utilize some item sequence encoders with different configurations to learn the item transition patterns at both the behavior-agnostic and behavior-specific levels.\n\nMoreover, in order to address the intention heterogeneity issue and transfer different behavior-specific knowledge to varying degrees, we design a target-behavior aware context aggregator (TBCG) to exploit the next behavior to guide all kinds of behavior-specific item sub-sequences to jointly predict the next interaction. Thirdly, we introduce a second task that focuses on distinguishing the real purchase from the previous other auxiliary behaviors. Specifically, we design a behavior-aware self-attention (BSA) mechanism to extract a user's behavior-specific interests (i.e., virtual items) in a certain time interval and treat them as the negative samples to help learn the purchase preferences more effectively.\n\nWe summarize our main contributions as follows.\n\n• We propose a novel solution named NextIP for an important and emerging problem, i.e., multi-behavior sequential recommendation (MBSR), which studies the problem from a new perspective by converting it to a next-item prediction task and a purchase prediction task. • In the first task, we design a novel target-behavior aware context aggregator (TBCG) to achieve knowledge transfer among different sub-sequences, which helps predict the next item in a behavior-aware manner more accurately. • In the second task, we explicitly model the heterogeneous transitions from a user's perspective via a novel behavioraware self-attention (BSA) mechanism. • We conduct extensive empirical studies on two real-world datasets and compare our NextIP with fifteen state-of-theart methods, and show its effectiveness from five different angles.\n\n\nRELATED WORK\n\nIn this section, we review some representative methods in singlebehavior sequential recommendation, multi-behavior recommendation and multi-behavior sequential recommendation, respectively.\n\n\nSingle-Behavior Sequential Recommendation\n\nThe earliest works of sequential recommendation are based on Markov chains (MCs) and matrix factorization (MF) models. For instance, FPMC [26] models the long-term and short-term preferences of a user via MF and first-order MCs. Fossil [10] replaces the MF component in FPMC with the factored item similarity model (FISM) [15] and uses high-order MCs to consider more than one previous item. Besides, some researchers [9,17] propose some translation-based methods for maintaining the triangle inequality in sequential data. With the development of deep learning, various techniques are applied to sequential recommendation. Recurrent neural network (RNN) is probably the very first technique due to its instincts of modeling sequential patterns [5,13]. Convolutional neural network (CNN)-based methods such as Caser [28] and NextItNet [43] have also been proposed to consider skip connections and transitions at union-level. Based on the success of Transformer and the attention mechanism in NLP [30], SASRec [16] is proposed to use some selfattention modules to encode the sequential information of historical sequences. BERT4Rec [27] borrows the idea of the cloze task in NLP and trains a model in a bidirectional manner. FISSA [19] combines SASRec with a global preference learning model in a balanced way, which is found to be very effective for sequential recommendation. In addition, many researchers propose to leverage graph neural network (GNN) to model the sequential data, especially in sessionbased recommendation [24,33,35,40], where one important difference between session-based recommendation and sequential recommendation is that the data of the former is from anonymous users and the sequences are often relatively short [31].\n\n\nMulti-Behavior Recommendation\n\nSome works on multi-behavior recommendation (MBR) are based on MF models. For instance, adaptive BPR (ABPR) [23] learns the weight of different auxiliary behaviors adaptively and multichannel BPR [20] proposes to sample some negative items from different behavior channels differently. Recently, deep learningbased methods show promising performance in MBR [2,3,37]. NMTR [6] extends NCF [11] to deal with a multi-behavior data with a multi-task framework. Moreover, many researchers propose to leverage GNN to capture the different relations between users and items. MBGCN [14] proposes to construct a (user, item) bipartite graph with multiple kinds of edges that represent different behaviors and uses graph convolutional network to enhance the representation learning. MB-GMN [38] further proposes a graph meta network to capture different behavior semantics and relations, which is found to be very effective in MBR. VAE++ [21] is the most recent variational autoencoder (VAE)-based method that simultaneously models three types of signals, including the target behavior, the auxiliary behavior and their mixed behaviors with multiple encoders and one single decoder. There are also some recent MBR methods that adopt contrastive learning to model the differences and correlations among different behavioral patterns of users [34,36,41], which is similar to our motivation in the purchase prediction task.\n\nIt is worth mentioning that there are some significant differences between MBR and MBSR, because capturing the complex sequential information (e.g., global/local preferences, behavior transitions, behavior tendency/continuity, long/short sequences, periodicity, etc.) is not a trivial task. This actually motivates numerous works on sequential recommendation (including a few studies on MBSR). Our empirical studies also show that capturing the sequential information is critical in delivering accurate recommendation services.\n\n\nMulti-Behavior Sequential Recommendation\n\nThough there are lots of works on multi-behavior recommendation [4], few of them pay attention to modeling the sequential dynamics in MBSR. Existing works on MBSR can be divided into two categories according to the modeling perspectives. The first category is to model the behavior-agnostic item sequences and the corresponding behavior sequences [18,22], which either uses the behavior sequence to enrich the input of the model or directly models the behavior sequences. For instance, RIB [44] concatenates a behavior embedding and an item embedding in the input layer of GRU. ASLI [29] uses a self-attention layer to model the item sequences, and a convolutional network to leverage the behavior and category sequences to learn a user's intents. MKM-SR [22] adopts a gated GNN (GGNN) to model the behavior-agnostic item sequence of a session and uses a GRU layer to model the corresponding behavior sequence to obtain the behavior representation at each step. The advantage of this type of methods is that they allow the models to distinguish different types of behaviors while retaining the integrity of an entire interaction sequence.\n\nThe second category is to divide a multi-behavior interaction sequence into some behavior-specific item sub-sequences and model them jointly [39,42]. For example, MGNN-SPred [32] constructs a multi-relational item graph based on different behavior-specific item sequences for capturing the examination-to-examination and purchase-to-purchase relationships. DMT [7] proposes a deep interest Transformer to model each behavior-specific item sequence for the subsequent CTR task and CVR task. The merit of this modeling perspective is that the problem can be simplified into modeling the item sequences since the semantics of each behavior type can be learned via different parameters. Different from the above approaches, we propose a new modeling perspective for MBSR that leverages all the behavior sequences, behavior-agnostic and behavior-specific item sequences in a unified and complementary way. Moreover, we address the heterogeneity challenge and the sparsity challenge well in the next-item prediction task and purchase prediction task, respectively. Note that though MKM-SR [22] also adopts multi-task learning by introducing an auxiliary task of learning knowledge embeddings from a knowledge graph, our NextIP is different from it by converting the MBSR problem to two specific tasks, i.e., next-item prediction and purchase prediction.\n\n\nPRELIMINARIES\n\nIn this section, we first formally define the problem and give an overview of the proposed method as shown in Figure 1.\n\n\nProblem Definition\n\nIn a real-world platform such as an e-commerce site, we have a set of users U = { } and a set of items I = { }, where users' behaviors to items can be of multiple types B = { , , , } such as examination ( ), add-to-favorite ( ), add-to-cart ( ) and purchase ( ). Each user is associated with an interaction sequence of (item, behavior) pairs S = 1 , 1 , . . . , ℓ , ℓ , . . . , , , where ℓ ∈ I denotes the ℓth item interacted by user with behavior ℓ ∈ B.\n\nThe goal of multi-behavior sequential recommendation (MBSR) is then to exploit the information in S and recommend the next likely-to-purchase item for each user .\n\n\nChallenges\n\nFor the studied MBSR problem, there are two specific challenges that remained to be addressed. From the perspective of sequence, users often have different behavioral intentions (i.e., examination, purchase) at different time steps, and there are different contextual information of behaviors in the historical process. Therefore, the first challenge is the heterogeneity of a user's intention and the context information, i.e., how to adaptively utilize heterogeneous Table 1: Some notations and their explanations used in the paper.\nU = { } the whole set of users I = { } the whole set of items B\nthe set of behaviors ℓ ∈ I the ℓth item interacted by user ℓ ∈ B the ℓth behavior type interacted by user\nS = { ℓ , ℓ } the interaction sequence of user ∈ R number of latent dimensions ∈ R length of the sequence ∈ R | U |× user embedding matrix ∈ R 1× user embedding of user ∈ R | I |× item embedding matrix ∈ R 1× item embedding of item ∈ R | B |× behavior embedding matrix ℓ behavior embedding of user at step ℓ ∈ R × position embedding matrix (·) self-attention block ( ) ∈ R ×\nrepresentation matrix of a behavior-agnostic item sequence in th layer of SAB ( ) ∈ R × representation matrix of an examination-specific item sequence in th layer of SAB\n,ℓ ∈ R 1×\nbehavior-agnostic sequence representation of user\nat step ℓ ′ ,ℓ ∈ R 1×\nbehavior-aware context representation of user at step ℓ contextual information for a user with different behavioral intentions. From the perspective of behavior, the second challenge lies in the sparsity of the data of target behavior, hindering us to learn a user's purchase preferences effectively.\n\n\nOverview\n\nAs a response to the aforementioned two challenges, we propose a novel and effective framework named NextIP that adopts a dual-task learning strategy to convert the problem to two specific tasks, i.e., next-item prediction and purchase prediction. Firstly, we address the heterogeneity challenge in task 1 (in the bottom left corner of Figure 1) by designing a novel target-behavior aware context aggregator (TBCG) to transfer the unique knowledge of different types of behaviors so as to predict the next item in a behavior-aware manner. Secondly, we address the sparsity challenge in task 2 (in the bottom right corner of Figure 1). Specifically, all the items that a user has interacted with are treated as positive samples in task 1, while in task 2, we propose to treat the items associated with auxiliary behaviors as negative signals to refine the learning of a user's purchase-oriented preferences.\n\n\nPROPOSED METHODOLOGY\n\nIn this section, we introduce each component of our NextIP in detail. We list some notions and their explanations used in this paper in Table 1.\n\n\nEmbedding Layer\n\nFirst of all, we present an embedding layer to convert an input multi-behavior interaction sequence S to different embeddings. In general, our NextIP takes a multi-behavior interaction sequence of user as input and obtains the representations of the behavior sequence, each behavior-specific item sub-sequence and the behavior-agnostic item sequence as well as the user embedding in the embedding layer. These representations are then fed into two well-designed tasks, i.e., a next-item prediction task (in the bottom left corner) and a purchase prediction task (in the bottom right corner) to capture both the user's behavior-aware short-term interests and purchase-oriented long-term preferences, which are finally used to fulfill the final prediction.\n\nWe have a learnable behavior embedding matrix ∈ R | B |× , an item embedding matrix ∈ R | I |× , a position embedding matrix ∈ R | |× and a user embedding matrix ∈ R | U |× , where is the size of latent dimension. Through embedding look-up operations from , we can retrieve and stack the item embeddings of S as an embedding matrix = 1 ; . . . ; ℓ ; . . . ; ∈ R × .\n\nFollowing [16], the representation of a behavior-agnostic item sequence can be obtained by adding two embedding matrices, i.e., (0) = + .\n\nIn order to unlock the potential of a multi-behavior interaction sequence, we further represent a user's behavior-specific item sequence by behavior-specific masking. Without loss of generality, we take the examination-specific item sequence as an example,\n(0) = (0) ⊗ ,(1)\nwhere ⊗ is the element-wise product.\n= [ 1 ; . . . ; ℓ ; . . . ; ] ∈\nR × denotes the examination-specific mask matrix, in which ℓ is a vector of ones if ℓ = , and a vector of zeros otherwise. Similarly, we can obtain \n\n\nTask 1: Next-Item Prediction\n\nThe first task is to predict the next item in a behavior-aware manner by utilizing the behavior sequences, behavior-specific and behavioragnostic item sequences in a unified and complementary way. In this task, we first encode the behavior-agnostic preferences and behavior-specific context in an item sequence encoder and then introduce a novel target-behavior aware context aggregator (TBCG) to transfer the unique knowledge of different types of behaviors.\n\n\nItem Sequence Encoder.\n\nTo obtain different context information in all the behavior-agnostic and behavior-specific sequences, we choose self-attention block (SAB) [16] for the item sequence encoder since it is known effective. Moreover, the parameters of each self-attention network are independent across different kinds of item sequences, which are used to capture different semantic information and transition patterns. For instance, the transitions in an examination-specific item sequence usually indicate similarity among the items while those in a purchase-specific item sequence often mean complementarity to some extent. Omitting the formulas of the layer normalization and residual connection, each SAB consists of a self-attention layer (SAL), and a feed-forward layer (FFL),\n( ) = ( ( )),(2)′ = ( ) = ( ( √ ) ⊗ ) ,(3)( ′ ) = ( ′ 1 + 1 ) 2 + 2 ,(4)\nwhere = , = and = with , , ∈ R × are the projected query, key and value matrices, respectively. Note that √ in SAL(·) is the scaling factor to prevent overlarge values of the inner product and is the causality mask used to ensure that only the previous ℓ items are taken into account when predicting the (ℓ + 1)th item. 1 , 2 ∈ R × and 1 , 2 ∈ R 1× are learnable weights and biases of the two-layer network, respectively. By feeding ( ) for the behavior-specific item sequences. Note that we remove the superscript for brevity in Figure 1 and in the subsequent text.\n\n\nTarget-Behavior Aware Context\n\nAggregator. Different types of behavior-specific item sequences can provide different contextual information, which thus should be explicitly exploited. For instance, the records of a user's recent examinations on some earphones are useful signals that the next purchase might be an earphone, and knowing a user bought an iPhone last month can inform us to predict that the user is likely to buy an AirPods. However, the context information needs to be well balanced when predicting different behaviors, since the dependency across different behaviors is complex. Therefore, we design a target-behavior aware context aggregator (TBCG), which takes a user's target behavior embedding to improve the context aggregation. Specifically, at the current step ℓ, we stack up the context representations of different behaviors (i.e., [ ,ℓ ; ,ℓ ; ,ℓ ; ,ℓ ]) and take them as keys and values, while leveraging the user's behavior embedding at the next step ℓ +1 as a query to adaptively extract the context that is more relevant to predict the next item,\n′ ℓ = ℓ +1 ′ ,(5)′ ℓ = [ ,ℓ ; ,ℓ ; ,ℓ ; ,ℓ ] ′ ,(6)′ ℓ = [ ,ℓ ; ,ℓ ; ,ℓ ; ,ℓ ] ′ ,(7)\n,ℓ = (\n′ ℓ ′ ℓ √ ) ′ ℓ ,(8)\nwhere ′ ℓ ∈ R 1× , ′ ℓ ∈ R 4× and ′ ℓ ∈ R 4× are the projected query, key and value matrices, respectively. And ′ , ′ , ′ ∈ R × are the learnable weight matrices. Note that ,ℓ denotes the gated context representation of user at step ℓ considering the user's target behavior.\n\nAfter that, we can further obtain the refined behavior-aware context representation by combining ,ℓ with the context representation of user at step ℓ for behavior type * , i.e., * ,ℓ , via mean pooling,\n′ ,ℓ = ,ℓ + * ,ℓ 2 ,(9)\nwhere * denotes the next behavior of the current step, i.e., ℓ+1 ∈ B. We find that setting the weight of the elements uniformly often leads to good performance in our empirical studies. The main idea behind Eq.(9) is to enhance the contribution of the context representation of the next behavior type at the current step in the training phase. Note that in the evaluation phase, we will fix the next behavior type as purchase , since our goal is next purchased item prediction.\n\nNotably, to facilitate matrix-level operations, we utilize sequential padding to fill the empty values of each behavior-specific context matrix to ensure that the vector at step ℓ corresponds to the behavior-specific context information of the most recent step. Finally, we predict the probability that user will interact with item at the (ℓ + 1)th step as follows,\nℓ+1, = ( ,ℓ + ′ ,ℓ )( ) .(10)\nWe adopt the typical binary cross-entropy loss for task 1, which is the same as that in the seminal method SASRec [16],\nL 1 = − ∑︁ ∈U +1 ∑︁ ℓ=2 ( ℓ ) [log( (ˆℓ , ℓ )) +log(1− (ˆℓ , ))],(11)\nwhere is a negative item randomly sampled from I\\ for each position ℓ ∈ {2, ..., + 1}. The indicator function ( ℓ ) = 1 if ℓ is not a padding item, and 0 otherwise. The indicator function ( ℓ ) is used to ignore the loss value when ℓ is a padding item, since we follow the common practice and use a padding item to pad the user sequence to a same length .\n\n\nTask 2: Purchase Prediction\n\nTask 1 is designed to predict the next item of all behaviors and to learn a user's short-term interests while task 2 aims to learn a user's purchase-oriented long-term preferences. In addition, a user's purchase behavior is often much sparser in his or her interaction history, hindering us to learn the user's purchase preferences effectively. To address the above issues, we leverage a user's behavior transitions to learn his or her purchase-oriented preferences in a selfsupervised manner. For instance, users often interact with different brands of earphones for comparison via some auxiliary behaviors (e.g., examination) before making a purchase decision. If a user finally chooses to purchase an item instead of other interacted items, this contains fine-grained information about the user's purchase preferences. Therefore, we should pay attention to distinguishing the purchased item from the previous items with some auxiliary behaviors.\n\n\n4.3.1\n\nBehavior-Aware Self-Attention. The intentions reflected in a user's interaction history are usually diverse and uncertain. For example, a user might examine clothes before purchasing an earphone, and thus assuming the user prefers the earphone to each cloth may not be reasonable. To alleviate this uncertainty issue, we design a behavior-aware self-attention (BSA) mechanism to aggregate the collection of the historically interacted items of each kind of behavior into a virtual item w.r.t. each step. Firstly, we create an attention mask as follows,\n= ⊗ ,(12)\nwhere ∈ R × denotes the behavior-aware attention mask, ℓ,ℓ ′ = 1 if ℓ = ℓ ′ and ℓ − ℓ ′ ≤ , and ℓ,ℓ ′ = 0 otherwise. The usage of a length clip is to ensure that the aggregated items correspond to a similar intention of user . In order to further illustrate the attention mask in our NextIP shown in Eq.(12), we give an example in Figure 2. Next, we can use self-attention to aggregate each behavior-specific item set into a virtual item representation,\n= ( ( ′′ ′′ √ ) ⊗ ) ′′ ,(13)\nwhere ′′ = ′′ , ′′ = ′′ and ′′ = ′′ with ′′ , ′′ , ′′ ∈ R × as the projected query, key and value matrices, respectively. After BSA, for user , we can obtain = [ ,1 ; . . . ; ,ℓ ; . . . ; , ], where ,ℓ ∈ R 1× denotes the representation of a virtual item that user has recently interacted with using a certain behavior at step ℓ.\n\nWe then treat the virtual items' representations of every auxiliary behavior (e.g., examination) before a purchased item as negative samples, which will be used to learn the user's purchase-oriented preferences. We adopt the contrastive loss function to train the model as follows,\n( ) = exp / ,(14)( , ) = exp , / ,(15)L 2 = − ∑︁ ∈U ∑︁ ∈Y log ( ) ( ) + ∈ T ( , ) ( , ) ,(16)\nwhere ∈ Y is an item purchased by user , ∈ R 1× denotes the user embedding, and is the temperature parameter.\n\nis a learnable weight matrix to perform feature transformation, and T ( , ) is a set containing the step indices of each type of auxiliary behavior that is closest to the user's purchased item . Apart from the contrastive loss in Eq.(16), we can also use a BPR loss to distinguish positive samples from negative ones.\n\n\nLearning and Final Prediction\n\nWe train our NextIP in an end-to-end fashion by minimizing the loss on both task 1 and task 2,\nL = L 1 + L 2 .(17)\nNote that simply setting the weight of L 2 to 1 often leads to good performance in our empirical studies. Finally, we can predict the probability that user will purchase item at the (ℓ + 1)th step as follows,\nℓ+1, = ℓ ( ) .(18)\nwhere ℓ = ,ℓ + ′ ,ℓ + . Note that ,ℓ and ′ ,ℓ are optimized in L 1 while is optimized in L 2 .  Length denote the average length of users' interaction sequences in the datasets, and , , and denote examination, add-to-favorite, add-to-cart and purchase, respectively.\n\n\nEXPERIMENTS\n\nIn this section, we first introduce the datasets and the experimental settings. Then, we conduct extensive empirical studies to investigate the following four research questions:\n\n• RQ1: How does our NextIP perform when competing with the state-of-the-art baselines? • RQ2: What is the impact of different components in our NextIP? • RQ3: What is the impact of the different behavior-specific item sub-sequences in our NextIP? • RQ4: What is the rationality of our NextIP? How important are different source behaviors in predicting different behaviors?\n\n\nDatasets and Evaluation Metrics\n\nWe conduct offline experiments (online training and inference is an important future direction) on two public and real-world datasets in e-commerce scenarios, i.e., Tmall 1 and User Behavior (UB) 2 , which are released at the IJCAI Competitions 2015 and 2016, respectively. Both datasets contain different types of behaviors, i.e., examination, add-to-favorite, add-to-cart and purchase. We preprocess the datasets as follows: (i) for duplicated (user, item, behavior) tuples in a sequence, we only retain the first one; (ii) we discard the cold-start items with fewer than 10 and 20 purchase interactions for UB and Tmall, respectively; (iii) we discard the cold-start users with fewer than 5 and 10 purchase interactions for UB and Tmall, respectively; (iv) we remove the records of adds-to-cart in Tmall because of its rarity; (v) for each user, we take the last two purchase interactions as the validation and test data (note that the interactions between them are kept in final evaluation), and those before the penultimate purchase as the training data; and (vi) for the preferred items in the test data of each user, we remove them from the training data since we aim to recommend new items [32]. The statistics of the processed datasets are summarized in Table 2.\n\nWe evaluate the recommendation performance via recall (Rec@ ) and normalized discounted cumulative gain (NDCG@ ), where ∈ {1, 5, 10}. Rec@ means the proportion of cases when the preferred item is in a top-recommendation list, while NDCG@ pays attention to whether it has a relatively high-ranking position. We follow [16,19] and prepare a candidate list with 100 randomly sampled un-interacted items according to the item popularity for each user. Note that we also report the experimental results under the full-ranking setting, in which all items are considered as candidates without sampling.\n\n\nBaselines and Parameter Configurations\n\nTo show the effectiveness of our NextIP, we compare it with four groups of baselines. The first group contains two classic singlebehavior recommendation (SBR) methods: BPRMF [25]. A non-sequential model that optimizes matrix factorization using a pairwise ranking loss. FISM [15]. A non-sequential model that represents a user with his or her interacted items.\n\nThe second group contains two state-of-the-art multi-behavior recommendation (MBR) methods: MB-GMN [38]. A state-of-the-art GNN-based multi-behavior model that incorporates a graph meta network to learn multi-behavior patterns. VAE++ [21]. A state-of-the-art VAE-based multi-behavior model that utilizes three types of signals, including the purchases, the examinations and their mixed behaviors.\n\nThe third group contains six single-behavior sequential recommendation (SBSR) methods: FPMC [26]. A classic sequential model based on matrix factorization and first-order Markov chains (MCs). Fossil [10]. A classic sequential model which combines FISM [15] and high-order MCs to consider more than one previous item. GRU4Rec+ [12]. An RNN-based model which improves GRU4Rec [13] by applying a BPR-max loss and an additional sampling strategy. Caser [28]. A CNN-based model that utilizes some horizontal and vertical convolutional filters to capture different sequential patterns. SASRec [16]. A pioneering model based on hierarchical self-attention modules. FISSA [19]. A recent model for sequential recommendation that uses SASRec to learn a user's local preferences, an attentive version of FISM to learn his or her global preferences, and a gating module for balancing these two parts.\n\nThe fourth group contains five multi-behavior sequential recommendation (MBSR) methods: RIB [44]. An RNN-based model that takes the concatenation of the item embedding and the behavior embedding as the input of a GRU layer. BINN [18]. An RNN-based model that designs a contextual long short-term memory (CLSTM) structure to model the item and behavior sequences. MGNN-SPred [32]. A GNN-based model for MBSR that constructs a multi-relational item graph based on all kinds of behavior-specific item sub-sequences. M-SR [22]. A GNN-based model that uses a gated GNN (GGNN) to model the item sequences and uses a GRU layer to model the sequential patterns from sequences of operations (i.e., behavior types). Note that M-SR is a reduced version of MKM-SR without the knowledge graph. ASLI [29]. A recent model that uses a self-attention layer to model the item sequences, and a convolutional network to leverage the behavior and category sequences to obtain the users' intents, which are then used to query the relevant items. Note that we do not use the category sequences in the studied problem in this paper.\n\nFor RIB, BINN and ASLI, we implement them by TensorFlow. For other methods, we use the code released by their authors 3,4,5,6,7,8,9 10 . For fair comparison, we fix the embedding dimension of tune all models as 50 and all the hyper-parameters on the validation data following the suggestions in the original papers. For our NextIP, following [16,19], we set the sequence length to 50, the batch size to 128, the dropout rate to 0.5, and adopt the Adam optimizer with a learning rate of 0.001. The length clip in BSA is set to 10 and the temperature parameter of the contrastive loss is set to 0.07 [8]. The number of self-attention layers for all kinds of item sequences are searched from ∈ {1, 2, 3} [16,19].\n\n\nResults\n\n\nMain Results (RQ1).\n\nWe report the experimental results of fifteen baselines and our NextIP in Table 3. To further verify the effectiveness of our NextIP, we also report the experimental results of four representative baselines from four different groups and our NextIP under the full-ranking setting (i.e., all items are candidates) in Table 4. The best one of each column is marked in bold and the second best one is underlined.\n\nFor non-sequential single-behavior recommendation methods, FISM beats BPRMF in most cases, which indicates that modeling of user representation from all the interacted items can often lead to performance improvement.\n\nFor non-sequential multi-behavior recommendation methods, both the GNN-based method MB-GMN and VAE-based method VAE++ outperform the single-behavior recommendation methods in all cases, indicating the benefits of mining multi-behavior preferences. However, the performance of these two state-of-the-art MBR methods is worse than deep-learning-based SBSR methods and MBSR methods. It indicates that capturing the complex sequential information (e.g., global or local preferences, behavior transitions, behavior dependency, etc.) is critical in sparse sequence data.\n\nAmong the methods for sequential recommendation, we can have the following observations.\n\n• These methods surpass the non-sequential methods to a large extent in all cases, showing the importance of modeling the sequential information. • SASRec and FISSA consistently perform better than Caser and GRU4Rec+ on both datasets, which is consistent with the observations in previous studies [16,19] and indicates the advantage of a self-attention network for modeling the item sequences.\n\nAmong the methods for multi-behavior sequential recommendation, we can observe the following phenomena.\n\n• The RNN-based methods, i.e., RIB and BINN, beat the singlebehavior sequential method GRU4Rec+, which showcases that their modeling of the behavior sequences to distinguish different preferences of users benefits the performance.   Table 4: Recommendation performance of our NextIP and four representative baselines on UB and Tmall under the full-ranking setting, in which all items are considered as candidates. Note that the best one of each column is marked in bold, and the second best result is underlined.\n\n• MGNN-SPred performs poorly in our setting, which is believed because of uncompetitiveness of GNN-based methods for sequential recommendation. This is also observed by other researchers [1]. • ASLI outperforms BINN on both datasets, especially when coping with longer sequences in Tmall. The reason is that ASLI introduces an additional convolution module and an auxiliary loss to force the model to predict the next latent intent (i.e., the behavior type in our case), and the self-attention network is more suitable for modeling long item sequences than RNN. The experimental results in Table 4 shows the same tendency as that in Table 3. Our NextIP consistently achieves the best performance on both datasets comparing with all the baselines, which clearly demonstrates its superiority in modeling users' sequential and heterogeneous behaviors. Different from all the existing MBSR methods, our NextIP adopts a dual-task learning strategy to utilize the behavior sequences, behavior-specific and behavior-agnostic item sequences in a novel and unified way. In addition, we address the heterogeneity challenge in task 1 and the sparsity challenge in task 2, leading to significantly better performance.\n\n\nAblation Study (RQ2).\n\nIn order to understand the contribution of different components to the performance of our NextIP, we conduct an ablation study and report the results in Table 5. We have the following observations.\n\n• By removing the target-behavior aware context aggregator (TBCG) in task 1 and the behavior-aware self-attention (BSA) mechanism in task 2, our NextIP reduces to SASRec, i.e., NextIP(w/o TBCG&BSA), which only contains task 1 and utilizes the behavior-agnostic item sequences. The improvement of NextIP(w/o TBCG) over NextIP(w/o TBCG&BSA) demonstrates the rationality of constructing the purchase prediction task to exploit the heterogeneous transitions from auxiliary behaviors to target behaviors in a user's perspective.  only using one behavior-specific context information in predicting the corresponding behaviors, the behavior-specific item sequence encoders are hard to get trained well. • Our NextIP performs the best compared with all of its variants, which clearly demonstrates the positive complementary effect of all the designed components in our NextIP.\n\n\nImpact of Behavior-Specific Item Sequences (RQ3).\n\nIn order to study the impact of different behavior-specific item sequences on the performance of our NextIP, we conduct an additional ablation study and report the results in Figure 3. By removing each kind of behavior-specific item sequences in task 1, we can get four variants of our NextIP, i.e., \"-e\", \"-f\", \"-c\" and \"-p\". We have the following observations.\n\n• The performance decline of removing the examination-specific item sequences (i.e., \"-e\") is more significant than that of \"-f\" or \"-c\", because the examinations are much more abundant. • Our NextIP performs the best compared with all of its variants, which again clearly demonstrates the effectiveness and rationality of utilizing all the behavior-specific item sequences in our NextIP.\n\n\nCase Study (RQ4).\n\nTo investigate the adaptive knowledge transfer of the context information in different behavior-specific item sequences in predicting the next item of different types of target behaviors, we visualize the attention scores of different source behaviors to different target behaviors in TBCG. Specifically, after the model converges, we obtain the attention scores of all the users used for predicting different target behaviors in the training data. Finally, we visualize the mean attention scores from all the users in each data as a heatmap matrix shown in Figure 4. Note that the horizontal axis represents the source behaviors and the vertical axis represents the target behaviors. We can have the following observations.\n\n• The main diagonal elements of both heatmap matrices have the lowest attention scores in corresponding rows, which is reasonable since * ,ℓ is added to the final context representation as shown in Eq.(9).\n\n• When predicting purchases, the information contribution of adds-to-favorite and adds-to-cart is larger than that of examinations on both datasets, which is consistent with our intuition in online shopping. • When predicting adds-to-cart, the behaviors of adds-to-favorite are more informative than purchases in providing knowledge, because the interests reflected in the purchase-specific item sequences may have expired to some extent. In general, these observations further demonstrate the rationality and interpretability of our NextIP.\n\n\nCONCLUSIONS AND FUTURE WORK\n\nIn this work, we propose a novel framework named NextIP for multi-behavior sequential recommendation, which adopts a dualtask learning strategy to convert the problem to a next-item prediction task and a purchase prediction task. Specifically, we design a target-behavior aware context aggregator (TBCG) to transfer the unique knowledge of different behaviors so as to predict the next interaction in a behavior-aware manner more accurately. Moreover, we design a behavior-aware self-attention (BSA) mechanism to aggregate the collection of historical interacted items of each behavior and treat them as negative samples for more accurate learning of purchase-oriented preferences.\n\nFor future works, we are interested in extending our NextIP to incorporate knowledge graphs about users and items.\n\nFigure 1 :\n1The overview of our proposed NextIP. The pipeline of our NextIP is illustrated in the upper half part.\n\n\nother three behavior-specific item sequences.\n\n\n∈ R 1× denotes the representation of the user's behavior-agnostic context at step ℓ. Similarly, we can obtain\n\nFigure 2 :\n2An example of the attention mask in our NextIP.\n\nFigure 3 :\n3Recommendation performance (Rec@10) of our NextIP and its variants by removing different behaviorspecific item sub-sequences on Tmall and UB.\n\nFigure 4 :\n4Visualization of the attention scores of different source behaviors to different target behaviors in targetbehavior aware context aggregator (TBCG) of our NextIP on UB and Tmall.\n\nTable 2 :\n2Statistics of the processed datasets, where Avg.\n\nTable 3 :\n3Recommendation performance of our NextIP and four groups of baselines on UB and Tmall. Note that the best one of each column is marked in bold, and the second best result is underlined.Dataset \nMetric \nBPRMF \nVAE++ \nSASRec \nASLI \nNextIP \n\nUB \n\nRec@5 \n0.0143 \n0.0377 \n0.0436 \n0.0423 0.0448 \n\nNDCG@5 \n0.0086 \n0.0250 \n0.0224 \n0.0221 0.0231 \n\nRec@10 \n0.0281 \n0.0564 \n0.0766 \n0.0731 0.0790 \n\nNDCG@10 \n0.0130 \n0.0310 \n0.0331 \n0.0320 0.0340 \n\nTmall \n\nRec@5 \n0.0094 \n0.0255 \n0.0488 \n0.0514 0.0542 \n\nNDCG@5 \n0.0057 \n0.0175 \n0.0271 \n0.0283 0.0314 \n\nRec@10 \n0.0189 \n0.0387 \n0.0821 \n0.0859 0.0896 \n\nNDCG@10 \n0.0087 \n0.0217 \n0.0379 \n0.0394 0.0428 \n\n\n\n\n• The performance gap between NextIP(w/o TBCG&BSA) and NextIP(w/o BSA) indicates that transferring the unique knowledge of different types of behaviors to help predict the next interaction in a behavior-aware manner can improve the performance.• Comparing NextIP(w/o BSA) with NextIP(w/o BSA & ,ℓ in TBCG), i.e., the variant of NextIP(w/o BSA) that removes ,ℓ in TBCG and only uses * ,ℓ in Eq.(9), the performance decreases showing the usefulness of the target behavior embedding in balancing the context information from different behaviors in our TBCG. Similarly, we can see the necessity of using * ,ℓ to refine the final context representation by comparing NextIP(w/o BSA) with NextIP(w/o BSA & * ,ℓ in TBCG). • NextIP(w/o BSA & ,ℓ in TBCG) perform worse than Nex-tIP(w/o BSA & * ,ℓ in TBCG), the reason might be that when NextIP(w/o BSA & ,ℓ in TBCG) 0.557 0.634 NextIP(w/o BSA & * : Recommendation performance (Rec@10) of our Nex-tIP with different architectures on UB and Tmall for ablation studies.Architecture \nUB \nTmall \nNextIP(w/o TBCG&BSA) \n0.556 0.616 \nNextIP(w/o TBCG) \n0.577 0.635 \nNextIP(w/o BSA) \n0.624 0.678 \n,ℓ in TBCG) 0.570 0.648 \nNextIP \n0.632 0.681 \nTable 5\nhttps://tianchi.aliyun.com/dataset/dataDetail?dataId=42 2 https://tianchi.aliyun.com/dataset/dataDetail?dataId=649\nhttps://cseweb.ucsd.edu/~jmcauley/ 4 https://github.com/hidasib/GRU4Rec 5 https://github.com/graytowne/caser_pytorch 6 http://csse.szu.edu.cn/staff/panwk/publications/FISSA/ 7 https://github.com/ciecus/MKM-SR 8 https://github.com/Autumn945/MGNN-SPred 9 https://github.com/akaxlh/MB-GMN 10 https://csse.szu.edu.cn/staff/panwk/publications/VAEplusplus/\nACKNOWLEDGMENTSWe thank the support of National Natural Science Foundation of China Nos. 62172283 and 61836005. We thank Miss Jing Lin for her data preprocessing scripts and Mr. Dugang Liu for his helpful discussions.\nSequential Recommendation with Graph Neural Networks. Jianxin Chang, Chen Gao, Yu Zheng, Yiqun Hui, Yanan Niu, Yang Song, Depeng Jin, Yong Li, Proceedings of the 44th International ACM SIGIR Conf. on Research and Development in Information Retrieval. the 44th International ACM SIGIR Conf. on Research and Development in Information RetrievalJianxin Chang, Chen Gao, Yu Zheng, Yiqun Hui, Yanan Niu, Yang Song, Depeng Jin, and Yong Li. 2021. Sequential Recommendation with Graph Neural Net- works. In Proceedings of the 44th International ACM SIGIR Conf. on Research and Development in Information Retrieval. 378-387.\n\nGraph Heterogeneous Multi-Relational Recommendation. Chong Chen, Weizhi Ma, Min Zhang, Zhaowei Wang, Xiuqiang He, Chenyang Wang, Yiqun Liu, Shaoping Ma, Proceedings of the 35th AAAI Conf. on Artificial Intelligence. the 35th AAAI Conf. on Artificial IntelligenceChong Chen, Weizhi Ma, Min Zhang, Zhaowei Wang, Xiuqiang He, Chenyang Wang, Yiqun Liu, and Shaoping Ma. 2021. Graph Heterogeneous Multi-Relational Recommendation. In Proceedings of the 35th AAAI Conf. on Artificial Intelligence. 3958-3966.\n\nEfficient Heterogeneous Collaborative Filtering without Negative Sampling for Recommendation. Chong Chen, Min Zhang, Yongfeng Zhang, Weizhi Ma, Yiqun Liu, Shaoping Ma, Proceedings of the 34th AAAI Conf. on Artificial Intelligence. the 34th AAAI Conf. on Artificial IntelligenceChong Chen, Min Zhang, Yongfeng Zhang, Weizhi Ma, Yiqun Liu, and Shaoping Ma. 2020. Efficient Heterogeneous Collaborative Filtering without Negative Sampling for Recommendation. In Proceedings of the 34th AAAI Conf. on Artificial Intelligence. 19-26.\n\nA Survey on Heterogeneous One-class Collaborative Filtering. Xiancong Chen, Lin Li, Weike Pan, Zhong Ming, ACM Transactions on Information Systems. 3854Xiancong Chen, Lin Li, Weike Pan, and Zhong Ming. 2020. A Survey on Het- erogeneous One-class Collaborative Filtering. ACM Transactions on Information Systems 38, 4 (2020), 35:1-35:54.\n\nSequential User-based Recurrent Neural Network Recommendations. Tim Donkers, Benedikt Loepp, Jürgen Ziegler, Proceedings of the 11t ACM Conf. on Recommender Systems. the 11t ACM Conf. on Recommender SystemsTim Donkers, Benedikt Loepp, and Jürgen Ziegler. 2017. Sequential User-based Recurrent Neural Network Recommendations. In Proceedings of the 11t ACM Conf. on Recommender Systems. 152-160.\n\nNeural Multi-Task Recommendation from Multi-Behavior Data. Chen Gao, Xiangnan He, Dahua Gan, Xiangning Chen, Fuli Feng, Yong Li, Proceedings of the 35th IEEE International Conference on Data Engineering. the 35th IEEE International Conference on Data EngineeringTat-Seng Chua, and Depeng JinChen Gao, Xiangnan He, Dahua Gan, Xiangning Chen, Fuli Feng, Yong Li, Tat- Seng Chua, and Depeng Jin. 2019. Neural Multi-Task Recommendation from Multi-Behavior Data. In Proceedings of the 35th IEEE International Conference on Data Engineering. 1554-1557.\n\nDeep Multifaceted Transformers for Multi-Objective Ranking in Large-Scale E-Commerce Recommender Systems. Yulong Gu, Zhuoye Ding, Shuaiqiang Wang, Lixin Zou, Yiding Liu, Dawei Yin, Proceedings of the 29th ACM International Conf. on Information and Knowledge Management. the 29th ACM International Conf. on Information and Knowledge ManagementYulong Gu, Zhuoye Ding, Shuaiqiang Wang, Lixin Zou, Yiding Liu, and Dawei Yin. 2020. Deep Multifaceted Transformers for Multi-Objective Ranking in Large-Scale E-Commerce Recommender Systems. In Proceedings of the 29th ACM International Conf. on Information and Knowledge Management. 2493-2500.\n\nMomentum Contrast for Unsupervised Visual Representation Learning. Kaiming He, Haoqi Fan, Yuxin Wu, Saining Xie, Ross B Girshick, 2020Kaiming He, Haoqi Fan, Yuxin Wu, Saining Xie, and Ross B. Girshick. 2020. Momentum Contrast for Unsupervised Visual Representation Learning. In 2020\n\nIeee/Cvf, Conf, on Computer Vision and Pattern Recognition. IEEE/CVF Conf. on Computer Vision and Pattern Recognition. 9726-9735.\n\nTranslation-based Recommendation. Ruining He, Wang-Cheng Kang, Julian Mcauley, Proceedings of the 11t ACM Conf. on Recommender Systems. the 11t ACM Conf. on Recommender SystemsRuining He, Wang-Cheng Kang, and Julian McAuley. 2017. Translation-based Recommendation. In Proceedings of the 11t ACM Conf. on Recommender Systems. 161-169.\n\nFusing Similarity Models with Markov Chains for Sparse Sequential Recommendation. Ruining He, Julian Mcauley, Proceedings of the 16th IEEE International Conf. on Data Mining. the 16th IEEE International Conf. on Data MiningRuining He and Julian McAuley. 2016. Fusing Similarity Models with Markov Chains for Sparse Sequential Recommendation. In Proceedings of the 16th IEEE International Conf. on Data Mining. 191-200.\n\nNeural Collaborative Filtering. Xiangnan He, Lizi Liao, Hanwang Zhang, Liqiang Nie, Xia Hu, Tat-Seng Chua, Proceedings of the 26th International Conf. on World Wide Web. the 26th International Conf. on World Wide WebXiangnan He, Lizi Liao, Hanwang Zhang, Liqiang Nie, Xia Hu, and Tat-Seng Chua. 2017. Neural Collaborative Filtering. In Proceedings of the 26th International Conf. on World Wide Web. 173-182.\n\nRecurrent Neural Networks with Top-k Gains for Session-based Recommendations. Balázs Hidasi, Alexandros Karatzoglou, Proceedings of the 27th ACM International Conf. on Information and Knowledge Management. the 27th ACM International Conf. on Information and Knowledge ManagementBalázs Hidasi and Alexandros Karatzoglou. 2018. Recurrent Neural Networks with Top-k Gains for Session-based Recommendations. In Proceedings of the 27th ACM International Conf. on Information and Knowledge Management. 843-852.\n\nSession-based Recommendations with Recurrent Neural Networks. Balázs Hidasi, Alexandros Karatzoglou, Proceedings of the 4th International Conf. on Learning Representations. the 4th International Conf. on Learning RepresentationsLinas Baltrunas, and Domonkos TikkBalázs Hidasi, Alexandros Karatzoglou, Linas Baltrunas, and Domonkos Tikk. 2016. Session-based Recommendations with Recurrent Neural Networks. In Proceedings of the 4th International Conf. on Learning Representations.\n\nMulti-Behavior Recommendation with Graph Convolutional Networks. Chen Bowen Jin, Xiangnan Gao, Depeng He, Yong Jin, Li, Proceedings of the 43rd International ACM SIGIR Conf. on Research and Development in Information Retrieval. the 43rd International ACM SIGIR Conf. on Research and Development in Information RetrievalBowen Jin, Chen Gao, Xiangnan He, Depeng Jin, and Yong Li. 2020. Multi- Behavior Recommendation with Graph Convolutional Networks. In Proceedings of the 43rd International ACM SIGIR Conf. on Research and Development in Infor- mation Retrieval. 659-668.\n\nFISM: Factored Item Similarity Models for Top-N Recommender Systems. Santosh Kabbur, Xia Ning, George Karypis, Proceedings of the 19th ACM SIGKDD International Conf. on Knowledge Discovery and Data Mining. the 19th ACM SIGKDD International Conf. on Knowledge Discovery and Data MiningSantosh Kabbur, Xia Ning, and George Karypis. 2013. FISM: Factored Item Similarity Models for Top-N Recommender Systems. In Proceedings of the 19th ACM SIGKDD International Conf. on Knowledge Discovery and Data Mining. 659- 667.\n\nSelf-Attentive Sequential Recommendation. Wang-Cheng Kang, Julian J Mcauley, Proceedings of the 18th IEEE International Conf. on Data Mining. the 18th IEEE International Conf. on Data MiningWang-Cheng Kang and Julian J. McAuley. 2018. Self-Attentive Sequential Rec- ommendation. In Proceedings of the 18th IEEE International Conf. on Data Mining. 197-206.\n\nTranslation-Based Sequential Recommendation for Complex Users on Sparse Data. Hui Li, Ye Liu, Nikos Mamoulis, David S Rosenblum, IEEE Transactions on Knowledge and Data Engineering. 32Hui Li, Ye Liu, Nikos Mamoulis, and David S. Rosenblum. 2020. Translation- Based Sequential Recommendation for Complex Users on Sparse Data. IEEE Transactions on Knowledge and Data Engineering 32, 8 (2020), 1639-1651.\n\nLearning from History and Present: Next-item Recommendation via Discriminatively Exploiting User Behaviors. Zhi Li, Hongke Zhao, Qi Liu, Zhenya Huang, Tao Mei, Enhong Chen, Proceedings of the 24th ACM SIGKDD International Conf. on Knowledge Discovery and Data Mining. the 24th ACM SIGKDD International Conf. on Knowledge Discovery and Data MiningZhi Li, Hongke Zhao, Qi Liu, Zhenya Huang, Tao Mei, and Enhong Chen. 2018. Learning from History and Present: Next-item Recommendation via Discrim- inatively Exploiting User Behaviors. In Proceedings of the 24th ACM SIGKDD International Conf. on Knowledge Discovery and Data Mining. 1734-1743.\n\nFISSA: Fusing Item Similarity Models with Self-Attention Networks for Sequential Recommendation. Jing Lin, Weike Pan, Zhong Ming, Proceedings of the 14th ACM Conf. on Recommender Systems. the 14th ACM Conf. on Recommender SystemsJing Lin, Weike Pan, and Zhong Ming. 2020. FISSA: Fusing Item Similarity Models with Self-Attention Networks for Sequential Recommendation. In Proceedings of the 14th ACM Conf. on Recommender Systems. 130-139.\n\nBayesian Personalized Ranking with Multi-Channel User Feedback. Babak Loni, Roberto Pagano, Martha Larson, Alan Hanjalic, Proceedings of the 10th ACM Conference on Recommender Systems. the 10th ACM Conference on Recommender SystemsBabak Loni, Roberto Pagano, Martha Larson, and Alan Hanjalic. 2016. Bayesian Personalized Ranking with Multi-Channel User Feedback. In Proceedings of the 10th ACM Conference on Recommender Systems. 361-364.\n\nVAE++: Variational AutoEncoder for Heterogeneous One-Class Collaborative Filtering. Wanqi Ma, Xiancong Chen, Weike Pan, Zhong Ming, Proceedings of the 15th International Conference on Web Search and Data Mining. the 15th International Conference on Web Search and Data MiningWanqi Ma, Xiancong Chen, Weike Pan, and Zhong Ming. 2022. VAE++: Vari- ational AutoEncoder for Heterogeneous One-Class Collaborative Filtering. In Proceedings of the 15th International Conference on Web Search and Data Mining. 666-674.\n\nIncorporating User Micro-behaviors and Item Knowledge into Multi-task Learning for Session-based Recommendation. Wenjing Meng, Deqing Yang, Yanghua Xiao, Proceedings of the 43rd International ACM SIGIR Conf. on Research and Development in Information Retrieval. the 43rd International ACM SIGIR Conf. on Research and Development in Information RetrievalWenjing Meng, Deqing Yang, and Yanghua Xiao. 2020. Incorporating User Micro-behaviors and Item Knowledge into Multi-task Learning for Session-based Recommendation. In Proceedings of the 43rd International ACM SIGIR Conf. on Research and Development in Information Retrieval. 1091-1100.\n\nAdaptive Bayesian Personalized Ranking for Heterogeneous Implicit Feedbacks. Knowledge-Based Systems. Weike Pan, Hao Zhong, Congfu Xu, Zhong Ming, 73Weike Pan, Hao Zhong, Congfu Xu, and Zhong Ming. 2015. Adaptive Bayesian Personalized Ranking for Heterogeneous Implicit Feedbacks. Knowledge-Based Systems 73 (2015), 173-180.\n\nRethinking the Item Order in Session-based Recommendation with Graph Neural Networks. Ruihong Qiu, Jingjing Li, Zi Huang, Hongzhi Yin, Proceedings of the 28th ACM International Conf. on Information and Knowledge Management. the 28th ACM International Conf. on Information and Knowledge ManagementACMRuihong Qiu, Jingjing Li, Zi Huang, and Hongzhi YIn. 2019. Rethinking the Item Order in Session-based Recommendation with Graph Neural Networks. In Proceedings of the 28th ACM International Conf. on Information and Knowledge Management. ACM, 579-588.\n\nBPR: Bayesian Personalized Ranking From Implicit Feedback. Steffen Rendle, Christoph Freudenthaler, Zeno Gantner, Lars Schmidt-Thieme, Proceedings of the 25th Conf. on Uncertainty in Artificial Intelligence. the 25th Conf. on Uncertainty in Artificial IntelligenceSteffen Rendle, Christoph Freudenthaler, Zeno Gantner, and Lars Schmidt-Thieme. 2009. BPR: Bayesian Personalized Ranking From Implicit Feedback. In Proceedings of the 25th Conf. on Uncertainty in Artificial Intelligence. 452-461.\n\nFactorizing Personalized Markov Chains for Next-basket Recommendation. Steffen Rendle, Christoph Freudenthaler, Lars Schmidt-Thieme, Proceedings of the 19th International Conf. on World Wide Web. the 19th International Conf. on World Wide WebSteffen Rendle, Christoph Freudenthaler, and Lars Schmidt-Thieme. 2010. Factoriz- ing Personalized Markov Chains for Next-basket Recommendation. In Proceedings of the 19th International Conf. on World Wide Web. 811-820.\n\nBERT4Rec: Sequential Recommendation with Bidirectional Encoder Representations from Transformer. Fei Sun, Jun Liu, Jian Wu, Changhua Pei, Xiao Lin, Wenwu Ou, Peng Jiang, Proceedings of the 28th ACM International Conf. on Information and Knowledge Management. the 28th ACM International Conf. on Information and Knowledge ManagementFei Sun, Jun Liu, Jian Wu, Changhua Pei, Xiao Lin, Wenwu Ou, and Peng Jiang. 2019. BERT4Rec: Sequential Recommendation with Bidirectional Encoder Repre- sentations from Transformer. In Proceedings of the 28th ACM International Conf. on Information and Knowledge Management. 1441-1450.\n\nPersonalized top-N Sequential Recommendation via Convolutional Sequence Embedding. Jiaxi Tang, Ke Wang, Proceedings of the 11th ACM International Conf. on Web Search and Data Mining. the 11th ACM International Conf. on Web Search and Data MiningJiaxi Tang and Ke Wang. 2018. Personalized top-N Sequential Recommenda- tion via Convolutional Sequence Embedding. In Proceedings of the 11th ACM International Conf. on Web Search and Data Mining. 565-573.\n\nAttentive Sequential Models of Latent Intent for Next Item Recommendation. Mehrab Md, Congzhe Tanjim, Ethan Su, Diane Benjamin, Liangjie Hu, Julian J Hong, Mcauley, Proceedings of the 29th International Conf. on World Wide Web Companion. the 29th International Conf. on World Wide Web CompanionMd. Mehrab Tanjim, Congzhe Su, Ethan Benjamin, Diane Hu, Liangjie Hong, and Julian J. McAuley. 2020. Attentive Sequential Models of Latent Intent for Next Item Recommendation. In Proceedings of the 29th International Conf. on World Wide Web Companion. 2528-2534.\n\nAttention is All You Need. Ashish Vaswani, Noam Shazeer, Niki Parmar, Jakob Uszkoreit, Llion Jones, Aidan N Gomez, Lukasz Kaiser, Illia Polosukhin, Annual Conf. on Neural Information Processing Systems. Ashish Vaswani, Noam Shazeer, Niki Parmar, Jakob Uszkoreit, Llion Jones, Aidan N. Gomez, Lukasz Kaiser, and Illia Polosukhin. 2017. Attention is All You Need. In Annual Conf. on Neural Information Processing Systems. 5998-6008.\n\n. Shoujin Wang, Longbing Cao, Yan Wang, Z Quan, Mehmet A Sheng, Defu Orgun, Lian, 2022. A Survey on Session-based Recommender Systems. ACM Computing Surveys (CSUR). 5438Shoujin Wang, Longbing Cao, Yan Wang, Quan Z. Sheng, Mehmet A. Orgun, and Defu Lian. 2022. A Survey on Session-based Recommender Systems. ACM Computing Surveys (CSUR) 54, 7 (2022), 154:1-154:38.\n\nBeyond Clicks: Modeling Multi-Relational Item Graph for Session-Based Target Behavior Prediction. Wen Wang, Wei Zhang, Shukai Liu, Qi Liu, Bo Zhang, Leyu Lin, Hongyuan Zha, Proceedings of the 29th International Conf. on World Wide Web Companion. the 29th International Conf. on World Wide Web CompanionWen Wang, Wei Zhang, Shukai Liu, Qi Liu, Bo Zhang, Leyu Lin, and Hongyuan Zha. 2020. Beyond Clicks: Modeling Multi-Relational Item Graph for Session- Based Target Behavior Prediction. In Proceedings of the 29th International Conf. on World Wide Web Companion. 3056-3062.\n\nGlobal Context Enhanced Graph Neural Networks for Session-based Recommendation. Ziyang Wang, Wei Wei, Gao Cong, Xiao-Li Li, Xian-Ling Mao, Minghui Qiu, Proceedings of the 43rd International ACM SIGIR Conf. on research and development in Information Retrieval. the 43rd International ACM SIGIR Conf. on research and development in Information RetrievalZiyang Wang, Wei Wei, Gao Cong, Xiao-Li Li, Xian-Ling Mao, and Minghui Qiu. 2020. Global Context Enhanced Graph Neural Networks for Session-based Recommendation. In Proceedings of the 43rd International ACM SIGIR Conf. on research and development in Information Retrieval. 169-178.\n\nContrastive Meta Learning with Behavior Multiplicity for Recommendation. Wei Wei, Chao Huang, Lianghao Xia, Yong Xu, Jiashu Zhao, Dawei Yin, Proceedings of the 15th ACM WSDM International Conference on Web Search and Data Mining. the 15th ACM WSDM International Conference on Web Search and Data MiningWei Wei, Chao Huang, Lianghao Xia, Yong Xu, Jiashu Zhao, and Dawei Yin. 2022. Contrastive Meta Learning with Behavior Multiplicity for Recommendation. In Proceedings of the 15th ACM WSDM International Conference on Web Search and Data Mining. 1120-1128.\n\nSession-based Recommendation with Graph Neural Networks. Shu Wu, Yuyuan Tang, Yanqiao Zhu, Liang Wang, Xing Xie, Tieniu Tan, Proceedings of the 33th AAAI Conf. on Artificial Intelligence. the 33th AAAI Conf. on Artificial IntelligenceShu Wu, Yuyuan Tang, Yanqiao Zhu, Liang Wang, Xing Xie, and Tieniu Tan. 2019. Session-based Recommendation with Graph Neural Networks. In Proceedings of the 33th AAAI Conf. on Artificial Intelligence. 346-353.\n\nYiqing Wu, Ruobing Xie, Yongchun Zhu, Xiang Ao, Xin Chen, Xu Zhang, Fuzhen Zhuang, Leyu Lin, and Qing He. 2022. Multi-view Multi-behavior Contrastive Learning in Recommendation. In Database Systems for Advanced Applications -27th International Conference. 13246Yiqing Wu, Ruobing Xie, Yongchun Zhu, Xiang Ao, Xin Chen, Xu Zhang, Fuzhen Zhuang, Leyu Lin, and Qing He. 2022. Multi-view Multi-behavior Contrastive Learning in Recommendation. In Database Systems for Advanced Applications - 27th International Conference, Vol. 13246. 166-182.\n\nKnowledge-Enhanced Hierarchical Graph Transformer Network for Multi-Behavior Recommendation. Lianghao Xia, Chao Huang, Yong Xu, Peng Dai, Xiyue Zhang, Hongsheng Yang, Jian Pei, Liefeng Bo, Proceedings of the 35th AAAI Conf. on Artificial Intelligence. the 35th AAAI Conf. on Artificial IntelligenceLianghao Xia, Chao Huang, Yong Xu, Peng Dai, Xiyue Zhang, Hongsheng Yang, Jian Pei, and Liefeng Bo. 2021. Knowledge-Enhanced Hierarchical Graph Trans- former Network for Multi-Behavior Recommendation. In Proceedings of the 35th AAAI Conf. on Artificial Intelligence. 4486-4493.\n\nGraph meta network for multi-behavior recommendation. Lianghao Xia, Yong Xu, Chao Huang, Peng Dai, Liefeng Bo, Proceedings of the 44th International ACM SIGIR Conf. on Research and Development in Information Retrieval. the 44th International ACM SIGIR Conf. on Research and Development in Information RetrievalLianghao Xia, Yong Xu, Chao Huang, Peng Dai, and Liefeng Bo. 2021. Graph meta network for multi-behavior recommendation. In Proceedings of the 44th Interna- tional ACM SIGIR Conf. on Research and Development in Information Retrieval. 757-766.\n\nDeep Feedback Network for Recommendation. Ruobing Xie, Cheng Ling, Yalong Wang, Rui Wang, Feng Xia, Leyu Lin, Proceedings of the 29th International Joint Conf. on Artificial Intelligence. the 29th International Joint Conf. on Artificial IntelligenceRuobing Xie, Cheng Ling, Yalong Wang, Rui Wang, Feng Xia, and Leyu Lin. 2020. Deep Feedback Network for Recommendation. In Proceedings of the 29th International Joint Conf. on Artificial Intelligence. 2519-2525.\n\nGraph Contextualized Selfattention Network for Session-based Recommendation. Chengfeng Xu, Pengpeng Zhao, Yanchi Liu, Victor S Sheng, Jiajie Xu, Proceedings of the 28th International Joint Conf. on Artificial Intelligence. the 28th International Joint Conf. on Artificial IntelligenceFuzhen Zhuang, Junhua Fang, and Xiaofang ZhouChengfeng Xu, Pengpeng Zhao, Yanchi Liu, Victor S. Sheng, Jiajie Xu, Fuzhen Zhuang, Junhua Fang, and Xiaofang Zhou. 2019. Graph Contextualized Self- attention Network for Session-based Recommendation. In Proceedings of the 28th International Joint Conf. on Artificial Intelligence. 3940-3946.\n\nHyper Meta-Path Contrastive Learning for Multi-Behavior Recommendation. Haoran Yang, Hongxu Chen, Lin Li, Philip S Yu, Guandong Xu, Proceedings of the 37th IEEE International Conference on Data Engineering. the 37th IEEE International Conference on Data EngineeringIEEEHaoran Yang, Hongxu Chen, Lin Li, Philip S. Yu, and Guandong Xu. 2021. Hy- per Meta-Path Contrastive Learning for Multi-Behavior Recommendation. In Proceedings of the 37th IEEE International Conference on Data Engineering. IEEE, 787-796.\n\nGraph Neural Network based Model for Multi-Behavior Session-based Recommendation. Bo Yu, Ruoqian Zhang, Wei Chen, Junhua Fang, GeoInformatica. 26Bo Yu, Ruoqian Zhang, Wei Chen, and Junhua Fang. 2022. Graph Neural Network based Model for Multi-Behavior Session-based Recommendation. GeoInformatica 26, 2, 429-447.\n\nA Simple Convolutional Generative Network for Next Item Recommendation. Fajie Yuan, Alexandros Karatzoglou, Ioannis Arapakis, Joemon M Jose, Xiangnan He, Proceedings of the 12th ACM International Conf. on Web Search and Data Mining. the 12th ACM International Conf. on Web Search and Data MiningFajie Yuan, Alexandros Karatzoglou, Ioannis Arapakis, Joemon M. Jose, and Xiangnan He. 2019. A Simple Convolutional Generative Network for Next Item Recommendation. In Proceedings of the 12th ACM International Conf. on Web Search and Data Mining. 582-590.\n\nMicro Behaviors: A New Perspective in E-commerce Recommender Systems. Meizi Zhou, Zhuoye Ding, Jiliang Tang, Dawei Yin, Proceedings of the 11th ACM International Conf. on Web Search and Data Mining. the 11th ACM International Conf. on Web Search and Data MiningMeizi Zhou, Zhuoye Ding, Jiliang Tang, and Dawei Yin. 2018. Micro Behaviors: A New Perspective in E-commerce Recommender Systems. In Proceedings of the 11th ACM International Conf. on Web Search and Data Mining. 727-735.\n", "annotations": {"author": "[{\"end\":149,\"start\":107},{\"end\":161,\"start\":150},{\"end\":174,\"start\":162},{\"end\":205,\"start\":175},{\"end\":234,\"start\":206},{\"end\":271,\"start\":235},{\"end\":308,\"start\":272},{\"end\":345,\"start\":309},{\"end\":382,\"start\":346}]", "publisher": null, "author_last_name": "[{\"end\":117,\"start\":114},{\"end\":160,\"start\":158},{\"end\":173,\"start\":170},{\"end\":184,\"start\":181},{\"end\":216,\"start\":212}]", "author_first_name": "[{\"end\":113,\"start\":107},{\"end\":157,\"start\":150},{\"end\":169,\"start\":162},{\"end\":180,\"start\":175},{\"end\":211,\"start\":206}]", "author_affiliation": "[{\"end\":270,\"start\":236},{\"end\":307,\"start\":273},{\"end\":344,\"start\":310},{\"end\":381,\"start\":347}]", "title": "[{\"end\":64,\"start\":1},{\"end\":446,\"start\":383}]", "venue": "[{\"end\":551,\"start\":448}]", "abstract": "[{\"end\":2504,\"start\":1083}]", "bib_ref": "[{\"attributes\":{\"ref_id\":\"b11\"},\"end\":2749,\"start\":2745},{\"attributes\":{\"ref_id\":\"b22\"},\"end\":3255,\"start\":3251},{\"attributes\":{\"ref_id\":\"b18\"},\"end\":4217,\"start\":4213},{\"attributes\":{\"ref_id\":\"b29\"},\"end\":4220,\"start\":4217},{\"attributes\":{\"ref_id\":\"b32\"},\"end\":4362,\"start\":4358},{\"attributes\":{\"ref_id\":\"b26\"},\"end\":7418,\"start\":7414},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":7516,\"start\":7512},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":7602,\"start\":7598},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":7697,\"start\":7694},{\"attributes\":{\"ref_id\":\"b17\"},\"end\":7700,\"start\":7697},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":8024,\"start\":8021},{\"attributes\":{\"ref_id\":\"b13\"},\"end\":8027,\"start\":8024},{\"attributes\":{\"ref_id\":\"b28\"},\"end\":8096,\"start\":8092},{\"attributes\":{\"ref_id\":\"b43\"},\"end\":8115,\"start\":8111},{\"attributes\":{\"ref_id\":\"b30\"},\"end\":8276,\"start\":8272},{\"attributes\":{\"ref_id\":\"b16\"},\"end\":8289,\"start\":8285},{\"attributes\":{\"ref_id\":\"b27\"},\"end\":8411,\"start\":8407},{\"attributes\":{\"ref_id\":\"b19\"},\"end\":8510,\"start\":8506},{\"attributes\":{\"ref_id\":\"b24\"},\"end\":8806,\"start\":8802},{\"attributes\":{\"ref_id\":\"b33\"},\"end\":8809,\"start\":8806},{\"attributes\":{\"ref_id\":\"b35\"},\"end\":8812,\"start\":8809},{\"attributes\":{\"ref_id\":\"b40\"},\"end\":8815,\"start\":8812},{\"attributes\":{\"ref_id\":\"b31\"},\"end\":9019,\"start\":9015},{\"attributes\":{\"ref_id\":\"b23\"},\"end\":9166,\"start\":9162},{\"attributes\":{\"ref_id\":\"b20\"},\"end\":9254,\"start\":9250},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":9414,\"start\":9411},{\"attributes\":{\"ref_id\":\"b2\"},\"end\":9416,\"start\":9414},{\"attributes\":{\"ref_id\":\"b37\"},\"end\":9419,\"start\":9416},{\"attributes\":{\"ref_id\":\"b5\"},\"end\":9429,\"start\":9426},{\"attributes\":{\"ref_id\":\"b11\"},\"end\":9446,\"start\":9442},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":9632,\"start\":9628},{\"attributes\":{\"ref_id\":\"b38\"},\"end\":9838,\"start\":9834},{\"attributes\":{\"ref_id\":\"b21\"},\"end\":9986,\"start\":9982},{\"attributes\":{\"ref_id\":\"b34\"},\"end\":10389,\"start\":10385},{\"attributes\":{\"ref_id\":\"b36\"},\"end\":10392,\"start\":10389},{\"attributes\":{\"ref_id\":\"b41\"},\"end\":10395,\"start\":10392},{\"attributes\":{\"ref_id\":\"b3\"},\"end\":11105,\"start\":11102},{\"attributes\":{\"ref_id\":\"b18\"},\"end\":11389,\"start\":11385},{\"attributes\":{\"ref_id\":\"b22\"},\"end\":11392,\"start\":11389},{\"attributes\":{\"ref_id\":\"b44\"},\"end\":11532,\"start\":11528},{\"attributes\":{\"ref_id\":\"b29\"},\"end\":11625,\"start\":11621},{\"attributes\":{\"ref_id\":\"b22\"},\"end\":11797,\"start\":11793},{\"attributes\":{\"ref_id\":\"b39\"},\"end\":12323,\"start\":12319},{\"attributes\":{\"ref_id\":\"b42\"},\"end\":12326,\"start\":12323},{\"attributes\":{\"ref_id\":\"b32\"},\"end\":12356,\"start\":12352},{\"attributes\":{\"ref_id\":\"b6\"},\"end\":12542,\"start\":12539},{\"attributes\":{\"ref_id\":\"b22\"},\"end\":13265,\"start\":13261},{\"attributes\":{\"ref_id\":\"b16\"},\"end\":18195,\"start\":18191},{\"attributes\":{\"ref_id\":\"b16\"},\"end\":19473,\"start\":19469},{\"attributes\":{\"ref_id\":\"b16\"},\"end\":23421,\"start\":23417},{\"attributes\":{\"ref_id\":\"b32\"},\"end\":29467,\"start\":29463},{\"attributes\":{\"ref_id\":\"b16\"},\"end\":29859,\"start\":29855},{\"attributes\":{\"ref_id\":\"b19\"},\"end\":29862,\"start\":29859},{\"attributes\":{\"ref_id\":\"b25\"},\"end\":30354,\"start\":30350},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":30455,\"start\":30451},{\"attributes\":{\"ref_id\":\"b38\"},\"end\":30641,\"start\":30637},{\"attributes\":{\"ref_id\":\"b21\"},\"end\":30776,\"start\":30772},{\"attributes\":{\"ref_id\":\"b26\"},\"end\":31032,\"start\":31028},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":31139,\"start\":31135},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":31192,\"start\":31188},{\"attributes\":{\"ref_id\":\"b12\"},\"end\":31266,\"start\":31262},{\"attributes\":{\"ref_id\":\"b13\"},\"end\":31314,\"start\":31310},{\"attributes\":{\"ref_id\":\"b28\"},\"end\":31389,\"start\":31385},{\"attributes\":{\"ref_id\":\"b16\"},\"end\":31527,\"start\":31523},{\"attributes\":{\"ref_id\":\"b19\"},\"end\":31604,\"start\":31600},{\"attributes\":{\"ref_id\":\"b44\"},\"end\":31922,\"start\":31918},{\"attributes\":{\"ref_id\":\"b18\"},\"end\":32059,\"start\":32055},{\"attributes\":{\"ref_id\":\"b32\"},\"end\":32204,\"start\":32200},{\"attributes\":{\"ref_id\":\"b22\"},\"end\":32348,\"start\":32344},{\"attributes\":{\"ref_id\":\"b29\"},\"end\":32616,\"start\":32612},{\"end\":33070,\"start\":33054},{\"attributes\":{\"ref_id\":\"b16\"},\"end\":33282,\"start\":33278},{\"attributes\":{\"ref_id\":\"b19\"},\"end\":33285,\"start\":33282},{\"attributes\":{\"ref_id\":\"b7\"},\"end\":33537,\"start\":33534},{\"attributes\":{\"ref_id\":\"b16\"},\"end\":33641,\"start\":33637},{\"attributes\":{\"ref_id\":\"b19\"},\"end\":33644,\"start\":33641},{\"attributes\":{\"ref_id\":\"b16\"},\"end\":35265,\"start\":35261},{\"attributes\":{\"ref_id\":\"b19\"},\"end\":35268,\"start\":35265},{\"attributes\":{\"ref_id\":\"b0\"},\"end\":36168,\"start\":36165}]", "figure": "[{\"attributes\":{\"id\":\"fig_0\"},\"end\":41523,\"start\":41408},{\"attributes\":{\"id\":\"fig_1\"},\"end\":41571,\"start\":41524},{\"attributes\":{\"id\":\"fig_2\"},\"end\":41683,\"start\":41572},{\"attributes\":{\"id\":\"fig_3\"},\"end\":41744,\"start\":41684},{\"attributes\":{\"id\":\"fig_4\"},\"end\":41899,\"start\":41745},{\"attributes\":{\"id\":\"fig_5\"},\"end\":42091,\"start\":41900},{\"attributes\":{\"id\":\"tab_1\",\"type\":\"table\"},\"end\":42152,\"start\":42092},{\"attributes\":{\"id\":\"tab_3\",\"type\":\"table\"},\"end\":42801,\"start\":42153},{\"attributes\":{\"id\":\"tab_4\",\"type\":\"table\"},\"end\":43984,\"start\":42802}]", "paragraph": "[{\"end\":3040,\"start\":2520},{\"end\":4045,\"start\":3042},{\"end\":4771,\"start\":4047},{\"end\":5422,\"start\":4773},{\"end\":6142,\"start\":5424},{\"end\":6191,\"start\":6144},{\"end\":7024,\"start\":6193},{\"end\":7230,\"start\":7041},{\"end\":9020,\"start\":7276},{\"end\":10464,\"start\":9054},{\"end\":10993,\"start\":10466},{\"end\":12176,\"start\":11038},{\"end\":13525,\"start\":12178},{\"end\":13662,\"start\":13543},{\"end\":14139,\"start\":13685},{\"end\":14303,\"start\":14141},{\"end\":14852,\"start\":14318},{\"end\":15022,\"start\":14917},{\"end\":15567,\"start\":15398},{\"end\":15627,\"start\":15578},{\"end\":15950,\"start\":15650},{\"end\":16869,\"start\":15963},{\"end\":17038,\"start\":16894},{\"end\":17812,\"start\":17058},{\"end\":18179,\"start\":17814},{\"end\":18318,\"start\":18181},{\"end\":18576,\"start\":18320},{\"end\":18630,\"start\":18594},{\"end\":18811,\"start\":18663},{\"end\":19303,\"start\":18844},{\"end\":20092,\"start\":19330},{\"end\":20732,\"start\":20166},{\"end\":21810,\"start\":20766},{\"end\":21903,\"start\":21897},{\"end\":22199,\"start\":21925},{\"end\":22403,\"start\":22201},{\"end\":22905,\"start\":22428},{\"end\":23272,\"start\":22907},{\"end\":23422,\"start\":23303},{\"end\":23848,\"start\":23493},{\"end\":24828,\"start\":23880},{\"end\":25390,\"start\":24838},{\"end\":25854,\"start\":25401},{\"end\":26212,\"start\":25884},{\"end\":26495,\"start\":26214},{\"end\":26699,\"start\":26590},{\"end\":27018,\"start\":26701},{\"end\":27146,\"start\":27052},{\"end\":27375,\"start\":27167},{\"end\":27661,\"start\":27395},{\"end\":27855,\"start\":27677},{\"end\":28229,\"start\":27857},{\"end\":29536,\"start\":28265},{\"end\":30133,\"start\":29538},{\"end\":30536,\"start\":30176},{\"end\":30934,\"start\":30538},{\"end\":31824,\"start\":30936},{\"end\":32934,\"start\":31826},{\"end\":33645,\"start\":32936},{\"end\":34088,\"start\":33679},{\"end\":34306,\"start\":34090},{\"end\":34872,\"start\":34308},{\"end\":34962,\"start\":34874},{\"end\":35357,\"start\":34964},{\"end\":35462,\"start\":35359},{\"end\":35976,\"start\":35464},{\"end\":37183,\"start\":35978},{\"end\":37406,\"start\":37209},{\"end\":38276,\"start\":37408},{\"end\":38692,\"start\":38330},{\"end\":39082,\"start\":38694},{\"end\":39828,\"start\":39104},{\"end\":40035,\"start\":39830},{\"end\":40578,\"start\":40037},{\"end\":41291,\"start\":40610},{\"end\":41407,\"start\":41293}]", "formula": "[{\"attributes\":{\"id\":\"formula_0\"},\"end\":14916,\"start\":14853},{\"attributes\":{\"id\":\"formula_1\"},\"end\":15397,\"start\":15023},{\"attributes\":{\"id\":\"formula_2\"},\"end\":15577,\"start\":15568},{\"attributes\":{\"id\":\"formula_3\"},\"end\":15649,\"start\":15628},{\"attributes\":{\"id\":\"formula_4\"},\"end\":18593,\"start\":18577},{\"attributes\":{\"id\":\"formula_5\"},\"end\":18662,\"start\":18631},{\"attributes\":{\"id\":\"formula_6\"},\"end\":20109,\"start\":20093},{\"attributes\":{\"id\":\"formula_7\"},\"end\":20135,\"start\":20109},{\"attributes\":{\"id\":\"formula_8\"},\"end\":20165,\"start\":20135},{\"attributes\":{\"id\":\"formula_9\"},\"end\":21828,\"start\":21811},{\"attributes\":{\"id\":\"formula_10\"},\"end\":21862,\"start\":21828},{\"attributes\":{\"id\":\"formula_11\"},\"end\":21896,\"start\":21862},{\"attributes\":{\"id\":\"formula_12\"},\"end\":21924,\"start\":21904},{\"attributes\":{\"id\":\"formula_13\"},\"end\":22427,\"start\":22404},{\"attributes\":{\"id\":\"formula_14\"},\"end\":23302,\"start\":23273},{\"attributes\":{\"id\":\"formula_15\"},\"end\":23492,\"start\":23423},{\"attributes\":{\"id\":\"formula_16\"},\"end\":25400,\"start\":25391},{\"attributes\":{\"id\":\"formula_17\"},\"end\":25883,\"start\":25855},{\"attributes\":{\"id\":\"formula_18\"},\"end\":26513,\"start\":26496},{\"attributes\":{\"id\":\"formula_19\"},\"end\":26534,\"start\":26513},{\"attributes\":{\"id\":\"formula_20\"},\"end\":26589,\"start\":26534},{\"attributes\":{\"id\":\"formula_21\"},\"end\":27166,\"start\":27147},{\"attributes\":{\"id\":\"formula_22\"},\"end\":27394,\"start\":27376}]", "table_ref": "[{\"end\":14794,\"start\":14787},{\"end\":17037,\"start\":17030},{\"attributes\":{\"ref_id\":\"tab_1\"},\"end\":29535,\"start\":29528},{\"attributes\":{\"ref_id\":\"tab_3\"},\"end\":33760,\"start\":33753},{\"end\":34002,\"start\":33995},{\"end\":35704,\"start\":35697},{\"end\":36575,\"start\":36568},{\"attributes\":{\"ref_id\":\"tab_3\"},\"end\":36618,\"start\":36611},{\"end\":37369,\"start\":37362}]", "section_header": "[{\"attributes\":{\"n\":\"1\"},\"end\":2518,\"start\":2506},{\"attributes\":{\"n\":\"2\"},\"end\":7039,\"start\":7027},{\"attributes\":{\"n\":\"2.1\"},\"end\":7274,\"start\":7233},{\"attributes\":{\"n\":\"2.2\"},\"end\":9052,\"start\":9023},{\"attributes\":{\"n\":\"2.3\"},\"end\":11036,\"start\":10996},{\"attributes\":{\"n\":\"3\"},\"end\":13541,\"start\":13528},{\"attributes\":{\"n\":\"3.1\"},\"end\":13683,\"start\":13665},{\"attributes\":{\"n\":\"3.2\"},\"end\":14316,\"start\":14306},{\"attributes\":{\"n\":\"3.3\"},\"end\":15961,\"start\":15953},{\"attributes\":{\"n\":\"4\"},\"end\":16892,\"start\":16872},{\"attributes\":{\"n\":\"4.1\"},\"end\":17056,\"start\":17041},{\"attributes\":{\"n\":\"4.2\"},\"end\":18842,\"start\":18814},{\"attributes\":{\"n\":\"4.2.1\"},\"end\":19328,\"start\":19306},{\"attributes\":{\"n\":\"4.2.2\"},\"end\":20764,\"start\":20735},{\"attributes\":{\"n\":\"4.3\"},\"end\":23878,\"start\":23851},{\"end\":24836,\"start\":24831},{\"attributes\":{\"n\":\"4.4\"},\"end\":27050,\"start\":27021},{\"attributes\":{\"n\":\"5\"},\"end\":27675,\"start\":27664},{\"attributes\":{\"n\":\"5.1\"},\"end\":28263,\"start\":28232},{\"attributes\":{\"n\":\"5.2\"},\"end\":30174,\"start\":30136},{\"attributes\":{\"n\":\"5.3\"},\"end\":33655,\"start\":33648},{\"attributes\":{\"n\":\"5.3.1\"},\"end\":33677,\"start\":33658},{\"attributes\":{\"n\":\"5.3.2\"},\"end\":37207,\"start\":37186},{\"attributes\":{\"n\":\"5.3.3\"},\"end\":38328,\"start\":38279},{\"attributes\":{\"n\":\"5.3.4\"},\"end\":39102,\"start\":39085},{\"attributes\":{\"n\":\"6\"},\"end\":40608,\"start\":40581},{\"end\":41419,\"start\":41409},{\"end\":41695,\"start\":41685},{\"end\":41756,\"start\":41746},{\"end\":41911,\"start\":41901},{\"end\":42102,\"start\":42093},{\"end\":42163,\"start\":42154}]", "table": "[{\"end\":42801,\"start\":42350},{\"end\":43984,\"start\":43810}]", "figure_caption": "[{\"end\":41523,\"start\":41421},{\"end\":41571,\"start\":41526},{\"end\":41683,\"start\":41574},{\"end\":41744,\"start\":41697},{\"end\":41899,\"start\":41758},{\"end\":42091,\"start\":41913},{\"end\":42152,\"start\":42104},{\"end\":42350,\"start\":42165},{\"end\":43810,\"start\":42804}]", "figure_ref": "[{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":13661,\"start\":13653},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":16307,\"start\":16299},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":16595,\"start\":16587},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":20704,\"start\":20696},{\"attributes\":{\"ref_id\":\"fig_3\"},\"end\":25740,\"start\":25732},{\"attributes\":{\"ref_id\":\"fig_4\"},\"end\":38513,\"start\":38505},{\"attributes\":{\"ref_id\":\"fig_5\"},\"end\":39670,\"start\":39662}]", "bib_author_first_name": "[{\"end\":44730,\"start\":44723},{\"end\":44742,\"start\":44738},{\"end\":44750,\"start\":44748},{\"end\":44763,\"start\":44758},{\"end\":44774,\"start\":44769},{\"end\":44784,\"start\":44780},{\"end\":44797,\"start\":44791},{\"end\":44807,\"start\":44803},{\"end\":45345,\"start\":45340},{\"end\":45358,\"start\":45352},{\"end\":45366,\"start\":45363},{\"end\":45381,\"start\":45374},{\"end\":45396,\"start\":45388},{\"end\":45409,\"start\":45401},{\"end\":45421,\"start\":45416},{\"end\":45435,\"start\":45427},{\"end\":45889,\"start\":45884},{\"end\":45899,\"start\":45896},{\"end\":45915,\"start\":45907},{\"end\":45929,\"start\":45923},{\"end\":45939,\"start\":45934},{\"end\":45953,\"start\":45945},{\"end\":46388,\"start\":46380},{\"end\":46398,\"start\":46395},{\"end\":46408,\"start\":46403},{\"end\":46419,\"start\":46414},{\"end\":46724,\"start\":46721},{\"end\":46742,\"start\":46734},{\"end\":46756,\"start\":46750},{\"end\":47115,\"start\":47111},{\"end\":47129,\"start\":47121},{\"end\":47139,\"start\":47134},{\"end\":47154,\"start\":47145},{\"end\":47165,\"start\":47161},{\"end\":47176,\"start\":47172},{\"end\":47712,\"start\":47706},{\"end\":47723,\"start\":47717},{\"end\":47740,\"start\":47730},{\"end\":47752,\"start\":47747},{\"end\":47764,\"start\":47758},{\"end\":47775,\"start\":47770},{\"end\":48311,\"start\":48304},{\"end\":48321,\"start\":48316},{\"end\":48332,\"start\":48327},{\"end\":48344,\"start\":48337},{\"end\":48354,\"start\":48350},{\"end\":48356,\"start\":48355},{\"end\":48693,\"start\":48686},{\"end\":48708,\"start\":48698},{\"end\":48721,\"start\":48715},{\"end\":49076,\"start\":49069},{\"end\":49087,\"start\":49081},{\"end\":49447,\"start\":49439},{\"end\":49456,\"start\":49452},{\"end\":49470,\"start\":49463},{\"end\":49485,\"start\":49478},{\"end\":49494,\"start\":49491},{\"end\":49507,\"start\":49499},{\"end\":49900,\"start\":49894},{\"end\":49919,\"start\":49909},{\"end\":50390,\"start\":50384},{\"end\":50409,\"start\":50399},{\"end\":50872,\"start\":50868},{\"end\":50892,\"start\":50884},{\"end\":50904,\"start\":50898},{\"end\":50913,\"start\":50909},{\"end\":51452,\"start\":51445},{\"end\":51464,\"start\":51461},{\"end\":51477,\"start\":51471},{\"end\":51942,\"start\":51932},{\"end\":51955,\"start\":51949},{\"end\":51957,\"start\":51956},{\"end\":52328,\"start\":52325},{\"end\":52335,\"start\":52333},{\"end\":52346,\"start\":52341},{\"end\":52362,\"start\":52357},{\"end\":52364,\"start\":52363},{\"end\":52761,\"start\":52758},{\"end\":52772,\"start\":52766},{\"end\":52781,\"start\":52779},{\"end\":52793,\"start\":52787},{\"end\":52804,\"start\":52801},{\"end\":52816,\"start\":52810},{\"end\":53392,\"start\":53388},{\"end\":53403,\"start\":53398},{\"end\":53414,\"start\":53409},{\"end\":53800,\"start\":53795},{\"end\":53814,\"start\":53807},{\"end\":53829,\"start\":53823},{\"end\":53842,\"start\":53838},{\"end\":54259,\"start\":54254},{\"end\":54272,\"start\":54264},{\"end\":54284,\"start\":54279},{\"end\":54295,\"start\":54290},{\"end\":54802,\"start\":54795},{\"end\":54815,\"start\":54809},{\"end\":54829,\"start\":54822},{\"end\":55429,\"start\":55424},{\"end\":55438,\"start\":55435},{\"end\":55452,\"start\":55446},{\"end\":55462,\"start\":55457},{\"end\":55741,\"start\":55734},{\"end\":55755,\"start\":55747},{\"end\":55762,\"start\":55760},{\"end\":55777,\"start\":55770},{\"end\":56265,\"start\":56258},{\"end\":56283,\"start\":56274},{\"end\":56303,\"start\":56299},{\"end\":56317,\"start\":56313},{\"end\":56772,\"start\":56765},{\"end\":56790,\"start\":56781},{\"end\":56810,\"start\":56806},{\"end\":57257,\"start\":57254},{\"end\":57266,\"start\":57263},{\"end\":57276,\"start\":57272},{\"end\":57289,\"start\":57281},{\"end\":57299,\"start\":57295},{\"end\":57310,\"start\":57305},{\"end\":57319,\"start\":57315},{\"end\":57862,\"start\":57857},{\"end\":57871,\"start\":57869},{\"end\":58307,\"start\":58301},{\"end\":58319,\"start\":58312},{\"end\":58333,\"start\":58328},{\"end\":58343,\"start\":58338},{\"end\":58362,\"start\":58354},{\"end\":58373,\"start\":58367},{\"end\":58375,\"start\":58374},{\"end\":58817,\"start\":58811},{\"end\":58831,\"start\":58827},{\"end\":58845,\"start\":58841},{\"end\":58859,\"start\":58854},{\"end\":58876,\"start\":58871},{\"end\":58889,\"start\":58884},{\"end\":58891,\"start\":58890},{\"end\":58905,\"start\":58899},{\"end\":58919,\"start\":58914},{\"end\":59225,\"start\":59218},{\"end\":59240,\"start\":59232},{\"end\":59249,\"start\":59246},{\"end\":59257,\"start\":59256},{\"end\":59270,\"start\":59264},{\"end\":59272,\"start\":59271},{\"end\":59284,\"start\":59280},{\"end\":59682,\"start\":59679},{\"end\":59692,\"start\":59689},{\"end\":59706,\"start\":59700},{\"end\":59714,\"start\":59712},{\"end\":59722,\"start\":59720},{\"end\":59734,\"start\":59730},{\"end\":59748,\"start\":59740},{\"end\":60241,\"start\":60235},{\"end\":60251,\"start\":60248},{\"end\":60260,\"start\":60257},{\"end\":60274,\"start\":60267},{\"end\":60288,\"start\":60279},{\"end\":60301,\"start\":60294},{\"end\":60865,\"start\":60862},{\"end\":60875,\"start\":60871},{\"end\":60891,\"start\":60883},{\"end\":60901,\"start\":60897},{\"end\":60912,\"start\":60906},{\"end\":60924,\"start\":60919},{\"end\":61406,\"start\":61403},{\"end\":61417,\"start\":61411},{\"end\":61431,\"start\":61424},{\"end\":61442,\"start\":61437},{\"end\":61453,\"start\":61449},{\"end\":61465,\"start\":61459},{\"end\":61797,\"start\":61791},{\"end\":61809,\"start\":61802},{\"end\":61823,\"start\":61815},{\"end\":61834,\"start\":61829},{\"end\":61842,\"start\":61839},{\"end\":61851,\"start\":61849},{\"end\":62432,\"start\":62424},{\"end\":62442,\"start\":62438},{\"end\":62454,\"start\":62450},{\"end\":62463,\"start\":62459},{\"end\":62474,\"start\":62469},{\"end\":62491,\"start\":62482},{\"end\":62502,\"start\":62498},{\"end\":62515,\"start\":62508},{\"end\":62970,\"start\":62962},{\"end\":62980,\"start\":62976},{\"end\":62989,\"start\":62985},{\"end\":63001,\"start\":62997},{\"end\":63014,\"start\":63007},{\"end\":63511,\"start\":63504},{\"end\":63522,\"start\":63517},{\"end\":63535,\"start\":63529},{\"end\":63545,\"start\":63542},{\"end\":63556,\"start\":63552},{\"end\":63566,\"start\":63562},{\"end\":64010,\"start\":64001},{\"end\":64023,\"start\":64015},{\"end\":64036,\"start\":64030},{\"end\":64048,\"start\":64042},{\"end\":64050,\"start\":64049},{\"end\":64064,\"start\":64058},{\"end\":64625,\"start\":64619},{\"end\":64638,\"start\":64632},{\"end\":64648,\"start\":64645},{\"end\":64659,\"start\":64653},{\"end\":64661,\"start\":64660},{\"end\":64674,\"start\":64666},{\"end\":65139,\"start\":65137},{\"end\":65151,\"start\":65144},{\"end\":65162,\"start\":65159},{\"end\":65175,\"start\":65169},{\"end\":65446,\"start\":65441},{\"end\":65463,\"start\":65453},{\"end\":65484,\"start\":65477},{\"end\":65501,\"start\":65495},{\"end\":65503,\"start\":65502},{\"end\":65518,\"start\":65510},{\"end\":65996,\"start\":65991},{\"end\":66009,\"start\":66003},{\"end\":66023,\"start\":66016},{\"end\":66035,\"start\":66030}]", "bib_author_last_name": "[{\"end\":44736,\"start\":44731},{\"end\":44746,\"start\":44743},{\"end\":44756,\"start\":44751},{\"end\":44767,\"start\":44764},{\"end\":44778,\"start\":44775},{\"end\":44789,\"start\":44785},{\"end\":44801,\"start\":44798},{\"end\":44810,\"start\":44808},{\"end\":45350,\"start\":45346},{\"end\":45361,\"start\":45359},{\"end\":45372,\"start\":45367},{\"end\":45386,\"start\":45382},{\"end\":45399,\"start\":45397},{\"end\":45414,\"start\":45410},{\"end\":45425,\"start\":45422},{\"end\":45438,\"start\":45436},{\"end\":45894,\"start\":45890},{\"end\":45905,\"start\":45900},{\"end\":45921,\"start\":45916},{\"end\":45932,\"start\":45930},{\"end\":45943,\"start\":45940},{\"end\":45956,\"start\":45954},{\"end\":46393,\"start\":46389},{\"end\":46401,\"start\":46399},{\"end\":46412,\"start\":46409},{\"end\":46424,\"start\":46420},{\"end\":46732,\"start\":46725},{\"end\":46748,\"start\":46743},{\"end\":46764,\"start\":46757},{\"end\":47119,\"start\":47116},{\"end\":47132,\"start\":47130},{\"end\":47143,\"start\":47140},{\"end\":47159,\"start\":47155},{\"end\":47170,\"start\":47166},{\"end\":47179,\"start\":47177},{\"end\":47715,\"start\":47713},{\"end\":47728,\"start\":47724},{\"end\":47745,\"start\":47741},{\"end\":47756,\"start\":47753},{\"end\":47768,\"start\":47765},{\"end\":47779,\"start\":47776},{\"end\":48314,\"start\":48312},{\"end\":48325,\"start\":48322},{\"end\":48335,\"start\":48333},{\"end\":48348,\"start\":48345},{\"end\":48365,\"start\":48357},{\"end\":48529,\"start\":48521},{\"end\":48535,\"start\":48531},{\"end\":48696,\"start\":48694},{\"end\":48713,\"start\":48709},{\"end\":48729,\"start\":48722},{\"end\":49079,\"start\":49077},{\"end\":49095,\"start\":49088},{\"end\":49450,\"start\":49448},{\"end\":49461,\"start\":49457},{\"end\":49476,\"start\":49471},{\"end\":49489,\"start\":49486},{\"end\":49497,\"start\":49495},{\"end\":49512,\"start\":49508},{\"end\":49907,\"start\":49901},{\"end\":49931,\"start\":49920},{\"end\":50397,\"start\":50391},{\"end\":50421,\"start\":50410},{\"end\":50882,\"start\":50873},{\"end\":50896,\"start\":50893},{\"end\":50907,\"start\":50905},{\"end\":50917,\"start\":50914},{\"end\":50921,\"start\":50919},{\"end\":51459,\"start\":51453},{\"end\":51469,\"start\":51465},{\"end\":51485,\"start\":51478},{\"end\":51947,\"start\":51943},{\"end\":51965,\"start\":51958},{\"end\":52331,\"start\":52329},{\"end\":52339,\"start\":52336},{\"end\":52355,\"start\":52347},{\"end\":52374,\"start\":52365},{\"end\":52764,\"start\":52762},{\"end\":52777,\"start\":52773},{\"end\":52785,\"start\":52782},{\"end\":52799,\"start\":52794},{\"end\":52808,\"start\":52805},{\"end\":52821,\"start\":52817},{\"end\":53396,\"start\":53393},{\"end\":53407,\"start\":53404},{\"end\":53419,\"start\":53415},{\"end\":53805,\"start\":53801},{\"end\":53821,\"start\":53815},{\"end\":53836,\"start\":53830},{\"end\":53851,\"start\":53843},{\"end\":54262,\"start\":54260},{\"end\":54277,\"start\":54273},{\"end\":54288,\"start\":54285},{\"end\":54300,\"start\":54296},{\"end\":54807,\"start\":54803},{\"end\":54820,\"start\":54816},{\"end\":54834,\"start\":54830},{\"end\":55433,\"start\":55430},{\"end\":55444,\"start\":55439},{\"end\":55455,\"start\":55453},{\"end\":55467,\"start\":55463},{\"end\":55745,\"start\":55742},{\"end\":55758,\"start\":55756},{\"end\":55768,\"start\":55763},{\"end\":55781,\"start\":55778},{\"end\":56272,\"start\":56266},{\"end\":56297,\"start\":56284},{\"end\":56311,\"start\":56304},{\"end\":56332,\"start\":56318},{\"end\":56779,\"start\":56773},{\"end\":56804,\"start\":56791},{\"end\":56825,\"start\":56811},{\"end\":57261,\"start\":57258},{\"end\":57270,\"start\":57267},{\"end\":57279,\"start\":57277},{\"end\":57293,\"start\":57290},{\"end\":57303,\"start\":57300},{\"end\":57313,\"start\":57311},{\"end\":57325,\"start\":57320},{\"end\":57867,\"start\":57863},{\"end\":57876,\"start\":57872},{\"end\":58310,\"start\":58308},{\"end\":58326,\"start\":58320},{\"end\":58336,\"start\":58334},{\"end\":58352,\"start\":58344},{\"end\":58365,\"start\":58363},{\"end\":58380,\"start\":58376},{\"end\":58389,\"start\":58382},{\"end\":58825,\"start\":58818},{\"end\":58839,\"start\":58832},{\"end\":58852,\"start\":58846},{\"end\":58869,\"start\":58860},{\"end\":58882,\"start\":58877},{\"end\":58897,\"start\":58892},{\"end\":58912,\"start\":58906},{\"end\":58930,\"start\":58920},{\"end\":59230,\"start\":59226},{\"end\":59244,\"start\":59241},{\"end\":59254,\"start\":59250},{\"end\":59262,\"start\":59258},{\"end\":59278,\"start\":59273},{\"end\":59290,\"start\":59285},{\"end\":59296,\"start\":59292},{\"end\":59687,\"start\":59683},{\"end\":59698,\"start\":59693},{\"end\":59710,\"start\":59707},{\"end\":59718,\"start\":59715},{\"end\":59728,\"start\":59723},{\"end\":59738,\"start\":59735},{\"end\":59752,\"start\":59749},{\"end\":60246,\"start\":60242},{\"end\":60255,\"start\":60252},{\"end\":60265,\"start\":60261},{\"end\":60277,\"start\":60275},{\"end\":60292,\"start\":60289},{\"end\":60305,\"start\":60302},{\"end\":60869,\"start\":60866},{\"end\":60881,\"start\":60876},{\"end\":60895,\"start\":60892},{\"end\":60904,\"start\":60902},{\"end\":60917,\"start\":60913},{\"end\":60928,\"start\":60925},{\"end\":61409,\"start\":61407},{\"end\":61422,\"start\":61418},{\"end\":61435,\"start\":61432},{\"end\":61447,\"start\":61443},{\"end\":61457,\"start\":61454},{\"end\":61469,\"start\":61466},{\"end\":61800,\"start\":61798},{\"end\":61813,\"start\":61810},{\"end\":61827,\"start\":61824},{\"end\":61837,\"start\":61835},{\"end\":61847,\"start\":61843},{\"end\":61857,\"start\":61852},{\"end\":62436,\"start\":62433},{\"end\":62448,\"start\":62443},{\"end\":62457,\"start\":62455},{\"end\":62467,\"start\":62464},{\"end\":62480,\"start\":62475},{\"end\":62496,\"start\":62492},{\"end\":62506,\"start\":62503},{\"end\":62518,\"start\":62516},{\"end\":62974,\"start\":62971},{\"end\":62983,\"start\":62981},{\"end\":62995,\"start\":62990},{\"end\":63005,\"start\":63002},{\"end\":63017,\"start\":63015},{\"end\":63515,\"start\":63512},{\"end\":63527,\"start\":63523},{\"end\":63540,\"start\":63536},{\"end\":63550,\"start\":63546},{\"end\":63560,\"start\":63557},{\"end\":63570,\"start\":63567},{\"end\":64013,\"start\":64011},{\"end\":64028,\"start\":64024},{\"end\":64040,\"start\":64037},{\"end\":64056,\"start\":64051},{\"end\":64067,\"start\":64065},{\"end\":64630,\"start\":64626},{\"end\":64643,\"start\":64639},{\"end\":64651,\"start\":64649},{\"end\":64664,\"start\":64662},{\"end\":64677,\"start\":64675},{\"end\":65142,\"start\":65140},{\"end\":65157,\"start\":65152},{\"end\":65167,\"start\":65163},{\"end\":65180,\"start\":65176},{\"end\":65451,\"start\":65447},{\"end\":65475,\"start\":65464},{\"end\":65493,\"start\":65485},{\"end\":65508,\"start\":65504},{\"end\":65521,\"start\":65519},{\"end\":66001,\"start\":65997},{\"end\":66014,\"start\":66010},{\"end\":66028,\"start\":66024},{\"end\":66039,\"start\":66036}]", "bib_entry": "[{\"attributes\":{\"id\":\"b0\",\"matched_paper_id\":235658226},\"end\":45285,\"start\":44669},{\"attributes\":{\"id\":\"b1\",\"matched_paper_id\":235306102},\"end\":45788,\"start\":45287},{\"attributes\":{\"id\":\"b2\",\"matched_paper_id\":208284469},\"end\":46317,\"start\":45790},{\"attributes\":{\"id\":\"b3\",\"matched_paper_id\":222296312},\"end\":46655,\"start\":46319},{\"attributes\":{\"id\":\"b4\",\"matched_paper_id\":38116062},\"end\":47050,\"start\":46657},{\"attributes\":{\"id\":\"b5\",\"matched_paper_id\":160030052},\"end\":47598,\"start\":47052},{\"attributes\":{\"id\":\"b6\",\"matched_paper_id\":224282883},\"end\":48235,\"start\":47600},{\"attributes\":{\"id\":\"b7\"},\"end\":48519,\"start\":48237},{\"attributes\":{\"id\":\"b8\"},\"end\":48650,\"start\":48521},{\"attributes\":{\"id\":\"b9\",\"matched_paper_id\":10246046},\"end\":48985,\"start\":48652},{\"attributes\":{\"id\":\"b10\",\"matched_paper_id\":9124261},\"end\":49405,\"start\":48987},{\"attributes\":{\"id\":\"b11\",\"matched_paper_id\":13907106},\"end\":49814,\"start\":49407},{\"attributes\":{\"id\":\"b12\",\"matched_paper_id\":1159769},\"end\":50320,\"start\":49816},{\"attributes\":{\"id\":\"b13\",\"matched_paper_id\":11810482},\"end\":50801,\"start\":50322},{\"attributes\":{\"id\":\"b14\",\"matched_paper_id\":220730113},\"end\":51374,\"start\":50803},{\"attributes\":{\"id\":\"b15\",\"matched_paper_id\":207204749},\"end\":51888,\"start\":51376},{\"attributes\":{\"id\":\"b16\",\"matched_paper_id\":52127932},\"end\":52245,\"start\":51890},{\"attributes\":{\"id\":\"b17\",\"matched_paper_id\":85439782},\"end\":52648,\"start\":52247},{\"attributes\":{\"id\":\"b18\",\"matched_paper_id\":50768534},\"end\":53289,\"start\":52650},{\"attributes\":{\"id\":\"b19\",\"matched_paper_id\":221784706},\"end\":53729,\"start\":53291},{\"attributes\":{\"id\":\"b20\",\"matched_paper_id\":757461},\"end\":54168,\"start\":53731},{\"attributes\":{\"id\":\"b21\",\"matched_paper_id\":246828684},\"end\":54680,\"start\":54170},{\"attributes\":{\"id\":\"b22\",\"matched_paper_id\":219636253},\"end\":55320,\"start\":54682},{\"attributes\":{\"id\":\"b23\"},\"end\":55646,\"start\":55322},{\"attributes\":{\"id\":\"b24\",\"matched_paper_id\":207758412},\"end\":56197,\"start\":55648},{\"attributes\":{\"id\":\"b25\",\"matched_paper_id\":10795036},\"end\":56692,\"start\":56199},{\"attributes\":{\"id\":\"b26\",\"matched_paper_id\":207178809},\"end\":57155,\"start\":56694},{\"attributes\":{\"id\":\"b27\",\"matched_paper_id\":119181611},\"end\":57772,\"start\":57157},{\"attributes\":{\"id\":\"b28\",\"matched_paper_id\":39847715},\"end\":58224,\"start\":57774},{\"attributes\":{\"id\":\"b29\",\"matched_paper_id\":215812033},\"end\":58782,\"start\":58226},{\"attributes\":{\"id\":\"b30\",\"matched_paper_id\":13756489},\"end\":59214,\"start\":58784},{\"attributes\":{\"id\":\"b31\"},\"end\":59579,\"start\":59216},{\"attributes\":{\"id\":\"b32\",\"matched_paper_id\":211171550},\"end\":60153,\"start\":59581},{\"attributes\":{\"id\":\"b33\",\"matched_paper_id\":220730170},\"end\":60787,\"start\":60155},{\"attributes\":{\"id\":\"b34\",\"matched_paper_id\":246828747},\"end\":61344,\"start\":60789},{\"attributes\":{\"id\":\"b35\",\"matched_paper_id\":53219431},\"end\":61789,\"start\":61346},{\"attributes\":{\"id\":\"b36\"},\"end\":62329,\"start\":61791},{\"attributes\":{\"id\":\"b37\",\"matched_paper_id\":235306149},\"end\":62906,\"start\":62331},{\"attributes\":{\"id\":\"b38\",\"matched_paper_id\":235792434},\"end\":63460,\"start\":62908},{\"attributes\":{\"id\":\"b39\",\"matched_paper_id\":220484640},\"end\":63922,\"start\":63462},{\"attributes\":{\"id\":\"b40\"},\"end\":64545,\"start\":63924},{\"attributes\":{\"id\":\"b41\",\"matched_paper_id\":237431172},\"end\":65053,\"start\":64547},{\"attributes\":{\"id\":\"b42\",\"matched_paper_id\":235244634},\"end\":65367,\"start\":65055},{\"attributes\":{\"id\":\"b43\",\"matched_paper_id\":53977298},\"end\":65919,\"start\":65369},{\"attributes\":{\"id\":\"b44\",\"matched_paper_id\":32370905},\"end\":66402,\"start\":65921}]", "bib_title": "[{\"end\":44721,\"start\":44669},{\"end\":45338,\"start\":45287},{\"end\":45882,\"start\":45790},{\"end\":46378,\"start\":46319},{\"end\":46719,\"start\":46657},{\"end\":47109,\"start\":47052},{\"end\":47704,\"start\":47600},{\"end\":48684,\"start\":48652},{\"end\":49067,\"start\":48987},{\"end\":49437,\"start\":49407},{\"end\":49892,\"start\":49816},{\"end\":50382,\"start\":50322},{\"end\":50866,\"start\":50803},{\"end\":51443,\"start\":51376},{\"end\":51930,\"start\":51890},{\"end\":52323,\"start\":52247},{\"end\":52756,\"start\":52650},{\"end\":53386,\"start\":53291},{\"end\":53793,\"start\":53731},{\"end\":54252,\"start\":54170},{\"end\":54793,\"start\":54682},{\"end\":55732,\"start\":55648},{\"end\":56256,\"start\":56199},{\"end\":56763,\"start\":56694},{\"end\":57252,\"start\":57157},{\"end\":57855,\"start\":57774},{\"end\":58299,\"start\":58226},{\"end\":58809,\"start\":58784},{\"end\":59677,\"start\":59581},{\"end\":60233,\"start\":60155},{\"end\":60860,\"start\":60789},{\"end\":61401,\"start\":61346},{\"end\":62422,\"start\":62331},{\"end\":62960,\"start\":62908},{\"end\":63502,\"start\":63462},{\"end\":63999,\"start\":63924},{\"end\":64617,\"start\":64547},{\"end\":65135,\"start\":65055},{\"end\":65439,\"start\":65369},{\"end\":65989,\"start\":65921}]", "bib_author": "[{\"end\":44738,\"start\":44723},{\"end\":44748,\"start\":44738},{\"end\":44758,\"start\":44748},{\"end\":44769,\"start\":44758},{\"end\":44780,\"start\":44769},{\"end\":44791,\"start\":44780},{\"end\":44803,\"start\":44791},{\"end\":44812,\"start\":44803},{\"end\":45352,\"start\":45340},{\"end\":45363,\"start\":45352},{\"end\":45374,\"start\":45363},{\"end\":45388,\"start\":45374},{\"end\":45401,\"start\":45388},{\"end\":45416,\"start\":45401},{\"end\":45427,\"start\":45416},{\"end\":45440,\"start\":45427},{\"end\":45896,\"start\":45884},{\"end\":45907,\"start\":45896},{\"end\":45923,\"start\":45907},{\"end\":45934,\"start\":45923},{\"end\":45945,\"start\":45934},{\"end\":45958,\"start\":45945},{\"end\":46395,\"start\":46380},{\"end\":46403,\"start\":46395},{\"end\":46414,\"start\":46403},{\"end\":46426,\"start\":46414},{\"end\":46734,\"start\":46721},{\"end\":46750,\"start\":46734},{\"end\":46766,\"start\":46750},{\"end\":47121,\"start\":47111},{\"end\":47134,\"start\":47121},{\"end\":47145,\"start\":47134},{\"end\":47161,\"start\":47145},{\"end\":47172,\"start\":47161},{\"end\":47181,\"start\":47172},{\"end\":47717,\"start\":47706},{\"end\":47730,\"start\":47717},{\"end\":47747,\"start\":47730},{\"end\":47758,\"start\":47747},{\"end\":47770,\"start\":47758},{\"end\":47781,\"start\":47770},{\"end\":48316,\"start\":48304},{\"end\":48327,\"start\":48316},{\"end\":48337,\"start\":48327},{\"end\":48350,\"start\":48337},{\"end\":48367,\"start\":48350},{\"end\":48531,\"start\":48521},{\"end\":48537,\"start\":48531},{\"end\":48698,\"start\":48686},{\"end\":48715,\"start\":48698},{\"end\":48731,\"start\":48715},{\"end\":49081,\"start\":49069},{\"end\":49097,\"start\":49081},{\"end\":49452,\"start\":49439},{\"end\":49463,\"start\":49452},{\"end\":49478,\"start\":49463},{\"end\":49491,\"start\":49478},{\"end\":49499,\"start\":49491},{\"end\":49514,\"start\":49499},{\"end\":49909,\"start\":49894},{\"end\":49933,\"start\":49909},{\"end\":50399,\"start\":50384},{\"end\":50423,\"start\":50399},{\"end\":50884,\"start\":50868},{\"end\":50898,\"start\":50884},{\"end\":50909,\"start\":50898},{\"end\":50919,\"start\":50909},{\"end\":50923,\"start\":50919},{\"end\":51461,\"start\":51445},{\"end\":51471,\"start\":51461},{\"end\":51487,\"start\":51471},{\"end\":51949,\"start\":51932},{\"end\":51967,\"start\":51949},{\"end\":52333,\"start\":52325},{\"end\":52341,\"start\":52333},{\"end\":52357,\"start\":52341},{\"end\":52376,\"start\":52357},{\"end\":52766,\"start\":52758},{\"end\":52779,\"start\":52766},{\"end\":52787,\"start\":52779},{\"end\":52801,\"start\":52787},{\"end\":52810,\"start\":52801},{\"end\":52823,\"start\":52810},{\"end\":53398,\"start\":53388},{\"end\":53409,\"start\":53398},{\"end\":53421,\"start\":53409},{\"end\":53807,\"start\":53795},{\"end\":53823,\"start\":53807},{\"end\":53838,\"start\":53823},{\"end\":53853,\"start\":53838},{\"end\":54264,\"start\":54254},{\"end\":54279,\"start\":54264},{\"end\":54290,\"start\":54279},{\"end\":54302,\"start\":54290},{\"end\":54809,\"start\":54795},{\"end\":54822,\"start\":54809},{\"end\":54836,\"start\":54822},{\"end\":55435,\"start\":55424},{\"end\":55446,\"start\":55435},{\"end\":55457,\"start\":55446},{\"end\":55469,\"start\":55457},{\"end\":55747,\"start\":55734},{\"end\":55760,\"start\":55747},{\"end\":55770,\"start\":55760},{\"end\":55783,\"start\":55770},{\"end\":56274,\"start\":56258},{\"end\":56299,\"start\":56274},{\"end\":56313,\"start\":56299},{\"end\":56334,\"start\":56313},{\"end\":56781,\"start\":56765},{\"end\":56806,\"start\":56781},{\"end\":56827,\"start\":56806},{\"end\":57263,\"start\":57254},{\"end\":57272,\"start\":57263},{\"end\":57281,\"start\":57272},{\"end\":57295,\"start\":57281},{\"end\":57305,\"start\":57295},{\"end\":57315,\"start\":57305},{\"end\":57327,\"start\":57315},{\"end\":57869,\"start\":57857},{\"end\":57878,\"start\":57869},{\"end\":58312,\"start\":58301},{\"end\":58328,\"start\":58312},{\"end\":58338,\"start\":58328},{\"end\":58354,\"start\":58338},{\"end\":58367,\"start\":58354},{\"end\":58382,\"start\":58367},{\"end\":58391,\"start\":58382},{\"end\":58827,\"start\":58811},{\"end\":58841,\"start\":58827},{\"end\":58854,\"start\":58841},{\"end\":58871,\"start\":58854},{\"end\":58884,\"start\":58871},{\"end\":58899,\"start\":58884},{\"end\":58914,\"start\":58899},{\"end\":58932,\"start\":58914},{\"end\":59232,\"start\":59218},{\"end\":59246,\"start\":59232},{\"end\":59256,\"start\":59246},{\"end\":59264,\"start\":59256},{\"end\":59280,\"start\":59264},{\"end\":59292,\"start\":59280},{\"end\":59298,\"start\":59292},{\"end\":59689,\"start\":59679},{\"end\":59700,\"start\":59689},{\"end\":59712,\"start\":59700},{\"end\":59720,\"start\":59712},{\"end\":59730,\"start\":59720},{\"end\":59740,\"start\":59730},{\"end\":59754,\"start\":59740},{\"end\":60248,\"start\":60235},{\"end\":60257,\"start\":60248},{\"end\":60267,\"start\":60257},{\"end\":60279,\"start\":60267},{\"end\":60294,\"start\":60279},{\"end\":60307,\"start\":60294},{\"end\":60871,\"start\":60862},{\"end\":60883,\"start\":60871},{\"end\":60897,\"start\":60883},{\"end\":60906,\"start\":60897},{\"end\":60919,\"start\":60906},{\"end\":60930,\"start\":60919},{\"end\":61411,\"start\":61403},{\"end\":61424,\"start\":61411},{\"end\":61437,\"start\":61424},{\"end\":61449,\"start\":61437},{\"end\":61459,\"start\":61449},{\"end\":61471,\"start\":61459},{\"end\":61802,\"start\":61791},{\"end\":61815,\"start\":61802},{\"end\":61829,\"start\":61815},{\"end\":61839,\"start\":61829},{\"end\":61849,\"start\":61839},{\"end\":61859,\"start\":61849},{\"end\":62438,\"start\":62424},{\"end\":62450,\"start\":62438},{\"end\":62459,\"start\":62450},{\"end\":62469,\"start\":62459},{\"end\":62482,\"start\":62469},{\"end\":62498,\"start\":62482},{\"end\":62508,\"start\":62498},{\"end\":62520,\"start\":62508},{\"end\":62976,\"start\":62962},{\"end\":62985,\"start\":62976},{\"end\":62997,\"start\":62985},{\"end\":63007,\"start\":62997},{\"end\":63019,\"start\":63007},{\"end\":63517,\"start\":63504},{\"end\":63529,\"start\":63517},{\"end\":63542,\"start\":63529},{\"end\":63552,\"start\":63542},{\"end\":63562,\"start\":63552},{\"end\":63572,\"start\":63562},{\"end\":64015,\"start\":64001},{\"end\":64030,\"start\":64015},{\"end\":64042,\"start\":64030},{\"end\":64058,\"start\":64042},{\"end\":64069,\"start\":64058},{\"end\":64632,\"start\":64619},{\"end\":64645,\"start\":64632},{\"end\":64653,\"start\":64645},{\"end\":64666,\"start\":64653},{\"end\":64679,\"start\":64666},{\"end\":65144,\"start\":65137},{\"end\":65159,\"start\":65144},{\"end\":65169,\"start\":65159},{\"end\":65182,\"start\":65169},{\"end\":65453,\"start\":65441},{\"end\":65477,\"start\":65453},{\"end\":65495,\"start\":65477},{\"end\":65510,\"start\":65495},{\"end\":65523,\"start\":65510},{\"end\":66003,\"start\":65991},{\"end\":66016,\"start\":66003},{\"end\":66030,\"start\":66016},{\"end\":66041,\"start\":66030}]", "bib_venue": "[{\"end\":44918,\"start\":44812},{\"end\":45501,\"start\":45440},{\"end\":46019,\"start\":45958},{\"end\":46465,\"start\":46426},{\"end\":46821,\"start\":46766},{\"end\":47254,\"start\":47181},{\"end\":47868,\"start\":47781},{\"end\":48302,\"start\":48237},{\"end\":48579,\"start\":48537},{\"end\":48786,\"start\":48731},{\"end\":49160,\"start\":49097},{\"end\":49575,\"start\":49514},{\"end\":50020,\"start\":49933},{\"end\":50493,\"start\":50423},{\"end\":51029,\"start\":50923},{\"end\":51580,\"start\":51487},{\"end\":52030,\"start\":51967},{\"end\":52427,\"start\":52376},{\"end\":52916,\"start\":52823},{\"end\":53477,\"start\":53421},{\"end\":53914,\"start\":53853},{\"end\":54380,\"start\":54302},{\"end\":54942,\"start\":54836},{\"end\":55422,\"start\":55322},{\"end\":55870,\"start\":55783},{\"end\":56405,\"start\":56334},{\"end\":56888,\"start\":56827},{\"end\":57414,\"start\":57327},{\"end\":57955,\"start\":57878},{\"end\":58462,\"start\":58391},{\"end\":58985,\"start\":58932},{\"end\":59379,\"start\":59298},{\"end\":59825,\"start\":59754},{\"end\":60413,\"start\":60307},{\"end\":61017,\"start\":60930},{\"end\":61532,\"start\":61471},{\"end\":62045,\"start\":61859},{\"end\":62581,\"start\":62520},{\"end\":63125,\"start\":63019},{\"end\":63648,\"start\":63572},{\"end\":64145,\"start\":64069},{\"end\":64752,\"start\":64679},{\"end\":65196,\"start\":65182},{\"end\":65600,\"start\":65523},{\"end\":66118,\"start\":66041},{\"end\":45011,\"start\":44920},{\"end\":45549,\"start\":45503},{\"end\":46067,\"start\":46021},{\"end\":46863,\"start\":46823},{\"end\":47314,\"start\":47256},{\"end\":47942,\"start\":47870},{\"end\":48828,\"start\":48788},{\"end\":49210,\"start\":49162},{\"end\":49623,\"start\":49577},{\"end\":50094,\"start\":50022},{\"end\":50550,\"start\":50495},{\"end\":51122,\"start\":51031},{\"end\":51660,\"start\":51582},{\"end\":52080,\"start\":52032},{\"end\":52996,\"start\":52918},{\"end\":53520,\"start\":53479},{\"end\":53962,\"start\":53916},{\"end\":54445,\"start\":54382},{\"end\":55035,\"start\":54944},{\"end\":55944,\"start\":55872},{\"end\":56463,\"start\":56407},{\"end\":56936,\"start\":56890},{\"end\":57488,\"start\":57416},{\"end\":58019,\"start\":57957},{\"end\":58520,\"start\":58464},{\"end\":59883,\"start\":59827},{\"end\":60506,\"start\":60415},{\"end\":61091,\"start\":61019},{\"end\":61580,\"start\":61534},{\"end\":62629,\"start\":62583},{\"end\":63218,\"start\":63127},{\"end\":63711,\"start\":63650},{\"end\":64208,\"start\":64147},{\"end\":64812,\"start\":64754},{\"end\":65664,\"start\":65602},{\"end\":66182,\"start\":66120}]"}}}, "year": 2023, "month": 12, "day": 17}