{"id": 254854454, "updated": "2023-10-05 06:32:47.804", "metadata": {"title": "Unconstrained Traveling Tournament Problem is APX-complete", "authors": "[{\"first\":\"Salomon\",\"last\":\"Bendayan\",\"middle\":[]},{\"first\":\"Joseph\",\"last\":\"Cheriyan\",\"middle\":[]},{\"first\":\"Kevin\",\"last\":\"Cheung\",\"middle\":[\"K.H.\"]}]", "venue": "ArXiv", "journal": null, "publication_date": {"year": 2022, "month": null, "day": null}, "abstract": "We show that the Unconstrained Traveling Tournament Problem (UTTP) is APX-complete by presenting an L-reduction from a version of metric (1,2)-TSP to UTTP. Keywords: Traveling Tournament Problem, APX-complete, Approximation algorithms, Traveling Salesman Problem", "fields_of_study": "[\"Computer Science\",\"Mathematics\"]", "external_ids": {"arxiv": "2212.09165", "mag": null, "acl": null, "pubmed": null, "pubmedcentral": null, "dblp": "journals/orl/BendayanCC23", "doi": "10.1016/j.orl.2023.06.006"}}, "content": {"source": {"pdf_hash": "5036bb83265e96b6304f46e05d633a4304ac3dac", "pdf_src": "Arxiv", "pdf_uri": "[\"https://export.arxiv.org/pdf/2212.09165v1.pdf\"]", "oa_url_match": false, "oa_info": null}, "grobid": {"id": "566ed973c3d21c9b89adbfa24262c4281835c5fa", "type": "plain-text", "url": "s3://ai2-s2-pdf-extraction-prod/parse-results/s2orc_worker/5036bb83265e96b6304f46e05d633a4304ac3dac.txt", "contents": "\nUnconstrained Traveling Tournament Problem is APX-complete\n18 Dec 2022\n\nSalomon Bendayan \ns2benday@uwaterloo.ca Department of Combinatorics and Optimization\nUniversity of Waterloo\n200 University Avenue WestN2L 3G1WaterlooOntarioCanada\n\nJoseph Cheriyan \njcheriyan@uwaterloo.ca Department of Combinatorics and Optimization\nSchool of Mathematics and Statistics\nUniversity of Waterloo\n200 University Avenue WestN2L 3G1WaterlooOntarioCanada\n\nCarleton University\n1125 Colonel By DriveK1S 5B6OttawaOntarioCanada\n\nKevin K H Cheung ckcheung@math.carleton.ca \nUnconstrained Traveling Tournament Problem is APX-complete\n18 Dec 2022Traveling Tournament ProblemAPX-completeApproximation algorithmsTraveling Salesman Problem 2000 MSC: 90C2768Q25\nThe unconstrained Traveling Tournament Problem is APX-complete.\n\nIntroduction\n\nEaston, Nemhauser and Trick [1] introduced the Traveling Tournament Problem (TTP) in 2001. In fact, there are several versions of the TTP; the version formulated in [1] is called TTP (3), and another (simpler and fundamental) version is the unconstrained TTP, denoted UTTP. Over the years, many papers have been published on the TTP; the majority of the papers are on computational and modeling issues, while a few papers address issues pertaining to the computational complexity of TTP.\n\nAlthough it is natural to conjecture that the TTP is at least as hard as the well-known (metric) Traveling Salesman Problem (TSP), rigorous proofs were published many years after the appearance of [1]. Bhattacharyya [2] first showed that UTTP is NP-hard (he published a technical report in 2009). Subsequently, Thielen and Westphal [3] proved that TTP(3) is NP-hard, via a reduction from 3-SAT. Recently, Chatterjee [4] has reported that TTP(k) is NP-hard for all fixed k > 3, using a reduction from k-SAT.\n\nIn this paper, our goal is to show that UTTP is APX-complete, thus ruling out a PTAS (polynomial-time approximation scheme) for solving UTTP though a 2.75-approximation algorithm for UTTP does exist [5]. The (1,2)-TSP is the special case of the (metric) TSP where every inter-city distance is one or two. Papadimitriou and Yannakakis [6] showed that (1,2)-TSP is APX-complete, via the notion of an L-reduction. We start with this result of [6], and we construct an L-reduction from (1,2)-TSP to UTTP.\n\nOur construction is inspired by Bhattacharyya's construction for proving that UTTP is NP-hard. In fact, our construction may be viewed as a version of Bhattacharyya's construction and described in a more verbal way. We refer to Bhattacharyya [2] for key claims and their proofs.\n\nThe results of this paper appear in preliminary form in [7].\n\n\nThe Traveling Tournament Problem\n\nGiven n teams, with n being an even number, a double round-robin tournament is a schedule of games played between pairs of teams such that each pair of teams plays two games. Clearly, each team plays 2(n − 1) games, so the schedule has n × (n − 1) games. The schedule has 2(n − 1) days, where each day has n/2 games; thus each team plays on each day. For each game, one of the teams is designated the home team and the game is played at the city of the home team; and the other team is designated the away team;\n\nFor each team, a series of consecutive away games is called a road trip, while a series of consecutive home games is called a home stand. (Note that the length of a road trip (or home stand) is given by the number of opponents played and not by the distance travelled by the team.) For all pairs of teams i and j, the distance between the city of i and the city of j is given in an n × n matrix D; the inter-city distances are assumed to satisfy the triangle inequality.\n\nWhen playing an away game, a team travels from its home city to the opponent's city. When a team is playing consecutive away games, it travels directly from the city of one opponent to the city of the next opponent. At the conclusion of its road trip, the team returns to its home city.\n\nThe Traveling Tournament Problem (TTP) can be succinctly described as follows:\n\nInput: An even number of teams, n; an n × n integral distance matrix, D; integer parameters L, U.\n\nOutput: A double round-robin tournament of the n teams such that:\n\n• every team plays every other team once at its home city and once at the city of the opponent\n\n• the length of every home stand and the length of every road trip is between L and U, and\n\n• the total distance travelled by the teams is minimized. (At the start of the tournament before the first day, each team is assumed to be at its home city, and at the end of tournament after the 2(n − 1)-th day, each team is assumed to return to its home city.)\n\nA schedule satisfying the first constraint is a feasible double round-robin tournament. The second constraint is called the at-most constraint when L = 1. The final constraint corresponds to the objective function. There may be an additional constraint placed on the tournament:\n\n-No repeaters: in the tournament schedule, there is no pair of teams i and j such that the two games between i and j are played on consecutive days.\n\nThe TTP was originally introduced with L = 1 and U = 3.\n\nIn this paper, we focus on the variant of TTP with L = 1 and U = n − 1 called unconstrained TTP (UTTP). Our main result holds whether or not the no-repeaters constraint is present.\n\n\nL-reductions and APX-completeness\n\nThis subsection discusses the notions of L-reduction and APX-completeness.\n\nDefinition 1 (cf. Definition 16.4 in [8]). Given two NP optimization problems Π and Π ′ , we have an L-reduction from Π to Π ′ if for some parameters a, b > 0:\n\n1. For each instance I of Π we can compute in polynomial time an instance\nI ′ of Π ′ . 2. OPT(I ′ ) ≤ a · OPT(I).\n3. Given a solution of value V ′ to I ′ , we can compute in polynomial time a solution of value V to I such that\n| OPT(I) − V | ≤ b| OPT(I ′ ) − V ′ |\nAPX is the class of NP Optimization problems that have O(1)-approximation algorithms (see Definition 3.9, Chapter 3.1 [9]). A problem π in APX is called APX-complete if there exists an L-reduction from every problem in APX to π (see Chapter 8.4 [9]). Proposition 1 (Papadimitriou and Yannakakis [6]). (1,2)-TSP is APXcomplete.\n\n\nConstruction of a UTTP instance from a (1,2)-TSP instance\n\nLet G be a complete graph with edge-costs in {1, 2}. Observe that the edge-costs form a metric; i.e they satisfy the triangle inequality.\n\nWe construct a complete graph G ′ with edge-costs in {1, 2, 3, 4} (called a wheel graph in [2]) as follows: Fix a positive integer c and choose a vertex v of G to be the central vertex. Form the graph G (c) with c copies of G glued together at v. Then set G ′ and its associated edge-costs to be the metric completion of G (c) . Hence, the cost of an edge between vertices in the same copy remains the same as it was in G, while the cost of an edge e = (x, y) between vertices in different copies is the cost of a minimum-cost path between x and y given by D(x, v) + D(v, y). Figure 1 contains an example of the construction where v = v 1 is the central vertex and c = 3. Not all edges of G ′ are shown but the full distance matrix D is given.\n\nNote that G ′ has m := c(n − 1) + 1 vertices. For the remainder of the paper, we fix c ≥ 5. Figure 1: Small example: Our reduction from (1, 2)-TSP to TTP closely follows the one described in [2]. The main difference is in the definition of the edge-costs.\nG : v 1 v 2 v 3 y 2 y 3 x 2 x 3 z 3 z 2 v 1 2 2 G ′ 2 1 1 1 2 2 2 2 2 3 3 3G ′ from G with c = 3. D =           v x 2 x 3 y 2 y 3 z 2 z 3 v − 1 2 1 2 1 2 x 2 1 − 2 2 3 2 3 x 3 2 2 − 3 4 3 4 y 2 1 2 3 − 2 2 3 y 3 2 3 4 2 − 3 4 z 2 1 2 3 2 3 − 2 z 3 2 3 4 3 4 2 −          \nGiven an instance of (1, 2)-TSP on graph G, construct G ′ and the associated edge-costs as described above. Then construct a new graph H by adding a new vertex u and joining u to all vertices of G ′ with an edge-cost of w u to be specified depending on the context. Construct the corresponding TTP instance on H with 10m(m + 1) teams by placing 2 teams at the central vertex v, one team at each of the other m − 1 vertices of G ′ , and (m + 1)(10m − 1) teams at u.\n\nBhattacharyya [2] describes a construction of a TTP schedule for the TTP instance on H from a TSP tour τ in G which is essentially the following:\n\nFirst, the teams are split into 10m groups g 1 , . . . , g 10m , each of size m + 1, so that every team at a vertex in G ′ is in g 1 and the remaining teams, which are all at u, are arbitrarily divided into 10m − 1 groups of size m + 1. We label the teams in g 1 as t 1,1 , . . . , t 1,m+1 so that they follow the order in which they appear in the tour τ ′ . For i = 2, . . . , 10m, we label the teams in g i as t i,1 , . . . , t i,m+1 arbitrarily.\n\nWe build the TTP schedule in two phases. The first phase consists of 2m rounds made up of double round-robin schedules, one for each group, so that every team plays each of the other m teams in its group once at home and once away for a total of 2m games. The double round-robin schedule for each group can be constructed by using a standard construction for a single-round robin schedule and then appending to it a copy of itself but with home-away assignments reversed.\n\nIn the second phase, every team plays 2(m + 1)(10m − 1) games against teams from different groups. Phase 2 of the schedule is constructed in two stages. For the first stage, we treat each of the groups g 1 , . . . , g 10m as a single \"dummy team\" and create a single round-robin \"dummy tournament\" so that g 1 plays all away games against g 2 , . . . , g 10m in that order.\n\nA game between dummy teams g i and g j , where i > j, \"induces\" the following actual games: t i,k plays against t j,k , . . . , t j,m+1 , t j,1 , . . . , t j,k−1 in that order. (Therefore, t j,k plays against t i,k , t i,k−1 , . . . , t i,1 , t i,m+1 , t i,m , . . . , t j,k+1 in that order.) The home-away assignments of the actual games are inherited from the home-away assignments of the dummy teams. In other words, if dummy team g i is at home and receives dummy team g j , then all teams in g i are at home for their games against teams in g j .\n\nFor the second stage, we duplicate the single round-robin dummy tournament of the first stage with the home-away assignments reversed.\n\nNote that the constructed schedule satisfies the no-repeaters constraint.\n\n\nLemma 2.\n\nIf the cost of the TSP tour τ is at most K, then the constructed TTP tournament has cost at most 20w u m(m+1)+(10m−1)mcK+8m(m+1).\n\nProof. By Lemma 1, G ′ has a tour τ ′ of cost ν ≤ cK. We first bound the travel cost of Phase 1. Note that games between teams in groups other than g 1 carry a traveling cost of zero since all these teams are at u. For a team in group g 1 , the maximum distance it travels in these rounds is 8m since an edge in G ′ has cost at most 4, and it must visit m teams. Therefore the total distance travelled by all teams in Phase 1 is at most 8m(m + 1).\n\nWe now bound the travel cost of Phase 2. The first stage of this phase has 10m − 1 rounds. Since there are m + 1 teams in each group, teams in g 1 play a total of (10m − 1)(m + 1) away games at u in this stage. They visit u, collectively incurring a traveling cost of (m + 1)w u since the cost of traveling from any vertex in G ′ to u is w u . Once they are at u, they play all teams in g 2 , then those in g 3 , and so on, while remaining at u. When they return home, they again collectively travel a distance of (m + 1)w u . All other groups are at u so no distance is travelled in this stage. It follows that the total distance travelled in this stage is 2(m + 1)w u .\n\nIn the second stage, games between teams in groups other than g 1 incur no travel cost as before. But now, all the teams in groups g 2 , . . . , g 10m must travel from u to G ′ to play teams in g 1 . For each j ∈ {2, . . . , 10m}, the games between the teams in g j and those in g 1 are, by construction, as follows: For each k ∈ {1, . . . , m + 1}, team t j,k plays the teams t 1,k , . . . , t 1,m+1 , t 1,1 , . . . , t 1,k−1 in that order. Hence, team t j,k travels from u to G ′ , then travels along the tour τ ′ but missing the edge between t 1,k−1 and t 1,k , and then returns home to u. As a result, the total travel cost incurred by teams in g j is (m + 1)(2w u + ν) − ν = 2(m + 1)w u + mν.\n\nIn sum, the constructed TTP schedule has cost at most (10m − 1)(2w u (m + 1) + mν) + 2w u (m + 1) + 8m(m + 1) ≤ (10m − 1)(2w u (m + 1) + mcK) + 2w u (m + 1) + 8m(m + 1) = 20w u m(m + 1) + (10m − 1)mcK + 8m(m + 1) as desired.\n\nLemma 3. Given a schedule for the TTP instance H of cost ν ′ , a tour in G having cost K satisfying ν ′ ≥ 10m(m + 1)(2w u + cK − 4) can be obtained in polynomial time.\n\nProof. Consider a schedule for the TTP instance H of cost ν ′ .\n\nObserve that the travel pattern of a team t induces a closed walk P t through all the vertices of H having cost equal to the total travel cost of team t. Choose t so that this cost, which we call M, is least possible. Clearly, t can be obtained in polynomial time.\n\nAs there are 10m(m + 1) teams in total and each team's travel cost is at least M, we have ν ′ ≥ 10m(m + 1)M. To complete the proof, we construct from P t a tour in G of cost K satisfying 2w u + cK − 4 ≤ M.\n\nFirst of all, if P t is not a tour in H, there must be edges (x, z) and (z, y) so that x, z, y appear in sequence in the walk and z is visited more than once by the walk. As the edge-costs form a metric, we modify the walk without increasing its cost by replacing (x, z) and (z, y) with (x, y) so that the walk now skips z and goes directly from x to y. We repeat this short-cutting process until the walk is a tour in H. Remove the edges in this tour incident with u and join the other ends to obtain a tour T ′ in G ′ . Since the cost of an edge in G ′ is at most 4, the cost of this tour is at most M − 2w u + 4.\n\nBy our choice of the edge-costs for G ′ , the cost of going from a vertex x in one copy of G in G (c) to a vertex y in another copy is the same as the cost of going from x to v and then from v to y. Hence, we can turn the tour T ′ into to a closed walk P ′ by replacing edges (x, y) that cross copies by the edges (x, v), (v, y) while maintaining the same cost.\n\nObserve that in each copy of G, P ′ induces a collection of tours that span all the vertices in that copy of G meeting only at v. As the edge-costs form a metric, we can again perform short-cutting without increasing the cost of P ′ until P ′ induces a tour in every copy of G. We pick the induced tour with minimum cost and call its cost K. Clearly, this tour can be obtained in polynomial time.\n\nSince there are c copies of G in G ′ , the cost of P ′ is at least cK. But we know that the cost of P ′ is at most M − 2w u + 4. Hence, M ≥ 2w u + cK − 4 as desired.\n\n\nAPX completeness of UTTP\n\nThe goal of this section is to establish the following: Theorem 1. The unconstrained Traveling Tournament Problem, with or without the no-repeaters constraint, is APX-complete.\n\nThe core of our proof is an L-reduction from a boosted version of (1, 2)-TSP defined as follows: Let G be a complete graph with m nodes with edge-costs in {1, 2}. Let boosted (1, 2)-TSP be the problem of computing a TSP tour T such that the objective (m(m + 1))(cost(T )) is minimized. Suppose there is a polynomial-time approximation scheme for boosted (1, 2)-TSP, then for any ε we can find a solution S in polynomial time such that m(m+1)·cost(S) is at most (1+ε)·µ B = (1+ε)(m(m+1))·µ. Therefore, cost(S) is at most (1 + ε) · µ. Moreover, since S is a TSP tour on G, it is a solution to the regular TSP instance. It follows that if boosted (1, 2)-TSP has a PTAS, then for every ε, we can find a TSP tour S such that cost(S) is within (1 + ε) of µ. Since (1, 2)-TSP is APX-complete by Proposition 1, we conclude that boosted (1, 2)-TSP is APX-complete as well.\n\nLet I be a boosted TSP instance on graph G with input integer c ≥ 5. Let I ′ be the corresponding TTP instance constructed as in Section 2.\n\n\nProof of Theorem 1\n\nFirst, note that UTTP, with or without the no-repeaters constraint, admits an O(1)-approximation algorithm [5] and is therefore in APX.\n\nTo complete the proof, we show that there is an L-reduction from boosted (1, 2)-TSP to UTTP by making use of the results of Section 2. In particular, we verify the following conditions:\n\n1. For each instance I of boosted TSP, we can compute an instance I ′ of TTP in polynomial time. 2. OPT(I ′ ) ≤ 40c · OPT(I) 3. Given a solution of value ν ′ to I ′ , we can compute in polynomial time a solution to I of cost µ such that\nµ − OPT(I) ≤ ν ′ − OPT(I ′ ).\nTo satisfy condition 1, it suffices to use the construction in Section 2 where the boosted (1, 2)-TSP instance is the TSP instance on G with its objective multiplied by m(m + 1).\n\nFor condition 2, suppose that the instance of boosted (1, 2)-TSP on the graph G has optimal value m(m + 1)µ * . Hence, the optimal value of the regular TSP instance is µ * . Clearly, n ≤ µ * ≤ 2n. Applying Lemma 2 with w u = 2cn−1 2 gives OPT(I ′ ) ≤ 20w u m(m + 1) + (10m − 1)mcµ * + 8m(m + 1) = 10(2cn − 1)m(m + 1) + (10m − 1)m(2cn) + 8m(m + 1) < 40m(m + 1)cn ≤ 40m(m + 1)cµ * = 40c · OPT(I).\n\nFinally, we verify condition 3. Consider a schedule for the TTP instance with cost ν ′ . By Lemma 3, we can construct, in polynomial time, a tour in G having cost µ ′ satisfying ν ′ ≥ 10m(m + 1)(2w u + cµ ′ − 4).\n\nLet µ = m(m + 1)µ ′ . If µ = OPT(I), then there is nothing to prove. Hence, assume that µ > OPT(I).\n\nLet OPT(I) be given by m(m+1)µ * . Observe that µ * is the optimal value of the regular TSP instance on G. Thus, µ ′ > µ * ≥ n ≥ 3. By Lemma 2, there is a TTP schedule having cost ν * ≤ 20w u m(m + 1) + (10m − 1)mcµ * + 8m(m + 1).\n\nThen, \nν ′ − OPT(I ′ ) ≥ ν ′ − ν * ≥ 10m(m + 1)(2w u + cµ ′ − 4) − (\nLemma 4 .\n4Boosted (1, 2)-TSP is APX-complete.Proof. Let µ B and µ be the optimal values of the boosted (1, 2)-TSP and regular (1, 2)-TSP, respectively, on a given complete graph G with m nodes with edge-costs in {1, 2}.\n\n\n20w u m(m + 1) + (10m − 1)mcµ * + 8m(m + 1)) = 10m(m + 1)(cµ ′ − 4) − (10m − 1)mcµ * − 8m(m + 1) = (10m − 1)m(c(µ ′ − µ * ) − 4) + 11m(cµ ′ − 4) − 8m(m + 1) > (10m − 1)m(c(µ ′ − µ * ) − 4) + 11m(cn − 4) − 8m(c(n − 1) + 2) = (10m − 1)m(c(µ ′ − µ * ) − 4) + m(c(3n + 8) − 60) ≥ (10m − 1)m(c − 4)(µ ′ − µ * )since c ≥ 5,, µ ′ > µ * and µ ′ and µ * are integers. Suppose by way of contradiction that µ − OPT(I) > ν ′ − OPT(I ′ ). In other words, suppose thatm(m + 1)(µ ′ − µ * ) > ν ′ − OPT(I ′ ).Continuing the above derivations givesν ′ − OPT(I ′ ) > (10m − 1)m(c − 4) ν ′ − OPT(I ′ ) ′ − OPT(I ′ )) > ν ′ − OPT(I ′ ),a contradiction.\n\n\nThe next lemma is Lemma 3.3 in[2].Lemma 1. There exists a TSP tour in G with cost at most K if and only if there exists a TSP tour in G ′ with cost at most cK.Corollary 1. The optimal cost of a TSP tour in G is K if and only if the optimal cost of a TSP tour in G ′ is cK.\n\nThe traveling tournament problem description and benchmarks. K Easton, G L Nemhauser, M Trick, Proceedings of the 7th International Conference on Principles and Practice of Constraint Programming, CP '01. the 7th International Conference on Principles and Practice of Constraint Programming, CP '01Berlin, HeidelbergSpringer-VerlagK. Easton, G. L. Nemhauser, M. Trick, The traveling tournament prob- lem description and benchmarks, in: Proceedings of the 7th International Conference on Principles and Practice of Constraint Programming, CP '01, Springer-Verlag, Berlin, Heidelberg, 2001, p. 580--584.\n\nComplexity of the unconstrained traveling tournament problem. R Bhattacharyya, 10.1016/j.orl.2016.07.011Oper. Res. Lett. 44R. Bhattacharyya, Complexity of the unconstrained traveling tournament problem, Oper. Res. Lett. 44 (2016) 649--654. doi:10.1016/j.orl.2016.07.011.\n\nComplexity of the traveling tournament problem. C Thielen, S Westphal, 10.1016/j.tcs.2010.10.001Theoretical Computer Science. 412C. Thielen, S. Westphal, Complexity of the traveling tourna- ment problem, Theoretical Computer Science 412 (2011) 345-351. doi:10.1016/j.tcs.2010.10.001.\n\nComplexity of traveling tournament problem with trip length more than three. D Chatterjee, ArXiv:2110.02300D. Chatterjee, Complexity of traveling tournament problem with trip length more than three, 2021. ArXiv:2110.02300.\n\nA 2.75-approximation algorithm for the unconstrained traveling tournament problem. S Imahori, T Matsui, R Miyashiro, 10.1007/s10479-012-1161-yAnnals of Operations Research. 218S. Imahori, T. Matsui, R. Miyashiro, A 2.75-approximation algorithm for the unconstrained traveling tournament problem, Annals of Operations Research 218 (2014) 237-247. doi:10.1007/s10479-012-1161-y.\n\nThe traveling salesman problem with distances one and two. C H Papadimitriou, M Yannakakis, 10.1287/moor.18.1.1Math. Oper. Res. 18C. H. Papadimitriou, M. Yannakakis, The traveling salesman prob- lem with distances one and two, Math. Oper. Res. 18 (1993) 1-11. doi:10.1287/moor.18.1.1.\n\nThe Traveling Tournament Problem, Master's thesis. S Bendayan, University of WaterlooS. Bendayan, The Traveling Tournament Problem, Master's thesis, University of Waterloo, 2022. URL: https://uwspace.uwaterloo.ca/handle/10012/18553.\n\nThe Design of Approximation Algorithms. D Williamson, D Shmoys, Cambridge University PressD. Williamson, D. Shmoys, The Design of Approxima- tion Algorithms, Cambridge University Press, 2011. URL: https://designofapproxalgs.com/book.pdf.\n\nG Ausiello, P Crescenzi, G Gambosi, V Kann, A Marchetti-Spaccamela, M Protasi, 10.1007/978-3-642-58412-1Complexity and Approximation: Combinatorial Optimization Problems and Their Approximability Properties. Berlin HeidelbergSpringer-VerlagG. Ausiello, P. Crescenzi, G. Gambosi, V. Kann, A. Marchetti- Spaccamela, M. Protasi, Complexity and Approximation: Combinatorial Optimization Problems and Their Approximability Properties, Springer- Verlag Berlin Heidelberg, 1999. doi:10.1007/978-3-642-58412-1.\n", "annotations": {"author": "[{\"end\":236,\"start\":73},{\"end\":506,\"start\":237},{\"end\":550,\"start\":507}]", "publisher": null, "author_last_name": "[{\"end\":89,\"start\":81},{\"end\":252,\"start\":244},{\"end\":523,\"start\":517}]", "author_first_name": "[{\"end\":80,\"start\":73},{\"end\":243,\"start\":237},{\"end\":512,\"start\":507},{\"end\":516,\"start\":513}]", "author_affiliation": "[{\"end\":235,\"start\":91},{\"end\":436,\"start\":254},{\"end\":505,\"start\":438}]", "title": "[{\"end\":59,\"start\":1},{\"end\":609,\"start\":551}]", "venue": null, "abstract": "[{\"end\":796,\"start\":733}]", "bib_ref": "[{\"attributes\":{\"ref_id\":\"b0\"},\"end\":843,\"start\":840},{\"attributes\":{\"ref_id\":\"b0\"},\"end\":980,\"start\":977},{\"attributes\":{\"ref_id\":\"b2\"},\"end\":998,\"start\":995},{\"attributes\":{\"ref_id\":\"b0\"},\"end\":1501,\"start\":1498},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":1520,\"start\":1517},{\"attributes\":{\"ref_id\":\"b2\"},\"end\":1636,\"start\":1633},{\"attributes\":{\"ref_id\":\"b3\"},\"end\":1720,\"start\":1717},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":2011,\"start\":2008},{\"attributes\":{\"ref_id\":\"b5\"},\"end\":2146,\"start\":2143},{\"attributes\":{\"ref_id\":\"b5\"},\"end\":2252,\"start\":2249},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":2556,\"start\":2553},{\"attributes\":{\"ref_id\":\"b6\"},\"end\":2650,\"start\":2647},{\"attributes\":{\"ref_id\":\"b7\"},\"end\":5480,\"start\":5477},{\"attributes\":{\"ref_id\":\"b8\"},\"end\":5987,\"start\":5984},{\"attributes\":{\"ref_id\":\"b8\"},\"end\":6114,\"start\":6111},{\"attributes\":{\"ref_id\":\"b5\"},\"end\":6164,\"start\":6161},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":6487,\"start\":6484},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":7332,\"start\":7329},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":8169,\"start\":8166},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":16144,\"start\":16141},{\"attributes\":{\"ref_id\":\"b2\"},\"end\":16484,\"start\":16483},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":18708,\"start\":18705}]", "figure": "[{\"attributes\":{\"id\":\"fig_0\"},\"end\":18037,\"start\":17816},{\"attributes\":{\"id\":\"fig_1\"},\"end\":18672,\"start\":18038},{\"attributes\":{\"id\":\"tab_0\",\"type\":\"table\"},\"end\":18947,\"start\":18673}]", "paragraph": "[{\"end\":1299,\"start\":812},{\"end\":1807,\"start\":1301},{\"end\":2309,\"start\":1809},{\"end\":2589,\"start\":2311},{\"end\":2651,\"start\":2591},{\"end\":3199,\"start\":2688},{\"end\":3671,\"start\":3201},{\"end\":3959,\"start\":3673},{\"end\":4039,\"start\":3961},{\"end\":4138,\"start\":4041},{\"end\":4205,\"start\":4140},{\"end\":4301,\"start\":4207},{\"end\":4393,\"start\":4303},{\"end\":4657,\"start\":4395},{\"end\":4937,\"start\":4659},{\"end\":5087,\"start\":4939},{\"end\":5144,\"start\":5089},{\"end\":5326,\"start\":5146},{\"end\":5438,\"start\":5364},{\"end\":5599,\"start\":5440},{\"end\":5674,\"start\":5601},{\"end\":5827,\"start\":5715},{\"end\":6192,\"start\":5866},{\"end\":6391,\"start\":6254},{\"end\":7136,\"start\":6393},{\"end\":7393,\"start\":7138},{\"end\":8150,\"start\":7686},{\"end\":8297,\"start\":8152},{\"end\":8747,\"start\":8299},{\"end\":9220,\"start\":8749},{\"end\":9595,\"start\":9222},{\"end\":10148,\"start\":9597},{\"end\":10284,\"start\":10150},{\"end\":10359,\"start\":10286},{\"end\":10501,\"start\":10372},{\"end\":10950,\"start\":10503},{\"end\":11623,\"start\":10952},{\"end\":12322,\"start\":11625},{\"end\":12548,\"start\":12324},{\"end\":12717,\"start\":12550},{\"end\":12782,\"start\":12719},{\"end\":13048,\"start\":12784},{\"end\":13255,\"start\":13050},{\"end\":13872,\"start\":13257},{\"end\":14235,\"start\":13874},{\"end\":14633,\"start\":14237},{\"end\":14800,\"start\":14635},{\"end\":15005,\"start\":14829},{\"end\":15870,\"start\":15007},{\"end\":16011,\"start\":15872},{\"end\":16169,\"start\":16034},{\"end\":16356,\"start\":16171},{\"end\":16594,\"start\":16358},{\"end\":16803,\"start\":16625},{\"end\":17199,\"start\":16805},{\"end\":17413,\"start\":17201},{\"end\":17514,\"start\":17415},{\"end\":17746,\"start\":17516},{\"end\":17754,\"start\":17748}]", "formula": "[{\"attributes\":{\"id\":\"formula_0\"},\"end\":5714,\"start\":5675},{\"attributes\":{\"id\":\"formula_1\"},\"end\":5865,\"start\":5828},{\"attributes\":{\"id\":\"formula_2\"},\"end\":7469,\"start\":7394},{\"attributes\":{\"id\":\"formula_3\"},\"end\":7685,\"start\":7469},{\"attributes\":{\"id\":\"formula_4\"},\"end\":16624,\"start\":16595},{\"attributes\":{\"id\":\"formula_5\"},\"end\":17816,\"start\":17755}]", "table_ref": null, "section_header": "[{\"attributes\":{\"n\":\"1.\"},\"end\":810,\"start\":798},{\"attributes\":{\"n\":\"1.1.\"},\"end\":2686,\"start\":2654},{\"attributes\":{\"n\":\"1.2.\"},\"end\":5362,\"start\":5329},{\"attributes\":{\"n\":\"2.\"},\"end\":6252,\"start\":6195},{\"end\":10370,\"start\":10362},{\"attributes\":{\"n\":\"3.\"},\"end\":14827,\"start\":14803},{\"attributes\":{\"n\":\"3.1.\"},\"end\":16032,\"start\":16014},{\"end\":17826,\"start\":17817}]", "table": null, "figure_caption": "[{\"end\":18037,\"start\":17828},{\"end\":18672,\"start\":18040},{\"end\":18947,\"start\":18675}]", "figure_ref": "[{\"end\":6977,\"start\":6969},{\"end\":7238,\"start\":7230},{\"end\":12037,\"start\":12002}]", "bib_author_first_name": "[{\"end\":19011,\"start\":19010},{\"end\":19021,\"start\":19020},{\"end\":19023,\"start\":19022},{\"end\":19036,\"start\":19035},{\"end\":19615,\"start\":19614},{\"end\":19873,\"start\":19872},{\"end\":19884,\"start\":19883},{\"end\":20187,\"start\":20186},{\"end\":20417,\"start\":20416},{\"end\":20428,\"start\":20427},{\"end\":20438,\"start\":20437},{\"end\":20771,\"start\":20770},{\"end\":20773,\"start\":20772},{\"end\":20790,\"start\":20789},{\"end\":21049,\"start\":21048},{\"end\":21272,\"start\":21271},{\"end\":21286,\"start\":21285},{\"end\":21471,\"start\":21470},{\"end\":21483,\"start\":21482},{\"end\":21496,\"start\":21495},{\"end\":21507,\"start\":21506},{\"end\":21515,\"start\":21514},{\"end\":21539,\"start\":21538}]", "bib_author_last_name": "[{\"end\":19018,\"start\":19012},{\"end\":19033,\"start\":19024},{\"end\":19042,\"start\":19037},{\"end\":19629,\"start\":19616},{\"end\":19881,\"start\":19874},{\"end\":19893,\"start\":19885},{\"end\":20198,\"start\":20188},{\"end\":20425,\"start\":20418},{\"end\":20435,\"start\":20429},{\"end\":20448,\"start\":20439},{\"end\":20787,\"start\":20774},{\"end\":20801,\"start\":20791},{\"end\":21058,\"start\":21050},{\"end\":21283,\"start\":21273},{\"end\":21293,\"start\":21287},{\"end\":21480,\"start\":21472},{\"end\":21493,\"start\":21484},{\"end\":21504,\"start\":21497},{\"end\":21512,\"start\":21508},{\"end\":21536,\"start\":21516},{\"end\":21547,\"start\":21540}]", "bib_entry": "[{\"attributes\":{\"id\":\"b0\",\"matched_paper_id\":26978757},\"end\":19550,\"start\":18949},{\"attributes\":{\"doi\":\"10.1016/j.orl.2016.07.011\",\"id\":\"b1\",\"matched_paper_id\":19451487},\"end\":19822,\"start\":19552},{\"attributes\":{\"doi\":\"10.1016/j.tcs.2010.10.001\",\"id\":\"b2\",\"matched_paper_id\":17165527},\"end\":20107,\"start\":19824},{\"attributes\":{\"doi\":\"ArXiv:2110.02300\",\"id\":\"b3\"},\"end\":20331,\"start\":20109},{\"attributes\":{\"doi\":\"10.1007/s10479-012-1161-y\",\"id\":\"b4\",\"matched_paper_id\":11669985},\"end\":20709,\"start\":20333},{\"attributes\":{\"doi\":\"10.1287/moor.18.1.1\",\"id\":\"b5\",\"matched_paper_id\":26197572},\"end\":20995,\"start\":20711},{\"attributes\":{\"id\":\"b6\"},\"end\":21229,\"start\":20997},{\"attributes\":{\"id\":\"b7\"},\"end\":21468,\"start\":21231},{\"attributes\":{\"doi\":\"10.1007/978-3-642-58412-1\",\"id\":\"b8\"},\"end\":21972,\"start\":21470}]", "bib_title": "[{\"end\":19008,\"start\":18949},{\"end\":19612,\"start\":19552},{\"end\":19870,\"start\":19824},{\"end\":20414,\"start\":20333},{\"end\":20768,\"start\":20711}]", "bib_author": "[{\"end\":19020,\"start\":19010},{\"end\":19035,\"start\":19020},{\"end\":19044,\"start\":19035},{\"end\":19631,\"start\":19614},{\"end\":19883,\"start\":19872},{\"end\":19895,\"start\":19883},{\"end\":20200,\"start\":20186},{\"end\":20427,\"start\":20416},{\"end\":20437,\"start\":20427},{\"end\":20450,\"start\":20437},{\"end\":20789,\"start\":20770},{\"end\":20803,\"start\":20789},{\"end\":21060,\"start\":21048},{\"end\":21285,\"start\":21271},{\"end\":21295,\"start\":21285},{\"end\":21482,\"start\":21470},{\"end\":21495,\"start\":21482},{\"end\":21506,\"start\":21495},{\"end\":21514,\"start\":21506},{\"end\":21538,\"start\":21514},{\"end\":21549,\"start\":21538}]", "bib_venue": "[{\"end\":19265,\"start\":19154},{\"end\":21695,\"start\":21678},{\"end\":19152,\"start\":19044},{\"end\":19671,\"start\":19656},{\"end\":19948,\"start\":19920},{\"end\":20184,\"start\":20109},{\"end\":20504,\"start\":20475},{\"end\":20837,\"start\":20822},{\"end\":21046,\"start\":20997},{\"end\":21269,\"start\":21231},{\"end\":21676,\"start\":21574}]"}}}, "year": 2023, "month": 12, "day": 17}