{"id": 254926475, "updated": "2023-04-27 06:25:09.967", "metadata": {"title": "Semi-Supervised Bifold Teacher-Student Learning for Indoor Presence Detection Under Time-Varying CSI", "authors": "[{\"first\":\"Li-Hsiang\",\"last\":\"Shen\",\"middle\":[]},{\"first\":\"Kai-Jui\",\"last\":\"Chen\",\"middle\":[]},{\"first\":\"An-Hung\",\"last\":\"Hsiao\",\"middle\":[]},{\"first\":\"Kai-Ten\",\"last\":\"Feng\",\"middle\":[]}]", "venue": "ArXiv", "journal": "ArXiv", "publication_date": {"year": 2022, "month": null, "day": null}, "abstract": "In recent years, there have been abundant researches focused on indoor human presence detection based on laborious supervised learning (SL) and channel state information (CSI). These existing studies adopt spatial information of CSI to improve detection accuracy. However, channel is susceptible to arbitrary environmental changes in practice, such as the object movement, atmospheric factors and machine rebooting, which leads to degraded prediction accuracy. However, the existing SL-based methods require to re-train a new model with time-consuming labeling. Therefore, designing a semi-supervised learning (SSL) based scheme by continuously monitoring model ”life-cycle” becomes compellingly imperative. In this paper, we propose bifold teacher-student (BTS) learning for presence detection system, which combines SSL by utilizing partial labeled and unlabeled dataset. The proposed primal-dual teacherstudent network is capable of intelligently learning spatial and temporal features from labeled and unlabeled CSI. Additionally, the enhanced penalized loss function leveraging entropy and distance measure can distinguish the drifted data, i.e., features of new dataset are affected by time-varying effect and are alternated from the original distribution. The experimental results demonstrate that the proposed BTS system can sustain the asymptotic accuracy after retraining the model with unlabeled data. Moreover, label-free BTS outperforms the existing SSLbased models in terms of the highest detection accuracy, while achieving the similar performance of SL-based methods.", "fields_of_study": "[\"Computer Science\"]", "external_ids": {"arxiv": null, "mag": null, "acl": null, "pubmed": null, "pubmedcentral": null, "dblp": "journals/corr/abs-2212-10802", "doi": "10.48550/arxiv.2212.10802"}}, "content": {"source": {"pdf_hash": "ef4d329f0c403804733b257fdce4cd0e13a4559c", "pdf_src": "Arxiv", "pdf_uri": "[\"https://export.arxiv.org/pdf/2212.10802v1.pdf\"]", "oa_url_match": false, "oa_info": null}, "grobid": {"id": "adb0102b0f747c5c3000a3fc76959ecd07dbca57", "type": "plain-text", "url": "s3://ai2-s2-pdf-extraction-prod/parse-results/s2orc_worker/ef4d329f0c403804733b257fdce4cd0e13a4559c.txt", "contents": "\nSemi-Supervised Bifold Teacher-Student Learning for Indoor Presence Detection Under Time-Varying CSI\n21 Dec 2022\n\nLi-Hsiang Shen \nDepartment of Electronics and Electrical Engineering\nNational Yang Ming Chiao Tung University\nHsinchuTaiwan\n\nKai-Jui Chen \nDepartment of Electronics and Electrical Engineering\nNational Yang Ming Chiao Tung University\nHsinchuTaiwan\n\nAn-Hung Hsiao \nDepartment of Electronics and Electrical Engineering\nNational Yang Ming Chiao Tung University\nHsinchuTaiwan\n\nKai-Ten Feng ktfeng@nycu.edu.tw \nDepartment of Electronics and Electrical Engineering\nNational Yang Ming Chiao Tung University\nHsinchuTaiwan\n\nSemi-Supervised Bifold Teacher-Student Learning for Indoor Presence Detection Under Time-Varying CSI\n21 Dec 20221Index Terms-Deep learningteacher-student learningsemi- supervised learningtime-varying environmenthuman presence detectionchannel state information (CSI)\nIn recent years, there have been abundant researches focused on indoor human presence detection based on laborious supervised learning (SL) and channel state information (CSI). These existing studies adopt spatial information of CSI to improve detection accuracy. However, channel is susceptible to arbitrary environmental changes in practice, such as the object movement, atmospheric factors and machine rebooting, which leads to degraded prediction accuracy. However, the existing SL-based methods require to re-train a new model with time-consuming labeling. Therefore, designing a semi-supervised learning (SSL) based scheme by continuously monitoring model \"life-cycle\" becomes compellingly imperative. In this paper, we propose bifold teacher-student (BTS) learning for presence detection system, which combines SSL by utilizing partial labeled and unlabeled dataset. The proposed primal-dual teacherstudent network is capable of intelligently learning spatial and temporal features from labeled and unlabeled CSI. Additionally, the enhanced penalized loss function leveraging entropy and distance measure can distinguish the drifted data, i.e., features of new dataset are affected by time-varying effect and are alternated from the original distribution. The experimental results demonstrate that the proposed BTS system can sustain the asymptotic accuracy after retraining the model with unlabeled data. Moreover, label-free BTS outperforms the existing SSLbased models in terms of the highest detection accuracy, while achieving the similar performance of SL-based methods.Index Terms-Deep learning, teacher-student learning, semisupervised learning, time-varying environment, human presence detection, channel state information (CSI).\n\nI. INTRODUCTION\n\nWith the development of network technology, more and more wireless networking devices through Wi-Fi are on the market to provide people with a convenient life. The most vigorous development in recent years is the internet of things (IoT) devices in the home environment, such as smart air conditioners, smart speakers, and smart plug sockets. Among these smart home appliances, most of them only provide the convenience of the home environment and lack security. Safety is essential in the home environment because it involves not only the safety of people's property but also the protection of life. This includes the invasion of strangers, the home care of the elderly, and more. Therefore, with the increasing awareness and demand for home security, we need more related wireless devices to support our peaceful life.\n\nIn practice, there are indeed many device-based wireless devices for home security applications, such as smartphones [1,2] and smart watches [3,4]. However, in most indoor scenarios, these device-based devices are not carried around, which makes device-based devices unable to effectively provide home security assistance. On the other hand, some devicefree devices are also engaged in the applications of home security. The most widely used currently is the IP camera [5][6][7], these methods use image analysis to evaluate indoor human detection. However, this also involves great privacy issues, since no one would want their private life to be recorded by a camera after all. In addition, the network camera also faces the problem of detecting blind spots due to obstacles in the indoor environment. Therefore, more and more researchers are investing in the study of how to utilize the information provided by Wi-Fi to detect people indoors, because the radio frequency (RF) signal of Wi-Fi has characteristics that cannot be explained intuitively and can penetrate the walls. Among the information provided by Wi-Fi, channel state information (CSI) is the most popular recently [8][9][10]. At the same time, with the evolution of deep learning in recent years, these researchers also attempt to use these Wi-Fi signals for network deep learning [11][12][13][14][15][16][17][18][19].\n\nIn [8], the fine-grained fingerprinting method was proposed to compare the real-time streaming CSI data with the offline radio map established in the database. Moreover, the learningbased method on CSI data improves detection performance. For example, the support vector machines (SVM) classification [9] was used to perform device-free presence detection, and the autoencoder (AE) approach [11] was adopted to have a dimensionality reduction of CSI data by reconstructing the input neural network training process. Furthermore, the amplitude and phase responses were both used in parallel convolutional neural network (CNN) [12] to extract the spatial feature in CSI images. In the meanwhile, some approaches focus on the correlation in a period of time of sequential CSI data. They leveraged the recurrent neural network (RNN) based networks to perform detection, including long shortterm memory (LSTM) [13] and gated recurrent unit (GRU) [14,15] ; whilst AE-LRCN in DeepSence [16] combined AE, CNN, and LSTM to perform device-free human activity recognition. In addition to the models for detection, some other tasks attempt to overcome the lack of CSI data using generative adversarial nets (GAN) [17] while training the detection model. Nonetheless, CSI is susceptible to the timevarying effect due to the change in time and environment [20]. Once the severe time-varying effect occurs, the pattern of CSI will be completely different from the original. This also means that the life cycle of the model ends, and we need to retrain the model to adapt to the new data distribution. Unfortunately, most of the above-mentioned approaches for indoor human detection are supervised learning (SL) methods. In other words, if these algorithms encounter serious timevarying effects and need to retrain data, they must manually label new data. This time-consuming and labor-intensive result is an unbearable problem, so we turn to the semi-supervised learning (SSL) method to use a part of the labeled CSI dataset to train the new unlabeled CSI dataset. In this way, we only need to label data once, which can be reused in subsequent retraining.\n\nIn the field of SSL, MCBAR [21] and CsiGAN [22] are based on GAN to classify real and fake data in discriminator, and DADA-AD [23] leverages transfer learning and domain adaptation. Moreover, SemiC-HAR [24] uses a temporal classifier to label the unlabeled dataset first, and then builds an encoder to train these two datasets. These existing works try to transfer from the domain of labeled CSI dataset to the domain of unlabeled CSI dataset for human activity recognition. However, most of these existing works either still require ground truth for some unlabeled data or do not address the consequences when the distributions of labeled and unlabeled datasets differ greatly. Apart from that, most of the mentioned works only conduct experiments in a single room, which simplifies the training difficulty. Only CsiGAN has scenarios that use more than one room and does not limit the labeled and unlabeled data to a similar distribution. Nonetheless, CsiGAN requires a lot of training time while training the CycleGAN [25] in their algorithm.\n\nIn order to solve the problem of time-varying effect and maintain a high-precision model in adjoining room scenario at the same time, we designed the bifold teacher-student networks (BTS) system. In addition, we set the scene in an adjoining room to increase the complexity of the problem and save the number of Wi-Fi devices at the same time. Our proposed BTS system refers to the communicative teacher and student model of meta pseudo labels (MPL) [26], which viewed the teacher-student training process as a bi-level optimization problem, for our SSL system design. Furthermore, we extend the original MPL to two teacher-student networks and design a path to communicate with each other to achieve selfsupervised learning. In the design of the two teacher-student networks, we use Transformer Encoder [27] and ResNet [28] to learn the same data from a temporal perspective and a spatial perspective. Our previous work [29] have shown the feasibility of using a Transformer Encoder teacher-student network to solve our problem. However, there is still room for accuracy improvement, and we should consider a harder time-varying scenario. Therefore, we hope to further enhance our performance through learning perspectives from teacherstudent networks, and utilize the response of data in different cases from preliminary observations to overcome the severe time-varying effect. The main contributions of this paper are summarized as follows.\n\n• We observed different responses of CSI in the adjoining room scenario, including human presence situations and different levels of time-varying problem. Based on our observations, we proposed a semi-supervised CSI-based bifold teacher-student presence detection system in adjoining room scenario to resolve the problems of indoor human presence detection, especially the exaggerated labeling cost and drifted datasets issue due to timevarying channel. • Our network overcomes the time-varying problem by leveraging the characteristics of the channel in different cases of human presence. We measure a time-invariant indicator for each case by computing subcarrier-wise entropy within a time period. It generates confidence distribution of cases viewed as the prior knowledge to CSI data. • A series of loss functions are designed to enhance performance and resolve various problems, including selfsupervised learning between two teacher-student networks by minimizing their distance in latent space; data drift evaluation by constraining the dataset in hypersphere; and regulating inconsistent distribution of drifted data by adding confidence distribution. • Experiments and real-time prototypes are conducted to demonstrate that the proposed BTS system can achieve the highest accuracy compared with different semisupervised based algorithms. Moreover, the overall accuracy of our system almost measures up to other supervised-based algorithms and even surpasses them in some datasets.\n\n\nII. SYSTEM ARCHITECTURE AND PRELIMINARY OBSERVATIONS A. System Architecture\n\nThe proposed system aims to accomplish a high performance device-free CSI-based human presence detection and establish a lifelong system to overcome severe time-varying effect of CSI in adjoining two-room scenario by utilizing two commercial off-the-shelf Wi-Fi access points (APs) in each room. As illustrated in Fig. 1, a pair of APs serving as a transmitter (TX) and a receiver (RX) is set up in an adjoining room with or without human involvement. The TX in room A periodically sends radio frequency (RF) signal to the RX in room B. After that, RX estimates the CSI from the wireless channel and delivers it to the database in edge computer for further proposed algorithm training. After having the trained model, we can predict human existence in our two-room scenario. However, the CSI isn't always stable due to some external factors as we mentioned before. Our proposed system is able to detect the severe drift of CSI data and retrain the deep neural networks (DNN) model from drifted data. Hence, the unlabeled database will be updated every time the drift occurs, and the labeled database will still remain the same. In our prediction model, there are four cases of presence detection in total, namely empty in both rooms, a person in room A and empty in room B, empty in room A and a person in room B, and finally a person in both rooms.\n\n\nB. Channel State Information\n\nChannel state information (CSI) is treated to be vital information when estimating the wireless channel, which rep- resents the combination of fading propagation effects. The information can be calculated based on orthogonal frequencydivision multiplexing (OFDM) and multiple-input multipleoutput (MIMO) in IEEE 802.11n. In the OFDM system, all subcarriers are orthogonal to each other within a channel, which boosts channel utilization. On the other hand, the MIMO technique provides a matrix channel to enrich spatial information by propagating the RF signal from a TX through an RX, furnishing multiple antenna pairs for CSI. On the basis of these two techniques, We can establish the channel model by the combined MIMO-OFDM system in an indoor environment, which can be formulated as\ny t,s,k = h t,s,k x t,s,k + w t,s,k ,(1)\nwhere y t,s,k and x t,s,k represent the received and transmitted signals with the s th subcarrier of k th antenna pair at t th packet, respectively. h t,s,k is the channel response, and w t,s,k is additive white Gaussian noise (AWGN). To estimate the channel model, the CSI of the s th subcarrier and k th antenna pair at t th packet can be acquired aŝ h t,s,k = y t,s,k x t,s,k =|ĥ t,s,k |e j sin( ĥ t,s,k ) ,\n\nwhere |ĥ t,s,k | represents the amplitude response of CSI, and ĥ t,s,k corresponds to the phase response of the CSI with s th subcarrier and k th antenna pair at t th packet. As shown in Fig. 2a of our proposed system, only the amplitude response of CSI is considered because the phase response has been studied to be noisy and indescribable [30]. Moreover, the antenna pairwise normalization is conducted to the amplitude response of CSI, the normalized CSI with s th subcarrier and k th antenna pair at t th packet can be expressed as\nh t,s,k = norm ĥ t,s,k = ĥ t,s,k − miñ s ĥ t,s,k max s ĥ t,s,k − miñ s ĥ t,s,k ,(3)\nwhere ∀s = {1, 2, . . . , S}, |ĥ t,s,k | represents the amplitude response of raw CSI. In the meanwhile, the minimum and maximum value of amplitude response of raw CSI from all S subcarriers at the k th antenna pair are selected to apply the pair-wise normalization. Fig. 2b displays the difference between amplitude response of raw CSI and amplitude response of normalized CSI. \n\n\nC. Observations of Human Interference on Wireless Channel in adjoining room Scenario\n\nIn our adjoining room scenario, the amplitude response of normalized CSI is variable and follows different patterns among cases. As Fig. 3 shows, the amplitude response of normalized CSI of human presence on either side of adjoining room and both sides have more fluctuation than the empty case in a period of time. Fig. 3a demonstrates the relative stability of a wireless channel in an empty case when there is no interference in the environment. In addition to the empty case, the case that human presence on both sides of adjoining room oscillates the most because of the uncertainty of two moving humans. The least stable case is displayed in Fig.  3d. Finally, from Fig. 3b and 3c, we can observe that in both cases human presence on either side of adjoining room reacts in a similar way. Fortunately, if we take a closer look at these two cases, there are still some differences between them. More precisely, although they are all affected by the multipath effect, the human presence in different rooms can cause divergent multipath fading which results in small-scale variation. According to the observations of human interfer-ence, there are some large-scale patterns to distinguish these four human presence cases when we view all the subcarriers of every antenna pair as a representation vector. Furthermore, based on the multipath fading effect, we can utilize the smallscale variation to find the relation between wireless signals and spatial features.\n\n\nD. Observations of Time-Varying Effect on Wireless Channel\n\nThe time-varying effect on the wireless channel is always a critical problem when it comes to channel estimation. In this section, we will observe the amplitude response of normalized CSI after the time-varying effect occurs. First of all, we take the amplitude response of the normalized CSI datasets collected by ourselves as an example. The datasets have six rounds in total and contain all cases within each round. The collection interval between each round is an hour. From the notes we recorded, there was heavy rain in the outdoor environment during the fourth round. Meanwhile, the door in the experimental scene was blown open by the wind. This round can be viewed as an example of when a timevarying effect occurred, and these problems were solved before collecting the data in the fifth round. In addition, during the sixth round, we artificially changed the angle of antennas on the TX and RX AP to simulate the scenario where individuals inadvertently touch the AP which causes the displacement of the AP and severe time-varying effect of the wireless channel. Fig. 4 shows the change of wireless signals from the first round to the sixth round. To begin with, Figs. 4a, 4b and 4c represent the first three rounds of data with a relatively stable scenario while Fig. 4d reveals a little time-varying effect caused by the changes of environment. Moreover, the channel after the restoration of the environment is displayed in Fig.  4e. Finally, Fig. 4f demonstrates the grave situation where the wireless signals are no longer similar compared to previous rounds. The spatial feature caused by multipath changes a lot because of different antenna angles. However, there are still some patterns that remain the same despite these amplitude responses of normalized CSI being various.\n\n\nIII. PROPOSED BIFOLD TEACHER-STUDENT (BTS) LEARNING FOR PRESENCE DETECTION\n\nUnder the current indoor human presence detection research using CSI data combined with deep learning, most of its learning architectures are based on supervised learning to achieve the purpose of detection. However, when considering a more realistic environment, we notice that labeling CSI data is a crucial problem that involves whether there is enough labor cost to do data labeling. Therefore, we use only a part of the collected labeled data, combined with the unlabeled data collected in the background to conduct semi-supervised learning. By doing so, the model can learn the common characteristics from both labeled and unlabeled data, and more importantly, reduce the labor cost of label data. In addition, through the wireless channel observation in Section II, including the impact of human presence on wireless channels in adjoining room scenario, and the influence of time-varying effect caused by external factors, we are devoted to building not only feasible but also highly accurate deep learning algorithms to exploit these physical phenomena for human presence detection.\n\n\nA. BTS System\n\nOur proposed system is based on two teacher-student networks, and the training process of each teacher-student network is similar to MPL [26] with a different feedback strategy. The following is a brief introduction that how the training process in an iteration executes. First of all, the labeled and unlabeled CSI data are provided to the teacher network, and only unlabeled CSI data is provided to the student network for gradient descent updating. While the teacher network learns from these data, it guides the student network by sending the pseudo label of unlabeled data to the student network. The student network calculates the loss of labeled data which is not for updating the network. After the student network is updated by unlabeled data and its pseudo label, it uses the same batch of labeled data to calculate the loss again. By substituting these two losses from different stages of the student network, we obtain an unconstrained feedback term. To stabilize the training process, we add a rectified linear unit (ReLU) function on this term to filter negative values. Finally, a constrained feedback term is obtained and helps the teacher network to update. The detail of the loss functions will be mentioned in Section III-C. Fig. 5 shows the block diagram of proposed BTS system that involves offline and online phases. In the offline phase, the labeled and unlabeled amplitude of raw CSI data, |ĥ l t,s,k | and |ĥ u t,s,k |, are fed into the data preprocessing function block to generate training data, x l t,s,k and x u t,s,k . Both of these training data are calculated in the Adjoining Room CSI Indicator function block to obtain indicator γ c which will be utilized in teacher and student function blocks with training data. The batch sampler samples the training data in batch which can be denoted as x l,i t,s,k and x u,i t,s,k in every iteration i. In a meanwhile, the ground truth of labeled training data y l c is also sampled as y l,i c , and is used in cross-entropy loss in both of the primal teacher Φ P T,i and dual teacher Φ DT,i function blocks. The MLP head function blocks ψ i are the multilayer perceptron that share weights with each other to project different vectors from teachers, z P T,u,i g and z DT,u,i g , into to representation vectors, in same projective space. The Center function block is a fixed vectord obtained by feeding the unlabeled data in initial weight of primal teacher and MLP head. Furthermore, L P T CT Q and L P T CT V E are the function blocks for loss calculating. The former is in charge of connecting two teachers with different types of DNN for self-supervised learning, and the latter is responsible for drift detection by narrowing the distance between projection vector of the MLP head and the fixed vector from the Center. On the other hand, both of the primal and dual student function blocks, Θ P S,i and Θ DS,i , receive pseudo labels,ŷ P T,u,i c andŷ DT,u,i c , from their own teachers and conduct gradient descent updating. Moreover, the students in different training iterations calculate different feedbacks, f P S,i , f P S,i+1 , f DS,i , and f DS,i+1 for further operation. After the operation, the constrained feedback signals,f P S,i andf DS,i , are sent back to their own teachers. Finally, we store the last iteration of primal teacher Φ P T,i=I for online prediction. In the online phase, the real-time raw CSI data |ĥ real t,s,k | conducts the same data preprocessing method to generate streaming data x real t,s,k and is fed into the trained primal teacher Φ P T,i=I to obtain real-time prediction y pred c , and we also project the latent feature z real g through trained MLP head ψ i=I to calculate the outlier distanced. 1) Data Preprocessing: As shown in Fig. 5, there is a data preprocessing function block that manages the preprocessing pipeline composed of pair-wise normalization and time-domain windowing. The former normalizes raw CSI data based on the subcarriers in each antenna pair to enhance the spatial feature of each antenna pair, and the latter conducts rolling window with fixed window size and keeps the windowed dimension to store varying features over a period of time.\n(a) (b) (c) (d)\n2) Pair-wise Normalization: In our scenario, since all the propagation paths from TX to RX are non-line-of-sight (NLoS), the wireless channel is suffering from severe multipath effect. Therefore, pair-wise normalization provides more information than without normalization because each antenna pair is composed of different multipath caused by human presence and environment. The normalization is the first function in the pipeline, which takes the amplitude response of raw CSI data |ĥ t,s,k | with s th subcarrier and k th antenna pair at t th packet as input. Since our system need both labeled l and unlabeled u data to involve in, we define that Q = {l, u}, q ∈ Q and then the normalization (3) is used ash q t,s,k = norm(ĥ q t,s,k ). Thence, the normalized CSI data based on this equation that includes labeled and unlabeled data gives more spatial information about the human presence and environment in each antenna pair than the raw CSI data. The differences between these two CSI data can refer to Fig.  2.\n\n3) Time-domain Windowing: After conducting pair-wise normalization to enhance spatial information from multipath effect, we utilize time-domain windowing with fixed window size τ to expand extra dimension on CSI data. Therefore, a CSI data at t th packet is viewed as a frame with size τ . The frame stores the variation feature at every subcarrier within a windowing period, behaving in the changing of environment or human presence. The windowing process for the amplitude response of normalized CSI can be formed as where τ denotes the window size, and the labeled and unlabeled training data will be in the form of x l t,s,k and x u t,s,k , respectively. By having these normalized frames, we can leverage different types of training strategies to learn both spatial and time-domain features.\nx q t,s,k = h q t−τ,s,k ,h q t−τ +1,s,k , . . . ,h q t,s,k ,(4)(a) (b) (c) (d) (e) (f)\n\n4) Adjoining Room CSI Indicator:\n\nAccording to the observations in Section II-C and II-D of Section II, we find that each round of CSI dataset has specific common characteristics, and these characteristics barely change in spite of time-varying effect. Discovering common features is essential because a large gap of feature space between labeled data and unlabeled data due to time-varying effect is hardly possible to use SSL method to train. Therefore, we hope to extract these common features independent of time-varying as prior knowledge, which we call the indicator γ c . After obtaining the indicator of each case, we compare them with batch data x q,i t,s,k in each learning iteration i to achieve a simple classifier, we call this result the confidence distribution ξ q,i c . Moreover, we define the disarray term ρ as\nρ q = K k=1 1 S S s=1w q s,k , (5a) w q s,k = − τ t=1 x q t,s,k τ t ′ =1 x q t ′ ,s,k log x q t,s,k τ t ′′ =1 x q t ′′ ,s,k − α τ τ t=1 x q t,s,k − 1 τ τ t ′ =1 x q t ′ ,s,k β ,(5b)\nwhere ρ q represents the disarray of a frame. We calculate the average ofw q s,k over subcarriers to obtain a representative value of each antenna pair k, and then product every pair from k = 1 to k = K to amplify the influence of each pair. In the meanwhile,w q s,k in (5b) is composed of two units, namely the subcarrier-wise entropy over time and the average discrepancy from the data point x q t,s,k to the average itself over time. By measuring the subcarrier-wise entropy over time in a CSI frame, we can analyze the instability of the frame. We can expect that when computing the subcarrier-wise entropy in time, it will fall on a larger range for empty rooms and a smaller range for people in both rooms. This is because when the former situation occurs, the variation of a single subcarrier in time is not large, so the value on each subcarrier will be close to the result of averaging in the time dimension. When we look at these values in terms of probability, it can be regarded as a uniform probability distribution, so that the entropy will reach its maximum value. On the contrary, when the latter situation occurs, it is often accompanied by violent shaking of the CSI, and the value on a single subcarrier will have a huge difference. Therefore, its distribution will be far from the uniform probability distribution, resulting in a smaller entropy. On the other hand, we refer to the concept of variance, and further expand the numerical differences of the four cases by calculating the distance between the data point and the average data points with tunable terms, fine-step α, and fineorder β.\n\nAfter the disarrays of the labeled data ρ l and unlabeled data ρ u are calculated separately, we denote the disarray of the whole labeled dataset as ρ l , ∀l = 1, 2..., M and the disarray of the whole unlabeled dataset as ρ u , ∀u = 1, 2..., N . M and N are the number of all labeled and unlabeled CSI datasets, respectively. We then subtract the average disarray of the unlabeled dataset from the average disarray of the labeled dataset to obtain the disparity term δ, which can be expressed as\nδ = 1 M M l=1 ρ l − 1 N N u=1 ρ u .(6)\nWe can expect this disparity term to be the transformed value of the two datasets, and this value hardly affects the empty room case. Based on these steps, the indicator γ c in each case c can be denoted as\nγ c = 1 M ′ M ′ l=1 ρ l (c = 0) , 1 M−M ′ M−M ′ l=1 ρ l (c = 0) + δ,(7)\nwhere ρ l (c = 0) and M ′ represent the CSI data for empty room case and the total amount of data in this case. ρ l (c = 0) are for other three cases. In the empty room case, since no human is involved and the previous method of calculating the disarray is about using the fact that human presence mess with the wireless signal, the disparity δ will only be calculated for other human presence cases. We substitute the indicator into the training mechanism and use them as reference values for batch data.\n\n\nB. Deep Neural Network of Primal and Dual Teacher-Students\n\nIn this section, we will introduce the architecture of the primal teacher-student network as well as the dual teacherstudent network. We utilize different network architectures in primal and dual networks to learn different features from the CSI data. Fig. 6a presents the structure of the primal teacher network, which will be used as the final classifier for human presence detection. First of all, the primal teacher takes batch labeled data x l,i t,s,k and batch unlabeled data x u,i t,s,k for training with the indicator γ c . In the subcarriers embedding function block, these data are embedded in the subcarrier dimension in order to enable the subsequent neural network to utilize these data. The following processes represent our subcarriers embedding operations. The first is to reshape the original CSI data from the shape of τ × S × K to τ × (SK), which can be denoted as x q,i t,p . The range of p is from 1 to P and P is equal to SK. Moreover, we will assign position information to each time t of x q,i t,p , which can be acquired as\n\n\n1) Primal Teacher-Student:\nx q,i t,p =        x q,i t,p + sin t η p−2 P , if p is even, x q,i t,p + cos t η p−1 P , if p is odd,(8)\nwhere η is a tunable parameter. After completing the position information, we feed this data into the neural network based on the Transformer Encoder. We expect to extract the correlation among the time sequences through the Transformer Encoder because we have observed the variation in time of all the subcarriers in a frame. Afterward, we take the last feature vector z P T,q,i g for feature mapping since we pay more attention to the latest time spot than creating an additional token to consider all time sequences for classification. Furthermore, it takes less computation resources and time while training. Besides the neural network, there is a function block called confidence distribution, which has been mentioned in Section III-A4. The confidence distribution can be determined as\nξ q,i c = − ρ q,i − γ c 2 ,(9)\nwhere ξ q,i c represents the confidence distribution that measures batch data x q,i t,s,k of iteration i, and γ c is the indicator of case c. The confidence distribution measures the Squared Euclidean Distance between the disarray of batch data in every iteration and indicator of each case. If any case c of which ρ q,i t is closer to its indicator γ c , that means the data is more likely to be that case and given higher confidence. However, if it is far away from its indicator, the data will be given lower confidence. We then rescale ξ q,i c to [1, −1] over c which becomes the final confidence distribution. Finally, we perform the calculation of the loss functions, L UICE and L T CE . In addition to primal teacher, the primal student network which is shown in Fig. 6b takes unlabeled data and pseudo labels provided by the primal teacher for training. The labeled data is only used as the evaluation of the two states of the student, namely Θ P S,i and Θ P S,i+1 , and does not participate in the gradient descent training of the network. The computation of this network is roughly the same as that of the teacher network, but primal student network only has L UICE for training. All loss functions will be detailed in the last section.\n\n2) Dual Teacher-Student: Fig. 7 illustrates the architecture of the dual teacher-student network, which is only used to assist the training of the primal teacher-student network. The dual teacher network in Fig. 7a contains a confidence distribution, a small-scale feature extractor, and a classifier that is different from the primal teacher. The network also uses batch labeled data and batch unlabeled data with indicator for training like the primal teacher. We deploy ResNet as a feature extractor to learn small-scale temporal and subcarrier information in space and treat antenna pairs k as the channels of ResNet input. This not only captures the regional features affected by multipath in each frame but also learns the importance of each antenna pair. Even though adjacent channels generally experience the same channel fading within a short period of time, these adjacent channels have more diverse behavior under the influence of human presence. Therefore, we take advantage of the small kernel to learn each frame. After extracting the spatial features, z DT,u,i g and z DT,l,i g through ResNet, we perform feature mapping to the number of cases as model predictions,ŷ DT,u,i andŷ DT,l,i , via the classifier. Finally, the confidence distribution variables of ξ u,i c and ξ l,i c obtained by (9) are used with the model predictions and ground truth for batch labeled data y l,i c to calculate the loss functions of L UICE and L T CE . On the other hand, the learning process of the dual student network is roughly the same as that of the dual teacher network, with the same differences as in the primal teacher-student case. In the training process, dual student only uses unlabeled data with the pseudo labelŷ DT,u,i from dual teacher. Labeled data is used as an evaluation of the two states of the dual student to provide a feedback signal f DS,i to dual teacher. The expression of this feedback term will be proposed in the next section.\n\n\nC. Training Algorithm\n\nIn our proposed training algorithm, there are five loss functions to be optimized for either primal teacher-student or dual teacher-student models, including L a T CE , L a UICE , L b UICE , L P T CT Q , and L P T CT V E where A = {P T, DT }, a ∈ A and B = {P S, DS}, b ∈ B. Both of primal and dual teachers are affected by the first two loss functions, and both of primal and dual students are only influenced by the third one. Furthermore, L P T CT Q requires both primal and dual teachers but only takes primal teacher as representative. The last loss function is only for the primal teacher. The total loss of primal teacher and dual teacher can be expressed as\nL P T = λ P T 1 × L P T T CE + λ P T 2 × L P T UICE + λ P T 3 × L P T CT Q + λ P T 4 × L P T CT V E , (10a) L DT = λ DT 1 × L DT T CE + λ DT 2 × L DT UICE + λ DT 3 × L P T CT Q ,(10b)\nwhere all the λ terms are tunable parameters. Moreover, the total loss of primal student and dual student can be denoted as L P S = L P S UICE , and L DS = L DS UICE , respectively. We will introduce the loss functions one by one in the following subsections.\n\n\n1) Transformative Cross Entropy Loss: The Transformative\n\nCross Entropy Loss L a T CE is the loss function that involves a labeled dataset, the ground truth of the labeled dataset, and confidence distribution which is formulated as follows.\nL a T CE = − C c=0 Sof tmax y l,i c + ξ l,i c log Φ a,i x l,i t,s,k ,(11)\nwhere y l,i c is the ground truth of batch labeled data x l,i t,s,k with case c in i th iteration, ξ l,i c is the confidence distribution of batch labeled data in i th iteration, and Φ a,i (x l,i t,s,k ) predicts the batch labeled data in iteration i from teacher network a. We add the ground truth of the batch labeled dataset to the confidence distribution of itself and express it as a probability distribution using the softmax function. If the label distributions of the original labeled dataset and the time-varying unlabeled dataset are similar, the label with the highest probability will increase. However, if the distribution is extremely inconsistent due to severe time-varying effect, the lowest value of the confidence distribution, namely −1, will directly eliminate the one-hot encoding of ground truth, namely 1. The reason why we want to conduct addition operation is as follows. As described earlier, we use the labeled dataset through the teacher networks to guide the student networks to learn the unlabeled dataset. At the same time, the knowledge of the unlabeled dataset is obtained from the feedback signals of student networks. Under such system conditions, the similarity of the distribution of the labeled dataset and the unlabeled dataset is important for our proposed system. We must find a way to narrow the distributions of the labeled dataset and the unlabeled dataset to stably learn the unlabeled dataset. The confidence distribution we designed leverages prior knowledge of the CSI data to reconcile the disparity between the labeled dataset and the unlabeled dataset.\n\n\n2) Unlabeled Indication Cross Entropy Loss:\n\nThere are two kinds of Unlabeled Indication Cross Entropy Loss that belong to either teacher or student networks. The first one L a UICE is for two teacher networks that contains unlabeled dataset, pseudo label of unlabeled dataset, confidence distribution, and feedbackf b,i . The other one L b UICE is for two student networks without feedback. Inspired by MPL, we first denote L a UICE andf b,i as shown at top of next page. In (12),\nA = {P T, DT } with a ∈ A, b = {P S, DS} with b ∈ B,\nand y a,u,i c is the pseudo label from teacher network. The a and b in (12a) are either a = P T, b = P S or a = DT, b = DS. Φ a,i (x u,i t,s,k ) and Θ b,i (x l,i t,s,k ) are the pseudo labels of batch unlabeled data through teacher networks and the prediction distributions of labeled data through student networks, respectively. The concept of addition operation between pseudo label and confidence distribution of unlabeled dataset is similar to L a T CE , which hopes to guide pseudo label to better distribution by referring to confidence distribution. In the equation above, we multiply the result of cross-entropy calculation by the feedback to pass the training status of the student to the teacher for reference when executing gradient descent. We evaluate batch labeled data in the student network in iteration i and also evaluate the same batch data in iteration i + 1. After that, we subtract the results to obtain the learning transition of the student network. It is worth noting that we added a ReLU function to this variation to control negative values. A\nL a UICE =f b,i × − C c=0 Sof tmax ŷ a,u,i c + ξ u,i c log Φ a,i x u,i t,s,k (12a) f b,i = ReLU C c=0 y l,i c log Θ b,i+1 x l,i t,s,k − C c=0 y l,i c log Θ b,i x l,i t,s,k(12b)\nnegative change means that the loss of iteration i + 1 is lower than the loss of iteration i, so the teacher network does not need to be trained on unlabeled data. Moreover, if the feedback is negative, the teacher network will train in the opposite direction when calculating the gradient. However, this is not the result we wanted to foresee. Therefore, this constrained feedback helps to stabilize the training of the teacher-student network. On the other hand, the loss function L b UICE for student networks can be formulated as\nL b UICE = − C c=0 Sof tmax ŷ a,u,i c + ξ u,i c log Θ b,i x u,i t,s,k .(13)\nSince both the student networks are trained with the unlabeled dataset and their pseudo labels, we only calculate their crossentropy. Moreover, the pseudo label is added with confidence distribution as we have done in (12a).\n\n\n3) Cross-Teacher Quadratic Loss:\n\nInspired by contrastive learning [31] and BYOL [32], we intend to design a loss function for self-supervised learning with the same input data and pass it through the different neural networks to generate different latents of the same data. Hence, the Cross-Teacher Quadratic Loss L P T CT Q is designed for connecting primal and dual teachers. The loss function can be expressed as\nL P T CT Q = ψ i z P T,u,i g − ψ i z DT,u,i g 2 ,(14)\nwhere ψ i is the MLP head. z P T,u,i g and z DT,u,i g are the latent features of primal teacher and dual teacher, respectively. Since we regard the primal teacher as the final human presence detection classifier and involve two teacher networks, this loss function will not be represented by the superscript a, but by P T . We use the Transformer Encoder in primal teacher to discover temporal correlations, and the ResNet in dual teacher to extract spatial features to generate two different latents of the same source data. Subsequently, by calculating the mean square error between two representation vectors, the communication between two networks is performed and an enhanced representation vector is generated.\n\n\n4) CSI Time-Varying Euclidean Loss: The final loss function is CSI Time-Varying Euclidean Loss L P T\n\nCT V E which is used as an evaluation criterion for whether the CSI data drift occurs. The loss function can be denoted as\nL P T CT V E = ψ i z P T,u,i g −d 2 ,(15a)d = 1 N N u=1 ψ i=0 z P T,u g ,(15b)\nwhered is the average center of the unlabeled dataset via initial state of primal teacher projection, and N is the total number of data in unlabeled dataset. We constrain all unlabeled data to a certain range by minimizing the distance from the representation vector to the center point. With the constraints of this optimization, we can evaluate the real-time streaming data, which is called the outlier distanced. The outlier distance of the real-time streaming data can be acquired aŝ\nd = ψ i=I z real g −d 2 ,(16)\nwhere z real g represents the latent feature of real-time streaming CSI data, and ψ i=I is the MLP head in last iteration I. When our model is launched from the actual scene, we need to pay attention to the time-varying CSI data caused by environmental changes. Once a serious time-varying effect occurs, the data drift results in model drift, which will lead to low performance. Therefore, after our model is online, the outlier distance of real-time streaming data will be compared with the outlier distance of training data. When the distance between them is enormous, it will be judged to be data drift. Finally, new data will be collected and the network will be retrained.\n\n\nIV. PERFORMANCE EVALUATION\n\n\nA. Experimental Settings\n\nOur experiments are implemented in the adjoining room scene, as shown in Fig. 8a. The scene consists of two adjoining restrooms, namely room A in 8b and room B in 8c, and each room has a size of 3.2 m × 6.4 m. There is a 1.5 m × 1.5 m storage and a wall between the two restrooms. Furthermore, we prepared two TL-WDR4300 wireless routers produced by TP-Link, whose Wi-Fi operates under 802.11n. We set the routers to AP mode which in room A is TX, and the other in room B is RX. These APs are built to transmit at a center frequency of 2.447 GHz with 20 MHz carrier bandwidth. Moreover, the RX is connected to our edge computer with a center frequency of 5.3 GHz. The edge computer will receive 10 estimated CSI packets per second from RX. Subsequently, the RX transmits the CSI to the edge computer through channels in the center frequency of 5.3 GHz to reduce interference. Finally, the collected data will be used for human presence detection through our system deployed on the edge computer. As mentioned earlier, we collected data for 6 rounds, and each round has an interval of one hour. In addition to this, we also recorded the environmental conditions at the time the data was collected. The system parameters are shown in Table I and the detail of each round is displayed in Table II.  \n\n\nB. Selection of Different Hyperparameters\n\nIn our system, there are many adjustable parameters to stabilize training and obtain good performance. The choice of fine-step α and fine-order β in (5b) is important as well as the choice of the λ of total loss in (10a) and (10b) in the training process. Notice that we set the same value to the loss functions of primal teacher and dual teacher.\n\n\n1) Evaluation of Different Fine-\n\nStep α and Fine-Order β in Disarray Function: In (5b), we designed two adjustable hyperparameters, including fine-step α and fine-order β, to assist subcarrier-wise entropy in increasing the disparity between each case by leveraging the statistical method. The choice of these two hyperparameters will lead to different model performances. When fine-step α is greater than 1, the latter term will dominate the disarray value and result in lower performance and higher loss value.\n\nSince the adjoining room CSI indicator and confidence distribution that we designed can be performed as a nontraining based weak classifier, we will use this classifier to evaluate and choose fine-step and fine-order as shown in Fig.  9. First, we use round 1 as the labeled dataset and round 6 as the unlabeled dataset in the indicator function. Thereafter, the unlabeled dataset is sampled in a size of 256 in our confidence distribution, which is used to simulate the batches of data during training. We can observe from Fig. 9a that when there is no latter term at all, that is α = 0, simply using subcarrierwise entropy can only perform about 65% of the severe timevarying in round 6. And with the change of β, different α will bring a lot of differences. Among them, in the case of α = 1 and β = 1, we get the best accuracy, and also in Fig. 9b, the loss of this case is also the lowest. Therefore, we end up setting both parameters to 1. It is worth noting that as β gets closer to 3, all combinations return to the range with no latter term. This is because when β is greater than 1, the value in the latter term will close to 0.\n\nTo visualize (5b), we also use the same set of labeled and unlabeled datasets above to demonstrate. As illustrated in Fig. 10, in the case of the first 2000 labeled data, which belong empty room case, the disarray value will reach the highest level as we mentioned in Section III-A4. In addition, in the case of the last 2000 labeled data, when both rooms are occupied, the average will have the lowest disarray value. In the case of 2000-6000 labeled data, which are the cases of someone in room A or someone in room B, there will be a slight gap of average disarray within these two cases. The result is similar for unlabeled data, but with an offset in certain cases. Finally, the indicators calculated by (7) are marked as dotted lines. These indicators represent the characteristics of each case well and are useful as prior knowledge.\n\n\n2) Evaluation of Different Weights in Total Loss:\n\nIn the total loss, we combine every loss function of the primary teacher and the dual teacher as (10a) and (10b). Moreover, the weight of a certain loss function of primary and dual teachers is the same. We balance model training by adjusting the weights of every loss term. We use round 1 as the labeled dataset, round 2 as the unlabeled dataset, and use round 2 as the evaluation. In Fig. 11a, we select λ a 1 and λ a 2 by grid search. The same way is also used to select λ a 3 and λ P T 4 , and the results are shown in Fig. 11b. It is worth mentioning that when the selection of λ a 3 is greater than or equal to 1, the results will be similar, no matter what the value of λ P T 4 is selected. This is because λ P T 4 from L P T CT V E is used as outlier detection, a loss function that is unrelated to performance enhancement. Finally, the blocks that show       rad font are the highest performance in the two grids. We then choose λ a 1 = 0.1, λ a 2 = 2, λ a 3 = 1 and λ P T 4 = 0.5 as the hyperparameters of loss functions in primary and dual teachers. In Table III, we list the final selection of each hyperparameter.\n\n\nC. Efficacy of Loss Functions\n\nIn our system, we design various loss functions to train bifold teacher-student networks, and every loss term holds its own functionality. In the following subsection, the existence and performance of L P T CT Q are discussed, as well as whether L a T CE has the difference of adding confidence distribution. Finally, we discuss the actual effect of L P T CT V E in our datasets and what the outlier score it produces is.\n\n1) Evaluation of Cross-Teacher Quadratic Loss L P T CT Q : In this subsection, we will discuss the cases with and without L P T CT Q , and then the case without L P T CT Q is further divided into two cases based on different networks. Fig. 12 shows the model performance in three cases. We train on these cases with round 1 as labeled data and round 2 as unlabeled data, and model evaluation from round 2 to round 5. First, the   Fig. 12: Accuracy comparison between different architectures and numbers of teacher-student network.\n\nblue slashed bars are the ResNet-based single teacher-student network, and the orange dotted bars are the Transformerbased single teacher-student network. Finally, the bars with olive green crossed lines are our proposed BTS system that leverages L P T CT Q to combine both ResNet and Transformer. In the previous work, we demonstrated the success of a single teacher-student network on our old dataset. As shown in the Transformer bar in Fig. 12, it has a performance of 96.35%, 96.82%, and 95.33% in round 2, round 3, and round 5 respectively, but only 76.16% in round 4. We have observed in Section II that some subcarriers have abnormal performance in round 4 due to changes in the environment. Besides, subcarriers are significant information in Transformer. When subcarriers have different patterns, it means that the results of embedding will be different. As a result, the performance of Transformer will be reduced. Therefore, we hope to focus on training spatial information to help improve the performance of the model. To prove our idea, we conduct ResNet-based teacher-student training individually. It can be noticed from the bar chart that although the performance of ResNet is not as good as Transformer in round 2, round 3, and round 5, it surpasses Transformer by 5% in round 4. Therefore, the features learned on ResNet and Transformer are not the same. As in the case of round 4, ResNet prefers to focus on common features learned from small regions, rather than directly referencing the entire subcarriers like Transformer. Finally, our proposed BTS system combines the different latents trained by these two networks at the same time. The combination based on L P T CT Q successfully achieves the highest performance in each testing rounds. In addition, in round 4, the evaluation performed 12% higher than ResNet and nearly 17% higher than Transformer, which shows the importance of co-training.\n\n2) Evaluation of Unlabeled Indication Cross Entropy Loss, L a UICE and L b UICE , and Transformative Cross Entropy Loss L a T CE : In Section III-C, we introduce the functions of L a UICE , L b UICE and L a T CE in detail, and gives the corresponding equations. Without a doubt, these loss functions are the foundation of teacher-student in SSL. By learning the labeled and unlabeled datasets, our goal is to build a competitive model to reach or even beyond supervised-based model. Our   proposed BTS system is an SSL-based system that is designed for reducing the labor cost of labeling collected CSI data, and meanwhile dealing with the time-varying effect caused by environmental changes. However, one often doubts whether the unlabeled dataset is truly learned in this system. We performed three evaluations in this experiment. First, we treat round 1 as a labeled dataset for supervised-based training. This evaluation uses a Transformer-based network for training, considered a minimum standard, that is shown as blue slashed bars in Fig. 13. In addition, we use both round 1 and round 2 as the labeled datasets for supervised-based training. This evaluation uses the same network for training and is considered the final goal of our system, which is shown as orange dotted bars in the bar chart. Finally, we perform the training of our proposed BTS system, which treats round 1 as the labeled dataset and round 2 as the unlabeled dataset. Our system is represented in the bar chart by the bars with olive green crossed lines.\n\nFirst of all, since the training process only takes round 1 as the training data in the first evaluation scene, there is no way to effectively detect the room where human exist when it evaluates the time-varying data. This evaluation only has the performance of 48.82% on round 2, and reaches an accuracy of 39.96% on the relatively severe round 4 scene. In contrast, in the second evaluation scene, because it utilizes all the data and its ground truth for training, it has perfect performance in round 2, and is also significantly better than the first evaluation in other rounds. Finally, although our proposed BTS system only takes the data of round 2 without taking the ground truth, the performance is remarkably comparable to the second evaluation scene in all rounds. More surprisingly, it has better performance in round 3 and round 5. From our point of view, the second evaluation scene uses hard labels for all training, this results in a very decisive judgment when calculating losses. However, in our BTS system, some loss functions are trained on soft labels, which carry rich hidden information when calculating losses. Therefore, we have shown the opportunity to use the SSL method to train better performance than the SL method. In these loss functions, we can find that each loss term has the participation of confidence distribution. Therefore, we will explore how these loss functions relate to confidence distribution. The confidence distribution is a non-training based weak classifier that helps the network refer to prior knowledge while training. Before the drift detection, we evaluate the overall accuracy of these loss functions affected by confidence distribution. There are five cases we will discuss, the first is the case where all loss functions have no confidence distribution which is the blue slashed bars in Fig. 14. The second with orange dotted bars and the third with the bars of the green horizontal lines are when L a UICE and L b UICE respectively have confidence distribution. The fourth with the bars of red vertical lines is when L a T CE has a confidence distribution, and the last with the bars of olive green crossed lines is the proposed BTS system where all loss functions have confidence distribution.\n\nAs shown in Fig. 14, we can observe that in the case of round 2, round 3 and round 5, the participation of confidence distribution does not have much impact on the performance of the model. In the case of a slight change in the environment, that is round 4, the performance has opened up some gaps, since the confidence distribution provides basic knowledge of the cases that are irrelevant to environmental change. Despite that, our proposed system BTS, which all loss functions combine with confidence distribution, remains the highest performance overall. It is worth noticing that in the case of BTS with confidence distribution (only L b UICE ) gets the lowest accuracy in every round. This is mainly because when the student network is the only one that knows the prior knowledge, there will be a bias toward itself. These deviations will confuse the teacher network by feeding back the signal. The teacher network then has no faith to provide appropriate pseudo-labels for the student network to learn which results in lower performance.\n\n3) Evaluation of CSI Time-Varying Euclidean Loss L P T CT V E : In this subsection, we show that by operating L P T CT V E in training stage, we can restrict similar data in a certain scope to distinguish drifted data. In addition, we also present the highest and lowest distance to the center of every data point in each round, which provides the information of what range of threshold should be set in drift detection. Moreover, we evaluate the retraining of drifted data after drift detection, which refers to Subsection IV-C2.\n\nFirst, we show the distribution of the dataset before training. In Fig. 15, the blue, orange, and red dots are the representation vectors of respectively round 2, 4, and 6, after dimension reduction under the initial weight. We can observe that the distributions of the second-round dataset and fourth-round dataset are almost the same in Fig. 15a, and the distributions of the second-round dataset and sixth-round dataset are somewhat different in Fig. 15b. These results also lead to very different model performances. However, we have no way of knowing whether our data is severely drifted in advance from such distributions. Therefore, in Fig. 15, we show the results after training by L P T CT V E . In this training, round 1 is still used as labeled dataset and round 2 is used as unlabeled dataset. It can be observed from Fig. 15c that by limiting the distribution range of round 2, round 4 also has a comparable distribution to it because most of the features in round 4 are similar to it. Likewise, because round 4 suffers from some environmental changes, some distributions do differ from round 2. In Fig.  15d, after the dimension reduction of the representation vector obtained by our network, the distribution of round 6 is greatly different from that of round 2 due to the severe time-varying effect.\n\nSubsequently, we operate the algorithm in (16) to calculate the outlier distance of every data point in each round. Table  IV shows the highest and lowest distance to the representation vector corresponding to round 2 on the initial weight. We can observe from the case without L P T CT V E that the data actually  varies during the time period from the distance of 7.37 to 59.42 from round 2 to round 5. Moreover, the lowest distance of round 6 overlaps the highest distance of round 5 and is also very close to the highest distance of round 4 which makes difficulties in choosing the threshold value. On the other hand, our proposed BTS system that contains L P T CT V E can easily determine the threshold value for drift detection. We minimize the distance of data points in round 2 to the center and consequently reduce the highest distance of the rounds that is similar to round 2. In addition, we can observe that the lowest distance of round 6 raises from 38.06 to 82.52, which results in larger interval between drifted data and normal data.\n\nAfter the drift detection, we explore the case where the timevarying effect is severe and the case after retraining in Fig.  16. Under the intense time-varying effect, severe data drift is often experienced, resulting in inaccurate model performance. As can be seen from the left side of the bar chart, when we use round 1 as labeled data and round 2 as unlabeled data for training, we lose the ability to judge round 6 that has drifted. On the other side of the bar chart, the retraining process involves round 1 as labeled data and round 6 as unlabeled data. It is obvious from the chart that only when these three loss functions have a confidence distribution, we can reach the  highest accuracy of 97.64%. Interestingly, in the case of BTS with confidence distribution (only L a UICE ) reaches 71.29%. This is because the teacher network directly increases the prior knowledge of the teacher network for unlabeled data when training unlabeled data through L a UICE .\n\n\nD. Overall Performance Comparison with Other Methods\n\nIn Section I, we introduce numerous algorithms to overcome their tasks, which are also related to CSI and classification. Therefore, we will use our data and scenario to compare the performance of these algorithms with our proposed BTS system. We will divide the comparison into two cases. The first is to compare with existing supervised-based algorithms, which train both round 1 and round 2 as labeled data, and evaluate with round 3. The second is the comparison with semi-supervised based algorithms. We will compare the scene of round 1 as the labeled dataset and round 2 as the unlabeled dataset, and the scene of round 1 as the labeled dataset and round 6 as the unlabeled dataset.\n\nWe first compare two different supervised-based algorithms, namely Parallel CNN and AE-LRCN. As shown in Fig. 17, Parallel CNN is lower than the other two overall, and has the lowest accuracy in room B case. This is because Parallel CNN utilizes both the amplitude and phase of CSI and the spatial information in room B is very similar to both rooms case, which eventually makes this CNN-based model fails to predict the room B case. Besides, AE-LRCN achieves a performance of 100% in the empty case, while it is slightly lower than BTS in the other three cases. The case of room B is easily confused and misjudged to other cases from Parallel CNN, AE-LRCN and BTS. Eventually, Our BTS system sequentially obtains 100%, 99.48%, 95.53%, and 99.02% accuracy in each case.\n\nThe system utilizes the unlabeled data of round 2 unlike others that use it as labeled data, which achieves the highest overall performance. Following, we compare our BTS system with two semisupervised based algorithms. One is CsiGAN, and the other is MPL which is the original algorithm that inspired us to design our system. First, we perform the training with round 1 as the labeled dataset and round 2 as the unlabeled dataset and evaluate with round 3. As presented in Fig. 18a, each algorithm reaches the highest accuracy in the empty case. This is because the empty case is the easiest case in our scenario. Moreover, CsiGAN and BTS can also have a performance greater than 95% in the case of room B, and the former achieves the highest performance. However, CsiGAN failed to distinguish the case of room A and both rooms effectively. CsiGAN overfits the feature of room B, which leads to bed performance in the cases of room A and both rooms. Finally, MPL is on par with our proposed BTS system in the case of room B and both rooms but fails in room A case. This also proves that the improvement and design of the original architecture help us obtain a better and more stable detection model.\n\nThen we also train with round 1 as the labeled dataset and round 6 as the unlabeled dataset and use round 6 as the evaluation. Fig. 18b shows the result of performance between each algorithm. Since MPL is not designed for the problem of time-varying effects between the labeled dataset and the unlabeled dataset, it can only distinguish the differences between empty case and both rooms case correctly. Although MPL does classify the case of room A and room B, the predictions are totally opposite. In the scene of CsiGAN, it can retain performance because of the design between the labeled dataset and the unlabeled dataset. However, the case of room B performs the lowest accuracy like our system. Finally, because we have designed some functions to deal with timevarying effects, our BTS system performs the highest overall accuracy.\n\nWe summarize the evaluation results over the rounds into Table V. In the supervised-based block, Teacher (round 1) method means that we use teacher model to conduct SL with round 1 labeled dataset, and that with '(round 1 + 2)' means that round 1 and round 2 are used as labeled datasets. Our proposed BTS system outrides other methods in round 3 and round 5, and is closer enough to other rounds. The biggest difference compares to others is no more than 5%. Furthermore, in the semi-supervised based block, Single ResNet/Transformer TS mean that we utilize one teacherstudent network based on ResNet and Transformer, respectively. Eventually, Our proposed BTS system outstrips all other methods in every round.\n\n\nV. CONCLUSION\n\nThis paper presented a solution to resolve the difficulties encountered in indoor adjoining room human presence detection by developing a semi-supervised CSI-based bifold teacherstudent presence detection system (BTS). First of all, we developed a bifold teacher-student network that learns the data from different perspectives. Secondly, we applied Transformer Encoder to extract the temporal characteristics and meanwhile used ResNet to enhance the spatial features, and operated selfsupervised learning. Thirdly, we designed loss functions to handle time-varying effect and data drift by developing the algorithms to calculate the confidence distribution and outlier distance. Therefore, we can decrease the excessive labeling outlay and resolve drifted datasets crisis. Finally, we compared the accuracy in different conditions and also between other existing algorithms. We can summarize that our proposed BTS system successfully managed the time-varying effect and drift detection while obtaining higher presence detection accuracy than any other algorithms.\n\nFig. 1 :\n1System architecture for human presence detection.\n\nFig. 2 :\n2Amplitude response of raw CSI and normalized CSI. (a) Upper left is the amplitude response of raw CSI when antenna pair k = 0, upper right is for k = 1, lower left is for k = 2, and lower right is for k = 3. (b) Amplitude response of normalized CSI, and the order of k is the same as (a).\n\nFig. 3 :\n3Four cases of human presence detection. (a) A case of empty room with no human presence. (b) A case of human presence in room A. (c) A case of human presence in room B. (d) A case of human presence in both rooms. The k of these four cases follow the same order as Fig. 2..\n\nFig. 4 :\n4Amplitude response of normalized CSI in six rounds. (a) Round 1. (b) Round 2. (c) Round 3. (d) Round 4. (e) Round 5. (f) Round 6. The k of these six rounds follow the same order as Fig. 2.\n\nFig. 5 :\n5Schematic diagram for proposed BTS scheme.\n\nFig. 6 :Fig. 7 :\n67Internal functions of primal teacher and student. (a) Primal teacher network. (b) Primal student network. Internal functions of dual teacher and student. (a) Dual teacher network. (b) Dual student network.\n\nFig. 8 :\n8Schematic diagram of experimental scenarios for adjoining room presence detection. (a) Experimental scenario and settings of adjoining room. (b) Experimental scenario in room A. (c) Experimental scenario in room B.\n\nFig. 9 :Fig. 10 :\n910Visualizations of accuracy and loss of different parameters. (a) Accuracy with different values of fine-step α and fine-order β. (b) Loss with different values of fine-step α and fine-order β. Disarray of labeled and unlabeled datasets.\n\nFig. 11 :\n11Accuracy with different hyperparameters in total loss. (a) Accuracy with different value of λ a 1 and λ a 2 . (b) Accuracy with different value of λ a 3 and λ P T 4 .\n\nFig. 14 :\n14Accuracy of less severe time-varying rounds.\n\nFig. 15 :\n15Distributions of different rounds before and after drift detection training. (a) Distributions of round 2 and round 4 before training. (b) Distributions of round 2 and round 6 before training. (c) Distributions of round 2 and round 4 after training. (d) Distributions of round 2 and round 6 after training.\n\nFig. 17 :\n17Accuracy comparison between different supervisedbased algorithms.\n\nFig. 18 :\n18Accuracy comparison between different semisupervised based algorithms with different datasets. (a) Comparison with round 1 as labeled dataset and round 2 as unlabeled dataset. (b) Comparison with round 1 as labeled dataset and round 6 as unlabeled dataset.\n\nTABLE I :\nIParameters of proposed BTS systemParameters of system \nValue \nNumber of rooms \n2 \nNumber of cases \n4 \nNumber of APs per room \n1 \nNumber of antennas in TX \n2 \nNumber of antennas in RX \n2 \nNumber of antenna pairs \n4 \nNumber of subcarriers per antenna pair \n56 \nCarrier frequency between TX and RX \n2.447 GHz \nCarrier frequency between RX and edge 5.3 GHz \nChannel bandwidth \n20 MHz \nCSI collection rate \n10 packets/sec \nNumber of collection rounds \n6 \n\n\n\nTABLE II :\nIIThe detail of each collection roundRounds Collection time Data volume Antenna angle Environments \n1 \n12:00-12:20 \n2000/case \n90 o \nSunny \n2 \n13:20-13:40 \n2000/case \n90 o \nSunny with layout same as 1 \n3 \n14:40-15:00 \n2000/case \n90 o \nSunny with layout same as 1 \n4 \n16:00-16:20 \n2000/case \n90 o \nRainy with layout changed \n5 \n17:20-17:40 \n2000/case \n90 o \nSunny with layout same as 4 \n\n6 \n18:40-19:00 \n2000/case \n45 o \nSunny with layout same as 4 \nbut different antenna orientation \n\n\n\nTABLE III :\nIIIHyperparameters settingHyperparameters \nNotation Value \nWindow size \nτ \n50 \nParameter in position information \nη \n10000 \nFine-step \nα \n1 \nFine-order \nβ \n1 \nWeight of L a \n\nT CE \n\n\n\nTABLE IV :\nIVDistances between data points of each roundWithout L P T \n\nCT V E \n\nRound 2 \n3 \n4 \n5 \n6 \nHighest Dist. \n7.37 \n11.24 \n31.53 \n59.42 \n648.67 \nLowest Dist. \n0.51 \n0.50 \n0.51 \n0.51 \n38.06 \nWith L P T \n\nCT V E \n\nRound 2 \n3 \n4 \n5 \n6 \nHighest Dist. \n4.58 \n22.22 \n9.72 \n12.18 \n1019.34 \nLowest Dist. \n0.58 \n0.59 \n0.58 \n0.57 \n82.52 \n\n\n\n\nFig. 16: Accuracy of severe time-varying round.Round 6 \nRetraining Round 6 \nTesting and Retraining Rounds \n\n0 \n\n20 \n\n40 \n\n60 \n\n80 \n\n100 \n\nAccuracy (%) \n\n25 \n25 \n25 \n\n71.29 \n\n25 \n\n30.46 \n25 \n\n33.18 \n\n25 \n\n97.64 \n\nBTS w/o CD \nBTS w/ CD(only L a \nUICE ) \nBTS w/ CD(only L b \nUICE ) \nBTS w/ CD(only L a \nTCE ) \nBTS \n\nEmpty \n\nRoom A \nRoom B \nBoth Rooms \nCases \n\n0 \n\n20 \n\n40 \n\n60 \n\n80 \n\n100 \n\nAccuracy (%) \n\n100 \n95.35 \n\n69.83 \n\n96.58 \n100 \n97.43 \n\n87.33 \n\n93.58 \n\n100 \n99.48 \n95.53 \n99.02 \n\nParallel CNN \nAE-LRCN \nBTS \n\n\n\nTABLE V :\nVPerformance of benchmark comparisons Results are after data drift detection and all methods are retrained with round 6.Supervised learning \nRound 2 Round 3 Round 4 Round 5 Round 6 1 \nTeacher (round 1) \n48.82 \n47.96 \n39.96 \n48.80 \nN/A \nTeacher (round 1 + 2) \n100 \n95.75 \n97.17 \n96.78 \nN/A \nParallel CNN [12] \n99.60 \n90.44 \n73.20 \n87.07 \n99.80 \nAE-LRCN [16] \n100 \n93.87 \n96.76 \n98.07 \n100 \nBTS \n98.64 \n98.51 \n93 \n98.39 \n97.64 \nSemi-supervised learning Round 2 Round 3 Round 4 Round 5 Round 6 1 \nSingle ResNet TS \n91.42 \n92.61 \n81.08 \n84.51 \n31.46 \nSingle Transformer TS \n96.35 \n96.82 \n76.16 \n95.33 \n35.58 \nMPL [26] \n89.73 \n82.48 \n32.79 \n85.60 \n48.17 \nCsiGAN [22] \n85.52 \n86.52 \n79.08 \n84.23 \n83.74 \nBTS \n98.64 \n98.51 \n93 \n98.39 \n97.64 \n\n1 \n\nA Smartphone Camera-based Indoor Positioning Algorithm of Crowded Scenarios with the Assistance of Deep CNN. J Jiao, F Li, Z Deng, W Ma, Sensors. 174J. Jiao, F. Li, Z. Deng, and W. Ma, \"A Smartphone Camera-based Indoor Positioning Algorithm of Crowded Scenarios with the Assistance of Deep CNN,\" Sensors, vol. 17, no. 4, 2017.\n\nDeepMatch2: A Comprehensive Deep Learning-based Approach for In-Vehicle Presence Detection. M Oplenskedal, P Herrmann, A Taherkordi, Information Systems. 108M. Oplenskedal, P. Herrmann, and A. Taherkordi, \"DeepMatch2: A Comprehensive Deep Learning-based Approach for In-Vehicle Presence Detection,\" Information Systems, vol. 108, 2022.\n\nLocation-Enhanced Activity Recognition in Indoor Environments Using Off the Shelf Smart Watch Technology and BLE Beacons. A Filippoupolitis, W Oliff, B Takand, G Loukas, Sensors. 176A. Filippoupolitis, W. Oliff, B. Takand, and G. Loukas, \"Location- Enhanced Activity Recognition in Indoor Environments Using Off the Shelf Smart Watch Technology and BLE Beacons,\" Sensors, vol. 17, no. 6, 2017.\n\nRespWatch: Robust Measurement of Respiratory Rate on Smartwatches with Photoplethysmography. R Dai, C Lu, M Avidan, T Kannampallil, Proceedings of International Conference on Internet-of-Things Design and Implementation. International Conference on Internet-of-Things Design and ImplementationR. Dai, C. Lu, M. Avidan, and T. Kannampallil, \"RespWatch: Robust Measurement of Respiratory Rate on Smartwatches with Photoplethys- mography,\" in Proceedings of International Conference on Internet-of- Things Design and Implementation, 2021, pp. 208-220.\n\nIntegrated IMU with Faster R-CNN Aided Visual Measurements from IP Cameras for Indoor Positioning. L Zhang, T Zhou, B Lian, Sensors. 189L. Zhang, T. Zhou, and B. Lian, \"Integrated IMU with Faster R-CNN Aided Visual Measurements from IP Cameras for Indoor Positioning,\" Sensors, vol. 18, no. 9, 2018.\n\nWiseNET: An Indoor Multi-Camera Multi-Space Dataset with Contextual Information and Annotations for People Detection and Tracking. R Marroquin, J Dubois, C Nicolle, Data in Brief. 27R. Marroquin, J. Dubois, and C. Nicolle, \"WiseNET: An Indoor Multi- Camera Multi-Space Dataset with Contextual Information and Annota- tions for People Detection and Tracking,\" Data in Brief, vol. 27, 2019.\n\nHuman Motion Target Posture Detection Algorithm Using Semi-Supervised Learning in Internet of Things. L Chen, S Li, IEEE Access. 9L. Chen and S. Li, \"Human Motion Target Posture Detection Algorithm Using Semi-Supervised Learning in Internet of Things,\" IEEE Access, vol. 9, pp. 90 529-90 538, 2021.\n\nFIFS: Fine-grained Indoor Fingerprinting System. J Xiao, K Wu, Y Yi, L M Ni, Proceedings of International Conference on Computer Communications and Networks. International Conference on Computer Communications and NetworksJ. Xiao, K. Wu, Y. Yi, and L. M. Ni, \"FIFS: Fine-grained Indoor Fingerprinting System,\" in Proceedings of International Conference on Computer Communications and Networks, 2012, pp. 1-7.\n\nDevice-free Presence Detection and Localization with SVM and CSI Fingerprinting. R Zhou, X Lu, P Zhao, J Chen, IEEE Sensors Journal. 1723R. Zhou, X. Lu, P. Zhao, and J. Chen, \"Device-free Presence Detection and Localization with SVM and CSI Fingerprinting,\" IEEE Sensors Journal, vol. 17, no. 23, pp. 7990-7999, 2017.\n\nRobust WLAN-based Indoor Intrusion Detection Using PHY Layer Information. J Lv, D Man, W Yang, X Du, M Yu, IEEE Access. 6J. Lv, D. Man, W. Yang, X. Du, and M. Yu, \"Robust WLAN-based In- door Intrusion Detection Using PHY Layer Information,\" IEEE Access, vol. 6, pp. 30 117-30 127, 2018.\n\nDevice-free Multiple Presence Detection Using CSI with Machine Learning Methods. Y.-M Huang, A.-H Hsiao, C.-J Chiu, K.-T Feng, P.-H Tseng, Proceedings of IEEE Vehicular Technology Conference. IEEE Vehicular Technology ConferenceY.-M. Huang, A.-H. Hsiao, C.-J. Chiu, K.-T. Feng, and P.-H. Tseng, \"Device-free Multiple Presence Detection Using CSI with Machine Learning Methods,\" in Proceedings of IEEE Vehicular Technology Conference, 2019, pp. 1-5.\n\nHarvesting Ambient RF for Presence Detection Through Deep Learning. Y Liu, T Wang, Y Jiang, B Chen, IEEE Transactions on Neural Networks and Learning Systems. 334Y. Liu, T. Wang, Y. Jiang, and B. Chen, \"Harvesting Ambient RF for Presence Detection Through Deep Learning,\" IEEE Transactions on Neural Networks and Learning Systems, vol. 33, no. 4, pp. 1571-1583, 2022.\n\nAn Indoor Positioning Method Based on CSI by Using Features Optimization Mechanism with LSTM. Y Zhang, C Qu, Y Wang, IEEE Sensors Journal. 209Y. Zhang, C. Qu, and Y. Wang, \"An Indoor Positioning Method Based on CSI by Using Features Optimization Mechanism with LSTM,\" IEEE Sensors Journal, vol. 20, no. 9, pp. 4868-4878, 2020.\n\nDGRU Based Human Activity Recognition Using Channel State Information. S M Bokhari, S Sohaib, A R Khan, M Shafi, A U R Khan, Measurement. 167S. M. Bokhari, S. Sohaib, A. R. Khan, M. Shafi, and A. U. R. Khan, \"DGRU Based Human Activity Recognition Using Channel State Information,\" Measurement, vol. 167, 2021.\n\nWiFi CSI-based Device-free Multi-room Presence Detection Using Conditional Recurrent Network. F.-Y Chu, C.-J Chiu, A.-H Hsiao, K.-T Feng, P.-H Tseng, Proceedings of IEEE Vehicular Technology Conference. IEEE Vehicular Technology ConferenceF.-Y. Chu, C.-J. Chiu, A.-H. Hsiao, K.-T. Feng, and P.-H. Tseng, \"WiFi CSI-based Device-free Multi-room Presence Detection Using Conditional Recurrent Network,\" in Proceedings of IEEE Vehicular Technology Conference, 2021, pp. 1-5.\n\nDeepSense: Device-Free Human Activity Recognition via Autoencoder Long-Term Recurrent Convolutional Network. H Zou, Y Zhou, J Yang, H Jiang, L Xie, C J Spanos, Proceedings of IEEE International Conference on Communications. IEEE International Conference on CommunicationsH. Zou, Y. Zhou, J. Yang, H. Jiang, L. Xie, and C. J. Spanos, \"DeepSense: Device-Free Human Activity Recognition via Autoencoder Long-Term Recurrent Convolutional Network,\" in Proceedings of IEEE International Conference on Communications, 2018, pp. 1-6.\n\nAF-DCGAN: Amplitude Feature Deep Convolutional GAN for Fingerprint Construction in Indoor Localization Systems. Q Li, H Qu, Z Liu, N Zhou, W Sun, S Sigg, J Li, IEEE Transactions on Emerging Topics in Computational Intelligence. 53Q. Li, H. Qu, Z. Liu, N. Zhou, W. Sun, S. Sigg, and J. Li, \"AF- DCGAN: Amplitude Feature Deep Convolutional GAN for Fingerprint Construction in Indoor Localization Systems,\" IEEE Transactions on Emerging Topics in Computational Intelligence, vol. 5, no. 3, pp. 468- 480, 2021.\n\nCSI-based Fingerprinting for Indoor Localization: A Deep Learning Approach. X Wang, L Gao, S Mao, S Pandey, IEEE Transactions on Vehicular Technology. 661X. Wang, L. Gao, S. Mao, and S. Pandey, \"CSI-based Fingerprinting for Indoor Localization: A Deep Learning Approach,\" IEEE Transactions on Vehicular Technology, vol. 66, no. 1, pp. 763-776, 2017.\n\nCSI Phase Fingerprinting for Indoor Localization with A Deep Learning Approach. X Wang, L Gao, S Mao, IEEE Internet of Things Journal. 36X. Wang, L. Gao, and S. Mao, \"CSI Phase Fingerprinting for Indoor Localization with A Deep Learning Approach,\" IEEE Internet of Things Journal, vol. 3, no. 6, pp. 1113-1123, 2016.\n\nMIMO Transmission Over a Time-Varying Channel Using SVD. G Lebrun, J Gao, M Faulkner, IEEE Transactions on Wireless Communications. 42G. Lebrun, J. Gao, and M. Faulkner, \"MIMO Transmission Over a Time-Varying Channel Using SVD,\" IEEE Transactions on Wireless Communications, vol. 4, no. 2, pp. 757-764, 2005.\n\nMultimodal CSI-Based Human Activity Recognition Using GANs. D Wang, J Yang, W Cui, L Xie, S Sun, IEEE Internet of Things Journal. 824D. Wang, J. Yang, W. Cui, L. Xie, and S. Sun, \"Multimodal CSI-Based Human Activity Recognition Using GANs,\" IEEE Internet of Things Journal, vol. 8, no. 24, pp. 17 345-17 355, 2021.\n\nCsiGAN: Robust Channel State Information-based Activity Recognition with GANs. C Xiao, D Han, Y Ma, Z Qin, IEEE Internet of Things Journal. 66C. Xiao, D. Han, Y. Ma, and Z. Qin, \"CsiGAN: Robust Channel State Information-based Activity Recognition with GANs,\" IEEE Internet of Things Journal, vol. 6, no. 6, pp. 10 191-10 204, 2019.\n\nA Semi-Supervised Transfer Learning with Dynamic Associate Domain Adaptation for Human Activity Recognition Using WiFi Signals. Y.-S Chen, Y.-C Chang, C.-Y. Li, Sensors. 2124Y.-S. Chen, Y.-C. Chang, and C.-Y. Li, \"A Semi-Supervised Transfer Learning with Dynamic Associate Domain Adaptation for Human Activity Recognition Using WiFi Signals,\" Sensors, vol. 21, no. 24, 2021.\n\nSemi-Supervised Contrastive Learning for Human Activity Recognition. D Liu, T Abdelzaher, Proceedings of International Conference on Distributed Computing in Sensor Systems. International Conference on Distributed Computing in Sensor SystemsD. Liu and T. Abdelzaher, \"Semi-Supervised Contrastive Learning for Human Activity Recognition,\" in Proceedings of International Confer- ence on Distributed Computing in Sensor Systems, 2021, pp. 45-53.\n\nUnpaired Image-to-Image Translation using Cycle-Consistent Adversarial Networks. J.-Y Zhu, T Park, P Isola, A A Efros, Proceedings of IEEE International Conference on Computer Vision. IEEE International Conference on Computer VisionJ.-Y. Zhu, T. Park, P. Isola, and A. A. Efros, \"Unpaired Image-to- Image Translation using Cycle-Consistent Adversarial Networks,\" in Proceedings of IEEE International Conference on Computer Vision, 2017.\n\nMeta Pseudo Labels. H Pham, Z Dai, Q Xie, Q V Le, Proceedings of IEEE Conference on Computer Vision and Pattern Recognition. IEEE Conference on Computer Vision and Pattern RecognitionH. Pham, Z. Dai, Q. Xie, and Q. V. Le, \"Meta Pseudo Labels,\" in Proceedings of IEEE Conference on Computer Vision and Pattern Recognition, 2021, pp. 11 557-11 568.\n\nAttention is All you Need. A Vaswani, N Shazeer, N Parmar, J Uszkoreit, L Jones, A N Gomez, L Kaiser, I Polosukhin, Proceedings of Advances in Neural Information Processing Systems. Advances in Neural Information Processing Systems30A. Vaswani, N. Shazeer, N. Parmar, J. Uszkoreit, L. Jones, A. N. Gomez, L. Kaiser, and I. Polosukhin, \"Attention is All you Need,\" in Proceedings of Advances in Neural Information Processing Systems, vol. 30, 2017.\n\nDeep Residual Learning for Image Recognition. K He, X Zhang, S Ren, J Sun, Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. the IEEE Conference on Computer Vision and Pattern RecognitionK. He, X. Zhang, S. Ren, and J. Sun, \"Deep Residual Learning for Image Recognition,\" in Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition, 2016, pp. 770-778.\n\nSelf-Attention based Semi-Supervised Learning for Time-Varying Wi-Fi CSI-based Adjoining Room Presence Detection. K.-J Chen, A.-H Hsiao, C.-J Chiu, K.-T Feng, Proceedings of IEEE Vehicular Technology Conference. IEEE Vehicular Technology ConferenceK.-J. Chen, A.-H. Hsiao, C.-J. Chiu, and K.-T. Feng, \"Self-Attention based Semi-Supervised Learning for Time-Varying Wi-Fi CSI-based Adjoining Room Presence Detection,\" in Proceedings of IEEE Vehicular Technology Conference, 2022, pp. 1-5.\n\nDeepFi: Deep Learning for Indoor Fingerprinting Using Channel State Information. X Wang, L Gao, S Mao, S Pandey, Proceedings of IEEE Wireless Communications and Networking Conference. IEEE Wireless Communications and Networking ConferenceX. Wang, L. Gao, S. Mao, and S. Pandey, \"DeepFi: Deep Learning for Indoor Fingerprinting Using Channel State Information,\" in Proceedings of IEEE Wireless Communications and Networking Conference, 2015, pp. 1666-1671.\n\nA Simple Framework for Contrastive Learning of Visual Representations. T Chen, S Kornblith, M Norouzi, G Hinton, Proceedings of International Conference on Machine Learning. International Conference on Machine LearningT. Chen, S. Kornblith, M. Norouzi, and G. Hinton, \"A Simple Frame- work for Contrastive Learning of Visual Representations,\" in Proceed- ings of International Conference on Machine Learning, 2020, pp. 1597- 1607.\n\nBootstrap Your Own Latent -A New Approach to Self-Supervised Learning. J.-B Grill, F Strub, F Altché, C Tallec, P Richemond, E Buchatskaya, C Doersch, B Avila Pires, Z Guo, M Azar, B Piot, R Kavukcuoglu, M Munos, Valko, Proceedings of Advances in Neural Information Processing Systems. Advances in Neural Information Processing Systems33J.-B. Grill, F. Strub, F. Altché, C. Tallec, P. Richemond, E. Buchatskaya, C. Doersch, B. Avila Pires, Z. Guo, M. Gheshlaghi Azar, B. Piot, k. kavukcuoglu, R. Munos, and M. Valko, \"Bootstrap Your Own Latent -A New Approach to Self-Supervised Learning,\" in Proceedings of Advances in Neural Information Processing Systems, vol. 33, 2020, pp. 21 271-21 284.\n", "annotations": {"author": "[{\"end\":239,\"start\":115},{\"end\":362,\"start\":240},{\"end\":486,\"start\":363},{\"end\":628,\"start\":487},{\"end\":239,\"start\":115},{\"end\":362,\"start\":240},{\"end\":486,\"start\":363},{\"end\":628,\"start\":487}]", "publisher": null, "author_last_name": "[{\"end\":129,\"start\":125},{\"end\":252,\"start\":248},{\"end\":376,\"start\":371},{\"end\":499,\"start\":495},{\"end\":129,\"start\":125},{\"end\":252,\"start\":248},{\"end\":376,\"start\":371},{\"end\":499,\"start\":495}]", "author_first_name": "[{\"end\":124,\"start\":115},{\"end\":247,\"start\":240},{\"end\":370,\"start\":363},{\"end\":494,\"start\":487},{\"end\":124,\"start\":115},{\"end\":247,\"start\":240},{\"end\":370,\"start\":363},{\"end\":494,\"start\":487}]", "author_affiliation": "[{\"end\":238,\"start\":131},{\"end\":361,\"start\":254},{\"end\":485,\"start\":378},{\"end\":627,\"start\":520},{\"end\":238,\"start\":131},{\"end\":361,\"start\":254},{\"end\":485,\"start\":378},{\"end\":627,\"start\":520}]", "title": "[{\"end\":101,\"start\":1},{\"end\":729,\"start\":629},{\"end\":101,\"start\":1},{\"end\":729,\"start\":629}]", "venue": null, "abstract": "[{\"end\":2641,\"start\":896},{\"end\":2641,\"start\":896}]", "bib_ref": "[{\"attributes\":{\"ref_id\":\"b0\"},\"end\":3602,\"start\":3599},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":3604,\"start\":3602},{\"attributes\":{\"ref_id\":\"b2\"},\"end\":3626,\"start\":3623},{\"attributes\":{\"ref_id\":\"b3\"},\"end\":3628,\"start\":3626},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":3954,\"start\":3951},{\"attributes\":{\"ref_id\":\"b5\"},\"end\":3957,\"start\":3954},{\"attributes\":{\"ref_id\":\"b6\"},\"end\":3960,\"start\":3957},{\"attributes\":{\"ref_id\":\"b7\"},\"end\":4668,\"start\":4665},{\"attributes\":{\"ref_id\":\"b8\"},\"end\":4671,\"start\":4668},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":4675,\"start\":4671},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":4836,\"start\":4832},{\"attributes\":{\"ref_id\":\"b11\"},\"end\":4840,\"start\":4836},{\"attributes\":{\"ref_id\":\"b12\"},\"end\":4844,\"start\":4840},{\"attributes\":{\"ref_id\":\"b13\"},\"end\":4848,\"start\":4844},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":4852,\"start\":4848},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":4856,\"start\":4852},{\"attributes\":{\"ref_id\":\"b16\"},\"end\":4860,\"start\":4856},{\"attributes\":{\"ref_id\":\"b17\"},\"end\":4864,\"start\":4860},{\"attributes\":{\"ref_id\":\"b18\"},\"end\":4868,\"start\":4864},{\"attributes\":{\"ref_id\":\"b7\"},\"end\":4877,\"start\":4874},{\"attributes\":{\"ref_id\":\"b8\"},\"end\":5175,\"start\":5172},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":5266,\"start\":5262},{\"attributes\":{\"ref_id\":\"b11\"},\"end\":5500,\"start\":5496},{\"attributes\":{\"ref_id\":\"b12\"},\"end\":5780,\"start\":5776},{\"attributes\":{\"ref_id\":\"b13\"},\"end\":5816,\"start\":5812},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":5819,\"start\":5816},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":5854,\"start\":5850},{\"attributes\":{\"ref_id\":\"b16\"},\"end\":6076,\"start\":6072},{\"attributes\":{\"ref_id\":\"b19\"},\"end\":6217,\"start\":6213},{\"attributes\":{\"ref_id\":\"b20\"},\"end\":7045,\"start\":7041},{\"attributes\":{\"ref_id\":\"b21\"},\"end\":7061,\"start\":7057},{\"attributes\":{\"ref_id\":\"b22\"},\"end\":7144,\"start\":7140},{\"attributes\":{\"ref_id\":\"b23\"},\"end\":7220,\"start\":7216},{\"attributes\":{\"ref_id\":\"b24\"},\"end\":8038,\"start\":8034},{\"attributes\":{\"ref_id\":\"b25\"},\"end\":8514,\"start\":8510},{\"attributes\":{\"ref_id\":\"b26\"},\"end\":8868,\"start\":8864},{\"attributes\":{\"ref_id\":\"b27\"},\"end\":8884,\"start\":8880},{\"attributes\":{\"ref_id\":\"b28\"},\"end\":8985,\"start\":8981},{\"attributes\":{\"ref_id\":\"b29\"},\"end\":14043,\"start\":14039},{\"attributes\":{\"ref_id\":\"b25\"},\"end\":19434,\"start\":19430},{\"attributes\":{\"ref_id\":\"b8\"},\"end\":33973,\"start\":33970},{\"attributes\":{\"ref_id\":\"b11\"},\"end\":38157,\"start\":38153},{\"attributes\":{\"ref_id\":\"b30\"},\"end\":40368,\"start\":40364},{\"attributes\":{\"ref_id\":\"b31\"},\"end\":40382,\"start\":40378},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":58051,\"start\":58047},{\"attributes\":{\"ref_id\":\"b0\"},\"end\":3602,\"start\":3599},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":3604,\"start\":3602},{\"attributes\":{\"ref_id\":\"b2\"},\"end\":3626,\"start\":3623},{\"attributes\":{\"ref_id\":\"b3\"},\"end\":3628,\"start\":3626},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":3954,\"start\":3951},{\"attributes\":{\"ref_id\":\"b5\"},\"end\":3957,\"start\":3954},{\"attributes\":{\"ref_id\":\"b6\"},\"end\":3960,\"start\":3957},{\"attributes\":{\"ref_id\":\"b7\"},\"end\":4668,\"start\":4665},{\"attributes\":{\"ref_id\":\"b8\"},\"end\":4671,\"start\":4668},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":4675,\"start\":4671},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":4836,\"start\":4832},{\"attributes\":{\"ref_id\":\"b11\"},\"end\":4840,\"start\":4836},{\"attributes\":{\"ref_id\":\"b12\"},\"end\":4844,\"start\":4840},{\"attributes\":{\"ref_id\":\"b13\"},\"end\":4848,\"start\":4844},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":4852,\"start\":4848},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":4856,\"start\":4852},{\"attributes\":{\"ref_id\":\"b16\"},\"end\":4860,\"start\":4856},{\"attributes\":{\"ref_id\":\"b17\"},\"end\":4864,\"start\":4860},{\"attributes\":{\"ref_id\":\"b18\"},\"end\":4868,\"start\":4864},{\"attributes\":{\"ref_id\":\"b7\"},\"end\":4877,\"start\":4874},{\"attributes\":{\"ref_id\":\"b8\"},\"end\":5175,\"start\":5172},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":5266,\"start\":5262},{\"attributes\":{\"ref_id\":\"b11\"},\"end\":5500,\"start\":5496},{\"attributes\":{\"ref_id\":\"b12\"},\"end\":5780,\"start\":5776},{\"attributes\":{\"ref_id\":\"b13\"},\"end\":5816,\"start\":5812},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":5819,\"start\":5816},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":5854,\"start\":5850},{\"attributes\":{\"ref_id\":\"b16\"},\"end\":6076,\"start\":6072},{\"attributes\":{\"ref_id\":\"b19\"},\"end\":6217,\"start\":6213},{\"attributes\":{\"ref_id\":\"b20\"},\"end\":7045,\"start\":7041},{\"attributes\":{\"ref_id\":\"b21\"},\"end\":7061,\"start\":7057},{\"attributes\":{\"ref_id\":\"b22\"},\"end\":7144,\"start\":7140},{\"attributes\":{\"ref_id\":\"b23\"},\"end\":7220,\"start\":7216},{\"attributes\":{\"ref_id\":\"b24\"},\"end\":8038,\"start\":8034},{\"attributes\":{\"ref_id\":\"b25\"},\"end\":8514,\"start\":8510},{\"attributes\":{\"ref_id\":\"b26\"},\"end\":8868,\"start\":8864},{\"attributes\":{\"ref_id\":\"b27\"},\"end\":8884,\"start\":8880},{\"attributes\":{\"ref_id\":\"b28\"},\"end\":8985,\"start\":8981},{\"attributes\":{\"ref_id\":\"b29\"},\"end\":14043,\"start\":14039},{\"attributes\":{\"ref_id\":\"b25\"},\"end\":19434,\"start\":19430},{\"attributes\":{\"ref_id\":\"b8\"},\"end\":33973,\"start\":33970},{\"attributes\":{\"ref_id\":\"b11\"},\"end\":38157,\"start\":38153},{\"attributes\":{\"ref_id\":\"b30\"},\"end\":40368,\"start\":40364},{\"attributes\":{\"ref_id\":\"b31\"},\"end\":40382,\"start\":40378},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":58051,\"start\":58047}]", "figure": "[{\"attributes\":{\"id\":\"fig_0\"},\"end\":65440,\"start\":65380},{\"attributes\":{\"id\":\"fig_1\"},\"end\":65740,\"start\":65441},{\"attributes\":{\"id\":\"fig_2\"},\"end\":66024,\"start\":65741},{\"attributes\":{\"id\":\"fig_3\"},\"end\":66224,\"start\":66025},{\"attributes\":{\"id\":\"fig_4\"},\"end\":66278,\"start\":66225},{\"attributes\":{\"id\":\"fig_5\"},\"end\":66504,\"start\":66279},{\"attributes\":{\"id\":\"fig_6\"},\"end\":66730,\"start\":66505},{\"attributes\":{\"id\":\"fig_7\"},\"end\":66989,\"start\":66731},{\"attributes\":{\"id\":\"fig_9\"},\"end\":67169,\"start\":66990},{\"attributes\":{\"id\":\"fig_13\"},\"end\":67227,\"start\":67170},{\"attributes\":{\"id\":\"fig_14\"},\"end\":67547,\"start\":67228},{\"attributes\":{\"id\":\"fig_15\"},\"end\":67626,\"start\":67548},{\"attributes\":{\"id\":\"fig_16\"},\"end\":67896,\"start\":67627},{\"attributes\":{\"id\":\"tab_0\",\"type\":\"table\"},\"end\":68360,\"start\":67897},{\"attributes\":{\"id\":\"tab_1\",\"type\":\"table\"},\"end\":68858,\"start\":68361},{\"attributes\":{\"id\":\"tab_3\",\"type\":\"table\"},\"end\":69054,\"start\":68859},{\"attributes\":{\"id\":\"tab_6\",\"type\":\"table\"},\"end\":69392,\"start\":69055},{\"attributes\":{\"id\":\"tab_7\",\"type\":\"table\"},\"end\":69910,\"start\":69393},{\"attributes\":{\"id\":\"tab_9\",\"type\":\"table\"},\"end\":70660,\"start\":69911},{\"attributes\":{\"id\":\"fig_0\"},\"end\":65440,\"start\":65380},{\"attributes\":{\"id\":\"fig_1\"},\"end\":65740,\"start\":65441},{\"attributes\":{\"id\":\"fig_2\"},\"end\":66024,\"start\":65741},{\"attributes\":{\"id\":\"fig_3\"},\"end\":66224,\"start\":66025},{\"attributes\":{\"id\":\"fig_4\"},\"end\":66278,\"start\":66225},{\"attributes\":{\"id\":\"fig_5\"},\"end\":66504,\"start\":66279},{\"attributes\":{\"id\":\"fig_6\"},\"end\":66730,\"start\":66505},{\"attributes\":{\"id\":\"fig_7\"},\"end\":66989,\"start\":66731},{\"attributes\":{\"id\":\"fig_9\"},\"end\":67169,\"start\":66990},{\"attributes\":{\"id\":\"fig_13\"},\"end\":67227,\"start\":67170},{\"attributes\":{\"id\":\"fig_14\"},\"end\":67547,\"start\":67228},{\"attributes\":{\"id\":\"fig_15\"},\"end\":67626,\"start\":67548},{\"attributes\":{\"id\":\"fig_16\"},\"end\":67896,\"start\":67627},{\"attributes\":{\"id\":\"tab_0\",\"type\":\"table\"},\"end\":68360,\"start\":67897},{\"attributes\":{\"id\":\"tab_1\",\"type\":\"table\"},\"end\":68858,\"start\":68361},{\"attributes\":{\"id\":\"tab_3\",\"type\":\"table\"},\"end\":69054,\"start\":68859},{\"attributes\":{\"id\":\"tab_6\",\"type\":\"table\"},\"end\":69392,\"start\":69055},{\"attributes\":{\"id\":\"tab_7\",\"type\":\"table\"},\"end\":69910,\"start\":69393},{\"attributes\":{\"id\":\"tab_9\",\"type\":\"table\"},\"end\":70660,\"start\":69911}]", "paragraph": "[{\"end\":3480,\"start\":2660},{\"end\":4869,\"start\":3482},{\"end\":7012,\"start\":4871},{\"end\":8058,\"start\":7014},{\"end\":9503,\"start\":8060},{\"end\":10994,\"start\":9505},{\"end\":12423,\"start\":11074},{\"end\":13243,\"start\":12456},{\"end\":13695,\"start\":13285},{\"end\":14233,\"start\":13697},{\"end\":14697,\"start\":14318},{\"end\":16251,\"start\":14786},{\"end\":18106,\"start\":16314},{\"end\":19275,\"start\":18185},{\"end\":23475,\"start\":19293},{\"end\":24508,\"start\":23492},{\"end\":25306,\"start\":24510},{\"end\":26223,\"start\":25429},{\"end\":28020,\"start\":26406},{\"end\":28517,\"start\":28022},{\"end\":28763,\"start\":28557},{\"end\":29341,\"start\":28836},{\"end\":30452,\"start\":29404},{\"end\":31385,\"start\":30594},{\"end\":32663,\"start\":31417},{\"end\":34618,\"start\":32665},{\"end\":35309,\"start\":34644},{\"end\":35753,\"start\":35494},{\"end\":35996,\"start\":35814},{\"end\":37674,\"start\":36071},{\"end\":38158,\"start\":37722},{\"end\":39282,\"start\":38212},{\"end\":39993,\"start\":39460},{\"end\":40294,\"start\":40070},{\"end\":40713,\"start\":40331},{\"end\":41484,\"start\":40768},{\"end\":41711,\"start\":41589},{\"end\":42278,\"start\":41791},{\"end\":42987,\"start\":42309},{\"end\":44341,\"start\":43045},{\"end\":44734,\"start\":44387},{\"end\":45250,\"start\":44771},{\"end\":46389,\"start\":45252},{\"end\":47231,\"start\":46391},{\"end\":48411,\"start\":47285},{\"end\":48866,\"start\":48445},{\"end\":49398,\"start\":48868},{\"end\":51318,\"start\":49400},{\"end\":52853,\"start\":51320},{\"end\":55108,\"start\":52855},{\"end\":56154,\"start\":55110},{\"end\":56686,\"start\":56156},{\"end\":58003,\"start\":56688},{\"end\":59054,\"start\":58005},{\"end\":60026,\"start\":59056},{\"end\":60772,\"start\":60083},{\"end\":61543,\"start\":60774},{\"end\":62745,\"start\":61545},{\"end\":63583,\"start\":62747},{\"end\":64297,\"start\":63585},{\"end\":65379,\"start\":64315},{\"end\":3480,\"start\":2660},{\"end\":4869,\"start\":3482},{\"end\":7012,\"start\":4871},{\"end\":8058,\"start\":7014},{\"end\":9503,\"start\":8060},{\"end\":10994,\"start\":9505},{\"end\":12423,\"start\":11074},{\"end\":13243,\"start\":12456},{\"end\":13695,\"start\":13285},{\"end\":14233,\"start\":13697},{\"end\":14697,\"start\":14318},{\"end\":16251,\"start\":14786},{\"end\":18106,\"start\":16314},{\"end\":19275,\"start\":18185},{\"end\":23475,\"start\":19293},{\"end\":24508,\"start\":23492},{\"end\":25306,\"start\":24510},{\"end\":26223,\"start\":25429},{\"end\":28020,\"start\":26406},{\"end\":28517,\"start\":28022},{\"end\":28763,\"start\":28557},{\"end\":29341,\"start\":28836},{\"end\":30452,\"start\":29404},{\"end\":31385,\"start\":30594},{\"end\":32663,\"start\":31417},{\"end\":34618,\"start\":32665},{\"end\":35309,\"start\":34644},{\"end\":35753,\"start\":35494},{\"end\":35996,\"start\":35814},{\"end\":37674,\"start\":36071},{\"end\":38158,\"start\":37722},{\"end\":39282,\"start\":38212},{\"end\":39993,\"start\":39460},{\"end\":40294,\"start\":40070},{\"end\":40713,\"start\":40331},{\"end\":41484,\"start\":40768},{\"end\":41711,\"start\":41589},{\"end\":42278,\"start\":41791},{\"end\":42987,\"start\":42309},{\"end\":44341,\"start\":43045},{\"end\":44734,\"start\":44387},{\"end\":45250,\"start\":44771},{\"end\":46389,\"start\":45252},{\"end\":47231,\"start\":46391},{\"end\":48411,\"start\":47285},{\"end\":48866,\"start\":48445},{\"end\":49398,\"start\":48868},{\"end\":51318,\"start\":49400},{\"end\":52853,\"start\":51320},{\"end\":55108,\"start\":52855},{\"end\":56154,\"start\":55110},{\"end\":56686,\"start\":56156},{\"end\":58003,\"start\":56688},{\"end\":59054,\"start\":58005},{\"end\":60026,\"start\":59056},{\"end\":60772,\"start\":60083},{\"end\":61543,\"start\":60774},{\"end\":62745,\"start\":61545},{\"end\":63583,\"start\":62747},{\"end\":64297,\"start\":63585},{\"end\":65379,\"start\":64315}]", "formula": "[{\"attributes\":{\"id\":\"formula_0\"},\"end\":13284,\"start\":13244},{\"attributes\":{\"id\":\"formula_2\"},\"end\":14317,\"start\":14234},{\"attributes\":{\"id\":\"formula_3\"},\"end\":23491,\"start\":23476},{\"attributes\":{\"id\":\"formula_4\"},\"end\":25370,\"start\":25307},{\"attributes\":{\"id\":\"formula_5\"},\"end\":25393,\"start\":25370},{\"attributes\":{\"id\":\"formula_6\"},\"end\":26405,\"start\":26224},{\"attributes\":{\"id\":\"formula_7\"},\"end\":28556,\"start\":28518},{\"attributes\":{\"id\":\"formula_8\"},\"end\":28835,\"start\":28764},{\"attributes\":{\"id\":\"formula_9\"},\"end\":30593,\"start\":30482},{\"attributes\":{\"id\":\"formula_10\"},\"end\":31416,\"start\":31386},{\"attributes\":{\"id\":\"formula_11\"},\"end\":35493,\"start\":35310},{\"attributes\":{\"id\":\"formula_12\"},\"end\":36070,\"start\":35997},{\"attributes\":{\"id\":\"formula_13\"},\"end\":38211,\"start\":38159},{\"attributes\":{\"id\":\"formula_14\"},\"end\":39459,\"start\":39283},{\"attributes\":{\"id\":\"formula_15\"},\"end\":40069,\"start\":39994},{\"attributes\":{\"id\":\"formula_16\"},\"end\":40767,\"start\":40714},{\"attributes\":{\"id\":\"formula_17\"},\"end\":41754,\"start\":41712},{\"attributes\":{\"id\":\"formula_18\"},\"end\":41790,\"start\":41754},{\"attributes\":{\"id\":\"formula_19\"},\"end\":42308,\"start\":42279},{\"attributes\":{\"id\":\"formula_0\"},\"end\":13284,\"start\":13244},{\"attributes\":{\"id\":\"formula_2\"},\"end\":14317,\"start\":14234},{\"attributes\":{\"id\":\"formula_3\"},\"end\":23491,\"start\":23476},{\"attributes\":{\"id\":\"formula_4\"},\"end\":25370,\"start\":25307},{\"attributes\":{\"id\":\"formula_5\"},\"end\":25393,\"start\":25370},{\"attributes\":{\"id\":\"formula_6\"},\"end\":26405,\"start\":26224},{\"attributes\":{\"id\":\"formula_7\"},\"end\":28556,\"start\":28518},{\"attributes\":{\"id\":\"formula_8\"},\"end\":28835,\"start\":28764},{\"attributes\":{\"id\":\"formula_9\"},\"end\":30593,\"start\":30482},{\"attributes\":{\"id\":\"formula_10\"},\"end\":31416,\"start\":31386},{\"attributes\":{\"id\":\"formula_11\"},\"end\":35493,\"start\":35310},{\"attributes\":{\"id\":\"formula_12\"},\"end\":36070,\"start\":35997},{\"attributes\":{\"id\":\"formula_13\"},\"end\":38211,\"start\":38159},{\"attributes\":{\"id\":\"formula_14\"},\"end\":39459,\"start\":39283},{\"attributes\":{\"id\":\"formula_15\"},\"end\":40069,\"start\":39994},{\"attributes\":{\"id\":\"formula_16\"},\"end\":40767,\"start\":40714},{\"attributes\":{\"id\":\"formula_17\"},\"end\":41754,\"start\":41712},{\"attributes\":{\"id\":\"formula_18\"},\"end\":41790,\"start\":41754},{\"attributes\":{\"id\":\"formula_19\"},\"end\":42308,\"start\":42279}]", "table_ref": "[{\"attributes\":{\"ref_id\":\"tab_0\"},\"end\":44284,\"start\":44277},{\"attributes\":{\"ref_id\":\"tab_0\"},\"end\":44338,\"start\":44330},{\"attributes\":{\"ref_id\":\"tab_0\"},\"end\":48358,\"start\":48349},{\"attributes\":{\"ref_id\":\"tab_0\"},\"end\":58130,\"start\":58121},{\"attributes\":{\"ref_id\":\"tab_0\"},\"end\":44284,\"start\":44277},{\"attributes\":{\"ref_id\":\"tab_0\"},\"end\":44338,\"start\":44330},{\"attributes\":{\"ref_id\":\"tab_0\"},\"end\":48358,\"start\":48349},{\"attributes\":{\"ref_id\":\"tab_0\"},\"end\":58130,\"start\":58121}]", "section_header": "[{\"end\":2658,\"start\":2643},{\"end\":11072,\"start\":10997},{\"end\":12454,\"start\":12426},{\"end\":14784,\"start\":14700},{\"end\":16312,\"start\":16254},{\"end\":18183,\"start\":18109},{\"end\":19291,\"start\":19278},{\"end\":25427,\"start\":25395},{\"end\":29402,\"start\":29344},{\"end\":30481,\"start\":30455},{\"end\":34642,\"start\":34621},{\"end\":35812,\"start\":35756},{\"end\":37720,\"start\":37677},{\"end\":40329,\"start\":40297},{\"end\":41587,\"start\":41487},{\"end\":43016,\"start\":42990},{\"end\":43043,\"start\":43019},{\"end\":44385,\"start\":44344},{\"end\":44769,\"start\":44737},{\"end\":47283,\"start\":47234},{\"end\":48443,\"start\":48414},{\"end\":60081,\"start\":60029},{\"end\":64313,\"start\":64300},{\"end\":65389,\"start\":65381},{\"end\":65450,\"start\":65442},{\"end\":65750,\"start\":65742},{\"end\":66034,\"start\":66026},{\"end\":66234,\"start\":66226},{\"end\":66296,\"start\":66280},{\"end\":66514,\"start\":66506},{\"end\":66749,\"start\":66732},{\"end\":67000,\"start\":66991},{\"end\":67180,\"start\":67171},{\"end\":67238,\"start\":67229},{\"end\":67558,\"start\":67549},{\"end\":67637,\"start\":67628},{\"end\":67907,\"start\":67898},{\"end\":68372,\"start\":68362},{\"end\":68871,\"start\":68860},{\"end\":69066,\"start\":69056},{\"end\":69921,\"start\":69912},{\"end\":2658,\"start\":2643},{\"end\":11072,\"start\":10997},{\"end\":12454,\"start\":12426},{\"end\":14784,\"start\":14700},{\"end\":16312,\"start\":16254},{\"end\":18183,\"start\":18109},{\"end\":19291,\"start\":19278},{\"end\":25427,\"start\":25395},{\"end\":29402,\"start\":29344},{\"end\":30481,\"start\":30455},{\"end\":34642,\"start\":34621},{\"end\":35812,\"start\":35756},{\"end\":37720,\"start\":37677},{\"end\":40329,\"start\":40297},{\"end\":41587,\"start\":41487},{\"end\":43016,\"start\":42990},{\"end\":43043,\"start\":43019},{\"end\":44385,\"start\":44344},{\"end\":44769,\"start\":44737},{\"end\":47283,\"start\":47234},{\"end\":48443,\"start\":48414},{\"end\":60081,\"start\":60029},{\"end\":64313,\"start\":64300},{\"end\":65389,\"start\":65381},{\"end\":65450,\"start\":65442},{\"end\":65750,\"start\":65742},{\"end\":66034,\"start\":66026},{\"end\":66234,\"start\":66226},{\"end\":66296,\"start\":66280},{\"end\":66514,\"start\":66506},{\"end\":66749,\"start\":66732},{\"end\":67000,\"start\":66991},{\"end\":67180,\"start\":67171},{\"end\":67238,\"start\":67229},{\"end\":67558,\"start\":67549},{\"end\":67637,\"start\":67628},{\"end\":67907,\"start\":67898},{\"end\":68372,\"start\":68362},{\"end\":68871,\"start\":68860},{\"end\":69066,\"start\":69056},{\"end\":69921,\"start\":69912}]", "table": "[{\"end\":68360,\"start\":67942},{\"end\":68858,\"start\":68410},{\"end\":69054,\"start\":68898},{\"end\":69392,\"start\":69112},{\"end\":69910,\"start\":69442},{\"end\":70660,\"start\":70042},{\"end\":68360,\"start\":67942},{\"end\":68858,\"start\":68410},{\"end\":69054,\"start\":68898},{\"end\":69392,\"start\":69112},{\"end\":69910,\"start\":69442},{\"end\":70660,\"start\":70042}]", "figure_caption": "[{\"end\":65440,\"start\":65391},{\"end\":65740,\"start\":65452},{\"end\":66024,\"start\":65752},{\"end\":66224,\"start\":66036},{\"end\":66278,\"start\":66236},{\"end\":66504,\"start\":66299},{\"end\":66730,\"start\":66516},{\"end\":66989,\"start\":66753},{\"end\":67169,\"start\":67003},{\"end\":67227,\"start\":67183},{\"end\":67547,\"start\":67241},{\"end\":67626,\"start\":67561},{\"end\":67896,\"start\":67640},{\"end\":67942,\"start\":67909},{\"end\":68410,\"start\":68375},{\"end\":68898,\"start\":68875},{\"end\":69112,\"start\":69069},{\"end\":69442,\"start\":69395},{\"end\":70042,\"start\":69923},{\"end\":65440,\"start\":65391},{\"end\":65740,\"start\":65452},{\"end\":66024,\"start\":65752},{\"end\":66224,\"start\":66036},{\"end\":66278,\"start\":66236},{\"end\":66504,\"start\":66299},{\"end\":66730,\"start\":66516},{\"end\":66989,\"start\":66753},{\"end\":67169,\"start\":67003},{\"end\":67227,\"start\":67183},{\"end\":67547,\"start\":67241},{\"end\":67626,\"start\":67561},{\"end\":67896,\"start\":67640},{\"end\":67942,\"start\":67909},{\"end\":68410,\"start\":68375},{\"end\":68898,\"start\":68875},{\"end\":69112,\"start\":69069},{\"end\":69442,\"start\":69395},{\"end\":70042,\"start\":69923}]", "figure_ref": "[{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":11394,\"start\":11388},{\"end\":13888,\"start\":13884},{\"attributes\":{\"ref_id\":\"fig_1\"},\"end\":14592,\"start\":14585},{\"attributes\":{\"ref_id\":\"fig_2\"},\"end\":14924,\"start\":14918},{\"attributes\":{\"ref_id\":\"fig_2\"},\"end\":15109,\"start\":15102},{\"attributes\":{\"ref_id\":\"fig_2\"},\"end\":15442,\"start\":15434},{\"attributes\":{\"ref_id\":\"fig_2\"},\"end\":15465,\"start\":15458},{\"attributes\":{\"ref_id\":\"fig_3\"},\"end\":17394,\"start\":17388},{\"attributes\":{\"ref_id\":\"fig_3\"},\"end\":17596,\"start\":17589},{\"attributes\":{\"ref_id\":\"fig_3\"},\"end\":17759,\"start\":17751},{\"attributes\":{\"ref_id\":\"fig_3\"},\"end\":17777,\"start\":17770},{\"attributes\":{\"ref_id\":\"fig_4\"},\"end\":20543,\"start\":20537},{\"attributes\":{\"ref_id\":\"fig_4\"},\"end\":23048,\"start\":23042},{\"attributes\":{\"ref_id\":\"fig_1\"},\"end\":24507,\"start\":24500},{\"end\":29663,\"start\":29656},{\"end\":32194,\"start\":32187},{\"end\":32696,\"start\":32690},{\"end\":32879,\"start\":32872},{\"attributes\":{\"ref_id\":\"fig_6\"},\"end\":43125,\"start\":43118},{\"end\":45488,\"start\":45481},{\"end\":45783,\"start\":45776},{\"end\":46102,\"start\":46095},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":46516,\"start\":46509},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":47679,\"start\":47671},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":47816,\"start\":47808},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":49110,\"start\":49103},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":49305,\"start\":49298},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":49846,\"start\":49839},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":52368,\"start\":52361},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":54707,\"start\":54700},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":55129,\"start\":55122},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":56762,\"start\":56755},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":57035,\"start\":57027},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":57145,\"start\":57137},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":57338,\"start\":57331},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":57526,\"start\":57518},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":57809,\"start\":57800},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":59183,\"start\":59175},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":60886,\"start\":60879},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":62027,\"start\":62019},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":62882,\"start\":62874},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":11394,\"start\":11388},{\"end\":13888,\"start\":13884},{\"attributes\":{\"ref_id\":\"fig_1\"},\"end\":14592,\"start\":14585},{\"attributes\":{\"ref_id\":\"fig_2\"},\"end\":14924,\"start\":14918},{\"attributes\":{\"ref_id\":\"fig_2\"},\"end\":15109,\"start\":15102},{\"attributes\":{\"ref_id\":\"fig_2\"},\"end\":15442,\"start\":15434},{\"attributes\":{\"ref_id\":\"fig_2\"},\"end\":15465,\"start\":15458},{\"attributes\":{\"ref_id\":\"fig_3\"},\"end\":17394,\"start\":17388},{\"attributes\":{\"ref_id\":\"fig_3\"},\"end\":17596,\"start\":17589},{\"attributes\":{\"ref_id\":\"fig_3\"},\"end\":17759,\"start\":17751},{\"attributes\":{\"ref_id\":\"fig_3\"},\"end\":17777,\"start\":17770},{\"attributes\":{\"ref_id\":\"fig_4\"},\"end\":20543,\"start\":20537},{\"attributes\":{\"ref_id\":\"fig_4\"},\"end\":23048,\"start\":23042},{\"attributes\":{\"ref_id\":\"fig_1\"},\"end\":24507,\"start\":24500},{\"end\":29663,\"start\":29656},{\"end\":32194,\"start\":32187},{\"end\":32696,\"start\":32690},{\"end\":32879,\"start\":32872},{\"attributes\":{\"ref_id\":\"fig_6\"},\"end\":43125,\"start\":43118},{\"end\":45488,\"start\":45481},{\"end\":45783,\"start\":45776},{\"end\":46102,\"start\":46095},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":46516,\"start\":46509},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":47679,\"start\":47671},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":47816,\"start\":47808},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":49110,\"start\":49103},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":49305,\"start\":49298},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":49846,\"start\":49839},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":52368,\"start\":52361},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":54707,\"start\":54700},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":55129,\"start\":55122},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":56762,\"start\":56755},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":57035,\"start\":57027},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":57145,\"start\":57137},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":57338,\"start\":57331},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":57526,\"start\":57518},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":57809,\"start\":57800},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":59183,\"start\":59175},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":60886,\"start\":60879},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":62027,\"start\":62019},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":62882,\"start\":62874}]", "bib_author_first_name": "[{\"end\":70772,\"start\":70771},{\"end\":70780,\"start\":70779},{\"end\":70786,\"start\":70785},{\"end\":70794,\"start\":70793},{\"end\":71083,\"start\":71082},{\"end\":71098,\"start\":71097},{\"end\":71110,\"start\":71109},{\"end\":71450,\"start\":71449},{\"end\":71469,\"start\":71468},{\"end\":71478,\"start\":71477},{\"end\":71488,\"start\":71487},{\"end\":71816,\"start\":71815},{\"end\":71823,\"start\":71822},{\"end\":71829,\"start\":71828},{\"end\":71839,\"start\":71838},{\"end\":72372,\"start\":72371},{\"end\":72381,\"start\":72380},{\"end\":72389,\"start\":72388},{\"end\":72705,\"start\":72704},{\"end\":72718,\"start\":72717},{\"end\":72728,\"start\":72727},{\"end\":73066,\"start\":73065},{\"end\":73074,\"start\":73073},{\"end\":73313,\"start\":73312},{\"end\":73321,\"start\":73320},{\"end\":73327,\"start\":73326},{\"end\":73333,\"start\":73332},{\"end\":73335,\"start\":73334},{\"end\":73755,\"start\":73754},{\"end\":73763,\"start\":73762},{\"end\":73769,\"start\":73768},{\"end\":73777,\"start\":73776},{\"end\":74067,\"start\":74066},{\"end\":74073,\"start\":74072},{\"end\":74080,\"start\":74079},{\"end\":74088,\"start\":74087},{\"end\":74094,\"start\":74093},{\"end\":74365,\"start\":74361},{\"end\":74377,\"start\":74373},{\"end\":74389,\"start\":74385},{\"end\":74400,\"start\":74396},{\"end\":74411,\"start\":74407},{\"end\":74799,\"start\":74798},{\"end\":74806,\"start\":74805},{\"end\":74814,\"start\":74813},{\"end\":74823,\"start\":74822},{\"end\":75194,\"start\":75193},{\"end\":75203,\"start\":75202},{\"end\":75209,\"start\":75208},{\"end\":75499,\"start\":75498},{\"end\":75501,\"start\":75500},{\"end\":75512,\"start\":75511},{\"end\":75522,\"start\":75521},{\"end\":75524,\"start\":75523},{\"end\":75532,\"start\":75531},{\"end\":75541,\"start\":75540},{\"end\":75545,\"start\":75542},{\"end\":75836,\"start\":75832},{\"end\":75846,\"start\":75842},{\"end\":75857,\"start\":75853},{\"end\":75869,\"start\":75865},{\"end\":75880,\"start\":75876},{\"end\":76320,\"start\":76319},{\"end\":76327,\"start\":76326},{\"end\":76335,\"start\":76334},{\"end\":76343,\"start\":76342},{\"end\":76352,\"start\":76351},{\"end\":76359,\"start\":76358},{\"end\":76361,\"start\":76360},{\"end\":76850,\"start\":76849},{\"end\":76856,\"start\":76855},{\"end\":76862,\"start\":76861},{\"end\":76869,\"start\":76868},{\"end\":76877,\"start\":76876},{\"end\":76884,\"start\":76883},{\"end\":76892,\"start\":76891},{\"end\":77322,\"start\":77321},{\"end\":77330,\"start\":77329},{\"end\":77337,\"start\":77336},{\"end\":77344,\"start\":77343},{\"end\":77677,\"start\":77676},{\"end\":77685,\"start\":77684},{\"end\":77692,\"start\":77691},{\"end\":77972,\"start\":77971},{\"end\":77982,\"start\":77981},{\"end\":77989,\"start\":77988},{\"end\":78285,\"start\":78284},{\"end\":78293,\"start\":78292},{\"end\":78301,\"start\":78300},{\"end\":78308,\"start\":78307},{\"end\":78315,\"start\":78314},{\"end\":78620,\"start\":78619},{\"end\":78628,\"start\":78627},{\"end\":78635,\"start\":78634},{\"end\":78641,\"start\":78640},{\"end\":79005,\"start\":79001},{\"end\":79016,\"start\":79012},{\"end\":79029,\"start\":79024},{\"end\":79319,\"start\":79318},{\"end\":79326,\"start\":79325},{\"end\":79779,\"start\":79775},{\"end\":79786,\"start\":79785},{\"end\":79794,\"start\":79793},{\"end\":79803,\"start\":79802},{\"end\":79805,\"start\":79804},{\"end\":80153,\"start\":80152},{\"end\":80161,\"start\":80160},{\"end\":80168,\"start\":80167},{\"end\":80175,\"start\":80174},{\"end\":80177,\"start\":80176},{\"end\":80508,\"start\":80507},{\"end\":80519,\"start\":80518},{\"end\":80530,\"start\":80529},{\"end\":80540,\"start\":80539},{\"end\":80553,\"start\":80552},{\"end\":80562,\"start\":80561},{\"end\":80564,\"start\":80563},{\"end\":80573,\"start\":80572},{\"end\":80583,\"start\":80582},{\"end\":80976,\"start\":80975},{\"end\":80982,\"start\":80981},{\"end\":80991,\"start\":80990},{\"end\":80998,\"start\":80997},{\"end\":81450,\"start\":81446},{\"end\":81461,\"start\":81457},{\"end\":81473,\"start\":81469},{\"end\":81484,\"start\":81480},{\"end\":81903,\"start\":81902},{\"end\":81911,\"start\":81910},{\"end\":81918,\"start\":81917},{\"end\":81925,\"start\":81924},{\"end\":82350,\"start\":82349},{\"end\":82358,\"start\":82357},{\"end\":82371,\"start\":82370},{\"end\":82382,\"start\":82381},{\"end\":82785,\"start\":82781},{\"end\":82794,\"start\":82793},{\"end\":82803,\"start\":82802},{\"end\":82813,\"start\":82812},{\"end\":82823,\"start\":82822},{\"end\":82836,\"start\":82835},{\"end\":82851,\"start\":82850},{\"end\":82862,\"start\":82861},{\"end\":82877,\"start\":82876},{\"end\":82884,\"start\":82883},{\"end\":82892,\"start\":82891},{\"end\":82900,\"start\":82899},{\"end\":82915,\"start\":82914},{\"end\":70772,\"start\":70771},{\"end\":70780,\"start\":70779},{\"end\":70786,\"start\":70785},{\"end\":70794,\"start\":70793},{\"end\":71083,\"start\":71082},{\"end\":71098,\"start\":71097},{\"end\":71110,\"start\":71109},{\"end\":71450,\"start\":71449},{\"end\":71469,\"start\":71468},{\"end\":71478,\"start\":71477},{\"end\":71488,\"start\":71487},{\"end\":71816,\"start\":71815},{\"end\":71823,\"start\":71822},{\"end\":71829,\"start\":71828},{\"end\":71839,\"start\":71838},{\"end\":72372,\"start\":72371},{\"end\":72381,\"start\":72380},{\"end\":72389,\"start\":72388},{\"end\":72705,\"start\":72704},{\"end\":72718,\"start\":72717},{\"end\":72728,\"start\":72727},{\"end\":73066,\"start\":73065},{\"end\":73074,\"start\":73073},{\"end\":73313,\"start\":73312},{\"end\":73321,\"start\":73320},{\"end\":73327,\"start\":73326},{\"end\":73333,\"start\":73332},{\"end\":73335,\"start\":73334},{\"end\":73755,\"start\":73754},{\"end\":73763,\"start\":73762},{\"end\":73769,\"start\":73768},{\"end\":73777,\"start\":73776},{\"end\":74067,\"start\":74066},{\"end\":74073,\"start\":74072},{\"end\":74080,\"start\":74079},{\"end\":74088,\"start\":74087},{\"end\":74094,\"start\":74093},{\"end\":74365,\"start\":74361},{\"end\":74377,\"start\":74373},{\"end\":74389,\"start\":74385},{\"end\":74400,\"start\":74396},{\"end\":74411,\"start\":74407},{\"end\":74799,\"start\":74798},{\"end\":74806,\"start\":74805},{\"end\":74814,\"start\":74813},{\"end\":74823,\"start\":74822},{\"end\":75194,\"start\":75193},{\"end\":75203,\"start\":75202},{\"end\":75209,\"start\":75208},{\"end\":75499,\"start\":75498},{\"end\":75501,\"start\":75500},{\"end\":75512,\"start\":75511},{\"end\":75522,\"start\":75521},{\"end\":75524,\"start\":75523},{\"end\":75532,\"start\":75531},{\"end\":75541,\"start\":75540},{\"end\":75545,\"start\":75542},{\"end\":75836,\"start\":75832},{\"end\":75846,\"start\":75842},{\"end\":75857,\"start\":75853},{\"end\":75869,\"start\":75865},{\"end\":75880,\"start\":75876},{\"end\":76320,\"start\":76319},{\"end\":76327,\"start\":76326},{\"end\":76335,\"start\":76334},{\"end\":76343,\"start\":76342},{\"end\":76352,\"start\":76351},{\"end\":76359,\"start\":76358},{\"end\":76361,\"start\":76360},{\"end\":76850,\"start\":76849},{\"end\":76856,\"start\":76855},{\"end\":76862,\"start\":76861},{\"end\":76869,\"start\":76868},{\"end\":76877,\"start\":76876},{\"end\":76884,\"start\":76883},{\"end\":76892,\"start\":76891},{\"end\":77322,\"start\":77321},{\"end\":77330,\"start\":77329},{\"end\":77337,\"start\":77336},{\"end\":77344,\"start\":77343},{\"end\":77677,\"start\":77676},{\"end\":77685,\"start\":77684},{\"end\":77692,\"start\":77691},{\"end\":77972,\"start\":77971},{\"end\":77982,\"start\":77981},{\"end\":77989,\"start\":77988},{\"end\":78285,\"start\":78284},{\"end\":78293,\"start\":78292},{\"end\":78301,\"start\":78300},{\"end\":78308,\"start\":78307},{\"end\":78315,\"start\":78314},{\"end\":78620,\"start\":78619},{\"end\":78628,\"start\":78627},{\"end\":78635,\"start\":78634},{\"end\":78641,\"start\":78640},{\"end\":79005,\"start\":79001},{\"end\":79016,\"start\":79012},{\"end\":79029,\"start\":79024},{\"end\":79319,\"start\":79318},{\"end\":79326,\"start\":79325},{\"end\":79779,\"start\":79775},{\"end\":79786,\"start\":79785},{\"end\":79794,\"start\":79793},{\"end\":79803,\"start\":79802},{\"end\":79805,\"start\":79804},{\"end\":80153,\"start\":80152},{\"end\":80161,\"start\":80160},{\"end\":80168,\"start\":80167},{\"end\":80175,\"start\":80174},{\"end\":80177,\"start\":80176},{\"end\":80508,\"start\":80507},{\"end\":80519,\"start\":80518},{\"end\":80530,\"start\":80529},{\"end\":80540,\"start\":80539},{\"end\":80553,\"start\":80552},{\"end\":80562,\"start\":80561},{\"end\":80564,\"start\":80563},{\"end\":80573,\"start\":80572},{\"end\":80583,\"start\":80582},{\"end\":80976,\"start\":80975},{\"end\":80982,\"start\":80981},{\"end\":80991,\"start\":80990},{\"end\":80998,\"start\":80997},{\"end\":81450,\"start\":81446},{\"end\":81461,\"start\":81457},{\"end\":81473,\"start\":81469},{\"end\":81484,\"start\":81480},{\"end\":81903,\"start\":81902},{\"end\":81911,\"start\":81910},{\"end\":81918,\"start\":81917},{\"end\":81925,\"start\":81924},{\"end\":82350,\"start\":82349},{\"end\":82358,\"start\":82357},{\"end\":82371,\"start\":82370},{\"end\":82382,\"start\":82381},{\"end\":82785,\"start\":82781},{\"end\":82794,\"start\":82793},{\"end\":82803,\"start\":82802},{\"end\":82813,\"start\":82812},{\"end\":82823,\"start\":82822},{\"end\":82836,\"start\":82835},{\"end\":82851,\"start\":82850},{\"end\":82862,\"start\":82861},{\"end\":82877,\"start\":82876},{\"end\":82884,\"start\":82883},{\"end\":82892,\"start\":82891},{\"end\":82900,\"start\":82899},{\"end\":82915,\"start\":82914}]", "bib_author_last_name": "[{\"end\":70777,\"start\":70773},{\"end\":70783,\"start\":70781},{\"end\":70791,\"start\":70787},{\"end\":70797,\"start\":70795},{\"end\":71095,\"start\":71084},{\"end\":71107,\"start\":71099},{\"end\":71121,\"start\":71111},{\"end\":71466,\"start\":71451},{\"end\":71475,\"start\":71470},{\"end\":71485,\"start\":71479},{\"end\":71495,\"start\":71489},{\"end\":71820,\"start\":71817},{\"end\":71826,\"start\":71824},{\"end\":71836,\"start\":71830},{\"end\":71852,\"start\":71840},{\"end\":72378,\"start\":72373},{\"end\":72386,\"start\":72382},{\"end\":72394,\"start\":72390},{\"end\":72715,\"start\":72706},{\"end\":72725,\"start\":72719},{\"end\":72736,\"start\":72729},{\"end\":73071,\"start\":73067},{\"end\":73077,\"start\":73075},{\"end\":73318,\"start\":73314},{\"end\":73324,\"start\":73322},{\"end\":73330,\"start\":73328},{\"end\":73338,\"start\":73336},{\"end\":73760,\"start\":73756},{\"end\":73766,\"start\":73764},{\"end\":73774,\"start\":73770},{\"end\":73782,\"start\":73778},{\"end\":74070,\"start\":74068},{\"end\":74077,\"start\":74074},{\"end\":74085,\"start\":74081},{\"end\":74091,\"start\":74089},{\"end\":74097,\"start\":74095},{\"end\":74371,\"start\":74366},{\"end\":74383,\"start\":74378},{\"end\":74394,\"start\":74390},{\"end\":74405,\"start\":74401},{\"end\":74417,\"start\":74412},{\"end\":74803,\"start\":74800},{\"end\":74811,\"start\":74807},{\"end\":74820,\"start\":74815},{\"end\":74828,\"start\":74824},{\"end\":75200,\"start\":75195},{\"end\":75206,\"start\":75204},{\"end\":75214,\"start\":75210},{\"end\":75509,\"start\":75502},{\"end\":75519,\"start\":75513},{\"end\":75529,\"start\":75525},{\"end\":75538,\"start\":75533},{\"end\":75550,\"start\":75546},{\"end\":75840,\"start\":75837},{\"end\":75851,\"start\":75847},{\"end\":75863,\"start\":75858},{\"end\":75874,\"start\":75870},{\"end\":75886,\"start\":75881},{\"end\":76324,\"start\":76321},{\"end\":76332,\"start\":76328},{\"end\":76340,\"start\":76336},{\"end\":76349,\"start\":76344},{\"end\":76356,\"start\":76353},{\"end\":76368,\"start\":76362},{\"end\":76853,\"start\":76851},{\"end\":76859,\"start\":76857},{\"end\":76866,\"start\":76863},{\"end\":76874,\"start\":76870},{\"end\":76881,\"start\":76878},{\"end\":76889,\"start\":76885},{\"end\":76895,\"start\":76893},{\"end\":77327,\"start\":77323},{\"end\":77334,\"start\":77331},{\"end\":77341,\"start\":77338},{\"end\":77351,\"start\":77345},{\"end\":77682,\"start\":77678},{\"end\":77689,\"start\":77686},{\"end\":77696,\"start\":77693},{\"end\":77979,\"start\":77973},{\"end\":77986,\"start\":77983},{\"end\":77998,\"start\":77990},{\"end\":78290,\"start\":78286},{\"end\":78298,\"start\":78294},{\"end\":78305,\"start\":78302},{\"end\":78312,\"start\":78309},{\"end\":78319,\"start\":78316},{\"end\":78625,\"start\":78621},{\"end\":78632,\"start\":78629},{\"end\":78638,\"start\":78636},{\"end\":78645,\"start\":78642},{\"end\":79010,\"start\":79006},{\"end\":79022,\"start\":79017},{\"end\":79032,\"start\":79030},{\"end\":79323,\"start\":79320},{\"end\":79337,\"start\":79327},{\"end\":79783,\"start\":79780},{\"end\":79791,\"start\":79787},{\"end\":79800,\"start\":79795},{\"end\":79811,\"start\":79806},{\"end\":80158,\"start\":80154},{\"end\":80165,\"start\":80162},{\"end\":80172,\"start\":80169},{\"end\":80180,\"start\":80178},{\"end\":80516,\"start\":80509},{\"end\":80527,\"start\":80520},{\"end\":80537,\"start\":80531},{\"end\":80550,\"start\":80541},{\"end\":80559,\"start\":80554},{\"end\":80570,\"start\":80565},{\"end\":80580,\"start\":80574},{\"end\":80594,\"start\":80584},{\"end\":80979,\"start\":80977},{\"end\":80988,\"start\":80983},{\"end\":80995,\"start\":80992},{\"end\":81002,\"start\":80999},{\"end\":81455,\"start\":81451},{\"end\":81467,\"start\":81462},{\"end\":81478,\"start\":81474},{\"end\":81489,\"start\":81485},{\"end\":81908,\"start\":81904},{\"end\":81915,\"start\":81912},{\"end\":81922,\"start\":81919},{\"end\":81932,\"start\":81926},{\"end\":82355,\"start\":82351},{\"end\":82368,\"start\":82359},{\"end\":82379,\"start\":82372},{\"end\":82389,\"start\":82383},{\"end\":82791,\"start\":82786},{\"end\":82800,\"start\":82795},{\"end\":82810,\"start\":82804},{\"end\":82820,\"start\":82814},{\"end\":82833,\"start\":82824},{\"end\":82848,\"start\":82837},{\"end\":82859,\"start\":82852},{\"end\":82874,\"start\":82863},{\"end\":82881,\"start\":82878},{\"end\":82889,\"start\":82885},{\"end\":82897,\"start\":82893},{\"end\":82912,\"start\":82901},{\"end\":82921,\"start\":82916},{\"end\":82928,\"start\":82923},{\"end\":70777,\"start\":70773},{\"end\":70783,\"start\":70781},{\"end\":70791,\"start\":70787},{\"end\":70797,\"start\":70795},{\"end\":71095,\"start\":71084},{\"end\":71107,\"start\":71099},{\"end\":71121,\"start\":71111},{\"end\":71466,\"start\":71451},{\"end\":71475,\"start\":71470},{\"end\":71485,\"start\":71479},{\"end\":71495,\"start\":71489},{\"end\":71820,\"start\":71817},{\"end\":71826,\"start\":71824},{\"end\":71836,\"start\":71830},{\"end\":71852,\"start\":71840},{\"end\":72378,\"start\":72373},{\"end\":72386,\"start\":72382},{\"end\":72394,\"start\":72390},{\"end\":72715,\"start\":72706},{\"end\":72725,\"start\":72719},{\"end\":72736,\"start\":72729},{\"end\":73071,\"start\":73067},{\"end\":73077,\"start\":73075},{\"end\":73318,\"start\":73314},{\"end\":73324,\"start\":73322},{\"end\":73330,\"start\":73328},{\"end\":73338,\"start\":73336},{\"end\":73760,\"start\":73756},{\"end\":73766,\"start\":73764},{\"end\":73774,\"start\":73770},{\"end\":73782,\"start\":73778},{\"end\":74070,\"start\":74068},{\"end\":74077,\"start\":74074},{\"end\":74085,\"start\":74081},{\"end\":74091,\"start\":74089},{\"end\":74097,\"start\":74095},{\"end\":74371,\"start\":74366},{\"end\":74383,\"start\":74378},{\"end\":74394,\"start\":74390},{\"end\":74405,\"start\":74401},{\"end\":74417,\"start\":74412},{\"end\":74803,\"start\":74800},{\"end\":74811,\"start\":74807},{\"end\":74820,\"start\":74815},{\"end\":74828,\"start\":74824},{\"end\":75200,\"start\":75195},{\"end\":75206,\"start\":75204},{\"end\":75214,\"start\":75210},{\"end\":75509,\"start\":75502},{\"end\":75519,\"start\":75513},{\"end\":75529,\"start\":75525},{\"end\":75538,\"start\":75533},{\"end\":75550,\"start\":75546},{\"end\":75840,\"start\":75837},{\"end\":75851,\"start\":75847},{\"end\":75863,\"start\":75858},{\"end\":75874,\"start\":75870},{\"end\":75886,\"start\":75881},{\"end\":76324,\"start\":76321},{\"end\":76332,\"start\":76328},{\"end\":76340,\"start\":76336},{\"end\":76349,\"start\":76344},{\"end\":76356,\"start\":76353},{\"end\":76368,\"start\":76362},{\"end\":76853,\"start\":76851},{\"end\":76859,\"start\":76857},{\"end\":76866,\"start\":76863},{\"end\":76874,\"start\":76870},{\"end\":76881,\"start\":76878},{\"end\":76889,\"start\":76885},{\"end\":76895,\"start\":76893},{\"end\":77327,\"start\":77323},{\"end\":77334,\"start\":77331},{\"end\":77341,\"start\":77338},{\"end\":77351,\"start\":77345},{\"end\":77682,\"start\":77678},{\"end\":77689,\"start\":77686},{\"end\":77696,\"start\":77693},{\"end\":77979,\"start\":77973},{\"end\":77986,\"start\":77983},{\"end\":77998,\"start\":77990},{\"end\":78290,\"start\":78286},{\"end\":78298,\"start\":78294},{\"end\":78305,\"start\":78302},{\"end\":78312,\"start\":78309},{\"end\":78319,\"start\":78316},{\"end\":78625,\"start\":78621},{\"end\":78632,\"start\":78629},{\"end\":78638,\"start\":78636},{\"end\":78645,\"start\":78642},{\"end\":79010,\"start\":79006},{\"end\":79022,\"start\":79017},{\"end\":79032,\"start\":79030},{\"end\":79323,\"start\":79320},{\"end\":79337,\"start\":79327},{\"end\":79783,\"start\":79780},{\"end\":79791,\"start\":79787},{\"end\":79800,\"start\":79795},{\"end\":79811,\"start\":79806},{\"end\":80158,\"start\":80154},{\"end\":80165,\"start\":80162},{\"end\":80172,\"start\":80169},{\"end\":80180,\"start\":80178},{\"end\":80516,\"start\":80509},{\"end\":80527,\"start\":80520},{\"end\":80537,\"start\":80531},{\"end\":80550,\"start\":80541},{\"end\":80559,\"start\":80554},{\"end\":80570,\"start\":80565},{\"end\":80580,\"start\":80574},{\"end\":80594,\"start\":80584},{\"end\":80979,\"start\":80977},{\"end\":80988,\"start\":80983},{\"end\":80995,\"start\":80992},{\"end\":81002,\"start\":80999},{\"end\":81455,\"start\":81451},{\"end\":81467,\"start\":81462},{\"end\":81478,\"start\":81474},{\"end\":81489,\"start\":81485},{\"end\":81908,\"start\":81904},{\"end\":81915,\"start\":81912},{\"end\":81922,\"start\":81919},{\"end\":81932,\"start\":81926},{\"end\":82355,\"start\":82351},{\"end\":82368,\"start\":82359},{\"end\":82379,\"start\":82372},{\"end\":82389,\"start\":82383},{\"end\":82791,\"start\":82786},{\"end\":82800,\"start\":82795},{\"end\":82810,\"start\":82804},{\"end\":82820,\"start\":82814},{\"end\":82833,\"start\":82824},{\"end\":82848,\"start\":82837},{\"end\":82859,\"start\":82852},{\"end\":82874,\"start\":82863},{\"end\":82881,\"start\":82878},{\"end\":82889,\"start\":82885},{\"end\":82897,\"start\":82893},{\"end\":82912,\"start\":82901},{\"end\":82921,\"start\":82916},{\"end\":82928,\"start\":82923}]", "bib_entry": "[{\"attributes\":{\"id\":\"b0\",\"matched_paper_id\":3490063},\"end\":70988,\"start\":70662},{\"attributes\":{\"id\":\"b1\",\"matched_paper_id\":240245174},\"end\":71325,\"start\":70990},{\"attributes\":{\"id\":\"b2\",\"matched_paper_id\":3596675},\"end\":71720,\"start\":71327},{\"attributes\":{\"id\":\"b3\",\"matched_paper_id\":232305632},\"end\":72270,\"start\":71722},{\"attributes\":{\"id\":\"b4\",\"matched_paper_id\":52302617},\"end\":72571,\"start\":72272},{\"attributes\":{\"id\":\"b5\",\"matched_paper_id\":207956274},\"end\":72961,\"start\":72573},{\"attributes\":{\"id\":\"b6\",\"matched_paper_id\":235749591},\"end\":73261,\"start\":72963},{\"attributes\":{\"id\":\"b7\",\"matched_paper_id\":17707797},\"end\":73671,\"start\":73263},{\"attributes\":{\"id\":\"b8\",\"matched_paper_id\":22830835},\"end\":73990,\"start\":73673},{\"attributes\":{\"id\":\"b9\",\"matched_paper_id\":49270058},\"end\":74278,\"start\":73992},{\"attributes\":{\"id\":\"b10\",\"matched_paper_id\":207959805},\"end\":74728,\"start\":74280},{\"attributes\":{\"id\":\"b11\",\"matched_paper_id\":211126789},\"end\":75097,\"start\":74730},{\"attributes\":{\"id\":\"b12\",\"matched_paper_id\":214267361},\"end\":75425,\"start\":75099},{\"attributes\":{\"id\":\"b13\",\"matched_paper_id\":224888195},\"end\":75736,\"start\":75427},{\"attributes\":{\"id\":\"b14\",\"matched_paper_id\":235454592},\"end\":76208,\"start\":75738},{\"attributes\":{\"id\":\"b15\",\"matched_paper_id\":51878011},\"end\":76735,\"start\":76210},{\"attributes\":{\"id\":\"b16\",\"matched_paper_id\":4886650},\"end\":77243,\"start\":76737},{\"attributes\":{\"id\":\"b17\",\"matched_paper_id\":2098713},\"end\":77594,\"start\":77245},{\"attributes\":{\"id\":\"b18\",\"matched_paper_id\":14433451},\"end\":77912,\"start\":77596},{\"attributes\":{\"id\":\"b19\",\"matched_paper_id\":32739468},\"end\":78222,\"start\":77914},{\"attributes\":{\"id\":\"b20\",\"matched_paper_id\":236571165},\"end\":78538,\"start\":78224},{\"attributes\":{\"id\":\"b21\",\"matched_paper_id\":201876701},\"end\":78871,\"start\":78540},{\"attributes\":{\"id\":\"b22\",\"matched_paper_id\":245376597},\"end\":79247,\"start\":78873},{\"attributes\":{\"id\":\"b23\",\"matched_paper_id\":244272511},\"end\":79692,\"start\":79249},{\"attributes\":{\"id\":\"b24\",\"matched_paper_id\":195944196},\"end\":80130,\"start\":79694},{\"attributes\":{\"id\":\"b25\",\"matched_paper_id\":214623169},\"end\":80478,\"start\":80132},{\"attributes\":{\"id\":\"b26\",\"matched_paper_id\":13756489},\"end\":80927,\"start\":80480},{\"attributes\":{\"id\":\"b27\",\"matched_paper_id\":206594692},\"end\":81330,\"start\":80929},{\"attributes\":{\"id\":\"b28\",\"matched_paper_id\":251847925},\"end\":81819,\"start\":81332},{\"attributes\":{\"id\":\"b29\",\"matched_paper_id\":15521212},\"end\":82276,\"start\":81821},{\"attributes\":{\"id\":\"b30\",\"matched_paper_id\":211096730},\"end\":82708,\"start\":82278},{\"attributes\":{\"id\":\"b31\",\"matched_paper_id\":219687798},\"end\":83402,\"start\":82710},{\"attributes\":{\"id\":\"b0\",\"matched_paper_id\":3490063},\"end\":70988,\"start\":70662},{\"attributes\":{\"id\":\"b1\",\"matched_paper_id\":240245174},\"end\":71325,\"start\":70990},{\"attributes\":{\"id\":\"b2\",\"matched_paper_id\":3596675},\"end\":71720,\"start\":71327},{\"attributes\":{\"id\":\"b3\",\"matched_paper_id\":232305632},\"end\":72270,\"start\":71722},{\"attributes\":{\"id\":\"b4\",\"matched_paper_id\":52302617},\"end\":72571,\"start\":72272},{\"attributes\":{\"id\":\"b5\",\"matched_paper_id\":207956274},\"end\":72961,\"start\":72573},{\"attributes\":{\"id\":\"b6\",\"matched_paper_id\":235749591},\"end\":73261,\"start\":72963},{\"attributes\":{\"id\":\"b7\",\"matched_paper_id\":17707797},\"end\":73671,\"start\":73263},{\"attributes\":{\"id\":\"b8\",\"matched_paper_id\":22830835},\"end\":73990,\"start\":73673},{\"attributes\":{\"id\":\"b9\",\"matched_paper_id\":49270058},\"end\":74278,\"start\":73992},{\"attributes\":{\"id\":\"b10\",\"matched_paper_id\":207959805},\"end\":74728,\"start\":74280},{\"attributes\":{\"id\":\"b11\",\"matched_paper_id\":211126789},\"end\":75097,\"start\":74730},{\"attributes\":{\"id\":\"b12\",\"matched_paper_id\":214267361},\"end\":75425,\"start\":75099},{\"attributes\":{\"id\":\"b13\",\"matched_paper_id\":224888195},\"end\":75736,\"start\":75427},{\"attributes\":{\"id\":\"b14\",\"matched_paper_id\":235454592},\"end\":76208,\"start\":75738},{\"attributes\":{\"id\":\"b15\",\"matched_paper_id\":51878011},\"end\":76735,\"start\":76210},{\"attributes\":{\"id\":\"b16\",\"matched_paper_id\":4886650},\"end\":77243,\"start\":76737},{\"attributes\":{\"id\":\"b17\",\"matched_paper_id\":2098713},\"end\":77594,\"start\":77245},{\"attributes\":{\"id\":\"b18\",\"matched_paper_id\":14433451},\"end\":77912,\"start\":77596},{\"attributes\":{\"id\":\"b19\",\"matched_paper_id\":32739468},\"end\":78222,\"start\":77914},{\"attributes\":{\"id\":\"b20\",\"matched_paper_id\":236571165},\"end\":78538,\"start\":78224},{\"attributes\":{\"id\":\"b21\",\"matched_paper_id\":201876701},\"end\":78871,\"start\":78540},{\"attributes\":{\"id\":\"b22\",\"matched_paper_id\":245376597},\"end\":79247,\"start\":78873},{\"attributes\":{\"id\":\"b23\",\"matched_paper_id\":244272511},\"end\":79692,\"start\":79249},{\"attributes\":{\"id\":\"b24\",\"matched_paper_id\":195944196},\"end\":80130,\"start\":79694},{\"attributes\":{\"id\":\"b25\",\"matched_paper_id\":214623169},\"end\":80478,\"start\":80132},{\"attributes\":{\"id\":\"b26\",\"matched_paper_id\":13756489},\"end\":80927,\"start\":80480},{\"attributes\":{\"id\":\"b27\",\"matched_paper_id\":206594692},\"end\":81330,\"start\":80929},{\"attributes\":{\"id\":\"b28\",\"matched_paper_id\":251847925},\"end\":81819,\"start\":81332},{\"attributes\":{\"id\":\"b29\",\"matched_paper_id\":15521212},\"end\":82276,\"start\":81821},{\"attributes\":{\"id\":\"b30\",\"matched_paper_id\":211096730},\"end\":82708,\"start\":82278},{\"attributes\":{\"id\":\"b31\",\"matched_paper_id\":219687798},\"end\":83402,\"start\":82710}]", "bib_title": "[{\"end\":70769,\"start\":70662},{\"end\":71080,\"start\":70990},{\"end\":71447,\"start\":71327},{\"end\":71813,\"start\":71722},{\"end\":72369,\"start\":72272},{\"end\":72702,\"start\":72573},{\"end\":73063,\"start\":72963},{\"end\":73310,\"start\":73263},{\"end\":73752,\"start\":73673},{\"end\":74064,\"start\":73992},{\"end\":74359,\"start\":74280},{\"end\":74796,\"start\":74730},{\"end\":75191,\"start\":75099},{\"end\":75496,\"start\":75427},{\"end\":75830,\"start\":75738},{\"end\":76317,\"start\":76210},{\"end\":76847,\"start\":76737},{\"end\":77319,\"start\":77245},{\"end\":77674,\"start\":77596},{\"end\":77969,\"start\":77914},{\"end\":78282,\"start\":78224},{\"end\":78617,\"start\":78540},{\"end\":78999,\"start\":78873},{\"end\":79316,\"start\":79249},{\"end\":79773,\"start\":79694},{\"end\":80150,\"start\":80132},{\"end\":80505,\"start\":80480},{\"end\":80973,\"start\":80929},{\"end\":81444,\"start\":81332},{\"end\":81900,\"start\":81821},{\"end\":82347,\"start\":82278},{\"end\":82779,\"start\":82710},{\"end\":70769,\"start\":70662},{\"end\":71080,\"start\":70990},{\"end\":71447,\"start\":71327},{\"end\":71813,\"start\":71722},{\"end\":72369,\"start\":72272},{\"end\":72702,\"start\":72573},{\"end\":73063,\"start\":72963},{\"end\":73310,\"start\":73263},{\"end\":73752,\"start\":73673},{\"end\":74064,\"start\":73992},{\"end\":74359,\"start\":74280},{\"end\":74796,\"start\":74730},{\"end\":75191,\"start\":75099},{\"end\":75496,\"start\":75427},{\"end\":75830,\"start\":75738},{\"end\":76317,\"start\":76210},{\"end\":76847,\"start\":76737},{\"end\":77319,\"start\":77245},{\"end\":77674,\"start\":77596},{\"end\":77969,\"start\":77914},{\"end\":78282,\"start\":78224},{\"end\":78617,\"start\":78540},{\"end\":78999,\"start\":78873},{\"end\":79316,\"start\":79249},{\"end\":79773,\"start\":79694},{\"end\":80150,\"start\":80132},{\"end\":80505,\"start\":80480},{\"end\":80973,\"start\":80929},{\"end\":81444,\"start\":81332},{\"end\":81900,\"start\":81821},{\"end\":82347,\"start\":82278},{\"end\":82779,\"start\":82710}]", "bib_author": "[{\"end\":70779,\"start\":70771},{\"end\":70785,\"start\":70779},{\"end\":70793,\"start\":70785},{\"end\":70799,\"start\":70793},{\"end\":71097,\"start\":71082},{\"end\":71109,\"start\":71097},{\"end\":71123,\"start\":71109},{\"end\":71468,\"start\":71449},{\"end\":71477,\"start\":71468},{\"end\":71487,\"start\":71477},{\"end\":71497,\"start\":71487},{\"end\":71822,\"start\":71815},{\"end\":71828,\"start\":71822},{\"end\":71838,\"start\":71828},{\"end\":71854,\"start\":71838},{\"end\":72380,\"start\":72371},{\"end\":72388,\"start\":72380},{\"end\":72396,\"start\":72388},{\"end\":72717,\"start\":72704},{\"end\":72727,\"start\":72717},{\"end\":72738,\"start\":72727},{\"end\":73073,\"start\":73065},{\"end\":73079,\"start\":73073},{\"end\":73320,\"start\":73312},{\"end\":73326,\"start\":73320},{\"end\":73332,\"start\":73326},{\"end\":73340,\"start\":73332},{\"end\":73762,\"start\":73754},{\"end\":73768,\"start\":73762},{\"end\":73776,\"start\":73768},{\"end\":73784,\"start\":73776},{\"end\":74072,\"start\":74066},{\"end\":74079,\"start\":74072},{\"end\":74087,\"start\":74079},{\"end\":74093,\"start\":74087},{\"end\":74099,\"start\":74093},{\"end\":74373,\"start\":74361},{\"end\":74385,\"start\":74373},{\"end\":74396,\"start\":74385},{\"end\":74407,\"start\":74396},{\"end\":74419,\"start\":74407},{\"end\":74805,\"start\":74798},{\"end\":74813,\"start\":74805},{\"end\":74822,\"start\":74813},{\"end\":74830,\"start\":74822},{\"end\":75202,\"start\":75193},{\"end\":75208,\"start\":75202},{\"end\":75216,\"start\":75208},{\"end\":75511,\"start\":75498},{\"end\":75521,\"start\":75511},{\"end\":75531,\"start\":75521},{\"end\":75540,\"start\":75531},{\"end\":75552,\"start\":75540},{\"end\":75842,\"start\":75832},{\"end\":75853,\"start\":75842},{\"end\":75865,\"start\":75853},{\"end\":75876,\"start\":75865},{\"end\":75888,\"start\":75876},{\"end\":76326,\"start\":76319},{\"end\":76334,\"start\":76326},{\"end\":76342,\"start\":76334},{\"end\":76351,\"start\":76342},{\"end\":76358,\"start\":76351},{\"end\":76370,\"start\":76358},{\"end\":76855,\"start\":76849},{\"end\":76861,\"start\":76855},{\"end\":76868,\"start\":76861},{\"end\":76876,\"start\":76868},{\"end\":76883,\"start\":76876},{\"end\":76891,\"start\":76883},{\"end\":76897,\"start\":76891},{\"end\":77329,\"start\":77321},{\"end\":77336,\"start\":77329},{\"end\":77343,\"start\":77336},{\"end\":77353,\"start\":77343},{\"end\":77684,\"start\":77676},{\"end\":77691,\"start\":77684},{\"end\":77698,\"start\":77691},{\"end\":77981,\"start\":77971},{\"end\":77988,\"start\":77981},{\"end\":78000,\"start\":77988},{\"end\":78292,\"start\":78284},{\"end\":78300,\"start\":78292},{\"end\":78307,\"start\":78300},{\"end\":78314,\"start\":78307},{\"end\":78321,\"start\":78314},{\"end\":78627,\"start\":78619},{\"end\":78634,\"start\":78627},{\"end\":78640,\"start\":78634},{\"end\":78647,\"start\":78640},{\"end\":79012,\"start\":79001},{\"end\":79024,\"start\":79012},{\"end\":79034,\"start\":79024},{\"end\":79325,\"start\":79318},{\"end\":79339,\"start\":79325},{\"end\":79785,\"start\":79775},{\"end\":79793,\"start\":79785},{\"end\":79802,\"start\":79793},{\"end\":79813,\"start\":79802},{\"end\":80160,\"start\":80152},{\"end\":80167,\"start\":80160},{\"end\":80174,\"start\":80167},{\"end\":80182,\"start\":80174},{\"end\":80518,\"start\":80507},{\"end\":80529,\"start\":80518},{\"end\":80539,\"start\":80529},{\"end\":80552,\"start\":80539},{\"end\":80561,\"start\":80552},{\"end\":80572,\"start\":80561},{\"end\":80582,\"start\":80572},{\"end\":80596,\"start\":80582},{\"end\":80981,\"start\":80975},{\"end\":80990,\"start\":80981},{\"end\":80997,\"start\":80990},{\"end\":81004,\"start\":80997},{\"end\":81457,\"start\":81446},{\"end\":81469,\"start\":81457},{\"end\":81480,\"start\":81469},{\"end\":81491,\"start\":81480},{\"end\":81910,\"start\":81902},{\"end\":81917,\"start\":81910},{\"end\":81924,\"start\":81917},{\"end\":81934,\"start\":81924},{\"end\":82357,\"start\":82349},{\"end\":82370,\"start\":82357},{\"end\":82381,\"start\":82370},{\"end\":82391,\"start\":82381},{\"end\":82793,\"start\":82781},{\"end\":82802,\"start\":82793},{\"end\":82812,\"start\":82802},{\"end\":82822,\"start\":82812},{\"end\":82835,\"start\":82822},{\"end\":82850,\"start\":82835},{\"end\":82861,\"start\":82850},{\"end\":82876,\"start\":82861},{\"end\":82883,\"start\":82876},{\"end\":82891,\"start\":82883},{\"end\":82899,\"start\":82891},{\"end\":82914,\"start\":82899},{\"end\":82923,\"start\":82914},{\"end\":82930,\"start\":82923},{\"end\":70779,\"start\":70771},{\"end\":70785,\"start\":70779},{\"end\":70793,\"start\":70785},{\"end\":70799,\"start\":70793},{\"end\":71097,\"start\":71082},{\"end\":71109,\"start\":71097},{\"end\":71123,\"start\":71109},{\"end\":71468,\"start\":71449},{\"end\":71477,\"start\":71468},{\"end\":71487,\"start\":71477},{\"end\":71497,\"start\":71487},{\"end\":71822,\"start\":71815},{\"end\":71828,\"start\":71822},{\"end\":71838,\"start\":71828},{\"end\":71854,\"start\":71838},{\"end\":72380,\"start\":72371},{\"end\":72388,\"start\":72380},{\"end\":72396,\"start\":72388},{\"end\":72717,\"start\":72704},{\"end\":72727,\"start\":72717},{\"end\":72738,\"start\":72727},{\"end\":73073,\"start\":73065},{\"end\":73079,\"start\":73073},{\"end\":73320,\"start\":73312},{\"end\":73326,\"start\":73320},{\"end\":73332,\"start\":73326},{\"end\":73340,\"start\":73332},{\"end\":73762,\"start\":73754},{\"end\":73768,\"start\":73762},{\"end\":73776,\"start\":73768},{\"end\":73784,\"start\":73776},{\"end\":74072,\"start\":74066},{\"end\":74079,\"start\":74072},{\"end\":74087,\"start\":74079},{\"end\":74093,\"start\":74087},{\"end\":74099,\"start\":74093},{\"end\":74373,\"start\":74361},{\"end\":74385,\"start\":74373},{\"end\":74396,\"start\":74385},{\"end\":74407,\"start\":74396},{\"end\":74419,\"start\":74407},{\"end\":74805,\"start\":74798},{\"end\":74813,\"start\":74805},{\"end\":74822,\"start\":74813},{\"end\":74830,\"start\":74822},{\"end\":75202,\"start\":75193},{\"end\":75208,\"start\":75202},{\"end\":75216,\"start\":75208},{\"end\":75511,\"start\":75498},{\"end\":75521,\"start\":75511},{\"end\":75531,\"start\":75521},{\"end\":75540,\"start\":75531},{\"end\":75552,\"start\":75540},{\"end\":75842,\"start\":75832},{\"end\":75853,\"start\":75842},{\"end\":75865,\"start\":75853},{\"end\":75876,\"start\":75865},{\"end\":75888,\"start\":75876},{\"end\":76326,\"start\":76319},{\"end\":76334,\"start\":76326},{\"end\":76342,\"start\":76334},{\"end\":76351,\"start\":76342},{\"end\":76358,\"start\":76351},{\"end\":76370,\"start\":76358},{\"end\":76855,\"start\":76849},{\"end\":76861,\"start\":76855},{\"end\":76868,\"start\":76861},{\"end\":76876,\"start\":76868},{\"end\":76883,\"start\":76876},{\"end\":76891,\"start\":76883},{\"end\":76897,\"start\":76891},{\"end\":77329,\"start\":77321},{\"end\":77336,\"start\":77329},{\"end\":77343,\"start\":77336},{\"end\":77353,\"start\":77343},{\"end\":77684,\"start\":77676},{\"end\":77691,\"start\":77684},{\"end\":77698,\"start\":77691},{\"end\":77981,\"start\":77971},{\"end\":77988,\"start\":77981},{\"end\":78000,\"start\":77988},{\"end\":78292,\"start\":78284},{\"end\":78300,\"start\":78292},{\"end\":78307,\"start\":78300},{\"end\":78314,\"start\":78307},{\"end\":78321,\"start\":78314},{\"end\":78627,\"start\":78619},{\"end\":78634,\"start\":78627},{\"end\":78640,\"start\":78634},{\"end\":78647,\"start\":78640},{\"end\":79012,\"start\":79001},{\"end\":79024,\"start\":79012},{\"end\":79034,\"start\":79024},{\"end\":79325,\"start\":79318},{\"end\":79339,\"start\":79325},{\"end\":79785,\"start\":79775},{\"end\":79793,\"start\":79785},{\"end\":79802,\"start\":79793},{\"end\":79813,\"start\":79802},{\"end\":80160,\"start\":80152},{\"end\":80167,\"start\":80160},{\"end\":80174,\"start\":80167},{\"end\":80182,\"start\":80174},{\"end\":80518,\"start\":80507},{\"end\":80529,\"start\":80518},{\"end\":80539,\"start\":80529},{\"end\":80552,\"start\":80539},{\"end\":80561,\"start\":80552},{\"end\":80572,\"start\":80561},{\"end\":80582,\"start\":80572},{\"end\":80596,\"start\":80582},{\"end\":80981,\"start\":80975},{\"end\":80990,\"start\":80981},{\"end\":80997,\"start\":80990},{\"end\":81004,\"start\":80997},{\"end\":81457,\"start\":81446},{\"end\":81469,\"start\":81457},{\"end\":81480,\"start\":81469},{\"end\":81491,\"start\":81480},{\"end\":81910,\"start\":81902},{\"end\":81917,\"start\":81910},{\"end\":81924,\"start\":81917},{\"end\":81934,\"start\":81924},{\"end\":82357,\"start\":82349},{\"end\":82370,\"start\":82357},{\"end\":82381,\"start\":82370},{\"end\":82391,\"start\":82381},{\"end\":82793,\"start\":82781},{\"end\":82802,\"start\":82793},{\"end\":82812,\"start\":82802},{\"end\":82822,\"start\":82812},{\"end\":82835,\"start\":82822},{\"end\":82850,\"start\":82835},{\"end\":82861,\"start\":82850},{\"end\":82876,\"start\":82861},{\"end\":82883,\"start\":82876},{\"end\":82891,\"start\":82883},{\"end\":82899,\"start\":82891},{\"end\":82914,\"start\":82899},{\"end\":82923,\"start\":82914},{\"end\":82930,\"start\":82923}]", "bib_venue": "[{\"end\":72015,\"start\":71943},{\"end\":73485,\"start\":73421},{\"end\":74508,\"start\":74472},{\"end\":75977,\"start\":75941},{\"end\":76481,\"start\":76434},{\"end\":79490,\"start\":79423},{\"end\":79926,\"start\":79878},{\"end\":80315,\"start\":80257},{\"end\":80711,\"start\":80662},{\"end\":81145,\"start\":81083},{\"end\":81580,\"start\":81544},{\"end\":82059,\"start\":82005},{\"end\":82496,\"start\":82452},{\"end\":83045,\"start\":82996},{\"end\":72015,\"start\":71943},{\"end\":73485,\"start\":73421},{\"end\":74508,\"start\":74472},{\"end\":75977,\"start\":75941},{\"end\":76481,\"start\":76434},{\"end\":79490,\"start\":79423},{\"end\":79926,\"start\":79878},{\"end\":80315,\"start\":80257},{\"end\":80711,\"start\":80662},{\"end\":81145,\"start\":81083},{\"end\":81580,\"start\":81544},{\"end\":82059,\"start\":82005},{\"end\":82496,\"start\":82452},{\"end\":83045,\"start\":82996},{\"end\":70806,\"start\":70799},{\"end\":71142,\"start\":71123},{\"end\":71504,\"start\":71497},{\"end\":71941,\"start\":71854},{\"end\":72403,\"start\":72396},{\"end\":72751,\"start\":72738},{\"end\":73090,\"start\":73079},{\"end\":73419,\"start\":73340},{\"end\":73804,\"start\":73784},{\"end\":74110,\"start\":74099},{\"end\":74470,\"start\":74419},{\"end\":74887,\"start\":74830},{\"end\":75236,\"start\":75216},{\"end\":75563,\"start\":75552},{\"end\":75939,\"start\":75888},{\"end\":76432,\"start\":76370},{\"end\":76963,\"start\":76897},{\"end\":77394,\"start\":77353},{\"end\":77729,\"start\":77698},{\"end\":78044,\"start\":78000},{\"end\":78352,\"start\":78321},{\"end\":78678,\"start\":78647},{\"end\":79041,\"start\":79034},{\"end\":79421,\"start\":79339},{\"end\":79876,\"start\":79813},{\"end\":80255,\"start\":80182},{\"end\":80660,\"start\":80596},{\"end\":81081,\"start\":81004},{\"end\":81542,\"start\":81491},{\"end\":82003,\"start\":81934},{\"end\":82450,\"start\":82391},{\"end\":82994,\"start\":82930},{\"end\":70806,\"start\":70799},{\"end\":71142,\"start\":71123},{\"end\":71504,\"start\":71497},{\"end\":71941,\"start\":71854},{\"end\":72403,\"start\":72396},{\"end\":72751,\"start\":72738},{\"end\":73090,\"start\":73079},{\"end\":73419,\"start\":73340},{\"end\":73804,\"start\":73784},{\"end\":74110,\"start\":74099},{\"end\":74470,\"start\":74419},{\"end\":74887,\"start\":74830},{\"end\":75236,\"start\":75216},{\"end\":75563,\"start\":75552},{\"end\":75939,\"start\":75888},{\"end\":76432,\"start\":76370},{\"end\":76963,\"start\":76897},{\"end\":77394,\"start\":77353},{\"end\":77729,\"start\":77698},{\"end\":78044,\"start\":78000},{\"end\":78352,\"start\":78321},{\"end\":78678,\"start\":78647},{\"end\":79041,\"start\":79034},{\"end\":79421,\"start\":79339},{\"end\":79876,\"start\":79813},{\"end\":80255,\"start\":80182},{\"end\":80660,\"start\":80596},{\"end\":81081,\"start\":81004},{\"end\":81542,\"start\":81491},{\"end\":82003,\"start\":81934},{\"end\":82450,\"start\":82391},{\"end\":82994,\"start\":82930}]"}}}, "year": 2023, "month": 12, "day": 17}