{"id": 257487802, "updated": "2023-05-19 14:17:50.589", "metadata": {"title": "Deep learning-based multi-source precipitation merging for the Tibetan Plateau", "authors": "[{\"first\":\"Tianyi\",\"last\":\"Nan\",\"middle\":[]},{\"first\":\"Jie\",\"last\":\"Chen\",\"middle\":[]},{\"first\":\"Zhiwei\",\"last\":\"Ding\",\"middle\":[]},{\"first\":\"Wei\",\"last\":\"Li\",\"middle\":[]},{\"first\":\"Hua\",\"last\":\"Chen\",\"middle\":[]}]", "venue": "Science China Earth Sciences", "journal": "Science China Earth Sciences", "publication_date": {"year": 2023, "month": 3, "day": 8}, "abstract": "Due to its complex and diverse terrain, precipitation gauges in the Tibetan Plateau (TP) are sparse, making it difficult to obtain reliable precipitation data for environmental studies. Data merging is a method that can integrate precipitation data from multiple sources to generate high-precision precipitation data. However, the more commonly used methods, such as regression and machine learning, do not usually consider the local correlation of precipitation, so that the spatial pattern of precipitation cannot be reproduced, while deep learning methods do incorporate spatial correlation. To explore the ability of using deep learning methods in merging precipitation data for the TP, this study compared three methods: a deep learning method—a convolutional neural network (CNN) algorithm, a machine learning method—an artificial neural network (ANN) algorithm, and a statistical method based on Extended Triple Collocation (ETC) in merging precipitation from multiple sources (gauged, grid, satellite and dynamic downscaling) over the TP, as well as their performance for hydrological simulations. Dynamic downscaling data driven by global reanalysis data centered on the TP were introduced in the merging process to better reflect the spatial variability of precipitation. The results show that: (1) in terms of the meteorological metrics, the merged data perform better than the gauge interpolation data. By using data merging, the error between the raw multi-source and gauged precipitation can be reduced, and the precipitation detection capability can be greatly improved; (2) The merged precipitation data also perform well in the hydrological evaluation. The Xin’anjiang (XAJ) model parameter calibration experiments at the source of the Yangtze River (SYR) and the source of the Yellow River (SHR) were repeated 300 times to remove uncertainty in the model parameter results. The median Kling-Gupta Efficiency Coefficients (KGE) of simulated runoff from the merged data of the ANN, CNN and ETC methods for the SYR and the SHR are 0.859, 0.864, 0.838 and 0.835, 0.835, 0.789, respectively. Except for the ETC merging data at the SHR, the performance of other merged data was improved compared to the simulation results of the gauged precipitation (KGE=0.807 at the SYR, KGE=0.828 at the SHR); and (3) In contrast to the machine learning ANN method and the statistical ETC method, the deep learning method, CNN, consistently showed better performance.", "fields_of_study": null, "external_ids": {"arxiv": null, "mag": null, "acl": null, "pubmed": null, "pubmedcentral": null, "dblp": null, "doi": "10.1007/s11430-022-1050-2"}}, "content": {"source": {"pdf_hash": "a6be13a1fb03a09cbaeb79b79ecd03b932907d97", "pdf_src": "Springer", "pdf_uri": null, "oa_url_match": false, "oa_info": null}, "grobid": {"id": "c419e2c198d2151ffc50b80553a450345b660815", "type": "plain-text", "url": "s3://ai2-s2-pdf-extraction-prod/parse-results/s2orc_worker/a6be13a1fb03a09cbaeb79b79ecd03b932907d97.txt", "contents": "\nDeep learning-based multi-source precipitation merging for the Tibetan Plateau\nApril 2023\n\nTianyi Nan \nState Key Laboratory of Water Resources and Hydropower Engineering Science\nWuhan University\n430072WuhanChina\n\nHubei Provincial Key Lab of Water System Science for Sponge City Construction\nWuhan University\n430072WuhanChina\n\nJie Chen \nState Key Laboratory of Water Resources and Hydropower Engineering Science\nWuhan University\n430072WuhanChina\n\nHubei Provincial Key Lab of Water System Science for Sponge City Construction\nWuhan University\n430072WuhanChina\n\nZhiwei Ding \nState Key Laboratory of Water Resources and Hydropower Engineering Science\nWuhan University\n430072WuhanChina\n\nHubei Provincial Key Lab of Water System Science for Sponge City Construction\nWuhan University\n430072WuhanChina\n\nWei Li \nState Key Laboratory of Water Resources and Hydropower Engineering Science\nWuhan University\n430072WuhanChina\n\nHubei Provincial Key Lab of Water System Science for Sponge City Construction\nWuhan University\n430072WuhanChina\n\nHua Chen \nState Key Laboratory of Water Resources and Hydropower Engineering Science\nWuhan University\n430072WuhanChina\n\nHubei Provincial Key Lab of Water System Science for Sponge City Construction\nWuhan University\n430072WuhanChina\n\nDeep learning-based multi-source precipitation merging for the Tibetan Plateau\n664April 202310.1007/s11430-022-1050-2Tibetan PlateauPrecipitation data mergingDeep learningDynamic downscaling Citation: Nan TChen JDing ZLi WChen H 2023 Deep learning-based multi-source precipitation merging for the Tibetan Plateau Science China Earth Sciences66(4): 852-870https://doiorg\nDue to its complex and diverse terrain, precipitation gauges in the Tibetan Plateau (TP) are sparse, making it difficult to obtain reliable precipitation data for environmental studies. Data merging is a method that can integrate precipitation data from multiple sources to generate high-precision precipitation data. However, the more commonly used methods, such as regression and machine learning, do not usually consider the local correlation of precipitation, so that the spatial pattern of precipitation cannot be reproduced, while deep learning methods do incorporate spatial correlation. To explore the ability of using deep learning methods in merging precipitation data for the TP, this study compared three methods: a deep learning method-a convolutional neural network (CNN) algorithm, a machine learning method-an artificial neural network (ANN) algorithm, and a statistical method based on Extended Triple Collocation (ETC) in merging precipitation from multiple sources (gauged, grid, satellite and dynamic downscaling) over the TP, as well as their performance for hydrological simulations. Dynamic downscaling data driven by global reanalysis data centered on the TP were introduced in the merging process to better reflect the spatial variability of precipitation. The results show that: (1) in terms of the meteorological metrics, the merged data perform better than the gauge interpolation data. By using data merging, the error between the raw multi-source and gauged precipitation can be reduced, and the precipitation detection capability can be greatly improved; (2) The merged precipitation data also perform well in the hydrological evaluation. The Xin'anjiang (XAJ) model parameter calibration experiments at the source of the Yangtze River (SYR) and the source of the Yellow River (SHR) were repeated 300 times to remove uncertainty in the model parameter results. The median Kling-Gupta Efficiency Coefficients (KGE) of simulated runoff from the merged data of the ANN, CNN and ETC methods for the SYR and the SHR are 0.859, 0.864, 0.838 and 0.835, 0.835, 0.789, respectively. Except for the ETC merging data at the SHR, the performance of other merged data was improved compared to the simulation results of the gauged precipitation (KGE=0.807 at the SYR, KGE=0.828 at the SHR); and (3) In contrast to the machine learning ANN method and the statistical ETC method, the deep learning method, CNN, consistently showed better performance.\n\nIntroduction\n\nThe Tibetan Plateau (TP), located in Central Asia, has an average elevation of over 4000 m and an area of about 2.5 million km 2 . It is the highest plateau in the world and has been called the Earth's \"third pole\" (Qiu, 2008). Due to its unique terrain and specific underlying surfaces, the TP is well recognized to exert a great influence on regional and even global atmospheric circulations and climate through thermal and dynamical forcing (Nan et al., 2009;Zhou et al., 2009;Wu et al., 2012;Yao et al., 2012). Moreover, as the source of many rivers such as the Yangtze, the Yellow and the Brahmaputra rivers in Asia, the TP is also called the \"Asian water tower\", and plays a significant role in the hydrological cycle (Xu et al., 2008;Immerzeel et al., 2010). It's of great importance to downstream water resources management, environment protecting and climate change risk response that conducting hydrological and meteorological research in the TP region. Precipitation, one of the most important components of the energy and water cycles on the TP, regulates the climate system and the ecosystem . Accurate rainfall estimates with high temporal and spatial resolutions are a prerequisite for better understanding of the water cycle process and carrying out research on climate change, hydrology and water resources over the TP region .\n\nFor the TP region, it is a major challenge to obtain reliable precipitation data with high temporal and spatial resolutions. Generally, gauged precipitation is used as real data in meteorological and hydrological research. Interpolated gauge observation data can show the real distribution of precipitation in the area with dense gauges to a large extent. However, the gauge network is insufficient and even nonexistent in some remote and unreachable areas, especially for high-elevation areas. In addition, most gauges are located in the central and eastern TP, but very few in the western TP ( Figure 1) . Moreover, the elevation of most gauges in the TP are below 5000 m above sea level, so there is actually no monitor for precipitation in mountain area over 5000 m. Therefore, the gauged observation may not represent the areal rainfall for the TP, and the gridded dataset interpolated from gauged observations, even taking into count of elevation, may suffer from the same problem.\n\nTo supplement gauged data in meteorological and hydrological studies, remote sensing and modeling have been used, including satellite remote precipitation sensing, reanalysis precipitation estimates and climate model outputs. The development of remote sensing makes it possible to estimate continuous spatial precipitation at the global scale . Satellite precipitation data exhibit consistent spatial patterns and seasonal cycles with the meteorological observations (Fu et al., 2008), and has the advantages of wide coverage, an aspect not offered by gauged precipitation (Xiong et al., 2021). However, in practical applications, satellite rainfall estimates are subject to a variety of error sources (gaps in revisit times, poor direct relationship between remotely sensed signals and rainfall rate, and atmospheric effects that modify the radiation field) and thus require a thorough validation Gebremichael, 2011a, 2011b). Tong et al. (2014) and Yin et al. (2008) evaluated three satellite precipitation products (Tropical Rainfall Measurement Mission (TRMM) Multi-satellite Precipitation Analysis 3B42 Version 5 (TRMM TMPA Version 5), and its real-time version (TMPART), and the Precipitation Estimation from Remotely Sensed Information using Artificial Neural Networks (PERSIANN)) and found that the gauged observations were generally overestimated in the TP region by these three datasets. Similarly, Gao and Liu (2013) evaluated four satellite-based precipitation datasets (TRMM TMPA Version 6, TMPART, PERSIANN and the Climate Prediction Center Morphing Technique (CMOPRH)) and found that they all show better agreement with gauged measurements over humid regions than over arid regions. However, these datasets generally tend to overestimate light rainfall (0-10 mm) and underestimate moderate and heavy rainfall (>10 mm). Chen and Li (2016) found that the Integrated Multi-satellitE Retrievals for Global Precipitation Measurement (GPM IMERG) can satisfactorily capture the spatial patterns of precipitation over China, and significantly improve the estimation accuracy of precipitation over the Xinjiang region and the TP region compared to the estimates of TRMM 3B43. Similar results were also found by Tang et al. (2016), which indicated that the precipitation of GPM IMERG shows significantly better performance than TRMM 3B42V7 on the daily time scale. Xu et al. (2017) evaluated GPM data in the southern TP and found that the GPM tends to underestimate the amount of light rain events of 0-1 mm d −1 , and shows better detecting ability for light rainfall (0-5 mm d −1 ). Reanalysis data combines model data with observations from across the world into a globally complete and consistent dataset using the laws of physics, with the goal of truly reflecting climate elements on a global scale (Bukovsky et al., 2007;Whelan et al., 2018). Liu et al. (2018) assessed ERA-Interim in representing spatiotemporal patterns and trends of precipitation and air temperature in Chinese mainland using gauged observation data as a baseline. The results showed that precipitation and temperature in ERA-Interim have good agreement with gauged observation in eastern China with its lower elevation (<1000 m above sea level), but good agreements are not observed in western China with its higher elevation. Furthermore, reanalysis datasets built at the global scale tend to have relatively low resolutions, which make it difficult to discern precipitation events occurring in complex terrain. Dynamic downscaling data of reanalysis is a set of climate variables output by the regional climate model with global reanalysis as the boundary condition.\n\nThe dynamic downscaling method based on reanalysis data has a finer temporal and spatial resolution, and it can simultaneously consider the effects of local circulation and local precipitation, especially the influence of complex terrain on precipitation, thus having clearer physical meaning (Xu et al., 2019). Lundquist et al. (2019) found that, in mountainous terrain, well-configured high-resolution atmospheric models are able to simulate total annual rain and snowfall better than spatial estimates derived from in situ observational networks of precipitation gauges. Many studies of dynamic downscaling driven by reanalysis data have been conducted in the TP to obtain high-precision precipitation datasets. Using the Weather Research and Forecasting Model (WRF), Gao et al. (2015) conducted dynamic downscaling of ERA-Interim on the TP and obtained a downscaling dataset with a spatial resolution of 30 km. Compared to ERA-Interim, this dataset has~35% reduction in the overestimation of precipitation relative to gauged observation. Moreover, it has been shown that in the TP, the performance of precipitation data generated by dynamic downscaling methods is better than that of precipitation data such as CMFD, COPRPH, and TRMM (Gao et al., 2020). Li et al. (2020) compared observed gridded precipitation data (APHRODITE, CPCC), satellite precipitation products (TRMM, GPM), reanalysis data (ERA5, ERA-Interim, JRA-55), and WRF downscaled precipitation data (HAR10, HAR30) with the precipitation estimated by the water balance method for nine glacial catchments in the upper Indus basin. Their results show that the precipitation in alpine regions can be better represented by the HAR dataset derived from WRF dynamic downscaling than the other data. Jiang et al. (2021) corrected and downscaled ERA5 precipitation data using a combined method of Convolutional Neural Network (CNN) and dynamic downscaling. Their method can reproduce the spatial patterns of precipitation revealed by the high-resolution simulation and reduce the bias of the original data at the same time, providing a finer spatial structure of precipitation.  evaluated the spatial distribution of precipitation over the southern slope of the central Himalayas presented by four datasets with different spatial resolutions (ERA-Interim, ERA5, ERA5-Land, and HAR), and the results showed that higher resolution simulations (ERA5, ERA5-Land and HAR) better reflect the topographic effect of precipitation, and they perform better in high-altitude areas with complex terrain and steep slopes.\n\nThe data mentioned above all have their own advantages: gauged observation data often represents the real precipitation at the location; satellite remote sensing data can continuously reflect the temporal and spatial distribution of precipitation; and the dynamic downscaling data of reanalysis not only has a high spatial and temporal resolution, but it can also consider the local orographic influence on precipitation. Data merging is the process of synthesizing incomplete information about a certain environmental feature provided by information from multiple sources to form relatively complete, consistent, accurate and unified information, and is a common method for integrating the advantages of different data (Yu et al., 2020). By using data merging, precipitation data from multiple sources can be integrated to generate high-precision precipitation data with the advantages of original data.\n\nVarious methods have been used to conduct precipitation data merging, including classical estimation algorithms, modern information theory, and artificial intelligence methods. A statistical method was used by Min et al. (2020) to merge gauged and satellite precipitation data in the Xin'anjiang river basin, with results that indicate this method, can reduce the error of satellite precipitation data and improve its accuracy in flood simulation. Zhang et al. (2021) proposed a novel double machine learning approach to merge multiple satellite-based precipitation products and gauge observations, and compared the effect of merging results from four machine learning methods: random forest (RF); artificial neural network (ANN); support vector machine (SVM); and extreme learning machine (ELM), and three linear weight methods: inverse error variance weighting (IEVM); one-outlier-removed average (OORA); and optimized weight average (OWA), with the results from four double machine learning methods (RF-RF, RF-ANN, RF-SVM, and RF-ELM). Their comparison showed that original satellite data can be improved by using the double machine learning approach. Research has also been done on precipitation merging in areas with no observations. Ma et al. (2018) conducted multi-source satellite precipitation data merging in the TP based on the dynamic Bayesian model averaging scheme. The correlation coefficient between the obtained merged data and the gauged precipitation was up to 0.59, and the root mean square error only 6.77 mm d −1 .\n\nUsing the same method,  merged the rainfall estimates from GPM-IMERG, GSMaP, and CMORPH to generate daily precipitation data of the southern TP with a spatial resolution of 0.1°focused on the warm season (10 June-31 October) from 2014 to 2019. Statistical evaluation indicated that the new dataset outperforms the raw satellite estimates, especially in terms of rainfall accumulation and in the detection of ground-based rainfall events, and shows good performance in hydrological simulation on the Brahmaputra river basin. Ma et al. (2021) proposed a two-stage blending (TSB) approach for merging multiple satellite precipitation estimates and rain gauge observations based on the Bayesian correction model. The performance of the proposed method was evaluated with independent validation data in the warm season from 2010 to 2014 in the northeastern Tibetan Plateau. Results show that the proposed TSB method can effectively decline the bias of original precipitation data, while mitigating negative impacts from the ones with lower quality. By merging gauge, satellite, and ERA5 reanalysis data using ANNs, Hong et al. (2021) generated a multi-source precipitation dataset across the TP, which can better reflect the precipitation distribution in datadeficient areas. Using a method based on Extended Triple Collocation (ETC), Koster et al. (2021) merged site-interpolated precipitation data, GPM IMERG data, and SM2RAIN-based data to obtain five-day precipitation data with a resolution of 36 km, and evaluated it based on independent precipitation and soil moisture datasets. The results show that the merged data can draw successfully on the complementary strengths of each contributor. It is worth mentioning that the merging method based on ETC does not require real precipitation to calculate the merging weight, so it can be used for precipitation merging in areas without observations.\n\nThe above-mentioned studies, however, still have some limitations. From a data perspective, ERA5, as a global atmospheric reanalysis data, does not have a sufficient resolution to accurately reflect the complex precipitation events in the TP. The dynamic downscaling products of ERA5 reanalysis data in plateau and mountainous regions can provide a more accurate description of precipitation (Lundquist et al., 2019;Li et al., 2020;Gao et al., 2020). Ou et al. (2020) released a set of ERA5 dynamic downscaling datasets (TPReanalysis) centered on the TP, covering a broad region over East Asia, providing hourly data with a spatial resolution of 9 km, which can reflect more precise spatial and temporal distribution characteristics of precipitation, and can be used for data merging to obtain better results. From a method point of view, since precipitation is a continuous process in space and time, the CNN architecture can consider the local spatial correlation of precipitation to better simulate and reproduce the spatial distribution pattern of precipitation in the region, in contrast with classical statistical and machine learning methods. Pan et al. (2019) tested the precipitation produced by CNN models across the contiguous United States. The results show that, provided with enough data, precipitation estimates from a CNN model outperform the reanalysis precipitation products, as well as statistical downscaling products using linear regression, nearest neighbor, random forest, or fully connected deep neural network methods.\n\nCompared to previous studies, the innovations of this study are two-fold. (1) In addition to dynamic downscaling data with high spatial and temporal resolution (TPReanalysis), precipitation season, latitude, longitude, and elevation information have been added to the data merging process. This additional information allows the spatial and temporal characteristics of precipitation distributions in the TP to be fully considered, as well as local circulation and local precipitation effects, particularly the effects of complex terrain.\n\n(2) A deep learning algorithm has been used to merge precipitation data. The deep learning methods, in contrast to classical methods and machine learning methods, are able to consider the spatial correlations of precipitation and the potential relationships between input variables, and thus better simulate and reproduce the spatial patterns of precipitation in the region. Specifically, in this study, TPReanalysis was used as one of the source datasets for merging precipitation data, and the effects of CNN, ANN and ETC methods on data merging were fully compared. Moreover, given the periodically changing precipitation during the year, and the significant impact on the local precipitation caused by complex topography , the precipitation season, latitude and longitude, and elevation of precipitation were added to the ANN and CNN models as inputs, in order to comprehensively consider the spatiotemporal distribution characteristics of precipitation in the TP. In the evaluation stage, on one hand, this study used the gauged data to evaluate the quality of the merging precipitation data from a meteorological perspective. On the other hand, considering the infeasibility of evaluating the spatial distribution of precipitation products by gauged observation, a good alternative is to compare the performance of each dataset in hydrological simulation, which can indirectly reveal the data quality. To reduce the impact of glacier melting on runoff, the source basins of the Yangtze River and the Yellow River, where the runoff is mainly contributed by precipitation and snowmelt, are selected as study basins for the hydrological simulation conducted by the Xin'anjiang (XAJ) three-source model coupled with a snowmelt module.\n\n\nStudy area and data\n\n\nStudy area\n\nThe Tibetan Plateau (Figure 1) is the highest plateau in the world, with a vast area, complex topography, and strong spatial heterogeneity in the underlying surface conditions. A significant difference exists between the climatic character-istics in the north and the south of the TP. Warm, humid air from the south is blocked by the mountains, which results in an average annual precipitation of beyond 1400 mm in the southeast . However, the annual precipitation in the Qaidam area of northern TP is less than 50 mm. The TP has a climate of wide diurnal temperature range, distinct dry and wet periods, and frequent nighttime rain. Besides, precipitation is high in summer and low in winter at this region. To consider the difference of precipitation between the eastern and western parts of TP, and to evaluate the performance of precipitation data in dense and sparse areas of gauges, the TP was divided into two parts, taking the 90°E longitude line as the boundary based on similar studies , and the evaluations were conducted in sub regions.\n\nThe source basin of the Yangtze River (SYR basin) and the source basin of the Yellow (Huang) River (SHR basin) were selected as study basins of runoff simulation. The SYR basin, located in the hinterland of the TP, with an average altitude of over 4000 m and an area of 137700 km 2 , is the area with the least precipitation and runoff in the Yangtze River watershed, whose outlet station is the Zhimenda hydrological station (Chen, 2013). Located in the northeastern part of the TP, with an average elevation of about 4425 m and an area of 122000 km 2 , the SHR basin has an average annual precipitation of about 510 mm. The annual average runoff of the SHR basin accounts for about 38% of the whole Yellow River watershed . The study area is shown in Figure 1.\n\n\nData\n\n\nGauged observation data\n\nThe gauged observation data used in this study is from 64 meteorological gauges of the National Meteorological Information Centre in TP region, released after strict quality inspection by the meteorological department. In this study, the training sets for the precipitation merging model consist of the data from 48 randomly selected gauges, and the data of the other 16 gauges were used to evaluate the merging results. Gauges used for evaluation are marked in Figure 1 using a green dot with a cross in the center.\n\n\nInterpolated grid data\n\nA gridded daily dataset (CN05.1) with a resolution of 0.25°×0.25°established by Wu and Gao (2013) was used in this study, which is based on the interpolation of observation data from 2416 Chinese surface meteorological gauges. Due to the sparse distribution of observation sites in the TP, the performance of CN05.1 in this region may be subject to uncertainty. Although the gauges used in this study for model training were also used in the generation of CN05.1, there is still an inevitable difference between the precipitation from the 0.25°×0.25°grid of CN05.1 and the measured precipitation of the site location. By moving the observation data into a merging model, the CN05.1 data can be utilized on a finer grid (0.1°×0.1°), thereby making the merging results more accurate.\n\n\nRemote sensing satellite data\n\nGlobal Precipitation Measurement (GPM), a collaborative mission organized by NASA and the Japan Aerospace Exploration Agency (JAXA), is capable of estimating global precipitation, and provides the latest generation of rainfall products with a 30-minute temporal resolution and 0.1°s patial resolution (Hou et al., 2014). From the evaluation on the GPM IMERG precipitation product, it is believed that GPM IMERG can better detect light rainfall and solid precipitation, and outperform TRMM in Chinese mainland overall, but has rather poor accuracy in high-altitude and arid regions . Site-corrected precipitation products from the GPM IM-ERG Final Precipitation L3 1 day 0.1°×0.1°V06 (GPM_3IMERGDF) dataset were used in this study, integrating data collected during the TRMM era (2000)(2001)(2002)(2003)(2004)(2005)(2006)(2007)(2008)(2009)(2010)(2011)(2012)(2013)(2014) with GPM-era precipitation estimates processed from the 30minute GPM_3IMERGHH precipitation product (Venkatesh et al., 2022), representing the final estimate of daily cumulative precipitation. This dataset was generated by NASA's Goddard Earth Science (GES) Data and Information Service Center (DISC), covering the entire globe with a 0.1°×0.1°s patial resolution and a time range of 2000-2021.\n\n\nDynamic downscaling data\n\nThe dynamic downscaling data used in this study was derived from TPReanalysis, which is driven by the WRF model with ERA5 as the lateral boundary condition with a focus on the TP, with a spatial resolution of 9 km×9 km, a time range of 1980-2019, and a spatial range of 4°-51°N, 53°-137°E, providing hourly and daily scale data products (Ou et al., 2020;Sun et al., 2021). Table 1 presents information about the data used in this study.\n\n\nMethod\n\nThe work carried out in this study mainly covers the following six aspects: (1) precipitation data from multiple sources were processed to a daily, 0.1°×0.1°spatiotemporal resolution as the model input of three methods; (2) precipitation data values from 48 gauges in the TP and that from multiple sources on gauge positions were combined with the latitude, longitude, elevation and precipitation season, as the training sets of the ANN and CNN models, establishing the multi-source data merging relationship; (3) the multi-source precipitation data of the entire TP with the latitude and longitude, elevation, and season information were combined and imported into the ANN and CNN models by grid to obtain the merging results; (4) based on the correlation between precipitation data from multiple sources, equations were established to get the merging results of ETC; (5) due to the lack of reliable grid precipitation data on the TP, meteorological evaluation was carried out based on the 16 gauges independent from the training set, in order to evaluate the feasibility of promoting the merging relationship established in the gauge locations to the TP region; and (6) runoff simulations were carried out in the SYR and SHR basins to indirectly evaluate the accuracy of the merging results. The methods and indicators used for evaluation are briefly described as follows.\n\n\nData preprocessing\n\nThe spatial resolution of the merging results was set to 0.1°, with a spatial range of 73.4°-105°E, 25°-40°N. The raw data for merging must first be processed to the corresponding spatial resolution and latitude and longitude range. CN05.1, GPM IMERG, and TPReanalysis were resampled to a 0.1°×0.1°grid using the nearest neighbor interpolation method.\n\n\nNeural network model\n\nAn ANN is a highly complex nonlinear dynamic learning system that is suitable for dealing with imprecise and ambiguous information processing problems in which various factors and conditions must be considered simultaneously. The CNN architecture, based on a deep learning algorithm constructed by imitating the visual perception mechanism of living creatures, can be used for both supervised learning and unsupervised learning. As a result of the shared convolution kernel parameters in the hidden layer, as well as the sparsity of the connections between the layers, the lattice features can be discovered with a minimal amount of computation, and the effects are stable without requiring any additional data (Gu et al., 2018). Since it is superior to traditional ANN architectures and most machine learning algorithms, CNN has been applied to numerous fields, including hydrology (Fang et al., 2017;Shen et al., 2018;Pan et al., 2019).\n\nIn addition to using three sets of precipitation data (CN05.1, GPM IMERG, and TPReanalysis) as input, the season, latitude and longitude, and the altitude corresponding to the precipitation time were also used as the inputs of the neural network models, so as to fully consider the spatial and temporal distribution, and to obtain accurate merging precipitation results. For grid data, considering the uncertainty introduced by the interpolation method, the nearest neighbor method was applied to extract the precipitation at gauge locations. After taking into account the season, latitude and longitude, and the altitude, there is strong spatial correlation between other properties of grids in the TP region. As a result, the merging relationship established in the gauge locations was promoted to the whole TP region straightly to achieve multi-source precipitation merging grid-by-grid. To avoid the influence of irrelevant variables on the merging results, a simple model structure was used in this study: The ANN model has four fully connected layers, and the CNN model has two additional convolutional layers than the ANN model. To prevent the model from overfitting, a dropout layer with 0.1 as a parameter is set after each fully connected or convolutional layer. For optimization training, both the ANN and CNN models use the Adam algorithm; whose learning rate is 0.0001 to ensure an optimal solution. The RMSE and the reLu function are used as the loss function and activation function, respectively (Wang et al., 2022). Except for the model structure, the hyper parameters of the ANN model and the CNN model are completely consistent: The Epoch was set to 500 and the Batch Size to 2500. After training the ANN and CNN models according to the above scheme, multi-source data (CN05.1, GPM IMERG, TPReanalysis, grid latitude and longitude, altitude, precipitation season) was input into the precipitation merging model to obtain the daily precipitation merging data of 0.1°×0.1°( hereinafter referred to as the ANN merging data and the CNN merging data).\n\n\nExtended triple collocation\n\nExtended Triple Collocation (ETC) is an extensively used error and correlation estimating method in the field of geosciences. ETC can calculate the correlation coefficient and error of three mutually independent measurement systems, without treating any one system as perfectly observed \"truth\" (McColl et al., 2014). Due to the independence of the errors in different precipitation products, their correlation coefficients can also be calculated by ETC, making it possible to carry out precipitation merging. The ETC merging method used in this study was adopted by Koster et al. (2021). In the TP region, a ternary merging equation was established based on the correlation coefficients between CN05.1, GPM IMERG, TPReanalysis data and the unknown \"truth\". To maximize the correlation coefficients, the merging weights of CN05.1, GPM IMERG, and TPReanalysis were calculated grid-by-grid. And the merging data based on the ETC method (hereinafter referred to as ETC merging data) can be obtained according to the weights.\n\n\nXin'anjiang model\n\nThe Xin'anjiang (XAJ) model proposed by Zhao et al. (1980) is the lumped hydrological model most commonly used in China and has been successfully applied to most of the catchment basins in humid and semi-humid climate regions in China, including the Yellow River, Yangtze River and Huai River basins (Zhao, 1992;Jiang et al., 2007). After its introduction, it was developed and improved into a model with three or more water sources (Zhao and Wang, 1988). The XAJ three-source model has been widely used in flood forecasting and water resources assessment and management (Xiong and Guo, 1998). The XAJ three-source model used in this study has 15 parameters, divides the watershed area into permeable area and impervious area, and considers three layers of soil moisture storage to calculate the actual evapotranspiration. In impervious areas, all effective rainfall is converted into surface runoff, while in permeable areas, the sources of runoff are divided into surface runoff, interflow, and underground runoff. The saturation excess mechanism is used in the XAJ model for runoff generation, linear reservoirs are used for surface runoff routing, and two recession coefficients are used for interflow and underground runoff routing Qi et al., 2022).\n\nSince snowmelt runoff accounts for a large proportion of the runoff in the TP, in this study, the CemaNeige snowmelt module was combined with the XAJ model to better simulate the runoff processes in the SYR and SHR basins. In the CemaNeige module, precipitation is divided into rainfall and snowfall according to the daily highest and lowest temperature, and the degree-day method is used to calculate the amount of snowmelt (Valéry et al., 2014;Wang et al., 2020). Two parameters are required for CemaNeige, thus 17 parameters must be calibrated for the coupled snowmelt module and XAJ model in this study. The description and value range of the model parameters are shown in Table 2.\n\nIn addition to precipitation, daily maximum temperature, daily minimum temperature, daily average temperature, potential evapotranspiration, and watershed area also required for the XAJ model coupled with the CemaNeige snowmelt module, where the potential evapotranspiration is calculated by the Oudin formula. To reduce the influence of irrelevant variables in hydrological simulation, the air temperature data required by the model was uniformly provided from the CN05.1 dataset. The watershed area was calculated from the boundary files of the study basins using ArcGIS.\n\nTo eliminate the instability of the hydrological model calibration caused by inconsistent climatic conditions, the method of calibration in odd-numbered years and verification in even-numbered years was adopted (Muñoz-Díaz and Rodrigo, 2006;Hou et al., 2017;Chen et al., 2018;. The shuffled complex evolution (SCE-UA) method (Duan et al., 1992) was used to calibrate the parameters of the XAJ model, with Nash efficiency coefficient (NSE) as the objective function. Since the initial state of the XAJ model has a great influence on the model output, the precipitation input of the model is fixed as a continuous precipitation series from 2001 to 2017, and only the simulated and the measured runoff of the corresponding year (odd or even years) will be selected to calculate the objective function while calibrating. In this calibration method, the initial conditions of the model will remain unchanged, which will effectively eliminate the influence of initial variable uncertainty on the model output. Considering that the SCE-UA method uses random number seeds to determine the initial state of the algorithm, the calibration was repeated 300 times using different random seeds to remove uncertainty in the model parameter calibration results.\n\nApart from three sets of precipitation products and three merging precipitation data, the grid precipitation data obtained by inverse distance interpolation from 64 gauges in the TP was also used to evaluate merging data in hydrological simulation.\n\n\nEvaluation methods\n\n\nMeteorological evaluation metrics\n\nObserved precipitation from 16 independent meteorological gauges across the TP for the 2001-2019 period was used for meteorological evaluation. Eight statistical metrics: the spearman correlation coefficient (CC), average bias (BIAS), standard deviation ratio (STDRATIO), mean-absolute error (MAE), root-mean-square error (RMSE), probability of detection (POD), false alarm rate (FAR), and the critical success index (CSI), were used in the meteorological evaluation. Formulas for these metrics are given in Table 3. After referring to several studies (Jiang and Bauer-Gottwein, 2019; Beck et al., 2020;Tian et al., 2021), the threshold to judge whether there is precipitation was set to 1 mm d −1 while calculating the POD, the FAR and the CSI. In this study, it is believed that the merging relationship established by the training set can be promoted to 16 gauges outside the training set, and further promoted to all grids in TP. As a result, the evaluation conducted on 16 gauges independent from the training set is essentially the same as that on 16 random locations across the TP region, which indicates the reliability of the precipitation merging data.\n\n\nHydrological evaluation metrics\n\nThe XAJ model coupled with the CemaNeige snowmelt module was used for runoff simulation in the SYR and SHR watersheds from 2001 to 2017. The XAJ model's parameters were calibrated with each type of data as input. The hydrological evaluation was performed to assess the validity of the model parameters calibrated using each type of data, with both the NSE and water volume error (PBIAS) as the standards. Considering NSE's excessive focus on flow peak, the Kling-Gupta Efficiency Coefficient (KGE), which emphasizes runoff variability, was used to supplement the hydrological evaluation. The formulas of the metrics are given in Table 3. Figure 2 shows the spatial distribution of the CC and the RMSE between CN05.1, GPM IMERG and TPReanalysis data and the measured precipitation at 64 gauges on the TP. It is clear that the correlation coefficient and the RMSE performance of the CN05.1 data are significantly better than those of the other two sets of data. The CC and RMSE spatial distribution of the three sets of data all performed better in the southeast and worse in the northwest. Figure 3 shows the annual regional average precipitation of the whole region ( Figure 3a) and two sub-regions (Figure 3b and 3c) of the TP calculated from three merging precipitation datasets and three original datasets.\n\n\nResults and discussion\n\n\nCharacteristics of precipitation in TP\n\n\nQuality of multi-source precipitation\n\n\nAnnual precipitation\n\nThere is a significant difference in the average annual precipitation of the three sets of original precipitation products in the whole area of the TP during 2001-2019 ( Figure  3a). The average annual precipitation of CN05.1 and GPM IMERG were similar in quantity and trend, both varying between 350-450 mm, while among which the precipitation of GPM IMERG is the lowest and that of CN05.1 is the second. In contrast, average annual precipitation of TPReanalysis was about 100 mm higher, in the range of 480-560 mm. As for the merging data, the average annual precipitation of the ANN and CNN merging data were consistent with the lower and upper boundaries of the average annual precipitation range of CN05.1 and GPM IMERG, respectively, which ranges from 360 to 460 mm. The average annual precipitation of the ETC merging data was slightly higher than that of the CNN merging data in most years, both varying between 400-450 mm. Figure 3b shows the average annual precipitation of each dataset in the western TP, which is similar in quantity, varying between 100 and 350 mm, while the trend was obviously different. There is a sustained sharp decline in the average annual precipitation of CN05.1 and GPM IMERG in the western TP from 2013 to 2015, which is not captured by TPReanalysis. The average annual precipitation of the CNN and ANN merging data was the highest and lowest, respectively, in most years, while that of the ETC merging data was close to GPM IMERG before 2012, but close to the mean value of GPM IMERG and CN05.1 since then. Meanwhile, similar decline of precipitation in 2013-2015 also exists in three sets of merging data. Figure 3c shows the average annual precipitation of each dataset in the eastern TP. The inter annual trends and precipitation of CN05.1, GPM IMERG, ANN and CNN data were similar, while TPReanalysis and ETC merging data had overestimations of about 200mm and 50mm, respectively. Figure 4 presents the annual quarterly precipitation of all data sets in the TP, and they show a similar pattern: most precipitation occurs in the summer (200-300 mm), and the least precipitation occurs in the winter (0-60 mm). TPReanalysis has more precipitation than other data in all seasons, and most obvious in spring, reaching a difference of 70 mm. The three sets of merging data have little difference in precipitation in spring, autumn and winter. However, in summer, the precipitation of ANN data is close to the datasets with less precipitation in CN05.1 and GPM IMERG, and the CNN and ETC data are closer to the dataset with more precipitation in CN05.1 and GPM IMERG.\n\nOverall, except for the overestimation of TPReanalysis, the other precipitation data are generally consistent in terms of regional annual precipitation and quarterly precipitation in the TP. As can be seen from Figure 3 and Figure 4, the overestimation of TPReanalysis mainly exists in the spring, autumn and winter as well as the eastern TP. On one hand, the ERA5 data is inherently biased in the TP, and TPReanalysis, the dynamic downscaling result of ERA5, will naturally inherit its error. On the other hand, it is shown that a) P represents the daily precipitation sequence of precipitation products, and P s represents the measured daily precipitation data. P r and P rs represent the ranked data sequence converted from the original daily precipitation data and the precipitation products, N is the length of the daily precipitation sequence and H is the number of cases in which precipitation occurs according to both precipitation products and the measured precipitation. F represents the number of cases in which precipitation occurs based on the measured precipitation, but not on the precipitation product, and M is the number of cases in which precipitation occurs based on precipitation products, but not on the measured precipitation. R represents the daily runoff process obtained by the hydrological model using the precipitation products, R s represents the daily runoff process measured by the hydrological station, and X is the average of the sequence X, where X can be P, P s , R or R s . the WRF with horizontal grid spacings of more than 4 km cannot explicitly resolve the cumulus plumes and cannot avoid error-prone convection parameterization, resulting in the overestimation of precipitation . In addition, the spatial and temporal distribution of precipitation was uneven in the TP. The precipitation in spring and autumn accounts for more than 40% of the annual precipitation in the southeastern, southwestern, and northwestern regions of the plateau Lin et al., 2021). As a result, misjudgment of the cumulus convective precipitation process in these areas by WRF may be the reason for the overestimation of precipitation.  \n\n\nSpatial distribution of multi-year average precipitation\n\nAn increasing precipitation from the northwest to the southeast is shown in the spatial distribution of the multiyear average precipitation of all sets of data in the TP region, and it is obvious that the Qaidam region in the north has the least precipitation (<100 mm) ( Figure 5). The spatial distribution of multi-year average precipitation from CN05.1, GPM IMERG and TPReanalysis can be found in Figure 5a-5c. Due to the lower spatial resolution of CN05.1 data compared to that of other data, their spatial distribution features are the least refined (Figure 5a). Abundant precipitation in the southernmost Linzhi region of the TP, induced by the Indian Ocean monsoon, is shown in both the GPM IMERG and TPReanalysis (Figure 5b and 5c) (Lu and Yong, 2018). However, due to the lack of observation gauges in this area, this spatial pattern cannot be found in CN05.1. Compared to the CN05.1 dataset (Figure 5a), GPM IMERG ( Figure 5b) performs better in the fineness of spatial distribution. A similar precipitation distribution is observed for GPM IMERG in the eastern region as that of CN05.1, while precipitation is higher in the southern foothills of the Gangdise Mountains in the western region and the lake belt headed by Selin Co (Figure 5a and 5b). The TPReanalysis data further refined the general spatial precipitation distribution displayed by CN05.1 and GPM IMERG in the eastern region, highlighting the precipitation in mountains and river valleys. In the western region, TPReanalysis shows more precipitation in mountain areas and less precipitation in the plateau, embodying the terrain effect of precipitation (Figure 5c). Figure 5d-5f shows the spatial distribution of ANN, CNN and ETC merging data. These three sets of merging data inherit not only the general spatial precipitation distribution of CN05.1, but also the fineness from GPM IMERG and TPReanalysis. However, there are still differences in their refined precipitation distributions. To highlight these differences, CN05.1 was selected as the background precipitation, and the relative deviations of the three sets of merging data were then calculated, which is shown by Figure 6. The performance of ANN and CNN merging data in the central and eastern TP is consistent when compared with that of CN05.1, showing less precipitation in the Qaidam Basin, and more in the surrounding mountainous areas of the Qaidam Basin and the southern Linzhi area (Figure 6a and 6b). In fact, the airflow is dominated by downward motion in the interior plain with low elevations, which is not conducive to the condensation of water vapor. Meanwhile, due to the water vapor replenished by the southwest monsoon and the southeast monsoon, high precipitation is generated along the windward slopes of the mountains surrounding the Qaidam Basin. As a result, the Qaidam Basin in general exhibits a positive precipitation-elevation relationship due to the joint effect of low precipitation in the interior plains and high precipitation in the surrounding mountains . This atmospheric motion feature is more obvious in the ANN and CNN merging data, indicating that the ANN and CNN methods can compensate for the shortcomings of CN05.1 in the spatial distribution of precipitation. The ETC merging data slightly overestimated precipitation in the central and eastern TP, the Linzhi region, the headwaters of the Indus River, and the northern Altun Mountains, and significantly underestimated precipitation in the northern Qaidam Basin; it is consistent with the GPM IMERG in this regard (Figure 6c).\n\nThe differences in the spatial distribution of precipitation among three sets of merging data mainly exist in the Kunlun Mountains and the Qaidam Basin in the northern TP. The ANN and CNN merging data showed less precipitation in the Qaidam Basin and more in the Kunlun Mountains area in compare with the ETC merging data. The overestimation of precipitation by ANN merging data only occurs in the eastern section of the Kunlun Mountains, with a multi-year average precipitation of more than 300 mm. However, the CNN merging data is overestimated in the entire Kunlun Mountains and even in most areas of the Karakoram, with a multi-year average precipitation of 400-600 mm. The ETC merging data significantly underestimates the precipitation in the Kunlun Mountains, with a multi-year average precipitation of less than 100 mm. The spatial pattern of precipitation exhibited by CNN merging data in Kunlun Mountains is similar to that of TPReanalysis (Figure 5c and 5e), which means that the CNN merging data was able to demonstrate the mid-latitude westerly-influenced heavy rainfall in the Karakoram and Kunlun Mountains, well-reproduced by TPReanalysis . As a result, CNN data seems to describe the spatial distribution of precipitation on the TP more accurately than other data types. The convolutional layers in the CNN model structure make it possible to fully consider the potential relationship between multiple input variables when performing precipitation merging, and to thereby obtain a regional precipitation distribution that is closer to the actual distribution.\n\nCombined with the features of the interpolation data and the climatic characteristics of the TP, it can be seen that due to the insufficient and unevenly distributed meteorological gauges in the TP, the interpolated data of meteorological gauges in the region have overestimated precipitation in the northern and northwestern areas and underestimated precipitation in the central and southern areas. Combining the actual gauged precipitation with the spatial distribution of TPReanalysis and GPM IMERG data, a more realistic description of precipitation in spatial distribution for the TP is found by the CNN merging data when the positive effects of the interpolation data of meteorological gauges in the densely populated areas can be retained.\n\n\nEvaluation of merging precipitation data\n\n\nMeteorological evaluation\n\nBased on the precipitation of 2001-2019 measured by 16 gauges independent from a training set in the TP, the precipitation of CN05.1, GPM IMERG, TPReanalysis and merging data of ANN, CNN, and ETC were evaluated at the gauge locations (Figure 7, Figure 8, and Figure 9).\n\nFrom the results of evaluation in annual precipitation, the three sets of merging data all had a good performance on CC, which means the merging data have good correlation with the gauge data. Besides, the merging data of CNN and ANN outperform CN05.1 and ETC merging data with their higher median and narrower variation range in CC, indicating that their correlation shows a better consistence across the observation gauges than CN05.1 and merging data of ETC. The BIAS of ANN and CNN merging data are both close to 0, and CNN merging data shows a better consistency than the three sets of original precipitation data. In contrast, the BIAS of ETC at different gauge locations fluctuates greatly, but all tending to overestimate precipitation. The STDRATIO of CNN merging data is the closest to 1, which means its temporal dispersion is highly consistent with the measured data and there is no equalization on rainfall events, while the merging data of ANN and ETC do not perform well. The merging data of CNN and ANN have a better performance in MAE and RMSE than the CN05.1 and ETC merging data. From a precipitation detection capability perspective, CNN merging data outperforms other merging data in CSI for its least FAR and high POD, and meanwhile the ANN merging data outperforms ETC merging data as well. And it can be found that the consideration of spatial heterogeneity of precipitation by CNN merging data can improve the precipitation detection capability.\n\nThe boxplot of annual and seasonal CC, BIAS, STDRA-TIO, POD, FAR and CSI of all the datasets is shown in Figure 7 and Figure 9, from which it can be found that the evaluation results of each data are similar in spring, summer and autumn, but have a much lower performance in winter. Take into count the precipitation characteristic of TP region, poor performance in winter precipitation may be related to winter's limited precipitation-less than 10% of the total annual precipitation, and the difficulty in monitoring snowfall, while 60-70% of the total annual precipitation occurs in summer (Liu and Yin, 2001;Sui et al., 2013). Figure 8 is the boxplot of annual and seasonal MAE and RMSE of all the datasets. There are large errors in summer and small errors in winter in the MAE and RMSE of each data, because these two metrics will be largely influenced by the quantity of precipitation, which is adequate in summer and deficient in winter.\n\nIn meteorological evaluation, the differences between CN05.1 and the measured data from 16 gauges independent from the training set may be caused by the spatial mismatch of gauged and grid precipitation. After all, there are inevitable differences between the precipitation of a 0.25°×0.25°grid from CN05.1 and that from an observation gauge. However, the purpose of precipitation merging in this study is to integrate the advantages of each original precipitation dataset while making up for its shortcomings. Indeed, the results obtained in this study have proven that this integration is possible and advantageous. The introduction of GPM IMERG, TPReanalysis, latitude and longitude, altitude and the precipitation season on the grid of 0.1°×0.1°greatly improves the quality of the merging data when compared with the original data, not only reducing the error with the measured precipitation, but also improving the precipitation detection capability.\n\n\nHydrological evaluation\n\nDue to the lack of reliable high-resolution grid precipitation data in the TP, the spatial distribution of merging data cannot be comprehensively evaluated using only the gauged data. Given that the differences but not the superiority is revealed from comparisons of merging data with the others, the authenticity of spatial patterns displayed by merging data cannot be quantitatively evaluated. Since the quality of precipitation data and its effect on runoff simulation are related, hydrological simulation can be used to indirectly evaluate the accuracy of precipitation data. Theoretically, the higher the accuracy of precipitation data is, the better its effect on runoff simulation will be. As a result, the XAJ model, coupled with the CemaNeige module, was used in this section to indirectly evaluate the merging data, with SYR and SHR as the study basins and NSE as the objective function. Observed daily runoff during 2001-2017 of Zhimenda and Tangnaihai station, outlet stations of SYR and SHR basins, is used for model calibration.\n\nIn order to evaluate the merging precipitation in runoff simulation, the inverse distance interpolation was performed on the observation of the gauges on the TP to obtain the average precipitation in the SYR and SHR basins. Taking the interpolated data with CN05.1, GPM IMERG, TPReanalysis, Figure 6 Relative differences in multi-year average precipitation between CN05.1 and merging data. and the merging data of ANN, CNN and ETC as the model input, calibrations of the XAJ model were carried out 300 times, with odd-numbered years as the calibration period and even-numbered years as the verification period. The NSE, KGE and PBIAS of SYR and SHR basins in calibration and validation periods are shown in Figure 10.  From the evaluation results (Figure 10), it's obvious that the performances of each merging precipitation dataset were not optimal in the calibration period, but their NSE, KGE and PBIAS in the verification period did achieve good results. Viewed from the KGE, the CNN merged data is optimal, which means that it can simulate runoff changes accurately. Moreover, from the PBIAS perspective, the merging data of ANN and CNN both outperform the interpolation of observation data, again demonstrating the effectiveness of merging precipitation. In the runoff simulation in the SYR, the NSE and KGE of the TPReanalysis data in the calibration period are significantly lower than that in the verification period, due to the abnormally low value of the precipitation data in 2009 (in the calibration period). Figures 11 and 12 show the simulated daily runoff during 2001-2017 by all three sets of merging data in SYR and SHR basins, respectively. Comparing runoff simulation results of the SYR (Figure 11) and the SHR (Figure 12) basins, it can be found that the runoff simulation results of ANN and CNN merging data can better reflect the actual runoff peak value than that of ETC merging data. And, combined with the evaluation of the verification period, the effect of CNN merging data in runoff simulation is slightly better than that of ANN merging data. Since the biggest difference between the merging data of ANN and CNN exists in the west of the TP, and given that their average precipitation in the simulated watershed is relatively similar, there is little difference between the runoff simulation of these two merging results of neural network methods. In addition, the merging data may be a somewhat insufficient for the simulation of larger flood peaks. After comparing the precipitation data in SYR and SHR basins, the inadequate performance of peak simulation was found to be caused by the mismatch between the precipitation data and the actual flow trend, a mismatch that also exists in CN05.1 and TPReanalysis data. However, GPM IMERG performs well in this aspect.\n\n\nConclusion and perspectives\n\nIn this study, the machine learning method ANN, the deep learning method CNN, and the statistical algorithm ETC were each used to realize the merging of precipitation data from multiple sources such as gauged observation data, CN05.1, GPM IMERG and TPReanalysis. Meteorological and hydrological evaluation were conducted to assess the results of these three merging methods. The main conclusions are as follows: (1) The performance of all three sets of merging data in meteorological evaluation is good. The CNN merging data is optimal in CC, BIAS, STDRATIO, MAE, RMSE, FAR and CSI, but slightly worse than CN05.1 and ETC merging data in POD.\n\n(2) In hydrological evaluation, the runoff simulation of merging data is not as good as the results of gauged ob-servation and GPM IMERG in the calibration period when evaluated by NSE. However, viewed from the KGE, apart from the ETC, the other merging data significantly outperforms the original precipitation data, demonstrating that the consideration of spatial heterogeneity in merging data can improve the accuracy of precipitation data.\n\n(3) The results of CNN merging data are better than the  ANN and ETC merging results of precipitation data in all aspects, which means that the CNN method in precipitation data merging performs better than the ANN and the ETC merging methods.\n\nIn conclusion, the CNN merging of precipitation data outperforms the other data in both meteorological evaluation and hydrological simulation, indicating that it has a good correspondence with the gauged data and can exhibit better spatial distribution. Deep learning-based multi-source precipitation merging can generate better-quality data that synthesizes the characteristics of each original dataset.\n\nMoreover, on the premise that the original precipitation products used for merging can provide hourly-scale precipitation data, the deep learning-based merging method used in this study, CNN, is also capable of generating hourlyscale precipitation merging data. Additionally, many atmospheric variables closely related to precipitation can be incorporated into the precipitation consolidation process to further increase the accuracy of the model and produce more realistic consolidated precipitation data.\n\nFigure 1\n1Locations of the TP and surrounding regions, study basins (SHR and SYR) and meteorological gauges.\n\nFigure 2\n2Spatial distribution of the CC and RMSE for precipitation product in the TP region.\n\nFigure 3\n3Annual regional average precipitation of the whole region and sub-regions of the TP.\n\nFigure 4\n4Quarterly average precipitation on the TP.\n\nFigure 5\n5Spatial distribution of multi-year average precipitation.\n\nFigure 7\n7Boxplot of CC, BIAS, and STDRATIO evaluation in gauges. In Figures 7, 8 and 9, letters A-F represent CN05.1, GPM IMERG, TPReanalysis, and merging data of ANN, CNN and ETC, respectively.\n\nFigure 8\n8Boxplot of MAE and RMSE evaluation in gauges.\n\nFigure 9\n9Boxplot of POD, FAR, CSI evaluation in gauges.\n\nFigure 10\n10Boxplot of NSE, KGE, PBIAS evaluations in the SYR and SHR basins. Letters A-G in this figure represent CN05.1, GPM IMERG, TPReanalysis, the merging data of ANN, CNN and ETC, and the interpolated gauged data, respectively.\n\nFigure 11\n11Simulated runoff at the SYR basin outlet station for 2001-2017.\n\nTable 1\n1Data sources and informationData \nName \nSpatial \nresolution \n\nTemporal \nresolution \nTime range \nSource \n\nGauged observation data \nDataset of daily climate data from \nChinese surface stations (V3.0) \ngauged \n-\n2000-2020 \nhttp://data.cma.cn/ \n\nInterpolated grid data \nCN05.1 \n0.25°×0.25°daily \n1961-2020 \nWu and Gao (2013) \n\nRemote sensing satellite data \nGPM IMERG Final Precipitation L3 \n1 day 0.1 degree x 0.1 degree V06 \n0.1°×0.1°daily \n2001-2021 \nhttps://disc.gsfc.nasa.gov \n\nDynamic downscaling data \nDynamic downscaling product \nover the Third Pole Region \n9 km×9 km \nhourly \n1980-2019 http://biggeo.gvc.gu.se/TPReanalysis/ \n\n\nTable 2\n2Parameters of the XAJ model coupled with the CemaNeige snowmelt moduleModule \nParameter \nDescription \nRange \n\nCemaNeige \nKf \nDegree-day factor (mm (°C d) \n−1 ) \n[0, 10] \n\nCTh \nPonderation coefficient of the snow thermic state \n[0, 1] \n\nXAJ \n\nWM \nAreal soil moisture storage capacity (mm) \n[100, 160] \n\nX \nProportion of upper-layer soil moisture storage capacity to WM \n[0, 1] \n\nY \nProportion of lower-layer soil moisture storage capacity to WM \n[0, 1] \n\nB \nExponent of the soil moisture storage capacity curve \n[0, 0.6] \n\nKC \nRatio of potential evapotranspiration to pan \n[0, 1] \n\nC \nCoefficient of deep evapotranspiration \n[0, 0.2] \n\nIM \nRatio of the impervious area to the total area of the basin \n[0, 1] \n\nSM \nAreal mean free water capacity of the surface soil layer (mm) \n[0, 60] \n\nEX \nExponent of the free water capacity curve \n[0.1, 1.5] \n\nKI \nCoefficient of the free water storage to interflow \n[0.01, 0.5] \n\nKG \nCoefficient of the free water storage to ground flow \n[0.01, 0.5] \n\nCI \nRecession constant of the lower interflow storage \n[0.8, 1] \n\nCG \nRecession constant of the groundwater storage \n[0.8, 1] \n\nN \nNumber of reservoirs in the instantaneous unit hydrograph \n[0, 5] \n\nK \nCommon storage coefficient in the instantaneous unit hydrograph \n[0, 5] \n\n\nTable 3\n3Metrics and formulas of evaluationa) \n\nEvaluation \nIndicator \nAbbreviation \nFormula \n\nMeteorological \n\nSpearman correlation coefficient \nCC \n\n( \n) \n( ) ( ) \n\nP P \n\nP P \nCC = \n\ncov , \n\nr rs \n\nr \nrs \n\nAverage bias \nBIAS \nP P \nP \nBIAS = \n\ns \n\ns \n\nStandard deviation ratio \nSTDRATIO \n\n( ) \n\nP \nP \n\nSTDRATIO = \n( ) \n\ns \n\nMean-absolute error \nMAE \nP P N \nMAE = \n/ \n\ns \n\nRoot-mean-square error \nRMSE \n\n( ) \n\nP P \nN \nRMSE = \n/ \n\ns \n\n2 \n\nProbability of detection \nPOD \nH \nH M \nPOD = + \n\nFalse alarm rate \nFAR \nF \nH F \nFAR = + \n\nCritical success index \nCSI \nH \nH F M \nCSI = + + \n\nHydrological \n\nWater volume error \nPBIAS \n\n( \n) \n\nR R \n\nR \nPBIAS = \n\ns \n\ns \n\nNash efficiency coefficient \nNSE \n\n( \n) \n\n( \n) \n\nR R \n\nR R \n\nNSE = 1 \n\ns \n\ns \ns \n\n2 \n\n2 \n\nKling-Gupta Efficiency Coefficient \nKGE \n\n( ) \n( ) \n( ) \n\nR R \n\nR R \n\nR \nR \n\nR R \nR \n\nKGE = 1 \n\ncov , \n\n( ) \n1 + \n( ) 1 + \n\ns \n\ns \ns \n\ns \n\ns \n\n\nNan T, et al. Sci China Earth Sci April (2023) Vol.66 No.4   \n\nPPDIST, global 0.1°daily and 3-hourly precipitation probability distribution climatologies for 1979. H E Beck, S Westra, J Tan, F Pappenberger, G J Huffman, T R Mcvicar, G J Gründemann, N Vergopolan, H J Fowler, Lewis E Verbist, K Wood, E F , 10.1038/s41597-020-00631-xSci Data7302Beck H E, Westra S, Tan J, Pappenberger F, Huffman G J, McVicar T R, Gründemann G J, Vergopolan N, Fowler H J, Lewis E, Verbist K, Wood E F. 2020. PPDIST, global 0.1°daily and 3-hourly precipitation prob- ability distribution climatologies for 1979-2018. Sci Data, 7: 302\n\nAssessment of satellite rainfall products for streamflow simulation in medium watersheds of the Ethiopian Highlands. M M Bitew, M Gebremichael, 10.5194/hess-15-1147-2011Hydrol Earth Syst Sci. 15Bitew M M, Gebremichael M. 2011a. Assessment of satellite rainfall products for streamflow simulation in medium watersheds of the Ethiopian Highlands. Hydrol Earth Syst Sci, 15: 1147-1155\n\nEvaluation of satellite rainfall products through hydrologic simulation in a fully distributed hydrologic model. M M Bitew, M Gebremichael, 10.1029/2010WR009917Water Resour Res. 476526Bitew M M, Gebremichael M. 2011b. Evaluation of satellite rainfall pro- ducts through hydrologic simulation in a fully distributed hydrologic model. Water Resour Res, 47: W06526\n\nA brief evaluation of precipitation from the north american regional reanalysis. M S Bukovsky, D J Karoly, 10.1175/JHM595.1J Hydrometeorol. 8Bukovsky M S, Karoly D J. 2007. A brief evaluation of precipitation from the north american regional reanalysis. J Hydrometeorol, 8: 837-846\n\nWater Cycle Mechanism in the Source Region of Yangtze River (in Chinese). J Chen, J Yangtze River Sci Res Inst. 30Chen J. 2013. Water Cycle Mechanism in the Source Region of Yangtze River (in Chinese). J Yangtze River Sci Res Inst, 30: 1-5\n\nEvaluation of IMERG and TRMM 3B43 monthly precipitation products over mainland China. F Chen, X Li, 10.3390/rs8060472Remote Sens. 8472Chen F, Li X. 2016. Evaluation of IMERG and TRMM 3B43 monthly precipitation products over mainland China. Remote Sens, 8: 472\n\nMulti-Site precipitation downscaling using a stochastic weather generator. J Chen, H Chen, S Guo, 10.1007/s00382-017-3731-9Clim Dyn. 50Chen J, Chen H, Guo S. 2018. Multi-Site precipitation downscaling using a stochastic weather generator. Clim Dyn, 50: 1975-1992\n\n2021. spatial performance of multiple reanalysis precipitation datasets on the southern slope of Central Himalaya. Y Chen, S Sharma, X Zhou, K Yang, X Li, X Niu, X Hu, N Khadka, 10.1016/j.atmosres.2020.105365Atmos Res. 250105365Chen Y, Sharma S, Zhou X, Yang K, Li X, Niu X, Hu X, Khadka N. 2021. spatial performance of multiple reanalysis precipitation datasets on the southern slope of Central Himalaya. Atmos Res, 250: 105365\n\nEffective and efficient global optimization for conceptual rainfall-runoff models. Q Duan, S Sorooshian, V Gupta, 10.1029/91WR02985Water Resour Res. 28Duan Q, Sorooshian S, Gupta V. 1992. Effective and efficient global op- timization for conceptual rainfall-runoff models. Water Resour Res, 28: 1015-1031\n\nProlongation of SMAP to spatiotemporally seamless coverage of continental U.S. using a deep learning neural network. K Fang, C Shen, D Kifer, X Yang, 10.1002/2017GL075619Geophys Res Lett. 441139Fang K, Shen C, Kifer D, Yang X. 2017. Prolongation of SMAP to spa- tiotemporally seamless coverage of continental U.S. using a deep learning neural network. Geophys Res Lett, 44: 11,030-11,039\n\nSummer precipitation and latent heating over the Tibetan Plateau based on TRMM measurements. Y Fu, Q Liu, Y Zi, S Feng, Y Li, G Liu, Fu Y, Liu Q, Zi Y, Feng S, Li Y, Liu G. 2008. Summer precipitation and latent heating over the Tibetan Plateau based on TRMM measurements\n\nFigure 12 Simulated runoff at the SHR basin outlet station for. Plateau Mountain Meteorol Res. 28in ChineseFigure 12 Simulated runoff at the SHR basin outlet station for 2001-2017. (in Chinese). Plateau Mountain Meteorol Res, 28: 8-18\n\nEvaluation of high-resolution satellite precipitation products using rain gauge observations over the Tibetan Plateau. Y C Gao, M F Liu, 10.5194/hess-17-837-2013Hydrol Earth Syst Sci. 17Gao Y C, Liu M F. 2013. Evaluation of high-resolution satellite pre- cipitation products using rain gauge observations over the Tibetan Plateau. Hydrol Earth Syst Sci, 17: 837-849\n\nEvaluation of WRF mesoscale climate simulations over the Tibetan Plateau during 1979-2011. Y Gao, J Xu, D Chen, 10.1175/JCLI-D-14-00300.1J Clim. 28Gao Y, Xu J, Chen D. 2015. Evaluation of WRF mesoscale climate si- mulations over the Tibetan Plateau during 1979-2011. J Clim, 28: 2823-2841\n\nEvaluation of a convection-permitting modeling of precipitation over the Tibetan Plateau and its influences on the simulation of snow-cover fraction. Y Gao, Chen F Jiang, Y , 10.1175/JHM-D-19-0277.1J Hydrometeorol. 21Gao Y, Chen F, Jiang Y. 2020. Evaluation of a convection-permitting modeling of precipitation over the Tibetan Plateau and its influences on the simulation of snow-cover fraction. J Hydrometeorol, 21: 1531-1548\n\nJ Gu, Z Wang, J Kuen, L Ma, A Shahroudy, B Shuai, T Liu, X Wang, G Wang, J Cai, T Chen, 10.1016/j.patcog.2017.10.013Recent advances in convolutional neural networks. Pattern Recognition. 77Gu J, Wang Z, Kuen J, Ma L, Shahroudy A, Shuai B, Liu T, Wang X, Wang G, Cai J, Chen T. 2018. Recent advances in convolutional neural net- works. Pattern Recognition, 77: 354-377\n\nGeneration of an improved precipitation data set from multisource information over the Tibetan Plateau. Z Hong, Z Han, X Li, D Long, G Tang, J Wang, 10.1175/JHM-D-20-0252.1J Hydrometeorol. 22Hong Z, Han Z, Li X, Long D, Tang G, Wang J. 2021. Generation of an improved precipitation data set from multisource information over the Tibetan Plateau. J Hydrometeorol, 22: 1275-1295\n\nThe global precipitation measurement mission. A Y Hou, R K Kakar, S Neeck, A A Azarbarzin, C D Kummerow, M Kojima, R Oki, K Nakamura, T Iguchi, 10.1175/BAMS-D-13-00164.1Bull Amer Meteorol Soc. 95Hou A Y, Kakar R K, Neeck S, Azarbarzin A A, Kummerow C D, Kojima M, Oki R, Nakamura K, Iguchi T. 2014. The global precipitation measurement mission. Bull Amer Meteorol Soc, 95: 701-722\n\nCoupling a markov chain and support vector machine for at-site downscaling of daily precipitation. Y K Hou, H Chen, C Y Xu, J Chen, S L Guo, 10.1175/JHM-D-16-0130.1J Hydrometeorol. 18Hou Y K, Chen H, Xu C Y, Chen J, Guo S L. 2017. Coupling a markov chain and support vector machine for at-site downscaling of daily precipitation. J Hydrometeorol, 18: 2385-2406\n\nClimate change will affect the Asian water towers. W W Immerzeel, Van Beek L P H, M F P Bierkens, 10.1126/science.1183188Science. 328Immerzeel W W, van Beek L P H, Bierkens M F P. 2010. Climate change will affect the Asian water towers. Science, 328: 1382-1385\n\nHow do GPM IMERG precipitation estimates perform as hydrological model forcing? Evaluation for 300 catchments across mainland. L Jiang, P Bauer-Gottwein, 10.1016/j.jhydrol.2019.03.042China. J Hydrol. 572Jiang L, Bauer-Gottwein P. 2019. How do GPM IMERG precipitation estimates perform as hydrological model forcing? Evaluation for 300 catchments across mainland China. J Hydrol, 572: 486-500\n\nComparison of hydrological impacts of climate change simulated by six hydrological models in the Dongjiang Basin. T Jiang, Y D Chen, C Xu, X Chen, X Chen, V P Singh, 10.1016/j.jhydrol.2007.01.010South China. J Hydrol. 336Jiang T, Chen Y D, Xu C, Chen X, Chen X, Singh V P. 2007. Comparison of hydrological impacts of climate change simulated by six hydrological models in the Dongjiang Basin, South China. J Hydrol, 336: 316-333\n\nA downscaling approach for constructing high-resolution precipitation dataset over the Tibetan Plateau from ERA5 reanalysis. Y Jiang, K Yang, C Shao, X Zhou, L Zhao, Y Chen, H Wu, 10.1016/j.atmosres.2021.105574Atmos Res. 256105574Jiang Y, Yang K, Shao C, Zhou X, Zhao L, Chen Y, Wu H. 2021. A downscaling approach for constructing high-resolution precipitation dataset over the Tibetan Plateau from ERA5 reanalysis. Atmos Res, 256: 105574\n\nImproved estimates of pentad precipitation through the merging of independent precipitation data sets. R D Koster, Q Liu, R H Reichle, G J Huffman, 10.1029/2021WR030330Water Resources Res. 572021Koster R D, Liu Q, Reichle R H, Huffman G J. 2021. Improved estimates of pentad precipitation through the merging of independent precipita- tion data sets. Water Resources Res, 57: e2021W\n\nAccuracy evaluation and comparison of GPM and TRMM precipitation product over Chinese mainland (in Chinese). Q Li, W Zhang, L Yi, J Liu, H Chen, Adv Water Sci. 29Li Q, Zhang W, Yi L, Liu J, Chen H. 2018. Accuracy evaluation and comparison of GPM and TRMM precipitation product over Chinese mainland (in Chinese). Adv Water Sci, 29: 303-313\n\nCharacterizing precipitation in high altitudes of the western Tibetan Plateau with a focus on major glacier areas. D Li, K Yang, W Tang, X Li, X Zhou, D Guo, 10.1002/joc.6509Int J Climatol. 40Li D, Yang K, Tang W, Li X, Zhou X, Guo D. 2020. Characterizing precipitation in high altitudes of the western Tibetan Plateau with a focus on major glacier areas. Int J Climatol, 40: 5114-5127\n\nA high-accuracy rainfall dataset by merging multiple satellites and dense gauges over the southern Tibetan Plateau for 2014-2019 warm seasons. K Li, F Tian, M Y A Khan, R Xu, Z He, L Yang, H Lu, Y Ma, 10.5194/essd-13-5455-2021Earth Syst Sci Data. 13Li K, Tian F, Khan M Y A, Xu R, He Z, Yang L, Lu H, Ma Y. 2021. A high-accuracy rainfall dataset by merging multiple satellites and dense gauges over the southern Tibetan Plateau for 2014-2019 warm seasons. Earth Syst Sci Data, 13: 5455-5467\n\nImpacts of snow assimilation on seasonal snow and meteorological forecasts for the Tibetan Plateau. W Li, J Chen, L Li, Y J Orsolini, Y Xiang, R Senan, P De Rosnay, The Cryosphere Discuss. Li W, Chen J, Li L, Orsolini Y J, Xiang Y, Senan R, de Rosnay P. 2022. Impacts of snow assimilation on seasonal snow and meteorological forecasts for the Tibetan Plateau. The Cryosphere Discuss. 1-31\n\nImpacts of biasorrected ERA5 initial snow depth on dynamical downscaling simulations for the Tibetan Plateau. Q Lin, J Chen, D Chen, X Wang, W Li, D Scherer, 10.1029/2021JD035625J Geophys Res-Atmos. 126Lin Q, Chen J, Chen D, Wang X, Li W, Scherer D. 2021. Impacts of bias- orrected ERA5 initial snow depth on dynamical downscaling simula- tions for the Tibetan Plateau. J Geophys Res-Atmos, 126: e2021JD035625\n\nSpatial and temporal variation of summer precipitation over the eastern Tibetan Plateau and the north Atlantic oscillation. X Liu, Z Y Yin, 10.1175/1520-0442(2001)014&lt;2896:SATVOS&gt;2.0.CO;2J Clim. 14Liu X, Yin Z Y. 2001. Spatial and temporal variation of summer pre- cipitation over the eastern Tibetan Plateau and the north Atlantic os- cillation. J Clim, 14: 2896-2909\n\nEvaluation of spatial and temporal performances of ERA-interim precipitation and temperature in mainland. Z Liu, Y Liu, S Wang, X Yang, L Wang, M H A Baig, Chi W Wang, Z , 10.1175/JCLI-D-17-0212.1China. J Clim. 31Liu Z, Liu Y, Wang S, Yang X, Wang L, Baig M H A, Chi W, Wang Z. 2018. Evaluation of spatial and temporal performances of ERA-interim precipitation and temperature in mainland China. J Clim, 31: 4347- 4365\n\nEvaluation and hydrological utility of the latest GPM IMERG V5 and GSMaP V7 precipitation products over the Tibetan Plateau. D Lu, B Yong, 10.3390/rs10122022Remote Sens. 102022Lu D, Yong B. 2018. Evaluation and hydrological utility of the latest GPM IMERG V5 and GSMaP V7 precipitation products over the Tibetan Plateau. Remote Sens, 10: 2022\n\nOur skill in modeling mountain rain and snow is bypassing the skill of our observational networks. J Lundquist, M Hughes, E Gutmann, S Kapnick, 10.1175/BAMS-D-19-0001.1Bull Am Meteorol Soc. 100Lundquist J, Hughes M, Gutmann E, Kapnick S. 2019. Our skill in mod- eling mountain rain and snow is bypassing the skill of our observational networks. Bull Am Meteorol Soc, 100: 2473-2490\n\nPerformance of optimally merged multisatellite precipitation products using the dynamic Bayesian model averaging scheme over the Tibetan Plateau. Y Ma, Y Hong, Y Chen, Y Yang, G Tang, Y Yao, D Long, C Li, Z Han, R Liu, 10.1002/2017JD026648J Geophys Res-Atmos. 123Ma Y, Hong Y, Chen Y, Yang Y, Tang G, Yao Y, Long D, Li C, Han Z, Liu R. 2018. Performance of optimally merged multisatellite precipitation products using the dynamic Bayesian model averaging scheme over the Tibetan Plateau. J Geophys Res-Atmos, 123: 814-834\n\nA two-stage blending approach for merging multiple satellite precipitation estimates and rain gauge observations: An experiment in the northeastern Tibetan Plateau. Y Ma, X Sun, H Chen, Y Hong, Y Zhang, 10.5194/hess-25-359-2021Hydrol Earth Syst Sci. 25Ma Y, Sun X, Chen H, Hong Y, Zhang Y. 2021. A two-stage blending approach for merging multiple satellite precipitation estimates and rain gauge observations: An experiment in the northeastern Tibetan Plateau. Hydrol Earth Syst Sci, 25: 359-374\n\nExtended triple collocation: Estimating errors and correlation coefficients with respect to an unknown target. K A Mccoll, J Vogelzang, A G Konings, D Entekhabi, M Piles, A Stoffelen, 10.1002/2014GL061322Geophys Res Lett. 41McColl K A, Vogelzang J, Konings A G, Entekhabi D, Piles M, Stoffelen A. 2014. Extended triple collocation: Estimating errors and correlation coefficients with respect to an unknown target. Geophys Res Lett, 41: 6229-6236\n\nAccuracy analysis of flood forecasting based on the fusion data of satellite and gauge rainfalls in humid region (in Chinese). X Y Min, C G Yang, Y Li, G Cheng, Water Resour Power. 38Min X Y, Yang C G, Li Y, Cheng G. 2020. Accuracy analysis of flood forecasting based on the fusion data of satellite and gauge rainfalls in humid region (in Chinese). Water Resour Power, 38: 1-5\n\nSeasonal Rainfall Variations in Spain (1912-2000) and their Links to Atmospheric Circulation. D Muñoz-Díaz, Rodrigo , F S , 10.1016/j.atmosres.2005.11.005Atmos Res. 81Muñoz-Díaz D, Rodrigo F S. 2006. Seasonal Rainfall Variations in Spain (1912-2000) and their Links to Atmospheric Circulation. Atmos Res, 81: 94-110\n\nSpringtime tropospheric temperature over the Tibetan Plateau and evolutions of the tropical Pacific SST. S Nan, P Zhao, S Yang, J Chen, 10.1029/2008JD011559J Geophys Res. 11410104Nan S, Zhao P, Yang S, Chen J. 2009. Springtime tropospheric temperature over the Tibetan Plateau and evolutions of the tropical Pacific SST. J Geophys Res, 114: D10104\n\nSimulation of summer precipitation diurnal cycles over the Tibetan Plateau at the gray-zone grid spacing for cumulus parameterization. T Ou, D Chen, X Chen, C Lin, K Yang, H W Lai, F Zhang, 10.1007/s00382-020-05181-xClim Dyn. 54Ou T, Chen D, Chen X, Lin C, Yang K, Lai H W, Zhang F. 2020. Simu- lation of summer precipitation diurnal cycles over the Tibetan Plateau at the gray-zone grid spacing for cumulus parameterization. Clim Dyn, 54: 3525-3539\n\nImproving precipitation estimation using convolutional neural network. B Pan, K Hsu, A Aghakouchak, S Sorooshian, 10.1029/2018WR024090Water Resources Res. 55Pan B, Hsu K, AghaKouchak A, Sorooshian S. 2019. Improving pre- cipitation estimation using convolutional neural network. Water Re- sources Res, 55: 2301-2321\n\nRegionalization of catchment hydrological model parameters for global water resources simulations. W Qi, J Chen, L Li, C Y Xu, J Li, Y Xiang, S Zhang, 10.2166/nh.2022.118Hydrol Res. 53Qi W, Chen J, Li L, Xu C Y, Li J, Xiang Y, Zhang S. 2022. Regionalization of catchment hydrological model parameters for global water resources simulations. Hydrol Res, 53: 441-466\n\nChina: The Third Pole. J Qiu, 10.1038/454393aNature. 454Qiu J. 2008. China: The Third Pole. Nature, 454: 393-396\n\nHESS opinions: Incubating deep-learning-powered hydrologic science advances as a community. C Shen, E Laloy, A Elshorbagy, A Albert, J Bales, F J Chang, S Ganguly, K L Hsu, D Kifer, Z Fang, K Fang, D Li, X Li, W Tsai, 10.5194/hess-22-5639-2018Hydrol Earth Syst Sci. 22Shen C, Laloy E, Elshorbagy A, Albert A, Bales J, Chang F J, Ganguly S, Hsu K L, Kifer D, Fang Z, Fang K, Li D, Li X, Tsai W P. 2018. HESS opinions: Incubating deep-learning-powered hydrologic science ad- vances as a community. Hydrol Earth Syst Sci, 22: 5639-5656\n\nLatest update of the climatology and changes in the seasonal distribution of precipitation over China. Y Sui, D Jiang, Z Tian, 10.1007/s00704-012-0810-zTheor Appl Climatol. 113Sui Y, Jiang D, Tian Z. 2013. Latest update of the climatology and changes in the seasonal distribution of precipitation over China. Theor Appl Climatol, 113: 599-610\n\nHydrological evaluation of high-resolution precipitation estimates from the WRF model in the Third Pole River Basins. H Sun, F Su, Z He, T Ou, D Chen, Z Li, Y Li, 10.1175/JHM-D-20-0272.1J Hydrometeorol. 22Sun H, Su F, He Z, Ou T, Chen D, Li Z, Li Y. 2021. Hydrological eva- luation of high-resolution precipitation estimates from the WRF model in the Third Pole River Basins. J Hydrometeorol, 22: 2055-2071\n\nEvaluation of GPM Day-1 IMERG and TMPA Version-7 legacy products over mainland China at multiple spatiotemporal scales. G Tang, Y Ma, D Long, L Zhong, Y Hong, 10.1016/j.jhydrol.2015.12.008J Hydrol. 533Tang G, Ma Y, Long D, Zhong L, Hong Y. 2016. Evaluation of GPM Day- 1 IMERG and TMPA Version-7 legacy products over mainland China at multiple spatiotemporal scales. J Hydrol, 533: 152-167\n\nDocumentation of multifactorial relationships between precipitation and topography of the Tibetan Plateau Using spaceborne precipitation radars. G Tang, D Long, Y Hong, J Gao, W Wan, 10.1016/j.rse.2018.02.007Remote Sens Environ. 208Tang G, Long D, Hong Y, Gao J, Wan W. 2018. Documentation of mul- tifactorial relationships between precipitation and topography of the Tibetan Plateau Using spaceborne precipitation radars. Remote Sens Environ, 208: 82-96\n\nAccuracy assessment and error cause analysis of GPM (V06) in Xiangjiang River catchment. B Tian, H Chen, J Wang, C Y Xu, 10.2166/nh.2021.188Hydrol Res. 52Tian B, Chen H, Wang J, Xu C Y. 2021. Accuracy assessment and error cause analysis of GPM (V06) in Xiangjiang River catchment. Hydrol Res, 52: 1048-1065\n\nEvaluation of satellite precipitation retrievals and their potential utilities in hydrologic modeling over the Tibetan Plateau. K Tong, F Su, D Yang, Z Hao, 10.1016/j.jhydrol.2014.07.044J Hydrol. 519Tong K, Su F, Yang D, Hao Z. 2014. Evaluation of satellite precipitation retrievals and their potential utilities in hydrologic modeling over the Tibetan Plateau. J Hydrol, 519: 423-437\n\nAs simple as possible but not simpler': What is useful in a temperature-based snow-accounting routine? Part 2-Sensitivity analysis of the Cemaneige snow accounting routine on 380 catchments. A Valéry, V Andréassian, C Perrin, 10.1016/j.jhydrol.2014.04.058J Hydrol. 517Valéry A, Andréassian V, Perrin C. 2014. 'As simple as possible but not simpler': What is useful in a temperature-based snow-accounting rou- tine? Part 2-Sensitivity analysis of the Cemaneige snow accounting routine on 380 catchments. J Hydrol, 517: 1176-1187\n\nFramework for developing IDF curves using satellite precipitation: A Case Study Using GPM-IMERG V6 Data. K Venkatesh, R Maheswaran, J Devacharan, 10.1007/s12145-021-00708-0Earth Sci Inform. 15Venkatesh K, Maheswaran R, Devacharan J. 2022. Framework for devel- oping IDF curves using satellite precipitation: A Case Study Using GPM-IMERG V6 Data. Earth Sci Inform, 15: 671-687\n\nPrecipitation over the Tibetan Plateau during recent decades: A review based on observations and simulations. X Wang, G Pang, M Yang, 10.1002/joc.5246Int J Climatol. 38Wang X, Pang G, Yang M. 2018. Precipitation over the Tibetan Plateau during recent decades: A review based on observations and simulations. Int J Climatol, 38: 1116-1131\n\nA framework to quantify the uncertainty contribution of GCMs over multiple sources in hydrological impacts of climate change. H M Wang, J Chen, C Y Xu, J Zhang, H Chen, 10.1029/2020EF001602Earths Future. 8Wang H M, Chen J, Xu C Y, Zhang J, Chen H. 2020. A framework to quantify the uncertainty contribution of GCMs over multiple sources in hydrological impacts of climate change. Earths Future, 8: e2020EF001602\n\nS-wave velocity inversion and prediction using a deep hybrid neural network. J Wang, J Cao, S Zhao, Q Qi, 10.1007/s11430-021-9870-8Sci China Earth Sci. 65Wang J, Cao J, Zhao S, Qi Q. 2022. S-wave velocity inversion and pre- diction using a deep hybrid neural network. Sci China Earth Sci, 65: 724-741\n\nAn evaluation of MÉRA, a highresolution mesoscale regional reanalysis. E Whelan, E Gleeson, J Hanley, 10.1175/JAMC-D-17-0354.1J Appl Meteor Climatol. 57Whelan E, Gleeson E, Hanley J. 2018. An evaluation of MÉRA, a high- resolution mesoscale regional reanalysis. J Appl Meteor Climatol, 57: 2179-2196\n\n. G Wu, Y Liu, B He, Q Bao, A Duan, F F Jin, 10.1038/srep00404Thermal controls on the Asian Summer Monsoon. Sci Rep. 2404Wu G, Liu Y, He B, Bao Q, Duan A, Jin F F. 2012. Thermal controls on the Asian Summer Monsoon. Sci Rep, 2: 404\n\nA Gridded daily observation dataset over China region and comparison with the other datasets (in Chinese). J Wu, X J Gao, Chin J Geophys. 56Wu J, Gao X J. 2013. A Gridded daily observation dataset over China region and comparison with the other datasets (in Chinese). Chin J Geophys, 56: 1151-1169\n\nThree Layers Coupled Watershed Hdrological Model (I) Model Structure and Equation (in Chinese). L H Xiong, S L Guo, J Wuhan. 31Univ Hydr Elec EngXiong L H, Guo S L. 1998. Three Layers Coupled Watershed Hdrological Model (I) Model Structure and Equation (in Chinese). J Wuhan Univ Hydr Elec Eng, 31: 28-31\n\nReview of postprocessing research for remote-sensing precipitation products (in Chinese). L H Xiong, C K Liu, S L Chen, X Zha, Q Ma, Adv Water Sci. 32Xiong L H, Liu C K, Chen S L, Zha X, Ma Q. 2021. Review of post- processing research for remote-sensing precipitation products (in Chi- nese). Adv Water Sci, 32: 627-637\n\nWorld water tower: An atmospheric perspective. X Xu, C Lu, X Shi, S Gao, 10.1029/2008GL035867Geophys Res Lett. 3520815Xu X, Lu C, Shi X, Gao S. 2008. World water tower: An atmospheric perspective. Geophys Res Lett, 35: L20815\n\nGround validation of GPM IMERG and TRMM 3B42V7 rainfall products over Southern Tibetan Plateau based on a high-density rain gauge network. R Xu, F Tian, L Yang, H Hu, H Lu, A Hou, 10.1002/2016JD025418J Geophys Res-Atmos. 122Xu R, Tian F, Yang L, Hu H, Lu H, Hou A. 2017. Ground validation of GPM IMERG and TRMM 3B42V7 rainfall products over Southern Tibetan Plateau based on a high-density rain gauge network. J Geophys Res-Atmos, 122: 910-924\n\nDynamical downscaling of regional climate: A review of methods and limitations. Z Xu, Y Han, Z Yang, 10.1007/s11430-018-9261-5Sci China Earth Sci. 62Xu Z, Han Y, Yang Z. 2019. Dynamical downscaling of regional climate: A review of methods and limitations. Sci China Earth Sci, 62: 365-375\n\nCascading model-based framework for the sustainability assessment of a multipurpose reservoir in a changing climate. W Xu, J Chen, T Su, J S Kim, L Gu, J H Lee, 10.1061/(ASCE)WR.1943-5452.0001501J Water Resour Plann Manage. 1485021029Xu W, Chen J, Su T, Kim J S, Gu L, Lee J H. 2022. Cascading model-based framework for the sustainability assessment of a multipurpose reservoir in a changing climate. J Water Resour Plann Manage, 148: 5021029\n\nDifferent glacier status with atmospheric circulations in Tibetan Plateau and surroundings. T Yao, L Thompson, W Yang, W Yu, Y Gao, X Guo, X Yang, K Duan, H Zhao, B Xu, J Pu, A Lu, Y Xiang, D B Kattel, D Joswiak, 10.1038/nclimate1580Nat Clim Change. 2Yao T, Thompson L, Yang W, Yu W, Gao Y, Guo X, Yang X, Duan K, Zhao H, Xu B, Pu J, Lu A, Xiang Y, Kattel D B, Joswiak D. 2012. Different glacier status with atmospheric circulations in Tibetan Plateau and surroundings. Nat Clim Change, 2: 663-667\n\nAn assessment of the biases of satellite rainfall estimates over the Tibetan Plateau and correction methods based on topographic analysis. Z Y Yin, X Zhang, X Liu, M Colella, X Chen, 10.1175/2007JHM903.1J Hydrometeorol. 9Yin Z Y, Zhang X, Liu X, Colella M, Chen X. 2008. An assessment of the biases of satellite rainfall estimates over the Tibetan Plateau and cor- rection methods based on topographic analysis. J Hydrometeorol, 9: 301-326\n\nReview on multi-source and multi-modal data fusion and integration (in Chinese). H Yu, Z Liang, Y Yan, Inform Stud Theory Appl. 43Yu H, Liang Z, Yan Y. 2020. Review on multi-source and multi-modal data fusion and integration (in Chinese). Inform Stud Theory Appl, 43: 169- 178\n\nThe Xinanjiang Model. R J Zhao, Y L Zhuang, L R Fang, X R Liu, Q S Zhang, Hydrological Forecasting. WallingfordIAHS PressZhao R J, Zhuang Y L, Fang L R, Liu X R, Zhang Q S. 1980. The Xinanjiang Model. In: Hydrological Forecasting, IAHS Publication No. 129. Wallingford: IAHS Press. 351-356\n\nAnalysis of XAJ model parameters (in Chinese). R J Zhao, P L Wang, J China Hydrol. 6Zhao R J, Wang P L. 1988. Analysis of XAJ model parameters (in Chi- nese). J China Hydrol, (6): 2-9\n\nThe Xinanjiang model applied in China. R J Zhao, 10.1016/0022-1694(92)90096-EJ Hydrol. 135Zhao R J. 1992. The Xinanjiang model applied in China. J Hydrol, 135: 371-381\n\nAttribution of Runoff Variation for the Yellow River Source Region Based on the Budyko Hypothesis (in Chinese). C F Zhang, C S Liu, G D Wang, Jin J Guan, X , China Rural Water Hydropower. 9Zhang C F, Liu C S, Wang G D, Jin J, Guan X. 2020. Attribution of Runoff Variation for the Yellow River Source Region Based on the Budyko Hypothesis (in Chinese). China Rural Water Hydropower, (9): 90-94\n\nMerging multiple satellite-based precipitation products and gauge observations using a novel double machine learning approach. L Zhang, X Li, D Zheng, K Zhang, Q Ma, Y Zhao, Y Ge, 10.1016/j.jhydrol.2021.125969J Hydrol. 594125969Zhang L, Li X, Zheng D, Zhang K, Ma Q, Zhao Y, Ge Y. 2021. Merging multiple satellite-based precipitation products and gauge observations using a novel double machine learning approach. J Hydrol, 594: 125969\n\nImpacts of thermodynamic processes over the Tibetan Plateau on the northern hemispheric climate. X J Zhou, P Zhao, J M Chen, L X Chen, W L Li, 10.1007/s11430-009-0194-9Sci China Ser D-Earth Sci. 52Responsible editor: Xin LIZhou X J, Zhao P, Chen J M, Chen L X, Li W L. 2009. Impacts of thermodynamic processes over the Tibetan Plateau on the northern hemispheric climate. Sci China Ser D-Earth Sci, 52: 1679-1693 (Responsible editor: Xin LI)\n", "annotations": {"author": "[{\"end\":326,\"start\":92},{\"end\":559,\"start\":327},{\"end\":795,\"start\":560},{\"end\":1026,\"start\":796},{\"end\":1259,\"start\":1027}]", "publisher": null, "author_last_name": "[{\"end\":102,\"start\":99},{\"end\":335,\"start\":331},{\"end\":571,\"start\":567},{\"end\":802,\"start\":800},{\"end\":1035,\"start\":1031}]", "author_first_name": "[{\"end\":98,\"start\":92},{\"end\":330,\"start\":327},{\"end\":566,\"start\":560},{\"end\":799,\"start\":796},{\"end\":1030,\"start\":1027}]", "author_affiliation": "[{\"end\":212,\"start\":104},{\"end\":325,\"start\":214},{\"end\":445,\"start\":337},{\"end\":558,\"start\":447},{\"end\":681,\"start\":573},{\"end\":794,\"start\":683},{\"end\":912,\"start\":804},{\"end\":1025,\"start\":914},{\"end\":1145,\"start\":1037},{\"end\":1258,\"start\":1147}]", "title": "[{\"end\":79,\"start\":1},{\"end\":1338,\"start\":1260}]", "venue": null, "abstract": "[{\"end\":4095,\"start\":1630}]", "bib_ref": "[{\"attributes\":{\"ref_id\":\"b42\"},\"end\":4337,\"start\":4326},{\"attributes\":{\"ref_id\":\"b38\"},\"end\":4573,\"start\":4555},{\"attributes\":{\"ref_id\":\"b72\"},\"end\":4591,\"start\":4573},{\"attributes\":{\"ref_id\":\"b56\"},\"end\":4607,\"start\":4591},{\"attributes\":{\"ref_id\":\"b64\"},\"end\":4624,\"start\":4607},{\"attributes\":{\"ref_id\":\"b60\"},\"end\":4852,\"start\":4835},{\"attributes\":{\"ref_id\":\"b19\"},\"end\":4875,\"start\":4852},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":6930,\"start\":6913},{\"attributes\":{\"ref_id\":\"b59\"},\"end\":7039,\"start\":7019},{\"end\":7371,\"start\":7344},{\"attributes\":{\"ref_id\":\"b49\"},\"end\":7391,\"start\":7373},{\"attributes\":{\"ref_id\":\"b65\"},\"end\":7413,\"start\":7396},{\"attributes\":{\"ref_id\":\"b12\"},\"end\":7872,\"start\":7854},{\"attributes\":{\"ref_id\":\"b5\"},\"end\":8297,\"start\":8279},{\"attributes\":{\"ref_id\":\"b46\"},\"end\":8680,\"start\":8662},{\"attributes\":{\"ref_id\":\"b61\"},\"end\":8831,\"start\":8815},{\"attributes\":{\"ref_id\":\"b3\"},\"end\":9278,\"start\":9255},{\"attributes\":{\"ref_id\":\"b55\"},\"end\":9298,\"start\":9278},{\"attributes\":{\"ref_id\":\"b30\"},\"end\":9317,\"start\":9300},{\"attributes\":{\"ref_id\":\"b62\"},\"end\":10408,\"start\":10391},{\"attributes\":{\"ref_id\":\"b32\"},\"end\":10433,\"start\":10410},{\"attributes\":{\"ref_id\":\"b13\"},\"end\":10886,\"start\":10869},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":11354,\"start\":11336},{\"attributes\":{\"ref_id\":\"b25\"},\"end\":11372,\"start\":11356},{\"attributes\":{\"ref_id\":\"b22\"},\"end\":11878,\"start\":11859},{\"attributes\":{\"ref_id\":\"b66\"},\"end\":13405,\"start\":13388},{\"attributes\":{\"ref_id\":\"b36\"},\"end\":13801,\"start\":13784},{\"attributes\":{\"ref_id\":\"b71\"},\"end\":14041,\"start\":14022},{\"attributes\":{\"ref_id\":\"b33\"},\"end\":14829,\"start\":14813},{\"attributes\":{\"ref_id\":\"b34\"},\"end\":15652,\"start\":15636},{\"attributes\":{\"ref_id\":\"b16\"},\"end\":16240,\"start\":16222},{\"attributes\":{\"ref_id\":\"b23\"},\"end\":16462,\"start\":16442},{\"attributes\":{\"ref_id\":\"b32\"},\"end\":17426,\"start\":17402},{\"attributes\":{\"ref_id\":\"b25\"},\"end\":17442,\"start\":17426},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":17459,\"start\":17442},{\"attributes\":{\"ref_id\":\"b39\"},\"end\":17477,\"start\":17461},{\"attributes\":{\"ref_id\":\"b40\"},\"end\":18177,\"start\":18160},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":22355,\"start\":22343},{\"attributes\":{\"ref_id\":\"b57\"},\"end\":23354,\"start\":23337},{\"attributes\":{\"ref_id\":\"b17\"},\"end\":24391,\"start\":24373},{\"end\":24856,\"start\":24850},{\"end\":24862,\"start\":24856},{\"end\":24868,\"start\":24862},{\"end\":24874,\"start\":24868},{\"end\":24880,\"start\":24874},{\"end\":24886,\"start\":24880},{\"end\":24892,\"start\":24886},{\"end\":24898,\"start\":24892},{\"end\":24904,\"start\":24898},{\"end\":24910,\"start\":24904},{\"end\":24916,\"start\":24910},{\"end\":24922,\"start\":24916},{\"end\":24928,\"start\":24922},{\"end\":24934,\"start\":24928},{\"end\":24940,\"start\":24934},{\"attributes\":{\"ref_id\":\"b51\"},\"end\":25065,\"start\":25041},{\"attributes\":{\"ref_id\":\"b39\"},\"end\":25718,\"start\":25701},{\"attributes\":{\"ref_id\":\"b45\"},\"end\":25735,\"start\":25718},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":28312,\"start\":28295},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":28486,\"start\":28467},{\"attributes\":{\"ref_id\":\"b43\"},\"end\":28504,\"start\":28486},{\"attributes\":{\"ref_id\":\"b40\"},\"end\":28521,\"start\":28504},{\"attributes\":{\"ref_id\":\"b54\"},\"end\":30055,\"start\":30036},{\"attributes\":{\"ref_id\":\"b35\"},\"end\":30937,\"start\":30916},{\"attributes\":{\"ref_id\":\"b23\"},\"end\":31208,\"start\":31188},{\"attributes\":{\"ref_id\":\"b67\"},\"end\":31722,\"start\":31704},{\"attributes\":{\"ref_id\":\"b69\"},\"end\":31976,\"start\":31964},{\"attributes\":{\"ref_id\":\"b21\"},\"end\":31995,\"start\":31976},{\"attributes\":{\"ref_id\":\"b68\"},\"end\":32118,\"start\":32097},{\"attributes\":{\"ref_id\":\"b58\"},\"end\":32256,\"start\":32235},{\"attributes\":{\"ref_id\":\"b41\"},\"end\":32917,\"start\":32901},{\"attributes\":{\"ref_id\":\"b50\"},\"end\":33366,\"start\":33345},{\"attributes\":{\"ref_id\":\"b53\"},\"end\":33384,\"start\":33366},{\"attributes\":{\"ref_id\":\"b37\"},\"end\":34423,\"start\":34393},{\"attributes\":{\"ref_id\":\"b18\"},\"end\":34440,\"start\":34423},{\"attributes\":{\"ref_id\":\"b6\"},\"end\":34458,\"start\":34440},{\"attributes\":{\"ref_id\":\"b8\"},\"end\":34526,\"start\":34507},{\"attributes\":{\"ref_id\":\"b0\"},\"end\":36340,\"start\":36322},{\"attributes\":{\"ref_id\":\"b48\"},\"end\":36358,\"start\":36340},{\"attributes\":{\"ref_id\":\"b28\"},\"end\":42978,\"start\":42961},{\"attributes\":{\"ref_id\":\"b31\"},\"end\":43955,\"start\":43936},{\"attributes\":{\"ref_id\":\"b29\"},\"end\":51505,\"start\":51486},{\"attributes\":{\"ref_id\":\"b44\"},\"end\":51522,\"start\":51505}]", "figure": "[{\"attributes\":{\"id\":\"fig_0\"},\"end\":59049,\"start\":58940},{\"attributes\":{\"id\":\"fig_1\"},\"end\":59144,\"start\":59050},{\"attributes\":{\"id\":\"fig_2\"},\"end\":59240,\"start\":59145},{\"attributes\":{\"id\":\"fig_3\"},\"end\":59294,\"start\":59241},{\"attributes\":{\"id\":\"fig_4\"},\"end\":59363,\"start\":59295},{\"attributes\":{\"id\":\"fig_5\"},\"end\":59560,\"start\":59364},{\"attributes\":{\"id\":\"fig_6\"},\"end\":59617,\"start\":59561},{\"attributes\":{\"id\":\"fig_7\"},\"end\":59675,\"start\":59618},{\"attributes\":{\"id\":\"fig_8\"},\"end\":59910,\"start\":59676},{\"attributes\":{\"id\":\"fig_9\"},\"end\":59987,\"start\":59911},{\"attributes\":{\"id\":\"tab_0\",\"type\":\"table\"},\"end\":60628,\"start\":59988},{\"attributes\":{\"id\":\"tab_1\",\"type\":\"table\"},\"end\":61902,\"start\":60629},{\"attributes\":{\"id\":\"tab_2\",\"type\":\"table\"},\"end\":62793,\"start\":61903}]", "paragraph": "[{\"end\":5455,\"start\":4111},{\"end\":6444,\"start\":5457},{\"end\":10096,\"start\":6446},{\"end\":12666,\"start\":10098},{\"end\":13572,\"start\":12668},{\"end\":15110,\"start\":13574},{\"end\":17008,\"start\":15112},{\"end\":18553,\"start\":17010},{\"end\":19092,\"start\":18555},{\"end\":20830,\"start\":19094},{\"end\":21915,\"start\":20867},{\"end\":22679,\"start\":21917},{\"end\":23230,\"start\":22714},{\"end\":24038,\"start\":23257},{\"end\":25335,\"start\":24072},{\"end\":25800,\"start\":25364},{\"end\":27185,\"start\":25811},{\"end\":27559,\"start\":27208},{\"end\":28522,\"start\":27584},{\"end\":30589,\"start\":28524},{\"end\":31642,\"start\":30621},{\"end\":32918,\"start\":31664},{\"end\":33605,\"start\":32920},{\"end\":34180,\"start\":33607},{\"end\":35428,\"start\":34182},{\"end\":35678,\"start\":35430},{\"end\":36899,\"start\":35737},{\"end\":38244,\"start\":36935},{\"end\":40980,\"start\":38375},{\"end\":43135,\"start\":40982},{\"end\":46752,\"start\":43196},{\"end\":48330,\"start\":46754},{\"end\":49078,\"start\":48332},{\"end\":49420,\"start\":49151},{\"end\":50892,\"start\":49422},{\"end\":51838,\"start\":50894},{\"end\":52795,\"start\":51840},{\"end\":53865,\"start\":52823},{\"end\":56662,\"start\":53867},{\"end\":57336,\"start\":56694},{\"end\":57781,\"start\":57338},{\"end\":58025,\"start\":57783},{\"end\":58431,\"start\":58027},{\"end\":58939,\"start\":58433}]", "formula": null, "table_ref": "[{\"attributes\":{\"ref_id\":\"tab_0\"},\"end\":25744,\"start\":25737},{\"attributes\":{\"ref_id\":\"tab_1\"},\"end\":33604,\"start\":33597},{\"attributes\":{\"ref_id\":\"tab_2\"},\"end\":36252,\"start\":36245},{\"attributes\":{\"ref_id\":\"tab_2\"},\"end\":37571,\"start\":37564}]", "section_header": "[{\"attributes\":{\"n\":\"1.\"},\"end\":4109,\"start\":4097},{\"attributes\":{\"n\":\"2.\"},\"end\":20852,\"start\":20833},{\"attributes\":{\"n\":\"2.1\"},\"end\":20865,\"start\":20855},{\"attributes\":{\"n\":\"2.2\"},\"end\":22686,\"start\":22682},{\"attributes\":{\"n\":\"2.2.1\"},\"end\":22712,\"start\":22689},{\"attributes\":{\"n\":\"2.2.2\"},\"end\":23255,\"start\":23233},{\"attributes\":{\"n\":\"2.2.3\"},\"end\":24070,\"start\":24041},{\"attributes\":{\"n\":\"2.2.4\"},\"end\":25362,\"start\":25338},{\"attributes\":{\"n\":\"3.\"},\"end\":25809,\"start\":25803},{\"attributes\":{\"n\":\"3.1\"},\"end\":27206,\"start\":27188},{\"attributes\":{\"n\":\"3.2\"},\"end\":27582,\"start\":27562},{\"attributes\":{\"n\":\"3.3\"},\"end\":30619,\"start\":30592},{\"attributes\":{\"n\":\"3.4\"},\"end\":31662,\"start\":31645},{\"attributes\":{\"n\":\"3.5\"},\"end\":35699,\"start\":35681},{\"attributes\":{\"n\":\"3.5.1\"},\"end\":35735,\"start\":35702},{\"attributes\":{\"n\":\"3.5.2\"},\"end\":36933,\"start\":36902},{\"attributes\":{\"n\":\"4.\"},\"end\":38269,\"start\":38247},{\"attributes\":{\"n\":\"4.1\"},\"end\":38310,\"start\":38272},{\"attributes\":{\"n\":\"4.1.1\"},\"end\":38350,\"start\":38313},{\"attributes\":{\"n\":\"4.1.2\"},\"end\":38373,\"start\":38353},{\"attributes\":{\"n\":\"4.1.3\"},\"end\":43194,\"start\":43138},{\"attributes\":{\"n\":\"4.2\"},\"end\":49121,\"start\":49081},{\"attributes\":{\"n\":\"4.2.1\"},\"end\":49149,\"start\":49124},{\"attributes\":{\"n\":\"4.2.2\"},\"end\":52821,\"start\":52798},{\"attributes\":{\"n\":\"5.\"},\"end\":56692,\"start\":56665},{\"end\":58949,\"start\":58941},{\"end\":59059,\"start\":59051},{\"end\":59154,\"start\":59146},{\"end\":59250,\"start\":59242},{\"end\":59304,\"start\":59296},{\"end\":59373,\"start\":59365},{\"end\":59570,\"start\":59562},{\"end\":59627,\"start\":59619},{\"end\":59686,\"start\":59677},{\"end\":59921,\"start\":59912},{\"end\":59996,\"start\":59989},{\"end\":60637,\"start\":60630},{\"end\":61911,\"start\":61904}]", "table": "[{\"end\":60628,\"start\":60026},{\"end\":61902,\"start\":60709},{\"end\":62793,\"start\":61947}]", "figure_caption": "[{\"end\":59049,\"start\":58951},{\"end\":59144,\"start\":59061},{\"end\":59240,\"start\":59156},{\"end\":59294,\"start\":59252},{\"end\":59363,\"start\":59306},{\"end\":59560,\"start\":59375},{\"end\":59617,\"start\":59572},{\"end\":59675,\"start\":59629},{\"end\":59910,\"start\":59689},{\"end\":59987,\"start\":59924},{\"end\":60026,\"start\":59998},{\"end\":60709,\"start\":60639},{\"end\":61947,\"start\":61913}]", "figure_ref": "[{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":6061,\"start\":6053},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":20896,\"start\":20887},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":22678,\"start\":22670},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":23184,\"start\":23176},{\"attributes\":{\"ref_id\":\"fig_1\"},\"end\":37581,\"start\":37573},{\"attributes\":{\"ref_id\":\"fig_2\"},\"end\":38032,\"start\":38024},{\"attributes\":{\"ref_id\":\"fig_2\"},\"end\":38112,\"start\":38103},{\"attributes\":{\"ref_id\":\"fig_2\"},\"end\":38144,\"start\":38134},{\"attributes\":{\"ref_id\":\"fig_2\"},\"end\":38556,\"start\":38545},{\"attributes\":{\"ref_id\":\"fig_2\"},\"end\":39316,\"start\":39307},{\"attributes\":{\"ref_id\":\"fig_2\"},\"end\":40031,\"start\":40022},{\"attributes\":{\"ref_id\":\"fig_3\"},\"end\":40308,\"start\":40300},{\"attributes\":{\"ref_id\":\"fig_2\"},\"end\":41201,\"start\":41193},{\"attributes\":{\"ref_id\":\"fig_3\"},\"end\":41214,\"start\":41206},{\"attributes\":{\"ref_id\":\"fig_4\"},\"end\":43476,\"start\":43468},{\"attributes\":{\"ref_id\":\"fig_4\"},\"end\":43605,\"start\":43596},{\"attributes\":{\"ref_id\":\"fig_4\"},\"end\":43761,\"start\":43751},{\"attributes\":{\"ref_id\":\"fig_4\"},\"end\":43927,\"start\":43917},{\"attributes\":{\"ref_id\":\"fig_4\"},\"end\":44107,\"start\":44097},{\"attributes\":{\"ref_id\":\"fig_4\"},\"end\":44131,\"start\":44122},{\"attributes\":{\"ref_id\":\"fig_4\"},\"end\":44453,\"start\":44435},{\"attributes\":{\"ref_id\":\"fig_4\"},\"end\":44835,\"start\":44824},{\"attributes\":{\"ref_id\":\"fig_4\"},\"end\":44846,\"start\":44837},{\"end\":45356,\"start\":45348},{\"end\":45642,\"start\":45624},{\"end\":46750,\"start\":46740},{\"attributes\":{\"ref_id\":\"fig_4\"},\"end\":47714,\"start\":47704},{\"attributes\":{\"ref_id\":\"fig_5\"},\"end\":49404,\"start\":49385},{\"attributes\":{\"ref_id\":\"fig_7\"},\"end\":49418,\"start\":49410},{\"attributes\":{\"ref_id\":\"fig_5\"},\"end\":51007,\"start\":50999},{\"attributes\":{\"ref_id\":\"fig_7\"},\"end\":51020,\"start\":51012},{\"attributes\":{\"ref_id\":\"fig_6\"},\"end\":51532,\"start\":51524},{\"end\":54166,\"start\":54158},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":54583,\"start\":54574},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":54624,\"start\":54614},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":55406,\"start\":55389},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":55584,\"start\":55574},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":55608,\"start\":55598}]", "bib_author_first_name": "[{\"end\":62961,\"start\":62958},{\"end\":62969,\"start\":62968},{\"end\":62979,\"start\":62978},{\"end\":62986,\"start\":62985},{\"end\":63004,\"start\":63001},{\"end\":63017,\"start\":63014},{\"end\":63030,\"start\":63027},{\"end\":63044,\"start\":63043},{\"end\":63060,\"start\":63057},{\"end\":63074,\"start\":63069},{\"end\":63076,\"start\":63075},{\"end\":63087,\"start\":63086},{\"end\":63095,\"start\":63094},{\"end\":63097,\"start\":63096},{\"end\":63531,\"start\":63528},{\"end\":63540,\"start\":63539},{\"end\":63910,\"start\":63907},{\"end\":63919,\"start\":63918},{\"end\":64241,\"start\":64238},{\"end\":64253,\"start\":64252},{\"end\":64255,\"start\":64254},{\"end\":64515,\"start\":64514},{\"end\":64768,\"start\":64767},{\"end\":64776,\"start\":64775},{\"end\":65018,\"start\":65017},{\"end\":65026,\"start\":65025},{\"end\":65034,\"start\":65033},{\"end\":65322,\"start\":65321},{\"end\":65330,\"start\":65329},{\"end\":65340,\"start\":65339},{\"end\":65348,\"start\":65347},{\"end\":65356,\"start\":65355},{\"end\":65362,\"start\":65361},{\"end\":65369,\"start\":65368},{\"end\":65375,\"start\":65374},{\"end\":65720,\"start\":65719},{\"end\":65728,\"start\":65727},{\"end\":65742,\"start\":65741},{\"end\":66060,\"start\":66059},{\"end\":66068,\"start\":66067},{\"end\":66076,\"start\":66075},{\"end\":66085,\"start\":66084},{\"end\":66425,\"start\":66424},{\"end\":66431,\"start\":66430},{\"end\":66438,\"start\":66437},{\"end\":66444,\"start\":66443},{\"end\":66452,\"start\":66451},{\"end\":66458,\"start\":66457},{\"end\":66961,\"start\":66958},{\"end\":66968,\"start\":66967},{\"end\":66970,\"start\":66969},{\"end\":67298,\"start\":67297},{\"end\":67305,\"start\":67304},{\"end\":67311,\"start\":67310},{\"end\":67647,\"start\":67646},{\"end\":67657,\"start\":67653},{\"end\":67659,\"start\":67658},{\"end\":67668,\"start\":67667},{\"end\":67926,\"start\":67925},{\"end\":67932,\"start\":67931},{\"end\":67940,\"start\":67939},{\"end\":67948,\"start\":67947},{\"end\":67954,\"start\":67953},{\"end\":67967,\"start\":67966},{\"end\":67976,\"start\":67975},{\"end\":67983,\"start\":67982},{\"end\":67991,\"start\":67990},{\"end\":67999,\"start\":67998},{\"end\":68006,\"start\":68005},{\"end\":68399,\"start\":68398},{\"end\":68407,\"start\":68406},{\"end\":68414,\"start\":68413},{\"end\":68420,\"start\":68419},{\"end\":68428,\"start\":68427},{\"end\":68436,\"start\":68435},{\"end\":68721,\"start\":68718},{\"end\":68730,\"start\":68727},{\"end\":68739,\"start\":68738},{\"end\":68750,\"start\":68747},{\"end\":68766,\"start\":68763},{\"end\":68778,\"start\":68777},{\"end\":68788,\"start\":68787},{\"end\":68795,\"start\":68794},{\"end\":68807,\"start\":68806},{\"end\":69156,\"start\":69153},{\"end\":69163,\"start\":69162},{\"end\":69173,\"start\":69170},{\"end\":69179,\"start\":69178},{\"end\":69187,\"start\":69186},{\"end\":69189,\"start\":69188},{\"end\":69470,\"start\":69467},{\"end\":69503,\"start\":69498},{\"end\":69806,\"start\":69805},{\"end\":69815,\"start\":69814},{\"end\":70186,\"start\":70185},{\"end\":70197,\"start\":70194},{\"end\":70205,\"start\":70204},{\"end\":70211,\"start\":70210},{\"end\":70219,\"start\":70218},{\"end\":70227,\"start\":70226},{\"end\":70229,\"start\":70228},{\"end\":70627,\"start\":70626},{\"end\":70636,\"start\":70635},{\"end\":70644,\"start\":70643},{\"end\":70652,\"start\":70651},{\"end\":70660,\"start\":70659},{\"end\":70668,\"start\":70667},{\"end\":70676,\"start\":70675},{\"end\":71047,\"start\":71044},{\"end\":71057,\"start\":71056},{\"end\":71066,\"start\":71063},{\"end\":71077,\"start\":71076},{\"end\":71079,\"start\":71078},{\"end\":71435,\"start\":71434},{\"end\":71441,\"start\":71440},{\"end\":71450,\"start\":71449},{\"end\":71456,\"start\":71455},{\"end\":71463,\"start\":71462},{\"end\":71782,\"start\":71781},{\"end\":71788,\"start\":71787},{\"end\":71796,\"start\":71795},{\"end\":71804,\"start\":71803},{\"end\":71810,\"start\":71809},{\"end\":71818,\"start\":71817},{\"end\":72197,\"start\":72196},{\"end\":72203,\"start\":72202},{\"end\":72215,\"start\":72210},{\"end\":72223,\"start\":72222},{\"end\":72229,\"start\":72228},{\"end\":72235,\"start\":72234},{\"end\":72243,\"start\":72242},{\"end\":72249,\"start\":72248},{\"end\":72646,\"start\":72645},{\"end\":72652,\"start\":72651},{\"end\":72660,\"start\":72659},{\"end\":72668,\"start\":72665},{\"end\":72680,\"start\":72679},{\"end\":72689,\"start\":72688},{\"end\":72698,\"start\":72697},{\"end\":73046,\"start\":73045},{\"end\":73053,\"start\":73052},{\"end\":73061,\"start\":73060},{\"end\":73069,\"start\":73068},{\"end\":73077,\"start\":73076},{\"end\":73083,\"start\":73082},{\"end\":73471,\"start\":73470},{\"end\":73478,\"start\":73477},{\"end\":73480,\"start\":73479},{\"end\":73829,\"start\":73828},{\"end\":73836,\"start\":73835},{\"end\":73843,\"start\":73842},{\"end\":73851,\"start\":73850},{\"end\":73859,\"start\":73858},{\"end\":73871,\"start\":73866},{\"end\":73881,\"start\":73878},{\"end\":73883,\"start\":73882},{\"end\":73891,\"start\":73890},{\"end\":74268,\"start\":74267},{\"end\":74274,\"start\":74273},{\"end\":74586,\"start\":74585},{\"end\":74599,\"start\":74598},{\"end\":74609,\"start\":74608},{\"end\":74620,\"start\":74619},{\"end\":75016,\"start\":75015},{\"end\":75022,\"start\":75021},{\"end\":75030,\"start\":75029},{\"end\":75038,\"start\":75037},{\"end\":75046,\"start\":75045},{\"end\":75054,\"start\":75053},{\"end\":75061,\"start\":75060},{\"end\":75069,\"start\":75068},{\"end\":75075,\"start\":75074},{\"end\":75082,\"start\":75081},{\"end\":75558,\"start\":75557},{\"end\":75564,\"start\":75563},{\"end\":75571,\"start\":75570},{\"end\":75579,\"start\":75578},{\"end\":75587,\"start\":75586},{\"end\":76003,\"start\":76000},{\"end\":76013,\"start\":76012},{\"end\":76028,\"start\":76025},{\"end\":76039,\"start\":76038},{\"end\":76052,\"start\":76051},{\"end\":76061,\"start\":76060},{\"end\":76466,\"start\":76463},{\"end\":76475,\"start\":76472},{\"end\":76483,\"start\":76482},{\"end\":76489,\"start\":76488},{\"end\":76810,\"start\":76809},{\"end\":76830,\"start\":76823},{\"end\":76834,\"start\":76833},{\"end\":76836,\"start\":76835},{\"end\":77138,\"start\":77137},{\"end\":77145,\"start\":77144},{\"end\":77153,\"start\":77152},{\"end\":77161,\"start\":77160},{\"end\":77517,\"start\":77516},{\"end\":77523,\"start\":77522},{\"end\":77531,\"start\":77530},{\"end\":77539,\"start\":77538},{\"end\":77546,\"start\":77545},{\"end\":77556,\"start\":77553},{\"end\":77563,\"start\":77562},{\"end\":77904,\"start\":77903},{\"end\":77911,\"start\":77910},{\"end\":77918,\"start\":77917},{\"end\":77933,\"start\":77932},{\"end\":78249,\"start\":78248},{\"end\":78255,\"start\":78254},{\"end\":78263,\"start\":78262},{\"end\":78271,\"start\":78268},{\"end\":78277,\"start\":78276},{\"end\":78283,\"start\":78282},{\"end\":78292,\"start\":78291},{\"end\":78539,\"start\":78538},{\"end\":78722,\"start\":78721},{\"end\":78730,\"start\":78729},{\"end\":78739,\"start\":78738},{\"end\":78753,\"start\":78752},{\"end\":78763,\"start\":78762},{\"end\":78774,\"start\":78771},{\"end\":78783,\"start\":78782},{\"end\":78796,\"start\":78793},{\"end\":78803,\"start\":78802},{\"end\":78812,\"start\":78811},{\"end\":78820,\"start\":78819},{\"end\":78828,\"start\":78827},{\"end\":78834,\"start\":78833},{\"end\":78840,\"start\":78839},{\"end\":79267,\"start\":79266},{\"end\":79274,\"start\":79273},{\"end\":79283,\"start\":79282},{\"end\":79626,\"start\":79625},{\"end\":79633,\"start\":79632},{\"end\":79639,\"start\":79638},{\"end\":79645,\"start\":79644},{\"end\":79651,\"start\":79650},{\"end\":79659,\"start\":79658},{\"end\":79665,\"start\":79664},{\"end\":80036,\"start\":80035},{\"end\":80044,\"start\":80043},{\"end\":80050,\"start\":80049},{\"end\":80058,\"start\":80057},{\"end\":80067,\"start\":80066},{\"end\":80452,\"start\":80451},{\"end\":80460,\"start\":80459},{\"end\":80468,\"start\":80467},{\"end\":80476,\"start\":80475},{\"end\":80483,\"start\":80482},{\"end\":80852,\"start\":80851},{\"end\":80860,\"start\":80859},{\"end\":80868,\"start\":80867},{\"end\":80876,\"start\":80875},{\"end\":80878,\"start\":80877},{\"end\":81199,\"start\":81198},{\"end\":81207,\"start\":81206},{\"end\":81213,\"start\":81212},{\"end\":81221,\"start\":81220},{\"end\":81648,\"start\":81647},{\"end\":81658,\"start\":81657},{\"end\":81673,\"start\":81672},{\"end\":82091,\"start\":82090},{\"end\":82104,\"start\":82103},{\"end\":82118,\"start\":82117},{\"end\":82473,\"start\":82472},{\"end\":82481,\"start\":82480},{\"end\":82489,\"start\":82488},{\"end\":82830,\"start\":82827},{\"end\":82838,\"start\":82837},{\"end\":82848,\"start\":82845},{\"end\":82854,\"start\":82853},{\"end\":82863,\"start\":82862},{\"end\":83192,\"start\":83191},{\"end\":83200,\"start\":83199},{\"end\":83207,\"start\":83206},{\"end\":83215,\"start\":83214},{\"end\":83488,\"start\":83487},{\"end\":83498,\"start\":83497},{\"end\":83509,\"start\":83508},{\"end\":83720,\"start\":83719},{\"end\":83726,\"start\":83725},{\"end\":83733,\"start\":83732},{\"end\":83739,\"start\":83738},{\"end\":83746,\"start\":83745},{\"end\":83754,\"start\":83753},{\"end\":83756,\"start\":83755},{\"end\":84058,\"start\":84057},{\"end\":84064,\"start\":84063},{\"end\":84066,\"start\":84065},{\"end\":84348,\"start\":84345},{\"end\":84357,\"start\":84356},{\"end\":84359,\"start\":84358},{\"end\":84648,\"start\":84645},{\"end\":84659,\"start\":84656},{\"end\":84668,\"start\":84665},{\"end\":84676,\"start\":84675},{\"end\":84683,\"start\":84682},{\"end\":84924,\"start\":84923},{\"end\":84930,\"start\":84929},{\"end\":84936,\"start\":84935},{\"end\":84943,\"start\":84942},{\"end\":85243,\"start\":85242},{\"end\":85249,\"start\":85248},{\"end\":85257,\"start\":85256},{\"end\":85265,\"start\":85264},{\"end\":85271,\"start\":85270},{\"end\":85277,\"start\":85276},{\"end\":85629,\"start\":85628},{\"end\":85635,\"start\":85634},{\"end\":85642,\"start\":85641},{\"end\":85956,\"start\":85955},{\"end\":85962,\"start\":85961},{\"end\":85970,\"start\":85969},{\"end\":85978,\"start\":85975},{\"end\":85985,\"start\":85984},{\"end\":85991,\"start\":85990},{\"end\":85993,\"start\":85992},{\"end\":86375,\"start\":86374},{\"end\":86382,\"start\":86381},{\"end\":86394,\"start\":86393},{\"end\":86402,\"start\":86401},{\"end\":86408,\"start\":86407},{\"end\":86415,\"start\":86414},{\"end\":86422,\"start\":86421},{\"end\":86430,\"start\":86429},{\"end\":86438,\"start\":86437},{\"end\":86446,\"start\":86445},{\"end\":86452,\"start\":86451},{\"end\":86458,\"start\":86457},{\"end\":86464,\"start\":86463},{\"end\":86475,\"start\":86472},{\"end\":86485,\"start\":86484},{\"end\":86923,\"start\":86920},{\"end\":86930,\"start\":86929},{\"end\":86939,\"start\":86938},{\"end\":86946,\"start\":86945},{\"end\":86957,\"start\":86956},{\"end\":87304,\"start\":87303},{\"end\":87310,\"start\":87309},{\"end\":87319,\"start\":87318},{\"end\":87525,\"start\":87522},{\"end\":87535,\"start\":87532},{\"end\":87547,\"start\":87544},{\"end\":87557,\"start\":87554},{\"end\":87564,\"start\":87563},{\"end\":87566,\"start\":87565},{\"end\":87841,\"start\":87838},{\"end\":87849,\"start\":87848},{\"end\":87851,\"start\":87850},{\"end\":88016,\"start\":88015},{\"end\":88018,\"start\":88017},{\"end\":88260,\"start\":88257},{\"end\":88271,\"start\":88268},{\"end\":88280,\"start\":88277},{\"end\":88290,\"start\":88287},{\"end\":88292,\"start\":88291},{\"end\":88300,\"start\":88299},{\"end\":88667,\"start\":88666},{\"end\":88676,\"start\":88675},{\"end\":88682,\"start\":88681},{\"end\":88691,\"start\":88690},{\"end\":88700,\"start\":88699},{\"end\":88706,\"start\":88705},{\"end\":88714,\"start\":88713},{\"end\":89076,\"start\":89073},{\"end\":89084,\"start\":89083},{\"end\":89094,\"start\":89091},{\"end\":89104,\"start\":89101},{\"end\":89112,\"start\":89111},{\"end\":89114,\"start\":89113}]", "bib_author_last_name": "[{\"end\":62966,\"start\":62962},{\"end\":62976,\"start\":62970},{\"end\":62983,\"start\":62980},{\"end\":62999,\"start\":62987},{\"end\":63012,\"start\":63005},{\"end\":63025,\"start\":63018},{\"end\":63041,\"start\":63031},{\"end\":63055,\"start\":63045},{\"end\":63067,\"start\":63061},{\"end\":63084,\"start\":63077},{\"end\":63092,\"start\":63088},{\"end\":63537,\"start\":63532},{\"end\":63553,\"start\":63541},{\"end\":63916,\"start\":63911},{\"end\":63932,\"start\":63920},{\"end\":64250,\"start\":64242},{\"end\":64262,\"start\":64256},{\"end\":64520,\"start\":64516},{\"end\":64773,\"start\":64769},{\"end\":64779,\"start\":64777},{\"end\":65023,\"start\":65019},{\"end\":65031,\"start\":65027},{\"end\":65038,\"start\":65035},{\"end\":65327,\"start\":65323},{\"end\":65337,\"start\":65331},{\"end\":65345,\"start\":65341},{\"end\":65353,\"start\":65349},{\"end\":65359,\"start\":65357},{\"end\":65366,\"start\":65363},{\"end\":65372,\"start\":65370},{\"end\":65382,\"start\":65376},{\"end\":65725,\"start\":65721},{\"end\":65739,\"start\":65729},{\"end\":65748,\"start\":65743},{\"end\":66065,\"start\":66061},{\"end\":66073,\"start\":66069},{\"end\":66082,\"start\":66077},{\"end\":66090,\"start\":66086},{\"end\":66428,\"start\":66426},{\"end\":66435,\"start\":66432},{\"end\":66441,\"start\":66439},{\"end\":66449,\"start\":66445},{\"end\":66455,\"start\":66453},{\"end\":66462,\"start\":66459},{\"end\":66965,\"start\":66962},{\"end\":66974,\"start\":66971},{\"end\":67302,\"start\":67299},{\"end\":67308,\"start\":67306},{\"end\":67316,\"start\":67312},{\"end\":67651,\"start\":67648},{\"end\":67665,\"start\":67660},{\"end\":67929,\"start\":67927},{\"end\":67937,\"start\":67933},{\"end\":67945,\"start\":67941},{\"end\":67951,\"start\":67949},{\"end\":67964,\"start\":67955},{\"end\":67973,\"start\":67968},{\"end\":67980,\"start\":67977},{\"end\":67988,\"start\":67984},{\"end\":67996,\"start\":67992},{\"end\":68003,\"start\":68000},{\"end\":68011,\"start\":68007},{\"end\":68404,\"start\":68400},{\"end\":68411,\"start\":68408},{\"end\":68417,\"start\":68415},{\"end\":68425,\"start\":68421},{\"end\":68433,\"start\":68429},{\"end\":68441,\"start\":68437},{\"end\":68725,\"start\":68722},{\"end\":68736,\"start\":68731},{\"end\":68745,\"start\":68740},{\"end\":68761,\"start\":68751},{\"end\":68775,\"start\":68767},{\"end\":68785,\"start\":68779},{\"end\":68792,\"start\":68789},{\"end\":68804,\"start\":68796},{\"end\":68814,\"start\":68808},{\"end\":69160,\"start\":69157},{\"end\":69168,\"start\":69164},{\"end\":69176,\"start\":69174},{\"end\":69184,\"start\":69180},{\"end\":69193,\"start\":69190},{\"end\":69480,\"start\":69471},{\"end\":69496,\"start\":69482},{\"end\":69512,\"start\":69504},{\"end\":69812,\"start\":69807},{\"end\":69830,\"start\":69816},{\"end\":70192,\"start\":70187},{\"end\":70202,\"start\":70198},{\"end\":70208,\"start\":70206},{\"end\":70216,\"start\":70212},{\"end\":70224,\"start\":70220},{\"end\":70235,\"start\":70230},{\"end\":70633,\"start\":70628},{\"end\":70641,\"start\":70637},{\"end\":70649,\"start\":70645},{\"end\":70657,\"start\":70653},{\"end\":70665,\"start\":70661},{\"end\":70673,\"start\":70669},{\"end\":70679,\"start\":70677},{\"end\":71054,\"start\":71048},{\"end\":71061,\"start\":71058},{\"end\":71074,\"start\":71067},{\"end\":71087,\"start\":71080},{\"end\":71438,\"start\":71436},{\"end\":71447,\"start\":71442},{\"end\":71453,\"start\":71451},{\"end\":71460,\"start\":71457},{\"end\":71468,\"start\":71464},{\"end\":71785,\"start\":71783},{\"end\":71793,\"start\":71789},{\"end\":71801,\"start\":71797},{\"end\":71807,\"start\":71805},{\"end\":71815,\"start\":71811},{\"end\":71822,\"start\":71819},{\"end\":72200,\"start\":72198},{\"end\":72208,\"start\":72204},{\"end\":72220,\"start\":72216},{\"end\":72226,\"start\":72224},{\"end\":72232,\"start\":72230},{\"end\":72240,\"start\":72236},{\"end\":72246,\"start\":72244},{\"end\":72252,\"start\":72250},{\"end\":72649,\"start\":72647},{\"end\":72657,\"start\":72653},{\"end\":72663,\"start\":72661},{\"end\":72677,\"start\":72669},{\"end\":72686,\"start\":72681},{\"end\":72695,\"start\":72690},{\"end\":72708,\"start\":72699},{\"end\":73050,\"start\":73047},{\"end\":73058,\"start\":73054},{\"end\":73066,\"start\":73062},{\"end\":73074,\"start\":73070},{\"end\":73080,\"start\":73078},{\"end\":73091,\"start\":73084},{\"end\":73475,\"start\":73472},{\"end\":73484,\"start\":73481},{\"end\":73833,\"start\":73830},{\"end\":73840,\"start\":73837},{\"end\":73848,\"start\":73844},{\"end\":73856,\"start\":73852},{\"end\":73864,\"start\":73860},{\"end\":73876,\"start\":73872},{\"end\":73888,\"start\":73884},{\"end\":74271,\"start\":74269},{\"end\":74279,\"start\":74275},{\"end\":74596,\"start\":74587},{\"end\":74606,\"start\":74600},{\"end\":74617,\"start\":74610},{\"end\":74628,\"start\":74621},{\"end\":75019,\"start\":75017},{\"end\":75027,\"start\":75023},{\"end\":75035,\"start\":75031},{\"end\":75043,\"start\":75039},{\"end\":75051,\"start\":75047},{\"end\":75058,\"start\":75055},{\"end\":75066,\"start\":75062},{\"end\":75072,\"start\":75070},{\"end\":75079,\"start\":75076},{\"end\":75086,\"start\":75083},{\"end\":75561,\"start\":75559},{\"end\":75568,\"start\":75565},{\"end\":75576,\"start\":75572},{\"end\":75584,\"start\":75580},{\"end\":75593,\"start\":75588},{\"end\":76010,\"start\":76004},{\"end\":76023,\"start\":76014},{\"end\":76036,\"start\":76029},{\"end\":76049,\"start\":76040},{\"end\":76058,\"start\":76053},{\"end\":76071,\"start\":76062},{\"end\":76470,\"start\":76467},{\"end\":76480,\"start\":76476},{\"end\":76486,\"start\":76484},{\"end\":76495,\"start\":76490},{\"end\":76821,\"start\":76811},{\"end\":77142,\"start\":77139},{\"end\":77150,\"start\":77146},{\"end\":77158,\"start\":77154},{\"end\":77166,\"start\":77162},{\"end\":77520,\"start\":77518},{\"end\":77528,\"start\":77524},{\"end\":77536,\"start\":77532},{\"end\":77543,\"start\":77540},{\"end\":77551,\"start\":77547},{\"end\":77560,\"start\":77557},{\"end\":77569,\"start\":77564},{\"end\":77908,\"start\":77905},{\"end\":77915,\"start\":77912},{\"end\":77930,\"start\":77919},{\"end\":77944,\"start\":77934},{\"end\":78252,\"start\":78250},{\"end\":78260,\"start\":78256},{\"end\":78266,\"start\":78264},{\"end\":78274,\"start\":78272},{\"end\":78280,\"start\":78278},{\"end\":78289,\"start\":78284},{\"end\":78298,\"start\":78293},{\"end\":78543,\"start\":78540},{\"end\":78727,\"start\":78723},{\"end\":78736,\"start\":78731},{\"end\":78750,\"start\":78740},{\"end\":78760,\"start\":78754},{\"end\":78769,\"start\":78764},{\"end\":78780,\"start\":78775},{\"end\":78791,\"start\":78784},{\"end\":78800,\"start\":78797},{\"end\":78809,\"start\":78804},{\"end\":78817,\"start\":78813},{\"end\":78825,\"start\":78821},{\"end\":78831,\"start\":78829},{\"end\":78837,\"start\":78835},{\"end\":78845,\"start\":78841},{\"end\":79271,\"start\":79268},{\"end\":79280,\"start\":79275},{\"end\":79288,\"start\":79284},{\"end\":79630,\"start\":79627},{\"end\":79636,\"start\":79634},{\"end\":79642,\"start\":79640},{\"end\":79648,\"start\":79646},{\"end\":79656,\"start\":79652},{\"end\":79662,\"start\":79660},{\"end\":79668,\"start\":79666},{\"end\":80041,\"start\":80037},{\"end\":80047,\"start\":80045},{\"end\":80055,\"start\":80051},{\"end\":80064,\"start\":80059},{\"end\":80072,\"start\":80068},{\"end\":80457,\"start\":80453},{\"end\":80465,\"start\":80461},{\"end\":80473,\"start\":80469},{\"end\":80480,\"start\":80477},{\"end\":80487,\"start\":80484},{\"end\":80857,\"start\":80853},{\"end\":80865,\"start\":80861},{\"end\":80873,\"start\":80869},{\"end\":80881,\"start\":80879},{\"end\":81204,\"start\":81200},{\"end\":81210,\"start\":81208},{\"end\":81218,\"start\":81214},{\"end\":81225,\"start\":81222},{\"end\":81655,\"start\":81649},{\"end\":81670,\"start\":81659},{\"end\":81680,\"start\":81674},{\"end\":82101,\"start\":82092},{\"end\":82115,\"start\":82105},{\"end\":82129,\"start\":82119},{\"end\":82478,\"start\":82474},{\"end\":82486,\"start\":82482},{\"end\":82494,\"start\":82490},{\"end\":82835,\"start\":82831},{\"end\":82843,\"start\":82839},{\"end\":82851,\"start\":82849},{\"end\":82860,\"start\":82855},{\"end\":82868,\"start\":82864},{\"end\":83197,\"start\":83193},{\"end\":83204,\"start\":83201},{\"end\":83212,\"start\":83208},{\"end\":83218,\"start\":83216},{\"end\":83495,\"start\":83489},{\"end\":83506,\"start\":83499},{\"end\":83516,\"start\":83510},{\"end\":83723,\"start\":83721},{\"end\":83730,\"start\":83727},{\"end\":83736,\"start\":83734},{\"end\":83743,\"start\":83740},{\"end\":83751,\"start\":83747},{\"end\":83760,\"start\":83757},{\"end\":84061,\"start\":84059},{\"end\":84070,\"start\":84067},{\"end\":84354,\"start\":84349},{\"end\":84363,\"start\":84360},{\"end\":84654,\"start\":84649},{\"end\":84663,\"start\":84660},{\"end\":84673,\"start\":84669},{\"end\":84680,\"start\":84677},{\"end\":84686,\"start\":84684},{\"end\":84927,\"start\":84925},{\"end\":84933,\"start\":84931},{\"end\":84940,\"start\":84937},{\"end\":84947,\"start\":84944},{\"end\":85246,\"start\":85244},{\"end\":85254,\"start\":85250},{\"end\":85262,\"start\":85258},{\"end\":85268,\"start\":85266},{\"end\":85274,\"start\":85272},{\"end\":85281,\"start\":85278},{\"end\":85632,\"start\":85630},{\"end\":85639,\"start\":85636},{\"end\":85647,\"start\":85643},{\"end\":85959,\"start\":85957},{\"end\":85967,\"start\":85963},{\"end\":85973,\"start\":85971},{\"end\":85982,\"start\":85979},{\"end\":85988,\"start\":85986},{\"end\":85997,\"start\":85994},{\"end\":86379,\"start\":86376},{\"end\":86391,\"start\":86383},{\"end\":86399,\"start\":86395},{\"end\":86405,\"start\":86403},{\"end\":86412,\"start\":86409},{\"end\":86419,\"start\":86416},{\"end\":86427,\"start\":86423},{\"end\":86435,\"start\":86431},{\"end\":86443,\"start\":86439},{\"end\":86449,\"start\":86447},{\"end\":86455,\"start\":86453},{\"end\":86461,\"start\":86459},{\"end\":86470,\"start\":86465},{\"end\":86482,\"start\":86476},{\"end\":86493,\"start\":86486},{\"end\":86927,\"start\":86924},{\"end\":86936,\"start\":86931},{\"end\":86943,\"start\":86940},{\"end\":86954,\"start\":86947},{\"end\":86962,\"start\":86958},{\"end\":87307,\"start\":87305},{\"end\":87316,\"start\":87311},{\"end\":87323,\"start\":87320},{\"end\":87530,\"start\":87526},{\"end\":87542,\"start\":87536},{\"end\":87552,\"start\":87548},{\"end\":87561,\"start\":87558},{\"end\":87572,\"start\":87567},{\"end\":87846,\"start\":87842},{\"end\":87856,\"start\":87852},{\"end\":88023,\"start\":88019},{\"end\":88266,\"start\":88261},{\"end\":88275,\"start\":88272},{\"end\":88285,\"start\":88281},{\"end\":88297,\"start\":88293},{\"end\":88673,\"start\":88668},{\"end\":88679,\"start\":88677},{\"end\":88688,\"start\":88683},{\"end\":88697,\"start\":88692},{\"end\":88703,\"start\":88701},{\"end\":88711,\"start\":88707},{\"end\":88717,\"start\":88715},{\"end\":89081,\"start\":89077},{\"end\":89089,\"start\":89085},{\"end\":89099,\"start\":89095},{\"end\":89109,\"start\":89105},{\"end\":89117,\"start\":89115}]", "bib_entry": "[{\"attributes\":{\"doi\":\"10.1038/s41597-020-00631-x\",\"id\":\"b0\"},\"end\":63409,\"start\":62857},{\"attributes\":{\"doi\":\"10.5194/hess-15-1147-2011\",\"id\":\"b1\",\"matched_paper_id\":55268183},\"end\":63792,\"start\":63411},{\"attributes\":{\"doi\":\"10.1029/2010WR009917\",\"id\":\"b2\",\"matched_paper_id\":128766927},\"end\":64155,\"start\":63794},{\"attributes\":{\"doi\":\"10.1175/JHM595.1\",\"id\":\"b3\",\"matched_paper_id\":55428505},\"end\":64438,\"start\":64157},{\"attributes\":{\"id\":\"b4\",\"matched_paper_id\":184054690},\"end\":64679,\"start\":64440},{\"attributes\":{\"doi\":\"10.3390/rs8060472\",\"id\":\"b5\",\"matched_paper_id\":16604161},\"end\":64940,\"start\":64681},{\"attributes\":{\"doi\":\"10.1007/s00382-017-3731-9\",\"id\":\"b6\",\"matched_paper_id\":134009184},\"end\":65204,\"start\":64942},{\"attributes\":{\"doi\":\"10.1016/j.atmosres.2020.105365\",\"id\":\"b7\",\"matched_paper_id\":228863995},\"end\":65634,\"start\":65206},{\"attributes\":{\"doi\":\"10.1029/91WR02985\",\"id\":\"b8\",\"matched_paper_id\":35006717},\"end\":65940,\"start\":65636},{\"attributes\":{\"doi\":\"10.1002/2017GL075619\",\"id\":\"b9\",\"matched_paper_id\":88523256},\"end\":66329,\"start\":65942},{\"attributes\":{\"id\":\"b10\"},\"end\":66601,\"start\":66331},{\"attributes\":{\"id\":\"b11\"},\"end\":66837,\"start\":66603},{\"attributes\":{\"doi\":\"10.5194/hess-17-837-2013\",\"id\":\"b12\",\"matched_paper_id\":73523772},\"end\":67204,\"start\":66839},{\"attributes\":{\"doi\":\"10.1175/JCLI-D-14-00300.1\",\"id\":\"b13\",\"matched_paper_id\":59491773},\"end\":67494,\"start\":67206},{\"attributes\":{\"doi\":\"10.1175/JHM-D-19-0277.1\",\"id\":\"b14\",\"matched_paper_id\":219742091},\"end\":67923,\"start\":67496},{\"attributes\":{\"doi\":\"10.1016/j.patcog.2017.10.013\",\"id\":\"b15\"},\"end\":68292,\"start\":67925},{\"attributes\":{\"doi\":\"10.1175/JHM-D-20-0252.1\",\"id\":\"b16\",\"matched_paper_id\":226784533},\"end\":68670,\"start\":68294},{\"attributes\":{\"doi\":\"10.1175/BAMS-D-13-00164.1\",\"id\":\"b17\",\"matched_paper_id\":122267501},\"end\":69052,\"start\":68672},{\"attributes\":{\"doi\":\"10.1175/JHM-D-16-0130.1\",\"id\":\"b18\",\"matched_paper_id\":55223521},\"end\":69414,\"start\":69054},{\"attributes\":{\"doi\":\"10.1126/science.1183188\",\"id\":\"b19\",\"matched_paper_id\":128597220},\"end\":69676,\"start\":69416},{\"attributes\":{\"doi\":\"10.1016/j.jhydrol.2019.03.042\",\"id\":\"b20\",\"matched_paper_id\":134305398},\"end\":70069,\"start\":69678},{\"attributes\":{\"doi\":\"10.1016/j.jhydrol.2007.01.010\",\"id\":\"b21\",\"matched_paper_id\":54089260},\"end\":70499,\"start\":70071},{\"attributes\":{\"doi\":\"10.1016/j.atmosres.2021.105574\",\"id\":\"b22\",\"matched_paper_id\":233567798},\"end\":70939,\"start\":70501},{\"attributes\":{\"doi\":\"10.1029/2021WR030330\",\"id\":\"b23\",\"matched_paper_id\":243872083},\"end\":71323,\"start\":70941},{\"attributes\":{\"id\":\"b24\"},\"end\":71664,\"start\":71325},{\"attributes\":{\"doi\":\"10.1002/joc.6509\",\"id\":\"b25\",\"matched_paper_id\":214078493},\"end\":72051,\"start\":71666},{\"attributes\":{\"doi\":\"10.5194/essd-13-5455-2021\",\"id\":\"b26\",\"matched_paper_id\":244704905},\"end\":72543,\"start\":72053},{\"attributes\":{\"id\":\"b27\",\"matched_paper_id\":249089338},\"end\":72933,\"start\":72545},{\"attributes\":{\"doi\":\"10.1029/2021JD035625\",\"id\":\"b28\",\"matched_paper_id\":244413091},\"end\":73344,\"start\":72935},{\"attributes\":{\"doi\":\"10.1175/1520-0442(2001)014&lt;2896:SATVOS&gt;2.0.CO;2\",\"id\":\"b29\",\"matched_paper_id\":53478284},\"end\":73720,\"start\":73346},{\"attributes\":{\"doi\":\"10.1175/JCLI-D-17-0212.1\",\"id\":\"b30\",\"matched_paper_id\":133917080},\"end\":74140,\"start\":73722},{\"attributes\":{\"doi\":\"10.3390/rs10122022\",\"id\":\"b31\",\"matched_paper_id\":58013827},\"end\":74484,\"start\":74142},{\"attributes\":{\"doi\":\"10.1175/BAMS-D-19-0001.1\",\"id\":\"b32\",\"matched_paper_id\":201252249},\"end\":74867,\"start\":74486},{\"attributes\":{\"doi\":\"10.1002/2017JD026648\",\"id\":\"b33\",\"matched_paper_id\":134509338},\"end\":75390,\"start\":74869},{\"attributes\":{\"doi\":\"10.5194/hess-25-359-2021\",\"id\":\"b34\",\"matched_paper_id\":234125508},\"end\":75887,\"start\":75392},{\"attributes\":{\"doi\":\"10.1002/2014GL061322\",\"id\":\"b35\",\"matched_paper_id\":9200198},\"end\":76334,\"start\":75889},{\"attributes\":{\"id\":\"b36\"},\"end\":76713,\"start\":76336},{\"attributes\":{\"doi\":\"10.1016/j.atmosres.2005.11.005\",\"id\":\"b37\",\"matched_paper_id\":121989738},\"end\":77030,\"start\":76715},{\"attributes\":{\"doi\":\"10.1029/2008JD011559\",\"id\":\"b38\",\"matched_paper_id\":129733743},\"end\":77379,\"start\":77032},{\"attributes\":{\"doi\":\"10.1007/s00382-020-05181-x\",\"id\":\"b39\",\"matched_paper_id\":211539333},\"end\":77830,\"start\":77381},{\"attributes\":{\"doi\":\"10.1029/2018WR024090\",\"id\":\"b40\",\"matched_paper_id\":134595205},\"end\":78147,\"start\":77832},{\"attributes\":{\"doi\":\"10.2166/nh.2022.118\",\"id\":\"b41\",\"matched_paper_id\":246991118},\"end\":78513,\"start\":78149},{\"attributes\":{\"doi\":\"10.1038/454393a\",\"id\":\"b42\",\"matched_paper_id\":205039810},\"end\":78627,\"start\":78515},{\"attributes\":{\"doi\":\"10.5194/hess-22-5639-2018\",\"id\":\"b43\",\"matched_paper_id\":54205871},\"end\":79161,\"start\":78629},{\"attributes\":{\"doi\":\"10.1007/s00704-012-0810-z\",\"id\":\"b44\",\"matched_paper_id\":120451282},\"end\":79505,\"start\":79163},{\"attributes\":{\"doi\":\"10.1175/JHM-D-20-0272.1\",\"id\":\"b45\",\"matched_paper_id\":236252409},\"end\":79913,\"start\":79507},{\"attributes\":{\"doi\":\"10.1016/j.jhydrol.2015.12.008\",\"id\":\"b46\",\"matched_paper_id\":131442357},\"end\":80304,\"start\":79915},{\"attributes\":{\"doi\":\"10.1016/j.rse.2018.02.007\",\"id\":\"b47\",\"matched_paper_id\":134904167},\"end\":80760,\"start\":80306},{\"attributes\":{\"doi\":\"10.2166/nh.2021.188\",\"id\":\"b48\",\"matched_paper_id\":240517580},\"end\":81068,\"start\":80762},{\"attributes\":{\"doi\":\"10.1016/j.jhydrol.2014.07.044\",\"id\":\"b49\",\"matched_paper_id\":140667855},\"end\":81454,\"start\":81070},{\"attributes\":{\"doi\":\"10.1016/j.jhydrol.2014.04.058\",\"id\":\"b50\",\"matched_paper_id\":129309642},\"end\":81983,\"start\":81456},{\"attributes\":{\"doi\":\"10.1007/s12145-021-00708-0\",\"id\":\"b51\",\"matched_paper_id\":238244287},\"end\":82360,\"start\":81985},{\"attributes\":{\"doi\":\"10.1002/joc.5246\",\"id\":\"b52\",\"matched_paper_id\":133906023},\"end\":82699,\"start\":82362},{\"attributes\":{\"doi\":\"10.1029/2020EF001602\",\"id\":\"b53\",\"matched_paper_id\":220933221},\"end\":83112,\"start\":82701},{\"attributes\":{\"doi\":\"10.1007/s11430-021-9870-8\",\"id\":\"b54\",\"matched_paper_id\":245813535},\"end\":83414,\"start\":83114},{\"attributes\":{\"doi\":\"10.1175/JAMC-D-17-0354.1\",\"id\":\"b55\",\"matched_paper_id\":52953302},\"end\":83715,\"start\":83416},{\"attributes\":{\"doi\":\"10.1038/srep00404\",\"id\":\"b56\"},\"end\":83948,\"start\":83717},{\"attributes\":{\"id\":\"b57\",\"matched_paper_id\":130585954},\"end\":84247,\"start\":83950},{\"attributes\":{\"id\":\"b58\"},\"end\":84553,\"start\":84249},{\"attributes\":{\"id\":\"b59\"},\"end\":84874,\"start\":84555},{\"attributes\":{\"doi\":\"10.1029/2008GL035867\",\"id\":\"b60\",\"matched_paper_id\":128757790},\"end\":85101,\"start\":84876},{\"attributes\":{\"doi\":\"10.1002/2016JD025418\",\"id\":\"b61\",\"matched_paper_id\":132515843},\"end\":85546,\"start\":85103},{\"attributes\":{\"doi\":\"10.1007/s11430-018-9261-5\",\"id\":\"b62\",\"matched_paper_id\":134549885},\"end\":85836,\"start\":85548},{\"attributes\":{\"doi\":\"10.1061/(ASCE)WR.1943-5452.0001501\",\"id\":\"b63\",\"matched_paper_id\":245009221},\"end\":86280,\"start\":85838},{\"attributes\":{\"doi\":\"10.1038/nclimate1580\",\"id\":\"b64\",\"matched_paper_id\":39308774},\"end\":86779,\"start\":86282},{\"attributes\":{\"doi\":\"10.1175/2007JHM903.1\",\"id\":\"b65\",\"matched_paper_id\":140536577},\"end\":87220,\"start\":86781},{\"attributes\":{\"id\":\"b66\"},\"end\":87498,\"start\":87222},{\"attributes\":{\"id\":\"b67\",\"matched_paper_id\":127057255},\"end\":87789,\"start\":87500},{\"attributes\":{\"id\":\"b68\"},\"end\":87974,\"start\":87791},{\"attributes\":{\"doi\":\"10.1016/0022-1694(92)90096-E\",\"id\":\"b69\",\"matched_paper_id\":128397841},\"end\":88143,\"start\":87976},{\"attributes\":{\"id\":\"b70\"},\"end\":88537,\"start\":88145},{\"attributes\":{\"doi\":\"10.1016/j.jhydrol.2021.125969\",\"id\":\"b71\",\"matched_paper_id\":233778246},\"end\":88974,\"start\":88539},{\"attributes\":{\"doi\":\"10.1007/s11430-009-0194-9\",\"id\":\"b72\",\"matched_paper_id\":128661295},\"end\":89417,\"start\":88976}]", "bib_title": "[{\"end\":63526,\"start\":63411},{\"end\":63905,\"start\":63794},{\"end\":64236,\"start\":64157},{\"end\":64512,\"start\":64440},{\"end\":64765,\"start\":64681},{\"end\":65015,\"start\":64942},{\"end\":65319,\"start\":65206},{\"end\":65717,\"start\":65636},{\"end\":66057,\"start\":65942},{\"end\":66665,\"start\":66603},{\"end\":66956,\"start\":66839},{\"end\":67295,\"start\":67206},{\"end\":67644,\"start\":67496},{\"end\":68396,\"start\":68294},{\"end\":68716,\"start\":68672},{\"end\":69151,\"start\":69054},{\"end\":69465,\"start\":69416},{\"end\":69803,\"start\":69678},{\"end\":70183,\"start\":70071},{\"end\":70624,\"start\":70501},{\"end\":71042,\"start\":70941},{\"end\":71432,\"start\":71325},{\"end\":71779,\"start\":71666},{\"end\":72194,\"start\":72053},{\"end\":72643,\"start\":72545},{\"end\":73043,\"start\":72935},{\"end\":73468,\"start\":73346},{\"end\":73826,\"start\":73722},{\"end\":74265,\"start\":74142},{\"end\":74583,\"start\":74486},{\"end\":75013,\"start\":74869},{\"end\":75555,\"start\":75392},{\"end\":75998,\"start\":75889},{\"end\":76461,\"start\":76336},{\"end\":76807,\"start\":76715},{\"end\":77135,\"start\":77032},{\"end\":77514,\"start\":77381},{\"end\":77901,\"start\":77832},{\"end\":78246,\"start\":78149},{\"end\":78536,\"start\":78515},{\"end\":78719,\"start\":78629},{\"end\":79264,\"start\":79163},{\"end\":79623,\"start\":79507},{\"end\":80033,\"start\":79915},{\"end\":80449,\"start\":80306},{\"end\":80849,\"start\":80762},{\"end\":81196,\"start\":81070},{\"end\":81645,\"start\":81456},{\"end\":82088,\"start\":81985},{\"end\":82470,\"start\":82362},{\"end\":82825,\"start\":82701},{\"end\":83189,\"start\":83114},{\"end\":83485,\"start\":83416},{\"end\":84055,\"start\":83950},{\"end\":84343,\"start\":84249},{\"end\":84643,\"start\":84555},{\"end\":84921,\"start\":84876},{\"end\":85240,\"start\":85103},{\"end\":85626,\"start\":85548},{\"end\":85953,\"start\":85838},{\"end\":86372,\"start\":86282},{\"end\":86918,\"start\":86781},{\"end\":87301,\"start\":87222},{\"end\":87520,\"start\":87500},{\"end\":87836,\"start\":87791},{\"end\":88013,\"start\":87976},{\"end\":88255,\"start\":88145},{\"end\":88664,\"start\":88539},{\"end\":89071,\"start\":88976}]", "bib_author": "[{\"end\":62968,\"start\":62958},{\"end\":62978,\"start\":62968},{\"end\":62985,\"start\":62978},{\"end\":63001,\"start\":62985},{\"end\":63014,\"start\":63001},{\"end\":63027,\"start\":63014},{\"end\":63043,\"start\":63027},{\"end\":63057,\"start\":63043},{\"end\":63069,\"start\":63057},{\"end\":63086,\"start\":63069},{\"end\":63094,\"start\":63086},{\"end\":63100,\"start\":63094},{\"end\":63539,\"start\":63528},{\"end\":63555,\"start\":63539},{\"end\":63918,\"start\":63907},{\"end\":63934,\"start\":63918},{\"end\":64252,\"start\":64238},{\"end\":64264,\"start\":64252},{\"end\":64522,\"start\":64514},{\"end\":64775,\"start\":64767},{\"end\":64781,\"start\":64775},{\"end\":65025,\"start\":65017},{\"end\":65033,\"start\":65025},{\"end\":65040,\"start\":65033},{\"end\":65329,\"start\":65321},{\"end\":65339,\"start\":65329},{\"end\":65347,\"start\":65339},{\"end\":65355,\"start\":65347},{\"end\":65361,\"start\":65355},{\"end\":65368,\"start\":65361},{\"end\":65374,\"start\":65368},{\"end\":65384,\"start\":65374},{\"end\":65727,\"start\":65719},{\"end\":65741,\"start\":65727},{\"end\":65750,\"start\":65741},{\"end\":66067,\"start\":66059},{\"end\":66075,\"start\":66067},{\"end\":66084,\"start\":66075},{\"end\":66092,\"start\":66084},{\"end\":66430,\"start\":66424},{\"end\":66437,\"start\":66430},{\"end\":66443,\"start\":66437},{\"end\":66451,\"start\":66443},{\"end\":66457,\"start\":66451},{\"end\":66464,\"start\":66457},{\"end\":66967,\"start\":66958},{\"end\":66976,\"start\":66967},{\"end\":67304,\"start\":67297},{\"end\":67310,\"start\":67304},{\"end\":67318,\"start\":67310},{\"end\":67653,\"start\":67646},{\"end\":67667,\"start\":67653},{\"end\":67671,\"start\":67667},{\"end\":67931,\"start\":67925},{\"end\":67939,\"start\":67931},{\"end\":67947,\"start\":67939},{\"end\":67953,\"start\":67947},{\"end\":67966,\"start\":67953},{\"end\":67975,\"start\":67966},{\"end\":67982,\"start\":67975},{\"end\":67990,\"start\":67982},{\"end\":67998,\"start\":67990},{\"end\":68005,\"start\":67998},{\"end\":68013,\"start\":68005},{\"end\":68406,\"start\":68398},{\"end\":68413,\"start\":68406},{\"end\":68419,\"start\":68413},{\"end\":68427,\"start\":68419},{\"end\":68435,\"start\":68427},{\"end\":68443,\"start\":68435},{\"end\":68727,\"start\":68718},{\"end\":68738,\"start\":68727},{\"end\":68747,\"start\":68738},{\"end\":68763,\"start\":68747},{\"end\":68777,\"start\":68763},{\"end\":68787,\"start\":68777},{\"end\":68794,\"start\":68787},{\"end\":68806,\"start\":68794},{\"end\":68816,\"start\":68806},{\"end\":69162,\"start\":69153},{\"end\":69170,\"start\":69162},{\"end\":69178,\"start\":69170},{\"end\":69186,\"start\":69178},{\"end\":69195,\"start\":69186},{\"end\":69482,\"start\":69467},{\"end\":69498,\"start\":69482},{\"end\":69514,\"start\":69498},{\"end\":69814,\"start\":69805},{\"end\":69832,\"start\":69814},{\"end\":70194,\"start\":70185},{\"end\":70204,\"start\":70194},{\"end\":70210,\"start\":70204},{\"end\":70218,\"start\":70210},{\"end\":70226,\"start\":70218},{\"end\":70237,\"start\":70226},{\"end\":70635,\"start\":70626},{\"end\":70643,\"start\":70635},{\"end\":70651,\"start\":70643},{\"end\":70659,\"start\":70651},{\"end\":70667,\"start\":70659},{\"end\":70675,\"start\":70667},{\"end\":70681,\"start\":70675},{\"end\":71056,\"start\":71044},{\"end\":71063,\"start\":71056},{\"end\":71076,\"start\":71063},{\"end\":71089,\"start\":71076},{\"end\":71440,\"start\":71434},{\"end\":71449,\"start\":71440},{\"end\":71455,\"start\":71449},{\"end\":71462,\"start\":71455},{\"end\":71470,\"start\":71462},{\"end\":71787,\"start\":71781},{\"end\":71795,\"start\":71787},{\"end\":71803,\"start\":71795},{\"end\":71809,\"start\":71803},{\"end\":71817,\"start\":71809},{\"end\":71824,\"start\":71817},{\"end\":72202,\"start\":72196},{\"end\":72210,\"start\":72202},{\"end\":72222,\"start\":72210},{\"end\":72228,\"start\":72222},{\"end\":72234,\"start\":72228},{\"end\":72242,\"start\":72234},{\"end\":72248,\"start\":72242},{\"end\":72254,\"start\":72248},{\"end\":72651,\"start\":72645},{\"end\":72659,\"start\":72651},{\"end\":72665,\"start\":72659},{\"end\":72679,\"start\":72665},{\"end\":72688,\"start\":72679},{\"end\":72697,\"start\":72688},{\"end\":72710,\"start\":72697},{\"end\":73052,\"start\":73045},{\"end\":73060,\"start\":73052},{\"end\":73068,\"start\":73060},{\"end\":73076,\"start\":73068},{\"end\":73082,\"start\":73076},{\"end\":73093,\"start\":73082},{\"end\":73477,\"start\":73470},{\"end\":73486,\"start\":73477},{\"end\":73835,\"start\":73828},{\"end\":73842,\"start\":73835},{\"end\":73850,\"start\":73842},{\"end\":73858,\"start\":73850},{\"end\":73866,\"start\":73858},{\"end\":73878,\"start\":73866},{\"end\":73890,\"start\":73878},{\"end\":73894,\"start\":73890},{\"end\":74273,\"start\":74267},{\"end\":74281,\"start\":74273},{\"end\":74598,\"start\":74585},{\"end\":74608,\"start\":74598},{\"end\":74619,\"start\":74608},{\"end\":74630,\"start\":74619},{\"end\":75021,\"start\":75015},{\"end\":75029,\"start\":75021},{\"end\":75037,\"start\":75029},{\"end\":75045,\"start\":75037},{\"end\":75053,\"start\":75045},{\"end\":75060,\"start\":75053},{\"end\":75068,\"start\":75060},{\"end\":75074,\"start\":75068},{\"end\":75081,\"start\":75074},{\"end\":75088,\"start\":75081},{\"end\":75563,\"start\":75557},{\"end\":75570,\"start\":75563},{\"end\":75578,\"start\":75570},{\"end\":75586,\"start\":75578},{\"end\":75595,\"start\":75586},{\"end\":76012,\"start\":76000},{\"end\":76025,\"start\":76012},{\"end\":76038,\"start\":76025},{\"end\":76051,\"start\":76038},{\"end\":76060,\"start\":76051},{\"end\":76073,\"start\":76060},{\"end\":76472,\"start\":76463},{\"end\":76482,\"start\":76472},{\"end\":76488,\"start\":76482},{\"end\":76497,\"start\":76488},{\"end\":76823,\"start\":76809},{\"end\":76833,\"start\":76823},{\"end\":76839,\"start\":76833},{\"end\":77144,\"start\":77137},{\"end\":77152,\"start\":77144},{\"end\":77160,\"start\":77152},{\"end\":77168,\"start\":77160},{\"end\":77522,\"start\":77516},{\"end\":77530,\"start\":77522},{\"end\":77538,\"start\":77530},{\"end\":77545,\"start\":77538},{\"end\":77553,\"start\":77545},{\"end\":77562,\"start\":77553},{\"end\":77571,\"start\":77562},{\"end\":77910,\"start\":77903},{\"end\":77917,\"start\":77910},{\"end\":77932,\"start\":77917},{\"end\":77946,\"start\":77932},{\"end\":78254,\"start\":78248},{\"end\":78262,\"start\":78254},{\"end\":78268,\"start\":78262},{\"end\":78276,\"start\":78268},{\"end\":78282,\"start\":78276},{\"end\":78291,\"start\":78282},{\"end\":78300,\"start\":78291},{\"end\":78545,\"start\":78538},{\"end\":78729,\"start\":78721},{\"end\":78738,\"start\":78729},{\"end\":78752,\"start\":78738},{\"end\":78762,\"start\":78752},{\"end\":78771,\"start\":78762},{\"end\":78782,\"start\":78771},{\"end\":78793,\"start\":78782},{\"end\":78802,\"start\":78793},{\"end\":78811,\"start\":78802},{\"end\":78819,\"start\":78811},{\"end\":78827,\"start\":78819},{\"end\":78833,\"start\":78827},{\"end\":78839,\"start\":78833},{\"end\":78847,\"start\":78839},{\"end\":79273,\"start\":79266},{\"end\":79282,\"start\":79273},{\"end\":79290,\"start\":79282},{\"end\":79632,\"start\":79625},{\"end\":79638,\"start\":79632},{\"end\":79644,\"start\":79638},{\"end\":79650,\"start\":79644},{\"end\":79658,\"start\":79650},{\"end\":79664,\"start\":79658},{\"end\":79670,\"start\":79664},{\"end\":80043,\"start\":80035},{\"end\":80049,\"start\":80043},{\"end\":80057,\"start\":80049},{\"end\":80066,\"start\":80057},{\"end\":80074,\"start\":80066},{\"end\":80459,\"start\":80451},{\"end\":80467,\"start\":80459},{\"end\":80475,\"start\":80467},{\"end\":80482,\"start\":80475},{\"end\":80489,\"start\":80482},{\"end\":80859,\"start\":80851},{\"end\":80867,\"start\":80859},{\"end\":80875,\"start\":80867},{\"end\":80883,\"start\":80875},{\"end\":81206,\"start\":81198},{\"end\":81212,\"start\":81206},{\"end\":81220,\"start\":81212},{\"end\":81227,\"start\":81220},{\"end\":81657,\"start\":81647},{\"end\":81672,\"start\":81657},{\"end\":81682,\"start\":81672},{\"end\":82103,\"start\":82090},{\"end\":82117,\"start\":82103},{\"end\":82131,\"start\":82117},{\"end\":82480,\"start\":82472},{\"end\":82488,\"start\":82480},{\"end\":82496,\"start\":82488},{\"end\":82837,\"start\":82827},{\"end\":82845,\"start\":82837},{\"end\":82853,\"start\":82845},{\"end\":82862,\"start\":82853},{\"end\":82870,\"start\":82862},{\"end\":83199,\"start\":83191},{\"end\":83206,\"start\":83199},{\"end\":83214,\"start\":83206},{\"end\":83220,\"start\":83214},{\"end\":83497,\"start\":83487},{\"end\":83508,\"start\":83497},{\"end\":83518,\"start\":83508},{\"end\":83725,\"start\":83719},{\"end\":83732,\"start\":83725},{\"end\":83738,\"start\":83732},{\"end\":83745,\"start\":83738},{\"end\":83753,\"start\":83745},{\"end\":83762,\"start\":83753},{\"end\":84063,\"start\":84057},{\"end\":84072,\"start\":84063},{\"end\":84356,\"start\":84345},{\"end\":84365,\"start\":84356},{\"end\":84656,\"start\":84645},{\"end\":84665,\"start\":84656},{\"end\":84675,\"start\":84665},{\"end\":84682,\"start\":84675},{\"end\":84688,\"start\":84682},{\"end\":84929,\"start\":84923},{\"end\":84935,\"start\":84929},{\"end\":84942,\"start\":84935},{\"end\":84949,\"start\":84942},{\"end\":85248,\"start\":85242},{\"end\":85256,\"start\":85248},{\"end\":85264,\"start\":85256},{\"end\":85270,\"start\":85264},{\"end\":85276,\"start\":85270},{\"end\":85283,\"start\":85276},{\"end\":85634,\"start\":85628},{\"end\":85641,\"start\":85634},{\"end\":85649,\"start\":85641},{\"end\":85961,\"start\":85955},{\"end\":85969,\"start\":85961},{\"end\":85975,\"start\":85969},{\"end\":85984,\"start\":85975},{\"end\":85990,\"start\":85984},{\"end\":85999,\"start\":85990},{\"end\":86381,\"start\":86374},{\"end\":86393,\"start\":86381},{\"end\":86401,\"start\":86393},{\"end\":86407,\"start\":86401},{\"end\":86414,\"start\":86407},{\"end\":86421,\"start\":86414},{\"end\":86429,\"start\":86421},{\"end\":86437,\"start\":86429},{\"end\":86445,\"start\":86437},{\"end\":86451,\"start\":86445},{\"end\":86457,\"start\":86451},{\"end\":86463,\"start\":86457},{\"end\":86472,\"start\":86463},{\"end\":86484,\"start\":86472},{\"end\":86495,\"start\":86484},{\"end\":86929,\"start\":86920},{\"end\":86938,\"start\":86929},{\"end\":86945,\"start\":86938},{\"end\":86956,\"start\":86945},{\"end\":86964,\"start\":86956},{\"end\":87309,\"start\":87303},{\"end\":87318,\"start\":87309},{\"end\":87325,\"start\":87318},{\"end\":87532,\"start\":87522},{\"end\":87544,\"start\":87532},{\"end\":87554,\"start\":87544},{\"end\":87563,\"start\":87554},{\"end\":87574,\"start\":87563},{\"end\":87848,\"start\":87838},{\"end\":87858,\"start\":87848},{\"end\":88025,\"start\":88015},{\"end\":88268,\"start\":88257},{\"end\":88277,\"start\":88268},{\"end\":88287,\"start\":88277},{\"end\":88299,\"start\":88287},{\"end\":88303,\"start\":88299},{\"end\":88675,\"start\":88666},{\"end\":88681,\"start\":88675},{\"end\":88690,\"start\":88681},{\"end\":88699,\"start\":88690},{\"end\":88705,\"start\":88699},{\"end\":88713,\"start\":88705},{\"end\":88719,\"start\":88713},{\"end\":89083,\"start\":89073},{\"end\":89091,\"start\":89083},{\"end\":89101,\"start\":89091},{\"end\":89111,\"start\":89101},{\"end\":89119,\"start\":89111}]", "bib_venue": "[{\"end\":62956,\"start\":62857},{\"end\":63601,\"start\":63580},{\"end\":63970,\"start\":63954},{\"end\":64295,\"start\":64280},{\"end\":64550,\"start\":64522},{\"end\":64809,\"start\":64798},{\"end\":65073,\"start\":65065},{\"end\":65423,\"start\":65414},{\"end\":65783,\"start\":65767},{\"end\":66128,\"start\":66112},{\"end\":66422,\"start\":66331},{\"end\":66696,\"start\":66667},{\"end\":67021,\"start\":67000},{\"end\":67349,\"start\":67343},{\"end\":67709,\"start\":67694},{\"end\":68110,\"start\":68041},{\"end\":68481,\"start\":68466},{\"end\":68863,\"start\":68841},{\"end\":69233,\"start\":69218},{\"end\":69544,\"start\":69537},{\"end\":69876,\"start\":69861},{\"end\":70287,\"start\":70266},{\"end\":70720,\"start\":70711},{\"end\":71128,\"start\":71109},{\"end\":71483,\"start\":71470},{\"end\":71854,\"start\":71840},{\"end\":72298,\"start\":72279},{\"end\":72732,\"start\":72710},{\"end\":73132,\"start\":73113},{\"end\":73545,\"start\":73539},{\"end\":73931,\"start\":73918},{\"end\":74310,\"start\":74299},{\"end\":74674,\"start\":74654},{\"end\":75127,\"start\":75108},{\"end\":75640,\"start\":75619},{\"end\":76109,\"start\":76093},{\"end\":76515,\"start\":76497},{\"end\":76878,\"start\":76869},{\"end\":77201,\"start\":77188},{\"end\":77605,\"start\":77597},{\"end\":77985,\"start\":77966},{\"end\":78329,\"start\":78319},{\"end\":78566,\"start\":78560},{\"end\":78893,\"start\":78872},{\"end\":79334,\"start\":79315},{\"end\":79708,\"start\":79693},{\"end\":80111,\"start\":80103},{\"end\":80533,\"start\":80514},{\"end\":80912,\"start\":80902},{\"end\":81264,\"start\":81256},{\"end\":81719,\"start\":81711},{\"end\":82173,\"start\":82157},{\"end\":82526,\"start\":82512},{\"end\":82903,\"start\":82890},{\"end\":83264,\"start\":83245},{\"end\":83564,\"start\":83542},{\"end\":83832,\"start\":83779},{\"end\":84086,\"start\":84072},{\"end\":84372,\"start\":84365},{\"end\":84701,\"start\":84688},{\"end\":84985,\"start\":84969},{\"end\":85322,\"start\":85303},{\"end\":85693,\"start\":85674},{\"end\":86060,\"start\":86033},{\"end\":86530,\"start\":86515},{\"end\":86999,\"start\":86984},{\"end\":87348,\"start\":87325},{\"end\":87598,\"start\":87574},{\"end\":87872,\"start\":87858},{\"end\":88061,\"start\":88053},{\"end\":88331,\"start\":88303},{\"end\":88756,\"start\":88748},{\"end\":89169,\"start\":89144},{\"end\":87611,\"start\":87600}]"}}}, "year": 2023, "month": 12, "day": 17}