{"id": 27300853, "updated": "2023-09-28 18:55:59.027", "metadata": {"title": "The Kinetics Human Action Video Dataset", "authors": "[{\"first\":\"Will\",\"last\":\"Kay\",\"middle\":[]},{\"first\":\"Joao\",\"last\":\"Carreira\",\"middle\":[]},{\"first\":\"Karen\",\"last\":\"Simonyan\",\"middle\":[]},{\"first\":\"Brian\",\"last\":\"Zhang\",\"middle\":[]},{\"first\":\"Chloe\",\"last\":\"Hillier\",\"middle\":[]},{\"first\":\"Sudheendra\",\"last\":\"Vijayanarasimhan\",\"middle\":[]},{\"first\":\"Fabio\",\"last\":\"Viola\",\"middle\":[]},{\"first\":\"Tim\",\"last\":\"Green\",\"middle\":[]},{\"first\":\"Trevor\",\"last\":\"Back\",\"middle\":[]},{\"first\":\"Paul\",\"last\":\"Natsev\",\"middle\":[]},{\"first\":\"Mustafa\",\"last\":\"Suleyman\",\"middle\":[]},{\"first\":\"Andrew\",\"last\":\"Zisserman\",\"middle\":[]}]", "venue": "ArXiv", "journal": "ArXiv", "publication_date": {"year": 2017, "month": 5, "day": 19}, "abstract": "We describe the DeepMind Kinetics human action video dataset. The dataset contains 400 human action classes, with at least 400 video clips for each action. Each clip lasts around 10s and is taken from a different YouTube video. The actions are human focussed and cover a broad range of classes including human-object interactions such as playing instruments, as well as human-human interactions such as shaking hands. We describe the statistics of the dataset, how it was collected, and give some baseline performance figures for neural network architectures trained and tested for human action classification on this dataset. We also carry out a preliminary analysis of whether imbalance in the dataset leads to bias in the classifiers.", "fields_of_study": "[\"Computer Science\"]", "external_ids": {"arxiv": "1705.06950", "mag": "2619947201", "acl": null, "pubmed": null, "pubmedcentral": null, "dblp": "journals/corr/KayCSZHVVGBNSZ17", "doi": null}}, "content": {"source": {"pdf_hash": "86e1bdbfd13b9ed137e4c4b8b459a3980eb257f6", "pdf_src": "Arxiv", "pdf_uri": "[\"https://arxiv.org/pdf/1705.06950v1.pdf\"]", "oa_url_match": false, "oa_info": null}, "grobid": {"id": "f0837341a4a07cb1576d4db71c0b54ed626d5f49", "type": "plain-text", "url": "s3://ai2-s2-pdf-extraction-prod/parse-results/s2orc_worker/86e1bdbfd13b9ed137e4c4b8b459a3980eb257f6.txt", "contents": "\nThe Kinetics Human Action Video Dataset\n\n\nWill Kay wkay@google.com \nJoão Carreira \nKaren Simonyan simonyan@google.com \nBrian Zhang brianzhang@google.com \nChloe Hillier chillier@google.com \nSudheendra Vijayanarasimhan \nFabio Viola fviola@google.com \nTim Green \nTrevor Back back@google.com \nPaul Natsev natsev@google.com \nMustafa Suleyman mustafasul@google.com \nAndrew Zisserman zisserman@google.com \nThe Kinetics Human Action Video Dataset\n\nWe describe the DeepMind Kinetics human action video dataset. The dataset contains 400 human action classes, with at least 400 video clips for each action. Each clip lasts around 10s and is taken from a different YouTube video. The actions are human focussed and cover a broad range of classes including human-object interactions such as playing instruments, as well as human-human interactions such as shaking hands. We describe the statistics of the dataset, how it was collected, and give some baseline performance figures for neural network architectures trained and tested for human action classification on this dataset. We also carry out a preliminary analysis of whether imbalance in the dataset leads to bias in the classifiers.\n\nIntroduction\n\nIn this paper we introduce a new, large, video dataset for human action classification. We developed this dataset principally because there is a lack of such datasets for human action classification, and we believe that having one will facilitate research in this area -both because the dataset is large enough to train deep networks from scratch, and also because the dataset is challenging enough to act as a performance benchmark where the advantages of different architectures can be teased apart.\n\nOur aim is to provide a large scale high quality dataset, covering a diverse range of human actions, that can be used for human action classification, rather than temporal localization. Since the use case is classification, only short clips of around 10s containing the action are included, and there are no untrimmed videos. However, the clips also contain sound so the dataset can potentially be used for many purposes, including multi-modal analysis. Our inspiration in providing a dataset for classification is ImageNet [18], where the significant benefits of first training deep networks on this dataset for classification, and then using the trained network for other purposes (detection, image segmentation, non-visual modalities (e.g. sound, depth), etc) are well known.\n\nThe Kinetics dataset can be seen as the successor to the two human action video datasets that have emerged as the standard benchmarks for this area: HMDB-51 [15] and UCF-101 [20]. These datasets have served the community very well, but their usefulness is now expiring. This is because they are simply not large enough or have sufficient variation to train and test the current generation of human action classification models based on deep learning. Coincidentally, one of the motivations for introducing the HMDB dataset was that the then current generation of action datasets was too small. The increase then was from 10 to 51 classes, and we in turn increase this to 400 classes. Table 1 compares the size of Kinetics to a number of recent human action datasets. In terms of variation, although the UCF-101 dataset contains 101 actions with 100+ clips for each action, all the clips are taken from only 2.5k distinct videos. For example there are 7 clips from one video of the same person brushing their hair. This means that there is far less variation than if the action in each clip was performed by a different person (and different viewpoint, lighting, etc). This problem is avoided in Kinetics as each clip is taken from a different video.\n\nThe clips are sourced from YouTube videos. Consequently, for the most part, they are not professionally videoed and edited material (as in TV and film videos). There can be considerable camera motion/shake, illumination variations, shadows, background clutter, etc. More im-\n\n\nDataset\n\nYear Actions Clips Total Videos HMDB-51 [15] 2011 51 min 102 6,766 3,312 UCF-101 [20] 2012 101 min 101 13,320 2,500 ActivityNet-200 [3] 2015  200 avg 141  28,108  19,994  Kinetics  2017  400 min 400 306,245 306,245   Table 1: Statistics for recent human action recognition datasets. 'Actions', specifies the number of action classes; 'Clips', the number of clips per class; 'Total', is the total number of clips; and 'Videos', the total number of videos from which these clips are extracted.\n\nportantly, there are a great variety of performers (since each clip is from a different video) with differences in how the action is performed (e.g. its speed), clothing, body pose and shape, age, and camera framing and viewpoint. Our hope is that the dataset will enable a new generation of neural network architectures to be developed for video. For example, architectures including multiple streams of information (RGB/appearance, optical flow, human pose, object category recognition), architectures using attention, etc. That will enable the virtues (or otherwise) of the new architectures to be demonstrated. Issues such as the tension between static and motion prediction, and the open question of the best method of temporal aggregation in video (recurrent vs convolutional) may finally be resolved.\n\nThe rest of the paper is organized as: Section 2 gives an overview of the new dataset; Section 3 describes how it was collected and discusses possible imbalances in the data and their consequences for classifier bias. Section 4 gives the performance of a number of ConvNet architectures that are trained and tested on the dataset. Our companion paper [5] explores the benefit of pre-training an action classification network on Kinetics, and then using the features from the network for action classification on other (smaller) datasets.\n\nThe URLs of the YouTube videos and temporal intervals of the dataset can be obtained from http://deepmind. com/kinetics.\n\n\nAn Overview of the Kinetics Dataset\n\nContent: The dataset is focused on human actions (rather than activities or events). The list of action classes covers: Person Actions (singular), e.g. drawing, drinking, laughing, pumping fist; Person-Person Actions, e.g. hugging, kissing, shaking hands; and, Person-Object Actions, e.g. opening present, mowing lawn, washing dishes. Some actions are fine grained and require temporal reasoning to distinguish, for example different types of swimming. Other actions require more emphasis on the object to distinguish, for example playing different types of wind instruments.\n\nThere is not a deep hierarchy, but instead there are several (non-exclusive) parent-child groupings, e.g. Music (playing drums, trombone, violin, . . . ); Personal Hygiene (brushing teeth, cutting nails, washing hands, . . . ); Dancing (ballet, macarena, tap, . . . ); Cooking (cutting, frying, peeling, . . . ). The full list of classes is given in the appendix, together with parent-child groupings. Figure 1 shows clips from a sample of classes.\n\n\nStatistics:\n\nThe dataset has 400 human action classes, with 400-1150 clips for each action, each from a unique video. Each clip lasts around 10s. The current version has 306,245 videos, and is divided into three splits, one for training having 250-1000 videos per class, one for validation with 50 videos per class and one for testing with 100 videos per class. The statistics are given in table 2. The clips are from YouTube videos and have a variable resolution and frame rate.\n\n\nTrain\n\nValidation Test 250-1000 50 100 Non-exhaustive annotation. Each class contains clips illustrating that action. However, a particular clip can contain several actions. Interesting examples in the dataset include: \"texting\" while \"driving a car\"; \"Hula hooping\" while \"playing ukulele\"; \"brushing teeth\" while \"dancing\" (of some type). In each case both of the actions are Kinetics classes, and the clip will probably only appear under only one of these classes not both, i.e. clips do not have complete (exhaustive) annotation. For this reason when evaluating classification performance, a top-5 measure is more suitable than top-1. This is similar to the situation in ImageNet [18], where one of the reasons for using a top-5 measure is that images are only labelled for a single class, although it may contain multiple classes.\n\n\nHow the Dataset was Built\n\nIn this section we describe the collection process: how candidate videos were obtained from YouTube, and then the processing pipeline that was used to select the candidates  Best seen in colour and with zoom. Note that in some cases a single image is not enough for recognizing the action (e.g. \"headbanging\") or distinguishing classes (\"dribbling basketball\" vs \"dunking basketball\"). The dataset contains: Singular Person Actions (e.g. \"robot dancing\", \"stretching leg\"); Person-Person Actions (e.g. \"shaking hands\", \"tickling\"); Person-Object Actions (e.g. \"riding a bike\"); same verb different objects (e.g. \"playing violin\", \"playing trumpet\"); and same object different verbs (e.g. \"dribbling basketball\", \"dunking basketball\"). These are realistic (amateur) videos -there is often significant camera shake, for instance. and clean up the dataset. We then discuss possible biases in the dataset due to the collection process.\n\nOverview: clips for each class were obtained by first searching on YouTube for candidates, and then using Amazon Mechanical Turkers (AMT) to decide if the clip contains the action or not. Three or more confirmations (out of five) were required before a clip was accepted. The dataset was de-duped, by checking that only one clip is taken from each video, and that clips do not contain common video material. Finally, classes were checked for overlap and denoised.\n\nWe now describe these stages in more detail.\n\n\nStage 1: Obtaining an action list\n\nCurating a large list of human actions is challenging, as there is no single listing available at this scale with suitable visual action classes. Consequently, we had to combine numerous sources together with our own observations of actions that surround us. These sources include: (i) Action datasets -existing datasets like Ac-tivityNet [3], HMDB [15], UCF101 [20], MPII Human Pose [2], ACT [25] have useful classes and a suitable sub set of these were used; (ii) Motion capture -there are a number of motion capture datasets which we looked through and extracted file titles. These titles described the motion within the file and were often quite creative; and, (iii) Crowdsourced -we asked Mechanical Turk workers to come up with a more appropriate action if the label we had presented to them for a clip was incorrect.\n\n\nStage 2: Obtaining candidate clips\n\nThe chosen method and steps are detailed below which combine a number of different internal efforts:\n\nStep 1: obtaining videos. Videos are drawn from the YouTube corpus by matching video titles with the Kinetics actions list.\n\nStep 2: temporal positioning within a video. Image classifiers are available for a large number of human actions. These classifiers are obtained by tracking user actions on Google Image Search. For example, for a search query \"climbing tree\", user relevance feedback on images is collected by aggregating across the multiple times that that search query is issued. This relevance feedback is used to select a high-confidence set of images that can be used to train a \"climbing tree\" image classifier. These classifiers are run at the frame level over the videos found in step 1, and clips extracted around the top k responses (where k = 2).\n\nIt was found that the action list had a better match to relevant classifiers if action verbs are formatted to end with 'ing'. Thinking back to image search, this makes sense as typically if you are searching for an example of someone performing an action you would issue queries like 'running man' or 'brushing hair' over other tenses like 'man ran' or 'brush hair'.\n\nThe output of this stage is a large number of videos and a position in all of them where one of the actions is potentially occurring. 10 second clips are created by taking 5 seconds either side of that position (there are length exceptions when the position is within 5 seconds of the start or end of the video leading to a shorter clip length). The clips are then passed onto the next stage of cleanup through human labelling.\n\n\nStage 3: Manual labelling process\n\nThe key aim of this stage was to identify whether the supposed action was actually occurring during a clip or not. A human was required in the loop for this phase and we chose to use Amazon's Mechanical Turk (AMT) for the task due to the large numbers of high quality workers using the platform.\n\nA single-page webapp was built for the labelling task and optimised to maximise the number of clips presented to the workers whilst maintaining a high quality of annotation. The labelling interface is shown in figure 2. The user interface design and theme were chosen to differentiate the task from many others on the platform as well as make the task as stimulating and engaging as possible. This certainly paid off as the task was one of the highest rated on the platform and would frequently get more than 400 distinct workers as soon as a new run was launched.\n\nThe workers were given clear instructions at the beginning. There were two screens of instruction, the second reinforcing the first. After acknowledging they understood the task they were presented with a media player and several response icons. The interface would fetch a set of videos from the available pool for the worker at that moment and embed the first clip. The task consisted of 20 videos each with a different class where possible; we randomised all the videos and classes to make it more interesting for the workers and prevent them from becoming stuck on classes with low yields. Two of the video slots were used by us to inject groundtruth clips. This allowed us to get an estimate of the accuracy for each worker. If a worker fell below a 50% success rating on these, we showed them a 'low accuracy' warning screen. This helped address many low accuracies.\n\nIn the labelling interface, workers were asked the question \"Can you see a human performing the action class-name?\". The following response options were available on the interface as icons:\n\n• Yes, this contains a true example of the action  When a worker responded with 'Yes' we also asked the question \"Does the action last for the whole clip?\" in order to use this signal later during model training. Note, the AMT workers didn't have access to the audio to ensure that the video can be classified purely based on its visual content.\n\nIn order for a clip to be added to the dataset, it needed to receive at least 3 positive responses from workers. We allowed each clip to be annotated 5 times except if it had been annotated by more than 2 of a specific response. For example, if 3 out of 3 workers had said it did not contain an example of the action we would immediately remove it from the pool and not continue until 5 workers had annotated it.\n\nDue to the large scale of the task it was necessary to quickly remove classes that were made up of low quality or completely irrelevant candidates. Failing to do this would have meant that we spent a lot of money paying workers to mark videos as negative or bad. Accuracies for each class were calculated after 20 clips from that class had been annotated. We adjusted the accuracy threshold between runs but would typically start at a high accuracy of 50% (1 in 2 videos were expected to contain the action).\n\nFollowing annotating, the video ids, clip times and labels were exported from the database and handed on to be used for model training.\n\nWhat we learnt: We found that more specific classes like 'riding mule' were producing much less noise than more general classes like 'riding'. However, occasionally using more general classes was a benefit as they could subsequently be split into a few distinct classes that were not previously present and the candidates resent out to workers e.g. 'gardening' was split into 'watering plants', 'trimming trees' and 'planting trees'.\n\nThe amount of worker traffic that the task generated meant that we could not rely on direct fetching and writes to the database even with appropriate indexes and optimised queries. We therefore created many caches which were made up of groups of clips for each worker. When a worker started a new task, the interface would fetch a set of clips for that specific worker. The cache was replenished often by background processes as clips received a sufficient number of annotations. This also negated labelling collisions where previously > 1 worker might pick up the same video to annotate and we would quickly exceed 5 responses for any 1 clip.\n\n\nStage 4: Cleaning up and de-noising\n\nOne of the dataset design goals was having a single clip from each given video sequence, different from existing datasets which slice videos containing repetitive actions into many (correlated) training examples. We also employed mechanisms for identifying structural problems as we grew the dataset, such as repeated classes due to synonymy or different word order (e.g. riding motorbike, riding motorcycle), classes that are too general and co-occur with many others (e.g. talking) and which are problematic for typical 1-of-K classification learning approaches (instead of multi-label classification). We will now describe these procedures.\n\nDe-duplicating videos. We de-duplicated videos using two complementary approaches. First, in order to have only one clip from each YouTube link, we randomly selected a single clip from amongst those validated by Turkers for that video. This stage filtered out around 20% of Turkerapproved examples, but we visually found that it still left many duplicates. The reason is that YouTube users often create videos reusing portions of other videos, for example as part of video compilations or promotional adverts. Sometimes they are cropped, resized and generally pre-processed in different ways (but, nevertheless, the image classifier could localize the same clip). So even though each clip is from a distinct video there were still duplications.\n\nWe devised a process for de-duplicating across YouTube links which operated independently for each class. First we computed Inception-V1 [12] feature vectors (taken after last average pooling layer) on 224 × 224 center crops of 25 uniformly sampled frames from each video, which we then averaged. Afterwards we built a class-wise matrix having all cosine similarities between these feature vectors and thresholded it. Finally, we computed connected components and kept a random example from each. We found this to work well for most classes using the same threshold of 0.97, but adjusted it in a few cases where classes were visually similar, such as some taking place in the snow or in the water. This process reduced the number of Turker-approved examples by a further 15%.\n\nDetecting noisy classes. Classes can be 'noisy' in that they may overlap with other classes or they may contain several quite distinct (in terms of the action) groupings due to an ambiguity in the class name. For example, 'skipping' can be 'skipping with a rope' and also 'skipping stones across water'. We trained two-stream action classifiers [19] repeatedly throughout the dataset development to identify these noise classes. This allowed us to find the top confusions for each class, which sometimes were clear even by just verifying the class names (but went unnoticed due to the scale of the dataset), and other times required eyeballing the data to understand if the confusions were alright and the classes were just difficult to distinguish because of shortcomings of the model. We merged, split or outright removed classes based on these detected confusions.\n\nFinal filtering. After all the data was collected, deduplicated and the classes were selected, we ran a final manual clip filtering stage. Here the class scores from the twostream model were again useful as they allowed sorting the examples from most confident to least confident -a measure of how prototypical they were. We found that noisy examples were often among the lowest ranked examples and focused on those. The ranking also made adjacent any remaining duplicate videos, which made it easier to filter out those too.\n\n\nDiscussion: dataset bias I\n\nWe are familiar with the notion of dataset bias leading to lack of generalization: where a classifier trained on one dataset, e.g. Caltech 256 [10], does not perform well when tested on another, e.g. PASCAL VOC [8]. Indeed it is even possible to train a classifier to identify which dataset an image belongs to [22].\n\nThere is another sense of bias which could arise from unbalanced categories within a dataset. For example, gender imbalance in a training set could lead to a corresponding performance bias for classifiers trained on this set. There are precedents for this, e.g. in publicly available face detectors not being race agnostic 1 , and more recently in learning a semantic bias in written texts [4]. It is thus an important question as to whether Kinetics leads to such bias.\n\nTo this end we carried out a preliminary study on (i) whether the data for each action class of Kinetics is gender balanced, and (ii) if, there is an imbalance, whether it leads to a biased performance of the action classifies.\n\nThe outcome of (i) is that in 340 action classes out of the 400, the data is either not dominated by a single gender, or it is mostly not possible to determine the gender -the latter arises in classes where, for example, only hands appear, or the 'actors' are too small or heavily clothed. The classes that do show gender imbalance include 'shaving beard' and 'dunking basketball', that are mostly male, and 'filling eyebrows' and 'cheerleading', that are mostly female.\n\nThe outcome of (ii) for these classes we found little evidence of classifier bias for action classes with gender imbalance. For example in 'playing poker', which tends to have more male players, all videos with female players are correctly classified. The same happens for 'Hammer throw'. We can conjecture that this lack of bias is because the classifier is able to make use of both the objects involved in an action as well as the motion patterns, rather than simply physical appearance.\n\nImbalance can also be examined on other 'axes', for example age and race. Again, in a preliminary investigation we found very little clear bias. There is one exception where there is clear bias to babies -in 'crying', where many of the videos of non-babies crying are misclassified; another example is 'wrestling', where the opposite happens: adults wrestling in a ring seem to be better classified than children wrestling in their homes, but it is hard to tell whether the deciding factor is age or the scenes where the actions happen. Nevertheless, these issues of dataset imbalance and any resulting classifier bias warrant a more thorough investigation, and we return to this in section 5.\n\n\nDiscussion: dataset bias II\n\nAnother type of bias could arise because classifiers are involved in the dataset collection pipeline: it could be that these classifiers lead to a reduction in the visual variety of the clips obtained, which in turn leads to a bias in the action classifier trained on these clips. In more detail, although the videos are selected based on their title (which is provided by the person uploading the video to YouTube), the position of the candidate clip within the video is provided by an image (RGB) classifier, as described above. In practice, using a classifier at this point does not seem to constrain the variety of the clips -since the video is about the action, the particular frame chosen as part of the clip may not be crucial; and, in any case, the clip contains hundreds of more frames where the appearance (RGB) and motion can vary considerably. For these reasons we are not so concerned about the intermediate use of image classifiers.\n\n\nBenchmark Performance\n\nIn this section we first briefly describe three standard ConvNet architectures for human action recognition in video. We then use these architectures as baselines and compare their performance by training and testing on the Kinetics dataset. We also include their performance on UCF-101 and HMDB-51.\n\nWe consider three typical approaches for video classification: ConvNets with an LSTM on top [7,26]; two-stream networks [9,19]; and a 3D ConvNet [13,21,23]. There have been many improvements over these basic architectures, e.g. [9], but our intention here is not to perform a thorough study on what is the very best architecture on Kinetics, but instead to provide an indication of the level of difficulty of the dataset. A rough graphical overview of the three types of architectures we compare is shown in figure 3, and the specification of their temporal interfaces is given in table 3.\n\nFor the experiments on the Kinetics dataset all three architectures are trained from scratch using Kinetics. How-ever, for the experiments on UCF-101 and HMDB-51 the architectures (apart from the 3D ConvNet) are pre-trained on ImageNet (since these datasets are too small to train the architectures from scratch).\n\n\nConvNet+LSTM\n\nThe high performance of image classification networks makes it appealing to try to reuse them with as minimal change as possible for video. This can be achieved by using them to extract features independently from each frame then pooling their predictions across the whole video [14]. This is in the spirit of bag of words image modeling approaches [16,17,24], but while convenient in practice, it has the issue of entirely ignoring temporal structure (e.g. models can't potentially distinguish opening from closing a door).\n\nIn theory, a more satisfying approach is to add a recurrent layer to the model [7,26], such as an LSTM, which can encode state, and capture temporal ordering and long range dependencies. We position an LSTM layer with batch normalization (as proposed by Cooijmans et al. [6]) after the last average pooling layer of a ResNet-50 model [11], with 512 hidden units. We then add a fully connected layer on top of the output of the LSTM for the multi-way classification. At test time the classification is taken from the model output for the last frame.\n\n\nTwo-Stream networks\n\nLSTMs on features from the last layers of ConvNets can model high-level variation, but may not be able to capture fine low-level motion which is critical in many cases. It is also expensive to train as it requires unrolling the network through multiple frames for backpropagation-through-time.\n\nA different, very practical approach, introduced by Simonyan and Zisserman [19], models short temporal snapshots of videos by averaging the predictions from a single RGB frame and a stack of 10 externally computed optical flow frames, after passing them through two replicas of an ImageNet-pretrained ConvNet. The flow stream has an adapted input convolutional layer with twice as many input channels as flow frames (because flow has two channels, horizontal and vertical), and at test time multiple snapshots are sampled from the video and the action prediction is averaged. This was shown to get very high performance on existing benchmarks, while being very efficient to train and test.\n\n\n3D ConvNets\n\n3D ConvNets [13,21,23] seem like a natural approach to video modeling. They are just like standard 2D convolutional networks, but with spatio-temporal filters, and have a very interesting characteristic: they directly create hierarchical representations of spatio-temporal data. One issue with these models is that they have many more parameters than 2D ConvNets because of the additional kernel dimension, and this makes them harder to train. Also, they seem to preclude the benefits of ImageNet pre-training and previous work has defined relatively shallow custom architectures and trained them from scratch [13,14,21,23]. Results on benchmarks have shown promise but have not yet matched the state-of-the-art, possibly because they require more training data than their 2D counterparts. Thus 3D ConvNets are a good candidate for evaluation on our larger dataset.\n\nFor this paper we implemented a small variation of C3D [23], which has 8 convolutional layers, 5 pooling layers and 2 fully connected layers at the top. The inputs to the model are short 16-frame clips with 112 × 112-pixel crops. Differently from the original paper we use batch normalization after all convolutional and fully connected layers. Another difference to the original model is in the first pooling layer, where we use a temporal stride of 2 instead of 1, which reduces the memory footprint and allows for bigger batchesthis was important for batch normalization (especially after the fully connected layers, where there is no weight tying). Using this stride we were able to train with 15 videos per batch per GPU using standard K40 GPUs.\n\nAt test time, we split the video uniformly into crops of 16 frames and apply the classifier separately on each. We then average the class scores, as in the original paper.\n\n\nImplementation details\n\nThe ConvNet+LSTM and Two-Stream architecures use ResNet-50 as the base architecture. In the case of the Two-Stream architecture, a separate ResNet-50 is trained independently for each stream. As noted earlier, for these architectures the ResNet-50 model is pre-trained on Ima-geNet for the experiments on UCF-101 and HMDB-51, and trained from scratch for experiments on Kinetics. The 3D-ConvNet is not pre-trained.\n\nWe trained the models on videos using standard SGD with momentum in all cases, with synchronous parallelization across 64 GPUs for all models. We trained models on Kinetics for up to 100k steps, with a 10x reduction of learning rate when validation loss saturated, and tuned weight decay and learning rate hyperparameters on the validation set of Kinetics. All the models were implemented in Ten-sorFlow [1].\n\nThe original clips have variable resolution and frame rate. In our experiments they are all normalized so that the larger image side is 340 pixels wide for models using ResNet-50 and 128 pixels wide for the 3D ConvNet. We also resample the videos so they have 25 frames per second.\n\nData augmentation is known to be of crucial importance for the performance of deep architectures. We used random cropping both spatially -randomly cropping a 299 × 299   patch (respectively 112 × 112 for the 3D ConvNet) -and temporally, when picking the starting frame among those early enough to guarantee a desired number of frames. For shorter videos, we looped the video as many times as necessary to satisfy each model's input interface. We also applied random left-right flipping consistently for each video during training.\n\nAt test time, we sample from up to 10 seconds of video, again looping if necessary. Better performance could be obtained by also considering left-right flipped videos at test time and by adding additional augmentation, such as photometric, during training. We leave this to future work.\n\n\nBaseline evaluations\n\nIn this section we compare the performance of the three baseline architectures whilst varying the dataset used for training and testing. Table 4 shows the classification accuracy when training and testing on either UCF-101, HMDB-51 or Kinetics. We train and test on split 1 of UCF-101 and HMDB-51, and on the train/val set and held-out test set of Kinetics.\n\nThere are several noteworthy observations. First, the performance is far lower on Kinetics than on UCF-101, an indication of the different levels of difficulty of the two datasets. On the other hand, the performance on HMDB-51 is worse than on Kinetics -it seems to have a truly difficult test set, and it was designed to be difficult to appearance-centered methods, while having little training data. The parameterrich 3D-ConvNet model is not pre-trained on ImageNet, unlike the other baselines. This translates into poor performance on all datasets but especially on UCF-101 and HMDB-51 -on Kinetics it is much closer to the performance of the other models, thanks to the much larger training set of Kinetics.\n\n• Class difficulty. We include a full list of Kinetics classes sorted by classification accuracy under the twostream model in figure 4. Eating classes are among the hardest, as they sometimes require distinguishing what is being eaten, such as hotdogs, chips and doughnutsand these may appear small and already partially consumed, in the video. Dancing classes are also hard, as well as classes centered on a specific body part, such as \"massaging feet\", or \"shaking head\".\n\n• Class confusion. The top 10 class confusions are provided in table 5. They mostly correspond to finegrained distinctions that one would expect to be hard, for example 'long jump' and 'triple jump', confusing burger with doughnuts. The confusion between 'swing dancing' and 'salsa dancing' raises the question of how accurate motion modeling is in the two-stream model, since 'swing dancing' is typically much faster-paced and has a peculiar style that makes it easy for humans to distinguish from salsa.\n\n• Classes where motion matters most. We tried to analyze for which classes motion is more important and which ones were recognized correctly using just appearance information, by comparing the recognition accuracy ratios when using the flow and RGB streams of the two-stream model in isolation. We show the five classes where this ratio is largest and smallest in table 6.\n\n\nConclusion\n\nWe have described the Kinetics Human Action Video dataset, which has an order of magnitude more videos than previous datasets of its type. We have also discussed the procedures we employed collecting the data and for ensuring its quality. We have shown that the performance of standard existing models on this dataset is much lower than on UCF-101 and on par with HMDB-51, whilst allowing large models such as 3D ConvNets to be trained from scratch, unlike the existing human action datasets.\n\nWe have also carried out a preliminary analysis of dataset imbalance and whether this leads to bias in the classifiers trained on the dataset. We found little evidence that the resulting classifiers demonstrate bias along sensitive axes, such as across gender. This is however a complex area that deserves further attention. We leave a thorough analysis for future work, in collaboration with specialists from complementary areas, namely social scientists and critical humanists.\n\nWe will release trained baseline models (in TensorFlow), so that they can be used, for example, to generate features for new action classes.  0.0 'making a sandwich' 0.0 Table 6: Classes with largest and smallest ratios of recognition accuracy when using flow and RGB. The highest ratios correspond to when flow does better, the smallest to when RGB does better. We also evaluated the ratios of rgb+flow to rgb accuracies and the ordering was quite similar.\n\nFigure 1 :\n1Example classes from the Kinetics dataset.\n\n•\nNo, this does not contain an example of the action\n\nFigure 2 :\n2Labeling interface used in Mechanical Turk. • You are unsure if there is an example of the action • Replay the video • Video does not play, does not contain a human, is an image, cartoon or a computer game.\n\nFigure 3 :\n3Video architectures used as baseline human action classifiers.\n\nFigure 4 :\n4List of 20 easiest and 20 hardest Kinetics classes sorted by class accuracies obtained using the two-stream model.\n\nTable 2 :\n2Kinetics Dataset Statistics. The number of clips for each class in the train/val/test partitions.\n\nTable 3 :\n3Number of parameters and temporal input sizes of the models.ConvNet+LSTM and Two-Stream use ResNet-50 \n\n\nTable 4 :\n4Baseline comparisons across datasets: (left) training and testing on split 1 of UCF-101; (middle) training and testing on split 1 of HMDB-51; (right) training and testing on Kinetics (showing top-1/top-5 performance). ConvNet+LSTM and Two-Stream use ResNet-50 ConvNet modules, pretrained on ImageNet for UCF-101 and HMDB-51 examples but not for the Kinetics experiments. Note that the Two-Stream architecture numbers on individual RGB and Flow streams can be interpreted as a simple baseline which applies a ConvNet independently on 25 uniformly sampled frames then averages the predictions.\n\nTable 5 :\n5Top-12 class confusions in Kinetics, using the two-stream model.Class \nFlow/RGB accuracy ratio \n'rock scissors paper' \n5.3 \n'sword fighting' \n3.1 \n'robot dancing' \n3.1 \n'air drumming' \n2.8 \n'exercising arm' \n2.5 \n'making a cake' \n0.1 \n'cooking sausages' \n0.1 \n'sniffing' \n0.1 \n'eating cake' \n\nhttps://www.media.mit.edu/posts/ media-lab-student-recognized-for-fighting-bias-in-machine-learn\nAcknowledgements:The collection of this dataset was funded by DeepMind. We are very grateful for help from Andreas Kirsch, John-Paul Holt, Danielle Breen, Jonathan Fildes, James Besley and Brian Carver. We are grateful for advice and comments from Tom Duerig, Juan Carlos Niebles, Simon Osindero, Chuck Rosenberg and Sean Legassick; we would also like to thank Sandra and Aditya for data clean up.A. List of Kinetics Human Action ClassesThis is the list of classes included in the human action video dataset. The number of clips for each action class is given by the number in brackets following each class name.B. List of Parent-Child GroupingsThese lists are not exclusive and are not intended to be comprehensive. Rather, they are a guide for related human action classes.arts and crafts(12)arranging flowers blowing glass brush painting carving pumpkin clay pottery making decorating the christmas tree drawing getting a tattoo knitting making jewelry spray painting weaving basket athletics -jumping(\nM Abadi, A Agarwal, P Barham, E Brevdo, Z Chen, C Citro, G S Corrado, A Davis, J Dean, M Devin, arXiv:1603.04467Large-scale machine learning on heterogeneous distributed systems. arXiv preprintM. Abadi, A. Agarwal, P. Barham, E. Brevdo, Z. Chen, C. Citro, G. S. Corrado, A. Davis, J. Dean, M. Devin, et al. Tensorflow: Large-scale machine learning on heteroge- neous distributed systems. arXiv preprint arXiv:1603.04467, 2016.\n\n2d human pose estimation: New benchmark and state of the art analysis. M Andriluka, L Pishchulin, P Gehler, B Schiele, Computer Vision and Pattern Recognition (CVPR), 2014 IEEE Conference. IEEEM. Andriluka, L. Pishchulin, P. Gehler, and B. Schiele. 2d human pose estimation: New benchmark and state of the art analysis. In Computer Vision and Pattern Recognition (CVPR), 2014 IEEE Conference on. IEEE, 2014.\n\nActivitynet: A large-scale video benchmark for human activity understanding. F Caba Heilbron, V Escorcia, B Ghanem, J C Niebles, Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. the IEEE Conference on Computer Vision and Pattern RecognitionF. Caba Heilbron, V. Escorcia, B. Ghanem, and J. C. Niebles. Activitynet: A large-scale video benchmark for human activ- ity understanding. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition, 2015.\n\nSemantics derived automatically from language corpora contain humanlike biases. A Caliskan, J J Bryson, A Narayanan, Science. 3566334A. Caliskan, J. J. Bryson, and A. Narayanan. Semantics de- rived automatically from language corpora contain human- like biases. Science, 356(6334):183-186, 2017.\n\nQuo vadis, action recognition? new models and the kinetics dataset. J Carreira, A Zisserman, IEEE International Conference on Computer Vision and Pattern Recognition CVPR. J. Carreira and A. Zisserman. Quo vadis, action recogni- tion? new models and the kinetics dataset. In IEEE Interna- tional Conference on Computer Vision and Pattern Recogni- tion CVPR, 2017.\n\nT Cooijmans, N Ballas, C Laurent, A Courville, arXiv:1603.09025Recurrent batch normalization. arXiv preprintT. Cooijmans, N. Ballas, C. Laurent, and A. Courville. Recurrent batch normalization. arXiv preprint arXiv:1603.09025, 2016.\n\nLong-term recurrent convolutional networks for visual recognition and description. J Donahue, L Hendricks, S Guadarrama, M Rohrbach, S Venugopalan, K Saenko, T Darrell, Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. the IEEE Conference on Computer Vision and Pattern RecognitionJ. Donahue, L. Anne Hendricks, S. Guadarrama, M. Rohrbach, S. Venugopalan, K. Saenko, and T. Dar- rell. Long-term recurrent convolutional networks for visual recognition and description. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition, pages 2625-2634, 2015.\n\nThe pascal visual object classes challenge: A retrospective. M Everingham, S A Eslami, L Van Gool, C K Williams, J Winn, A Zisserman, International Journal of Computer Vision. 1111M. Everingham, S. A. Eslami, L. Van Gool, C. K. Williams, J. Winn, and A. Zisserman. The pascal visual object classes challenge: A retrospective. International Journal of Com- puter Vision, 111(1):98-136, 2015.\n\nConvolutional two-stream network fusion for video action recognition. C Feichtenhofer, A Pinz, A Zisserman, IEEE International Conference on Computer Vision and Pattern Recognition CVPR. C. Feichtenhofer, A. Pinz, and A. Zisserman. Convolutional two-stream network fusion for video action recognition. In IEEE International Conference on Computer Vision and Pat- tern Recognition CVPR, 2016.\n\nCaltech-256 object category dataset. G Griffin, A Holub, P Perona, G. Griffin, A. Holub, and P. Perona. Caltech-256 object cat- egory dataset. 2007.\n\nDeep residual learning for image recognition. K He, X Zhang, S Ren, J Sun, Computer Vision and Pattern Recognition (CVPR), 2016 IEEE Conference on. K. He, X. Zhang, S. Ren, and J. Sun. Deep residual learn- ing for image recognition. In Computer Vision and Pattern Recognition (CVPR), 2016 IEEE Conference on, 2016.\n\nBatch normalization: Accelerating deep network training by reducing internal covariate shift. S Ioffe, C Szegedy, arXiv:1502.03167arXiv preprintS. Ioffe and C. Szegedy. Batch normalization: Accelerating deep network training by reducing internal covariate shift. arXiv preprint arXiv:1502.03167, 2015.\n\n3d convolutional neural networks for human action recognition. S Ji, W Xu, M Yang, K Yu, IEEE transactions on pattern analysis and machine intelligence. 35S. Ji, W. Xu, M. Yang, and K. Yu. 3d convolutional neural networks for human action recognition. IEEE transactions on pattern analysis and machine intelligence, 35(1):221- 231, 2013.\n\nLarge-scale video classification with convolutional neural networks. A Karpathy, G Toderici, S Shetty, T Leung, R Sukthankar, L Fei-Fei, Proceedings of the IEEE conference on Computer Vision and Pattern Recognition. the IEEE conference on Computer Vision and Pattern RecognitionA. Karpathy, G. Toderici, S. Shetty, T. Leung, R. Sukthankar, and L. Fei-Fei. Large-scale video classification with convo- lutional neural networks. In Proceedings of the IEEE con- ference on Computer Vision and Pattern Recognition, pages 1725-1732, 2014.\n\nHMDB: a large video database for human motion recognition. H Kuehne, H Jhuang, E Garrote, T Poggio, T Serre, Proceedings of the International Conference on Computer Vision (ICCV). the International Conference on Computer Vision (ICCV)H. Kuehne, H. Jhuang, E. Garrote, T. Poggio, and T. Serre. HMDB: a large video database for human motion recog- nition. In Proceedings of the International Conference on Computer Vision (ICCV), 2011.\n\nLearning realistic human actions from movies. I Laptev, M Marszalek, C Schmid, B Rozenfeld, Computer Vision and Pattern Recognition. IEEECVPR 2008. IEEE Conference onI. Laptev, M. Marszalek, C. Schmid, and B. Rozenfeld. Learning realistic human actions from movies. In Computer Vision and Pattern Recognition, 2008. CVPR 2008. IEEE Conference on, pages 1-8. IEEE, 2008.\n\nUnsupervised learning of human action categories using spatial-temporal words. J C Niebles, H Wang, L Fei-Fei, International journal of computer vision. 793J. C. Niebles, H. Wang, and L. Fei-Fei. Unsupervised learn- ing of human action categories using spatial-temporal words. International journal of computer vision, 79(3):299-318, 2008.\n\n. O Russakovsky, J Deng, H Su, J Krause, S Satheesh, S Ma, S Huang, A Karpathy, A Khosla, M Bernstein, A Berg, F Li, Imagenet large scale visual recognition challenge. IJCVO. Russakovsky, J. Deng, H. Su, J. Krause, S. Satheesh, S. Ma, S. Huang, A. Karpathy, A. Khosla, M. Bernstein, A. Berg, and F. Li. Imagenet large scale visual recognition challenge. IJCV, 2015.\n\nTwo-stream convolutional networks for action recognition in videos. K Simonyan, A Zisserman, Advances in Neural Information Processing Systems. K. Simonyan and A. Zisserman. Two-stream convolutional networks for action recognition in videos. In Advances in Neural Information Processing Systems, pages 568-576, 2014.\n\nUcf101: A dataset of 101 human actions classes from videos in the wild. K Soomro, A R Zamir, M Shah, arXiv:1212.0402arXiv preprintK. Soomro, A. R. Zamir, and M. Shah. Ucf101: A dataset of 101 human actions classes from videos in the wild. arXiv preprint arXiv:1212.0402, 2012.\n\nConvolutional learning of spatio-temporal features. G W Taylor, R Fergus, Y Lecun, C Bregler, European conference on computer vision. SpringerG. W. Taylor, R. Fergus, Y. LeCun, and C. Bregler. Convolu- tional learning of spatio-temporal features. In European con- ference on computer vision, pages 140-153. Springer, 2010.\n\nUnbiased look at dataset bias. A Torralba, A A Efros, Computer Vision and Pattern Recognition (CVPR), 2011 IEEE Conference on. IEEEA. Torralba and A. A. Efros. Unbiased look at dataset bias. In Computer Vision and Pattern Recognition (CVPR), 2011 IEEE Conference on, pages 1521-1528. IEEE, 2011.\n\nLearning spatiotemporal features with 3d convolutional networks. D Tran, L Bourdev, R Fergus, L Torresani, M Paluri, 2015 IEEE International Conference on Computer Vision (ICCV). IEEED. Tran, L. Bourdev, R. Fergus, L. Torresani, and M. Paluri. Learning spatiotemporal features with 3d convolutional net- works. In 2015 IEEE International Conference on Computer Vision (ICCV), pages 4489-4497. IEEE, 2015.\n\nAction recognition with improved trajectories. H Wang, C Schmid, International Conference on Computer Vision. H. Wang and C. Schmid. Action recognition with improved trajectories. In International Conference on Computer Vi- sion, 2013.\n\nActions˜transforma-tions. X Wang, A Farhadi, A Gupta, CVPR. X. Wang, A. Farhadi, and A. Gupta. Actions˜transforma- tions. In CVPR, 2016.\n\nabseiling (1146) 2. air drumming (1132) paintball (1140) 242. playing piano (691) 243. playing poker (1134) 244. playing recorder (1148) 245. playing saxophone (916) 246. playing squash or racquetball (980) 247. playing tennis (1144) 248. playing trombone (1149) 249. playing trumpet (989) 250. playing ukulele (1146) 251. playing violin (1142) 252. playing volleyball (804) 253. playing xylophone (746) 254. pole vault (984) 255. presenting weather forecast (1050) 256. pull ups (1121) 257. pumping fist (1009) 258. pumping gas (544) 259. punching bag (1150) 260. punching person (boxing) (483) 261. push up (614) 262. pushing car (1069) 263. pushing cart (1150) 264. pushing wheelchair (465) 265. reading book (1148) elephant (1104) 271. riding mechanical bull (698) 272. J Yue-Hei, M Ng, S Hausknecht, O Vijayanarasimhan, R Vinyals, G Monga, Toderici, Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. the IEEE Conference on Computer Vision and Pattern Recognition1Beyond short snippets: Deep networks for video classification. riding mountain bike (495) 273. riding mule (476) 274. riding or walking with horse (1131) 275. riding scooter (674) (1140) 400. zumba (1093J. Yue-Hei Ng, M. Hausknecht, S. Vijayanarasimhan, O. Vinyals, R. Monga, and G. Toderici. Beyond short snip- pets: Deep networks for video classification. In Proceed- ings of the IEEE Conference on Computer Vision and Pattern Recognition, pages 4694-4702, 2015. 1. abseiling (1146) 2. air drumming (1132) paintball (1140) 242. playing piano (691) 243. playing poker (1134) 244. playing recorder (1148) 245. playing saxophone (916) 246. playing squash or racquetball (980) 247. playing tennis (1144) 248. playing trombone (1149) 249. playing trumpet (989) 250. playing ukulele (1146) 251. playing violin (1142) 252. playing volleyball (804) 253. playing xylophone (746) 254. pole vault (984) 255. presenting weather forecast (1050) 256. pull ups (1121) 257. pumping fist (1009) 258. pumping gas (544) 259. punching bag (1150) 260. punching person (boxing) (483) 261. push up (614) 262. pushing car (1069) 263. pushing cart (1150) 264. pushing wheelchair (465) 265. reading book (1148) elephant (1104) 271. riding mechanical bull (698) 272. riding mountain bike (495) 273. riding mule (476) 274. riding or walking with horse (1131) 275. riding scooter (674) (1140) 400. zumba (1093)\n", "annotations": {"author": "[{\"end\":68,\"start\":43},{\"end\":83,\"start\":69},{\"end\":119,\"start\":84},{\"end\":154,\"start\":120},{\"end\":189,\"start\":155},{\"end\":218,\"start\":190},{\"end\":249,\"start\":219},{\"end\":260,\"start\":250},{\"end\":289,\"start\":261},{\"end\":320,\"start\":290},{\"end\":360,\"start\":321},{\"end\":399,\"start\":361}]", "publisher": null, "author_last_name": "[{\"end\":51,\"start\":48},{\"end\":82,\"start\":74},{\"end\":98,\"start\":90},{\"end\":131,\"start\":126},{\"end\":168,\"start\":161},{\"end\":217,\"start\":201},{\"end\":230,\"start\":225},{\"end\":259,\"start\":254},{\"end\":272,\"start\":268},{\"end\":301,\"start\":295},{\"end\":337,\"start\":329},{\"end\":377,\"start\":368}]", "author_first_name": "[{\"end\":47,\"start\":43},{\"end\":73,\"start\":69},{\"end\":89,\"start\":84},{\"end\":125,\"start\":120},{\"end\":160,\"start\":155},{\"end\":200,\"start\":190},{\"end\":224,\"start\":219},{\"end\":253,\"start\":250},{\"end\":267,\"start\":261},{\"end\":294,\"start\":290},{\"end\":328,\"start\":321},{\"end\":367,\"start\":361}]", "author_affiliation": null, "title": "[{\"end\":40,\"start\":1},{\"end\":439,\"start\":400}]", "venue": null, "abstract": "[{\"end\":1178,\"start\":441}]", "bib_ref": "[{\"attributes\":{\"ref_id\":\"b17\"},\"end\":2225,\"start\":2221},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":2638,\"start\":2634},{\"attributes\":{\"ref_id\":\"b19\"},\"end\":2655,\"start\":2651},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":4058,\"start\":4054},{\"attributes\":{\"ref_id\":\"b19\"},\"end\":4099,\"start\":4095},{\"attributes\":{\"ref_id\":\"b2\"},\"end\":4149,\"start\":4146},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":5670,\"start\":5667},{\"attributes\":{\"ref_id\":\"b17\"},\"end\":8213,\"start\":8209},{\"attributes\":{\"ref_id\":\"b2\"},\"end\":10212,\"start\":10209},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":10223,\"start\":10219},{\"attributes\":{\"ref_id\":\"b19\"},\"end\":10236,\"start\":10232},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":10257,\"start\":10254},{\"attributes\":{\"ref_id\":\"b24\"},\"end\":10267,\"start\":10263},{\"attributes\":{\"ref_id\":\"b11\"},\"end\":18420,\"start\":18416},{\"attributes\":{\"ref_id\":\"b18\"},\"end\":19405,\"start\":19401},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":20628,\"start\":20624},{\"attributes\":{\"ref_id\":\"b7\"},\"end\":20695,\"start\":20692},{\"attributes\":{\"ref_id\":\"b21\"},\"end\":20796,\"start\":20792},{\"attributes\":{\"ref_id\":\"b3\"},\"end\":21192,\"start\":21189},{\"attributes\":{\"ref_id\":\"b6\"},\"end\":24556,\"start\":24553},{\"attributes\":{\"ref_id\":\"b25\"},\"end\":24559,\"start\":24556},{\"attributes\":{\"ref_id\":\"b8\"},\"end\":24584,\"start\":24581},{\"attributes\":{\"ref_id\":\"b18\"},\"end\":24587,\"start\":24584},{\"attributes\":{\"ref_id\":\"b12\"},\"end\":24610,\"start\":24606},{\"attributes\":{\"ref_id\":\"b20\"},\"end\":24613,\"start\":24610},{\"attributes\":{\"ref_id\":\"b22\"},\"end\":24616,\"start\":24613},{\"attributes\":{\"ref_id\":\"b8\"},\"end\":24692,\"start\":24689},{\"attributes\":{\"ref_id\":\"b13\"},\"end\":25665,\"start\":25661},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":25735,\"start\":25731},{\"attributes\":{\"ref_id\":\"b16\"},\"end\":25738,\"start\":25735},{\"attributes\":{\"ref_id\":\"b23\"},\"end\":25741,\"start\":25738},{\"attributes\":{\"ref_id\":\"b6\"},\"end\":25990,\"start\":25987},{\"attributes\":{\"ref_id\":\"b25\"},\"end\":25993,\"start\":25990},{\"attributes\":{\"ref_id\":\"b5\"},\"end\":26182,\"start\":26179},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":26246,\"start\":26242},{\"attributes\":{\"ref_id\":\"b18\"},\"end\":26854,\"start\":26850},{\"attributes\":{\"ref_id\":\"b12\"},\"end\":27496,\"start\":27492},{\"attributes\":{\"ref_id\":\"b20\"},\"end\":27499,\"start\":27496},{\"attributes\":{\"ref_id\":\"b22\"},\"end\":27502,\"start\":27499},{\"attributes\":{\"ref_id\":\"b12\"},\"end\":28094,\"start\":28090},{\"attributes\":{\"ref_id\":\"b13\"},\"end\":28097,\"start\":28094},{\"attributes\":{\"ref_id\":\"b20\"},\"end\":28100,\"start\":28097},{\"attributes\":{\"ref_id\":\"b22\"},\"end\":28103,\"start\":28100},{\"attributes\":{\"ref_id\":\"b22\"},\"end\":28406,\"start\":28402},{\"attributes\":{\"ref_id\":\"b0\"},\"end\":30120,\"start\":30117}]", "figure": "[{\"attributes\":{\"id\":\"fig_1\"},\"end\":35178,\"start\":35123},{\"attributes\":{\"id\":\"fig_2\"},\"end\":35232,\"start\":35179},{\"attributes\":{\"id\":\"fig_3\"},\"end\":35452,\"start\":35233},{\"attributes\":{\"id\":\"fig_4\"},\"end\":35528,\"start\":35453},{\"attributes\":{\"id\":\"fig_5\"},\"end\":35656,\"start\":35529},{\"attributes\":{\"id\":\"tab_0\",\"type\":\"table\"},\"end\":35766,\"start\":35657},{\"attributes\":{\"id\":\"tab_2\",\"type\":\"table\"},\"end\":35882,\"start\":35767},{\"attributes\":{\"id\":\"tab_3\",\"type\":\"table\"},\"end\":36486,\"start\":35883},{\"attributes\":{\"id\":\"tab_5\",\"type\":\"table\"},\"end\":36791,\"start\":36487}]", "paragraph": "[{\"end\":1695,\"start\":1194},{\"end\":2475,\"start\":1697},{\"end\":3726,\"start\":2477},{\"end\":4002,\"start\":3728},{\"end\":4505,\"start\":4014},{\"end\":5314,\"start\":4507},{\"end\":5853,\"start\":5316},{\"end\":5975,\"start\":5855},{\"end\":6590,\"start\":6015},{\"end\":7040,\"start\":6592},{\"end\":7522,\"start\":7056},{\"end\":8360,\"start\":7532},{\"end\":9321,\"start\":8390},{\"end\":9786,\"start\":9323},{\"end\":9832,\"start\":9788},{\"end\":10693,\"start\":9870},{\"end\":10832,\"start\":10732},{\"end\":10957,\"start\":10834},{\"end\":11599,\"start\":10959},{\"end\":11967,\"start\":11601},{\"end\":12396,\"start\":11969},{\"end\":12729,\"start\":12434},{\"end\":13295,\"start\":12731},{\"end\":14169,\"start\":13297},{\"end\":14360,\"start\":14171},{\"end\":14707,\"start\":14362},{\"end\":15121,\"start\":14709},{\"end\":15631,\"start\":15123},{\"end\":15768,\"start\":15633},{\"end\":16203,\"start\":15770},{\"end\":16848,\"start\":16205},{\"end\":17531,\"start\":16888},{\"end\":18277,\"start\":17533},{\"end\":19054,\"start\":18279},{\"end\":19923,\"start\":19056},{\"end\":20450,\"start\":19925},{\"end\":20797,\"start\":20481},{\"end\":21269,\"start\":20799},{\"end\":21498,\"start\":21271},{\"end\":21970,\"start\":21500},{\"end\":22461,\"start\":21972},{\"end\":23156,\"start\":22463},{\"end\":24134,\"start\":23188},{\"end\":24459,\"start\":24160},{\"end\":25050,\"start\":24461},{\"end\":25365,\"start\":25052},{\"end\":25906,\"start\":25382},{\"end\":26456,\"start\":25908},{\"end\":26773,\"start\":26480},{\"end\":27464,\"start\":26775},{\"end\":28345,\"start\":27480},{\"end\":29097,\"start\":28347},{\"end\":29270,\"start\":29099},{\"end\":29711,\"start\":29297},{\"end\":30121,\"start\":29713},{\"end\":30404,\"start\":30123},{\"end\":30936,\"start\":30406},{\"end\":31224,\"start\":30938},{\"end\":31606,\"start\":31249},{\"end\":32319,\"start\":31608},{\"end\":32794,\"start\":32321},{\"end\":33301,\"start\":32796},{\"end\":33675,\"start\":33303},{\"end\":34182,\"start\":33690},{\"end\":34663,\"start\":34184},{\"end\":35122,\"start\":34665}]", "formula": null, "table_ref": "[{\"end\":3168,\"start\":3161},{\"attributes\":{\"ref_id\":\"tab_0\"},\"end\":4238,\"start\":4150},{\"attributes\":{\"ref_id\":\"tab_3\"},\"end\":31393,\"start\":31386},{\"end\":34842,\"start\":34835}]", "section_header": "[{\"attributes\":{\"n\":\"1.\"},\"end\":1192,\"start\":1180},{\"end\":4012,\"start\":4005},{\"attributes\":{\"n\":\"2.\"},\"end\":6013,\"start\":5978},{\"end\":7054,\"start\":7043},{\"end\":7530,\"start\":7525},{\"attributes\":{\"n\":\"3.\"},\"end\":8388,\"start\":8363},{\"attributes\":{\"n\":\"3.1.\"},\"end\":9868,\"start\":9835},{\"attributes\":{\"n\":\"3.2.\"},\"end\":10730,\"start\":10696},{\"attributes\":{\"n\":\"3.3.\"},\"end\":12432,\"start\":12399},{\"attributes\":{\"n\":\"3.4.\"},\"end\":16886,\"start\":16851},{\"attributes\":{\"n\":\"3.5.\"},\"end\":20479,\"start\":20453},{\"attributes\":{\"n\":\"3.6.\"},\"end\":23186,\"start\":23159},{\"attributes\":{\"n\":\"4.\"},\"end\":24158,\"start\":24137},{\"attributes\":{\"n\":\"4.1.\"},\"end\":25380,\"start\":25368},{\"attributes\":{\"n\":\"4.2.\"},\"end\":26478,\"start\":26459},{\"attributes\":{\"n\":\"4.3.\"},\"end\":27478,\"start\":27467},{\"attributes\":{\"n\":\"4.4.\"},\"end\":29295,\"start\":29273},{\"attributes\":{\"n\":\"4.5.\"},\"end\":31247,\"start\":31227},{\"attributes\":{\"n\":\"5.\"},\"end\":33688,\"start\":33678},{\"end\":35134,\"start\":35124},{\"end\":35181,\"start\":35180},{\"end\":35244,\"start\":35234},{\"end\":35464,\"start\":35454},{\"end\":35540,\"start\":35530},{\"end\":35667,\"start\":35658},{\"end\":35777,\"start\":35768},{\"end\":35893,\"start\":35884},{\"end\":36497,\"start\":36488}]", "table": "[{\"end\":35882,\"start\":35839},{\"end\":36791,\"start\":36563}]", "figure_caption": "[{\"end\":35178,\"start\":35136},{\"end\":35232,\"start\":35182},{\"end\":35452,\"start\":35246},{\"end\":35528,\"start\":35466},{\"end\":35656,\"start\":35542},{\"end\":35766,\"start\":35669},{\"end\":35839,\"start\":35779},{\"end\":36486,\"start\":35895},{\"end\":36563,\"start\":36499}]", "figure_ref": "[{\"attributes\":{\"ref_id\":\"fig_1\"},\"end\":7002,\"start\":6994},{\"attributes\":{\"ref_id\":\"fig_3\"},\"end\":12949,\"start\":12941},{\"attributes\":{\"ref_id\":\"fig_4\"},\"end\":24977,\"start\":24969},{\"attributes\":{\"ref_id\":\"fig_5\"},\"end\":32455,\"start\":32447}]", "bib_author_first_name": "[{\"end\":37896,\"start\":37895},{\"end\":37905,\"start\":37904},{\"end\":37916,\"start\":37915},{\"end\":37926,\"start\":37925},{\"end\":37936,\"start\":37935},{\"end\":37944,\"start\":37943},{\"end\":37953,\"start\":37952},{\"end\":37955,\"start\":37954},{\"end\":37966,\"start\":37965},{\"end\":37975,\"start\":37974},{\"end\":37983,\"start\":37982},{\"end\":38395,\"start\":38394},{\"end\":38408,\"start\":38407},{\"end\":38422,\"start\":38421},{\"end\":38432,\"start\":38431},{\"end\":38810,\"start\":38809},{\"end\":38827,\"start\":38826},{\"end\":38839,\"start\":38838},{\"end\":38849,\"start\":38848},{\"end\":38851,\"start\":38850},{\"end\":39312,\"start\":39311},{\"end\":39324,\"start\":39323},{\"end\":39326,\"start\":39325},{\"end\":39336,\"start\":39335},{\"end\":39597,\"start\":39596},{\"end\":39609,\"start\":39608},{\"end\":39894,\"start\":39893},{\"end\":39907,\"start\":39906},{\"end\":39917,\"start\":39916},{\"end\":39928,\"start\":39927},{\"end\":40211,\"start\":40210},{\"end\":40222,\"start\":40221},{\"end\":40235,\"start\":40234},{\"end\":40249,\"start\":40248},{\"end\":40261,\"start\":40260},{\"end\":40276,\"start\":40275},{\"end\":40286,\"start\":40285},{\"end\":40792,\"start\":40791},{\"end\":40806,\"start\":40805},{\"end\":40808,\"start\":40807},{\"end\":40818,\"start\":40817},{\"end\":40830,\"start\":40829},{\"end\":40832,\"start\":40831},{\"end\":40844,\"start\":40843},{\"end\":40852,\"start\":40851},{\"end\":41193,\"start\":41192},{\"end\":41210,\"start\":41209},{\"end\":41218,\"start\":41217},{\"end\":41553,\"start\":41552},{\"end\":41564,\"start\":41563},{\"end\":41573,\"start\":41572},{\"end\":41712,\"start\":41711},{\"end\":41718,\"start\":41717},{\"end\":41727,\"start\":41726},{\"end\":41734,\"start\":41733},{\"end\":42076,\"start\":42075},{\"end\":42085,\"start\":42084},{\"end\":42348,\"start\":42347},{\"end\":42354,\"start\":42353},{\"end\":42360,\"start\":42359},{\"end\":42368,\"start\":42367},{\"end\":42693,\"start\":42692},{\"end\":42705,\"start\":42704},{\"end\":42717,\"start\":42716},{\"end\":42727,\"start\":42726},{\"end\":42736,\"start\":42735},{\"end\":42750,\"start\":42749},{\"end\":43218,\"start\":43217},{\"end\":43228,\"start\":43227},{\"end\":43238,\"start\":43237},{\"end\":43249,\"start\":43248},{\"end\":43259,\"start\":43258},{\"end\":43640,\"start\":43639},{\"end\":43650,\"start\":43649},{\"end\":43663,\"start\":43662},{\"end\":43673,\"start\":43672},{\"end\":44044,\"start\":44043},{\"end\":44046,\"start\":44045},{\"end\":44057,\"start\":44056},{\"end\":44065,\"start\":44064},{\"end\":44308,\"start\":44307},{\"end\":44323,\"start\":44322},{\"end\":44331,\"start\":44330},{\"end\":44337,\"start\":44336},{\"end\":44347,\"start\":44346},{\"end\":44359,\"start\":44358},{\"end\":44365,\"start\":44364},{\"end\":44374,\"start\":44373},{\"end\":44386,\"start\":44385},{\"end\":44396,\"start\":44395},{\"end\":44409,\"start\":44408},{\"end\":44417,\"start\":44416},{\"end\":44741,\"start\":44740},{\"end\":44753,\"start\":44752},{\"end\":45063,\"start\":45062},{\"end\":45073,\"start\":45072},{\"end\":45075,\"start\":45074},{\"end\":45084,\"start\":45083},{\"end\":45321,\"start\":45320},{\"end\":45323,\"start\":45322},{\"end\":45333,\"start\":45332},{\"end\":45343,\"start\":45342},{\"end\":45352,\"start\":45351},{\"end\":45624,\"start\":45623},{\"end\":45636,\"start\":45635},{\"end\":45638,\"start\":45637},{\"end\":45955,\"start\":45954},{\"end\":45963,\"start\":45962},{\"end\":45974,\"start\":45973},{\"end\":45984,\"start\":45983},{\"end\":45997,\"start\":45996},{\"end\":46343,\"start\":46342},{\"end\":46351,\"start\":46350},{\"end\":46559,\"start\":46558},{\"end\":46567,\"start\":46566},{\"end\":46578,\"start\":46577},{\"end\":47445,\"start\":47444},{\"end\":47456,\"start\":47455},{\"end\":47462,\"start\":47461},{\"end\":47476,\"start\":47475},{\"end\":47496,\"start\":47495},{\"end\":47507,\"start\":47506}]", "bib_author_last_name": "[{\"end\":37902,\"start\":37897},{\"end\":37913,\"start\":37906},{\"end\":37923,\"start\":37917},{\"end\":37933,\"start\":37927},{\"end\":37941,\"start\":37937},{\"end\":37950,\"start\":37945},{\"end\":37963,\"start\":37956},{\"end\":37972,\"start\":37967},{\"end\":37980,\"start\":37976},{\"end\":37989,\"start\":37984},{\"end\":38405,\"start\":38396},{\"end\":38419,\"start\":38409},{\"end\":38429,\"start\":38423},{\"end\":38440,\"start\":38433},{\"end\":38824,\"start\":38811},{\"end\":38836,\"start\":38828},{\"end\":38846,\"start\":38840},{\"end\":38859,\"start\":38852},{\"end\":39321,\"start\":39313},{\"end\":39333,\"start\":39327},{\"end\":39346,\"start\":39337},{\"end\":39606,\"start\":39598},{\"end\":39619,\"start\":39610},{\"end\":39904,\"start\":39895},{\"end\":39914,\"start\":39908},{\"end\":39925,\"start\":39918},{\"end\":39938,\"start\":39929},{\"end\":40219,\"start\":40212},{\"end\":40232,\"start\":40223},{\"end\":40246,\"start\":40236},{\"end\":40258,\"start\":40250},{\"end\":40273,\"start\":40262},{\"end\":40283,\"start\":40277},{\"end\":40294,\"start\":40287},{\"end\":40803,\"start\":40793},{\"end\":40815,\"start\":40809},{\"end\":40827,\"start\":40819},{\"end\":40841,\"start\":40833},{\"end\":40849,\"start\":40845},{\"end\":40862,\"start\":40853},{\"end\":41207,\"start\":41194},{\"end\":41215,\"start\":41211},{\"end\":41228,\"start\":41219},{\"end\":41561,\"start\":41554},{\"end\":41570,\"start\":41565},{\"end\":41580,\"start\":41574},{\"end\":41715,\"start\":41713},{\"end\":41724,\"start\":41719},{\"end\":41731,\"start\":41728},{\"end\":41738,\"start\":41735},{\"end\":42082,\"start\":42077},{\"end\":42093,\"start\":42086},{\"end\":42351,\"start\":42349},{\"end\":42357,\"start\":42355},{\"end\":42365,\"start\":42361},{\"end\":42371,\"start\":42369},{\"end\":42702,\"start\":42694},{\"end\":42714,\"start\":42706},{\"end\":42724,\"start\":42718},{\"end\":42733,\"start\":42728},{\"end\":42747,\"start\":42737},{\"end\":42758,\"start\":42751},{\"end\":43225,\"start\":43219},{\"end\":43235,\"start\":43229},{\"end\":43246,\"start\":43239},{\"end\":43256,\"start\":43250},{\"end\":43265,\"start\":43260},{\"end\":43647,\"start\":43641},{\"end\":43660,\"start\":43651},{\"end\":43670,\"start\":43664},{\"end\":43683,\"start\":43674},{\"end\":44054,\"start\":44047},{\"end\":44062,\"start\":44058},{\"end\":44073,\"start\":44066},{\"end\":44320,\"start\":44309},{\"end\":44328,\"start\":44324},{\"end\":44334,\"start\":44332},{\"end\":44344,\"start\":44338},{\"end\":44356,\"start\":44348},{\"end\":44362,\"start\":44360},{\"end\":44371,\"start\":44366},{\"end\":44383,\"start\":44375},{\"end\":44393,\"start\":44387},{\"end\":44406,\"start\":44397},{\"end\":44414,\"start\":44410},{\"end\":44420,\"start\":44418},{\"end\":44750,\"start\":44742},{\"end\":44763,\"start\":44754},{\"end\":45070,\"start\":45064},{\"end\":45081,\"start\":45076},{\"end\":45089,\"start\":45085},{\"end\":45330,\"start\":45324},{\"end\":45340,\"start\":45334},{\"end\":45349,\"start\":45344},{\"end\":45360,\"start\":45353},{\"end\":45633,\"start\":45625},{\"end\":45644,\"start\":45639},{\"end\":45960,\"start\":45956},{\"end\":45971,\"start\":45964},{\"end\":45981,\"start\":45975},{\"end\":45994,\"start\":45985},{\"end\":46004,\"start\":45998},{\"end\":46348,\"start\":46344},{\"end\":46358,\"start\":46352},{\"end\":46564,\"start\":46560},{\"end\":46575,\"start\":46568},{\"end\":46584,\"start\":46579},{\"end\":47453,\"start\":47446},{\"end\":47459,\"start\":47457},{\"end\":47473,\"start\":47463},{\"end\":47493,\"start\":47477},{\"end\":47504,\"start\":47497},{\"end\":47513,\"start\":47508},{\"end\":47523,\"start\":47515}]", "bib_entry": "[{\"attributes\":{\"doi\":\"arXiv:1603.04467\",\"id\":\"b0\"},\"end\":38321,\"start\":37895},{\"attributes\":{\"id\":\"b1\",\"matched_paper_id\":206592419},\"end\":38730,\"start\":38323},{\"attributes\":{\"id\":\"b2\",\"matched_paper_id\":1710722},\"end\":39229,\"start\":38732},{\"attributes\":{\"id\":\"b3\",\"matched_paper_id\":23163324},\"end\":39526,\"start\":39231},{\"attributes\":{\"id\":\"b4\",\"matched_paper_id\":206596127},\"end\":39891,\"start\":39528},{\"attributes\":{\"doi\":\"arXiv:1603.09025\",\"id\":\"b5\"},\"end\":40125,\"start\":39893},{\"attributes\":{\"id\":\"b6\",\"matched_paper_id\":5736847},\"end\":40728,\"start\":40127},{\"attributes\":{\"id\":\"b7\",\"matched_paper_id\":207252270},\"end\":41120,\"start\":40730},{\"attributes\":{\"id\":\"b8\",\"matched_paper_id\":12289712},\"end\":41513,\"start\":41122},{\"attributes\":{\"id\":\"b9\"},\"end\":41663,\"start\":41515},{\"attributes\":{\"id\":\"b10\",\"matched_paper_id\":206594692},\"end\":41979,\"start\":41665},{\"attributes\":{\"doi\":\"arXiv:1502.03167\",\"id\":\"b11\"},\"end\":42282,\"start\":41981},{\"attributes\":{\"id\":\"b12\",\"matched_paper_id\":1923924},\"end\":42621,\"start\":42284},{\"attributes\":{\"id\":\"b13\",\"matched_paper_id\":206592218},\"end\":43156,\"start\":42623},{\"attributes\":{\"id\":\"b14\",\"matched_paper_id\":206769852},\"end\":43591,\"start\":43158},{\"attributes\":{\"id\":\"b15\",\"matched_paper_id\":12365014},\"end\":43962,\"start\":43593},{\"attributes\":{\"id\":\"b16\",\"matched_paper_id\":40046466},\"end\":44303,\"start\":43964},{\"attributes\":{\"id\":\"b17\"},\"end\":44670,\"start\":44305},{\"attributes\":{\"id\":\"b18\",\"matched_paper_id\":11797475},\"end\":44988,\"start\":44672},{\"attributes\":{\"doi\":\"arXiv:1212.0402\",\"id\":\"b19\"},\"end\":45266,\"start\":44990},{\"attributes\":{\"id\":\"b20\",\"matched_paper_id\":16347832},\"end\":45590,\"start\":45268},{\"attributes\":{\"id\":\"b21\",\"matched_paper_id\":2777306},\"end\":45887,\"start\":45592},{\"attributes\":{\"id\":\"b22\",\"matched_paper_id\":1122604},\"end\":46293,\"start\":45889},{\"attributes\":{\"id\":\"b23\",\"matched_paper_id\":753512},\"end\":46530,\"start\":46295},{\"attributes\":{\"id\":\"b24\"},\"end\":46668,\"start\":46532},{\"attributes\":{\"id\":\"b25\"},\"end\":49050,\"start\":46670}]", "bib_title": "[{\"end\":38392,\"start\":38323},{\"end\":38807,\"start\":38732},{\"end\":39309,\"start\":39231},{\"end\":39594,\"start\":39528},{\"end\":40208,\"start\":40127},{\"end\":40789,\"start\":40730},{\"end\":41190,\"start\":41122},{\"end\":41709,\"start\":41665},{\"end\":42345,\"start\":42284},{\"end\":42690,\"start\":42623},{\"end\":43215,\"start\":43158},{\"end\":43637,\"start\":43593},{\"end\":44041,\"start\":43964},{\"end\":44738,\"start\":44672},{\"end\":45318,\"start\":45268},{\"end\":45621,\"start\":45592},{\"end\":45952,\"start\":45889},{\"end\":46340,\"start\":46295},{\"end\":46556,\"start\":46532},{\"end\":47442,\"start\":46670}]", "bib_author": "[{\"end\":37904,\"start\":37895},{\"end\":37915,\"start\":37904},{\"end\":37925,\"start\":37915},{\"end\":37935,\"start\":37925},{\"end\":37943,\"start\":37935},{\"end\":37952,\"start\":37943},{\"end\":37965,\"start\":37952},{\"end\":37974,\"start\":37965},{\"end\":37982,\"start\":37974},{\"end\":37991,\"start\":37982},{\"end\":38407,\"start\":38394},{\"end\":38421,\"start\":38407},{\"end\":38431,\"start\":38421},{\"end\":38442,\"start\":38431},{\"end\":38826,\"start\":38809},{\"end\":38838,\"start\":38826},{\"end\":38848,\"start\":38838},{\"end\":38861,\"start\":38848},{\"end\":39323,\"start\":39311},{\"end\":39335,\"start\":39323},{\"end\":39348,\"start\":39335},{\"end\":39608,\"start\":39596},{\"end\":39621,\"start\":39608},{\"end\":39906,\"start\":39893},{\"end\":39916,\"start\":39906},{\"end\":39927,\"start\":39916},{\"end\":39940,\"start\":39927},{\"end\":40221,\"start\":40210},{\"end\":40234,\"start\":40221},{\"end\":40248,\"start\":40234},{\"end\":40260,\"start\":40248},{\"end\":40275,\"start\":40260},{\"end\":40285,\"start\":40275},{\"end\":40296,\"start\":40285},{\"end\":40805,\"start\":40791},{\"end\":40817,\"start\":40805},{\"end\":40829,\"start\":40817},{\"end\":40843,\"start\":40829},{\"end\":40851,\"start\":40843},{\"end\":40864,\"start\":40851},{\"end\":41209,\"start\":41192},{\"end\":41217,\"start\":41209},{\"end\":41230,\"start\":41217},{\"end\":41563,\"start\":41552},{\"end\":41572,\"start\":41563},{\"end\":41582,\"start\":41572},{\"end\":41717,\"start\":41711},{\"end\":41726,\"start\":41717},{\"end\":41733,\"start\":41726},{\"end\":41740,\"start\":41733},{\"end\":42084,\"start\":42075},{\"end\":42095,\"start\":42084},{\"end\":42353,\"start\":42347},{\"end\":42359,\"start\":42353},{\"end\":42367,\"start\":42359},{\"end\":42373,\"start\":42367},{\"end\":42704,\"start\":42692},{\"end\":42716,\"start\":42704},{\"end\":42726,\"start\":42716},{\"end\":42735,\"start\":42726},{\"end\":42749,\"start\":42735},{\"end\":42760,\"start\":42749},{\"end\":43227,\"start\":43217},{\"end\":43237,\"start\":43227},{\"end\":43248,\"start\":43237},{\"end\":43258,\"start\":43248},{\"end\":43267,\"start\":43258},{\"end\":43649,\"start\":43639},{\"end\":43662,\"start\":43649},{\"end\":43672,\"start\":43662},{\"end\":43685,\"start\":43672},{\"end\":44056,\"start\":44043},{\"end\":44064,\"start\":44056},{\"end\":44075,\"start\":44064},{\"end\":44322,\"start\":44307},{\"end\":44330,\"start\":44322},{\"end\":44336,\"start\":44330},{\"end\":44346,\"start\":44336},{\"end\":44358,\"start\":44346},{\"end\":44364,\"start\":44358},{\"end\":44373,\"start\":44364},{\"end\":44385,\"start\":44373},{\"end\":44395,\"start\":44385},{\"end\":44408,\"start\":44395},{\"end\":44416,\"start\":44408},{\"end\":44422,\"start\":44416},{\"end\":44752,\"start\":44740},{\"end\":44765,\"start\":44752},{\"end\":45072,\"start\":45062},{\"end\":45083,\"start\":45072},{\"end\":45091,\"start\":45083},{\"end\":45332,\"start\":45320},{\"end\":45342,\"start\":45332},{\"end\":45351,\"start\":45342},{\"end\":45362,\"start\":45351},{\"end\":45635,\"start\":45623},{\"end\":45646,\"start\":45635},{\"end\":45962,\"start\":45954},{\"end\":45973,\"start\":45962},{\"end\":45983,\"start\":45973},{\"end\":45996,\"start\":45983},{\"end\":46006,\"start\":45996},{\"end\":46350,\"start\":46342},{\"end\":46360,\"start\":46350},{\"end\":46566,\"start\":46558},{\"end\":46577,\"start\":46566},{\"end\":46586,\"start\":46577},{\"end\":47455,\"start\":47444},{\"end\":47461,\"start\":47455},{\"end\":47475,\"start\":47461},{\"end\":47495,\"start\":47475},{\"end\":47506,\"start\":47495},{\"end\":47515,\"start\":47506},{\"end\":47525,\"start\":47515}]", "bib_venue": "[{\"end\":39002,\"start\":38940},{\"end\":40437,\"start\":40375},{\"end\":42901,\"start\":42839},{\"end\":43392,\"start\":43338},{\"end\":47666,\"start\":47604},{\"end\":38072,\"start\":38007},{\"end\":38510,\"start\":38442},{\"end\":38938,\"start\":38861},{\"end\":39355,\"start\":39348},{\"end\":39698,\"start\":39621},{\"end\":39985,\"start\":39956},{\"end\":40373,\"start\":40296},{\"end\":40904,\"start\":40864},{\"end\":41307,\"start\":41230},{\"end\":41550,\"start\":41515},{\"end\":41811,\"start\":41740},{\"end\":42073,\"start\":41981},{\"end\":42435,\"start\":42373},{\"end\":42837,\"start\":42760},{\"end\":43336,\"start\":43267},{\"end\":43724,\"start\":43685},{\"end\":44115,\"start\":44075},{\"end\":44814,\"start\":44765},{\"end\":45060,\"start\":44990},{\"end\":45400,\"start\":45362},{\"end\":45717,\"start\":45646},{\"end\":46066,\"start\":46006},{\"end\":46403,\"start\":46360},{\"end\":46590,\"start\":46586},{\"end\":47602,\"start\":47525}]"}}}, "year": 2023, "month": 12, "day": 17}