{"id": 2871880, "updated": "2023-09-28 09:48:09.411", "metadata": {"title": "Domain-Adversarial Training of Neural Networks", "authors": "[{\"first\":\"Yaroslav\",\"last\":\"Ganin\",\"middle\":[]},{\"first\":\"Evgeniya\",\"last\":\"Ustinova\",\"middle\":[]},{\"first\":\"Hana\",\"last\":\"Ajakan\",\"middle\":[]},{\"first\":\"Pascal\",\"last\":\"Germain\",\"middle\":[]},{\"first\":\"Hugo\",\"last\":\"Larochelle\",\"middle\":[]},{\"first\":\"François\",\"last\":\"Laviolette\",\"middle\":[]},{\"first\":\"Mario\",\"last\":\"Marchand\",\"middle\":[]},{\"first\":\"Victor\",\"last\":\"Lempitsky\",\"middle\":[\"S.\"]}]", "venue": "J. Mach. Learn. Res.", "journal": "J. Mach. Learn. Res.", "publication_date": {"year": 2016, "month": null, "day": null}, "abstract": "We introduce a new representation learning approach for domain adaptation, in which data at training and test time come from similar but diﬀerent distributions. Our approach is directly inspired by the theory on domain adaptation suggesting that, for eﬀective domain transfer to be achieved, predictions must be made based on features that cannot discriminate between the training (source) and test (target) domains. The approach implements this idea in the context of neural network architectures that are trained on labeled data from the source domain and unlabeled data from the target domain (no labeled target-domain data is necessary). As the training progresses, the approach promotes the emergence of features that are (i) discriminative for the main learning task on the source domain and (ii) indiscriminate with respect to the shift between the domains. We show that this adaptation behaviour can be achieved in almost any feed-forward model by augmenting it with few standard layers and a new gradient reversal layer. The resulting augmented architecture can be trained using standard backpropagation and stochastic gradient descent, and can thus be implemented with little eﬀort using any of the deep learning packages. We demonstrate the success of our approach for two distinct classiﬁcation problems (document sentiment analysis and image classiﬁcation), where state-of-the-art domain adaptation performance on standard benchmarks is achieved. We also validate the approach for descriptor learning task in the context of person re-identiﬁcation application.", "fields_of_study": "[\"Computer Science\"]", "external_ids": {"arxiv": "1505.07818", "mag": "2950420147", "acl": null, "pubmed": null, "pubmedcentral": null, "dblp": "journals/corr/GaninUAGLLML15", "doi": "10.1007/978-3-319-58347-1_10"}}, "content": {"source": {"pdf_hash": "fd0229ad46b8849624835c118a1f3a3ae53977df", "pdf_src": "Arxiv", "pdf_uri": null, "oa_url_match": false, "oa_info": {"license": null, "open_access_url": "http://arxiv.org/pdf/1505.07818", "status": "GREEN"}}, "grobid": {"id": "b8b025dcdf142e1ead86a8d2e9e36ce2b225d01e", "type": "plain-text", "url": "s3://ai2-s2-pdf-extraction-prod/parse-results/s2orc_worker/fd0229ad46b8849624835c118a1f3a3ae53977df.txt", "contents": "\nDomain-Adversarial Training of Neural Networks\n2016\n\nYaroslav Ganin ganin@skoltech.ru \nHana Ajakan hana.ajakan.1@ulaval.ca \nPascal Germain pascal.germain@ift.ulaval.ca \nHugo Larochelle hugo.larochelle@usherbrooke.ca \nFrançois Laviolette francois.laviolette@ift.ulaval.ca \nMario Marchand mario.marchand@ift.ulaval.ca \nVictor Lempitsky lempitsky@skoltech.ru \nUrun Dogan \nMarius Kloft \nFrancesco Orabona \nTatiana Tommasi \nYaroslav Ganin \nEvgeniya Ustinova evgeniya.ustinova@skoltech.ru \nHana Ajakan \nPascal Germain \nHugo Larochelle \nGanin \nUstinova \nAjakan \nLarochelle, Laviolette, MarchandLempitsky Germain \n\nEvgeniya Ustinova\nSkolkovo Institute of Science and Technology (Skoltech) Skolkovo, Moscow Region\nDépartement d'informatique\nDépartement d'informatique et de génie logiciel\nUniversité Laval Québec\nG1V 0A6Russia, Canada\n\n\nDépartement d'informatique et de génie logiciel\nUniversité de Sherbrooke Québec\nJ1K 2R1Canada\n\n\nUniversité Laval Québec\nG1V 0A6Canada\n\nDomain-Adversarial Training of Neural Networks\n\nJournal of Machine Learning Research\n172016Submitted 5/15; Published 4/16Skolkovo Institute of Science and Technology (Skoltech) Skolkovo, Moscow Region, Russia Editor:domain adaptationneural networkrepresentation learningdeep learningsynthetic dataimage classificationsentiment analysisperson re-identification\nWe introduce a new representation learning approach for domain adaptation, in which data at training and test time come from similar but different distributions. Our approach is directly inspired by the theory on domain adaptation suggesting that, for effective domain transfer to be achieved, predictions must be made based on features that cannot discriminate between the training (source) and test (target) domains.The approach implements this idea in the context of neural network architectures that are trained on labeled data from the source domain and unlabeled data from the target domain (no labeled target-domain data is necessary). As the training progresses, the approach promotes the emergence of features that are (i) discriminative for the main learning task on the source domain and (ii) indiscriminate with respect to the shift between the domains. We show that this adaptation behaviour can be achieved in almost any feed-forward model by augmenting it with few standard layers and a new gradient reversal layer. The resulting augmented architecture can be trained using standard backpropagation and stochastic gradient descent, and can thus be implemented with little effort using any of the deep learning packages.We demonstrate the success of our approach for two distinct classification problems (document sentiment analysis and image classification), where state-of-the-art domain adaptation performance on standard benchmarks is achieved. We also validate the approach for descriptor learning task in the context of person re-identification application.\n\nIntroduction\n\nThe cost of generating labeled data for a new machine learning task is often an obstacle for applying machine learning methods. In particular, this is a limiting factor for the further progress of deep neural network architectures, that have already brought impressive advances to the state-of-the-art across a wide variety of machine-learning tasks and applications. For problems lacking labeled data, it may be still possible to obtain training sets that are big enough for training large-scale deep models, but that suffer from the shift in data distribution from the actual data encountered at \"test time\". One important example is training an image classifier on synthetic or semi-synthetic images, which may come in abundance and be fully labeled, but which inevitably have a distribution that is different from real images (Liebelt and Schmid, 2010;Stark et al., 2010;Vázquez et al., 2014;Sun and Saenko, 2014). Another example is in the context of sentiment analysis in written reviews, where one might have labeled data for reviews of one type of product (e.g., movies), while having the need to classify reviews of other products (e.g., books).\n\nLearning a discriminative classifier or other predictor in the presence of a shift between training and test distributions is known as domain adaptation (DA). The proposed approaches build mappings between the source (training-time) and the target (test-time) domains, so that the classifier learned for the source domain can also be applied to the target domain, when composed with the learned mapping between domains. The appeal of the domain adaptation approaches is the ability to learn a mapping between domains in the situation when the target domain data are either fully unlabeled (unsupervised domain annotation) or have few labeled samples (semi-supervised domain adaptation). Below, we focus on the harder unsupervised case, although the proposed approach (domain-adversarial learning) can be generalized to the semi-supervised case rather straightforwardly.\n\nUnlike many previous papers on domain adaptation that worked with fixed feature representations, we focus on combining domain adaptation and deep feature learning within one training process. Our goal is to embed domain adaptation into the process of learning representation, so that the final classification decisions are made based on features that are both discriminative and invariant to the change of domains, i.e., have the same or very similar distributions in the source and the target domains. In this way, the obtained feed-forward network can be applicable to the target domain without being hindered by the shift between the two domains. Our approach is motivated by the theory on domain adaptation (Ben-David et al., 2006, that suggests that a good representation for cross-domain transfer is one for which an algorithm cannot learn to identify the domain of origin of the input observation.\n\nWe thus focus on learning features that combine (i) discriminativeness and (ii) domaininvariance. This is achieved by jointly optimizing the underlying features as well as two discriminative classifiers operating on these features: (i) the label predictor that predicts class labels and is used both during training and at test time and (ii) the domain classifier that discriminates between the source and the target domains during training. While the parameters of the classifiers are optimized in order to minimize their error on the training set, the parameters of the underlying deep feature mapping are optimized in order to minimize the loss of the label classifier and to maximize the loss of the domain classifier. The latter update thus works adversarially to the domain classifier, and it encourages domain-invariant features to emerge in the course of the optimization.\n\nCrucially, we show that all three training processes can be embedded into an appropriately composed deep feed-forward network, called domain-adversarial neural network (DANN) (illustrated by Figure 1, page 12) that uses standard layers and loss functions, and can be trained using standard backpropagation algorithms based on stochastic gradient descent or its modifications (e.g., SGD with momentum). The approach is generic as a DANN version can be created for almost any existing feed-forward architecture that is trainable by backpropagation. In practice, the only non-standard component of the proposed architecture is a rather trivial gradient reversal layer that leaves the input unchanged during forward propagation and reverses the gradient by multiplying it by a negative scalar during the backpropagation.\n\nWe provide an experimental evaluation of the proposed domain-adversarial learning idea over a range of deep architectures and applications. We first consider the simplest DANN architecture where the three parts (label predictor, domain classifier and feature extractor) are linear, and demonstrate the success of domain-adversarial learning for such architecture. The evaluation is performed for synthetic data as well as for the sentiment analysis problem in natural language processing, where DANN improves the state-of-the-art marginalized Stacked Autoencoders (mSDA) of Chen et al. (2012) on the common Amazon reviews benchmark.\n\nWe further evaluate the approach extensively for an image classification task, and present results on traditional deep learning image data sets-such as MNIST (LeCun et al., 1998) and SVHN (Netzer et al., 2011)-as well as on Office benchmarks (Saenko et al., 2010), where domain-adversarial learning allows obtaining a deep architecture that considerably improves over previous state-of-the-art accuracy.\n\nFinally, we evaluate domain-adversarial descriptor learning in the context of person re-identification application (Gong et al., 2014), where the task is to obtain good pedestrian image descriptors that are suitable for retrieval and verification. We apply domainadversarial learning, as we consider a descriptor predictor trained with a Siamese-like loss instead of the label predictor trained with a classification loss. In a series of experiments, we demonstrate that domain-adversarial learning can improve cross-data-set re-identification considerably.\n\n\nRelated work\n\nThe general approach of achieving domain adaptation explored under many facets. Over the years, a large part of the literature has focused mainly on linear hypothesis (see for instance Bruzzone and Marconcini, 2010;Germain et al., 2013;Baktashmotlagh et al., 2013;Cortes and Mohri, 2014). More recently, non-linear representations have become increasingly studied, including neural network representations (Glorot et al., 2011; and most notably the state-of-the-art mSDA (Chen et al., 2012). That literature has mostly focused on exploiting the principle of robust representations, based on the denoising autoencoder paradigm (Vincent et al., 2008).\n\nConcurrently, multiple methods of matching the feature distributions in the source and the target domains have been proposed for unsupervised domain adaptation. Some ap-proaches perform this by reweighing or selecting samples from the source domain Huang et al., 2006;, while others seek an explicit feature space transformation that would map source distribution into the target one (Pan et al., 2011;Gopalan et al., 2011;Baktashmotlagh et al., 2013). An important aspect of the distribution matching approach is the way the (dis)similarity between distributions is measured. Here, one popular choice is matching the distribution means in the kernelreproducing Hilbert space Huang et al., 2006), whereas Gong et al. (2012) and Fernando et al. (2013) map the principal axes associated with each of the distributions.\n\nOur approach also attempts to match feature space distributions, however this is accomplished by modifying the feature representation itself rather than by reweighing or geometric transformation. Also, our method uses a rather different way to measure the disparity between distributions based on their separability by a deep discriminatively-trained classifier. Note also that several approaches perform transition from the source to the target domain (Gopalan et al., 2011;Gong et al., 2012) by changing gradually the training distribution. Among these methods, Chopra et al. (2013) does this in a \"deep\" way by the layerwise training of a sequence of deep autoencoders, while gradually replacing source-domain samples with target-domain samples. This improves over a similar approach of Glorot et al. (2011) that simply trains a single deep autoencoder for both domains. In both approaches, the actual classifier/predictor is learned in a separate step using the feature representation learned by autoencoder(s). In contrast to Glorot et al. (2011);Chopra et al. (2013), our approach performs feature learning, domain adaptation and classifier learning jointly, in a unified architecture, and using a single learning algorithm (backpropagation). We therefore argue that our approach is simpler (both conceptually and in terms of its implementation). Our method also achieves considerably better results on the popular Office benchmark.\n\nWhile the above approaches perform unsupervised domain adaptation, there are approaches that perform supervised domain adaptation by exploiting labeled data from the target domain. In the context of deep feed-forward architectures, such data can be used to \"fine-tune\" the network trained on the source domain (Zeiler and Fergus, 2013;Oquab et al., 2014;Babenko et al., 2014). Our approach does not require labeled target-domain data. At the same time, it can easily incorporate such data when they are available.\n\nAn idea related to ours is described in Goodfellow et al. (2014). While their goal is quite different (building generative deep networks that can synthesize samples), the way they measure and minimize the discrepancy between the distribution of the training data and the distribution of the synthesized data is very similar to the way our architecture measures and minimizes the discrepancy between feature distributions for the two domains. Moreover, the authors mention the problem of saturating sigmoids which may arise at the early stages of training due to the significant dissimilarity of the domains. The technique they use to circumvent this issue (the \"adversarial\" part of the gradient is replaced by a gradient computed with respect to a suitable cost) is directly applicable to our method.\n\nAlso, recent and concurrent reports by ; Long and Wang (2015) focus on domain adaptation in feed-forward networks. Their set of techniques measures and minimizes the distance between the data distribution means across domains (potentially, after embedding distributions into RKHS). Their approach is thus different from our idea of matching distributions by making them indistinguishable for a discriminative classifier.\n\nBelow, we compare our approach to ; Long and Wang (2015) on the Office benchmark. Another approach to deep domain adaptation, which is arguably more different from ours, has been developed in parallel by Chen et al. (2015).\n\nFrom a theoretical standpoint, our approach is directly derived from the seminal theoretical works of Ben-David et al. (2006. Indeed, DANN directly optimizes the notion of H-divergence. We do note the work of Huang and Yates (2012), in which HMM representations are learned for word tagging using a posterior regularizer that is also inspired by Ben-David et al.'s work. In addition to the tasks being different-Huang and Yates (2012) focus on word tagging problems-, we would argue that DANN learning objective more closely optimizes the H-divergence, with Huang and Yates (2012) relying on cruder approximations for efficiency reasons.\n\nA part of this paper has been published as a conference paper (Ganin and Lempitsky, 2015). This version extends Ganin and Lempitsky (2015) very considerably by incorporating the report Ajakan et al. (2014) (presented as part of the Second Workshop on Transfer and Multi-Task Learning), which brings in new terminology, in-depth theoretical analysis and justification of the approach, extensive experiments with the shallow DANN case on synthetic data as well as on a natural language processing task (sentiment analysis). Furthermore, in this version we go beyond classification and evaluate domain-adversarial learning for descriptor learning setting within the person re-identification application.\n\n\nDomain Adaptation\n\nWe consider classification tasks where X is the input space and Y = {0, 1, . . . , L−1} is the set of L possible labels. Moreover, we have two different distributions over X×Y , called the source domain D S and the target domain D T . An unsupervised domain adaptation learning algorithm is then provided with a labeled source sample S drawn i.i.d. from D S , and an unlabeled target sample\nT drawn i.i.d. from D X T , where D X T is the marginal distribution of D T over X. S = {(x i , y i )} n i=1 ∼ (D S ) n ; T = {x i } N i=n+1 ∼ (D X\nT ) n , with N = n + n being the total number of samples. The goal of the learning algorithm is to build a classifier η : X → Y with a low target risk\nR D T (η) = Pr (x,y)∼D T η(x) = y ,\nwhile having no information about the labels of D T .\n\n\nDomain Divergence\n\nTo tackle the challenging domain adaptation task, many approaches bound the target error by the sum of the source error and a notion of distance between the source and the target distributions. These methods are intuitively justified by a simple assumption: the source risk is expected to be a good indicator of the target risk when both distributions are similar. Several notions of distance have been proposed for domain adaptation (Ben-David et al., 2006Mansour et al., 2009a,b;Germain et al., 2013). In this paper, we focus on the H-divergence used by Ben-David et al. (2006, and based on the earlier work of Kifer et al. (2004). Note that we assume in definition 1 below that the hypothesis class H is a (discrete or continuous) set of binary classifiers η : X → {0, 1}. 1 Definition 1 (Ben-David et al., 2006Kifer et al., 2004) Given two domain distributions D X S and D X T over X, and a hypothesis class H, the H-divergence between D X S and D X T is\nd H (D X S , D X T ) = 2 sup η∈H Pr x∼D X S η(x) = 1 − Pr x∼D X T η(x) = 1 .\nThat is, the H-divergence relies on the capacity of the hypothesis class H to distinguish between examples generated by D X S from examples generated by D X T . Ben-David et al. (2006 proved that, for a symmetric hypothesis class H, one can compute the empirical H-divergence between two samples S ∼ (D X S ) n and T ∼ (D X T ) n by computinĝ\nd H (S, T ) = 2 1 − min η∈H 1 n n i=1 I[η(x i ) = 0] + 1 n N i=n+1 I[η(x i ) = 1] ,(1)\nwhere I[a] is the indicator function which is 1 if predicate a is true, and 0 otherwise.\n\n\nProxy Distance\n\nBen- David et al. (2006) suggested that, even if it is generally hard to computed H (S, T ) exactly (e.g., when H is the space of linear classifiers on X), we can easily approximate it by running a learning algorithm on the problem of discriminating between source and target examples. To do so, we construct a new data set\nU = {(x i , 0)} n i=1 ∪ {(x i , 1)} N i=n+1 ,(2)\nwhere the examples of the source sample are labeled 0 and the examples of the target sample are labeled 1. Then, the risk of the classifier trained on the new data set U approximates the \"min\" part of Equation (1). Given a generalization error on the problem of discriminating between source and target examples, the H-divergence is then approximated bŷ\nd A = 2 (1 − 2 ) .(3)\nIn Ben-David et al. (2006), the valued A is called the\nProxy A-distance (PAD). The A- distance being defined as d A (D X S , D X T ) = 2 sup A∈A Pr D X S (A) − Pr D X T (A) ,\nwhere A is a subset of X. Note that, by choosing A = {A η |η ∈ H}, with A η the set represented by the characteristic function η, the A-distance and the H-divergence of Definition 1 are identical.\n\nIn the experiments section of this paper, we compute the PAD value following the approach of Glorot et al. (2011);Chen et al. (2012), i.e., we train either a linear SVM or a deeper MLP classifier on a subset of U (Equation 2), and we use the obtained classifier error on the other subset as the value of in Equation (3). More details and illustrations of the linear SVM case are provided in Section 5.1.5.\n\n\nGeneralization Bound on the Target Risk\n\nThe work of Ben-David et al. (2006 also showed that the H-divergence d H (D X S , D X T ) is upper bounded by its empirical estimated H (S, T ) plus a constant complexity term that depends on the VC dimension of H and the size of samples S and T . By combining this result with a similar bound on the source risk, the following theorem is obtained.\n\nTheorem 2 (Ben- David et al., 2006) Let H be a hypothesis class of VC dimension d.\n\nWith probability 1 − δ over the choice of samples S ∼ (D S ) n and T ∼ (D X T ) n , for every η ∈ H:\nR D T (η) ≤ R S (η) + 4 n d log 2e n d + log 4 δ +d H (S, T ) + 4 1 n d log 2n d + log 4 δ + β , with β ≥ inf η * ∈H [R D S (η * ) + R D T (η * )] , and R S (η) = 1 n m i=1 I [η(x i ) = y i ]\nis the empirical source risk.\n\nThe previous result tells us that R D T (η) can be low only when the β term is low, i.e., only when there exists a classifier that can achieve a low risk on both distributions. It also tells us that, to find a classifier with a small R D T (η) in a given class of fixed VC dimension, the learning algorithm should minimize (in that class) a trade-off between the source risk R S (η) and the empirical H-divergenced H (S, T ). As pointed-out by Ben-David et al. (2006), a strategy to control the H-divergence is to find a representation of the examples where both the source and the target domain are as indistinguishable as possible. Under such a representation, a hypothesis with a low source risk will, according to Theorem 2, perform well on the target data. In this paper, we present an algorithm that directly exploits this idea.\n\n\nDomain-Adversarial Neural Networks (DANN)\n\nAn original aspect of our approach is to explicitly implement the idea exhibited by Theorem 2 into a neural network classifier. That is, to learn a model that can generalize well from one domain to another, we ensure that the internal representation of the neural network contains no discriminative information about the origin of the input (source or target), while preserving a low risk on the source (labeled) examples.\n\nIn this section, we detail the proposed approach for incorporating a \"domain adaptation component\" to neural networks. In Subsection 4.1, we start by developing the idea for the simplest possible case, i.e., a single hidden layer, fully connected neural network. We then describe how to generalize the approach to arbitrary (deep) network architectures.\n\n\nExample Case with a Shallow Neural Network\n\nLet us first consider a standard neural network (NN) architecture with a single hidden layer. For simplicity, we suppose that the input space is formed by m-dimensional real vectors. Thus, X = R m . The hidden layer G f learns a function G f : X → R D that maps an example into a new D-dimensional representation 2 , and is parameterized by a matrix-vector pair (W, b) ∈ R D×m × R D :\nG f (x; W, b) = sigm Wx + b ,(4)\nwith sigm(a) =\n1 1+exp(−a i ) |a| i=1 .\nSimilarly, the prediction layer G y learns a function G y : R D → [0, 1] L that is parameterized by a pair (V, c) ∈ R L×D × R L :\nG y (G f (x); V, c) = softmax VG f (x) + c , with softmax(a) = exp(a i ) |a| j=1 exp(a j ) |a| i=1 .\nHere we have L = |Y |. By using the softmax function, each component of vector G y (G f (x)) denotes the conditional probability that the neural network assigns x to the class in Y represented by that component. Given a source example (x i , y i ), the natural classification loss to use is the negative log-probability of the correct label:\nL y G y (G f (x i )), y i = log 1 G y (G f (x)) y i .\nTraining the neural network then leads to the following optimization problem on the source domain:\nmin W,b,V,c 1 n n i=1 L i y (W, b, V, c) + λ · R(W, b) ,(5)\nwhere L i y (W, b, V, c) = L y G y (G f (x i ; W, b); V, c), y i is a shorthand notation for the prediction loss on the i-th example, and R(W, b) is an optional regularizer that is weighted by hyper-parameter λ.\n\nThe heart of our approach is to design a domain regularizer directly derived from the H-divergence of Definition 1. To this end, we view the output of the hidden layer G f (·) (Equation 4) as the internal representation of the neural network. Thus, we denote the source sample representations as\nS(G f ) = G f (x) x ∈ S .\nSimilarly, given an unlabeled sample from the target domain we denote the corresponding representations\n\nT\n(G f ) = G f (x) x ∈ T .\nBased on Equation (1), the empirical H-divergence of a symmetric hypothesis class H between samples S(G f ) and T (G f ) is given bŷ\nd H S(G f ), T (G f ) = 2 1−min η∈H 1 n n i=1 I η(G f (x i ))=0 + 1 n N i=n+1 I η(G f (x i ))=1 .(6)\nLet us consider H as the class of hyperplanes in the representation space. Inspired by the Proxy A-distance (see Section 3.2), we suggest estimating the \"min\" part of Equation (6) by a domain classification layer G d that learns a logistic regressor G d : R D → [0, 1], parameterized by a vector-scalar pair (u, z) ∈ R D × R, that models the probability that a given input is from the source domain D X S or the target domain D X T . Thus,\nG d (G f (x); u, z) = sigm u G f (x) + z .(7)\nHence, the function G d (·) is a domain regressor. We define its loss by\nL d G d (G f (x i )), d i = d i log 1 G d (G f (x i )) + (1−d i ) log 1 1−G d (G f (x i )) ,\nwhere d i denotes the binary variable (domain label) for the i-th example, which indicates whether x i come from the source distribution (\nx i ∼D X S if d i =0) or from the target distribu- tion (x i ∼D X T if d i =1).\nRecall that for the examples from the source distribution (d i =0), the corresponding labels y i ∈ Y are known at training time. For the examples from the target domains, we do not know the labels at training time, and we want to predict such labels at test time. This enables us to add a domain adaptation term to the objective of Equation (5), giving the following regularizer:\nR(W, b) = max u,z − 1 n n i=1 L i d (W, b, u, z) − 1 n N i=n+1 L i d (W, b, u, z ,(8)where L i d (W, b, u, z)=L d G d (G f (x i ; W, b); u, z), d i )\n. This regularizer seeks to approximate the H-divergence of Equation (6), as 2(1−R(W, b)) is a surrogate ford H S(G f ), T (G f ) . In line with Theorem 2, the optimization problem given by Equations (5) and (8) implements a trade-off between the minimization of the source risk R S (·) and the divergenced H (·, ·). The hyper-parameter λ is then used to tune the trade-off between these two quantities during the learning process.\n\nFor learning, we first note that we can rewrite the complete optimization objective of Equation (5) as follows:\nE(W, V,b, c, u, z) (9) = 1 n n i=1 L i y (W, b, V, c) − λ 1 n n i=1 L i d (W, b, u, z) + 1 n N i=n+1 L i d (W, b, u, z) ,\nwhere we are seeking the parametersŴ,V,b,ĉ,û,ẑ that deliver a saddle point given by\n(Ŵ,V,b,ĉ) = argmin W,V,b,c E(W, V, b, c,û,ẑ) , (û,ẑ) = argmax u,z E(Ŵ,V,b,ĉ, u, z) .\nThus, the optimization problem involves a minimization with respect to some parameters, as well as a maximization with respect to the others.\n\nAlgorithm 1 Shallow DANN -Stochastic training update 1: Input:\n-samples S = {(xi, yi)} n i=1 and T = {xi} n i=1 , -hidden layer size D, -adaptation parameter λ, -learning rate µ, 2: Output: neural network {W, V, b, c} 3: W, V ← random init( D ) 4: b, c, u, d ← 0 5: while stopping criterion is not met do 6:\nfor i from 1 to n do 7:\n\n# Forward propagation 8:\nG f (xi) ← sigm(b + Wxi) 9: Gy(G f (xi)) ← softmax(c + VG f (xi)) 10: # Backpropagation 11: ∆c ← −(e(yi) − Gy(G f (xi))) 12: ∆ V ← ∆c G f (xi) 13: ∆ b ← V ∆c G f (xi) (1 − G f (xi)) 14: ∆ W ← ∆ b · (xi) 15: # Domain adaptation regularizer... 16: # ...from current domain 17: G d (G f (xi)) ← sigm(d + u G f (xi)) 18: ∆ d ← λ(1 − G d (G f (xi))) 19: ∆u ← λ(1 − G d (G f (xi)))G f (xi) 20: tmp ← λ(1 − G d (G f (xi))) × u G f (xi) (1 − G f (xi)) 21: ∆ b ← ∆ b + tmp 22: ∆ W ← ∆ W + tmp · (xi) 23: # ...from other domain 24: j ← uniform integer(1, . . . , n ) 25: G f (xj) ← sigm(b + Wxj) 26: G d (G f (xj)) ← sigm(d + u G f (xj)) 27: ∆ d ← ∆ d − λG d (G f (xj)) 28: ∆u ← ∆u − λG d (G f (xj))G f (xj) 29: tmp ← −λG d (G f (xj)) × u G f (xj) (1 − G f (xj)) 30: ∆ b ← ∆ b + tmp 31: ∆ W ← ∆ W + tmp · (xj) 32: # Update neural network parameters 33: W ← W − µ∆ W 34: V ← V − µ∆ V 35: b ← b − µ∆ b 36: c ← c − µ∆c 37: # Update domain classifier 38: u ← u + µ∆u 39: d ← d + µ∆ d 40:\nend for 41: end while Note: In this pseudo-code, e(y) refers to a \"one-hot\" vector, consisting of all 0s except for a 1 at position y, and is the element-wise product.\n\nWe propose to tackle this problem with a simple stochastic gradient procedure, in which updates are made in the opposite direction of the gradient of Equation (9) for the minimizing parameters, and in the direction of the gradient for the maximizing parameters. Stochastic estimates of the gradient are made, using a subset of the training samples to compute the averages. Algorithm 1 provides the complete pseudo-code of this learning procedure. 3 In words, during training, the neural network (parameterized by W, b, V, c) and the domain regressor (parameterized by u, z) are competing against each other, in an adversarial way, over the objective of Equation (9). For this reason, we refer to networks trained according to this objective as Domain-Adversarial Neural Networks (DANN). DANN will effectively attempt to learn a hidden layer G f (·) that maps an example (either source or target) into a representation allowing the output layer G y (·) to accurately classify source samples, but crippling the ability of the domain regressor G d (·) to detect whether each example belongs to the source or target domains.\n\n\nGeneralization to Arbitrary Architectures\n\nFor illustration purposes, we've so far focused on the case of a single hidden layer DANN. However, it is straightforward to generalize to other sophisticated architectures, which might be more appropriate for the data at hand. For example, deep convolutional neural networks are well known for being state-of-the-art models for learning discriminative features of images (Krizhevsky et al., 2012).\n\nLet us now use a more general notation for the different components of DANN. Namely, let G f (·; θ f ) be the D-dimensional neural network feature extractor, with parameters θ f . Also, let G y (·; θ y ) be the part of DANN that computes the network's label prediction output layer, with parameters θ y , while G d (·; θ d ) now corresponds to the computation of the domain prediction output of the network, with parameters θ d . Note that for preserving the theoretical guarantees of Theorem 2, the hypothesis class H d generated by the domain prediction component G d should include the hypothesis class H y generated by the label prediction component G y . Thus, H y ⊆ H d .\n\nWe will note the prediction loss and the domain loss respectively by\nL i y (θ f , θ y ) = L y G y (G f (x i ; θ f ); θ y ), y i , L i d (θ f , θ d ) = L d G d (G f (x i ; θ f ); θ d ), d i ) .\nTraining DANN then parallels the single layer case and consists in optimizing\nE(θ f , θ y , θ d ) = 1 n n i=1 L i y (θ f , θ y ) − λ 1 n n i=1 L i d (θ f , θ d ) + 1 n N i=n+1 L i d (θ f , θ d ) ,(10)\nby finding the saddle pointθ f ,θ y ,θ d such that\n(θ f ,θ y ) = argmin θ f ,θy E(θ f , θ y ,θ d ) ,(11)θ d = argmax θ d E(θ f ,θ y , θ d ) .(12)\nAs suggested previously, a saddle point defined by Equations (11-12) can be found as a stationary point of the following gradient updates:\nθ f ←− θ f − µ ∂L i y ∂θ f − λ ∂L i d ∂θ f ,(13)θ y ←− θ y − µ ∂L i y ∂θ y ,(14)θ d ←− θ d − µλ ∂L i d ∂θ d ,(15)\nwhere µ is the learning rate. We use stochastic estimates of these gradients, by sampling examples from the data set. The updates of Equations (13-15) are very similar to stochastic gradient descent (SGD) updates for a feed-forward deep model that comprises feature extractor fed into the label predictor and into the domain classifier (with loss weighted by λ). The only difference is that in (13), the gradients from the class and domain predictors are subtracted, instead of being summed (the difference is important, as otherwise SGD would try to make features dissimilar across domains in order to minimize the domain classification loss). Since SGDand its many variants, such as ADAGRAD (Duchi et al., 2010) or ADADELTA (Zeiler, 2012)-is the main learning algorithm implemented in most libraries for deep learning, it would be convenient to frame an implementation of our stochastic saddle point procedure as SGD. Fortunately, such a reduction can be accomplished by introducing a special gradient reversal layer (GRL), defined as follows. The gradient reversal layer has no parameters associated with it. During the forward propagation, the GRL acts as an identity transformation. During the backpropagation however, the GRL takes the gradient from the subsequent level and changes its sign, i.e., multiplies it by −1, before passing it to the preceding layer. Implementing such a layer using existing object-oriented packages for deep learning is simple, requiring only to define procedures for the forward propagation (identity transformation), and backpropagation (multiplying by −1). The layer requires no parameter update.\n\nThe GRL as defined above is inserted between the feature extractor G f and the domain classifier G d , resulting in the architecture depicted in Figure 1. As the backpropagation process passes through the GRL, the partial derivatives of the loss that is downstream the GRL (i.e., L d ) w.r.t. the layer parameters that are upstream the GRL (i.e., θ f ) get multiplied by −1, i.e., ∂L d ∂θ f is effectively replaced with − ∂L d ∂θ f . Therefore, running SGD in the resulting model implements the updates of Equations (13-15) and converges to a saddle point of Equation (10).\n\nMathematically, we can formally treat the gradient reversal layer as a \"pseudo-function\" R(x) defined by two (incompatible) equations describing its forward and backpropagation behaviour:\nR(x) = x ,(16)dR dx = −I ,(17)\nwhere I is an identity matrix. We can then define the objective \"pseudo-function\" of (θ f , θ y , θ d ) that is being optimized by the stochastic gradient descent within our method:\nE(θ f , θ y , θ d ) = 1 n n i=1 L y G y (G f (x i ; θ f ); θ y ), y i (18) − λ 1 n n i=1 L d G d (R(G f (x i ; θ f )); θ d ), d i + 1 n N i=n+1 L d G d (R(G f (x i ; θ f )); θ d ), d i .\nRunning updates (13-15) can then be implemented as doing SGD for (18) and leads to the emergence of features that are domain-invariant and discriminative at the same time. After the learning, the label predictor G y (G f (x; θ f ); θ y ) can be used to predict labels for samples from the target domain (as well as from the source domain). Note that we release the source code for the Gradient Reversal layer along with the usage examples as an extension to Caffe . 4\n\n\nExperiments\n\nIn this section, we present a variety of empirical results for both shallow domain adversarial neural networks (Subsection 5.1) and deep ones (Subsections 5.2 and 5.3).\n\n\nExperiments with Shallow Neural Networks\n\nIn this first experiment section, we evaluate the behavior of the simple version of DANN described by Subsection 4.1. Note that the results reported in the present subsection are obtained using Algorithm 1. Thus, the stochastic gradient descent approach here consists of sampling a pair of source and target examples and performing a gradient step update of all parameters of DANN. Crucially, while the update of the regular parameters follows as usual the opposite direction of the gradient, for the adversarial parameters the step must follow the gradient's direction (since we maximize with respect to them, instead of minimizing).\n\n\nExperiments on a Toy Problem\n\nAs a first experiment, we study the behavior of the proposed algorithm on a variant of the inter-twinning moons 2D problem, where the target distribution is a rotation of the source We study the adaptation capability of DANN by comparing it to the standard neural network (NN). In these toy experiments, both algorithms share the same network architecture, with a hidden layer size of 15 neurons. We train the NN using the same procedure as the DANN. That is, we keep updating the domain regressor component using target sample T (with a hyper-parameter λ = 6; the same value is used for DANN), but we disable the adversarial back-propagation into the hidden layer. To do so, we execute Algorithm 1 by omitting the lines numbered 22 and 31. This allows recovering the NN learning algorithm-based on the source risk minimization of Equation (5) without any regularizer-and simultaneously train the domain regressor of Equation (7) to discriminate between source and target domains. With this toy experience, we will first illustrate how DANN adapts its decision boundary when compared to NN. Moreover, we will also illustrate how the representation given by the hidden layer is less adapted to the source domain task with DANN than with NN (this is why we need a domain regressor in the NN experiment). We recall that this is the founding idea behind our proposed algorithm. The analysis of the experiment appears in Figure 2, where upper graphs relate to standard NN, and lower graphs relate to DANN. By looking at the lower and upper graphs pairwise, we compare NN and DANN from four different perspectives, described in details below.\n\nThe column \"Label Classification\" of Figure 2 shows the decision boundaries of DANN and NN on the problem of predicting the labels of both source and the target examples. As expected, NN accurately classifies the two classes of the source sample S, but is not fully adapted to the target sample T . On the contrary, the decision boundary of DANN perfectly classifies examples from both source and target samples. In the studied task, DANN clearly adapts to the target distribution.\n\nThe column \"Representation PCA\" studies how the domain adaptation regularizer affects the representation G f (·) provided by the network hidden layer. The graphs are obtained by applying a Principal component analysis (PCA) on the set of all representation of source and target data points, i.e., S(G f ) ∪ T (G f ). Thus, given the trained network (NN or DANN), every point from S and T is mapped into a 15-dimensional feature space through the hidden layer, and projected back into a two-dimensional plane by the PCA transformation. In the DANN-PCA representation, we observe that target points are homogeneously spread out among source points; In the NN-PCA representation, a number of target points belong to clusters containing no source points. Hence, labeling the target points seems an easier task given the DANN-PCA representation.\n\nTo push the analysis further, the PCA graphs tag four crucial data points by the letters A, B, C and D, that correspond to the moon extremities in the original space (note that the original point locations are tagged in the first column graphs). We observe that points A and B are very close to each other in the NN-PCA representation, while they clearly belong to different classes. The same happens to points C and D. Conversely, these four points are at the opposite four corners in the DANN-PCA representation. Note also that the target point A (resp. D)-that is difficult to classify in the original space-is located in the \"+\"cluster (resp. \"− − −\"cluster) in the DANN-PCA representation. Therefore, the representation promoted by DANN is better suited to the adaptation problem.\n\nThe column \"Domain Classification\" shows the decision boundary on the domain classification problem, which is given by the domain regressor G d of Equation (7). More precisely, an example x is classified as a source example when G d (G f (x)) ≥ 0.5, and is classified as a domain example otherwise. Remember that, during the learning process of DANN, the G d regressor struggles to discriminate between source and target domains, while the hidden representation G f (·) is adversarially updated to prevent it to succeed. As explained above, we trained a domain regressor during the learning process of NN, but without allowing it to influence the learned representation G f (·). On one hand, the DANN domain regressor clearly fails to generalize source and target distribution topologies. On the other hand, the NN domain regressor shows a better (although imperfect) generalization capability. Inter alia, it seems to roughly capture the rotation angle of the target distribution. This again corroborates that the DANN representation does not allow discriminating between domains.\n\nThe column \"Hidden Neurons\" shows the configuration of hidden layer neurons (by Equation 4, we have that each neuron is indeed a linear regressor). In other words, each of the fifteen plot line corresponds to the coordinates x ∈ R 2 for which the i-th component of G f (x) equals 1 2 , for i ∈ {1, . . . , 15}. We observe that the standard NN neurons are grouped in three clusters, each one allowing to generate a straight line of the zigzag decision boundary for the label classification problem. However, most of these neurons are also able to (roughly) capture the rotation angle of the domain classification problem. Hence, we observe that the adaptation regularizer of DANN prevents these kinds of neurons to be produced. It is indeed striking to see that the two predominant patterns in the NN neurons (i.e., the two parallel lines crossing the plane from lower left to upper right) are vanishing in the DANN neurons.\n\n\nUnsupervised Hyper-Parameter Selection\n\nTo perform unsupervised domain adaption, one should provide ways to set hyper-parameters (such as the domain regularization parameter λ, the learning rate, the network architecture for our method) in an unsupervised way, i.e., without referring to labeled data in the target domain. In the following experiments of Sections 5.1.3 and 5.1.4, we select the hyper-parameters of each algorithm by using a variant of reverse cross-validation approach proposed by Zhong et al. (2010), that we call reverse validation.\n\nTo evaluate the reverse validation risk associated to a tuple of hyper-parameters, we proceed as follows. Given the labeled source sample S and the unlabeled target sample T , we split each set into training sets (S and T respectively, containing 90% of the original examples) and the validation sets (S V and T V respectively). We use the labeled set S and the unlabeled target set T to learn a classifier η. Then, using the same algorithm, we learn a reverse classifier η r using the self-labeled set {(x, η(x))} x∈T and the unlabeled part of S as target sample. Finally, the reverse classifier η r is evaluated on the validation set S V of source sample. We then say that the classifier η has a reverse validation risk of R S V (η r ). The process is repeated with multiple values of hyper-parameters and the selected parameters are those corresponding to the classifier with the lowest reverse validation risk.\n\nNote that when we train neural network architectures, the validation set S V is also used as an early stopping criterion during the learning of η, and self-labeled validation set {(x, η(x))} x∈T V is used as an early stopping criterion during the learning of η r . We also observed better accuracies when we initialized the learning of the reverse classifier η r with the configuration learned by the network η.\n\n\nExperiments on Sentiment Analysis Data Sets\n\nWe now compare the performance of our proposed DANN algorithm to a standard neural network with one hidden layer (NN) described by Equation (5), and a Support Vector Machine (SVM) with a linear kernel. We compare the algorithms on the Amazon reviews data set, as pre-processed by Chen et al. (2012). This data set includes four domains, each one composed of reviews of a specific kind of product (books, dvd disks, electronics, and kitchen appliances). Reviews are encoded in 5 000 dimensional feature vectors of unigrams and bigrams, and labels are binary: \"0\" if the product is ranked up to 3 stars, and \"1\" if the product is ranked 4 or 5 stars.\n\nWe perform twelve domain adaptation tasks. All learning algorithms are given 2 000 labeled source examples and 2 000 unlabeled target examples. Then, we evaluate them on separate target test sets (between 3 000 and 6 000 examples). Note that NN and SVM do not use the unlabeled target sample for learning.\n\nHere are more details about the procedure used for each learning algorithms leading to the empirical results of Table 1.  • For the DANN algorithm, the adaptation parameter λ is chosen among 9 values between 10 −2 and 1 on a logarithmic scale. The hidden layer size l is either 50 or 100. Finally, the learning rate µ is fixed at 10 −3 .\n\n• For the NN algorithm, we use exactly the same hyper-parameters grid and training procedure as DANN above, except that we do not need an adaptation parameter. Note that one can train NN by using the DANN implementation (Algorithm 1) with λ = 0.\n\n• For the SVM algorithm, the hyper-parameter C is chosen among 10 values between 10 −5 and 1 on a logarithmic scale. This range of values is the same as used by Chen et al. (2012) in their experiments.\n\nAs presented at Section 5.1.2, we used reverse cross validation selecting the hyper-parameters for all three learning algorithms, with early stopping as the stopping criterion for DANN and NN.\n\nThe \"Original data\" part of Table 1a shows the target test accuracy of all algorithms, and Table 1b reports the probability that one algorithm is significantly better than the others according to the Poisson binomial test (Lacoste et al., 2012). We note that DANN has a significantly better performance than NN and SVM, with respective probabilities 0.87 and 0.83. As the only difference between DANN and NN is the domain adaptation regularizer, we conclude that our approach successfully helps to find a representation suitable for the target domain.\n\n\nCombining DANN with Denoising Autoencoders\n\nWe now investigate on whether the DANN algorithm can improve on the representation learned by the state-of-the-art Marginalized Stacked Denoising Autoencoders (mSDA) proposed by Chen et al. (2012). In brief, mSDA is an unsupervised algorithm that learns a new robust feature representation of the training samples. It takes the unlabeled parts of both source and target samples to learn a feature map from input space X to a new representation space. As a denoising autoencoders algorithm, it finds a feature representation from which one can (approximately) reconstruct the original features of an example from its noisy counterpart. Chen et al. (2012) showed that using mSDA with a linear SVM classifier reaches state-of-the-art performance on the Amazon reviews data sets. As an alternative to the SVM, we propose to apply our Shallow DANN algorithm on the same representations generated by mSDA (using representations of both source and target samples). Note that, even if mSDA and DANN are two representation learning approaches, they optimize different objectives, which can be complementary.\n\nWe perform this experiment on the same Amazon reviews data set described in the previous subsection. For each source-target domain pair, we generate the mSDA representations using a corruption probability of 50% and a number of layers of 5. We then execute the three learning algorithms (DANN, NN, and SVM) on these representations. More precisely, following the experimental procedure of Chen et al. (2012), we use the concatenation of the output of the 5 layers and the original input as the new representation. Thus, each example is now encoded in a vector of 30 000 dimensions. Note that we use the same grid search as in the previous Subsection 5.1.3, but use a learning rate µ of 10 −4 for both DANN and the NN. The results of \"mSDA representation\" columns in Table 1a confirm that combining mSDA and DANN is a sound approach. Indeed, the Poisson binomial test shows that DANN has a better performance than the NN and the SVM, with probabilities 0.92 and 0.88 respectively, as reported in Table 1b. We note however that the standard NN and the SVM find the best solution on respectively the second and the fourth tasks. This suggests that DANN and mSDA adaptation strategies are not fully complementary.\n\n\nProxy Distance\n\nThe theoretical foundation of the DANN algorithm is the domain adaptation theory of Ben-David et al. (2006. We claimed that DANN finds a representation in which the source and the target example are hardly distinguishable. Our toy experiment of Section 5.1.1 already points out some evidence for that and here we provide analysis on real data. To do so, we compare the Proxy A-distance (PAD) on various representations of the Amazon Reviews data set; these representations are obtained by running either NN, DANN, mSDA,  or mSDA and DANN combined. Recall that PAD, as described in Section 3.2, is a metric estimating the similarity of the source and the target representations. More precisely, to obtain a PAD value, we use the following procedure: (1) we construct the data set U of Equation (2)  Firstly, Figure 3a compares the PAD of DANN representations obtained in the experiments of Section 5.1.3 (using the hyper-parameters values leading to the results of Table 1) to the PAD computed on raw data. As expected, the PAD values are driven down by the DANN representations.\n\nSecondly, Figure 3b compares the PAD of DANN representations to the PAD of standard NN representations. As the PAD is influenced by the hidden layer size (the discriminating power tends to increase with the representation length), we fix here the size to 100 neurons for both algorithms. We also fix the adaptation parameter of DANN to λ 0.31; it was the value that has been selected most of the time during our preceding experiments on the Amazon Reviews data set. Again, DANN is clearly leading to the lowest PAD values.\n\nLastly, Figure 3c presents two sets of results related to Section 5.1.4 experiments. On one hand, we reproduce the results of Chen et al. (2012), which noticed that the mSDA representations have greater PAD values than original (raw) data. Although the mSDA approach clearly helps to adapt to the target task, it seems to contradict the theory of Ben-David et al.. On the other hand, we observe that, when running DANN on top of mSDA (using the hyper-parameters values leading to the results of Table 1), the obtained representations have much lower PAD values. These observations might explain the improvements provided by DANN when combined with the mSDA procedure.\n\n\nExperiments with Deep Networks on Image Classification\n\nWe now perform extensive evaluation of a deep version of DANN (see Subsection 4.2) on a number of popular image data sets and their modifications. These include large-scale data sets of small images popular with deep learning methods, and the Office data sets (Saenko et al., 2010), which are a de facto standard for domain adaptation in computer vision, but have much fewer images.\n\n\nBaselines\n\nThe following baselines are evaluated in the experiments of this subsection. The source-only model is trained without consideration for target-domain data (no domain classifier branch included into the network). The train-on-target model is trained on the target domain with class labels revealed. This model serves as an upper bound on DA methods, assuming that target data are abundant and the shift between the domains is considerable.\n\nIn addition, we compare our approach against the recently proposed unsupervised DA method based on subspace alignment (SA) (Fernando et al., 2013), which is simple to setup and test on new data sets, but has also been shown to perform very well in experimental comparisons with other \"shallow\" DA methods. To boost the performance of this baseline, we pick its most important free parameter (the number of principal components) from the range {2, . . . , 60}, so that the test performance on the target domain is maximized. To apply SA in our setting, we train a source-only model and then consider the activations of the last hidden layer in the label predictor (before the final linear classifier) as descriptors/features, and learn the mapping between the source and the target domains (Fernando et al., 2013).\n\nSince the SA baseline requires training a new classifier after adapting the features, and in order to put all the compared settings on an equal footing, we retrain the last layer of the label predictor using a standard linear SVM (Fan et al., 2008) for all four considered methods (including ours; the performance on the target domain remains approximately the same after the retraining).\n\nFor the Office data set (Saenko et al., 2010), we directly compare the performance of our full network (feature extractor and label predictor) against recent DA approaches using previously published results.\n\n\nCNN architectures and Training Procedure\n\nIn general, we compose feature extractor from two or three convolutional layers, picking their exact configurations from previous works. More precisely, four different architectures were used in our experiments. The first three are shown in Figure 4. For the Office domains, we use pre-trained AlexNet from the Caffe-package . The adaptation architecture is identical to . 5 For the domain adaption component, we use three (x→1024→1024→2) fully connected layers, except for MNIST where we used a simpler (x→100→2) architecture to speed up the experiments. Admittedly these choices for domain classifier are arbitrary, and better adaptation performance might be attained if this part of the architecture is tuned. (x→1024→1024→2)    For the loss functions, we set L y and L d to be the logistic regression loss and the binomial cross-entropy respectively. Following Srivastava et al. (2014) we also use dropout and 2 -norm restriction when we train the SVHN architecture.\n\n\nA 2-layer domain classifier\n\nThe other hyper-parameters are not selected through a grid search as in the small scale experiments of Section 5.1, which would be computationally costly. Instead, the learning rate is adjusted during the stochastic gradient descent using the following formula:\nµ p = µ 0 (1 + α · p) β ,\nwhere p is the training progress linearly changing from 0 to 1, µ 0 = 0.01, α = 10 and β = 0.75 (the schedule was optimized to promote convergence and low error on the source domain). A momentum term of 0.9 is also used.\n\nThe domain adaptation parameter λ is initiated at 0 and is gradually changed to 1 using the following schedule:\nλ p = 2 1 + exp(−γ · p) − 1 ,\nwhere γ was set to 10 in all experiments (the schedule was not optimized/tweaked). This strategy allows the domain classifier to be less sensitive to noisy signal at the early stages of the training procedure. Note however that these λ p were used only for updating the feature extractor component G f . For updating the domain classification component, we used a fixed λ = 1, to ensure that the latter trains as fast as the label predictor G y . 6 Finally, note that the model is trained on 128-sized batches (images are preprocessed by the mean subtraction). A half of each batch is populated by the samples from the source domain (with known labels), the rest constitutes the target domain (with labels not revealed to the algorithms except for the train-on-target baseline).\n\n\nVisualizations\n\nWe use t-SNE (van der Maaten, 2013) projection to visualize feature distributions at different points of the network, while color-coding the domains ( Figure 5). As we already observed with the shallow version of DANN (see Figure 2), there is a strong correspondence 6. Equivalently, one can use the same λp for both feature extractor and domain classification components, but use a learning rate of µ/λp for the latter.\n\nbetween the success of the adaptation in terms of the classification accuracy for the target domain, and the overlap between the domain distributions in such visualizations.\n\n\nResults On Image Data Sets\n\nWe now discuss the experimental settings and the results. In each case, we train on the source data set and test on a different target domain data set, with considerable shifts between domains (see Figure 6). The results are summarized in Table 2 and Table 3.\n\nMNIST → MNIST-M. Our first experiment deals with the MNIST data set (LeCun et al., 1998) (source). In order to obtain the target domain (MNIST-M) we blend digits from the original set over patches randomly extracted from color photos from BSDS500 (Arbelaez et al., 2011). This operation is formally defined for two images I 1 , I 2 as I out ijk = |I 1 ijk − I 2 ijk |, where i, j are the coordinates of a pixel and k is a channel index. In other words, an output sample is produced by taking a patch from a photo and inverting its pixels at positions corresponding to the pixels of a digit. For a human the classification task becomes only slightly harder compared to the original data set (the digits are still clearly distinguishable) whereas for a CNN trained on MNIST this domain is quite distinct, as the background and the strokes are no longer constant. Consequently, the source-only model performs poorly. Our approach succeeded at aligning feature distributions ( Figure 5), which led to successful adaptation results (considering that the adaptation is unsupervised). At the same time, the improvement over source-only model achieved by subspace alignment (SA) (Fernando et al., 2013) is quite modest, thus highlighting the difficulty of the adaptation task.\n\nSynthetic numbers → SVHN. To address a common scenario of training on synthetic data and testing on real data, we use Street-View House Number data set SVHN (Netzer et al., 2011) as the target domain and synthetic digits as the source. The latter (Syn Numbers) consists of ≈ 500,000 images generated by ourselves from Windows TM fonts by varying the text (that includes different one-, two-, and three-digit numbers), positioning, orientation, background and stroke colors, and the amount of blur. The degrees of variation were chosen manually to simulate SVHN, however the two data sets are still rather distinct, the biggest difference being the structured clutter in the background of SVHN images.\n\nThe proposed backpropagation-based technique works well covering almost 80% of the gap between training with source data only and training on target domain data with known target labels. In contrast, SA (Fernando et al., 2013) results in a slight classification accuracy drop (probably due to the information loss during the dimensionality reduction), indicating that the adaptation task is even more challenging than in the case of the MNIST experiment.\n\nMNIST ↔ SVHN. In this experiment, we further increase the gap between distributions, and test on MNIST and SVHN, which are significantly different in appearance. Training on SVHN even without adaptation is challenging -classification error stays high during the first 150 epochs. In order to avoid ending up in a poor local minimum we, therefore, do not use learning rate annealing here. Obviously, the two directions (MNIST → SVHN and SVHN → MNIST) are not equally difficult. As SVHN is more diverse, a model trained on SVHN is expected to be more generic and to perform reasonably on the MNIST data set. This, indeed, turns out to be the case and is supported by the appearance of the    Figure 7: Results for the traffic signs classification in the semi-supervised setting. Syn and Real denote available labeled data (100,000 synthetic and 430 real images respectively); Adapted means that ≈ 31,000 unlabeled target domain images were used for adaptation. The best performance is achieved by employing both the labeled samples and the large unlabeled corpus in the target domain.\n\nfeature distributions. We observe a quite strong separation between the domains when we feed them into the CNN trained solely on MNIST, whereas for the SVHN-trained network the features are much more intermixed. This difference probably explains why our method succeeded in improving the performance by adaptation in the SVHN → MNIST scenario (see Table 2) but not in the opposite direction (SA is not able to perform adaptation in this case either). Unsupervised adaptation from MNIST to SVHN gives a failure example for our approach: it doesn't manage to improve upon the performance of the non-adapted model which achieves ≈ 0.25 accuracy (we are unaware of any unsupervised DA methods capable of performing such adaptation).\n\nSynthetic Signs → GTSRB. Overall, this setting is similar to the Syn Numbers → SVHN experiment, except the distribution of the features is more complex due to the significantly larger number of classes (43 instead of 10). For the source domain we obtained 100,000 synthetic images (which we call Syn Signs) simulating various imaging conditions. In the target domain, we use 31,367 random training samples for unsupervised adaptation and the rest for evaluation. Once again, our method achieves a sensible increase in performance proving its suitability for the synthetic-to-real data adaptation.\n\nAs an additional experiment, we also evaluate the proposed algorithm for semi-supervised domain adaptation, i.e., when one is additionally provided with a small amount of labeled target data. Here, we reveal 430 labeled examples (10 samples per class) and add them to the training set for the label predictor. Figure 7 shows the change of the validation error throughout the training. While the graph clearly suggests that our method can be beneficial in the semi-supervised setting, thorough verification of semi-supervised setting is left for future work.\n\nOffice data set. We finally evaluate our method on Office data set, which is a collection of three distinct domains: Amazon, DSLR, and Webcam. Unlike previously discussed data sets, Office is rather small-scale with only 2817 labeled images spread across 31 different categories in the largest domain. The amount of available data is crucial for a successful training of a deep model, hence we opted for the fine-tuning of the CNN pre-trained on the ImageNet (AlexNet from the Caffe package, see  as it is done in some recent DA works Hoffman et al., 2013;Long and Wang, 2015). We make our approach more comparable with  by using exactly the same network architecture replacing domain mean-based regularization with the domain classifier.\n\nFollowing previous works, we assess the performance of our method across three transfer tasks most commonly used for evaluation. Our training protocol is adopted from ; Chopra et al. (2013); Long and Wang (2015) as during adaptation we use all available labeled source examples and unlabeled target examples (the premise of our method is the abundance of unlabeled data in the target domain). Also, all source domain data are used for training. Under this \"fully-transductive\" setting, our method is able to improve previously-reported state-of-the-art accuracy for unsupervised adaptation very considerably (Table 3), especially in the most challenging Amazon → Webcam scenario (the two domains with the largest domain shift).\n\nInterestingly, in all three experiments we observe a slight over-fitting (performance on the target domain degrades while accuracy on the source continues to improve) as training progresses, however, it doesn't ruin the validation accuracy. Moreover, switching off the domain classifier branch makes this effect far more apparent, from which we conclude that our technique serves as a regularizer.\n\n\nExperiments with Deep Image Descriptors for Re-Identification\n\nIn this section we discuss the application of the described adaptation method to person re-identification (re-id ) problem. The task of person re-identification is to associate people seen from different camera views. More formally, it can be defined as follows: given two sets of images from different cameras (probe and gallery) such that each person depicted in the probe set has an image in the gallery set, for each image of a person from the probe set find an image of the same person in the gallery set. Disjoint camera views, different illumination conditions, various poses and low quality of data make this problem difficult even for humans (e.g., Liu et al., 2013, reports human performance at Rank1=71.08%).\n\nUnlike classification problems that are discussed above, re-identification problem implies that each image is mapped to a vector descriptor. The distance between descriptors is then used to match images from the probe set and the gallery set. To evaluate results of re-id methods the Cumulative Match Characteristic (CMC) curve is commonly used. It is a plot of the identification rate (recall) at rank-k, that is the probability of the matching gallery image to be within the closest k images (in terms of descriptor distance) to the probe image.\n\nMost existing works train descriptor mappings and evaluate them within the same data set containing images from a certain camera network with similar imaging conditions. Several papers, however, observed that the performance of the resulting re-identification systems drops very considerably when descriptors trained on one data set and tested on another. It is therefore natural to handle such cross-domain evaluation as a domain-adaptation problem, where each camera network (data set) constitutes a domain. Recently, several papers with significantly improved re-identification performance (Zhang and Saligrama, 2014;Zhao et al., 2014;Paisitkriangkrai et al., 2015) have been presented, with Ma et al. (2015) reporting good results in cross-data-set evaluation scenario. At the moment, deep learning methods (Yi et al., 2014) do not achieve state-of-the-art results probably because of the limited size of the training sets. Domain adaptation thus represents a viable direction for improving deep re-identification descriptors.\n\n\nData Sets and Protocols\n\nFollowing Ma et al. (2015), we use PRID (Hirzer et al., 2011), VIPeR (Gray et al., 2007), CUHK (Li and Wang, 2013) as target data sets for our experiments. The PRID data set exists in two versions, and as in Ma et al. (2015) we use a single-shot variant. It contains images of 385 persons viewed from camera A and images of 749 persons viewed from camera B, 200 persons appear in both cameras. The VIPeR data set also contains images taken with two cameras, and in total 632 persons are captured, for every person there is one image for each of the two camera views. The CUHK data set consists of images from five pairs of cameras, two images for each person from each of the two cameras. We refer to the subset of this data set that includes the first pair of cameras only as CUHK/p1 (as most papers use this subset). See Figure 8 for samples of these data sets.\n\nWe perform extensive experiments for various pairs of data sets, where one data set serves as a source domain, i.e., it is used to train a descriptor mapping in a supervised way with known correspondences between probe and gallery images. The second data set is used as a target domain, so that images from that data set are used without probe-gallery correspondence.\n\nIn more detail, CUHK/p1 is used for experiments when CUHK serves as a target domain and two settings (\"whole CUHK\" and CUHK/p1) are used for experiments when CUHK serves as a source domain. Given PRID as a target data set, we randomly choose 100 persons appearing in both camera views as training set. The images of the other 100 persons from camera A are used as probe, all images from camera B excluding those used in training (649 in total) are used as gallery at test time. For VIPeR, we use random 316 persons for training and all others for testing. For CUHK, 971 persons are split into 485 for training and 486 for testing. Unlike Ma et al. (2015), we use all images in the first pair of cameras of CUHK instead of choosing one image of a person from each camera view. We also performed two experiments with all images of the whole CUHK data set as source domain and VIPeR and PRID data sets as target domains as in the original paper (Yi et al., 2014).\n\nFollowing Yi et al. (2014), we augmented our data with mirror images, and during test time we calculate similarity score between two images as the mean of the four scores corresponding to different flips of the two compared images. In case of CUHK, where there are 4 images (including mirror images) for each of the two camera views for each person, all 16 combinations' scores are averaged.\n\n\nCNN architectures and Training Procedure\n\nIn our experiments, we use siamese architecture described in Yi et al. (2014) (Deep Metric Learning or DML) for learning deep image descriptors on the source data set. This architecture incorporates two convolution layers (with 7 × 7 and 5 × 5 filter banks), followed by ReLU and max pooling, and one fully-connected layer, which gives 500-dimensional descriptors as an output. There are three parallel flows within the CNN for processing three part of an image: the upper, the middle, and the lower one. The first convolution layer shares parameters between three parts, and the outputs of the second convolution layers are concatenated. During training, we follow Yi et al. (2014) and calculate pairwise cosine similarities between 500-dimensional features within each batch and backpropagate the loss for all pairs within batch.\n\nTo perform domain-adversarial training, we construct a DANN architecture. The feature extractor includes the two convolutional layers (followed by max-pooling and ReLU) discussed above. The label predictor in this case is replaced with descriptor predictor that includes one fully-connected layer. The domain classifier includes two fully-connected layers with 500 units in the intermediate representation (x→500→1).\n\nFor the verification loss function in the descriptor predictor we used Binomial Deviance loss, defined in Yi et al. (2014) with similar parameters: α = 2, β = 0.5, c = 2 (the asymmetric cost parameter for negative pairs). The domain classifier is trained with logistic loss as in subsection 5.2.2.\n\nWe used learning rate fixed to 0.001 and momentum of 0.9. The schedule of adaptation similar to the one described in subsection 5.2.2 was used. We also inserted dropout layer with rate 0.5 after the concatenation of outputs of the second max-pooling layer. 128-sized batches were used for source data and 128-sized batches for target data. Figure 9 shows results in the form of CMC-curves for eight pairs of data sets. Depending on the hardness of the annotation problem we trained either for 50,000 iterations (CUHK/p1 → VIPeR, VIPeR → CUHK/p1, PRID → VIPeR) or for 20,000 iterations (the other five pairs).\n\n\nResults on Re-identification data sets\n\nAfter the sufficient number of iterations, domain-adversarial training consistently improves the performance of re-identification. For the pairs that involve PRID data set, which is more dissimilar to the other two data sets, the improvement is considerable. Overall, this demonstrates the applicability of the domain-adversarial learning beyond classification problems.  \n\n\nConclusion\n\nThe paper proposes a new approach to domain adaptation of feed-forward neural networks, which allows large-scale training based on large amount of annotated data in the source domain and large amount of unannotated data in the target domain. Similarly to many previous shallow and deep DA techniques, the adaptation is achieved through aligning the distributions of features across the two domains. However, unlike previous approaches, the alignment is accomplished through standard backpropagation training.\n\nThe approach is motivated and supported by the domain adaptation theory of Ben-David et al. (2006. The main idea behind DANN is to enjoin the network hidden layer to learn a representation which is predictive of the source example labels, but uninformative about the domain of the input (source or target). We implement this new approach within both shallow and deep feed-forward architectures. The latter allows simple implementation within virtually any deep learning package through the introduction of a simple gradient reversal layer. We have shown that our approach is flexible and achieves state-of-the-art results on a variety of benchmark in domain adaptation, namely for sentiment analysis and image classification tasks.\n\nA convenient aspect of our approach is that the domain adaptation component can be added to almost any neural network architecture that is trainable with backpropagation. Towards this end, We have demonstrated experimentally that the approach is not confined to classification tasks but can be used in other feed-forward architectures, e.g., for descriptor learning for person re-identification.\n\nFigure 1 :\n1The proposed architecture includes a deep feature extractor (green) and a deep label predictor (blue), which together form a standard feed-forward architecture. Unsupervised domain adaptation is achieved by adding a domain classifier (red) connected to the feature extractor via a gradient reversal layer that multiplies the gradient by a certain negative constant during the backpropagation-based training. Otherwise, the training proceeds standardly and minimizes the label prediction loss (for source examples) and the domain classification loss (for all samples). Gradient reversal ensures that the feature distributions over the two domains are made similar (as indistinguishable as possible for the domain classifier), thus resulting in the domain-invariant features.\n\nFigure 2 :\n2NN. For the \"domain classification\", we use a non adversarial domain regressor on the hidden neurons learned by the Standard NN. (This is equivalent to run Algorithm 1, without Lines 22 and 31) The inter-twinning moons toy problem. Examples from the source sample are represented as a \"+\"(label 1) and a \"− − −\"(label 0), while examples from the unlabeled target sample are represented as black dots. See text for the figure discussion. one. As the source sample S, we generate a lower moon and an upper moon labeled 0 and 1 respectively, each of which containing 150 examples. The target sample T is obtained by the following procedure: (1) we generate a sample S the same way S has been generated; (2) we rotate each example by 35 • ; and (3) we remove all the labels. Thus, T contains 300 unlabeled examples. We have represented those examples in Figure 2.\n\nFigure 3 :\n3Proxy A-distances (PAD). Note that the PAD values of mSDA representations are symmetric when swapping source and target samples.\n\n\nusing both source and target representations of the training samples; (2) we randomly split U in two subsets of equal size; (3) we train linear SVMs on the first subset of U using a large range of C values; (4) we compute the error of all obtained classifiers on the second subset of U ; and (5) we use the lowest error to compute the PAD value of Equation (3).\n\n\n(c) GTSRB architecture; we used the single-CNN baseline fromCireşan et al. (2012) as our starting point.\n\nFigure 4 :\n4CNN architectures used in the experiments. Boxes correspond to transformations applied to the data. Color-coding is the same as inFigure 1.\n\nSynFigure 5 :\n5Numbers → SVHN: last hidden layer of the label predictor The effect of adaptation on the distribution of the extracted features (best viewed in color). The figure shows t-SNE (van der Maaten, 2013) visualizations of the CNN's activations (a) in case when no adaptation was performed and (b) in case when our adaptation procedure was incorporated into training. Blue points correspond to the source domain examples, while red ones correspond to the target domain. In all cases, the adaptation in our method makes the two distributions of features much closer.\n\nFigure 8 :\n8Matching and non-matching pairs of probe-gallery images from different person re-identification data sets. The three data sets are treated as different domains in our experiments.\n\nFigure 9 :Figure 10 :\n910Results on VIPeR, PRID and CUHK/p1 with and without domain-adversarial learning. Across the eight domain pairs domain-adversarial learning improves reidentification accuracy. For some domain pairs the improvement is considerable. The effect of adaptation shown by t-SNE visualizations of source and target domains descriptors in a VIPeR → CUHK/p1 experiment pair. VIPeR is depicted with green and CUHK/p1 -with red. As in the image classification case, domain-adversarial learning ensures a closer match between the source and the target distributions.\n\nFigure 10 further\n10demonstrates the effect of adaptation on the distributions of the learned descriptors in the source and in target sets in VIPeR → CUHK/p1 experiments, where domain adversarial learning once again achieves better intermixing of the two domains.\n\nTable 1 :\n1Classification accuracy on the Amazon reviews data set, and Pairwise Poisson binomial test.\n\n\nis attached to the 256-dimensional bottleneck of fc7.conv 5x5 \n32 maps \nReLU \n\nmax-pool 2x2 \n2x2 stride \n\nconv 5x5 \n48 maps \nReLU \n\nmax-pool 2x2 \n2x2 stride \n\nfully-conn \n100 units \nReLU \n\nfully-conn \n100 units \nReLU \n\nfully-conn \n10 units \nSoft-max \n\nGRL \n\nfully-conn \n100 units \nReLU \n\nfully-conn \n1 unit \nLogistic \n\n(a) MNIST architecture; inspired by the classical LeNet-5 (LeCun et al., 1998). \n\nconv 5x5 \n64 maps \nReLU \n\nmax-pool 3x3 \n2x2 stride \n\nconv 5x5 \n64 maps \nReLU \n\nmax-pool 3x3 \n2x2 stride \n\nconv 5x5 \n128 maps \nReLU \n\nfully-conn \n3072 units \nReLU \n\nfully-conn \n2048 units \nReLU \n\nfully-conn \n10 units \nSoft-max \n\nGRL \n\nfully-conn \n1024 units \nReLU \n\nfully-conn \n1024 units \nReLU \n\nfully-conn \n1 unit \nLogistic \n\n(b) SVHN architecture; adopted from Srivastava et al. (2014). \n\nconv 5x5 \n96 maps \nReLU \n\nmax-pool 2x2 \n2x2 stride \n\nconv 3x3 \n144 maps \nReLU \n\nmax-pool 2x2 \n2x2 stride \n\nconv 5x5 \n256 maps \nReLU \n\nmax-pool 2x2 \n2x2 stride \n\nfully-conn \n512 units \nReLU \n\nfully-conn \n10 units \nSoft-max \n\nGRL \n\nfully-conn \n1024 units \nReLU \n\nfully-conn \n1024 units \nReLU \n\nfully-conn \n1 unit \nLogistic \n\n\n\nTable 2 :\n2Classification accuracies for digit image classifications for different source and target domains. MNIST-M corresponds to difference-blended digits over nonuniform background. The first row corresponds to the lower performance bound (i.e., if no adaptation is performed). The last row corresponds to training on the target domain data with known class labels (upper bound on the DA performance). For each of the two DA methods (ours and Fernando et al., 2013) we \n\n\nTable 3 :\n3Accuracy evaluation of different DA approaches on the standard Office (Saenko \net al., 2010) data set. All methods (except SA) are evaluated in the \"fully-\ntransductive\" protocol (some results are reproduced from Long and Wang, 2015). \nOur method (last row) outperforms competitors setting the new state-of-the-art. \n\n. As mentioned byBen-David et al. (2006), the same analysis holds for multiclass setting. However, to obtain the same results when |Y | > 2, one should assume that H is a symmetrical hypothesis class. That is, for all h ∈ H and any permutation of labels c : Y → Y , we have c(h) ∈ H. Note that this is the case for most commonly used neural network architectures.\n. For brevity of notation, we will sometimes drop the dependence of G f on its parameters(W, b)and shorten G f (x; W, b) to G f (x).\n. We provide an implementation of Shallow DANN algorithm at http://graal.ift.ulaval.ca/dann/\n. http://sites.skoltech.ru/compvision/projects/grl/\nAcknowledgmentsThis work has been supported by National Science and Engineering Research Council (NSERC) Discovery grants 262067 and 0122405 as well as the Russian Ministry of Science and Education grant RFMEFI57914X0071. Computations were performed on the Colosse supercomputer grid at Université Laval, under the auspices of Calcul Québec and Compute Canada. The operations of Colosse are funded by the NSERC, the Canada Foundation for Innovation (CFI), NanoQuébec, and the Fonds de recherche du Québec -Nature et technologies (FRQNT). We also thank the Graphics & Media Lab, Faculty of Computational Mathematics and Cybernetics, Lomonosov Moscow State University for providing the synthetic road signs data set.\nDomain-adversarial neural networks. Hana Ajakan, Pascal Germain, Hugo Larochelle, François Laviolette, Mario Marchand, NIPS 2014 Workshop on Transfer and Multi-task learning: Theory Meets Practice. Hana Ajakan, Pascal Germain, Hugo Larochelle, François Laviolette, and Mario Marchand. Domain-adversarial neural networks. NIPS 2014 Workshop on Transfer and Multi-task learning: Theory Meets Practice, 2014. URL http://arxiv.org/abs/1412.4446.\n\nContour detection and hierarchical image segmentation. IEEE Transaction Pattern Analysis and Machine Intelligence. Pablo Arbelaez, Michael Maire, Charless Fowlkes, Jitendra Malik, 33Pablo Arbelaez, Michael Maire, Charless Fowlkes, and Jitendra Malik. Contour detection and hierarchical image segmentation. IEEE Transaction Pattern Analysis and Machine Intelligence, 33, 2011.\n\nNeural codes for image retrieval. Artem Babenko, Anton Slesarev, Alexander Chigorin, Victor S Lempitsky, ECCV. Artem Babenko, Anton Slesarev, Alexander Chigorin, and Victor S. Lempitsky. Neural codes for image retrieval. In ECCV, pages 584-599, 2014.\n\nUnsupervised domain adaptation by domain invariant projection. Mahsa Baktashmotlagh, Tafazzoli Mehrtash, Brian C Harandi, Mathieu Lovell, Salzmann, ICCV. Mahsa Baktashmotlagh, Mehrtash Tafazzoli Harandi, Brian C. Lovell, and Mathieu Salz- mann. Unsupervised domain adaptation by domain invariant projection. In ICCV, pages 769-776, 2013.\n\nAnalysis of representations for domain adaptation. Shai Ben-David, John Blitzer, Koby Crammer, Fernando Pereira, NIPS. Shai Ben-David, John Blitzer, Koby Crammer, and Fernando Pereira. Analysis of repre- sentations for domain adaptation. In NIPS, pages 137-144, 2006.\n\nA theory of learning from different domains. Shai Ben-David, John Blitzer, Koby Crammer, Alex Kulesza, Fernando Pereira, Jennifer Wortman Vaughan, Machine Learning. 79Shai Ben-David, John Blitzer, Koby Crammer, Alex Kulesza, Fernando Pereira, and Jen- nifer Wortman Vaughan. A theory of learning from different domains. Machine Learning, 79(1-2):151-175, 2010.\n\nDomain adaptation with structural correspondence learning. John Blitzer, Ryan T Mcdonald, Fernando Pereira, Conference on Empirical Methods in Natural Language Processing. John Blitzer, Ryan T. McDonald, and Fernando Pereira. Domain adaptation with struc- tural correspondence learning. In Conference on Empirical Methods in Natural Language Processing, pages 120-128, 2006.\n\nIntegrating structured biological data by kernel maximum mean discrepancy. Karsten M Borgwardt, Arthur Gretton, Malte J Rasch, Hans-Peter Kriegel, Bernhard Schölkopf, Alexander J Smola, ISMB. Karsten M. Borgwardt, Arthur Gretton, Malte J. Rasch, Hans-Peter Kriegel, Bernhard Schölkopf, and Alexander J. Smola. Integrating structured biological data by kernel maximum mean discrepancy. In ISMB, pages 49-57, 2006.\n\nDomain adaptation problems: A DASVM classification technique and a circular validation strategy. IEEE Transaction Pattern Analysis and Machine Intelligence. Lorenzo Bruzzone, Mattia Marconcini, 32Lorenzo Bruzzone and Mattia Marconcini. Domain adaptation problems: A DASVM classi- fication technique and a circular validation strategy. IEEE Transaction Pattern Analysis and Machine Intelligence, 32(5):770-787, 2010.\n\nMarginalized denoising autoencoders for domain adaptation. Minmin Chen, Zhixiang Eddie Xu, Kilian Q Weinberger, Fei Sha, ICML. Minmin Chen, Zhixiang Eddie Xu, Kilian Q. Weinberger, and Fei Sha. Marginalized de- noising autoencoders for domain adaptation. In ICML, pages 767-774, 2012.\n\nDeep domain adaptation for describing people based on fine-grained clothing attributes. Qiang Chen, Junshi Huang, Rogerio Feris, Lisa M Brown, Jian Dong, Shuicheng Yan, CVPR. Qiang Chen, Junshi Huang, Rogerio Feris, Lisa M. Brown, Jian Dong, and Shuicheng Yan. Deep domain adaptation for describing people based on fine-grained clothing attributes. In CVPR, June 2015.\n\nDlid: Deep learning for domain adaptation by interpolating between domains. S Chopra, S Balakrishnan, R Gopalan, ICML Workshop on Challenges in Representation Learning. S. Chopra, S. Balakrishnan, and R. Gopalan. Dlid: Deep learning for domain adaptation by interpolating between domains. In ICML Workshop on Challenges in Representation Learning, 2013.\n\nMulti-column deep neural network for traffic sign classification. Dan Cireşan, Ueli Meier, Jonathan Masci, Jürgen Schmidhuber, Neural Networks. 32Dan Cireşan, Ueli Meier, Jonathan Masci, and Jürgen Schmidhuber. Multi-column deep neural network for traffic sign classification. Neural Networks, 32:333-338, 2012.\n\nDomain adaptation and sample bias correction theory and algorithm for regression. Corinna Cortes, Mehryar Mohri, Theor. Comput. Sci. 519Corinna Cortes and Mehryar Mohri. Domain adaptation and sample bias correction theory and algorithm for regression. Theor. Comput. Sci., 519:103-126, 2014.\n\nDecaf: A deep convolutional activation feature for generic visual recognition. Jeff Donahue, Yangqing Jia, Oriol Vinyals, Judy Hoffman, Ning Zhang, Eric Tzeng, Trevor Darrell, ICML. Jeff Donahue, Yangqing Jia, Oriol Vinyals, Judy Hoffman, Ning Zhang, Eric Tzeng, and Trevor Darrell. Decaf: A deep convolutional activation feature for generic visual recog- nition. In ICML, 2014.\n\nAdaptive subgradient methods for online learning and stochastic optimization. John Duchi, Elad Hazan, Yoram Singer, EECS Department, University of California, BerkeleyTechnical reportJohn Duchi, Elad Hazan, and Yoram Singer. Adaptive subgradient methods for online learning and stochastic optimization. Technical report, EECS Department, University of California, Berkeley, Mar 2010.\n\nLIB-LINEAR: A library for large linear classification. Kai-Wei Rong-En Fan, Cho-Jui Chang, Xiang-Rui Hsieh, Chih-Jen Wang, Lin, Journal of Machine Learning Research. 9Rong-En Fan, Kai-Wei Chang, Cho-Jui Hsieh, Xiang-Rui Wang, and Chih-Jen Lin. LIB- LINEAR: A library for large linear classification. Journal of Machine Learning Research, 9:1871-1874, 2008.\n\nUnsupervised visual domain adaptation using subspace alignment. Basura Fernando, Amaury Habrard, Marc Sebban, Tinne Tuytelaars, ICCV. Basura Fernando, Amaury Habrard, Marc Sebban, and Tinne Tuytelaars. Unsupervised visual domain adaptation using subspace alignment. In ICCV, 2013.\n\nUnsupervised domain adaptation by backpropagation. Yaroslav Ganin, Victor Lempitsky, ICML. Yaroslav Ganin and Victor Lempitsky. Unsupervised domain adaptation by backpropa- gation. In ICML, pages 325-333, 2015. URL http://jmlr.org/proceedings/papers/ v37/ganin15.html.\n\nA PAC-Bayesian approach for domain adaptation with specialization to linear classifiers. Pascal Germain, Amaury Habrard, François Laviolette, Emilie Morvant, ICML. Pascal Germain, Amaury Habrard, François Laviolette, and Emilie Morvant. A PAC- Bayesian approach for domain adaptation with specialization to linear classifiers. In ICML, pages 738-746, 2013.\n\nDomain adaptation for large-scale sentiment classification: A deep learning approach. Xavier Glorot, Antoine Bordes, Yoshua Bengio, ICML. Xavier Glorot, Antoine Bordes, and Yoshua Bengio. Domain adaptation for large-scale sentiment classification: A deep learning approach. In ICML, pages 513-520, 2011.\n\nGeodesic flow kernel for unsupervised domain adaptation. Boqing Gong, Yuan Shi, Fei Sha, Kristen Grauman, CVPR. Boqing Gong, Yuan Shi, Fei Sha, and Kristen Grauman. Geodesic flow kernel for unsuper- vised domain adaptation. In CVPR, pages 2066-2073, 2012.\n\nConnecting the dots with landmarks: Discriminatively learning domain-invariant features for unsupervised domain adaptation. Boqing Gong, Kristen Grauman, Fei Sha, ICML. Boqing Gong, Kristen Grauman, and Fei Sha. Connecting the dots with landmarks: Dis- criminatively learning domain-invariant features for unsupervised domain adaptation. In ICML, pages 222-230, 2013.\n\nPerson reidentification. Shaogang Gong, Marco Cristani, Shuicheng Yan, Chen Change Loy, SpringerShaogang Gong, Marco Cristani, Shuicheng Yan, and Chen Change Loy. Person re- identification. Springer, 2014.\n\nGenerative adversarial nets. Ian Goodfellow, Jean Pouget-Abadie, Mehdi Mirza, Bing Xu, David Warde-Farley, Sherjil Ozair, Aaron Courville, Yoshua Bengio, NIPS. Ian Goodfellow, Jean Pouget-Abadie, Mehdi Mirza, Bing Xu, David Warde-Farley, Sherjil Ozair, Aaron Courville, and Yoshua Bengio. Generative adversarial nets. In NIPS, 2014.\n\nDomain adaptation for object recognition: An unsupervised approach. Raghuraman Gopalan, Ruonan Li, Rama Chellappa, ICCV. Raghuraman Gopalan, Ruonan Li, and Rama Chellappa. Domain adaptation for object recognition: An unsupervised approach. In ICCV, pages 999-1006, 2011.\n\nEvaluating appearance models for recognition, reacquisition, and tracking. Doug Gray, Shane Brennan, Hai Tao, IEEE International Workshop on Performance Evaluation for Tracking and Surveillance. Rio de JaneiroDoug Gray, Shane Brennan, and Hai Tao. Evaluating appearance models for recognition, reacquisition, and tracking. In IEEE International Workshop on Performance Evaluation for Tracking and Surveillance, Rio de Janeiro, 2007.\n\nPerson re-identification by descriptive and discriminative classification. Martin Hirzer, Csaba Beleznai, Peter M Roth, Horst Bischof, SCIA. Martin Hirzer, Csaba Beleznai, Peter M. Roth, and Horst Bischof. Person re-identification by descriptive and discriminative classification. In SCIA, 2011.\n\nOne-shot adaptation of supervised deep convolutional models. CoRR, abs/1312. Judy Hoffman, Eric Tzeng, Jeff Donahue, Yangqing Jia, Kate Saenko, Trevor Darrell, 6204Judy Hoffman, Eric Tzeng, Jeff Donahue, Yangqing Jia, Kate Saenko, and Trevor Darrell. One-shot adaptation of supervised deep convolutional models. CoRR, abs/1312.6204, 2013. URL http://arxiv.org/abs/1312.6204.\n\nBiased representation learning for domain adaptation. Fei Huang, Alexander Yates, Joint Conference on Empirical Methods in Natural Language Processing and Computational Natural Language Learning. Fei Huang and Alexander Yates. Biased representation learning for domain adaptation. In Joint Conference on Empirical Methods in Natural Language Processing and Computa- tional Natural Language Learning, pages 1313-1323, 2012.\n\nCorrecting sample selection bias by unlabeled data. Jiayuan Huang, Alexander J Smola, Arthur Gretton, Karsten M Borgwardt, Bernhard Schölkopf, NIPS. Jiayuan Huang, Alexander J. Smola, Arthur Gretton, Karsten M. Borgwardt, and Bernhard Schölkopf. Correcting sample selection bias by unlabeled data. In NIPS, pages 601-608, 2006.\n\nCaffe: Convolutional architecture for fast feature embedding. Yangqing Jia, Evan Shelhamer, Jeff Donahue, Sergey Karayev, Jonathan Long, Ross Girshick, Sergio Guadarrama, Trevor Darrell, abs/1408.5093CoRRYangqing Jia, Evan Shelhamer, Jeff Donahue, Sergey Karayev, Jonathan Long, Ross Gir- shick, Sergio Guadarrama, and Trevor Darrell. Caffe: Convolutional architecture for fast feature embedding. CoRR, abs/1408.5093, 2014.\n\nDetecting change in data streams. Daniel Kifer, Shai Ben-David, Johannes Gehrke, Very Large Data Bases. Daniel Kifer, Shai Ben-David, and Johannes Gehrke. Detecting change in data streams. In Very Large Data Bases, pages 180-191, 2004.\n\nImagenet classification with deep convolutional neural networks. Alex Krizhevsky, Ilya Sutskever, Geoffrey Hinton, NIPS. Alex Krizhevsky, Ilya Sutskever, and Geoffrey Hinton. Imagenet classification with deep convolutional neural networks. In NIPS, pages 1097-1105, 2012.\n\nBayesian comparison of machine learning algorithms on single and multiple datasets. Alexandre Lacoste, François Laviolette, Mario Marchand, AISTATS. Alexandre Lacoste, François Laviolette, and Mario Marchand. Bayesian comparison of machine learning algorithms on single and multiple datasets. In AISTATS, pages 665- 675, 2012.\n\nGradient-based learning applied to document recognition. Y Lecun, L Bottou, Y Bengio, P Haffner, Proceedings of the IEEE. 8611Y. LeCun, L. Bottou, Y. Bengio, and P. Haffner. Gradient-based learning applied to docu- ment recognition. Proceedings of the IEEE, 86(11):2278-2324, November 1998.\n\nLocally aligned feature transforms across views. Wei Li, Xiaogang Wang, CVPR. Wei Li and Xiaogang Wang. Locally aligned feature transforms across views. In CVPR, pages 3594-3601, 2013.\n\nUnsupervised domain adaptation by domain invariant projection. Yujia Li, Kevin Swersky, Richard Zemel, NIPS 2014 Workshop on Transfer and Multitask Learning. Yujia Li, Kevin Swersky, and Richard Zemel. Unsupervised domain adaptation by domain invariant projection. In NIPS 2014 Workshop on Transfer and Multitask Learning, 2014.\n\nMulti-view object class detection with a 3d geometric model. Joerg Liebelt, Cordelia Schmid, CVPR. Joerg Liebelt and Cordelia Schmid. Multi-view object class detection with a 3d geometric model. In CVPR, 2010.\n\nPOP: person reidentification post-rank optimisation. Chunxiao Liu, Chen Change Loy, Shaogang Gong, Guijin Wang, ICCV. Chunxiao Liu, Chen Change Loy, Shaogang Gong, and Guijin Wang. POP: person re- identification post-rank optimisation. In ICCV, pages 441-448, 2013.\n\nLearning transferable features with deep adaptation networks. Mingsheng Long, Jianmin Wang, abs/1502.02791CoRRMingsheng Long and Jianmin Wang. Learning transferable features with deep adaptation networks. CoRR, abs/1502.02791, 2015.\n\nCross-domain person reidentification using domain adaptation ranking svms. Andy Jinhua Ma, Jiawei Li, C Pong, Ping Yuen, Li, IEEE Transactions on Image Processing. 245Andy Jinhua Ma, Jiawei Li, Pong C. Yuen, and Ping Li. Cross-domain person reidentifi- cation using domain adaptation ranking svms. IEEE Transactions on Image Processing, 24(5):1599-1613, 2015.\n\nDomain adaptation: Learning bounds and algorithms. Yishay Mansour, Mehryar Mohri, Afshin Rostamizadeh, COLT. Yishay Mansour, Mehryar Mohri, and Afshin Rostamizadeh. Domain adaptation: Learning bounds and algorithms. In COLT, 2009a.\n\nMultiple source adaptation and the rényi divergence. Yishay Mansour, Mehryar Mohri, Afshin Rostamizadeh, UAI. Yishay Mansour, Mehryar Mohri, and Afshin Rostamizadeh. Multiple source adaptation and the rényi divergence. In UAI, pages 367-374, 2009b.\n\nReading digits in natural images with unsupervised feature learning. Yuval Netzer, Tao Wang, Adam Coates, Alessandro Bissacco, Bo Wu, Andrew Y Ng, NIPS Workshop on Deep Learning and Unsupervised Feature Learning. Yuval Netzer, Tao Wang, Adam Coates, Alessandro Bissacco, Bo Wu, and Andrew Y. Ng. Reading digits in natural images with unsupervised feature learning. In NIPS Workshop on Deep Learning and Unsupervised Feature Learning, 2011.\n\nLearning and transferring mid-level image representations using convolutional neural networks. M Oquab, L Bottou, I Laptev, J Sivic, CVPR. M. Oquab, L. Bottou, I. Laptev, and J. Sivic. Learning and transferring mid-level image representations using convolutional neural networks. In CVPR, 2014.\n\nLearning to rank in person re-identification with metric ensembles. CoRR, abs/1503.01543. Sakrapee Paisitkriangkrai, Chunhua Shen, Anton Van Den, Hengel, Sakrapee Paisitkriangkrai, Chunhua Shen, and Anton van den Hengel. Learning to rank in person re-identification with metric ensembles. CoRR, abs/1503.01543, 2015. URL http://arxiv.org/abs/1503.01543.\n\nDomain adaptation via transfer component analysis. Ivor W Sinno Jialin Pan, James T Tsang, Qiang Kwok, Yang, IEEE Transactions on Neural Networks. 222Sinno Jialin Pan, Ivor W. Tsang, James T. Kwok, and Qiang Yang. Domain adaptation via transfer component analysis. IEEE Transactions on Neural Networks, 22(2):199-210, 2011.\n\nAdapting visual category models to new domains. Kate Saenko, Brian Kulis, Mario Fritz, Trevor Darrell, ECCV. Kate Saenko, Brian Kulis, Mario Fritz, and Trevor Darrell. Adapting visual category models to new domains. In ECCV, pages 213-226, 2010.\n\nDropout: A simple way to prevent neural networks from overfitting. Nitish Srivastava, Geoffrey Hinton, Alex Krizhevsky, Ilya Sutskever, Ruslan Salakhutdinov, The Journal of Machine Learning Research. 151Nitish Srivastava, Geoffrey Hinton, Alex Krizhevsky, Ilya Sutskever, and Ruslan Salakhut- dinov. Dropout: A simple way to prevent neural networks from overfitting. The Journal of Machine Learning Research, 15(1):1929-1958, 2014.\n\nBack to the future: Learning shape models from 3d CAD data. Michael Stark, Michael Goesele, Bernt Schiele, BMVC. Michael Stark, Michael Goesele, and Bernt Schiele. Back to the future: Learning shape models from 3d CAD data. In BMVC, pages 1-11, 2010.\n\nFrom virtual to reality: Fast adaptation of virtual object detectors to real domains. Baochen Sun, Kate Saenko, BMVC. Baochen Sun and Kate Saenko. From virtual to reality: Fast adaptation of virtual object detectors to real domains. In BMVC, 2014.\n\nDeep domain confusion: Maximizing for domain invariance. CoRR, abs/1412. Eric Tzeng, Judy Hoffman, Ning Zhang, Kate Saenko, Trevor Darrell, 3474Eric Tzeng, Judy Hoffman, Ning Zhang, Kate Saenko, and Trevor Darrell. Deep domain confusion: Maximizing for domain invariance. CoRR, abs/1412.3474, 2014. URL http: //arxiv.org/abs/1412.3474.\n\n. Laurens Van Der Maaten, -Sne Barnes-Hut, Corr, abs/1301.3342Laurens van der Maaten. Barnes-Hut-SNE. CoRR, abs/1301.3342, 2013. URL http: //arxiv.org/abs/1301.3342.\n\nVirtual and real world adaptationfor pedestrian detection. David Vázquez, Antonio Manuel López, Javier Marín, Daniel Ponsa, David Gerónimo Gomez, IEEE Transaction Pattern Analysis and Machine Intelligence. 364David Vázquez, Antonio Manuel López, Javier Marín, Daniel Ponsa, and David Gerónimo Gomez. Virtual and real world adaptationfor pedestrian detection. IEEE Transaction Pattern Analysis and Machine Intelligence, 36(4):797-809, 2014.\n\nExtracting and composing robust features with denoising autoencoders. Pascal Vincent, Hugo Larochelle, Yoshua Bengio, Pierre-Antoine Manzagol, ICML. Pascal Vincent, Hugo Larochelle, Yoshua Bengio, and Pierre-Antoine Manzagol. Extracting and composing robust features with denoising autoencoders. In ICML, pages 1096-1103, 2008.\n\nDeep metric learning for practical person reidentification. CoRR, abs/1407. Dong Yi, Zhen Lei, Stan Z Li, 4979Dong Yi, Zhen Lei, and Stan Z. Li. Deep metric learning for practical person re- identification. CoRR, abs/1407.4979, 2014. URL http://arxiv.org/abs/1407.4979.\n\nADADELTA: an adaptive learning rate method. CoRR, abs/1212. Matthew D Zeiler, 5701Matthew D. Zeiler. ADADELTA: an adaptive learning rate method. CoRR, abs/1212.5701, 2012. URL http://arxiv.org/abs/1212.5701.\n\nVisualizing and understanding convolutional networks. D Matthew, Rob Zeiler, Fergus, abs/1311.2901Matthew D. Zeiler and Rob Fergus. Visualizing and understanding convolutional networks. CoRR, abs/1311.2901, 2013. URL http://arxiv.org/abs/1311.2901.\n\nPerson re-identification via structured prediction. CoRR, abs/1406. Ziming Zhang, Venkatesh Saligrama, 4444Ziming Zhang and Venkatesh Saligrama. Person re-identification via structured prediction. CoRR, abs/1406.4444, 2014. URL http://arxiv.org/abs/1406.4444.\n\nPerson re-identification by saliency learning. CoRR, abs/1412.1908. Rui Zhao, Wanli Ouyang, Xiaogang Wang, Rui Zhao, Wanli Ouyang, and Xiaogang Wang. Person re-identification by saliency learning. CoRR, abs/1412.1908, 2014. URL http://arxiv.org/abs/1412.1908.\n\nCross validation framework to choose amongst models and datasets for transfer learning. Erheng Zhong, Wei Fan, Qiang Yang, Olivier Verscheure, Jiangtao Ren, Machine Learning and Knowledge Discovery in Databases. SpringerErheng Zhong, Wei Fan, Qiang Yang, Olivier Verscheure, and Jiangtao Ren. Cross valida- tion framework to choose amongst models and datasets for transfer learning. In Machine Learning and Knowledge Discovery in Databases, pages 547-562. Springer, 2010.\n", "annotations": {"author": "[{\"end\":87,\"start\":54},{\"end\":124,\"start\":88},{\"end\":169,\"start\":125},{\"end\":217,\"start\":170},{\"end\":272,\"start\":218},{\"end\":317,\"start\":273},{\"end\":357,\"start\":318},{\"end\":369,\"start\":358},{\"end\":383,\"start\":370},{\"end\":402,\"start\":384},{\"end\":419,\"start\":403},{\"end\":435,\"start\":420},{\"end\":484,\"start\":436},{\"end\":497,\"start\":485},{\"end\":513,\"start\":498},{\"end\":530,\"start\":514},{\"end\":537,\"start\":531},{\"end\":547,\"start\":538},{\"end\":555,\"start\":548},{\"end\":606,\"start\":556},{\"end\":827,\"start\":607},{\"end\":923,\"start\":828},{\"end\":963,\"start\":924}]", "publisher": null, "author_last_name": "[{\"end\":68,\"start\":63},{\"end\":99,\"start\":93},{\"end\":139,\"start\":132},{\"end\":185,\"start\":175},{\"end\":237,\"start\":227},{\"end\":287,\"start\":279},{\"end\":334,\"start\":325},{\"end\":368,\"start\":363},{\"end\":382,\"start\":377},{\"end\":401,\"start\":394},{\"end\":418,\"start\":411},{\"end\":434,\"start\":429},{\"end\":453,\"start\":445},{\"end\":496,\"start\":490},{\"end\":512,\"start\":505},{\"end\":529,\"start\":519},{\"end\":536,\"start\":531},{\"end\":546,\"start\":538},{\"end\":554,\"start\":548},{\"end\":605,\"start\":598}]", "author_first_name": "[{\"end\":62,\"start\":54},{\"end\":92,\"start\":88},{\"end\":131,\"start\":125},{\"end\":174,\"start\":170},{\"end\":226,\"start\":218},{\"end\":278,\"start\":273},{\"end\":324,\"start\":318},{\"end\":362,\"start\":358},{\"end\":376,\"start\":370},{\"end\":393,\"start\":384},{\"end\":410,\"start\":403},{\"end\":428,\"start\":420},{\"end\":444,\"start\":436},{\"end\":489,\"start\":485},{\"end\":504,\"start\":498},{\"end\":518,\"start\":514},{\"end\":597,\"start\":588}]", "author_affiliation": "[{\"end\":826,\"start\":608},{\"end\":922,\"start\":829},{\"end\":962,\"start\":925}]", "title": "[{\"end\":47,\"start\":1},{\"end\":1010,\"start\":964}]", "venue": "[{\"end\":1048,\"start\":1012}]", "abstract": "[{\"end\":2901,\"start\":1324}]", "bib_ref": "[{\"attributes\":{\"ref_id\":\"b38\"},\"end\":3773,\"start\":3747},{\"attributes\":{\"ref_id\":\"b50\"},\"end\":3792,\"start\":3773},{\"attributes\":{\"ref_id\":\"b54\"},\"end\":3813,\"start\":3792},{\"attributes\":{\"ref_id\":\"b51\"},\"end\":3834,\"start\":3813},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":5678,\"start\":5655},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":8142,\"start\":8124},{\"end\":8362,\"start\":8336},{\"attributes\":{\"ref_id\":\"b44\"},\"end\":8392,\"start\":8372},{\"attributes\":{\"ref_id\":\"b48\"},\"end\":8447,\"start\":8426},{\"attributes\":{\"ref_id\":\"b23\"},\"end\":8723,\"start\":8704},{\"attributes\":{\"ref_id\":\"b8\"},\"end\":9378,\"start\":9348},{\"attributes\":{\"ref_id\":\"b19\"},\"end\":9399,\"start\":9378},{\"attributes\":{\"ref_id\":\"b3\"},\"end\":9427,\"start\":9399},{\"attributes\":{\"ref_id\":\"b13\"},\"end\":9450,\"start\":9427},{\"attributes\":{\"ref_id\":\"b20\"},\"end\":9590,\"start\":9569},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":9653,\"start\":9634},{\"attributes\":{\"ref_id\":\"b55\"},\"end\":9811,\"start\":9789},{\"attributes\":{\"ref_id\":\"b30\"},\"end\":10082,\"start\":10063},{\"attributes\":{\"ref_id\":\"b47\"},\"end\":10216,\"start\":10198},{\"attributes\":{\"ref_id\":\"b25\"},\"end\":10237,\"start\":10216},{\"attributes\":{\"ref_id\":\"b3\"},\"end\":10265,\"start\":10237},{\"attributes\":{\"ref_id\":\"b30\"},\"end\":10509,\"start\":10490},{\"attributes\":{\"ref_id\":\"b21\"},\"end\":10537,\"start\":10519},{\"attributes\":{\"ref_id\":\"b17\"},\"end\":10564,\"start\":10542},{\"attributes\":{\"ref_id\":\"b25\"},\"end\":11107,\"start\":11085},{\"attributes\":{\"ref_id\":\"b21\"},\"end\":11125,\"start\":11107},{\"attributes\":{\"ref_id\":\"b11\"},\"end\":11216,\"start\":11196},{\"attributes\":{\"ref_id\":\"b20\"},\"end\":11442,\"start\":11422},{\"attributes\":{\"ref_id\":\"b20\"},\"end\":11684,\"start\":11663},{\"attributes\":{\"ref_id\":\"b11\"},\"end\":11704,\"start\":11684},{\"attributes\":{\"ref_id\":\"b58\"},\"end\":12407,\"start\":12382},{\"attributes\":{\"ref_id\":\"b45\"},\"end\":12426,\"start\":12407},{\"attributes\":{\"ref_id\":\"b2\"},\"end\":12447,\"start\":12426},{\"attributes\":{\"ref_id\":\"b24\"},\"end\":12651,\"start\":12627},{\"attributes\":{\"ref_id\":\"b40\"},\"end\":13451,\"start\":13431},{\"attributes\":{\"ref_id\":\"b40\"},\"end\":13868,\"start\":13848},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":14034,\"start\":14016},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":14161,\"start\":14139},{\"attributes\":{\"ref_id\":\"b29\"},\"end\":14268,\"start\":14246},{\"attributes\":{\"ref_id\":\"b18\"},\"end\":14765,\"start\":14738},{\"attributes\":{\"ref_id\":\"b18\"},\"end\":14814,\"start\":14788},{\"attributes\":{\"ref_id\":\"b0\"},\"end\":14881,\"start\":14861},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":16656,\"start\":16633},{\"end\":16680,\"start\":16656},{\"attributes\":{\"ref_id\":\"b19\"},\"end\":16701,\"start\":16680},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":16777,\"start\":16755},{\"attributes\":{\"ref_id\":\"b32\"},\"end\":16831,\"start\":16812},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":17013,\"start\":16990},{\"attributes\":{\"ref_id\":\"b32\"},\"end\":17032,\"start\":17013},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":17418,\"start\":17396},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":17796,\"start\":17777},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":18547,\"start\":18524},{\"attributes\":{\"ref_id\":\"b20\"},\"end\":19008,\"start\":18987},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":19026,\"start\":19008},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":19377,\"start\":19355},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":19728,\"start\":19709},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":20568,\"start\":20545},{\"attributes\":{\"ref_id\":\"b33\"},\"end\":29394,\"start\":29369},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":31582,\"start\":31562},{\"attributes\":{\"ref_id\":\"b57\"},\"end\":31609,\"start\":31595},{\"attributes\":{\"ref_id\":\"b61\"},\"end\":41307,\"start\":41288},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":43016,\"start\":42998},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":44440,\"start\":44422},{\"attributes\":{\"ref_id\":\"b34\"},\"end\":44902,\"start\":44880},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":45452,\"start\":45434},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":45909,\"start\":45891},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":46763,\"start\":46745},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":47690,\"start\":47668},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":49332,\"start\":49314},{\"attributes\":{\"ref_id\":\"b48\"},\"end\":50195,\"start\":50174},{\"attributes\":{\"ref_id\":\"b17\"},\"end\":50896,\"start\":50873},{\"attributes\":{\"ref_id\":\"b17\"},\"end\":51562,\"start\":51539},{\"attributes\":{\"ref_id\":\"b16\"},\"end\":51813,\"start\":51795},{\"attributes\":{\"ref_id\":\"b48\"},\"end\":52000,\"start\":51979},{\"end\":52581,\"start\":52580},{\"attributes\":{\"ref_id\":\"b49\"},\"end\":53096,\"start\":53072},{\"end\":55642,\"start\":55613},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":55815,\"start\":55792},{\"attributes\":{\"ref_id\":\"b17\"},\"end\":56739,\"start\":56716},{\"attributes\":{\"ref_id\":\"b44\"},\"end\":56993,\"start\":56972},{\"attributes\":{\"ref_id\":\"b17\"},\"end\":57743,\"start\":57720},{\"attributes\":{\"ref_id\":\"b28\"},\"end\":61500,\"start\":61479},{\"attributes\":{\"ref_id\":\"b40\"},\"end\":61520,\"start\":61500},{\"attributes\":{\"ref_id\":\"b11\"},\"end\":61873,\"start\":61853},{\"attributes\":{\"ref_id\":\"b40\"},\"end\":61895,\"start\":61875},{\"attributes\":{\"ref_id\":\"b39\"},\"end\":63551,\"start\":63534},{\"attributes\":{\"ref_id\":\"b59\"},\"end\":64766,\"start\":64739},{\"attributes\":{\"ref_id\":\"b60\"},\"end\":64784,\"start\":64766},{\"attributes\":{\"ref_id\":\"b46\"},\"end\":64814,\"start\":64784},{\"attributes\":{\"ref_id\":\"b41\"},\"end\":64857,\"start\":64841},{\"attributes\":{\"ref_id\":\"b56\"},\"end\":64974,\"start\":64957},{\"attributes\":{\"ref_id\":\"b41\"},\"end\":65230,\"start\":65214},{\"attributes\":{\"ref_id\":\"b27\"},\"end\":65265,\"start\":65244},{\"attributes\":{\"ref_id\":\"b26\"},\"end\":65292,\"start\":65273},{\"attributes\":{\"ref_id\":\"b36\"},\"end\":65318,\"start\":65299},{\"attributes\":{\"ref_id\":\"b41\"},\"end\":65428,\"start\":65412},{\"attributes\":{\"ref_id\":\"b41\"},\"end\":67092,\"start\":67076},{\"attributes\":{\"ref_id\":\"b56\"},\"end\":67397,\"start\":67380},{\"attributes\":{\"ref_id\":\"b56\"},\"end\":67426,\"start\":67410},{\"attributes\":{\"ref_id\":\"b56\"},\"end\":67913,\"start\":67897},{\"attributes\":{\"ref_id\":\"b56\"},\"end\":68518,\"start\":68502},{\"attributes\":{\"ref_id\":\"b56\"},\"end\":69209,\"start\":69193},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":71031,\"start\":71009},{\"attributes\":{\"ref_id\":\"b12\"},\"end\":74312,\"start\":74291},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":78170,\"start\":78147}]", "figure": "[{\"attributes\":{\"id\":\"fig_0\"},\"end\":72849,\"start\":72063},{\"attributes\":{\"id\":\"fig_1\"},\"end\":73722,\"start\":72850},{\"attributes\":{\"id\":\"fig_3\"},\"end\":73864,\"start\":73723},{\"attributes\":{\"id\":\"fig_4\"},\"end\":74228,\"start\":73865},{\"attributes\":{\"id\":\"fig_5\"},\"end\":74335,\"start\":74229},{\"attributes\":{\"id\":\"fig_6\"},\"end\":74488,\"start\":74336},{\"attributes\":{\"id\":\"fig_7\"},\"end\":75063,\"start\":74489},{\"attributes\":{\"id\":\"fig_8\"},\"end\":75256,\"start\":75064},{\"attributes\":{\"id\":\"fig_9\"},\"end\":75835,\"start\":75257},{\"attributes\":{\"id\":\"fig_10\"},\"end\":76100,\"start\":75836},{\"attributes\":{\"id\":\"tab_1\",\"type\":\"table\"},\"end\":76204,\"start\":76101},{\"attributes\":{\"id\":\"tab_2\",\"type\":\"table\"},\"end\":77322,\"start\":76205},{\"attributes\":{\"id\":\"tab_4\",\"type\":\"table\"},\"end\":77799,\"start\":77323},{\"attributes\":{\"id\":\"tab_5\",\"type\":\"table\"},\"end\":78129,\"start\":77800}]", "paragraph": "[{\"end\":4071,\"start\":2917},{\"end\":4942,\"start\":4073},{\"end\":5848,\"start\":4944},{\"end\":6730,\"start\":5850},{\"end\":7548,\"start\":6732},{\"end\":8182,\"start\":7550},{\"end\":8587,\"start\":8184},{\"end\":9146,\"start\":8589},{\"end\":9812,\"start\":9163},{\"end\":10630,\"start\":9814},{\"end\":12070,\"start\":10632},{\"end\":12585,\"start\":12072},{\"end\":13388,\"start\":12587},{\"end\":13810,\"start\":13390},{\"end\":14035,\"start\":13812},{\"end\":14674,\"start\":14037},{\"end\":15376,\"start\":14676},{\"end\":15788,\"start\":15398},{\"end\":16087,\"start\":15937},{\"end\":16177,\"start\":16124},{\"end\":17157,\"start\":16199},{\"end\":17577,\"start\":17235},{\"end\":17753,\"start\":17665},{\"end\":18095,\"start\":17772},{\"end\":18498,\"start\":18145},{\"end\":18575,\"start\":18521},{\"end\":18892,\"start\":18696},{\"end\":19299,\"start\":18894},{\"end\":19691,\"start\":19343},{\"end\":19775,\"start\":19693},{\"end\":19877,\"start\":19777},{\"end\":20099,\"start\":20070},{\"end\":20935,\"start\":20101},{\"end\":21403,\"start\":20981},{\"end\":21758,\"start\":21405},{\"end\":22189,\"start\":21805},{\"end\":22237,\"start\":22223},{\"end\":22392,\"start\":22263},{\"end\":22835,\"start\":22494},{\"end\":22988,\"start\":22890},{\"end\":23260,\"start\":23049},{\"end\":23557,\"start\":23262},{\"end\":23687,\"start\":23584},{\"end\":23690,\"start\":23689},{\"end\":23848,\"start\":23716},{\"end\":24389,\"start\":23950},{\"end\":24508,\"start\":24436},{\"end\":24740,\"start\":24602},{\"end\":25200,\"start\":24821},{\"end\":25782,\"start\":25351},{\"end\":25895,\"start\":25784},{\"end\":26101,\"start\":26018},{\"end\":26328,\"start\":26187},{\"end\":26392,\"start\":26330},{\"end\":26661,\"start\":26638},{\"end\":26687,\"start\":26663},{\"end\":27829,\"start\":27662},{\"end\":28951,\"start\":27831},{\"end\":29395,\"start\":28997},{\"end\":30074,\"start\":29397},{\"end\":30144,\"start\":30076},{\"end\":30346,\"start\":30269},{\"end\":30520,\"start\":30470},{\"end\":30754,\"start\":30616},{\"end\":32503,\"start\":30869},{\"end\":33078,\"start\":32505},{\"end\":33267,\"start\":33080},{\"end\":33480,\"start\":33299},{\"end\":34135,\"start\":33668},{\"end\":34319,\"start\":34151},{\"end\":34998,\"start\":34364},{\"end\":36667,\"start\":35031},{\"end\":37150,\"start\":36669},{\"end\":37992,\"start\":37152},{\"end\":38779,\"start\":37994},{\"end\":39862,\"start\":38781},{\"end\":40787,\"start\":39864},{\"end\":41341,\"start\":40830},{\"end\":42257,\"start\":41343},{\"end\":42670,\"start\":42259},{\"end\":43366,\"start\":42718},{\"end\":43673,\"start\":43368},{\"end\":44012,\"start\":43675},{\"end\":44259,\"start\":44014},{\"end\":44462,\"start\":44261},{\"end\":44656,\"start\":44464},{\"end\":45209,\"start\":44658},{\"end\":46354,\"start\":45256},{\"end\":47565,\"start\":46356},{\"end\":48662,\"start\":47584},{\"end\":49186,\"start\":48664},{\"end\":49855,\"start\":49188},{\"end\":50296,\"start\":49914},{\"end\":50748,\"start\":50310},{\"end\":51563,\"start\":50750},{\"end\":51953,\"start\":51565},{\"end\":52162,\"start\":51955},{\"end\":53177,\"start\":52207},{\"end\":53470,\"start\":53209},{\"end\":53717,\"start\":53497},{\"end\":53830,\"start\":53719},{\"end\":54639,\"start\":53861},{\"end\":55078,\"start\":54658},{\"end\":55253,\"start\":55080},{\"end\":55543,\"start\":55284},{\"end\":56813,\"start\":55545},{\"end\":57515,\"start\":56815},{\"end\":57971,\"start\":57517},{\"end\":59055,\"start\":57973},{\"end\":59785,\"start\":59057},{\"end\":60383,\"start\":59787},{\"end\":60942,\"start\":60385},{\"end\":61682,\"start\":60944},{\"end\":62411,\"start\":61684},{\"end\":62810,\"start\":62413},{\"end\":63595,\"start\":62876},{\"end\":64144,\"start\":63597},{\"end\":65176,\"start\":64146},{\"end\":66067,\"start\":65204},{\"end\":66436,\"start\":66069},{\"end\":67398,\"start\":66438},{\"end\":67791,\"start\":67400},{\"end\":68667,\"start\":67836},{\"end\":69085,\"start\":68669},{\"end\":69384,\"start\":69087},{\"end\":69994,\"start\":69386},{\"end\":70409,\"start\":70037},{\"end\":70932,\"start\":70424},{\"end\":71665,\"start\":70934},{\"end\":72062,\"start\":71667}]", "formula": "[{\"attributes\":{\"id\":\"formula_0\"},\"end\":15936,\"start\":15789},{\"attributes\":{\"id\":\"formula_1\"},\"end\":16123,\"start\":16088},{\"attributes\":{\"id\":\"formula_2\"},\"end\":17234,\"start\":17158},{\"attributes\":{\"id\":\"formula_3\"},\"end\":17664,\"start\":17578},{\"attributes\":{\"id\":\"formula_4\"},\"end\":18144,\"start\":18096},{\"attributes\":{\"id\":\"formula_5\"},\"end\":18520,\"start\":18499},{\"attributes\":{\"id\":\"formula_6\"},\"end\":18695,\"start\":18576},{\"attributes\":{\"id\":\"formula_7\"},\"end\":20069,\"start\":19878},{\"attributes\":{\"id\":\"formula_8\"},\"end\":22222,\"start\":22190},{\"attributes\":{\"id\":\"formula_9\"},\"end\":22262,\"start\":22238},{\"attributes\":{\"id\":\"formula_10\"},\"end\":22493,\"start\":22393},{\"attributes\":{\"id\":\"formula_11\"},\"end\":22889,\"start\":22836},{\"attributes\":{\"id\":\"formula_12\"},\"end\":23048,\"start\":22989},{\"attributes\":{\"id\":\"formula_13\"},\"end\":23583,\"start\":23558},{\"attributes\":{\"id\":\"formula_14\"},\"end\":23715,\"start\":23691},{\"attributes\":{\"id\":\"formula_15\"},\"end\":23949,\"start\":23849},{\"attributes\":{\"id\":\"formula_16\"},\"end\":24435,\"start\":24390},{\"attributes\":{\"id\":\"formula_17\"},\"end\":24601,\"start\":24509},{\"attributes\":{\"id\":\"formula_18\"},\"end\":24820,\"start\":24741},{\"attributes\":{\"id\":\"formula_19\"},\"end\":25286,\"start\":25201},{\"attributes\":{\"id\":\"formula_20\"},\"end\":25350,\"start\":25286},{\"attributes\":{\"id\":\"formula_21\"},\"end\":26017,\"start\":25896},{\"attributes\":{\"id\":\"formula_22\"},\"end\":26186,\"start\":26102},{\"attributes\":{\"id\":\"formula_23\"},\"end\":26637,\"start\":26393},{\"attributes\":{\"id\":\"formula_24\"},\"end\":27661,\"start\":26688},{\"attributes\":{\"id\":\"formula_25\"},\"end\":30268,\"start\":30145},{\"attributes\":{\"id\":\"formula_26\"},\"end\":30469,\"start\":30347},{\"attributes\":{\"id\":\"formula_27\"},\"end\":30574,\"start\":30521},{\"attributes\":{\"id\":\"formula_28\"},\"end\":30615,\"start\":30574},{\"attributes\":{\"id\":\"formula_29\"},\"end\":30803,\"start\":30755},{\"attributes\":{\"id\":\"formula_30\"},\"end\":30835,\"start\":30803},{\"attributes\":{\"id\":\"formula_31\"},\"end\":30868,\"start\":30835},{\"attributes\":{\"id\":\"formula_32\"},\"end\":33282,\"start\":33268},{\"attributes\":{\"id\":\"formula_33\"},\"end\":33298,\"start\":33282},{\"attributes\":{\"id\":\"formula_34\"},\"end\":33667,\"start\":33481},{\"attributes\":{\"id\":\"formula_35\"},\"end\":53496,\"start\":53471},{\"attributes\":{\"id\":\"formula_36\"},\"end\":53860,\"start\":53831}]", "table_ref": "[{\"attributes\":{\"ref_id\":\"tab_1\"},\"end\":43794,\"start\":43787},{\"attributes\":{\"ref_id\":\"tab_1\"},\"end\":44694,\"start\":44686},{\"attributes\":{\"ref_id\":\"tab_1\"},\"end\":44757,\"start\":44749},{\"attributes\":{\"ref_id\":\"tab_1\"},\"end\":47130,\"start\":47122},{\"attributes\":{\"ref_id\":\"tab_1\"},\"end\":47359,\"start\":47351},{\"attributes\":{\"ref_id\":\"tab_1\"},\"end\":48556,\"start\":48548},{\"attributes\":{\"ref_id\":\"tab_1\"},\"end\":49690,\"start\":49683},{\"attributes\":{\"ref_id\":\"tab_4\"},\"end\":55542,\"start\":55523},{\"attributes\":{\"ref_id\":\"tab_4\"},\"end\":59412,\"start\":59405},{\"attributes\":{\"ref_id\":\"tab_5\"},\"end\":62301,\"start\":62292}]", "section_header": "[{\"attributes\":{\"n\":\"1.\"},\"end\":2915,\"start\":2903},{\"attributes\":{\"n\":\"2.\"},\"end\":9161,\"start\":9149},{\"attributes\":{\"n\":\"3.\"},\"end\":15396,\"start\":15379},{\"attributes\":{\"n\":\"3.1\"},\"end\":16197,\"start\":16180},{\"attributes\":{\"n\":\"3.2\"},\"end\":17770,\"start\":17756},{\"attributes\":{\"n\":\"3.3\"},\"end\":19341,\"start\":19302},{\"attributes\":{\"n\":\"4.\"},\"end\":20979,\"start\":20938},{\"attributes\":{\"n\":\"4.1\"},\"end\":21803,\"start\":21761},{\"attributes\":{\"n\":\"4.2\"},\"end\":28995,\"start\":28954},{\"attributes\":{\"n\":\"5.\"},\"end\":34149,\"start\":34138},{\"attributes\":{\"n\":\"5.1\"},\"end\":34362,\"start\":34322},{\"attributes\":{\"n\":\"5.1.1\"},\"end\":35029,\"start\":35001},{\"attributes\":{\"n\":\"5.1.2\"},\"end\":40828,\"start\":40790},{\"attributes\":{\"n\":\"5.1.3\"},\"end\":42716,\"start\":42673},{\"attributes\":{\"n\":\"5.1.4\"},\"end\":45254,\"start\":45212},{\"attributes\":{\"n\":\"5.1.5\"},\"end\":47582,\"start\":47568},{\"attributes\":{\"n\":\"5.2\"},\"end\":49912,\"start\":49858},{\"attributes\":{\"n\":\"5.2.1\"},\"end\":50308,\"start\":50299},{\"attributes\":{\"n\":\"5.2.2\"},\"end\":52205,\"start\":52165},{\"attributes\":{\"n\":\"5.\"},\"end\":53207,\"start\":53180},{\"attributes\":{\"n\":\"5.2.3\"},\"end\":54656,\"start\":54642},{\"attributes\":{\"n\":\"5.2.4\"},\"end\":55282,\"start\":55256},{\"attributes\":{\"n\":\"5.3\"},\"end\":62874,\"start\":62813},{\"attributes\":{\"n\":\"5.3.1\"},\"end\":65202,\"start\":65179},{\"attributes\":{\"n\":\"5.3.2\"},\"end\":67834,\"start\":67794},{\"attributes\":{\"n\":\"5.3.3\"},\"end\":70035,\"start\":69997},{\"attributes\":{\"n\":\"6.\"},\"end\":70422,\"start\":70412},{\"end\":72074,\"start\":72064},{\"end\":72861,\"start\":72851},{\"end\":73734,\"start\":73724},{\"end\":74347,\"start\":74337},{\"end\":74503,\"start\":74490},{\"end\":75075,\"start\":75065},{\"end\":75279,\"start\":75258},{\"end\":75854,\"start\":75837},{\"end\":76111,\"start\":76102},{\"end\":77333,\"start\":77324},{\"end\":77810,\"start\":77801}]", "table": "[{\"end\":77322,\"start\":76260},{\"end\":77799,\"start\":77787},{\"end\":78129,\"start\":77812}]", "figure_caption": "[{\"end\":72849,\"start\":72076},{\"end\":73722,\"start\":72863},{\"end\":73864,\"start\":73736},{\"end\":74228,\"start\":73867},{\"end\":74335,\"start\":74231},{\"end\":74488,\"start\":74349},{\"end\":75063,\"start\":74505},{\"end\":75256,\"start\":75077},{\"end\":75835,\"start\":75283},{\"end\":76100,\"start\":75857},{\"end\":76204,\"start\":76113},{\"end\":76260,\"start\":76207},{\"end\":77787,\"start\":77335}]", "figure_ref": "[{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":6931,\"start\":6923},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":32658,\"start\":32650},{\"attributes\":{\"ref_id\":\"fig_1\"},\"end\":36455,\"start\":36447},{\"attributes\":{\"ref_id\":\"fig_1\"},\"end\":36714,\"start\":36706},{\"attributes\":{\"ref_id\":\"fig_3\"},\"end\":48400,\"start\":48391},{\"attributes\":{\"ref_id\":\"fig_3\"},\"end\":48683,\"start\":48674},{\"attributes\":{\"ref_id\":\"fig_3\"},\"end\":49205,\"start\":49196},{\"attributes\":{\"ref_id\":\"fig_6\"},\"end\":52456,\"start\":52448},{\"attributes\":{\"ref_id\":\"fig_7\"},\"end\":54817,\"start\":54809},{\"attributes\":{\"ref_id\":\"fig_1\"},\"end\":54889,\"start\":54881},{\"end\":55490,\"start\":55482},{\"attributes\":{\"ref_id\":\"fig_7\"},\"end\":56527,\"start\":56518},{\"end\":58671,\"start\":58663},{\"end\":60703,\"start\":60695},{\"attributes\":{\"ref_id\":\"fig_8\"},\"end\":66035,\"start\":66027},{\"end\":69734,\"start\":69726}]", "bib_author_first_name": "[{\"end\":79527,\"start\":79523},{\"end\":79542,\"start\":79536},{\"end\":79556,\"start\":79552},{\"end\":79577,\"start\":79569},{\"end\":79595,\"start\":79590},{\"end\":80050,\"start\":80045},{\"end\":80068,\"start\":80061},{\"end\":80084,\"start\":80076},{\"end\":80102,\"start\":80094},{\"end\":80346,\"start\":80341},{\"end\":80361,\"start\":80356},{\"end\":80381,\"start\":80372},{\"end\":80398,\"start\":80392},{\"end\":80400,\"start\":80399},{\"end\":80627,\"start\":80622},{\"end\":80653,\"start\":80644},{\"end\":80669,\"start\":80664},{\"end\":80671,\"start\":80670},{\"end\":80688,\"start\":80681},{\"end\":80953,\"start\":80949},{\"end\":80969,\"start\":80965},{\"end\":80983,\"start\":80979},{\"end\":81001,\"start\":80993},{\"end\":81216,\"start\":81212},{\"end\":81232,\"start\":81228},{\"end\":81246,\"start\":81242},{\"end\":81260,\"start\":81256},{\"end\":81278,\"start\":81270},{\"end\":81296,\"start\":81288},{\"end\":81304,\"start\":81297},{\"end\":81592,\"start\":81588},{\"end\":81606,\"start\":81602},{\"end\":81608,\"start\":81607},{\"end\":81627,\"start\":81619},{\"end\":81987,\"start\":81980},{\"end\":81989,\"start\":81988},{\"end\":82007,\"start\":82001},{\"end\":82022,\"start\":82017},{\"end\":82024,\"start\":82023},{\"end\":82042,\"start\":82032},{\"end\":82060,\"start\":82052},{\"end\":82081,\"start\":82072},{\"end\":82083,\"start\":82082},{\"end\":82483,\"start\":82476},{\"end\":82500,\"start\":82494},{\"end\":82801,\"start\":82795},{\"end\":82816,\"start\":82808},{\"end\":82822,\"start\":82817},{\"end\":82833,\"start\":82827},{\"end\":82835,\"start\":82834},{\"end\":82851,\"start\":82848},{\"end\":83115,\"start\":83110},{\"end\":83128,\"start\":83122},{\"end\":83143,\"start\":83136},{\"end\":83155,\"start\":83151},{\"end\":83157,\"start\":83156},{\"end\":83169,\"start\":83165},{\"end\":83185,\"start\":83176},{\"end\":83469,\"start\":83468},{\"end\":83479,\"start\":83478},{\"end\":83495,\"start\":83494},{\"end\":83816,\"start\":83813},{\"end\":83830,\"start\":83826},{\"end\":83846,\"start\":83838},{\"end\":83860,\"start\":83854},{\"end\":84149,\"start\":84142},{\"end\":84165,\"start\":84158},{\"end\":84436,\"start\":84432},{\"end\":84454,\"start\":84446},{\"end\":84465,\"start\":84460},{\"end\":84479,\"start\":84475},{\"end\":84493,\"start\":84489},{\"end\":84505,\"start\":84501},{\"end\":84519,\"start\":84513},{\"end\":84815,\"start\":84811},{\"end\":84827,\"start\":84823},{\"end\":84840,\"start\":84835},{\"end\":85180,\"start\":85173},{\"end\":85201,\"start\":85194},{\"end\":85218,\"start\":85209},{\"end\":85234,\"start\":85226},{\"end\":85546,\"start\":85540},{\"end\":85563,\"start\":85557},{\"end\":85577,\"start\":85573},{\"end\":85591,\"start\":85586},{\"end\":85817,\"start\":85809},{\"end\":85831,\"start\":85825},{\"end\":86123,\"start\":86117},{\"end\":86139,\"start\":86133},{\"end\":86157,\"start\":86149},{\"end\":86176,\"start\":86170},{\"end\":86478,\"start\":86472},{\"end\":86494,\"start\":86487},{\"end\":86509,\"start\":86503},{\"end\":86754,\"start\":86748},{\"end\":86765,\"start\":86761},{\"end\":86774,\"start\":86771},{\"end\":86787,\"start\":86780},{\"end\":87078,\"start\":87072},{\"end\":87092,\"start\":87085},{\"end\":87105,\"start\":87102},{\"end\":87350,\"start\":87342},{\"end\":87362,\"start\":87357},{\"end\":87382,\"start\":87373},{\"end\":87399,\"start\":87388},{\"end\":87556,\"start\":87553},{\"end\":87573,\"start\":87569},{\"end\":87594,\"start\":87589},{\"end\":87606,\"start\":87602},{\"end\":87616,\"start\":87611},{\"end\":87638,\"start\":87631},{\"end\":87651,\"start\":87646},{\"end\":87669,\"start\":87663},{\"end\":87936,\"start\":87926},{\"end\":87952,\"start\":87946},{\"end\":87961,\"start\":87957},{\"end\":88209,\"start\":88205},{\"end\":88221,\"start\":88216},{\"end\":88234,\"start\":88231},{\"end\":88645,\"start\":88639},{\"end\":88659,\"start\":88654},{\"end\":88675,\"start\":88670},{\"end\":88677,\"start\":88676},{\"end\":88689,\"start\":88684},{\"end\":88942,\"start\":88938},{\"end\":88956,\"start\":88952},{\"end\":88968,\"start\":88964},{\"end\":88986,\"start\":88978},{\"end\":88996,\"start\":88992},{\"end\":89011,\"start\":89005},{\"end\":89294,\"start\":89291},{\"end\":89311,\"start\":89302},{\"end\":89720,\"start\":89713},{\"end\":89737,\"start\":89728},{\"end\":89739,\"start\":89738},{\"end\":89753,\"start\":89747},{\"end\":89770,\"start\":89763},{\"end\":89772,\"start\":89771},{\"end\":89792,\"start\":89784},{\"end\":90060,\"start\":90052},{\"end\":90070,\"start\":90066},{\"end\":90086,\"start\":90082},{\"end\":90102,\"start\":90096},{\"end\":90120,\"start\":90112},{\"end\":90131,\"start\":90127},{\"end\":90148,\"start\":90142},{\"end\":90167,\"start\":90161},{\"end\":90455,\"start\":90449},{\"end\":90467,\"start\":90463},{\"end\":90487,\"start\":90479},{\"end\":90721,\"start\":90717},{\"end\":90738,\"start\":90734},{\"end\":90758,\"start\":90750},{\"end\":91018,\"start\":91009},{\"end\":91036,\"start\":91028},{\"end\":91054,\"start\":91049},{\"end\":91311,\"start\":91310},{\"end\":91320,\"start\":91319},{\"end\":91330,\"start\":91329},{\"end\":91340,\"start\":91339},{\"end\":91597,\"start\":91594},{\"end\":91610,\"start\":91602},{\"end\":91799,\"start\":91794},{\"end\":91809,\"start\":91804},{\"end\":91826,\"start\":91819},{\"end\":92127,\"start\":92122},{\"end\":92145,\"start\":92137},{\"end\":92333,\"start\":92325},{\"end\":92343,\"start\":92339},{\"end\":92350,\"start\":92344},{\"end\":92364,\"start\":92356},{\"end\":92377,\"start\":92371},{\"end\":92610,\"start\":92601},{\"end\":92624,\"start\":92617},{\"end\":92859,\"start\":92848},{\"end\":92870,\"start\":92864},{\"end\":92876,\"start\":92875},{\"end\":92887,\"start\":92883},{\"end\":93191,\"start\":93185},{\"end\":93208,\"start\":93201},{\"end\":93222,\"start\":93216},{\"end\":93426,\"start\":93420},{\"end\":93443,\"start\":93436},{\"end\":93457,\"start\":93451},{\"end\":93691,\"start\":93686},{\"end\":93703,\"start\":93700},{\"end\":93714,\"start\":93710},{\"end\":93733,\"start\":93723},{\"end\":93746,\"start\":93744},{\"end\":93757,\"start\":93751},{\"end\":93759,\"start\":93758},{\"end\":94154,\"start\":94153},{\"end\":94163,\"start\":94162},{\"end\":94173,\"start\":94172},{\"end\":94183,\"start\":94182},{\"end\":94452,\"start\":94444},{\"end\":94478,\"start\":94471},{\"end\":94490,\"start\":94485},{\"end\":94764,\"start\":94760},{\"end\":94766,\"start\":94765},{\"end\":94790,\"start\":94785},{\"end\":94792,\"start\":94791},{\"end\":94805,\"start\":94800},{\"end\":95086,\"start\":95082},{\"end\":95100,\"start\":95095},{\"end\":95113,\"start\":95108},{\"end\":95127,\"start\":95121},{\"end\":95354,\"start\":95348},{\"end\":95375,\"start\":95367},{\"end\":95388,\"start\":95384},{\"end\":95405,\"start\":95401},{\"end\":95423,\"start\":95417},{\"end\":95781,\"start\":95774},{\"end\":95796,\"start\":95789},{\"end\":95811,\"start\":95806},{\"end\":96059,\"start\":96052},{\"end\":96069,\"start\":96065},{\"end\":96292,\"start\":96288},{\"end\":96304,\"start\":96300},{\"end\":96318,\"start\":96314},{\"end\":96330,\"start\":96326},{\"end\":96345,\"start\":96339},{\"end\":96582,\"start\":96578},{\"end\":96783,\"start\":96778},{\"end\":96800,\"start\":96793},{\"end\":96807,\"start\":96801},{\"end\":96821,\"start\":96815},{\"end\":96835,\"start\":96829},{\"end\":96857,\"start\":96843},{\"end\":97236,\"start\":97230},{\"end\":97250,\"start\":97246},{\"end\":97269,\"start\":97263},{\"end\":97292,\"start\":97278},{\"end\":97569,\"start\":97565},{\"end\":97578,\"start\":97574},{\"end\":97588,\"start\":97584},{\"end\":97590,\"start\":97589},{\"end\":97827,\"start\":97820},{\"end\":97829,\"start\":97828},{\"end\":98024,\"start\":98023},{\"end\":98037,\"start\":98034},{\"end\":98293,\"start\":98287},{\"end\":98310,\"start\":98301},{\"end\":98551,\"start\":98548},{\"end\":98563,\"start\":98558},{\"end\":98580,\"start\":98572},{\"end\":98835,\"start\":98829},{\"end\":98846,\"start\":98843},{\"end\":98857,\"start\":98852},{\"end\":98871,\"start\":98864},{\"end\":98892,\"start\":98884}]", "bib_author_last_name": "[{\"end\":79534,\"start\":79528},{\"end\":79550,\"start\":79543},{\"end\":79567,\"start\":79557},{\"end\":79588,\"start\":79578},{\"end\":79604,\"start\":79596},{\"end\":80059,\"start\":80051},{\"end\":80074,\"start\":80069},{\"end\":80092,\"start\":80085},{\"end\":80108,\"start\":80103},{\"end\":80354,\"start\":80347},{\"end\":80370,\"start\":80362},{\"end\":80390,\"start\":80382},{\"end\":80410,\"start\":80401},{\"end\":80642,\"start\":80628},{\"end\":80662,\"start\":80654},{\"end\":80679,\"start\":80672},{\"end\":80695,\"start\":80689},{\"end\":80705,\"start\":80697},{\"end\":80963,\"start\":80954},{\"end\":80977,\"start\":80970},{\"end\":80991,\"start\":80984},{\"end\":81009,\"start\":81002},{\"end\":81226,\"start\":81217},{\"end\":81240,\"start\":81233},{\"end\":81254,\"start\":81247},{\"end\":81268,\"start\":81261},{\"end\":81286,\"start\":81279},{\"end\":81312,\"start\":81305},{\"end\":81600,\"start\":81593},{\"end\":81617,\"start\":81609},{\"end\":81635,\"start\":81628},{\"end\":81999,\"start\":81990},{\"end\":82015,\"start\":82008},{\"end\":82030,\"start\":82025},{\"end\":82050,\"start\":82043},{\"end\":82070,\"start\":82061},{\"end\":82089,\"start\":82084},{\"end\":82492,\"start\":82484},{\"end\":82511,\"start\":82501},{\"end\":82806,\"start\":82802},{\"end\":82825,\"start\":82823},{\"end\":82846,\"start\":82836},{\"end\":82855,\"start\":82852},{\"end\":83120,\"start\":83116},{\"end\":83134,\"start\":83129},{\"end\":83149,\"start\":83144},{\"end\":83163,\"start\":83158},{\"end\":83174,\"start\":83170},{\"end\":83189,\"start\":83186},{\"end\":83476,\"start\":83470},{\"end\":83492,\"start\":83480},{\"end\":83503,\"start\":83496},{\"end\":83824,\"start\":83817},{\"end\":83836,\"start\":83831},{\"end\":83852,\"start\":83847},{\"end\":83872,\"start\":83861},{\"end\":84156,\"start\":84150},{\"end\":84171,\"start\":84166},{\"end\":84444,\"start\":84437},{\"end\":84458,\"start\":84455},{\"end\":84473,\"start\":84466},{\"end\":84487,\"start\":84480},{\"end\":84499,\"start\":84494},{\"end\":84511,\"start\":84506},{\"end\":84527,\"start\":84520},{\"end\":84821,\"start\":84816},{\"end\":84833,\"start\":84828},{\"end\":84847,\"start\":84841},{\"end\":85192,\"start\":85181},{\"end\":85207,\"start\":85202},{\"end\":85224,\"start\":85219},{\"end\":85239,\"start\":85235},{\"end\":85244,\"start\":85241},{\"end\":85555,\"start\":85547},{\"end\":85571,\"start\":85564},{\"end\":85584,\"start\":85578},{\"end\":85602,\"start\":85592},{\"end\":85823,\"start\":85818},{\"end\":85841,\"start\":85832},{\"end\":86131,\"start\":86124},{\"end\":86147,\"start\":86140},{\"end\":86168,\"start\":86158},{\"end\":86184,\"start\":86177},{\"end\":86485,\"start\":86479},{\"end\":86501,\"start\":86495},{\"end\":86516,\"start\":86510},{\"end\":86759,\"start\":86755},{\"end\":86769,\"start\":86766},{\"end\":86778,\"start\":86775},{\"end\":86795,\"start\":86788},{\"end\":87083,\"start\":87079},{\"end\":87100,\"start\":87093},{\"end\":87109,\"start\":87106},{\"end\":87355,\"start\":87351},{\"end\":87371,\"start\":87363},{\"end\":87386,\"start\":87383},{\"end\":87403,\"start\":87400},{\"end\":87567,\"start\":87557},{\"end\":87587,\"start\":87574},{\"end\":87600,\"start\":87595},{\"end\":87609,\"start\":87607},{\"end\":87629,\"start\":87617},{\"end\":87644,\"start\":87639},{\"end\":87661,\"start\":87652},{\"end\":87676,\"start\":87670},{\"end\":87944,\"start\":87937},{\"end\":87955,\"start\":87953},{\"end\":87971,\"start\":87962},{\"end\":88214,\"start\":88210},{\"end\":88229,\"start\":88222},{\"end\":88238,\"start\":88235},{\"end\":88652,\"start\":88646},{\"end\":88668,\"start\":88660},{\"end\":88682,\"start\":88678},{\"end\":88697,\"start\":88690},{\"end\":88950,\"start\":88943},{\"end\":88962,\"start\":88957},{\"end\":88976,\"start\":88969},{\"end\":88990,\"start\":88987},{\"end\":89003,\"start\":88997},{\"end\":89019,\"start\":89012},{\"end\":89300,\"start\":89295},{\"end\":89317,\"start\":89312},{\"end\":89726,\"start\":89721},{\"end\":89745,\"start\":89740},{\"end\":89761,\"start\":89754},{\"end\":89782,\"start\":89773},{\"end\":89802,\"start\":89793},{\"end\":90064,\"start\":90061},{\"end\":90080,\"start\":90071},{\"end\":90094,\"start\":90087},{\"end\":90110,\"start\":90103},{\"end\":90125,\"start\":90121},{\"end\":90140,\"start\":90132},{\"end\":90159,\"start\":90149},{\"end\":90175,\"start\":90168},{\"end\":90461,\"start\":90456},{\"end\":90477,\"start\":90468},{\"end\":90494,\"start\":90488},{\"end\":90732,\"start\":90722},{\"end\":90748,\"start\":90739},{\"end\":90765,\"start\":90759},{\"end\":91026,\"start\":91019},{\"end\":91047,\"start\":91037},{\"end\":91063,\"start\":91055},{\"end\":91317,\"start\":91312},{\"end\":91327,\"start\":91321},{\"end\":91337,\"start\":91331},{\"end\":91348,\"start\":91341},{\"end\":91600,\"start\":91598},{\"end\":91615,\"start\":91611},{\"end\":91802,\"start\":91800},{\"end\":91817,\"start\":91810},{\"end\":91832,\"start\":91827},{\"end\":92135,\"start\":92128},{\"end\":92152,\"start\":92146},{\"end\":92337,\"start\":92334},{\"end\":92354,\"start\":92351},{\"end\":92369,\"start\":92365},{\"end\":92382,\"start\":92378},{\"end\":92615,\"start\":92611},{\"end\":92629,\"start\":92625},{\"end\":92862,\"start\":92860},{\"end\":92873,\"start\":92871},{\"end\":92881,\"start\":92877},{\"end\":92892,\"start\":92888},{\"end\":92896,\"start\":92894},{\"end\":93199,\"start\":93192},{\"end\":93214,\"start\":93209},{\"end\":93235,\"start\":93223},{\"end\":93434,\"start\":93427},{\"end\":93449,\"start\":93444},{\"end\":93470,\"start\":93458},{\"end\":93698,\"start\":93692},{\"end\":93708,\"start\":93704},{\"end\":93721,\"start\":93715},{\"end\":93742,\"start\":93734},{\"end\":93749,\"start\":93747},{\"end\":93762,\"start\":93760},{\"end\":94160,\"start\":94155},{\"end\":94170,\"start\":94164},{\"end\":94180,\"start\":94174},{\"end\":94189,\"start\":94184},{\"end\":94469,\"start\":94453},{\"end\":94483,\"start\":94479},{\"end\":94498,\"start\":94491},{\"end\":94506,\"start\":94500},{\"end\":94783,\"start\":94767},{\"end\":94798,\"start\":94793},{\"end\":94810,\"start\":94806},{\"end\":94816,\"start\":94812},{\"end\":95093,\"start\":95087},{\"end\":95106,\"start\":95101},{\"end\":95119,\"start\":95114},{\"end\":95135,\"start\":95128},{\"end\":95365,\"start\":95355},{\"end\":95382,\"start\":95376},{\"end\":95399,\"start\":95389},{\"end\":95415,\"start\":95406},{\"end\":95437,\"start\":95424},{\"end\":95787,\"start\":95782},{\"end\":95804,\"start\":95797},{\"end\":95819,\"start\":95812},{\"end\":96063,\"start\":96060},{\"end\":96076,\"start\":96070},{\"end\":96298,\"start\":96293},{\"end\":96312,\"start\":96305},{\"end\":96324,\"start\":96319},{\"end\":96337,\"start\":96331},{\"end\":96353,\"start\":96346},{\"end\":96576,\"start\":96554},{\"end\":96593,\"start\":96583},{\"end\":96599,\"start\":96595},{\"end\":96791,\"start\":96784},{\"end\":96813,\"start\":96808},{\"end\":96827,\"start\":96822},{\"end\":96841,\"start\":96836},{\"end\":96863,\"start\":96858},{\"end\":97244,\"start\":97237},{\"end\":97261,\"start\":97251},{\"end\":97276,\"start\":97270},{\"end\":97301,\"start\":97293},{\"end\":97572,\"start\":97570},{\"end\":97582,\"start\":97579},{\"end\":97593,\"start\":97591},{\"end\":97836,\"start\":97830},{\"end\":98032,\"start\":98025},{\"end\":98044,\"start\":98038},{\"end\":98052,\"start\":98046},{\"end\":98299,\"start\":98294},{\"end\":98320,\"start\":98311},{\"end\":98556,\"start\":98552},{\"end\":98570,\"start\":98564},{\"end\":98585,\"start\":98581},{\"end\":98841,\"start\":98836},{\"end\":98850,\"start\":98847},{\"end\":98862,\"start\":98858},{\"end\":98882,\"start\":98872},{\"end\":98896,\"start\":98893}]", "bib_entry": "[{\"attributes\":{\"id\":\"b0\",\"matched_paper_id\":18126905},\"end\":79928,\"start\":79487},{\"attributes\":{\"id\":\"b1\"},\"end\":80305,\"start\":79930},{\"attributes\":{\"id\":\"b2\",\"matched_paper_id\":2836489},\"end\":80557,\"start\":80307},{\"attributes\":{\"id\":\"b3\",\"matched_paper_id\":12271421},\"end\":80896,\"start\":80559},{\"attributes\":{\"id\":\"b4\",\"matched_paper_id\":10908021},\"end\":81165,\"start\":80898},{\"attributes\":{\"id\":\"b5\",\"matched_paper_id\":8577357},\"end\":81527,\"start\":81167},{\"attributes\":{\"id\":\"b6\",\"matched_paper_id\":15978939},\"end\":81903,\"start\":81529},{\"attributes\":{\"id\":\"b7\",\"matched_paper_id\":13341746},\"end\":82317,\"start\":81905},{\"attributes\":{\"id\":\"b8\"},\"end\":82734,\"start\":82319},{\"attributes\":{\"id\":\"b9\",\"matched_paper_id\":10686834},\"end\":83020,\"start\":82736},{\"attributes\":{\"id\":\"b10\",\"matched_paper_id\":7530403},\"end\":83390,\"start\":83022},{\"attributes\":{\"id\":\"b11\",\"matched_paper_id\":11690995},\"end\":83745,\"start\":83392},{\"attributes\":{\"id\":\"b12\",\"matched_paper_id\":14628685},\"end\":84058,\"start\":83747},{\"attributes\":{\"id\":\"b13\",\"matched_paper_id\":17840600},\"end\":84351,\"start\":84060},{\"attributes\":{\"id\":\"b14\",\"matched_paper_id\":6161478},\"end\":84731,\"start\":84353},{\"attributes\":{\"id\":\"b15\"},\"end\":85116,\"start\":84733},{\"attributes\":{\"id\":\"b16\",\"matched_paper_id\":3116168},\"end\":85474,\"start\":85118},{\"attributes\":{\"id\":\"b17\",\"matched_paper_id\":9440223},\"end\":85756,\"start\":85476},{\"attributes\":{\"id\":\"b18\",\"matched_paper_id\":6755881},\"end\":86026,\"start\":85758},{\"attributes\":{\"id\":\"b19\",\"matched_paper_id\":13474174},\"end\":86384,\"start\":86028},{\"attributes\":{\"id\":\"b20\",\"matched_paper_id\":18235792},\"end\":86689,\"start\":86386},{\"attributes\":{\"id\":\"b21\",\"matched_paper_id\":6742009},\"end\":86946,\"start\":86691},{\"attributes\":{\"id\":\"b22\",\"matched_paper_id\":16169580},\"end\":87315,\"start\":86948},{\"attributes\":{\"id\":\"b23\"},\"end\":87522,\"start\":87317},{\"attributes\":{\"id\":\"b24\",\"matched_paper_id\":1033682},\"end\":87856,\"start\":87524},{\"attributes\":{\"id\":\"b25\",\"matched_paper_id\":10337178},\"end\":88128,\"start\":87858},{\"attributes\":{\"id\":\"b26\",\"matched_paper_id\":15225312},\"end\":88562,\"start\":88130},{\"attributes\":{\"id\":\"b27\",\"matched_paper_id\":14627589},\"end\":88859,\"start\":88564},{\"attributes\":{\"id\":\"b28\"},\"end\":89235,\"start\":88861},{\"attributes\":{\"id\":\"b29\",\"matched_paper_id\":2308679},\"end\":89659,\"start\":89237},{\"attributes\":{\"id\":\"b30\",\"matched_paper_id\":70831},\"end\":89988,\"start\":89661},{\"attributes\":{\"doi\":\"abs/1408.5093\",\"id\":\"b31\"},\"end\":90413,\"start\":89990},{\"attributes\":{\"id\":\"b32\",\"matched_paper_id\":52800392},\"end\":90650,\"start\":90415},{\"attributes\":{\"id\":\"b33\",\"matched_paper_id\":195908774},\"end\":90923,\"start\":90652},{\"attributes\":{\"id\":\"b34\",\"matched_paper_id\":16227400},\"end\":91251,\"start\":90925},{\"attributes\":{\"id\":\"b35\",\"matched_paper_id\":14542261},\"end\":91543,\"start\":91253},{\"attributes\":{\"id\":\"b36\",\"matched_paper_id\":4149132},\"end\":91729,\"start\":91545},{\"attributes\":{\"id\":\"b37\",\"matched_paper_id\":12271421},\"end\":92059,\"start\":91731},{\"attributes\":{\"id\":\"b38\",\"matched_paper_id\":1769372},\"end\":92270,\"start\":92061},{\"attributes\":{\"id\":\"b39\",\"matched_paper_id\":8223206},\"end\":92537,\"start\":92272},{\"attributes\":{\"doi\":\"abs/1502.02791\",\"id\":\"b40\"},\"end\":92771,\"start\":92539},{\"attributes\":{\"id\":\"b41\",\"matched_paper_id\":6746533},\"end\":93132,\"start\":92773},{\"attributes\":{\"id\":\"b42\",\"matched_paper_id\":6178817},\"end\":93365,\"start\":93134},{\"attributes\":{\"id\":\"b43\",\"matched_paper_id\":6907693},\"end\":93615,\"start\":93367},{\"attributes\":{\"id\":\"b44\",\"matched_paper_id\":16852518},\"end\":94056,\"start\":93617},{\"attributes\":{\"id\":\"b45\",\"matched_paper_id\":206592191},\"end\":94352,\"start\":94058},{\"attributes\":{\"id\":\"b46\"},\"end\":94707,\"start\":94354},{\"attributes\":{\"id\":\"b47\",\"matched_paper_id\":788838},\"end\":95032,\"start\":94709},{\"attributes\":{\"id\":\"b48\",\"matched_paper_id\":7534823},\"end\":95279,\"start\":95034},{\"attributes\":{\"id\":\"b49\",\"matched_paper_id\":6844431},\"end\":95712,\"start\":95281},{\"attributes\":{\"id\":\"b50\",\"matched_paper_id\":6284859},\"end\":95964,\"start\":95714},{\"attributes\":{\"id\":\"b51\",\"matched_paper_id\":6018652},\"end\":96213,\"start\":95966},{\"attributes\":{\"id\":\"b52\"},\"end\":96550,\"start\":96215},{\"attributes\":{\"doi\":\"abs/1301.3342\",\"id\":\"b53\"},\"end\":96717,\"start\":96552},{\"attributes\":{\"id\":\"b54\",\"matched_paper_id\":27580432},\"end\":97158,\"start\":96719},{\"attributes\":{\"id\":\"b55\",\"matched_paper_id\":207168299},\"end\":97487,\"start\":97160},{\"attributes\":{\"id\":\"b56\"},\"end\":97758,\"start\":97489},{\"attributes\":{\"id\":\"b57\"},\"end\":97967,\"start\":97760},{\"attributes\":{\"doi\":\"abs/1311.2901\",\"id\":\"b58\"},\"end\":98217,\"start\":97969},{\"attributes\":{\"id\":\"b59\"},\"end\":98478,\"start\":98219},{\"attributes\":{\"id\":\"b60\"},\"end\":98739,\"start\":98480},{\"attributes\":{\"id\":\"b61\",\"matched_paper_id\":13322062},\"end\":99212,\"start\":98741}]", "bib_title": "[{\"end\":79521,\"start\":79487},{\"end\":80339,\"start\":80307},{\"end\":80620,\"start\":80559},{\"end\":80947,\"start\":80898},{\"end\":81210,\"start\":81167},{\"end\":81586,\"start\":81529},{\"end\":81978,\"start\":81905},{\"end\":82793,\"start\":82736},{\"end\":83108,\"start\":83022},{\"end\":83466,\"start\":83392},{\"end\":83811,\"start\":83747},{\"end\":84140,\"start\":84060},{\"end\":84430,\"start\":84353},{\"end\":85171,\"start\":85118},{\"end\":85538,\"start\":85476},{\"end\":85807,\"start\":85758},{\"end\":86115,\"start\":86028},{\"end\":86470,\"start\":86386},{\"end\":86746,\"start\":86691},{\"end\":87070,\"start\":86948},{\"end\":87551,\"start\":87524},{\"end\":87924,\"start\":87858},{\"end\":88203,\"start\":88130},{\"end\":88637,\"start\":88564},{\"end\":89289,\"start\":89237},{\"end\":89711,\"start\":89661},{\"end\":90447,\"start\":90415},{\"end\":90715,\"start\":90652},{\"end\":91007,\"start\":90925},{\"end\":91308,\"start\":91253},{\"end\":91592,\"start\":91545},{\"end\":91792,\"start\":91731},{\"end\":92120,\"start\":92061},{\"end\":92323,\"start\":92272},{\"end\":92846,\"start\":92773},{\"end\":93183,\"start\":93134},{\"end\":93418,\"start\":93367},{\"end\":93684,\"start\":93617},{\"end\":94151,\"start\":94058},{\"end\":94758,\"start\":94709},{\"end\":95080,\"start\":95034},{\"end\":95346,\"start\":95281},{\"end\":95772,\"start\":95714},{\"end\":96050,\"start\":95966},{\"end\":96776,\"start\":96719},{\"end\":97228,\"start\":97160},{\"end\":98827,\"start\":98741}]", "bib_author": "[{\"end\":79536,\"start\":79523},{\"end\":79552,\"start\":79536},{\"end\":79569,\"start\":79552},{\"end\":79590,\"start\":79569},{\"end\":79606,\"start\":79590},{\"end\":80061,\"start\":80045},{\"end\":80076,\"start\":80061},{\"end\":80094,\"start\":80076},{\"end\":80110,\"start\":80094},{\"end\":80356,\"start\":80341},{\"end\":80372,\"start\":80356},{\"end\":80392,\"start\":80372},{\"end\":80412,\"start\":80392},{\"end\":80644,\"start\":80622},{\"end\":80664,\"start\":80644},{\"end\":80681,\"start\":80664},{\"end\":80697,\"start\":80681},{\"end\":80707,\"start\":80697},{\"end\":80965,\"start\":80949},{\"end\":80979,\"start\":80965},{\"end\":80993,\"start\":80979},{\"end\":81011,\"start\":80993},{\"end\":81228,\"start\":81212},{\"end\":81242,\"start\":81228},{\"end\":81256,\"start\":81242},{\"end\":81270,\"start\":81256},{\"end\":81288,\"start\":81270},{\"end\":81314,\"start\":81288},{\"end\":81602,\"start\":81588},{\"end\":81619,\"start\":81602},{\"end\":81637,\"start\":81619},{\"end\":82001,\"start\":81980},{\"end\":82017,\"start\":82001},{\"end\":82032,\"start\":82017},{\"end\":82052,\"start\":82032},{\"end\":82072,\"start\":82052},{\"end\":82091,\"start\":82072},{\"end\":82494,\"start\":82476},{\"end\":82513,\"start\":82494},{\"end\":82808,\"start\":82795},{\"end\":82827,\"start\":82808},{\"end\":82848,\"start\":82827},{\"end\":82857,\"start\":82848},{\"end\":83122,\"start\":83110},{\"end\":83136,\"start\":83122},{\"end\":83151,\"start\":83136},{\"end\":83165,\"start\":83151},{\"end\":83176,\"start\":83165},{\"end\":83191,\"start\":83176},{\"end\":83478,\"start\":83468},{\"end\":83494,\"start\":83478},{\"end\":83505,\"start\":83494},{\"end\":83826,\"start\":83813},{\"end\":83838,\"start\":83826},{\"end\":83854,\"start\":83838},{\"end\":83874,\"start\":83854},{\"end\":84158,\"start\":84142},{\"end\":84173,\"start\":84158},{\"end\":84446,\"start\":84432},{\"end\":84460,\"start\":84446},{\"end\":84475,\"start\":84460},{\"end\":84489,\"start\":84475},{\"end\":84501,\"start\":84489},{\"end\":84513,\"start\":84501},{\"end\":84529,\"start\":84513},{\"end\":84823,\"start\":84811},{\"end\":84835,\"start\":84823},{\"end\":84849,\"start\":84835},{\"end\":85194,\"start\":85173},{\"end\":85209,\"start\":85194},{\"end\":85226,\"start\":85209},{\"end\":85241,\"start\":85226},{\"end\":85246,\"start\":85241},{\"end\":85557,\"start\":85540},{\"end\":85573,\"start\":85557},{\"end\":85586,\"start\":85573},{\"end\":85604,\"start\":85586},{\"end\":85825,\"start\":85809},{\"end\":85843,\"start\":85825},{\"end\":86133,\"start\":86117},{\"end\":86149,\"start\":86133},{\"end\":86170,\"start\":86149},{\"end\":86186,\"start\":86170},{\"end\":86487,\"start\":86472},{\"end\":86503,\"start\":86487},{\"end\":86518,\"start\":86503},{\"end\":86761,\"start\":86748},{\"end\":86771,\"start\":86761},{\"end\":86780,\"start\":86771},{\"end\":86797,\"start\":86780},{\"end\":87085,\"start\":87072},{\"end\":87102,\"start\":87085},{\"end\":87111,\"start\":87102},{\"end\":87357,\"start\":87342},{\"end\":87373,\"start\":87357},{\"end\":87388,\"start\":87373},{\"end\":87405,\"start\":87388},{\"end\":87569,\"start\":87553},{\"end\":87589,\"start\":87569},{\"end\":87602,\"start\":87589},{\"end\":87611,\"start\":87602},{\"end\":87631,\"start\":87611},{\"end\":87646,\"start\":87631},{\"end\":87663,\"start\":87646},{\"end\":87678,\"start\":87663},{\"end\":87946,\"start\":87926},{\"end\":87957,\"start\":87946},{\"end\":87973,\"start\":87957},{\"end\":88216,\"start\":88205},{\"end\":88231,\"start\":88216},{\"end\":88240,\"start\":88231},{\"end\":88654,\"start\":88639},{\"end\":88670,\"start\":88654},{\"end\":88684,\"start\":88670},{\"end\":88699,\"start\":88684},{\"end\":88952,\"start\":88938},{\"end\":88964,\"start\":88952},{\"end\":88978,\"start\":88964},{\"end\":88992,\"start\":88978},{\"end\":89005,\"start\":88992},{\"end\":89021,\"start\":89005},{\"end\":89302,\"start\":89291},{\"end\":89319,\"start\":89302},{\"end\":89728,\"start\":89713},{\"end\":89747,\"start\":89728},{\"end\":89763,\"start\":89747},{\"end\":89784,\"start\":89763},{\"end\":89804,\"start\":89784},{\"end\":90066,\"start\":90052},{\"end\":90082,\"start\":90066},{\"end\":90096,\"start\":90082},{\"end\":90112,\"start\":90096},{\"end\":90127,\"start\":90112},{\"end\":90142,\"start\":90127},{\"end\":90161,\"start\":90142},{\"end\":90177,\"start\":90161},{\"end\":90463,\"start\":90449},{\"end\":90479,\"start\":90463},{\"end\":90496,\"start\":90479},{\"end\":90734,\"start\":90717},{\"end\":90750,\"start\":90734},{\"end\":90767,\"start\":90750},{\"end\":91028,\"start\":91009},{\"end\":91049,\"start\":91028},{\"end\":91065,\"start\":91049},{\"end\":91319,\"start\":91310},{\"end\":91329,\"start\":91319},{\"end\":91339,\"start\":91329},{\"end\":91350,\"start\":91339},{\"end\":91602,\"start\":91594},{\"end\":91617,\"start\":91602},{\"end\":91804,\"start\":91794},{\"end\":91819,\"start\":91804},{\"end\":91834,\"start\":91819},{\"end\":92137,\"start\":92122},{\"end\":92154,\"start\":92137},{\"end\":92339,\"start\":92325},{\"end\":92356,\"start\":92339},{\"end\":92371,\"start\":92356},{\"end\":92384,\"start\":92371},{\"end\":92617,\"start\":92601},{\"end\":92631,\"start\":92617},{\"end\":92864,\"start\":92848},{\"end\":92875,\"start\":92864},{\"end\":92883,\"start\":92875},{\"end\":92894,\"start\":92883},{\"end\":92898,\"start\":92894},{\"end\":93201,\"start\":93185},{\"end\":93216,\"start\":93201},{\"end\":93237,\"start\":93216},{\"end\":93436,\"start\":93420},{\"end\":93451,\"start\":93436},{\"end\":93472,\"start\":93451},{\"end\":93700,\"start\":93686},{\"end\":93710,\"start\":93700},{\"end\":93723,\"start\":93710},{\"end\":93744,\"start\":93723},{\"end\":93751,\"start\":93744},{\"end\":93764,\"start\":93751},{\"end\":94162,\"start\":94153},{\"end\":94172,\"start\":94162},{\"end\":94182,\"start\":94172},{\"end\":94191,\"start\":94182},{\"end\":94471,\"start\":94444},{\"end\":94485,\"start\":94471},{\"end\":94500,\"start\":94485},{\"end\":94508,\"start\":94500},{\"end\":94785,\"start\":94760},{\"end\":94800,\"start\":94785},{\"end\":94812,\"start\":94800},{\"end\":94818,\"start\":94812},{\"end\":95095,\"start\":95082},{\"end\":95108,\"start\":95095},{\"end\":95121,\"start\":95108},{\"end\":95137,\"start\":95121},{\"end\":95367,\"start\":95348},{\"end\":95384,\"start\":95367},{\"end\":95401,\"start\":95384},{\"end\":95417,\"start\":95401},{\"end\":95439,\"start\":95417},{\"end\":95789,\"start\":95774},{\"end\":95806,\"start\":95789},{\"end\":95821,\"start\":95806},{\"end\":96065,\"start\":96052},{\"end\":96078,\"start\":96065},{\"end\":96300,\"start\":96288},{\"end\":96314,\"start\":96300},{\"end\":96326,\"start\":96314},{\"end\":96339,\"start\":96326},{\"end\":96355,\"start\":96339},{\"end\":96578,\"start\":96554},{\"end\":96595,\"start\":96578},{\"end\":96601,\"start\":96595},{\"end\":96793,\"start\":96778},{\"end\":96815,\"start\":96793},{\"end\":96829,\"start\":96815},{\"end\":96843,\"start\":96829},{\"end\":96865,\"start\":96843},{\"end\":97246,\"start\":97230},{\"end\":97263,\"start\":97246},{\"end\":97278,\"start\":97263},{\"end\":97303,\"start\":97278},{\"end\":97574,\"start\":97565},{\"end\":97584,\"start\":97574},{\"end\":97595,\"start\":97584},{\"end\":97838,\"start\":97820},{\"end\":98034,\"start\":98023},{\"end\":98046,\"start\":98034},{\"end\":98054,\"start\":98046},{\"end\":98301,\"start\":98287},{\"end\":98322,\"start\":98301},{\"end\":98558,\"start\":98548},{\"end\":98572,\"start\":98558},{\"end\":98587,\"start\":98572},{\"end\":98843,\"start\":98829},{\"end\":98852,\"start\":98843},{\"end\":98864,\"start\":98852},{\"end\":98884,\"start\":98864},{\"end\":98898,\"start\":98884}]", "bib_venue": "[{\"end\":88339,\"start\":88325},{\"end\":79683,\"start\":79606},{\"end\":80043,\"start\":79930},{\"end\":80416,\"start\":80412},{\"end\":80711,\"start\":80707},{\"end\":81015,\"start\":81011},{\"end\":81330,\"start\":81314},{\"end\":81699,\"start\":81637},{\"end\":82095,\"start\":82091},{\"end\":82474,\"start\":82319},{\"end\":82861,\"start\":82857},{\"end\":83195,\"start\":83191},{\"end\":83559,\"start\":83505},{\"end\":83889,\"start\":83874},{\"end\":84191,\"start\":84173},{\"end\":84533,\"start\":84529},{\"end\":84809,\"start\":84733},{\"end\":85282,\"start\":85246},{\"end\":85608,\"start\":85604},{\"end\":85847,\"start\":85843},{\"end\":86190,\"start\":86186},{\"end\":86522,\"start\":86518},{\"end\":86801,\"start\":86797},{\"end\":87115,\"start\":87111},{\"end\":87340,\"start\":87317},{\"end\":87682,\"start\":87678},{\"end\":87977,\"start\":87973},{\"end\":88323,\"start\":88240},{\"end\":88703,\"start\":88699},{\"end\":88936,\"start\":88861},{\"end\":89431,\"start\":89319},{\"end\":89808,\"start\":89804},{\"end\":90050,\"start\":89990},{\"end\":90517,\"start\":90496},{\"end\":90771,\"start\":90767},{\"end\":91072,\"start\":91065},{\"end\":91373,\"start\":91350},{\"end\":91621,\"start\":91617},{\"end\":91887,\"start\":91834},{\"end\":92158,\"start\":92154},{\"end\":92388,\"start\":92384},{\"end\":92599,\"start\":92539},{\"end\":92935,\"start\":92898},{\"end\":93241,\"start\":93237},{\"end\":93475,\"start\":93472},{\"end\":93828,\"start\":93764},{\"end\":94195,\"start\":94191},{\"end\":94442,\"start\":94354},{\"end\":94854,\"start\":94818},{\"end\":95141,\"start\":95137},{\"end\":95479,\"start\":95439},{\"end\":95825,\"start\":95821},{\"end\":96082,\"start\":96078},{\"end\":96286,\"start\":96215},{\"end\":96923,\"start\":96865},{\"end\":97307,\"start\":97303},{\"end\":97563,\"start\":97489},{\"end\":97818,\"start\":97760},{\"end\":98021,\"start\":97969},{\"end\":98285,\"start\":98219},{\"end\":98546,\"start\":98480},{\"end\":98951,\"start\":98898}]"}}}, "year": 2023, "month": 12, "day": 17}