{"id": 3289261, "updated": "2023-09-28 18:44:49.511", "metadata": {"title": "Application of artificial intelligence models for the prediction of standardized precipitation evapotranspiration index (SPEI) at Langat River Basin, Malaysia", "authors": "[{\"first\":\"Y.\",\"last\":\"Soh\",\"middle\":[\"W.\"]},{\"first\":\"C.\",\"last\":\"Koo\",\"middle\":[\"H.\"]},{\"first\":\"Y.\",\"last\":\"Huang\",\"middle\":[\"F.\"]},{\"first\":\"K.\",\"last\":\"Fung\",\"middle\":[\"F.\"]}]", "venue": "Comput. Electron. Agric.", "journal": "Comput. Electron. Agric.", "publication_date": {"year": 2018, "month": null, "day": null}, "abstract": "Drought forecasting is a vital for mitigating the impact of drought events on the economy, tourism, agriculture and water resource systems. This paper adopts the proposed Wavelet-ARIMA-ANN (WAANN) model and the latest Wavelet-Adaptive Neuro-Fuzzy Inference System (WANFIS) model to predict the Standardized Precipitation Evapotranspiration Index (SPEI) at the Langat River Basin for different time scales (1-month, 3months and 6-months). Model input data pre-processing with wavelet decomposition for improving the performance of the models was carried out apriori. The historical SPEI from 1976 to 2007 were used in the WAANN and WANFIS models for predicting the SPEI for the test period from 2008 to 2015. The Adjusted Coefficient of Determination (Radj), Root-Mean-Square-Error (RMSE), Mean Absolute Error (MAE), Willmott's Index of Agreement (d) and the Nash-Sutcliffe Coefficient of Efficiency (E) were used to assess the models. It was found that the prediction accuracy of the two models improved with time scale length. For the prediction of SPEI-1 (1month), the errors associated with both models were considered relatively high. Based on the performance measures and graphical plots, the WAANN model is better for the prediction of SPEI-3 and SPEI-6. The WANFIS model had satisfactory prediction of the mid-term drought forecasting for all stations. The WAANN model developed in this study however, gives better accuracy for both, the short-term and mid-term drought forecasting.", "fields_of_study": "[\"Computer Science\"]", "external_ids": {"arxiv": null, "mag": "2771600062", "acl": null, "pubmed": null, "pubmedcentral": null, "dblp": "journals/cea/SohKHF18", "doi": "10.1016/j.compag.2017.12.002"}}, "content": {"source": {"pdf_hash": "6ff58d85863507a4d097112eb63ba2c82241f42a", "pdf_src": "MergedPDFExtraction", "pdf_uri": null, "oa_url_match": false, "oa_info": null}, "grobid": {"id": "6e8cf027772b1aaed2752455f16791c497a576e3", "type": "plain-text", "url": "s3://ai2-s2-pdf-extraction-prod/parse-results/s2orc_worker/6ff58d85863507a4d097112eb63ba2c82241f42a.txt", "contents": "\nComputers and Electronics in Agriculture Application of artificial intelligence models for the prediction of standardized precipitation evapotranspiration index (SPEI) at Langat River Basin, Malaysia\n\n\nY W Soh \nDepartment of Civil Engineering\nFaculty of Engineering and Science\nLee Kong Chian\nUniversiti Tunku Abdul Rahman\nJalan Bandar Sg. Long43000Bandar Sg. Long, Kajang, SelangorMalaysia\n\nC H Koo \nDepartment of Civil Engineering\nFaculty of Engineering and Science\nLee Kong Chian\nUniversiti Tunku Abdul Rahman\nJalan Bandar Sg. Long43000Bandar Sg. Long, Kajang, SelangorMalaysia\n\nY F Huang \nDepartment of Civil Engineering\nFaculty of Engineering and Science\nLee Kong Chian\nUniversiti Tunku Abdul Rahman\nJalan Bandar Sg. Long43000Bandar Sg. Long, Kajang, SelangorMalaysia\n\nK F Fung \nDepartment of Civil Engineering\nFaculty of Engineering and Science\nLee Kong Chian\nUniversiti Tunku Abdul Rahman\nJalan Bandar Sg. Long43000Bandar Sg. Long, Kajang, SelangorMalaysia\n\nComputers and Electronics in Agriculture Application of artificial intelligence models for the prediction of standardized precipitation evapotranspiration index (SPEI) at Langat River Basin, Malaysia\n10.1016/j.compag.2017.12.002Contents lists available at ScienceDirect journal homepage: www.elsevier.com/locate/compag Original papers A R T I C L E I N F OANFIS ANN ARIMA Drought Wavelet\nA B S T R A C TDrought forecasting is a vital for mitigating the impact of drought events on the economy, tourism, agriculture and water resource systems. This paper adopts the proposed Wavelet-ARIMA-ANN (WAANN) model and the latest Wavelet-Adaptive Neuro-Fuzzy Inference System (WANFIS) model to predict the Standardized Precipitation Evapotranspiration Index (SPEI) at the Langat River Basin for different time scales (1-month, 3months and 6-months). Model input data pre-processing with wavelet decomposition for improving the performance of the models was carried out apriori. The historical SPEI from 1976 to 2007 were used in the WAANN and WANFIS models for predicting the SPEI for the test period from 2008 to 2015. The Adjusted Coefficient of Determination (R 2 adj ), Root-Mean-Square-Error (RMSE), Mean Absolute Error (MAE), Willmott's Index of Agreement (d) and the Nash-Sutcliffe Coefficient of Efficiency (E) were used to assess the models. It was found that the prediction accuracy of the two models improved with time scale length. For the prediction of SPEI-1 (1month), the errors associated with both models were considered relatively high. Based on the performance measures and graphical plots, the WAANN model is better for the prediction of SPEI-3 and SPEI-6. The WANFIS model had satisfactory prediction of the mid-term drought forecasting for all stations. The WAANN model developed in this study however, gives better accuracy for both, the short-term and mid-term drought forecasting.\n\nIntroduction\n\nOn the basis of the long-run average precipitation (normal precipitation) for a particular basin, the declining trend of precipitation indicates the initiation of droughts (Jalalkamali et al., 2015). Low relative humidity, temperatures, high wind velocity, rainfall characteristics including intensity, duration of precipitation and the distribution of rainfall during the crop growing seasons are important features of the droughts (Mishra and Singh, 2010). It has been reported in researches that the drought-induced conditions developed seasonally in the event of El Nino (also known as the warm phase of El Nino Southern Oscillation, ENSO). El Nino is induced by the reduction of trade winds and, in tandem with the increase of earth surface temperatures, appears to occur on the average, every 3-4 years (Paz et al., 2007).\n\nEven though Malaysia receives an average of 2800 mm of precipitation annually, the country however is still subjected to prolonged dry spells; especially at the Langat River Basin, where the rapid urbanisation of the Kuala Lumpur City area has resulted in an increased demand for the freshwater supply (Pour et al., 2014). The ENSO profoundly affects the condition of climate in Malaysia and in Southeast Asia. Yusof et al. (2012) applied the Kriging method to analyse the upward and downward trends during the occurrence of droughts in Peninsular Malaysia. Their results showed that the major regions of West Malaysia are subjected to an upward trend throughout the dry season, particularly in the eastern and western regions. It is extremely imperative for the water resources department to predict the drought intensity, severity and duration. With prior awareness of the onset of droughts, appropriate actions to mitigate the consequential damages can be considered. Precise and representative drought index series about the onset, extent and the end of the drought event allows the proper drought contingency plans to be established (Subash et al., 2011).\n\nDrought monitoring and early warning are important phases to manage droughts (Bachmir et al., 2016). Among the approaches for drought forecasting, the use of artificial intelligence (AI) shows outstanding performance and accuracy (Masinde, 2014;Ozger et al., 2011;Belayneh et al., 2014). The flexibility and adaptability of AI is useful in predicting the occurrence of droughts that poses varying durations, frequencies and intensities; characteristics that are not easily determined effectively using empirical relations. Artificial Neural Network (ANN), Fuzzy Logic (FL) and Support Vector Regression (SVR) are the examples of AI models that can be used to forecast the time series modelling based on historical data (Djerbouai and Souag-Gamane, 2016). Another popular type of data-driven model is the stochastic method. The older Auto Regressive Integrated Moving Average Model (ARIMA) and Seasonal Auto Regressive Moving Integrated Average Model (SARIMA) are the most widely adopted stochastic approaches, as they are relatively simple yet providing excellent results (Mossad and Alazba, 2015;Bazrafshan et al., 2015).\n\nIn order to improve the prediction accuracy in the time series forecasting, different types of hybrid models were developed to minimize the error between the actual and predicted values. For example, both Choubin et al. (2014Choubin et al. ( , 2016 explored the effectiveness of ANFIS model in forecasting the Standardized Precipitation Index (SPI) for different regions. Apart from that, ARIMA-ANN, Wavelet-ANN (WANN) and WANFIS are also effective forecasting tools among the hybrid models (Belayneh et al., 2014;Shabri, 2014). The wavelet transform had been proven to decompose the incoming signal into different frequencies (Djerbouai and Souag-Gamane, 2016;Adamowski, 2012, 2013;Özger et al., 2011 and thus, providing a more accurate output for the data driven models. By combining the strength of different models, the hybrid models can give a higher degree of accuracy.\n\nIn 2013, the WANFIS model was first used in drought forecasting because the wavelet transform has the ability to improve the accuracy of the models. The performance of the WANFIS model was compared with the WANN, ANN and ANFIS. WANFIS model results were more precise than other models in the study and the wavelet transform was particularly good in improving meteorological drought forecasting. Shabri (2014) also proposed to use the WANFIS model to forecast the drought events in Malaysia. Subsequently, the WANFIS model was widely recognised as an effective tool to forecast the time series of drought index. However, the performance of the WANFIS highly relied on the modelling of the ANFIS model. Seo et al. (2016) had pointed the drawbacks of using the ANFIS modelling that would lead to difficulty in the identification of network parameters and the number and type of membership functions. Moreover, the development of the ANFIS model is computationally expensive and complex.\n\nThe aim of this paper is to improve the drought forecasting procedure at the Langat River Basin, using hybrid modelling. An alternative model, the WAANN was proposed in this study since the wavelet transform is able to reduce the complexity of the time series and the ARIMA-ANN model was proven as an appropriate tool in the time series forecasting (Babu and Reddy, 2014;Khashei and Bijari, 2011). The latest hybrid model WANFIS in drought forecasting is used for comparison. The expected results are the SPEI series predicted with both models and the accompanying performance evaluations.\n\n\nMethodology\n\n\nStudy area and data acquisition\n\nThe catchment area of the Langat River Basin in Selangor, Malaysia is about 2400 km 2 , supplying approximately 65% of water usage in the state of Selangor. Two reservoirs in the Langat River Basin, namely the Semenyih dam (area of 56.6 km 2 ) and the Hulu Langat dam (area of 41.0 km 2 ) supply water to the state. The recorded daily precipitation and temperature for each station in the basin were retrieved from the Department of Irrigation and Drainage (DID) Malaysia and the Malaysian Meteorology Department (MMD). After determining the suitability of the data, the records from six stations were used. A set of daily meteorological data, including rainfall and temperature were obtained for these stations for the period of 1976-2015; with the exception of station 44320, where only the daily data from 1985 to 2015 is available. The location of the Langat River Basin is illustrated in Fig. 1 and the details of selected hydrometric stations in Langat River Y.W. Soh et al. Computers and Electronics in Agriculture 144 (2018) 164-173 Basin are given in Table 1.\n\nIn the homogeneous test for climate time series, climatic factors are assumed to be the only factors contributing to the variations. However, changes in microenvironment, instrumentation and variations in the observation time may introduce inhomogeneity in a time series by hiding the true climatic patterns. It is essential to check the homogeneity of a long-term hydrological data record. Four absolute test methods: Standard Normal Homogeneity Test, Buishand Range Test, Pettitt Test and the Von Neumann Ratio Test were selected to verify the homogeneity of the time series.\n\n\nStandardized precipitation evapotranspiration index (SPEI)\n\nThe recently developed drought index, SPEI is identified as a very appropriate tool for researching and monitoring drought conditions under warming since many researchers had conducted studies of SPEI drought analysis (Vicente-Serrano et al., 2010;Wang et al., 2014). The SPEI combines the multi-scale nature of the SPI while considering the Palmer Index sensitivity with evapotranspiration (based on temperature variation) using simple computation. The SPEI takes the resultant effects of precipitation, temperature or evapotranspiration into account in developing of the drought evolutionary stages (Beguería et al., 2014), in contrast to the Rainfall Decile Drought Index (RDDI) and the SPI that are solely assessed with rainfall data.\n\nThe computed value of SPI or SPEI indicating the drought severity based on the magnitude is such that the drought is categorised as mild if the value of SPI or SPEI ranges from 0 to −1, moderate if from −1 to −1.5, severe from −1.5 to −2 and extreme if less than −2. The category defined for the SPEI is identical with those of the SPI because they share a similarity in the computation that is based on the probability distribution (Tan et al., 2015). According to the development of SPEI by Vicente-Serrano et al. (2010), a total of 11 observations located in different parts of the world which include tropical, monsoon, Mediterranean, semi-arid, continental, cold, and oceanic climates were selected to develop the SPEI. Hence, the SPEI can be reliably used as the drought index in tropical countries, including Malaysia to represent the severity of the drought events.\n\n\nPotential Evapotranspiration (PET)\n\nThe Potential Evapotranspiration (PET) represents the amount of moisture loss through evaporation and transpiration when there is sufficient availability of water. Many important papers have been published on this well researched subject in important journals over the past decades, and therefore suffice to say that the Thornthwaite method was adopted herein, for the estimation of the PET due to its simplicity and the data constraint.\n\n\nComputation of SPEI\n\nBased on the standard operating procedure mentioned in MetMalayisa, 2014, drought disasters in Malaysia is managed based on SPI index of time scales up to 6 months. Thus, the time scales of SPEI adopted in this study are 1, 3 and 6 months. The calculation of SPEI is based on the concept of deficit or surplus of water between the precipitation and the potential evapotranspiration based on the different time scales. Suffice to say here, the computation of the SPEI can be performed based on the probability distribution F(x) as expressed in Eq.\n\n(1):\n= − + + + + + SPEI W C C W C W d W d W d W 1 0 1 2 2 1 2 2 3 3\n(1)\n\nwhere W = [−2 ln(P)] 0.5 for P ≤ .5; P = 1 − F(x); C 0 = 2.515517, C 1 = 0.802853, C 2 = 0.010328; d 1 = 1.432788, d 2 = 0.189269 and d 3 = 0.001308. If the value of P is greater than 0.5, then it substituted by 1-P and the sign of the final SPEI is reversed. The probability distribution F(x) is calculated as presented in Eq. (2):\n⎜ ⎟ = ⎡ ⎣ ⎢ + ⎛ ⎝ − ⎞ ⎠ ⎤ ⎦ ⎥ − F x α x γ ( ) 1 β 1(2)\nwhere α represents the scale, β represents the shape, γ represents the origin parameters, for D values in the range (γ > D < α). They can be determined using the L-moment method (Ahmad et al., 1988) with Eqs.\n\n(3)-(5).\n= − − − β w w w w w 2 6 6 1 0 1 0 2 (3) = − + − ( ) ( ) α w w β ( 2 ) Γ 1 Γ 1 β β 0 1 1 1 (4) ⎜ ⎟ ⎜ ⎟ = − ⎛ ⎝ + ⎞ ⎠ ⎛ ⎝ − ⎞ ⎠ γ w α β β Γ 1 1 Γ 1 1 0 (5)\nwhere Γ is the gamma function of β and w ι ( = … ι 0,1,2 ) can be computed by probability weighted moments (PWMs) through the L-moment method (Hosking and Wallis, 1997);\n∑ = ⎛ ⎝ − − ⎞ ⎠ = w n x i n 1 1 0.35 i n i ι 1 ι (6) where x i is the ordered random sample ( < … < x x x ) 1 2\nn of D (D = Precipitation-Potential Evapotranspiration) and n represents the sample size.\n\n\nARIMA, ANN, ANFIS and discrete wavelet transform models\n\nThe ARIMA model is the stochastic model that is most widely used for both short-term and long-term drought forecasting. The ANNs have been widely used in hydrologic forecasting over the past decades. During the network training, the weights and biases in the hidden layer are adjusted to generate the target output . The feedforward neural network is one of the more popular approaches used for the time series forecasting. The Adaptive Neuro-Fuzzy Inference System (ANFIS) is a hybrid of the neural network and fuzzy logic that applies the former for training procedure to fine tune the correlated parameter and function in a given sets of data (Shabri, 2014). The wavelet transform is defined as a time-dependent approach that decomposes the data series in the time-frequency space by providing a time-scale representation of processes and their connections. The original time series is decomposed into two components, high-frequency (high-pass) component and low-frequency (low-pass) component. Unlike the Fourier transform, the DWT localises a time series both in scaling and space and has some other favourable components where the wavelet function can be analysed more rapidly compared to the similar Fourier function (Kanika et al., 2012). The Haar wavelet was selected as the mother wavelet in this study and it was computed using Matlab®. The Haar wavelet has numerous advantages such as it is simple, fast and memory efficient (Deka et al., 2012). The historical SPEI series was used as the input for the one-dimensional wavelet transform to obtain the decomposed detail and approximation series. The development of WAANN requires the modelling of ARIMA-ANN, which is the key stage to obtain a good performance in the time series forecasting. Based on the modelling concept mentioned by Babu and Reddy (2014), the development of WAANN model is illustrated in Fig. 2(a) and the working procedure of the newly proposed WAANN in this paper can be summarised as follows.\n\nFirstly, the length of Moving Average (MA) filter m is adjusted to generate a smoothened series y tr with low-volatility as presented in Eq. (7):\n∑ = = − + y m y 1 tr i t m t i 1(7)\nNext, the high-volatility time series y res can be obtained as the residual of the time series by using Eq. (8):\n= − y y y res t tr(8)\nThe obtained y tr and y res series were then used to develop the ARIMA and ANN, respectively.\n\nFor the modelling of ARIMA, the obtained y tr series (low-volatility) from previous step was used as the input and modelled involving three stages known as model identification, estimation and diagnostic check. During the model identification, the autocorrelation function (ACF) and partial autocorrelation function (PACF) of the time series were plotted to determine the significance lag. The selection of model was based on the lowest Akaike Information Criterion (AIC) and Schwarz Bayesian Criterion (SBC) as shown in Eqs. (9) and (10):\n= − + AIC logL m 2 2 (9) = − + SBC logL m ln n 2 ()(10)\nwhere m is the number of terms estimated in the model; L is the likelihood function of the ARIMA models and n is the number of observations. For ANN, the generated y res series was first put through wavelet decomposition before it was used as the input for the model's development. The feedforward multilayer perceptron was proposed as it is very effective and simple to compute for the hydrological forecasting. Firstly, the decomposed input data was normalised before the modelling of ANN as expressed in Eq. (11) (Mishra et al., 2007):\n= − − X X X X X n o m i n max min(11)\nwhere X n is the normalised data; X o is the observed data; X max is the maximum value among the observed data and X min is the minimum value among the observed data. The training algorithms, Levenberg Marquardt backpropagation (trainlm) and Bayesian regularisation backpropagation (trainbr) were selected to identify the most appropriate training algorithm for the SPEI time series. The training stage was conducted using 70% of the data samples; the next 15% was used in the testing stage, whilst the remaining 15% was used at the validation stage. The optimum number of lag and hidden neuron was chosen based on trial and error. Finally, the predicted time series of WAANN model was generated using the results from ARIMA and ANN, by obtaining the sum of the series from both models.\n\n\nWavelet-Adaptive Neuro-Fuzzy Inference System (WANFIS)\n\nThe coupling of wavelet transformation and Adaptive Neuro-Fuzzy Inference System (ANFIS) in the field of hydrological forecasting is considered a relatively new approach in recent years. The combination of these two methods is known as WANFIS and is a better model compared to the stand-alone ANFIS. In this paper, a Sugeno-type FIS was adopted due to its effectiveness in computation and performs well with optimisation and adaptive techniques. The development of the WANFIS is shown in Fig. 2(b) and the working procedure can be Y.W. Soh et al. Computers and Electronics in Agriculture 144 (2018) 164-173 described as follows. Firstly, the decomposed historical SPEI series was normalised and used as the input variables for the development of fuzzy interference system (FIS) in the genfis2 (ANFIS with subtractive clustering). The radii in the genfis2 were adjusted to obtain more accurate results (Kisi et al., 2015). The ANFIS algorithm was then applied to the trained FIS to enhance the performance of the model. The number training epoch and initial step size in the ANFIS algorithm were determined through trial and error. The predicted outputs were then generated based on the evalfis algorithm in the Matlab® for the purpose of validation.\n\n\nModel's performance evaluation\n\nAfter modelling of the WAANN and the WANFIS models, the performance of both models in forecasting the monthly SPEI was statistically assessed with several key statistical parameters. The parameters suggested included the Root-Mean-Square-Error (RMSE), Mean Absolute Error (MAE), Willmott's Index of Agreement (d) and Nash-Sutcliffe Coefficient of Efficiency (E). The Adjusted Coefficient of Determination (R 2 adj ) was adopted to evaluate the model performance in this study as well. The calculation of RMSE, MAE, d, E and R 2 adj are shown in Eqs. (12)-(17), respectively: \n∑ = − = ( ) RMSE N SPEI SPEI 1 i n p o t 1 2 i i (12) ∑ = − = ( ) MAE N SPEI SPEI 1 | | i n p o t 1 i i (13) ∑ ∑ = − ⎛ ⎝ ⎜ ⎜ ⎜ − ′ − + ′ − ⎞ ⎠ ⎟ ⎟ ⎟ ⩽ ⩽ = = ( ) (| | ) d SPEI SPEI SPEI SPEI SPEI SPEI d 1 | | ,= − − − − − R R N N p 1 (1 )( 1) 1 adj 2 2(16)\nwhere N is the number of samples and p is the number of regression coefficients (including the intercept). A good model should have a lower RMSE and MAE which indicates low-accumulated errors. Besides, the values of R 2 adj , d and E should be close to the unity for a better fitting model. All these five parameters normally are closely related to each other where if the RMSE is low, the MAE tends to be low and the R 2 adj , d and E are found to be closer to unity.\n\n\nResults and discussion\n\n\nHomogeneity tests\n\nThe calibration of the homogeneity test was: firstly, the time series was divided into twelve months (from January until December) and then each month of the dataset was tested for homogeneity. The p-value for all the selected tests should be greater than the 5% significance value to indicate that the time series is homogeneous in a strict sense. The four tests were tested with the null hypothesis where the data were assumed homogeneous. The results were classified into three categories including class 'useful', 'suspect' and 'doubtful'. The 'useful' categorization was when none or one out of four tests rejected the null hypothesis. When two of four tests rejected the null hypothesis, it was categorised as 'suspect'. On the other hand, the dataset was classified as 'doubtful' once three or four tests had rejected the null hypothesis.\n\nTwo rainfall stations, namely the Pejabat JPS Sg. Manggis station (2815001) and the P/KWLN P/S Telok Gong station (2913001) were classified as 'useful' due to none of four tests rejected the null hypothesis. The useful dataset of the RTM Kajang station (2917001) was 91.67% with only 8.33% was considered as 'suspect'. In comparison with the rainfall stations, the datasets of all temperature stations exhibited relatively poor homogeneity. Approximate 91.67% of data of the Hospital Seremban station (45241) was categorised as 'doubtful'. Similarly, the Ampangan Ulu Langat station (44320) had 50% of data considered as 'doubtful' and 16.67% in class 'suspect' and 33.33% as class 'useful'. On the other hand, the data of the Petaling Jaya station (48648) showed a better homogeneity with about 42% 'useful' and 33.33% 'doubtful'. Therefore, the Petaling Jaya station (48648) was the only station used in this study for the computation of historical Potential Evapotranspiration (PET) and SPEI.\n\n\nModel development\n\nAfter the computation of historical PET and SPEI, the SPEI time series was decomposed with the level of decomposition 3. The level of decomposition, L is determined based on the number of the dataset, N and determined by the equation L = int[log(N)] (Tiwari and Chatterjee, 2010). The period of record was from 1976 to 2015 (N = 480), thus, the level of decomposition, L = 3.\n\nThe wavelet transform decomposed the time series into four components including A3, D1, D2 and D3 which were used as the inputs for ANN and ANFIS models. The development of WAANN and WANFIS required the modelling of ANN and ANFIS models. Both models used the historical SPEI from 1976 to 2007 as the training dataset. Modelling of the WANFIS models with 3-months lag showed a superior performance with high prediction accuracy. Increasing the lag beyond 3 months did not improve the performance of the WANFIS. While the significance lag of ANN varied with different SPEI series and it was determined via trial and error. Since each monthly SPEI had decomposed into four components through wavelet transformation, the total inputs became multiple of four with the lag to predict the one-step ahead value. Table 2 lists the network architecture of the best ANN and ANFIS models. Table 2 indicates that the training algorithm for all the feedforward neural network models was Bayesian regularization backpropagation (trainbr) with the training epoch equal to 1000. This training function applied the Levenberg-Marquardt optimization to propagate the weight and bias data. The algorithm has the ability to train the network in the difficult and complex situation and provides early stopping to prevent overfitting. The hidden neurons of the ANN model were determined by trial and error as different time series fit better with a different number of hidden neurons. During the simulation, the optimum hidden neurons were identified with the best-measured goodness of fit (MAE and RMSE). Similar to the findings of Djerbouai and Souag-Gamane (2016), the wavelet decomposition reduced the SPEI series complexity and thus, a small number of the hidden neurons (between 2 and 4) was sufficient in this study to obtain the desired outputs in ANN. Increasing the number of hidden neurons beyond the optimum number may cause a deterioration of the network performance due to overfitting. Overfitting occurs when the training performance exhibits an excellent result but incapable to accurately predict the output in the validation stage as the network had memorised the training input data and unable to simulate the output of unknown data. Similar to the modelling of ANFIS, overfitting can be avoided by altering the number of the epoch to eliminate overtraining.\n\nFor the development of the hybrid model WAANN, the historical SPEI was separated into high volatility and low volatility components. The low volatility component was modelled with a linear ARIMA model which involved in three stages; known as model identification, estimation and diagnostic check.\n\nDuring the model identification, the autocorrelation function (ACF) and partial autocorrelation function (PACF) of the time series were plotted to determine the significance lag as shown in Fig. 3. Fig. 3 describes the significance lag of ACF at 1, 2, 3, 4, 5, 9, 10, 11, 12, 13 and 14; while the PACF had the significance lag at 1, 2, 3, 4, 5, 6 and 8. Hence, the ARIMA (p,0,q) had a possible combination of p = 1 to 8 and q = 1 to 14. The best ARIMA model was distinguished based on the lowest Akaike Information Criterion (AIC) and Schwarz Bayesian Criterion (SBC) as tabulated in Table 3. It was found that the ARIMA model fitted well for the RTM Kajang station (2917001) where all the predicted SPEI had low AIC and SBC compared to other stations. Among the different time scales studied, the best model was found at the RTM Kajang station (2917001) in forecasting the SPEI-6 with AIC = -2133.50 and SBC = −2096.42. In contrast, the lowest prediction accuracy of the model was found at the P/KWLN P/S Telok Gong station (2913001) in predicting the SPEI-1 with AIC = −420.63 and SBC = −366.51.\n\nThe overall performance of all the ARIMA models were considered good due to the separation of data by the moving average filter. With the kurtosis value close to 3 (Babu and Reddy, 2014), all the ARIMA models were able to forecast the SPEI time series with a high degree of accuracy despite the time scale (1, 3 and 6-months) of the series.\n\nAfter model identification, the parameters of autoregressive (AR) and moving average (MA) were identified in the estimation stage. For the diagnostic check, it requires fulfilling the assumption of Box-Jenkins' theory where the residuals should be independent, homoscedastic and normally distributed in order to validate the performance of the ARIMA model. The first step conducting the diagnostic check of the models is to analyse the residuals from the ACF and PACF. Fig. 4 illustrates a good plot of Residual Autocorrelation Function (RACF) and Residual Partial Autocorrelation Function (RPACF) for ARIMA (8,0,14) for the SPEI-6 prediction at the Pejabat JPS Sg. Manggis station (2815001); as an example. The ARIMA model is considered well-fitted with the time series as the RACF and RPACF lie within the confidence boundaries, which clearly indicates the residuals are white noise and independent.\n\nNext, the Breusch-Pagan test was used to test for the homoscedasticity of residuals. As shown in Table 4, among the stations studied, the P/KWLN P/S Telok Gong station (2913001) is the only station that failed the test with the p-value less than 5% of significance value. The results showed that the rest of the SPEI residuals were homoscedastic and constant which fulfilled the assumption of Box-Jenkins' theory.\n\nThe last step in the diagnostic check requires testing for the normality of standardised residual based on the Shapiro-Wilk test, the Anderson-Darling test and the Jarque-Bera test with 5% significance value as listed in Table 5. All the SPEI series for the Pejabat JPS Sg. Manggis station (2815001) and the RTM Kajang station (2917001) passed all the three tests, which indicated the assumption for the linear  Y.W. Soh et al. Computers and Electronics in Agriculture 144 (2018) 164-173 regression of ARIMA model was fully fulfilled. Meanwhile, the results depicted that the SPEI-6 for the P/KWLN P/S Telok Gong station (2913001) failed the Anderson-Darling test. However, with the passing of the other two tests, it is still assumed that the linear regression of ARIMA was fully fulfilled.\n\n\nModels performance evaluation\n\nThe performance of both WAANN and WANFIS models were compared with the statistical measures including the Adjusted Coefficient of Determination (R 2 adj ), Root-Mean-Square-Error (RMSE), Mean Absolute Error (MAE), Willmott's Index of Agreement (d) and the Nash-Sutcliffe Coefficient of Efficiency (E) as shown in Table 6. The performance validation was carried out over the 96 months' test period (2008)(2009)(2010)(2011)(2012)(2013)(2014)(2015) for all the SPEI series (SPEI-1, -3 and -6).\n\nAs illustrated in Table 6, the prediction from WAANN model for the SPEI-6 of the RTM Kajang station (2917001) has the best results, with the highest R 2 adj (0.9603), d (0.9896) and E (0.9600) and the lowest MAE (0.1364) and RMSE (0.1810). In contrast, the worst prediction was found in the WANFIS model for the SPEI-1 of the Pejabat JPS Sg. Manggis station (2815001) (R 2 adj = 0.4994, MAE = 0.5090, RMSE = 0.7582, d = 0.8296 and E = 0.4916). Clearly, as the time scale increases from SPEI-1 to SPEI-6, the performance of both WAANN and WANFIS improved significantly as a higher SPEI would reduce the white noise by increasing the filter length (Mishra and Desai, 2005). Consequently, it is interesting to note that both WAANN and WANFIS models can predict the higher time scale SPEI more accurately due to less fluctuation.\n\nIn terms of forecasting ability for SPEI-1, the WAANN model performed better than the WANFIS model for the Pejabat JPS Sg. Manggis station (2815001) where higher R 2 adj , d and E with lower MAE and  The results showed that with the performance measures for SPEI-3 and SPEI-6, using the WAANN model resulted in better prediction accuracy. It is observed that the WAANN greatly outperformed the WANFIS for all the stations to predict the future SPEI-3 and -6. This is probably because of the SPEI-3 and -6 were less fluctuating and contained lesser white noise compared to the SPEI-1. Therefore, the performance of the ANN model improved significantly and subsequently enhanced the performance of WAANN model. In contrast, the weakness of WANFIS model was unable to predict the output reliably when the input signals had fallen outside of the values of the training dataset. The overall result is the WAANN model outperformed the WANFIS model in   Y.W. Soh et al. Computers and Electronics in Agriculture 144 (2018) 164-173 a reliable fashion, in forecasting the SPEI-3 and SPEI-6 for all the stations. Figs. 5-7 illustrate the observed and predicted SPEI-1, SPEI-3 and SPEI-6 graphical plots respectively, for all the stations. The extreme outliers of the predicted SPEI for WAANN and WANFIS were identified except for the highly fluctuating SPEI-1. Most of the outliers were found in the time series for SPEI-3 and SPEI-6 especially for the Pejabat JPS Sg. Manggis station (2815001) and the P/KWLN P/S Telok Gong station (2913001). By observing the plots, the predicted values of WANFIS yielded more extreme outliers compared to the WAANN. Hence, the performance of the WANFIS was relatively lower than the WAANN in SPEI-3 and SPEI-6 forecasting. The graphical results shows the limitation of the WANFIS model when the input data were outside of the training input range, whence the prediction accuracy deteriorated.\n\n\nConclusions\n\nTwo hybrid models, namely the WAANN and WANFIS were selected to forecast the future SPEI at the Langat River Basin, Malaysia. The input data for development of both models was pre-processed with wavelet transform to enhance the performance of the models. Based on the key statistical parameters, the performance of both WAANN and WANFIS models improved due to the reduction of white noise by increasing the filter length, when the time scale increased. For the prediction of SPEI-1, the errors obtained by both WAANN and WANFIS models were considered relatively high compared to SPEI-3 and SPEI-6 because both models were less effective in detecting the white noise for highly fluctuating SPEI-1. It was also found that the prediction accuracy of the WAANN was superior to the WANFIS for the SPEI-3 and SPEI-6 prediction for all the stations. In predicting the SPEI-3 and SPEI-6, both WAANN and WANFIS models performed very well since the white noise and outliers were greatly reduced. Nevertheless, the ability of the WAANN model in predicting the SPEI-3 and SPEI-6 was superior to the WANFIS model at all the stations. Apart from that, the WANFIS prediction values yielded more extreme outliers compared to the WAANN prediction values also showed the limitation of the WANFIS model where the prediction accuracy declined when the input data were outside the training input range. Finally, the WAANN model is the better drought forecasting model and it is not limited by the training input range and provided accurate predictions for both short-term and mid-term drought conditions.\n\nFig. 1 .\n1Location of Langat River Basin.\n\nFig. 2 .\n2Development of Models.\n\nFig. 3 .\n3ACF and PACF for SPEI-6 of Station Pejabat JPS Sg. Manggis (2815001).\n\nFig. 5 .Fig. 6 .\n56Observed Observed and Predicted SPEI-3.\n\nFig. 7 .\n7Observed and Predicted SPEI-6.\n\nTable 1\n1Details of the selected hydrometric stations at the Langat River Basin.Station name \nStation ID \nAvailable data \nRecord's period \n\nPejabat JPS Sg. Manggis \n2815001 \nPrecipitation \n1976-2015 \nP/K WLN P/S Telok Gong \n2913001 \nPrecipitation \n1976-2015 \nRTM Kajang \n2917001 \nPrecipitation \n1976-2015 \nHospital Seremban \n45241 \nTemperature \n1976-2015 \nAmpangan Ulu Langat \n44320 \nTemperature \n1985-2015 \nPetaling Jaya \n48648 \nTemperature \n1976-2015 \n\nY.W. Soh et al. \nComputers and Electronics in Agriculture 144 (2018) 164-173 \n\n\nTable 2\n2Network architecture of the best ANN and ANFIS models.Stations \nID \nTime Scale ANN \n\n\nTable 3\n3Best ARIMA models with AIC and SBC.Stations \nID \nTime Scale \nModel \nm \nKurtosis \nAIC \nSBC \n\nPejabat JPS Sg. Manggis \n2815001 \nSPEI-1 \nARIMA (0, 0, 13) \n7 \n2.917 \n−526.01 \n−467.78 \nSPEI-3 \nARIMA (15, 0, 14) \n7 \n2.784 \n−1189.59 \n−1064.88 \nSPEI-6 \nARIMA (8, 0, 14) \n5 \n2.631 \n−1264.13 \n−1168.57 \n\nP/KWLN P/S Telok Gong \n2913001 \nSPEI-1 \nARIMA (6, 0, 6) \n6 \n2.961 \n−420.63 \n−366.51 \nSPEI-3 \nARIMA (15, 0, 6) \n8 \n3.022 \n−1186.62 \n−1095.22 \nSPEI-6 \nARIMA (8, 0, 7) \n8 \n3.014 \n−1506.48 \n−1440.14 \n\nRTM Kajang \n2917001 \nSPEI-1 \nARIMA (13, 0, 12) \n22 \n2.991 \n−1323.01 \n−1215.65 \nSPEI-3 \nARIMA (11,0, 10) \n21 \n2.999 \n−1750.77 \n−1659.98 \nSPEI-6 \nARIMA (3, 0, 5) \n21 \n3.009 \n−2133.50 \n−2096.42 \n\n\n\nTable 4\n4Breusch-Pagan Test for Residuals Homoscedasticity. Normality Test for Standardised Residuals.RMSE were achieved. Besides, the WAANN obtained a lower MAE and RMSE and higher E in predicting the SPEI-1 for the RTM Kajang station (2917001). However, the WANFIS model outperformed the WAANN model in predicting the SPEI-1 for the P/KWLN P/S Telok Gong station (2913001). Hence, the performance of the models in forecasting the highly sensitive SPEI-1 depends on the dynamic properties and complexity of the time series which vary from station to station. As the error obtained from the ARIMA model was considerably small, thus, the prediction error obtained from the ANN became predominant for the WAANN model's performance. Overall, both WAANN and WANFIS models for SPEI-1 exhibited the largest value of errors (MAE and RMSE) compared to the other SPEIs due to the models being less effective in detecting the white noise under a short lead time. Hence, the SPEI-1 was a less representative time scale to use in the drought forecasting as it was extremely sensitive and unstable.Stations \nID \nTime scale \np-value \nRemark \n\nPejabat JPS Sg. Manggis \n2815001 \nSPEI-1 \n0.577 \nHomoscedastic \nSPEI-3 \n0.892 \nHomoscedastic \nSPEI-6 \n0.987 \nHomoscedastic \n\nP/KWLN P/S Telok Gong \n2913001 \nSPEI-1 \n0.301 \nHomoscedastic \nSPEI-3 \n0.634 \nHomoscedastic \nSPEI-6 \n0.041 \nHeteroscedastic \n\nRTM Kajang \n2917001 \nSPEI-1 \n0.932 \nHomoscedastic \nSPEI-3 \n0.875 \nHomoscedastic \nSPEI-6 \n0.722 \nHomoscedastic \n\nTable 5 \nStations \nID \nTime \nscale \n\nShapiro-Wilk Anderson-\nDarling \n\nJarque-Bera \n\nPejabat JPS Sg. \nManggis \n\n2815001 SPEI-1 \n0.102 \n0.080 \n0.074 \nSPEI-3 \n0.568 \n0.618 \n0.565 \nSPEI-6 \n0.738 \n0.741 \n0.456 \n\nP/KWLN P/S \nTelok \nGong \n\n2913001 SPEI-1 \n0.265 \n0.118 \n0.193 \nSPEI-3 \n0.476 \n0.739 \n0.637 \nSPEI-6 \n0.095 \n0.036 \n0.163 \n\nRTM Kajang \n2917001 SPEI-1 \n0.269 \n0.918 \n0.572 \nSPEI-3 \n0.340 \n0.464 \n0.082 \nSPEI-6 \n0.079 \n0.090 \n0.076 \n\n\n\nTable 6\n6Statistical measures of the WAANN and WANFIS performance for one month lead time.Stations \nID \nTime Scale \nModels \nR^2 (adj) \nMAE \nRMSE \nd \nE \n\nPejabat JPS Sg. Manggis \n2815001 \nSPEI-1 \nWAANN \n0.7083 \n0.4313 \n0.5825 \n0.8955 \n0.6999 \nWANFIS \n0.4994 \n0.5090 \n0.7582 \n0.8296 \n0.4916 \nSPEI-3 \nWAANN \n0.9226 \n0.2183 \n0.2827 \n0.9801 \n0.9230 \nWANFIS \n0.8242 \n0.2797 \n0.4311 \n0.9525 \n0.8210 \nSPEI-6 \nWAANN \n0.9408 \n0.1730 \n0.2493 \n0.9847 \n0.9404 \nWANFIS \n0.8891 \n0.2328 \n0.3435 \n0.9711 \n0.8868 \n\nP/KWLN P/S Telok Gong \n2913001 \nSPEI-1 \nWAANN \n0.5428 \n0.4664 \n0.6458 \n0.8380 \n0.5470 \nWANFIS \n0.5874 \n0.4425 \n0.6216 \n0.8629 \n0.5802 \nSPEI-3 \nWAANN \n0.8948 \n0.2033 \n0.2994 \n0.9726 \n0.8932 \nWANFIS \n0.7979 \n0.2802 \n0.4123 \n0.9424 \n0.7973 \nSPEI-6 \nWAANN \n0.9545 \n0.1517 \n0.2020 \n0.9884 \n0.9550 \nWANFIS \n0.9133 \n0.2124 \n0.2792 \n0.9771 \n0.9140 \n\nRTM Kajang \n2917001 \nSPEI-1 \nWAANN \n0.6007 \n0.3895 \n0.6011 \n0.8702 \n0.6032 \nWANFIS \n0.6071 \n0.4012 \n0.6017 \n0.8722 \n0.6024 \nSPEI-3 \nWAANN \n0.8663 \n0.2400 \n0.3487 \n0.9640 \n0.8667 \nWANFIS \n0.7901 \n0.2636 \n0.4381 \n0.9412 \n0.7896 \nSPEI-6 \nWAANN \n0.9603 \n0.1364 \n0.1810 \n0.9896 \n0.9600 \nWANFIS \n0.8619 \n0.2458 \n0.3445 \n0.9587 \n0.8550 \n\n\nAcknowledgmentsThe authors wish to express their sincere gratitude to Universiti Tunku Abdul Rahman (UTAR) for the financial support through the grant of UTARRF Project No. IPSR/RMC/UTARRF/2015-C1/H01.\nLog-logistic flood frequency analysis. M I Ahmad, C D Sinclair, A Werritty, J. Hydrol. 98Ahmad, M.I., Sinclair, C.D., Werritty, A., 1988. Log-logistic flood frequency analysis. J. Hydrol. 98, 205-224.\n\nA moving-average filter based hybrid ARIMA-ANN model for forecasting time series data. C N Babu, B E Reddy, Appl. Soft Comput. 23Babu, C.N., Reddy, B.E., 2014. A moving-average filter based hybrid ARIMA-ANN model for forecasting time series data. Appl. Soft Comput. 23, 27-38.\n\nA quantitative analysis to objectively appraise drought indicators and model drought impacts. S Bachmir, C Svensson, J Hannaford, L J Barker, K Stahl, Hydrol. Earth Syst. Sci. 20Bachmir, S., Svensson, C., Hannaford, J., Barker, L.J., Stahl, K., 2016. A quantitative analysis to objectively appraise drought indicators and model drought impacts. Hydrol. Earth Syst. Sci. 20, 2589-2609.\n\nHydrological drought forecasting using ARIMA models (Case Study : Karkheh Basin). O Bazrafshan, A Salajegheh, J Bazrafshan, M Mahdavi, A F Marj, Ecopersia. 3Bazrafshan, O., Salajegheh, A., Bazrafshan, J., Mahdavi, M., Marj, A.F., 2015. Hydrological drought forecasting using ARIMA models (Case Study : Karkheh Basin). Ecopersia 3, 1099-1117.\n\nStandardized precipitation evapotranspiration index (SPEI) revisited: parameter fitting, evapotranspiration models, tools, datasets and drought monitoring. S Beguería, S M Vicente-Serrano, F Reig, B Latorre, Int. J. Climatol. 3410Beguería, S., Vicente-Serrano, S.M., Reig, F., Latorre, B., 2014. Standardized precipitation evapotranspiration index (SPEI) revisited: parameter fitting, evapotranspiration models, tools, datasets and drought monitoring. Int. J. Climatol. 34 (10), 3001-3023.\n\nStandard precipitation index drought forecasting using neural networks, wavelet neural networks, and support vector regression. A Belayneh, J Adamowski, Appl. Comput. Intell. Soft Comput. 2012Belayneh, A., Adamowski, J., 2012. Standard precipitation index drought forecasting using neural networks, wavelet neural networks, and support vector regression. Appl. Comput. Intell. Soft Comput. 2012, 1-13.\n\nDrought forecasting using new machine learning methods. A Belayneh, J Adamowski, J. Water Land Dev. 18Belayneh, A., Adamowski, J., 2013. Drought forecasting using new machine learning methods. J. Water Land Dev. 18 (I-VI), 3-12.\n\nLong-term SPI drought forecasting in the Awash River Basin in Ethiopia using wavelet neural network and wavelet support vector regression models. A Belayneh, J Adamowski, B Khalil, B Ozga-Zielinski, J. Hydrol. 508Belayneh, A., Adamowski, J., Khalil, B., Ozga-Zielinski, B., 2014. Long-term SPI drought forecasting in the Awash River Basin in Ethiopia using wavelet neural network and wavelet support vector regression models. J. Hydrol. 508, 418-429.\n\nDrought forecasting in a semi-arid watershed using climate signals: a Neuro-fuzzy modeling approach. B Choubin, S Khalighi-Sigaroodi, A Malekian, S Ahmad, P Attarod, J. Mount. Sci. 116Choubin, B., Khalighi-Sigaroodi, S., Malekian, A., Ahmad, S., Attarod, P., 2014. Drought forecasting in a semi-arid watershed using climate signals: a Neuro-fuzzy modeling approach. J. Mount. Sci. 11 (6), 1593-1605.\n\nApplication of several data-driven techniques to predict a standardized precipitation index. B Choubin, A Malekian, M Golshan, Atmosfera. 292Choubin, B., Malekian, A., Golshan, M., 2016. Application of several data-driven tech- niques to predict a standardized precipitation index. Atmosfera 29 (2), 121-128.\n\nDiscrete wavelet-Ann approach in time series flow forecasting-a case study of Brahmaputra river. P C Deka, L Haque, A G Banhatti, IJEE. 54Deka, P.C., Haque, L., Banhatti, A.G., 2012. Discrete wavelet-Ann approach in time series flow forecasting-a case study of Brahmaputra river. IJEE 5 (4), 673-685.\n\nDrought forecasting using neural networks, wavelet neural networks, and stochastic models: case of the Algerois Basin in North Algeria. S Djerbouai, D Souag-Gamane, Water Resour. Manage. 307Djerbouai, S., Souag-Gamane, D., 2016. Drought forecasting using neural networks, wa- velet neural networks, and stochastic models: case of the Algerois Basin in North Algeria. Water Resour. Manage. 30 (7), 2445-2464.\n\nRegional Frequency Analysis -An Approach Based on L-Moments. J R M Hosking, J R Wallis, Cambridge University PressCambridgeHosking, J.R.M., Wallis, J.R., 1997. Regional Frequency Analysis -An Approach Based on L-Moments. Cambridge University Press, Cambridge.\n\nApplication of several artificial intelligence models and ARIMAX model for forecasting drought using the Standardized Precipitation Index. A Jalalkamali, M Moradi, N Moradi, Int. J. Environ. Sci. Technol. 124Jalalkamali, A., Moradi, M., Moradi, N., 2015. Application of several artificial intelligence models and ARIMAX model for forecasting drought using the Standardized Precipitation Index. Int. J. Environ. Sci. Technol. 12 (4), 1201-1210.\n\nComparative analysis of discrete wavelet transform and fast wavelet transform on image compression. E Kanika, N Dhillon, E K Sharama, Int. J. Eng. Res. Technol. 15Kanika, E., Dhillon, N., Sharama, E.K., 2012. Comparative analysis of discrete wavelet transform and fast wavelet transform on image compression. Int. J. Eng. Res. Technol. 1 (5), 1-7.\n\nA novel hybridization of artificial neural networks and ARIMA models for time series forecasting. M Khashei, M Bijari, Appl. Soft Comput. 112Khashei, M., Bijari, M., 2011. A novel hybridization of artificial neural networks and ARIMA models for time series forecasting. Appl. Soft Comput. 11 (2), 2664-2675.\n\nLong-term monthly evapotranspiration modeling by several data-driven methods without climatic data. O Kisi, H Sanikhani, M Zounemat-Kermani, F Niazi, Comput. Electron. Agric. 115Kisi, O., Sanikhani, H., Zounemat-Kermani, M., Niazi, F., 2015. Long-term monthly evapotranspiration modeling by several data-driven methods without climatic data. Comput. Electron. Agric. 115, 66-77.\n\nDaily pan evaporation modeling using chi-squared automatic interaction detector, neural networks, classification and regression tree. O Kisi, O Genc, S Dinc, M Zounemat-Kermani, Comput. Electron. Agric. 122Kisi, O., Genc, O., Dinc, S., Zounemat-Kermani, M., 2016. Daily pan evaporation modeling using chi-squared automatic interaction detector, neural networks, classification and regression tree. Comput. Electron. Agric. 122, 112-117.\n\nArtificial neural networks models for predicting effective drought index: factoring effects of rainfall variability. M Masinde, Mitig. Adapt Strateg. Glob. Change. 198Masinde, M., 2014. Artificial neural networks models for predicting effective drought index: factoring effects of rainfall variability. Mitig. Adapt Strateg. Glob. Change. 19 (8), 1139-1162.\n\n. Country Reports -Malaysia. Malaysia Meteorological DepartmentMalaysia Meteorological Department, 2014. Country Reports -Malaysia. MetMalayisa, Selangor.\n\nDrought forecasting using stochastic models. A K Mishra, V R Desai, Stoch. Environ. Res. Risk A. 195Mishra, A.K., Desai, V.R., 2005. Drought forecasting using stochastic models. Stoch. Environ. Res. Risk A 19 (5), 326-339.\n\nA review of drought concepts. A K Mishra, V P Singh, J. Hydrol. 3911Mishra, A.K., Singh, V.P., 2010. A review of drought concepts. J. Hydrol. 391 (1), 202-216.\n\nDrought forecasting using a hybrid stochastic and neural network model. A K Mishra, V R Desai, V P Singh, J. Hydrol. Eng. 126Mishra, A.K., Desai, V.R., Singh, V.P., 2007. Drought forecasting using a hybrid stochastic and neural network model. J. Hydrol. Eng. 12 (6), 626-638.\n\nDrought forecasting using stochastic models in a hyperarid climate. A Mossad, A A Alazba, Atmosphere. 64Mossad, A., Alazba, A.A., 2015. Drought forecasting using stochastic models in a hyper- arid climate. Atmosphere 6 (4), 410-430.\n\nEstimating Palmer Drought Severity Index using a wavelet fuzzy logic model based on meteorological variables. M Özger, A K Mishra, V P Singh, Int. J. Climatol. 3113Özger, M., Mishra, A.K., Singh, V.P., 2011. Estimating Palmer Drought Severity Index using a wavelet fuzzy logic model based on meteorological variables. Int. J. Climatol. 31 (13), 2021-2032.\n\nLong lead time drought forecasting using a wavelet and fuzzy logic combination model: a case study in Texas. M Özger, A K Mishra, V P Singh, J. Hydrometeorol. 131Özger, M., Mishra, A.K., Singh, V.P., 2012. Long lead time drought forecasting using a wavelet and fuzzy logic combination model: a case study in Texas. J. Hydrometeorol. 13 (1), 284-297.\n\nDevelopment of an ENSO-based irrigation decision support tool for peanut production in the southeastern US. J O Paz, C W Fraisse, L U Hatch, A G Garcia, L C Guerra, O Uryasev, J G Bellow, J W Jones, G Hoogenboom, Comput. Electron. Agric. 551Paz, J.O., Fraisse, C.W., Hatch, L.U., y Garcia, A.G., Guerra, L.C., Uryasev, O., Bellow, J.G., Jones, J.W., Hoogenboom, G., 2007. Development of an ENSO-based irrigation decision support tool for peanut production in the southeastern US. Comput. Electron. Agric. 55 (1), 28-35.\n\nGenetic programming for the downscaling of extreme rainfall events on the East Coast of Peninsular Malaysia. S H Pour, S B Harun, S Shahid, Atmosphere. 54Pour, S.H., Harun, S.B., Shahid, S., 2014. Genetic programming for the downscaling of extreme rainfall events on the East Coast of Peninsular Malaysia. Atmosphere 5 (4), 914-936.\n\nRiver stage forecasting using wavelet packet decomposition and machine learning models. Y Seo, S Kim, O Kisi, V P Singh, K Parasuraman, Water Resour. Manage. 3011Seo, Y., Kim, S., Kisi, O., Singh, V.P., Parasuraman, K., 2016. River stage forecasting using wavelet packet decomposition and machine learning models. Water Resour. Manage. 30 (11), 4011-4035.\n\nA hybrid wavelet analysis and adaptive Neuro-Fuzzy inference system for drought forecasting. A Shabri, Appl. Math. Sci. 8139Shabri, A., 2014. A hybrid wavelet analysis and adaptive Neuro-Fuzzy inference system for drought forecasting. Appl. Math. Sci. 8 (139), 6909-6918.\n\nComparing water-vegetative indices for rice (Oryza sativa L.)-wheat (Triticum aestivum L.) drought assessment. N Subash, H R Mohan, K Banukumar, Comput. Electron. Agric. 772Subash, N., Mohan, H.R., Banukumar, K., 2011. Comparing water-vegetative indices for rice (Oryza sativa L.)-wheat (Triticum aestivum L.) drought assessment. Comput. Electron. Agric. 77 (2), 175-187.\n\nTemporal-spatial variation of drought indicated by SPI and SPEI in Ningxia Hui autonomous region. C P Tan, J P Yang, M Li, China. Atmosphere. 610Tan, C.P., Yang, J.P., Li, M., 2015. Temporal-spatial variation of drought indicated by SPI and SPEI in Ningxia Hui autonomous region, China. Atmosphere 6 (10), 1399-1421.\n\nA multiscalar Drought index sensitive to global warming: the standardized precipitation evapotranspiration index. S M Vicente-Serrano, S Beguería, J I López-Moreno, J. Climate. 23Vicente-Serrano, S.M., Beguería, S., López-Moreno, J.I., 2010. A multiscalar Drought index sensitive to global warming: the standardized precipitation evapotranspiration index. J. Climate 23, 1696-1718.\n\nTemporal-spatial characteristics of severe drought events and their im. Q F Wang, P J Shi, T J Lei, G P Geng, J H Liu, X Y Mo, X H Li, H K Zhou, D C Liu, Quatern. Int. 349Wang, Q.F., Shi, P.J., Lei, T.J., Geng, G.P., Liu, J.H., Mo, X.Y., Li, X.H., Zhou, H.K., Liu, D.C., 2014. Temporal-spatial characteristics of severe drought events and their im- pact on agriculture on a global scale. Quatern. Int. 349, 10-21.\n\nTrend analysis for drought event in peninsular Malaysia. F Yusof, H M Foo, S Suhaila, C Y Kong, Jurnal Teknologi (Sci. Eng.). 571Yusof, F., Foo, H.M., Suhaila, S., Kong, C.Y., 2012. Trend analysis for drought event in peninsular Malaysia. Jurnal Teknologi (Sci. Eng.) 57 (1), 211-218.\n\n. Y W Soh, Computers and Electronics in Agriculture. 144Y.W. Soh et al. Computers and Electronics in Agriculture 144 (2018) 164-173\n", "annotations": {"author": "[{\"end\":392,\"start\":203},{\"end\":582,\"start\":393},{\"end\":774,\"start\":583},{\"end\":965,\"start\":775}]", "publisher": null, "author_last_name": "[{\"end\":210,\"start\":207},{\"end\":400,\"start\":397},{\"end\":592,\"start\":587},{\"end\":783,\"start\":779}]", "author_first_name": "[{\"end\":204,\"start\":203},{\"end\":206,\"start\":205},{\"end\":394,\"start\":393},{\"end\":396,\"start\":395},{\"end\":584,\"start\":583},{\"end\":586,\"start\":585},{\"end\":776,\"start\":775},{\"end\":778,\"start\":777}]", "author_affiliation": "[{\"end\":391,\"start\":212},{\"end\":581,\"start\":402},{\"end\":773,\"start\":594},{\"end\":964,\"start\":785}]", "title": "[{\"end\":200,\"start\":1},{\"end\":1165,\"start\":966}]", "venue": null, "abstract": "[{\"end\":2862,\"start\":1354}]", "bib_ref": "[{\"attributes\":{\"ref_id\":\"b13\"},\"end\":3076,\"start\":3050},{\"attributes\":{\"ref_id\":\"b21\"},\"end\":3335,\"start\":3311},{\"attributes\":{\"ref_id\":\"b26\"},\"end\":3705,\"start\":3687},{\"attributes\":{\"ref_id\":\"b27\"},\"end\":4029,\"start\":4010},{\"attributes\":{\"ref_id\":\"b34\"},\"end\":4138,\"start\":4119},{\"attributes\":{\"ref_id\":\"b30\"},\"end\":4867,\"start\":4846},{\"attributes\":{\"ref_id\":\"b2\"},\"end\":4969,\"start\":4947},{\"attributes\":{\"ref_id\":\"b18\"},\"end\":5115,\"start\":5100},{\"end\":5134,\"start\":5115},{\"attributes\":{\"ref_id\":\"b7\"},\"end\":5156,\"start\":5134},{\"attributes\":{\"ref_id\":\"b11\"},\"end\":5623,\"start\":5589},{\"attributes\":{\"ref_id\":\"b23\"},\"end\":5967,\"start\":5942},{\"attributes\":{\"ref_id\":\"b3\"},\"end\":5991,\"start\":5967},{\"attributes\":{\"ref_id\":\"b8\"},\"end\":6219,\"start\":6199},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":6242,\"start\":6219},{\"attributes\":{\"ref_id\":\"b7\"},\"end\":6508,\"start\":6485},{\"attributes\":{\"ref_id\":\"b29\"},\"end\":6521,\"start\":6508},{\"attributes\":{\"ref_id\":\"b11\"},\"end\":6655,\"start\":6621},{\"end\":6677,\"start\":6655},{\"attributes\":{\"ref_id\":\"b24\"},\"end\":6695,\"start\":6677},{\"attributes\":{\"ref_id\":\"b29\"},\"end\":7279,\"start\":7266},{\"attributes\":{\"ref_id\":\"b28\"},\"end\":7589,\"start\":7572},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":8227,\"start\":8205},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":8252,\"start\":8227},{\"end\":9535,\"start\":9465},{\"attributes\":{\"ref_id\":\"b32\"},\"end\":10453,\"start\":10423},{\"attributes\":{\"ref_id\":\"b33\"},\"end\":10471,\"start\":10453},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":10829,\"start\":10806},{\"attributes\":{\"ref_id\":\"b31\"},\"end\":11396,\"start\":11378},{\"attributes\":{\"ref_id\":\"b32\"},\"end\":11467,\"start\":11438},{\"attributes\":{\"ref_id\":\"b0\"},\"end\":13525,\"start\":13505},{\"attributes\":{\"ref_id\":\"b12\"},\"end\":13868,\"start\":13842},{\"attributes\":{\"ref_id\":\"b29\"},\"end\":14791,\"start\":14777},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":15376,\"start\":15355},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":15587,\"start\":15568},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":15949,\"start\":15928},{\"attributes\":{\"ref_id\":\"b22\"},\"end\":17654,\"start\":17633},{\"end\":19145,\"start\":19075},{\"attributes\":{\"ref_id\":\"b16\"},\"end\":19459,\"start\":19440},{\"end\":26350,\"start\":26310},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":27349,\"start\":27327},{\"end\":28116,\"start\":28113},{\"end\":28118,\"start\":28116},{\"end\":28121,\"start\":28118},{\"end\":29310,\"start\":29240},{\"end\":30051,\"start\":30045},{\"end\":30057,\"start\":30051},{\"end\":30063,\"start\":30057},{\"end\":30069,\"start\":30063},{\"end\":30075,\"start\":30069},{\"end\":30081,\"start\":30075},{\"end\":30087,\"start\":30081},{\"end\":30093,\"start\":30087},{\"attributes\":{\"ref_id\":\"b20\"},\"end\":30810,\"start\":30786},{\"end\":31989,\"start\":31919}]", "figure": "[{\"attributes\":{\"id\":\"fig_0\"},\"end\":34526,\"start\":34484},{\"attributes\":{\"id\":\"fig_1\"},\"end\":34560,\"start\":34527},{\"attributes\":{\"id\":\"fig_3\"},\"end\":34641,\"start\":34561},{\"attributes\":{\"id\":\"fig_4\"},\"end\":34701,\"start\":34642},{\"attributes\":{\"id\":\"fig_5\"},\"end\":34743,\"start\":34702},{\"attributes\":{\"id\":\"tab_0\",\"type\":\"table\"},\"end\":35278,\"start\":34744},{\"attributes\":{\"id\":\"tab_1\",\"type\":\"table\"},\"end\":35373,\"start\":35279},{\"attributes\":{\"id\":\"tab_2\",\"type\":\"table\"},\"end\":36068,\"start\":35374},{\"attributes\":{\"id\":\"tab_3\",\"type\":\"table\"},\"end\":37998,\"start\":36069},{\"attributes\":{\"id\":\"tab_4\",\"type\":\"table\"},\"end\":39170,\"start\":37999}]", "paragraph": "[{\"end\":3706,\"start\":2878},{\"end\":4868,\"start\":3708},{\"end\":5992,\"start\":4870},{\"end\":6869,\"start\":5994},{\"end\":7854,\"start\":6871},{\"end\":8445,\"start\":7856},{\"end\":9563,\"start\":8495},{\"end\":10142,\"start\":9565},{\"end\":10943,\"start\":10205},{\"end\":11818,\"start\":10945},{\"end\":12294,\"start\":11857},{\"end\":12864,\"start\":12318},{\"end\":12870,\"start\":12866},{\"end\":12937,\"start\":12934},{\"end\":13271,\"start\":12939},{\"end\":13535,\"start\":13327},{\"end\":13545,\"start\":13537},{\"end\":13869,\"start\":13700},{\"end\":14071,\"start\":13982},{\"end\":16107,\"start\":14131},{\"end\":16254,\"start\":16109},{\"end\":16403,\"start\":16291},{\"end\":16519,\"start\":16426},{\"end\":17060,\"start\":16521},{\"end\":17655,\"start\":17117},{\"end\":18480,\"start\":17694},{\"end\":19788,\"start\":18539},{\"end\":20398,\"start\":19823},{\"end\":21123,\"start\":20655},{\"end\":22015,\"start\":21170},{\"end\":23012,\"start\":22017},{\"end\":23409,\"start\":23034},{\"end\":25764,\"start\":23411},{\"end\":26062,\"start\":25766},{\"end\":27161,\"start\":26064},{\"end\":27503,\"start\":27163},{\"end\":28406,\"start\":27505},{\"end\":28821,\"start\":28408},{\"end\":29614,\"start\":28823},{\"end\":30138,\"start\":29648},{\"end\":30965,\"start\":30140},{\"end\":32884,\"start\":30967},{\"end\":34483,\"start\":32900}]", "formula": "[{\"attributes\":{\"id\":\"formula_0\"},\"end\":12933,\"start\":12871},{\"attributes\":{\"id\":\"formula_1\"},\"end\":13326,\"start\":13272},{\"attributes\":{\"id\":\"formula_2\"},\"end\":13699,\"start\":13546},{\"attributes\":{\"id\":\"formula_3\"},\"end\":13981,\"start\":13870},{\"attributes\":{\"id\":\"formula_4\"},\"end\":16290,\"start\":16255},{\"attributes\":{\"id\":\"formula_5\"},\"end\":16425,\"start\":16404},{\"attributes\":{\"id\":\"formula_6\"},\"end\":17116,\"start\":17061},{\"attributes\":{\"id\":\"formula_7\"},\"end\":17693,\"start\":17656},{\"attributes\":{\"id\":\"formula_8\"},\"end\":20608,\"start\":20399},{\"attributes\":{\"id\":\"formula_9\"},\"end\":20654,\"start\":20608}]", "table_ref": "[{\"attributes\":{\"ref_id\":\"tab_0\"},\"end\":9562,\"start\":9555},{\"attributes\":{\"ref_id\":\"tab_1\"},\"end\":24222,\"start\":24215},{\"attributes\":{\"ref_id\":\"tab_1\"},\"end\":24295,\"start\":24288},{\"attributes\":{\"ref_id\":\"tab_2\"},\"end\":26655,\"start\":26648},{\"attributes\":{\"ref_id\":\"tab_3\"},\"end\":28512,\"start\":28505},{\"end\":29051,\"start\":29044},{\"attributes\":{\"ref_id\":\"tab_4\"},\"end\":29968,\"start\":29961},{\"attributes\":{\"ref_id\":\"tab_4\"},\"end\":30165,\"start\":30158}]", "section_header": "[{\"attributes\":{\"n\":\"1.\"},\"end\":2876,\"start\":2864},{\"attributes\":{\"n\":\"2.\"},\"end\":8459,\"start\":8448},{\"attributes\":{\"n\":\"2.1.\"},\"end\":8493,\"start\":8462},{\"attributes\":{\"n\":\"2.2.\"},\"end\":10203,\"start\":10145},{\"attributes\":{\"n\":\"2.2.1.\"},\"end\":11855,\"start\":11821},{\"attributes\":{\"n\":\"2.2.2.\"},\"end\":12316,\"start\":12297},{\"attributes\":{\"n\":\"2.3.\"},\"end\":14129,\"start\":14074},{\"attributes\":{\"n\":\"2.4.2.\"},\"end\":18537,\"start\":18483},{\"attributes\":{\"n\":\"2.5.\"},\"end\":19821,\"start\":19791},{\"attributes\":{\"n\":\"3.\"},\"end\":21148,\"start\":21126},{\"attributes\":{\"n\":\"3.1.\"},\"end\":21168,\"start\":21151},{\"attributes\":{\"n\":\"3.2.\"},\"end\":23032,\"start\":23015},{\"attributes\":{\"n\":\"3.3.\"},\"end\":29646,\"start\":29617},{\"attributes\":{\"n\":\"4.\"},\"end\":32898,\"start\":32887},{\"end\":34493,\"start\":34485},{\"end\":34536,\"start\":34528},{\"end\":34570,\"start\":34562},{\"end\":34659,\"start\":34643},{\"end\":34711,\"start\":34703},{\"end\":34752,\"start\":34745},{\"end\":35287,\"start\":35280},{\"end\":35382,\"start\":35375},{\"end\":36077,\"start\":36070},{\"end\":38007,\"start\":38000}]", "table": "[{\"end\":35278,\"start\":34825},{\"end\":35373,\"start\":35343},{\"end\":36068,\"start\":35419},{\"end\":37998,\"start\":37155},{\"end\":39170,\"start\":38090}]", "figure_caption": "[{\"end\":34526,\"start\":34495},{\"end\":34560,\"start\":34538},{\"end\":34641,\"start\":34572},{\"end\":34701,\"start\":34662},{\"end\":34743,\"start\":34713},{\"end\":34825,\"start\":34754},{\"end\":35343,\"start\":35289},{\"end\":35419,\"start\":35384},{\"end\":37155,\"start\":36079},{\"end\":38090,\"start\":38009}]", "figure_ref": "[{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":9394,\"start\":9388},{\"attributes\":{\"ref_id\":\"fig_1\"},\"end\":16006,\"start\":16000},{\"attributes\":{\"ref_id\":\"fig_1\"},\"end\":19036,\"start\":19027},{\"attributes\":{\"ref_id\":\"fig_3\"},\"end\":26268,\"start\":26254},{\"end\":27980,\"start\":27974}]", "bib_author_first_name": "[{\"end\":39413,\"start\":39412},{\"end\":39415,\"start\":39414},{\"end\":39424,\"start\":39423},{\"end\":39426,\"start\":39425},{\"end\":39438,\"start\":39437},{\"end\":39663,\"start\":39662},{\"end\":39665,\"start\":39664},{\"end\":39673,\"start\":39672},{\"end\":39675,\"start\":39674},{\"end\":39948,\"start\":39947},{\"end\":39959,\"start\":39958},{\"end\":39971,\"start\":39970},{\"end\":39984,\"start\":39983},{\"end\":39986,\"start\":39985},{\"end\":39996,\"start\":39995},{\"end\":40322,\"start\":40321},{\"end\":40336,\"start\":40335},{\"end\":40350,\"start\":40349},{\"end\":40364,\"start\":40363},{\"end\":40375,\"start\":40374},{\"end\":40377,\"start\":40376},{\"end\":40739,\"start\":40738},{\"end\":40751,\"start\":40750},{\"end\":40753,\"start\":40752},{\"end\":40772,\"start\":40771},{\"end\":40780,\"start\":40779},{\"end\":41202,\"start\":41201},{\"end\":41214,\"start\":41213},{\"end\":41533,\"start\":41532},{\"end\":41545,\"start\":41544},{\"end\":41853,\"start\":41852},{\"end\":41865,\"start\":41864},{\"end\":41878,\"start\":41877},{\"end\":41888,\"start\":41887},{\"end\":42260,\"start\":42259},{\"end\":42271,\"start\":42270},{\"end\":42293,\"start\":42292},{\"end\":42305,\"start\":42304},{\"end\":42314,\"start\":42313},{\"end\":42653,\"start\":42652},{\"end\":42664,\"start\":42663},{\"end\":42676,\"start\":42675},{\"end\":42967,\"start\":42966},{\"end\":42969,\"start\":42968},{\"end\":42977,\"start\":42976},{\"end\":42986,\"start\":42985},{\"end\":42988,\"start\":42987},{\"end\":43308,\"start\":43307},{\"end\":43321,\"start\":43320},{\"end\":43642,\"start\":43641},{\"end\":43646,\"start\":43643},{\"end\":43657,\"start\":43656},{\"end\":43659,\"start\":43658},{\"end\":43981,\"start\":43980},{\"end\":43996,\"start\":43995},{\"end\":44006,\"start\":44005},{\"end\":44387,\"start\":44386},{\"end\":44397,\"start\":44396},{\"end\":44408,\"start\":44407},{\"end\":44410,\"start\":44409},{\"end\":44734,\"start\":44733},{\"end\":44745,\"start\":44744},{\"end\":45045,\"start\":45044},{\"end\":45053,\"start\":45052},{\"end\":45066,\"start\":45065},{\"end\":45086,\"start\":45085},{\"end\":45459,\"start\":45458},{\"end\":45467,\"start\":45466},{\"end\":45475,\"start\":45474},{\"end\":45483,\"start\":45482},{\"end\":45880,\"start\":45879},{\"end\":46323,\"start\":46322},{\"end\":46325,\"start\":46324},{\"end\":46335,\"start\":46334},{\"end\":46337,\"start\":46336},{\"end\":46532,\"start\":46531},{\"end\":46534,\"start\":46533},{\"end\":46544,\"start\":46543},{\"end\":46546,\"start\":46545},{\"end\":46735,\"start\":46734},{\"end\":46737,\"start\":46736},{\"end\":46747,\"start\":46746},{\"end\":46749,\"start\":46748},{\"end\":46758,\"start\":46757},{\"end\":46760,\"start\":46759},{\"end\":47008,\"start\":47007},{\"end\":47018,\"start\":47017},{\"end\":47020,\"start\":47019},{\"end\":47284,\"start\":47283},{\"end\":47293,\"start\":47292},{\"end\":47295,\"start\":47294},{\"end\":47305,\"start\":47304},{\"end\":47307,\"start\":47306},{\"end\":47640,\"start\":47639},{\"end\":47649,\"start\":47648},{\"end\":47651,\"start\":47650},{\"end\":47661,\"start\":47660},{\"end\":47663,\"start\":47662},{\"end\":47990,\"start\":47989},{\"end\":47992,\"start\":47991},{\"end\":47999,\"start\":47998},{\"end\":48001,\"start\":48000},{\"end\":48012,\"start\":48011},{\"end\":48014,\"start\":48013},{\"end\":48023,\"start\":48022},{\"end\":48025,\"start\":48024},{\"end\":48035,\"start\":48034},{\"end\":48037,\"start\":48036},{\"end\":48047,\"start\":48046},{\"end\":48058,\"start\":48057},{\"end\":48060,\"start\":48059},{\"end\":48070,\"start\":48069},{\"end\":48072,\"start\":48071},{\"end\":48081,\"start\":48080},{\"end\":48512,\"start\":48511},{\"end\":48514,\"start\":48513},{\"end\":48522,\"start\":48521},{\"end\":48524,\"start\":48523},{\"end\":48533,\"start\":48532},{\"end\":48825,\"start\":48824},{\"end\":48832,\"start\":48831},{\"end\":48839,\"start\":48838},{\"end\":48847,\"start\":48846},{\"end\":48849,\"start\":48848},{\"end\":48858,\"start\":48857},{\"end\":49187,\"start\":49186},{\"end\":49478,\"start\":49477},{\"end\":49488,\"start\":49487},{\"end\":49490,\"start\":49489},{\"end\":49499,\"start\":49498},{\"end\":49838,\"start\":49837},{\"end\":49840,\"start\":49839},{\"end\":49847,\"start\":49846},{\"end\":49849,\"start\":49848},{\"end\":49857,\"start\":49856},{\"end\":50172,\"start\":50171},{\"end\":50174,\"start\":50173},{\"end\":50193,\"start\":50192},{\"end\":50205,\"start\":50204},{\"end\":50207,\"start\":50206},{\"end\":50513,\"start\":50512},{\"end\":50515,\"start\":50514},{\"end\":50523,\"start\":50522},{\"end\":50525,\"start\":50524},{\"end\":50532,\"start\":50531},{\"end\":50534,\"start\":50533},{\"end\":50541,\"start\":50540},{\"end\":50543,\"start\":50542},{\"end\":50551,\"start\":50550},{\"end\":50553,\"start\":50552},{\"end\":50560,\"start\":50559},{\"end\":50562,\"start\":50561},{\"end\":50568,\"start\":50567},{\"end\":50570,\"start\":50569},{\"end\":50576,\"start\":50575},{\"end\":50578,\"start\":50577},{\"end\":50586,\"start\":50585},{\"end\":50588,\"start\":50587},{\"end\":50913,\"start\":50912},{\"end\":50922,\"start\":50921},{\"end\":50924,\"start\":50923},{\"end\":50931,\"start\":50930},{\"end\":50942,\"start\":50941},{\"end\":50944,\"start\":50943},{\"end\":51144,\"start\":51143},{\"end\":51146,\"start\":51145}]", "bib_author_last_name": "[{\"end\":39421,\"start\":39416},{\"end\":39435,\"start\":39427},{\"end\":39447,\"start\":39439},{\"end\":39670,\"start\":39666},{\"end\":39681,\"start\":39676},{\"end\":39956,\"start\":39949},{\"end\":39968,\"start\":39960},{\"end\":39981,\"start\":39972},{\"end\":39993,\"start\":39987},{\"end\":40002,\"start\":39997},{\"end\":40333,\"start\":40323},{\"end\":40347,\"start\":40337},{\"end\":40361,\"start\":40351},{\"end\":40372,\"start\":40365},{\"end\":40382,\"start\":40378},{\"end\":40748,\"start\":40740},{\"end\":40769,\"start\":40754},{\"end\":40777,\"start\":40773},{\"end\":40788,\"start\":40781},{\"end\":41211,\"start\":41203},{\"end\":41224,\"start\":41215},{\"end\":41542,\"start\":41534},{\"end\":41555,\"start\":41546},{\"end\":41862,\"start\":41854},{\"end\":41875,\"start\":41866},{\"end\":41885,\"start\":41879},{\"end\":41903,\"start\":41889},{\"end\":42268,\"start\":42261},{\"end\":42290,\"start\":42272},{\"end\":42302,\"start\":42294},{\"end\":42311,\"start\":42306},{\"end\":42322,\"start\":42315},{\"end\":42661,\"start\":42654},{\"end\":42673,\"start\":42665},{\"end\":42684,\"start\":42677},{\"end\":42974,\"start\":42970},{\"end\":42983,\"start\":42978},{\"end\":42997,\"start\":42989},{\"end\":43318,\"start\":43309},{\"end\":43334,\"start\":43322},{\"end\":43654,\"start\":43647},{\"end\":43666,\"start\":43660},{\"end\":43993,\"start\":43982},{\"end\":44003,\"start\":43997},{\"end\":44013,\"start\":44007},{\"end\":44394,\"start\":44388},{\"end\":44405,\"start\":44398},{\"end\":44418,\"start\":44411},{\"end\":44742,\"start\":44735},{\"end\":44752,\"start\":44746},{\"end\":45050,\"start\":45046},{\"end\":45063,\"start\":45054},{\"end\":45083,\"start\":45067},{\"end\":45092,\"start\":45087},{\"end\":45464,\"start\":45460},{\"end\":45472,\"start\":45468},{\"end\":45480,\"start\":45476},{\"end\":45500,\"start\":45484},{\"end\":45888,\"start\":45881},{\"end\":46332,\"start\":46326},{\"end\":46343,\"start\":46338},{\"end\":46541,\"start\":46535},{\"end\":46552,\"start\":46547},{\"end\":46744,\"start\":46738},{\"end\":46755,\"start\":46750},{\"end\":46766,\"start\":46761},{\"end\":47015,\"start\":47009},{\"end\":47027,\"start\":47021},{\"end\":47290,\"start\":47285},{\"end\":47302,\"start\":47296},{\"end\":47313,\"start\":47308},{\"end\":47646,\"start\":47641},{\"end\":47658,\"start\":47652},{\"end\":47669,\"start\":47664},{\"end\":47996,\"start\":47993},{\"end\":48009,\"start\":48002},{\"end\":48020,\"start\":48015},{\"end\":48032,\"start\":48026},{\"end\":48044,\"start\":48038},{\"end\":48055,\"start\":48048},{\"end\":48067,\"start\":48061},{\"end\":48078,\"start\":48073},{\"end\":48092,\"start\":48082},{\"end\":48519,\"start\":48515},{\"end\":48530,\"start\":48525},{\"end\":48540,\"start\":48534},{\"end\":48829,\"start\":48826},{\"end\":48836,\"start\":48833},{\"end\":48844,\"start\":48840},{\"end\":48855,\"start\":48850},{\"end\":48870,\"start\":48859},{\"end\":49194,\"start\":49188},{\"end\":49485,\"start\":49479},{\"end\":49496,\"start\":49491},{\"end\":49509,\"start\":49500},{\"end\":49844,\"start\":49841},{\"end\":49854,\"start\":49850},{\"end\":49860,\"start\":49858},{\"end\":50190,\"start\":50175},{\"end\":50202,\"start\":50194},{\"end\":50220,\"start\":50208},{\"end\":50520,\"start\":50516},{\"end\":50529,\"start\":50526},{\"end\":50538,\"start\":50535},{\"end\":50548,\"start\":50544},{\"end\":50557,\"start\":50554},{\"end\":50565,\"start\":50563},{\"end\":50573,\"start\":50571},{\"end\":50583,\"start\":50579},{\"end\":50592,\"start\":50589},{\"end\":50919,\"start\":50914},{\"end\":50928,\"start\":50925},{\"end\":50939,\"start\":50932},{\"end\":50949,\"start\":50945},{\"end\":51150,\"start\":51147}]", "bib_entry": "[{\"attributes\":{\"id\":\"b0\",\"matched_paper_id\":129514998},\"end\":39573,\"start\":39373},{\"attributes\":{\"id\":\"b1\",\"matched_paper_id\":5070540},\"end\":39851,\"start\":39575},{\"attributes\":{\"id\":\"b2\",\"matched_paper_id\":54761523},\"end\":40237,\"start\":39853},{\"attributes\":{\"id\":\"b3\",\"matched_paper_id\":62791806},\"end\":40580,\"start\":40239},{\"attributes\":{\"id\":\"b4\",\"matched_paper_id\":41792368},\"end\":41071,\"start\":40582},{\"attributes\":{\"id\":\"b5\",\"matched_paper_id\":34586296},\"end\":41474,\"start\":41073},{\"attributes\":{\"id\":\"b6\",\"matched_paper_id\":42677510},\"end\":41704,\"start\":41476},{\"attributes\":{\"id\":\"b7\",\"matched_paper_id\":40431292},\"end\":42156,\"start\":41706},{\"attributes\":{\"id\":\"b8\",\"matched_paper_id\":129042809},\"end\":42557,\"start\":42158},{\"attributes\":{\"id\":\"b9\",\"matched_paper_id\":54747028},\"end\":42867,\"start\":42559},{\"attributes\":{\"id\":\"b10\",\"matched_paper_id\":212591150},\"end\":43169,\"start\":42869},{\"attributes\":{\"id\":\"b11\",\"matched_paper_id\":155241766},\"end\":43578,\"start\":43171},{\"attributes\":{\"id\":\"b12\"},\"end\":43839,\"start\":43580},{\"attributes\":{\"id\":\"b13\",\"matched_paper_id\":53329765},\"end\":44284,\"start\":43841},{\"attributes\":{\"id\":\"b14\",\"matched_paper_id\":60750252},\"end\":44633,\"start\":44286},{\"attributes\":{\"id\":\"b15\",\"matched_paper_id\":6186690},\"end\":44942,\"start\":44635},{\"attributes\":{\"id\":\"b16\",\"matched_paper_id\":30048275},\"end\":45322,\"start\":44944},{\"attributes\":{\"id\":\"b17\",\"matched_paper_id\":7545873},\"end\":45760,\"start\":45324},{\"attributes\":{\"id\":\"b18\",\"matched_paper_id\":154604685},\"end\":46119,\"start\":45762},{\"attributes\":{\"id\":\"b19\"},\"end\":46275,\"start\":46121},{\"attributes\":{\"id\":\"b20\",\"matched_paper_id\":17089461},\"end\":46499,\"start\":46277},{\"attributes\":{\"id\":\"b21\",\"matched_paper_id\":129306017},\"end\":46660,\"start\":46501},{\"attributes\":{\"id\":\"b22\",\"matched_paper_id\":140659841},\"end\":46937,\"start\":46662},{\"attributes\":{\"id\":\"b23\",\"matched_paper_id\":14241619},\"end\":47171,\"start\":46939},{\"attributes\":{\"id\":\"b24\",\"matched_paper_id\":129625935},\"end\":47528,\"start\":47173},{\"attributes\":{\"id\":\"b25\",\"matched_paper_id\":55879578},\"end\":47879,\"start\":47530},{\"attributes\":{\"id\":\"b26\",\"matched_paper_id\":111144955},\"end\":48400,\"start\":47881},{\"attributes\":{\"id\":\"b27\",\"matched_paper_id\":12470154},\"end\":48734,\"start\":48402},{\"attributes\":{\"id\":\"b28\",\"matched_paper_id\":114546386},\"end\":49091,\"start\":48736},{\"attributes\":{\"id\":\"b29\",\"matched_paper_id\":6405705},\"end\":49364,\"start\":49093},{\"attributes\":{\"id\":\"b30\",\"matched_paper_id\":109953763},\"end\":49737,\"start\":49366},{\"attributes\":{\"id\":\"b31\",\"matched_paper_id\":18519616},\"end\":50055,\"start\":49739},{\"attributes\":{\"id\":\"b32\",\"matched_paper_id\":3826822},\"end\":50438,\"start\":50057},{\"attributes\":{\"id\":\"b33\",\"matched_paper_id\":129224028},\"end\":50853,\"start\":50440},{\"attributes\":{\"id\":\"b34\",\"matched_paper_id\":128832523},\"end\":51139,\"start\":50855},{\"attributes\":{\"id\":\"b35\"},\"end\":51272,\"start\":51141}]", "bib_title": "[{\"end\":39410,\"start\":39373},{\"end\":39660,\"start\":39575},{\"end\":39945,\"start\":39853},{\"end\":40319,\"start\":40239},{\"end\":40736,\"start\":40582},{\"end\":41199,\"start\":41073},{\"end\":41530,\"start\":41476},{\"end\":41850,\"start\":41706},{\"end\":42257,\"start\":42158},{\"end\":42650,\"start\":42559},{\"end\":42964,\"start\":42869},{\"end\":43305,\"start\":43171},{\"end\":43978,\"start\":43841},{\"end\":44384,\"start\":44286},{\"end\":44731,\"start\":44635},{\"end\":45042,\"start\":44944},{\"end\":45456,\"start\":45324},{\"end\":45877,\"start\":45762},{\"end\":46320,\"start\":46277},{\"end\":46529,\"start\":46501},{\"end\":46732,\"start\":46662},{\"end\":47005,\"start\":46939},{\"end\":47281,\"start\":47173},{\"end\":47637,\"start\":47530},{\"end\":47987,\"start\":47881},{\"end\":48509,\"start\":48402},{\"end\":48822,\"start\":48736},{\"end\":49184,\"start\":49093},{\"end\":49475,\"start\":49366},{\"end\":49835,\"start\":49739},{\"end\":50169,\"start\":50057},{\"end\":50510,\"start\":50440},{\"end\":50910,\"start\":50855}]", "bib_author": "[{\"end\":39423,\"start\":39412},{\"end\":39437,\"start\":39423},{\"end\":39449,\"start\":39437},{\"end\":39672,\"start\":39662},{\"end\":39683,\"start\":39672},{\"end\":39958,\"start\":39947},{\"end\":39970,\"start\":39958},{\"end\":39983,\"start\":39970},{\"end\":39995,\"start\":39983},{\"end\":40004,\"start\":39995},{\"end\":40335,\"start\":40321},{\"end\":40349,\"start\":40335},{\"end\":40363,\"start\":40349},{\"end\":40374,\"start\":40363},{\"end\":40384,\"start\":40374},{\"end\":40750,\"start\":40738},{\"end\":40771,\"start\":40750},{\"end\":40779,\"start\":40771},{\"end\":40790,\"start\":40779},{\"end\":41213,\"start\":41201},{\"end\":41226,\"start\":41213},{\"end\":41544,\"start\":41532},{\"end\":41557,\"start\":41544},{\"end\":41864,\"start\":41852},{\"end\":41877,\"start\":41864},{\"end\":41887,\"start\":41877},{\"end\":41905,\"start\":41887},{\"end\":42270,\"start\":42259},{\"end\":42292,\"start\":42270},{\"end\":42304,\"start\":42292},{\"end\":42313,\"start\":42304},{\"end\":42324,\"start\":42313},{\"end\":42663,\"start\":42652},{\"end\":42675,\"start\":42663},{\"end\":42686,\"start\":42675},{\"end\":42976,\"start\":42966},{\"end\":42985,\"start\":42976},{\"end\":42999,\"start\":42985},{\"end\":43320,\"start\":43307},{\"end\":43336,\"start\":43320},{\"end\":43656,\"start\":43641},{\"end\":43668,\"start\":43656},{\"end\":43995,\"start\":43980},{\"end\":44005,\"start\":43995},{\"end\":44015,\"start\":44005},{\"end\":44396,\"start\":44386},{\"end\":44407,\"start\":44396},{\"end\":44420,\"start\":44407},{\"end\":44744,\"start\":44733},{\"end\":44754,\"start\":44744},{\"end\":45052,\"start\":45044},{\"end\":45065,\"start\":45052},{\"end\":45085,\"start\":45065},{\"end\":45094,\"start\":45085},{\"end\":45466,\"start\":45458},{\"end\":45474,\"start\":45466},{\"end\":45482,\"start\":45474},{\"end\":45502,\"start\":45482},{\"end\":45890,\"start\":45879},{\"end\":46334,\"start\":46322},{\"end\":46345,\"start\":46334},{\"end\":46543,\"start\":46531},{\"end\":46554,\"start\":46543},{\"end\":46746,\"start\":46734},{\"end\":46757,\"start\":46746},{\"end\":46768,\"start\":46757},{\"end\":47017,\"start\":47007},{\"end\":47029,\"start\":47017},{\"end\":47292,\"start\":47283},{\"end\":47304,\"start\":47292},{\"end\":47315,\"start\":47304},{\"end\":47648,\"start\":47639},{\"end\":47660,\"start\":47648},{\"end\":47671,\"start\":47660},{\"end\":47998,\"start\":47989},{\"end\":48011,\"start\":47998},{\"end\":48022,\"start\":48011},{\"end\":48034,\"start\":48022},{\"end\":48046,\"start\":48034},{\"end\":48057,\"start\":48046},{\"end\":48069,\"start\":48057},{\"end\":48080,\"start\":48069},{\"end\":48094,\"start\":48080},{\"end\":48521,\"start\":48511},{\"end\":48532,\"start\":48521},{\"end\":48542,\"start\":48532},{\"end\":48831,\"start\":48824},{\"end\":48838,\"start\":48831},{\"end\":48846,\"start\":48838},{\"end\":48857,\"start\":48846},{\"end\":48872,\"start\":48857},{\"end\":49196,\"start\":49186},{\"end\":49487,\"start\":49477},{\"end\":49498,\"start\":49487},{\"end\":49511,\"start\":49498},{\"end\":49846,\"start\":49837},{\"end\":49856,\"start\":49846},{\"end\":49862,\"start\":49856},{\"end\":50192,\"start\":50171},{\"end\":50204,\"start\":50192},{\"end\":50222,\"start\":50204},{\"end\":50522,\"start\":50512},{\"end\":50531,\"start\":50522},{\"end\":50540,\"start\":50531},{\"end\":50550,\"start\":50540},{\"end\":50559,\"start\":50550},{\"end\":50567,\"start\":50559},{\"end\":50575,\"start\":50567},{\"end\":50585,\"start\":50575},{\"end\":50594,\"start\":50585},{\"end\":50921,\"start\":50912},{\"end\":50930,\"start\":50921},{\"end\":50941,\"start\":50930},{\"end\":50951,\"start\":50941},{\"end\":51152,\"start\":51143}]", "bib_venue": "[{\"end\":39458,\"start\":39449},{\"end\":39700,\"start\":39683},{\"end\":40027,\"start\":40004},{\"end\":40393,\"start\":40384},{\"end\":40806,\"start\":40790},{\"end\":41259,\"start\":41226},{\"end\":41574,\"start\":41557},{\"end\":41914,\"start\":41905},{\"end\":42337,\"start\":42324},{\"end\":42695,\"start\":42686},{\"end\":43003,\"start\":42999},{\"end\":43356,\"start\":43336},{\"end\":43639,\"start\":43580},{\"end\":44044,\"start\":44015},{\"end\":44445,\"start\":44420},{\"end\":44771,\"start\":44754},{\"end\":45117,\"start\":45094},{\"end\":45525,\"start\":45502},{\"end\":45924,\"start\":45890},{\"end\":46148,\"start\":46123},{\"end\":46372,\"start\":46345},{\"end\":46563,\"start\":46554},{\"end\":46782,\"start\":46768},{\"end\":47039,\"start\":47029},{\"end\":47331,\"start\":47315},{\"end\":47687,\"start\":47671},{\"end\":48117,\"start\":48094},{\"end\":48552,\"start\":48542},{\"end\":48892,\"start\":48872},{\"end\":49211,\"start\":49196},{\"end\":49534,\"start\":49511},{\"end\":49879,\"start\":49862},{\"end\":50232,\"start\":50222},{\"end\":50606,\"start\":50594},{\"end\":50979,\"start\":50951},{\"end\":51192,\"start\":51152}]"}}}, "year": 2023, "month": 12, "day": 17}