{"id": 33491413, "updated": "2022-03-08 17:12:11.139", "metadata": {"title": "Initial alignment for nonlinear inertial navigation systems with multiple disturbances based on enhanced anti-disturbance filtering", "authors": "[{\"first\":\"Lei\",\"last\":\"Guo\",\"middle\":[]},{\"first\":\"Songyin\",\"last\":\"Cao\",\"middle\":[]},{\"first\":\"Chuntang\",\"last\":\"Qi\",\"middle\":[]},{\"first\":\"Xiaoying\",\"last\":\"Gao\",\"middle\":[]}]", "venue": null, "journal": "International Journal of Control", "publication_date": {"year": 2012, "month": null, "day": null}, "abstract": "Initial alignment for inertial navigation system (INS) has been widely used in practice under the assumption of Gaussian noises. In most previous works, nonlinear dynamics was ignored and the disturbances were merged into either a Gaussian or norm-bounded variable, where the Kalman filtering or robust filtering can be applied, respectively. In this article, the unmodelled nonlinear dynamics, drifts, parametric uncertainties, as well as other disturbances are considered simultaneously and are formulated into different types of uncertain disturbances described by the exo-system, stochastic and norm-bounded variable, respectively. A nonlinear initial alignment approach for INS is first presented based on a new disturbance attenuation and rejection filtering scheme against multiple disturbances. The INS error model with both nonlinear dynamics and multiple disturbances is established and the initial alignment problem is transformed into a robust nonlinear filter design problem for a class of nonlinear systems with multiple disturbances. In the proposed composite filtering approach, the drift filter is designed to estimate and compensate the inertial sensor drift. Mixed H 2/H ∞ filtering is designed to optimise the estimation error and attenuate the norm-bounded uncertain disturbances, respectively. Simulations for ground stationary base initial alignment of an INS are provided. Comparisons show that the concerned INS has the enhanced disturbance rejection and attenuation performance.", "fields_of_study": "[\"Computer Science\"]", "external_ids": {"arxiv": null, "mag": "2065292058", "acl": null, "pubmed": null, "pubmedcentral": null, "dblp": "journals/ijcon/GuoCQG12", "doi": "10.1080/00207179.2012.658523"}}, "content": {"source": {"pdf_hash": "4ca6557c89ca4f43c0f5c4e28af4e14a052cf188", "pdf_src": "TaylorAndFrancis", "pdf_uri": null, "oa_url_match": false, "oa_info": null}, "grobid": {"id": "ed6a96756f90495c58428f5d57f8b64a533d6f8c", "type": "plain-text", "url": "s3://ai2-s2-pdf-extraction-prod/parse-results/s2orc_worker/4ca6557c89ca4f43c0f5c4e28af4e14a052cf188.txt", "contents": "\nInitial alignment for nonlinear inertial navigation systems with multiple disturbances based on enhanced anti-disturbance filtering\nMay 2012\n\nLei Guo \nSchool of Instrumentation Science and Opto-Electronics Engineering\nNational Key Laboratory on Aircraft Control Technology\nBeihang University\n100191BeijingP.R. China\n\nSongyin Cao \nChuntang Qi \nNational Key Laboratory of Aerospace Intelligent Control Technology\n100854BeijingP.R. China\n\nXiaoying Gao \nNational Key Laboratory of Aerospace Intelligent Control Technology\n100854BeijingP.R. China\n\n\nDepartment of Automation\nCollege of Information Engineering\nYangzhou University\n225127YangzhouP.R. China\n\nInitial alignment for nonlinear inertial navigation systems with multiple disturbances based on enhanced anti-disturbance filtering\n\nInternational Journal of Control\n855May 201210.1080/00207179.2012.658523(Received 8 May 2011; final version received 14 January 2012)robust filteringinitial alignmentnonlinear inertial navigation systemmulti-objective optimisationmultiple disturbancesdisturbance attenuation and rejection\nInitial alignment for inertial navigation system (INS) has been widely used in practice under the assumption of Gaussian noises. In most previous works, nonlinear dynamics was ignored and the disturbances were merged into either a Gaussian or norm-bounded variable, where the Kalman filtering or robust filtering can be applied, respectively. In this article, the unmodelled nonlinear dynamics, drifts, parametric uncertainties, as well as other disturbances are considered simultaneously and are formulated into different types of uncertain disturbances described by the exo-system, stochastic and norm-bounded variable, respectively. A nonlinear initial alignment approach for INS is first presented based on a new disturbance attenuation and rejection filtering scheme against multiple disturbances. The INS error model with both nonlinear dynamics and multiple disturbances is established and the initial alignment problem is transformed into a robust nonlinear filter design problem for a class of nonlinear systems with multiple disturbances. In the proposed composite filtering approach, the drift filter is designed to estimate and compensate the inertial sensor drift. Mixed H 2 /H 1 filtering is designed to optimise the estimation error and attenuate the norm-bounded uncertain disturbances, respectively. Simulations for ground stationary base initial alignment of an INS are provided. Comparisons show that the concerned INS has the enhanced disturbance rejection and attenuation performance.\n\nIntroduction\n\nAn inertial navigation system (INS) is a navigation aid that utilises motion sensors (accelerometers), rotation sensors (gyroscopes) and a navigation processer to continuously calculate via dead reckoning the position, velocity and orientation of a moving object. It has been widely used for the positioning and navigation of airplanes, vehicles and ships because of its high autonomy, continuum and high accuracy in short time (see Farrell and Barth 1999;Grewal, Weill, and Andrews 2007;Rogers 2007, and references therein). INS can be classified into gimballed INS (GINS) and strapdown INS (SINS). The principle of inertial navigation is simple. With a precise knowledge of the initial position and attitude of the vehicle, at any time, single and double integration of the accelerometer outputs will provide velocity and position information, respectively, and the attitude is obtained by integrating rotational rated from the gyro measurements (Nebot and Durrant-Whyte 1999). In the process of calculating navigation parameters, the attitude errors accumulate with time extendibility and induce other navigation errors because the attitude angle terms are integrated for the velocity and the position. Therefore, one of the most important problems for INS is initial alignment and calibration, which affect the navigation accuracy directly. The purpose of initial alignment of SINS is to determine the attitude matrix from body frame to navigation frame and to compensate misalignment angles based on the estimated values. The principle of initial alignment of SINS is similar to that of GINS, in both of which filtering is widely utilised as one of the key technologies.\n\nIn modern control area, the problem of state estimation has been one of the hot topics in the control area and there have been many works following Kalman filtering (in the stochastic framework) and Luenberger observer (in the deterministic framework). The Kalman filter (KF) is one of optimal linear estimators to minimise the error variance, while for nonlinear systems, the extended Kalman filter (EKF) and unscented Kalman filter (UKF) have also been provided. Until now, Kalman-type filtering methods (including KF, EKF and UKF) were effectively used in most of the existing results for the initial alignment problems (see, e.g. Fang and Wan 1996;Scherzinger 1996;Jiang 1998;Ahn and Won 2006;Grewal et al. 2007;Rogers 2007;Lu¨and Xie 2009;Wang 2009). However, the Kalman-type filters require the exact plant model and noises with known statistical properties, which are often not satisfied in practical processes. The performance of the Kalmantype filters could be degraded when the concerned system is with model uncertainties, non-Gaussian noises and other types of disturbances. In order to overcome the drawbacks of Kalman filtering, robust filtering and estimation problems have been studied in the past decade. Different from the Kalman-type filters, no statistical assumptions on the noises are required and the norm-bounded uncertainties can be dealt with. Among the robust filtering methods, the H 1 and H 2 filtering are widely applied to state observation, parameter estimation and fault diagnosis problems (see Xu, Lam, Chen, and Zou 2005;Guo, Yang, and Fang 2006;Guo and Wang 2009, and references therein). Other new effective filtering methodologies include the unknown input estimation (Floquet and Barbot 2006;Gao and Ding 2007) and non-Gaussian stochastic filtering (Guo and Wang 2009). Until now, most robust filtering have not been effectively applied to solve the initial alignment problem due to the special characteristics and complexity of INS.\n\nThere are two fundamental types of alignment process: stationary base alignment and in-flight alignment. Self-alignment schemes have been widely adopted to stationary base alignment, where the gyroscopes are applied to measure the earth rate and the accelerometers are used to measure the local gravity acceleration (Farrell and Barth 1999;Wang 2009;Cao and Guo 2011). For in-flight alignment, the work process is to estimate and calibrate the platform error angles with the external aiding position and velocity information, which is from GPS or other sensors. The design of in-flight alignment is mainly based on multi-sensor fusion technologies, which would be the main trend in navigation system research and development (Lee and Lee 2002;Yu, Lee, and Park 2004;Zhang and Gao 2007). The low-cost INS based on Micro Electro Mechanical System (MEMS) has become a hot issue of research with the advantages of small size, light weight, low power consumption, low cost and so on. For low-cost INS, the initial alignment is still a challenging issue because of the high noises of the low-cost inertial sensors. The initial position and velocity can be easily obtained from GPS or other aiding sensors (Nebot and Durrant-Whyte 1999;Han and Wang 2010). To transfer information between different sensors that are located apart from each other, transfer alignment is the process of simultaneously initializing and calibrating a slave INS using data from master navigation system (Groves 2003). In addition, two obstacles still exist to influence the filtering performance for stationary base alignment. First, most of the previous alignment methods are focused on the small attitude error case, so the linear INS error models can be established and attitude can be determined coarsely (Fang and Wan 1996;Jiang 1998;Lu¨and Xie 2009;Cao and Guo 2011). In practice, the heading error is much larger than the levelling error, so the linearisation of heading error will lead to considerable modelling errors. That is, nonlinear dynamics should be considered for higher precision of INS. Second, the plant models are supposed to have one single-type disturbance (either Gaussian variable or norm-bounded variable), for which the Kalman-type filtering and robust filtering can be applied. However, along with the development of sensor technology and data processing, multiple disturbances exist in most practical systems and one can formulate them into different mathematical descriptions after modelling analysis and error analysis. For example, the inertial sensor drifts can be described by a Gaussian Markov process as discussed in Rogers (2007), for which either Kalman filtering or robust filtering may be unappropriate. In fact, circuit noises, external disturbances and unmodelled dynamics can be modelled by different formulations including exo-systems, harmonic signals and normbounded variables (Guo and Chen 2005;Cao and Guo 2009;Wei and Guo 2009;Cao and Guo 2011).\n\nIn this article, we attempt to present a new robust filtering algorithm for the initial alignment problem of nonlinear INS. A new nonlinear INS error model with multiple disturbances is established, where the nonlinear dynamics and different types of disturbances in INS are analysed and modelled, respectively. Concretely, the inertial sensor drifts is described by a Gaussian Markov process. The modelling uncertainties, perturbations and non-Gaussian stochastic noises are merged into a norm-bounded variable. With the known characteristics of disturbances, a robust antidisturbance filter is designed with simultaneous disturbance rejection and attenuation performance for the nonlinear INS. In the proposed scheme, the sensor bias estimations are applied to reject the inertial sensor drifts, while H 1 performance is adopted to attenuate norm-bounded uncertain disturbances and the guarantee cost index is applied to optimise the estimation error respectively.\n\nThe remainder of this article is organised as follows. In Section 2, the nonlinear SINS error model with multiple disturbances for ground stationary base is established. In Section 3, the robust anti-disturbance filter is designed for the initial alignment problem. Simulations based on experimental data are given in Section 4 to show the efficiency of the proposed method. Conclusions are given in Section 5.\n\nNotation: Throughout this article, for a vector s(t), its Euclidean norm is defined by ks(t)k 2 ¼ s T (t)s(t), for any given t. A real symmetric matrix P 4 (!)0 denotes P being a positive definite (positive semi-definite) matrix, and A 4 (!)B means A À B 4 (!)0. I is used to denote an identity matrix with proper dimension. Matrices, if not explicitly stated, are supposed to have compatible dimensions. The symmetric terms in a symmetric matrix are denoted by *.\n\n\nNonlinear INS error modelling\n\nAn INS is a dead reckoning navigation system, which comprises a set of inertial sensors and navigation computer. Theoretically, single and double integration of the gyro and accelerometer outputs will provide velocity and position information. Alignment is the process whereby the orientation of the axes of an INS is determined with respect to the reference coordinate system. The orientation is essential to obtain acceleration in the navigation frame and then to evaluate the single and double integration for velocity and position determination (Nebot and Durrant-Whyte 1999). The objective of initial alignment for SINS is to determine an attitude matrix from body frame b to navigation frame n. See the 3D diagrams plotted in Figure 1. We take no account of the linearisation of azimuth misalignment angle, because the heading error is much larger than the levelling error in many practical processes. In this article, the local level East-North-Up (ENU) frame is selected as the navigation frame. For an INS on ground stationary base, the local position of a vehicle can be known in advance. Therefore, the positional and velocity errors are ignored. Then, the modified SINS large azimuth misalignment error model can be formulated as follows (Scherzinger 1996):\n_ ¼ ðI À C t n Þw n ie þ C n b \" b ,ð1Þ\nwhere\n¼ E ðtÞ N ðtÞ U ðtÞ Â Ã T and \" b ¼ \" x ðtÞ \" y ðtÞ \" z ðtÞ Â\nÃ T are the misalignment angles and gyroscope random bias, respectively. C t n is the transformation matrix between the navigation frame n and computation frame t, which can be further described by C n b is the attitude transformation matrix relating the body frame b with navigation frame n and is denoted as\nC t n ¼ cos U ðtÞ sin U ðtÞ À NðtÞC n b ¼ fC ij g i,j¼1,2,3 :ð3Þ\nIn frame n, the local gravity acceleration g and earth rate w ie can be described by\ng n ¼ ½ 0 0 Àg Tð4Þ\nand\nw n ie ¼ ½ 0 N U T :ð5Þ\nThe superscript n denotes the navigation frame. U and N are the up and north components of earth rate, respectively. The gyroscope is applied to measure the earth rate w ie and accelerometer to measure the local gravity acceleration g for INS on ground stationary base. Thus, the error equation with multiple disturbances can be further described as \n_ E ðtÞ _ N ðtÞ _ U ðtÞ 2 6 4 3 7 5 ¼ F 0 E ðtÞ NðtÞ\nwhere the matrix F 0 is defined as\nX i Y i Z i U E N O Z b X b Y b Figure 1. 3D diagrams of coordinate systems. F 0 ¼ 0 U 0 À U 0 0 0 0 0 2 6 4 3 7 5ð7Þ\nand\nf 0 ðÞ ¼ À N sin U N ð1 À cos U Þ À N E Â Ã T :ð8Þ\nHere d(t) represents the norm-bounded disturbance, which results from the modelling error, system noises and uncertainties in the exogenous system. B 1 is a known coefficient matrices of the system with suitable dimensions. The subscripts E, N and U are corresponding to east, norths up of the navigation frame n, and the subscripts x, y and z denote right, front and up of the body frame b, respectively. Similar to Cao and Guo (2011) and Farrell and Barth (1999), the level accelerometer outputs f E (t), f N (t) and east gyro output w E (t) are selected as measured signals during the stationary base alignment. However, in this article we consider the nonlinear dynamics and get the following measurement output equation:\nf E ðtÞ f N ðtÞ w E ðtÞ 2 6 4 3 7 5 ¼ H E ðtÞ N ðtÞ U ðtÞ 2 6 4 3 7 5 þ D b ! b ðtÞ þ g 0 ðÞ þ D 1 d ðtÞ,ð9Þ\nwhere\nH ¼ 0 g 0 Àg 0 0 0 À U 0 2 6 4 3 7 5,ð10ÞD b ¼ 0 0 0 C 11 C 12 0 0 0 C 21 C 22 C 11 C 12 C 13 0 0 2 6 4 3 7 5ð11Þ\nand\ng 0 ðÞ ¼ 0 0 N sin U Â Ã T :ð12Þ\nIn (9), the inertial sensor bias error value is denoted by\n! b ðtÞ ¼ ½ \" x ðtÞ \" y ðtÞ \" z ðtÞ r x ðtÞ r y ðtÞ T ,\nwhere r represents the accelerometer biases. The inertial sensor bias values can be supposed to satisfy the first-order Gaussian Markov process, which can be described by\n_ !ðtÞ ¼ W!ðtÞ þ Ed ðtÞ,ð13Þ\nwhere W ¼ diagfÀ 1 1 , . . . , À 1 5 g and i (i ¼ 1, . . . , 5) are correlation times of Markov process. In (9) and (13), H, D b , D 1 and E represent the known coefficient matrices with suitable dimensions.\n\nRemark 1: In most previous works such as Fang and Wan (1996), Wang (2009) and Wang and Guo (2008), the drifts are simplified to be random constants. In this article, we adopt (13) to represent the inertial sensor drift, which can approximate the physical random processes with a reasonable accuracy (Rogers 2007). In addition, the mechanical vibration, modelling error and environment disturbance of SINS are merged into a norm-bounded disturbance d(t) rather than a Gaussian white noise. And, nonlinear dynamics is preserved in the INS model which reduces the conservatism and can be generalised to in-flight alignment problems.\n\nThe relationships of gyro and accelerometer outputs between navigation frame and body frame can be denoted as\nC n b ½ \" x \" y \" z T ¼ ½ \" E \" N \" U Tð14Þ\nand\nC n b ½ r x r y r z T ¼ ½ r E r N r U T :ð15Þ\nBased on (14) and (15), the Equations (6) and (9) can be further formulated as \n_ E ðtÞ _ N ðtÞ _ UðtÞ\nActually, the transformed system model (16) of SINS is similar to the model of GINS. From the definitions of the system matrix (7) and output matrix (10), it can be calculated that the observability index of pair (F 0 , H ) is equal to 2. The expansions of sinusoidal and cosine functions can be denoted as follows:\nsinð U Þ ¼ U À 3 U 6 þ 5 U 120 þ oð 5 U Þð17Þ\nand\ncosð U Þ ¼ 1 À 2 U 2 þ 4 U 24 þ oð 5 U Þ:ð18Þ\nApplying (17) and (18)  Here u(t) is the control input for calibrating and compensating. !ðtÞ ¼ ½\" E ðtÞ \" N ðtÞ \" U ðtÞ r E ðtÞ r N ðtÞ T is the inertial sensor bias values in frame n. B 1 and D 1 are denoted in (6) and (9), respectively. And, The nonlinear terms can be denoted as\nA ¼ 0 U À N À U 0 0 N 0 0 2 4 3 5 , C ¼ 0 g 0 Àg 0 0 0 À U Nf ðxðtÞÞ ¼ À 3 U 6 þ 5 U 120 2 U 2 À 4 U 24 E ! T ,ð20Þ\nand\ngðxðtÞÞ ¼ 0 0 À 3 U 6 þ 5 U 120 ! Tð21Þ\nwhere,\nE ¼ N U À 3 U 6 þ 5 U 120 À E À 2 U 2 þ 4 U 24 :\nCorrespondingly, the parameter matrices are denoted by\nF ¼ diag{À N , N , À N } and G ¼ diag{0, 0, N }. d(t)\nis the norm-bounded disturbance. For the stationary base initial alignment, the initial misalignment angles should be in a proper interval. Therefore, the high-order infinitesimal term oð 5 U Þ can be merged into the norm-bounded disturbance d(t).\n\nAfter the INS error model is established, the nonlinear initial alignment for INS on ground stationary base can be transformed into a robust filter design problem for nonlinear systems with multiple disturbances. If F ¼ 0 and G ¼ 0, the nonlinear model (19) can be degenerated to be the linear model. The nonlinear dynamics existing in both the state equation and the output equation of the dynamical systems forms the key difficulty in the following nonlinear robust filter design procedures.\n\nIt is noted that f(0) ¼ 0 and g(0) ¼ 0 hold. In order to provide feasible algorithms, we adopt the following assumptions so that nonlinear robust filtering can be applied.\n\nf(x(t)) is suppose to satisfy k f ðx 1 ðtÞÞ À f ðx 2 ðtÞÞk kU 1 ðx 1 ðtÞ À x 2 ðtÞÞk ð22Þ\n\nfor any x 1 (t) and x 2 (t), and for a known matrix U 1 . g(x(t)) satisfies k gðx 1 ðtÞÞ À gðx 2 ðtÞÞk kU 2 ðx 1 ðtÞ À x 2 ðtÞÞk ð23Þ\n\nfor any x 1 (t) and x 2 (t), and for a known matrix U 2 . In this article, the constant matrices U 1 and U 2 are selected as \n\nUntil now, a new nonlinear INS model has been established, for which the nonlinear robust filtering can be provided for initial alignment problems.\n\n\nRobust anti-disturbance filter design\n\nIn this section, the intention is to design a robust antidisturbance filter in the presence of multiple disturbances for the concerned nonlinear systems. Drift estimations will be applied to reject the inertial sensor drifts. H 1 optimisation technique will be adopted to attenuate the norm-bounded disturbances and guarantee cost performance is to optimise the error variance. Accordingly, the proposed multi-objective filter is with both disturbance rejection and attenuation performance. See the block diagram of the robust antidisturbance filter design in Figure 2.\n\nFor this purpose, we first construct the inertial sensor drift estimator as follows:  \n_ b !ðtÞ ¼ Wb !ðtÞ þ K½ yðtÞ À b yðtÞ:ð25Þ\nwhere b xðtÞ is the estimation of state x(t), b yðtÞ is the estimation of output signal y(t). We use u c1 ðtÞ ¼ Bb !ðtÞ and u c2 ðtÞ ¼ Db !ðtÞ as the compensation terms, which are applied to reject inertial sensor biases. K and L are the filter gains to be determined. Denoting e xðtÞ ¼ xðtÞ À b xðtÞ, e !ðtÞ ¼ !ðtÞ À b !ðtÞ, e fðtÞ ¼ f ðxðtÞÞ À f ðb xðtÞÞ and e gðtÞ ¼ gðxðtÞÞ À gðb xðtÞÞ, the estimation error system yields _ e xðtÞ ¼ ðA À LCÞe xðtÞ þ F e fððtÞÞ þ ðB À LDÞ e ! n ðtÞ À LGe gðtÞ þ ðB 1 À LD 1 Þd ðtÞ _ e !ðtÞ ¼ ðW À KDÞe !ðtÞ À KCe xðtÞ À KGe gðtÞ þ ðE À KD 1 Þd ðtÞ:\n8 > > > > > < > > > > > :ð27Þ\nFor Equation (27), the next step is to consider its mixed multi-objective performance indices. Combining the reference outputs with estimation error Equation (27) \n\nwhere\nA ¼ A À LC B À LD ÀKC W À KD ! , B ¼ B 1 À LD 1 E À KD 1 ! C 2 ¼ ½ C 21 C 22 , C 1 ¼ ½ C 11 C 12 :\nHere z 1 (t), z 2 (t) are H 1 and guarantee cost performance outputs, respectively. C 21 , C 22 , C 11 , C 12 are selected weighting matrices. The following definitions can be seen in Guo et al. (2006).\n\nDefinition 3.1: The generalised H 1 performance measurement for (28) is defined as\nJ 1 ¼ kz 1 ðtÞk 2 À kd ðtÞk 2 À T ð0ÞPð0Þð29Þ\nwhere 4 0 is scalar and P is a positive definite matrix.\n\nDefinition 3.2: The guarantee cost performance measurement for Equation (28) is defined as\nJ 2 ¼ kz 2 ðtÞk 2\nAt this stage, the objective is to find K and L such that system (28) is stable and satisfies the mixed performance indices. The following result provides a new robust anti-disturbance filter design method to initial alignment of INS based on linear matrix inequalities (LMIs).\n\nTheorem 3.3: For the weighting constants r 1 4 0, r 2 4 0, 1 4 0, 2 4 0, tuning parameters 4 0, 1 4 0 and matrices C 21 , C 22 , C 11 , C 12 , if the following LMI-based optimisation problem:\nminfr 1 þ r 2 T ð0ÞP 1 ð0Þg subject to Ä 1 Ä 12 Ä 13 Ä 14 P 2 F Ä 16 Ä 17 C T 11 C T 21 Ã Ä 2 Ä 23 0 P 2 F Ä 26 Ä 27 0 0 Ã Ã Ä 3 Ä 34 0 Ä 36 Ä 37 C T 12 C T 22 Ã Ã Ã Ä 4 0 Ä 46 Ä 47 0 0 Ã Ã Ã Ã À 1 I 0 0 0 0 Ã Ã Ã Ã Ã À 2 I 0 0 0 Ã Ã Ã Ã Ã Ã ÀI 0 0 Ã Ã Ã Ã Ã Ã Ã ÀI 0 Ã Ã Ã Ã Ã Ã Ã Ã ÀI\n2 6 6 6 6 6 6 6 6 6 6 6 6 6 6 6 6 6 4\nÄ 46 ¼ À 1 R 2 G, Ä 47 ¼ 1 ðP 4 E À R 2 D 1 Þ,\nare feasible with respect to matrices P i 4 0 (i ¼ 1, 3), P 2 , P 4 and R 1 , R 2 , then there exists a mixed multi-objective filter with gains L ¼ P À1 2 R 1 and K ¼ P À1 4 R 2 such that the error system (28) is stable, J 2 x T (0)P 1 x(0) and J 1 5 0.\n\nProof: Let\nV 1 ðtÞ ¼ e x T ðtÞP 1 e xðtÞ þ 1 Z t 0 U 1 e xðÞ 2 À e fðÞ 2 ! d þ 2 Z t 0 U 2 e xðÞ 2 À e gðÞ 2 h i d ¼ e xðtÞ _ e xðtÞ \" # T I 0 0 0 ! P 1 0 P T 2 P T 2 ! e xðtÞ _ e xðtÞ \" # þ 1 Z t 0 U 1 e xðÞ 2 À e fðÞ 2 ! d þ 2 Z t 0 U 2 e xðÞ 2 À e gðÞ 2 h i d V 2 ðtÞ ¼ e ! T ðtÞP 3 e !ðtÞ ¼ e !ðtÞ _ e !ðtÞ \" # T I 0 0 0 ! P 3 0 P T 4 1 P T 4 ! e !ðtÞ _ e !ðtÞ\n\" #\n\n\n:\n\nConsider the following Lyapunov function:\nVðtÞ ¼ V 1 ðtÞ þ V 2 ðtÞ:ð31Þ\nIt is verified that V(t) ! 0 holds for all arguments. Variable t will be omitted in the following procedures for simplifing, if there are no various interpretations. Along with the trajectories of (27), it can be shown that\n_ V 1 ¼ 2e x T P 1 _ e x þ 1 U 1 e x 2 À e f 2 h i þ 2 U 2 e x 2 À e g 2 h i ¼ 2 e x _ e x \" # T P 1 P 2 0 P 2 \" # _ e x 0 \" # þ 1 U 1 e x 2 À e f 2 ! þ 2 U 2 e x 2 À e g 2 h i ¼ 2e x T P 1 _ e x À 2e x T P 2 _ e x þ 2e x T P 2 ðB À LDÞe ! þ 2e x T P 2 ðA À LCÞe x þ 2 _ e x T P 2 ðA À LCÞe x À 2 _ e x T P 2 _ e x þ 2e x T P 2 ðB 1 À LD 1 Þd þ 2 _ e x T P 2 ðB 1 À LD 1 Þd þ 2 _ e x T P 2 ðB À LDÞe ! þ 2e x T P 2 e f þ 2 _ e x T P 2 e f þ 1 e x T U T 1 U 1 e x þ 2 e x T U T 2 U 2 e x À 2e x T P 2\nLGe g À 2 _ e x T P 2 LGe g À 1 e f 2 À 2 e g 2 ,\n_ V 2 ¼ 2e ! T P 3 _ e ! ¼ 2 e ! _ e ! ! T P 3 P 4 0 1 P 4 ! _ e ! 0 \" # ¼ 2e ! T P 3 _ e ! À 2e ! T P 4 _ e ! þ 2 _ e ! T 1 P 4 We ! À 2 _ e ! T 1 P 4 _ e ! þ 2e ! T P 4 ðW À KDÞe ! þ 2e ! T P 4 ðE À KD 1 Þd þ 2 _ e ! T 1 P 4 ðE À KD 1 Þd À 2e ! T P 4 KCe x À 2 _ e ! T 1 P 4 KCe x À 2e ! T P 4 KGe g À 2 _ e ! T 1 P 4 KGe g:\nIn the absence of d(t) (i.e. d(t) ¼ 0), it can be seen that ,\n_ VðtÞ ¼ s T ðtÞ½È À ðtÞ T ðtÞsðtÞ, where È ¼ È 11 Ä 12 Ä 13 Ä 14 P 2 F Ä 16 Ã Ä 2 Ä 23 0 P 2 F Ä 26 Ã Ã È 33 Ä 34 0 Ä 36 Ã Ã Ã Ä 4 0 Ä 46 Ã Ã Ã Ã À 1 I 0 Ã Ã Ã Ã Ã À 2 Is T ðtÞ ¼ e x T _ e x T e ! T _ e ! T e f T e g T h i , T ðtÞ ¼ C 21 0 C 22 0 0 0 Â Ã , È 11 ¼ Ä 1 þ C T 21 C 21 , È 33 ¼ Ä 3 þ C T 22 C 22 :\nUsing the Schur complement formula, it can be seen by that (30) leads to È 5 0. When È 5 0 holds, we have _ VðtÞ 5 Às T ðtÞðtÞ T ðtÞsðtÞ ¼ Àz T 2 z 2 0:\n\nConsider two auxiliary functions as follows:\nJ 0 ¼ z T 2 ðtÞz 2 ðtÞ þ _ VðtÞ, J 1 ¼ z T 1 ðtÞz 1 ðtÞ À d ðtÞ T d ðtÞ þ _VðtÞ\nIt can be verified that J 0 s T (t)È s(t).\n\nIn the presence of d(t), it can be concluded that ,\nJ 1 ¼ s T 1 ðtÞÉs 1 ðtÞ, where s T 1 ðtÞ ¼ s T ðtÞ d T ðtÞ Â Ã , and É ¼ Ä 1 Ä 12 Ä 13 Ä 14 P 2 F Ä 16 É 17 Ã Ä 2 Ä 23 0 P 2 F Ä 26 Ä 27 Ã Ã Ä 3 Ä 34 0 Ä 36 É 37 Ã Ã Ã Ä 4 0 Ä 46 Ä 47 Ã Ã Ã Ã À 1 I 0 0 Ã Ã Ã Ã Ã À 2 I 0 Ã Ã Ã Ã Ã Ã ÀIÉ 17 ¼ Ä 17 þ C T 11 C 11 , É 37 ¼ Ä 37 þ C T 12 C 12 :\nUsing of the Schur complement formula again to (30) yields É 5 0. Therefore, it can be claimed that both J 0 5 0 and J 1 5 0 can be guaranteed under the condition (30). Integrating J 0 and J 1 from initial time to 1 implies that J 2 x T (0)P 1 x(0) and J 1 5 0. This completes the proof. oe Theorem 3.3 provides a robust initial alignment design method based on the mixed multi-objective optimisation principle. It also differs from the main results in Cao and Guo (2011), Gao and Ding (2007) and Guo et al. (2006), since it is based on the augmented Lyapunov functional approach (Li and Guo 2009). This result involves the tuning parameters , 1 and slack variables P 2 and P 4 , and may lead to less conservative solutions.\n\n\nSimulation examples\n\nIn this section, SINS on the ground stationary base are considered with multiple disturbances. We consider the SINS data obtained in an experiment in the laboratory.\n\nSimulation conditions: (1) local latitude is 39.9 north latitude; (2) initial misalignment angles U , E , N are chosen as 5 , 0.5 and 0.5 , respectively; (3) gyroscopes: the relative times of Markov process are 1 ¼ 2 ¼ 3 ¼ 3600 s and random bias is 0.05 /h; (4) Accelerometers: the relative times of Markov process are 4 ¼ 5 ¼ 1800 s and random bias is 50 mg.\n\nThe correlative times for the random bias are decided based on the properties of the selected inertial sensors by testing. The coefficient matrices of nonlinear model (19) are given by \nF ¼ 0:559426 Â 10 À4 diagfÀ1, 1, À1g, G ¼ 0:559426 Â 10 À4 diagf0, 0, 1g:\nFor an outdoor SINS, there unavoidably exist machine vibrations, modelling errors and outdoor environmental disturbances. These unknown and uncertain variables can be merged into d(t) as a norm-bounded disturbance for the SINS, where\n\nWe insert the non-Gaussian disturbance d(t) into the SINS data measured in the laboratory.\n\nThe H 1 reference output weighting matrices are selected as\nC 11 ¼ 0:1 0:1 0:01 Â Ã , C 12 ¼ 0 0 0 0 0 Â Ã :\nThe H 2 reference output weighting matrices are selected as C 21 ¼ 10 À6 g 10 À6 g 10 À5 g Â Ã , For weighting parameters r 1 ¼ 1, r 2 ¼ 10, 1 ¼ 0.013211, 2 ¼ 0.013211, tuning parameters ¼ 12 and 1 ¼ 12, it can be solved via LMI related to (30) that ¼ 2.179985 Â 10 À11 , and the gain of robust multi-objective filter (2)  :\n\nThe parameter matrices of unscented Kalman filter are selected as follows. The initial mean square error d T ðtÞ ¼ 0:001signðsinð100tÞÞ 0:001signðsinð100tÞÞ 0:0001signðsinð100tÞÞ Â Ã :\n\n\nmatrix is\n\nPð0Þ ¼ diagfð1 Þ 2 , ð1 Þ 2 , ð10 Þ 2 , ð0:2 =hÞ 2 , ð0:2 =hÞ 2 , ð0:2 =hÞ 2 , ð200mgÞ 2 , ð200mgÞ 2 g\n\nThe variance matrix of system noise is Q ¼ diagfð0:1 =hÞ 2 , ð0:1 =hÞ 2 , ð0:1 =hÞ 2 g, and variance matrix of measurement noise is selected as\nR ¼ diagfð50mgÞ 2 ,ð50mgÞ\n2 , ð0:05 =hÞ 2 g:\n\nThe estimation errors of three misalignment angles are described in Figures 3-5, where the solid lines represent the estimation errors by robust antidisturbance filter in this article and dash-dot lines denote the estimations errors based on UKF. For the nonlinear systems with multiple disturbances, the SINS is mainly affected by exogenous disturbance, measurement noise and inertial sensor random biases. From Figures 3-5, it can be seen that the proposed robust anti-disturbance filter has a good ability for initial alignment of SINS with multiple disturbances, and the UKF is degraded when the concerned SINS is in alignment with non-Gaussian noises. The composition of standard deviations of three misalignment angles estimation error (after the 30th second) between robust anti-disturbance filter in this article and UKF is shown in Table 1. In Table 1, it is shown that the accuracy of the proposed robust filter is higher than UKF for the considered systems with multiple disturbances.\n\nWhen three misalignment angles are selected as 1 , 0.1 , 0.1 , the estimation error of azimuth angle is seen in Figure 6, where the solid lines represent the estimation errors based on the nonlinear model in this article and dash-dot lines denote the estimations errors based on the linear model in Cao and Guo (2011). The standard deviations of three misalignment angles estimation error (after the 30th second) between nonlinear model in this article and the linear model is shown in Table 2. From Figure 6 and Table 2, we can see that the accuracy of the nonlinear model is higher than linear model, where the linearisation of heading error leads to modelling error.     \n\n\nConclusion\n\nIn this article, the problem of nonlinear initial alignment is investigated for INS with multiple disturbances. A new INS nonlinear error model for stationary base is established, and is transformed into a robust filter design problem for systems with multiple disturbances. The multiple disturbances are supposed to include inertial sensor drifts and norm-bounded disturbances. As such, we present a new anti-disturbance filtering method, where drift estimations are applied to reject inertial sensor random biases, H 1 optimisation technique is adopted to attenuate the norm-bounded uncertain disturbances and the guarantee cost performance is to optimise the error variance. Accordingly, the proposed anti-disturbance filter is with the enhanced disturbance rejection and attenuation performance. Finally, simulations based on experimental data for stationary base alignment of an INS are given to show the efficiency of the proposed approach.  \n\n\nf 0 ðÞ þ B 1 d ðtÞ,\n\nFigure 2 .\n2The block diagram of robust anti-disturbance filter design. b !ðtÞ is the estimation of inertial sensor drifts !(t). Based on the (25), the mixed multi-objective filter is constructed _ b xðtÞ ¼ Ab xðtÞ þ Ff ðb xðtÞÞ þ uðtÞ þ u c1 ðtÞ þ L½ yðtÞ À b yðtÞ b yðtÞ ¼ Cb xðtÞ þ Ggðb xðtÞÞ þ uðtÞ þ u c2 ðtÞ, (\n\nFigure 4 .\n4Estimation errors of y .\n\nFigure 5 .\n5Estimation errors of z .\n\nFigure 3 .\n3Estimation errors of x .\n\nFigure 6 .\n6The comparison of z between linear model with nonlinear model.\n\n\nðtÞ ¼ N ðtÞ sin U ðtÞ À E ðtÞ cos U ðtÞ and N ðtÞ ¼ E ðtÞ sin U ðtÞ þ N ðtÞ cos U ðtÞ:Àsin U ðtÞ cos U ðtÞ E ðtÞ \nN ðtÞ \nE ðtÞ \n1 \n\n2 \n\n6 \n4 \n\n3 \n\n7 \n5, \nð2Þ \n\nwhere \n\nE \n\n\nto the nonlinear terms of the error model (16), the nonlinear INS error system (16) can be formulated by _ xðtÞ ¼ AxðtÞ þ Ff ðxðtÞÞ þ B!ðtÞ þ uðtÞ þ B 1 d ðtÞ yðtÞ ¼ CxðtÞ þ GgðxðtÞÞ þ D!ðtÞ þ uðtÞ þ D 1 d ðtÞ, ð19Þ where the system state x T ðtÞ ¼ ½ E ðtÞ N ðtÞ U ðtÞ and the system output variable y T ðtÞ ¼ ½ f E ðtÞ f N ðtÞ w E ðtÞ :& \n\n\n\n\nyields_ \ne xðtÞ \n\n_ \ne \n!ðtÞ \n\n\" \n# \n\n¼ A \ne xðtÞ \n\ne \n!ðtÞ \n\n\" \n# \n\nþ \nF e fðtÞ \n\n0 \n\n\" \n# \n\nþ Bd ðtÞ À \n\nLG \n\nKG \n\n\" \n# \n\ne gðtÞ \n\nz 1 ðtÞ ¼ C 1 \ne xðtÞ \n\ne \n!ðtÞ \n\n\" \n# \n\nz 2 ðtÞ ¼ C 2 \ne xðtÞ \n\ne \n!ðtÞ \n\n\" \n# \n\n, \n\n8 \n> > > > > > > > > > > > < \n\n> > > > > > > > > > > > : \n\n\n\nTable 1 .\n1The standard deviation (STD) of estimation error of three misalignment angles (10 À5 rad).Method \nLevelling x \nLevelling y \nAzimuth \n\nIn this article \n4.084436 \n5.962061 \n8.382810 \nUKF \n27.573893 \n75.867469 \n18.481666 \n\n\nTable 2 .\n2The STD of misalignment angle estimation errors for linear and nonlinear models (10 À4 rad).Method \nLevelling x \nLevelling y \nAzimuth \n\nNonlinear model \n0.032142 \n0.042950 \n2.103586 \nLinear model \n0.032335 \n0.047724 \n3.122321 \n\nAcknowledgementsThe authors would like to thank the anonymous reviewers for their valuable comments and suggestions to improve the presentation of this article. This work is partially supported by the National 973 Program (Grant No. 2012CB720003) of China and National Natural Science Foundation of China (Grant No. 60925012, 61127007, 91016004, and 61121003).\nFast Alignment using Rotation Vector and Adaptive Kalman Filter. H S Ahn, C H Won, IEEE Transactions on Aerospace and Electronic Systems. 42Ahn, H.S., and Won, C.H. (2006), 'Fast Alignment using Rotation Vector and Adaptive Kalman Filter', IEEE Transactions on Aerospace and Electronic Systems, 42, 70-83.\n\nFault Diagnosis with Disturbance Rejection Performance Based on Disturbance Observer. S Y Cao, L Guo, Proceedings of IEEE Conference on Decision Control. IEEE Conference on Decision ControlShanghai, ChinaCao, S.Y., and Guo, L. (2009), 'Fault Diagnosis with Disturbance Rejection Performance Based on Disturbance Observer', in Proceedings of IEEE Conference on Decision Control, Shanghai, China, pp. 6947-6951.\n\nMulti-objective Robust Initial Alignment Algorithm for Inertial Navigation System with Multiple Disturbances. S Y Cao, L Guo, 10.1016/j.ast.2011.04.006Aerospace Science and Technology. Cao, S.Y., and Guo, L. (2011), 'Multi-objective Robust Initial Alignment Algorithm for Inertial Navigation System with Multiple Disturbances', Aerospace Science and Technology, doi: 10.1016/j.ast.2011.04.006.\n\nA Fast Initial Alignment Method for Strapdown Inertial Navigation System Stationary Base. J C Fang, D J Wan, IEEE Transactions on Aerospace and Electronic Systems. 32Fang, J.C., and Wan, D.J. (1996), 'A Fast Initial Alignment Method for Strapdown Inertial Navigation System Stationary Base', IEEE Transactions on Aerospace and Electronic Systems, 32, 1501-1505.\n\nThe Global Positioning System & Inertial Navigation. J A Farrell, M Barth, McGraw-Hall companies IncNew YorkFarrell, J.A., and Barth, M. (1999), The Global Positioning System & Inertial Navigation, New York: McGraw-Hall companies Inc.\n\nState and Unknown Input Estimation for Linear Discrete-time Systems. T Floquet, J P Barbot, Automatica. 42Floquet, T., and Barbot, J.P. (2006), 'State and Unknown Input Estimation for Linear Discrete-time Systems', Automatica, 42, 1883-1889.\n\nState and Disturbance Estimator for Time-delay Systems With Application to Fault Estimation and Signal Compensation. Z W Gao, S X Ding, IEEE Transactions on Signal Process. 55Gao, Z.W., and Ding, S.X. (2007), 'State and Disturbance Estimator for Time-delay Systems With Application to Fault Estimation and Signal Compensation', IEEE Transactions on Signal Process, 55, 5541-5551.\n\nM S Grewal, L R Weill, A P Andrews, Global Positioning Systems, Inertial Navigation, and Inetergration. New JerseyJohn Wiley & Sons, Inc2nd ed.Grewal, M.S., Weill, L.R., and Andrews, A.P. (2007), Global Positioning Systems, Inertial Navigation, and Inetergration (2nd ed.), New Jersey: John Wiley & Sons, Inc.\n\nOptimising The Transfer Alignment of Weapon INS. P D Groves, The Journal of Navigation. 56Groves, P.D. (2003), 'Optimising The Transfer Alignment of Weapon INS', The Journal of Navigation, 56, 323-335.\n\nDisturbance Attenuation and Rejection for Systems with Nonlinearity via DOBC Approach. L Guo, Chen , W H , International Journal of Robust Nonlinear Control. 15Guo, L., and Chen, W.H. (2005), 'Disturbance Attenuation and Rejection for Systems with Nonlinearity via DOBC Approach', International Journal of Robust Nonlinear Control, 15, 109-125.\n\nStochastic Distribution Control System Design: A Convex Optimization Approach. L Guo, Wang , H , SpringerNew YorkGuo, L., and Wang, H. (2009), Stochastic Distribution Control System Design: A Convex Optimization Approach, New York: Springer.\n\nMultiobjective Filtering for Nonlinear Time-delay Systems with Non-Zero Initial Conditions Based on Convex Optimisation. L Guo, F W Yang, J C Fang, Circuits System Signal Process. 25Guo, L., Yang, F.W., and Fang, J.C. (2006), 'Multiobjective Filtering for Nonlinear Time-delay Systems with Non-Zero Initial Conditions Based on Convex Optimisation', Circuits System Signal Process, 25, 591-607.\n\nA Novel Initial Alignment Scheme for Low-cost INS Aided by GPS for Land Vehicle Applications. S L Han, J L Wang, Journal of Navigation. 63Han, S.L., and Wang, J.L. (2010), 'A Novel Initial Alignment Scheme for Low-cost INS Aided by GPS for Land Vehicle Applications', Journal of Navigation, 63, 663-680.\n\nError Analysis of Analytic Coarse Alignment Methods. Y F Jiang, IEEE Transactions on Aerospace and Electronic Systems. 34Jiang, Y.F. (1998), 'Error Analysis of Analytic Coarse Alignment Methods', IEEE Transactions on Aerospace and Electronic Systems, 34, 334-337.\n\nCalibration of Measurement Delay in Global Positioning System. H K Lee, J G Lee, Lee, H.K., and Lee, J.G. (2002), 'Calibration of Measurement Delay in Global Positioning System/\n\nSTrapdown Inertial Navigation System. Journal of Guidance, Control, and Dynamics. 25STrapdown Inertial Navigation System', Journal of Guidance, Control, and Dynamics, 25, 240-247.\n\nOptimal Faultdetection Filtering for Non-gaussian Systems via Output PDFs. T Li, L Guo, IEEE Transactions on Systems, Man, and Cybernetics-PART A: Systems and Humans. 39Li, T., and Guo, L. (2009), 'Optimal Fault- detection Filtering for Non-gaussian Systems via Output PDFs', IEEE Transactions on Systems, Man, and Cybernetics-PART A: Systems and Humans, 39, 476-481.\n\nNew Techniques for Initial Alignment of Strapdown Inertial Navigation System. S L Lu¨, L Xie, Chen , J B , Journal of the Franklin Institute. 346Lu¨, S.L., Xie, L., and Chen, J.B. (2009), 'New Techniques for Initial Alignment of Strapdown Inertial Navigation System', Journal of the Franklin Institute, 346, 1021-1037.\n\nInitial Calibration and Alignment of Low Cost Inertial Navigation Units for Land Vehicle Applications. E Nebot, H Durrant-Whyte, Journal of Robotics Systems. 16Nebot, E., and Durrant-Whyte, H. (1999), 'Initial Calibration and Alignment of Low Cost Inertial Navigation Units for Land Vehicle Applications', Journal of Robotics Systems, 16, 81-92.\n\nR M Rogers, Applied Mathematics in Integrated Navigation Systems. VirginiaAmerican Institute of Aeronautics and Astronautics, Inc3rd ed.Rogers, R.M. (2007), Applied Mathematics in Integrated Navigation Systems (3rd ed.), Virginia: American Institute of Aeronautics and Astronautics, Inc.\n\nInertial Navigator Error Models for Large Heading Uncertainty. B Scherzinger, Proceedings of IEEE Position Location and Navigation Symposium. IEEE Position Location and Navigation SymposiumAtlanta, USAScherzinger, B. (1996), 'Inertial Navigator Error Models for Large Heading Uncertainty', Proceedings of IEEE Position Location and Navigation Symposium, Atlanta, USA, pp. 477-484.\n\nFast Alignment and Calibration Algorithms for Inertial Navigation System. L X Wang, Aerospace Science and Technology. 13Wang, L.X. (2009), 'Fast Alignment and Calibration Algorithms for Inertial Navigation System', Aerospace Science and Technology, 13, 204-209.\n\nMulti-objective Control in Integrated Navigation System Based on LMI. L X Wang, L Guo, Acta Aeronautical & Astronautica Sinica. 29in ChineseWang, L.X., and Guo, L. (2008), 'Multi-objective Control in Integrated Navigation System Based on LMI', Acta Aeronautical & Astronautica Sinica, 29S, 102-106 (in Chinese).\n\nComposite Disturbanceobserver-based Control and Terminal Sliding Mode Control for Nonlinear Systems with Disturbances. X J Wei, L Guo, International Journal of Control. 82Wei, X.J., and Guo, L. (2009), 'Composite Disturbance- observer-based Control and Terminal Sliding Mode Control for Nonlinear Systems with Disturbances', International Journal of Control, 82, 1082-1098.\n\nA Delaydependent Approach to Robust H 1 Filtering for Uncertain Distributed Delay Systems. S Y Xu, J Lam, T Chen, Y Zou, IEEE Transactions on Signal Process. 53Xu, S.Y., Lam, J., Chen, T., and Zou, Y. (2005), 'A Delay- dependent Approach to Robust H 1 Filtering for Uncertain Distributed Delay Systems', IEEE Transactions on Signal Process, 53, 3764-3772.\n\nNonlinear Robust Observer Design for Strapdown INS In-flight Alignment. M J Yu, J G Lee, C G Park, IEEE Transactions on Aerospace and Electronic Systems. 40Yu, M.J., Lee, J.G., and Park, C.G. (2004), 'Nonlinear Robust Observer Design for Strapdown INS In-flight Alignment', IEEE Transactions on Aerospace and Electronic Systems, 40, 797-807.\n\nA Method to Improve the Alignment Performance for GPS-IMU System. Y F Zhang, Y Gao, GPS Solut. 11Zhang, Y.F., and Gao, Y. (2007), 'A Method to Improve the Alignment Performance for GPS-IMU System', GPS Solut, 11, 129-137.\n", "annotations": {"author": "[{\"end\":317,\"start\":143},{\"end\":330,\"start\":318},{\"end\":436,\"start\":331},{\"end\":543,\"start\":437},{\"end\":650,\"start\":544}]", "publisher": null, "author_last_name": "[{\"end\":150,\"start\":147},{\"end\":329,\"start\":326},{\"end\":342,\"start\":340},{\"end\":449,\"start\":446}]", "author_first_name": "[{\"end\":146,\"start\":143},{\"end\":325,\"start\":318},{\"end\":339,\"start\":331},{\"end\":445,\"start\":437}]", "author_affiliation": "[{\"end\":316,\"start\":152},{\"end\":435,\"start\":344},{\"end\":542,\"start\":451},{\"end\":649,\"start\":545}]", "title": "[{\"end\":132,\"start\":1},{\"end\":782,\"start\":651}]", "venue": "[{\"end\":816,\"start\":784}]", "abstract": "[{\"end\":2578,\"start\":1073}]", "bib_ref": "[{\"attributes\":{\"ref_id\":\"b4\"},\"end\":3050,\"start\":3027},{\"attributes\":{\"ref_id\":\"b7\"},\"end\":3082,\"start\":3050},{\"attributes\":{\"ref_id\":\"b19\"},\"end\":3093,\"start\":3082},{\"attributes\":{\"ref_id\":\"b18\"},\"end\":3572,\"start\":3542},{\"attributes\":{\"ref_id\":\"b3\"},\"end\":4923,\"start\":4905},{\"attributes\":{\"ref_id\":\"b20\"},\"end\":4940,\"start\":4923},{\"attributes\":{\"ref_id\":\"b13\"},\"end\":4951,\"start\":4940},{\"attributes\":{\"ref_id\":\"b0\"},\"end\":4968,\"start\":4951},{\"attributes\":{\"ref_id\":\"b7\"},\"end\":4987,\"start\":4968},{\"attributes\":{\"ref_id\":\"b19\"},\"end\":4999,\"start\":4987},{\"attributes\":{\"ref_id\":\"b17\"},\"end\":5015,\"start\":4999},{\"attributes\":{\"ref_id\":\"b21\"},\"end\":5024,\"start\":5015},{\"attributes\":{\"ref_id\":\"b24\"},\"end\":5827,\"start\":5799},{\"attributes\":{\"ref_id\":\"b11\"},\"end\":5852,\"start\":5827},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":5869,\"start\":5852},{\"attributes\":{\"ref_id\":\"b5\"},\"end\":6002,\"start\":5977},{\"attributes\":{\"ref_id\":\"b6\"},\"end\":6020,\"start\":6002},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":6078,\"start\":6059},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":6585,\"start\":6561},{\"attributes\":{\"ref_id\":\"b21\"},\"end\":6595,\"start\":6585},{\"attributes\":{\"ref_id\":\"b2\"},\"end\":6612,\"start\":6595},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":6988,\"start\":6970},{\"attributes\":{\"ref_id\":\"b25\"},\"end\":7011,\"start\":6988},{\"attributes\":{\"ref_id\":\"b26\"},\"end\":7030,\"start\":7011},{\"attributes\":{\"ref_id\":\"b18\"},\"end\":7474,\"start\":7444},{\"attributes\":{\"ref_id\":\"b12\"},\"end\":7492,\"start\":7474},{\"attributes\":{\"ref_id\":\"b8\"},\"end\":7731,\"start\":7718},{\"attributes\":{\"ref_id\":\"b3\"},\"end\":8043,\"start\":8024},{\"attributes\":{\"ref_id\":\"b13\"},\"end\":8054,\"start\":8043},{\"attributes\":{\"ref_id\":\"b17\"},\"end\":8070,\"start\":8054},{\"attributes\":{\"ref_id\":\"b2\"},\"end\":8087,\"start\":8070},{\"attributes\":{\"ref_id\":\"b19\"},\"end\":8881,\"start\":8868},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":9157,\"start\":9138},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":9174,\"start\":9157},{\"attributes\":{\"ref_id\":\"b23\"},\"end\":9191,\"start\":9174},{\"attributes\":{\"ref_id\":\"b2\"},\"end\":9208,\"start\":9191},{\"attributes\":{\"ref_id\":\"b18\"},\"end\":11668,\"start\":11638},{\"attributes\":{\"ref_id\":\"b20\"},\"end\":12357,\"start\":12339},{\"attributes\":{\"ref_id\":\"b2\"},\"end\":14022,\"start\":14004},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":14051,\"start\":14027},{\"attributes\":{\"ref_id\":\"b3\"},\"end\":15163,\"start\":15144},{\"attributes\":{\"ref_id\":\"b21\"},\"end\":15176,\"start\":15165},{\"attributes\":{\"ref_id\":\"b22\"},\"end\":15200,\"start\":15181},{\"attributes\":{\"ref_id\":\"b19\"},\"end\":15414,\"start\":15402},{\"attributes\":{\"ref_id\":\"b11\"},\"end\":20308,\"start\":20291},{\"attributes\":{\"ref_id\":\"b2\"},\"end\":24762,\"start\":24744},{\"attributes\":{\"ref_id\":\"b6\"},\"end\":24783,\"start\":24764},{\"attributes\":{\"ref_id\":\"b11\"},\"end\":24805,\"start\":24788},{\"attributes\":{\"ref_id\":\"b16\"},\"end\":24887,\"start\":24871},{\"attributes\":{\"ref_id\":\"b2\"},\"end\":28395,\"start\":28377}]", "figure": "[{\"attributes\":{\"id\":\"fig_0\"},\"end\":29737,\"start\":29716},{\"attributes\":{\"id\":\"fig_4\"},\"end\":30055,\"start\":29738},{\"attributes\":{\"id\":\"fig_11\"},\"end\":30093,\"start\":30056},{\"attributes\":{\"id\":\"fig_12\"},\"end\":30131,\"start\":30094},{\"attributes\":{\"id\":\"fig_13\"},\"end\":30169,\"start\":30132},{\"attributes\":{\"id\":\"fig_14\"},\"end\":30245,\"start\":30170},{\"attributes\":{\"id\":\"tab_0\",\"type\":\"table\"},\"end\":30418,\"start\":30246},{\"attributes\":{\"id\":\"tab_1\",\"type\":\"table\"},\"end\":30762,\"start\":30419},{\"attributes\":{\"id\":\"tab_3\",\"type\":\"table\"},\"end\":31043,\"start\":30763},{\"attributes\":{\"id\":\"tab_4\",\"type\":\"table\"},\"end\":31275,\"start\":31044},{\"attributes\":{\"id\":\"tab_5\",\"type\":\"table\"},\"end\":31515,\"start\":31276}]", "paragraph": "[{\"end\":4269,\"start\":2594},{\"end\":6243,\"start\":4271},{\"end\":9209,\"start\":6245},{\"end\":10177,\"start\":9211},{\"end\":10589,\"start\":10179},{\"end\":11055,\"start\":10591},{\"end\":12358,\"start\":11089},{\"end\":12404,\"start\":12399},{\"end\":12776,\"start\":12467},{\"end\":12926,\"start\":12842},{\"end\":12950,\"start\":12947},{\"end\":13325,\"start\":12975},{\"end\":13413,\"start\":13379},{\"end\":13535,\"start\":13532},{\"end\":14312,\"start\":13587},{\"end\":14427,\"start\":14422},{\"end\":14545,\"start\":14542},{\"end\":14637,\"start\":14579},{\"end\":14864,\"start\":14694},{\"end\":15101,\"start\":14894},{\"end\":15732,\"start\":15103},{\"end\":15843,\"start\":15734},{\"end\":15891,\"start\":15888},{\"end\":16017,\"start\":15938},{\"end\":16356,\"start\":16041},{\"end\":16406,\"start\":16403},{\"end\":16735,\"start\":16453},{\"end\":16855,\"start\":16852},{\"end\":16902,\"start\":16896},{\"end\":17006,\"start\":16952},{\"end\":17308,\"start\":17061},{\"end\":17803,\"start\":17310},{\"end\":17976,\"start\":17805},{\"end\":18067,\"start\":17978},{\"end\":18202,\"start\":18069},{\"end\":18329,\"start\":18204},{\"end\":18478,\"start\":18331},{\"end\":19089,\"start\":18520},{\"end\":19177,\"start\":19091},{\"end\":19806,\"start\":19221},{\"end\":20000,\"start\":19837},{\"end\":20007,\"start\":20002},{\"end\":20309,\"start\":20107},{\"end\":20393,\"start\":20311},{\"end\":20496,\"start\":20440},{\"end\":20588,\"start\":20498},{\"end\":20884,\"start\":20607},{\"end\":21077,\"start\":20886},{\"end\":21402,\"start\":21365},{\"end\":21703,\"start\":21450},{\"end\":21715,\"start\":21705},{\"end\":22073,\"start\":22070},{\"end\":22120,\"start\":22079},{\"end\":22374,\"start\":22151},{\"end\":22924,\"start\":22875},{\"end\":23313,\"start\":23252},{\"end\":23778,\"start\":23626},{\"end\":23824,\"start\":23780},{\"end\":23947,\"start\":23905},{\"end\":24000,\"start\":23949},{\"end\":25015,\"start\":24291},{\"end\":25204,\"start\":25039},{\"end\":25565,\"start\":25206},{\"end\":25752,\"start\":25567},{\"end\":26060,\"start\":25827},{\"end\":26152,\"start\":26062},{\"end\":26213,\"start\":26154},{\"end\":26587,\"start\":26263},{\"end\":26773,\"start\":26589},{\"end\":26889,\"start\":26787},{\"end\":27034,\"start\":26891},{\"end\":27079,\"start\":27061},{\"end\":28076,\"start\":27081},{\"end\":28752,\"start\":28078},{\"end\":29715,\"start\":28767}]", "formula": "[{\"attributes\":{\"id\":\"formula_0\"},\"end\":12398,\"start\":12359},{\"attributes\":{\"id\":\"formula_1\"},\"end\":12466,\"start\":12405},{\"attributes\":{\"id\":\"formula_2\"},\"end\":12811,\"start\":12777},{\"attributes\":{\"id\":\"formula_3\"},\"end\":12841,\"start\":12811},{\"attributes\":{\"id\":\"formula_4\"},\"end\":12946,\"start\":12927},{\"attributes\":{\"id\":\"formula_5\"},\"end\":12974,\"start\":12951},{\"attributes\":{\"id\":\"formula_6\"},\"end\":13378,\"start\":13326},{\"attributes\":{\"id\":\"formula_8\"},\"end\":13531,\"start\":13414},{\"attributes\":{\"id\":\"formula_9\"},\"end\":13586,\"start\":13536},{\"attributes\":{\"id\":\"formula_10\"},\"end\":14421,\"start\":14313},{\"attributes\":{\"id\":\"formula_11\"},\"end\":14469,\"start\":14428},{\"attributes\":{\"id\":\"formula_12\"},\"end\":14541,\"start\":14469},{\"attributes\":{\"id\":\"formula_13\"},\"end\":14578,\"start\":14546},{\"attributes\":{\"id\":\"formula_14\"},\"end\":14693,\"start\":14638},{\"attributes\":{\"id\":\"formula_15\"},\"end\":14893,\"start\":14865},{\"attributes\":{\"id\":\"formula_16\"},\"end\":15887,\"start\":15844},{\"attributes\":{\"id\":\"formula_17\"},\"end\":15937,\"start\":15892},{\"attributes\":{\"id\":\"formula_18\"},\"end\":16040,\"start\":16018},{\"attributes\":{\"id\":\"formula_20\"},\"end\":16402,\"start\":16357},{\"attributes\":{\"id\":\"formula_21\"},\"end\":16452,\"start\":16407},{\"attributes\":{\"id\":\"formula_22\"},\"end\":16796,\"start\":16736},{\"attributes\":{\"id\":\"formula_23\"},\"end\":16851,\"start\":16796},{\"attributes\":{\"id\":\"formula_24\"},\"end\":16895,\"start\":16856},{\"attributes\":{\"id\":\"formula_25\"},\"end\":16951,\"start\":16903},{\"attributes\":{\"id\":\"formula_26\"},\"end\":17060,\"start\":17007},{\"attributes\":{\"id\":\"formula_28\"},\"end\":19220,\"start\":19178},{\"attributes\":{\"id\":\"formula_30\"},\"end\":19836,\"start\":19807},{\"attributes\":{\"id\":\"formula_32\"},\"end\":20106,\"start\":20008},{\"attributes\":{\"id\":\"formula_33\"},\"end\":20439,\"start\":20394},{\"attributes\":{\"id\":\"formula_34\"},\"end\":20606,\"start\":20589},{\"attributes\":{\"id\":\"formula_35\"},\"end\":21364,\"start\":21078},{\"attributes\":{\"id\":\"formula_36\"},\"end\":21449,\"start\":21403},{\"attributes\":{\"id\":\"formula_37\"},\"end\":22069,\"start\":21716},{\"attributes\":{\"id\":\"formula_38\"},\"end\":22150,\"start\":22121},{\"attributes\":{\"id\":\"formula_39\"},\"end\":22874,\"start\":22375},{\"attributes\":{\"id\":\"formula_40\"},\"end\":23251,\"start\":22925},{\"attributes\":{\"id\":\"formula_41\"},\"end\":23484,\"start\":23314},{\"attributes\":{\"id\":\"formula_42\"},\"end\":23625,\"start\":23484},{\"attributes\":{\"id\":\"formula_43\"},\"end\":23904,\"start\":23825},{\"attributes\":{\"id\":\"formula_44\"},\"end\":24235,\"start\":24001},{\"attributes\":{\"id\":\"formula_45\"},\"end\":24290,\"start\":24235},{\"attributes\":{\"id\":\"formula_46\"},\"end\":25826,\"start\":25753},{\"attributes\":{\"id\":\"formula_47\"},\"end\":26262,\"start\":26214},{\"attributes\":{\"id\":\"formula_48\"},\"end\":27060,\"start\":27035}]", "table_ref": "[{\"attributes\":{\"ref_id\":\"tab_4\"},\"end\":27929,\"start\":27922},{\"attributes\":{\"ref_id\":\"tab_4\"},\"end\":27941,\"start\":27934},{\"attributes\":{\"ref_id\":\"tab_5\"},\"end\":28571,\"start\":28564}]", "section_header": "[{\"attributes\":{\"n\":\"1.\"},\"end\":2592,\"start\":2580},{\"attributes\":{\"n\":\"2.\"},\"end\":11087,\"start\":11058},{\"attributes\":{\"n\":\"3.\"},\"end\":18518,\"start\":18481},{\"end\":22077,\"start\":22076},{\"attributes\":{\"n\":\"4.\"},\"end\":25037,\"start\":25018},{\"end\":26785,\"start\":26776},{\"attributes\":{\"n\":\"5.\"},\"end\":28765,\"start\":28755},{\"end\":29749,\"start\":29739},{\"end\":30067,\"start\":30057},{\"end\":30105,\"start\":30095},{\"end\":30143,\"start\":30133},{\"end\":30181,\"start\":30171},{\"end\":31054,\"start\":31045},{\"end\":31286,\"start\":31277}]", "table": "[{\"end\":30418,\"start\":30334},{\"end\":30762,\"start\":30758},{\"end\":31043,\"start\":30771},{\"end\":31275,\"start\":31146},{\"end\":31515,\"start\":31380}]", "figure_caption": "[{\"end\":29737,\"start\":29718},{\"end\":30055,\"start\":29751},{\"end\":30093,\"start\":30069},{\"end\":30131,\"start\":30107},{\"end\":30169,\"start\":30145},{\"end\":30245,\"start\":30183},{\"end\":30334,\"start\":30248},{\"end\":30758,\"start\":30421},{\"end\":30771,\"start\":30765},{\"end\":31146,\"start\":31056},{\"end\":31380,\"start\":31288}]", "figure_ref": "[{\"end\":11829,\"start\":11821},{\"attributes\":{\"ref_id\":\"fig_4\"},\"end\":19088,\"start\":19080},{\"attributes\":{\"ref_id\":\"fig_12\"},\"end\":27160,\"start\":27149},{\"attributes\":{\"ref_id\":\"fig_12\"},\"end\":27505,\"start\":27494},{\"attributes\":{\"ref_id\":\"fig_14\"},\"end\":28198,\"start\":28190},{\"attributes\":{\"ref_id\":\"fig_14\"},\"end\":28586,\"start\":28578}]", "bib_author_first_name": "[{\"end\":31943,\"start\":31942},{\"end\":31945,\"start\":31944},{\"end\":31952,\"start\":31951},{\"end\":31954,\"start\":31953},{\"end\":32271,\"start\":32270},{\"end\":32273,\"start\":32272},{\"end\":32280,\"start\":32279},{\"end\":32706,\"start\":32705},{\"end\":32708,\"start\":32707},{\"end\":32715,\"start\":32714},{\"end\":33081,\"start\":33080},{\"end\":33083,\"start\":33082},{\"end\":33091,\"start\":33090},{\"end\":33093,\"start\":33092},{\"end\":33407,\"start\":33406},{\"end\":33409,\"start\":33408},{\"end\":33420,\"start\":33419},{\"end\":33659,\"start\":33658},{\"end\":33670,\"start\":33669},{\"end\":33672,\"start\":33671},{\"end\":33950,\"start\":33949},{\"end\":33952,\"start\":33951},{\"end\":33959,\"start\":33958},{\"end\":33961,\"start\":33960},{\"end\":34214,\"start\":34213},{\"end\":34216,\"start\":34215},{\"end\":34226,\"start\":34225},{\"end\":34228,\"start\":34227},{\"end\":34237,\"start\":34236},{\"end\":34239,\"start\":34238},{\"end\":34574,\"start\":34573},{\"end\":34576,\"start\":34575},{\"end\":34815,\"start\":34814},{\"end\":34825,\"start\":34821},{\"end\":34829,\"start\":34828},{\"end\":34831,\"start\":34830},{\"end\":35153,\"start\":35152},{\"end\":35163,\"start\":35159},{\"end\":35167,\"start\":35166},{\"end\":35438,\"start\":35437},{\"end\":35445,\"start\":35444},{\"end\":35447,\"start\":35446},{\"end\":35455,\"start\":35454},{\"end\":35457,\"start\":35456},{\"end\":35806,\"start\":35805},{\"end\":35808,\"start\":35807},{\"end\":35815,\"start\":35814},{\"end\":35817,\"start\":35816},{\"end\":36070,\"start\":36069},{\"end\":36072,\"start\":36071},{\"end\":36345,\"start\":36344},{\"end\":36347,\"start\":36346},{\"end\":36354,\"start\":36353},{\"end\":36356,\"start\":36355},{\"end\":36717,\"start\":36716},{\"end\":36723,\"start\":36722},{\"end\":37089,\"start\":37088},{\"end\":37091,\"start\":37090},{\"end\":37098,\"start\":37097},{\"end\":37108,\"start\":37104},{\"end\":37112,\"start\":37111},{\"end\":37114,\"start\":37113},{\"end\":37434,\"start\":37433},{\"end\":37443,\"start\":37442},{\"end\":37678,\"start\":37677},{\"end\":37680,\"start\":37679},{\"end\":38030,\"start\":38029},{\"end\":38423,\"start\":38422},{\"end\":38425,\"start\":38424},{\"end\":38682,\"start\":38681},{\"end\":38684,\"start\":38683},{\"end\":38692,\"start\":38691},{\"end\":39044,\"start\":39043},{\"end\":39046,\"start\":39045},{\"end\":39053,\"start\":39052},{\"end\":39391,\"start\":39390},{\"end\":39393,\"start\":39392},{\"end\":39399,\"start\":39398},{\"end\":39406,\"start\":39405},{\"end\":39414,\"start\":39413},{\"end\":39729,\"start\":39728},{\"end\":39731,\"start\":39730},{\"end\":39737,\"start\":39736},{\"end\":39739,\"start\":39738},{\"end\":39746,\"start\":39745},{\"end\":39748,\"start\":39747},{\"end\":40066,\"start\":40065},{\"end\":40068,\"start\":40067},{\"end\":40077,\"start\":40076}]", "bib_author_last_name": "[{\"end\":31949,\"start\":31946},{\"end\":31958,\"start\":31955},{\"end\":32277,\"start\":32274},{\"end\":32284,\"start\":32281},{\"end\":32712,\"start\":32709},{\"end\":32719,\"start\":32716},{\"end\":33088,\"start\":33084},{\"end\":33097,\"start\":33094},{\"end\":33417,\"start\":33410},{\"end\":33426,\"start\":33421},{\"end\":33667,\"start\":33660},{\"end\":33679,\"start\":33673},{\"end\":33956,\"start\":33953},{\"end\":33966,\"start\":33962},{\"end\":34223,\"start\":34217},{\"end\":34234,\"start\":34229},{\"end\":34247,\"start\":34240},{\"end\":34583,\"start\":34577},{\"end\":34819,\"start\":34816},{\"end\":35157,\"start\":35154},{\"end\":35442,\"start\":35439},{\"end\":35452,\"start\":35448},{\"end\":35462,\"start\":35458},{\"end\":35812,\"start\":35809},{\"end\":35822,\"start\":35818},{\"end\":36078,\"start\":36073},{\"end\":36351,\"start\":36348},{\"end\":36360,\"start\":36357},{\"end\":36720,\"start\":36718},{\"end\":36727,\"start\":36724},{\"end\":37095,\"start\":37092},{\"end\":37102,\"start\":37099},{\"end\":37440,\"start\":37435},{\"end\":37457,\"start\":37444},{\"end\":37687,\"start\":37681},{\"end\":38042,\"start\":38031},{\"end\":38430,\"start\":38426},{\"end\":38689,\"start\":38685},{\"end\":38696,\"start\":38693},{\"end\":39050,\"start\":39047},{\"end\":39057,\"start\":39054},{\"end\":39396,\"start\":39394},{\"end\":39403,\"start\":39400},{\"end\":39411,\"start\":39407},{\"end\":39418,\"start\":39415},{\"end\":39734,\"start\":39732},{\"end\":39743,\"start\":39740},{\"end\":39753,\"start\":39749},{\"end\":40074,\"start\":40069},{\"end\":40081,\"start\":40078}]", "bib_entry": "[{\"attributes\":{\"id\":\"b0\",\"matched_paper_id\":13459525},\"end\":32182,\"start\":31877},{\"attributes\":{\"id\":\"b1\",\"matched_paper_id\":12290968},\"end\":32593,\"start\":32184},{\"attributes\":{\"doi\":\"10.1016/j.ast.2011.04.006\",\"id\":\"b2\",\"matched_paper_id\":110308551},\"end\":32988,\"start\":32595},{\"attributes\":{\"id\":\"b3\",\"matched_paper_id\":122659615},\"end\":33351,\"start\":32990},{\"attributes\":{\"id\":\"b4\"},\"end\":33587,\"start\":33353},{\"attributes\":{\"id\":\"b5\",\"matched_paper_id\":16295686},\"end\":33830,\"start\":33589},{\"attributes\":{\"id\":\"b6\",\"matched_paper_id\":9463887},\"end\":34211,\"start\":33832},{\"attributes\":{\"id\":\"b7\"},\"end\":34522,\"start\":34213},{\"attributes\":{\"id\":\"b8\",\"matched_paper_id\":111351175},\"end\":34725,\"start\":34524},{\"attributes\":{\"id\":\"b9\",\"matched_paper_id\":120161604},\"end\":35071,\"start\":34727},{\"attributes\":{\"id\":\"b10\"},\"end\":35314,\"start\":35073},{\"attributes\":{\"id\":\"b11\",\"matched_paper_id\":121440490},\"end\":35709,\"start\":35316},{\"attributes\":{\"id\":\"b12\",\"matched_paper_id\":128973388},\"end\":36014,\"start\":35711},{\"attributes\":{\"id\":\"b13\",\"matched_paper_id\":121593894},\"end\":36279,\"start\":36016},{\"attributes\":{\"id\":\"b14\"},\"end\":36458,\"start\":36281},{\"attributes\":{\"id\":\"b15\"},\"end\":36639,\"start\":36460},{\"attributes\":{\"id\":\"b16\",\"matched_paper_id\":29184892},\"end\":37008,\"start\":36641},{\"attributes\":{\"id\":\"b17\",\"matched_paper_id\":46919285},\"end\":37328,\"start\":37010},{\"attributes\":{\"id\":\"b18\",\"matched_paper_id\":19207573},\"end\":37675,\"start\":37330},{\"attributes\":{\"id\":\"b19\"},\"end\":37964,\"start\":37677},{\"attributes\":{\"id\":\"b20\",\"matched_paper_id\":110744967},\"end\":38346,\"start\":37966},{\"attributes\":{\"id\":\"b21\",\"matched_paper_id\":110681749},\"end\":38609,\"start\":38348},{\"attributes\":{\"id\":\"b22\"},\"end\":38922,\"start\":38611},{\"attributes\":{\"id\":\"b23\"},\"end\":39297,\"start\":38924},{\"attributes\":{\"id\":\"b24\"},\"end\":39654,\"start\":39299},{\"attributes\":{\"id\":\"b25\",\"matched_paper_id\":23313989},\"end\":39997,\"start\":39656},{\"attributes\":{\"id\":\"b26\",\"matched_paper_id\":122395732},\"end\":40220,\"start\":39999}]", "bib_title": "[{\"end\":31940,\"start\":31877},{\"end\":32268,\"start\":32184},{\"end\":32703,\"start\":32595},{\"end\":33078,\"start\":32990},{\"end\":33656,\"start\":33589},{\"end\":33947,\"start\":33832},{\"end\":34571,\"start\":34524},{\"end\":34812,\"start\":34727},{\"end\":35435,\"start\":35316},{\"end\":35803,\"start\":35711},{\"end\":36067,\"start\":36016},{\"end\":36496,\"start\":36460},{\"end\":36714,\"start\":36641},{\"end\":37086,\"start\":37010},{\"end\":37431,\"start\":37330},{\"end\":38027,\"start\":37966},{\"end\":38420,\"start\":38348},{\"end\":38679,\"start\":38611},{\"end\":39041,\"start\":38924},{\"end\":39388,\"start\":39299},{\"end\":39726,\"start\":39656},{\"end\":40063,\"start\":39999}]", "bib_author": "[{\"end\":31951,\"start\":31942},{\"end\":31960,\"start\":31951},{\"end\":32279,\"start\":32270},{\"end\":32286,\"start\":32279},{\"end\":32714,\"start\":32705},{\"end\":32721,\"start\":32714},{\"end\":33090,\"start\":33080},{\"end\":33099,\"start\":33090},{\"end\":33419,\"start\":33406},{\"end\":33428,\"start\":33419},{\"end\":33669,\"start\":33658},{\"end\":33681,\"start\":33669},{\"end\":33958,\"start\":33949},{\"end\":33968,\"start\":33958},{\"end\":34225,\"start\":34213},{\"end\":34236,\"start\":34225},{\"end\":34249,\"start\":34236},{\"end\":34585,\"start\":34573},{\"end\":34821,\"start\":34814},{\"end\":34828,\"start\":34821},{\"end\":34834,\"start\":34828},{\"end\":35159,\"start\":35152},{\"end\":35166,\"start\":35159},{\"end\":35170,\"start\":35166},{\"end\":35444,\"start\":35437},{\"end\":35454,\"start\":35444},{\"end\":35464,\"start\":35454},{\"end\":35814,\"start\":35805},{\"end\":35824,\"start\":35814},{\"end\":36080,\"start\":36069},{\"end\":36353,\"start\":36344},{\"end\":36362,\"start\":36353},{\"end\":36722,\"start\":36716},{\"end\":36729,\"start\":36722},{\"end\":37097,\"start\":37088},{\"end\":37104,\"start\":37097},{\"end\":37111,\"start\":37104},{\"end\":37117,\"start\":37111},{\"end\":37442,\"start\":37433},{\"end\":37459,\"start\":37442},{\"end\":37689,\"start\":37677},{\"end\":38044,\"start\":38029},{\"end\":38432,\"start\":38422},{\"end\":38691,\"start\":38681},{\"end\":38698,\"start\":38691},{\"end\":39052,\"start\":39043},{\"end\":39059,\"start\":39052},{\"end\":39398,\"start\":39390},{\"end\":39405,\"start\":39398},{\"end\":39413,\"start\":39405},{\"end\":39420,\"start\":39413},{\"end\":39736,\"start\":39728},{\"end\":39745,\"start\":39736},{\"end\":39755,\"start\":39745},{\"end\":40076,\"start\":40065},{\"end\":40083,\"start\":40076}]", "bib_venue": "[{\"end\":32388,\"start\":32338},{\"end\":34327,\"start\":34317},{\"end\":37751,\"start\":37743},{\"end\":38167,\"start\":38108},{\"end\":32013,\"start\":31960},{\"end\":32336,\"start\":32286},{\"end\":32778,\"start\":32746},{\"end\":33152,\"start\":33099},{\"end\":33404,\"start\":33353},{\"end\":33691,\"start\":33681},{\"end\":34003,\"start\":33968},{\"end\":34315,\"start\":34249},{\"end\":34610,\"start\":34585},{\"end\":34883,\"start\":34834},{\"end\":35150,\"start\":35073},{\"end\":35494,\"start\":35464},{\"end\":35845,\"start\":35824},{\"end\":36133,\"start\":36080},{\"end\":36342,\"start\":36281},{\"end\":36540,\"start\":36498},{\"end\":36806,\"start\":36729},{\"end\":37150,\"start\":37117},{\"end\":37486,\"start\":37459},{\"end\":37741,\"start\":37689},{\"end\":38106,\"start\":38044},{\"end\":38464,\"start\":38432},{\"end\":38737,\"start\":38698},{\"end\":39091,\"start\":39059},{\"end\":39455,\"start\":39420},{\"end\":39808,\"start\":39755},{\"end\":40092,\"start\":40083}]"}}}, "year": 2023, "month": 12, "day": 17}