{"id": 3521071, "updated": "2023-10-01 07:03:52.52", "metadata": {"title": "Diversity is All You Need: Learning Skills without a Reward Function", "authors": "[{\"first\":\"Benjamin\",\"last\":\"Eysenbach\",\"middle\":[]},{\"first\":\"Abhishek\",\"last\":\"Gupta\",\"middle\":[]},{\"first\":\"Julian\",\"last\":\"Ibarz\",\"middle\":[]},{\"first\":\"Sergey\",\"last\":\"Levine\",\"middle\":[]}]", "venue": "ArXiv", "journal": "ArXiv", "publication_date": {"year": 2018, "month": 2, "day": 16}, "abstract": "Intelligent creatures can explore their environments and learn useful skills without supervision. In this paper, we propose DIAYN ('Diversity is All You Need'), a method for learning useful skills without a reward function. Our proposed method learns skills by maximizing an information theoretic objective using a maximum entropy policy. On a variety of simulated robotic tasks, we show that this simple objective results in the unsupervised emergence of diverse skills, such as walking and jumping. In a number of reinforcement learning benchmark environments, our method is able to learn a skill that solves the benchmark task despite never receiving the true task reward. We show how pretrained skills can provide a good parameter initialization for downstream tasks, and can be composed hierarchically to solve complex, sparse reward tasks. Our results suggest that unsupervised discovery of skills can serve as an effective pretraining mechanism for overcoming challenges of exploration and data efficiency in reinforcement learning.", "fields_of_study": "[\"Computer Science\"]", "external_ids": {"arxiv": "1802.06070", "mag": "2963438456", "acl": null, "pubmed": null, "pubmedcentral": null, "dblp": "conf/iclr/EysenbachGIL19", "doi": null}}, "content": {"source": {"pdf_hash": "20a3b69a737050725f8bede85bdf1b46d251a281", "pdf_src": "Arxiv", "pdf_uri": "[\"https://arxiv.org/pdf/1802.06070v6.pdf\"]", "oa_url_match": false, "oa_info": null}, "grobid": {"id": "89dec873eff6267a3e82921411825258433d5bf9", "type": "plain-text", "url": "s3://ai2-s2-pdf-extraction-prod/parse-results/s2orc_worker/20a3b69a737050725f8bede85bdf1b46d251a281.txt", "contents": "\nDIVERSITY IS ALL YOU NEED: LEARNING SKILLS WITHOUT A REWARD FUNCTION\n\n\nBenjamin Eysenbach beysenba@cs.cmu.edu \nCarnegie Mellon University\nBerkeley, Berkeley Google Brain\n\nAbhishek Gupta \nCarnegie Mellon University\nBerkeley, Berkeley Google Brain\n\nJulian Ibarz Google \nCarnegie Mellon University\nBerkeley, Berkeley Google Brain\n\nBrain Sergey Levine \nCarnegie Mellon University\nBerkeley, Berkeley Google Brain\n\nDIVERSITY IS ALL YOU NEED: LEARNING SKILLS WITHOUT A REWARD FUNCTION\n\nIntelligent creatures can explore their environments and learn useful skills without supervision. In this paper, we propose \"Diversity is All You Need\"(DIAYN), a method for learning useful skills without a reward function. Our proposed method learns skills by maximizing an information theoretic objective using a maximum entropy policy. On a variety of simulated robotic tasks, we show that this simple objective results in the unsupervised emergence of diverse skills, such as walking and jumping. In a number of reinforcement learning benchmark environments, our method is able to learn a skill that solves the benchmark task despite never receiving the true task reward. We show how pretrained skills can provide a good parameter initialization for downstream tasks, and can be composed hierarchically to solve complex, sparse reward tasks. Our results suggest that unsupervised discovery of skills can serve as an effective pretraining mechanism for overcoming challenges of exploration and data efficiency in reinforcement learning. * Work done as a member of the Google AI Residency Program (g.co/airesidency). learning shared hierarchies. arXiv preprint arXiv:1710.09767, 2017. Justin Fu, John Co-Reyes, and Sergey Levine. Ex2: Exploration with exemplar models for deep reinforcement learning. . Reinforcement learning with deep energybased policies. arXiv preprint arXiv:1702.08165, 2017. Tuomas Haarnoja, Aurick Zhou, Pieter Abbeel, and Sergey Levine. Soft actor-critic: Off-policy maximum entropy deep reinforcement learning with a stochastic actor. arXiv preprint arXiv:1801.01290, 2018. 9 Dylan Hadfield-Menell, Smitha Milli, Pieter Abbeel, Stuart J Russell, and Anca Dragan. Inverse reward design. , et al. Learning to navigate in complex environments. arXiv preprint arXiv:1611.03673, 2016. Volodymyr Mnih, Koray Kavukcuoglu, David Silver, Alex Graves, Ioannis Antonoglou, Daan Wierstra, and Martin Riedmiller. Playing atari with deep reinforcement learning. arXiv preprint arXiv:1312.5602, 2013. Shakir Mohamed and Danilo Jimenez Rezende. Variational information maximisation for intrinsically motivated reinforcement learning. In Advances in neural information processing systems, pp. 2125-2133, 2015. Jean-Baptiste Mouret and Stéphane Doncieux. Overcoming the bootstrap problem in evolutionary robotics using behavioral diversity. . Bridging the gap between value and policy based reinforcement learning. In Advances in Neural Information Processing Systems, pp. 2772-2782, 2017. Pierre-Yves Oudeyer, Frdric Kaplan, and Verena V Hafner. Intrinsic motivation systems for autonomous mental development. IEEE transactions on evolutionary computation, 11(2):265-286, 2007. Deepak Pathak, Pulkit Agrawal, Alexei A Efros, and Trevor Darrell. Curiosity-driven exploration by selfsupervised prediction. arXiv preprint arXiv:1705.05363, 2017. Vitchyr Pong, Shixiang Gu, Murtaza Dalal, and Sergey Levine. Temporal difference models: Model-free deep rl for model-based control. arXiv preprint arXiv:1802.09081, 2018. . Quality diversity: A new frontier for evolutionary computation. Frontiers in Robotics and AI, 3:40, 2016. Richard M Ryan and Edward L Deci. Intrinsic and extrinsic motivations: Classic definitions and new directions. Contemporary educational psychology, 25(1):54-67, 2000. Jürgen Schmidhuber. Formal theory of creativity, fun, and intrinsic motivation. IEEE Transactions on Autonomous Mental Development, 2(3):230-247, 2010.\n\nINTRODUCTION\n\nDeep reinforcement learning (RL) has been demonstrated to effectively learn a wide range of rewarddriven skills, including playing games (Mnih et al., 2013;Silver et al., 2016), controlling robots (Gu et al., 2017;Schulman et al., 2015b), and navigating complex environments (Zhu et al., 2017;Mirowski et al., 2016). However, intelligent creatures can explore their environments and learn useful skills even without supervision, so that when they are later faced with specific goals, they can use those skills to satisfy the new goals quickly and efficiently.\n\nLearning skills without reward has several practical applications. Environments with sparse rewards effectively have no reward until the agent randomly reaches a goal state. Learning useful skills without supervision may help address challenges in exploration in these environments. For long horizon tasks, skills discovered without reward can serve as primitives for hierarchical RL, effectively shortening the episode length. In many practical settings, interacting with the environment is essentially free, but evaluating the reward requires human feedback (Christiano et al., 2017). Unsupervised learning of skills may reduce the amount of supervision necessary to learn a task. While we can take the human out of the loop by designing a reward function, it is challenging to design a reward function that elicits the desired behaviors from the agent (Hadfield-Menell et al., 2017). Finally, when given an unfamiliar environment, it is challenging to determine what tasks an agent should be able to learn. Unsupervised skill discovery partially answers this question. 1 Autonomous acquisition of useful skills without any reward signal is an exceedingly challenging problem. A skill is a latent-conditioned policy that alters that state of the environment in a consistent way. We consider the setting where the reward function is unknown, so we want to learn a set of skills by maximizing the utility of this set. Making progress on this problem requires specifying a learning objective that ensures that each skill individually is distinct and that the skills collectively explore large parts of the state space. In this paper, we show how a simple objective based on mutual information can enable RL agents to autonomously discover such skills. These skills are useful for a number of applications, including hierarchical reinforcement learning and imitation learning.\n\nWe propose a method for learning diverse skills with deep RL in the absence of any rewards. We hypothesize that in order to acquire skills that are useful, we must train the skills so that they maximize coverage over the set of possible behaviors. While one skill might perform a useless behavior like random dithering, other skills should perform behaviors that are distinguishable from random dithering, and therefore more useful. A key idea in our work is to use discriminability between skills as an objective. Further, skills that are distinguishable are not necessarily maximally diverse -a slight difference in states makes two skills distinguishable, but not necessarily diverse in a semantically meaningful way. To combat problem, we want to learn skills that not only are distinguishable, but also are as diverse as possible. By learning distinguishable skills that are as random as possible, we can \"push\" the skills away from each other, making each skill robust to perturbations and effectively exploring the environment. By maximizing this objective, we can learn skills that run forward, do backflips, skip backwards, and perform face flops (see Figure 3).\n\nOur paper makes five contributions. First, we propose a method for learning useful skills without any rewards. We formalize our discriminability goal as maximizing an information theoretic objective with a maximum entropy policy. Second, we show that this simple exploration objective results in the unsupervised emergence of diverse skills, such as running and jumping, on several simulated robotic tasks. In a number of RL benchmark environments, our method is able to solve the benchmark task despite never receiving the true task reward. In these environments, some of the learned skills correspond to solving the task, and each skill that solves the task does so in a distinct manner. Third, we propose a simple method for using learned skills for hierarchical RL and find this methods solves challenging tasks. Four, we demonstrate how skills discovered can be quickly adapted to solve a new task. Finally, we show how skills discovered can be used for imitation learning.\n\n\nRELATED WORK\n\nPrevious work on hierarchical RL has learned skills to maximize a single, known, reward function by jointly learning a set of skills and a meta-controller (e.g., (Bacon et al., 2017;Heess et al., 2016;Dayan & Hinton, 1993;Frans et al., 2017;Krishnan et al., 2017;Florensa et al., 2017)). One problem with joint training (also noted by Shazeer et al. (2017)) is that the meta-policy does not select \"bad\" options, so these options do not receive any reward signal to improve. Our work prevents this degeneracy by using a random meta-policy during unsupervised skill-learning, such that neither the skills nor the meta-policy are aiming to solve any single task. A second importance difference is that our approach learns skills with no reward. Eschewing a reward function not only avoids the difficult problem of reward design, but also allows our method to learn task-agnostic.\n\nRelated work has also examined connections between RL and information theory (Ziebart et al., 2008;Schulman et al., 2017;Nachum et al., 2017;Haarnoja et al., 2017) and developed maximum entropy algorithms with these ideas Haarnoja et al. (2018;. Recent work has also applied tools from information theory to skill discovery. Mohamed & Rezende (2015) and Jung et al. (2011) use the mutual information between states and actions as a notion of empowerment for an intrinsically motivated agent. Our method maximizes the mutual information between states and skills, which can be interpreted as maximizing the empowerment of a hierarchical agent whose action space is the set of skills. Hausman et al. (2018), Florensa et al. (2017), and Gregor et al. (2016 showed that a discriminability objective is equivalent to maximizing the mutual information between the latent skill z and some aspect of the corresponding trajectory. Hausman et al. (2018) considered the setting with many tasks and reward functions and Florensa et al. (2017) considered the setting with a single task reward. Three important distinctions allow us to apply our method to tasks significantly more complex than the gridworlds in Gregor et al. (2016). First, we use maximum entropy policies to force our skills to be diverse. Our theoretical analysis shows that including entropy maximization in the RL objective results in the mixture of skills being maximum entropy in aggregate. Second, we fix the prior distribution over skills, rather than learning it. Doing so prevents our method from collapsing to sampling only a handful of skills. Third, while the discriminator in Gregor et al. (2016) only looks at the final state, our discriminator looks at every state, which provides additional reward signal. These three crucial differences help explain how our method learns useful skills in complex environments.\n\nPrior work in neuroevolution and evolutionary algorithms has studied how complex behaviors can be learned by directly maximizing diversity (Lehman & Stanley, 2011a;b;Woolley & Stanley, 2011;Stanley & Miikkulainen, 2002;Pugh et al., 2016;Mouret & Doncieux, 2009 while not converged do Sample skill z ∼ p(z) and initial state s0 ∼ p0(s) for t ← 1 to steps_per_episode do Sample action at ∼ π θ (at | st, z) from skill.\n\nStep environment: st+1 ∼ p(st+1 | st, at).\nCompute q φ (z | st+1) with discriminator. Set skill reward rt = log q φ (z | st+1) − log p(z)\nUpdate policy (θ) to maximize rt with SAC. Update discriminator (φ) with SGD. Figure 1: DIAYN Algorithm: We update the discriminator to better predict the skill, and update the skill to visit diverse states that make it more discriminable.\n\nWhile this prior work uses diversity maximization to obtain better solutions, we aim to acquire complex skills with minimal supervision to improve efficiency (i.e., reduce the number of objective function queries) and as a stepping stone for imitation learning and hierarchical RL. We focus on deriving a general, information-theoretic objective that does not require manual design of distance metrics and can be applied to any RL task without additional engineering.\n\nPrevious work has studied intrinsic motivation in humans and learned agents. Ryan & Deci (2000) Baranes & Oudeyer (2013). While these previous works use an intrinsic motivation objective to learn a single policy, we propose an objective for learning many, diverse policies. Concurrent work Achiam et al. (2017) draws ties between learning discriminable skills and variational autoencoders. We show that our method scales to more complex tasks, likely because of algorithmic design choices, such as our use of an off-policy RL algorithm and conditioning the discriminator on individual states.\n\n\nDIVERSITY IS ALL YOU NEED\n\nWe consider an unsupervised RL paradigm in this work, where the agent is allowed an unsupervised \"exploration\" stage followed by a supervised stage. In our work, the aim of the unsupervised stage is to learn skills that eventually will make it easier to maximize the task reward in the supervised stage. Conveniently, because skills are learned without a priori knowledge of the task, the learned skills can be used for many different tasks.\n\n\nHOW IT WORKS\n\nOur method for unsupervised skill discovery, DIAYN (\"Diversity is All You Need\"), builds off of three ideas. First, for skills to be useful, we want the skill to dictate the states that the agent visits. Different skills should visit different states, and hence be distinguishable. Second, we want to use states, not actions, to distinguish skills, because actions that do not affect the environment are not visible to an outside observer. For example, an outside observer cannot tell how much force a robotic arm applies when grasping a cup if the cup does not move. Finally, we encourage exploration and incentivize the skills to be as diverse as possible by learning skills that act as randomly as possible. Skills with high entropy that remain discriminable must explore a part of the state space far away from other skills, lest the randomness in its actions lead it to states where it cannot be distinguished.\n\nWe construct our objective using notation from information theory: S and A are random variables for states and actions, respectively; Z ∼ p(z) is a latent variable, on which we condition our policy; we refer to a the policy conditioned on a fixed Z as a \"skill\"; I(·; ·) and H[·] refer to mutual information and Shannon entropy, both computed with base e. In our objective, we maximize the mutual information between skills and states, I(A; Z), to encode the idea that the skill should control which states the agent visits. Conveniently, this mutual information dictates that we can infer the skill from the states visited. To ensure that states, not actions, are used to distinguish skills, we minimize the mutual information between skills and actions given the state, I(A; Z | S). Viewing all skills together with p(z) as a mixture of policies, we maximize the entropy H[A | S] of this mixture policy.\n\nIn summary, we maximize\nF(θ) I(S; Z) + H[A | S] − I(A; Z | S) (1) = (H[Z] − H[Z | S]) + H[A | S] − (H[A | S] − H[A | S, Z]) = H[Z] − H[Z | S] + H[A | S, Z](2)\nWe rearranged our objective in Equation 2 to give intuition on how we optimize it. 2 The first term encourages our prior distribution over p(z) to have high entropy. We fix p(z) to be uniform in our approach, guaranteeing that is has maximum entropy. The second term suggests that it should be easy to infer the skill z from the current state. The third term suggests that each skill should act as randomly as possible, which we achieve by using a maximum entropy policy to represent each skill. As we cannot integrate over all states and skills to compute p(z | s) exactly, we approximate this posterior with a learned discriminator q φ (z | s). Jensen's Inequality tells us that replacing p(z | s) with q φ (z | s) gives us a variational lower bound G(θ, φ) on our objective F(θ) (see (Agakov, 2004) for a detailed derivation):\nF(θ) = H[A | S, Z] − H[Z | S] + H[Z] = H[A | S, Z] + E z∼p(z),s∼π(z) [log p(z | s)] − E z∼p(z) [log p(z)] ≥ H[A | S, Z] + E z∼p(z),s∼π(z) [log q φ (z | s) − log p(z)] G(θ, φ)\n\nIMPLEMENTATION\n\nWe implement DIAYN with soft actor critic (Haarnoja et al., 2018), learning a policy π θ (a | s, z) that is conditioned on the latent variable z. Soft actor critic maximizes the policy's entropy over actions, which takes care of the entropy term in our objective G. Following Haarnoja et al. (2018), we scale the entropy regularizer H[a | s, z] by α. We found empirically that an α = 0.1 provided a good trade-off between exploration and discriminability. We maximize the expectation in G by replacing the task reward with the following pseudo-reward:\nr z (s, a) log q φ (z | s) − log p(z)(3)\nWe use a categorical distribution for p(z). During unsupervised learning, we sample a skill z ∼ p(z) at the start of each episode, and act according to that skill throughout the episode. The agent is rewarded for visiting states that are easy to discriminate, while the discriminator is updated to better infer the skill z from states visited. Entropy regularization occurs as part of the SAC update.\n\n\nSTABILITY\n\nUnlike prior adversarial unsupervised RL methods (e.g., Sukhbaatar et al. (2017)), DIAYN forms a cooperative game, which avoids many of the instabilities of adversarial saddle-point formulations.\n\nOn gridworlds, we can compute analytically that the unique optimum to the DIAYN optimization problem is to evenly partition the states between skills, with each skill assuming a uniform stationary distribution over its partition (proof in Appendix B). In the continuous and approximate setting, convergence guarantees would be desirable, but this is a very tall order: even standard RL methods with function approximation (e.g., DQN) lack convergence guarantees, yet such techniques are still useful. Empirically, we find DIAYN to be robust to random seed; varying the random seed does not noticeably affect the skills learned, and has little effect on downstream tasks (see Fig.s 4, 6, and 13).\n\n\nEXPERIMENTS\n\nIn this section, we evaluate DIAYN and compare to prior work. First, we analyze the skills themselves, providing intuition for the types of skills learned, the training dynamics, and how we avoid problematic behavior in previous work. In the second half, we show how the skills can be used for downstream tasks, via policy initialization, hierarchy, imitation, outperforming competitive baselines on most tasks. We encourage readers to view videos 3 and code 4 for our experiments. \n\n\nQuestion 1. What skills does DIAYN learn?\n\nWe study the skills learned by DIAYN on tasks of increasing complexity, ranging from 2 DOF point navigation to 111 DOF ant locomotion. We first applied DIAYN to a simple 2D navigation environment. The agent starts in the center of the box, and can take actions to directly move its (x, y) position. Figure 2a illustrates how the 6 skills learned for this task move away from each other to remain distinguishable. Next, we applied DIAYN to two classic control tasks, inverted pendulum and mountain car. Not only does our approach learn skills that solve the task without rewards, it learns multiple distinct skills for solving the task. (See Appendix D for further analysis.) Figure 3: Locomotion skills: Without any reward, DIAYN discovers skills for running, walking, hopping, flipping, and gliding. It is challenging to craft reward functions that elicit these behaviors.\n\nFinally, we applied DIAYN to three continuous control tasks (Brockman et al., 2016): half cheetah, hopper, and ant. As shown in Figure 3, we learn a diverse set of primitive behaviors for all tasks. For half cheetah, we learn skills for running forwards and backwards at various speeds, as well as skills for doing flips and falling over; ant learns skills for jumping and walking in many types of curved trajectories (though none walk in a straight line); hopper learns skills for balancing, hopping forward and backwards, and diving. See Appendix D.4 for a comparison with VIME. Question 2. How does the distribution of skills change during training?\n\nWhile DIAYN learns skills without a reward function, as an outside observer, can we evaluate the skills throughout training to understand the training dynamics. Figure 2 shows how the skills for inverted pendulum and mountain car become increasingly diverse throughout training ( Fig. 13 repeats this experiment for 5 random seeds, and shows that results are robust to initialization). Recall that our skills are learned with no reward, so it is natural that some skills correspond to small task reward while others correspond to large task reward. Question 3. Does discriminating on single states restrict DIAYN to learn skills that visit disjoint sets of states?\n\nOur discriminator operates at the level of states, not trajectories. While DIAYN favors skills that do not overlap, our method is not limited to learning skills that visit entirely disjoint sets of states. Figure 2b shows a simple experiment illustrating this. The agent starts in a hallway (green star), and can move more freely once exiting the end of the hallway into a large room. Because RL agents are incentivized to maximize their cumulative reward, they may take actions that initially give no reward to reach states that eventually give high reward. In this environment, DIAYN learns skills that exit the hallway to make them mutually distinguishable. The key difference from the most similar prior work on unsupervised skill discovery, VIC, is our decision to not learn the prior p(z). We found that VIC suffers from the \"Matthew Effect\" Merton (1968): VIC's learned prior p(z) will sample the more diverse skills more frequently, and hence only those skills will receive training signal to improve. To study this, we evaluated DIAYN and VIC on the half-cheetah environment, and plotting the effective number of skills (measured as exp(H[Z])) throughout training (details and more figures in Appendix E.2). The figure to the right shows how VIC quickly converges to a setting where it only samples a handful of skills. In contrast, DIAYN fixes the distribution over skills, which allows us to discover more diverse skills.\n\n\nHARNESSING LEARNED SKILLS\n\nThe perhaps surprising finding that we can discover diverse skills without a reward function creates a building block for many problems in RL. For example, to find a policy that achieves a high reward on a task, it is often sufficient to simply choose the skill with largest reward. Three less obvious applications are adapting skills to maximize a reward, hierarchical RL, and imitation learning.\n\n\nACCELERATING LEARNING WITH POLICY INITIALIZATION\n\nAfter DIAYN learns task-agnostic skills without supervision, we can quickly adapt the skills to solve a desired task. Akin to the use of pre-trained models in computer vision, we propose that DIAYN can serve as unsupervised pre-training for more sample-efficient finetuning of task-specific policies.\n\nFigure 5: Policy Initialization: Using a DIAYN skill to initialize weights in a policy accelerates learning, suggesting that pretraining with DIAYN may be especially useful in resource constrained settings. Results are averages across 5 random seeds.\n\nQuestion 5. Can we use learned skills to directly maximize the task reward?\n\nWe take the skill with highest reward for each benchmark task and further finetune this skill using the task-specific reward function. We compare to a \"random initialization\" baseline that is initialized from scratch. Our approach differs from this baseline only in how weights are initialized. We initialize both the policy and value networks with weights learned during unsupervised pretraining. Although the critic networks learned during pretraining corresponds to the pseudo-reward from the discriminator (Eq. 3) and not the true task reward, we found empirically that the pseudo-reward was close to the true task reward for the best skill, and initializing the critic in addition to the actor further sped up learning. Figure 5 shows both methods applied to half cheetah, hopper, and ant. We assume that the unsupervised pretraining is free (e.g., only the reward function is expensive to compute) or can be amortized across many tasks, so we omit pretraining steps from this plot. On all tasks, unsupervised pretraining enables the agent to learn the benchmark task more quickly.\n\n\nUSING SKILLS FOR HIERARCHICAL RL\n\nIn theory, hierarchical RL should decompose a complex task into motion primitives, which may be reused for multiple tasks. In practice, algorithms for hierarchical RL can encounter many problems:\n\n(1) each motion primitive reduces to a single action (Bacon et al., 2017), (2) the hierarchical policy only samples a single motion primitive (Gregor et al., 2016), or (3) all motion primitives attempt to do the entire task. In contrast, DIAYN discovers diverse, task-agnostic skills, which hold the promise of acting as a building block for hierarchical RL. Question 6. Are skills discovered by DIAYN useful for hierarchical RL?\n\nWe propose a simple extension to DIAYN for hierarchical RL, and find that simple algorithm outperforms competitive baselines on two challenging tasks. To use the discovered skills for hierarchical RL, we learn a meta-controller whose actions are to choose which skill to execute for the next k steps (100 for ant navigation, 10 for cheetah hurdle). The meta-controller has the same observation space as the skills. As an initial test, we applied the hierarchical RL algorithm to a simple 2D point navigation task (details in Appendix C.2). Figure 6 illustrates how the reward on this task increases with the number of skills; error bars show the standard deviation across 5 random seeds. To ensure that our goals were not cherry picked, we sampled 25 goals evenly from the state space, and evaluated each random seed on all goals. We also compared to VIME (Houthooft et al., 2016). Note that even the best random seed from VIME significantly under-performs DIAYN. This is not surprising: whereas DIAYN explicitly skills that effectively partition the state space, VIME attempts to learn a single policy that visits many states. Figure 7: DIAYN for Hierarchical RL: By learning a meta-controller to compose skills learned by DIAYN, cheetah quickly learns to jump over hurdles and ant solves a sparse-reward navigation task.\n\nCheetah Hurdle Ant Navigation Next, we applied the hierarchical algorithm to two challenging simulated robotics environment. On the cheetah hurdle task, the agent is rewarded for bounding up and over hurdles, while in the ant navigation task, the agent must walk to a set of 5 waypoints in a specific order, receiving only a sparse reward upon reaching each waypoint. The sparse reward and obstacles in these environments make them exceeding difficult for non-hierarchical RL algorithms. Indeed, state of  2016)). This experiment suggests that unsupervised skill learning provides an effective mechanism for combating challenges of exploration and sparse rewards in RL.\n\nQuestion 7. How can DIAYN leverage prior knowledge about what skills will be useful?\n\nIf the number of possible skills grows exponentially with the dimension of the task observation, one might imagine that DIAYN would fail to learn skills necessary to solve some tasks. While we found that DIAYN does scale to tasks with more than 100 dimensions (ant has 111), we can also use a simple modification to bias DIAYN towards discovering particular types of skills. We can condition the discriminator on only a subset of the observation space, or any other function of the observations. In this case, the discriminator maximizes E[log q φ (z | f (s))]. For example, in the ant navigation task, f (s) could compute the agent's center of mass, and DIAYN would learn skills that correspond to changing the center of mass. The \"DIAYN+prior\" result in Figure 7 (right) shows how incorporating this prior knowledge can aid DIAYN in discovering useful skills and boost performance on the hierarchical task. (No other experiments or figures in this paper used this prior.) The key takeaway is that while DIAYN is primarily an unsupervised RL algorithm, there is a simple mechanism for incorporating supervision when it is available. Unsurprisingly, we perform better on hierarchical tasks when incorporating more supervision.\n\n\nIMITATING AN EXPERT\n\nQuestion 8. Can we use learned skills to imitate an expert?\n\nAside from maximizing reward with finetuning and hierarchical RL, we can also use learned skills to follow expert demonstrations. One use-case is where a human manually controls the agent to complete a task that we would like to automate. Simply replaying the human's actions fails in stochastic environments, cases where closed-loop control is necessary. A second use-case involves an existing agent with a hard coded, manually designed policy. Imitation learning replaces the existing policy with a similar yet differentiable policy, which might be easier to update in response to new constraints or objectives. We consider the setting where we are given an expert trajectory consisting of states, without actions, defined as τ * = {(s i )} 1≤i≤N . Our goal is to obtain a feedback controller that will reach the same states. Given the expert trajectory, we use our learned discriminator to estimate which skill was most likely to have generated the trajectory. This optimization problem, which we solve for categorical z by enumeration, is equivalent to an M-projection (Bishop, 2016):\nz = arg max z Π st∈τ * q φ (z | s t )\nWe qualitatively evaluate this approach to imitation learning on half cheetah. Figure 9 (left) shows four imitation tasks, three of which our method successfully imitates. We quantitatively evaluate this imitation method on classic control tasks in Appendix G.\n\n\nCONCLUSION\n\nIn this paper, we present DIAYN, a method for learning skills without reward functions. We show that DIAYN learns diverse skills for complex tasks, often solving benchmark tasks with one of the learned skills without actually receiving any task reward. We further proposed methods for using the learned skills (1) to quickly adapt to a new task, (2) to solve complex tasks via hierarchical RL, and (3) to imitate an expert. As a rule of thumb, DIAYN may make learning a task easier by replacing the task's complex action space with a set of useful skills. DIAYN could be combined with methods for augmenting the observation space and reward function. Using the common language of information theory, a joint objective can likely be derived. DIAYN may also more efficiently learn from human preferences by having humans select among learned skills. Finally, the skills produced by DIAYN might be used by game designers to allow players to control complex robots and by artists to animate characters. \n\n\nA PSEUDO-REWARD\n\nThe log p(z) term in Equation 3 is a baseline that does not depend on the policy parameters θ, so one might be tempted to remove it from the objective. We provide a two justifications for keeping it. First, assume that episodes never terminate, but all skills eventually converge to some absorbing state (e.g., with all sensors broken). At this state, the discriminator cannot distinguish the skills, so its estimate is log q(z | s) = log(1/N ), where N is the number of skills. For practical reasons, we want to restart the episode after the agent reaches the absorbing state. Subtracting log(z) from the pseudo-reward at every time step in our finite length episodes is equivalent to pretending that episodes never terminate and the agent gets reward log(z) after our \"artificial\" termination. Second, assuming our discriminator q φ is better than chance, we see that q φ (z | s) ≥ p(z). Thus, subtracting the log p(z) baseline ensures our reward function is always non-negative, encouraging the agent to stay alive. Without this baseline, an optimal agent would end the episode as soon as possible. 5\n\n\nB OPTIMUM FOR GRIDWORLDS\n\nFor simple environments, we can compute an analytic solution to the DIAYN objective. For example, consider a N × N gridworld, where actions are to move up/down/left/right. Any action can be taken in any state, but the agent will stay in place if it attempts to move out of the gridworld. We use (x, y) to refer to states, where x, y ∈ {1, 2, · · · , N }.\n\nFor simplicity, we assume that, for every skill, the distribution of states visited exactly equals that skill's stationary distribution over states. To clarify, we will use π z to refer to the policy for skill z.\n\nWe use ρ πz to indicate skill z's stationary distribution over states, andρ πz as the empirical distribution over states within a single episode. Our assumption is equivalent to saying ρ πz (s) =ρ πz (s) ∀s ∈ S One way to ensure this is to assume infinite-length episodes.\n\nWe want to show that a set of skills that evenly partitions the state space is the optimum of the DIAYN objective for this task. While we will show this only for the 2-skill case, the 4 skill case is analogous.  The optimum policies for a set of two skills are those which evenly partition the state space. We will show that a top/bottom partition is one such (global) optima. The left/right case is analogous. Lemma B.1. A pair of skills with state distributions given below (and shown in Figure 10) are an optimum for the DIAYN objective with no entropy regularization (α = 0). ρ π1 (x, y) = 2 N 2 δ(y ≤ N/2) and ρ π2 (x, y) = 2 N 2 δ(y > N/2)\n\nBefore proving Lemma B.1, we note that there exist policies that achieve these stationary distributions. Figure 10b shows one such policy, were each arrow indicates a transition with probability 1 4 . Note that when the agent is in the bottom row of yellow states, it does not transition to the green states, and instead stays in place with probability 1 4 . Note that the distribution in Equation 4 satisfies the detailed balance equations (Murphy, 2012).\n\nProof. Recall that the DIAYN objective with no entropy regularization is:\n−H[Z | S] + H[Z]\nBecause the skills partition the states, we can always infer the skill from the state, so H[Z | S] = 0. By construction, the prior distribution over H[Z] is uniform, so H[Z] = log(2) is maximized. Thus, a set of two skills that partition the state space maximizes the un-regularized DIAYN objective.\n\nNext, we consider the regularized objective. In this case, we will show that while an even partition is not perfectly optimal, it is \"close\" to optimal, and its \"distance\" from optimal goes to zero as the gridworld grows in size. This analysis will give us additional insight into the skills preferred by the DIAYN objective. Proof. Recall that the DIAYN objective with no entropy regularization is:\n\n\nH[A | S, Z] − H[Z | S] + H[Z]\n\nWe have already computed the second two terms in the previous proof: H[Z | S] = 0 and H[Z] = log(2). For computing the first term, it is helpful to define the set of \"border states\" for a particular skill as those that do not neighbor another skill. For the skill 1 in Figure 10  Note that the term for maximum entropy over actions (H[A | S, Z]) comes into conflict with the term for discriminability (−H[Z | S]) at states along the border between two skills. Everything else being equal, this conflict encourages DIAYN to produce skills that have small borders, as shown in Figure 11. For example, in a gridworld with dimensions N < M , a pair of skills that split along the first dimension (producing partitions of size (N, M/2)) would achieve a larger (better) objective than skills that split along the second dimension. This same intuition that DIAYN seeks to minimize the border length between skills results in DIAYN preferring partitions that correspond to bottleneck states (see Figure 11b).\n\n\nC EXPERIMENTAL DETAILS\n\nIn our experiments, we use the same hyperparameters as those in Haarnoja et al. (2018), with one notable exception. For the Q function, value function, and policy, we use neural networks with 300 hidden units instead of 128 units. We found that increasing the model capacity was necessary to learn many diverse skills. When comparing the \"skill initialization\" to the \"random initialization\" in Section 4.2, we use the same model architecture for both methods. To pass skill z to the Q function, value function, and policy, we simply concatenate z to the current state s t . As in Haarnoja et al. (2018), epochs are 1000 episodes long. For all environments, episodes are at most 1000 steps long, but may be shorter. For example, the standard benchmark hopper environment terminates the episode once it falls over. Figures 2 and 5 show up to 1000 epochs, which corresponds to at most 1 million steps. We found that learning was most stable when we scaled the maximum entropy objective (H[A | S, Z] in Eq. 1) by α = 0.1. We use this scaling for all experiments. The cheetah hurdle environment is a modification of HalfCheetah-v1, where we added boxes with shape H = 0.25m, W = 0.1m, D = 1.0m, where the width dimension is along the same axis as the cheetah's forward movement. We placed the boxes ever 3 meters, start at x = −1m.\n\nThe ant navigation environment is a modification of Ant-v1. To improve stability, we follow Pong et al. (2018) and lower the gear ratio of all joints to 30. The goals are the corners of a square, centered at the origin, with side length of 4 meters: [(2, 2), (2, −2), (−2, −2), (−2, 2), (2, 2)]. The ant starts at the origin, and receives a reward of +1 when its center of mass is within 0.5 meters of the correct next goal. Each reward can only be received once, so the maximum possible reward is +5.\n\n\nC.2 HIERARCHICAL RL EXPERIMENT\n\nFor the 2D navigation experiment shown in Figure 6, we first learned a set of skills on the point environment. Next, we introduced a reward function r g (s) = − s − g 2 2 penalizing the distance from the agent's state to some goal, and applied the hierarchical algorithm above. In this task, the DIAYN skills provided sufficient coverage of the state space that the hierarchical policy only needed to take a single action (i.e., choose a single skill) to complete the task.\n\n\nD MORE ANALYSIS OF DIAYN SKILLS\n\nD.1 TRAINING OBJECTIVES Figure 12: Objectives: We plot the two terms from our objective (Eq. 1) throughout training. While the entropy regularizer (blue) quickly plateaus, the discriminability term (orange) term continues to increase, indicating that our skills become increasingly diverse without collapsing to deterministic policies. This plot shows the mean and standard deviation across 5 seeds for learning 20 skills in half cheetah environment. Note that log 2 (1/20) ≈ −3, setting a lower bound for log q φ (z | s).\n\nTo provide further intuition into our approach, Figure 12 plots the two terms in our objective throughout training. Our skills become increasingly diverse throughout training without converging to deterministic policies. Figure 13: We repeated the experiment from Figure 2 with 5 random seeds to illustrate the robustness of our method to random seed.\n\nTo illustrate the stability of DIAYN to random seed, we repeated the experiment in Figure 2 for 5 random seeds. Figure 13 illustrates that the random seed has little effect on the training dynamics.\n\n\nD.2 EFFECT OF ENTROPY REGULARIZATION\n\nQuestion 9. Does entropy regularization lead to more diverse skills?\nα = 0.01 α = 1 α = 10\nTo answer this question, we apply our method to a 2D point mass. The agent controls the orientation and forward velocity of the point, with is confined within a 2D box. We vary the entropy regularization α, with larger values of α corresponding to policies with more stochastic actions. With small α, we learn skills that move large distances in different directions but fail to explore large parts of the state space. Increasing α makes the skills visit a more diverse set of states, which may help with exploration in complex state spaces. It is difficult to discriminate skills when α is further increased.\n\nD.3 DISTRIBUTION OVER TASK REWARD (a) Hopper (b) Half Cheetah (c) Ant Figure 15: Task reward of skills learned without reward: While our skills are learned without the task reward function, we evaluate each with the task reward function for analysis. The wide range of rewards shows the diversity of the learned skills. In the hopper and half cheetah tasks, many skills achieve large task reward, despite not observing the task reward during training. As discussed in prior work (Henderson et al., 2017;Duan et al., 2016), standard model-free algorithms trained directly on the task reward converge to scores of 1000 -3000 on hopper, 1000 -5000 on cheetah, and 700 -2000 on ant.\n\nIn Figure 15, we take the skills learned without any rewards, and evaluate each of them on the standard benchmark reward function. We compare to random (untrained) skills. The wide distribution over rewards is evidence that the skills learned are diverse. For hopper, some skills hop or stand for the entire episode, receiving a reward of at least 1000. Other skills aggressively hop forwards or dive backwards, and receive rewards between 100 and 1000. Other skills fall over immediately and receive rewards of less than 100. The benchmark half cheetah reward includes a control penalty for taking actions. Unlike random skills, learned skills rarely have task reward near zero, indicating that all take actions to become distinguishable. Skills that run in place, flop on their nose, or do backflips receive reward of -100. Skills that receive substantially smaller reward correspond to running quickly backwards, while skills that receive substantially larger reward correspond to running forward. Similarly, the benchmark ant task reward includes both a control penalty and a survival bonus, so random skills that do nothing receive a task reward near 1000. While no single learned skill learns to run directly forward and obtain a task reward greater than 1000, our learned skills run in different patterns to become discriminable, resulting in a lower task reward.\n\n\nD.4 EXPLORATION\n\nQuestion 10. Does DIAYN explore effectively in complex environments?\n\nWe apply DIAYN to three standard RL benchmark environments: half-cheetah, hopper, and ant. In all environments, we learn diverse locomotion primitives, as shown in Figure 3. Despite never receiving any reward, the half cheetah and hopper learn skills that move forward and achieve large task reward on the corresponding RL benchmarks, which all require them to move forward at a fast pace. Half cheetah and hopper also learn skills that move backwards, corresponding to receiving a task reward much smaller than what a random policy would receive. Unlike hopper and half cheetah, the ant is free to move in the XY plane. While it learns skills that move in different directions, most skills move in arcs rather than straight lines, meaning that we rarely learn a single skill that achieves large task reward on the typical task of running forward. In the appendix, we visualize the objective throughout training.\n\nIn Figure 16, we evaluate all skills on three reward functions: running (maximize X coordinate), jumping (maximize Z coordinate) and moving (maximize L2 distance from origin). For each skill, DIAYN learns some skills that achieve high reward. We compare to single policy trained with a pure exploration objective (VIME (Houthooft et al., 2016)). Whereas previous work (e.g., Pathak et al. (2017); Bellemare et al. (2016); Houthooft et al. (2016)) finds a single policy that explores well, DIAYN optimizes a collection of policies, which enables more diverse exploration. Figure 16: Exploration: We take DIAYN skills learned without a reward function, and evaluate on three natural reward functions: running, jumping, and moving away from the origin. For all tasks, DIAYN learns some skills that perform well. In contrast, a single policy that maximizes an exploration bonus (VIME) performs poorly on all tasks.\n\n\nE LEARNING p(z)\n\nWe used our method as a starting point when comparing to VIC (Gregor et al., 2016) in Section 4.2. While p(z) is fixed in our method, we implement VIC by learning p(z). In this section, we describe how we learned p(z), and show the effect of learning p(z) rather than leaving it fixed.\n\n\nE.1 HOW TO LEARN p(z)\n\nWe choose p(z) to optimize the following objective, where p z (s) is the distribution over states induced by skill s:\nH[S, Z] = H[Z] − H[Z | S] = z −p(z) log p(z) + z E s∼pz(s) [log p(z | s)] = z p(z) E s∼pz(s) [log p(z | s)] − log p(z)\nFor clarity, we define p t z (s) as the distribution over states induced by skill z at epoch t, and define t (z) as an approximation of E[log p(z | s)] using the policy and discriminator from epoch t:\nt (z) E s∼p t z (s) [log q t (z | s)]\nNoting that p(z) is constrained to sum to 1, we can optimize this objective using the method of Lagrange multipliers. The corresponding Lagrangian is\nL(p) = z p(z) ( t (z) − log p(z)) + λ z p(z) − 1 whose derivative is ∂L ∂p(z) =¨p(z) −1p (z) + t (z) − log p(z) + λ = t (z) − log p(z) + λ − 1\nSetting the derivative equal to zero, we get log p(z) = t (z) + λ − 1 and finally arrive at p(z) ∝ e t(z) Figure 17: Effect of learning p(z): We plot the effective number of skills that are sampled from the skill distribution p(z) throughout training. Note how learning p(z) greatly reduces the effective number on inverted pendulum and mountain car. We show results from 3 random seeds for each environment.\n\n\nE.2 EFFECT OF LEARNING p(z)\n\nIn this section, we briefly discuss the effect of learning p(z) rather than leaving it fixed. To study the effect of learning p(z), we compared the entropy of p(z) throughout training. When p(z) is fixed, the entropy is a constant (log(50) ≈ 3.9). To convert nats to a more interpretable quantity, we compute the effective number of skills by exponentiation the entropy: effective num. skills e H[Z] Figure 17 shows the effective number of skills for half cheetah, inverted pendulum, and mountain car. Note how the effective number of skills drops by a factor of 10x when we learn p(z). This observation supports our claim that learning p(z) results in learning fewer diverse skills. Note that among balancing skills, there is a wide diversity of balancing positions, control frequencies, and control magnitudes. For mountain car (bottom), we show skills that achieve larger reward (complete the task), skills with near-zero reward, and skills with very negative reward. Note that skills that solve the task (green) employ varying strategies.\n\nIn this section, we visualize the skills learned for inverted pendulum and mountain car without a reward. Not only does our approach learn skills that solve the task without rewards, it learns multiple distinct skills for solving the task. Figure 18 shows the X position of the agent across time, within one episode. For inverted pendulum (Fig. 18a), we plot only skills that solve the task. Horizontal lines with different X coordinates correspond to skills balancing the pendulum at different positions along the track. The periodic lines correspond to skills that oscillate back and forth while balancing the pendulum. Note that skills that oscillate have different X positions, amplitudes, and periods. For mountain car (Fig. 18b), skills that climb the mountain employ a variety of strategies for to do so. Most start moving backwards to gather enough speed to summit the mountain, while others start forwards, then go backwards, and then turn around to summit the mountain. Additionally, note that skills differ in when the turn around and in their velocity (slope of the green lines).    : Imitating an expert: Across 600 imitation tasks, we find our method more closely matches the expert than all baselines.\n\n\nG IMITATION LEARNING\n\nGiven the expert trajectory, we use our learned discriminator to estimate which skill was most likely to have generated the trajectory:ẑ = arg max z Π st∈τ * q φ (z | s t )\n\nAs motivation for this optimization problem, note that each skill induces a distribution over states, p z p(s | z). We use p * to denote the distribution over states for the expert policy. With a fixed prior distribution p(z) and a perfect discriminator q φ (z | s) = p(z | s), we have p(s | z) ∝ q φ (z | s) as a function of z. Thus, Equation G is an M-projection of the expert distribution over states onto the family of distributions over states, P = {p z }: arg min\np z ∈P D(p * || p z )(5)\nFor clarity, we omit a constant that depends only on p * . Note that the use of an M-projection, rather than an I-projection, helps guarantee that the retrieved skill will visit all states that the expert visits (Bishop, 2016). In our experiments, we solve Equation 5 by simply iterating over skills.\n\n\nG.1 IMITATION LEARNING EXPERIMENTS\n\nThe \"expert\" trajectories are actually generated synthetically in these experiments, by running a different random seed of our algorithm. A different seed is used to ensure that the trajectories are not actually produced by any of the currently available skills. Of course, in practice, the expert trajectories might be provided by any other means, including a human. For each expert trajectory, we retrieve the closest DIAYN skillẑ using Equation 4.2.3. Evaluating q φ (ẑ | τ * ) gives us an estimate of the probability that the imitation will match the expert (e.g., for a safety critical setting). This quantity is useful for predicting how accurately our method will imitate an expert before executing the imitation policy. In a safety critical setting, a user may avoid attempting tasks where this score is low. We compare our method to three baselines. The \"low entropy\" baseline is a variant on our method with lower entropy regularization. The \"learned p(z)\" baseline learns the distribution over skills. Note that Variational Intrinsic Control (Gregor et al., 2016) is a combination of the \"low entropy\" baseline and the \"learned p(z)\" baseline. Finally, the \"few skills\" baseline learns only 5 skills, whereas all other methods learn 50. Figure 22 shows the results aggregated across 600 imitation tasks. The X-axis shows the discriminator score, our estimate for how well the imitation policy will match the expert. The Y-axis shows the true distance between the trajectories, as measured by L2 distance in state space. For all methods, the distance between the expert and the imitation decreases as the discriminator's score increases, indicating that the discriminator's score is a good predictor of task performance. Our method consistently achieves the lowest trajectory distance among all methods. The \"low entropy\" baseline is slightly worse, motivating our decision to learn maximum entropy skills. When imitating tasks using the \"few skills\" baseline, the imitation trajectories are even further from the expert trajectory. This is expected -by learning more skills, we obtain a better \"coverage\" over the space of skills. A \"learn p(z)\" baseline that learns the distribution over skills also performs poorly. Recalling that Gregor et al. (2016) is a combination of the \"low entropy\" baseline and the \"learn p(z)\" baseline, this plot provides evidence that using maximum entropy policies and fixing the distribution for p(z) are two factors that enabled our method to scale to more complex tasks.\n\n\n; Bellemare et al. (2016); Fu et al. (2017); Schmidhuber (2010); Oudeyer et al. (2007); Pathak et al. (2017);\n\nFigure 2 :\n2(Left) DIAYN skills in a simple navigation environment; (Center) skills can overlap if they eventually become distinguishable; (Right) diversity of the rewards increases throughout training.\n\nQuestion 4 .Figure 4 :\n44How does DIAYN differ from Variational Intrinsic Control (VIC) (Gregor et al., 2016)? Why use a fixed prior? In contrast to prior work, DIAYN continues to sample all skills throughout training.\n\nFigure 6 :\n6Hierarchical RL\n\nFigure 9 :\n9Imitating an expert: DIAYN imitates an expert standing upright, flipping, and faceplanting, but fails to imitate a handstand.the art RL algorithms that do not use hierarchies perform poorly on these tasks.Figure 7 shows how DIAYN outperforms state of the art on-policy RL (TRPO (Schulman et al., 2015a)), off-policy RL (SAC (Haarnoja et al., 2018)), and exploration bonuses (VIME (Houthooft et al.,\n\n\nPolicy for one of the optimal skills. The agent stays in place when it attempts to leave the gridworld.\n\nFigure 10 :\n10Optimum for Gridworlds: For gridworld environments, we can compute an analytic solution to the DIAYN objective.\n\n\nLemma B.2. A pair of skills with state distributions given given in Equation 4 achieve an DIAYN objective within a factor of O(1/N ) of the optimum, where N is the gridworld size.\n\nFigure 11 :\n11(colored yellow), the border states are: {(x, y) | y = 4}. Now, computing the first term is straightforward: The DIAYN objective prefers skills that (Left) partition states into sets with short borders and (Right) which correspond to bottleneck states.\n\n\nour experiments used the following, standard RL environments(Brockman et al., 2016): HalfCheetah-v1, Ant-v1, Hopper-v1, MountainCarContinuous-v0, and InvertedPendulum-v1. The simple 2D navigation task used inFigures 2a and 6was constructed as follows. The agent starts in the center of the unit box. Observations s ∈ [0, 1] 2 are the agent's position. Actions a ∈ [−0.1, 0.1] 2 directly change the agent's position. If the agent takes an action to leave the box, it is projected to the closest point inside the box.\n\nFFigure 18 :\n18VISUALIZING Visualizing Skills: For every skill, we collect one trajectory and plot the agent's X coordinate across time. For inverted pendulum (top), we only plot skills that balance the pendulum.\n\nFigure 19 :\n19Half cheetah skills: We show skills learned by half-cheetah with no reward.\n\nF. 2\n2SIMULATED ROBOT TASKS Figures 19, 20, and 21 show more skills learned without reward.\n\nFigure 20 :\n20Hopper Skills: We show skills learned by hopper with no reward.\n\nFigure 21 :\n21Ant skills: We show skills the ant learns without any supervision. Ant learns (top row) to move right, (middle row) to move left, (bottom row, left to right) to move up, to move down, to flip on its back, and to rotate in place.\n\nFigure 22\n22Figure 22: Imitating an expert: Across 600 imitation tasks, we find our method more closely matches the expert than all baselines.\n\n\n).Sample one skill per \nepisode from fixed \nskill distribution. \n\nSKILL \n\nDISCRIMINATOR \n\nENVIRONMENT \n\nDiscriminator estimates skill \nfrom state. Update discriminator \nto maximize discriminability. \nUpdate skill to maximize \ndiscriminability. \n\nLearned \n\nFixed \n\nAlgorithm 1: DIAYN \n\n\n\n\nJohn Schulman, Sergey Levine, Pieter Abbeel, Michael Jordan, and Philipp Moritz. Trust region policy optimization. In International Conference on Machine Learning, pp. 1889-1897, 2015a. John Schulman, Philipp Moritz, Sergey Levine, Michael Jordan, and Pieter Abbeel. High-dimensional continuous control using generalized advantage estimation. arXiv preprint arXiv:1506.02438, 2015b. Brian G Woolley and Kenneth O Stanley. On the deleterious effects of a priori objectives on evolution and representation. In Proceedings of the 13th annual conference on Genetic and evolutionary computation, pp. 957-964. ACM, 2011. Yuke Zhu, Roozbeh Mottaghi, Eric Kolve, Joseph J Lim, Abhinav Gupta, Li Fei-Fei, and Ali Farhadi. Targetdriven visual navigation in indoor scenes using deep reinforcement learning. In Robotics and Automation (ICRA), 2017 IEEE International Conference on, pp. 3357-3364. IEEE, 2017.John Schulman, Pieter Abbeel, and Xi Chen. Equivalence between policy gradients and soft q-learning. arXiv \npreprint arXiv:1704.06440, 2017. \n\nNoam Shazeer, Azalia Mirhoseini, Krzysztof Maziarz, Andy Davis, Quoc Le, Geoffrey Hinton, and Jeff \nDean. Outrageously large neural networks: The sparsely-gated mixture-of-experts layer. arXiv preprint \narXiv:1701.06538, 2017. \n\nDavid Silver, Aja Huang, Chris J Maddison, Arthur Guez, Laurent Sifre, George Van Den Driessche, Julian \nSchrittwieser, Ioannis Antonoglou, Veda Panneershelvam, Marc Lanctot, et al. Mastering the game of go with \ndeep neural networks and tree search. nature, 529(7587):484-489, 2016. \n\nKenneth O Stanley and Risto Miikkulainen. Evolving neural networks through augmenting topologies. Evolu-\ntionary computation, 10(2):99-127, 2002. \n\nFelipe Petroski Such, Vashisht Madhavan, Edoardo Conti, Joel Lehman, Kenneth O Stanley, and Jeff Clune. \nDeep neuroevolution: Genetic algorithms are a competitive alternative for training deep neural networks for \nreinforcement learning. arXiv preprint arXiv:1712.06567, 2017. \n\nSainbayar Sukhbaatar, Zeming Lin, Ilya Kostrikov, Gabriel Synnaeve, Arthur Szlam, and Rob Fergus. Intrinsic \nmotivation and automatic curricula via asymmetric self-play. arXiv preprint arXiv:1703.05407, 2017. \n\nBrian D Ziebart, Andrew L Maas, J Andrew Bagnell, and Anind K Dey. Maximum entropy inverse reinforcement \nlearning. In AAAI, volume 8, pp. 1433-1438. Chicago, IL, USA, 2008. \n\nWhile our method uses stochastic policies, note that for deterministic policies in continuous action spaces, I(A; Z | S) = H[A | S]. Thus, for deterministic policies, Equation 2 reduces to maximizing I(S; Z). 3 https://sites.google.com/view/diayn/ 4 https://github.com/ben-eysenbach/sac/blob/master/DIAYN.md\nIn some environments, such as mountain car, it is desirable for the agent to end the episode as quickly as possible. For these types of environments, the log p(z) baseline can be removed.\n\nVariational autoencoding learning of options by reinforcement. Joshua Achiam, Harrison Edwards, Dario Amodei, Pieter Abbeel, NIPS Deep Reinforcement Learning Symposium. Joshua Achiam, Harrison Edwards, Dario Amodei, and Pieter Abbeel. Variational autoencoding learning of options by reinforcement. NIPS Deep Reinforcement Learning Symposium, 2017.\n\nThe im algorithm: a variational approach to information maximization. David Barber, Felix Agakov, Advances in Neural Information Processing Systems. 16201David Barber Felix Agakov. The im algorithm: a variational approach to information maximization. Advances in Neural Information Processing Systems, 16:201, 2004.\n\nThe option-critic architecture. Pierre-Luc Bacon, Jean Harb, Doina Precup, AAAI. Pierre-Luc Bacon, Jean Harb, and Doina Precup. The option-critic architecture. In AAAI, pp. 1726-1734, 2017.\n\nActive learning of inverse models with intrinsically motivated goal exploration in robots. Adrien Baranes, Pierre-Yves Oudeyer, Robotics and Autonomous Systems. 611Adrien Baranes and Pierre-Yves Oudeyer. Active learning of inverse models with intrinsically motivated goal exploration in robots. Robotics and Autonomous Systems, 61(1):49-73, 2013.\n\nUnifying count-based exploration and intrinsic motivation. Marc Bellemare, Sriram Srinivasan, Georg Ostrovski, Tom Schaul, David Saxton, Remi Munos, Advances in Neural Information Processing Systems. Marc Bellemare, Sriram Srinivasan, Georg Ostrovski, Tom Schaul, David Saxton, and Remi Munos. Unifying count-based exploration and intrinsic motivation. In Advances in Neural Information Processing Systems, pp. 1471-1479, 2016.\n\nM Christopher, Bishop, Pattern Recognition and Machine Learning. New YorkSpringer-VerlagChristopher M Bishop. Pattern Recognition and Machine Learning. Springer-Verlag New York, 2016.\n\n. Greg Brockman, Vicki Cheung, Ludwig Pettersson, Jonas Schneider, John Schulman, Jie Tang, Wojciech Zaremba, arXiv:1606.01540Openai gym. arXiv preprintGreg Brockman, Vicki Cheung, Ludwig Pettersson, Jonas Schneider, John Schulman, Jie Tang, and Wojciech Zaremba. Openai gym. arXiv preprint arXiv:1606.01540, 2016.\n\nDeep reinforcement learning from human preferences. Jan Paul F Christiano, Tom Leike, Miljan Brown, Shane Martic, Dario Legg, Amodei, Advances in Neural Information Processing Systems. Paul F Christiano, Jan Leike, Tom Brown, Miljan Martic, Shane Legg, and Dario Amodei. Deep reinforcement learning from human preferences. In Advances in Neural Information Processing Systems, pp. 4302-4310, 2017.\n", "annotations": {"author": "[{\"end\":171,\"start\":72},{\"end\":247,\"start\":172},{\"end\":328,\"start\":248},{\"end\":409,\"start\":329}]", "publisher": null, "author_last_name": "[{\"end\":90,\"start\":81},{\"end\":186,\"start\":181},{\"end\":267,\"start\":261},{\"end\":348,\"start\":342}]", "author_first_name": "[{\"end\":80,\"start\":72},{\"end\":180,\"start\":172},{\"end\":254,\"start\":248},{\"end\":260,\"start\":255},{\"end\":334,\"start\":329},{\"end\":341,\"start\":335}]", "author_affiliation": "[{\"end\":170,\"start\":112},{\"end\":246,\"start\":188},{\"end\":327,\"start\":269},{\"end\":408,\"start\":350}]", "title": "[{\"end\":69,\"start\":1},{\"end\":478,\"start\":410}]", "venue": null, "abstract": "[{\"end\":3930,\"start\":480}]", "bib_ref": "[{\"end\":3978,\"start\":3974},{\"end\":4102,\"start\":4083},{\"end\":4122,\"start\":4102},{\"end\":4160,\"start\":4143},{\"end\":4183,\"start\":4160},{\"end\":4239,\"start\":4221},{\"end\":4261,\"start\":4239},{\"attributes\":{\"ref_id\":\"b7\"},\"end\":5092,\"start\":5067},{\"end\":5392,\"start\":5362},{\"attributes\":{\"ref_id\":\"b2\"},\"end\":8733,\"start\":8713},{\"end\":8752,\"start\":8733},{\"end\":8773,\"start\":8752},{\"end\":8792,\"start\":8773},{\"end\":8814,\"start\":8792},{\"end\":8836,\"start\":8814},{\"end\":8907,\"start\":8886},{\"end\":9529,\"start\":9507},{\"end\":9551,\"start\":9529},{\"end\":9571,\"start\":9551},{\"end\":9593,\"start\":9571},{\"end\":9674,\"start\":9652},{\"end\":9779,\"start\":9755},{\"end\":9802,\"start\":9784},{\"end\":10133,\"start\":10113},{\"end\":10157,\"start\":10133},{\"end\":10183,\"start\":10157},{\"end\":10373,\"start\":10352},{\"end\":10460,\"start\":10438},{\"end\":10648,\"start\":10628},{\"end\":11093,\"start\":11073},{\"end\":11477,\"start\":11452},{\"end\":11479,\"start\":11477},{\"end\":11503,\"start\":11479},{\"end\":11532,\"start\":11503},{\"end\":11550,\"start\":11532},{\"end\":11573,\"start\":11550},{\"attributes\":{\"ref_id\":\"b3\"},\"end\":12699,\"start\":12675},{\"attributes\":{\"ref_id\":\"b0\"},\"end\":12889,\"start\":12869},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":16443,\"start\":16429},{\"end\":16729,\"start\":16706},{\"attributes\":{\"ref_id\":\"b6\"},\"end\":20065,\"start\":20042},{\"attributes\":{\"ref_id\":\"b2\"},\"end\":25238,\"start\":25218},{\"end\":26476,\"start\":26452},{\"end\":34487,\"start\":34473},{\"end\":36428,\"start\":36406},{\"end\":36945,\"start\":36923},{\"end\":41037,\"start\":41013},{\"end\":41055,\"start\":41037},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":44008,\"start\":43985},{\"end\":44600,\"start\":44575},{\"attributes\":{\"ref_id\":\"b5\"},\"end\":49218,\"start\":49204},{\"attributes\":{\"ref_id\":\"b6\"},\"end\":53592,\"start\":53569}]", "figure": "[{\"attributes\":{\"id\":\"fig_0\"},\"end\":51958,\"start\":51847},{\"attributes\":{\"id\":\"fig_1\"},\"end\":52162,\"start\":51959},{\"attributes\":{\"id\":\"fig_2\"},\"end\":52382,\"start\":52163},{\"attributes\":{\"id\":\"fig_3\"},\"end\":52411,\"start\":52383},{\"attributes\":{\"id\":\"fig_4\"},\"end\":52823,\"start\":52412},{\"attributes\":{\"id\":\"fig_5\"},\"end\":52929,\"start\":52824},{\"attributes\":{\"id\":\"fig_6\"},\"end\":53056,\"start\":52930},{\"attributes\":{\"id\":\"fig_7\"},\"end\":53238,\"start\":53057},{\"attributes\":{\"id\":\"fig_8\"},\"end\":53506,\"start\":53239},{\"attributes\":{\"id\":\"fig_9\"},\"end\":54024,\"start\":53507},{\"attributes\":{\"id\":\"fig_10\"},\"end\":54238,\"start\":54025},{\"attributes\":{\"id\":\"fig_11\"},\"end\":54329,\"start\":54239},{\"attributes\":{\"id\":\"fig_12\"},\"end\":54422,\"start\":54330},{\"attributes\":{\"id\":\"fig_13\"},\"end\":54501,\"start\":54423},{\"attributes\":{\"id\":\"fig_14\"},\"end\":54745,\"start\":54502},{\"attributes\":{\"id\":\"fig_15\"},\"end\":54889,\"start\":54746},{\"attributes\":{\"id\":\"tab_0\",\"type\":\"table\"},\"end\":55177,\"start\":54890},{\"attributes\":{\"id\":\"tab_1\",\"type\":\"table\"},\"end\":57547,\"start\":55178}]", "paragraph": "[{\"end\":4505,\"start\":3946},{\"end\":6381,\"start\":4507},{\"end\":7554,\"start\":6383},{\"end\":8534,\"start\":7556},{\"end\":9428,\"start\":8551},{\"end\":11311,\"start\":9430},{\"end\":11729,\"start\":11313},{\"end\":11773,\"start\":11731},{\"end\":12108,\"start\":11869},{\"end\":12577,\"start\":12110},{\"end\":13171,\"start\":12579},{\"end\":13642,\"start\":13201},{\"end\":14574,\"start\":13659},{\"end\":15481,\"start\":14576},{\"end\":15506,\"start\":15483},{\"end\":16471,\"start\":15642},{\"end\":17215,\"start\":16664},{\"end\":17657,\"start\":17257},{\"end\":17866,\"start\":17671},{\"end\":18563,\"start\":17868},{\"end\":19061,\"start\":18579},{\"end\":19980,\"start\":19107},{\"end\":20634,\"start\":19982},{\"end\":21300,\"start\":20636},{\"end\":22734,\"start\":21302},{\"end\":23161,\"start\":22764},{\"end\":23514,\"start\":23214},{\"end\":23766,\"start\":23516},{\"end\":23843,\"start\":23768},{\"end\":24931,\"start\":23845},{\"end\":25163,\"start\":24968},{\"end\":25594,\"start\":25165},{\"end\":26918,\"start\":25596},{\"end\":27589,\"start\":26920},{\"end\":27675,\"start\":27591},{\"end\":28903,\"start\":27677},{\"end\":28986,\"start\":28927},{\"end\":30076,\"start\":28988},{\"end\":30375,\"start\":30115},{\"end\":31389,\"start\":30390},{\"end\":32512,\"start\":31409},{\"end\":32895,\"start\":32541},{\"end\":33109,\"start\":32897},{\"end\":33383,\"start\":33111},{\"end\":34030,\"start\":33385},{\"end\":34488,\"start\":34032},{\"end\":34563,\"start\":34490},{\"end\":34880,\"start\":34581},{\"end\":35281,\"start\":34882},{\"end\":36315,\"start\":35315},{\"end\":37669,\"start\":36342},{\"end\":38172,\"start\":37671},{\"end\":38680,\"start\":38207},{\"end\":39238,\"start\":38716},{\"end\":39591,\"start\":39240},{\"end\":39791,\"start\":39593},{\"end\":39900,\"start\":39832},{\"end\":40532,\"start\":39923},{\"end\":41212,\"start\":40534},{\"end\":42584,\"start\":41214},{\"end\":42672,\"start\":42604},{\"end\":43586,\"start\":42674},{\"end\":44498,\"start\":43588},{\"end\":44803,\"start\":44518},{\"end\":44946,\"start\":44829},{\"end\":45266,\"start\":45066},{\"end\":45454,\"start\":45305},{\"end\":46006,\"start\":45598},{\"end\":47080,\"start\":46038},{\"end\":48298,\"start\":47082},{\"end\":48495,\"start\":48323},{\"end\":48966,\"start\":48497},{\"end\":49292,\"start\":48992},{\"end\":51846,\"start\":49331}]", "formula": "[{\"attributes\":{\"id\":\"formula_0\"},\"end\":11868,\"start\":11774},{\"attributes\":{\"id\":\"formula_1\"},\"end\":15641,\"start\":15507},{\"attributes\":{\"id\":\"formula_2\"},\"end\":16646,\"start\":16472},{\"attributes\":{\"id\":\"formula_3\"},\"end\":17256,\"start\":17216},{\"attributes\":{\"id\":\"formula_4\"},\"end\":30114,\"start\":30077},{\"attributes\":{\"id\":\"formula_6\"},\"end\":34580,\"start\":34564},{\"attributes\":{\"id\":\"formula_7\"},\"end\":39922,\"start\":39901},{\"attributes\":{\"id\":\"formula_8\"},\"end\":45065,\"start\":44947},{\"attributes\":{\"id\":\"formula_9\"},\"end\":45304,\"start\":45267},{\"attributes\":{\"id\":\"formula_10\"},\"end\":45597,\"start\":45455},{\"attributes\":{\"id\":\"formula_11\"},\"end\":48991,\"start\":48967}]", "table_ref": null, "section_header": "[{\"attributes\":{\"n\":\"1\"},\"end\":3944,\"start\":3932},{\"attributes\":{\"n\":\"2\"},\"end\":8549,\"start\":8537},{\"attributes\":{\"n\":\"3\"},\"end\":13199,\"start\":13174},{\"attributes\":{\"n\":\"3.1\"},\"end\":13657,\"start\":13645},{\"attributes\":{\"n\":\"3.2\"},\"end\":16662,\"start\":16648},{\"attributes\":{\"n\":\"3.3\"},\"end\":17669,\"start\":17660},{\"attributes\":{\"n\":\"4\"},\"end\":18577,\"start\":18566},{\"end\":19105,\"start\":19064},{\"attributes\":{\"n\":\"4.2\"},\"end\":22762,\"start\":22737},{\"attributes\":{\"n\":\"4.2.1\"},\"end\":23212,\"start\":23164},{\"attributes\":{\"n\":\"4.2.2\"},\"end\":24966,\"start\":24934},{\"attributes\":{\"n\":\"4.2.3\"},\"end\":28925,\"start\":28906},{\"attributes\":{\"n\":\"5\"},\"end\":30388,\"start\":30378},{\"end\":31407,\"start\":31392},{\"end\":32539,\"start\":32515},{\"end\":35313,\"start\":35284},{\"end\":36340,\"start\":36318},{\"end\":38205,\"start\":38175},{\"end\":38714,\"start\":38683},{\"end\":39830,\"start\":39794},{\"end\":42602,\"start\":42587},{\"end\":44516,\"start\":44501},{\"end\":44827,\"start\":44806},{\"end\":46036,\"start\":46009},{\"end\":48321,\"start\":48301},{\"end\":49329,\"start\":49295},{\"end\":51970,\"start\":51960},{\"end\":52186,\"start\":52164},{\"end\":52394,\"start\":52384},{\"end\":52423,\"start\":52413},{\"end\":52942,\"start\":52931},{\"end\":53251,\"start\":53240},{\"end\":54038,\"start\":54026},{\"end\":54251,\"start\":54240},{\"end\":54335,\"start\":54331},{\"end\":54435,\"start\":54424},{\"end\":54514,\"start\":54503},{\"end\":54756,\"start\":54747}]", "table": "[{\"end\":55177,\"start\":54894},{\"end\":57547,\"start\":56076}]", "figure_caption": "[{\"end\":51958,\"start\":51849},{\"end\":52162,\"start\":51972},{\"end\":52382,\"start\":52189},{\"end\":52411,\"start\":52396},{\"end\":52823,\"start\":52425},{\"end\":52929,\"start\":52826},{\"end\":53056,\"start\":52945},{\"end\":53238,\"start\":53059},{\"end\":53506,\"start\":53254},{\"end\":54024,\"start\":53509},{\"end\":54238,\"start\":54041},{\"end\":54329,\"start\":54254},{\"end\":54422,\"start\":54337},{\"end\":54501,\"start\":54438},{\"end\":54745,\"start\":54517},{\"end\":54889,\"start\":54759},{\"end\":54894,\"start\":54892},{\"end\":56076,\"start\":55180}]", "figure_ref": "[{\"end\":7552,\"start\":7544},{\"end\":11955,\"start\":11947},{\"end\":18548,\"start\":18543},{\"attributes\":{\"ref_id\":\"fig_1\"},\"end\":19415,\"start\":19406},{\"end\":19790,\"start\":19782},{\"end\":20118,\"start\":20110},{\"attributes\":{\"ref_id\":\"fig_1\"},\"end\":20805,\"start\":20797},{\"end\":20923,\"start\":20916},{\"attributes\":{\"ref_id\":\"fig_1\"},\"end\":21517,\"start\":21508},{\"end\":24578,\"start\":24570},{\"attributes\":{\"ref_id\":\"fig_3\"},\"end\":26144,\"start\":26136},{\"end\":26732,\"start\":26724},{\"end\":28441,\"start\":28433},{\"attributes\":{\"ref_id\":\"fig_4\"},\"end\":30202,\"start\":30194},{\"attributes\":{\"ref_id\":\"fig_6\"},\"end\":33884,\"start\":33875},{\"attributes\":{\"ref_id\":\"fig_6\"},\"end\":34147,\"start\":34137},{\"attributes\":{\"ref_id\":\"fig_6\"},\"end\":35593,\"start\":35584},{\"attributes\":{\"ref_id\":\"fig_8\"},\"end\":35899,\"start\":35890},{\"attributes\":{\"ref_id\":\"fig_8\"},\"end\":36313,\"start\":36303},{\"attributes\":{\"ref_id\":\"fig_1\"},\"end\":37171,\"start\":37156},{\"attributes\":{\"ref_id\":\"fig_3\"},\"end\":38257,\"start\":38249},{\"attributes\":{\"ref_id\":\"fig_1\"},\"end\":38749,\"start\":38740},{\"attributes\":{\"ref_id\":\"fig_1\"},\"end\":39297,\"start\":39288},{\"end\":39470,\"start\":39461},{\"attributes\":{\"ref_id\":\"fig_1\"},\"end\":39512,\"start\":39504},{\"attributes\":{\"ref_id\":\"fig_1\"},\"end\":39684,\"start\":39676},{\"end\":39714,\"start\":39705},{\"end\":40613,\"start\":40604},{\"end\":41226,\"start\":41217},{\"end\":42846,\"start\":42838},{\"attributes\":{\"ref_id\":\"fig_3\"},\"end\":43600,\"start\":43591},{\"attributes\":{\"ref_id\":\"fig_1\"},\"end\":43931,\"start\":43907},{\"attributes\":{\"ref_id\":\"fig_3\"},\"end\":44168,\"start\":44159},{\"end\":45713,\"start\":45704},{\"end\":46447,\"start\":46438},{\"attributes\":{\"ref_id\":\"fig_10\"},\"end\":47331,\"start\":47322},{\"attributes\":{\"ref_id\":\"fig_10\"},\"end\":47431,\"start\":47421},{\"attributes\":{\"ref_id\":\"fig_10\"},\"end\":47816,\"start\":47806},{\"attributes\":{\"ref_id\":\"fig_1\"},\"end\":50588,\"start\":50579}]", "bib_author_first_name": "[{\"end\":58114,\"start\":58108},{\"end\":58131,\"start\":58123},{\"end\":58146,\"start\":58141},{\"end\":58161,\"start\":58155},{\"end\":58469,\"start\":58464},{\"end\":58483,\"start\":58478},{\"end\":58753,\"start\":58743},{\"end\":58765,\"start\":58761},{\"end\":58777,\"start\":58772},{\"end\":58999,\"start\":58993},{\"end\":59020,\"start\":59009},{\"end\":59313,\"start\":59309},{\"end\":59331,\"start\":59325},{\"end\":59349,\"start\":59344},{\"end\":59364,\"start\":59361},{\"end\":59378,\"start\":59373},{\"end\":59391,\"start\":59387},{\"end\":59680,\"start\":59679},{\"end\":59870,\"start\":59866},{\"end\":59886,\"start\":59881},{\"end\":59901,\"start\":59895},{\"end\":59919,\"start\":59914},{\"end\":59935,\"start\":59931},{\"end\":59949,\"start\":59946},{\"end\":59964,\"start\":59956},{\"end\":60235,\"start\":60232},{\"end\":60258,\"start\":60255},{\"end\":60272,\"start\":60266},{\"end\":60285,\"start\":60280},{\"end\":60299,\"start\":60294}]", "bib_author_last_name": "[{\"end\":58121,\"start\":58115},{\"end\":58139,\"start\":58132},{\"end\":58153,\"start\":58147},{\"end\":58168,\"start\":58162},{\"end\":58476,\"start\":58470},{\"end\":58490,\"start\":58484},{\"end\":58759,\"start\":58754},{\"end\":58770,\"start\":58766},{\"end\":58784,\"start\":58778},{\"end\":59007,\"start\":59000},{\"end\":59028,\"start\":59021},{\"end\":59323,\"start\":59314},{\"end\":59342,\"start\":59332},{\"end\":59359,\"start\":59350},{\"end\":59371,\"start\":59365},{\"end\":59385,\"start\":59379},{\"end\":59397,\"start\":59392},{\"end\":59692,\"start\":59681},{\"end\":59700,\"start\":59694},{\"end\":59879,\"start\":59871},{\"end\":59893,\"start\":59887},{\"end\":59912,\"start\":59902},{\"end\":59929,\"start\":59920},{\"end\":59944,\"start\":59936},{\"end\":59954,\"start\":59950},{\"end\":59972,\"start\":59965},{\"end\":60253,\"start\":60236},{\"end\":60264,\"start\":60259},{\"end\":60278,\"start\":60273},{\"end\":60292,\"start\":60286},{\"end\":60304,\"start\":60300},{\"end\":60312,\"start\":60306}]", "bib_entry": "[{\"attributes\":{\"id\":\"b0\"},\"end\":58392,\"start\":58045},{\"attributes\":{\"id\":\"b1\",\"matched_paper_id\":14633080},\"end\":58709,\"start\":58394},{\"attributes\":{\"id\":\"b2\",\"matched_paper_id\":6627476},\"end\":58900,\"start\":58711},{\"attributes\":{\"id\":\"b3\",\"matched_paper_id\":7902132},\"end\":59248,\"start\":58902},{\"attributes\":{\"id\":\"b4\",\"matched_paper_id\":8310565},\"end\":59677,\"start\":59250},{\"attributes\":{\"id\":\"b5\"},\"end\":59862,\"start\":59679},{\"attributes\":{\"doi\":\"arXiv:1606.01540\",\"id\":\"b6\"},\"end\":60178,\"start\":59864},{\"attributes\":{\"id\":\"b7\",\"matched_paper_id\":4787508},\"end\":60577,\"start\":60180}]", "bib_title": "[{\"end\":58106,\"start\":58045},{\"end\":58462,\"start\":58394},{\"end\":58741,\"start\":58711},{\"end\":58991,\"start\":58902},{\"end\":59307,\"start\":59250},{\"end\":60230,\"start\":60180}]", "bib_author": "[{\"end\":58123,\"start\":58108},{\"end\":58141,\"start\":58123},{\"end\":58155,\"start\":58141},{\"end\":58170,\"start\":58155},{\"end\":58478,\"start\":58464},{\"end\":58492,\"start\":58478},{\"end\":58761,\"start\":58743},{\"end\":58772,\"start\":58761},{\"end\":58786,\"start\":58772},{\"end\":59009,\"start\":58993},{\"end\":59030,\"start\":59009},{\"end\":59325,\"start\":59309},{\"end\":59344,\"start\":59325},{\"end\":59361,\"start\":59344},{\"end\":59373,\"start\":59361},{\"end\":59387,\"start\":59373},{\"end\":59399,\"start\":59387},{\"end\":59694,\"start\":59679},{\"end\":59702,\"start\":59694},{\"end\":59881,\"start\":59866},{\"end\":59895,\"start\":59881},{\"end\":59914,\"start\":59895},{\"end\":59931,\"start\":59914},{\"end\":59946,\"start\":59931},{\"end\":59956,\"start\":59946},{\"end\":59974,\"start\":59956},{\"end\":60255,\"start\":60232},{\"end\":60266,\"start\":60255},{\"end\":60280,\"start\":60266},{\"end\":60294,\"start\":60280},{\"end\":60306,\"start\":60294},{\"end\":60314,\"start\":60306}]", "bib_venue": "[{\"end\":58212,\"start\":58170},{\"end\":58541,\"start\":58492},{\"end\":58790,\"start\":58786},{\"end\":59061,\"start\":59030},{\"end\":59448,\"start\":59399},{\"end\":59742,\"start\":59702},{\"end\":60363,\"start\":60314},{\"end\":59752,\"start\":59744}]"}}}, "year": 2023, "month": 12, "day": 17}