{"id": 3531854, "updated": "2023-10-27 18:18:05.812", "metadata": {"title": "Decoding the auditory brain with canonical component analysis", "authors": "[{\"first\":\"Alain\",\"last\":\"de Cheveigné\",\"middle\":[]},{\"first\":\"Daniel\",\"last\":\"Wong\",\"middle\":[\"D.E.\"]},{\"first\":\"Giovanni\",\"last\":\"Di Liberto\",\"middle\":[\"M.\"]},{\"first\":\"Jens\",\"last\":\"Hjortkjær\",\"middle\":[]},{\"first\":\"Malcolm\",\"last\":\"Slaney\",\"middle\":[]},{\"first\":\"Edmund\",\"last\":\"Lalor\",\"middle\":[]}]", "venue": null, "journal": "Neuroimage", "publication_date": {"year": 2018, "month": null, "day": null}, "abstract": "&NA; The relation between a stimulus and the evoked brain response can shed light on perceptual processes within the brain. Signals derived from this relation can also be harnessed to control external devices for Brain Computer Interface (BCI) applications. While the classic event‐related potential (ERP) is appropriate for isolated stimuli, more sophisticated “decoding” strategies are needed to address continuous stimuli such as speech, music or environmental sounds. Here we describe an approach based on Canonical Correlation Analysis (CCA) that finds the optimal transform to apply to both the stimulus and the response to reveal correlations between the two. Compared to prior methods based on forward or backward models for stimulus‐response mapping, CCA finds significantly higher correlation scores, thus providing increased sensitivity to relatively small effects, and supports classifier schemes that yield higher classification scores. CCA strips the brain response of variance unrelated to the stimulus, and the stimulus representation of variance that does not affect the response, and thus improves observations of the relation between stimulus and response. HighlightsCCA is a powerful, easy to use method for multichannel data analysis.CCA finds an optimal linear model to relate stimulus and brain response.Multiple speech components map to distinct spectro‐spatial signatures.CCA yields large stimulus‐response correlation values.CCA supports good performance in a classification task.", "fields_of_study": "[\"Medicine\"]", "external_ids": {"arxiv": null, "mag": "2952838147", "acl": null, "pubmed": "29378317", "pubmedcentral": null, "dblp": "journals/neuroimage/CheveigneWLHSL18", "doi": "10.1016/j.neuroimage.2018.01.033"}}, "content": {"source": {"pdf_hash": "4ce36e79fa79e4dc6799289ab436718bb0d34f3e", "pdf_src": "WoltersKluwer", "pdf_uri": null, "oa_url_match": false, "oa_info": {"license": "CCBYNCND", "open_access_url": "https://doi.org/10.1016/j.neuroimage.2018.01.033", "status": "HYBRID"}}, "grobid": {"id": "6f0c8744f2e9c6e42d6092393cff180345adfc96", "type": "plain-text", "url": "s3://ai2-s2-pdf-extraction-prod/parse-results/s2orc_worker/4ce36e79fa79e4dc6799289ab436718bb0d34f3e.txt", "contents": "\nDecoding the auditory brain with canonical component analysis\n\n\nAlain De Cheveign \nLaboratoire des Syst emes Perceptifs\nUMR 8248\nCNRS\nFrance\n\nD epartement d'Etudes Cognitives\nEcole Normale Sup erieure\nFrance\n\nUCL Ear Institute\nUnited Kingdom\n\nDanish Research Centre for Magnetic Resonance\nCentre for Functional and Diagnostic Imaging and Research\nCopenhagen University Hospital Hvidovre\nKettegaard All e 302650HvidovreDenmark\n\nDaniel D E Wong \nLaboratoire des Syst emes Perceptifs\nUMR 8248\nCNRS\nFrance\n\nD epartement d'Etudes Cognitives\nEcole Normale Sup erieure\nFrance\n\nGiovanni M Di Liberto \nLaboratoire des Syst emes Perceptifs\nUMR 8248\nCNRS\nFrance\n\nD epartement d'Etudes Cognitives\nEcole Normale Sup erieure\nFrance\n\nJens Hjortkjaer \nDepartment of Electrical Engineering\nHearing Systems Group\nTechnical University of Denmark\nØrsteds Plads, Building 3522800Kgs. LyngbyDenmark\n\nDanish Research Centre for Magnetic Resonance\nCentre for Functional and Diagnostic Imaging and Research\nCopenhagen University Hospital Hvidovre\nKettegaard All e 302650HvidovreDenmark\n\nMalcolm Slaney \nGoogle AI for Perception\nUnited States\n\nEdmund Lalor \nDepartment of Biomedical Engineering\nUniversity of Rochester\nRochesterNYUnited States\n\nDepartment of Neuroscience\nUniversity of Rochester\nRochesterNYUnited States\n\nSchool of Engineering\nTrinity Centre for Bioengineering and Trinity College Institute of Neuroscience\nTrinity College Dublin\nDublin, ParisIreland, France\n\nDecoding the auditory brain with canonical component analysis\n10.1016/j.neuroimage.2018.01.033A R T I C L E I N F O\nThe relation between a stimulus and the evoked brain response can shed light on perceptual processes within the brain. Signals derived from this relation can also be harnessed to control external devices for Brain Computer Interface (BCI) applications. While the classic event-related potential (ERP) is appropriate for isolated stimuli, more sophisticated \"decoding\" strategies are needed to address continuous stimuli such as speech, music or environmental sounds. Here we describe an approach based on Canonical Correlation Analysis (CCA) that finds the optimal transform to apply to both the stimulus and the response to reveal correlations between the two. Compared to prior methods based on forward or backward models for stimulus-response mapping, CCA finds significantly higher correlation scores, thus providing increased sensitivity to relatively small effects, and supports classifier schemes that yield higher classification scores. CCA strips the brain response of variance unrelated to the stimulus, and the stimulus representation of variance that does not affect the response, and thus improves observations of the relation between stimulus and response.\n\nIntroduction\n\nCommon techniques to measure brain activity include electroencephalography (EEG), magnetoencephalography (MEG), electrocorticography (ECoG), and functional magnetic resonance imaging (fMRI). Paired with controlled sensory stimulation, such techniques allow sensory and perceptual processes to be probed. In the case of EEG and MEG, one common approach has been to examine how the time course of brain potentials/fields is affected by particular stimuli. However, stimuli usually need to be repeated several times, and the recorded signals averaged to overcome the many sources of noise and brain activity unrelated to the stimulation. This is practical only for short stimuli or isolated events, and precludes the study of responses to longer and more naturalistic stimuli such as speech, music, or environmental sound. Recently, new approaches based on system identification allow meaningful response functions to be derived from ongoing stimulation.\n\nA short event such as a click or sound onset produces a stereotyped EEG/MEG response, with peaks and troughs that are referred to by conventional names (N100, P300, etc.). Their morphology, timing and dependency on experimental conditions have yielded a wealth of information about perceptual processes (Woodman, 2010). Activity related to ongoing stimulation is harder to interpret because responses to each individual event overlap in time, and the lack of repetition precludes simple averaging over trials. Nonetheless, supposing that the system is linear and time-invariant, the relation between stimulus and response can be described as a convolution, and characterized by an impulse response or temporal response function (TRF) that can be estimated from the stimulus and response pair by systems identification techniques (Lalor et al., 2009;Crosse et al., 2016).\n\nThis linear model can be estimated and evaluated in either of two ways. In the first (\"forward model\") the model is used to predict the neural response from the stimulus, and the prediction is compared to the actual measurement. In the second (\"backward model\", or \"stimulus reconstruction\"), the model is used to infer the stimulus from the response, and the inferred stimulus is compared to the actual stimulus. The quality of fit may be quantified in terms of correlation coefficient, and results cross-validated by measuring the correlation on data distinct from the data that served to train the model. The model can also be used to design a classifier, and its quality quantified by percentage correct classification, or area under the Receiver Operating Curve (ROC).\n\nWith either approach correlation scores are usually modest (on the order of r ¼ 0.1-0.2 for EEG data) albeit statistically significant. Such low scores are sobering, but they should not come as a surprise. EEG signals reflect many brain processes in addition to those related to sensory processing, and thus only a fraction of EEG variance can be predicted from the stimulus (Woodman, 2010). Conversely, certain features of the stimulus may have little or no impact on the percept or brain activity evoked. Low correlation scores thus reflect the fact that the EEG and the stimulus each include variance that is irrelevant to the perceptual process.\n\nIn this paper we explore a third approach: transform both stimulus and response so as to minimize irrelevant variance, and evaluate the quality of the model by measuring the correlation after each data set has been transformed. This allows the stimulus representation to be stripped of dimensions irrelevant for measurable brain responses, and the EEG to be stripped of activity unrelated to auditory perception. The method we use is based on canonical correlation analysis (CCA) (Hotelling, 1936). Given two sets of data (here stimulus and EEG), CCA finds the best linear transform W 1 to apply to the first to maximize its projection on the second, and the best linear transform W 2 to apply to the second to maximize its projection on the first. CCA is a linear technique, but it can be extended to characterize non-linear and convolutional relations by including appropriate transforms of the data before applying CCA (see Discussion).\n\n\nMethods\n\n\nEEG/MEG data model\n\nElectrical activity within the brain is picked up by electrodes on the skull (EEG) or magnetometers (MEG) surrounding the head. The sourceto-sensor relation is assumed linear: the J measured brain signals b j ðtÞ at T time steps, forming a matrix of dimensions T Â J, are linearly related to the activities of I sources s i ðtÞ within the brain:\nb j ðtÞ ¼ X i s i ðtÞm ij ;(1)\nwhere t is time and the m ij are unknown source-to-sensor mixing weights. In matrix notation B ¼ SU. The sources include both brain sources sensitive to sensory stimulation, and \"noise\" sources unrelated to stimulation. A role of data processing is to minimize the noise relative to the activity of interest.\n\n\nAcoustic data model\n\nAn auditory stimulus consists of a pressure waveform pðtÞ, or p L ðtÞ and p R ðtÞ if the ears are independently stimulated, that is transduced and processed within the auditory system (cochlear filtering, haircell transduction, neural processing, etc.). To more easily relate the rapidlyvarying sound signal to the slower brain signals measured by EEG, the pressure waveform pðtÞ must be transformed to a slower-varying representation aðtÞ. Standard transforms (or \"sound descriptors\") include the temporal envelope obtained by smoothing the instantaneous power p 2 ðtÞ or the absolute value of the analytical signal obtained by the Hilbert transform, and the spectrogram obtained as a time series of short-term Fourier transform coefficients or of demodulated filterbank outputs mimicking the frequency selectivity found at multiple stages in the auditory system (\"auditory spectrogram\"). For convenience, the acoustic representation is usually resampled to the same sampling rate as the EEG. It is well known that the same percept can arise from different stimuli (metamers) (Zaidi et al., 2013), and a yet larger set of stimuli may trigger EEG responses that are indistinguishable. A desirable feature of an EEG-relevant stimulus descriptor is to discard dimensions of the data that are not relevant to predict the response.\n\n\nProcessing model\n\nThere are many linear processing techniques that may be used to enhance relevant components of EEG and acoustic representations. EEG sources responsive to sound may be enhanced in three ways: (1) by spatial filtering\nbðtÞ ¼ X j b j ðtÞu j ;(2)\n(2) by spectral filtering implemented as a finite impulse response (FIR) filter\nb j ðtÞ ¼ X τ b j ðt À τÞu τ ;\n(3) or (3) by a combination of the two implemented as a multichannel FIR filter\nbðtÞ ¼ X j X τ b j ðt À τÞu jτ ;(4)\nwhere bðtÞ is a linear combination of time-lagged brain signals. Spatial filtering allows unwanted sources to be suppressed based on the correlation structure between channels, whereas spectral filtering allows them to be attenuated based on their rate of fluctuation. The multichannel FIR filter of Eq. (4) subsumes both, as well as more complex \"spatio-spectral\" filters, for example for which different spectral filtering affects different spatial components. The acoustic representation can likewise be enhanced with a FIR filter (for the stimulus envelope) or multichannel FIR filter (for a multichannel representation such as a spectrogram)\naðtÞ ¼ X i X τ a i ðt À τÞv iτ ;(5)\nwhere aðtÞ is a linear combination of time-lagged audio descriptor signals. A FIR filter applied to the audio envelope or a channel of a spectrogram might select components based on their modulation spectrum, whereas the multichannel FIR applied to a spectrogram also captures more complex cross-spectral structure. These linear models allow great flexibility to optimize the relation between audio and EEG. However, the question remains as to how to find the appropriate coefficients u jτ and v iτ to apply to the EEG and audio signals respectively to maximize the correlation between the two.\n\n\nCanonical correlation analysis\n\nGiven two sets of multichannel data, CCA finds linear transforms of both that are maximally correlated. Given data matrices X 1 of size T Â J 1 and X 2 of size T Â J 2 , CCA produces transform matrices W 1 and W 2 of sizes J 1 Â J 0 and J 2 Â J 0 , where J 0 is at most equal to the smaller of J 1 and J 2 . The columns of X 1 W 1 are mutually uncorrelated, as are the columns of X 2 W 2 , while pairs of columns taken from both (\"canonical correlate pairs\") are maximally correlated. The first pair of canonical correlates (CC) define the linear combinations of each data set with the highest possible correlation. The next pair of CCs are the most highly correlated combinations orthogonal to the first, and so-on. Assuming that X 1 and X 2 represent audio and EEG signals, possibly with time lags, CCA will pro-duce weighted sums as in Eqs. (4) and (5) that are maximally correlated, which is exactly what we are looking for.\n\n\nDimensionality and overfitting\n\nReasoning in terms of vector spaces, the J EEG signals span a space of dimension J (at most) that contains all of their linear combinations. If T time lags are applied to those signals (as in Eqs. (4) and (5)), the resulting space is of dimension JT at most. Likewise, a spectrogram descriptor with J' bands spans a signal space of dimension of at most J', or J'T ' if T ' time lags are applied. The weighted sums produced by CCA belong to these vector spaces. For each CC pair, the data-driven CCA process needs to find as many weights as the number of dimensions of the signal spaces (JT þ J'T ' in this example). The number of dimensions is important because it determines the risk of overfitting in the data-driven calculation. Overfitting occurs when there are too many parameters relative to the amount of data and the algorithm latches on to spurious features.\n\nThere is a tradeoff between flexibility and overfitting: increasing the number of EEG channels and/or filter taps increases the ability to fit the data and resolve interesting sources and features, but this comes with a greater risk of misleading results.\n\nOur strategy with respect to overfitting is twofold. First, the outcome of any analysis can be tested for overfitting by applying cross-validation. Second, overfitting itself can be limited by dimensionality reduction or regularization techniques, which are closely related (Jiang and Guo, 2007). Dimensionality reduction can be obtained by applying principal component analysis (PCA) and discarding principal components (PCs) with smallest variance. However this procedure implicitly equates variance to relevance, which may not always be appropriate (EEG artifacts and noise components often have high variance). Alternative approaches are considered in the Discussion.\n\n\nFilter bases\n\nThe processing model (Eqs. (4) and (5)) allows for FIR filters of order T to equalize EEG and audio signals and attenuate irrelevant power. A larger T captures temporal structure (of target and/or interference) on a longer-term scale, but there are more parameters and greater risk of overfitting. An alternative is to replace the set of time lags by a set of T fixed filters with impulse responses of duration longer than T , for example a logarithmic (or wavelet) filterbank. Again, it is useful to reason in terms of a vector space: T time lags span the space of FIR filters of order T , subspace of the space of all filters, whereas a T -channel filterbank spans a different subspace with the same dimension, distinct from the first and including filters with different properties (in particular longer impulse responses). The number of parameters in either case is the same, but one subspace may better fit the requirements than the other. Tailoring the convolutional basis in this way is akin to parameter tying within a space of higher-order filters (LeCun et al., 2015). Whichever basis is chosen, CCA finds optimal coefficients on that basis.\n\n\nThe quadratic trick\n\nCCA can be made to handle nonlinear relations between data sets by replacing the data (or augmenting them) with a set of nonlinear transforms. A class of nonlinearity that deserves particular mention is quadratic forms. The rationale for considering this is the following. Suppose that there exists a source within the brain that displays a useful pattern of power (for example its power is correlated with the stimulus), but that source is weak and can only be observed after applying a spatial filter with coefficients u j . The values of these coefficients are unknown. However we note that the expression for the instantaneous power of the spatially filtered signal:\nsðtÞ 2 ¼ X j b j ðtÞu j ! 2(6)\ncan be expanded as:\nsðtÞ 2 ¼ X jj' b j ðtÞb j' ðtÞv jj' :(7)\nThis expression is linear in the cross products b j ðtÞb j' ðtÞ, and thus we can apply linear techniques such as CCA to find a set of v jj' that maximize the correlation between the stimulus and the space of cross-products, from which we may derive an approximation of the optimal weights u j (de Cheveign e, 2012). This technique is equally applicable to spectral (FIR) filtering as to spatial filtering.\n\n\nImplementation\n\nProcessing is done in MATLAB using routines from the NoiseTools toolbox (http://audition.ens.fr/adc/NoiseTools/). Time lags and other transforms lead to large data matrices, and care must be given to computational constraints. The main ingredient used by the algorithms is the covariance matrix of the joint data set (½X 1 ; X 2 '*½X 1 ; X 2 ) which can be calculated incrementally from subsets of the data, without loading all of the data into in memory. The main computational bottleneck is eigendecomposition of the covariance matrix (MATLAB 'eig' function) with a cost that varies as Oðn 3 Þ where n is the total number of columns.\n\n\nEvaluation\n\nWe implement several models, and evaluate each to determine the benefit of using CCA relative to other techniques. Model performance is quantified by calculating the correlation coefficient between stimulusderived and EEG-derived quantities according to a cross-validation procedure. In brief, the model parameters are estimated using a subset of the data, and the correlation score is measured on the remaining data. This is repeated, leaving out different parts of the data in turn, and the final score is calculated as the mean of these estimates. When comparing models we take care to use the same number of parameters.\n\nAuditory processing involves response latencies that are not perfectly known, and the convolutional transforms produced by CCA also contribute delays. In order to compensate for eventual differences in Fig. 1. Overview of the models tested. In the forward model, the audio envelope is transformed and compared with the EEG. In the backward model, the EEG is transformed and compared with the audio envelope. In CCA model 1, a FIR filter is applied to the audio envelope and a spatial filter to the EEG. In CCA model 2, the spatial filter is replaced by a multichannel FIR filter. In CCA model 3, FIR filters are implemented using a bank of filters F k instead of delays. temporal alignment between stimulus and EEG, the entire process (model parameter estimation and correlation evaluation) is repeated for various time shifts L of the audio relative to the EEG. The optimal shift is determined from the peak of the correlation as a function of shift (see Figs. 1-3). This ensures an optimal temporal alignment for every model. This overall time shift L is distinct from the filter time lags τ that appear in some of the models (e.g. Eqs. (4) and (5)).\n\nThe decision to introduce a global time shift L distinct from τ was motivated by the desire to capture the effect of audio-to-EEG latency (fit by L) separately from that of spectral mismatch (fit by coefficients of aðt À τÞ or bðt À τÞ, τ ¼ 1…T ). The alternative of a wider range of τ to absorb latency would have entailed a larger number of parameters, and made it harder to make a fair comparison with models that don't involve τ (e.g. Eq. (4)). Introducing the parameter L allows each model to operate in optimal conditions. Models are also evaluated by designing a classifier for a simple matchvs-mismatch classification task that involves deciding which of two segments of audio gave rise to a particular segment of EEG data of duration D. Segment duration is varied as a parameter, shorter durations being harder to classify because they contain less discriminative information. Again, cross-validation is used to control for overfitting: the classifier is trained on a subset of the data, and the classification score measured on unseen data. The classifier is trained and tested using the time shift L that maximized correlation.\n\n\nEvaluation data\n\nThe algorithms are evaluated using a database of EEG responses to natural speech reported in a previous study (Di Liberto et al., 2015). Full details of the stimulus and recording conditions are given in that reference. In brief, EEG data were recorded from 8 subjects using a 128-channel Biosemi system with standard electrode layout, at 512 Hz sampling rate (data from 2 additional subjects recorded with a 160-channel system were not used). Each subject listened to 32 speech excerpts, each of duration approximately 155s from an audio book presented diotically via headphones, for a total of approximately 1.4 h. The EEG data were downsampled to 64 Hz and detrended by subtracting a 10th-order polynomial fit weighted to exclude outliers using a robust detrending routine (de Cheveign e and Arzounian, 2018). The STAR algorithm (de Cheveign e, 2016) was used to suppress channel-specific noise, and the data were convolved with a boxcar window of duration 20 ms to suppress 50 Hz and harmonics. The data were then high-pass filtered with a Butterworth filter of order 2 and cutoff 0.1 Hz and rereferenced to the mean over channels. To calculate the stimulus' temporal envelope, the stimulus (sampled at 44,100 Hz) was squared, smoothed by convolution with a square window of width 15.6 ms (1/64 Hz), downsampled to 64 Hz, and then raised to the power 1/3.\n\n\nModels tested\n\nTo allow comparisons, we implemented backward and forward models, and three versions of the CCA model as schematized in Fig. 1.\n\nIn the backward model the stimulus representation aðtÞ is inferred or \"reconstructed\" as a transform bðtÞ of the EEG, for example a spatial filter: Fig. 2. Backward model. Left: correlation score between the speech temporal envelope and the best linear combination of EEG, as a function of the overall temporal shift L of the stimulus relative to the EEG, for one subject (EL). A positive value of the abscissa means that the envelope has been delayed relative to the EEG. Dotted line is measured on the training set, full line on the test set. Right: spatial topography of the correlation between EEG and envelope at the optimal shift. Fig. 3. Forward model. Left: cross-validated correlation score between the FIR-filtered stimulus temporal envelope and the best EEG channel as a function of the overall temporal shift L of the stimulus relative to the EEG, for one subject (EL). Right: impulse response (top) and corresponding amplitude transfer function (bottom).\nbðtÞ ¼ X j b j ðt þ LÞu j ;(8)\nor spatiotemporal filter:\nbðtÞ ¼ X j X τ b jτ ðt À τ þ LÞu j ;(9)\nwhere the weights u j are calculated as the cross-correlation between the audio and time-lagged EEG. This model was simulated based on Eq. (8) (spatial filter). The 128 EEG channels were first submitted to PCA and the first 80 PCs retained, so the model had 80 parameters. The overall time shift L was varied over a range from À3 to þ7 s, to find the highest correlation coefficient between aðtÞ and bðtÞ. A variant of the model was simulated based on Eq. (8) (spatiotemporal filter) with 17 time lags, again with PCA to reduce the number of parameters to 80 (see Results). In the forward model the response of a brain signal channel b j ðtÞ is predicted from a transform aðtÞ of the stimulus, for example a weighted sum of time-lagged stimulus envelope samples (FIR filter):\naðtÞ ¼ X τ aðt À τ þ LÞv τ ;(10)\nwhere the time shift L absorbs any temporal misalignment between stimulus and EEG. To give this model the best chances to succeed, the prediction was applied to the optimal linear combination of channels found by the backward model, rather than to a particular brain signal channel. The model was applied with 80 values of the delay τ (spanning 0-1.25 s), so this model too has 80 parameters.\n\nIn CCA model 1, both the stimulus and the EEG are transformed according to:\nbðtÞ ¼ X k bðtÞu k ; aðtÞ ¼ X τ aðt À τ þ LÞv τ ;(11)\nwhere the shift L is varied to absorb any mismatch in response or processing latency. CCA was applied to a set of 40 time lagged envelope signals and a set of 40 principal components of the EEG, producing 40 canonical correlate pairs. This model too has 80 parameters.\n\nIn CCA model 2, time lags are applied also to the EEG channels:\nbðtÞ ¼ X k X τ bðt À τÞu kτ ; aðtÞ ¼ X τ aðt À τ þ LÞv τ :(12)\nThe EEG was submitted to PCA and the first 60 PCs were selected and submitted to 10 time lags. The compound matrix (600 channels) was submitted to PCA and 40 PCs retained, while the stimulus envelope was split into 40 time-lagged versions. This model too has 80 parameters. In a variant of this model (model 2þ), 80 PCs were retained for both EEG and audio, so the model had 160 parameters.\n\nIn CCA model 3, time lags are replaced by a filter bank, motivated as follows. The stimulus envelope and EEG both include long-term fluctuations on the order of seconds. For example, these could reflect slow patterns shared by stimulus and response (e.g. phrase or semantic structure), or else slow artifacts that need to be removed. To resolve them requires filters with a long impulse response which, if implemented as a FIR, would require a filter of high order and thus many parameters leading to overfitting. For example, at 64 Hz sampling rate a two-second impulse response requires 128 taps, which applied separately to 50 EEG PCs (multichannel FIR) involves 6400 parameters. To address this issue, one can use a set of filterbank output channels as a \"basis\" for the space of filters, instead of time lags. For a T -channel filterbank the number of parameters is the same as for T time lags, but the filter subspace spanned is different. With a logarithmic or wavelet filterbank the basis can include both narrow filters with long impulse response, and wider filters with shorter impulse response. CCA model 3 was tested with a dyadic bank of FIR bandpass filters with characteristics (center frequency, bandwidth, duration of impulse response) approximately uniformly distributed on a logarithmic scale. There was a total of 21 channels with impulse response durations ranging from 2 to 128 samples (2 s). The filterbank was applied to the stimulus envelope, yielding 21 filtered signals, and also to the EEG represented by 60 PCs, yielding 1260 filtered signals that were submitted to another PCA from which 139 PCs were retained. These two data sets (21 and 139 channels respectively) were then processed by CCA. Like the previous model (CCA model 2þ), this model has 160 parameters. The numbers chosen for this and previous models are largely arbitrary, the aim being to put the models in a range where they perform reasonably well, and allow comparisons between models with the same number of parameters.\n\nMatch-vs-mismatch classification was performed using Linear Discriminant Analysis (LDA) trained on the model correlation scores. The ability of each model to identify matching EEG and audio segments was assessed using leave-one-out cross-validation. The classifier was trained on all time segments from 31 of the 32 trials and tested on all segments in the remaining trial. To examine classification accuracy as a function of test data duration, we performed the classification with time segments of duration 1-64 s. This provided between 4960 (for 1 s segments) and 64 (for 60 s segments) non-overlapping tokens for classification.\n\n\nResults\n\nThis section compares the performance of the different approaches described in Sect. 2, and investigates how the multiple canonical correlate pairs revealed by CCA can be used for classification.\n\n\nComparison between models\n\nIn the paragraphs to follow, we compare forward and backward models with CCA, using correlation as a performance metric. Fig. 2 (left, full line) shows the correlation coefficient between the spatially filtered EEG and the speech temporal envelope, with crossvalidation, as a function of the shift L, for one subject. The correlation coefficient is large for values of L near zero and falls for larger positive or negative values. The dotted line shows the coefficient without crossvalidation. Plots in all other figures represent cross-validated correlation coefficients. Fig. 2 (right) shows the spatial distribution over the scalp of the correlation coefficient between stimulus envelope and individual EEG channels. Coefficients for individual channels approach 0.09, whereas the linear combination (Eq. (8)) yields a score of~0.13, reflecting the benefit of the spatial filtering.\n\n\nBackward model\n\nOther studies, e.g. (O'Sullivan et al., 2014), used a model similar to Eq. (9) in which the stimulus is modeled as a weighted sum of time-lagged EEG channels. We simulated such a model using a set of 17 time lags (spanning 0-250 ms) as described in the Methods, using PCA to reduce the number of parameters to 80 as in the previous model. The peak score with this version was 0.17, vs 0.13 with the previous non-lagged model (Eq. (8)), suggesting a benefit of reconstruction based on spatio-spectral filtering over purely spatial filtering. Fig. 3 (left) shows the correlation coefficient between the filtered stimulus envelope a j ðtÞ and the best EEG channel (the channel that yields the highest correlation score). As for the backward model, the correlation coefficient peaks for small values of L and falls for larger positive or negative values. Fig. 3 (right) shows the impulse response (top) and transfer function (bottom) of the FIR filter for the best shift. The transfer function peaks near 1 Hz, suggesting that correlation is better at the lower end of the frequency range.\n\n\nForward model\n\nThe backward model was calculated from 80 PCs, while the forward model involved 80 time lags, so the degrees of freedom were the same for both. The second model applies an FIR filter applied to the stimulus envelope to predict an EEG channel, whereas the second applies spatial filter applied to the EEG data to infer the stimulus envelope. Since these filtering operations address different sources of noise, it is worth considering combining the two. The next sections explore how to do so in a systematic way using CCA.\n\n\nCCA model 1\n\nThis first model is designed to be most comparable to the forward and backward model. Subsequent models take advantage of the flexibility of CCA to introduce a series of improvements. Fig. 4 (first panel, red) shows the correlation coefficients for the first canonical correlate (CC) pair as a function of time shift. Values are comparable to the forward and backward models, but CCA produces multiple CCs beyond the first (thin lines), several of which seem to show elevated correlation scores for a limited range of shifts L.\n\nCCA model 2 CCA model 2 allows time shifts for the EEG channels (Eq. (12)). Fig. 4  (second panel, red) shows the correlation coefficients for the first canonical correlate (CC) pair as a function of temporal alignment between stimulus and EEG. Values are higher than for the previous model, presumably as a result of the more flexible spatio-spectral filter. It is likely that the multichannel FIR filter adapts the spectral content of the EEG signals to that of the stimulus envelope. Thin lines show correlation coefficients for subsequent CC pairs. Fig. 4 (third panel, red) shows similar results assuming 80 time lagged stimulus envelope signals (instead of 40), and 80 PCs of time-lagged EEG signals (instead of 40) for a total of 160 parameters. Values are higher than for the smaller model, indicating that the more complex model gives a better fit to the data. This outcome was not a forgone conclusion, as the more complex model could instead have led to overfitting and thus a lower score with cross-validation. The larger correlation coefficients likely reflect the ability of higher-order FIRs to capture and resolve features on a longer time scale.\n\nCCA model 3 Fig. 4 (fourth panel, red) shows the correlation coefficient for the first CC pair as a function of time shift. The correlation coefficient approaches 0.4 at the best shift, indicating that CCA has discovered a transform of the stimulus that is highly predictive of a component extracted from the EEG by applying a spatio-spectral filter. In addition to this CC pair, there are additional well-correlated pairs, further discussed in the next Section.\n\nThe correlation coefficients for all subjects for these different models are summarized in Fig. 5 (the previous subject is the thick blue line). The values differ greatly between subjects, but the trends are overall similar. A Wilcoxon rank-sum test indicates that CCA conditions yield significantly larger scores than either forward or backward models (p < 0.002, not corrected for multiple tests) and that CCA model 3 yields larger scores than any other model (p < 0.002, not corrected).\n\n\nExploiting multiple canonical components\n\nA useful feature of CCA solutions is that there are multiple CCs with elevated correlation scores (Fig. 4). Each CC corresponds to a particular FIR-filtered stimulus-envelope signal, orthogonal to those of the other CCs, and that differs from the others in spectral magnitude and/or phase. In this sense, CCA performs a decomposition of the stimulus envelope in the modulation spectrum domain (Dau et al., 1997). Each CC is also associated with a spatial-or spatio-spectrally filtered EEG signal orthogonal to those of the other components, that differs from the others in spatial pattern and/or spectral magnitude and/or phase. CCA thus also decomposes the brain response into uncorrelated components, each mapped to a component of the stimulus envelope. Fig. 6 (top) shows the magnitude transfer functions of the FIR filters corresponding to the first 12 CCs of model 3 for subject EL. For most CCs the transfer function peaks in a particular spectral region, although the peak-to-skirt ratio is usually modest (roughly 4:1 in magnitude, 16:1 in Fig. 4. CCA models. See text for a description of each model. Each plot shows the correlation coefficient between canonical correlate pairs as a function of the temporal shift of the stimulus relative to the EEG, with cross-validation, for one subject (EL). One signal of each pair is derived by filtering the stimulus envelope with a FIR filter, and the other from the EEG by filtering with a spatial (leftmost) or multichannel FIR filter. The red line in each plot is the first (\"best\") pair, other lines are for subsequent CC pairs. power density). Each CC appears to cover a different spectral region but with considerable overlap between CCs. In this example, the transfer functions are peaked, and the peak frequencies roughly follow the order of the components, suggesting greater correlation values for lower frequencies, although the pattern is not perfect. Fig. 6 (bottom) shows the corresponding EEG topographies, calculated as the cross-correlation between the FIR-filtered envelope signal and the raw EEG channels (the polarity of each component is arbitrary). The topography gives a rough indication of the spatial substrate of the EEG component of the CC pair. Whereas the time-courses of activation are mutually orthogonal, there is no such constraint on the associated topographies, and indeed several seem quite similar. The patterns for weaker components tend to be noisy (note the different color scales for each CC).\n\nAs argued elsewhere (de Cheveign e and Parra, 2014) it is not possible to establish a one-to-one correspondence between components and specific sources within the brain. Component waveforms are mutually uncorrelated, whereas brain activity implicated in perceptual processing is likely to be correlated between sources. Even if the sources were uncorrelated, the source-to-component mixing matrix might not be diagonal. What can be said is that the components obtained from the analysis span a subspace of the EEG data containing the stimulus-related behavior. From a neuroscience perspective, the most interesting implication is that there are multiple processes, and that they cannot be subsumed by a single TRF model. CCA may be a useful tool to unravel them.\n\n\nClassification\n\nAnother yardstick to measure a stimulus-response model is its performance in a classification task. Here we consider the task of deciding, given segments of stimulus and EEG of duration T, whether the EEG was in response to that stimulus or to an unrelated stimulus, using correlation scores as a feature as in prior studies. Classification involves determining whether a sample belongs to either of two distributions (Duda et al., 2012), in this case those of correlation scores for matched and mismatched segments respectively. Assuming Gaussian distributions with equal variance, the performance of a one dimensional linear classifier depends on the ratio of between-class to within-class variance, that can be quantified by the d' metric (distance between means divided by standard deviation). In the case of the forward and backward models, there is only one discriminant dimension, in the case of CCA there may be multiple discriminant dimensions. Fig. 6. CCA model 3. Top: amplitude transfer functions of the first 12 CCA-derived FIR filters applied to the stimulus envelope normalized to a peak value of 1, for one subject (EL). Bottom: corresponding topographies. The value at each point of the topography is the normalized cross-correlation coefficient between the EEG component waveform and the EEG channel waveform. Signs are arbitrary. Note that the color scale differs between components, reflecting the lower SNR of higher-order components. Fig. 7 (a) shows the d' scores for the first 6 CC pairs from CCA model 3, as a function of the size of the data segment over which the correlation between pairs is calculated. The d' values increase as the data segment becomes longer (as there is more information and estimates are more stable), and are greater for the first than for subsequent CC pairs. Values for the first few pairs are also greater than for the forward and backward models (Fig. 7 (c)). CC pairs that lead to large correlation scores tend to show large values of d' (Fig. 7 (b)), although the ratio between d' and correlation tends to be smaller for pairs for which the component waveforms are dominated by low frequencies (coded as blue) rather than higher frequencies (coded as red). Frequency content is quantified here by calculating the centroid of the power spectrum of the component waveform.\n\nRather than using individual CCs, correlation values can be combined over CC pairs using multivariate Linear Discriminant Analysis (LDA), as illustrated in Fig. 7 (d) (thick blue line) for the principal discriminant dimension. As expected, combining features from multiple CC pairs leads to better discrimination than the best CC Fig. 7 (d) (thin blue line), itself better than either the forward and backward models (red and orange lines). The dashed line in Fig. 7 (d) shows the 95th percentile of the classification score attained for 1000 random permutations of the class labels. We chose a simple linear classifier for simplicity and ease of exposition. A companion paper describes results with more sophisticated classifiers and classification strategies.\n\nThe match-vs-mismatch task, also chosen for simplicity of exposition, differs from the cocktail-party task considered by other studies (which of two concurrent streams is attended by the listener), although it captures the main aspects of that task. Here, the classifiers were trained over a relatively large dataset (>one hour) and tested on segments of new data, analogous to what might occur in a practical system designed to control a device (see paragraph Relevance for Applications of the next Section). Note that the durations indicated in Fig. 7 (d) do not take into account the impulse responses of filters implied in certain models, so the amount of data involved in each case is slightly longer. In other words, the nominal durations may not faithfully characterize the ability of a classifier to track rapid changes in attention. The issue of classification latency is complex (it depends on the time scales of attention-dependent features as well as noise) and is explored in a companion paper.\n\n\nDiscussion\n\nThis study used CCA to reveal a subspace of cortical activity well correlated with ongoing auditory stimulation (speech). CCA yielded more accurate predictions (larger correlation values) than simpler forward and backward models on the same data, and allowed better classification. The presence of multiple CC pairs with different spatial signatures suggests that the analysis taps a complex cortical process involving multiple sources. The multiple discriminative dimensions support a wider range of classification schemes, and relatively good classification scores were obtained with short data segments, which is a step towards the goal of controlling an external device (for example a hearing aid) on the basis of cortical signals measured by EEG.\n\nThis study builds upon a growing body of work exploring stimulusresponse relations using system-identification techniques and decoding (Lalor et al., 2009;Lalor and Foxe, 2010;Power et al., 2011Power et al., , 2012Pasley et al., 2012;Ding and Simon, 2012;Brandmeyer et al., 2013;Ding and Simon, 2013;Ding et al., 2014;O'Sullivan et al., 2014;Koskinen and Sepp€ a, 2014;Treder et al., 2014;Di Liberto et al., 2015;Mirkovic et al., 2015;Baltzell et al., 2016;Crosse et al., 2016;Ki et al., 2016;O'Sullivan et al., 2017;Biesmans et al., 2017;Fiedler et al., 2017;Khalighinejad et al., 2017;Fuglsang et al., 2017). Invasive measurements such as ECoG Tankus et al., 2012;Zion Golumbic et al., 2013;Chan et al., 2014;Martin et al., 2014;Leonard and Chang, 2014;Mesgarani et al., 2014;Lotte et al., 2015;Martin et al., 2015;Herff et al., 2015;Rao et al., 2017) support reconstruction of detailed spectrotemporal or symbolic representations of the stimulus, while EEG and MEG have been related to coarser representations such as the stimulus waveform envelope, as used here. Whereas ECoG samples mass electric fields relatively close to their source, the quality of EEG and MEG signals is degraded by source-to-sensor mixing and additional sources of noise. Methods such as CCA can contribute to improve the quality of these signals.\n\n\nA complex stimulus-response relationship for continuous speech\n\nEach CC pair is characterized by a filter applied to the speech envelope. Each such filtered envelope waveform is orthogonal to the others, and together they form an empirical decomposition that splits the stimulus envelope into components spectrally distinct in amplitude and/or phase (Fig. 6, top). This is analogous to decomposition over a modulation filterbank, a hypothesized component of perceptual processing (Dau et al., 1997;Ewert and Dau, 2000;Lorenzi et al., 2001;Singh and Theunissen, 2003;Joris et al., 2004;Ghitza, 2011;McDermott and Simoncelli, 2011;Giraud and Poeppel, 2012;Wang et al., 2012;Xiang et al., 2013) that has also been proposed as relevant for processing temporally modulated sounds such as speech (Elhilali et al., 2003;Sukittanon et al., 2004;Hermansky, 2010;Nemala et al., 2013). Early studies applied a bandpass filter to EEG data to optimize SNR, e.g. 2-35 Hz Foxe, 2010) or 2-8 Hz (O'Sullivan et al., 2014). Koskinen and Sepp€ a (2014) applied a logarithmic filterbank (wavelet analysis) to MEG data, obtaining  Fig. 7 (d) shows the 95th percentile of the classification score attained for 1000 random permutations of the class labels. relatively high correlation values within each band, particularly for the lowest frequency bands. Crosse et al. (2015) performed a similar analysis on EEG data using a linear filterbank (bandwidth 2 Hz). Compared to a filterbank, the empirical decomposition provided by CCA allows filter parameters to be directly optimized in both amplitude and phase (at the risk of overfitting, see paragraph Caveats).\n\nEach CC is also characterized by a spatiotemporal filter applied to the EEG data. Each filtered EEG waveform is orthogonal to the others, and together they form a decomposition of the cortical activity into components that are spectrally and/or spatially distinct. Evidence has been found for spatially differentiated responses as a function of selective attention (Power et al., 2012;O'Sullivan et al., 2014;Fuglsang et al., 2017), linguistic competence (Brandmeyer et al., 2013), intelligibility (Tiitinen et al., 2012), phonemic feature (Khalighinejad et al., 2017), or modulation frequency band (Wang et al., 2012;Koskinen and Sepp€ a, 2014). The general pattern suggests an early response to acoustic features from primary regions, and later responses to higher-order features (e.g. phonetic) from multiple secondary cortical regions (Norman-Haignere et al., 2015). CCA captures this spatially distributed and temporally-staggered activity, although, as mentioned earlier, there is not a one-to-one correspondence between components and neural sources.\n\n\nCanonical correlation analysis\n\nCCA is a powerful tool to find linear transforms to apply to time series of brain data (Correa et al., 2010a;D€ ahne et al., 2015). Like PCA it produces component time series that are mutually decorrelated, but whereas PCA maximizes variance, CCA is designed to maximize correlation with a second set of time series. CCA is symmetrical with respect to the datasets, and thus a similar transform is found for the second set that maximizes correlation with the first. Components come by pairs (canonical correlates), the first pair consisting of the linear combinations of either data set with the highest possible correlation between them.\n\nCCA is intended for multichannel data, but can be applied to single channel data by augmenting them with time-lags. The solution (linear combination of time-lagged data) is then a FIR filter, the effect of which is to equalize the spectrum of the time series so as to maximize its correlation with the other dataset. Applying time lags to multichannel data results in multichannel FIR filters that exploit both spectral and spatial structure. The time lags can also be replaced by other convolutional transforms (such as the logarithmic filterbank we used here). Finally, applying nonlinear transforms to the data before CCA allows it to capture non-linear relations between data sets, that can also be found using deep learning techniques (Bießmann et al., 2009;Andrew et al., 2013;D€ ahne et al., 2015;Wang et al., 2015;Tang et al., 2017). CCA is a flexible tool to discover complex convolutional and non-linear relations between sets, but this flexibility is of course offset by the risk of overfitting entailed by the many parameters involved (see paragraph Caveats).\n\nIn a recent study CCA was used to characterize auditory and audiovisual EEG responses (Dmochowski et al., 2017). They applied time-lags to the stimulus representation but not both stimulus and EEG, and they did not consider a convolutional basis other than time lags, both of which provided significant improvements in our study. CCA was used by Biesmans et al. (2017) to combine information across channels of an auditory filterbank to maximize correlation with EEG, and by Koskinen and Sepp€ a (2014) to maximize trial-to-trial reproducibility before relating stimuli to responses. CCA is one example of a wider class of methods that apply linear transforms to EEG to isolate components correlated between datasets (Bießmann et al., 2009;Dmochowski et al., 2012Dmochowski et al., , 2015Lankinen et al., 2014;Sturm et al., 2015;Biesmans et al., 2017) or between modalities (Correa et al., 2010b;Sui et al., 2013).\n\n\nCaveats and cautions\n\nAs other data-driven analysis techniques, CCA is prone to overfitting and circularity (Kriegeskorte et al., 2009). The risk is aggravated because of the many parameters, particularly if multiple transforms of the data (convolutional and non-linear) are included. Overfitting may be detected and to some degree remediated using standard cross-validation and surrogate data techniques, and the tendency to overfit limited by dimensionality reduction, regularization, or prior constraints (Jiang and Guo, 2007;Lahti et al., 2009;Andrew et al., 2013). While dimensionality reduction and regularization are closely related, we prefer the former as it allows dimensionality to be reduced based on criteria other than that optimized by CCA (e.g. spectral content, or repeatability), and competing models can be put on a similar footing by giving them the same number of free parameters.\n\nCCA, based on least-squares minimization, is prone to largeamplitude outliers and glitches that may dominate the solution. It may also pick up artifacts that happen to be correlated between data sets, such as power line interference, linear trends, or filtering transients. Introducing time lags (or filters) allows CCA to synthesize filters that isolate particular frequency regions, leading to higher correlation scores (compare CCA model 2 and 3 to CCA model 1). However, higher correlation might also arise merely from the greater serial correlation introduced by lowpass or narrowband filtering, that reduces the degrees of freedom within the data and thus exacerbates overfitting. Indeed, we observed that, for a given value of correlation, discriminability (d') tends to be lower for components dominated by lower frequencies (Fig. 7 (b)). Fig. 7 (d) reports classification scores for data segments as short as 1 s, but it should be noted that these nominal durations do not include the length of the FIR filters. This should be taken into account when comparing models, or judging the ability of an algorithm to track fast changes in an application (see next section).\n\n\nRelevance for applications\n\nA motivation for this study was to develop a method to steer an auditory assistive device (e.g. hearing aid) using brain signals. Several studies have shown that it is possible to determine which sound source among several is the focus of attention using EEG (Power et al., 2012;O'Sullivan et al., 2014;Mirkovic et al., 2015;Fuglsang et al., 2017;Ki et al., 2016;Biesmans et al., 2017). Good performance has been reported for stimulus-response data of long duration (e.g. 30 or 60 s) for some subjects, but accuracy falls short of what would be needed for real-time control in a usable device. For example, a 95% accuracy (as reported by Biesmans et al. (2017) for their best subject at 30 s duration) would amount to one error in every 20 decisions. An error rate such as this is likely to be frustrating for a user, and having to wait tens of seconds for a decision is also not acceptable.\n\nCCA brings our goal closer in at least three ways. The first is by allowing the representations of both stimulus and response to be optimized jointly, leading to higher correlation scores (Fig. 5) and better classification (Fig. 7). The second is by providing multiple discriminant measures that support multivariate classification as illustrated here with a simple multivariate LDA classifier (Fig. 7 (d)). The third is by providing a flexible framework that can harness additional streams of information (for example non-linear transforms of the data). The best scores reported here (Fig. 7) still fall short of what is needed for a useful device, but the CCA methodology opens many routes that may lead to better performance. In our opinion the value of CCA lies less in the scores reported here, however encouraging, as in the potential it offers for further development. A companion paper describes results with more sophisticated classifiers based on CCA.\n\nThe computational costs associated with CCA are mild. The solution requires eigendecomposition of a covariance matrix that can be calculated incrementally and updated in real time, and efficient standard methods are available for eigendecomposition. Once the solution has been derived, processing amounts merely to application of a multichannel FIR (Eqs. (4) and (5)).\n\n\nConclusion\n\nCCA strips the brain response of variance unrelated to the stimulus, and the stimulus of variance that does not affect the brain response, and thus improves our observation of the relation between stimulus and response. The best performing CCA model produced multiple component pairs, each consisting of a FIR filter applied to the stimulus waveform, and a multichannel FIR filter (spatiotemporal filter) applied to the EEG signal. The spatial signatures of these filters were diverse, suggesting that the analysis is sensitive to multiple neural sources, although there is no simple mapping of components to sources. Each pair was also associated with a different FIR filter applied to the stimulus envelope, indicating sensitivity to different rates of change. Signal components isolated by CCA supported effective classification, in particular thanks to the fact that multiple discriminative components are available, bringing closer the perspective of a cognitively-controlled device based on recording of attention-sensitive correlates of auditory stimulation. CCA is of great interest as a tool to explore the effectiveness of transforms (e.g. nonlinear or convolutional) applied to the data, to further our understanding of perceptual processes and increase the effectiveness of applications.\n\nFig. 5 .\n5Best correlation scores for each subject as a function of the model. The thick blue line is the subject (EL) used for the comparison in Figs. 1-3 and Fig. 5.\n\nFig. 7 .\n7Match-vs-mismatch classification. (a) d' metric for the correlations of the first 6 CC pairs from CCA model 3, calculated over intervals of various durations. (b) Scatterplot of d' values (for an interval of 64s) versus correlation for all subjects and CC pairs up to rank 12. The color indicates the spectral centroid (in Hz) of the audio envelope-derived component of the pair. (c) d' metric for the forward and backward models, the first CC pair of CCA model 3, and the joint multivariate LDA model (thick blue line). (d) Percentage correct scores for a linear discriminant classifier for the same models as in (c). The dashed line in\nAcknowledgementsThis work was supported by the EU H2020-ICT grant 644732 (COCOHA), and grants ANR-10-LABX-0087 IEC and ANR-10-IDEX-0001-02 PSL*, as well as a Ulysses grant(2015)\nDeep canonical correlation analysis. G Andrew, R Arora, J Bilmes, K Livescu, Proceedings of the 30th International Conference on Machine Learning (ICML-13). the 30th International Conference on Machine Learning (ICML-13)28Andrew, G., Arora, R., Bilmes, J., Livescu, K., 2013. Deep canonical correlation analysis. In: Proceedings of the 30th International Conference on Machine Learning (ICML- 13), vol. 28, pp. 1247-1255.\n\nAttention selectively modulates cortical entrainment in different regions of the speech spectrum. L S Baltzell, C Horton, Y Shen, V M Richards, M D&apos;zmura, R Srinivasan, Brain Res. 1644Baltzell, L.S., Horton, C., Shen, Y., Richards, V.M., D'Zmura, M., Srinivasan, R., 2016. Attention selectively modulates cortical entrainment in different regions of the speech spectrum. Brain Res. 1644, 203-212.\n\nAuditory-inspired speech envelope extraction methods for improved EEG-based auditory attention detection in a cocktail party scenario. W Biesmans, N Das, T Francart, A Bertrand, IEEE Trans. Neural Syst. Rehabil. Eng. 25Biesmans, W., Das, N., Francart, T., Bertrand, A., 2017. Auditory-inspired speech envelope extraction methods for improved EEG-based auditory attention detection in a cocktail party scenario. IEEE Trans. Neural Syst. Rehabil. Eng. 25, 402-412.\n\nTemporal kernel CCA and its application in multimodal neuronal data analysis. F Bießmann, F C Meinecke, A Gretton, A Rauch, G Rainer, N K Logothetis, K R Müller, Mach. Learn. 79Bießmann, F., Meinecke, F.C., Gretton, A., Rauch, A., Rainer, G., Logothetis, N.K., Müller, K.R., 2009. Temporal kernel CCA and its application in multimodal neuronal data analysis. Mach. Learn. 79, 5-27.\n\nDecoding speech perception by native and non-native speakers using single-trial electrophysiological data. A Brandmeyer, J D Farquhar, J M Mcqueen, P W Desain, PLoS One. 8Brandmeyer, A., Farquhar, J.D., McQueen, J.M., Desain, P.W., 2013. Decoding speech perception by native and non-native speakers using single-trial electrophysiological data. PLoS One 8.\n\nSpeech-specific tuning of neurons in human superior temporal gyrus. A M Chan, A R Dykstra, V Jayaram, M K Leonard, K E Travis, B Gygi, J M Baker, E Eskandar, L R Hochberg, E Halgren, S S Cash, Cerebr. Cortex. 24Chan, A.M., Dykstra, A.R., Jayaram, V., Leonard, M.K., Travis, K.E., Gygi, B., Baker, J.M., Eskandar, E., Hochberg, L.R., Halgren, E., Cash, S.S., 2014. Speech-specific tuning of neurons in human superior temporal gyrus. Cerebr. Cortex 24, 2679-2693.\n\nCanonical correlation analysis for data fusion and group inferences. N M Correa, T Adali, Y O Li, V D Calhoun, IEEE Signal Process. Mag. Correa, N.M., Adali, T., Li, Y.O., Calhoun, V.D., 2010a. Canonical correlation analysis for data fusion and group inferences. IEEE Signal Process. Mag. 39-50. July.\n\nMulti-set canonical correlation analysis for the fusion of concurrent single trial ERP and functional MRI. N M Correa, T Eichele, T Adalı, Y O Li, V D Calhoun, NeuroImage. 50Correa, N.M., Eichele, T., Adalı, T., Li, Y.O., Calhoun, V.D., 2010b. Multi-set canonical correlation analysis for the fusion of concurrent single trial ERP and functional MRI. NeuroImage 50, 1438-1445.\n\nCongruent visual speech enhances cortical entrainment to continuous auditory speech in noise-free conditions. M J Crosse, J S Butler, E C Lalor, J. Neurosci. 35Crosse, M.J., Butler, J.S., Lalor, E.C., 2015. Congruent visual speech enhances cortical entrainment to continuous auditory speech in noise-free conditions. J. Neurosci. 35, 14195-14204.\n\nThe multivariate temporal response function (mTRF) toolbox: a MATLAB toolbox for relating neural signals to continuous stimuli. M J Crosse, G M Di Liberto, A Bednar, E C Lalor, Front. Hum. Neurosci. 10604Crosse, M.J., Di Liberto, G.M., Bednar, A., Lalor, E.C., 2016. The multivariate temporal response function (mTRF) toolbox: a MATLAB toolbox for relating neural signals to continuous stimuli. Front. Hum. Neurosci. 10, 604.\n\nMultivariate machine learning methods for fusing functional multimodal neuroimaging data. S D€ Ahne, F Bießman, W Samek, S Haufe, D Goltz, C Gundlach, A Villringer, S Fazli, K R Müller, Proc. IEEE. 103D€ ahne, S., Bießman, F., Samek, W., Haufe, S., Goltz, D., Gundlach, C., Villringer, A., Fazli, S., Müller, K.R., 2015. Multivariate machine learning methods for fusing functional multimodal neuroimaging data. Proc. IEEE 103, 1-22.\n\nModeling auditory processing of amplitude modulation. I. Detection and masking with narrow-band carriers. T Dau, B Kollmeier, A Kohlrausch, J. Acoust. Soc. Am. 102Dau, T., Kollmeier, B., Kohlrausch, A., 1997. Modeling auditory processing of amplitude modulation. I. Detection and masking with narrow-band carriers. J. Acoust. Soc. Am. 102, 2892-2905.\n\nQuadratic component analysis. A De Cheveign E, NeuroImage. 59de Cheveign e, A., 2012. Quadratic component analysis. NeuroImage 59, 3838-3844.\n\nSparse time artifact removal. A De Cheveign E, J. Neurosci. Meth. 262de Cheveign e, A., 2016. Sparse time artifact removal. J. Neurosci. Meth. 262, 14-20.\n\nRobust detrending, rereferencing, outlier detection, and inpainting for multichannel data. A De Cheveign E, D Arzounian, NeuroImage. 172de Cheveign e, A., Arzounian, D., 2018. Robust detrending, rereferencing, outlier detection, and inpainting for multichannel data. NeuroImage 172, 903-912.\n\nJoint decorrelation, a versatile tool for multichannel data analysis. A De Cheveign E, L C Parra, NeuroImage. 98de Cheveign e, A., Parra, L.C., 2014. Joint decorrelation, a versatile tool for multichannel data analysis. NeuroImage 98, 487-505.\n\nLow-frequency cortical entrainment to speech reflects phoneme-level processing. G M Di Liberto, J A O&apos;sullivan, E C Lalor, Curr. Biol. 25Di Liberto, G.M., O'Sullivan, J.A., Lalor, E.C., 2015. Low-frequency cortical entrainment to speech reflects phoneme-level processing. Curr. Biol. 25, 2457-2465.\n\nNeural coding of continuous speech in auditory cortex during monaural and dichotic listening. N Ding, J Z Simon, J. Neurophysiol. 107Ding, N., Simon, J.Z., 2012. Neural coding of continuous speech in auditory cortex during monaural and dichotic listening. J. Neurophysiol. 107, 78-89.\n\nAdaptive temporal encoding leads to a background insensitive cortical representation of speech. N Ding, J Z Simon, J. Neurosci. 33Ding, N., Simon, J.Z., 2013. Adaptive temporal encoding leads to a background insensitive cortical representation of speech. J. Neurosci. 33, 5728-5735.\n\nRobust cortical entrainment to the speech envelope relies on the spectro-temporal fine structure. N Ding, M Chatterjee, J Z Simon, NeuroImage. 88Ding, N., Chatterjee, M., Simon, J.Z., 2014. Robust cortical entrainment to the speech envelope relies on the spectro-temporal fine structure. NeuroImage 88, 41-46.\n\nMaximally reliable spatial filtering of steady state visual evoked potentials. J P Dmochowski, A S Greaves, A M Norcia, NeuroImage. 109Dmochowski, J.P., Greaves, A.S., Norcia, A.M., 2015. Maximally reliable spatial filtering of steady state visual evoked potentials. NeuroImage 109, 63-72.\n\nExtracting multidimensional stimulus-response correlations using hybrid encoding-decoding of neural activity. J P Dmochowski, J J Ki, P Deguzman, P Sajda, L C Parra, Dmochowski, J.P., Ki, J.J., DeGuzman, P., Sajda, P., Parra, L.C., 2017. Extracting multidimensional stimulus-response correlations using hybrid encoding-decoding of neural activity. NeuroImage 1-13.\n\nCorrelated components of ongoing EEG point to emotionally laden attention a possible marker of engagement?. J P Dmochowski, P Sajda, J Dias, L C Parra, Front. Hum. Neurosci. 6112Dmochowski, J.P., Sajda, P., Dias, J., Parra, L.C., 2012. Correlated components of ongoing EEG point to emotionally laden attention a possible marker of engagement? Front. Hum. Neurosci. 6, 112.\n\n. R O Duda, P E Hart, D G Stork, Pattern Classification. John Wiley & SonsDuda, R.O., Hart, P.E., Stork, D.G., 2012. Pattern Classification. John Wiley & Sons.\n\nA spectro-temporal modulation index (STMI) for assessment of speech intelligibility. M Elhilali, T Chi, S A Shamma, Speech Commun. 41Elhilali, M., Chi, T., Shamma, S.A., 2003. A spectro-temporal modulation index (STMI) for assessment of speech intelligibility. Speech Commun. 41, 331-348.\n\nCharacterizing frequency selectivity for envelope fluctuations. S D Ewert, T Dau, J. Acoust. Soc. Am. 108Ewert, S.D., Dau, T., 2000. Characterizing frequency selectivity for envelope fluctuations. J. Acoust. Soc. Am. 108, 1181-1196.\n\nSingle-channel in-ear-EEG detects the focus of auditory attention to concurrent tone streams and mixed speech. L Fiedler, M W€ Ostmann, C Graversen, A Brandmeyer, T Lunner, J Obleser, J. Neural. Eng. 1436020Fiedler, L., W€ ostmann, M., Graversen, C., Brandmeyer, A., Lunner, T., Obleser, J., 2017. Single-channel in-ear-EEG detects the focus of auditory attention to concurrent tone streams and mixed speech. J. Neural. Eng. 14, 036020.\n\nNoise-robust cortical tracking of attended speech in real-world acoustic scenes. S A Fuglsang, T Dau, J Hjortkjaer, NeuroImage. 156Fuglsang, S.A., Dau, T., Hjortkjaer, J., 2017. Noise-robust cortical tracking of attended speech in real-world acoustic scenes. NeuroImage 156, 435-444.\n\nLinking speech perception and neurophysiology: speech decoding guided by cascaded oscillators locked to the input rhythm. O Ghitza, Front. Psychol. 2Ghitza, O., 2011. Linking speech perception and neurophysiology: speech decoding guided by cascaded oscillators locked to the input rhythm. Front. Psychol. 2, 1-13.\n\nCortical oscillations and speech processing: emerging computational principles and operations. Al Giraud, D Poeppel, Nat. Neurosci. 15Giraud, Al, Poeppel, D., 2012. Cortical oscillations and speech processing: emerging computational principles and operations. Nat. Neurosci. 15, 511-517.\n\nBrain-to-text: decoding spoken phrases from phone representations in the brain. C Herff, D Heger, A De Pesters, D Telaar, P Brunner, G Schalk, T Schultz, Front. Neurosci. 9Herff, C., Heger, D., de Pesters, A., Telaar, D., Brunner, P., Schalk, G., Schultz, T., 2015. Brain-to-text: decoding spoken phrases from phone representations in the brain. Front. Neurosci. 9, 1-11.\n\nHistory of modulation spectrum in ASR. H Hermansky, 2010 IEEE International Conference on Acoustics, Speech and Signal Processing. IEEEHermansky, H., 2010. History of modulation spectrum in ASR. In: 2010 IEEE International Conference on Acoustics, Speech and Signal Processing. IEEE, pp. 5458-5461.\n\nRelations between two sets of variates. H Hotelling, Biometrika. 28Hotelling, H., 1936. Relations between two sets of variates. Biometrika 28, 321-377.\n\nRegularization versus dimension reduction, which is better? Adv. Neural Networks 474-482. Y Jiang, P Guo, Jiang, Y., Guo, P., 2007. Regularization versus dimension reduction, which is better? Adv. Neural Networks 474-482. ISNN 2007.\n\nNeural processing of amplitude-modulated sounds. P X Joris, C E Schreiner, Rees, Physiol. Rev. 84Joris, P.X., Schreiner, C.E., Rees, a, 2004. Neural processing of amplitude-modulated sounds. Physiol. Rev. 84, 541-577.\n\nDynamic encoding of acoustic features in neural responses to continuous speech. B Khalighinejad, G Cruzatto Da Silva, N Mesgarani, J. Neurosci. 37Khalighinejad, B., Cruzatto da Silva, G., Mesgarani, N., 2017. Dynamic encoding of acoustic features in neural responses to continuous speech. J. Neurosci. 37, 2176-2185.\n\nAttention strongly modulates reliability of neural responses to naturalistic narrative stimuli. J Ki, S Kelly, L C Parra, J. Neurosci. 36Ki, J., Kelly, S., Parra, L.C., 2016. Attention strongly modulates reliability of neural responses to naturalistic narrative stimuli. J. Neurosci. 36, 3092-3101.\n\nUncovering cortical MEG responses to listened audiobook stories. M Koskinen, M Sepp€ A, NeuroImage. 100Koskinen, M., Sepp€ a, M., 2014. Uncovering cortical MEG responses to listened audiobook stories. NeuroImage 100, 263-270.\n\nCircular analysis in systems neuroscience: the dangers of double dipping. N Kriegeskorte, W K Simmons, P S F Bellgowan, C I Baker, Nat. Neurosci. 12Kriegeskorte, N., Simmons, W.K., Bellgowan, P.S.F., Baker, C.I., 2009. Circular analysis in systems neuroscience: the dangers of double dipping. Nat. Neurosci. 12, 535-540.\n\nDependency detection with similarity constraints. L Lahti, S Myllykangas, S Knuutila, S Kaski, Machine Learning for Signal Processing XIX -Proceedings of the 2009 IEEE Signal Processing Society Workshop. MLSP. Lahti, L., Myllykangas, S., Knuutila, S., Kaski, S., 2009. Dependency detection with similarity constraints. In: Machine Learning for Signal Processing XIX -Proceedings of the 2009 IEEE Signal Processing Society Workshop. MLSP, 2009.\n\nResolving precise temporal processing properties of the auditory system using continuous stimuli. E C Lalor, A J Power, R B Reilly, J J Foxe, J. Neurophysiol. 102Lalor, E.C., Power, A.J., Reilly, R.B., Foxe, J.J., 2009. Resolving precise temporal processing properties of the auditory system using continuous stimuli. J. Neurophysiol. 102, 349-359.\n\nNeural responses to uninterrupted natural speech can be extracted with precise temporal resolution. E C Lalor, J J Foxe, Eur. J. Neurosci. 31Lalor, E.C., Foxe, J.J., 2010. Neural responses to uninterrupted natural speech can be extracted with precise temporal resolution. Eur. J. Neurosci. 31, 189-193.\n\nIntersubject consistency of cortical MEG signals during movie viewing. K Lankinen, J Saari, R Hari, M Koskinen, NeuroImage. 92Lankinen, K., Saari, J., Hari, R., Koskinen, M., 2014. Intersubject consistency of cortical MEG signals during movie viewing. NeuroImage 92, 217-224.\n\nDeep learning. Y Lecun, Y Bengio, G Hinton, Nature. 521LeCun, Y., Bengio, Y., Hinton, G., 2015. Deep learning. Nature 521, 436-444.\n\nDynamic speech representations in the human temporal lobe. M K Leonard, E F Chang, Trends Cognit. Sci. 18Leonard, M.K., Chang, E.F., 2014. Dynamic speech representations in the human temporal lobe. Trends Cognit. Sci. 18, 472-479.\n\nSecond-order temporal modulation transfer functions. C Lorenzi, C Soares, T Vonner, J. Acoust. Soc. Am. 110Lorenzi, C., Soares, C., Vonner, T., 2001. Second-order temporal modulation transfer functions. J. Acoust. Soc. Am. 110, 1030-1038.\n\nElectrocorticographic representations of segmental features in continuous speech. F Lotte, J S Brumberg, P Brunner, A Gunduz, A L Ritaccio, C Guan, G Schalk, Front. Hum. Neurosci. 9Lotte, F., Brumberg, J.S., Brunner, P., Gunduz, A., Ritaccio, A.L., Guan, C., Schalk, G., 2015. Electrocorticographic representations of segmental features in continuous speech. Front. Hum. Neurosci. 9, 1-13.\n\nDecoding spectrotemporal features of overt and covert speech from the human cortex. S Martin, P Brunner, C Holdgraf, H J Heinze, N E Crone, J Rieger, G Schalk, R T Knight, B N Pasley, Front. Neuroeng. 7, 14Martin, S., Brunner, P., Holdgraf, C., Heinze, H.J., Crone, N.E., Rieger, J., Schalk, G., Knight, R.T., Pasley, B.N., 2014. Decoding spectrotemporal features of overt and covert speech from the human cortex. Front. Neuroeng. 7, 14.\n\nThe use of intracranial recordings to decode human language: challenges and opportunities. S Martin, Jdr Knight, R T Pasley, B N , Brain Lang. Martin, S., Mill an, JdR., Knight, R.T., Pasley, B.N., 2015. The use of intracranial recordings to decode human language: challenges and opportunities. Brain Lang. https://www.sciencedirect.com/science/article/pii/S0093934X15301243.\n\nSound texture perception via statistics of the auditory periphery: evidence from sound synthesis. J H Mcdermott, E P Simoncelli, Neuron. 71McDermott, J.H., Simoncelli, E.P., 2011. Sound texture perception via statistics of the auditory periphery: evidence from sound synthesis. Neuron 71, 926-940.\n\nSelective cortical representation of attended speaker in multi-talker speech perception. N Mesgarani, E F Chang, Nature. 485Mesgarani, N., Chang, E.F., 2012. Selective cortical representation of attended speaker in multi-talker speech perception. Nature 485, 233-236.\n\nPhonetic feature encoding in human superior temporal gyrus. N Mesgarani, C Cheung, K Johnson, E F Chang, S Francisco, Science. 343Mesgarani, N., Cheung, C., Johnson, K., Chang, E.F., Francisco, S., 2014. Phonetic feature encoding in human superior temporal gyrus. Science 343, 1006-1010.\n\nDecoding the attended speech stream with multi-channel EEG: implications for online, daily-life applications. B Mirkovic, S Debener, M Jaeger, M D Vos, J. Neural. Eng. 1246007Mirkovic, B., Debener, S., Jaeger, M., Vos, M.D., 2015. Decoding the attended speech stream with multi-channel EEG: implications for online, daily-life applications. J. Neural. Eng. 12, 046007.\n\nA multistream feature framework based on bandpass modulation filtering for robust speech recognition. S K Nemala, K Patil, M Elhilali, IEEE Trans. Audio Speech Lang. Process. 21Nemala, S.K., Patil, K., Elhilali, M., 2013. A multistream feature framework based on bandpass modulation filtering for robust speech recognition. IEEE Trans. Audio Speech Lang. Process. 21, 416-426.\n\nDistinct cortical pathways for music and speech revealed by hypothesis-free voxel decomposition. S Norman-Haignere, N G Kanwisher, J H Mcdermott, Neuron. 88Norman-Haignere, S., Kanwisher, N.G., McDermott, J.H., 2015. Distinct cortical pathways for music and speech revealed by hypothesis-free voxel decomposition. Neuron 88, 1281-1296.\n\n. A De Cheveign E, NeuroImage. 172A. de Cheveign e et al. NeuroImage 172 (2018) 206-216\n\nAttentional selection in a cocktail party environment can Be decoded from single-trial EEG. J A O&apos;sullivan, A J Power, N Mesgarani, S Rajaram, J J Foxe, B G Shinn-Cunningham, M Slaney, S A Shamma, E C Lalor, Cerebr. Cortex. 25O'Sullivan, J.A., Power, A.J., Mesgarani, N., Rajaram, S., Foxe, J.J., Shinn- Cunningham, B.G., Slaney, M., Shamma, S.A., Lalor, E.C., 2014. Attentional selection in a cocktail party environment can Be decoded from single-trial EEG. Cerebr. Cortex 25, 1697-1706.\n\nNeural decoding of attentional selection in multi-speaker environments without access to separated sources. J O&apos;sullivan, Z Chen, J Herrero, G M Mckhann, S A Sheth, A D Mehta, N Mesgarani, J. Neural. Eng. 14O'Sullivan, J., Chen, Z., Herrero, J., McKhann, G.M., Sheth, S.A., Mehta, A.D., Mesgarani, N., 2017. Neural decoding of attentional selection in multi-speaker environments without access to separated sources. J. Neural. Eng. 14, 1-14.\n\nReconstructing speech from human auditory cortex. B N Pasley, S V David, N Mesgarani, A Flinker, S A Shamma, N E Crone, R T Knight, E F Chang, PLoS Biol. 101001251Pasley, B.N., David, S.V., Mesgarani, N., Flinker, A., Shamma, S.A., Crone, N.E., Knight, R.T., Chang, E.F., 2012. Reconstructing speech from human auditory cortex. PLoS Biol. 10, e1001251.\n\nAt what time is the cocktail party? A late locus of selective attention to natural speech. A J Power, J J Foxe, E J Forde, R B Reilly, E C Lalor, Eur. J. Neurosci. 35Power, A.J., Foxe, J.J., Forde, E.J., Reilly, R.B., Lalor, E.C., 2012. At what time is the cocktail party? A late locus of selective attention to natural speech. Eur. J. Neurosci. 35, 1497-1503.\n\nEndogenous auditory spatial attention modulates obligatory sensory activity in auditory cortex. A J Power, E C Lalor, R B Reilly, Cerebr. Cortex. 21Power, A.J., Lalor, E.C., Reilly, R.B., 2011. Endogenous auditory spatial attention modulates obligatory sensory activity in auditory cortex. Cerebr. Cortex 21, 1223-1230.\n\nChronic ambulatory electrocorticography from human speech cortex. V R Rao, M K Leonard, J K Kleen, B A Lucas, E A Mirro, E F Chang, NeuroImage. 153Rao, V.R., Leonard, M.K., Kleen, J.K., Lucas, B.A., Mirro, E.A., Chang, E.F., 2017. Chronic ambulatory electrocorticography from human speech cortex. NeuroImage 153, 273-282.\n\nModulation spectra of natural sounds and ethological theories of auditory processing. N C Singh, F E Theunissen, J. Acoust. Soc. Am. 114Singh, N.C., Theunissen, F.E., 2003. Modulation spectra of natural sounds and ethological theories of auditory processing. J. Acoust. Soc. Am. 114, 3394-3411.\n\nMulti-variate EEG analysis as a novel tool to examine brain responses to naturalistic music stimuli. I Sturm, S D€ Ahne, B Blankertz, G Curio, PLoS One. 10Sturm, I., D€ ahne, S., Blankertz, B., Curio, G., 2015. Multi-variate EEG analysis as a novel tool to examine brain responses to naturalistic music stimuli. PLoS One 10, 1-30.\n\nA review of multivariate methods for multimodal fusion of brain imaging data. J Sui, T Adalı, Q Yu, V D Calhoun, J. Neurosci. Meth. 204Sui, J., Adalı, T., Yu, Q., Calhoun, V.D., 2013. A review of multivariate methods for multimodal fusion of brain imaging data. J. Neurosci. Meth. 204, 68-81.\n\nModulation-scale analysis for content identification. S Sukittanon, L E Atlas, J W Pitton, IEEE Trans. Signal Process. 52Sukittanon, S., Atlas, L.E., Pitton, J.W., 2004. Modulation-scale analysis for content identification. IEEE Trans. Signal Process. 52, 3023-3035.\n\nAcoustic feature learning via deep variational canonical correlation analysis. Q Tang, W Wang, K Livescu, ArXiv. 1708Tang, Q., Wang, W., Livescu, K., 2017. Acoustic feature learning via deep variational canonical correlation analysis. ArXiv 1708, 04673v2.\n\nStructured neuronal encoding and decoding of human speech features. A Tankus, I Fried, S Shoham, Nat. Commun. 31015Tankus, A., Fried, I., Shoham, S., 2012. Structured neuronal encoding and decoding of human speech features. Nat. Commun. 3, 1015.\n\nTransient and sustained cortical activity elicited by connected speech of varying intelligibility. H Tiitinen, I Miettinen, P Alku, P J C May, BMC Neurosci. 13157Tiitinen, H., Miettinen, I., Alku, P., May, P.J.C., 2012. Transient and sustained cortical activity elicited by connected speech of varying intelligibility. BMC Neurosci. 13, 157.\n\nDecoding auditory attention to instruments in polyphonic music using single-trial EEG classification. M S Treder, H Purwins, D Miklody, I Sturm, B Blankertz, J. Neural. Eng. 1126009Treder, M.S., Purwins, H., Miklody, D., Sturm, I., Blankertz, B., 2014. Decoding auditory attention to instruments in polyphonic music using single-trial EEG classification. J. Neural. Eng. 11, 026009.\n\nUnsupervised learning of acoustic features via deep canonical correlation analysis. W Wang, K Livescu, Ja Bilmes, IEEE International Conference on Acoustics, Speech and Signal Processing (ICASSP). Wang, W., Livescu, K., Bilmes, Ja, 2015. Unsupervised learning of acoustic features via deep canonical correlation analysis. In: IEEE International Conference on Acoustics, Speech and Signal Processing (ICASSP), pp. 4590-4594.\n\nSensitivity to temporal modulation rate and spectral bandwidth in the human auditory system: MEG evidence. Y Wang, N Ding, N Ahmar, J Xiang, D Poeppel, J Z Simon, J. Neurophysiol. 107Wang, Y., Ding, N., Ahmar, N., Xiang, J., Poeppel, D., Simon, J.Z., 2012. Sensitivity to temporal modulation rate and spectral bandwidth in the human auditory system: MEG evidence. J. Neurophysiol. 107, 2033-2041.\n\nA brief introduction to the use of event-related potentials in studies of perception and attention. G F Woodman, Atten. Percept. Psychophys. 72Woodman, G.F., 2010. A brief introduction to the use of event-related potentials in studies of perception and attention. Atten. Percept. Psychophys. 72, 2031-2046.\n\nPhysiological evidence for auditory modulation filterbanks: cortical responses to concurrent modulations. J Xiang, D Poeppel, J Z Simon, J. Acoust. Soc. Am. 1337Xiang, J., Poeppel, D., Simon, J.Z., 2013. Physiological evidence for auditory modulation filterbanks: cortical responses to concurrent modulations. J. Acoust. Soc. Am. 133, EL7.\n\nPerceptual spaces: mathematical structures to neural mechanisms. Q Zaidi, J Victor, J Mcdermott, M Geffen, S Bensmaia, T A Cleland, J. Neurosci. 33Zaidi, Q., Victor, J., McDermott, J., Geffen, M., Bensmaia, S., Cleland, T.A., 2013. Perceptual spaces: mathematical structures to neural mechanisms. J. Neurosci. 33, 17597-17602.\n\nMechanisms underlying selective neuronal tracking of attended speech at a \"cocktail party. E M Zion Golumbic, N Ding, S Bickel, P Lakatos, C A Schevon, G M Mckhann, R R Goodman, R Emerson, A D Mehta, J Z Simon, D Poeppel, C E Schroeder, Neuron. 77Zion Golumbic, E.M., Ding, N., Bickel, S., Lakatos, P., Schevon, C.A., McKhann, G.M., Goodman, R.R., Emerson, R., Mehta, A.D., Simon, J.Z., Poeppel, D., Schroeder, C.E., 2013. Mechanisms underlying selective neuronal tracking of attended speech at a \"cocktail party\". Neuron 77, 980-991.\n\n. A De Cheveign E, NeuroImage. 172A. de Cheveign e et al. NeuroImage 172 (2018) 206-216\n", "annotations": {"author": "[{\"end\":427,\"start\":65},{\"end\":570,\"start\":428},{\"end\":719,\"start\":571},{\"end\":1062,\"start\":720},{\"end\":1118,\"start\":1063},{\"end\":1451,\"start\":1119}]", "publisher": null, "author_last_name": "[{\"end\":82,\"start\":71},{\"end\":443,\"start\":439},{\"end\":592,\"start\":585},{\"end\":735,\"start\":725},{\"end\":1077,\"start\":1071},{\"end\":1131,\"start\":1126}]", "author_first_name": "[{\"end\":70,\"start\":65},{\"end\":434,\"start\":428},{\"end\":438,\"start\":435},{\"end\":579,\"start\":571},{\"end\":584,\"start\":580},{\"end\":724,\"start\":720},{\"end\":1070,\"start\":1063},{\"end\":1125,\"start\":1119}]", "author_affiliation": "[{\"end\":141,\"start\":84},{\"end\":208,\"start\":143},{\"end\":242,\"start\":210},{\"end\":426,\"start\":244},{\"end\":502,\"start\":445},{\"end\":569,\"start\":504},{\"end\":651,\"start\":594},{\"end\":718,\"start\":653},{\"end\":877,\"start\":737},{\"end\":1061,\"start\":879},{\"end\":1117,\"start\":1079},{\"end\":1218,\"start\":1133},{\"end\":1295,\"start\":1220},{\"end\":1450,\"start\":1297}]", "title": "[{\"end\":62,\"start\":1},{\"end\":1513,\"start\":1452}]", "venue": null, "abstract": "[{\"end\":2738,\"start\":1568}]", "bib_ref": "[{\"attributes\":{\"ref_id\":\"b72\"},\"end\":4025,\"start\":4010},{\"attributes\":{\"ref_id\":\"b40\"},\"end\":4556,\"start\":4536},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":4576,\"start\":4556},{\"attributes\":{\"ref_id\":\"b72\"},\"end\":5744,\"start\":5729},{\"attributes\":{\"ref_id\":\"b32\"},\"end\":6502,\"start\":6485},{\"attributes\":{\"ref_id\":\"b74\"},\"end\":8783,\"start\":8763},{\"attributes\":{\"ref_id\":\"b33\"},\"end\":13201,\"start\":13180},{\"attributes\":{\"ref_id\":\"b43\"},\"end\":14671,\"start\":14651},{\"attributes\":{\"ref_id\":\"b16\"},\"end\":19678,\"start\":19653},{\"attributes\":{\"ref_id\":\"b56\"},\"end\":28073,\"start\":28048},{\"attributes\":{\"ref_id\":\"b11\"},\"end\":32771,\"start\":32753},{\"attributes\":{\"ref_id\":\"b23\"},\"end\":36065,\"start\":36046},{\"attributes\":{\"ref_id\":\"b40\"},\"end\":40650,\"start\":40630},{\"attributes\":{\"ref_id\":\"b41\"},\"end\":40671,\"start\":40650},{\"attributes\":{\"ref_id\":\"b60\"},\"end\":40689,\"start\":40671},{\"attributes\":{\"ref_id\":\"b59\"},\"end\":40709,\"start\":40689},{\"attributes\":{\"ref_id\":\"b58\"},\"end\":40729,\"start\":40709},{\"attributes\":{\"ref_id\":\"b17\"},\"end\":40750,\"start\":40729},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":40774,\"start\":40750},{\"attributes\":{\"ref_id\":\"b18\"},\"end\":40795,\"start\":40774},{\"attributes\":{\"ref_id\":\"b19\"},\"end\":40813,\"start\":40795},{\"attributes\":{\"ref_id\":\"b56\"},\"end\":40837,\"start\":40813},{\"attributes\":{\"ref_id\":\"b37\"},\"end\":40864,\"start\":40837},{\"attributes\":{\"ref_id\":\"b69\"},\"end\":40884,\"start\":40864},{\"attributes\":{\"ref_id\":\"b16\"},\"end\":40908,\"start\":40884},{\"attributes\":{\"ref_id\":\"b52\"},\"end\":40930,\"start\":40908},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":40952,\"start\":40930},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":40972,\"start\":40952},{\"attributes\":{\"ref_id\":\"b36\"},\"end\":40988,\"start\":40972},{\"attributes\":{\"ref_id\":\"b57\"},\"end\":41012,\"start\":40988},{\"attributes\":{\"ref_id\":\"b2\"},\"end\":41034,\"start\":41012},{\"attributes\":{\"ref_id\":\"b26\"},\"end\":41055,\"start\":41034},{\"attributes\":{\"ref_id\":\"b35\"},\"end\":41082,\"start\":41055},{\"attributes\":{\"ref_id\":\"b27\"},\"end\":41104,\"start\":41082},{\"attributes\":{\"ref_id\":\"b67\"},\"end\":41161,\"start\":41141},{\"attributes\":{\"ref_id\":\"b75\"},\"end\":41188,\"start\":41161},{\"attributes\":{\"ref_id\":\"b5\"},\"end\":41206,\"start\":41188},{\"attributes\":{\"ref_id\":\"b47\"},\"end\":41226,\"start\":41206},{\"attributes\":{\"ref_id\":\"b44\"},\"end\":41250,\"start\":41226},{\"attributes\":{\"ref_id\":\"b51\"},\"end\":41273,\"start\":41250},{\"attributes\":{\"ref_id\":\"b46\"},\"end\":41292,\"start\":41273},{\"attributes\":{\"ref_id\":\"b48\"},\"end\":41312,\"start\":41292},{\"attributes\":{\"ref_id\":\"b30\"},\"end\":41331,\"start\":41312},{\"attributes\":{\"ref_id\":\"b61\"},\"end\":41347,\"start\":41331},{\"attributes\":{\"ref_id\":\"b11\"},\"end\":42321,\"start\":42303},{\"attributes\":{\"ref_id\":\"b25\"},\"end\":42341,\"start\":42321},{\"attributes\":{\"ref_id\":\"b45\"},\"end\":42362,\"start\":42341},{\"attributes\":{\"ref_id\":\"b62\"},\"end\":42389,\"start\":42362},{\"attributes\":{\"ref_id\":\"b34\"},\"end\":42408,\"start\":42389},{\"attributes\":{\"ref_id\":\"b28\"},\"end\":42421,\"start\":42408},{\"attributes\":{\"ref_id\":\"b49\"},\"end\":42452,\"start\":42421},{\"attributes\":{\"ref_id\":\"b29\"},\"end\":42477,\"start\":42452},{\"attributes\":{\"ref_id\":\"b71\"},\"end\":42495,\"start\":42477},{\"attributes\":{\"ref_id\":\"b73\"},\"end\":42514,\"start\":42495},{\"attributes\":{\"ref_id\":\"b24\"},\"end\":42636,\"start\":42613},{\"attributes\":{\"ref_id\":\"b65\"},\"end\":42660,\"start\":42636},{\"attributes\":{\"ref_id\":\"b31\"},\"end\":42676,\"start\":42660},{\"attributes\":{\"ref_id\":\"b53\"},\"end\":42696,\"start\":42676},{\"end\":42827,\"start\":42780},{\"attributes\":{\"ref_id\":\"b8\"},\"end\":43175,\"start\":43155},{\"attributes\":{\"ref_id\":\"b59\"},\"end\":43848,\"start\":43828},{\"attributes\":{\"ref_id\":\"b56\"},\"end\":43872,\"start\":43848},{\"attributes\":{\"ref_id\":\"b27\"},\"end\":43894,\"start\":43872},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":43943,\"start\":43918},{\"attributes\":{\"ref_id\":\"b68\"},\"end\":43984,\"start\":43961},{\"attributes\":{\"ref_id\":\"b35\"},\"end\":44031,\"start\":44003},{\"attributes\":{\"ref_id\":\"b71\"},\"end\":44081,\"start\":44062},{\"attributes\":{\"ref_id\":\"b37\"},\"end\":44108,\"start\":44081},{\"attributes\":{\"ref_id\":\"b54\"},\"end\":44332,\"start\":44302},{\"attributes\":{\"ref_id\":\"b6\"},\"end\":44664,\"start\":44642},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":44685,\"start\":44664},{\"attributes\":{\"ref_id\":\"b3\"},\"end\":45958,\"start\":45935},{\"attributes\":{\"ref_id\":\"b0\"},\"end\":45978,\"start\":45958},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":45999,\"start\":45978},{\"attributes\":{\"ref_id\":\"b70\"},\"end\":46017,\"start\":45999},{\"attributes\":{\"ref_id\":\"b66\"},\"end\":46035,\"start\":46017},{\"attributes\":{\"ref_id\":\"b21\"},\"end\":46379,\"start\":46354},{\"attributes\":{\"ref_id\":\"b2\"},\"end\":46636,\"start\":46614},{\"attributes\":{\"ref_id\":\"b37\"},\"end\":46770,\"start\":46743},{\"attributes\":{\"ref_id\":\"b3\"},\"end\":47008,\"start\":46985},{\"attributes\":{\"ref_id\":\"b22\"},\"end\":47031,\"start\":47008},{\"attributes\":{\"ref_id\":\"b20\"},\"end\":47056,\"start\":47031},{\"attributes\":{\"ref_id\":\"b42\"},\"end\":47078,\"start\":47056},{\"attributes\":{\"ref_id\":\"b63\"},\"end\":47097,\"start\":47078},{\"attributes\":{\"ref_id\":\"b2\"},\"end\":47119,\"start\":47097},{\"attributes\":{\"ref_id\":\"b7\"},\"end\":47164,\"start\":47142},{\"attributes\":{\"ref_id\":\"b64\"},\"end\":47181,\"start\":47164},{\"attributes\":{\"ref_id\":\"b38\"},\"end\":47319,\"start\":47293},{\"attributes\":{\"ref_id\":\"b33\"},\"end\":47714,\"start\":47693},{\"attributes\":{\"ref_id\":\"b39\"},\"end\":47733,\"start\":47714},{\"attributes\":{\"ref_id\":\"b0\"},\"end\":47753,\"start\":47733},{\"attributes\":{\"ref_id\":\"b59\"},\"end\":49574,\"start\":49554},{\"attributes\":{\"ref_id\":\"b56\"},\"end\":49598,\"start\":49574},{\"attributes\":{\"ref_id\":\"b52\"},\"end\":49620,\"start\":49598},{\"attributes\":{\"ref_id\":\"b27\"},\"end\":49642,\"start\":49620},{\"attributes\":{\"ref_id\":\"b36\"},\"end\":49658,\"start\":49642},{\"attributes\":{\"ref_id\":\"b2\"},\"end\":49680,\"start\":49658},{\"attributes\":{\"ref_id\":\"b2\"},\"end\":49955,\"start\":49933}]", "figure": "[{\"attributes\":{\"id\":\"fig_0\"},\"end\":53002,\"start\":52834},{\"attributes\":{\"id\":\"fig_1\"},\"end\":53651,\"start\":53003}]", "paragraph": "[{\"end\":3705,\"start\":2754},{\"end\":4577,\"start\":3707},{\"end\":5352,\"start\":4579},{\"end\":6003,\"start\":5354},{\"end\":6944,\"start\":6005},{\"end\":7322,\"start\":6977},{\"end\":7662,\"start\":7354},{\"end\":9013,\"start\":7686},{\"end\":9250,\"start\":9034},{\"end\":9357,\"start\":9278},{\"end\":9468,\"start\":9389},{\"end\":10151,\"start\":9505},{\"end\":10782,\"start\":10188},{\"end\":11745,\"start\":10817},{\"end\":12647,\"start\":11780},{\"end\":12904,\"start\":12649},{\"end\":13577,\"start\":12906},{\"end\":14745,\"start\":13594},{\"end\":15439,\"start\":14769},{\"end\":15490,\"start\":15471},{\"end\":15937,\"start\":15532},{\"end\":16591,\"start\":15956},{\"end\":17229,\"start\":16606},{\"end\":18383,\"start\":17231},{\"end\":19523,\"start\":18385},{\"end\":20902,\"start\":19543},{\"end\":21047,\"start\":20920},{\"end\":22016,\"start\":21049},{\"end\":22073,\"start\":22048},{\"end\":22889,\"start\":22114},{\"end\":23315,\"start\":22923},{\"end\":23392,\"start\":23317},{\"end\":23715,\"start\":23447},{\"end\":23780,\"start\":23717},{\"end\":24234,\"start\":23844},{\"end\":26253,\"start\":24236},{\"end\":26887,\"start\":26255},{\"end\":27094,\"start\":26899},{\"end\":28009,\"start\":27124},{\"end\":29113,\"start\":28028},{\"end\":29653,\"start\":29131},{\"end\":30196,\"start\":29669},{\"end\":31360,\"start\":30198},{\"end\":31824,\"start\":31362},{\"end\":32315,\"start\":31826},{\"end\":34845,\"start\":32360},{\"end\":35609,\"start\":34847},{\"end\":37955,\"start\":35628},{\"end\":38718,\"start\":37957},{\"end\":39727,\"start\":38720},{\"end\":40493,\"start\":39742},{\"end\":41820,\"start\":40495},{\"end\":43461,\"start\":41887},{\"end\":44520,\"start\":43463},{\"end\":45193,\"start\":44555},{\"end\":46266,\"start\":45195},{\"end\":47182,\"start\":46268},{\"end\":48086,\"start\":47207},{\"end\":49264,\"start\":48088},{\"end\":50186,\"start\":49295},{\"end\":51149,\"start\":50188},{\"end\":51519,\"start\":51151},{\"end\":52833,\"start\":51534}]", "formula": "[{\"attributes\":{\"id\":\"formula_0\"},\"end\":7353,\"start\":7323},{\"attributes\":{\"id\":\"formula_1\"},\"end\":9277,\"start\":9251},{\"attributes\":{\"id\":\"formula_2\"},\"end\":9388,\"start\":9358},{\"attributes\":{\"id\":\"formula_3\"},\"end\":9504,\"start\":9469},{\"attributes\":{\"id\":\"formula_4\"},\"end\":10187,\"start\":10152},{\"attributes\":{\"id\":\"formula_5\"},\"end\":15470,\"start\":15440},{\"attributes\":{\"id\":\"formula_6\"},\"end\":15531,\"start\":15491},{\"attributes\":{\"id\":\"formula_7\"},\"end\":22047,\"start\":22017},{\"attributes\":{\"id\":\"formula_8\"},\"end\":22113,\"start\":22074},{\"attributes\":{\"id\":\"formula_9\"},\"end\":22922,\"start\":22890},{\"attributes\":{\"id\":\"formula_10\"},\"end\":23446,\"start\":23393},{\"attributes\":{\"id\":\"formula_11\"},\"end\":23843,\"start\":23781}]", "table_ref": null, "section_header": "[{\"end\":2752,\"start\":2740},{\"end\":6954,\"start\":6947},{\"end\":6975,\"start\":6957},{\"end\":7684,\"start\":7665},{\"end\":9032,\"start\":9016},{\"end\":10815,\"start\":10785},{\"end\":11778,\"start\":11748},{\"end\":13592,\"start\":13580},{\"end\":14767,\"start\":14748},{\"end\":15954,\"start\":15940},{\"end\":16604,\"start\":16594},{\"end\":19541,\"start\":19526},{\"end\":20918,\"start\":20905},{\"end\":26897,\"start\":26890},{\"end\":27122,\"start\":27097},{\"end\":28026,\"start\":28012},{\"end\":29129,\"start\":29116},{\"end\":29667,\"start\":29656},{\"end\":32358,\"start\":32318},{\"end\":35626,\"start\":35612},{\"end\":39740,\"start\":39730},{\"end\":41885,\"start\":41823},{\"end\":44553,\"start\":44523},{\"end\":47205,\"start\":47185},{\"end\":49293,\"start\":49267},{\"end\":51532,\"start\":51522},{\"end\":52843,\"start\":52835},{\"end\":53012,\"start\":53004}]", "table": null, "figure_caption": "[{\"end\":53002,\"start\":52845},{\"end\":53651,\"start\":53014}]", "figure_ref": "[{\"end\":17439,\"start\":17433},{\"end\":21046,\"start\":21040},{\"end\":21203,\"start\":21197},{\"end\":21692,\"start\":21686},{\"end\":27251,\"start\":27245},{\"end\":27703,\"start\":27697},{\"end\":28582,\"start\":28569},{\"end\":28893,\"start\":28879},{\"end\":29878,\"start\":29853},{\"end\":30301,\"start\":30274},{\"end\":30757,\"start\":30751},{\"end\":31400,\"start\":31374},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":31923,\"start\":31917},{\"end\":32466,\"start\":32458},{\"end\":33128,\"start\":33116},{\"end\":33414,\"start\":33408},{\"end\":34290,\"start\":34275},{\"end\":36588,\"start\":36582},{\"attributes\":{\"ref_id\":\"fig_1\"},\"end\":37094,\"start\":37084},{\"attributes\":{\"ref_id\":\"fig_1\"},\"end\":37540,\"start\":37529},{\"attributes\":{\"ref_id\":\"fig_1\"},\"end\":37633,\"start\":37622},{\"attributes\":{\"ref_id\":\"fig_1\"},\"end\":38119,\"start\":38113},{\"attributes\":{\"ref_id\":\"fig_1\"},\"end\":38293,\"start\":38287},{\"attributes\":{\"ref_id\":\"fig_1\"},\"end\":38427,\"start\":38417},{\"attributes\":{\"ref_id\":\"fig_1\"},\"end\":39277,\"start\":39267},{\"end\":42186,\"start\":42173},{\"attributes\":{\"ref_id\":\"fig_1\"},\"end\":42943,\"start\":42933},{\"attributes\":{\"ref_id\":\"fig_1\"},\"end\":48932,\"start\":48921},{\"attributes\":{\"ref_id\":\"fig_1\"},\"end\":48941,\"start\":48935},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":50384,\"start\":50376},{\"attributes\":{\"ref_id\":\"fig_1\"},\"end\":50419,\"start\":50411},{\"attributes\":{\"ref_id\":\"fig_1\"},\"end\":50593,\"start\":50582},{\"attributes\":{\"ref_id\":\"fig_1\"},\"end\":50781,\"start\":50773}]", "bib_author_first_name": "[{\"end\":53868,\"start\":53867},{\"end\":53878,\"start\":53877},{\"end\":53887,\"start\":53886},{\"end\":53897,\"start\":53896},{\"end\":54352,\"start\":54351},{\"end\":54354,\"start\":54353},{\"end\":54366,\"start\":54365},{\"end\":54376,\"start\":54375},{\"end\":54384,\"start\":54383},{\"end\":54386,\"start\":54385},{\"end\":54398,\"start\":54397},{\"end\":54414,\"start\":54413},{\"end\":54792,\"start\":54791},{\"end\":54804,\"start\":54803},{\"end\":54811,\"start\":54810},{\"end\":54823,\"start\":54822},{\"end\":55199,\"start\":55198},{\"end\":55211,\"start\":55210},{\"end\":55213,\"start\":55212},{\"end\":55225,\"start\":55224},{\"end\":55236,\"start\":55235},{\"end\":55245,\"start\":55244},{\"end\":55255,\"start\":55254},{\"end\":55257,\"start\":55256},{\"end\":55271,\"start\":55270},{\"end\":55273,\"start\":55272},{\"end\":55611,\"start\":55610},{\"end\":55625,\"start\":55624},{\"end\":55627,\"start\":55626},{\"end\":55639,\"start\":55638},{\"end\":55641,\"start\":55640},{\"end\":55652,\"start\":55651},{\"end\":55654,\"start\":55653},{\"end\":55930,\"start\":55929},{\"end\":55932,\"start\":55931},{\"end\":55940,\"start\":55939},{\"end\":55942,\"start\":55941},{\"end\":55953,\"start\":55952},{\"end\":55964,\"start\":55963},{\"end\":55966,\"start\":55965},{\"end\":55977,\"start\":55976},{\"end\":55979,\"start\":55978},{\"end\":55989,\"start\":55988},{\"end\":55997,\"start\":55996},{\"end\":55999,\"start\":55998},{\"end\":56008,\"start\":56007},{\"end\":56020,\"start\":56019},{\"end\":56022,\"start\":56021},{\"end\":56034,\"start\":56033},{\"end\":56045,\"start\":56044},{\"end\":56047,\"start\":56046},{\"end\":56394,\"start\":56393},{\"end\":56396,\"start\":56395},{\"end\":56406,\"start\":56405},{\"end\":56415,\"start\":56414},{\"end\":56417,\"start\":56416},{\"end\":56423,\"start\":56422},{\"end\":56425,\"start\":56424},{\"end\":56735,\"start\":56734},{\"end\":56737,\"start\":56736},{\"end\":56747,\"start\":56746},{\"end\":56758,\"start\":56757},{\"end\":56767,\"start\":56766},{\"end\":56769,\"start\":56768},{\"end\":56775,\"start\":56774},{\"end\":56777,\"start\":56776},{\"end\":57116,\"start\":57115},{\"end\":57118,\"start\":57117},{\"end\":57128,\"start\":57127},{\"end\":57130,\"start\":57129},{\"end\":57140,\"start\":57139},{\"end\":57142,\"start\":57141},{\"end\":57482,\"start\":57481},{\"end\":57484,\"start\":57483},{\"end\":57494,\"start\":57493},{\"end\":57496,\"start\":57495},{\"end\":57510,\"start\":57509},{\"end\":57520,\"start\":57519},{\"end\":57522,\"start\":57521},{\"end\":57871,\"start\":57870},{\"end\":57882,\"start\":57881},{\"end\":57893,\"start\":57892},{\"end\":57902,\"start\":57901},{\"end\":57911,\"start\":57910},{\"end\":57920,\"start\":57919},{\"end\":57932,\"start\":57931},{\"end\":57946,\"start\":57945},{\"end\":57955,\"start\":57954},{\"end\":57957,\"start\":57956},{\"end\":58321,\"start\":58320},{\"end\":58328,\"start\":58327},{\"end\":58341,\"start\":58340},{\"end\":58597,\"start\":58596},{\"end\":58740,\"start\":58739},{\"end\":58957,\"start\":58956},{\"end\":58974,\"start\":58973},{\"end\":59229,\"start\":59228},{\"end\":59246,\"start\":59245},{\"end\":59248,\"start\":59247},{\"end\":59484,\"start\":59483},{\"end\":59486,\"start\":59485},{\"end\":59500,\"start\":59499},{\"end\":59502,\"start\":59501},{\"end\":59521,\"start\":59520},{\"end\":59523,\"start\":59522},{\"end\":59803,\"start\":59802},{\"end\":59811,\"start\":59810},{\"end\":59813,\"start\":59812},{\"end\":60091,\"start\":60090},{\"end\":60099,\"start\":60098},{\"end\":60101,\"start\":60100},{\"end\":60377,\"start\":60376},{\"end\":60385,\"start\":60384},{\"end\":60399,\"start\":60398},{\"end\":60401,\"start\":60400},{\"end\":60669,\"start\":60668},{\"end\":60671,\"start\":60670},{\"end\":60685,\"start\":60684},{\"end\":60687,\"start\":60686},{\"end\":60698,\"start\":60697},{\"end\":60700,\"start\":60699},{\"end\":60991,\"start\":60990},{\"end\":60993,\"start\":60992},{\"end\":61007,\"start\":61006},{\"end\":61009,\"start\":61008},{\"end\":61015,\"start\":61014},{\"end\":61027,\"start\":61026},{\"end\":61036,\"start\":61035},{\"end\":61038,\"start\":61037},{\"end\":61355,\"start\":61354},{\"end\":61357,\"start\":61356},{\"end\":61371,\"start\":61370},{\"end\":61380,\"start\":61379},{\"end\":61388,\"start\":61387},{\"end\":61390,\"start\":61389},{\"end\":61623,\"start\":61622},{\"end\":61625,\"start\":61624},{\"end\":61633,\"start\":61632},{\"end\":61635,\"start\":61634},{\"end\":61643,\"start\":61642},{\"end\":61645,\"start\":61644},{\"end\":61867,\"start\":61866},{\"end\":61879,\"start\":61878},{\"end\":61886,\"start\":61885},{\"end\":61888,\"start\":61887},{\"end\":62136,\"start\":62135},{\"end\":62138,\"start\":62137},{\"end\":62147,\"start\":62146},{\"end\":62417,\"start\":62416},{\"end\":62428,\"start\":62427},{\"end\":62442,\"start\":62441},{\"end\":62455,\"start\":62454},{\"end\":62469,\"start\":62468},{\"end\":62479,\"start\":62478},{\"end\":62825,\"start\":62824},{\"end\":62827,\"start\":62826},{\"end\":62839,\"start\":62838},{\"end\":62846,\"start\":62845},{\"end\":63151,\"start\":63150},{\"end\":63440,\"start\":63438},{\"end\":63450,\"start\":63449},{\"end\":63713,\"start\":63712},{\"end\":63722,\"start\":63721},{\"end\":63731,\"start\":63730},{\"end\":63745,\"start\":63744},{\"end\":63755,\"start\":63754},{\"end\":63766,\"start\":63765},{\"end\":63776,\"start\":63775},{\"end\":64045,\"start\":64044},{\"end\":64346,\"start\":64345},{\"end\":64549,\"start\":64548},{\"end\":64558,\"start\":64557},{\"end\":64742,\"start\":64741},{\"end\":64744,\"start\":64743},{\"end\":64753,\"start\":64752},{\"end\":64755,\"start\":64754},{\"end\":64992,\"start\":64991},{\"end\":65009,\"start\":65008},{\"end\":65030,\"start\":65029},{\"end\":65326,\"start\":65325},{\"end\":65332,\"start\":65331},{\"end\":65341,\"start\":65340},{\"end\":65343,\"start\":65342},{\"end\":65595,\"start\":65594},{\"end\":65607,\"start\":65606},{\"end\":65831,\"start\":65830},{\"end\":65847,\"start\":65846},{\"end\":65849,\"start\":65848},{\"end\":65860,\"start\":65859},{\"end\":65864,\"start\":65861},{\"end\":65877,\"start\":65876},{\"end\":65879,\"start\":65878},{\"end\":66129,\"start\":66128},{\"end\":66138,\"start\":66137},{\"end\":66153,\"start\":66152},{\"end\":66165,\"start\":66164},{\"end\":66622,\"start\":66621},{\"end\":66624,\"start\":66623},{\"end\":66633,\"start\":66632},{\"end\":66635,\"start\":66634},{\"end\":66644,\"start\":66643},{\"end\":66646,\"start\":66645},{\"end\":66656,\"start\":66655},{\"end\":66658,\"start\":66657},{\"end\":66974,\"start\":66973},{\"end\":66976,\"start\":66975},{\"end\":66985,\"start\":66984},{\"end\":66987,\"start\":66986},{\"end\":67249,\"start\":67248},{\"end\":67261,\"start\":67260},{\"end\":67270,\"start\":67269},{\"end\":67278,\"start\":67277},{\"end\":67470,\"start\":67469},{\"end\":67479,\"start\":67478},{\"end\":67489,\"start\":67488},{\"end\":67647,\"start\":67646},{\"end\":67649,\"start\":67648},{\"end\":67660,\"start\":67659},{\"end\":67662,\"start\":67661},{\"end\":67873,\"start\":67872},{\"end\":67884,\"start\":67883},{\"end\":67894,\"start\":67893},{\"end\":68142,\"start\":68141},{\"end\":68151,\"start\":68150},{\"end\":68153,\"start\":68152},{\"end\":68165,\"start\":68164},{\"end\":68176,\"start\":68175},{\"end\":68186,\"start\":68185},{\"end\":68188,\"start\":68187},{\"end\":68200,\"start\":68199},{\"end\":68208,\"start\":68207},{\"end\":68535,\"start\":68534},{\"end\":68545,\"start\":68544},{\"end\":68556,\"start\":68555},{\"end\":68568,\"start\":68567},{\"end\":68570,\"start\":68569},{\"end\":68580,\"start\":68579},{\"end\":68582,\"start\":68581},{\"end\":68591,\"start\":68590},{\"end\":68601,\"start\":68600},{\"end\":68611,\"start\":68610},{\"end\":68613,\"start\":68612},{\"end\":68623,\"start\":68622},{\"end\":68625,\"start\":68624},{\"end\":68981,\"start\":68980},{\"end\":68993,\"start\":68990},{\"end\":69003,\"start\":69002},{\"end\":69005,\"start\":69004},{\"end\":69015,\"start\":69014},{\"end\":69017,\"start\":69016},{\"end\":69365,\"start\":69364},{\"end\":69367,\"start\":69366},{\"end\":69380,\"start\":69379},{\"end\":69382,\"start\":69381},{\"end\":69655,\"start\":69654},{\"end\":69668,\"start\":69667},{\"end\":69670,\"start\":69669},{\"end\":69895,\"start\":69894},{\"end\":69908,\"start\":69907},{\"end\":69918,\"start\":69917},{\"end\":69929,\"start\":69928},{\"end\":69931,\"start\":69930},{\"end\":69940,\"start\":69939},{\"end\":70234,\"start\":70233},{\"end\":70246,\"start\":70245},{\"end\":70257,\"start\":70256},{\"end\":70267,\"start\":70266},{\"end\":70269,\"start\":70268},{\"end\":70596,\"start\":70595},{\"end\":70598,\"start\":70597},{\"end\":70608,\"start\":70607},{\"end\":70617,\"start\":70616},{\"end\":70969,\"start\":70968},{\"end\":70988,\"start\":70987},{\"end\":70990,\"start\":70989},{\"end\":71003,\"start\":71002},{\"end\":71005,\"start\":71004},{\"end\":71211,\"start\":71210},{\"end\":71390,\"start\":71389},{\"end\":71392,\"start\":71391},{\"end\":71411,\"start\":71410},{\"end\":71413,\"start\":71412},{\"end\":71422,\"start\":71421},{\"end\":71435,\"start\":71434},{\"end\":71446,\"start\":71445},{\"end\":71448,\"start\":71447},{\"end\":71456,\"start\":71455},{\"end\":71458,\"start\":71457},{\"end\":71478,\"start\":71477},{\"end\":71488,\"start\":71487},{\"end\":71490,\"start\":71489},{\"end\":71500,\"start\":71499},{\"end\":71502,\"start\":71501},{\"end\":71901,\"start\":71900},{\"end\":71920,\"start\":71919},{\"end\":71928,\"start\":71927},{\"end\":71939,\"start\":71938},{\"end\":71941,\"start\":71940},{\"end\":71952,\"start\":71951},{\"end\":71954,\"start\":71953},{\"end\":71963,\"start\":71962},{\"end\":71965,\"start\":71964},{\"end\":71974,\"start\":71973},{\"end\":72291,\"start\":72290},{\"end\":72293,\"start\":72292},{\"end\":72303,\"start\":72302},{\"end\":72305,\"start\":72304},{\"end\":72314,\"start\":72313},{\"end\":72327,\"start\":72326},{\"end\":72338,\"start\":72337},{\"end\":72340,\"start\":72339},{\"end\":72350,\"start\":72349},{\"end\":72352,\"start\":72351},{\"end\":72361,\"start\":72360},{\"end\":72363,\"start\":72362},{\"end\":72373,\"start\":72372},{\"end\":72375,\"start\":72374},{\"end\":72686,\"start\":72685},{\"end\":72688,\"start\":72687},{\"end\":72697,\"start\":72696},{\"end\":72699,\"start\":72698},{\"end\":72707,\"start\":72706},{\"end\":72709,\"start\":72708},{\"end\":72718,\"start\":72717},{\"end\":72720,\"start\":72719},{\"end\":72730,\"start\":72729},{\"end\":72732,\"start\":72731},{\"end\":73053,\"start\":73052},{\"end\":73055,\"start\":73054},{\"end\":73064,\"start\":73063},{\"end\":73066,\"start\":73065},{\"end\":73075,\"start\":73074},{\"end\":73077,\"start\":73076},{\"end\":73344,\"start\":73343},{\"end\":73346,\"start\":73345},{\"end\":73353,\"start\":73352},{\"end\":73355,\"start\":73354},{\"end\":73366,\"start\":73365},{\"end\":73368,\"start\":73367},{\"end\":73377,\"start\":73376},{\"end\":73379,\"start\":73378},{\"end\":73388,\"start\":73387},{\"end\":73390,\"start\":73389},{\"end\":73399,\"start\":73398},{\"end\":73401,\"start\":73400},{\"end\":73687,\"start\":73686},{\"end\":73689,\"start\":73688},{\"end\":73698,\"start\":73697},{\"end\":73700,\"start\":73699},{\"end\":73998,\"start\":73997},{\"end\":74007,\"start\":74006},{\"end\":74018,\"start\":74017},{\"end\":74031,\"start\":74030},{\"end\":74307,\"start\":74306},{\"end\":74314,\"start\":74313},{\"end\":74323,\"start\":74322},{\"end\":74329,\"start\":74328},{\"end\":74331,\"start\":74330},{\"end\":74577,\"start\":74576},{\"end\":74591,\"start\":74590},{\"end\":74593,\"start\":74592},{\"end\":74602,\"start\":74601},{\"end\":74604,\"start\":74603},{\"end\":74870,\"start\":74869},{\"end\":74878,\"start\":74877},{\"end\":74886,\"start\":74885},{\"end\":75116,\"start\":75115},{\"end\":75126,\"start\":75125},{\"end\":75135,\"start\":75134},{\"end\":75394,\"start\":75393},{\"end\":75406,\"start\":75405},{\"end\":75419,\"start\":75418},{\"end\":75427,\"start\":75426},{\"end\":75431,\"start\":75428},{\"end\":75740,\"start\":75739},{\"end\":75742,\"start\":75741},{\"end\":75752,\"start\":75751},{\"end\":75763,\"start\":75762},{\"end\":75774,\"start\":75773},{\"end\":75783,\"start\":75782},{\"end\":76106,\"start\":76105},{\"end\":76114,\"start\":76113},{\"end\":76126,\"start\":76124},{\"end\":76554,\"start\":76553},{\"end\":76562,\"start\":76561},{\"end\":76570,\"start\":76569},{\"end\":76579,\"start\":76578},{\"end\":76588,\"start\":76587},{\"end\":76599,\"start\":76598},{\"end\":76601,\"start\":76600},{\"end\":76945,\"start\":76944},{\"end\":76947,\"start\":76946},{\"end\":77259,\"start\":77258},{\"end\":77268,\"start\":77267},{\"end\":77279,\"start\":77278},{\"end\":77281,\"start\":77280},{\"end\":77559,\"start\":77558},{\"end\":77568,\"start\":77567},{\"end\":77578,\"start\":77577},{\"end\":77591,\"start\":77590},{\"end\":77601,\"start\":77600},{\"end\":77613,\"start\":77612},{\"end\":77615,\"start\":77614},{\"end\":77913,\"start\":77912},{\"end\":77915,\"start\":77914},{\"end\":77932,\"start\":77931},{\"end\":77940,\"start\":77939},{\"end\":77950,\"start\":77949},{\"end\":77961,\"start\":77960},{\"end\":77963,\"start\":77962},{\"end\":77974,\"start\":77973},{\"end\":77976,\"start\":77975},{\"end\":77987,\"start\":77986},{\"end\":77989,\"start\":77988},{\"end\":78000,\"start\":77999},{\"end\":78011,\"start\":78010},{\"end\":78013,\"start\":78012},{\"end\":78022,\"start\":78021},{\"end\":78024,\"start\":78023},{\"end\":78033,\"start\":78032},{\"end\":78044,\"start\":78043},{\"end\":78046,\"start\":78045},{\"end\":78360,\"start\":78359}]", "bib_author_last_name": "[{\"end\":53875,\"start\":53869},{\"end\":53884,\"start\":53879},{\"end\":53894,\"start\":53888},{\"end\":53905,\"start\":53898},{\"end\":54363,\"start\":54355},{\"end\":54373,\"start\":54367},{\"end\":54381,\"start\":54377},{\"end\":54395,\"start\":54387},{\"end\":54411,\"start\":54399},{\"end\":54425,\"start\":54415},{\"end\":54801,\"start\":54793},{\"end\":54808,\"start\":54805},{\"end\":54820,\"start\":54812},{\"end\":54832,\"start\":54824},{\"end\":55208,\"start\":55200},{\"end\":55222,\"start\":55214},{\"end\":55233,\"start\":55226},{\"end\":55242,\"start\":55237},{\"end\":55252,\"start\":55246},{\"end\":55268,\"start\":55258},{\"end\":55280,\"start\":55274},{\"end\":55622,\"start\":55612},{\"end\":55636,\"start\":55628},{\"end\":55649,\"start\":55642},{\"end\":55661,\"start\":55655},{\"end\":55937,\"start\":55933},{\"end\":55950,\"start\":55943},{\"end\":55961,\"start\":55954},{\"end\":55974,\"start\":55967},{\"end\":55986,\"start\":55980},{\"end\":55994,\"start\":55990},{\"end\":56005,\"start\":56000},{\"end\":56017,\"start\":56009},{\"end\":56031,\"start\":56023},{\"end\":56042,\"start\":56035},{\"end\":56052,\"start\":56048},{\"end\":56403,\"start\":56397},{\"end\":56412,\"start\":56407},{\"end\":56420,\"start\":56418},{\"end\":56433,\"start\":56426},{\"end\":56744,\"start\":56738},{\"end\":56755,\"start\":56748},{\"end\":56764,\"start\":56759},{\"end\":56772,\"start\":56770},{\"end\":56785,\"start\":56778},{\"end\":57125,\"start\":57119},{\"end\":57137,\"start\":57131},{\"end\":57148,\"start\":57143},{\"end\":57491,\"start\":57485},{\"end\":57507,\"start\":57497},{\"end\":57517,\"start\":57511},{\"end\":57528,\"start\":57523},{\"end\":57879,\"start\":57872},{\"end\":57890,\"start\":57883},{\"end\":57899,\"start\":57894},{\"end\":57908,\"start\":57903},{\"end\":57917,\"start\":57912},{\"end\":57929,\"start\":57921},{\"end\":57943,\"start\":57933},{\"end\":57952,\"start\":57947},{\"end\":57964,\"start\":57958},{\"end\":58325,\"start\":58322},{\"end\":58338,\"start\":58329},{\"end\":58352,\"start\":58342},{\"end\":58611,\"start\":58598},{\"end\":58754,\"start\":58741},{\"end\":58971,\"start\":58958},{\"end\":58984,\"start\":58975},{\"end\":59243,\"start\":59230},{\"end\":59254,\"start\":59249},{\"end\":59497,\"start\":59487},{\"end\":59518,\"start\":59503},{\"end\":59529,\"start\":59524},{\"end\":59808,\"start\":59804},{\"end\":59819,\"start\":59814},{\"end\":60096,\"start\":60092},{\"end\":60107,\"start\":60102},{\"end\":60382,\"start\":60378},{\"end\":60396,\"start\":60386},{\"end\":60407,\"start\":60402},{\"end\":60682,\"start\":60672},{\"end\":60695,\"start\":60688},{\"end\":60707,\"start\":60701},{\"end\":61004,\"start\":60994},{\"end\":61012,\"start\":61010},{\"end\":61024,\"start\":61016},{\"end\":61033,\"start\":61028},{\"end\":61044,\"start\":61039},{\"end\":61368,\"start\":61358},{\"end\":61377,\"start\":61372},{\"end\":61385,\"start\":61381},{\"end\":61396,\"start\":61391},{\"end\":61630,\"start\":61626},{\"end\":61640,\"start\":61636},{\"end\":61651,\"start\":61646},{\"end\":61876,\"start\":61868},{\"end\":61883,\"start\":61880},{\"end\":61895,\"start\":61889},{\"end\":62144,\"start\":62139},{\"end\":62151,\"start\":62148},{\"end\":62425,\"start\":62418},{\"end\":62439,\"start\":62429},{\"end\":62452,\"start\":62443},{\"end\":62466,\"start\":62456},{\"end\":62476,\"start\":62470},{\"end\":62487,\"start\":62480},{\"end\":62836,\"start\":62828},{\"end\":62843,\"start\":62840},{\"end\":62857,\"start\":62847},{\"end\":63158,\"start\":63152},{\"end\":63447,\"start\":63441},{\"end\":63458,\"start\":63451},{\"end\":63719,\"start\":63714},{\"end\":63728,\"start\":63723},{\"end\":63742,\"start\":63732},{\"end\":63752,\"start\":63746},{\"end\":63763,\"start\":63756},{\"end\":63773,\"start\":63767},{\"end\":63784,\"start\":63777},{\"end\":64055,\"start\":64046},{\"end\":64356,\"start\":64347},{\"end\":64555,\"start\":64550},{\"end\":64562,\"start\":64559},{\"end\":64750,\"start\":64745},{\"end\":64765,\"start\":64756},{\"end\":64771,\"start\":64767},{\"end\":65006,\"start\":64993},{\"end\":65027,\"start\":65010},{\"end\":65040,\"start\":65031},{\"end\":65329,\"start\":65327},{\"end\":65338,\"start\":65333},{\"end\":65349,\"start\":65344},{\"end\":65604,\"start\":65596},{\"end\":65615,\"start\":65608},{\"end\":65844,\"start\":65832},{\"end\":65857,\"start\":65850},{\"end\":65874,\"start\":65865},{\"end\":65885,\"start\":65880},{\"end\":66135,\"start\":66130},{\"end\":66150,\"start\":66139},{\"end\":66162,\"start\":66154},{\"end\":66171,\"start\":66166},{\"end\":66630,\"start\":66625},{\"end\":66641,\"start\":66636},{\"end\":66653,\"start\":66647},{\"end\":66663,\"start\":66659},{\"end\":66982,\"start\":66977},{\"end\":66992,\"start\":66988},{\"end\":67258,\"start\":67250},{\"end\":67267,\"start\":67262},{\"end\":67275,\"start\":67271},{\"end\":67287,\"start\":67279},{\"end\":67476,\"start\":67471},{\"end\":67486,\"start\":67480},{\"end\":67496,\"start\":67490},{\"end\":67657,\"start\":67650},{\"end\":67668,\"start\":67663},{\"end\":67881,\"start\":67874},{\"end\":67891,\"start\":67885},{\"end\":67901,\"start\":67895},{\"end\":68148,\"start\":68143},{\"end\":68162,\"start\":68154},{\"end\":68173,\"start\":68166},{\"end\":68183,\"start\":68177},{\"end\":68197,\"start\":68189},{\"end\":68205,\"start\":68201},{\"end\":68215,\"start\":68209},{\"end\":68542,\"start\":68536},{\"end\":68553,\"start\":68546},{\"end\":68565,\"start\":68557},{\"end\":68577,\"start\":68571},{\"end\":68588,\"start\":68583},{\"end\":68598,\"start\":68592},{\"end\":68608,\"start\":68602},{\"end\":68620,\"start\":68614},{\"end\":68632,\"start\":68626},{\"end\":68988,\"start\":68982},{\"end\":69000,\"start\":68994},{\"end\":69012,\"start\":69006},{\"end\":69377,\"start\":69368},{\"end\":69393,\"start\":69383},{\"end\":69665,\"start\":69656},{\"end\":69676,\"start\":69671},{\"end\":69905,\"start\":69896},{\"end\":69915,\"start\":69909},{\"end\":69926,\"start\":69919},{\"end\":69937,\"start\":69932},{\"end\":69950,\"start\":69941},{\"end\":70243,\"start\":70235},{\"end\":70254,\"start\":70247},{\"end\":70264,\"start\":70258},{\"end\":70273,\"start\":70270},{\"end\":70605,\"start\":70599},{\"end\":70614,\"start\":70609},{\"end\":70626,\"start\":70618},{\"end\":70985,\"start\":70970},{\"end\":71000,\"start\":70991},{\"end\":71015,\"start\":71006},{\"end\":71225,\"start\":71212},{\"end\":71408,\"start\":71393},{\"end\":71419,\"start\":71414},{\"end\":71432,\"start\":71423},{\"end\":71443,\"start\":71436},{\"end\":71453,\"start\":71449},{\"end\":71475,\"start\":71459},{\"end\":71485,\"start\":71479},{\"end\":71497,\"start\":71491},{\"end\":71508,\"start\":71503},{\"end\":71917,\"start\":71902},{\"end\":71925,\"start\":71921},{\"end\":71936,\"start\":71929},{\"end\":71949,\"start\":71942},{\"end\":71960,\"start\":71955},{\"end\":71971,\"start\":71966},{\"end\":71984,\"start\":71975},{\"end\":72300,\"start\":72294},{\"end\":72311,\"start\":72306},{\"end\":72324,\"start\":72315},{\"end\":72335,\"start\":72328},{\"end\":72347,\"start\":72341},{\"end\":72358,\"start\":72353},{\"end\":72370,\"start\":72364},{\"end\":72381,\"start\":72376},{\"end\":72694,\"start\":72689},{\"end\":72704,\"start\":72700},{\"end\":72715,\"start\":72710},{\"end\":72727,\"start\":72721},{\"end\":72738,\"start\":72733},{\"end\":73061,\"start\":73056},{\"end\":73072,\"start\":73067},{\"end\":73084,\"start\":73078},{\"end\":73350,\"start\":73347},{\"end\":73363,\"start\":73356},{\"end\":73374,\"start\":73369},{\"end\":73385,\"start\":73380},{\"end\":73396,\"start\":73391},{\"end\":73407,\"start\":73402},{\"end\":73695,\"start\":73690},{\"end\":73711,\"start\":73701},{\"end\":74004,\"start\":73999},{\"end\":74015,\"start\":74008},{\"end\":74028,\"start\":74019},{\"end\":74037,\"start\":74032},{\"end\":74311,\"start\":74308},{\"end\":74320,\"start\":74315},{\"end\":74326,\"start\":74324},{\"end\":74339,\"start\":74332},{\"end\":74588,\"start\":74578},{\"end\":74599,\"start\":74594},{\"end\":74611,\"start\":74605},{\"end\":74875,\"start\":74871},{\"end\":74883,\"start\":74879},{\"end\":74894,\"start\":74887},{\"end\":75123,\"start\":75117},{\"end\":75132,\"start\":75127},{\"end\":75142,\"start\":75136},{\"end\":75403,\"start\":75395},{\"end\":75416,\"start\":75407},{\"end\":75424,\"start\":75420},{\"end\":75435,\"start\":75432},{\"end\":75749,\"start\":75743},{\"end\":75760,\"start\":75753},{\"end\":75771,\"start\":75764},{\"end\":75780,\"start\":75775},{\"end\":75793,\"start\":75784},{\"end\":76111,\"start\":76107},{\"end\":76122,\"start\":76115},{\"end\":76133,\"start\":76127},{\"end\":76559,\"start\":76555},{\"end\":76567,\"start\":76563},{\"end\":76576,\"start\":76571},{\"end\":76585,\"start\":76580},{\"end\":76596,\"start\":76589},{\"end\":76607,\"start\":76602},{\"end\":76955,\"start\":76948},{\"end\":77265,\"start\":77260},{\"end\":77276,\"start\":77269},{\"end\":77287,\"start\":77282},{\"end\":77565,\"start\":77560},{\"end\":77575,\"start\":77569},{\"end\":77588,\"start\":77579},{\"end\":77598,\"start\":77592},{\"end\":77610,\"start\":77602},{\"end\":77623,\"start\":77616},{\"end\":77929,\"start\":77916},{\"end\":77937,\"start\":77933},{\"end\":77947,\"start\":77941},{\"end\":77958,\"start\":77951},{\"end\":77971,\"start\":77964},{\"end\":77984,\"start\":77977},{\"end\":77997,\"start\":77990},{\"end\":78008,\"start\":78001},{\"end\":78019,\"start\":78014},{\"end\":78030,\"start\":78025},{\"end\":78041,\"start\":78034},{\"end\":78056,\"start\":78047},{\"end\":78374,\"start\":78361}]", "bib_entry": "[{\"attributes\":{\"id\":\"b0\",\"matched_paper_id\":2495132},\"end\":54251,\"start\":53830},{\"attributes\":{\"id\":\"b1\",\"matched_paper_id\":19343879},\"end\":54654,\"start\":54253},{\"attributes\":{\"id\":\"b2\",\"matched_paper_id\":27835175},\"end\":55118,\"start\":54656},{\"attributes\":{\"id\":\"b3\",\"matched_paper_id\":6202647},\"end\":55501,\"start\":55120},{\"attributes\":{\"id\":\"b4\",\"matched_paper_id\":215787950},\"end\":55859,\"start\":55503},{\"attributes\":{\"id\":\"b5\",\"matched_paper_id\":3595214},\"end\":56322,\"start\":55861},{\"attributes\":{\"id\":\"b6\",\"matched_paper_id\":16025241},\"end\":56625,\"start\":56324},{\"attributes\":{\"id\":\"b7\",\"matched_paper_id\":9793973},\"end\":57003,\"start\":56627},{\"attributes\":{\"id\":\"b8\",\"matched_paper_id\":14437255},\"end\":57351,\"start\":57005},{\"attributes\":{\"id\":\"b9\",\"matched_paper_id\":12165026},\"end\":57778,\"start\":57353},{\"attributes\":{\"id\":\"b10\"},\"end\":58212,\"start\":57780},{\"attributes\":{\"id\":\"b11\",\"matched_paper_id\":3500293},\"end\":58564,\"start\":58214},{\"attributes\":{\"id\":\"b12\",\"matched_paper_id\":8109998},\"end\":58707,\"start\":58566},{\"attributes\":{\"id\":\"b13\",\"matched_paper_id\":1713031},\"end\":58863,\"start\":58709},{\"attributes\":{\"id\":\"b14\",\"matched_paper_id\":3380834},\"end\":59156,\"start\":58865},{\"attributes\":{\"id\":\"b15\",\"matched_paper_id\":26150199},\"end\":59401,\"start\":59158},{\"attributes\":{\"id\":\"b16\",\"matched_paper_id\":15888974},\"end\":59706,\"start\":59403},{\"attributes\":{\"id\":\"b17\",\"matched_paper_id\":682727},\"end\":59992,\"start\":59708},{\"attributes\":{\"id\":\"b18\",\"matched_paper_id\":11814655},\"end\":60276,\"start\":59994},{\"attributes\":{\"id\":\"b19\",\"matched_paper_id\":3458513},\"end\":60587,\"start\":60278},{\"attributes\":{\"id\":\"b20\",\"matched_paper_id\":1324211},\"end\":60878,\"start\":60589},{\"attributes\":{\"id\":\"b21\"},\"end\":61244,\"start\":60880},{\"attributes\":{\"id\":\"b22\",\"matched_paper_id\":163021},\"end\":61618,\"start\":61246},{\"attributes\":{\"id\":\"b23\"},\"end\":61779,\"start\":61620},{\"attributes\":{\"id\":\"b24\",\"matched_paper_id\":16079616},\"end\":62069,\"start\":61781},{\"attributes\":{\"id\":\"b25\",\"matched_paper_id\":36728071},\"end\":62303,\"start\":62071},{\"attributes\":{\"id\":\"b26\",\"matched_paper_id\":3872341},\"end\":62741,\"start\":62305},{\"attributes\":{\"id\":\"b27\",\"matched_paper_id\":5319132},\"end\":63026,\"start\":62743},{\"attributes\":{\"id\":\"b28\",\"matched_paper_id\":2414137},\"end\":63341,\"start\":63028},{\"attributes\":{\"id\":\"b29\",\"matched_paper_id\":7428261},\"end\":63630,\"start\":63343},{\"attributes\":{\"id\":\"b30\",\"matched_paper_id\":14204955},\"end\":64003,\"start\":63632},{\"attributes\":{\"id\":\"b31\",\"matched_paper_id\":26704443},\"end\":64303,\"start\":64005},{\"attributes\":{\"id\":\"b32\",\"matched_paper_id\":122166830},\"end\":64456,\"start\":64305},{\"attributes\":{\"id\":\"b33\"},\"end\":64690,\"start\":64458},{\"attributes\":{\"id\":\"b34\",\"matched_paper_id\":560618},\"end\":64909,\"start\":64692},{\"attributes\":{\"id\":\"b35\",\"matched_paper_id\":11348668},\"end\":65227,\"start\":64911},{\"attributes\":{\"id\":\"b36\",\"matched_paper_id\":8589662},\"end\":65527,\"start\":65229},{\"attributes\":{\"id\":\"b37\",\"matched_paper_id\":7990117},\"end\":65754,\"start\":65529},{\"attributes\":{\"id\":\"b38\",\"matched_paper_id\":1366011},\"end\":66076,\"start\":65756},{\"attributes\":{\"id\":\"b39\",\"matched_paper_id\":9454415},\"end\":66521,\"start\":66078},{\"attributes\":{\"id\":\"b40\",\"matched_paper_id\":1756322},\"end\":66871,\"start\":66523},{\"attributes\":{\"id\":\"b41\",\"matched_paper_id\":6699749},\"end\":67175,\"start\":66873},{\"attributes\":{\"id\":\"b42\",\"matched_paper_id\":4966303},\"end\":67452,\"start\":67177},{\"attributes\":{\"id\":\"b43\",\"matched_paper_id\":1779661},\"end\":67585,\"start\":67454},{\"attributes\":{\"id\":\"b44\",\"matched_paper_id\":13846139},\"end\":67817,\"start\":67587},{\"attributes\":{\"id\":\"b45\",\"matched_paper_id\":15788112},\"end\":68057,\"start\":67819},{\"attributes\":{\"id\":\"b46\",\"matched_paper_id\":4697298},\"end\":68448,\"start\":68059},{\"attributes\":{\"id\":\"b47\"},\"end\":68887,\"start\":68450},{\"attributes\":{\"id\":\"b48\",\"matched_paper_id\":7312854},\"end\":69264,\"start\":68889},{\"attributes\":{\"id\":\"b49\",\"matched_paper_id\":8520803},\"end\":69563,\"start\":69266},{\"attributes\":{\"id\":\"b50\",\"matched_paper_id\":4320045},\"end\":69832,\"start\":69565},{\"attributes\":{\"id\":\"b51\",\"matched_paper_id\":2903064},\"end\":70121,\"start\":69834},{\"attributes\":{\"id\":\"b52\",\"matched_paper_id\":22076362},\"end\":70491,\"start\":70123},{\"attributes\":{\"id\":\"b53\",\"matched_paper_id\":512926},\"end\":70869,\"start\":70493},{\"attributes\":{\"id\":\"b54\",\"matched_paper_id\":1524747},\"end\":71206,\"start\":70871},{\"attributes\":{\"id\":\"b55\"},\"end\":71295,\"start\":71208},{\"attributes\":{\"id\":\"b56\",\"matched_paper_id\":2934551},\"end\":71790,\"start\":71297},{\"attributes\":{\"id\":\"b57\",\"matched_paper_id\":20925656},\"end\":72238,\"start\":71792},{\"attributes\":{\"id\":\"b58\",\"matched_paper_id\":1300841},\"end\":72592,\"start\":72240},{\"attributes\":{\"id\":\"b59\",\"matched_paper_id\":16649688},\"end\":72954,\"start\":72594},{\"attributes\":{\"id\":\"b60\",\"matched_paper_id\":12332799},\"end\":73275,\"start\":72956},{\"attributes\":{\"id\":\"b61\",\"matched_paper_id\":4286425},\"end\":73598,\"start\":73277},{\"attributes\":{\"id\":\"b62\",\"matched_paper_id\":24226567},\"end\":73894,\"start\":73600},{\"attributes\":{\"id\":\"b63\",\"matched_paper_id\":4853138},\"end\":74226,\"start\":73896},{\"attributes\":{\"id\":\"b64\",\"matched_paper_id\":29035966},\"end\":74520,\"start\":74228},{\"attributes\":{\"id\":\"b65\",\"matched_paper_id\":1126151},\"end\":74788,\"start\":74522},{\"attributes\":{\"id\":\"b66\",\"matched_paper_id\":632927},\"end\":75045,\"start\":74790},{\"attributes\":{\"id\":\"b67\",\"matched_paper_id\":155842},\"end\":75292,\"start\":75047},{\"attributes\":{\"id\":\"b68\",\"matched_paper_id\":531309},\"end\":75635,\"start\":75294},{\"attributes\":{\"id\":\"b69\",\"matched_paper_id\":35135614},\"end\":76019,\"start\":75637},{\"attributes\":{\"id\":\"b70\",\"matched_paper_id\":14488097},\"end\":76444,\"start\":76021},{\"attributes\":{\"id\":\"b71\",\"matched_paper_id\":2123763},\"end\":76842,\"start\":76446},{\"attributes\":{\"id\":\"b72\",\"matched_paper_id\":1870005},\"end\":77150,\"start\":76844},{\"attributes\":{\"id\":\"b73\",\"matched_paper_id\":14027217},\"end\":77491,\"start\":77152},{\"attributes\":{\"id\":\"b74\",\"matched_paper_id\":19006053},\"end\":77819,\"start\":77493},{\"attributes\":{\"id\":\"b75\",\"matched_paper_id\":12700766},\"end\":78355,\"start\":77821},{\"attributes\":{\"id\":\"b76\"},\"end\":78444,\"start\":78357}]", "bib_title": "[{\"end\":53865,\"start\":53830},{\"end\":54349,\"start\":54253},{\"end\":54789,\"start\":54656},{\"end\":55196,\"start\":55120},{\"end\":55608,\"start\":55503},{\"end\":55927,\"start\":55861},{\"end\":56391,\"start\":56324},{\"end\":56732,\"start\":56627},{\"end\":57113,\"start\":57005},{\"end\":57479,\"start\":57353},{\"end\":57868,\"start\":57780},{\"end\":58318,\"start\":58214},{\"end\":58594,\"start\":58566},{\"end\":58737,\"start\":58709},{\"end\":58954,\"start\":58865},{\"end\":59226,\"start\":59158},{\"end\":59481,\"start\":59403},{\"end\":59800,\"start\":59708},{\"end\":60088,\"start\":59994},{\"end\":60374,\"start\":60278},{\"end\":60666,\"start\":60589},{\"end\":61352,\"start\":61246},{\"end\":61864,\"start\":61781},{\"end\":62133,\"start\":62071},{\"end\":62414,\"start\":62305},{\"end\":62822,\"start\":62743},{\"end\":63148,\"start\":63028},{\"end\":63436,\"start\":63343},{\"end\":63710,\"start\":63632},{\"end\":64042,\"start\":64005},{\"end\":64343,\"start\":64305},{\"end\":64739,\"start\":64692},{\"end\":64989,\"start\":64911},{\"end\":65323,\"start\":65229},{\"end\":65592,\"start\":65529},{\"end\":65828,\"start\":65756},{\"end\":66126,\"start\":66078},{\"end\":66619,\"start\":66523},{\"end\":66971,\"start\":66873},{\"end\":67246,\"start\":67177},{\"end\":67467,\"start\":67454},{\"end\":67644,\"start\":67587},{\"end\":67870,\"start\":67819},{\"end\":68139,\"start\":68059},{\"end\":68978,\"start\":68889},{\"end\":69362,\"start\":69266},{\"end\":69652,\"start\":69565},{\"end\":69892,\"start\":69834},{\"end\":70231,\"start\":70123},{\"end\":70593,\"start\":70493},{\"end\":70966,\"start\":70871},{\"end\":71387,\"start\":71297},{\"end\":71898,\"start\":71792},{\"end\":72288,\"start\":72240},{\"end\":72683,\"start\":72594},{\"end\":73050,\"start\":72956},{\"end\":73341,\"start\":73277},{\"end\":73684,\"start\":73600},{\"end\":73995,\"start\":73896},{\"end\":74304,\"start\":74228},{\"end\":74574,\"start\":74522},{\"end\":74867,\"start\":74790},{\"end\":75113,\"start\":75047},{\"end\":75391,\"start\":75294},{\"end\":75737,\"start\":75637},{\"end\":76103,\"start\":76021},{\"end\":76551,\"start\":76446},{\"end\":76942,\"start\":76844},{\"end\":77256,\"start\":77152},{\"end\":77556,\"start\":77493},{\"end\":77910,\"start\":77821}]", "bib_author": "[{\"end\":53877,\"start\":53867},{\"end\":53886,\"start\":53877},{\"end\":53896,\"start\":53886},{\"end\":53907,\"start\":53896},{\"end\":54365,\"start\":54351},{\"end\":54375,\"start\":54365},{\"end\":54383,\"start\":54375},{\"end\":54397,\"start\":54383},{\"end\":54413,\"start\":54397},{\"end\":54427,\"start\":54413},{\"end\":54803,\"start\":54791},{\"end\":54810,\"start\":54803},{\"end\":54822,\"start\":54810},{\"end\":54834,\"start\":54822},{\"end\":55210,\"start\":55198},{\"end\":55224,\"start\":55210},{\"end\":55235,\"start\":55224},{\"end\":55244,\"start\":55235},{\"end\":55254,\"start\":55244},{\"end\":55270,\"start\":55254},{\"end\":55282,\"start\":55270},{\"end\":55624,\"start\":55610},{\"end\":55638,\"start\":55624},{\"end\":55651,\"start\":55638},{\"end\":55663,\"start\":55651},{\"end\":55939,\"start\":55929},{\"end\":55952,\"start\":55939},{\"end\":55963,\"start\":55952},{\"end\":55976,\"start\":55963},{\"end\":55988,\"start\":55976},{\"end\":55996,\"start\":55988},{\"end\":56007,\"start\":55996},{\"end\":56019,\"start\":56007},{\"end\":56033,\"start\":56019},{\"end\":56044,\"start\":56033},{\"end\":56054,\"start\":56044},{\"end\":56405,\"start\":56393},{\"end\":56414,\"start\":56405},{\"end\":56422,\"start\":56414},{\"end\":56435,\"start\":56422},{\"end\":56746,\"start\":56734},{\"end\":56757,\"start\":56746},{\"end\":56766,\"start\":56757},{\"end\":56774,\"start\":56766},{\"end\":56787,\"start\":56774},{\"end\":57127,\"start\":57115},{\"end\":57139,\"start\":57127},{\"end\":57150,\"start\":57139},{\"end\":57493,\"start\":57481},{\"end\":57509,\"start\":57493},{\"end\":57519,\"start\":57509},{\"end\":57530,\"start\":57519},{\"end\":57881,\"start\":57870},{\"end\":57892,\"start\":57881},{\"end\":57901,\"start\":57892},{\"end\":57910,\"start\":57901},{\"end\":57919,\"start\":57910},{\"end\":57931,\"start\":57919},{\"end\":57945,\"start\":57931},{\"end\":57954,\"start\":57945},{\"end\":57966,\"start\":57954},{\"end\":58327,\"start\":58320},{\"end\":58340,\"start\":58327},{\"end\":58354,\"start\":58340},{\"end\":58613,\"start\":58596},{\"end\":58756,\"start\":58739},{\"end\":58973,\"start\":58956},{\"end\":58986,\"start\":58973},{\"end\":59245,\"start\":59228},{\"end\":59256,\"start\":59245},{\"end\":59499,\"start\":59483},{\"end\":59520,\"start\":59499},{\"end\":59531,\"start\":59520},{\"end\":59810,\"start\":59802},{\"end\":59821,\"start\":59810},{\"end\":60098,\"start\":60090},{\"end\":60109,\"start\":60098},{\"end\":60384,\"start\":60376},{\"end\":60398,\"start\":60384},{\"end\":60409,\"start\":60398},{\"end\":60684,\"start\":60668},{\"end\":60697,\"start\":60684},{\"end\":60709,\"start\":60697},{\"end\":61006,\"start\":60990},{\"end\":61014,\"start\":61006},{\"end\":61026,\"start\":61014},{\"end\":61035,\"start\":61026},{\"end\":61046,\"start\":61035},{\"end\":61370,\"start\":61354},{\"end\":61379,\"start\":61370},{\"end\":61387,\"start\":61379},{\"end\":61398,\"start\":61387},{\"end\":61632,\"start\":61622},{\"end\":61642,\"start\":61632},{\"end\":61653,\"start\":61642},{\"end\":61878,\"start\":61866},{\"end\":61885,\"start\":61878},{\"end\":61897,\"start\":61885},{\"end\":62146,\"start\":62135},{\"end\":62153,\"start\":62146},{\"end\":62427,\"start\":62416},{\"end\":62441,\"start\":62427},{\"end\":62454,\"start\":62441},{\"end\":62468,\"start\":62454},{\"end\":62478,\"start\":62468},{\"end\":62489,\"start\":62478},{\"end\":62838,\"start\":62824},{\"end\":62845,\"start\":62838},{\"end\":62859,\"start\":62845},{\"end\":63160,\"start\":63150},{\"end\":63449,\"start\":63438},{\"end\":63460,\"start\":63449},{\"end\":63721,\"start\":63712},{\"end\":63730,\"start\":63721},{\"end\":63744,\"start\":63730},{\"end\":63754,\"start\":63744},{\"end\":63765,\"start\":63754},{\"end\":63775,\"start\":63765},{\"end\":63786,\"start\":63775},{\"end\":64057,\"start\":64044},{\"end\":64358,\"start\":64345},{\"end\":64557,\"start\":64548},{\"end\":64564,\"start\":64557},{\"end\":64752,\"start\":64741},{\"end\":64767,\"start\":64752},{\"end\":64773,\"start\":64767},{\"end\":65008,\"start\":64991},{\"end\":65029,\"start\":65008},{\"end\":65042,\"start\":65029},{\"end\":65331,\"start\":65325},{\"end\":65340,\"start\":65331},{\"end\":65351,\"start\":65340},{\"end\":65606,\"start\":65594},{\"end\":65617,\"start\":65606},{\"end\":65846,\"start\":65830},{\"end\":65859,\"start\":65846},{\"end\":65876,\"start\":65859},{\"end\":65887,\"start\":65876},{\"end\":66137,\"start\":66128},{\"end\":66152,\"start\":66137},{\"end\":66164,\"start\":66152},{\"end\":66173,\"start\":66164},{\"end\":66632,\"start\":66621},{\"end\":66643,\"start\":66632},{\"end\":66655,\"start\":66643},{\"end\":66665,\"start\":66655},{\"end\":66984,\"start\":66973},{\"end\":66994,\"start\":66984},{\"end\":67260,\"start\":67248},{\"end\":67269,\"start\":67260},{\"end\":67277,\"start\":67269},{\"end\":67289,\"start\":67277},{\"end\":67478,\"start\":67469},{\"end\":67488,\"start\":67478},{\"end\":67498,\"start\":67488},{\"end\":67659,\"start\":67646},{\"end\":67670,\"start\":67659},{\"end\":67883,\"start\":67872},{\"end\":67893,\"start\":67883},{\"end\":67903,\"start\":67893},{\"end\":68150,\"start\":68141},{\"end\":68164,\"start\":68150},{\"end\":68175,\"start\":68164},{\"end\":68185,\"start\":68175},{\"end\":68199,\"start\":68185},{\"end\":68207,\"start\":68199},{\"end\":68217,\"start\":68207},{\"end\":68544,\"start\":68534},{\"end\":68555,\"start\":68544},{\"end\":68567,\"start\":68555},{\"end\":68579,\"start\":68567},{\"end\":68590,\"start\":68579},{\"end\":68600,\"start\":68590},{\"end\":68610,\"start\":68600},{\"end\":68622,\"start\":68610},{\"end\":68634,\"start\":68622},{\"end\":68990,\"start\":68980},{\"end\":69002,\"start\":68990},{\"end\":69014,\"start\":69002},{\"end\":69020,\"start\":69014},{\"end\":69379,\"start\":69364},{\"end\":69395,\"start\":69379},{\"end\":69667,\"start\":69654},{\"end\":69678,\"start\":69667},{\"end\":69907,\"start\":69894},{\"end\":69917,\"start\":69907},{\"end\":69928,\"start\":69917},{\"end\":69939,\"start\":69928},{\"end\":69952,\"start\":69939},{\"end\":70245,\"start\":70233},{\"end\":70256,\"start\":70245},{\"end\":70266,\"start\":70256},{\"end\":70275,\"start\":70266},{\"end\":70607,\"start\":70595},{\"end\":70616,\"start\":70607},{\"end\":70628,\"start\":70616},{\"end\":70987,\"start\":70968},{\"end\":71002,\"start\":70987},{\"end\":71017,\"start\":71002},{\"end\":71227,\"start\":71210},{\"end\":71410,\"start\":71389},{\"end\":71421,\"start\":71410},{\"end\":71434,\"start\":71421},{\"end\":71445,\"start\":71434},{\"end\":71455,\"start\":71445},{\"end\":71477,\"start\":71455},{\"end\":71487,\"start\":71477},{\"end\":71499,\"start\":71487},{\"end\":71510,\"start\":71499},{\"end\":71919,\"start\":71900},{\"end\":71927,\"start\":71919},{\"end\":71938,\"start\":71927},{\"end\":71951,\"start\":71938},{\"end\":71962,\"start\":71951},{\"end\":71973,\"start\":71962},{\"end\":71986,\"start\":71973},{\"end\":72302,\"start\":72290},{\"end\":72313,\"start\":72302},{\"end\":72326,\"start\":72313},{\"end\":72337,\"start\":72326},{\"end\":72349,\"start\":72337},{\"end\":72360,\"start\":72349},{\"end\":72372,\"start\":72360},{\"end\":72383,\"start\":72372},{\"end\":72696,\"start\":72685},{\"end\":72706,\"start\":72696},{\"end\":72717,\"start\":72706},{\"end\":72729,\"start\":72717},{\"end\":72740,\"start\":72729},{\"end\":73063,\"start\":73052},{\"end\":73074,\"start\":73063},{\"end\":73086,\"start\":73074},{\"end\":73352,\"start\":73343},{\"end\":73365,\"start\":73352},{\"end\":73376,\"start\":73365},{\"end\":73387,\"start\":73376},{\"end\":73398,\"start\":73387},{\"end\":73409,\"start\":73398},{\"end\":73697,\"start\":73686},{\"end\":73713,\"start\":73697},{\"end\":74006,\"start\":73997},{\"end\":74017,\"start\":74006},{\"end\":74030,\"start\":74017},{\"end\":74039,\"start\":74030},{\"end\":74313,\"start\":74306},{\"end\":74322,\"start\":74313},{\"end\":74328,\"start\":74322},{\"end\":74341,\"start\":74328},{\"end\":74590,\"start\":74576},{\"end\":74601,\"start\":74590},{\"end\":74613,\"start\":74601},{\"end\":74877,\"start\":74869},{\"end\":74885,\"start\":74877},{\"end\":74896,\"start\":74885},{\"end\":75125,\"start\":75115},{\"end\":75134,\"start\":75125},{\"end\":75144,\"start\":75134},{\"end\":75405,\"start\":75393},{\"end\":75418,\"start\":75405},{\"end\":75426,\"start\":75418},{\"end\":75437,\"start\":75426},{\"end\":75751,\"start\":75739},{\"end\":75762,\"start\":75751},{\"end\":75773,\"start\":75762},{\"end\":75782,\"start\":75773},{\"end\":75795,\"start\":75782},{\"end\":76113,\"start\":76105},{\"end\":76124,\"start\":76113},{\"end\":76135,\"start\":76124},{\"end\":76561,\"start\":76553},{\"end\":76569,\"start\":76561},{\"end\":76578,\"start\":76569},{\"end\":76587,\"start\":76578},{\"end\":76598,\"start\":76587},{\"end\":76609,\"start\":76598},{\"end\":76957,\"start\":76944},{\"end\":77267,\"start\":77258},{\"end\":77278,\"start\":77267},{\"end\":77289,\"start\":77278},{\"end\":77567,\"start\":77558},{\"end\":77577,\"start\":77567},{\"end\":77590,\"start\":77577},{\"end\":77600,\"start\":77590},{\"end\":77612,\"start\":77600},{\"end\":77625,\"start\":77612},{\"end\":77931,\"start\":77912},{\"end\":77939,\"start\":77931},{\"end\":77949,\"start\":77939},{\"end\":77960,\"start\":77949},{\"end\":77973,\"start\":77960},{\"end\":77986,\"start\":77973},{\"end\":77999,\"start\":77986},{\"end\":78010,\"start\":77999},{\"end\":78021,\"start\":78010},{\"end\":78032,\"start\":78021},{\"end\":78043,\"start\":78032},{\"end\":78058,\"start\":78043},{\"end\":78376,\"start\":78359}]", "bib_venue": "[{\"end\":53985,\"start\":53907},{\"end\":54436,\"start\":54427},{\"end\":54871,\"start\":54834},{\"end\":55293,\"start\":55282},{\"end\":55671,\"start\":55663},{\"end\":56068,\"start\":56054},{\"end\":56459,\"start\":56435},{\"end\":56797,\"start\":56787},{\"end\":57161,\"start\":57150},{\"end\":57550,\"start\":57530},{\"end\":57976,\"start\":57966},{\"end\":58372,\"start\":58354},{\"end\":58623,\"start\":58613},{\"end\":58773,\"start\":58756},{\"end\":58996,\"start\":58986},{\"end\":59266,\"start\":59256},{\"end\":59541,\"start\":59531},{\"end\":59836,\"start\":59821},{\"end\":60120,\"start\":60109},{\"end\":60419,\"start\":60409},{\"end\":60719,\"start\":60709},{\"end\":60988,\"start\":60880},{\"end\":61418,\"start\":61398},{\"end\":61910,\"start\":61897},{\"end\":62171,\"start\":62153},{\"end\":62503,\"start\":62489},{\"end\":62869,\"start\":62859},{\"end\":63174,\"start\":63160},{\"end\":63473,\"start\":63460},{\"end\":63801,\"start\":63786},{\"end\":64134,\"start\":64057},{\"end\":64368,\"start\":64358},{\"end\":64546,\"start\":64458},{\"end\":64785,\"start\":64773},{\"end\":65053,\"start\":65042},{\"end\":65362,\"start\":65351},{\"end\":65627,\"start\":65617},{\"end\":65900,\"start\":65887},{\"end\":66286,\"start\":66173},{\"end\":66680,\"start\":66665},{\"end\":67010,\"start\":66994},{\"end\":67299,\"start\":67289},{\"end\":67504,\"start\":67498},{\"end\":67688,\"start\":67670},{\"end\":67921,\"start\":67903},{\"end\":68237,\"start\":68217},{\"end\":68532,\"start\":68450},{\"end\":69030,\"start\":69020},{\"end\":69401,\"start\":69395},{\"end\":69684,\"start\":69678},{\"end\":69959,\"start\":69952},{\"end\":70289,\"start\":70275},{\"end\":70666,\"start\":70628},{\"end\":71023,\"start\":71017},{\"end\":71237,\"start\":71227},{\"end\":71524,\"start\":71510},{\"end\":72000,\"start\":71986},{\"end\":72392,\"start\":72383},{\"end\":72756,\"start\":72740},{\"end\":73100,\"start\":73086},{\"end\":73419,\"start\":73409},{\"end\":73731,\"start\":73713},{\"end\":74047,\"start\":74039},{\"end\":74358,\"start\":74341},{\"end\":74639,\"start\":74613},{\"end\":74901,\"start\":74896},{\"end\":75155,\"start\":75144},{\"end\":75449,\"start\":75437},{\"end\":75809,\"start\":75795},{\"end\":76216,\"start\":76135},{\"end\":76624,\"start\":76609},{\"end\":76983,\"start\":76957},{\"end\":77307,\"start\":77289},{\"end\":77636,\"start\":77625},{\"end\":78064,\"start\":78058},{\"end\":78386,\"start\":78376},{\"end\":54050,\"start\":53987}]"}}}, "year": 2023, "month": 12, "day": 17}