{"id": 36014877, "updated": "2022-03-07 21:42:26.483", "metadata": {"title": "Internet privacy concerns and their antecedents - measurement validity and a regression model", "authors": "[{\"first\":\"Tamara\",\"last\":\"Dinev\",\"middle\":[]},{\"first\":\"Paul\",\"last\":\"Hart\",\"middle\":[]}]", "venue": null, "journal": "Behaviour & Information Technology", "publication_date": {"year": 2004, "month": null, "day": null}, "abstract": "This research focuses on the development and validation of an instrument to measure the privacy concerns of individuals who use the Internet and two antecedents, perceived vulnerability and perceived ability to control information. The results of exploratory factor analysis support the validity of the measures developed. In addition, the regression analysis results of a model including the three constructs provide strong support for the relationship between perceived vulnerability and privacy concerns, but only moderate support for the relationship between perceived ability to control information and privacy concerns. The latter unexpected results suggest that the relationship among the hypothesized antecedents and privacy concerns may be one that is more complex than is captured in the hypothesized model, in light of the strong theoretical justification for the role of information control in the extant literature on information privacy.", "fields_of_study": "[\"Computer Science\"]", "external_ids": {"arxiv": null, "mag": "2151370135", "acl": null, "pubmed": null, "pubmedcentral": null, "dblp": "journals/behaviourIT/DinevH04", "doi": "10.1080/01449290410001715723"}}, "content": {"source": {"pdf_hash": "7bee0c915ae6986267341631f7de19c9b3b049ae", "pdf_src": "TaylorAndFrancis", "pdf_uri": null, "oa_url_match": false, "oa_info": null}, "grobid": {"id": "7111b706dfdc13b6270c0df667cf6f947999532d", "type": "plain-text", "url": "s3://ai2-s2-pdf-extraction-prod/parse-results/s2orc_worker/7bee0c915ae6986267341631f7de19c9b3b049ae.txt", "contents": "\nInternet privacy concerns and their antecedents - measurement validity and a regression model\n\n\nTamara Dinev tdinev@fau.edu \nDepartment of Information Technology and Operations Management\nCollege of Business\nFlorida Atlantic University\n777 Glades Road33431Boca RatonFLUSA\n\nPaul Hart \nDepartment of Information Technology and Operations Management\nCollege of Business\nFlorida Atlantic University\n777 Glades Road33431Boca RatonFLUSA\n\nInternet privacy concerns and their antecedents - measurement validity and a regression model\n10.1080/01449290410001715723\nThis research focuses on the development and validation of an instrument to measure the privacy concerns of individuals who use the Internet and two antecedents, perceived vulnerability and perceived ability to control information. The results of exploratory factor analysis support the validity of the measures developed. In addition, the regression analysis results of a model including the three constructs provide strong support for the relationship between perceived vulnerability and privacy concerns, but only moderate support for the relationship between perceived ability to control information and privacy concerns. The latter unexpected results suggest that the relationship among the hypothesized antecedents and privacy concerns may be one that is more complex than is captured in the hypothesized model, in light of the strong theoretical justification for the role of information control in the extant literature on information privacy.\n\nIntroduction\n\nPrivacy has been a topic of interest to researchers in a number of disciplines including psychology (e.g. Kelvin 1973) and sociology (e.g. Etzioni 1999). However, in recent years, the explosive growth of information technology has fuelled debate about threats to privacy and, in particular, attracted the attention of information systems researchers. Prominent examples include the work of Mason (1986), Smith (1993), Culnan (1993Culnan ( , 1995, Milberg et al. (1995), Smith et al. (1996), Culnan and Armstrong (1999), Stewart and Segars (2002).\n\nWhile we believe that interest in information privacy would have remained strong, the events of September 11th and the US government's initiatives to increase homeland security may prove to be an important catalyst in fuelling the debate about privacy protection for citizens of the USA (Johnston and van Natta 2001, Toner and Lewis 2001, Toner 2001, of European countries (Hoge 2001) and of other countries as well. This debate, in turn, could generate even more interest on the part of researchers over time.\n\nThe focus of the research reported here is on the antecedents to privacy concerns of individuals who use the Internet. Identifying the predictors of withholding or surrendering personal information when using the Internet is important for researchers interested in exploring the complexity of user behaviour when browsing for information and conducting transactions on the web. This research has further implications for managers seeking to encourage online shopping. In this paper we report on the development and validation of an instrument to measure privacy concerns and two antecedents, perceived vulnerability and perceived ability to control information. In addition, we use a linear regression model to explore hypothesized relationships among model constructs.\n\n\nA theoretical model of privacy concerns\n\nIncrease in concern over protecting privacy has parallelled the development of digital network and storage technologies. The extant literature on information privacy can be differentiated by the focal parties engaged in information exchange. For example, one strand of research focuses on the exchange of information between employees and an organization. Employee perceptions of privacy values and beliefs have been examined across different types of organizations, and the consequences of different regulatory approaches have been investigated (Kelvin 1973, Tolchinsky et al. 1981, Stone et al. 1983, Milberg et al. 1995, Smith et al. 1996, Milberg et al. 2000.\n\nAnother strand of research focuses on the exchange of information between consumers and corporations. Indeed, in recent years, the primary threat to privacy has been attributed to large corporations (e.g. banks, lending institutions, credit card, marketing, and insurance companies) that use information technologies to improve efficiencies and extend market scope. These issues have been addressed in theoretical and empirical research (e.g. Mason 1986, McCrohan 1989, Jones 1991, Culnan 1993, 1995, Rindfleish 1997, Thomas and Mauer 1997, Clarke 1998, Culnan and Armstrong 1999, Petty 2000, Phelps et al. 2000.\n\nMore recently, another strand, or sub-strand, of research has emerged which focuses on the exchange of information between Internet users and Internet goods, services, and information providers. Most of the research to date has focused on providers in the private sector. However, there is every reason to believe that in the future, researchers will be increasingly interested in interactivity with websites supported by government agencies, non-profit organizations, and shared-interest groups as well. Culnan (2000) and Miyazaki and Fernandez (2000) examined Internet retail disclosures and self-regulatory practices. Their findings were consistent with arguments by Milberg et al. (2000) about the viability of the selfregulatory mechanisms. In addition, they found that the privacy policies and adherence to them vary across industries. Sheehan and Hoy (2000) conducted an e-mail survey to examine dimensions of privacy concerns among online users. Phelps et al. (2000) examined privacy concerns and the consumer willingness to provide personal information. Their study addresses the trade-offs consumers are willing to make when they exchange personal information for shopping benefits. However, the study focuses on traditional direct marketing channels rather than the Internet.\n\nIncreasingly, Internet users are becoming aware of the power of Internet technologies to monitor user behaviour and to gather information about them without their knowledge. Some users might develop concerns and suspicions, sometimes unwarranted, about the 'hidden' or undisclosed purposes of free software applications or websites, which claim to facilitate their browsing experience. These concerns might inhibit interactivity resulting in more limited information exchange and aversion to experimenting with new applications and/or web sites. Indeed, privacy and the requirement to submit personal data are the primary factors that discourage users from shopping online. Only one out of three initiated online shopping procedures result in actual purchases, primarily due to the reluctance of individuals to submit personal information via the Internet (UCLA 2000(UCLA , 2001(UCLA , 2002.\n\nSimilarly, 70% of US consumers do not register at web sites primarily because of privacy concerns and 70% are more concerned about providing information through websites compared to the telephone or e-mail (BCG 1998).\n\nThe model we tested proposes to understand the underlying antecedents to privacy concerns, namely perceived vulnerability and perceived ability to control submitted personal information when using the Internet (figure 1). These two factors account for the amount of privacy concerns users develop when determining whether to disclose personal information. They are related to a 'privacy calculus' that is, an assessment individuals make 'that their personal information will subsequently be used fairly and they will not suffer negative consequences' (Culnan and Armstrong 1999: 106). When individuals perceive that information will not be used fairly and that there will be negative consequences, they will be less likely to engage in Internet activities that require information disclosure. In other words, individuals with high privacy concerns will seek to minimize their vulnerability by limiting Internet interactivity.\n\nThe relationships between the two antecedents in our model and privacy concerns are based on definitions of privacy that have emerged among scholars from a range of disciplines, including social psychology (e.g. Kelvin 1973, Laufer and Wolfe 1977, Margulis 1977, Goodwin 1991 and social domains, including US law and everyday speech. The following common-core definition of privacy, consistent with a variety of approaches, has been proposed by Margulis (1977: 10): 'Privacy represents the control of transactions between person(s) and other(s), the ultimate aim of which is to enhance autonomy and/or minimize vulnerability'. Two constructs are embedded in this definition and are common throughout the literature: (1) the notion of vulnerability and (2) individual control over disclosure of personal information (Shils 1966, Westin 1967, Johnson 1974. This definition has been addressed in many studies and argued upon. Many authors reason that control and vulnerability are actually factors, among others, that shape privacy and that privacy is not control and vulnerability per se (see Margulis, 2003a,b). Rather, they consider control and vulnerability as factors which determine privacy state, although not exclusively. In this existing polemics we found enough justification to consider in our study control and vulnerability as separate factors, and to empirically test a model in which control and vulnerability are antecedents to the construct of privacy. Below, we present the theoretical foundation of the control and vulnerability constructs, and their relationship with privacy concerns, and the resulting hypotheses.\n\nThe notion of vulnerability emerges from the complex definition of privacy. It describes the perceived potential risk when personal information is revealed (Raab and Bennett 1998) and has been considered in the literature as a factor which determines the perceived state of privacy and individual experiences (Fusilier and Hoyer 1980, Petronio 1991, Petronio 2002. Because others may seek to use information to advance their own goals in ways that may have negative consequences for an individual, one's ability to maintain one's privacy implies an antagonism between the individual and others (Kelvin 1973). Expressing this antagonism, vulnerability is the perceived possible negative consequence of disclosure. Individuals who experience a positive outcome (e.g., a job offer) as a result of information disclosure, perceive less privacy invasion than those who did not experience a positive outcome (Fusilier and Hoyer 1980). In other words, perception of the outcome of information disclosure determines privacy concerns. Moreover, this perception of vulnerability might vary over time and thus be dependent on any given individual's experience.\n\nInternet users are exposed to a risk of misuse and abuse of personal information that might raise the perception of vulnerability. Unauthorized access to information can be caused by any number of factors including: accidental disclosure, insider curiosity, insider subordination, unauthorized access, hacking into computer systems, security defects, scams (i.e. fraudulent web sites established for the purpose of obtaining information and money), and uncontrolled secondary usage of personal data (Rindfleish 1997). Because of these potential breaches of security, consumers risk several types of privacy invasions, including 'identity theft' (Saunders and Zucker 1999). Another type of vulnerability, involves the surreptitious collection of consumer information and consumer profiling (Budnitz 1998, FTC Report 1999. According to Culnan (2000), while 67% of the web sites post privacy disclosure, only 14% of these disclosures constitute comprehensive and fair privacy practices and policies. Similar results have been reported by Miyazaki and Fernandez (2000), with substantial differences across product categories. All these factors contribute to increasingly perceived vulnerability among Internet users, and thus, increased privacy concerns:\n\nHypothesis 1: There is a positive relationship between perceived vulnerability and privacy concerns.\n\nThe ability of the consumer to control submitted personal information offsets the risk of possible negative consequences. Privacy has sometimes been defined as the right to disclose information about oneself (Westin 1967). Thus, the ability to withhold information from being disclosed is a condition of that right. Technology and procedures that disallow the ability to control how or when information is disclosed can be viewed as an impediment to the execution of that right.\n\nThe definition offered by Margulis (1977), mentioned above, states that privacy involves the 'control of transactions' which would include information exchange. Control allows individuals to determine the impressions others form about them (Goffman 1963). Control is possible through limiting self-disclosure (Derlega and Chaikin 1977) or by determining how information disclosed will be used (Stone and Stone 1990). Individuals perceive information disclosure as less privacy-invasive when, among other things, they believe that they will be able to control future use of the information and that the information will be used to draw accurate inferences about them (Culnan and Armstrong 1999). When control is not allowed or when the future use of information is not known, individuals resist disclosure. Culnan and Armstrong (1999) have argued that when procedural fairness (Lind and Tyler 1988) is applied to privacy practices in consumer marketing, individuals are more likely to assess that there will not be negative consequences in disclosing information. Thus, the result of the 'privacy calculus' is in favour of information disclosure. Procedural fairness refers to 'the perception by the individual that a particular activity in which they are participating is conducted fairly' (Culnan and Armstrong 1999: 107). They operationalized fairness in terms of procedures that provided individuals with control over disclosure and subsequent use of personal information. They found that when individuals were not informed about fair procedures, they were less willing to have personal information used. They also found that when individuals were informed about fair procedures, privacy concerns did not distinguish individuals who were willing from those who were unwilling to have personal information used. In other words, privacy concerns washed out.\n\nOther researchers reported similar findings. The ability to control information collection and use by third parties are not just a concern among online consumers (Sheehan and Hoy 2000) but a factor influencing the consumers' purchasing decisions (Phelps et al. 2000). Consumers find it unacceptable that the information about them is being collected without their consent (Nowak and Phelps 1995) and that marketers sell information about them Phelps 1992, Milne 2000). Cespedes and Smith (1993) found that use of consumer data without permission was viewed as an invasion of consumer privacy and that secondary usage of personal information potentially causes strenuous consumer objection (Wang and Petrison 1993). One survey indicated that 81% of the respondents 'believe that consumers have lost all control on how personal information about them is circulated and used' (Budnitz 1998). For this reason many (as much as 50%) consumers provide false information when asked to register at a web site or fill in surveys (Greenman 1999, BCG 1998.\n\nTo summarize the findings above, if people have a greater sense that they control the use of their information, they will have fewer privacy concerns. Although many researches have equated privacy concerns with control, there is ample evidence in the literature that points towards the fact that privacy is more than control, and control may be one of the variables that mediate privacy. Indeed, Laufer and Wolfe (1977), posit that while it is essential to consider the idea of control as a dimension of privacy, control is a major factor in many other issues in a highly individualized society such as the American society. They conceptualize control as a mediating variable in the privacy system. They argue that a situation is not necessarily a privacy situation simply because the individual has control. Conversely, the individual may not perceive he or she has a control, yet the environmental and interpersonal elements may create perception of privacy. Similar arguments have been advanced by Stone et al. (1983) and Stone and Stone (1990) where they introduce control as one of the privacy-related factors.\n\nThese considerations suggest that the ability to control personal information is a separate construct from privacy concerns, and that the two constructs are related. In this study, we develop a separate measurement for the perceived ability to control personal information and hypothesize that it is an antecedent to privacy concerns. Therefore, we advanced the following.\n\nHypothesis 2: There is a negative relationship between perceived ability to control and privacy concerns.\n\n\nMethodology and instrument development\n\nThe research model was empirically tested using data collected from a survey. Participants were asked to fill in the survey consisting exclusively of questions, and choose what they believe was the best answer out of the provided Likert range. All items used were based on a 5-point Lickert scale. The development of the scales for the constructs considered in this study was initiated by examining prior work on similar constructs. The instruments existing in the literature, could not be readily applied to our study but provided an important guidance and base to build on. Following the best practices in scale development, we cast a wide net in identifying candidate items. Observing the trends in general survey data, following the analyses in the professional and popular literature, while reflecting on the underlying theory, we constructed an initial set of items. Privacy concerns items construction was based on the classic privacy concerns instruments developed by Smith et al. (1996) and further refined by Culnan and Armstrong (1999). Modification of the existing instruments were needed to reflect the specificity of the Internet, and to avoid capturing unrelated to our study set of beliefs about organizational policies, general computer anxiety, etc. The development of the control variable's items was guided by the need to extract this component from the previous privacy concerns' instruments mentioned above. The items for perceptions of vulnerability were developed by the authors based on the theoretical definitions given in the previous section.\n\nTwo pilot tests were conducted to develop the measures and these were followed by a broader survey. The first pilot test was conducted among a sample of 60 undergraduate MIS students, 15 MIS graduate students, seven employees at a banking institution, and 15 employees at a large retail store. After conducting exploratory factor analysis, reliability testing, and a careful examination of the correlations, several items were deleted, new items were added, and word modifications were made to many items resulting in an extensively revised instrument that warranted further testing.\n\nThe second pilot test was conducted among a sample of 70 undergraduate students. After careful consideration of the relevance of the items with respect to the constructs they measure, their face validity, as well as their corrected item -total correlations, some item were deleted from the instrument. Upon second examination they were found that they do not logically correlate with the rest of the items, as was also indicated by their low corrected item -total correlation. Following the same appropriate tests for data, purification of the instrument continued until the loading of the items and their validity was consistent and at satisfactory levels.\n\nThe final version of the survey was administered to a broad sample of individuals in the southeast including undergraduate and graduate students of a large university, employees of four local public schools, one large and one small high-tech company, one banking institution, three small retail and service businesses, as well as direct mailing to one neighbourhood. The response rate was 40%. The respondent profile of the final survey is presented in table 1. As seen from the demographics distribution, the sample is diverse, comprising a wide range of age, employment, education, and race, with equal representation of genders. The respondents are a heterogeneous group that may approximate a representative sample of a large population.\n\n\nExploratory factor analysis\n\nExploratory Factor Analysis (EFA) is a classical approach for establishing construct validity (Bagozzi et al. 1991). The potential latent sources of variance in the indicators can be discovered through EFA -items which adequately measure a latent variable should exhibit high factor loadings on that latent variable and small factor loadings on other latent variables that are measured by a different set of indicators. Such results provide an evidence of convergent and discriminant validity of the items (Segars and Grover 1993). Convergent validity indicates the extent to which different measures refer to the same conceptual construct. Discriminant validity assesses the extent to which the measure is adequately distinguishable from related constructs within the nomological net.\n\nThe primary goal of the Exploratory Factor Analysis (EFA) was to initially test the applicability and validate the proposed instrument. Reliability tests using Cron-bach's alpha coefficients were used to assess the internal consistency of the scale items for each construct. In all cases, the coefficients were above 0.78 -much higher than the threshold level of 0.6 suggested for exploratory research (Nunnally 1978). The corrected item -total correlations which provide initial indications for reliability (Churchill 1979) were also high for most of the items.\n\nThe next stage of instrument validation was establishing convergent and discriminant validity of the items through EFA and by examining the correlations among all items of all constructs. Factor analysis with Varimax rotation and Kaiser normalization was utilized to make the initial assessment of the constructs' adequacy. All indicators loaded on the latent variables they were intended to measure, with insignificant cross-loadings of items. This ensures the face and content validity of the instrument. Furthermore, most of the factor loadings range between 0.7 and 0.9, as shown in tables 2, 3, and 4. In addition, all inter-item correlations were examined for further verification of discriminant validity. The values of the correlations between items measuring different constructs were significantly lower than the correlations between the items measuring one and the same construct. These results suggest that both discriminant and convergent validity were established through the classical EFA approach.\n\nTables 2, 3, and 4 list the full set of questions that were used in the final survey for each construct described in this study. A total of 26, they present the final sets of measurement of the privacy concernsabuse (4 items) and finding (10 items), control (4 items), and vulnerability (8 items) variables. Table 2 lists the items for the privacy concerns construct. As evident from the factor loadings, the items load into two clearly defined factors. After closer examination of the items, we identified the two dimensions as privacy concerns for information finding (below referred as 'finding') and privacy concerns for information abuse (below referred as 'abuse'). The items for perceived vulnerability and perceived ability to control are listed in tables 3 and 4, respectively.\n\n\nRegression models and testing of hypotheses\n\nOnce the measurements for the three constructs were validated following Exploratory Factor Analysis (EFA) techniques, we proceeded with hypothesis testing. This was accomplished by examining the standardized beta coefficients and the statistical significance of the relationships among the constructs, with privacy concerns constructs being the dependent variables. Examination of Pearson correlations revealed that the two privacy concerns constructs, FINDING and ABUSE, were correlated -although the results of the factor analysis, described above, indicated there were also distinct constructs. This required retesting the regression models. Thus two sets of two regression models were run. The first set included two regression models for each of the dependent variables, FINDING and ABUSE, respectively, with only the hypothesized relationships (CONTROL and VULNERABILITY as antecedents) considered. The results are indicated in table 5. The second set of regression models, again each with FINDING and ABUSE, respectively, as dependent variables, was run with the alternative privacy concerns construct included as an independent variable. For example, if a regression model is run with FINDING as dependent variable, the set of independent variables includes CONTROL, VULNERABILITY, and ABUSE. The analysis reported in table 6 was undertaken to parse the independent influence of each construct on the respective dependent variable.\n\n\nDiscussions and limitations\n\nThe purpose of this research was to develop, test, and validate measurement instruments for Internet privacy concerns, perceived ability to control submitted information and perceived vulnerability. An Exploratory Factor Analysis paradigm was used. In addition, relationships between these constructs were hypothesized and empirically tested -whether perceived vulnerability and perceived ability to control personal information submitted when using the Internet were antecedents to privacy concerns.\n\nThe results of the study, as reported here, validated the proposed instruments with high factor loadings and Cronbach's alpha which confirms the validity and reliability of the proposed instruments. In addition, two distinct privacy concerns constructs emerged from the factor analysis. A statistically significant relationship proved to exist between them, as exhibited by the Pearson correlation and the Beta regression coefficient. This suggests that users associate privacy concerns based on information access and privacy concerns based on information abuse. One possible interpretation may be that individuals believe that so long as personal information can be found on the Internet, the potential for abuse of that personal information is high. To the extent that this interpretation may be true, it surely reflects a negative assessment about the availability of personal information to be found on the Internet.\n\nThe findings provide empirical support of the propositions in this study that control and vulnerability are indeed separate constructs from privacy. The extensive Exploratory Factor Analysis and the psychometric characteristics of the constructs (as shown in tables 2, 3, and 4) show that the latent variables of the  study are distinguishable, conceptually different constructs which measure certain psychological dispositions and states of an individual using the Internet. Moreover, the analysis showed two distinguishable factors of privacy concerns -one for information finding and one for information abuse. All these well defined, validated, and conceptually and empirically clear factors -control, vulnerability, information privacy concerns and abuse privacy concerns -are related and form a complex nomological net, as stated in the hypotheses. The findings reported in the previous section suggest partial support for the relationships described in the hypotheses and specified in the research model. As shown in tables 5 and 6, some of the relationships indicated in the hypotheses are statistically significant.\n\nThe first hypothesis focused on the relationships between perceived vulnerability and privacy concerns. The statistically significant standardized beta coefficients for vulnerability and privacy concerns about information finding (FINDING) and information abuse (ABUSE) are 0.39 and 0.35 respectively (table 5), suggesting support for these relationships. However, the standardized beta coefficients for ability to control and the two privacy concerns constructs were not statistically significant. These results will be discussed in the subsequent paragraphs.\n\nThe first set of regression models (for the two privacy constructs) run on the basis of the hypothesized relationships yielded a low R 2 of 0.15 for FINDING and 0.13 for ABUSE. Upon examining early indicators of statistical significance, such as Pearson correlations, we found a strong correlation between the two privacy constructs -FINDING and ABUSE. Although different, their correlations are statistically significant (p 5 0.01). Therefore, each privacy construct was a good candidate to be included as an independent variable in each regression model. Thus a second set of regression models were run with the alternative privacy construct included as an independent variable, along with VULNERABILITY and CONTROL. The second set of regression models, shown in table 6, shows that both models yielded a much higher R 2 and provides a better fit for the data.\n\nWith the modified regression models, support for the two hypotheses has not changed. The standardized beta coefficients for the relationship between perceived vulnerability and FINDING and ABUSE are 0.23 and 0.15, respectively, and they are both statistically significant (p 5 0.01). The relationships between FIND-ING and ABUSE are at strong 0.48 and 0.50, respectively, and statistically significant at the same level. The fact that the standardized beta coefficients for perceived vulnerability decreased from 0.39 and 0.35 (for the first set of models) to 0.23 and 0.15 (for the second set of models) is due to the masking effect of the stronger relationship of a non-present independent variable, in this case, the alternative privacy construct, in the first set of regression models.\n\nAn unexpected result of the analysis was the statistically non-significant relationship between the perceived ability to control submitted information and either of the privacy constructs. Given the strong theoretical justification supporting the relationship, this finding calls for further analysis and data collection. More rigorous statistical analysis may allow us to better understand and explain these relationships. Because 'control of transactions' is embedded in the definition of privacy, our findings have to be addressed with great caution but at the same time cannot be ignored because of the strong instrument validity and fit of the data.\n\nOne possible explanation is that the relationship is not simple. Perceived ability to control may indeed have no effect on the level of an individual's privacy concerns. It is probable that, while unidimensionality of the ability to control construct has been established, other dimensions have also been captured by the indicators. A distinction between the perceived need to have control over information and the actual perception that he or she indeed has control should be investigated in further studies. Perceived need to control information may have been captured to greater extent by the privacy concerns constructs because of the strong interdependence of the two variables, FINDING and ABUSE.\n\nIt should be noted also that the construct we are measuring is privacy concerns rather than privacy per se. As in most empirical studies, the phenomenon is operationalized indirectly rather than directly (i.e. through testing privacy concerns rather than privacy itself). While the definition of privacy embeds the control of transactions as integral part of the privacy construct, in our study we considered the construct of control of transaction as a separate construct that is distinct from privacy concerns. Thus the focus of the importance of control of transactions has to be on the privacy concerns. Therefore, our findings do not suggest a need to rewrite the definition of privacy. Rather, they point out that the perceived ability to control information may not be a major factor in mitigating privacy concerns when Internet transactions are involved.\n\nAs with most empirical studies, a limitation of this study is the sample size and spectrum of respondents. Even though we made a concerted effort to include a range of different individuals representing different social groups of Internet users, the sample is limited to a certain geographical region of USA, and therefore suffers generalizability. A statistically random sample would have increased confidence in our results.\n\nLastly, other factors, such as trust may play an important role in mediating the control -privacy relationship. This, in turn, would suggest that the there are more antecedents to Internet use and privacy concerns that are not captured in our theoretical model. This limitation is an argument that the antecedents to privacy concerns and their relationships to Internet use involve a complex pattern of perceptions and behaviours. Therefore, these findings also suggest the need for further empirical investigation of privacy and Internet use.\n\nFigure 1 .\n1Model of antecedents to Internet privacy concerns.\n\nTable 1 .\n1Descriptive statistics of survey respondents (n = 369)Gender \nMale \n172 (46.6%) \nFemale \n197 (53.4%) \nRace \nWhite \n193 (52.3%) \nBlack \n64 (17.3%) \nHispanic \n65 (17.6%) \nOther \n47 (12.7%) \nAge \n5 20 years \n13 (3.5%) \n21 -30 years \n245 (66.4%) \n31 -40 years \n73 (19.8 %) \n4 40 years \n38 (10.3 %) \nEducation \nHigh School \n261 (70.7%) \n4 year college degree \n67 (18.2%) \nGraduate degree \n41 (11.1%) \nIncome \n5 $60,000 \n257 (70.0%) \n$61,001 -$100,000 \n70 (19.0%) \n4 $100,000 \n33 (8.9%) \nUndisclosed \n9 (2.1%) \n\n\nTable 4 .\n4Reliability statistics for perceived ability to control information (CONTROL)Alpha Item \n\n\nTable 6 .\n6Standardized beta coefficients and R 2 for privacy concerns with perceived vulnerability, perceived ability to control, and the alternative privacy constructs as independent variablesDependent variable \nFINDING \nABUSE \nIndependent variable \nR 2 = 0.36 \nR 2 = 0.33 \n\nCONTROL \nNS \nNS \nVULNERABILITY \n0.23** \n0.15** \nFINDING \n-\n0.50** \nABUSE \n0.48** \n-\n\n*p 5 0.05. **p 5 0.01. NS -Not statistically significant. \n\n\nAssessing construct validity in organizational research. R P Bagozzi, Y Yi, L W Phillips, Administrative Science Quarterly. 36BAGOZZI, R. P., YI, Y., PHILLIPS, L. W. 1991, Assessing construct validity in organizational research. Administrative Science Quarterly, 36, 421 -458.\n\nBoston Bcg, Consulting Group, Shop.org/BCG Survey of online customer. BCG, BOSTON CONSULTING GROUP, 1998, Shop.org/BCG Survey of online customer, http://www.bcg.com.\n\nPrivacy protection for consumer transactions in electronic commerce: why self-regulation is inadequate. M E Budnitz, South Carolina Law Review. 49BUDNITZ, M. E. 1998, Privacy protection for consumer transactions in electronic commerce: why self-regulation is inadequate. South Carolina Law Review, 49, 847 -886.\n\nDatabase marketing: new rules for policy and practice. F V Cespedes, H J Smith, Sloan Management Review. 34CESPEDES, F. V. and SMITH, H. J. 1993, Database marketing: new rules for policy and practice. Sloan Management Review, 34, 7 -22.\n\nA paradigm for developing better measures for marketing constructs. G A Churchill, Jr, Journal of Marketing Research. 16CHURCHILL, G. A. JR. 1979, A paradigm for developing better measures for marketing constructs. Journal of Marketing Research, 16, 64 -73.\n\nInformation technology and dataveillance. R A Clarke, Communications of the ACM. 31CLARKE, R. A. 1998, Information technology and dataveil- lance. Communications of the ACM, 31, 498 -512.\n\nHow did they know my name?' An exploratory investigation of consumer attitudes toward secondary information use. M J Culnan, MIS Quarterly. 17CULNAN, M. J. 1993, 'How did they know my name?' An exploratory investigation of consumer attitudes toward secondary information use. MIS Quarterly, 17, 341 -363.\n\nConsumer awareness of name removal procedures: implications for direct marketing. M J Culnan, Journal of Direct Marketing. 9CULNAN, M. J. 1995, Consumer awareness of name removal procedures: implications for direct marketing. Journal of Direct Marketing, 9, 10 -19.\n\nProtecting privacy online: is selfregulation working. M J Culnan, Journal of Public Policy & Marketing. 19CULNAN, M. J. 2000, Protecting privacy online: is self- regulation working? Journal of Public Policy & Marketing, 19, 20 -29.\n\nInformation privacy concerns, procedural fairness, and impersonal trust: an empirical investigation. M J Culnan, Armstrong , P K , Organization Science. 10CULNAN, M. J. and ARMSTRONG, P. K. 1999, Information privacy concerns, procedural fairness, and impersonal trust: an empirical investigation. Organization Science, 10, 104 - 115.\n\nPrivacy and self-disclosure in social relationships. V Derlega, A Chaikin, The Limits of Privacy. New YorkBasic Books33102. ETZIONI, A. 1999DERLEGA, V. and CHAIKIN, A. 1977, Privacy and self-disclosure in social relationships. Journal of Social Issues, 33, 102. ETZIONI, A. 1999, The Limits of Privacy (New York: Basic Books).\n\nSelf-Regulation and privacy online. FTC. Report to CongressFTC, 1999, Self-Regulation and privacy online, Report to Congress.\n\nVariables affecting perceptions of invasion of privacy in a personnel selection situation. M R Fusilier, W D Hoyer, Journal of Applied Psychology. 65FUSILIER, M. R. and HOYER, W. D. 1980, Variables affecting perceptions of invasion of privacy in a personnel selection situation. Journal of Applied Psychology, 65, 623 -626.\n\nE Gofmann, Stigma: Notes on Management of Spoiled Identity. Englewood Cliffs, NJPrentice HallGOFMANN, E. 1963, Stigma: Notes on Management of Spoiled Identity (Englewood Cliffs, NJ: Prentice Hall).\n\nPrivacy: recognition of a consumer right. C Goodwin, Journal of Public Policy & Marketing. 10GOODWIN, C. 1991, Privacy: recognition of a consumer right. Journal of Public Policy & Marketing, 10, 149 -166.\n\nOn the net, curiosity has a price: registration. C Greenman, New York Times. GREENMAN, C. 1999, On the net, curiosity has a price: registration. New York Times, December 23, 1999.\n\nTerror attacks galvanize Europeans to tighten laws. W Hoge, New York Times. HOGE, W. 2001, U.S. Terror attacks galvanize Europeans to tighten laws. New York Times, December 6, 2001.\n\nPrivacy as personal control. C Johnson, Man -Environment Interactions: Evaluations and applications. Washington, DCEnvironmental Design ResearchJOHNSON, C. 1974, Privacy as personal control. In Man - Environment Interactions: Evaluations and applications, (Washington, DC: Environmental Design Research).\n\nAshcroft weighs easing F.B.I. limits for surveillance. D Johnston, D Van Natta, Jr, New York Times. JOHNSTON, D. and VAN NATTA, D., JR. 2001, Ashcroft weighs easing F.B.I. limits for surveillance. New York Times, December 1, 2001.\n\nPrivacy: a significant marketing issue for the 1990s. M G Jones, Journal of Public Policy and Marketing. 10JONES, M. G. 1991, Privacy: a significant marketing issue for the 1990s. Journal of Public Policy and Marketing, 10, 133 - 148.\n\nA social-psychological examination of privacy. P Kelvin, British Journal of Social Clinical Psychology. 12KELVIN, P. 1973, A social-psychological examination of privacy. British Journal of Social Clinical Psychology, 12, 248 -261.\n\nPrivacy as a concept and a social issue: a multidimensional developmental theory. R S Laufer, M Wolfe, Journal of Social Issues. 33LAUFER, R. S. and WOLFE, M. 1977, Privacy as a concept and a social issue: a multidimensional developmental theory. Journal of Social Issues, 33, 22 -42.\n\nTyler Lind, T R , The Social Psychology of Procedural Justice. New YorkPlenum PressLIND, E and TYLER, T. R. 1988, The Social Psychology of Procedural Justice, (New York: Plenum Press).\n\nConceptions of privacy: current status and next steps. S T Margulis, Journal of Social Issues. 33MARGULIS, S. T. 1977, Conceptions of privacy: current status and next steps. Journal of Social Issues, 33, 5 -10.\n\nOn the status and contribution of Westin's and Altman's theories of privacy. S T Margulis, 2003a, Journal of Social Issues. 592MARGULIS, S. T. 2003A, On the status and contribution of Westin's and Altman's theories of privacy. Journal of Social Issues, 59(2), 411 -429.\n\nPrivacy as a social issue and behavioral concept. S T Margulis, Journal of Social Issues. 592MARGULIS, S. T. 2003B, Privacy as a social issue and behavioral concept. Journal of Social Issues, 59(2), 243 -261.\n\nFour ethical issues of the information age. R O Mason, MIS Quarterly. 10MASON, R. O. 1986, Four ethical issues of the information age. MIS Quarterly, 10, 4 -12.\n\nInformation technology, privacy, and the public good. K F Mccrohan, Journal of Public Policy and Marketing. 8MCCROHAN, K. F. 1989, Information technology, privacy, and the public good. Journal of Public Policy and Marketing, 8, 265 -278.\n\nValues, personal information privacy, and regulatory approaches. S J Milberg, S J Burke, H J Smith, E A Kallman, Communications of the ACM. 38MILBERG, S. J., BURKE, S. J., SMITH, H. J. and KALLMAN, E. A. 1995, Values, personal information privacy, and regulatory approaches. Communications of the ACM, 38, 65 -74.\n\nInformation privacy: corporate management and national regulation. S J Milberg, H J Smith, S J Burke, Organization Science. 11MILBERG, S. J., SMITH, H. J. and BURKE, S. J. 2000, Information privacy: corporate management and national regulation. Organization Science, 11, 35 -37.\n\nG Milne, M Boza, A Business Perspective on Database Marketing and Consumer Privacy Practices. Cambridge, MAMarketing Science InstituteMILNE, G. and BOZA, M. 1998, A Business Perspective on Database Marketing and Consumer Privacy Practices, (Cam- bridge, MA: Marketing Science Institute).\n\nPrivacy and ethical issues in database/ interactive marketing and public policy: a research framework and overview of the special issue. G R Milne, Journal of Public Policy & Marketing. 191MILNE, G. R. 2000, Privacy and ethical issues in database/ interactive marketing and public policy: a research frame- work and overview of the special issue. Journal of Public Policy & Marketing, 19, 1.\n\nInternet privacy and security: an examination of online retailer disclosures. A D Miyazaki, A Fernandez, Journal of Public Policy & Marketing. 19MIYAZAKI, A. D. and FERNANDEZ, A. 2000, Internet privacy and security: an examination of online retailer disclosures. Journal of Public Policy & Marketing, 19, 54 -63.\n\nUnderstanding privacy concerns: an assessment of consumers' information related knowledge and beliefs. G J Nowak, J Phelps, Journal of Direct Marketing. 6NOWAK, G. J. and PHELPS, J. 1992, Understanding privacy concerns: an assessment of consumers' information related knowledge and beliefs. Journal of Direct Marketing, 6, 28 - 39.\n\nDirect marketing and the use of individual-level consumer information: determining how and when privacy matters. G J Nowak, J Phelps, Journal of Direct Marketing. 9NOWAK, G. J. and PHELPS, J. 1995, Direct marketing and the use of individual-level consumer information: determining how and when privacy matters. Journal of Direct Marketing, 9, 46 -60.\n\nJ Nunnaly, Psychometry Theory. New YorkMcGraw-HillNUNNALY, J. 1978, Psychometry Theory, (New York: McGraw- Hill).\n\nCommunication boundary management: a theoretical model of managing disclosure of private information between marital couples. S Petronio, Communication Theory. 1PETRONIO, S. 1991, Communication boundary management: a theoretical model of managing disclosure of private in- formation between marital couples. Communication Theory, 1, 311 -335.\n\nS Petronio, Boundaries of Privacy: Dialectics of Disclosure. Albany: State University of New York PressPETRONIO, S. 2002, Boundaries of Privacy: Dialectics of Disclosure, (Albany: State University of New York Press).\n\nMarketing without consent: consumer choice and costs, privacy, and public policy. R D Petty, Journal of Public Policy & Marketing. 19PETTY, R. D. 2000, Marketing without consent: consumer choice and costs, privacy, and public policy. Journal of Public Policy & Marketing, 19, 42 -57.\n\nPrivacy concerns and consumer willingness to provide personal information. J Phelps, G Nowak, E Ferrell, Journal of Public Marketing. 19PHELPS, J., NOWAK, G. and FERRELL, E. 2000, Privacy concerns and consumer willingness to provide personal information. Journal of Public Marketing, 19, 27 -44.\n\nThe distribution of privacy risks: who needs protection?. C D Raab, C J Bennet, The Information Society14RAAB, C. D. and BENNET, C. J. 1998, The distribution of privacy risks: who needs protection? The Information Society, 14(4) 253 -62.\n\nPrivacy, Information Technology, and Health Care. T C Rindfleish, Communications of the ACM. 40RINDFLEISH, T. C. 1997, Privacy, Information Technology, and Health Care. Communications of the ACM, 40, 92 -100.\n\nContracting identity fraud in the information age: the identity theft and assumption deterrence act, by, International Review of Law. K Saunders, B Zucker, Computers & Technology. 13183SAUNDERS, K. and ZUCKER, B. 1999, Contracting identity fraud in the information age: the identity theft and assumption deterrence act, by, International Review of Law, Computers & Technology, 13, 183.\n\nRe-examining perceived ease of use and usefulness: a Confirmatory Factor Analysis. A Segars, V Grover, MISQ. 174SEGARS, A. and GROVER, V. 1993, Re-examining perceived ease of use and usefulness: a Confirmatory Factor Analysis. MISQ 17(4), 517 -525.\n\nDimensions of privacy concern among online consumers. K B Sheehan, M G Hoy, Journal of Public Policy & Marketing. 19SHEEHAN, K. B. and HOY, M. G. 2000, Dimensions of privacy concern among online consumers. Journal of Public Policy & Marketing, 19, 62 -75.\n\nPrivacy: its constitution and vicissitudes. Law and Contemporary Problems. E Shils, 281SHILS, E. 1966, Privacy: its constitution and vicissitudes. Law and Contemporary Problems, 31, 281.\n\nPrivacy policies and practices: inside the organizational maze. H J Smith, Communications of the ACM. 36SMITH, H. J. 1993, Privacy policies and practices: inside the organizational maze. Communications of the ACM, 36, 105 - 122.\n\nValues, personal information privacy, and regulatory approaches. H J Smith, E A Kallman, Communications of the ACM. 38SMITH, H. J. and KALLMAN, E. A. 1995, Values, personal information privacy, and regulatory approaches. Commu- nications of the ACM, 38, 65 -74.\n\nInformation privacy: measuring individuals' concerns about organizational practices. H J Smith, S J Milberg, S J Burke, MIS Quarterly. SMITH, H. J., MILBERG, S. J. and BURKE, S. J. 1996, Information privacy: measuring individuals' concerns about organiza- tional practices. MIS Quarterly, June, 167 -196.\n\nAn empirical examination of the concern for information privacy instrument. K A Stewart, A H Segars, Information Systems Research. 13STEWART, K. A. and SEGARS, A. H. 2002, An empirical examination of the concern for information privacy instru- ment. Information Systems Research, 13, 36 -49.\n\nA field experiment comparing information-privacy value, beliefs, and attitudes across several types of organizations. E F Stone, H G Gueutal, D B Gardner, S Mcclure, Journal of Applied Psychology. 68STONE, E. F., GUEUTAL, H. G., GARDNER, D. B. and MCCLURE, S. 1983, A field experiment comparing information-privacy value, beliefs, and attitudes across several types of organiza- tions. Journal of Applied Psychology, 68, 459 -468.\n\nPrivacy in organizations: theoretical issues, research findings, and protection mechanism. Research in Personnel and Human Resources Management. E F Stone, D L Stone, 8STONE, E. F. and STONE, D. L. 1990, Privacy in organizations: theoretical issues, research findings, and protection mechan- ism. Research in Personnel and Human Resources Manage- ment, 8, 349 -411.\n\nDatabase marketing practice: protecting consumer privacy. R E Thomas, V G Mauer, Journal of Public Policy and Marketing. 16THOMAS, R. E. and MAUER, V. G. 1997, Database marketing practice: protecting consumer privacy. Journal of Public Policy and Marketing, 16, 147 -155.\n\nEmployee perceptions of invasion of privacy: a field simulation experiment. P D Tolchinsky, M Mccuddy, J Adams, D C Ganster, R Woodman, H L Fromkin, Journal of Applied Psychology. 66TOLCHINSKY, P. D., MCCUDDY, M., ADAMS, J., GANSTER, D. C., WOODMAN, R. and FROMKIN, H. L. 1981, Employee percep- tions of invasion of privacy: a field simulation experiment. Journal of Applied Psychology, 66, 308 -313.\n\nFew in congress questioning president over civil liberties. R Toner, New York Times. TONER, R. 2001, Few in congress questioning president over civil liberties. New York Times, December 5, 2001.\n\nA familiar battle fought and won. R Toner, N A Lewis, UCLA INTERNET REPORT. New York Times. Surveying the Digital FutureTONER, R. and LEWIS, N. A. 2001, A familiar battle fought and won. New York Times, October 26, 2001. UCLA INTERNET REPORT, 2000, 2001, 2002, Surveying the Digital Future, http://ccp.ucla.edu/pages/internet- report.asp.\n\nDirect marketing activities and personal privacy. P Wang, L Petrison, Journal of Direct Marketing. 7AtheneumWANG, P. and PETRISON, L. 1993, Direct marketing activities and personal privacy. Journal of Direct Marketing, 7, 7. WESTIN, A. F. 1967, Privacy and Freedom (New York: Atheneum).\n", "annotations": {"author": "[{\"end\":273,\"start\":97},{\"end\":432,\"start\":274}]", "publisher": null, "author_last_name": "[{\"end\":109,\"start\":104},{\"end\":283,\"start\":279}]", "author_first_name": "[{\"end\":103,\"start\":97},{\"end\":278,\"start\":274}]", "author_affiliation": "[{\"end\":272,\"start\":126},{\"end\":431,\"start\":285}]", "title": "[{\"end\":94,\"start\":1},{\"end\":526,\"start\":433}]", "venue": null, "abstract": "[{\"end\":1507,\"start\":556}]", "bib_ref": "[{\"attributes\":{\"ref_id\":\"b20\"},\"end\":1640,\"start\":1629},{\"attributes\":{\"ref_id\":\"b26\"},\"end\":1925,\"start\":1913},{\"attributes\":{\"ref_id\":\"b46\"},\"end\":1939,\"start\":1927},{\"attributes\":{\"ref_id\":\"b6\"},\"end\":1953,\"start\":1941},{\"attributes\":{\"ref_id\":\"b7\"},\"end\":1968,\"start\":1953},{\"attributes\":{\"ref_id\":\"b28\"},\"end\":1991,\"start\":1970},{\"attributes\":{\"ref_id\":\"b48\"},\"end\":2012,\"start\":1993},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":2041,\"start\":2014},{\"attributes\":{\"ref_id\":\"b49\"},\"end\":2068,\"start\":2043},{\"attributes\":{\"ref_id\":\"b18\"},\"end\":2386,\"start\":2358},{\"attributes\":{\"ref_id\":\"b55\"},\"end\":2408,\"start\":2386},{\"attributes\":{\"ref_id\":\"b54\"},\"end\":2420,\"start\":2408},{\"attributes\":{\"ref_id\":\"b16\"},\"end\":2454,\"start\":2444},{\"attributes\":{\"ref_id\":\"b20\"},\"end\":3954,\"start\":3942},{\"attributes\":{\"ref_id\":\"b53\"},\"end\":3978,\"start\":3954},{\"attributes\":{\"ref_id\":\"b50\"},\"end\":3997,\"start\":3978},{\"attributes\":{\"ref_id\":\"b28\"},\"end\":4018,\"start\":3997},{\"attributes\":{\"ref_id\":\"b48\"},\"end\":4037,\"start\":4018},{\"attributes\":{\"ref_id\":\"b29\"},\"end\":4058,\"start\":4037},{\"attributes\":{\"ref_id\":\"b26\"},\"end\":4514,\"start\":4504},{\"attributes\":{\"ref_id\":\"b27\"},\"end\":4529,\"start\":4514},{\"attributes\":{\"ref_id\":\"b19\"},\"end\":4541,\"start\":4529},{\"attributes\":{\"ref_id\":\"b6\"},\"end\":4554,\"start\":4541},{\"attributes\":{\"ref_id\":\"b7\"},\"end\":4560,\"start\":4554},{\"attributes\":{\"ref_id\":\"b41\"},\"end\":4577,\"start\":4560},{\"attributes\":{\"ref_id\":\"b52\"},\"end\":4600,\"start\":4577},{\"attributes\":{\"ref_id\":\"b5\"},\"end\":4613,\"start\":4600},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":4640,\"start\":4613},{\"attributes\":{\"ref_id\":\"b38\"},\"end\":4652,\"start\":4640},{\"attributes\":{\"ref_id\":\"b39\"},\"end\":4672,\"start\":4652},{\"attributes\":{\"ref_id\":\"b8\"},\"end\":5193,\"start\":5180},{\"attributes\":{\"ref_id\":\"b32\"},\"end\":5227,\"start\":5198},{\"attributes\":{\"ref_id\":\"b29\"},\"end\":5366,\"start\":5345},{\"attributes\":{\"ref_id\":\"b44\"},\"end\":5539,\"start\":5517},{\"attributes\":{\"ref_id\":\"b39\"},\"end\":5649,\"start\":5629},{\"end\":6829,\"start\":6819},{\"end\":6841,\"start\":6829},{\"end\":6853,\"start\":6841},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":7071,\"start\":7062},{\"end\":7658,\"start\":7626},{\"attributes\":{\"ref_id\":\"b20\"},\"end\":8225,\"start\":8214},{\"attributes\":{\"ref_id\":\"b21\"},\"end\":8248,\"start\":8225},{\"attributes\":{\"ref_id\":\"b23\"},\"end\":8263,\"start\":8248},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":8277,\"start\":8263},{\"end\":8466,\"start\":8447},{\"attributes\":{\"ref_id\":\"b45\"},\"end\":8828,\"start\":8817},{\"end\":8841,\"start\":8828},{\"attributes\":{\"ref_id\":\"b17\"},\"end\":8855,\"start\":8841},{\"end\":9111,\"start\":9093},{\"end\":9815,\"start\":9792},{\"attributes\":{\"ref_id\":\"b12\"},\"end\":9969,\"start\":9945},{\"attributes\":{\"ref_id\":\"b36\"},\"end\":9984,\"start\":9969},{\"attributes\":{\"ref_id\":\"b37\"},\"end\":9999,\"start\":9984},{\"attributes\":{\"ref_id\":\"b20\"},\"end\":10243,\"start\":10230},{\"attributes\":{\"ref_id\":\"b12\"},\"end\":10563,\"start\":10538},{\"attributes\":{\"ref_id\":\"b41\"},\"end\":11303,\"start\":11286},{\"attributes\":{\"ref_id\":\"b42\"},\"end\":11458,\"start\":11432},{\"attributes\":{\"ref_id\":\"b2\"},\"end\":11589,\"start\":11576},{\"end\":11606,\"start\":11589},{\"attributes\":{\"ref_id\":\"b8\"},\"end\":11634,\"start\":11621},{\"attributes\":{\"ref_id\":\"b32\"},\"end\":11851,\"start\":11822},{\"end\":12362,\"start\":12349},{\"attributes\":{\"ref_id\":\"b23\"},\"end\":12662,\"start\":12647},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":12956,\"start\":12930},{\"attributes\":{\"ref_id\":\"b51\"},\"end\":13036,\"start\":13014},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":13314,\"start\":13287},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":13454,\"start\":13427},{\"attributes\":{\"ref_id\":\"b22\"},\"end\":13518,\"start\":13497},{\"end\":13943,\"start\":13911},{\"attributes\":{\"ref_id\":\"b44\"},\"end\":14665,\"start\":14643},{\"attributes\":{\"ref_id\":\"b39\"},\"end\":14747,\"start\":14727},{\"attributes\":{\"ref_id\":\"b34\"},\"end\":14876,\"start\":14853},{\"end\":14948,\"start\":14924},{\"attributes\":{\"ref_id\":\"b3\"},\"end\":14975,\"start\":14950},{\"attributes\":{\"ref_id\":\"b56\"},\"end\":15194,\"start\":15170},{\"attributes\":{\"ref_id\":\"b2\"},\"end\":15368,\"start\":15354},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":15514,\"start\":15500},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":15524,\"start\":15514},{\"attributes\":{\"ref_id\":\"b21\"},\"end\":15946,\"start\":15923},{\"attributes\":{\"ref_id\":\"b50\"},\"end\":16547,\"start\":16528},{\"attributes\":{\"ref_id\":\"b51\"},\"end\":16574,\"start\":16552},{\"attributes\":{\"ref_id\":\"b48\"},\"end\":18161,\"start\":18142},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":18212,\"start\":18185},{\"attributes\":{\"ref_id\":\"b0\"},\"end\":20870,\"start\":20849},{\"attributes\":{\"ref_id\":\"b43\"},\"end\":21285,\"start\":21261},{\"end\":21959,\"start\":21944},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":22066,\"start\":22050}]", "figure": "[{\"attributes\":{\"id\":\"fig_0\"},\"end\":33453,\"start\":33390},{\"attributes\":{\"id\":\"tab_0\",\"type\":\"table\"},\"end\":33971,\"start\":33454},{\"attributes\":{\"id\":\"tab_1\",\"type\":\"table\"},\"end\":34073,\"start\":33972},{\"attributes\":{\"id\":\"tab_2\",\"type\":\"table\"},\"end\":34496,\"start\":34074}]", "paragraph": "[{\"end\":2069,\"start\":1523},{\"end\":2581,\"start\":2071},{\"end\":3352,\"start\":2583},{\"end\":4059,\"start\":3396},{\"end\":4673,\"start\":4061},{\"end\":5961,\"start\":4675},{\"end\":6854,\"start\":5963},{\"end\":7073,\"start\":6856},{\"end\":8000,\"start\":7075},{\"end\":9634,\"start\":8002},{\"end\":10785,\"start\":9636},{\"end\":12037,\"start\":10787},{\"end\":12139,\"start\":12039},{\"end\":12619,\"start\":12141},{\"end\":14479,\"start\":12621},{\"end\":15525,\"start\":14481},{\"end\":16642,\"start\":15527},{\"end\":17016,\"start\":16644},{\"end\":17123,\"start\":17018},{\"end\":18736,\"start\":17166},{\"end\":19321,\"start\":18738},{\"end\":19980,\"start\":19323},{\"end\":20723,\"start\":19982},{\"end\":21540,\"start\":20755},{\"end\":22104,\"start\":21542},{\"end\":23119,\"start\":22106},{\"end\":23907,\"start\":23121},{\"end\":25394,\"start\":23955},{\"end\":25926,\"start\":25426},{\"end\":26849,\"start\":25928},{\"end\":27975,\"start\":26851},{\"end\":28537,\"start\":27977},{\"end\":29401,\"start\":28539},{\"end\":30192,\"start\":29403},{\"end\":30848,\"start\":30194},{\"end\":31552,\"start\":30850},{\"end\":32416,\"start\":31554},{\"end\":32844,\"start\":32418},{\"end\":33389,\"start\":32846}]", "formula": null, "table_ref": "[{\"end\":23436,\"start\":23429},{\"end\":28287,\"start\":28278}]", "section_header": "[{\"attributes\":{\"n\":\"1.\"},\"end\":1521,\"start\":1509},{\"attributes\":{\"n\":\"2.\"},\"end\":3394,\"start\":3355},{\"attributes\":{\"n\":\"3.\"},\"end\":17164,\"start\":17126},{\"attributes\":{\"n\":\"4.\"},\"end\":20753,\"start\":20726},{\"attributes\":{\"n\":\"5.\"},\"end\":23953,\"start\":23910},{\"attributes\":{\"n\":\"6.\"},\"end\":25424,\"start\":25397},{\"end\":33401,\"start\":33391},{\"end\":33464,\"start\":33455},{\"end\":33982,\"start\":33973},{\"end\":34084,\"start\":34075}]", "table": "[{\"end\":33971,\"start\":33520},{\"end\":34073,\"start\":34061},{\"end\":34496,\"start\":34269}]", "figure_caption": "[{\"end\":33453,\"start\":33403},{\"end\":33520,\"start\":33466},{\"end\":34061,\"start\":33984},{\"end\":34269,\"start\":34086}]", "figure_ref": null, "bib_author_first_name": "[{\"end\":34556,\"start\":34555},{\"end\":34558,\"start\":34557},{\"end\":34569,\"start\":34568},{\"end\":34575,\"start\":34574},{\"end\":34577,\"start\":34576},{\"end\":34782,\"start\":34776},{\"end\":35048,\"start\":35047},{\"end\":35050,\"start\":35049},{\"end\":35312,\"start\":35311},{\"end\":35314,\"start\":35313},{\"end\":35326,\"start\":35325},{\"end\":35328,\"start\":35327},{\"end\":35563,\"start\":35562},{\"end\":35565,\"start\":35564},{\"end\":35796,\"start\":35795},{\"end\":35798,\"start\":35797},{\"end\":36056,\"start\":36055},{\"end\":36058,\"start\":36057},{\"end\":36331,\"start\":36330},{\"end\":36333,\"start\":36332},{\"end\":36570,\"start\":36569},{\"end\":36572,\"start\":36571},{\"end\":36850,\"start\":36849},{\"end\":36852,\"start\":36851},{\"end\":36870,\"start\":36861},{\"end\":36874,\"start\":36873},{\"end\":36876,\"start\":36875},{\"end\":37137,\"start\":37136},{\"end\":37148,\"start\":37147},{\"end\":37630,\"start\":37629},{\"end\":37632,\"start\":37631},{\"end\":37644,\"start\":37643},{\"end\":37646,\"start\":37645},{\"end\":37864,\"start\":37863},{\"end\":38105,\"start\":38104},{\"end\":38318,\"start\":38317},{\"end\":38502,\"start\":38501},{\"end\":38662,\"start\":38661},{\"end\":38994,\"start\":38993},{\"end\":39006,\"start\":39005},{\"end\":39225,\"start\":39224},{\"end\":39227,\"start\":39226},{\"end\":39454,\"start\":39453},{\"end\":39721,\"start\":39720},{\"end\":39723,\"start\":39722},{\"end\":39733,\"start\":39732},{\"end\":39929,\"start\":39924},{\"end\":39937,\"start\":39936},{\"end\":39939,\"start\":39938},{\"end\":40166,\"start\":40165},{\"end\":40168,\"start\":40167},{\"end\":40400,\"start\":40399},{\"end\":40402,\"start\":40401},{\"end\":40644,\"start\":40643},{\"end\":40646,\"start\":40645},{\"end\":40848,\"start\":40847},{\"end\":40850,\"start\":40849},{\"end\":41020,\"start\":41019},{\"end\":41022,\"start\":41021},{\"end\":41270,\"start\":41269},{\"end\":41272,\"start\":41271},{\"end\":41283,\"start\":41282},{\"end\":41285,\"start\":41284},{\"end\":41294,\"start\":41293},{\"end\":41296,\"start\":41295},{\"end\":41305,\"start\":41304},{\"end\":41307,\"start\":41306},{\"end\":41587,\"start\":41586},{\"end\":41589,\"start\":41588},{\"end\":41600,\"start\":41599},{\"end\":41602,\"start\":41601},{\"end\":41611,\"start\":41610},{\"end\":41613,\"start\":41612},{\"end\":41800,\"start\":41799},{\"end\":41809,\"start\":41808},{\"end\":42226,\"start\":42225},{\"end\":42228,\"start\":42227},{\"end\":42560,\"start\":42559},{\"end\":42562,\"start\":42561},{\"end\":42574,\"start\":42573},{\"end\":42899,\"start\":42898},{\"end\":42901,\"start\":42900},{\"end\":42910,\"start\":42909},{\"end\":43242,\"start\":43241},{\"end\":43244,\"start\":43243},{\"end\":43253,\"start\":43252},{\"end\":43481,\"start\":43480},{\"end\":43722,\"start\":43721},{\"end\":43940,\"start\":43939},{\"end\":44240,\"start\":44239},{\"end\":44242,\"start\":44241},{\"end\":44518,\"start\":44517},{\"end\":44528,\"start\":44527},{\"end\":44537,\"start\":44536},{\"end\":44798,\"start\":44797},{\"end\":44800,\"start\":44799},{\"end\":44808,\"start\":44807},{\"end\":44810,\"start\":44809},{\"end\":45029,\"start\":45028},{\"end\":45031,\"start\":45030},{\"end\":45323,\"start\":45322},{\"end\":45335,\"start\":45334},{\"end\":45659,\"start\":45658},{\"end\":45669,\"start\":45668},{\"end\":45880,\"start\":45879},{\"end\":45882,\"start\":45881},{\"end\":45893,\"start\":45892},{\"end\":45895,\"start\":45894},{\"end\":46158,\"start\":46157},{\"end\":46335,\"start\":46334},{\"end\":46337,\"start\":46336},{\"end\":46566,\"start\":46565},{\"end\":46568,\"start\":46567},{\"end\":46577,\"start\":46576},{\"end\":46579,\"start\":46578},{\"end\":46849,\"start\":46848},{\"end\":46851,\"start\":46850},{\"end\":46860,\"start\":46859},{\"end\":46862,\"start\":46861},{\"end\":46873,\"start\":46872},{\"end\":46875,\"start\":46874},{\"end\":47146,\"start\":47145},{\"end\":47148,\"start\":47147},{\"end\":47159,\"start\":47158},{\"end\":47161,\"start\":47160},{\"end\":47481,\"start\":47480},{\"end\":47483,\"start\":47482},{\"end\":47492,\"start\":47491},{\"end\":47494,\"start\":47493},{\"end\":47505,\"start\":47504},{\"end\":47507,\"start\":47506},{\"end\":47518,\"start\":47517},{\"end\":47940,\"start\":47939},{\"end\":47942,\"start\":47941},{\"end\":47951,\"start\":47950},{\"end\":47953,\"start\":47952},{\"end\":48220,\"start\":48219},{\"end\":48222,\"start\":48221},{\"end\":48232,\"start\":48231},{\"end\":48234,\"start\":48233},{\"end\":48511,\"start\":48510},{\"end\":48513,\"start\":48512},{\"end\":48527,\"start\":48526},{\"end\":48538,\"start\":48537},{\"end\":48547,\"start\":48546},{\"end\":48549,\"start\":48548},{\"end\":48560,\"start\":48559},{\"end\":48571,\"start\":48570},{\"end\":48573,\"start\":48572},{\"end\":48897,\"start\":48896},{\"end\":49067,\"start\":49066},{\"end\":49076,\"start\":49075},{\"end\":49078,\"start\":49077},{\"end\":49423,\"start\":49422},{\"end\":49431,\"start\":49430}]", "bib_author_last_name": "[{\"end\":34566,\"start\":34559},{\"end\":34572,\"start\":34570},{\"end\":34586,\"start\":34578},{\"end\":34786,\"start\":34783},{\"end\":34804,\"start\":34788},{\"end\":35058,\"start\":35051},{\"end\":35323,\"start\":35315},{\"end\":35334,\"start\":35329},{\"end\":35575,\"start\":35566},{\"end\":35579,\"start\":35577},{\"end\":35805,\"start\":35799},{\"end\":36065,\"start\":36059},{\"end\":36340,\"start\":36334},{\"end\":36579,\"start\":36573},{\"end\":36859,\"start\":36853},{\"end\":37145,\"start\":37138},{\"end\":37156,\"start\":37149},{\"end\":37641,\"start\":37633},{\"end\":37652,\"start\":37647},{\"end\":37872,\"start\":37865},{\"end\":38113,\"start\":38106},{\"end\":38327,\"start\":38319},{\"end\":38507,\"start\":38503},{\"end\":38670,\"start\":38663},{\"end\":39003,\"start\":38995},{\"end\":39016,\"start\":39007},{\"end\":39020,\"start\":39018},{\"end\":39233,\"start\":39228},{\"end\":39461,\"start\":39455},{\"end\":39730,\"start\":39724},{\"end\":39739,\"start\":39734},{\"end\":39934,\"start\":39930},{\"end\":40177,\"start\":40169},{\"end\":40411,\"start\":40403},{\"end\":40418,\"start\":40413},{\"end\":40655,\"start\":40647},{\"end\":40856,\"start\":40851},{\"end\":41031,\"start\":41023},{\"end\":41280,\"start\":41273},{\"end\":41291,\"start\":41286},{\"end\":41302,\"start\":41297},{\"end\":41315,\"start\":41308},{\"end\":41597,\"start\":41590},{\"end\":41608,\"start\":41603},{\"end\":41619,\"start\":41614},{\"end\":41806,\"start\":41801},{\"end\":41814,\"start\":41810},{\"end\":42234,\"start\":42229},{\"end\":42571,\"start\":42563},{\"end\":42584,\"start\":42575},{\"end\":42907,\"start\":42902},{\"end\":42917,\"start\":42911},{\"end\":43250,\"start\":43245},{\"end\":43260,\"start\":43254},{\"end\":43489,\"start\":43482},{\"end\":43731,\"start\":43723},{\"end\":43949,\"start\":43941},{\"end\":44248,\"start\":44243},{\"end\":44525,\"start\":44519},{\"end\":44534,\"start\":44529},{\"end\":44545,\"start\":44538},{\"end\":44805,\"start\":44801},{\"end\":44817,\"start\":44811},{\"end\":45042,\"start\":45032},{\"end\":45332,\"start\":45324},{\"end\":45342,\"start\":45336},{\"end\":45666,\"start\":45660},{\"end\":45676,\"start\":45670},{\"end\":45890,\"start\":45883},{\"end\":45899,\"start\":45896},{\"end\":46164,\"start\":46159},{\"end\":46343,\"start\":46338},{\"end\":46574,\"start\":46569},{\"end\":46587,\"start\":46580},{\"end\":46857,\"start\":46852},{\"end\":46870,\"start\":46863},{\"end\":46881,\"start\":46876},{\"end\":47156,\"start\":47149},{\"end\":47168,\"start\":47162},{\"end\":47489,\"start\":47484},{\"end\":47502,\"start\":47495},{\"end\":47515,\"start\":47508},{\"end\":47526,\"start\":47519},{\"end\":47948,\"start\":47943},{\"end\":47959,\"start\":47954},{\"end\":48229,\"start\":48223},{\"end\":48240,\"start\":48235},{\"end\":48524,\"start\":48514},{\"end\":48535,\"start\":48528},{\"end\":48544,\"start\":48539},{\"end\":48557,\"start\":48550},{\"end\":48568,\"start\":48561},{\"end\":48581,\"start\":48574},{\"end\":48903,\"start\":48898},{\"end\":49073,\"start\":49068},{\"end\":49084,\"start\":49079},{\"end\":49428,\"start\":49424},{\"end\":49440,\"start\":49432}]", "bib_entry": "[{\"attributes\":{\"id\":\"b0\",\"matched_paper_id\":144656911},\"end\":34774,\"start\":34498},{\"attributes\":{\"id\":\"b1\"},\"end\":34941,\"start\":34776},{\"attributes\":{\"id\":\"b2\",\"matched_paper_id\":152439225},\"end\":35254,\"start\":34943},{\"attributes\":{\"id\":\"b3\",\"matched_paper_id\":166922040},\"end\":35492,\"start\":35256},{\"attributes\":{\"id\":\"b4\",\"matched_paper_id\":167967723},\"end\":35751,\"start\":35494},{\"attributes\":{\"id\":\"b5\",\"matched_paper_id\":6826824},\"end\":35940,\"start\":35753},{\"attributes\":{\"id\":\"b6\",\"matched_paper_id\":16424510},\"end\":36246,\"start\":35942},{\"attributes\":{\"id\":\"b7\",\"matched_paper_id\":167826740},\"end\":36513,\"start\":36248},{\"attributes\":{\"id\":\"b8\",\"matched_paper_id\":154556860},\"end\":36746,\"start\":36515},{\"attributes\":{\"id\":\"b9\",\"matched_paper_id\":54041604},\"end\":37081,\"start\":36748},{\"attributes\":{\"id\":\"b10\",\"matched_paper_id\":143681664},\"end\":37409,\"start\":37083},{\"attributes\":{\"id\":\"b11\"},\"end\":37536,\"start\":37411},{\"attributes\":{\"id\":\"b12\",\"matched_paper_id\":144605620},\"end\":37861,\"start\":37538},{\"attributes\":{\"id\":\"b13\"},\"end\":38060,\"start\":37863},{\"attributes\":{\"id\":\"b14\",\"matched_paper_id\":158359666},\"end\":38266,\"start\":38062},{\"attributes\":{\"id\":\"b15\"},\"end\":38447,\"start\":38268},{\"attributes\":{\"id\":\"b16\"},\"end\":38630,\"start\":38449},{\"attributes\":{\"id\":\"b17\"},\"end\":38936,\"start\":38632},{\"attributes\":{\"id\":\"b18\"},\"end\":39168,\"start\":38938},{\"attributes\":{\"id\":\"b19\",\"matched_paper_id\":159360845},\"end\":39404,\"start\":39170},{\"attributes\":{\"id\":\"b20\",\"matched_paper_id\":143513824},\"end\":39636,\"start\":39406},{\"attributes\":{\"id\":\"b21\",\"matched_paper_id\":144418634},\"end\":39922,\"start\":39638},{\"attributes\":{\"id\":\"b22\"},\"end\":40108,\"start\":39924},{\"attributes\":{\"id\":\"b23\",\"matched_paper_id\":143651601},\"end\":40320,\"start\":40110},{\"attributes\":{\"id\":\"b24\",\"matched_paper_id\":145392791},\"end\":40591,\"start\":40322},{\"attributes\":{\"id\":\"b25\",\"matched_paper_id\":144706097},\"end\":40801,\"start\":40593},{\"attributes\":{\"id\":\"b26\",\"matched_paper_id\":58442003},\"end\":40963,\"start\":40803},{\"attributes\":{\"id\":\"b27\",\"matched_paper_id\":159095719},\"end\":41202,\"start\":40965},{\"attributes\":{\"id\":\"b28\",\"matched_paper_id\":14885824},\"end\":41517,\"start\":41204},{\"attributes\":{\"id\":\"b29\",\"matched_paper_id\":167638346},\"end\":41797,\"start\":41519},{\"attributes\":{\"id\":\"b30\"},\"end\":42086,\"start\":41799},{\"attributes\":{\"id\":\"b31\",\"matched_paper_id\":154339810},\"end\":42479,\"start\":42088},{\"attributes\":{\"id\":\"b32\",\"matched_paper_id\":154676903},\"end\":42793,\"start\":42481},{\"attributes\":{\"id\":\"b33\"},\"end\":43126,\"start\":42795},{\"attributes\":{\"id\":\"b34\",\"matched_paper_id\":221907953},\"end\":43478,\"start\":43128},{\"attributes\":{\"id\":\"b35\"},\"end\":43593,\"start\":43480},{\"attributes\":{\"id\":\"b36\",\"matched_paper_id\":144089276},\"end\":43937,\"start\":43595},{\"attributes\":{\"id\":\"b37\"},\"end\":44155,\"start\":43939},{\"attributes\":{\"id\":\"b38\",\"matched_paper_id\":154021240},\"end\":44440,\"start\":44157},{\"attributes\":{\"id\":\"b39\",\"matched_paper_id\":154587047},\"end\":44737,\"start\":44442},{\"attributes\":{\"id\":\"b40\"},\"end\":44976,\"start\":44739},{\"attributes\":{\"id\":\"b41\",\"matched_paper_id\":15736560},\"end\":45186,\"start\":44978},{\"attributes\":{\"id\":\"b42\"},\"end\":45573,\"start\":45188},{\"attributes\":{\"id\":\"b43\",\"matched_paper_id\":56536431},\"end\":45823,\"start\":45575},{\"attributes\":{\"id\":\"b44\",\"matched_paper_id\":153423755},\"end\":46080,\"start\":45825},{\"attributes\":{\"id\":\"b45\"},\"end\":46268,\"start\":46082},{\"attributes\":{\"id\":\"b46\",\"matched_paper_id\":6834},\"end\":46498,\"start\":46270},{\"attributes\":{\"id\":\"b47\",\"matched_paper_id\":14885824},\"end\":46761,\"start\":46500},{\"attributes\":{\"id\":\"b48\",\"matched_paper_id\":1284770},\"end\":47067,\"start\":46763},{\"attributes\":{\"id\":\"b49\",\"matched_paper_id\":207228127},\"end\":47360,\"start\":47069},{\"attributes\":{\"id\":\"b50\",\"matched_paper_id\":144624252},\"end\":47792,\"start\":47362},{\"attributes\":{\"id\":\"b51\"},\"end\":48159,\"start\":47794},{\"attributes\":{\"id\":\"b52\",\"matched_paper_id\":159102447},\"end\":48432,\"start\":48161},{\"attributes\":{\"id\":\"b53\",\"matched_paper_id\":143318795},\"end\":48834,\"start\":48434},{\"attributes\":{\"id\":\"b54\"},\"end\":49030,\"start\":48836},{\"attributes\":{\"id\":\"b55\"},\"end\":49370,\"start\":49032},{\"attributes\":{\"id\":\"b56\",\"matched_paper_id\":167816773},\"end\":49658,\"start\":49372}]", "bib_title": "[{\"end\":34553,\"start\":34498},{\"end\":35045,\"start\":34943},{\"end\":35309,\"start\":35256},{\"end\":35560,\"start\":35494},{\"end\":35793,\"start\":35753},{\"end\":36053,\"start\":35942},{\"end\":36328,\"start\":36248},{\"end\":36567,\"start\":36515},{\"end\":36847,\"start\":36748},{\"end\":37134,\"start\":37083},{\"end\":37445,\"start\":37411},{\"end\":37627,\"start\":37538},{\"end\":38102,\"start\":38062},{\"end\":38315,\"start\":38268},{\"end\":38499,\"start\":38449},{\"end\":38659,\"start\":38632},{\"end\":38991,\"start\":38938},{\"end\":39222,\"start\":39170},{\"end\":39451,\"start\":39406},{\"end\":39718,\"start\":39638},{\"end\":40163,\"start\":40110},{\"end\":40397,\"start\":40322},{\"end\":40641,\"start\":40593},{\"end\":40845,\"start\":40803},{\"end\":41017,\"start\":40965},{\"end\":41267,\"start\":41204},{\"end\":41584,\"start\":41519},{\"end\":42223,\"start\":42088},{\"end\":42557,\"start\":42481},{\"end\":42896,\"start\":42795},{\"end\":43239,\"start\":43128},{\"end\":43719,\"start\":43595},{\"end\":44237,\"start\":44157},{\"end\":44515,\"start\":44442},{\"end\":45026,\"start\":44978},{\"end\":45320,\"start\":45188},{\"end\":45656,\"start\":45575},{\"end\":45877,\"start\":45825},{\"end\":46332,\"start\":46270},{\"end\":46563,\"start\":46500},{\"end\":46846,\"start\":46763},{\"end\":47143,\"start\":47069},{\"end\":47478,\"start\":47362},{\"end\":48217,\"start\":48161},{\"end\":48508,\"start\":48434},{\"end\":48894,\"start\":48836},{\"end\":49064,\"start\":49032},{\"end\":49420,\"start\":49372}]", "bib_author": "[{\"end\":34568,\"start\":34555},{\"end\":34574,\"start\":34568},{\"end\":34588,\"start\":34574},{\"end\":34788,\"start\":34776},{\"end\":34806,\"start\":34788},{\"end\":35060,\"start\":35047},{\"end\":35325,\"start\":35311},{\"end\":35336,\"start\":35325},{\"end\":35577,\"start\":35562},{\"end\":35581,\"start\":35577},{\"end\":35807,\"start\":35795},{\"end\":36067,\"start\":36055},{\"end\":36342,\"start\":36330},{\"end\":36581,\"start\":36569},{\"end\":36861,\"start\":36849},{\"end\":36873,\"start\":36861},{\"end\":36879,\"start\":36873},{\"end\":37147,\"start\":37136},{\"end\":37158,\"start\":37147},{\"end\":37643,\"start\":37629},{\"end\":37654,\"start\":37643},{\"end\":37874,\"start\":37863},{\"end\":38115,\"start\":38104},{\"end\":38329,\"start\":38317},{\"end\":38509,\"start\":38501},{\"end\":38672,\"start\":38661},{\"end\":39005,\"start\":38993},{\"end\":39018,\"start\":39005},{\"end\":39022,\"start\":39018},{\"end\":39235,\"start\":39224},{\"end\":39463,\"start\":39453},{\"end\":39732,\"start\":39720},{\"end\":39741,\"start\":39732},{\"end\":39936,\"start\":39924},{\"end\":39942,\"start\":39936},{\"end\":40179,\"start\":40165},{\"end\":40413,\"start\":40399},{\"end\":40420,\"start\":40413},{\"end\":40657,\"start\":40643},{\"end\":40858,\"start\":40847},{\"end\":41033,\"start\":41019},{\"end\":41282,\"start\":41269},{\"end\":41293,\"start\":41282},{\"end\":41304,\"start\":41293},{\"end\":41317,\"start\":41304},{\"end\":41599,\"start\":41586},{\"end\":41610,\"start\":41599},{\"end\":41621,\"start\":41610},{\"end\":41808,\"start\":41799},{\"end\":41816,\"start\":41808},{\"end\":42236,\"start\":42225},{\"end\":42573,\"start\":42559},{\"end\":42586,\"start\":42573},{\"end\":42909,\"start\":42898},{\"end\":42919,\"start\":42909},{\"end\":43252,\"start\":43241},{\"end\":43262,\"start\":43252},{\"end\":43491,\"start\":43480},{\"end\":43733,\"start\":43721},{\"end\":43951,\"start\":43939},{\"end\":44250,\"start\":44239},{\"end\":44527,\"start\":44517},{\"end\":44536,\"start\":44527},{\"end\":44547,\"start\":44536},{\"end\":44807,\"start\":44797},{\"end\":44819,\"start\":44807},{\"end\":45044,\"start\":45028},{\"end\":45334,\"start\":45322},{\"end\":45344,\"start\":45334},{\"end\":45668,\"start\":45658},{\"end\":45678,\"start\":45668},{\"end\":45892,\"start\":45879},{\"end\":45901,\"start\":45892},{\"end\":46166,\"start\":46157},{\"end\":46345,\"start\":46334},{\"end\":46576,\"start\":46565},{\"end\":46589,\"start\":46576},{\"end\":46859,\"start\":46848},{\"end\":46872,\"start\":46859},{\"end\":46883,\"start\":46872},{\"end\":47158,\"start\":47145},{\"end\":47170,\"start\":47158},{\"end\":47491,\"start\":47480},{\"end\":47504,\"start\":47491},{\"end\":47517,\"start\":47504},{\"end\":47528,\"start\":47517},{\"end\":47950,\"start\":47939},{\"end\":47961,\"start\":47950},{\"end\":48231,\"start\":48219},{\"end\":48242,\"start\":48231},{\"end\":48526,\"start\":48510},{\"end\":48537,\"start\":48526},{\"end\":48546,\"start\":48537},{\"end\":48559,\"start\":48546},{\"end\":48570,\"start\":48559},{\"end\":48583,\"start\":48570},{\"end\":48905,\"start\":48896},{\"end\":49075,\"start\":49066},{\"end\":49086,\"start\":49075},{\"end\":49430,\"start\":49422},{\"end\":49442,\"start\":49430}]", "bib_venue": "[{\"end\":37189,\"start\":37181},{\"end\":37943,\"start\":37923},{\"end\":38747,\"start\":38733},{\"end\":39995,\"start\":39987},{\"end\":41906,\"start\":41893},{\"end\":43519,\"start\":43511},{\"end\":34620,\"start\":34588},{\"end\":34844,\"start\":34806},{\"end\":35085,\"start\":35060},{\"end\":35359,\"start\":35336},{\"end\":35610,\"start\":35581},{\"end\":35832,\"start\":35807},{\"end\":36080,\"start\":36067},{\"end\":36369,\"start\":36342},{\"end\":36617,\"start\":36581},{\"end\":36899,\"start\":36879},{\"end\":37179,\"start\":37158},{\"end\":37450,\"start\":37447},{\"end\":37683,\"start\":37654},{\"end\":37921,\"start\":37874},{\"end\":38151,\"start\":38115},{\"end\":38343,\"start\":38329},{\"end\":38523,\"start\":38509},{\"end\":38731,\"start\":38672},{\"end\":39036,\"start\":39022},{\"end\":39273,\"start\":39235},{\"end\":39508,\"start\":39463},{\"end\":39765,\"start\":39741},{\"end\":39985,\"start\":39942},{\"end\":40203,\"start\":40179},{\"end\":40444,\"start\":40420},{\"end\":40681,\"start\":40657},{\"end\":40871,\"start\":40858},{\"end\":41071,\"start\":41033},{\"end\":41342,\"start\":41317},{\"end\":41641,\"start\":41621},{\"end\":41891,\"start\":41816},{\"end\":42272,\"start\":42236},{\"end\":42622,\"start\":42586},{\"end\":42946,\"start\":42919},{\"end\":43289,\"start\":43262},{\"end\":43509,\"start\":43491},{\"end\":43753,\"start\":43733},{\"end\":43998,\"start\":43951},{\"end\":44286,\"start\":44250},{\"end\":44574,\"start\":44547},{\"end\":44795,\"start\":44739},{\"end\":45069,\"start\":45044},{\"end\":45366,\"start\":45344},{\"end\":45682,\"start\":45678},{\"end\":45937,\"start\":45901},{\"end\":46155,\"start\":46082},{\"end\":46370,\"start\":46345},{\"end\":46614,\"start\":46589},{\"end\":46896,\"start\":46883},{\"end\":47198,\"start\":47170},{\"end\":47557,\"start\":47528},{\"end\":47937,\"start\":47794},{\"end\":48280,\"start\":48242},{\"end\":48612,\"start\":48583},{\"end\":48919,\"start\":48905},{\"end\":49106,\"start\":49086},{\"end\":49469,\"start\":49442}]"}}}, "year": 2023, "month": 12, "day": 17}