{"id": 3796689, "updated": "2023-10-04 17:06:02.336", "metadata": {"title": "Fast and robust segmentation of white blood cell images by self-supervised learning", "authors": "[{\"first\":\"Xin\",\"last\":\"Zheng\",\"middle\":[]},{\"first\":\"Yong\",\"last\":\"Wang\",\"middle\":[]},{\"first\":\"Guoyou\",\"last\":\"Wang\",\"middle\":[]},{\"first\":\"Jianguo\",\"last\":\"Liu\",\"middle\":[]}]", "venue": "Micron", "journal": "Micron", "publication_date": {"year": 2018, "month": null, "day": null}, "abstract": "A fast and accurate white blood cell (WBC) segmentation remains a challenging task, as di ﬀ erent WBCs vary signi ﬁ cantly in color and shape due to cell type di ﬀ erences, staining technique variations and the adhesion between the WBC and red blood cells. In this paper, a self-supervised learning approach, consisting of un- supervised initial segmentation and supervised segmentation re ﬁ nement, is presented. The ﬁ rst module extracts the overall foreground region from the cell image by K-means clustering, and then generates a coarse WBC region by touching-cell splitting based on concavity analysis. The second module further uses the coarse segmentation result of the ﬁ rst module as automatic labels to actively train a support vector machine (SVM) classi ﬁ er. Then, the trained SVM classi ﬁ er is further used to classify each pixel of the image and achieve a more accurate segmentation result. To improve its segmentation accuracy, median color features representing the topological structure and a new weak edge enhancement operator (WEEO) handling fuzzy boundary are in-troduced. To further reduce its time cost, an e ﬃ cient cluster sampling strategy is also proposed. We tested the proposed approach with two blood cell image datasets obtained under various imaging and staining conditions. The experiment results show that our approach has a superior performance of accuracy and time cost on both datasets.", "fields_of_study": "[\"Medicine\"]", "external_ids": {"arxiv": null, "mag": "2793002108", "acl": null, "pubmed": "29425969", "pubmedcentral": null, "dblp": null, "doi": "10.1016/j.micron.2018.01.010"}}, "content": {"source": {"pdf_hash": "fb8786ba5f59666850e7037950441ba966a4a705", "pdf_src": "ScienceParsePlus", "pdf_uri": null, "oa_url_match": false, "oa_info": {"license": "CCBYNCND", "open_access_url": "https://ink.library.smu.edu.sg/sis_research/5884", "status": "GREEN"}}, "grobid": {"id": "caed69b4f3ce6a4b7c477e588ae86bdbdf8001e1", "type": "plain-text", "url": "s3://ai2-s2-pdf-extraction-prod/parse-results/s2orc_worker/fb8786ba5f59666850e7037950441ba966a4a705.txt", "contents": "\nFast and robust segmentation of white blood cell images by self-supervised learning\n\n\nXin Zheng \nSchool of Computer and Information\nThe University Key Laboratory of Intelligent Perception and Computing of Anhui Province\nAnqing Normal University\n246133AnqingChina\n\nYong Wang \nDepartment of Computer Science and Technology\nThe Hong Kong University of Science and Technology\nHong KongChina\n\nGuoyou Wang \nNational Key Laboratory of Science and Technology on Multi-Spectral Information Processing\nSchool of Automation\nHuazhong University of Science and Technology\n430074WuhanChina\n\nJianguo Liu \nNational Key Laboratory of Science and Technology on Multi-Spectral Information Processing\nSchool of Automation\nHuazhong University of Science and Technology\n430074WuhanChina\n\nFast and robust segmentation of white blood cell images by self-supervised learning\n10.1016/j.micron.2018.01.010Contents lists available at ScienceDirect Micron journal homepage: www.elsevier.com/locate/micron A R T I C L E I N F OCell segmentation Self-supervised learning Support vector machine White blood cell Automatic labeling of training data\nA B S T R A C TA fast and accurate white blood cell (WBC) segmentation remains a challenging task, as different WBCs vary significantly in color and shape due to cell type differences, staining technique variations and the adhesion between the WBC and red blood cells. In this paper, a self-supervised learning approach, consisting of unsupervised initial segmentation and supervised segmentation refinement, is presented. The first module extracts the overall foreground region from the cell image by K-means clustering, and then generates a coarse WBC region by touching-cell splitting based on concavity analysis. The second module further uses the coarse segmentation result of the first module as automatic labels to actively train a support vector machine (SVM) classifier. Then, the trained SVM classifier is further used to classify each pixel of the image and achieve a more accurate segmentation result. To improve its segmentation accuracy, median color features representing the topological structure and a new weak edge enhancement operator (WEEO) handling fuzzy boundary are introduced. To further reduce its time cost, an efficient cluster sampling strategy is also proposed. We tested the proposed approach with two blood cell image datasets obtained under various imaging and staining conditions. The experiment results show that our approach has a superior performance of accuracy and time cost on both datasets.\n\nA B S T R A C T\n\nA fast and accurate white blood cell (WBC) segmentation remains a challenging task, as different WBCs vary significantly in color and shape due to cell type differences, staining technique variations and the adhesion between the WBC and red blood cells. In this paper, a self-supervised learning approach, consisting of unsupervised initial segmentation and supervised segmentation refinement, is presented. The first module extracts the overall foreground region from the cell image by K-means clustering, and then generates a coarse WBC region by touching-cell splitting based on concavity analysis. The second module further uses the coarse segmentation result of the first module as automatic labels to actively train a support vector machine (SVM) classifier. Then, the trained SVM classifier is further used to classify each pixel of the image and achieve a more accurate segmentation result. To improve its segmentation accuracy, median color features representing the topological structure and a new weak edge enhancement operator (WEEO) handling fuzzy boundary are introduced. To further reduce its time cost, an efficient cluster sampling strategy is also proposed. We tested the proposed approach with two blood cell image datasets obtained under various imaging and staining conditions. The experiment results show that our approach has a superior performance of accuracy and time cost on both datasets.\n\n\nIntroduction\n\nWhite blood cells (WBCs or leukocytes), which are the principal components of immune cells, play a vital role in the fight against infections. In clinical practice, the identification and counting of WBCs in blood smear are often used for diagnosing many diseases such as infections, inflammation, malignancy, leukemia, etc. In the past, the examination of blood smears is a highly complex, tedious, and timeconsuming manual task. Nowadays, with the rapid development of computer-aided methods, an automatic cell analysis system can support faster and more reproducible image analysis than manual analysis (Xing and Yang, 2016). Automatic cell analysis system generally includes four steps: image acquisition, cell segmentation, feature extraction and classification. Cell segmentation is often considered as the most important and critical step in the process, as it directly affects the accuracy and time complexity of subsequent steps.\n\nA typical blood smear image consists of WBCs, red blood cells (RBCs or erythrocytes), platelets and the background. The goal of cell segmentation is to extract WBCs from such complicated scenes and provide essential information for the feature extraction step. By using the salient color of nuclei, WBC detection has been well solved by various cell segmentation methods (Ko et al., 2009;Ko et al., 2011;Zheng et al., 2014). An example of WBC detection result is shown in Fig. 1. However, fast and robust segmentation of WBCs remains challenging. The reasons are three-fold. First, the original blood smear images are significantly different in color due to different staining techniques and illumination conditions. Second, variations may exist even within the same smear image because of different types of WBCs. For example, WBCs can usually be classified into five types (i.e., lymphocytes, monocytes, neutrophils, eosinophils and basophils) and different types of WBCs stained by the same technique display various colors. As shown in Fig. 2, the colors of different sub-images vary significantly due to both inter-and intra-image variations of the original blood smear images. Thirdly, WBCs frequently adhere to RBCs, leading to irregular shapes of WBCs, and the boundaries between the touching cells are blurred. Therefore, an accurate WBC segmentation is a challenging task because of the above three reasons. In this paper, we propose a self-supervised learning approach to achieve fast and robust WBC segmentation and focus on segmenting the cell region of interest (CROI), i.e., the whole WBC region including both nucleus and cytoplasm, from RBCs and the background which is denoted as the non-cell region of interest (non-CROI).\n\nVarious automated cell segmentation methods have been developed. Most of them are learning-based methods, which can generally be classified as supervised and unsupervised methods. The supervised methods, formulate the problem of segmentation as a multi-class classification. For example, each pixel can be classified into CROI and non-CROI. Classifiers such as Bayesian (Prinyakupt and Pluempitiwiriyawej, 2015), K-nearest neighbor (Kong et al., 2011), neural network (Yi et al., 2005, support vector machine (SVM) (Song et al., 2013;Ruberto et al., 2016), and random forest (Saidi et al., 2016), etc., have been used, where the classifiers are usually trained on manually-labeled training images. Their effectiveness highly depends on the imaging conditions and whether the extracted features can distinguish the CROI from the non-CROI (Song et al., 2013). Thus, some researchers try to extract more effective color features to mitigate this issue, for example, use L*a*b* color space (Sertel et al., 2009) or the most discriminant color space (MDC) (Kong et al., 2011), adopt scale-invariant feature transform (SIFT) descriptor (Song et al., 2013), and integrate texture features (Farhan et al., 2013a). Apart from using the traditional classifiers, deep convolutional networks (Ronneberger et al., 2015) have also recently been applied in cell image segmentation. These methods based on deep convolutional networks usually can get better results than the traditional classifier-based learning methods. However, all the abovementioned supervised methods need a large number of training samples, which are usually manually labeled but hard to gained for biomedical images. Besides, the supervised approaches usually do not work well when there are significant differences between the training  \n\nFig. 1 .\n1WBC detection result by using an earlier work(Zheng et al., 2014).\n\nFig. 2 .\n2Different types of WBC under various imaging and staining conditions. (a) Lymphocytes. (b) Monocytes. (c) Neutrophils. (d) Eosinophils. (e) Basophils. Top row: rapidly-stained images. Bottom row: traditional Wright-stained images. The ground truth segmentation results manually sketched by expert hematologists is shown at the bottom right corner of each image.\n", "annotations": {"author": "[{\"end\":264,\"start\":87},{\"end\":388,\"start\":265},{\"end\":577,\"start\":389},{\"end\":766,\"start\":578}]", "publisher": null, "author_last_name": "[{\"end\":96,\"start\":91},{\"end\":274,\"start\":270},{\"end\":400,\"start\":396},{\"end\":589,\"start\":586}]", "author_first_name": "[{\"end\":90,\"start\":87},{\"end\":269,\"start\":265},{\"end\":395,\"start\":389},{\"end\":585,\"start\":578}]", "author_affiliation": "[{\"end\":263,\"start\":98},{\"end\":387,\"start\":276},{\"end\":576,\"start\":402},{\"end\":765,\"start\":591}]", "title": "[{\"end\":84,\"start\":1},{\"end\":850,\"start\":767}]", "venue": null, "abstract": "[{\"end\":2547,\"start\":1117}]", "bib_ref": "[{\"end\":5326,\"start\":5309},{\"end\":5342,\"start\":5326},{\"end\":5360,\"start\":5342},{\"end\":7131,\"start\":7113},{\"end\":7165,\"start\":7131},{\"end\":7215,\"start\":7196},{\"end\":7236,\"start\":7215},{\"end\":7276,\"start\":7256},{\"end\":7537,\"start\":7518},{\"end\":7688,\"start\":7667},{\"end\":7751,\"start\":7732},{\"end\":7830,\"start\":7811},{\"end\":7885,\"start\":7863},{\"end\":7987,\"start\":7961}]", "figure": "[{\"attributes\":{\"id\":\"fig_0\"},\"end\":8554,\"start\":8477},{\"attributes\":{\"id\":\"fig_1\"},\"end\":8927,\"start\":8555}]", "paragraph": "[{\"end\":3981,\"start\":2566},{\"end\":4936,\"start\":3998},{\"end\":6679,\"start\":4938},{\"end\":8476,\"start\":6681}]", "formula": null, "table_ref": null, "section_header": "[{\"end\":2564,\"start\":2549},{\"attributes\":{\"n\":\"1.\"},\"end\":3996,\"start\":3984},{\"end\":8486,\"start\":8478},{\"end\":8564,\"start\":8556}]", "table": null, "figure_caption": "[{\"end\":8554,\"start\":8488},{\"end\":8927,\"start\":8566}]", "figure_ref": "[{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":5416,\"start\":5410},{\"attributes\":{\"ref_id\":\"fig_1\"},\"end\":5984,\"start\":5978}]", "bib_author_first_name": null, "bib_author_last_name": null, "bib_entry": null, "bib_title": null, "bib_author": null, "bib_venue": null}}}, "year": 2023, "month": 12, "day": 17}