{"id": 3914807, "updated": "2022-03-26 01:37:20.331", "metadata": {"title": "You Are What You Eat: Exploring Rich Recipe Information for Cross-Region Food Analysis", "authors": "[{\"first\":\"Weiqing\",\"last\":\"Min\",\"middle\":[]},{\"first\":\"Bing-Kun\",\"last\":\"Bao\",\"middle\":[]},{\"first\":\"Shuhuan\",\"last\":\"Mei\",\"middle\":[]},{\"first\":\"Yaohui\",\"last\":\"Zhu\",\"middle\":[]},{\"first\":\"Yong\",\"last\":\"Rui\",\"middle\":[]},{\"first\":\"Shuqiang\",\"last\":\"Jiang\",\"middle\":[]}]", "venue": "IEEE Transactions on Multimedia", "journal": "IEEE Transactions on Multimedia", "publication_date": {"year": 2018, "month": null, "day": null}, "abstract": "Cuisine is a style of cooking and usually associated with a specific geographic region. Recipes from different cuisines shared on the web are an indicator of culinary cultures in different countries. Therefore, analysis of these recipes can lead to deep understanding of food from the cultural perspective. In this paper, we perform the first cross-region recipe analysis by jointly using the recipe ingredients, food images, and attributes such as the cuisine and course (e.g., main dish and dessert). For that solution, we propose a culinary culture analysis framework to discover the topics of ingredient bases and visualize them to enable various applications. We first propose a probabilistic topic model to discover cuisine-course specific topics. The manifold ranking method is then utilized to incorporate deep visual features to retrieve food images for topic visualization. At last, we applied the topic modeling and visualization method for three applications: 1) multimodal cuisine summarization with both recipe ingredients and images, 2) cuisine-course pattern analysis including topic-specific cuisine distribution and cuisine-specific course distribution of topics, and 3) cuisine recommendation for both cuisine-oriented and ingredient-oriented queries. Through these three applications, we can analyze the culinary cultures at both macro and micro levels. We conduct the experiment on a recipe database Yummly-66K with 66,615 recipes from 10 cuisines in Yummly. Qualitative and quantitative evaluation results have validated the effectiveness of topic modeling and visualization, and demonstrated the advantage of the framework in utilizing rich recipe information to analyze and interpret the culinary cultures from different regions.", "fields_of_study": "[\"Computer Science\"]", "external_ids": {"arxiv": null, "mag": "2761189739", "acl": null, "pubmed": null, "pubmedcentral": null, "dblp": "journals/tmm/MinBMZRJ18", "doi": "10.1109/tmm.2017.2759499"}}, "content": {"source": {"pdf_hash": "4c0c7794e210e64d3b1b6ef99bcaa79a95bc4a28", "pdf_src": "MergedPDFExtraction", "pdf_uri": null, "oa_url_match": false, "oa_info": null}, "grobid": {"id": "070a6d6d0d42cfb978f9e02afcde05589f4d1bc1", "type": "plain-text", "url": "s3://ai2-s2-pdf-extraction-prod/parse-results/s2orc_worker/4c0c7794e210e64d3b1b6ef99bcaa79a95bc4a28.txt", "contents": "\nYou Are What You Eat: Exploring Rich Recipe Information for Cross-Region Food Analysis\nAPRIL 2018\n\nWeiqing Min weiqing.min@vipl.ict.ac.cn \nBing-Kun Bao bkbao@nlpr.ia.ac.cn.s.meiiswith \nShuhuan Mei shuhuan.mei@vipl.ict.ac.cn.y.ruiiswiththe \nYaohui Zhu yaohui.zhu@vipl.ict.ac.cn. \nFellow, IEEEYong Rui yongrui@lenovo.com.s.jiangis \nSenior Member, IEEEShuqiang Jiang sqjiang@ict.ac.cn. \nW Min \nY Zhu \nB.-K Bao \n\nInstitute of Computing Technology\nInstitute of Automation\nare with the Key Laboratory of Intelligent Information Processing is with the National Laboratory of Pattern Recognition\nChinese Academy of Sciences\n100190BeijingChina\n\n\nChinese Academy of Sciences\n100190BeijingChina\n\n\nUniversity of Chinese Academy of Sciences\n100049BeijingChina\n\n\nInstitute of Computing Technology\nKey Laboratory of Intelligent Information Processing\nShandong University of Science and Technology\n266590ShandongChina\n\n\nChinese Academy of Sciences\n100190BeijingChina\n\n\nInstitute of Computing Technology\nKey Laboratory of Intelligent Information Processing\nLenovo Group Ltd, Lenovo Corporate Research\n100085BeijingChina\n\n\nInstitute of Computing Technology\nwith the Key Laboratory of Intelligent Information Processing\nChinese Academy of Sciences\n100190BeijingChina\n\n\nChinese Academy of Sciences\n100190BeijingChina\n\n\nUniversity of Chinese Academy of Sciences\n100049BeijingChina\n\nYou Are What You Eat: Exploring Rich Recipe Information for Cross-Region Food Analysis\n\nIEEE TRANSACTIONS ON MULTIMEDIA\n204APRIL 201810.1109/TMM.2017.2759499Manuscript received February 28, 2017; revised July 17, 2017 and September 1, 2017; accepted September 4, 2017. Date of publication October 5, 2017; date of current version March 15, 2018.950 The associate editor coordinating the review of this manuscript and approving it for publication was Dr. Yi-Hsuan Yang. (Corresponding author: Weiqing Min.) Color versions of one or more of the figures in this paper are available online atIndex Terms-Cross-region food analysiscuisine recommendationcuisine summarizationculinary culture analysistopic model\nCuisine is a style of cooking and usually associated with a specific geographic region. Recipes from different cuisines shared on the web are an indicator of culinary cultures in different countries. Therefore, analysis of these recipes can lead to deep understanding of food from the cultural perspective. In this paper, we perform the first cross-region recipe analysis by jointly using the recipe ingredients, food images, and attributes such as the cuisine and course (e.g., main dish and dessert). For that solution, we propose a culinary culture analysis framework to discover the topics of ingredient bases and visualize them to enable various applications. We first propose a probabilistic topic model to discover cuisine-course specific topics. The manifold ranking method is then utilized to incorporate deep visual features to retrieve food images for topic visualization. At last, we applied the topic modeling and visualization method for three applications: 1) multimodal cuisine summarization with both recipe ingredients and images, 2) cuisine-course pattern analysis including topicspecific cuisine distribution and cuisine-specific course distribution of topics, and 3) cuisine recommendation for both cuisine-oriented and ingredient-oriented queries. Through these three applications,\n\nYou Are What You Eat: Exploring Rich Recipe Information for Cross-Region Food Analysis we can analyze the culinary cultures at both macro and micro levels. We conduct the experiment on a recipe database Yummly-66K with 66,615 recipes from 10 cuisines in Yummly. Qualitative and quantitative evaluation results have validated the effectiveness of topic modeling and visualization, and demonstrated the advantage of the framework in utilizing rich recipe information to analyze and interpret the culinary cultures from different regions.\n\n\nIndex\n\nTerms-Cross-region food analysis, cuisine recommendation, cuisine summarization, culinary culture analysis, topic model.\n\n\nI. INTRODUCTION\n\nU NDERSTANDING the cultural diversity has become imperative in almost every aspect of life. Cuisine has always been a significant aspect of cultures. The recipes from different cuisines are strong signals of the culinary habits of individuals from various parts of the world. For example, East Asian cuisines are dominated by some ingredients such as \"soy sauce\" and \"sesame oil\" from the recipes [2]. Some other ingredients uniquely represent a certain cuisine (e.g., mozzarella to the Italian cuisine) [51]. Therefore, the analysis of recipes can facilitate deep understanding of food from not only the health and marketing perspectives, but also the cultural one. Such analysis can further enable various applications, such as food preference learning [27], [62], cuisine classification [56] and health diet analysis [39]. Since the culinary habits have such importance for the culture, we address the topic of investigating and analyzing the culinary cultures of different countries through the recipes.\n\nExisting work mainly focuses on the analysis of recipes based on the textual descriptions (e.g., ingredients) [51] and checkin information from social websites [53]. For example, Sajadmanesh et al. [51] used the ingredients and attribute information, such as the taste and cuisine information to understand cuisines and culinary habits around the world. Silva et al. [53] analyzed the check-ins from Foursquare to identify cultural boundaries and similarities across populations at different scales. However, little work has investigated how to jointly utilize rich modality and attribute information to enable the analysis and comparison of culinary cultures comprehensively.\n\nWhile existing studies rely on text-oriented recipe analysis, we believe rich modality and attribute information are critical to comprehensively analyze the diversity of the culinary cultures. (1) Relying exclusively on text-based descriptions can impose high cognitive load in analyzing the culinary habits. Some works such as [14], [37], [62] have found the importance of visual information in eating habits-related applications. For example, Zepeda et al. [37] pointed out that photographic food diaries were more effective than written ones at prompting patients to truly understand their eating habits. Yang et al. [62] found that the analysis of image features can provide a valuable signal for food preference learning. (2) Different attributes (e.g., the course and cuisine information) reflect respective aspects of the recipes and jointly contribute to comprehensive recipe analysis. Through attribute-based analysis, we can reveal the culinary cultures from different perspectives. However, it is non-trivial to make the correlation between the content and various attributes. Because this requires us to design a more flexible model, which is able to incorporate arbitrary number of observed attribute information, yet inference remains relatively simple.\n\nTaking all the above-mentioned factors into consideration, we propose a culinary culture analysis framework (Fig. 1), which is capable of discovering topics conditioned on different attributes and visualizing them to enable various applications. In particular, we take Yummly, 1 one of the most popular recipesharing websites in our study. As shown in the left part of Fig. 1, each recipe includes the ingredients, food images and various attributes (e.g., the cuisine and course). Given the input of rich recipe information, we firstly propose a Bayesian Cuisine-Course Topic Model (BC 2 TM), which incorporates different attributes to discover the cuisine-course specific topics. Since topic models have been proved successfully in discovering meaningful and interpretable topics or patterns in the text domain, such discovered topics are very suitable for our cross-region food analysis and comparison. For further analysis and better visualization, based on the learned model parameters, namely topic-ingredient distribution, we then utilize the manifold ranking method to integrate both deep visual features and topic-ingredients to retrieve relevant food images for topic visualization. Finally, we exploit the topic modeling and visualization for three applications: (1) Multi-modal cuisine summarization, which summarizes cuisines with both recipe ingredients and food images. Through cuisine summarization, we can 1 http://www.yummly.com/ analyze and interpret the culinary cultures from the macro level.\n\n(2) Cuisine-course pattern analysis including topic-specific cuisine distribution and cuisine-specific course distribution of topics. Such comparative analysis can provide us with more details from the micro level. (3) Cuisine recommendation. It supports flexible queries including both cuisine-oriented and ingredientoriented queries. We conduct the experiment on one dataset, including about 66K recipes with the ingredients, food images, course and cuisine attributes from 10 cuisines from Yummly. Experiment results demonstrate the advantage of the framework in utilizing rich recipe information to discover and compare different eating habits from different regions.\n\nThe contributions of the proposed approach can be summarized as follows:\n\n1) To our knowledge, this is the first time to jointly utilize rich recipe information including multi-modal information and various attributes into a unified framework to enable comprehensive analysis and comparison of culinary cultures. 2) We propose a culinary cultures analysis framework, which is capable of discovering topics conditioned on different attributes and visualizing them for recipe-oriented applications. 3) We present a wide variety of applications, including 1) multi-modal cuisine summarization, 2) cuisine-course pattern analysis, and 3) cuisine recommendation. 4) We conduct the comprehensive evaluation on a real-world recipe dataset Yummly-66K and the experimental results have validated the effectiveness of our proposed method and framework. The rest of the paper is organized as follows. Section II reviews the related work. Section III presents the core components of the proposed culinary culture analysis, including the proposed Bayesian Cuisine-Course Topic Model (BC 2 TM) and manifold ranking based topic visualization. Section IV introduces three derived applications, including multi-modal cuisine summarization, cuisine-course pattern analysis and cuisine recommendation. Experimental results are reported in Section V. Finally, we conclude the paper and give the future work in Section VI.\n\n\nII. RELATED WORK\n\nOur work is closely related to four research fields: (1) topic modeling, (2) attribute based classification, recounting and summarization, (3) recipe analysis and recommendation, and (4) food image recognition.\n\n\nA. Topic Modeling\n\nThe Probabilistic Topic Models (PTMs) aim to explore a set of topics from a large collection of documents, where a topic is a distribution over terms and a document is a distribution over topics. They have been successfully applied to various tasks such as information retrieval and recommendation [26], [42]. Because many documents are generally associated with various metadata, such as the location and the date, some extensions to the basic topic model Latent Dirichlet Allocation (LDA) [7] have been proposed to take these metadata into account [3], [40], [41], [47]. For example, Bauer et al. [3] incorporated the location and time information into account to learn different topic space. Qian et al. [47] added the collection information into the topic model. We also incorporate the metadata information into the topic model. The difference from them is that we incorporate the cuisine and course information into our topic model to enable the analysis of the recipe-oriented culinary culture. Furthermore, a topic visualization method is utilized to visualize discovered topics and facilitates the analysis and interpretation of discovered topics.\n\n\nB. Attribute Based Classification, Recounting and Summarization\n\nAs an effective mid-level representation, attributes have been widely used in many applications, such as zero-shot classification [34], [60], [66], recounting [10], [18], [36], [64] and summarization [32], [49], [50]. Zero-shot recognition is used to predict class labels for target domain instances based on the side information (e.g., attributes) of unseen classes in the source domain. For example, Zhang et al. [66] proposed a novel general probabilistic method for zero-shot recognition by learning joint latent similarity embeddings for both source and target domains. Xian et al. [60] presented a novel latent variable based model for learning a nonlinear compatibility function for zero-shot classification. Besides zero-shot classification, the attributes are useful for video recounting, which is used to explain why this video contains the desired event [64]. For example, Chang et al. [10] utilized the semantic evidence based on the concepts and attributes to simultaneously conduct event detection and recounting.\n\nThese above-mentioned two tasks focus on visual attribute learning from images or videos. In contrast, attribute based summarization is mainly to use rich metadata as attributes from the social media for visual summarization. For example, Kennedy et al. [32] used the location, tags and the visual features of images to generate diverse and representative landmark images. Similar to [32], Rudinac et al. [49] also utilized these rich metadata information to generate visual summarization for certain geographic area. Later, they [50] further incorporated the user preferences, such as the popularity and visual aesthetic appeal for visual summarization of image collections. We also use the attributes (cuisine and course) for cuisine summarization in our work, but with three differences. (1) Motivation. We aim to summarize cuisines for cross-region food analysis and comparison from the cultural aspect in the food domain. In contrast, these works mainly focus on visual summarization for travel or image organization. (2) Methodology. Considering the importance of ingredients for distinguishing different cuisines [2], [51], we first use the topic model to extract the patterns of the ingredients, and then select relevant food images to facilitate further analysis. However, these existing works focus on visual summarization. The text information and other attribute information are used to help visual summarization as the auxiliary information. (3) Results display. We show the summarized results in multi-modality by the topics while these works place the emphasis on visual summarized results and show these results with only images.\n\n\nC. Recipe Analysis and Recommendation\n\nThere have been many efforts on the processing of recipes for the analysis of recipes. For example, Ahn et al. [2] constructed a data-driven flavor network relating ingredients together to capture the flavor compounds shared by culinary ingredients. Jain et al. [28] adopted this flavor network to further analyze culinary practices of specific cultures in the Indian cuisine. In addition, some works [8], [44] applied LDA to the recipes to find a set of ingredient bases. For example, Kusmierczyk et al. [33] used a topic model to mine and model online food content by combining text topics with related nutrient facts. Recently, Sajadmanesh et al. [51] presented a study of recipes including the ingredients and flavor information from Yummly to understand cuisines and culinary habits from different regions. In addition, Silva et al. [53] identified the cultural boundaries by analyzing the check-ins from Foursquare. Mejova et al. [39] analysed the metadata associated with images from Instagram to analyze the obesity patterns. Our work is different from them in that we provide a framework to utilize multi-modal (e.g., the ingredients and food images) and rich attribute information for comprehensive understanding of the culinary cultures from different regions.\n\nBesides recipe analysis, some works [17], [35] modeled the hidden factors between users and ingredients for recommendation. For example, Lin et al. [35] proposed a content-driven matrix factorization approach to model the latent dimensions of recipes, users, and features. Ge et al. [19] leveraged a data set including users' ratings and tags, which signal the food's ingredients that the users like for recipe recommendation. In addition, Zhang et al. [65] used the check-ins to recommend the user a list of restaurants for his next dining. Our work is different from them in that we recommend the cuisine and the course information based on the ingredients on hand.\n\n\nD. Food Image Recognition\n\nA lot of works focus on food image recognition [9], [13], [16], [30]. For example, some works such as [21], [55] employed the deep network for food classification. Some works [4], [6], [23], [24], [61] developed restaurant-specific dish recognition. There are also some works on mobile food recognition [15], [31], [38], [46], [57], mobile food calorie estimation [45] and recording [1]. For example, Tanno et al. [57] used the multi-scale network-in-networks to extract the deep features for real time food recognition and implemented multi-threaded mobile applications on both iOS and Android mobile platforms. Recent work [11] proposed deep architectures for simultaneous learning of ingredient recognition and food categorization by exploiting the visual features, ingredients and image categories. In addition, many cross-modal models have been proposed for cross-modal retrieval, such as [12], [29], [52]. For example, Chen et al. [12] presented a stacked attention network for learning the commonality between the recipe image and ingredients to enable the cross-modal retrieval between recipes and recipe images. Recently, Salvador et al. [52] further proposed a neural network to find a joint embedding of recipes and images for the imagerecipe retrieval task. In addition, they released a new large-scale, structured corpus of over 1 million cooking recipes and 800K food images. In contrast, Min et al. [43] proposed a multitask deep belief network to enable both cross-modal recipe image retrieval given additional attributes and richer image annotations by inferring ingredients and attributes from the food images. Our work is different from [43] in that: (1) Motivation. [43] focuses on multi-modal learning and retrieval while we mainly explore rich recipe information for cross-region food analysis and comparison from the cultural aspect. (2) Methodology. [43] uses Restricted Boltzmann Machine (RBM) based undirected graph model while we adopt the topic model based directed graph model, which is more suitable for our task because of its interpretation. Rich et al. [48] performed the first large scale content analysis of food images from Instagram to understand the content of partially-labelled images taken in-the-wild. Different from their work, we focus on utilizing the food images to visualize the discovered ingredient topics for summarizing, analyzing and comparing the culinary habits from different countries.\n\nIn addition, there are some food datasets available, such as FoodCam-256 [31], ETHZ Food-101 [9], UPMC Food-101 [59], Geolocation-food [61], VIREO Food-172 [11] and Yummly-28K [43]. FoodCam-256 and ETHZ Food-101 are suitable for the task of food recognition, since there are food images with only the labels. In contrast to ETHZ Food-101, UPMC Food-101 contains additional text information, and can be used for multimodal food recognition. Geolocation-food 2 and VIREO Food-172 3 contain more metadata information, such as the geo-tag information and ingredient information. However, these recipes belong to the Chinese dishes and are not suitable for cross-region food analysis. Our previous work published a Yummly dataset Yummly-28K 4 for recipe retrieval and exploration. Based on this dataset, we further enlarge this dataset to larger scale Yummly-66K for cross-region food analysis.\n\n\nIII. BAYESIAN CUISINE-COURSE TOPIC MODELING AND VISUALIZATION\n\nIn this section, we first propose a Bayesian Cuisine-Course Topic Model (BC 2 TM) to learn cuisine-course specific topic space and then use the manifold ranking method for topic visualization.\n\n\nA. Bayesian Cuisine-Course Topic Model (BC 2 TM)\n\nIntuitively, the ingredients in one recipe can be classified into two categories: 1) common ingredients (e.g., \"water\" and \"flour\"), and 2) ingredients related to the topic whose cuisinecourse distribution we are interested in analyzing. Correspondingly, the proposed BC 2 TM is to mine two kinds of topics: 1) Background topic, which represents more common ingredients;\n\n(2) Cuisine-Course topics, which are more related to certain cuisine and course. Based on the above concepts, the problem of BC 2 TM can be defined as follows:\n\nGiven the recipe set D, which covers a set of ingredients W , a set of cuisines L and a set of courses C, each recipe d is associated with the cuisine l d and the course c d . The goal of BC 2 TM is to learn (1) two kinds of topic spaces, background topic space ϕ bg and cuisine-course topic space {ϕ lc z } z ∈Z , and (2) the distributions over cuisine-course topics {ψ (l,c) } (l,c)∈LC , where ϕ bg , ϕ lc z and ψ (l,c) denote the background distribution of the corpus, the multinomial distribution over ingredients for cuisine-course topics, and the multinomial distribution over the cuisine-course topics for certain l and c, respectively. z and Z are the cuisine-course topic assignment and the set of cuisine-course topics. LC is the set of cuisine-course pairs and LC = L × C.\n\nThe reasons for modeling the background topic are as follows (1) Different countries have different culinary habits, and thus have different ingredients from their recipes. However, there are some ingredients shared by all the countries. Therefore, we choose modeling these shared ingredients using the background topic for more accurate modeling of the recipe data. In the following experiment, we find that there are indeed some ingredients such as salt and water shared from all countries. (2) These ingredients frequently occurred in the recipes happens in many discovered cuisine-course topics with higher probability scores, and thus probably influence the interpretation of the learned cuisine-course topics. Therefore, we use the background topic to represent common ingredients and separate them from the cuisine-course topics to make discovered cuisine-course topics more interpretable.\n\n1) Generative Process of BC 2 TM: Given the recipe set D, each recipe d ∈ D is a combination of (i) a background distribution over common ingredients ϕ bg and (ii) a mixture distribution over cuisine-course topics Z. The switch variable s is sampled from multinomial distribution π d , which represents the proportion distribution of two kinds of topics in one document. As presented in Fig. 2, the generative process of the BC 2 TM model is shown in Algorithm 1.\n\nIn Algorithm 1, w d denotes a recipe d with a sequence of N d ingredients. Multi(·), Dir(·), Bin(·) and Beta(·) denote the Multinomial distribution, the Dirichlet distribution, the Binomial distribution and the Beta distribution, respectively.   [7], we assume the symmetric Dirichlet priors, that is for Dir(α α α), where α α α = (α 1 , . . . , α Z ), α z = α, z ∈ {1, . . . , Z}, similarly for Dir(β β β bg ) and Dir(β β β lc ). We also assume the symmetric Beta prior Beta(γ γ γ), γ γ γ = (γ bg , γ lc ), that is γ = γ bg = γ lc . β bg , β lc , γ, γ bg and γ lc are hyper-parameters.\n\n2) Model Inference and Parameter Estimation: To estimate the parameters of BC 2 TM, we need to estimate the latent variables conditioned on the observed variables, namely p(s, z|w, α, β, γ), where β = {β bg , β lc }. we use the collapsed Gibbs sampling [20] for model inference, where the derivation of model inference is detailed in the appendix. After the Gibbs sampler reaches burn-in, we estimate the following parameters:\nπ d,s = n d,s + γ n d,bg + n d,lc + 2γ s ∈ {bg, lc} ψ (l,c),z = n lc (l,c),z + α z n lc (l,c),z + Zα ϕ bg w = n bg w + β bg w n bg w + W β bĝ ϕ lc z ,w = n lc z ,w + β lc w n lc z ,w + W β lc(1)\nwhere n d,s is the number of times of the words in the document d assigned to the background topics s = bg and cusine-course topics s = lc, respectively. n lc (l,c),z is the number of times that cuisine-course topic z is assigned to the cuisine-course (l, c). n bg w is the number of times that the word w is assigned to the background distribution. n lc z ,w is the number of times that the word w is assigned to the cuisine-course topic s = lc.\n\n\nB. Topic Visualization\n\nAfter parameter estimation, we obtain a set of cuisine-course topics as the ingredient bases in the recipe set. To visually enrich discovered ingredient bases for better interpreting what can we cook using them, we utilize estimated model parameters and visual information to retrieve relevant food images.\n\nWe resort to the manifold ranking [22] to retrieve relevant images. For manifold ranking, given a set of data,\nχ = {v i } |D | i=1 ,\nwhere |D| is the number of recipes, we build a graph G on the data. S denotes the adjacency matrix, where S ij is the weight of the edge between node i and j. Let F : χ → R be a ranking function, which assigns each document v i to a ranking score\nf i , F = [f 1 , . . . , f |D | ] .\nIn addition, we need to define an initial vector Y = [y 1 , . . . , y |D | ] .\n\nThe cost function is defined as\nJ(F ) = 1 2 ⎛ ⎝ |D | i,j =1 S ij f i √ A ii − f j A j j 2 + λ |D | i=1 f i − y i 2 ⎞ ⎠ (2) = Tr(F UF ) + λ F − Y 2(3)\nwhere λ > 0 is the regularization parameter. The diagonal elements of S, S ii = 0. A is a diagonal matrix with A ii = M j =1 S ij . U is the symmetrical normalization of S, U = A −1/2 SA −1/2 . Tr(·) is the trace of the matrix.\n\nWe finally solved the following optimization problem:\nmin F {Tr(F UF ) + λ F − Y 2 }(4)\nWe iterate the following equation to minimize the cost function to obtain the final ranking score F * [22].\nF (t + 1) = ρU F (t) + (1 − ρ)Y(5)\nwhere ρ = 1 1+λ . Based on the set of deep features from the VGG deep network [54], we construct the visual correlation graph S, where each recipe image is one node i, with the representation v i . To effectively construct the edges e ij between node i and other nodes, following the general idea of [5], we connect node i and its k visual neighbors to form the edges from node i and the weight of an edge is defined as the Gaussian kernel S ij = exp(−\nd 2 (v i ,v j )2σ 2 )\n, where σ is a parameter and d(v i , v j ) is a Euclidean distance between v i and v j .\n\nFor the initial ranking score, each topic has different proportions over different courses and cuisines. In order to retrieve more relevant food images, we first derive p(l, c|z) as follows:\np(l, c|z) = p(l, c, z) p(z) = p(l, z, c) c ∈C l ∈L p(z|c , l )p(c , l ) =ψ (l,c),z p(c, l) c ∈C l ∈Lψ (c ,l ),z p(c , l )(6)\nwhere p(c, l) is the joint probability of the cuisine c and l, which is given by the ingredient count in cuisine l annotated by the course c divided by the total ingredient count in the collection. We then select the set of cuisine-course pairs o = {(l, c)} when p(l, c|z) > . For each pair (l, c) ∈ o, the initialized ranking score is\ny (l,c),i = ⎧ ⎨ ⎩φ ϕ ϕ l c z w d i |φ ϕ ϕ l c z ||w d i | (l, c) ∈ o 0 otherwise where w d i is represented as TF-IDF.\nWe use (4) to obtain F * (l,c) and the final score is the average of all the F * (l,c)\nF * = 1 |o| (l,c)∈o F * (l,c)(7)\nIV. APPLICATIONS\n\n\nA. Multi-Modal Cuisine Summarization\n\nA direct application is to summarize cuisines with ingredients and food images based on discovered topics and corresponding food images. A user (e.g., a foodie) would like to know more details of certain cuisine, like \"What are the most representative recipe in Chinese food?\" \"Can you tell me a few distinct ingredients and representative food images in French?\" To summarize representative aspects of a cuisine, we first derive a probability distribution over topics conditioned on certain cuisine l q as follows:\n\np(z|l q ) = p(z, l q ) p(l q ) = c∈C p(z, l q , c) c∈C p(l q , c)\n= c∈C ψ (l q ,c),z p(l q , c) c∈C p(l q , c)(8)\nFor the topics with higher scores, we then remove topics with higher similarity according to their Jensen-Shannon (JS) divergence D J S (z i ||z j ), where D J S (z i ||z j ) = 1 2 (D K L (z i ||z j ) + D K L (z j ||z i )) and D K L (·||·) denotes the Kullback-Leibler (KL) divergence. For the remaining topics, we select top-ranked ingredients according toφ lc z ,w as the textual representation and retrieve relevant food images using (4) as the visual representation. Through cuisine summarization, we can analyze the culinary culture from different regions at the macro level.\n\n\nB. Cuisine-Course Pattern Analysis\n\nBased on learned parameters from the BC 2 TM, we can also compute various kinds of topic patterns. For example, we can derive the cuisine distribution on certain topic and the course distribution based on certain cuisine and certain topic.\n\nFor the cuisine distribution of topics, the cuisine distribution on certain topic can be computed according to the Bayes' theorem as\np(l|z) = p(l, z) p(z) = c ∈C p(l, z, c ) c ∈C l ∈L p(z|c , l )p(c , l ) = c ∈Cψ (l,c ),z p(c , l) c ∈C l ∈Lψ (c ,l ),z p(c , l )(9)\nWith the corresponding topic and cuisine constraint, we then use (4) to show relevant food images to further facilitate our analysis.\n\nIn addition, given one cuisine, we can calculate this from the Bayes' theorem in a similar way by\np(c|z, l) =ψ (l,c),z p(c, l) c ∈Cψ (l,c ),z p(c , l)(10)\nBased on p(l|z), p(c|z, l) and retrieved food images, various cuisine-course patterns can be discovered and analyzed. Through these distributions, we can analyze the culinary culture from different regions at the micro level.\n\n\nC. Cuisine Recommendation\n\nA user generally has some preferences about some cuisines. There are two frequently asked questions : 1) Being similar to a given cuisine. \"I quite enjoyed the Chinese food. Are there any other cuisines with similar style?\" 2) Being relevant to a given cooking. \"I have some ingredients at hand, what kind of cuisine and course do I can cook?\" For the first question, we firstly define the distance between different cuisines. For certain query cuisine l q , According to (8), we obtain the representation for certain cuisine l as\nψ l = {p(z|l)} z ∈Z(11)\nThe symmetric similarity between two cuisines is measured by the distance between their corresponding multinomial distributions over topics through the following Gaussian kernel\nCuiSim(l i , l j ) = exp − D J S (ψ l i ||ψ l j 2σ 2(12)\nThe larger the CuiSim(l i , l j ), the larger the similarity. Given a query cuisine l q and a candidate destination set L, each cuisine l ∈ L has a similarity to l q in the cuisine topic space, defined as CuiSim(l q , l j ). The ranking score for recommendation is computed according to (12).\n\nFor the second question, we consider the query document d q . We also need a representation and corresponding similarity metric of d q , so as to measure the relevance of a (cuisine, course) pair to given query ingredients. We compute the representation p(z|d q ) as a probability through the Gibbs sampler by maximizing the following likelihood function\np(w d q |D tr ain ) = N d q i=1 π d q ,bgφ bg w i + π d,lc z ∈Z p(z|d q )φ lc z ,w i (13)\nWhen a query document d q is observed, the learned parameters from the training setφ bg w i andφ lc z ,w i are fixed. A Gibbs sampler is run to update the document-specific parameters p(z|d q ), π d q ,bg and π d q ,lc .\n\nWe then compute p((l, c)|d q ) as follows:\np((l, c)|d q ) = z p((l, c)|z)p(z|d q )(14)\nwhere p((l, c)|z) is computed through (6). Finally, we rank the results according to (14).\n\n\nV. EXPERIMENT\n\nIn this section, we firstly describe the experimental setting including the dataset and implementation details. We then evaluate the performance of the proposed BC 2 TM qualitatively and quantitatively. Next, we evaluate the performance of topic visualization. Finally, we evaluate the performance of the proposed three applications including multi-modal cuisine summarization, cuisine-course pattern analysis and cuisine recommendation, respectively.\n\n\nA. Yummly-66K Dataset\n\nThe experiment is conducted on 10 different cuisines, including American, Italian, Mexican, Indian, French, Thai, Spanish, Chinese, Greek, Japanese from different regions. Note that we will use these country names and their corresponding abbreviations 5 interchangeably for convenience. Our dataset consists of two parts. One part is from our previous work [43], including 27,638 items, where each recipe item includes the food image, the recipe name, the ingredients, cuisine and course information. For the other part, we used the URLs in Yummly provided by [51] to crawl corresponding images. The crawled images and other recipe information provided by [51] from these 10 cuisines constitutes the second part of our dataset. We adopt the preprocessing method [43] to preprocess each ingredient line. After processing, the vocabulary of ingredients is 2,416. For the ingredients with more than two words, we represent them by concatenating them using '-'. For example, we use soysauce to represent the ingredient \"soy sauce\". Each recipe item includes the recipe name, preprocessed ingredient line, recipe image, cuisine and course attribute information. There are 14 kinds of course attributes including Main Dishes, Desserts, Side Dishes, Salads, Afternoon Tea, Soups, Lunch, Snacks, Condiments and Sauces, Breads, Breakfast and Brunch, Beverages, Cocktails, Appetizers. 6 Similarly, we use these course names 5 The corresponding abbreviations are USA, ITA, MEX, IND, FRA, THA, ES, CHN, GRE, JPN. 6 There are 13 kinds of supported courses in Yummly and consider Lunch and Snacks as one kind of course attribute. However, we found that many recipe items are either only annotated by Lunch or by Snacks. Therefore, similar to [27], we consider Lunch and Snacks as two kinds of attributes. If one recipe item is annotated as Lunch and Snacks, we think they belong to both Lunch course and Snack course.  7 The statistics of the resulting dataset are shown in Table I. Fig. 3 shows some examples.\n\n\nB. Implementation Details\n\nFor each image, we represent the visual content by deep learning features. Similar to [25], [43], we first use the food101 dataset [9] to finetine the VGG-16 deep network [54] and then compute the 4,096 dimensional vector representation for each image in Yummly-66K by extracting the network activations in the final fully-connected layer.\n\nAs for the hyper-paramerters of the model, without any prior knowledge, we empirically set the fixed values, i.e., α = 1.0/Z, Z is the number of topics. β bg = β lc = 0.01, γ = 1.0. In addition, as shown in Fig. 3, each recipe is associated with one cuisine, but probably with more than one course information. Similar to [63], we consider such recipe as multiple items, where each item is associated with one cuisine and one course.\n\nFor recipe image retrieval, the parameter σ of the gaussian kernel function is empirically set as 0.15 while in cuisine recommendation application, the parameter σ of the gaussian kernel function is 0.5. The number of visual neighbors is set to be 100. The tolerance of the iterations for optimization in manifold ranking is 1e − 7. The parameter ρ is empirically set as 0.50. The threshold for selecting the set of cuisine-course pairs is empirically set as 0.001. For our topic model, we run the training procedure with 3,000 iterations.\n\n\nC. Evaluation of BC 2 TM 1) Quantitative Evaluation:\n\nTo demonstrate the effectiveness of the proposed BC 2 TM model, we compare it with the following two baselines: 1) BC 2 TM_NC. This baseline is similar to our method, but does not consider the course information. 2) BC 2 TM_NB. This baseline is similar to our method, but does not consider the background distribution. We resort to the perplexity [7] as the evaluation metric, which is a standard measure for estimating how well one generative model fits the data. The lower the perplexity score is, the better the performance. In BC 2 TM, the perplexity of a test set of ingredient descriptor w d is defined as follows:\nperplexity(D test ) = exp − d∈D t e s t log p(w d |D tr ain )\nd∈D t e s t N d (15) where\np(w d |D tr ain ) = p(w d |π π π, Ψ lc ) = N d i=1 π d,bgφ bg w i + π d,lc z ∈Z ψ (l d ,c d ),zφ lc z ,w i(16)\nwhere D tr ain is the training set and D test is the test set. N d is the count of ingredients in the document d.\n\nWhen the words of a test document d is observed, the parametersφ bg w i andφ lc z ,w i learned from the training set are fixed. A Gibbs sampler is run on the observed words to update the document-specific parameters ψ (l d ,c d ) , π d,bg and π d,lc . These updated parameters are used in the computation of perplexity. We divide our dataset into two parts: the training set and the test set. For each cuisine, we randomly select 80% of the recipe items as the training data and the remaining 20% of the recipe items as the test data. We set the number of topics Z ∈ {20, 40, 60, 80, 100, 120, 140, 160, 180, 200}.\n\nThe perplexity scores over different topic number for different models are shown in Fig. 4. We can see that (1) The perplexity score of both BC 2 TM and BC 2 TM_NB is much lower than BC 2 TM_NC. That means these two models are better than BC 2 TM_NC. The probable reason is that the added course information provides a better prior for the content of the ingredient document. This attribute information can help improve the generalization performance of the model.(2) the BC 2 TM model has lower perplexity scores than BC 2 TM_NB when Z > 40. This indicates that the model is using the background words \"route\" to better learn predictive models for recipe items. (3) It is clear that the perplexity decreases much slower when Z > = 100. Since larger topic number requires more computation cost, we choose the desired topic number Z to be 100 for our model in the following experiments. It takes about 24 minutes with 3,000 iterations and 100 topics to converge when training the topic model using the Gibbs sampling on our dataset.\n\n2) Qualitative Evaluation: We further demonstrate the effectiveness of BC 2 TM by providing some example topics. These  Table II, where \"#j\" denotes the j-th topic index. Each topic is represented by 10 top-ranked ingredients, sorted by their topic-ingredient distributionsφ lc . As shown in Table II, we can see that these topics have a reasonable physical interpretation as the ingredient bases. For example, some topics correspond to a particular dish type. Topic #2 is a whole lot of spices. Topic #12 represents the ingredients of a cake. Topic #36 probably denotes the Italy-style ingredients. Topic #43 is a typical kind of drink. Topic #68 with the soy-sauce and sesame-oil gives it an oriental taste because Asians such as Chinese use these plant derivatives widely in their food and other countries do not [2]. Topic #88 is the ingredient set for the noodles. Topic #89 is a kind of fruit drink. Topic #93 is the Spanish-style ingredients. In addition, we show the background distribution learned by our model in Fig. 5. We can see that these ingredients such as salt, egg and water are very common and shared by most recipes from different cuisines.\n\n\nD. Evaluation of Topic Visualization\n\nSince it is usually subjective to evaluate the extent to which a recipe image with ingredients is relevant to one topic, we resorted to a user study to evaluate the relevance of retrieved food images. As a comparison, we implemented a baseline method, basic manifold ranking (basic_MR), which does not consider the proportion over different courses and cuisines p(l, c|z). 30 participants (20 graduate students and 10 IT workers) were asked to evaluate the relevance to the topic using 1 to 5 ratings, from two aspects namely (1) topic relevance (i.e., to what extent the retrieved food images with associated ingredients are describing this topic), and (2) overall satisfaction. Whether the proposed method can retrieve food images not only relevant to the topic but also informative and comprehensive.\n\nWe randomly select 20 topics as the query topics. For each topic, we show 15 top-ranked food images for each method. Each recipe image is associated with the ingredients, cuisine, course and recipe names. We averaged all the participators' evaluations for the query topics as the ratings of all the methods. The results are shown in Fig. 6. As depicted in Fig. 6, our method  II  SOME EXAMPLES OF DISCOVERED TOPICS   Topic 2  Topic 12  Topic 36  Topic 68  Topic 72 ground  shows advantages in both aspects due to the constraint of the proportion over different courses and cuisines p(l, c|z), and the differences are significant for both two aspects (two sided sign test: p < 0.05).\n\nWe further verify the effectiveness of retrieval method and find what kind of cuisine we can do using these discovered topics. These examples are shown in Fig. 7(b). We use 5 topranked cuisine images from the dataset for each topic. Meanwhile, we label discovered images with their associated cuisines and recipe names. As shown in Fig. 7(b), we can see some interesting results. For example, as mentioned above, Topic #68 with the soy-sauce is an oriental taste and it is suitable for the Asian cuisine, such as Chinese and Japanese. The ingredients of Topic #91 belong to the meat. From these visualized results, we can easily interpret discovered topics. The ingredients of Topic #93 is suitable for Spanish cuisine, such as \"Pork Loin Roast with Paprika\" and \"Slow Cooker Garlicky Shrimp\".\n\nIn addition, for cuisine or course specific topics, our method can retrieve more relevant food images, such as Topic #88. This topic is more relevant to Chinese cuisine. Therefore, the top ranked food images from our method all belong to the Chinese cuisine. In contrast, the retrieval results from basic_MR contain images from other cuisines. In addition, the Topic #93 is more relevant to the Spanish cuisine and Main (or Lunch) course. Therefore, our method can retrieve food images about meat, which are more reasonable than basic_MR.\n\n\nE. Multi-Modal Cuisine Summarization\n\nBased on the proposed framework, we can summarize cuisines using discovered topics and retrieved food images. For each cuisine, we finally empirically select 5 relevant topics. For each topic, we show 5 top-ranked ingredients and 8 top-ranked food images. Two example cuisine summaries are illustrated in Fig. 8 for Chinese and Italian, respectively. For each topic, the center position is the ingredients, generated by wordcloud. 8 From such summaries, users could easily understand the culinary habits and local characteristics of one region, from a representative and comprehensive overview with both ingredient and visual information. For example, in Chinese cuisine, their ingredient base often includes the plant derivatives such as soy-saurce and sesame-oil. They often use them when they eat dumplings. In order to compare different cuisines in details, we next analyze cuisine-course patterns under different cuisines and courses.\n\n\nF. Cuisine-Course Pattern Analysis\n\nTo evaluate the cuisine distribution of certain topic, we show some interesting examples of three topics: Topic #61, Topic #68 and Topic #89 in Fig. 9. Fig. 9(a) shows that there is the highest probability in Italian. As mentioned before, Topic #61 is a typical of Italian-style ingredient base. Therefore, the result is reasonable. Similarly, the ingredient base Topic #68 with the soy-sauce is a dish with the oriental taste because Asians use soy-sauce widely in their food and other ethnic groups do not. From Fig. 9(b), we can see that the top-3 cuisines with the higher probability are indeed Asian cuisines, Chinese, Japanese and Thai. Since the soy sauce originated in China, 9 there is no doubt that there is the highest probability in Chinese cuisine. Japan also likes the dish with the soy-sauce. This is because they think 9 https://en.wikipedia.org/wiki/Soy_sauce umami is as important as sweetness or saltiness and soy sauce is the prime example of umami taste. 10 The soy-sauce is also as one of ten basic sauces in Thai. In order to facilitate further analysis, we retrieve relevant food images with the recipe name using p(w|z, l) and (4). As shown in Fig. 10, for each cuisine, we show top 5 food images. We can see that the home cooking of Chinese cuisine such as the chicken and potatoes uses the seasonings of Topic #68 including the soy-sauce, sesame oil, grinder, vinegar and so on. We can find that when Chinese eat dumplings, they often use the soy-sauce, vineries and other ingredients as the sauce base. In addition, from Fig. 10, we can find that Asians use the ingredients from Topic #68 when eating noodles, such as Japanese and Thai.\n\nIn addition, we can also plot the course distribution from different cuisines given one topic according to (10) to analyze meal-cuisine relationships in detail. Fig. 11 shows two examples of topics: Topic #72 and Topic #91. Because Topic #72 includes milk, lemon and other drink ingredients, it is clear that such ingredient base is fit for the Side Dish and Beverages, which is consistent with Fig. 11(a). We can also find French use these ingredients for the Snacks while Beverages for Chinese cuisine. Topic #91 is about chicken, it is obvious that such ingredients Fig. 8. An illustration of the generated cuisine summaries for (a) Chinese cuisine and (b) Italian cuisine, each composed of 5 topics including 5 top-ranked ingredients (the center position of each topic) and 8 top-ranked images for each topic. In the summaries, the larger an ingredient is, the larger the probability is. mainly belong to the Main Dishes and Lunch, which is also consistent with the discovered results in Fig. 11(b).\n\n\nG. Cuisine Recommendation\n\nSince the effectiveness of similarity-oriented cuisine recommendation highly relies on the pair-wise similarity metric of different cuisines, we directly evaluate this metric's capability of discovering cuisines from a given set. we computed pairwise cuisine similarities of all the 10 cuisines in our database using (12) to form a cuisine similarity graph and use the Grephi software 11 to visualize this graph. Nodes with the same color are those that belong to the same group, clustered by the K-means algorithm and the thickness of the edges indicates the pairwise similarity, as shown in Fig. 12. 11 https://gephi.org/ We find the following interesting results: 1) the geographical distance between countries plays an important role in determining the similarity of the eating habits. For example, some Asian countries, such as Chinese, Japanese and Thai are more similar than other countries. Indeed, historically there were more trade and cultural exchanges between spatially-neighboring countries, so they would share more similar eating habits in their food culture. 2) Due to the similarity of cultures in Europe and America, it can bee seen that ingredients from these regions are categorized as one cluster. 3) There is an outlier detected in our result, Indian. This is because the eating habits of Indian is quite different from other countries of the Asian countries. Based on the analysis, these different categories of cuisines are roughly differentiated by our similarity metric. his verified the effectiveness of our BC 2 TM model. In addition, we found that the work [51] also reported their cuisine similarity based on two kinds of ingredient-based similarity, namely TF-    IDF and Jensen-Shannon divergence. We compared our cuisinesimilarity graph with theirs and found that our cuisine similarity graph is basically consistent with their results. However, our proposed framework can also be applied to multi-modal cuisine summarization and the ingredient topic discovery.\n\nFor ingredient-relevant cuisine and course recommendation, our task is to recommend both relevant cuisine and course information given the ingredients. We split the dataset into the training set and test set, as the same split in quantitative evaluation of BC 2 TM. Each recipe item probably has more than one label. For example, the last example of Fig. 3 consists of two kinds of labels (Chinese,Appetizers) and (Chinese,Main Dishes). Therefore, we consider this task as the annotation task. Similar to [58], we use the top-N F1-measure, denoted as F1@N, where we set N = 5 as the evaluation metric.\nF 1@N = 2 * precision@N * recall@N precision@N + recall@N(17)\nWe consider the following methods for comparison. 1) LDA-Based K-Nearest Neighbors (LDA_KNN). LDA_KNN retrieves all recipe items to find the nearest neighbors by computing the cosine similarity between the query's text topic vector representation and the topic vector from the training set. 2) BC 2 TM_NB. This baseline is similar to our method, but does not consider the background distribution. 3) RBM: Restricted Boltzmann Machine [43]. Compared with directed topic model, this work used another kind of graph model, namely undirected RBM based graph model. In this work, we consider the ingredients to recommend cuisines and courses and use a standard binary RBM with 100 hidden layers, which is the same as the number of topics in our topic model. Based on the learned latent features h, we use two softmax classifiers to predict the cuisine score p(l|h) and the course score p(c|h), respectively.We finally obtain the final score p(l, c|h) = p(l|h)p(c|h). The evaluation results are shown in Fig. 13. We can see that our method outperforms LDA_KNN and BC 2 TM_NB, mainly because of its good latent representations on cuisine-course information. Also on this dataset, the performance of RBM is the best in all the methods. However, such method is not suitable for our previous two applications based on discovered interpreted topics.\n\n\nVI. CONCLUSION\n\nThis paper presented a culinary culture analysis framework, which is capable of jointly utilizing the ingredients, food images and various attributes to enable various applications. We proposed a Bayesian Cuisine-Course Topic Model (BC 2 TM) to incorporate the cuisine and course information to discover cuisine-course topics. A manifold ranking method is utilized to retrieve topic-relevant food images for topic visualization. We applied the topic modeling and visualization method into three applications, including multi-modal cuisine summarization, cuisine-course pattern analysis and cuisine recommendation. Through our proposed framework, we indeed found some interesting results, which reveal the diversity of the culinary cultures. For example, some topics such as the one with the ingredients soy-sauce and sesame-oil exclusively belong to some regions in Asia, such as Chinese, Thai and Japanese. As an outlier, the eating habit of Indian is quite different from other countries.\n\nThis work can be extended in the following four directions: 1) Exploring more recipe elements from Yummly for supporting more applications. For example, we can utilize the taste information associated with one recipe in Yummly to model the correlation between the taste and multi-modal information for taste analysis and prediction [67]. 2) Enlarging our multi-modal recipe dataset to deeply understand cuisines and culinary cultures around the world. 3) We have analyzed the cuisine similarity presented in the undirected graph. As the future work, it is very interesting to find a way to turn that into a directed graph, which showcases the cuisine to cuisine influence. 4) The fourth direction is on a method dimension for better multi-modal modeling on the recipe data. For example, recent work such as [11][12] has proposed multi-modal deep learning method such as CNNs and the attention network for cross-modal recipe retrieval and recognition, which can be utilized for better modeling of rich recipe information.\n\nAPPENDIX A For BC 2 TM, we use the collapsed Gibbs sampling [20] for model inference, that allows sampling of z i and s i alternatively for each word token w i , 1) sample s given the current estimate of z \n\nwhere i = (d, n) is the current index. the superscript ¬i denotes a counting variable that excludes the i-th word index in the corpus. n lc (l d ,c d ),z i ,¬i is the number of times that cuisine-course topic z i is assigned to the document d associated with cuisine-course (l d , c d ). n bg w i ,¬i is the number of times that the word w i are assigned to the background distribution. n lc z i ,w i ,¬i is the number of times that the word w i is assigned to the cuisine-course topic z i . n d,s i ,¬i is the number of times of the words in the document d assigned to the background distribution s i = bg and cusine-course topics s i = lc, respectively.\n\nFig. 1 .\n1The proposed culinary culture analysis framework.\n\nFig. 2 .\n2Bayesian Cuisine-Course Topic Model (BC 2 TM).\n\nFig. 4 .\n4The perplexity score over different topic number for different models. examples are shown in\n\nFig. 5 .\n5The background distribution (10 top-ranked ingredients) learned by BC 2 TM.\n\nFig. 6 .\n6A subjective evaluation of topic visualization generated by our method and the baseline.\n\nFig. 7 .\n7Some examples of topic visualization, where top five images are retrieved by (a) basic_MR and (b) our method.\n\nFig. 9 .\n9Cuisine distribution conditioned on Topic #61, Topic #68 and Topic #89. (a) Topic #61. (b) Topic #68. (c) Topic #89.\n\nFig. 10 .\n10Visualized results of Topic #68 for top 3 ranked cuisines.\n\nFig. 11 .\n11Course distribution conditioned on Topic #72, Topic #91 for different cuisines. (a) Topic #72. (b) Topic #91.\n\nFig. 12 .\n12The cuisine similarity graph generated by our model. Each node indicates one cuisine. Nodes with the same color are those that belong to the same group and the thickness of the edges indicates the pairwise similarity.\n\nFig. 13 .\n13Top-5 F1-measure for cuisine and course recommendation.\n\n\nAlgorithm 1: Generative Process of BC 2 TM 1: draw a distribution over ingredients ϕ bg ∼ Dir(β β β bg ) for the background topic 2: for each cuisine-course topic z ∈ {1, . . . , Z} do 3: draw a multinomial distribution ϕ lc z ∼ Dir(β β β lc ) 4: end for 5: for each cuisine-course pair (l, c) ∈ {1, . . . , LC} do 6: draw a multinomial distribution ψ (l,c) ∼ Dir(α α α) 7: end for 8: for each recipe d ∈ {1, . . . , D} do 9: draw π d ∼ Beta(γ γ γ) 10: for each ingredient w d,n ∈ w d do 11: draw a switch variable s d,n ∼ Bin(π d ) 12: if s d,n = bg do 13: draw an ingredient w d,n ∼ Multi(ϕ bg ) 14: else if s d,n = lc do 15: draw a topic z d,n ∼ Multi(ψ (l d ,c d ) )16: \ndraw an ingredient w d,n ∼ Multi(ϕ lc \nz d , n ) \n17: \nend if \n18: end for \n19: end for \n\nSimilar to \n\nTABLE I THE\nISTATISTICS OF THE COLLECTED CUISINES and their abbreviated names (MD, DE, SD, SA, AT, SO, LU, SN, CS, BR, BB, BE, CO and AP) interchangeably for convenience. There are 66,615 recipe items in all, which we denote as the Yummly-66K dataset. The dataset is available.Cuisine \nitems \nCuisine \nitems \n\nAmerican \n13,262 \nItalian \n9,401 \nGreek \n4,998 \nJapanese \n4,804 \nMexican \n7,960 \nIndian \n5,470 \nFrench \n6,173 \nSpanish \n4,014 \nThai \n5,282 \nChinese \n5,251 \n\nFig. 3. Some examples from different cuisines. \n\n\n\nTABLE\n\n\n\np(s i = bg|w = w i , s ¬i , z ¬i , w ¬i ) ∝ n bg w i ,¬i + β bg w n bg w ,¬i + W β bg n d,s i ,¬i + λ n d,bg ,¬i + n d,lc,¬i + 2λ (18) p(s i = lc|z i , w = w i , s ¬i , z ¬i , w ¬i ) ∝ n lc (l d ,c d ),z i ,¬i + α z n lc (l d ,c d ),z ,¬i + Zα n d,s i ,¬i + λ n d,bg ,¬i + n d,lc,¬i + 2λ (19) 2) sample z given the current estimate of s p(z i |s i = lc, w = w i , z ¬i , s ¬i , w ¬i ) ∝ n lc z i ,w i ,¬i + β lc w n lc z i ,w ,¬i + W β lc n lc (l d ,c d ),z i ,¬i + α z n lc (l d ,c d ),z ,¬i + Zα\nhttp://isia.ict.ac.cn/dataset/Geolocation-food/ 3 http://vireo.cs.cityu.edu.hk/VireoFood172/ 4 http://isia.ict.ac.cn/dataset/\nhttp://isia.ict.ac.cn/dataset/Yummly-66K.html\nhttps://github.com/amueller/word_cloud\nhttp://www.japan-talk.com/jt/new/shoyu\n\nA mobile food record for integrated dietary assessment. Z Ahmad, Proc. Int. Workshop Multimedia Assisted Dietary Manage. Int. Workshop Multimedia Assisted Dietary ManageZ. Ahmad et al., \"A mobile food record for integrated dietary assess- ment,\" in Proc. Int. Workshop Multimedia Assisted Dietary Manage., 2016, pp. 53-62.\n\nFlavor network and the principles of food pairing. Y.-Y Ahn, S E Ahnert, J P Bagrow, A.-L Barabási, Sci. Rep. 1Y.-Y. Ahn, S. E. Ahnert, J. P. Bagrow, and A.-L. Barabási, \"Flavor network and the principles of food pairing,\" Sci. Rep., vol. 1, 2011, Art. no. 196.\n\nTalking places: Modelling and analysing linguistic content in foursquare. S Bauer, A Noulas, D O Seaghdha, S Clark, C Mascolo, Proc. IEEE Int. Conf. Soc. Comput. IEEE Int. Conf. Soc. ComputS. Bauer, A. Noulas, D. O. Seaghdha, S. Clark, and C. Mascolo, \"Talking places: Modelling and analysing linguistic content in foursquare,\" in Proc. IEEE Int. Conf. Soc. Comput., 2012, pp. 348-357.\n\nMenumatch: Restaurant-specific food logging from images. O Beijbom, N Joshi, D Morris, S Saponas, S Khullar, Proc. IEEE Winter Conf. Appl. Comput. Vis. IEEE Winter Conf. Appl. Comput. VisO. Beijbom, N. Joshi, D. Morris, S. Saponas, and S. Khullar, \"Menu- match: Restaurant-specific food logging from images,\" in Proc. IEEE Winter Conf. Appl. Comput. Vis., 2015, pp. 844-851.\n\nManifold regularization: A geometric framework for learning from labeled and unlabeled examples. M Belkin, P Niyogi, V Sindhwani, J. Mach. Learn. Res. 71M. Belkin, P. Niyogi, and V. Sindhwani, \"Manifold regularization: A geometric framework for learning from labeled and unlabeled examples,\" J. Mach. Learn. Res., vol. 7, no. 1, pp. 2399-2434, 2006.\n\nLeveraging context to support automated food recognition in restaurants. V Bettadapura, E Thomaz, A Parnami, G D Abowd, I Essa, Proc. IEEE Winter Conf. Appl. Comput. Vis. IEEE Winter Conf. Appl. Comput. VisV. Bettadapura, E. Thomaz, A. Parnami, G. D. Abowd, and I. Essa, \"Lever- aging context to support automated food recognition in restaurants,\" in Proc. IEEE Winter Conf. Appl. Comput. Vis., 2015, pp. 580-587.\n\nLatent dirichlet allocation. D M Blei, A Y Ng, M I Jordan, J. Mach. Learn. Res. 3D. M. Blei, A. Y. Ng, and M. I. Jordan, \"Latent dirichlet allocation,\" J. Mach. Learn. Res., vol. 3, pp. 993-1022, 2003.\n\nAutomatic extraction of ingredient's substitutes. C Boscarino, V Nedović, N J Koenderink, J L Top, Proc. ACM Int. Joint Conf. Pervasive Ubiquitous Comput. ACM Int. Joint Conf. Pervasive Ubiquitous ComputAdjunct PublC. Boscarino, V. Nedović, N. J. Koenderink, and J. L. Top, \"Automatic extraction of ingredient's substitutes,\" in Proc. ACM Int. Joint Conf. Per- vasive Ubiquitous Comput., Adjunct Publ., 2014, pp. 559-564.\n\nFood-101-mining discriminative components with random forests. L Bossard, M Guillaumin, L Van Gool, Proc. Eur. Conf. Comput. Vis. Eur. Conf. Comput. VisL. Bossard, M. Guillaumin, and L. Van Gool , \"Food-101-mining discrim- inative components with random forests,\" in Proc. Eur. Conf. Comput. Vis., 2014, pp. 446-461.\n\nSearching persuasively: Joint event detection and evidence recounting with limited supervision. X Chang, Y Yu, Y Yang, A G Hauptmann, Proc. ACM Multimedia Conf. ACM Multimedia ConfX. Chang, Y. Yu, Y. Yang, and A. G. Hauptmann, \"Searching persuasively: Joint event detection and evidence recounting with limited supervision,\" in Proc. ACM Multimedia Conf., 2015, pp. 581-590.\n\nDeep-based ingredient recognition for cooking recipe retrieval. J Chen, C.-W Ngo, Proc. ACM Multimedia Conf. ACM Multimedia ConfJ. Chen and C.-W. Ngo, \"Deep-based ingredient recognition for cooking recipe retrieval,\" in Proc. ACM Multimedia Conf., 2016, pp. 32-41.\n\nCross-modal recipe retrieval: How to cook this dish?. J Chen, L Pang, C W Ngo, Proc. Int. Conf. Multimedia Model. Int. Conf. Multimedia ModelJ. Chen, L. Pang, and C. W. Ngo, \"Cross-modal recipe retrieval: How to cook this dish?,\" in Proc. Int. Conf. Multimedia Model., 2017, pp. 588- 600.\n\nFood recognition for dietary assessment using deep convolutional neural networks. S Christodoulidis, M Anthimopoulos, S Mougiakakou, Proc. Int. Conf. Image Anal. Process. Int. Conf. Image Anal. essS. Christodoulidis, M. Anthimopoulos, and S. Mougiakakou, \"Food recog- nition for dietary assessment using deep convolutional neural networks,\" in Proc. Int. Conf. Image Anal. Process., 2015, pp. 458-465.\n\nRethinking the mobile food journal: Exploring opportunities for lightweight photo-based capture. F Cordeiro, E Bales, E Cherry, J Fogarty, Proc. 33rd Annu. ACM Conf. Human Factors Comput. Syst. 33rd Annu. ACM Conf. Human Factors Comput. SystF. Cordeiro, E. Bales, E. Cherry, and J. Fogarty, \"Rethinking the mobile food journal: Exploring opportunities for lightweight photo-based cap- ture,\" in Proc. 33rd Annu. ACM Conf. Human Factors Comput. Syst., 2015, pp. 3207-3216.\n\nDish detection and segmentation for dietary assessment on smartphones. J Dehais, M Anthimopoulos, S Mougiakakou, Proc. Int. Conf. Image Anal. Process. Int. Conf. Image Anal. essJ. Dehais, M. Anthimopoulos, and S. Mougiakakou, \"Dish detection and segmentation for dietary assessment on smartphones,\" in Proc. Int. Conf. Image Anal. Process., 2015, pp. 433-440.\n\nClassifying food images represented as bag of textons. G M Farinella, M Moltisanti, S Battiato, Proc. IEEE Int. Conf. Image Process. IEEE Int. Conf. Image essG. M. Farinella, M. Moltisanti, and S. Battiato, \"Classifying food images represented as bag of textons,\" in Proc. IEEE Int. Conf. Image Process., 2014, pp. 5212-5216.\n\nContent-boosted matrix factorization for recommender systems: Experiments with recipe recommendation. P Forbes, M Zhu, Proc. 5th ACM Conf. Recommender Syst. 5th ACM Conf. Recommender SystP. Forbes and M. Zhu, \"Content-boosted matrix factorization for recom- mender systems: Experiments with recipe recommendation,\" in Proc. 5th ACM Conf. Recommender Syst., 2011, pp. 261-264.\n\nDevnet: A deep event network for multimedia event detection and evidence recounting. C Gan, N Wang, Y Yang, D Yeung, A G Hauptmann, Proc. Comput. Vis. Pattern Recogn. Comput. Vis. Pattern RecognC. Gan, N. Wang, Y. Yang, D. Yeung, and A. G. Hauptmann, \"De- vnet: A deep event network for multimedia event detection and ev- idence recounting,\" in Proc. Comput. Vis. Pattern Recogn., 2015, pp. 2568-2577.\n\nUsing tags and latent factors in a food recommender system. M Ge, Proc. Int. Conf. Digit. Health. Int. Conf. Digit. HealthM. Ge et al., \"Using tags and latent factors in a food recommender system,\" in Proc. Int. Conf. Digit. Health, 2015, pp. 105-112.\n\nFinding scientific topics. T L Griffiths, M Steyvers, Proc. Nat. Acad. Sci. United States Amer. 101Suppl 1)T. L. Griffiths and M. Steyvers, \"Finding scientific topics,\" Proc. Nat. Acad. Sci. United States Amer., vol. 101(Suppl 1), pp. 5228-5235, 2004.\n\nFood image recognition using very deep convolutional networks. H Hassannejad, Proc. Int. Workshop Multimedia Assisted Dietary Manage. Int. Workshop Multimedia Assisted Dietary ManageH. Hassannejad et al., \"Food image recognition using very deep convo- lutional networks,\" in Proc. Int. Workshop Multimedia Assisted Dietary Manage., 2016, pp. 41-49.\n\nManifold-ranking based image retrieval. J He, M Li, H.-J Zhang, H Tong, C Zhang, Proc. 12th Annu. ACM Int. Conf. Multimedia. 12th Annu. ACM Int. Conf. MultimediaJ. He, M. Li, H.-J. Zhang, H. Tong, and C. Zhang, \"Manifold-ranking based image retrieval,\" in Proc. 12th Annu. ACM Int. Conf. Multimedia, 2004, pp. 9-16.\n\nModeling restaurant context for food recognition. L Herranz, S Jiang, R Xu, IEEE Trans. Multimedia. 192L. Herranz, S. Jiang, and R. Xu, \"Modeling restaurant context for food recognition,\" IEEE Trans. Multimedia, vol. 19, no. 2, pp. 430-440, Feb. 2017.\n\nA probabilistic model for food image recognition in restaurants. L Herranz, R Xu, S Jiang, Proc. IEEE Int. Conf. Multimedia Expo. IEEE Int. Conf. Multimedia ExpoL. Herranz, R. Xu, and S. Jiang, \"A probabilistic model for food image recognition in restaurants,\" in Proc. IEEE Int. Conf. Multimedia Expo, 2015, pp. 1-6.\n\nImage representations and new domains in neural image captioning. J Hessel, N Savva, M J Wilber, abs/1508.02091CoRR. J. Hessel, N. Savva, and M. J. Wilber, \"Image representations and new domains in neural image captioning,\" CoRR, abs/1508.02091, 2015.\n\nContent-based musical similarity computation using the hierarchical dirichlet process. M D Hoffman, D M Blei, P R Cook, Proc. Int. Conf. Music Inf. Retrieval. Int. Conf. Music Inf. RetrievalM. D. Hoffman, D. M. Blei, and P. R. Cook, \"Content-based musical similarity computation using the hierarchical dirichlet process,\" in Proc. Int. Conf. Music Inf. Retrieval, 2008, pp. 349-354.\n\nAnalyzing taste preferences from crowdsourced food entries. P D Howell, Proc. Int. Conf. Digit. Health Conf. Int. Conf. Digit. Health ConfP. D. Howell et al., \"Analyzing taste preferences from crowdsourced food entries,\" in Proc. Int. Conf. Digit. Health Conf., 2016, pp. 131-140.\n\nSpices form the basis of food pairing in Indian cuisine. A Jain, N K Rakhi, G Bagler, arXiv:150203815A. Jain, N. K. Rakhi, and G. Bagler, \"Spices form the basis of food pairing in Indian cuisine,\" arXiv:150203815, 2015.\n\nDeep compositional cross-modal learning to rank via local-global alignment. X Jiang, Proc. 23rd ACM Int. Conf. Multimedia. 23rd ACM Int. Conf. MultimediaX. Jiang et al., \"Deep compositional cross-modal learning to rank via local-global alignment,\" in Proc. 23rd ACM Int. Conf. Multimedia, 2015, pp. 69-78.\n\nFood detection and recognition using convolutional neural network. H Kagaya, K Aizawa, M Ogawa, Proc. ACM Int. Conf. Multimedia. ACM Int. Conf. MultimediaH. Kagaya, K. Aizawa, and M. Ogawa, \"Food detection and recognition using convolutional neural network,\" in Proc. ACM Int. Conf. Multimedia, 2014, pp. 1085-1088.\n\nFoodcam-256: A large-scale real-time mobile food recognitionsystem employing high-dimensional features and compression of classifier weights. Y Kawano, K Yanai, Proc. ACM Int. Conf. Multimedia. ACM Int. Conf. MultimediaY. Kawano and K. Yanai, \"Foodcam-256: A large-scale real-time mobile food recognitionsystem employing high-dimensional features and com- pression of classifier weights,\" in Proc. ACM Int. Conf. Multimedia, 2014, pp. 761-762.\n\nGenerating diverse and representative image search results for landmarks. L S Kennedy, M Naaman, Proc. Int. Conf. World Wide Web. Int. Conf. World Wide WebL. S. Kennedy and M. Naaman, \"Generating diverse and representative image search results for landmarks,\" in Proc. Int. Conf. World Wide Web, 2008, pp. 297-306.\n\nOnline food recipe title semantics: Combining nutrient facts and topics. T Kusmierczyk, K Norvag, Proc. 25th ACM Int. Conf. Inf. Knowl. Manage. 25th ACM Int. Conf. Inf. Knowl. ManageT. Kusmierczyk and K. Norvag, \"Online food recipe title semantics: Com- bining nutrient facts and topics,\" in Proc. 25th ACM Int. Conf. Inf. Knowl. Manage., 2016, pp. 2013-2016.\n\nAttribute-based classification for zero-shot visual object categorization. C H Lampert, H Nickisch, S Harmeling, IEEE Trans. Pattern Anal. Mach. Intell. 363C. H. Lampert, H. Nickisch, and S. Harmeling, \"Attribute-based classi- fication for zero-shot visual object categorization,\" IEEE Trans. Pattern Anal. Mach. Intell., vol. 36, no. 3, pp. 453-465, Mar. 2014.\n\nA content-based matrix factorization model for recipe recommendation. C.-J Lin, T.-T Kuo, S.-D Lin, Proc. Adv. Knowl. Discovery Data Mining. Adv. Knowl. Discovery Data MiningC.-J. Lin, T.-T. Kuo, and S.-D. Lin, \"A content-based matrix factorization model for recipe recommendation,\" in Proc. Adv. Knowl. Discovery Data Mining, 2014, pp. 560-571.\n\nZero-example multimedia event detection and recounting with unsupervised evidence localization. Y Lu, Proc. ACM Multimedia Conf. ACM Multimedia ConfY. Lu, \"Zero-example multimedia event detection and recounting with unsupervised evidence localization,\" in Proc. ACM Multimedia Conf., 2016, pp. 1464-1468.\n\nThink before you eat: photographic food diaries as intervention tools to change dietary decision making and attitudes. Z Lydia, D David, Int. J. Consum. Stud. 326Z. Lydia and D. David, \"Think before you eat: photographic food diaries as intervention tools to change dietary decision making and attitudes,\" Int. J. Consum. Stud., vol. 32, no. 6, pp. 692-698, 2008.\n\nReal-time mobile recipe recommendation system using food ingredient recognition. T Maruyama, Y Kawano, K Yanai, Proc. 2nd ACM Int. Workshop Interactive Multimedia Mobile Portable Devices. 2nd ACM Int. Workshop Interactive Multimedia Mobile Portable DevicesT. Maruyama, Y. Kawano, and K. Yanai, \"Real-time mobile recipe recom- mendation system using food ingredient recognition,\" in Proc. 2nd ACM Int. Workshop Interactive Multimedia Mobile Portable Devices, 2012, pp. 27-34.\n\n# foodporn: Obesity patterns in culinary interactions. Y Mejova, H Haddadi, A Noulas, I Weber, Proc. 5th Int. Conf. Digit. Health. 5th Int. Conf. Digit. HealthY. Mejova, H. Haddadi, A. Noulas, and I. Weber, \"# foodporn: Obesity patterns in culinary interactions,\" in Proc. 5th Int. Conf. Digit. Health, 2015, pp. 51-58.\n\nTopic models conditioned on arbitrary features with dirichlet-multinomial regression. D Mimno, A Mccallum, Proc. 24th Conf. Uncertainty Artif. Intell. 24th Conf. Uncertainty Artif. IntellD. Mimno and A. Mccallum, \"Topic models conditioned on arbitrary features with dirichlet-multinomial regression,\" in Proc. 24th Conf. Un- certainty Artif. Intell., 2012, pp. 411-418.\n\nMultimodal spatio-temporal theme modeling for landmark analysis. W Min, B K Bao, C Xu, IEEE Multimedia. 213W. Min, B. K. Bao, and C. Xu, \"Multimodal spatio-temporal theme mod- eling for landmark analysis,\" IEEE Multimedia, vol. 21, no. 3, pp. 20-29, Jul.-Sep. 2014.\n\nCross-platform multimodal topic modeling for personalized inter-platform recommendation. W Min, B K Bao, C Xu, M S Hossain, IEEE Trans. Multimedia. 1710W. Min, B. K. Bao, C. Xu, and M. S. Hossain, \"Cross-platform multi- modal topic modeling for personalized inter-platform recommendation,\" IEEE Trans. Multimedia, vol. 17, no. 10, pp. 1787-1801, Oct. 2015.\n\nBeing a super cook: Joint food attributes and multimodal content modeling for recipe retrieval and exploration. W Min, IEEE Trans. Multimedia. 195W. Min et al., \"Being a super cook: Joint food attributes and multi- modal content modeling for recipe retrieval and exploration,\" IEEE Trans. Multimedia, vol. 19, no. 5, pp. 1100-1113, May 2017.\n\nLearning recipe ingredient space using generative probabilistic models. V Nedovic, Proc. Cooking Comput. Workshop. Cooking Comput. Workshop1V. Nedovic, \"Learning recipe ingredient space using generative probabilis- tic models,\" in Proc. Cooking Comput. Workshop, 2013, vol. 1, pp. 13-18.\n\nAn automatic calorie estimation system of food images on a smartphone. K Okamoto, K Yanai, Proc. Int. Workshop Multimedia Assist. Dietary Manage. Int. Workshop Multimedia Assist. Dietary ManageK. Okamoto and K. Yanai, \"An automatic calorie estimation system of food images on a smartphone,\" in Proc. Int. Workshop Multimedia Assist. Dietary Manage., 2016, pp. 63-70.\n\nA mobile, lightweight, poll-based food identification system. L Oliveira, Pattern Recogn. 475L. Oliveira et al., \"A mobile, lightweight, poll-based food identification system,\" Pattern Recogn., vol. 47, no. 5, pp. 1941-1952, 2014.\n\nMulti-modal multi-view topic-opinion mining for social event analysis. S Qian, T Zhang, C Xu, Proc. ACM Multimedia Conf. ACM Multimedia ConfS. Qian, T. Zhang, and C. Xu, \"Multi-modal multi-view topic-opinion mining for social event analysis,\" in Proc. ACM Multimedia Conf., 2016, pp. 2-11.\n\nTowards bottom-up analysis of social food. J Rich, H Haddadi, T M Hospedales, Proc. 6th Int. Conf. Digit. Health Conf. 6th Int. Conf. Digit. Health ConfJ. Rich, H. Haddadi, and T. M. Hospedales, \"Towards bottom-up anal- ysis of social food,\" in Proc. 6th Int. Conf. Digit. Health Conf., 2016, pp. 111-120.\n\nGenerating visual summaries of geographic areas using community-contributed images. S Rudinac, A Hanjalic, M Larson, IEEE Trans. Multimedia. 154S. Rudinac, A. Hanjalic, and M. Larson, \"Generating visual summaries of geographic areas using community-contributed images,\" IEEE Trans. Multimedia, vol. 15, no. 4, pp. 921-932, Jun. 2013.\n\nLearning crowdsourced user preferences for visual summarization of image collections. S Rudinac, M Larson, A Hanjalic, IEEE Trans. Multimedia. 156S. Rudinac, M. Larson, and A. Hanjalic, \"Learning crowdsourced user preferences for visual summarization of image collections,\" IEEE Trans. Multimedia, vol. 15, no. 6, pp. 1231-1243, Oct. 2013.\n\nKissing cuisines: Exploring worldwide culinary habits on the web. S Sajadmanesh, Proc. Int. Conf. World Wide Web. Int. Conf. World Wide WebS. Sajadmanesh et al., \"Kissing cuisines: Exploring worldwide culinary habits on the web,\" in Proc. Int. Conf. World Wide Web, 2017, pp. 1013- 1021.\n\nLearning cross-modal embeddings for cooking recipes and food images. A Salvador, Proc. Comput. Vis. Pattern Recogn. Comput. Vis. Pattern RecognA. Salvador et al., \"Learning cross-modal embeddings for cooking recipes and food images,\" in Proc. Comput. Vis. Pattern Recogn., 2017, pp. 3020-3028.\n\nYou are what you eat (and drink): Identifying cultural boundaries by analyzing food drink habits in foursquare. T H Silva, P O De Melo, J Almeida, M Musolesi, A Loureiro, Int. AAAI Conf. Weblogs Social Media. T. H. Silva, P. O. de Melo, J. Almeida, M. Musolesi, and A. Loureiro, \"You are what you eat (and drink): Identifying cultural boundaries by analyzing food drink habits in foursquare,\" Int. AAAI Conf. Weblogs Social Media, 2014.\n\nVery deep convolutional networks for large-scale image recognition. K Simonyan, A Zisserman, Proc. Int. Conf. Learn. Represent. Int. Conf. Learn. RepresentK. Simonyan and A. Zisserman, \"Very deep convolutional networks for large-scale image recognition,\" in Proc. Int. Conf. Learn. Represent., 2015.\n\nFood/non-food image classification and food categorization using pre-trained googlenet model. A Singla, L Yuan, T Ebrahimi, Proc. Int. Workshop Multimedia Assist. Dietary Manage. Int. Workshop Multimedia Assist. Dietary ManageA. Singla, L. Yuan, and T. Ebrahimi, \"Food/non-food image classification and food categorization using pre-trained googlenet model,\" in Proc. Int. Workshop Multimedia Assist. Dietary Manage., 2016, pp. 3-11.\n\nAutomatic recipe cuisine classification by ingredients. H Su, T.-W Lin, C.-T Li, M.-K Shan, J Chang, Proc. ACM Int. Joint Conf. Pervasive Ubiquitous Comput. ACM Int. Joint Conf. Pervasive Ubiquitous ComputAdjunct PublH. Su, T.-W. Lin, C.-T. Li, M.-K. Shan, and J. Chang, \"Automatic recipe cuisine classification by ingredients,\" in Proc. ACM Int. Joint Conf. Per- vasive Ubiquitous Comput., Adjunct Publ., 2014, pp. 565-570.\n\nDeepfoodcam: A dcnn-based realtime mobile food recognition system. R Tanno, K Okamoto, K Yanai, Proc. Int. Workshop Multimedia Assisted Dietary Manage. Int. Workshop Multimedia Assisted Dietary ManageR. Tanno, K. Okamoto, and K. Yanai, \"Deepfoodcam: A dcnn-based real- time mobile food recognition system,\" in Proc. Int. Workshop Multimedia Assisted Dietary Manage., 2016, pp. 89-89.\n\nSimultaneous image classification and annotation. C Wang, D Blei, F F Li, Proc. IEEE Comp. Soc. Conf. Comput. Vis. Pattern Recogn. IEEE Comp. Soc. Conf. Comput. Vis. Pattern RecognC. Wang, D. Blei, and F. F. Li, \"Simultaneous image classification and an- notation,\" in Proc. IEEE Comp. Soc. Conf. Comput. Vis. Pattern Recogn., 2009, pp. 1903-1910.\n\nRecipe recognition with large multimodal food dataset. X Wang, D Kumar, N Thome, M Cord, F Precioso, Proc. IEEE Int. Conf. Multimedia Expo Workshops. IEEE Int. Conf. Multimedia Expo WorkshopsX. Wang, D. Kumar, N. Thome, M. Cord, and F. Precioso, \"Recipe recog- nition with large multimodal food dataset,\" in Proc. IEEE Int. Conf. Mul- timedia Expo Workshops, 2015, pp. 1-6.\n\nLatent embeddings for zero-shot classification. Y Xian, Proc. Comput. Vis. Pattern Recogn. Comput. Vis. Pattern RecognY. Xian et al., \"Latent embeddings for zero-shot classification,\" in Proc. Comput. Vis. Pattern Recogn., 2016, pp. 69-77.\n\nGeolocalized modeling for dish recognition. R Xu, IEEE Trans. Multimedia. 178R. Xu et al., \"Geolocalized modeling for dish recognition,\" IEEE Trans. Multimedia, vol. 17, no. 8, pp. 1187-1199, Aug. 2015.\n\nPlateclick: Bootstrapping food preferences through an adaptive visual interface. L Yang, Proc. 24th ACM Int. Conf. Inf. Knowl. Manage. 24th ACM Int. Conf. Inf. Knowl. ManageL. Yang et al., \"Plateclick: Bootstrapping food preferences through an adaptive visual interface,\" in Proc. 24th ACM Int. Conf. Inf. Knowl. Man- age., 2015, pp. 183-192.\n\nLcars: A location-contentaware recommender system. H Yin, Y Sun, B Cui, Z Hu, L Chen, Proc. ACM Int. Conf. Knowl. Discovery Data Mining. ACM Int. Conf. Knowl. Discovery Data MiningH. Yin, Y. Sun, B. Cui, Z. Hu, and L. Chen, \"Lcars: A location-content- aware recommender system,\" in Proc. ACM Int. Conf. Knowl. Discovery Data Mining, 2013, pp. 221-229.\n\nMultimedia event recounting with concept based representation. Q Yu, J Liu, H Cheng, A Divakaran, H Sawhney, Proc. ACM Int. Conf. Multimedia, 2012. ACM Int. Conf. Multimedia, 2012Q. Yu, J. Liu, H. Cheng, A. Divakaran, and H. Sawhney, \"Multimedia event recounting with concept based representation,\" in Proc. ACM Int. Conf. Multimedia, 2012, pp. 1073-1076.\n\nExploiting dining preference for restaurant recommendation. F Zhang, Proc. Int. Conf. World Wide Web. Int. Conf. World Wide WebF. Zhang et al., \"Exploiting dining preference for restaurant recommen- dation,\" in Proc. Int. Conf. World Wide Web, 2016, pp. 725-735.\n\nZero-shot learning via joint latent similarity embedding. Z Zhang, V Saligrama, Proc. Comput. Vis. Pattern Recogn. Comput. Vis. Pattern RecognZ. Zhang and V. Saligrama, \"Zero-shot learning via joint latent sim- ilarity embedding,\" in Proc. Comput. Vis. Pattern Recogn., 2015, pp. 6034-6042.\n\nA delicious recipe analysis framework for exploring multi-modal recipes with various attributes. W Min, S Jiang, S Wang, J Sang, S Mei, Proc. 25rd Annu. ACM Conf. Multimedia Conf. 25rd Annu. ACM Conf. Multimedia ConfW. Min, S. Jiang, S. Wang, J. Sang, and S. Mei, \"A delicious recipe analysis framework for exploring multi-modal recipes with various attributes,\" in Proc. 25rd Annu. ACM Conf. Multimedia Conf., 2017, pp. 402-410.\n", "annotations": {"author": "[{\"end\":139,\"start\":100},{\"end\":185,\"start\":140},{\"end\":240,\"start\":186},{\"end\":279,\"start\":241},{\"end\":330,\"start\":280},{\"end\":384,\"start\":331},{\"end\":391,\"start\":385},{\"end\":398,\"start\":392},{\"end\":408,\"start\":399},{\"end\":636,\"start\":409},{\"end\":685,\"start\":637},{\"end\":748,\"start\":686},{\"end\":903,\"start\":749},{\"end\":952,\"start\":904},{\"end\":1104,\"start\":953},{\"end\":1249,\"start\":1105},{\"end\":1298,\"start\":1250},{\"end\":1361,\"start\":1299}]", "publisher": null, "author_last_name": "[{\"end\":111,\"start\":108},{\"end\":152,\"start\":149},{\"end\":197,\"start\":194},{\"end\":251,\"start\":248},{\"end\":300,\"start\":297},{\"end\":364,\"start\":359},{\"end\":390,\"start\":387},{\"end\":397,\"start\":394},{\"end\":407,\"start\":404}]", "author_first_name": "[{\"end\":107,\"start\":100},{\"end\":148,\"start\":140},{\"end\":193,\"start\":186},{\"end\":247,\"start\":241},{\"end\":296,\"start\":292},{\"end\":358,\"start\":350},{\"end\":386,\"start\":385},{\"end\":393,\"start\":392},{\"end\":403,\"start\":399}]", "author_affiliation": "[{\"end\":635,\"start\":410},{\"end\":684,\"start\":638},{\"end\":747,\"start\":687},{\"end\":902,\"start\":750},{\"end\":951,\"start\":905},{\"end\":1103,\"start\":954},{\"end\":1248,\"start\":1106},{\"end\":1297,\"start\":1251},{\"end\":1360,\"start\":1300}]", "title": "[{\"end\":87,\"start\":1},{\"end\":1448,\"start\":1362}]", "venue": "[{\"end\":1481,\"start\":1450}]", "abstract": "[{\"end\":3371,\"start\":2068}]", "bib_ref": "[{\"attributes\":{\"ref_id\":\"b1\"},\"end\":4458,\"start\":4455},{\"attributes\":{\"ref_id\":\"b50\"},\"end\":4566,\"start\":4562},{\"attributes\":{\"ref_id\":\"b26\"},\"end\":4817,\"start\":4813},{\"attributes\":{\"ref_id\":\"b61\"},\"end\":4823,\"start\":4819},{\"attributes\":{\"ref_id\":\"b55\"},\"end\":4852,\"start\":4848},{\"attributes\":{\"ref_id\":\"b38\"},\"end\":4882,\"start\":4878},{\"attributes\":{\"ref_id\":\"b50\"},\"end\":5181,\"start\":5177},{\"attributes\":{\"ref_id\":\"b52\"},\"end\":5231,\"start\":5227},{\"attributes\":{\"ref_id\":\"b50\"},\"end\":5269,\"start\":5265},{\"attributes\":{\"ref_id\":\"b52\"},\"end\":5438,\"start\":5434},{\"attributes\":{\"ref_id\":\"b0\"},\"end\":5941,\"start\":5938},{\"attributes\":{\"ref_id\":\"b13\"},\"end\":6077,\"start\":6073},{\"attributes\":{\"ref_id\":\"b36\"},\"end\":6083,\"start\":6079},{\"attributes\":{\"ref_id\":\"b61\"},\"end\":6089,\"start\":6085},{\"attributes\":{\"ref_id\":\"b36\"},\"end\":6208,\"start\":6204},{\"attributes\":{\"ref_id\":\"b61\"},\"end\":6369,\"start\":6365},{\"attributes\":{\"ref_id\":\"b25\"},\"end\":11158,\"start\":11154},{\"attributes\":{\"ref_id\":\"b41\"},\"end\":11164,\"start\":11160},{\"attributes\":{\"ref_id\":\"b6\"},\"end\":11350,\"start\":11347},{\"attributes\":{\"ref_id\":\"b2\"},\"end\":11409,\"start\":11406},{\"attributes\":{\"ref_id\":\"b39\"},\"end\":11415,\"start\":11411},{\"attributes\":{\"ref_id\":\"b40\"},\"end\":11421,\"start\":11417},{\"attributes\":{\"ref_id\":\"b46\"},\"end\":11427,\"start\":11423},{\"attributes\":{\"ref_id\":\"b2\"},\"end\":11458,\"start\":11455},{\"attributes\":{\"ref_id\":\"b46\"},\"end\":11567,\"start\":11563},{\"attributes\":{\"ref_id\":\"b33\"},\"end\":12214,\"start\":12210},{\"attributes\":{\"ref_id\":\"b59\"},\"end\":12220,\"start\":12216},{\"attributes\":{\"ref_id\":\"b65\"},\"end\":12226,\"start\":12222},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":12243,\"start\":12239},{\"attributes\":{\"ref_id\":\"b17\"},\"end\":12249,\"start\":12245},{\"attributes\":{\"ref_id\":\"b35\"},\"end\":12255,\"start\":12251},{\"attributes\":{\"ref_id\":\"b63\"},\"end\":12261,\"start\":12257},{\"attributes\":{\"ref_id\":\"b31\"},\"end\":12284,\"start\":12280},{\"attributes\":{\"ref_id\":\"b48\"},\"end\":12290,\"start\":12286},{\"attributes\":{\"ref_id\":\"b49\"},\"end\":12296,\"start\":12292},{\"attributes\":{\"ref_id\":\"b65\"},\"end\":12499,\"start\":12495},{\"attributes\":{\"ref_id\":\"b59\"},\"end\":12671,\"start\":12667},{\"attributes\":{\"ref_id\":\"b63\"},\"end\":12949,\"start\":12945},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":12981,\"start\":12977},{\"attributes\":{\"ref_id\":\"b31\"},\"end\":13367,\"start\":13363},{\"attributes\":{\"ref_id\":\"b31\"},\"end\":13497,\"start\":13493},{\"attributes\":{\"ref_id\":\"b48\"},\"end\":13518,\"start\":13514},{\"attributes\":{\"ref_id\":\"b49\"},\"end\":13643,\"start\":13639},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":14232,\"start\":14229},{\"attributes\":{\"ref_id\":\"b50\"},\"end\":14238,\"start\":14234},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":14910,\"start\":14907},{\"attributes\":{\"ref_id\":\"b27\"},\"end\":15062,\"start\":15058},{\"attributes\":{\"ref_id\":\"b7\"},\"end\":15200,\"start\":15197},{\"attributes\":{\"ref_id\":\"b43\"},\"end\":15206,\"start\":15202},{\"attributes\":{\"ref_id\":\"b32\"},\"end\":15305,\"start\":15301},{\"attributes\":{\"ref_id\":\"b50\"},\"end\":15450,\"start\":15446},{\"attributes\":{\"ref_id\":\"b52\"},\"end\":15638,\"start\":15634},{\"attributes\":{\"ref_id\":\"b38\"},\"end\":15736,\"start\":15732},{\"attributes\":{\"ref_id\":\"b16\"},\"end\":16109,\"start\":16105},{\"attributes\":{\"ref_id\":\"b34\"},\"end\":16115,\"start\":16111},{\"attributes\":{\"ref_id\":\"b34\"},\"end\":16221,\"start\":16217},{\"attributes\":{\"ref_id\":\"b18\"},\"end\":16356,\"start\":16352},{\"attributes\":{\"ref_id\":\"b64\"},\"end\":16526,\"start\":16522},{\"attributes\":{\"ref_id\":\"b8\"},\"end\":16816,\"start\":16813},{\"attributes\":{\"ref_id\":\"b12\"},\"end\":16822,\"start\":16818},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":16828,\"start\":16824},{\"attributes\":{\"ref_id\":\"b29\"},\"end\":16834,\"start\":16830},{\"attributes\":{\"ref_id\":\"b20\"},\"end\":16872,\"start\":16868},{\"attributes\":{\"ref_id\":\"b54\"},\"end\":16878,\"start\":16874},{\"attributes\":{\"ref_id\":\"b3\"},\"end\":16944,\"start\":16941},{\"attributes\":{\"ref_id\":\"b5\"},\"end\":16949,\"start\":16946},{\"attributes\":{\"ref_id\":\"b22\"},\"end\":16955,\"start\":16951},{\"attributes\":{\"ref_id\":\"b23\"},\"end\":16961,\"start\":16957},{\"attributes\":{\"ref_id\":\"b60\"},\"end\":16967,\"start\":16963},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":17073,\"start\":17069},{\"attributes\":{\"ref_id\":\"b30\"},\"end\":17079,\"start\":17075},{\"attributes\":{\"ref_id\":\"b37\"},\"end\":17085,\"start\":17081},{\"attributes\":{\"ref_id\":\"b45\"},\"end\":17091,\"start\":17087},{\"attributes\":{\"ref_id\":\"b56\"},\"end\":17097,\"start\":17093},{\"attributes\":{\"ref_id\":\"b44\"},\"end\":17134,\"start\":17130},{\"attributes\":{\"ref_id\":\"b0\"},\"end\":17152,\"start\":17149},{\"attributes\":{\"ref_id\":\"b56\"},\"end\":17184,\"start\":17180},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":17395,\"start\":17391},{\"attributes\":{\"ref_id\":\"b11\"},\"end\":17664,\"start\":17660},{\"attributes\":{\"ref_id\":\"b28\"},\"end\":17670,\"start\":17666},{\"attributes\":{\"ref_id\":\"b51\"},\"end\":17676,\"start\":17672},{\"attributes\":{\"ref_id\":\"b11\"},\"end\":17707,\"start\":17703},{\"attributes\":{\"ref_id\":\"b51\"},\"end\":17917,\"start\":17913},{\"attributes\":{\"ref_id\":\"b42\"},\"end\":18184,\"start\":18180},{\"attributes\":{\"ref_id\":\"b42\"},\"end\":18426,\"start\":18422},{\"attributes\":{\"ref_id\":\"b42\"},\"end\":18456,\"start\":18452},{\"attributes\":{\"ref_id\":\"b42\"},\"end\":18644,\"start\":18640},{\"attributes\":{\"ref_id\":\"b47\"},\"end\":18856,\"start\":18852},{\"attributes\":{\"ref_id\":\"b30\"},\"end\":19286,\"start\":19282},{\"attributes\":{\"ref_id\":\"b8\"},\"end\":19305,\"start\":19302},{\"attributes\":{\"ref_id\":\"b58\"},\"end\":19325,\"start\":19321},{\"attributes\":{\"ref_id\":\"b60\"},\"end\":19348,\"start\":19344},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":19369,\"start\":19365},{\"attributes\":{\"ref_id\":\"b42\"},\"end\":19389,\"start\":19385},{\"attributes\":{\"ref_id\":\"b6\"},\"end\":23339,\"start\":23336},{\"attributes\":{\"ref_id\":\"b19\"},\"end\":23935,\"start\":23931},{\"attributes\":{\"ref_id\":\"b21\"},\"end\":25119,\"start\":25115},{\"attributes\":{\"ref_id\":\"b21\"},\"end\":26150,\"start\":26146},{\"attributes\":{\"ref_id\":\"b53\"},\"end\":26269,\"start\":26265},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":26490,\"start\":26487},{\"attributes\":{\"ref_id\":\"b11\"},\"end\":31082,\"start\":31078},{\"attributes\":{\"ref_id\":\"b5\"},\"end\":31880,\"start\":31877},{\"attributes\":{\"ref_id\":\"b13\"},\"end\":31928,\"start\":31924},{\"attributes\":{\"ref_id\":\"b42\"},\"end\":32785,\"start\":32781},{\"attributes\":{\"ref_id\":\"b50\"},\"end\":32988,\"start\":32984},{\"attributes\":{\"ref_id\":\"b50\"},\"end\":33084,\"start\":33080},{\"attributes\":{\"ref_id\":\"b42\"},\"end\":33190,\"start\":33186},{\"attributes\":{\"ref_id\":\"b5\"},\"end\":33800,\"start\":33799},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":33839,\"start\":33838},{\"attributes\":{\"ref_id\":\"b5\"},\"end\":33926,\"start\":33925},{\"attributes\":{\"ref_id\":\"b26\"},\"end\":34156,\"start\":34152},{\"attributes\":{\"ref_id\":\"b6\"},\"end\":34330,\"start\":34329},{\"attributes\":{\"ref_id\":\"b24\"},\"end\":34540,\"start\":34536},{\"attributes\":{\"ref_id\":\"b42\"},\"end\":34546,\"start\":34542},{\"attributes\":{\"ref_id\":\"b8\"},\"end\":34584,\"start\":34581},{\"attributes\":{\"ref_id\":\"b53\"},\"end\":34625,\"start\":34621},{\"attributes\":{\"ref_id\":\"b62\"},\"end\":35117,\"start\":35113},{\"attributes\":{\"ref_id\":\"b6\"},\"end\":36172,\"start\":36169},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":36525,\"start\":36521},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":39226,\"start\":39223},{\"attributes\":{\"ref_id\":\"b8\"},\"end\":44134,\"start\":44133},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":44427,\"start\":44425},{\"attributes\":{\"ref_id\":\"b3\"},\"end\":44604,\"start\":44601},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":45226,\"start\":45222},{\"end\":45690,\"start\":45684},{\"attributes\":{\"ref_id\":\"b11\"},\"end\":46469,\"start\":46465},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":46535,\"start\":46533},{\"attributes\":{\"ref_id\":\"b50\"},\"end\":47739,\"start\":47735},{\"attributes\":{\"ref_id\":\"b57\"},\"end\":48654,\"start\":48650},{\"attributes\":{\"ref_id\":\"b42\"},\"end\":49247,\"start\":49243},{\"attributes\":{\"ref_id\":\"b66\"},\"end\":51494,\"start\":51490},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":51969,\"start\":51965},{\"attributes\":{\"ref_id\":\"b19\"},\"end\":52244,\"start\":52240}]", "figure": "[{\"attributes\":{\"id\":\"fig_0\"},\"end\":53104,\"start\":53044},{\"attributes\":{\"id\":\"fig_1\"},\"end\":53162,\"start\":53105},{\"attributes\":{\"id\":\"fig_2\"},\"end\":53266,\"start\":53163},{\"attributes\":{\"id\":\"fig_3\"},\"end\":53353,\"start\":53267},{\"attributes\":{\"id\":\"fig_4\"},\"end\":53453,\"start\":53354},{\"attributes\":{\"id\":\"fig_5\"},\"end\":53574,\"start\":53454},{\"attributes\":{\"id\":\"fig_6\"},\"end\":53702,\"start\":53575},{\"attributes\":{\"id\":\"fig_7\"},\"end\":53774,\"start\":53703},{\"attributes\":{\"id\":\"fig_8\"},\"end\":53897,\"start\":53775},{\"attributes\":{\"id\":\"fig_9\"},\"end\":54128,\"start\":53898},{\"attributes\":{\"id\":\"fig_10\"},\"end\":54197,\"start\":54129},{\"attributes\":{\"id\":\"tab_0\",\"type\":\"table\"},\"end\":54976,\"start\":54198},{\"attributes\":{\"id\":\"tab_1\",\"type\":\"table\"},\"end\":55494,\"start\":54977},{\"attributes\":{\"id\":\"tab_2\",\"type\":\"table\"},\"end\":55502,\"start\":55495},{\"attributes\":{\"id\":\"tab_3\",\"type\":\"table\"},\"end\":56002,\"start\":55503}]", "paragraph": "[{\"end\":3908,\"start\":3373},{\"end\":4038,\"start\":3918},{\"end\":5065,\"start\":4058},{\"end\":5743,\"start\":5067},{\"end\":7012,\"start\":5745},{\"end\":8527,\"start\":7014},{\"end\":9200,\"start\":8529},{\"end\":9274,\"start\":9202},{\"end\":10603,\"start\":9276},{\"end\":10834,\"start\":10624},{\"end\":12012,\"start\":10856},{\"end\":13107,\"start\":12080},{\"end\":14754,\"start\":13109},{\"end\":16067,\"start\":14796},{\"end\":16736,\"start\":16069},{\"end\":19207,\"start\":16766},{\"end\":20098,\"start\":19209},{\"end\":20356,\"start\":20164},{\"end\":20779,\"start\":20409},{\"end\":20940,\"start\":20781},{\"end\":21725,\"start\":20942},{\"end\":22623,\"start\":21727},{\"end\":23088,\"start\":22625},{\"end\":23676,\"start\":23090},{\"end\":24104,\"start\":23678},{\"end\":24746,\"start\":24300},{\"end\":25079,\"start\":24773},{\"end\":25191,\"start\":25081},{\"end\":25460,\"start\":25214},{\"end\":25575,\"start\":25497},{\"end\":25608,\"start\":25577},{\"end\":25954,\"start\":25727},{\"end\":26009,\"start\":25956},{\"end\":26151,\"start\":26044},{\"end\":26639,\"start\":26187},{\"end\":26750,\"start\":26662},{\"end\":26942,\"start\":26752},{\"end\":27403,\"start\":27068},{\"end\":27609,\"start\":27523},{\"end\":27659,\"start\":27643},{\"end\":28215,\"start\":27700},{\"end\":28282,\"start\":28217},{\"end\":28911,\"start\":28331},{\"end\":29189,\"start\":28950},{\"end\":29323,\"start\":29191},{\"end\":29589,\"start\":29456},{\"end\":29688,\"start\":29591},{\"end\":29971,\"start\":29746},{\"end\":30531,\"start\":30001},{\"end\":30733,\"start\":30556},{\"end\":31083,\"start\":30791},{\"end\":31439,\"start\":31085},{\"end\":31750,\"start\":31530},{\"end\":31794,\"start\":31752},{\"end\":31929,\"start\":31839},{\"end\":32398,\"start\":31947},{\"end\":34420,\"start\":32424},{\"end\":34789,\"start\":34450},{\"end\":35224,\"start\":34791},{\"end\":35765,\"start\":35226},{\"end\":36442,\"start\":35822},{\"end\":36531,\"start\":36505},{\"end\":36756,\"start\":36643},{\"end\":37372,\"start\":36758},{\"end\":38405,\"start\":37374},{\"end\":39567,\"start\":38407},{\"end\":40411,\"start\":39608},{\"end\":41095,\"start\":40413},{\"end\":41890,\"start\":41097},{\"end\":42430,\"start\":41892},{\"end\":43410,\"start\":42471},{\"end\":45113,\"start\":43449},{\"end\":46118,\"start\":45115},{\"end\":48143,\"start\":46148},{\"end\":48746,\"start\":48145},{\"end\":50147,\"start\":48809},{\"end\":51156,\"start\":50166},{\"end\":52178,\"start\":51158},{\"end\":52386,\"start\":52180},{\"end\":53043,\"start\":52388}]", "formula": "[{\"attributes\":{\"id\":\"formula_0\"},\"end\":24299,\"start\":24105},{\"attributes\":{\"id\":\"formula_1\"},\"end\":25213,\"start\":25192},{\"attributes\":{\"id\":\"formula_2\"},\"end\":25496,\"start\":25461},{\"attributes\":{\"id\":\"formula_3\"},\"end\":25726,\"start\":25609},{\"attributes\":{\"id\":\"formula_4\"},\"end\":26043,\"start\":26010},{\"attributes\":{\"id\":\"formula_5\"},\"end\":26186,\"start\":26152},{\"attributes\":{\"id\":\"formula_6\"},\"end\":26661,\"start\":26640},{\"attributes\":{\"id\":\"formula_7\"},\"end\":27067,\"start\":26943},{\"attributes\":{\"id\":\"formula_8\"},\"end\":27522,\"start\":27404},{\"attributes\":{\"id\":\"formula_9\"},\"end\":27642,\"start\":27610},{\"attributes\":{\"id\":\"formula_10\"},\"end\":28330,\"start\":28283},{\"attributes\":{\"id\":\"formula_11\"},\"end\":29455,\"start\":29324},{\"attributes\":{\"id\":\"formula_12\"},\"end\":29745,\"start\":29689},{\"attributes\":{\"id\":\"formula_13\"},\"end\":30555,\"start\":30532},{\"attributes\":{\"id\":\"formula_14\"},\"end\":30790,\"start\":30734},{\"attributes\":{\"id\":\"formula_15\"},\"end\":31529,\"start\":31440},{\"attributes\":{\"id\":\"formula_16\"},\"end\":31838,\"start\":31795},{\"attributes\":{\"id\":\"formula_17\"},\"end\":36504,\"start\":36443},{\"attributes\":{\"id\":\"formula_18\"},\"end\":36642,\"start\":36532},{\"attributes\":{\"id\":\"formula_19\"},\"end\":48808,\"start\":48747}]", "table_ref": "[{\"attributes\":{\"ref_id\":\"tab_1\"},\"end\":34391,\"start\":34384},{\"attributes\":{\"ref_id\":\"tab_1\"},\"end\":38535,\"start\":38527},{\"attributes\":{\"ref_id\":\"tab_1\"},\"end\":38707,\"start\":38699},{\"attributes\":{\"ref_id\":\"tab_1\"},\"end\":40877,\"start\":40789}]", "section_header": "[{\"end\":3916,\"start\":3911},{\"end\":4056,\"start\":4041},{\"end\":10622,\"start\":10606},{\"end\":10854,\"start\":10837},{\"end\":12078,\"start\":12015},{\"end\":14794,\"start\":14757},{\"end\":16764,\"start\":16739},{\"end\":20162,\"start\":20101},{\"end\":20407,\"start\":20359},{\"end\":24771,\"start\":24749},{\"end\":27698,\"start\":27662},{\"end\":28948,\"start\":28914},{\"end\":29999,\"start\":29974},{\"end\":31945,\"start\":31932},{\"end\":32422,\"start\":32401},{\"end\":34448,\"start\":34423},{\"end\":35820,\"start\":35768},{\"end\":39606,\"start\":39570},{\"end\":42469,\"start\":42433},{\"end\":43447,\"start\":43413},{\"end\":46146,\"start\":46121},{\"end\":50164,\"start\":50150},{\"end\":53053,\"start\":53045},{\"end\":53114,\"start\":53106},{\"end\":53172,\"start\":53164},{\"end\":53276,\"start\":53268},{\"end\":53363,\"start\":53355},{\"end\":53463,\"start\":53455},{\"end\":53584,\"start\":53576},{\"end\":53713,\"start\":53704},{\"end\":53785,\"start\":53776},{\"end\":53908,\"start\":53899},{\"end\":54139,\"start\":54130},{\"end\":54989,\"start\":54978},{\"end\":55501,\"start\":55496}]", "table": "[{\"end\":54976,\"start\":54870},{\"end\":55494,\"start\":55255}]", "figure_caption": "[{\"end\":53104,\"start\":53055},{\"end\":53162,\"start\":53116},{\"end\":53266,\"start\":53174},{\"end\":53353,\"start\":53278},{\"end\":53453,\"start\":53365},{\"end\":53574,\"start\":53465},{\"end\":53702,\"start\":53586},{\"end\":53774,\"start\":53716},{\"end\":53897,\"start\":53788},{\"end\":54128,\"start\":53911},{\"end\":54197,\"start\":54142},{\"end\":54870,\"start\":54200},{\"end\":55255,\"start\":54991},{\"end\":56002,\"start\":55505}]", "figure_ref": "[{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":7130,\"start\":7122},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":7389,\"start\":7383},{\"attributes\":{\"ref_id\":\"fig_1\"},\"end\":23018,\"start\":23012},{\"end\":34399,\"start\":34393},{\"end\":35004,\"start\":34998},{\"attributes\":{\"ref_id\":\"fig_2\"},\"end\":37464,\"start\":37458},{\"attributes\":{\"ref_id\":\"fig_3\"},\"end\":39436,\"start\":39430},{\"attributes\":{\"ref_id\":\"fig_4\"},\"end\":40752,\"start\":40746},{\"attributes\":{\"ref_id\":\"fig_4\"},\"end\":40775,\"start\":40769},{\"attributes\":{\"ref_id\":\"fig_5\"},\"end\":41261,\"start\":41252},{\"attributes\":{\"ref_id\":\"fig_5\"},\"end\":41438,\"start\":41429},{\"end\":42782,\"start\":42776},{\"attributes\":{\"ref_id\":\"fig_6\"},\"end\":43599,\"start\":43593},{\"attributes\":{\"ref_id\":\"fig_6\"},\"end\":43607,\"start\":43601},{\"attributes\":{\"ref_id\":\"fig_6\"},\"end\":43972,\"start\":43963},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":44625,\"start\":44618},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":45005,\"start\":44998},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":45283,\"start\":45276},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":45520,\"start\":45510},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":46117,\"start\":46107},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":46749,\"start\":46741},{\"end\":48501,\"start\":48495},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":49814,\"start\":49807}]", "bib_author_first_name": "[{\"end\":56311,\"start\":56310},{\"end\":56633,\"start\":56629},{\"end\":56640,\"start\":56639},{\"end\":56642,\"start\":56641},{\"end\":56652,\"start\":56651},{\"end\":56654,\"start\":56653},{\"end\":56667,\"start\":56663},{\"end\":56916,\"start\":56915},{\"end\":56925,\"start\":56924},{\"end\":56935,\"start\":56934},{\"end\":56937,\"start\":56936},{\"end\":56949,\"start\":56948},{\"end\":56958,\"start\":56957},{\"end\":57286,\"start\":57285},{\"end\":57297,\"start\":57296},{\"end\":57306,\"start\":57305},{\"end\":57316,\"start\":57315},{\"end\":57327,\"start\":57326},{\"end\":57702,\"start\":57701},{\"end\":57712,\"start\":57711},{\"end\":57722,\"start\":57721},{\"end\":58029,\"start\":58028},{\"end\":58044,\"start\":58043},{\"end\":58054,\"start\":58053},{\"end\":58065,\"start\":58064},{\"end\":58067,\"start\":58066},{\"end\":58076,\"start\":58075},{\"end\":58400,\"start\":58399},{\"end\":58402,\"start\":58401},{\"end\":58410,\"start\":58409},{\"end\":58412,\"start\":58411},{\"end\":58418,\"start\":58417},{\"end\":58420,\"start\":58419},{\"end\":58624,\"start\":58623},{\"end\":58637,\"start\":58636},{\"end\":58648,\"start\":58647},{\"end\":58650,\"start\":58649},{\"end\":58664,\"start\":58663},{\"end\":58666,\"start\":58665},{\"end\":59060,\"start\":59059},{\"end\":59071,\"start\":59070},{\"end\":59085,\"start\":59084},{\"end\":59411,\"start\":59410},{\"end\":59420,\"start\":59419},{\"end\":59426,\"start\":59425},{\"end\":59434,\"start\":59433},{\"end\":59436,\"start\":59435},{\"end\":59755,\"start\":59754},{\"end\":59766,\"start\":59762},{\"end\":60011,\"start\":60010},{\"end\":60019,\"start\":60018},{\"end\":60027,\"start\":60026},{\"end\":60029,\"start\":60028},{\"end\":60329,\"start\":60328},{\"end\":60348,\"start\":60347},{\"end\":60365,\"start\":60364},{\"end\":60747,\"start\":60746},{\"end\":60759,\"start\":60758},{\"end\":60768,\"start\":60767},{\"end\":60778,\"start\":60777},{\"end\":61194,\"start\":61193},{\"end\":61204,\"start\":61203},{\"end\":61221,\"start\":61220},{\"end\":61539,\"start\":61538},{\"end\":61541,\"start\":61540},{\"end\":61554,\"start\":61553},{\"end\":61568,\"start\":61567},{\"end\":61913,\"start\":61912},{\"end\":61923,\"start\":61922},{\"end\":62273,\"start\":62272},{\"end\":62280,\"start\":62279},{\"end\":62288,\"start\":62287},{\"end\":62296,\"start\":62295},{\"end\":62305,\"start\":62304},{\"end\":62307,\"start\":62306},{\"end\":62651,\"start\":62650},{\"end\":62871,\"start\":62870},{\"end\":62873,\"start\":62872},{\"end\":62886,\"start\":62885},{\"end\":63160,\"start\":63159},{\"end\":63487,\"start\":63486},{\"end\":63493,\"start\":63492},{\"end\":63502,\"start\":63498},{\"end\":63511,\"start\":63510},{\"end\":63519,\"start\":63518},{\"end\":63814,\"start\":63813},{\"end\":63825,\"start\":63824},{\"end\":63834,\"start\":63833},{\"end\":64082,\"start\":64081},{\"end\":64093,\"start\":64092},{\"end\":64099,\"start\":64098},{\"end\":64402,\"start\":64401},{\"end\":64412,\"start\":64411},{\"end\":64421,\"start\":64420},{\"end\":64423,\"start\":64422},{\"end\":64676,\"start\":64675},{\"end\":64678,\"start\":64677},{\"end\":64689,\"start\":64688},{\"end\":64691,\"start\":64690},{\"end\":64699,\"start\":64698},{\"end\":64701,\"start\":64700},{\"end\":65033,\"start\":65032},{\"end\":65035,\"start\":65034},{\"end\":65312,\"start\":65311},{\"end\":65320,\"start\":65319},{\"end\":65322,\"start\":65321},{\"end\":65331,\"start\":65330},{\"end\":65552,\"start\":65551},{\"end\":65850,\"start\":65849},{\"end\":65860,\"start\":65859},{\"end\":65870,\"start\":65869},{\"end\":66242,\"start\":66241},{\"end\":66252,\"start\":66251},{\"end\":66619,\"start\":66618},{\"end\":66621,\"start\":66620},{\"end\":66632,\"start\":66631},{\"end\":66934,\"start\":66933},{\"end\":66949,\"start\":66948},{\"end\":67297,\"start\":67296},{\"end\":67299,\"start\":67298},{\"end\":67310,\"start\":67309},{\"end\":67322,\"start\":67321},{\"end\":67658,\"start\":67654},{\"end\":67668,\"start\":67664},{\"end\":67678,\"start\":67674},{\"end\":68028,\"start\":68027},{\"end\":68357,\"start\":68356},{\"end\":68366,\"start\":68365},{\"end\":68684,\"start\":68683},{\"end\":68696,\"start\":68695},{\"end\":68706,\"start\":68705},{\"end\":69134,\"start\":69133},{\"end\":69144,\"start\":69143},{\"end\":69155,\"start\":69154},{\"end\":69165,\"start\":69164},{\"end\":69486,\"start\":69485},{\"end\":69495,\"start\":69494},{\"end\":69836,\"start\":69835},{\"end\":69843,\"start\":69842},{\"end\":69845,\"start\":69844},{\"end\":69852,\"start\":69851},{\"end\":70127,\"start\":70126},{\"end\":70134,\"start\":70133},{\"end\":70136,\"start\":70135},{\"end\":70143,\"start\":70142},{\"end\":70149,\"start\":70148},{\"end\":70151,\"start\":70150},{\"end\":70508,\"start\":70507},{\"end\":70811,\"start\":70810},{\"end\":71099,\"start\":71098},{\"end\":71110,\"start\":71109},{\"end\":71458,\"start\":71457},{\"end\":71699,\"start\":71698},{\"end\":71707,\"start\":71706},{\"end\":71716,\"start\":71715},{\"end\":71962,\"start\":71961},{\"end\":71970,\"start\":71969},{\"end\":71981,\"start\":71980},{\"end\":71983,\"start\":71982},{\"end\":72310,\"start\":72309},{\"end\":72321,\"start\":72320},{\"end\":72333,\"start\":72332},{\"end\":72647,\"start\":72646},{\"end\":72658,\"start\":72657},{\"end\":72668,\"start\":72667},{\"end\":72968,\"start\":72967},{\"end\":73260,\"start\":73259},{\"end\":73598,\"start\":73597},{\"end\":73600,\"start\":73599},{\"end\":73609,\"start\":73608},{\"end\":73611,\"start\":73610},{\"end\":73622,\"start\":73621},{\"end\":73633,\"start\":73632},{\"end\":73645,\"start\":73644},{\"end\":73992,\"start\":73991},{\"end\":74004,\"start\":74003},{\"end\":74319,\"start\":74318},{\"end\":74329,\"start\":74328},{\"end\":74337,\"start\":74336},{\"end\":74716,\"start\":74715},{\"end\":74725,\"start\":74721},{\"end\":74735,\"start\":74731},{\"end\":74744,\"start\":74740},{\"end\":74752,\"start\":74751},{\"end\":75153,\"start\":75152},{\"end\":75162,\"start\":75161},{\"end\":75173,\"start\":75172},{\"end\":75521,\"start\":75520},{\"end\":75529,\"start\":75528},{\"end\":75537,\"start\":75536},{\"end\":75539,\"start\":75538},{\"end\":75875,\"start\":75874},{\"end\":75883,\"start\":75882},{\"end\":75892,\"start\":75891},{\"end\":75901,\"start\":75900},{\"end\":75909,\"start\":75908},{\"end\":76243,\"start\":76242},{\"end\":76480,\"start\":76479},{\"end\":76721,\"start\":76720},{\"end\":77035,\"start\":77034},{\"end\":77042,\"start\":77041},{\"end\":77049,\"start\":77048},{\"end\":77056,\"start\":77055},{\"end\":77062,\"start\":77061},{\"end\":77400,\"start\":77399},{\"end\":77406,\"start\":77405},{\"end\":77413,\"start\":77412},{\"end\":77422,\"start\":77421},{\"end\":77435,\"start\":77434},{\"end\":77754,\"start\":77753},{\"end\":78016,\"start\":78015},{\"end\":78025,\"start\":78024},{\"end\":78347,\"start\":78346},{\"end\":78354,\"start\":78353},{\"end\":78363,\"start\":78362},{\"end\":78371,\"start\":78370},{\"end\":78379,\"start\":78378}]", "bib_author_last_name": "[{\"end\":56317,\"start\":56312},{\"end\":56637,\"start\":56634},{\"end\":56649,\"start\":56643},{\"end\":56661,\"start\":56655},{\"end\":56676,\"start\":56668},{\"end\":56922,\"start\":56917},{\"end\":56932,\"start\":56926},{\"end\":56946,\"start\":56938},{\"end\":56955,\"start\":56950},{\"end\":56966,\"start\":56959},{\"end\":57294,\"start\":57287},{\"end\":57303,\"start\":57298},{\"end\":57313,\"start\":57307},{\"end\":57324,\"start\":57317},{\"end\":57335,\"start\":57328},{\"end\":57709,\"start\":57703},{\"end\":57719,\"start\":57713},{\"end\":57732,\"start\":57723},{\"end\":58041,\"start\":58030},{\"end\":58051,\"start\":58045},{\"end\":58062,\"start\":58055},{\"end\":58073,\"start\":58068},{\"end\":58081,\"start\":58077},{\"end\":58407,\"start\":58403},{\"end\":58415,\"start\":58413},{\"end\":58427,\"start\":58421},{\"end\":58634,\"start\":58625},{\"end\":58645,\"start\":58638},{\"end\":58661,\"start\":58651},{\"end\":58670,\"start\":58667},{\"end\":59068,\"start\":59061},{\"end\":59082,\"start\":59072},{\"end\":59094,\"start\":59086},{\"end\":59417,\"start\":59412},{\"end\":59423,\"start\":59421},{\"end\":59431,\"start\":59427},{\"end\":59446,\"start\":59437},{\"end\":59760,\"start\":59756},{\"end\":59770,\"start\":59767},{\"end\":60016,\"start\":60012},{\"end\":60024,\"start\":60020},{\"end\":60033,\"start\":60030},{\"end\":60345,\"start\":60330},{\"end\":60362,\"start\":60349},{\"end\":60377,\"start\":60366},{\"end\":60756,\"start\":60748},{\"end\":60765,\"start\":60760},{\"end\":60775,\"start\":60769},{\"end\":60786,\"start\":60779},{\"end\":61201,\"start\":61195},{\"end\":61218,\"start\":61205},{\"end\":61233,\"start\":61222},{\"end\":61551,\"start\":61542},{\"end\":61565,\"start\":61555},{\"end\":61577,\"start\":61569},{\"end\":61920,\"start\":61914},{\"end\":61927,\"start\":61924},{\"end\":62277,\"start\":62274},{\"end\":62285,\"start\":62281},{\"end\":62293,\"start\":62289},{\"end\":62302,\"start\":62297},{\"end\":62317,\"start\":62308},{\"end\":62654,\"start\":62652},{\"end\":62883,\"start\":62874},{\"end\":62895,\"start\":62887},{\"end\":63172,\"start\":63161},{\"end\":63490,\"start\":63488},{\"end\":63496,\"start\":63494},{\"end\":63508,\"start\":63503},{\"end\":63516,\"start\":63512},{\"end\":63525,\"start\":63520},{\"end\":63822,\"start\":63815},{\"end\":63831,\"start\":63826},{\"end\":63837,\"start\":63835},{\"end\":64090,\"start\":64083},{\"end\":64096,\"start\":64094},{\"end\":64105,\"start\":64100},{\"end\":64409,\"start\":64403},{\"end\":64418,\"start\":64413},{\"end\":64430,\"start\":64424},{\"end\":64686,\"start\":64679},{\"end\":64696,\"start\":64692},{\"end\":64706,\"start\":64702},{\"end\":65042,\"start\":65036},{\"end\":65317,\"start\":65313},{\"end\":65328,\"start\":65323},{\"end\":65338,\"start\":65332},{\"end\":65558,\"start\":65553},{\"end\":65857,\"start\":65851},{\"end\":65867,\"start\":65861},{\"end\":65876,\"start\":65871},{\"end\":66249,\"start\":66243},{\"end\":66258,\"start\":66253},{\"end\":66629,\"start\":66622},{\"end\":66639,\"start\":66633},{\"end\":66946,\"start\":66935},{\"end\":66956,\"start\":66950},{\"end\":67307,\"start\":67300},{\"end\":67319,\"start\":67311},{\"end\":67332,\"start\":67323},{\"end\":67662,\"start\":67659},{\"end\":67672,\"start\":67669},{\"end\":67682,\"start\":67679},{\"end\":68031,\"start\":68029},{\"end\":68363,\"start\":68358},{\"end\":68372,\"start\":68367},{\"end\":68693,\"start\":68685},{\"end\":68703,\"start\":68697},{\"end\":68712,\"start\":68707},{\"end\":69141,\"start\":69135},{\"end\":69152,\"start\":69145},{\"end\":69162,\"start\":69156},{\"end\":69171,\"start\":69166},{\"end\":69492,\"start\":69487},{\"end\":69504,\"start\":69496},{\"end\":69840,\"start\":69837},{\"end\":69849,\"start\":69846},{\"end\":69855,\"start\":69853},{\"end\":70131,\"start\":70128},{\"end\":70140,\"start\":70137},{\"end\":70146,\"start\":70144},{\"end\":70159,\"start\":70152},{\"end\":70512,\"start\":70509},{\"end\":70819,\"start\":70812},{\"end\":71107,\"start\":71100},{\"end\":71116,\"start\":71111},{\"end\":71467,\"start\":71459},{\"end\":71704,\"start\":71700},{\"end\":71713,\"start\":71708},{\"end\":71719,\"start\":71717},{\"end\":71967,\"start\":71963},{\"end\":71978,\"start\":71971},{\"end\":71994,\"start\":71984},{\"end\":72318,\"start\":72311},{\"end\":72330,\"start\":72322},{\"end\":72340,\"start\":72334},{\"end\":72655,\"start\":72648},{\"end\":72665,\"start\":72659},{\"end\":72677,\"start\":72669},{\"end\":72980,\"start\":72969},{\"end\":73269,\"start\":73261},{\"end\":73606,\"start\":73601},{\"end\":73619,\"start\":73612},{\"end\":73630,\"start\":73623},{\"end\":73642,\"start\":73634},{\"end\":73654,\"start\":73646},{\"end\":74001,\"start\":73993},{\"end\":74014,\"start\":74005},{\"end\":74326,\"start\":74320},{\"end\":74334,\"start\":74330},{\"end\":74346,\"start\":74338},{\"end\":74719,\"start\":74717},{\"end\":74729,\"start\":74726},{\"end\":74738,\"start\":74736},{\"end\":74749,\"start\":74745},{\"end\":74758,\"start\":74753},{\"end\":75159,\"start\":75154},{\"end\":75170,\"start\":75163},{\"end\":75179,\"start\":75174},{\"end\":75526,\"start\":75522},{\"end\":75534,\"start\":75530},{\"end\":75542,\"start\":75540},{\"end\":75880,\"start\":75876},{\"end\":75889,\"start\":75884},{\"end\":75898,\"start\":75893},{\"end\":75906,\"start\":75902},{\"end\":75918,\"start\":75910},{\"end\":76248,\"start\":76244},{\"end\":76483,\"start\":76481},{\"end\":76726,\"start\":76722},{\"end\":77039,\"start\":77036},{\"end\":77046,\"start\":77043},{\"end\":77053,\"start\":77050},{\"end\":77059,\"start\":77057},{\"end\":77067,\"start\":77063},{\"end\":77403,\"start\":77401},{\"end\":77410,\"start\":77407},{\"end\":77419,\"start\":77414},{\"end\":77432,\"start\":77423},{\"end\":77443,\"start\":77436},{\"end\":77760,\"start\":77755},{\"end\":78022,\"start\":78017},{\"end\":78035,\"start\":78026},{\"end\":78351,\"start\":78348},{\"end\":78360,\"start\":78355},{\"end\":78368,\"start\":78364},{\"end\":78376,\"start\":78372},{\"end\":78383,\"start\":78380}]", "bib_entry": "[{\"attributes\":{\"id\":\"b0\",\"matched_paper_id\":17275830},\"end\":56576,\"start\":56254},{\"attributes\":{\"id\":\"b1\",\"matched_paper_id\":9339154},\"end\":56839,\"start\":56578},{\"attributes\":{\"id\":\"b2\",\"matched_paper_id\":6557747},\"end\":57226,\"start\":56841},{\"attributes\":{\"id\":\"b3\",\"matched_paper_id\":206858072},\"end\":57602,\"start\":57228},{\"attributes\":{\"id\":\"b4\",\"matched_paper_id\":16902615},\"end\":57953,\"start\":57604},{\"attributes\":{\"id\":\"b5\",\"matched_paper_id\":1582990},\"end\":58368,\"start\":57955},{\"attributes\":{\"id\":\"b6\",\"matched_paper_id\":3177797},\"end\":58571,\"start\":58370},{\"attributes\":{\"id\":\"b7\",\"matched_paper_id\":17824518},\"end\":58994,\"start\":58573},{\"attributes\":{\"id\":\"b8\",\"matched_paper_id\":12726540},\"end\":59312,\"start\":58996},{\"attributes\":{\"id\":\"b9\",\"matched_paper_id\":2621664},\"end\":59688,\"start\":59314},{\"attributes\":{\"id\":\"b10\",\"matched_paper_id\":207240186},\"end\":59954,\"start\":59690},{\"attributes\":{\"id\":\"b11\",\"matched_paper_id\":3244469},\"end\":60244,\"start\":59956},{\"attributes\":{\"id\":\"b12\",\"matched_paper_id\":41420943},\"end\":60647,\"start\":60246},{\"attributes\":{\"id\":\"b13\",\"matched_paper_id\":207222553},\"end\":61120,\"start\":60649},{\"attributes\":{\"id\":\"b14\",\"matched_paper_id\":20113606},\"end\":61481,\"start\":61122},{\"attributes\":{\"id\":\"b15\",\"matched_paper_id\":5808384},\"end\":61808,\"start\":61483},{\"attributes\":{\"id\":\"b16\",\"matched_paper_id\":207190913},\"end\":62185,\"start\":61810},{\"attributes\":{\"id\":\"b17\",\"matched_paper_id\":7508190},\"end\":62588,\"start\":62187},{\"attributes\":{\"id\":\"b18\",\"matched_paper_id\":207225412},\"end\":62841,\"start\":62590},{\"attributes\":{\"id\":\"b19\",\"matched_paper_id\":15671300},\"end\":63094,\"start\":62843},{\"attributes\":{\"id\":\"b20\",\"matched_paper_id\":207242933},\"end\":63444,\"start\":63096},{\"attributes\":{\"id\":\"b21\",\"matched_paper_id\":15033764},\"end\":63761,\"start\":63446},{\"attributes\":{\"id\":\"b22\",\"matched_paper_id\":206752782},\"end\":64014,\"start\":63763},{\"attributes\":{\"id\":\"b23\",\"matched_paper_id\":17057637},\"end\":64333,\"start\":64016},{\"attributes\":{\"doi\":\"abs/1508.02091\",\"id\":\"b24\",\"matched_paper_id\":11759625},\"end\":64586,\"start\":64335},{\"attributes\":{\"id\":\"b25\",\"matched_paper_id\":624263},\"end\":64970,\"start\":64588},{\"attributes\":{\"id\":\"b26\",\"matched_paper_id\":6343281},\"end\":65252,\"start\":64972},{\"attributes\":{\"doi\":\"arXiv:150203815\",\"id\":\"b27\"},\"end\":65473,\"start\":65254},{\"attributes\":{\"id\":\"b28\",\"matched_paper_id\":18893815},\"end\":65780,\"start\":65475},{\"attributes\":{\"id\":\"b29\",\"matched_paper_id\":5279671},\"end\":66097,\"start\":65782},{\"attributes\":{\"id\":\"b30\",\"matched_paper_id\":10427616},\"end\":66542,\"start\":66099},{\"attributes\":{\"id\":\"b31\",\"matched_paper_id\":3169379},\"end\":66858,\"start\":66544},{\"attributes\":{\"id\":\"b32\",\"matched_paper_id\":5716090},\"end\":67219,\"start\":66860},{\"attributes\":{\"id\":\"b33\",\"matched_paper_id\":7016601},\"end\":67582,\"start\":67221},{\"attributes\":{\"id\":\"b34\",\"matched_paper_id\":3640500},\"end\":67929,\"start\":67584},{\"attributes\":{\"id\":\"b35\",\"matched_paper_id\":2936836},\"end\":68235,\"start\":67931},{\"attributes\":{\"id\":\"b36\",\"matched_paper_id\":146543679},\"end\":68600,\"start\":68237},{\"attributes\":{\"id\":\"b37\",\"matched_paper_id\":207199278},\"end\":69076,\"start\":68602},{\"attributes\":{\"id\":\"b38\",\"matched_paper_id\":7934228},\"end\":69397,\"start\":69078},{\"attributes\":{\"id\":\"b39\",\"matched_paper_id\":12317957},\"end\":69768,\"start\":69399},{\"attributes\":{\"id\":\"b40\",\"matched_paper_id\":22901658},\"end\":70035,\"start\":69770},{\"attributes\":{\"id\":\"b41\",\"matched_paper_id\":23076475},\"end\":70393,\"start\":70037},{\"attributes\":{\"id\":\"b42\",\"matched_paper_id\":6655663},\"end\":70736,\"start\":70395},{\"attributes\":{\"id\":\"b43\",\"matched_paper_id\":53636994},\"end\":71025,\"start\":70738},{\"attributes\":{\"id\":\"b44\",\"matched_paper_id\":17968463},\"end\":71393,\"start\":71027},{\"attributes\":{\"id\":\"b45\",\"matched_paper_id\":7909941},\"end\":71625,\"start\":71395},{\"attributes\":{\"id\":\"b46\",\"matched_paper_id\":5909766},\"end\":71916,\"start\":71627},{\"attributes\":{\"id\":\"b47\",\"matched_paper_id\":1571008},\"end\":72223,\"start\":71918},{\"attributes\":{\"id\":\"b48\",\"matched_paper_id\":17296081},\"end\":72558,\"start\":72225},{\"attributes\":{\"id\":\"b49\",\"matched_paper_id\":12206907},\"end\":72899,\"start\":72560},{\"attributes\":{\"id\":\"b50\",\"matched_paper_id\":1299169},\"end\":73188,\"start\":72901},{\"attributes\":{\"id\":\"b51\",\"matched_paper_id\":7319196},\"end\":73483,\"start\":73190},{\"attributes\":{\"id\":\"b52\",\"matched_paper_id\":11073377},\"end\":73921,\"start\":73485},{\"attributes\":{\"id\":\"b53\",\"matched_paper_id\":14124313},\"end\":74222,\"start\":73923},{\"attributes\":{\"id\":\"b54\",\"matched_paper_id\":14762449},\"end\":74657,\"start\":74224},{\"attributes\":{\"id\":\"b55\",\"matched_paper_id\":9611128},\"end\":75083,\"start\":74659},{\"attributes\":{\"id\":\"b56\",\"matched_paper_id\":26147185},\"end\":75468,\"start\":75085},{\"attributes\":{\"id\":\"b57\",\"matched_paper_id\":14362511},\"end\":75817,\"start\":75470},{\"attributes\":{\"id\":\"b58\",\"matched_paper_id\":206822288},\"end\":76192,\"start\":75819},{\"attributes\":{\"id\":\"b59\",\"matched_paper_id\":2004024},\"end\":76433,\"start\":76194},{\"attributes\":{\"id\":\"b60\",\"matched_paper_id\":10704475},\"end\":76637,\"start\":76435},{\"attributes\":{\"id\":\"b61\",\"matched_paper_id\":11901987},\"end\":76981,\"start\":76639},{\"attributes\":{\"id\":\"b62\"},\"end\":77334,\"start\":76983},{\"attributes\":{\"id\":\"b63\",\"matched_paper_id\":9293044},\"end\":77691,\"start\":77336},{\"attributes\":{\"id\":\"b64\",\"matched_paper_id\":6982779},\"end\":77955,\"start\":77693},{\"attributes\":{\"id\":\"b65\",\"matched_paper_id\":229339},\"end\":78247,\"start\":77957},{\"attributes\":{\"id\":\"b66\",\"matched_paper_id\":7452511},\"end\":78678,\"start\":78249}]", "bib_title": "[{\"end\":56308,\"start\":56254},{\"end\":56627,\"start\":56578},{\"end\":56913,\"start\":56841},{\"end\":57283,\"start\":57228},{\"end\":57699,\"start\":57604},{\"end\":58026,\"start\":57955},{\"end\":58397,\"start\":58370},{\"end\":58621,\"start\":58573},{\"end\":59057,\"start\":58996},{\"end\":59408,\"start\":59314},{\"end\":59752,\"start\":59690},{\"end\":60008,\"start\":59956},{\"end\":60326,\"start\":60246},{\"end\":60744,\"start\":60649},{\"end\":61191,\"start\":61122},{\"end\":61536,\"start\":61483},{\"end\":61910,\"start\":61810},{\"end\":62270,\"start\":62187},{\"end\":62648,\"start\":62590},{\"end\":62868,\"start\":62843},{\"end\":63157,\"start\":63096},{\"end\":63484,\"start\":63446},{\"end\":63811,\"start\":63763},{\"end\":64079,\"start\":64016},{\"end\":64399,\"start\":64335},{\"end\":64673,\"start\":64588},{\"end\":65030,\"start\":64972},{\"end\":65549,\"start\":65475},{\"end\":65847,\"start\":65782},{\"end\":66239,\"start\":66099},{\"end\":66616,\"start\":66544},{\"end\":66931,\"start\":66860},{\"end\":67294,\"start\":67221},{\"end\":67652,\"start\":67584},{\"end\":68025,\"start\":67931},{\"end\":68354,\"start\":68237},{\"end\":68681,\"start\":68602},{\"end\":69131,\"start\":69078},{\"end\":69483,\"start\":69399},{\"end\":69833,\"start\":69770},{\"end\":70124,\"start\":70037},{\"end\":70505,\"start\":70395},{\"end\":70808,\"start\":70738},{\"end\":71096,\"start\":71027},{\"end\":71455,\"start\":71395},{\"end\":71696,\"start\":71627},{\"end\":71959,\"start\":71918},{\"end\":72307,\"start\":72225},{\"end\":72644,\"start\":72560},{\"end\":72965,\"start\":72901},{\"end\":73257,\"start\":73190},{\"end\":73595,\"start\":73485},{\"end\":73989,\"start\":73923},{\"end\":74316,\"start\":74224},{\"end\":74713,\"start\":74659},{\"end\":75150,\"start\":75085},{\"end\":75518,\"start\":75470},{\"end\":75872,\"start\":75819},{\"end\":76240,\"start\":76194},{\"end\":76477,\"start\":76435},{\"end\":76718,\"start\":76639},{\"end\":77032,\"start\":76983},{\"end\":77397,\"start\":77336},{\"end\":77751,\"start\":77693},{\"end\":78013,\"start\":77957},{\"end\":78344,\"start\":78249}]", "bib_author": "[{\"end\":56319,\"start\":56310},{\"end\":56639,\"start\":56629},{\"end\":56651,\"start\":56639},{\"end\":56663,\"start\":56651},{\"end\":56678,\"start\":56663},{\"end\":56924,\"start\":56915},{\"end\":56934,\"start\":56924},{\"end\":56948,\"start\":56934},{\"end\":56957,\"start\":56948},{\"end\":56968,\"start\":56957},{\"end\":57296,\"start\":57285},{\"end\":57305,\"start\":57296},{\"end\":57315,\"start\":57305},{\"end\":57326,\"start\":57315},{\"end\":57337,\"start\":57326},{\"end\":57711,\"start\":57701},{\"end\":57721,\"start\":57711},{\"end\":57734,\"start\":57721},{\"end\":58043,\"start\":58028},{\"end\":58053,\"start\":58043},{\"end\":58064,\"start\":58053},{\"end\":58075,\"start\":58064},{\"end\":58083,\"start\":58075},{\"end\":58409,\"start\":58399},{\"end\":58417,\"start\":58409},{\"end\":58429,\"start\":58417},{\"end\":58636,\"start\":58623},{\"end\":58647,\"start\":58636},{\"end\":58663,\"start\":58647},{\"end\":58672,\"start\":58663},{\"end\":59070,\"start\":59059},{\"end\":59084,\"start\":59070},{\"end\":59096,\"start\":59084},{\"end\":59419,\"start\":59410},{\"end\":59425,\"start\":59419},{\"end\":59433,\"start\":59425},{\"end\":59448,\"start\":59433},{\"end\":59762,\"start\":59754},{\"end\":59772,\"start\":59762},{\"end\":60018,\"start\":60010},{\"end\":60026,\"start\":60018},{\"end\":60035,\"start\":60026},{\"end\":60347,\"start\":60328},{\"end\":60364,\"start\":60347},{\"end\":60379,\"start\":60364},{\"end\":60758,\"start\":60746},{\"end\":60767,\"start\":60758},{\"end\":60777,\"start\":60767},{\"end\":60788,\"start\":60777},{\"end\":61203,\"start\":61193},{\"end\":61220,\"start\":61203},{\"end\":61235,\"start\":61220},{\"end\":61553,\"start\":61538},{\"end\":61567,\"start\":61553},{\"end\":61579,\"start\":61567},{\"end\":61922,\"start\":61912},{\"end\":61929,\"start\":61922},{\"end\":62279,\"start\":62272},{\"end\":62287,\"start\":62279},{\"end\":62295,\"start\":62287},{\"end\":62304,\"start\":62295},{\"end\":62319,\"start\":62304},{\"end\":62656,\"start\":62650},{\"end\":62885,\"start\":62870},{\"end\":62897,\"start\":62885},{\"end\":63174,\"start\":63159},{\"end\":63492,\"start\":63486},{\"end\":63498,\"start\":63492},{\"end\":63510,\"start\":63498},{\"end\":63518,\"start\":63510},{\"end\":63527,\"start\":63518},{\"end\":63824,\"start\":63813},{\"end\":63833,\"start\":63824},{\"end\":63839,\"start\":63833},{\"end\":64092,\"start\":64081},{\"end\":64098,\"start\":64092},{\"end\":64107,\"start\":64098},{\"end\":64411,\"start\":64401},{\"end\":64420,\"start\":64411},{\"end\":64432,\"start\":64420},{\"end\":64688,\"start\":64675},{\"end\":64698,\"start\":64688},{\"end\":64708,\"start\":64698},{\"end\":65044,\"start\":65032},{\"end\":65319,\"start\":65311},{\"end\":65330,\"start\":65319},{\"end\":65340,\"start\":65330},{\"end\":65560,\"start\":65551},{\"end\":65859,\"start\":65849},{\"end\":65869,\"start\":65859},{\"end\":65878,\"start\":65869},{\"end\":66251,\"start\":66241},{\"end\":66260,\"start\":66251},{\"end\":66631,\"start\":66618},{\"end\":66641,\"start\":66631},{\"end\":66948,\"start\":66933},{\"end\":66958,\"start\":66948},{\"end\":67309,\"start\":67296},{\"end\":67321,\"start\":67309},{\"end\":67334,\"start\":67321},{\"end\":67664,\"start\":67654},{\"end\":67674,\"start\":67664},{\"end\":67684,\"start\":67674},{\"end\":68033,\"start\":68027},{\"end\":68365,\"start\":68356},{\"end\":68374,\"start\":68365},{\"end\":68695,\"start\":68683},{\"end\":68705,\"start\":68695},{\"end\":68714,\"start\":68705},{\"end\":69143,\"start\":69133},{\"end\":69154,\"start\":69143},{\"end\":69164,\"start\":69154},{\"end\":69173,\"start\":69164},{\"end\":69494,\"start\":69485},{\"end\":69506,\"start\":69494},{\"end\":69842,\"start\":69835},{\"end\":69851,\"start\":69842},{\"end\":69857,\"start\":69851},{\"end\":70133,\"start\":70126},{\"end\":70142,\"start\":70133},{\"end\":70148,\"start\":70142},{\"end\":70161,\"start\":70148},{\"end\":70514,\"start\":70507},{\"end\":70821,\"start\":70810},{\"end\":71109,\"start\":71098},{\"end\":71118,\"start\":71109},{\"end\":71469,\"start\":71457},{\"end\":71706,\"start\":71698},{\"end\":71715,\"start\":71706},{\"end\":71721,\"start\":71715},{\"end\":71969,\"start\":71961},{\"end\":71980,\"start\":71969},{\"end\":71996,\"start\":71980},{\"end\":72320,\"start\":72309},{\"end\":72332,\"start\":72320},{\"end\":72342,\"start\":72332},{\"end\":72657,\"start\":72646},{\"end\":72667,\"start\":72657},{\"end\":72679,\"start\":72667},{\"end\":72982,\"start\":72967},{\"end\":73271,\"start\":73259},{\"end\":73608,\"start\":73597},{\"end\":73621,\"start\":73608},{\"end\":73632,\"start\":73621},{\"end\":73644,\"start\":73632},{\"end\":73656,\"start\":73644},{\"end\":74003,\"start\":73991},{\"end\":74016,\"start\":74003},{\"end\":74328,\"start\":74318},{\"end\":74336,\"start\":74328},{\"end\":74348,\"start\":74336},{\"end\":74721,\"start\":74715},{\"end\":74731,\"start\":74721},{\"end\":74740,\"start\":74731},{\"end\":74751,\"start\":74740},{\"end\":74760,\"start\":74751},{\"end\":75161,\"start\":75152},{\"end\":75172,\"start\":75161},{\"end\":75181,\"start\":75172},{\"end\":75528,\"start\":75520},{\"end\":75536,\"start\":75528},{\"end\":75544,\"start\":75536},{\"end\":75882,\"start\":75874},{\"end\":75891,\"start\":75882},{\"end\":75900,\"start\":75891},{\"end\":75908,\"start\":75900},{\"end\":75920,\"start\":75908},{\"end\":76250,\"start\":76242},{\"end\":76485,\"start\":76479},{\"end\":76728,\"start\":76720},{\"end\":77041,\"start\":77034},{\"end\":77048,\"start\":77041},{\"end\":77055,\"start\":77048},{\"end\":77061,\"start\":77055},{\"end\":77069,\"start\":77061},{\"end\":77405,\"start\":77399},{\"end\":77412,\"start\":77405},{\"end\":77421,\"start\":77412},{\"end\":77434,\"start\":77421},{\"end\":77445,\"start\":77434},{\"end\":77762,\"start\":77753},{\"end\":78024,\"start\":78015},{\"end\":78037,\"start\":78024},{\"end\":78353,\"start\":78346},{\"end\":78362,\"start\":78353},{\"end\":78370,\"start\":78362},{\"end\":78378,\"start\":78370},{\"end\":78385,\"start\":78378}]", "bib_venue": "[{\"end\":56423,\"start\":56375},{\"end\":57030,\"start\":57003},{\"end\":57415,\"start\":57380},{\"end\":58161,\"start\":58126},{\"end\":58776,\"start\":58728},{\"end\":59148,\"start\":59126},{\"end\":59494,\"start\":59475},{\"end\":59818,\"start\":59799},{\"end\":60097,\"start\":60070},{\"end\":60443,\"start\":60417},{\"end\":60890,\"start\":60843},{\"end\":61299,\"start\":61273},{\"end\":61641,\"start\":61616},{\"end\":61997,\"start\":61967},{\"end\":62381,\"start\":62354},{\"end\":62712,\"start\":62688},{\"end\":63278,\"start\":63230},{\"end\":63607,\"start\":63571},{\"end\":64177,\"start\":64146},{\"end\":64778,\"start\":64747},{\"end\":65110,\"start\":65081},{\"end\":65628,\"start\":65598},{\"end\":65936,\"start\":65911},{\"end\":66318,\"start\":66293},{\"end\":66699,\"start\":66674},{\"end\":67042,\"start\":67004},{\"end\":67758,\"start\":67725},{\"end\":68079,\"start\":68060},{\"end\":68858,\"start\":68790},{\"end\":69237,\"start\":69209},{\"end\":69586,\"start\":69550},{\"end\":70877,\"start\":70853},{\"end\":71220,\"start\":71173},{\"end\":71767,\"start\":71748},{\"end\":72070,\"start\":72037},{\"end\":73040,\"start\":73015},{\"end\":73333,\"start\":73306},{\"end\":74078,\"start\":74051},{\"end\":74450,\"start\":74403},{\"end\":74864,\"start\":74816},{\"end\":75285,\"start\":75237},{\"end\":75650,\"start\":75601},{\"end\":76010,\"start\":75969},{\"end\":76312,\"start\":76285},{\"end\":76812,\"start\":76774},{\"end\":77163,\"start\":77120},{\"end\":77515,\"start\":77484},{\"end\":77820,\"start\":77795},{\"end\":78099,\"start\":78072},{\"end\":78465,\"start\":78429},{\"end\":56373,\"start\":56319},{\"end\":56686,\"start\":56678},{\"end\":57001,\"start\":56968},{\"end\":57378,\"start\":57337},{\"end\":57753,\"start\":57734},{\"end\":58124,\"start\":58083},{\"end\":58448,\"start\":58429},{\"end\":58726,\"start\":58672},{\"end\":59124,\"start\":59096},{\"end\":59473,\"start\":59448},{\"end\":59797,\"start\":59772},{\"end\":60068,\"start\":60035},{\"end\":60415,\"start\":60379},{\"end\":60841,\"start\":60788},{\"end\":61271,\"start\":61235},{\"end\":61614,\"start\":61579},{\"end\":61965,\"start\":61929},{\"end\":62352,\"start\":62319},{\"end\":62686,\"start\":62656},{\"end\":62937,\"start\":62897},{\"end\":63228,\"start\":63174},{\"end\":63569,\"start\":63527},{\"end\":63861,\"start\":63839},{\"end\":64144,\"start\":64107},{\"end\":64450,\"start\":64446},{\"end\":64745,\"start\":64708},{\"end\":65079,\"start\":65044},{\"end\":65309,\"start\":65254},{\"end\":65596,\"start\":65560},{\"end\":65909,\"start\":65878},{\"end\":66291,\"start\":66260},{\"end\":66672,\"start\":66641},{\"end\":67002,\"start\":66958},{\"end\":67372,\"start\":67334},{\"end\":67723,\"start\":67684},{\"end\":68058,\"start\":68033},{\"end\":68394,\"start\":68374},{\"end\":68788,\"start\":68714},{\"end\":69207,\"start\":69173},{\"end\":69548,\"start\":69506},{\"end\":69872,\"start\":69857},{\"end\":70183,\"start\":70161},{\"end\":70536,\"start\":70514},{\"end\":70851,\"start\":70821},{\"end\":71171,\"start\":71118},{\"end\":71483,\"start\":71469},{\"end\":71746,\"start\":71721},{\"end\":72035,\"start\":71996},{\"end\":72364,\"start\":72342},{\"end\":72701,\"start\":72679},{\"end\":73013,\"start\":72982},{\"end\":73304,\"start\":73271},{\"end\":73692,\"start\":73656},{\"end\":74049,\"start\":74016},{\"end\":74401,\"start\":74348},{\"end\":74814,\"start\":74760},{\"end\":75235,\"start\":75181},{\"end\":75599,\"start\":75544},{\"end\":75967,\"start\":75920},{\"end\":76283,\"start\":76250},{\"end\":76507,\"start\":76485},{\"end\":76772,\"start\":76728},{\"end\":77118,\"start\":77069},{\"end\":77482,\"start\":77445},{\"end\":77793,\"start\":77762},{\"end\":78070,\"start\":78037},{\"end\":78427,\"start\":78385}]"}}}, "year": 2023, "month": 12, "day": 17}