{"id": 398036, "updated": "2023-09-26 22:26:50.967", "metadata": {"title": "An algebraic characterization of injectivity in phase retrieval", "authors": "[{\"first\":\"Aldo\",\"last\":\"Conca\",\"middle\":[]},{\"first\":\"Dan\",\"last\":\"Edidin\",\"middle\":[]},{\"first\":\"Milena\",\"last\":\"Hering\",\"middle\":[]},{\"first\":\"Cynthia\",\"last\":\"Vinzant\",\"middle\":[]}]", "venue": "Applied and Computational Harmonic Analysis 38:2 (2015) pp. 346-356", "journal": null, "publication_date": {"year": 2013, "month": null, "day": null}, "abstract": "A complex frame is a collection of vectors that span $\\mathbb{C}^M$ and define measurements, called intensity measurements, on vectors in $\\mathbb{C}^M$. In purely mathematical terms, the problem of phase retrieval is to recover a complex vector from its intensity measurements, namely the modulus of its inner product with these frame vectors. We show that any vector is uniquely determined (up to a global phase factor) from $4M-4$ generic measurements. To prove this, we identify the set of frames defining non-injective measurements with the projection of a real variety and bound its dimension.", "fields_of_study": "[\"Mathematics\",\"Computer Science\"]", "external_ids": {"arxiv": "1312.0158", "mag": "3101774939", "acl": null, "pubmed": null, "pubmedcentral": null, "dblp": "journals/corr/ConcaEHV13", "doi": "10.1016/j.acha.2014.06.005"}}, "content": {"source": {"pdf_hash": "6f6d51d381b7ada07842a22bdd7441f6435f14de", "pdf_src": "Arxiv", "pdf_uri": "[\"https://arxiv.org/pdf/1312.0158v1.pdf\"]", "oa_url_match": false, "oa_info": {"license": "elsevier-specific: oa user license", "open_access_url": "https://doi.org/10.1016/j.acha.2014.06.005", "status": "BRONZE"}}, "grobid": {"id": "1403d150e5b0deebe8f38a411bd910b6ccb5a564", "type": "plain-text", "url": "s3://ai2-s2-pdf-extraction-prod/parse-results/s2orc_worker/6f6d51d381b7ada07842a22bdd7441f6435f14de.txt", "contents": "\nAN ALGEBRAIC CHARACTERIZATION OF INJECTIVITY IN PHASE RETRIEVAL\n30 Nov 2013\n\nAldo Conca \nDan Edidin \nANDMilena Hering \nCynthia Vinzant \nAN ALGEBRAIC CHARACTERIZATION OF INJECTIVITY IN PHASE RETRIEVAL\n30 Nov 2013\nA complex frame is a collection of vectors that span C M and define measurements, called intensity measurements, on vectors in C M . In purely mathematical terms, the problem of phase retrieval is to recover a complex vector from its intensity measurements, namely the modulus of its inner product with these frame vectors. We show that any vector is uniquely determined (up to a global phase factor) from 4M − 4 generic measurements.To prove this, we identify the set of frames defining non-injective measurements with the projection of a real variety and bound its dimension.Aldo Conca\n\nIntroduction\n\nIn signal processing, a signal x ∈ C M often cannot be measured directly. Instead, one can only measure the absolute values of its inner product with a fixed set of vectors Φ = {φ 1 , . . . , φ N } ∈ C M . Here we take C M with the inner product x, y = M m=1 x m y m . An N-element complex frame Φ is a collection of vectors φ 1 , . . . , φ N which span C M . A complex frame Φ = {φ n } N n=1 ⊂ C M defines N intensity measurements of a vector x ∈ C M , (1) | φ n , x | 2 = φ * n xx * φ n for n = 1, . . . , N, where we use v * to denote the conjugate transpose of a vector (or matrix) v.\n\nThe problem of phase retrieval is to reconstruct a vector x ∈ C M from its intensity measurements. Note that multiplying x by a scalar of unit modulus does not change the measurements (1), so we can only reconstruct x up to a global phase factor. For phase retrieval to be possible, any two vectors x and y with the same intensity measurements must differ by a scalar multiple of norm one, namely x = e iθ y. In other words, the non-linear map (2) A Φ : (C M /S 1 ) → (R ≥0 ) N given by x → | x, φ n | 2 n=1,...,N is injective, where (C M /S 1 ) is obtained by identifying x ∈ C M with e iθ x for every θ ∈ [0, 2π].\n\nOur main result states that 4M − 4 generic intensity measurements suffice to determine a vector in C M . This proves part (b) of the \"4M − 4 Conjecture\" made in [2]. Theorem 1.1. If N ≥ 4M − 4, then for a generic frame Φ the map A Φ is injective.\n\nBy generic we mean that Φ corresponds to a point in a non-empty Zariski open subset of C M ×N ∼ = (R M ×N ) 2 (see Section 2.2). In particular, this theorem implies that when N ≥ 4M − 4, there is an open dense set of frames Φ (in the Euclidean topology on C M ×N ) for which A Φ is injective. Part (a) of the conjecture in [2] says that this result is tight, i.e. that for N < 4M − 4 the map A Φ is never injective. This part is still open.\n\nThe history of this problem in the context of finite frames will be discussed in Section 2. There, we also define some necessary concepts from algebraic geometry, such as generic points and the dimension of algebraic sets. In Section 3 (specifically on page 5) we prove Theorem 1.1. A polynomial vanishing on the set of frames giving non-injective measurements is found and discussed in Section 4. Finally, in Section 5 we discuss what our algebraic approach can say about injectivity with fewer measurements. We end by rephrasing the open part of conjecture of [2] in the language of real algebraic geometry and operator theory.\n\n\nBackground\n\nHere we give a short review of the history of phase retrieval in the context of finite frames and review some needed terminology from algebraic geometry.\n\n2.1. The phase retrieval problem. Phase retrieval is an old problem in signal processing, and the literature on this subject is vast. However, in the context of finite frame theory it was first considered Balan, Casazza, and Edidin [1]. In [1,Theorem 3.3], the authors show that the map A Φ (2) is injective for a generic frame Φ when N ≥ 4M − 2. However, Bodmann and Hammen exhibit an explicit family of frames with 4M − 4 vectors for which injectivity holds, which suggests the possibility of a better bound [3]. On the other hand Heinosaari, Mazzarella and Wolf [10] used embedding theorems in homotopy theory to show that N ≥ (4 + o(1))M is necessary for the injectivity of A Φ . Recently, Bandeira, Cahill, Mixon, and Nelson [2] conjectured the following.\nThe 4M − 4 Conjecture [2]. Consider a frame Φ = {φ n } N n=1 ⊆ C M and the mapping A Φ : (C M /S 1 ) → (R ≥0 ) N taking a vector x to its intensity measurements (| x, φ n | 2 ) n=1,...,N . If M ≥ 2 then the following hold. (a) If N < 4M − 4, then A Φ is not injective. (b) If N ≥ 4M − 4, then A Φ is injective for generic Φ.\nIn [2], this conjecture was proved for M = 2, 3. Our Theorem 1.1 establishes part (b).\n\nInjectivity of the map A Φ implies that phase retrieval is possible, but the problem of effectively reconstructing a vector from its intensity measurements is quite difficult. There have been many papers devoted to determining efficient reconstruction algorithms. For references we direct the reader to [2]. Remark 2.1. In [1], Balan, Casazza, and Edidin characterized frames giving injective measurements in the real case. Precisely, [1, Theorem 2.8] says that a real frame Φ defines injective measurements (on R M /{±1}) if and only if Φ satisfies the finite complement property, which means that for every subset S ⊂ {1, . . . , N} either {φ n } n∈S or its complement {φ n } n∈S c spans R M . In particular, if N < 2M − 1 then the corresponding map A Φ cannot be injective, and if N ≥ 2M − 1 then for a generic frame Φ, A Φ is injective.\n\nIt would be very interesting to have an analogous characterization for complex frames. As a first step in this direction, in Section 4 we describe some polynomials that vanish on the set of frames Φ for which A Φ is non-injective.\n\nRemark 2.2. A frame Φ determines an M-dimensional subspace of C N by taking the row span of the M × N matrix whose columns are the vectors φ n , 1 ≤ n ≤ N. It was observed in [1, Proposition 2.1], that if Φ and Φ ′ determine the same subspace in C N , then A Φ is injective if and only if A Φ ′ is injective. In other words, injectivity of A Φ only depends on subspace determined by Φ. This subspace corresponds to a point in the Grassmannian G(M, N) of M-dimensional subspaces of C N . Thus there is a subset of G(M, N) parameterizing frames for which A Φ is injective. This approach was applied in [1].\n\n\n2.2.\n\nTerminology from algebraic geometry. Let F be a field (specifically F = R or F = C). A subset of F d defined by the vanishing of finitely many polynomials in F[x 1 , . . . , x d ] is called an affine variety. If these polynomials are homogeneous, then their vanishing defines a subset of projective space P(F d ), which is called a projective variety.\n\nThe Zariski topology on F d (or P(F d )) is defined by declaring affine (resp. projective) varieties to be closed subsets. Note that a Zariski closed set is also closed in the Euclidean topology. In our main proof, we also rely heavily on the notion of the dimension of a variety defined over C. For an introduction and many equivalent definitions of the dimension of a variety, see [9, §11] or [4,Chapter 9]. In particular, the dimension of an irreducible variety (meaning that it is not the union of two proper subvarieties) X equals the dimension of its tangent space at a generic point of X.\n\nWe will also make use of the interplay between real and complex varieties. Given a complex variety X defined by equations with real coefficients we denote its set of real points by X R .\n\n\nProof of Theorem 1.1\n\nWe prove Theorem 1.1 by showing that the subset of C M ×N ∼ = (R M ×N ) 2 corresponding to frames Φ for which A Φ is not injective is contained in a proper real algebraic subset. The complement of this algebraic set is an open dense set corresponding to frames Φ for which A Φ is injective. A key ingredient of this proof is a reformulation, due to Bandeira, Cahill, Mixon, and Nelson [2], of the injectivity of the map A Φ : (C M /S 1 ) → R N defined in (2). Proposition 3.1 (Lemma 9 [2]). The map A Φ is not injective if and only if there is a nonzero Hermitian matrix Q ∈ C M ×M for which (3) rank(Q) ≤ 2 and φ * n Qφ n = 0 for each 1 ≤ n ≤ N.\n\nWe use this condition to translate injectivity of the map A Φ into a question in algebraic geometry. Let C M ×M sym denote the set of symmetric complex M × M matrices, and C M ×M skew the set of skew-symmetric complex M × M matrices. (4) rank(X + iY ) ≤ 2 and u T n Xu n + v T n Xv n − 2u T n Y v n = 0 for all 1 ≤ n ≤ N, where u n and v n are the nth columns of U and V , respectively.\nDefinition 3.2. Let B M,N denote the subset of P(C M ×N × C M ×N ) × P(C M ×M sym × C M ×M skew ) consisting of quadruples of matrices ([U, V ], [X, Y ]) for which\nThe set B M,N is defined by the vanishing of polynomials in the entries of U, V , X, and Y , namely the 3 × 3 minors of X + iY and the polynomials u T n Xu n + v T n Xv n − 2u T n Y v n = 0. Note that these polynomials are homogeneous in the entries of U, V and X, Y . In other words, they are invariant under scaling U and V by a non-zero scalar, and also X and Y by a non-zero scalar. Thus B M,N is a well-defined subvariety of the given product of projective spaces. Let π 1 be the projection onto the first coordinate,\nπ 1 : P C M ×N × C M ×N × P C M ×M sym × C M ×M skew → P C M ×N × C M ×N .\nRecall that we use X R to denote the set of real points of a complex variety X.\nProposition 3.3. Let Φ = {φ n } N n=1 ⊂ C M be a complex frame.\nWrite φ n = u n + iv n and let U (resp. V ) be the real matrix with columns u n (resp. v n ). Then the map A Φ is injective if and only if [U, V ] does not belong to the projection π 1 ((B M,N ) R ).\n\nProof. Consider the incidence correspondence I of frames and Hermitian matrices given by\nI = (Φ, Q) ∈ C M ×N × C M ×M\nHerm : Q = 0, rank(Q) ≤ 2, and φ * n Qφ n = 0 for n = 1, . . . , N . Note that the conditions for I involve complex conjugation, an inherently real operation. Thus we cannot view I as a complex algebraic variety. However, complex conjugation is a polynomial on the real parts. So we decompose Φ and Q into their real and imaginary parts, i.e., Φ = U + iV , φ n = u n + iv n with u n , v n ∈ R M and Q = X + iY , with X symmetric and Y skew symmetric. Then I is linearly isomorphic over R to the subset J ,\nJ = {(U, V, X, Y ) : X + iY = 0, rank(X + iY ) ≤ 2, and u T n Xu n + v T n Xv n − 2u T n Y v n = 0}, of the real vector space R M ×N × R M ×N × R M ×M sym × R M ×M skew . By Proposition 3.1, A Φ is injective if and only if (U, V ) is not contained in the projection of J onto the first two coordinates. Since (B M,N ) R is the projectivization of J , (U, V ) is not contained in this projection if and only if [U, V ] / ∈ π 1 ((B M,N ) R ).\nTo bound the dimension of the projection π 1 (B M,N ) we find the dimension of B M,N itself. \nrank(Q) ≤ 2 and (u n − iv n ) T Q(u n + iv n ) = 0 for all 1 ≤ n ≤ N,\nwhere u n and v n are the nth columns of U and V , respectively. This is a well defined subvariety of the product of projective spaces because the defining equations are homogeneous in each set of variables.\n\nNote that B M,N and B ′ M,N are linearly isomorphic. We can identify\nC M ×M sym × C M ×M skew with C M ×M by the map (X, Y ) → X + iY = Q. Indeed any complex matrix Q can be uniquely written as Q = X + iY where X = (Q + Q T )/2 is a complex symmetric matrix and Y = (Q − Q T )/(2i) is a complex skew symmetric matrix.\nHence it suffices to prove that B ′ M,N has the desired dimension. We define π 1 and π 2 to be projections onto the first and second coordinates, namely\nπ 1 [U, V ], [Q] = [U, V ] and π 2 [U, V ], [Q] = [Q].\nWe will determine the dimension of B ′ M,N by finding the dimension of its second projection π 2 (B ′ M,N ) and the dimension of the preimages π −1 2 (Q) for Q ∈ C M ×M . The image of B ′ M,N under the projection π 2 is precisely the set of rank ≤ 2 matrices in P(C M ×M ). To see that any rank ≤ 2 matrix Q belongs to this image, take any non-zero vector Since the dimension of the preimages is constant, we conclude that\ndim(B ′ M,N ) = dim(π 2 (B ′ M,N )) + dim(π −1 2 (Q)) = (4M − 5) + (2MN − N − 1)\n. Above we used that any non-zero matrix Q imposes a nontrivial condition on each pair (u, v) of columns of U and V . We now verify this statement. Proof. Computing explicitly the expression of q(u, v), one has:\nq(u, v) = 1≤m≤M q mm (u 2 m +v 2 m )+ 1≤ℓ<m≤M (q ℓm +q mℓ )(u ℓ u m +v ℓ v m )+i(q ℓm −q mℓ )(u ℓ v m −v ℓ u m ).\nIf the polynomial q(u, v) is identically zero, then so are its coefficients, meaning\nq mm = 0 for all 1 ≤ m ≤ M, q ℓm + q mℓ = 0 for all 1 ≤ ℓ < m ≤ M, and q ℓm − q mℓ = 0 for all 1 ≤ ℓ < m ≤ M.\nIt follows that Q is the zero-matrix.\n\nBy bounding the dimension of B M,N , we can bound the dimension of its projection, which contains the frames Φ for which A Φ is not injective, and thus prove our main theorem. When N is 4M − 4 or higher, the dimension of this projection is strictly less than 2MN − 1, which is the dimension of P((C M ×N ) 2 ), the target of the projection π 1 . Thus the image of this projection is contained in a hypersurface defined by the vanishing of some polynomial.\n\nThis still holds when we restrict to real matrices U and V . In the real vector space (R M ×N ) 2 , there is some nonzero polynomial that vanishes on all of the pairs (U, V ) for which A U +iV is not injective. The complement of the zero-set of this polynomial is a Zariski open subset of (R M ×N ) 2 and for any pair (U, V ) in this open set, A U +iV is injective.\n\n\nA hypersurface containing bad frames\n\nWhen N ≥ 4M − 4, the proof of our main theorem guarantees a polynomial that is zero on the set of frames Φ for which A Φ is non-injective. Here we discuss how to obtain such a polynomial and compute its degree.\n\nSpecifically, here we describe a polynomial in the variables u mn , v mn for 1 ≤ m ≤ M and 1 ≤ n ≤ N vanishing on the projection π 1 (B M,N ). The projection from a product of projective spaces onto one of its coordinates, P d × P e → P d , is a closed map in the Zariski topology [11, Theorem I.5.3]. Thus π 1 (B M,N ) is indeed a subvariety of P((C M ×N ) 2 ), i.e. a closed set in the Zariski topology. The equations defining this projection can be in principle computed using symbolic computations involving eliminations, saturations and resultants. See for instance Chapter 3 in [5] and the more advanced Chapter 12 and 13 in [8]. In particular we use resultants (see [5, Ch. 3, Thm. 2.3]) which can be expressed by combining various determinants. The problem of expressing the resultant in an efficient way, for example as a single determinant, is still a central topic in elimination theory, see for instance [6]. This is a non-zero polynomial in the variables u mn and v mn that vanishes on π 1 (B M,N ). By [5, Ch. 3, Theorem 3.1], such a resultant has total degree 2N3 E and it has degree 2 · 3 E in the entries of u n and v n for each n = 1, . . . , N.\n\nIn practice, for small values of M the collection of polynomials G 1 , . . . , G E can be taken to be a subset of properly chosen 3 × 3 minors (and not linear combinations of them). However for higher M one needs to take linear combinations.\n\nWhen N > 4M −4, for every subset S ⊂ {1, . . . , N} of size 4M −4, we can apply the above construction to the corresponding columns of U and V . The result is a nonzero polynomial vanishing on the set of bad frames and involving only the variables u mn , v mn where n ∈ S.  2, N = 4). Since the all matrices in C 2×2 have rank ≤ 2, the variety B 2,4 is defined by the equations g n = 0 where \ng n = (u 2 1n + v 2 1n )x 11 + 2(u 1n u 2n + v 1n v 2n )x 12 + (u 2 2n + v 2 2n )x 22 + 2(u 2n v 1n − u 1n v∂g n ∂z k n,k =     u 2 11 + v 2 11 2(u 11 u 21 + v 11 v 21 ) u 2 21 + v 2 21 2(u 21 v 11 − u 11 v 21 ) u 2 12 + v 2 12 2(u 12 u 22 + v 12 v 22 ) u 2 22 + v 2 22 2(u 22 v 12 − u 12 v 22 ) u 2 13 + v 2 13 2(u 13 u 23 + v 13 v 23 ) u 2 23 + v 2 23 2(u 23 v 13 − u 13 v 23 ) u 2 14 + v 2 14 2(u 14 u 24 + v 14 v 24 ) u 2 24 + v 2 24 2(u 24 v 14 − u 14 v 24 )    \nis zero. This is the hypersurface defining π 1 (B 2,4 ), which has total degree 8 and degree 2 in the entries of u n and v n . If this determinant is non-zero, then the map A U +iV is injective. The solution to the equations g 1 = . . . g 8 = 0 is then given by the 8 × 8 sub-determinants\nz k = D k = (−1) k det(J {k} )\nwhere J {k} is obtained by erasing the k-th column of J. Note that D k has total degree 2 · 8 and degree 2 the entries of u n and v n for each n. This solution gives a 3 × 3 matrix X + iY satisfying the desired equations g n = 0. In order for the pair ([U, V ], [X, Y ]) to belong to B 3,8 , this matrix X + iY must have rank ≤ 2, meaning that its 3 × 3 determinant,\ndet   D 1 D 2 + iD 7 D 3 + iD 8 D 2 − iD 7 D 4 D 5 + iD 9 D 3 − iD 8 D 5 − iD 9 D 6   ,\nmust vanish. The vanishing of this determinant defines π 1 (B 3,8 ). As promised, it has total degree 2 · 8 · 3 = 48 and degree 2 · 3 = 6 in the entries of u n and v n for each 1 ≤ n ≤ 8.\n\nRemark 4.4. The set of frames Φ such that A Φ is not injective is π 1 ((B M,N ) R ). Since projective space is compact, π 1 is a closed map with respect to the Euclidean topology. In particular, the locus of frames Φ for which A Φ is non-injective is closed in the Euclidean topology on P((R M ×N ) 2 ). Note however, that the image of the set of real points of a variety need not be Zariski closed as the example below shows. This means that there may be real points belonging to the projection π 1 (B M,N ) which are not the projection of real points of B M,N . That is, in principle there may be a real point [U, V ] in π 1 (B M,N ) whose corresponding frame Φ = U + iV is nonetheless injective.\n\nExample 4.5. Let X ⊂ C 2 be the parabola defined by x 2 = y and let π : X → C 1 be the projection onto the second factor. Since every real number has a complex square root, every point in R is the image of a point of X. However, if a < 0 then a is not image of a real point of X. In particular the image of X R is the closed subset {a ≥ 0} ⊂ R. Any polynomial vanishing on π(X R ) vanishes on all of R, so the Zariski closure of π(X R ) is all of R.\n\n\nThe case of fewer measurements\n\nHere we use our algebraic reformulation to discuss some cases of part (a) of the 4M − 4 Conjecture. We show that when N ≤ 4M − 5 the projection π 1 (B M,N ) fills the entire space and show that the projection of the real points (B M,N ) R does this in the case M = 2 k + 1.\nProposition 5.1. For N ≤ 4M − 5, the projection π 1 (B M,N ) is all of P((C M ×N ) 2 ).\nProof. Fix U and V in C M ×N . Each pair of columns u n and v n define (at most) one linear condition on an M × M matrix Q, namely that (u n − iv n ) T Q(u n + iv n ) = 0. Thus in total U and V define (at most) N linear conditions. The subvariety of P(C M ×M ) of matrices satisfying these linear conditions is a linear subspace\nL Φ = {Q ∈ P(C M ×M ) : (u n − iv n ) T Q(u n + iv n ) = 0 for each 1 ≤ n ≤ N} of dimension at least M 2 − 1 − N.\nOn the other hand, the projective variety H 2 ⊂ P(C M ×M ) of matrices of rank ≤ 2 has dimension 4M − 5 [9,Prop. 12.2]. When N ≤ 4M − 5,\ndim L Φ + dim H 2 ≥ M 2 − 1.\nThus by [9,Prop. 11.4], there is a point in the intersection L Φ ∩ H 2 . This point corresponds to a matrix Q of rank ≤ 2 that satisfies the linear equations given by U and V . We write Q = X + iY where X is a complex symmetric matrix and Y is complex skew symmetric. Furthermore, when N = 4M − 5, for generic matrices (U, V ) ∈ (R M ×N ) 2 , there should be finitely many matrices Q ∈ C M ×M in the intersection L Φ ∩ H 2 described above. Counting multiplicity, this number is given by the degree of H 2 , namely\n(5) d M,2 = M −3 i=0 M +i 2 2+i 2\n(see for example [9,Ex. 19.10]). Part (a) of the 4M − 4 Conjecture is equivalent to there always being a Hermitian matrix among these d M,2 complex matrices. Both of the sets L Φ and H 2 are invariant under the involution Q → Q * , and so is the finite set of matrices in their intersection. In particular, when the degree d M,2 is odd, this set must contain a fixed point, i.e. a Hermitian matrix.  . Here the variety of rank ≤ 2 matrices is defined by the 3 × 3 determinant, meaning d 3,2 = 3. Thus for generic U, V ∈ R 3×7 , the intersection L Φ ∩ H 2 contains three complex matrices. Since this intersection is invariant, at least one of these must be fixed under the involution Q → Q * . So in this case, we also recover the first part of the 4M − 4 conjecture from Proposition 5.1 and Proposition 3.3.\n\nMore generally, the projection map\nP((C M ×N ) 2 ) × P C M ×M sym × C M ×M skew → P((C M ×N ) 2 )\nmaps real points to real points, so frames Φ for which A Φ is not injective, namely π 1 ((B M,N )  Proof. We will show that if N ≤ 4M − 5 then for every pair\n[U, V ] ∈ P(R M ×N × R M ×N ) there is some point [X, Y ] ∈ P(R M ×M sym × R M ×M skew ) so that rank(X + iY ) ≤ 2 and (u n − iv n ) T (X + iY )(u n + iv n ) = 0 for all 1 ≤ n ≤ N.\nThis would imply that the map A Φ is not injective.\n\nFix any [U, V ] in P(R M ×N × R M ×N ). Following the notation from the proof of Proposition 5.1, let H 2 denote the variety of matrices [X, Y ] ∈ P(C M ×M sym × C M ×M skew ) for which rank(X + iY ) ≤ 2. Also, let L Φ denote the projective linear space of pairs [X, Y ] satisfying the equations (u n − iv n ) T (X + iY )(u n + iv n ) = 0.\n\nHere we use that M = 2 k + 1. By Lemma 5.5 below, the subvariety of matrices of rank ≤ 2 has odd degree in P(C M ×M ). Hence its intersection with a linear subspace also has odd degree. We now use the fact that any projective variety defined over R and having odd degree has real point. Thus the intersection L Φ ∩ H 2 contains a real point. Proof. We use the classical formula for the degree (5) of the variety of M × M matrices of rank at most two. Using Legendre's formula for the highest power of a prime dividing a factorial one can compute the highest power of any prime dividing a binomial coefficient. Specifically, the highest power of p dividing n+r r is s p (n) + s p (r) − s p (n + r) where s p (n) is the sum of the digits in the base p expansion of n. Using this formula we see that the highest power of 2 dividing d M,2 is Hence the expression in (7) is zero and d M,2 is odd.\n\nChecking these formulas more closely reveals that d M,2 is odd if and only if M = 2 k + 1. Therefore a different approach would be necessary to prove the conjecture for other M.\n\nRemark 5.6. Proposition 5.4 is similar to, but does not seem to follow from, previous results [7,10]. Heinosaari, Mazzarella and Wolf use embedding results from topology to show that when N ≤ 4M − 2s 2 (M − 1) − 4, the map A Φ is never injective [10]. In particular, if M = 2 k +1 then s 2 (M −1) = 1, and this bound gives N ≤ 4M −6, rather than N ≤ 4M −5.\n\nWe end by rephrasing part (a) of the 4M − 4 Conjecture. The first open case is M = 4. \n\n\nThe complement of a variety is a Zariski open set. A non-empty Zariski open set is open and dense in the Euclidean topology. We say that a generic point of F d (or P(F d )) has a certain property if there is a non-empty Zariski open set of points having this property. The space of complex frames F (M, N) can be identified with M × N matrices of full rank, so it is a Zariski-open set in C M ×N . For the statement of Theorem 1.1 we identify C M ×N with (R M ×N ) 2 and view F (M, N) as an open subset of (R M ×N ) 2 . Theorem 1.1 then states that for N ≥ 4M − 4, there is a Zariski open subset U of F (M,N)such that for every frame Φ corresponding to a point of U, the map A Φ is injective.\n\nTheorem 3. 4 .\n4The projective complex variety B M,N has dimension 2MN − N + 4M − 6. Proof. Let B ′ M,N be the subvariety of P(C M ×N × C M ×N ) × P(C M ×M ) consisting of triples of matrices ([U, V ], [Q]) satisfying\n\n\n(u, v) ∈ C M × C M satisfying the equation (u − iv) T Q(u + iv) T = 0. (Such a vector exists because the zero set of this polynomial is a hypersurface in C M × C M .) Now let U and V be the matrices with N repeated columns u n = u and v n = v. Then ([U, V ], [Q]) belongs to B ′ M,N and [Q] is its image under π 2 . The set of matrices of rank ≤ 2 in C M ×M is an irreducible (affine) variety of dimension 4M − 4 [9, Prop. 12.2]. So its projectivization in P(C M ×M ) has dimension 4M − 5, meaningdim(π 2 (B ′ M,N )) = 4M − 5. Now fix Q ∈ π 2 (B ′ M,N ). We will show that the preimage, π −1 2 (Q) in P(C M ×N × C M ×N ) has dimension 2MN − N − 1.By Lemma 3.5 below, Q defines a nonzero polynomial equation (u n − iv n ) T Q(u n + iv n ) = 0 on the n-th columns of U and V . For each pair of columns (u n , v n ), this polynomial defines a hypersurface of dimension 2M − 1 in (C M ) 2 . Thus the preimage of Q in B ′ M,N is a product of N copies of this hypersurface in ((C M ) 2 ) N ∼ = (C M ×N ) 2 , one for each pair of columns (u n , v n ) for 1 ≤ n ≤ N. Therefore after projectivization, this preimage π −1 2 (Q) has dimension N(2M − 1) − 1 = 2MN − N − 1. We put these together using the following theorem about dimensions of projections and their fibers [9, Cor. 11.13]. It states that the dimension of the projective variety B ′ M,N is the sum of the dimension of the image of the projection π 2 (B ′ M,N ) and the minimum dimension of a preimage π −1 2 (Q).\n\nLemma 3. 5 .\n5For a nonzero matrix Q = (q ℓm ) ∈ C M ×M , the polynomial q(u, v) = (u − iv) T Q(u + iv) ∈ C[u 1 , . . . , u M , v 1 , . . . , v M ], where u = (u 1 , . . . , u M ) T and v = (v 1 , . . . , v M ) T , is not identically zero.\n\n\nProof of Theorem 1.1. By Proposition 3.3, a pair of real M × N matrices (U, V ) for which A U +iV is not injective gives a point [U, V ] in π 1 ((B M,N ) R ) ⊂ (π 1 (B M,N )) R . The dimension of the projection is at most the dimension of the original variety [9, Cor. 11.13]. Thus the dimension of π 1 (B M,N ) can be bounded using Theorem 3.4: dim π 1 (B M,N ) ≤ dim(B M,N ) = 2MN + 4M − 6 − N.\n\nProposition 4 . 1 .\n41There is a nonzero polynomial in R[u 11 , . . . , u M (4M −4) , v 11 , . . . , v M (4M −4) ] vanishing on the projection π 1 (B M,4M −4 ) which has total degree 2 · (4M − 4) · 3 (M −2) 2 and has degree 2 · 3 (M −2) 2 in the set of column variables {u mn , v mn , m = 1, . . . , M} for each n. Proof. We compute this polynomial using resultants. Let X and Y be M × M symmetric and skew-symmetric matrices of variables X = (x ℓm ) and Y = (y ℓm ), and let Z denote this collection of M 2 variables: Z = {x 11 , x 12 , . . . , x 1M , x 22 , . . . , x M M , y 12 , y 13 , . . . , y 1M , y 23 , . . . , y M −1M }. Now set E = (M − 2) 2 . The 3 × 3 minors of X + iY are cubic polynomials in the variables Z. Consider E general linear combinations (with complex coefficients) of the 3 × 3 minors, say G 1 , . . . , G E . To this set, add the N = 4M − 4 equations g n = u T n Xu n + v T n Xv n − 2u T n Y v n = 0 with n = 1, . . . , N where u n and v n are the vector of variables (u mn ) m and (v mn ) m . In total we have M 2 polynomials in M 2 + 2MN variables. To eliminate the variables Z from our system of M 2 equations we take the resultant with respect to these variables Res(G 1 , . . . , G E , g 1 , . . . , g N ).\n\n\n2n )y 12 for n = 1, . . . , 4. These equations are linear in the variables z k ∈ Z = {x 11 , x 12 , x 22 , y 12 }. Thus for fixed u mn , v mn , there is a nonzero solution to these equations if and only if the determinant of the Jacobian matrix\n\nExample 4. 3\n3(M = 3, N = 8). For fixed u mn , v mn the polynomials g n give 8 linear equations in the 9 variables Z = {z k } = {x 11 , x 12 , x 13 , x 22 , x 23 , x 33 , y 12 , y 13 , y 23 }. We can solve for this solution symbolically. To do this consider Jacobian matrix: 1 ≤ n ≤ 8, 1 ≤ k ≤ 9.\n\n\nThen ([U, V ], [X, Y ]) belongs to B M,N and [U, V ] is its image under the projection π 1 .\n\n\nExample 5.2 (M = 2, N = 3). As shown in[2], here part (a) of the 4M − 4 Conjecture holds, meaning that the intersection L Φ ∩ H 2 contains a Hermitian matrix. Every matrix has rank ≤ 2, H 2 is all of C 2×2 , and d 2,2 = 1. The projective linear space L Φ is nonempty and invariant under the involution Q → Q * . So it contains a Hermitian matrix. In this case, we recover the first part of the 4M − 4 conjecture from Proposition 5.1 and Proposition 3.3.\n\n\nR ), are contained in the real points of the projection (π 1 (B M,N )) R . If we could show the reverse inclusion, then Proposition 5.1 and Proposition 3.3 would imply the part (a) of the 4M − 4 conjecture. Unfortunately, as noted in Example 4.5 the image of the set of real points of variety need not equal the set of real points of the image. Despite this subtlety, there is one case where we can use algebro-geometric methods to prove part (a) of the 4M − 4 Conjecture. Proposition 5.4. If M = 2 k + 1 and N ≤ 4M − 5, then A Φ is not injective.\n\nLemma 5 . 5 .\n55For M = 2 k + 1, the variety of M × M matrices of rank ≤ 2 has odd degree.\n\n\nNow if M = 2 k + 1 and 0 ≤ n ≤ M − 2 then s 2 (M − 1 + n) = s 2 (n) + 1, so most of the terms in the two summations of (6) cancel leaving just four terms(7) (s 2 (M) − s 2 (M − 2)) − (s 2 (M − 1) − s 2 (M − 3)) . When M = 2 k + 1, s 2 (M) = 2, s 2 (M − 1) = 1, s 2 (M − 2) = k − 1 and s 2 (M − 3) = k − 2.\n\nConjecture 5. 7 .\n7Let φ 1 , . . . , φ 4M −5 ∈ C M and consider the linear spaceL Φ of C M ×M Herm , L Φ = {Q : φ * n Qφ n = 0 for n = 1, . . . , 4M − 5} = span{φ 1 φ * 1 , . . . , φ 4M −5 φ * 4M −5 } ⊥ . The 4M − 4 Conjecture states that L Φ ⊂ C M ×MHerm always contains a matrix of rank ≤ 2. In other words, if we take d = (M − 2) 2 + 1 Hermitian matrices A 1 , . . . , A d spanning L Φ , there is some linear combination x 1 A 1 + . . . + x d A d with rank two.\nAcknowledgements. We are very grateful to the conference held at the AIM conference \"Frame theory intersects geometry\" held in Summer 2013 and many of the people attending. Among others, we would especially like to thank Bernhard Bodmann, Jameson Cahill, Matthew Fickus, Dustin Mixon, and Vlad Voroninski for helpful discussions. Aldo Conca would like to thank Carlos D'Andrea and Laurent Busé for useful discussions concerning elimination and discriminants. Milena Hering was supported by NSF grant DMS-1001859. Cynthia Vinzant was supported by an NSF postdoc DMS-1204447.\nOn signal reconstruction without phase. Radu Balan, Pete Casazza, Dan Edidin, Appl. Comput. Harmon. Anal. 203Radu Balan, Pete Casazza, and Dan Edidin. On signal reconstruction without phase. Appl. Comput. Harmon. Anal., 20(3):345-356, 2006.\n\nA Bandeira, J Cahill, D Mixon, A Nelson, arXiv:1302.4618Saving phase: Injectivity and stability for phase retrieval. A. Bandeira, J. Cahill, D. Mixon, and A. Nelson. Saving phase: Injectivity and stability for phase retrieval. arXiv:1302.4618, 2013.\n\nB Bodmann, N Hammen, arXiv:1302.5487Stable phase retrieval with low-redundancy frames. B. Bodmann and N. Hammen. Stable phase retrieval with low-redundancy frames. arXiv:1302.5487, 2013.\n\nAn introduction to computational algebraic geometry and commutative algebra. David Cox, John Little, Donal O&apos; Shea, SpringerNew YorkUndergraduate Texts in MathematicsDavid Cox, John Little, and Donal O'Shea. Ideals, varieties, and algorithms. Undergraduate Texts in Mathematics. Springer, New York, third edition, 2007. An introduction to computational algebraic geometry and commutative algebra.\n\nUsing algebraic geometry. David A Cox, John Little, Donal O&apos; Shea, Graduate Texts in Mathematics. 185Springersecond editionDavid A. Cox, John Little, and Donal O'Shea. Using algebraic geometry, volume 185 of Graduate Texts in Mathematics. Springer, New York, second edition, 2005.\n\nExplicit formulas for the multivariate resultant. D&apos;andrea Carlos, Alicia Dickenstein, Effective methods in algebraic geometry. Bath164Carlos D'Andrea and Alicia Dickenstein. Explicit formulas for the multivariate resultant. J. Pure Appl. Algebra, 164(1-2):59-86, 2001. Effective methods in algebraic geometry (Bath, 2000).\n\nSome new immersion results for complex projective space. Donald M Davis, Proc. Edinb. Math. Soc. 512Donald M. Davis. Some new immersion results for complex projective space. Proc. Edinb. Math. Soc. (2), 51(1):45-56, 2008.\n\nI M Gel ′ Fand, M M Kapranov, A V Zelevinsky, Discriminants, resultants, and multidimensional determinants. Mathematics: Theory & Applications. Boston, MABirkhäuser Boston IncI. M. Gel ′ fand, M. M. Kapranov, and A. V. Zelevinsky. Discriminants, resultants, and multidimensional determinants. Mathematics: Theory & Applications. Birkhäuser Boston Inc., Boston, MA, 1994.\n\nAlgebraic geometry. Joe Harris, Graduate Texts in Mathematics. 133Springer-VerlagA first course, Corrected reprint of the 1992 originalJoe Harris. Algebraic geometry, volume 133 of Graduate Texts in Mathematics. Springer-Verlag, New York, 1992. A first course, Corrected reprint of the 1992 original.\n\nQuantum tomography under prior information. Teiko Heinosaari, Luca Mazzarella, Michael M Wolf, Comm. Math. Phys. 3182Teiko Heinosaari, Luca Mazzarella, and Michael M. Wolf. Quantum tomography under prior information. Comm. Math. Phys., 318(2):355-374, 2013.\n\nVarieties in projective space. Igor R Shafarevich, Springer-Verlag1BerlinBasic algebraic geometry. Russian edition and with notes by Miles ReidIgor R. Shafarevich. Basic algebraic geometry. 1. Springer-Verlag, Berlin, second edition, 1994. Varieties in projective space, Translated from the 1988 Russian edition and with notes by Miles Reid.\n", "annotations": {"author": "[{\"end\":89,\"start\":78},{\"end\":101,\"start\":90},{\"end\":119,\"start\":102},{\"end\":136,\"start\":120}]", "publisher": null, "author_last_name": "[{\"end\":88,\"start\":83},{\"end\":100,\"start\":94},{\"end\":118,\"start\":112},{\"end\":135,\"start\":128}]", "author_first_name": "[{\"end\":82,\"start\":78},{\"end\":93,\"start\":90},{\"end\":111,\"start\":105},{\"end\":127,\"start\":120}]", "author_affiliation": null, "title": "[{\"end\":64,\"start\":1},{\"end\":200,\"start\":137}]", "venue": null, "abstract": "[{\"end\":800,\"start\":213}]", "bib_ref": "[{\"attributes\":{\"ref_id\":\"b1\"},\"end\":1853,\"start\":1850},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":2187,\"start\":2184},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":2597,\"start\":2594},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":3278,\"start\":3275},{\"attributes\":{\"ref_id\":\"b0\"},\"end\":3747,\"start\":3744},{\"attributes\":{\"ref_id\":\"b0\"},\"end\":3755,\"start\":3752},{\"end\":3767,\"start\":3755},{\"attributes\":{\"ref_id\":\"b2\"},\"end\":4025,\"start\":4022},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":4081,\"start\":4077},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":4245,\"start\":4242},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":4604,\"start\":4601},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":4992,\"start\":4989},{\"attributes\":{\"ref_id\":\"b0\"},\"end\":5012,\"start\":5009},{\"attributes\":{\"ref_id\":\"b0\"},\"end\":6363,\"start\":6360},{\"end\":7117,\"start\":7109},{\"attributes\":{\"ref_id\":\"b3\"},\"end\":7124,\"start\":7121},{\"end\":7134,\"start\":7124},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":7922,\"start\":7919},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":8022,\"start\":8019},{\"attributes\":{\"ref_id\":\"b2\"},\"end\":8129,\"start\":8126},{\"attributes\":{\"ref_id\":\"b3\"},\"end\":8419,\"start\":8416},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":14366,\"start\":14363},{\"attributes\":{\"ref_id\":\"b7\"},\"end\":14413,\"start\":14410},{\"end\":14455,\"start\":14452},{\"attributes\":{\"ref_id\":\"b5\"},\"end\":14698,\"start\":14695},{\"attributes\":{\"ref_id\":\"b8\"},\"end\":19120,\"start\":19117},{\"end\":19131,\"start\":19120},{\"attributes\":{\"ref_id\":\"b8\"},\"end\":19190,\"start\":19187},{\"end\":19201,\"start\":19190},{\"attributes\":{\"ref_id\":\"b8\"},\"end\":19747,\"start\":19744},{\"end\":19757,\"start\":19747},{\"attributes\":{\"ref_id\":\"b6\"},\"end\":22536,\"start\":22533},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":22539,\"start\":22536},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":22689,\"start\":22685},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":27830,\"start\":27827}]", "figure": "[{\"attributes\":{\"id\":\"fig_0\"},\"end\":23578,\"start\":22884},{\"attributes\":{\"id\":\"fig_1\"},\"end\":23797,\"start\":23579},{\"attributes\":{\"id\":\"fig_2\"},\"end\":25265,\"start\":23798},{\"attributes\":{\"id\":\"fig_3\"},\"end\":25506,\"start\":25266},{\"attributes\":{\"id\":\"fig_4\"},\"end\":25905,\"start\":25507},{\"attributes\":{\"id\":\"fig_5\"},\"end\":27145,\"start\":25906},{\"attributes\":{\"id\":\"fig_7\"},\"end\":27392,\"start\":27146},{\"attributes\":{\"id\":\"fig_8\"},\"end\":27690,\"start\":27393},{\"attributes\":{\"id\":\"fig_9\"},\"end\":27785,\"start\":27691},{\"attributes\":{\"id\":\"fig_10\"},\"end\":28241,\"start\":27786},{\"attributes\":{\"id\":\"fig_12\"},\"end\":28791,\"start\":28242},{\"attributes\":{\"id\":\"fig_13\"},\"end\":28883,\"start\":28792},{\"attributes\":{\"id\":\"fig_14\"},\"end\":29191,\"start\":28884},{\"attributes\":{\"id\":\"fig_15\"},\"end\":29657,\"start\":29192}]", "paragraph": "[{\"end\":1404,\"start\":816},{\"end\":2021,\"start\":1406},{\"end\":2269,\"start\":2023},{\"end\":2711,\"start\":2271},{\"end\":3342,\"start\":2713},{\"end\":3510,\"start\":3357},{\"end\":4272,\"start\":3512},{\"end\":4684,\"start\":4598},{\"end\":5526,\"start\":4686},{\"end\":5758,\"start\":5528},{\"end\":6364,\"start\":5760},{\"end\":6724,\"start\":6373},{\"end\":7321,\"start\":6726},{\"end\":7509,\"start\":7323},{\"end\":8180,\"start\":7534},{\"end\":8568,\"start\":8182},{\"end\":9255,\"start\":8733},{\"end\":9410,\"start\":9331},{\"end\":9674,\"start\":9475},{\"end\":9764,\"start\":9676},{\"end\":10299,\"start\":9794},{\"end\":10834,\"start\":10741},{\"end\":11112,\"start\":10905},{\"end\":11182,\"start\":11114},{\"end\":11584,\"start\":11432},{\"end\":12062,\"start\":11640},{\"end\":12355,\"start\":12144},{\"end\":12554,\"start\":12470},{\"end\":12702,\"start\":12665},{\"end\":13159,\"start\":12704},{\"end\":13526,\"start\":13161},{\"end\":13777,\"start\":13567},{\"end\":14942,\"start\":13779},{\"end\":15185,\"start\":14944},{\"end\":15579,\"start\":15187},{\"end\":16344,\"start\":16056},{\"end\":16742,\"start\":16376},{\"end\":17022,\"start\":16835},{\"end\":17722,\"start\":17024},{\"end\":18173,\"start\":17724},{\"end\":18481,\"start\":18208},{\"end\":18898,\"start\":18570},{\"end\":19149,\"start\":19013},{\"end\":19692,\"start\":19179},{\"end\":20534,\"start\":19727},{\"end\":20570,\"start\":20536},{\"end\":20791,\"start\":20634},{\"end\":21024,\"start\":20973},{\"end\":21365,\"start\":21026},{\"end\":22258,\"start\":21367},{\"end\":22437,\"start\":22260},{\"end\":22795,\"start\":22439},{\"end\":22883,\"start\":22797}]", "formula": "[{\"attributes\":{\"id\":\"formula_0\"},\"end\":4597,\"start\":4273},{\"attributes\":{\"id\":\"formula_1\"},\"end\":8732,\"start\":8569},{\"attributes\":{\"id\":\"formula_2\"},\"end\":9330,\"start\":9256},{\"attributes\":{\"id\":\"formula_3\"},\"end\":9474,\"start\":9411},{\"attributes\":{\"id\":\"formula_4\"},\"end\":9793,\"start\":9765},{\"attributes\":{\"id\":\"formula_5\"},\"end\":10740,\"start\":10300},{\"attributes\":{\"id\":\"formula_6\"},\"end\":10904,\"start\":10835},{\"attributes\":{\"id\":\"formula_7\"},\"end\":11431,\"start\":11183},{\"attributes\":{\"id\":\"formula_8\"},\"end\":11639,\"start\":11585},{\"attributes\":{\"id\":\"formula_9\"},\"end\":12143,\"start\":12063},{\"attributes\":{\"id\":\"formula_10\"},\"end\":12469,\"start\":12356},{\"attributes\":{\"id\":\"formula_11\"},\"end\":12664,\"start\":12555},{\"attributes\":{\"id\":\"formula_12\"},\"end\":15688,\"start\":15580},{\"attributes\":{\"id\":\"formula_13\"},\"end\":16055,\"start\":15688},{\"attributes\":{\"id\":\"formula_14\"},\"end\":16375,\"start\":16345},{\"attributes\":{\"id\":\"formula_15\"},\"end\":16834,\"start\":16743},{\"attributes\":{\"id\":\"formula_16\"},\"end\":18569,\"start\":18482},{\"attributes\":{\"id\":\"formula_17\"},\"end\":19012,\"start\":18899},{\"attributes\":{\"id\":\"formula_18\"},\"end\":19178,\"start\":19150},{\"attributes\":{\"id\":\"formula_19\"},\"end\":19726,\"start\":19693},{\"attributes\":{\"id\":\"formula_20\"},\"end\":20633,\"start\":20571},{\"attributes\":{\"id\":\"formula_21\"},\"end\":20972,\"start\":20792}]", "table_ref": null, "section_header": "[{\"attributes\":{\"n\":\"1.\"},\"end\":814,\"start\":802},{\"attributes\":{\"n\":\"2.\"},\"end\":3355,\"start\":3345},{\"end\":6371,\"start\":6367},{\"attributes\":{\"n\":\"3.\"},\"end\":7532,\"start\":7512},{\"attributes\":{\"n\":\"4.\"},\"end\":13565,\"start\":13529},{\"attributes\":{\"n\":\"5.\"},\"end\":18206,\"start\":18176},{\"end\":23594,\"start\":23580},{\"end\":25279,\"start\":25267},{\"end\":25926,\"start\":25907},{\"end\":27406,\"start\":27394},{\"end\":28806,\"start\":28793},{\"end\":29210,\"start\":29193}]", "table": null, "figure_caption": "[{\"end\":23578,\"start\":22886},{\"end\":23797,\"start\":23596},{\"end\":25265,\"start\":23800},{\"end\":25506,\"start\":25281},{\"end\":25905,\"start\":25509},{\"end\":27145,\"start\":25929},{\"end\":27392,\"start\":27148},{\"end\":27690,\"start\":27408},{\"end\":27785,\"start\":27693},{\"end\":28241,\"start\":27788},{\"end\":28791,\"start\":28244},{\"end\":28883,\"start\":28809},{\"end\":29191,\"start\":28886},{\"end\":29657,\"start\":29212}]", "figure_ref": "[{\"attributes\":{\"ref_id\":\"fig_1\"},\"end\":15470,\"start\":15461},{\"end\":20731,\"start\":20722}]", "bib_author_first_name": "[{\"end\":30276,\"start\":30272},{\"end\":30288,\"start\":30284},{\"end\":30301,\"start\":30298},{\"end\":30475,\"start\":30474},{\"end\":30487,\"start\":30486},{\"end\":30497,\"start\":30496},{\"end\":30506,\"start\":30505},{\"end\":30726,\"start\":30725},{\"end\":30737,\"start\":30736},{\"end\":30995,\"start\":30990},{\"end\":31005,\"start\":31001},{\"end\":31027,\"start\":31014},{\"end\":31347,\"start\":31342},{\"end\":31349,\"start\":31348},{\"end\":31359,\"start\":31355},{\"end\":31381,\"start\":31368},{\"end\":31666,\"start\":31653},{\"end\":31681,\"start\":31675},{\"end\":31996,\"start\":31990},{\"end\":31998,\"start\":31997},{\"end\":32157,\"start\":32156},{\"end\":32159,\"start\":32158},{\"end\":32173,\"start\":32172},{\"end\":32175,\"start\":32174},{\"end\":32187,\"start\":32186},{\"end\":32189,\"start\":32188},{\"end\":32551,\"start\":32548},{\"end\":32879,\"start\":32874},{\"end\":32896,\"start\":32892},{\"end\":32916,\"start\":32909},{\"end\":32918,\"start\":32917},{\"end\":33124,\"start\":33120},{\"end\":33126,\"start\":33125}]", "bib_author_last_name": "[{\"end\":30282,\"start\":30277},{\"end\":30296,\"start\":30289},{\"end\":30308,\"start\":30302},{\"end\":30484,\"start\":30476},{\"end\":30494,\"start\":30488},{\"end\":30503,\"start\":30498},{\"end\":30513,\"start\":30507},{\"end\":30734,\"start\":30727},{\"end\":30744,\"start\":30738},{\"end\":30999,\"start\":30996},{\"end\":31012,\"start\":31006},{\"end\":31032,\"start\":31028},{\"end\":31353,\"start\":31350},{\"end\":31366,\"start\":31360},{\"end\":31386,\"start\":31382},{\"end\":31673,\"start\":31667},{\"end\":31693,\"start\":31682},{\"end\":32004,\"start\":31999},{\"end\":32170,\"start\":32160},{\"end\":32184,\"start\":32176},{\"end\":32200,\"start\":32190},{\"end\":32558,\"start\":32552},{\"end\":32890,\"start\":32880},{\"end\":32907,\"start\":32897},{\"end\":32923,\"start\":32919},{\"end\":33138,\"start\":33127}]", "bib_entry": "[{\"attributes\":{\"id\":\"b0\",\"matched_paper_id\":18588605},\"end\":30472,\"start\":30232},{\"attributes\":{\"doi\":\"arXiv:1302.4618\",\"id\":\"b1\"},\"end\":30723,\"start\":30474},{\"attributes\":{\"doi\":\"arXiv:1302.5487\",\"id\":\"b2\"},\"end\":30911,\"start\":30725},{\"attributes\":{\"id\":\"b3\"},\"end\":31314,\"start\":30913},{\"attributes\":{\"id\":\"b4\",\"matched_paper_id\":63074375},\"end\":31601,\"start\":31316},{\"attributes\":{\"id\":\"b5\",\"matched_paper_id\":102344708},\"end\":31931,\"start\":31603},{\"attributes\":{\"id\":\"b6\",\"matched_paper_id\":671642},\"end\":32154,\"start\":31933},{\"attributes\":{\"id\":\"b7\"},\"end\":32526,\"start\":32156},{\"attributes\":{\"id\":\"b8\",\"matched_paper_id\":5695770},\"end\":32828,\"start\":32528},{\"attributes\":{\"id\":\"b9\",\"matched_paper_id\":119639096},\"end\":33087,\"start\":32830},{\"attributes\":{\"id\":\"b10\"},\"end\":33430,\"start\":33089}]", "bib_title": "[{\"end\":30270,\"start\":30232},{\"end\":31340,\"start\":31316},{\"end\":31651,\"start\":31603},{\"end\":31988,\"start\":31933},{\"end\":32546,\"start\":32528},{\"end\":32872,\"start\":32830}]", "bib_author": "[{\"end\":30284,\"start\":30272},{\"end\":30298,\"start\":30284},{\"end\":30310,\"start\":30298},{\"end\":30486,\"start\":30474},{\"end\":30496,\"start\":30486},{\"end\":30505,\"start\":30496},{\"end\":30515,\"start\":30505},{\"end\":30736,\"start\":30725},{\"end\":30746,\"start\":30736},{\"end\":31001,\"start\":30990},{\"end\":31014,\"start\":31001},{\"end\":31034,\"start\":31014},{\"end\":31355,\"start\":31342},{\"end\":31368,\"start\":31355},{\"end\":31388,\"start\":31368},{\"end\":31675,\"start\":31653},{\"end\":31695,\"start\":31675},{\"end\":32006,\"start\":31990},{\"end\":32172,\"start\":32156},{\"end\":32186,\"start\":32172},{\"end\":32202,\"start\":32186},{\"end\":32560,\"start\":32548},{\"end\":32892,\"start\":32874},{\"end\":32909,\"start\":32892},{\"end\":32925,\"start\":32909},{\"end\":33140,\"start\":33120}]", "bib_venue": "[{\"end\":30336,\"start\":30310},{\"end\":30589,\"start\":30530},{\"end\":30810,\"start\":30761},{\"end\":30988,\"start\":30913},{\"end\":31417,\"start\":31388},{\"end\":31734,\"start\":31695},{\"end\":32028,\"start\":32006},{\"end\":32298,\"start\":32202},{\"end\":32589,\"start\":32560},{\"end\":32941,\"start\":32925},{\"end\":33118,\"start\":33089},{\"end\":31740,\"start\":31736},{\"end\":32310,\"start\":32300}]"}}}, "year": 2023, "month": 12, "day": 17}