{"id": 51948172, "updated": "2023-08-31 03:44:29.616", "metadata": {"title": "A Look into Programmers’ Heads", "authors": "[{\"first\":\"Norman\",\"last\":\"Peitek\",\"middle\":[]},{\"first\":\"Janet\",\"last\":\"Siegmund\",\"middle\":[]},{\"first\":\"Sven\",\"last\":\"Apel\",\"middle\":[]},{\"first\":\"Christian\",\"last\":\"Kästner\",\"middle\":[]},{\"first\":\"Chris\",\"last\":\"Parnin\",\"middle\":[]},{\"first\":\"Anja\",\"last\":\"Bethmann\",\"middle\":[]},{\"first\":\"Thomas\",\"last\":\"Leich\",\"middle\":[]},{\"first\":\"Gunter\",\"last\":\"Saake\",\"middle\":[]},{\"first\":\"André\",\"last\":\"Brechmann\",\"middle\":[]}]", "venue": "IEEE Transactions on Software Engineering", "journal": "IEEE Transactions on Software Engineering", "publication_date": {"year": 2020, "month": 4, "day": 1}, "abstract": "Program comprehension is an important, but hard to measure cognitive process. This makes it difficult to provide suitable programming languages, tools, or coding conventions to support developers in their everyday work. Here, we explore whether functional magnetic resonance imaging (fMRI) is feasible for soundly measuring program comprehension. To this end, we observed 17 participants inside an fMRI scanner while they were comprehending source code. The results show a clear, distinct activation of five brain regions, which are related to working memory, attention, and language processing, which all fit well to our understanding of program comprehension. Furthermore, we found reduced activity in the default mode network, indicating the cognitive effort necessary for program comprehension. We also observed that familiarity with Java as underlying programming language reduced cognitive effort during program comprehension. To gain confidence in the results and the method, we replicated the study with 11 new participants and largely confirmed our findings. Our results encourage us and, hopefully, others to use fMRI to observe programmers and, in the long run, answer questions, such as: How should we train programmers? Can we train someone to become an excellent programmer? How effective are new languages and tools for program comprehension?", "fields_of_study": "[\"Computer Science\"]", "external_ids": {"arxiv": null, "mag": "2941714792", "acl": null, "pubmed": null, "pubmedcentral": null, "dblp": "journals/tse/PeitekSAKPBLSB20", "doi": "10.1109/tse.2018.2863303"}}, "content": {"source": {"pdf_hash": "cba0dc3ff6ca372178a03007025682bf3e7223e4", "pdf_src": "IEEE", "pdf_uri": null, "oa_url_match": false, "oa_info": null}, "grobid": {"id": "5f2f72899d3767fb648fd90617af64fbf10cc338", "type": "plain-text", "url": "s3://ai2-s2-pdf-extraction-prod/parse-results/s2orc_worker/cba0dc3ff6ca372178a03007025682bf3e7223e4.txt", "contents": "\nA Look into Programmers' Heads\n\n\nNorman Peitek \nJanet Siegmund \nSven Apel \nChristian K € Astner \nChris Parnin \nAnja Bethmann \nThomas Leich \nGunter Saake \nAndr E Brechmann \nA Look into Programmers' Heads\n10.1109/TSE.2018.2863303Index Terms-Functional magnetic resonance imaging, program comprehension\nProgram comprehension is an important, but hard to measure cognitive process. This makes it difficult to provide suitable programming languages, tools, or coding conventions to support developers in their everyday work. Here, we explore whether functional magnetic resonance imaging (fMRI) is feasible for soundly measuring program comprehension. To this end, we observed 17 participants inside an fMRI scanner while they were comprehending source code. The results show a clear, distinct activation of five brain regions, which are related to working memory, attention, and language processing, which all fit well to our understanding of program comprehension. Furthermore, we found reduced activity in the default mode network, indicating the cognitive effort necessary for program comprehension. We also observed that familiarity with Java as underlying programming language reduced cognitive effort during program comprehension. To gain confidence in the results and the method, we replicated the study with 11 new participants and largely confirmed our findings. Our results encourage us and, hopefully, others to use fMRI to observe programmers and, in the long run, answer questions, such as: How should we train programmers? Can we train someone to become an excellent programmer? How effective are new languages and tools for program comprehension?Index Terms-Functional magnetic resonance imaging, program comprehension Ç 1. http://www.lrc.ky.gov/record/14rs/SB16.htm: KRS 156.160 Section 1.a.1: If a school offers American sign language or computer programming language, the courses shall be accepted as meeting the foreign language requirements and the computer programming language course shall be accepted as an elective course in common schools notwithstanding other provisions of law.\n\nINTRODUCTION\n\nA RE learning natural languages and learning programming languages related? It may seem strange at first sight, but long ago, Dijkstra stated that \"an exceptionally good mastery of one's native tongue is the most vital asset of a competent programmer\" [22]. In Kentucky and several other US states, the legislative changed, such that school kids are now allowed to take a programming-language course instead of learning a foreign language. 1 Establishing a foundational theory of comprehension and cognitive processes associated with programming will fundamentally inform the design of software tools and programming languages as well as education policy for learning programming across multiple STEM disciplines.\n\nFor example, we may be able to determine whether there is a critical age associated with programming skills. The results may also provide insights into how teaching programming practices, such as object-oriented languages, design patterns, or functional programming, are factors of how programmers comprehend code.\n\nResearch on the behavior of programmers has lead to interesting but limited insights in the context of program comprehension, the main activity of software developers. Theories of program comprehension have proposed two primary mechanisms: top-down and bottom-up program comprehension. Top-down comprehension is a hypothesisdriven process, in which developers initially form hypotheses about the source code and, by looking at more and more details, refine these hypotheses subsequently, until they form an understanding of the program [13]. With bottom-up comprehension, developers start with details of the source code and group these details to semantic chunks, until they have formed a high-level understanding of the program [96]. Thus, there are plausible models available that describe how developers proceed when understanding source code. However, the underlying cognitive processes of top-down and bottom-up program comprehension are still unclear-the programmer's head is still far from being understood.\n\nTo unravel the mysteries of program comprehension, we need to take a closer look at the underlying cognitive processes. Since functional magnetic resonance imaging (fMRI) has proved successful for observing internal cognitive processes, such as reading comprehension, concentration, object identification, and decision making, it is promising to apply it in the context of program-comprehension research.\n\nIn our experiment, 17 participants performed two types of tasks inside an fMRI scanner. In the first type, referred to as comprehension tasks, developers comprehended code snippets and identified the program's output. In the second type, referred to as syntax tasks, developers identified syntax errors in code snippets, which is similar to the comprehension tasks, but does not require actual understanding of the program. To gain confidence in the results and the method, we replicated the experiment with 11 new participants. As a result of our studies, we found: evidence that distinct cognitive processes took place when performing the comprehension tasks, as compared to the syntax tasks, activation of functional areas related to working memory, attention, and language comprehension, and a dominant activation of the left side, i.e., speech hemisphere. a relationship between source-code complexity and concentration level, a reduced cognitive effort with increased programming language familiarity, but no correlation between programming experience and cognitive effort. Our results provide evidence of the involvement of working memory and language processing in program comprehension, and they imply that, during learning programming, training working memory (necessary for many cognitive tasks) and language skills (which Dijkstra already claimed as relevant for programming) might also be essential for programming skills. Furthermore, our results suggest that the more complex the source code is, the more the participants need to concentrate during comprehension tasks. Such results can help to validate or invalidate particular theories of program comprehension, such as data-flow measures that hypothesize an increasing need for concentration with a rising number of exchanged information between variables [8]. Although a single study is not sufficient to answer general questions, we can strengthen the confidence in our methodology and begin to ask probing questions and outline a path toward answering them: If program comprehension is linked to language comprehension, does learning and understanding a programming language require the same struggles and challenges as learning another natural language? If program comprehension dominantly activates the left hemisphere (often referred to as analytical), can we derive better guidelines on how to train students?\n\nThis article extends our paper presented at ICSE [99] and incorporates results from a replication performed as part of a different study [100]. Specifically, we expand our discussion and relation to other recent results, and discuss the history of and other alternative methods to fMRI (Section 2); show neural correlates of the effort participants put into comprehension task, and that the concentration level depends on the complexity of a source-code snippet (RQ2); show the effect of different levels of programming experience on a programmer's cognitive load (RQ3); show additional ways to analyze fMRI data (RQs 2 and 3). With the extensions of the first fMRI study in the context of software engineering, this paper makes the following contributions:\n\nWe present the first fMRI study to observe brain activity during bottom-up program comprehension tasks. By sharing our experience, we have already inspired other researchers to follow in our footsteps [15], [24], [33]. We demonstrate the potential of fMRI studies to increase our understanding of the human factor in software-engineering research. We were able to successfully replicate our first fMRI study with different participants, which strengthens the validity of our experiment design [100]. Taking a broader perspective, our studies demonstrate the feasibility of using fMRI experiments in software-engineering research and has already led to other studies applying this technique [15], [24], [33]. With decreasing costs of fMRI studies, we believe that such studies will become a standard tool also in software-engineering research.\n\n\nFMRI, ITS USES, AND LIMITATIONS\n\nTo understand the principle of fMRI studies and why we designed our study the way we did, we shortly outline the development, limitations, and alternatives of fMRI. 2 \n\n\nHistory\n\nIn the 1920s to the 1940s, researchers discovered that atomic nuclei have magnetic properties, which can be manipulated with magnetic fields. To this end, the magnetic field needs to oscillate with the resonant frequency of the atomic nuclei, which is referred to as nuclear magnetic resonance (NMR). In the following years, NMR was primarily used in chemistry to better understand chemical composition of homogeneous substances. In the 1970s, researchers discovered that water molecules behave differently in different biological tissues, leading to the hypothesis that these differences also occur in cancerous versus non-cancerous cells. In studies with rat cells, this hypothesis could be confirmed, opening the door to medical application of NMR. In 1977, the first magnetic resonance image of a human's (a postdoctoral fellow) heart, lungs, and surrounding muscles was taken, which took 4 hours back then. NMR was a healthier alternative to computed tomography (CT), because it does not require exposure to concentrated X rays. In the early 1980s, NMR was renamed to MRI (magnetic resonance imaging) to remove the negative connotation of the word \"nuclear\" regarding health. Since then, it has been used in medicine to create structural images of the human body, which are used as diagnosis tool. The success in medicine ushered further research on MRI, which eventually led to functional MRI (fMRI), as we are using it in our study. In the 1990s, researchers observed that changes in blood oxygenation could be measured with MRI imaging. This is based on the different magnetic properties of oxygenated and deoxygenated blood. Oxygenated blood is diamagnetic and does not affect a magnetic field. Deoxygenated blood, however, is paramagnetic and does affect magnetic fields. This difference is exploited in fMRI by observing the BOLD signal. 2 \n\n\nBOLD Signal\n\nIn a nutshell, fMRI observes magnetic properties of the blood. When a brain region is activated, its oxygen need increases, and so does the amount of oxygenated blood in this region. At the same time, the amount of deoxygenated blood decreases. Thus, the ratio of oxygenated and deoxygenated blood in a brain region changes compared to a resting state-this is referred to as the BOLD (blood oxygenation level dependent) effect. The BOLD effect needs a few seconds to manifest. Typically, about 5 seconds after stimulus onset, it peaks; after a task is finished, the oxygen level returns to the baseline level after 12 seconds. Often, before returning to the baseline, the oxygen level briefly dips below the baseline [47]. A longer task duration allows the BOLD signal to accumulate, which produces better observed differences between tasks. To reliably measure the BOLD effect (i.e., the activation of a brain region), typical fMRI studies consist of an alternating sequence of task, control, and rest conditions without externally triggered mental activity.\n\n\nUses of fMRI Studies\n\nWhen studying cognitive processes in the brain, scientists often follow a pattern of research that begins with a single case of brain injury that interferes with a cognitive behavior, followed by further studies locating and isolating brain activity. To identify a region of the brain, scientists use instruments with high spatial precision, such as fMRI scanners. After having established a general idea of which brain areas are involved in a given cognitive process, scientists further try identifying the timing and interaction of brain activity among brain regions.\n\nComplex behaviors, such as understanding a spoken sentence, require interactions among multiple areas of the brain. Eventually, to create a model of behavior, scientists use techniques to dissociate activated brain areas to understand how a particular brain area contributes to a behavior. For instance, scientists found that the left medial extra striate cortex was associated with visual processing of words and pseudo words that obey English spelling, but not activated by unfamiliar strings of letters or letter-like forms [80].\n\nTo reference an identified brain location, Brodmann areas have proved useful as a classification system, and cognitive processes, such as seeing words or retrieving meaning from memory, can be mapped to these areas [12]. Through extensive research in this field over the past 25 years, there is a detailed and continuously growing map between Brodmann areas (and further subdivisions) and associated cognitive processes (e.g., www.cognitiveatlas.org shows an atlas). When studying a new task, such as program comprehension, we can identify which brain regions are activated and consequently hypothesize which cognitive processes are involved. For example, we found that one of the activated regions in our study is related to language recognition, so we can hypothesize that language recognition is an integral part of program comprehension, which was not certain a priori (see Section 6.1).\n\n\nLimitations of fMRI\n\nfMRI has now existed for more than 25 years and has provided valuable insights into the human brain [37]. However, fMRI also has limitations [83], [84]. First, the temporal resolution is limited, because changes in the BOLD contrast take longer than the underlying neural activity, which can occur as fast as 500 times per second [38]. We can currently tolerate this limitation, as many cognitive processes of interest to software engineering researchers (e.g., comprehension, maintenance, bug finding) are rather long-lasting (i.e., minutes). Temporal dynamics, for example, how the brain activation changes throughout a task, may be of interest once there is an established body of knowledge about cognitive processes and their activated brain areas. At this point, the limitation regarding temporal resolution will become relevant. However, while this kind of research is compelling, it is beyond the scope of this exploratory study to locate relevant brain areas of program comprehension.\n\nSecond, depending on the goal of a measurement, it requires averaging across a number of comparable events and participants to reduce unavoidable noise during data collection. The number of comparable events depends on the expected effect size: the larger the effect size, the fewer measurements are necessary. For example, for determining the speech hemisphere, the effect size is rather large, so that fMRI is capable of determining the speech hemisphere of individual participants within a few minutes [7]. To further increase temporal resolution, real-time approaches are currently developed that are able to determine the BOLD response of the whole brain online. However, determining subtle differences between very similar conditions still requires many averages as well as group data to determine meaningful and statistically significant results. Finally, we cannot make a causal inference, but only collect correlational data. That is, we can observe that a cognitive process occurs simultaneously with activation in a brain area, but we cannot conclude that this cognitive process caused the activation or that this activation caused the cognitive process.\n\n\nAlternatives\n\nSince fMRI has a rather low temporal resolution and is currently quite expensive to conduct, other neuro-imaging techniques have also been used when observing cognitive processes (see Section 10 related studies).\n\nOther techniques to measure brain activation also each have strengths and weaknesses. Electroencephalography (EEG) measures the electrical impulses of a neuron's activation and, thus, has a high temporal resolution, but at the cost of lacking the high spatial resolution of fMRI. Moreover, extracting event-related brain activation with EEG requires much more averaging than in fMRI. The same pertains to magnetoencephalography (MEG), which measures the magnetic properties of the electrical impulses of a neuron. Both techniques also have similar disadvantages in that they cannot collect signals from deep neural structures, but mainly from the surface of the brain. The same disadvantage holds for functional near-infrared spectroscopy (fNIRS). fNIRS also measures the BOLD effect, but the measurement is based on changes of light-absorbtion properties of oxygenated and deoxygenated blood [16]. However, an fNIRS device is much more light-weight than an fMRI scanner, making it much cheaper to apply.\n\n\nFMRI STUDIES IN A NUTSHELL\n\nThe sophisticated technical foundations of fMRI provide special challenges for the design of according studies. In the this section, we introduce the specific rationale of such studies on a high level. We describe the details of our study in Section 4.\n\n\nGeneral Challenges of fMRI Studies\n\nStudies using fMRI face general challenges due to the technologies involved, which are very different from, say, controlled experiments in empirical software engineering.\n\nTo unambiguously determine the brain region in which the BOLD effect took place, we need to avoid motion artifacts, that is, noise that occurs when participants move their head. To this end, participants are instructed to lie as motionless as possible during the measurement, and their head is fixed with cushions. Furthermore, communication and interaction with participants is limited, because speaking or pressing buttons may also cause motion artifacts. In such a restricted setting, the experiment duration should not exceed one hour, because after that, participants start getting restless or fatigued.\n\nAdditionally, participants can only view a relatively small screen reflected through a mirror (illustrated in Fig. 1b), on which a limited number of lines of text can be displayed. We could support scrolling to show more text, but this is also prone to motion artifacts. This constraints us regarding the complexity of source code that we can present to participants. For example, studying how programmers comprehend an entire software component with many classes may increase motion artifacts due to the necessary actions to navigate the source code, and would also mean a high load on working memory, since not much can be shown on the screen. In the same vein, letting participants actually write code with a keyboard will be rather difficult, as participants are in a lying position, and because of the risk of elevated motion artifacts. Letting participants speak code is technically possible, but would cause additional language-related activation overlapping and diluting the activation of interest of program comprehension. Less restrictive techniques, such as fNIRS or EEG, are more suitable when it comes to observe writing code.\n\nFinally, an fMRI study needs to be designed in a way to be able to distinguish brain activations caused by the experimental tasks from other non-specific activations. For example, in tasks that require participants to watch a screen or listen to a signal, there will be activations caused by visual or audio processing. To filter activations that are not specific for the experimental tasks (e.g., visual processing for program comprehension), we need to design control tasks that allow us to compare brain activations between two conditions. The control tasks need to be as similar as possible to the experimental tasks and differ only in the absence of the targeted cognitive process. Ideally, the control tasks only differ in a single isolated aspect relevant to the research question, while keeping all other variables constant. 3 \n\n\nRequirements for Our fMRI Study\n\nWith the goal of our study to find neuronal correlates of bottom-up program comprehension, the general fMRI challenges translate into a specific set of requirements.\n\nFirst, we decided to start with short code snippets that fit on one screen to avoid motion artifacts by excessive usage of a computer mouse.\n\nSecond, we need source-code fragments with a suitable level of difficulty. If the source code is too easy to understand, participants may finish too early, such that the BOLD activation returns to baseline before the end of a trial. On the other hand, if source code is too difficult, participants cannot finish understanding it. In this case, we cannot be sure that the cognitive process actually took place long enough to be measured. The challenge is to find the right level of difficulty-short code fragments that require 30 to 120 seconds to understand. In a one-hour experiment, we can perform about a dozen repetitions, for which we need comparable tasks.\n\nFinally, as an fMRI study requires a control task to filter out irrelevant brain activation (cf. Section 3.1), we needed to find a task that ideally differs from the comprehension tasks only in the absence of comprehension, nothing else. In our context, control tasks are different from typical control tasks in software-engineering experiments, where a baseline tool or language is used; in fMRI, the similarity is defined at a low, fine-grained level, such that we can observe the activation caused by comprehension only.\n\nThese constraints-short code fragments of controlled difficulty and limited repetitions-impair external validity, as we discuss in Section 9. Results of fMRI studies can be generalized to realistic situations only with care.\n\n\nOverview of Our fMRI Study\n\nGiven the constraints and our goal to observe bottom-up program comprehension, we selected short algorithms that are taught in first-year undergraduate computer-science courses as comprehension tasks, such as the word-reversal code in Fig. 2. We asked participants to determine the output of the 3. Amaro and Barker [1] give a detailed overview on the basics of fMRI study design. program (\"olleH\", in our example), which they can accomplish only if they understand the source code. The programs we used included sorting and searching in arrays, string operations, and simple integer arithmetic. We obfuscated identifiers to enforce program comprehension that required understanding code with a bottom-up approach, that is, from syntax to semantics (see Section 4.1).\n\nFor control tasks (syntax tasks), we introduced syntax errors, such as quotation marks or parentheses that do not match and missing semicolons or identifiers, into the same code fragments as the comprehension tasks (illustrated in Fig. 3). Then, we asked participants to locate syntax errors (Lines 1, 2, and 8). Comprehension and syntax tasks are similar, yet sufficiently different: Both require the participants to look at almost identical pieces of text, but for the syntax tasks, participants do not need to understand the code.\n\nTo find suitable comprehension and syntax tasks, we conducted pilot studies in a computer lab (see Fig. 1a). We let a total of 50 participants solve 23 comprehension tasks and search for more than 50 syntax errors. For the syntaxerror tasks, we asked participants whether they needed to understand the source code in order to locate the errors, which occurred only occasionally. Based on our observations, we selected 12 source-code snippets and corresponding syntax errors with suitable duration and difficulty.\n\nFor the actual fMRI study (see Fig. 1b), we conducted the experiment with 17 participants. Although initial fMRI studies often do not yield conclusive results because of missing empirical evidence (e.g., related studies, hypotheses about involved areas), we measured a clear activation pattern (Fig. 1c), which is an encouraging result that we discuss in Section 6.\n\n\nSTUDY DESIGN\n\nHaving provided a high-level overview, we now present the technical details of our study. Additional material (e.g., all source-code snippets) is available at the project's Web site. 4 \n\n\nObjective\n\nTo the best of our knowledge, we performed the first fMRI study to measure program comprehension. Since we are exploring functional mappings of program comprehension a priori, we do not state research hypotheses about activated brain regions, but instead, pose three research questions about bottom-up program comprehension, code complexity, and programmer experience: RQ1: Which brain regions are activated during bottom-up program comprehension?\n\nWe focused on bottom-up program comprehension to avoid any possible additional activation that is caused by participants relying on their domain knowledge. Recalling this knowledge might cause activation in memory-related areas, which could make the interpretation of the results more difficult. With bottom-up comprehension, we reduce such possible additional noise. Furthermore, we focused on a rather homogeneous level of programming experience and homogeneous difficulty of source-code snippets to reduce any noise caused by it. Of course, this higher internal validity of the design limits the external validity, which we discuss in Section 9.\n\nThe following research questions are intended to show the potential of fMRI and explore ways to maximize the output of expensive fMRI studies. To demonstrate this, we performed a secondary analysis of our data collected in our original study to answer two new research questions. However, we would like to note that, with our focus on internal validity (i.e., comparable source-code snippets and homogeneous level of programming experience), the results should be treated with caution, and the analysis should rather be seen as procedure for hypotheses generation.\n\nRQ2: Does source-code complexity correlate with concentration levels during bottom-up program comprehension? With increasing complexity of source code, it seems plausible that developers need a higher level of concentration to understand it. With fMRI, we can use the deactivation strength as an indicator of concentration levels [63]. Thus, with additional analysis, it is promising to explore this kind of question and evaluate its potential for future, dedicated studies. RQ3: Does programming experience correlate with brain activation strength during bottom-up program comprehension? Previous research showed that the brain activation (measured with EEG) differs for novices and experts [55], [59]. With fMRI, we can also differentiate between novices and experts for different activities (see Section 11). Thus, we show how we can look for such an effect in our fMRI study.\n\n\nOperationalization of Variables\n\nTo answer RQ1, we need to ensure that participants use bottom-up comprehension only. At the same time, we did not want to increase the load on working memory unnecessarily. To balance the meaningfulness of identifier names, we conducted pilot studies (cf. Section 4.4), which showed that naming variables according to their purpose provides an optimal balance. For example, in Fig. 2, variable result provides a hint of its purpose (i.e., that it contains the  4. tinyurl.com/ProgramComprehensionAndfMRI/ result), but does not reveal its content (i.e., that it holds the reversed word), and is also not completely unrelated (e.g., aaaa). For RQ2, we need to find a measure of complexity for source code. Various software complexity measures have been proposed, which can be categorized into four groups:\n\nSize measures quantify the length of source code. The rationale is that, the more lines source code has, the more complex it is. We selected the commonly used LOC measure (without white spaces) as a representative measure [46]. Control-flow measures quantify the complexity of the control flow of a program. The more possible execution paths exist, the higher the complexity. As representative, we selected McCabe's cyclomatic complexity, which counts the number of possible execution paths [62]. Another category of software measures aims at the vocabulary size of source code: The more variables and operations exist, the more cognitive effort is required to understand a program. As representative, we selected Halstead's complexity [43]. Data-flow measures quantify how much information is moved between program variables. The more information is moved, the more a developer has to consider and the more difficult it is to understand it, that is, where and what information is passed. We selected DepDegree as representative, which counts how often information is passed between program elements [8]. We selected one representative of each group, so that we do not miss potential interesting relationships between source-code complexity and concentration (i.e., to increase construct validity).\n\nWhile there is a long-lasting discussion about the benefits and drawbacks of software measures, they are nevertheless used as indicator to assess the maintainability, extensibility, or comprehensibility of source code [30]. The benefit of software measures is that they are relatively easy to compute, but as drawback, their expressiveness for such aspects is unclear [27], [94], [107]. Additionally, with the plethora of software measures, it is not quite clear to what extent software measures actually describe different aspects of source code, or in other words, are independent. With our selection from different categories, we intend to mitigate this issue. However, the correlation of the software measures is quite high (see Table 1), except for DepDegree and LOC. Thus, the software measures are not independent for our source-code snippets. Nevertheless, we need to keep in mind that the snippets were not designed for this kind of analysis, and that the main purpose of conducting this analysis is to show a way to relate software measures to cognitive effort using fMRI.\n\nTo operationalize concentration, we evaluate changes in blood flow of the default mode network, which comprises several brain areas (e.g., cingulate cortex, prefrontal midline regions) and which is related to self-referential processing [37], [88]. When left to think about nothing specific (e.g., in the rest conditions), we often think about self-related aspects, for example, our plans for after the scanner session or previous experiences. This is reflected in an increased blood flow within the default mode network, that is, the default mode network shows high activation during rest states. When we concentrate on tasks, the default mode network deactivates, so that this self-referential processing does not interfere with the task. Hence, with the level of deactivation of the default mode network, we can measure the concentration level of participants: the stronger the deactivation, the higher the concentration level.\n\nTo address RQ3, we need to operationalize programming experience. To this end, we selected two measures:\n\nProgram experience score as determined by our questionnaire (i.e., a combination of self-estimated experience with logic programming and self-estimated experience compared to class mates) [28]. Java knowledge based on self estimation of the participants, because we used Java as underlying programming language.\n\n\nExperimental Design\n\nAll participants completed the experiment in the same order. Before the measurement, we explained the procedure to each participant and they signed an informed consent form. Each session started with an anatomical measurement stage that lasted 9 minutes. This was necessary to map the observed activation to the correct brain regions. Next, participants solved tasks inside the fMRI scanner in the Leibniz Institute for Neurobiology in Magdeburg. We had 12 trials, each consisting of a comprehension task and a syntax task, separated by rest periods: The rest periods, in which participants were instructed to do nothing, was our baseline (i.e., the activation pattern when no specific cognitive processes take place). To familiarize participants with the setting, we started with a warmup trial, a hello-world example that was not analyzed. Instead of saying or entering the output of source-code snippets, participants indicated when they have determined the output in their mind or located all syntax errors by using the left of two keys of a response box with their right index finger. With this procedure, we minimized motion artifacts during the fMRI measurement. To ensure that comprehension took place, we showed the source code again directly after the scanner sessions, and participants entered their answer. \n\n\nMaterial\n\nInitially, we designed 23 standard algorithms that are typically taught in first-year undergraduate computer-science education at German universities. For example, we had algorithms for sorting or searching in arrays, string operations (cf. Fig. 2), and simple integer arithmetic, such as computing a power function (see project's Web site for all initially selected source-code snippets). The selected algorithms were different enough to avoid learning effects from one algorithm to another, but yet similar enough (e.g., regarding length, difficulty) to elicit similar activation, which is necessary for averaging the BOLD effect over all tasks. We created a main program for each algorithm, printing the output for a sample input. All algorithms are written in imperative Java code inside a single main function without recursion and with light usage of standard API functions. To minimize cognitive load caused by complex operations that are not inherent to program comprehension, we used small inputs and simple arithmetic (e.g., 2 to the power of 3).\n\nWe injected three syntax errors into every program to derive control tasks that are otherwise identical to the corresponding comprehension tasks, as illustrated in Fig. 3. The syntax errors can be located without understanding the execution of the program; they merely require some kind of pattern matching.\n\nIn a first pilot study [98], we determined whether the tasks have suitable difficulty and length. In a lab session, we asked participants to determine the output of the source-code snippets and measured time and correctness. 41 undergraduate computer-science students of the University of Passau participated. To simulate the situation in the fMRI scanner, participants were not allowed to make any notes during comprehension. Based on the response time of the participants, we excluded six snippets with a too high mean response time ( > 120 seconds) and one snippet with a too low response time ( < 30 seconds) to maximize the BOLD response in the fMRI scanner (cf. Section 3.2). Regarding correctness, we found that, on average, 90 percent of the participants correctly determined the output, so none of the snippets had to be excluded based on difficulty.\n\nIn a second pilot study, we evaluated the suitability of syntax tasks, so that we can isolate the activation caused only by comprehension. Undergraduate students from the University of Marburg (4) and Magdeburg (4) as well as one professional Java programmer located syntax errors. We analyzed response time and correctness to select suitable syntax tasks. All response times were within the necessary range, and most participants found, at least, two syntax errors. Thus, the syntax tasks had a suitable level of difficulty.\n\nFor the session in the fMRI scanner, we further excluded four tasks to keep the experiment time within one hour. We excluded one task with the shortest and one with the longest response time. We also excluded two tasks that are similar to other tasks (e.g., adding versus multiplying numbers). We defined a fixed order for the source-code snippets to maximize the distance between snippets being shown for comprehension and locating syntax errors, while also preferably being shown as comprehension first. Whenever possible, we let participants first comprehend a snippet, then, in a later trial, locate syntax errors in the corresponding snippets, with a large as possible distance between both. This was not possible for three snippets (reverse array, cross sum, decimal to binary). With this fixed order, we attempted to minimize learning effects. 5 In Table 2, we give a high-level description of the source-code snippets, including the four different software complexity measures that we correlated with concentration.\n\nFurthermore, we assessed the programming experience of participants with an empirically developed questionnaire to assure a homogeneous level of programming experience [28], and we assessed the handedness of our participants with the Edinburgh Handedness Inventory [72], because the handedness correlates with the role of the brain hemispheres [56] and, thus, is necessary to correctly analyze the activation patterns.\n\n\nParticipants\n\nTo recruit participants, we used message boards of the University of Magdeburg. We recruited 17 computer-science \n\n\n5.\n\nA randomized order, which is usually used to minimize learning effects, may have shown the same snippet as comprehension and locate syntax error directly after each other and as such not been effective for this study. and mathematics students, two of them female, all with an undergraduate level of programming experience and Java experience (see project's Web site for details), comparable to our pilot-study participants. Thus, we can assume that our participants were able to understand the algorithms within the given time frame. We selected students, because they are rather homogeneous; this way, the influence of different backgrounds is minimized. While it seems counter-intuitive to select a homogeneous sample in terms of programming experience, the specific population will be programmers, and even novice programmers represent a relevant sample. In future studies, we will also recruit more experienced programmers.\n\nAll participants had normal or corrected-to-normal vision. One participant was left handed, but showed the same lateralization as right handers, as we determined by a standard lateralization test [7]. The participants gave written informed consent to the study, which was approved by the ethics committee of the University of Magdeburg. As compensation, the participants received 20 Euros. The participants were aware that they could end the experiment at any time.\n\n\nImaging Methods\n\nThe imaging methods are standard procedure of fMRI studies and are described in detail in this section.\n\n\nSource-Code Presentation\n\nFor source-code presentation and participant-response recording, we used the Presentation software (www.neurobs.com) running on a standard PC. Source code was back-projected onto a screen that could be viewed via a mirror mounted on the head coil (cf. Fig. 1b). The distance between the participant's eyes and the screen was 59 cm, with a screen size of 325 Â 260 mm, which is appropriate for an angle of AE15 . The source-code snippets were presented in the center of the screen with a font size of 18, as defined in the Presentation software. The longest source-code snippet had 18 lines of code.\n\n\nData Acquisition\n\nWe carried out the measurements on a 3 Tesla scanner (Siemens Trio, Erlangen, Germany) equipped with an eight channel head coil. The 3D anatomical data set of the participant's brain (192 slices of 1 mm each) was obtained before the fMRI measurement. Additionally, we acquired an Inversion-Recovery-Echo-Planar-Imaging (IR-EPI) scan with the identical geometry as in the fMRI measurement, to obtain a more precise alignment of the functional to the 3D anatomical data set.\n\nFor fMRI, we acquired 985 functional volumes in 32 minutes and 50 seconds using an echo planar imaging (EPI) sequence (echo time (TE), 30 ms; repetition time (TR), 2000 ms; flip angle, AE80 ; matrix size, 64 Â 64; field of view, 19.2 cm Â 19:2 cm; 33 slices of 3 mm thickness with 0.45 mm gaps). During the scans, participants wore earplugs for noise protection.\n\n\nData Preparation\n\nWe analyzed the functional data with BrainVoyager QX 2.1.2. 6 We started a standard sequence of preprocessing steps, including 3D-motion correction (where each functional volume is coregistered to the first volume of the series), linear trend removal, and filtering with a high pass of three cycles per scan. This way, we reduced the influence of artifacts that are unavoidable in fMRI studies (e.g., minimal movement of participants). Furthermore, we transformed the anatomical data of each participant to a standard Talairach brain [105].\n\nNext, we spatially smoothed the functional data with a Gaussian filter (FWHM=4 mm). Furthermore, we normalized the BOLD response to the baseline that is defined by averaging the BOLD amplitude 15 seconds before the onset of the comprehension and syntax condition, respectively. Then, we averaged the BOLD response over all participants.\n\nAdditionally, we thoroughly inspected the functional data for strong signal intensity fluctuations resulting from head motion. For this purpose, we analyzed the automated head-motion-correction procedure, which resulted in estimated translation and rotation parameters for each spatial direction. In particular, we checked the data for jerky movements, as these can lead to signal artifacts. We defined a jerky move as a translation or rotation of the head from one volume to the next in the magnitude of 0.5 mm or 0.5 in one spatial direction or of 1.0 mm or 1.0 as the sum of all directions. We eliminated the respective volumes to correct for outliers.\n\n\nAnalysis Procedure\n\nWe conducted a random-effects GLM analysis, defining one predictor for the comprehension tasks and one for the syntax tasks. These were convolved with the model of a twogamma haemodynamic response function using the default parameters implemented in BrainVoyager QX. We averaged the haemodynamic response for each condition (comprehension, syntax) across the repetitions.\n\nNext, we contrasted comprehension with the rest condition using a significance level of p < 0:05 (FDRcorrected [6]), to determine the voxels that showed a positive deflection of the BOLD response, compared to the rest period. This way, we were able to exclude voxels that were deactivated, which we analyzed separately. The activated voxels comprised a mask, which was used in the subsequent contrast, where we directly compared comprehension with syntax tasks at a significance level of p < 0:01 (FDRcorrected) and a minimum cluster size of 64 mm 3 .\n\nTo identify areas with task-induced deactivation within the default network, we contrasted program comprehension with the resting condition. To test whether there are systematic differences in task-induced deactivation elicited by the different program codes, we calculated for each of the resulting regions of interest the beta values from the general linear model for the 12 different code snippets. We then performed a two-sided Pearson correlation between these beta values and the different software measures, i.e., LOC, McCabe, Halstead, and DepDegree (RQ2). For RQ3, we computed the Spearman correlations of programming experience with the activation strength of the significant Brodmann areas.\n\nAs the last step, we determined the Brodmann areas based on the Talairach coordinates with the Talairach daemon (client version, available online at www.talairach.org). 6. Brain Innovation B.V., Netherlands, brainvoyager.com The Talairach space is used for the technical details of the analysis, and the Brodmann areas are used to map activated areas to cognitive processes.\n\n\nRESULTS\n\nIn this section, we present the results, separated by the three research questions. For each research question, we first present the results, directly followed by the interpretation of the results. We discuss the implications of the results in Section 6.\n\n\nRQ1: Which Brain Regions Are Activated during\n\nBottom-Up Program Comprehension?\n\nIn Fig. 4, we show the resulting activation pattern of the analysis, including the time course of the BOLD responses for each cluster. The activation picture and BOLD responses are averaged over all tasks per condition (comprehension, syntax) and participants; the gray area around the time courses shows the standard deviation based on the participants' averaging. We did not exclude any data from participants, since all showed comprehension of the source-code snippets by at least one of three ways: entering the correct output of the source code after the experiment, correctly describing what the source code was doing, or by ensuring that they attempted to comprehend the source code (based on the questionnaire after the measurement; see project's Web site for details).\n\nIn essence, we found five relevant activation clusters, all in the left hemisphere. For each cluster, we show Talairach coordinates, the size of the cluster, related Brodmann areas, and relevant associated cognitive processes (note that deciding which cognitive processes are relevant belongs to the interpretation, not results; see Section 6). Thus, we can answer our first research question: In Fig. 5, we show the significantly deactivated areas and their BOLD responses. The left part of Fig. 5 shows the areas that are significantly deactivated during the comprehension task, that is, areas with less activation compared to the rest condition (color-coded with blue). The deactivated areas, that is, the prefrontal midline areas and posterior cingulate cortex, are both key components of the default mode network. The BOLD responses of the deactivated areas show a drop between 5 and 15 seconds after task onset. This indicates that participants concentrated during the comprehension tasks. Next, we looked at the correlation between the strength of deactivation and complexity of source code for the set of software measures. Fig. 6 visualizes the correlation of the software measures with the beta value for each deactivated areas averaged across participants. By using the mean, we can reduce the influence of peculiarities of individual participants. Each dot in the plot indicates one comprehension task. We found that all deactivated areas correlate negatively with DepDegree and Halstead; that is, the higher the value for these complexity measures, the lower the level of the beta value for the deactivated areas (indicating more concentration). One correlation, that is, the correlation of BA 32 with DepDegree (À0:591, bottom right) is statistically significant. Given our small sample size, we can actually expect that although some of the correlations have a high value, these are not necessarily statistically significant (cf. Section 4.1). Interestingly, the correlation with McCabe is positive, indicating that with a higher control-flow complexity, the deactivation of the found areas is less pronounced, or in other words, requires less concentration of participants. However, these correlations are not significant. The weakest correlations are with lines of code, indicating that there is no relationship between lines of code and concentration in our sample. However, it is important to note the source-code snippets were designed to be similar in length and complexity. Thus, while we demonstrated what such an analysis looks like, the source-code snippets need to show a higher variation in length and complexity to reliably evaluate whether a relationship between concentration and length/complexity exists.\nRQ1\nAnother important issue to consider is the correlation of the software measures amongst themselves (cf. Table 1). For example, since Halstead and DepDegree exhibit a high correlation, it is only natural that both also have a high correlation with the deactivation strength. However, at the same time, Halstead also has a high correlation with LOC, yet LOC has almost no correlation with the deactivation strength. However, since we have a small sample and the snippets are not designed to actually provide an answer to this question, we are not digging deeper into explaining this result. The purpose of this analysis is to merely show how software measures can be related to cognitive effort.\n\n\nRQ3: Does Programming Experience Correlate with Brain Activation Strength during Bottom-Up Program Comprehension?\n\nWe found five activated brain areas during program comprehension, which are shown in Fig. 4. For RQ3, we computed the Spearman correlation between the strength of activation in the five activated brain areas during program comprehension and a participant's programming experience and Java knowledge (visualized in Figs. 7 and 8).\n\nThe distribution of programming experience scores is clustered around a low score value of 2.0. This can be explained by the homogeneous participant group of computer science students, which are rather novice programmers. Nevertheless, it is noteworthy that the correlations are different between the five brain areas. BA 21 shows a weak positive correlation (0.211). BA 6, BA 40, BA 44, and BA47 show a weak The three graphs to the right show BOLD responses of each deactivated area. The deactivation slopes upwards after the peak, because some participants finish early. This effect is similar in the activated brain areas (cf. Fig. 4). negative correlation (À0:089, À0:027, À0:202, and À0:148, respectively). However, the correlation between programming experience score and activation strength is not statistically significant for any of the five activated brain areas.\n\nSelf-estimated Java knowledge provides a more varied distribution. That means while the participants are overall rather inexperienced, their individual Java knowledge is diverse. The correlation between the Java knowledge and the activation strength is negative for all five activated brain areas. Hence, participants with more Java experience tend to have a lower activation strength. In other words, the data indicate that programmers familiar with Java require less cognitive effort to understand Java source code. In particular, BA 6 and BA 21 show a strong and significant negative correlation (À0:514, and À0:601, respectively). The activation strength of BA 40, BA 44, and BA 47 is also negatively correlated with the Java knowledge (À0:219, À0:379, and À0:21, respectively), but not statistically significant.\n\n\nDISCUSSION\n\n\nRQ1: Which Brain Regions Are Activated during\n\nBottom-Up Program Comprehension?\n\nIn our study, we found a distinct activation pattern of five Brodmann areas. In an initial study with such limited understanding of the role of different cognitive processes for bottom-up program comprehension, finding such a clear pattern is not the norm and demonstrates that the results (and our methodology) are very promising. To clarify the role of the activated brain areas and associated cognitive processes, we look at other fMRI studies that found the same areas activated as we did. Brodmann areas 6 and 40 are often activated in cognitive tasks that require attention, working memory, or problem solving. In recent studies regarding typical problem-solving tasks for words and numbers (e.g., solving 4 þ 1 ¼ x À 1 for x or April þ 1 ¼ favorite À 1 for favorite), BA 40 in the left inferior parietal cortex has been found to be consistently activated, indicating its important role in such activities [2], [69], [90]. Especially when applying algorithmic strategies to mathematical problems (e.g., for multiplying multi-digit numbers), the left inferior parietal cortex plays an important role [2], [90]. Its activation is modulated by the sophistication of strategies (e.g., the school strategy of multiplication from right to left versus the expert strategy used in high-speed expert calculation, which goes from left to right), such that higher activation occurred in the posterior superior parietal lobule when applying the school strategy [90]. In our studies, participants also needed to solve problems based on numbers and words, that is, manipulating numbers or words in their mind according to the algorithms they identified in the source-code snippets. This also requires working memory in order to not forget the values of the manipulated words or numbers. Different studies consistently locate working memory, among others in BA 40 in the inferior parietal cortex [10], [11], [70], independent of whether numbers or words were manipulated. Common tasks that lead to activation in these areas include memorizing several numbers, consisting of pairs of numbers with mathematical structure (e.g., BAs 21, 32, 43, and 54) and without mathematical structure (e.g., BAs 18, 63, 90, and 47), or comprehending sentences with different syntactic structure that put different load on working memory. These kinds of tasks are comparable to comprehending source code, in particular regarding their working memory load.\n\nBrodmann area 6 in the middle frontal gyrus is linked with tasks that require divided attention and is part of the attentional network [68], [102]. Like in our study, participants need to split their attention, for example, on two information streams and at the same time perform a one-back task (i.e., recall an item in a sequence of items that was shown before the current item) [68]. For comprehending source code, participants also need to keep in mind the value of variables and at the same time process control flow. These two processes each require attention.\n\nWhat is also noteworthy here is that often, both BA 6 and BA 40 are found to be jointly activated for tasks that require high working-memory load [10], [11]. Especially for tasks, such as memorizing pairs of numbers or processing sentences with or without grammatical structure, which can pose a high load on working memory, a joint activation can be found, indicating that both areas are connected via neural pathways. In future studies, we will explore to what extent both areas in the frontal and parietal lobe play a joint or distinct role in bottom-up program comprehension.\n\nIn addition to other cognitive processes, BA 21, 44, and 47 are related to different facets of language processing. Numerous studies showed the involvement of all three  Brodmann areas in artificial as well as natural-language processing [4], [81], [101]. In particular, artificial-language processing is interesting, because artificial languages are based on formal grammars and limited sets of symbols, such as words or graphemes, from which letter or word sequences are created. Participants of typical artificial-language studies are asked to decide based on their intuition, after a learning period, whether sequences are grammatical or not, resulting in activation in BA 21, 44, and 47. Artificial-language processing and program comprehension are similar, since both usually built on a limited set of elements and rules; in the syntax tasks, participants apply pattern matching in order to locate the syntax errors. Based on the similarity of program comprehension to artificial-language processing, which is in turn similar to natural-language processing, we conjecture that one aspect of program comprehension involves language processing.\n\nThe posterior middle temporal gyrus (MTG) (BA 21) is closely associated with semantic processing at the word level. Both imaging and lesion studies suggest an intimate relation between the success or failure with accessing semantic information and the posterior MTG [9], [23], [108]. In our study, participants also needed to identify the meaning of written words in the source code to successfully understand the source code and its output, which was not necessary for the syntax tasks. Thus, we found evidence that understanding the meaning of single words is a necessary part of program comprehension. This may not sound too surprising, but we actually observed it in a controlled setting.\n\nThe inferior frontal gyrus (IFG) (BA 44 and BA 47) is related to combinatorial aspects in language processing, for example, processing of complex grammatical dependencies in sentences during syntactic processing [29], [40]. Several studies suggest that real-time combinatorial operations in the IFG incorporate the current state of processing and integrates incoming information into a new state of processing [42], [82]. Hence, the IFG was proposed to be involved in the unification of individual semantic features into an overall representation at the multi-word level [108]. This is closely related to bottom-up program comprehension, where participants combine words and statements to semantic chunks to understand what the source code is doing. In the syntax tasks, participants did not need to group anything to succeed.\n\nWhile we discussed several activation clusters consistently found in studies on language comprehension and processing (i.e., BAs 21,44,47), we also need to discuss the fact that not the entire network that is associated with language processing was activated [87]. Specifically, we did not detect an activation in the anterior medial temporal lobe, which is commonly associated with semantic processing of language [87]. Similarly, we did not observe an activation in the left temporal pole, which is attributed to higher-level discourse processing [60]. In the same vein, additional areas for working memory might be observed in different studies, depending on the task (e.g., BAs 32, 43, and 54), indicating that not the entire network is recruited for program comprehension. Most likely, our tasks share not all cognitive sub processes of the other tasks reported in literature, indicating that the sub processes of program comprehension might be unique and tailored to comprehending source code. However, we need further studies to dissociate program comprehension and its sub processes from other cognitive processes.\n\nIn addition to the individual Brodmann areas, there is evidence for a direct interaction among the activated areas of our comprehension task. Two separate clusters were activated in the IFG, one in BA 44 and one in BA 47, which is also suggested by other fMRI studies. BA 44 was mainly associated with core syntactic processes, such as syntactic structure building [29], [34], [35]. In contrast, BA 47 is assumed to serve as a semantic executive system that regulates and controls retrieval, selection, and evaluation of semantic information [91], [108]. Accordingly, program comprehension requires the participants to build up the underlying syntactic structures, to retrieve the meanings of the words and symbols, and to compare and evaluate possible alternatives; none of these processes is necessary to locate syntax errors.\n\nMoreover, reciprocal connections via a strong fiber pathway between BA 47 and the posterior MTG-the inferior occipito-frontal fasciculus-have been claimed to support the interaction between these areas, such that appropriate lexicalsemantic representation are selected, sustained in short-term memory throughout sentence processing, and integrated into the overall context [108]. Regarding program comprehension, we conjecture that, to combine words or symbols to statements, and statements to semantic chunks, the neural pathway between the MTG and IFG is involved.\n\n\nRQ2: Does Source-Code Complexity Correlate with Concentration Levels during Bottom-Up Program Comprehension?\n\nWith our rather small sample size and low number of snippets, the results are difficult to interpret. Nevertheless, we the analysis is very promising: The high correlation values with DepDegree and Halstead indicate that data-flow complexity and vocabulary size as operationalized by these measures modulate concentration levels of participants, which is in line with McKiernan's result of a stronger deactivation during more difficult tasks [63]. This also fits well to bottom-up comprehension, because there are no beacons to act as cues that could relieve cognitive load during comprehension. Instead, variable names remain rather abstract, and data-flow cannot easily be associated with certain variables. In the past, many attempts have been made to measure the complexity of source code. For each complexity category from which we selected a representative measure (cf. Section 4.1), a plethora of code and software measures has been proposed [46]. However, it is still largely unclear why a certain measure works in a certain context and how to design a comprehensive and feasible set of measures to assist software engineering. Which properties should a code complexity measure address? Our data indicate that data-flow aspects and possibly vocabulary size affect concentration levels of participants, but not other aspects, such as syntactic properties or control flow. While not a definite answer, the hypothesis of a connection between data-flow complexity and vocabulary size, on the one hand, and required concentration of participants, on the other hand, is an intriguing hypothesis for future research, and our experimental design and analysis show a way to investigate this in more detail. The missing correlation between programming experience (based on the experience score) and brain activation strength indicates that a higher general programming experience does not lead to a reduced cognitive effort. A follow-up study showed that top-down comprehension leads to a much lower activation strength (neural efficiency) than bottom-up comprehension [100]. However, our analysis here indicates that experienced programmers do not automatically show higher neural efficiency for a comprehension task in any programming language. Only experience in the specific programming language leads to a lower cognitive effort, as indicated by the negative correlation between knowledge of the Java programming language and brain activation. In other words, programming skills might not be efficiently transferred [79] to any domain, so an expert programmer might fall back to the neural efficiency of a novice when working with an unfamiliar language or domain. Floyd and others found a similar result in their fMRI study to analyze the difference in brain activation across programming-experience levels [33]. Their results show that program comprehension becomes increasingly similar to prose reading with higher programming experience. The strength of the correlations, especially for BAs 6 and 21, is surprising, as the experimental design was not primarily developed to address this question. This indicates that it is a very promising direction to further look into the role that the familiarity of a programming language plays for neural efficiency. The reduced activation strength in BA 21 indicates that being familiar with Java allowed our participants to be more efficient in analyzing the words and symbols of the source code. Consequently, the amount of values the participants had to keep in their working memory was reduced as well, which would explain the lower activation in BA 6. In conclusion, specific programming knowledge seems to have a strong effect on reading source code, and transferring knowledge between different programming languages is not that trivial. However, analyzing higherlevel semantics, which is represented in BAs 40, 44, and 47, seems only moderately affected by familiarity with programming languages, indicating that this cognitive process is rather independent of the underlying programming language.\n\nIt is important to note that our interpretation of the data has to be treated with caution. The sample is small and rather homogeneous, and the strength of brain activation does not necessarily equal cognitive effort. To specifically examine cognitive effort, a parametric design or an independent measure (e.g., psycho-physiological parameters of EEG) is needed. Nevertheless, RQ3 shows the opportunities that fMRI provides for software-engineering research and how this kind of analysis can be used as hypothesis-generating procedure. Follow-up studies dedicated to this research question can build on our framework and a specialized design to fully understand the relationship between brain activation strength, cognitive effort, and programming experience. Can we identify expert programmers with fMRI? How transferable are programming skills between domains and languages? Our approach to fMRI data analysis gives researchers a new perspective and tool to answer these kinds of questions.\n\n\nREPLICATION STUDY\n\nTo gain confidence in the validity of our results for RQ1 regarding neural correlates of bottom-up program comprehension, we conducted a non-exact replication of our study. To this end, we made a few alterations, with the aim of increasing external validity (in the original paper [100], we present details on the study design). First, we added new code snippets as compared to the original version, but kept a similar level of length and complexity (e.g., finding the largest number in an array of numbers or double the entries in an array). To still be able to compare the results to our original study, we also kept a subset of the original snippets. On the supplementary Web site, 7 we show all the snippets that we used. Second, we shorten the comprehension condition to 30 seconds to reduce the chance of participants finishing a task and starting to rest early, which reduces contrast strength. Third, we randomized the snippet order to exclude learning effects. Lastly, we recruited 11 new participants who did not participate in the first study. The number of participants may seem low for conventional or other neuroimaging methods. However, because program comprehension yields a high percentage signal change, the sample size is sufficiently large to find these effects [20]. To ensure comparability, we drew the sample from the same population. The participants' mean age was 25:3 AE 3:82 years, and all were familiar with Java or C at a medium level or higher.\n\nThe replication study was performed on a different MRI scanner (3 Tesla Philips dStream) using comparable measurement parameters. Because of the differences in experiment design and execution, we separately analyzed the data. We executed the same preprocessing and analysis steps, and found very promising results, such that essentially the same areas activated with a similar BOLD response (shown in Fig. 9). Specifically, we could replicate the activation in BAs 21, 40, and 44. However, there are a few differences. First, we found that Brodmann area 39 was activated, which we did not find in the first study. We suspect one reason for missing this activation in the first study due to the small difference between comprehension and 7. github.com/brains-on-code/paper-esec-fse-2017/ syntax-error finding, which we could not detect due to the rather low statistical power. In the replication, the activation was actually stronger than in the original study, so it was significant despite even smaller statistical power. BA 39 plays a crucial role as semantic hub to integrate multisensory information to form an understanding of events and solve familiar problems [95]. Thus, in future studies, we will specifically look at BA 39, even if it is not significantly activated, to further pinpoint the strength of the activation and identify its role for program comprehension. Second, we did not find an activation in BAs 6 and 47. For BA 6, it might be that subtle anatomical differences of participants might cause it to be attributed to different voxels. This assumption is strengthened by the fact that we found an activation, which can also be attributed to BA 6, in the same region close to the activation cluster of the original study. Mapping voxels to according Brodmann areas is not trivial [31], and it may be that subtle differences lead to a different mapping. For BA 47, the size of the area that the original study revealed was very small. In conjunction with the larger statistical power due to more participants and more comprehension tasks in the original study, this might explain why we could not replicate the activation of BA 47.\n\nThus, to answer RQ1, we can state that BAs 6, 21, 40, and 44 are neuronal correlates of bottom-up program comprehension. BAs 39 and 47 also seem to play a role, but it is not as clear as for the other Brodmann areas.\n\nLooking at the deactivated areas during the comprehension condition, we also found the same areas deactivated as in the original study, that is BA 31ant, BA 31post, and BA 32 (cf. Fig. 5).\n\nWe were not the only ones to replicate our study. Based on the same snippets, but with EEG, Lee and others found BAs 6 and 44 activated, indicating their consistent role during bottom-up program comprehension (see Section 10 for more details) [59]. Thus, the results our replication and of the study by Lee and others are very encouraging and strengthen the validity of our experimental design. They encourage us to keep using fMRI (and other neuro-imaging techniques) to better understand program comprehension and other related cognitive processes.\n\nWe did not analyze RQs 2 and 3 in the replication study, because the purpose of these RQs was to show the potential of fMRI. Although we increased external validity with the replication, we still did not design enough variability in the source-code snippets and sample to meaningfully answer these questions. In the future, we will further carefully increase external validity to also answer such questions.\n\n\nIMPLICATIONS FOR PROGRAM COMPREHENSION\n\nHaving identified activated and deactivated clusters and discussed their role for program comprehension in relation to other studies, we can now discuss the results from a higher level of abstraction. Specifically, we can hypothesize what a cognitive model of bottom-up program comprehension can look like. To understand source code, participants analyzed words and symbols and grouped them into semantic chunks. To this end, they need the language network of BAs 21, 44, and 47 that we found in our study. Additionally, BA 39 in both hemispheres might play a role during the integration. At the same time, participants manipulate the values of numbers and words according to the intention of the source code. For this, they need to keep the values of the manipulated words and numbers in their mind, which is related to BAs 6 and 40. All parts, that is, semantic analysis of source code, manipulating the values of variables, and storing them in working memory, happens in parallel, for which participants need to divide their attention (located in BA 6). At the same time, with rising concentration levels, parts of the default mode network deactivated not to interfere with comprehending the source code. With increasing complexity of source-code snippets, the deactivation also gets stronger, indicating higher concentration levels. We illustrate this process in Fig. 10.\n\nBased on this model, we can hypothesize what influences program comprehension. For example, if we increase the number of variables beyond the working memory capacity of programmers, program comprehension should be impaired. Or, if we increase the complexity of source code, we might observe a parametrically stronger deactivation of the default mode network (more discussion in Section 11).\n\n\nTHREATS TO VALIDITY\n\nInherent to our study design, there are threats to specific kinds of validity, which we discuss next.\n\n\nInternal Validity\n\nWe performed several steps to interpret the data. Especially, when deciding which cognitive processes for each Brodmann area are relevant, we might have missed important processes. As a consequence, our interpretation might have led to a different comprehension model. To reduce this threat, we discussed among the author team, which combines expertise from psychology, neurobiology, linguistics, as well as computer science and software engineering, for each process whether it might be related to our comprehension tasks. Additionally, all processes that are known to be associated with these Brodmann areas are available on the project's Web site.\n\n\nExternal Validity\n\nThe source-code snippets that we selected were comparatively short, at most, 18 lines of code. Furthermore, we focused on bottom-up comprehension, and we explicitly avoided scrolling or typing to reduce any motion-related artifacts as far as possible. Thus, we focused on only one aspect of the complex comprehension process and cannot generalize our results to programming in the large-clearly, more studies have to follow. Nevertheless, it is conceptually possible to use a more complex setting, even tasks that last for several hours, and our results encourage us to try such larger settings in future studies, possibly also with other neuro-imaging techniques (see Section 2.5).\n\nAnother threat is that we kept the background of our participants, such as their programming experience and culture, constant to reduce the variability of the outcome. Furthermore, we did not control for gender of participants, which might bias the results, in that women show a tendency to prefer bottom-up comprehension [32]. Thus, we can generalize our results only carefully. In the next section, we outline, among others, how such personal differences might affect program comprehension.\n\n\nConstruct Validity\n\nFurthermore, we cannot be entirely certain to what extent we ensured bottom-up comprehension. It is possible that participants recognized some algorithms, as they were taken from typical introductory courses. However, since we obfuscated identifier names and the time per source-code snippet was relatively short, we can assume that participants used bottom-up comprehension most of the time; this conjecture is supported by the fact that we did not observe activation in typical memory-related areas.\n\n\nRELATED WORK\n\n\nNeuroscience\n\nIn the neuroscience domain, several studies exist that also study tasks related to comprehension and detection of syntax errors. However, these studies, several of which were discussed in Section 6, use tasks involving only English words and sentences, not programs. The following studies are particularly interesting, because they revealed the same Brodmann areas as our study: In studies related to reading comprehension and language processing, participants had to understand text passages or decide whether sequences of letters can be produced with rules of a formal grammar [4], [9], [23], [29], [34], [35], [40], [42], [81], [82], [101], [108]. Regarding working memory, participants had to identify and apply rules or memorize verbal/numerical material [3], [66], [86], [103]. In divided-attention tasks, participants had to detect two features of objects at the same time [109].\n\nFurther work is needed to distinguish and dissociate brain activity related to program comprehension from other similar activities, such as word comprehension, and to allow us to develop a full model of program comprehension. Some researchers have already begun to theorize what a brainbased model of program comprehension would look like. Hansen and others propose to use the cognitive framework ACT-R to model program comprehension [45]. Parnin compiled a literature review of cognitive neuroscience and proposed a model for understanding different memory types and brain areas exercised by different types of programming tasks [75]. Both approaches are similar to our work by exploring knowledge of the neuroscience domain.\n\n\nSoftware Engineering\n\nWith our fMRI study paving the way, other studies have followed. Specifically, Floyd and others conducted an fMRI study based on comprehension of source code and naturallanguage text [33]. In contrast to our work, the authors used the resulting activation pattern to predict the tasks that participants were completing. Duraes and others used fMRI to record activations during defect detection of software [15], [24]. The results indicate that initially finding and confirming a defect leads to different activation strength, especially in the right anterior insula.\n\nAdditionally, researchers are using other neuro-imaging techniques to observe programmers. Nakagawa and others used near-infrared spectroscopy (fNIRS) to measure changes in blood flow while programmers mentally executed source code. They found activation in the prefrontal cortex (a brain area that is necessary for higher-order cognitive processes), which correlated with the difficulty of a task [67]. In a similar study, Ikutani and Uwano found that activation in the frontal pole increases when participants memorized variables names, without manipulating their values [49].\n\nKluthe used electroencephalography (EEG) to measure program comprehension of participants with varying levels of expertise [55]. He let participants mentally execute the code and asked them to determine the output of source-code snippets. He found that, with lower expertise, programcomprehension tasks were more difficult to solve, indicating a higher cognitive load, which was reflected in the EEG signals. Lee and others used a similar experiment setup as we did, but also used EEG to record brain activation [59]. They found a subset of brain areas activated (i.e., Brodmann areas 6 and 44), confirming our findings on the role of these areas for bottom-up program comprehension.\n\nIn a follow-up study, Lee and others combined EEG with eye tracking to predict task difficulty and programmer expertise [58]. In this study, participants should comprehend source-code snippets similar to the ones in our study. In the same vein, we have conducted a further non-exact replication of our study and integrated eye tracking with the fMRI scanner [77], [78]. We could successfully map the eye movements of participants to their BOLD response. Fritz and others used three psycho-physiological measures-EEG, eye tracker, and electrodermal-activity sensor-to predict the difficulty of programming tasks [36]. Participants were required to mentally execute code that drew rectangles and decide whether rectangles overlap or determine the order in which rectangles were drawn. The authors found that these measures are promising to predict task difficulty. Fakhoury and others used functional near-infrared spectroscopy (fNIRS) and eye tracking to show how the quality of identifier names affects cognitive load [26]. They found that unsuitable identifier names increase cognitive load.\n\nThus, neuro-imaging studies are becoming more and more prevalent in software-engineering research.\n\n\nFUTURE DIRECTIONS\n\nWith our study, we show that measuring program comprehension with an fMRI scanner is feasible and can result in a plausible activation pattern. But, how does our study contribute to software-engineering research, education, and practice?\n\nWhile our study provides only limited direct answers, it raises many interesting and substantial questions for future research: What are the underlying cognitive processes during top-down comprehension or the implementation of source code? How should we train programmers? How should we design programming languages and tools? Can software measures capture how difficult source code will be to comprehend?\n\nTop-Down Comprehension. In our experiment, we focused on bottom-up comprehension to minimize additional activation. In an ongoing family of experiments, we are evaluating how participants use top-down comprehension and their memory to understand source code [100]. To this end, we show similar source-code snippets without obfuscating identifier names, and observe to what extent they serve as beacons for participants. Additionally, we ensure that participants are familiar with the source-code snippets. In this setting, we would expect activation of typical memory areas, such as Brodmann areas 44 and 45 in the inferior frontal gyrus or Brodmann area 10 in the anterior prefrontal cortex [14]. However, we did not find such an activation. By adding simultaneous eye tracking to our experiment framework [78], we have been evaluating whether participants fixate on beacons or familiar elements shorter or longer than unfamiliar statements, and how that gazing is related to neural activity [77]. Digging deeper in further studies, we may ask at which experience level beginners start using their previous knowledge? To what extent does the knowledge of the domain and other concepts, such as design patterns, influence activation patterns?\n\nMeasuring Complexity of Source Code. In the past, many attempts have been made to use software measures, such as code complexity [46], to understand why certain programming constructs or idioms may be more difficult to understand. Recent studies have tried to predict comprehensibility of source code based on a combination of software measures, but could only show small predictive power [94], [107]. All these approaches suffer from two main limitations: (1) software measures lack justification for cognitive outcomes; as a result, current software measures have poor predictive power on program comprehension [27], and (2) software measures are not explanatory, and cannot provide an answer to why certain constructs are more difficult than others.\n\nCan we create cognition-based software measures to overcomes these limitations? We hypothesize that, in the future, such software measures will provide better predictions for assessing difficulty of source code.\n\nMeasuring Programmer Expertise. Despite similar education or experience, researchers have observed a significant gap between top developers and average developers, typically reported as a factor of 10 in terms of productivity [17], [19], [92]. However, nobody knows exactly how these top developers became top developers-they just are excellent. This raises many questions about to what extent we can train programmers at all. Alternatively, we can ask whether it is possible to predict whether somebody is inclined to become an excellent programmer [76].\n\nTo answer such questions, we need to know how an excellent programmer differs from an average programmer. Interestingly, characteristics of experts have been studied in many fields. For example, in an fMRI study, musicians showed a much lower activation in motor areas when executing hand tapping than non-musicians [50], and expert golfers, compared to novices, showed a considerably smaller activation pattern when imagining hitting a golf ball, because they have somewhat abstracted the activity [64]. Another example are superior memorizers, who rely on specific strategies that build on visual information related to spatial landmarks when encoding large bits of information. Thus, compared to normal controls, superior memorizers recruit other brain regions, that is, those involved in visual processing and navigation [61].\n\nIn our study, we demonstrated how we can use brain activation strength, programming experience, and cognitive effort to better understand program comprehension. In the future and with dedicated studies, this may allow an objective assessment of programmer expertise beyond the standard skill tests and interviews.\n\nImplementing Source Code. What happens when people implement source code, instead of only understanding it? Writing source code is a form of synthesizing new information, compared to analytical program comprehension. Consequently, we might observe activation of several righthemispheric regions, such as right BA 44 and BA 47 for speech production. It would be interesting to study whether and how writing source code is similar to and different from speech production. Initial evidence suggests that developers had high levels of subvocal speech while editing code [74].\n\nTraining. There are many discussions about the best way to teach computer science and software engineering [18], [57], [97]. The close relationship to language processing raises the question of whether it is beneficial to learn a programming language at an early age or to learn multiple programming languages right from the beginning, which is often a controversial issue in designing computer-science curricula.\n\nThe involvement of working memory and attention may indicate that both should be trained during programming education. So, it is certainly worth exploring whether program comprehension can be improved by training specific cognitive abilities (e.g., through puzzle games). However, researchers disagree to what extent both can be learned or are rather inborn [25], [104], [112]. Thus, a test prior to programming education [54], [71] might reveal which students might struggle with learning programming. Especially, when thinking of dyslexics, who often have poorer short-term memory and reading skills compared to non-dyslexics [85], we may expect they struggle; however, many dyslexics report that they can work with better focus during programming, because of syntax highlighting and other features [85]. Thus, unraveling the mind of dyslexics might give us interesting insights into program comprehension in general.\n\nHaving found a strong involvement of language processing suggests that we need excellent language skills to become excellent programmers. Thus, if we loved learning new languages, we might also more easily learn new programming languages. It may be worthwhile to start learning a new (programming) language early on during childhood, because studies showed that learning a second language early can have benefits regarding cognitive flexibility, metalinguistic, divergent thinking skills, and creativity [21]. Similarly, training computational thinking, a fundamental skill for computer scientists [111], prior to learning programming might also give novices a better start with learning programming, for example, to correctly specify unexpected states in a program [41].\n\nFurthermore, excellent programmers may approach program comprehension differently. Understanding the differences may offer us insights into how to teach beginners and, in the long run, develop guidelines for teaching programming.\n\nProgramming-Language Design. Traditionally, designing programming languages only marginally involves empirical evidence of programmers and how they work with source code. Instead, experience and plausibility are used, such as: \"As the world consists of objects, object-oriented programming is an intuitive way to program\", \"As recursion is counter-intuitive, recursive algorithms are difficult to understand\", or \"Java shall be similar to C/C++, such that many developers can easily learn it.\" While experience and common sense are certainly valuable and may hint at some directions on how to design programming languages, many design decisions that arise from them have-to the best of our knowledge-only rarely been tested empirically (e.g., see Hanenberg [44]).\n\nIn our experiment, we have explored only small imperative-style code fragments with only few language constructs. It would be interesting to investigate whether there are fundamentally different activations when using more complex language constructs or using a functional or object-oriented style. For example, when we let developers understand object-oriented source code, we should observe activation in typical object-processing areas (e.g., BA 19 or 37), if real-world objects and object-oriented programming are similar, which is a frequently stated claim. The design of individual programming languages as well as entire programming paradigms may greatly benefit from insights about program comprehension gained by fMRI.\n\nFurthermore, having identified a close similarity to language processing, we can further investigate how different or similar both processes are. To this end, we envision letting participants read and comprehend natural-language descriptions as control tasks, instead of finding syntax errors; computing the difference in activation patterns, we will see how reading comprehension and program comprehension differ (if they differ at all). We also envision studies to explore the influence of natural programming languages [65] on comprehension, and how comprehension of natural languages, dead languages (e.g., Latin), and programming languages differ.\n\nAdditionally, some researchers believe that the mother tongue influences how native speakers perceive the world (Sapir-Whorf hypothesis) [93], [110]. Since programming languages are typically based on English, Western cultures, as compared to Asian cultures, might have a headstart when learning programming [5]. Taking a closer look at how developers from both cultures understand source code might give us valuable insights for teaching programming.\n\nSoftware and Tool Design. Many questions regarding software design, modularity, and development tools arise in software engineering. For instance, the typical approach to hierarchically decompose a software system is challenged by the presence of crosscutting concerns [106], but the extent to which developers naturally decompose a software system is unknown. Ostermann and others argued that traditional notions of modularity assume a model based on classical logic that differs from how humans process information (e.g., humans use inductive reasoning, closed-world reasoning, and default reasoning, which are all unsound in classical logic) [73]. Thus, we may need more natural concepts of modularity.\n\nThere has been considerable research in tool-based solutions for organizing and navigating software [39], [51], [52], [53], [89]. Considering navigation support, understanding how to support cognitive processes related to spatial abilities and to determine whether a given tool actually does support those abilities, might improve comprehension, provide a more disciplined framework for designing tools, and influence how we design software.\n\n\nCONCLUSION\n\nTo shed light on the process of program comprehension, we used a relatively new technique: functional magnetic resonance imaging (fMRI). While in cognitive neuroscience it has been used for more than 25 years now, we explored how fMRI can be applied to measure the complex cognitive process of comprehending source code. To this end, we selected twelve source-code snippets that 17 + 11 participants should comprehend, which we contrasted with locating syntax errors.\n\nThe key results are: A clear activation pattern of five different brain regions, which are associated with working memory (BA 6, BA 40), attention (BA 6), and language processing (BA 21, BA 44, BA 47)-all fit well to our understanding of bottom-up program comprehension. A left-dominant activation, suggesting that language processing seems to be essential for program comprehension, which Dijkstra already noted [22]. With our study, we found first empirical evidence that Dijkstra may be right, which may have implications for teaching, such that training language skills, in addition to working memory and problem solving, might make programming education more efficient. An illustration of the potential of fMRI to develop cognitive-based complexity measures, and to relate programming experience and knowledge of the Java programming language to neural efficiency. A consistent result in two studies that reused our experimental design, indicating the validity of our experiment framework. As a further contribution, our experience and methodology lowers the barrier for further fMRI studies. We hope that fMRI becomes a standard research tool in empirical software engineering, so that we and other researchers can understand how developers understand source code and refine existing models of program comprehension into a unified theory, so that we can eventually tackle the big questions in this area: How do people use domain knowledge? To what extent is implementing source code a creative process? Can we train someone to become an excellent programmer? How should we design programming languages and tools for optimal developer support? Can software measures predict the comprehensibility of source code?\n\n\nACKNOWLEDGMENTS\n\nWe thank all participants of both fMRI studies and the pilot studies. Furthermore, we thank J€ org Liebig for his support in conducting the first pilot study and Andreas F€ ugner for providing photos. Siegmund's and Brechmann's work is supported by DFG grants SI 2045/2-1 and BR 2267/7-1. Siegmund's work is further funded by the Bavarian State Ministry of Education, Science and the Arts in the framework of the Centre Digitisation.Bavaria (ZD.B). Apel's work has been supported by DFG grants AP 206/4, AP 206/5, and AP 206/6, and Kaestner's work by NSF awards 1318808 and 1552944, AFRL and DARPA (FA8750-16-2-0042), as well as in part by ERC grant #203099. Parnin's work is supported by NSF award 1755762. Norman Peitek received the master's degree in business information systems from the University of Magdeburg, in 2014. He is working toward the PhD degree at the University of Passau, Germany. His research focuses on studying program comprehension with neuro-imaging methods. Janet Siegmund received the two master's degrees, one in computer science and one in psychology, and the PhD degree from the University of Magdeburg, in 2012. She is currently working at the University of Passau, where she is leading the junior research group PICCARD, funded by the Centre Digitisation.Bavaria. In her research, she focuses on the human factor in software engineering, for example, when writing source code. She is the co-author of more than 30 peer-reviewed journal, conference, and workshop publications. She regularly serves as program-committee member for conferences and workshops. From 2014 to 2017, she was in the steering committee of the International Conference on Program Comprehension.\n\nSven Apel received the PhD degree in computer science from the University of Magdeburg, Germany, in 2007. He holds the chair of software engineering at the University of Passau, Germany. The chair is funded by the esteemed Emmy-Noether and Heisenberg Programs of the German Research Foundation (DFG). His research interests include software product lines, software analysis, optimization, and evolution, as well as empirical methods and the human factor in software engineering.\n\nChristian K€ astner received the PhD degree from the University of Magdeburg, Germany, in 2010, for his work on virtual separation of concerns. He is an assistant professor with the School of Computer Science, Carnegie Mellon University. For his dissertation he received the prestigious GI Dissertation Award. His research interests include correctness and understanding of systems with variability, including work on implementation mechanisms, tools, variability-aware analysis, type systems, feature interactions, empirical evaluations, and refactoring.\n\nChris Parnin received the PhD degree from the Georgia Institute of Technology. He is an assistant professor with the Department of Computer Science, North Carolina State University. He has published more than 50 articles in software engineering and HCI. Anja Bethmann received the diploma and PhD degrees in linguistics from the Potsdam University, in 2004 and 2012, respectively. Her research interest is in the neural mechanisms of semantic processing in the human brain as studied with functional MRI with a special focus on anterior temporal lobe function. Furthermore, she is interested in the rehabilitation of aphasia and active in the Saxony-Anhalt's patient organization on aphasia.\n\nThomas Leich received the diploma degree in business information systems and the PhD degree from the University of Magdeburg, in 2004 and 2012, respectively. Since 2013 he is general manager of the METOP GmbH. Since 2014 he is professor at the chair of Business Information Systems at Harz University of Applied Sciences. His research interests include requirements and software product-line engineering as well as measurement of program comprehension.\n\nGunter Saake received the PhD degree from University of Braunschweig, in 1988. Currently, he is the head of the Databases and Software Engineering Group, University of Magdeburg. He is a full professor of Computer Science. His research interests include database integration, tailor-made data management, database management on new hardware, and feature-oriented software product lines.\n\nAndr e Brechmann received the diploma degree in biology from the University of Bielefeld, in 1997, and the PhD degree in neuroscience from the Otto-von-Guericke University Magdeburg, in 2002. He is head of the Special-Lab Non-Invasive Brain Imaging at the Leibniz Institute (LIN) for Neurobiology Magdeburg since 2004. In 2004 he was visiting researcher with the Martinos Center for Biomedical Imaging (MGH in Boston) in preparation of the installation of Europe's first 7 Tesla MRI at LIN. Since 2012 he is coordinator of the Combinatorial NeuroImaging Core Facility (CNI) at LIN. His research interests include the dynamics and individuality of learning and memory processes in the human brain with a special focus on auditory cognition as well as other domains such as human-computer-interaction and program comprehension.\n\nFig. 1 .\n1Workflow of our fMRI study.\n\nFig. 2 .\n2Source code for one comprehension task with expected output 'olleH'.\n\nFig. 3 .\n3Source code for a syntax task with errors in Line 1, 2, and 8.\n\nFig. 4 .\n4Observed activation pattern for program comprehension and time courses of the BOLD response for each cluster. The time course in light gray is the BOLD response for the contrasting syntax condition. The shaded area around each time course depicts the standard deviation based on the participants. BA: Brodmann area.\n\nFig. 5 .\n5Significant deactivation during program comprehension in the default mode network. The figure on the left visualizes the significantly deactivated areas and their location in the brain.\n\nFig. 6 .\n6Scatterplot of software measures and strength of deactivation of BA 31ant, BA 31post, and BA 32. Each dot represents one comprehension task. The strength of deactivation is the average beta value across all participants.\n\nFig. 7 .\n7Scatterplot of programming experience and activation strength of BA 6, BA 21, BA 40, BA 44, and BA 47. Each dot represents one participant. The strength of activation for each cluster is the average beta value across all snippets.\n\nFig. 8 .\n8Scatterplot of Java knowledge and activation strength of BA 6, BA 21, BA 40, BA 44, and BA 47. Each dot represents one participant. The strength of activation for each cluster is the average beta value across all snippets.\n\nFig. 9 .\n9Brodmann-area activation in replication study.\n\nFig. 10 .\n10Visualization of how bottom-up program comprehension might take place.\n\nTABLE 1\n1Correlation Values between the Four Chosen \nSoftware Measures for Our Twelve \nSource-Code Snippets (cf. Table 2) \n\nCorrelation \n\nDepDegree \nLOC \n0.19 \nDepDegree \nMcCabe \n0.44 \nDepDegree \nHalstead \n0.63 \nLOC \nMcCabe \n0.41 \nLOC \nHalstead \n0.62 \nMcCabe \nHalstead \n0.59 \n\n\nTABLE 2\n2Description of Source-Code Snippets Used in the Study, Ordered by the Appearance of the Comprehension Task One row represents the snippets of one trial. Column Comprehension denotes a snippet to be comprehended, column Syntax denotes the snippet of the same trial for which participants should locate syntax errors. The middle columns show the software measures of each comprehension snippet.Comprehension \nLOC \nMcCabe \nHalstead \nDepDegree \nSyntax \n\nFactorial \n9 \n2 \n8.88 \n11 \nDecimal to binary \nCheck substring \n15 \n3 \n15.28 \n14 \nCross sum \nLargest number \n8 \n3 \n11.19 \n17 \nReverse array \nReverse word \n7 \n2 \n10.71 \n13 \nCheck substring \nSwap \n9 \n1 \n6.77 \n5 \nMaximum in array \nPower \n9 \n2 \n10.40 \n12 \nReverse word \nMedian \n11 \n2 \n16.12 \n8 \nFactorial \nReverse array \n11 \n3 \n18.35 \n25 \nSwap \nCross sum \n9 \n2 \n11.50 \n11 \nMedian \nLargest of three numbers \n11 \n7 \n15.86 \n15 \nPower \nCount same chars \n15 \n4 \n17.29 \n15 \nLargest of three numbers \nDecimal to binary \n12 \n3 \n14.00 \n16 \nCount same chars \n\n\n\n\n: During bottom-up program comprehension, Brod-mann areas 6, 21, 40, 44, and 47 are activated. \n\n5.2 RQ2: Does Source-Code Complexity Correlate \nwith Concentration Levels during Bottom-Up \nProgram Comprehension? \n\n\nPEITEK ET AL.: A LOOK INTO PROGRAMMERS' HEADS\n\" For more information on this or any other computing topic, please visit our Digital Library at www.computer.org/publications/dlib.\n\nStudy design in fMRI: Basic principles. E AmaroJr, G J Barker, Brain Cognition. 603E. Amaro Jr and G. J. Barker, \"Study design in fMRI: Basic principles,\" Brain Cognition, vol. 60, no. 3, pp. 220-232, 2006.\n\nCognitive and metacognitive activity in mathematical problem solving: Prefrontal and parietal patterns. J Anderson, S Betts, J Ferris, J Fincham, Cognitive Affect. Behavioral Neuroscience. 111J. Anderson, S. Betts, J. Ferris, and J. Fincham, \"Cognitive and metacognitive activity in mathematical problem solving: Pre- frontal and parietal patterns,\" Cognitive Affect. Behavioral Neuro- science, vol. 11, no. 1, pp. 52-67, 2011.\n\nDissociation of storage and rehearsal in verbal working memory: Evidence from positron emission tomography. E Awh, J Jonides, E Smith, E Schumacher, R Koeppe, S Katz, Psychological Sci. 71E. Awh, J. Jonides, E. Smith, E. Schumacher, R. Koeppe, and S. Katz, \"Dissociation of storage and rehearsal in verbal working memory: Evidence from positron emission tomography,\" Psycho- logical Sci., vol. 7, no. 1, pp. 25-31, 1996.\n\nHierarchical artificial grammar processing engages Broca's area. J Bahlmann, R Schubotz, A Friederici, NeuroImage. 422J. Bahlmann, R. Schubotz, and A. Friederici, \"Hierarchical arti- ficial grammar processing engages Broca's area,\" NeuroImage, vol. 42, no. 2, pp. 525-534, 2008.\n\nThe geography of programming. E Baniassad, S Fleissner, Proc. Int. Conf. Object-Oriented Program. Syst., Languages Appl. Int. Conf. Object-Oriented Program. Syst., Languages ApplE. Baniassad and S. Fleissner, \"The geography of programming,\" in Proc. Int. Conf. Object-Oriented Program. Syst., Languages Appl., 2006, pp. 510-520.\n\nControlling the false discovery rate: A practical and powerful approach to multiple testing. Y Benjamini, Y Hochberg, J. Roy. Statistical Soc.. Series B (Methodological). 571Y. Benjamini and Y. Hochberg, \"Controlling the false discovery rate: A practical and powerful approach to multiple testing,\" J. Roy. Statistical Soc.. Series B (Methodological), vol. 57, no. 1, pp. 289-300, 1995.\n\nDetermining language laterality by fMRI and dichotic listening. A Bethmann, C Tempelmann, R De, H Bleser, A Scheich, Brechmann, Brain Res. 11331A. Bethmann, C. Tempelmann, R. De Bleser , H. Scheich, and A. Brechmann, \"Determining language laterality by fMRI and dichotic listening,\" Brain Res., vol. 1133, no. 1, pp. 145-157, 2007.\n\nA simple and effective measure for complex low-level dependencies. D Beyer, A Fararooy, Proc. Int. Conf. Program Comprehension. Int. Conf. Program ComprehensionD. Beyer and A. Fararooy, \"A simple and effective measure for complex low-level dependencies,\" in Proc. Int. Conf. Program Comprehension, 2010, pp. 80-83.\n\nWhere is the semantic system? A critical review and meta-analysis of 120 functional neuroimaging studies. J Binder, R Desai, W Graves, L Conant, Cerebral Cortex. 1912J. Binder, R. Desai, W. Graves, and L. Conant, \"Where is the semantic system? A critical review and meta-analysis of 120 functional neuroimaging studies,\" Cerebral Cortex, vol. 19, no. 12, pp. 2767-2796, 2009.\n\nBrain signature of working memory for sentence structure: Enriched encoding and facilitated maintenance. C Bonhage, C Fiebach, J Bahlmann, J Mueller, J. Cognitive Neuroscience. 268C. Bonhage, C. Fiebach, J. Bahlmann, and J. Mueller, \"Brain sig- nature of working memory for sentence structure: Enriched encoding and facilitated maintenance,\" J. Cognitive Neuroscience, vol. 26, no. 8, pp. 1654-1671, 2014.\n\nA common prefrontal/parietal network for mnemonic and mathematical recoding strategies within working memory. D Bor, A Owen, Cerebral Cortex. 174D. Bor and A. Owen, \"A common prefrontal/parietal network for mnemonic and mathematical recoding strategies within working memory,\" Cerebral Cortex, vol. 17, no. 4, pp. 778-786, 2007.\n\nBrodmann's Localisation in the Cerebral Cortex. K Brodmann, SpringerBerlin, GermanyK. Brodmann, Brodmann's Localisation in the Cerebral Cortex. Berlin, Germany: Springer, 2006.\n\nUsing a behavioral theory of program comprehension in software engineering. R Brooks, Proc. Int. Conf. Softw. Eng. Int. Conf. Softw. EngR. Brooks, \"Using a behavioral theory of program comprehen- sion in software engineering,\" in Proc. Int. Conf. Softw. Eng., 1978, pp. 196-201.\n\nImaging cognition II: An empirical review of 275 PET and fMRI studies. R Cabeza, L Nyberg, J. Cognitive Neuroscience. 121R. Cabeza and L. Nyberg, \"Imaging cognition II: An empirical review of 275 PET and fMRI studies,\" J. Cognitive Neuroscience, vol. 12, no. 1, pp. 1-47, 2000.\n\nThe role of the insula in intuitive expert bug detection in computer code: An fMRI study. J Castelhano, I C Duarte, C Ferreira, J Duraes, H Madeira, M Castelo-Branco, Brain Imag. Behavior. J. Castelhano, I. C. Duarte, C. Ferreira, J. Duraes, H. Madeira, and M. Castelo-Branco, \"The role of the insula in intuitive expert bug detection in computer code: An fMRI study,\" Brain Imag. Behavior, pp. 1-15, May 2018.\n\nCognition-activated low-frequency modulation of light absorption in human brain. B Chance, Z Zhuang, C Unah, C Alter, L Lipton, Proc. National Academy Sci. United States America. 908B. Chance, Z. Zhuang, C. UnAh, C. Alter, and L. Lipton, \"Cognition-activated low-frequency modulation of light absorp- tion in human brain,\" Proc. National Academy Sci. United States America, vol. 90, no. 8, pp. 3770-3774, 1993.\n\nSome basic determinants of computer programming productivity. E Chrysler, Commun. ACM. 216E. Chrysler, \"Some basic determinants of computer program- ming productivity,\" Commun. ACM, vol. 21, no. 6, pp. 472-483, 1978.\n\nTeaching objects-first in introductory computer science. S Cooper, W Dann, R Pausch, Proc. Tech. Symp. Tech. SympS. Cooper, W. Dann, and R. Pausch, \"Teaching objects-first in introductory computer science,\" in Proc. Tech. Symp. Comput. Sci. Edu., 2003, pp. 191-195.\n\nExploring individual characteristics and programming performance: Implications for programmer selection. D Darcy, M Ma, Proc. Annu. Hawaii Int. Conf. Syst. Sci. Annu. Hawaii Int. Conf. Syst. SciD. Darcy and M. Ma, \"Exploring individual characteristics and programming performance: Implications for programmer selection,\" in Proc. Annu. Hawaii Int. Conf. Syst. Sci., 2005, pp. 314a-314a.\n\nEstimating sample size in functional MRI (fMRI) neuroimaging studies: Statistical power analyses. J E Desmond, G H Glover, J. Neuroscience Methods. 1182J. E. Desmond and G. H. Glover, \"Estimating sample size in func- tional MRI (fMRI) neuroimaging studies: Statistical power analy- ses,\" J. Neuroscience Methods, vol. 118, no. 2, pp. 115-128, 2002.\n\nThought and two languages: The impact of bilingualism on cognitive development. R Diaz, Rev. Res. Edu. 10R. Diaz, \"Thought and two languages: The impact of bilingual- ism on cognitive development,\" Rev. Res. Edu., vol. 10, pp. 23-54, 1983.\n\nHow do we tell truths that might hurt?. E Dijkstra, Selected Writings on Computing: A Personal Perspective. Berlin, GermanySpringerE. Dijkstra, \"How do we tell truths that might hurt?,\" in Selected Writings on Computing: A Personal Perspective. Berlin, Germany: Springer, 1982, pp. 129-131.\n\nLesion analysis of the brain areas involved in language comprehension. N Dronkers, D Wilkins, R Van Valin, B Jr, J Redfern, Jaeger, Cognition. 921-2N. Dronkers, D. Wilkins, R. Van Valin, Jr, B. Redfern, and J. Jaeger, \"Lesion analysis of the brain areas involved in language comprehension,\" Cognition, vol. 92, no. 1-2, pp. 145-177, 2004.\n\nWAP: Understanding the brain at software debugging. J Duraes, H Madeira, J Castelhano, C Duarte, M C Branco, Proc. Int. Symp. Softw. Rel. Eng. Int. Symp. Softw. Rel. EngJ. Duraes, H. Madeira, J. Castelhano, C. Duarte, and M. C. Branco, \"WAP: Understanding the brain at software debugging,\" in Proc. Int. Symp. Softw. Rel. Eng., 2016, pp. 87-92.\n\nIndividual differences in working memory capacity and what they tell us about controlled attention, general fluid intelligence, and functions of the prefrontal cortex. R Engle, M Kane, S Tuholski, Models of Working Memory. Cambridge, U.K.Cambridge Univ. PressR. Engle, M. Kane, and S. Tuholski, \"Individual differences in working memory capacity and what they tell us about controlled attention, general fluid intelligence, and functions of the prefron- tal cortex,\" in Models of Working Memory, Cambridge, U.K.: Cambridge Univ. Press, 1999, pp. 102-134.\n\nThe effect of poor source code lexicon and readability on developers' cognitive load. S Fakhoury, Y Ma, V Arnaoudova, O Adesope, Proc. Int. Conf. Program Comprehension. Int. Conf. Program ComprehensionS. Fakhoury, Y. Ma, V. Arnaoudova, and O. Adesope, \"The effect of poor source code lexicon and readability on developers' cogni- tive load,\" in Proc. Int. Conf. Program Comprehension, 2018, pp. 286-296.\n\nExploring software measures to assess program comprehension. J Feigenspan, S Apel, J Liebig, C , Proc. Int. Symp. Int. SympJ. Feigenspan, S. Apel, J. Liebig, and C. K€ astner, \"Exploring soft- ware measures to assess program comprehension,\" in Proc. Int. Symp. Empirical Softw. Eng. Meas., 2011, pp. 1-10.\n\nMeasuring programming experience. J Feigenspan, C Astner, J Liebig, S Apel, S Hanenberg, Proc. Int. Conf. Program Comprehension. Int. Conf. Program ComprehensionJ. Feigenspan, C. K€ astner, J. Liebig, S. Apel, and S. Hanenberg, \"Measuring programming experience,\" in Proc. Int. Conf. Pro- gram Comprehension, 2012, pp. 73-82.\n\nRevisiting the role of Broca's area in sentence processing: Syntactic integration versus syntactic working memory. C Fiebach, M Schlesewsky, G Lohmann, D Von Cramon, A Friederici, Human Brain Mapping. 242C. Fiebach, M. Schlesewsky, G. Lohmann, D. von Cramon, and A. Friederici, \"Revisiting the role of Broca's area in sentence processing: Syntactic integration versus syntactic working mem- ory,\" Human Brain Mapping, vol. 24, no. 2, pp. 79-91, 2005.\n\nOn the maintainability of aspect-oriented software: A concern-oriented measurement framework. E Figueiredo, C Sant&apos;anna, A Garcia, T Bartolomei, W Cazzola, A Marchetto, Proc. nullE. Figueiredo, C. Sant'Anna, A. Garcia, T. Bartolomei, W. Cazzola, and A. Marchetto, \"On the maintainability of aspect-oriented soft- ware: A concern-oriented measurement framework,\" in Proc.\n\n. Europ. Conf. Softw. Maintenance Reengineering. Europ. Conf. Softw. Maintenance Reengineering, 2008, pp. 183-192.\n\nCortical folding patterns and predicting cytoarchitecture. B Fischl, N Rajendran, E Busa, J Augustinack, O Hinds, B Yeo, H Mohlberg, K Amunts, K Zilles, Cerebral Cortex. 188B. Fischl, N. Rajendran, E. Busa, J. Augustinack, O. Hinds, B. Yeo, H. Mohlberg, K. Amunts, and K. Zilles, \"Cortical folding pat- terns and predicting cytoarchitecture,\" Cerebral Cortex, vol. 18, no. 8, pp. 1973-1980, 2008.\n\nUsing sex differences to link spatial cognition and program comprehension. M Fisher, A Cox, L Zhao, Proc. Int. Conf. Softw. Maintenance. Int. Conf. Softw. MaintenanceM. Fisher, A. Cox, and L. Zhao, \"Using sex differences to link spatial cognition and program comprehension,\" in Proc. Int. Conf. Softw. Maintenance, 2006, pp. 289-298.\n\nDecoding the representation of code in the Brain: An fMRI study of code review and expertise. B Floyd, T Santander, W Weimer, Proc. 39th Int. Conf. Softw. Eng. 39th Int. Conf. Softw. EngB. Floyd, T. Santander, and W. Weimer, \"Decoding the represen- tation of code in the Brain: An fMRI study of code review and expertise,\" in Proc. 39th Int. Conf. Softw. Eng., 2017, pp. 175-186.\n\nTowards a neural basis of auditory sentence processing. A Friederici, Trends Cognitive Sci. 62A. Friederici, \"Towards a neural basis of auditory sentence proc- essing,\" Trends Cognitive Sci., vol. 6, no. 2, pp. 78-84, 2002.\n\nThe brain basis of syntactic processes: Functional imaging and lesion studies. A Friederici, S Kotz, NeuroImage. 201A. Friederici and S. Kotz, \"The brain basis of syntactic processes: Functional imaging and lesion studies,\" NeuroImage, vol. 20, no. 1, pp. S8-S17, 2003.\n\nUsing psycho-physiological measures to assess task difficulty in software development. T Fritz, A Begel, S C M€ Uller, S Yigit-Elliott, M Uger, Proc. Int. Conf. Softw. Eng. Int. Conf. Softw. EngT. Fritz, A. Begel, S. C. M€ uller, S. Yigit-Elliott, and M. Z€ uger, \"Using psycho-physiological measures to assess task difficulty in software development,\" in Proc. Int. Conf. Softw. Eng., 2014, pp. 402-413.\n\nCognitive Neuroscience: The Biol. Mind. M S Gazzaniga, R B Ivry, G R Mangun, Norton & CompanyNew York, NY, USAM. S. Gazzaniga, R. B. Ivry, and G. R. Mangun, Cognitive Neuro- science: The Biol. Mind, New York, NY, USA: Norton & Company, 2013.\n\nSensation and Perception. B Goldstein, Cengage Learning ServicesBoston, MA, USA5th ed.B. Goldstein, Sensation and Perception, 5th ed., Boston, MA, USA: Cengage Learning Services, 2002.\n\nExploiting the map metaphor in a tool for software evolution. W Griswold, J Yuan, Y Kato, Proc. Int. Conf. Softw. Eng. Int. Conf. Softw. EngW. Griswold, J. Yuan, and Y. Kato, \"Exploiting the map meta- phor in a tool for software evolution,\" in Proc. Int. Conf. Softw. Eng., 2001, pp. 265-274.\n\nThe battle for Broca's region. Y Grodzinsky, A Santi, Trends Cognitive Sci. 1212Y. Grodzinsky and A. Santi, \"The battle for Broca's region,\" Trends Cognitive Sci., vol. 12, no. 12, pp. 474-480, 2008.\n\nEducation: Paving the way for computational thinking. M , Commun. ACM. 518M. Guzdial, \"Education: Paving the way for computational thinking,\" Commun. ACM, vol. 51, no. 8, pp. 25-27, 2008.\n\nOn broca, brain, and binding: A new framework. P Hagoort, Trends Cognitive Sci. 99P. Hagoort, \"On broca, brain, and binding: A new framework,\" Trends Cognitive Sci., vol. 9, no. 9, pp. 416-423, 2005.\n\n. M Halstead, Elements Software Science. Amsterdam, The Netherlands. ElsevierM. Halstead, Elements Software Science. Amsterdam, The Nether- lands: Elsevier, 1977.\n\nDoes aspect-oriented programming increase the development speed for crosscutting code? an empirical study. S Hanenberg, S Kleinschmager, M Josupeit-Walter, Proc. Int. Symp. Empirical Softw. Eng. Meas. S. Hanenberg, S. Kleinschmager, and M. Josupeit-Walter, \"Does aspect-oriented programming increase the development speed for crosscutting code? an empirical study,\" in Proc. Int. Symp. Empirical Softw. Eng. Meas., 2009, pp. 156-167.\n\nCognitive architectures: A way forward for the psychology of programming. M Hansen, A Lumsdaine, R Goldstone, Proc. ACM Int. Symp. New Ideas New Paradigms Reflections Program. Softw. ACM Int. Symp. New Ideas New Paradigms Reflections Program. SoftwM. Hansen, A. Lumsdaine, and R. Goldstone, \"Cognitive archi- tectures: A way forward for the psychology of programming,\" in Proc. ACM Int. Symp. New Ideas New Paradigms Reflections Pro- gram. Softw., 2012, pp. 27-38.\n\nObject-Oriented Metrics: Measures of Complexity. B Henderson-Sellers, Prentice HallEnglewood Cliffs, NJ, USAB. Henderson-Sellers, Object-Oriented Metrics: Measures of Com- plexity. Englewood Cliffs, NJ, USA: Prentice Hall, 1995.\n\nQuantitive measurement using fMRI. R Hoge, G Pike ; P. Jezzard, P Matthews, S Smith, Functional Magnetic Resonance Imaging: An Introduction to Methods. London, U.K.Oxford Univ. PressR. Hoge and G. Pike, \"Quantitive measurement using fMRI,\" in Functional Magnetic Resonance Imaging: An Introduction to Methods, P. Jezzard, P. Matthews, and S. Smith, Ed. London, U.K.: Oxford Univ. Press, 2001, pp. 159-174.\n\nFunctional Magnetic Resonance Imaging. S Huettel, A Song, G Mccarthy, Sinauer AssociatesSunderland, MA, USAS. Huettel, A. Song, and G. McCarthy, Functional Magnetic Resonance Imaging. Sunderland, MA, USA: Sinauer Associates, 2008.\n\nBrain activity measurement during program comprehension with NIRS. Y Ikutani, H Uwano, Proc. IEEE/ACIS Int. IEEE/ACIS IntY. Ikutani and H. Uwano, \"Brain activity measurement during program comprehension with NIRS,\" in Proc. IEEE/ACIS Int.\n\n. Conf, Softw, Eng, Artif. Intell. Netw. Parallel/Distrib. Comput. Conf. Softw. Eng. Artif. Intell. Netw. Parallel/Distrib. Comput., 2014, pp. 1-6.\n\nCortical activations in primary and secondary motor areas for complex bimanual movements in professional pianists. L , J Shah, M Peters, Cognitive Brain Res. 101-2L. J€ ancke, J. Shah, and M. Peters, \"Cortical activations in primary and secondary motor areas for complex bimanual movements in professional pianists,\" Cognitive Brain Res., vol. 10, no. 1-2, pp. 177-183, 2000.\n\nGranularity in software product lines. C , S Apel, M Kuhlemann, Proc. Int. Conf. Softw. Eng. Int. Conf. Softw. EngC. K€ astner, S. Apel, and M. Kuhlemann, \"Granularity in software product lines,\" in Proc. Int. Conf. Softw. Eng., 2008, pp. 311-320.\n\nMylar: A degree-of-interest model for IDEs. M Kersten, G Murphy, Proc. Int. Conf. Aspect-Oriented Softw. Int. Conf. Aspect-Oriented SoftwM. Kersten and G. Murphy, \"Mylar: A degree-of-interest model for IDEs,\" in Proc. Int. Conf. Aspect-Oriented Softw. Develop., 2005, pp. 159-168.\n\nAspect-oriented programming. G Kiczales, J Lamping, A Mendhekar, C Maeda, C Lopez, J.-M Loingtier, J Irwin, Proc. Europ. Conf. Object-Oriented Program. Europ. Conf. Object-Oriented ProgramG. Kiczales, J. Lamping, A. Mendhekar, C. Maeda, C. Lopez, J.-M. Loingtier, and J. Irwin, \"Aspect-oriented programming,\" in Proc. Europ. Conf. Object-Oriented Program., 1997, pp. 220-242.\n\nTraining of working memory in children with ADHD. T Klingberg, H Forssberg, H Westerberg, J. Clinical Exp. Neuropsychology. 246T. Klingberg, H. Forssberg, and H. Westerberg, \"Training of working memory in children with ADHD,\" J. Clinical Exp. Neuro- psychology, vol. 24, no. 6, pp. 781-791, 2002.\n\nA measurement of programming language comprehension using p-BCI: An empirical study on phasic changes in alpha and theta brain Waves. T Kluthe, Edwardsville, IL, USASouthern Illinois University EdwardsvilleMaster's thesisT. Kluthe, \"A measurement of programming language compre- hension using p-BCI: An empirical study on phasic changes in alpha and theta brain Waves,\" Master's thesis, Southern Illinois University Edwardsville, Edwardsville, IL, USA, 2014.\n\nHandedness and hemispheric language dominance in healthy humans. S Knecht, B Dr€ Ager, M Deppe, L Bobe, H Lohmann, A , E.-B Ringelstein, Brain. 12312S. Knecht, B. Dr€ ager, M. Deppe, L. Bobe, H. Lohmann, A. Fl€ oel, and E.-B. Ringelstein, \"Handedness and hemispheric language dominance in healthy humans,\" Brain, vol. 123, no. 12, pp. 2512- 2518, 2000.\n\nCreativity as a pathway to computer science. M Knobelsdorf, R Romeike, Proc. Annu. Conf. Innovation Technol. Annu. Conf. Innovation Technol40M. Knobelsdorf and R. Romeike, \"Creativity as a pathway to computer science,\" in Proc. Annu. Conf. Innovation Technol. Com- put. Sci. Edu., 2008, vol. 40, no. 3, pp. 286-290.\n\nMining biometric data to predict programmer expertise and task difficulty. S Lee, D Hooshyar, H Ji, K Nam, H Lim, Cluster ComputS. Lee, D. Hooshyar, H. Ji, K. Nam, and H. Lim, \"Mining biomet- ric data to predict programmer expertise and task difficulty,\" Cluster Comput., pp. 1-11, 2017.\n\nComparing programming language comprehension between novice and expert programmers using EEG analysis. S Lee, A Matteson, D Hooshyar, S Kim, J Jung, G Nam, H Lim, Proc. IEEE Int. Conf. Bioinf. Bioengineering. IEEE Int. Conf. Bioinf. BioengineeringS. Lee, A. Matteson, D. Hooshyar, S. Kim, J. Jung, G. Nam, and H. Lim, \"Comparing programming language comprehension between novice and expert programmers using EEG analysis,\" in Proc. IEEE Int. Conf. Bioinf. Bioengineering, 2016, pp. 350-355.\n\nThe functional neuroanatomy of comprehension and memory: The importance of prior knowledge. E A Maguire, C D Frith, R Morris, Brain. 12210E. A. Maguire, C. D. Frith, and R. Morris, \"The functional neuro- anatomy of comprehension and memory: The importance of prior knowledge,\" Brain, vol. 122, no. 10, pp. 1839-1850, 1999.\n\nSuperior memorizers employ different neural networks for encoding and recall. J Mallow, J Bernarding, M Luchtmann, A Bethmann, A Brechmann, Frontiers Syst. Neuroscience. 9128J. Mallow, J. Bernarding, M. Luchtmann, A. Bethmann, and A. Brechmann, \"Superior memorizers employ different neural networks for encoding and recall,\" Frontiers Syst. Neuroscience, vol. 9, 2015, Art. no. 128.\n\nA complexity measure. T Mccabe, IEEE Trans. Softw. Eng. 24T. McCabe, \"A complexity measure,\" IEEE Trans. Softw. Eng., vol. SE-2, no. 4, pp. 308-320, Dec. 1976.\n\nA parametric manipulation of factors affecting task-induced deactivation in functional neuroimaging. K Mckiernan, J Kaufman, J Kucera-Thompson, J Binder, J. Cognitive Neuroscience. 153K. McKiernan, J. Kaufman, J. Kucera-Thompson, and J. Binder, \"A parametric manipulation of factors affecting task-induced deactivation in functional neuroimaging,\" J. Cognitive Neurosci- ence, vol. 15, no. 3, pp. 394-408, 2003.\n\nThe mind of expert motor performance is cool and focused. J Milton, A Solodkin, P Hlu S Itk, S Small, NeuroImage. 352J. Milton, A. Solodkin, P. Hlu s ıtk, and S. Small, \"The mind of expert motor performance is cool and focused,\" NeuroImage, vol. 35, no. 2, pp. 804-813, 2007.\n\nNatural programming languages and environments. B Myers, J Pane, A Ko, Commun. ACM. 479B. Myers, J. Pane, and A. Ko, \"Natural programming languages and environments,\" Commun. ACM, vol. 47, no. 9, pp. 47-52, Sep. 2004.\n\nCerebral activation during performance of a card sorting test. Y Nagahama, H Fukuyama, H Yamauchi, S Matsuzaki, J Konish, H S J Kimura, Brain. 1195Y. Nagahama, H. Fukuyama, H. Yamauchi, S. Matsuzaki, J. Konish, and H. S. J. Kimura, \"Cerebral activation during per- formance of a card sorting test,\" Brain, vol. 119, no. 5, pp. 1667- 1675, 1996.\n\nQuantifying programmers' mental workload during program comprehension based on cerebral blood flow measurement: A controlled experiment. T Nakagawa, Y Kamei, H Uwano, A Monden, K Matsumoto, D M German, Proc. Int. Conf. Softw. Eng. Int. Conf. Softw. EngT. Nakagawa, Y. Kamei, H. Uwano, A. Monden, K. Matsumoto, and D. M. German, \"Quantifying programmers' mental work- load during program comprehension based on cerebral blood flow measurement: A controlled experiment,\" in Proc. Int. Conf. Softw. Eng., 2014, pp. 448-451.\n\nOn the neural basis of focused and divided attention. K Nebel, H Wiese, P Stude, A De Greiff, H.-C Diener, M Keidel, Cognitive Brain Res. 253K. Nebel, H. Wiese, P. Stude, A. de Greiff, H.-C. Diener, and M. Keidel, \"On the neural basis of focused and divided attention,\" Cognitive Brain Res., vol. 25, no. 3, pp. 760-776, 2005.\n\nThe effect of problem structure on problem-solving: An fMRI study of word versus number problems. S Newman, G Willoughby, B Pruce, Brain Res. 1410S. Newman, G. Willoughby, and B. Pruce, \"The effect of problem structure on problem-solving: An fMRI study of word versus number problems,\" Brain Res., vol. 1410, pp. 77-88, 2011.\n\nResolving sentence ambiguity with planning and working memory resources: Evidence from fMRI. S Novais-Santos, J Gee, M Shah, V Troiani, M Work, M Grossman, NeuroImage. 37S. Novais-Santos, J. Gee, M. Shah, V. Troiani, M. Work, and M. Grossman, \"Resolving sentence ambiguity with planning and working memory resources: Evidence from fMRI,\" NeuroImage, vol. 37, pp. 361-378, 2007.\n\nWorking memory capacity-facets of a cognitive ability construct. K Oberauer, H.-M S€ Uß, R Schulze, O Wilhelm, W Wittmann, Personality Individual Differences. 296K. Oberauer, H.-M. S€ uß, R. Schulze, O. Wilhelm, and W. Wittmann, \"Working memory capacity-facets of a cognitive ability con- struct,\" Personality Individual Differences, vol. 29, no. 6, pp. 1017- 1045, 2000.\n\nThe assessment and analysis of handedness: The edinburgh inventory. R Oldfield, Neuropsychologia. 91R. Oldfield, \"The assessment and analysis of handedness: The edinburgh inventory,\" Neuropsychologia, vol. 9, no. 1, pp. 97-113, 1971.\n\nRevisiting information hiding: Reflections on classical and nonclassical modularity. K Ostermann, P Giarrusso, C , T Rendel, Proc. Europ. Conf. Object-Oriented Program. Europ. Conf. Object-Oriented ProgramK. Ostermann, P. Giarrusso, C. K€ astner, and T. Rendel, \"Revisiting information hiding: Reflections on classical and nonclassical modularity,\" in Proc. Europ. Conf. Object-Oriented Program., 2011, pp. 155-178.\n\nSubvocalization -toward hearing the inner thoughts of developers. C Parnin, Proc. Int. Conf. Program Comprehension. Int. Conf. Program ComprehensionC. Parnin, \"Subvocalization -toward hearing the inner thoughts of developers,\" in Proc. Int. Conf. Program Comprehension, 2011, pp. 197-200.\n\nProgrammer information needs after memory failure. C Parnin, S Rugaber, Proc. Int. Conf. Program Comprehension. Int. Conf. Program ComprehensionC. Parnin and S. Rugaber, \"Programmer information needs after memory failure,\" in Proc. Int. Conf. Program Comprehension, 2012, pp. 123-132.\n\nOn the nature of programmer expertise. C Parnin, J Siegmund, N Peitek, Proc. Annu. Workshop Psychology Program. Interest Group. Annu. Workshop Psychology Program. Interest GroupC. Parnin, J. Siegmund, and N. Peitek, \"On the nature of pro- grammer expertise,\" in Proc. Annu. Workshop Psychology Program. Interest Group, 2017, pp. 109-118.\n\nToward conjoint analysis of simultaneous eye-tracking and fMRI data for program-comprehension studies. N Peitek, J Siegmund, C Parnin, S Apel, A Brechmann, Proc. Int. Workshop Eye Movements Program. Int. Workshop Eye Movements Program1N. Peitek, J. Siegmund, C. Parnin, S. Apel, and A. Brechmann, \"Toward conjoint analysis of simultaneous eye-tracking and fMRI data for program-comprehension studies,\" in Proc. Int. Workshop Eye Movements Program., 2018, pp. 1:1-1:5.\n\nSimultaneous measurement of program comprehension with fMRI and eye tracking: A case study. N Peitek, J Siegmund, C Parnin, S Apel, J Hofmeister, A Brechmann, Proc. Int. Symp. Int. Symp10N. Peitek, J. Siegmund, C. Parnin, S. Apel, J. Hofmeister, and A. Brechmann, \"Simultaneous measurement of program com- prehension with fMRI and eye tracking: A case study,\" in Proc. Int. Symp. Empirical Softw. Eng. Meas., 2018, p. 10.\n\nTransfer of learning. D N Perkins, G Salomon, P Press, Int. Encyclopedia Edu. Oxford, United KingdomPergamon Press2nd ed.D. N. Perkins, G. Salomon, and P. Press, \"Transfer of learning,\" in Int. Encyclopedia Edu., 2nd ed., Oxford, United Kingdom: Pergamon Press, 1992.\n\nActivation of extrastriate and frontal cortical areas by visual words and wordlike stimuli. S Petersen, P Fox, A Snyder, M Raichle, Sci. 2494972S. Petersen, P. Fox, and A. Snyder, and M. Raichle, \"Activation of extrastriate and frontal cortical areas by visual words and word- like stimuli,\" Sci., vol. 249, no. 4972, pp. 1041-1044, 1990.\n\nWhat artificial grammar learning reveals about the neurobiology of syntax. K Petersson, V Folia, P Hagoort, Brain Language. 2981089K. Petersson, V. Folia, and P. Hagoort, \"What artificial grammar learning reveals about the neurobiology of syntax,\" Brain Lan- guage, vol. 298, no. 1089, pp. 199-209, 2012.\n\nThe neurobiology of syntax: Beyond string sets. K Petersson, P Hagoort, Philos. Trans. R. Soc. Lond. B Biol. Sci. 367K. Petersson and P. Hagoort, \"The neurobiology of syntax: Beyond string sets,\" Philos. Trans. R. Soc. Lond. B Biol. Sci., vol. 367, pp. 1971-1983, 2012.\n\nCan cognitive processes be inferred from neuroimaging data?. R Poldrack, Trends Cognitive Sci. 102R. Poldrack, \"Can cognitive processes be inferred from neuroim- aging data?,\" Trends Cognitive Sci., vol. 10, no. 2, pp. 59-63, 2006.\n\nThe role of fMRI in cognitive neuroscience: Where do we stand?. R Poldrack, Current Opinion Neurobiology. 182R. Poldrack, \"The role of fMRI in cognitive neuroscience: Where do we stand?,\" Current Opinion Neurobiology, vol. 18, no. 2, pp. 223-227, 2008.\n\nDyslexia and learning computer programming. N Powell, D Moore, J Gray, J Finlay, J Reaney, Proc. Annu. Conf. Innovation Technol. Annu. Conf. Innovation TechnolN. Powell, D. Moore, J. Gray, J. Finlay, and J. Reaney, \"Dyslexia and learning computer programming,\" in Proc. Annu. Conf. Inno- vation Technol. Comput. Sci. Edu., 2004, pp. 242-242.\n\nNeural substrates of fluid reasoning: An fMRI study of neocortical activation during performance of the raven's progressive matrices test. V Prabhakaran, J Smith, J Desmond, G Glover, J Gabrieli, Cognitive Psychology. 331V. Prabhakaran, J. Smith, J. Desmond, G. Glover, and J. Gabrieli, \"Neural substrates of fluid reasoning: An fMRI study of neocorti- cal activation during performance of the raven's progressive matrices test,\" Cognitive Psychology, vol. 33, no. 1, pp. 43-63, 1996.\n\nA review and synthesis of the first 20 years of PET and fMRI studies of heard speech, spoken language and reading. C Price, NeuroImage. 622C. Price, \"A review and synthesis of the first 20 years of PET and fMRI studies of heard speech, spoken language and reading,\" NeuroImage, vol. 62, no. 2, pp. 816-847, 2012.\n\nA default mode of brain function. M Raichle, A Macleod, A Snyder, W Powers, D Gusnard, G Shulman, Proc. National Academy Sci. 982M. Raichle, A. MacLeod, A. Snyder, W. Powers, D. Gusnard, and G. Shulman, \"A default mode of brain function,\" Proc. National Academy Sci., vol. 98, no. 2, pp. 676-682, 2001.\n\nConcern graphs: Finding and describing concerns using structural program dependencies. M Robillard, G Murphy, Proc. Int. Conf. Softw. Eng. Int. Conf. Softw. EngM. Robillard and G. Murphy, \"Concern graphs: Finding and describing concerns using structural program dependencies,\" in Proc. Int. Conf. Softw. Eng., 2002, pp. 406-416.\n\nNeural correlates of arithmetic calculation strategies. M Rosenberg-Lee, M Lovett, J Anderson, Cognitive Affect. Behavioral Neuroscience. 93M. Rosenberg-Lee, M. Lovett, and J. Anderson, \"Neural corre- lates of arithmetic calculation strategies,\" Cognitive Affect. Behav- ioral Neuroscience, vol. 9, no. 3, pp. 270-285, 2009.\n\nTask-dependent modulation of regions in the left inferior frontal cortex during semantic processing. A Roskies, J Fiez, D Balota, M Raichle, S Petersen, J. Cognitive Neuroscience. 136A. Roskies, J. Fiez, D. Balota, M. Raichle, and S. Petersen, \"Task-dependent modulation of regions in the left inferior fron- tal cortex during semantic processing,\" J. Cognitive Neuroscience, vol. 13, no. 6, pp. 829-843, 2001.\n\nExploratory experimental studies comparing online and offline programming performance. H Sackman, W Erikson, E Grant, Commun. ACM. 111H. Sackman, W. Erikson, and E. Grant, \"Exploratory experimen- tal studies comparing online and offline programming perform- ance,\" Commun. ACM, vol. 11, no. 1, pp. 3-11, 1968.\n\n. E Sapir, Culture, Language and Personality. Univ. California PressE. Sapir, Culture, Language and Personality. Berkeley, CA, USA: Univ. California Press, 1949.\n\nAutomatically assessing code understandability: How far are we?. S Scalabrino, G Bavota, C Vendome, M Linares-V Asquez, D Poshyvanyk, R Oliveto, Proc. Int. Conf. Automated Softw. Eng. Int. Conf. Automated Softw. EngS. Scalabrino, G. Bavota, C. Vendome, M. Linares-V asquez, D. Poshyvanyk, and R. Oliveto, \"Automatically assessing code understandability: How far are we?,\" in Proc. Int. Conf. Automated Softw. Eng., 2017, pp. 417-427.\n\nThe angular gyrus: Multiple functions and multiple subdivisions. M L Seghier, The Neuroscientist. 191M. L. Seghier, \"The angular gyrus: Multiple functions and multi- ple subdivisions,\" The Neuroscientist, vol. 19, no. 1, pp. 43-61, 2013.\n\nSyntactic/semantic interactions in programmer behavior: A model and experimental results. B Shneiderman, R Mayer, Int. J. Parallel Program. 83B. Shneiderman and R. Mayer, \"Syntactic/semantic interactions in programmer behavior: A model and experimental results,\" Int. J. Parallel Program., vol. 8, no. 3, pp. 219-238, 1979.\n\nThe teaching of software engineering. M Shooman, Proc. Tech. Symp. Tech. SympM. Shooman, \"The teaching of software engineering,\" in Proc. Tech. Symp. Comput. Sci. Edu., 1983, pp. 66-71.\n\nToward measuring program comprehension with functional magnetic resonance imaging. J Siegmund, A Brechmann, S Apel, C Astner, J Liebig, T Leich, G Saake, Proc. Int. Symp. Foundations Softw. Eng.-New Ideas Track. Int. Symp. Foundations Softw. Eng.-New Ideas Track244J. Siegmund, A. Brechmann, S. Apel, C. K€ astner, J. Liebig, T. Leich, and G. Saake, \"Toward measuring program comprehension with functional magnetic resonance imaging,\" in Proc. Int. Symp. Foun- dations Softw. Eng.-New Ideas Track, 2012, pp. 24:1-24:4.\n\nUnderstanding understanding source code with functional magnetic resonance imaging. J Siegmund, C Astner, S Apel, C Parnin, A Bethmann, T Leich, G Saake, A Brechmann, Proc. Int. Conf. Softw. Eng. Int. Conf. Softw. EngJ. Siegmund, C. K€ astner, S. Apel, C. Parnin, A. Bethmann, T. Leich, G. Saake, and A. Brechmann, \"Understanding under- standing source code with functional magnetic resonance imag- ing,\" in Proc. Int. Conf. Softw. Eng., 2014, pp. 378-389.\n\nMeasuring neural efficiency of program comprehension. J Siegmund, N Peitek, C Parnin, S Apel, J Hofmeister, C Astner, A Begel, A Bethmann, A Brechmann, Proc. 11th Joint Meet. Foundations Softw. Eng. 11th Joint Meet. Foundations Softw. EngJ. Siegmund, N. Peitek, C. Parnin, S. Apel, J. Hofmeister, C. K€ astner, A. Begel, A. Bethmann, and A. Brechmann, \"Measu- ring neural efficiency of program comprehension,\" in Proc. 11th Joint Meet. Foundations Softw. Eng., 2017, pp. 140-150.\n\nNeural correlates of artificial grammar learning. P Skosnik, F Mirza, D Gitelman, T Parrish, M Mesulam, P Reber, Neu-roImage. 173P. Skosnik, F. Mirza, D. Gitelman, T. Parrish, M. Mesulam, and P. Reber, \"Neural correlates of artificial grammar learning,\" Neu- roImage, vol. 17, no. 3, pp. 1306-1314, 2008.\n\nSpatial attention evokes similar activation patterns for visual and auditory stimuli. D V Smith, B Davis, K Niu, E W Healy, L Bonilha, J Fridriksson, P S Morgan, C Rorden, J. Cognitive Neuroscience. 222D. V. Smith, B. Davis, K. Niu, E. W. Healy, L. Bonilha, J. Fridriks- son, P. S. Morgan, and C. Rorden, \"Spatial attention evokes similar activation patterns for visual and auditory stimuli,\" J. Cognitive Neuroscience, vol. 22, no. 2, pp. 347-361, 2010.\n\nDissociating verbal and spatial working memory using PET. E Smith, J Jonides, R Koeppe, Cerebral Cortex. 61E. Smith, J. Jonides, and R. Koeppe, \"Dissociating verbal and spa- tial working memory using PET,\" Cerebral Cortex, vol. 6, no. 1, pp. 11-20, 1991.\n\nDriven to distraction: Dual-task studies of simulated driving and conversing on a cellular telephone. D Strayer, Psychological Sci. 126D. Strayer, \"Driven to distraction: Dual-task studies of simulated driving and conversing on a cellular telephone,\" Psychological Sci., vol. 12, no. 6, pp. 462-466, 2001.\n\nJ Talairach, P Tournoux, Co-Planar Stereotaxic Atlas of the Human Brain. Stuttgart, GermanyThiemeJ. Talairach and P. Tournoux, Co-Planar Stereotaxic Atlas of the Human Brain. Stuttgart, Germany: Thieme, 1988.\n\nN degrees of separation: Multi-dimensional separation of concerns. P Tarr, H Ossher, W Harrison, J. Stanley Sutton, Proc. Int. Conf. Softw. Eng. Int. Conf. Softw. EngP. Tarr, H. Ossher, W. Harrison, and J. Stanley Sutton, \"N degrees of separation: Multi-dimensional separation of con- cerns,\" in Proc. Int. Conf. Softw. Eng., 1999, pp. 107-119.\n\nAutomatically assessing code understandability\" reanalyzed: Combined metrics matter. A Trockman, K Cates, M Mozina, T Nguyen, C , B Vasilescu, Proc. Int. Conf. Mining Softw. Repositories. Int. Conf. Mining Softw. RepositoriesA. Trockman, K. Cates, M. Mozina, T. Nguyen, C. K€ astner, and B. Vasilescu, \"\"Automatically assessing code understandability\" reanalyzed: Combined metrics matter,\" in Proc. Int. Conf. Mining Softw. Repositories, 2018, pp. 314-318.\n\nThe neural architecture of the language comprehension network: Converging evidence from lesion and connectivity analyses. A Turken, N Dronkers, Frontiers Syst. Neuroscience. 51A. Turken and N. Dronkers, \"The neural architecture of the language comprehension network: Converging evidence from lesion and connectivity analyses,\" Frontiers Syst. Neuroscience, vol. 5, 2011, Art. no. 1.\n\nAttention to one or two features in left or right visual field: A positron emission tomography study. R Vandenberghe, J Duncan, P Dupont, R Ward, J.-B Poline, G Bormans, J Michiels, L Mortelmans, G Orban, J. Neuroscience. 1710R. Vandenberghe, J. Duncan, P. Dupont, R. Ward, J.-B. Poline, G. Bormans, J. Michiels, L. Mortelmans, and G. Orban, \"Attention to one or two features in left or right visual field: A positron emis- sion tomography study,\" J. Neuroscience, vol. 17, no. 10, pp. 3739- 3750, 1997.\n\n. B Whorf, Language, Thought, Reality, U K London, Chapman and HallB. Whorf, Language, Thought, and Reality. London, U.K.: Chapman and Hall, 1956.\n\nComputational thinking. J Wing, Commun. ACM. 493J. Wing, \"Computational thinking,\" Commun. ACM, vol. 49, no. 3, pp. 33-35, 2006.\n\nTrain Your Brain. S Wootton, T Horne, Teach Yourself. London, U.KS. Wootton and T. Horne, Train Your Brain. London, U.K.: Teach Yourself, 2010.\n", "annotations": {"author": "[{\"end\":48,\"start\":34},{\"end\":64,\"start\":49},{\"end\":75,\"start\":65},{\"end\":97,\"start\":76},{\"end\":111,\"start\":98},{\"end\":126,\"start\":112},{\"end\":140,\"start\":127},{\"end\":154,\"start\":141},{\"end\":172,\"start\":155}]", "publisher": null, "author_last_name": "[{\"end\":47,\"start\":41},{\"end\":63,\"start\":55},{\"end\":74,\"start\":70},{\"end\":96,\"start\":90},{\"end\":110,\"start\":104},{\"end\":125,\"start\":117},{\"end\":139,\"start\":134},{\"end\":153,\"start\":148},{\"end\":171,\"start\":162}]", "author_first_name": "[{\"end\":40,\"start\":34},{\"end\":54,\"start\":49},{\"end\":69,\"start\":65},{\"end\":85,\"start\":76},{\"end\":89,\"start\":86},{\"end\":103,\"start\":98},{\"end\":116,\"start\":112},{\"end\":133,\"start\":127},{\"end\":147,\"start\":141},{\"end\":159,\"start\":155},{\"end\":161,\"start\":160}]", "author_affiliation": null, "title": "[{\"end\":31,\"start\":1},{\"end\":203,\"start\":173}]", "venue": null, "abstract": "[{\"end\":2101,\"start\":301}]", "bib_ref": "[{\"attributes\":{\"ref_id\":\"b21\"},\"end\":2373,\"start\":2369},{\"attributes\":{\"ref_id\":\"b0\"},\"end\":2558,\"start\":2557},{\"attributes\":{\"ref_id\":\"b12\"},\"end\":3688,\"start\":3684},{\"attributes\":{\"ref_id\":\"b97\"},\"end\":3882,\"start\":3878},{\"attributes\":{\"ref_id\":\"b7\"},\"end\":6398,\"start\":6395},{\"attributes\":{\"ref_id\":\"b100\"},\"end\":7010,\"start\":7006},{\"attributes\":{\"ref_id\":\"b101\"},\"end\":7099,\"start\":7094},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":7921,\"start\":7917},{\"attributes\":{\"ref_id\":\"b23\"},\"end\":7927,\"start\":7923},{\"attributes\":{\"ref_id\":\"b33\"},\"end\":7933,\"start\":7929},{\"attributes\":{\"ref_id\":\"b101\"},\"end\":8214,\"start\":8209},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":8410,\"start\":8406},{\"attributes\":{\"ref_id\":\"b23\"},\"end\":8416,\"start\":8412},{\"attributes\":{\"ref_id\":\"b33\"},\"end\":8422,\"start\":8418},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":8760,\"start\":8759},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":10623,\"start\":10622},{\"attributes\":{\"ref_id\":\"b47\"},\"end\":11361,\"start\":11357},{\"attributes\":{\"ref_id\":\"b81\"},\"end\":12826,\"start\":12822},{\"attributes\":{\"ref_id\":\"b11\"},\"end\":13048,\"start\":13044},{\"attributes\":{\"ref_id\":\"b37\"},\"end\":13848,\"start\":13844},{\"attributes\":{\"ref_id\":\"b84\"},\"end\":13889,\"start\":13885},{\"attributes\":{\"ref_id\":\"b85\"},\"end\":13895,\"start\":13891},{\"attributes\":{\"ref_id\":\"b38\"},\"end\":14078,\"start\":14074},{\"attributes\":{\"ref_id\":\"b6\"},\"end\":15246,\"start\":15243},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":17031,\"start\":17027},{\"attributes\":{\"ref_id\":\"b2\"},\"end\":20217,\"start\":20216},{\"attributes\":{\"ref_id\":\"b0\"},\"end\":22326,\"start\":22323},{\"attributes\":{\"ref_id\":\"b3\"},\"end\":24391,\"start\":24390},{\"attributes\":{\"ref_id\":\"b64\"},\"end\":26405,\"start\":26401},{\"attributes\":{\"ref_id\":\"b56\"},\"end\":26767,\"start\":26763},{\"attributes\":{\"ref_id\":\"b60\"},\"end\":26773,\"start\":26769},{\"end\":26881,\"start\":26870},{\"attributes\":{\"ref_id\":\"b46\"},\"end\":28017,\"start\":28013},{\"attributes\":{\"ref_id\":\"b63\"},\"end\":28286,\"start\":28282},{\"attributes\":{\"ref_id\":\"b43\"},\"end\":28531,\"start\":28527},{\"attributes\":{\"ref_id\":\"b7\"},\"end\":28894,\"start\":28891},{\"attributes\":{\"ref_id\":\"b29\"},\"end\":29313,\"start\":29309},{\"attributes\":{\"ref_id\":\"b26\"},\"end\":29463,\"start\":29459},{\"attributes\":{\"ref_id\":\"b95\"},\"end\":29469,\"start\":29465},{\"attributes\":{\"ref_id\":\"b108\"},\"end\":29476,\"start\":29471},{\"attributes\":{\"ref_id\":\"b37\"},\"end\":30416,\"start\":30412},{\"attributes\":{\"ref_id\":\"b89\"},\"end\":30422,\"start\":30418},{\"attributes\":{\"ref_id\":\"b27\"},\"end\":31405,\"start\":31401},{\"attributes\":{\"ref_id\":\"b99\"},\"end\":34274,\"start\":34270},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":36487,\"start\":36486},{\"attributes\":{\"ref_id\":\"b27\"},\"end\":36832,\"start\":36828},{\"attributes\":{\"ref_id\":\"b73\"},\"end\":36929,\"start\":36925},{\"attributes\":{\"ref_id\":\"b57\"},\"end\":37008,\"start\":37004},{\"attributes\":{\"ref_id\":\"b6\"},\"end\":38343,\"start\":38340},{\"attributes\":{\"ref_id\":\"b5\"},\"end\":40298,\"start\":40297},{\"attributes\":{\"ref_id\":\"b106\"},\"end\":40776,\"start\":40771},{\"attributes\":{\"ref_id\":\"b5\"},\"end\":42282,\"start\":42279},{\"attributes\":{\"ref_id\":\"b5\"},\"end\":43594,\"start\":43593},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":51513,\"start\":51510},{\"attributes\":{\"ref_id\":\"b70\"},\"end\":51519,\"start\":51515},{\"attributes\":{\"ref_id\":\"b91\"},\"end\":51525,\"start\":51521},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":51706,\"start\":51703},{\"attributes\":{\"ref_id\":\"b91\"},\"end\":51712,\"start\":51708},{\"attributes\":{\"ref_id\":\"b91\"},\"end\":52057,\"start\":52053},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":52489,\"start\":52485},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":52495,\"start\":52491},{\"attributes\":{\"ref_id\":\"b71\"},\"end\":52501,\"start\":52497},{\"attributes\":{\"ref_id\":\"b69\"},\"end\":53168,\"start\":53164},{\"attributes\":{\"ref_id\":\"b103\"},\"end\":53175,\"start\":53170},{\"attributes\":{\"ref_id\":\"b69\"},\"end\":53414,\"start\":53410},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":53747,\"start\":53743},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":53753,\"start\":53749},{\"attributes\":{\"ref_id\":\"b3\"},\"end\":54419,\"start\":54416},{\"attributes\":{\"ref_id\":\"b82\"},\"end\":54425,\"start\":54421},{\"attributes\":{\"ref_id\":\"b102\"},\"end\":54432,\"start\":54427},{\"attributes\":{\"ref_id\":\"b8\"},\"end\":55597,\"start\":55594},{\"attributes\":{\"ref_id\":\"b22\"},\"end\":55603,\"start\":55599},{\"attributes\":{\"ref_id\":\"b109\"},\"end\":55610,\"start\":55605},{\"attributes\":{\"ref_id\":\"b28\"},\"end\":56238,\"start\":56234},{\"attributes\":{\"ref_id\":\"b40\"},\"end\":56244,\"start\":56240},{\"attributes\":{\"ref_id\":\"b42\"},\"end\":56436,\"start\":56432},{\"attributes\":{\"ref_id\":\"b83\"},\"end\":56442,\"start\":56438},{\"attributes\":{\"ref_id\":\"b109\"},\"end\":56598,\"start\":56593},{\"end\":56982,\"start\":56975},{\"attributes\":{\"ref_id\":\"b44\"},\"end\":56985,\"start\":56982},{\"attributes\":{\"ref_id\":\"b47\"},\"end\":56988,\"start\":56985},{\"attributes\":{\"ref_id\":\"b88\"},\"end\":57113,\"start\":57109},{\"attributes\":{\"ref_id\":\"b88\"},\"end\":57269,\"start\":57265},{\"attributes\":{\"ref_id\":\"b61\"},\"end\":57403,\"start\":57399},{\"attributes\":{\"ref_id\":\"b28\"},\"end\":58343,\"start\":58339},{\"attributes\":{\"ref_id\":\"b34\"},\"end\":58349,\"start\":58345},{\"attributes\":{\"ref_id\":\"b35\"},\"end\":58355,\"start\":58351},{\"attributes\":{\"ref_id\":\"b92\"},\"end\":58520,\"start\":58516},{\"attributes\":{\"ref_id\":\"b109\"},\"end\":58527,\"start\":58522},{\"attributes\":{\"ref_id\":\"b109\"},\"end\":59182,\"start\":59177},{\"attributes\":{\"ref_id\":\"b64\"},\"end\":59929,\"start\":59925},{\"attributes\":{\"ref_id\":\"b46\"},\"end\":60436,\"start\":60432},{\"attributes\":{\"ref_id\":\"b101\"},\"end\":61555,\"start\":61550},{\"attributes\":{\"ref_id\":\"b80\"},\"end\":62006,\"start\":62002},{\"attributes\":{\"ref_id\":\"b33\"},\"end\":62298,\"start\":62294},{\"attributes\":{\"ref_id\":\"b101\"},\"end\":64838,\"start\":64833},{\"attributes\":{\"ref_id\":\"b6\"},\"end\":65238,\"start\":65237},{\"attributes\":{\"ref_id\":\"b19\"},\"end\":65838,\"start\":65834},{\"attributes\":{\"ref_id\":\"b96\"},\"end\":67199,\"start\":67195},{\"attributes\":{\"ref_id\":\"b31\"},\"end\":67833,\"start\":67829},{\"attributes\":{\"ref_id\":\"b60\"},\"end\":68836,\"start\":68832},{\"attributes\":{\"ref_id\":\"b32\"},\"end\":73187,\"start\":73183},{\"attributes\":{\"ref_id\":\"b3\"},\"end\":74491,\"start\":74488},{\"attributes\":{\"ref_id\":\"b8\"},\"end\":74496,\"start\":74493},{\"attributes\":{\"ref_id\":\"b22\"},\"end\":74502,\"start\":74498},{\"attributes\":{\"ref_id\":\"b28\"},\"end\":74508,\"start\":74504},{\"attributes\":{\"ref_id\":\"b34\"},\"end\":74514,\"start\":74510},{\"attributes\":{\"ref_id\":\"b35\"},\"end\":74520,\"start\":74516},{\"attributes\":{\"ref_id\":\"b40\"},\"end\":74526,\"start\":74522},{\"attributes\":{\"ref_id\":\"b42\"},\"end\":74532,\"start\":74528},{\"attributes\":{\"ref_id\":\"b82\"},\"end\":74538,\"start\":74534},{\"attributes\":{\"ref_id\":\"b83\"},\"end\":74544,\"start\":74540},{\"attributes\":{\"ref_id\":\"b102\"},\"end\":74551,\"start\":74546},{\"attributes\":{\"ref_id\":\"b109\"},\"end\":74558,\"start\":74553},{\"attributes\":{\"ref_id\":\"b2\"},\"end\":74672,\"start\":74669},{\"attributes\":{\"ref_id\":\"b67\"},\"end\":74678,\"start\":74674},{\"attributes\":{\"ref_id\":\"b87\"},\"end\":74684,\"start\":74680},{\"attributes\":{\"ref_id\":\"b104\"},\"end\":74691,\"start\":74686},{\"attributes\":{\"ref_id\":\"b110\"},\"end\":74794,\"start\":74789},{\"attributes\":{\"ref_id\":\"b45\"},\"end\":75235,\"start\":75231},{\"attributes\":{\"ref_id\":\"b76\"},\"end\":75431,\"start\":75427},{\"attributes\":{\"ref_id\":\"b33\"},\"end\":75735,\"start\":75731},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":75958,\"start\":75954},{\"attributes\":{\"ref_id\":\"b23\"},\"end\":75964,\"start\":75960},{\"attributes\":{\"ref_id\":\"b68\"},\"end\":76518,\"start\":76514},{\"attributes\":{\"ref_id\":\"b49\"},\"end\":76693,\"start\":76689},{\"attributes\":{\"ref_id\":\"b56\"},\"end\":76823,\"start\":76819},{\"attributes\":{\"ref_id\":\"b60\"},\"end\":77212,\"start\":77208},{\"attributes\":{\"ref_id\":\"b59\"},\"end\":77505,\"start\":77501},{\"attributes\":{\"ref_id\":\"b78\"},\"end\":77743,\"start\":77739},{\"attributes\":{\"ref_id\":\"b79\"},\"end\":77749,\"start\":77745},{\"attributes\":{\"ref_id\":\"b36\"},\"end\":77996,\"start\":77992},{\"attributes\":{\"ref_id\":\"b25\"},\"end\":78403,\"start\":78399},{\"attributes\":{\"ref_id\":\"b101\"},\"end\":79504,\"start\":79499},{\"attributes\":{\"ref_id\":\"b13\"},\"end\":79937,\"start\":79933},{\"attributes\":{\"ref_id\":\"b79\"},\"end\":80052,\"start\":80048},{\"attributes\":{\"ref_id\":\"b78\"},\"end\":80238,\"start\":80234},{\"attributes\":{\"ref_id\":\"b46\"},\"end\":80618,\"start\":80614},{\"attributes\":{\"ref_id\":\"b95\"},\"end\":80878,\"start\":80874},{\"attributes\":{\"ref_id\":\"b108\"},\"end\":80885,\"start\":80880},{\"attributes\":{\"ref_id\":\"b26\"},\"end\":81102,\"start\":81098},{\"attributes\":{\"ref_id\":\"b16\"},\"end\":81682,\"start\":81678},{\"attributes\":{\"ref_id\":\"b18\"},\"end\":81688,\"start\":81684},{\"attributes\":{\"ref_id\":\"b93\"},\"end\":81694,\"start\":81690},{\"attributes\":{\"ref_id\":\"b77\"},\"end\":82006,\"start\":82002},{\"attributes\":{\"ref_id\":\"b51\"},\"end\":82329,\"start\":82325},{\"attributes\":{\"ref_id\":\"b65\"},\"end\":82512,\"start\":82508},{\"attributes\":{\"ref_id\":\"b62\"},\"end\":82838,\"start\":82834},{\"attributes\":{\"ref_id\":\"b75\"},\"end\":83726,\"start\":83722},{\"attributes\":{\"ref_id\":\"b17\"},\"end\":83840,\"start\":83836},{\"attributes\":{\"ref_id\":\"b58\"},\"end\":83846,\"start\":83842},{\"attributes\":{\"ref_id\":\"b98\"},\"end\":83852,\"start\":83848},{\"attributes\":{\"ref_id\":\"b24\"},\"end\":84506,\"start\":84502},{\"attributes\":{\"ref_id\":\"b105\"},\"end\":84513,\"start\":84508},{\"attributes\":{\"ref_id\":\"b113\"},\"end\":84520,\"start\":84515},{\"attributes\":{\"ref_id\":\"b55\"},\"end\":84570,\"start\":84566},{\"attributes\":{\"ref_id\":\"b72\"},\"end\":84576,\"start\":84572},{\"attributes\":{\"ref_id\":\"b86\"},\"end\":84776,\"start\":84772},{\"attributes\":{\"ref_id\":\"b86\"},\"end\":84949,\"start\":84945},{\"attributes\":{\"ref_id\":\"b20\"},\"end\":85573,\"start\":85569},{\"attributes\":{\"ref_id\":\"b112\"},\"end\":85668,\"start\":85663},{\"attributes\":{\"ref_id\":\"b41\"},\"end\":85835,\"start\":85831},{\"attributes\":{\"ref_id\":\"b44\"},\"end\":86830,\"start\":86826},{\"end\":87292,\"start\":87280},{\"attributes\":{\"ref_id\":\"b66\"},\"end\":88089,\"start\":88085},{\"attributes\":{\"ref_id\":\"b94\"},\"end\":88358,\"start\":88354},{\"attributes\":{\"ref_id\":\"b111\"},\"end\":88365,\"start\":88360},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":88528,\"start\":88525},{\"attributes\":{\"ref_id\":\"b107\"},\"end\":88944,\"start\":88939},{\"attributes\":{\"ref_id\":\"b74\"},\"end\":89319,\"start\":89315},{\"attributes\":{\"ref_id\":\"b39\"},\"end\":89481,\"start\":89477},{\"attributes\":{\"ref_id\":\"b52\"},\"end\":89487,\"start\":89483},{\"attributes\":{\"ref_id\":\"b53\"},\"end\":89493,\"start\":89489},{\"attributes\":{\"ref_id\":\"b54\"},\"end\":89499,\"start\":89495},{\"attributes\":{\"ref_id\":\"b90\"},\"end\":89505,\"start\":89501},{\"attributes\":{\"ref_id\":\"b21\"},\"end\":90719,\"start\":90715},{\"end\":92752,\"start\":92746}]", "figure": "[{\"attributes\":{\"id\":\"fig_0\"},\"end\":97173,\"start\":97135},{\"attributes\":{\"id\":\"fig_1\"},\"end\":97253,\"start\":97174},{\"attributes\":{\"id\":\"fig_2\"},\"end\":97327,\"start\":97254},{\"attributes\":{\"id\":\"fig_3\"},\"end\":97654,\"start\":97328},{\"attributes\":{\"id\":\"fig_4\"},\"end\":97851,\"start\":97655},{\"attributes\":{\"id\":\"fig_5\"},\"end\":98083,\"start\":97852},{\"attributes\":{\"id\":\"fig_6\"},\"end\":98325,\"start\":98084},{\"attributes\":{\"id\":\"fig_7\"},\"end\":98559,\"start\":98326},{\"attributes\":{\"id\":\"fig_9\"},\"end\":98617,\"start\":98560},{\"attributes\":{\"id\":\"fig_10\"},\"end\":98701,\"start\":98618},{\"attributes\":{\"id\":\"tab_1\",\"type\":\"table\"},\"end\":98979,\"start\":98702},{\"attributes\":{\"id\":\"tab_2\",\"type\":\"table\"},\"end\":99985,\"start\":98980},{\"attributes\":{\"id\":\"tab_3\",\"type\":\"table\"},\"end\":100202,\"start\":99986}]", "paragraph": "[{\"end\":2830,\"start\":2117},{\"end\":3146,\"start\":2832},{\"end\":4163,\"start\":3148},{\"end\":4569,\"start\":4165},{\"end\":6955,\"start\":4571},{\"end\":7714,\"start\":6957},{\"end\":8558,\"start\":7716},{\"end\":8761,\"start\":8594},{\"end\":10624,\"start\":8773},{\"end\":11699,\"start\":10640},{\"end\":12293,\"start\":11724},{\"end\":12827,\"start\":12295},{\"end\":13720,\"start\":12829},{\"end\":14736,\"start\":13744},{\"end\":15903,\"start\":14738},{\"end\":16132,\"start\":15920},{\"end\":17138,\"start\":16134},{\"end\":17421,\"start\":17169},{\"end\":17630,\"start\":17460},{\"end\":18240,\"start\":17632},{\"end\":19381,\"start\":18242},{\"end\":20218,\"start\":19383},{\"end\":20419,\"start\":20254},{\"end\":20561,\"start\":20421},{\"end\":21225,\"start\":20563},{\"end\":21750,\"start\":21227},{\"end\":21976,\"start\":21752},{\"end\":22774,\"start\":22007},{\"end\":23309,\"start\":22776},{\"end\":23823,\"start\":23311},{\"end\":24190,\"start\":23825},{\"end\":24392,\"start\":24207},{\"end\":24853,\"start\":24406},{\"end\":25503,\"start\":24855},{\"end\":26069,\"start\":25505},{\"end\":26950,\"start\":26071},{\"end\":27789,\"start\":26986},{\"end\":29089,\"start\":27791},{\"end\":30173,\"start\":29091},{\"end\":31105,\"start\":30175},{\"end\":31211,\"start\":31107},{\"end\":31524,\"start\":31213},{\"end\":32867,\"start\":31548},{\"end\":33936,\"start\":32880},{\"end\":34245,\"start\":33938},{\"end\":35106,\"start\":34247},{\"end\":35633,\"start\":35108},{\"end\":36658,\"start\":35635},{\"end\":37078,\"start\":36660},{\"end\":37208,\"start\":37095},{\"end\":38142,\"start\":37215},{\"end\":38609,\"start\":38144},{\"end\":38732,\"start\":38629},{\"end\":39359,\"start\":38761},{\"end\":39852,\"start\":39380},{\"end\":40216,\"start\":39854},{\"end\":40777,\"start\":40237},{\"end\":41115,\"start\":40779},{\"end\":41772,\"start\":41117},{\"end\":42166,\"start\":41795},{\"end\":42719,\"start\":42168},{\"end\":43422,\"start\":42721},{\"end\":43798,\"start\":43424},{\"end\":44064,\"start\":43810},{\"end\":44146,\"start\":44114},{\"end\":44925,\"start\":44148},{\"end\":47662,\"start\":44927},{\"end\":48360,\"start\":47667},{\"end\":48807,\"start\":48478},{\"end\":49682,\"start\":48809},{\"end\":50501,\"start\":49684},{\"end\":50596,\"start\":50564},{\"end\":53027,\"start\":50598},{\"end\":53595,\"start\":53029},{\"end\":54176,\"start\":53597},{\"end\":55326,\"start\":54178},{\"end\":56020,\"start\":55328},{\"end\":56848,\"start\":56022},{\"end\":57972,\"start\":56850},{\"end\":58802,\"start\":57974},{\"end\":59370,\"start\":58804},{\"end\":63535,\"start\":59483},{\"end\":64530,\"start\":63537},{\"end\":66026,\"start\":64552},{\"end\":68179,\"start\":66028},{\"end\":68397,\"start\":68181},{\"end\":68587,\"start\":68399},{\"end\":69139,\"start\":68589},{\"end\":69548,\"start\":69141},{\"end\":70966,\"start\":69591},{\"end\":71358,\"start\":70968},{\"end\":71483,\"start\":71382},{\"end\":72155,\"start\":71505},{\"end\":72859,\"start\":72177},{\"end\":73353,\"start\":72861},{\"end\":73877,\"start\":73376},{\"end\":74795,\"start\":73909},{\"end\":75523,\"start\":74797},{\"end\":76114,\"start\":75548},{\"end\":76694,\"start\":76116},{\"end\":77379,\"start\":76696},{\"end\":78473,\"start\":77381},{\"end\":78573,\"start\":78475},{\"end\":78832,\"start\":78595},{\"end\":79239,\"start\":78834},{\"end\":80483,\"start\":79241},{\"end\":81237,\"start\":80485},{\"end\":81450,\"start\":81239},{\"end\":82007,\"start\":81452},{\"end\":82839,\"start\":82009},{\"end\":83154,\"start\":82841},{\"end\":83727,\"start\":83156},{\"end\":84142,\"start\":83729},{\"end\":85063,\"start\":84144},{\"end\":85836,\"start\":85065},{\"end\":86067,\"start\":85838},{\"end\":86832,\"start\":86069},{\"end\":87561,\"start\":86834},{\"end\":88215,\"start\":87563},{\"end\":88668,\"start\":88217},{\"end\":89375,\"start\":88670},{\"end\":89818,\"start\":89377},{\"end\":90300,\"start\":89833},{\"end\":92018,\"start\":90302},{\"end\":93735,\"start\":92038},{\"end\":94215,\"start\":93737},{\"end\":94772,\"start\":94217},{\"end\":95465,\"start\":94774},{\"end\":95919,\"start\":95467},{\"end\":96307,\"start\":95921},{\"end\":97134,\"start\":96309}]", "formula": "[{\"attributes\":{\"id\":\"formula_0\"},\"end\":47666,\"start\":47663}]", "table_ref": "[{\"attributes\":{\"ref_id\":\"tab_1\"},\"end\":29831,\"start\":29824},{\"attributes\":{\"ref_id\":\"tab_2\"},\"end\":36498,\"start\":36491},{\"attributes\":{\"ref_id\":\"tab_1\"},\"end\":47778,\"start\":47771}]", "section_header": "[{\"attributes\":{\"n\":\"1\"},\"end\":2115,\"start\":2103},{\"attributes\":{\"n\":\"2\"},\"end\":8592,\"start\":8561},{\"attributes\":{\"n\":\"2.1\"},\"end\":8771,\"start\":8764},{\"attributes\":{\"n\":\"2.2\"},\"end\":10638,\"start\":10627},{\"attributes\":{\"n\":\"2.3\"},\"end\":11722,\"start\":11702},{\"attributes\":{\"n\":\"2.4\"},\"end\":13742,\"start\":13723},{\"attributes\":{\"n\":\"2.5\"},\"end\":15918,\"start\":15906},{\"attributes\":{\"n\":\"3\"},\"end\":17167,\"start\":17141},{\"attributes\":{\"n\":\"3.1\"},\"end\":17458,\"start\":17424},{\"attributes\":{\"n\":\"3.2\"},\"end\":20252,\"start\":20221},{\"attributes\":{\"n\":\"3.3\"},\"end\":22005,\"start\":21979},{\"attributes\":{\"n\":\"4\"},\"end\":24205,\"start\":24193},{\"attributes\":{\"n\":\"4.1\"},\"end\":24404,\"start\":24395},{\"attributes\":{\"n\":\"4.2\"},\"end\":26984,\"start\":26953},{\"attributes\":{\"n\":\"4.3\"},\"end\":31546,\"start\":31527},{\"attributes\":{\"n\":\"4.4\"},\"end\":32878,\"start\":32870},{\"attributes\":{\"n\":\"4.5\"},\"end\":37093,\"start\":37081},{\"end\":37213,\"start\":37211},{\"attributes\":{\"n\":\"4.6\"},\"end\":38627,\"start\":38612},{\"attributes\":{\"n\":\"4.6.1\"},\"end\":38759,\"start\":38735},{\"attributes\":{\"n\":\"4.6.2\"},\"end\":39378,\"start\":39362},{\"attributes\":{\"n\":\"4.6.3\"},\"end\":40235,\"start\":40219},{\"attributes\":{\"n\":\"4.6.4\"},\"end\":41793,\"start\":41775},{\"attributes\":{\"n\":\"5\"},\"end\":43808,\"start\":43801},{\"attributes\":{\"n\":\"5.1\"},\"end\":44112,\"start\":44067},{\"attributes\":{\"n\":\"5.3\"},\"end\":48476,\"start\":48363},{\"attributes\":{\"n\":\"6\"},\"end\":50514,\"start\":50504},{\"attributes\":{\"n\":\"6.1\"},\"end\":50562,\"start\":50517},{\"attributes\":{\"n\":\"6.2\"},\"end\":59481,\"start\":59373},{\"attributes\":{\"n\":\"7\"},\"end\":64550,\"start\":64533},{\"attributes\":{\"n\":\"8\"},\"end\":69589,\"start\":69551},{\"attributes\":{\"n\":\"9\"},\"end\":71380,\"start\":71361},{\"attributes\":{\"n\":\"9.1\"},\"end\":71503,\"start\":71486},{\"attributes\":{\"n\":\"9.2\"},\"end\":72175,\"start\":72158},{\"attributes\":{\"n\":\"9.3\"},\"end\":73374,\"start\":73356},{\"attributes\":{\"n\":\"10\"},\"end\":73892,\"start\":73880},{\"attributes\":{\"n\":\"10.1\"},\"end\":73907,\"start\":73895},{\"attributes\":{\"n\":\"10.2\"},\"end\":75546,\"start\":75526},{\"attributes\":{\"n\":\"11\"},\"end\":78593,\"start\":78576},{\"attributes\":{\"n\":\"12\"},\"end\":89831,\"start\":89821},{\"end\":92036,\"start\":92021},{\"end\":97144,\"start\":97136},{\"end\":97183,\"start\":97175},{\"end\":97263,\"start\":97255},{\"end\":97337,\"start\":97329},{\"end\":97664,\"start\":97656},{\"end\":97861,\"start\":97853},{\"end\":98093,\"start\":98085},{\"end\":98335,\"start\":98327},{\"end\":98569,\"start\":98561},{\"end\":98628,\"start\":98619},{\"end\":98710,\"start\":98703},{\"end\":98988,\"start\":98981}]", "table": "[{\"end\":98979,\"start\":98712},{\"end\":99985,\"start\":99382},{\"end\":100202,\"start\":100035}]", "figure_caption": "[{\"end\":97173,\"start\":97146},{\"end\":97253,\"start\":97185},{\"end\":97327,\"start\":97265},{\"end\":97654,\"start\":97339},{\"end\":97851,\"start\":97666},{\"end\":98083,\"start\":97863},{\"end\":98325,\"start\":98095},{\"end\":98559,\"start\":98337},{\"end\":98617,\"start\":98571},{\"end\":98701,\"start\":98631},{\"end\":99382,\"start\":98990},{\"end\":100035,\"start\":99988}]", "figure_ref": "[{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":18360,\"start\":18352},{\"attributes\":{\"ref_id\":\"fig_1\"},\"end\":22248,\"start\":22242},{\"attributes\":{\"ref_id\":\"fig_2\"},\"end\":23013,\"start\":23007},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":23417,\"start\":23410},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":23863,\"start\":23856},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":24128,\"start\":24119},{\"attributes\":{\"ref_id\":\"fig_1\"},\"end\":27369,\"start\":27363},{\"attributes\":{\"ref_id\":\"fig_1\"},\"end\":33127,\"start\":33121},{\"attributes\":{\"ref_id\":\"fig_2\"},\"end\":34108,\"start\":34102},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":39021,\"start\":39013},{\"attributes\":{\"ref_id\":\"fig_3\"},\"end\":44157,\"start\":44151},{\"attributes\":{\"ref_id\":\"fig_4\"},\"end\":45330,\"start\":45324},{\"attributes\":{\"ref_id\":\"fig_4\"},\"end\":45425,\"start\":45419},{\"attributes\":{\"ref_id\":\"fig_5\"},\"end\":46065,\"start\":46059},{\"attributes\":{\"ref_id\":\"fig_3\"},\"end\":48569,\"start\":48563},{\"attributes\":{\"ref_id\":\"fig_6\"},\"end\":48806,\"start\":48792},{\"attributes\":{\"ref_id\":\"fig_3\"},\"end\":49446,\"start\":49439},{\"attributes\":{\"ref_id\":\"fig_9\"},\"end\":66435,\"start\":66429},{\"attributes\":{\"ref_id\":\"fig_4\"},\"end\":68586,\"start\":68579},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":70965,\"start\":70958}]", "bib_author_first_name": "[{\"end\":100424,\"start\":100423},{\"end\":100435,\"start\":100434},{\"end\":100437,\"start\":100436},{\"end\":100696,\"start\":100695},{\"end\":100708,\"start\":100707},{\"end\":100717,\"start\":100716},{\"end\":100727,\"start\":100726},{\"end\":101129,\"start\":101128},{\"end\":101136,\"start\":101135},{\"end\":101147,\"start\":101146},{\"end\":101156,\"start\":101155},{\"end\":101170,\"start\":101169},{\"end\":101180,\"start\":101179},{\"end\":101508,\"start\":101507},{\"end\":101520,\"start\":101519},{\"end\":101532,\"start\":101531},{\"end\":101753,\"start\":101752},{\"end\":101766,\"start\":101765},{\"end\":102146,\"start\":102145},{\"end\":102159,\"start\":102158},{\"end\":102505,\"start\":102504},{\"end\":102517,\"start\":102516},{\"end\":102531,\"start\":102530},{\"end\":102537,\"start\":102536},{\"end\":102547,\"start\":102546},{\"end\":102841,\"start\":102840},{\"end\":102850,\"start\":102849},{\"end\":103196,\"start\":103195},{\"end\":103206,\"start\":103205},{\"end\":103215,\"start\":103214},{\"end\":103225,\"start\":103224},{\"end\":103572,\"start\":103571},{\"end\":103583,\"start\":103582},{\"end\":103594,\"start\":103593},{\"end\":103606,\"start\":103605},{\"end\":103984,\"start\":103983},{\"end\":103991,\"start\":103990},{\"end\":104252,\"start\":104251},{\"end\":104458,\"start\":104457},{\"end\":104733,\"start\":104732},{\"end\":104743,\"start\":104742},{\"end\":105031,\"start\":105030},{\"end\":105045,\"start\":105044},{\"end\":105047,\"start\":105046},{\"end\":105057,\"start\":105056},{\"end\":105069,\"start\":105068},{\"end\":105079,\"start\":105078},{\"end\":105090,\"start\":105089},{\"end\":105434,\"start\":105433},{\"end\":105444,\"start\":105443},{\"end\":105454,\"start\":105453},{\"end\":105462,\"start\":105461},{\"end\":105471,\"start\":105470},{\"end\":105827,\"start\":105826},{\"end\":106040,\"start\":106039},{\"end\":106050,\"start\":106049},{\"end\":106058,\"start\":106057},{\"end\":106355,\"start\":106354},{\"end\":106364,\"start\":106363},{\"end\":106736,\"start\":106735},{\"end\":106738,\"start\":106737},{\"end\":106749,\"start\":106748},{\"end\":106751,\"start\":106750},{\"end\":107068,\"start\":107067},{\"end\":107269,\"start\":107268},{\"end\":107592,\"start\":107591},{\"end\":107604,\"start\":107603},{\"end\":107615,\"start\":107614},{\"end\":107628,\"start\":107627},{\"end\":107634,\"start\":107633},{\"end\":107913,\"start\":107912},{\"end\":107923,\"start\":107922},{\"end\":107934,\"start\":107933},{\"end\":107948,\"start\":107947},{\"end\":107958,\"start\":107957},{\"end\":107960,\"start\":107959},{\"end\":108375,\"start\":108374},{\"end\":108384,\"start\":108383},{\"end\":108392,\"start\":108391},{\"end\":108849,\"start\":108848},{\"end\":108861,\"start\":108860},{\"end\":108867,\"start\":108866},{\"end\":108881,\"start\":108880},{\"end\":109229,\"start\":109228},{\"end\":109243,\"start\":109242},{\"end\":109251,\"start\":109250},{\"end\":109261,\"start\":109260},{\"end\":109509,\"start\":109508},{\"end\":109523,\"start\":109522},{\"end\":109533,\"start\":109532},{\"end\":109543,\"start\":109542},{\"end\":109551,\"start\":109550},{\"end\":109917,\"start\":109916},{\"end\":109928,\"start\":109927},{\"end\":109943,\"start\":109942},{\"end\":109954,\"start\":109953},{\"end\":109968,\"start\":109967},{\"end\":110348,\"start\":110347},{\"end\":110362,\"start\":110361},{\"end\":110380,\"start\":110379},{\"end\":110390,\"start\":110389},{\"end\":110404,\"start\":110403},{\"end\":110415,\"start\":110414},{\"end\":110806,\"start\":110805},{\"end\":110816,\"start\":110815},{\"end\":110829,\"start\":110828},{\"end\":110837,\"start\":110836},{\"end\":110852,\"start\":110851},{\"end\":110861,\"start\":110860},{\"end\":110868,\"start\":110867},{\"end\":110880,\"start\":110879},{\"end\":110890,\"start\":110889},{\"end\":111220,\"start\":111219},{\"end\":111230,\"start\":111229},{\"end\":111237,\"start\":111236},{\"end\":111574,\"start\":111573},{\"end\":111583,\"start\":111582},{\"end\":111596,\"start\":111595},{\"end\":111917,\"start\":111916},{\"end\":112165,\"start\":112164},{\"end\":112179,\"start\":112178},{\"end\":112444,\"start\":112443},{\"end\":112453,\"start\":112452},{\"end\":112462,\"start\":112461},{\"end\":112464,\"start\":112463},{\"end\":112476,\"start\":112475},{\"end\":112493,\"start\":112492},{\"end\":112803,\"start\":112802},{\"end\":112805,\"start\":112804},{\"end\":112818,\"start\":112817},{\"end\":112820,\"start\":112819},{\"end\":112828,\"start\":112827},{\"end\":112830,\"start\":112829},{\"end\":113032,\"start\":113031},{\"end\":113254,\"start\":113253},{\"end\":113266,\"start\":113265},{\"end\":113274,\"start\":113273},{\"end\":113517,\"start\":113516},{\"end\":113531,\"start\":113530},{\"end\":113741,\"start\":113740},{\"end\":113923,\"start\":113922},{\"end\":114079,\"start\":114078},{\"end\":114348,\"start\":114347},{\"end\":114361,\"start\":114360},{\"end\":114378,\"start\":114377},{\"end\":114750,\"start\":114749},{\"end\":114760,\"start\":114759},{\"end\":114773,\"start\":114772},{\"end\":115191,\"start\":115190},{\"end\":115407,\"start\":115406},{\"end\":115415,\"start\":115414},{\"end\":115436,\"start\":115435},{\"end\":115448,\"start\":115447},{\"end\":115818,\"start\":115817},{\"end\":115829,\"start\":115828},{\"end\":115837,\"start\":115836},{\"end\":116078,\"start\":116077},{\"end\":116089,\"start\":116088},{\"end\":116515,\"start\":116514},{\"end\":116519,\"start\":116518},{\"end\":116527,\"start\":116526},{\"end\":116816,\"start\":116815},{\"end\":116820,\"start\":116819},{\"end\":116828,\"start\":116827},{\"end\":117070,\"start\":117069},{\"end\":117081,\"start\":117080},{\"end\":117337,\"start\":117336},{\"end\":117349,\"start\":117348},{\"end\":117360,\"start\":117359},{\"end\":117373,\"start\":117372},{\"end\":117382,\"start\":117381},{\"end\":117394,\"start\":117390},{\"end\":117407,\"start\":117406},{\"end\":117735,\"start\":117734},{\"end\":117748,\"start\":117747},{\"end\":117761,\"start\":117760},{\"end\":118117,\"start\":118116},{\"end\":118508,\"start\":118507},{\"end\":118518,\"start\":118517},{\"end\":118530,\"start\":118529},{\"end\":118539,\"start\":118538},{\"end\":118547,\"start\":118546},{\"end\":118558,\"start\":118557},{\"end\":118565,\"start\":118561},{\"end\":118842,\"start\":118841},{\"end\":118857,\"start\":118856},{\"end\":119189,\"start\":119188},{\"end\":119196,\"start\":119195},{\"end\":119208,\"start\":119207},{\"end\":119214,\"start\":119213},{\"end\":119221,\"start\":119220},{\"end\":119506,\"start\":119505},{\"end\":119513,\"start\":119512},{\"end\":119525,\"start\":119524},{\"end\":119537,\"start\":119536},{\"end\":119544,\"start\":119543},{\"end\":119552,\"start\":119551},{\"end\":119559,\"start\":119558},{\"end\":119987,\"start\":119986},{\"end\":119989,\"start\":119988},{\"end\":120000,\"start\":119999},{\"end\":120002,\"start\":120001},{\"end\":120011,\"start\":120010},{\"end\":120297,\"start\":120296},{\"end\":120307,\"start\":120306},{\"end\":120321,\"start\":120320},{\"end\":120334,\"start\":120333},{\"end\":120346,\"start\":120345},{\"end\":120625,\"start\":120624},{\"end\":120865,\"start\":120864},{\"end\":120878,\"start\":120877},{\"end\":120889,\"start\":120888},{\"end\":120908,\"start\":120907},{\"end\":121235,\"start\":121234},{\"end\":121245,\"start\":121244},{\"end\":121257,\"start\":121256},{\"end\":121270,\"start\":121269},{\"end\":121502,\"start\":121501},{\"end\":121511,\"start\":121510},{\"end\":121519,\"start\":121518},{\"end\":121736,\"start\":121735},{\"end\":121748,\"start\":121747},{\"end\":121760,\"start\":121759},{\"end\":121772,\"start\":121771},{\"end\":121785,\"start\":121784},{\"end\":121795,\"start\":121794},{\"end\":121799,\"start\":121796},{\"end\":122156,\"start\":122155},{\"end\":122168,\"start\":122167},{\"end\":122177,\"start\":122176},{\"end\":122186,\"start\":122185},{\"end\":122196,\"start\":122195},{\"end\":122209,\"start\":122208},{\"end\":122211,\"start\":122210},{\"end\":122595,\"start\":122594},{\"end\":122604,\"start\":122603},{\"end\":122613,\"start\":122612},{\"end\":122622,\"start\":122621},{\"end\":122638,\"start\":122634},{\"end\":122648,\"start\":122647},{\"end\":122967,\"start\":122966},{\"end\":122977,\"start\":122976},{\"end\":122991,\"start\":122990},{\"end\":123289,\"start\":123288},{\"end\":123306,\"start\":123305},{\"end\":123313,\"start\":123312},{\"end\":123321,\"start\":123320},{\"end\":123332,\"start\":123331},{\"end\":123340,\"start\":123339},{\"end\":123640,\"start\":123639},{\"end\":123655,\"start\":123651},{\"end\":123664,\"start\":123663},{\"end\":123675,\"start\":123674},{\"end\":123686,\"start\":123685},{\"end\":124016,\"start\":124015},{\"end\":124268,\"start\":124267},{\"end\":124281,\"start\":124280},{\"end\":124294,\"start\":124293},{\"end\":124298,\"start\":124297},{\"end\":124666,\"start\":124665},{\"end\":124941,\"start\":124940},{\"end\":124951,\"start\":124950},{\"end\":125215,\"start\":125214},{\"end\":125225,\"start\":125224},{\"end\":125237,\"start\":125236},{\"end\":125618,\"start\":125617},{\"end\":125628,\"start\":125627},{\"end\":125640,\"start\":125639},{\"end\":125650,\"start\":125649},{\"end\":125658,\"start\":125657},{\"end\":126076,\"start\":126075},{\"end\":126086,\"start\":126085},{\"end\":126098,\"start\":126097},{\"end\":126108,\"start\":126107},{\"end\":126116,\"start\":126115},{\"end\":126130,\"start\":126129},{\"end\":126429,\"start\":126428},{\"end\":126431,\"start\":126430},{\"end\":126442,\"start\":126441},{\"end\":126453,\"start\":126452},{\"end\":126768,\"start\":126767},{\"end\":126780,\"start\":126779},{\"end\":126787,\"start\":126786},{\"end\":126797,\"start\":126796},{\"end\":127091,\"start\":127090},{\"end\":127104,\"start\":127103},{\"end\":127113,\"start\":127112},{\"end\":127370,\"start\":127369},{\"end\":127383,\"start\":127382},{\"end\":127654,\"start\":127653},{\"end\":127890,\"start\":127889},{\"end\":128124,\"start\":128123},{\"end\":128134,\"start\":128133},{\"end\":128143,\"start\":128142},{\"end\":128151,\"start\":128150},{\"end\":128161,\"start\":128160},{\"end\":128562,\"start\":128561},{\"end\":128577,\"start\":128576},{\"end\":128586,\"start\":128585},{\"end\":128597,\"start\":128596},{\"end\":128607,\"start\":128606},{\"end\":129024,\"start\":129023},{\"end\":129257,\"start\":129256},{\"end\":129268,\"start\":129267},{\"end\":129279,\"start\":129278},{\"end\":129289,\"start\":129288},{\"end\":129299,\"start\":129298},{\"end\":129310,\"start\":129309},{\"end\":129614,\"start\":129613},{\"end\":129627,\"start\":129626},{\"end\":129913,\"start\":129912},{\"end\":129930,\"start\":129929},{\"end\":129940,\"start\":129939},{\"end\":130284,\"start\":130283},{\"end\":130295,\"start\":130294},{\"end\":130303,\"start\":130302},{\"end\":130313,\"start\":130312},{\"end\":130324,\"start\":130323},{\"end\":130682,\"start\":130681},{\"end\":130693,\"start\":130692},{\"end\":130704,\"start\":130703},{\"end\":130908,\"start\":130907},{\"end\":131134,\"start\":131133},{\"end\":131148,\"start\":131147},{\"end\":131158,\"start\":131157},{\"end\":131169,\"start\":131168},{\"end\":131189,\"start\":131188},{\"end\":131203,\"start\":131202},{\"end\":131569,\"start\":131568},{\"end\":131571,\"start\":131570},{\"end\":131833,\"start\":131832},{\"end\":131848,\"start\":131847},{\"end\":132106,\"start\":132105},{\"end\":132338,\"start\":132337},{\"end\":132350,\"start\":132349},{\"end\":132363,\"start\":132362},{\"end\":132371,\"start\":132370},{\"end\":132381,\"start\":132380},{\"end\":132391,\"start\":132390},{\"end\":132400,\"start\":132399},{\"end\":132859,\"start\":132858},{\"end\":132871,\"start\":132870},{\"end\":132881,\"start\":132880},{\"end\":132889,\"start\":132888},{\"end\":132899,\"start\":132898},{\"end\":132911,\"start\":132910},{\"end\":132920,\"start\":132919},{\"end\":132929,\"start\":132928},{\"end\":133287,\"start\":133286},{\"end\":133299,\"start\":133298},{\"end\":133309,\"start\":133308},{\"end\":133319,\"start\":133318},{\"end\":133327,\"start\":133326},{\"end\":133341,\"start\":133340},{\"end\":133351,\"start\":133350},{\"end\":133360,\"start\":133359},{\"end\":133372,\"start\":133371},{\"end\":133764,\"start\":133763},{\"end\":133775,\"start\":133774},{\"end\":133784,\"start\":133783},{\"end\":133796,\"start\":133795},{\"end\":133807,\"start\":133806},{\"end\":133818,\"start\":133817},{\"end\":134106,\"start\":134105},{\"end\":134108,\"start\":134107},{\"end\":134117,\"start\":134116},{\"end\":134126,\"start\":134125},{\"end\":134133,\"start\":134132},{\"end\":134135,\"start\":134134},{\"end\":134144,\"start\":134143},{\"end\":134155,\"start\":134154},{\"end\":134170,\"start\":134169},{\"end\":134172,\"start\":134171},{\"end\":134182,\"start\":134181},{\"end\":134534,\"start\":134533},{\"end\":134543,\"start\":134542},{\"end\":134554,\"start\":134553},{\"end\":134834,\"start\":134833},{\"end\":135039,\"start\":135038},{\"end\":135052,\"start\":135051},{\"end\":135316,\"start\":135315},{\"end\":135324,\"start\":135323},{\"end\":135334,\"start\":135333},{\"end\":135355,\"start\":135345},{\"end\":135680,\"start\":135679},{\"end\":135692,\"start\":135691},{\"end\":135701,\"start\":135700},{\"end\":135711,\"start\":135710},{\"end\":135721,\"start\":135720},{\"end\":135725,\"start\":135724},{\"end\":136175,\"start\":136174},{\"end\":136185,\"start\":136184},{\"end\":136539,\"start\":136538},{\"end\":136555,\"start\":136554},{\"end\":136565,\"start\":136564},{\"end\":136575,\"start\":136574},{\"end\":136586,\"start\":136582},{\"end\":136596,\"start\":136595},{\"end\":136607,\"start\":136606},{\"end\":136619,\"start\":136618},{\"end\":136633,\"start\":136632},{\"end\":136944,\"start\":136943},{\"end\":136981,\"start\":136980},{\"end\":136983,\"start\":136982},{\"end\":137114,\"start\":137113},{\"end\":137238,\"start\":137237},{\"end\":137249,\"start\":137248}]", "bib_author_last_name": "[{\"end\":100430,\"start\":100425},{\"end\":100444,\"start\":100438},{\"end\":100705,\"start\":100697},{\"end\":100714,\"start\":100709},{\"end\":100724,\"start\":100718},{\"end\":100735,\"start\":100728},{\"end\":101133,\"start\":101130},{\"end\":101144,\"start\":101137},{\"end\":101153,\"start\":101148},{\"end\":101167,\"start\":101157},{\"end\":101177,\"start\":101171},{\"end\":101185,\"start\":101181},{\"end\":101517,\"start\":101509},{\"end\":101529,\"start\":101521},{\"end\":101543,\"start\":101533},{\"end\":101763,\"start\":101754},{\"end\":101776,\"start\":101767},{\"end\":102156,\"start\":102147},{\"end\":102168,\"start\":102160},{\"end\":102514,\"start\":102506},{\"end\":102528,\"start\":102518},{\"end\":102534,\"start\":102532},{\"end\":102544,\"start\":102538},{\"end\":102555,\"start\":102548},{\"end\":102566,\"start\":102557},{\"end\":102847,\"start\":102842},{\"end\":102859,\"start\":102851},{\"end\":103203,\"start\":103197},{\"end\":103212,\"start\":103207},{\"end\":103222,\"start\":103216},{\"end\":103232,\"start\":103226},{\"end\":103580,\"start\":103573},{\"end\":103591,\"start\":103584},{\"end\":103603,\"start\":103595},{\"end\":103614,\"start\":103607},{\"end\":103988,\"start\":103985},{\"end\":103996,\"start\":103992},{\"end\":104261,\"start\":104253},{\"end\":104465,\"start\":104459},{\"end\":104740,\"start\":104734},{\"end\":104750,\"start\":104744},{\"end\":105042,\"start\":105032},{\"end\":105054,\"start\":105048},{\"end\":105066,\"start\":105058},{\"end\":105076,\"start\":105070},{\"end\":105087,\"start\":105080},{\"end\":105105,\"start\":105091},{\"end\":105441,\"start\":105435},{\"end\":105451,\"start\":105445},{\"end\":105459,\"start\":105455},{\"end\":105468,\"start\":105463},{\"end\":105478,\"start\":105472},{\"end\":105836,\"start\":105828},{\"end\":106047,\"start\":106041},{\"end\":106055,\"start\":106051},{\"end\":106065,\"start\":106059},{\"end\":106361,\"start\":106356},{\"end\":106367,\"start\":106365},{\"end\":106746,\"start\":106739},{\"end\":106758,\"start\":106752},{\"end\":107073,\"start\":107069},{\"end\":107278,\"start\":107270},{\"end\":107601,\"start\":107593},{\"end\":107612,\"start\":107605},{\"end\":107625,\"start\":107616},{\"end\":107631,\"start\":107629},{\"end\":107642,\"start\":107635},{\"end\":107650,\"start\":107644},{\"end\":107920,\"start\":107914},{\"end\":107931,\"start\":107924},{\"end\":107945,\"start\":107935},{\"end\":107955,\"start\":107949},{\"end\":107967,\"start\":107961},{\"end\":108381,\"start\":108376},{\"end\":108389,\"start\":108385},{\"end\":108401,\"start\":108393},{\"end\":108858,\"start\":108850},{\"end\":108864,\"start\":108862},{\"end\":108878,\"start\":108868},{\"end\":108889,\"start\":108882},{\"end\":109240,\"start\":109230},{\"end\":109248,\"start\":109244},{\"end\":109258,\"start\":109252},{\"end\":109520,\"start\":109510},{\"end\":109530,\"start\":109524},{\"end\":109540,\"start\":109534},{\"end\":109548,\"start\":109544},{\"end\":109561,\"start\":109552},{\"end\":109925,\"start\":109918},{\"end\":109940,\"start\":109929},{\"end\":109951,\"start\":109944},{\"end\":109965,\"start\":109955},{\"end\":109979,\"start\":109969},{\"end\":110359,\"start\":110349},{\"end\":110377,\"start\":110363},{\"end\":110387,\"start\":110381},{\"end\":110401,\"start\":110391},{\"end\":110412,\"start\":110405},{\"end\":110425,\"start\":110416},{\"end\":110813,\"start\":110807},{\"end\":110826,\"start\":110817},{\"end\":110834,\"start\":110830},{\"end\":110849,\"start\":110838},{\"end\":110858,\"start\":110853},{\"end\":110865,\"start\":110862},{\"end\":110877,\"start\":110869},{\"end\":110887,\"start\":110881},{\"end\":110897,\"start\":110891},{\"end\":111227,\"start\":111221},{\"end\":111234,\"start\":111231},{\"end\":111242,\"start\":111238},{\"end\":111580,\"start\":111575},{\"end\":111593,\"start\":111584},{\"end\":111603,\"start\":111597},{\"end\":111928,\"start\":111918},{\"end\":112176,\"start\":112166},{\"end\":112184,\"start\":112180},{\"end\":112450,\"start\":112445},{\"end\":112459,\"start\":112454},{\"end\":112473,\"start\":112465},{\"end\":112490,\"start\":112477},{\"end\":112498,\"start\":112494},{\"end\":112815,\"start\":112806},{\"end\":112825,\"start\":112821},{\"end\":112837,\"start\":112831},{\"end\":113042,\"start\":113033},{\"end\":113263,\"start\":113255},{\"end\":113271,\"start\":113267},{\"end\":113279,\"start\":113275},{\"end\":113528,\"start\":113518},{\"end\":113537,\"start\":113532},{\"end\":113931,\"start\":113924},{\"end\":114088,\"start\":114080},{\"end\":114358,\"start\":114349},{\"end\":114375,\"start\":114362},{\"end\":114394,\"start\":114379},{\"end\":114757,\"start\":114751},{\"end\":114770,\"start\":114761},{\"end\":114783,\"start\":114774},{\"end\":115209,\"start\":115192},{\"end\":115412,\"start\":115408},{\"end\":115433,\"start\":115416},{\"end\":115445,\"start\":115437},{\"end\":115454,\"start\":115449},{\"end\":115826,\"start\":115819},{\"end\":115834,\"start\":115830},{\"end\":115846,\"start\":115838},{\"end\":116086,\"start\":116079},{\"end\":116095,\"start\":116090},{\"end\":116256,\"start\":116252},{\"end\":116263,\"start\":116258},{\"end\":116268,\"start\":116265},{\"end\":116524,\"start\":116520},{\"end\":116534,\"start\":116528},{\"end\":116825,\"start\":116821},{\"end\":116838,\"start\":116829},{\"end\":117078,\"start\":117071},{\"end\":117088,\"start\":117082},{\"end\":117346,\"start\":117338},{\"end\":117357,\"start\":117350},{\"end\":117370,\"start\":117361},{\"end\":117379,\"start\":117374},{\"end\":117388,\"start\":117383},{\"end\":117404,\"start\":117395},{\"end\":117413,\"start\":117408},{\"end\":117745,\"start\":117736},{\"end\":117758,\"start\":117749},{\"end\":117772,\"start\":117762},{\"end\":118124,\"start\":118118},{\"end\":118515,\"start\":118509},{\"end\":118527,\"start\":118519},{\"end\":118536,\"start\":118531},{\"end\":118544,\"start\":118540},{\"end\":118555,\"start\":118548},{\"end\":118577,\"start\":118566},{\"end\":118854,\"start\":118843},{\"end\":118865,\"start\":118858},{\"end\":119193,\"start\":119190},{\"end\":119205,\"start\":119197},{\"end\":119211,\"start\":119209},{\"end\":119218,\"start\":119215},{\"end\":119225,\"start\":119222},{\"end\":119510,\"start\":119507},{\"end\":119522,\"start\":119514},{\"end\":119534,\"start\":119526},{\"end\":119541,\"start\":119538},{\"end\":119549,\"start\":119545},{\"end\":119556,\"start\":119553},{\"end\":119563,\"start\":119560},{\"end\":119997,\"start\":119990},{\"end\":120008,\"start\":120003},{\"end\":120018,\"start\":120012},{\"end\":120304,\"start\":120298},{\"end\":120318,\"start\":120308},{\"end\":120331,\"start\":120322},{\"end\":120343,\"start\":120335},{\"end\":120356,\"start\":120347},{\"end\":120632,\"start\":120626},{\"end\":120875,\"start\":120866},{\"end\":120886,\"start\":120879},{\"end\":120905,\"start\":120890},{\"end\":120915,\"start\":120909},{\"end\":121242,\"start\":121236},{\"end\":121254,\"start\":121246},{\"end\":121267,\"start\":121258},{\"end\":121276,\"start\":121271},{\"end\":121508,\"start\":121503},{\"end\":121516,\"start\":121512},{\"end\":121522,\"start\":121520},{\"end\":121745,\"start\":121737},{\"end\":121757,\"start\":121749},{\"end\":121769,\"start\":121761},{\"end\":121782,\"start\":121773},{\"end\":121792,\"start\":121786},{\"end\":121806,\"start\":121800},{\"end\":122165,\"start\":122157},{\"end\":122174,\"start\":122169},{\"end\":122183,\"start\":122178},{\"end\":122193,\"start\":122187},{\"end\":122206,\"start\":122197},{\"end\":122218,\"start\":122212},{\"end\":122601,\"start\":122596},{\"end\":122610,\"start\":122605},{\"end\":122619,\"start\":122614},{\"end\":122632,\"start\":122623},{\"end\":122645,\"start\":122639},{\"end\":122655,\"start\":122649},{\"end\":122974,\"start\":122968},{\"end\":122988,\"start\":122978},{\"end\":122997,\"start\":122992},{\"end\":123303,\"start\":123290},{\"end\":123310,\"start\":123307},{\"end\":123318,\"start\":123314},{\"end\":123329,\"start\":123322},{\"end\":123337,\"start\":123333},{\"end\":123349,\"start\":123341},{\"end\":123649,\"start\":123641},{\"end\":123661,\"start\":123656},{\"end\":123672,\"start\":123665},{\"end\":123683,\"start\":123676},{\"end\":123695,\"start\":123687},{\"end\":124025,\"start\":124017},{\"end\":124278,\"start\":124269},{\"end\":124291,\"start\":124282},{\"end\":124305,\"start\":124299},{\"end\":124673,\"start\":124667},{\"end\":124948,\"start\":124942},{\"end\":124959,\"start\":124952},{\"end\":125222,\"start\":125216},{\"end\":125234,\"start\":125226},{\"end\":125244,\"start\":125238},{\"end\":125625,\"start\":125619},{\"end\":125637,\"start\":125629},{\"end\":125647,\"start\":125641},{\"end\":125655,\"start\":125651},{\"end\":125668,\"start\":125659},{\"end\":126083,\"start\":126077},{\"end\":126095,\"start\":126087},{\"end\":126105,\"start\":126099},{\"end\":126113,\"start\":126109},{\"end\":126127,\"start\":126117},{\"end\":126140,\"start\":126131},{\"end\":126439,\"start\":126432},{\"end\":126450,\"start\":126443},{\"end\":126459,\"start\":126454},{\"end\":126777,\"start\":126769},{\"end\":126784,\"start\":126781},{\"end\":126794,\"start\":126788},{\"end\":126805,\"start\":126798},{\"end\":127101,\"start\":127092},{\"end\":127110,\"start\":127105},{\"end\":127121,\"start\":127114},{\"end\":127380,\"start\":127371},{\"end\":127391,\"start\":127384},{\"end\":127663,\"start\":127655},{\"end\":127899,\"start\":127891},{\"end\":128131,\"start\":128125},{\"end\":128140,\"start\":128135},{\"end\":128148,\"start\":128144},{\"end\":128158,\"start\":128152},{\"end\":128168,\"start\":128162},{\"end\":128574,\"start\":128563},{\"end\":128583,\"start\":128578},{\"end\":128594,\"start\":128587},{\"end\":128604,\"start\":128598},{\"end\":128616,\"start\":128608},{\"end\":129030,\"start\":129025},{\"end\":129265,\"start\":129258},{\"end\":129276,\"start\":129269},{\"end\":129286,\"start\":129280},{\"end\":129296,\"start\":129290},{\"end\":129307,\"start\":129300},{\"end\":129318,\"start\":129311},{\"end\":129624,\"start\":129615},{\"end\":129634,\"start\":129628},{\"end\":129927,\"start\":129914},{\"end\":129937,\"start\":129931},{\"end\":129949,\"start\":129941},{\"end\":130292,\"start\":130285},{\"end\":130300,\"start\":130296},{\"end\":130310,\"start\":130304},{\"end\":130321,\"start\":130314},{\"end\":130333,\"start\":130325},{\"end\":130690,\"start\":130683},{\"end\":130701,\"start\":130694},{\"end\":130710,\"start\":130705},{\"end\":130914,\"start\":130909},{\"end\":131145,\"start\":131135},{\"end\":131155,\"start\":131149},{\"end\":131166,\"start\":131159},{\"end\":131186,\"start\":131170},{\"end\":131200,\"start\":131190},{\"end\":131211,\"start\":131204},{\"end\":131579,\"start\":131572},{\"end\":131845,\"start\":131834},{\"end\":131854,\"start\":131849},{\"end\":132114,\"start\":132107},{\"end\":132347,\"start\":132339},{\"end\":132360,\"start\":132351},{\"end\":132368,\"start\":132364},{\"end\":132378,\"start\":132372},{\"end\":132388,\"start\":132382},{\"end\":132397,\"start\":132392},{\"end\":132406,\"start\":132401},{\"end\":132868,\"start\":132860},{\"end\":132878,\"start\":132872},{\"end\":132886,\"start\":132882},{\"end\":132896,\"start\":132890},{\"end\":132908,\"start\":132900},{\"end\":132917,\"start\":132912},{\"end\":132926,\"start\":132921},{\"end\":132939,\"start\":132930},{\"end\":133296,\"start\":133288},{\"end\":133306,\"start\":133300},{\"end\":133316,\"start\":133310},{\"end\":133324,\"start\":133320},{\"end\":133338,\"start\":133328},{\"end\":133348,\"start\":133342},{\"end\":133357,\"start\":133352},{\"end\":133369,\"start\":133361},{\"end\":133382,\"start\":133373},{\"end\":133772,\"start\":133765},{\"end\":133781,\"start\":133776},{\"end\":133793,\"start\":133785},{\"end\":133804,\"start\":133797},{\"end\":133815,\"start\":133808},{\"end\":133824,\"start\":133819},{\"end\":134114,\"start\":134109},{\"end\":134123,\"start\":134118},{\"end\":134130,\"start\":134127},{\"end\":134141,\"start\":134136},{\"end\":134152,\"start\":134145},{\"end\":134167,\"start\":134156},{\"end\":134179,\"start\":134173},{\"end\":134189,\"start\":134183},{\"end\":134540,\"start\":134535},{\"end\":134551,\"start\":134544},{\"end\":134561,\"start\":134555},{\"end\":134842,\"start\":134835},{\"end\":135049,\"start\":135040},{\"end\":135061,\"start\":135053},{\"end\":135321,\"start\":135317},{\"end\":135331,\"start\":135325},{\"end\":135343,\"start\":135335},{\"end\":135362,\"start\":135356},{\"end\":135689,\"start\":135681},{\"end\":135698,\"start\":135693},{\"end\":135708,\"start\":135702},{\"end\":135718,\"start\":135712},{\"end\":135735,\"start\":135726},{\"end\":136182,\"start\":136176},{\"end\":136194,\"start\":136186},{\"end\":136552,\"start\":136540},{\"end\":136562,\"start\":136556},{\"end\":136572,\"start\":136566},{\"end\":136580,\"start\":136576},{\"end\":136593,\"start\":136587},{\"end\":136604,\"start\":136597},{\"end\":136616,\"start\":136608},{\"end\":136630,\"start\":136620},{\"end\":136639,\"start\":136634},{\"end\":136950,\"start\":136945},{\"end\":136960,\"start\":136952},{\"end\":136969,\"start\":136962},{\"end\":136978,\"start\":136971},{\"end\":136990,\"start\":136984},{\"end\":137119,\"start\":137115},{\"end\":137246,\"start\":137239},{\"end\":137255,\"start\":137250}]", "bib_entry": "[{\"attributes\":{\"id\":\"b0\",\"matched_paper_id\":9570340},\"end\":100589,\"start\":100383},{\"attributes\":{\"id\":\"b1\",\"matched_paper_id\":12156285},\"end\":101018,\"start\":100591},{\"attributes\":{\"id\":\"b2\",\"matched_paper_id\":145561002},\"end\":101440,\"start\":101020},{\"attributes\":{\"id\":\"b3\",\"matched_paper_id\":27046980},\"end\":101720,\"start\":101442},{\"attributes\":{\"id\":\"b4\",\"matched_paper_id\":915703},\"end\":102050,\"start\":101722},{\"attributes\":{\"id\":\"b5\",\"matched_paper_id\":45174121},\"end\":102438,\"start\":102052},{\"attributes\":{\"id\":\"b6\",\"matched_paper_id\":22769692},\"end\":102771,\"start\":102440},{\"attributes\":{\"id\":\"b7\",\"matched_paper_id\":3915092},\"end\":103087,\"start\":102773},{\"attributes\":{\"id\":\"b8\",\"matched_paper_id\":14049278},\"end\":103464,\"start\":103089},{\"attributes\":{\"id\":\"b9\",\"matched_paper_id\":14337682},\"end\":103871,\"start\":103466},{\"attributes\":{\"id\":\"b10\",\"matched_paper_id\":16919987},\"end\":104201,\"start\":103873},{\"attributes\":{\"id\":\"b11\"},\"end\":104379,\"start\":104203},{\"attributes\":{\"id\":\"b12\",\"matched_paper_id\":15223071},\"end\":104659,\"start\":104381},{\"attributes\":{\"id\":\"b13\",\"matched_paper_id\":35096359},\"end\":104938,\"start\":104661},{\"attributes\":{\"id\":\"b14\",\"matched_paper_id\":13667947},\"end\":105350,\"start\":104940},{\"attributes\":{\"id\":\"b15\",\"matched_paper_id\":23359550},\"end\":105762,\"start\":105352},{\"attributes\":{\"id\":\"b16\",\"matched_paper_id\":14287238},\"end\":105980,\"start\":105764},{\"attributes\":{\"id\":\"b17\",\"matched_paper_id\":3002027},\"end\":106247,\"start\":105982},{\"attributes\":{\"id\":\"b18\",\"matched_paper_id\":32073298},\"end\":106635,\"start\":106249},{\"attributes\":{\"id\":\"b19\",\"matched_paper_id\":18197756},\"end\":106985,\"start\":106637},{\"attributes\":{\"id\":\"b20\",\"matched_paper_id\":145247944},\"end\":107226,\"start\":106987},{\"attributes\":{\"id\":\"b21\",\"matched_paper_id\":11112895},\"end\":107518,\"start\":107228},{\"attributes\":{\"id\":\"b22\",\"matched_paper_id\":10919645},\"end\":107858,\"start\":107520},{\"attributes\":{\"id\":\"b23\",\"matched_paper_id\":17387676},\"end\":108204,\"start\":107860},{\"attributes\":{\"id\":\"b24\",\"matched_paper_id\":142603303},\"end\":108760,\"start\":108206},{\"attributes\":{\"id\":\"b25\",\"matched_paper_id\":51711377},\"end\":109165,\"start\":108762},{\"attributes\":{\"id\":\"b26\",\"matched_paper_id\":5643707},\"end\":109472,\"start\":109167},{\"attributes\":{\"id\":\"b27\",\"matched_paper_id\":1306566},\"end\":109799,\"start\":109474},{\"attributes\":{\"id\":\"b28\",\"matched_paper_id\":16157111},\"end\":110251,\"start\":109801},{\"attributes\":{\"id\":\"b29\",\"matched_paper_id\":13251668},\"end\":110628,\"start\":110253},{\"attributes\":{\"id\":\"b30\"},\"end\":110744,\"start\":110630},{\"attributes\":{\"id\":\"b31\",\"matched_paper_id\":6102161},\"end\":111142,\"start\":110746},{\"attributes\":{\"id\":\"b32\",\"matched_paper_id\":14730314},\"end\":111477,\"start\":111144},{\"attributes\":{\"id\":\"b33\",\"matched_paper_id\":17710230},\"end\":111858,\"start\":111479},{\"attributes\":{\"id\":\"b34\",\"matched_paper_id\":16634731},\"end\":112083,\"start\":111860},{\"attributes\":{\"id\":\"b35\",\"matched_paper_id\":18121167},\"end\":112354,\"start\":112085},{\"attributes\":{\"id\":\"b36\",\"matched_paper_id\":207211121},\"end\":112760,\"start\":112356},{\"attributes\":{\"id\":\"b37\"},\"end\":113003,\"start\":112762},{\"attributes\":{\"id\":\"b38\"},\"end\":113189,\"start\":113005},{\"attributes\":{\"id\":\"b39\",\"matched_paper_id\":14005140},\"end\":113483,\"start\":113191},{\"attributes\":{\"id\":\"b40\",\"matched_paper_id\":13023258},\"end\":113684,\"start\":113485},{\"attributes\":{\"id\":\"b41\",\"matched_paper_id\":35737830},\"end\":113873,\"start\":113686},{\"attributes\":{\"id\":\"b42\",\"matched_paper_id\":2826729},\"end\":114074,\"start\":113875},{\"attributes\":{\"id\":\"b43\"},\"end\":114238,\"start\":114076},{\"attributes\":{\"id\":\"b44\",\"matched_paper_id\":9451231},\"end\":114673,\"start\":114240},{\"attributes\":{\"id\":\"b45\",\"matched_paper_id\":2049483},\"end\":115139,\"start\":114675},{\"attributes\":{\"id\":\"b46\"},\"end\":115369,\"start\":115141},{\"attributes\":{\"id\":\"b47\",\"matched_paper_id\":63430641},\"end\":115776,\"start\":115371},{\"attributes\":{\"id\":\"b48\"},\"end\":116008,\"start\":115778},{\"attributes\":{\"id\":\"b49\",\"matched_paper_id\":259852},\"end\":116248,\"start\":116010},{\"attributes\":{\"id\":\"b50\"},\"end\":116397,\"start\":116250},{\"attributes\":{\"id\":\"b51\",\"matched_paper_id\":1490383},\"end\":116774,\"start\":116399},{\"attributes\":{\"id\":\"b52\",\"matched_paper_id\":10812422},\"end\":117023,\"start\":116776},{\"attributes\":{\"id\":\"b53\",\"matched_paper_id\":7451449},\"end\":117305,\"start\":117025},{\"attributes\":{\"id\":\"b54\",\"matched_paper_id\":5075466},\"end\":117682,\"start\":117307},{\"attributes\":{\"id\":\"b55\",\"matched_paper_id\":146570079},\"end\":117980,\"start\":117684},{\"attributes\":{\"id\":\"b56\"},\"end\":118440,\"start\":117982},{\"attributes\":{\"id\":\"b57\",\"matched_paper_id\":7747452},\"end\":118794,\"start\":118442},{\"attributes\":{\"id\":\"b58\",\"matched_paper_id\":16134574},\"end\":119111,\"start\":118796},{\"attributes\":{\"id\":\"b59\"},\"end\":119400,\"start\":119113},{\"attributes\":{\"id\":\"b60\",\"matched_paper_id\":42941830},\"end\":119892,\"start\":119402},{\"attributes\":{\"id\":\"b61\",\"matched_paper_id\":15337817},\"end\":120216,\"start\":119894},{\"attributes\":{\"id\":\"b62\",\"matched_paper_id\":16369563},\"end\":120600,\"start\":120218},{\"attributes\":{\"id\":\"b63\",\"matched_paper_id\":9116234},\"end\":120761,\"start\":120602},{\"attributes\":{\"id\":\"b64\",\"matched_paper_id\":5786053},\"end\":121174,\"start\":120763},{\"attributes\":{\"id\":\"b65\",\"matched_paper_id\":6603673},\"end\":121451,\"start\":121176},{\"attributes\":{\"id\":\"b66\",\"matched_paper_id\":3200452},\"end\":121670,\"start\":121453},{\"attributes\":{\"id\":\"b67\",\"matched_paper_id\":61303765},\"end\":122016,\"start\":121672},{\"attributes\":{\"id\":\"b68\",\"matched_paper_id\":56578},\"end\":122538,\"start\":122018},{\"attributes\":{\"id\":\"b69\",\"matched_paper_id\":23227971},\"end\":122866,\"start\":122540},{\"attributes\":{\"id\":\"b70\",\"matched_paper_id\":7987431},\"end\":123193,\"start\":122868},{\"attributes\":{\"id\":\"b71\",\"matched_paper_id\":3379760},\"end\":123572,\"start\":123195},{\"attributes\":{\"id\":\"b72\",\"matched_paper_id\":143866158},\"end\":123945,\"start\":123574},{\"attributes\":{\"id\":\"b73\",\"matched_paper_id\":11161047},\"end\":124180,\"start\":123947},{\"attributes\":{\"id\":\"b74\",\"matched_paper_id\":12023493},\"end\":124597,\"start\":124182},{\"attributes\":{\"id\":\"b75\",\"matched_paper_id\":6755196},\"end\":124887,\"start\":124599},{\"attributes\":{\"id\":\"b76\",\"matched_paper_id\":16902277},\"end\":125173,\"start\":124889},{\"attributes\":{\"id\":\"b77\",\"matched_paper_id\":46938097},\"end\":125512,\"start\":125175},{\"attributes\":{\"id\":\"b78\",\"matched_paper_id\":46927710},\"end\":125981,\"start\":125514},{\"attributes\":{\"id\":\"b79\",\"matched_paper_id\":52942190},\"end\":126404,\"start\":125983},{\"attributes\":{\"id\":\"b80\",\"matched_paper_id\":18201927},\"end\":126673,\"start\":126406},{\"attributes\":{\"id\":\"b81\",\"matched_paper_id\":27073205},\"end\":127013,\"start\":126675},{\"attributes\":{\"id\":\"b82\",\"matched_paper_id\":20968574},\"end\":127319,\"start\":127015},{\"attributes\":{\"id\":\"b83\",\"matched_paper_id\":3011523},\"end\":127590,\"start\":127321},{\"attributes\":{\"id\":\"b84\",\"matched_paper_id\":13498984},\"end\":127823,\"start\":127592},{\"attributes\":{\"id\":\"b85\",\"matched_paper_id\":14983903},\"end\":128077,\"start\":127825},{\"attributes\":{\"id\":\"b86\",\"matched_paper_id\":13904695},\"end\":128420,\"start\":128079},{\"attributes\":{\"id\":\"b87\",\"matched_paper_id\":18042363},\"end\":128906,\"start\":128422},{\"attributes\":{\"id\":\"b88\",\"matched_paper_id\":2916525},\"end\":129220,\"start\":128908},{\"attributes\":{\"id\":\"b89\",\"matched_paper_id\":15497198},\"end\":129524,\"start\":129222},{\"attributes\":{\"id\":\"b90\",\"matched_paper_id\":15905142},\"end\":129854,\"start\":129526},{\"attributes\":{\"id\":\"b91\",\"matched_paper_id\":17591936},\"end\":130180,\"start\":129856},{\"attributes\":{\"id\":\"b92\",\"matched_paper_id\":14292785},\"end\":130592,\"start\":130182},{\"attributes\":{\"id\":\"b93\",\"matched_paper_id\":12139099},\"end\":130903,\"start\":130594},{\"attributes\":{\"id\":\"b94\"},\"end\":131066,\"start\":130905},{\"attributes\":{\"id\":\"b95\",\"matched_paper_id\":2326336},\"end\":131501,\"start\":131068},{\"attributes\":{\"id\":\"b96\",\"matched_paper_id\":216098950},\"end\":131740,\"start\":131503},{\"attributes\":{\"id\":\"b97\",\"matched_paper_id\":16828379},\"end\":132065,\"start\":131742},{\"attributes\":{\"id\":\"b98\",\"matched_paper_id\":34296305},\"end\":132252,\"start\":132067},{\"attributes\":{\"id\":\"b99\",\"matched_paper_id\":13337653},\"end\":132772,\"start\":132254},{\"attributes\":{\"id\":\"b100\",\"matched_paper_id\":2407216},\"end\":133230,\"start\":132774},{\"attributes\":{\"id\":\"b101\",\"matched_paper_id\":27932463},\"end\":133711,\"start\":133232},{\"attributes\":{\"id\":\"b102\",\"matched_paper_id\":27498346},\"end\":134017,\"start\":133713},{\"attributes\":{\"id\":\"b103\",\"matched_paper_id\":14890844},\"end\":134473,\"start\":134019},{\"attributes\":{\"id\":\"b104\",\"matched_paper_id\":24954722},\"end\":134729,\"start\":134475},{\"attributes\":{\"id\":\"b105\",\"matched_paper_id\":15730996},\"end\":135036,\"start\":134731},{\"attributes\":{\"id\":\"b106\"},\"end\":135246,\"start\":135038},{\"attributes\":{\"id\":\"b107\",\"matched_paper_id\":10719074},\"end\":135592,\"start\":135248},{\"attributes\":{\"id\":\"b108\",\"matched_paper_id\":48362565},\"end\":136050,\"start\":135594},{\"attributes\":{\"id\":\"b109\",\"matched_paper_id\":6315090},\"end\":136434,\"start\":136052},{\"attributes\":{\"id\":\"b110\",\"matched_paper_id\":25367365},\"end\":136939,\"start\":136436},{\"attributes\":{\"id\":\"b111\"},\"end\":137087,\"start\":136941},{\"attributes\":{\"id\":\"b112\",\"matched_paper_id\":1693513},\"end\":137217,\"start\":137089},{\"attributes\":{\"id\":\"b113\",\"matched_paper_id\":57413152},\"end\":137362,\"start\":137219}]", "bib_title": "[{\"end\":100421,\"start\":100383},{\"end\":100693,\"start\":100591},{\"end\":101126,\"start\":101020},{\"end\":101505,\"start\":101442},{\"end\":101750,\"start\":101722},{\"end\":102143,\"start\":102052},{\"end\":102502,\"start\":102440},{\"end\":102838,\"start\":102773},{\"end\":103193,\"start\":103089},{\"end\":103569,\"start\":103466},{\"end\":103981,\"start\":103873},{\"end\":104455,\"start\":104381},{\"end\":104730,\"start\":104661},{\"end\":105028,\"start\":104940},{\"end\":105431,\"start\":105352},{\"end\":105824,\"start\":105764},{\"end\":106037,\"start\":105982},{\"end\":106352,\"start\":106249},{\"end\":106733,\"start\":106637},{\"end\":107065,\"start\":106987},{\"end\":107266,\"start\":107228},{\"end\":107589,\"start\":107520},{\"end\":107910,\"start\":107860},{\"end\":108372,\"start\":108206},{\"end\":108846,\"start\":108762},{\"end\":109226,\"start\":109167},{\"end\":109506,\"start\":109474},{\"end\":109914,\"start\":109801},{\"end\":110345,\"start\":110253},{\"end\":110803,\"start\":110746},{\"end\":111217,\"start\":111144},{\"end\":111571,\"start\":111479},{\"end\":111914,\"start\":111860},{\"end\":112162,\"start\":112085},{\"end\":112441,\"start\":112356},{\"end\":113251,\"start\":113191},{\"end\":113514,\"start\":113485},{\"end\":113738,\"start\":113686},{\"end\":113920,\"start\":113875},{\"end\":114345,\"start\":114240},{\"end\":114747,\"start\":114675},{\"end\":115404,\"start\":115371},{\"end\":116075,\"start\":116010},{\"end\":116512,\"start\":116399},{\"end\":116813,\"start\":116776},{\"end\":117067,\"start\":117025},{\"end\":117334,\"start\":117307},{\"end\":117732,\"start\":117684},{\"end\":118505,\"start\":118442},{\"end\":118839,\"start\":118796},{\"end\":119503,\"start\":119402},{\"end\":119984,\"start\":119894},{\"end\":120294,\"start\":120218},{\"end\":120622,\"start\":120602},{\"end\":120862,\"start\":120763},{\"end\":121232,\"start\":121176},{\"end\":121499,\"start\":121453},{\"end\":121733,\"start\":121672},{\"end\":122153,\"start\":122018},{\"end\":122592,\"start\":122540},{\"end\":122964,\"start\":122868},{\"end\":123286,\"start\":123195},{\"end\":123637,\"start\":123574},{\"end\":124013,\"start\":123947},{\"end\":124265,\"start\":124182},{\"end\":124663,\"start\":124599},{\"end\":124938,\"start\":124889},{\"end\":125212,\"start\":125175},{\"end\":125615,\"start\":125514},{\"end\":126073,\"start\":125983},{\"end\":126426,\"start\":126406},{\"end\":126765,\"start\":126675},{\"end\":127088,\"start\":127015},{\"end\":127367,\"start\":127321},{\"end\":127651,\"start\":127592},{\"end\":127887,\"start\":127825},{\"end\":128121,\"start\":128079},{\"end\":128559,\"start\":128422},{\"end\":129021,\"start\":128908},{\"end\":129254,\"start\":129222},{\"end\":129611,\"start\":129526},{\"end\":129910,\"start\":129856},{\"end\":130281,\"start\":130182},{\"end\":130679,\"start\":130594},{\"end\":131131,\"start\":131068},{\"end\":131566,\"start\":131503},{\"end\":131830,\"start\":131742},{\"end\":132103,\"start\":132067},{\"end\":132335,\"start\":132254},{\"end\":132856,\"start\":132774},{\"end\":133284,\"start\":133232},{\"end\":133761,\"start\":133713},{\"end\":134103,\"start\":134019},{\"end\":134531,\"start\":134475},{\"end\":134831,\"start\":134731},{\"end\":135313,\"start\":135248},{\"end\":135677,\"start\":135594},{\"end\":136172,\"start\":136052},{\"end\":136536,\"start\":136436},{\"end\":137111,\"start\":137089},{\"end\":137235,\"start\":137219}]", "bib_author": "[{\"end\":100434,\"start\":100423},{\"end\":100446,\"start\":100434},{\"end\":100707,\"start\":100695},{\"end\":100716,\"start\":100707},{\"end\":100726,\"start\":100716},{\"end\":100737,\"start\":100726},{\"end\":101135,\"start\":101128},{\"end\":101146,\"start\":101135},{\"end\":101155,\"start\":101146},{\"end\":101169,\"start\":101155},{\"end\":101179,\"start\":101169},{\"end\":101187,\"start\":101179},{\"end\":101519,\"start\":101507},{\"end\":101531,\"start\":101519},{\"end\":101545,\"start\":101531},{\"end\":101765,\"start\":101752},{\"end\":101778,\"start\":101765},{\"end\":102158,\"start\":102145},{\"end\":102170,\"start\":102158},{\"end\":102516,\"start\":102504},{\"end\":102530,\"start\":102516},{\"end\":102536,\"start\":102530},{\"end\":102546,\"start\":102536},{\"end\":102557,\"start\":102546},{\"end\":102568,\"start\":102557},{\"end\":102849,\"start\":102840},{\"end\":102861,\"start\":102849},{\"end\":103205,\"start\":103195},{\"end\":103214,\"start\":103205},{\"end\":103224,\"start\":103214},{\"end\":103234,\"start\":103224},{\"end\":103582,\"start\":103571},{\"end\":103593,\"start\":103582},{\"end\":103605,\"start\":103593},{\"end\":103616,\"start\":103605},{\"end\":103990,\"start\":103983},{\"end\":103998,\"start\":103990},{\"end\":104263,\"start\":104251},{\"end\":104467,\"start\":104457},{\"end\":104742,\"start\":104732},{\"end\":104752,\"start\":104742},{\"end\":105044,\"start\":105030},{\"end\":105056,\"start\":105044},{\"end\":105068,\"start\":105056},{\"end\":105078,\"start\":105068},{\"end\":105089,\"start\":105078},{\"end\":105107,\"start\":105089},{\"end\":105443,\"start\":105433},{\"end\":105453,\"start\":105443},{\"end\":105461,\"start\":105453},{\"end\":105470,\"start\":105461},{\"end\":105480,\"start\":105470},{\"end\":105838,\"start\":105826},{\"end\":106049,\"start\":106039},{\"end\":106057,\"start\":106049},{\"end\":106067,\"start\":106057},{\"end\":106363,\"start\":106354},{\"end\":106369,\"start\":106363},{\"end\":106748,\"start\":106735},{\"end\":106760,\"start\":106748},{\"end\":107075,\"start\":107067},{\"end\":107280,\"start\":107268},{\"end\":107603,\"start\":107591},{\"end\":107614,\"start\":107603},{\"end\":107627,\"start\":107614},{\"end\":107633,\"start\":107627},{\"end\":107644,\"start\":107633},{\"end\":107652,\"start\":107644},{\"end\":107922,\"start\":107912},{\"end\":107933,\"start\":107922},{\"end\":107947,\"start\":107933},{\"end\":107957,\"start\":107947},{\"end\":107969,\"start\":107957},{\"end\":108383,\"start\":108374},{\"end\":108391,\"start\":108383},{\"end\":108403,\"start\":108391},{\"end\":108860,\"start\":108848},{\"end\":108866,\"start\":108860},{\"end\":108880,\"start\":108866},{\"end\":108891,\"start\":108880},{\"end\":109242,\"start\":109228},{\"end\":109250,\"start\":109242},{\"end\":109260,\"start\":109250},{\"end\":109264,\"start\":109260},{\"end\":109522,\"start\":109508},{\"end\":109532,\"start\":109522},{\"end\":109542,\"start\":109532},{\"end\":109550,\"start\":109542},{\"end\":109563,\"start\":109550},{\"end\":109927,\"start\":109916},{\"end\":109942,\"start\":109927},{\"end\":109953,\"start\":109942},{\"end\":109967,\"start\":109953},{\"end\":109981,\"start\":109967},{\"end\":110361,\"start\":110347},{\"end\":110379,\"start\":110361},{\"end\":110389,\"start\":110379},{\"end\":110403,\"start\":110389},{\"end\":110414,\"start\":110403},{\"end\":110427,\"start\":110414},{\"end\":110815,\"start\":110805},{\"end\":110828,\"start\":110815},{\"end\":110836,\"start\":110828},{\"end\":110851,\"start\":110836},{\"end\":110860,\"start\":110851},{\"end\":110867,\"start\":110860},{\"end\":110879,\"start\":110867},{\"end\":110889,\"start\":110879},{\"end\":110899,\"start\":110889},{\"end\":111229,\"start\":111219},{\"end\":111236,\"start\":111229},{\"end\":111244,\"start\":111236},{\"end\":111582,\"start\":111573},{\"end\":111595,\"start\":111582},{\"end\":111605,\"start\":111595},{\"end\":111930,\"start\":111916},{\"end\":112178,\"start\":112164},{\"end\":112186,\"start\":112178},{\"end\":112452,\"start\":112443},{\"end\":112461,\"start\":112452},{\"end\":112475,\"start\":112461},{\"end\":112492,\"start\":112475},{\"end\":112500,\"start\":112492},{\"end\":112817,\"start\":112802},{\"end\":112827,\"start\":112817},{\"end\":112839,\"start\":112827},{\"end\":113044,\"start\":113031},{\"end\":113265,\"start\":113253},{\"end\":113273,\"start\":113265},{\"end\":113281,\"start\":113273},{\"end\":113530,\"start\":113516},{\"end\":113539,\"start\":113530},{\"end\":113744,\"start\":113740},{\"end\":113933,\"start\":113922},{\"end\":114090,\"start\":114078},{\"end\":114360,\"start\":114347},{\"end\":114377,\"start\":114360},{\"end\":114396,\"start\":114377},{\"end\":114759,\"start\":114749},{\"end\":114772,\"start\":114759},{\"end\":114785,\"start\":114772},{\"end\":115211,\"start\":115190},{\"end\":115414,\"start\":115406},{\"end\":115435,\"start\":115414},{\"end\":115447,\"start\":115435},{\"end\":115456,\"start\":115447},{\"end\":115828,\"start\":115817},{\"end\":115836,\"start\":115828},{\"end\":115848,\"start\":115836},{\"end\":116088,\"start\":116077},{\"end\":116097,\"start\":116088},{\"end\":116258,\"start\":116252},{\"end\":116265,\"start\":116258},{\"end\":116270,\"start\":116265},{\"end\":116518,\"start\":116514},{\"end\":116526,\"start\":116518},{\"end\":116536,\"start\":116526},{\"end\":116819,\"start\":116815},{\"end\":116827,\"start\":116819},{\"end\":116840,\"start\":116827},{\"end\":117080,\"start\":117069},{\"end\":117090,\"start\":117080},{\"end\":117348,\"start\":117336},{\"end\":117359,\"start\":117348},{\"end\":117372,\"start\":117359},{\"end\":117381,\"start\":117372},{\"end\":117390,\"start\":117381},{\"end\":117406,\"start\":117390},{\"end\":117415,\"start\":117406},{\"end\":117747,\"start\":117734},{\"end\":117760,\"start\":117747},{\"end\":117774,\"start\":117760},{\"end\":118126,\"start\":118116},{\"end\":118517,\"start\":118507},{\"end\":118529,\"start\":118517},{\"end\":118538,\"start\":118529},{\"end\":118546,\"start\":118538},{\"end\":118557,\"start\":118546},{\"end\":118561,\"start\":118557},{\"end\":118579,\"start\":118561},{\"end\":118856,\"start\":118841},{\"end\":118867,\"start\":118856},{\"end\":119195,\"start\":119188},{\"end\":119207,\"start\":119195},{\"end\":119213,\"start\":119207},{\"end\":119220,\"start\":119213},{\"end\":119227,\"start\":119220},{\"end\":119512,\"start\":119505},{\"end\":119524,\"start\":119512},{\"end\":119536,\"start\":119524},{\"end\":119543,\"start\":119536},{\"end\":119551,\"start\":119543},{\"end\":119558,\"start\":119551},{\"end\":119565,\"start\":119558},{\"end\":119999,\"start\":119986},{\"end\":120010,\"start\":119999},{\"end\":120020,\"start\":120010},{\"end\":120306,\"start\":120296},{\"end\":120320,\"start\":120306},{\"end\":120333,\"start\":120320},{\"end\":120345,\"start\":120333},{\"end\":120358,\"start\":120345},{\"end\":120634,\"start\":120624},{\"end\":120877,\"start\":120864},{\"end\":120888,\"start\":120877},{\"end\":120907,\"start\":120888},{\"end\":120917,\"start\":120907},{\"end\":121244,\"start\":121234},{\"end\":121256,\"start\":121244},{\"end\":121269,\"start\":121256},{\"end\":121278,\"start\":121269},{\"end\":121510,\"start\":121501},{\"end\":121518,\"start\":121510},{\"end\":121524,\"start\":121518},{\"end\":121747,\"start\":121735},{\"end\":121759,\"start\":121747},{\"end\":121771,\"start\":121759},{\"end\":121784,\"start\":121771},{\"end\":121794,\"start\":121784},{\"end\":121808,\"start\":121794},{\"end\":122167,\"start\":122155},{\"end\":122176,\"start\":122167},{\"end\":122185,\"start\":122176},{\"end\":122195,\"start\":122185},{\"end\":122208,\"start\":122195},{\"end\":122220,\"start\":122208},{\"end\":122603,\"start\":122594},{\"end\":122612,\"start\":122603},{\"end\":122621,\"start\":122612},{\"end\":122634,\"start\":122621},{\"end\":122647,\"start\":122634},{\"end\":122657,\"start\":122647},{\"end\":122976,\"start\":122966},{\"end\":122990,\"start\":122976},{\"end\":122999,\"start\":122990},{\"end\":123305,\"start\":123288},{\"end\":123312,\"start\":123305},{\"end\":123320,\"start\":123312},{\"end\":123331,\"start\":123320},{\"end\":123339,\"start\":123331},{\"end\":123351,\"start\":123339},{\"end\":123651,\"start\":123639},{\"end\":123663,\"start\":123651},{\"end\":123674,\"start\":123663},{\"end\":123685,\"start\":123674},{\"end\":123697,\"start\":123685},{\"end\":124027,\"start\":124015},{\"end\":124280,\"start\":124267},{\"end\":124293,\"start\":124280},{\"end\":124297,\"start\":124293},{\"end\":124307,\"start\":124297},{\"end\":124675,\"start\":124665},{\"end\":124950,\"start\":124940},{\"end\":124961,\"start\":124950},{\"end\":125224,\"start\":125214},{\"end\":125236,\"start\":125224},{\"end\":125246,\"start\":125236},{\"end\":125627,\"start\":125617},{\"end\":125639,\"start\":125627},{\"end\":125649,\"start\":125639},{\"end\":125657,\"start\":125649},{\"end\":125670,\"start\":125657},{\"end\":126085,\"start\":126075},{\"end\":126097,\"start\":126085},{\"end\":126107,\"start\":126097},{\"end\":126115,\"start\":126107},{\"end\":126129,\"start\":126115},{\"end\":126142,\"start\":126129},{\"end\":126441,\"start\":126428},{\"end\":126452,\"start\":126441},{\"end\":126461,\"start\":126452},{\"end\":126779,\"start\":126767},{\"end\":126786,\"start\":126779},{\"end\":126796,\"start\":126786},{\"end\":126807,\"start\":126796},{\"end\":127103,\"start\":127090},{\"end\":127112,\"start\":127103},{\"end\":127123,\"start\":127112},{\"end\":127382,\"start\":127369},{\"end\":127393,\"start\":127382},{\"end\":127665,\"start\":127653},{\"end\":127901,\"start\":127889},{\"end\":128133,\"start\":128123},{\"end\":128142,\"start\":128133},{\"end\":128150,\"start\":128142},{\"end\":128160,\"start\":128150},{\"end\":128170,\"start\":128160},{\"end\":128576,\"start\":128561},{\"end\":128585,\"start\":128576},{\"end\":128596,\"start\":128585},{\"end\":128606,\"start\":128596},{\"end\":128618,\"start\":128606},{\"end\":129032,\"start\":129023},{\"end\":129267,\"start\":129256},{\"end\":129278,\"start\":129267},{\"end\":129288,\"start\":129278},{\"end\":129298,\"start\":129288},{\"end\":129309,\"start\":129298},{\"end\":129320,\"start\":129309},{\"end\":129626,\"start\":129613},{\"end\":129636,\"start\":129626},{\"end\":129929,\"start\":129912},{\"end\":129939,\"start\":129929},{\"end\":129951,\"start\":129939},{\"end\":130294,\"start\":130283},{\"end\":130302,\"start\":130294},{\"end\":130312,\"start\":130302},{\"end\":130323,\"start\":130312},{\"end\":130335,\"start\":130323},{\"end\":130692,\"start\":130681},{\"end\":130703,\"start\":130692},{\"end\":130712,\"start\":130703},{\"end\":130916,\"start\":130907},{\"end\":131147,\"start\":131133},{\"end\":131157,\"start\":131147},{\"end\":131168,\"start\":131157},{\"end\":131188,\"start\":131168},{\"end\":131202,\"start\":131188},{\"end\":131213,\"start\":131202},{\"end\":131581,\"start\":131568},{\"end\":131847,\"start\":131832},{\"end\":131856,\"start\":131847},{\"end\":132116,\"start\":132105},{\"end\":132349,\"start\":132337},{\"end\":132362,\"start\":132349},{\"end\":132370,\"start\":132362},{\"end\":132380,\"start\":132370},{\"end\":132390,\"start\":132380},{\"end\":132399,\"start\":132390},{\"end\":132408,\"start\":132399},{\"end\":132870,\"start\":132858},{\"end\":132880,\"start\":132870},{\"end\":132888,\"start\":132880},{\"end\":132898,\"start\":132888},{\"end\":132910,\"start\":132898},{\"end\":132919,\"start\":132910},{\"end\":132928,\"start\":132919},{\"end\":132941,\"start\":132928},{\"end\":133298,\"start\":133286},{\"end\":133308,\"start\":133298},{\"end\":133318,\"start\":133308},{\"end\":133326,\"start\":133318},{\"end\":133340,\"start\":133326},{\"end\":133350,\"start\":133340},{\"end\":133359,\"start\":133350},{\"end\":133371,\"start\":133359},{\"end\":133384,\"start\":133371},{\"end\":133774,\"start\":133763},{\"end\":133783,\"start\":133774},{\"end\":133795,\"start\":133783},{\"end\":133806,\"start\":133795},{\"end\":133817,\"start\":133806},{\"end\":133826,\"start\":133817},{\"end\":134116,\"start\":134105},{\"end\":134125,\"start\":134116},{\"end\":134132,\"start\":134125},{\"end\":134143,\"start\":134132},{\"end\":134154,\"start\":134143},{\"end\":134169,\"start\":134154},{\"end\":134181,\"start\":134169},{\"end\":134191,\"start\":134181},{\"end\":134542,\"start\":134533},{\"end\":134553,\"start\":134542},{\"end\":134563,\"start\":134553},{\"end\":134844,\"start\":134833},{\"end\":135051,\"start\":135038},{\"end\":135063,\"start\":135051},{\"end\":135323,\"start\":135315},{\"end\":135333,\"start\":135323},{\"end\":135345,\"start\":135333},{\"end\":135364,\"start\":135345},{\"end\":135691,\"start\":135679},{\"end\":135700,\"start\":135691},{\"end\":135710,\"start\":135700},{\"end\":135720,\"start\":135710},{\"end\":135724,\"start\":135720},{\"end\":135737,\"start\":135724},{\"end\":136184,\"start\":136174},{\"end\":136196,\"start\":136184},{\"end\":136554,\"start\":136538},{\"end\":136564,\"start\":136554},{\"end\":136574,\"start\":136564},{\"end\":136582,\"start\":136574},{\"end\":136595,\"start\":136582},{\"end\":136606,\"start\":136595},{\"end\":136618,\"start\":136606},{\"end\":136632,\"start\":136618},{\"end\":136641,\"start\":136632},{\"end\":136952,\"start\":136943},{\"end\":136962,\"start\":136952},{\"end\":136971,\"start\":136962},{\"end\":136980,\"start\":136971},{\"end\":136992,\"start\":136980},{\"end\":137121,\"start\":137113},{\"end\":137248,\"start\":137237},{\"end\":137257,\"start\":137248}]", "bib_venue": "[{\"end\":101900,\"start\":101843},{\"end\":102933,\"start\":102901},{\"end\":104517,\"start\":104496},{\"end\":106095,\"start\":106085},{\"end\":106443,\"start\":106410},{\"end\":107351,\"start\":107336},{\"end\":108029,\"start\":108003},{\"end\":108444,\"start\":108429},{\"end\":108963,\"start\":108931},{\"end\":109290,\"start\":109281},{\"end\":109635,\"start\":109603},{\"end\":110437,\"start\":110433},{\"end\":111310,\"start\":111281},{\"end\":111665,\"start\":111639},{\"end\":112550,\"start\":112529},{\"end\":113331,\"start\":113310},{\"end\":114923,\"start\":114858},{\"end\":115535,\"start\":115523},{\"end\":116131,\"start\":116118},{\"end\":116890,\"start\":116869},{\"end\":117162,\"start\":117130},{\"end\":117495,\"start\":117459},{\"end\":118935,\"start\":118905},{\"end\":119649,\"start\":119611},{\"end\":122270,\"start\":122249},{\"end\":124387,\"start\":124351},{\"end\":124747,\"start\":124715},{\"end\":125033,\"start\":125001},{\"end\":125352,\"start\":125303},{\"end\":125748,\"start\":125713},{\"end\":126168,\"start\":126159},{\"end\":126506,\"start\":126484},{\"end\":128238,\"start\":128208},{\"end\":129686,\"start\":129665},{\"end\":131283,\"start\":131252},{\"end\":132144,\"start\":132134},{\"end\":132516,\"start\":132466},{\"end\":132991,\"start\":132970},{\"end\":133470,\"start\":133431},{\"end\":135129,\"start\":135111},{\"end\":135414,\"start\":135393},{\"end\":135819,\"start\":135782},{\"end\":137284,\"start\":137273},{\"end\":100461,\"start\":100446},{\"end\":100778,\"start\":100737},{\"end\":101204,\"start\":101187},{\"end\":101555,\"start\":101545},{\"end\":101841,\"start\":101778},{\"end\":102221,\"start\":102170},{\"end\":102577,\"start\":102568},{\"end\":102899,\"start\":102861},{\"end\":103249,\"start\":103234},{\"end\":103641,\"start\":103616},{\"end\":104013,\"start\":103998},{\"end\":104249,\"start\":104203},{\"end\":104494,\"start\":104467},{\"end\":104777,\"start\":104752},{\"end\":105127,\"start\":105107},{\"end\":105529,\"start\":105480},{\"end\":105849,\"start\":105838},{\"end\":106083,\"start\":106067},{\"end\":106408,\"start\":106369},{\"end\":106783,\"start\":106760},{\"end\":107088,\"start\":107075},{\"end\":107334,\"start\":107280},{\"end\":107661,\"start\":107652},{\"end\":108001,\"start\":107969},{\"end\":108427,\"start\":108403},{\"end\":108929,\"start\":108891},{\"end\":109279,\"start\":109264},{\"end\":109601,\"start\":109563},{\"end\":110000,\"start\":109981},{\"end\":110431,\"start\":110427},{\"end\":110677,\"start\":110632},{\"end\":110914,\"start\":110899},{\"end\":111279,\"start\":111244},{\"end\":111637,\"start\":111605},{\"end\":111950,\"start\":111930},{\"end\":112196,\"start\":112186},{\"end\":112527,\"start\":112500},{\"end\":112800,\"start\":112762},{\"end\":113029,\"start\":113005},{\"end\":113308,\"start\":113281},{\"end\":113559,\"start\":113539},{\"end\":113755,\"start\":113744},{\"end\":113953,\"start\":113933},{\"end\":114143,\"start\":114090},{\"end\":114439,\"start\":114396},{\"end\":114856,\"start\":114785},{\"end\":115188,\"start\":115141},{\"end\":115521,\"start\":115456},{\"end\":115815,\"start\":115778},{\"end\":116116,\"start\":116097},{\"end\":116315,\"start\":116270},{\"end\":116555,\"start\":116536},{\"end\":116867,\"start\":116840},{\"end\":117128,\"start\":117090},{\"end\":117457,\"start\":117415},{\"end\":117806,\"start\":117774},{\"end\":118114,\"start\":117982},{\"end\":118584,\"start\":118579},{\"end\":118903,\"start\":118867},{\"end\":119186,\"start\":119113},{\"end\":119609,\"start\":119565},{\"end\":120025,\"start\":120020},{\"end\":120386,\"start\":120358},{\"end\":120656,\"start\":120634},{\"end\":120942,\"start\":120917},{\"end\":121288,\"start\":121278},{\"end\":121535,\"start\":121524},{\"end\":121813,\"start\":121808},{\"end\":122247,\"start\":122220},{\"end\":122676,\"start\":122657},{\"end\":123008,\"start\":122999},{\"end\":123361,\"start\":123351},{\"end\":123731,\"start\":123697},{\"end\":124043,\"start\":124027},{\"end\":124349,\"start\":124307},{\"end\":124713,\"start\":124675},{\"end\":124999,\"start\":124961},{\"end\":125301,\"start\":125246},{\"end\":125711,\"start\":125670},{\"end\":126157,\"start\":126142},{\"end\":126482,\"start\":126461},{\"end\":126810,\"start\":126807},{\"end\":127137,\"start\":127123},{\"end\":127433,\"start\":127393},{\"end\":127685,\"start\":127665},{\"end\":127929,\"start\":127901},{\"end\":128206,\"start\":128170},{\"end\":128638,\"start\":128618},{\"end\":129042,\"start\":129032},{\"end\":129346,\"start\":129320},{\"end\":129663,\"start\":129636},{\"end\":129992,\"start\":129951},{\"end\":130360,\"start\":130335},{\"end\":130723,\"start\":130712},{\"end\":130949,\"start\":130916},{\"end\":131250,\"start\":131213},{\"end\":131599,\"start\":131581},{\"end\":131880,\"start\":131856},{\"end\":132132,\"start\":132116},{\"end\":132464,\"start\":132408},{\"end\":132968,\"start\":132941},{\"end\":133429,\"start\":133384},{\"end\":133837,\"start\":133826},{\"end\":134216,\"start\":134191},{\"end\":134578,\"start\":134563},{\"end\":134861,\"start\":134844},{\"end\":135109,\"start\":135063},{\"end\":135391,\"start\":135364},{\"end\":135780,\"start\":135737},{\"end\":136224,\"start\":136196},{\"end\":136656,\"start\":136641},{\"end\":137132,\"start\":137121},{\"end\":137271,\"start\":137257}]"}}}, "year": 2023, "month": 12, "day": 17}