{"id": 51954070, "updated": "2022-03-01 17:03:42.016", "metadata": {"title": "Pixel efficiency analysis: A quantitative web analytics approach", "authors": "[{\"first\":\"Alex\",\"last\":\"Brown\",\"middle\":[]},{\"first\":\"Binky\",\"last\":\"Lush\",\"middle\":[]},{\"first\":\"Bernard J.\",\"last\":\"Jansen\",\"middle\":[]}]", "venue": null, "journal": "Proceedings of the Association for Information Science and Technology", "publication_date": {"year": 2016, "month": null, "day": null}, "abstract": "We present a quantitative web analytics approach tailored towards academic libraries. We introduce the construct of pixel efficiency analysis and the metrics of pixel efficiency value and conversion efficiency value for quantitatively evaluating website changes. Pixel efficiency analysis is the practice of relating screen real estate measured in pixels to the achievement of organizational goals and key performance indicators as indicated by quantifiable user behavioral interactions on a webpage. The concepts and measures are employed through a case study at a major academic library focusing on four major webpages. The first level of analysis incorporates pixel efficiency analysis within an overarching web analytics investigation to identify key areas of improvement on the selected pages. The second level of analysis improves the identified weaknesses through A/B testing and highlights the usefulness of pixel efficiency analysis. Lastly, the third level of analysis employs the usage of the pixel efficiency value to elicit the added worth that potential website changes possess.", "fields_of_study": "[\"Computer Science\"]", "external_ids": {"arxiv": null, "mag": "2566309780", "acl": null, "pubmed": null, "pubmedcentral": null, "dblp": "conf/asist/BrownLJ16", "doi": "10.1002/pra2.2016.14505301040"}}, "content": {"source": {"pdf_hash": "94f7b07c84b78aab93440b9c1938f886743a07a9", "pdf_src": "Wiley", "pdf_uri": null, "oa_url_match": false, "oa_info": {"license": null, "open_access_url": "https://onlinelibrary.wiley.com/doi/pdfdirect/10.1002/pra2.2016.14505301040", "status": "BRONZE"}}, "grobid": {"id": "01c025fa1e8bd7cc41b9092cec8b6e556954ca3d", "type": "plain-text", "url": "s3://ai2-s2-pdf-extraction-prod/parse-results/s2orc_worker/94f7b07c84b78aab93440b9c1938f886743a07a9.txt", "contents": "\nPixel Efficiency Analysis: A Quantitative Web Analytics Approach\n\n\nAlex Brown \nThe Pennsylvania State University\nThe Pennsylvania State University Qatar Computing Research Institute University Park\n16802, 16802University Park, DohaPA, PAQatar\n\nBinky Lush \nThe Pennsylvania State University\nThe Pennsylvania State University Qatar Computing Research Institute University Park\n16802, 16802University Park, DohaPA, PAQatar\n\nBernard J Jansen jjansen@acm.org \nThe Pennsylvania State University\nThe Pennsylvania State University Qatar Computing Research Institute University Park\n16802, 16802University Park, DohaPA, PAQatar\n\nPixel Efficiency Analysis: A Quantitative Web Analytics Approach\nWeb analyticswebsite designacademic libraries\nWe present a quantitative web analytics approach tailored towards academic libraries. We introduce the construct of pixel efficiency analysis and the metrics of pixel efficiency value and conversion efficiency value for quantitatively evaluating website changes. Pixel efficiency analysis is the practice of relating screen real estate measured in pixels to the achievement of organizational goals and key performance indicators as indicated by quantifiable user behavioral interactions on a webpage. The concepts and measures are employed through a case study at a major academic library focusing on four major webpages. The first level of analysis incorporates pixel efficiency analysis within an overarching web analytics investigation to identify key areas of improvement on the selected pages. The second level of analysis improves the identified weaknesses through A/B testing and highlights the usefulness of pixel efficiency analysis. Lastly, the third level of analysis employs the usage of the pixel efficiency value and conversion efficiency value to elicit the added worth that potential website changes possess.\n\nINTRODUCTION\n\nSimilarly to other organizations, online technology advances allow academic library websites to increase the availability of electronic resources such as e-journals, ebooks, enhanced search features, reference services, and an increasing usage of online graphics (Aharony, 2012). Increased emphasis on electronic services have pushed expenditures of academic libraries at a growth rate 12% above inflation. Yet, libraries must invest in these services in order to offer high quality services to their consumers.\n\nOne of the challenges for academic libraries is offering the level of service consumers have come to expect from commercial offerings, in particular services like Google Scholar (Kesselman & Watstein, 2005). Research shows that these concerns are not unwarranted, as Brophy and Bawden (2005) show that Google ranks superior in accessibility and coverage when conducting academicrelated queries relative to library services. The researchers (Brophy & Bawden, 2005) note that even though academic libraries rank superior in quality, next generation students are likely to prefer accessibility over quality. Additionally, it is known that users seeking information will engage in an internal cost/benefit analysis to maximize reward and minimize effort (Jansen & Rieh, 2010). Moreover, the principle of least effort holds a stronger association with bibliometrics and information retrieval-related activities, compared to other information seeking tasks (Chang, 2016). Watkinson et al. (2016) have investigated trust of library resources. As a result, academic libraries have utilized web analytics to improve their websites and have been somewhat successful at doing so (e.g., Betty, 2009); however, a gap remains between relating these changes to online content access and organizational goals.\n\nThe objective of this research is to introduce an approach for academic libraries to increase the effectiveness and efficiency of their online services and presence. Results from this research highlight the impact of leveraging our approach, referred to as pixel efficiency analysis. Pixel efficiency analysis (PEA) is the practice of relating screen real estate measured in pixels to the achievement of organizational goals and key performance indicators as indicated by quantifiable user behavioral interactions on a webpage. Specifically, this research emphasizes the ability of PEA to measure website changes against organizational goals and key performance indicators (KPIs), while also accounting for the ability to streamline website content, which is linked to enhanced user acceptance.\n\nvital measure for academic libraries given increasing expenditures on electronic.\n\nThough utilizing web analytics has potential benefits, it does not come without its limitations. For example, while web analytics may tell how a user is interacting with a website, it is difficult to tell why a user is engaging in a particular behavior. Web analytics also cannot identify underlying needs of users or user satisfaction throughout their webpage engagement (Conyers & Payne, 2011;Jansen, 2009). Furthermore, web analytics has inherent data accuracy issues, per data error margins (typically) within the 5-10% range (Ferrini & Mohr, 2009;Jansen, 2009).\n\nDespite caveats, academic libraries have utilized the benefits of web analytics to understand behavioral patterns related to online content, increase visitors, improve loyalty, enhance navigation, and advance marketing efforts (Betty, 2009). Leveraging best practices of web analytics (Digital Analytics Association, n.d.), Jansen (2009) presents a Web Analytics Process Guide. Fagan (2014) suggests academic libraries adopt the Web Analytics Process Guide, echoing the call for a more strategic approach to website redesign (Manuel, Dearnley, & Walton, 2010). Not adopting such an approach risks more findings similar to that of Paul and Erdelez (2013), who report that web analytics is underutilized by library management. By emphasizing the best practice of applying multiple technologies and methods (Digital Analytics Association, n.d.; Jansen, 2009), we explore the aspect of using pixels to replace monetary units of the ecommerce domain and provide quantitative metrics for libraries and other non-commercial organizations wishing to implement changes to their websites while evaluating the potential impact of these changes on KPIs, which can be defined as \"[a] measurable expression for the achievement of a desired level of results in an area relevant to the entity's activity\" (The KPI Institute, 2016).\n\nInterestingly, pixels have had limited use in past research examining webpages, and no use as a measure to evaluate KPIs. Nicholson et al. (2006) utilized a pixel approach to analyze the space used by search engine advertisements. Using pixels, they were able to quantify ad-based real estate within search results pages. Attempting to quantify user behavior, Buscher, Cutrell, and Morris (2009) utilized an eye-tracking approach to highlight page real estate issues.\n\n\nRESEARCH QUESTIONS\n\nPixel analysis being of value for academic libraries is founded on the assumption that every pixel serves a potential purpose. Purposes on a webpage can range from converting users (e.g. a click conversion) to serving an aesthetically pleasing presence that subconsciously impacts user acceptance. Effectively and efficiently doing so without causing confusion can be cumbersome.\n\nAn unofficial observation made during the time of this study, is that whenever library website stakeholders meet and discuss content management for a webpage, the session often revolves around the compilation of an exhaustive list of resources that should be made available on a page with no metrics to justify the inclusion or exclusion. This creates an overburden of information that comes at the cost of potential confusion to the user. If we assume that an overburden of information causes confusion to the user (McGillis & Toms, 2001), then the value of webpage real estate becomes of greater importance, since one needs to then ensure that the webpage does not become \"crowded\" and determine what components are most important. By using pixel analysis, we can determine what components should receive the most importance and how to optimize the size of individual components, which then correlates to greater optimization of the webpage and website.\n\nWe label the process of using pixels for webpage evaluation as pixel efficiency analysis. As a formal definition, pixel efficiency analysis (PEA) is the practice of relating screen real estate measured in pixels to the achievement of organizational goals and KPIs as indicated by quantifiable user behavioral interactions on a webpage. The following research questions seek to explore the novel approach of PEA for academic libraries.\n\n\nResearch Question 1 (RQ1): Does a web analytics investigation of a library's website support the utilization of PEA as a methodology to improve webpage design?\n\nWe begin with a comprehensive web analytics investigation because inherent within the best practices is to utilize multiple technologies and methods. This is because each technology and methodology used helps to tell a story with the data. Rather, if we solely rely upon one tool, such as Google Analytics (which several past academic library studies have done), we only get part of the story. Hence, within the examination of RQ1, we will employ Google Analytics, CrazyEgg (a heat mapping tool), and a user survey into order to thoroughly evaluate our use of PEA. Doing so will give us a high level depiction of the user experience that occurs within the library's website, while eliciting existent weaknesses. Will those weaknesses provide validation for the employment of PEA?\n\nResearch Question 2 (RQ2): What impact will the attempt to increase pixel efficiency have on user behavior?\n\nWhile RQ1 attempts to better understand the website through the insights of the user and identify weaknesses, with RQ2, we seek to correct those weaknesses. Understanding what is going on will not be enough to know for certain what changes should or need to be made. As detailed in Figure 1, an iterative approach is vital to the field of web analytics. We follow that approach here, while attempting to encourage the utilization of data-driven decision making within academic libraries. Specifically, the iterative approach that will be taken within this research will utilize A/B testing in attempt to enhance pixel inefficiencies elicited within RQ1. Though RQ1 may elicit weaknesses and areas for improvement, simply making changes \"assumed\" to be better is risky. A/B testing helps reduce risk and test changes, while, in conjunction with PEA, relating said changes back to KPIs.\n\n\nResearch Question 3 (RQ3): How can we report findings from PEA in a manner that enhances the decision making process in alignment with KPIs?\n\nLeading up to RQ3, we seek to depict an overarching image of the library user, while also testing potential website design changes that potentially make more efficient and effective usage of webpage real estate. While we will be taking various measures into account up to this point, no traditional or existing measure takes the value of webpage real estate into account. In turn, for RQ3, we will offer two different measures capable of showing more efficient usage of pixel efficiency. Particularly, we aim to provide measures that combine conversion/engagement levels with the amount of screen real estate being measured by PEA.\n\n\nMETHODOLOGY PEA Within the Framework of Web Analytics\n\nThis research takes a similar approach to that of Coughlin, Campbell, and Jansen (2013), who modify web analytic techniques to fit the needs of academic libraries for purchasing online content. We mold the Web Analytics Process Guide (Jansen, 2009) into a three phase strategic framework, as seen in Figure 1.\n\nThis case study focuses on the homepage, databases page, research guides page, and interlibrary loan (ILL) page of a major academic library. These four pages have significant monetary and content value to the libraries and are chosen for three reasons: (1) they are gateway pages that serve as entry points to other library resources, (2) the pages receive a lot of traffic relative to the other pages on the site, and (3) the pages collectively allow for the identification of organizational goals and KPIs (Phase 1 of the analytic model we are following) that are generalizable to nearly all academic libraries. Upon identification of key stakeholders as students, faculty, staff, and alumni and our subsequent selection of students as the most important site visitors for this research, we outline webpage goals, KPIs, and associated metrics, as shown in Table 1.\n\nAgain, we define pixel efficiency analysis as the practice of relating screen real estate measured in pixels to the achievement of organizational goals and KPIs as indicated by quantifiable user behavioral interactions on a webpage. Effectiveness is measured by achievement of library KPIs, where efficiency is based upon user behavioral patterns on the webpage. Efficiency is measured by usage of pixels. In this case study, user behavioral patterns are identified by a click analysis and heat map analysis, which we translate into pixel real estate.\n\nTo perform PEA, we employ a heat map on the pages previously identified as the focus of the case study. While various heat mapping tools are available, CrazyEgg is chosen for the study due to its wide set of features, ease of implementation, and relative low cost. Heat maps allow for quick qualitative analysis of user behavior and adds substance to the quantitative metrics. Brighter colors indicate heavier usage, whereas darker colors indicate lesser usage. Based upon the color distribution, we identify three levels of usage: heavy (red and brighter), moderate (green), and little (blue and darker). Gray represents no usage. Where conflicts exist (e.g. a link receives heavy usage in the center, but little to no usage on the edges), the highest level of usage is awarded.\n\nPixel quantification is achieved by using the Google Chrome extension Page Ruler, which allows for the measurement of the webpage, webpage components, and behavioral usage (based upon the identified levels) in terms of square pixels. It should be noted that all pixel measurements are taken on a 1366 x 768 screen resolution, as this is the most common screen resolution of users for the library site in question, based on analysis of log data.\n\nLeveraging PEA into a measurement, at this moment, is not meant to be one exact measurement. Refining a specific measurement to be built upon is the subject of future research. For our purposes, we introduce two measurements. Our intention, at this stage of the research, is to utilize these measurements to advance and spur research utilizing pixels as an analytic tool.\n\nThe first measurement we introduce is achieved by summing the areas of moderate and heavy usage, then dividing this by total real estate of the page. We refer to this measure as pixel efficiency value (PEV), capable of being employed at the page or component level (i.e., a subsection of a page, widget on a page), as shown in Table 2.\n\nTest Conversion Efficiency Value (CEV) is achieved by taking the number of conversions within the respective area of measurement and adding this to the difference between the test variation conversion rate with the baseline conversion rate, then multiplying by 100. The difference in conversions between the test and control is taken into account to create a reward if conversion rate increases or a penalty if the conversion rate decreases. This is then compared to the Control CEV.\n\nPEV is a measure of the efficiency of webpage design that seeks to maximize the proportion of moderate-heavy usage within a respective area. CEV is weighted in a manner that takes conversions within a given area of real estate, while limiting the amount of pixel space allocated to achieve that goal. Both measures are ultimately geared towards similar concepts, exhibiting that pixels can be leveraged in a variety of manners to elicit the added value to KPI measurement.\n\nThe utilization of pixels provides libraries a numeric value for statistical testing of webpage design, similar to what monetary value provides for ecommerce sites, and aligns website changes directly to achievement of KPIs. Explicitly, improving PEV and CEV equates to a higher density of valuable content, thereby aligning with the organizational objectives and KPIs to increase overall content value and streamline users to key tasks. Even though the highest possible PEV or CEV is the end goal, keep in mind that not every portion of a page or component is clickable, nor is every portion of a webpage equal value (i.e. eyes get drawn to certain areas). For example, the upper left corner of a webpage is typically considered the most valuable. With this taken into account, we seek to steer academic librarians towards limiting the amount of content offered on a given page so that consumers do not become overwhelmed and are provided with the brief quality results that today's information era has embedded within users.\n\n\nData Collection and Analysis\n\n\nAnalysis of the Academic Library Website User\n\nTo reiterate, our first analysis (RQ1) seeks to help us better understand the library website through the eyes of the user. Subsequently, we first collect measures of webpage goals and KPIs identified in Table 1. Measures are drawn from Google Analytics and are representative of academic year 2014/15 (AY 14/15). Next, heatmaps are employed through CrazyEgg and are set to collect data for 10,000 pageviews for the homepage and 5,000 pageviews for the remaining pages.\n\nOur first analysis ends by collectively analyzing the measures, heat maps, and survey responses to identify webpage ineffectiveness and inefficiencies, within the webpages identified for analysis. Our aim here is not necessarily precision, but rather to enable our ability to tell a story about the user experience of academic library users.\n\n\nTesting of Identified Inefficiencies\n\nTo conduct our second analysis (RQ2) we employ the Optimizely A/B testing platform. Optimizely provides the capability to make changes to a webpage and then test those changes real-time against the control page by disseminating half of the traffic to the control page and half of the traffic to the variation page. If improvement, based upon KPI achievement, is achieved with a more efficient usage of real estate, then we have clearly achieved a better variant. Even if KPI performance remains the same with more efficient usage of real estate, then we have still identified a better variant. Simply put, we suggest the main reason a more efficient usage of page real estate not be adopted is if KPI identified performance decreases. Following this model conceptually leads to utmost efficient balance that can be found between content and white space on a given page.\n\n\nMeasure Acronym Equation\n\nPixel Efficiency Value PEV\n\n\nControl Conversion Efficiency Value CCEV\n\nTest Conversion Efficiency Value TCEV Table 2. An overview of the tactical measures and equations to achieve those measures, used within this research.\n\n\nCreation of Pixel-based Values for Reporting\n\nWithin the field of web analytics, common reporting practices utilize metrics (e.g. pageviews, bounce rate, exit rate, returning visitor rate, etc.). While investigating RQ2, we note differences in screen real estate allocation in pixels; however, a change in pixel allocation alone is not enough to report a difference. Rather, what value (or lack thereof) results from the change in pixel allocation? The third analysis (RQ3) seeks to take the results from RQ2 and turn them into the tactical measures of PEV and CEV. Table 3 represents an overview of the identified measures associated with goals and KPIs, noted in Table 1 of the current library website. Generally, the measures indicate mixed performance of KPIs, which indicates room for improvement in terms of effectiveness of the webpages. In addition, if we consider the heatmaps (e.g. Figure 2), we can note large areas of real estate are unused. Based upon the metrics and heat maps, it appears the purpose of PEA, which is to increase effectiveness and efficiency of webpages with special emphasis on pixel sizing of components, is well suited for these pages. Further insight is achieved through a survey.\n\n\nRESULTS\n\n\nHigh Level User Experience Analysis\n\nSurvey results (Table 4) reflect the views of 100 respondents that answered Likert-scale questions regarding usability; several significant correlations exist. Notably, among the significant correlations, seven obtain r > .55 (i.e. seven correlations are moderate-high correlations). We highlight two correlations that are particularly important for the foundational assumptions of PEA. First, among our findings is the notion that believing the site is easy to use is significantly and positively correlated with believing that the organization of the site streamlines the information seeking process (r = .720, p < .01). Rather, if users believe the site is not organized in a manner that allows them to quickly find what they are looking for, then it is statistically probable that the users will also believe the site has low usability. Second, noteworthy of reiterating, is that believing much of the content on the website is distracting is significantly and positively correlated with believing that terminology on the homepage is confusing (r = .615, p < .01). Hence, if we assume that academic library website users are more likely to find homepage terminology confusing than on a traditional website (McGillis & Toms, 2001), then we can also determine that users will likely find much of the content on the website distracting. Confused   and distracted users are unlikely to believe they are engaging in a streamlined information seeking process, and subsequently, will likely believe low usability exists. If we rely upon PEA to help effectively and efficiently utilize page real estate, then we will lower the amount of distracting and confusing content, while also streamlining the information seeking process and increasing usability of the site. The utilization of existent web analytic methodologies to explore issues within the academic library website in question (RQ1) has allowed us to find ineffectiveness and inefficiencies.\n\n\nA/B Testing of Webpage Inefficiencies\n\nGiven the identified pixel inefficiencies from the high-level analysis, we move to RQ2 and seek to analyze what impact attempts to improve pixel inefficiencies have on user behavior. We identify one area or component of weakness for each selected page.\n\n For the homepage, we observe that the search box tends to be relatively large in comparison to the amount of real estate that obtains clicks.  On the databases page, the navigational area appears to have a low density of clicks that are widely dispersed.  The research guides page contains a large amount of white space and offers no promotion of content other than a link list.  The ILL page seems to detract users from its main goal, which is to get users to login to their ILL account.\n\nEach of the four mentioned issues can condense information and utilize less page real estate, while also maintaining or increasing KPI effectiveness. Based upon these identified weaknesses, Table 5 presents the A/B testing results on the components of interest. Notably, in 9 out of 10 analyses, we are able to increase the efficiency at which pixel space is utilized and also increase engagement within the targeted componential area.\n\n\nHomepage Analysis\n\nAn examination of current library homepages exhibits a tendency for focused emphasis on the search box that permits access to the libraries extensive collection of electronic services. This trend is intuitive, seeing as it is often times the quickest and easiest way to access an electronic resource. However, increased importance does not necessarily mean that more page real estate should be allocated to a respective component, particularly in the case of a search box. Market trends of major websites (e.g. Google, Amazon, etc.) dictate streamlined search areas that, in comparison, do not take up much page real estate. Hence, we explore what impact streamlining a library search box has on user behavior.\n\nThe A/B test we employ on the search area ( Figure 3) removes the black border that exists around the current search area (Figure 4). This decreases the size of the search area from 123,200 square pixels to 106,232 square pixels. Doing so results in an engagement level of 108.48% for the control and a variation level engagement of 111.63%, where engagement is defined as a click within the identified componential area divided by the number of visitors. Given the significant importance of the search area to the actual    user base, we were limited in how much live testing we could do and how radically we could change the search box. Nonetheless, we are able to decrease the amount of real estate taken up by the search area, while even slightly increasing engagement levels. We still believe that an even smaller search area would perform better. To pursue this notion, we offer two search areas, Figures 4 and 5, in the survey and ask users to indicate their preference. Of the responses, two-thirds of respondents prefer Figure 5, which is 49,006 square pixels in size. That difference in size represents a 60.22% decrease in page real estate.\n\n\nDatabase Page Analysis\n\nLike the homepage, the databases page is a \"gateway\" page, in that it serves as a portal to browse various other resources. Specifically, databases within the academic library world refer to bundles of electronic resources.\n\nThe library in question spends millions of dollars per year on these databases (Coughlin & Jansen, 2015), so conversions (i.e. clicking on a database) and having visitors return are KPIs for the page. The databases page consists of a navigational area, then a long link list. Figure 6 depicts the navigational area. We focus on the navigational area because, as noted earlier, it is an area of weakness upon analysis of the heat map from our data collection analysis.\n\nIn particular, we notice that the clicks within the navigational area tend to have relatively low density and are widely dispersed, which is not what we would expect from an efficient and effective navigational area.\n\nWithin A/B tests 2 and 3 (e.g. Figure 7) we aim for better utilization of the pixel space within the navigational area. In particular, we take the \"Try These First\" link and offer links under it within previously unused space, while also rearranging some elements in order to condense and simplify the information offered within the navigational area. The result is a 25.84% reduction in pixel space. We also note slight increases in engagement levels, with test 2 engagement increases from 29.59% to 31.78% and for test 3 the engagement levels increase from 31.61% to 32.04%.\n\n\nResearch Guide Page Analysis\n\nThe research guides page (Figure 8) is also a gateway page. The content produced within the research guides is intended to help the users of the website conduct research and is maintained by staff members of the library. While the databases page contains some sort of navigational area to help assist users in locating the appropriate database, this is not the case with the research guides page; outside of a search box, the research guides page offers no navigational area. In taking an empathetic stance with the users, if you are seeking a guide for help to do research, coming to a page full of links is likely not preferable as an overabundance of information can be overwhelming to begin with, let alone when one is confused and looking for help. We subsequently seek to experiment with the idea of \"featured guides.\" The featured guides are displayed above the fold in what was previously white space. Three different iterations of five featured guides are tested. Each test increases the collective engagement levels of the featured guides. The approach to improving pixel efficiency for the research guides page is different than the approach taken for the homepage and databases page. Rather, instead of condensing componential areas, white space is utilized to feature content in attempt to enhance the ability of users to quickly navigate to the appropriate resource, a KPI of the research guides page. Again, collective engagement levels of the featured guides increase in all three A/B tests (see Table 5).\n\nLike the search area, we offer a more drastic variation (Figure 9) within the survey. Within this variation, all area \"above the fold\" is dedicated to assisting users in finding a   research guide. Notably 86 of 93 (92%) respondents prefer the variation over the control. Hence, a trend seems to be occurring that within this academic library website, users tend to prefer tools that help find resources quickly rather than offering the resources outright. A possible explanation for this observation is that libraries use terminology that may often seem confusing to users, although this needs research to confirm.\n\n\nILL Page Analysis\n\nThe ILL page (Figure 10) serves as a way for users to request books, articles, and other materials that the library in question may not have access to, but that another library does. This results in users saving money on subscriptions and is arguably an underutilized resource within the libraries. Yet as noted earlier, we have concern that the existing page is not getting users to login to their ILL accounts in an efficient and effective manner. Namely, this is because users are utilizing a small login link just as frequently as the central login feature. While this may not be a major problem, we still find it surprising that users are drawn to a small login link over instead of the login logo that is the central focus of the page. We therefore make two iterations of the central login feature to see if we can increase the number of logins (i.e. effectiveness), while also increasing pixel efficiency. In both tests, we are able to increase effectiveness by getting more users to login to their ILL accounts, while also making more efficient usage of webpage real estate by using less webpage real estate with the central login feature. Specifically, ILL test 1 (Figure 11) achieves an increase in logins of 54.78% to 65.44%, while also seeing a 13.19% reduction in pixel space allocation from 32,040 square pixels to 27,813 square pixels. In ILL test 2 we note logins increase from 65.19% to 75.52% with pixel space allocation decreasing 23.67% from 32,040 square pixels to 24,455 square pixels.\n\n\nPixel Efficiency Measurements\n\nThrough PEA, we find that the library homepage contains 1,245,127 square pixels (1,349 x 923). Of the roughly 1.25 million square pixels, 10,876 square pixels obtain moderate usage and 32,788 square pixels obtain heavy usage based on the measurements taken, where green usage is moderate and red and brighter is heavy usage.\n\nWe cannot for certain say where a PEV of 3.51% (Table 6) lies on the efficiency spectrum of academic library homepages, given the lack of comparative data among research libraries. While we do not suggest that every square pixel of a webpage should be clickable, believe if 96.5% of an academic library homepage is achieving little to no usage, even when there are clickable elements, then the real estate can be better utilized given that users here seemingly prefer a streamlined approach.  For the purposes of converting our other results into measures, we utilize CEV as the other pages we are primarily concerned with increasing conversions to the resources on the page rather than increasing the pixel efficiency of the page as a whole. Rather, with these pages we are more concerned with page real estate \"above the fold.\" As the nature of these pages requisites that many resources be offered. If streamlining users to resources is a KPI, then effectively and efficiently getting users to engage in a conversion above the fold is important. One database test and one ILL test will be selected for the purposes of prototyping. We elect not to provide a quantitative measure for the research guides testing, seeing as we only utilized previously unused white space.\n\nWhat is particularly noteworthy about these results, as seen in Table 7, is that comparatively these values are able to elicit the value of the more efficient usage of webpage real estate while achieving better metrics in support of KPIs. Without CEV, the databases A/B test would be presented as: a reduction of 96,645 square pixels and an increase in engagement levels from 31.61% to 32.04%. With CEV, we can say that we relatively high increase in performance from 35.02% to 56.43%, which represents an increase in efficiency and effectiveness. The value in essence rewards more efficient usage of pixel space, if engagement levels are also increased. In contrast, if engagement levels decrease with decreased pixel allocation, then a penalty is given to the value indicating that more pixel space should be allocated to the component.\n\nWe have established PEV and CEV as additional measures that can be used to work towards optimizing the goals of providing high value content and streamlining user behaviors. In fact, PEV and CEV provide quantitative measures no other current measure is capable of producing. Namely, a measure that links the aesthetic and organizational presence of a webpage to measurable outcomes of user behavior.\n\n\nDISCUSSION AND CONCLUSION\n\nA high-level analysis of the academic library user reveals justification for the utilization of PEA (RQ1), as users tend to prefer a streamlined approach based upon survey results.\n\nMeasures and heatmaps confirm various areas that are capable of being streamlined. A/B testing confirms that potential to increase effectiveness and efficiency of various components (RQ2), as we saw improvements in 9/10 A/B tests. Finally, tactical measures elicit the ability of our approach to improve effectiveness and efficiency through a single measure (RQ3).\n\nPEA can be used in combination with other technologies and methods, along with web analytics and market analysis. We note a limitation of PEA in regards to not being an appropriate method for all pages. For future work, we will explore webpage changes based upon PEV recommendations from a lab-based setting or combined with more complex web analytics methodologies, such as temporal assess of components (Zhang, Jansen, & Spink, 2009). In particular, we suggest future research emphasize importance of pixel space allocation within mobile computing and/or computational advertising. In general, we predict screen real estate to play an increasingly important role within the future of web analytics and design. Brophy, J., & Bawden, D. (2005). Is Google enough?\n\nComparison of an internet search engine with academic library resources. Aslib Proceedings, 57 (6) Table 7. An overview of the CEV equations.\n\nFigure 1 .\n1A strategic web analytics framework modified from the Web Analytics Process Guide Jansen (2009).\n\nFigure 2 .\n2An example heatmap image of the homepage produced by CrazyEgg.\n\nFigure 3 .\n3A/B test 1 of the search area.\n\nFigure 4 .\n4Control version of the search area.\n\nFigure 5 .\n5A/B (survey) test 2 of the search area. Preferred by 61/93 surveyed.\n\nFigure 6 .\n6The control version of the databases page.\n\nFigure 7 .\n7A/B test 2 of the databases page.\n\nFigure 8 .Figure 9 .\n89The research guides page of the library in question. The research guides survey variation. 86/93 participants selected.\n\n\nTable 1.Identified goals, KPIs, and associated metrics.Website \nGoals \nKPIs \nAssociated Metrics \n\nImprove \nContent Value \n\nPage \nEngagement \nPatterns \n\n• Pageviews \n• Bounce Rate \n• Entrances \n• Returning % \n• Avg. Time on Page \n\nStreamline \nUsers to Key \nTasks \n\nVisits that \nCorrelate with \nUser Satisfaction \n\n\n\nTable 4 .\n4A Pearson correlations matrix representing the variables within the survey.\n\n\nWhile the proportion of moderate to heavy usage achieved by the search area (in comparison to the rest of the page) bodes well for ROI, we are still left with low efficiency. PEA reveals that the search area on the homepage takes up a total of 123,200 square pixels, yet is that size necessary to maintain effectiveness? Rather, we maintain that there is potential to improve efficiency of the search area, while maintaining and perhaps even increasing effectiveness. Equation 2 shows a search area PEV of 18.66%. Equation 3 improves to 21.64%.Though, the original A/B test achieves only slight improvement (18.66% vs. 21.64%), this must be taken into account with the notion that this represents a real-time A/B test, which hinges on slight variations to existing and operational system interfaces. The point that the area maintained relatively heavy usage even when manipulating the search area in real time indicates that the same or better organizational KPI achievement is attainable via a more efficient utilization of the page real estate. While the A/B test presented does not necessarily represent the envisioned streamlined search area (i.e. Google, Amazon, etc.), the results show the viability of the pixel efficiency method.We find that 6,368 square pixels of the search area obtain \nmoderate usage and 16,623 square pixels obtain heavy \nusage, combining for 22,991 square pixels of the search \narea obtaining moderate to heavy usage. Given that 43,664 \nsquare pixels obtain moderate to heavy usage in total on the \nhomepage, we can note that the search area accounts for \n52.65% of moderate to heavy usage on the homepage. \n\nComponent \n\nModerate \nUsage \n\nHeavy \nUsage \n\nComponent Real \nEstate \nPEV Equation \nPEV \n\n1. Homepage \n10,876 \n32,788 \n1,245,127 \n(10,876 + 32,788) / 1,245,127 \n3.51% \n\n2. Search Area Control \n6,368 \n16,623 \n123,200 \n(6,368 + 16,623) / 123,200 \n18.66% \n\n3. Search Area A/B \n6,368 \n16,623 \n106,232 \n(6,368 + 16,623) / 106,232 \n21.64% \n\n4. Search Area Survey \n6,368 \n16,623 \n49,006 \n(6,368 + 16,623) / 49,006 \n46.91% \n\n\n\nTable 6 .\n6An overview of the PEV equations.Figure 11. A/B test 1 of the ILL page.Figure 10. The control version of the ILL page.the A/B test presented does not necessarily represent the envisioned streamlined search area (i.e. Google, Amazon, etc.), the results show the viability of the pixel efficiency method. We were able to employ a real-time manipulation to the search area of the homepage that permitted a more efficient usage of page real estate, with no loss of KPI effectiveness. When utilized in combination with a survey, we exhibit how you can drastically improve the efficiency of real estate usage and that bigger is not always better. The modified search area within the survey was much smaller (i.e. 49,006 square pixels) than both the original search area and the first A/B test search area. Despite being tested through a survey instead of an A/B test, which we determined to be too big of a risk, we report that 2/3 of users prefer the smaller search area in the survey. The streamlined search area shown in the survey, equated to PEV, is shown in Equation 4.While \n\n\n, 498-512. Buscher, G., Cutrell, E., & Morris, M. R. (2009). What do you see when you're surfing?: using eye tracking toComponent \nConversions Component Real Estate \nCEV Equation \nCEV \n\n5. Database Baseline \n1,060 \n302,670 \n(1,060 / 302,670) * 100 \n35.02% \n\n6. Database A/B 2 \n1,109 \n205,200 \n(1,109 + 49) / 205,200 * 100 \n56.43% \n\n7. ILL Baseline \n123 \n32,040 \n(123 / 32,040) * 100 \n38.39% \n\n8. ILL A/B 1 \n160 \n27,813 \n(160 + 37) / 27,813 * 100 \n70.83% \n\n\n\nAn analysis of American academic libraries' websites: 2000-2010. The Electronic Library. N Aharony, 30Aharony, N. (2012). An analysis of American academic libraries' websites: 2000-2010. The Electronic Library, 30(6), 764-776.\n\nAssessing homegrown library collections: Using Google Analytics to track use of screencasts and flash-based learning objects. P Betty, Journal of Electronic Resources Librarianship. 211Betty, P. (2009). Assessing homegrown library collections: Using Google Analytics to track use of screencasts and flash-based learning objects. Journal of Electronic Resources Librarianship, 21(1), 75-92.\n\nProceedings of the SIGCHI Conference on Human Factors in Computing Systems. the SIGCHI Conference on Human Factors in Computing Systemspredict salient regions of web pages. Paper presented at thepredict salient regions of web pages. Paper presented at the Proceedings of the SIGCHI Conference on Human Factors in Computing Systems.\n\nInfluence of human behavior and the principle of least effort on library and information science research. Y.-W Chang, Information Processing & Management. 524Chang, Y.-W. (2016). Influence of human behavior and the principle of least effort on library and information science research. Information Processing & Management, 52(4), 658-669.\n\nLibrary performance measurement in the digital age. A Conyers, P Payne, University Libraries and Digital Learning Environments. P. Dale, J. Beard, & M. HollandConyers, A., & Payne, P. (2011). Library performance measurement in the digital age. In P. Dale, J. Beard, & M. Holland (Eds.), University Libraries and Digital Learning Environments (pp. 201-214).\n\nMeasuring the value of library content collections. D M Coughlin, M C Campbell, B J Jansen, Proceedings of the 76th ASIS&T Annual Meeting: Beyond the Cloud: Rethinking Information Boundaries. the 76th ASIS&T Annual Meeting: Beyond the Cloud: Rethinking Information BoundariesMontrealPaper presented at theCoughlin, D. M., Campbell, M. C., & Jansen, B. J. (2013). Measuring the value of library content collections. Paper presented at the Proceedings of the 76th ASIS&T Annual Meeting: Beyond the Cloud: Rethinking Information Boundaries, Montreal.\n\nModeling journal bibliometrics to predict downloads and inform purchase decisions at university research libraries. D M Coughlin, B J Jansen, Journal of the Association for Information Science and Technology. Coughlin, D. M., & Jansen, B. J. (2015). Modeling journal bibliometrics to predict downloads and inform purchase decisions at university research libraries. Journal of the Association for Information Science and Technology.\n\nAbout us. Digital Analytics Association. RetrievedDigital Analytics Association. (n.d.). About us. Retrieved April 8, 2015, from http://www.digitalanalyticsassociation.org/about\n\nThe suitability of web analytics key performance indicators in the academic library environment. J C Fagan, The Journal of Academic Librarianship. 401Fagan, J. C. (2014). The suitability of web analytics key performance indicators in the academic library environment. The Journal of Academic Librarianship, 40(1), 25-34.\n\nUses, limitations, and trends in web analytics Handbook of Research on Web Log Analysis. A Ferrini, J J Mohr, Ferrini, A., & Mohr, J. J. (2009). Uses, limitations, and trends in web analytics Handbook of Research on Web Log Analysis (pp. 122-140).\n\nUnderstanding user-web interactions via web analytics. B J Jansen, Synthesis Lectures on Information Concepts, Retrieval, and Services. 11Jansen, B. J. (2009). Understanding user-web interactions via web analytics. Synthesis Lectures on Information Concepts, Retrieval, and Services, 1(1), 1-102.\n\nThe seventeen theoretical constructs of information searching and information retrieval. B J Jansen, S Y Rieh, Journal of the American Society for Information Science and Technology. 8Jansen, B. J., & Rieh, S. Y. (2010). The seventeen theoretical constructs of information searching and information retrieval. Journal of the American Society for Information Science and Technology, 61(8), 1517-1534.\n\nGoogle Scholar™ and libraries: point/counterpoint. M Kesselman, S B Watstein, Reference Services Review. 334Kesselman, M., & Watstein, S. B. (2005). Google Scholar™ and libraries: point/counterpoint. Reference Services Review, 33(4), 380-387.\n\nWeb analytics and metrics: A survey. L Kumar, H Singh, R Kaur, Chennai, IndiaPaper presented at the ICACCIKumar, L., Singh, H., & Kaur, R. (2012). Web analytics and metrics: A survey. Paper presented at the ICACCI, Chennai, India.\n\nContinuous improvement methodology applied to United Kingdom academic library websites via national survey results. S Manuel, J Dearnley, G Walton, New Review of Information Networking. 152Manuel, S., Dearnley, J., & Walton, G. (2010). Continuous improvement methodology applied to United Kingdom academic library websites via national survey results. New Review of Information Networking, 15(2), 55-80.\n\nUsability of the academic library web site: implications for design. L Mcgillis, E G Toms, College & Research Libraries. 624McGillis, L., & Toms, E. G. (2001). Usability of the academic library web site: implications for design. College & Research Libraries, 62(4), 355-367.\n\nHow much of it is real? Analysis of paid placement in Web search engine results. S Nicholson, T Sierra, U Y Eseryel, J.-H Park, P Barkow, E J Pozo, J Ward, Journal of the American Society for Information Science and Technology. 574Nicholson, S., Sierra, T., Eseryel, U. Y., Park, J.-H., Barkow, P., Pozo, E. J., & Ward, J. (2006). How much of it is real? Analysis of paid placement in Web search engine results. Journal of the American Society for Information Science and Technology, 57(4), 448-461.\n\nImplementation and use of web analytics for academic library websites. A Paul, S Erdelez, World Digital Libraries. 62Paul, A., & Erdelez, S. (2013). Implementation and use of web analytics for academic library websites. World Digital Libraries, 6(2), 115-132.\n\nKey Performance Indicators Infographic. Kpi The, Institute, The KPI Institute. (2016). Key Performance Indicators Infographic (pp. 1).\n\nChanges in the digital scholarly environment and issues of trust: An exploratory, qualitative analysis. Information Processing & Management. A Watkinson, D Nicholas, C Thornley, E Herman, H R Jamali, R Volentine, S Allard, K Levine, C Tenopir, 3Watkinson, A., Nicholas, D., Thornley, C., Herman, E., Jamali, H.R., Volentine, r., Allard, s., Levine, K., Tenopir, C. (2016). Changes in the digital scholarly environment and issues of trust: An exploratory, qualitative analysis. Information Processing & Management. (52), 3, 446-458.\n\nTime series analysis of a Web search engine transaction log. Y Zhang, B J Jansen, A Spink, Information Processing & Management. 452Zhang, Y., Jansen, B. J., & Spink, A. (2009). Time series analysis of a Web search engine transaction log. Information Processing & Management, 45(2), 230-245.\n", "annotations": {"author": "[{\"end\":244,\"start\":68},{\"end\":421,\"start\":245},{\"end\":620,\"start\":422}]", "publisher": null, "author_last_name": "[{\"end\":78,\"start\":73},{\"end\":255,\"start\":251},{\"end\":438,\"start\":432}]", "author_first_name": "[{\"end\":72,\"start\":68},{\"end\":250,\"start\":245},{\"end\":429,\"start\":422},{\"end\":431,\"start\":430}]", "author_affiliation": "[{\"end\":243,\"start\":80},{\"end\":420,\"start\":257},{\"end\":619,\"start\":456}]", "title": "[{\"end\":65,\"start\":1},{\"end\":685,\"start\":621}]", "venue": null, "abstract": "[{\"end\":1856,\"start\":732}]", "bib_ref": "[{\"attributes\":{\"ref_id\":\"b0\"},\"end\":2150,\"start\":2135},{\"attributes\":{\"ref_id\":\"b12\"},\"end\":2591,\"start\":2563},{\"end\":2676,\"start\":2652},{\"end\":2848,\"start\":2809},{\"attributes\":{\"ref_id\":\"b11\"},\"end\":3156,\"start\":3135},{\"attributes\":{\"ref_id\":\"b3\"},\"end\":3349,\"start\":3336},{\"attributes\":{\"ref_id\":\"b19\"},\"end\":3374,\"start\":3351},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":3571,\"start\":3560},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":4954,\"start\":4931},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":4967,\"start\":4954},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":5111,\"start\":5089},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":5123,\"start\":5111},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":5367,\"start\":5354},{\"attributes\":{\"ref_id\":\"b8\"},\"end\":5517,\"start\":5505},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":5686,\"start\":5652},{\"attributes\":{\"ref_id\":\"b17\"},\"end\":5780,\"start\":5757},{\"attributes\":{\"ref_id\":\"b18\"},\"end\":6441,\"start\":6416},{\"attributes\":{\"ref_id\":\"b16\"},\"end\":6589,\"start\":6566},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":7854,\"start\":7831},{\"attributes\":{\"ref_id\":\"b5\"},\"end\":11565,\"start\":11528},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":11725,\"start\":11712},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":21687,\"start\":21664},{\"attributes\":{\"ref_id\":\"b6\"},\"end\":25868,\"start\":25843},{\"attributes\":{\"ref_id\":\"b20\"},\"end\":34611,\"start\":34582},{\"end\":34920,\"start\":34889}]", "figure": "[{\"attributes\":{\"id\":\"fig_0\"},\"end\":35192,\"start\":35083},{\"attributes\":{\"id\":\"fig_1\"},\"end\":35268,\"start\":35193},{\"attributes\":{\"id\":\"fig_2\"},\"end\":35312,\"start\":35269},{\"attributes\":{\"id\":\"fig_3\"},\"end\":35361,\"start\":35313},{\"attributes\":{\"id\":\"fig_4\"},\"end\":35443,\"start\":35362},{\"attributes\":{\"id\":\"fig_5\"},\"end\":35499,\"start\":35444},{\"attributes\":{\"id\":\"fig_6\"},\"end\":35546,\"start\":35500},{\"attributes\":{\"id\":\"fig_7\"},\"end\":35690,\"start\":35547},{\"attributes\":{\"id\":\"tab_0\",\"type\":\"table\"},\"end\":36006,\"start\":35691},{\"attributes\":{\"id\":\"tab_2\",\"type\":\"table\"},\"end\":36094,\"start\":36007},{\"attributes\":{\"id\":\"tab_4\",\"type\":\"table\"},\"end\":38152,\"start\":36095},{\"attributes\":{\"id\":\"tab_5\",\"type\":\"table\"},\"end\":39240,\"start\":38153},{\"attributes\":{\"id\":\"tab_6\",\"type\":\"table\"},\"end\":39699,\"start\":39241}]", "paragraph": "[{\"end\":2383,\"start\":1872},{\"end\":3678,\"start\":2385},{\"end\":4474,\"start\":3680},{\"end\":4557,\"start\":4476},{\"end\":5125,\"start\":4559},{\"end\":6442,\"start\":5127},{\"end\":6911,\"start\":6444},{\"end\":7313,\"start\":6934},{\"end\":8270,\"start\":7315},{\"end\":8706,\"start\":8272},{\"end\":9649,\"start\":8870},{\"end\":9758,\"start\":9651},{\"end\":10644,\"start\":9760},{\"end\":11420,\"start\":10789},{\"end\":11787,\"start\":11478},{\"end\":12655,\"start\":11789},{\"end\":13208,\"start\":12657},{\"end\":13989,\"start\":13210},{\"end\":14435,\"start\":13991},{\"end\":14808,\"start\":14437},{\"end\":15145,\"start\":14810},{\"end\":15630,\"start\":15147},{\"end\":16104,\"start\":15632},{\"end\":17132,\"start\":16106},{\"end\":17682,\"start\":17213},{\"end\":18025,\"start\":17684},{\"end\":18935,\"start\":18066},{\"end\":18990,\"start\":18964},{\"end\":19186,\"start\":19035},{\"end\":20404,\"start\":19235},{\"end\":22401,\"start\":20454},{\"end\":22695,\"start\":22443},{\"end\":23190,\"start\":22697},{\"end\":23627,\"start\":23192},{\"end\":24359,\"start\":23649},{\"end\":25512,\"start\":24361},{\"end\":25762,\"start\":25539},{\"end\":26231,\"start\":25764},{\"end\":26449,\"start\":26233},{\"end\":27027,\"start\":26451},{\"end\":28581,\"start\":27060},{\"end\":29198,\"start\":28583},{\"end\":30727,\"start\":29220},{\"end\":31085,\"start\":30761},{\"end\":32358,\"start\":31087},{\"end\":33198,\"start\":32360},{\"end\":33599,\"start\":33200},{\"end\":33809,\"start\":33629},{\"end\":34175,\"start\":33811},{\"end\":34939,\"start\":34177},{\"end\":35082,\"start\":34941}]", "formula": null, "table_ref": "[{\"end\":12654,\"start\":12647},{\"end\":15144,\"start\":15137},{\"end\":17424,\"start\":17417},{\"end\":19080,\"start\":19073},{\"end\":19762,\"start\":19755},{\"end\":19861,\"start\":19854},{\"attributes\":{\"ref_id\":\"tab_2\"},\"end\":20477,\"start\":20469},{\"end\":23389,\"start\":23382},{\"end\":28579,\"start\":28572},{\"attributes\":{\"ref_id\":\"tab_5\"},\"end\":31143,\"start\":31134},{\"end\":32431,\"start\":32424},{\"end\":35047,\"start\":35040}]", "section_header": "[{\"end\":1870,\"start\":1858},{\"end\":6932,\"start\":6914},{\"end\":8868,\"start\":8709},{\"end\":10787,\"start\":10647},{\"end\":11476,\"start\":11423},{\"end\":17163,\"start\":17135},{\"end\":17211,\"start\":17166},{\"end\":18064,\"start\":18028},{\"end\":18962,\"start\":18938},{\"end\":19033,\"start\":18993},{\"end\":19233,\"start\":19189},{\"end\":20414,\"start\":20407},{\"end\":20452,\"start\":20417},{\"end\":22441,\"start\":22404},{\"end\":23647,\"start\":23630},{\"end\":25537,\"start\":25515},{\"end\":27058,\"start\":27030},{\"end\":29218,\"start\":29201},{\"end\":30759,\"start\":30730},{\"end\":33627,\"start\":33602},{\"end\":35094,\"start\":35084},{\"end\":35204,\"start\":35194},{\"end\":35280,\"start\":35270},{\"end\":35324,\"start\":35314},{\"end\":35373,\"start\":35363},{\"end\":35455,\"start\":35445},{\"end\":35511,\"start\":35501},{\"end\":35568,\"start\":35548},{\"end\":36017,\"start\":36008},{\"end\":38163,\"start\":38154}]", "table": "[{\"end\":36006,\"start\":35748},{\"end\":38152,\"start\":37334},{\"end\":39240,\"start\":39234},{\"end\":39699,\"start\":39363}]", "figure_caption": "[{\"end\":35192,\"start\":35096},{\"end\":35268,\"start\":35206},{\"end\":35312,\"start\":35282},{\"end\":35361,\"start\":35326},{\"end\":35443,\"start\":35375},{\"end\":35499,\"start\":35457},{\"end\":35546,\"start\":35513},{\"end\":35690,\"start\":35571},{\"end\":35748,\"start\":35693},{\"end\":36094,\"start\":36019},{\"end\":37334,\"start\":36097},{\"end\":39234,\"start\":38165},{\"end\":39363,\"start\":39243}]", "figure_ref": "[{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":10050,\"start\":10042},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":11786,\"start\":11778},{\"attributes\":{\"ref_id\":\"fig_1\"},\"end\":20089,\"start\":20081},{\"attributes\":{\"ref_id\":\"fig_2\"},\"end\":24413,\"start\":24405},{\"attributes\":{\"ref_id\":\"fig_3\"},\"end\":24493,\"start\":24483},{\"attributes\":{\"ref_id\":\"fig_3\"},\"end\":25279,\"start\":25264},{\"attributes\":{\"ref_id\":\"fig_4\"},\"end\":25398,\"start\":25390},{\"attributes\":{\"ref_id\":\"fig_5\"},\"end\":26048,\"start\":26040},{\"attributes\":{\"ref_id\":\"fig_6\"},\"end\":26491,\"start\":26482},{\"end\":27095,\"start\":27085},{\"end\":28648,\"start\":28639},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":29243,\"start\":29233},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":30403,\"start\":30393}]", "bib_author_first_name": "[{\"end\":39791,\"start\":39790},{\"end\":40056,\"start\":40055},{\"end\":40764,\"start\":40760},{\"end\":41047,\"start\":41046},{\"end\":41058,\"start\":41057},{\"end\":41405,\"start\":41404},{\"end\":41407,\"start\":41406},{\"end\":41419,\"start\":41418},{\"end\":41421,\"start\":41420},{\"end\":41433,\"start\":41432},{\"end\":41435,\"start\":41434},{\"end\":42018,\"start\":42017},{\"end\":42020,\"start\":42019},{\"end\":42032,\"start\":42031},{\"end\":42034,\"start\":42033},{\"end\":42612,\"start\":42611},{\"end\":42614,\"start\":42613},{\"end\":42926,\"start\":42925},{\"end\":42937,\"start\":42936},{\"end\":42939,\"start\":42938},{\"end\":43141,\"start\":43140},{\"end\":43143,\"start\":43142},{\"end\":43473,\"start\":43472},{\"end\":43475,\"start\":43474},{\"end\":43485,\"start\":43484},{\"end\":43487,\"start\":43486},{\"end\":43836,\"start\":43835},{\"end\":43849,\"start\":43848},{\"end\":43851,\"start\":43850},{\"end\":44066,\"start\":44065},{\"end\":44075,\"start\":44074},{\"end\":44084,\"start\":44083},{\"end\":44377,\"start\":44376},{\"end\":44387,\"start\":44386},{\"end\":44399,\"start\":44398},{\"end\":44735,\"start\":44734},{\"end\":44747,\"start\":44746},{\"end\":44749,\"start\":44748},{\"end\":45023,\"start\":45022},{\"end\":45036,\"start\":45035},{\"end\":45046,\"start\":45045},{\"end\":45048,\"start\":45047},{\"end\":45062,\"start\":45058},{\"end\":45070,\"start\":45069},{\"end\":45080,\"start\":45079},{\"end\":45082,\"start\":45081},{\"end\":45090,\"start\":45089},{\"end\":45514,\"start\":45513},{\"end\":45522,\"start\":45521},{\"end\":45746,\"start\":45743},{\"end\":45981,\"start\":45980},{\"end\":45994,\"start\":45993},{\"end\":46006,\"start\":46005},{\"end\":46018,\"start\":46017},{\"end\":46028,\"start\":46027},{\"end\":46030,\"start\":46029},{\"end\":46040,\"start\":46039},{\"end\":46053,\"start\":46052},{\"end\":46063,\"start\":46062},{\"end\":46073,\"start\":46072},{\"end\":46434,\"start\":46433},{\"end\":46443,\"start\":46442},{\"end\":46445,\"start\":46444},{\"end\":46455,\"start\":46454}]", "bib_author_last_name": "[{\"end\":39799,\"start\":39792},{\"end\":40062,\"start\":40057},{\"end\":40770,\"start\":40765},{\"end\":41055,\"start\":41048},{\"end\":41064,\"start\":41059},{\"end\":41416,\"start\":41408},{\"end\":41430,\"start\":41422},{\"end\":41442,\"start\":41436},{\"end\":42029,\"start\":42021},{\"end\":42041,\"start\":42035},{\"end\":42620,\"start\":42615},{\"end\":42934,\"start\":42927},{\"end\":42944,\"start\":42940},{\"end\":43150,\"start\":43144},{\"end\":43482,\"start\":43476},{\"end\":43492,\"start\":43488},{\"end\":43846,\"start\":43837},{\"end\":43860,\"start\":43852},{\"end\":44072,\"start\":44067},{\"end\":44081,\"start\":44076},{\"end\":44089,\"start\":44085},{\"end\":44384,\"start\":44378},{\"end\":44396,\"start\":44388},{\"end\":44406,\"start\":44400},{\"end\":44744,\"start\":44736},{\"end\":44754,\"start\":44750},{\"end\":45033,\"start\":45024},{\"end\":45043,\"start\":45037},{\"end\":45056,\"start\":45049},{\"end\":45067,\"start\":45063},{\"end\":45077,\"start\":45071},{\"end\":45087,\"start\":45083},{\"end\":45095,\"start\":45091},{\"end\":45519,\"start\":45515},{\"end\":45530,\"start\":45523},{\"end\":45750,\"start\":45747},{\"end\":45761,\"start\":45752},{\"end\":45991,\"start\":45982},{\"end\":46003,\"start\":45995},{\"end\":46015,\"start\":46007},{\"end\":46025,\"start\":46019},{\"end\":46037,\"start\":46031},{\"end\":46050,\"start\":46041},{\"end\":46060,\"start\":46054},{\"end\":46070,\"start\":46064},{\"end\":46081,\"start\":46074},{\"end\":46440,\"start\":46435},{\"end\":46452,\"start\":46446},{\"end\":46461,\"start\":46456}]", "bib_entry": "[{\"attributes\":{\"id\":\"b0\"},\"end\":39927,\"start\":39701},{\"attributes\":{\"id\":\"b1\"},\"end\":40318,\"start\":39929},{\"attributes\":{\"id\":\"b2\"},\"end\":40651,\"start\":40320},{\"attributes\":{\"id\":\"b3\"},\"end\":40992,\"start\":40653},{\"attributes\":{\"id\":\"b4\"},\"end\":41350,\"start\":40994},{\"attributes\":{\"id\":\"b5\"},\"end\":41899,\"start\":41352},{\"attributes\":{\"id\":\"b6\"},\"end\":42333,\"start\":41901},{\"attributes\":{\"id\":\"b7\"},\"end\":42512,\"start\":42335},{\"attributes\":{\"id\":\"b8\"},\"end\":42834,\"start\":42514},{\"attributes\":{\"id\":\"b9\"},\"end\":43083,\"start\":42836},{\"attributes\":{\"id\":\"b10\"},\"end\":43381,\"start\":43085},{\"attributes\":{\"id\":\"b11\"},\"end\":43782,\"start\":43383},{\"attributes\":{\"id\":\"b12\"},\"end\":44026,\"start\":43784},{\"attributes\":{\"id\":\"b13\"},\"end\":44258,\"start\":44028},{\"attributes\":{\"id\":\"b14\"},\"end\":44663,\"start\":44260},{\"attributes\":{\"id\":\"b15\"},\"end\":44939,\"start\":44665},{\"attributes\":{\"id\":\"b16\"},\"end\":45440,\"start\":44941},{\"attributes\":{\"id\":\"b17\"},\"end\":45701,\"start\":45442},{\"attributes\":{\"id\":\"b18\"},\"end\":45837,\"start\":45703},{\"attributes\":{\"id\":\"b19\"},\"end\":46370,\"start\":45839},{\"attributes\":{\"id\":\"b20\"},\"end\":46662,\"start\":46372}]", "bib_title": "[{\"end\":40053,\"start\":39929},{\"end\":40758,\"start\":40653},{\"end\":41044,\"start\":40994},{\"end\":41402,\"start\":41352},{\"end\":42015,\"start\":41901},{\"end\":42343,\"start\":42335},{\"end\":42609,\"start\":42514},{\"end\":43138,\"start\":43085},{\"end\":43470,\"start\":43383},{\"end\":43833,\"start\":43784},{\"end\":44374,\"start\":44260},{\"end\":44732,\"start\":44665},{\"end\":45020,\"start\":44941},{\"end\":45511,\"start\":45442},{\"end\":46431,\"start\":46372}]", "bib_author": "[{\"end\":39801,\"start\":39790},{\"end\":40064,\"start\":40055},{\"end\":40772,\"start\":40760},{\"end\":41057,\"start\":41046},{\"end\":41066,\"start\":41057},{\"end\":41418,\"start\":41404},{\"end\":41432,\"start\":41418},{\"end\":41444,\"start\":41432},{\"end\":42031,\"start\":42017},{\"end\":42043,\"start\":42031},{\"end\":42622,\"start\":42611},{\"end\":42936,\"start\":42925},{\"end\":42946,\"start\":42936},{\"end\":43152,\"start\":43140},{\"end\":43484,\"start\":43472},{\"end\":43494,\"start\":43484},{\"end\":43848,\"start\":43835},{\"end\":43862,\"start\":43848},{\"end\":44074,\"start\":44065},{\"end\":44083,\"start\":44074},{\"end\":44091,\"start\":44083},{\"end\":44386,\"start\":44376},{\"end\":44398,\"start\":44386},{\"end\":44408,\"start\":44398},{\"end\":44746,\"start\":44734},{\"end\":44756,\"start\":44746},{\"end\":45035,\"start\":45022},{\"end\":45045,\"start\":45035},{\"end\":45058,\"start\":45045},{\"end\":45069,\"start\":45058},{\"end\":45079,\"start\":45069},{\"end\":45089,\"start\":45079},{\"end\":45097,\"start\":45089},{\"end\":45521,\"start\":45513},{\"end\":45532,\"start\":45521},{\"end\":45752,\"start\":45743},{\"end\":45763,\"start\":45752},{\"end\":45993,\"start\":45980},{\"end\":46005,\"start\":45993},{\"end\":46017,\"start\":46005},{\"end\":46027,\"start\":46017},{\"end\":46039,\"start\":46027},{\"end\":46052,\"start\":46039},{\"end\":46062,\"start\":46052},{\"end\":46072,\"start\":46062},{\"end\":46083,\"start\":46072},{\"end\":46442,\"start\":46433},{\"end\":46454,\"start\":46442},{\"end\":46463,\"start\":46454}]", "bib_venue": "[{\"end\":40455,\"start\":40396},{\"end\":41627,\"start\":41544},{\"end\":39788,\"start\":39701},{\"end\":40109,\"start\":40064},{\"end\":40394,\"start\":40320},{\"end\":40807,\"start\":40772},{\"end\":41120,\"start\":41066},{\"end\":41542,\"start\":41444},{\"end\":42108,\"start\":42043},{\"end\":42374,\"start\":42345},{\"end\":42659,\"start\":42622},{\"end\":42923,\"start\":42836},{\"end\":43219,\"start\":43152},{\"end\":43564,\"start\":43494},{\"end\":43887,\"start\":43862},{\"end\":44063,\"start\":44028},{\"end\":44444,\"start\":44408},{\"end\":44784,\"start\":44756},{\"end\":45167,\"start\":45097},{\"end\":45555,\"start\":45532},{\"end\":45741,\"start\":45703},{\"end\":45978,\"start\":45839},{\"end\":46498,\"start\":46463}]"}}}, "year": 2023, "month": 12, "day": 17}