{"id": 51975981, "updated": "2022-05-06 13:24:26.448", "metadata": {"title": "Robust Detection of Communities with Multi-Semantics in Large Attributed Networks", "authors": "[{\"first\":\"Di\",\"last\":\"Jin\",\"middle\":[]},{\"first\":\"Ziyang\",\"last\":\"Liu\",\"middle\":[]},{\"first\":\"Dongxiao\",\"last\":\"He\",\"middle\":[]},{\"first\":\"Bogdan\",\"last\":\"Gabrys\",\"middle\":[]},{\"first\":\"Katarzyna\",\"last\":\"Musial\",\"middle\":[]}]", "venue": "KSEM", "journal": "362-376", "publication_date": {"year": 2018, "month": null, "day": null}, "abstract": ". In this paper, we are interested in how to explore and utilize the relationship between network communities and semantic topics in order to find the strong explanatory communities robustly. First, the relationship between communities and topics displays different situations. For example, from the view-point of semantic mapping, their relationship can be one-to-one, one-to-many or many-to-one. But from the standpoint of underlying community structures, the relationship can be consistent, partially consistent or completely inconsistent. Second, it will be helpful to not only find communities more precise but also reveal the communities’ semantics that shows the relationship between communities and topics. To better describe this relationship, we introduce the transition probability which is an important concept in Markov chain into a well-designed nonnegative matrix factorization framework. This new transition probability matrix with a suitable prior which plays the role of depicting the relationship between communities and topics can perform well in this task. To illustrate the effectiveness of the proposed new approach, we conduct some experiments on both synthetic and real networks. The results show that our new method is superior to baselines in accuracy. We finally conduct a case study analysis to validate the new method’s strong interpretability to detected communities.", "fields_of_study": "[\"Computer Science\"]", "external_ids": {"arxiv": null, "mag": "2887415938", "acl": null, "pubmed": null, "pubmedcentral": null, "dblp": "conf/ksem/JinLHGM18", "doi": "10.1007/978-3-319-99365-2_32"}}, "content": {"source": {"pdf_hash": "c2321650991d6ae10af057cba0a5b05cd5729f51", "pdf_src": "Anansi", "pdf_uri": "[\"https://opus.lib.uts.edu.au/bitstream/10453/129294/1/2018_KSEM.pdf\"]", "oa_url_match": true, "oa_info": {"license": null, "open_access_url": "https://opus.lib.uts.edu.au/bitstream/10453/129294/1/2018_KSEM.pdf", "status": "GREEN"}}, "grobid": {"id": "15f225829bff17cf0df9ee8b2647ed32d968da05", "type": "plain-text", "url": "s3://ai2-s2-pdf-extraction-prod/parse-results/s2orc_worker/c2321650991d6ae10af057cba0a5b05cd5729f51.txt", "contents": "\nRobust Detection of Communities with Multi-Semantics in Large Attributed Networks\n\n\nDi Jin jindi@tju.edu.cn \nSchool of Computer Science and Technology\nTianjin University\n300350TianjinChina\n\nZiyang Liu liuziyang@tju.edu.cn \nSchool of Computer Science and Technology\nTianjin University\n300350TianjinChina\n\nDongxiao He hedongxiao@tju.edu.cn \nSchool of Computer Science and Technology\nTianjin University\n300350TianjinChina\n\nBogdan Gabrys bogdan.gabrys@uts.edu.au \nAdvanced Analytics Institute\nSchool of Software\nFaculty of Engineering and IT\nUniversity of Technology Sydney\nBroadway NSW 2007PO Box 123Australia\n\nKatarzyna Musial katarzyna.musial-gabrys@uts.edu.au \nAdvanced Analytics Institute\nSchool of Software\nFaculty of Engineering and IT\nUniversity of Technology Sydney\nBroadway NSW 2007PO Box 123Australia\n\nRobust Detection of Communities with Multi-Semantics in Large Attributed Networks\nCommunity DetectionSocial NetworksSemanticsTransition ProbabilityNonnegative M atrix Factorization\nIn this paper, we are interested in how to explore and utilize the relationship between network communities and semantic topics in order to find the strong explanatory communities robustly. First, the relationship between communities and topics displays different situations. For example, from the viewpoint of semantic mapping, their relationship can be one-to-one, one-to-many or many-to-one. But from the standpoint of underlying community structures, the relationship can be consistent, partially consistent or completely inconsistent. Second, it will be helpful to not only find communities more precise but also reveal the communities' semantics that shows the relationship between communities and topics. To better describe this relationship, we introduce the transition probability which is an important concept in M arkov chain into a well-designed nonnegative matrix factorization framework. This new transition probability matrix with a suitable prior which plays the role of depicting the relationship between communities and topics can perform well in this task. To illustrate the effectiveness of the proposed new approach, we conduct some experiments on both synthetic and real networks. The results show that our new method is superior to baselines in accuracy. We finally conduct a case study analysis to validate the new method's strong interpretability to detected communities.\n\nIntroduction\n\nNetwork science is a modern and significant discipline in many fields, such as social and computer science. Networks, consisting of nodes and edges which con nect a pair of nodes, always occur in a variety of contexts [1]. The real-world networks usually share the same characteristic: they exhibit strong community structure. The property of community structure is: in which network nodes are joined together in tightly knit groups, between which there are only looser connections [2]. For example, in Facebook, users who have consistent interests often gather together and form a community but there are only few connections between such communities. Community structure reveals the fundamental functional modules of a network and enables u s to better understand the interactive behavior of the network. Community detection has developed rapidly in recent years and various community detection methods, which mainly focus on network topology, have been proposed, e.g., the agglomerative or divisive algorithms [3], modularity optimization based methods [4], and spectral algorithms [5]. Further, it is well known that a node may belong to multiple communities (i.e. overlapping community). As a result, lots of methods were developed to detect overlapping community, such as k-clique community detection algorithms [6], local expansion and optimization algorithms [7] and probabilistic modelbased algorithms [8]. Except for network topology, node attributes or link attributes are also taken into account when discovering communities [9][10][11]. In addition to improving community detection, researchers have realized that community detection should not only find community structure but als o describe communities semantically by the use of abundant verbal information in the textual content. These descriptions can reveal why some nodes form a community and enable people to better understand the functions or meanings of communities, and in a way, this has much more practical value in real-world applications. Some methods have been proposed which combine topology and content information and give reasonable and interpretable communities [12,13]. However, some problems still occur and need to be solved when network topology and node contents are integrated. One of the most important issues is the mismatch problem of topology and content. Traditional methods [12][13][14] typically assume that the network topology and node contents share the same community membership, but in many real social networks, this assumption does not always hold. For example, in a Twitter network, social links usually directly reflect which users gather into a community, while users may generate diverse and disordered content information. Thus, the community membership derived by network topology probably differs from the cluster membership derived by node contents.\n\nFor the above problem, it is necessary to extract useful content information to assist topology information in detecting more actual and accurate communities. In this paper, we propose a new generative model different from the traditional generative model and design a new community detection method, referred to as Robust and Strong Explan atory Community Detection (RSECD). To be specific, based on nonnegative matrix factorization (NMF), we are able to obtain the community membership matrix for network topology and cluster membership matrix for node contents. More important ly, there exists some implicit relation between network communities and content clusters, thus we introduce a transition probability matrix to depict it. As a result, even though the content information does not match with topology information, our method can still obtain accurate detection results by using the transition matrix with a suitable prior. At last, we put network topology, node content and transition matrix into a unified NMF framework, and optimize them altogether by designing effective updating rules in order to achieve an integral balance of them.\n\nIn the experiments, we use artificial networks to analyze the parameter in the objective function and to demonstrate the effectiveness and robustness of our approach. Next, we conduct experiments on seven real-world network datasets and compare RSECD with eight baseline methods in terms of both disjoint community and overlapping community evaluation metrics. Experimental results show that RSECD can significantly improve the performance in all comparis ons, which further illustrates our approach's robustness. And finally, in order to verify that RSECD is strong-explanatory to communities, we use a case study on a musical social network to semantically explain the hidden meanings of some topics and tell the 'true stories' behind communities.\n\n\nRelated work\n\nVarious community detection methods, which only take the network topology into account, have been proposed. For example, hierarchical clustering methods [3] which include agglomerative and divisive hierarchical algorithms. Optimal modularity approaches (such as spectrum optimization method [5]) can find communities by the use of modularity optimization. Another approach [4] applies modularity into graphs of different networks by correcting modularity, such as symbolized networks. By mapping a network into a Laplacian matrix and calculating its eigenvector values, spectral methods can find each node's corresponding community accurately.\n\nWith in-depth analysis and research of complex network, the content information of complex networks shows its value and some community detection methods, which integrate the content information with network topology, have been developed. For instance, a subgraph overlapping clustering algorithm combining network structure and content information is proposed [9]. This method applies expectation-maximizat io n (EM) algorithm to maximize likelihood function to generate stationary candidate subgraphs, and then uses k-means algorithm to cluster edges in order to obtain the overlapping community structure. A new generative probabilistic model is proposed which is learned by using a nested expectation-maximization algorithm and can describe the generalized communities [10]. In [11], a co-learning strategy is developed to jointly train the two parts (communities and semantics) in the model by combining a nested EM algorithm and belief propagation.\n\nRecently, researchers have also realized that community detection should not only find communities, but also use rich verbal information in the text to give semantic description of communities. The description information reveals why some nodes gather into a community and helps people better understand the functions or implications of communities. For example, the approach in [12] using nonnegative matrix factorization integrates two tasks of community detection and user profiling into a unified model, and then achieves community profiling by a linear operator integrating the profiles of users. A joint community profiling and detection (CPD) model [13] is proposed which describes communities by published content and friendship links of users. In addition, the method SCI [14], which can detect and describe communities, has also been proposed. This method uses nonnegative matrix factorization to integrate topology and content information into a unified model, and achieves relatively high detection accuracy in comparison with other methods. More importantly, SCI can not only detect communities, but also analyzes the semantics of detected communities. In general, th is type of method has more practical value than others without semantics .\n\nHowever, the methods mentioned above mainly focus on how to effectively fuse topology structure and content information to improve the performance of community detection while do not further consider how to detect communities more robustly, especially when the node contents do not match well with network communities. Moreover, most of these methods can only interpret each community using a single topic, which is far from satisfactory in many real applications.\n\n\nRSECD: The Network Model\n\nOur proposed RSECD approach extends the previous SCI approach by introducing a transition probability matrix with a suitable prior to represent the hidden relationship between network communities and content clusters. In this section, firstly, we illustrate the difference between traditional generative model and our proposed new generative mo del; then we give some notations . Finally, we elaborate how to model RSECD.\n\n\nTraditional Generative Model vs. New Generative Model\n\n(a) (b) Fig. 1. A comparison of traditional generative model and our proposed new model. (a) is the traditional generative model where community structure C directly generates network topology G and node contents N. (b) is RSECD's generative model where node contents N implicates topic cluster T (not community structure C) and topic cluster T is generated by community structure C and transition probability matrix X together. In addition, identity matrix I, as the transition matrix's prior, plays a key guiding role in fusing these two types of information.\n\nMost of community detection methods [9][10][11][12][13][14] follow traditional generative model which generally assumes that network topology and node contents share the same community structure (as shown in Fig. 1(a)). While in many real-world networks, network topology and node contents may implicate different community structures, so that we modify the traditional generative model and design a more reasonable generative model, as shown in Fig. 1(b). In this new model, node contents N implicates topic cluster T (not community structure C) and topic cluster T is generated by community structure C and transition probability matrix X together.\n\n\nNotations\n\nFor an undirected network G with n nodes and e edges, we represent it by a binaryvalued adjacency matrix AR   nn . Each node i has its attributes Si, which may be the semantic information of the node. Si is in the form of an m-dimensional binary-valued vector. All of Si form an attribute matrix SR nm   . The community detection task is: when A and S are observed, on topology, we need to find k different communities; on content cluster with semantics, we need to find k' different topics and infer the semantics for each community. Because all of the baseline algorithms assume that the number of communities is equal to that of topics, we still assume k = k' in this paper. However, our RSECD algorithm can also apply equally to k = k'.\n\n\n3.3\n\nModeling Network Topology Our network topology model is based on the following intuitive properties: 1) if two nodes belong to the same community, they are more likely to be connected; 2) if two nodes have similar community memberships, they have a high probability to be linked. We define the propensity of node i belonging to community c as uic. Then we have a community membership of all nodes denoted as U = (uic)nk. Based on the first propensity, we can use uicujc to represent the expected number of edges between nodes i and j in community c. Based on the second propensity, we can achieve that the expected number of edges between nodes i and j in the whole network is\n1   k\nic jc c uu . Considering all nodes, we have the following loss function:\nT2 F U0 min || A UU ||   (1)\n\nModeling Node Attributes\n\nWe define the propensity of topic t having attribute q as cqt and the propensity of node i belonging to topic t as vit. Then we have an attribute membership of all topics denoted as C = (cqt)m×k and a topic cluster membership of all nodes denoted as V = (vit)n×k. In addition, we define the propensity of a node i having attribute q as siq, which is an element of attribute matrix S. We suppose that if node i belongs to topic t, node i and topic t will have similar attributes information. It can be represented as\n1    k iq it tq t s v c .\nThen we have the following loss function:\nT2 F C 0,V 0 min || S VC ||   (2)\n\nModeling Transition Probabilities\n\nTransition probability is an important concept of Markov chain and is defined as the probability of transferring from one state to another. We introduce transition probabilities to represent the relationship between network communities and topic clusters. Here the probability transferring from community c to topic t is defined as xct, the probability vector transferring from community c to any topic is defined as xc (xc satisfies a probability distribution) and the probability matrix transferring from any community to any topic is defined as X. Moreover, to effectively guide the fusion of topology and content, we employ identity matrix I as the prior of X. Then we have the following loss function:\n2 T T 2 2 F F F X0 min || UX V || || X1 1 || || I X ||       kk (3) where T1 1R   k k\nand all of its elements are 1.\n\n\n3.6\n\nThe Unified Model By combining the objective functions of the above formulas (including (1) to (3)), we obtain RSECD's overall loss function:\nT 2 T 2 2 T T 2 2 F F F F F U 0,V 0, C 0,X 0 min || A UU || + || S VC || + || UX V || + || X1 1 || || I X ||          kk L α(4)\nwhere α is a balance parameter between network topology and node contents. Our RSECD model can deal with the topology and content's mismatch problem in networks well. To be specific, 1) when topology matches with content very well, the first two parts of unified model (network topology model and node attributes model) work so that topology and content can reinforce each other in order to find more exact community structure. 2) When only some parts of content match with network topology, RSECD can also extract useful material from content information to assist topology information in detecting more actual and accurate communities by the mapping and tractive function of transition matrix X. 3) When content does not match with topology at all, matrices U and V are almost orthogonal, thus matrix X is close to a random matrix and the final result is equal to that of using only topology information. In addition, the optimized X essentially represents the mapping relations hip between communities and topics, so that we can also use X to explain the detected communities. So our RSECD is robust and strong-explanatory to community detection. We will further use extensive experiments (including a case study) to demonstrate these cases.\n\n\nOptimization\n\nSince the objective function in (4) is not convex, it is hard to obtain the global optimal solution. Fortunately, the local minima of (4) can be obtained using the Majorization -Minimization framework [16]. Here we describe an algorithm that iteratively updates U with V, C, X fixed, updates V with U, C, X fixed, updates C with U, V, X fixed, and updates X with U, V, C fixed, which guarantees that our objective does not increase and the parameters keep nonnegative (with any nonnegative in itial seeds) after each iteration. The specific formulas are shown in the following subproblems.\n\n\nU-Iteration\n\nWhen updating U, we need to solve the following problem:\nT 2 2 F F U0 min (U) || A UU || || UX V ||      L(5)\nAn arbitrary matrix M satisfies 2T F || M || tr(MM )  , so we transform this problem as:\nT T T T T T T T T T T T (U) tr(A A A UU UU A UU UU ) tr(X U UX X U V V UX V V)         L (6)\nWe then take a derivative with respect to U and get the following formula:\nT T T (U) = 2(A + A)U 2(UX V)X 4UU U U       L(7)\nIn order to reduce computational cost, we use a multiplicative update algorithm based on the Oja's iterative learning rule [15] to update U. We decompose (7) into two sets: \nU (U)        L (8) where   (   ) is\nIn (7), the negative terms are 2A T U, 2AU, 2VX T and the positive terms are 2UXX T , 4UU T U. So we have the updating rule of U as:\nT T T T A U AU VX ( ) UXX 2UU U     ij ij ij u u(10)\n\nV-Iteration and C-Iteration\n\nWhen updating V, we need to solve the following problem:\nT 2 2 F F V0 min (V) || S VC || || UX V ||      L α(11)\nIn order to iterate V, we transform this problem into the following equation:\nT T T T T T T T T T T T (V) tr(S S S VC CV S CV VC ) tr(X U UX X U V V UX V V)          L α(12)\nWe then take a derivative with respect to V and get the next formula:\nT (V) 2 SC 2UX + 2 VC C + 2V V      L α α(13)\nSimilar to (10), we then obtain the updating rule of V as:\nT SC + UX ( ) VC C + V  ij ij ij α v v α(14)\nWhen updating C, similar to the steps from (11) to (14), we obtain the updating rule of C as:\nT T SV ( ) CV V  ij ij ij cc(15)\n\nX-Iteration\n\nWhen updating X, we need to solve the following problem:\n2 2 T T 2 F F F X0 min (X) || UX V || || I X || || X1 1 ||        k k L(16)\nTo iterate X, we can transform this problem into the following equation :   T T   T T  T  T   T  T  T T  T  T  T  T (X) = tr(X U UX X U V V UX + V V) +tr(1 X X1 1 X 1 1 X1 +1 1 ) + tr(I X X + X X)\n      k k k k k k k k L(17)\nWe then take a derivative with respect to X and get the next formula:\nT T (X) 2U V 2I 2M + 2U UX + 2X + 2X X M       L(18)\nwhere × MR  kk and its elements are all 1. In (21), the negative terms are 2U T V, 2I, 2M and positive terms are 2U T UX, 2XTM, 2X. So we obtain the updating rule of X:\nT T U V + I + ( ) U UX + X + X M M  ij ij ij xx(19)\n\nExperiments\n\nHere we first use artificial networks to analyze the influence of parameter α in the objective function and demonstrate that our approach can solve the mismatch problem well. We then compare our method with eight state-of-the-art algorithms on seven real datasets in terms of four well-known metrics. And finally, we discuss a case s tudy analysis to show that our method has a strong explanatory capability to communities.\n\n\nArtificial Networks\n\nWe use the Newman's model [2] to generate artificial benchmark networks. Each network has 128 nodes which have been divided into 4 communities. Each node has zin edges connecting to the nodes of the same community and zout edges connecting to the nodes of different communities (zin + zout = 16). In addition, all nodes are partitioned into 4 clusters corresponding to 4 communities. To be specific, for each node in the sth cluster, we use a binomial distribution with mean pin = hin/h to generate a h-dimensional binary vector as its ((s -1) × h + 1)-th to (s × h)-th attributes and use a binomial distribution with mean pout = hout/(3h) to generate its rest attributes. In our experiment, we set h = 50, zout = hout = 8 and use normalized mutual information (NMI) [19] as the metric. To simulate real-world networks' mismatch problem, we us e pmis (ranging fro m 0 to 1) to reveal the mismatch rate between network topology and node contents. For example, if pmis = 0.8, then in this network, there are 20 percent of nodes whose contents match with topology and 80 percent of nodes whose contents do not match with topology. In the first experiment, based on experience, we consider four choices for parameter α (α = 1,  Fig. 2(a), when pmis is less than 0.6 (this corresponds to most cases in real-world networks), the result under α = 2 F || A || is greater than the others, so we conclude that choosing α = 2 F || A || as the default value may be better than the other three choices.\n\nNext, to illustrate RSECD's robustness, we compare three methods -Topo, SCI and RSECD. Topo is a variant of RSECD using topology information alone. SCI is a NMFbased method using topology and content information together but did not consider the mismatch problem [14]. As shown in Fig. 2(b), Topo keeps a stable detection accuracy no matter how pmis changes because the topology information existing in the network is fixed. When pmis is less than 0.3, as SCI combines topology and content in formation together, it has higher accuracy than Topo. However, because SCI fails to solve the mismatch problem, when pmis is greater than 0.4, the performance of SCI gradually weakens and is worse than Topo. RSECD, as the extended work of SCI, has better performance than Topo and SCI when pmis is less than 0.7. Moreover, when pmis is larger than 0.7 (i.e., a high mismatch rate in the network), RSECD is just slightly worse than Topo but much better than SCI. In summary, the result demonstrates that: 1) when content match with topology well, RSCED can better combine topology and content to find communities; 2) when content does not match with topology, RSECD can also solve the mismatch problem well. Therefore, RSECD is robust. Finally, because the cluster structure implicated by content information may be indistinct in the real-world networks, we design a third experiment. In this part, we set pmis = 0 and relieve the constraint hout = 8, making hout vary from 0 to 12. The larger hout is, the higher distinct degree is. The final result is shown in Figure 2(c). As we can see, RSECD's accuracy is almost always higher than that of SCI. Even though when the cluster structure is very indistinct, RSECD's accuracy does not decline too much and is very close to that of Topo.\n(a) (b) (c)\n\n5.2\n\nReal-World Networks Datasets. We use 7 real networks [17,18] with node attributes and ground-truth community labels. These datasets are often used in the field of community detection by researchers and their detailed information is shown in Table 1. In this table, the number of attributes represents the total number of attributes in the network. \n\n\nMetrics.\n\nTo test RSECD's performance, we conduct a quantitative analysis of the final detection results using two types of metrics (disjoint community metrics and overlapping community metrics). For disjoint community metrics, we choose accuracy (AC) [19] and normalized mutual information (NMI) [19]. AC is used to measure the percentage of correct labels obtained. In clustering applications, NMI is used to measure how similar two sets of clusters are. For overlapping community metrics, we choose Fscore [20] and Jaccard similarity [20]. Both of them are common metrics which are used to quantify the performance in terms of the agreement between the ground -truth communities and the detected communities.\n\n\nBaselines.\n\nTo illustrate RSECD's effectiveness, we choose three types of baseline algorithms including two topology-based methods (DCSBM [21] and BigCLAM [22]), one content-based method (AP [23]), and five methods using both topology and content (CESNA [24], DCM [25], PCL-DC [26], Block-LDA [27] and SCI [14]).\n\n\nSetting.\n\nIn the experiments, first for each network we uniformly set α to be 2 F || A || based on previous parameter analysis. We then repeat RSECD algorithm 20 times with different random seeds. We obtain the result which corresponds to the smallest loss function value as the final result. Table 2. Performance comparison of different methods using disjoint community metrics. Here \"topo\", \"cont\", \"both\" denote methods using topology, contents, and topology -and-contents.  Results. We show the final results in Tables 2 and 3. It is worth noting that AP cannot compute accuracy (AC) value, and CESNA and DCM are only applicative to overlapping community metrics. In the tables, we use bold to mark the best results. Table 2 shows the comparison results in terms of AC and NMI. In AC, our method RSECD performs best among all the five methods. In NMI, RSECD still achieves the best results in comparison to the other methods. All the comparison results using different algorithms under overlapping community metrics are shown in Table 3. In these results, RSECD again has the best performance in comparison to the other tested approaches.\n\nIn summary, the main reasons that our algorithm achieves such superior performance are as follows: 1) RSECD assumes that topology and content do not share the same community structure, so that those harmful content information will not interfere with topology information's important role in community detection; 2) transition probability matrix, as a filter of content information, can retain beneficial content informatio n which can assist topology information in detecting more actual, accurate communities and remove harmful content information which has wrong guidance in community detection. Therefore, RSCED can solve the mismatch problem well and the final performance results are relatively high and s table in any case.\n\nEfficiency. As like standard nonnegative matrix factorization, the calculational complexity of RSECD is and e' the number of nonzero elements in the attribute matrix S (e'<<m). Thus, the computational complexity of RSECD is near linear with the number of nodes. We also report RSECD's running time. It needs 2.893s (here \"s\" denotes seconds), 8.9s, 8.233s , 10.952s, 14.041s, 6248.029s and 5760.169s, respectively, on the datas ets Facebook, Cornell, Texas, Washington, Wisconsin, Citeseer and Uai2010.\n\n\nA Case Study on Lastfm\n\nWe select LASTFM dataset 1 , which comes from a musical social network, as our dataset for the case study analysis. This dataset contains 1,892 users and the total number of attributes in the network is 11,946. These attributes reveal users' favorite songs or singers. LASTFM does not have the ground-truth of community labels . While, all the methods used in this work need the number of communities to be given. So, as did in [14], we use Louvain method [28] to set the number of communities in this network to 38. Two vivid examples to interpret the communities derived are shown in Figs. 3 and 4 in the form of word clouds. Word clouds can graphically show different attribute words' importance degree in one community in order to explain the current community's semantics. That is, in a word cloud, the size of a word is proportional to the probability that it belongs to this community.\n\nThe first example is the 30th community which contains two dominant topics, i.e., topics 1 and 32. Topic 1, as shown in Fig. 3(a), is highly related to electronic pop music. The total of \"electronic\", \"electropop\" and \"electronica\" has a high proportion in all attribute words and illustrates that the theme of topic 1 is pop electronic music. In addition, \"australian\", \"8-bit\", \"synth pop\", \"big beat\" and \"dark pop\" are different styles of pop electronic music. On the other hand, topic 32, as shown in Fig. 3(b), mainly denotes synth pop music. Synth pop music origins from \"new wave\", \"post -punk\" and is popular in \"80s\". \"new romantic\" is a synth pop song of Taylor Swift. \"depeche mode\" is a British band in style of alternative dance and synth pop. \"electroclash\" is another name of \"tech pop\" which contains the style of synth pop. \"synth\" and \"synth pop\" also appear here. It is worth noting that, these two topics which corresponds to electronic pop music of multiple styles and synth pop music, respectively, both belong to electronic pop music although being the different branches. Therefore, the 30th community will be a group of fans adoring electronic pop music mainly including synth pop music. Our second example is the 16th community which contains three dominant topics, i.e, topic 13, 24 and 36. They are shown in Fig. 4(a), (b) and (c), respectively. Similar to the previous analysis, we found out that topic 13 is related to opera music (for exa mple, \"diva\", \"female vocalist\" appear here); topic 24 is related to country music and pop music (for example, \"country\", \"pop\" appear here); and topic 36 is related to dance music (for example, \"dance\", \"disco\" appear here). Simultaneously, these three topics have the same theme, i.e., female singer. So, we can conclude that the 16th community's dominant topic is female singers and the three topics (topic 13,24,36) in this community all have their own accurate semantics, respectively. Specifically, topic 13, 24, 36 respectively reflects opera music, country music and dance music. \n\n\nConclusion\n\nIn this paper, we proposed a new community detection method (RSECD) which is able to detect communities and in the same time analyze the semantics of founded communities. We introduced a nonnegative matrix factorization model to depict the relationships between nodes, topics and communities more accurately. A transition probability matrix with a suitable prior was also introduced to show their hidden relationships to improve the robustness of the new model, especially when node contents do not match well with network topology. Through artificial benchmark networks, we analyzed the influence of parameter α in the objective function and demonstrated RSECD's high level of robustness. On real-world networks, we showed that RSECD outperforms all of the baseline methods. Finally, the case study analysis on a mus ical social network showed how the semantic explanation of communities derived by RSECD works. This helps people to understand and interpret communities more precisely and in a humanreadable form in many real applications .\n\n\nthe sum of all positive (negative) components, then we have:\n\nFig. 2 .\n2Results on artificial networks. (a) is the NM I results under 4 different choices of parameter α. (b) is 3 different methods' NM I results when the mismatch rate pmis varies from 0 to 1. (c) is 3 different methods' NM I results when hout varies from 0 to 12 under pmis=0.\n\n\nwhere T is the number of iterations, n the number of nodes, k the number of communities (k<<n) and m the number of attributes. By taking into account the sparsity of the adjacency matrix A and attribute matrix Sek e'k nk time where e is the number of edges (e<<n)\n\nFig. 3 .\n3Word clouds for the 30th community. (a) denotes topic 1 and (b) denotes topic 32, both of which are dominant topics of the 30th community.\n\nFig. 4 .\n4Word clouds for the 16th community. This community contains three dominant topics, in which (a) denotes topic 13, (b) denotes topic 24 and (c) denotes topic 36.\n\n\nNMI values under them. The results are shown in2 \nF \n\n|| \nA \n|| , \n\n2 \nF \n\n1/ \n|| \nS \n|| , or \n\n22 \nFF \n\n|| \nA \n|| \n/ \n|| \nS \n|| ) and respectively compute the average \n\n\nTable 1 .\n1Datasets used.Dataset \nCommunities \nNodes \nEdges \nAttributes Ground Truth \nFacebook \n14 \n226 \n3,417 \n131 \n√ \nCornell \n5 \n877 \n1,608 \n1,703 \n√ \nT exas \n5 \n877 \n1,608 \n1,703 \n√ \nWashington \n5 \n877 \n1,608 \n1,703 \n√ \nWisconsin \n5 \n877 \n1,608 \n1,703 \n√ \nCiteseer \n6 \n3,312 \n4,732 \n3,703 \n√ \nUai2010 \n19 \n3,363 \n45,006 \n4,972 \n√ \n\n\n\nTable 3 .\n3Performance comparison of different methods using overlapping community metrics.Metrics \n(%) \n\nMethods \nDatasets \nType \nName \nCornell Texas Washington Wisconsin Facebook Citeseer Uai2010 \n\nF-score \n\ntopo DCSBM \n34.08 36.14 \n32.83 \n29.47 \n44.92 \n26.83 \n30.12 \ntopo BigCLAM 13.23 20.64 \n13.35 \n12.84 \n47.40 \n9.30 \n16.99 \ncont \nAP \n21.10 23.59 \n24.11 \n20.53 \n23.60 \n12.92 \n13.23 \nboth \nCESNA \n23.48 23.54 \n21.91 \n23.17 \n52.51 \n3.38 \n32.32 \nboth \nDCM \n14.38 11.15 \n12.45 \n10.45 \n41.29 \n2.50 \n9.65 \nboth PCL-DC \n32.03 34.30 \n30.38 \n27.83 \n39.49 \n25.49 \n29.71 \nboth Block-LDA 36.77 32.55 \n28.95 \n31.36 \n39.57 \n22.49 \n18.58 \nboth \nSCI \n26.94 30.99 \n28.06 \n27.06 \n24.94 \n26.18 \n29.66 \nboth \nRSECD \n53.26 44.89 \n47.44 \n53.54 \n52.73 \n45.77 \n43.86 \n\nJaccard \n\ntopo DCSBM \n21.20 24.14 \n20.06 \n17.92 \n32.18 \n15.78 \n18.81 \ntopo BigCLAM 7.18 12.18 \n7.25 \n7.01 \n34.25 \n5.01 \n9.87 \ncont \nAP \n13.32 16.39 \n16.26 \n12.51 \n13.63 \n7.39 \n7.88 \nboth \nCESNA \n13.47 13.57 \n12.40 \n13.14 \n39.82 \n1.73 \n21.26 \nboth \nDCM \n7.95 6.03 \n6.72 \n5.54 \n33.60 \n1.27 \n5.77 \nboth PCL-DC \n19.02 21.56 \n18.99 \n16.27 \n26.99 \n14.75 \n19.17 \nboth Block-LDA 24.29 22.51 \n18.20 \n20.31 \n26.61 \n12.80 \n11.08 \nboth \nSCI \n17.10 21.98 \n18.72 \n17.15 \n15.65 \n15.26 \n19.11 \nboth \nRSECD \n37.12 33.32 \n34.04 \n41.47 \n41.67 \n31.49 \n32.39 \n\n\nhttp://ir.ii.uam.es/hetrec2011/datasets.html\n\nCommunity detection in networks: A user guide. S Fortunato, D Hric, Physics Reports. 659Fortunato, S., Hric, D.: Community detection in networks: A user guide. Physics Reports 659, 1-44 (2016).\n\nCommunity structure in social and biological networks. M Girvan, M Newman, Proceedings of the National Academy of Sciences. the National Academy of Sciences99Girvan, M., Newman, M.: Community structure in social and biological networks. Proceedings of the Na- tional Academy of Sciences 99(12), 7821-7826 (2002).\n\nDefining and identifying cograph communities in complex networks. S Jia, L Gao, Y Gao, New Journal of Physics. 17113044Jia, S., Gao, L., Gao, Y., et al.: Defining and identifying cograph communities in complex networks. New Journal of Physics 17(1), 013044 (2015).\n\nModularity based community detection with deep learning. L Yang, X Cao, D He, International Joint Conference on Artificial Intelligence (IJCAI). New York, USAYang, L., Cao, X., He, D., et al.: Modularity based community detection with deep learning. In: Interna- tional Joint Conference on Artificial Intelligence (IJCAI), pp. 2252-2258. New York, USA (2016).\n\nMagnetic eigenmaps for community detection in directed networks. M Fanuel, C M Alaiz, J A Suykens, Physical Review E. 95222302Fanuel, M., Alaiz, C. M., Suykens, J. A., et al.: Magnetic eigenmaps for community detection in directed networks. Physical Review E 95(2), 022302 (2017).\n\nK-clique community detection in social networks based on formal concept analysis. F Hao, G Min, Z Pei, IEEE Systems Journal. 111Hao, F., Min, G., Pei, Z., et al.: K-clique community detection in social networks based on formal concept analysis. IEEE Systems Journal 11(1), 250-259 (2017).\n\nOverlapping community detection using neighborhoodinflated seed expansion. J J Whang, D F Gleich, I S Dhillon, IEEE Transactions on Knowledge and Data Engineering. 285Whang, J. J., Gleich, D. F., Dhillon, I. S., et al.: Overlapping community detection using neighborhood- inflated seed expansion. IEEE Transactions on Knowledge and Data Engineering 28(5), 1272-1284 (2016).\n\nDetect overlapping communities via modeling and ranking node popularities. D Jin, H Wang, J Dang, 30th AAAI Conference on Artificial Intelligence. Phoenix, Arizona, USAJin, D., Wang, H., Dang, J., et al.: Detect overlapping communities via modeling and ranking node popu- larities. In: 30th AAAI Conference on Artificial Intelligence, pp. 172-178. Phoenix, Arizona, USA (2016).\n\nLocal network community detection with continuous optimization of conductance and weighted kernel k-means. T Van Laarhoven, E Marchiori, Journal of Machine Learning Research. 17147Van Laarhoven, T., Marchiori, E.: Local network community detection with continuous optimization of conductance and weighted kernel k-means. Journal of Machine Learning Research 17(147), 1-28 (2016).\n\nRobust detection of link communities in large social networks by exploiting link semantics. D Jin, X Wang, R He, 32th AAAI Conference on Artificial Intelligence. New Orleans, Louisiana, USAJin, D., Wang, X., He, R., et al.: Robust detection of link communities in large social networks by exploiting link semantics. In: 32th AAAI Conference on Artificial Intelligence, New Orleans, Louisiana, USA (2018).\n\nJoint identification of network communities and semantics via integrative modeling of network topologies and node contents. D He, Z Feng, D Jin, 31th AAAI Conference on Artificial Intelligence. San Francisco, California, USAHe, D., Feng, Z., Jin, D., et al.: Joint identification of network communities and semantics via integrative modeling of network topologies and node contents. In: 31th AAAI Conference on Artificial Intelligence, San Francisco, California, USA (2017).\n\nLeveraging behavioral factorization and prior knowledge for community discovery and profiling. M Akbari, T S Chua, Web Search and Data Mining (WSDM). UKAkbari, M., Chua, T. S.: Leveraging behavioral factorization and prior knowledge for community discovery and profiling. In: Web Search and Data Mining (WSDM), pp. 71-79. UK (2017).\n\nFrom community detection to community profiling. H Cai, V W Zheng, F Zhu, Proceedings of the Vldb Endowment. the Vldb Endowment10Cai, H., Zheng, V. W., Zhu, F. et al.: From community detection to community profiling. Proceedings of the Vldb Endowment 10(7), 817-828 (2017).\n\nSemantic community identification in large attribute networks. X Wang, D Jin, X Cao, 30th AAAI Conference on Artificial Intelligence. Phoenix, Arizona, USAWang, X., Jin, D., Cao, X., et al.: Semantic community identification in large attribute networks. In: 30th AAAI Conference on Artificial Intelligence, pp. 265-271. Phoenix, Arizona, USA (2016).\n\nPrincipal components, minor components, and linear neural networks. E Oja, Neural Networks. 56Oja, E.: Principal components, minor components, and linear neural networks. Neural Networks 5(6), 927 -935 (1992).\n\nA tutorial on mm algorithms. D R Hunter, K A Lange, The American Statistician. 581Hunter, D. R., Lange, K. A.: A tutorial on mm algorithms. The American Statistician 58(1), 30-37 (2004).\n\nCollective classification in network data. P Sen, G Namata, M Bilgic, AI Magazine. 293Sen, P., Namata, G., Bilgic, M., et al.: Collective classification in network data. AI Magazine 29(3), 93- 106 (2008).\n\nStanford Network Analysis Project. J Leskovec, Leskovec, J. 2016. Stanford Network Analysis Project. http://snap.stanford.edu.\n\nConstrained nonnegative matrix factorization for image representation. H Liu, Z Wu, X Li, IEEE T ransactions on Software Engineering. 347Liu, H., Wu, Z., Li, X., et al.: Constrained nonnegative matrix factorization for image representation. IEEE T ransactions on Software Engineering 34(7), 1299-1311 (2012).\n\nCommunity detection in networks with node attributes. J Yang, J Mcauley, J Leskovec, the IEEE International Conference on Data Mining series (ICDM). Dallas, Texas, USAYang, J., Mcauley, J., Leskovec, J., et al.: Community detection in networks with node attributes. In: the IEEE International Conference on Data Mining series (ICDM), pp. 1151-1156. Dallas, Texas, USA (2013).\n\nStochastic blockmodels and community structure in networks. B Karrer, M Newman, Phys. Rev. E. 83116107Karrer, B., Newman, M.: Stochastic blockmodels and community structure in networks. Phys. Rev. E 83(1), 016107 (2011).\n\nOverlapping community detection at scale: a nonnegative matrix factorization approach. J Yang, J Leskovec, Web Search and Data Mining (WSDM). Rome, ItalyYang, J., Leskovec, J.: Overlapping community detection at scale: a nonnegative matrix factorization ap- proach. In: Web Search and Data Mining (WSDM), pp. 587-596. Rome, Italy (2013).\n\nClustering by Passing Messages Between Data Points. B J Frey, D Dueck, Science. 3155814Frey, B. J., Dueck, D.: Clustering by Passing Messages Between Data Points. Science 315(5814), 972-976 (2007).\n\nCommunity detectionin networks with node attributes. J Yang, J Mcauley, J Leskovec, the IEEE International Conference on Data Mining series (ICDM). Dallas, Texas, USAYang, J., Mcauley, J., Leskovec, J., et al.: Community detectionin networks with node attributes. In: the IEEE International Conference on Data Mining series (ICDM), pp. 1151-1156. Dallas, Texas, USA (2013).\n\nDescription-driven community detection. S Pool, F Bonchi, M Van Leeuwen, ACM Transactions on Intelligent Systems and T echnology. 52Pool, S., Bonchi, F., Van Leeuwen, M., et al.: Description-driven community detection. ACM Transactions on Intelligent Systems and T echnology 5(2), 1-28 (2014).\n\nCombining link and content for community detection: a discriminative approach. T Yang, R Jin, Y Chi, 13th ACM SIGKDD Conference on Knowledge Discovery and Data Mining (KDD). Paris, FranceYang, T ., Jin, R., Chi, Y., et al.: Combining link and content for community detection: a discriminative approach. In: 13th ACM SIGKDD Conference on Knowledge Discovery and Data Mining (KDD), pp. 927- 936. Paris, France (2009).\n\nBlock-LDA: Jointly modeling entity-annotated text and entity-entity links. R Balasubramanyan, W W Cohen, SIAM International Conference on Data Mining (SDM). Mesa, Arizona, USABalasubramanyan, R., Cohen, W. W.: Block-LDA: Jointly modeling entity-annotated text and entity-entity links. In: SIAM International Conference on Data Mining (SDM), pp. 450-461. Mesa, Arizona, USA (2011).\n\nTopic modeling based on louvain method in online social networks. G S Kido, R A Igawa, S BarbonJr, Proc. of XII Brazilian Symposium on Information Systems. of XII Brazilian Symposium on Information SystemsSCFlorianó polisKido, G. S., Igawa, R. A., Barbon Jr, S.: Topic modeling based on louvain method in online social networks. In: Proc. of XII Brazilian Symposium on Information Systems, pp. 353-360. Florianó polis, SC (2016).\n", "annotations": {"author": "[{\"end\":190,\"start\":85},{\"end\":304,\"start\":191},{\"end\":420,\"start\":305},{\"end\":608,\"start\":421},{\"end\":809,\"start\":609}]", "publisher": null, "author_last_name": "[{\"end\":91,\"start\":88},{\"end\":201,\"start\":198},{\"end\":316,\"start\":314},{\"end\":434,\"start\":428},{\"end\":625,\"start\":619}]", "author_first_name": "[{\"end\":87,\"start\":85},{\"end\":197,\"start\":191},{\"end\":313,\"start\":305},{\"end\":427,\"start\":421},{\"end\":618,\"start\":609}]", "author_affiliation": "[{\"end\":189,\"start\":110},{\"end\":303,\"start\":224},{\"end\":419,\"start\":340},{\"end\":607,\"start\":461},{\"end\":808,\"start\":662}]", "title": "[{\"end\":82,\"start\":1},{\"end\":891,\"start\":810}]", "venue": null, "abstract": "[{\"end\":2387,\"start\":991}]", "bib_ref": "[{\"attributes\":{\"ref_id\":\"b0\"},\"end\":2624,\"start\":2621},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":2888,\"start\":2885},{\"attributes\":{\"ref_id\":\"b2\"},\"end\":3419,\"start\":3416},{\"attributes\":{\"ref_id\":\"b3\"},\"end\":3462,\"start\":3459},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":3491,\"start\":3488},{\"attributes\":{\"ref_id\":\"b5\"},\"end\":3724,\"start\":3721},{\"attributes\":{\"ref_id\":\"b6\"},\"end\":3773,\"start\":3770},{\"attributes\":{\"ref_id\":\"b7\"},\"end\":3817,\"start\":3814},{\"attributes\":{\"ref_id\":\"b8\"},\"end\":3943,\"start\":3940},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":3947,\"start\":3943},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":3951,\"start\":3947},{\"attributes\":{\"ref_id\":\"b11\"},\"end\":4554,\"start\":4550},{\"attributes\":{\"ref_id\":\"b12\"},\"end\":4557,\"start\":4554},{\"attributes\":{\"ref_id\":\"b11\"},\"end\":4778,\"start\":4774},{\"attributes\":{\"ref_id\":\"b12\"},\"end\":4782,\"start\":4778},{\"attributes\":{\"ref_id\":\"b13\"},\"end\":4786,\"start\":4782},{\"attributes\":{\"ref_id\":\"b2\"},\"end\":7339,\"start\":7336},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":7477,\"start\":7474},{\"attributes\":{\"ref_id\":\"b3\"},\"end\":7559,\"start\":7556},{\"attributes\":{\"ref_id\":\"b8\"},\"end\":8191,\"start\":8188},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":8604,\"start\":8600},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":8613,\"start\":8609},{\"attributes\":{\"ref_id\":\"b11\"},\"end\":9166,\"start\":9162},{\"attributes\":{\"ref_id\":\"b12\"},\"end\":9443,\"start\":9439},{\"attributes\":{\"ref_id\":\"b13\"},\"end\":9568,\"start\":9564},{\"attributes\":{\"ref_id\":\"b8\"},\"end\":11614,\"start\":11611},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":11618,\"start\":11614},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":11622,\"start\":11618},{\"attributes\":{\"ref_id\":\"b11\"},\"end\":11626,\"start\":11622},{\"attributes\":{\"ref_id\":\"b12\"},\"end\":11630,\"start\":11626},{\"attributes\":{\"ref_id\":\"b13\"},\"end\":11634,\"start\":11630},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":17054,\"start\":17050},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":18018,\"start\":18014},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":18906,\"start\":18902},{\"attributes\":{\"ref_id\":\"b20\"},\"end\":19552,\"start\":19548},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":20214,\"start\":20211},{\"attributes\":{\"ref_id\":\"b18\"},\"end\":20956,\"start\":20952},{\"attributes\":{\"ref_id\":\"b13\"},\"end\":21943,\"start\":21939},{\"attributes\":{\"ref_id\":\"b16\"},\"end\":23530,\"start\":23526},{\"attributes\":{\"ref_id\":\"b17\"},\"end\":23533,\"start\":23530},{\"attributes\":{\"ref_id\":\"b18\"},\"end\":24080,\"start\":24076},{\"attributes\":{\"ref_id\":\"b18\"},\"end\":24125,\"start\":24121},{\"attributes\":{\"ref_id\":\"b19\"},\"end\":24337,\"start\":24333},{\"attributes\":{\"ref_id\":\"b19\"},\"end\":24365,\"start\":24361},{\"attributes\":{\"ref_id\":\"b20\"},\"end\":24680,\"start\":24676},{\"attributes\":{\"ref_id\":\"b21\"},\"end\":24697,\"start\":24693},{\"attributes\":{\"ref_id\":\"b22\"},\"end\":24733,\"start\":24729},{\"attributes\":{\"ref_id\":\"b23\"},\"end\":24796,\"start\":24792},{\"attributes\":{\"ref_id\":\"b24\"},\"end\":24806,\"start\":24802},{\"attributes\":{\"ref_id\":\"b25\"},\"end\":24819,\"start\":24815},{\"attributes\":{\"ref_id\":\"b26\"},\"end\":24835,\"start\":24831},{\"attributes\":{\"ref_id\":\"b13\"},\"end\":24848,\"start\":24844},{\"attributes\":{\"ref_id\":\"b13\"},\"end\":27690,\"start\":27686},{\"attributes\":{\"ref_id\":\"b27\"},\"end\":27718,\"start\":27714},{\"attributes\":{\"ref_id\":\"b12\"},\"end\":30036,\"start\":30033},{\"attributes\":{\"ref_id\":\"b23\"},\"end\":30039,\"start\":30036},{\"end\":30042,\"start\":30039}]", "figure": "[{\"attributes\":{\"id\":\"fig_0\"},\"end\":31330,\"start\":31268},{\"attributes\":{\"id\":\"fig_1\"},\"end\":31613,\"start\":31331},{\"attributes\":{\"id\":\"fig_2\"},\"end\":31879,\"start\":31614},{\"attributes\":{\"id\":\"fig_3\"},\"end\":32029,\"start\":31880},{\"attributes\":{\"id\":\"fig_4\"},\"end\":32201,\"start\":32030},{\"attributes\":{\"id\":\"tab_0\",\"type\":\"table\"},\"end\":32373,\"start\":32202},{\"attributes\":{\"id\":\"tab_1\",\"type\":\"table\"},\"end\":32711,\"start\":32374},{\"attributes\":{\"id\":\"tab_3\",\"type\":\"table\"},\"end\":34003,\"start\":32712}]", "paragraph": "[{\"end\":5265,\"start\":2403},{\"end\":6415,\"start\":5267},{\"end\":7166,\"start\":6417},{\"end\":7826,\"start\":7183},{\"end\":8781,\"start\":7828},{\"end\":10038,\"start\":8783},{\"end\":10504,\"start\":10040},{\"end\":10954,\"start\":10533},{\"end\":11573,\"start\":11012},{\"end\":12225,\"start\":11575},{\"end\":12983,\"start\":12239},{\"end\":13668,\"start\":12991},{\"end\":13749,\"start\":13677},{\"end\":14323,\"start\":13808},{\"end\":14394,\"start\":14353},{\"end\":15174,\"start\":14468},{\"end\":15299,\"start\":15269},{\"end\":15448,\"start\":15307},{\"end\":16832,\"start\":15588},{\"end\":17438,\"start\":16849},{\"end\":17510,\"start\":17454},{\"end\":17658,\"start\":17569},{\"end\":17834,\"start\":17760},{\"end\":18064,\"start\":17891},{\"end\":18244,\"start\":18112},{\"end\":18388,\"start\":18332},{\"end\":18527,\"start\":18450},{\"end\":18702,\"start\":18633},{\"end\":18812,\"start\":18754},{\"end\":18952,\"start\":18859},{\"end\":19057,\"start\":19001},{\"end\":19337,\"start\":19141},{\"end\":19441,\"start\":19372},{\"end\":19670,\"start\":19501},{\"end\":20161,\"start\":19738},{\"end\":21674,\"start\":20185},{\"end\":23454,\"start\":21676},{\"end\":23821,\"start\":23473},{\"end\":24535,\"start\":23834},{\"end\":24850,\"start\":24550},{\"end\":25995,\"start\":24863},{\"end\":26727,\"start\":25997},{\"end\":27231,\"start\":26729},{\"end\":28150,\"start\":27258},{\"end\":30211,\"start\":28152},{\"end\":31267,\"start\":30226}]", "formula": "[{\"attributes\":{\"id\":\"formula_0\"},\"end\":13676,\"start\":13669},{\"attributes\":{\"id\":\"formula_1\"},\"end\":13780,\"start\":13750},{\"attributes\":{\"id\":\"formula_2\"},\"end\":14352,\"start\":14324},{\"attributes\":{\"id\":\"formula_3\"},\"end\":14431,\"start\":14395},{\"attributes\":{\"id\":\"formula_4\"},\"end\":15268,\"start\":15175},{\"attributes\":{\"id\":\"formula_5\"},\"end\":15587,\"start\":15449},{\"attributes\":{\"id\":\"formula_6\"},\"end\":17568,\"start\":17511},{\"attributes\":{\"id\":\"formula_7\"},\"end\":17759,\"start\":17659},{\"attributes\":{\"id\":\"formula_8\"},\"end\":17890,\"start\":17835},{\"attributes\":{\"id\":\"formula_9\"},\"end\":18111,\"start\":18065},{\"attributes\":{\"id\":\"formula_11\"},\"end\":18301,\"start\":18245},{\"attributes\":{\"id\":\"formula_12\"},\"end\":18449,\"start\":18389},{\"attributes\":{\"id\":\"formula_13\"},\"end\":18632,\"start\":18528},{\"attributes\":{\"id\":\"formula_14\"},\"end\":18753,\"start\":18703},{\"attributes\":{\"id\":\"formula_15\"},\"end\":18858,\"start\":18813},{\"attributes\":{\"id\":\"formula_16\"},\"end\":18986,\"start\":18953},{\"attributes\":{\"id\":\"formula_17\"},\"end\":19140,\"start\":19058},{\"attributes\":{\"id\":\"formula_18\"},\"end\":19371,\"start\":19338},{\"attributes\":{\"id\":\"formula_19\"},\"end\":19500,\"start\":19442},{\"attributes\":{\"id\":\"formula_20\"},\"end\":19723,\"start\":19671},{\"attributes\":{\"id\":\"formula_21\"},\"end\":23466,\"start\":23455}]", "table_ref": "[{\"end\":19256,\"start\":19213},{\"attributes\":{\"ref_id\":\"tab_1\"},\"end\":23721,\"start\":23714},{\"end\":25153,\"start\":25146},{\"attributes\":{\"ref_id\":\"tab_3\"},\"end\":25383,\"start\":25369},{\"end\":25581,\"start\":25574},{\"attributes\":{\"ref_id\":\"tab_3\"},\"end\":25893,\"start\":25886}]", "section_header": "[{\"attributes\":{\"n\":\"1\"},\"end\":2401,\"start\":2389},{\"end\":7181,\"start\":7169},{\"attributes\":{\"n\":\"3\"},\"end\":10531,\"start\":10507},{\"attributes\":{\"n\":\"3.1\"},\"end\":11010,\"start\":10957},{\"attributes\":{\"n\":\"3.2\"},\"end\":12237,\"start\":12228},{\"end\":12989,\"start\":12986},{\"attributes\":{\"n\":\"3.4\"},\"end\":13806,\"start\":13782},{\"attributes\":{\"n\":\"3.5\"},\"end\":14466,\"start\":14433},{\"end\":15305,\"start\":15302},{\"attributes\":{\"n\":\"4\"},\"end\":16847,\"start\":16835},{\"attributes\":{\"n\":\"4.1\"},\"end\":17452,\"start\":17441},{\"attributes\":{\"n\":\"4.2\"},\"end\":18330,\"start\":18303},{\"attributes\":{\"n\":\"4.3\"},\"end\":18999,\"start\":18988},{\"attributes\":{\"n\":\"5\"},\"end\":19736,\"start\":19725},{\"attributes\":{\"n\":\"5.1\"},\"end\":20183,\"start\":20164},{\"end\":23471,\"start\":23468},{\"end\":23832,\"start\":23824},{\"end\":24548,\"start\":24538},{\"end\":24861,\"start\":24853},{\"attributes\":{\"n\":\"5.3\"},\"end\":27256,\"start\":27234},{\"attributes\":{\"n\":\"6\"},\"end\":30224,\"start\":30214},{\"end\":31340,\"start\":31332},{\"end\":31889,\"start\":31881},{\"end\":32039,\"start\":32031},{\"end\":32384,\"start\":32375},{\"end\":32722,\"start\":32713}]", "table": "[{\"end\":32373,\"start\":32251},{\"end\":32711,\"start\":32400},{\"end\":34003,\"start\":32804}]", "figure_caption": "[{\"end\":31330,\"start\":31270},{\"end\":31613,\"start\":31342},{\"end\":31879,\"start\":31616},{\"end\":32029,\"start\":31891},{\"end\":32201,\"start\":32041},{\"end\":32251,\"start\":32204},{\"end\":32400,\"start\":32386},{\"end\":32804,\"start\":32724}]", "figure_ref": "[{\"end\":11026,\"start\":11020},{\"end\":11792,\"start\":11783},{\"end\":12030,\"start\":12021},{\"attributes\":{\"ref_id\":\"fig_1\"},\"end\":21418,\"start\":21409},{\"attributes\":{\"ref_id\":\"fig_1\"},\"end\":21966,\"start\":21957},{\"attributes\":{\"ref_id\":\"fig_1\"},\"end\":23239,\"start\":23231},{\"attributes\":{\"ref_id\":\"fig_3\"},\"end\":28281,\"start\":28272},{\"attributes\":{\"ref_id\":\"fig_3\"},\"end\":28667,\"start\":28658},{\"attributes\":{\"ref_id\":\"fig_4\"},\"end\":29503,\"start\":29489}]", "bib_author_first_name": "[{\"end\":34098,\"start\":34097},{\"end\":34111,\"start\":34110},{\"end\":34301,\"start\":34300},{\"end\":34311,\"start\":34310},{\"end\":34626,\"start\":34625},{\"end\":34633,\"start\":34632},{\"end\":34640,\"start\":34639},{\"end\":34883,\"start\":34882},{\"end\":34891,\"start\":34890},{\"end\":34898,\"start\":34897},{\"end\":35252,\"start\":35251},{\"end\":35262,\"start\":35261},{\"end\":35264,\"start\":35263},{\"end\":35273,\"start\":35272},{\"end\":35275,\"start\":35274},{\"end\":35551,\"start\":35550},{\"end\":35558,\"start\":35557},{\"end\":35565,\"start\":35564},{\"end\":35834,\"start\":35833},{\"end\":35836,\"start\":35835},{\"end\":35845,\"start\":35844},{\"end\":35847,\"start\":35846},{\"end\":35857,\"start\":35856},{\"end\":35859,\"start\":35858},{\"end\":36209,\"start\":36208},{\"end\":36216,\"start\":36215},{\"end\":36224,\"start\":36223},{\"end\":36620,\"start\":36619},{\"end\":36637,\"start\":36636},{\"end\":36986,\"start\":36985},{\"end\":36993,\"start\":36992},{\"end\":37001,\"start\":37000},{\"end\":37424,\"start\":37423},{\"end\":37430,\"start\":37429},{\"end\":37438,\"start\":37437},{\"end\":37871,\"start\":37870},{\"end\":37881,\"start\":37880},{\"end\":37883,\"start\":37882},{\"end\":38159,\"start\":38158},{\"end\":38166,\"start\":38165},{\"end\":38168,\"start\":38167},{\"end\":38177,\"start\":38176},{\"end\":38448,\"start\":38447},{\"end\":38456,\"start\":38455},{\"end\":38463,\"start\":38462},{\"end\":38804,\"start\":38803},{\"end\":38976,\"start\":38975},{\"end\":38978,\"start\":38977},{\"end\":38988,\"start\":38987},{\"end\":38990,\"start\":38989},{\"end\":39178,\"start\":39177},{\"end\":39185,\"start\":39184},{\"end\":39195,\"start\":39194},{\"end\":39376,\"start\":39375},{\"end\":39540,\"start\":39539},{\"end\":39547,\"start\":39546},{\"end\":39553,\"start\":39552},{\"end\":39833,\"start\":39832},{\"end\":39841,\"start\":39840},{\"end\":39852,\"start\":39851},{\"end\":40216,\"start\":40215},{\"end\":40226,\"start\":40225},{\"end\":40465,\"start\":40464},{\"end\":40473,\"start\":40472},{\"end\":40769,\"start\":40768},{\"end\":40771,\"start\":40770},{\"end\":40779,\"start\":40778},{\"end\":40969,\"start\":40968},{\"end\":40977,\"start\":40976},{\"end\":40988,\"start\":40987},{\"end\":41331,\"start\":41330},{\"end\":41339,\"start\":41338},{\"end\":41349,\"start\":41348},{\"end\":41665,\"start\":41664},{\"end\":41673,\"start\":41672},{\"end\":41680,\"start\":41679},{\"end\":42078,\"start\":42077},{\"end\":42097,\"start\":42096},{\"end\":42099,\"start\":42098},{\"end\":42451,\"start\":42450},{\"end\":42453,\"start\":42452},{\"end\":42461,\"start\":42460},{\"end\":42463,\"start\":42462},{\"end\":42472,\"start\":42471}]", "bib_author_last_name": "[{\"end\":34108,\"start\":34099},{\"end\":34116,\"start\":34112},{\"end\":34308,\"start\":34302},{\"end\":34318,\"start\":34312},{\"end\":34630,\"start\":34627},{\"end\":34637,\"start\":34634},{\"end\":34644,\"start\":34641},{\"end\":34888,\"start\":34884},{\"end\":34895,\"start\":34892},{\"end\":34901,\"start\":34899},{\"end\":35259,\"start\":35253},{\"end\":35270,\"start\":35265},{\"end\":35283,\"start\":35276},{\"end\":35555,\"start\":35552},{\"end\":35562,\"start\":35559},{\"end\":35569,\"start\":35566},{\"end\":35842,\"start\":35837},{\"end\":35854,\"start\":35848},{\"end\":35867,\"start\":35860},{\"end\":36213,\"start\":36210},{\"end\":36221,\"start\":36217},{\"end\":36229,\"start\":36225},{\"end\":36634,\"start\":36621},{\"end\":36647,\"start\":36638},{\"end\":36990,\"start\":36987},{\"end\":36998,\"start\":36994},{\"end\":37004,\"start\":37002},{\"end\":37427,\"start\":37425},{\"end\":37435,\"start\":37431},{\"end\":37442,\"start\":37439},{\"end\":37878,\"start\":37872},{\"end\":37888,\"start\":37884},{\"end\":38163,\"start\":38160},{\"end\":38174,\"start\":38169},{\"end\":38181,\"start\":38178},{\"end\":38453,\"start\":38449},{\"end\":38460,\"start\":38457},{\"end\":38467,\"start\":38464},{\"end\":38808,\"start\":38805},{\"end\":38985,\"start\":38979},{\"end\":38996,\"start\":38991},{\"end\":39182,\"start\":39179},{\"end\":39192,\"start\":39186},{\"end\":39202,\"start\":39196},{\"end\":39385,\"start\":39377},{\"end\":39544,\"start\":39541},{\"end\":39550,\"start\":39548},{\"end\":39556,\"start\":39554},{\"end\":39838,\"start\":39834},{\"end\":39849,\"start\":39842},{\"end\":39861,\"start\":39853},{\"end\":40223,\"start\":40217},{\"end\":40233,\"start\":40227},{\"end\":40470,\"start\":40466},{\"end\":40482,\"start\":40474},{\"end\":40776,\"start\":40772},{\"end\":40785,\"start\":40780},{\"end\":40974,\"start\":40970},{\"end\":40985,\"start\":40978},{\"end\":40997,\"start\":40989},{\"end\":41336,\"start\":41332},{\"end\":41346,\"start\":41340},{\"end\":41361,\"start\":41350},{\"end\":41670,\"start\":41666},{\"end\":41677,\"start\":41674},{\"end\":41684,\"start\":41681},{\"end\":42094,\"start\":42079},{\"end\":42105,\"start\":42100},{\"end\":42458,\"start\":42454},{\"end\":42469,\"start\":42464},{\"end\":42479,\"start\":42473}]", "bib_entry": "[{\"attributes\":{\"id\":\"b0\",\"matched_paper_id\":12845103},\"end\":34243,\"start\":34050},{\"attributes\":{\"id\":\"b1\",\"matched_paper_id\":2444655},\"end\":34557,\"start\":34245},{\"attributes\":{\"id\":\"b2\",\"matched_paper_id\":120351243},\"end\":34823,\"start\":34559},{\"attributes\":{\"id\":\"b3\",\"matched_paper_id\":13905814},\"end\":35184,\"start\":34825},{\"attributes\":{\"id\":\"b4\",\"matched_paper_id\":1307583},\"end\":35466,\"start\":35186},{\"attributes\":{\"id\":\"b5\",\"matched_paper_id\":5296416},\"end\":35756,\"start\":35468},{\"attributes\":{\"id\":\"b6\"},\"end\":36131,\"start\":35758},{\"attributes\":{\"id\":\"b7\"},\"end\":36510,\"start\":36133},{\"attributes\":{\"id\":\"b8\",\"matched_paper_id\":14113966},\"end\":36891,\"start\":36512},{\"attributes\":{\"id\":\"b9\",\"matched_paper_id\":19119861},\"end\":37297,\"start\":36893},{\"attributes\":{\"id\":\"b10\",\"matched_paper_id\":12246137},\"end\":37773,\"start\":37299},{\"attributes\":{\"id\":\"b11\",\"matched_paper_id\":10563975},\"end\":38107,\"start\":37775},{\"attributes\":{\"id\":\"b12\",\"matched_paper_id\":2392114},\"end\":38382,\"start\":38109},{\"attributes\":{\"id\":\"b13\",\"matched_paper_id\":29728567},\"end\":38733,\"start\":38384},{\"attributes\":{\"id\":\"b14\",\"matched_paper_id\":40000333},\"end\":38944,\"start\":38735},{\"attributes\":{\"id\":\"b15\",\"matched_paper_id\":228631},\"end\":39132,\"start\":38946},{\"attributes\":{\"id\":\"b16\",\"matched_paper_id\":62016134},\"end\":39338,\"start\":39134},{\"attributes\":{\"id\":\"b17\"},\"end\":39466,\"start\":39340},{\"attributes\":{\"id\":\"b18\",\"matched_paper_id\":17526484},\"end\":39776,\"start\":39468},{\"attributes\":{\"id\":\"b19\",\"matched_paper_id\":2760873},\"end\":40153,\"start\":39778},{\"attributes\":{\"id\":\"b20\",\"matched_paper_id\":9068097},\"end\":40375,\"start\":40155},{\"attributes\":{\"id\":\"b21\",\"matched_paper_id\":3348307},\"end\":40714,\"start\":40377},{\"attributes\":{\"id\":\"b22\",\"matched_paper_id\":6502291},\"end\":40913,\"start\":40716},{\"attributes\":{\"id\":\"b23\",\"matched_paper_id\":2760873},\"end\":41288,\"start\":40915},{\"attributes\":{\"id\":\"b24\",\"matched_paper_id\":15995433},\"end\":41583,\"start\":41290},{\"attributes\":{\"id\":\"b25\",\"matched_paper_id\":9615621},\"end\":42000,\"start\":41585},{\"attributes\":{\"id\":\"b26\",\"matched_paper_id\":1182621},\"end\":42382,\"start\":42002},{\"attributes\":{\"id\":\"b27\",\"matched_paper_id\":67479132},\"end\":42813,\"start\":42384}]", "bib_title": "[{\"end\":34095,\"start\":34050},{\"end\":34298,\"start\":34245},{\"end\":34623,\"start\":34559},{\"end\":34880,\"start\":34825},{\"end\":35249,\"start\":35186},{\"end\":35548,\"start\":35468},{\"end\":35831,\"start\":35758},{\"end\":36206,\"start\":36133},{\"end\":36617,\"start\":36512},{\"end\":36983,\"start\":36893},{\"end\":37421,\"start\":37299},{\"end\":37868,\"start\":37775},{\"end\":38156,\"start\":38109},{\"end\":38445,\"start\":38384},{\"end\":38801,\"start\":38735},{\"end\":38973,\"start\":38946},{\"end\":39175,\"start\":39134},{\"end\":39537,\"start\":39468},{\"end\":39830,\"start\":39778},{\"end\":40213,\"start\":40155},{\"end\":40462,\"start\":40377},{\"end\":40766,\"start\":40716},{\"end\":40966,\"start\":40915},{\"end\":41328,\"start\":41290},{\"end\":41662,\"start\":41585},{\"end\":42075,\"start\":42002},{\"end\":42448,\"start\":42384}]", "bib_author": "[{\"end\":34110,\"start\":34097},{\"end\":34118,\"start\":34110},{\"end\":34310,\"start\":34300},{\"end\":34320,\"start\":34310},{\"end\":34632,\"start\":34625},{\"end\":34639,\"start\":34632},{\"end\":34646,\"start\":34639},{\"end\":34890,\"start\":34882},{\"end\":34897,\"start\":34890},{\"end\":34903,\"start\":34897},{\"end\":35261,\"start\":35251},{\"end\":35272,\"start\":35261},{\"end\":35285,\"start\":35272},{\"end\":35557,\"start\":35550},{\"end\":35564,\"start\":35557},{\"end\":35571,\"start\":35564},{\"end\":35844,\"start\":35833},{\"end\":35856,\"start\":35844},{\"end\":35869,\"start\":35856},{\"end\":36215,\"start\":36208},{\"end\":36223,\"start\":36215},{\"end\":36231,\"start\":36223},{\"end\":36636,\"start\":36619},{\"end\":36649,\"start\":36636},{\"end\":36992,\"start\":36985},{\"end\":37000,\"start\":36992},{\"end\":37006,\"start\":37000},{\"end\":37429,\"start\":37423},{\"end\":37437,\"start\":37429},{\"end\":37444,\"start\":37437},{\"end\":37880,\"start\":37870},{\"end\":37890,\"start\":37880},{\"end\":38165,\"start\":38158},{\"end\":38176,\"start\":38165},{\"end\":38183,\"start\":38176},{\"end\":38455,\"start\":38447},{\"end\":38462,\"start\":38455},{\"end\":38469,\"start\":38462},{\"end\":38810,\"start\":38803},{\"end\":38987,\"start\":38975},{\"end\":38998,\"start\":38987},{\"end\":39184,\"start\":39177},{\"end\":39194,\"start\":39184},{\"end\":39204,\"start\":39194},{\"end\":39387,\"start\":39375},{\"end\":39546,\"start\":39539},{\"end\":39552,\"start\":39546},{\"end\":39558,\"start\":39552},{\"end\":39840,\"start\":39832},{\"end\":39851,\"start\":39840},{\"end\":39863,\"start\":39851},{\"end\":40225,\"start\":40215},{\"end\":40235,\"start\":40225},{\"end\":40472,\"start\":40464},{\"end\":40484,\"start\":40472},{\"end\":40778,\"start\":40768},{\"end\":40787,\"start\":40778},{\"end\":40976,\"start\":40968},{\"end\":40987,\"start\":40976},{\"end\":40999,\"start\":40987},{\"end\":41338,\"start\":41330},{\"end\":41348,\"start\":41338},{\"end\":41363,\"start\":41348},{\"end\":41672,\"start\":41664},{\"end\":41679,\"start\":41672},{\"end\":41686,\"start\":41679},{\"end\":42096,\"start\":42077},{\"end\":42107,\"start\":42096},{\"end\":42460,\"start\":42450},{\"end\":42471,\"start\":42460},{\"end\":42483,\"start\":42471}]", "bib_venue": "[{\"end\":34401,\"start\":34369},{\"end\":34983,\"start\":34970},{\"end\":36301,\"start\":36280},{\"end\":37082,\"start\":37055},{\"end\":37523,\"start\":37493},{\"end\":37927,\"start\":37925},{\"end\":38236,\"start\":38218},{\"end\":38539,\"start\":38518},{\"end\":39945,\"start\":39927},{\"end\":40530,\"start\":40519},{\"end\":41081,\"start\":41063},{\"end\":41772,\"start\":41759},{\"end\":42177,\"start\":42159},{\"end\":42591,\"start\":42540},{\"end\":34133,\"start\":34118},{\"end\":34367,\"start\":34320},{\"end\":34668,\"start\":34646},{\"end\":34968,\"start\":34903},{\"end\":35302,\"start\":35285},{\"end\":35591,\"start\":35571},{\"end\":35920,\"start\":35869},{\"end\":36278,\"start\":36231},{\"end\":36685,\"start\":36649},{\"end\":37053,\"start\":37006},{\"end\":37491,\"start\":37444},{\"end\":37923,\"start\":37890},{\"end\":38216,\"start\":38183},{\"end\":38516,\"start\":38469},{\"end\":38825,\"start\":38810},{\"end\":39023,\"start\":38998},{\"end\":39215,\"start\":39204},{\"end\":39373,\"start\":39340},{\"end\":39600,\"start\":39558},{\"end\":39925,\"start\":39863},{\"end\":40247,\"start\":40235},{\"end\":40517,\"start\":40484},{\"end\":40794,\"start\":40787},{\"end\":41061,\"start\":40999},{\"end\":41418,\"start\":41363},{\"end\":41757,\"start\":41686},{\"end\":42157,\"start\":42107},{\"end\":42538,\"start\":42483}]"}}}, "year": 2023, "month": 12, "day": 17}