{"id": 52012952, "updated": "2023-10-01 00:08:49.547", "metadata": {"title": "Learning Deep Representations with Probabilistic Knowledge Transfer", "authors": "[{\"first\":\"Nikolaos\",\"last\":\"Passalis\",\"middle\":[]},{\"first\":\"Anastasios\",\"last\":\"Tefas\",\"middle\":[]}]", "venue": "ECCV", "journal": "283-299", "publication_date": {"year": 2018, "month": 3, "day": 28}, "abstract": "Knowledge Transfer (KT) techniques tackle the problem of transferring the knowledge from a large and complex neural network into a smaller and faster one. However, existing KT methods are tailored towards classification tasks and they cannot be used efficiently for other representation learning tasks. In this paper a novel knowledge transfer technique, that is capable of training a student model that maintains the same amount of mutual information between the learned representation and a set of (possible unknown) labels as the teacher model, is proposed. Apart from outperforming existing KT techniques, the proposed method allows for overcoming several limitations of existing methods providing new insight into KT as well as novel KT applications, ranging from knowledge transfer from handcrafted feature extractors to {cross-modal} KT from the textual modality into the representation extracted from the visual modality of the data.", "fields_of_study": "[\"Computer Science\",\"Mathematics\"]", "external_ids": {"arxiv": "1803.10837", "mag": "2950712486", "acl": null, "pubmed": null, "pubmedcentral": null, "dblp": "conf/eccv/PassalisT18", "doi": "10.1007/978-3-030-01252-6_17"}}, "content": {"source": {"pdf_hash": "82c8dedbd58a8a8b7031dc49ce57553231fb3ca4", "pdf_src": "Arxiv", "pdf_uri": "[\"https://arxiv.org/pdf/1803.10837v3.pdf\"]", "oa_url_match": true, "oa_info": {"license": null, "open_access_url": "http://arxiv.org/pdf/1803.10837", "status": "GREEN"}}, "grobid": {"id": "7afc50cd859bd7cf20933df67e5ab432e8f6643a", "type": "plain-text", "url": "s3://ai2-s2-pdf-extraction-prod/parse-results/s2orc_worker/82c8dedbd58a8a8b7031dc49ce57553231fb3ca4.txt", "contents": "\nLearning Deep Representations with Probabilistic Knowledge Transfer\n\n\nNikolaos Passalis passalis@csd.auth.gr \nAristotle University of Thessaloniki\n541 24ThessalonikiGreece\n\nAnastasios Tefas tefas@aiia.csd.auth.gr \nAristotle University of Thessaloniki\n541 24ThessalonikiGreece\n\nLearning Deep Representations with Probabilistic Knowledge Transfer\n\nKnowledge Transfer (KT) techniques tackle the problem of transferring the knowledge from a large and complex neural network into a smaller and faster one. However, existing KT methods are tailored towards classification tasks and they cannot be used efficiently for other representation learning tasks. In this paper we propose a novel probabilistic knowledge transfer method that works by matching the probability distribution of the data in the feature space instead of their actual representation. Apart from outperforming existing KT techniques, the proposed method allows for overcoming several of their limitations providing new insight into KT as well as novel KT applications, ranging from KT from handcrafted feature extractors to cross-modal KT from the textual modality into the representation extracted from the visual modality of the data.\n\nIntroduction\n\nDeep Learning (DL) has been used to tackle many difficult problems [26], ranging from performing accurate object detection [36], to tackling challenging information retrieval problems [42], with great success. However, apart from developing more accurate models, the interest of the scientific community has also shifted into creating smaller and faster models that are able to run on devices with limited processing power, such as mobile phones, robots, embedded systems, etc. Several methods have been proposed to this end, including, but not limited to, model compression [20], and lightweight and more efficient neural network architectures [4,19,21,33].\n\nKnowledge Transfer (KT) techniques have also been proposed to further improve the performance of lightweight neural networks [17,38]. KT works by transferring the knowledge from a powerful and complex model, called teacher model, to a smaller and simpler one, called student model. Usually, the knowledge is transferred between the models by having the student model to regress the output (or a transformed version of the output) of the teacher model. KT techniques allow for learning student networks that are more accurate and generalize better since the output of the teacher model implicitly encodes more information about the similarity between the training samples and their distribution (which is usually ignored during the training when the hard binary labels of the training set are used). In that way, KT acts as a regularizer that improves the performance of the student model [44]. Note that KT methods are complementary to other techniques that allow for deploying smaller and faster networks, e.g., MobileNets that use depth-wise separable convolutions [19], or binarized networks [4], and they can be combined with them to further improve the accuracy of the models.\n\nEven though existing KT techniques have been used with great success, they suffer from significant limitations. First, they are usually unable to directly transfer the knowledge between layers of different architecture/dimensionality. The reason for this is that KT methods are currently tailored towards classification tasks, where they are used to transfer the knowledge between the output classification layer of the networks (which has fixed size regardless the actual architecture of the networks). However, this renders most KT methods inappropriate for representation learning tasks that are needed for applications other than classification, such as text and multimedia information retrieval [8,29], learning convolutional feature extractors for object detectors [36]/trackers [31], or interactive exploratory data analysis [14]. Note that there is a growing demand for learning such lightweight feature extractors, e.g., extracting privacy-preserving representations (the user's data remain on the mobile device protecting his/her privacy) [41], lowering the energy and communication costs between mobile devices and the cloud [5], etc. Furthermore, existing KT techniques mostly ignore the geometry of the teacher's feature space, e.g., manifolds that are formed, similarities between neighboring samples, etc., since they merely regress the output of the teacher network. However, it has been shown that exploiting such kind of information can significantly increase the quality of the learned model regardless the domain of the application [2].\n\nThe aforementioned observations led us to a number of interesting questions. a) Is it possible to use existing KT techniques for representation learning tasks instead of merely classification tasks? If this is indeed possible, how does existing KT techniques perform on these tasks? b) Is there any way to learn a student model that directly regresses the geometry of the teacher's feature space instead of its output? This could possibly allow to effectively unwrap the man-ifolds formed in the feature space of the teacher model into the student's lower dimensional feature space increasing the accuracy of the student model. c) Is it possible to transfer the knowledge from handcrafted features, e.g., SIFT [27], and HoG [10], into a neural network that can be then finetuned towards that task at hand? This could provide a way to exploit the large amount of the available unlabeled training samples and effectively use them in the process of training deep neural networks, overcoming a significant drawback of deep learning models, i.e., the enormous amount of labeled data that are needed for successfully training them. In that way, KT can also significantly boost DL on domains where there is knowledge on how to design good handcrafted representations, but large annotated collections of data do not exist yet, e.g., high-frequency trading analysis [23], predicting various properties of chemical compounds [30], etc. d) Finally, can the knowledge of networks which were trained to solve other tasks, such as object detection [36], be effectively transferred into other smaller networks? This can be especially important since most deep object detectors rely on pre-trained deep convolutional neural networks, while training them from scratch is difficult and usually negatively affects their accuracy [40]. Therefore, transferring the knowledge from a larger, pre-trained network into a smaller one can significantly increase the accuracy of lightweight object detectors.\n\nTo overcome the limitations of existing KT techniques a probabilistic method for knowledge transfer is proposed in this paper. First, the interactions between the data samples in the feature space are modeled as a probability distribution that expresses the affinity between the data samples. In that way, it is possible to perform KT by learning a student model that directly regresses the probability distribution of the teacher representation instead of the actual output of the network. As it is demonstrated in Section 3, this process is connected to an information-theoretic measure, the Mutual Information (MI) [9], and provides several advantages over existing KT techniques. First, it allows for directly transferring the knowledge even when the output dimensionality of the networks does not match. Furthermore, even when the output dimensionality of the networks matches, directly regressing their outputs might not be the most effective strategy since the teacher network is expected to be less powerful than the student network. Using a method that is able to relax this constraint, e.g., by allowing to slightly distort the feature space, is expected to better facilitate the knowledge transfer process. Finally, note that the probability distribution can be also estimated or enhanced using any other information source, such as neural network ensembles, handcrafted feature extractors, supervised information or even qualitative information from domain experts or users, increasing the flexibility of the proposed method and allowing for using several new KT scenarios.\n\nThe main contribution of this paper is the proposal of a Probabilistic KT (PKT) technique that overcomes several limitations of existing KT methods by matching the probability distribution of the data in the feature space instead of their actual representation, as shown in Figure 1. To the best of our knowledge the proposed technique is the first that is capable of a) performing cross-modal knowledge transfer, b) transferring the knowledge from handcrafted feature extractors into neural networks, c) transferring the knowledge regardless the task at hand (e.g., object detection), and d) incorporating domainknowledge into the knowledge transfer procedure, providing new insight into KT. The proposed method is motivated by the fact that matching the probability density function of the teacher and student models maintains the teacher's quadratic mutual information (QMI) [45], between the feature representation of the data samples and a set of (possible unknown) label annotations. Also, the proposed method is capable of recreating the (local) geometry of the teacher's feature space into the feature space of the student model. Indeed, the proposed method embeds the manifolds formed in teacher's feature space into the student's space (regardless of the dimensionality of these spaces). The proposed method is extensively evaluated and compared to other KT techniques using four different evaluation setups (KT from deep neural networks, handcrafted feature extractors, different modalities and object detectors). Also, it is demonstrated that is possible to perform cross-modal KT by transferring the knowledge from the textual modality into the representation extracted from the visual modality. An easy to use implementation of the proposed method is available at https://github.com/passalis/probabilistic_kt to allow for easily using and extending the proposed method.\n\nThe rest of the paper is structured as follows. The related work is presented and compared to the proposed approach in Section 2. Then, the proposed method is presented in detail in Section 3 and evaluated in Section 4. Finally, conclusions are drawn in Section 5.\n\n\nRelated Work\n\nThe growing complexity of deep neural networks and the need to deploy them into mobile and embedded devices with limited computing capabilities have fueled the research on knowledge transfer techniques that are able to effectively train smaller and faster models. The vast majority of the proposed KT methods use the teacher model to generate soft-labels, e.g., by raising the temperature of the softmax activation function on the output layer of the network, that are then used to train the student model [3,6,17,44,47].\n\nThe first attempt for knowledge transfer using soft-labels was presented in [3], while the neural network distillation method [17], extends this approach by appropriately tuning the temperature of the softmax activation function. It has been demonstrated that the neural network distillation method can be used to efficiently regularize the smaller network and achieve better generalization than directly training the network using the labels of the training set [8,17,19]. Furthermore, the generated soft-targets can be used for pre-training a larger network, as in [43], for domain adaptation in combination with sparsely labeled data, as in [47], or for \"compressing\" the posterior predictive density in Bayesian methods [1]. Also, in [6], the knowledge is transferred from a recurrent neural network (RNN) to a deep neural network using a similar approach. It is worth mentioning a quite opposite approach followed in [44], where the knowledge is transferred from a weaker teacher model to a more powerful student network. It was demonstrated that this allows for training the student network using fewer labeled data and it highlights the regularization nature of the distillation process.\n\nThe aforementioned methods use soft-labels to train the student network. A vastly different approach is followed in [7], where the weights of the teacher model are used to initialize the student model allowing for faster convergence. Furthermore, in [38], the student network is trained not only using the softtargets, but also using hints from the intermediate layers. Since the size of the student model is usually smaller, this is achieved by using a projection to match the dimensionality of the targets and the output of the student model. A similar approach is also followed in [50], where instead of using hints, the flow of solution procedure (FSP) matrix is used to transfer the knowledge between some of the intermediate layers of a residual network. However, in contrast to the hint-based transfer method, the FSP-based method requires the intermediate layers of the networks to have the same size and number of filters, rendering the method unsuitable for representation learning when the dimensionality of the layers between the two networks is different (which is expected to be the case when learning a smaller network).\n\nTo the best of our knowledge the method proposed in this paper is the first probabilistic KT method for representation learning that works by directly matching the probability distribution of the data between the teacher's and the student's feature spaces using an appropriately defined divergence metric. The proposed method is simple and straightforward, without requiring careful domain-specific tuning of any hyper-parameter, such as the softmax temperature [17]. As we experimentally demonstrate in Section 4, this allows for directly using the proposed method for a wide range of different KT scenarios. Furthermore, the proposed method is capable of directly transferring the knowledge between spaces of different dimensionality by modeling the interactions between the data samples and, thus, avoiding the need for lossy low dimensional projections [38]. Also, the proposed method requires no knowledge about the teacher model, except for the probability distribution induced by the representation of the data samples, significantly increasing its flexibility and allowing for novel KT scenarios, such as transferring the knowledge from handcrafted feature extractors. This is in contrast with other methods that require having access to the weights of the teacher network [7]. The probability distribution can be also enhanced using domain knowledge or supervised information providing a straightforward way to directly incorporate such information into the KT procedure. Finally, the proposed method can be also used for classification tasks, similarly to other methods that regularize the distillation process by transferring the knowledge between intermediate layers, such as [34,38,50].\n\n\nProbabilistic Knowledge Transfer\n\nLet T = {t 1 , t 2 , . . . , t N } denote a collection of N objects that are used to transfer the knowledge between two models. The set T is also called transfer set. Also, let x = f (t) denote the output representation of the teacher model and y = g(t, W) denote the output representation of the student model, where W denotes the parameters of the student model. During the process of knowledge transfer the parameters W of the model g(·) are learned to \"mimic\" the behavior of f (·). Note that there is no constraint on what the functions f (·) and g(·) are as long as the output of f (·) is known for every element of T and g(·) is a differentiable function. The distributions of the teacher and student networks are modeled using two continuous random variables X and Y respectively, where X describes the representation extracted from the teacher model and Y describes the representation extracted from the student model.\n\nModeling the pairwise interactions between data samples allows for describing the geometry of the corresponding feature spaces [18,28]. To this end, the joint probability density of any two data points in the feature space, which models the probability of two data point being close together, can be used. To this end, the divergence between the joint density probability estimations for the teacher model P and the student model Q can be minimized. These joint density probability functions can be trivially estimated using Kernel Density Estimation (KDE) [39] as:\np ij = p i|j p j = 1 N K(x i , x j ; 2σ 2 t ),(1)\nand\nq ij = q i|j q j = 1 N K(y i , y j ; 2σ 2 s ),(2)\nrespectively, where K(a, b; σ 2 t ) is a symmetric kernel with width σ t and a and b are two vectors. Note that class labels are not needed to minimize the divergence between these two distributions. Therefore, the proposed method can be used even when the class labels are unknown. Also note that minimizing the divergence between the probability distribution of the teacher model P and the probability distribution of the student model Q ensures that each transfer sample will have the same neighbors in both the student and teacher spaces as well as the relative distances between samples will be maintained. This, in turn, implies that the geometric relationships of the teacher's feature space are maintained in the lower dimensional feature space of the student.\n\nUsing the joint probability distribution to model the geometry of the data and perform knowledge transfer can overcome many of the drawbacks of traditional KT methods (as discussed in Section 2). However, learning a significantly smaller model that accurately recreates the whole geometry of a complex teacher model is often impossible. To overcome this issue, the joint probability density function can be replaced with the conditional probability distribution of the samples. Even in both cases the divergence between the probability distributions is minimized when the kernel similarities are equal for both models, using the conditional probability distribution allows for more accurately describing the local regions between the samples (the conditional probability distribution expresses the probability of each sample to select each of its neighbors [28]). The conditional probability distributions have been also used for the same reason in dimensionality reduction techniques that model data distributions in very high dimensions, such as the t-SNE algorithm [28]. The conditional probability distribution for the teacher model is defined as:\np i|j = K(x i , x j ; 2σ 2 t ) N k=1,k =j K(x k , x j ; 2σ 2 t ) ∈ [0, 1],(3)\nwhile for the student model as:\nq i|j = K(y i , y j ; 2σ 2 t ) N k=1,k =j K(y k , y j ; 2σ 2 s ) ∈ [0, 1].(4)\nThe conditional probabilities are bounded to [0, 1] and sum to 1, i.e., N i=0,i =j p i|j = 1 and N i=0,i =j q i|j = 1. Several choices exist to define the used kernel. Perhaps the most natural choice is the Gaussian kernel:\nK Gaussian (a, b; σ) = exp − ||a − b|| 2 2 σ ,(5)\nwhere ||·|| 2 denotes the l 2 norm of a vector and σ is the scaling factor (width) of the kernel. Using the Gaussian kernel leads to the regular Kernel Density Estimation (KDE) method for estimating the conditional probabilities [39]. However, to ensure that a meaningful probability estimation is obtained the width of the kernels must be carefully tuned. This is not a straightforward task, with several heuristics proposed to tackle this problem [46]. To avoid this issue and derive a method that requires little domain-dependent tuning, a cosine similarity-based affinity metric is used in this work. Therefore, the employed similarity metric is defined as:\nK cosine (a, b) = 1 2 ( a T b ||a|| 2 ||b|| 2 + 1) ∈ [0, 1].(6)\nApart of avoiding the need for calculating the bandwidth of the kernel, using the cosine similarity as kernel metric allows for more robust affinity estimations, since it has been demonstrated that the cosine measure usually leads to improved performance over Euclidean measures (especially in high dimensional spaces) [29,48]. Also, several choices exist for the divergence metric that must be used for training the student model. In this work, the well known Kullback-Leibler (KL) divergence is used to this end:\nKL(P||Q) = t P(t) log P(t) Q(t) dt,(7)\nwhere P and Q are the probability distributions of the teacher and student models respectively. Since a finite number of points are used to approximate the distribution P and Q, the loss function used for training the model is calculated as:\nL = N i=1 N j=1,i =j p j|i log p j|i q j|i .(8)\nNote that the KL divergence is not a symmetric distance metric, giving higher weight to minimizing the divergence for neighboring pairs of points instead of distant ones. That means that maintaining the geometry of local neighborhoods is more important, during the optimization process, than recreating the global geometry of the whole feature space of the teacher, providing greater flexibility during the training of the student model. If maintaining the whole geometry of the feature space is equally important, then alternative symmetric divergence metrics, such as the quadratic divergence measure D Q (P, Q) = x (P(t) − Q(t)) 2 dt, can be used. However, it should be noted that it is often infeasible to achieve this when training a student model with a significantly smaller number of parameters.\n\nTo learn the parameters of the student model g(t, W) gradient descent is used, i.e., ∆W = −η ∂L ∂W , where W is the matrix with the parameters of the student model. The derivative of the loss function with respect to the parameters of the model can be easily derived as\n∂L ∂W = N i=1 N j=1,i =j ∂L ∂q j|i N l=1 ∂q j|i ∂y l y l ∂W ,(9)\nwhere y l ∂W is just the derivative of the student's output with respect to its parameters. Instead of using the plain stochastic gradient descent, a recently proposed method for stochastic optimization, the Adam algorithm [24], that calculates adaptive learning rates for each parameter of the model, is used for all the experiments conducted in this paper. Furthermore, the conditional probabilities are estimated using only a small batch of the data (64-128 samples) at each iteration, since it is usually intractable to calculate the full kernel matrix for the whole dataset. This process can be viewed as a Nyström-like approximation of the full similarity matrix [11], and it was experimentally established that it speeds up the training process, while it does not negatively impact the learned representation. The transfer samples are shuffled between the training epochs to ensure that different samples are used for estimating the conditional probability distributions during each epoch.\n\n\nPKT and Mutual Information\n\nIn the following we provide a connection between the proposed method and maintaining the same amount of mutual information (MI) between the learned representation and a set of (possible unknown) labels as the teacher model. MI is a measure of dependence between random variables [9]. Let C be a discrete random variable that describes an attribute of the samples, e.g., their labels. For each feature vector x drawn from X there is an associated label c. The mutual information measures how much the uncertainty for the class label c is reduced after observing the feature vector x [45]. Let p(c) be the probability of observing the class label c. Also, let p(x, c) denote the probability density function of the corresponding joint distribution. Then, the mutual information for the teacher is defined as:\nI(X, C) = c x p(x, c) log p(x, c) p(x)P (c) dx(10)\nMI can be also expressed as the KL divergence between the joint probability density p(x, c) and the product of marginal probabilities p(x) and P (c). The Quadratic Mutual Information (QMI) is derived by replacing the KL divergence by a quadratic divergence measure, as proposed in [45]:\nI T (X, C) = c x (p(x, c) − p(x)P (c)) 2 dX.\nBy expanding this definition, we obtain:\nI T (X, C) = c x p(x, c) 2 dx+ c x (p(x)P (c)) 2 dx−2 c x p(x, c)p(x)P (c)dx,(11)\nwhere the following quantities, called information potentials of the teacher model, can be defined:\nV (t) IN = c x p(x, c) 2 dx, V (t) ALL = c x (p(x)P (c)) 2 dx, and V (t) BT W = c x p(x, c)p(x)P (c)dx.\nThus, QMI can be expressed in terms of these information potentials as:\nI T (X, C) = V (t) IN + V (t) ALL − 2V (t)\nBT W . Assuming that N C different (and possible unknown) classes exist and each class is composed of J p samples, the class prior probability for the c p class is calculated as P (c p ) = Jp N , where N is the total number of samples used to estimate the QMI. Also, Kernel Density Estimation [39], can be used to estimate the joint density probability as p(x, c p ) = 1 N Jp j=1 K(x, x pj ; σ 2 t ), where the notation x pj is used to refer to the j-th sample of the p-th class, as well as probability density of X as p(\nx) = Jp p=1 p(x, c p ) = 1 N N j=1 K(x, x j ; σ 2 t )\n. The information potentials for the teacher model are derived using these probabilities [45]:\nV (t) IN = 1 N 2 Nc p=1 Jp k=1 Jp l=1 K(x pk , x pl ; 2σ 2 t ),(12)V (t) ALL = 1 N 2 Nc p=1 ( J p N ) 2 N k=1 N l=1 K(x k , x l ; 2σ 2 t ),(13)\nand\nV (t) BT W = 1 N 2 Nc p=1 J p N Jp j=1 N k=1 K(x pj , x k ; 2σ 2 t ).(14)\nThe interaction between two samples i and j is measured using the kernel function K(x i , x j ; σ 2 ) that expresses the similarity between them. Also, note that all the information potentials are expressed in terms of interactions between all the pairs of the data (weighted by a different factor). The potential V IN expresses the in-class interactions, the potential V ALL the interactions between all the samples, while the potential V BT W the interaction of each class against all the other samples. Similarly, the information potentials can be calculated for the student network, e.g., V (s)\nIN = 1 N 2\n\nNc p=1\n\nJp k=1 Jp l=1 K(y pk , y pl ; 2σ 2 s ). Different (and appropriately tuned) widths σ t and σ s must be used for the teacher and the student model.\n\nIf QMI is to be transferred between the models, then this implies that the respective information potentials must be equal between the two models. To have equal information potentials between the two models the values provided by the kernel function for each pair of data samples must be equal, i.e., K(x i , x j ; 2σ 2 t ) = K(y i , y j ; 2σ 2 s ) ∀i, j, which in turn implies that the joint densities defined in (1) and (2) must be equal to each other.\n\n\nExperimental Evaluation\n\nKT from Deep Neural Networks: First, the proposed method was evaluated using the CIFAR10. The knowledge was transferred from the penultimate layer of a deep neural network, the ResNet-18 network [16], that has over 11 million parameters, to a significantly smaller student network with the following architecture: 3×3 convolution with 8 filters, 2×2 max pooling, 3×3 convolution with 16 filters, 2 × 2 max pooling, 3 × 3 convolution with 32 filters, 2 × 2 max pooling and a fully connected layer with 64 neurons. Batch normalization was used after each convolutional layer [22], and the ReLU activation function was used for all the layers. The student network is composed of approximately 15,000 trainable parameters, i.e., more than 700 times less than the teacher ResNet model. The teacher network was trained for classifying the images of the CIFAR10 dataset (after adding a final classification layer with the softmax activation function) for 100 epochs with a learning rate of 0.001 for the first 50 epochs and a learning rate of 0.0001 for the last 50 epochs. A baseline teacher model was also trained and evaluated using the same setup.\n\nThe experimental results are reported in Table 1. All the methods were evaluated in a content-based retrieval setup, where the database is composed of the representation extracted from training images using the student network g(·), while the test set is used to query the database and evaluate each method. To evaluate the quality of the learned representation the (interpolated) mean Average Precision (mAP) at the standard 11-recall points and the top-k precision (abbreviated as \"t-k\") were used [29]. The cosine similarity was used to measure the similarity between the query and the database objects for all the conducted experiments. The penultimate layers (64-dimensional for the student model g(·) and 512-dimensional for the teacher model f (·)) were used to extract the representation of the images and transfer the knowledge. The proposed method was compared to the hint-based knowledge transfer [38], abbreviated as \"Hint\", that supports directly transferring the knowledge between layers of different dimensionality (only the \"hint\" part of the method was used by employing random projections, since it is not possible to use the distillation approach between layers of different dimensionality). Note that neither the distillation approach [17], or the FSP transfer [50], can be employed when the dimensionality of the layers that are used for the knowledge transfer does not match [50]. To ensure a fair comparison between the evaluated KT methods, the baseline student network was used for initializing the network for all the methods and the optimization process ran for 20 epoch with batch size 128 and learning rate 0.0001. The pro- posed method was also compared to the plain distillation approach (abbreviated as \"Distill.\"), where the knowledge was transferred between the classification layers of the networks. However, it should be noted that this requires adding one extra classification layer to the student network and restricts the number of scenarios where the knowledge transfer can be used (since the knowledge must be transferred from a model that has been trained for classification tasks). Finally, the training data of the dataset were used as the transfer set (without using the supplied class labels).\n\nSeveral conclusions can be drawn from the results reported in Table 1. First, it is confirmed that the proposed PKT method can indeed lead to significantly better results than directly training the network with the available hard labels of the training set. The hint-based method is capable of transferring some knowledge between the layers, but since it is based on random projections its power is severely limited in this application. As a result, the hint-based transfer actually decreases the retrieval precision. This phenomenon can be better understood if the regularization nature of the hint-based approach is considered, i.e., the hints were intended to regularize distillation process instead of being used for directly transferring the knowledge [38]. On the other hand, the proposed PKT method is capable of efficiently transferring the knowledge, significantly improving the mAP (51.19%) over the rest of the evaluated methods (40.13% for the next best performing method). Furthermore, note that the distillation approach cannot be used when the networks are not trained for classification and the dimensionality of the layers used for the transfer does match, while the proposed method can effectively overcome these limitations, as further demonstrated in the following experiments.\n\nKT from Handcrafted Feature Extractors: Next, the proposed method was evaluated using the large-scale YouTube Faces dataset [49]. Before feeding each face image into the used networks it was resized to 64 × 64 pixels. An evaluation strategy, similar to those of celebrity face image retrieval tasks [15], is used. The persons that appear in more than 500 frames, i.e., 225 persons, are considered popular (celebrities). A total of 260,108 frames were extracted, where the 200,000 of them were used for training the method and building the database and 1,000 of them were used to query the database and evaluate the performance of the methods. The training/evaluation process was repeated five times and the mean and standard deviation of the evaluated metrics are reported.\n\nA completely different evaluation setup was used for this dataset. Instead of transferring the knowledge from a larger neural network, the knowledge was transferred from a handcrafted feature extractor to a small neural network that also reduces the size of the extracted representation. More specifically, the representation extracted using the CS-LBP descriptors was used to perform the KT [49]. The dimensionality of the CS-LBP descriptors is 480, while the last layer of the network used to perform the knowledge transfer has only 64 neurons. Note that the distillation approach cannot be used in this case since there is no common classification layer and the dimensionality of the extracted representation differs. The following architecture was used for the student network: 3 × 3 convolution with 16 filters, 3 × 3 convolution with 32 filters, 2 × 2 max pooling, 3 × 3 convolution with 64 filters, 3 × 3 convolution with 64 filters, 2 × 2 max pooling, 3 × 3 convolution with 64 filters and a fully connected layer with 64 neurons. Again, batch normalization was used after each convolutional layer and the ReLU activation function was used for all the layers. All the knowledge transfer models were trained for 10 epochs using learning rate 0.0001 and batch size 128.\n\nThe evaluation results are reported in Table 2. The baseline model (LBP features) achieves a mAP of 46.38%, while the hint-based transfer increases the mAP to 52.31%. The proposed PKT again outperforms both the baseline and hint-based methods (54.84% mAP). Note that it is generally not expected the student models to achieve higher precision than the teacher model (the handcrafted feature extractor in our case). This behavior can be attributed to the completely different nature of the teacher model (convolutional neural network instead of a handcrafted feature extractor) in combination with the smaller dimensionality of the extracted representation that effectively regularize the learned representation.\n\nTransferring the knowledge from a handcrafted feature extractor into a neural network also allows for finetuning the learned representation using supervised information (or any other kind of domain-specific knowledge). The proposed PKT method readily supports augmenting the transfer procedure with supervised information by simply constructing an appropriate probability distribution function. The most straightforward way to do so it to set p i|j = 1 when the i-th and the j-th sample belong to the same class and p i|j = 0 in any other case. This supervised probability distribution function can be combined with the probability distribution extracted from the representation of the teacher model or used standalone as a separate term in the loss function (by adding another divergence loss in Eq. (8)). The latter choice is followed in the proposed Supervised PKT (abbreviated as \"S-PKT\") with the supervised divergence weighted by 0.001. As it is demonstrated in Table 2 the S-PKT significantly increases the evaluated metrics over the unsupervised methods.\n\nCross-modal KT: The proposed method was also evaluated on the SUN Attribute dataset [35], using an evaluation setup similar to this used for the Youtube Faces dataset, i.e., the knowledge is transferred from a handcrafted feature extractor (2 × 2 HoG features [10,35]). The SUN Attribute dataset is a large-scale scene attribute dataset that contains more than 700 categories of scenes and 14,000 images. Each image is also described by 102 discriminative textual attributes that were created by performing crowd-sourced human studies. The confidence for each textual attribute is provided. The multi-modal nature of the dataset makes it very appropriate for evaluating cross-modal and multimodal techniques [32]. The SUN Attribute dataset was also used in this paper to evaluate the performance of cross-modal KT. Since a very small number of images exist for some categories, only images from the eight most common categories (for which at least 40 images exist) were used for training and evaluating the methods. Each image was resized in 128 × 128 pixels. The 80% of the extracted images was used for training the networks and building the database, while the rest 20% was used to query the database. The evaluation process was repeated 5 times and the mean and standard deviation of the evaluated metrics are reported. The teacher network is also similar to the network used for the Youtube Faces dataset and it is composed of the following layers: 3 × 3 convolution with 16 filters, 2 × 2 max pooling, 3 × 3 convolution with 32 filters, 2 × 2 max pooling, 3 × 3 convolution with 64 filters, 3 × 3 convolution with 64 filters, 2 × 2 max pooling, 3 × 3 convolution with 64 filters and a fully connected layer with 64 neurons. All the knowledge transfer models were trained for 100 epochs using learning rate 0.0001 and batch size 128.\n\nThe evaluation results are reported in Table 3. First, the knowledge is transferred from 2 × 2 HoG features [10,35] into the student network. Using the proposed PKT method leads to 26.84% mAP outperforming the hint-based transfer (16.40% mAP). As it was expected the student network performs slightly worse than the teacher model (HoG). This can be also attributed to the smaller representation extracted from the student network (64 dimensions instead of 300 dimensions for the HoG features).\n\nThe proposed method was also evaluated under a cross-modal KT setup where the knowledge is transferred from the textual modality (expressed in the form of a list of textual attributes) into the student neural network that operates within the visual modality. This setup is abbreviated as \"attr\" in Table 3. Transferring the knowledge from the textual modality improves the precision of the student network for both the hint-based KT method and the proposed PKT approach. Again, the proposed PKT method significantly outperforms the hint-based method leading to over 80% relative increase of the mAP.\n\nKT from Object Detectors: Finally, the proposed method was evaluated on the PASCAL VOC 2007 and the PASCAL VOC 2012 datasets [12,13], following the experimental setup described in [36]. The Darknet framework was used for training and evaluating the object detectors [37] using the default parameters. The YOLO object detector is usually trained after initializing its convolutional layers using another network trained for solving a classification problem on the ImageNet dataset [25]. However, with the increasing need for more lightweight architectures this is not always possible, since usually pre-trained models exist only for a few architectures and it can be very tedious to successfully retrain every new model using such datasets [40]. The proposed PKT method can address this problem by directly transferring the knowledge from the 29-th layer (1280 filters) of the larger YOLOv2 model to the 13th layer of a smaller teacher model (a modified Tiny YOLO model with 512 filters instead of 1024 filters in its 13th layer). The proposed knowledge transfer method ran for 50 epochs with batch size 8 (due to memory constraints) and learning rate 10 −4 .\n\nThe following networks were evaluated in the conducted experiments: a) a randomly initialized network (abbreviated as \"Random\"), b) a network initialized using the first 11 matching layers of the Darknet reference model trained on the ImageNet dataset (abbreviated as \"Darknet\") [37], and c) the network trained using the proposed KT method (abbreviated as \"PKT\"). The networks were trained for 40,000 iterations with batch size 64 and the results are reported in Table 4. First, the importance of using a knowledge transfer technique (either direct or indirect) is highlighted. Using a randomly initialized network we were unable to train a useful object detector (mAP < 19%), even though aggressive data augmentation techniques were used. This is expected, since it is well established that training deep object detectors from scratch it is not straightforward [40]. On the other hand, both directly using the weights of a network trained on another task and transferring the knowledge from another detector yield significantly better results. The proposed method also outperforms all the other evaluated methods leading to better object detection precision (44.14% mAP) demonstrating its ability to efficiently transfer the knowledge from an object detector into another one. Note that in contrast to the baseline (\"Darknet\") method, the proposed method is able to directly transfer the knowledge from a more powerful model that was trained for the task at hand (object detection) instead of using a smaller network that has been trained to extract representations for another task (classification). This can also significantly reduce the training time, since only the \"useful\" knowledge for the task at hand is transferred, instead of learning a generic object classifier using a huge dataset.\n\n\nConclusions\n\nIn this paper a Probabilistic KT technique that overcomes several limitations of existing KT methods by matching the probability distribution of the data in the feature space instead of their actual representation was proposed. The proposed method was extensively evaluated and it was demonstrated that outperforms several other KT techniques using different evaluation setups (KT from deep neural networks, handcrafted feature extractors, and different modalities).\n\nFig. 1 .\n1Probabilistic Knowledge Transfer: The knowledge of the teacher model is modeled using a probability distribution. Then, the knowledge is transferred by minimizing the divergence between the probability distribution of the teacher and the student.\n\nTable 1 .\n1CIFAR10 EvaluationModel mAP t-10 t-20 t-50 t-100 \nStudent 38.96 68.30 65.35 61.89 59.17 \nTeacher 91.39 93.34 93.19 92.28 92.81 \nDistill. 40.13 68.81 65.95 62.55 59.93 \nHint \n21.40 33.20 30.10 27.16 24.89 \nPKT \n51.19 69.41 67.38 65.10 63.39 \n\nTable 2. YouTube Faces Evaluation \n\nModel \nmAP \nt-20 t-50 t-200 \nLBP \n46.38 ± 0.88 98.78 95.66 81.02 \nHint \n52.31 ± 1.31 98.23 96.37 86.10 \nPKT 54.84 ± 0.76 99.85 98.95 88.71 \nS-PKT 70.11 ± 0.95 99.88 99.31 91.50 \n\n\n\nTable 3 .Table 4 .\n34SUN Attribute Evaluation HoG) 16.40 ± 0.58 19.04 ± 1.07 16.85 ± 0.86 PKT (HoG) 26.84 ± 1.74 34.98 ± 2.42 28.96 ± 1.98 Hint (attr) 26.08 ± 3.53 31.25 ± 4.38 27.11 ± 3.94 PKT (attr) 47.26 ± 3.20 54.94 ± 4.18 48.72 ± 4.20 VOC2007 Evaluation (object detection)Model \nmAP \nt-20 \nt-50 \nHoG \n32.06 ± 1.20 42.65 ± 2.00 34.13 ± 1.64 \nHint (Initial Model mAP \nRandom \n18.39 \nDarknet \n38.02 \nPKT \n44.14 \n\n\n\nBayesian dark knowledge. A K Balan, V Rathod, K P Murphy, M Welling, Proceedings of the Advances in Neural Information Processing Systems. the Advances in Neural Information Processing SystemsBalan, A.K., Rathod, V., Murphy, K.P., Welling, M.: Bayesian dark knowledge. In: Proceedings of the Advances in Neural Information Processing Systems. pp. 3438-3446 (2015)\n\nManifold regularization: A geometric framework for learning from labeled and unlabeled examples. M Belkin, P Niyogi, V Sindhwani, Journal of Machine Learning Research. 7Belkin, M., Niyogi, P., Sindhwani, V.: Manifold regularization: A geometric frame- work for learning from labeled and unlabeled examples. Journal of Machine Learn- ing Research 7(Nov), 2399-2434 (2006)\n\nModel compression. C Bucilu, R Caruana, A Niculescu-Mizil, Proceedings of the ACM SIGKDD International Conference on Knowledge Discovery and Data mining. the ACM SIGKDD International Conference on Knowledge Discovery and Data miningBucilu, C., Caruana, R., Niculescu-Mizil, A.: Model compression. In: Proceedings of the ACM SIGKDD International Conference on Knowledge Discovery and Data mining. pp. 535-541 (2006)\n\nBinarized convolutional landmark localizers for human pose estimation and face alignment with limited resources. A Bulat, G Tzimiropoulos, Proceedings of the IEEE International Conference on Computer Vision. the IEEE International Conference on Computer VisionBulat, A., Tzimiropoulos, G.: Binarized convolutional landmark localizers for hu- man pose estimation and face alignment with limited resources. In: Proceedings of the IEEE International Conference on Computer Vision (Oct 2017)\n\nSpiking deep convolutional neural networks for energy-efficient object recognition. Y Cao, Y Chen, D Khosla, International Journal of Computer Vision. 1131Cao, Y., Chen, Y., Khosla, D.: Spiking deep convolutional neural networks for energy-efficient object recognition. International Journal of Computer Vision 113(1), 54-66 (2015)\n\nTransferring knowledge from a RNN to a DNN. W Chan, N R Ke, I Lane, arXiv:1504.01483arXiv preprintChan, W., Ke, N.R., Lane, I.: Transferring knowledge from a RNN to a DNN. arXiv preprint arXiv:1504.01483 (2015)\n\nT Chen, I Goodfellow, J Shlens, arXiv:1511.05641Net2net: Accelerating learning via knowledge transfer. arXiv preprintChen, T., Goodfellow, I., Shlens, J.: Net2net: Accelerating learning via knowledge transfer. arXiv preprint arXiv:1511.05641 (2015)\n\nSocial media image retrieval using distilled convolutional neural network for suspicious e-crime and terrorist account detection. P Chitrakar, C Zhang, G Warner, X Liao, Proceedings of the IEEE International Symposium on Multimedia. the IEEE International Symposium on MultimediaChitrakar, P., Zhang, C., Warner, G., Liao, X.: Social media image retrieval using distilled convolutional neural network for suspicious e-crime and terrorist account detection. In: Proceedings of the IEEE International Symposium on Multimedia. pp. 493-498 (2016)\n\nElements of information theory. T M Cover, J A Thomas, John Wiley & SonsCover, T.M., Thomas, J.A.: Elements of information theory. John Wiley & Sons (2012)\n\nHistograms of oriented gradients for human detection. N Dalal, B Triggs, Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. the IEEE Conference on Computer Vision and Pattern Recognition1Dalal, N., Triggs, B.: Histograms of oriented gradients for human detection. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. vol. 1, pp. 886-893 (2005)\n\nOn the nyström method for approximating a gram matrix for improved kernel-based learning. P Drineas, M W Mahoney, Journal of Machine Learning Research. 6Drineas, P., Mahoney, M.W.: On the nyström method for approximating a gram matrix for improved kernel-based learning. Journal of Machine Learning Research 6(Dec), 2153-2175 (2005)\n\nM Everingham, L Van Gool, C K I Williams, J Winn, A Zisserman, The PASCAL Visual Object Classes Challenge 2007 (VOC2007) Results. Everingham, M., Van Gool, L., Williams, C.K.I., Winn, J., Zisserman, A.: The PASCAL Visual Object Classes Challenge 2007 (VOC2007) Results.\n\nM Everingham, L Van Gool, C K I Williams, J Winn, A Zisserman, The PASCAL Visual Object Classes Challenge 2012 (VOC2012) Results. Everingham, M., Van Gool, L., Williams, C.K.I., Winn, J., Zisserman, A.: The PASCAL Visual Object Classes Challenge 2012 (VOC2012) Results.\n\nInteractions with big data analytics. D Fisher, R Deline, M Czerwinski, S Drucker, ACM Interactions. 193Fisher, D., DeLine, R., Czerwinski, M., Drucker, S.: Interactions with big data analytics. ACM Interactions 19(3), 50-59 (2012)\n\nMS-CELEB-1M: A dataset and benchmark for large-scale face recognition. Y Guo, L Zhang, Y Hu, X He, J Gao, Proceedings of the European Conference on Computer Vision. the European Conference on Computer VisionGuo, Y., Zhang, L., Hu, Y., He, X., Gao, J.: MS-CELEB-1M: A dataset and bench- mark for large-scale face recognition. In: Proceedings of the European Conference on Computer Vision. pp. 87-102 (2016)\n\nDeep residual learning for image recognition. K He, X Zhang, S Ren, J Sun, Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. the IEEE Conference on Computer Vision and Pattern RecognitionHe, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. pp. 770-778 (2016)\n\nDistilling the knowledge in a neural network. G Hinton, O Vinyals, J Dean, Neural Information Processing System Deep Learning Workshop. Hinton, G., Vinyals, O., Dean, J.: Distilling the knowledge in a neural network. In: Neural Information Processing System Deep Learning Workshop (2015)\n\nStochastic neighbor embedding. G E Hinton, S T Roweis, Proceedings of the Advances in Neural Information Processing Systems. the Advances in Neural Information Processing SystemsHinton, G.E., Roweis, S.T.: Stochastic neighbor embedding. In: Proceedings of the Advances in Neural Information Processing Systems. pp. 857-864 (2003)\n\nA G Howard, M Zhu, B Chen, D Kalenichenko, W Wang, T Weyand, M Andreetto, H Adam, arXiv:1704.04861Mobilenets: Efficient convolutional neural networks for mobile vision applications. arXiv preprintHoward, A.G., Zhu, M., Chen, B., Kalenichenko, D., Wang, W., Weyand, T., An- dreetto, M., Adam, H.: Mobilenets: Efficient convolutional neural networks for mobile vision applications. arXiv preprint arXiv:1704.04861 (2017)\n\nBinarized neural networks. I Hubara, M Courbariaux, D Soudry, R El-Yaniv, Y Bengio, Proceedings of the Advances in Neural Information Processing Systems. the Advances in Neural Information Processing SystemsHubara, I., Courbariaux, M., Soudry, D., El-Yaniv, R., Bengio, Y.: Binarized neu- ral networks. In: Proceedings of the Advances in Neural Information Processing Systems. pp. 4107-4115 (2016)\n\nF N Iandola, S Han, M W Moskewicz, K Ashraf, W J Dally, K Keutzer, arXiv:1602.07360Squeezenet: Alexnet-level accuracy with 50x fewer parameters and < 0.5 MB model size. arXiv preprintIandola, F.N., Han, S., Moskewicz, M.W., Ashraf, K., Dally, W.J., Keutzer, K.: Squeezenet: Alexnet-level accuracy with 50x fewer parameters and < 0.5 MB model size. arXiv preprint arXiv:1602.07360 (2016)\n\nBatch normalization: Accelerating deep network training by reducing internal covariate shift. S Ioffe, C Szegedy, Proceedings of the International Conference on Machine Learning. the International Conference on Machine LearningIoffe, S., Szegedy, C.: Batch normalization: Accelerating deep network training by reducing internal covariate shift. In: Proceedings of the International Conference on Machine Learning. pp. 448-456 (2015)\n\nModelling high-frequency limit order book dynamics with support vector machines. A N Kercheval, Y Zhang, Quantitative Finance. 158Kercheval, A.N., Zhang, Y.: Modelling high-frequency limit order book dynamics with support vector machines. Quantitative Finance 15(8), 1315-1329 (2015)\n\nAdam: A method for stochastic optimization. D Kingma, J Ba, arXiv:1412.6980arXiv preprintKingma, D., Ba, J.: Adam: A method for stochastic optimization. arXiv preprint arXiv:1412.6980 (2014)\n\nImagenet classification with deep convolutional neural networks. A Krizhevsky, I Sutskever, G E Hinton, Proceedings of the Advances in neural information processing systems. the Advances in neural information processing systemsKrizhevsky, A., Sutskever, I., Hinton, G.E.: Imagenet classification with deep con- volutional neural networks. In: Proceedings of the Advances in neural information processing systems. pp. 1097-1105 (2012)\n\nDeep learning. Y Lecun, Y Bengio, G Hinton, Nature. 5217553LeCun, Y., Bengio, Y., Hinton, G.: Deep learning. Nature 521(7553), 436-444 (2015)\n\nDistinctive image features from scale-invariant keypoints. D G Lowe, International Journal of Computer Vision. 602Lowe, D.G.: Distinctive image features from scale-invariant keypoints. Interna- tional Journal of Computer Vision 60(2), 91-110 (2004)\n\nVisualizing data using t-sne. L V D Maaten, G Hinton, Journal of Machine Learning Research. 9Maaten, L.v.d., Hinton, G.: Visualizing data using t-sne. Journal of Machine Learn- ing Research 9(Nov), 2579-2605 (2008)\n\nC D Manning, P Raghavan, H Schtze, Introduction to Information Retrieval. Manning, C.D., Raghavan, P., Schtze, H.: Introduction to Information Retrieval (2008)\n\nMachine learning of molecular electronic properties in chemical compound space. G Montavon, M Rupp, V Gobre, A Vazquez-Mayagoitia, K Hansen, A Tkatchenko, K R Müller, O A Von Lilienfeld, New Journal of Physics. 15995003Montavon, G., Rupp, M., Gobre, V., Vazquez-Mayagoitia, A., Hansen, K., Tkatchenko, A., Müller, K.R., Von Lilienfeld, O.A.: Machine learning of molec- ular electronic properties in chemical compound space. New Journal of Physics 15(9), 095003 (2013)\n\nLearning multi-domain convolutional neural networks for visual tracking. H Nam, B Han, IEEE Conference on Computer Vision and Pattern Recognition. Nam, H., Han, B.: Learning multi-domain convolutional neural networks for visual tracking. In: IEEE Conference on Computer Vision and Pattern Recognition. pp. 4293-4302 (2016)\n\nA probabilistic framework for multimodal retrieval using integrative indian buffet process. B Ozdemir, L S Davis, Proceedings of the Advances in Neural Information Processing Systems. the Advances in Neural Information Processing SystemsOzdemir, B., Davis, L.S.: A probabilistic framework for multimodal retrieval us- ing integrative indian buffet process. In: Proceedings of the Advances in Neural Information Processing Systems. pp. 2384-2392 (2014)\n\nLearning bag-of-features pooling for deep convolutional neural networks. N Passalis, A Tefas, Proceedings of the IEEE International Conference on Computer Vision. the IEEE International Conference on Computer VisionPassalis, N., Tefas, A.: Learning bag-of-features pooling for deep convolutional neu- ral networks. In: Proceedings of the IEEE International Conference on Computer Vision (2017)\n\nUnsupervised knowledge transfer using similarity embeddings. N Passalis, A Tefas, IEEE Transactions on Neural Networks and Learning Systems. Passalis, N., Tefas, A.: Unsupervised knowledge transfer using similarity embed- dings. IEEE Transactions on Neural Networks and Learning Systems (2018)\n\nSun attribute database: Discovering, annotating, and recognizing scene attributes. G Patterson, J Hays, Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. the IEEE Conference on Computer Vision and Pattern RecognitionPatterson, G., Hays, J.: Sun attribute database: Discovering, annotating, and rec- ognizing scene attributes. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. pp. 2751-2758 (2012)\n\nYou Only Look Once: Unified, real-time object detection. J Redmon, S Divvala, R Girshick, A Farhadi, Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. the IEEE Conference on Computer Vision and Pattern RecognitionRedmon, J., Divvala, S., Girshick, R., Farhadi, A.: You Only Look Once: Unified, real-time object detection. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. pp. 779-788 (2016)\n\nJ Redmon, A Farhadi, arXiv:1612.08242Yolo9000: Better, faster, stronger. arXiv preprintRedmon, J., Farhadi, A.: Yolo9000: Better, faster, stronger. arXiv preprint arXiv:1612.08242 (2016)\n\nFitnets: Hints for thin deep nets. A Romero, N Ballas, S E Kahou, A Chassang, C Gatta, Y Bengio, Proceedings of the International Conference on Learning Representations. the International Conference on Learning RepresentationsRomero, A., Ballas, N., Kahou, S.E., Chassang, A., Gatta, C., Bengio, Y.: Fit- nets: Hints for thin deep nets. In: Proceedings of the International Conference on Learning Representations (2015)\n\nMultivariate density estimation: theory, practice, and visualization. D W Scott, John Wiley & SonsScott, D.W.: Multivariate density estimation: theory, practice, and visualization. John Wiley & Sons (2015)\n\nDsod: Learning deeply supervised object detectors from scratch. Z Shen, Z Liu, J Li, Y G Jiang, Y Chen, X Xue, Proceedings of the IEEE International Conference on Computer Vision. the IEEE International Conference on Computer VisionShen, Z., Liu, Z., Li, J., Jiang, Y.G., Chen, Y., Xue, X.: Dsod: Learning deeply supervised object detectors from scratch. In: Proceedings of the IEEE International Conference on Computer Vision (Oct 2017)\n\nPrivacy-preserving deep learning. R Shokri, V Shmatikov, Proceedings of the ACM SIGSAC Conference on Computer and Communications Security. the ACM SIGSAC Conference on Computer and Communications SecurityShokri, R., Shmatikov, V.: Privacy-preserving deep learning. In: Proceedings of the ACM SIGSAC Conference on Computer and Communications Security. pp. 1310-1321 (2015)\n\nMultimodal learning with deep boltzmann machines. N Srivastava, R R Salakhutdinov, Proceedings of the Advances in Neural Information Processing Systems. Pereira, F., Burges, C.J.C., Bottou, L., Weinberger, K.Q.the Advances in Neural Information Processing SystemsSrivastava, N., Salakhutdinov, R.R.: Multimodal learning with deep boltzmann machines. In: Pereira, F., Burges, C.J.C., Bottou, L., Weinberger, K.Q. (eds.) Pro- ceedings of the Advances in Neural Information Processing Systems, pp. 2222-2230 (2012)\n\nKnowledge transfer pre-training. Z Tang, D Wang, Y Pan, Z Zhang, arXiv:1506.02256arXiv preprintTang, Z., Wang, D., Pan, Y., Zhang, Z.: Knowledge transfer pre-training. arXiv preprint arXiv:1506.02256 (2015)\n\nRecurrent neural network training with dark knowledge transfer. Z Tang, D Wang, Z Zhang, Proceedings of the IEEE International Conference on Acoustics, Speech and Signal Processing. the IEEE International Conference on Acoustics, Speech and Signal ProcessingIEEETang, Z., Wang, D., Zhang, Z.: Recurrent neural network training with dark knowl- edge transfer. In: Proceedings of the IEEE International Conference on Acoustics, Speech and Signal Processing. pp. 5900-5904. IEEE (2016)\n\nFeature extraction by non-parametric mutual information maximization. K Torkkola, Journal of Machine Learning Research. 3Torkkola, K.: Feature extraction by non-parametric mutual information maximiza- tion. Journal of Machine Learning Research 3(Mar), 1415-1438 (2003)\n\nBandwidth selection in kernel density estimation: A review. B A Turlach, Université catholique de Louvain Louvain-la-NeuveTurlach, B.A., et al.: Bandwidth selection in kernel density estimation: A review. Université catholique de Louvain Louvain-la-Neuve (1993)\n\nSimultaneous deep transfer across domains and tasks. E Tzeng, J Hoffman, T Darrell, K Saenko, Proceedings of the IEEE International Conference on Computer Vision. the IEEE International Conference on Computer VisionTzeng, E., Hoffman, J., Darrell, T., Saenko, K.: Simultaneous deep transfer across domains and tasks. In: Proceedings of the IEEE International Conference on Com- puter Vision. pp. 4068-4076 (2015)\n\nVisual tracking via weighted local cosine similarity. D Wang, H Lu, C Bo, IEEE Transactions on Cybernetics. 459Wang, D., Lu, H., Bo, C.: Visual tracking via weighted local cosine similarity. IEEE Transactions on Cybernetics 45(9), 1838-1850 (2015)\n\nFace recognition in unconstrained videos with matched background similarity. L Wolf, T Hassner, I Maoz, Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. the IEEE Conference on Computer Vision and Pattern RecognitionWolf, L., Hassner, T., Maoz, I.: Face recognition in unconstrained videos with matched background similarity. In: Proceedings of the IEEE Conference on Com- puter Vision and Pattern Recognition. pp. 529-534 (2011)\n\nA gift from knowledge distillation: Fast optimization, network minimization and transfer learning. J Yim, D Joo, J Bae, J Kim, Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. the IEEE Conference on Computer Vision and Pattern RecognitionYim, J., Joo, D., Bae, J., Kim, J.: A gift from knowledge distillation: Fast opti- mization, network minimization and transfer learning. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. pp. 7130-7138 (2017)\n", "annotations": {"author": "[{\"end\":173,\"start\":71},{\"end\":277,\"start\":174}]", "publisher": null, "author_last_name": "[{\"end\":88,\"start\":80},{\"end\":190,\"start\":185}]", "author_first_name": "[{\"end\":79,\"start\":71},{\"end\":184,\"start\":174}]", "author_affiliation": "[{\"end\":172,\"start\":111},{\"end\":276,\"start\":215}]", "title": "[{\"end\":68,\"start\":1},{\"end\":345,\"start\":278}]", "venue": null, "abstract": "[{\"end\":1199,\"start\":347}]", "bib_ref": "[{\"attributes\":{\"ref_id\":\"b25\"},\"end\":1286,\"start\":1282},{\"attributes\":{\"ref_id\":\"b35\"},\"end\":1342,\"start\":1338},{\"attributes\":{\"ref_id\":\"b41\"},\"end\":1403,\"start\":1399},{\"attributes\":{\"ref_id\":\"b19\"},\"end\":1794,\"start\":1790},{\"attributes\":{\"ref_id\":\"b3\"},\"end\":1863,\"start\":1860},{\"attributes\":{\"ref_id\":\"b18\"},\"end\":1866,\"start\":1863},{\"attributes\":{\"ref_id\":\"b20\"},\"end\":1869,\"start\":1866},{\"attributes\":{\"ref_id\":\"b32\"},\"end\":1872,\"start\":1869},{\"attributes\":{\"ref_id\":\"b16\"},\"end\":2004,\"start\":2000},{\"attributes\":{\"ref_id\":\"b37\"},\"end\":2007,\"start\":2004},{\"attributes\":{\"ref_id\":\"b43\"},\"end\":2767,\"start\":2763},{\"attributes\":{\"ref_id\":\"b18\"},\"end\":2946,\"start\":2942},{\"attributes\":{\"ref_id\":\"b3\"},\"end\":2973,\"start\":2970},{\"attributes\":{\"ref_id\":\"b7\"},\"end\":3761,\"start\":3758},{\"attributes\":{\"ref_id\":\"b28\"},\"end\":3764,\"start\":3761},{\"attributes\":{\"ref_id\":\"b35\"},\"end\":3833,\"start\":3829},{\"attributes\":{\"ref_id\":\"b30\"},\"end\":3847,\"start\":3843},{\"attributes\":{\"ref_id\":\"b13\"},\"end\":3894,\"start\":3890},{\"attributes\":{\"ref_id\":\"b40\"},\"end\":4111,\"start\":4107},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":4197,\"start\":4194},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":4613,\"start\":4610},{\"attributes\":{\"ref_id\":\"b26\"},\"end\":5330,\"start\":5326},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":5344,\"start\":5340},{\"attributes\":{\"ref_id\":\"b22\"},\"end\":5977,\"start\":5973},{\"attributes\":{\"ref_id\":\"b29\"},\"end\":6035,\"start\":6031},{\"attributes\":{\"ref_id\":\"b35\"},\"end\":6154,\"start\":6150},{\"attributes\":{\"ref_id\":\"b39\"},\"end\":6430,\"start\":6426},{\"attributes\":{\"ref_id\":\"b8\"},\"end\":7219,\"start\":7216},{\"attributes\":{\"ref_id\":\"b44\"},\"end\":9067,\"start\":9063},{\"attributes\":{\"ref_id\":\"b2\"},\"end\":10860,\"start\":10857},{\"attributes\":{\"ref_id\":\"b5\"},\"end\":10862,\"start\":10860},{\"attributes\":{\"ref_id\":\"b16\"},\"end\":10865,\"start\":10862},{\"attributes\":{\"ref_id\":\"b43\"},\"end\":10868,\"start\":10865},{\"attributes\":{\"ref_id\":\"b46\"},\"end\":10871,\"start\":10868},{\"attributes\":{\"ref_id\":\"b2\"},\"end\":10953,\"start\":10950},{\"attributes\":{\"ref_id\":\"b16\"},\"end\":11004,\"start\":11000},{\"attributes\":{\"ref_id\":\"b7\"},\"end\":11340,\"start\":11337},{\"attributes\":{\"ref_id\":\"b16\"},\"end\":11343,\"start\":11340},{\"attributes\":{\"ref_id\":\"b18\"},\"end\":11346,\"start\":11343},{\"attributes\":{\"ref_id\":\"b42\"},\"end\":11445,\"start\":11441},{\"attributes\":{\"ref_id\":\"b46\"},\"end\":11522,\"start\":11518},{\"attributes\":{\"ref_id\":\"b0\"},\"end\":11601,\"start\":11598},{\"attributes\":{\"ref_id\":\"b5\"},\"end\":11615,\"start\":11612},{\"attributes\":{\"ref_id\":\"b43\"},\"end\":11800,\"start\":11796},{\"attributes\":{\"ref_id\":\"b6\"},\"end\":12189,\"start\":12186},{\"attributes\":{\"ref_id\":\"b37\"},\"end\":12324,\"start\":12320},{\"attributes\":{\"ref_id\":\"b49\"},\"end\":12658,\"start\":12654},{\"attributes\":{\"ref_id\":\"b16\"},\"end\":13673,\"start\":13669},{\"attributes\":{\"ref_id\":\"b37\"},\"end\":14068,\"start\":14064},{\"attributes\":{\"ref_id\":\"b6\"},\"end\":14491,\"start\":14488},{\"attributes\":{\"ref_id\":\"b33\"},\"end\":14899,\"start\":14895},{\"attributes\":{\"ref_id\":\"b37\"},\"end\":14902,\"start\":14899},{\"attributes\":{\"ref_id\":\"b49\"},\"end\":14905,\"start\":14902},{\"attributes\":{\"ref_id\":\"b17\"},\"end\":16003,\"start\":15999},{\"attributes\":{\"ref_id\":\"b27\"},\"end\":16006,\"start\":16003},{\"attributes\":{\"ref_id\":\"b38\"},\"end\":16433,\"start\":16429},{\"attributes\":{\"ref_id\":\"b27\"},\"end\":18173,\"start\":18169},{\"attributes\":{\"ref_id\":\"b27\"},\"end\":18384,\"start\":18380},{\"attributes\":{\"ref_id\":\"b38\"},\"end\":19159,\"start\":19155},{\"attributes\":{\"ref_id\":\"b45\"},\"end\":19379,\"start\":19375},{\"attributes\":{\"ref_id\":\"b28\"},\"end\":19975,\"start\":19971},{\"attributes\":{\"ref_id\":\"b47\"},\"end\":19978,\"start\":19975},{\"attributes\":{\"ref_id\":\"b23\"},\"end\":21863,\"start\":21859},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":22309,\"start\":22305},{\"attributes\":{\"ref_id\":\"b8\"},\"end\":22945,\"start\":22942},{\"attributes\":{\"ref_id\":\"b44\"},\"end\":23249,\"start\":23245},{\"attributes\":{\"ref_id\":\"b44\"},\"end\":23806,\"start\":23802},{\"attributes\":{\"ref_id\":\"b38\"},\"end\":24592,\"start\":24588},{\"attributes\":{\"ref_id\":\"b44\"},\"end\":24964,\"start\":24960},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":26636,\"start\":26632},{\"attributes\":{\"ref_id\":\"b21\"},\"end\":27014,\"start\":27010},{\"attributes\":{\"ref_id\":\"b28\"},\"end\":28087,\"start\":28083},{\"attributes\":{\"ref_id\":\"b37\"},\"end\":28495,\"start\":28491},{\"attributes\":{\"ref_id\":\"b16\"},\"end\":28842,\"start\":28838},{\"attributes\":{\"ref_id\":\"b49\"},\"end\":28868,\"start\":28864},{\"attributes\":{\"ref_id\":\"b49\"},\"end\":28984,\"start\":28980},{\"attributes\":{\"ref_id\":\"b37\"},\"end\":30585,\"start\":30581},{\"attributes\":{\"ref_id\":\"b48\"},\"end\":31251,\"start\":31247},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":31426,\"start\":31422},{\"attributes\":{\"ref_id\":\"b48\"},\"end\":32294,\"start\":32290},{\"attributes\":{\"ref_id\":\"b34\"},\"end\":35040,\"start\":35036},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":35216,\"start\":35212},{\"attributes\":{\"ref_id\":\"b34\"},\"end\":35219,\"start\":35216},{\"attributes\":{\"ref_id\":\"b31\"},\"end\":35664,\"start\":35660},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":36904,\"start\":36900},{\"attributes\":{\"ref_id\":\"b34\"},\"end\":36907,\"start\":36904},{\"attributes\":{\"ref_id\":\"b11\"},\"end\":38017,\"start\":38013},{\"attributes\":{\"ref_id\":\"b12\"},\"end\":38020,\"start\":38017},{\"attributes\":{\"ref_id\":\"b35\"},\"end\":38072,\"start\":38068},{\"attributes\":{\"ref_id\":\"b36\"},\"end\":38158,\"start\":38154},{\"attributes\":{\"ref_id\":\"b24\"},\"end\":38372,\"start\":38368},{\"attributes\":{\"ref_id\":\"b39\"},\"end\":38631,\"start\":38627},{\"attributes\":{\"ref_id\":\"b36\"},\"end\":39331,\"start\":39327},{\"attributes\":{\"ref_id\":\"b39\"},\"end\":39915,\"start\":39911}]", "figure": "[{\"attributes\":{\"id\":\"fig_0\"},\"end\":41585,\"start\":41328},{\"attributes\":{\"id\":\"tab_0\",\"type\":\"table\"},\"end\":42055,\"start\":41586},{\"attributes\":{\"id\":\"tab_1\",\"type\":\"table\"},\"end\":42472,\"start\":42056}]", "paragraph": "[{\"end\":1873,\"start\":1215},{\"end\":3056,\"start\":1875},{\"end\":4614,\"start\":3058},{\"end\":6596,\"start\":4616},{\"end\":8183,\"start\":6598},{\"end\":10068,\"start\":8185},{\"end\":10334,\"start\":10070},{\"end\":10872,\"start\":10351},{\"end\":12068,\"start\":10874},{\"end\":13205,\"start\":12070},{\"end\":14906,\"start\":13207},{\"end\":15870,\"start\":14943},{\"end\":16437,\"start\":15872},{\"end\":16491,\"start\":16488},{\"end\":17310,\"start\":16542},{\"end\":18463,\"start\":17312},{\"end\":18573,\"start\":18542},{\"end\":18875,\"start\":18652},{\"end\":19587,\"start\":18926},{\"end\":20166,\"start\":19652},{\"end\":20447,\"start\":20206},{\"end\":21299,\"start\":20496},{\"end\":21570,\"start\":21301},{\"end\":22632,\"start\":21636},{\"end\":23469,\"start\":22663},{\"end\":23807,\"start\":23521},{\"end\":23893,\"start\":23853},{\"end\":24075,\"start\":23976},{\"end\":24251,\"start\":24180},{\"end\":24816,\"start\":24295},{\"end\":24965,\"start\":24871},{\"end\":25113,\"start\":25110},{\"end\":25786,\"start\":25188},{\"end\":25953,\"start\":25807},{\"end\":26409,\"start\":25955},{\"end\":27581,\"start\":26437},{\"end\":29822,\"start\":27583},{\"end\":31121,\"start\":29824},{\"end\":31896,\"start\":31123},{\"end\":33173,\"start\":31898},{\"end\":33886,\"start\":33175},{\"end\":34950,\"start\":33888},{\"end\":36790,\"start\":34952},{\"end\":37285,\"start\":36792},{\"end\":37886,\"start\":37287},{\"end\":39046,\"start\":37888},{\"end\":40845,\"start\":39048},{\"end\":41327,\"start\":40861}]", "formula": "[{\"attributes\":{\"id\":\"formula_0\"},\"end\":16487,\"start\":16438},{\"attributes\":{\"id\":\"formula_1\"},\"end\":16541,\"start\":16492},{\"attributes\":{\"id\":\"formula_2\"},\"end\":18541,\"start\":18464},{\"attributes\":{\"id\":\"formula_3\"},\"end\":18651,\"start\":18574},{\"attributes\":{\"id\":\"formula_4\"},\"end\":18925,\"start\":18876},{\"attributes\":{\"id\":\"formula_5\"},\"end\":19651,\"start\":19588},{\"attributes\":{\"id\":\"formula_6\"},\"end\":20205,\"start\":20167},{\"attributes\":{\"id\":\"formula_7\"},\"end\":20495,\"start\":20448},{\"attributes\":{\"id\":\"formula_8\"},\"end\":21635,\"start\":21571},{\"attributes\":{\"id\":\"formula_9\"},\"end\":23520,\"start\":23470},{\"attributes\":{\"id\":\"formula_10\"},\"end\":23852,\"start\":23808},{\"attributes\":{\"id\":\"formula_11\"},\"end\":23975,\"start\":23894},{\"attributes\":{\"id\":\"formula_12\"},\"end\":24179,\"start\":24076},{\"attributes\":{\"id\":\"formula_13\"},\"end\":24294,\"start\":24252},{\"attributes\":{\"id\":\"formula_14\"},\"end\":24870,\"start\":24817},{\"attributes\":{\"id\":\"formula_15\"},\"end\":25033,\"start\":24966},{\"attributes\":{\"id\":\"formula_16\"},\"end\":25109,\"start\":25033},{\"attributes\":{\"id\":\"formula_17\"},\"end\":25187,\"start\":25114},{\"attributes\":{\"id\":\"formula_18\"},\"end\":25797,\"start\":25787}]", "table_ref": "[{\"attributes\":{\"ref_id\":\"tab_0\"},\"end\":27631,\"start\":27624},{\"attributes\":{\"ref_id\":\"tab_0\"},\"end\":29893,\"start\":29886},{\"end\":33221,\"start\":33214},{\"end\":34863,\"start\":34856},{\"end\":36838,\"start\":36831},{\"end\":37592,\"start\":37585},{\"end\":39519,\"start\":39512}]", "section_header": "[{\"attributes\":{\"n\":\"1\"},\"end\":1213,\"start\":1201},{\"attributes\":{\"n\":\"2\"},\"end\":10349,\"start\":10337},{\"attributes\":{\"n\":\"3\"},\"end\":14941,\"start\":14909},{\"end\":22661,\"start\":22635},{\"end\":25805,\"start\":25799},{\"attributes\":{\"n\":\"4\"},\"end\":26435,\"start\":26412},{\"attributes\":{\"n\":\"5\"},\"end\":40859,\"start\":40848},{\"end\":41337,\"start\":41329},{\"end\":41596,\"start\":41587},{\"end\":42075,\"start\":42057}]", "table": "[{\"end\":42055,\"start\":41616},{\"end\":42472,\"start\":42334}]", "figure_caption": "[{\"end\":41585,\"start\":41339},{\"end\":41616,\"start\":41598},{\"end\":42334,\"start\":42078}]", "figure_ref": "[{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":8467,\"start\":8459}]", "bib_author_first_name": "[{\"end\":42500,\"start\":42499},{\"end\":42502,\"start\":42501},{\"end\":42511,\"start\":42510},{\"end\":42521,\"start\":42520},{\"end\":42523,\"start\":42522},{\"end\":42533,\"start\":42532},{\"end\":42937,\"start\":42936},{\"end\":42947,\"start\":42946},{\"end\":42957,\"start\":42956},{\"end\":43231,\"start\":43230},{\"end\":43241,\"start\":43240},{\"end\":43252,\"start\":43251},{\"end\":43741,\"start\":43740},{\"end\":43750,\"start\":43749},{\"end\":44201,\"start\":44200},{\"end\":44208,\"start\":44207},{\"end\":44216,\"start\":44215},{\"end\":44494,\"start\":44493},{\"end\":44502,\"start\":44501},{\"end\":44504,\"start\":44503},{\"end\":44510,\"start\":44509},{\"end\":44662,\"start\":44661},{\"end\":44670,\"start\":44669},{\"end\":44684,\"start\":44683},{\"end\":45042,\"start\":45041},{\"end\":45055,\"start\":45054},{\"end\":45064,\"start\":45063},{\"end\":45074,\"start\":45073},{\"end\":45488,\"start\":45487},{\"end\":45490,\"start\":45489},{\"end\":45499,\"start\":45498},{\"end\":45501,\"start\":45500},{\"end\":45667,\"start\":45666},{\"end\":45676,\"start\":45675},{\"end\":46106,\"start\":46105},{\"end\":46117,\"start\":46116},{\"end\":46119,\"start\":46118},{\"end\":46350,\"start\":46349},{\"end\":46364,\"start\":46363},{\"end\":46376,\"start\":46375},{\"end\":46380,\"start\":46377},{\"end\":46392,\"start\":46391},{\"end\":46400,\"start\":46399},{\"end\":46621,\"start\":46620},{\"end\":46635,\"start\":46634},{\"end\":46647,\"start\":46646},{\"end\":46651,\"start\":46648},{\"end\":46663,\"start\":46662},{\"end\":46671,\"start\":46670},{\"end\":46930,\"start\":46929},{\"end\":46940,\"start\":46939},{\"end\":46950,\"start\":46949},{\"end\":46964,\"start\":46963},{\"end\":47196,\"start\":47195},{\"end\":47203,\"start\":47202},{\"end\":47212,\"start\":47211},{\"end\":47218,\"start\":47217},{\"end\":47224,\"start\":47223},{\"end\":47578,\"start\":47577},{\"end\":47584,\"start\":47583},{\"end\":47593,\"start\":47592},{\"end\":47600,\"start\":47599},{\"end\":47980,\"start\":47979},{\"end\":47990,\"start\":47989},{\"end\":48001,\"start\":48000},{\"end\":48254,\"start\":48253},{\"end\":48256,\"start\":48255},{\"end\":48266,\"start\":48265},{\"end\":48268,\"start\":48267},{\"end\":48554,\"start\":48553},{\"end\":48556,\"start\":48555},{\"end\":48566,\"start\":48565},{\"end\":48573,\"start\":48572},{\"end\":48581,\"start\":48580},{\"end\":48597,\"start\":48596},{\"end\":48605,\"start\":48604},{\"end\":48615,\"start\":48614},{\"end\":48628,\"start\":48627},{\"end\":49001,\"start\":49000},{\"end\":49011,\"start\":49010},{\"end\":49026,\"start\":49025},{\"end\":49036,\"start\":49035},{\"end\":49048,\"start\":49047},{\"end\":49373,\"start\":49372},{\"end\":49375,\"start\":49374},{\"end\":49386,\"start\":49385},{\"end\":49393,\"start\":49392},{\"end\":49395,\"start\":49394},{\"end\":49408,\"start\":49407},{\"end\":49418,\"start\":49417},{\"end\":49420,\"start\":49419},{\"end\":49429,\"start\":49428},{\"end\":49855,\"start\":49854},{\"end\":49864,\"start\":49863},{\"end\":50276,\"start\":50275},{\"end\":50278,\"start\":50277},{\"end\":50291,\"start\":50290},{\"end\":50524,\"start\":50523},{\"end\":50534,\"start\":50533},{\"end\":50737,\"start\":50736},{\"end\":50751,\"start\":50750},{\"end\":50764,\"start\":50763},{\"end\":50766,\"start\":50765},{\"end\":51122,\"start\":51121},{\"end\":51131,\"start\":51130},{\"end\":51141,\"start\":51140},{\"end\":51309,\"start\":51308},{\"end\":51311,\"start\":51310},{\"end\":51530,\"start\":51529},{\"end\":51534,\"start\":51531},{\"end\":51544,\"start\":51543},{\"end\":51716,\"start\":51715},{\"end\":51718,\"start\":51717},{\"end\":51729,\"start\":51728},{\"end\":51741,\"start\":51740},{\"end\":51957,\"start\":51956},{\"end\":51969,\"start\":51968},{\"end\":51977,\"start\":51976},{\"end\":51986,\"start\":51985},{\"end\":52008,\"start\":52007},{\"end\":52018,\"start\":52017},{\"end\":52032,\"start\":52031},{\"end\":52034,\"start\":52033},{\"end\":52044,\"start\":52043},{\"end\":52046,\"start\":52045},{\"end\":52419,\"start\":52418},{\"end\":52426,\"start\":52425},{\"end\":52762,\"start\":52761},{\"end\":52773,\"start\":52772},{\"end\":52775,\"start\":52774},{\"end\":53196,\"start\":53195},{\"end\":53208,\"start\":53207},{\"end\":53579,\"start\":53578},{\"end\":53591,\"start\":53590},{\"end\":53896,\"start\":53895},{\"end\":53909,\"start\":53908},{\"end\":54330,\"start\":54329},{\"end\":54340,\"start\":54339},{\"end\":54351,\"start\":54350},{\"end\":54363,\"start\":54362},{\"end\":54727,\"start\":54726},{\"end\":54737,\"start\":54736},{\"end\":54950,\"start\":54949},{\"end\":54960,\"start\":54959},{\"end\":54970,\"start\":54969},{\"end\":54972,\"start\":54971},{\"end\":54981,\"start\":54980},{\"end\":54993,\"start\":54992},{\"end\":55002,\"start\":55001},{\"end\":55406,\"start\":55405},{\"end\":55408,\"start\":55407},{\"end\":55607,\"start\":55606},{\"end\":55615,\"start\":55614},{\"end\":55622,\"start\":55621},{\"end\":55628,\"start\":55627},{\"end\":55630,\"start\":55629},{\"end\":55639,\"start\":55638},{\"end\":55647,\"start\":55646},{\"end\":56016,\"start\":56015},{\"end\":56026,\"start\":56025},{\"end\":56405,\"start\":56404},{\"end\":56419,\"start\":56418},{\"end\":56421,\"start\":56420},{\"end\":56901,\"start\":56900},{\"end\":56909,\"start\":56908},{\"end\":56917,\"start\":56916},{\"end\":56924,\"start\":56923},{\"end\":57140,\"start\":57139},{\"end\":57148,\"start\":57147},{\"end\":57156,\"start\":57155},{\"end\":57630,\"start\":57629},{\"end\":57890,\"start\":57889},{\"end\":57892,\"start\":57891},{\"end\":58146,\"start\":58145},{\"end\":58155,\"start\":58154},{\"end\":58166,\"start\":58165},{\"end\":58177,\"start\":58176},{\"end\":58561,\"start\":58560},{\"end\":58569,\"start\":58568},{\"end\":58575,\"start\":58574},{\"end\":58833,\"start\":58832},{\"end\":58841,\"start\":58840},{\"end\":58852,\"start\":58851},{\"end\":59315,\"start\":59314},{\"end\":59322,\"start\":59321},{\"end\":59329,\"start\":59328},{\"end\":59336,\"start\":59335}]", "bib_author_last_name": "[{\"end\":42508,\"start\":42503},{\"end\":42518,\"start\":42512},{\"end\":42530,\"start\":42524},{\"end\":42541,\"start\":42534},{\"end\":42944,\"start\":42938},{\"end\":42954,\"start\":42948},{\"end\":42967,\"start\":42958},{\"end\":43238,\"start\":43232},{\"end\":43249,\"start\":43242},{\"end\":43268,\"start\":43253},{\"end\":43747,\"start\":43742},{\"end\":43764,\"start\":43751},{\"end\":44205,\"start\":44202},{\"end\":44213,\"start\":44209},{\"end\":44223,\"start\":44217},{\"end\":44499,\"start\":44495},{\"end\":44507,\"start\":44505},{\"end\":44515,\"start\":44511},{\"end\":44667,\"start\":44663},{\"end\":44681,\"start\":44671},{\"end\":44691,\"start\":44685},{\"end\":45052,\"start\":45043},{\"end\":45061,\"start\":45056},{\"end\":45071,\"start\":45065},{\"end\":45079,\"start\":45075},{\"end\":45496,\"start\":45491},{\"end\":45508,\"start\":45502},{\"end\":45673,\"start\":45668},{\"end\":45683,\"start\":45677},{\"end\":46114,\"start\":46107},{\"end\":46127,\"start\":46120},{\"end\":46361,\"start\":46351},{\"end\":46373,\"start\":46365},{\"end\":46389,\"start\":46381},{\"end\":46397,\"start\":46393},{\"end\":46410,\"start\":46401},{\"end\":46632,\"start\":46622},{\"end\":46644,\"start\":46636},{\"end\":46660,\"start\":46652},{\"end\":46668,\"start\":46664},{\"end\":46681,\"start\":46672},{\"end\":46937,\"start\":46931},{\"end\":46947,\"start\":46941},{\"end\":46961,\"start\":46951},{\"end\":46972,\"start\":46965},{\"end\":47200,\"start\":47197},{\"end\":47209,\"start\":47204},{\"end\":47215,\"start\":47213},{\"end\":47221,\"start\":47219},{\"end\":47228,\"start\":47225},{\"end\":47581,\"start\":47579},{\"end\":47590,\"start\":47585},{\"end\":47597,\"start\":47594},{\"end\":47604,\"start\":47601},{\"end\":47987,\"start\":47981},{\"end\":47998,\"start\":47991},{\"end\":48006,\"start\":48002},{\"end\":48263,\"start\":48257},{\"end\":48275,\"start\":48269},{\"end\":48563,\"start\":48557},{\"end\":48570,\"start\":48567},{\"end\":48578,\"start\":48574},{\"end\":48594,\"start\":48582},{\"end\":48602,\"start\":48598},{\"end\":48612,\"start\":48606},{\"end\":48625,\"start\":48616},{\"end\":48633,\"start\":48629},{\"end\":49008,\"start\":49002},{\"end\":49023,\"start\":49012},{\"end\":49033,\"start\":49027},{\"end\":49045,\"start\":49037},{\"end\":49055,\"start\":49049},{\"end\":49383,\"start\":49376},{\"end\":49390,\"start\":49387},{\"end\":49405,\"start\":49396},{\"end\":49415,\"start\":49409},{\"end\":49426,\"start\":49421},{\"end\":49437,\"start\":49430},{\"end\":49861,\"start\":49856},{\"end\":49872,\"start\":49865},{\"end\":50288,\"start\":50279},{\"end\":50297,\"start\":50292},{\"end\":50531,\"start\":50525},{\"end\":50537,\"start\":50535},{\"end\":50748,\"start\":50738},{\"end\":50761,\"start\":50752},{\"end\":50773,\"start\":50767},{\"end\":51128,\"start\":51123},{\"end\":51138,\"start\":51132},{\"end\":51148,\"start\":51142},{\"end\":51316,\"start\":51312},{\"end\":51541,\"start\":51535},{\"end\":51551,\"start\":51545},{\"end\":51726,\"start\":51719},{\"end\":51738,\"start\":51730},{\"end\":51748,\"start\":51742},{\"end\":51966,\"start\":51958},{\"end\":51974,\"start\":51970},{\"end\":51983,\"start\":51978},{\"end\":52005,\"start\":51987},{\"end\":52015,\"start\":52009},{\"end\":52029,\"start\":52019},{\"end\":52041,\"start\":52035},{\"end\":52061,\"start\":52047},{\"end\":52423,\"start\":52420},{\"end\":52430,\"start\":52427},{\"end\":52770,\"start\":52763},{\"end\":52781,\"start\":52776},{\"end\":53205,\"start\":53197},{\"end\":53214,\"start\":53209},{\"end\":53588,\"start\":53580},{\"end\":53597,\"start\":53592},{\"end\":53906,\"start\":53897},{\"end\":53914,\"start\":53910},{\"end\":54337,\"start\":54331},{\"end\":54348,\"start\":54341},{\"end\":54360,\"start\":54352},{\"end\":54371,\"start\":54364},{\"end\":54734,\"start\":54728},{\"end\":54745,\"start\":54738},{\"end\":54957,\"start\":54951},{\"end\":54967,\"start\":54961},{\"end\":54978,\"start\":54973},{\"end\":54990,\"start\":54982},{\"end\":54999,\"start\":54994},{\"end\":55009,\"start\":55003},{\"end\":55414,\"start\":55409},{\"end\":55612,\"start\":55608},{\"end\":55619,\"start\":55616},{\"end\":55625,\"start\":55623},{\"end\":55636,\"start\":55631},{\"end\":55644,\"start\":55640},{\"end\":55651,\"start\":55648},{\"end\":56023,\"start\":56017},{\"end\":56036,\"start\":56027},{\"end\":56416,\"start\":56406},{\"end\":56435,\"start\":56422},{\"end\":56906,\"start\":56902},{\"end\":56914,\"start\":56910},{\"end\":56921,\"start\":56918},{\"end\":56930,\"start\":56925},{\"end\":57145,\"start\":57141},{\"end\":57153,\"start\":57149},{\"end\":57162,\"start\":57157},{\"end\":57639,\"start\":57631},{\"end\":57900,\"start\":57893},{\"end\":58152,\"start\":58147},{\"end\":58163,\"start\":58156},{\"end\":58174,\"start\":58167},{\"end\":58184,\"start\":58178},{\"end\":58566,\"start\":58562},{\"end\":58572,\"start\":58570},{\"end\":58578,\"start\":58576},{\"end\":58838,\"start\":58834},{\"end\":58849,\"start\":58842},{\"end\":58857,\"start\":58853},{\"end\":59319,\"start\":59316},{\"end\":59326,\"start\":59323},{\"end\":59333,\"start\":59330},{\"end\":59340,\"start\":59337}]", "bib_entry": "[{\"attributes\":{\"id\":\"b0\",\"matched_paper_id\":84176918},\"end\":42837,\"start\":42474},{\"attributes\":{\"id\":\"b1\",\"matched_paper_id\":16902615},\"end\":43209,\"start\":42839},{\"attributes\":{\"id\":\"b2\",\"matched_paper_id\":11253972},\"end\":43625,\"start\":43211},{\"attributes\":{\"id\":\"b3\",\"matched_paper_id\":9376794},\"end\":44114,\"start\":43627},{\"attributes\":{\"id\":\"b4\",\"matched_paper_id\":9604191},\"end\":44447,\"start\":44116},{\"attributes\":{\"doi\":\"arXiv:1504.01483\",\"id\":\"b5\"},\"end\":44659,\"start\":44449},{\"attributes\":{\"doi\":\"arXiv:1511.05641\",\"id\":\"b6\"},\"end\":44909,\"start\":44661},{\"attributes\":{\"id\":\"b7\",\"matched_paper_id\":34692927},\"end\":45453,\"start\":44911},{\"attributes\":{\"id\":\"b8\"},\"end\":45610,\"start\":45455},{\"attributes\":{\"id\":\"b9\",\"matched_paper_id\":206590483},\"end\":46013,\"start\":45612},{\"attributes\":{\"id\":\"b10\",\"matched_paper_id\":215012},\"end\":46347,\"start\":46015},{\"attributes\":{\"id\":\"b11\"},\"end\":46618,\"start\":46349},{\"attributes\":{\"id\":\"b12\"},\"end\":46889,\"start\":46620},{\"attributes\":{\"id\":\"b13\",\"matched_paper_id\":10099051},\"end\":47122,\"start\":46891},{\"attributes\":{\"id\":\"b14\",\"matched_paper_id\":2908606},\"end\":47529,\"start\":47124},{\"attributes\":{\"id\":\"b15\",\"matched_paper_id\":206594692},\"end\":47931,\"start\":47531},{\"attributes\":{\"id\":\"b16\",\"matched_paper_id\":7200347},\"end\":48220,\"start\":47933},{\"attributes\":{\"id\":\"b17\",\"matched_paper_id\":20240},\"end\":48551,\"start\":48222},{\"attributes\":{\"doi\":\"arXiv:1704.04861\",\"id\":\"b18\"},\"end\":48971,\"start\":48553},{\"attributes\":{\"id\":\"b19\",\"matched_paper_id\":6453539},\"end\":49370,\"start\":48973},{\"attributes\":{\"doi\":\"arXiv:1602.07360\",\"id\":\"b20\"},\"end\":49758,\"start\":49372},{\"attributes\":{\"id\":\"b21\",\"matched_paper_id\":5808102},\"end\":50192,\"start\":49760},{\"attributes\":{\"id\":\"b22\",\"matched_paper_id\":153110192},\"end\":50477,\"start\":50194},{\"attributes\":{\"doi\":\"arXiv:1412.6980\",\"id\":\"b23\"},\"end\":50669,\"start\":50479},{\"attributes\":{\"id\":\"b24\",\"matched_paper_id\":195908774},\"end\":51104,\"start\":50671},{\"attributes\":{\"id\":\"b25\",\"matched_paper_id\":1779661},\"end\":51247,\"start\":51106},{\"attributes\":{\"id\":\"b26\",\"matched_paper_id\":174065},\"end\":51497,\"start\":51249},{\"attributes\":{\"id\":\"b27\",\"matched_paper_id\":5855042},\"end\":51713,\"start\":51499},{\"attributes\":{\"id\":\"b28\"},\"end\":51874,\"start\":51715},{\"attributes\":{\"id\":\"b29\",\"matched_paper_id\":4139401},\"end\":52343,\"start\":51876},{\"attributes\":{\"id\":\"b30\",\"matched_paper_id\":973101},\"end\":52667,\"start\":52345},{\"attributes\":{\"id\":\"b31\",\"matched_paper_id\":10403904},\"end\":53120,\"start\":52669},{\"attributes\":{\"id\":\"b32\",\"matched_paper_id\":25214831},\"end\":53515,\"start\":53122},{\"attributes\":{\"id\":\"b33\",\"matched_paper_id\":51721116},\"end\":53810,\"start\":53517},{\"attributes\":{\"id\":\"b34\",\"matched_paper_id\":8724974},\"end\":54270,\"start\":53812},{\"attributes\":{\"id\":\"b35\",\"matched_paper_id\":206594738},\"end\":54724,\"start\":54272},{\"attributes\":{\"doi\":\"arXiv:1612.08242\",\"id\":\"b36\"},\"end\":54912,\"start\":54726},{\"attributes\":{\"id\":\"b37\",\"matched_paper_id\":2723173},\"end\":55333,\"start\":54914},{\"attributes\":{\"id\":\"b38\"},\"end\":55540,\"start\":55335},{\"attributes\":{\"id\":\"b39\",\"matched_paper_id\":6215595},\"end\":55979,\"start\":55542},{\"attributes\":{\"id\":\"b40\",\"matched_paper_id\":20714},\"end\":56352,\"start\":55981},{\"attributes\":{\"id\":\"b41\",\"matched_paper_id\":710430},\"end\":56865,\"start\":56354},{\"attributes\":{\"doi\":\"arXiv:1506.02256\",\"id\":\"b42\"},\"end\":57073,\"start\":56867},{\"attributes\":{\"id\":\"b43\",\"matched_paper_id\":14006976},\"end\":57557,\"start\":57075},{\"attributes\":{\"id\":\"b44\",\"matched_paper_id\":3181596},\"end\":57827,\"start\":57559},{\"attributes\":{\"id\":\"b45\"},\"end\":58090,\"start\":57829},{\"attributes\":{\"id\":\"b46\",\"matched_paper_id\":2655115},\"end\":58504,\"start\":58092},{\"attributes\":{\"id\":\"b47\",\"matched_paper_id\":2665443},\"end\":58753,\"start\":58506},{\"attributes\":{\"id\":\"b48\",\"matched_paper_id\":9898157},\"end\":59213,\"start\":58755},{\"attributes\":{\"id\":\"b49\",\"matched_paper_id\":206596723},\"end\":59723,\"start\":59215}]", "bib_title": "[{\"end\":42497,\"start\":42474},{\"end\":42934,\"start\":42839},{\"end\":43228,\"start\":43211},{\"end\":43738,\"start\":43627},{\"end\":44198,\"start\":44116},{\"end\":45039,\"start\":44911},{\"end\":45664,\"start\":45612},{\"end\":46103,\"start\":46015},{\"end\":46927,\"start\":46891},{\"end\":47193,\"start\":47124},{\"end\":47575,\"start\":47531},{\"end\":47977,\"start\":47933},{\"end\":48251,\"start\":48222},{\"end\":48998,\"start\":48973},{\"end\":49852,\"start\":49760},{\"end\":50273,\"start\":50194},{\"end\":50734,\"start\":50671},{\"end\":51119,\"start\":51106},{\"end\":51306,\"start\":51249},{\"end\":51527,\"start\":51499},{\"end\":51954,\"start\":51876},{\"end\":52416,\"start\":52345},{\"end\":52759,\"start\":52669},{\"end\":53193,\"start\":53122},{\"end\":53576,\"start\":53517},{\"end\":53893,\"start\":53812},{\"end\":54327,\"start\":54272},{\"end\":54947,\"start\":54914},{\"end\":55604,\"start\":55542},{\"end\":56013,\"start\":55981},{\"end\":56402,\"start\":56354},{\"end\":57137,\"start\":57075},{\"end\":57627,\"start\":57559},{\"end\":58143,\"start\":58092},{\"end\":58558,\"start\":58506},{\"end\":58830,\"start\":58755},{\"end\":59312,\"start\":59215}]", "bib_author": "[{\"end\":42510,\"start\":42499},{\"end\":42520,\"start\":42510},{\"end\":42532,\"start\":42520},{\"end\":42543,\"start\":42532},{\"end\":42946,\"start\":42936},{\"end\":42956,\"start\":42946},{\"end\":42969,\"start\":42956},{\"end\":43240,\"start\":43230},{\"end\":43251,\"start\":43240},{\"end\":43270,\"start\":43251},{\"end\":43749,\"start\":43740},{\"end\":43766,\"start\":43749},{\"end\":44207,\"start\":44200},{\"end\":44215,\"start\":44207},{\"end\":44225,\"start\":44215},{\"end\":44501,\"start\":44493},{\"end\":44509,\"start\":44501},{\"end\":44517,\"start\":44509},{\"end\":44669,\"start\":44661},{\"end\":44683,\"start\":44669},{\"end\":44693,\"start\":44683},{\"end\":45054,\"start\":45041},{\"end\":45063,\"start\":45054},{\"end\":45073,\"start\":45063},{\"end\":45081,\"start\":45073},{\"end\":45498,\"start\":45487},{\"end\":45510,\"start\":45498},{\"end\":45675,\"start\":45666},{\"end\":45685,\"start\":45675},{\"end\":46116,\"start\":46105},{\"end\":46129,\"start\":46116},{\"end\":46363,\"start\":46349},{\"end\":46375,\"start\":46363},{\"end\":46391,\"start\":46375},{\"end\":46399,\"start\":46391},{\"end\":46412,\"start\":46399},{\"end\":46634,\"start\":46620},{\"end\":46646,\"start\":46634},{\"end\":46662,\"start\":46646},{\"end\":46670,\"start\":46662},{\"end\":46683,\"start\":46670},{\"end\":46939,\"start\":46929},{\"end\":46949,\"start\":46939},{\"end\":46963,\"start\":46949},{\"end\":46974,\"start\":46963},{\"end\":47202,\"start\":47195},{\"end\":47211,\"start\":47202},{\"end\":47217,\"start\":47211},{\"end\":47223,\"start\":47217},{\"end\":47230,\"start\":47223},{\"end\":47583,\"start\":47577},{\"end\":47592,\"start\":47583},{\"end\":47599,\"start\":47592},{\"end\":47606,\"start\":47599},{\"end\":47989,\"start\":47979},{\"end\":48000,\"start\":47989},{\"end\":48008,\"start\":48000},{\"end\":48265,\"start\":48253},{\"end\":48277,\"start\":48265},{\"end\":48565,\"start\":48553},{\"end\":48572,\"start\":48565},{\"end\":48580,\"start\":48572},{\"end\":48596,\"start\":48580},{\"end\":48604,\"start\":48596},{\"end\":48614,\"start\":48604},{\"end\":48627,\"start\":48614},{\"end\":48635,\"start\":48627},{\"end\":49010,\"start\":49000},{\"end\":49025,\"start\":49010},{\"end\":49035,\"start\":49025},{\"end\":49047,\"start\":49035},{\"end\":49057,\"start\":49047},{\"end\":49385,\"start\":49372},{\"end\":49392,\"start\":49385},{\"end\":49407,\"start\":49392},{\"end\":49417,\"start\":49407},{\"end\":49428,\"start\":49417},{\"end\":49439,\"start\":49428},{\"end\":49863,\"start\":49854},{\"end\":49874,\"start\":49863},{\"end\":50290,\"start\":50275},{\"end\":50299,\"start\":50290},{\"end\":50533,\"start\":50523},{\"end\":50539,\"start\":50533},{\"end\":50750,\"start\":50736},{\"end\":50763,\"start\":50750},{\"end\":50775,\"start\":50763},{\"end\":51130,\"start\":51121},{\"end\":51140,\"start\":51130},{\"end\":51150,\"start\":51140},{\"end\":51318,\"start\":51308},{\"end\":51543,\"start\":51529},{\"end\":51553,\"start\":51543},{\"end\":51728,\"start\":51715},{\"end\":51740,\"start\":51728},{\"end\":51750,\"start\":51740},{\"end\":51968,\"start\":51956},{\"end\":51976,\"start\":51968},{\"end\":51985,\"start\":51976},{\"end\":52007,\"start\":51985},{\"end\":52017,\"start\":52007},{\"end\":52031,\"start\":52017},{\"end\":52043,\"start\":52031},{\"end\":52063,\"start\":52043},{\"end\":52425,\"start\":52418},{\"end\":52432,\"start\":52425},{\"end\":52772,\"start\":52761},{\"end\":52783,\"start\":52772},{\"end\":53207,\"start\":53195},{\"end\":53216,\"start\":53207},{\"end\":53590,\"start\":53578},{\"end\":53599,\"start\":53590},{\"end\":53908,\"start\":53895},{\"end\":53916,\"start\":53908},{\"end\":54339,\"start\":54329},{\"end\":54350,\"start\":54339},{\"end\":54362,\"start\":54350},{\"end\":54373,\"start\":54362},{\"end\":54736,\"start\":54726},{\"end\":54747,\"start\":54736},{\"end\":54959,\"start\":54949},{\"end\":54969,\"start\":54959},{\"end\":54980,\"start\":54969},{\"end\":54992,\"start\":54980},{\"end\":55001,\"start\":54992},{\"end\":55011,\"start\":55001},{\"end\":55416,\"start\":55405},{\"end\":55614,\"start\":55606},{\"end\":55621,\"start\":55614},{\"end\":55627,\"start\":55621},{\"end\":55638,\"start\":55627},{\"end\":55646,\"start\":55638},{\"end\":55653,\"start\":55646},{\"end\":56025,\"start\":56015},{\"end\":56038,\"start\":56025},{\"end\":56418,\"start\":56404},{\"end\":56437,\"start\":56418},{\"end\":56908,\"start\":56900},{\"end\":56916,\"start\":56908},{\"end\":56923,\"start\":56916},{\"end\":56932,\"start\":56923},{\"end\":57147,\"start\":57139},{\"end\":57155,\"start\":57147},{\"end\":57164,\"start\":57155},{\"end\":57641,\"start\":57629},{\"end\":57902,\"start\":57889},{\"end\":58154,\"start\":58145},{\"end\":58165,\"start\":58154},{\"end\":58176,\"start\":58165},{\"end\":58186,\"start\":58176},{\"end\":58568,\"start\":58560},{\"end\":58574,\"start\":58568},{\"end\":58580,\"start\":58574},{\"end\":58840,\"start\":58832},{\"end\":58851,\"start\":58840},{\"end\":58859,\"start\":58851},{\"end\":59321,\"start\":59314},{\"end\":59328,\"start\":59321},{\"end\":59335,\"start\":59328},{\"end\":59342,\"start\":59335}]", "bib_venue": "[{\"end\":42666,\"start\":42613},{\"end\":43443,\"start\":43365},{\"end\":43887,\"start\":43835},{\"end\":45190,\"start\":45144},{\"end\":45826,\"start\":45764},{\"end\":47331,\"start\":47289},{\"end\":47747,\"start\":47685},{\"end\":48400,\"start\":48347},{\"end\":49180,\"start\":49127},{\"end\":49987,\"start\":49939},{\"end\":50898,\"start\":50845},{\"end\":52906,\"start\":52853},{\"end\":53337,\"start\":53285},{\"end\":54057,\"start\":53995},{\"end\":54514,\"start\":54452},{\"end\":55140,\"start\":55084},{\"end\":55774,\"start\":55722},{\"end\":56185,\"start\":56120},{\"end\":56617,\"start\":56564},{\"end\":57333,\"start\":57257},{\"end\":58307,\"start\":58255},{\"end\":59000,\"start\":58938},{\"end\":59483,\"start\":59421},{\"end\":42611,\"start\":42543},{\"end\":43005,\"start\":42969},{\"end\":43363,\"start\":43270},{\"end\":43833,\"start\":43766},{\"end\":44265,\"start\":44225},{\"end\":44491,\"start\":44449},{\"end\":44762,\"start\":44709},{\"end\":45142,\"start\":45081},{\"end\":45485,\"start\":45455},{\"end\":45762,\"start\":45685},{\"end\":46165,\"start\":46129},{\"end\":46477,\"start\":46412},{\"end\":46748,\"start\":46683},{\"end\":46990,\"start\":46974},{\"end\":47287,\"start\":47230},{\"end\":47683,\"start\":47606},{\"end\":48067,\"start\":48008},{\"end\":48345,\"start\":48277},{\"end\":48733,\"start\":48651},{\"end\":49125,\"start\":49057},{\"end\":49539,\"start\":49455},{\"end\":49937,\"start\":49874},{\"end\":50319,\"start\":50299},{\"end\":50521,\"start\":50479},{\"end\":50843,\"start\":50775},{\"end\":51156,\"start\":51150},{\"end\":51358,\"start\":51318},{\"end\":51589,\"start\":51553},{\"end\":51787,\"start\":51750},{\"end\":52085,\"start\":52063},{\"end\":52490,\"start\":52432},{\"end\":52851,\"start\":52783},{\"end\":53283,\"start\":53216},{\"end\":53656,\"start\":53599},{\"end\":53993,\"start\":53916},{\"end\":54450,\"start\":54373},{\"end\":54797,\"start\":54763},{\"end\":55082,\"start\":55011},{\"end\":55403,\"start\":55335},{\"end\":55720,\"start\":55653},{\"end\":56118,\"start\":56038},{\"end\":56505,\"start\":56437},{\"end\":56898,\"start\":56867},{\"end\":57255,\"start\":57164},{\"end\":57677,\"start\":57641},{\"end\":57887,\"start\":57829},{\"end\":58253,\"start\":58186},{\"end\":58612,\"start\":58580},{\"end\":58936,\"start\":58859},{\"end\":59419,\"start\":59342}]"}}}, "year": 2023, "month": 12, "day": 17}