{"id": 52307098, "updated": "2023-09-29 22:21:15.68", "metadata": {"title": "A Dataset for Document Grounded Conversations", "authors": "[{\"first\":\"Kangyan\",\"last\":\"Zhou\",\"middle\":[]},{\"first\":\"Shrimai\",\"last\":\"Prabhumoye\",\"middle\":[]},{\"first\":\"Alan W\",\"last\":\"Black\",\"middle\":[]}]", "venue": "EMNLP", "journal": "Proceedings of the 2018 Conference on Empirical Methods in Natural Language Processing", "publication_date": {"year": 2018, "month": null, "day": null}, "abstract": "This paper introduces a document grounded dataset for conversations. We define “Document Grounded Conversations” as conversations that are about the contents of a specified document. In this dataset the specified documents were Wikipedia articles about popular movies. The dataset contains 4112 conversations with an average of 21.43 turns per conversation. This positions this dataset to not only provide a relevant chat history while generating responses but also provide a source of information that the models could use. We describe two neural architectures that provide benchmark performance on the task of generating the next response. We also evaluate our models for engagement and fluency, and find that the information from the document helps in generating more engaging and fluent responses.", "fields_of_study": "[\"Computer Science\"]", "external_ids": {"arxiv": "1809.07358", "mag": "2949681671", "acl": "D18-1076", "pubmed": null, "pubmedcentral": null, "dblp": "conf/emnlp/ZhouPB18", "doi": "10.18653/v1/d18-1076"}}, "content": {"source": {"pdf_hash": "e51ad1057e540404f08314caa018abb47c82293f", "pdf_src": "ACL", "pdf_uri": "[\"https://www.aclweb.org/anthology/D18-1076.pdf\"]", "oa_url_match": true, "oa_info": {"license": "CCBY", "open_access_url": "https://www.aclweb.org/anthology/D18-1076.pdf", "status": "HYBRID"}}, "grobid": {"id": "e88318e07dd3120103221bedc6f27088b28f8df0", "type": "plain-text", "url": "s3://ai2-s2-pdf-extraction-prod/parse-results/s2orc_worker/e51ad1057e540404f08314caa018abb47c82293f.txt", "contents": "\nA Dataset for Document Grounded Conversations\nAssociation for Computational LinguisticsCopyright Association for Computational LinguisticsOctober 31 -November 4. 2018. 2018\n\nKangyan Zhou kangyanz@cs.cmu.edu \nCarnegie Mellon University\nPittsburghPAUSA\n\nShrimai Prabhumoye \nCarnegie Mellon University\nPittsburghPAUSA\n\nAlan W Black \nCarnegie Mellon University\nPittsburghPAUSA\n\nA Dataset for Document Grounded Conversations\n\nProceedings of the 2018 Conference on Empirical Methods in Natural Language Processing\nthe 2018 Conference on Empirical Methods in Natural Language ProcessingBrussels, BelgiumAssociation for Computational LinguisticsOctober 31 -November 4. 2018. 2018\nThis paper introduces a document grounded dataset for conversations. We define \"Document Grounded Conversations\" as conversations that are about the contents of a specified document. In this dataset the specified documents were Wikipedia articles about popular movies. The dataset contains 4112 conversations with an average of 21.43 turns per conversation. This positions this dataset to not only provide a relevant chat history while generating responses but also provide a source of information that the models could use. We describe two neural architectures that provide benchmark performance on the task of generating the next response. We also evaluate our models for engagement and fluency, and find that the information from the document helps in generating more engaging and fluent responses.\n\nIntroduction\n\nAt present, dialog systems are considered to be either task-oriented, where a specific task is the goal of the conversation (e.g. getting bus information or weather for a particular location); or non-task oriented where conversations are more for the sake of themselves, be it entertainment or passing the time. Ultimately, we want our agents to smoothly interleave between task-related information flow and casual chat for the given situation. There is a dire need of a dataset which caters to both these objectives.  provide a comprehensive list of available datasets for building end-to-end conversational agents. Datasets based on movie scripts (Lison and Tiedemann, 2016;Danescu-Niculescu-Mizil and Lee, 2011a) contain artificial conversations. The Ubuntu Dialogue Corpus  is based on technical support logs from the Ubuntu forum. The Frames dataset (Asri et al., 2017) was collected to solve the problem of frame tracking. These datasets do not provide grounding of the information presented in the conversations. Zhang et al. (2018) focuses on personas in dialogues: each worker has a set of predefined facts about the persona that they can talk about. Most of these datasets lack conversations with large number of on-topic turns.\n\nWe introduce a new dataset which addresses the concerns of grounding in conversation responses, context and coherence in responses. We present a dataset which has real human conversations with grounding in a document. Although our examples use Wikipedia articles about movies, we see the same techniques being valid for other external documents such as manuals, instruction booklets, and other informational documents. We build a generative model with and without the document information and find that the responses generated by the model with the document information is more engaging (+7.5% preference) and more fluent (+0.96 MOS). The perplexity also shows a 11.69 point improvement.\n\n\nThe Document Grounded Dataset\n\nTo create a dataset for document grounded conversations, we seek the following things: (1) A set of documents (2) Two humans chatting about the content of the document for more than 12 turns. We collected conversations about the documents through Amazon Mechanical Turk (AMT). We restrict the topic of the documents to be movierelated articles to facilitate the conversations. We initially experimented with different potential domains. Since movies are engaging and widely known, people actually stay on task when discussing them. In fact in order to make the task interesting, we offered a choice of movies to the participants so that they are invested in the task.\n\n\nDocument Set Creation\n\nWe choose Wikipedia (Wiki) 1 articles to create a set of documents D = {d 1 , . . . , d 30 } for grounding of conversations. We randomly select 30 movies, covering various genres like thriller, super-hero, animation, romantic, biopic etc. We extract the key information provided in the Wiki article and divide it into four separate sections. This was done to reduce the load of the users to read, absorb and discuss the information in the document. Hence, each movie document d i consists of four sections {s 1 , s 2 , s 3 , s 4 } corresponding to basic information and three key scenes of the movie. The basic information section s 1 contains data from the Wikipedia article in a standard form such as year, genre, director. It also includes a short introduction about the movie, ratings from major review websites, and some critical responses. Each of the key scene sections {s 2 , s 3 , s 4 } contains one short paragraph from the plot of the movie. Each paragraph contains on an average 7 sentences and 143 words. These paragraphs were extracted automatically from the original articles, and were then lightly edited by hand to make them of consistent size and detail. An example of the document is attached in Appendix.\n\n\nDataset Creation\n\nTo create a dataset of conversations which uses the information from the document, involves the participation of two workers. Hence, we explore two scenarios: (1) Only one worker has access to the document and the other worker does not and (2) Both the workers have access to the document. In both settings, they are given the common instructions of chatting for at least 12 turns.\n\nScenario 1: One worker has document. In this scenario, only one worker has access to the document. The other worker cannot see the document. The instruction to the worker with the document is: Tell the other user what the movie is, and try to persuade the other user to watch/not to watch the movie using the information in the document; and the instruction to the worker without the document is: After you are told the name of the movie, pretend you are interested in watching the movie, and try to gather all the information you need to make a decision whether to watch the movie in the end. An example of part of the dialogue for this user2: Hey have you seen the inception? user1: No, I have not but have heard of it.\n\nWhat is it about user2: It's about extractors that perform experiments using military technology on people to retrieve info about their targets. User 2: I thought The Shape of Water was one of Del Toro's best works. What about you? User 1: Did you like the movie? User 1: Yes, his style really extended the story. User 2: I agree. He has a way with fantasy elements that really helped this story be truly beautiful.  Table 2.\n\nWorkflow: When the two workers enter the chat-room, they are initially given only the first section on basic information s 1 of the document d i . After the two workers complete 3 turns (for the first section 6 turns is needed due to initial greetings), the users will be shown the next section. The users are encouraged to discuss information in the new section, but are not constrained to do so.\n\n\nDataset Statistics\n\nThe dataset consists of total 4112 conversations with an average of 21.43 turns. The number of conversations for scenario 1 is 2128 and for scenario 2 it is 1984. We consider a turn to be an exchange between two workers (say w1 and w 2 ). Hence an exchange of w 1 , w 2 , w 1 has 2 turns (w 1 , w 2 ) and (w 2 , w 1 ). We show the comparison of our dataset as CMU Document Grounded Conversations (CMU DoG) with other datasets in Table 3.  (Asri et al., 2017) 19,986 15  One of the salient features of CMUDoG dataset is that it has mapping of the conversation turns to each section of the document, which can then be used to model conversation responses. Another useful aspect is that we report the quality of the conversations in terms of how much the conversation adheres to the information in the document.\n\nSplit Criteria: We automatically measure the quality of the conversations using BLEU (Papineni et al., 2002) score. We use BLEU because we want to measure the overlap of the turns of the conversation with the sections of the document. Hence, a good quality conversation should use more information from the document than a low quality conversation. We divide our dataset into three ratings based on this measure. The BLEU score is calculated between all the utterances {x 1 , . . . , x n } of a conversation C i and the document d i corresponding to C i . We eliminate incomplete conversations that have less than 10 turns. The percentiles for the remaining conversations are shown in Table 5. We split the dataset into three ratings based on BLEU score.\n\nPercentile 20 40 60 80 99 BLEU 0.09 0.20 0.34 0.53 0.82 Table 5: The distribution of BLEU score for conversations with more than 10 turns.\n\nRating 1: Conversations are given a rating of 1 if their BLEU score is less than or equal to 0.1. We consider these conversations to be of low-quality.\n\nRating 2: All the conversations that do not fit in rating 1 and 3 are marked with a rating of 2.\n\nRating 3: Conversations are labeled with a rating of 3, only if the conversation has more than 12 turns and has a BLEU score larger than 0.587. This threshold was calculated by summing the mean (0.385) and the standard deviation (0.202) of BLEU scores of the conversations that do not belong rating 1. The average BLEU score for workers who have access to the document is 0.22 whereas the average BLEU score for the workers without access to the document is 0.03. This suggests that even if the workers had external knowledge about the movie, they have not extensively used it in the conversation. It also suggests that the workers with the document have not used the information from the document verbatim in the conversation. Table 4 shows the statistics on the total number of conversations, utterances, and average number of utterances per conversation and average length of utterances for all the three ratings.\n\n\nModels\n\nIn this section we discuss models which can leverage the information from the document for generating responses. We explore generative models for this purpose. Given a dataset X = {x 0 , . . . , x n } of utterances in a conversation C i , we consider two settings: (1) to generate a response x i+1 when given only the current utterance x i and (2) to generate a response x i+1 when given the corresponding section s i and the previous utterance x i .\n\n\nWithout section:\n\nWe use the sequence-tosequence model (Sutskever et al., 2014) to build our baseline model. Formally, let θ E represent the parameters of the encoder. Then the representation h x i of the current utterance x i is given by:\nh x i = Encoder(x i ; θ E )(1)\nSamples of x i+1 are generated as follows:\np(x|h x i ) = t p(x t |x <t , h x i )(2)\nwhere,x <t are the tokens generated beforex t . We also use global attention (Luong et al., 2015) with copy mechanism (See et al., 2017) to guide our generators to replace the unknown (UNK) tokens. We call this model SEQ.\n\nWith section: We extend the sequence-tosequence framework to include the section s i corresponding the current turn. We use the same encoder to encode both the utterance and the section. We get the representation h x i of the current utterance x i using Eq. 1. The representation of the section is given by:\nh s i = Encoder(s i ; θ E )(3)\nThe input at each time step t to the generative model is given\nby h t = [x t−1 ; h s ], where x t−1\nis the embedding of the word at the previous time step. We call this model SEQS.\n\nExperimental Setup: For both SEQ and SEQS model, we use a two-layer bidirectional LSTM as the encoder and a LSTM as the decoder. The dropout rate of the LSTM output is set to be 0.3. The size of hidden units for both LSTMs is 300. We set the word embedding size to be 100, since the size of vocabulary is relatively small 2 . The models are trained with adam (Kingma and Ba, 2014) optimizer with learning rate 0.001 until they converge on the validation set for the perplexity criteria. We use beam search with size 5 for response generation. We use all the data (i.e all the conversations regardless of the rating and scenario) for training and testing. The proportion of train/validation/test split is 0.8/0.05/0.15.\n\n\nEvaluation\n\nIn what follows, we first present an analysis of the dataset, then provide an automatic metric for evaluation of our models-perplexity and finally present the results of human evaluation of the generated responses for engagement and fluency.  Dataset analysis: We perform two kinds of automated evaluation to investigate the usefulness of the document in the conversation. The first one is to investigate if the workers use the information from the document in the conversation. The second analysis is to show that the document adds value to the conversation. Let the set of tokens in the current utterance x i be N , the set of tokens in the current section s i be M , the set of tokens in the previous three utterances be H, and the set of stop words be S. In scenario 1, we calculate the set operation (NW) as |((N ∩ M ) \\ H) \\ S|.\n\nLet the tokens that appear in all the utterances (x i , . . . , x i+k ) corresponding to the current section s i be K and the tokens that appear in all the utterances (x i , . . . , x i+p ) corresponding to the previous section s i−1 be P . In scenario 2, we calculate the set operation (NW) as |((K ∩M )\\P )\\S|.\n\nThe results in Table 6 show that people use the information in the new sections and are not fixated on old sections. It also shows that they use the information to construct the responses.\n\nPerplexity: To automatically evaluate the fluency of the models, we use perplexity measure.\n\nWe build a language model on the train set of responses using ngrams up to an order of 3 3 . The generated test responses achieve a perplexity of 21.8 for the SEQ model and 10.11 for the SEQS model. This indicates that including the sections of document helps in the generation process.\n\n\nHuman Evaluation\n\nWe also perform two kinds of human evaluations to evaluate the quality of predicted utterances -engagement and fluency. These experiments are performed on Amazon Mechanical Turk.\n\n\nEngagement:\n\nWe set up a pairwise comparison following Bennett (2005) to evaluate the engagement of the generated responses. The test presents the chat history (1 utterance) and then, in random order, its corresponding response produced by the SEQ and SEQS models. A third option \"No Preference\" was given to participants to mark no preference for either of the generated responses. The instruction given to the participants is \"Given the above chat history as context, you have to pick the one which can be best used as the response based on the engagingness.\" We randomly sample 90 responses from each model. Each response was annotated by 3 unique workers and we take majority vote as the final label. The result of the test is that SEQ generated responses were chosen only 36.4% times as opposed to SEQS generated responses which were chosen 43.9% and the \"No Preference\" option was chosen 19.6% of times. This result shows the information from the sections improves the engagement of the generated responses.\n\nFluency: The workers were asked to evaluate the fluency of the generated response on a scale of 1 to 4, where 1 is unreadable and 4 is perfectly readable. We randomly select 120 generated responses from each model and each response was annotated by 3 unique workers. The SEQ model got a low score of 2.88, contrast to the SEQS score of 3.84. This outcome demonstrates that the information in the section also helps in guiding the generator to produce fluent responses.\n\n\nConclusion\n\nIn this paper we introduce a crowd-sourced conversations dataset that is grounded in a predefined set of documents which is available for download 4 . We perform multiple automatic and human judgment based analysis to understand the value the information from the document provides to the generation of responses. The SEQS model which uses the information from the section to generate responses outperforms the SEQ model in the evaluation tasks of engagement, fluency and perplexity.\n\nTable 1 :\n1An example conversation for scenario 1. User \n1 does not have access to the document, while User 2 \ndoes. The full dialogue is attached in the Appendix. \n\n\n\nTable 2 :\n2An example conversation for scenario 2. Both User 1 and User 2 have access to the Wiki document. The full dialogue is attached in the Appendix. scenario is shown in Table 1. Scenario 2: Both workers have document. In this scenario, both the workers have access to the same Wiki document. The instruction given to the workers are: Discuss the content in the document with the other user, and show whether you like/dislike the movie. An example of the dialogue for this scenario is shown in\n\nTable 3 :\n3Comparison with other datasets. The average number of turns are calculated as the number of utterances divided by the number of conversations for each of the datasets.Rating 1 \nRating 2 \nRating 3 \nRating 2& 3 \nTotal # of conversations \n1443 \n2142 \n527 \n2669 \nTotal # of utterances \n28536 \n80104 \n21360 \n101464 \nAverage # utterances/conversation 19.77(13.68) 35.39(8.48) 40.53(12.92) 38.01(9.607) \nAverage length of utterance \n7.51(50.19) \n10.56(8.51) 16.57(15.23) 11.83(10.58) \n\n\n\nTable 4 :\n4The statistics of the dataset. Standard deviation in parenthesis.\n\nTable 6 :\n6The results of data analysis. LT refers to the average length of x i in scenario 1 and x i , . . . , x i+k in scenario 2.\nhttps://en.wikipedia.org\nThe total number of tokens is 46000, and we limit the vocabulary to be 10000 tokens.3  We use the SRILM toolkit(Stolcke, 2002) \nAcknowledgmentsThis work was funded by a fellowship from Robert Bosch, and in part by Facebook Inc. and Microsoft Corporation. This work was performed as a part of The Conversational Intelligence Challenge (ConvAI, NIPS 2017) and we would like to thank the ConvAI team. We are also grateful 4 https://www.github.com/festvox/datasets/CMU DoG to the anonymous reviewers for their constructive feedback and to Carolyn Penstein Rose, Shivani Poddar, Sreecharan Sankaranarayanan, Samridhi Shree Choudhary and Zhou Yu for valuable discussions at earlier stages of this work.\nFrames: A corpus for adding memory to goal-oriented dialogue systems. Layla El Asri, Hannes Schulz, Shikhar Sharma, Jeremie Zumer, Justin Harris, Emery Fine, Rahul Mehrotra, Kaheer Suleman, arXiv:1704.00057arXiv preprintLayla El Asri, Hannes Schulz, Shikhar Sharma, Jeremie Zumer, Justin Harris, Emery Fine, Rahul Mehrotra, and Kaheer Suleman. 2017. Frames: A corpus for adding memory to goal-oriented dialogue systems. arXiv preprint arXiv:1704.00057.\n\nLarge scale evaluation of corpus-based synthesizers: Results and lessons from the blizzard challenge. L Christina, Bennett, Ninth European Conference on Speech Communication and Technology. Christina L Bennett. 2005. Large scale evaluation of corpus-based synthesizers: Results and lessons from the blizzard challenge 2005. In Ninth European Conference on Speech Communication and Technol- ogy.\n\nChameleons in imagined conversations: A new approach to understanding coordination of linguistic style in dialogs. Cristian Danescu-Niculescu-Mizil, Lillian Lee, Proceedings of the 2nd Workshop on Cognitive Modeling and Computational Linguistics. the 2nd Workshop on Cognitive Modeling and Computational LinguisticsAssociation for Computational LinguisticsCristian Danescu-Niculescu-Mizil and Lillian Lee. 2011a. Chameleons in imagined conversations: A new approach to understanding coordination of lin- guistic style in dialogs. In Proceedings of the 2nd Workshop on Cognitive Modeling and Compu- tational Linguistics, pages 76-87. Association for Computational Linguistics.\n\nChameleons in imagined conversations: A new approach to understanding coordination of linguistic style in dialogs. Cristian Danescu-Niculescu-Mizil, Lillian Lee, Proceedings of the Workshop on Cognitive Modeling and Computational Linguistics. the Workshop on Cognitive Modeling and Computational LinguisticsCristian Danescu-Niculescu-Mizil and Lillian Lee. 2011b. Chameleons in imagined conversations: A new approach to understanding coordination of lin- guistic style in dialogs. In Proceedings of the Work- shop on Cognitive Modeling and Computational Linguistics, ACL 2011.\n\nAdam: A method for stochastic optimization. P Diederik, Jimmy Kingma, Ba, arXiv:1412.6980arXiv preprintDiederik P Kingma and Jimmy Ba. 2014. Adam: A method for stochastic optimization. arXiv preprint arXiv:1412.6980.\n\nOpensub-titles2016: Extracting large parallel corpora from movie and tv subtitles. Pierre Lison, Jörg Tiedemann, Pierre Lison and Jörg Tiedemann. 2016. Opensub- titles2016: Extracting large parallel corpora from movie and tv subtitles.\n\nRyan Lowe, Nissan Pow, Iulian Serban, Joelle Pineau, arXiv:1506.08909The ubuntu dialogue corpus: A large dataset for research in unstructured multi-turn dialogue systems. arXiv preprintRyan Lowe, Nissan Pow, Iulian Serban, and Joelle Pineau. 2015. The ubuntu dialogue corpus: A large dataset for research in unstructured multi-turn dia- logue systems. arXiv preprint arXiv:1506.08909.\n\nEffective approaches to attentionbased neural machine translation. Minh-Thang Luong, Hieu Pham, Christopher D Manning, arXiv:1508.04025arXiv preprintMinh-Thang Luong, Hieu Pham, and Christopher D Manning. 2015. Effective approaches to attention- based neural machine translation. arXiv preprint arXiv:1508.04025.\n\nBleu: a method for automatic evaluation of machine translation. Kishore Papineni, Salim Roukos, Todd Ward, Wei-Jing Zhu, Proceedings of the 40th annual meeting on association for computational linguistics. the 40th annual meeting on association for computational linguisticsAssociation for Computational LinguisticsKishore Papineni, Salim Roukos, Todd Ward, and Wei- Jing Zhu. 2002. Bleu: a method for automatic eval- uation of machine translation. In Proceedings of the 40th annual meeting on association for compu- tational linguistics, pages 311-318. Association for Computational Linguistics.\n\nGet to the point: Summarization with pointergenerator networks. Abigail See, J Peter, Christopher D Liu, Manning, Proc. ACL. ACLAbigail See, Peter J Liu, and Christopher D Manning. 2017. Get to the point: Summarization with pointer- generator networks. In Proc. ACL.\n\nA survey of available corpora for building data-driven dialogue systems. Iulian Vlad Serban, Ryan Lowe, Peter Henderson, Laurent Charlin, Joelle Pineau, arXiv:1512.05742arXiv preprintIulian Vlad Serban, Ryan Lowe, Peter Henderson, Lau- rent Charlin, and Joelle Pineau. 2015. A survey of available corpora for building data-driven dialogue systems. arXiv preprint arXiv:1512.05742.\n\nSrilm-an extensible language modeling toolkit. Andreas Stolcke, Seventh international conference on spoken language processing. Andreas Stolcke. 2002. Srilm-an extensible language modeling toolkit. In Seventh international confer- ence on spoken language processing.\n\nSequence to sequence learning with neural networks. Ilya Sutskever, Oriol Vinyals, Quoc V Le, Advances in neural information processing systems. Ilya Sutskever, Oriol Vinyals, and Quoc V Le. 2014. Sequence to sequence learning with neural net- works. In Advances in neural information process- ing systems, pages 3104-3112.\n\nPersonalizing dialogue agents: I have a dog. Saizheng Zhang, Emily Dinan, Jack Urbanek, Arthur Szlam, Douwe Kiela, Jason Weston, arXiv:1801.07243do you have pets too? arXiv preprintSaizheng Zhang, Emily Dinan, Jack Urbanek, Arthur Szlam, Douwe Kiela, and Jason Weston. 2018. Per- sonalizing dialogue agents: I have a dog, do you have pets too? arXiv preprint arXiv:1801.07243.\n", "annotations": {"author": "[{\"end\":252,\"start\":175},{\"end\":316,\"start\":253},{\"end\":374,\"start\":317}]", "publisher": "[{\"end\":88,\"start\":47},{\"end\":638,\"start\":597}]", "author_last_name": "[{\"end\":187,\"start\":183},{\"end\":271,\"start\":261},{\"end\":329,\"start\":324}]", "author_first_name": "[{\"end\":182,\"start\":175},{\"end\":260,\"start\":253},{\"end\":321,\"start\":317},{\"end\":323,\"start\":322}]", "author_affiliation": "[{\"end\":251,\"start\":209},{\"end\":315,\"start\":273},{\"end\":373,\"start\":331}]", "title": "[{\"end\":46,\"start\":1},{\"end\":420,\"start\":375}]", "venue": "[{\"end\":508,\"start\":422}]", "abstract": "[{\"end\":1474,\"start\":673}]", "bib_ref": "[{\"attributes\":{\"ref_id\":\"b5\"},\"end\":2166,\"start\":2139},{\"attributes\":{\"ref_id\":\"b2\"},\"end\":2205,\"start\":2166},{\"attributes\":{\"ref_id\":\"b0\"},\"end\":2364,\"start\":2345},{\"attributes\":{\"ref_id\":\"b13\"},\"end\":2529,\"start\":2510},{\"attributes\":{\"ref_id\":\"b0\"},\"end\":7800,\"start\":7781},{\"attributes\":{\"ref_id\":\"b8\"},\"end\":8260,\"start\":8237},{\"attributes\":{\"ref_id\":\"b12\"},\"end\":10758,\"start\":10734},{\"attributes\":{\"ref_id\":\"b7\"},\"end\":11131,\"start\":11111},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":11170,\"start\":11152},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":14501,\"start\":14487},{\"attributes\":{\"ref_id\":\"b11\"},\"end\":17938,\"start\":17923}]", "figure": "[{\"attributes\":{\"id\":\"tab_0\",\"type\":\"table\"},\"end\":16581,\"start\":16414},{\"attributes\":{\"id\":\"tab_1\",\"type\":\"table\"},\"end\":17082,\"start\":16582},{\"attributes\":{\"id\":\"tab_3\",\"type\":\"table\"},\"end\":17574,\"start\":17083},{\"attributes\":{\"id\":\"tab_4\",\"type\":\"table\"},\"end\":17652,\"start\":17575},{\"attributes\":{\"id\":\"tab_6\",\"type\":\"table\"},\"end\":17786,\"start\":17653}]", "paragraph": "[{\"end\":2728,\"start\":1490},{\"end\":3417,\"start\":2730},{\"end\":4118,\"start\":3451},{\"end\":5368,\"start\":4144},{\"end\":5770,\"start\":5389},{\"end\":6493,\"start\":5772},{\"end\":6920,\"start\":6495},{\"end\":7319,\"start\":6922},{\"end\":8150,\"start\":7342},{\"end\":8906,\"start\":8152},{\"end\":9046,\"start\":8908},{\"end\":9199,\"start\":9048},{\"end\":9297,\"start\":9201},{\"end\":10215,\"start\":9299},{\"end\":10676,\"start\":10226},{\"end\":10918,\"start\":10697},{\"end\":10992,\"start\":10950},{\"end\":11255,\"start\":11034},{\"end\":11564,\"start\":11257},{\"end\":11658,\"start\":11596},{\"end\":11776,\"start\":11696},{\"end\":12496,\"start\":11778},{\"end\":13345,\"start\":12511},{\"end\":13659,\"start\":13347},{\"end\":13849,\"start\":13661},{\"end\":13942,\"start\":13851},{\"end\":14230,\"start\":13944},{\"end\":14429,\"start\":14251},{\"end\":15445,\"start\":14445},{\"end\":15915,\"start\":15447},{\"end\":16413,\"start\":15930}]", "formula": "[{\"attributes\":{\"id\":\"formula_0\"},\"end\":10949,\"start\":10919},{\"attributes\":{\"id\":\"formula_1\"},\"end\":11033,\"start\":10993},{\"attributes\":{\"id\":\"formula_2\"},\"end\":11595,\"start\":11565},{\"attributes\":{\"id\":\"formula_3\"},\"end\":11695,\"start\":11659}]", "table_ref": "[{\"attributes\":{\"ref_id\":\"tab_1\"},\"end\":6919,\"start\":6912},{\"attributes\":{\"ref_id\":\"tab_3\"},\"end\":7778,\"start\":7771},{\"end\":8844,\"start\":8837},{\"end\":8971,\"start\":8964},{\"attributes\":{\"ref_id\":\"tab_4\"},\"end\":10034,\"start\":10027},{\"attributes\":{\"ref_id\":\"tab_6\"},\"end\":13683,\"start\":13676}]", "section_header": "[{\"attributes\":{\"n\":\"1\"},\"end\":1488,\"start\":1476},{\"attributes\":{\"n\":\"2\"},\"end\":3449,\"start\":3420},{\"attributes\":{\"n\":\"2.1\"},\"end\":4142,\"start\":4121},{\"attributes\":{\"n\":\"2.2\"},\"end\":5387,\"start\":5371},{\"attributes\":{\"n\":\"2.3\"},\"end\":7340,\"start\":7322},{\"attributes\":{\"n\":\"3\"},\"end\":10224,\"start\":10218},{\"end\":10695,\"start\":10679},{\"attributes\":{\"n\":\"4\"},\"end\":12509,\"start\":12499},{\"attributes\":{\"n\":\"4.1\"},\"end\":14249,\"start\":14233},{\"end\":14443,\"start\":14432},{\"attributes\":{\"n\":\"5\"},\"end\":15928,\"start\":15918},{\"end\":16424,\"start\":16415},{\"end\":16592,\"start\":16583},{\"end\":17093,\"start\":17084},{\"end\":17585,\"start\":17576},{\"end\":17663,\"start\":17654}]", "table": "[{\"end\":16581,\"start\":16426},{\"end\":17574,\"start\":17262}]", "figure_caption": "[{\"end\":17082,\"start\":16594},{\"end\":17262,\"start\":17095},{\"end\":17652,\"start\":17587},{\"end\":17786,\"start\":17665}]", "figure_ref": null, "bib_author_first_name": "[{\"end\":18584,\"start\":18579},{\"end\":18587,\"start\":18585},{\"end\":18600,\"start\":18594},{\"end\":18616,\"start\":18609},{\"end\":18632,\"start\":18625},{\"end\":18646,\"start\":18640},{\"end\":18660,\"start\":18655},{\"end\":18672,\"start\":18667},{\"end\":18689,\"start\":18683},{\"end\":19066,\"start\":19065},{\"end\":19482,\"start\":19474},{\"end\":19515,\"start\":19508},{\"end\":20159,\"start\":20151},{\"end\":20192,\"start\":20185},{\"end\":20659,\"start\":20658},{\"end\":20675,\"start\":20670},{\"end\":20921,\"start\":20915},{\"end\":20933,\"start\":20929},{\"end\":21073,\"start\":21069},{\"end\":21086,\"start\":21080},{\"end\":21098,\"start\":21092},{\"end\":21113,\"start\":21107},{\"end\":21532,\"start\":21522},{\"end\":21544,\"start\":21540},{\"end\":21564,\"start\":21551},{\"end\":21840,\"start\":21833},{\"end\":21856,\"start\":21851},{\"end\":21869,\"start\":21865},{\"end\":21884,\"start\":21876},{\"end\":22438,\"start\":22431},{\"end\":22445,\"start\":22444},{\"end\":22466,\"start\":22453},{\"end\":22714,\"start\":22708},{\"end\":22732,\"start\":22728},{\"end\":22744,\"start\":22739},{\"end\":22763,\"start\":22756},{\"end\":22779,\"start\":22773},{\"end\":23071,\"start\":23064},{\"end\":23341,\"start\":23337},{\"end\":23358,\"start\":23353},{\"end\":23374,\"start\":23368},{\"end\":23663,\"start\":23655},{\"end\":23676,\"start\":23671},{\"end\":23688,\"start\":23684},{\"end\":23704,\"start\":23698},{\"end\":23717,\"start\":23712},{\"end\":23730,\"start\":23725}]", "bib_author_last_name": "[{\"end\":18592,\"start\":18588},{\"end\":18607,\"start\":18601},{\"end\":18623,\"start\":18617},{\"end\":18638,\"start\":18633},{\"end\":18653,\"start\":18647},{\"end\":18665,\"start\":18661},{\"end\":18681,\"start\":18673},{\"end\":18697,\"start\":18690},{\"end\":19076,\"start\":19067},{\"end\":19085,\"start\":19078},{\"end\":19506,\"start\":19483},{\"end\":19519,\"start\":19516},{\"end\":20183,\"start\":20160},{\"end\":20196,\"start\":20193},{\"end\":20668,\"start\":20660},{\"end\":20682,\"start\":20676},{\"end\":20686,\"start\":20684},{\"end\":20927,\"start\":20922},{\"end\":20943,\"start\":20934},{\"end\":21078,\"start\":21074},{\"end\":21090,\"start\":21087},{\"end\":21105,\"start\":21099},{\"end\":21120,\"start\":21114},{\"end\":21538,\"start\":21533},{\"end\":21549,\"start\":21545},{\"end\":21572,\"start\":21565},{\"end\":21849,\"start\":21841},{\"end\":21863,\"start\":21857},{\"end\":21874,\"start\":21870},{\"end\":21888,\"start\":21885},{\"end\":22442,\"start\":22439},{\"end\":22451,\"start\":22446},{\"end\":22470,\"start\":22467},{\"end\":22479,\"start\":22472},{\"end\":22726,\"start\":22715},{\"end\":22737,\"start\":22733},{\"end\":22754,\"start\":22745},{\"end\":22771,\"start\":22764},{\"end\":22786,\"start\":22780},{\"end\":23079,\"start\":23072},{\"end\":23351,\"start\":23342},{\"end\":23366,\"start\":23359},{\"end\":23377,\"start\":23375},{\"end\":23669,\"start\":23664},{\"end\":23682,\"start\":23677},{\"end\":23696,\"start\":23689},{\"end\":23710,\"start\":23705},{\"end\":23723,\"start\":23718},{\"end\":23737,\"start\":23731}]", "bib_entry": "[{\"attributes\":{\"doi\":\"arXiv:1704.00057\",\"id\":\"b0\"},\"end\":18961,\"start\":18509},{\"attributes\":{\"id\":\"b1\"},\"end\":19357,\"start\":18963},{\"attributes\":{\"id\":\"b2\",\"matched_paper_id\":3101865},\"end\":20034,\"start\":19359},{\"attributes\":{\"id\":\"b3\",\"matched_paper_id\":3101865},\"end\":20612,\"start\":20036},{\"attributes\":{\"doi\":\"arXiv:1412.6980\",\"id\":\"b4\"},\"end\":20830,\"start\":20614},{\"attributes\":{\"id\":\"b5\"},\"end\":21067,\"start\":20832},{\"attributes\":{\"doi\":\"arXiv:1506.08909\",\"id\":\"b6\"},\"end\":21453,\"start\":21069},{\"attributes\":{\"doi\":\"arXiv:1508.04025\",\"id\":\"b7\"},\"end\":21767,\"start\":21455},{\"attributes\":{\"id\":\"b8\",\"matched_paper_id\":11080756},\"end\":22365,\"start\":21769},{\"attributes\":{\"id\":\"b9\",\"matched_paper_id\":8314118},\"end\":22633,\"start\":22367},{\"attributes\":{\"doi\":\"arXiv:1512.05742\",\"id\":\"b10\"},\"end\":23015,\"start\":22635},{\"attributes\":{\"id\":\"b11\",\"matched_paper_id\":1988103},\"end\":23283,\"start\":23017},{\"attributes\":{\"id\":\"b12\",\"matched_paper_id\":7961699},\"end\":23608,\"start\":23285},{\"attributes\":{\"doi\":\"arXiv:1801.07243\",\"id\":\"b13\"},\"end\":23986,\"start\":23610}]", "bib_title": "[{\"end\":19063,\"start\":18963},{\"end\":19472,\"start\":19359},{\"end\":20149,\"start\":20036},{\"end\":21831,\"start\":21769},{\"end\":22429,\"start\":22367},{\"end\":23062,\"start\":23017},{\"end\":23335,\"start\":23285}]", "bib_author": "[{\"end\":18594,\"start\":18579},{\"end\":18609,\"start\":18594},{\"end\":18625,\"start\":18609},{\"end\":18640,\"start\":18625},{\"end\":18655,\"start\":18640},{\"end\":18667,\"start\":18655},{\"end\":18683,\"start\":18667},{\"end\":18699,\"start\":18683},{\"end\":19078,\"start\":19065},{\"end\":19087,\"start\":19078},{\"end\":19508,\"start\":19474},{\"end\":19521,\"start\":19508},{\"end\":20185,\"start\":20151},{\"end\":20198,\"start\":20185},{\"end\":20670,\"start\":20658},{\"end\":20684,\"start\":20670},{\"end\":20688,\"start\":20684},{\"end\":20929,\"start\":20915},{\"end\":20945,\"start\":20929},{\"end\":21080,\"start\":21069},{\"end\":21092,\"start\":21080},{\"end\":21107,\"start\":21092},{\"end\":21122,\"start\":21107},{\"end\":21540,\"start\":21522},{\"end\":21551,\"start\":21540},{\"end\":21574,\"start\":21551},{\"end\":21851,\"start\":21833},{\"end\":21865,\"start\":21851},{\"end\":21876,\"start\":21865},{\"end\":21890,\"start\":21876},{\"end\":22444,\"start\":22431},{\"end\":22453,\"start\":22444},{\"end\":22472,\"start\":22453},{\"end\":22481,\"start\":22472},{\"end\":22728,\"start\":22708},{\"end\":22739,\"start\":22728},{\"end\":22756,\"start\":22739},{\"end\":22773,\"start\":22756},{\"end\":22788,\"start\":22773},{\"end\":23081,\"start\":23064},{\"end\":23353,\"start\":23337},{\"end\":23368,\"start\":23353},{\"end\":23379,\"start\":23368},{\"end\":23671,\"start\":23655},{\"end\":23684,\"start\":23671},{\"end\":23698,\"start\":23684},{\"end\":23712,\"start\":23698},{\"end\":23725,\"start\":23712},{\"end\":23739,\"start\":23725}]", "bib_venue": "[{\"end\":18577,\"start\":18509},{\"end\":19151,\"start\":19087},{\"end\":19604,\"start\":19521},{\"end\":20277,\"start\":20198},{\"end\":20656,\"start\":20614},{\"end\":20913,\"start\":20832},{\"end\":21238,\"start\":21138},{\"end\":21520,\"start\":21455},{\"end\":21973,\"start\":21890},{\"end\":22490,\"start\":22481},{\"end\":22706,\"start\":22635},{\"end\":23143,\"start\":23081},{\"end\":23428,\"start\":23379},{\"end\":23653,\"start\":23610},{\"end\":19674,\"start\":19606},{\"end\":20343,\"start\":20279},{\"end\":22043,\"start\":21975},{\"end\":22495,\"start\":22492}]"}}}, "year": 2023, "month": 12, "day": 17}