{"id": 52948198, "updated": "2023-11-11 03:55:38.421", "metadata": {"title": "Joint Computation and Communication Cooperation for Energy-Efficient Mobile Edge Computing", "authors": "[{\"first\":\"Xiaowen\",\"last\":\"Cao\",\"middle\":[]},{\"first\":\"Feng\",\"last\":\"Wang\",\"middle\":[]},{\"first\":\"Jie\",\"last\":\"Xu\",\"middle\":[]},{\"first\":\"Rui\",\"last\":\"Zhang\",\"middle\":[]},{\"first\":\"Shuguang\",\"last\":\"Cui\",\"middle\":[]}]", "venue": "IEEE Internet of Things Journal", "journal": "IEEE Internet of Things Journal", "publication_date": {"year": 2019, "month": null, "day": null}, "abstract": "This paper proposes a novel user cooperation approach in both computation and communication for mobile edge computing (MEC) systems to improve the energy efficiency for latency-constrained computation. We consider a basic three-node MEC system consisting of a user node, a helper node, and an access point (AP) node attached with an MEC server, in which the user has latency-constrained and computation-intensive tasks to be executed. We consider two different computation offloading models, namely, the partial and binary offloading, respectively. For partial offloading, the tasks at the user are divided into three parts that are executed at the user, helper, and AP, respectively; while for binary offloading, the tasks are executed as a whole only at one of three nodes. Under this setup, we focus on a particular time block and develop an efficient four-slot transmission protocol to enable the joint computation and communication cooperation. Besides the local task computing over the whole block, the user can offload some computation tasks to the helper in the first slot, and the helper cooperatively computes these tasks in the remaining time; while in the second and third slots, the helper works as a cooperative relay to help the user offload some other tasks to the AP for remote execution in the fourth slot. For both cases with partial and binary offloading, we jointly optimize the computation and communication resources allocation at both the user and the helper (i.e., the time and transmit power allocations for offloading, and the central process unit frequencies for computing), so as to minimize their total energy consumption while satisfying the user’s computation latency constraint. Although the two problems are nonconvex in general, we develop efficient algorithms to solve them optimally. Numerical results show that the proposed joint computation and communication cooperation approach significantly improves the computation capacity and energy efficiency at the user and helper, as compared to other benchmark schemes without such a joint design.", "fields_of_study": "[\"Computer Science\",\"Mathematics\"]", "external_ids": {"arxiv": null, "mag": "2963644017", "acl": null, "pubmed": null, "pubmedcentral": null, "dblp": "journals/iotj/CaoWXZC19", "doi": "10.1109/jiot.2018.2875246"}}, "content": {"source": {"pdf_hash": "cdb2a32822a21dba84568038a817e71979036766", "pdf_src": "Arxiv", "pdf_uri": "[\"https://arxiv.org/pdf/1805.05906v2.pdf\"]", "oa_url_match": true, "oa_info": {"license": null, "open_access_url": "http://arxiv.org/pdf/1805.05906", "status": "GREEN"}}, "grobid": {"id": "e54a51a84ca62fb23c24e98c117eb17d98e1b4f1", "type": "plain-text", "url": "s3://ai2-s2-pdf-extraction-prod/parse-results/s2orc_worker/cdb2a32822a21dba84568038a817e71979036766.txt", "contents": "\nJoint Computation and Communication Cooperation for Energy-Efficient Mobile Edge Computing\nMay 7-11. 2018\n\nStudent Member, IEEEXiaowen Cao \nMember, IEEEFeng Wang fengwang13@gdut.edu.cn \nMember, IEEEJie Xu jiexu@gdut.edu.cn.r.zhangiswiththe \nFellow, IEEERui Zhang elezhang@nus.edu.sg.s.cuiiswiththe \nFellow, IEEEShuguang Cui \nX Cao \nF Wang \nJ Xu \n\nSchool of Information Engineering\nDepartment of Electrical and Computer En-gineering\nGuangdong University of Technology\n510006GuangzhouChina\n\n\nShenzhen Research Institute of Big Data and School of Science and Engineering\nNational University of Singapore\n117583Singapore\n\n\nDepartment of Electrical and Computer Engineering\nChinese University of Hong Kong\n518172ShenzhenChina\n\n\nUniversity of California\n95616DavisCAUSA\n\nJoint Computation and Communication Cooperation for Energy-Efficient Mobile Edge Computing\n\nInternational Symposium on Modeling and Optimization in Mobile, Ad Hoc, and Wireless Networks Workshop on Edge and Fog Computing for Intelligent IoT Applications\nShanghai, China1May 7-11. 2018arXiv:1805.05906v2 [cs.IT] 9 Oct 2018 1 Part of this paper has been presented at theIndex Terms-Mobile edge computing (MEC)joint com- putation and communication cooperationresource allocationcomputation offloading\nThis paper proposes a novel user cooperation approach in both computation and communication for mobile edge computing (MEC) systems to improve the energy efficiency for latency-constrained computation. We consider a basic three-node MEC system consisting of a user node, a helper node, and an access point (AP) node attached with an MEC server, in which the user has latency-constrained and computation-intensive tasks to be executed. We consider two different computation offloading models, namely the partial and binary offloading, respectively. For partial offloading, the tasks at the user are divided into three parts that are executed at the user, helper, and AP, respectively; while for binary offloading, the tasks are executed as a whole only at one of three nodes. Under this setup, we focus on a particular time block and develop an efficient fourslot transmission protocol to enable the joint computation and communication cooperation. Besides the local task computing over the whole block, the user can offload some computation tasks to the helper in the first slot, and the helper cooperatively computes these tasks in the remaining time; while in the second and third slots, the helper works as a cooperative relay to help the user offload some other tasks to the AP for remote execution in the fourth slot. For both cases with partial and binary offloading, we jointly optimize the computation and communication resources allocation at both the user and the helper (i.e., the time and transmit power allocations for offloading, and the central process unit (CPU) frequencies for computing), so as to minimize their total energy consumption while satisfying the user's computation latency constraint. Although the two problems are non-convex in general, we develop efficient algorithms to solve them optimally. Numerical results show that the proposed joint computation and communication cooperation approach significantly improves the computation capacity and energy efficiency at the user and helper, as compared to other benchmark schemes without such a joint design.\n\nI. INTRODUCTION\n\nRecent advancements in the fifth-generation (5G) cellular technologies have enabled various new applications such as the augmented reality (AR), autonomous driving, and Internet of things (IoT). These applications demand ultra-low-latency communication, computation, and control among a large number of wireless devices (e.g., sensors and actuators) [2]. In practice, the real-time computation tasks to be executed can be quite intensive, but wireless devices are generally of small size and only have limited communication, computation, and storage resources (see, e.g., [3]). Therefore, how to enhance their computation capabilities and reduce the computation latency is one crucial but challenging issue to be tackled for making these 5G applications a reality.\n\nConventionally, mobile cloud computing (MCC) has been widely adopted to enhance wireless devices' computation capabilities, by moving their computing and data storage to the remote centralized cloud [4]. However, as the cloud servers are normally distant from wireless devices, MCC may not be able to meet the stringent computation latency requirements for emerging 5G applications. To overcome such limitations, mobile edge computing (MEC) has been recently proposed as a new solution to provide cloud-like computing at the edge of wireless networks (e.g., access points (APs) and cellular base stations (BSs)), by deploying distributed MEC servers therein [3]- [9]. In MEC, wireless devices can offload computation-intensive and latency-critical tasks to APs/BSs in close proximity for remote execution, thus achieving much lower computation latency.\n\nThe computation offloading design in MEC systems critically relies on tractable computation task models. Two widely adopted task models in the MEC literature are binary and partial offloading, respectively [6], [7]. In binary offloading, the computation tasks are not partitionable, and thus should be executed as a whole via either local computing at the user or offloading to the MEC server. This practically corresponds to highly integrated or relatively simple tasks such as those in speech recognition and natural language translation. In contrast, for partial offloading, the computation tasks need to be partitioned into two or more independent parts, which can be executed in parallel by local computing and offloading. This corresponds to applications with multiple fine-grained procedures/components, in, e.g., AR applications [7]. Based on the binary and partial offloading models, the prior works (see, e.g., [9]- [17]) investigated the joint computation and communication resources allocation to improve the performance of MEC.\n\nFor example, [10] and [11] considered a single-user MEC system with dynamic task arrivals and channel fading, in which the user jointly optimizes the local computing or offloading decisions to minimize the computation latency, subject to the computation and communication resource constraints. [12]- [14] investigated the energy-efficient design in multiuser MEC systems with multiple users offloading their respective tasks to a single AP/BS for execution, in which the objective is to minimize the users' energy consumption while ensuring their computation latency requirements. Furthermore, [15]- [17] proposed wireless powered MEC systems by integrating the emerging wireless power transfer (WPT) technology into MEC for self-sustainable computing, where the AP employs WPT to power the users' local computing and offloading.\n\nDespite the recent research progress, multiuser MEC designs still face several technical challenges. First, the computation resources at the MEC server and the communication resources at the AP should be shared among the activelycomputing users. When the user number becomes large, the computation and communication resources allocated to each user are fundamentally limited, thus compromising the benefit of MEC. Next, due to the signal propagation loss over distances, far-apart users may spend much more communication resources than nearby users for offloading, which results in a near-far user fairness issue. Note that the 5G networks are expected to consist of massive wireless devices with certain computation and communication resources. Due to the burst nature of wireless traffic, each active device is highly likely to be surrounded by some idle devices with unused or additional resources. As such, in this paper we propose a novel joint computation and communication cooperation approach in multiuser MEC systems, such that the nearby users are enabled as helpers to share their computation and communication resources to help actively-computing users, thereby improve the MEC computation performance.\n\nIn this paper, we consider a basic three-node MEC system with user cooperation, which consists of a user node, a helper node, and an AP node attached with an MEC server. Here, the helper node can be an IoT sensor, a smart phone, or a laptop, which is nearby and has certain computation and communication resources. 1 We focus on the user's latency-constrained computation within a given time block. To implement the joint computation and communication cooperation, the block is divided into four time slots. Specifically, in the first slot, the user offloads some computation tasks to the helper for remote execution. In the second and third slots, the helper acts as a decode-and-forward (DF) relay to help the user offload some other computation tasks to the AP, for remote execution at the MEC server in the fourth slot. Under this setup, we pursue an energy-efficient user cooperation MEC design for both the partial and binary offloading cases, by jointly optimizing the computation and communication resource allocations. The main results of this paper are summarized as follows.\n\n• First, for the partial offloading case, the user's computation tasks are partitioned into three parts for local computation, offloading to helper, and offloading to AP, respectively. Towards minimizing the total energy consumption at both the user and the helper subject to the user's computation latency constraint, we jointly optimize the task partition of the user, the central process unit (CPU) frequencies for local computing at both the user and the helper, as well as the time and transmit power allocations for offloading. The non-convex problem of interests in general can be reformulated into a convex one. Leveraging the Lagrange duality method, we obtain the globally optimal solution in a semi-closed form. • Next, for the binary offloading case, the user should execute the non-partitionable computation tasks by choosing one among three computation modes, i.e., the local computing at the user, computation cooperation (offloading to the helper), and communication cooperation (offloading to the AP). Solving the resultant latency-constrained energy minimization problem, we develop an efficient optimal algorithm, by firstly choosing the computation mode and then optimizing the corresponding joint computation and communication resources allocation. • Finally, extensive numerical results show that the proposed joint computation and communication cooperation approach achieves significant performance gains in terms of both the computation capacity and the system energy efficiency, compared with other benchmark schemes without such a joint design.\n\nIt is worth noting that there have been prior studies on communication cooperation (see, e.g., [18]- [24]) or computation cooperation [25]- [29], respectively. On one hand, the cooperative communication via relaying has been extensively investigated in wireless communication systems to increase the communication rate and improve the communication reliability [20], [21], and applied in various other setups such as the wireless powered communication [22] and the wireless powered MEC systems [24]. On the other hand, cooperative computation has emerged as a viable technique in MEC systems, which enables end users to exploit computation resources at nearby wireless devices (instead of APs or BSs). For example, in the so-called device-to-device (D2D) fogging [28] and peerto-peer (P2P) cooperative computing [29], users with intensive computing tasks can offload all or part of the tasks to other idle users via D2D or P2P communications for execution. Similar computation task sharing among wireless devices has also been investigated in mobile social networks with crowdsensing [25] and in mobile wireless sensor networks [26], [27] for data fusion. However, different from these existing works with either communication or computation cooperation, this work is the first to pursue a joint computation and communication cooperation approach, by unifying both of them for further improving the user's computation performance. Also note that this work with user cooperation is different from the prior works on multiuser MEC systems [12]- [14], in which multiple users offload their own computation tasks to the AP/BS for execution, without user cooperation considered.\n\nThe remainder of this paper is organized as follows. Section II introduces the system model. Section III formulates the latency-constrained energy minimization problems under the partial and binary offloading models, respectively. Sections IV and V present the optimal solutions to the two problems of our interests, respectively. Section VI provides numerical results, followed by the conclusion in Section VII.\n\n\nII. SYSTEM MODEL\n\nAs shown in Fig. 1, we consider a basic three-node MEC system consisting of one user node, one helper node, and one AP node with an MEC server integrated, in which the three nodes are each equipped with one single antenna. We focus on a time block with duration T > 0, where the user needs to successfully execute computation tasks with L > 0 task input-bits within this block. By considering a latency-critical application, we assume that the block duration T is smaller than the channel coherence time, such that the channel power gain remains unchanged within the block of interest. Such an assumption has been commonly adopted in prior works [12]- [17]. It is further assumed that there is a central controller that is able to collect the global channel state information (CSI), and computation-related information for the three nodes; accordingly, the central controller can design and coordinate the computation and communication cooperation among the three nodes. This serves as a performance upper bound (or energy consumption lower bound) for practical cases when only partial CSI and computation-related information are known.\n\nSpecifically, without loss of generality, the L task input-bits can be divided into three parts intended for local computing, offloading to helper, and offloading to AP, respectively. Let l u ≥ 0, l h ≥ 0, and l a ≥ 0 denote the numbers of task inputbits for local computing at the user, offloading to the helper, and offloading to the AP, respectively. We then have\nl u + l h + l a = L.(1)\nConsider the two cases with partial offloading and binary offloading, respectively. In partial offloading, the computation task can be arbitrarily partitioned into subtasks. By assuming the number of subtasks are sufficiently large in this case, it is reasonable to approximate l u , l h , and l a as real numbers between 0 and L subject to (1). In binary offloading, l u , l h , and l a can only be set as 0 or L, and there is only one variable among them equal to L due to (1).\n\n\nA. MEC Protocol With Joint Computation and Communication Cooperation\n\nAs shown in Fig. 2, the duration-T block is generally divided into four slots for joint computation and communication cooperation. In the first slot with duration τ 1 ≥ 0, the user offloads the l h task input-bits to the helper, and the helper can then execute them in the remaining time with duration T − τ 1 . In the second and third slots, the helper acts as a DF relay to help the user offload l a task input-bits to the AP. In the second slot with duration τ 2 ≥ 0, the user transmits wireless signals containing the l a task input-bits to both the AP and the helper simultaneously. After successfully decoding the received task input-bits, the helper forwards them to the AP in the third slot with duration τ 3 ≥ 0. After decoding the signals from the user and the helper, the MEC server can remotely execute the offloaded tasks in the fourth time slot with duration τ 4 ≥ 0.\n\nAs the computation results are normally of much smaller size than the input bits, the time for downloading the results to the user is negligible compared to the offloading time. Thus, we ignore the downloading time in this paper. In order to ensure the computation tasks to be successfully executed before the end of this block, we have the following time constraint\nτ 1 + τ 2 + τ 3 + τ 4 ≤ T.(2)\n\nB. Computation Offloading\n\nIn this subsection, we discuss the computation offloading from the user to the helper and the AP, respectively. 1) Computation Offloading to Helper: In the first slot, the user offloads l h task input-bits to the helper with transmit power P 1 ≥ 0. Let h 01 > 0 denote the channel power gain from the user to the helper, and B the system bandwidth. Accordingly, the achievable data rate (in bits/sec) for offloading from the user to the helper is given by\nr 01 (P 1 ) = B log 2 1 + P 1 h 01 Γσ 2 1 ,(3)\nwhere σ 2 1 represents the power of additive white Gaussian noise (AWGN) at the helper, and Γ ≥ 1 is a constant term accounting for the gap from the channel capacity due to a practical modulation and coding scheme (MCS). For simplicity, Γ = 1 is assumed throughout this paper. Consequently, we have the number l h of task input-bits as\nl h = τ 1 r 01 (P 1 ).(4)\nFurthermore, let P u,max denote the maximum transmit power at the user, and thus we have 0 ≤ P 1 ≤ P u,max . For computation offloading, we consider the user's transmission energy as the dominant energy consumption and ignore the energy consumed by circuits in its radio-frequency (RF) chains, baseband signal processing, etc. Therefore, in the first slot, the energy consumption for the user to offload l h task input-bits to the helper is given by\nE offl 1 = τ 1 P 1 .(5)\n2) Computation Offloading to AP Assisted by Helper: In the second and third slots, the helper acts as a DF relay to help the user offload l a task input-bits to the AP. Denote by 0 ≤ P 2 ≤ P u,max the user's transmit power in the second slot. In this case, the achievable data rate from the user to the helper is given by r 01 (P 2 ) with r 01 (·) defined in (3). Denoting h 0 > 0 as the channel power gain from the user to the AP, the achievable data rate from the user to the AP is\nr 0 (P 2 ) = B log 2 1 + P 2 h 0 σ 2 0 ,(6)\nwhere σ 2 0 is the noise power at the AP receiver. After successfully decoding the received message, the helper forwards it to the AP in the third slot with the transmit power 0 ≤ P 3 ≤ P h,max , where P h,max denotes the maximum transmit power at the helper. Let h 1 > 0 denote the channel power gain from the helper to the AP. The achievable data rate from the helper to the AP is thus\nr 1 (P 3 ) = B log 2 1 + P 3 h 1 σ 2 0 .(7)\nBy combining the second and third slots, the number of l a task input-bits offloaded to the AP via a DF relay (the helper) should satisfy [19]- [21] l a = min (τ 2 r 0 (P 2 ) + τ 3 r 1 (P 3 ), τ 2 r 01 (P 2 )) .\n\nAs in (5), we consider the user's and helper's transmission energy consumption for offloading as the dominant energy consumption in both the second and third slots. Therefore, we have\nE offl 2 = τ 2 P 2 (9) E offl 3 = τ 3 P 3 .(10)\n\nC. Computing at User, Helper, and AP\n\nIn the subsection, we explain the computing models at the user, the helper, and the AP, respectively.\n\n\n1) Local Computing at User:\n\nThe user executes the computation tasks with l u task input-bits within the whole block. In practice, the number of CPU cycles for executing a computation task is highly dependent on various factors such as the specific applications, the number of task input-bits, as well as the hardware (e.g., CPU and memory) architectures at the computing device [30]. To characterize the most essential computation and communication tradeoff and as commonly adopted in the literature (e.g., [10]- [16]), we consider that the number of CPU cycles for this task is a linear function with respect to the number of task input-bits, where c u denotes the number of CPU cycles for computing each one task inputbit at the user. Also, let f u,n denote the CPU frequency for the n-th cycle, where n ∈ {1, . . . , c u l u }. Note that the CPU frequency f u,n is constrained by a maximum value, denoted by f u,max , i.e.,\nf u,n ≤ f u,max , ∀n ∈ {1, . . . , c u l u }.(11)\nAs the local computing for the l u task input-bits should be successfully accomplished before the end of the block, we have the following computation latency requirement\nculu n=1 1 f u,n ≤ T.(12)\nAccordingly, the user's energy consumption for local computing is [7], [15] E comp\nu = culu n=1 κ u f 2 u,n ,(13)\nwhere κ u denotes the effective capacitance coefficient that depends on the chip architecture at the user [30]. It has been shown in [15,Lemma 1] that to save the computation energy consumption with a computation latency requirement, it is optimal to set the CPU frequencies to be identical for different CPU cycles. By using this fact and letting the constraint in (12) be met with strict equality (for minimizing the computation energy consumption), we have\nf u,1 = f u,2 = ... = f u,culu = c u l u /T.(14)\nSubstituting (14) into (13), the user's corresponding energy consumption for local computing is re-expressed as\nE comp u = κ u c 3 u l 3 u T 2 .(15)\nCombining (14) with the maximum CPU frequency constraint in (11), it follows that\nc u l u ≤ T f u,max .(16)\n2) Cooperative Computing at Helper: After receiving the offloaded l h task input-bits in the first time slot, the helper executes the tasks during the remaining time with duration (T − τ 1 ). Let f h,n and f h,max denote the CPU frequency for the n-th CPU cycle and the maximum CPU frequency at the helper, respectively. Similarly as for the local computing at the user, it is optimal for helper to set the CPU frequency for the n-th CPU cycle as\nf h,n = c h l h /(T − τ 1 ), n ∈ {1, . . . , c h l h },\nwhere c h is the number of CPU cycles for computing one taskinput bit at the helper. Accordingly, the energy consumption for cooperative computation at the helper is given by\nE comp h = κ h c 3 h l 3 h (T − τ 1 ) 2 ,(17)\nwhere κ h is the effective capacitance coefficient of the helper. Similarly as in (16), we have the constraint on the number of task input-bits as\nc h l h ≤ (T − τ 1 )f h,max ,(18)\nwhere f h,max denotes the maximum CPU frequency for the helper.\n\n\n3) Remote Computing at AP (MEC Server):\n\nIn the fourth slot, the MEC server at the AP executes the offloaded l a task input-bits. In order to minimize the remote execution, the MEC server executes the offloaded tasks at its maximal CPU frequency, denoted by f a,max . Hence, the time duration τ 4 for the MEC server to execute the l a offloaded bits is\nτ 4 = c a l a /f a,max ,(19)\nwhere c a represents the number of CPU cycles required for computing one task-input bit at the AP. By substituting (19) into (2), the time allocation constraint is re-expressed as\nτ 1 + τ 2 + τ 3 + c a l a /f a,max ≤ T.(20)\n\nIII. PROBLEM FORMULATION\n\nIn this paper, we pursue an energy-efficient design for the three-node MEC system. As the AP normally has reliable power supply, we focus on the energy consumption at the wireless devices side (i.e., the user and helper) as the performance metric. In particular, we aim to minimize the total energy consumption at both the user and the helper (i.e.,\n3 i=1 E offl i + E comp u + E comp h )\n, subject to the user's computation latency constraint T , by optimizing the task partition of the user, as well as the joint computation and communication resources allocation. The design variables include the time allocation vector of the slots τ [τ 1 , τ 2 , τ 3 ], the user's task partition vector l [l u , l h , l a ], and the transmit power allocation vector P [P 1 , P 2 , P 3 ] for offloading of the user and helper.\n\nIn the case with partial offloading, the latency-constrained energy minimization problem is formulated as (16), (18), and (20),\n(P1) : min P ,τ ,l κ u c 3 u l 3 u T 2 + κ h c 3 h l 3 h (T − τ 1 ) 2 + 3 i=1 τ i P i (21a) s.t. l h ≤ τ 1 r 01 (P 1 ) (21b) l a ≤ min τ 2 r 0 (P 2 ) + τ 3 r 1 (P 3 ), τ 2 r 01 (P 2 ) (21c) 0 ≤ P j ≤ P u,max , ∀j ∈ {1, 2} (21d) 0 ≤ P 3 ≤ P h,max (21e) 0 ≤ τ i ≤ T, ∀i ∈ {1, 2, 3} (21f) l u ≥ 0, l h ≥ 0, l a ≥ 0 (21g) (1),\nwhere (1) denotes the task partition constraint, (16) and (18) are the maximum CPU frequency constraints at the user and the helper, respectively, (20) denotes the time allocation constraint, (21b) and (21c) denote the constraints for the numbers of the offloaded bits from the user to the helper and to the AP, respectively. Note that in problem (P1), we replace the two equalities in (4) and (8) as two inequality constraints (21b) and (21c). It is immediate that constraints (21b) and (21c) should be met with strict equality at optimality of problem (P1). Also note that problem (P1) is non-convex, due to the coupling of τ i and P i in the objective function (21a) and the constraints (21b) and (21c). Nonetheless, in Section IV we will transform (P1) into an equivalent convex problem and then present an efficiently algorithm to obtain the optimal solution of problem (P1) in a semi-closed form.\n\nIn the case with binary offloading, the latency-constrained energy minimization problem is formulated as (16), (18), (20), and (21b-f).\n(P2) : min P ,τ ,l κ u c 3 u l 3 u T 2 + κ h c 3 h l 3 h (T − τ 1 ) 2 + 3 i=1 τ i P i (22a) s.t. l u ∈ {0, L}, l h ∈ {0, L}, l a ∈ {0, L} (22b) (1),\nNote that problem (P2) is a mixed-integer nonlinear program (MINLP) [31] due to the involvement of integer variables l u , l h , and l a . In Section V, we will develop an efficient algorithm to solve problem (P2) optimally by examining three computation modes, respectively.\n\nA. Feasibility of (P1) and (P2) Before solving problems (P1) and (P2), we first check their feasibility to determine whether the MEC system of interests can support the latency-constrained task execution or not. Let L (1) max and L (2) max denote the maximum numbers of task inputbits supported by the MEC system within the duration-T block under the partial and binary offloading cases, respectively.\nEvidently, if L (1) max ≥ L (or L (2)\nmax ≥ L), then problem (P1) (or (P2)) is feasible; otherwise, the corresponding problem is not feasible. Therefore, the feasibility checking procedures of problems (P1) and (P2) correspond to determining L \n\nmax of task input-bits is attained when the three nodes fully use their available communication and computation resources. This corresponds to setting as P 1 = P 2 = P u,max , P 3 = P h,max , and letting the constraints (16), (18), (20), and (21c) be met with the strict equality in problem (P1). As a result, L\n\nmax is the optimal value of the following problem:\nL (1) max max τ ,l l u + l h + l a(23)\ns.t. τ 1 + τ 2 + τ 3 + c a l a /f a,max = T l h ≤ τ 1 r 01 (P u,max ), l a ≤ τ 2 r 01 (P u,max )\nc u l u /T = f u,max , c h l h /(T − τ 1 ) = f h,max τ 2 r 0 (P u,max ) + τ 3 r 1 (P h,max ) = τ 2 r 01 (P u,max ) (21f) and (21g).\nNote that problem (23) is a linear program (LP) and can thus be efficiently solved via standard convex optimization techniques such as the interior point method [33]. By comparing L (1) max versus L, the feasibility of problem (P1) is checked. Next, consider the binary offloading case. The user's computation tasks can only be executed by one of the three computation modes, namely the local computing, computation cooperation (offloading to helper), and communication cooperation (offloading to AP). For the three modes, the maximum numbers of supportable task input-bits can be readily obtained, as stated in the following.\n\n• For the local-computing mode, we have l h = l a = 0.\n\nWith the maximum CPU frequency f u,max and setting (16) to be tight, the maximum supportable number of task input-bits is given by\nl (2) u,max = T f u,max c u .(24)\n• For the computation-cooperation mode, we have l u = l a = 0. By setting the user's transmit power as P 1 = P u,max , and making the constraints (18) and (21b) be tight in problem (P2), the maximum number of task inputbits is thus\nl (2) h,max = τ b 1 r 01 (P u,max ),(25)\nwhere\nτ b 1 = T f h,max /(c h r 01 (P u,max ) + f h,max )\nis the user's optimal time allocation for offloading. • For the communication-cooperation mode, we have l u = l h = 0, P 2 = P u,max , and P 3 = P h,max in problem (P2). The maximum number of task input-bits l\n\na,max is obtained by solving the following LP:\nl (2) a,max = max τ2,τ3,la l a(26)\ns.t. l a ≤ min τ 2 r 01 (P u,max ), τ 2 r 0 (P u,max ) + τ 3 r 1 (P h,max )\nτ 2 + τ 3 + c a l a /f a,max ≤ T 0 ≤ τ 2 ≤ T, 0 ≤ τ 3 ≤ T.\nBased on (24)- (26), the maximum number of supportable task input-bits for the binary offloading case is given by\nL (2) max = max l (2) u,max , l(2)\nh,max , l (2) a,max .\n\nBy comparing L\n\nmax with L, the feasibility of problem (P2) is checked.\n\nBy comparing L \n\nmax . This is expected since that any feasible solution to problem (P2) is always feasible for problem (P1), but the reverse is generally not true. In other words, the partial offloading case can better utilize the distributed computation resources at different nodes, and thus achieves higher computation capacity than the binary offloading case.\n\n\nIV. OPTIMAL SOLUTION TO (P1)\n\nIn this section, we present an efficient algorithm for optimally solving problem (P1) in the partial offloading case.\n\nTowards this end, we introduce an auxiliary variable vector E [E 1 , E 2 , E 3 ] with E i = P i τ i for all i ∈ {1, 2, 3}. Then it holds that P i = E i /τ i if τ i > 0, and P i = 0 if either E i = 0 or τ i = 0 for any i ∈ {1, 2, 3}. By substituting P i = E i /τ i , i ∈ {1, 2, 3}, problem (P1) can be reformulated as is jointly concave with respect to x > 0 and y ≥ 0 [33]. As a result, the set defined by constraints (28b)-(28d) becomes convex. The function l 3 /τ 2 is a convex function with respect to l ≥ 0 and τ > 0, and hence the term κ h c 3 h l 3 h /(T − τ 1 ) 2 in the objective function is jointly convex with respect to l h ≥ 0 and 0 ≤ τ 1 < T . Therefore, problem (P1.1) is convex.\n(P1.1) : min E,τ ,l κ u c 3 u l 3 u T 2 + κ h c 3 h l 3 h (T − τ 1 ) 2 + 3 i=1 E i (28a) s.t. l h ≤ τ 1 r 01 E 1 τ 1 (28b) l a ≤ τ 2 r 0 E 2 τ 2 + τ 3 r 1 E 3 τ 3 (28c) l a ≤ τ 2 r 01 E 2 τ 2 (28d) 0 ≤ E j ≤ τ j P u,max , ∀j ∈ {1, 2} (28e) 0 ≤ E 3 ≤ τ 3 P h,max (28f)(1)\nAs stated in Lemma 4.1, problem (P1.1) is convex and can thus be optimally solved by the standard interior point method [33]. Alternatively, to gain essential engineering insights, we next leverage the Lagrange duality method to obtain a wellstructured optimal solution for problem (P1.1).\n\nLet λ 1 ≥ 0, λ 2 ≥ 0, and λ 3 ≥ 0 denote the dual variables associated with the constraints in (28b-d), respectively, µ 1 ≥ 0 and µ 2 ∈ R be the dual variables associated with the constraints in (20) and (1), respectively. Define λ [λ 1 , λ 2 , λ 3 ] and µ [µ 1 , µ 2 ]. The partial Lagrangian of problem (P1.1) is given by \nL(E, τ , l, λ, µ) = 3 i=1 E i + µ 1 τ 1 + κ h c 3 h l 3 h (T − τ 1 ) 2 + (λ 1 − µ 2 )l h − λ 1 τ 1 r 01 E 1 τ 1 − λ 2 τ 2 r 0 E 2 τ 2 − λ 3 τ 2 r 01 E 2 τ 2 + µ 1 τ 2 − λ 2 τ 3 r 1 E 3 τ 3 + µ 1 τ 3 + κ u c 3 u l 3 u T 2 − µ 2 l u + (λ 2 + λ 3 + µ 1 c a /f a,max − µ 2 ) l a − µ 1 T + µ 2 L.\n\nLemma 4.2:\n\nIn order for the dual function g(λ, µ) to be bounded from below, it must hold that λ 1 − µ 2 ≥ 0 and λ 2 + λ 3 + µ 1 c a /f a,max − µ 2 ≥ 0.\n\nProof: See Appendix A. Based on Lemma 4.2, the dual problem of problem (P1.1) is given by\n(D1.1) : max λ,µ g(λ, µ) (30a) s.t. µ 1 ≥ 0, λ i ≥ 0, ∀i ∈ {1, 2, 3} (30b) λ 1 − µ 2 ≥ 0 (30c) λ 2 + λ 3 + µ 1 c a /f a,max − µ 2 ≥ 0. (30d)\nDenote X and (λ opt1 , µ opt1 ) as the feasible set and the optimal solution of (λ, µ) for problem (D1.1), respectively.\n\nSince problem (P1.1) is convex and satisfies the Slater's condition, strong duality holds between problems (P1.1) and (D1.1) [33]. As a result, one can solve problem (P1.1) by equivalently solving its dual problem (D1.1). In the following, we first evaluate the dual function g(λ, µ) under any given (λ, µ) ∈ X , and then obtain the optimal dual variables (λ opt1 , µ opt1 ) to maximize g(λ, µ). Denote (E * , τ * , l * ) as the optimal solution to problem (29) under any given (λ, µ) ∈ X , (E opt1 , τ opt1 , l opt1 ) as the optimal primal solution to problem (P1.1).\n\n\nA. Derivation of Dual Function g(λ, µ)\n\nFirst, we obtain g(λ, µ) by solving (29) under any given (λ, µ) ∈ X . Equivalently, (29) can be decomposed into the following five subproblems.\nmin E1,τ1,l h E 1 + µ 1 τ 1 − λ 1 τ 1 r 01 E 1 τ 1 + κ h c 3 h l 3 h (T − τ 1 ) 2 + (λ 1 − µ 2 )l h s.t. (18), 0 ≤ E 1 ≤ τ 1 P u,max , 0 ≤ τ 1 ≤ T, l h ≥ 0.(31)\nmin E2,τ2\nE 2 + µ 1 τ 2 − λ 2 τ 2 r 0 E 2 τ 2 − λ 3 τ 2 r 01 E 2 τ 2 s.t. 0 ≤ E 2 ≤ τ 2 P u,max , 0 ≤ τ 2 ≤ T.(32)\nmin E3,τ3\nE 3 + µ 1 τ 3 − λ 2 τ 3 r 1 E 3 τ 3 s.t. 0 ≤ E 3 ≤ τ 3 P h,max , 0 ≤ τ 3 ≤ T.(33)min lu≥0 κ u c 3 u l 3 u T 2 − µ 2 l u s.t. c u l u ≤ T f u,max . (34) min 0≤la≤L (λ 2 + λ 3 + µ 1 c a /f a,max − µ 2 ) l a .(35)\nThe optimal solutions to problems (31)-(35) are presented in the following Lemmas 4.3-4.7, respectively. As these lemmas can be similarly proved via the Karush-Kuhn-Tucker (KKT) conditions [33], we only show the proof of Lemma 4.3 in Appendix B and omit the proofs of Lemmas 4.4-4.7 for brevity. Lemma 4.3: Under given (λ, τ ) ∈ X , the optimal solution (E * 1 , τ * 1 , l * h ) to problem (31) satisfies\nE * 1 = P * 1 τ * 1 ,(36)l * h = M * 1 (T − τ * 1 ),(37)τ * 1      = T, if ρ 1 < 0 ∈ [0, T ], if ρ 1 = 0 = 0, if ρ 1 > 0,(38)\nwhere P *\n1 = λ1B ln 2 − σ 2 1 h01 Pu,max 0 with [x] a b\nmin{a, max{x, b}}, and\nM * 1    µ2−λ1 3κ h c 3 h f h,max c h 0 , if µ 2 − λ 1 ≥ 0 0, if µ 2 − λ 1 < 0,(39)ρ 1 =µ 1 − λ 1 r 01 (P * 1 ) + 2κ h (c h M * 1 ) 3 + λ 1 BP * 1 h 01 /σ 2 1 (1 + P * 1 h 01 /σ 2 1 ) ln 2 − α 1 P u,max + β 1 f h,max c h ,(40)α 1    0, if P * 1 < P u,max λ1Bh01/σ 2 1 ln 2(1+P * 1 h01/σ 2 1 ) − 1, if P * 1 = P u,max ,(41)β 1 0, if M * 1 < f h,max c h µ 2 − λ 1 − 3κ h c 3 h (M * 1 ) 2 , if M * 1 = f h,max c h .(42)\nProof: See Appendix B. Lemma 4.4: Under given (λ, τ ) ∈ X , the optimal solution (E * 2 , τ * 2 ) to problem (32) satisfies\nE * 2 = P * 2 τ * 2 ,(43)τ * 2      = T, if ρ 2 < 0 ∈ [0, T ], if ρ 2 = 0 = 0, if ρ 2 > 0,(44)\nwhere\nP * 2 = √ v 2 −4uw−v 2u Pu,max 0 with u = ln 2 B h0 σ 2 0 h01 σ 2 1 , v = ln 2 B ( h0 σ 2 0 + h01 σ 2 1 )−(λ 2 +λ 3 ) h0 σ 2 0 h01 σ 2 1 , w = ln 2 B −λ 2 h0 σ 2 0 −λ 3 h01 σ 2 1 , ρ 2 = µ 1 − λ 2 r 0 (P * 2 ) + λ2BP * 2 h 0 σ 2 0 (1+P * 2 h 0 σ 2 0 ) ln 2 − λ 3 r 01 (P * 2 ) + λ3BP * 2 h 01 σ 2 1 (1+P * 2 h 01 σ 2 1\n) ln 2 − α 2 P u,max , and\nα 2 =      0, if P * 2 < P u,max λ3B h 01 σ 2 1 (1+P * 2 h 01 σ 2 1 ) ln 2 + λ2B h 0 σ 2 0 (1+P * 2 h 0 σ 2 0 ) ln 2 − 1, if P * 2 = P u,max .\n\nLemma 4.5:\n\nUnder given (λ, τ ) ∈ X , the optimal solution (E * 3 , τ * 3 ) to problem (33) satisfies\nE * 3 = P * 3 τ * 3 ,(45)τ * 3      = T, if ρ 3 < 0 ∈ [0, T ], if ρ 3 = 0 = 0, if ρ 3 > 0,(46)\nwhere P * 3 = λ2B\nln 2 − σ 2 1 h1 P h,max 0 and ρ 3 = µ 1 + λ2BP * 3 h 1 σ 2 1 (1+P * 3 h 1 σ 2 1 ) ln 2 − λ 2 r 1 (P * 3 ) − α 3 P h,max with α 3 = 0, if P * 3 < P h,max λ2Bh1/σ 2 0 (1+P * 3 h1/σ 2 0 ) ln 2 − 1, if P * 3 = P h,max .\nLemma 4.6: For given (λ, τ ) ∈ X , the optimal solution l * u to problem (34) is\nl * u = T µ 2 3κ u c 3 u T fu,max cu 0 . (47)\nLemma 4.7: For given (λ, τ ) ∈ X , the optimal solution l * a to problem (35) is\nl * a    = 0, if λ 2 + λ 3 + µ 1 c a /f a,max − µ 2 > 0 ∈ [0, L], if λ 2 + λ 3 + µ 1 c a /f a,max − µ 2 = 0 = L, if λ 2 + λ 3 + µ 1 c a /f a,max − µ 2 < 0.(48)\nRemark 4.1: Note that in (38), (44), (46), and (48), if ρ i = 0 (for any i ∈ {1, 2, 3}) or λ 2 + λ 3 + µ 1 c a /f a,max − µ 2 = 0, then the optimal solution τ * i or l * a is non-unique in general. In this case, we choose τ * i = 0 and l * a = 0 for the purpose of evaluating the dual function g(λ, µ). Such choices may not be feasible or optimal for problem (P1.1). To tackle this issue, we use an additional step in Section IV-C later to find the primal optimal τ opt1 i 's and l opt1 a for problem (P1.1). By combining Lemmas 4.3-4.7, the dual function g(λ, µ) is evaluated for any given (λ, µ) ∈ X .\n\nB. Obtaining (λ opt1 , µ opt1 ) to Maximize g(λ, µ) Next, we search over (λ, µ) ∈ X to maximize g(λ, µ) for solving problem (D1.1). Since the dual function g(λ, µ) is concave but non-differentiable in general, one can use subgradient based methods such as the ellipsoid method [32], to obtain the optimal λ opt1 and µ opt1 for (D1.1). For the objective function in (29), the subgradient with respect to (λ, µ) is\nl * h − τ * 1 r 01 E * 1 τ * 1 , l * a − τ * 2 r 0 E * 2 τ * 2 − τ * 3 r 1 E * 3 τ * 3 , l * a − τ * 2 r 01 E * 2 τ * 2 , 3 i=1 τ * i + l * a c a f a,max − T, L − l * u − l * h − l * a .\nFor the constraints µ 1 ≥ 0 and λ i ≥ 0, the subgradients are e 4 and e i , i ∈ {1, 2, 3}, respectively, where e i is the unit vector with one in the i-th entry and zeros elsewhere in R 5 .\n\n\nC. Optimal Primal Solution to (P1)\n\nWith λ opt1 and µ opt1 obtained, it remains to determine the optimal solution to problem (P1.1) (and thus (P1)). By replacing λ and µ in Lemmas 4.3-4.7 as λ opt1 and µ opt1 , we denote the corresponding P * i 's, l * u , and M * 1 as P opt1 ] corresponds to the optimal solution of P to problem (P1), and l opt1 u corresponds to the optimal solution of l u to both problems (P1) and (P1.1). Nevertheless, due to the nonuniqueness of τ * i 's and l * a , we implement an additional step to construct the optimal solution of other variables to problem (P1). With P opt1 , M opt1 1 , and l opt1 u , the optimal solution must satisfy l h = M opt1 1 (T − τ 1 ) and E i = P opt1 i τ i , i ∈ {1, 2, 3}. By substituting them in (P1) or (P1.1), we have the following LP to obtain τ opt1 and l opt1 (20).\na : min τ ,la≥0 κ h (c h M opt1 1 ) 3 (T − τ 1 ) + 3 i=1 τ i P opt1 i (49) s.t. M opt1 1 (T − τ 1 ) ≤ τ 1 r 01 (P opt1 1 ) l a ≤ τ 2 r 0 (P opt1 2 ) + τ 3 r 1 (P opt1 3 ) l a ≤ τ 2 r 01 (P opt1 2 ) M opt1 1 (T − τ 1 ) + l a + l opt1 u = L 0 ≤ τ i ≤ T, ∀i ∈ {1, 2, 3}, and\nThe LP in (49) can be efficiently solved by the interior-point method [33]. By combining τ opt1 , l opt1 h , and l opt1 a , together with P opt1 and l opt1 u , the optimal solution to problem (P1) is finally found. In summary, we present Algorithm 1 for optimally solving problem (P1) under the partial offloading case in Table I.  1) Obtain P * , E * , τ * , and l * with (λ, µ) ∈ X according to Lemmas 4.3-4.7; 2) Compute the subgradients of g(λ, µ), then update λ and µ using the ellipsoid method [32]. c) Until λ and µ converge with a prescribed accuracy. d) Set (λ opt1 , µ opt1 ) ← (λ, µ). e) Output: Obtain P opt1 and l opt1 u based on Lemmas 4.3-4.6 by replacing λ and µ as λ opt1 and µ opt1 , and then compute τ opt1 , l opt1 h , and l opt1 a by solving the LP in (49).\n\n\nRemark 4.2:\n\nBased on the optimal solution to (P1) in a semiclosed form, we have the following insights on the optimal joint computation and communication cooperation.\n\n• As for local computing, it follows from Lemma 4.6 that the number l opt1 u of task input-bits for local computing generally increases as the block duration T becomes large. This shows that the user prefers locally computing more tasks when the computation latency becomes loose, as will be validated in numerical results later. • As for cooperative computation (i.e., offloading tasks to helper), it is evident that, based on Lemma 4.3, the offloading power P opt1 1 in the first slot increases as the corresponding channel power gain h 01 becomes stronger. This is expected, since the marginal energy consumption for offloading from the user to the helper reduces in this case, and thus the user prefers offloading more tasks to the helper for cooperative computation. In this section, we develop an efficient algorithm to optimally solve problem (P2) in the binary offloading case.\n\nDue to the constraints in (1) and (22b), there exist in total three computation modes for the user's task execution, i.e., the local computing mode (with l u = L and l h = l a = 0), the computation cooperation mode (with l h = L and l u = l a = 0), and the communication cooperation mode (with l a = L and l u = l h = 0). In the following, we first obtain the energy consumption under each of the three computation modes, and then choose the best mode with the minimum energy consumption as the optimal solution to problem (P2).\n\n\nA. Computation Modes for Binary Offloading Case\n\n\n1) Local Computing Mode:\n\nThe local computing mode is feasible only when l (2) u,max ≥ L, with l (2) u,max given in (24). In this case, by substituting l u = L and l h = l a = 0 in (P2), we have the optimal transmit power and time allocation as P = 0 and τ = 0, respectively. Therefore, the minimum energy consumption by the user in this mode is\nE opt2 u = κ u c 3 u L 3 T 2 .(50)\n\n2) Computation Cooperation Mode:\n\nThe computation cooperation mode is feasible only when l (2) h,max ≥ L, with l (2) h,max given in (25). Substituting l h = L and l u = l a = 0 into (P2), it then follows that P 2 = P 3 = 0 and τ 2 = τ 3 = 0. Consequently, problem (P2) is reduced as min P1,τ1\nτ 1 P 1 + κ h c 3 h L 3 (T − τ 1 ) 2 (51a) s.t. L ≤ τ 1 r 01 (P 1 ) (51b) c h L ≤ (T − τ 1 )f h,max (51c) 0 ≤ τ 1 ≤ T, 0 ≤ P 1 ≤ P u,max .(51d)\nNote that at the optimality of (51), the constraint (51b) must be tight. It thus follows that P 1 = 2 L Bτ 1 − 1 σ 2 1 h01 . Accordingly, problem (51) is further reduced as the following univariable convex optimization problem:\nτ opt2 1 arg min τ1 2 L Bτ 1 − 1 τ 1 σ 2 1 h 01 + κ h c 3 h L 3 (T − τ 1 ) 2 (52) s.t. 2 L Bτ 1 − 1 σ 2 1 h 01 ≤ P u,max 0 ≤ τ 1 ≤ T − c h L f h,max ,\nwhere the optimal solution τ opt2 1 to problem (52) can be efficiently found via a bisectional search procedure [33]. With τ opt2 1 obtained, the sum energy consumption at the user and the helper is given by\nE opt2 h = 2 L Bτ opt2 1 − 1 τ opt2 1 σ 2 1 h 01 + κ h c 3 h L 3 (T − τ opt2 1 ) 2 .(53)\n\n3) Communication Cooperation Mode:\n\nThe communication cooperation mode is feasible only when l (2) a,max ≥ L with l (2) a,max given in (26). With l a = L and l u = l h = 0, it follows that P 1 = 0 and τ 1 = 0. Therefore, problem (P2) is re-expressed as min τ2,τ3,P2,P3\nτ 2 P 2 + τ 3 P 3(54)\ns.t. L ≤ min (τ 2 r 0 (P 2 ) + τ 3 r 1 (P 3 ), τ 2 r 01 (P 2 ))\nτ 2 + τ 3 + Lc a /f a,max ≤ T 0 ≤ τ i ≤ T, ∀i ∈ {2, 3} 0 ≤ P 2 ≤ P u,max , 0 ≤ P 3 ≤ P h,max .\nSimilarly as for problem (P1), problem (54) can be optimally solved by Algorithm 1 by setting l u = 0, l h = 0, l a = L, and τ 1 = 0. We denote (τ opt2 2 , τ opt2 2 , P opt2 1 , P opt2 2 ) as the optimal solution to problem (54). Therefore, we obtain the energy consumption for this mode as\nE opt2 a = τ opt2 2 P opt2 2 + τ opt2 3 P opt2 3 .\n(55)\n\n\nB. Computation Mode Selection\n\nBy comparing E opt2\nu , E opt2 h\n, and E opt2 a , we determine the optimal computation mode for problem (P2) as the one with the minimum energy consumption. Accordingly, the optimal l a , l u , and l h are decided, and the corresponding computation and communication resources allocation for the selected computation mode becomes the optimal solution to problem (P2). As a result, problem (P2) in the binary offloading case is optimally solved.\n\n\nVI. NUMERICAL RESULTS\n\nIn this section, numerical results are provided to evaluate the performance of the proposed joint computation and communication cooperation design for both partial and binary offloading cases, as compared to the following five benchmark schemes without such a joint design.\n\n• Local computing: The user executes the computation tasks locally by itself. The energy consumption for local computing is obtained as E opt2 u in (50). • Computation cooperation with partial offloading [28]:\n\nThe computation tasks are partitioned into two parts for the user's local computing and offloading to the helper, respectively. This corresponds to solving problem (P1) by setting l a = 0 and τ 2 = τ 3 = 0. • Communication cooperation with partial offloading [12]:\n\nThe computation tasks are partitioned into two parts for the user's local computing and offloading to the AP, respectively. The offloading is assisted by the helper's communication cooperation as a DF relay. This corresponds to solving problem (P1) by setting l h = 0 and τ 2 + τ 3 = T . d 0 = 10 m, d denotes the distance from the transmitter to the receiver, and ζ = 3 is the pathloss exponent. Furthermore, we set B = 1 MHz, σ 2 0 = σ 2 1 = −70 dBm, c u = c h = 10 3 cycles/bit [15], κ u = 10 −27 [12], κ h = 0.3×10 −27 , P u,max = P h,max = 40 dBm, f u,max = 2 GHz, f h,max = 3 GHz, and f a,max = 5 GHz. Fig. 3 shows the maximum number of task input-bits versus the block duration T , where D = 20 m. It is observed that for both partial and binary offloading cases in this setup, the computation cooperation and communication cooperation schemes achieve higher computation capacity than the local computing benchmark. Furthermore, for the binary or partial offloading, the communication cooperation scheme is observed to outperform the corresponding computation cooperation schemes, due to the higher computation capacities at the MEC server. In addition, our proposed joint cooperation design is observed to achieve the highest computation capacity by exploiting both benefits. Fig. 4 shows the average energy consumption versus the block length T , where L = 0.02 Mbits and D = 120 m. The proposed joint cooperation scheme is observed to achieve the minimum energy consumption for both the partial and binary offloading cases, respectively. In addition, we have the following observations.\n\n• The average energy consumption by all the schemes decreases as T increases. By comparing the partial and binary offloading, the computation and/or communication cooperation approach in the former case achieves more significant energy reduction than the corresponding one in the latter case. This indicates the benefit of task partitions in energy saving for MEC. • In the binary offloading case, when T is small (e.g., T < 0.035 sec), the communication cooperation scheme achieved a lower energy consumption than the local computing and the computation cooperation schemes. When 0.035 sec < T ≤ 0.05 sec, the computation cooperation scheme outperforms the other two schemes.\n\nAs T becomes large (e.g., T > 0.05 sec), the local computing scheme is beneficial. • In the partial offloading case, the communication cooperation scheme achieves a lower energy consumption than the computation cooperation scheme when T is small (e.g., T < 0.025 sec), while the reverse is true when T becomes large. Also, the computation cooperation and communication cooperation schemes both outperform the local computing one. This is because that the two cooperation schemes additionally exploit computation resources at the helper and the AP, respectively.  Fig. 4. Specifically, it is observed that at small L values (e.g., L < 0.06 Mbits), the local computing is observed to achieve a similar performance as the proposed joint cooperation scheme with binary offloading, since in this case, the local computing is sufficient to execute the computation task inputbits. As L increases, the joint computation and communication cooperation is observed to achieve significant performance gain in terms of energy reduction. Fig. 6 shows the average energy consumption versus D in both the partial and binary offloading cases, where T = 0.3 sec and L = 0.5 Mbits. As expected, the average energy consumption by the local computing scheme remains unchanged for all D values. As D becomes larger, the average energy consumption by the communication cooperation scheme is observed to first decrease and then increase, while that by the computation cooperation scheme is observed to increase monotonically. This is because that as D increases, the channel gain between the user and the helper becomes smaller, while that between the helper and the AP becomes stronger; therefore, such a change benefits the offloading from the helper to the AP, but incurs increased offloading energy consumption from the user to the helper. Furthermore, the proposed joint cooperation scheme is observed to achieve significant gains over these benchmark schemes at all D values.\n\n\nVII. CONCLUDING REMARKS\n\nIn this paper, we proposed a novel joint computation and communication cooperation approach for improving the MEC performance, where nearby helper nodes share the computation and communication resources to help actively-computing user nodes. By considering a basic three-node model under a four-slot cooperation protocol, we developed an energyefficient design framework for both partial and binary offloading cases. We minimized the total energy consumption at both the user and the helper subject to the computation latency constraint, by jointly optimizing the task partition, as well as the computation and communication resources allocation. Based on convex optimization techniques, we presented an efficient algorithm to obtain the optimal solution in the partial offloading case. Computation mode selection was then applied for optimally solving the problem in the binary offloading case. Extensive numerical results demonstrated the merit of the proposed joint computation and communication cooperation scheme over alternative benchmarks. It is our hope that this paper sheds new light on how to optimally design multiresource user cooperation to improve the operation efficiency of MEC. Due to the space limitation, there have been various important issues that have not been addressed in this paper, which are discussed as follows to motivate future work.\n\n• Although this paper considered the basic setup with one user and one helper, our results are extendable to the more general case with multiple users and helpers. For example, in this case, we can employ a user-helper pairing procedure to pair each user with one helper, such that the helper can use the proposed joint communication and computation cooperation design to help the computation of the paired user. Furthermore, to fully utilize the computation and communication resources at multiple helpers, each user can offload the tasks to multiple helpers simultaneously for parallel execution, and multiple helpers can also cooperatively relay the user's tasks to the AP (e.g., via the collaborative beamforming). However, how to efficiently pair multiple users and helpers, and efficiently design the multiuser computation offloading and collaborative relaying are new and generally difficult problems worthy of further investigation. • This paper assumed that the user and helper have the common interest in improving the MEC system energy efficiency, such that the centralized resource allocation is employed for performance optimization. In practice, however, the helper can have self-interest. In this case, how to design incentive mechanisms (such as monetary and credit-based ones) and distributed algorithms to motivate the helper to participate in the joint cooperation is an interesting problem worth pursuing in the future.\n\n\nAPPENDIX\n\n\nA. Proof of Lemma 4.2\n\nNote that for L(E, τ , l, λ, µ) in (29), there exist two terms (λ 1 − µ 2 )l h and (λ 2 + λ 3 + µ 1 c a /f a,max − µ 2 )l a . Suppose λ 1 − µ 2 < 0 (or λ 2 + λ 3 + µ 1 c a /f a,max − µ 2 < 0). Then L(E, τ , l, λ, µ) becomes negative infinity when l h → +∞ (or l a → +∞). This implies that the dual function g(λ, µ) is unbounded from below in this case. Hence, it requires that λ 1 − µ 2 ≥ 0 and λ 2 + λ 3 + µ 1 c a /f a,max − µ 2 ≥ 0 to guarantee g(λ, µ) to be bounded from below. Lemma 4.2 thus follows.\n\n\nB. Proof of Lemma 4.3\n\nAs problem (31) is convex and satisfies the Slater's condition, strong duality holds between problem (31) and its dual problem. Therefore, one can solve this problem by applying the KKT conditions [33]. The Lagrangian of problem (31) is given by\nL 1 =E 1 + µ 1 τ 1 − λ 1 τ 1 r 01 ( E 1 τ 1 ) − µ 2 l h + λ 1 l h + κ h c 3 h l 3 h (T − τ 1 ) 2 − a 1 E 1 + α 1 (E 1 − τ 1 P u,max ) − b 1 τ 1 + b 2 (τ 1 − T ) − d 1 l h + β 1 l h − (T − τ 1 )f h,max c h ,\nwhere a 1 , α 1 , b 1 , b 2 , d 1 , and β 1 are the non-negative Lagrange multipliers associated with E 1 ≥ 0, E 1 ≤ τ 1 P u,max , τ 1 ≥ 0, τ 1 ≤ T , l h ≥ 0, and l h ≤ (T − τ 1 )f h,max /c h , respectively. Based on the KKT conditions, it follows that\na 1 E 1 = 0, α 1 (E 1 − τ 1 P u,max ) = 0, b 2 (τ 1 − T ) = 0 (56a) b 1 τ 1 = 0, d 1 l h = 0, β 1 l h − (T − τ 1 )f h,max c h = 0 (56b) ∂L 1 ∂E 1 = 1 − λ 1 B h01 σ 2 1 ln 2 1 + E1 τ1 h01 σ 2 1 − a 1 + α 1 = 0 (56c) ∂L 1 ∂τ 1 = 2κ h c 3 h l 3 h (T − τ 1 ) 3 − λ 1 B log 2 1 + E 1 τ 1 h 01 σ 2 1 + β 1 f h,max c h + µ 1 + λ 1 B h01 σ 2 1 E1 τ1 ln 2 1 + E1 τ1 h01 σ 2 1 − b 1 + b 2 + α 1 P u,max = 0 (56d) ∂L 1 ∂l h = 3κ h c 3 h l 2 h (T − τ 1 ) 2 − µ 2 + λ 1 − d 1 + β 1 = 0,(56e)\nwhere (56a) and (56b) denote the complementary slackness condition, (56c), (56d) and (56e) are the first-order derivative conditions of L 1 with respect to E 1 , τ 1 , and l h , respectively. Therefore, we have (36) based on (56c), and (37) holds due to (56e). Furthermore, based on (56c), (56d), and (56e) and with some manipulations, we have (41) and (42). Furthermore, by substituting (36) and (37) into (56d) and assuming ρ 1 = b 2 −b 1 , we have ρ 1 in (40). Hence, the optimal τ * 1 is given in (38). This lemma is thus proved.\n\nFig. 1 .\n1A basic three-node MEC system with joint computation and communication cooperation. The dashed and solid lines indicate the tasks offloaded to the helper (for computation cooperation) and to the AP (via the helper's communication cooperation as a relay), respectively.\n\nFig. 2 .\n2MEC protocol with joint computation and communication cooperation.\n\n\nrespectively. First, consider the partial offloading case. The maximum number L\n\n\n,(16),(18),(20), (21f), and (21g), where both (28c) and (28d) follow from (21c).Lemma 4.1: Problem (P1.1) is a convex problem. Proof: The function r j (x) is a concave function with respect to x ≥ 0 for any j ∈ {0, 1, 01}, and thus its perspective function xr j y x\n\n\nThen the dual function of problem (P1.1) is given byg(λ, µ) = min E,τ ,l L(E, τ , l, λ, µ)(29)s.t.(16),(18), (21f), (21g), (28e), and (28f).\n\n\na) Initialization: Given an ellipsoid E((λ, µ), A) containing (λ opt1 , µ opt1 ), where (λ, µ) is the center point of E and the positive definite matrix A characterizes the size of E. b) Repeat:\n\n•\nAs for cooperative communication (i.e., offloading to AP), it is observed from Lemma 4.4 and 4.5 that the offloading power P opt1 2 in the second slot is dependent on both h 01 and h 0 , while P opt1 3 in the third slot increases as h 1 becomes large. V. OPTIMAL SOLUTION TO (P2)\n\n•Fig. 3 .Fig. 4 .\n34Computation cooperation with binary offloading: The user offloads all the computation tasks to the helper for remote execution. The energy consumption corresponds to E opt2 h in (53). • Communication cooperation with binary offloading: The user can only offload its computation tasks to the AP assisted by the helper's communication cooperation. The energy consumption corresponds to E opt2 a in (55) based on (54).In the simulation, we consider that the user and the AP are located with a distance of 250 meters (m) and the helper is located on the line between them. Let D denote the distance between the user and the helper. The pathloss between any two nodes is denoted asβ 0 (d/d 0 ) −ζ , where β 0 = −60 dBcorresponds to the path loss at the reference distance ofThe length of the time block, T The maximal number of task input-bits versus the block length.The length of the time block, T The average energy consumption versus the block length.\n\nFig. 5 .\n5The average energy consumption versus the number of task input-bits.\n\nFig. 5\n5shows the average energy consumption versus the number of task input-bits L, where T = 0.15 sec and D = 120 m. We have generally similar observations in Fig. 5 as in\n\nFig. 6 .\n6The average energy consumption versus the distance between the user and the helper.\n\nTABLE I\nIALGORITHM 1 FOR OPTIMALLY SOLVING PROBLEM (P1).\nIn general, the computation capability of the helper should be comparable or stronger than that of the user in order for the computation cooperation to be feasible.\n\nJoint computation and communication cooperation for mobile edge computing. X Cao, F Wang, J Xu, R Zhang, S Cui, Proc. WiOpt Workshops-EFC-IoT. WiOpt Workshops-EFC-IoTShanghai, ChinaX. Cao, F. Wang, J. Xu, R. Zhang, and S. Cui, \"Joint computation and communication cooperation for mobile edge computing,\" in Proc. WiOpt Workshops-EFC-IoT, Shanghai, China, May 2018, pp. 1-6.\n\nFog and IoT: An overview of research opportunities. M Chiang, T Zhang, IEEE Internet Thing J. 36M. Chiang and T. Zhang, \"Fog and IoT: An overview of research opportunities,\" IEEE Internet Thing J., vol. 3, no. 6, pp. 854-864, Jun. 2016.\n\nSampleless Wi-Fi: Bringing low power to Wi-Fi communications. W Wang, Y Chen, L Wang, Q Zhang, IEEE/ACM Trans. Netw. 253W. Wang, Y. Chen, L. Wang, and Q. Zhang, \"Sampleless Wi-Fi: Bringing low power to Wi-Fi communications,\" IEEE/ACM Trans. Netw., vol. 25, no. 3, pp. 1663-1672, Jun. 2017.\n\nA survey of mobile cloud computing: Architecture, applications, and approaches. H Dinh, C Lee, D Niyato, P Wang, Wirel. Commun. Mob. Comput. 1318H. Dinh, C. Lee, D. Niyato, and P. Wang, \"A survey of mobile cloud computing: Architecture, applications, and approaches,\" Wirel. Commun. Mob. Comput., vol. 13, no. 18, pp. 1587-1611, Dec. 2013.\n\nMobileedge computing: A key technology towards 5G. Y Hu, M Patel, D Sabella, N Sprecher, V Young, ETSI. 11Y. Hu, M. Patel, D. Sabella, N. Sprecher, and V. Young, \"Mobile- edge computing: A key technology towards 5G,\" ETSI, Sophia Antipolis, France, White Paper 11, 2015. [Online]. Available: http://www.etsi.org/images/files/ETSIWhitePapers/etsi wP11 mec a key technology towards 5g.pdf\n\nMobile edge computing: A survey on architecture and computation offloading. P Mach, Z Becvar, IEEE Commun. Surveys Tuts. 1933rd QuartP. Mach and Z. Becvar, \"Mobile edge computing: A survey on architecture and computation offloading,\" IEEE Commun. Surveys Tuts., vol. 19, no. 3, pp. 1628-1656, 3rd Quart., 2017.\n\nA survey on mobile edge computing: The communication perspective. Y Mao, C You, J Zhang, K Huang, K B Letaief, IEEE Commun. Surveys Tuts. 1944th QuartY. Mao, C. You, J. Zhang, K. Huang, and K. B. Letaief, \"A survey on mobile edge computing: The communication perspective,\" IEEE Commun. Surveys Tuts., vol. 19, no. 4, pp. 2322-2358, 4th Quart., 2017.\n\nEnabling fine-grained edge offloading for IoT. V Cozzolino, A Y Ding, J Ott, D Kutscher, Proc. ACM SIGCOMM. ACM SIGCOMMLos Angeles, CA, USAV. Cozzolino, A. Y. Ding, J. Ott, and D. Kutscher, \"Enabling fine-grained edge offloading for IoT,\" in Proc. ACM SIGCOMM, Los Angeles, CA, USA, Aug. 2017, pp. 124-126.\n\nCommunicating while computing: Distributed mobile cloud computing over 5G heterogeneous networks. S Barbarossa, S Sardellitti, P D Lorenzo, IEEE Signal Process. Mag. 316S. Barbarossa, S. Sardellitti, and P. D. Lorenzo, \"Communicating while computing: Distributed mobile cloud computing over 5G heterogeneous networks,\" IEEE Signal Process. Mag., vol. 31. no. 6, pp. 45-55, Nov. 2014.\n\nDelay-optimal computation task scheduling for mobile-edge computing systems. J Liu, Y Mao, J Zhang, K B Letaief, Proc. IEEE ISIT. IEEE ISITSpainJ. Liu, Y. Mao, J. Zhang, and K. B. Letaief, \"Delay-optimal computation task scheduling for mobile-edge computing systems,\" in Proc. IEEE ISIT, Spain, Jun. 2016, pp. 1451-1455.\n\nOffloading in mobile cloudlet systems with intermittent connectivity. Y Zhang, D Niyato, P Wang, IEEE Trans. Mobile Comput. 1412Y. Zhang, D. Niyato, and P. Wang, \"Offloading in mobile cloudlet systems with intermittent connectivity,\" IEEE Trans. Mobile Comput., vol. 14, no. 12, pp. 2516-2529, Dec. 2015.\n\nEnergy-efficient resource allocation for mobile-edge computing offloading. C You, K Huang, H Chae, B Kim, IEEE Trans. Wireless Commun. 163C. You, K. Huang, H. Chae, and B. Kim, \"Energy-efficient resource allocation for mobile-edge computing offloading,\" IEEE Trans. Wireless Commun., vol. 16, no. 3, pp. 1397-1411, Mar. 2017.\n\nOptimized multiuser computation offloading with multi-antenna NOMA. F Wang, J Xu, Z Ding, Proc. IEEE GLOBECOM Workshops-NOMAT5G. IEEE GLOBECOM Workshops-NOMAT5GSingaporeF. Wang, J. Xu, and Z. Ding, \"Optimized multiuser computation offload- ing with multi-antenna NOMA,\" in Proc. IEEE GLOBECOM Workshops- NOMAT5G, Singapore, Dec. 2017, pp. 1-7.\n\nJoint offloading decision and resource allocation for mobile cloud with computing access point. M.-H Chen, M Dong, B Liang, Proc. IEEE ICASSP. IEEE ICASSPShanghai, ChinaM.-H. Chen, M. Dong, and B. Liang, \"Joint offloading decision and resource allocation for mobile cloud with computing access point,\" in Proc. IEEE ICASSP, Shanghai, China, Mar. 2016, pp. 3516-3520.\n\nJoint offloading and computing optimization in wireless powered mobile-edge computing systems. F Wang, J Xu, X Wang, S Cui, IEEE Trans. Wireless Commun. 173F. Wang, J. Xu, X. Wang, and S. Cui, \"Joint offloading and computing optimization in wireless powered mobile-edge computing systems,\" IEEE Trans. Wireless Commun., vol. 17, no. 3, pp. 1784-1797, Mar. 2018.\n\nEnergy efficient mobile cloud computing powered by wireless energy transfer. C You, K Huang, H Chae, IEEE J. Sel. Areas Commun. 345C. You, K. Huang, and H. Chae, \"Energy efficient mobile cloud computing powered by wireless energy transfer,\" IEEE J. Sel. Areas Commun., vol. 34, no. 5, pp. 1757-1770, May 2016.\n\nComputation rate maximization for wireless powered mobile-edge computing with binary computation offloading. S Bi, Y J Zhang, IEEE Trans. Wireless Commun. 176S. Bi and Y. J. Zhang, \"Computation rate maximization for wireless powered mobile-edge computing with binary computation offloading,\" IEEE Trans. Wireless Commun., vol. 17, no. 6, pp. 4177-4190, Jun. 2018.\n\nCooperative communication in wireless networks. A Nosratinia, A Hedayat, IEEE Commun. Mag. 4210A. Nosratinia and A. Hedayat, \"Cooperative communication in wireless networks,\" IEEE Commun. Mag., vol. 42, no. 10, pp. 74-80, Oct. 2004.\n\nUser cooperation diversity: Part I. system description. A Sendonaris, E Erkip, B Aazhang, IEEE Trans. Commun. 5111A. Sendonaris, E. Erkip, and B. Aazhang, \"User cooperation diversity: Part I. system description,\" IEEE Trans. Commun., vol. 51, no. 11, pp. 1927-1938, Nov. 2003.\n\nCooperative diversity in wireless networks: Efficient protocols and outage behavior. J N Laneman, D Tse, G W Wornell, IEEE Trans. Inform. Theory. 5011J. N. Laneman, D. Tse, and G. W. Wornell, \"Cooperative diversity in wireless networks: Efficient protocols and outage behavior,\" IEEE Trans. Inform. Theory, vol. 50, no. 11, pp. 3062-3080, Nov. 2004.\n\nGaussian orthogonal relay channels: Optimal resource allocation and capacity. Y Liang, V V Veeravalli, IEEE Trans. Inform. Theory. 519Y. Liang and V. V. Veeravalli, \"Gaussian orthogonal relay channels: Optimal resource allocation and capacity,\" IEEE Trans. Inform. Theory, vol. 51, no. 9, pp. 3284-3289, Sep. 2005.\n\nUser cooperation in wireless powered communication networks. H Ju, R Zhang, Proc. IEEE GLOBECOM. IEEE GLOBECOMAustin, TX, USAH. Ju and R. Zhang, \"User cooperation in wireless powered communi- cation networks,\" in Proc. IEEE GLOBECOM, Austin, TX, USA, Dec. 2014, pp. 1430-1435.\n\nLocation privacy preservation in collaborative spectrum sensing. S Li, H Zhu, Z Gao, X Guan, K Xing, X Shen, Proc. IEEE INFOCOM. IEEE INFOCOMOrlando, FL, USAS. Li, H. Zhu, Z. Gao, X. Guan, K. Xing, and X. Shen, \"Location privacy preservation in collaborative spectrum sensing,\" in Proc. IEEE INFOCOM, Orlando, FL, USA, Mar. 2012, pp. 729-737.\n\nWireless powered cooperationassisted mobile edge computing. X Hu, K K Wong, K Yang, IEEE Trans. Wireless Commun. 174X. Hu, K. K. Wong, and K. Yang, \"Wireless powered cooperation- assisted mobile edge computing,\" IEEE Trans. Wireless Commun., vol. 17, no. 4, pp. 2375-2388, Apr. 2018.\n\nMulti-task assignment for crowdsensing in mobile social networks. M Xiao, J Wu, L Huang, Y Wang, C Liu, Proc. IEEE INFOCOM. IEEE INFOCOMKowloonM. Xiao, J. Wu, L. Huang, Y. Wang, and C. Liu, \"Multi-task assignment for crowdsensing in mobile social networks,\" in Proc. IEEE INFOCOM, Kowloon, Apr./May 2015, pp. 2227-2235.\n\nEnergy efficient cooperative computing in mobile wireless sensor networks. Z Sheng, C Mahapatra, V C M Leung, M Chen, P K Sahu, IEEE Trans. Cloud Comput. 611st Quart.Z. Sheng, C. Mahapatra, V. C. M. Leung, M. Chen, and P. K. Sahu, \"En- ergy efficient cooperative computing in mobile wireless sensor networks,\" IEEE Trans. Cloud Comput., vol. 6, no. 1, pp. 114-126, 1st Quart., 2018.\n\nTowards resource sharing in mobile device clouds: Power balancing across mobile devices. A Mtibaa, A Fahim, K A Harras, M H Ammar, Proc. ACM SIGCOMM. ACM SIGCOMMHong Kong, ChinaA. Mtibaa, A.Fahim, K. A. Harras, and M. H. Ammar, \"Towards resource sharing in mobile device clouds: Power balancing across mobile devices,\" in Proc. ACM SIGCOMM, Hong Kong, China, Aug. 2013, pp. 51-56.\n\nD2D fogging: An energy-efficient and incentive-aware task offloading framework via network-assisted D2D collaboration. L Pu, X Chen, J Xu, X Fu, IEEE J. Sel. Areas Commun. 3412L. Pu, X. Chen, J. Xu, and X. Fu, \"D2D fogging: An energy-efficient and incentive-aware task offloading framework via network-assisted D2D collaboration,\" IEEE J. Sel. Areas Commun., vol. 34, no. 12, pp. 3887- 3901, Nov. 2016.\n\nExploiting non-causal CPU-state information for energy-efficient mobile cooperative computing. C You, K Huang, IEEE Trans. Wireless Commun. 176C. You and K. Huang, \"Exploiting non-causal CPU-state information for energy-efficient mobile cooperative computing,\" IEEE Trans. Wireless Commun., vol. 17, no. 6, pp. 4104-4117, Jun. 2018.\n\nProcessor design for portable systems. T D Burd, R W Brodersen, Kluwer J. VLSI Signal Process. Syst. 132/3T. D. Burd and R. W. Brodersen, \"Processor design for portable systems,\" Kluwer J. VLSI Signal Process. Syst., vol. 13, no. 2/3, pp. 203-221, Aug. 1996.\n\nA Ruszczyski, Nonlinear Optimization. Princeton, NJPrinceton Univ. PressA Ruszczyski, Nonlinear Optimization, Princeton Univ. Press, Princeton, NJ, 2006.\n\nEllipsoid method. S Boyd, California, USAStanford UnivS. Boyd, \"Ellipsoid method,\" Stanford Univ., California, USA. [Online].\n\nS Boyd, L Vandenberghe, Convex Optimization. Cambridge, U.K.Cambridge Univ. PressS. Boyd and L. Vandenberghe, Convex Optimization, Cambridge, U.K.: Cambridge Univ. Press, Mar. 2004.\n", "annotations": {"author": "[{\"end\":140,\"start\":108},{\"end\":186,\"start\":141},{\"end\":241,\"start\":187},{\"end\":299,\"start\":242},{\"end\":325,\"start\":300},{\"end\":332,\"start\":326},{\"end\":340,\"start\":333},{\"end\":346,\"start\":341},{\"end\":489,\"start\":347},{\"end\":618,\"start\":490},{\"end\":722,\"start\":619},{\"end\":765,\"start\":723}]", "publisher": null, "author_last_name": "[{\"end\":139,\"start\":136},{\"end\":162,\"start\":158},{\"end\":205,\"start\":203},{\"end\":263,\"start\":258},{\"end\":324,\"start\":321},{\"end\":331,\"start\":328},{\"end\":339,\"start\":335},{\"end\":345,\"start\":343}]", "author_first_name": "[{\"end\":135,\"start\":128},{\"end\":157,\"start\":153},{\"end\":202,\"start\":199},{\"end\":257,\"start\":254},{\"end\":320,\"start\":312},{\"end\":327,\"start\":326},{\"end\":334,\"start\":333},{\"end\":342,\"start\":341}]", "author_affiliation": "[{\"end\":488,\"start\":348},{\"end\":617,\"start\":491},{\"end\":721,\"start\":620},{\"end\":764,\"start\":724}]", "title": "[{\"end\":91,\"start\":1},{\"end\":856,\"start\":766}]", "venue": "[{\"end\":1019,\"start\":858}]", "abstract": "[{\"end\":3349,\"start\":1264}]", "bib_ref": "[{\"attributes\":{\"ref_id\":\"b1\"},\"end\":3721,\"start\":3718},{\"attributes\":{\"ref_id\":\"b2\"},\"end\":3943,\"start\":3940},{\"attributes\":{\"ref_id\":\"b3\"},\"end\":4336,\"start\":4333},{\"attributes\":{\"ref_id\":\"b2\"},\"end\":4795,\"start\":4792},{\"attributes\":{\"ref_id\":\"b8\"},\"end\":4800,\"start\":4797},{\"attributes\":{\"ref_id\":\"b5\"},\"end\":5197,\"start\":5194},{\"attributes\":{\"ref_id\":\"b6\"},\"end\":5202,\"start\":5199},{\"attributes\":{\"ref_id\":\"b6\"},\"end\":5828,\"start\":5825},{\"attributes\":{\"ref_id\":\"b8\"},\"end\":5912,\"start\":5909},{\"attributes\":{\"ref_id\":\"b16\"},\"end\":5918,\"start\":5914},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":6047,\"start\":6043},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":6056,\"start\":6052},{\"attributes\":{\"ref_id\":\"b11\"},\"end\":6328,\"start\":6324},{\"attributes\":{\"ref_id\":\"b13\"},\"end\":6334,\"start\":6330},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":6628,\"start\":6624},{\"attributes\":{\"ref_id\":\"b16\"},\"end\":6634,\"start\":6630},{\"attributes\":{\"ref_id\":\"b0\"},\"end\":8393,\"start\":8392},{\"attributes\":{\"ref_id\":\"b17\"},\"end\":10835,\"start\":10831},{\"attributes\":{\"ref_id\":\"b23\"},\"end\":10841,\"start\":10837},{\"attributes\":{\"ref_id\":\"b24\"},\"end\":10874,\"start\":10870},{\"attributes\":{\"ref_id\":\"b28\"},\"end\":10880,\"start\":10876},{\"attributes\":{\"ref_id\":\"b19\"},\"end\":11101,\"start\":11097},{\"attributes\":{\"ref_id\":\"b20\"},\"end\":11107,\"start\":11103},{\"attributes\":{\"ref_id\":\"b21\"},\"end\":11192,\"start\":11188},{\"attributes\":{\"ref_id\":\"b23\"},\"end\":11234,\"start\":11230},{\"attributes\":{\"ref_id\":\"b27\"},\"end\":11503,\"start\":11499},{\"attributes\":{\"ref_id\":\"b28\"},\"end\":11552,\"start\":11548},{\"attributes\":{\"ref_id\":\"b24\"},\"end\":11824,\"start\":11820},{\"attributes\":{\"ref_id\":\"b25\"},\"end\":11868,\"start\":11864},{\"attributes\":{\"ref_id\":\"b26\"},\"end\":11874,\"start\":11870},{\"attributes\":{\"ref_id\":\"b11\"},\"end\":12277,\"start\":12273},{\"attributes\":{\"ref_id\":\"b13\"},\"end\":12283,\"start\":12279},{\"attributes\":{\"ref_id\":\"b11\"},\"end\":13494,\"start\":13490},{\"attributes\":{\"ref_id\":\"b16\"},\"end\":13500,\"start\":13496},{\"attributes\":{\"ref_id\":\"b0\"},\"end\":14717,\"start\":14714},{\"attributes\":{\"ref_id\":\"b18\"},\"end\":18674,\"start\":18670},{\"attributes\":{\"ref_id\":\"b20\"},\"end\":18680,\"start\":18676},{\"attributes\":{\"ref_id\":\"b29\"},\"end\":19503,\"start\":19499},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":19632,\"start\":19628},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":19638,\"start\":19634},{\"attributes\":{\"ref_id\":\"b6\"},\"end\":20363,\"start\":20360},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":20369,\"start\":20365},{\"attributes\":{\"ref_id\":\"b29\"},\"end\":20518,\"start\":20514},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":20545,\"start\":20541},{\"end\":20553,\"start\":20545},{\"attributes\":{\"ref_id\":\"b13\"},\"end\":21080,\"start\":21076},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":21130,\"start\":21126},{\"attributes\":{\"ref_id\":\"b18\"},\"end\":22646,\"start\":22642},{\"attributes\":{\"ref_id\":\"b17\"},\"end\":23709,\"start\":23705},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":24097,\"start\":24093},{\"attributes\":{\"ref_id\":\"b19\"},\"end\":24195,\"start\":24191},{\"attributes\":{\"ref_id\":\"b19\"},\"end\":25069,\"start\":25065},{\"attributes\":{\"ref_id\":\"b30\"},\"end\":25305,\"start\":25301},{\"attributes\":{\"ref_id\":\"b0\"},\"end\":25731,\"start\":25728},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":25745,\"start\":25742},{\"attributes\":{\"ref_id\":\"b17\"},\"end\":26388,\"start\":26384},{\"attributes\":{\"ref_id\":\"b19\"},\"end\":26394,\"start\":26390},{\"attributes\":{\"ref_id\":\"b32\"},\"end\":26955,\"start\":26951},{\"attributes\":{\"ref_id\":\"b0\"},\"end\":26975,\"start\":26972},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":27529,\"start\":27525},{\"attributes\":{\"ref_id\":\"b25\"},\"end\":28417,\"start\":28413},{\"attributes\":{\"ref_id\":\"b32\"},\"end\":29531,\"start\":29527},{\"attributes\":{\"ref_id\":\"b32\"},\"end\":30248,\"start\":30244},{\"attributes\":{\"ref_id\":\"b19\"},\"end\":30614,\"start\":30610},{\"attributes\":{\"ref_id\":\"b32\"},\"end\":31669,\"start\":31665},{\"attributes\":{\"ref_id\":\"b28\"},\"end\":32239,\"start\":32235},{\"attributes\":{\"ref_id\":\"b32\"},\"end\":32985,\"start\":32981},{\"attributes\":{\"ref_id\":\"b31\"},\"end\":36249,\"start\":36245},{\"attributes\":{\"ref_id\":\"b28\"},\"end\":36337,\"start\":36333},{\"attributes\":{\"ref_id\":\"b19\"},\"end\":37589,\"start\":37585},{\"attributes\":{\"ref_id\":\"b32\"},\"end\":37937,\"start\":37933},{\"attributes\":{\"ref_id\":\"b31\"},\"end\":38367,\"start\":38363},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":40359,\"start\":40356},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":40381,\"start\":40378},{\"attributes\":{\"ref_id\":\"b23\"},\"end\":40401,\"start\":40397},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":40757,\"start\":40754},{\"attributes\":{\"ref_id\":\"b24\"},\"end\":40799,\"start\":40795},{\"attributes\":{\"ref_id\":\"b32\"},\"end\":41595,\"start\":41591},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":41875,\"start\":41872},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":41896,\"start\":41893},{\"attributes\":{\"ref_id\":\"b25\"},\"end\":41916,\"start\":41912},{\"attributes\":{\"ref_id\":\"b27\"},\"end\":43560,\"start\":43556},{\"attributes\":{\"ref_id\":\"b11\"},\"end\":43826,\"start\":43822},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":44314,\"start\":44310},{\"attributes\":{\"ref_id\":\"b11\"},\"end\":44333,\"start\":44329},{\"attributes\":{\"ref_id\":\"b28\"},\"end\":50972,\"start\":50968},{\"attributes\":{\"ref_id\":\"b32\"},\"end\":51664,\"start\":51660},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":53629,\"start\":53625},{\"attributes\":{\"ref_id\":\"b17\"},\"end\":53634,\"start\":53630},{\"attributes\":{\"ref_id\":\"b19\"},\"end\":53639,\"start\":53635},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":53994,\"start\":53990},{\"attributes\":{\"ref_id\":\"b17\"},\"end\":53999,\"start\":53995}]", "figure": "[{\"attributes\":{\"id\":\"fig_0\"},\"end\":53461,\"start\":53182},{\"attributes\":{\"id\":\"fig_1\"},\"end\":53539,\"start\":53462},{\"attributes\":{\"id\":\"fig_2\"},\"end\":53621,\"start\":53540},{\"attributes\":{\"id\":\"fig_4\"},\"end\":53889,\"start\":53622},{\"attributes\":{\"id\":\"fig_5\"},\"end\":54032,\"start\":53890},{\"attributes\":{\"id\":\"fig_7\"},\"end\":54229,\"start\":54033},{\"attributes\":{\"id\":\"fig_8\"},\"end\":54512,\"start\":54230},{\"attributes\":{\"id\":\"fig_9\"},\"end\":55484,\"start\":54513},{\"attributes\":{\"id\":\"fig_10\"},\"end\":55564,\"start\":55485},{\"attributes\":{\"id\":\"fig_11\"},\"end\":55739,\"start\":55565},{\"attributes\":{\"id\":\"fig_12\"},\"end\":55834,\"start\":55740},{\"attributes\":{\"id\":\"tab_0\",\"type\":\"table\"},\"end\":55892,\"start\":55835}]", "paragraph": "[{\"end\":4132,\"start\":3368},{\"end\":4986,\"start\":4134},{\"end\":6028,\"start\":4988},{\"end\":6859,\"start\":6030},{\"end\":8075,\"start\":6861},{\"end\":9162,\"start\":8077},{\"end\":10734,\"start\":9164},{\"end\":12409,\"start\":10736},{\"end\":12823,\"start\":12411},{\"end\":13980,\"start\":12844},{\"end\":14348,\"start\":13982},{\"end\":14852,\"start\":14373},{\"end\":15806,\"start\":14925},{\"end\":16174,\"start\":15808},{\"end\":16688,\"start\":16233},{\"end\":17071,\"start\":16736},{\"end\":17547,\"start\":17098},{\"end\":18055,\"start\":17572},{\"end\":18487,\"start\":18100},{\"end\":18743,\"start\":18532},{\"end\":18928,\"start\":18745},{\"end\":19117,\"start\":19016},{\"end\":20047,\"start\":19149},{\"end\":20267,\"start\":20098},{\"end\":20376,\"start\":20294},{\"end\":20867,\"start\":20408},{\"end\":21028,\"start\":20917},{\"end\":21147,\"start\":21066},{\"end\":21620,\"start\":21174},{\"end\":21851,\"start\":21677},{\"end\":22044,\"start\":21898},{\"end\":22142,\"start\":22079},{\"end\":22497,\"start\":22186},{\"end\":22706,\"start\":22527},{\"end\":23127,\"start\":22778},{\"end\":23591,\"start\":23167},{\"end\":23720,\"start\":23593},{\"end\":24946,\"start\":24044},{\"end\":25083,\"start\":24948},{\"end\":25508,\"start\":25233},{\"end\":25911,\"start\":25510},{\"end\":26156,\"start\":25950},{\"end\":26469,\"start\":26158},{\"end\":26521,\"start\":26471},{\"end\":26657,\"start\":26561},{\"end\":27416,\"start\":26790},{\"end\":27472,\"start\":27418},{\"end\":27604,\"start\":27474},{\"end\":27870,\"start\":27639},{\"end\":27917,\"start\":27912},{\"end\":28179,\"start\":27970},{\"end\":28227,\"start\":28181},{\"end\":28338,\"start\":28263},{\"end\":28511,\"start\":28398},{\"end\":28568,\"start\":28547},{\"end\":28584,\"start\":28570},{\"end\":28641,\"start\":28586},{\"end\":28658,\"start\":28643},{\"end\":29007,\"start\":28660},{\"end\":29157,\"start\":29040},{\"end\":29852,\"start\":29159},{\"end\":30413,\"start\":30124},{\"end\":30739,\"start\":30415},{\"end\":31185,\"start\":31045},{\"end\":31276,\"start\":31187},{\"end\":31538,\"start\":31418},{\"end\":32108,\"start\":31540},{\"end\":32294,\"start\":32151},{\"end\":32465,\"start\":32456},{\"end\":32580,\"start\":32571},{\"end\":33196,\"start\":32792},{\"end\":33337,\"start\":33328},{\"end\":33407,\"start\":33385},{\"end\":33954,\"start\":33831},{\"end\":34060,\"start\":34055},{\"end\":34406,\"start\":34380},{\"end\":34657,\"start\":34568},{\"end\":34775,\"start\":34758},{\"end\":35072,\"start\":34992},{\"end\":35199,\"start\":35119},{\"end\":35966,\"start\":35363},{\"end\":36380,\"start\":35968},{\"end\":36757,\"start\":36568},{\"end\":37590,\"start\":36796},{\"end\":38641,\"start\":37863},{\"end\":38811,\"start\":38657},{\"end\":39698,\"start\":38813},{\"end\":40228,\"start\":39700},{\"end\":40626,\"start\":40307},{\"end\":40955,\"start\":40697},{\"end\":41327,\"start\":41100},{\"end\":41686,\"start\":41479},{\"end\":42045,\"start\":41813},{\"end\":42131,\"start\":42068},{\"end\":42517,\"start\":42227},{\"end\":42573,\"start\":42569},{\"end\":42626,\"start\":42607},{\"end\":43051,\"start\":42640},{\"end\":43350,\"start\":43077},{\"end\":43561,\"start\":43352},{\"end\":43827,\"start\":43563},{\"end\":45425,\"start\":43829},{\"end\":46103,\"start\":45427},{\"end\":48062,\"start\":46105},{\"end\":49455,\"start\":48090},{\"end\":50896,\"start\":49457},{\"end\":51437,\"start\":50933},{\"end\":51708,\"start\":51463},{\"end\":52168,\"start\":51916},{\"end\":53181,\"start\":52648}]", "formula": "[{\"attributes\":{\"id\":\"formula_0\"},\"end\":14372,\"start\":14349},{\"attributes\":{\"id\":\"formula_1\"},\"end\":16204,\"start\":16175},{\"attributes\":{\"id\":\"formula_2\"},\"end\":16735,\"start\":16689},{\"attributes\":{\"id\":\"formula_3\"},\"end\":17097,\"start\":17072},{\"attributes\":{\"id\":\"formula_4\"},\"end\":17571,\"start\":17548},{\"attributes\":{\"id\":\"formula_5\"},\"end\":18099,\"start\":18056},{\"attributes\":{\"id\":\"formula_6\"},\"end\":18531,\"start\":18488},{\"attributes\":{\"id\":\"formula_8\"},\"end\":18976,\"start\":18929},{\"attributes\":{\"id\":\"formula_9\"},\"end\":20097,\"start\":20048},{\"attributes\":{\"id\":\"formula_10\"},\"end\":20293,\"start\":20268},{\"attributes\":{\"id\":\"formula_11\"},\"end\":20407,\"start\":20377},{\"attributes\":{\"id\":\"formula_12\"},\"end\":20916,\"start\":20868},{\"attributes\":{\"id\":\"formula_13\"},\"end\":21065,\"start\":21029},{\"attributes\":{\"id\":\"formula_14\"},\"end\":21173,\"start\":21148},{\"attributes\":{\"id\":\"formula_15\"},\"end\":21676,\"start\":21621},{\"attributes\":{\"id\":\"formula_16\"},\"end\":21897,\"start\":21852},{\"attributes\":{\"id\":\"formula_17\"},\"end\":22078,\"start\":22045},{\"attributes\":{\"id\":\"formula_18\"},\"end\":22526,\"start\":22498},{\"attributes\":{\"id\":\"formula_19\"},\"end\":22750,\"start\":22707},{\"attributes\":{\"id\":\"formula_20\"},\"end\":23166,\"start\":23128},{\"attributes\":{\"id\":\"formula_21\"},\"end\":24043,\"start\":23721},{\"attributes\":{\"id\":\"formula_22\"},\"end\":25232,\"start\":25084},{\"attributes\":{\"id\":\"formula_23\"},\"end\":25949,\"start\":25912},{\"attributes\":{\"id\":\"formula_26\"},\"end\":26560,\"start\":26522},{\"attributes\":{\"id\":\"formula_27\"},\"end\":26789,\"start\":26658},{\"attributes\":{\"id\":\"formula_28\"},\"end\":27638,\"start\":27605},{\"attributes\":{\"id\":\"formula_29\"},\"end\":27911,\"start\":27871},{\"attributes\":{\"id\":\"formula_30\"},\"end\":27969,\"start\":27918},{\"attributes\":{\"id\":\"formula_32\"},\"end\":28262,\"start\":28228},{\"attributes\":{\"id\":\"formula_33\"},\"end\":28397,\"start\":28339},{\"attributes\":{\"id\":\"formula_34\"},\"end\":28546,\"start\":28512},{\"attributes\":{\"id\":\"formula_38\"},\"end\":30123,\"start\":29853},{\"attributes\":{\"id\":\"formula_39\"},\"end\":31031,\"start\":30740},{\"attributes\":{\"id\":\"formula_40\"},\"end\":31417,\"start\":31277},{\"attributes\":{\"id\":\"formula_41\"},\"end\":32455,\"start\":32295},{\"attributes\":{\"id\":\"formula_42\"},\"end\":32570,\"start\":32466},{\"attributes\":{\"id\":\"formula_43\"},\"end\":32662,\"start\":32581},{\"attributes\":{\"id\":\"formula_44\"},\"end\":32791,\"start\":32662},{\"attributes\":{\"id\":\"formula_45\"},\"end\":33222,\"start\":33197},{\"attributes\":{\"id\":\"formula_46\"},\"end\":33253,\"start\":33222},{\"attributes\":{\"id\":\"formula_47\"},\"end\":33327,\"start\":33253},{\"attributes\":{\"id\":\"formula_48\"},\"end\":33384,\"start\":33338},{\"attributes\":{\"id\":\"formula_49\"},\"end\":33494,\"start\":33408},{\"attributes\":{\"id\":\"formula_50\"},\"end\":33637,\"start\":33494},{\"attributes\":{\"id\":\"formula_51\"},\"end\":33736,\"start\":33637},{\"attributes\":{\"id\":\"formula_52\"},\"end\":33830,\"start\":33736},{\"attributes\":{\"id\":\"formula_53\"},\"end\":33980,\"start\":33955},{\"attributes\":{\"id\":\"formula_54\"},\"end\":34054,\"start\":33980},{\"attributes\":{\"id\":\"formula_55\"},\"end\":34379,\"start\":34061},{\"attributes\":{\"id\":\"formula_56\"},\"end\":34554,\"start\":34407},{\"attributes\":{\"id\":\"formula_57\"},\"end\":34683,\"start\":34658},{\"attributes\":{\"id\":\"formula_58\"},\"end\":34757,\"start\":34683},{\"attributes\":{\"id\":\"formula_59\"},\"end\":34991,\"start\":34776},{\"attributes\":{\"id\":\"formula_60\"},\"end\":35118,\"start\":35073},{\"attributes\":{\"id\":\"formula_61\"},\"end\":35362,\"start\":35200},{\"attributes\":{\"id\":\"formula_62\"},\"end\":36567,\"start\":36381},{\"attributes\":{\"id\":\"formula_63\"},\"end\":37862,\"start\":37591},{\"attributes\":{\"id\":\"formula_64\"},\"end\":40661,\"start\":40627},{\"attributes\":{\"id\":\"formula_65\"},\"end\":41099,\"start\":40956},{\"attributes\":{\"id\":\"formula_66\"},\"end\":41478,\"start\":41328},{\"attributes\":{\"id\":\"formula_67\"},\"end\":41775,\"start\":41687},{\"attributes\":{\"id\":\"formula_68\"},\"end\":42067,\"start\":42046},{\"attributes\":{\"id\":\"formula_69\"},\"end\":42226,\"start\":42132},{\"attributes\":{\"id\":\"formula_70\"},\"end\":42568,\"start\":42518},{\"attributes\":{\"id\":\"formula_71\"},\"end\":42639,\"start\":42627},{\"attributes\":{\"id\":\"formula_72\"},\"end\":51915,\"start\":51709},{\"attributes\":{\"id\":\"formula_73\"},\"end\":52647,\"start\":52169}]", "table_ref": "[{\"attributes\":{\"ref_id\":\"tab_0\"},\"end\":38192,\"start\":38185}]", "section_header": "[{\"end\":3366,\"start\":3351},{\"end\":12842,\"start\":12826},{\"end\":14923,\"start\":14855},{\"end\":16231,\"start\":16206},{\"end\":19014,\"start\":18978},{\"end\":19147,\"start\":19120},{\"end\":22184,\"start\":22145},{\"end\":22776,\"start\":22752},{\"end\":29038,\"start\":29010},{\"end\":31043,\"start\":31033},{\"end\":32149,\"start\":32111},{\"end\":34566,\"start\":34556},{\"end\":36794,\"start\":36760},{\"end\":38655,\"start\":38644},{\"end\":40278,\"start\":40231},{\"end\":40305,\"start\":40281},{\"end\":40695,\"start\":40663},{\"end\":41811,\"start\":41777},{\"end\":42605,\"start\":42576},{\"end\":43075,\"start\":43054},{\"end\":48088,\"start\":48065},{\"end\":50907,\"start\":50899},{\"end\":50931,\"start\":50910},{\"end\":51461,\"start\":51440},{\"end\":53191,\"start\":53183},{\"end\":53471,\"start\":53463},{\"end\":54232,\"start\":54231},{\"end\":54531,\"start\":54514},{\"end\":55494,\"start\":55486},{\"end\":55572,\"start\":55566},{\"end\":55749,\"start\":55741},{\"end\":55843,\"start\":55836}]", "table": null, "figure_caption": "[{\"end\":53461,\"start\":53193},{\"end\":53539,\"start\":53473},{\"end\":53621,\"start\":53542},{\"end\":53889,\"start\":53624},{\"end\":54032,\"start\":53892},{\"end\":54229,\"start\":54035},{\"end\":54512,\"start\":54233},{\"end\":55484,\"start\":54534},{\"end\":55564,\"start\":55496},{\"end\":55739,\"start\":55574},{\"end\":55834,\"start\":55751},{\"end\":55892,\"start\":55845}]", "figure_ref": "[{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":12862,\"start\":12856},{\"attributes\":{\"ref_id\":\"fig_1\"},\"end\":14943,\"start\":14937},{\"end\":44443,\"start\":44437},{\"end\":45119,\"start\":45113},{\"end\":46674,\"start\":46668},{\"attributes\":{\"ref_id\":\"fig_12\"},\"end\":47135,\"start\":47129}]", "bib_author_first_name": "[{\"end\":56135,\"start\":56134},{\"end\":56142,\"start\":56141},{\"end\":56150,\"start\":56149},{\"end\":56156,\"start\":56155},{\"end\":56165,\"start\":56164},{\"end\":56487,\"start\":56486},{\"end\":56497,\"start\":56496},{\"end\":56735,\"start\":56734},{\"end\":56743,\"start\":56742},{\"end\":56751,\"start\":56750},{\"end\":56759,\"start\":56758},{\"end\":57044,\"start\":57043},{\"end\":57052,\"start\":57051},{\"end\":57059,\"start\":57058},{\"end\":57069,\"start\":57068},{\"end\":57356,\"start\":57355},{\"end\":57362,\"start\":57361},{\"end\":57371,\"start\":57370},{\"end\":57382,\"start\":57381},{\"end\":57394,\"start\":57393},{\"end\":57769,\"start\":57768},{\"end\":57777,\"start\":57776},{\"end\":58071,\"start\":58070},{\"end\":58078,\"start\":58077},{\"end\":58085,\"start\":58084},{\"end\":58094,\"start\":58093},{\"end\":58103,\"start\":58102},{\"end\":58105,\"start\":58104},{\"end\":58403,\"start\":58402},{\"end\":58416,\"start\":58415},{\"end\":58418,\"start\":58417},{\"end\":58426,\"start\":58425},{\"end\":58433,\"start\":58432},{\"end\":58762,\"start\":58761},{\"end\":58776,\"start\":58775},{\"end\":58791,\"start\":58790},{\"end\":58793,\"start\":58792},{\"end\":59126,\"start\":59125},{\"end\":59133,\"start\":59132},{\"end\":59140,\"start\":59139},{\"end\":59149,\"start\":59148},{\"end\":59151,\"start\":59150},{\"end\":59441,\"start\":59440},{\"end\":59450,\"start\":59449},{\"end\":59460,\"start\":59459},{\"end\":59752,\"start\":59751},{\"end\":59759,\"start\":59758},{\"end\":59768,\"start\":59767},{\"end\":59776,\"start\":59775},{\"end\":60072,\"start\":60071},{\"end\":60080,\"start\":60079},{\"end\":60086,\"start\":60085},{\"end\":60448,\"start\":60444},{\"end\":60456,\"start\":60455},{\"end\":60464,\"start\":60463},{\"end\":60812,\"start\":60811},{\"end\":60820,\"start\":60819},{\"end\":60826,\"start\":60825},{\"end\":60834,\"start\":60833},{\"end\":61157,\"start\":61156},{\"end\":61164,\"start\":61163},{\"end\":61173,\"start\":61172},{\"end\":61500,\"start\":61499},{\"end\":61506,\"start\":61505},{\"end\":61508,\"start\":61507},{\"end\":61804,\"start\":61803},{\"end\":61818,\"start\":61817},{\"end\":62046,\"start\":62045},{\"end\":62060,\"start\":62059},{\"end\":62069,\"start\":62068},{\"end\":62353,\"start\":62352},{\"end\":62355,\"start\":62354},{\"end\":62366,\"start\":62365},{\"end\":62373,\"start\":62372},{\"end\":62375,\"start\":62374},{\"end\":62697,\"start\":62696},{\"end\":62706,\"start\":62705},{\"end\":62708,\"start\":62707},{\"end\":62996,\"start\":62995},{\"end\":63002,\"start\":63001},{\"end\":63278,\"start\":63277},{\"end\":63284,\"start\":63283},{\"end\":63291,\"start\":63290},{\"end\":63298,\"start\":63297},{\"end\":63306,\"start\":63305},{\"end\":63314,\"start\":63313},{\"end\":63617,\"start\":63616},{\"end\":63623,\"start\":63622},{\"end\":63625,\"start\":63624},{\"end\":63633,\"start\":63632},{\"end\":63908,\"start\":63907},{\"end\":63916,\"start\":63915},{\"end\":63922,\"start\":63921},{\"end\":63931,\"start\":63930},{\"end\":63939,\"start\":63938},{\"end\":64238,\"start\":64237},{\"end\":64247,\"start\":64246},{\"end\":64260,\"start\":64259},{\"end\":64264,\"start\":64261},{\"end\":64273,\"start\":64272},{\"end\":64281,\"start\":64280},{\"end\":64283,\"start\":64282},{\"end\":64636,\"start\":64635},{\"end\":64646,\"start\":64645},{\"end\":64655,\"start\":64654},{\"end\":64657,\"start\":64656},{\"end\":64667,\"start\":64666},{\"end\":64669,\"start\":64668},{\"end\":65048,\"start\":65047},{\"end\":65054,\"start\":65053},{\"end\":65062,\"start\":65061},{\"end\":65068,\"start\":65067},{\"end\":65428,\"start\":65427},{\"end\":65435,\"start\":65434},{\"end\":65706,\"start\":65705},{\"end\":65708,\"start\":65707},{\"end\":65716,\"start\":65715},{\"end\":65718,\"start\":65717},{\"end\":65927,\"start\":65926},{\"end\":66100,\"start\":66099},{\"end\":66209,\"start\":66208},{\"end\":66217,\"start\":66216}]", "bib_author_last_name": "[{\"end\":56139,\"start\":56136},{\"end\":56147,\"start\":56143},{\"end\":56153,\"start\":56151},{\"end\":56162,\"start\":56157},{\"end\":56169,\"start\":56166},{\"end\":56494,\"start\":56488},{\"end\":56503,\"start\":56498},{\"end\":56740,\"start\":56736},{\"end\":56748,\"start\":56744},{\"end\":56756,\"start\":56752},{\"end\":56765,\"start\":56760},{\"end\":57049,\"start\":57045},{\"end\":57056,\"start\":57053},{\"end\":57066,\"start\":57060},{\"end\":57074,\"start\":57070},{\"end\":57359,\"start\":57357},{\"end\":57368,\"start\":57363},{\"end\":57379,\"start\":57372},{\"end\":57391,\"start\":57383},{\"end\":57400,\"start\":57395},{\"end\":57774,\"start\":57770},{\"end\":57784,\"start\":57778},{\"end\":58075,\"start\":58072},{\"end\":58082,\"start\":58079},{\"end\":58091,\"start\":58086},{\"end\":58100,\"start\":58095},{\"end\":58113,\"start\":58106},{\"end\":58413,\"start\":58404},{\"end\":58423,\"start\":58419},{\"end\":58430,\"start\":58427},{\"end\":58442,\"start\":58434},{\"end\":58773,\"start\":58763},{\"end\":58788,\"start\":58777},{\"end\":58801,\"start\":58794},{\"end\":59130,\"start\":59127},{\"end\":59137,\"start\":59134},{\"end\":59146,\"start\":59141},{\"end\":59159,\"start\":59152},{\"end\":59447,\"start\":59442},{\"end\":59457,\"start\":59451},{\"end\":59465,\"start\":59461},{\"end\":59756,\"start\":59753},{\"end\":59765,\"start\":59760},{\"end\":59773,\"start\":59769},{\"end\":59780,\"start\":59777},{\"end\":60077,\"start\":60073},{\"end\":60083,\"start\":60081},{\"end\":60091,\"start\":60087},{\"end\":60453,\"start\":60449},{\"end\":60461,\"start\":60457},{\"end\":60470,\"start\":60465},{\"end\":60817,\"start\":60813},{\"end\":60823,\"start\":60821},{\"end\":60831,\"start\":60827},{\"end\":60838,\"start\":60835},{\"end\":61161,\"start\":61158},{\"end\":61170,\"start\":61165},{\"end\":61178,\"start\":61174},{\"end\":61503,\"start\":61501},{\"end\":61514,\"start\":61509},{\"end\":61815,\"start\":61805},{\"end\":61826,\"start\":61819},{\"end\":62057,\"start\":62047},{\"end\":62066,\"start\":62061},{\"end\":62077,\"start\":62070},{\"end\":62363,\"start\":62356},{\"end\":62370,\"start\":62367},{\"end\":62383,\"start\":62376},{\"end\":62703,\"start\":62698},{\"end\":62719,\"start\":62709},{\"end\":62999,\"start\":62997},{\"end\":63008,\"start\":63003},{\"end\":63281,\"start\":63279},{\"end\":63288,\"start\":63285},{\"end\":63295,\"start\":63292},{\"end\":63303,\"start\":63299},{\"end\":63311,\"start\":63307},{\"end\":63319,\"start\":63315},{\"end\":63620,\"start\":63618},{\"end\":63630,\"start\":63626},{\"end\":63638,\"start\":63634},{\"end\":63913,\"start\":63909},{\"end\":63919,\"start\":63917},{\"end\":63928,\"start\":63923},{\"end\":63936,\"start\":63932},{\"end\":63943,\"start\":63940},{\"end\":64244,\"start\":64239},{\"end\":64257,\"start\":64248},{\"end\":64270,\"start\":64265},{\"end\":64278,\"start\":64274},{\"end\":64288,\"start\":64284},{\"end\":64643,\"start\":64637},{\"end\":64652,\"start\":64647},{\"end\":64664,\"start\":64658},{\"end\":64675,\"start\":64670},{\"end\":65051,\"start\":65049},{\"end\":65059,\"start\":65055},{\"end\":65065,\"start\":65063},{\"end\":65071,\"start\":65069},{\"end\":65432,\"start\":65429},{\"end\":65441,\"start\":65436},{\"end\":65713,\"start\":65709},{\"end\":65728,\"start\":65719},{\"end\":65938,\"start\":65928},{\"end\":66105,\"start\":66101},{\"end\":66214,\"start\":66210},{\"end\":66230,\"start\":66218}]", "bib_entry": "[{\"attributes\":{\"id\":\"b0\",\"matched_paper_id\":10045985},\"end\":56432,\"start\":56059},{\"attributes\":{\"id\":\"b1\",\"matched_paper_id\":207018722},\"end\":56670,\"start\":56434},{\"attributes\":{\"id\":\"b2\",\"matched_paper_id\":8811435},\"end\":56961,\"start\":56672},{\"attributes\":{\"id\":\"b3\",\"matched_paper_id\":5822328},\"end\":57302,\"start\":56963},{\"attributes\":{\"id\":\"b4\"},\"end\":57690,\"start\":57304},{\"attributes\":{\"id\":\"b5\",\"matched_paper_id\":6909107},\"end\":58002,\"start\":57692},{\"attributes\":{\"id\":\"b6\",\"matched_paper_id\":206578365},\"end\":58353,\"start\":58004},{\"attributes\":{\"id\":\"b7\",\"matched_paper_id\":1298627},\"end\":58661,\"start\":58355},{\"attributes\":{\"id\":\"b8\",\"matched_paper_id\":16927061},\"end\":59046,\"start\":58663},{\"attributes\":{\"id\":\"b9\",\"matched_paper_id\":16521756},\"end\":59368,\"start\":59048},{\"attributes\":{\"id\":\"b10\",\"matched_paper_id\":17949912},\"end\":59674,\"start\":59370},{\"attributes\":{\"id\":\"b11\"},\"end\":60001,\"start\":59676},{\"attributes\":{\"id\":\"b12\",\"matched_paper_id\":1377107},\"end\":60346,\"start\":60003},{\"attributes\":{\"id\":\"b13\",\"matched_paper_id\":22082308},\"end\":60714,\"start\":60348},{\"attributes\":{\"id\":\"b14\",\"matched_paper_id\":2172141},\"end\":61077,\"start\":60716},{\"attributes\":{\"id\":\"b15\",\"matched_paper_id\":8975009},\"end\":61388,\"start\":61079},{\"attributes\":{\"id\":\"b16\",\"matched_paper_id\":4271602},\"end\":61753,\"start\":61390},{\"attributes\":{\"id\":\"b17\",\"matched_paper_id\":4779495},\"end\":61987,\"start\":61755},{\"attributes\":{\"id\":\"b18\",\"matched_paper_id\":1824573},\"end\":62265,\"start\":61989},{\"attributes\":{\"id\":\"b19\",\"matched_paper_id\":11053095},\"end\":62616,\"start\":62267},{\"attributes\":{\"id\":\"b20\",\"matched_paper_id\":14277373},\"end\":62932,\"start\":62618},{\"attributes\":{\"id\":\"b21\",\"matched_paper_id\":11993370},\"end\":63210,\"start\":62934},{\"attributes\":{\"id\":\"b22\",\"matched_paper_id\":18958681},\"end\":63554,\"start\":63212},{\"attributes\":{\"id\":\"b23\"},\"end\":63839,\"start\":63556},{\"attributes\":{\"id\":\"b24\",\"matched_paper_id\":2119461},\"end\":64160,\"start\":63841},{\"attributes\":{\"id\":\"b25\",\"matched_paper_id\":3798371},\"end\":64544,\"start\":64162},{\"attributes\":{\"id\":\"b26\",\"matched_paper_id\":8553593},\"end\":64926,\"start\":64546},{\"attributes\":{\"id\":\"b27\",\"matched_paper_id\":21245716},\"end\":65330,\"start\":64928},{\"attributes\":{\"id\":\"b28\",\"matched_paper_id\":7914805},\"end\":65664,\"start\":65332},{\"attributes\":{\"id\":\"b29\",\"matched_paper_id\":13582705},\"end\":65924,\"start\":65666},{\"attributes\":{\"id\":\"b30\"},\"end\":66079,\"start\":65926},{\"attributes\":{\"id\":\"b31\"},\"end\":66206,\"start\":66081},{\"attributes\":{\"id\":\"b32\"},\"end\":66389,\"start\":66208}]", "bib_title": "[{\"end\":56132,\"start\":56059},{\"end\":56484,\"start\":56434},{\"end\":56732,\"start\":56672},{\"end\":57041,\"start\":56963},{\"end\":57353,\"start\":57304},{\"end\":57766,\"start\":57692},{\"end\":58068,\"start\":58004},{\"end\":58400,\"start\":58355},{\"end\":58759,\"start\":58663},{\"end\":59123,\"start\":59048},{\"end\":59438,\"start\":59370},{\"end\":59749,\"start\":59676},{\"end\":60069,\"start\":60003},{\"end\":60442,\"start\":60348},{\"end\":60809,\"start\":60716},{\"end\":61154,\"start\":61079},{\"end\":61497,\"start\":61390},{\"end\":61801,\"start\":61755},{\"end\":62043,\"start\":61989},{\"end\":62350,\"start\":62267},{\"end\":62694,\"start\":62618},{\"end\":62993,\"start\":62934},{\"end\":63275,\"start\":63212},{\"end\":63614,\"start\":63556},{\"end\":63905,\"start\":63841},{\"end\":64235,\"start\":64162},{\"end\":64633,\"start\":64546},{\"end\":65045,\"start\":64928},{\"end\":65425,\"start\":65332},{\"end\":65703,\"start\":65666}]", "bib_author": "[{\"end\":56141,\"start\":56134},{\"end\":56149,\"start\":56141},{\"end\":56155,\"start\":56149},{\"end\":56164,\"start\":56155},{\"end\":56171,\"start\":56164},{\"end\":56496,\"start\":56486},{\"end\":56505,\"start\":56496},{\"end\":56742,\"start\":56734},{\"end\":56750,\"start\":56742},{\"end\":56758,\"start\":56750},{\"end\":56767,\"start\":56758},{\"end\":57051,\"start\":57043},{\"end\":57058,\"start\":57051},{\"end\":57068,\"start\":57058},{\"end\":57076,\"start\":57068},{\"end\":57361,\"start\":57355},{\"end\":57370,\"start\":57361},{\"end\":57381,\"start\":57370},{\"end\":57393,\"start\":57381},{\"end\":57402,\"start\":57393},{\"end\":57776,\"start\":57768},{\"end\":57786,\"start\":57776},{\"end\":58077,\"start\":58070},{\"end\":58084,\"start\":58077},{\"end\":58093,\"start\":58084},{\"end\":58102,\"start\":58093},{\"end\":58115,\"start\":58102},{\"end\":58415,\"start\":58402},{\"end\":58425,\"start\":58415},{\"end\":58432,\"start\":58425},{\"end\":58444,\"start\":58432},{\"end\":58775,\"start\":58761},{\"end\":58790,\"start\":58775},{\"end\":58803,\"start\":58790},{\"end\":59132,\"start\":59125},{\"end\":59139,\"start\":59132},{\"end\":59148,\"start\":59139},{\"end\":59161,\"start\":59148},{\"end\":59449,\"start\":59440},{\"end\":59459,\"start\":59449},{\"end\":59467,\"start\":59459},{\"end\":59758,\"start\":59751},{\"end\":59767,\"start\":59758},{\"end\":59775,\"start\":59767},{\"end\":59782,\"start\":59775},{\"end\":60079,\"start\":60071},{\"end\":60085,\"start\":60079},{\"end\":60093,\"start\":60085},{\"end\":60455,\"start\":60444},{\"end\":60463,\"start\":60455},{\"end\":60472,\"start\":60463},{\"end\":60819,\"start\":60811},{\"end\":60825,\"start\":60819},{\"end\":60833,\"start\":60825},{\"end\":60840,\"start\":60833},{\"end\":61163,\"start\":61156},{\"end\":61172,\"start\":61163},{\"end\":61180,\"start\":61172},{\"end\":61505,\"start\":61499},{\"end\":61516,\"start\":61505},{\"end\":61817,\"start\":61803},{\"end\":61828,\"start\":61817},{\"end\":62059,\"start\":62045},{\"end\":62068,\"start\":62059},{\"end\":62079,\"start\":62068},{\"end\":62365,\"start\":62352},{\"end\":62372,\"start\":62365},{\"end\":62385,\"start\":62372},{\"end\":62705,\"start\":62696},{\"end\":62721,\"start\":62705},{\"end\":63001,\"start\":62995},{\"end\":63010,\"start\":63001},{\"end\":63283,\"start\":63277},{\"end\":63290,\"start\":63283},{\"end\":63297,\"start\":63290},{\"end\":63305,\"start\":63297},{\"end\":63313,\"start\":63305},{\"end\":63321,\"start\":63313},{\"end\":63622,\"start\":63616},{\"end\":63632,\"start\":63622},{\"end\":63640,\"start\":63632},{\"end\":63915,\"start\":63907},{\"end\":63921,\"start\":63915},{\"end\":63930,\"start\":63921},{\"end\":63938,\"start\":63930},{\"end\":63945,\"start\":63938},{\"end\":64246,\"start\":64237},{\"end\":64259,\"start\":64246},{\"end\":64272,\"start\":64259},{\"end\":64280,\"start\":64272},{\"end\":64290,\"start\":64280},{\"end\":64645,\"start\":64635},{\"end\":64654,\"start\":64645},{\"end\":64666,\"start\":64654},{\"end\":64677,\"start\":64666},{\"end\":65053,\"start\":65047},{\"end\":65061,\"start\":65053},{\"end\":65067,\"start\":65061},{\"end\":65073,\"start\":65067},{\"end\":65434,\"start\":65427},{\"end\":65443,\"start\":65434},{\"end\":65715,\"start\":65705},{\"end\":65730,\"start\":65715},{\"end\":65940,\"start\":65926},{\"end\":66107,\"start\":66099},{\"end\":66216,\"start\":66208},{\"end\":66232,\"start\":66216}]", "bib_venue": "[{\"end\":56240,\"start\":56202},{\"end\":58494,\"start\":58463},{\"end\":59192,\"start\":59178},{\"end\":60172,\"start\":60132},{\"end\":60517,\"start\":60491},{\"end\":63059,\"start\":63031},{\"end\":63369,\"start\":63341},{\"end\":63984,\"start\":63965},{\"end\":64723,\"start\":64696},{\"end\":65977,\"start\":65964},{\"end\":66268,\"start\":66253},{\"end\":56200,\"start\":56171},{\"end\":56526,\"start\":56505},{\"end\":56787,\"start\":56767},{\"end\":57102,\"start\":57076},{\"end\":57406,\"start\":57402},{\"end\":57811,\"start\":57786},{\"end\":58140,\"start\":58115},{\"end\":58461,\"start\":58444},{\"end\":58827,\"start\":58803},{\"end\":59176,\"start\":59161},{\"end\":59492,\"start\":59467},{\"end\":59809,\"start\":59782},{\"end\":60130,\"start\":60093},{\"end\":60489,\"start\":60472},{\"end\":60867,\"start\":60840},{\"end\":61205,\"start\":61180},{\"end\":61543,\"start\":61516},{\"end\":61844,\"start\":61828},{\"end\":62097,\"start\":62079},{\"end\":62411,\"start\":62385},{\"end\":62747,\"start\":62721},{\"end\":63029,\"start\":63010},{\"end\":63339,\"start\":63321},{\"end\":63667,\"start\":63640},{\"end\":63963,\"start\":63945},{\"end\":64314,\"start\":64290},{\"end\":64694,\"start\":64677},{\"end\":65098,\"start\":65073},{\"end\":65470,\"start\":65443},{\"end\":65765,\"start\":65730},{\"end\":65962,\"start\":65940},{\"end\":66097,\"start\":66081},{\"end\":66251,\"start\":66232}]"}}}, "year": 2023, "month": 12, "day": 17}