{"id": 53095465, "updated": "2023-04-05 00:16:18.371", "metadata": {"title": "E-Eye: Hidden Electronics Recognition through mmWave Nonlinear Effects", "authors": "[{\"first\":\"Zhengxiong\",\"last\":\"Li\",\"middle\":[]},{\"first\":\"Zhuolin\",\"last\":\"Yang\",\"middle\":[]},{\"first\":\"Chen\",\"last\":\"Song\",\"middle\":[]},{\"first\":\"Changzhi\",\"last\":\"Li\",\"middle\":[]},{\"first\":\"Zhengyu\",\"last\":\"Peng\",\"middle\":[]},{\"first\":\"Wenyao\",\"last\":\"Xu\",\"middle\":[]}]", "venue": null, "journal": "Proceedings of the 16th ACM Conference on Embedded Networked Sensor Systems", "publication_date": {"year": 2018, "month": null, "day": null}, "abstract": "While malicious attacks on electronic devices (e-devices) have become commonplace, the use of e-devices themselves for malicious attacks has increased (e.g., explosives and eavesdropping). Modern e-devices (e.g., spy cameras, bugs or concealed weapons) can be sealed in parcels/boxes, hidden under clothing or disguised with cardboard to conceal their identities (named as hidden e-devices hereafter), which brings challenges in security screening. Inspection equipment (e.g., X-ray machines) is bulky and expensive. Moreover, screening reliability still rests on human performance, and the throughput in security screening of passengers and luggages is very limited. To this end, we propose to develop a low-cost and practical hidden e-device recognition technique to enable efficient screenings for threats of hidden electronic devices in daily life. First, we investigate and model the characteristics of nonlinear effects, a special passive response of electronic devices under millimeter-wave (mmWave) sensing. Based on this theory and our preliminary experiments, we design and implement, E-Eye, an end-to-end portable hidden electronics recognition system. E-Eye comprises a low-cost (i.e., under $100), portable (i.e., 11.8cm by 4.5cm by 1.8cm) and light-weight (i.e., 45.5g) 24GHz mmWave probe and a smartphone-based e-device recognizer. To validate the E-Eye performance, we conduct experiments with 46 commodity electronic devices under 39 distinct categories. Results show that E-Eye can recognize hidden electronic devices in parcels/boxes with an accuracy of more than 99% and has an equal error rate (EER) approaching 0.44% under a controlled lab setup. Moreover, we evaluate the reliability, robustness and performance variation of E-Eye under various real-world circumstances, and E-Eye can still achieve accuracy over 97%. Intensive evaluation indicates that E-Eye is a promising solution for hidden electronics recognition in daily life.", "fields_of_study": "[\"Computer Science\"]", "external_ids": {"arxiv": null, "mag": "2898264154", "acl": null, "pubmed": null, "pubmedcentral": null, "dblp": "conf/sensys/LiYSLPX18", "doi": "10.1145/3274783.3274833"}}, "content": {"source": {"pdf_hash": "a0c2ce28eb54b9a1904877861d9d53f3887a7e97", "pdf_src": "ACM", "pdf_uri": null, "oa_url_match": false, "oa_info": {"license": null, "open_access_url": "https://dl.acm.org/doi/pdf/10.1145/3274783.3274833", "status": "BRONZE"}}, "grobid": {"id": "68373c84a13d15264793fbbd32e141fc9cd4e7e7", "type": "plain-text", "url": "s3://ai2-s2-pdf-extraction-prod/parse-results/s2orc_worker/a0c2ce28eb54b9a1904877861d9d53f3887a7e97.txt", "contents": "\nE-Eye: Hidden Electronics Recognition through mmWave Nonlinear Effects KEYWORDS Wireless Sensing; Pattern Recognition; Hardware Security. ACM Reference Format\nACMCopyright ACMNovember 4-7, 2018. November 4-7, 2018\n\nZhengxiong Li \nCSE Department\nSUNY University at Buffalo\nBuffaloNYUSA\n\nCSE Department\nSUNY University at Buffalo\nBuffaloNYUSA\n\nZhuolin Yang zhuoliny@buffalo.edu \nCSE Department\nSUNY University at Buffalo\nBuffaloNYUSA\n\nCSE Department\nSUNY University at Buffalo\nBuffaloNYUSA\n\nChen Song csong5@buffalo.edu \nCSE Department\nSUNY University at Buffalo\nBuffaloNYUSA\n\nCSE Department\nSUNY University at Buffalo\nBuffaloNYUSA\n\nChangzhi Li changzhi.li@ttu.edu \nECE Department\nTexas Tech University\nLubbockTXUSA\n\nECE Department\nTexas Tech University\nLubbockTXUSA\n\nZhengyu Peng \nAptiv Corporation\nKokomoINUSA\n\nAp-tiv Corporation\nKokomoINUSA\n\nWenyao Xu wenyaoxu@buffalo.edu \nCSE Department\nSUNY University at Buffalo\nBuffaloNYUSA\n\nCSE Department\nSUNY University at Buffalo\nBuffaloNYUSA\n\nZhengxiong Li \nCSE Department\nSUNY University at Buffalo\nBuffaloNYUSA\n\nCSE Department\nSUNY University at Buffalo\nBuffaloNYUSA\n\nZhuolin Yang \nCSE Department\nSUNY University at Buffalo\nBuffaloNYUSA\n\nCSE Department\nSUNY University at Buffalo\nBuffaloNYUSA\n\nChen Song \nCSE Department\nSUNY University at Buffalo\nBuffaloNYUSA\n\nCSE Department\nSUNY University at Buffalo\nBuffaloNYUSA\n\nChangzhi Li \nECE Department\nTexas Tech University\nLubbockTXUSA\n\nECE Department\nTexas Tech University\nLubbockTXUSA\n\nZhengyu Peng \nAptiv Corporation\nKokomoINUSA\n\nAp-tiv Corporation\nKokomoINUSA\n\nWenyao Xu wenyaoxu@buffalo.edu2changzhi.li@ttu.edu \nCSE Department\nSUNY University at Buffalo\nBuffaloNYUSA\n\nCSE Department\nSUNY University at Buffalo\nBuffaloNYUSA\n\nE-Eye: Hidden Electronics Recognition through mmWave Nonlinear Effects KEYWORDS Wireless Sensing; Pattern Recognition; Hardware Security. ACM Reference Format\n\nThe 16th ACM Conference on Embedded Networked Sensor Systems (SenSys '18)\nShenzhen, China Effects; Shenzhen, China; New York, NY, USAACM18November 4-7, 2018. November 4-7, 201810.1145/3274783.3274833ACM ISBN 978-1-4503-5952-8/18/11. . . $15.00-Eye: Hidden Electronics Recognition through mmWave Nonlinear\nWhile malicious attacks on electronic devices (e-devices) have become commonplace, the use of e-devices themselves for malicious attacks has increased (e.g., explosives and eavesdropping). Modern e-devices (e.g., spy cameras, bugs or concealed weapons) can be sealed in parcels/boxes, hidden under clothing or disguised with cardboard to conceal their identities (named as hidden e-devices hereafter), which brings challenges in security screening. Inspection equipment (e.g., X-ray machines) is bulky and expensive. Moreover, screening reliability still rests on human performance, and the throughput in security screening of passengers and luggages is very limited. To this end, we propose to develop a low-cost and practical hidden e-device recognition technique to enable efficient screenings for threats of hidden electronic devices in daily life. First, we investigate and model the characteristics of nonlinear effects, a special passive response of electronic devices under millimeter-wave (mmWave) sensing. Based on this theory and our preliminary experiments, we design and implement, E-Eye, an end-to-end portable hidden electronics recognition system. E-Eye comprises a low-cost (i.e., under $100), portable (i.e., 11.8cm by 4.5cm by 1.8cm) and lightweight (i.e., 45.5g) 24GHz mmWave probe and a smartphone-based e-device recognizer. To validate the E-Eye performance, we conduct experiments with 46 commodity electronic devices under 39 distinct categories. Results show that E-Eye can recognize hidden electronic devices in parcels/boxes with an accuracy of more than 99% and has an equal error rate (EER) approaching 0.44% under a controlled lab setup. Moreover, we evaluate the reliability, robustness and performance variation of E-Eye under various real-world circumstances, and E-Eye can still achieve accuracy over 97%. Intensive evaluation indicates that E-Eye is a promising solution for hidden electronics recognition in daily life.CCS CONCEPTS• Security and privacy → Security in hardware;\n\nINTRODUCTION\n\nHidden electronic devices (hereafter, e-devices) bring both security and privacy threats in our daily life. For instance, explosion tragedies continuously occur due to the ineffective detection of remote-controlled disguised bombs [1,3,7,14], which can be triggered by electronic initiators. Apart from these life-threatening hazards, e-devices (e.g., smartphones and spy camera) can also be used for eavesdropping, cheating in private zones [13] or accessing other areas that restrict electronics [4,15,16]. The fact that these e-devices (hereafter, hidden e-devices) can be sealed in parcels or boxes, hidden insides in clothing and disguised in appearance increases the risk that they can easily pass undetected through security check points.\n\nEntry security check is the current method for defending against malicious, hidden e-devices requiring an X-ray machine [58] at safety-critical sites (e.g., airports and embassy offices). Unfortunately, their expensive cost and poor portability make it an infeasible solution against the proliferation and the deployment of portable e-devices [45]. Moreover, the radiation emitted from X-rays is harmful to workers and persons passing through the checkpoints. Other scanning methods based on metal scanners can only detect the existence of the e-device rather than recognize the specific type directly (see Sec. 9.1). Conventional computer vision methods cannot be applied because the camera can not see through containers or bodies. Thermal imaging also fails because it only can detect the temperature of the hidden e-device [39], which can be easily interfered with by other heat sources. As a result, how to recognize hidden e-devices in a cost-efficient, user-friendly and non-invasive manner remains an unsolved challenge for public security and privacy.\n\nRecently, there is a rising trend of applying radio-frequency signals, such as millimeter wave (mmWave [10]), in sensing and tracking applications, because mmWave can penetrate obstacles and \"image\" hidden objects due to its highly-directional beamforming and strong reflection properties on objects [64]. For example, Adib et al. studied the possibility of sensing human occurrence and vitals through WiFi signals [17]. Zhu et al. developed a 60GHz mmWave imager for object detection and classification [66]. Wei et al. designed mTrack, a mmWave instrument for precision object tracking [64]. However, existing works mainly target either human or non-electronic object detection and tracking. The capability of accurately recognizing hidden electronic devices through mmWave sensing is unknown.\n\nTo this end, we propose our system, E-Eye, to facilitate hidden e-device recognition in public security inspections. Its features are (1) cost-efficient: the cost of the solution is affordable in daily life for large scale deployment; (2) portable: it is easy to use in the inspection of different containers (e.g., delivery boxes, checkin luggages or even human body) and various environments (e.g., postal offices, airports or factories); (3) non-invasive: it can avoid the obtrusive (even illegal) opening of the container in real practice which sacrifices efficiency and may cause privacy issues.\n\nThe foundation of E-Eye rests on the nonlinear response effect from electronic circuits when probed by the mmWave. The intrinsic difference in circuits' hardware characteristics (e.g., a circuits' components and circuit layout) generates a distinct nonlinear response, which can serve as the identity of a certain e-device brand. This way, we enable a novel sensing modality for noninvasive and cost-effective hidden e-devices recognition based on the mmWave field. Specifically, we design and prototype a portable (11.8cm × 4.5cm × 1.8cm) and light-weight (45.4д) 24GHz mmWave probe device which is enabled to probe the mmWave and capture the returned nonlinear responses. We address the challenges in noiseisolation and coherence to achieve high-quality signal with low complexity and cost (less than US $100). Afterwards, the signal is transferred to the smartphone and we propose the wavelet-based analysis module taking into consideration the unavoidable variance in the signal's scaling and magnitude in practical usage. Eventually, we develop a fine-tuned support vector machine (SVM) classifier for robust recognition under various conditions. In the experiment, we employ 46 e-devices and the comprehensive results show that E-Eye can accurately recognize each e-device brand under different scenarios.\n\nOur contributions are summarized as follows:\n\n• We propose a novel form of recognizing hidden e-devices by exploring the nonlinear response effect of mmWave of e-devices. We find that the circuit inside an e-device acts as a passive signal modulator which reflects back radio frequency (RF) signals with intrinsic identity information. • We develop E-Eye, an end-to-end system to facilitate the low-cost, non-invasive and robust hidden electronics recognition. We prototype the sensing hardware and implement the recognition algorithm for efficient and effective classification. There are usually two following forms of radio frequency (RF) response when probing a continuous wave (CW) with the transmit frequency f 0 towards a target.\n\nLinear Effects: The main carrier frequency of the received signal is the same as that of the transmitted signal. The phase change in the linearly demodulated signals is related to the geometrical information, such as object distance, shape and size [42]. However, these linear effects do not reflect the material properties and we need to seek other information in the application of e-device detection and recognition.\n\nNonlinear Effects: Besides the main carrier frequency, the received signal wave is also modulated with a set of the sub-carrier frequencies with more side lobes in the spectrum. These sub-carrier frequencies are generated due to the nonlinear properties of the target (e.g., material reflection efficiency) [48,49]. In the remaining part of this section, we provide an in-depth analysis of non-linear effects in recognizing electronics.\n\nNonlinear Effects from E-device: As shown in Figure 2, when the e-device enters the RF beam field, chips, connectors and metal traces of printed circuit board (PCB) on an e-device are viewed as an array of antennas in the resolution of mmWave, and these antenna with inductance (L), capacitance (C) and resistance (R) act as a passive processor and manipulates the transmit mmwave signals. More specifically, antennas can conduct and transform the mmWave signal to a high-frequency current along the conductors between the electronic components within the device [38]. The components (e.g., a diode) or parasitic parameters (e.g., a parasitic circuit) on the PCB modulate the response signal and generate the nonlinear distortion [33], formulated as Equation (1):\nr (t) = m(z(t),â(t)) ⊗ h f (t),(1)\nwhere z(t) is the response signal, m(·,â(t)) is the nonlinear modulation function of the PCB,â(t) is the complex power-series for the nonlinear system, ⊗ stands for convolution computing and h f (t) is the ideal bandpass filter function for the carrier bandwidth [26,27]. After the modulated signal radiate from the e-device, they would be captured by the probe receive (Rx) antenna. Thus, this nonlinear response of the e-device contains rich information of its physical characteristic and holds the potential to serve as the device's identity. Figure 2: The e-device generates a nonlinear response signature under the RF beam. The response is determined by its intrinsic physical characteristics.\n\n\nA Preliminary Study: mmWave Nonlinear Effects from Electronic Circuits\n\nCarrier Frequency Selection: Selecting a transmit frequency (and consequently a receive frequency) requires all of the typical trade-offs associated with longer versus shorter wavelengths for radar, which include availability of components (e.g., amplifiers and filters), realization of an acceptable gain for the antennas to achieve a sufficient signal-to-noise ratio (SNR) and exploitation of the radar cross-section (RCS) associated with a particular set of targets [28,46]. If it is assumed, as a very rough approximation [41], that the length of a typical trace along a PCB is l = 3mm on the Highfrequency high-speed circuits (illustrated in Figure 3), and the effective dielectric constant of the board is close to ε = 4, the traces along the board become half-wave resonant dipoles (l = λ 2 ) at a frequency of\nf 0 = c √ ε λ = 3·10 8 m/s √ 4·2·0.003m\n≈24GHz, where c is the propagation speed of a radar wave in air. Thus, it is reasonable to expect that, for nonlinear effect, the radar will transmit frequencies in or near Super high frequency band, range from 3GHz to 30GHz [8,52]. Considering the technology for 24GHz radar is significantly mature and 24GHz is unrestricted in the industrial scientific medical (ISM) band [2], we apply the 24GHz as the transmit frequency, which is loosely known as mmWave.\n\nOwing to different product design goals and the circuit IP protection, the circuits in different e-device brands are different. Thus, the amplitude, frequency and phase of the nonlinear responses are different among different e-devices. Therefore, it is possible to design a mmWave probe to force e-devices to radiate the nonlinear response signature that reflects their unique properties and can be used for recognition.  Proof-of-concept: Six different e-device types from four different representative device categories are stimulated with the mmWave probe fixed 20cm in distance from the devices. The main circuit board of each e-device is attached on the left. These circuits are different from aspects of the size, the components and layout. As shown in Figure 3, the x-axis is the sensing range, the y-axis is the frequency of the received signal and the color bar represents the amplitude of the signal. The varied sub-carrier frequencies can be clearly observed that their nonlinear responses are significantly distinct at the frequency, amplitude and phase, which matches Section 2.1. Given the huge amount of electric units integrated on the control board, parasitic variations have sufficient space to be served as powerful resources for device recognition.\n\nA Study on Package Effects: In real-world applications, electronics can be placed inside the container or covered by different materials. As a result, we need to investigate whether the hidden materials will generate nonlinear responses or have a nonlinear effect [54]. It is proved in Figure 4(a) that within the area of the nonlinear response, there is little demodulated signal amplitude for cardboard (less than 0.016V , ambient noise and thermal noise actually), while for Nexus 5, the demodulated nonlinear response signal is quite visible (more than 0.212V , 13.5× larger than cardboard's) (more detailed analysis about the nonlinear response in Section 5). In Figure 4(b), we can observe their signal spectrum are significantly different, which proves the feasibility of unobtrusive hidden e-device recognition.\n\n(a) The detected nonlinear response from the cardboard and Nexus 5.  \n\n\nPractical Challenges\n\nThere are two technical challenges in our system design:\n\nLow-cost and portable sensing modality: There are significant challenges in fulfilling such mmWave probe, especially in RF frontend, antenna, signal processing and manufacture craft parts. Moreover, to make the mmWave probe low-cost and compact with the portable size and excellent flexibility is arduous.\n\nEffective and robust recognition: Taking into account the ambient noise, unavoidable variance in signal's scaling as well as diverse intervention sources, it is not easy to accurately and efficiently discriminate the nonlinear responses from different e-devices in a limited time.\n\n\nE-EYE: HIDDEN E-DEVICE RECOGNITION SYSTEM\n\nWe propose E-Eye, a portable, non-invasive and robust system to facilitate recognition of the hidden e-devices. Typically, we consider the real world practice where the inspector conducts the on-site inspection of the object for forbidden e-devices that may be contained in it. The end-to-end system overview is shown in Figure  5.\n\n\nE-Eye\n\nHardware: A new mmWave probe with the smartphone is designed to remotely and robustly acquire the e-device's nonlinear response for recognition. Specifically, the probe transmits the continuous wave and process/demodulate the reflected signal. After that, the kilobyte (KB) size data is sent to smartphone for recognition via the line-in audio card converter [6].\n\nE-Eye Software: Once receiving the data, the e-device recognition module first performs the preprocessing and demodulation to filter the interference and noise. Then, it extracts the effective features from the nonlinear responses via wavelet-based analysis. After that, a fine-tuned classification algorithm is developed to recognize the e-device type. The result will eventually be displayed on the smartphone to the inspector.\n\n\nA PORTABLE AND COST-EFFECTIVE MMWAVE PROBE DESIGN\n\nIn this section, we introduce the hardware design of E-Eye, which is capable of transmitting the 24GHz carrier signal and capturing the returned nonlinear responses.\n\n\nHardware Architecture\n\nThe schematic of the proposed mmWave probe is shown in Figure 6. It consists of a radio frequency board and a baseband board. The RF board includes a pair of array antennas (i.e., Tx and Rx), a voltage controlled oscillator (VCO), a pair of low noise amplifiers (LNA) and a six-port structure. The baseband board contains baseband amplifiers (BA) and an on-board sawtooth voltage generator (SVG).\n\n\nSix-port Structure.\n\nA six-port circuit is a simple structure, as a quadrature mixer, to down-convert RF signal into baseband, avoiding the use of expensive integrated mixer chips [60]. The six-port structure consists of three quadrature couplers and one ratrace coupler. Ports 1 and 2 of the six-port structure are the inputs for the local oscillator (LO) drive and the RF signal respectively. Four Schottky diodes are connected at ports 3, 4, 5 and 6. Ports 3 are 4 are for the I-channel differential baseband signal, and ports 5 and 6 are for the Q-channel differential baseband signal.\n\n\nCoherence.\n\nCoherence is one of the most important requirements for the mmWave probe to obtain the effective information of the e-device [41,63]. Opposite to sharing the synchronous clocks at the signal generation and acquisition stages, which increases the complexity and cost of the system [47], in E-Eye, the coherence property of the mmWave probe is obtained by simultaneously sampling the reference signal and the baseband signal (see Section 5.1.2). In order to control the VCO, the reference signal is phase locked to the sawtooth voltage signal. In the synchronization procedure, the phase of each beat-signal period is aligned in the digital domain after sampling the reference signal and the baseband signal. Thus, in this method, the synchronous clocks are not demanded to share between the generation and acquisition stages, which simplifies the hardware.  There are three key factors that determine the performance of the mmWave probe, detection range, range resolution and the maximum non-ambiguous wireless signal velocity as follows:\nR d = c f s T 4B , ∆ R = c 2B and υ max = c 4f c T ,\nwhere c is the speed of the light, f s is the sampling frequency on the baseband board and f c is the center frequency, which is 24GHz. A larger detection range R d requires a longer frequency ramp repetition period T and smaller transmitted bandwidth B. However, the higher range resolution ∆ R requires the wider bandwidth B. At the same time, the faster non-ambiguous wireless signal velocity υ max requires the shorter T . Thus there exists a trade-off between the bandwidth and the frequency ramp repetition period in the E-Eye system design.\n\n\nSystem\n\nIntegration. The Federal Communications Commission (FCC) in the United States proposed that new flexible service among the 24GHz band is roughly in the 24-24.45GHz band [22]. Also, the wider bandwidth of the probe means more cost for the probe hardware. Thus, in E-Eye, the bandwidth of the transmitted signal (B) is 450MHz with a center frequency (f c ) of 24GHz, and the transmitted average power is around 8dBm. The frequency ramp repetition period (T ) is 6.45ms. The sampling frequency on the baseband board (f s ) is 192KHz. In addition, an operationalamplifier-based SVG is employed to generate the sawtooth voltage to tune the free running VCO. The frequency of the sawtooth signal and the reference signal is 155Hz.\n\n\nE-DEVICE RECOGNITION\n\nE-Eye listens to the nonlinear response reflected from the e-device and extracts unique identity from it. We first propose preprocessing and demodulation to extract the effective nonlinear response y(t). Then, considering that y(t) is irregular and asymmetric, we employ the wavelet decomposition to obtain the statistical features representing the device inner characteristics. In the end, a fine-tuning classifier is designed.\n\n\nNonlinear Response Preprocessing and Demodulation\n\n5.1.1 Signal Preprocessing. As depicted in Figure 7, the data sensed by the mmWave probe is forwarded through the audio channel as two-channel signals. After parsing the audio signal, we get the baseband signal and the reference signal respectively. The reference signal is usually mixed with high frequencies from ambient noise and thermal noise. Thereby, we employ a filter to remove these components. However, filtering the reference signal of synchronous clock shape is difficult, which requires smoothing the shape and preserving the sharp edge at the same time. Specifically, we apply a Savizky-Golay and median combined filter [20]. Savitzky-Golay filter mainly fits successive sub-sets of adjacent data points with a low-degree polynomial by the method of linear least squares. Although it is more effective at preserving the sharp edge for the pertinent high frequency components in the signal, it is less effective in noise filtering. Thus, the median filter is combined as it runs through the signal entry by entry, replacing each entry with the median of neighboring entries to remove the high frequency noise. Figure 8(a), we observe the reference signal has an edge effect on the baseband signal, making some parts distorted. Therefore, we utilize the reference signal to extract the effective parts in the baseband signal. First, we define that a cycle is the interval wave between the falling and rising edges of two adjacent pulses in the reference signal (see Figure 8(b)). Specifically, we use the falling and rising edges detection method to locate each cycle [50]. With the cycle information, we demodulate and extract the effective parts in the baseband signal based on the synchronized time. As a result, we obtain the effective nonlinear response signal consisting of N consecutive cycles in Figure 8(c). Intuitively, the signal with more cycles will contain more unique physical characteristics of the e-device and thereby achieve better recognition accuracy. However, it also increases the computation overhead. To balance this trade-off, we empirically choose N = 5 and the corresponding original baseband signal has the length within 0.013s (we will investigate the performance of E-Eye with different N setups in Section 7.1.2).\n\n\nSignal Demodulation. As shown in\n\n\nWavelet-based Nonlinear Response Analysis and Feature Extraction\n\nGiven the nonlinear response signal, we find it is hard to classify them directly using the similarity distance because nonlinear responses have a large variation in magnitudes as well as frequencies, which leads to irregularity and asymmetry. Therefore, we present the wavelet-based analysis which is resilient to the scale and magnitude variation.\n\n\nWavelet-based Nonlinear Response\n\nAnalysis. Wavelet transform (WT) is an effective multi-resolution analysis tool for signal decomposition [29,40]. The WT approach can overcome the shortcoming of Fourier analysis, which only works in the frequency domain, not in the time domain [34]. The signal can be decomposed into many groups of coefficients in different scales with WT through different scaled versions. After removing the DC component, y(t) becomes a signal with zero-mean and some variance and satisfies the following condition:\n\n∫ ∞ −∞ f (t)dt = 0, which indicates y(t) is a waveform . WT uses ψ a,b and ϕ a,b , where ϕ a\n,b = 1 √ a ϕ( t −b a ) and ψ a,b = 1 √ a ψ ( t −b a )\n, as the mother wavelet function that satisfies the condition of dynamic scaling and shifting, where a and b are the scale and translation parameters accordingly [55]. In order to get high and low-frequency signal properties separately, the waveletbased analysis is achieved as Equation (2):\ny(t) Nonlinear response = 1 C ϕ ∫ ∞ −∞ F W (a 0 , b)ϕ a 0 ,b db √ a 0\nT he appr ox imat ion par t\n+ 1 C ψ ∫ ∞ a 1 ∫ ∞ −∞ F W (a, b)ψ a,b da a 2 db √ a ,\nT he det ail par t\n\nwhere F W (a 0 , b) and F W (a, b) are the coefficients. For the inverse transform to exist, we require that the analyzing wavelet satisfies the admissibility condition, given in the following:\nC ϕ = 2π ∫ ∞ −∞ |φ(ω) | 2 ω dω < ∞ and C ψ = 2π ∫ ∞ −∞ |ψ (ω) | 2 ω dω < ∞, whereφ(ω) andψ (ω)\nare the Fourier transform of ϕ(t) and ψ (t) respectively. Also, C ϕ and C ψ are constants for corresponding wavelets. Subsequently, we get the approximation signal as shown in Figure 9(a) and the detail signal in Figure 9(b). Finally, for comprehensive characterization of the nonlinear response, we also get the spectral approximation and detail signals by Fast Fourier Transform (FFT) for further feature extraction.\n\n\n5.2.2\n\nSpatial-temporal Domain Feature Extraction. As the above mentioned, the nonlinear response contains the unique identity of the device. As a result, we exploit the internal traits in the nonlinear response signal by extracting extract 13 scalar features in spatialtemporal domains. The feature names and descriptions are listed in Table 1 and 2. These features represent the nonlinear response signal shape from different aspects [19]. For example, skewness is a scale of symmetry to judge if a distribution looks the same to the left and right of the center point, kurtosis is to estimate whether the data are heavy-tailed or light-tailed relative to a normal distribution and flatness describes the degree to which they approximate the Euclidean space of the same dimensionality (marked with * in Table  1 and 2). Thus, in total, a feature vector containing these 26 features from the approximation and detail parts is formed.\n\n\nFine-tuning Recognition\n\nElectronics recognition can be treated as a classification problem. E-Eye uses supervised learning to classify e-device types, beginning with a training phase followed by testing, as illustrated in Algorithm 1. However, it is possible that some e-devices (known as alien devices) are not included in the database before, which may spoof the check or cause false alarms. Therefore, to overcome  this problem, we design the Classifier and the Decision maker to output the final recognition result.\n\nDuring the training of the Classifier, n traces of nonlinear response signals from each e-device type are collected. For m e-device types in the database (namely, m pre-registered classes), n × m feature vectors are used to train the classifier altogether. In E-Eye, we employ SVM. The Gaussian radial basis function is selected as the kernel function to map the original data to a higher dimensional space [56]. During the testing phase, E-Eye collects a trace, extracts a feature vector, and inputs to the SVM model. The SVM model   \n\n\nName\n\nDescription \nMean Valuex = 1 N N i=1 x(i) Standard Deviation σ = 1 N −1 N i=1 (x(i) −x) 2 * Skewness γ = 1 N N i=1 ( x (i)−x σ ) 3 * Kurtosis β = 1 N N i=1 ( x (i)−x σ ) 4 − 3 RMS Amplitude λ = 1 N N i=1 (x(i)) 2 Lowest Value l = min N i=1 x(i) Highest Value h = max N i=1 x(i)Name Description Mean Valueȳ = 1 N N i=1 y(i) Standard Deviation σ = 1 N −1 N i=1 (y(i) −ȳ) 2 * Skewness γ = 1 N N i=1 y(i)−ȳ σ 3 * Kurtosis β = 1 N N i=1 y(i)−ȳ σ 4 − 3 Crest Factor ε = 20 log( max N i =1 |y(i) | σ ) * Flatness F s = ( N i=1 y m (i)) 1 N ⧸(( N i=1 y m(i) )⧸N )\ngenerates the probability set of classifying this test trace into each pre-trained class.\n\nIn the Decision maker, we define the maximum probability as the classification score. To distinguish an alien device, a threshold is applied: If the classification score is less than the threshold, the trace will be declared as an alien device with a second manual check; if not, the predicted type with the maximum probability will be regarded as the recognition result. In E-Eye, we select the threshold as 0.9 empirically.  The prototype of the proposed mmWave probe is shown in Figure  10. The flexible RF board is based on a 0.245mm (0.0096in) thick substrate Rogers RT/duroid 5880 (Figure 10(a)). The rigid baseband board is fabricated on an FR4 substrate, which includes the SVG Figure 11: Commodity electronic devices in our study. and the baseband amplifiers (Figure 10(b)). The Microprocessor Control Unit (MCU) is MSP430F2610, a widely used ultra low-power controller unit [5]. The baseband signals are fed to a 3.5mm audio jack directly supported by embedded MCU inner driver, which naturally has two channels for the reference signal and baseband signal without the extra need of the analog-to-digital converter or expensive communication chips. It can be easily connected to the audio interface of a smartphone or a tablet for signal processing.\n\n\nSYSTEM PROTOTYPE AND EVALUATION 6.1 E-Eye System Implementation and Integration\n\nThe mmWave probe is 11.8cm (4.65in) × 4.5cm (4.65in) × 1.5cm (0.59in) and weights only 45.4д, which is lightweight for ease of adoption in security inspections. Moreover, it costs within 100 U.S. dollars. Figure 10(c) illustrates the integrated proposed mmWave probe. It typically has a 8dBm transmit power with a 3.7-5V supply voltage and a 350mA maximum operating current under the 1.2W DC power consumption. The carrier frequency used in this work is 24GHz. To enhance the directivity, a pair of 4 × 4 antenna arrays are designed, offering an antenna directivity of 19.8dBi. The received RF gain and baseband gain are 34dB and 26dB, respectively.  Table 3, we select 46 common e-devices and label them into 39 classes as we collect four duplicate Nexus 5 and three duplicate Uno R3. We also group them into seven categories based on their functions for ease of description. The corresponding circuit sizes range from 0.42in (diagonal)  13.3in (diagonal). Without loss of generality, we employ two common containers to conceal the e-devices: a USPS package box (marked as Box1) and an Amazon package box (named as Box2).\n\n\nEvaluation\n\nData Collection: During the experiment, the mmWave probe is placed 20cm from the container (see Figure 12). We record its initial position as 0 • orientation in the horizontal plane. In every test trail, we conceal an e-device in one particular box and switch it on (if possible). We collect 10s sensing data with 44.1K sampling rate. In Section 5.1.2, we define one trace as the subsegment in the sensing data with the length of 0.013s (13ms), which contains N = 5 consecutive cycles. Eventually, we will randomly extract 100 traces for each device with regard to one container.\n\nData Partition: Unless specified, each time we randomly choose 70 out of 100 traces from each device as our training set and use the rest for testing. Thus, 3220 traces are used for training and 1380 traces are used for testing. Specifically, a 10-fold cross validation method is employed in classification. It is worth mentioning that we conduct other types of cross validation experiments in Section 7.2 and 7.3 to examine the system performance under real-world environments.\n\nEvaluation Metrics: We use accuracy, precision and recall as the performance metrics for evaluation [44]. Besides, we also adopt the Equal Error Rate (EER) and the Receiver Operating Characteristic (ROC). The lower the EER, the better the system performance [18].\n\n\nPERFORMANCE EVALUATION\n\nWe evaluate the performance of E-Eye from three aspects:\n\n• The control study validates the system under the ideal environmental condition, which proves the legitimacy of our system design.\n\n• The field study considers the variation of system parameters in the practical usage and gives insights to how to achieve the best performance. • The threat study exploits the vulnerability of the system from the attacker's perspective by examining more extreme conditions. These three strategies serve different roles, which are complementary to each other.\n\n\nE-Eye Control Study\n\n7.1.1 Recognition Performance. We evaluate the ability of E-Eye to recognize the different e-devices in the optimal lab environment. First, we exploit the overall performance based on the training and testing data sensed from Box1 and Box2 respectively (denoted as Scheme1 and Scheme2). Then, we further apply the testing data from Box2 upon the training data from Box1 to study the system's universality (denoted as Scheme3). For each scheme, we make a comparison between two commonly used classifiers, SVM and KNN [61], to determine which classifier is more suitable. The ROC results are shown in Figure 13. SVM achieves the EER of 0.0044, 0.0045 and 0.0111 respectively in three schemes. Correspondingly, KNN achieves the EER of 0.0647, 0.0669 and 0.0848 respectively. Both classifiers have excellent performance, which implies that the feature vector effectively reflects the unique nonlinear response characteristics in each e-device. The comparatively low EER in scheme3 indicates that our trained classifier does not have the over-fitting issue and can adapt to various usage scenarios.\n\nMoreover, we conduct the McNemar test to determine if there is a significant difference in two classifiers [24]. McNemar test is a frequently used test for matched-pair data, with a significance level of α = 0.05. Under the null hypothesis, the two classifiers have no significant difference. If the null hypothesis is rejected, the p value is below 0.05. In our test, the p value maintains around 0.01, which is less than 0.05 and thereby rejects the null hypothesis. Based on the above analysis, we prove that SVM has the better classifier and will employ SVM in the following evaluation unless otherwise specified. In conclusion, our results demonstrate that a hidden e-device can be precisely recognized by E-Eye. 7.1.2 Screening Time Efficiency. In public security, e-device screening tasks are challenging due to the limited time budgeted for efficiency. As a result, we are interested in analyzing the performance of E-Eye with regard to different time budgets. Specifically, considering that 2.5ms audio segment usually represents one cycle, we manually select seven different time settings between 2.5ms to 100ms. For each time setting, we follow the same methodology described in Section 6.2 and re-prepare the training and testing set. Figure 14 shows the performance results. For the lowest budget of 2.5ms, E-Eye only obtains 95.25% precision, 94.95% recall and 95.47% accuracy. These results are because the contained one cycle cannot comprehensively represent the characteristics of the e-device. After increasing the time, the performance gradually increases. Generally, we find a turning point at 13ms where the performance saturates afterwards (reaching 99.61% precision, 99.41% recall and 99.68% accuracy at 100ms). This observation can guide us to the proper screening time setting to guarantee recognition accuracy without sacrificing screening efficiency.\n\n\nImpact of Sensing Distance and Device Orientation.\n\nIn practical scenarios, the inspector should be able to walk around with E-Eye according to different container shapes and inspection environments to accelerate inspection progress. Such a convenient practice, however, will lead to the changing distance and orientation between the hidden e-device and the mmWave probe. Therefore, it is important to investigate whether these aspects will affect system performance. Specifically, we measure the different device orientations (from 0 • to 315 • ) at different distances (from 2cm to 100cm). The results are shown in Figure 15. The average recognition accuracy over 46 devices remains high when the sensing distance varies within 80cm (above 99.5%). As for the orientation, although the reflected signal slightly changes due to the different probe angles for each e-device, the inter-device distinguishability among 46 devices is significant such that each device can be correctly recognized. Thereby, E-Eye can facilitate portable and convenient public screening in real practice.\n\n\nField Study\n\n7.2.1 Robustness to Ambient Environment. The ambient environment can introduce random noises or even interfere with the probe hardware operation. We consider common noises in daily life in terms of human factors and ambient factors. Typically, we  select four conditions where (1) five people are walking around the mmWave probe within 2 meters range; (2) the humidity of the testing location is controlled at 70%; (3) the environment temperature is 0 • C (32 • F); (4) There is a working ventilation around. Moreover, we use the result of the optimal lab environment as the comparison target (humidity is 30% and the temperature is 20 • C (68 • F)). Again, we evaluate the above four conditions using 46 e-devices with scheme1. Figure 16 shows that their performances can achieve up to 99.6% precision, 99.3% recall and 99.6% accuracy. In conclusion, E-Eye presents a strong tolerance to different ambient environments. 7.2.2 Impact of Alien Devices. As discussed in Section 5.3, it is highly likely that E-Eye needs to classify the traces of the alien devices. In this section, we design an experiment to explore the ability of E-Eye to detect alien devices. In detail, we randomly include 9 out of 39 classes in the database as the training set as aforementioned (note that these data are never used for testing). Consequently, the remaining 30 classes are all regarded as the alien ones. Afterwards, we gradually increase the amount of alien devices from 5 to 30 and verify whether our specifically designed Algorithm 1 can successfully identity them. For each amount, we report the average performance. As shown in Figure 17, the results remain stable in detection accuracy (99.1%-100%) showing no tendency to decrease in performance. In this way, we prove the effectiveness of fine-tuning the algorithm and the good scalability of E-Eye when used in real practice. Under these circumstances, the inspector can use the second check (e.g., manual inspection) for further security verification. \n\n\nThreat Model Study\n\n7.3.1 Human Body Intervention. Due to the advanced IC technology, e-devices are getting smaller in size such that they can be easily hidden upon the human body to bypass the security check. Therefore, we assume the attacker hides the device in different body positions, as listed in Figure 18. We specifically consider the devices in groups 3 and 4 as they are pervasive and can be used in multiple malicious activities (see Table 3). We recruit five participants carrying the device and we use E-Eye to scan them at target areas keeping an approximate distance of 50cm. The reported average accuracy keeps higher than 97.7%, which implies that our system is resistant to human intervention. 7.3.2 Impact of Cover Materials. We consider the scenario where the attacker intentionally hides the e-device in other materials to pass through screening. Particularly, we collect seven different daily-achievable materials as shown in Figure 19. We place the e-device inside each of them and evaluate the recognition accuracy for all 46 e-devices. The performance is reported in the figure, where we can see that the overall accuracy for each is above 98%. Certain materials slightly affect the performance to some extent. This is because E-Eye utilizes high frequency signal and therefore, has small wavelength and limited penetration ability. As a result, it is prone to the scattering reflection upon some specific materials. But in general, E-Eye still provides reliable performance in device recognition. \n\n\nImpact of Combined E-devices.\n\nIn another scenario, the attack may know the benign devices registered in the database and try to physically stack the malicious device with the benign one to confuse the system. To explore whether E-Eye can still regard it as the alien device, we continue with the setup in Section 7.2.2. We randomly select 2 (labeled as No.1, No.2) devices from the 9 benign classes and 3 (labeled as No.3, No.4, No.5) from the remaining 30 alien classes. As shown in Figure 20, we enumerate all six combinations of the benign and alien devices and physically tap them together. For the sake of generality, we report the average and standard deviation of accuracy. From the results, we can observe that the average recognition accuracy are higher than 98%. This is owing to the fact that the equivalent circuit changes if we combine two devices together along with the nonlinear response. \n\n\nImpact of E-device Status.\n\nConsidering the fact that many detection methods rely on the operation status of the hidden device (see Section 9.1), we simulate a scenario where the attacker wants to spoof the inspector by switching off the device or removing the battery. Thus, we repeat the experiment by shutting down all e-devices when collecting the data (as described in Section 6.2). Importantly, we still use the previously trained model where the devices were switched on. We apply the new 30 traces for each device for this test. Table 4 illustrates the precision, recall and accuracy for schemes 1 and 2, which are 99%. For scheme3, the accuracy is 98.75% which is in coherence with the results in Section 7.1.1. The high accuracy proves that E-Eye is not sensitive to the hidden device's operation status. Metal Intervention: Metal has a stronger reflection on EM wave compared to other materials. We realize that a metal case shields a large portion of RF signals. By deploying an additional metal hidden material (e.g., an e-device inside a metal box), it is difficult for E-Eye to recognize the covered e-device. This limitation can be solved by detecting the existence of metal [59].\n\nManual Check: We notice that mechanical motion in the electronic device and other intruders can affect the sensing performance. However, it is safe to assume that the security checker controls the environment thoroughly. If an unusual behavior happens, they initiate a manual check.\n\nDatabase Storage: In this pioneering work, we have established 39 classes of an e-device database. Particularly, each feature vector has 26 dimensions data of size 0.2KB around. Thus, the template for each device seizes 14KB size data in the experiment setup. Therefore, it is practical to maintain a vast amount of templates on the mobile platform or the server (e.g., 1,000 e-device types only require 13.67MB physical storage).\n\nMultiple E-devices: Nowadays, it is normal for more than one e-device to be concealed in a container [11]. Therefore, it can bring huge convenience if E-Eye can automatically recognize each type when multiple devices are present. This problem can be further solved by employing the existing blind source separation and independent component analysis approaches in the speech processing domain [21,65].\n\n\nRELATED WORK 9.1 Hidden E-device Detection\n\nCurrently, there are three main methods to detect hidden e-devices:\n\n• X-ray Imaging: The X-ray baggage scanner operates based on the different X-radiation absorption rates of the penetrated objects and can accordingly produce the shape image of the objects [23]. The typical cost of such a scanner can reach US $50,000. Besides the undesired privacy concerns raised by the image of personal belongings [30], x-radiation also has harmful effects on human [30,53].\n\n• Terahertz Imaging: Terahertz (THz) imaging is also exploited in package screening by analyzing object transmissions or reflections of the THz electromagnetic wave. However, its optical image causes privacy issues and its resolution is too low for hidden e-devices recognition [38]. The current THz imaging systems have very low portability and extremely high cost (around US $25,000) [12,25].\n\n• Electromagnetic Emission Sensing: Studies find that edevices transmit unintentional electromagnetic (UEM) radiations [51] when they are switched on. Many works [31,57,62] detect the existence of e-devices by analyzing their UEM waves. However, this technology is restricted and cannot be applied when the electronic device is powered off. Therefore, we summarize that the current hidden e-devices recognition methods are either bulky, expensive or conditionally restrained, which cannot be directly applied in regular and large-scale public security check. Other alternative handheld scanners [9,30] can only provide the existence detection rather than accurately recognize the device type.\n\n\nmmWave Sensing\n\nmmWave radars have been studied in a variety of domains based on the detection of an object's inherent movements (e.g., cardiorespiratory measurements and gesture sensing [32,36,37]) in the last decade. Soli [35] is a 60GHz mmWave radar gesture sensing system, which can detect all kinds of hand motions for the humancomputer interface. In [43], a 94GHz mmWave radar is deployed to extract features of cardiorespiratory movements based on the reflected mmWave signals. These mmWave sensing applications mainly rely on the Doppler motion of the objects and cannot be applied to sense the target under clothings or obstacles (e.g., packages and luggages). Although there are some recent applications to explore \"through-wall\" and \"through-obstacle\" sensing via mmWave [17,64,66], these techniques can only be applied for the target with specific mmWave-absorption characteristics. According to the literature, E-Eye is the first mmWave sensing application to explore nonlinear effects for hidden electronics recognition.\n\n\nCONCLUSION\n\nIn this paper, we proposed a hidden e-device recognition system E-Eye, to aid law enforcement and ensure security. We started from the basics characteristics of the e-device and cover material under the nonlinear effect. Then, we proposed a portable 24GHz mmWave probe and the e-device recognition module to accurately recognize the hidden e-device type. Furthermore, extensive experiments indicated that our E-Eye can achieve more than 99% accuracy in less than 20ms response time and centimeter level device physical size. Different levels of evaluation confirmed the effectiveness, reliability and robustness of our proposed system. The research findings are an essential step for understanding the nonlinear response of hidden e-device and their applications at large.\n\nFigure 1 :\n1Examples of hidden electronics in different malicious applications. The proposed E-Eye system can detect and recognize hidden electronic devices under different circumstances in real world.\n\nFigure 3 :\n3Six different e-devices present different nonlinear responses (the spectrums in the white box are distinct in frequency and amplitude) when forced by the same mmWave probe. The main circuit board of each e-device is displayed on the left.\n\n( b )\nbThe significant difference of two responses in spectrum.\n\nFigure 4 :\n4The cardboard's nonlinear responses are negligible when compared to Nexus 5's, indicating the feasibility of hidden e-device recognition.\n\nFigure 5 :\n5The system overview for E-Eye to non-invasively recognize the e-device hidden in the container. It comprises of a mmWave sensing module in the front-end and an e-device recognition module in the back-end.\n\nFigure 6 :\n6The hardware schematic for the cost-effective and portable 24GHz mmWave probe.4.2 System Integration Design4.2.1 System Parameters Consideration.Parameters in the mm-Wave probe design are significant and should be carefully selected.\n\nFigure 7 :\n7The flowchart of e-device recognition module, including three parts signal preprocessing and demodulation, waveletbased nonlinear response analysis & feature extraction and fine-tuning recognition.\n\n\nbaseband signal parsed from the audio signal. (b) The preprocessed reference signal.(c) The nonlinear response signal after the signal demodulation.(d) The spectrum for the nonlinear response signal.\n\nFigure 8 :\n8A Nexus 5 smartphone is sensed within a USPS box at 20cm distance using the portable 24GHz mmWave probe. We preprocess and demodulate the raw sensing signal to extract the nonlinear response.\n\n\napproximation and detail parts of the Nexus 5 nonlinear response signal.(b) The spectrum for the approximation and detail parts of the Nexus 5 nonlinear response signal.\n\nFigure 9 :\n9The first level wavelet decomposition result of Nexus 5 nonlinear response. (a) and (b) represent its low and high frequency information respectively.\n\nAlgorithm 1 :R\n1Fine-tuning Recognition Input: Q(n): n test nonlinear response traces from an e-device Output: R: the predicted result 1 E i , S, R ← 0; 2 Initialize T ; 3 %Classifier: 4 for i ∈ {1, . . . , = Rec(E); ▷ Decide the final predicted result return R;\n\n\nThe integrated mmWave probe with two boards.\n\nFigure 10 :\n10The design of 24GHz mmWave front-end probe comprises two parts, i.e., (a) a radio-frequency Tx/Rx board and (b) a down-frequency baseband board. E-Eye probe integration is shown in (c).\n\nFigure 12 :\n12The setup for the evaluation: (a) in a controlled lab environment, (b) in an open hall at the first floor of the building, and (c) at the entrance of an outdoor public parking lot. Experiment Preparation: As shown in\n\nFigure 13 :\n13The overall performance of E-Eye with two different classification configurations.\n\nFigure 14 :\n14Recognition performance with seven different screening times.\n\nFigure 15 :\n15Measurement accuracy under different sensing distances.\n\nFigure 16 :\n16E-Eye recognition performance in different experiment setups.\n\nFigure 17 :\n17The alien device detection under six different alien device numbers.\n\nFigure 18 :\n18Detection accuracy under six different human interventions.\n\nFigure 19 :\n19Detection accuracy with six different cover materials.\n\nFigure 20 :\n20Detection of combined e-devices.\n\nTable 1 :\n1List of Time Domain Features.\n\nTable 2 :\n2List of Frequency Domain Features.\n\nTable 3 :\n3E-devices employed during experiments.# \nDevice \nCategory \nSpecific Device Brand \n\n1 \nLaptop \nLenovo Xiaoxin310, Macbook Air, Asus \nLN4200, Macbook Pro, Mac mini \n2 \nTablet \niPad Pro, Asus ZenPad 3S, Nexus 10 \n\n3 \nSmart-\nphone \n\nNexus 5*4, iPhone 6s, iPhone 6, iPhone X*2, \niPhone 7plus, LG Leon, Nexus4, Smartisan \nT1*2, Jianguo Pro2, iPhone 4s, HTC One M8, \nSamsung S7 \n\n4 Wearable \nMotor 360, Apple watch3, Fitbit Charge2, Mi \nband2 \n\n5 \nMouse \nLogitech M510, Rapoo 7200P, Dell MS111 \n\n6 \nHead-\nphone \n\nBose QuietComfort 35, Status Audio CB-1, \nAir Pods \n\n7 \nOthers \n\nAuduino Uno R3*3, iPhone Charger, Empty \nBox1, Empty Box2, Philips Sonicare 2 Series, \nPhilips Norelco PQ208, Toshiba Canvio \nBasics, Kindle Paperwhite, Pisen power bank \n\nto \n\nTable 4 :\n4System performance with the e-device status OFF at 50cm sensing distance.Health Hazards: Compared to other security screening techniques (e.g., Terahertz and X-ray imaging systems), E-Eye has a much smaller radiation factor, i.e., a 1.2W power consumption and an 8dBm radio transmission power. Considering that typical public WiFi spots have about 20 to 30 dBm of output power, E-Eye is a considerably safe screening tool, even for cardiac device patients.Setup \nPrecision(%) Recall(%) Accuracy(%) \nScheme1 \n99.54 \n99.24 \n99.57 \nScheme2 \n99.51 \n99.20 \n99.55 \nScheme3 \n98.70 \n98.52 \n98.75 \n\n8 DISCUSSION \n\n\nACKNOWLEDGMENTSWe thank all anonymous reviewers for their insightful comments on this paper. This work was in part supported by the National Science Foundation under grant No. 1718375/1718483.\nIS turns hobby drones into remote-control bombs. Accessed, Accessed: 2018-1-11. IS turns hobby drones into remote-control bombs. https://nakedsecurity.sophos.com/2017/01/19/is-turns-hobby-drones-into-rem ote-control-bombs/.\n\nAccessed, ISM band. Accessed: 2018-1-11. ISM band. https://en.wikipedia.org/wiki/ISM_band.\n\nOnline 'Training Manual' Teaches Sympathizers How to Disguise Themselves as Westerners and Build Bombs to Carry Out Attacks. Accessed, ISIS. Accessed: 2018-1-21. ISIS' Online 'Training Manual' Teaches Sympathizers How to Disguise Themselves as Westerners and Build Bombs to Carry Out Attacks. https://www.christianpost.com/news/isis-training-manual-teaches-sympathiz ers-how-to-disguise-themselves-as-westerners-and-build-bombs-to-carry-o ut-terror-attacks-139253/.\n\nMobile-phone cheating in exams on the rise. Accessed, Accessed: 2018-1-21. Mobile-phone cheating in exams on the rise. https://www. cnet.com/news/mobile-phone-cheating-in-exams-on-the-rise/.\n\nAccessed, MSP430 Microcontrollers With CapTIvate Touch Technology. Accessed: 2018-2-19. MSP430 Microcontrollers With CapTIvate Touch Technology. http://www.ti.com/lit/wp/slay044/slay044.pdf.\n\n. Accessed, Sound cardAccessed: 2018-3-13. Sound card. https://en.wikipedia.org/wiki/Sound_card.\n\nBombs disguised as rocks in Yemen reportedly show Iran aid. Accessed, Accessed: 2018-3-21. Bombs disguised as rocks in Yemen reportedly show Iran aid. https://www.defensenews.com/global/mideast-africa/2018/03/26/bombs-dis guised-as-rocks-in-yemen-reportedly-show-iran-aid/.\n\n. Accessed, International Telecommunication Union. Accessed: 2018-3-22. International Telecommunication Union. https://www.itu. int/en/Pages/default.aspx.\n\nMillimeter Scanning at Airports: Is It Worth the Cost?. Accessed, Accessed: 2018-3-23. Millimeter Scanning at Airports: Is It Worth the Cost? https://www.securitymagazine.com/articles/79508-millimeter-scannin g-at-airports-is-it-worth-the-cost-1.\n\nAccessed, 5G mmWave: the next frontier in mobile broadband. Accessed: 2018-3-31. 5G mmWave: the next frontier in mobile broadband. https: //www.qualcomm.com/invention/technologies/5g-nr/mmwave.\n\n. Accessed, Digital Consumers Own 3.2 Connected DevicesAccessed: 2018-3-31. Digital Consumers Own 3.2 Connected Devices.\n\nFeatures of the Terahertz technology in security applications. Accessed, Accessed: 2018-3-31. Features of the Terahertz technology in security applications. http://terasense.com/news/thz-in-security/.\n\nGeddes town supervisor's secretary faces felony for. Accessed, Accessed: 2018-3-31. Geddes town supervisor's secretary faces felony for eavesdropping on co-workers. http://www.syracuse.com/crime/index.ssf/2016/ 12/geddes_town_supervisors_secretary_faces_felony_for_evesdropping_on_ co-workers.html.\n\n. Accessed, Package Explosion in Austin. Accessed: 2018-3-31. Package Explosion in Austin. https://www.washingtonpost .com/news/morning-mix/wp/2018/03/20/package-believed-to-be-bound-for-a ustin-explodes-at-texas-\\fedex-facility-police-say/?utm_term=.8b593439781e.\n\nPhone and Electronic Device Policy. Accessed, Accessed: 2018-3-31. Phone and Electronic Device Policy. https://collegereadine ss.collegeboard.org/sat/taking-the-test/phone-electronic-device-policy.\n\nUse of Cell Phones, Laptops, and Other Electronic Devices by Visitors. Accessed, Accessed: 2018-3-31. Use of Cell Phones, Laptops, and Other Electronic Devices by Visitors. https://www.cadc.uscourts.gov/internet/home.nsf/Content/VL+-+ Courthouse+-+Cell+Phones+Laptops+and+Other+Electronic+Devices.\n\nFadel Adib, Dina Katabi, See through walls with WiFi!. ACM43Fadel Adib and Dina Katabi. 2013. See through walls with WiFi! Vol. 43. ACM.\n\nGuide to biometrics. M Ruud, Jonathan H Bolle, Sharath Connell, Pankanti, K Nalini, Andrew W Ratha, Senior, Springer Science & Business MediaRuud M Bolle, Jonathan H Connell, Sharath Pankanti, Nalini K Ratha, and An- drew W Senior. 2013. Guide to biometrics. Springer Science & Business Media.\n\nLibxtract: a Lightweight Library for audio Feature Extraction. Jamie Bullock, Conservatoire, ICMC. Jamie Bullock and UCEB Conservatoire. 2007. Libxtract: a Lightweight Library for audio Feature Extraction.. In ICMC.\n\nCombining Savitzky-Golay filters and median filters for reducing speckle noise in SAR images. Chedsada Chinrungrueng, IEEE International Conference on. IEEE1Systems, Man and CyberneticsChedsada Chinrungrueng. 2003. Combining Savitzky-Golay filters and median fil- ters for reducing speckle noise in SAR images. In Systems, Man and Cybernetics, 2003. IEEE International Conference on, Vol. 1. IEEE, 690-696.\n\nBlind source separation and independent component analysis: A review. Seungjin Choi, Andrzej Cichocki, Hyung-Min Park, Soo-Young Lee, Neural Information Processing-Letters and Reviews. 6Seungjin Choi, Andrzej Cichocki, Hyung-Min Park, and Soo-Young Lee. 2005. Blind source separation and independent component analysis: A review. Neural Information Processing-Letters and Reviews 6, 1 (2005), 1-57.\n\nUse of spectrum bands above 24 GHz for mobile radio services. Fed Regist. 81Federal Communications Commission and othersFederal Communications Commission and others. 2016. Use of spectrum bands above 24 GHz for mobile radio services. Fed Regist 81, 164 (2016), 58270-58308.\n\nX-ray systems for security and industrial inspection. Christine Connolly, 10.1108/02602280810882535Sensor Review. 28Christine Connolly. 2008. X-ray systems for security and industrial inspection. Sensor Review 28, 3 (2008), 194-198. DOI:http://dx.doi.org/10.1108/02602280810 882535\n\nThe McNemar test for binary matched-pairs data: mid-p and asymptotic are better than exact conditional. Stian Morten W Fagerland, Petter Lydersen, Laake, BMC medical research methodology. 1391Morten W Fagerland, Stian Lydersen, and Petter Laake. 2013. The McNemar test for binary matched-pairs data: mid-p and asymptotic are better than exact conditional. BMC medical research methodology 13, 1 (2013), 91.\n\nTHz imaging and sensing for security applications: explosives, weapons and drugs. Brian John F Federici, Feng Schulkin, Dale Huang, Robert Gary, Filipe Barat, David Oliveira, Zimdars, S266. 20John F Federici, Brian Schulkin, Feng Huang, Dale Gary, Robert Barat, Filipe Oliveira, and David Zimdars. 2005. THz imaging and sensing for security appli- cations: explosives, weapons and drugs. Semiconductor Science and Technology 20, 7 (2005), S266. http://stacks.iop.org/0268-1242/20/i=7/a=018\n\nThe impact of RF front-end characteristics on the spectral regrowth of communications signals. G Kevin, Lawrence E Gard, Michael B Larson, Steer, IEEE Transactions on Microwave Theory and Techniques. 53Kevin G Gard, Lawrence E Larson, and Michael B Steer. 2005. The impact of RF front-end characteristics on the spectral regrowth of communications signals. IEEE Transactions on Microwave Theory and Techniques 53, 6 (2005), 2179-2186.\n\nNonlinear distortion in wireless systems: Modeling and simulation with MATLAB. M Khaled, Gharaibeh, John Wiley & SonsKhaled M Gharaibeh. 2011. Nonlinear distortion in wireless systems: Modeling and simulation with MATLAB. John Wiley & Sons.\n\nNonlinear microwave circuit design. Franco Giannini, Giorgio Leuzzi, John Wiley & SonsFranco Giannini and Giorgio Leuzzi. 2004. Nonlinear microwave circuit design. John Wiley & Sons.\n\nAnalysis of harmonics in power system using wavelet transform. U Gudaru, Vishal B Waje, Electrical, Electronics and Computer Science (SCEECS), 2012 IEEE Students. U Gudaru and Vishal B Waje. 2012. Analysis of harmonics in power system using wavelet transform. In Electrical, Electronics and Computer Science (SCEECS), 2012 IEEE Students' Conference on. IEEE, 1-5.\n\nSecurity Pre-screening of Moving Persons Using a Rotating Multichannel W -Band Radar. S Hantscher, B Schlenther, M Hagelen, S A Lang, H Essen, A Tessmann, A Hulsmann, A Leuther, M Schlechtweg, 10.1109/TMTT.2011.2181534IEEE Transactions on Microwave Theory and Techniques. 603S. Hantscher, B. Schlenther, M. Hagelen, S. A. Lang, H. Essen, A. Tessmann, A. Hulsmann, A. Leuther, and M. Schlechtweg. 2012. Security Pre-screening of Moving Persons Using a Rotating Multichannel W -Band Radar. IEEE Transactions on Microwave Theory and Techniques 60, 3 (March 2012), 870-880. DOI:http://dx.doi.org/10.1109/TMTT.2011.2181534\n\nSimulation and Detection of Unintended Electromagnetic Emissions From Super-Regenerative Receivers. J Hertenstein, S Jagannathan, 10.1109/TIM.2013.2248290IEEE Transactions on Instrumentation and Measurement. 627J. Hertenstein and S. Jagannathan. 2013. Simulation and Detection of Unin- tended Electromagnetic Emissions From Super-Regenerative Receivers. IEEE Transactions on Instrumentation and Measurement 62, 7 (July 2013), 2093-2100. DOI:http://dx.doi.org/10.1109/TIM.2013.2248290\n\nA Self-Calibrating Radar Sensor System for Measuring Vital Signs. M C Huang, J J Liu, W Xu, C Gu, C Li, M Sarrafzadeh, IEEE Transactions on Biomedical Circuits and Systems. 102M. C. Huang, J. J. Liu, W. Xu, C. Gu, C. Li, and M. Sarrafzadeh. 2016. A Self- Calibrating Radar Sensor System for Measuring Vital Signs. IEEE Transactions on Biomedical Circuits and Systems 10, 2 (April 2016), 352-363.\n\nDistinguishing electronic devices using harmonic radar. Handan Ilbegi, Taha Harun, Hayvaci, Radar Conference (RadarConf. Imam Samil Yetik, and Asim Egemen YilmazHandan Ilbegi, Harun Taha Hayvaci, Imam Samil Yetik, and Asim Egemen Yil- maz. 2017. Distinguishing electronic devices using harmonic radar. In Radar Conference (RadarConf), 2017 IEEE. IEEE, 1527-1530.\n\niPPI-Esml: an ensemble classifier for identifying the interactions of proteins by incorporating their physicochemical properties and wavelet transforms into PseAAC. Jianhua Jia, Zi Liu, Xuan Xiao, Bingxiang Liu, Kuo-Chen Chou, Journal of theoretical biology. 377Jianhua Jia, Zi Liu, Xuan Xiao, Bingxiang Liu, and Kuo-Chen Chou. 2015. iPPI- Esml: an ensemble classifier for identifying the interactions of proteins by incor- porating their physicochemical properties and wavelet transforms into PseAAC. Journal of theoretical biology 377 (2015), 47-56.\n\nSoli: Ubiquitous Gesture Sensing with Millimeter Wave Radar. Jaime Lien, M Emre Nicholas Gillian, Patrick Karagozler, Carsten Amihood, Erik Schwesig, Hakim Olson, Ivan Raja, Poupyrev, 10.1145/2897824.2925953ACM Trans. Graph. 35142Jaime Lien, Nicholas Gillian, M. Emre Karagozler, Patrick Amihood, Carsten Schwesig, Erik Olson, Hakim Raja, and Ivan Poupyrev. 2016. Soli: Ubiquitous Gesture Sensing with Millimeter Wave Radar. ACM Trans. Graph. 35, 4, Article 142 (July 2016), 19 pages. DOI:http://dx.doi.org/10.1145/2897824.2925953\n\nCardiac Scan: A Non-contact and Continuous Heart-based User Authentication System. Feng Lin, Chen Song, Yan Zhuang, Wenyao Xu, Changzhi Li, Kui Ren, Proceedings of the 23rd Annual International Conference on Mobile Computing and Networking (MobiCom '17). the 23rd Annual International Conference on Mobile Computing and Networking (MobiCom '17)New York, NY, USAACMFeng Lin, Chen Song, Yan Zhuang, Wenyao Xu, Changzhi Li, and Kui Ren. 2017. Cardiac Scan: A Non-contact and Continuous Heart-based User Authentication System. In Proceedings of the 23rd Annual International Conference on Mobile Computing and Networking (MobiCom '17). ACM, New York, NY, USA, 315-328.\n\nSleepSense: A Noncontact and Cost-Effective Sleep Monitoring System. F Lin, Y Zhuang, C Song, A Wang, Y Li, C Gu, C Li, W Xu, IEEE Transactions on Biomedical Circuits and Systems. 111F. Lin, Y. Zhuang, C. Song, A. Wang, Y. Li, C. Gu, C. Li, and W. Xu. 2017. SleepSense: A Noncontact and Cost-Effective Sleep Monitoring System. IEEE Transactions on Biomedical Circuits and Systems 11, 1 (Feb 2017), 189-202.\n\nTerahertz spectroscopy and imaging for defense and security applications. Hai-Bo Liu, Hua Zhong, Nicholas Karpowicz, Yunqing Chen, Xi-Cheng Zhang, Proc. IEEE. IEEE95Hai-Bo Liu, Hua Zhong, Nicholas Karpowicz, Yunqing Chen, and Xi-Cheng Zhang. 2007. Terahertz spectroscopy and imaging for defense and security applications. Proc. IEEE 95, 8 (2007), 1514-1527.\n\nThermal imaging systems. Lloyd Michael, Springer Science & Business MediaJ Michael Lloyd. 2013. Thermal imaging systems. Springer Science & Business Media.\n\nA theory for multiresolution signal decomposition: the wavelet representation. G Stephane, Mallat, 11Stephane G Mallat. 1989. A theory for multiresolution signal decomposition: the wavelet representation. IEEE transactions on pattern analysis and machine intelligence 11, 7 (1989), 674-693.\n\nNonlinear radar for finding rf electronics: System design and recent advancements. J Gregory, Anthony F Mazzaro, Martone, Ram M Kenneth I Ranney, Narayanan, IEEE Transactions on Microwave Theory and Techniques. 65Gregory J Mazzaro, Anthony F Martone, Kenneth I Ranney, and Ram M Narayanan. 2017. Nonlinear radar for finding rf electronics: System design and recent advancements. IEEE Transactions on Microwave Theory and Techniques 65, 5 (2017), 1716-1726.\n\nCombined linear and nonlinear radar: waveform generation and capture. J Gregory, Kelly D Mazzaro, Sherbondy, Technical Report. ARMY RESEARCH LAB ADELPHI MD SENSORS AND ELECTRON DEVICES DIRECTORATE. Gregory J Mazzaro and Kelly D Sherbondy. 2013. Combined linear and nonlinear radar: waveform generation and capture. Technical Report. ARMY RESEARCH LAB ADELPHI MD SENSORS AND ELECTRON DEVICES DIRECTORATE.\n\nRemote Sensing of Heart Rate and Patterns of Respiration on a Stationary Subject Using 94-GHz Millimeter-Wave Interferometry. I V Mikhelson, S Bakhtiari, T W Elmer, I I , A V Sahakian, 10.1109/TBME.2011.2111371IEEE Transactions on Biomedical Engineering. 586I. V. Mikhelson, S. Bakhtiari, T. W. Elmer II, and A. V. Sahakian. 2011. Remote Sensing of Heart Rate and Patterns of Respiration on a Stationary Subject Us- ing 94-GHz Millimeter-Wave Interferometry. IEEE Transactions on Biomedical Engineering 58, 6 (June 2011), 1671-1677. DOI:http://dx.doi.org/10.1109/TBME. 2011.2111371\n\nMatthan: Drone Presence Detection by Identifying Physical Signatures in the Drone's RF Communication. Phuc Nguyen, Hoang Truong, Mahesh Ravindranathan, Anh Nguyen, Richard Han, Tam Vu, Proceedings of the 15th Annual International Conference on Mobile Systems, Applications, and Services. the 15th Annual International Conference on Mobile Systems, Applications, and ServicesACMPhuc Nguyen, Hoang Truong, Mahesh Ravindranathan, Anh Nguyen, Richard Han, and Tam Vu. 2017. Matthan: Drone Presence Detection by Identifying Physical Signatures in the Drone's RF Communication. In Proceedings of the 15th Annual International Conference on Mobile Systems, Applications, and Services. ACM, 211-224.\n\nPopular internet of things forecast of 50 billion devices by 2020 is outdated. Amy Nordrum, IEEE Spectrum. 18Amy Nordrum. 2016. Popular internet of things forecast of 50 billion devices by 2020 is outdated. IEEE Spectrum 18 (2016).\n\nIntermodulation distortion in microwave and wireless circuits. J Pedro, Carvalho, Artech HouseNorwood, MAJ Pedro and N Carvalho. 2003. Intermodulation distortion in microwave and wireless circuits. Norwood, MA: Artech House. (2003).\n\n24-GHz biomedical radar on flexible substrate for ISAR imaging. Zhengyu Peng, José-María Muñoz-Ferreras, Roberto Gómez-García, Lixin Ran, Changzhi Li, Wireless Symposium (IWS). Zhengyu Peng, José-María Muñoz-Ferreras, Roberto Gómez-García, Lixin Ran, and Changzhi Li. 2016. 24-GHz biomedical radar on flexible substrate for ISAR imaging. In Wireless Symposium (IWS), 2016 IEEE MTT-S International. IEEE, 1-4.\n\nIdentifying wireless users via transmitter imperfections. C Adam, Sepideh Polak, Dennis L Dolatshahi, Goeckel, IEEE Journal on selected areas in communications. 29Adam C Polak, Sepideh Dolatshahi, and Dennis L Goeckel. 2011. Identifying wireless users via transmitter imperfections. IEEE Journal on selected areas in communications 29, 7 (2011), 1469-1479.\n\nRF fingerprinting of users who actively mask their identities with artificial distortion. C Adam, Dennis L Polak, Goeckel, Signals, Systems and Computers (ASILOMAR), 2011 Conference Record of the Forty Fifth Asilomar Conference on. IEEE. Adam C Polak and Dennis L Goeckel. 2011. RF fingerprinting of users who actively mask their identities with artificial distortion. In Signals, Systems and Computers (ASILOMAR), 2011 Conference Record of the Forty Fifth Asilomar Conference on. IEEE, 270-274.\n\nTheory and application of digital signal processing. R Lawrence, Bernard Rabiner, Gold, Prentice-Hall, Inc777Englewood Cliffs, NJLawrence R Rabiner and Bernard Gold. 1975. Theory and application of digital signal processing. Englewood Cliffs, NJ, Prentice-Hall, Inc., 1975. 777 p. (1975).\n\nControl And Measurement Of Unintentional Electromagnetic Radiation. IEEE Antennas and Propagation Magazine. C J Reddy, 40C.J. Reddy. 1998. Control And Measurement Of Unintentional Electromagnetic Radiation. IEEE Antennas and Propagation Magazine 40, 2 (1998), 88-89.\n\nSuperhigh-frequency two-port AlN contour-mode resonators for RF applications. Matteo Rinaldi, Chiara Zuniga, Chengjie Zuo, Gianluca Piazza, IEEE transactions on ultrasonics, ferroelectrics, and frequency control. 571Matteo Rinaldi, Chiara Zuniga, Chengjie Zuo, and Gianluca Piazza. 2010. Super- high-frequency two-port AlN contour-mode resonators for RF applications. IEEE transactions on ultrasonics, ferroelectrics, and frequency control 57, 1 (2010).\n\nThree-dimensional millimeterwave imaging for concealed weapon detection. D M Sheen, D L Mcmakin, T E Hall, 10.1109/22.942570IEEE Transactions on Microwave Theory and Techniques. 499D. M. Sheen, D. L. McMakin, and T. E. Hall. 2001. Three-dimensional millimeter- wave imaging for concealed weapon detection. IEEE Transactions on Microwave Theory and Techniques 49, 9 (Sep 2001), 1581-1592. DOI:http://dx.doi.org/10.11 09/22.942570\n\nA heterodyne receiver for harmonic Doppler radar cardiopulmonary monitoring with body-worn passive RF tags. Aditya Singh, Victor Lubecke, Microwave Symposium Digest (MTT). Aditya Singh and Victor Lubecke. 2010. A heterodyne receiver for harmonic Doppler radar cardiopulmonary monitoring with body-worn passive RF tags. In Microwave Symposium Digest (MTT), 2010 IEEE MTT-S International. IEEE, 1600-1603.\n\nSpectral decomposition of seismic data with continuous-wavelet transform. Satish Sinha, Partha S Routh, Phil D Anno, John P Castagna, Geophysics. 70Satish Sinha, Partha S Routh, Phil D Anno, and John P Castagna. 2005. Spectral decomposition of seismic data with continuous-wavelet transform. Geophysics 70, 6 (2005), P19-P25.\n\nEyeveri: A secure and usable approach for smartphone user authentication. Chen Song, Aosen Wang, Kui Ren, Wenyao Xu, Computer Communications, IEEE INFOCOM 2016-The 35th Annual IEEE International Conference on. IEEE. Chen Song, Aosen Wang, Kui Ren, and Wenyao Xu. 2016. Eyeveri: A se- cure and usable approach for smartphone user authentication. In Computer Communications, IEEE INFOCOM 2016-The 35th Annual IEEE International Conference on. IEEE, 1-9.\n\nA Practical Superheterodyne-Receiver Detector Using Stimulated Emissions. C Stagner, A Conrad, C Osterwise, D G Beetner, S Grant, 10.1109/TIM.2010.2101330IEEE Transactions on Instrumentation and Measurement. 604C. Stagner, A. Conrad, C. Osterwise, D. G. Beetner, and S. Grant. 2011. A Prac- tical Superheterodyne-Receiver Detector Using Stimulated Emissions. IEEE Transactions on Instrumentation and Measurement 60, 4 (April 2011), 1461-1468. DOI:http://dx.doi.org/10.1109/TIM.2010.2101330\n\nDetecting and Locating Electronic Devices Using Their Unintended Electromagnetic Emissions. Colin Blake Stagner, Doctoral Dissertations. Colin Blake Stagner. 2013. Detecting and Locating Electronic Devices Using Their Unintended Electromagnetic Emissions. Doctoral Dissertations (2013).\n\nMetal object detection and discrimination using Sinc signal. J Svatoš, P Vedral, Nováček, Electronics Conference (BEC), 2012 13th Biennial Baltic. IEEEJ Svatoš, J Vedral, and P Nováček. 2012. Metal object detection and discrimination using Sinc signal. In Electronics Conference (BEC), 2012 13th Biennial Baltic. IEEE, 307-310.\n\nSix-port technology and applications. O Serioja, Ke Tatu, Wu, Telecommunication in Modern Satellite, Cable and Broadcasting Services (TELSIKS), 2013 11th International Conference on. IEEE1Serioja O Tatu and Ke Wu. 2013. Six-port technology and applications. In Telecommunication in Modern Satellite, Cable and Broadcasting Services (TELSIKS), 2013 11th International Conference on, Vol. 1. IEEE, 239-248.\n\nComparison of random forest, knearest neighbor, and support vector machine classifiers for land cover classification using Sentinel-2 imagery. Thanh Phan, Martin Noi, Kappas, Sensors. 1818Phan Thanh Noi and Martin Kappas. 2017. Comparison of random forest, k- nearest neighbor, and support vector machine classifiers for land cover classifica- tion using Sentinel-2 imagery. Sensors 18, 1 (2017), 18.\n\nDetection and Localization of Multiple R/C Electronic Devices Using Array Detectors. V Thotla, M J Zawodniok, S Jagannathan, M T A Ghasr, S Agarwal, 10.1109/TIM.2014.2331432IEEE Transactions on Instrumentation and Measurement. 641V. Thotla, M. J. Zawodniok, S. Jagannathan, M. T. A. Ghasr, and S. Agarwal. 2015. Detection and Localization of Multiple R/C Electronic Devices Using Array Detectors. IEEE Transactions on Instrumentation and Measurement 64, 1 (Jan 2015), 241-251. DOI:http://dx.doi.org/10.1109/TIM.2014.2331432\n\nApplication of linear-frequency-modulated continuous-wave (LFMCW) radars for tracking of vital signs. Guochao Wang, Jose-Maria Munoz-Ferreras, Changzhan Gu, Changzhi Li, Roberto Gomez-Garcia, IEEE Transactions on Microwave Theory and Techniques. 62Guochao Wang, Jose-Maria Munoz-Ferreras, Changzhan Gu, Changzhi Li, and Roberto Gomez-Garcia. 2014. Application of linear-frequency-modulated continuous-wave (LFMCW) radars for tracking of vital signs. IEEE Transactions on Microwave Theory and Techniques 62, 6 (2014), 1387-1399.\n\nmtrack: High-precision passive tracking using millimeter wave radios. Teng Wei, Xinyu Zhang, Proceedings of the 21st Annual International Conference on Mobile Computing and Networking. the 21st Annual International Conference on Mobile Computing and NetworkingACMTeng Wei and Xinyu Zhang. 2015. mtrack: High-precision passive tracking using millimeter wave radios. In Proceedings of the 21st Annual International Conference on Mobile Computing and Networking. ACM, 117-129.\n\nBlind separation of speech mixtures via time-frequency masking. Ozgur Yilmaz, Scott Rickard, IEEE Transactions on signal processing. 52Ozgur Yilmaz and Scott Rickard. 2004. Blind separation of speech mixtures via time-frequency masking. IEEE Transactions on signal processing 52, 7 (2004), 1830-1847.\n\nReusing 60ghz radios for mobile radar imaging. Yanzi Zhu, Yibo Zhu, Y Ben, Haitao Zhao, Zheng, Proceedings of the 21st Annual International Conference on Mobile Computing and Networking. the 21st Annual International Conference on Mobile Computing and NetworkingACMYanzi Zhu, Yibo Zhu, Ben Y Zhao, and Haitao Zheng. 2015. Reusing 60ghz radios for mobile radar imaging. In Proceedings of the 21st Annual International Conference on Mobile Computing and Networking. ACM, 103-116.\n", "annotations": {"author": "[{\"end\":342,\"start\":216},{\"end\":489,\"start\":343},{\"end\":631,\"start\":490},{\"end\":766,\"start\":632},{\"end\":843,\"start\":767},{\"end\":987,\"start\":844},{\"end\":1114,\"start\":988},{\"end\":1240,\"start\":1115},{\"end\":1363,\"start\":1241},{\"end\":1478,\"start\":1364},{\"end\":1555,\"start\":1479},{\"end\":1719,\"start\":1556}]", "publisher": "[{\"end\":163,\"start\":160},{\"end\":2016,\"start\":2013}]", "author_last_name": "[{\"end\":229,\"start\":227},{\"end\":355,\"start\":351},{\"end\":499,\"start\":495},{\"end\":643,\"start\":641},{\"end\":779,\"start\":775},{\"end\":853,\"start\":851},{\"end\":1001,\"start\":999},{\"end\":1127,\"start\":1123},{\"end\":1250,\"start\":1246},{\"end\":1375,\"start\":1373},{\"end\":1491,\"start\":1487},{\"end\":1565,\"start\":1563}]", "author_first_name": "[{\"end\":226,\"start\":216},{\"end\":350,\"start\":343},{\"end\":494,\"start\":490},{\"end\":640,\"start\":632},{\"end\":774,\"start\":767},{\"end\":850,\"start\":844},{\"end\":998,\"start\":988},{\"end\":1122,\"start\":1115},{\"end\":1245,\"start\":1241},{\"end\":1372,\"start\":1364},{\"end\":1486,\"start\":1479},{\"end\":1562,\"start\":1556}]", "author_affiliation": "[{\"end\":285,\"start\":231},{\"end\":341,\"start\":287},{\"end\":432,\"start\":378},{\"end\":488,\"start\":434},{\"end\":574,\"start\":520},{\"end\":630,\"start\":576},{\"end\":714,\"start\":665},{\"end\":765,\"start\":716},{\"end\":810,\"start\":781},{\"end\":842,\"start\":812},{\"end\":930,\"start\":876},{\"end\":986,\"start\":932},{\"end\":1057,\"start\":1003},{\"end\":1113,\"start\":1059},{\"end\":1183,\"start\":1129},{\"end\":1239,\"start\":1185},{\"end\":1306,\"start\":1252},{\"end\":1362,\"start\":1308},{\"end\":1426,\"start\":1377},{\"end\":1477,\"start\":1428},{\"end\":1522,\"start\":1493},{\"end\":1554,\"start\":1524},{\"end\":1662,\"start\":1608},{\"end\":1718,\"start\":1664}]", "title": "[{\"end\":159,\"start\":1},{\"end\":1878,\"start\":1720}]", "venue": "[{\"end\":1953,\"start\":1880}]", "abstract": "[{\"end\":4198,\"start\":2185}]", "bib_ref": "[{\"attributes\":{\"ref_id\":\"b0\"},\"end\":4448,\"start\":4445},{\"attributes\":{\"ref_id\":\"b2\"},\"end\":4450,\"start\":4448},{\"attributes\":{\"ref_id\":\"b6\"},\"end\":4452,\"start\":4450},{\"attributes\":{\"ref_id\":\"b13\"},\"end\":4455,\"start\":4452},{\"attributes\":{\"ref_id\":\"b12\"},\"end\":4660,\"start\":4656},{\"attributes\":{\"ref_id\":\"b3\"},\"end\":4715,\"start\":4712},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":4718,\"start\":4715},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":4721,\"start\":4718},{\"attributes\":{\"ref_id\":\"b57\"},\"end\":5085,\"start\":5081},{\"attributes\":{\"ref_id\":\"b44\"},\"end\":5308,\"start\":5304},{\"attributes\":{\"ref_id\":\"b38\"},\"end\":5792,\"start\":5788},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":6130,\"start\":6126},{\"attributes\":{\"ref_id\":\"b63\"},\"end\":6327,\"start\":6323},{\"attributes\":{\"ref_id\":\"b16\"},\"end\":6442,\"start\":6438},{\"attributes\":{\"ref_id\":\"b65\"},\"end\":6531,\"start\":6527},{\"attributes\":{\"ref_id\":\"b63\"},\"end\":6615,\"start\":6611},{\"attributes\":{\"ref_id\":\"b41\"},\"end\":9725,\"start\":9721},{\"attributes\":{\"ref_id\":\"b47\"},\"end\":10204,\"start\":10200},{\"attributes\":{\"ref_id\":\"b48\"},\"end\":10207,\"start\":10204},{\"attributes\":{\"ref_id\":\"b37\"},\"end\":10898,\"start\":10894},{\"attributes\":{\"ref_id\":\"b32\"},\"end\":11065,\"start\":11061},{\"attributes\":{\"ref_id\":\"b25\"},\"end\":11397,\"start\":11393},{\"attributes\":{\"ref_id\":\"b26\"},\"end\":11400,\"start\":11397},{\"attributes\":{\"ref_id\":\"b27\"},\"end\":12376,\"start\":12372},{\"attributes\":{\"ref_id\":\"b45\"},\"end\":12379,\"start\":12376},{\"attributes\":{\"ref_id\":\"b40\"},\"end\":12433,\"start\":12429},{\"attributes\":{\"ref_id\":\"b7\"},\"end\":12989,\"start\":12986},{\"attributes\":{\"ref_id\":\"b51\"},\"end\":12992,\"start\":12989},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":13138,\"start\":13135},{\"attributes\":{\"ref_id\":\"b53\"},\"end\":14760,\"start\":14756},{\"attributes\":{\"ref_id\":\"b5\"},\"end\":16801,\"start\":16798},{\"attributes\":{\"ref_id\":\"b59\"},\"end\":18061,\"start\":18057},{\"attributes\":{\"ref_id\":\"b40\"},\"end\":18610,\"start\":18606},{\"attributes\":{\"ref_id\":\"b62\"},\"end\":18613,\"start\":18610},{\"attributes\":{\"ref_id\":\"b46\"},\"end\":18765,\"start\":18761},{\"attributes\":{\"ref_id\":\"b21\"},\"end\":20303,\"start\":20299},{\"attributes\":{\"ref_id\":\"b19\"},\"end\":21999,\"start\":21995},{\"attributes\":{\"ref_id\":\"b49\"},\"end\":22945,\"start\":22941},{\"attributes\":{\"ref_id\":\"b28\"},\"end\":24217,\"start\":24213},{\"attributes\":{\"ref_id\":\"b39\"},\"end\":24220,\"start\":24217},{\"attributes\":{\"ref_id\":\"b33\"},\"end\":24357,\"start\":24353},{\"attributes\":{\"ref_id\":\"b54\"},\"end\":24925,\"start\":24921},{\"attributes\":{\"ref_id\":\"b18\"},\"end\":26374,\"start\":26370},{\"attributes\":{\"ref_id\":\"b55\"},\"end\":27804,\"start\":27800},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":29471,\"start\":29468},{\"end\":30883,\"start\":30866},{\"attributes\":{\"ref_id\":\"b43\"},\"end\":32229,\"start\":32225},{\"attributes\":{\"ref_id\":\"b17\"},\"end\":32387,\"start\":32383},{\"attributes\":{\"ref_id\":\"b60\"},\"end\":33509,\"start\":33505},{\"attributes\":{\"ref_id\":\"b23\"},\"end\":34195,\"start\":34191},{\"attributes\":{\"ref_id\":\"b58\"},\"end\":42692,\"start\":42688},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":43516,\"start\":43512},{\"attributes\":{\"ref_id\":\"b20\"},\"end\":43808,\"start\":43804},{\"attributes\":{\"ref_id\":\"b64\"},\"end\":43811,\"start\":43808},{\"attributes\":{\"ref_id\":\"b22\"},\"end\":44121,\"start\":44117},{\"attributes\":{\"ref_id\":\"b29\"},\"end\":44266,\"start\":44262},{\"attributes\":{\"ref_id\":\"b29\"},\"end\":44318,\"start\":44314},{\"attributes\":{\"ref_id\":\"b52\"},\"end\":44321,\"start\":44318},{\"attributes\":{\"ref_id\":\"b37\"},\"end\":44606,\"start\":44602},{\"attributes\":{\"ref_id\":\"b11\"},\"end\":44714,\"start\":44710},{\"attributes\":{\"ref_id\":\"b24\"},\"end\":44717,\"start\":44714},{\"attributes\":{\"ref_id\":\"b50\"},\"end\":44843,\"start\":44839},{\"attributes\":{\"ref_id\":\"b30\"},\"end\":44886,\"start\":44882},{\"attributes\":{\"ref_id\":\"b56\"},\"end\":44889,\"start\":44886},{\"attributes\":{\"ref_id\":\"b61\"},\"end\":44892,\"start\":44889},{\"attributes\":{\"ref_id\":\"b8\"},\"end\":45318,\"start\":45315},{\"attributes\":{\"ref_id\":\"b29\"},\"end\":45321,\"start\":45318},{\"attributes\":{\"ref_id\":\"b31\"},\"end\":45606,\"start\":45602},{\"attributes\":{\"ref_id\":\"b35\"},\"end\":45609,\"start\":45606},{\"attributes\":{\"ref_id\":\"b36\"},\"end\":45612,\"start\":45609},{\"attributes\":{\"ref_id\":\"b34\"},\"end\":45643,\"start\":45639},{\"attributes\":{\"ref_id\":\"b42\"},\"end\":45775,\"start\":45771},{\"attributes\":{\"ref_id\":\"b16\"},\"end\":46201,\"start\":46197},{\"attributes\":{\"ref_id\":\"b63\"},\"end\":46204,\"start\":46201},{\"attributes\":{\"ref_id\":\"b65\"},\"end\":46207,\"start\":46204}]", "figure": "[{\"attributes\":{\"id\":\"fig_0\"},\"end\":47439,\"start\":47237},{\"attributes\":{\"id\":\"fig_2\"},\"end\":47691,\"start\":47440},{\"attributes\":{\"id\":\"fig_3\"},\"end\":47756,\"start\":47692},{\"attributes\":{\"id\":\"fig_4\"},\"end\":47907,\"start\":47757},{\"attributes\":{\"id\":\"fig_5\"},\"end\":48125,\"start\":47908},{\"attributes\":{\"id\":\"fig_6\"},\"end\":48372,\"start\":48126},{\"attributes\":{\"id\":\"fig_7\"},\"end\":48583,\"start\":48373},{\"attributes\":{\"id\":\"fig_8\"},\"end\":48785,\"start\":48584},{\"attributes\":{\"id\":\"fig_9\"},\"end\":48990,\"start\":48786},{\"attributes\":{\"id\":\"fig_10\"},\"end\":49162,\"start\":48991},{\"attributes\":{\"id\":\"fig_11\"},\"end\":49326,\"start\":49163},{\"attributes\":{\"id\":\"fig_12\"},\"end\":49590,\"start\":49327},{\"attributes\":{\"id\":\"fig_13\"},\"end\":49637,\"start\":49591},{\"attributes\":{\"id\":\"fig_14\"},\"end\":49838,\"start\":49638},{\"attributes\":{\"id\":\"fig_15\"},\"end\":50070,\"start\":49839},{\"attributes\":{\"id\":\"fig_16\"},\"end\":50168,\"start\":50071},{\"attributes\":{\"id\":\"fig_17\"},\"end\":50245,\"start\":50169},{\"attributes\":{\"id\":\"fig_18\"},\"end\":50316,\"start\":50246},{\"attributes\":{\"id\":\"fig_19\"},\"end\":50393,\"start\":50317},{\"attributes\":{\"id\":\"fig_20\"},\"end\":50477,\"start\":50394},{\"attributes\":{\"id\":\"fig_21\"},\"end\":50552,\"start\":50478},{\"attributes\":{\"id\":\"fig_22\"},\"end\":50622,\"start\":50553},{\"attributes\":{\"id\":\"fig_23\"},\"end\":50670,\"start\":50623},{\"attributes\":{\"id\":\"tab_1\",\"type\":\"table\"},\"end\":50712,\"start\":50671},{\"attributes\":{\"id\":\"tab_2\",\"type\":\"table\"},\"end\":50759,\"start\":50713},{\"attributes\":{\"id\":\"tab_3\",\"type\":\"table\"},\"end\":51518,\"start\":50760},{\"attributes\":{\"id\":\"tab_4\",\"type\":\"table\"},\"end\":52136,\"start\":51519}]", "paragraph": "[{\"end\":4959,\"start\":4214},{\"end\":6021,\"start\":4961},{\"end\":6818,\"start\":6023},{\"end\":7420,\"start\":6820},{\"end\":8733,\"start\":7422},{\"end\":8779,\"start\":8735},{\"end\":9470,\"start\":8781},{\"end\":9891,\"start\":9472},{\"end\":10329,\"start\":9893},{\"end\":11094,\"start\":10331},{\"end\":11828,\"start\":11130},{\"end\":12720,\"start\":11903},{\"end\":13219,\"start\":12761},{\"end\":14490,\"start\":13221},{\"end\":15311,\"start\":14492},{\"end\":15382,\"start\":15313},{\"end\":15463,\"start\":15407},{\"end\":15770,\"start\":15465},{\"end\":16052,\"start\":15772},{\"end\":16429,\"start\":16098},{\"end\":16802,\"start\":16439},{\"end\":17233,\"start\":16804},{\"end\":17452,\"start\":17287},{\"end\":17874,\"start\":17478},{\"end\":18466,\"start\":17898},{\"end\":19518,\"start\":18481},{\"end\":20119,\"start\":19572},{\"end\":20854,\"start\":20130},{\"end\":21307,\"start\":20879},{\"end\":23618,\"start\":21361},{\"end\":24071,\"start\":23722},{\"end\":24610,\"start\":24108},{\"end\":24704,\"start\":24612},{\"end\":25050,\"start\":24759},{\"end\":25148,\"start\":25121},{\"end\":25222,\"start\":25204},{\"end\":25417,\"start\":25224},{\"end\":25931,\"start\":25513},{\"end\":26868,\"start\":25941},{\"end\":27391,\"start\":26896},{\"end\":27928,\"start\":27393},{\"end\":27949,\"start\":27937},{\"end\":28582,\"start\":28493},{\"end\":29843,\"start\":28584},{\"end\":31049,\"start\":29927},{\"end\":31643,\"start\":31064},{\"end\":32123,\"start\":31645},{\"end\":32388,\"start\":32125},{\"end\":32471,\"start\":32415},{\"end\":32604,\"start\":32473},{\"end\":32965,\"start\":32606},{\"end\":34082,\"start\":32989},{\"end\":35961,\"start\":34084},{\"end\":37045,\"start\":36016},{\"end\":39059,\"start\":37061},{\"end\":40585,\"start\":39082},{\"end\":41494,\"start\":40619},{\"end\":42693,\"start\":41525},{\"end\":42977,\"start\":42695},{\"end\":43409,\"start\":42979},{\"end\":43812,\"start\":43411},{\"end\":43926,\"start\":43859},{\"end\":44322,\"start\":43928},{\"end\":44718,\"start\":44324},{\"end\":45412,\"start\":44720},{\"end\":46449,\"start\":45431},{\"end\":47236,\"start\":46464}]", "formula": "[{\"attributes\":{\"id\":\"formula_0\"},\"end\":11129,\"start\":11095},{\"attributes\":{\"id\":\"formula_1\"},\"end\":12760,\"start\":12721},{\"attributes\":{\"id\":\"formula_2\"},\"end\":19571,\"start\":19519},{\"attributes\":{\"id\":\"formula_3\"},\"end\":24758,\"start\":24705},{\"attributes\":{\"id\":\"formula_4\"},\"end\":25120,\"start\":25051},{\"attributes\":{\"id\":\"formula_5\"},\"end\":25203,\"start\":25149},{\"attributes\":{\"id\":\"formula_7\"},\"end\":25512,\"start\":25418},{\"attributes\":{\"id\":\"formula_8\"},\"end\":28214,\"start\":27950},{\"attributes\":{\"id\":\"formula_9\"},\"end\":28492,\"start\":28214}]", "table_ref": "[{\"attributes\":{\"ref_id\":\"tab_1\"},\"end\":26278,\"start\":26271},{\"attributes\":{\"ref_id\":\"tab_1\"},\"end\":26747,\"start\":26739},{\"attributes\":{\"ref_id\":\"tab_3\"},\"end\":30585,\"start\":30578},{\"attributes\":{\"ref_id\":\"tab_3\"},\"end\":39514,\"start\":39507},{\"attributes\":{\"ref_id\":\"tab_4\"},\"end\":42041,\"start\":42034}]", "section_header": "[{\"attributes\":{\"n\":\"1\"},\"end\":4212,\"start\":4200},{\"attributes\":{\"n\":\"2.2\"},\"end\":11901,\"start\":11831},{\"attributes\":{\"n\":\"2.3\"},\"end\":15405,\"start\":15385},{\"attributes\":{\"n\":\"3\"},\"end\":16096,\"start\":16055},{\"end\":16437,\"start\":16432},{\"attributes\":{\"n\":\"4\"},\"end\":17285,\"start\":17236},{\"attributes\":{\"n\":\"4.1\"},\"end\":17476,\"start\":17455},{\"attributes\":{\"n\":\"4.1.1\"},\"end\":17896,\"start\":17877},{\"attributes\":{\"n\":\"4.1.2\"},\"end\":18479,\"start\":18469},{\"attributes\":{\"n\":\"4.2.2\"},\"end\":20128,\"start\":20122},{\"attributes\":{\"n\":\"5\"},\"end\":20877,\"start\":20857},{\"attributes\":{\"n\":\"5.1\"},\"end\":21359,\"start\":21310},{\"attributes\":{\"n\":\"5.1.2\"},\"end\":23653,\"start\":23621},{\"attributes\":{\"n\":\"5.2\"},\"end\":23720,\"start\":23656},{\"attributes\":{\"n\":\"5.2.1\"},\"end\":24106,\"start\":24074},{\"end\":25939,\"start\":25934},{\"attributes\":{\"n\":\"5.3\"},\"end\":26894,\"start\":26871},{\"end\":27935,\"start\":27931},{\"attributes\":{\"n\":\"6\"},\"end\":29925,\"start\":29846},{\"attributes\":{\"n\":\"6.2\"},\"end\":31062,\"start\":31052},{\"attributes\":{\"n\":\"7\"},\"end\":32413,\"start\":32391},{\"attributes\":{\"n\":\"7.1\"},\"end\":32987,\"start\":32968},{\"attributes\":{\"n\":\"7.1.3\"},\"end\":36014,\"start\":35964},{\"attributes\":{\"n\":\"7.2\"},\"end\":37059,\"start\":37048},{\"attributes\":{\"n\":\"7.3\"},\"end\":39080,\"start\":39062},{\"attributes\":{\"n\":\"7.3.3\"},\"end\":40617,\"start\":40588},{\"attributes\":{\"n\":\"7.3.4\"},\"end\":41523,\"start\":41497},{\"attributes\":{\"n\":\"9\"},\"end\":43857,\"start\":43815},{\"attributes\":{\"n\":\"9.2\"},\"end\":45429,\"start\":45415},{\"attributes\":{\"n\":\"10\"},\"end\":46462,\"start\":46452},{\"end\":47248,\"start\":47238},{\"end\":47451,\"start\":47441},{\"end\":47698,\"start\":47693},{\"end\":47768,\"start\":47758},{\"end\":47919,\"start\":47909},{\"end\":48137,\"start\":48127},{\"end\":48384,\"start\":48374},{\"end\":48797,\"start\":48787},{\"end\":49174,\"start\":49164},{\"end\":49342,\"start\":49328},{\"end\":49650,\"start\":49639},{\"end\":49851,\"start\":49840},{\"end\":50083,\"start\":50072},{\"end\":50181,\"start\":50170},{\"end\":50258,\"start\":50247},{\"end\":50329,\"start\":50318},{\"end\":50406,\"start\":50395},{\"end\":50490,\"start\":50479},{\"end\":50565,\"start\":50554},{\"end\":50635,\"start\":50624},{\"end\":50681,\"start\":50672},{\"end\":50723,\"start\":50714},{\"end\":50770,\"start\":50761},{\"end\":51529,\"start\":51520}]", "table": "[{\"end\":51518,\"start\":50810},{\"end\":52136,\"start\":51987}]", "figure_caption": "[{\"end\":47439,\"start\":47250},{\"end\":47691,\"start\":47453},{\"end\":47756,\"start\":47700},{\"end\":47907,\"start\":47770},{\"end\":48125,\"start\":47921},{\"end\":48372,\"start\":48139},{\"end\":48583,\"start\":48386},{\"end\":48785,\"start\":48586},{\"end\":48990,\"start\":48799},{\"end\":49162,\"start\":48993},{\"end\":49326,\"start\":49176},{\"end\":49590,\"start\":49344},{\"end\":49637,\"start\":49593},{\"end\":49838,\"start\":49653},{\"end\":50070,\"start\":49854},{\"end\":50168,\"start\":50086},{\"end\":50245,\"start\":50184},{\"end\":50316,\"start\":50261},{\"end\":50393,\"start\":50332},{\"end\":50477,\"start\":50409},{\"end\":50552,\"start\":50493},{\"end\":50622,\"start\":50568},{\"end\":50670,\"start\":50638},{\"end\":50712,\"start\":50683},{\"end\":50759,\"start\":50725},{\"end\":50810,\"start\":50772},{\"end\":51987,\"start\":51531}]", "figure_ref": "[{\"end\":10384,\"start\":10376},{\"end\":11684,\"start\":11676},{\"attributes\":{\"ref_id\":\"fig_2\"},\"end\":12558,\"start\":12550},{\"attributes\":{\"ref_id\":\"fig_2\"},\"end\":13989,\"start\":13981},{\"attributes\":{\"ref_id\":\"fig_4\"},\"end\":14786,\"start\":14778},{\"attributes\":{\"ref_id\":\"fig_4\"},\"end\":15168,\"start\":15160},{\"attributes\":{\"ref_id\":\"fig_5\"},\"end\":16428,\"start\":16419},{\"attributes\":{\"ref_id\":\"fig_6\"},\"end\":17541,\"start\":17533},{\"attributes\":{\"ref_id\":\"fig_7\"},\"end\":21412,\"start\":21404},{\"attributes\":{\"ref_id\":\"fig_9\"},\"end\":22492,\"start\":22484},{\"attributes\":{\"ref_id\":\"fig_3\"},\"end\":22850,\"start\":22839},{\"attributes\":{\"ref_id\":\"fig_9\"},\"end\":23185,\"start\":23177},{\"attributes\":{\"ref_id\":\"fig_3\"},\"end\":24704,\"start\":24667},{\"attributes\":{\"ref_id\":\"fig_11\"},\"end\":25697,\"start\":25689},{\"attributes\":{\"ref_id\":\"fig_11\"},\"end\":25734,\"start\":25726},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":29076,\"start\":29066},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":29184,\"start\":29171},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":29279,\"start\":29270},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":29365,\"start\":29352},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":30141,\"start\":30132},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":31169,\"start\":31160},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":33597,\"start\":33588},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":35340,\"start\":35331},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":36590,\"start\":36581},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":37799,\"start\":37790},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":38690,\"start\":38681},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":39374,\"start\":39365},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":40019,\"start\":40010},{\"attributes\":{\"ref_id\":\"fig_23\"},\"end\":41082,\"start\":41073}]", "bib_author_first_name": "[{\"end\":55863,\"start\":55858},{\"end\":55874,\"start\":55870},{\"end\":56018,\"start\":56017},{\"end\":56033,\"start\":56025},{\"end\":56035,\"start\":56034},{\"end\":56050,\"start\":56043},{\"end\":56071,\"start\":56070},{\"end\":56086,\"start\":56080},{\"end\":56088,\"start\":56087},{\"end\":56359,\"start\":56354},{\"end\":56610,\"start\":56602},{\"end\":56994,\"start\":56986},{\"end\":57008,\"start\":57001},{\"end\":57028,\"start\":57019},{\"end\":57044,\"start\":57035},{\"end\":57654,\"start\":57645},{\"end\":57983,\"start\":57978},{\"end\":58010,\"start\":58004},{\"end\":58369,\"start\":58364},{\"end\":58391,\"start\":58387},{\"end\":58406,\"start\":58402},{\"end\":58420,\"start\":58414},{\"end\":58433,\"start\":58427},{\"end\":58446,\"start\":58441},{\"end\":58869,\"start\":58868},{\"end\":58885,\"start\":58877},{\"end\":58887,\"start\":58886},{\"end\":58901,\"start\":58894},{\"end\":58903,\"start\":58902},{\"end\":59289,\"start\":59288},{\"end\":59493,\"start\":59487},{\"end\":59511,\"start\":59504},{\"end\":59699,\"start\":59698},{\"end\":60087,\"start\":60086},{\"end\":60100,\"start\":60099},{\"end\":60114,\"start\":60113},{\"end\":60125,\"start\":60124},{\"end\":60127,\"start\":60126},{\"end\":60135,\"start\":60134},{\"end\":60144,\"start\":60143},{\"end\":60156,\"start\":60155},{\"end\":60168,\"start\":60167},{\"end\":60179,\"start\":60178},{\"end\":60720,\"start\":60719},{\"end\":60735,\"start\":60734},{\"end\":61171,\"start\":61170},{\"end\":61173,\"start\":61172},{\"end\":61182,\"start\":61181},{\"end\":61184,\"start\":61183},{\"end\":61191,\"start\":61190},{\"end\":61197,\"start\":61196},{\"end\":61203,\"start\":61202},{\"end\":61209,\"start\":61208},{\"end\":61563,\"start\":61557},{\"end\":61576,\"start\":61572},{\"end\":62037,\"start\":62030},{\"end\":62045,\"start\":62043},{\"end\":62055,\"start\":62051},{\"end\":62071,\"start\":62062},{\"end\":62085,\"start\":62077},{\"end\":62484,\"start\":62479},{\"end\":62492,\"start\":62491},{\"end\":62497,\"start\":62493},{\"end\":62523,\"start\":62516},{\"end\":62543,\"start\":62536},{\"end\":62557,\"start\":62553},{\"end\":62573,\"start\":62568},{\"end\":62585,\"start\":62581},{\"end\":63037,\"start\":63033},{\"end\":63047,\"start\":63043},{\"end\":63057,\"start\":63054},{\"end\":63072,\"start\":63066},{\"end\":63085,\"start\":63077},{\"end\":63093,\"start\":63090},{\"end\":63686,\"start\":63685},{\"end\":63693,\"start\":63692},{\"end\":63703,\"start\":63702},{\"end\":63711,\"start\":63710},{\"end\":63719,\"start\":63718},{\"end\":63725,\"start\":63724},{\"end\":63731,\"start\":63730},{\"end\":63737,\"start\":63736},{\"end\":64104,\"start\":64098},{\"end\":64113,\"start\":64110},{\"end\":64129,\"start\":64121},{\"end\":64148,\"start\":64141},{\"end\":64163,\"start\":64155},{\"end\":64413,\"start\":64408},{\"end\":64620,\"start\":64619},{\"end\":64916,\"start\":64915},{\"end\":64933,\"start\":64926},{\"end\":64935,\"start\":64934},{\"end\":64957,\"start\":64954},{\"end\":64959,\"start\":64958},{\"end\":65361,\"start\":65360},{\"end\":65376,\"start\":65371},{\"end\":65378,\"start\":65377},{\"end\":65822,\"start\":65821},{\"end\":65824,\"start\":65823},{\"end\":65837,\"start\":65836},{\"end\":65850,\"start\":65849},{\"end\":65852,\"start\":65851},{\"end\":65861,\"start\":65860},{\"end\":65863,\"start\":65862},{\"end\":65867,\"start\":65866},{\"end\":65869,\"start\":65868},{\"end\":66384,\"start\":66380},{\"end\":66398,\"start\":66393},{\"end\":66413,\"start\":66407},{\"end\":66433,\"start\":66430},{\"end\":66449,\"start\":66442},{\"end\":66458,\"start\":66455},{\"end\":67053,\"start\":67050},{\"end\":67268,\"start\":67267},{\"end\":67509,\"start\":67502},{\"end\":67526,\"start\":67516},{\"end\":67550,\"start\":67543},{\"end\":67570,\"start\":67565},{\"end\":67584,\"start\":67576},{\"end\":67907,\"start\":67906},{\"end\":67921,\"start\":67914},{\"end\":67935,\"start\":67929},{\"end\":67937,\"start\":67936},{\"end\":68297,\"start\":68296},{\"end\":68310,\"start\":68304},{\"end\":68312,\"start\":68311},{\"end\":68757,\"start\":68756},{\"end\":68775,\"start\":68768},{\"end\":69102,\"start\":69101},{\"end\":69104,\"start\":69103},{\"end\":69345,\"start\":69339},{\"end\":69361,\"start\":69355},{\"end\":69378,\"start\":69370},{\"end\":69392,\"start\":69384},{\"end\":69790,\"start\":69789},{\"end\":69792,\"start\":69791},{\"end\":69801,\"start\":69800},{\"end\":69803,\"start\":69802},{\"end\":69814,\"start\":69813},{\"end\":69816,\"start\":69815},{\"end\":70260,\"start\":70254},{\"end\":70274,\"start\":70268},{\"end\":70631,\"start\":70625},{\"end\":70645,\"start\":70639},{\"end\":70647,\"start\":70646},{\"end\":70659,\"start\":70655},{\"end\":70661,\"start\":70660},{\"end\":70672,\"start\":70668},{\"end\":70674,\"start\":70673},{\"end\":70956,\"start\":70952},{\"end\":70968,\"start\":70963},{\"end\":70978,\"start\":70975},{\"end\":70990,\"start\":70984},{\"end\":71406,\"start\":71405},{\"end\":71417,\"start\":71416},{\"end\":71427,\"start\":71426},{\"end\":71440,\"start\":71439},{\"end\":71442,\"start\":71441},{\"end\":71453,\"start\":71452},{\"end\":71919,\"start\":71914},{\"end\":71925,\"start\":71920},{\"end\":72172,\"start\":72171},{\"end\":72182,\"start\":72181},{\"end\":72478,\"start\":72477},{\"end\":72490,\"start\":72488},{\"end\":72993,\"start\":72988},{\"end\":73006,\"start\":73000},{\"end\":73333,\"start\":73332},{\"end\":73343,\"start\":73342},{\"end\":73345,\"start\":73344},{\"end\":73358,\"start\":73357},{\"end\":73373,\"start\":73372},{\"end\":73377,\"start\":73374},{\"end\":73386,\"start\":73385},{\"end\":73881,\"start\":73874},{\"end\":73898,\"start\":73888},{\"end\":73924,\"start\":73915},{\"end\":73937,\"start\":73929},{\"end\":73949,\"start\":73942},{\"end\":74375,\"start\":74371},{\"end\":74386,\"start\":74381},{\"end\":74845,\"start\":74840},{\"end\":74859,\"start\":74854},{\"end\":75130,\"start\":75125},{\"end\":75140,\"start\":75136},{\"end\":75147,\"start\":75146},{\"end\":75159,\"start\":75153}]", "bib_author_last_name": "[{\"end\":52387,\"start\":52379},{\"end\":52563,\"start\":52555},{\"end\":52780,\"start\":52772},{\"end\":53166,\"start\":53158},{\"end\":53314,\"start\":53306},{\"end\":53508,\"start\":53500},{\"end\":53664,\"start\":53656},{\"end\":53881,\"start\":53873},{\"end\":54091,\"start\":54083},{\"end\":54283,\"start\":54275},{\"end\":54480,\"start\":54472},{\"end\":54663,\"start\":54655},{\"end\":54855,\"start\":54847},{\"end\":55104,\"start\":55096},{\"end\":55404,\"start\":55396},{\"end\":55638,\"start\":55630},{\"end\":55868,\"start\":55864},{\"end\":55881,\"start\":55875},{\"end\":56023,\"start\":56019},{\"end\":56041,\"start\":56036},{\"end\":56058,\"start\":56051},{\"end\":56068,\"start\":56060},{\"end\":56078,\"start\":56072},{\"end\":56094,\"start\":56089},{\"end\":56102,\"start\":56096},{\"end\":56367,\"start\":56360},{\"end\":56382,\"start\":56369},{\"end\":56624,\"start\":56611},{\"end\":56999,\"start\":56995},{\"end\":57017,\"start\":57009},{\"end\":57033,\"start\":57029},{\"end\":57048,\"start\":57045},{\"end\":57663,\"start\":57655},{\"end\":58002,\"start\":57984},{\"end\":58019,\"start\":58011},{\"end\":58026,\"start\":58021},{\"end\":58385,\"start\":58370},{\"end\":58400,\"start\":58392},{\"end\":58412,\"start\":58407},{\"end\":58425,\"start\":58421},{\"end\":58439,\"start\":58434},{\"end\":58455,\"start\":58447},{\"end\":58464,\"start\":58457},{\"end\":58875,\"start\":58870},{\"end\":58892,\"start\":58888},{\"end\":58910,\"start\":58904},{\"end\":58917,\"start\":58912},{\"end\":59296,\"start\":59290},{\"end\":59307,\"start\":59298},{\"end\":59502,\"start\":59494},{\"end\":59518,\"start\":59512},{\"end\":59706,\"start\":59700},{\"end\":59721,\"start\":59708},{\"end\":60097,\"start\":60088},{\"end\":60111,\"start\":60101},{\"end\":60122,\"start\":60115},{\"end\":60132,\"start\":60128},{\"end\":60141,\"start\":60136},{\"end\":60153,\"start\":60145},{\"end\":60165,\"start\":60157},{\"end\":60176,\"start\":60169},{\"end\":60191,\"start\":60180},{\"end\":60732,\"start\":60721},{\"end\":60747,\"start\":60736},{\"end\":61179,\"start\":61174},{\"end\":61188,\"start\":61185},{\"end\":61194,\"start\":61192},{\"end\":61200,\"start\":61198},{\"end\":61206,\"start\":61204},{\"end\":61221,\"start\":61210},{\"end\":61570,\"start\":61564},{\"end\":61582,\"start\":61577},{\"end\":61591,\"start\":61584},{\"end\":62041,\"start\":62038},{\"end\":62049,\"start\":62046},{\"end\":62060,\"start\":62056},{\"end\":62075,\"start\":62072},{\"end\":62090,\"start\":62086},{\"end\":62489,\"start\":62485},{\"end\":62514,\"start\":62498},{\"end\":62534,\"start\":62524},{\"end\":62551,\"start\":62544},{\"end\":62566,\"start\":62558},{\"end\":62579,\"start\":62574},{\"end\":62590,\"start\":62586},{\"end\":62600,\"start\":62592},{\"end\":63041,\"start\":63038},{\"end\":63052,\"start\":63048},{\"end\":63064,\"start\":63058},{\"end\":63075,\"start\":63073},{\"end\":63088,\"start\":63086},{\"end\":63097,\"start\":63094},{\"end\":63690,\"start\":63687},{\"end\":63700,\"start\":63694},{\"end\":63708,\"start\":63704},{\"end\":63716,\"start\":63712},{\"end\":63722,\"start\":63720},{\"end\":63728,\"start\":63726},{\"end\":63734,\"start\":63732},{\"end\":63740,\"start\":63738},{\"end\":64108,\"start\":64105},{\"end\":64119,\"start\":64114},{\"end\":64139,\"start\":64130},{\"end\":64153,\"start\":64149},{\"end\":64169,\"start\":64164},{\"end\":64421,\"start\":64414},{\"end\":64629,\"start\":64621},{\"end\":64637,\"start\":64631},{\"end\":64924,\"start\":64917},{\"end\":64943,\"start\":64936},{\"end\":64952,\"start\":64945},{\"end\":64976,\"start\":64960},{\"end\":64987,\"start\":64978},{\"end\":65369,\"start\":65362},{\"end\":65386,\"start\":65379},{\"end\":65397,\"start\":65388},{\"end\":65834,\"start\":65825},{\"end\":65847,\"start\":65838},{\"end\":65858,\"start\":65853},{\"end\":65878,\"start\":65870},{\"end\":66391,\"start\":66385},{\"end\":66405,\"start\":66399},{\"end\":66428,\"start\":66414},{\"end\":66440,\"start\":66434},{\"end\":66453,\"start\":66450},{\"end\":66461,\"start\":66459},{\"end\":67061,\"start\":67054},{\"end\":67274,\"start\":67269},{\"end\":67284,\"start\":67276},{\"end\":67514,\"start\":67510},{\"end\":67541,\"start\":67527},{\"end\":67563,\"start\":67551},{\"end\":67574,\"start\":67571},{\"end\":67587,\"start\":67585},{\"end\":67912,\"start\":67908},{\"end\":67927,\"start\":67922},{\"end\":67948,\"start\":67938},{\"end\":67957,\"start\":67950},{\"end\":68302,\"start\":68298},{\"end\":68318,\"start\":68313},{\"end\":68327,\"start\":68320},{\"end\":68766,\"start\":68758},{\"end\":68783,\"start\":68776},{\"end\":68789,\"start\":68785},{\"end\":69110,\"start\":69105},{\"end\":69353,\"start\":69346},{\"end\":69368,\"start\":69362},{\"end\":69382,\"start\":69379},{\"end\":69399,\"start\":69393},{\"end\":69798,\"start\":69793},{\"end\":69811,\"start\":69804},{\"end\":69821,\"start\":69817},{\"end\":70266,\"start\":70261},{\"end\":70282,\"start\":70275},{\"end\":70637,\"start\":70632},{\"end\":70653,\"start\":70648},{\"end\":70666,\"start\":70662},{\"end\":70683,\"start\":70675},{\"end\":70961,\"start\":70957},{\"end\":70973,\"start\":70969},{\"end\":70982,\"start\":70979},{\"end\":70993,\"start\":70991},{\"end\":71414,\"start\":71407},{\"end\":71424,\"start\":71418},{\"end\":71437,\"start\":71428},{\"end\":71450,\"start\":71443},{\"end\":71459,\"start\":71454},{\"end\":71933,\"start\":71926},{\"end\":72179,\"start\":72173},{\"end\":72189,\"start\":72183},{\"end\":72198,\"start\":72191},{\"end\":72486,\"start\":72479},{\"end\":72495,\"start\":72491},{\"end\":72499,\"start\":72497},{\"end\":72998,\"start\":72994},{\"end\":73010,\"start\":73007},{\"end\":73018,\"start\":73012},{\"end\":73340,\"start\":73334},{\"end\":73355,\"start\":73346},{\"end\":73370,\"start\":73359},{\"end\":73383,\"start\":73378},{\"end\":73394,\"start\":73387},{\"end\":73886,\"start\":73882},{\"end\":73913,\"start\":73899},{\"end\":73927,\"start\":73925},{\"end\":73940,\"start\":73938},{\"end\":73962,\"start\":73950},{\"end\":74379,\"start\":74376},{\"end\":74392,\"start\":74387},{\"end\":74852,\"start\":74846},{\"end\":74867,\"start\":74860},{\"end\":75134,\"start\":75131},{\"end\":75144,\"start\":75141},{\"end\":75151,\"start\":75148},{\"end\":75164,\"start\":75160},{\"end\":75171,\"start\":75166}]", "bib_entry": "[{\"attributes\":{\"id\":\"b0\"},\"end\":52553,\"start\":52330},{\"attributes\":{\"id\":\"b1\"},\"end\":52645,\"start\":52555},{\"attributes\":{\"id\":\"b2\"},\"end\":53112,\"start\":52647},{\"attributes\":{\"id\":\"b3\"},\"end\":53304,\"start\":53114},{\"attributes\":{\"id\":\"b4\"},\"end\":53496,\"start\":53306},{\"attributes\":{\"id\":\"b5\"},\"end\":53594,\"start\":53498},{\"attributes\":{\"id\":\"b6\"},\"end\":53869,\"start\":53596},{\"attributes\":{\"id\":\"b7\"},\"end\":54025,\"start\":53871},{\"attributes\":{\"id\":\"b8\"},\"end\":54273,\"start\":54027},{\"attributes\":{\"id\":\"b9\"},\"end\":54468,\"start\":54275},{\"attributes\":{\"id\":\"b10\"},\"end\":54590,\"start\":54470},{\"attributes\":{\"id\":\"b11\"},\"end\":54792,\"start\":54592},{\"attributes\":{\"id\":\"b12\"},\"end\":55092,\"start\":54794},{\"attributes\":{\"id\":\"b13\"},\"end\":55358,\"start\":55094},{\"attributes\":{\"id\":\"b14\"},\"end\":55557,\"start\":55360},{\"attributes\":{\"id\":\"b15\"},\"end\":55856,\"start\":55559},{\"attributes\":{\"id\":\"b16\"},\"end\":55994,\"start\":55858},{\"attributes\":{\"id\":\"b17\"},\"end\":56289,\"start\":55996},{\"attributes\":{\"id\":\"b18\",\"matched_paper_id\":2760502},\"end\":56506,\"start\":56291},{\"attributes\":{\"id\":\"b19\",\"matched_paper_id\":28887955},\"end\":56914,\"start\":56508},{\"attributes\":{\"id\":\"b20\",\"matched_paper_id\":18418088},\"end\":57314,\"start\":56916},{\"attributes\":{\"id\":\"b21\"},\"end\":57589,\"start\":57316},{\"attributes\":{\"doi\":\"10.1108/02602280810882535\",\"id\":\"b22\",\"matched_paper_id\":108947355},\"end\":57872,\"start\":57591},{\"attributes\":{\"id\":\"b23\",\"matched_paper_id\":17265856},\"end\":58280,\"start\":57874},{\"attributes\":{\"id\":\"b24\",\"matched_paper_id\":42956175},\"end\":58771,\"start\":58282},{\"attributes\":{\"id\":\"b25\",\"matched_paper_id\":18406625},\"end\":59207,\"start\":58773},{\"attributes\":{\"id\":\"b26\"},\"end\":59449,\"start\":59209},{\"attributes\":{\"id\":\"b27\"},\"end\":59633,\"start\":59451},{\"attributes\":{\"id\":\"b28\",\"matched_paper_id\":9055005},\"end\":59998,\"start\":59635},{\"attributes\":{\"doi\":\"10.1109/TMTT.2011.2181534\",\"id\":\"b29\",\"matched_paper_id\":10825832},\"end\":60617,\"start\":60000},{\"attributes\":{\"doi\":\"10.1109/TIM.2013.2248290\",\"id\":\"b30\",\"matched_paper_id\":27251073},\"end\":61102,\"start\":60619},{\"attributes\":{\"id\":\"b31\",\"matched_paper_id\":206607575},\"end\":61499,\"start\":61104},{\"attributes\":{\"id\":\"b32\",\"matched_paper_id\":1226336},\"end\":61863,\"start\":61501},{\"attributes\":{\"id\":\"b33\",\"matched_paper_id\":36989584},\"end\":62416,\"start\":61865},{\"attributes\":{\"doi\":\"10.1145/2897824.2925953\",\"id\":\"b34\",\"matched_paper_id\":6601027},\"end\":62948,\"start\":62418},{\"attributes\":{\"id\":\"b35\",\"matched_paper_id\":29565200},\"end\":63614,\"start\":62950},{\"attributes\":{\"id\":\"b36\",\"matched_paper_id\":3355455},\"end\":64022,\"start\":63616},{\"attributes\":{\"id\":\"b37\",\"matched_paper_id\":20118133},\"end\":64381,\"start\":64024},{\"attributes\":{\"id\":\"b38\"},\"end\":64538,\"start\":64383},{\"attributes\":{\"id\":\"b39\"},\"end\":64830,\"start\":64540},{\"attributes\":{\"id\":\"b40\",\"matched_paper_id\":31296644},\"end\":65288,\"start\":64832},{\"attributes\":{\"id\":\"b41\",\"matched_paper_id\":107913720},\"end\":65693,\"start\":65290},{\"attributes\":{\"doi\":\"10.1109/TBME.2011.2111371\",\"id\":\"b42\",\"matched_paper_id\":9071983},\"end\":66276,\"start\":65695},{\"attributes\":{\"id\":\"b43\",\"matched_paper_id\":650040},\"end\":66969,\"start\":66278},{\"attributes\":{\"id\":\"b44\"},\"end\":67202,\"start\":66971},{\"attributes\":{\"id\":\"b45\"},\"end\":67436,\"start\":67204},{\"attributes\":{\"id\":\"b46\",\"matched_paper_id\":32502038},\"end\":67846,\"start\":67438},{\"attributes\":{\"id\":\"b47\",\"matched_paper_id\":8634668},\"end\":68204,\"start\":67848},{\"attributes\":{\"id\":\"b48\",\"matched_paper_id\":1444080},\"end\":68701,\"start\":68206},{\"attributes\":{\"id\":\"b49\"},\"end\":68991,\"start\":68703},{\"attributes\":{\"id\":\"b50\"},\"end\":69259,\"start\":68993},{\"attributes\":{\"id\":\"b51\",\"matched_paper_id\":9128260},\"end\":69714,\"start\":69261},{\"attributes\":{\"doi\":\"10.1109/22.942570\",\"id\":\"b52\",\"matched_paper_id\":110983808},\"end\":70144,\"start\":69716},{\"attributes\":{\"id\":\"b53\",\"matched_paper_id\":32870937},\"end\":70549,\"start\":70146},{\"attributes\":{\"id\":\"b54\",\"matched_paper_id\":18063006},\"end\":70876,\"start\":70551},{\"attributes\":{\"id\":\"b55\",\"matched_paper_id\":5691682},\"end\":71329,\"start\":70878},{\"attributes\":{\"doi\":\"10.1109/TIM.2010.2101330\",\"id\":\"b56\",\"matched_paper_id\":2798875},\"end\":71820,\"start\":71331},{\"attributes\":{\"id\":\"b57\",\"matched_paper_id\":106640431},\"end\":72108,\"start\":71822},{\"attributes\":{\"id\":\"b58\",\"matched_paper_id\":21929134},\"end\":72437,\"start\":72110},{\"attributes\":{\"id\":\"b59\",\"matched_paper_id\":45044201},\"end\":72843,\"start\":72439},{\"attributes\":{\"id\":\"b60\",\"matched_paper_id\":3485851},\"end\":73245,\"start\":72845},{\"attributes\":{\"doi\":\"10.1109/TIM.2014.2331432\",\"id\":\"b61\",\"matched_paper_id\":3242832},\"end\":73770,\"start\":73247},{\"attributes\":{\"id\":\"b62\",\"matched_paper_id\":18014972},\"end\":74299,\"start\":73772},{\"attributes\":{\"id\":\"b63\",\"matched_paper_id\":12788258},\"end\":74774,\"start\":74301},{\"attributes\":{\"id\":\"b64\",\"matched_paper_id\":206796385},\"end\":75076,\"start\":74776},{\"attributes\":{\"id\":\"b65\",\"matched_paper_id\":16201183},\"end\":75555,\"start\":75078}]", "bib_title": "[{\"end\":52770,\"start\":52647},{\"end\":56352,\"start\":56291},{\"end\":56600,\"start\":56508},{\"end\":56984,\"start\":56916},{\"end\":57376,\"start\":57316},{\"end\":57643,\"start\":57591},{\"end\":57976,\"start\":57874},{\"end\":58362,\"start\":58282},{\"end\":58866,\"start\":58773},{\"end\":59696,\"start\":59635},{\"end\":60084,\"start\":60000},{\"end\":60717,\"start\":60619},{\"end\":61168,\"start\":61104},{\"end\":61555,\"start\":61501},{\"end\":62028,\"start\":61865},{\"end\":62477,\"start\":62418},{\"end\":63031,\"start\":62950},{\"end\":63683,\"start\":63616},{\"end\":64096,\"start\":64024},{\"end\":64913,\"start\":64832},{\"end\":65358,\"start\":65290},{\"end\":65819,\"start\":65695},{\"end\":66378,\"start\":66278},{\"end\":67048,\"start\":66971},{\"end\":67500,\"start\":67438},{\"end\":67904,\"start\":67848},{\"end\":68294,\"start\":68206},{\"end\":69337,\"start\":69261},{\"end\":69787,\"start\":69716},{\"end\":70252,\"start\":70146},{\"end\":70623,\"start\":70551},{\"end\":70950,\"start\":70878},{\"end\":71403,\"start\":71331},{\"end\":71912,\"start\":71822},{\"end\":72169,\"start\":72110},{\"end\":72475,\"start\":72439},{\"end\":72986,\"start\":72845},{\"end\":73330,\"start\":73247},{\"end\":73872,\"start\":73772},{\"end\":74369,\"start\":74301},{\"end\":74838,\"start\":74776},{\"end\":75123,\"start\":75078}]", "bib_author": "[{\"end\":52389,\"start\":52379},{\"end\":52565,\"start\":52555},{\"end\":52782,\"start\":52772},{\"end\":53168,\"start\":53158},{\"end\":53316,\"start\":53306},{\"end\":53510,\"start\":53500},{\"end\":53666,\"start\":53656},{\"end\":53883,\"start\":53873},{\"end\":54093,\"start\":54083},{\"end\":54285,\"start\":54275},{\"end\":54482,\"start\":54472},{\"end\":54665,\"start\":54655},{\"end\":54857,\"start\":54847},{\"end\":55106,\"start\":55096},{\"end\":55406,\"start\":55396},{\"end\":55640,\"start\":55630},{\"end\":55870,\"start\":55858},{\"end\":55883,\"start\":55870},{\"end\":56025,\"start\":56017},{\"end\":56043,\"start\":56025},{\"end\":56060,\"start\":56043},{\"end\":56070,\"start\":56060},{\"end\":56080,\"start\":56070},{\"end\":56096,\"start\":56080},{\"end\":56104,\"start\":56096},{\"end\":56369,\"start\":56354},{\"end\":56384,\"start\":56369},{\"end\":56626,\"start\":56602},{\"end\":57001,\"start\":56986},{\"end\":57019,\"start\":57001},{\"end\":57035,\"start\":57019},{\"end\":57050,\"start\":57035},{\"end\":57665,\"start\":57645},{\"end\":58004,\"start\":57978},{\"end\":58021,\"start\":58004},{\"end\":58028,\"start\":58021},{\"end\":58387,\"start\":58364},{\"end\":58402,\"start\":58387},{\"end\":58414,\"start\":58402},{\"end\":58427,\"start\":58414},{\"end\":58441,\"start\":58427},{\"end\":58457,\"start\":58441},{\"end\":58466,\"start\":58457},{\"end\":58877,\"start\":58868},{\"end\":58894,\"start\":58877},{\"end\":58912,\"start\":58894},{\"end\":58919,\"start\":58912},{\"end\":59298,\"start\":59288},{\"end\":59309,\"start\":59298},{\"end\":59504,\"start\":59487},{\"end\":59520,\"start\":59504},{\"end\":59708,\"start\":59698},{\"end\":59723,\"start\":59708},{\"end\":60099,\"start\":60086},{\"end\":60113,\"start\":60099},{\"end\":60124,\"start\":60113},{\"end\":60134,\"start\":60124},{\"end\":60143,\"start\":60134},{\"end\":60155,\"start\":60143},{\"end\":60167,\"start\":60155},{\"end\":60178,\"start\":60167},{\"end\":60193,\"start\":60178},{\"end\":60734,\"start\":60719},{\"end\":60749,\"start\":60734},{\"end\":61181,\"start\":61170},{\"end\":61190,\"start\":61181},{\"end\":61196,\"start\":61190},{\"end\":61202,\"start\":61196},{\"end\":61208,\"start\":61202},{\"end\":61223,\"start\":61208},{\"end\":61572,\"start\":61557},{\"end\":61584,\"start\":61572},{\"end\":61593,\"start\":61584},{\"end\":62043,\"start\":62030},{\"end\":62051,\"start\":62043},{\"end\":62062,\"start\":62051},{\"end\":62077,\"start\":62062},{\"end\":62092,\"start\":62077},{\"end\":62491,\"start\":62479},{\"end\":62516,\"start\":62491},{\"end\":62536,\"start\":62516},{\"end\":62553,\"start\":62536},{\"end\":62568,\"start\":62553},{\"end\":62581,\"start\":62568},{\"end\":62592,\"start\":62581},{\"end\":62602,\"start\":62592},{\"end\":63043,\"start\":63033},{\"end\":63054,\"start\":63043},{\"end\":63066,\"start\":63054},{\"end\":63077,\"start\":63066},{\"end\":63090,\"start\":63077},{\"end\":63099,\"start\":63090},{\"end\":63692,\"start\":63685},{\"end\":63702,\"start\":63692},{\"end\":63710,\"start\":63702},{\"end\":63718,\"start\":63710},{\"end\":63724,\"start\":63718},{\"end\":63730,\"start\":63724},{\"end\":63736,\"start\":63730},{\"end\":63742,\"start\":63736},{\"end\":64110,\"start\":64098},{\"end\":64121,\"start\":64110},{\"end\":64141,\"start\":64121},{\"end\":64155,\"start\":64141},{\"end\":64171,\"start\":64155},{\"end\":64423,\"start\":64408},{\"end\":64631,\"start\":64619},{\"end\":64639,\"start\":64631},{\"end\":64926,\"start\":64915},{\"end\":64945,\"start\":64926},{\"end\":64954,\"start\":64945},{\"end\":64978,\"start\":64954},{\"end\":64989,\"start\":64978},{\"end\":65371,\"start\":65360},{\"end\":65388,\"start\":65371},{\"end\":65399,\"start\":65388},{\"end\":65836,\"start\":65821},{\"end\":65849,\"start\":65836},{\"end\":65860,\"start\":65849},{\"end\":65866,\"start\":65860},{\"end\":65880,\"start\":65866},{\"end\":66393,\"start\":66380},{\"end\":66407,\"start\":66393},{\"end\":66430,\"start\":66407},{\"end\":66442,\"start\":66430},{\"end\":66455,\"start\":66442},{\"end\":66463,\"start\":66455},{\"end\":67063,\"start\":67050},{\"end\":67276,\"start\":67267},{\"end\":67286,\"start\":67276},{\"end\":67516,\"start\":67502},{\"end\":67543,\"start\":67516},{\"end\":67565,\"start\":67543},{\"end\":67576,\"start\":67565},{\"end\":67589,\"start\":67576},{\"end\":67914,\"start\":67906},{\"end\":67929,\"start\":67914},{\"end\":67950,\"start\":67929},{\"end\":67959,\"start\":67950},{\"end\":68304,\"start\":68296},{\"end\":68320,\"start\":68304},{\"end\":68329,\"start\":68320},{\"end\":68768,\"start\":68756},{\"end\":68785,\"start\":68768},{\"end\":68791,\"start\":68785},{\"end\":69112,\"start\":69101},{\"end\":69355,\"start\":69339},{\"end\":69370,\"start\":69355},{\"end\":69384,\"start\":69370},{\"end\":69401,\"start\":69384},{\"end\":69800,\"start\":69789},{\"end\":69813,\"start\":69800},{\"end\":69823,\"start\":69813},{\"end\":70268,\"start\":70254},{\"end\":70284,\"start\":70268},{\"end\":70639,\"start\":70625},{\"end\":70655,\"start\":70639},{\"end\":70668,\"start\":70655},{\"end\":70685,\"start\":70668},{\"end\":70963,\"start\":70952},{\"end\":70975,\"start\":70963},{\"end\":70984,\"start\":70975},{\"end\":70995,\"start\":70984},{\"end\":71416,\"start\":71405},{\"end\":71426,\"start\":71416},{\"end\":71439,\"start\":71426},{\"end\":71452,\"start\":71439},{\"end\":71461,\"start\":71452},{\"end\":71935,\"start\":71914},{\"end\":72181,\"start\":72171},{\"end\":72191,\"start\":72181},{\"end\":72200,\"start\":72191},{\"end\":72488,\"start\":72477},{\"end\":72497,\"start\":72488},{\"end\":72501,\"start\":72497},{\"end\":73000,\"start\":72988},{\"end\":73012,\"start\":73000},{\"end\":73020,\"start\":73012},{\"end\":73342,\"start\":73332},{\"end\":73357,\"start\":73342},{\"end\":73372,\"start\":73357},{\"end\":73385,\"start\":73372},{\"end\":73396,\"start\":73385},{\"end\":73888,\"start\":73874},{\"end\":73915,\"start\":73888},{\"end\":73929,\"start\":73915},{\"end\":73942,\"start\":73929},{\"end\":73964,\"start\":73942},{\"end\":74381,\"start\":74371},{\"end\":74394,\"start\":74381},{\"end\":74854,\"start\":74840},{\"end\":74869,\"start\":74854},{\"end\":75136,\"start\":75125},{\"end\":75146,\"start\":75136},{\"end\":75153,\"start\":75146},{\"end\":75166,\"start\":75153},{\"end\":75173,\"start\":75166}]", "bib_venue": "[{\"end\":63311,\"start\":63205},{\"end\":64187,\"start\":64183},{\"end\":66652,\"start\":66566},{\"end\":74561,\"start\":74486},{\"end\":75340,\"start\":75265},{\"end\":52377,\"start\":52330},{\"end\":52573,\"start\":52565},{\"end\":52786,\"start\":52782},{\"end\":53156,\"start\":53114},{\"end\":53371,\"start\":53316},{\"end\":53654,\"start\":53596},{\"end\":53920,\"start\":53883},{\"end\":54081,\"start\":54027},{\"end\":54333,\"start\":54285},{\"end\":54653,\"start\":54592},{\"end\":54845,\"start\":54794},{\"end\":55133,\"start\":55106},{\"end\":55394,\"start\":55360},{\"end\":55628,\"start\":55559},{\"end\":55911,\"start\":55883},{\"end\":56015,\"start\":55996},{\"end\":56388,\"start\":56384},{\"end\":56658,\"start\":56626},{\"end\":57099,\"start\":57050},{\"end\":57388,\"start\":57378},{\"end\":57703,\"start\":57690},{\"end\":58060,\"start\":58028},{\"end\":58470,\"start\":58466},{\"end\":58971,\"start\":58919},{\"end\":59286,\"start\":59209},{\"end\":59485,\"start\":59451},{\"end\":59796,\"start\":59723},{\"end\":60270,\"start\":60218},{\"end\":60825,\"start\":60773},{\"end\":61275,\"start\":61223},{\"end\":61620,\"start\":61593},{\"end\":62122,\"start\":62092},{\"end\":62641,\"start\":62625},{\"end\":63203,\"start\":63099},{\"end\":63794,\"start\":63742},{\"end\":64181,\"start\":64171},{\"end\":64406,\"start\":64383},{\"end\":64617,\"start\":64540},{\"end\":65041,\"start\":64989},{\"end\":65486,\"start\":65399},{\"end\":65948,\"start\":65905},{\"end\":66564,\"start\":66463},{\"end\":67076,\"start\":67063},{\"end\":67265,\"start\":67204},{\"end\":67613,\"start\":67589},{\"end\":68007,\"start\":67959},{\"end\":68442,\"start\":68329},{\"end\":68754,\"start\":68703},{\"end\":69099,\"start\":68993},{\"end\":69472,\"start\":69401},{\"end\":69892,\"start\":69840},{\"end\":70316,\"start\":70284},{\"end\":70695,\"start\":70685},{\"end\":71092,\"start\":70995},{\"end\":71537,\"start\":71485},{\"end\":71957,\"start\":71935},{\"end\":72255,\"start\":72200},{\"end\":72620,\"start\":72501},{\"end\":73027,\"start\":73020},{\"end\":73472,\"start\":73420},{\"end\":74016,\"start\":73964},{\"end\":74484,\"start\":74394},{\"end\":74907,\"start\":74869},{\"end\":75263,\"start\":75173}]"}}}, "year": 2023, "month": 12, "day": 17}