{"id": 53218829, "updated": "2023-10-01 16:36:29.441", "metadata": {"title": "Wizard of Wikipedia: Knowledge-Powered Conversational agents", "authors": "[{\"first\":\"Emily\",\"last\":\"Dinan\",\"middle\":[]},{\"first\":\"Stephen\",\"last\":\"Roller\",\"middle\":[]},{\"first\":\"Kurt\",\"last\":\"Shuster\",\"middle\":[]},{\"first\":\"Angela\",\"last\":\"Fan\",\"middle\":[]},{\"first\":\"Michael\",\"last\":\"Auli\",\"middle\":[]},{\"first\":\"Jason\",\"last\":\"Weston\",\"middle\":[]}]", "venue": "ArXiv", "journal": "ArXiv", "publication_date": {"year": 2018, "month": 11, "day": 3}, "abstract": "In open-domain dialogue intelligent agents should exhibit the use of knowledge, however there are few convincing demonstrations of this to date. The most popular sequence to sequence models typically\"generate and hope\"generic utterances that can be memorized in the weights of the model when mapping from input utterance(s) to output, rather than employing recalled knowledge as context. Use of knowledge has so far proved difficult, in part because of the lack of a supervised learning benchmark task which exhibits knowledgeable open dialogue with clear grounding. To that end we collect and release a large dataset with conversations directly grounded with knowledge retrieved from Wikipedia. We then design architectures capable of retrieving knowledge, reading and conditioning on it, and finally generating natural responses. Our best performing dialogue models are able to conduct knowledgeable discussions on open-domain topics as evaluated by automatic metrics and human evaluations, while our new benchmark allows for measuring further improvements in this important research direction.", "fields_of_study": "[\"Computer Science\"]", "external_ids": {"arxiv": "1811.01241", "mag": "2963475460", "acl": null, "pubmed": null, "pubmedcentral": null, "dblp": "conf/iclr/DinanRSFAW19", "doi": null}}, "content": {"source": {"pdf_hash": "227458886343b86bd15adf58c769be326b4b058a", "pdf_src": "Arxiv", "pdf_uri": "[\"https://arxiv.org/pdf/1811.01241v1.pdf\"]", "oa_url_match": false, "oa_info": null}, "grobid": {"id": "d6f2457e1da7645aff2d598a4e40d08d0a54c35d", "type": "plain-text", "url": "s3://ai2-s2-pdf-extraction-prod/parse-results/s2orc_worker/227458886343b86bd15adf58c769be326b4b058a.txt", "contents": "\nOF WIKIPEDIA: KNOWLEDGE-POWERED CONVERSATIONAL AGENTS\n\n\nEmily Dinan edinan@fb.com \nFacebook AI Research\n\n\nStephen Roller roller@fb.com \nFacebook AI Research\n\n\nKurt Shuster kshuster@fb.com \nFacebook AI Research\n\n\nAngela Fan angelafan@fb.com \nFacebook AI Research\n\n\nMichael Auli michaelauli@fb.com \nFacebook AI Research\n\n\nJason Weston \nFacebook AI Research\n\n\nOF WIKIPEDIA: KNOWLEDGE-POWERED CONVERSATIONAL AGENTS\n\nIn open-domain dialogue intelligent agents should exhibit the use of knowledge, however there are few convincing demonstrations of this to date. The most popular sequence to sequence models typically \"generate and hope\" generic utterances that can be memorized in the weights of the model when mapping from input utterance(s) to output, rather than employing recalled knowledge as context. Use of knowledge has so far proved difficult, in part because of the lack of a supervised learning benchmark task which exhibits knowledgeable open dialogue with clear grounding. To that end we collect and release a large dataset with conversations directly grounded with knowledge retrieved from Wikipedia. We then design architectures capable of retrieving knowledge, reading and conditioning on it, and finally generating natural responses. Our best performing dialogue models are able to conduct knowledgeable discussions on open-domain topics as evaluated by automatic metrics and human evaluations, while our new benchmark allows for measuring further improvements in this important research direction. * Joint first authors.\n\nINTRODUCTION\n\nArguably, one of the key goals of AI, and the ultimate the goal of natural language research, is for humans to be able to talk to machines. In order to get close to this goal, machines must master a number of skills: to be able to comprehend language, employ memory to retain and recall knowledge, to reason about these concepts together, and finally output a response that both fulfills functional goals in the conversation while simultaneously being captivating to their human speaking partner. The current state-of-the-art approaches, sequence to sequence models of various kinds (Sutskever et al., 2014;Vinyals & Le, 2015;Serban et al., 2016;Vaswani et al., 2017) attempt to address some of these skills, but generally suffer from an inability to bring memory and knowledge to bear; as indicated by their name, they involve encoding an input sequence, providing limited reasoning by transforming their hidden state given the input, and then decoding to an output. To converse intelligently on a given topic, a speaker clearly needs knowledge of that subject, and it is our contention here that more direct knowledge memory mechanisms need to be employed. In this work we consider setups where this can be naturally measured and built.\n\nWe consider the task of open-domain dialogue, where two speakers conduct open-ended chit-chat given an initial starting topic, and during the course of the conversation the topic can broaden or focus on related themes. During such conversations, an interlocutor can glean new information and personal points of view from their speaking partner, while providing similarly themselves. This is a challenging task as it requires several components not found in many standard models. We design a set of architectures specifically for this goal that combine elements of Memory Network architectures (Sukhbaatar et al., 2015) to retrieve knowledge and read and condition on it, and Transformer architectures (Vaswani et al., 2017) to provide state-of-the-art text representations and sequence models for generating outputs, which we term Transformer Memory Networks.\n\nAs, to our knowledge, no public domain dataset of requisite scale exists, we build a supervised dataset of human-human conversations using crowd-sourced workers, first crowd-sourcing 1307 diverse discussion topics and then conversations involving 201, 999 utterances about them. Each topic is connected to Wikipedia, and one of the humans (the wizard) is asked to link the knowledge they use to sentences from existing articles. In this way, we have both a natural way to train a knowledgeable conversation agent, by employing a memory component that can recall and ground on this existing text, and a natural way to evaluate models that we build, by assessing their ability at locating and using such knowledge.\n\nOur Transformer Memory Network architectures, both in retrieval and generative versions, are tested in this setup using both automatic metrics and human evaluations. We show their ability to execute engaging knowledgeable conversations with humans, compared to a number of baselines such as standard Memory Networks or Transformers. Our new benchmark, made available in ParlAI (http://parl.ai), aims to encourage and measure further improvements in this important research direction.\n\n\nRELATED WORK\n\nMany existing dialogue tasks do not study the use of knowledge explicitly. For example, popular chit-chat datasets such as Open-Subtitles (Vinyals & Le, 2015), Persona-Chat (Zhang et al., 2018) and Twitter (Sordoni et al., 2015) have tested the ability of sequence-to-sequence models that attend over the recent dialogue history, but do not attempt to recall long-term knowledge beyond encoding it directly into the weights of the feed-forward network.\n\nIn the area of goal-directed dialogue, separate from open domain chit-chat, such as airline (El Asri et al., 2017) or restaurant booking (Henderson et al., 2014;, knowledge conditioning is typically employed by allowing access to a database through API calls or otherwise. In contrast, our work investigates unstructured knowledge across a large, diverse set of topics potentially spanning all of Wikipedia.\n\nIn question answering one does not produce a dialogue response based on a conversation history, but a factual answer based on a question. In that case, it is clear that retrieving and conditioning knowledge is vital. For example, in SQuAD neural models have been developed that attend to a given paragraph from Wikipedia to answer questions (Rajpurkar et al., 2016), or Open-SQuAD which extends this to answering without being given the paragraph, instead performing retrieval over the entirety of Wikipedia (Chen et al., 2017). Recently, the QuAC dataset investigates similar themes, but as a sequence of questions and answers in dialogue form instead (Choi et al., 2018). In this work we do not address question answering, but focus on natural human dialogues which contain a diverse set of utterances, not just questions and answers.\n\nThe closest work to ours lies in the area of non-goal directed dialogue incorporating knowledge. The work of Dodge et al. (2016) employed Memory Networks to perform dialogue discussing movies in terms of recommendation and open-ended discussion from Reddit, conditioning on a structured knowledge base. Zhou et al. (2018) also links Reddit to structured knowledge. Both Ghazvininejad et al. (2018) and Parthasarathi & Pineau (2018) use unstructured text instead, as we do: the former to discuss news articles using Wikipedia summaries as knowledge, and the latter to discuss local businesses in two-turn dialogues using Foursquare tips as knowledge. Ghazvininejad et al. (2018) uses an extended Encoder-Decoder where the decoder is provided with an encoding of the context along with the external knowledge encoding. Parthasarathi & Pineau (2018) uses a Bag-of-Words Memory Network type fact encoder and an RNN decoder. Our work compares Memory Networks (Sukhbaatar et al., 2015) and Transformers which have been shown to be on-par or superior to RNN encoder-decoders (Vaswani et al., 2017), and develops an architecture that combines these approaches. Our paper shows models working on full multi-turn dialogue in an open-domain setting, which to our knowledge was not shown before.\n\n\nWIZARD OF WIKIPEDIA\n\nWe consider the following general open-domain dialogue setting: two participants engage in chitchat, with one of the participants selecting a beginning topic, and during the conversation the topic is allowed to naturally change. The two participants, however, are not quite symmetric: one will play the role of a knowledgeable expert (which we refer to as the wizard) while the other is a curious learner (the apprentice).\n\nApprentice At each stage of the conversation the apprentice talks to the wizard freely, playing the role of a curious learner, eager to chat. Their goal is to go into depth about a chosen topic that interests themselves or their partner, while keeping the conversation engaging and fun. Note that the instruction to delve deeply into a topic makes this different to more \"shallow\" chit-chat tasks. In this task the use of knowledge is emphasized more.\n\nWizard The wizard is given the following instructions: \"You have just met the other person, who seems quite curious, and you are eager to discuss a topic with them!\" Their goal is to inform their conversation partner about a topic that one of them will choose. Crucially, the wizard has access to an information retrieval system that shows them paragraphs from Wikipedia possibly relevant to the conversation, which are unobserved by the apprentice. Before each conversation turn the wizard can read these paragraphs and then potentially base their next reply on that observed knowledge. Note, the wizard is particularly instructed not to simply parrot this knowledge, but to use it to craft a relevant reply, and to present any relevant knowledge in a fun and engaging way, if possible.\n\n\nConversation Flow\n\nThe flow of the conversation thus takes place as follows.\n\n1. Either the wizard or apprentice is picked to choose the topic and speak first. The other player receives the topic information, and the conversation begins.\n\n2. When the apprentice sends the wizard a message, the wizard is shown relevant knowledge (described below), and must choose a relevant sentence in order to construct a response.\n\n3. The Wizard responds to the apprentice basing their response on their chosen sentence.\n\n4. The conversation turns repeat until a minimum number of turns (5 each) is reached.\n\nAfter collecting data of such wizard-apprentice conversations between humans, the goal is to then replace the human wizard with a learned agent that will speak to a human apprentice instead, similar to the procedure in Wizard of Oz experiments (Bernsen et al., 2012).\n\nTopics We crowd-sourced a set of 1431 natural, open-domain dialogue topics, each linked to a Wikipedia article. These include diverse topics such as commuting, Gouda cheese, music festivals, podcasts, bowling, and Arnold Schwarzenegger.\n\nKnowledge Retrieval At each step of the dialogue the wizard has access to a set of passages of knowledge which may be relevant to the given dialogue context. While this is a potentially learnable part of the model, we required for this to be fixed so that we could present the results to the annotator when collecting the dataset. We thus used exactly the same retriever that is commonly used for the Open-SQuAD dataset in Chen et al. (2017). It uses a simple inverted index lookup followed by term vector model scoring. Articles and queries are compared as TF-IDF weighted bag-of-word and n-gram vectors, using the hashing trick. We retrieve the top 7 articles (first paragraph only) for the last two turns of dialogue (by wizard and apprentice) and the article (first 10 sentences only) for the original topic, and present these articles to the wizard as knowledge context, along with their titles. Note that while this system is used to build the dataset, a superior method can in principle be learned and used by a model at test time.\n\nKnowledge Selection and Response Generation During data collection, the wizard can click on any of the retrieved article titles in the dialogue UI to expand that article, at which point they can click on a sentence that is most relevant to the response they want to make (only one article, and one sentence can be selected on any turn, for simplicity). If they see no relevant article or sentence they can choose no sentence used instead. The wizard then enters their response to the apprentice. An image of the Wizard's UI is shown in Appendix A.1.  \n\n\nFinal Dialogue Dataset\n\n\nMODELS\n\nIn this work we consider learning dialogue models to replace the wizard in our learning tasks, i.e. the knowledgeable speaker. The dialogue model thus can have access to a knowledge source, in this case Wikipedia, to ground the conversation with. We thus develop extensions of the Memory Network (Sukhbaatar et al., 2015) and Transformer (Vaswani et al., 2017) models that can (i) retrieve from a large memory relevant information conditioned on the dialogue history, (ii) carefully read and attend over the retrieved set of knowledge, and then (iii) generate the next dialogue utterance. This model is then used consecutively on each turn to form an entire dialogue with a user.\n\nWe develop two classes of models capable of leveraging knowledge: (i) retrieval models that produce an output among a set of candidate responses (the set of utterances from the training set); and (ii) generative models that generate word-by-word (using a beam).\n\nThe input to either model is the same: at each dialogue turn where the model is intended to make a response, it is given the current dialogue context x 1 , . . . , x t of t dialogue turns, where x 1 is always the initial starting topic (e.g. \"Kurt Cobain\"), and the remaining turns swap between the two speakers. The goal at each stage is to output the next utterance x t+1 .\n\nKnowledge Retrieval We assume a large knowledge base (memory) m 1 , . . . , m N which is hierarchically organized into documents consisting of paragraphs and sentences. As it is infeasible for current neural attention techniques to operate on this scale, we use standard information retrieval (IR) techniques (c = IR(x, m)) as a first step to return a smaller set of candidates m c1 , . . . , m c K for fine-grained selection.\n\nIn our experiments, we use the IR system provided to the human annotators during dataset creation, detailed in Section 3. The retriever operates on the topic (x 1 ) and the last two turns (x t and x t−1 ) if they exist, effectively calling the IR system three times with three different queries. Empirically, this provided better performance compared to merging into one query, likely because it can address quite different topics. We retrieve the top 7 articles (first paragraph only) for each lookup and then flatten all the results into separate sentences (i.e. remove the organization of sentences belonging to articles), but prepend every sentence with its article title. In this way the candidates m c1 , . . . , m c K given to the neural model in the next stage can be attended to independently without having to deal with hierarchical issues.\n\n\nKnowledge Attention\n\nWe use an attention mechanism to perform fine-grained selection of which knowledge sentences will be used to produce the next turn of dialogue. Each sentence in the memory is independently encoded with a Transformer encoder (Vaswani et al., 2017), and the same Transformer is used to encode the dialogue context x. We then perform standard dot-product attention between the memory candidates and the dialogue context.\n\nUtterance Prediction Given the hidden state derived from the memory attention process described above, the final stage is to predict the output utterance that will form the next dialogue turn.\n\nWe consider different variants of the two stages above, knowledge attention and utterance prediction, when considering retrieval and generative variants of our models. We will now detail these in turn.  Figure 1: Generative Transformer Memory Network. An IR system provides knowledge candidates from Wikipedia. Dialogue Context and Knowledge are encoded using a shared encoder. In the Two-stage model, the dialogue and knowledge are re-encoded after knowledge selection.\n\n\nRETRIEVAL TRANSFORMER MEMORY NETWORK\n\nThis model encodes each knowledge sentence m c1 , . . . , m c K and the dialogue context x with a Transformer, as described above. The final input encoding is calculated by performing dot-product attention over enc(m c1 ), . . . , enc(m c K ) and adding the resulting weighted sum of these vectors to enc(x) to get the representation rep LHS (m c1 , . . . , m c K , x). The candidate responses r 1 , . . . , r L are encoded with a separate Transformer to get rep RHS (r i ) for each i. We choose as a response r where\n= arg max i∈{1,...,L} rep LHS (m c1 , · · · , m c K , x) rep LHS (m c1 , . . . , m c K , x) 2 • rep RHS (r i ) rep RHS (r i ) 2 .\nThe model is trained to minimize the cross-entropy loss, where the negative candidates for each example are the responses to the other examples in the batch.\n\n\nGENERATIVE TRANSFORMER MEMORY NETWORK\n\nWe consider two versions: a Two-stage and an End-to-end version. Both models find the most relevant piece of knowledge m best , and then perform an encoding step by concatenating it with the dialogue context, allowing the decoder to attend over both the knowledge and dialogue when formulating its response. We employ a beam search of 5 to select our best response. All generative models employ BPE encoding (Sennrich et al., 2016), which we found effective at enabling generators to copy rare words from Wikipedia sentences (Fan et al., 2018).\n\nIn the End-to-end version, a shared Transformer encoder is used to encode all candidates m ci and the dialogue history. The encoded candidates are flattened into vectors using the normalization from Cer et al. (2018) to produce an attention prediction over the memory. The full sequence encoding of the single highest selected knowledge m best is concatenated with the encoding of the dialogue, and passed into a Transformer decoder. An illustration of our End-to-end model is shown in Figure 1. We train the model to minimize the negative log-likelihood of the response utterance. We can add additional supervision by forcing the knowledge selection to correctly choose the same knowledge candidate as the human wizard in the training set by adding an additional cross-entropy loss over the knowledge attention, modulated by a weight λ:\nL = (1 − λ)L NLL + λL knowledge .\nIn the Two-stage version, we employ two separately trained models for each of these two tasks, knowledge selection and utterance prediction. As the knowledge selection step creates a hard decision influencing the output of the generator, we find maximizing the performance of this component to be vital. We can also improve performance of the decoder by employing knowledge dropout (K.D.), wherein we artificially prevent the model from attending to knowledge a fraction of the time during training. We find this helps the generator be more resilient to errors at the knowledge selection stage.\n\n\nEXPERIMENTS\n\nWe describe each of our experimental setups and results. We first investigate the ability of our models to select knowledge appropriately, and then consider the full task of dialogue with knowledge.  \n\n\nKNOWLEDGE SELECTION TASK\n\nBefore looking at the full Wizard dialogue task, we assess the ability of models to predict the knowledge selected by human wizards in the dataset given the dialogue history. This will inform us of the feasibility of this task and the best models to use in a two-stage architecture. We compare Transformers against various baselines including a random baseline; an Information Retrieval (IR) baseline, which uses simple word overlap; and a Bag-of-Words Memory Network (Sukhbaatar et al., 2015). Where noted, the Transformer is pretrained on Reddit data (Mazaré et al., 2018), and fine-tuned for our task. The results are shown in Table 2. Transformers work best, as long as they are pretrained on a large dataset (Reddit), while multi-tasking on SQuAD provides marginal impact. Further analysis of this task using other models is provided in Appendix B.1. We use the best performing Transformer model reported here for our two-stage generative Memory Network in the full dialogue task.\n\n\nFULL TASK: DIALOGUE WITH KNOWLEDGE\n\nWe evaluate our models on the full task of dialogue generation given knowledge in two settings: given the gold knowledge sentence chosen by a human, or where the model needs to predict which knowledge to use. We separately describe experiments for retrieval and generative models.\n\n\nRetrieval Experiments\n\nWe use similar baselines as in the knowledge selection experiments, but now also apply Transformer Memory Networks, which attend over knowledge. Models are evaluated measuring Recall@1 when ranking the gold response among 99 randomly chosen candidates, and unigram F1 of the model's prediction with the gold response. The results are shown in Table 3. We find that the addition of knowledge improves all models (improving Bow MemNet from 56 to 71 R@1 and the Transformer MemNet from 79 to 87 R@1) for predicted knowledge. Performance improves dramatically when models are provided gold knowledge, but otherwise retain similar trends.  Generative Experiments We compare our generative End-to-end and Two-stage Transformer Memory Network models to two more baselines: repeating the last utterance, and a generative Transformer model trained to respond to dialogue but without access to knowledge. Models are evaluated using perplexity (PPL) of the gold response and unigram F1.\n\nThe results are given in Table 4. Our experiments show that both the End-to-end and Two-stage models employ the knowledge in their response predictions, as they outperform their counterpart Transformer without knowledge, and demonstrate substantial improvements when provided the gold knowledge. While the Two-stage model produces significantly stronger perplexity and F1 scores using the predicted knowledge, the End-to-end model outperforms the Two-stage model in the gold knowledge experiments. This suggests that the Two-stage model benefits from the strong knowledge selection module (Section 5.1), but that the End-to-end model is better at employing the selected knowledge. Furthermore, we find that the additional knowledge selection supervision (auxiliary loss) in the End-to-end model improves it on every metric, suggesting that tightly integrating these tasks is beneficial. More evidence for this is shown in Appendix B.1. Lastly, we note that both Two-stage models give higher F1 scores than any of the retrieval models shown in Table 3.\n\n\nHUMAN EVALUATION\n\nWe perform human evaluation of our models using crowd-sourced workers. Humans are paired with our models and asked to chat about a specific topic (given a choice of 2-3 topics) for 3-5 dialogue turns. Following their conversation, the humans are asked to rate their dialogue partner on a scale of 1-5, with the rating indicating how much they \"liked\" the conversation. Using the collected conversations, we also calculate the F1 overlap score of the model's utterances with the first 10 sentences of the Wikipedia page for the chosen topic as a proxy for how much knowledge the model exhibits. For comparison, we also collect 100 human-human conversations, with only one human choosing the topic and performing evaluation. In total, we collect a total of 546 conversations with ratings from 464 distinct workers. These results are shown in Table 5.\n\nTopic: E-book (seen) Human: i do not know why, but I have never gotten into E-books Model: Same here. I have a kindle, but I don't use it for books. It's nicer to hold a real book and turn pages. Human: yes, i like the physical feel and smell of a real book Model: I actually had a Nook e-book where you had to download the e-book after selecting it online. I grew out of it, I prefer paper books also. Human: i tried e-books but I do not like reading on a screen, its disorientated for me Model: Yes, reading a book on a tablet just isn't the same! Human: plus I like owning the physical copy of a real book, I feel like I own it Model: I prefer print and newsreels. \n\n\nModel: Two-Stage Generative Transformer MemNet\n\nTopic: Shower (unseen) Human: So I've been looking for a better showerhead with more water pressure for my shower.\n\nModel: I love pressure-versed water at nearly constant temperature to a shower Human: That sounds pretty great! Love those rainshower showers! Model: the ancient greeks were the first people to have showers. Human: Well I knew they were good for something. Model: the original showers were neither indoor structures nor man made but were common. Human: Ah that sounds intimidating! Model: it is required manual transport of both fresh and waste water. We find that the retrieval models significantly outperform the generative models on human evaluations, indicating that humans prefer more natural responses (Student's t-test, p < .05). The human rating differences between retriever models with and without knowledge are not significant, but note they both trend toward use of knowledge due to the candidate sentences retrieved, with the knowledgeable version obtaining significantly higher Wiki F1 scores in both seen and unseen test sets.\n\nFor the generative models, we find human ratings are significantly improved by the use of knowledge (p < .01). The significantly higher Wiki F1 scores indicate that (i) these models convey more knowledge than their counterparts without knowledge conditioning; and (ii) on both seen and unseen sets they convey more knowledge than the retrieval models. In particular, on unseen data the gap between retrieval and generative models is larger. This is understandable, as retrieval models are limited to producing a response from the training set where the unseen topic did not appear.\n\nThere is still a considerable gap to human ratings of other humans compared to all our models (first row of Table 5). Figure 2 shows example conversations with the retrieval and generative models. Additional analysis and examples can be found in Appendix B.3 and C.\n\n\nCONCLUSION\n\nIn this work we build dialogue agents which are able to employ large memory systems containing encyclopedic knowledge about the world in order to conduct engaging open-domain conversations. We develop a set of architectures, Transformer Memory Network models, that are capable of retrieving and attending to such knowledge and outputting a response, either in retrieval or generative modes. To train and evaluate such models, we collect the Wizard of Wikipedia dataset, a large collection of open-domain dialogues grounded by Wikipedia knowledge, and demonstrated the effectiveness of our models in automatic and human experiments. Our task is made publicly available to encourage further model exploration, and expect such efforts will result in significant advances in this important research direction. Wizard: I'm impressed! It's a big responsibility to supervise other people's safety in the water! Tell me more. Apprentice: Well, I help make sure people do not drown or get injured while in or near the water! Knowledge: A lifeguard is a rescuer who supervises the safety and rescue of swimmers, surfers, . . .\n\nLifeguards are strong swimmers and trained in CPR/AED first aid, certified in water . . . · · · In some areas, the lifeguard service also carries out mountain rescues, or may function as the primary EMS provider.\n\nWizard: I've heard that in some places, lifeguards also help with other sorts of emergencies, like mountain rescues! Is that part of your job too? Apprentice: I have! I feel like you know much about this! What brings you to know so much?\n\nWizard: Oh, that's about the extent of my knowledge. I've just been around beaches and I've always admired lifeguards. I'm not a super strong swimmer myself. Topic: Armadillo Wizard: I love animals and think armadillos are awesome with their leathery shell. Apprentice: I don't think I've ever seen an armadillo in real life! Wizard: I've seen them at the zoo. Armadillo means little armored one in Spanish. Apprentice: Are they native to a Spanish-speaking part of the world?\n\nKnowledge: Armadillos are New World placental mammals in the order Cingulata . . .\n\nThe word \"armadillo\" means \"little armoured one\" in Spanish. · · · The nine-banded armadillo (\"Dasypus novemcinctus\"), or the nine-banded, long-nosed armadillo, is a medium-sized mammal found in North, Central, and South America.\n\nWizard: Yes, they are most commonly found in North, Central, and South America Topic: Ice cream Wizard: I just love ice cream. I love the types with fruits and flavours. Do you like ice cream? Apprentice: I love Ice cream as much as any one. I especially like Gelato, foreign ice cream! Knowledge Ice cream is a sweetened frozen food typically eaten as a snack or dessert.. . .\n\nIt is usually made from dairy products, such as milk and cream, and . . . · · · Bacon ice cream (or bacon-and-egg ice cream) is an ice cream generally created by adding bacon to egg custard and freezing the mixture.\n\nWizard: Me too. There are some strange combinations though, have you heard of bacon ice cream? where they add bacon and even egg custard to the freezing mixture! Apprentice: Surprisingly bacon ice cream doesn't surprise me. That doesn't sound appealing to me, but perhaps it could be delicious. . . Figure 3: The Wizard of Wikipedia dataset. Examples of collected conversations from the dataset, where both wizard and apprentice are humans. The wizard has access to an information retrieval system over Wikipedia, so that they can ask and answer questions, and make statements relevant to the discussion. For each utterance, knowledge retrieval is performed based on dialogue history, giving ∼61 knowledge candidates per turn, with wizards clicking no sentence used 6.2% of the time.\n\n\nA.3 TOPIC SELECTION\n\nTo choose between topics that are natural we employed the existing Persona-Chat dataset (Zhang et al., 2018) where crowdworkers where asked to create personas of typical speakers. There are ∼1000 personas, each of which consists of 4-5 sentences describing that person's interests, e.g. \"I love watching Game of Thrones\", \"I like to eat cheetos\" and \"I recently got a cat\". These can thus naturally be seen as topics of interest, and using another set of annotators we mapped each sentence to 1 or more relevant Wikipedia pages, if possible, e.g. \"Ariel is my favorite princess\" was labeled with the Wikipedia page for The Little Mermaid. As some sentences are harder to connect with Wikipedia, e.g. \"I am witty\", they are left unlabeled. We thus obtain 1,431 topics in total to use for our task. We retain the persona topic sets and thus present 2-3 related topic choices as conversation starters per dialogue during data collection.\n\nB ADDITIONAL EXPERIMENTS B.1 KNOWLEDGE SELECTION Table 6: Test performance of the Knowledge Selection Tasks. We also tested the performance of our models trained to do the full dialogue task (see Section 5.2) on the knowledge selection task. For our retrieval system, this refers to the performance of the knowledge attention. The results show that our retrieval system could be improved, and the auxiliary loss clearly helps the generative models.  Table 7: Retrieval methods on the full Wizard task. In addition to the models we tested in the paper, we also tested a two-stage retrieval system in which we used our best-performing model on the knowledge selection task to choose a single knowledge sentence to condition on for the dialogue retrieval task. This outperformed our best retrieval method in terms of F1 but not not in terms of Recall@1. Furthermore, we compared these results to a two-stage retrieval system in which the dialogue retrieval module is optimized for seeing the gold chosen knowledge sentence. The performance of this system on the gold knowledge task suggests that the retrieval system could be improved by increasing performance on the knowledge selection subtask.  \n\n\nC ERROR ANALYSIS\n\nWe perform an analysis of the dialogues produced from the human evaluation experiments detailed in Section 5.3. We sample 20 conversations from each experimental setting, split between seen and unseen. Conversations are re-tokenized and lowercased to reduce superficial differences between models, and then analyzed in a single-blind setup. We note of common errors and behaviors exhibited in each of the different conversations.\n\nIn general, the human-human conversations are starkly different than any of the bot conversations -humans tend to have more small talk, or use the topic of discussion as a mere icebreaker, with neither human behaving as a wizard. This is in contrast to human-human conversations from the Wizard dataset itself, where one human has access to Wikipedia, and the conversation becomes more grounded in factual sentences. Similarly, all models attempt to play the role of wizard and produce more factual sentences too. In some rounds, humans treat the bot as a sort of question-answer machine, suggesting that the models could be improved by additionally employing SQuAD-like training data.\n\nThe retriever without knowledge is particularly prone to non sequiturs, or rapidly changing the subject. During unseen conversations, it is especially likely to discuss something other than the chosen topic. In contrast, the retriever with knowledge tends to stick to the chosen topic strongly, but has difficulty if the human changes the subject. Frequently in unseen topics, the retriever with knowledge produces similar, but factually inaccurate answers to user queries. For example, when one user asks about parts of Ireland to visit, the model enumerates a list of locations in Greece. Nonetheless, its repertoire of available responses often include inviting responses, allowing the bot to have a more natural conversational flow. Selected conversations with the retriever with knowledge may be found in Figure 4, for both seen and unseen topics.\n\nThe generator without knowledge is particularly prone to many of the typical behaviors of seq2seq systems (Li et al., 2016;Vijayakumar et al., 2016), including local repetition (\"cookies are made of flour, oil, oil, and oil\"), global repetition (producing the near same utterance for multiple turns), or inconsistencies in its personality (saying it both likes and dislikes movies). The generator with knowledge has significantly fewer issues with repetition, as it errs on the side of copying large fragments from the Wikipedia knowledge. The generator with knowledge can also act as a selfish conversationalist, choosing to respond or detail information without inviting a response. Although it generally produces accurate statements, it sometimes produces statements using an incorrect date, name or word. It also frequently produces formulaic responses, like \"I don't know, but I do know that [Wikipedia excerpt]\". Nonetheless, we find the generator with knowledge is able to successfully generalize to unseen topics using the knowledge from Wikipedia. Selected conversations with the generator with knowledge may be found in Figure 5. \n\n\nTopic: Toga party (seen) Model: I love toga parties! I usually make my toga out of a bed sheet and wear my sandals. Human: Me too!!! I usually use some flip flops and my blanket! Model: Toga parties typically have games involving kegs and excessive drinking! Human: Yeah! And getting to wear funny outfits and a crown of leaves! Model: I love me some Toga Parties! Human: I love me some too! Model: Toga parties are so much fun with the Roman or Greek theme. Human: Yeah! I especially like Greek themes\n\nFigure 2 :\n2Selected conversations between humans and models.\n\nFigure 4 :\n4Retriever with Knowledge conversations. Selected conversations with a human. (*) indicates clear factual mistakes by the model.\n\nTable 1 :\n1Dataset statistics of the Wizard of Wikipedia task.Wizard of Wikipedia Task \nTrain \nValid Test Seen Test Unseen \n\nNumber of Utterances \n166,787 17,715 \n8,715 \n8,782 \nNumber of Dialogues \n18,430 \n1,948 \n965 \n968 \nNumber of Topics \n1,247 \n599 \n533 \n58 \nAverage Turns per Dialogue \n9.0 \n9.1 \n9.0 \n9.1 \n\nKnowledge Database \n5.4M articles \n93M sentences \n\n\n\nTable 2 :\n2Test performance of various methods on the Knowledge Selection Task. The models must select the gold knowledge sentences chosen by humans given the dialogue context.Seen Test \nUnseen Test \n\n\n\nTable 3 :\n3Retrieval methods on the full Wizard task. Models must select relevant knowledge and retrieve a response from the training set as a dialogue response. Using knowledge always helps, and the Transformer Memory Network with pretraining performs best.Predicted Knowledge \nGold Knowledge \n\nTest Seen \nTest Unseen \nSeen \nUnseen \n\n\n\nTable 4 :\n4Generative models on the full Wizard Task. The Two-stage model performs best using predicted knowledge, while the End-to-end (E2E) model performs best with gold knowledge.Predicted Knowledge \nGold Knowledge \n\nTest Seen \nTest Unseen \nTest Seen Test Unseen \n\n\n\nTable 5 :\n5Human Experiments. Evaluations of the best generative and retrieval models on full dialogues with humans. Human ratings are reported as mean (stddev). Wiki F1 measures unigram overlap with the Wikipedia entry for the chosen topic, a measure of knowledge used in conversations.Seen \nUnseen \n\n\n\nTable 8 :\n8Human Experiments. We calculate the Wiki F1 score for the wizard and apprentice as they appear in the dataset for the sake of comparison to our human evaluations. Note that this differed from the human-human evaluation set-up in the sense that the wizard had direct access to Wikipedia passages in the UI, which explains the higher values of Wiki F1 both for the wizard (who uses Wikipedia) and for the apprentice (who would likely reference that use).Seen \nUnseen \n\n\nTopic: Dairy farming (unseen) Human: hi there i was wondering how you felt about farming Model: I do not like dairy farming but I do know that in developed countries, dairy farms typically consist of high dairy products. Human: oh yes they have alot of cows and push out alot of dairy every hour Model: other species used in commercial dairy farming include goats, sheep, and camels Human: i did not know you could get milk a camel Model: camel milk has supported bedouin Human: oh wow thats very interesting Model: in italy they are growing in popularity to produce an alternative milk source for humans Human: i have had goat milk before Model: the earliest evidence of using domesticated cows for dairy production is the seventh millennium bc-the neolithic era -Human: thats so neat. i would say cow milk is my favorite Model: I love cow milk, especially since the iphone is used in the iphone. Human: iphone and cow milk Model: the iphone was first released in 2007. Human: oh ok well thanks for the talk have a great day Model: no problem! the iphone was first released in 2007.\nDesigning interactive speech systems: From first ideas to user testing. O Niels, Hans Bernsen, Laila Dybkjaer, Dybkjaer, Springer Science & Business MediaNiels O Bernsen, Hans Dybkjaer, and Laila Dybkjaer. Designing interactive speech systems: From first ideas to user testing. Springer Science & Business Media, 2012.\n\nLearning end-to-end goal-oriented dialog. Antoine Bordes, Y-Lan Boureau, Jason Weston, Proceedings of the International Conference on Learning Representations (ICLR. the International Conference on Learning Representations (ICLRAntoine Bordes, Y-Lan Boureau, and Jason Weston. Learning end-to-end goal-oriented dialog. In Proceedings of the International Conference on Learning Representations (ICLR), 2017.\n\nDaniel Cer, Yinfei Yang, Nan Sheng Yi Kong, Nicole Hua, Rhomni Limtiaco, St, Noah John, Mario Constant, Steve Guajardo-Cespedes, Yuan, arXiv:1803.11175Chris Tar, Yun-Hsuan Sung, Brian Strope, and Ray Kurzweil. Universal sentence encoder. arXiv preprintDaniel Cer, Yinfei Yang, Sheng yi Kong, Nan Hua, Nicole Limtiaco, Rhomni St. John, Noah Con- stant, Mario Guajardo-Cespedes, Steve Yuan, Chris Tar, Yun-Hsuan Sung, Brian Strope, and Ray Kurzweil. Universal sentence encoder. arXiv preprint arXiv:1803.11175, 2018.\n\nReading wikipedia to answer opendomain questions. Danqi Chen, Adam Fisch, Jason Weston, Antoine Bordes, Proceedings of the 55th Annual Meeting of the Association for Computational Linguistics. the 55th Annual Meeting of the Association for Computational LinguisticsAssociation for Computational LinguisticsDanqi Chen, Adam Fisch, Jason Weston, and Antoine Bordes. Reading wikipedia to answer open- domain questions. In Proceedings of the 55th Annual Meeting of the Association for Computa- tional Linguistics, pp. 1870-1879. Association for Computational Linguistics, 2017.\n\nQuAC: Question answering in context. Eunsol Choi, He He, Mohit Iyyer, Mark Yatskar, Wen-Tau Yih, Yejin Choi, Percy Liang, Luke Zettlemoyer, Proceedings of the 2018 Conference on Empirical Methods in Natural Language Processing. the 2018 Conference on Empirical Methods in Natural Language ProcessingBrussels, BelgiumEunsol Choi, He He, Mohit Iyyer, Mark Yatskar, Wen-tau Yih, Yejin Choi, Percy Liang, and Luke Zettlemoyer. QuAC: Question answering in context. In Proceedings of the 2018 Conference on Empirical Methods in Natural Language Processing, Brussels, Belgium, October 2018.\n\nEvaluating prerequisite qualities for learning end-to-end dialog systems. Jesse Dodge, Andreea Gane, Xiang Zhang, Antoine Bordes, Sumit Chopra, Alexander Miller, Arthur Szlam, Jason Weston, Proceedings of the International Conference on Learning Representations (ICLR). the International Conference on Learning Representations (ICLR)Jesse Dodge, Andreea Gane, Xiang Zhang, Antoine Bordes, Sumit Chopra, Alexander Miller, Arthur Szlam, and Jason Weston. Evaluating prerequisite qualities for learning end-to-end dialog sys- tems. In Proceedings of the International Conference on Learning Representations (ICLR), 2016.\n\nFrames: a corpus for adding memory to goal-oriented dialogue systems. Layla El Asri, Hannes Schulz, Shikhar Sharma, Jeremie Zumer, Justin Harris, Emery Fine, Rahul Mehrotra, Kaheer Suleman, Proceedings of the 18th Annual SIGdial Meeting on Discourse and Dialogue. the 18th Annual SIGdial Meeting on Discourse and DialogueSaarbrücken, GermanyAssociation for Computational LinguisticsLayla El Asri, Hannes Schulz, Shikhar Sharma, Jeremie Zumer, Justin Harris, Emery Fine, Rahul Mehrotra, and Kaheer Suleman. Frames: a corpus for adding memory to goal-oriented dialogue systems. In Proceedings of the 18th Annual SIGdial Meeting on Discourse and Dialogue, pp. 207-219, Saarbrücken, Germany, August 2017. Association for Computational Linguistics.\n\nControllable abstractive summarization. Angela Fan, David Grangier, Michael Auli, Proceedings of the 2nd Workshop on Neural Machine Translation and Generation. the 2nd Workshop on Neural Machine Translation and GenerationAssociation for Computational LinguisticsAngela Fan, David Grangier, and Michael Auli. Controllable abstractive summarization. In Proceed- ings of the 2nd Workshop on Neural Machine Translation and Generation, pp. 45-54. Association for Computational Linguistics, 2018.\n\nA knowledge-grounded neural conversation model. Marjan Ghazvininejad, Chris Brockett, Ming-Wei Chang, Bill Dolan, Jianfeng Gao, Wen-Tau Yih, Michel Galley, Proceedings of the Conference on Association for the Advancement of Artificial Intelligence (AAAI). the Conference on Association for the Advancement of Artificial Intelligence (AAAI)Marjan Ghazvininejad, Chris Brockett, Ming-Wei Chang, Bill Dolan, Jianfeng Gao, Wen-tau Yih, and Michel Galley. A knowledge-grounded neural conversation model. In Proceedings of the Conference on Association for the Advancement of Artificial Intelligence (AAAI), 2018.\n\nThe second dialog state tracking challenge. Matthew Henderson, Blaise Thomson, Jason D Williams, Proceedings of the 15th Annual Meeting of the Special Interest Group on Discourse and Dialogue (SIGDIAL). the 15th Annual Meeting of the Special Interest Group on Discourse and Dialogue (SIGDIAL)Matthew Henderson, Blaise Thomson, and Jason D Williams. The second dialog state tracking challenge. In Proceedings of the 15th Annual Meeting of the Special Interest Group on Discourse and Dialogue (SIGDIAL), pp. 263-272, 2014.\n\nA simple, fast diverse decoding algorithm for neural generation. Jiwei Li, Will Monroe, Daniel Jurafsky, arXiv:1611.08562arXiv preprintJiwei Li, Will Monroe, and Daniel Jurafsky. A simple, fast diverse decoding algorithm for neural generation. arXiv preprint arXiv:1611.08562, 2016.\n\nTraining millions of personalized dialogue agents. Pierre-Emmanuel Mazaré, Samuel Humeau, Martin Raison, Antoine Bordes, Proceedings of the 2018 Conference on Empirical Methods in Natural Language Processing. the 2018 Conference on Empirical Methods in Natural Language ProcessingBrussels, BelgiumAssociation for Computational LinguisticsPierre-Emmanuel Mazaré, Samuel Humeau, Martin Raison, and Antoine Bordes. Training millions of personalized dialogue agents. In Proceedings of the 2018 Conference on Empirical Methods in Natural Language Processing, Brussels, Belgium, October 2018. Association for Computational Linguistics.\n\nExtending neural generative conversational model using external knowledge sources. Prasanna Parthasarathi, Joelle Pineau, Proceedings of the 2018 Conference on Empirical Methods in Natural Language Processing. the 2018 Conference on Empirical Methods in Natural Language ProcessingBrussels, BelgiumPrasanna Parthasarathi and Joelle Pineau. Extending neural generative conversational model using external knowledge sources. In Proceedings of the 2018 Conference on Empirical Methods in Natural Language Processing, Brussels, Belgium, October 2018.\n\nSQuAD: 100,000+ questions for machine comprehension of text. Pranav Rajpurkar, Jian Zhang, Konstantin Lopyrev, Percy Liang, Proceedings of the 2016 Conference on Empirical Methods in Natural Language Processing. the 2016 Conference on Empirical Methods in Natural Language ProcessingAustin, TexasAssociation for Computational LinguisticsPranav Rajpurkar, Jian Zhang, Konstantin Lopyrev, and Percy Liang. SQuAD: 100,000+ questions for machine comprehension of text. In Proceedings of the 2016 Conference on Empirical Methods in Natural Language Processing, pp. 2383-2392, Austin, Texas, November 2016. Association for Computational Linguistics.\n\nNeural machine translation of rare words with subword units. Rico Sennrich, Barry Haddow, Alexandra Birch, Proceedings of the 54th Annual Meeting of the Association for Computational Linguistics. the 54th Annual Meeting of the Association for Computational LinguisticsBerlin, GermanyAssociation for Computational LinguisticsRico Sennrich, Barry Haddow, and Alexandra Birch. Neural machine translation of rare words with subword units. In Proceedings of the 54th Annual Meeting of the Association for Computational Linguistics, pp. 1715-1725, Berlin, Germany, August 2016. Association for Computational Lin- guistics.\n\nIulian Vlad Serban, Ryan Lowe, Laurent Charlin, Joelle Pineau, arXiv:1611.06216Generative deep neural networks for dialogue: A short review. arXiv preprintIulian Vlad Serban, Ryan Lowe, Laurent Charlin, and Joelle Pineau. Generative deep neural net- works for dialogue: A short review. arXiv preprint arXiv:1611.06216, 2016.\n\nA neural network approach to context-sensitive generation of conversational responses. Alessandro Sordoni, Michel Galley, Michael Auli, Chris Brockett, Yangfeng Ji, Margaret Mitchell, Jian-Yun Nie, Jianfeng Gao, Bill Dolan, arXiv:1506.06714arXiv preprintAlessandro Sordoni, Michel Galley, Michael Auli, Chris Brockett, Yangfeng Ji, Margaret Mitchell, Jian-Yun Nie, Jianfeng Gao, and Bill Dolan. A neural network approach to context-sensitive generation of conversational responses. arXiv preprint arXiv:1506.06714, 2015.\n\nEnd-to-end memory networks. Sainbayar Sukhbaatar, Jason Weston, Rob Fergus, Advances in Neural Information Processing Systems. Sainbayar Sukhbaatar, Jason Weston, Rob Fergus, et al. End-to-end memory networks. In Advances in Neural Information Processing Systems, pp. 2440-2448, 2015.\n\nSequence to sequence learning with neural networks. Ilya Sutskever, Oriol Vinyals, Quoc V Le, Advances in Neural Information Processing Systems. Ilya Sutskever, Oriol Vinyals, and Quoc V Le. Sequence to sequence learning with neural networks. In Advances in Neural Information Processing Systems, pp. 3104-3112, 2014.\n\nAttention is all you need. Ashish Vaswani, Noam Shazeer, Niki Parmar, Jakob Uszkoreit, Llion Jones, Aidan N Gomez, Łukasz Kaiser, Illia Polosukhin, Advances in Neural Information Processing Systems. Ashish Vaswani, Noam Shazeer, Niki Parmar, Jakob Uszkoreit, Llion Jones, Aidan N Gomez, Łukasz Kaiser, and Illia Polosukhin. Attention is all you need. In Advances in Neural Infor- mation Processing Systems, pp. 5998-6008, 2017.\n\nDiverse beam search: Decoding diverse solutions from neural sequence models. K Ashwin, Michael Vijayakumar, Ramprasaath R Cogswell, Qing Selvaraju, Stefan Sun, David J Lee, Dhruv Crandall, Batra, arXiv:1610.02424arXiv preprintAshwin K. Vijayakumar, Michael Cogswell, Ramprasaath R. Selvaraju, Qing Sun, Stefan Lee, David J. Crandall, and Dhruv Batra. Diverse beam search: Decoding diverse solutions from neural sequence models. arXiv preprint arXiv:1610.02424, 2016.\n\nA neural conversational model. Oriol Vinyals, Quoc Le, Proceedings of the 31st International Conference on Machine Learning, Deep Learning Workshop. the 31st International Conference on Machine Learning, Deep Learning WorkshopLille, FranceOriol Vinyals and Quoc Le. A neural conversational model. In Proceedings of the 31st International Conference on Machine Learning, Deep Learning Workshop, Lille, France, 2015.\n\nPersonalizing dialogue agents: I have a dog, do you have pets too?. Saizheng Zhang, Emily Dinan, Jack Urbanek, Arthur Szlam, Douwe Kiela, Jason Weston, Proceedings of the 56th Annual Meeting of the Association for Computational Linguistics. the 56th Annual Meeting of the Association for Computational LinguisticsMelbourne, AustraliaAssociation for Computational LinguisticsSaizheng Zhang, Emily Dinan, Jack Urbanek, Arthur Szlam, Douwe Kiela, and Jason Weston. Per- sonalizing dialogue agents: I have a dog, do you have pets too? In Proceedings of the 56th Annual Meeting of the Association for Computational Linguistics, pp. 2204-2213, Melbourne, Australia, July 2018. Association for Computational Linguistics.\n\nHuman: I had no idea that that was a National Park. I have heard Zion National Park is really nice! Model: Yes, it links the shenandoah national park and the great smoky mountains together! (*) Model: Two-Stage Generative Transformer MemNet Topic: Circus (seen) Model: have you ever been to a circus? it is a company of performers who put on diverse entertainment shows. Human: I went to the circus once when I was a child actually. Model: that's great! entertainment is a form of activity that holds the attention and interest of an audience. Human: That's true. Have you ever been to a circus? Model: I have not, but I know they were built with various types of seating ring, and sometimes a stage. Human: I went to one held in a stadium, so we had box seats. Model: that's awesome! i'm sure you'll have to go to the circus, with appropriate music. Human: Yes, circuses usually have their own kind of music. Model: circuses can be done by circuses. Topic: Granny Smith (seen) Human: I really love Granny Smith apples, they're my favorite type of apple. Model: I love granny smith apples. they have hard, light green skin and a crisp flesh. Human: Yes, I really enjoy them. I also like Honeycrisp apples but they're so expensive! Model: they've been grown for thousands of years in asia and europe, and were brought to north america by european colonists (*) Human: Oh really? They've been around way longer than I thought! Model: they're also consumed raw, it's one of the most popular cooking apples. Human: I always eat them raw, I hate cooked apples for some reason, even in pie. Model: i'm not sure if it's cooked, but I do know that they can be cooked raw. Topic: Culture of Chicago (seen) Human: hi do you like chicago Model: I love chicago. it's the third most populous city in the us. Human: how many people live there? Model: about 2. 7 million residents, it is also the most populous city in the state of illinois. Human: do you like chicago deep dish pizza? Model: chicago-style pizza may be made in deep dish style and as a stuffed pizza. Human: what is the name of the baseball team? Model: dano's pizzeria specializes in chicago style stuffed pizza. Human: Is Dano's pizzaria open everyday? Model: yes it is. it is an american style pizza chain headquartered in midtown brook, illinois. Topic: Animals in sport (unseen) Model: i love to watch animals. it's the most popular form of animal-related sport. Human: horse racing is the most awesome animal sport! Model: horse racing is an equestrian performance sport. Hao Zhou, Tom Young, Minlie Huang, Haizhou Zhao, Jingfang Xu, Xiaoyan Zhu, International Joint Conferences on Artificial Intelligence Organization, 7 2018. Model: Retrieval Transformer MemNet Topic: Arnold Schwarzenegger (seen) Human: Hey are you into the movie The Running Man Model: Yeah! That's one of my favorite movies! I can't believe that Team America: World Police was made in 2004 -14 years ago! Human: Another one of Arnies movies I like is Terminator 2 JUDGMENT DAY Model: The Terminator is probably his most iconic role, but he got his start from the movie. Human: I've always found Ireland to be fascinating and would love to visit sometime Model: Same here! It is the capital of Ireland too! Human: What is the most popular place to visit in Ireland? Model: I would recommend the Thrace, Crete, and the Ionian Islands as must see places. (*) Human: I don't know anything about the Ionian Islands Model: It was once referred to as the Hellenic Republic! (*) Topic: American football (unseen) Model: American football can be traced back to Britain in the mid-19th century. The rules were very similar! Human: I did not know that. Did they wear equipment back then? Model: Am not really certain about it but American football resulted from several major divergences from association football and rugby football Human: The Philadelphia eagles actually have a rugby player on their team this year. he never played football until this year. Model: Philadelphia is one of a few cities to have all four teams, but they love the Eagles more than anything else by a long shot! Human: As a life long Philadelphia sports fan I have to agree with you. Model: I've always been more of a fan of the American Football team from Pittsburgh, The Steelers! Human: Being from Philadelphia I am not much of a pittsburgh fan. typically involving two or more horses ridden by jockeys or driven over a set distance for competition. Human: yes, the Kentucky Derby and the triple crown is something I look forward to every year! Model: the horse has evolved over the past 45 to 55 million years from a small multi toed creature Human: that is very interesting, how did people come to domesticate horses for sport? Model: i'm not sure but the domestication is believed to have been widespread by 3000 bc Human: very interesting! I wonder how long people used horses to hunt before deciding to race them. Model: i'm not sure but I do know that horses have been domesticated for thousands of yearsHao Zhou, Tom Young, Minlie Huang, Haizhou Zhao, Jingfang Xu, and Xiaoyan Zhu. Com- monsense knowledge aware conversation generation with graph attention. In Proceedings of the Twenty-Seventh International Joint Conference on Artificial Intelligence (IJCAI), pp. 4623-4629. International Joint Conferences on Artificial Intelligence Organization, 7 2018. Model: Retrieval Transformer MemNet Topic: Arnold Schwarzenegger (seen) Human: Hey are you into the movie The Running Man Model: Yeah! That's one of my favorite movies! I can't believe that Team America: World Police was made in 2004 -14 years ago! Human: Another one of Arnies movies I like is Terminator 2 JUDGMENT DAY Model: The Terminator is probably his most iconic role, but he got his start from the movie \"Conan the Barbarian\", which came out a couple years earlier. I actually haven't seen that one. Human: Which one? Conan or \"Da Terminata\" Model: I like Arnold Schwarzeneggar as well! I thought he was a fantastic governator, serving from 2003-2011. Human: HAha Governator! Yeah, it's pretty crazy they he held higher office. Model: Yes, he won the LIFETIME ACHIEVEMENT AWARD! Interestingly, he joined the U.S. Army in 1961 and was a paratrooper! (*) Topic: Steak (seen) Human: Hello, it's lunch time here, and I'm in the mood for a great steak Model: Wow that sounds delicious I wish I could say the same hahah, When the word \"steak\" is used without qualification, it normally refers to a Beefsteak Human: Interesting, I don't really have a favorite steak, how about you? Model: I like rib eye it is really good specially medium rare, When the word \"steak\" is used without qualification, it generally refers to a beefsteak Human: I like rib eye too! What is it about a rib eye that you enjoy? Model: Most steak cuts are very tender meat but I think rib eye can be quite tender Human: They really are. How do you choose a good steak? Model: When it comes to steak and other cuts of meat you have rare, medium rare, medium, well done and so on Human: How do you prefer your steak prepared? Model: I like that you can prepare it many different ways. You can fried it, grill it, or even broil the steak Topic: Ireland (unseen) Model: Hi, have you ever been to Dublin? It is the capital and largest city in Ireland. Human: No, I haven't but would love to Model: It is the largest city in Northern Ireland. Human: I've always found Ireland to be fascinating and would love to visit sometime Model: Same here! It is the capital of Ireland too! Human: What is the most popular place to visit in Ireland? Model: I would recommend the Thrace, Crete, and the Ionian Islands as must see places. (*) Human: I don't know anything about the Ionian Islands Model: It was once referred to as the Hellenic Republic! (*) Topic: American football (unseen) Model: American football can be traced back to Britain in the mid-19th century. The rules were very similar! Human: I did not know that. Did they wear equipment back then? Model: Am not really certain about it but American football resulted from several major divergences from associa- tion football and rugby football Human: The Philadelphia eagles actually have a rugby player on their team this year. he never played football until this year. Model: Philadelphia is one of a few cities to have all four teams, but they love the Eagles more than anything else by a long shot! Human: As a life long Philadelphia sports fan I have to agree with you. Model: I've always been more of a fan of the American Football team from Pittsburgh, The Steelers! Human: Being from Philadelphia I am not much of a pittsburgh fan. Model: Are the Pittsburgh Steelers in the AFC? Human: Yes they are. the AFC north to be exact. Topic: List of national parks of the United States (unseen) Human: I have never visited a national park in the United States, but I would really like to! Model: Me too. I'd love to live in a national park Human: Which one do you think is the best to visit first? Model: The United Nations is an important place to visit, the Statue of Liberty, Central park is great also Human: Is the Statue of Liberty considered a National Park? Model: Yes, the statue of Liberty is there on an island -The Liberty Island. Human: I had no idea that that was a National Park. I have heard Zion National Park is really nice! Model: Yes, it links the shenandoah national park and the great smoky mountains together! (*) Model: Two-Stage Generative Transformer MemNet Topic: Circus (seen) Model: have you ever been to a circus? it is a company of performers who put on diverse entertainment shows. Human: I went to the circus once when I was a child actually. Model: that's great! entertainment is a form of activity that holds the attention and interest of an audience. Human: That's true. Have you ever been to a circus? Model: I have not, but I know they were built with various types of seating ring, and sometimes a stage. Human: I went to one held in a stadium, so we had box seats. Model: that's awesome! i'm sure you'll have to go to the circus, with appropriate music. Human: Yes, circuses usually have their own kind of music. Model: circuses can be done by circuses. Topic: Granny Smith (seen) Human: I really love Granny Smith apples, they're my favorite type of apple. Model: I love granny smith apples. they have hard, light green skin and a crisp flesh. Human: Yes, I really enjoy them. I also like Honeycrisp apples but they're so expensive! Model: they've been grown for thousands of years in asia and europe, and were brought to north america by euro- pean colonists (*) Human: Oh really? They've been around way longer than I thought! Model: they're also consumed raw, it's one of the most popular cooking apples. Human: I always eat them raw, I hate cooked apples for some reason, even in pie. Model: i'm not sure if it's cooked, but I do know that they can be cooked raw. Topic: Culture of Chicago (seen) Human: hi do you like chicago Model: I love chicago. it's the third most populous city in the us. Human: how many people live there? Model: about 2. 7 million residents, it is also the most populous city in the state of illinois. Human: do you like chicago deep dish pizza? Model: chicago-style pizza may be made in deep dish style and as a stuffed pizza. Human: what is the name of the baseball team? Model: dano's pizzeria specializes in chicago style stuffed pizza. Human: Is Dano's pizzaria open everyday? Model: yes it is. it is an american style pizza chain headquartered in midtown brook, illinois. Topic: Animals in sport (unseen) Model: i love to watch animals. it's the most popular form of animal-related sport. Human: horse racing is the most awesome animal sport! Model: horse racing is an equestrian performance sport, typically involving two or more horses ridden by jockeys or driven over a set distance for competition. Human: yes, the Kentucky Derby and the triple crown is something I look forward to every year! Model: the horse has evolved over the past 45 to 55 million years from a small multi toed creature Human: that is very interesting, how did people come to domesticate horses for sport? Model: i'm not sure but the domestication is believed to have been widespread by 3000 bc Human: very interesting! I wonder how long people used horses to hunt before deciding to race them. Model: i'm not sure but I do know that horses have been domesticated for thousands of years.\n", "annotations": {"author": "[{\"end\":106,\"start\":57},{\"end\":159,\"start\":107},{\"end\":212,\"start\":160},{\"end\":264,\"start\":213},{\"end\":320,\"start\":265},{\"end\":357,\"start\":321}]", "publisher": null, "author_last_name": "[{\"end\":68,\"start\":63},{\"end\":121,\"start\":115},{\"end\":172,\"start\":165},{\"end\":223,\"start\":220},{\"end\":277,\"start\":273},{\"end\":333,\"start\":327}]", "author_first_name": "[{\"end\":62,\"start\":57},{\"end\":114,\"start\":107},{\"end\":164,\"start\":160},{\"end\":219,\"start\":213},{\"end\":272,\"start\":265},{\"end\":326,\"start\":321}]", "author_affiliation": "[{\"end\":105,\"start\":84},{\"end\":158,\"start\":137},{\"end\":211,\"start\":190},{\"end\":263,\"start\":242},{\"end\":319,\"start\":298},{\"end\":356,\"start\":335}]", "title": "[{\"end\":54,\"start\":1},{\"end\":411,\"start\":358}]", "venue": null, "abstract": "[{\"end\":1534,\"start\":413}]", "bib_ref": "[{\"attributes\":{\"ref_id\":\"b18\"},\"end\":2157,\"start\":2133},{\"attributes\":{\"ref_id\":\"b21\"},\"end\":2176,\"start\":2157},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":2196,\"start\":2176},{\"attributes\":{\"ref_id\":\"b19\"},\"end\":2217,\"start\":2196},{\"attributes\":{\"ref_id\":\"b17\"},\"end\":3408,\"start\":3383},{\"attributes\":{\"ref_id\":\"b19\"},\"end\":3513,\"start\":3491},{\"attributes\":{\"ref_id\":\"b21\"},\"end\":5023,\"start\":5003},{\"attributes\":{\"ref_id\":\"b22\"},\"end\":5058,\"start\":5038},{\"attributes\":{\"ref_id\":\"b16\"},\"end\":5093,\"start\":5071},{\"attributes\":{\"ref_id\":\"b6\"},\"end\":5433,\"start\":5411},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":5480,\"start\":5456},{\"attributes\":{\"ref_id\":\"b13\"},\"end\":6093,\"start\":6069},{\"attributes\":{\"ref_id\":\"b3\"},\"end\":6255,\"start\":6236},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":6400,\"start\":6381},{\"attributes\":{\"ref_id\":\"b5\"},\"end\":6694,\"start\":6675},{\"end\":6887,\"start\":6869},{\"attributes\":{\"ref_id\":\"b8\"},\"end\":6963,\"start\":6936},{\"attributes\":{\"ref_id\":\"b12\"},\"end\":6997,\"start\":6968},{\"attributes\":{\"ref_id\":\"b8\"},\"end\":7243,\"start\":7216},{\"attributes\":{\"ref_id\":\"b12\"},\"end\":7412,\"start\":7383},{\"attributes\":{\"ref_id\":\"b17\"},\"end\":7545,\"start\":7520},{\"attributes\":{\"ref_id\":\"b19\"},\"end\":7656,\"start\":7634},{\"attributes\":{\"ref_id\":\"b0\"},\"end\":10402,\"start\":10380},{\"attributes\":{\"ref_id\":\"b3\"},\"end\":11084,\"start\":11066},{\"attributes\":{\"ref_id\":\"b17\"},\"end\":12591,\"start\":12566},{\"attributes\":{\"ref_id\":\"b19\"},\"end\":12630,\"start\":12608},{\"attributes\":{\"ref_id\":\"b19\"},\"end\":15139,\"start\":15117},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":17295,\"start\":17272},{\"attributes\":{\"ref_id\":\"b7\"},\"end\":17407,\"start\":17389},{\"attributes\":{\"ref_id\":\"b2\"},\"end\":17626,\"start\":17609},{\"attributes\":{\"ref_id\":\"b17\"},\"end\":19614,\"start\":19589},{\"attributes\":{\"ref_id\":\"b11\"},\"end\":19695,\"start\":19674},{\"attributes\":{\"ref_id\":\"b22\"},\"end\":29866,\"start\":29846},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":34005,\"start\":33988},{\"attributes\":{\"ref_id\":\"b20\"},\"end\":34030,\"start\":34005}]", "figure": "[{\"attributes\":{\"id\":\"fig_0\"},\"end\":35527,\"start\":35023},{\"attributes\":{\"id\":\"fig_1\"},\"end\":35590,\"start\":35528},{\"attributes\":{\"id\":\"fig_3\"},\"end\":35731,\"start\":35591},{\"attributes\":{\"id\":\"tab_1\",\"type\":\"table\"},\"end\":36095,\"start\":35732},{\"attributes\":{\"id\":\"tab_3\",\"type\":\"table\"},\"end\":36298,\"start\":36096},{\"attributes\":{\"id\":\"tab_4\",\"type\":\"table\"},\"end\":36635,\"start\":36299},{\"attributes\":{\"id\":\"tab_5\",\"type\":\"table\"},\"end\":36905,\"start\":36636},{\"attributes\":{\"id\":\"tab_6\",\"type\":\"table\"},\"end\":37209,\"start\":36906},{\"attributes\":{\"id\":\"tab_9\",\"type\":\"table\"},\"end\":37689,\"start\":37210}]", "paragraph": "[{\"end\":2788,\"start\":1550},{\"end\":3649,\"start\":2790},{\"end\":4363,\"start\":3651},{\"end\":4848,\"start\":4365},{\"end\":5317,\"start\":4865},{\"end\":5726,\"start\":5319},{\"end\":6564,\"start\":5728},{\"end\":7849,\"start\":6566},{\"end\":8295,\"start\":7873},{\"end\":8748,\"start\":8297},{\"end\":9537,\"start\":8750},{\"end\":9616,\"start\":9559},{\"end\":9777,\"start\":9618},{\"end\":9957,\"start\":9779},{\"end\":10047,\"start\":9959},{\"end\":10134,\"start\":10049},{\"end\":10403,\"start\":10136},{\"end\":10641,\"start\":10405},{\"end\":11681,\"start\":10643},{\"end\":12234,\"start\":11683},{\"end\":12949,\"start\":12270},{\"end\":13212,\"start\":12951},{\"end\":13589,\"start\":13214},{\"end\":14017,\"start\":13591},{\"end\":14869,\"start\":14019},{\"end\":15310,\"start\":14893},{\"end\":15504,\"start\":15312},{\"end\":15976,\"start\":15506},{\"end\":16534,\"start\":16017},{\"end\":16822,\"start\":16665},{\"end\":17408,\"start\":16864},{\"end\":18247,\"start\":17410},{\"end\":18876,\"start\":18282},{\"end\":19092,\"start\":18892},{\"end\":20106,\"start\":19121},{\"end\":20425,\"start\":20145},{\"end\":21426,\"start\":20451},{\"end\":22479,\"start\":21428},{\"end\":23348,\"start\":22500},{\"end\":24018,\"start\":23350},{\"end\":24183,\"start\":24069},{\"end\":25126,\"start\":24185},{\"end\":25709,\"start\":25128},{\"end\":25976,\"start\":25711},{\"end\":27107,\"start\":25991},{\"end\":27321,\"start\":27109},{\"end\":27560,\"start\":27323},{\"end\":28038,\"start\":27562},{\"end\":28122,\"start\":28040},{\"end\":28353,\"start\":28124},{\"end\":28732,\"start\":28355},{\"end\":28949,\"start\":28734},{\"end\":29734,\"start\":28951},{\"end\":30692,\"start\":29758},{\"end\":31889,\"start\":30694},{\"end\":32339,\"start\":31910},{\"end\":33026,\"start\":32341},{\"end\":33880,\"start\":33028},{\"end\":35022,\"start\":33882}]", "formula": "[{\"attributes\":{\"id\":\"formula_0\"},\"end\":16664,\"start\":16535},{\"attributes\":{\"id\":\"formula_1\"},\"end\":18281,\"start\":18248}]", "table_ref": "[{\"attributes\":{\"ref_id\":\"tab_3\"},\"end\":19758,\"start\":19751},{\"attributes\":{\"ref_id\":\"tab_4\"},\"end\":20801,\"start\":20794},{\"attributes\":{\"ref_id\":\"tab_5\"},\"end\":21460,\"start\":21453},{\"attributes\":{\"ref_id\":\"tab_4\"},\"end\":22478,\"start\":22471},{\"attributes\":{\"ref_id\":\"tab_6\"},\"end\":23347,\"start\":23340},{\"attributes\":{\"ref_id\":\"tab_6\"},\"end\":25826,\"start\":25819},{\"end\":30750,\"start\":30743},{\"end\":31151,\"start\":31144}]", "section_header": "[{\"attributes\":{\"n\":\"1\"},\"end\":1548,\"start\":1536},{\"attributes\":{\"n\":\"2\"},\"end\":4863,\"start\":4851},{\"attributes\":{\"n\":\"3\"},\"end\":7871,\"start\":7852},{\"end\":9557,\"start\":9540},{\"end\":12259,\"start\":12237},{\"attributes\":{\"n\":\"4\"},\"end\":12268,\"start\":12262},{\"end\":14891,\"start\":14872},{\"attributes\":{\"n\":\"4.1\"},\"end\":16015,\"start\":15979},{\"attributes\":{\"n\":\"4.2\"},\"end\":16862,\"start\":16825},{\"attributes\":{\"n\":\"5\"},\"end\":18890,\"start\":18879},{\"attributes\":{\"n\":\"5.1\"},\"end\":19119,\"start\":19095},{\"attributes\":{\"n\":\"5.2\"},\"end\":20143,\"start\":20109},{\"end\":20449,\"start\":20428},{\"attributes\":{\"n\":\"5.3\"},\"end\":22498,\"start\":22482},{\"end\":24067,\"start\":24021},{\"attributes\":{\"n\":\"6\"},\"end\":25989,\"start\":25979},{\"end\":29756,\"start\":29737},{\"end\":31908,\"start\":31892},{\"end\":35539,\"start\":35529},{\"end\":35602,\"start\":35592},{\"end\":35742,\"start\":35733},{\"end\":36106,\"start\":36097},{\"end\":36309,\"start\":36300},{\"end\":36646,\"start\":36637},{\"end\":36916,\"start\":36907},{\"end\":37220,\"start\":37211}]", "table": "[{\"end\":36095,\"start\":35795},{\"end\":36298,\"start\":36273},{\"end\":36635,\"start\":36558},{\"end\":36905,\"start\":36819},{\"end\":37209,\"start\":37194},{\"end\":37689,\"start\":37674}]", "figure_caption": "[{\"end\":35527,\"start\":35025},{\"end\":35590,\"start\":35541},{\"end\":35731,\"start\":35604},{\"end\":35795,\"start\":35744},{\"end\":36273,\"start\":36108},{\"end\":36558,\"start\":36311},{\"end\":36819,\"start\":36648},{\"end\":37194,\"start\":36918},{\"end\":37674,\"start\":37222}]", "figure_ref": "[{\"end\":15717,\"start\":15709},{\"end\":17904,\"start\":17896},{\"attributes\":{\"ref_id\":\"fig_1\"},\"end\":25837,\"start\":25829},{\"end\":29258,\"start\":29250},{\"attributes\":{\"ref_id\":\"fig_3\"},\"end\":33846,\"start\":33838},{\"end\":35020,\"start\":35012}]", "bib_author_first_name": "[{\"end\":38847,\"start\":38846},{\"end\":38859,\"start\":38855},{\"end\":38874,\"start\":38869},{\"end\":39143,\"start\":39136},{\"end\":39157,\"start\":39152},{\"end\":39172,\"start\":39167},{\"end\":39509,\"start\":39503},{\"end\":39521,\"start\":39515},{\"end\":39531,\"start\":39528},{\"end\":39553,\"start\":39547},{\"end\":39565,\"start\":39559},{\"end\":39584,\"start\":39580},{\"end\":39596,\"start\":39591},{\"end\":39612,\"start\":39607},{\"end\":40074,\"start\":40069},{\"end\":40085,\"start\":40081},{\"end\":40098,\"start\":40093},{\"end\":40114,\"start\":40107},{\"end\":40637,\"start\":40631},{\"end\":40646,\"start\":40644},{\"end\":40656,\"start\":40651},{\"end\":40668,\"start\":40664},{\"end\":40685,\"start\":40678},{\"end\":40696,\"start\":40691},{\"end\":40708,\"start\":40703},{\"end\":40720,\"start\":40716},{\"end\":41258,\"start\":41253},{\"end\":41273,\"start\":41266},{\"end\":41285,\"start\":41280},{\"end\":41300,\"start\":41293},{\"end\":41314,\"start\":41309},{\"end\":41332,\"start\":41323},{\"end\":41347,\"start\":41341},{\"end\":41360,\"start\":41355},{\"end\":41873,\"start\":41868},{\"end\":41876,\"start\":41874},{\"end\":41889,\"start\":41883},{\"end\":41905,\"start\":41898},{\"end\":41921,\"start\":41914},{\"end\":41935,\"start\":41929},{\"end\":41949,\"start\":41944},{\"end\":41961,\"start\":41956},{\"end\":41978,\"start\":41972},{\"end\":42589,\"start\":42583},{\"end\":42600,\"start\":42595},{\"end\":42618,\"start\":42611},{\"end\":43089,\"start\":43083},{\"end\":43110,\"start\":43105},{\"end\":43129,\"start\":43121},{\"end\":43141,\"start\":43137},{\"end\":43157,\"start\":43149},{\"end\":43170,\"start\":43163},{\"end\":43182,\"start\":43176},{\"end\":43695,\"start\":43688},{\"end\":43713,\"start\":43707},{\"end\":43728,\"start\":43723},{\"end\":43730,\"start\":43729},{\"end\":44236,\"start\":44231},{\"end\":44245,\"start\":44241},{\"end\":44260,\"start\":44254},{\"end\":44516,\"start\":44501},{\"end\":44531,\"start\":44525},{\"end\":44546,\"start\":44540},{\"end\":44562,\"start\":44555},{\"end\":45172,\"start\":45164},{\"end\":45194,\"start\":45188},{\"end\":45696,\"start\":45690},{\"end\":45712,\"start\":45708},{\"end\":45730,\"start\":45720},{\"end\":45745,\"start\":45740},{\"end\":46339,\"start\":46335},{\"end\":46355,\"start\":46350},{\"end\":46373,\"start\":46364},{\"end\":46898,\"start\":46892},{\"end\":46916,\"start\":46912},{\"end\":46930,\"start\":46923},{\"end\":46946,\"start\":46940},{\"end\":47315,\"start\":47305},{\"end\":47331,\"start\":47325},{\"end\":47347,\"start\":47340},{\"end\":47359,\"start\":47354},{\"end\":47378,\"start\":47370},{\"end\":47391,\"start\":47383},{\"end\":47410,\"start\":47402},{\"end\":47424,\"start\":47416},{\"end\":47434,\"start\":47430},{\"end\":47777,\"start\":47768},{\"end\":47795,\"start\":47790},{\"end\":47807,\"start\":47804},{\"end\":48082,\"start\":48078},{\"end\":48099,\"start\":48094},{\"end\":48115,\"start\":48109},{\"end\":48378,\"start\":48372},{\"end\":48392,\"start\":48388},{\"end\":48406,\"start\":48402},{\"end\":48420,\"start\":48415},{\"end\":48437,\"start\":48432},{\"end\":48450,\"start\":48445},{\"end\":48452,\"start\":48451},{\"end\":48466,\"start\":48460},{\"end\":48480,\"start\":48475},{\"end\":48852,\"start\":48851},{\"end\":48868,\"start\":48861},{\"end\":48893,\"start\":48882},{\"end\":48895,\"start\":48894},{\"end\":48910,\"start\":48906},{\"end\":48928,\"start\":48922},{\"end\":48939,\"start\":48934},{\"end\":48941,\"start\":48940},{\"end\":48952,\"start\":48947},{\"end\":49278,\"start\":49273},{\"end\":49292,\"start\":49288},{\"end\":49734,\"start\":49726},{\"end\":49747,\"start\":49742},{\"end\":49759,\"start\":49755},{\"end\":49775,\"start\":49769},{\"end\":49788,\"start\":49783},{\"end\":49801,\"start\":49796},{\"end\":52906,\"start\":52903},{\"end\":52916,\"start\":52913},{\"end\":52930,\"start\":52924},{\"end\":52945,\"start\":52938},{\"end\":52960,\"start\":52952},{\"end\":52972,\"start\":52965}]", "bib_author_last_name": "[{\"end\":38853,\"start\":38848},{\"end\":38867,\"start\":38860},{\"end\":38883,\"start\":38875},{\"end\":38893,\"start\":38885},{\"end\":39150,\"start\":39144},{\"end\":39165,\"start\":39158},{\"end\":39179,\"start\":39173},{\"end\":39513,\"start\":39510},{\"end\":39526,\"start\":39522},{\"end\":39545,\"start\":39532},{\"end\":39557,\"start\":39554},{\"end\":39574,\"start\":39566},{\"end\":39578,\"start\":39576},{\"end\":39589,\"start\":39585},{\"end\":39605,\"start\":39597},{\"end\":39630,\"start\":39613},{\"end\":39636,\"start\":39632},{\"end\":40079,\"start\":40075},{\"end\":40091,\"start\":40086},{\"end\":40105,\"start\":40099},{\"end\":40121,\"start\":40115},{\"end\":40642,\"start\":40638},{\"end\":40649,\"start\":40647},{\"end\":40662,\"start\":40657},{\"end\":40676,\"start\":40669},{\"end\":40689,\"start\":40686},{\"end\":40701,\"start\":40697},{\"end\":40714,\"start\":40709},{\"end\":40732,\"start\":40721},{\"end\":41264,\"start\":41259},{\"end\":41278,\"start\":41274},{\"end\":41291,\"start\":41286},{\"end\":41307,\"start\":41301},{\"end\":41321,\"start\":41315},{\"end\":41339,\"start\":41333},{\"end\":41353,\"start\":41348},{\"end\":41367,\"start\":41361},{\"end\":41881,\"start\":41877},{\"end\":41896,\"start\":41890},{\"end\":41912,\"start\":41906},{\"end\":41927,\"start\":41922},{\"end\":41942,\"start\":41936},{\"end\":41954,\"start\":41950},{\"end\":41970,\"start\":41962},{\"end\":41986,\"start\":41979},{\"end\":42593,\"start\":42590},{\"end\":42609,\"start\":42601},{\"end\":42623,\"start\":42619},{\"end\":43103,\"start\":43090},{\"end\":43119,\"start\":43111},{\"end\":43135,\"start\":43130},{\"end\":43147,\"start\":43142},{\"end\":43161,\"start\":43158},{\"end\":43174,\"start\":43171},{\"end\":43189,\"start\":43183},{\"end\":43705,\"start\":43696},{\"end\":43721,\"start\":43714},{\"end\":43739,\"start\":43731},{\"end\":44239,\"start\":44237},{\"end\":44252,\"start\":44246},{\"end\":44269,\"start\":44261},{\"end\":44523,\"start\":44517},{\"end\":44538,\"start\":44532},{\"end\":44553,\"start\":44547},{\"end\":44569,\"start\":44563},{\"end\":45186,\"start\":45173},{\"end\":45201,\"start\":45195},{\"end\":45706,\"start\":45697},{\"end\":45718,\"start\":45713},{\"end\":45738,\"start\":45731},{\"end\":45751,\"start\":45746},{\"end\":46348,\"start\":46340},{\"end\":46362,\"start\":46356},{\"end\":46379,\"start\":46374},{\"end\":46910,\"start\":46899},{\"end\":46921,\"start\":46917},{\"end\":46938,\"start\":46931},{\"end\":46953,\"start\":46947},{\"end\":47323,\"start\":47316},{\"end\":47338,\"start\":47332},{\"end\":47352,\"start\":47348},{\"end\":47368,\"start\":47360},{\"end\":47381,\"start\":47379},{\"end\":47400,\"start\":47392},{\"end\":47414,\"start\":47411},{\"end\":47428,\"start\":47425},{\"end\":47440,\"start\":47435},{\"end\":47788,\"start\":47778},{\"end\":47802,\"start\":47796},{\"end\":47814,\"start\":47808},{\"end\":48092,\"start\":48083},{\"end\":48107,\"start\":48100},{\"end\":48118,\"start\":48116},{\"end\":48386,\"start\":48379},{\"end\":48400,\"start\":48393},{\"end\":48413,\"start\":48407},{\"end\":48430,\"start\":48421},{\"end\":48443,\"start\":48438},{\"end\":48458,\"start\":48453},{\"end\":48473,\"start\":48467},{\"end\":48491,\"start\":48481},{\"end\":48859,\"start\":48853},{\"end\":48880,\"start\":48869},{\"end\":48904,\"start\":48896},{\"end\":48920,\"start\":48911},{\"end\":48932,\"start\":48929},{\"end\":48945,\"start\":48942},{\"end\":48961,\"start\":48953},{\"end\":48968,\"start\":48963},{\"end\":49286,\"start\":49279},{\"end\":49295,\"start\":49293},{\"end\":49740,\"start\":49735},{\"end\":49753,\"start\":49748},{\"end\":49767,\"start\":49760},{\"end\":49781,\"start\":49776},{\"end\":49794,\"start\":49789},{\"end\":49808,\"start\":49802},{\"end\":52911,\"start\":52907},{\"end\":52922,\"start\":52917},{\"end\":52936,\"start\":52931},{\"end\":52950,\"start\":52946},{\"end\":52963,\"start\":52961},{\"end\":52976,\"start\":52973}]", "bib_entry": "[{\"attributes\":{\"id\":\"b0\"},\"end\":39092,\"start\":38774},{\"attributes\":{\"id\":\"b1\",\"matched_paper_id\":2129889},\"end\":39501,\"start\":39094},{\"attributes\":{\"doi\":\"arXiv:1803.11175\",\"id\":\"b2\"},\"end\":40017,\"start\":39503},{\"attributes\":{\"id\":\"b3\",\"matched_paper_id\":3618568},\"end\":40592,\"start\":40019},{\"attributes\":{\"id\":\"b4\",\"matched_paper_id\":52057510},\"end\":41177,\"start\":40594},{\"attributes\":{\"id\":\"b5\",\"matched_paper_id\":2239496},\"end\":41796,\"start\":41179},{\"attributes\":{\"id\":\"b6\",\"matched_paper_id\":1828592},\"end\":42541,\"start\":41798},{\"attributes\":{\"id\":\"b7\",\"matched_paper_id\":22716243},\"end\":43033,\"start\":42543},{\"attributes\":{\"id\":\"b8\",\"matched_paper_id\":15442925},\"end\":43642,\"start\":43035},{\"attributes\":{\"id\":\"b9\",\"matched_paper_id\":1294169},\"end\":44164,\"start\":43644},{\"attributes\":{\"doi\":\"arXiv:1611.08562\",\"id\":\"b10\"},\"end\":44448,\"start\":44166},{\"attributes\":{\"id\":\"b11\",\"matched_paper_id\":52167799},\"end\":45079,\"start\":44450},{\"attributes\":{\"id\":\"b12\",\"matched_paper_id\":52281610},\"end\":45627,\"start\":45081},{\"attributes\":{\"id\":\"b13\",\"matched_paper_id\":11816014},\"end\":46272,\"start\":45629},{\"attributes\":{\"id\":\"b14\",\"matched_paper_id\":1114678},\"end\":46890,\"start\":46274},{\"attributes\":{\"doi\":\"arXiv:1611.06216\",\"id\":\"b15\"},\"end\":47216,\"start\":46892},{\"attributes\":{\"doi\":\"arXiv:1506.06714\",\"id\":\"b16\"},\"end\":47738,\"start\":47218},{\"attributes\":{\"id\":\"b17\",\"matched_paper_id\":1399322},\"end\":48024,\"start\":47740},{\"attributes\":{\"id\":\"b18\",\"matched_paper_id\":7961699},\"end\":48343,\"start\":48026},{\"attributes\":{\"id\":\"b19\",\"matched_paper_id\":13756489},\"end\":48772,\"start\":48345},{\"attributes\":{\"doi\":\"arXiv:1610.02424\",\"id\":\"b20\"},\"end\":49240,\"start\":48774},{\"attributes\":{\"id\":\"b21\",\"matched_paper_id\":12300158},\"end\":49656,\"start\":49242},{\"attributes\":{\"id\":\"b22\",\"matched_paper_id\":6869582},\"end\":50371,\"start\":49658},{\"attributes\":{\"id\":\"b23\"},\"end\":62803,\"start\":50373}]", "bib_title": "[{\"end\":39134,\"start\":39094},{\"end\":40067,\"start\":40019},{\"end\":40629,\"start\":40594},{\"end\":41251,\"start\":41179},{\"end\":41866,\"start\":41798},{\"end\":42581,\"start\":42543},{\"end\":43081,\"start\":43035},{\"end\":43686,\"start\":43644},{\"end\":44499,\"start\":44450},{\"end\":45162,\"start\":45081},{\"end\":45688,\"start\":45629},{\"end\":46333,\"start\":46274},{\"end\":47766,\"start\":47740},{\"end\":48076,\"start\":48026},{\"end\":48370,\"start\":48345},{\"end\":49271,\"start\":49242},{\"end\":49724,\"start\":49658},{\"end\":52901,\"start\":50373}]", "bib_author": "[{\"end\":38855,\"start\":38846},{\"end\":38869,\"start\":38855},{\"end\":38885,\"start\":38869},{\"end\":38895,\"start\":38885},{\"end\":39152,\"start\":39136},{\"end\":39167,\"start\":39152},{\"end\":39181,\"start\":39167},{\"end\":39515,\"start\":39503},{\"end\":39528,\"start\":39515},{\"end\":39547,\"start\":39528},{\"end\":39559,\"start\":39547},{\"end\":39576,\"start\":39559},{\"end\":39580,\"start\":39576},{\"end\":39591,\"start\":39580},{\"end\":39607,\"start\":39591},{\"end\":39632,\"start\":39607},{\"end\":39638,\"start\":39632},{\"end\":40081,\"start\":40069},{\"end\":40093,\"start\":40081},{\"end\":40107,\"start\":40093},{\"end\":40123,\"start\":40107},{\"end\":40644,\"start\":40631},{\"end\":40651,\"start\":40644},{\"end\":40664,\"start\":40651},{\"end\":40678,\"start\":40664},{\"end\":40691,\"start\":40678},{\"end\":40703,\"start\":40691},{\"end\":40716,\"start\":40703},{\"end\":40734,\"start\":40716},{\"end\":41266,\"start\":41253},{\"end\":41280,\"start\":41266},{\"end\":41293,\"start\":41280},{\"end\":41309,\"start\":41293},{\"end\":41323,\"start\":41309},{\"end\":41341,\"start\":41323},{\"end\":41355,\"start\":41341},{\"end\":41369,\"start\":41355},{\"end\":41883,\"start\":41868},{\"end\":41898,\"start\":41883},{\"end\":41914,\"start\":41898},{\"end\":41929,\"start\":41914},{\"end\":41944,\"start\":41929},{\"end\":41956,\"start\":41944},{\"end\":41972,\"start\":41956},{\"end\":41988,\"start\":41972},{\"end\":42595,\"start\":42583},{\"end\":42611,\"start\":42595},{\"end\":42625,\"start\":42611},{\"end\":43105,\"start\":43083},{\"end\":43121,\"start\":43105},{\"end\":43137,\"start\":43121},{\"end\":43149,\"start\":43137},{\"end\":43163,\"start\":43149},{\"end\":43176,\"start\":43163},{\"end\":43191,\"start\":43176},{\"end\":43707,\"start\":43688},{\"end\":43723,\"start\":43707},{\"end\":43741,\"start\":43723},{\"end\":44241,\"start\":44231},{\"end\":44254,\"start\":44241},{\"end\":44271,\"start\":44254},{\"end\":44525,\"start\":44501},{\"end\":44540,\"start\":44525},{\"end\":44555,\"start\":44540},{\"end\":44571,\"start\":44555},{\"end\":45188,\"start\":45164},{\"end\":45203,\"start\":45188},{\"end\":45708,\"start\":45690},{\"end\":45720,\"start\":45708},{\"end\":45740,\"start\":45720},{\"end\":45753,\"start\":45740},{\"end\":46350,\"start\":46335},{\"end\":46364,\"start\":46350},{\"end\":46381,\"start\":46364},{\"end\":46912,\"start\":46892},{\"end\":46923,\"start\":46912},{\"end\":46940,\"start\":46923},{\"end\":46955,\"start\":46940},{\"end\":47325,\"start\":47305},{\"end\":47340,\"start\":47325},{\"end\":47354,\"start\":47340},{\"end\":47370,\"start\":47354},{\"end\":47383,\"start\":47370},{\"end\":47402,\"start\":47383},{\"end\":47416,\"start\":47402},{\"end\":47430,\"start\":47416},{\"end\":47442,\"start\":47430},{\"end\":47790,\"start\":47768},{\"end\":47804,\"start\":47790},{\"end\":47816,\"start\":47804},{\"end\":48094,\"start\":48078},{\"end\":48109,\"start\":48094},{\"end\":48120,\"start\":48109},{\"end\":48388,\"start\":48372},{\"end\":48402,\"start\":48388},{\"end\":48415,\"start\":48402},{\"end\":48432,\"start\":48415},{\"end\":48445,\"start\":48432},{\"end\":48460,\"start\":48445},{\"end\":48475,\"start\":48460},{\"end\":48493,\"start\":48475},{\"end\":48861,\"start\":48851},{\"end\":48882,\"start\":48861},{\"end\":48906,\"start\":48882},{\"end\":48922,\"start\":48906},{\"end\":48934,\"start\":48922},{\"end\":48947,\"start\":48934},{\"end\":48963,\"start\":48947},{\"end\":48970,\"start\":48963},{\"end\":49288,\"start\":49273},{\"end\":49297,\"start\":49288},{\"end\":49742,\"start\":49726},{\"end\":49755,\"start\":49742},{\"end\":49769,\"start\":49755},{\"end\":49783,\"start\":49769},{\"end\":49796,\"start\":49783},{\"end\":49810,\"start\":49796},{\"end\":52913,\"start\":52903},{\"end\":52924,\"start\":52913},{\"end\":52938,\"start\":52924},{\"end\":52952,\"start\":52938},{\"end\":52965,\"start\":52952},{\"end\":52978,\"start\":52965}]", "bib_venue": "[{\"end\":39322,\"start\":39260},{\"end\":40284,\"start\":40212},{\"end\":40910,\"start\":40822},{\"end\":41512,\"start\":41449},{\"end\":42139,\"start\":42062},{\"end\":42764,\"start\":42703},{\"end\":43374,\"start\":43291},{\"end\":43936,\"start\":43847},{\"end\":44747,\"start\":44659},{\"end\":45379,\"start\":45291},{\"end\":45925,\"start\":45841},{\"end\":46557,\"start\":46470},{\"end\":49481,\"start\":49391},{\"end\":49991,\"start\":49899},{\"end\":38844,\"start\":38774},{\"end\":39258,\"start\":39181},{\"end\":39739,\"start\":39654},{\"end\":40210,\"start\":40123},{\"end\":40820,\"start\":40734},{\"end\":41447,\"start\":41369},{\"end\":42060,\"start\":41988},{\"end\":42701,\"start\":42625},{\"end\":43289,\"start\":43191},{\"end\":43845,\"start\":43741},{\"end\":44229,\"start\":44166},{\"end\":44657,\"start\":44571},{\"end\":45289,\"start\":45203},{\"end\":45839,\"start\":45753},{\"end\":46468,\"start\":46381},{\"end\":47031,\"start\":46971},{\"end\":47303,\"start\":47218},{\"end\":47865,\"start\":47816},{\"end\":48169,\"start\":48120},{\"end\":48542,\"start\":48493},{\"end\":48849,\"start\":48774},{\"end\":49389,\"start\":49297},{\"end\":49897,\"start\":49810},{\"end\":53471,\"start\":52978}]"}}}, "year": 2023, "month": 12, "day": 17}