{"id": 56422797, "updated": "2023-11-11 01:25:38.68", "metadata": {"title": "On the Geometric Interpretation of the Nonnegative Rank", "authors": "[{\"first\":\"Nicolas\",\"last\":\"Gillis\",\"middle\":[]},{\"first\":\"Franccois\",\"last\":\"Glineur\",\"middle\":[]}]", "venue": "Linear Algebra and its Applications 437 (11), pp. 2685-2712, 2012", "journal": null, "publication_date": {"year": 2010, "month": null, "day": null}, "abstract": "The nonnegative rank of a nonnegative matrix is the minimum number of nonnegative rank-one factors needed to reconstruct it exactly. The problem of determining this rank and computing the corresponding nonnegative factors is difficult; however it has many potential applications, e.g., in data mining, graph theory and computational geometry. In particular, it can be used to characterize the minimal size of any extended reformulation of a given combinatorial optimization program. In this paper, we introduce and study a related quantity, called the restricted nonnegative rank. We show that computing this quantity is equivalent to a problem in polyhedral combinatorics, and fully characterize its computational complexity. This in turn sheds new light on the nonnegative rank problem, and in particular allows us to provide new improved lower bounds based on its geometric interpretation. We apply these results to slack matrices and linear Euclidean distance matrices and obtain counter-examples to two conjectures of Beasly and Laffey, namely we show that the nonnegative rank of linear Euclidean distance matrices is not necessarily equal to their dimension, and that the rank of a matrix is not always greater than the nonnegative rank of its square.", "fields_of_study": "[\"Mathematics\"]", "external_ids": {"arxiv": null, "mag": "2126210866", "acl": null, "pubmed": null, "pubmedcentral": null, "dblp": null, "doi": "10.1016/j.laa.2012.06.038"}}, "content": {"source": {"pdf_hash": "1befc8e1fa49e767a213ed7de056128d117f81f0", "pdf_src": "ArXiv", "pdf_uri": "[\"https://arxiv.org/pdf/1009.0880v1.pdf\"]", "oa_url_match": false, "oa_info": {"license": "publisher-specific-oa", "open_access_url": "https://doi.org/10.1016/j.laa.2012.06.038", "status": "HYBRID"}}, "grobid": {"id": "9c66425782c8d5450eca2a5c70eb54c42d7684ba", "type": "plain-text", "url": "s3://ai2-s2-science-parse-plus-prod/parse-results/s2orc_worker/1befc8e1fa49e767a213ed7de056128d117f81f0.txt", "contents": "\nOn the Geometric Interpretation of the Nonnegative Rank\n4 Sep 2010\n\nNicolas Gillis \nFrançois Glineur \nOn the Geometric Interpretation of the Nonnegative Rank\n4 Sep 2010793D4FC07F612D3FA8CBE5043E92EC2BarXiv:1009.0880v1[math.OC]nonnegative rankrestricted nonnegative ranknested polytopescomputational complexitycomputational geometryextended formulationslinear Euclidean distance matrices AMS subject classifications. 15A2315B4852B0552B1165D9965F3090C27\nThe nonnegative rank of a nonnegative matrix is the minimum number of nonnegative rank-one factors needed to reconstruct it exactly.The problem of determining this rank and computing the corresponding nonnegative factors is difficult; however it has many potential applications, e.g., in data mining, graph theory and computational geometry.In particular, it can be used to characterize the minimal size of any extended reformulation of a given combinatorial optimization program.In this paper, we introduce and study a related quantity, called the restricted nonnegative rank.We show that computing this quantity is equivalent to a problem in polyhedral combinatorics, and fully characterize its computational complexity.This in turn sheds new light on the nonnegative rank problem, and in particular allows us to provide new improved lower bounds based on its geometric interpretation.We apply these results to slack matrices and linear Euclidean distance matrices and obtain counter-examples to two conjectures of Beasly and Laffey, namely we show that the nonnegative rank of linear Euclidean distance matrices is not necessarily equal to their dimension, and that the rank of a matrix is not always greater than the nonnegative rank of its square.\n\nIntroduction\n\nThe nonnegative rank of a m × n real nonnegative matrix M ∈ R m×n + is the minimum number of nonnegative rank-one factors needed to reconstruct M exactly, i.e., the minimum k such that there exists U ∈ R m×k + and V ∈ R k×n + with M = U V = k i=1 U :i V i: .The pair (U, V ) is called a rank-k nonnegative factorization 1 of M .The nonnegative rank of M is denoted rank + (M ).Clearly, rank(M ) ≤ rank + (M ) ≤ min(m, n).\n\nDetermining the nonnegative rank and computing the corresponding nonnegative factorization is a relatively recently studied problem in linear algebra [4,12].In the literature, much more attention has been devoted to the approximate nonnegative factorization problem (called nonnegative matrix factorization, NMF for short [26]) consisting in finding two low-rank nonnegative factors U and V such that M ≈ U V or, more precisely, solving min\nU ∈R m×k + ,V ∈R k×n + ||M − U V || F .\n1 Université catholique de Louvain, CORE, B-1348 Louvain-la-Neuve, Belgium.E-mail: nicolas.gillis@uclouvain.be and francois.glineur@uclouvain.be.Nicolas Gillis is a research fellow of the Fonds de la Recherche Scientifique (F.R.S.-FNRS).This text presents research results of the Belgian Program on Interuniversity Poles of Attraction initiated by the Belgian State, Prime Minister's Office, Science Policy Programming.The scientific responsibility is assumed by the authors. 1 Notice that matrices U and V in a rank-k nonnegative factorization are not required to have rank k.\n\nNMF has been widely used as a data analysis technique [5], e.g., in text mining, image processing, hyperspectral data analysis, computational biology, clustering, etc.Nevertheless, there are not too many theoretical results about the nonnegative rank and better characterizations, in particular lower bounds, could help practitioners.For example, efficient computations of nonnegative factorizations could help to design new NMF algorithms using a two-step strategy [33]: first approximate M with a low-rank nonnegative matrix A (e.g., using the singular value decomposition2 ) and then compute a nonnegative factorization of A. Bounds for the nonnegative rank could also help select the factorization rank of the NMF, replacing the trial and error approach often used by practitioners.For example, in hyperspectral image analysis, the nonnegative rank corresponds to the number of materials present in the image and its computation could lead to more efficient algorithms detecting these constitutive elements, see [7,14,23,21] and references therein.\n\nAn extended formulation (or lifting) for a polytope P ⊂ R n is a polyhedron Q ⊂ R n+p such that\nP = proj x (Q) := {x ∈ R n | ∃y ∈ R p s.t. (x, y) ∈ Q}.\nExtended formulations whose size (number of constraints plus number of variables defining Q) is polynomial in n are called compact and are of great importance in integer programming.They allow to reduce significantly the size of the linear programming (LP) formulation of certain integer programs, and therefore provide a way to solve them efficiently, i.e., in polynomial-time (see [13] for a survey).\n\nYannakakis [36,Theorem 3] showed that the minimum size s of an extended formulation of a polytope3\nP = {x ∈ R n | Cx ≥ d, Ax = b},\nis of the same order as the sum of its dimension n and the nonnegative rank of its slack matrix S M ≥ 0, where each column of the slack matrix is defined as\nS M (:, i) = Cv i − d ≥ 0, i = 1, 2, . . . , m,(1.1)\nand vectors v i are the m vertices of the polytope P .Formally, we then have s = Θ(n + rank + (S M )).\n\nIn particular, any rank-k nonnegative factorization (U, V ) of S M = U V provides the following extended formulation for P with size Θ(n + k)\nQ = {(x, y) ∈ R n+k | Cx − U y = d, Ax = b, y ≥ 0}. (1.2)\nIn fact, proj x (Q) ⊆ P since U y ≥ 0 implies Cx ≥ d for any x ∈ proj x (Q), and P ⊆ proj x (Q) since Cv i − U V (:, i) = d implies that (v i , V (:, i)) ∈ Q for all i and therefore each vertex v i of P belongs to proj x (Q).Intuitively, this extended formulation parametrizes the space of slacks of the original polytope with the convex cone {U y | y ≥ 0}.It is therefore interesting to compute bounds for the nonnegative rank in order to estimate the size of these extended formulations.Recently, Goemans [22] used this result to show that the size of LP formulations of the permutahedron (polytope whose n! vertices are permutations of [1, 2, . . . , n]) is at least Ω(n log(n)) variables plus constraints (cf.Section 3).\n\nWe will see in Section 3.1 that the nonnegative rank is closely related to a problem in computational geometry that consists in finding a polytope with minimum number of vertices nested between two given polytopes.Therefore a better understanding of the properties of the nonnegative rank would presumably also allow to improve characterization of the solutions to this geometric problem.\n\nThe nonnegative rank also has connections with other problems, e.g., in communication complexity theory [36,27], probability [8], and graph theory (cf.Section 3).\n\nThe main goal of this paper is to provide improved lower bounds on the nonnegative rank.In Section 2, we introduce a new related quantity called restricted nonnegative rank.Generalizing a recent result of Vavasis [33] (see also [28]), we show that computing this quantity is equivalent to a problem in polyhedral combinatorics, and fully characterize its computational complexity.In Section 3, based on the geometric interpretation of the nonnegative rank and the relationship with the restricted nonnegative rank, we derive new improved lower bounds for the nonnegative rank.Finally, in Section 4, we apply our results to slack matrices and linear Euclidean distance matrices.We obtain counter-examples to two conjectures of Beasly and Laffey [2], namely we show that the nonnegative rank of linear Euclidean distance matrices is not necessarily equal to their dimension, and that the rank of a matrix is not always greater than the nonnegative rank of its square.\n\nNotation.The set of real matrices of dimension m by n is denoted R m×n ; for A ∈ R m×n , we denote the i th column of A by A :i or A(:, i), the j th row of A by A j: or A(j, :), and the entry at position (i, j) by A ij or A(i, j); for b ∈ R m×1 = R m , we denote the i th entry of b by b i .Notation A(I, J) refers to the submatrix of A with row and column indices respectively in I and J, and a:b is the set {a, a + 1, . . ., b − 1, b} (for a and b integers with a ≤ b).The set R m×n with component-wise nonnegative entries is denoted R m×n + .The matrix A T is the transpose of A. The rank of a matrix A is denoted rank(A), its column space col(A).The convex hull of the set of points S, or the convex hull of the columns of the matrix S are denoted conv(S).The number of vertices of the polytope Q is denoted by # vertices(Q).The concatenation of the columns of two matrices A ∈ R m×n and B ∈ R m×p is denoted [A B] ∈ R m× (n+p) .The sparsity pattern of a vector is the set of indices of its zero entries (it is the complement of its support).\n\n\nRestricted Nonnegative Rank\n\nIn this section, we analyze the following quantity Definition 1.The restricted nonnegative rank of a nonnegative matrix M is the minimum value of k such that there exists U ∈ R m×k\n+ and V ∈ R k×n + with M = U V and rank(U ) = rank(M ), i.e., col(U ) = col(M ). It is denoted rank * + (M ).\nIn particular, given a nonnegative matrix M , we are interested in computing its restricted nonnegative rank rank * + (M ) and a corresponding nonnegative factorization, i.e., solve\n(RNR) Given a nonnegative matrix M ∈ R m×n + , find k = rank * + (M ) and compute U ∈ R m×k + and V ∈ R k×n + such that M = U V and rank(U ) = rank(M ) = r.\nWithout the rank constraint on the matrix U , this problem reduces to the standard nonnegative rank problem.Motivation to study this restriction includes the following 1.The restricted nonnegative rank provides a new upper bound for the nonnegative rank, since rank + (M ) ≤ rank * + (M ).\n\n2. The restricted nonnegative rank can be characterized much more easily.In particular, its geometrical interpretation (Section 2.1) will lead to new improved lower bounds for the nonnegative rank (Sections 3 and 4).\n\nRNR is a generalization of exact nonnegative matrix factorization (exact NMF) introduced by Vavasis [33].Noting r = rank(M ), exact NMF asks whether rank + (M ) = r and, if the answer is positive, to compute a rank-r nonnegative factorization of M .If rank + (M ) = r then it is clear that rank * + (M ) = rank + (M ) since the rank of U in any rank-r nonnegative factorization (U, V ) of M must be equal to r.\n\nVavasis studies the computational complexity of exact NMF and proves it is NP-hard by showing its equivalence with a problem in polyhedral combinatorics called intermediate simplex.This construction requires both the dimensions of matrix M and its rank r to increase to obtain NP-hardness.This result also implies NP-hardness of RNR when the rank of matrix M is not fixed.However, in the case where the rank r of matrix M is fixed, no complexity results are known (except in the trivial cases r = 1, 2 [32]).The situation for RNR is quite different: we are going to show that RNR can be solved in polynomial-time when r = 3 and that it is NP-hard for any fixed r ≥ 4. In particular, this result implies that exact NMF can be solved in polynomial-time for rank-three nonnegative matrices.\n\nIn order to do so, we first show equivalence of RNR with another problem in polyhedral combinatorics, closely related to intermediate simplex (Section 2.1), and then apply results from the computational geometry literature to conclude about its computational complexity for fixed rank (Section 2.2).\n\n\nEquivalence with the Nested Polytopes Problem\n\nLet consider the following problem called nested polytopes problem (NPP):\n\n(NPP) Given a bounded polyhedron\nP = {x ∈ R r−1 | 0 ≤ f (x) = Cx + d},\nwith (C d) ∈ R m×r of rank r, and a set S of n points in P not contained in any hyperplane (i.e., conv(S) is full-dimensional), find the minimum number k of points in P whose convex hull T contains S, i.e., S ⊆ T ⊆ P .\n\nPolytope P is referred to as the outer polytope, and conv(S) as the inner polytope; note that they are given by two distinct types of representations (faces for P , extreme points for conv(S)).\n\nThe intermediate simplex problem mentioned earlier and introduced by Vavasis [33] is a particular case of NPP in which one asks whether k is equal to r (which is the minimum possible value), i.e., if there exists a simplex T (defined by r vertices in a r − 1 dimensional space) contained in P and containing S.\n\nWe now prove equivalence between RNR and NPP.It is a generalization of the result of Vavasis [33] who showed equivalence of exact NMF and intermediate simplex.\n\nTheorem 1.There is a polynomial-time reduction from RNR to NPP and vice-versa.\n\nProof.Let us construct a reduction of RNR to NPP.First we (1) delete the zero rows and columns of M and (2) normalize its columns such that M becomes column stochastic (columns are nonnegative and sum to one).One can easily check that it gives a polynomially equivalent RNR instance [9].We then decompose M as the product of two rank-r matrices (using, e.g., reduction to row-echelon form)\nM = AB ⇐⇒ M :i = r l=1 A :l B li ∀i,(2.1)\nwhere r = rank(M ), A ∈ R m×r and B ∈ R r×n .We observe that one can assume without loss of generality that the columns of A and B sum to one.Indeed, since M is column stochastic, at least one column of A does not sum to zero (otherwise all columns of AB = M would sum to zero).One can then update A and B in the following way so that their columns sum to one:\n\n• For each column of A which sums to zero, add a column of A which does not sum to zero, and update B accordingly;\n\n• Normalize the columns of A such that they sum to one, and update B accordingly;\n\n• Observe that since the columns of A sum to one, M is column stochastic and since M = AB, the columns of B must also sum to one.\n\nIn order to find a solution of RNR, we have to find U ∈ R m×k + and V ∈ R k×n + such that M = U V and rank(U ) = r.For the same reasons as for A and B, U and V can be assumed to be column stochastic without loss of generality.Moreover, since\nM = U V = AB,\nand rank(M ) = rank(A) = rank(U ) = r, the column spaces of M , A and U coincide; implying that the columns of U must be a linear combination of the columns of A. The columns of U must then belong to the following set\nQ = {u ∈ R m | u ∈ col(A), u ≥ 0 and m i=1 u i = 1}.\n(2.2)\n\nOne can then reduce the search space to the (r − 1)-dimensional polyhedron corresponding to the coefficients of all possible linear combinations of the columns of A generating stochastic columns.Defining C(:, i) = A(:, i) − A(:, r) 1 ≤ i ≤ r − 1, and d = A(:, r), and introducing affine function f : R r−1 → R m : x → f (x) = Cx + d, which is injective since C is full rank (because A is full rank), this polyhedron can be defined as\nP = {x ∈ R r−1 | A(:, 1:r−1)x + 1 − r−1 i=1 x i A(:, r) ≥ 0} = {x ∈ R r−1 | f (x) ≥ 0}. (2.3)\nNote that B(1:r−1, j) ∈ P ∀j since M (:, j) = AB(:, j) = f (B(1:r−1, j)) ≥ 0 ∀j.Let us show that P is bounded: suppose P is unbounded, then\n∃ x ∈ P, ∃ y = 0 ∈ R r−1 , ∀α ≥ 0 : x + αy ∈ P, ⇐⇒ C(x + αy) + d = (Cx + d) + αCy ≥ 0.\nSince Cx + d ≥ 0, this implies that Cy ≥ 0. Observe that columns of C sum to zero (since the columns of A sum to one) so that Cy sums to zero as well; moreover, C is full rank and y is nonzero implying that Cy is nonzero and therefore that Cy must contain at least one negative entry, a contradiction.Notice that the set Q can be equivalently written as\nQ = {u ∈ R m | u = f (x), x ∈ P }. Noting X = [x 1 x 2 . . . x k ] ∈ R r−1×k , f (X) = [f (x 1 ) f (x 2 ) . . . f (x k )] = CX + [d d . . . d],\nwe finally have\n∃U ∈ R m×k , V ∈ R k×n column stochastic with rank(U ) = rank(M ) and M = U V ⇐⇒ ∃x 1 , x 2 , . . . x k ∈ P and V ∈ R k×n column stochastic s.t. M = f (B(1:r−1, :)) = f (X)V = f (XV ) ⇐⇒ B(1:r−1, :) = XV.\nThe first equivalence follows from the above derivations (i.e., U = f (X) for some x 1 , x 2 , . . .\nx k ∈ P ); f (X)V = f (XV ) because V is column stochastic (so that [d d . . . d]V = [d d . . . d])\n, and the second equivalence is a consequence from the fact that f is an injection.\n\nWe have then reduced RNR to NPP: find the minimum number k of points x i in P such that n given points (the columns of B(1:r−1, :) constructed from the columns of M , which define the set S in the NPP instance) are contained in the convex hull of these points (since V is column stochastic).Because all steps in the above derivation are equivalences, we have actually also defined a reduction from NPP to RNR; to map a NPP instance to a RNR instance, we take\nM (:, i) = f (s i ) = Cs i + d ≥ 0, s i ∈ S 1 ≤ i ≤ n,\nand rank(M ) = r because the n points s i are not all contained in any hyperplane (they affinely span P).\n\nIt is worth noting that M would be the slack matrix of P if S was the set of vertices of P (cf.Introduction).This will be useful later in Section 4.1.\n\n\nComputational Complexity\n\n\nRank-Three Matrices\n\nUsing Theorem 1, RNR of a rank-three matrix can be reduced to a two-dimensional nested polytopes problem 4 .Therefore, one has to find a convex polygon T with minimum number of vertices nested in between two given convex polygons S ⊂ P .This problem has been studied by Aggarwal et al. in [1], who proposed an algorithm running in O(p log(k)) operations 5 , where p is the total number of vertices of the given polygons S and P , and k is the number of vertices of the minimal nested polygon T .If M is a m-by-n matrix then p ≤ m + n since S has n vertices, and the polygon P is defined by m inequalities so that it has at most m vertices.Moreover k = rank * + (M ) ≤ min(m, n) follows from the trivial solutions T = S and T = P .Finally, we conclude that one can compute the restricted nonnegative rank of a rank-three m-by-n matrix in O (m + n) log(min(m, n)) operations.\n\nTheorem 2. For rank(M ) ≤ 3, RNR can be solved in polynomial-time.\n\nProof.Cases r = 1, 2 are trivial since any rank-1 (resp.2) nonnegative matrix can always be expressed as the sum of 1 (resp.2) nonnegative factors [32].\n\nCase r = 3 follows from Theorem 1 and the polynomial-time algorithm of Aggarwal et al. [1].\n\nFor the sake of completeness, we sketch the main ideas of the algorithm of Aggarwal et al.They first make the following observations: (1) any vertex of a solution T can be assumed to belong to the boundary of the polygon P (otherwise it can be projected back on P in order to generate a new solution containing the previous one), (2) any segment whose ends are on the boundary of P and tangent to S (i.e., S is on one side of the segment, and the segment touches S) defines a polygon with the boundary of P which must contain a vertex of any feasible solution T (otherwise the tangent point on S could not be contained in T ), see, e.g., set Q on Figure 1 delimited by the segment [p 1 , p 2 ] and the boundary of P , and such that T ∩ Q = ∅ for any feasible solution T .\n\nStarting from any point p 1 of the boundary of P , one can trace the tangent to S and hence obtain the next intersection p 2 with P .Point p 2 is chosen as the next vertex of a solution T , and the same procedure is applied (say k times) until the algorithm can reach the initial point without going through S, see Figure 1.This generates a feasible solution T (p 1 ) = conv({p 1 , p 2 , . . ., p k }).Because of ( 1) and (2), this solution has at most one vertex more than an optimal one, i.e., k ≤ rank * + (M ) + 1 (since T determines with the boundary of P k − 1 disjoint polygons tangent to S).Moreover, because of ( 1) and ( 2), there must exist a vertex of an optimal solution on the boundary of P between p 1 and p 2 .\n\nThe point p 1 is then replaced by the so called 'contact change points' located on this part of the boundary of P while the corresponding solution T (p 1 ) is updated using the procedure described above.The contact change points are: (a) the vertices of P between p 1 and p 2 , and (b) the points for which one tangent point of T (p 1 ) on S is changed when p 1 is replaced by them.This (finite) set of points provides a list of candidates where the number of vertices of the solution T could potentially be reduced (i.e., where p 1 and p k could coincide) by replacing p 1 by one of these points.It is then possible to check whether the current solution can be improved or not, and guarantee global optimality.In the example of Figure 1, moving p 1 on the (only) vertex of P between p 1 and p 2 generates an optimal solution of this RNR instance (since it reduces the original solution from 5 to 4 vertices).\n\n\nHigher Rank Matrices\n\nFor a rank-four matrix, RNR reduces to a three-dimensional problem of finding a polytope T with the minimum number of vertices nested between two other polytopes S ⊆ P .This problem has been studied by Das et al. [17,15] and has been shown to be NP-hard when minimizing the number of faces of T (the reduction is from planar-3SAT ).From this result, one can deduce using a duality argument6 that minimizing the number of vertices of T is NP-hard as well [16,11].\nTheorem 3. For rank(M ) ≥ 4, RNR is NP-hard.\nProof.This is a consequence of Theorem 1 and the NP-hardness results of Das et al. [17,15,16].\n\nNote however that several approximation algorithms have been proposed in the literature.For example, Mitchell and Suri [29] approximate rank * + (M ) in case rank(M ) = 4 within a O(log(p)) factor, where p is the total number of vertices of the given polygons S and P .Clarkson [11]\n\n\nSome Properties\n\nIn this section, we derive some useful properties of the restricted nonnegative rank.\n\nExample 1. Construct M using the following NPP instance: P is the three dimensional cube\nP = {x ∈ R 3 | 0 ≤ x i ≤ 1, 1 ≤ i ≤ 3}\n, with 6 faces and S is the set of its 8 vertices\nS = {x ∈ R 3 | x i ∈ {0, 1}, 1 ≤ i ≤ 3}.\nBy construction, the convex hull of S is equal to P and the unique and optimal solution to this NPP instance is T = P = conv(S) with 8 vertices.By Theorem 1, the corresponding matrix M of the RNR instance\nM =         1 0 1 1 0 0 1 0 0 1 0 0 1 1 0 1 1 1 0 1 0 1 0 0 0 0 1 0 1 0 1 1 1 1 1 0 1 0 0 0 0 0 0 1 0 1 1 1         (2.4)\nhas restricted nonnegative rank equal to 8 (note that its rank is 4 and its nonnegative rank is 6, see Section 3).\n\nIt is well-known that for a matrix M ∈ R m×n + , we have rank + (M ) ≤ min(m, n); surprisingly, this does not hold for the restricted nonnegative rank.\nLemma 1. For M ∈ R m×n + , rank * + (M ) ≤ n but rank * + (M ) m.\nProof.The first inequality is trivial since M = M I (I being the identity matrix).Example 1 provides an example when rank * + (M ) = 8 for a 6-by-8 matrix M .\n\nLemma 1 implies that in general rank * + (M ) = rank * + (M T ), unlike the rank and nonnegative rank [12].Note however that when rank(M ) ≤ 3, we have\nrank * + (M ) ≤ min(m, n),\nbecause the number of vertices of the outer polygon P in the NPP instance is smaller or equal to its number of facets m in the two-dimensional case or lower, and that the solution T = P is always feasible.\nLemma 2. Let A ∈ R m×n + and B ∈ R m×r + , then rank * + ([A B]) ≤ rank * + (A) + rank * + (B).\nProof.Let (U a , V a ) and (U b , V b ) be solutions of RNR for A and B respectively, then\n[A B] = [U a U b ] V a 0 0 V b , and rank([U a U b ]) = rank([A B]) since col(U a ) = col(A) and col(U b ) = col(B) by definition. Lemma 3. Let M ∈ R m×n + with rank(M ) = r and rank + (M ) = r + , U ∈ R m×r + + and V ∈ R r + ×n + with M = U V . Then r + < rank * + (M ) ⇒ r < rank(U ) ≤ r + and r ≤ rank(V ) < r + .\nMoreover, if M is symmetric,\nr + < rank * + (M ) ⇒ r < rank(U ) < r + and r < rank(V ) < r + .\nProof.Clearly, r ≤ rank(U ) ≤ r + and r ≤ rank(V ) ≤ r + .\n\nIf rank(U ) = r, we would have rank * + (M ) = r + which is a contradiction, and rank(V ) = r + would imply that V has a right pseudo-inverse V † , so that we could write U = M V † and then r ≤ rank(U ) ≤ min(r, rank(V † )) ≤ r, a contradiction for the same reason.\n\nIn case M is symmetric, to show that rank(U ) < r + and rank(V ) > r, we use symmetry and observe that\nU V = M = M T = V T U T . Corollary 1. Given a nonnegative matrix M , rank * + (M ) ≤ rank(M ) + 1 ⇒ rank + (M ) = rank * + (M ).\nIf M is symmetric,\nrank * + (M ) ≤ rank(M ) + 2 ⇒ rank + (M ) = rank * + (M ).\nProof.Let r = rank(M ), r + = rank + (M ), and\nU ∈ R m×r + + and V ∈ R r + ×n + such that M = U V . If r + < rank * + (M ), by Lemma 3, we have r < rank(U ) ≤ r + < rank * + (M ), which is a contradiction if rank * + (M ) ≤ r + 1. If M is symmetric, we have rank(U ) < r + and the above equation is a contradiction if rank * + (M ) ≤ r + 2.\nFor example, this implies that to find a symmetric rank-three nonnegative matrix with rank\n+ (M ) < rank * + (M ), we need rank * + (M ) > rank(M ) + 2 =        = U V, U =         5 0 4 0 1 3 0 1 1 0 1 0 0 4 1 0 1 0 4 1 0 3 1 1 0 0 5 4 0 1         , V =       0 0 0 1 3 5 5 3 1 0 0 0 0 0 1 1 0 0 1 0 0 0 0 1 0 1 0 0 1 0       .\nOne can check that rank(M ) = 3, and, using the algorithm of Aggarwal et al. [1], the restricted nonnegative rank can be computed 7 and is equal to 6.Using the above decomposition, it is clear that\nrank + (M ) ≤ 5 < rank * + (M ) = 6. By Lemma 3, for any rank + (M )-nonnegative factorization (U, V ) of M , we then must have 3 < rank(U ) = 4 < rank + (M ) implying that rank + (M ) = 5.\nAs we have already seen with Lemma 1, the restricted nonnegative rank does not share all the nice properties of the rank and the nonnegative rank functions [12].The next two lemmas exploit Example 2 further to show different behavior between nonnegative rank and restricted nonnegative rank.\n\n\nLower Bounds for the Nonnegative Rank\n\nIn this section, we provide new lower bounds for the nonnegative rank based on the restricted nonnegative rank.Recall that the restricted nonnegative rank already provides an upper bound for the nonnegative rank since for a m-by-n nonnegative matrix M ,\n0 ≤ rank(M ) ≤ rank + (M ) ≤ rank * + (M ) ≤ n.(3.1)\nNotice that this bound can only be computed efficiently in the case rank(M ) = 3 (see Theorems 2 and 3).\n\nAs mentioned in the introduction, it might also be interesting to compute lower bounds on the nonnegative rank.Some work has already been done in this direction, including the following 1.Let M ∈ R m×n + be any weighted biadjacency matrix of a bipartite graph\nG = (V 1 ∪ V 2 , E ⊂ V 1 × V 2 ) with M (i, j) > 0 ⇐⇒ (V 1 (i), V 2 (j)) ∈ E.\nA biclique of G is a complete bipartite subgraph (it corresponds to a positive rectangular submatrix of M ).One can easily check that each rank-one factor (U :k , V k: ) of any rank-k nonnegative factorization (U, V ) of M can be interpreted as a biclique of M (i.e., as a positive rectangular submatrix) since M = k i=1 U :i V i: .Moreover, these bicliques (U :k , V k: ) must cover G completely since M = U V .The minimum number of bicliques needed to cover G is then a lower bound for the nonnegative rank.It is called the biclique partition number and denoted b(G), see [35] and references therein.Its computation is NP-complete [30] and is directly related to the minimum biclique cover problem (MBC).Consider for example the matrix M from Example 1.The largest biclique of the graph G generated by M has 4 edges8 .Since G has 24 edges, we have b(G) ≥ 24  4 = 6 and therefore 6\n≤ rank + (M ) ≤ min(m, n) = 6. A crown graph G is a bipartite graph with |V 1 | = |V 2 | = n and E = {(V 1 (i), V 2 (j)) | i = j} (\nit can be viewed as a biclique where the horizontal edges have been removed).de Caen, Gregory and Pullman [18] showed that\nb(G) = min k k | n ≤ k ⌊k/2⌋ = O(log n).\nBeasley and Laffey [2] studied linear Euclidean distance matrices defined as M (i, j) = (a i − a j ) 2 for 1 ≤ i, j ≤ n, a i ∈ R, a i = a j i = j.They proved that such matrices have rank three and that\nmin k k | n ≤ k ⌊k/2⌋ ≤ r + which means n ≤ r + ⌊r + /2⌋ ,(3.2)\nwhere r + = rank + (M ).In fact, such matrices are biadjacency matrices of crown graphs (only the diagonal entries are equal to zero).\n\n2. Goemans makes [22] the following observation: the product U V of two nonnegative matrices\nU ∈ R m×k + and V ∈ R k×n +\ngenerates a matrix M with at most 2 k columns (resp. 2 k rows) with different sparsity patterns.In fact, the columns (resp.rows) of M are additive linear combinations of the k columns of U (resp.rows of V ) and therefore no more than 2 k sparsity patterns can be generated from these columns (resp.rows).Therefore, letting s p be the maximum between the number of columns and rows of M ∈ R m×n + having a different sparsity pattern, we have rank + (M ) ≥ log 2 (s p ).\n\nIn particular, if all the columns and rows of M have a different sparsity pattern, then\nrank + (M ) ≥ log 2 (max(m, n)).(3.3)\nGoemans then uses this result to show that any extended formulation of the permutahedron in dimension n must have Ω(n log(n)) variables and constraints.In fact,\n\n• The minimal size s is of the order of the nonnnegative rank of its slack matrix plus n (cf.Introduction).\n\n• The slack matrix has n! columns (corresponding to each vertex of the polytope) with different sparsity patterns (cf.Equation (1.1)).This implies that s = Θ(rank\n+ (S M ) + n) ≥ Θ(log(n!)) = Θ(n log(n)).\nIn this section, we provide some theoretical results linking the restricted nonnegative rank with the nonnegative rank, which allow us to improve and generalize the above results in Section 4 for both slack and linear Euclidean distance matrices.\n\n\nGeometric Interpretation of a Nonnegative Factorization as a Nested Polytopes Problem\n\nIn the following, we lay the groundwork for the main results of this paper, introducing essential notations and observations that will be extensively used in this section.We rely on the geometric interpretation of the nonnegative rank, see also [19,9,33] where similar results are presented.The main observation is that any rank-k nonnegative factorization (U, V ) of a nonnegative matrix M can be interpreted as the solution with k vertices of a nested polytopes problem in which the inner polytope has dimension rank(M ) − 1 and the outer polytope has dimension rank(U ) − 1.\n\nWithout loss of generality, let\nM ∈ R m×n + , U ∈ R m×k + and V ∈ R k×n +\nbe column stochastic with M = U V (cf.proof of Theorem 1, the columns of M are convex combination of the columns of U ).If the column space of U does not coincide with the column space of M , i.e., r u = rank(U ) > rank(M ) = r, it means that the columns of U belong to a higher dimensional affine subspace containing the columns of M (otherwise, see Theorem 1).\n\nLet factorize U = AB where A ∈ R m×ru and B ∈ R ru×r + are full rank and their columns sum to one.As in Theorem 1, we can construct the polytope of the coefficients of the linear combinations of the columns of A that generate stochastic vectors.It is defined as\nP u = {x ∈ R ru−1 | f u (x) = A(:, 1:r u −1)x + 1 − ru−1 i=1 x i A(:, r u ) ≥ 0}.\nSince col(M ) ⊆ col(U ), there exists B ′ ∈ R ru×n whose columns must sum to one such that M = AB ′ .Since rank(M ) = r and A is full rank, we must have rank(B ′ ) = r.By construction, the columns of B u = B(1:r u −1, :) (corresponding to the columns of U ) and B m = B ′ (1:r u −1, :) (corresponding to the columns of M ) belong to P u .Note that since rank(B ′ ) = r, the columns of B m live in a lower (r − 1)-dimensional polytope\nP m = {x ∈ R ru−1 | f u (x) ≥ 0, f u (x) ∈ col(M )} ⊆ P u .\nPolytope P m contains the points in P u generating vectors in the column space of M .\n\nMoreover\nM = AB ′ = U V = ABV,\nimplying that (since A is full rank)\nB ′ = BV and B m = B u V.\nFinally, the columns of B m are contained in the convex hull of the columns of B u , inside P u , i.e., conv(B m ) ⊆ conv(B u ) ⊆ P u .\n\nDefining the polytope T as the convex hull of the columns of B u , and the set of points S as the columns of B m , we can then interpret the nonnegative factorization (U, V ) of M as follows.The (r u − 1)-dimensional polytope T with k vertices (corresponding to the columns of U ) is nested between a inner (r − 1)-dimensional polytope conv(S) (where each point in S corresponds to a column of M ) and a outer (r u − 1)-dimensional polytope P u .Let us use the matrix M and its nonnegative factorization (U, V ) of Example 2 as an illustration: rank(M ) = 3 so that P m is a two-dimensional polytope and contains the set of points S, while rank(U ) = 4 and defines a three-dimensional polytope T containing S, see Figure 2.\n\n\nUpper Bound for the Restricted Nonnegative Rank\n\nFrom the geometric interpretation introduced in the previous paragraph, we can now give the main result of this section.The idea is the following: using notations of Section 3.1, we know that (1) the polytope T (whose vertices correspond to the columns of U ) contains the (lower dimensional) set of points S (corresponding to the columns of M ), and (2) S is contained in P m (which corresponds to the set of stochastic vectors in the column space of M ).Therefore, the intersection between T and P m must also contain S, i.e., the intersection T ∩ P m defines a polytope which (1) is contained in the column space of M , and (2) contains S. Hence its vertices provide a feasible solution to the RNR problem, and an upper bound for the restricted nonnegative rank can then be computed.\n\nIn other words, any nonnegative factorization (U, V ) of a nonnegative matrix M can be used to construct a feasible solution to the restricted nonnegative rank problem.One has simply to compute the intersection of the polytope generated by the columns of U with the column space of M (which can obviously increase the number of vertices).Proof.Let x 1 , x 2 , . . ., x v be the v vertices of T ∩ P m and note X = [x 1 x 2 . . .x v ] which has rank at most r (since it is contained in the (r − 1)-dimensional polyhedron P m ).By construction, B m (:, j) ∈ T ∩ P m = conv(X) 1 ≤ j ≤ n.\n\nTherefore, there must exist a matrix V * ∈ R v×n column stochastic such that\nB m = XV * , implying that M = f u (B m ) = f u (XV * ) = f u (X)V * = U * V * ,\nwhere U * = f u (X) ∈ R m×v is nonnegative since x i ∈ P m ⊂ P u ∀i, and U * has rank r since M = U * V * implies that its rank is at least r and U * = f u (X) that it is at most r.The pair (U * , V * ) is then a feasible solution of the corresponding RNR problem for M and therefore rank * + (M ) ≤ v = # vertices(T ∩ P m ).\n\n\nLower Bound for the Nonnegative Rank based on the Restricted Nonnegative Rank\n\nWe can now obtain a lower bound for the nonnegative rank based on the restricted nonnegative rank.Indeed, if we consider an upper bound on the quantity # vertices(T ∩ P m ) that increases with the nonnegative rank (i.e., the number of vertices of T ), we can reinterpret Theorem 4 as providing a lower bound on the nonnegative rank.For that purpose, define the quantity faces(n, d, k) to be the maximal number of k-faces of a polytope with n vertices in dimension d.\nm = {x ∈ R ru−1 | f u (x) ∈ col(M )}, we have P m = Q m ∩ P u and since T ⊂ P u , P m ∩ T = Q m ∩ P u ∩ T = Q m ∩ T.\nSince Q m is (r − 1)-dimensional, the number of vertices of T ∩ Q m is bounded above by the number of (r u − r)-faces of T (in a (r u − 1)-dimensional space, (r u − r)-faces are defined by r − 1 equalities), we then have\nrank * + (M ) ≤ # vertices(T ∩ P m ) = # vertices(T ∩ Q m ) ≤ faces(r + , r u − 1, r u − r).\nNotice that for r u = r, faces(r + , r − 1, 0) = r + which gives r + = rank * + (M ) as expected.Finally, taking the maximum over all possible values of r ≤ r u ≤ r + gives the above bound (3.5).\n\nWe introduce for easier reference a function φ corresponding to the upper bound in Theorem 5, i.e., φ(r, r + ) = max\nr≤ru≤r + faces(r + , r u − 1, r u − r).\nClearly, when r is fixed, φ is an increasing function of its second argument r + , since faces(n, d, k) increases with n.Therefore inequality rank * + (M ) ≤ φ(r, r + ) from Theorem 5 implicitly provides a lower bound on the nonnegative rank r + that depends on both rank r and restricted nonnegative rank rank * + (M ).\n\nExplicit values for function φ can be computed using a tight bound for faces(n, d, k) attained by cyclic polytopes [37,p.257,Corollary 8.28]\nfaces(n, d, k − 1) = d 2 i=0 * d − i k − i + i k − d + i n − d − 1 + i i ,\nwhere * denotes a sum where only half of the last term is taken for i = d 2 if d is even, and the whole last term is taken for i\n= ⌊ d 2 ⌋ = d−1 2 if d is odd.\nAlternatively, simpler versions of the bound can be worked out in the following way: Theorem 6.The upper bound φ(r, r + ) on the restricted nonnegative rank of a nonnegative matrix M with r = rank(M ) and r + = rank + (M ) satisfies φ(r, r + ) = max\nr≤ru≤r + faces(r + , r u − 1, r u − r) ≤ max r≤ru≤r + r + r u − r + 1 ≤ r + ⌊r + /2⌋ ≤ 2 r + 2 πr + ≤ 2 r + .\nProof.The first inequality follows from the fact that faces(n, d, k − 1) ≤ n k , since any set of k distinct vertices defines at most one k − 1-face.The second follows from the maximality of central binomial coefficients.The third is a standard upper bound on central binomial coefficients, and the fourth is an even cruder upper bound.\n\nWe will see in Section 4 that some of these weaker bounds correspond to existing results from the literature.\n\nWhen matrix M is symmetric, the bound can be slightly strengthened, leading to a different function φ ′ : Corollary 2. Given a symmetric matrix M with r + = rank + (M ), r = rank(M ) and r + ≥ r + 1, we have rank * + (M ) ≤ max\nr≤ru≤r + −1 faces(r + , r u − 1, r u − r) = φ ′ (r, r + ) ≤ φ(r, r + ).\nProof.We have seen in Lemma 3 that for symmetric matrices r u = r + implies rank * + (M ) = r + .Therefore, in case r + ≥ r + 1, one can strengthen the result of Theorem 5 and only consider the range r ≤ r u ≤ r + − 1.\n\n\nImprovements in the rank-three case\n\nIt is possible to improve the above bound by finding better upper bounds for # vertices(T ∩ P m ) in Equation (3.4).For example, since two-dimensional polytopes (i.e., polygons) have the same number of vertices (0-faces) and edges (1-faces), we have for rank(M ) = 3 that # vertices(T ∩ P m ) = #edges(T ∩ P m ).\n\nUsing the same argument as in Theorem 5, the number of edges of T ∩ P m is bounded above by the number of (r u − r + 1)-faces of T (defined by r − 2 equalities) leading to Corollary 3. The restricted nonnegative rank of a rank-three nonnegative matrix M with r + = rank + (M ) can be bounded above with\nrank * + (M ) ≤ max 3≤ru≤r + min i=0,1 faces(r + , r u − 1, r u − 3 + i) ≤ φ(3, r + ).(3.6)\nThe minimum taken between 0 and 1 simply accounts for the two possible cases, i.e., the bound based on # vertices(T ∩ P m ) with i = 0 as in Theorem 5, or based on #edges(T ∩ P m ) with i = 1.A similar bound holds in the symmetric case.\n\n\nApplications\n\nSo far, we have not provided explicit lower bounds for the nonnegative rank.As we have seen, inequalities (3.5) and (3.6) can be interpreted as implicit lower bounds on the nonnegative rank r + , but have the drawback of depending on the restricted nonnegative rank, which cannot be computed efficiently unless the rank of the matrix is smaller than 3 (Theorems 2 and 3).\n\nNevertheless, we provide in this Section explicit lower bounds for the nonnegative rank of slack matrices (Section 4.1) and linear Euclidean distance matrices (Section 4.2), cf.introduction of Section 3.These bounds are derived by showing that the restricted nonnegative rank of such matrices is maximum, i.e., it is equal to the number of columns of these matrices (cf.Lemma 1).\n\n\nSlack Matrices\n\nLet start with a simple observation: it is easy to construct a m × n matrix of rank r < min(m, n) with maximum restricted nonnegative rank n:\n\n1. Take any (r − 1)-dimensional polytope P with n vertices.\n\n\nConstruct a NPP instance with S = vertices(P ).\n\n3. Compute the corresponding matrix M in the equivalent RNR instance.\n\nClearly, the unique solution for NPP is T = P = conv(S) and therefore the matrix M in the corresponding RNR instance must satisfy: rank * + (M ) = # vertices(T ) = n; see Example 1 for an illustration with the three-dimensional cube.\n\nRemark 1.The matrices constructed as described above also satisfy rank(M ) < rank + (M ).\n\n\nOtherwise rank *\n\n+ (M ) = rank + (M ) = rank(M ) < min(m, n) which is a contradiction.This is interesting because it is nontrivial to construct matrices with rank(M ) < rank + (M ) [28].In fact, it is easy to check that generating randomly two nonnegative matrices U and V of dimensions m × r and r × n respectively, and constructing M = U V will generate a matrix M of rank r will probability one.\n\nIn the context of compact formulations (cf.Section 1), the aim is to express a polytope Q with fewer constraints by using some additional variables, i.e., find a lifting of polynomial size.A possible way to do that is to compute a nonnegative factorization of the slack matrix S M of Q [36] (see Equation (1.1)).The next theorem states that the restricted nonnegative rank of any slack matrix S M ∈ R f ×v + is maximum (f is the number of facets of Q, v its number of vertices), i.e., rank * + (S M ) = v.This is directly related to the above observation: the slack matrix of a polytope Q corresponds to a NPP instance where Q is the outer polytope and its vertices are the points defining the inner polytope.Notice that the restricted nonnegative rank used as an upper bound for the nonnegative rank is useless in this case.\nTheorem 7. Let Q = {x ∈ R q | F x ≥ h, Ex = g} be a p-dimensional polytope with v vertices, v > 1, and let S M (Q) be its slack matrix, then rank * + (S M (Q)) = v.\nProof.In order to prove this result, we first construct a bijective transformation L between Q and a full-dimensional polytope P ⊂ R p .The vertices of P can then be easily constructed from the vertices of Q, which allows to show that P and Q share the same slack matrix.Finally, using the result of Theorem 1, we show that the slack matrix of P has maximum restricted nonnegative rank.\n\nSince Q is a p-dimensional polytope, there exists a polytope P ⊂ R p and a bijective affine transformation\nL : Q → P : x → L(x) = Ax + b and L −1 : P → Q : y → L −1 (y) = A † y − A † b, such that P = L(Q) and Q = L −1 (P ) (where A ∈ R p×q has full rank, A † ∈ R q×p is its right inverse and b ∈ R p ). By construction, P = {y ∈ R p | y = L(x), x ∈ Q} = {y ∈ R p | L −1 (y) ∈ Q}, = {y ∈ R p | F L −1 (y) ≥ h, EL −1 (y) = g}, = {y ∈ R p | F A † y ≥ h + F A † b},\nsince the equalities EL −1 (y) = g must be satisfied for all y ∈ R p since P is full-dimensional.\n\nNoting C = F A † and d = h + F A † b, we have P = {y ∈ R q | Cy ≥ d}.Finally, we observe that 1.Noting v i 's the v vertices of Q, we have that L(v i )'s define the v vertices of P .This can easily be checked since L is bijective (∀y ∈ P, ∃!x ∈ Q s.t.y = L(x) and vice versa).\n\n2. P can be taken as the outer polytope of a NPP instance, i.e., P is bounded and (C d) is full rank.P is bounded since Q is.C is full rank because P has at least one vertex (v > 1).If (C d) was not full rank, then ∃z ∈ R p such that d = Cz, implying that z ∈ P .Since P has at least two vertices (v > 1), ∃y ∈ P with y = z, and one can check that y + α(y − z) ∈ P ∀α ≥ 0. This is a contradiction because P is bounded.\n\n3. The slack matrix of P is equal to the slack matrix of Q:\nS M (P ) = CL(V ) − [d . . . d] = F A † L(V ) − [h + F A † b . . . h + F A † b] = F (A † L(V ) − [A † b . . . A † b]) − [h . . . h] = F L −1 (L(V )) − [h . . . h] = F V − [h . . . h] = S M (Q), where V = [v 1 v 2 . . . v v ]\nis the matrix whose columns are the vertices of Q, and\nL(V ) = [L(v 1 ) L(v 2 ) . . . L(v v )]\nis the matrix whose columns are the vertices of P .\n\n4. The NPP instance with P as the outer polytope and its v vertices L(v i )'s as the set of points S defining the inner polytope has a unique and optimal solution T = P = conv(S) with v vertices.The matrix M in the RNR instance corresponding to this NPP instance is given by the slack matrix S M (P ) of P implying that its restricted nonnegative rank is equal to v (cf.Theorem 1).\n\nWe can conclude that rank * + (S M (Q)) = v.\n\nWe can now derive a lower bound on the nonnegative rank of a slack matrix and on the size of an extended formulation, by combining Theorem 5 (cf.Equation (3.5)), Theorem 6, Theorem 7 and the result of Yannakakis [36] (see also Section 1).\n\nCorollary 4. Let P be a polytope with v vertices and let S M ∈ R f ×v + be its slack matrix of rank r (i.e., P has dimension r − 1), then\nv ≤ φ(r, r + ) = φ r (r + ) ≤ max r≤ru≤r + r + r u − r + 1 ≤ r + ⌊r + /2⌋ ≤ 2 r + ,(4.1)\nwhere r + = rank + (S M ).Therefore, the minimum size s of any extended formulation of P follows\ns = Θ(r + + n) ≥ Θ(φ −1 r (v)) ≥ Θ(log 2 (v))\n,\nwhere φ −1 r (•) is the inverse of the nondecreasing function φ r (•) = φ(r, •).\nThe last bound 2 r + from Equation (4.1) is the one of Goemans [22, Theorem 1] (see introduction of Section 3), and therefore Corollary 4 provides us with an improved lower bound, even though it is still in Ω(log 2 (v)).It is actually not possible to provide an unconditionally better bound (i.e., without making additional hypothesis on the polytope P ): since Goemans showed that the size of any LP formulation of the permutahedron (with v = n! vertices) must be in Ω(n log(n)), this implies that the nonnegative rank of its slack matrix is in Ω(n log(n)).\n\n\nLinear Euclidean Distance Matrices\n\nLinear Euclidean distance matrices (linear EDM's) are defined by\nM (i, j) = (a i − a j ) 2 , 1 ≤ i, j ≤ n, for some a ∈ R n .(4.2)\nIn this section we assume a i = a j i = j, so that these matrices have rank three.Linear EDM's were used in [2] to show that the nonnegative rank of a matrix with fixed rank (rank 3 in this case) can be made as large as desired (while increasing the size of the matrix), implying that an upper bound for the nonnegative rank of a matrix based only on the rank cannot exist.We refer the reader to [25] and the references therein for detailed discussions about Euclidean distance matrices, and related applications.\n\n\nRestricted Nonnegative Rank of Linear Euclidean Distance Matrices\n\nWe first show that the restricted nonnegative rank of linear EDM's is maximum, i.e., it is equal to their dimension n.Proof.Let P , S and T be the polygons defined in the two-dimensional NPP instance corresponding to the RNR instance of M (cf.Theorem 1).Aggarwal et al. [1] observe that if two points in S are on different edges of P , they define a polygon with the boundary of P (see each dark regions in Figure 3) which must contain a point of the solution T .Otherwise these two points could not be contained in T (see also Section 2.2.1).Therefore if each point of S is on a different edge of the boundary of P , Remark 2. This result does not hold for higher rank matrices.For example, the matrix\nM =        0        = U V, with U =         0 0 4 5 1 1 0 1 3 0 4 0 0 1 1 4 1 0 0 1 1 3 1 0 0 0 5 4 0 1         , V =      \n2 0 0 0 0 1 5 3 1 0 0 0 0 0 1 1 0 0 0 0 0 1 3 5 0 1 0 0 1 0\n     \n, has rank(M ) = 4 and rank * + (M ) ≤ 5 since rank(U ) = 4. Therefore we cannot conclude that higher dimensional Euclidean distance matrices have maximal restricted nonnegative rank.\n\n\nNonnegative Rank of Linear Euclidean Distance Matrices\n\nSince linear EDM's are rank-three symmetric matrices, one can combine the results of Theorem 8 with Corollary 3 (cf.Equation (3.6)) and Corollary 2 in order to obtain lower bounds for the nonnegative rank of linear EDM's.\n\nCorollary 5.For any linear Euclidean distance matrix M , we have\nrank * + (M ) = n ≤ max 3≤ru≤r + −1 min i=0,1 faces(r + , r u − 1, r u − r + i) ≤ max 3≤ru≤r + −1 faces(r + , r u − 1, r u − r) = φ ′ (r, r + ) ≤ r + ⌊r + /2⌋ ≤ 2 r + .\nWe observe that our results (first two inequalities above, from Theorem 5 and Corollary 3) strengthen the bounds from Equations (3.2) (Beasley and Laffey [2]) and (3.3) (Goemans [22]).Figure 4 displays the growth of the different bounds, and Table 1 compares the lower bounds on the nonnegative rank for small values of n.For example, for a linear EDM to be guaranteed to have 3).This is a significant improvement, even though all the bounds are still of the same order with r + ∈ Ω(log(n)).\n\nIs it possible to further improve these bounds?Beasley and Laffey [2] conjectured that the nonnegative rank of linear EDM's is maximum, i.e., it is equal to their dimension.Lin and Chu [28,\nM (i, j) = (i − j) 2 , 1 ≤ i, j ≤ 6,\ngives rank + (M ) = 5.In fact,  Example 3 proves that linear EDM's do not necessarily have a nonnegative rank equal to their dimension.In fact, we can even show that Theorem 9. Linear EDM's of the following form\nM =        0        =         5 0 4 0 1 3 0 1 1 0 1 0 0 4 1 0 1 0 4 1 0 3 1 1 0 0 5 4 0 1               0 0 0 1 3 5 5 3 1 0 0 0 0 0 1 1 0 0 1 0 0 0 0 1 0 1 0 0 1 0       ,(4.3)=         5 0 1 0 0 3 0 0 1 0 1 0 0 0 1 0 1 0 0 1 0 3 0 1 0 0 5 1 0 0               0 0 0 1 3 5 5 3 1 0 0 0 0 1 4 4 1 0 1 0 1 1 0 1 4 1 0 0 1 4       , (4M n (i, j) = (i − j) 2 1 ≤ i, j ≤ n, satisfy rank + (M n ) ≤ 2 + n 2 ,\nwhere ⌈x⌉ is the smallest integer greater or equal to x.\n\nProof.Let first assume that n is even and define\nU =                   n − 1 0 n − 3 0 . . . . . . I n/2 3 0 1 0 0 1 0 3 . . . . . . P n/2 0 n − 3 0 n − 1                   , V =                   0 n − 1 0 n − 3 . . . . . . M n/2 0 3 0 1 1 0 3 0 . . . . . . P n/2 M n/2 n − 3 0 n − 1 0                   T ,\nwhere I m is the identity matrix of dimension m and P m is the permutation matrix with P m (i, j) = I m (i, m − j + 1) ∀i, j; see Equation (4.4) for an example when n = 6.One can check that\nM n = U V = M n/2 A + P n/2 M n/2 A T + P n/2 M n/2 M n/2 , with A =        n − 1 n − 3 . . . 3 1               1 3 . . . n − 3 n − 1        T .\nIf n is odd, we simply observe that rank\n+ (M n ) ≤ rank + (M n+1 ) ≤ 2 + n+1 2 = 2 + ⌈ n 2 ⌉, since M n is a submatrix of M n+1 [12].\nRemark 3. In the construction of Theorem 9, one can check that rank(V ) = 4 and the factorization can then be interpreted as a nested polytopes problem (corresponding to M T = V T U T ) in which the outer polytope has (only) dimension 3. Therefore, there is still some room for improvement and rank + (M n ) is probably (much?) smaller.\n\nThis example also demonstrates that, in some cases, the structure of small size nonnegative factorizations (in this case, the one from Example 3) can be generalized to larger size nonnegative factorization problems.This might open new ways to computing large nonnegative factorizations.\n\nIn Example 3, the nonnegative rank is smaller than the restricted nonnegative rank because there exists a higher dimensional polytope with only 5 vertices whose convex hull encloses the 6 vertices defined by the columns of M .Nested polytopes instance corresponding to the RNR instance with M given by Example 3 and the two above solutions are illustrated on Figures 2 and 5 respectively (note that they are transposed to each other, but correspond to different solutions of the NPP instance), see Section 3.1.Notice that the second solution (Figure 5) completely includes the outer polytope P ; therefore, the nonnegative rank of any nonnegative matrix with the same column space as the matrix M will be at most 5.\n\nThe solutions of the above nonnegative rank problem have been computed with standard nonnegative matrix factorization algorithms [26,10] and, in general, the optimal solution is found after 10 to 100 restarts of these algorithms10 .\n\nWe also observed than when the vectors a in Equation (4.2) used to construct the linear EDM's are chosen randomly, the nonnegative rank seems to be maximal (i.e., equal to the dimension of the matrix).In fact, even with 1000 restarts of the NMF algorithms with several random linear EDM's (of dimensions up to n = 12, and using a factorization rank of n − 1), every stationary point we could Table 1 implies that linear EDM's with n ≤ 5 satisfy this property 11 .\n\nWe adapt the conjecture of Beasley and Laffey [2] as follows:\n\nConjecture 1. Random linear EDM's of dimension n are such that rank(M ) = 3 and rank + (M ) = n with probability one.\n\n\nThe Nonnegative Rank of a Product\n\nBeasley and Laffey [2] proved that for A = BC with A, B and C ≥ 0 rank + (A) ≤ rank(B) rank(C).\n\nIn particular, rank + (A 2 ) ≤ rank(A) 2 .They also conjectured that for a nonnegative n × n matrix A, rank + (A 2 ) ≤ rank(A), which we prove to be false with the following counterexample (based on a circulant matrix)  1 1 0 0 0 0 0 0 0 1 1 0 0 0 0 0 0 0 1 1 0 0 0 0 0 0 0 1 1 0 0 0 0 0 0 0 1 1 0 0 0 0 0 0 0 1 1 0 0 0 0 0 0 0 1 1 1 0 0 0 0 0 0 1\nA =             0 1 a 1 + a 1 + a a 1 0 0 0 1 a 1 + a 1 + a a 1 1 0 0 1 a 1 + a 1 + a a a 1 0 0 1 a 1 + a 1 + a 1 + a a 1 0 0 1 a 1 + a 1 + a 1 + a a 1 0 0 1 a a 1 + a 1 + a a 1 0 0 1 1 a 1 + a 1 + a a 1 0 0             , (4            ,\nwe have that B = AR is symmetric, has rank 3 and only has zeros on its diagonal.By Theorem\nA = U V =             1 0 0 1 0 a a 0 0 0 1 a + 1 1 1 0 0 0 a 0 a − 1 1 0 0 1 0 1 a 0 1 0 1 0 a + 1 0 a 0 0 0 a 1 1 0 0 0 1 a − 1 0 1                    \n0 0 0 1 0 0 1 0 1 0 0 0 0 1 a a 1 1 0 0 0 0 0 0 0 1 a a 1 0 0 0 0 0 1 0 0 0 0 1 0 0 0 0 1 1 0 0  This extended formulation is actually a particular case of a construction proposed by Ben-Tal and Nemirovski [3] to find an extended formulation of size O(k) for the regular 2 k -gon in two dimensions.\n        ,(4.6)\n\nConcluding Remarks\n\nIn this paper, we have introduced a new quantity called the restricted nonnegative rank, whose computation amounts to solving a problem in computational geometry consisting of finding a polytope nested between two given polytopes.This allowed us to fully characterize its computational complexity (see Table 2).This geometric interpretation and the relationship between the nonnegative rank and the restricted nonnegative rank also let us derive new improved lower bounds for the nonnegative rank, in particular for slack matrices and linear Euclidean distance matrices.This also allowed us to provide counterexamples to two conjectures concerning the nonnegative rank.\n\nWe conclude the paper with the following conjecture: Conjecture 2. Computing the nonnegative rank and the corresponding nonnegative factorization of a nonnegative matrix is NP-hard when the rank of the matrix is fixed and greater or equal to 4 (or even possibly 3).\n\nIn fact, we have shown that computing a nonnegative factorization amounts to solving a nested polytopes problem in which the outer polytope might live in a higher dimensional space.Moreover, this space is not known a priori (we just know that it contains the columns of the matrix to be factorized, cf.Section 3.1).Therefore, it seems plausible to assume that this problem is at least as difficult than the restricted nonnegative rank computation problem in which the outer polytope lives in the same low-dimensional space and is known.Moreover, even in the rank-three case, even though the inner polytope has dimension two, the outer polytope might have any dimension (up to the dimensions of the matrix; see, e.g., Figures 2 and 5); therefore, it seems that the nonnegative rank computation might also be NP-hard if the rank of the matrix is three.Notice that, when rank * + (M ) ≤ 5, Equation (3.5) implies rank + (M ) = rank * + (M ) so that the nonnegative rank can be computed in polynomial-time in this particular case.\n\nTable 2 recapitulates the complexity results for the restricted nonnegative rank and the nonnegative rank of a nonnegative matrix M .Table 2: Complexity of restricted nonnegative rank and nonnegative rank computations.\n\nFigure 1 :\n1\nFigure 1: Illustration of the algorithm of Aggarwal et al. [1].\n\n\n\n\nproposes a randomized algorithm finding a polytope T with at most r * + O(5d ln(r * + )) vertices and running in O(r * + 2 p 1+δ ) expected time (with r * + = rank * + (M ), d = rank(M ) − 1 and δ is any fixed value > 0).\n\n\nExample 2 .\n2\n5 and therefore have to consider matrices of size at least 6-by-6 with rank * + (M ) = 6.Let us consider the following matrix M and the rank-5 nonnegative factorization (U, V ),\n\n\nLemma 4 .\n4\nLet A ∈ R m×n + and B ∈ R m×r + , then rank * + (A + B) rank * + (A) + rank * + (B).\n\n\n\n\nProof.Take M , U and V from Example 2 and construct A = U (:, 1:3)V (1:3, :) with rank * + (A) = 3 (since rank(A) = 3), B = U (:, 4:5)V (4:5, :) with rank * + (B) = 2 (trivial) and rank * + (A + B) = 6 since A + B = M .Lemma 5. Let A ∈ R m×n + and B ∈ R m×r + , then rank * + ([A B]) rank * + (A).where [A B] ∈ R m×(n+r) + denotes the concatenation of the columns of A and B. Proof.Let us take M , U and V from Example 2, and construct A = M and B = U (:, 1) with rank * + ([A B]) ≤ 5 since rank([A B]) = 4 (this can be checked easily) and [A B] = U [V e 1 ] with rank(U ) = 4 (where e i denotes the i th column of the identity matrix of appropriate dimension).Lemma 6.Let B ∈ R m×r + and C ∈ R r×n + , then rank * + (BC) min(rank * + (B), rank * + (C)).Proof.See Example 2 in which rank * + (M ) = 6 and rank * + (U ) ≤ 5 by Lemma 1.\n\n\nTheorem 4 .Figure 2 :\n42\nFigure 2: Illustration of the solution from Example 2 as a nested polytopes problem, with rank(M ) = 3 < rank(U ) = 4 < rank + (M ) = 5 < rank * + (M ) = 6 = n.See Appendix A.2 for the code used to perform the reduction.\n\n\nTheorem 5 .\n5\nThe restricted nonnegative rank of a nonnegative matrix M with r = rank(M ) and r + = rank + (M ) can be bounded above byrank * + (M ) ≤ max r≤ru≤r + faces(r + , r u − 1, r u − r).(3.5)Proof.Let (U, V ) be a rank-r + nonnegative factorization of M with rank(U ) = r u .Using notations of Section 3.1 and the result of Theorem 4, rank * + (M ) is bounded above by the the number of vertices of T ∩ P m .Defining Q\n\n\nDefinition 2 .\n2\nThe columns of a matrix M have disjoint sparsity patterns if and only ifs i s j , ∀i = j,wheres i = {k|M (k, i) = 0}is the sparsity pattern of the i th column of M .Theorem 8. Let M be a rank-three nonnegative square matrix of dimension n whose columns have disjoint sparsity patterns, then rank * + (M ) = n.In particular, linear EDM's have this property.\n\n\nFigure 3 :\n3\nFigure 3: Illustration of the restricted nonnegative rank of a linear EDM of dimension 5.The solution T must contain a point in each dark region, that is rank * + (M ) = |T | = |S| = 5.\n\n\nFigure 4 :\n4\nFigure 4: Comparison of the different bounds for symmetric n-by-n matrices, with rank * + (M ) = n.\n\n\nFigure 5 :Question 1 .\n51\nFigure 5: Illustration of the solution from Equation (4.4) as a nested polytopes problem, based on a linear EDM with rank(M ) = 3 < rank(U ) = 4 < rank + (M ) = 5 < rank * + (M ) = 6 = n.\n\n\n√ 2 .\n2\nIn fact, one can check that rank(A) = 3 and rank + (A 2 ) = 4: indeed, rank * + (A 2 ) = 4 can be computed with the algorithm of Aggarwal et al.[1] (see Figure6for an illustration) and, by Corollary 1, rank + (A 2 ) = rank * + (A 2 ) since rank * + (A 2 ) ≤ rank(A 2 ) + 1 = 4.\n\n\nFigure 6 :Remark 4 . 2 .\n642\nFigure 6: Illustration of a NPP instance corresponding to A 2 and an optimal solution T , cf.Equation (4.5).See Appendix A.1 for the code used to perform the reduction.\n\n\nFigure 7 :\n7\nFigure 7: Illustration of a nested polytopes instance corresponding to A and an optimal solution, cf.Equations (4.5) and (4.6).\n\n\nFigure 7 2 2\n72\ndisplays the corresponding nested polytopes problem, see Section 3.1 and Appendix A.2.It is interesting to observe that, from this nonnegative factorization, one can obtain an extended formulation (lifting) Q of the regular octagonP = {x ∈ R 2 | Cx ≤ d}, defined as Q = {(x, y) ∈ R 2 × R 6 | Cx + U y = d, y ≥ 0}, with ∀i, see Equation (1.2).Since the system of equalities Cx + U y = d only defines 4 linearly independent equalities (rank([C U ]) = 4), the description of Q can then be simplified and expressed with 4 variables and 6 inequality constraints.\n\n\nr\n\n= rank(M ) r * + = rank * + (M ) r + = rank + (M ) r not fixed NP-hard NP-hard [33] r ≥ 4 fixedNP-hard (Theorem 3) NP-hard?r = 3 polynomial (Theorem 2) polynomial if r * + ≤ 5 otherwise NP-hard?r ≤ 2 trivial (= r) trivial (= r)[32]\n\n\nTable 1 :\n1\nComparison of the lower bounds for the nonnegative rank of linear EDM's.Theorem 3.1] claim to have proved that this equality always holds, which cannot be correct because of the following example 9 .\nExample 3. Taking M ∈ R 6×6 +with\n\n\n\n8, rank * + (B) = 8.Using Table 1, we have rank + (B) ≥ 6. Moreover rank + (AR) ≤ min(rank + (A), rank + (R)), implying that 6 ≤ rank + (B) ≤ rank + (A).Finally, rank + (A) = 6 because\n\nEven though the optimal low-rank approximation of a nonnegative matrix might not necessarily be nonnegative (except in the rank-one case), it is often the case in practice[24].\nThis can be generalized to polyhedra[13].\nSee also Appendix A.1 where a MATLAB ® code is provided.\nWang generalized the result for non-convex polygons[34]. Bhadury and Chandrasekaran propose an algorithm to compute all possible solutions[6].\nTaking the polar of the three nested polytopes exchanges the roles of the inner and outer polytopes, and transforms face descriptions into vertex descriptions, so that the description of the inner and outer polytopes is unchanged but the intermediate polytope is now described by its vertices.\nThe problem is actually trivial because each vertex of the inner polygon S is located on a different edge of the polygon P , so that they define with the boundary of P 6 disjoint polygons tangent to S. This implies that rank * + (M ) = 6, cf. Section 2.2.1. This matrix is actually a linear Euclidean distance matrix which will be analyzed later in Section 4.2.\nThis can be computed explicitly, e.g., with a brute force approach. Note however that finding the biclique with the maximum number of edges is a combinatorial NP-hard optimization problem[31]. It is closely related to a variant of the approximate nonnegative factorization problem[20].\nIn their proof, they actually show that the restricted nonnegative rank is maximum (not the nonnegative rank), see Theorem 8. In fact, they only consider the case when the vertices of the solution T (corresponding to the columns of U ) belong to the low-dimensional affine subspace defined by S (corresponding to the column of M ) in the NPP instance.\nThese algorithms are based on standard nonlinear optimization schemes (rescaled gradient descent and blockcoordinate descent), and require initial matrices (U, V ), which were randomly generated.\nRecall we assumed ai = aj ∀i = j so that such linear EDM's have rank three[2].\nAcknowledgmentsWe thank Mathieu Van Vyve and Didier Henrion for helpful discussions and advice.We also thank Santanu Dey for pointing our attention to the paper of Yannakakis[36].A MATLAB CodesIn this Appendix, codes for two specific reductions are provided:A.1The reduction from any RNR instance of a rank-three matrix to a two-dimensional NPP instance.A.2The geometric interpretation and the visualization of a nonnegative factorization M = U V when rank(M ) = 3 and rank(U ) = 4 as a solution of a nested polytopes problem, where the inner polytope S is two-dimensional and the outer polytope P is three-dimensional (see Section 3.1).A.1 RNR to NPP when rank(M) = 3The following code has been used to generate Figure6.A.2 3-D representationThe following code has been used to generate Figures2, 5 and 7. plot3(P(1,K(i,1:2)),P(2,K(i,1:2)),P(3,K(i,1:2)),'m','linewidth',2); hold on; plot3(P(1,K(i,2:3)),P(2,K(i,2:3)),P(3,K(i,2:3)),'m','linewidth',2);\nFinding minimal convex nested polygons, Information and Computation. A Aggarwal, H Booth, J O'rourke, S Suri, 198983\n\nReal rank versus nonnegative rank. L B Beasley, T J Laffey, Linear Algebra and its Applications. 431122009\n\nOn polyhedral approximations of the second-order cone. A Ben-Tal, A Nemirovski, Mathematics of Operations Research. 2622001\n\nRank factorization of nonnegative matrices. A Berman, R J Plemmons, SIAM Review. 1536551973\n\nAlgorithms and applications for approximate nonnegative matrix factorization. M W Berry, M Browne, A N Langville, V P Pauca, R J Plemmons, Computational Statistics and Data Analysis. 522007\n\nFinding The Set of All Minimal Nested Convex Polygons. J Bhadury, R Chandrasekaran, Proceedings of the 8th Canadian Conference on Computational Geometry. the 8th Canadian Conference on Computational Geometry1996\n\nGeometric mixture analysis of imaging spectrometry data. J W Boardman, Proc. IGARSS. IGARSSPasadena, Calif19944\n\nProbability matrices, non-negative rank, and parameterization of mixture models. E Carlini, F Rapallo, Linear Algebra and its Applications. 2010\n\nLow-Dimensional Polytope Approximation and Its Applications to Nonnegative Matrix Factorization. M T Chu, M M Lin, SIAM J. Sci. Comput. 3032008\n\nHierarchical ALS Algorithms for Nonnegative Matrix and 3D Tensor Factorization. C Cichocki, R Zdunek, S Amari, Lecture Notes in Computer Science. 46662007Springer\n\nAlgorithms for polytope covering and approximation. K L Clarkson, Proceedings of the Third Workshop on Algorithms and Data Structures. the Third Workshop on Algorithms and Data Structures1993\n\nNonnegative ranks, Decompositions and Factorization of Nonnegative Matrices. J E Cohen, U G Rothblum, Linear Algebra and its Applications. 1901993\n\nExtended formulations in combinatorial optimization. M Conforti, G Cornuéjols, G Zambelli, A Quarterly Journal of Operations Research. 412010\n\nMinimum-volume tranforms for remotely sensed data. M D Craig, IEEE Transactions on Geoscience and Remote Sensing. 3231994\n\nApproximation schemes in computational geometry. G Das, 1990University of Wisconsin-MadisonPhD thesis\n\nOn the Complexity of Optimization Problems for Three-Dimensional Convex Polyhedra and Decision Trees. G Das, M Goodrich, Computational Geometry: Theory and Applications. 81997\n\nThe Complexity of Minimum Convex Nested Polyhedra. G Das, D A Joseph, Proc. of the 2nd Canadian Conference on Computational Geometry. of the 2nd Canadian Conference on Computational Geometry1990\n\nThe boolean rank of zero-one matrices. D De Caen, D A Gregory, N J Pullman, Proc. 3rd Caribbean Conference on Combinatorics and Computing. 3rd Caribbean Conference on Combinatorics and Computing1981\n\nWhen does non-negative matrix factorization give a correct decomposition into parts?. D Donoho, V Stodden, Advances in Neural Information Processing. MIT Press200316\n\nNonnegative Factorization and The Maximum Edge Biclique Problem. CORE Discussion paper. N Gillis, F Glineur, 2008/64, 2008\n\nDimensionality reduction, classification, and spectral mixture analysis using nonnegative underapproximation. N Gillis, R J Plemmons, SPIE conference. Orlando20107695\n\nSmallest compact formulation for the permutahedron. M X Goemans, Talk at ISMP. 2009\n\nMultispectral and hyperspectral image analysis with convex cones. A Ifarraguerri, C.-I Chang, IEEE Transactions on Geoscience and Remote Sensing. 3721999\n\nNon-negative matrix factorization: Ill-posedness and a geometric algorithm. B Klingenberg, J Curry, A Dougherty, Pattern Recognition. 4252009\n\nN Krislock, H Wolkowicz, CORR 2010-2010-06Euclidean Distance Matrices and Applications (survey), tech. report. 2010University of Waterloo\n\nLearning the Parts of Objects by Nonnegative Matrix Factorization. D D Lee, H S Seung, Nature. 4011999\n\nT Lee, A Shraibman, Lower Bounds in Communication Complexity, Foundations and Trends in Theoretical Computer Science. 2009\n\nOn the nonnegative rank of Euclidean distance matrices. M M Lin, M T Chu, Linear Algebra and its Applications. 43332010\n\nSeparation and Approximation of Polyhedral Surfaces. J S B Mitchell, S Suri, Operations Research Letters. 111992\n\nJ Orlin, Contentment in graph theory: Covering graphs with cliques, Indagationes Mathematicae (Proceedings). 197780\n\nThe maximum edge biclique problem is NP-complete. R Peeters, Discrete Applied Mathematics. 13132003\n\nRank factorization of nonnegative matrices. L B Thomas, SIAM Review. 1631974\n\nOn the complexity of nonnegative matrix factorization. S A Vavasis, SIAM Journal on Optimization. 202009\n\nFinding Minimal Nested Polygons. C A Wang, BIT. 1991\n\nFractional biclique covers and partitions of graphs. V Watts, Electronic journal of combinatorics. 13R742006\n\nExpressing Combinatorial Optimization Problems by Linear Programs. M Yannakakis, Computer and System Sciences. 431991\n\nG M Ziegler, Lectures on Polytopes. Springer-Verlag19952plot3(P(1,K(i,[1 3])),P(2,K(i,[1 3])),P(3,K(i\n\nCompute and display the columns of Bp (M = ABp) and draw S Bp = A\\M. \n\nK = Convhull, Bp. 1\n\nBp(3,K),'bo. ) Bp, 3Bp(1,K), Bp(2,K)Bp(3,K),'b−\n", "annotations": {"author": "[{\"end\":84,\"start\":69},{\"end\":102,\"start\":85}]", "publisher": null, "author_last_name": "[{\"end\":83,\"start\":77},{\"end\":101,\"start\":94}]", "author_first_name": "[{\"end\":76,\"start\":69},{\"end\":93,\"start\":85}]", "author_affiliation": null, "title": "[{\"end\":56,\"start\":1},{\"end\":158,\"start\":103}]", "venue": null, "abstract": "[{\"end\":1705,\"start\":453}]", "bib_ref": "[{\"attributes\":{\"ref_id\":\"b3\"},\"end\":2297,\"start\":2294},{\"attributes\":{\"ref_id\":\"b11\"},\"end\":2300,\"start\":2297},{\"attributes\":{\"ref_id\":\"b25\"},\"end\":2470,\"start\":2466},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":3261,\"start\":3258},{\"attributes\":{\"ref_id\":\"b32\"},\"end\":3674,\"start\":3670},{\"attributes\":{\"ref_id\":\"b6\"},\"end\":4223,\"start\":4220},{\"attributes\":{\"ref_id\":\"b13\"},\"end\":4226,\"start\":4223},{\"attributes\":{\"ref_id\":\"b22\"},\"end\":4229,\"start\":4226},{\"attributes\":{\"ref_id\":\"b20\"},\"end\":4232,\"start\":4229},{\"attributes\":{\"ref_id\":\"b12\"},\"end\":4797,\"start\":4793},{\"attributes\":{\"ref_id\":\"b35\"},\"end\":4829,\"start\":4825},{\"end\":4839,\"start\":4829},{\"attributes\":{\"ref_id\":\"b21\"},\"end\":5970,\"start\":5966},{\"end\":6115,\"start\":6098},{\"attributes\":{\"ref_id\":\"b35\"},\"end\":6683,\"start\":6679},{\"attributes\":{\"ref_id\":\"b26\"},\"end\":6686,\"start\":6683},{\"attributes\":{\"ref_id\":\"b7\"},\"end\":6703,\"start\":6700},{\"attributes\":{\"ref_id\":\"b32\"},\"end\":6956,\"start\":6952},{\"attributes\":{\"ref_id\":\"b27\"},\"end\":6971,\"start\":6967},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":7486,\"start\":7483},{\"attributes\":{\"ref_id\":\"b32\"},\"end\":10027,\"start\":10023},{\"attributes\":{\"ref_id\":\"b31\"},\"end\":10841,\"start\":10837},{\"attributes\":{\"ref_id\":\"b32\"},\"end\":12115,\"start\":12111},{\"attributes\":{\"ref_id\":\"b32\"},\"end\":12443,\"start\":12439},{\"attributes\":{\"ref_id\":\"b8\"},\"end\":12873,\"start\":12870},{\"attributes\":{\"ref_id\":\"b0\"},\"end\":17119,\"start\":17116},{\"attributes\":{\"ref_id\":\"b31\"},\"end\":17921,\"start\":17917},{\"attributes\":{\"ref_id\":\"b0\"},\"end\":18014,\"start\":18011},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":18350,\"start\":18347},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":19215,\"start\":19212},{\"attributes\":{\"ref_id\":\"b16\"},\"end\":20669,\"start\":20665},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":20672,\"start\":20669},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":20910,\"start\":20906},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":20913,\"start\":20910},{\"attributes\":{\"ref_id\":\"b16\"},\"end\":21047,\"start\":21043},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":21050,\"start\":21047},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":21053,\"start\":21050},{\"attributes\":{\"ref_id\":\"b28\"},\"end\":21179,\"start\":21175},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":21338,\"start\":21334},{\"attributes\":{\"ref_id\":\"b11\"},\"end\":22607,\"start\":22603},{\"attributes\":{\"ref_id\":\"b0\"},\"end\":24909,\"start\":24906},{\"attributes\":{\"ref_id\":\"b11\"},\"end\":25377,\"start\":25373},{\"attributes\":{\"ref_id\":\"b34\"},\"end\":26879,\"start\":26875},{\"attributes\":{\"ref_id\":\"b29\"},\"end\":26938,\"start\":26934},{\"attributes\":{\"ref_id\":\"b17\"},\"end\":27426,\"start\":27422},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":27502,\"start\":27499},{\"attributes\":{\"ref_id\":\"b21\"},\"end\":27903,\"start\":27899},{\"attributes\":{\"ref_id\":\"b18\"},\"end\":29660,\"start\":29656},{\"attributes\":{\"ref_id\":\"b8\"},\"end\":29662,\"start\":29660},{\"attributes\":{\"ref_id\":\"b32\"},\"end\":29665,\"start\":29662},{\"attributes\":{\"ref_id\":\"b36\"},\"end\":35990,\"start\":35986},{\"end\":35996,\"start\":35990},{\"end\":36011,\"start\":35996},{\"end\":37729,\"start\":37724},{\"attributes\":{\"ref_id\":\"b27\"},\"end\":40185,\"start\":40181},{\"attributes\":{\"ref_id\":\"b35\"},\"end\":40690,\"start\":40686},{\"attributes\":{\"ref_id\":\"b35\"},\"end\":44116,\"start\":44112},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":45432,\"start\":45429},{\"attributes\":{\"ref_id\":\"b24\"},\"end\":45721,\"start\":45717},{\"attributes\":{\"ref_id\":\"b0\"},\"end\":46177,\"start\":46174},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":47697,\"start\":47694},{\"attributes\":{\"ref_id\":\"b21\"},\"end\":47722,\"start\":47718},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":48102,\"start\":48099},{\"end\":48222,\"start\":48218},{\"attributes\":{\"ref_id\":\"b25\"},\"end\":51358,\"start\":51354},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":51361,\"start\":51358},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":51973,\"start\":51970},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":52164,\"start\":52161},{\"end\":52951,\"start\":52944},{\"attributes\":{\"ref_id\":\"b2\"},\"end\":53347,\"start\":53344},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":55987,\"start\":55986},{\"attributes\":{\"ref_id\":\"b0\"},\"end\":58844,\"start\":58841},{\"attributes\":{\"ref_id\":\"b31\"},\"end\":60130,\"start\":60126},{\"attributes\":{\"ref_id\":\"b23\"},\"end\":60743,\"start\":60739},{\"attributes\":{\"ref_id\":\"b12\"},\"end\":60785,\"start\":60781},{\"attributes\":{\"ref_id\":\"b33\"},\"end\":60899,\"start\":60895},{\"attributes\":{\"ref_id\":\"b5\"},\"end\":60985,\"start\":60982},{\"attributes\":{\"ref_id\":\"b30\"},\"end\":61834,\"start\":61830},{\"attributes\":{\"ref_id\":\"b19\"},\"end\":61927,\"start\":61923},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":62554,\"start\":62551}]", "figure": "[{\"attributes\":{\"id\":\"fig_0\"},\"end\":55744,\"start\":55666},{\"attributes\":{\"id\":\"fig_1\"},\"end\":55970,\"start\":55745},{\"attributes\":{\"id\":\"fig_2\"},\"end\":56164,\"start\":55971},{\"attributes\":{\"id\":\"fig_3\"},\"end\":56263,\"start\":56165},{\"attributes\":{\"id\":\"fig_4\"},\"end\":57102,\"start\":56264},{\"attributes\":{\"id\":\"fig_5\"},\"end\":57350,\"start\":57103},{\"attributes\":{\"id\":\"fig_6\"},\"end\":57779,\"start\":57351},{\"attributes\":{\"id\":\"fig_7\"},\"end\":58155,\"start\":57780},{\"attributes\":{\"id\":\"fig_8\"},\"end\":58356,\"start\":58156},{\"attributes\":{\"id\":\"fig_10\"},\"end\":58471,\"start\":58357},{\"attributes\":{\"id\":\"fig_13\"},\"end\":58687,\"start\":58472},{\"attributes\":{\"id\":\"fig_14\"},\"end\":58975,\"start\":58688},{\"attributes\":{\"id\":\"fig_15\"},\"end\":59175,\"start\":58976},{\"attributes\":{\"id\":\"fig_16\"},\"end\":59318,\"start\":59176},{\"attributes\":{\"id\":\"fig_17\"},\"end\":59894,\"start\":59319},{\"attributes\":{\"id\":\"fig_18\"},\"end\":60131,\"start\":59895},{\"attributes\":{\"id\":\"tab_0\",\"type\":\"table\"},\"end\":60378,\"start\":60132},{\"attributes\":{\"id\":\"tab_2\",\"type\":\"table\"},\"end\":60567,\"start\":60379}]", "paragraph": "[{\"end\":2142,\"start\":1721},{\"end\":2584,\"start\":2144},{\"end\":3202,\"start\":2625},{\"end\":4256,\"start\":3204},{\"end\":4353,\"start\":4258},{\"end\":4812,\"start\":4410},{\"end\":4912,\"start\":4814},{\"end\":5101,\"start\":4945},{\"end\":5257,\"start\":5155},{\"end\":5400,\"start\":5259},{\"end\":6183,\"start\":5459},{\"end\":6573,\"start\":6185},{\"end\":6737,\"start\":6575},{\"end\":7704,\"start\":6739},{\"end\":8752,\"start\":7706},{\"end\":8964,\"start\":8784},{\"end\":9256,\"start\":9075},{\"end\":9703,\"start\":9414},{\"end\":9921,\"start\":9705},{\"end\":10333,\"start\":9923},{\"end\":11122,\"start\":10335},{\"end\":11423,\"start\":11124},{\"end\":11546,\"start\":11473},{\"end\":11580,\"start\":11548},{\"end\":11837,\"start\":11619},{\"end\":12032,\"start\":11839},{\"end\":12344,\"start\":12034},{\"end\":12505,\"start\":12346},{\"end\":12585,\"start\":12507},{\"end\":12976,\"start\":12587},{\"end\":13379,\"start\":13019},{\"end\":13495,\"start\":13381},{\"end\":13578,\"start\":13497},{\"end\":13709,\"start\":13580},{\"end\":13952,\"start\":13711},{\"end\":14184,\"start\":13967},{\"end\":14243,\"start\":14238},{\"end\":14678,\"start\":14245},{\"end\":14912,\"start\":14773},{\"end\":15353,\"start\":15000},{\"end\":15513,\"start\":15498},{\"end\":15819,\"start\":15719},{\"end\":16003,\"start\":15920},{\"end\":16463,\"start\":16005},{\"end\":16624,\"start\":16519},{\"end\":16776,\"start\":16626},{\"end\":17700,\"start\":16827},{\"end\":17768,\"start\":17702},{\"end\":17922,\"start\":17770},{\"end\":18015,\"start\":17924},{\"end\":18788,\"start\":18017},{\"end\":19516,\"start\":18790},{\"end\":20427,\"start\":19518},{\"end\":20914,\"start\":20452},{\"end\":21054,\"start\":20960},{\"end\":21338,\"start\":21056},{\"end\":21443,\"start\":21358},{\"end\":21533,\"start\":21445},{\"end\":21622,\"start\":21573},{\"end\":21868,\"start\":21664},{\"end\":22121,\"start\":22007},{\"end\":22274,\"start\":22123},{\"end\":22499,\"start\":22341},{\"end\":22652,\"start\":22501},{\"end\":22885,\"start\":22680},{\"end\":23072,\"start\":22982},{\"end\":23418,\"start\":23390},{\"end\":23543,\"start\":23485},{\"end\":23810,\"start\":23545},{\"end\":23914,\"start\":23812},{\"end\":24063,\"start\":24045},{\"end\":24170,\"start\":24124},{\"end\":24555,\"start\":24465},{\"end\":25026,\"start\":24829},{\"end\":25508,\"start\":25217},{\"end\":25803,\"start\":25550},{\"end\":25961,\"start\":25857},{\"end\":26222,\"start\":25963},{\"end\":27183,\"start\":26301},{\"end\":27438,\"start\":27316},{\"end\":27681,\"start\":27480},{\"end\":27880,\"start\":27746},{\"end\":27974,\"start\":27882},{\"end\":28471,\"start\":28003},{\"end\":28560,\"start\":28473},{\"end\":28759,\"start\":28599},{\"end\":28868,\"start\":28761},{\"end\":29032,\"start\":28870},{\"end\":29321,\"start\":29075},{\"end\":29988,\"start\":29411},{\"end\":30021,\"start\":29990},{\"end\":30426,\"start\":30064},{\"end\":30689,\"start\":30428},{\"end\":31205,\"start\":30772},{\"end\":31351,\"start\":31266},{\"end\":31361,\"start\":31353},{\"end\":31420,\"start\":31384},{\"end\":31582,\"start\":31447},{\"end\":32307,\"start\":31584},{\"end\":33145,\"start\":32359},{\"end\":33730,\"start\":33147},{\"end\":33808,\"start\":33732},{\"end\":34215,\"start\":33890},{\"end\":34763,\"start\":34297},{\"end\":35101,\"start\":34881},{\"end\":35390,\"start\":35195},{\"end\":35508,\"start\":35392},{\"end\":35869,\"start\":35549},{\"end\":36011,\"start\":35871},{\"end\":36215,\"start\":36087},{\"end\":36496,\"start\":36247},{\"end\":36943,\"start\":36607},{\"end\":37054,\"start\":36945},{\"end\":37283,\"start\":37056},{\"end\":37574,\"start\":37356},{\"end\":37926,\"start\":37614},{\"end\":38230,\"start\":37928},{\"end\":38559,\"start\":38323},{\"end\":38947,\"start\":38576},{\"end\":39328,\"start\":38949},{\"end\":39488,\"start\":39347},{\"end\":39549,\"start\":39490},{\"end\":39670,\"start\":39601},{\"end\":39905,\"start\":39672},{\"end\":39996,\"start\":39907},{\"end\":40398,\"start\":40017},{\"end\":41225,\"start\":40400},{\"end\":41777,\"start\":41391},{\"end\":41885,\"start\":41779},{\"end\":42338,\"start\":42241},{\"end\":42616,\"start\":42340},{\"end\":43036,\"start\":42618},{\"end\":43097,\"start\":43038},{\"end\":43377,\"start\":43323},{\"end\":43469,\"start\":43418},{\"end\":43852,\"start\":43471},{\"end\":43898,\"start\":43854},{\"end\":44138,\"start\":43900},{\"end\":44277,\"start\":44140},{\"end\":44463,\"start\":44367},{\"end\":44511,\"start\":44510},{\"end\":45151,\"start\":44593},{\"end\":45254,\"start\":45190},{\"end\":45834,\"start\":45321},{\"end\":46606,\"start\":45904},{\"end\":46828,\"start\":46769},{\"end\":47024,\"start\":46841},{\"end\":47304,\"start\":47083},{\"end\":47370,\"start\":47306},{\"end\":48031,\"start\":47540},{\"end\":48222,\"start\":48033},{\"end\":48471,\"start\":48260},{\"end\":49001,\"start\":48945},{\"end\":49051,\"start\":49003},{\"end\":49573,\"start\":49384},{\"end\":49787,\"start\":49747},{\"end\":50218,\"start\":49882},{\"end\":50506,\"start\":50220},{\"end\":51223,\"start\":50508},{\"end\":51457,\"start\":51225},{\"end\":51922,\"start\":51459},{\"end\":51985,\"start\":51924},{\"end\":52104,\"start\":51987},{\"end\":52237,\"start\":52142},{\"end\":52586,\"start\":52239},{\"end\":52951,\"start\":52861},{\"end\":53436,\"start\":53138},{\"end\":54150,\"start\":53481},{\"end\":54417,\"start\":54152},{\"end\":55445,\"start\":54419},{\"end\":55665,\"start\":55447},{\"end\":55743,\"start\":55680},{\"end\":55969,\"start\":55748},{\"end\":56163,\"start\":55986},{\"end\":56262,\"start\":56178},{\"end\":57101,\"start\":56267},{\"end\":57349,\"start\":57129},{\"end\":57778,\"start\":57366},{\"end\":58154,\"start\":57798},{\"end\":58355,\"start\":58170},{\"end\":58470,\"start\":58371},{\"end\":58686,\"start\":58499},{\"end\":58974,\"start\":58697},{\"end\":59174,\"start\":59006},{\"end\":59317,\"start\":59190},{\"end\":59893,\"start\":59336},{\"end\":60130,\"start\":59899},{\"end\":60344,\"start\":60145},{\"end\":60566,\"start\":60382}]", "formula": "[{\"attributes\":{\"id\":\"formula_0\"},\"end\":2624,\"start\":2585},{\"attributes\":{\"id\":\"formula_1\"},\"end\":4409,\"start\":4354},{\"attributes\":{\"id\":\"formula_2\"},\"end\":4944,\"start\":4913},{\"attributes\":{\"id\":\"formula_3\"},\"end\":5154,\"start\":5102},{\"attributes\":{\"id\":\"formula_4\"},\"end\":5458,\"start\":5401},{\"attributes\":{\"id\":\"formula_5\"},\"end\":9074,\"start\":8965},{\"attributes\":{\"id\":\"formula_6\"},\"end\":9413,\"start\":9257},{\"attributes\":{\"id\":\"formula_7\"},\"end\":11618,\"start\":11581},{\"attributes\":{\"id\":\"formula_8\"},\"end\":13018,\"start\":12977},{\"attributes\":{\"id\":\"formula_9\"},\"end\":13966,\"start\":13953},{\"attributes\":{\"id\":\"formula_10\"},\"end\":14237,\"start\":14185},{\"attributes\":{\"id\":\"formula_11\"},\"end\":14772,\"start\":14679},{\"attributes\":{\"id\":\"formula_12\"},\"end\":14999,\"start\":14913},{\"attributes\":{\"id\":\"formula_13\"},\"end\":15497,\"start\":15354},{\"attributes\":{\"id\":\"formula_14\"},\"end\":15718,\"start\":15514},{\"attributes\":{\"id\":\"formula_15\"},\"end\":15919,\"start\":15820},{\"attributes\":{\"id\":\"formula_16\"},\"end\":16518,\"start\":16464},{\"attributes\":{\"id\":\"formula_17\"},\"end\":20959,\"start\":20915},{\"attributes\":{\"id\":\"formula_18\"},\"end\":21572,\"start\":21534},{\"attributes\":{\"id\":\"formula_19\"},\"end\":21663,\"start\":21623},{\"attributes\":{\"id\":\"formula_20\"},\"end\":22006,\"start\":21869},{\"attributes\":{\"id\":\"formula_21\"},\"end\":22340,\"start\":22275},{\"attributes\":{\"id\":\"formula_22\"},\"end\":22679,\"start\":22653},{\"attributes\":{\"id\":\"formula_23\"},\"end\":22981,\"start\":22886},{\"attributes\":{\"id\":\"formula_24\"},\"end\":23389,\"start\":23073},{\"attributes\":{\"id\":\"formula_25\"},\"end\":23484,\"start\":23419},{\"attributes\":{\"id\":\"formula_26\"},\"end\":24044,\"start\":23915},{\"attributes\":{\"id\":\"formula_27\"},\"end\":24123,\"start\":24064},{\"attributes\":{\"id\":\"formula_28\"},\"end\":24464,\"start\":24171},{\"attributes\":{\"id\":\"formula_29\"},\"end\":24618,\"start\":24556},{\"attributes\":{\"id\":\"formula_30\"},\"end\":24828,\"start\":24618},{\"attributes\":{\"id\":\"formula_31\"},\"end\":25216,\"start\":25027},{\"attributes\":{\"id\":\"formula_32\"},\"end\":25856,\"start\":25804},{\"attributes\":{\"id\":\"formula_33\"},\"end\":26300,\"start\":26223},{\"attributes\":{\"id\":\"formula_34\"},\"end\":27315,\"start\":27184},{\"attributes\":{\"id\":\"formula_35\"},\"end\":27479,\"start\":27439},{\"attributes\":{\"id\":\"formula_36\"},\"end\":27745,\"start\":27682},{\"attributes\":{\"id\":\"formula_37\"},\"end\":28002,\"start\":27975},{\"attributes\":{\"id\":\"formula_38\"},\"end\":28598,\"start\":28561},{\"attributes\":{\"id\":\"formula_39\"},\"end\":29074,\"start\":29033},{\"attributes\":{\"id\":\"formula_40\"},\"end\":30063,\"start\":30022},{\"attributes\":{\"id\":\"formula_41\"},\"end\":30771,\"start\":30690},{\"attributes\":{\"id\":\"formula_42\"},\"end\":31265,\"start\":31206},{\"attributes\":{\"id\":\"formula_43\"},\"end\":31383,\"start\":31362},{\"attributes\":{\"id\":\"formula_44\"},\"end\":31446,\"start\":31421},{\"attributes\":{\"id\":\"formula_45\"},\"end\":33889,\"start\":33809},{\"attributes\":{\"id\":\"formula_46\"},\"end\":34880,\"start\":34764},{\"attributes\":{\"id\":\"formula_47\"},\"end\":35194,\"start\":35102},{\"attributes\":{\"id\":\"formula_48\"},\"end\":35548,\"start\":35509},{\"attributes\":{\"id\":\"formula_49\"},\"end\":36086,\"start\":36012},{\"attributes\":{\"id\":\"formula_50\"},\"end\":36246,\"start\":36216},{\"attributes\":{\"id\":\"formula_51\"},\"end\":36606,\"start\":36497},{\"attributes\":{\"id\":\"formula_52\"},\"end\":37355,\"start\":37284},{\"attributes\":{\"id\":\"formula_53\"},\"end\":38322,\"start\":38231},{\"attributes\":{\"id\":\"formula_54\"},\"end\":41390,\"start\":41226},{\"attributes\":{\"id\":\"formula_55\"},\"end\":42240,\"start\":41886},{\"attributes\":{\"id\":\"formula_56\"},\"end\":43322,\"start\":43098},{\"attributes\":{\"id\":\"formula_57\"},\"end\":43417,\"start\":43378},{\"attributes\":{\"id\":\"formula_58\"},\"end\":44366,\"start\":44278},{\"attributes\":{\"id\":\"formula_59\"},\"end\":44509,\"start\":44464},{\"attributes\":{\"id\":\"formula_60\"},\"end\":44592,\"start\":44512},{\"attributes\":{\"id\":\"formula_61\"},\"end\":45320,\"start\":45255},{\"attributes\":{\"id\":\"formula_62\"},\"end\":46627,\"start\":46607},{\"attributes\":{\"id\":\"formula_63\"},\"end\":46768,\"start\":46627},{\"attributes\":{\"id\":\"formula_64\"},\"end\":46840,\"start\":46829},{\"attributes\":{\"id\":\"formula_65\"},\"end\":47539,\"start\":47371},{\"attributes\":{\"id\":\"formula_66\"},\"end\":48259,\"start\":48223},{\"attributes\":{\"id\":\"formula_67\"},\"end\":48492,\"start\":48472},{\"attributes\":{\"id\":\"formula_68\"},\"end\":48692,\"start\":48492},{\"attributes\":{\"id\":\"formula_69\"},\"end\":48874,\"start\":48692},{\"attributes\":{\"id\":\"formula_70\"},\"end\":48944,\"start\":48874},{\"attributes\":{\"id\":\"formula_71\"},\"end\":49383,\"start\":49052},{\"attributes\":{\"id\":\"formula_72\"},\"end\":49746,\"start\":49574},{\"attributes\":{\"id\":\"formula_73\"},\"end\":49881,\"start\":49788},{\"attributes\":{\"id\":\"formula_74\"},\"end\":52835,\"start\":52587},{\"attributes\":{\"id\":\"formula_75\"},\"end\":52860,\"start\":52835},{\"attributes\":{\"id\":\"formula_76\"},\"end\":53137,\"start\":52952},{\"attributes\":{\"id\":\"formula_77\"},\"end\":53459,\"start\":53437}]", "table_ref": "[{\"attributes\":{\"ref_id\":\"tab_0\"},\"end\":47789,\"start\":47788},{\"attributes\":{\"ref_id\":\"tab_0\"},\"end\":51858,\"start\":51857},{\"end\":53790,\"start\":53789},{\"end\":55454,\"start\":55453},{\"end\":55587,\"start\":55586}]", "section_header": "[{\"attributes\":{\"n\":\"1\"},\"end\":1719,\"start\":1707},{\"attributes\":{\"n\":\"2\"},\"end\":8782,\"start\":8755},{\"attributes\":{\"n\":\"2.1\"},\"end\":11471,\"start\":11426},{\"attributes\":{\"n\":\"2.2\"},\"end\":16803,\"start\":16779},{\"attributes\":{\"n\":\"2.2.1\"},\"end\":16825,\"start\":16806},{\"attributes\":{\"n\":\"2.2.2\"},\"end\":20450,\"start\":20430},{\"attributes\":{\"n\":\"2.3\"},\"end\":21356,\"start\":21341},{\"attributes\":{\"n\":\"3\"},\"end\":25548,\"start\":25511},{\"attributes\":{\"n\":\"3.1\"},\"end\":29409,\"start\":29324},{\"attributes\":{\"n\":\"3.2\"},\"end\":32357,\"start\":32310},{\"attributes\":{\"n\":\"3.3\"},\"end\":34295,\"start\":34218},{\"attributes\":{\"n\":\"3.3.1\"},\"end\":37612,\"start\":37577},{\"attributes\":{\"n\":\"4\"},\"end\":38574,\"start\":38562},{\"attributes\":{\"n\":\"4.1\"},\"end\":39345,\"start\":39331},{\"attributes\":{\"n\":\"2.\"},\"end\":39599,\"start\":39552},{\"end\":40015,\"start\":39999},{\"attributes\":{\"n\":\"4.2\"},\"end\":45188,\"start\":45154},{\"attributes\":{\"n\":\"4.2.1\"},\"end\":45902,\"start\":45837},{\"attributes\":{\"n\":\"4.2.2\"},\"end\":47081,\"start\":47027},{\"attributes\":{\"n\":\"4.3\"},\"end\":52140,\"start\":52107},{\"attributes\":{\"n\":\"5\"},\"end\":53479,\"start\":53461},{\"end\":55677,\"start\":55667},{\"end\":55983,\"start\":55972},{\"end\":56175,\"start\":56166},{\"end\":57125,\"start\":57104},{\"end\":57363,\"start\":57352},{\"end\":57795,\"start\":57781},{\"end\":58167,\"start\":58157},{\"end\":58368,\"start\":58358},{\"end\":58495,\"start\":58473},{\"end\":58694,\"start\":58689},{\"end\":59001,\"start\":58977},{\"end\":59187,\"start\":59177},{\"end\":59332,\"start\":59320},{\"end\":59897,\"start\":59896},{\"end\":60142,\"start\":60133}]", "table": "[{\"end\":60378,\"start\":60345}]", "figure_caption": "[{\"end\":55744,\"start\":55679},{\"end\":55970,\"start\":55747},{\"end\":56164,\"start\":55985},{\"end\":56263,\"start\":56177},{\"end\":57102,\"start\":56266},{\"end\":57350,\"start\":57128},{\"end\":57779,\"start\":57365},{\"end\":58155,\"start\":57797},{\"end\":58356,\"start\":58169},{\"end\":58471,\"start\":58370},{\"end\":58687,\"start\":58498},{\"end\":58975,\"start\":58696},{\"end\":59175,\"start\":59005},{\"end\":59318,\"start\":59189},{\"end\":59894,\"start\":59335},{\"end\":60131,\"start\":59898},{\"end\":60345,\"start\":60144},{\"end\":60567,\"start\":60381}]", "figure_ref": "[{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":18672,\"start\":18671},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":19113,\"start\":19112},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":20255,\"start\":20254},{\"attributes\":{\"ref_id\":\"fig_2\"},\"end\":32306,\"start\":32305},{\"attributes\":{\"ref_id\":\"fig_8\"},\"end\":46319,\"start\":46318},{\"attributes\":{\"ref_id\":\"fig_3\"},\"end\":47732,\"start\":47731},{\"attributes\":{\"ref_id\":\"fig_14\"},\"end\":50882,\"start\":50875},{\"attributes\":{\"ref_id\":\"fig_6\"},\"end\":51059,\"start\":51058},{\"attributes\":{\"ref_id\":\"fig_14\"},\"end\":55151,\"start\":55144}]", "bib_author_first_name": "[{\"end\":63578,\"start\":63577},{\"end\":63590,\"start\":63589},{\"end\":63599,\"start\":63598},{\"end\":63611,\"start\":63610},{\"end\":63662,\"start\":63661},{\"end\":63664,\"start\":63663},{\"end\":63675,\"start\":63674},{\"end\":63677,\"start\":63676},{\"end\":63790,\"start\":63789},{\"end\":63801,\"start\":63800},{\"end\":63904,\"start\":63903},{\"end\":63914,\"start\":63913},{\"end\":63916,\"start\":63915},{\"end\":64031,\"start\":64030},{\"end\":64033,\"start\":64032},{\"end\":64042,\"start\":64041},{\"end\":64052,\"start\":64051},{\"end\":64054,\"start\":64053},{\"end\":64067,\"start\":64066},{\"end\":64069,\"start\":64068},{\"end\":64078,\"start\":64077},{\"end\":64080,\"start\":64079},{\"end\":64199,\"start\":64198},{\"end\":64210,\"start\":64209},{\"end\":64414,\"start\":64413},{\"end\":64416,\"start\":64415},{\"end\":64551,\"start\":64550},{\"end\":64562,\"start\":64561},{\"end\":64713,\"start\":64712},{\"end\":64715,\"start\":64714},{\"end\":64722,\"start\":64721},{\"end\":64724,\"start\":64723},{\"end\":64841,\"start\":64840},{\"end\":64853,\"start\":64852},{\"end\":64863,\"start\":64862},{\"end\":64977,\"start\":64976},{\"end\":64979,\"start\":64978},{\"end\":65195,\"start\":65194},{\"end\":65197,\"start\":65196},{\"end\":65206,\"start\":65205},{\"end\":65208,\"start\":65207},{\"end\":65319,\"start\":65318},{\"end\":65331,\"start\":65330},{\"end\":65345,\"start\":65344},{\"end\":65460,\"start\":65459},{\"end\":65462,\"start\":65461},{\"end\":65581,\"start\":65580},{\"end\":65737,\"start\":65736},{\"end\":65744,\"start\":65743},{\"end\":65863,\"start\":65862},{\"end\":65870,\"start\":65869},{\"end\":65872,\"start\":65871},{\"end\":66047,\"start\":66046},{\"end\":66058,\"start\":66057},{\"end\":66060,\"start\":66059},{\"end\":66071,\"start\":66070},{\"end\":66073,\"start\":66072},{\"end\":66294,\"start\":66293},{\"end\":66304,\"start\":66303},{\"end\":66463,\"start\":66462},{\"end\":66473,\"start\":66472},{\"end\":66609,\"start\":66608},{\"end\":66619,\"start\":66618},{\"end\":66621,\"start\":66620},{\"end\":66719,\"start\":66718},{\"end\":66721,\"start\":66720},{\"end\":66818,\"start\":66817},{\"end\":66837,\"start\":66833},{\"end\":66983,\"start\":66982},{\"end\":66998,\"start\":66997},{\"end\":67007,\"start\":67006},{\"end\":67050,\"start\":67049},{\"end\":67062,\"start\":67061},{\"end\":67256,\"start\":67255},{\"end\":67258,\"start\":67257},{\"end\":67265,\"start\":67264},{\"end\":67267,\"start\":67266},{\"end\":67293,\"start\":67292},{\"end\":67300,\"start\":67299},{\"end\":67473,\"start\":67472},{\"end\":67475,\"start\":67474},{\"end\":67482,\"start\":67481},{\"end\":67484,\"start\":67483},{\"end\":67591,\"start\":67590},{\"end\":67595,\"start\":67592},{\"end\":67607,\"start\":67606},{\"end\":67652,\"start\":67651},{\"end\":67819,\"start\":67818},{\"end\":67914,\"start\":67913},{\"end\":67916,\"start\":67915},{\"end\":68003,\"start\":68002},{\"end\":68005,\"start\":68004},{\"end\":68087,\"start\":68086},{\"end\":68089,\"start\":68088},{\"end\":68161,\"start\":68160},{\"end\":68285,\"start\":68284},{\"end\":68337,\"start\":68336},{\"end\":68339,\"start\":68338},{\"end\":68513,\"start\":68510},{\"end\":68545,\"start\":68544}]", "bib_author_last_name": "[{\"end\":63587,\"start\":63579},{\"end\":63596,\"start\":63591},{\"end\":63608,\"start\":63600},{\"end\":63616,\"start\":63612},{\"end\":63672,\"start\":63665},{\"end\":63684,\"start\":63678},{\"end\":63798,\"start\":63791},{\"end\":63812,\"start\":63802},{\"end\":63911,\"start\":63905},{\"end\":63925,\"start\":63917},{\"end\":64039,\"start\":64034},{\"end\":64049,\"start\":64043},{\"end\":64064,\"start\":64055},{\"end\":64075,\"start\":64070},{\"end\":64089,\"start\":64081},{\"end\":64207,\"start\":64200},{\"end\":64225,\"start\":64211},{\"end\":64425,\"start\":64417},{\"end\":64559,\"start\":64552},{\"end\":64570,\"start\":64563},{\"end\":64719,\"start\":64716},{\"end\":64728,\"start\":64725},{\"end\":64850,\"start\":64842},{\"end\":64860,\"start\":64854},{\"end\":64869,\"start\":64864},{\"end\":64988,\"start\":64980},{\"end\":65203,\"start\":65198},{\"end\":65217,\"start\":65209},{\"end\":65328,\"start\":65320},{\"end\":65342,\"start\":65332},{\"end\":65354,\"start\":65346},{\"end\":65468,\"start\":65463},{\"end\":65585,\"start\":65582},{\"end\":65741,\"start\":65738},{\"end\":65753,\"start\":65745},{\"end\":65867,\"start\":65864},{\"end\":65879,\"start\":65873},{\"end\":66055,\"start\":66048},{\"end\":66068,\"start\":66061},{\"end\":66081,\"start\":66074},{\"end\":66301,\"start\":66295},{\"end\":66312,\"start\":66305},{\"end\":66470,\"start\":66464},{\"end\":66481,\"start\":66474},{\"end\":66616,\"start\":66610},{\"end\":66630,\"start\":66622},{\"end\":66729,\"start\":66722},{\"end\":66831,\"start\":66819},{\"end\":66843,\"start\":66838},{\"end\":66995,\"start\":66984},{\"end\":67004,\"start\":66999},{\"end\":67017,\"start\":67008},{\"end\":67059,\"start\":67051},{\"end\":67072,\"start\":67063},{\"end\":67262,\"start\":67259},{\"end\":67273,\"start\":67268},{\"end\":67297,\"start\":67294},{\"end\":67310,\"start\":67301},{\"end\":67479,\"start\":67476},{\"end\":67488,\"start\":67485},{\"end\":67604,\"start\":67596},{\"end\":67612,\"start\":67608},{\"end\":67658,\"start\":67653},{\"end\":67827,\"start\":67820},{\"end\":67923,\"start\":67917},{\"end\":68013,\"start\":68006},{\"end\":68094,\"start\":68090},{\"end\":68167,\"start\":68162},{\"end\":68296,\"start\":68286},{\"end\":68347,\"start\":68340},{\"end\":68522,\"start\":68514},{\"end\":68548,\"start\":68546}]", "bib_entry": "[{\"attributes\":{\"id\":\"b0\"},\"end\":63624,\"start\":63508},{\"attributes\":{\"id\":\"b1\",\"matched_paper_id\":123389982},\"end\":63732,\"start\":63626},{\"attributes\":{\"id\":\"b2\",\"matched_paper_id\":1607402},\"end\":63857,\"start\":63734},{\"attributes\":{\"id\":\"b3\",\"matched_paper_id\":120244875},\"end\":63950,\"start\":63859},{\"attributes\":{\"id\":\"b4\",\"matched_paper_id\":1652902},\"end\":64141,\"start\":63952},{\"attributes\":{\"id\":\"b5\",\"matched_paper_id\":28359888},\"end\":64354,\"start\":64143},{\"attributes\":{\"id\":\"b6\",\"matched_paper_id\":57730743},\"end\":64467,\"start\":64356},{\"attributes\":{\"id\":\"b7\",\"matched_paper_id\":88517947},\"end\":64613,\"start\":64469},{\"attributes\":{\"id\":\"b8\",\"matched_paper_id\":188407},\"end\":64758,\"start\":64615},{\"attributes\":{\"id\":\"b9\",\"matched_paper_id\":9551215},\"end\":64922,\"start\":64760},{\"attributes\":{\"id\":\"b10\",\"matched_paper_id\":29816039},\"end\":65115,\"start\":64924},{\"attributes\":{\"id\":\"b11\",\"matched_paper_id\":263419661},\"end\":65263,\"start\":65117},{\"attributes\":{\"id\":\"b12\",\"matched_paper_id\":3790504},\"end\":65406,\"start\":65265},{\"attributes\":{\"id\":\"b13\"},\"end\":65529,\"start\":65408},{\"attributes\":{\"id\":\"b14\"},\"end\":65632,\"start\":65531},{\"attributes\":{\"id\":\"b15\",\"matched_paper_id\":1926136},\"end\":65809,\"start\":65634},{\"attributes\":{\"id\":\"b16\"},\"end\":66005,\"start\":65811},{\"attributes\":{\"id\":\"b17\"},\"end\":66205,\"start\":66007},{\"attributes\":{\"id\":\"b18\",\"matched_paper_id\":13349289},\"end\":66372,\"start\":66207},{\"attributes\":{\"id\":\"b19\"},\"end\":66496,\"start\":66374},{\"attributes\":{\"id\":\"b20\",\"matched_paper_id\":2422409},\"end\":66664,\"start\":66498},{\"attributes\":{\"id\":\"b21\",\"matched_paper_id\":13430763},\"end\":66749,\"start\":66666},{\"attributes\":{\"id\":\"b22\",\"matched_paper_id\":6861790},\"end\":66904,\"start\":66751},{\"attributes\":{\"id\":\"b23\",\"matched_paper_id\":38587466},\"end\":67047,\"start\":66906},{\"attributes\":{\"doi\":\"CORR 2010-2010-06\",\"id\":\"b24\"},\"end\":67186,\"start\":67049},{\"attributes\":{\"id\":\"b25\",\"matched_paper_id\":4428232},\"end\":67290,\"start\":67188},{\"attributes\":{\"id\":\"b26\"},\"end\":67414,\"start\":67292},{\"attributes\":{\"id\":\"b27\",\"matched_paper_id\":5294787},\"end\":67535,\"start\":67416},{\"attributes\":{\"id\":\"b28\",\"matched_paper_id\":60661138},\"end\":67649,\"start\":67537},{\"attributes\":{\"id\":\"b29\"},\"end\":67766,\"start\":67651},{\"attributes\":{\"id\":\"b30\",\"matched_paper_id\":3102766},\"end\":67867,\"start\":67768},{\"attributes\":{\"id\":\"b31\",\"matched_paper_id\":120244875},\"end\":67945,\"start\":67869},{\"attributes\":{\"id\":\"b32\",\"matched_paper_id\":7150400},\"end\":68051,\"start\":67947},{\"attributes\":{\"id\":\"b33\",\"matched_paper_id\":11191240},\"end\":68105,\"start\":68053},{\"attributes\":{\"id\":\"b34\",\"matched_paper_id\":18077566},\"end\":68215,\"start\":68107},{\"attributes\":{\"id\":\"b35\",\"matched_paper_id\":15104292},\"end\":68334,\"start\":68217},{\"attributes\":{\"id\":\"b36\"},\"end\":68437,\"start\":68336},{\"attributes\":{\"id\":\"b37\"},\"end\":68508,\"start\":68439},{\"attributes\":{\"id\":\"b38\"},\"end\":68529,\"start\":68510},{\"attributes\":{\"id\":\"b39\"},\"end\":68578,\"start\":68531}]", "bib_title": "[{\"end\":63659,\"start\":63626},{\"end\":63787,\"start\":63734},{\"end\":63901,\"start\":63859},{\"end\":64028,\"start\":63952},{\"end\":64196,\"start\":64143},{\"end\":64411,\"start\":64356},{\"end\":64548,\"start\":64469},{\"end\":64710,\"start\":64615},{\"end\":64838,\"start\":64760},{\"end\":64974,\"start\":64924},{\"end\":65192,\"start\":65117},{\"end\":65316,\"start\":65265},{\"end\":65457,\"start\":65408},{\"end\":65734,\"start\":65634},{\"end\":65860,\"start\":65811},{\"end\":66044,\"start\":66007},{\"end\":66291,\"start\":66207},{\"end\":66606,\"start\":66498},{\"end\":66716,\"start\":66666},{\"end\":66815,\"start\":66751},{\"end\":66980,\"start\":66906},{\"end\":67253,\"start\":67188},{\"end\":67470,\"start\":67416},{\"end\":67588,\"start\":67537},{\"end\":67816,\"start\":67768},{\"end\":67911,\"start\":67869},{\"end\":68000,\"start\":67947},{\"end\":68084,\"start\":68053},{\"end\":68158,\"start\":68107},{\"end\":68282,\"start\":68217}]", "bib_author": "[{\"end\":63589,\"start\":63577},{\"end\":63598,\"start\":63589},{\"end\":63610,\"start\":63598},{\"end\":63618,\"start\":63610},{\"end\":63674,\"start\":63661},{\"end\":63686,\"start\":63674},{\"end\":63800,\"start\":63789},{\"end\":63814,\"start\":63800},{\"end\":63913,\"start\":63903},{\"end\":63927,\"start\":63913},{\"end\":64041,\"start\":64030},{\"end\":64051,\"start\":64041},{\"end\":64066,\"start\":64051},{\"end\":64077,\"start\":64066},{\"end\":64091,\"start\":64077},{\"end\":64209,\"start\":64198},{\"end\":64227,\"start\":64209},{\"end\":64427,\"start\":64413},{\"end\":64561,\"start\":64550},{\"end\":64572,\"start\":64561},{\"end\":64721,\"start\":64712},{\"end\":64730,\"start\":64721},{\"end\":64852,\"start\":64840},{\"end\":64862,\"start\":64852},{\"end\":64871,\"start\":64862},{\"end\":64990,\"start\":64976},{\"end\":65205,\"start\":65194},{\"end\":65219,\"start\":65205},{\"end\":65330,\"start\":65318},{\"end\":65344,\"start\":65330},{\"end\":65356,\"start\":65344},{\"end\":65470,\"start\":65459},{\"end\":65587,\"start\":65580},{\"end\":65743,\"start\":65736},{\"end\":65755,\"start\":65743},{\"end\":65869,\"start\":65862},{\"end\":65881,\"start\":65869},{\"end\":66057,\"start\":66046},{\"end\":66070,\"start\":66057},{\"end\":66083,\"start\":66070},{\"end\":66303,\"start\":66293},{\"end\":66314,\"start\":66303},{\"end\":66472,\"start\":66462},{\"end\":66483,\"start\":66472},{\"end\":66618,\"start\":66608},{\"end\":66632,\"start\":66618},{\"end\":66731,\"start\":66718},{\"end\":66833,\"start\":66817},{\"end\":66845,\"start\":66833},{\"end\":66997,\"start\":66982},{\"end\":67006,\"start\":66997},{\"end\":67019,\"start\":67006},{\"end\":67061,\"start\":67049},{\"end\":67074,\"start\":67061},{\"end\":67264,\"start\":67255},{\"end\":67275,\"start\":67264},{\"end\":67299,\"start\":67292},{\"end\":67312,\"start\":67299},{\"end\":67481,\"start\":67472},{\"end\":67490,\"start\":67481},{\"end\":67606,\"start\":67590},{\"end\":67614,\"start\":67606},{\"end\":67660,\"start\":67651},{\"end\":67829,\"start\":67818},{\"end\":67925,\"start\":67913},{\"end\":68015,\"start\":68002},{\"end\":68096,\"start\":68086},{\"end\":68169,\"start\":68160},{\"end\":68298,\"start\":68284},{\"end\":68349,\"start\":68336},{\"end\":68524,\"start\":68510},{\"end\":68550,\"start\":68544}]", "bib_venue": "[{\"end\":63575,\"start\":63508},{\"end\":63721,\"start\":63686},{\"end\":63848,\"start\":63814},{\"end\":63938,\"start\":63927},{\"end\":64133,\"start\":64091},{\"end\":64295,\"start\":64227},{\"end\":64439,\"start\":64427},{\"end\":64607,\"start\":64572},{\"end\":64749,\"start\":64730},{\"end\":64904,\"start\":64871},{\"end\":65057,\"start\":64990},{\"end\":65254,\"start\":65219},{\"end\":65398,\"start\":65356},{\"end\":65520,\"start\":65470},{\"end\":65578,\"start\":65531},{\"end\":65802,\"start\":65755},{\"end\":65943,\"start\":65881},{\"end\":66144,\"start\":66083},{\"end\":66355,\"start\":66314},{\"end\":66460,\"start\":66374},{\"end\":66647,\"start\":66632},{\"end\":66743,\"start\":66731},{\"end\":66895,\"start\":66845},{\"end\":67038,\"start\":67019},{\"end\":67158,\"start\":67091},{\"end\":67281,\"start\":67275},{\"end\":67408,\"start\":67312},{\"end\":67525,\"start\":67490},{\"end\":67641,\"start\":67614},{\"end\":67758,\"start\":67660},{\"end\":67857,\"start\":67829},{\"end\":67936,\"start\":67925},{\"end\":68043,\"start\":68015},{\"end\":68099,\"start\":68096},{\"end\":68204,\"start\":68169},{\"end\":68326,\"start\":68298},{\"end\":68370,\"start\":68349},{\"end\":68506,\"start\":68439},{\"end\":68526,\"start\":68524},{\"end\":68542,\"start\":68531},{\"end\":64350,\"start\":64297},{\"end\":64462,\"start\":64441},{\"end\":65111,\"start\":65059},{\"end\":66001,\"start\":65945},{\"end\":66201,\"start\":66146},{\"end\":66656,\"start\":66649}]"}}}, "year": 2023, "month": 12, "day": 17}