{"id": 57547905, "updated": "2022-08-09 05:08:45.315", "metadata": {"title": "Online Appendix for Going Vague: Ambiguity and Avoidance in Online Political Messaging", "authors": "[{\"first\":\"Christopher\",\"last\":\"Chapp\",\"middle\":[]},{\"first\":\"Paul\",\"last\":\"Roback\",\"middle\":[]},{\"first\":\"Kendra\",\"last\":\"Johnson-Tesch\",\"middle\":[]},{\"first\":\"Adrian\",\"last\":\"Rossing\",\"middle\":[]},{\"first\":\"Jack\",\"last\":\"Werner\",\"middle\":[]}]", "venue": "Social Science Computer Review", "journal": "Social Science Computer Review", "publication_date": {"year": 2018, "month": null, "day": null}, "abstract": "Results fit model using (4) Column four replaces with an occupational heterogeneity constructed similar the overall index. Results indicate that as the occupational heterogeneity increases of increases. However, model fit drops compared to the model using the heterogeneity index. (5) Column five replaces demographic heterogeneity with the percent college educated above) in the district. Results indicate that as the education increases the level of clarity increases. However, model fit drops compared to the model using the heterogeneity index. (6) Column 6 includes each of the component parts of the heterogeneity index. Taken together, the diversity index produces superior model fit, compared to each of the components entered separately.", "fields_of_study": "[\"Political Science\"]", "external_ids": {"arxiv": null, "mag": "2886221094", "acl": null, "pubmed": null, "pubmedcentral": null, "dblp": null, "doi": "10.1177/0894439318791168"}}, "content": {"source": {"pdf_hash": "1676245969a8e42c2b352e11873bf462f9487983", "pdf_src": "ScienceParsePlus", "pdf_uri": null, "oa_url_match": false, "oa_info": null}, "grobid": {"id": "98570c773d1eeb838e8cd2bdcb844108dc5ee456", "type": "plain-text", "url": "s3://ai2-s2-pdf-extraction-prod/parse-results/s2orc_worker/1676245969a8e42c2b352e11873bf462f9487983.txt", "contents": "\nOnline Appendix for Going Vague: Ambiguity and Avoidance in Online Political Messaging Appendix A: Sample of Ambiguous and Clear Indicator Words Retrieved from Training Set Dataframe 2 Appendix B: Classification Scheme for Issues Pages 5 Appendix C: Descriptive Statistics 8\n\n\nOnline Appendix for Going Vague: Ambiguity and Avoidance in Online Political Messaging Appendix A: Sample of Ambiguous and Clear Indicator Words Retrieved from Training Set Dataframe 2 Appendix B: Classification Scheme for Issues Pages 5 Appendix C: Descriptive Statistics 8\n1 Appendix D: Issue Specific Estimates (Used to Generate Figures 3 & 4) 9 Appendix E: Alternative Model Specifications 11\n\n\nAppendix A: Sample of Ambiguous and Clear Indicator Words Retrieved from Training\n\n\nSet Dataframe\n\nOur content analysis procedure begins with a sample of text that has been hand-coded as ambiguous or clear. We refer to this as the \"training set.\" Wordscores uses this training set to score each of the 2014 texts, however the user never actually sees which words served as indicators of clarity or ambiguity. To resolve this, we dichotomized our training set (splitting the sample at the mean level of ambiguity) and calculated the relative frequency of every word appearing in the clear texts and unclear texts. Next, we calculated the difference between a word's relative frequency in clear texts and relative frequency in unclear texts. This yields a rough approximation of the words that most often distinguished clear texts and those that most distinguished unclear texts. Please note that the resulting word list are not the top words appearing in ambiguous (or clear) texts, but rather words that distinguished one type of text from the other. We report the top sixty words distinguishing clear and unclear words below (words must appear at least twenty-five times to appear on this list). This is only a small fraction of the 7000+ unique words used by Wordscores to score the 2014 texts, however even this small sample is illustrative. While this was entirely a data-driven process, the resulting lists fit with expectations about what signals policy clarity, and what signals obfuscation.\n\nFor example, clear texts tended to include references to actual legislation like \"act,\" \"legislation,\" \"law,\" \"voted,\" and \"amendment.\" It is likely that these words were used to communicate a clear actionable intention on a specific public policy. \"For,\" \"against,\" and \"support\" are also clarity words, signaling a definitive policy stance. Clear texts specifically mention policy recipients, like \"young,\" \"women,\" and \"seniors.\" Clear texts were also distinguished by policy content words, such as \"oil\" and \"insurance.\" Each of these suggests a discussion of a substantive issue versus an abstraction. To be sure, the ambiguous word list also contains policy words, though they are less common and more abstract (i.e. \"economic\" and \"schools\"). Ambiguous texts stand out in a number of other ways as well. First, ambiguous texts are distinguished by auxiliary verbs (\"am,\" \"be,\" \"will\") which are commonly associated with passive voice (Pennebaker, 2011), a grammatical construction often associated with a lack of clarity. Ambiguous texts contain an abundance of pronouns, particularly personal pronouns.\n\nWhile these need not correspond to an ambiguous statement, pronouns have the effect of shifting the focus of attention in a statement (Pennebaker, 2011), in this case from the policy itself to either the candidate (\"I\") or the district (\"our\"). In addition, while clear texts are distinguished by \"for\" and \"against,\" ambiguous texts tend to mention what the candidate \"believes.\" The lists also illustrate key points of comparison. For example, the word \"all\" is one of the most clear words in the set, while the word \"many\" appears on the ambiguous list. \"Many\" is a particularly vague quantifier which could have multiple interpretations, while \"all\" leaves very little wiggle room. The clear words list also contains more of what Pennebaker (2011) calls \"past-focus\" words like \"has,\" as opposed to more \"present-focused\" and \"future-focused\" words on the ambiguous list (i.e. \"will\"). This makes sense, because candidates can afford to be more vague in describing what they intend to do, as opposed to justifying a previous policy they supported. \n\n\nAppendix E: Alternative Model Specifications\n\nHeterogeneity replications. One potential objection to the heterogeneity index is that it is being driven primarily by one of its components, and ambiguity is therefore not a response to heterogeneity itself. We address this objection by reproducing the main model for ambiguity with each of the heterogeneity components. In general, each of the component parts are significant, however, the model fit for component parts is inferior to the diversity index itself. Demographic heterogeneity Poverty Notes: (1) The first column reproduces the results from Table 1 in the paper.\n-1.12 -5.66 --- --- --- --- --- --- --- --- --- ------ --- --- --- -0.91 -4.92 --- --- --- --- -0.69 -2.60 Occupation --- --- --- --- --- --- -0.86 -3.04 --- --- -0.45 -0.47 Education --- --- --- --- --- --- --- --- -0.\n(2) Column two replaces demographic heterogeneity with the percent white in the district. Results indicate that as the percent white increases the level of clarity increases. However, model fit drops compared to the model using the heterogeneity index.\n\n(3) Column three replaces demographic heterogeneity with the percent below the poverty line in the district. Results indicate that as the percent in poverty increases the level of ambiguity increases. However, model fit drops compared to the model using the heterogeneity index. (4) Column four replaces demographic heterogeneity with an occupational heterogeneity score, constructed in a manner similar to the overall heterogeneity index. Results indicate that as the occupational heterogeneity increases of ambiguity increases. However, model fit drops compared to the model using the heterogeneity index. (5) Column five replaces demographic heterogeneity with the percent college educated (or above) in the district. Results indicate that as the education increases the level of clarity increases. However, model fit drops compared to the model using the heterogeneity index. (6) Column 6 includes each of the component parts of the heterogeneity index. Taken together, the diversity index produces superior model fit, compared to each of the components entered separately.\n\n\nAlternative measures and control variables.\n\nWe also replicate the main model with alternative measures (where available) and additional control variables important in the literature. In general, the model reported in Table 1 is robust with alternative specifications in place.\n\n(   Above: (1) The first column reproduces the results from Table 1 in the paper, replacing Tsaunovitch and Warshaw's (2013) district estimates with the average symbolic ideology score from the CCES for district lean, and the standard deviation of symbolic ideology for \"attitudinal diversity.\" The candidate mismatch variable used in this model was also built from the CCES symbolic ideology estimate. Results point to similar substantive conclusions.\n--- ------ ------ ------ ------ ---.003 0.98 --- ------ --- District competition --- ------ ------ ------ ------ ------ ------ ----0.003 -1.52 District comp. * incumbency --- ------ ------ ------ ------ ------ ------ ---0.\n(2) The second column reproduces the results from the main model using the Cook Partisan Voting Index for a congressional district in place of the CCES district lean score. The candidate mismatch variable used in this model was also built from the Cook PVI score. Results point to similar substantive conclusions. (3) The third column reproduces the results from the main model controlling for challenger quality. Challenger quality is a dummy variable coded 1=quality candidate, 0=other (see Jacobson and Carson 2016). These data were made available courtesy of Gary Jacobson. Challenger quality is not significant, and does not impact the main substantive findings. (4) Column 4 includes an interaction for challenger quality and incumbency, which captures races with two quality candidates. The interaction term is not significant, and does not impact the main substantive findings. The near-significant coefficient on the interaction term suggests that, all else equal, quality challengers tend to behave more like incumbents. (5) Column 5 reproduces the results from the main model controlling for a candidate's campaign expenditures (see Jacobson and Carson 2016). These data were made available courtesy of Gary Jacobson. Expenditures are not significant, and do not significantly impact the substantive findings. (6) Column 6 reproduces the results controlling for the opponent's campaign expenditures (see Jacobson and Carson 2016). These data were made available courtesy of Gary Jacobson. Opponent expenditures are not significant, and do not significantly impact the substantive findings. (7) Column 7 reproduces the results using Bonica's DIME data (see Bonica 2014) as an alternative way to estimate candidate ideology. Note that the interaction term in this model also uses this alternative ideology estimate. The results yield similar substantive conclusions, although model fit with the alternative candidate ideology variable is worse than the results reported in Table 1. (8) Column 8 tests for the possibility that the effects of incumbency are moderated by the competitiveness of the electoral environment. We use the absolute value of reverse coded margin of victory to measure district competitiveness. While results are not significant, the direction of the coefficient on the interaction term is consistent with Druckman, Kifer, and Parkin (2009). Specifically, incumbents in competitive races were clearer in their rhetoric, consistent with the notion that a competitive race incentivizes greater risktaking.\n\n\nAppendix D: Issue Specific Estimates (Used to Generate Figures 3 & 4)High salience issues: The economy and health careTop 60 clear \"differentiating words\" from training set \nact \nhealth \nhas \nto \ncare \nfor \nsupport \nyoung \nwomen \nlegislation \ntheir \nwhich \nwould \ncongressman \nsupported \nrights \nefforts \nalso \naccess \nbeen \n\nlaw \nfunding \nagainst \noil \nof \ncosts \nnot \nvoted \namendment \nuse \nseniors \ninsurance \nthis \nprogram \nown \nbill \nnational \nsocial \nor \nshould \n\nsupports \nservices \nenergy \nhouse \nprovide \nfrom \nright \nstates \nall \nany \nthat \neffort \nbudget \namericans \nyear \naffordable \nfinancial \nunited \ncan \nincrease \n\nTop 60 ambiguous \"differentiating words\" from training set \nour \nin \nwe \nand \na \nare \nis \nmust \nwork \nas \ncongress \nwith \ndistrict \nmy \nbe \nneed \ni \nlocal \njobs \nmost \n\nworking \neconomy \nfamilies \ngovernment \npeople \neconomic \neducation \nkeep \nneeds \nthose \nfight \ncreate \nschools \ncollege \nbest \nhis \nwashington \nwill \nme \nby \n\nthe \ncountry \nif \nworld \nput \nwhat \nissues \nmade \npublic \nwas \nserved \nbelieves \ncurrent \nhard \nwho \nfamily \nmany \nensure \nresources \npolicies \nAppendix B: Classification Scheme for Issues Pages \n\nPages were classified according to the language candidates used to describe their page (i.e. \n\n\"Higher Education\"). Each page could be assigned up to two categories (\"My Opponent on \n\nHigher Education\"). \n\nPage type \nDescription \n\nHome page \nWelcome message or statement on home page \n\nBiography page \nBiography or \"about\" the candidate \n\nGeneral issues \nMultiple issues in single paragraph or philosophy of government \n\nOpponent \nPage dedicated to critique of opponent \n\nGovernment reform Government reform, Washington, campaign finance/election reform, \n\nlobbying, ethics, political polarization/unity, bipartisanship, term limits \n\nLocal issues \nIssues specific to the district \n\nEducation \nEducation, higher education, K12 education, \n\nChildren, common core, student loans \n\nGuns \nGuns, 2nd Amendment, mass shootings/gun violence, gun regulation \n\nSeniors \nSeniors, social security, Medicare \n\nEquality \nEquality, LGBT issues, women, women's issues, women's health, \n\ngender equality, discrimination, African Americans, Civil Rights, other \n\nspecific group advocacy , voting rights, pro-choice \n\nDebt/Spending/Rev \n\nenue/Budget \n\nBudget, debt, deficit, spending, fiscal responsibility, revenue, taxes, \n\nbureaucracy, size of government, federal reserve \n\nCivil liberties \nPrivacy, civil liberties, domestic spying, internet/net neutrality, other \nConstitutional liberties \n\nHealth care \nHealth, health care, Obamacare \n\nImmigration \nImmigration, Dream Act, border, border security \n\nJobs and Economy \nJobs, economy, growth, economic recovery, labor, government \n\nregulations, business, small business, consumer protection, Wall \n\nStreet, finance industry, stock market, agriculture, middle class, \n\npoverty, Medicaid, welfare, food stamps, minimum wage, living wage, \n\nhousing, foreclosure, trade, free trade \n\nForeign policy and \n\ndefense \n\nMilitary, defense, defense spending, drones, Benghazi, terrorism, Iran, \n\nIraq, Afghanistan, nuclear weapons, weapons mass destruction, \n\nsecurity, homeland security [NOT \"secure borders\"], specific terrorist \n\ngroup [ISIS, Al Qaeda], Israel, humanitarian, human rights, genocide, \n\nforeign aid, Middle East, other countries; regions \n\nInfrastructure \nInfrastructure, telecommunications, transportation, roads, bridges \n\n[NOTE: not including a specific local repair project] \n\nVeterans \nVeterans, VA \n\nValues, morality \nValues, morality, \"traditional marriage\" family, abortion, life, prayer in \n\nschools \n\nreligious freedom, religious values, Christianity, faith \n\nLaw and order \nLaw and order, crime, prisons, criminal justice, specific crimes, \n\nincarceration, police, sentencing, marijuana, drugs \n\nEnergy and \n\nenvironment \n\nEnergy, environment, natural resources, fishing, hunting, public lands, \n\nconservation, stewardship, climate change, global warming, water \nIdeology \nLiberal, progressive, conservative; libertarian, state's rights \n\nInequality \nInequality \nAppendix C: Descriptive Statistics \n\nMean Std. \ndev. \n\nMin \nMax \nMean \n(Dem. \nonly) \n\nMean \n(GOP \nonly) \nDistrict-\nlevel \nvariables \n\nDistrict \nideology \n(American \nideology \nproject) \n\n.009 \n.328 \n-1.086 \n.669 \n---\n---\n\nAttitudinal \ndiversity \n(American \nideology \nproject) \n\n1.284 .109 \n-.232 \n1.541 \n---\n---\n\nDemographic \nheterogeneity \n(from ACS) \n\n.544 \n.053 \n.443 \n.678 \n---\n---\n\nCandidate-\nlevel \nvariables \n\nIncumbency (% \nincumbent) \n\n44.6 \n% \n\n---\n---\n---\n41.84% 47.36% \n\nCandidate \nmismatch \n\n.752 \n.544 \n.005 \n4.357 \n.735 \n.768 \n\nCandidate \nideology \n\n.153 \n.988 \n-4.173 \n3.353 \n-.513 \n.814 \nJobs/Economy \nHealth Care \nLogit model \n(probability of \npage) \n\nLinear model \n(ambiguity \nscore) \n\nLogit model \n(probability of \npage) \n\nLinear model \n(ambiguity \nscore) \nCoeff. p \nCoeff. t \nCoeff. p \nCoeff. t \nIntercept \n\n5.118 \n<.001 \n0.401 \n11.52 \n5.647 \n<.001 \n0.455 \n11.667 \n\nParty \n\n0.188 \n.514 \n0.009 \n0.866 \n-0.942 <.001 \n-0.003 -0.33 \n\nIncumbent \n\n-0.617 .008 \n0.003 \n0.335 \n-0.318 0.089 \n0.025 \n3.252 \n\nHeterogeneity \n\n-5.763 .011 \n0.03 \n0.472 \n-8.154 <.001 \n0.081 \n1.147 \n\nMismatch \n\n-1.411 <.001 \n-0.023 -1.913 -0.923 <.001 \n-0.009 -0.761 \n\nIdeology \n\n1.166 \n<.001 \n-0.007 -0.635 0.62 \n0.003 \n-0.005 -0.432 \n\nIdeology * Party \n\n-2.496 <.001 \n-0.049 -2.417 -1.882 <.001 \n-0.035 -1.727 \n\nDemocratically owned issues: Education, veterans, and seniors \n\nEducation \nVeterans \nSeniors \nLogit model \n(probability of \npage) \n\nLinear model \n(ambiguity \nscore) \n\nLogit model \n(probability of \npage) \n\nLinear model \n(ambiguity \nscore) \n\nLogit model \n(probability \nof page) \n\nLinear model \n(ambiguity \nscore) \nCoeff. p \nCoeff \n. \n\nt \nCoeff. \np \nCoeff \n. \n\nt \nCoeff \n. \n\np \nCoeff \n. \n\nt \n\nIntercept \n\n-0.308 0.739 \n0.386 \n6.683 \n0.841 0.423 \n0.47 \n8.979 \n1.885 .077 \n0.618 10.561 \n\nParty \n\n0.785 <.001 \n0.01 \n0.575 \n0.827 0.001 \n0.022 \n1.535 \n1.255 \n\n<.00 \n1 \n-0.014 -0.826 \n\nIncumbent \n\n-0.845 <.001 \n0.031 \n2.461 \n0.054 0.777 \n0.037 \n3.615 \n0.055 0.787 \n0.034 \n2.977 \n\nHeterogeneity \n\n0.819 0.624 \n-0.03 -0.299 \n-2.72 0.155 -0.128 -1.326 -5.433 0.005 -0.228 -2.078 \n\nMismatch \n\n-0.744 0.002 \n0.045 \n2.451 \n-0.595 0.018 -0.028 -2.006 -0.906 0.002 \n0.005 \n0.285 \n\nIdeology \n\n0.404 \n0.07 -0.029 -1.477 \n0.41 0.08 \n0.008 \n0.521 \n0.405 0.147 -0.037 -2.214 \n\nIdeology * \nParty \n\n-1.29 0.001 \n0.036 \n1.108 \n-0.537 0.171 -0.055 -2.223 -1.242 0.008 \n0.012 \n0.456 \n\nRepublican owned issues: Budget/taxes, energy, and guns \n\nBudget and taxes \nEnergy \nGuns \nLogit model \n(probability \nof page) \n\nLinear model \n(ambiguity \nscore) \n\nLogit model \n(probability of \npage) \n\nLinear model \n(ambiguity \nscore) \n\nLogit model \n(probability of \npage) \n\nLinear model \n(ambiguity \nscore) \nCoeff \n. \n\np \nCoeff \n. \n\nt \nCoeff. \np \nCoeff. \nt \nCoeff. \np \nCoeff. \nt \n\nIntercept \n\n3.678 \n<.00 \n1 \n\n0.34 \n6.708 \n2.731 \n0.007 0.409 \n7.075 \n2.708 \n0.026 \n0.592 \n6.085 \n\nParty \n\n-0.652 0.008 0.019 \n1.389 \n0.187 \n0.471 -0.006 \n-0.36 \n0.184 \n0.572 \n-0.022 \n-0.806 \n\nIncumbent \n\n-0.074 0.704 0.028 \n2.873 \n0.014 \n0.942 0.029 \n2.48 \n-1.145 \n<.001 \n0.044 \n2.273 \n\nHeterogeneity \n\n-6.248 <.00 \n1 \n\n0.134 \n1.444 \n-6.66 \n<.00 \n1 \n\n0.052 \n0.487 \n-6.944 \n0.002 \n-0.18 \n-1.029 \n\nMismatch \n\n-0.646 0.018 -0.021 -1.324 -0.466 \n0.087 -0.011 \n-0.542 \n-1.195 \n0.003 \n0.031 \n1.003 \n\nIdeology \n\n1.44 \n<.00 \n1 \n\n0.006 \n0.44 \n0.964 \n<.00 \n1 \n\n0.011 \n0.585 \n2.142 \n<.001 \n-0.018 \n-0.643 \n\nIdeology * \nParty \n\n-1.26 \n0.002 -0.032 -1.195 -1.126 \n0.012 -0.054 \n-1.547 \n-2.845 \n<.001 \n0.063 \n1.183 \nImmigration and foreign policy \n\nImmigration \nForeign policy \nLogit model \n(probability of \npage) \n\nLinear model \n(ambiguity \nscore) \n\nLogit model \n(probability \nof page) \n\nLinear model \n(ambiguity \nscore) \nCoeff. p \nCoeff. \nt \nCoeff. p \nCoeff. \nt \nIntercept \n\n0.05 0.961 \n0.527 \n8.58 \n0.257 0.785 \n0.485 \n9.721 \n\nParty \n\n0.03 0.907 \n0.031 \n2.079 -0.792 0.001 \n0.022 \n1.651 \n\nIncumbent \n\n-0.899 <.001 \n0.022 \n1.867 -0.121 0.516 \n0.009 \n0.902 \n\nHeterogeneity \n\n-0.312 0.864 \n-0.166 -1.509 -0.476 \n0.78 \n-0.138 -1.538 \n\nMismatch \n\n-0.828 0.005 \n-0.005 -0.285 -0.568 0.022 \n0.001 \n0.106 \n\nIdeology \n\n1.221 <.001 \n-0.013 -0.858 \n0.651 0.003 \n-0.028 -2.705 \n\nIdeology * Party -1.679 <.001 \n\n-0.008 -0.263 -1.319 0.001 \n0.013 \n0.619 \n\n", "annotations": {"author": null, "publisher": null, "author_last_name": null, "author_first_name": null, "author_affiliation": null, "title": "[{\"end\":275,\"start\":1},{\"end\":552,\"start\":278}]", "venue": null, "abstract": null, "bib_ref": "[{\"end\":3441,\"start\":3423}]", "figure": "[{\"attributes\":{\"id\":\"tab_0\",\"type\":\"table\"},\"end\":18259,\"start\":10011}]", "paragraph": "[{\"end\":2175,\"start\":776},{\"end\":3287,\"start\":2177},{\"end\":4341,\"start\":3289},{\"end\":4966,\"start\":4390},{\"end\":5439,\"start\":5187},{\"end\":6518,\"start\":5441},{\"end\":6798,\"start\":6566},{\"end\":7252,\"start\":6800},{\"end\":10010,\"start\":7476}]", "formula": "[{\"attributes\":{\"id\":\"formula_0\"},\"end\":5018,\"start\":4967},{\"attributes\":{\"id\":\"formula_1\"},\"end\":5186,\"start\":5018},{\"attributes\":{\"id\":\"formula_2\"},\"end\":7475,\"start\":7253}]", "table_ref": "[{\"end\":4952,\"start\":4945},{\"end\":6746,\"start\":6739},{\"end\":6867,\"start\":6860},{\"end\":9465,\"start\":9458}]", "section_header": "[{\"end\":758,\"start\":677},{\"end\":774,\"start\":761},{\"end\":4388,\"start\":4344},{\"end\":6564,\"start\":6521}]", "table": "[{\"end\":18259,\"start\":10131}]", "figure_caption": "[{\"end\":10131,\"start\":10013}]", "figure_ref": null, "bib_author_first_name": null, "bib_author_last_name": null, "bib_entry": null, "bib_title": null, "bib_author": null, "bib_venue": null}}}, "year": 2023, "month": 12, "day": 17}