{"id": 60116106, "updated": "2022-02-26 17:45:35.078", "metadata": {"title": "The British Library", "authors": "[{\"first\":\"J.\",\"last\":\"Smethurst\",\"middle\":[\"Michael\"]}]", "venue": null, "journal": "Collection Management", "publication_date": {"year": 1992, "month": null, "day": null}, "abstract": "A feriM of dibeozo macrocyclic (etrumiiie ligands with 14-, 15-, 16-, 17and 19-membered inner great lings (L*^ to L '* ) has been synthesized to investigate the effect o f ring size variation on their coo4>lexatioo behaviour with the metal-ions, Ni(Il), Zn(ll) and Cd(II). The atnictures of L '^ and have been determined and are discussed in Chapter 2. A comparative study of ligand conformations and hole-sizes across a series of four macrocycles is presented. The variation of features o f the 'H and *’ C NMR spectra implies a comparatively high conformational rigidity in L**. The NM R spectra of L ‘* and L ” indicate 'H -'*N spin-spin coupling for the anilino, but not for the benzylamino donors, showing that the intramolecular H-bonding of the anilino protons obtoved in the solid state is partially retained in solution. A comparative discussion of a range of N i(Il) complexes of the ligands is presented in Chapter 3. X-Ray crystallographic studies have been carried out on [NiL'^Cl2l and on the thiocyanate complexes of L**. L ‘* and L*’ which are compared with that of L*^. An inverse correlation between the in-plane and axial bond lengths around the Ni-atoms holds up to L“ . Complexes of and with nickel(ll) nitrate have been prepared and the crystal structure of that o f L'^ conuins two complexes. (NiL'^(NC>3)2) and [N ìL '‘ (N 0 3KH2 0 )]N 0 3 . Cyclic volumetry shows that the formation of the Ni(lII) species is facilitated by the smaller ligands; the oxidation of (NiL*^Cl2l is non-reversible and probably ligand-baaed. The visible spectra of the chloride and thiocyarute complexes have been assigned in terms o f weak tettagorud-fteld splining which is signifícant only for at>d L'^, the larger ligartds giving essentially octahedral", "fields_of_study": "[\"Computer Science\"]", "external_ids": {"arxiv": null, "mag": "2318364720", "acl": null, "pubmed": null, "pubmedcentral": null, "dblp": null, "doi": "10.1300/j105v15n01_04"}}, "content": {"source": {"pdf_hash": "00008771d5ab09efade146d5993ea674cd38f318", "pdf_src": "CiteSeerX", "pdf_uri": "[\"http://www.ifla.org/IV/ifla73/papers/147-Brazier-en.pdf\"]", "oa_url_match": false, "oa_info": null}, "grobid": {"id": "357da902cffe2de56524a77e46348af71ded5f40", "type": "plain-text", "url": "s3://ai2-s2-pdf-extraction-prod/parse-results/s2orc_worker/00008771d5ab09efade146d5993ea674cd38f318.txt", "contents": "\n47 IFLA-CDNL Alliance for Bibliographic Standards (ICABS) Simultaneous Interpretation: Yes WORLD LIBRARY AND INFORMATION CONGRESS: 73RD IFLA GENERAL CONFERENCE AND COUNCIL Yahoo & Microsoft Have Talked Partnering, Merging\nDate : 25/05/2007 19-23 August 2007,\n\n\nDurbanSouth Africa\n\n47 IFLA-CDNL Alliance for Bibliographic Standards (ICABS) Simultaneous Interpretation: Yes WORLD LIBRARY AND INFORMATION CONGRESS: 73RD IFLA GENERAL CONFERENCE AND COUNCIL Yahoo & Microsoft Have Talked Partnering, Merging\nDate : 25/05/2007 19-23 August 2007,Don't turn off the lights yet! New directions for bibliographic services Caroline Brazier British Library Meeting:\n\n\nIntroduction\n\nThe online library catalogue and the future of library bibliographic services are hot topics within the community at present. For those of us who work within this core area it is a challenging time. But it should not be a pessimistic time. I'd like to argue today that there are several new directions we can go in, which build on the valuable work of the past. I don't know about your email inbox, but I get several emails a day telling me about new search services and technologies or the latest company takeover which will allow them to develop the new information services that people appear to be rushing to use. It is easy to feel pessimistic, when libraries do not seem to be creative enough, fast enough or rich enough to compete.\n\nAnd there can be a certain sense of doom and gloom in the profession. Karen Markey urges the profession in her D-Lib think piece earlier this year that \"the time is right to rethink library cataloging and online catalogs\". But she also warns that \"should we fail to act until all the books are digitized and the copyright problems are solved, the last person to leave the digitization workroom may be turning off the lights on the library\".\n\nSo what can we do to ensure that the lights don't get turned off on us? The know the world we work in is rapidly changing. OCLC tell us that 84% of undergraduates start their projects in Google and not at their library catalogue. And we can see from the rankings of the most heavily used websites that even the largest library sites and global catalogues are very far down the list.\n\nThere is plenty of debate in the professional literature and blogs, and many different views and recommendations. We don't have time to revisit them all here today. But what is clear is that we must engage and interact more directly with user communities than we have in the past, so their knowledge and experiences can help shape and enrich the search and navigation of library collections and the wider internet in the future.\n\nI'd like to tell you a little about how the British Library is taking some of these ideas forward. There is no single definition of web 2.0 or library 2.0. It can cover a wide spectrum of activities and developments. I see such developments as falling into 2 broad categories. I've called these \"bringing the user into the library\" and \"taking the library service to the user\".\n\nBy \"bringing the user into the library service\", I do not mean bringing them physically into buildings (although that would be great if it also happened). I mean involving the user in the development of our next generation of networked information services. We need to integrate user content into developing traditional services such as library catalogues -integration by means of tagging, recommendations, reviews and bibliowikis. Where the services are on a large enough scale we can also use analysis of patterns of user behaviour to develop the services, to provide links between content. We need to rethink the catalogue and what it offers, but it remains the core way into our collections.\n\nBy \"taking the library service to the user\" I mean making sure the library is visible in social networking spaces. While this is a core way of marketing the library, it also is a core way of delivering services and integrating core services into the spaces where users choose to spend time. Social science staff are looking at new ways to engage with researchers and showcase social science resources through and beyond the catalogue Participate in selected social science blogs to raise awareness of and link to collection Work with social scientists to tag, review and recommend resources from the collection Provide current awareness feeds to researchers on developments in social science information environment Experimentation needed before we can really assess the best long term approaches Social science staff are looking at new ways to engage with researchers and to showcase the richness of library collections for social sciences both through and beyond the catalogue.\n\nThey are developing a strategy that will involve participation by social science librarians in selected blogs and wikis to raise awareness of and provide links into the collection. They will also work with social scientists to develop the addition of tagging, reviewing and recommending of resources through the catalogue to others in the community.\n\nThey will provide current awareness feeds to researchers on new resources from the catalogue and also on more general developments in resources for social scientists. This is at an early stage and they are still discussing with the community what services they would value most.\n\nThe question of whether we should attempt to moderate content or context provided by researchers has been raised both by library staff and by users within the community. Do we have the resources to do it? What is the legal liability for malicious or defamatory content? How do we ensure the reliability and authority of content that can be edited by anyone? We do not have definitive answers to these questions yet, but it is clear that it will require a change in mindset from both library staff and users, as well as different skills in using and evaluating catalogues in a web 2.0 environment. We realise that a period of experimentation is needed before we can really assess the best approaches and what will have long term value for the community. Web 2.0 offers great potential to allow users to engage with materials that would have been closed to many of them in the non digital world. This is an image from the Arundel Psalter (Arundel MS 155, fo. 53). This MS was produced in Canterbury in the early 11th century. This image shows an illuminated initial and border at the beginning of psalm 51.\n\nWeb 2.0 services offer great potential to allow users to engage with materials that would have been closed to many of them in the non digital world. Manuscript collections are a great example of this. I'd like to suggest two ways in which we can develop these services -by opening up to new users and by engaging traditional scholars in new ways. A lot of the potential of web 2.0 can only de delivered through new technology, which many libraries do not yet have. The British Library has developed the \"Turning The Pages\" software so that many of our rare and beautiful treasures can be made more publicly available. In this example you can see how the development of digital \"post it notes\" allows users to annotate and comment, both for public and private display.  The use of API's (Application Programming Interfaces) also offer new ways to deliver resource discovery services. This example comes from the virtual exhibition accompanying the SACRED exhibition. It allows users to search thematically (in this case by religion), chronologically and geographically. But the model has the potential to be applied to larger bodies of content in major catalogues or digital datasets. The mashup of library data with Google Earth allows users to select and explore geographical aspects more fully. In this example, we are able to zoom in to the location of St. Catherine's monastery at the foot of Mount Sinai, where the manuscript in question, Codex Sinaiticus was preserved for many centuries.\n\n\nSlide 11\n\n10 Manuscripts and Web 2.0 -working with small communities Work with small scale expert communities to enrich manuscript descriptions with tagging, wikis, debate Addition of content to bibliography to keep it more up to date Wiki style debate on library supplied description e.g. dates\n\nIssues for smaller communities Fear amongst the \"older generation\" of giving away research \"secrets\" before publication Uncertain yet how much small, expert groups want these services Experimentation needed before we can really assess the best long term approaches\n\nAs with social sciences, there are various ways in which manuscript curators are thinking of developing services. They are currently developing plans to work with small groups of medieval and art historians to enrich manuscript cataloguing descriptions with tagging and wikis.\n\nThe same questions of ensuring the reliability, accuracy and authority of the information have been raised with regard to these manuscript projects too, even though the initial work would be with groups who are clearly experts in related fields.\n\nThe current thinking is to allow direct editing of and additions to library supplied content such as entries in bibliographies and related information. However, we will probably not allow direct editing of library supplied fields containing information such as dates attributed to manuscripts. Instead we would encourage adding to any debate through wiki type entries where there was any disagreement or controversy over the data.\n\nSome groups of academics consulted so far are concerned about other web 2.0 services, especially \"more like this \" type services, where links between related collection items are built on the basis of what previous researchers have looked at. Where the community involved, even internationally, is a small one, fears have been expressed that this could give away a researcher's line of thought. If they have established a previously unknown link or connection between two manuscripts they do not want to share that before publication. We will obviously have to be sensitive to such concerns. While this may be a concern more of the older generation of researchers rather than younger generations, we will obviously need to experiment further to see what services really meet the needs of particular communities.\n\n\nSlide 12\n\n\n11\n\n\nUK PubMedCentral\n\nMirrors the NLM PMC database and is developing a manuscript submission system for UK scientists\n\nDeveloping innovative tools to further support the biomedical research process, including management of UK author identities UK Names Agency Project to be established Combining best practice from Library name authority control operations with new applications within the research community e.g. grants management systems, identify institutional affiliations, build specialist community links UK PubMed Central is a free digital archive of biomedical and life sciences journal literature UK PubMedCentral is a new project to create a free, digital archive of biomedical and life science journal literature. The content will be a mirror of the National Library of Medicine PubMedCentral site, but will be enhanced by submission of articles and research reports by UK based researchers.\n\nAs part of UKPMC, there is an interesting development which extends the traditional library role of name authority control. In library catalogues, we've long met the requirement to identify individuals reliably and uniquely. However, this requirement also needs to be met in the growing number of digital repositories. And it is also a prime requirement in systems being built to support the research process, including the control of grant applications and awards. What will it take to apply library authority control techniques and models to the sometimes fluid relationships between individual researchers, academic and research institutions and research groups?\n\nThe British Library is a partner in the UK Names Agency Project. This project will create a database of information about researchers that can be used to support the research process, from early stages by grant awarding bodies and research councils through to submission of research outputs and search and navigation of the digital repositories, such as UKPMC.\n\nThe database will consist of a combination of data submitted by authors at the time of submitting grant applications or depositing research outputs into UKPMC and name authority control provided by the Library. Authors can authenticate and enrich their \"name\" record directly or through the library, and the library will develop the links to their articles in UKPMC and related content elsewhere.\n\nThe development phase of the Names project will build on the work previously undertaken by the IFLA Working Group on Functional Requirements of Authority Records (FRAR). An increasing amount of network activity takes place on these sites, judging by the ranking we looked at earlier. What can libraries do to be active in those spaces and to provide a bridge back to library services that people might not otherwise find or consider relevant? But as well as developing the services from your own website, there is huge potential in developing and positioning services within external social networking sites. This example is from the British Library Book Club which has been set up in facebook. As well as a way of engaging broad groups in discussion on books, it provides an opportunity for linking back to other information resources in the library such as webpages on the collection or to the catalogue.\n\n\nSlide 16\n\n16\n\n\nCreative marketing\n\nWe need to be prepared to use as many different approaches as possible.\n\nWe need to be prepared to use as many different approaches as possible to promote and link to library services. In this example, we have made video introductions to the library services available on YouTube as well as on the Library's own website. The \"hit\" here is that this is introduced by Tim Campbell, the winner of a major BBC reality TV show called The Apprentice. By showing the richness of the collections and the range of services on offer to visitors and researchers in this video, we can raise the profile and establish links back into the core services, through webpage links and the catalogue.\n\n\nSlide 17\n\n16\n\n\nConclusions\n\nWed 2.0 provides us with huge opportunities to enhance traditional bibliographic services through new services and by linking them into the broader networked environment\n\nIn conclusion, web 2.0 provides us with huge opportunities to enhance traditional bibliographic services, by directly improving and adapting the services themselves and also by linking them into the broader networked environment.\n\nThere are challenges in these developments, not least having the technology to use. But we need to be willing to change and take new opportunities.\n\nIt is fundamental that we are willing to work with user communities in new ways. There is not a \"one size fits all\" in web 2.0 or library 2.0 models. Much will depend on the technology that we will have at our disposal. But more importantly we need to be willing to experiment and find out what works for different types of communities.\n\n\nThe world we work inD ig g: P o w e r to th e P e o p le , o r R e c ip e fo r D is a s te r? ------------------------------------------------------------D ig g u s e rs s ta g e d a re v o lt th is w e e k w h e n th e s it e 's a d m in is tr a to rs tr ie d to re m o v e a rt ic le s Go og le − Th e Th rea t To Me dia An d Inf orm ati on Are Book Reviewers Out of Print? Is th is th e li b ra ry o f th e fu tu re ? T h e w o rd li b ra ry is s e t to fa d e fr o m o u r v o c a b u la ry…\n\n\nManuscripts and Web 2.0 -new ways to search and discoverMashups with other technologies offer new ways to search for, discover and display content.\n\n\nInteractive maps allowing thematic, chronological and geographic searching. From the virtual exhibition accompanying the SACRED exhibition.\n\n\nManuscripts and Web 2.0 -new ways to search and discoverInteractive maps allowing thematic, chronological and geographic searching. From the virtual exhibition accompanying the SACRED exhibition.\n\n\nthe library service to the user We need to go beyond the traditional limits of bibliographic and library services to ensure relevance in the new networked environment We need to develop new services in the spaces where current and future generations of users work and play These can provide a bridge back to traditional services for new users who might not otherwise find them or consider them relevant While web 2.0 ideas and technologies allow us to develop the traditional library services, the real challenge is how to develop our services in the new social networking spaces outside the library.\n\nSlide 3 3\n3The world we work in84% of undergraduates start research for their projects in Google (OCLC)Most used websites in the UKBritish Library = 1,317 th \n\nWorldcat = 6,409 th \n\n*Hitwise.co.uk April 2007 \n\n21 \nWikipedia \n\n20 \nFacebook \n\n14 \nAmazon \n\n13 \nYouTube \n\n11 \nBBC \n\n7 \nMySpace \n\n1 \nGoogle \n\nRank* \n\n\n\nSlide 4 4\n4What is the potential of Web 2.0?No single definition of web 2.0 or library 2.0 \n\nCan cover a wide spectrum of activities ranging from \nBringing the user into the library \nIntegrating user content in to traditional library \nservices \ne.g. tagging, recommending, reviews, wikis \nto \nTaking the library service to the user \nMoving the Library in to social networking spaces \nRadical new approaches for marketing services \n\n\n\nSlide 8 7\n8Manuscripts and Web 2.0 -Turning The PagesTurning The \nPages \nallows users \nto annotate \nwith \ncomments \nthat can be \nprivate or \npublicly \ndisplayed. \n\nIllumination from \n\"Golf Book\" (16 th \ncentury Flemish. \nBritish Library \nAdd MS 24098) \n\n\n\nSlide 14 14\n14Downloads, podcasts and webcastsDownloads, podcasts and webcasts can all make library collections and services more visible and accessible. They can link to and from library websites, online catalogues and other access points. The examples here are from interviews with authors or public lectures held in the library.Downloads, \npodcasts and \nwebcasts can all \ntake library \nservices into \nusers' working \nand living \nenvironments, \nincluding on the \nmove. They can \nbe linked from and \nlink back to \ntraditional \nbibliographic \nservices such as \nonline catalogues. \n\nSlide 15 \n\n15 \n\nSocial networking \n\nDeveloping \nand \npositioning \nservices \nwithin social \nnetworking \nsites can also \nbe an \neffective way \nof enhancing \ntraditional \nbibliographic \nservices. \n\n\nWe need to be willing to change and take new opportunities We need to be willing to work with communities in new ways We need to be willing to experiment and find out what works for different types of communities But there are ways in which we can build on our traditional strengths and services in a fully networked worldWe will need to be creative, but there are ways in which we can build on our traditional strengths and continue to deliver world class services for a fully networked world.Thank you.\nThe Online Library Catalog. Paradise Lost and Paradise Regained?\" in D-Lib Magazine. Karen Markey, 13Number 1-2 ISSN 1082-9873 2. Perceptions of Libraries and Information Resources: A Report to the OCLC MembershipKaren Markey \"The Online Library Catalog. Paradise Lost and Paradise Regained?\" in D-Lib Magazine, January/February 2007, Volume 13 Number 1-2 ISSN 1082-9873 2. Perceptions of Libraries and Information Resources: A Report to the OCLC Membership.\n\nOCLC, 2005. ISBN 1556533640 and the companion report College Students' Perceptions of Libraries and Information Resources: A Report to the OCLC Membership. OCLC. 1556533659OCLC, 2005. ISBN 1556533640 and the companion report College Students' Perceptions of Libraries and Information Resources: A Report to the OCLC Membership. OCLC, 2006 ISBN 1556533659\n\nWebsite rankings for the UK for. Website rankings for the UK for April 2007 from www.hitwise.co.uk\n\n. BL website can be. BL website can be found at http://www.bl.uk/\n\n. UK PubMedCentral can be. UK PubMedCentral can be found at http://ukpmc.ac.uk/\n", "annotations": {"author": "[{\"end\":281,\"start\":261}]", "publisher": null, "author_last_name": null, "author_first_name": null, "author_affiliation": "[{\"end\":280,\"start\":262}]", "title": "[{\"end\":222,\"start\":1},{\"end\":503,\"start\":282}]", "venue": null, "abstract": null, "bib_ref": null, "figure": "[{\"attributes\":{\"id\":\"fig_0\"},\"end\":15675,\"start\":15178},{\"attributes\":{\"id\":\"fig_2\"},\"end\":15825,\"start\":15676},{\"attributes\":{\"id\":\"fig_3\"},\"end\":15967,\"start\":15826},{\"attributes\":{\"id\":\"fig_4\"},\"end\":16165,\"start\":15968},{\"attributes\":{\"id\":\"fig_5\"},\"end\":16768,\"start\":16166},{\"attributes\":{\"id\":\"tab_0\",\"type\":\"table\"},\"end\":17081,\"start\":16769},{\"attributes\":{\"id\":\"tab_1\",\"type\":\"table\"},\"end\":17515,\"start\":17082},{\"attributes\":{\"id\":\"tab_3\",\"type\":\"table\"},\"end\":17771,\"start\":17516},{\"attributes\":{\"id\":\"tab_4\",\"type\":\"table\"},\"end\":18550,\"start\":17772}]", "paragraph": "[{\"end\":1409,\"start\":671},{\"end\":1851,\"start\":1411},{\"end\":2235,\"start\":1853},{\"end\":2665,\"start\":2237},{\"end\":3044,\"start\":2667},{\"end\":3741,\"start\":3046},{\"end\":4722,\"start\":3743},{\"end\":5073,\"start\":4724},{\"end\":5353,\"start\":5075},{\"end\":6459,\"start\":5355},{\"end\":7955,\"start\":6461},{\"end\":8253,\"start\":7968},{\"end\":8519,\"start\":8255},{\"end\":8797,\"start\":8521},{\"end\":9044,\"start\":8799},{\"end\":9476,\"start\":9046},{\"end\":10289,\"start\":9478},{\"end\":10421,\"start\":10326},{\"end\":11206,\"start\":10423},{\"end\":11873,\"start\":11208},{\"end\":12235,\"start\":11875},{\"end\":12633,\"start\":12237},{\"end\":13541,\"start\":12635},{\"end\":13556,\"start\":13554},{\"end\":13650,\"start\":13579},{\"end\":14259,\"start\":13652},{\"end\":14274,\"start\":14272},{\"end\":14459,\"start\":14290},{\"end\":14690,\"start\":14461},{\"end\":14839,\"start\":14692},{\"end\":15177,\"start\":14841}]", "formula": null, "table_ref": null, "section_header": "[{\"end\":669,\"start\":657},{\"end\":7966,\"start\":7958},{\"end\":10300,\"start\":10292},{\"end\":10305,\"start\":10303},{\"end\":10324,\"start\":10308},{\"end\":13552,\"start\":13544},{\"end\":13577,\"start\":13559},{\"end\":14270,\"start\":14262},{\"end\":14288,\"start\":14277},{\"end\":16779,\"start\":16770},{\"end\":17092,\"start\":17083},{\"end\":17526,\"start\":17517},{\"end\":17784,\"start\":17773}]", "table": "[{\"end\":17081,\"start\":16901},{\"end\":17515,\"start\":17127},{\"end\":17771,\"start\":17570},{\"end\":18550,\"start\":18104}]", "figure_caption": "[{\"end\":15675,\"start\":15180},{\"end\":15825,\"start\":15678},{\"end\":15967,\"start\":15828},{\"end\":16165,\"start\":15970},{\"end\":16768,\"start\":16168},{\"end\":16901,\"start\":16781},{\"end\":17127,\"start\":17094},{\"end\":17570,\"start\":17528},{\"end\":18104,\"start\":17787}]", "figure_ref": null, "bib_author_first_name": "[{\"end\":19146,\"start\":19141}]", "bib_author_last_name": "[{\"end\":19153,\"start\":19147}]", "bib_entry": "[{\"attributes\":{\"id\":\"b0\"},\"end\":19514,\"start\":19056},{\"attributes\":{\"id\":\"b1\"},\"end\":19870,\"start\":19516},{\"attributes\":{\"id\":\"b2\"},\"end\":19970,\"start\":19872},{\"attributes\":{\"id\":\"b3\"},\"end\":20037,\"start\":19972},{\"attributes\":{\"id\":\"b4\"},\"end\":20118,\"start\":20039}]", "bib_title": null, "bib_author": "[{\"end\":19155,\"start\":19141}]", "bib_venue": "[{\"end\":19139,\"start\":19056},{\"end\":19676,\"start\":19516},{\"end\":19903,\"start\":19872},{\"end\":19991,\"start\":19974},{\"end\":20064,\"start\":20041}]"}}}, "year": 2023, "month": 12, "day": 17}