{"id": 6137303, "updated": "2023-12-10 17:22:20.642", "metadata": {"title": "On the power of non-local boxes", "authors": "[{\"first\":\"A.\",\"last\":\"Broadbent\",\"middle\":[]},{\"first\":\"A.\",\"last\":\"Methot\",\"middle\":[\"A.\"]}]", "venue": "Theoretical Computer Science C 358: 3-14, 2006", "journal": null, "publication_date": {"year": 2005, "month": null, "day": null}, "abstract": "A non-local box is a virtual device that has the following property: given that Alice inputs a bit at her end of the device and that Bob does likewise, it produces two bits, one at Alice's end and one at Bob's end, such that the XOR of the outputs is equal to the AND of the inputs. This box, inspired from the CHSH inequality, was first proposed by Popescu and Rohrlich to examine the question: given that a maximally entangled pair of qubits is non-local, why is it not maximally non-local? We believe that understanding the power of this box will yield insight into the non-locality of quantum mechanics. It was shown recently by Cerf, Gisin, Massar and Popescu, that this imaginary device is able to simulate correlations from any measurement on a singlet state. Here, we show that the non-local box can in fact do much more: through the simulation of the magic square pseudo-telepathy game and the Mermin-GHZ pseudo-telepathy game, we show that the non-local box can simulate quantum correlations that no entangled pair of qubits can in a bipartite scenario and even in a multi-party scenario. Finally we show that a single non-local box cannot simulate all quantum correlations and propose a generalization for a multi-party non-local box. In particular, we show quantum correlations whose simulation requires an exponential amount of non-local boxes, in the number of maximally entangled qubit pairs.", "fields_of_study": "[\"Physics\"]", "external_ids": {"arxiv": null, "mag": "1963717362", "acl": null, "pubmed": null, "pubmedcentral": null, "dblp": "journals/tcs/BroadbentM06", "doi": "10.1016/j.tcs.2005.08.035"}}, "content": {"source": {"pdf_hash": "f120a7e9d229f79a43c3cf2b77df110d4421a6f3", "pdf_src": "Arxiv", "pdf_uri": "[\"https://export.arxiv.org/pdf/quant-ph/0504136v3.pdf\"]", "oa_url_match": false, "oa_info": {"license": "elsevier-specific: oa user license", "open_access_url": "https://doi.org/10.1016/j.tcs.2005.08.035", "status": "BRONZE"}}, "grobid": {"id": "4c43f930ffc89de9c2c360fd9ef0868e7af48738", "type": "plain-text", "url": "s3://ai2-s2-pdf-extraction-prod/parse-results/s2orc_worker/f120a7e9d229f79a43c3cf2b77df110d4421a6f3.txt", "contents": "\narXiv:quant-ph/0504136v3 7 Nov 2005 On the power of non-local boxes\nRevised August 19, 2005\n\nAnne Broadbent broadbea@iro.umontreal.ca \nDépartement d'informatique et de recherche opérationnelle Université de Montréal\nSucc. Centre-Ville Montréal (QC)\nC.P. 6128, H3C 3J7Canada\n\nAndré Allan Méthot methotan@iro.umontreal.ca \nDépartement d'informatique et de recherche opérationnelle Université de Montréal\nSucc. Centre-Ville Montréal (QC)\nC.P. 6128, H3C 3J7Canada\n\narXiv:quant-ph/0504136v3 7 Nov 2005 On the power of non-local boxes\nRevised August 19, 2005\nA non-local box is a virtual device that has the following property: given that Alice inputs a bit at her end of the device and that Bob does likewise, it produces two bits, one at Alice's end and one at Bob's end, such that the XOR of the outputs is equal to the AN D of the inputs. This box, inspired from the CHSH inequality, was first proposed by Popescu and Rohrlich to examine the question: given that a maximally entangled pair of qubits is non-local, why is it not maximally non-local? We believe that understanding the power of this box will yield insight into the non-locality of quantum mechanics. It was shown recently by Cerf, Gisin, Massar and Popescu, that this imaginary device is able to simulate correlations from any measurement on a singlet state. Here, we show that the non-local box can in fact do much more: through the simulation of the magic square pseudo-telepathy game and the Mermin-GHZ pseudo-telepathy game, we show that the non-local box can simulate quantum correlations that no entangled pair of qubits can, in a bipartite scenario and even in a multi-party scenario. Finally we show that a single non-local box cannot simulate all quantum correlations and propose a generalization for a multi-party non-local box. In particular, we show quantum correlations whose simulation requires an exponential amount of non-local boxes, in the number of maximally entangled qubit pairs.Definition 2. A winning strategy for a bipartite game G = (X, Y, R) is a strategy according to which for every x (A) ∈ X (A) and x (B) ∈ X (B) , Alice and Bob output y (A) ∈ Y (A) and y (B) ∈ Y (B) respectively such that (x (A) , x (B) , y (A) , y (B) ) ∈ R.Definition 3. We say that a bipartite game G exhibits pseudo-telepathy if bipartite measurements of an entangled quantum state can yield a winning strategy, whereas no classical strategy that does not involve communication is a winning strategy.The generalization to multi-party pseudo-telepathy to be taken is the natural one. For a complete survey on pseudo-telepathy, please see[12].Definition 4. A non-local protocol is a purely classical protocol where the participants are not allowed communication but are allowed the use of NLBs.Definition 5. A protocol simulates the correlations of a pseudo-telepathy game if, in addition to yielding a winning strategy, the probabilities P r(Y (A) , Y (B) |X (A) , X (B) ) are identical to those of a quantum winning strategy.\n\nIntroduction\n\nIn a 1964 influential paper, Bell showed that there exist correlations that can be obtained from bipartite measurements of a quantum state that no local realistic theory can reproduce [1]. From this, if one believes that quantum mechanics is a correct description of the world, one is forced to conclude that Nature is fundamentally non-local. This astounding discovery has lead to a rich and still developing literature. One of the best known papers in the field is the 1969 experimental proposition of Clauser, Horne, Shimony and Holt [2]. The authors put forth an inequality which all local hidden variable (LHV) models must satisfy:\n| A 1 B 1 + A 1 B 2 + A 2 B 1 − A 2 B 2 | ≤ 2,(1)\nwhere A 1 and A 2 are local spin measurements of a spin-half particle on Alice's subsystem and B 1 and B 2 are measurements on Bob's subsystem. While any LHV model has to abide by this rule, quantum mechanics can violate Inequality 1 by an appropriate choice of measurements on a maximally entangled state, such as |ψ − = (| + − − | − + )/ √ 2:\n| A 1 B 1 + A 1 B 2 + A 2 B 1 − A 2 B 2 | = 2 √ 2.(2)\nThis result may also be interpreted in a more intuitive fashion [3]: if Alice and Bob want to play a game, called the CHSH game, where they are each given as input a bit, x (A) and x (B) respectively, and they want to produce output bits y (A) and y (B) respectively such that\nx (A) ∧ x (B) = y (A) ⊕ y (B) ,(3)\nthen there is no classical (LHV) strategy that can help them win this game with a probability greater than 3/4, but if they share the quantum state |ψ − = (|01 − |10 )/ √ 2, then they can succeed with probability cos 2 (π/8) ≈ 0.85 [2].\n\nMany years later, Popescu and Rohrlich [4] asked a natural question: why not more? Given that quantum mechanics is non-local, why is it not maximally non-local? Many authors have studied this question [5,6,7,8,9] and we will discuss their results in Section 4. Besides this intriguing question, Popescu and Rohrlich suggested something else of interest, a gedanken product: the non-local box (NLB). A NLB is a virtual device that has two ends and the following property: if Alice inputs a bit into her end of the NLB and Bob does likewise, then they will both receive a bit from the NLB such that the condition of Equation 3 is always respected, and such that all solutions are equally likely. It is important to note that this device does not allow faster than light communication [4].\n\nRecently, Cerf, Gisin, Massar and Popescu built on the work of Toner and Bacon [10] and used a NLB to simulate the correlations obtained from any bipartite measurement of a maximally entangled pair of qubits, |ψ − , without any communication [11]. This result shows that signaling information on the inputs is not necessary for a perfect simulation of quantum correlations. The long term aim of this work is to characterize the NLB in order to yield insights into the non-locality of Nature.\n\nIn this paper, we want to push this research further. The NLB was inspired from the CHSH inequality, which is often thought as the generic inequality for non-locality, and it can also simulate the correlations of a maximally entangled pair of qubits. From this, it is tempting to draw an analogy between the NLB and the maximally entangled pair of qubits. We will show however that a single NLB can be used to accomplish a distributed task that cannot be accomplished with only a maximally entangled pair of qubits. In particular, we will study pseudo-telepathy and show simulations of some pseudo-telepathy games with one NLB where the quantum strategy requires more than a maximally entangled pair of qubits to succeed. We will also give limitations on what a single NLB can achieve and propose a generalization of the NLB to the multi-party setting.\n\n\nMagic square game\n\nWe saw in Section 1 that one use of an NLB can give the correlations of any bipartite measurement on |ψ − without any communication. A natural question would be to ask whether it can give us more. In particular, are there correlations that can only be obtained by bipartite measurements of an entangled state of more than a pair of qubits, but that can be simulated with one use of an NLB? In this Section, we answer affirmatively by showing a pseudo-telepathy game, the magic square game [13], that requires more than an entangled state of two qubits in the quantum winning strategy, yet only one use of an NLB suffices to yield a non-local winning strategy. We also give a non-local strategy that makes use of a single NLB and that simulates the magic square correlations. 3 ), such that:\ny (A) 3 = y (A) 1 ⊕ y (A) 2 y (B) 3 = y (B) 1 ⊕ y (B) 2 ⊕ 1 y (A) x (B) = y (B) x (A) .(4)\nHere, and in all future definitions of bipartite games, it is understood that (x (A) , x (B) , y (A) , y (B) ) ∈ R if and only if the given equations are satisfied.\n\nIt is known that the magic square game is a pseudo-telepathy game: the best classical players can do is succeed on 8/9 of the possible inputs, whereas players with the shared entangled state |ψ = 1 2 |0011 − 1 2 |0110 − 1 2 |1001 + 1 2 |1100 (two maximally entangled pairs of qubits), where Alice has the first two qubits and Bob the last two qubits, have a quantum winning strategy [12].\n\nIt is useful here to mention that a magic square is a 3 × 3 matrix with binary entries such that the sum of each row is even and the sum of each column is odd. It is obvious that such a magic square does not exist, yet Alice and Bob's output bits (as defined in Equation 4) fit perfectly into a magic square: we place Alice's three output bits in the x (A) th row and Bob's three output bits in the x (B) th column. Using this same construction, we can represent a player's strategy as a 3 × 3 binary matrix. Lemma 1. No quantum strategy can win the magic square game with probability one if the participants share only an entangled pair of qubits, |ψ = α|00 + β|11 .\n\nProof. The proof is straightforward from Brassard, Méthot and Tapp [14], where the authors show that there cannot exist a protocol that exhibits pseudo-telepathy where the quantum strategy makes use of a pair of entangled qubits. Theorem 1. The magic square game can be won classically with probability one if the participants are allowed one bit of communication.\n\nProof. Alice and Bob agree ahead of time on a two strategies, say 0 and 1. Strategy 0 yields a correct answer for all inputs except when x (A) = x (B) = 3, and strategy 1 yields a correct answer when x (A) = x (B) = 3. Furthermore, strategies 0 and 1 can be chosen such that Alice's outcomes are identical for both strategies. We give an example of such strategies in Figure 1. Alice and Bob's final strategy is for Alice to send a single bit to Bob, indicating whether or not x (A) = 3. If x (A) = 3, Bob acts according to strategy 0, otherwise he uses strategy 1. It is easy to check that with this strategy, Alice and Bob always win.  Proof. Since, in the quantum strategy, Alice's and Bob's density matrices are totally mixed, the local outputs of their von Neumann measurements are uniformly distributed among all possible outputs respecting the conditions of Definition 6. Now in the classical protocol, Alice and Bob agree on strategies 0 and 1 as in the proof of Theorem 1, but they use shared randomness to choose the strategies uniformly at random among all strategies that fit the construction. With this strategy, Alice and Bob's outcomes are distributed uniformly at random among all possible winning outcomes.\n\nTheorem 3. There exists a non-local winning strategy for the magic square game that makes use of a single NLB.\n\nProof. Alice and Bob each have two strategies, say A0 and A1 for Alice and B0 and B1 for Bob. Both of Alice's strategies respect the condition y 3 . Such strategies (A0, A1, B0 and B1) are easy to find. Alice and Bob use an NLB to determine which strategy each player uses: they both input in the NLB whether x (A) = 3 or whether x (B) = 3. They then independently use the output of the NLB, z (A) and z (B) to determine the strategy to use (Az (A) for Alice, Bz (B) for Bob).\n\nNote that by virtue of the NLB, Alice and Bob will have z (A) = z (B) as long as x A = 3 or x B = 3. Strategies (A0, B0) and (A1, B1) will yield correct answers in this case. If, however, both x (A) = 3 and x (B) = 3, then Alice and Bob will answer according to strategies (A0, B1) or (A1, B0). But these strategies are coordinated so that y 3 , so their answer is correct.\n(A) 3 = y (B)Theorem 4.\nThere exists a non-local protocol that simulates the magic square correlations with a single use of an NLB.\n\nProof. The proof is similar to the proof of Theorem 2: all that Alice and Bob must do in order to simulate the magic square correlations is apply the strategy given in the proof of Theorem 3, but with strategies A0, A1, B0 and B1 chosen among all possible such strategies according to the uniform distribution. Then Alice and Bob's outcomes are distributed uniformly at random and Definition 6 is satisfied.\n\nFrom Lemma 1 and Theorem 4, we get the following Corollary: Corollary 1. An NLB can simulate bipartite correlations that no entangled pair of qubits, |ψ = α|00 + β|11 , can.\n\n\nMermin-GHZ game\n\nIn this Section, we add to the demonstration of the power of a NLB by showing that it can also simulate correlations found in a tripartite state.\n\nDefinition 7. In the Mermin-GHZ game [15], Alice, Bob and Charlie are each given a bit such that\nx (A) + x (B) + x (C) ≡ 0 (mod 2)\nand they must produce a bit of output each, y (A) , y (B) and y (C) , such that:\ny (A) ⊕ y (B) ⊕ y (C) = x (A) + x (B) + x (C) 2 .\nIt is well known that this is a pseudo-telepathy game. In the quantum winning strategy, Alice, Bob and Charlie share a GHZ-state: 1\n√ 2 |000 + 1 √ 2 |111 . Lemma 2.\nNo quantum strategy can win the Mermin-GHZ game with probability one if any two participants share only an entangled pair of qubits, |ψ = α|00 + β|11 .\n\nProof. As in the proof of Lemma 1, the result follows from [14]. Proof. First, note that the quantum winning strategy (as given in [12], for instance) is such that the outcomes of the players are uniformly distributed among all outcomes satisfying Definition 7. Now, Alice and Bob can used shared randomness to select uniformly at random among all strategies that succeed in the proof of Theorem 5. This gives a simulation of the Mermin-GHZ correlations.\n\nTheorem 7. The Mermin-GHZ game can be won with probability one if the participants are allowed one use of an NLB.\n\nProof. Once again, we will use the NLB in our construction to replace the communication in the protocol of Theorem 5. First, we note the relationship between the logical OR and the logical AN D:\nx (A) ∨ x (B) =x (A) ∧x (B) .\nThe strategy is then simple. Alice and Bob flip their inputs and feed them into a shared NLB which returns y (A) and y (B) such that\ny (A) ⊕ y (B) = x (A) ∨ x (B)\n.\nSince x (A) + x (B) + x (C) ≡ 0 (mod 2), x (A) ∨ x (B) = x (A) + x (B) + x (C) 2 ⊕ 1.\nIf Charlie outputs y (C) = 1, the protocol satisfies Definition 7.\n\nTheorem 8. There is a non-local protocol that simulates the Mermin-GHZ correlations with a single use of an NLB.\n\nProof. As in the proof of Theorem 6, we can randomize the proof of Theorem 7 so that the outcomes of Alice, Bob and Charlie are uniformly distributed among all outcomes that satisfy Definition 7. All we need to add is a random bit shared between the participants telling whether or not Bob and Charlie should both flip their outputs or not.\n\nFrom Lemma 2 and Theorem 8, we get the following Corollary:\n\nCorollary 2. An NLB can simulate tripartite correlations that no entangled pair of qubits, |ψ = α|00 + β|11 , can.\n\n\nNon-local box pseudo-telepathy\n\nWe have seen in Sections 2 and 3 that a single use of an NLB can simulate quantum correlations that are stronger than those obtained by bipartite measurements of a maximally entangled pair of qubits. Can an NLB do more? In this Section, we discuss the known result that an NLB can indeed yield correlations that cannot be reproduced by quantum mechanics by showing an NLB pseudo-telepathy game that can be won with probability one with a single use of an NLB while no quantum protocol can.\n\nDefinition 8. We say that a bipartite game exhibits non-local box pseudo-telepathy if there exists a non-local winning strategy, while no winning strategy based on the laws of quantum mechanics exists.\n\n\nLemma 3.\n\nA single NLB is sufficient to yield a protocol for an NLB pseudo-telepathy game.\n\nThe game in which we are interested is what the NLB is defined to do. It is clear from the definition of the NLB that, using a such a device, Alice and Bob can produce outputs such that the XOR of their outputs is equal to the AN D of their inputs. When Popescu and Rohrlich proposed the NLB, it was already known, although not expressed in these terms, that it could yield NLB pseudo-telepathy.\n\nIn fact, in 1980, Tsirelson [5] showed that quantum mechanics could not yield a value greater than 2 √ 2 in Equation 2 while, by definition, the NLB has the algebraic maximum value of 4. Cleve, Høyer, Toner and Watrous [6] generalized Tsirelson's result to show that there cannot be a bipartite game with binary outputs that cannot be won classically with probability one while a quantum protocol could. Since the CHSH game cannot be won classically with probability greater than 3/4, then no quantum strategy can win with probability 1. More recently, van Dam [7,8] and others [9], also showed that no quantum strategy can win the CHSH game with probability equal to unity by taking an altogether different approach. They showed how we can use NLBs [7,8], or even faulty NLBs [9], to reduce all of communication complexity for decision problems to a single bit. Since we know that quantum communication complexity is not trivial [16], no quantum simulation of the NLB can exist.\n\n\nLimits on the power of the non-local box\n\nIn previous Sections, we have shown the amazing power of a single NLB. We have demonstrated quantum correlations that cannot be generated by an entangled pair of qubits but still can be simulated with only one NLB. Do all quantum correlations collapse to a single use of an NLB? The answer is no. In [17], it is shown that one use of an NLB is not sufficient to simulate non-maximally entangled states of two qubits. Here, we will also prove that there exist pseudo-telepathic correlations (whose simulation cannot require more resources than the simulation of general measurements on the quantum state used in the quantum winning strategy) that cannot be simulated with a single NLB. We will first show that in a multi-party setting, there exist pseudo-telepathic correlation that require more than one use of a NLB to simulate. We then use the distributed Deutsch-Jozsa game to show that some bipartite pseudo-telepathic correlations also require more than one use of an NLB to simulate. As a consequence, we will prove that maximally entangled bipartite states and NLBs are truly different resources.\n\nDefinition 9. The multi-party Mermin-GHZ game [18,19] is defined as follows. Each player i ∈ {1, . . . , n} (n ≥ 3) is given a bit x (i) such that i x (i) ≡ 0 (mod 2). Each player must produce a bit y (i) of output such that:\ni y (i) ≡ i x (i) 2 (mod 2).\nTheorem 9. n 2 ∈ O(n 2 ) NLBs are sufficient for the simulation of the multi-party Mermin-GHZ correlations.\n\nProof. Each player shares an NLB with every other player (there are therefore n 2 NLBs). Upon receiving his input x (i) , player i feeds x (i) into each of his shared NLBs. Let y (i,j) be the output of the NLB shared with player j. Player i then computes the parity of all such y (i,j) : let y (i) = j =i y (i,j) (mod 2). This is player i's output.\n\nTo show that this strategy works, note that i y (i) ≡ i j =i y (i,j) (mod 2), and furthermore, ∀i, j where i = j\ny (i,j) + y (j,i) (mod 2) ≡ 0, x (i) ∧ x (j) = 0 1, x (i) ∧ x (j) = 1 .\nTherefore, if i x (i) = 4k for some non-negative integer k, (and so\ni x (i) 2\n≡ 0 (mod 2)), then i y (i) ≡ 4k 2 ≡ 0 (mod 2). And if i x (i) = 4k + 2 for some non-negative integer k, (and therefore,\ni x (i) 2 ≡ 1 (mod 2)), then i y (i) ≡ 4k+2 2 ≡ 1 (mod 2).\nTheorem 10. Any simulation of the multi-party Mermin-GHZ correlations for n ≥ 4 players requires more than a single use of an NLB.\n\nProof. Consider the case where n = 4. Without loss of generality, suppose that players 1 and 2 share an NLB. Let us assume furthermore that players 1 and 2 are allowed unlimited communication with each other. We will show that even under this stronger assumption, there is no winning strategy for the multiparty Mermin-GHZ game. It follows that the four players cannot simulate the multi-party Mermin-GHZ correlations with a single NLB.\n\nLet us consider a subset of the possible inputs: I = {(0, 0, 0, 0), (0, 0, 1, 1), (0, 1, 0, 1), (0, 1, 1, 0)}. If we consider players 1 and 2 as a single entity, we get, after relabelling, a new set of inputs: {(0, 0, 0), (0, 1, 1), (1, 0, 1), (1, 1, 0)}. This is the Mermin-GHZ game (Definition 7). Since a winning strategy for the set I of inputs leads to a classical winning strategy for the Mermin-GHZ game, which is impossible, this contradiction proves our claim.\n\nThe result extends easily to the case of n > 4: even if we allow communication between the first n − 2 players, we can find a subset of inputs (as above) where the players need to be able to win the Mermin-GHZ game in order to win this game.\n\nTheorem 11. Ω(n) NLBs are necessary in a non-local winning strategy for the multi-party Mermin-GHZ game.\n\nProof. As we saw in the proof of Theorem 10, there cannot be two players, or more, that are not linked with at least one other player through an NLB. So in order for at least n − 1 players to be linked with another player, we need ⌊n/2 − 1⌋ + 1 ∈ Ω(n) NLBs.\n\nWe now turn to a bipartite scenario and show that there exist bipartite quantum correlations that require more than one use of a NLB to simulate.\n\n\nDefinition 10.\n\nIn the distributed Deutsch-Jozsa game [20], Alice and Bob are given 2 n -bit strings x (A) and\nx (B) respectively such that ∆(x (A) , x (B) ) ∈ {0, 2 n−1 } (5)\nwhere ∆(x (A) , x (B) ) is the Hamming distance between two strings (Equation 5 states that either the two strings are the same or they differ in exactly half the bit positions). Then the players must output n-bit strings y (A) and y (B) , respectively such that:\n[y (A) = y (B) ] ⇔ [x (A) = x (B) ].(6)\nWe know that for all n ≥ 4, the above game is a pseudo-telepathy game [21], and the quantum state used for the quantum winning strategy is 1 √ 2 n 2 n −1 j=0 |j |j [20]. Furthermore, we have the following lemma from [20]: Lemma 4. A classical winning strategy for the distributed Deutsch-Jozsa game requires Ω(2 n ) bits of communication.\n\nTheorem 12. No classical winning strategy for the distributed Deutsch-Jozsa game with less than Ω(2 n ) uses of an NLB exists.\n\nProof. Suppose we had a winning strategy for the distributed Deutsch-Jozsa game with less than Ω(2 n ) NLBs. Since we can simulate an NLB with one bit of communication [22], we could use communication to transform the winning strategy that uses NLBs into a winning strategy with less than Ω(2 n ) bits of communication (and no NLBs). Such a strategy would contradict Lemma 4.\n\nWhen considered as a resource, entanglement is usually quantified by the number of maximally entangled bipartite states of two qubits, (|00 + |11 )/ √ 2. In [17], Brunner, Gisin and Scarani showed that there exist bipartite entangled states of two qubits that cannot be simulated with a single use of an NLB. Since a single use of an NLB can simulate a maximally entangled bipartite state of two qubits [11], the authors conclude that \"entanglement and non-locality are different resources\". We concur that according to their measure there is an anomaly which also occurs in many other measures of non-locality [17]. However, when concerned with how many resources we need to perform a certain computational task, we quantify resources in an asymptotic fashion. The result of [17] is not asymptotic: it does not rule out a world in which cn NLBs, for some constant c, are sufficient to simulate n bipartite entangled states. In such a world, NLBs would still be considered strictly stronger than entanglement, for when speaking of computational resources, multiplicative constants do not matter. Our results have the advantage of proving an asymptotic gap between the two resources: we have shown that there exist correlations whose simulation requires an exponential amount of NLB uses (in the number of maximally entangled two qubit bipartite states). Furthermore, the existence of NLB pseudo-telepathy games confirms that non-locality and entanglement are different and incomparable resources.\n\nOur result shows that the simulation of n pairs of maximally entangled qubits requires Ω(2 n ) NLB uses. At first sight, this may seem to contradict the fact that a single NLB use is sufficient for the simulation of a single pair of maximally entangled qubits. This apparent contradiction is explained by the fact that, thanks to entanglement, the simulation of n bipartite maximally entangled qubit pairs cannot, in general, be expressed as n independent simulations of separate systems of two qubits.\n\nWe finish this section by showing that the lower bound of Theorem 12 is tight.\n\nTheorem 13. There is a non-local winning strategy for the distributed Deutsch-Jozsa game with O(2 n ) NLB uses.\n\nBefore turning to the proof, first note that if the task were for the players to outputs any string y (A) and\ny (B) respectively, such that [y (A) = y (B) ] ⇔ [x (A) = x (B) ]\n, then Alice and Bob could simply use x (A) and x (B) as outputs and the condition is satisfied. The difficulty for Alice and Bob in the distributed Deutsch-Jozsa game is to output strings that are exponentially shorter than their inputs. In the following non-local winning strategy, Alice and Bob will use NLBs to achieve this shorter input.\n\nSecond, note that if Alice and Bob have two bits, a 1 , a 2 and b 1 , b 2 respectively, then, making use of two NLBs, they can compute bits a for Alice and b for Bob such that a⊕b = f (a 1 , a 2 , b 1 , b 2 ) = (a 1 ⊕b 1 )∧(a 2 ⊕b 2 ). This observation follows from the fact that f (a 1 , a 2 , b 1 , b 2 ) = a 1 a 2 ⊕ b 1 b 2 ⊕ a 1 b 2 ⊕ a 2 b 1 , where the first two terms can be computed locally, while the last two require one use of an NLB each; Alice computes A 1 = a 1 a 2 and Bob B 1 = b 1 b 2 , Alice inputs a 1 into a first NLB while Bob inputs b 2 , they get A 2 and B 2 respectively and Alice inputs a 2 into a second NLB while Bob inputs b 1 from which they get A 3 and B 3 . With a = A 1 ⊕A 2 ⊕A 3 and b = B 1 ⊕ B 2 ⊕ B 3 , we clearly have a ⊕ b = (a 1 ⊕ b 1 ) ∧ (a 2 ⊕ b 2 ). We call such operation the distributed computation of the function f , which is analogous to computing the AN D of two distributed bits, a 1 ⊕ b 1 and a 2 ⊕ b 2 . 1 Proof. First, Alice flips all her input bits. We'll call the resulting stringx (A) . Using this new input, Alice and Bob execute a series of rounds. Each round i has the following property: at the beginning of the round, Alice has the string a (i) ∈ {0, 1} 2 n−i and Bob b (i) ∈ {0, 1} 2 n−i such that either the diametric (∆(a (i) , b (i) ) = 2 n−i ) or the disparity (∆(a (i) , b (i) ) < 2 n−i ) condition holds. At the end of the round, Alice has the string a (i+1) ∈ {0, 1} 2 n−i−1 and Bob b (i+1) ∈ {0, 1} 2 n−i−1 and the condition, diametric or disparity, is unchanged.\n\nTo execute round i, the players perform a sequence of 2 n−i−1 distributed computations of the function f : for each integer j ∈ {0, . . . It is easy to see that by virtue of the function f , if the diametric condition holds at the beginning of the round, then it still holds at the end of the round; the same is true for the disparity condition.\n\nAlice and Bob start round 0 each with a 2 n -bit string, a (0) =x (A) and b (0) = x (B) . They repeat many rounds until they each have an n-bit string (they can pad their outputs with diametric bit strings after the last round if necessary), therefore performing n − ⌊lg n⌋ rounds, for a total of 2( n−⌊lg n⌋−1 i=0 2 n−i−1 ) = 2 n+1 − 2 ⌊lg n⌋+1 ∈ O(2 n ) NLBs. At the end of the sequence of rounds, Alice flips the bits that she has calculated. The resulting strings are y (A) for Alice and y (B) for Bob and from the diametric or disparity condition, it is easy to see that [\ny (A) = y (B) ] ⇔ [x (A) = x (B) ].\n\nA new game\n\nWe now attempt to answer the question: what is the generalization of the NLB to a multi-party scenario? In [11], it is shown that a natural extension of the NLB allows for instantaneous signaling. Here, we give a different extension: we give a new NLB pseudo-telepathy game and propose a generalization of the NLB based on this new game.\n\nDefinition 11. In this game, participant i ∈ {1, . . . n} (n ≥ 2) is given a bit of input, x (i) . The participants must each output a bit y (i) such that:\nn i=1 y (i) (mod 2) = BM AJ(x (1) , x (2) , . . . , x (n) ) = 1 if ∆(x (1) x (2) . . . x (n) ) > ⌊n/2⌋ 0 otherwise\nwhere BM AJ is simply the majority biased towards 0, and ∆(x (1) x (2) . . . x (n) ) is the Hamming weight of a bit string.\n\n\nTheorem 14.\n\nThere is no classical winning strategy for the game of Definition 11.\n\nProof. For the case where n = 2, this is exactly the task that an NLB accomplishes. We know that no classical strategy can succeed with probability 1. Now, for n ≥ 3, we pick a subset S of possible inputs for which, even allowing communication between all but two players yields a situation where no classical strategy can succeed with probability 1: S is the set of questions where the first ⌊ n−2 2 ⌋ players have input 0, the next ⌈ n−2 2 ⌉ players have input 1 and the remaining two players have inputs 0 or 1. Note that even by allowing all players except the last two to communicate, we still get that no classical strategy can succeed at this game, for a strategy to win this game entails the existence of a strategy to win the CHSH game described in Section 4.\n\nTheorem 15. There is no quantum winning strategy for the game of Definition 11.\n\nProof. For the case where n = 2, this is exactly the task that an NLB accomplishes. We know that no quantum strategy can succeed with probability 1. Now, for n ≥ 3, as in the proof of Theorem 14, we pick subset S of possible inputs for which, even allowing communication between all but two players yields a situation where no quantum strategy can succeed with probability 1.\n\nTheorem 16. Ω(n) NLBs are necessary in a non-local winning strategy for the game of Definition 11.\n\nProof. As we saw in the proof of Theorem 15, there cannot be two players, or more, that are not linked with at least one other player through an NLB. So in order for at least n − 1 players to be linked with another player, we need ⌊n/2 − 1⌋ + 1 ∈ Ω(n) NLBs.\n\n\nTheorem 17.\n\nThere is a non-local winning strategy for the game given in Definition 11 with O(n 3 2 n ) NLB uses.\n\nThe following scenario is relevant to the proof of Theorem 17; it is a generalization of the distributed computation of the function f that we presented in the proof of Theorem 13. Consider n participants. A bit x k is a called a distributed bit if each participant i has a bit x\n(i) k such that x k = n i=1 x (i) k .\nWe will see how we can compute a distributed Boolean function on distributed bits with the help of NLBs. First of all, if any player i has a bit x (i) , then a distributed bit x k can be initialized to the value x (i) by letting x (i) k = x (i) and x (j) k = 0 for all j = i. Next, it easy to see that the negation of a distributed bit, sayx k can be computed by requiring that a single player flip his bit. Finally, the distributed AN D of two distributed bits, x k and x ℓ , can be computed using NLBs thanks to the following observation:\nx k ∧ x ℓ =(x (1) k ⊕ x (2) k ⊕ · · · ⊕ x (n) k ) ∧ (x (1) ℓ ⊕ x (2) ℓ ⊕ · · · ⊕ x (n) ℓ ) =x (1) k ∧ x (1) ℓ ⊕ x (2) k ∧ x (2) ℓ ⊕ · · · ⊕ x (n) k ∧ x (n) ℓ ⊕ x (1) k ∧ x (2) ℓ ⊕ x (1) k ∧ x (3) ℓ ⊕ . . . ⊕ x (1) k ∧ x (n) ℓ ⊕ . . . ⊕ x (n) k ∧ x (n−1) ℓ(7)\nTo calculate the distributed x m = x k ∧ x ℓ , each participant performs a certain number of calculations, each yielding a single bit. Each participant's final bit, x (i) m is the parity of the sum of all his calculated bits. Now, the n conjunctions on the second-to-last row of Equation 7 can be computed locally by each participant and each of the n(n − 1) conjunctions in the last row can be computed with a single NLB. This shows how to calculate the distributed x k ∧ x ℓ . We are now ready to turn to the proof of Theorem 17.\n\nProof. To compute the distributed BM AJ, the players simply need to output bits where the total parity of their output satisfies: i y (i) (mod 2) =(x (1) ∧ x (2) ∧ · · · ∧ x (⌊n/2⌋+1) ) ∨ (x (1) ∧ x (3) ∧ · · · ∧ x (⌊n/2⌋+2) ) ∨ . . .\n\n∨ (x (⌊n/2⌋) ∧ x (⌊n/2⌋+1) ∧ · · · ∧ x (n) ). We think that this new game should be taken to be the generalization of the NLB to a multi-party NLB. The reasons are multiple.\n\n1. This generalization yields exactly the NLB in a bipartite scenario.\n\n2. In the tripartite scenario, this new NLB simulates directly the Mermin-GHZ game 3. It does not allow faster than light communication. 4. The box is simple and elegant. 5. We have shown in Theorem 15 that this multi-party NLB exhibits NLB pseudo-telepathy for every n ≥ 2.\n\n6. We think that this multi-party NLB exhibits correlations that require a large amount of bipartite NLB uses to simulate.\n\n\nConclusions\n\nIn the present text, we have made progress towards characterizing the remarkable power of the NLB. A single NLB can simulate correlations that no entangled pair of qubits can: in the bipartite scenario (Theorem 4), and in the multi-party scenario (Theorem 8). In Section 4, we also showed that the NLB can exhibit correlations that cannot be reproduced by quantum mechanics and defined NLB pseudo-telepathy (Definition 8). Finally we showed in Theorems 10 and 12 that a single NLB cannot reproduce all correlations of quantum mechanics and we proposed in Definition 11 a generalization of the NLB to the multi-party scenario which has a lot of desirable properties. By showing that the simulation of some quantum correlations requires an exponential amount of NLBs in the number of shared entangled qubit pairs (see Theorem 12), and from the fact that NLB pseudo-telepathy exists, we have demonstrated that NLBs and entanglement are different, incomparable resources. The fact that there are correlations that can be generated from NLBs and that cannot come from any entangled state (see Sections 4 and 6) further supports this conclusion. A single NLB can generate correlations that are stronger than those that can be provided by quantum mechanics and yet we still require an exponential amount of NLBs for the simulation of certain quantum correlations; in our opinion, this is due to the fact that NLBs are inherently classical and, as such, cannot be entangled with one another.\n\nThe very attentive reader might have noticed a connection between Theorem 1 and Theorem 4, between Theorem 5 and Theorem 8, and between Lemma 4 and Theorem 12: we have transformed classical strategies with n bits of communication into protocols with n uses of an NLB. Can we always make this substitution? It is of course not the case, for example in communication complexity, but if we just want to simulate quantum correlations, signaling might not be necessary. After all, entanglement alone cannot be used to signal. A partial answer can be found in [17], in which the authors proved that there exist correlations that can be generated from a single bit of communication, constrained to not signal information on the input, which cannot be simulated with an NLB. Even though we cannot have a one-to-one equivalence, can the NLB paradigm, without consideration to the number of NLBs, replace communication that does not signal? The answer might not be easy to find. Degorre, Laplante and Roland have recently built on the work of Méthot [24] and Cerf, Gisin, Massar and Popescu [11] to create a simulation of a maximally entangled pair of qubits for any POVM using on average 2 NLBs and 4 bits of communication [25]. In this construction, it might not be easy to get rid of the communication since every simulation of quantum entanglement known to the authors that takes POVMs into account is founded on a test principle [24,26,27]: Bob receives some information from Alice and tells her if it is satisfactory with what he has, if not they start over. In order for Alice to know when to start over, Bob must signal so to Alice. It is not clear if or how we can get out of this test paradigm.\n\nOf course, simulations of other pseudo-telepathy games need to be done before we can claim to understand fully the NLB. In particular, an open question of interest, and in relation to the discussion in the previous paragraph, is whether any pseudo-telepathy game can be simulated with NLBs. We would also like to see a non-trivial lower bound for the number of NLBs required to simulate the generalization to the multi-party setting put forward here and for the multi-party Mermin-GHZ game.\n\nDefinition 6 .\n6In the magic square game, Alice and Bob are given x (A) ∈ {1, 2, 3} and x (B) ∈ {1, 2, 3}, respectively. They produce 3 bits each,\n\nFigure 1 :\n1Two strategies: strategy 0 ((a) and (b)) and strategy 1 ((c) and (d)).Theorem 2. Classical players that are allowed one bit of communication can simulate the magic square correlations.\n\nx\nof strategies (A0, B0) and (A1, B1) yield a correct answer, y (A) , for all inputs except when x (A) = x (B) = 3. Additionally, strategies A0 and B1, as well as A1 and B0, are coordinated such that if Alice answers according to strategy Ai (i ∈ 0, 1) and Bob according to strategy Bj (j = i ⊕ 1), then on inputs x (A) = x (B) = 3, we have that y\n\nTheorem 5 .\n5The Mermin-GHZ game can be won classically with probability one if the participants are allowed one bit of communication.Proof. The classical strategy that uses a bit of communication is the following: Bob and Charlie output y (B) = b, y (C) = c respectively where b and c are arbitrary bits known to all participants. Bob sends x (B) to Alice, who computes y = x (A) ∨ x (B) and outputs y (A) = b ⊕ c ⊕ y. It is easy to check that this strategy works.Theorem 6. The Mermin-GHZ correlations can be simulated by classical participants using a single bit of communication.\n\n\n. The final strings for Alice and Bob at the end of round i are a (i+1) and b (i+1) , respectively.\n\n\nBoolean formula comes from the simple observation that BM AJ = 1 if and only if there is a ⌊n/2⌋ + 1-subset of {x (1) , x (2) , . . . , x (n) }, with each element in the subset having value 1. In Equation 8, we consider all such n ⌊n/2⌋+1 possible subsets. Furthermore, Equation 8 can be translated into a series of negations and AN D gates (using de Morgan's Law). We wish to calculate the total number of AN D gates: we have ⌊n/2⌋ AN D gates for each of the n ⌊n/2⌋+1 conjunctions as well as n ⌊n/2⌋+1 − 1 AN D gates for the disjunctions (since an OR gate can be computed with a single AN D gate and negations). The total number of AN D gates is therefore (⌊n/2⌋) n ⌊n/2⌋+1 + n ⌊n/2⌋+1 − 1 ∈ O(n2 n ). To evaluate Equation 8 in a distributed way, the participants simply initialize a sequence of distributed bits and perform a sequence of distributed AN D calculations (as described above the present proof and according to Equation 8) . Since our protocol computes O(n2 n ) distributed AN Ds, using O(n 2 ) NLBs each, the protocol uses a total of O(n 3 2 n ) NLBs.\nThe idea of using NLBs to replace communication in distributed computations is due Cleve[23] and van Dam[7,8], who independently demonstrated that their use allows any distributed Boolean function to be evaluated using a single bit of communication.\nAcknowledgementsWe would like to thank Julien Degorre, Patrick Hayden and Jürg Wullschleger for very stimulating discussions, and Gilles Brassard and Alain Tapp for truly helpful comments. This work is supported in part by Canada's Nserc.\nOn the Einstein-Podolsky-Rosen paradox. J S Bell, Physics. 1Bell, J. S. \"On the Einstein-Podolsky-Rosen paradox\", Physics 1: 195-200, 1964.\n\nProposed experiment to test local hidden-variable theories. F Clauser, M A Horne, A Shimony, R A Holt, Physical Review Letters. 23Clauser, F., Horne M. A., Shimony, A. and Holt, R. A. \"Proposed experiment to test local hidden-variable theories\", Physical Review Letters 23: 880-884, 1969.\n\nQuantum entanglement and communication complexity. H Buhrman, R Cleve, W Van Dam, SIAM Journal on Computing. 30Buhrman, H., Cleve, R. and van Dam, W. \"Quantum entanglement and communication complex- ity\", SIAM Journal on Computing 30: 1829-1841, 2001.\n\nQuantum nonlocality as an axiom. S Popescu, D Rohrlich, Foundations of Physics. 24Popescu, S. and Rohrlich, D. \"Quantum nonlocality as an axiom\", Foundations of Physics 24: 379-385, 1994.\n\nQuantum generalizations of Bell's inequality. B S Cirel&apos;son, Letters in Mathematical Physics. 4Cirel'son, B. S. \"Quantum generalizations of Bell's inequality\", Letters in Mathematical Physics 4: 93-100, 1980.\n\nConsequences and limits of nonlocal strategies. R Cleve, P Høyer, B Toner, J Watrous, Proceedings of 19th IEEE Conference on Computational Complexity. 19th IEEE Conference on Computational ComplexityCleve, R., Høyer, P., Toner, B. and Watrous, J. \"Consequences and limits of nonlocal strate- gies\", Proceedings of 19th IEEE Conference on Computational Complexity: 236-249, 2004.\n\nW Van Dam, Chapter, Nonlocality & Communication Complexity. University of OxfordPh. D. thesisvan Dam, W. Chapter 9 in Nonlocality & Communication Complexity, Ph. D. thesis, University of Oxford, 2000.\n\nImplausible consequences of superstrong nonlocality. W Van Dam, preprint available atvan Dam, W. \"Implausible consequences of superstrong nonlocality\", preprint available at http://arxiv.org/abs/quant-ph/0501159.\n\nA limit on nonlocality in any world in which communication complexity is not trivial. G Brassard, H Buhrman, N Linden, A A Méthot, A Tapp, F Unger, preprint available atBrassard, G., Buhrman, H., Linden, N., Méthot, A. A., Tapp, A. and Unger, F. \"A limit on nonlocality in any world in which communication complexity is not trivial\", preprint available at http://arxiv.org/abs/quant-ph/0508042.\n\nThe communication cost of simulating Bell correlations. B F Toner, D Bacon, Physical Review Letters. 91187904Toner, B. F. and Bacon, D. \"The communication cost of simulating Bell correlations\", Physical Review Letters 91: 187904, 2003.\n\nSimulating maximal quantum entanglement without communication. N Cerf, N Gisin, S Massar, S Popescu, Physical Review Letters. 94220403Cerf, N., Gisin, N., Massar, S. and Popescu, S. \"Simulating maximal quantum entanglement without communication\", Physical Review Letters 94: 220403, 2005.\n\nQuantum pseudo-telepathy. G Brassard, A Broadbent, A Tapp, Foundations of Physics. 35to appear, preprint available atBrassard, G., Broadbent, A. and Tapp, A. \"Quantum pseudo-telepathy\", Foundations of Physics 35, to appear, preprint available at http://arxiv.org/abs/quant-ph/0407221.\n\nBell's theorem without inequalities and only two distant observers. P Aravind, Foundations of Physics Letters. 15Aravind, P. K. \"Bell's theorem without inequalities and only two distant observers\", Foundations of Physics Letters 15: 397-405, 2001.\n\nMinimum entangled state dimension required for pseudo-telepathy. G Brassard, A A Méthot, A Tapp, Quantum Information and Computation. 5Brassard, G., Méthot, A. A. and Tapp, A. \"Minimum entangled state dimension required for pseudo-telepathy\", Quantum Information and Computation 5: 275-284, 2005.\n\nQuantum mysteries revisited. N D Mermin, American Journal of Physics. 58Mermin, N. D. \"Quantum mysteries revisited\", American Journal of Physics 58: 731-734, 1990.\n\nQuantum entanglement and the communication complexity of the inner product function. R Cleve, W Van Dam, M Nielsen, A Tapp, Proceedings of the First NASA International Conference on Quantum Computing and Quantum Communications. the First NASA International Conference on Quantum Computing and Quantum Communications1509Cleve, R., van Dam, W., Nielsen, M. and Tapp, A. \"Quantum entanglement and the communica- tion complexity of the inner product function\", Proceedings of the First NASA International Conference on Quantum Computing and Quantum Communications, Volume 1509 of Lecture Notes in Computer Science, pp. 61-74, 1998.\n\nEntanglement and non-locality are different resources. N Brunner, N Gisin, V Scarani, New Journal of Physics. 788Brunner, N. Gisin, N. and Scarani, V. \"Entanglement and non-locality are different resources\", New Journal of Physics 7: 88, 2005.\n\nExtreme quantum entanglement in a superposition of macroscopically distinct states. N D Mermin, Physical Review Letters. 65Mermin, N. D. \"Extreme quantum entanglement in a superposition of macroscopically distinct states\", Physical Review Letters 65, 1838-1840, 1990.\n\nRecasting Mermin's multi-player game into the framework of pseudo-telepathy. G Brassard, A Broadbent, A Tapp, Quantum Information and Computation. 5Brassard, G., Broadbent, A. and Tapp, A. \"Recasting Mermin's multi-player game into the framework of pseudo-telepathy\", Quantum Information and Computation 5: 538-551, 2005.\n\nCost of exactly simulating quantum entanglement with classical communication. G Brassard, R Cleve, A Tapp, Physical Review Letters. 83Brassard, G., Cleve, R. and Tapp, A. \"Cost of exactly simulating quantum entanglement with classical communication\", Physical Review Letters 83: 1874-1878, 1999.\n\nM W Newman, Chapter, Independent Sets and Eigenspaces. University of WaterlooPh. D. thesisNewman, M. W. Chapter 6 in Independent Sets and Eigenspaces, Ph. D. thesis, University of Waterloo, 2004.\n\nOblivious transfer and quantum non-locality. S Wolf, J Wullschleger, Proceedings of the 2005 IEEE International Symposium on Information Theory (ISIT '05). the 2005 IEEE International Symposium on Information Theory (ISIT '05)CD-RomWolf, S. and Wullschleger, J. \"Oblivious transfer and quantum non-locality\", Proceedings of the 2005 IEEE International Symposium on Information Theory (ISIT '05), CD-Rom, also available at http://arxiv.org/abs/quant-ph/0502030.\n\n. R Cleve, Unpublished, Cleve, R. Unpublished.\n\nSimulating POVMs on EPR pairs with 5.7 bits of expected communication. A A Méthot, European Journal of Physics D. 29Méthot, A. A. \"Simulating POVMs on EPR pairs with 5.7 bits of expected communication\", European Journal of Physics D 29: 445-446, 2004.\n\nSimulating quantum correlations as a distributed sampling problem. J Degorre, S Laplante, J Roland, preprint available atDegorre, J., Laplante, S. and Roland J. \"Simulating quantum correlations as a distributed sampling problem\", preprint available at http://arxiv.org/abs/quant-ph/0507120.\n\nClassical teleportation of a quantum bit. N Cerf, N Gisin, S Massar, Physical Review Letters. 84Cerf, N., Gisin, N. and Massar, S. \"Classical teleportation of a quantum bit\", Physical Review Letters 84: 2521-2524, 2000.\n\nClassical simulation of quantum entanglement without local hidden variables. S Massar, D Bacon, N Cerf, R Cleve, Physical Review A. 6352305Massar, S. Bacon, D., Cerf, N. and Cleve, R. \"Classical simulation of quantum entanglement without local hidden variables\", Physical Review A 63: 052305, 2001.\n", "annotations": {"author": "[{\"end\":275,\"start\":94},{\"end\":461,\"start\":276}]", "publisher": null, "author_last_name": "[{\"end\":108,\"start\":99},{\"end\":294,\"start\":288}]", "author_first_name": "[{\"end\":98,\"start\":94},{\"end\":281,\"start\":276},{\"end\":287,\"start\":282}]", "author_affiliation": "[{\"end\":274,\"start\":136},{\"end\":460,\"start\":322}]", "title": "[{\"end\":68,\"start\":1},{\"end\":529,\"start\":462}]", "venue": null, "abstract": "[{\"end\":2991,\"start\":554}]", "bib_ref": "[{\"attributes\":{\"ref_id\":\"b0\"},\"end\":3194,\"start\":3191},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":3547,\"start\":3544},{\"attributes\":{\"ref_id\":\"b2\"},\"end\":4160,\"start\":4157},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":4640,\"start\":4637},{\"attributes\":{\"ref_id\":\"b3\"},\"end\":4685,\"start\":4682},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":4847,\"start\":4844},{\"attributes\":{\"ref_id\":\"b5\"},\"end\":4849,\"start\":4847},{\"attributes\":{\"ref_id\":\"b6\"},\"end\":4851,\"start\":4849},{\"attributes\":{\"ref_id\":\"b7\"},\"end\":4853,\"start\":4851},{\"attributes\":{\"ref_id\":\"b8\"},\"end\":4855,\"start\":4853},{\"attributes\":{\"ref_id\":\"b3\"},\"end\":5428,\"start\":5425},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":5514,\"start\":5510},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":5677,\"start\":5673},{\"attributes\":{\"ref_id\":\"b12\"},\"end\":7291,\"start\":7287},{\"attributes\":{\"ref_id\":\"b11\"},\"end\":8233,\"start\":8229},{\"attributes\":{\"ref_id\":\"b13\"},\"end\":8976,\"start\":8972},{\"end\":11015,\"start\":11012},{\"attributes\":{\"ref_id\":\"b2\"},\"end\":11429,\"start\":11428},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":12383,\"start\":12379},{\"attributes\":{\"ref_id\":\"b13\"},\"end\":12985,\"start\":12981},{\"attributes\":{\"ref_id\":\"b11\"},\"end\":13057,\"start\":13053},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":15918,\"start\":15915},{\"attributes\":{\"ref_id\":\"b5\"},\"end\":16109,\"start\":16106},{\"attributes\":{\"ref_id\":\"b6\"},\"end\":16451,\"start\":16448},{\"attributes\":{\"ref_id\":\"b7\"},\"end\":16453,\"start\":16451},{\"attributes\":{\"ref_id\":\"b8\"},\"end\":16468,\"start\":16465},{\"attributes\":{\"ref_id\":\"b6\"},\"end\":16640,\"start\":16637},{\"attributes\":{\"ref_id\":\"b7\"},\"end\":16642,\"start\":16640},{\"attributes\":{\"ref_id\":\"b8\"},\"end\":16667,\"start\":16664},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":16821,\"start\":16817},{\"attributes\":{\"ref_id\":\"b16\"},\"end\":17215,\"start\":17211},{\"attributes\":{\"ref_id\":\"b17\"},\"end\":18066,\"start\":18062},{\"attributes\":{\"ref_id\":\"b18\"},\"end\":18069,\"start\":18066},{\"attributes\":{\"ref_id\":\"b19\"},\"end\":21027,\"start\":21023},{\"attributes\":{\"ref_id\":\"b20\"},\"end\":21523,\"start\":21519},{\"attributes\":{\"ref_id\":\"b19\"},\"end\":21617,\"start\":21613},{\"attributes\":{\"ref_id\":\"b19\"},\"end\":21669,\"start\":21665},{\"attributes\":{\"ref_id\":\"b21\"},\"end\":22089,\"start\":22085},{\"attributes\":{\"ref_id\":\"b16\"},\"end\":22455,\"start\":22451},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":22701,\"start\":22697},{\"attributes\":{\"ref_id\":\"b16\"},\"end\":22909,\"start\":22905},{\"attributes\":{\"ref_id\":\"b16\"},\"end\":23074,\"start\":23070},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":27627,\"start\":27623},{\"attributes\":{\"ref_id\":\"b0\"},\"end\":28190,\"start\":28187},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":28196,\"start\":28193},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":29574,\"start\":29572},{\"attributes\":{\"ref_id\":\"b3\"},\"end\":32311,\"start\":32310},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":32345,\"start\":32344},{\"end\":33414,\"start\":33403},{\"attributes\":{\"ref_id\":\"b16\"},\"end\":34630,\"start\":34626},{\"attributes\":{\"ref_id\":\"b23\"},\"end\":35116,\"start\":35112},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":35157,\"start\":35153},{\"attributes\":{\"ref_id\":\"b24\"},\"end\":35290,\"start\":35286},{\"attributes\":{\"ref_id\":\"b23\"},\"end\":35500,\"start\":35496},{\"attributes\":{\"ref_id\":\"b25\"},\"end\":35503,\"start\":35500},{\"attributes\":{\"ref_id\":\"b26\"},\"end\":35506,\"start\":35503},{\"attributes\":{\"ref_id\":\"b22\"},\"end\":38803,\"start\":38799},{\"attributes\":{\"ref_id\":\"b6\"},\"end\":38818,\"start\":38815},{\"attributes\":{\"ref_id\":\"b7\"},\"end\":38820,\"start\":38818}]", "figure": "[{\"attributes\":{\"id\":\"fig_0\"},\"end\":36406,\"start\":36259},{\"attributes\":{\"id\":\"fig_2\"},\"end\":36604,\"start\":36407},{\"attributes\":{\"id\":\"fig_3\"},\"end\":36953,\"start\":36605},{\"attributes\":{\"id\":\"fig_4\"},\"end\":37538,\"start\":36954},{\"attributes\":{\"id\":\"fig_5\"},\"end\":37640,\"start\":37539},{\"attributes\":{\"id\":\"fig_6\"},\"end\":38710,\"start\":37641}]", "paragraph": "[{\"end\":3643,\"start\":3007},{\"end\":4038,\"start\":3694},{\"end\":4369,\"start\":4093},{\"end\":4641,\"start\":4405},{\"end\":5429,\"start\":4643},{\"end\":5922,\"start\":5431},{\"end\":6776,\"start\":5924},{\"end\":7588,\"start\":6798},{\"end\":7844,\"start\":7680},{\"end\":8234,\"start\":7846},{\"end\":8903,\"start\":8236},{\"end\":9269,\"start\":8905},{\"end\":10494,\"start\":9271},{\"end\":10606,\"start\":10496},{\"end\":11084,\"start\":10608},{\"end\":11459,\"start\":11086},{\"end\":11591,\"start\":11484},{\"end\":12000,\"start\":11593},{\"end\":12175,\"start\":12002},{\"end\":12340,\"start\":12195},{\"end\":12438,\"start\":12342},{\"end\":12553,\"start\":12473},{\"end\":12735,\"start\":12604},{\"end\":12920,\"start\":12769},{\"end\":13376,\"start\":12922},{\"end\":13491,\"start\":13378},{\"end\":13687,\"start\":13493},{\"end\":13850,\"start\":13718},{\"end\":13882,\"start\":13881},{\"end\":14035,\"start\":13969},{\"end\":14149,\"start\":14037},{\"end\":14491,\"start\":14151},{\"end\":14552,\"start\":14493},{\"end\":14668,\"start\":14554},{\"end\":15192,\"start\":14703},{\"end\":15395,\"start\":15194},{\"end\":15488,\"start\":15408},{\"end\":15885,\"start\":15490},{\"end\":16866,\"start\":15887},{\"end\":18014,\"start\":16911},{\"end\":18241,\"start\":18016},{\"end\":18378,\"start\":18271},{\"end\":18728,\"start\":18380},{\"end\":18842,\"start\":18730},{\"end\":18982,\"start\":18915},{\"end\":19112,\"start\":18993},{\"end\":19302,\"start\":19172},{\"end\":19740,\"start\":19304},{\"end\":20211,\"start\":19742},{\"end\":20454,\"start\":20213},{\"end\":20560,\"start\":20456},{\"end\":20819,\"start\":20562},{\"end\":20966,\"start\":20821},{\"end\":21079,\"start\":20985},{\"end\":21408,\"start\":21145},{\"end\":21787,\"start\":21449},{\"end\":21915,\"start\":21789},{\"end\":22292,\"start\":21917},{\"end\":23790,\"start\":22294},{\"end\":24294,\"start\":23792},{\"end\":24374,\"start\":24296},{\"end\":24487,\"start\":24376},{\"end\":24598,\"start\":24489},{\"end\":25007,\"start\":24665},{\"end\":26540,\"start\":25009},{\"end\":26887,\"start\":26542},{\"end\":27466,\"start\":26889},{\"end\":27853,\"start\":27516},{\"end\":28010,\"start\":27855},{\"end\":28249,\"start\":28126},{\"end\":28334,\"start\":28265},{\"end\":29104,\"start\":28336},{\"end\":29185,\"start\":29106},{\"end\":29562,\"start\":29187},{\"end\":29662,\"start\":29564},{\"end\":29921,\"start\":29664},{\"end\":30037,\"start\":29937},{\"end\":30318,\"start\":30039},{\"end\":30897,\"start\":30357},{\"end\":31688,\"start\":31157},{\"end\":31924,\"start\":31690},{\"end\":32099,\"start\":31926},{\"end\":32171,\"start\":32101},{\"end\":32447,\"start\":32173},{\"end\":32571,\"start\":32449},{\"end\":34070,\"start\":32587},{\"end\":35766,\"start\":34072},{\"end\":36258,\"start\":35768}]", "formula": "[{\"attributes\":{\"id\":\"formula_0\"},\"end\":3693,\"start\":3644},{\"attributes\":{\"id\":\"formula_1\"},\"end\":4092,\"start\":4039},{\"attributes\":{\"id\":\"formula_2\"},\"end\":4404,\"start\":4370},{\"attributes\":{\"id\":\"formula_3\"},\"end\":7679,\"start\":7589},{\"attributes\":{\"id\":\"formula_4\"},\"end\":11473,\"start\":11460},{\"attributes\":{\"id\":\"formula_5\"},\"end\":11483,\"start\":11473},{\"attributes\":{\"id\":\"formula_6\"},\"end\":12472,\"start\":12439},{\"attributes\":{\"id\":\"formula_7\"},\"end\":12603,\"start\":12554},{\"attributes\":{\"id\":\"formula_8\"},\"end\":12768,\"start\":12736},{\"attributes\":{\"id\":\"formula_9\"},\"end\":13717,\"start\":13688},{\"attributes\":{\"id\":\"formula_10\"},\"end\":13880,\"start\":13851},{\"attributes\":{\"id\":\"formula_11\"},\"end\":13968,\"start\":13883},{\"attributes\":{\"id\":\"formula_12\"},\"end\":18270,\"start\":18242},{\"attributes\":{\"id\":\"formula_13\"},\"end\":18914,\"start\":18843},{\"attributes\":{\"id\":\"formula_14\"},\"end\":18992,\"start\":18983},{\"attributes\":{\"id\":\"formula_15\"},\"end\":19171,\"start\":19113},{\"attributes\":{\"id\":\"formula_16\"},\"end\":21144,\"start\":21080},{\"attributes\":{\"id\":\"formula_17\"},\"end\":21448,\"start\":21409},{\"attributes\":{\"id\":\"formula_18\"},\"end\":24664,\"start\":24599},{\"attributes\":{\"id\":\"formula_19\"},\"end\":27502,\"start\":27467},{\"attributes\":{\"id\":\"formula_20\"},\"end\":28125,\"start\":28011},{\"attributes\":{\"id\":\"formula_21\"},\"end\":30356,\"start\":30319},{\"attributes\":{\"id\":\"formula_22\"},\"end\":31156,\"start\":30898}]", "table_ref": null, "section_header": "[{\"attributes\":{\"n\":\"1\"},\"end\":3005,\"start\":2993},{\"attributes\":{\"n\":\"2\"},\"end\":6796,\"start\":6779},{\"attributes\":{\"n\":\"3\"},\"end\":12193,\"start\":12178},{\"attributes\":{\"n\":\"4\"},\"end\":14701,\"start\":14671},{\"end\":15406,\"start\":15398},{\"attributes\":{\"n\":\"5\"},\"end\":16909,\"start\":16869},{\"end\":20983,\"start\":20969},{\"attributes\":{\"n\":\"6\"},\"end\":27514,\"start\":27504},{\"end\":28263,\"start\":28252},{\"end\":29935,\"start\":29924},{\"attributes\":{\"n\":\"7\"},\"end\":32585,\"start\":32574},{\"end\":36274,\"start\":36260},{\"end\":36418,\"start\":36408},{\"end\":36607,\"start\":36606},{\"end\":36966,\"start\":36955}]", "table": null, "figure_caption": "[{\"end\":36406,\"start\":36276},{\"end\":36604,\"start\":36420},{\"end\":36953,\"start\":36608},{\"end\":37538,\"start\":36968},{\"end\":37640,\"start\":37541},{\"end\":38710,\"start\":37643}]", "figure_ref": "[{\"attributes\":{\"ref_id\":\"fig_2\"},\"end\":9647,\"start\":9639}]", "bib_author_first_name": "[{\"end\":39241,\"start\":39240},{\"end\":39243,\"start\":39242},{\"end\":39402,\"start\":39401},{\"end\":39413,\"start\":39412},{\"end\":39415,\"start\":39414},{\"end\":39424,\"start\":39423},{\"end\":39435,\"start\":39434},{\"end\":39437,\"start\":39436},{\"end\":39683,\"start\":39682},{\"end\":39694,\"start\":39693},{\"end\":39703,\"start\":39702},{\"end\":39918,\"start\":39917},{\"end\":39929,\"start\":39928},{\"end\":40120,\"start\":40119},{\"end\":40122,\"start\":40121},{\"end\":40337,\"start\":40336},{\"end\":40346,\"start\":40345},{\"end\":40355,\"start\":40354},{\"end\":40364,\"start\":40363},{\"end\":40669,\"start\":40668},{\"end\":40924,\"start\":40923},{\"end\":41171,\"start\":41170},{\"end\":41183,\"start\":41182},{\"end\":41194,\"start\":41193},{\"end\":41204,\"start\":41203},{\"end\":41206,\"start\":41205},{\"end\":41216,\"start\":41215},{\"end\":41224,\"start\":41223},{\"end\":41537,\"start\":41536},{\"end\":41539,\"start\":41538},{\"end\":41548,\"start\":41547},{\"end\":41781,\"start\":41780},{\"end\":41789,\"start\":41788},{\"end\":41798,\"start\":41797},{\"end\":41808,\"start\":41807},{\"end\":42034,\"start\":42033},{\"end\":42046,\"start\":42045},{\"end\":42059,\"start\":42058},{\"end\":42362,\"start\":42361},{\"end\":42608,\"start\":42607},{\"end\":42620,\"start\":42619},{\"end\":42622,\"start\":42621},{\"end\":42632,\"start\":42631},{\"end\":42870,\"start\":42869},{\"end\":42872,\"start\":42871},{\"end\":43091,\"start\":43090},{\"end\":43100,\"start\":43099},{\"end\":43111,\"start\":43110},{\"end\":43122,\"start\":43121},{\"end\":43690,\"start\":43689},{\"end\":43701,\"start\":43700},{\"end\":43710,\"start\":43709},{\"end\":43964,\"start\":43963},{\"end\":43966,\"start\":43965},{\"end\":44226,\"start\":44225},{\"end\":44238,\"start\":44237},{\"end\":44251,\"start\":44250},{\"end\":44550,\"start\":44549},{\"end\":44562,\"start\":44561},{\"end\":44571,\"start\":44570},{\"end\":44769,\"start\":44768},{\"end\":44771,\"start\":44770},{\"end\":45011,\"start\":45010},{\"end\":45019,\"start\":45018},{\"end\":45430,\"start\":45429},{\"end\":45547,\"start\":45546},{\"end\":45549,\"start\":45548},{\"end\":45796,\"start\":45795},{\"end\":45807,\"start\":45806},{\"end\":45819,\"start\":45818},{\"end\":46063,\"start\":46062},{\"end\":46071,\"start\":46070},{\"end\":46080,\"start\":46079},{\"end\":46319,\"start\":46318},{\"end\":46329,\"start\":46328},{\"end\":46338,\"start\":46337},{\"end\":46346,\"start\":46345}]", "bib_author_last_name": "[{\"end\":39248,\"start\":39244},{\"end\":39410,\"start\":39403},{\"end\":39421,\"start\":39416},{\"end\":39432,\"start\":39425},{\"end\":39442,\"start\":39438},{\"end\":39691,\"start\":39684},{\"end\":39700,\"start\":39695},{\"end\":39711,\"start\":39704},{\"end\":39926,\"start\":39919},{\"end\":39938,\"start\":39930},{\"end\":40137,\"start\":40123},{\"end\":40343,\"start\":40338},{\"end\":40352,\"start\":40347},{\"end\":40361,\"start\":40356},{\"end\":40372,\"start\":40365},{\"end\":40677,\"start\":40670},{\"end\":40686,\"start\":40679},{\"end\":40932,\"start\":40925},{\"end\":41180,\"start\":41172},{\"end\":41191,\"start\":41184},{\"end\":41201,\"start\":41195},{\"end\":41213,\"start\":41207},{\"end\":41221,\"start\":41217},{\"end\":41230,\"start\":41225},{\"end\":41545,\"start\":41540},{\"end\":41554,\"start\":41549},{\"end\":41786,\"start\":41782},{\"end\":41795,\"start\":41790},{\"end\":41805,\"start\":41799},{\"end\":41816,\"start\":41809},{\"end\":42043,\"start\":42035},{\"end\":42056,\"start\":42047},{\"end\":42064,\"start\":42060},{\"end\":42370,\"start\":42363},{\"end\":42617,\"start\":42609},{\"end\":42629,\"start\":42623},{\"end\":42637,\"start\":42633},{\"end\":42879,\"start\":42873},{\"end\":43097,\"start\":43092},{\"end\":43108,\"start\":43101},{\"end\":43119,\"start\":43112},{\"end\":43127,\"start\":43123},{\"end\":43698,\"start\":43691},{\"end\":43707,\"start\":43702},{\"end\":43718,\"start\":43711},{\"end\":43973,\"start\":43967},{\"end\":44235,\"start\":44227},{\"end\":44248,\"start\":44239},{\"end\":44256,\"start\":44252},{\"end\":44559,\"start\":44551},{\"end\":44568,\"start\":44563},{\"end\":44576,\"start\":44572},{\"end\":44778,\"start\":44772},{\"end\":44787,\"start\":44780},{\"end\":45016,\"start\":45012},{\"end\":45032,\"start\":45020},{\"end\":45436,\"start\":45431},{\"end\":45449,\"start\":45438},{\"end\":45556,\"start\":45550},{\"end\":45804,\"start\":45797},{\"end\":45816,\"start\":45808},{\"end\":45826,\"start\":45820},{\"end\":46068,\"start\":46064},{\"end\":46077,\"start\":46072},{\"end\":46087,\"start\":46081},{\"end\":46326,\"start\":46320},{\"end\":46335,\"start\":46330},{\"end\":46343,\"start\":46339},{\"end\":46352,\"start\":46347}]", "bib_entry": "[{\"attributes\":{\"id\":\"b0\",\"matched_paper_id\":35288999},\"end\":39339,\"start\":39200},{\"attributes\":{\"id\":\"b1\",\"matched_paper_id\":18467053},\"end\":39629,\"start\":39341},{\"attributes\":{\"id\":\"b2\",\"matched_paper_id\":1357484},\"end\":39882,\"start\":39631},{\"attributes\":{\"id\":\"b3\",\"matched_paper_id\":120333148},\"end\":40071,\"start\":39884},{\"attributes\":{\"id\":\"b4\",\"matched_paper_id\":120680226},\"end\":40286,\"start\":40073},{\"attributes\":{\"id\":\"b5\",\"matched_paper_id\":8077237},\"end\":40666,\"start\":40288},{\"attributes\":{\"id\":\"b6\"},\"end\":40868,\"start\":40668},{\"attributes\":{\"id\":\"b7\"},\"end\":41082,\"start\":40870},{\"attributes\":{\"id\":\"b8\"},\"end\":41478,\"start\":41084},{\"attributes\":{\"id\":\"b9\",\"matched_paper_id\":14488085},\"end\":41715,\"start\":41480},{\"attributes\":{\"id\":\"b10\",\"matched_paper_id\":7955126},\"end\":42005,\"start\":41717},{\"attributes\":{\"id\":\"b11\",\"matched_paper_id\":7395322},\"end\":42291,\"start\":42007},{\"attributes\":{\"id\":\"b12\",\"matched_paper_id\":10197974},\"end\":42540,\"start\":42293},{\"attributes\":{\"id\":\"b13\",\"matched_paper_id\":6224090},\"end\":42838,\"start\":42542},{\"attributes\":{\"id\":\"b14\",\"matched_paper_id\":119911419},\"end\":43003,\"start\":42840},{\"attributes\":{\"id\":\"b15\",\"matched_paper_id\":6517208},\"end\":43632,\"start\":43005},{\"attributes\":{\"id\":\"b16\",\"matched_paper_id\":56418798},\"end\":43877,\"start\":43634},{\"attributes\":{\"id\":\"b17\",\"matched_paper_id\":9472008},\"end\":44146,\"start\":43879},{\"attributes\":{\"id\":\"b18\",\"matched_paper_id\":16117892},\"end\":44469,\"start\":44148},{\"attributes\":{\"id\":\"b19\",\"matched_paper_id\":5837965},\"end\":44766,\"start\":44471},{\"attributes\":{\"id\":\"b20\"},\"end\":44963,\"start\":44768},{\"attributes\":{\"id\":\"b21\",\"matched_paper_id\":8960223},\"end\":45425,\"start\":44965},{\"attributes\":{\"id\":\"b22\"},\"end\":45473,\"start\":45427},{\"attributes\":{\"id\":\"b23\",\"matched_paper_id\":1343514},\"end\":45726,\"start\":45475},{\"attributes\":{\"id\":\"b24\"},\"end\":46018,\"start\":45728},{\"attributes\":{\"id\":\"b25\",\"matched_paper_id\":20958828},\"end\":46239,\"start\":46020},{\"attributes\":{\"id\":\"b26\",\"matched_paper_id\":40151669},\"end\":46539,\"start\":46241}]", "bib_title": "[{\"end\":39238,\"start\":39200},{\"end\":39399,\"start\":39341},{\"end\":39680,\"start\":39631},{\"end\":39915,\"start\":39884},{\"end\":40117,\"start\":40073},{\"end\":40334,\"start\":40288},{\"end\":41534,\"start\":41480},{\"end\":41778,\"start\":41717},{\"end\":42031,\"start\":42007},{\"end\":42359,\"start\":42293},{\"end\":42605,\"start\":42542},{\"end\":42867,\"start\":42840},{\"end\":43088,\"start\":43005},{\"end\":43687,\"start\":43634},{\"end\":43961,\"start\":43879},{\"end\":44223,\"start\":44148},{\"end\":44547,\"start\":44471},{\"end\":45008,\"start\":44965},{\"end\":45544,\"start\":45475},{\"end\":46060,\"start\":46020},{\"end\":46316,\"start\":46241}]", "bib_author": "[{\"end\":39250,\"start\":39240},{\"end\":39412,\"start\":39401},{\"end\":39423,\"start\":39412},{\"end\":39434,\"start\":39423},{\"end\":39444,\"start\":39434},{\"end\":39693,\"start\":39682},{\"end\":39702,\"start\":39693},{\"end\":39713,\"start\":39702},{\"end\":39928,\"start\":39917},{\"end\":39940,\"start\":39928},{\"end\":40139,\"start\":40119},{\"end\":40345,\"start\":40336},{\"end\":40354,\"start\":40345},{\"end\":40363,\"start\":40354},{\"end\":40374,\"start\":40363},{\"end\":40679,\"start\":40668},{\"end\":40688,\"start\":40679},{\"end\":40934,\"start\":40923},{\"end\":41182,\"start\":41170},{\"end\":41193,\"start\":41182},{\"end\":41203,\"start\":41193},{\"end\":41215,\"start\":41203},{\"end\":41223,\"start\":41215},{\"end\":41232,\"start\":41223},{\"end\":41547,\"start\":41536},{\"end\":41556,\"start\":41547},{\"end\":41788,\"start\":41780},{\"end\":41797,\"start\":41788},{\"end\":41807,\"start\":41797},{\"end\":41818,\"start\":41807},{\"end\":42045,\"start\":42033},{\"end\":42058,\"start\":42045},{\"end\":42066,\"start\":42058},{\"end\":42372,\"start\":42361},{\"end\":42619,\"start\":42607},{\"end\":42631,\"start\":42619},{\"end\":42639,\"start\":42631},{\"end\":42881,\"start\":42869},{\"end\":43099,\"start\":43090},{\"end\":43110,\"start\":43099},{\"end\":43121,\"start\":43110},{\"end\":43129,\"start\":43121},{\"end\":43700,\"start\":43689},{\"end\":43709,\"start\":43700},{\"end\":43720,\"start\":43709},{\"end\":43975,\"start\":43963},{\"end\":44237,\"start\":44225},{\"end\":44250,\"start\":44237},{\"end\":44258,\"start\":44250},{\"end\":44561,\"start\":44549},{\"end\":44570,\"start\":44561},{\"end\":44578,\"start\":44570},{\"end\":44780,\"start\":44768},{\"end\":44789,\"start\":44780},{\"end\":45018,\"start\":45010},{\"end\":45034,\"start\":45018},{\"end\":45438,\"start\":45429},{\"end\":45451,\"start\":45438},{\"end\":45558,\"start\":45546},{\"end\":45806,\"start\":45795},{\"end\":45818,\"start\":45806},{\"end\":45828,\"start\":45818},{\"end\":46070,\"start\":46062},{\"end\":46079,\"start\":46070},{\"end\":46089,\"start\":46079},{\"end\":46328,\"start\":46318},{\"end\":46337,\"start\":46328},{\"end\":46345,\"start\":46337},{\"end\":46354,\"start\":46345}]", "bib_venue": "[{\"end\":40487,\"start\":40439},{\"end\":43320,\"start\":43233},{\"end\":45191,\"start\":45121},{\"end\":39257,\"start\":39250},{\"end\":39467,\"start\":39444},{\"end\":39738,\"start\":39713},{\"end\":39962,\"start\":39940},{\"end\":40170,\"start\":40139},{\"end\":40437,\"start\":40374},{\"end\":40726,\"start\":40688},{\"end\":40921,\"start\":40870},{\"end\":41168,\"start\":41084},{\"end\":41579,\"start\":41556},{\"end\":41841,\"start\":41818},{\"end\":42088,\"start\":42066},{\"end\":42402,\"start\":42372},{\"end\":42674,\"start\":42639},{\"end\":42908,\"start\":42881},{\"end\":43231,\"start\":43129},{\"end\":43742,\"start\":43720},{\"end\":43998,\"start\":43975},{\"end\":44293,\"start\":44258},{\"end\":44601,\"start\":44578},{\"end\":44821,\"start\":44789},{\"end\":45119,\"start\":45034},{\"end\":45587,\"start\":45558},{\"end\":45793,\"start\":45728},{\"end\":46112,\"start\":46089},{\"end\":46371,\"start\":46354}]"}}}, "year": 2023, "month": 12, "day": 17}