{"id": 62502255, "updated": "2023-11-03 06:08:00.1", "metadata": {"title": "Library of Congress", "authors": "[{\"first\":\"V.C.P.\",\"last\":\"\",\"middle\":[]}]", "venue": "The Americas", "journal": "The Americas", "publication_date": {"year": 1990, "month": 1, "day": 1}, "abstract": "And from our perspective, trying to 1 answer that at this point would be like asking us to 2 categorize or classify the specific angels that are 3 dancing on the head of a pin. We'd be glad to try, 4 but we just don't see any. 5 And until we see some evidence of 6 specific adverse impacts, it's very difficult to 7 figure out whether you can design a particular class 8 of works that covers those adverse impacts. 9 If you agree with this, and if at the 10 end of the day as you assess the evidence, you don't 11 think that the adverse impact has been demonstrated, 12 you may want to take the approach of not addressing 13 the question of what would constitute a particular 14 class of works. You may want to leave flexibility 15 for yourselves and your successors three years from 16 now in the next triennial proceeding, when the 17 evidentiary record may be more complete. 18 At that time, if there is evidence of 19 specific adverse impacts, that would be a point at 20 which you'll need to decide whether that evidence 21 can be organized to define particular classes of 22 works. 23 Let me turn to, three issues that were 24 quite prominent in the hearings in Washington. In 25", "fields_of_study": "[\"Sociology\"]", "external_ids": {"arxiv": null, "mag": null, "acl": null, "pubmed": null, "pubmedcentral": null, "dblp": null, "doi": "10.1017/s0003161500076719"}}, "content": {"source": {"pdf_hash": "00a9efdb7c3799cf6c2dc8f25ff07f6af2b146bb", "pdf_src": "MergedPDFExtraction", "pdf_uri": "[\"http://www.eur.nl/WebDOC/doc/erim/erimrs20020805121818.pdf\"]", "oa_url_match": false, "oa_info": {"license": null, "open_access_url": null, "status": "CLOSED"}}, "grobid": {"id": "d6b1876d5a657899636cacc0edaacaba70a985e5", "type": "plain-text", "url": "s3://ai2-s2-science-parse-plus-prod/parse-results/s2orc_worker/00a9efdb7c3799cf6c2dc8f25ff07f6af2b146bb.txt", "contents": "\nFOR DOUBLE SIDED COPY\n\n\nFOR DOUBLE SIDED COPY\n\n\n\nof the cemetery with the name of the local geographic place in which it is located, i.e., city, county, etc., even if the cemetery is national, state, provincial, etc., in character. (Revise existing headings that do not reflect this policy when such headings are needed in current cataloging.) Do not make a reference through the place in which the cemetery is located. 110 \n\n\nConcentration Camps\n\nBefore August 1996, concentration camps were established either as name or subject headings, tagged X51. After July 1996, establish all concentration camps as name headings, tagged X10.\n\nEstablish concentration camps according to the provisions of chapter 24, AACR2. Construct headings based upon information found on items issued by the body or information found in authoritative reference sources. Do not routinely construct the name of a concentration camp to reflect solely the local place name. If the form of the heading cannot be determined from reference sources, use the form as found in the item being cataloged. Qualify the heading for a concentration camp that consists solely of the name of a place with \"(Concentration camp).\" (Revise existing headings and associated bibliographic records that do not reflect this policy when such headings are needed in current cataloging. Do not retain the post-1980, pre-August 1996 heading as a reference, unless it is a valid AACR2 reference.) Do not make a reference through the local place in which the concentration camp is located.\n\nLC practice: Convert headings for concentration camps existing in the subject authority file to name headings as needed. In converting subject authority records to name authority records, copy the subject authority record into the name authority file. Add the control number of the subject authority record as a 010$z; revise the form of heading and the tagging; evaluate existing references (revise or delete), add additional references as appropriate, delete any 550 fields 2 ; retain any 670 field(s) as is (including \"Work cat.\" preceding the citation), add a 670 field that justifies the heading chosen (item being cataloged or LC database citation); and change FFD 8 to value n, code FFD 12 as appropriate, and add the cataloger's code in FFD 25. Submit a proposal to delete the record from the subject authority file to the Subject Headings Editorial Team, Cataloging Policy and Support Office in accordance with procedures in Subject Cataloging Manual: Subject Headings H193, section 11, and H193.5. (NACO libraries: Submit the proposal to Cooperative Cataloging Team, Regional and Partnerships, etc.\n\n1) If there is clear evidence that the partnership is a formally established, stable entity, establish the phrase as a corporate body with a qualifier as appropriate. Make see also references from the headings for the partners. 2) In the absence of clear evidence that the relationship is a formal or legal partnership, do not establish as a corporate body. Rather, establish the names of the various persons, and any related corporate body, separately. On a specific bibliographic record, make added entries as indicated in the imprint and colophon of the item being cataloged. Do not apply the alternative rule found in footnote 4 to rule 24.1B. This means always using systematic romanization as the heading for a body with a name written in a nonroman script. \n\n\nLibrary of Congress Rule\n\n\nMinor Changes of Name\n\nIn the absence of explicit evidence that a true name change has taken place, consider that different usages found in publications are variants of one another, rather than true name changes)whenever the difference is a minor one defined as follows:\n\nA difference is minor if the existing heading and the name in the publication being cataloged differ only in one or more of the ways below.\n\n1) the representation of words (abbreviation, acronym, initialism, or symbol and the spelled out form; two different spellings of the same word; a word in the form of a single word and in the form of a compound);\n\n2) a change in a preposition, article, or conjunction;\n\n3) change in punctuation.\n\nN.B. For headings satisfying these conditions, if the heading has already been treated as a name change, however, with multiple headings in use consequently, do not collapse these into one heading, unless there is additional, explicit evidence that only variant names are involved.\n\n\nProposed Bodies\n\nIf a heading is needed for a proposed body, use the name found in the available sources. If the body is actually established later and the established name differs from the proposed name, use the established name in the heading and treat the proposed name as a variant form.\n\n\nUniversity Libraries Named for Persons\n\nUniversities of North America frequently have main library buildings named in honor of someone, e.g., \"The Joseph S. Regenstein Library of the University of Chicago,\" while the library complex itself is called by a generic term instead of the honorific, e.g., \"The Libraries of the University of Chicago.\" When the distinction between the building's name and the library's name can be made in this way, use the library's name as the basis for the heading even if it can be found only off the chief source or outside the item. Limit research, however, to the most obvious reference sources. If the name of a corporate body appearing in the chief source would require (according to 24.4B) the addition of a qualifier while a variant form appearing elsewhere in the item would not require such a qualifier, nonetheless use in the heading the form found on the chief source.\n\n\nLibrary of Congress Rule\n\ntitle page: Aurora verso of t.p.: Aurora, Inc. heading: 110 2# $a Aurora (Firm) Note that if one of the varying forms is in a copyright statement, it has second-class status in all situations, whether or not it or the competing form is on the chief source. This is because a form in the copyright statement, if it differs, is almost certainly an official form, the last choice under 24.2D. For names of corporate bodies that are located in countries where orthographic reform has taken place (Indonesia and Malaysia, the Netherlands, Soviet Union, etc.), if the first item received gives the name of the corporate body in the old orthography, establish the name in that form; make a reference from the form in reformed orthography. When, subsequently, the first item with the name in the reformed orthography is received, change the heading to reflect the reformed orthography; make a reference from the earlier form. Note that variant names resulting from orthographic reform are treated as such rather than as a change of name. If in a body's publications its full form of name and its initials both appear formally in the same source, choose the full form for use in the heading. (Change the heading if later evidence shows a clear pattern of predominant usage that differs from the heading chosen.)\n\n\nLibrary of Congress Rule\n\n\nLibrary of Congress Rule\n\nWhen a corporate name must be established for an item not issued by the corporate body, treat the item being cataloged as a reference source. If the item provides both the body's full form of name and its initials, choose the full form for use in the heading (even if the initials appear prominently and the full form does not).\n\nIf variant forms appear formally in chief sources of the body's publications, choose the predominant form. If an initial form (including an acronym) appears prominently, check the authority file to see if there is a reference or a heading for another body already under the same initials. If there is, this means the initials do not \"differentiate\" and thus the full form must be adopted as the AACR2 form. Do not apply the alternative rule found in footnote 7 to rule 24.3A.\n\n\nLibrary of Congress Rule\n\nIf the name of a corporate body appears on its publications in different languages, apply the following:\n\n1) If one of these is in the official language of the body, use it.\n\n2) If the body has two or more official languages, one of which is English, use the English form.\n\n3) If the body has two or more official languages, none of which is English, use the form in the language predominantly used in items issued by the body. 4) If the official language of the body is not known, use the form in the official language of the country in which the body is located if the country has a single official language. 5) If categories 1)-4) are not applicable, use the English, French, German, Spanish, or Russian form, in that order of preference. If none of these applies, use the form in the language that comes first in English alphabetic order.\n\nIf the body is an international one and its name appears in English in formal presentations in the chief sources of its own items, use the English form (24.3B1). If there is no English form, apply the provisions above.\n\nIf the name of a corporate body appears on its publications in one language form, construct the heading in the official language of the body (for nongovernment bodies) or official language of the country (for government bodies) whenever the official language is known and publications with the official language form are likely to be received. Take the name from a reliable reference source when the name in the official language does not appear in the body's publications. If the form in the official language is not available from a reliable reference source, use the form that is available and mark the heading \"provisional.\" Change the heading when the official language form becomes known. If the official language is not known or there is doubt about the official language or it is unlikely that a publication with the official language form will ever be received, use the form appearing on the body's publications. Do not mark the heading \"provisional.\" When it is known that a name or phrase represents a body exercising all the powers (or group of powers) of the government, apply the first sentence of footnote 9 and establish only the heading for the government. If an ecclesiastical parish consists of a single church, do not establish a heading for the parish. Instead, use the heading for the church. Treat the name of the parish as a variant form of the name of the church. If an ecclesiastical parish consists of two or more churches and/or chapels, apply the following:\n\n\nLibrary of Congress\n\n1) If the parish and one of the churches have a name in common, use the heading for the church (as above)\n\n2) If the name of the parish is different from the name of any of the churches, establish a separate heading for the parish. Treat the heading for the parish according to rules for local churches (e.g., 24.3G, 24.10). \n\n\nArt Galleries\n\nIf the name of an art gallery needs a general designation qualifier and 24.5C is not applicable, use the term \"(Gallery)\" as a qualifier rather than a more specific term such as \"(Art gallery).\" (Do not use \"(Gallery)\" as a qualifier for an art museum needing a general designation qualifier.) Note: Do not change existing AACR2-coded headings for art galleries solely to conform to this directive.\n\n\nConsultant Firms\n\nIf the name of a consultant firm consists solely of subject words and the word \"consultants\" (or its equivalent in other languages), add a 24.4B-type qualifier to the name (unless 24.5C is applicable). Do not add such a qualifier if the name contains other elements.\n\n\n2# $a Hospital Maintenance Consultants (Firm)\n\n\nInitialisms and Acronyms\n\nIf the name chosen for the heading for a corporate body is an initialism or acronym written in all capital letters (with or without periods between them), add a qualifier to the name (unless 24.5C is applicable). Generally do not add such a qualifier when the capitalized form is used in a see reference, unless it is required to break a conflict with the 1XX heading on another record, cf. LCRI 26.1. \n\n\n2# $a CAV (Conference)\n\n\nMultiple Qualifiers\n\nIf the name is eligible for another qualifier (as when the name conflicts or when the body is a directly entered government agency that is not an institution), add the qualifier called for in this rule first. Separate the qualifiers by a space-colon-space. \n\n\nPerforming Groups\n\nIn dealing with performing groups, apply the following: 1) If the name contains a word that specifically designates a performing group or a corporate body in general (e.g., band, consort, society) or contains a collective or plural noun (e.g., Ramblers,\n\n\nLibrary of Congress Rule Interpretations 24.4B Page 1 October 2009\n\nBoys, Hot Seven), do not add a designation to the name.\n\n2) If the name is extremely vague, consisting primarily of single, common words (e.g., Circle, Who, Jets) or the name has the appearance of a personal name (e.g., Jethro Tull), add a designation to the name.\n\n3) If the name falls between the above categories (e.g., Led Zeppelin, Jefferson Airplane, Road Apple, L.A. Contempo), add a designation to the name. 4) If there is doubt whether a designation should be added, add it.\n\nUse the designation \"(Musical group)\" unless special circumstances (such as a conflict) require a more specific term.\n\n\nDuos\n\nFor performing duos, do not add a general designation as a qualifier if the name contains two surnames (with or without forenames or forename initials) or if the name contains two forenames.\n\n\n2# $a Ferrante and Teicher\n\n\nPre-1981 Headings\n\nHeadings originally established before January 1981 that fell into either of the two categories listed below were coded \"AACR2\" prior to September 1982. Continue to use the existing form of the established heading in post-August 1982 cataloging. (Headings coded after August 1982 are in accord with AACR2 and current LC policy.)\n\n1) The heading contained a qualifier that is not needed according to current policy.\n\n\n2# $a Chefs' Rights Alliance (Society)\n\n(Do not change to: Chefs' Rights Alliance)\n\n2) The heading lacked a qualifier that would be needed according to current policy.\n\n\n2# $a BFA Educational Media\n\n(Do not change to: BFA Educational Media (Firm)) Ships LC practice: When establishing a heading for a ship, add an appropriate designation in English as a qualifier if the name alone does not convey the idea of a corporate body. For powered vessels, the appropriate designation is (Ship). If there is more than one powered vessel with the same name, add a more specific term to each to resolve the conflict. For sailing vessels, the appropriate designation is the type of rigging. The term \"ship\" as applied to sailing vessels is a particular rigging and therefore is not always appropriate. If there is more than one sailing vessel with the same name and the same rigging, add an additional qualifier (e.g., dates of existence, date launched, date ceased, port) to resolve the conflict. If the particular rigging is unknown, use the term (Sailing vessel). Update existing records not formulated according to these guidelines only when needing to resolve a conflict.\n\n\nSports Teams\n\nIf the name of a sports team does not explicitly convey the information that the entity is a sports team, add a qualifier to the name. Include in the qualifier the term \"team\" following the name of the sport.\n\n\nSurnames\n\nGenerally, do not add a general designation as a qualifier to a corporate name containing two or more surnames (without forenames or without forename initials). \n\n\n24.4C. TWO OR MORE BODIES WITH THE SAME OR SIMILAR NAMES.\n\n\nConflicts\n\nWhen two or more bodies have the same name, 24.4C1 requires the addition of a qualifier to each name. Determine that a conflict exists when the AACR 2 name or heading for one body is the same as the AACR 2 name or heading for another body. \"Conflict\" is restricted to headings already established or being established in the catalog. It includes headings for earlier names that are covered by see references to later names but excludes names treated as variants; if a variant name used in a reference conflicts with a form used in the heading for another body, apply the provisions for resolving conflicts only to the variant name. Ignore the conflict that is only between names used as variants. \n\n\n(Government body belonging to the state of South Dakota)\n\nNote that the existing heading that previously was unique but that now conflicts must be reviewed in the light of 24.4C and changed if necessary.\n\n\nNon-conflicts\n\n1) Government bodies that are not institutions a) Definition. According to 24.17, a body whose immediate parent body is the heading for a government, or whose immediate parent body is entered subordinately to the heading for a government, is treated as a government body. A body is treated as a nongovernment body, however, if its immediate parent body is entered under a heading that is not the name of a government. b) When to qualify. If a government body other than an institution (school, library, laboratory, hospital, archive, museum, prison, etc.) is entered under its own name, add the name of the government as qualifier unless the government's name (or an understandable surrogate of the government's name) is already present in the name. The qualifier is required even if the name includes a proper noun or adjective (other than the name or the surrogate of the name of the * government). (Note: \"England\", \"Scotland\", \"Wales,\" and \"Northern Ireland\"-in noun or adjectival * form-are understandable surrogates of \"Great Britain,\" in cases where \"Great Britain\" is the * appropriate government.) 110 \n\n\n24.4C\n\n2) All other bodies a) When to qualify. If a nongovernment body or a government institution (school, library, laboratory, hospital, archive, museum, prison, etc.) is entered directly under its own name, add a qualifier if the addition assists in the understanding of the nature or purpose of the body. Use judgment in making this decision, noting that the use of the undefinable phrase \"nature or purpose\" is deliberate, with the intention of letting the cataloger judge the situation-does the addition of a qualifier really improve the heading? In case of doubt, do not add the qualifier. b) Choice of qualifier. Choose the most appropriate qualifier from among the following:\n\n(1) the name of the place or jurisdiction that reflects the scope of the body's activities;\n\n(2) the name of the local place in which the body is located (or the name of the local place that is commonly associated with the body);\n\n(3) the name of the higher or related body (for subordinate or related bodies). c) Form of qualifier. When adding the name of a place or jurisdiction, use its catalog-entry form as modified by 23.4A1; 24.4C1, second paragraph; and appendix B.14. When adding the name of the higher or related body, apply LCRI 24.4C5.\n\n3) Headings already coded \"AACR2.\" Corporate name headings may be found already coded for AACR2 that lack a qualifier called for by this LCRI. Continue to use these headings without adding the qualifier unless a conflict or some other extreme need arises. If a corporate body is qualified by a geographic name (place or jurisdiction), use the heading for the current geographic entity as the qualifier (or the heading for the latest geographic name in use during the lifetime of the body if the corporate body no longer exists). Change an established heading whenever the existing qualifier becomes inappropriate (as when the geographic name changes or the corporate body moves from one locale to another). \n\n\nLibrary of Congress Rule\n\n\nTHIS PAGE INTENTIONALLY LEFT BLANK FOR DOUBLE SIDED COPY\n\n\n24.4C5\n\n\n24.4C5. INSTITUTIONS. [Formerly 24.4C7] ,\n\nWhen adding the name of a higher or related corporate body to a corporate name, give the name of the body in the form and language on which the heading for the body is based (not necessarily the catalog-entry form for the institution). Use in the qualifier the body's current name. However, if a qualifier is added to the name of a body that no longer exists, use in the qualifier the name of the body that was appropriate at the time the body ceased. If the combination of corporate name plus qualifier actually conflicts in the file being searched against, then give the qualifier in catalog-entry form.\n\nIf the higher or related body is entered subordinately, use either its parent body or its catalogentry form. If the existing qualifier becomes inappropriate because the body used in the qualifier has changed its name or the body used in the qualifier is no longer associated with the body being qualified, establish a separate heading for the body being qualified. Make earlier/later see also references to connect the headings. Note: For the period 1980-1991, the established heading was changed to reflect the latest qualifier whenever the existing qualifier became inappropriate; the form with the earlier qualifier was covered by a \"see\"-reference. Generally do not establish a separate heading for the form with the earlier qualifier that is covered by an existing \"see\"-reference.\n\n\nLibrary of Congress Rule\n\n\nPage 2 24.4C5 Library of Congress Rule Interpretations October 2009\n\n\n24.5C1\n\n\n24.5C1. TERMS INDICATING INCORPORATION AND CERTAIN OTHER TERMS.\n\nIf the adjectival term or terms indicating incorporation or state ownership of a commercial enterprise appears initially or medially in the name, it is ipso facto an integral part of the name. (Note that if the term appears initially, it may be inverted when used in the heading if 24.5C2 is also applicable.) If the term appears at the end of the name, treat it as a part of the name only if the term is necessary to show that the name refers to a corporate body.\n\nFor additional guidance on when to retain the term indicating incorporation appearing at the end of the name, see LCRI 24.4B. However, when the geographic qualifier added to a name to reflect its current status is not appropriate for the earlier entity, use two headings and qualify each. If an entity that has been treated as an independent state (country) is absorbed into an * existing state (country) and retains the same name as a part of the state into which it was aborbed * or if a part of an existing country becomes an independent state and retains the same name, create * a heading for the new entity and retain the heading for the former entity.  When the name of a state, province, or territory of Australia, Canada, or the United States, * or the name of a constituent state of Malaysia conflicts with the name of a place within the same larger jurisdiction, add the type of government as a qualifier to the larger geographic entity.  Add a qualifier to the heading for a jurisdiction that does not conflict with the heading for another jurisdiction when 1) the heading for the jurisdiction is the same as the name of a geographic area but the territory governed by the jurisdiction varies significantly from the geographic area; \n\n\nLibrary of Congress Rule\n\n\nAmbiguous Entities\n\nTreat the ambiguous entities listed below under the general principles for conference names, and establish them under the provisions of 24.7, AACR2, tagging them as X11. Before August 1996, events were established either as name or subject headings, tagged X11 or X50 respectively. After July 1996, establish all events 1 as name headings, tagged X11. Although AACR2 does not provide specifically for these types of headings, follow the general principles of 24.7, AACR2. Do not retain the pre-August 1996 heading as a reference, unless it is a valid AACR2 reference. Note that a qualifier of the type specified by 24.4B may be necessary when the name does not convey the idea of an event, e.g., Rose Bowl (Football game), but Miss America Pageant.\n\n\nAthletic contests\n\nLC practice: Convert headings for events existing in the subject authority file to name headings as needed. In converting subject authority records to name authority records, copy the subject authority record into the name authority file. Add the control number of the subject authority record as a 010 $z; revise the form of heading and the tagging; delete any 053 field; evaluate existing references (revise or delete), add additional references as appropriate, delete any 550 fields 2 ; retain any 670 field(s) as is (including \"Work cat.\" preceding the citation), add a 670 field that justifies the heading chosen (item being cataloged or LC database citation); and change FFD 8 to value n, code FFD 12 as appropriate, and add the cataloger's code in FFD 25. Submit a proposal to delete the record from the subject authority file to the Subject Headings Editorial Team, Cataloging 1 Defined here as an activity that is formally convened, directed toward a common goal, capable of being reconvened, and has a formal name, location, date, and duration that can be determined in advance of the date. 2 Note that the order of fields when copying a subject authority record differs from the traditional order of fields for name authority records. Do not reorder the fields. , Exception: Omit the abbreviated or full form of the year from the name of a conference if , the conference is ongoing and the name of the conference remains the same for each conference except for the abbreviated or full form of the year and the name is needed for main or added entry , on the bibliographic record for the conference proceedings cataloged as a serial. If the year is , omitted from the name, add the term \"Conference\" (or similar appropriate English term) as a qualifier after the name. (Once the heading is established for a serial, that form of the heading is used on all other publications related to the conference.) \n\n\nLibrary of Congress Rule\n\n\nName Authority Records\n\nOn the name authority record for a conference heading, do not add the number, date, or place to the name when the conference is an ongoing one, even if all the meetings were held in one place (cf. 24.7B4). Apply this both to meetings entered directly under their own names and to meetings entered subordinately to headings for corporate bodies.\n\n\nConflicts\n\nIf the name of an ongoing conference conflicts, add to the name an appropriate qualifier. \n\n\nDate\n\nIf the name includes an abbreviated or full form of the year and the name is followed by one or more additions, a year must always be included in these additions. \n\n\nLocation\n\nIn deciding between using local place or institution, etc. (24.7B4), when establishing the heading for a named conference, add as the qualifier the local place or institution, etc., that appears with the conference name in the source for the conference name as opposed to other locations within the item where the conference name is repeated. If an institution's name appears in the source, transcribe the institution's name as the qualifier, or if a local place name appears, transcribe that. When transcribing an institution, give it in the nominative case in the language in which it is found in the item. (Even if the institution represents a subordinate unit, record its name rather than the name of the higher body alone.) When transcribing a local place, give its catalog-entry form (as\n\n\nLibrary of Congress Rule Interpretations 24.7B Page 1 October 2009\n\n\n24.7B\n\nmodified by 23.4A1 and 24.4C1, second paragraph). If both an institution and a local place appear, prefer to use the name of the institution, etc., generally without the name of the local place unless the name of the institution is a very \"weak\" one (use judgment in this respect and do not be concerned about a high degree of consistency). Note: Do not use as location the name of a hotel, convention center, or office building unless the conference was held outside a local place.\n\nFor electronic conferences, do not add the name of the local place or other location.\n\n\nTwo or More Meetings\n\nIf the item being cataloged contains the proceedings, etc., of two meetings of the same conference and main entry under the heading for the conference is appropriate (cf. LCRI 21.1B2, Category D), enter the item under the heading for the first meeting and make an added entry under the heading for the second meeting even if the meetings are consecutively numbered.\n\nIf the item contains the proceedings, etc., of three or more meetings of the same conference, enter the item under the heading for the conference without any additions. \n\n\nAmbiguous Entities\n\nTreat the ambiguous entities listed below under the provisions of 24.8, AACR2, tagging themas X11.\n\n\nFestivals and celebrations Folk festivals and celebrations\n\nEvents 1 Before August 1996, some fairs, festivals, etc., were established either as name or subject headings, tagged X11 or X50 respectively. After July 1996, establish all such events as name headings, tagged X11. Do not retain the pre-August 1996 heading as a reference, unless it is a valid AACR2 reference. Note that a qualifier of the type specified by 24.4B may be necessary when the name does not convey the idea of a fair, festival, etc.\n\nLC practice: Convert headings for fairs, festivals, etc., existing in the subject authority file to name headings as needed. In converting subject authority records to name authority records, copy the subject authority record into the name authority file. Add the control number of the subject authority record as a 010 $z; revise the form of heading and the tagging; delete any 053 field; evaluate existing references (revise or delete), add additional references as appropriate, delete any 550 fields 2 ; retain any 670 field(s) as is (including \"Work cat.\" preceding the citation), add a 670 field that justifies the heading chosen (item being cataloged or LC database citation); and change FFD 8 to value n, code FFD 12 as appropriate, and add the cataloger's code in FFD 25. Submit a proposal to delete the record from the subject authority file to the Subject Headings Editorial Team, Cataloging Policy and Support Office. (NACO libraries: Submit the proposal to Cooperative Cataloging Team, Regional and Cooperative Cataloging Division.)\n\n\n24.9\n\n24.9. CHAPTERS, BRANCHES, ETC.\n\nThe rule is for any type of organization that covers a large geographic area in which chapters, branches, etc., are necessary for local activities of the membership. These chapters, branches, etc., can normally be recognized in two ways:\n\n1) The organization is a fraternal one;\n\n2) The designation of every chapter, branch, etc., includes a generic term that is either one traditionally used for such (\"post,\" \"lodge,\" etc.) or an imaginative innovation to convey the same sense (\"valley,\" \"stake,\" etc.).\n\nConsider the presence of any of these generic designations used for presumably all the chapters, branches, etc., as sufficient reason for subordinate entry in all cases. When the body being entered subordinately contains the name or part of the name of the higher body as an element of its own name, routinely omit this element whenever the particular higher body's name is retained in the hierarchy shown in the heading.\n\nIf a body is entered subordinately according to types 2, 3, 4, or 5, make a direct reference | from the name of the subordinate body only if its name appears without the name of its parent body on the chief source of one of its own publications. When making the reference, generally, qualify the name with the name of the parent body (in the form and language on which the heading for the parent body is based, not necessarily its catalog-entry form).\n\nNote: If a name authority record for a heading established before January 1981 contains such a direct reference, accept it as valid without examining the evidence (although a qualifier may have to be added to it). For names of corporate bodies whose official language is English, French, or Spanish, the Library will attempt a higher degree of uniformity by making a list of words used within these entities that normally imply administrative subordination. In addition to \"committee\" and \"commission\" (cf. the rule), other type 2 words for these languages are For bodies with names in English, French, or Spanish, only names containing one or more of the words listed above are to be treated according to type 2.\n\n\nLibrary of Congress Rule\n\nFor the type's second criterion, \"provided that the name of the higher body is required for the\n\n\n24.13, TYPE 6\n\n24.13, TYPE 6. SUBORDINATE AND RELATED BODIES ENTERED SUBORDINATELY Applicability Understand the term \"includes\" in the rule to apply to any linguistic relationship between the name of the body and its parent (higher or related) body, not just to those shown in the examples under type 6.\n\nUnderstand the phrase \"entire name\" to be the name that was selected for use in the heading for the parent (higher or related) body, not necessarily the catalog-entry form of the parent body's heading. For example, disregard cataloger's additions to the parent body's name or the fact that the parent body may be entered subordinately. Note, however, that if the heading for the parent body includes a term indicating incorporation, etc. (24.5C1), the form with the term must also appear in the name of the subordinate body for type 6 to be applied. When the name of a subordinate body contains more than one unit in the hierarchy, apply the \"entire name\" provision in type 6 only to the body immediately above the body being established. Exception: If the application of rule 24.14 results in the omission of the immediately above body from the heading for the subordinate body, do not apply type 6 to the name of the subordinate body in a language other than Chinese, Japanese, or Korean. For Chinese, Japanese, and Korean bodies, apply type 6 although 24.14 results in the omission of the body immediately 2) The name is a U.S. state university institution that contains the name of the statewide system. \n\n\nNamed Meetings\n\nIf a named meeting (cf. LCRI 21.1B1) contains the entire name of a corporate body (as defined above), enter the meeting subordinately to the heading for the body if the name contains, in addition to the name of the body, no more than a generic term for the meeting or not more than a generic term plus one or more of the following elements: the venue of the meeting; number, date, or other sequencing element. When the joint committee, commission, etc., is composed of representatives of more than three other bodies, make such a reference from the name of the first of the parent bodies mentioned in the item being cataloged. (In case of doubt as to which is first, make the reference from the first is alphabetic order, using the established form of name.) When the body being entered subordinately contains the name or part of the name of the higher body as an element of its own name, routinely omit this element whenever the particular higher body's name is retained in the hierarchy shown in the heading. \n\n\n$b Committee on Natural Resources and Wildlife\n\nThere is no counterpart to rule 24.13, TYPE 6, under 24.18. Therefore, even if the name of a subordinate government agency contains the entire name of its parent body (i.e., the name of the parent body in the form in which the heading of the parent body is based) and the parent body is entered subordinately to the heading for the government, nevertheless, enter the subordinate agency directly under its own name unless the name meets one of the following conditions:\n\n1) The name of the subordinate agency itself fits one of the types under 24.18.\n\n2) The name of its parent body occurs at the beginning of the subordinate agency's name and the first word is a 24. Test a name against this type only if it contains \"a word that normally implies administrative subordination.\" Whether or not a word has such an implication depends on whether it is used commonly in a particular jurisdiction as part of the names of government subdivisions. Use judgment; if in doubt, consider that the word does not have such an implication.\n\nFor names of government bodies whose official language is English, French, or Spanish, the Library will attempt a higher degree of uniformity by making a list of words used within these entities that normally imply administrative subordination. In addition to \"committee\" and \"commission\" (cf. the rule), other type 2 words for these languages are For bodies with names in English, French, or Spanish, only names containing one or more of the words listed above are to be treated according to type 2.\n\nIf the name passes the test described above, then evaluate it in terms of the second criterion in type 2: \"provided that the name of the government is required for the identification of the agency.\" Apply this criterion in the following way: If the name of the government is stated explicitly or implied in the wording of the name, enter it independently; in all other cases, enter it * * * subordinately. (Note: \"England\", \"Scotland\", \"Wales,\" and \"Northern Ireland\"-in noun or adjectival form-are understandable surrogates of \"Great Britain,\" in cases where \"Great Britain\" is the appropriate government.) Apply this interpretation to the name of agencies at any level of government. (If variant forms in the body's usage create doubt about whether the name includes the name of the government (as defined above), do not consider the name of the government as part of the name of the body.)\n\nIf according to type 2 and this interpretation the body is entered under its own name, add the name of the government as a qualifier unless this name or an understandable surrogate is already present in the body's name (cf. 24.4C).\n\n\nPage 2 24.18, TYPE 2 Library of Congress Rule Interpretations October 2009\n\nIf a body is entered subordinately according to this rule, make a direct reference from the name of the subordinate body only if its name appears without the name of its parent body on the chief source of one of its own publications. Add the name of the government as a qualifier to the reference. Note: If a name authority record for a heading established before January 1, l981, contains such a direct reference, accept it as valid without examining the evidence (although a qualifier may have to be added to it). The rules emphasize omission of hierarchy but qualify this emphasis as follows:\n\n\nLibrary of Congress Rule\n\n\"Omit ... hierarchy unless the name of the subordinate or related body has been, or is likely to be, used by another body entered under the same higher or related body\")Rule 24.14 for bodies entered under a higher body other than a jurisdiction.\n\n\"[Omit hierarchy] unless the name of the agency has been, or is likely to be, used by another agency entered under the same government\"-Rule 24.19 for bodies entered under a jurisdiction.\n\nThe words \"or is likely to be\" will carry a varying import to different catalogers. The statement below indicates the particular import of the words that Library of Congress catalogers should heed.\n\nTwo types of names do not need explanation, i.e., in these cases all catalogers reading only the rule and no gloss would reach the same conclusion. These types of names are 1) names of subordinate bodies performing functions common to many higher bodies, 1 when the name of the subordinate body (exclusive of any names of higher bodies included in the name) is as common sounding as its function:\n\nPersonnel Office Archives of the Ministry of Rural Development Research and Development Section Planning Dept.\n\n\nProcurement and Supply Division\n\nHeadings for such subordinate bodies as these obviously could not omit hierarchy.\n\n2) names of subordinate bodies performing one or more of the major functions that are unique to the particular higher body (within the same corporate structure): A decision on hierarchy in these cases is also obvious.\n\nIf the name of the body being established does not fit either of the above obvious categories, consider whether or not the name would be appropriate for another subordinate body within the same corporate structure. Common sense will be the best guide, but in some doubtful cases it may be relatively easy to make the decision if an important idea expressed in a word or phrase present in the higher body's name is missing from the name of the body. Avoid a very literal approach to this question, however. The name of the body being established may adequately imply the ideas expressed in the higher body's name without actually repeating the words of that name, 2) a unit that serves as a direct support unit to category 1). corps of engineers legal units (e.g., judge advocate general) materiel command medical corps military police transport services This means treating the following types of bodies under the general rules: research agencies (e.g., laboratories, research centers, institutes, experiment stations, museums) schools (e.g., service academies, Air University) musical groups (e.g., military bands, choirs) armories, arsenals base hospitals, other hospitals Treat forts, bases, camps, airfields, etc., as jurisdictions (see LCRI 23.1).\n\n\nU.S. Civil War Units\n\nWhen establishing either Union or Confederate fighting units of the U.S. Civil War, consult reference works (e.g., The Union Army (Madison, Wis. : Federal Pub. Co., 1908)).\n\nIf the unit is one of a numbered sequence, use a uniform designation of the number in the heading for each unit in the sequence. Make the normal cross references required by designations found and also make a reference from a standardized form beginning with the state name as shown below (only this reference is illustrated). \n\n\nLibrary of Congress Rule\n\n\n110 2# $a Red Sea (Restaurant : Washington, D.C.) 110 2# $a BANAS (Organization : Indonesia)\n\n\nPage 2 24.4B Library of Congress Rule Interpretations October 2009 (Unique heading; qualifier added to clarify the meaning of the heading) 110 2# $a Franklin (Aircraft carrier) 110 2# $a Franklin (Steamship) (Two ships of the same name but each of a different type) 110 2# $a Lexington (Aircraft carrier : CV6) 110 2# $a Lexington (Aircraft carrier : CVA(N) 65) (Two aircraft carriers with the same name)\n\n\n$a B. Morgan and D. Morgan (Firm) Page 4 24.4B Library of Congress Rule Interpretations October 2009 24.4C\n\n(\nIndependent nongovernment body) 110 2# $a Arlington Development Center (Arlington, S.D.) (Government body belonging to the city of Arlington) 110 2# $a Arlington Development Center (Infodata, Inc.) (Subordinate nongovernment body) 110 2# $a Arlington Development Center (S.D.)\n\n\n110 2# $a Rome Historical Society (Rome, N.Y.) not 110 2# $a Rome Historical Society (Rome (N.Y.)) not 110 2# $a Northside High School (Saint Joseph, Mich.) 110 2# $a Northside High School (Saint Joseph, Mich. : Township) not 110 2# $a Central Area Farmers Support Group (Wash.) 110 2# $a Central Area Farmers Support Group (Washington (State))\n\n(\nFounded in 1972; name of the government changed in 1980) 110 2# $a Fourth Presbyterian Church (Bethesda, Md.) 410 2# $a Fourth Presbyterian Church (Washington, D.C.) (Founded in 1828 in Washington, D.C.; moved to Bethesda, Md., in 1957) Library of Congress Rule Interpretations 24.4C4 Page 1 October 2009\n\n*\n\n\n*\nWhen the name of a state, province, or territory of Australia, Canada, or the United States, * or the name of a constituent state of Malaysia conflicts with the name of a place in another jurisdiction, qualify the latter only.\n\n\nException: Use \"Washington (State)\" as the heading for the state of Washington.\n\n(\nThe heading for Federation of the West Indies, which consisted only of some of the British possessions in the Caribbean; West Indies is a subject heading that covers all the islands in the Caribbean) 151 ## $a Pacific Islands (Trust Territory) * (The heading for Trust Territory of the Pacific Islands, which consists of the Caroline, Marshall, and Mariana Islands; without the qualifier the heading could refer to all the islands * of the Pacific Ocean and, in fact, Pacific Islands is a * reference to the subject heading Islands of the Pacific)* 2) the heading for the jurisdiction is the same as the name of a geographic area but the name of the jurisdiction has ceased. 151 ## $a New Guinea (Territory) * (The heading for Territory of New Guinea, which ceased in 1942; New Guinea is a subject heading for the island which contains the current jurisdictions Papua New Guinea and Propinsi Irian Jaya) Library of Congress Rule Interpretations 24.6 Page 3 October 2009 24.7. CONFERENCES, CONGRESSES, MEETINGS, ETC.\n\n(\nNames: CAV '90, CAV '91, CAV '92, CAV '93 ...; needed for main entry for the conference proceedings cataloged as a serial: Computer-aided verification: proceedings ... ) Library of Congress Rule Interpretations 24.7A Page 1 October 2009 24.7B 24.7B. ADDITIONS.\n\n\nPage 2 24.7B Library of Congress Rule Interpretations October 2009 24.7B2 24.7B2. NUMBER. LC practice: Apply the optional provision of the rule. Library of Congress Rule Interpretations 24.7B2 Page 1 October 2009 24.8 24.8. EXHIBITIONS, FAIRS, FESTIVALS, ETC.\n\n\nRite (Masonic order). $b Valley of Minneapolis 110 2# $a Vasa Order of America. $b Carl XVI Gustav Lodge 716 (Dallas, Tex.) Library of Congress Rule Interpretations 24.9 Page 1 October 2009 24.13 24.13. SUBORDINATE AND RELATED BODIES ENTERED SUBORDINATELY.\n\n\nLibrary of Congress RuleInterpretations 24.13, TYPE 6 Page 1 October 2009\n\n\nname: University of Nebraska Medical Center heading: 110 2# $a University of Nebraska Medical Center not 110 2# $a University of Nebraska (Central administration). $b Medical Center\n\n(\nJoint committee of the Association of Research Libraries, the American Library Association, the American Association of Law Libraries, and the Special Library Association) 410 2# $a Association of Research Libraries. $b Joint Committee on Government Publications Library of Congress Rule Interpretations 24.15A Page 1 October 2009 24.18. GOVERNMENT AGENCIES ENTERED SUBORDINATELY.\n\n\nname: Senate Committee on Natural Resources and Wildlife [of the California Legislature] heading: 110 1# $a California. $b Legislature. $b Senate.\n\n\n110 1# $a United States. $b Dept. of Housing and Urban Development. $b Office of Environmental Factors and Public Utilities 110 2# $a International Union for Conservation of Nature and Natural Resources. $b Commission on Education. North-West Europe Committee 110 1# $a United States. $b Office of Education. $b Office of Librarians and Learning Resources\n\n(\nOmitted: Dept. of Energy) If still in doubt, retain the higher body in the heading. Page 2 24.19 Library of Congress Rule Interpretations October 2009 24.24A. Armed forces at the national level. For forms of component branches, command districts, and military units of military services, define \"component branch, command district, or military unit\" as an agency that constitutes 1) a unit subject to combat service or an administrative unit over such units; commands corps fleets general staffs military districts regiments or divisions of infantry, etc.\n\nsource :\nsourceBooks Printed for A. and J. Churchill at the Black Swan in Pater Noster Row [Vernacular name] source: Impensis Awnsham & Johan. Churchill [Latin name] heading: 110 2# $a A. and J. Churchill (Booksellers : source: In aedibus viduae & haeredum Ioannis Stelsii heading: 110 2# $a Vidua & Haeredes Ioannis Stelsii 410 2# $a Vidua et Haeredes Joannis Stelsii 410 2# $a Vidua & Haeredes Ioannis Steelsii 410 2# $a Veuve et Héritiers de Jean Steelsius 500 0# $a Veuve de Jean Steelsius 500 1# $a Steelsius, Jean, $d 1533-1575 source: Printed for Don Allen by Grabhorn-Hoyem source: R. Grabhorn & A. Hoyem source: San Francisco tel. dir. (Grabhorn-Hoyem, prntrs & graphicLondon, England) \n410 2# $a A. & J. Churchill (Booksellers : \nLondon, England) \n410 2# $a Awnsham and John Churchill (Booksellers \n: London, England) \n410 2# $a Awnsham & Johan. Churchill (Booksellers \n: London, England) \n500 1# $a Churchill, Awnsham, $d d. 1728 \n500 1# $a Churchill, John \n\n24.1 Page 10 \nLibrary of Congress Rule Interpretations \nOctober 2009 \n\n24.1 \n\ndesgnrs) \nheading: 110 2# $a Grabhorn-Hoyem (Firm) \n\n500 1# $a Grabhorn, Robert \n500 1# $a Hoyem, Andrew \n\n\n\nsource :\nsourcePrinted by Robert and Edwin Grabhorn, 1928 heading: 100 1# $a Grabhon, Robert 510 2# $a Grabhorn Press heading: 100 1# $a Grabhorn, Edwin E. 510 2# $a Grabhorn Press source: Printed at the Grabhorn Press for the Book Club of California, 1940When a forest, park, preserve, etc. (commonly a unit of the United States National Park Service or the United States Forest Service), is needed as a main or added entry on a bibliographic record because the forest, park, preserve, etc., has some responsibility for the intellectual content of the item, create a name authority record for the forest, park, preserve, etc., under its name as a corporate body and qualify the name with \"(Agency).\"110 2# $a Chugach National Forest (Agency : U.S.) 410 1# $a United States. $b Forest Service. $bChugach National Forest 110 2# $a Aniakchak National Monument and Preserve (Agency : U.S.) 410 1# $a United States. $b National Park Service. $b Aniakchak National Monument and Preserve 24.1B. ROMANIZATION.heading:110 2# $a Grabhorn Press \n500 1# $a Grabhorn, Edwin E. \n500 1# $a Grabhorn, Robert \n\nsource: Per Andream de Torresanis de Asula 1496 \nheading: 100 1# $a Torresanus, Andreas, $c de Asula, $d \n\n1451-1529 \n400 1# $a Asulanus, Andreas, $d 1451-1529 \n400 1# $a Torresani, Andrea, $c de Asula, $d \n1451-1529 \n400 0# $a Andrea, $c socerus, $d 1451-1529 \n400 0# $a Andrea, $c d'Asola, $d 1451-1529 \n400 1# $a Torrigiani, Andrea dei, $c de Asula, \n$d 1451-1529 \n510 2# $a Aedes Aldi et Andreae Soceri \n\nLibrary of Congress Rule Interpretations \n24.1 Page 11 \nOctober 2009 \n\n24.1 \n\nsource: In aedibus Aldi et Andreae Soceri 1515 \nheading: 110 2# $a Aedes Aldi et Andreae Soceri \n\n500 1# $a Manuzio, Aldo, $d 1449 or 50-1515 \n500 1# $a Torresanus, Andreas, $c de Asula, $d \n1451-1529 \n\nsource: Ex Officina Plantiniana, apud Franciscum Raphelengium \nheading: 110 2# $a Plantijnsche Drukkerij \nheading: 100 1# $a Raphelengius, Franciscus, $d 1539-1597 \n\nForests, Parks, Preserves, etc. \n\n24.1 Page 12 \nLibrary of Congress Rule Interpretations \nOctober 2009 \n\n24.1B \n\n\n\n\n24.2B. VARIANT NAMES. GENERAL RULES.Interpretations \n24.2 Page 1 \nOctober 2009 \n\n\n\n24.2D. VARIANT NAMES. GENERAL RULES.Interpretations \n24.2C Page 1 \nOctober 2009 \n\n\nsource :\nsourceThe Executive Branch of the United States Government heading: 151 ## $a United States establish only the heading for the government if the name does not sound like an agency name of the government.but \nsource: Herausgegeben von der Bundesregierung \nheading: 110 1# $a Germany (West). Bundesregierung \n\nIf this fact cannot be known or confidently assumed, \n\n1) establish the name as one of the agencies of the government if the name sounds like an \nagency name of that government \n\n2) Library of Congress Rule Interpretations \n24.3E Page 1 \nOctober 2009 \n24.3G. LOCAL CHURCHES, ETC. \n\n\n\n\n110 2# $a Henrico Parish (Va.)Library of Congress Rule Interpretations \n24.3G Page 1 \nOctober 2009 \n24.4B \n\n24.4B. NAMES NOT CONVEYING THE IDEA OF A CORPORATE BODY. \n\n\n\n\n110 2# $a Rachel Ann (Sloop) 110 2# $a Annawan (Brig : 1841-1859) 510 2# $w b $a Annawan (Bark) (Vessel built as a brig in 1841; altered to a bark in 1859; lost at sea 1873) 110 2# $a Annawan (Brig : 1823-1839) (Vessel built in 1823; lost at sea in 1839) 110 2# $a Discovery (Ship : Launched 1789) (Merchant ship launched Dec. 19, 1789) 110 2# $a Centurion (Ship : London, England) (Work in hand refers to the vessel as being of London)110 2# $a Ohio (Bark : 1830-1888) \n\n* \n\n(Vessel built at Baltimore in 1830; lost in Arctic Ocean in \n1888) \n\n110 2# $a Maria (Ship : Active 1799) \n\n(Work in hand is a ship's receipt dated 1799) \n\n110 2# $a Columbus (Ship : 1809-1858) \n\n(Vessel built in 1809; sold and broken up in 1858) \n\n110 2# $a Columbus (Ship : 1820-1851) \n510 2# $w b $a Columbus (Bark : 1851-1858) \n\n(Vessel built in 1820; converted to bark in 1851; lost at sea \n1858) \n\nLibrary of Congress Rule Interpretations \n24.4B Page 3 \nOctober 2009 \n\n24.4B \n\n110 2# $a Columbus (Bark : 1836-1839) \n\n(Vessel built in 1836; lost 1839) \n\n110 2# $a Columbus (Bark : 1851-1858) \n510 2# $w a $a Columbus (Ship : 1820-1851) \n\n(Vessel built in 1820; converted to bark in 1851; lost at sea \n1858) \n\n\n\n\ngovernment body 110 2# $a National Endowment for the Arts (U.S.) 410 1# $a United States. $b National Endowment for the Arts 110 2# $a Cultural Resources Development Project (National Endowment for the Arts) 410 2# $a National Endowment for the Arts (U.S.). Cultural Resources Development ProjectLibrary of Congress Rule Interpretations \n24.4C Page 1 \nOctober 2009 \n\n24.4C \n\nnongovernment body \n\n\n\n\n2# $a Council on International Economic Policy (U.S.) 410 1# $a United States. $b Council on International Economic Policy 110 2# $a Dundee Harbour Trust (Great Britain) 410 1# $a Great Britain. $b Dundee Harbour Trust but 110 2# $a Baltimore Redevelopment Corporation 410 1# $a Baltimore (Md.). $b Redevelopment Corporation * 110 2# $a Welsh Joint Education Committee * 410 1# $a Great Britain. $b Welsh Joint Education Committee c) Form of qualifier. When adding the name of the government as a qualifier, use its catalog-entry form as modified by 23.4A1; 24.4C1, second paragraph; and appendix B.14. 110 2# $a You zheng bo wu guan (China) 410 1# $a China (Republic : 1949-). You zheng bo wu guan not 110 2# $a You zheng bo wu guan (China : Republic : 1949-) 110 2# $a Arbeitskreis Wissenschaftsgeschichte (Germany) 410 1# $a Germany (East). Ministerium für Hoch-und Fachschulwesen. Arbeitskreis Wissenschaftsgeschichte* \n\nnot \n\n110 2# $a Arbeitskreis Wissenschaftsgeschichte (Germany \n: East) \n\nPage 2 24.4C \nLibrary of Congress Rule Interpretations \nOctober 2009 \n\n\n\n\n24.4C4. CHANGE OF NAME OF JURISDICTION OR LOCALITY. [Formerly 24.4C6],Interpretations \n24.4C Page 3 \nOctober 2009 \n\n24.4C \n\nheading: 110 2# $a Bicentennial Committee on Historic \n\nHouses \n\n(Do not change to: 110 2# $a Bicentennial Committee \n\non Historic Houses (Morris, Conn.)) \n\nPage 4 24.4C \nLibrary of Congress Rule Interpretations \nOctober 2009 \n\n24.4C4 \n\n\n\n\nWhen a sovereign entity and another place of the same name that is not a sovereign entity * exist at the same time, do not qualify the name of the sovereign entity.When a succession of jurisdictions would be entered under the same name, use one heading for all, no matter what differences there are between the jurisdictions.Interpretations \n24.5C1 Page 1 \nOctober 2009 \n24.6. GOVERNMENTS. ADDITIONS. \n\n* \n* \n\n151 ## $a Italy (Tex.) \n\n* \n\n151 ## $a Italy \n\n* \n\n151 ## $a North Carolina \n\n* \n\nnot \n151 ## $a North Carolina (Colony) and 151 ## $a North \n\n* \n\nCarolina (State) \n\n* \n* \n\n151 ## $a Texas \n\n* \n\nnot \n151 ## $a Texas (Republic) and 151 ## $a Texas (State) \n\n* \n* \n\n151 ## $a Hawaii \n\n* \n\nnot \n\n151 ## $a Hawaii (Kingdom), 151 ## $a Hawaii (Republic), * \n\nand 151 ## $a Hawaii (State) \n\n* \n* \n\n151 ## $a India \n\n* \n\nnot \n151 ## $a India (Dominion) and 151 ## $a India (Republic) * \n\n\n\n\n*Library of Congress Rule Interpretations \n24.6 Page 1 \nOctober 2009 \n\n24.6 \n\n* \n\nexisting heading: 151 ## $a Hong Kong \n\n* \n\n(reverted to China on July 1, 1997) \n\n* \n\nadditional heading: 151 ## $a Hong Kong (China) \n\n* \n* \n\nexisting heading: 151 ## $a Eritrea (Ethiopia) \n\n* \n\n(declared independence on May 24, 1993) \n\n* \n\nadditional heading: 151 ## $a Eritrea \n\n\n\n\nAlways use dates as qualifiers to headings for expeditions, even if there is no current conflict.-For the form of the qualifier, see rule 24.4C6.If the name of a conference consists of a phrase that combines an acronym or an initialism with the abbreviated or full form of the year, retain the year as part of the name.,Interpretations \n24.7 Page 1 \nOctober 2009 \n-Dates as Qualifiers \n-\n-\n24.7 Page 2 \nLibrary of Congress Rule Interpretations \nOctober 2009 \n\n24.7A \n\n24.7A. OMISSIONS. \n\n111 2# $a GAGETECH '92 ... \n\n111 2# $a TOOLS Europe '94 ... \n\n111 2# $a AFPAC 2000 \n\n\n\n\nauthority record: 111 2# $a International Symposium on Quality Control (1974-) | bibliographic record: 111 2# $a International Symposium onauthority record: 111 2# $a Governor's Conference on \n\nEducation (Kan.) \n\nbibliographic record: 111 2# $a Governor's Conference on \n\nEducation (Kan.) $n (1st : \n$d 1954 : $c Topeka, Kan.) \n\nQuality Control (1974-) \n\n| \n\n$n (1st : $d 1974 : $c \nGeneva, Switzerland) \n\n\n\n\n111 2# $a GAGETECH '92 $d (1992 : $c Dearborn, Mich.) 111 2# $a TOOLS Europe '94 $d (1994 : $c Versailles, France) 111 2# $a AFPAC 2000 $d (2000 : $c Kiel, Germany)\n\nname :\nnameFriends of Wells Cathedral heading for parent: 110 2# $a Wells Cathedral heading: 110 2# $a Wells Cathedral. $b Friends name: Northwestern University School of Law heading for parent: 110 2# $a Northwestern University (Evanston, Ill.) heading: 110 2# $a Northwestern University (Evanston, Ill.). $b School of Law name: Osteuropa-Institut an der Freien Universität Berlin heading for parent: 110 2# $a Freie Universität Berlin heading:110 2# $a Freie Universität Berlin. $b Osteuropa-Hoechst Chemical Society heading for parent: 110 2# $a Hoechst A.G. heading: 110 2# $a Hoechst Chemical Society 110 2# $a Hoechst A.G. $b Chemical Society not name: Cambridge University Library heading for parent: 110 2# $a University of Cambridge heading: 110 2# $a Cambridge University Library 110 2# $a University of Cambridge. $b LibraryInstitut \n\nbut \n\nnot \n\nname: \n\nname :\nnameAnnual Conference of the American Academy of Advertising heading: 110 2# $a American Academy of Advertising. $b Conference $n (22nd : $d 1980 : $c name: Human Factors Society 1979 Annual Meeting heading: 110 2# $a Human Factors Society (U.S.). $b Meeting $d (1979 : Boston, Mass.)In all other cases, enter the named meeting directly under its own name.| \n\nUniversity of Missouri)Columbia) \n\nname: First Constitutional Convention of the Congress of \nIndustrial Organizations \nheading: Congress of Industrial Organizations (U.S.). $b \n\nConstitutional Convention $n (1st : $d 1938 : \n$c Pittsburgh, Pa.) \n\nname: 5th Annual Conference of the Nigerian Political Science \nAssociation \nheading: Nigerian Political Science Association. \n\nConference $n (5th : $d 1978 : $c University of \nIfe) \n\nPage 4 24.13, TYPE 6 \nLibrary of Congress Rule Interpretations \nOctober 15, 2009 \n\n24.13, TYPE 6 \n\nname: Miami University Conference on Sentence Combining \nand the Teaching of Writing \nheading:110 2# $a Miami University Conference on Sentence \n\nCombining and the Teaching of Writing \n$d (1978) \n\nnot \n\n110 2# $a Miami University. $b Conference on Sentence \nCombining and the Teaching of Writing $d (1978) \n\nname: Unesco International Chemistry Conference \nheading: 111 2# $a Unesco International Chemistry \n\n\n\n18, TYPE 1, term. (Note: If the name meets this condition, do not omit any hierarchy from the heading for the subordinate agency.) name: Veterans Administration Dental Education Center (The name does not meet either of the two conditions) heading: 110 2# $a Veterans Administration Dental Education Center (U.S.) name: Senate Committee on Natural Resources and Wildlife (The name fits 24.18, TYPE 6) heading: 110 1# $a California. $b Legislature. $b Senate. $b Committee on Natural Resources and Wildlife name: Department of Health and Social Security Library (The parent body's name occurs at the beginning and the first word is a type 1 term) heading: 110 1# $a Great Britain. $b Dept. of Health and Social Security. $b LibraryLibrary of Congress Rule Interpretations \n24.18 Page 1 \nOctober 2009 \n\n\n\nEnglish administration administrative ... (e.g., administrative office) advisory ... (e.g., advisory panel) agency authority board bureau directorate executive ... group (e.g., work group)inspectorate \noffice \npanel \nsecretariat \nservice \ntask force \nworking party \n\nFrench \n\nadministration \nagence \nbureau \ncabinet \ncomité \ncommissariat \ncommission \ndélégation \ndirection \ngroupe de ... \ninspection \nmission \noffice \n\nLibrary of Congress Rule Interpretations \n24.18, TYPE 2 Page 1 \nOctober 2009 \n\n24.18, TYPE 2 \n\nsecrétariat \nservice \n\nSpanish \n\nadministración \nagencia \nasesoría \ncomisaría \ncomisión \ncomité \nconsejería \ncoordinación \ndelegación \ndiputación \ndirección \ndirectoria \nfiscal \ngabinete \ngerencia \ngrupo de ... \njefatura \njunta \nnegociado \noficina \nsecretaría \nsecretariado \nservicio \nsuperintendencia \n\n\n\n\n24.19. DIRECT OR INDIRECT SUBHEADING.Interpretations \n24.18, TYPE 2 Page 3 \nOctober 2009 \n\n\n\nBureau of Libraries, Museums, and Archaeological Services (Under the Dept. of Conservation and Cultural Affairs which should be omitted from the heading) Division of Industry and Engineering Division of Transport (Both under the Ministry of Transport, Industry, and Engineering which should be omitted from the heading) but not Library (Also under the same ministry but belongs in category 1 and the department must be included in the heading) Both under the Dept. of Conservation which should be omitted from the heading) but not Division of Education and Publicity (Also under the same department but belongs in category 1 and the department must be included in the heading)Division of Fisheries \nDivision of Forestry \n(\n2# $a Miami Dolphins (Football team) 110 2# $a Chicago Blackhawks (Hockey team)If the team is related to an institution, make a reference from the name of the team as a subheading of the institution.110 2# $a Ohio State Buckeyes (Football team) 410 2# $a Ohio State University. $b Buckeyes (Football team)\n2# $a Newman Club (St. Joseph's College (Brooklyn, New York, N.Y.)) 110 2# $a Newman Club (St. Joseph's College (Philadelphia, Pa.))\n2# $a National Folk Media Festival $d (1988 : $c Nairobi, Kenya)\nThis evaluation of the body's functions indicated in two \"obvious\" categories is based on the names of the bodies involved, not on any special searching.Library of Congress Rule Interpretations24.19 Page 1\n1# $a United States. $b Dept. of Health, Education, and Welfare. $b Advisory Council on Vocational Education\nPlace QualifiersAdd to the name of a local church, cathedral, monastery, convent, abbey, temple, mosque, synagogue, etc., the name of the place in which it is located., ,110, Note 1: Headings already coded for AACR2 that lack a qualifier called for by this directive should not be changed unless a conflict or some other extreme need arises.Note 2: Before 1995, references were made from the place in which the local religious , institution is located. Delete such references when maintenance work is required to the authority , record for another reason. ,Multiple QualifiersIf the name needs the addition of both a general designation and the name of a place, add the general designation first.Churches, Chapels, etc., of Larger InstitutionsIf a church, chapel, etc., is a subordinate unit of a larger institution and is entered directly under its own name (24.12), generally add the name of the larger institution as a qualifier. Make a reference from the name as a subheading of the larger institution. The Library of Congress interprets \"a name that is general in nature\" in the rule as follows:1) National-level bodies. If the body is at the national-level of government, consider that the name is \"general\")and enter it subordinately)if its name lacks distinctive elements of the following types:proper nouns or adjectives; subject words; or the term \"national,\" or \"state\" (meaning \"national\"), or equivalents in foreign languages.Research Center Library Technical LaboratoryEnter the names of all other national-level bodies independently.Population Research Center Nuclear Energy Library Technical Laboratory of Oceanographic Research National Institutes of Health Corporation for Public Broadcasting National Gallery State LibraryNote: Prior to 1989, headings for names of national-level bodies consisting solely of a general phrase plus the term \"national\" or \"state\" (or their equivalents) were entered subordinately; such headings are revised when they are needed in post-1988 cataloging.2) Bodies below the national level. If the body is below the national level and its name does not fall into any other type under 24.18, enter it under the heading for the government unless either the name of the government is stated explicitly or is implied in the wording of the name or the name contains some other element tending to guarantee uniqueness (usually a proper noun or adjective). (If variant forms in the body's usage make it unclear as to whether the name includes the name of the government (as defined above), do not treat the name of the government as part of the name of the body.) In case of doubt as to whether the name of a body below the national level fits the criterion for subordinate entry, enter it subordinately.QualifiersIf according to these instructions, the body is entered under its own name, generally, add the name of the government as a qualifier unless this name or an understandable surrogate is already present in the body's name (cf. LCRI 24.4C).Library of Congress Rule Interpretations\nNACO libraries: Submit the proposal to Cooperative Cataloging Team, Regional and Cooperative Cataloging Division.) 111 2# $a Rose Bowl (Football game) 411 2# $a Rose Bowl Game 111 2# $a Tournament of Roses 411 2# $a Rose Bowl Parade 411 2# $a Rose Parade 411 2# $a Tournament of Roses Parade 411 2# $a Pasadena Tournament of Roses 111 2# $a Miss America. Policy and Support Office in accordance with procedures in Subject Cataloging Manual: Subject Headings H193, section 11, and H193.5. Pageant 111 2# $a World Cup. Soccer gamePolicy and Support Office in accordance with procedures in Subject Cataloging Manual: Subject Headings H193, section 11, and H193.5. (NACO libraries: Submit the proposal to Cooperative Cataloging Team, Regional and Cooperative Cataloging Division.) 111 2# $a Rose Bowl (Football game) 411 2# $a Rose Bowl Game 111 2# $a Tournament of Roses 411 2# $a Rose Bowl Parade 411 2# $a Rose Parade 411 2# $a Tournament of Roses Parade 411 2# $a Pasadena Tournament of Roses 111 2# $a Miss America Pageant 111 2# $a World Cup (Soccer game)\n\n2# $a Coupe de monde (Soccer). 2# $a Coupe de monde (Soccer)\n\n2# $a International Henryk Wieniawski Violin Competition 411 2# $a Henryk Wieniawski Violin Competition. 2# $a International Henryk Wieniawski Violin Competition 411 2# $a Henryk Wieniawski Violin Competition, International\n\nWhen a joint committee, commission, etc., is composed of representatives of two or three bodies, make a reference from the name of the joint committee as a subheading of each of the parent bodies. 15a, Committee, Etc Commissions, Omit from the subheading in the reference the names or abbreviations of the names of the parent bodies15A. JOINT COMMITTEE, COMMISSIONS, ETC. When a joint committee, commission, etc., is composed of representatives of two or three bodies, make a reference from the name of the joint committee as a subheading of each of the parent bodies. Omit from the subheading in the reference the names or abbreviations of the names of the parent bodies.\n\n2# $a Joint Committee on Western Europe 410 2# $a Social Science Research Council. U.S.). $b Joint Committee on Western Europe2# $a Joint Committee on Western Europe 410 2# $a Social Science Research Council (U.S.). $b Joint Committee on Western Europe\n\nIf a body is composed of representatives of two or more other bodies and these other bodies are all entered as subheadings of a common higher body, enter the joint unit as a subordinate body as. 15b, Committees, Etc Commissions, instructed in 24.14 or 24.19 if the name of the joint unit fits one of the types under 24.13 or 24.18. 110 1# $a United States. $b Joint Meteorological15B. JOINT COMMITTEES, COMMISSIONS, ETC. If a body is composed of representatives of two or more other bodies and these other bodies are all entered as subheadings of a common higher body, enter the joint unit as a subordinate body as instructed in 24.14 or 24.19 if the name of the joint unit fits one of the types under 24.13 or 24.18. 110 1# $a United States. $b Joint Meteorological\n\nApply the rule also to legislative subcommittees of U.S. state legislatures. Apply it also to other types of bodies subordinate to legislative committees and subcommittees, e.g., task forces, panels, for both the. U.S. federal and U.Sstate governmentsApply the rule also to legislative subcommittees of U.S. state legislatures. Apply it also to other types of bodies subordinate to legislative committees and subcommittees, e.g., task forces, panels, for both the U.S. federal and U.S. state governments.\n\n1# $a United States. $b Congress. $b House. $b Committee on Ways and Means. $b Subcommittee on Trade. United States -Japan Trade Task1# $a United States. $b Congress. $b House. $b Committee on Ways and Means. $b Subcommittee on Trade. United States -Japan Trade Task\n\n1# $a United States. $b Congress. $b Senate. $b Committee on Foreign Relations. $b Subcommittee on Canadian Affairs. 1# $a United States. $b Congress. $b Senate. $b Committee on Foreign Relations. $b Subcommittee on Canadian Affairs\n\nAdd the number and year (or the number, session, and year) only to the heading for the. U.S. CongressUse such a heading only if the item meets all the following conditionsAdd the number and year (or the number, session, and year) only to the heading for the U.S. Congress. Use such a heading only if the item meets all the following conditions:\n\nAn added entry must be made for the U.S. Congress as a whole or for one of its chambers. An added entry must be made for the U.S. Congress as a whole or for one of its chambers;\n\n2) No main or added entry is appropriate for any committee, subcommittee, or other subordinate unit of the U.S. Congress as a whole or of one of its chambers. 2) No main or added entry is appropriate for any committee, subcommittee, or other subordinate unit of the U.S. Congress as a whole or of one of its chambers;\n\nIn the absence of a rule for formulating headings for the prosecuting attorneys of jurisdictions, apply the principle of a conventionalized heading as authorized by 24. 23 for courts also to these prosecuting attorneysIn the absence of a rule for formulating headings for the prosecuting attorneys of jurisdictions, apply the principle of a conventionalized heading as authorized by 24.23 for courts also to these prosecuting attorneys.\n\nNote that in the states of the United States prosecuting attorneys are agents of the states as a whole. Enter under the heading for the appropriate jurisdiction. not agents of a particular county as a publication might suggestEnter under the heading for the appropriate jurisdiction. Note that in the states of the United States prosecuting attorneys are agents of the states as a whole, not agents of a particular county as a publication might suggest.\n\n3) Add as a parenthetical qualifier the name of the particular area served. Use the conventional name for the officeUse the conventional name for the office, e.g., \"Attorney,\" \"District Attorney.\" 3) Add as a parenthetical qualifier the name of the particular area served.\n\n1# $a United States. $b Attorney (District of Columbia). 1# $a United States. $b Attorney (District of Columbia)\n\n1# $a United States. $b Attorney. Illinois; Northern District1# $a United States. $b Attorney (Illinois : Northern District)\n\n1# $a New Mexico. $b District Attorney. 2nd Judicial District1# $a New Mexico. $b District Attorney (2nd Judicial District)\n\n. Ohio Infantry Regiment. 1# $a Wisconsin. $b District Attorney1# $a Wisconsin. $b District Attorney (Milwaukee County) Ohio Infantry Regiment, 29th (1861-1865)\n\nJournal history of the Twenty-ninth Ohio Veteran Volunteers). Title page(Title page: Journal history of the Twenty-ninth Ohio Veteran Volunteers)\n\n. 2# $a Ohio, Infantry, 29th Regiment2# $a Ohio Infantry, 29th Regiment (1861-1865)\n\n1# $a United States. $b Army. $b Ohio Infantry Regiment. 1# $a United States. $b Army. $b Ohio Infantry Regiment, 48th (1861-1865)\n\nHistory of the Forty-eighth Ohio Vet. Inf(Title page: History of the Forty-eighth Ohio Vet. Vol. Inf.)\n\n. 2# $a Ohio, Infantry, 48th Regiment2# $a Ohio Infantry, 48th Regiment (1861-1865)\n\n1# $a United States. $b Army. $b Pennsylvania Cavalry Regiment. 1# $a United States. $b Army. $b Pennsylvania Cavalry Regiment, 6th (1861-1865)\n\nTitle page: Annals of the Sixth Pennsylvania Cavalry). (Title page: Annals of the Sixth Pennsylvania Cavalry)\n\n2# $a Pennsylvania Cavalry. 6th Regiment2# $a Pennsylvania Cavalry, 6th Regiment (1861-1865)\n\n1# $a United States. $b Army. $b Pennsylvania Cavalry Regiment. 1# $a United States. $b Army. $b Pennsylvania Cavalry Regiment, 7th (1861-1865)\n\nTitle page: The Seventh Pennsylvania Veteran Volunteer Cavalry). (Title page: The Seventh Pennsylvania Veteran Volunteer Cavalry)\n\n2# $a Pennsylvania Cavalry. 7th Regiment2# $a Pennsylvania Cavalry, 7th Regiment (1861-1865)\n\nBecause of the high incidence of conflicts for Union units, a date qualifier (for the duration of the unit) is added routinely. Normally there is no such problem of conflict with Confederate units. N B , 24N.B. Because of the high incidence of conflicts for Union units, a date qualifier (for the duration of the unit) is added routinely. Normally there is no such problem of conflict with Confederate units. 24.27C3\n\nIf the name of the see itself, as given, would be a heading and this heading would include a larger geographic qualifier, according to 23.4, then add the qualifier within parentheses. 27c3, Etc Dioceses, Catholic Church. In case of doubt, do not qualify the name of the see27C3. CATHOLIC DIOCESES, ETC. If the name of the see itself, as given, would be a heading and this heading would include a larger geographic qualifier, according to 23.4, then add the qualifier within parentheses. Make a reference from the name of the place named in the heading in the following form: name of the local place, followed by the term for the type of body (\"Patriarchate,\" \"Diocese,\" \"Province,\" etc.) and \"Catholic Church.\" In case of doubt, do not qualify the name of the see.\n\n. 2# $a Catholic, Church, Cuba) |Archdiocese of Santiago de Cuba2# $a Catholic Church. Archdiocese of Santiago de Cuba (Cuba) |\n\n. Cuba 1# $a Santiago De, Archdiocese : Catholic ChurchCuba1# $a Santiago de Cuba (Cuba : Archdiocese : Catholic Church)\n\n2# $a Catholic, Church, Diocese of. Uppsala; Sweden2# $a Catholic Church. Diocese of Uppsala (Sweden)\n\n. 1# $a Uppsala, Diocese : Catholic ChurchSweden1# $a Uppsala (Sweden : Diocese : Catholic Church)\n\n. 2# $a Catholic, Church, Diocese of Ely (England)2# $a Catholic Church. Diocese of Ely (England)\n\nUkrainian Catholic Archeparchy of Philadelphia. 2# $a Catholic, Church, Pa.2# $a Catholic Church. Ukrainian Catholic Archeparchy of Philadelphia (Pa.)\n\n1# $a Philadelphia. Pa.Archeparchy : Catholic Church1# $a Philadelphia (Pa. : Archeparchy : Catholic Church)\n\n. 2# $a Catholic, Church, Vicariate Apostolic of Zamora (Ecuador)2# $a Catholic Church. Vicariate Apostolic of Zamora (Ecuador)\n\n. 1# $a Zamora, Vicariate Apostolic : Catholic ChurchEcuador1# $a Zamora (Ecuador : Vicariate Apostolic : Catholic Church)\n", "annotations": {"author": null, "publisher": null, "author_last_name": null, "author_first_name": null, "author_affiliation": null, "title": "[{\"end\":22,\"start\":1},{\"end\":46,\"start\":25}]", "venue": null, "abstract": null, "bib_ref": "[{\"end\":424,\"start\":421},{\"end\":5749,\"start\":5743},{\"end\":17533,\"start\":17530},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":24819,\"start\":24818}]", "figure": "[{\"attributes\":{\"id\":\"fig_2\"},\"end\":41593,\"start\":41499},{\"attributes\":{\"id\":\"fig_3\"},\"end\":42000,\"start\":41594},{\"attributes\":{\"id\":\"fig_4\"},\"end\":42109,\"start\":42001},{\"attributes\":{\"id\":\"fig_5\"},\"end\":42389,\"start\":42110},{\"attributes\":{\"id\":\"fig_6\"},\"end\":42736,\"start\":42390},{\"attributes\":{\"id\":\"fig_7\"},\"end\":43044,\"start\":42737},{\"attributes\":{\"id\":\"fig_10\"},\"end\":43048,\"start\":43045},{\"attributes\":{\"id\":\"fig_11\"},\"end\":43278,\"start\":43049},{\"attributes\":{\"id\":\"fig_12\"},\"end\":43360,\"start\":43279},{\"attributes\":{\"id\":\"fig_13\"},\"end\":44379,\"start\":43361},{\"attributes\":{\"id\":\"fig_14\"},\"end\":44643,\"start\":44380},{\"attributes\":{\"id\":\"fig_15\"},\"end\":44905,\"start\":44644},{\"attributes\":{\"id\":\"fig_16\"},\"end\":45164,\"start\":44906},{\"attributes\":{\"id\":\"fig_17\"},\"end\":45240,\"start\":45165},{\"attributes\":{\"id\":\"fig_18\"},\"end\":45424,\"start\":45241},{\"attributes\":{\"id\":\"fig_19\"},\"end\":45808,\"start\":45425},{\"attributes\":{\"id\":\"fig_20\"},\"end\":45957,\"start\":45809},{\"attributes\":{\"id\":\"fig_21\"},\"end\":46315,\"start\":45958},{\"attributes\":{\"id\":\"fig_22\"},\"end\":46874,\"start\":46316},{\"attributes\":{\"id\":\"tab_1\",\"type\":\"table\"},\"end\":48031,\"start\":46875},{\"attributes\":{\"id\":\"tab_2\",\"type\":\"table\"},\"end\":50097,\"start\":48032},{\"attributes\":{\"id\":\"tab_4\",\"type\":\"table\"},\"end\":50180,\"start\":50098},{\"attributes\":{\"id\":\"tab_6\",\"type\":\"table\"},\"end\":50264,\"start\":50181},{\"attributes\":{\"id\":\"tab_9\",\"type\":\"table\"},\"end\":50865,\"start\":50265},{\"attributes\":{\"id\":\"tab_10\",\"type\":\"table\"},\"end\":51035,\"start\":50866},{\"attributes\":{\"id\":\"tab_11\",\"type\":\"table\"},\"end\":52228,\"start\":51036},{\"attributes\":{\"id\":\"tab_12\",\"type\":\"table\"},\"end\":52627,\"start\":52229},{\"attributes\":{\"id\":\"tab_13\",\"type\":\"table\"},\"end\":53699,\"start\":52628},{\"attributes\":{\"id\":\"tab_14\",\"type\":\"table\"},\"end\":54063,\"start\":53700},{\"attributes\":{\"id\":\"tab_17\",\"type\":\"table\"},\"end\":54957,\"start\":54064},{\"attributes\":{\"id\":\"tab_18\",\"type\":\"table\"},\"end\":55324,\"start\":54958},{\"attributes\":{\"id\":\"tab_20\",\"type\":\"table\"},\"end\":55900,\"start\":55325},{\"attributes\":{\"id\":\"tab_21\",\"type\":\"table\"},\"end\":56309,\"start\":55901},{\"attributes\":{\"id\":\"tab_22\",\"type\":\"table\"},\"end\":56476,\"start\":56310},{\"attributes\":{\"id\":\"tab_25\",\"type\":\"table\"},\"end\":57342,\"start\":56477},{\"attributes\":{\"id\":\"tab_26\",\"type\":\"table\"},\"end\":58648,\"start\":57343},{\"attributes\":{\"id\":\"tab_27\",\"type\":\"table\"},\"end\":59450,\"start\":58649},{\"attributes\":{\"id\":\"tab_28\",\"type\":\"table\"},\"end\":60271,\"start\":59451},{\"attributes\":{\"id\":\"tab_29\",\"type\":\"table\"},\"end\":60364,\"start\":60272},{\"attributes\":{\"id\":\"tab_30\",\"type\":\"table\"},\"end\":61089,\"start\":60365}]", "paragraph": "[{\"end\":425,\"start\":50},{\"end\":634,\"start\":449},{\"end\":1537,\"start\":636},{\"end\":2647,\"start\":1539},{\"end\":3413,\"start\":2649},{\"end\":3713,\"start\":3466},{\"end\":3854,\"start\":3715},{\"end\":4068,\"start\":3856},{\"end\":4124,\"start\":4070},{\"end\":4151,\"start\":4126},{\"end\":4434,\"start\":4153},{\"end\":4728,\"start\":4454},{\"end\":5641,\"start\":4771},{\"end\":6972,\"start\":5670},{\"end\":7356,\"start\":7028},{\"end\":7833,\"start\":7358},{\"end\":7966,\"start\":7862},{\"end\":8035,\"start\":7968},{\"end\":8134,\"start\":8037},{\"end\":8704,\"start\":8136},{\"end\":8924,\"start\":8706},{\"end\":10412,\"start\":8926},{\"end\":10541,\"start\":10436},{\"end\":10761,\"start\":10543},{\"end\":11177,\"start\":10779},{\"end\":11464,\"start\":11198},{\"end\":11943,\"start\":11541},{\"end\":12249,\"start\":11992},{\"end\":12524,\"start\":12271},{\"end\":12650,\"start\":12595},{\"end\":12859,\"start\":12652},{\"end\":13078,\"start\":12861},{\"end\":13197,\"start\":13080},{\"end\":13396,\"start\":13206},{\"end\":13775,\"start\":13447},{\"end\":13861,\"start\":13777},{\"end\":13946,\"start\":13904},{\"end\":14031,\"start\":13948},{\"end\":15029,\"start\":14063},{\"end\":15254,\"start\":15046},{\"end\":15428,\"start\":15267},{\"end\":16199,\"start\":15502},{\"end\":16405,\"start\":16260},{\"end\":17534,\"start\":16423},{\"end\":18221,\"start\":17544},{\"end\":18314,\"start\":18223},{\"end\":18452,\"start\":18316},{\"end\":18770,\"start\":18454},{\"end\":19479,\"start\":18772},{\"end\":20225,\"start\":19620},{\"end\":21013,\"start\":20227},{\"end\":21651,\"start\":21187},{\"end\":22897,\"start\":21653},{\"end\":23695,\"start\":22947},{\"end\":25630,\"start\":23717},{\"end\":26028,\"start\":25684},{\"end\":26132,\"start\":26042},{\"end\":26304,\"start\":26141},{\"end\":27110,\"start\":26317},{\"end\":27671,\"start\":27189},{\"end\":27758,\"start\":27673},{\"end\":28148,\"start\":27783},{\"end\":28319,\"start\":28150},{\"end\":28440,\"start\":28342},{\"end\":28949,\"start\":28503},{\"end\":29995,\"start\":28951},{\"end\":30034,\"start\":30004},{\"end\":30273,\"start\":30036},{\"end\":30314,\"start\":30275},{\"end\":30542,\"start\":30316},{\"end\":30965,\"start\":30544},{\"end\":31418,\"start\":30967},{\"end\":32133,\"start\":31420},{\"end\":32257,\"start\":32162},{\"end\":32563,\"start\":32275},{\"end\":33773,\"start\":32565},{\"end\":34803,\"start\":33792},{\"end\":35323,\"start\":34854},{\"end\":35404,\"start\":35325},{\"end\":35880,\"start\":35406},{\"end\":36382,\"start\":35882},{\"end\":37276,\"start\":36384},{\"end\":37509,\"start\":37278},{\"end\":38183,\"start\":37588},{\"end\":38457,\"start\":38212},{\"end\":38646,\"start\":38459},{\"end\":38845,\"start\":38648},{\"end\":39243,\"start\":38847},{\"end\":39355,\"start\":39245},{\"end\":39472,\"start\":39391},{\"end\":39691,\"start\":39474},{\"end\":40945,\"start\":39693},{\"end\":41142,\"start\":40970},{\"end\":41471,\"start\":41144}]", "formula": null, "table_ref": null, "section_header": "[{\"end\":447,\"start\":428},{\"end\":3440,\"start\":3416},{\"end\":3464,\"start\":3443},{\"end\":4452,\"start\":4437},{\"end\":4769,\"start\":4731},{\"end\":5668,\"start\":5644},{\"end\":6999,\"start\":6975},{\"end\":7026,\"start\":7002},{\"end\":7860,\"start\":7836},{\"end\":10434,\"start\":10415},{\"end\":10777,\"start\":10764},{\"end\":11196,\"start\":11180},{\"attributes\":{\"n\":\"110\"},\"end\":11512,\"start\":11467},{\"end\":11539,\"start\":11515},{\"attributes\":{\"n\":\"111\"},\"end\":11968,\"start\":11946},{\"end\":11990,\"start\":11971},{\"end\":12269,\"start\":12252},{\"end\":12593,\"start\":12527},{\"end\":13204,\"start\":13200},{\"attributes\":{\"n\":\"110\"},\"end\":13425,\"start\":13399},{\"end\":13445,\"start\":13428},{\"attributes\":{\"n\":\"110\"},\"end\":13902,\"start\":13864},{\"attributes\":{\"n\":\"110\"},\"end\":14061,\"start\":14034},{\"end\":15044,\"start\":15032},{\"end\":15265,\"start\":15257},{\"end\":15488,\"start\":15431},{\"end\":15500,\"start\":15491},{\"end\":16258,\"start\":16202},{\"end\":16421,\"start\":16408},{\"end\":17542,\"start\":17537},{\"end\":19506,\"start\":19482},{\"end\":19565,\"start\":19509},{\"end\":19574,\"start\":19568},{\"end\":19618,\"start\":19577},{\"end\":21040,\"start\":21016},{\"end\":21110,\"start\":21043},{\"end\":21119,\"start\":21113},{\"end\":21185,\"start\":21122},{\"end\":22924,\"start\":22900},{\"end\":22945,\"start\":22927},{\"end\":23715,\"start\":23698},{\"end\":25657,\"start\":25633},{\"end\":25682,\"start\":25660},{\"end\":26040,\"start\":26031},{\"end\":26139,\"start\":26135},{\"end\":26315,\"start\":26307},{\"end\":27179,\"start\":27113},{\"end\":27187,\"start\":27182},{\"end\":27781,\"start\":27761},{\"end\":28340,\"start\":28322},{\"end\":28501,\"start\":28443},{\"end\":30002,\"start\":29998},{\"end\":32160,\"start\":32136},{\"end\":32273,\"start\":32260},{\"end\":33790,\"start\":33776},{\"end\":34852,\"start\":34806},{\"end\":37586,\"start\":37512},{\"end\":38210,\"start\":38186},{\"end\":39389,\"start\":39358},{\"end\":40968,\"start\":40948},{\"end\":41498,\"start\":41474},{\"end\":42112,\"start\":42111},{\"end\":42739,\"start\":42738},{\"end\":43047,\"start\":43046},{\"end\":43051,\"start\":43050},{\"end\":43363,\"start\":43362},{\"end\":44382,\"start\":44381},{\"end\":45427,\"start\":45426},{\"end\":46318,\"start\":46317},{\"end\":46884,\"start\":46876},{\"end\":48041,\"start\":48033},{\"end\":50274,\"start\":50266},{\"end\":56484,\"start\":56478},{\"end\":57350,\"start\":57344}]", "table": "[{\"end\":48031,\"start\":47554},{\"end\":50097,\"start\":49035},{\"end\":50180,\"start\":50136},{\"end\":50264,\"start\":50219},{\"end\":50865,\"start\":50478},{\"end\":51035,\"start\":50898},{\"end\":52228,\"start\":51474},{\"end\":52627,\"start\":52527},{\"end\":53699,\"start\":53551},{\"end\":54063,\"start\":53772},{\"end\":54957,\"start\":54391},{\"end\":55324,\"start\":54961},{\"end\":55900,\"start\":55647},{\"end\":56309,\"start\":56042},{\"end\":57342,\"start\":57313},{\"end\":58648,\"start\":57707},{\"end\":59450,\"start\":59380},{\"end\":60271,\"start\":59641},{\"end\":60364,\"start\":60311},{\"end\":61089,\"start\":61043}]", "figure_caption": "[{\"end\":41593,\"start\":41501},{\"end\":42000,\"start\":41596},{\"end\":42109,\"start\":42003},{\"end\":42389,\"start\":42113},{\"end\":42736,\"start\":42392},{\"end\":43044,\"start\":42740},{\"end\":43278,\"start\":43052},{\"end\":43360,\"start\":43281},{\"end\":44379,\"start\":43364},{\"end\":44643,\"start\":44383},{\"end\":44905,\"start\":44646},{\"end\":45164,\"start\":44908},{\"end\":45240,\"start\":45167},{\"end\":45424,\"start\":45243},{\"end\":45808,\"start\":45428},{\"end\":45957,\"start\":45811},{\"end\":46315,\"start\":45960},{\"end\":46874,\"start\":46319},{\"end\":47554,\"start\":46891},{\"end\":49035,\"start\":48048},{\"end\":50136,\"start\":50100},{\"end\":50219,\"start\":50183},{\"end\":50478,\"start\":50281},{\"end\":50898,\"start\":50868},{\"end\":51474,\"start\":51038},{\"end\":52527,\"start\":52231},{\"end\":53551,\"start\":52630},{\"end\":53772,\"start\":53702},{\"end\":54391,\"start\":54066},{\"end\":54961,\"start\":54960},{\"end\":55647,\"start\":55327},{\"end\":56042,\"start\":55903},{\"end\":56476,\"start\":56312},{\"end\":57313,\"start\":56489},{\"end\":57707,\"start\":57355},{\"end\":59380,\"start\":58651},{\"end\":59641,\"start\":59453},{\"end\":60311,\"start\":60274},{\"end\":61043,\"start\":60367}]", "figure_ref": null, "bib_author_first_name": "[{\"end\":66502,\"start\":66499},{\"end\":67429,\"start\":67426},{\"end\":73000,\"start\":72999},{\"end\":73002,\"start\":73001},{\"end\":73412,\"start\":73409},{\"end\":74120,\"start\":74116}]", "bib_author_last_name": "[{\"end\":66486,\"start\":66483},{\"end\":66497,\"start\":66488},{\"end\":66514,\"start\":66503},{\"end\":67412,\"start\":67409},{\"end\":67424,\"start\":67414},{\"end\":67441,\"start\":67430},{\"end\":71687,\"start\":71677},{\"end\":71697,\"start\":71689},{\"end\":72008,\"start\":71998},{\"end\":72018,\"start\":72010},{\"end\":73407,\"start\":73403},{\"end\":73421,\"start\":73413},{\"end\":74001,\"start\":73987},{\"end\":74009,\"start\":74003},{\"end\":74138,\"start\":74121},{\"end\":74250,\"start\":74236},{\"end\":74258,\"start\":74252},{\"end\":74354,\"start\":74341},{\"end\":74455,\"start\":74441},{\"end\":74463,\"start\":74457},{\"end\":74600,\"start\":74586},{\"end\":74608,\"start\":74602},{\"end\":74816,\"start\":74802},{\"end\":74824,\"start\":74818},{\"end\":74943,\"start\":74931}]", "bib_entry": "[{\"attributes\":{\"id\":\"b0\"},\"end\":65997,\"start\":64940},{\"attributes\":{\"id\":\"b1\"},\"end\":66059,\"start\":65999},{\"attributes\":{\"id\":\"b2\"},\"end\":66284,\"start\":66061},{\"attributes\":{\"id\":\"b3\"},\"end\":66958,\"start\":66286},{\"attributes\":{\"id\":\"b4\"},\"end\":67212,\"start\":66960},{\"attributes\":{\"id\":\"b5\"},\"end\":67980,\"start\":67214},{\"attributes\":{\"id\":\"b6\"},\"end\":68486,\"start\":67982},{\"attributes\":{\"id\":\"b7\"},\"end\":68754,\"start\":68488},{\"attributes\":{\"id\":\"b8\"},\"end\":68988,\"start\":68756},{\"attributes\":{\"id\":\"b9\"},\"end\":69334,\"start\":68990},{\"attributes\":{\"id\":\"b10\"},\"end\":69513,\"start\":69336},{\"attributes\":{\"id\":\"b11\"},\"end\":69832,\"start\":69515},{\"attributes\":{\"id\":\"b12\"},\"end\":70270,\"start\":69834},{\"attributes\":{\"id\":\"b13\"},\"end\":70725,\"start\":70272},{\"attributes\":{\"id\":\"b14\"},\"end\":70999,\"start\":70727},{\"attributes\":{\"id\":\"b15\"},\"end\":71113,\"start\":71001},{\"attributes\":{\"id\":\"b16\"},\"end\":71239,\"start\":71115},{\"attributes\":{\"id\":\"b17\"},\"end\":71364,\"start\":71241},{\"attributes\":{\"id\":\"b18\"},\"end\":71526,\"start\":71366},{\"attributes\":{\"id\":\"b19\"},\"end\":71673,\"start\":71528},{\"attributes\":{\"id\":\"b20\"},\"end\":71758,\"start\":71675},{\"attributes\":{\"id\":\"b21\"},\"end\":71890,\"start\":71760},{\"attributes\":{\"id\":\"b22\"},\"end\":71994,\"start\":71892},{\"attributes\":{\"id\":\"b23\"},\"end\":72079,\"start\":71996},{\"attributes\":{\"id\":\"b24\"},\"end\":72224,\"start\":72081},{\"attributes\":{\"id\":\"b25\"},\"end\":72335,\"start\":72226},{\"attributes\":{\"id\":\"b26\"},\"end\":72429,\"start\":72337},{\"attributes\":{\"id\":\"b27\"},\"end\":72574,\"start\":72431},{\"attributes\":{\"id\":\"b28\"},\"end\":72705,\"start\":72576},{\"attributes\":{\"id\":\"b29\"},\"end\":72799,\"start\":72707},{\"attributes\":{\"id\":\"b30\"},\"end\":73217,\"start\":72801},{\"attributes\":{\"id\":\"b31\"},\"end\":73983,\"start\":73219},{\"attributes\":{\"id\":\"b32\"},\"end\":74112,\"start\":73985},{\"attributes\":{\"id\":\"b33\"},\"end\":74234,\"start\":74114},{\"attributes\":{\"id\":\"b34\"},\"end\":74337,\"start\":74236},{\"attributes\":{\"id\":\"b35\"},\"end\":74437,\"start\":74339},{\"attributes\":{\"id\":\"b36\"},\"end\":74536,\"start\":74439},{\"attributes\":{\"id\":\"b37\"},\"end\":74688,\"start\":74538},{\"attributes\":{\"id\":\"b38\"},\"end\":74798,\"start\":74690},{\"attributes\":{\"id\":\"b39\"},\"end\":74927,\"start\":74800},{\"attributes\":{\"id\":\"b40\"},\"end\":75051,\"start\":74929}]", "bib_title": "[{\"end\":65293,\"start\":64940}]", "bib_author": "[{\"end\":66488,\"start\":66483},{\"end\":66499,\"start\":66488},{\"end\":66516,\"start\":66499},{\"end\":67414,\"start\":67409},{\"end\":67426,\"start\":67414},{\"end\":67443,\"start\":67426},{\"end\":71689,\"start\":71677},{\"end\":71699,\"start\":71689},{\"end\":72010,\"start\":71998},{\"end\":72020,\"start\":72010},{\"end\":73005,\"start\":72999},{\"end\":73409,\"start\":73403},{\"end\":73423,\"start\":73409},{\"end\":74003,\"start\":73987},{\"end\":74011,\"start\":74003},{\"end\":74140,\"start\":74116},{\"end\":74252,\"start\":74236},{\"end\":74260,\"start\":74252},{\"end\":74356,\"start\":74341},{\"end\":74457,\"start\":74441},{\"end\":74465,\"start\":74457},{\"end\":74602,\"start\":74586},{\"end\":74610,\"start\":74602},{\"end\":74818,\"start\":74802},{\"end\":74826,\"start\":74818},{\"end\":74945,\"start\":74931}]", "bib_venue": "[{\"end\":65426,\"start\":65295},{\"end\":66028,\"start\":65999},{\"end\":66164,\"start\":66061},{\"end\":66481,\"start\":66286},{\"end\":67041,\"start\":66960},{\"end\":67407,\"start\":67214},{\"end\":68194,\"start\":67982},{\"end\":68588,\"start\":68488},{\"end\":68871,\"start\":68756},{\"end\":69076,\"start\":68990},{\"end\":69423,\"start\":69336},{\"end\":69672,\"start\":69515},{\"end\":70001,\"start\":69834},{\"end\":70374,\"start\":70272},{\"end\":70801,\"start\":70727},{\"end\":71056,\"start\":71001},{\"end\":71147,\"start\":71115},{\"end\":71279,\"start\":71241},{\"end\":71390,\"start\":71368},{\"end\":71588,\"start\":71528},{\"end\":71815,\"start\":71760},{\"end\":71928,\"start\":71892},{\"end\":72143,\"start\":72081},{\"end\":72279,\"start\":72226},{\"end\":72363,\"start\":72337},{\"end\":72493,\"start\":72431},{\"end\":72639,\"start\":72576},{\"end\":72733,\"start\":72707},{\"end\":72997,\"start\":72801},{\"end\":73401,\"start\":73219},{\"end\":74270,\"start\":74260},{\"end\":74584,\"start\":74538},{\"end\":74708,\"start\":74690},{\"end\":67086,\"start\":67043},{\"end\":68621,\"start\":68590},{\"end\":71176,\"start\":71149},{\"end\":74287,\"start\":74272},{\"end\":74713,\"start\":74710}]"}}}, "year": 2023, "month": 12, "day": 17}