{"id": 6308361, "updated": "2023-07-18 22:15:14.406", "metadata": {"title": "ReferItGame: Referring to Objects in Photographs of Natural Scenes", "authors": "[{\"first\":\"Sahar\",\"last\":\"Kazemzadeh\",\"middle\":[]},{\"first\":\"Vicente\",\"last\":\"Ordonez\",\"middle\":[]},{\"first\":\"Mark\",\"last\":\"Matten\",\"middle\":[]},{\"first\":\"Tamara\",\"last\":\"Berg\",\"middle\":[]}]", "venue": "EMNLP", "journal": "Proceedings of the 2014 Conference on Empirical Methods in Natural Language Processing (EMNLP)", "publication_date": {"year": 2014, "month": null, "day": null}, "abstract": "In this paper we introduce a new game to crowd-source natural language referring expressions. By designing a two player game, we can both collect and verify referring expressions directly within the game. To date, the game has produced a dataset containing 130,525 expressions, referring to 96,654 distinct objects, in 19,894 photographs of natural scenes. This dataset is larger and more varied than previous REG datasets and allows us to study referring expressions in real-world scenes. We provide an in depth analysis of the resulting dataset. Based on our ﬁndings, we design a new optimization based model for generating referring expressions and perform experimental evaluations on 3 test sets.", "fields_of_study": "[\"Computer Science\"]", "external_ids": {"arxiv": null, "mag": "2251512949", "acl": "D14-1086", "pubmed": null, "pubmedcentral": null, "dblp": "conf/emnlp/KazemzadehOMB14", "doi": "10.3115/v1/d14-1086"}}, "content": {"source": {"pdf_hash": "e565ed9d1aa9234c4bb718da11372fc3218a5ec7", "pdf_src": "ACL", "pdf_uri": "[\"https://www.aclweb.org/anthology/D14-1086.pdf\"]", "oa_url_match": false, "oa_info": {"license": null, "open_access_url": "http://www.tamaraberg.com/papers/referit.pdf", "status": "GREEN"}}, "grobid": {"id": "43a5f31f2b8743d36a12ef1fad72849d553f621c", "type": "plain-text", "url": "s3://ai2-s2-pdf-extraction-prod/parse-results/s2orc_worker/e565ed9d1aa9234c4bb718da11372fc3218a5ec7.txt", "contents": "\nReferItGame: Referring to Objects in Photographs of Natural Scenes\nAssociation for Computational LinguisticsCopyright Association for Computational LinguisticsOctober 25-29, 2014. 2014\n\nSahar Kazemzadeh \nUniversity of North Carolina at Chapel Hill\nChapel Hill27599NCUSA\n\nVicente Ordonez vicente@cs.unc.edu \nUniversity of North Carolina at Chapel Hill\nChapel Hill27599NCUSA\n\nMark Matten \nThe Bishop's School\n92037San DiegoCAUSA\n\nTamara L Berg tlberg@cs.unc.edu \nUniversity of North Carolina at Chapel Hill\nChapel Hill27599NCUSA\n\nReferItGame: Referring to Objects in Photographs of Natural Scenes\n\nProceedings of the 2014 Conference on Empirical Methods in Natural Language Processing (EMNLP)\nthe 2014 Conference on Empirical Methods in Natural Language Processing (EMNLP)Doha, Qatar. cAssociation for Computational LinguisticsOctober 25-29, 2014. 2014\nIn this paper we introduce a new game to crowd-source natural language referring expressions. By designing a two player game, we can both collect and verify referring expressions directly within the game. To date, the game has produced a dataset containing 130,525 expressions, referring to 96,654 distinct objects, in 19,894 photographs of natural scenes. This dataset is larger and more varied than previous REG datasets and allows us to study referring expressions in real-world scenes. We provide an in depth analysis of the resulting dataset. Based on our findings, we design a new optimization based model for generating referring expressions and perform experimental evaluations on 3 test sets.\n\nIntroduction\n\nMuch of everyday language and discourse concerns the visual world around us, making understanding the relationship between objects in the physical world and language describing those objects an important challenge problem for AI. From robotics, to image search, to situated language learning, and natural language grounding, there are a number of research areas that would benefit from a better understanding of how people refer to physical entities in the world.\n\nRecent advances in automatic computer vision methods have started to make technologies for recognizing thousands of object categories a near reality (Perronnin et al., 2012;Deng et al., 2012;Deng et al., 2010;Krizhevsky et al., 2012). As a result, there has been a spurt of recent work trying to estimate higher level semantics, including exciting efforts to automatically produce natural language descriptions of images and video (Farhadi et * Indicates equal author contribution. al., 2010;Yang et al., 2011;Ordonez et al., 2011;Kuznetsova et al., 2012;Feng and Lapata, 2013). Common challenges encountered in these pursuits include the fact that descriptions can be highly task dependent, openended, and difficult to evaluate automatically. Therefore, we look at the related, but more focused problem of referring expression generation (REG). Previous work on REG has made significant progress toward understanding how people generate expressions to refer to objects (a recent survey of techniques is provided in ). In this paper, we study the relatively unexplored setting of how people refer to objects in complex photographs of real-world cluttered scenes. One initial stumbling block to examining this scenario is lack of existing relevant datasets, as previous collections for studying REG have used relatively focused domains such as graphics generated objects (van Deemter et al., 2006;Viethen and Dale, 2008), crafts (Mitchell et al., 2010), or small everyday (home and office) objects arrayed on a simple background (Mitchell et al., 2013a;FitzGerald et al., 2013).\n\nIn this paper, we collect a new large-scale corpus, currently containing 130,525 expressions, referring to 96,654 distinct objects, in 19,894 photographs of real world scenes. Some examples from our dataset are shown in Figure 5. To construct this corpus efficiently, we design a new two player referring expression game (ReferItGame) to crowd-source the data collection. Popularized by efforts like the ESP game (von Ahn and Dabbish, 2004) and Peekaboom (von Ahn et al., 2006b), Human Computation based games can be an effective way to engage users and collect large amounts of data inexpensively. Two player games can also automate verification of human provided annotations.\n\nOur resulting corpus is both more real-world and much bigger than previous datasets, allowing us to examine referring expression generation in a new setting at large scale. To understand and quantify this new dataset, we perform an extensive set of analyses. One significant difference from previous work is that we study how referring expressions vary for different categories. We find that an object's category greatly influences the types of attributes used in their referring expression (e.g. people use color words to describe cars more often than mountains). Additionally, we find that references to an object are sometimes made with respect to other nearby objects, e.g. \"the ball to left of the man\". Interestingly, the types of reference objects (i.e. \"the man\") used in referring expressions is also biased toward some categories. Finally, we find that the word used to refer to the object category itself displays consistencies across people. This notion is related to ideas of entrylevel categories from Psychology (Rosch, 1978).\n\nGiven these findings, we propose an optimization model for generating referring expressions that jointly selects which attributes to include in the expression, and what attribute values to generate. This model incorporates both visual models for selecting attribute-values and object category specific priors. Experimental evaluations indicate that our proposed model produces reasonable results for REG.\n\nIn summary, contributions of our paper include:\n\n• A two player online game to collect and verify natural language referring expressions.\n\n• A new large-scale dataset containing natural language expressions referring to objects in photographs of real world scenes.\n\n• Analyses of the collected dataset, including studying category-specific variations in referring expressions.\n\n• An optimization based model to generate referring expressions for objects in realworld scenes with experimental evaluations on three labeled test sets.\n\nThe rest of the paper is organized as follows. First we outline related work from the vision and language communities ( §2). Then we describe our online game for collecting referring expressions ( §3) and provide an analysis of our new Refer-ItGame Dataset ( §4). Finally, we present and evaluate our model for generating referring expressions ( §5) and discuss conclusions and future work ( §6).\n\n\nRelated Work\n\nReferring Expression Generation: There has been a long history of research on understanding how people generate referring expressions, dating back to the 1970s (Winograd, 1972). One common approach is the Incremental Algorithm (Dale and Reiter, 1995;Dale and Reiter, 2000) which uses logical expressions for generation. Much work in REG follows the Gricean maxims (Grice, 1975) which provide principles for how people will behave in conversation.\n\nRecently, there has been progress examining other aspects of the referring expression problem such as understanding what types of attributes are used (Mitchell et al., 2013a), modeling variations between speakers (Viethen and Dale, 2010;Viethen et al., 2013;Mitchell et al., 2013b), incorporating visual classifiers (Mitchell et al., 2011), producing algorithms to refer to object sets (Ren et al., 2010;FitzGerald et al., 2013), or examining impoverished perception REG (Fang et al., 2013). A good survey of work in this area is provided in . We build on past work, extending models to generate attributes jointly in a category specific framework. Referring Expression Datasets: Some initial datasets in REG used graphics engines to produce images of objects (van Deemter et al., 2006;Viethen and Dale, 2008). Recently more realistic datasets have been introduced, consisting of craft objects like pipecleaners, ribbons, and feathers (Mitchell et al., 2010), or everyday home and office objects such as staplers, combs, or rulers (Mitchell et al., 2013a), arrayed on a simple background. These datasets helped moved referring expression generation research into the domain of real world objects. We seek to further these pursuits by constructing a dataset of natural objects in photographs of the real world. Image & Video Description Generation: Recent research on automatic image description has followed two main directions. Retrieval based methods (Aker and Gaizauskas, 2010;Farhadi et al., 2010;Ordonez et al., 2011;Feng and Lapata, 2010;Feng and Lapata, 2013) retrieve existing captions or phrases to describe a query image. Bottom up methods Yang et al., 2011;Yao et al., 2010) rely on visual classifiers to first recognize image content and then construct captions from scratch, perhaps with some Figure 1: An example game. Player 1 (left) sees an image with an object outlined in red (the man) and provides a referring expression for the object (\"man in red shirt on horse\"). Player 2 (right) sees the image and the expression from Player 1 and must localize the correct object by clicking on it (click indicated by the red square). Elapsed time and current scores are also provided.\n\ninput from natural language statistics. Very recently, these ideas have been extended to produce descriptions for videos (Guadarrama et al., 2013;Barbu et al., 2012). Like these methods, we generate descriptions for natural scenes, but focus on referring to particular objects rather than providing an overall description of an image or video.\n\nHuman Computation Games: Games can be a useful tool for collecting large amounts of labeled data quickly. Human Computation Games were first introduced by Luis von Ahn in the ESP game (von Ahn and Dabbish, 2004) for image labeling, and later extended to segment objects (von Ahn et al., 2006b), collect common-sense knowledge (von Ahn et al., 2006a), or disambiguate words (Seemakurty et al., 2010). Recently, crowd games have also been introduced into the computer vision community for tasks like fine grained category recognition . These games can be released publicly on the web or used on Mechanical Turk to enhance and encourage turker participation . Inspired by the success of previous games, we create a game to collect and verify natural language expressions referring to objects in natural scenes.\n\n\nReferring Expression Game (ReferItGame)\n\nIn this section we describe our referring expression game (ReferItGame * ), a simple two player game where players alternate between generating expressions referring to objects in images of natural scenes, and clicking on the locations of described objects. An example game is shown in Figure 1. * Available online at http://referitgame.com\n\n\nGame Play\n\nPlayer 1: is shown an image with an object outlined in red and provided with a text box in which to write a referring expression. Player 2: is shown the same image and the referring expression written by Player 1 and must click on the location of the described object (note, Player 2 does not see the object segmentation). If Player 2 clicks on the correct object, then both players receive game points and the Player 1 and Player 2 roles swap for the next image. If Player 2 does not click on the correct object then no points are received and the players remain in their current roles. This provides us with referring expressions for our dataset and verification that the expressions are valid since they led to correct object localizations. Expressions written for games where the object was not correctly localized are kept and released with the dataset for future study, but are not included in our final dataset analyses or statistics. A game timer encourages players to write expressions quickly, resulting in more natural expressions. Also, IP addresses are filtered to prevent people from simultaneously playing both roles.\n\n\nPlaying Against the Computer\n\nTo promote engagement, we implement a single player version of the game. When a player connects, if there is another player online then the two people are paired. If there are currently no other available players, then the person plays a \"canned\" game against the computer. If at any point another person connects, the canned game ends and the player is paired with the new person.\n\nTo implement canned games we seed the game with 5000 pre-recorded referring expression games (5 referring expressions and resulting clicks for each of 1000 objects) collected using Amazon's Mechanical Turk service. Implementing an automated version of Player 1 is simple; we just show the person one of the pre-collected referring expressions and they click as usual.\n\nAutomating the role of Player 2 is a bit more complicated. In this case, we compare the person's written expression against the pre-recorded expressions for the same object. For this comparison we use a parser to lemmatize the words in an expression and then compute cosine similarity between expressions with a bag of words representation. Based on this measure the closest matching expression is determined. If there is no similarity between the newly generated expression and the canned expressions, the expression is deemed incorrect and a random click location (outside of the object) is generated. If there is a successful match with a previously generated expression, then the canned click from the most similar pre-recorded game is used. More complex similarities could be used, but since we require real-time performance in our game setting we use this simple implementation which works well for our expressions.\n\n\nReferItGame Dataset\n\nIn this section we describe the ReferItGame dataset † , including images and labels, processing the dataset, and analysis of the collection.\n\n\nImages and Labels\n\nWe build our dataset of referring expressions on top of the ImageCLEF IAPR image retrieval dataset (Grubinger et al., 2006). This dataset is a collection of 20,000 images available free of charge without copyright restrictions, depicting a variety of aspects of everyday life, from sports, to animals, to cities, and landscapes. Crucial for our purposes, the SAIAPR TC-12 expansion (Escalante et al., 2010) includes segmentations of each image into regions indicating the locations of constituent objects. 238 different object categories are labeled, including animals, people, buildings, objects, and background elements like grass or sky. This provides us with information regarding object category, object location, and object size, as well as the location and categories of other objects present in the same image. † Available at http://tamaraberg.com/referitgame\n\n\nCollecting the Dataset\n\nFrom the ImageCLEF dataset, we created a total of over 100k distinct games (one per object labeled in the dataset). For the games we imposed an ordering to allow for collecting the most interesting expressions first. Initially we prioritized games for objects in images with multiple objects of the same category. Once these games were completed, we prioritized ordering based on object category to include a comprehensive range of objects. Finally, after successfully collecting referring expressions from the prioritized games, we posted games for the remaining objects. In order to evaluate consistency of expression generation across people, we also include a probability of repeating previously played games during collection.\n\nTo date, we have collected 130,525 successfully completed games. This includes 10,431 canned games (a person playing against the computer, not including the initial seed set) and 120,094 real games (two people playing). 96,654 distinct objects from 19,984 photographs are represented in the dataset. This covers almost all of the objects present in the IAPR corpus. The remaining objects from the collection were either too small or too ambiguous to result in successful games.\n\nFor data collection, we posted the game online for anyone on the web to play and encouraged participation through social media and the survey section of reddit. In this manner we collected over 4 thousand referring expressions over a period of 3 weeks. To speed up data collection, we also posted the game on Mechanical Turk. Turkers were paid upon completion of 10 correct games (games where Player 2 clicks on the correct object of interest). Turkers were pre-screened to have approval ratings above 80% and to be located in the US for language consistency.\n\n\nProcessing the Dataset\n\nBecause of the size of the dataset, hand annotation of all referring expressions is prohibitive. Therefore, similar to past work (FitzGerald et al., 2013), we design an automatic method to pre-process the expressions and extract object and attribute mentions. These automatically processed expressions are used only for analysis and model training. We also fully hand label portions of the dataset for evaluation ( §5.2).\n\nBy examining the expressions in the collected dataset, we define a set of attributes with broad S ::= subject word color word ::= rel(S, color word) color word =color word | prep in(S, color word) color word =color word size word ::= rel(S, size word) size word =size word abs loc word ::= rel(S, abs loc word) abs loc word =abs loc word | prep on(S, orientation word) ∧ ¬prep of (S, ) abs loc word =on+orientation word rel loc word ::= RL RL ::= prep rel loc word(S, object word) RL=rel loc word | prep on(S, orientation word) ∧ prep of (S, object word) RL=on orientation word | prep to(S, orientation word) ∧ prep of (S, object word) RL=to orientation word | prep at(S, orientation word) ∧ prep of (S, object word) RL=at orientation word generic word ::= amod(S, generic word) coverage of the attribute types used in the referring expressions. We define the set of attributes for a referring expression as a 7-tuple R = {r 1 , r 2 , r 3 , r 4 , r 5 , r 6 , r 7 }:\n\n• r 1 is an entry-level category attribute,\n\n• r 2 is a color attribute,\n\n• r 3 is a size attribute, • r 4 is an absolute location attribute, • r 5 is a relative location relation attribute, • r 6 is a relative location object attribute, • r 7 is a generic attribute, Color and size attributes refer to the object color (e.g. \"blue\") and object size (e.g. \"tiny\") respectively. Absolute location refers to the location of the object in the image (e.g. \"top of the image\"). Relative location relation and relative location object attributes allow for referring expressions that localize the object with respect to another object in the picture (e.g. \"the car to the left of the tree\"). Generic attributes cover all less frequently observed attribute types (e.g. \"wooden\" or \"round\").\n\nThe entry-level category attribute is related to the concept of entry-level categories first proposed by Psychologists in the 1970s (Rosch, 1978) and recently explored in visual recognition (Ordonez et al., 2013). The idea of entry-level categories is that an object can belong to many different categories; an indigo bunting is an oscine, a bird, a vertebrate, a chordate, and so on. But, a person looking at a picture of one would probably call it a bird (unless they are very familiar with ornithology). Therefore, we include this attribute to capture how people name object categories in referring expressions.\n\nParsing the referring expressions: We parse the expressions using the most recent version of the StanfordCoreNLP parser (Socher et al., 2013). We begin by traversing the parse tree in a breadth-first manner and selecting the head noun of the sentence to determine the object of the referring expression, denoted as subject word. We pre-define a dictionary of attribute-values (color word, size word, abs location word, rel location word) for each of the attributes based on the observed data using a combination of POS-tagging and manual labeling.\n\nWe then apply a template-based approach on the collapsed dependency relations to recover the set of attributes (the main template rules are shown in Figure 2). The relationship rel indicates any linguistic binary relationship between the subject word S and another word, including the amod relationship. Orientation word captures the words like left, right, top and bottom. For generic word we consider any modifier words other than those captured by our other attributes (color, size, location).\n\nUsing this template-based parser we can for instance parse the following expression: \"Red flower on top of pedestal\". The first rule would match the prep(S, color word) relation, effectively recovering the attribute color word as \"red\". The second rule would match the prep on(S, orientation word) ∧ prep of (S, object word) relations, recovering rel loc word as \"on top of \" and object word as \"pedestal\".\n\nThe accuracy of our parser based processing is 91%. This was evaluated on 4,500 expressions   Figure 3: Analyses of the ReferItGame Dataset. Plot A shows frequency and attribute occurrence for common object categories. Plot B shows objects frequently used as reference points, ie \"to the left of the man\". Plot C shows frequencies of using 0, 1 or 2 attributes within the same expression. Plot D shows object locations vs location words used. Plot E shows normalized object size vs size words used (bars show 1 st through 3 rd quartiles). Plot F shows the frequency of usage of each attribute type for images containing either a single instance of the object category or multiple instances of the category.  Figure 4: Left: Tag clouds showing entry-Level category words used in referring expressions to name various object categories, with word size indicating frequency. For example, this indicates that \"streets\" are often called \"road\", sometimes \"ground\", sometimes \"roadway\", etc. Right: example objects predicted to portray some of our color attribute values. Note sometimes our color predictor is quite accurate, and sometimes it makes mistakes (see the man in a red shirt predicted as \"yellow\"). that were manually parsed by a human annotator.\n\n\nDataset Analysis\n\nIn the resulting dataset, we have a range of coverage over objects. For 10,304 of the objects we have 2 or more referring expressions while for the rest of the objects we have collected only one expression. This creates a dataset that emphasizes breadth while also containing enough data to study speaker variation. Multiple attribute analyses are provided in Figure 3. We find that most expressions use 0, 1, or 2 attributes (in addition to the entry-level attribute object word), with very few expressions containing more than 2 attributes (frequencies are shown in Fig 3c). We also examine what types of attributes are used most frequently, according to object category in Fig 3a, and when associated with single or multiple occurrences of the same object category in an image in Fig 3f. The frequency of attribute usage in images containing multiple objects of the same type increases for all types, compared to single object occurrences. Perhaps more interestingly, the use of different attributes is highly category dependent. People use more attribute words overall to describe some categories, like \"man\", \"woman\", or \"plant\", and the distribution of attribute types also varies by category. For example, color attributes are used more frequently for categories like \"car\" or \"woman\" than for categories like \"sky\" or \"rock\".\n\nWe also examine which objects are most frequently used as points of reference, e.g.,\"the chair next to the man\" in Fig 3b. We observe that people and some background categories like \"tree\" or \"wall\" are often used to help localize objects in Finally, we study entry-level category attributevalues to understand how people name objects in referring expressions. Tag clouds indicating the frequencies of words used to name various object categories are provided in Fig 4 (left). Objects like \"street\" are usually referred to as \"road\", but sometimes they are called \"ground\", \"roadway\", etc. \"Bottles\" are usually called \"bottle\", but sometimes referred to as \"coke\" or \"beer\". Interestingly, \"man\" is usually called \"man\" while \"woman\" is most often called \"person\" in the referring expressions.\n\n\nGenerating Referring Expressions\n\nIn this section we describe our proposed generation model and provide experimental evaluations on three test sets.\n\n\nGeneration Model\n\nGiven an input tuple I = {P, S}, where P is a target object and S is a scene (image containing multiple objects), our goal is to generate an output referring expression, R. For instance, the representation R for the referring expression: The big old white cabin beside the tree would be R = {cabin, white, big, ∅, beside, tree, old}.\n\nTo generate referring expressions we construct vocabularies V r i with candidate values for each attribute r i ∈ R, where attribute vocabulary V r i contains the set of words observed in our parsed referring expressions for attribute r i plus an additional  ε value indicating that the attribute should be ommited from the referring expression entirely. In this way, our framework can jointly determine which attributes to include in the expression (e.g.,\"size\" and \"color\") and what attribute values to generate (e.g.,\"small\" and \"blue\") from the list of all possible values. We enforce a constraint to always include an \"entry-level category\" attribute (e.g. \"boy\") so that we always generate a word referring to the object.\n\nWe pose our problem as an optimization where we map a tuple {P, S} to a referring expression R * as:\nR * = argmax R E(R, P, S) s. t. f i (R) ≤ b i(1)\nWhere the objective function E is decomposed as:\nE(R, P, S) = α 6 i=2 φ i (r i , P, S) + β 7 i=1 ψ i (r i , type(P )) + i>j ψ i,j (r i , r j )(2)\nWhere φ i is the compatibility function between an attribute-value for r i and the properties of the observed scene S and object P (described in §5.1.1).\n\nThe terms ψ i and ψ i,j are unary and pairwise priors computed based on observed co-occurrence statistics of attribute-values for r i with categories (where type(P ) denotes the type or category of an object) and between pairs of attribute-values (described in §5.1.2). Attributes r 1 and r 7 are modeled only in the priors since we do not have visual models for these attributes. The constraints f i (R) ≤ b i are restricted to be linear constraints and are used to impose hard constraints on the solution. The first such constraint is used to control the verbosity (length) of the generated referring expression using a constraint function that imposes a minimum attribute length requirement by restricting the number of entries r i that can take value ε in the solution.\ni 1[r i = ε] ≤ 7 − γ(P, S)(3)\nWhere 1[.] is the indicator function and γ(P, S) is a term that allows us to change the length requirement based on the object and scene (so that images with a larger number of objects of the same type have a larger length requirement). Finally we add hard constraints such that r 5 = ε ⇐⇒ r 6 = ε, so that relative location and relative object attributes are produced together.\n\n\nContent-based potentials\n\nPotentials φ i are defined for attributes r 2 to r 6 . Attribute r 7 represents a variety of different attributes, e.g. material or shape attributes, but we lack sufficient data to train visual models for these infrequent attribute terms. Therefore, we model these attributes using only prior statisticsbased potentials ( §5.1.2). Visual recognition models for recognizing entry-level object categories could also be incorporated for modeling r 1 , but we leave this as future work.\n\nColor attribute: φ 2 (r 2 = c k , P, S) = sim(hist c k , hist(P ))\n\nWhere hist(P ) is the HSV color histogram of the object P . We compute similarity sim using cosine similarity, and hist c k is the mean histogram of all objects in our training data that were referred to with color attribute-value c k ∈ V r 2 .\n\nSize attribute:\nφ 3 (r 3 = s k , P, S) = 1 σ s k √ 2π e −(size(P )−µs k ) 2 2σ 2 s k\nWhere size(P ) is the size of object P normalized by image size. We model the probabilities of each size word s k ∈ V r 3 as a Gaussian learned on our training set.\n\nAbsolute-location attribute:\nφ 4 (r 4 = a k , P, S) = 1 (2π) n |Σ a k | e − 1 2 (loc(P )−µa k ) T Σa k −1 (loc(P )−µa k )\nWhere loc(P ) are the 2-dimensional coordinates of the object P normalized to be ∈ [0 − 1]. Parameters µ a k and Σ a k are estimated from training data for each absolute location word a k ∈ V r 4 .\n\nRelative-location and Relative object:\nφ 5 (r 5 = l k , P, S) = 1[l k = ε] · g(count(type(P ), S))\nIf there are a larger number of objects of the same type in the image we find that the probability of using a relative-location-object increases (e.g., \"the car to the right of the man\"). For images where P was the only object of that category type, the probability of using a relative-location-object is 0.12. This increases to 0.22 when there were two objects of the same type and further increases to 0.26 for additional objects of the same type. Therefore, we model the probability of selecting relative location value l k ∈ V r 5 as a function g, where count(type(P ), S) counts the number of objects in the scene S of the same category type as the object P . φ 6 (r 6 = o k , P, S) =\n\n\n1[o k ∈ objectsnear(location(P ), S)]\n\nThe above expression filters out potential relative objects o k ∈ V r 6 that are not located in sufficient proximity to object P or are not present in the image at all.\n\n\nPrior statistics-based potentials\n\nPrior statistics-based potentials are modeled for all of the attributes r 1 -r 7 . Note that these potentials do not depend on specific attribute-values but only on the given object category type(P ).\n\nUnary prior potentials ψ i are defined as:\nψ i (r i , type(P )) = |D| j=1 1[(r (j) i = ) ∧ (type(P (j) ) = type(P ))] |D| j=1 1[type(P (j) ) = type(P )] + |D| j=1 1[r (j) i = ] |D| + λ\nWhere D = {P (j) , S (j) , R (j) } is our training dataset and λ is a small additive smoothing term. The two terms in the above expression represent category-specific counts and global counts of the number of times a given attribute r i was output in a referring expression in training data. Pairwise prior potentials ψ i,j are defined as:\ni<j ψ i,j (r i , r j ) = i<j ψ (1) i,j (r i , r j ) + ψ(2)\n5,6 (r 5 , r 6 ) For instance how frequently people use both color and size attributes to refer to an object. The pairwise potential ψ\nψ (1) i,j (r i , r j ) = 1 if r i = r j = ε C + λ o.w. ψ (2) 5,6 (r 5 = a, r 6 = b) = |D| t=1 1[(r (t) 5 = a) ∧ (r (t) 6 = b)] |D| where C = |D| t=1 1[(r (t) i = ) ∧ (r (t) j = )] |D| .\n(2)\n\ni,j produces a cohesion score between relative-location words and relative-object words based on global dataset statistics.\n\n\nExperiments\n\nWe implement the proposed model using commercial binary integer linear programming software (IBM ILOG CPLEX). This requires introducing a set of indicator variables for each of our multivalued attributes and another set of indicator variables to model pairwise interactions between our variables, as well as incorporating additional consistency constraints between variables. Model parameters (α and β) are tuned on data randomly sampled from the training set. Test Sets: We evaluate our model on three test sets, each containing 500 objects. For each object in the test sets we collect 3 referring expressions using the ReferItGame and manually label the attributes mentioned in each expression. We find human agreement to be 72.31% on our dataset (where we measure agreement as mean matching accuracy of attribute values for pairs of users across images in our test sets). The three test sets are created to evaluate different aspects of our data.\n\nTest Set A contains objects sampled randomly from the entire dataset. This test set is meant to closely resemble the full dataset distribution. The goal of the other two test sets is to sample expressions for \"interesting\" objects. We first identify categories that are mainly related to background content elements, e.g. \"sky, ground, floor, sand, sidewalk, etc\". We consider these categories to be potentially less interesting for study than categories like people, animals, cars, etc. Test Set B contains objects sampled from the most frequently occurring object categories in the dataset, selected to contain a balanced number of objects from each category, excluding the less interesting categories. Test Set C contains objects sampled from images that contain at least 2 objects of the same category, excluding the less interesting categories.\n\n\nResults\n\n: Qualitative examples are shown in Fig 5  comparing our results to the human produced expressions. For some images (left) we do quite well at predicting the correct attributes and values. For others we do less well (right). We also show example objects predicted for some color words in Fig 4  (right). We see that our model can fail in several ways, such as generating the wrong attribute-value due to inaccurate predictions by visual models or selecting incorrect attributes to include in the generated expression.\n\nQuantitative results: precision and recall measures for the 3 test sets are reported in Table 1, including evaluation of a baseline version of our model which incorporates only the prior potentials ( §5.1.2) without any content based estimates. We see that our model performs reasonably on both measures, and outperforms the baseline by a large margin on all test sets, with highest performance on the broadly sampled interesting category test set. Note that our problem is somewhat different than traditional REG where the input is often attribute-value pairs and the task is to select which pairs to include in the expression. Our goal is to jointly select which attributes to include and what values to predict from a list of all possible values for the attribute.\n\n\nConclusions & Future Work\n\nIn this paper we have introduced a new game to crowd-source referring expressions for objects in natural scenes. We have used this game to produce a new large-scale dataset with analysis. We have also proposed an optimization based model for REG and performed experimental evaluations. Future work includes developing fully automatic visual recognition methods for REG in real world scenes, and incorporating linguistically inspired models for entry-level category prediction.\n\nFigure 2 :\n2Templates for parsing attributes from referring expressions ( §4.3).\n\n\nreferring expressions. Additionally, we provide plots showing the relationship between object location in the image and use of absolute location words, Fig 3d, as well as size words vs object area, Fig 3e.\n\nFigure 5 :\n5Example results, including human generated expressions, baseline and full model generated expressions. For some images the model does well at mimicking human expressions (left). For others it does not generate the correct attributes (right).\n\n\nThe pairwise potential ψ (1) i,j captures the pairwise statistics of how frequently people use pairs of attribute types.Table 1: Baseline Model & Full Model performance on the three test sets (A,B,C).SOURCE PREC(%) RECALL(%) \nBaseline -A \n27.92 \n43.27 \nFull Model -A \n36.28 \n53.44 \nBaseline -B \n29.87 \n50.57 \nFull Model -B \n36.68 \n59.80 \nBaseline -C \n28.85 \n37.41 \nFull Model -C \n37.73 \n48.54 \n\n\nAcknowledgmentsThis work was funded by NSF Awards #1417991 and #1444234. M.M. was supported by the Stony Brook Simons Summer Research Program for High School students. We also thank Alex Berg for many helpful discussions.\nGenerating image descriptions using dependency relational patterns. Ahmet Aker, Robert Gaizauskas, Association for Computational Linguistics (ACL). Ahmet Aker and Robert Gaizauskas. 2010. Generating image descriptions using dependency relational pat- terns. In Association for Computational Linguistics (ACL).\n\nVideo in sentences out. Andrei Barbu, Alexander Bridge, Zachary Burchill, Dan Coroian, Sven J Dickinson, Sanja Fidler, Aaron Michaux, Sam Mussman, Siddharth Narayanaswamy, Dhaval Salvi, Lara Schmidt, Jiangnan Shangguan, Jeffrey Mark Siskind, Jarrell W Waggoner, Song Wang, Jinlian Wei, Yifan Yin, Zhiqi Zhang, Uncertainty in Artificial Intelligence (UAI). Andrei Barbu, Alexander Bridge, Zachary Burchill, Dan Coroian, Sven J. Dickinson, Sanja Fi- dler, Aaron Michaux, Sam Mussman, Siddharth Narayanaswamy, Dhaval Salvi, Lara Schmidt, Jiangnan Shangguan, Jeffrey Mark Siskind, Jar- rell W. Waggoner, Song Wang, Jinlian Wei, Yifan Yin, and Zhiqi Zhang. 2012. Video in sentences out. In Uncertainty in Artificial Intelligence (UAI).\n\nComputational interpretations of the gricean maxims in the generation of referring expressions. Robert Dale, Ehud Reiter, Cognitive Science (CogSci). 19233264Robert Dale and Ehud Reiter. 1995. Computational interpretations of the gricean maxims in the gener- ation of referring expressions. Cognitive Science (CogSci), 19:233264.\n\nBuilding natural language generation systems. Robert Dale, Ehud Reiter, Cambridge University Press. Robert Dale and Ehud Reiter. 2000. Building natural language generation systems. In Cambridge Univer- sity Press.\n\nWhat does classifying more than 10,000 image categories tell us. Jia Deng, Alexander C Berg, Kai Li, Fei-Fei Li, European Conference on Computer Vision (ECCV). Jia Deng, Alexander C. Berg, Kai Li, and Fei-Fei Li. 2010. What does classifying more than 10,000 im- age categories tell us? In European Conference on Computer Vision (ECCV).\n\nLarge scale visual recognition challenge. Jia Deng, Alex Berg, Sanjeev Satheesh, Hao Su, Aditya Khosla, Fei-Fei Li, Jia Deng, Alex Berg, Sanjeev Satheesh, Hao Su, Aditya Khosla, and Fei-Fei Li. 2012. Large scale vi- sual recognition challenge. In http://www.image- net.org/challenges/LSVRC/2012/index.\n\nFinegrained crowdsourcing for fine-grained recognition. Jia Deng, Jonathan Krause, Li Fei-Fei, IEEE Conference on Computer Vision and Pattern Recognition (CVPR). Jia Deng, Jonathan Krause, and Li Fei-Fei. 2013. Fine- grained crowdsourcing for fine-grained recognition. In IEEE Conference on Computer Vision and Pattern Recognition (CVPR).\n\nThe segmented and annotated iapr tc-12 benchmark. Carlos A Hugo Jair Escalante, Jesus A Hernandez, A Gonzalez, Manuel Lopez-Lopez, Eduardo F Montes, L Enrique Morales, Luis Sucar, Michael Villasenor, Grubinger, Computer Vision and Image Understanding. CVIUHugo Jair Escalante, Carlos A. Hernandez, Jesus A. Gonzalez, A. Lopez-Lopez, Manuel Montes, Ed- uardo F. Morales, L. Enrique Sucar, Luis Villasenor, and Michael Grubinger. 2010. The segmented and annotated iapr tc-12 benchmark. Computer Vision and Image Understanding (CVIU).\n\nTowards situated dialogue: Revisiting referring expression generation. Rui Fang, Changsong Liu, Lanbo She, Joyce Chai, Empirical Methods on Natural Language Processing (EMNLP). Rui Fang, Changsong Liu, Lanbo She, and Joyce Chai. 2013. Towards situated dialogue: Revisiting refer- ring expression generation. In Empirical Methods on Natural Language Processing (EMNLP).\n\nEvery picture tells a story: generating sentences for images. Ali Farhadi, Mohsen Hejrati, Mohammad Amin Sadeghi, Peter Young, Cyrus Rashtchian, Julia Hockenmaier, David Forsyth, European Conference on Computer Vision (ECCV). Ali Farhadi, Mohsen Hejrati, Mohammad Amin Sadeghi, Peter Young, Cyrus Rashtchian, Julia Hockenmaier, and David Forsyth. 2010. Every picture tells a story: generating sentences for im- ages. In European Conference on Computer Vision (ECCV).\n\nHow many words is a picture worth? automatic caption generation for news images. Yansong Feng, Mirella Lapata, Association for Computational Linguistics (ACL). Yansong Feng and Mirella Lapata. 2010. How many words is a picture worth? automatic caption genera- tion for news images. In Association for Computa- tional Linguistics (ACL).\n\nAutomatic caption generation for news images. Yansong Feng, Mirella Lapata, IEEE Transactions on Pattern Analysis and Machine Intelligence. 354Yansong Feng and Mirella Lapata. 2013. Automatic caption generation for news images. IEEE Transac- tions on Pattern Analysis and Machine Intelligence, 35(4):797-812.\n\nLearning distributions over logical forms for referring expression generation. Nicholas Fitzgerald, Yoav Artzi, Luke Zettlemoyer, Empirical Methods on Natural Language Processing (EMNLP). Nicholas FitzGerald, Yoav Artzi, and Luke Zettle- moyer. 2013. Learning distributions over logical forms for referring expression generation. In Em- pirical Methods on Natural Language Processing (EMNLP).\n\nLogic and conversation. H , Paul Grice, 4158H. Paul Grice. 1975. Logic and conversation. page 4158.\n\nThe iapr benchmark: A new evaluation resource for visual information systems. Michael Grubinger, Paul D Clough, Henning Muller, Thomas Deselaers, Proceedings of the International Workshop OntoImage (LREC). the International Workshop OntoImage (LREC)Michael Grubinger, Paul D. Clough, Henning Muller, and Thomas Deselaers. 2006. The iapr benchmark: A new evaluation resource for visual information systems. In Proceedings of the International Work- shop OntoImage (LREC).\n\nYoutube2text: Recognizing and describing arbitrary activities using semantic hierarchies and zero-shot recognition. Sergio Guadarrama, Niveda Krishnamoorthy, Girish Malkarnenkar, Subhashini Venugopalan, Raymond Mooney, Trevor Darrell, Kate Saenko, International Conference on Computer Vision (ICCV). Sergio Guadarrama, Niveda Krishnamoorthy, Girish Malkarnenkar, Subhashini Venugopalan, Raymond Mooney, Trevor Darrell, and Kate Saenko. 2013. Youtube2text: Recognizing and describing arbitrary activities using semantic hierarchies and zero-shot recognition. In International Conference on Com- puter Vision (ICCV).\n\nComputational generation of referring expressions: A survey. Emiel Krahmer, Kees Van Deemter, Computational Linguistics. 38173218Emiel Krahmer and Kees van Deemter. 2012. Compu- tational generation of referring expressions: A sur- vey. In Computational Linguistics, volume 38, page 173218.\n\nImagenet classification with deep convolutional neural networks. Alex Krizhevsky, Ilya Sutskever, Geoffrey Hinton, Neural Information Processing Systems (NIPS). Alex Krizhevsky, Ilya Sutskever, and Geoffrey Hinton. 2012. Imagenet classification with deep convolu- tional neural networks. In Neural Information Pro- cessing Systems (NIPS).\n\nBabytalk: Understanding and generating simple image descriptions. Girish Kulkarni, Visruth Premraj, Sagnik Dhar, Siming Li, Yejin Choi, Alexander C Berg, Tamara L Berg, IEEE Computer Vision and Pattern Recognition (CVPR). Girish Kulkarni, Visruth Premraj, Sagnik Dhar, Sim- ing Li, Yejin Choi, Alexander C Berg, and Tamara L Berg. 2011. Babytalk: Understanding and generat- ing simple image descriptions. In IEEE Computer Vision and Pattern Recognition (CVPR).\n\nCollective generation of natural image descriptions. Polina Kuznetsova, Vicente Ordonez, Alex Berg, Tamara L Berg, Yejin Choi, Association for Computational Linguistics (ACL). Polina Kuznetsova, Vicente Ordonez, Alex Berg, Tamara L Berg, and Yejin Choi. 2012. Collective generation of natural image descriptions. In Associ- ation for Computational Linguistics (ACL).\n\nNatural reference to objects in a visual domain. Margaret Mitchell, Ehud Kees Van Deemter, Reiter, International Natural Language Generation Conference (INLG). Margaret Mitchell, Kees van Deemter, and Ehud Re- iter. 2010. Natural reference to objects in a visual domain. In International Natural Language Gener- ation Conference (INLG).\n\nTwo approaches for generating size modifiers. Margaret Mitchell, Ehud Kees Van Deemter, Reiter, European Workshop on Natural Language Generation. Margaret Mitchell, Kees van Deemter, and Ehud Reiter. 2011. Two approaches for generating size modifiers. In European Workshop on Natural Language Gener- ation.\n\nTypicality and object reference. Margaret Mitchell, Ehud Reiter, Kees Van Deemter, Cognitive Science (CogSci). Margaret Mitchell, Ehud Reiter, and Kees van Deemter. 2013a. Typicality and object reference. In Cognitive Science (CogSci).\n\nGenerating expressions that refer to visible objects. Margaret Mitchell, Ehud Kees Van Deemter, Reiter, North American Chapter of the Association for Computational Linguistics (NAACL). Margaret Mitchell, Kees van Deemter, and Ehud Reiter. 2013b. Generating expressions that refer to visible objects. In North American Chapter of the Associa- tion for Computational Linguistics (NAACL).\n\nIm2text: Describing images using 1 million captioned photographs. Vicente Ordonez, Girish Kulkarni, Tamara L Berg, Neural Information Processing Systems (NIPS). Vicente Ordonez, Girish Kulkarni, and Tamara L. Berg. 2011. Im2text: Describing images using 1 million captioned photographs. In Neural Information Pro- cessing Systems (NIPS).\n\nFrom large scale image categorization to entry-level categories. Vicente Ordonez, Jia Deng, Yejin Choi, Alexander C Berg, Tamara L Berg, International Conference on Computer Vision (ICCV). Vicente Ordonez, Jia Deng, Yejin Choi, Alexander C. Berg, and Tamara L. Berg. 2013. From large scale image categorization to entry-level categories. In In- ternational Conference on Computer Vision (ICCV).\n\nTowards good practice in large-scale learning for image classification. Florent Perronnin, Zeynep Akata, Zaid Harchaoui, Cordelia Schmid, Computer Vision and Pattern Recognition (CVPR). Florent Perronnin, Zeynep Akata, Zaid Harchaoui, and Cordelia Schmid. 2012. Towards good practice in large-scale learning for image classification. In Computer Vision and Pattern Recognition (CVPR).\n\nCharting the potential of description logic for the generation of referring expressions. Kees Yuan Ren, Jeff Z Van Deemter, Pan, International Natural Language Generation Conference (INLG). Yuan Ren, Kees Van Deemter, and Jeff Z Pan. 2010. Charting the potential of description logic for the generation of referring expressions. In International Natural Language Generation Conference (INLG).\n\nPrinciples of categorization. Cognition and Categorization. Eleanor Rosch, 2748Eleanor Rosch. 1978. Principles of categorization. Cognition and Categorization, page 2748.\n\nWord sense disambiguation via human computation. Nitin Seemakurty, Jonathan Chu, Anthony Luis Von Ahn, Tomasic, Human Computation Workshop. Nitin Seemakurty, Jonathan Chu, Luis von Ahn, and Anthony Tomasic. 2010. Word sense disambigua- tion via human computation. In Human Computa- tion Workshop.\n\nParsing With Compositional Vector Grammars. Richard Socher, John Bauer, Christopher D Manning, Andrew Y Ng, Association for Computational Linguistics (ACL). Richard Socher, John Bauer, Christopher D. Manning, and Andrew Y. Ng. 2013. Parsing With Composi- tional Vector Grammars. In Association for Compu- tational Linguistics (ACL).\n\nBuilding a semantically transparent corpus for the generation of referring expressions. Ielka Kees Van Deemter, Albert Van Der Sluis, Gatt, International Conference on Natural Language Generation (INLG). Kees van Deemter, Ielka van der Sluis, and Albert Gatt. 2006. Building a semantically transparent corpus for the generation of referring expressions. In In- ternational Conference on Natural Language Gen- eration (INLG).\n\nToward a computational psycholinguistics of reference production. Kees Van Deemter, Albert Gatt, Emiel Roger Pg Van Gompel, Krahmer, Topics in Cognitive Science. 4166183Kees Van Deemter, Albert Gatt, Roger PG van Gompel, and Emiel Krahmer. 2012. Toward a computational psycholinguistics of reference production. In Topics in Cognitive Science, volume 4(2), page 166183.\n\nThe use of spatial relations in referring expression generation. Jette Viethen, Robert Dale, International Natural Language Generation Conference (INLG). Jette Viethen and Robert Dale. 2008. The use of spa- tial relations in referring expression generation. In International Natural Language Generation Confer- ence (INLG).\n\nSpeakerdependent variation in content selection for referring expression generation. Jette Viethen, Robert Dale, Australasian Language Technology Workshop. Jette Viethen and Robert Dale. 2010. Speaker- dependent variation in content selection for referring expression generation. In Australasian Language Technology Workshop.\n\nGraphs and spatial relations in the generation of referring expressions. Jette Viethen, Margaret Mitchell, Emiel Krahmer, European Workshop on Natural Language Generation. Jette Viethen, Margaret Mitchell, and Emiel Krahmer. 2013. Graphs and spatial relations in the generation of referring expressions. In European Workshop on Natural Language Generation.\n\nLabeling images with a computer game. Laura Luis Von Ahn, Dabbish, ACM Conf. on Human Factors in Computing Systems (CHI). Luis von Ahn and Laura Dabbish. 2004. Labeling im- ages with a computer game. In ACM Conf. on Hu- man Factors in Computing Systems (CHI).\n\nVerbosity: A game for collecting common-sense knowledge. Mihir Luis Von Ahn, Manuel Kedia, Blum, ACM Conference on Human Factors in Computing Systems (CHI). Luis von Ahn, Mihir Kedia, and Manuel Blum. 2006a. Verbosity: A game for collecting common-sense knowledge. In ACM Conference on Human Factors in Computing Systems (CHI).\n\nPeekaboom: A game for locating objects in images. Ruoran Luis Von Ahn, Manuel Liu, Blum, ACM Conference on Human Factors in Computing Systems (CHI). Luis von Ahn, Ruoran Liu, and Manuel Blum. 2006b. Peekaboom: A game for locating objects in images. In ACM Conference on Human Factors in Comput- ing Systems (CHI).\n\nUnderstanding natural language. Terry Winograd, Cognitive Psychology. 311191Terry Winograd. 1972. Understanding natural lan- guage. Cognitive Psychology, 3(1):1191.\n\nCorpus-guided sentence generation of natural images. Yezhou Yang, Ching Lik Teo, Hal Daume, Iii , Yiannis Aloimonos, Empirical Methods on Natural Language Processing (EMNLP). Yezhou Yang, Ching Lik Teo, Hal Daume III, and Yian- nis Aloimonos. 2011. Corpus-guided sentence gen- eration of natural images. In Empirical Methods on Natural Language Processing (EMNLP).\n\nI2t: Image parsing to text description. Z Benjamin, Xiong Yao, Liang Yang, Mun Wai Lin, Song-Chun Lee, Zhu, Proc. IEEE. 898Benjamin Z. Yao, Xiong Yang, Liang Lin, Mun Wai Lee, and Song-Chun Zhu. 2010. I2t: Image parsing to text description. Proc. IEEE, 98(8).\n", "annotations": {"author": "[{\"end\":271,\"start\":187},{\"end\":374,\"start\":272},{\"end\":428,\"start\":375},{\"end\":528,\"start\":429}]", "publisher": "[{\"end\":109,\"start\":68},{\"end\":826,\"start\":785}]", "author_last_name": "[{\"end\":203,\"start\":193},{\"end\":287,\"start\":280},{\"end\":386,\"start\":380},{\"end\":442,\"start\":438}]", "author_first_name": "[{\"end\":192,\"start\":187},{\"end\":279,\"start\":272},{\"end\":379,\"start\":375},{\"end\":435,\"start\":429},{\"end\":437,\"start\":436}]", "author_affiliation": "[{\"end\":270,\"start\":205},{\"end\":373,\"start\":308},{\"end\":427,\"start\":388},{\"end\":527,\"start\":462}]", "title": "[{\"end\":67,\"start\":1},{\"end\":595,\"start\":529}]", "venue": "[{\"end\":691,\"start\":597}]", "abstract": "[{\"end\":1553,\"start\":852}]", "bib_ref": "[{\"attributes\":{\"ref_id\":\"b26\"},\"end\":2207,\"start\":2183},{\"attributes\":{\"ref_id\":\"b5\"},\"end\":2225,\"start\":2207},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":2243,\"start\":2225},{\"attributes\":{\"ref_id\":\"b17\"},\"end\":2267,\"start\":2243},{\"end\":2526,\"start\":2465},{\"attributes\":{\"ref_id\":\"b40\"},\"end\":2544,\"start\":2526},{\"attributes\":{\"ref_id\":\"b24\"},\"end\":2565,\"start\":2544},{\"attributes\":{\"ref_id\":\"b19\"},\"end\":2589,\"start\":2565},{\"attributes\":{\"ref_id\":\"b11\"},\"end\":2611,\"start\":2589},{\"attributes\":{\"ref_id\":\"b31\"},\"end\":3430,\"start\":3404},{\"attributes\":{\"ref_id\":\"b33\"},\"end\":3453,\"start\":3430},{\"attributes\":{\"ref_id\":\"b20\"},\"end\":3485,\"start\":3462},{\"attributes\":{\"ref_id\":\"b22\"},\"end\":3586,\"start\":3562},{\"attributes\":{\"ref_id\":\"b12\"},\"end\":3610,\"start\":3586},{\"attributes\":{\"ref_id\":\"b36\"},\"end\":4053,\"start\":4031},{\"end\":4091,\"start\":4058},{\"attributes\":{\"ref_id\":\"b28\"},\"end\":5332,\"start\":5319},{\"attributes\":{\"ref_id\":\"b39\"},\"end\":6863,\"start\":6847},{\"attributes\":{\"ref_id\":\"b2\"},\"end\":6937,\"start\":6914},{\"attributes\":{\"ref_id\":\"b3\"},\"end\":6959,\"start\":6937},{\"attributes\":{\"ref_id\":\"b13\"},\"end\":7064,\"start\":7051},{\"attributes\":{\"ref_id\":\"b22\"},\"end\":7309,\"start\":7285},{\"attributes\":{\"ref_id\":\"b34\"},\"end\":7372,\"start\":7348},{\"attributes\":{\"ref_id\":\"b35\"},\"end\":7393,\"start\":7372},{\"attributes\":{\"ref_id\":\"b23\"},\"end\":7416,\"start\":7393},{\"attributes\":{\"ref_id\":\"b21\"},\"end\":7474,\"start\":7451},{\"attributes\":{\"ref_id\":\"b27\"},\"end\":7539,\"start\":7521},{\"attributes\":{\"ref_id\":\"b12\"},\"end\":7563,\"start\":7539},{\"attributes\":{\"ref_id\":\"b8\"},\"end\":7625,\"start\":7606},{\"attributes\":{\"ref_id\":\"b31\"},\"end\":7921,\"start\":7895},{\"attributes\":{\"ref_id\":\"b33\"},\"end\":7944,\"start\":7921},{\"attributes\":{\"ref_id\":\"b20\"},\"end\":8093,\"start\":8070},{\"attributes\":{\"ref_id\":\"b22\"},\"end\":8190,\"start\":8166},{\"attributes\":{\"ref_id\":\"b0\"},\"end\":8615,\"start\":8588},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":8636,\"start\":8615},{\"attributes\":{\"ref_id\":\"b24\"},\"end\":8657,\"start\":8636},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":8679,\"start\":8657},{\"attributes\":{\"ref_id\":\"b11\"},\"end\":8701,\"start\":8679},{\"attributes\":{\"ref_id\":\"b40\"},\"end\":8803,\"start\":8785},{\"attributes\":{\"ref_id\":\"b41\"},\"end\":8820,\"start\":8803},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":9476,\"start\":9451},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":9495,\"start\":9476},{\"attributes\":{\"ref_id\":\"b38\"},\"end\":9968,\"start\":9945},{\"attributes\":{\"ref_id\":\"b37\"},\"end\":10024,\"start\":10001},{\"attributes\":{\"ref_id\":\"b29\"},\"end\":10073,\"start\":10048},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":14027,\"start\":14003},{\"attributes\":{\"ref_id\":\"b28\"},\"end\":18915,\"start\":18902},{\"attributes\":{\"ref_id\":\"b25\"},\"end\":18982,\"start\":18960},{\"attributes\":{\"ref_id\":\"b30\"},\"end\":19527,\"start\":19506}]", "figure": "[{\"attributes\":{\"id\":\"fig_0\"},\"end\":34482,\"start\":34401},{\"attributes\":{\"id\":\"fig_2\"},\"end\":34690,\"start\":34483},{\"attributes\":{\"id\":\"fig_3\"},\"end\":34945,\"start\":34691},{\"attributes\":{\"id\":\"tab_3\",\"type\":\"table\"},\"end\":35343,\"start\":34946}]", "paragraph": "[{\"end\":2032,\"start\":1569},{\"end\":3611,\"start\":2034},{\"end\":4290,\"start\":3613},{\"end\":5333,\"start\":4292},{\"end\":5739,\"start\":5335},{\"end\":5788,\"start\":5741},{\"end\":5878,\"start\":5790},{\"end\":6005,\"start\":5880},{\"end\":6117,\"start\":6007},{\"end\":6272,\"start\":6119},{\"end\":6670,\"start\":6274},{\"end\":7133,\"start\":6687},{\"end\":9328,\"start\":7135},{\"end\":9673,\"start\":9330},{\"end\":10482,\"start\":9675},{\"end\":10866,\"start\":10526},{\"end\":12012,\"start\":10880},{\"end\":12426,\"start\":12045},{\"end\":12795,\"start\":12428},{\"end\":13718,\"start\":12797},{\"end\":13882,\"start\":13742},{\"end\":14771,\"start\":13904},{\"end\":15529,\"start\":14798},{\"end\":16008,\"start\":15531},{\"end\":16569,\"start\":16010},{\"end\":17017,\"start\":16596},{\"end\":17984,\"start\":17019},{\"end\":18029,\"start\":17986},{\"end\":18058,\"start\":18031},{\"end\":18768,\"start\":18060},{\"end\":19384,\"start\":18770},{\"end\":19933,\"start\":19386},{\"end\":20431,\"start\":19935},{\"end\":20839,\"start\":20433},{\"end\":22092,\"start\":20841},{\"end\":23446,\"start\":22113},{\"end\":24242,\"start\":23448},{\"end\":24393,\"start\":24279},{\"end\":24747,\"start\":24414},{\"end\":25475,\"start\":24749},{\"end\":25577,\"start\":25477},{\"end\":25675,\"start\":25627},{\"end\":25926,\"start\":25773},{\"end\":26701,\"start\":25928},{\"end\":27110,\"start\":26732},{\"end\":27621,\"start\":27139},{\"end\":27689,\"start\":27623},{\"end\":27935,\"start\":27691},{\"end\":27952,\"start\":27937},{\"end\":28186,\"start\":28022},{\"end\":28216,\"start\":28188},{\"end\":28507,\"start\":28310},{\"end\":28547,\"start\":28509},{\"end\":29297,\"start\":28608},{\"end\":29507,\"start\":29339},{\"end\":29745,\"start\":29545},{\"end\":29789,\"start\":29747},{\"end\":30271,\"start\":29932},{\"end\":30465,\"start\":30331},{\"end\":30655,\"start\":30652},{\"end\":30780,\"start\":30657},{\"end\":31745,\"start\":30796},{\"end\":32596,\"start\":31747},{\"end\":33125,\"start\":32608},{\"end\":33894,\"start\":33127},{\"end\":34400,\"start\":33924}]", "formula": "[{\"attributes\":{\"id\":\"formula_0\"},\"end\":25626,\"start\":25578},{\"attributes\":{\"id\":\"formula_1\"},\"end\":25772,\"start\":25676},{\"attributes\":{\"id\":\"formula_2\"},\"end\":26731,\"start\":26702},{\"attributes\":{\"id\":\"formula_3\"},\"end\":28021,\"start\":27953},{\"attributes\":{\"id\":\"formula_4\"},\"end\":28309,\"start\":28217},{\"attributes\":{\"id\":\"formula_5\"},\"end\":28607,\"start\":28548},{\"attributes\":{\"id\":\"formula_6\"},\"end\":29931,\"start\":29790},{\"attributes\":{\"id\":\"formula_7\"},\"end\":30330,\"start\":30272},{\"attributes\":{\"id\":\"formula_8\"},\"end\":30651,\"start\":30466}]", "table_ref": "[{\"end\":33222,\"start\":33215}]", "section_header": "[{\"attributes\":{\"n\":\"1\"},\"end\":1567,\"start\":1555},{\"attributes\":{\"n\":\"2\"},\"end\":6685,\"start\":6673},{\"attributes\":{\"n\":\"3\"},\"end\":10524,\"start\":10485},{\"attributes\":{\"n\":\"3.1\"},\"end\":10878,\"start\":10869},{\"attributes\":{\"n\":\"3.2\"},\"end\":12043,\"start\":12015},{\"attributes\":{\"n\":\"4\"},\"end\":13740,\"start\":13721},{\"attributes\":{\"n\":\"4.1\"},\"end\":13902,\"start\":13885},{\"attributes\":{\"n\":\"4.2\"},\"end\":14796,\"start\":14774},{\"attributes\":{\"n\":\"4.3\"},\"end\":16594,\"start\":16572},{\"attributes\":{\"n\":\"4.4\"},\"end\":22111,\"start\":22095},{\"attributes\":{\"n\":\"5\"},\"end\":24277,\"start\":24245},{\"attributes\":{\"n\":\"5.1\"},\"end\":24412,\"start\":24396},{\"attributes\":{\"n\":\"5.1.1\"},\"end\":27137,\"start\":27113},{\"end\":29337,\"start\":29300},{\"attributes\":{\"n\":\"5.1.2\"},\"end\":29543,\"start\":29510},{\"attributes\":{\"n\":\"5.2\"},\"end\":30794,\"start\":30783},{\"end\":32606,\"start\":32599},{\"attributes\":{\"n\":\"6\"},\"end\":33922,\"start\":33897},{\"end\":34412,\"start\":34402},{\"end\":34702,\"start\":34692}]", "table": "[{\"end\":35343,\"start\":35148}]", "figure_caption": "[{\"end\":34482,\"start\":34414},{\"end\":34690,\"start\":34485},{\"end\":34945,\"start\":34704},{\"end\":35148,\"start\":34948}]", "figure_ref": "[{\"attributes\":{\"ref_id\":\"fig_3\"},\"end\":3841,\"start\":3833},{\"end\":8949,\"start\":8941},{\"end\":10820,\"start\":10812},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":20092,\"start\":20084},{\"end\":20943,\"start\":20935},{\"end\":21557,\"start\":21549},{\"end\":22481,\"start\":22473},{\"end\":22688,\"start\":22681},{\"end\":22796,\"start\":22789},{\"end\":22903,\"start\":22896},{\"end\":23570,\"start\":23563},{\"end\":23923,\"start\":23911},{\"attributes\":{\"ref_id\":\"fig_3\"},\"end\":32660,\"start\":32644},{\"end\":32910,\"start\":32896}]", "bib_author_first_name": "[{\"end\":35639,\"start\":35634},{\"end\":35652,\"start\":35646},{\"end\":35907,\"start\":35901},{\"end\":35924,\"start\":35915},{\"end\":35940,\"start\":35933},{\"end\":35954,\"start\":35951},{\"end\":35968,\"start\":35964},{\"end\":35970,\"start\":35969},{\"end\":35987,\"start\":35982},{\"end\":36001,\"start\":35996},{\"end\":36014,\"start\":36011},{\"end\":36033,\"start\":36024},{\"end\":36055,\"start\":36049},{\"end\":36067,\"start\":36063},{\"end\":36085,\"start\":36077},{\"end\":36104,\"start\":36097},{\"end\":36109,\"start\":36105},{\"end\":36126,\"start\":36119},{\"end\":36128,\"start\":36127},{\"end\":36143,\"start\":36139},{\"end\":36157,\"start\":36150},{\"end\":36168,\"start\":36163},{\"end\":36179,\"start\":36174},{\"end\":36711,\"start\":36705},{\"end\":36722,\"start\":36718},{\"end\":36992,\"start\":36986},{\"end\":37003,\"start\":36999},{\"end\":37223,\"start\":37220},{\"end\":37239,\"start\":37230},{\"end\":37241,\"start\":37240},{\"end\":37251,\"start\":37248},{\"end\":37263,\"start\":37256},{\"end\":37537,\"start\":37534},{\"end\":37548,\"start\":37544},{\"end\":37562,\"start\":37555},{\"end\":37576,\"start\":37573},{\"end\":37587,\"start\":37581},{\"end\":37603,\"start\":37596},{\"end\":37854,\"start\":37851},{\"end\":37869,\"start\":37861},{\"end\":37880,\"start\":37878},{\"end\":38191,\"start\":38185},{\"end\":38193,\"start\":38192},{\"end\":38220,\"start\":38215},{\"end\":38222,\"start\":38221},{\"end\":38235,\"start\":38234},{\"end\":38252,\"start\":38246},{\"end\":38273,\"start\":38266},{\"end\":38275,\"start\":38274},{\"end\":38285,\"start\":38284},{\"end\":38293,\"start\":38286},{\"end\":38307,\"start\":38303},{\"end\":38322,\"start\":38315},{\"end\":38742,\"start\":38739},{\"end\":38758,\"start\":38749},{\"end\":38769,\"start\":38764},{\"end\":38780,\"start\":38775},{\"end\":39103,\"start\":39100},{\"end\":39119,\"start\":39113},{\"end\":39137,\"start\":39129},{\"end\":39142,\"start\":39138},{\"end\":39157,\"start\":39152},{\"end\":39170,\"start\":39165},{\"end\":39188,\"start\":39183},{\"end\":39207,\"start\":39202},{\"end\":39594,\"start\":39587},{\"end\":39608,\"start\":39601},{\"end\":39896,\"start\":39889},{\"end\":39910,\"start\":39903},{\"end\":40240,\"start\":40232},{\"end\":40257,\"start\":40253},{\"end\":40269,\"start\":40265},{\"end\":40572,\"start\":40571},{\"end\":40579,\"start\":40575},{\"end\":40733,\"start\":40726},{\"end\":40749,\"start\":40745},{\"end\":40751,\"start\":40750},{\"end\":40767,\"start\":40760},{\"end\":40782,\"start\":40776},{\"end\":41242,\"start\":41236},{\"end\":41261,\"start\":41255},{\"end\":41284,\"start\":41278},{\"end\":41309,\"start\":41299},{\"end\":41330,\"start\":41323},{\"end\":41345,\"start\":41339},{\"end\":41359,\"start\":41355},{\"end\":41802,\"start\":41797},{\"end\":42096,\"start\":42092},{\"end\":42113,\"start\":42109},{\"end\":42133,\"start\":42125},{\"end\":42439,\"start\":42433},{\"end\":42457,\"start\":42450},{\"end\":42473,\"start\":42467},{\"end\":42486,\"start\":42480},{\"end\":42496,\"start\":42491},{\"end\":42512,\"start\":42503},{\"end\":42514,\"start\":42513},{\"end\":42527,\"start\":42521},{\"end\":42529,\"start\":42528},{\"end\":42888,\"start\":42882},{\"end\":42908,\"start\":42901},{\"end\":42922,\"start\":42918},{\"end\":42935,\"start\":42929},{\"end\":42937,\"start\":42936},{\"end\":42949,\"start\":42944},{\"end\":43254,\"start\":43246},{\"end\":43269,\"start\":43265},{\"end\":43589,\"start\":43581},{\"end\":43604,\"start\":43600},{\"end\":43884,\"start\":43876},{\"end\":43899,\"start\":43895},{\"end\":43912,\"start\":43908},{\"end\":44142,\"start\":44134},{\"end\":44157,\"start\":44153},{\"end\":44540,\"start\":44533},{\"end\":44556,\"start\":44550},{\"end\":44573,\"start\":44567},{\"end\":44575,\"start\":44574},{\"end\":44878,\"start\":44871},{\"end\":44891,\"start\":44888},{\"end\":44903,\"start\":44898},{\"end\":44919,\"start\":44910},{\"end\":44921,\"start\":44920},{\"end\":44934,\"start\":44928},{\"end\":44936,\"start\":44935},{\"end\":45281,\"start\":45274},{\"end\":45299,\"start\":45293},{\"end\":45311,\"start\":45307},{\"end\":45331,\"start\":45323},{\"end\":45681,\"start\":45677},{\"end\":45696,\"start\":45692},{\"end\":45698,\"start\":45697},{\"end\":46049,\"start\":46042},{\"end\":46208,\"start\":46203},{\"end\":46229,\"start\":46221},{\"end\":46242,\"start\":46235},{\"end\":46503,\"start\":46496},{\"end\":46516,\"start\":46512},{\"end\":46535,\"start\":46524},{\"end\":46537,\"start\":46536},{\"end\":46553,\"start\":46547},{\"end\":46555,\"start\":46554},{\"end\":46879,\"start\":46874},{\"end\":46904,\"start\":46898},{\"end\":47282,\"start\":47278},{\"end\":47302,\"start\":47296},{\"end\":47314,\"start\":47309},{\"end\":47653,\"start\":47648},{\"end\":47669,\"start\":47663},{\"end\":47998,\"start\":47993},{\"end\":48014,\"start\":48008},{\"end\":48313,\"start\":48308},{\"end\":48331,\"start\":48323},{\"end\":48347,\"start\":48342},{\"end\":48636,\"start\":48631},{\"end\":48916,\"start\":48911},{\"end\":48937,\"start\":48931},{\"end\":49239,\"start\":49233},{\"end\":49260,\"start\":49254},{\"end\":49535,\"start\":49530},{\"end\":49723,\"start\":49717},{\"end\":49735,\"start\":49730},{\"end\":49739,\"start\":49736},{\"end\":49748,\"start\":49745},{\"end\":49759,\"start\":49756},{\"end\":49769,\"start\":49762},{\"end\":50071,\"start\":50070},{\"end\":50087,\"start\":50082},{\"end\":50098,\"start\":50093},{\"end\":50108,\"start\":50105},{\"end\":50112,\"start\":50109},{\"end\":50127,\"start\":50118}]", "bib_author_last_name": "[{\"end\":35644,\"start\":35640},{\"end\":35663,\"start\":35653},{\"end\":35913,\"start\":35908},{\"end\":35931,\"start\":35925},{\"end\":35949,\"start\":35941},{\"end\":35962,\"start\":35955},{\"end\":35980,\"start\":35971},{\"end\":35994,\"start\":35988},{\"end\":36009,\"start\":36002},{\"end\":36022,\"start\":36015},{\"end\":36047,\"start\":36034},{\"end\":36061,\"start\":36056},{\"end\":36075,\"start\":36068},{\"end\":36095,\"start\":36086},{\"end\":36117,\"start\":36110},{\"end\":36137,\"start\":36129},{\"end\":36148,\"start\":36144},{\"end\":36161,\"start\":36158},{\"end\":36172,\"start\":36169},{\"end\":36185,\"start\":36180},{\"end\":36716,\"start\":36712},{\"end\":36729,\"start\":36723},{\"end\":36997,\"start\":36993},{\"end\":37010,\"start\":37004},{\"end\":37228,\"start\":37224},{\"end\":37246,\"start\":37242},{\"end\":37254,\"start\":37252},{\"end\":37266,\"start\":37264},{\"end\":37542,\"start\":37538},{\"end\":37553,\"start\":37549},{\"end\":37571,\"start\":37563},{\"end\":37579,\"start\":37577},{\"end\":37594,\"start\":37588},{\"end\":37606,\"start\":37604},{\"end\":37859,\"start\":37855},{\"end\":37876,\"start\":37870},{\"end\":37888,\"start\":37881},{\"end\":38213,\"start\":38194},{\"end\":38232,\"start\":38223},{\"end\":38244,\"start\":38236},{\"end\":38264,\"start\":38253},{\"end\":38282,\"start\":38276},{\"end\":38301,\"start\":38294},{\"end\":38313,\"start\":38308},{\"end\":38333,\"start\":38323},{\"end\":38344,\"start\":38335},{\"end\":38747,\"start\":38743},{\"end\":38762,\"start\":38759},{\"end\":38773,\"start\":38770},{\"end\":38785,\"start\":38781},{\"end\":39111,\"start\":39104},{\"end\":39127,\"start\":39120},{\"end\":39150,\"start\":39143},{\"end\":39163,\"start\":39158},{\"end\":39181,\"start\":39171},{\"end\":39200,\"start\":39189},{\"end\":39215,\"start\":39208},{\"end\":39599,\"start\":39595},{\"end\":39615,\"start\":39609},{\"end\":39901,\"start\":39897},{\"end\":39917,\"start\":39911},{\"end\":40251,\"start\":40241},{\"end\":40263,\"start\":40258},{\"end\":40281,\"start\":40270},{\"end\":40585,\"start\":40580},{\"end\":40743,\"start\":40734},{\"end\":40758,\"start\":40752},{\"end\":40774,\"start\":40768},{\"end\":40792,\"start\":40783},{\"end\":41253,\"start\":41243},{\"end\":41276,\"start\":41262},{\"end\":41297,\"start\":41285},{\"end\":41321,\"start\":41310},{\"end\":41337,\"start\":41331},{\"end\":41353,\"start\":41346},{\"end\":41366,\"start\":41360},{\"end\":41810,\"start\":41803},{\"end\":41828,\"start\":41812},{\"end\":42107,\"start\":42097},{\"end\":42123,\"start\":42114},{\"end\":42140,\"start\":42134},{\"end\":42448,\"start\":42440},{\"end\":42465,\"start\":42458},{\"end\":42478,\"start\":42474},{\"end\":42489,\"start\":42487},{\"end\":42501,\"start\":42497},{\"end\":42519,\"start\":42515},{\"end\":42534,\"start\":42530},{\"end\":42899,\"start\":42889},{\"end\":42916,\"start\":42909},{\"end\":42927,\"start\":42923},{\"end\":42942,\"start\":42938},{\"end\":42954,\"start\":42950},{\"end\":43263,\"start\":43255},{\"end\":43286,\"start\":43270},{\"end\":43294,\"start\":43288},{\"end\":43598,\"start\":43590},{\"end\":43621,\"start\":43605},{\"end\":43629,\"start\":43623},{\"end\":43893,\"start\":43885},{\"end\":43906,\"start\":43900},{\"end\":43924,\"start\":43913},{\"end\":44151,\"start\":44143},{\"end\":44174,\"start\":44158},{\"end\":44182,\"start\":44176},{\"end\":44548,\"start\":44541},{\"end\":44565,\"start\":44557},{\"end\":44580,\"start\":44576},{\"end\":44886,\"start\":44879},{\"end\":44896,\"start\":44892},{\"end\":44908,\"start\":44904},{\"end\":44926,\"start\":44922},{\"end\":44941,\"start\":44937},{\"end\":45291,\"start\":45282},{\"end\":45305,\"start\":45300},{\"end\":45321,\"start\":45312},{\"end\":45338,\"start\":45332},{\"end\":45690,\"start\":45682},{\"end\":45710,\"start\":45699},{\"end\":45715,\"start\":45712},{\"end\":46055,\"start\":46050},{\"end\":46219,\"start\":46209},{\"end\":46233,\"start\":46230},{\"end\":46255,\"start\":46243},{\"end\":46264,\"start\":46257},{\"end\":46510,\"start\":46504},{\"end\":46522,\"start\":46517},{\"end\":46545,\"start\":46538},{\"end\":46558,\"start\":46556},{\"end\":46896,\"start\":46880},{\"end\":46918,\"start\":46905},{\"end\":46924,\"start\":46920},{\"end\":47294,\"start\":47283},{\"end\":47307,\"start\":47303},{\"end\":47334,\"start\":47315},{\"end\":47343,\"start\":47336},{\"end\":47661,\"start\":47654},{\"end\":47674,\"start\":47670},{\"end\":48006,\"start\":47999},{\"end\":48019,\"start\":48015},{\"end\":48321,\"start\":48314},{\"end\":48340,\"start\":48332},{\"end\":48355,\"start\":48348},{\"end\":48649,\"start\":48637},{\"end\":48658,\"start\":48651},{\"end\":48929,\"start\":48917},{\"end\":48943,\"start\":48938},{\"end\":48949,\"start\":48945},{\"end\":49252,\"start\":49240},{\"end\":49264,\"start\":49261},{\"end\":49270,\"start\":49266},{\"end\":49544,\"start\":49536},{\"end\":49728,\"start\":49724},{\"end\":49743,\"start\":49740},{\"end\":49754,\"start\":49749},{\"end\":49779,\"start\":49770},{\"end\":50080,\"start\":50072},{\"end\":50091,\"start\":50088},{\"end\":50103,\"start\":50099},{\"end\":50116,\"start\":50113},{\"end\":50131,\"start\":50128},{\"end\":50136,\"start\":50133}]", "bib_entry": "[{\"attributes\":{\"id\":\"b0\",\"matched_paper_id\":5223711},\"end\":35875,\"start\":35566},{\"attributes\":{\"id\":\"b1\",\"matched_paper_id\":3841790},\"end\":36607,\"start\":35877},{\"attributes\":{\"id\":\"b2\",\"matched_paper_id\":7018595},\"end\":36938,\"start\":36609},{\"attributes\":{\"id\":\"b3\",\"matched_paper_id\":1236081},\"end\":37153,\"start\":36940},{\"attributes\":{\"id\":\"b4\",\"matched_paper_id\":1274537},\"end\":37490,\"start\":37155},{\"attributes\":{\"id\":\"b5\"},\"end\":37793,\"start\":37492},{\"attributes\":{\"id\":\"b6\",\"matched_paper_id\":9521947},\"end\":38133,\"start\":37795},{\"attributes\":{\"id\":\"b7\",\"matched_paper_id\":37809600},\"end\":38666,\"start\":38135},{\"attributes\":{\"id\":\"b8\",\"matched_paper_id\":7825911},\"end\":39036,\"start\":38668},{\"attributes\":{\"id\":\"b9\",\"matched_paper_id\":13272863},\"end\":39504,\"start\":39038},{\"attributes\":{\"id\":\"b10\",\"matched_paper_id\":18650536},\"end\":39841,\"start\":39506},{\"attributes\":{\"id\":\"b11\",\"matched_paper_id\":679163},\"end\":40151,\"start\":39843},{\"attributes\":{\"id\":\"b12\",\"matched_paper_id\":9682853},\"end\":40545,\"start\":40153},{\"attributes\":{\"id\":\"b13\"},\"end\":40646,\"start\":40547},{\"attributes\":{\"id\":\"b14\",\"matched_paper_id\":18883184},\"end\":41118,\"start\":40648},{\"attributes\":{\"id\":\"b15\",\"matched_paper_id\":11418612},\"end\":41734,\"start\":41120},{\"attributes\":{\"id\":\"b16\",\"matched_paper_id\":7983519},\"end\":42025,\"start\":41736},{\"attributes\":{\"id\":\"b17\",\"matched_paper_id\":195908774},\"end\":42365,\"start\":42027},{\"attributes\":{\"id\":\"b18\",\"matched_paper_id\":53307035},\"end\":42827,\"start\":42367},{\"attributes\":{\"id\":\"b19\",\"matched_paper_id\":10315654},\"end\":43195,\"start\":42829},{\"attributes\":{\"id\":\"b20\",\"matched_paper_id\":7198177},\"end\":43533,\"start\":43197},{\"attributes\":{\"id\":\"b21\",\"matched_paper_id\":6176757},\"end\":43841,\"start\":43535},{\"attributes\":{\"id\":\"b22\",\"matched_paper_id\":14194167},\"end\":44078,\"start\":43843},{\"attributes\":{\"id\":\"b23\",\"matched_paper_id\":6034383},\"end\":44465,\"start\":44080},{\"attributes\":{\"id\":\"b24\",\"matched_paper_id\":14579301},\"end\":44804,\"start\":44467},{\"attributes\":{\"id\":\"b25\",\"matched_paper_id\":2271818},\"end\":45200,\"start\":44806},{\"attributes\":{\"id\":\"b26\",\"matched_paper_id\":1312964},\"end\":45586,\"start\":45202},{\"attributes\":{\"id\":\"b27\",\"matched_paper_id\":256272},\"end\":45980,\"start\":45588},{\"attributes\":{\"id\":\"b28\"},\"end\":46152,\"start\":45982},{\"attributes\":{\"id\":\"b29\",\"matched_paper_id\":16568654},\"end\":46450,\"start\":46154},{\"attributes\":{\"id\":\"b30\",\"matched_paper_id\":14687186},\"end\":46784,\"start\":46452},{\"attributes\":{\"id\":\"b31\",\"matched_paper_id\":1847966},\"end\":47210,\"start\":46786},{\"attributes\":{\"id\":\"b32\",\"matched_paper_id\":1385509},\"end\":47581,\"start\":47212},{\"attributes\":{\"id\":\"b33\",\"matched_paper_id\":9460079},\"end\":47906,\"start\":47583},{\"attributes\":{\"id\":\"b34\",\"matched_paper_id\":5769897},\"end\":48233,\"start\":47908},{\"attributes\":{\"id\":\"b35\",\"matched_paper_id\":2970563},\"end\":48591,\"start\":48235},{\"attributes\":{\"id\":\"b36\",\"matched_paper_id\":338469},\"end\":48852,\"start\":48593},{\"attributes\":{\"id\":\"b37\"},\"end\":49181,\"start\":48854},{\"attributes\":{\"id\":\"b38\",\"matched_paper_id\":207158556},\"end\":49496,\"start\":49183},{\"attributes\":{\"id\":\"b39\",\"matched_paper_id\":56798209},\"end\":49662,\"start\":49498},{\"attributes\":{\"id\":\"b40\",\"matched_paper_id\":1539668},\"end\":50028,\"start\":49664},{\"attributes\":{\"id\":\"b41\",\"matched_paper_id\":6023198},\"end\":50289,\"start\":50030}]", "bib_title": "[{\"end\":35632,\"start\":35566},{\"end\":35899,\"start\":35877},{\"end\":36703,\"start\":36609},{\"end\":36984,\"start\":36940},{\"end\":37218,\"start\":37155},{\"end\":37849,\"start\":37795},{\"end\":38183,\"start\":38135},{\"end\":38737,\"start\":38668},{\"end\":39098,\"start\":39038},{\"end\":39585,\"start\":39506},{\"end\":39887,\"start\":39843},{\"end\":40230,\"start\":40153},{\"end\":40724,\"start\":40648},{\"end\":41234,\"start\":41120},{\"end\":41795,\"start\":41736},{\"end\":42090,\"start\":42027},{\"end\":42431,\"start\":42367},{\"end\":42880,\"start\":42829},{\"end\":43244,\"start\":43197},{\"end\":43579,\"start\":43535},{\"end\":43874,\"start\":43843},{\"end\":44132,\"start\":44080},{\"end\":44531,\"start\":44467},{\"end\":44869,\"start\":44806},{\"end\":45272,\"start\":45202},{\"end\":45675,\"start\":45588},{\"end\":46201,\"start\":46154},{\"end\":46494,\"start\":46452},{\"end\":46872,\"start\":46786},{\"end\":47276,\"start\":47212},{\"end\":47646,\"start\":47583},{\"end\":47991,\"start\":47908},{\"end\":48306,\"start\":48235},{\"end\":48629,\"start\":48593},{\"end\":48909,\"start\":48854},{\"end\":49231,\"start\":49183},{\"end\":49528,\"start\":49498},{\"end\":49715,\"start\":49664},{\"end\":50068,\"start\":50030}]", "bib_author": "[{\"end\":35646,\"start\":35634},{\"end\":35665,\"start\":35646},{\"end\":35915,\"start\":35901},{\"end\":35933,\"start\":35915},{\"end\":35951,\"start\":35933},{\"end\":35964,\"start\":35951},{\"end\":35982,\"start\":35964},{\"end\":35996,\"start\":35982},{\"end\":36011,\"start\":35996},{\"end\":36024,\"start\":36011},{\"end\":36049,\"start\":36024},{\"end\":36063,\"start\":36049},{\"end\":36077,\"start\":36063},{\"end\":36097,\"start\":36077},{\"end\":36119,\"start\":36097},{\"end\":36139,\"start\":36119},{\"end\":36150,\"start\":36139},{\"end\":36163,\"start\":36150},{\"end\":36174,\"start\":36163},{\"end\":36187,\"start\":36174},{\"end\":36718,\"start\":36705},{\"end\":36731,\"start\":36718},{\"end\":36999,\"start\":36986},{\"end\":37012,\"start\":36999},{\"end\":37230,\"start\":37220},{\"end\":37248,\"start\":37230},{\"end\":37256,\"start\":37248},{\"end\":37268,\"start\":37256},{\"end\":37544,\"start\":37534},{\"end\":37555,\"start\":37544},{\"end\":37573,\"start\":37555},{\"end\":37581,\"start\":37573},{\"end\":37596,\"start\":37581},{\"end\":37608,\"start\":37596},{\"end\":37861,\"start\":37851},{\"end\":37878,\"start\":37861},{\"end\":37890,\"start\":37878},{\"end\":38215,\"start\":38185},{\"end\":38234,\"start\":38215},{\"end\":38246,\"start\":38234},{\"end\":38266,\"start\":38246},{\"end\":38284,\"start\":38266},{\"end\":38303,\"start\":38284},{\"end\":38315,\"start\":38303},{\"end\":38335,\"start\":38315},{\"end\":38346,\"start\":38335},{\"end\":38749,\"start\":38739},{\"end\":38764,\"start\":38749},{\"end\":38775,\"start\":38764},{\"end\":38787,\"start\":38775},{\"end\":39113,\"start\":39100},{\"end\":39129,\"start\":39113},{\"end\":39152,\"start\":39129},{\"end\":39165,\"start\":39152},{\"end\":39183,\"start\":39165},{\"end\":39202,\"start\":39183},{\"end\":39217,\"start\":39202},{\"end\":39601,\"start\":39587},{\"end\":39617,\"start\":39601},{\"end\":39903,\"start\":39889},{\"end\":39919,\"start\":39903},{\"end\":40253,\"start\":40232},{\"end\":40265,\"start\":40253},{\"end\":40283,\"start\":40265},{\"end\":40575,\"start\":40571},{\"end\":40587,\"start\":40575},{\"end\":40745,\"start\":40726},{\"end\":40760,\"start\":40745},{\"end\":40776,\"start\":40760},{\"end\":40794,\"start\":40776},{\"end\":41255,\"start\":41236},{\"end\":41278,\"start\":41255},{\"end\":41299,\"start\":41278},{\"end\":41323,\"start\":41299},{\"end\":41339,\"start\":41323},{\"end\":41355,\"start\":41339},{\"end\":41368,\"start\":41355},{\"end\":41812,\"start\":41797},{\"end\":41830,\"start\":41812},{\"end\":42109,\"start\":42092},{\"end\":42125,\"start\":42109},{\"end\":42142,\"start\":42125},{\"end\":42450,\"start\":42433},{\"end\":42467,\"start\":42450},{\"end\":42480,\"start\":42467},{\"end\":42491,\"start\":42480},{\"end\":42503,\"start\":42491},{\"end\":42521,\"start\":42503},{\"end\":42536,\"start\":42521},{\"end\":42901,\"start\":42882},{\"end\":42918,\"start\":42901},{\"end\":42929,\"start\":42918},{\"end\":42944,\"start\":42929},{\"end\":42956,\"start\":42944},{\"end\":43265,\"start\":43246},{\"end\":43288,\"start\":43265},{\"end\":43296,\"start\":43288},{\"end\":43600,\"start\":43581},{\"end\":43623,\"start\":43600},{\"end\":43631,\"start\":43623},{\"end\":43895,\"start\":43876},{\"end\":43908,\"start\":43895},{\"end\":43926,\"start\":43908},{\"end\":44153,\"start\":44134},{\"end\":44176,\"start\":44153},{\"end\":44184,\"start\":44176},{\"end\":44550,\"start\":44533},{\"end\":44567,\"start\":44550},{\"end\":44582,\"start\":44567},{\"end\":44888,\"start\":44871},{\"end\":44898,\"start\":44888},{\"end\":44910,\"start\":44898},{\"end\":44928,\"start\":44910},{\"end\":44943,\"start\":44928},{\"end\":45293,\"start\":45274},{\"end\":45307,\"start\":45293},{\"end\":45323,\"start\":45307},{\"end\":45340,\"start\":45323},{\"end\":45692,\"start\":45677},{\"end\":45712,\"start\":45692},{\"end\":45717,\"start\":45712},{\"end\":46057,\"start\":46042},{\"end\":46221,\"start\":46203},{\"end\":46235,\"start\":46221},{\"end\":46257,\"start\":46235},{\"end\":46266,\"start\":46257},{\"end\":46512,\"start\":46496},{\"end\":46524,\"start\":46512},{\"end\":46547,\"start\":46524},{\"end\":46560,\"start\":46547},{\"end\":46898,\"start\":46874},{\"end\":46920,\"start\":46898},{\"end\":46926,\"start\":46920},{\"end\":47296,\"start\":47278},{\"end\":47309,\"start\":47296},{\"end\":47336,\"start\":47309},{\"end\":47345,\"start\":47336},{\"end\":47663,\"start\":47648},{\"end\":47676,\"start\":47663},{\"end\":48008,\"start\":47993},{\"end\":48021,\"start\":48008},{\"end\":48323,\"start\":48308},{\"end\":48342,\"start\":48323},{\"end\":48357,\"start\":48342},{\"end\":48651,\"start\":48631},{\"end\":48660,\"start\":48651},{\"end\":48931,\"start\":48911},{\"end\":48945,\"start\":48931},{\"end\":48951,\"start\":48945},{\"end\":49254,\"start\":49233},{\"end\":49266,\"start\":49254},{\"end\":49272,\"start\":49266},{\"end\":49546,\"start\":49530},{\"end\":49730,\"start\":49717},{\"end\":49745,\"start\":49730},{\"end\":49756,\"start\":49745},{\"end\":49762,\"start\":49756},{\"end\":49781,\"start\":49762},{\"end\":50082,\"start\":50070},{\"end\":50093,\"start\":50082},{\"end\":50105,\"start\":50093},{\"end\":50118,\"start\":50105},{\"end\":50133,\"start\":50118},{\"end\":50138,\"start\":50133}]", "bib_venue": "[{\"end\":40897,\"start\":40854},{\"end\":35712,\"start\":35665},{\"end\":36231,\"start\":36187},{\"end\":36757,\"start\":36731},{\"end\":37038,\"start\":37012},{\"end\":37313,\"start\":37268},{\"end\":37532,\"start\":37492},{\"end\":37955,\"start\":37890},{\"end\":38385,\"start\":38346},{\"end\":38843,\"start\":38787},{\"end\":39262,\"start\":39217},{\"end\":39664,\"start\":39617},{\"end\":39981,\"start\":39919},{\"end\":40339,\"start\":40283},{\"end\":40569,\"start\":40547},{\"end\":40852,\"start\":40794},{\"end\":41418,\"start\":41368},{\"end\":41855,\"start\":41830},{\"end\":42186,\"start\":42142},{\"end\":42587,\"start\":42536},{\"end\":43003,\"start\":42956},{\"end\":43355,\"start\":43296},{\"end\":43679,\"start\":43631},{\"end\":43952,\"start\":43926},{\"end\":44263,\"start\":44184},{\"end\":44626,\"start\":44582},{\"end\":44993,\"start\":44943},{\"end\":45386,\"start\":45340},{\"end\":45776,\"start\":45717},{\"end\":46040,\"start\":45982},{\"end\":46292,\"start\":46266},{\"end\":46607,\"start\":46560},{\"end\":46988,\"start\":46926},{\"end\":47372,\"start\":47345},{\"end\":47735,\"start\":47676},{\"end\":48062,\"start\":48021},{\"end\":48405,\"start\":48357},{\"end\":48713,\"start\":48660},{\"end\":49009,\"start\":48951},{\"end\":49330,\"start\":49272},{\"end\":49566,\"start\":49546},{\"end\":49837,\"start\":49781},{\"end\":50148,\"start\":50138}]"}}}, "year": 2023, "month": 12, "day": 17}