{"id": 6826032, "updated": "2023-10-01 03:04:37.795", "metadata": {"title": "RACE: Large-scale ReAding Comprehension Dataset From Examinations", "authors": "[{\"first\":\"Guokun\",\"last\":\"Lai\",\"middle\":[]},{\"first\":\"Qizhe\",\"last\":\"Xie\",\"middle\":[]},{\"first\":\"Hanxiao\",\"last\":\"Liu\",\"middle\":[]},{\"first\":\"Yiming\",\"last\":\"Yang\",\"middle\":[]},{\"first\":\"Eduard\",\"last\":\"Hovy\",\"middle\":[]}]", "venue": "EMNLP", "journal": "Proceedings of the 2017 Conference on Empirical Methods in Natural Language Processing", "publication_date": {"year": 2017, "month": null, "day": null}, "abstract": "We present RACE, a new dataset for benchmark evaluation of methods in the reading comprehension task. Collected from the English exams for middle and high school Chinese students in the age range between 12 to 18, RACE consists of near 28,000 passages and near 100,000 questions generated by human experts (English instructors), and covers a variety of topics which are carefully designed for evaluating the students’ ability in understanding and reasoning. In particular, the proportion of questions that requires reasoning is much larger in RACE than that in other benchmark datasets for reading comprehension, and there is a significant gap between the performance of the state-of-the-art models (43%) and the ceiling human performance (95%). We hope this new dataset can serve as a valuable resource for research and evaluation in machine comprehension. The dataset is freely available at http://www.cs.cmu.edu/~glai1/data/race/ and the code is available at https://github.com/qizhex/RACE_AR_baselines.", "fields_of_study": "[\"Computer Science\"]", "external_ids": {"arxiv": "1704.04683", "mag": "2950501607", "acl": "D17-1082", "pubmed": null, "pubmedcentral": null, "dblp": "conf/emnlp/LaiXLYH17", "doi": "10.18653/v1/d17-1082"}}, "content": {"source": {"pdf_hash": "7c6522c70c16d2a8d11a20725c8d0f135dc1b321", "pdf_src": "ACL", "pdf_uri": "[\"https://www.aclweb.org/anthology/D17-1082.pdf\"]", "oa_url_match": true, "oa_info": {"license": "CCBY", "open_access_url": "https://www.aclweb.org/anthology/D17-1082.pdf", "status": "HYBRID"}}, "grobid": {"id": "b01bae044fc09a78e445087ca251499b5cd9efe6", "type": "plain-text", "url": "s3://ai2-s2-pdf-extraction-prod/parse-results/s2orc_worker/7c6522c70c16d2a8d11a20725c8d0f135dc1b321.txt", "contents": "\nRACE: Large-scale ReAding Comprehension Dataset From Examinations\nAssociation for Computational LinguisticsCopyright Association for Computational LinguisticsSeptember 7-11, 2017. 2017\n\nGuokun Lai guokun@cs.cmu.edu \nLanguage Technologies Institute Carnegie Mellon University Pittsburgh\n15213PA\n\nQizhe Xie qzxie@cs.cmu.edu \nLanguage Technologies Institute Carnegie Mellon University Pittsburgh\n15213PA\n\n⇤ \nLanguage Technologies Institute Carnegie Mellon University Pittsburgh\n15213PA\n\nHanxiao Liu hanxiaol@cs.cmu.edu \nLanguage Technologies Institute Carnegie Mellon University Pittsburgh\n15213PA\n\nYiming Yang yiming@cs.cmu.edu \nLanguage Technologies Institute Carnegie Mellon University Pittsburgh\n15213PA\n\nEduard Hovy hovy@cs.cmu.edu \nLanguage Technologies Institute Carnegie Mellon University Pittsburgh\n15213PA\n\nRACE: Large-scale ReAding Comprehension Dataset From Examinations\n\nNatural Language Processing\nCopenhagen, DenmarkAssociation for Computational LinguisticsSeptember 7-11, 2017. 2017\nWe present RACE, a new dataset for benchmark evaluation of methods in the reading comprehension task. Collected from the English exams for middle and high school Chinese students in the age range between 12 to 18, RACE consists of near 28,000 passages and near 100,000 questions generated by human experts (English instructors), and covers a variety of topics which are carefully designed for evaluating the students' ability in understanding and reasoning. In particular, the proportion of questions that requires reasoning is much larger in RACE than that in other benchmark datasets for reading comprehension, and there is a significant gap between the performance of the state-of-the-art models (43%) and the ceiling human performance (95%). We hope this new dataset can serve as a valuable resource for research and evaluation in machine comprehension. The dataset is freely available at\n\nIntroduction\n\nConstructing an intelligence agent capable of understanding text as people is the major challenge of NLP research. With recent advances in deep learning techniques, it seems possible to achieve human-level performance in certain language understanding tasks, and a surge of effort has been devoted to the machine comprehension task where people aim to construct a system with the ability to ⇤ * indicates equal contribution answer questions related to a document that it has to comprehend (Chen et al., 2016;Dhingra et al., 2016;Yang et al., 2017).\n\nTowards this goal, several large-scale datasets (Rajpurkar et al., 2016;Onishi et al., 2016;Hill et al., 2015;Trischler et al., 2016;Hermann et al., 2015) have been proposed, which allow researchers to train deep learning systems and obtain results comparable to the human performance. While having a suitable dataset is crucial for evaluating the system's true ability in reading comprehension, the existing datasets suffer several critical limitations. Firstly, in all datasets, the candidate options are directly extracted from the context (as a single entity or a text span), which leads to the fact that lots of questions can be solved trivially via word-based search and context-matching without deeper reasoning; this constrains the types of questions as well. Secondly, answers and questions of most datasets are either crowd-sourced or automatically-generated, bringing a significant amount of noises in the datasets and limits the ceiling performance by domain experts, such as 82% for Childrens Book Test and 84% for Who-did-What. Yet another issue in existing datasets is that the topic coverages are often biased due to the specific ways that the data were initially collected, making it hard to evaluate the ability of systems in text comprehension over a broader range of topics.\n\nTo address the aforementioned limitations, we constructed a new dataset by collecting a large set of questions, answers and associated passages in the English exams for middle-school and high-school Chinese students within the 12-18 age range. Those exams were designed by domain experts (instructors) for evaluating the reading comprehension ability of students, with ensured quality and broad topic coverage. Furthermore, the answers by machines or by humans can be objectively graded for evaluation and comparison using the same evaluation metrics. Although efforts have been made with a similar motivation, including the MCTest dataset created by (Richardson et al., 2013) (containing 500 passages and 2000 questions) and several others (Peñas et al., 2014;Rodrigo et al., 2015;Khashabi et al., 2016;Shibuki et al., 2014), the usefulness of those datasets is significantly restricted due to their small sizes, especially not suitable for training powerful deep neural networks whose success relies on the availability of relatively large training sets.\n\nOur new dataset, namely RACE, consists of 27,933 passages and 97,687 questions. After reading each passage, each student is asked to answer several questions where each question is provided with four candidate answers -only one of them is correct . Unlike existing datasets, both the questions and candidate answers in RACE are not restricted to be the text spans in the original passage; instead, they can be described in any words. A sample from our dataset is presented in Table 1.\n\nOur latter analysis shows that correctly answering a large portion of questions in RACE requires the ability of reasoning, the most important feature as a machine comprehension dataset (Chen et al., 2016). RACE also offers two important subdivisions of the reasoning types in its questions, namely passage summarization and attitude analysis, which have not been introduced by the any of the existing large-scale datasets to our knowledge.\n\nIn addition, compared to other existing datasets where passages are either domain-specific or of a single fixed style (namely news stories for CNN/-Daily Mail, NEWSQA and Who-did-What, fiction stories for Children's Book Test and Book Test, and Wikipedia articles for SQUAD), passages in RACE almost cover all types of human articles, such as news, stories, ads, biography, philosophy, etc., in a variety of styles. This comprehensiveness of topic/style coverage makes RACE a desirable resource for evaluating the reading comprehension ability of machine learning systems in general.\n\nThe advantages of our proposed dataset over existing large datasets in machine reading comprehension can be summarized as follows:\n\n• All questions and candidate options are generated by human experts, which are intentionally designed to test human agent's ability in reading comprehension. This makes RACE a relatively accurate indicator for reflecting the text comprehension ability of machine learning systems under human judge.\n\n• The questions are substantially more difficult than those in existing datasets, in terms of the large portion of questions involving reasoning. At the meantime, it is also sufficiently large to support the training of deep learning models.\n\n• Unlike existing large-scale datasets, candidate options in RACE are human generated sentences which may not appear in the original passage. This makes the task more challenging and allows a rich type of questions such as passage summarization and attitude analysis.\n\n• Broad coverage in various domains and writing styles: a desirable property for evaluating generic (in contrast to domain/style-specific) comprehension ability of learning models.\n\n\nRelated Work\n\nIn this section, we briefly outline existing datasets for the machine reading comprehension task, including their strengths and weaknesses.\n\n\nMCTest\n\nMCTest (Richardson et al., 2013) is a popular dataset for question answering in the same format as RACE, where each question is associated with four candidate answers with a single correct answer. Although questions in MCTest are of high-quality ensured by careful examinations through crowdsourcing, it contains only 500 stores and 2000 questions, which substantially restricts its usage in training advanced machine comprehension models. Moreover, while MCTest is designed for 7 years old children, RACE is constructed for middle and high school students at 12-18 years old hence is more complicated and requires stronger reasoning skills. In other words, RACE can be viewed as a larger and more difficult version of the MCTest dataset.\n\n\nCloze-style datasets\n\nThe past few years have witnessed several largescale cloze-style datasets (Hermann et al., 2015;Hill et al., 2015;Onishi et al., 2016), whose questions are formulated by obliterating a word or an entity in a sentence.\n\n\nPassage:\n\nIn a small village in England about 150 years ago, a mail coach was standing on the street. It didn't come to that village often. People had to pay a lot to get a letter. The person who sent the letter didn't have to pay the postage, while the receiver had to. \"Here's a letter for Miss Alice Brown,\" said the mailman. \" I'm Alice Brown,\" a girl of about 18 said in a low voice. Alice looked at the envelope for a minute, and then handed it back to the mailman. \"I'm sorry I can't take it, I don't have enough money to pay it\", she said. A gentleman standing around were very sorry for her. Then he came up and paid the postage for her. When the gentleman gave the letter to her, she said with a smile, \" Thank you very much, This letter is from Tom. I'm going to marry him. He went to London to look for work. I've waited a long time for this letter, but now I don't need it, there is nothing in it.\" \"Really? How do you know that?\" the gentleman said in surprise. \"He told me that he would put some signs on the envelope. Look, sir, this cross in the corner means that he is well and this circle means he has found work. That's good news.\"\n\nThe gentleman was Sir Rowland Hill. He didn't forgot Alice and her letter. \"The postage to be paid by the receiver has to be changed,\" he said to himself and had a good plan. \"The postage has to be much lower, what about a penny? And the person who sends the letter pays the postage. He has to buy a stamp and put it on the envelope.\" he said . The government accepted his plan. Then the first stamp was put out in 1840. It was called the \"Penny Black\". It had a picture of the Queen on it.\n\nQuestions:   (Chen et al., 2016). In fact, the best machine performance obtained by researchers (Chen et al., 2016;Dhingra et al., 2016) is close to human's performance on CNN/Daily Mail.\n\nChildrens Book Test (CBT) (Hill et al., 2015) and Book Test (BT)  are constructed in a similar manner. Each passage in CBT consist of 20 contiguous sentences extracted from children's books and the next (21st) sentence is used to make the question. The main difference between the two datasets is the size of BT being 60 times larger. Machine comprehension models have also matched human performance on CBT .\n\nWho Did What (WDW) (Onishi et al., 2016) is yet another cloze-style dataset constructed from the LDC English Gigaword newswire corpus. The authors generate passages and questions by picking two news articles describing the same event, using one as the passage and the other as the question.\n\nHigh noise is inevitable in cloze-style datasets due to their automatic generation process, which is reflected in the human performance on these datasets: 82% for CBT and 84% for WDW.\n\n\nDatasets with Span-based Answers\n\nIn datasets such as SQUAD (Rajpurkar et al., 2016), NEWSQA (Trischler et al., 2016) and MS MARCO (Nguyen et al., 2016), the answer to each question is in the form of a text span in the article. Articles of SQUAD, NEWSQA and MS MARCO come from Wikipedia, CNN news and the Bing search engine respectively. The answer to a certain question may not be unique and could be multiple spans. Instead of evaluating the accuracy, researchers need to use F1 score, BLEU (Papineni et al., 2002) or ROUGE (Lin and Hovy, 2003) as metrics, which measure the overlap between the prediction and ground truth answers since the questions come without candidate spans.\n\nDatasets with span-based answers are challenging as the space of possible spans is usually large. However, restricting answers to be text spans in the context passage may be unrealistic and more importantly, may not be intuitive even for humans, indicated by the suffered human performance of 80.3% on SQUAD (or 65% claimed by Trischler et al. (2016)) and 46.5% on NEWSQA. In other words, the format of span-based answers may not necessarily be a good examination of reading comprehension of machines whose aim is to approach the comprehension ability of humans.\n\n\nDatasets from Examinations\n\nThere have been several datasets extracted from examinations, aiming at evaluating systems under the same conditions as how humans are evaluated in schools. E.g., the AI2 Elementary School Science Questions dataset (Khashabi et al., 2016) contains 1080 questions for students in elementary schools; NTCIR QA Lab (Shibuki et al., 2014) evaluates systems by the task of solving real-world university entrance exam questions; The Entrance Exams task at CLEF QA Track (Peñas et al., 2014;Rodrigo et al., 2015) evaluates the system's reading comprehension ability. However, data provided in these existing tasks are far from sufficient for the training of advanced data-driven machine reading models, partially due to the expensive data generation process by human experts.\n\nTo the best of our knowledge, RACE is the first large-scale dataset of this type, where questions are created based on exams designed to evaluate human performance in reading comprehension.\n\n\nData Analysis\n\nIn this section, we study the nature of questions covered in RACE at a detailed level. Specifically, we present the dataset statistics in Section 3.1, and then analyze different reasoning/question types in RACE in the remaining subsections.\n\n\nDataset Statistics\n\nAs mentioned in section 1, RACE is collected from English examinations designed for 12-15 year-old middle school students, and 15-18 yearold high school students in China. To distinguish the two subgroups with drastic difficulty gap, RACE-M denotes the middle school examinations and RACE-H denotes high school examinations. We split 5% data as the development set and 5% as the test set for RACE-M and RACE-H respectively. The number of samples in each set is shown in Table 2. The statistics for RACE-M and RACE-H is summarized in Table 3. We can find that the length of the passages and the vocabulary size in the RACE-H are much larger than that of the RACE-M, an evidence of the higher difficulty of high school examinations.\n\nHowever, notice that since the articles and questions are selected and designed to test Chinese students learning English as a foreign language, the vocabulary size and the complexity of the language constructs are simpler than news articles and Wikipedia articles in other QA datasets.\n\n\nReasoning Types of the Questions\n\nTo get a comprehensive picture about the reasoning difficulty requirement of RACE, we conduct human annotations of questions types. Following Chen et al. (2016); Trischler et al. (2016), we stratify the questions into five classes as follows with ascending order of difficulty:\n\n• Word matching: The question exactly matches a span in the article. The answer is self-evident.\n\n• Paraphrasing: The question is entailed or paraphrased by exactly one sentence in the passage. The answer can be extracted within the sentence.\n\n• Single-sentence reasoning: The answer could be inferred from a single sentence of the article by recognizing incomplete information or conceptual overlap.\n\n• Multi-sentence reasoning: The answer must be inferred from synthesizing information distributed across multiple sentences.\n\n• Insufficient/Ambiguous: The question has no answer or the answer is not unique based on the given passage.\n\nWe refer readers to (Chen et al., 2016;Trischler et al., 2016) for examples of each category.\n\nTo obtain the proportion of different question types, we sample 100 passages from RACE (50 from RACE-M and 50 from RACE-H), all of which have 5 questions hence there are 500 questions in total. We put the passages on Amazon Mechanical Turk 1 , and a Hit is generated by a passage   with 5 questions. Each question is labeled by two crowdworkers. We require the turkers to both answer the questions and label the reasoning type. We pay $0.70 and $1.00 per passage in RACE-M and RACE-H respectively, and restrict the access to master turkers only. Finally, we get 1000 labels for the 500 questions. The statistics about the reasoning type is summarized in Table 4. The higher difficulty level of RACE is justified by its higher ratio of reasoning questions in comparison to CNN, SQUAD and NEWSQA. Specifically, 59.2% questions of RACE are either in the category of single-sentence reasoning or in the category of multi-sentence reasoning, while the ratio is 21%, 20.5% and 33.9% for CNN, SQUAD and NEWSQA respectively. Also notice that the ratio of word matching questions on RACE is only 15.8%, the lowest among several categories. In addition, questions in RACE-H are more complex than questions in RACE-M since RACE-M has more word matching questions and fewer reasoning questions.\n\n\nSubdividing Reasoning Types\n\nTo better understand our dataset and facilitate future research, we list the subdivisions of questions under the reasoning category. We find the most frequent reasoning subdivisions include: detail reasoning, whole-picture understanding, passage summarization, attitude analysis and world knowledge. One question may fall into multiple divisions. Definition of these subdivisions and their associated examples are as follows:\n\n1. Detail reasoning: to answer the question, the agent should be clear about the details of the pas-sage. The answer appears in the passage but it cannot be found by simply matching the question with the passage. For example, Question 1 in the sample passage falls into this category.\n\n2. Whole-picture reasoning: the agent needs to understand the whole picture of the story to obtain the correct answer. For example, to answer the Question 2 in the sample passage, the agent is required to comprehend the entire story.\n\n3. Passage summarization: The question requires the agent to select the best summarization of the passage among four candidate summarizations. A typical question of this type is \"The main idea of this passage is .\". An example question can be found in Appendix A.1.\n\n4. Attitude analysis: The question asks about the opinions/attitudes of the author or a character in the story towards somebody or something, e.g.,\n\n• Evidence:\n\n\". . . Many people optimistically thought industry awards for better equipment would stimulate the production of quieter appliances. It was even suggested that noise from building sites could be alleviated . . . \"\n\n• Question: What was the author's attitude towards the industry awards for quieter?  (Trischler et al., 2016) based on 1000 samples per dataset, and numbers with † come from (Chen et al., 2016).\n\n\nCollection Methodology\n\nWe collected the raw data from three large free public websites 234 in China 5 , where the reading comprehension problems are extracted from English examinations designed by teachers in China. The data before cleaning contains 137,918 passages and 519,878 questions in total, where there are 38,159 passages with 156,782 questions in the middle school group, and 99,759 passages with 363,096 questions in the high school group.\n\nThe following filtering steps are conducted to clean the raw data. Firstly, we remove all problems and questions that do not have the same format as our problem setting, e.g., a question would be removed if the number of its options is not four. Secondly, we filter all articles and questions that are not self-contained based on the text information, i.e. we remove the articles and questions containing images or tables. We also remove all questions containing keywords \"underlined\" or \"paragraph\", since it is difficult to reproduce the effect of underlines and the paragraph segment information. Thirdly, we remove all duplicated articles.\n\nOn one of the websites (xkw.com), the answers are stored as images. We used two standard OCR programs tesseract 6 and ABBYY FineReader 7 to process the images. We remove all the answers that two software disagree. The OCR task is easy since we only need to recognize printed alphabet A, B, C, D with a standard font. Finally, we get the cleaned dataset RACE, with 27,933 passages and 97,687 questions.\n\nStanford Attentive Reader Stanford Attentive Reader (Stanford AR) (Chen et al., 2016) is a strong model that achieves state-of-the-art results on CNN/Daily Mail. Moreover, the authors claim that their model has nearly reached the ceiling performance on these two datasets.\n\nSuppose that the triple of passage, question and options is denoted by (p, q, o 1,··· ,4 ). We first employ bidirectional GRUs to encode p and q respectively into h p 1 , h p 2 , . . . , h p n and h q . Then we summarize the most relevant part of the passage into s p with an attention model. Following Chen et al. (2016), we adopt a bilinear attention form. Specifically,\n↵ i = Softmax i ((h p i ) T W 1 h q ) s p = X i ↵ i h p i(1)\nSimilarly, we use bidirectional GRUs to encode option o i into a vector h o i . Finally, we compute the matching score between the i-th option (i = 1, · · · , 4) and the summarized passage using   a bilinear attention. We pass the scores through softmax to get a probability distribution. Specifically, the probability of option i being the right answer is calculated as\n\n\nRACE-M RACE-H RACE MCTest CNN DM CBT-N CBT-C WDW\np i = Softmax i (h o i W 2 s d )(2)\nGated-Attention Reader Gated AR (Dhingra et al., 2016) is the state-of-the-art model on multiple datasets. To build query-specific representations of tokens in the document, it employs an attention mechanism to model multiplicative interactions between the query embedding and the document representation. With a multi-hop architecture, GA also enables a model to scan the document and the question iteratively for multiple passes. In other words, the multi-hop structure makes it possible for the reader to refine token representations iteratively and the attention mechanism find the most relevant part of the document. We refer readers to (Dhingra et al., 2016) for more details.\n\nAfter obtaining a query specific document representation s d , we use the same method as bilinear operation listed in Equation 2 to get the output.\n\nNote that our implementation slightly differs from the original GA reader. Specifically, the Attention Sum layer is not applied at the final layer and no character-level embeddings are used.\n\n\nImplementation Details\n\nWe follow Chen et al. (2016) in our experiment settings. The vocabulary size is set to 50k. We choose word embedding size d = 100 and use the 100-dimensional Glove word embedding (Pennington et al., 2014) as embedding initialization. GRU weights are initialized from Gaussian distribution N (0, 0.1). Other parameters are initialized from a uniform distribution on ( 0.01, 0.01). The hidden dimensionality is set to 128 and the number of layers is set to one for both Stanford AR and GA. We use vanilla stochastic gradient descent (SGD) to train our models. We apply dropout on word embeddings and the gradient is clipped when the norm of the gradient is larger than 10. We use a grid search on validation set to choose the learning rate within {0.05, 0.1, 0.3, 0.5} and dropout rate within {0.2, 0.5, 0.7}. The highest accuracy on validation set is obtained by setting learning rate to 0.1 for Stanford AR and 0.3 for GA and dropout rate to 0.5. The data of RACE-M and RACE-H is used together to train our model and testing is performed separately.\n\n\nHuman Evaluation\n\nAs described in section 3.2, a randomly sampled subset of test set has been labeled by Amazon Turkers, which contains 500 questions with half from RACE-H and with the other half from RACE-M. The turkers' performance is 85% for RACE-M and 70% for RACE-H. However, it is hard to guarantee that every turker performs the survey carefully, given the difficult and long passages of high school problems. Therefore, to obtain the ceiling human performance on RACE, we manually labeled the proportion of valid questions. A question is valid if it is unambiguous and has a correct answer. We found that 94.5% of the data is valid, which sets the ceiling human performance. Similarly, the ceiling performance on RACE-M and RACE-H is 95.4% and 94.2% respectively.\n\n\nMain Results\n\nWe compare models' and human ceiling performance on datasets which have the same evaluation metric with RACE. The compared datasets include RACE, MCTest, CNN/Daily Mail (CNN and DM), CBT and WDW. On CBT, we report performance on two subsets where the missing token is either a common noun (CBT-C) or name entity (CBT-N) since the language models have already reached human-level performance on other types (Hill et al., 2015). The comparison is shown in Table 5.\n\n\nPerformance of Sliding Window\n\nWe first compare MCTest with RACE using Sliding Window, where it is unable to train Stanford AR and Gated AR on MCTest's limited training data. Sliding Window achieves an accuracy of 51.5% on MCTest while only 37.3% on RACE, meaning that to answer the questions of RACE requires more reasoning than MCTest.\n\nThe performance of sliding window on RACE is not directly comparable with CBT and WDW since CBT has ten candidate answers for each question and WDW has an average of three. Instead, we evaluate the performance improvement of sliding window on the random baseline. Larger improvement indicates more questions solvable by simple matching. On RACE, Sliding Window is 28.6% better than the random baseline, while the improvement is 58.5%, 92.2% and 50% for CBT-N, CBT-C and WDW.\n\nThe accuracy on RACE-M (37.3%) and RACE-H (30.4%) indicates that the middle school questions are simpler based on the matching algorithm.\n\nPerformance of Neural Models We further compare the difficulty of different datasets by state-of-the-art neural models' performance. A lower performance means that more problems are unsolvable by machines. The Stanford AR and Gated AR achieve an accuracy of only 43.3% and 44.1% on RACE while their accuracy is much higher on CNN/Daily Mail, Childrens Book Test and Who-Did-What. It justifies the fact that, among current large-scale machine comprehension datasets, RACE is the most challenging one.\n\nHuman Ceiling Performance The human performance is 94.5% which shows our data is quite clean compared to other large-scale machine comprehension datasets. Since we cannot enforce every turker do the test cautiously, the result shows a gap between turkers' performance and human performance. Reasonably, problems in the high school group with longer passages and more complex questions lead to more significant divergence. on the word matching category than reasoning categories. A possible reason is that the proportion of data in reasoning categories is larger than that of data. Also, the candidate answers of simple matching questions may share similar word embeddings. For example, if the question is about color, it is difficult to distinguish candidate answers, \"green\", \"red\", \"blue\" and \"yellow\", in the embedding vector space. The similar performance on different categories also explains the reason that the performance of the neural models is close in the middle and high school groups in Table 5.\n\n\nConclusion\n\nWe introduce a large, high-quality dataset for reading comprehension that is carefully designed to examine human ability on this task. Some desirable properties of RACE include the broad coverage of domains/styles and the richness in the question format. Most importantly, it requires substantially more reasoning to do well on RACE than on other datasets, as there is a significant gap between the performance of state-of-the-art machine comprehension models and that of the human. We hope this dataset will stimulate the development of more advanced machine comprehension models.\n\nFigure 1 :\n1Test accuracy of different baselines on each reasoning type category introduced in Section 3.2, where Word-Match, Single-Reason, Multi-Reason and Ambiguous are the abbreviations for Word matching, Single-sentence Reasoning, Multi-sentence Reasoning and Insufficient/Ambiguous respectively.\n\n\nWe can know from Alice's words that . A. Tom had told her what the signs meant before leaving B. Alice was clever and could guess the meaning of the signs C. Alice had put the signs on the envelope herself D. Tom had put the signs as Alice had told him to1): The first postage stamp was made . \nA. in England B. in America C. by Alice D. in 1910 \n\n2): The girl handed the letter back to the mailman because \n. \nA. she didn't know whose letter it was \nB. she had no money to pay the postage \nC. she received the letter but she didn't want to open it \nD. she had already known what was written in the letter \n\n3): 4): The idea of using stamps was thought of by . \nA. the government \nB. Sir Rowland Hill \nC. Alice Brown \nD. Tom \n\n5): From the passage we know the high postage made . \nA. people never send each other letters \nB. lovers almost lose every touch with each other \nC. people try their best to avoid paying it \nD. receivers refuse to pay the coming letters \n\nAnswer: ADABC \n\n\n\nTable 1 :\n1Sample reading comprehension problems from our dataset.CNN/Daily Mail (Hermann et al., 2015) are \nthe largest machine comprehension datasets with \n1.4M questions. However, both require limited \nreasoning ability \n\nTable 2 :\n2The separation of the training, development and test sets of RACE-M,RACE-H and RACEDataset \nRACE-M RACE-H RACE \nPassage Len \n231.1 \n353.1 \n321.9 \nQuestion Len \n9.0 \n10.4 \n10.0 \nOption Len \n3.9 \n5.8 \n5.3 \nVocab size \n32,811 \n125,120 136,629 \n\n\n\nTable 3 :\n3Statistics of RACE where Len denotes length and Vocab denotes Vocabulary.\n\n\nWorld knowledge: Certain external knowledge is needed. Most frequent questions under this category involve simple arithmetic. Evidence: \"The park is open from 8 am to 5 pm.\" • Question: The park is open for hours a day. • Options: A.eight B.nine C.ten D.elevenTo the best of our knowledge, questions like passage summarization and attitude analysis have not been introduced by any of the existing largescale machine comprehension datasets. Both are crucial components in evaluating humans' reading comprehension abilities.• Options: \nA.suspicious \nB.positive \nC.enthusiastic D.indifferent \n\n5. • Dataset \n\nRACE-M RACE-H RACE \nCNN \nSQUAD NEWSQA \nWord Matching \n29.4% \n11.3% \n15.8% 13.0%  † 39.8%* \n32.7%* \nParaphrasing \n14.8% \n20.6% \n19.2% 41.0%  † 34.3%* \n27.0%* \nSingle-Sentence Reasoning \n31.3% \n34.1% \n33.4% 19.0%  † \n8.6%* \n13.2%* \nMulti-Sentence Reasoning \n22.6% \n26.9% \n25.8% 2.0%  † \n11.9%* \n20.7%* \nAmbiguous/Insufficient \n1.8% \n7.1% \n5.8% 25.0%  † \n5.4%* \n6.4%* \n\nTable 4: Statistic information about Reasoning type in different datasets. * denotes the numbers coming \nfrom \n\nTable 5 :\n5Accuracy of models and human on the each dataset, where † denotes the results coming from previous publications. DM denotes Daily Mail and WDW denotes Who-Did-What .\nhttps://www.mturk.com/mturk/welcome\nhttp://www.21cnjy.com/ 3 http://5utk.ks5u.com/ 4 http://zujuan.xkw.com/ 5 We checked that our dataset does not include example questions of exams with copyright, such as SSAT, SAT, TOEFL and GRE. 6 https://github.com/tesseract-ocr 7 https://www.abbyy.com/FineReader5 ExperimentsIn this section, we compare the performance of several state-of-the-art reading comprehension models with human performance. We use accuracy as the metric to evaluate different models.5.1 Methods for ComparisonSliding Window Algorithm Firstly, we build the rule-based baseline introduced byRichardson et al. (2013). It chooses the answer having the highest matching score. Specifically, it first concatenates the question and the answer and then calculates the TF-IDF style matching score between the concatenated sentence with every window (a span of text) of the article. The window size is decided by the model performance in the training and dev sets.\nNevertheless, the start-of-the-art models still have a large room to be improved to reach turkers' performance. The performance gap is 41% for the middle school problems and 25% for the high school problems. What's more, The performance of Stanford AR and GA is only less than a half of the ceiling human performance, which indicates that to match the humans' reading comprehension ability, we still have a long way to go.5.4 Reason Types AnalysisWe evaluate human and models on different types of questions, shown inFigure 1. Turkers do the best on word matching problems while doing the worst on reasoning problems. Sliding window performs better on word matching than problems needing reasoning or paraphrasing. Surprisingly, Stanford AR does not have a stronger performance\nAcknowledgementWe would like to thank Graham Neubig for suggestions on the draft and Diyi Yang's help on obtaining the crowdsourced labels.This research was supported in part by DARPA grant FA8750-12-2-0342 funded under the DEFT program.\nEmbracing data abundance: Booktest dataset for reading comprehension. Ondrej Bajgar, Rudolf Kadlec, arXiv:1610.00956arXiv preprintOndrej Bajgar, Rudolf Kadlec, and Jan Kleindi- enst. 2016. Embracing data abundance: Booktest dataset for reading comprehension. arXiv preprint arXiv:1610.00956 .\n\nA thorough examination of the cnn/daily mail reading comprehension task. Danqi Chen, Jason Bolton, Christopher D Manning, arXiv:1606.02858arXiv preprintDanqi Chen, Jason Bolton, and Christopher D Man- ning. 2016. A thorough examination of the cn- n/daily mail reading comprehension task. arXiv preprint arXiv:1606.02858 .\n\nGated-attention readers for text comprehension. Bhuwan Dhingra, Hanxiao Liu, W William, Ruslan Cohen, Salakhutdinov, arXiv:1606.01549arXiv preprintBhuwan Dhingra, Hanxiao Liu, William W Cohen, and Ruslan Salakhutdinov. 2016. Gated-attention readers for text comprehension. arXiv preprint arXiv:1606.01549 .\n\nTeaching machines to read and comprehend. Karl Moritz Hermann, Tomas Kocisky, Edward Grefenstette, Lasse Espeholt, Will Kay, Mustafa Suleyman, Phil Blunsom, Advances in Neural Information Processing Systems. Karl Moritz Hermann, Tomas Kocisky, Edward Grefenstette, Lasse Espeholt, Will Kay, Mustafa Su- leyman, and Phil Blunsom. 2015. Teaching ma- chines to read and comprehend. In Advances in Neu- ral Information Processing Systems. pages 1693- 1701.\n\nThe goldilocks principle: Reading children's books with explicit memory representations. Felix Hill, Antoine Bordes, Sumit Chopra, Jason Weston, arXiv:1511.02301arXiv preprintFelix Hill, Antoine Bordes, Sumit Chopra, and Jason Weston. 2015. The goldilocks principle: Reading children's books with explicit memory representa- tions. arXiv preprint arXiv:1511.02301 .\n\nRudolf Kadlec, Martin Schmid, Ondrej Bajgar, arXiv:1603.01547Text understanding with the attention sum reader network. arXiv preprintRudolf Kadlec, Martin Schmid, Ondrej Bajgar, and Jan Kleindienst. 2016. Text understanding with the attention sum reader network. arXiv preprint arXiv:1603.01547 .\n\nQuestion answering via integer programming over semi-structured knowledge. Daniel Khashabi, Tushar Khot, Ashish Sabharwal, Peter Clark, Oren Etzioni, Dan Roth, arXiv:1604.06076arXiv preprintDaniel Khashabi, Tushar Khot, Ashish Sabhar- wal, Peter Clark, Oren Etzioni, and Dan Roth. 2016. Question answering via integer programming over semi-structured knowledge. arXiv preprint arXiv:1604.06076 .\n\nAutomatic evaluation of summaries using n-gram cooccurrence statistics. Chin-Yew Lin, Eduard Hovy, Proceedings of the 2003 Conference of the North American Chapter of the Association for Computational Linguistics on Human Language Technology. the 2003 Conference of the North American Chapter of the Association for Computational Linguistics on Human Language TechnologyAssociation for Computational Linguistics1Chin-Yew Lin and Eduard Hovy. 2003. Auto- matic evaluation of summaries using n-gram co- occurrence statistics. In Proceedings of the 2003 Conference of the North American Chapter of the Association for Computational Linguistics on Hu- man Language Technology-Volume 1. Association for Computational Linguistics, pages 71-78.\n\nMs marco: A human generated machine reading comprehension dataset. Tri Nguyen, Mir Rosenberg, Xia Song, Jianfeng Gao, Saurabh Tiwary, Rangan Majumder, Li Deng, arXiv:1611.09268arXiv preprintTri Nguyen, Mir Rosenberg, Xia Song, Jianfeng Gao, Saurabh Tiwary, Rangan Majumder, and Li Deng. 2016. Ms marco: A human generated machine reading comprehension dataset. arXiv preprint arXiv:1611.09268 .\n\nWho did what: A large-scale person-centered cloze dataset. Takeshi Onishi, Hai Wang, Mohit Bansal, Kevin Gimpel, David Mcallester, arXiv:1608.05457arXiv preprintTakeshi Onishi, Hai Wang, Mohit Bansal, Kevin Gim- pel, and David McAllester. 2016. Who did what: A large-scale person-centered cloze dataset. arXiv preprint arXiv:1608.05457 .\n\nBleu: a method for automatic evaluation of machine translation. Kishore Papineni, Salim Roukos, Todd Ward, Wei-Jing Zhu, Proceedings of the 40th annual meeting on association for computational linguistics. the 40th annual meeting on association for computational linguisticsAssociation for Computational LinguisticsKishore Papineni, Salim Roukos, Todd Ward, and Wei- Jing Zhu. 2002. Bleu: a method for automatic eval- uation of machine translation. In Proceedings of the 40th annual meeting on association for compu- tational linguistics. Association for Computational Linguistics, pages 311-318.\n\nOverview of clef qa entrance exams task 2014. Anselmo Peñas, Yusuke Miyao, Álvaro Rodrigo, H Eduard, Noriko Hovy, Kando, CLEF (Working Notes). Anselmo Peñas, Yusuke Miyao,Álvaro Rodrigo, Ed- uard H Hovy, and Noriko Kando. 2014. Overview of clef qa entrance exams task 2014. In CLEF (Work- ing Notes). pages 1194-1200.\n\nGlove: Global vectors for word representation. Jeffrey Pennington, Richard Socher, Christopher D Manning, EMNLP. 14Jeffrey Pennington, Richard Socher, and Christopher D Manning. 2014. Glove: Global vectors for word representation. In EMNLP. volume 14, pages 1532- 1543.\n\nSquad: 100,000+ questions for machine comprehension of text. Pranav Rajpurkar, Jian Zhang, Konstantin Lopyrev, Percy Liang, arXiv:1606.05250arXiv preprintPranav Rajpurkar, Jian Zhang, Konstantin Lopyrev, and Percy Liang. 2016. Squad: 100,000+ questions for machine comprehension of text. arXiv preprint arXiv:1606.05250 .\n\nMctest: A challenge dataset for the open-domain machine comprehension of text. Matthew Richardson, J C Christopher, Erin Burges, Renshaw, EMNLP. 34Matthew Richardson, Christopher JC Burges, and Erin Renshaw. 2013. Mctest: A challenge dataset for the open-domain machine comprehension of text. In EMNLP. volume 3, page 4.\n\nOverview of clef qa entrance exams task. Anselmo Á Lvaro Rodrigo, Yusuke Peñas, Miyao, H Eduard, Noriko Hovy, Kando, CLEF (Working Notes). Á lvaro Rodrigo, Anselmo Peñas, Yusuke Miyao, Ed- uard H Hovy, and Noriko Kando. 2015. Overview of clef qa entrance exams task 2015. In CLEF (Work- ing Notes).\n\nOverview of the ntcir-11 qa-lab task. Hideyuki Shibuki, Kotaro Sakamoto, Yoshinobu Kano, Teruko Mitamura, Madoka Ishioroshi, Y Kelly, Di Itakura, Tatsunori Wang, Noriko Mori, Kando, NTCIR. Hideyuki Shibuki, Kotaro Sakamoto, Yoshinobu Kano, Teruko Mitamura, Madoka Ishioroshi, Kelly Y Itakura, Di Wang, Tatsunori Mori, and Noriko Kando. 2014. Overview of the ntcir-11 qa-lab task. In NTCIR.\n\nAdam Trischler, Tong Wang, Xingdi Yuan, Justin Harris, Alessandro Sordoni, Philip Bachman, Kaheer Suleman, arXiv:1611.09830Newsqa: A machine comprehension dataset. arXiv preprintAdam Trischler, Tong Wang, Xingdi Yuan, Justin Har- ris, Alessandro Sordoni, Philip Bachman, and Ka- heer Suleman. 2016. Newsqa: A machine compre- hension dataset. arXiv preprint arXiv:1611.09830 .\n\nSemi-supervised qa with generative domain-adaptive nets. Zhilin Yang, Junjie Hu, Ruslan Salakhutdinov, William W Cohen, arXiv:1702.02206arXiv preprintZhilin Yang, Junjie Hu, Ruslan Salakhutdinov, and William W Cohen. 2017. Semi-supervised qa with generative domain-adaptive nets. arXiv preprint arXiv:1702.02206 .\n", "annotations": {"author": "[{\"end\":295,\"start\":187},{\"end\":402,\"start\":296},{\"end\":484,\"start\":403},{\"end\":596,\"start\":485},{\"end\":706,\"start\":597},{\"end\":814,\"start\":707}]", "publisher": "[{\"end\":108,\"start\":67},{\"end\":970,\"start\":929}]", "author_last_name": "[{\"end\":197,\"start\":194},{\"end\":305,\"start\":302},{\"end\":496,\"start\":493},{\"end\":608,\"start\":604},{\"end\":718,\"start\":714}]", "author_first_name": "[{\"end\":193,\"start\":187},{\"end\":301,\"start\":296},{\"end\":404,\"start\":403},{\"end\":492,\"start\":485},{\"end\":603,\"start\":597},{\"end\":713,\"start\":707}]", "author_affiliation": "[{\"end\":294,\"start\":217},{\"end\":401,\"start\":324},{\"end\":483,\"start\":406},{\"end\":595,\"start\":518},{\"end\":705,\"start\":628},{\"end\":813,\"start\":736}]", "title": "[{\"end\":66,\"start\":1},{\"end\":880,\"start\":815}]", "venue": "[{\"end\":909,\"start\":882}]", "abstract": "[{\"end\":1889,\"start\":997}]", "bib_ref": "[{\"attributes\":{\"ref_id\":\"b1\"},\"end\":2413,\"start\":2394},{\"attributes\":{\"ref_id\":\"b2\"},\"end\":2434,\"start\":2413},{\"attributes\":{\"ref_id\":\"b18\"},\"end\":2452,\"start\":2434},{\"attributes\":{\"ref_id\":\"b13\"},\"end\":2527,\"start\":2503},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":2547,\"start\":2527},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":2565,\"start\":2547},{\"attributes\":{\"ref_id\":\"b17\"},\"end\":2588,\"start\":2565},{\"attributes\":{\"ref_id\":\"b3\"},\"end\":2609,\"start\":2588},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":4427,\"start\":4402},{\"attributes\":{\"ref_id\":\"b11\"},\"end\":4512,\"start\":4492},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":4533,\"start\":4512},{\"attributes\":{\"ref_id\":\"b6\"},\"end\":4555,\"start\":4533},{\"attributes\":{\"ref_id\":\"b16\"},\"end\":4576,\"start\":4555},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":5499,\"start\":5480},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":7644,\"start\":7620},{\"attributes\":{\"ref_id\":\"b3\"},\"end\":8472,\"start\":8450},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":8490,\"start\":8472},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":8510,\"start\":8490},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":10273,\"start\":10254},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":10356,\"start\":10337},{\"attributes\":{\"ref_id\":\"b2\"},\"end\":10377,\"start\":10356},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":10475,\"start\":10456},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":10879,\"start\":10859},{\"attributes\":{\"ref_id\":\"b13\"},\"end\":11402,\"start\":11378},{\"attributes\":{\"ref_id\":\"b17\"},\"end\":11435,\"start\":11411},{\"attributes\":{\"ref_id\":\"b8\"},\"end\":11470,\"start\":11449},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":11834,\"start\":11811},{\"attributes\":{\"ref_id\":\"b7\"},\"end\":11864,\"start\":11844},{\"attributes\":{\"ref_id\":\"b17\"},\"end\":12352,\"start\":12329},{\"attributes\":{\"ref_id\":\"b6\"},\"end\":12833,\"start\":12810},{\"attributes\":{\"ref_id\":\"b16\"},\"end\":12929,\"start\":12907},{\"attributes\":{\"ref_id\":\"b11\"},\"end\":13079,\"start\":13059},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":13100,\"start\":13079},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":15050,\"start\":15032},{\"attributes\":{\"ref_id\":\"b17\"},\"end\":15075,\"start\":15052},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":15846,\"start\":15827},{\"attributes\":{\"ref_id\":\"b17\"},\"end\":15869,\"start\":15846},{\"attributes\":{\"ref_id\":\"b17\"},\"end\":18917,\"start\":18893},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":19001,\"start\":18982},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":20590,\"start\":20572},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":21101,\"start\":21083},{\"attributes\":{\"ref_id\":\"b2\"},\"end\":21726,\"start\":21704},{\"attributes\":{\"ref_id\":\"b2\"},\"end\":22336,\"start\":22314},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":22750,\"start\":22732},{\"attributes\":{\"ref_id\":\"b12\"},\"end\":22926,\"start\":22901},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":24987,\"start\":24968},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":31833,\"start\":31809}]", "figure": "[{\"attributes\":{\"id\":\"fig_0\"},\"end\":28389,\"start\":28087},{\"attributes\":{\"id\":\"tab_0\",\"type\":\"table\"},\"end\":29374,\"start\":28390},{\"attributes\":{\"id\":\"tab_1\",\"type\":\"table\"},\"end\":29599,\"start\":29375},{\"attributes\":{\"id\":\"tab_3\",\"type\":\"table\"},\"end\":29854,\"start\":29600},{\"attributes\":{\"id\":\"tab_4\",\"type\":\"table\"},\"end\":29940,\"start\":29855},{\"attributes\":{\"id\":\"tab_5\",\"type\":\"table\"},\"end\":31026,\"start\":29941},{\"attributes\":{\"id\":\"tab_7\",\"type\":\"table\"},\"end\":31204,\"start\":31027}]", "paragraph": "[{\"end\":2453,\"start\":1905},{\"end\":3749,\"start\":2455},{\"end\":4807,\"start\":3751},{\"end\":5293,\"start\":4809},{\"end\":5734,\"start\":5295},{\"end\":6319,\"start\":5736},{\"end\":6451,\"start\":6321},{\"end\":6752,\"start\":6453},{\"end\":6995,\"start\":6754},{\"end\":7264,\"start\":6997},{\"end\":7446,\"start\":7266},{\"end\":7602,\"start\":7463},{\"end\":8351,\"start\":7613},{\"end\":8593,\"start\":8376},{\"end\":9747,\"start\":8606},{\"end\":10239,\"start\":9749},{\"end\":10428,\"start\":10241},{\"end\":10838,\"start\":10430},{\"end\":11130,\"start\":10840},{\"end\":11315,\"start\":11132},{\"end\":12000,\"start\":11352},{\"end\":12564,\"start\":12002},{\"end\":13363,\"start\":12595},{\"end\":13554,\"start\":13365},{\"end\":13812,\"start\":13572},{\"end\":14565,\"start\":13835},{\"end\":14853,\"start\":14567},{\"end\":15167,\"start\":14890},{\"end\":15265,\"start\":15169},{\"end\":15411,\"start\":15267},{\"end\":15569,\"start\":15413},{\"end\":15695,\"start\":15571},{\"end\":15805,\"start\":15697},{\"end\":15900,\"start\":15807},{\"end\":17184,\"start\":15902},{\"end\":17641,\"start\":17216},{\"end\":17927,\"start\":17643},{\"end\":18162,\"start\":17929},{\"end\":18429,\"start\":18164},{\"end\":18578,\"start\":18431},{\"end\":18591,\"start\":18580},{\"end\":18806,\"start\":18593},{\"end\":19002,\"start\":18808},{\"end\":19456,\"start\":19029},{\"end\":20101,\"start\":19458},{\"end\":20504,\"start\":20103},{\"end\":20778,\"start\":20506},{\"end\":21152,\"start\":20780},{\"end\":21584,\"start\":21214},{\"end\":22354,\"start\":21672},{\"end\":22503,\"start\":22356},{\"end\":22695,\"start\":22505},{\"end\":23771,\"start\":22722},{\"end\":24545,\"start\":23792},{\"end\":25024,\"start\":24562},{\"end\":25364,\"start\":25058},{\"end\":25840,\"start\":25366},{\"end\":25979,\"start\":25842},{\"end\":26480,\"start\":25981},{\"end\":27490,\"start\":26482},{\"end\":28086,\"start\":27505}]", "formula": "[{\"attributes\":{\"id\":\"formula_0\"},\"end\":21213,\"start\":21153},{\"attributes\":{\"id\":\"formula_1\"},\"end\":21671,\"start\":21636}]", "table_ref": "[{\"attributes\":{\"ref_id\":\"tab_1\"},\"end\":5292,\"start\":5285},{\"attributes\":{\"ref_id\":\"tab_3\"},\"end\":14312,\"start\":14305},{\"attributes\":{\"ref_id\":\"tab_4\"},\"end\":14375,\"start\":14368},{\"end\":16563,\"start\":16556},{\"attributes\":{\"ref_id\":\"tab_7\"},\"end\":25023,\"start\":25016},{\"attributes\":{\"ref_id\":\"tab_7\"},\"end\":27489,\"start\":27482}]", "section_header": "[{\"attributes\":{\"n\":\"1\"},\"end\":1903,\"start\":1891},{\"attributes\":{\"n\":\"2\"},\"end\":7461,\"start\":7449},{\"attributes\":{\"n\":\"2.1\"},\"end\":7611,\"start\":7605},{\"attributes\":{\"n\":\"2.2\"},\"end\":8374,\"start\":8354},{\"end\":8604,\"start\":8596},{\"attributes\":{\"n\":\"2.3\"},\"end\":11350,\"start\":11318},{\"attributes\":{\"n\":\"2.4\"},\"end\":12593,\"start\":12567},{\"attributes\":{\"n\":\"3\"},\"end\":13570,\"start\":13557},{\"attributes\":{\"n\":\"3.1\"},\"end\":13833,\"start\":13815},{\"attributes\":{\"n\":\"3.2\"},\"end\":14888,\"start\":14856},{\"attributes\":{\"n\":\"3.3\"},\"end\":17214,\"start\":17187},{\"attributes\":{\"n\":\"4\"},\"end\":19027,\"start\":19005},{\"end\":21635,\"start\":21587},{\"end\":22720,\"start\":22698},{\"attributes\":{\"n\":\"5.2\"},\"end\":23790,\"start\":23774},{\"attributes\":{\"n\":\"5.3\"},\"end\":24560,\"start\":24548},{\"end\":25056,\"start\":25027},{\"attributes\":{\"n\":\"6\"},\"end\":27503,\"start\":27493},{\"end\":28098,\"start\":28088},{\"end\":29385,\"start\":29376},{\"end\":29610,\"start\":29601},{\"end\":29865,\"start\":29856},{\"end\":31037,\"start\":31028}]", "table": "[{\"end\":29374,\"start\":28647},{\"end\":29599,\"start\":29442},{\"end\":29854,\"start\":29695},{\"end\":31026,\"start\":30465}]", "figure_caption": "[{\"end\":28389,\"start\":28100},{\"end\":28647,\"start\":28392},{\"end\":29442,\"start\":29387},{\"end\":29695,\"start\":29612},{\"end\":29940,\"start\":29867},{\"end\":30465,\"start\":29943},{\"end\":31204,\"start\":31039}]", "figure_ref": null, "bib_author_first_name": "[{\"end\":33267,\"start\":33261},{\"end\":33282,\"start\":33276},{\"end\":33563,\"start\":33558},{\"end\":33575,\"start\":33570},{\"end\":33597,\"start\":33584},{\"end\":33862,\"start\":33856},{\"end\":33879,\"start\":33872},{\"end\":33886,\"start\":33885},{\"end\":33902,\"start\":33896},{\"end\":34162,\"start\":34158},{\"end\":34184,\"start\":34179},{\"end\":34200,\"start\":34194},{\"end\":34220,\"start\":34215},{\"end\":34235,\"start\":34231},{\"end\":34248,\"start\":34241},{\"end\":34263,\"start\":34259},{\"end\":34664,\"start\":34659},{\"end\":34678,\"start\":34671},{\"end\":34692,\"start\":34687},{\"end\":34706,\"start\":34701},{\"end\":34943,\"start\":34937},{\"end\":34958,\"start\":34952},{\"end\":34973,\"start\":34967},{\"end\":35316,\"start\":35310},{\"end\":35333,\"start\":35327},{\"end\":35346,\"start\":35340},{\"end\":35363,\"start\":35358},{\"end\":35375,\"start\":35371},{\"end\":35388,\"start\":35385},{\"end\":35712,\"start\":35704},{\"end\":35724,\"start\":35718},{\"end\":36441,\"start\":36438},{\"end\":36453,\"start\":36450},{\"end\":36468,\"start\":36465},{\"end\":36483,\"start\":36475},{\"end\":36496,\"start\":36489},{\"end\":36511,\"start\":36505},{\"end\":36524,\"start\":36522},{\"end\":36832,\"start\":36825},{\"end\":36844,\"start\":36841},{\"end\":36856,\"start\":36851},{\"end\":36870,\"start\":36865},{\"end\":36884,\"start\":36879},{\"end\":37176,\"start\":37169},{\"end\":37192,\"start\":37187},{\"end\":37205,\"start\":37201},{\"end\":37220,\"start\":37212},{\"end\":37756,\"start\":37749},{\"end\":37770,\"start\":37764},{\"end\":37784,\"start\":37778},{\"end\":37795,\"start\":37794},{\"end\":37810,\"start\":37804},{\"end\":38076,\"start\":38069},{\"end\":38096,\"start\":38089},{\"end\":38118,\"start\":38105},{\"end\":38360,\"start\":38354},{\"end\":38376,\"start\":38372},{\"end\":38394,\"start\":38384},{\"end\":38409,\"start\":38404},{\"end\":38702,\"start\":38695},{\"end\":38716,\"start\":38715},{\"end\":38718,\"start\":38717},{\"end\":38736,\"start\":38732},{\"end\":38986,\"start\":38979},{\"end\":39010,\"start\":39004},{\"end\":39026,\"start\":39025},{\"end\":39041,\"start\":39035},{\"end\":39284,\"start\":39276},{\"end\":39300,\"start\":39294},{\"end\":39320,\"start\":39311},{\"end\":39333,\"start\":39327},{\"end\":39350,\"start\":39344},{\"end\":39364,\"start\":39363},{\"end\":39374,\"start\":39372},{\"end\":39393,\"start\":39384},{\"end\":39406,\"start\":39400},{\"end\":39633,\"start\":39629},{\"end\":39649,\"start\":39645},{\"end\":39662,\"start\":39656},{\"end\":39675,\"start\":39669},{\"end\":39694,\"start\":39684},{\"end\":39710,\"start\":39704},{\"end\":39726,\"start\":39720},{\"end\":40069,\"start\":40063},{\"end\":40082,\"start\":40076},{\"end\":40093,\"start\":40087},{\"end\":40116,\"start\":40109},{\"end\":40118,\"start\":40117}]", "bib_author_last_name": "[{\"end\":33274,\"start\":33268},{\"end\":33289,\"start\":33283},{\"end\":33568,\"start\":33564},{\"end\":33582,\"start\":33576},{\"end\":33605,\"start\":33598},{\"end\":33870,\"start\":33863},{\"end\":33883,\"start\":33880},{\"end\":33894,\"start\":33887},{\"end\":33908,\"start\":33903},{\"end\":33923,\"start\":33910},{\"end\":34177,\"start\":34163},{\"end\":34192,\"start\":34185},{\"end\":34213,\"start\":34201},{\"end\":34229,\"start\":34221},{\"end\":34239,\"start\":34236},{\"end\":34257,\"start\":34249},{\"end\":34271,\"start\":34264},{\"end\":34669,\"start\":34665},{\"end\":34685,\"start\":34679},{\"end\":34699,\"start\":34693},{\"end\":34713,\"start\":34707},{\"end\":34950,\"start\":34944},{\"end\":34965,\"start\":34959},{\"end\":34980,\"start\":34974},{\"end\":35325,\"start\":35317},{\"end\":35338,\"start\":35334},{\"end\":35356,\"start\":35347},{\"end\":35369,\"start\":35364},{\"end\":35383,\"start\":35376},{\"end\":35393,\"start\":35389},{\"end\":35716,\"start\":35713},{\"end\":35729,\"start\":35725},{\"end\":36448,\"start\":36442},{\"end\":36463,\"start\":36454},{\"end\":36473,\"start\":36469},{\"end\":36487,\"start\":36484},{\"end\":36503,\"start\":36497},{\"end\":36520,\"start\":36512},{\"end\":36529,\"start\":36525},{\"end\":36839,\"start\":36833},{\"end\":36849,\"start\":36845},{\"end\":36863,\"start\":36857},{\"end\":36877,\"start\":36871},{\"end\":36895,\"start\":36885},{\"end\":37185,\"start\":37177},{\"end\":37199,\"start\":37193},{\"end\":37210,\"start\":37206},{\"end\":37224,\"start\":37221},{\"end\":37762,\"start\":37757},{\"end\":37776,\"start\":37771},{\"end\":37792,\"start\":37785},{\"end\":37802,\"start\":37796},{\"end\":37815,\"start\":37811},{\"end\":37822,\"start\":37817},{\"end\":38087,\"start\":38077},{\"end\":38103,\"start\":38097},{\"end\":38126,\"start\":38119},{\"end\":38370,\"start\":38361},{\"end\":38382,\"start\":38377},{\"end\":38402,\"start\":38395},{\"end\":38415,\"start\":38410},{\"end\":38713,\"start\":38703},{\"end\":38730,\"start\":38719},{\"end\":38743,\"start\":38737},{\"end\":38752,\"start\":38745},{\"end\":39002,\"start\":38987},{\"end\":39016,\"start\":39011},{\"end\":39023,\"start\":39018},{\"end\":39033,\"start\":39027},{\"end\":39046,\"start\":39042},{\"end\":39053,\"start\":39048},{\"end\":39292,\"start\":39285},{\"end\":39309,\"start\":39301},{\"end\":39325,\"start\":39321},{\"end\":39342,\"start\":39334},{\"end\":39361,\"start\":39351},{\"end\":39370,\"start\":39365},{\"end\":39382,\"start\":39375},{\"end\":39398,\"start\":39394},{\"end\":39411,\"start\":39407},{\"end\":39418,\"start\":39413},{\"end\":39643,\"start\":39634},{\"end\":39654,\"start\":39650},{\"end\":39667,\"start\":39663},{\"end\":39682,\"start\":39676},{\"end\":39702,\"start\":39695},{\"end\":39718,\"start\":39711},{\"end\":39734,\"start\":39727},{\"end\":40074,\"start\":40070},{\"end\":40085,\"start\":40083},{\"end\":40107,\"start\":40094},{\"end\":40124,\"start\":40119}]", "bib_entry": "[{\"attributes\":{\"doi\":\"arXiv:1610.00956\",\"id\":\"b0\"},\"end\":33483,\"start\":33191},{\"attributes\":{\"doi\":\"arXiv:1606.02858\",\"id\":\"b1\"},\"end\":33806,\"start\":33485},{\"attributes\":{\"doi\":\"arXiv:1606.01549\",\"id\":\"b2\"},\"end\":34114,\"start\":33808},{\"attributes\":{\"id\":\"b3\",\"matched_paper_id\":6203757},\"end\":34568,\"start\":34116},{\"attributes\":{\"doi\":\"arXiv:1511.02301\",\"id\":\"b4\"},\"end\":34935,\"start\":34570},{\"attributes\":{\"doi\":\"arXiv:1603.01547\",\"id\":\"b5\"},\"end\":35233,\"start\":34937},{\"attributes\":{\"doi\":\"arXiv:1604.06076\",\"id\":\"b6\"},\"end\":35630,\"start\":35235},{\"attributes\":{\"id\":\"b7\",\"matched_paper_id\":16292125},\"end\":36369,\"start\":35632},{\"attributes\":{\"doi\":\"arXiv:1611.09268\",\"id\":\"b8\"},\"end\":36764,\"start\":36371},{\"attributes\":{\"doi\":\"arXiv:1608.05457\",\"id\":\"b9\"},\"end\":37103,\"start\":36766},{\"attributes\":{\"id\":\"b10\",\"matched_paper_id\":11080756},\"end\":37701,\"start\":37105},{\"attributes\":{\"id\":\"b11\",\"matched_paper_id\":26586935},\"end\":38020,\"start\":37703},{\"attributes\":{\"id\":\"b12\",\"matched_paper_id\":1957433},\"end\":38291,\"start\":38022},{\"attributes\":{\"doi\":\"arXiv:1606.05250\",\"id\":\"b13\"},\"end\":38614,\"start\":38293},{\"attributes\":{\"id\":\"b14\",\"matched_paper_id\":2100831},\"end\":38936,\"start\":38616},{\"attributes\":{\"id\":\"b15\",\"matched_paper_id\":26586935},\"end\":39236,\"start\":38938},{\"attributes\":{\"id\":\"b16\",\"matched_paper_id\":36768057},\"end\":39627,\"start\":39238},{\"attributes\":{\"doi\":\"arXiv:1611.09830\",\"id\":\"b17\"},\"end\":40004,\"start\":39629},{\"attributes\":{\"doi\":\"arXiv:1702.02206\",\"id\":\"b18\"},\"end\":40319,\"start\":40006}]", "bib_title": "[{\"end\":34156,\"start\":34116},{\"end\":35702,\"start\":35632},{\"end\":37167,\"start\":37105},{\"end\":37747,\"start\":37703},{\"end\":38067,\"start\":38022},{\"end\":38693,\"start\":38616},{\"end\":38977,\"start\":38938},{\"end\":39274,\"start\":39238}]", "bib_author": "[{\"end\":33276,\"start\":33261},{\"end\":33291,\"start\":33276},{\"end\":33570,\"start\":33558},{\"end\":33584,\"start\":33570},{\"end\":33607,\"start\":33584},{\"end\":33872,\"start\":33856},{\"end\":33885,\"start\":33872},{\"end\":33896,\"start\":33885},{\"end\":33910,\"start\":33896},{\"end\":33925,\"start\":33910},{\"end\":34179,\"start\":34158},{\"end\":34194,\"start\":34179},{\"end\":34215,\"start\":34194},{\"end\":34231,\"start\":34215},{\"end\":34241,\"start\":34231},{\"end\":34259,\"start\":34241},{\"end\":34273,\"start\":34259},{\"end\":34671,\"start\":34659},{\"end\":34687,\"start\":34671},{\"end\":34701,\"start\":34687},{\"end\":34715,\"start\":34701},{\"end\":34952,\"start\":34937},{\"end\":34967,\"start\":34952},{\"end\":34982,\"start\":34967},{\"end\":35327,\"start\":35310},{\"end\":35340,\"start\":35327},{\"end\":35358,\"start\":35340},{\"end\":35371,\"start\":35358},{\"end\":35385,\"start\":35371},{\"end\":35395,\"start\":35385},{\"end\":35718,\"start\":35704},{\"end\":35731,\"start\":35718},{\"end\":36450,\"start\":36438},{\"end\":36465,\"start\":36450},{\"end\":36475,\"start\":36465},{\"end\":36489,\"start\":36475},{\"end\":36505,\"start\":36489},{\"end\":36522,\"start\":36505},{\"end\":36531,\"start\":36522},{\"end\":36841,\"start\":36825},{\"end\":36851,\"start\":36841},{\"end\":36865,\"start\":36851},{\"end\":36879,\"start\":36865},{\"end\":36897,\"start\":36879},{\"end\":37187,\"start\":37169},{\"end\":37201,\"start\":37187},{\"end\":37212,\"start\":37201},{\"end\":37226,\"start\":37212},{\"end\":37764,\"start\":37749},{\"end\":37778,\"start\":37764},{\"end\":37794,\"start\":37778},{\"end\":37804,\"start\":37794},{\"end\":37817,\"start\":37804},{\"end\":37824,\"start\":37817},{\"end\":38089,\"start\":38069},{\"end\":38105,\"start\":38089},{\"end\":38128,\"start\":38105},{\"end\":38372,\"start\":38354},{\"end\":38384,\"start\":38372},{\"end\":38404,\"start\":38384},{\"end\":38417,\"start\":38404},{\"end\":38715,\"start\":38695},{\"end\":38732,\"start\":38715},{\"end\":38745,\"start\":38732},{\"end\":38754,\"start\":38745},{\"end\":39004,\"start\":38979},{\"end\":39018,\"start\":39004},{\"end\":39025,\"start\":39018},{\"end\":39035,\"start\":39025},{\"end\":39048,\"start\":39035},{\"end\":39055,\"start\":39048},{\"end\":39294,\"start\":39276},{\"end\":39311,\"start\":39294},{\"end\":39327,\"start\":39311},{\"end\":39344,\"start\":39327},{\"end\":39363,\"start\":39344},{\"end\":39372,\"start\":39363},{\"end\":39384,\"start\":39372},{\"end\":39400,\"start\":39384},{\"end\":39413,\"start\":39400},{\"end\":39420,\"start\":39413},{\"end\":39645,\"start\":39629},{\"end\":39656,\"start\":39645},{\"end\":39669,\"start\":39656},{\"end\":39684,\"start\":39669},{\"end\":39704,\"start\":39684},{\"end\":39720,\"start\":39704},{\"end\":39736,\"start\":39720},{\"end\":40076,\"start\":40063},{\"end\":40087,\"start\":40076},{\"end\":40109,\"start\":40087},{\"end\":40126,\"start\":40109}]", "bib_venue": "[{\"end\":33259,\"start\":33191},{\"end\":33556,\"start\":33485},{\"end\":33854,\"start\":33808},{\"end\":34322,\"start\":34273},{\"end\":34657,\"start\":34570},{\"end\":35054,\"start\":34998},{\"end\":35308,\"start\":35235},{\"end\":35873,\"start\":35731},{\"end\":36436,\"start\":36371},{\"end\":36823,\"start\":36766},{\"end\":37309,\"start\":37226},{\"end\":37844,\"start\":37824},{\"end\":38133,\"start\":38128},{\"end\":38352,\"start\":38293},{\"end\":38759,\"start\":38754},{\"end\":39075,\"start\":39055},{\"end\":39425,\"start\":39420},{\"end\":39791,\"start\":39752},{\"end\":40061,\"start\":40006},{\"end\":36002,\"start\":35875},{\"end\":37379,\"start\":37311}]"}}}, "year": 2023, "month": 12, "day": 17}