{"id": 7197134, "updated": "2023-09-27 19:13:50.83", "metadata": {"title": "UCF101: A Dataset of 101 Human Actions Classes From Videos in The Wild", "authors": "[{\"first\":\"Khurram\",\"last\":\"Soomro\",\"middle\":[]},{\"first\":\"Amir\",\"last\":\"Zamir\",\"middle\":[\"Roshan\"]},{\"first\":\"Mubarak\",\"last\":\"Shah\",\"middle\":[]}]", "venue": "ArXiv", "journal": "ArXiv", "publication_date": {"year": 2012, "month": 12, "day": 3}, "abstract": "We introduce UCF101 which is currently the largest dataset of human actions. It consists of 101 action classes, over 13k clips and 27 hours of video data. The database consists of realistic user uploaded videos containing camera motion and cluttered background. Additionally, we provide baseline action recognition results on this new dataset using standard bag of words approach with overall performance of 44.5%. To the best of our knowledge, UCF101 is currently the most challenging dataset of actions due to its large number of classes, large number of clips and also unconstrained nature of such clips.", "fields_of_study": "[\"Computer Science\"]", "external_ids": {"arxiv": "1212.0402", "mag": "24089286", "acl": null, "pubmed": null, "pubmedcentral": null, "dblp": "journals/corr/abs-1212-0402", "doi": null}}, "content": {"source": {"pdf_hash": "da9e411fcf740569b6b356f330a1d0fc077c8d7c", "pdf_src": "Arxiv", "pdf_uri": "[\"https://arxiv.org/pdf/1212.0402v1.pdf\"]", "oa_url_match": false, "oa_info": null}, "grobid": {"id": "985db093700d7cccabb97aaecc64657c2cd9becf", "type": "plain-text", "url": "s3://ai2-s2-pdf-extraction-prod/parse-results/s2orc_worker/da9e411fcf740569b6b356f330a1d0fc077c8d7c.txt", "contents": "\nUCF101: A Dataset of 101 Human Actions Classes From Videos in The Wild UCF101: A Dataset of 101 Human Actions Classes From Videos in The Wild\nNovember 2012 3 Dec 2012\n\nKhurram Soomro ksoomro@cs.ucf.edu \nCenter for Research in Computer Vision\nCenter for Research in Computer Vision\nUniversity of Central Florida\n4000 Central Florida Blvd. Orlando32816-2365, 32816OrlandoFL, FLUSA, USA\n\nAmir Roshan Zamir \nCenter for Research in Computer Vision\nCenter for Research in Computer Vision\nUniversity of Central Florida\n4000 Central Florida Blvd. Orlando32816-2365, 32816OrlandoFL, FLUSA, USA\n\nMubarak Shah shah@cs.ucf.edu \nCenter for Research in Computer Vision\nCenter for Research in Computer Vision\nUniversity of Central Florida\n4000 Central Florida Blvd. Orlando32816-2365, 32816OrlandoFL, FLUSA, USA\n\nKhurram Soomro \nCenter for Research in Computer Vision\nCenter for Research in Computer Vision\nUniversity of Central Florida\n4000 Central Florida Blvd. Orlando32816-2365, 32816OrlandoFL, FLUSA, USA\n\nAmir Roshan Zamir \nCenter for Research in Computer Vision\nCenter for Research in Computer Vision\nUniversity of Central Florida\n4000 Central Florida Blvd. Orlando32816-2365, 32816OrlandoFL, FLUSA, USA\n\nMubarak Shah \nCenter for Research in Computer Vision\nCenter for Research in Computer Vision\nUniversity of Central Florida\n4000 Central Florida Blvd. Orlando32816-2365, 32816OrlandoFL, FLUSA, USA\n\nUCF101: A Dataset of 101 Human Actions Classes From Videos in The Wild UCF101: A Dataset of 101 Human Actions Classes From Videos in The Wild\nNovember 2012 3 Dec 2012Action DatasetUCF101UCF50Action Recognition\nWe introduce UCF101 which is currently the largest dataset of human actions. It consists of 101 action classes, over 13k clips and 27 hours of video data. The database consists of realistic user-uploaded videos containing camera motion and cluttered background. Additionally, we provide baseline action recognition results on this new dataset using standard bag of words approach with overall performance of 44.5%. To the best of our knowledge, UCF101 is currently the most challenging dataset of actions due to its large number of classes, large number of clips and also unconstrained nature of such clips.Dataset DetailsAction Classes: UCF101 includes total number of 101 action classes which we have divided into five types:\n\nIntroduction\n\nThe majority of existing action recognition datasets suffer from two disadvantages: 1) The number of their classes is typically very low compared to the richness of performed actions by humans in reality, e.g. KTH [11], Weizmann [3], UCF Sports [10], IXMAS [12] datasets includes only 6,9,9,11 classes respectively. 2) The videos are recorded in unrealistically controlled environments. For instance, KTH, Weizmann, IXMAS are staged by actors; HOHA [7] and UCF Sports are composed of movie clips captured by professional filming crew. Recently, web videos have been used in order to utilize unconstrained user-uploaded data to alleviate the second issue [6,8,9,5]. However, the first disadvantage remains unresolved as the largest existing dataset does not include more than 51 actions while several works showed that the number of classes play a crucial role in evaluating an action recognition method [4,9]. Therefore, we have compiled a new dataset with 101 actions and 13320 clips which is nearly twice bigger than the largest existing dataset in terms of number of actions and clips. (HMDB51 [5] and UCF50 [9] are the currently the largest ones with 6766 clips of 51 actions and 6681 clips of 50 actions respectively.)\n\nThe dataset is composed of web videos which are recorded in unconstrained environments and typically in-  clude camera motion, various lighting conditions, partial occlusion, low quality frames, etc. Fig. 1 shows sample frames of 6 action classes from UCF101.  Trampoline Jumping, Volleyball Spiking, Walking with a dog, Yo Yo}. The color class labels specify which predefined action type they belong to.     Fig. 2 shows a sample frame for each action class of UCF101. Clip Groups: The clips of one action class are divided into 25 groups which contain 4-7 clips each. The clips in one group share some common features, such as the background or actors.\n\nThe bar chart of Fig. 3 shows the number of clips in each class. The colors on each bar illustrate the durations of different clips included in that class. The chart shown in Fig. 4 illustrates the average clip length (green) and total duration of clips (blue) for each action class.\n\nThe videos are downloaded from YouTube [2] and the irrelevant ones are manually removed. All clips have fixed frame rate and resolution of 25 FPS and 320 × 240 respectively. The videos are saved in .avi files compressed using DivX codec available in k-lite package [1]. The audio is preserved for the clips of the new 51 actions. Table 1 summarizes the characteristics of the dataset.    where X, Y and Z represent action class label, group and clip number respectively. For instance, v ApplyEyeMakeup g03 c04.avi corresponds to the clip 4 of group 3 of action class ApplyEyeMakeup.\n\n\nExperimental Results\n\nWe performed an experiment using bag of words approach which is widely accepted as a standard action recognition method to provide baseline results on UCF101.\n\nFrom each clip, we extracted Harris3D corners (using the implementation by [7]) and computed 162 dimensional HOG/HOF descriptors for each. We clustered a randomly selected set of 100,000 space-time interest points (STIP) using k-means to build the codebook. The size of our codebook is k=4000 which is shown to yield good results over a wide range of datasets. The descriptors were assigned to their closest video words using nearest neighbor classifier, and each clip was represented by a 4000-dimensional histogram of its words. Utilizing a leave-one-group-out 25fold cross validation scenario, a SVM was trained using the histogram vectors of the training folds. We employed a nonlinear multiclass SVM with histogram intersection kernel and 101 classes each representing one action. For testing, a similar histogram representation for the query video was computed and classified using the trained SVM. This method yielded an overall accuracy of 44.5%; The confusion matrix for all 101 actions is shown in Fig. 5.\n\nThe accuracy for the predefined action types are: Sports (50.54%), Playing Musical Instrument (37.42%), Human-Object Interaction (38.52%), Body-Motion Only (36.26%), Human-Human Interaction (44.14%). Sports actions achieve the highest accuracy since performing sports typically requires distinctive motions which makes the classification easier. Moreover, the background in sports clips are generally less cluttered compared to other action types. Unlike Sports Actions, Human-Object Interaction clips typically have a highly cluttered background. Additionally, the informative motions typically occupy a small portion of the motions in the clips which explains the low recognition accuracy of this action class. We recommend a 25-fold cross validation experimental setup using all the videos in the dataset to keep consistency of the reported tests on UCF101; the baseline results provided in this section were computed using the same scenario.\n\n\nRelated Datasets\n\nUCF Sports, UCF11, UCF50 and UCF101 are the four action datasets compiled by UCF in chronological order; each one includes its precursor. We made two minor modifications in the portion of UCF101 which includes UCF50 videos: the number of groups is fixed to 25 for all the actions, and each group includes up to 7 clips. Table 2 shows a list of existing action recognition datasets with detailed characteristics of each. Note that UCF101 is remarkably larger than the rest.\n\n\nConclusion\n\nWe introduced UCF101 which is the most challenging dataset for action recognition compared to the existing ones. It includes 101 action classes and over 13k clips which makes it outstandingly larger than other datasets. UCF101 is composed of unconstrained videos downloaded from YouTube which feature challenges such as poor lighting, cluttered background and severe camera motion. We provided baseline action recognition results on this new dataset using standard bag of words method with overall accuracy of 44.5%.  \n\nFigure 1 .\n1Sample frames for 6 action classes of UCF101.\n\nFigure 2 .\n2101 actions included in UCF101 shown with one sample frame. The color of frame borders specifies to which action type they belong: Human-Object Interaction, Body-Motion Only, Human-Human Interaction, Playing Musical Instruments, Sports.\n\nFigure 3 .\n3Number of clips per action class. The distribution of clip durations is illustrated by the colors.\n\n\nBilliards BlowDryHair BlowingCandles BodyWeightSquats Bowling BoxingPunchingBag BoxingSpeedBag BreastStroke BrushingTeeth CleanAndJerk CliffDiving CricketBowling CricketShot CuttingInKitchen Diving Drumming Fencing FieldHockeyPenalty FloorGymnastics FrisbeeCatch FrontCrawl GolfSwing Haircut Hammering HammerThrow HandstandPushups HandstandWalking HeadMassage HighJump HorseRace HorseRiding HulaHoop IceDancing JavelinThrow JugglingBalls JumpingJack JumpRope Kayaking Knitting\n\nFigure 4 .\n4Total time of videos for each class is illustrated using the blue bars. The average length of the clips for each action is depicted in green.\n\nFigure 5 .\n5Confusion table of baseline action recognition results using bag of words approach on UCF101. The drawn lines separate different types of actions; 1-50: Sports, 51-60: Playing Musical Instrument, 61-80: Human-Object Interaction, 81-96: Body-Motion Only, 97-101: Human-Human Interaction.\n\n\nThe following 51 new classes are introduced in UCF101: {Apply Eye Makeup, Apply Lipstick, Archery, Baby Crawling, Balance Beam, Band Marching, Basketball Dunk, Blow Drying Hair, Blowing Candles, Body Weight Squats, Bowl-ing,Boxing-Punching Bag, Boxing-Speed Bag, Brushing Teeth, Cliff Diving, Cricket Bowling, Cricket Shot, Cutting In Kitchen, Field Hockey Penalty, Floor Gymnastics, Frisbee Catch, Front Crawl, Hair cut, Hammering, Hammer Throw, Handstand Pushups, Handstand Walking, Head Massage, Ice Dancing, Knitting, Long Jump, Mopping Floor, Parallel Bars, Playing Cello, Playing Daf, Playing Billiards BlowDryHair BlowingCandles BodyWeightSquats Bowling BoxingPunchingBag BoxingSpeedBag BreastStroke BrushingTeeth CleanAndJerk CliffDiving CricketBowling CricketShot CuttingInKitchen Diving Drumming Fencing FieldHockeyPenalty FloorGymnastics FrisbeeCatch FrontCrawl GolfSwing Haircut Hammering HammerThrow HandstandPushups HandstandWalking HeadMassage HighJump HorseRace HorseRiding HulaHoop IceDancing JavelinThrow JugglingBalls JumpingJack JumpRope Kayaking Knitting Skijet SkyDiving SoccerJuggling SoccerPenalty StillRings SumoWrestling Surfing Swing TableTennis… TaiChi TennisSwing ThrowDiscus TrampolineJ… Typing UnevenBars VolleyballSp… WalkingWit… WallPushups WritingOnB… YoYo0 \n\n30 \n\n60 \n\n90 \n\n120 \n\n150 \n\n180 \n\nApplyEyeMakeup ApplyLipstick \nArchery BabyCrawling BalanceBeam \nBandMarching \nBaseballPitch \nBasketball BasketballDunk \nBenchPress Biking Number \nof Clips \n\n0 \n\n30 \n\n60 \n\n90 \n\n120 \n\n150 \n\n180 \n\nLongJump \nLunges \nMilitaryParade Mixing \nMoppingFloor Nunchucks \nParallelBars PizzaTossing PlayingCello \nPlayingDaf PlayingDhol \nPlayingFlute PlayingGuitar PlayingPiano PlayingSitar \nPlayingTabla PlayingViolin \nPoleVault PommelHorse PullUps \nPunch \nPushUps Rafting RockClimbi… \nRopeClimbing \nRowing SalsaSpin \nShavingBeard Shotput \nSkateBoarding Skiing \nNumber \nof Clips \n\n\n\n\nDhol, Playing Flute, Playing Sitar, Rafting, Shaving Beard, Shot put, Sky Diving, Soccer Penalty, Still Rings, Sumo Wrestling, Surfing, Table Tennis Shot, Typing, Uneven Bars, Wall Pushups, Writing On Board}.\n\n\nUCF101.php ) includes 101 folders each containing the clips of one action class. The name of each clip has the following form: v X gY cZ.aviActions \n101 \nClips \n13320 \nGroups per Action \n25 \nClips per Group \n4-7 \nMean Clip Length \n7.21 sec \nTotal Duration \n1600 mins \nMin Clip Length \n1.06 sec \nMax Clip Length \n71.04 sec \nFrame Rate \n25 fps \nResolution \n320×240 \nAudio \nYes (51 actions) \n\nTable 1. Summary of Characteristics of UCF101 \n\nNaming Convention: The zipped file of the dataset \n(available \nat \nhttp://crcv.ucf.edu/data/ \n\n\n\nSkijet SkyDiving SoccerJuggling SoccerPenalty StillRings SumoWrestling Surfing Swing TableTennisShot TaiChi TennisSwing ThrowDiscus TrampolineJumping Typing UnevenBars VolleyballSpiking WalkingWithDog WallPushups WritingOnBoard YoYoLongJump Lunges \nMilitaryParade Mixing \nMoppingFloor Nunchucks \nParallelBars PizzaTossing \nPlayingCello \nPlayingDaf PlayingDhol \nPlayingFlute \nPlayingGuitar PlayingPiano PlayingSitar \nPlayingTabla PlayingViolin \nPoleVault \nPommelHorse PullUps \nPunch PushUps Rafting RockClimbingIndoor \nRopeClimbing \nRowing SalsaSpin \nShavingBeard Shotput \nSkateBoarding Skiing Time \n\n(sec) \n\nTotal Time \nAverage Clip Duration \n\n\n\n. K-Lite Codec Package, K-lite codec package. http://codecguide.com/. 4\n\n. Youtube , Youtube. http://www.youtube.com/. 4\n\nActions as space-time shapes. M Blank, L Gorelick, E Shechtman, M Irani, R Basri, International Conference on Computer Vision (ICCV). 26M. Blank, L. Gorelick, E. Shechtman, M. Irani, and R. Basri. Actions as space-time shapes, 2005. International Confer- ence on Computer Vision (ICCV). 2, 6\n\nPerceiving events and objects. G Johansson, S Bergstrom, W Epstein, Lawrence Erlbaum AssociatesG. Johansson, S. Bergstrom, and W. Epstein. Perceiving events and objects, 1994. Lawrence Erlbaum Associates. 2\n\nHmdb: A large video database for human motion recognition. H Kuehne, H Jhuang, E Garrote, T Poggio, T Serre, International Conference on Computer Vision (ICCV). 26H. Kuehne, H. Jhuang, E. Garrote, T. Poggio, and T. Serre. Hmdb: A large video database for human motion recogni- tion, 2011. International Conference on Computer Vision (ICCV). 2, 6\n\nRecognizing realistic actions from videos in the wild. J Liu, J Luo, M Shah, IEEE Conference on Computer Vision and Pattern Recognition (CVPR). 26J. Liu, J. Luo, and M. Shah. Recognizing realistic actions from videos in the wild, 2009. IEEE Conference on Com- puter Vision and Pattern Recognition (CVPR). 2, 6\n\nActions in context. M Marszaek, I Laptev, C Schmid, IEEE Conference on Computer Vision and Pattern Recognition (CVPR). 26M. Marszaek, I. Laptev, and C. Schmid. Actions in context, 2009. IEEE Conference on Computer Vision and Pattern Recognition (CVPR). 2, 5, 6\n\nModeling temporal structure of decomposable motion segments for activity classication. J Niebles, C Chen, L Fei-Fei, European Conference on Computer Vision (ECCV). 26J. Niebles, C. Chen, and L. Fei-Fei. Modeling temporal structure of decomposable motion segments for activity clas- sication, 2010. European Conference on Computer Vision (ECCV). 2, 6\n\nRecognizing 50 human action categories of web videos, 2012. Machine Vision and Applications. K Reddy, M Shah, Journal (MVAP). 26K. Reddy and M. Shah. Recognizing 50 human action cat- egories of web videos, 2012. Machine Vision and Applica- tions Journal (MVAP). 2, 6\n\nAction mach: A spatiotemporal maximum average correlation height lter for action recognition. M Rodriguez, J Ahmed, M Shah, IEEE Conference on Computer Vision and Pattern Recognition (CVPR). 26M. Rodriguez, J. Ahmed, and M. Shah. Action mach: A spatiotemporal maximum average correlation height lter for action recognition, 2008. IEEE Conference on Computer Vision and Pattern Recognition (CVPR). 2, 6\n\nRecognizing human actions: A local svm approach. C Schuldt, I Laptev, B Caputo, International Conference on Pattern Recognition (ICPR). 26C. Schuldt, I. Laptev, and B. Caputo. Recognizing human ac- tions: A local svm approach, 2004. International Conference on Pattern Recognition (ICPR). 2, 6\n\nAction recognition from arbitrary views using 3d exemplars. D Weinland, E Boyer, R Ronfard, International Conference on Computer Vision (ICCV). 26D. Weinland, E. Boyer, and R. Ronfard. Action recognition from arbitrary views using 3d exemplars, 2007. International Conference on Computer Vision (ICCV). 2, 6\n", "annotations": {"author": "[{\"end\":385,\"start\":169},{\"end\":586,\"start\":386},{\"end\":798,\"start\":587},{\"end\":996,\"start\":799},{\"end\":1197,\"start\":997},{\"end\":1393,\"start\":1198}]", "publisher": null, "author_last_name": "[{\"end\":183,\"start\":177},{\"end\":403,\"start\":391},{\"end\":599,\"start\":595},{\"end\":813,\"start\":807},{\"end\":1014,\"start\":1002},{\"end\":1210,\"start\":1206}]", "author_first_name": "[{\"end\":176,\"start\":169},{\"end\":390,\"start\":386},{\"end\":594,\"start\":587},{\"end\":806,\"start\":799},{\"end\":1001,\"start\":997},{\"end\":1205,\"start\":1198}]", "author_affiliation": "[{\"end\":384,\"start\":204},{\"end\":585,\"start\":405},{\"end\":797,\"start\":617},{\"end\":995,\"start\":815},{\"end\":1196,\"start\":1016},{\"end\":1392,\"start\":1212}]", "title": "[{\"end\":142,\"start\":1},{\"end\":1535,\"start\":1394}]", "venue": null, "abstract": "[{\"end\":2331,\"start\":1604}]", "bib_ref": "[{\"attributes\":{\"ref_id\":\"b10\"},\"end\":2565,\"start\":2561},{\"attributes\":{\"ref_id\":\"b2\"},\"end\":2579,\"start\":2576},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":2596,\"start\":2592},{\"attributes\":{\"ref_id\":\"b11\"},\"end\":2608,\"start\":2604},{\"attributes\":{\"ref_id\":\"b5\"},\"end\":2634,\"start\":2632},{\"attributes\":{\"ref_id\":\"b8\"},\"end\":2636,\"start\":2634},{\"attributes\":{\"ref_id\":\"b8\"},\"end\":2638,\"start\":2636},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":2640,\"start\":2638},{\"attributes\":{\"ref_id\":\"b6\"},\"end\":2799,\"start\":2796},{\"attributes\":{\"ref_id\":\"b5\"},\"end\":3004,\"start\":3001},{\"attributes\":{\"ref_id\":\"b7\"},\"end\":3006,\"start\":3004},{\"attributes\":{\"ref_id\":\"b8\"},\"end\":3008,\"start\":3006},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":3010,\"start\":3008},{\"attributes\":{\"ref_id\":\"b3\"},\"end\":3253,\"start\":3250},{\"attributes\":{\"ref_id\":\"b8\"},\"end\":3255,\"start\":3253},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":3447,\"start\":3444},{\"attributes\":{\"ref_id\":\"b8\"},\"end\":3461,\"start\":3458},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":4555,\"start\":4552},{\"attributes\":{\"ref_id\":\"b0\"},\"end\":4781,\"start\":4778},{\"attributes\":{\"ref_id\":\"b6\"},\"end\":5358,\"start\":5355}]", "figure": "[{\"attributes\":{\"id\":\"fig_1\"},\"end\":8327,\"start\":8269},{\"attributes\":{\"id\":\"fig_2\"},\"end\":8577,\"start\":8328},{\"attributes\":{\"id\":\"fig_4\"},\"end\":8689,\"start\":8578},{\"attributes\":{\"id\":\"fig_5\"},\"end\":9168,\"start\":8690},{\"attributes\":{\"id\":\"fig_6\"},\"end\":9323,\"start\":9169},{\"attributes\":{\"id\":\"fig_7\"},\"end\":9623,\"start\":9324},{\"attributes\":{\"id\":\"tab_1\",\"type\":\"table\"},\"end\":11520,\"start\":9624},{\"attributes\":{\"id\":\"tab_2\",\"type\":\"table\"},\"end\":11731,\"start\":11521},{\"attributes\":{\"id\":\"tab_3\",\"type\":\"table\"},\"end\":12266,\"start\":11732},{\"attributes\":{\"id\":\"tab_4\",\"type\":\"table\"},\"end\":12913,\"start\":12267}]", "paragraph": "[{\"end\":3570,\"start\":2347},{\"end\":4226,\"start\":3572},{\"end\":4511,\"start\":4228},{\"end\":5095,\"start\":4513},{\"end\":5278,\"start\":5120},{\"end\":6295,\"start\":5280},{\"end\":7242,\"start\":6297},{\"end\":7735,\"start\":7263},{\"end\":8268,\"start\":7750}]", "formula": null, "table_ref": "[{\"end\":4850,\"start\":4843},{\"end\":7590,\"start\":7583}]", "section_header": "[{\"attributes\":{\"n\":\"1.\"},\"end\":2345,\"start\":2333},{\"attributes\":{\"n\":\"3.\"},\"end\":5118,\"start\":5098},{\"attributes\":{\"n\":\"4.\"},\"end\":7261,\"start\":7245},{\"attributes\":{\"n\":\"5.\"},\"end\":7748,\"start\":7738},{\"end\":8280,\"start\":8270},{\"end\":8339,\"start\":8329},{\"end\":8589,\"start\":8579},{\"end\":9180,\"start\":9170},{\"end\":9335,\"start\":9325}]", "table": "[{\"end\":11520,\"start\":10916},{\"end\":12266,\"start\":11874},{\"end\":12913,\"start\":12501}]", "figure_caption": "[{\"end\":8327,\"start\":8282},{\"end\":8577,\"start\":8341},{\"end\":8689,\"start\":8591},{\"end\":9168,\"start\":8692},{\"end\":9323,\"start\":9182},{\"end\":9623,\"start\":9337},{\"end\":10916,\"start\":9626},{\"end\":11731,\"start\":11523},{\"end\":11874,\"start\":11734},{\"end\":12501,\"start\":12269}]", "figure_ref": "[{\"attributes\":{\"ref_id\":\"fig_1\"},\"end\":3778,\"start\":3772},{\"attributes\":{\"ref_id\":\"fig_2\"},\"end\":3987,\"start\":3981},{\"attributes\":{\"ref_id\":\"fig_4\"},\"end\":4251,\"start\":4245},{\"attributes\":{\"ref_id\":\"fig_6\"},\"end\":4409,\"start\":4403},{\"attributes\":{\"ref_id\":\"fig_7\"},\"end\":6294,\"start\":6288}]", "bib_author_first_name": "[{\"end\":12929,\"start\":12917},{\"end\":12997,\"start\":12990},{\"end\":13068,\"start\":13067},{\"end\":13077,\"start\":13076},{\"end\":13089,\"start\":13088},{\"end\":13102,\"start\":13101},{\"end\":13111,\"start\":13110},{\"end\":13362,\"start\":13361},{\"end\":13375,\"start\":13374},{\"end\":13388,\"start\":13387},{\"end\":13598,\"start\":13597},{\"end\":13608,\"start\":13607},{\"end\":13618,\"start\":13617},{\"end\":13629,\"start\":13628},{\"end\":13639,\"start\":13638},{\"end\":13941,\"start\":13940},{\"end\":13948,\"start\":13947},{\"end\":13955,\"start\":13954},{\"end\":14217,\"start\":14216},{\"end\":14229,\"start\":14228},{\"end\":14239,\"start\":14238},{\"end\":14546,\"start\":14545},{\"end\":14557,\"start\":14556},{\"end\":14565,\"start\":14564},{\"end\":14903,\"start\":14902},{\"end\":14912,\"start\":14911},{\"end\":15172,\"start\":15171},{\"end\":15185,\"start\":15184},{\"end\":15194,\"start\":15193},{\"end\":15530,\"start\":15529},{\"end\":15541,\"start\":15540},{\"end\":15551,\"start\":15550},{\"end\":15836,\"start\":15835},{\"end\":15848,\"start\":15847},{\"end\":15857,\"start\":15856}]", "bib_author_last_name": "[{\"end\":12937,\"start\":12930},{\"end\":13074,\"start\":13069},{\"end\":13086,\"start\":13078},{\"end\":13099,\"start\":13090},{\"end\":13108,\"start\":13103},{\"end\":13117,\"start\":13112},{\"end\":13372,\"start\":13363},{\"end\":13385,\"start\":13376},{\"end\":13396,\"start\":13389},{\"end\":13605,\"start\":13599},{\"end\":13615,\"start\":13609},{\"end\":13626,\"start\":13619},{\"end\":13636,\"start\":13630},{\"end\":13645,\"start\":13640},{\"end\":13945,\"start\":13942},{\"end\":13952,\"start\":13949},{\"end\":13960,\"start\":13956},{\"end\":14226,\"start\":14218},{\"end\":14236,\"start\":14230},{\"end\":14246,\"start\":14240},{\"end\":14554,\"start\":14547},{\"end\":14562,\"start\":14558},{\"end\":14573,\"start\":14566},{\"end\":14909,\"start\":14904},{\"end\":14917,\"start\":14913},{\"end\":15182,\"start\":15173},{\"end\":15191,\"start\":15186},{\"end\":15199,\"start\":15195},{\"end\":15538,\"start\":15531},{\"end\":15548,\"start\":15542},{\"end\":15558,\"start\":15552},{\"end\":15845,\"start\":15837},{\"end\":15854,\"start\":15849},{\"end\":15865,\"start\":15858}]", "bib_entry": "[{\"attributes\":{\"id\":\"b0\"},\"end\":12986,\"start\":12915},{\"attributes\":{\"id\":\"b1\"},\"end\":13035,\"start\":12988},{\"attributes\":{\"id\":\"b2\",\"matched_paper_id\":175905},\"end\":13328,\"start\":13037},{\"attributes\":{\"id\":\"b3\"},\"end\":13536,\"start\":13330},{\"attributes\":{\"id\":\"b4\",\"matched_paper_id\":206769852},\"end\":13883,\"start\":13538},{\"attributes\":{\"id\":\"b5\",\"matched_paper_id\":206597309},\"end\":14194,\"start\":13885},{\"attributes\":{\"id\":\"b6\",\"matched_paper_id\":3155054},\"end\":14456,\"start\":14196},{\"attributes\":{\"id\":\"b7\",\"matched_paper_id\":14779543},\"end\":14807,\"start\":14458},{\"attributes\":{\"id\":\"b8\",\"matched_paper_id\":10875786},\"end\":15075,\"start\":14809},{\"attributes\":{\"id\":\"b9\"},\"end\":15478,\"start\":15077},{\"attributes\":{\"id\":\"b10\",\"matched_paper_id\":8777811},\"end\":15773,\"start\":15480},{\"attributes\":{\"id\":\"b11\",\"matched_paper_id\":1407568},\"end\":16082,\"start\":15775}]", "bib_title": "[{\"end\":13065,\"start\":13037},{\"end\":13595,\"start\":13538},{\"end\":13938,\"start\":13885},{\"end\":14214,\"start\":14196},{\"end\":14543,\"start\":14458},{\"end\":14900,\"start\":14809},{\"end\":15169,\"start\":15077},{\"end\":15527,\"start\":15480},{\"end\":15833,\"start\":15775}]", "bib_author": "[{\"end\":12939,\"start\":12917},{\"end\":13000,\"start\":12990},{\"end\":13076,\"start\":13067},{\"end\":13088,\"start\":13076},{\"end\":13101,\"start\":13088},{\"end\":13110,\"start\":13101},{\"end\":13119,\"start\":13110},{\"end\":13374,\"start\":13361},{\"end\":13387,\"start\":13374},{\"end\":13398,\"start\":13387},{\"end\":13607,\"start\":13597},{\"end\":13617,\"start\":13607},{\"end\":13628,\"start\":13617},{\"end\":13638,\"start\":13628},{\"end\":13647,\"start\":13638},{\"end\":13947,\"start\":13940},{\"end\":13954,\"start\":13947},{\"end\":13962,\"start\":13954},{\"end\":14228,\"start\":14216},{\"end\":14238,\"start\":14228},{\"end\":14248,\"start\":14238},{\"end\":14556,\"start\":14545},{\"end\":14564,\"start\":14556},{\"end\":14575,\"start\":14564},{\"end\":14911,\"start\":14902},{\"end\":14919,\"start\":14911},{\"end\":15184,\"start\":15171},{\"end\":15193,\"start\":15184},{\"end\":15201,\"start\":15193},{\"end\":15540,\"start\":15529},{\"end\":15550,\"start\":15540},{\"end\":15560,\"start\":15550},{\"end\":15847,\"start\":15835},{\"end\":15856,\"start\":15847},{\"end\":15867,\"start\":15856}]", "bib_venue": "[{\"end\":13169,\"start\":13119},{\"end\":13359,\"start\":13330},{\"end\":13697,\"start\":13647},{\"end\":14027,\"start\":13962},{\"end\":14313,\"start\":14248},{\"end\":14620,\"start\":14575},{\"end\":14933,\"start\":14919},{\"end\":15266,\"start\":15201},{\"end\":15614,\"start\":15560},{\"end\":15917,\"start\":15867}]"}}}, "year": 2023, "month": 12, "day": 17}