{"id": 73652596, "updated": "2023-09-27 04:02:49.469", "metadata": {"title": "Quantum cohomology of the Springer resolution", "authors": "[{\"first\":\"Alexander\",\"last\":\"Braverman\",\"middle\":[]},{\"first\":\"Davesh\",\"last\":\"Maulik\",\"middle\":[]},{\"first\":\"Andrei\",\"last\":\"Okounkov\",\"middle\":[]}]", "venue": null, "journal": "arXiv: Algebraic Geometry", "publication_date": {"year": 2009, "month": null, "day": null}, "abstract": "Let G denote a complex, semisimple, simply-connected group. We identify the equivariant quantum differential equation for the cotangent bundle to the flag variety of G with the affine Knizhnik-Zamolodchikov connection of Cherednik and Matsuo. This recovers Kim's description of quantum cohomology of the flag variety itself as a limiting case. A parallel result is proven for resolutions of the Slodowy slices. Extension to arbitrary symplectic resolutions is discussed.", "fields_of_study": "[\"Mathematics\",\"Physics\"]", "external_ids": {"arxiv": "1001.0056", "mag": "2963640809", "acl": null, "pubmed": null, "pubmedcentral": null, "dblp": null, "doi": "10.1016/j.aim.2011.01.021"}}, "content": {"source": {"pdf_hash": "b329493bccde23c35128d61565678421d17dab7e", "pdf_src": "Arxiv", "pdf_uri": "[\"https://arxiv.org/pdf/1001.0056v2.pdf\"]", "oa_url_match": false, "oa_info": {"license": "elsevier-specific: oa user license", "open_access_url": "https://doi.org/10.1016/j.aim.2011.01.021", "status": "BRONZE"}}, "grobid": {"id": "b2e898a4161c9684c5ccd1b47d59ba2babe0c157", "type": "plain-text", "url": "s3://ai2-s2-pdf-extraction-prod/parse-results/s2orc_worker/b329493bccde23c35128d61565678421d17dab7e.txt", "contents": "\nQUANTUM COHOMOLOGY OF THE SPRINGER RESOLUTION\n5 Jan 2010\n\nDAVESHAlexander Braverman \nAndrei Okounkov \nQUANTUM COHOMOLOGY OF THE SPRINGER RESOLUTION\n5 Jan 2010\nLet G denote a complex, semisimple, simply-connected group and B its associated flag variety. We identify the equivariant quantum differential equation for the cotangent bundle T * B with the affine Knizhnik-Zamolodchikov connection of Cherednik and Matsuo. This recovers Kim's description of quantum cohomology of B as a limiting case. A parallel result is proven for resolutions of the Slodowy slices. Extension to arbitrary symplectic resolutions is discussed.\n\nIntroduction\n\nThe main goal of this paper is to study the quantum cohomology of the Springer resolution associated to a semisimple algebraic group G. Since many of the ideas and constructions here apply to arbitrary symplectic resolutions, much of the introduction will discuss this more general context. 1.1. Geometry of symplectic resolutions. Recall from [26] that a smooth algebraic variety X with a holomorphic symplectic form ω ∈ H 0 (X, Ω 2 ) is called a symplectic resolution if the canonical map (1) X → X 0 = SpecH 0 (X, O X )\n\nis projective and birational. The deformations of the pair (X, ω) are classified by the image [ω] of the symplectic form in H 2 deRham (X). In many important examples, the universal families\n(2) X / / X φ [ω] / / H 2 (X, C)\nmay be described explicitly, see [26] for further discussion. The generic fiber of (2) is affine. Fibers with algebraic cycles α ∨ ∈ H 2 (X, Z) lie over hyperplanes (3) (ω, α ∨ ) = α ∨ ω = 0 in the base. Primitive effective classes α ∨ as above are called primitive coroots by the analogy with the following prominent example.\n\n1.2. Grothendieck resolution. Let G be a complex, semi-simple simply connected algebraic group with Lie algebra g. Let B be the flag variety of G that parametrizes, among other things, Borel subalgebras b ⊂ g. Consider\nX = {(b, ξ), ξ ∈ [b, b] ⊥ } ⊂ B × g * ,\nand the map\n(4) X ∋ (b, ξ) φ −→ ξ b/[b,b] ∈ t * ,\nwhere t is the Lie algebra of a maximal torus T ⊂ G.\n\nThe generic fiber of φ is a coadjoint orbit of G with its canonical Kirillov-Kostant form ω, while\nX = φ −1 (0) ∼ = T * B\nwith the canonical exact symplectic form of a cotangent bundle. The map\n(5) X ∋ (b, ξ) −→ ξ ∈ g *\ntakes X to the nilpotent cone N ⊂ g * . This is known as the Springer resolution of N, while (5) is referred to as the Grothendieck simultaneous resolution. Applying ⊗ Z C to (6), we get an isomorphism t * ∼ = H 2 (X, C) that makes (7) T * B / / X φ 0 / / t * an instance of the diagram (2) with φ as in (4). We will denote by R, R + , and Π the set of roots, positive roots, and simple roots respectively. A positive coroot α ∨ defines an SL 2 -subgroup G α ∨ ⊂ G and hence a rational curve\nG α ∨ · [B] ⊂ B ⊂ X .\nSince G is simply-connected, coroots generate the lattice\n(8) Λ ∨ = Hom(C * , T ) ∼ = H 2 (X, Z) ,\nin which the positive ones generate the effective cone. It is well-known that this classical notion of a positive coroot agrees with the definition given in Section 1.1.\n\n\nEquivariant symplectic resolutions.\n\nOur interest lies in enumerative invariants of curves in X, particularly, in quantum cohomology of X. Since a symplectic resolution X may be deformed to an affine variety, most Gromov-Witten invariants of X trivially vanish. However, equivariant Gromov-Witten invariants of X may be very interesting.\n\nIn what follows, we assume that a connected reductive algebraic group G acts on X so that:\n\n(1) X g is proper for some g ∈ G;\n\n(2) G scales ω by a nontrivial character. The second property implies X does not have any G-equivariant symplectic deformations since any connected group acts trivially on H 2 (X). See [24] for general conjectures concerning the existence of scaling actions on X.\n\nFor the Springer resolution X = T * B, we take\nG = G × C *\nwhere the second factors acts by scalar operators on g * , t * , and the cotangent fibers. While all constructions of Section 1.2 are G-equivariant, note that G acts nontrivially on the base of the deformation with a unique fixed point 0 ∈ t * . Other examples of equivariant symplectic resolution include: cotangent bundles of homogeneous spaces, as well as Hilbert schemes of points and more general moduli of sheaves on symplectic surfaces. The largest class of examples comes from Nakajima quiver varieties, see [17] for an introduction. For a general symplectic resolution, we denote by G ⊂ G the stabilizer of ω.\n\n\n1.4.\n\nGoal of the project. There exist powerful heuristic as well as proven principles that organize Gromov-Witten invariants of algebraic varieties into certain beautiful and powerful structures. This is loosely known as mirror symmetry, see e.g. [11,19,21] for an introduction. We believe for symplectic resolutions, these structures recover and generalize some classical notions of geometric representation theory.\n\nTo see this in full generality is the goal of a large joint project which we pursue with R. Bezrukavnikov, P. Etingof, V. Toledano-Laredo, and others. It has also many points of contact with the ongoing work of N. Nekrasov and S. Shatashvili [41].\n\nThis paper may be seen as a first step, in which we explain what these structures mean for the most classical symplectic resolution of all -the Springer resolution. This will be reflected in the paper's structure: the reader will notice that the generalities take up much more space than the actual geometric computation of quantum multiplication in Section 5.\n\n1.5. Quantum multiplication. By definition, the operator of quantum multiplication by α ∈ H * G (X) has the following matrix elements (9) (α • γ 1 , γ 2 ) = β∈H 2 (X,Z)\nq β α, γ 1 , γ 2 X 0,3,β ,\nwhere (· , ·) denotes the standard inner product on cohomology and the quantity in angle brackets is a 3-point, genus 0, degree β equivariant Gromov-Witten invariant of X, see Section 4. It is a very general fact that (9) defines a commutative associative deformation of the algebra H * G (X), see e.g. [11]. We denote by T ∨ the dual torus, for which the roles of (6) and (8) are reversed. Each monomial q β is naturally a function on T ∨ . In fact, the series (9) will be shown to be rational, that is, to lie in C(T ∨ ). Parallel rationality is expected for arbitrary symplectic resolutions.\n\nIt is well-known that H * (B) is generated by divisors and, for an arbitrary symplectic resolution X, one may hope that the quantum cohomology is generated by divisors even if the classical cohomology is not.\n\nThe main result of the paper is a computation of operators of quantum multiplication by divisors for the Springer resolution. Before stating it, we discuss the general structure of the answer.\n\n1.6. Correspondence algebra and root subalgebras. Consider the fiber product (10) X × X 0 X ⊂ X × X .\n\nIt is known that all components of (10) have dimension ≤ dim X and those of dimension dim X are Lagrangian, see [17]. Lagrangian components of (10) act by correspondences on the Borel-Moore homology of X. We denote by Corr(X) ⊂ End (H * (X)) the subalgebra that they generate, known as the correspondence algebra. We will show that the quantum contribution to divisor multiplication will lie in Corr(X). More precisely, we establish the following refined statement in section 5. Let X α be a generic fiber of (2) over the hyperplane where α ∨ is algebraic. Then we can again consider the fiber product (11) X α × X α 0 X α ⊂ X α × X α . Since X α ∼ X as a topological G-space, Lagrangian components of (11) act by correspondences in the Borel-Moore homology of X. We denote S α ⊂ Corr(X) the subalgebra that they generate.\n\nLet D ⊂ H 2 (X) be a divisor. By an abstract argument, we show the operator D• of quantum multiplication by D has the following form\n(12) D• = classical + t α ∨ (D, α ∨ ) S α q α ∨ , S α (z) ∈ S α ⊗ C[[z]] ,\nwhere the first term is the classical multiplication by D, the sum is over all positive coroots α ∨ ∈ H 2 (X, Z), and t is the weight of the symplectic form ω. See sections 5.1 and 5.2 for the argument. Formula (12) is functorial in the sense that α ∨ -term in it describes the quantum corrections to multiplication in H * (X α ). This reduces the computation of quantum cohomology to varieties with a unique effective curve class, as we discuss further below. We will also see that similar functoriality holds for slices of X.\n\nIn the case of Nakajima varieties, which come in families, the root subalgebras S α and the operators of classical multiplication can be extended to a representation of the so called Yangian algebra Y (g) associated to the corresponding Kac-Moody Lie algebra, see [48]. Through the work of Nekrasov and Shatashvili, this has a direct link to the classical work of C. N. Yang in quantum integrable systems. 1.7. Main result. In the Springer case, the action of classical multiplication and the root subalgebras has a very concrete description in terms of the graded affine Hecke algebra H t . Recall that H t is generated by the symmetric algebra Sym t * of t * and the group algebra of W subject to the relation\ns α x λ − x sα(λ) s α = t(α ∨ , λ),\nwhere s α is the reflection associated with the simple root α and x λ ∈ S 1 t * corresponds to λ ∈ t * .\n\nAs before, t is a parameter which may be identified with the weight of the symplectic form ω, that is, with the equivariant parameter of the C * -factor in G. The algebra H t is graded by deg\nx λ = 2, deg w = 0, deg t = 2.\nAn action of H t on H * G (T * B) is due to Lusztig [31]. Its construction is recalled in Section 3. In particular, x λ acts by classical multiplication by D λ , while S α is generated by the corresponding reflection in s α ∈ W . Having introduced the above notations we can now state Theorem 1.1. The operator of quantum multiplication by the divisor D λ is given by\n(13) D λ • = x λ + t α ∨ ∈R ∨ + (λ, α ∨ ) q α ∨ 1 − q α ∨ (s α − 1).\nSince D λ generate cohomology, this determines all operators of quantum multiplication. We give a more detailed statement of this theorem in section 3.5. The commuting elements (13) are, of course, well-known, as we now recall.\n\n1.8. The quantum connection. Over\nT ∨ reg = {q ∈ T ∨ | α(q) = 1 for any α ∈ R + }.\nconsider what is known as the quantum differential equation, namely the following connection on the trivial bundle with fiber H * G (X)\n(14) ∇ λ = d λ − D λ • = d λ − x λ − t α∈R + (λ, α ∨ ) q α ∨ 1 − q α ∨ (s α − 1).\nHere d λ is the derivative in the direction of λ ∈ t * = Lie(T ∨ ). It is a general result of Dubrovin that quantum connections are always flat, see [11].\n\nIn our case, a simple gauge transformation, see Section 2.2, identifies (14) with the affine KZ connection studied by Cherednik [8], Matsuo [32], Felder and Veselov [15] and others.\n\nRecall that an integrable connection ∇ on an algebraic vector bundle E defines a D-module, that is, a module over differential operators on the base. For the quantum differential equation, this is known as the quantum D-module. The isomorphism class of the D-module determines ∇ up to gauge equivalence; in other words, passing from the quantum connection to the quantum D-module corresponds to forgetting the fact that the quantum connection was defined on the trivial bundle (thus, knowing the quantum D-module alone is not enough in order to recover the quantum multiplication by divisor classes).\n\nIn the Springer case, the quantum D-module coincides with the quantum Calogero-Moser D-module for the Langlands dual group. After providing background, we will give a precise formulation in Section 2.5 and Theorem 3.2. In particular, one can describe the corresponding quantum cohomology ring of T * B by using the corresponding classical Calogero-Moser integrable system. For g = sl n , this was obtained independently by Nekrasov and Shatashvili. A related result is due to A. Negut [40], see below.\n\n1.9. The Kähler moduli space. Let K = T ∨ ⊃ T ∨ be the compactification defined by the fan of Weyl chambers. The connection (14) extends to K as a connection with first-order poles along a normal crossing divisor. In accordance with the mirror symmetry nomenclature, we call K the compactified Kähler moduli space. The expansion (9) is around the point\nq α ∨ 1 = q α ∨ 2 = · · · = 0 ,\nwhere α ∨ i are the simple positive coroots. This is one of the |W |-many T ∨ -fixed points of K. Such points are called the large radius points.\n\nThe Weyl group W acts on both the base and the fiber of ∇ and one easily checks that (15) w\n∇ λ w −1 = ∇ w(λ) , w ∈ W .\nIn fact, this is equivalent to the commutation relations in H t . Note that T ∨ is naturally the base of the multiplicative version of Grothendieck simultaneous resolution for the Langlands dual group G ∨ . In fact, we expect these two families to be equivariant mirrors and hope to elaborate on this point in a future paper.\n\n1.10. Monodromy and derived equivalences. In general, a compactified Kähler moduli space may have large radius points m 1 and m 2 that correspond to nonisomorphic varieties X 1 ∼ = X 2 . One always expects, however, that\nD b (X 1 ) ∼ = D b (X 2 ) .\nand, moreover, that the equivalence should depend on a choice of a path from m 1 to m 2 , thus giving (16) ρ :\nπ 1 (U ) −→ Aut D b (X i )\nfor a certain open U ⊂ K. One further expects that U is the regular locus of ∇ and that there is a nonzero intertwiner between the monodromy of ∇ and the image of ρ in K-theory\nρ K : π 1 (U ) −→ Aut K(X) ⊗ C .\nSee, for example, [22] for an introduction to these ideas. Specializing this to the Springer case, we first use the W -equivariance (15) to descend ∇ to a connection on T ∨ reg /W . The fundamental group of T ∨ reg /W is the affine braid group B W . Bezrukavnikov constructed an action of B W on D b (X) in [2,3], see also the work of Khovanov and Thomas [28] in the case g = sl n . On the K-theory, this braid group action factors trough the affine Hecke algebra action constructed earlier by Kazhdan and Lusztig [27] and Ginzburg [9]. And indeed this precisely matches Cherednik's description of the monodromy, see page 64 in [8] and Sections 2.7 and 3.6 for further discussion.\n\nA parallel result for X = Hilb(C 2 , n) is the subject of [4]. In both cases, monodromy of ∇ is irreducible and isomorphic to ρ K .\n\n1.11. Matching of equivariant parameters. One aspect of the correspondence described in Section 1.10 merits a special discussion, namely the identification of equivariant parameters.\n\nEquivariant K-theory K G (X) ⊗ C is a module over the representation ring\nC[G] G of G while H * G (X, C) is a module over C[g] G where g is the Lie algebra of G.\nAssuming that ∇ depends regularly on a ∈ g, its monodromy is an entire function of a. Hence, to match ρ K with the monodromy of ∇, we need a map\nζ : C[G] G → C an [g] G ,\nwhere C an stands for analytic functions. We claim the only natural choice is\n(17) ζ(f )(a) = f e 2πia .\nThis holds in the Springer case and can be argued in general as follows.\n\nThe simplest autoequivalences of D b (X) are tensor products with line bundles L ∈ Pic(X). These are expected to be compatible with ρ as follows. Let m ∈ K be a large radius point. The intersection of a small neighborhood of m with U has an abelian fundamental group, namely H 2 (X, Z). One requires that (18) ρ(c 1 (L)) = L ⊗ -To see the connection with (17), we treat the purely equivariant classes in H 2 G (X, Z) on the same footing as the geometric ones. For a purely equivariant class, the quantum differential equation is a constant coefficient, in fact, scalar equation. In this case (18) specializes to (17).\n\n1.12. Shift operators. Formula (17) predicts the monodromy is a periodic function of equivariant parameters. For the Springer resolution, this means that for any s ∈ Λ ∨ ⊕Z, we have a a shift operator\nS(s) ∈ End (H * T (X)) ⊗ C(T ∨ ) satisfying ∇(a) S(s) = S(s) ∇(a + s) ,\nwhere a ∈ Lie(G) denotes the equivariant parameters of ∇. And, indeed, such intertwiner may be constructed geometrically as described in Section 6.\n\nThese are the shift operators of Opdam ([43,20]) that played a very significant role in understanding the quantum Calogero-Moser systems.\n\n1.13. The Toda limit. Recall that the parameter t in (13) is the equivariant parameter for the scaling action in the fibers of T * B. It is known and explained in Section 8 that the t → ∞ limit, taken correctly, recovers the quantum cohomology of the base B.\n\nThe analog of H t for B is a certain nil-version H nil generated by x λ for λ ∈ t * and w for w ∈ W . The element x λ still acts on by multiplication by a divisor D B λ , while w are nilpotent in H nil . Precise definitions are given in Section 2.3.\n\nReferring to Sections 7 and 8 for the details of the t → ∞ limit, we state the result. Introduce the following subset R ′ + of the set of R + of positive roots of G. Namely, let α ∈ R + . Denoting by Π the set of simple positive roots, we have an expansion α = β∈Π a β β .\n\nThen α ∈ R ′ + if one of the following conditions is satisfied: (1) α is a long root;\n\n(2) a β = 0 for all long simple roots β. In particular, we see that R + = R ′ + if G is simply laced and that R ′ + contains all simple roots. \nx λ + α∈R ′ + (λ, α ∨ )q α ∨ s α .\nThe quantum cohomology of B has been studied in great detail by many authors, see for example [10,18,29,37,45] for a very incomplete selection of references. In particular, the above formula may be deduced from Theorem 6.4 in [37].\n\n1.14. Generalization to Slodowy slices. To any n in the nilpotent cone N, one associates the Slodowy slice S n ⊂ N, which is a transversal slice to the G-orbit of n in N. This is an affine conical algebraic variety, which has an open smooth symplectic subset (equal to the intersection of S n with the open G-orbit in N). The slice S n is defined uniquely up to conjugation by an element of the centralizer Z n of n in G. Let S n = π −1 (S n ). Then S n is smooth and symplectic; it provides a symplectic resolution of singularities for S n . Note that when n = 0 we have S n = N and S n = T * B.\n\nAccording to [31] and [16] the algebra H t still acts on H * Zn×C * ( S n ). Abusing notation we shall denote the restriction of the class D λ to S n by the same symbol. Then we have Theorem 1.3. Assume that the restriction map H 2 (X, Z) → H 2 ( S n , Z) is an isomorphism. Then the operator of quantum multiplication by D λ in H * Zn×C * ( S n ) is given by the same formula as in Theorem 1.1.\n\nLet us note that the assumption on H 2 in the formulation of Theorem 1.3 is not very restrictive. For example, one can show (cf. the Appendix) that this assumption always holds when G is simply laced.\n\n1.15. Reduction to rank 1. As discussed in section 1.6, one can study quantum cohomology of X in terms of that of generic non-affine deformations X α . In fact, we can further simplify this analysis as follows.\n\nThe symplectic form ω induces a Poisson algebra structure on O X which makes X 0 a Poisson variety with finitely many symplectic leaves, see [24]. Let Z ⊂ X 0 be a symplectic leaf of minimal dimension. If one has an isotrivial fibration X → Z which is a Poisson map, then, since Z is affine, this reduces quantum cohomology of X to that of the fiber X ′ . If one has such a structure for X α , in combination with (12), we can reduce further to the fibers X ′ α / / X α Z α for the simpler varieties X α of X.\n\nIn general, while we may not have a global fibration X → Z, there is a formal result of Kaledin [24] which allows us to write, for z ∈ Z, the formal neighborhood (X 0 ) z as a product of Z z and the formal neighborhood of a lower-dimensional symplectic singularity. It turns out that, for equivariant symplectic resolutions, this formal statement is already sufficient for the reduction step.\n\nWe say that a symplectic resolution X has rank 1 if Z is a point and dim H 2 (X) = 1. The above reduction procedure obviously stops once we reach a rank 1 variety X. Examples of rank 1 varieties are cotangent bundles T * Gr(k, n) of the Grassmannians and also moduli of framed torsion-free sheaves on C 2 . Further examples may be found among Nakajima quiver varieties.\n\nIn the Springer case, only T * P 1 appear as fibers X ′ α -here the formal argument will be unnecessary. Their quantum cohomology is very well understood. Similarly, Nakajima varieties for quivers of finite type lead only to T * Gr(k, n). They will be discussed in forthcoming paper (the corresponding quantum connection should presumably be related to the trigonometric Casimir connection -cf. [46,47]). Similarly, for quiver varieties of affine type one has to understand the the quantum cohomology of the moduli space of framed sheaves on P 2 of arbitrary rank; this is more involved -cf. [35].\n\n1.16. Related work. From our viewpoint, the operators of quantum multiplication form a family (parametrized by q) of maximal abelian subalgebras in a certain geometrically constructed Yangian. Long before geometric representation theory, Yangians appeared in mathematical physics as symmetries of integrable models of quantum mechanics and quantum field theory. The maximal abelian subalgebra there is the algebra of quantum integrals of motion, that is, of the operators commuting with the Hamiltonian. A profound correspondence between quantum integrable systems and supersymmetric gauge theories was discovered by Nekrasov and Shatashvili, see [41]. It connects the two appearances of Yangians and, for example, correctly predicts that the eigenvalues of the operators of quantum multiplication are given by solutions of certain Bethe equations (well-known in quantum integrable systems, but probably quite mysterious to geometers). The integrable and geometric viewpoints are complementary in many ways and, no doubt, will lead to new insights on both sides of the correspondence.\n\nIt is a well-known phenomenon that a particular solution of the quantum differential equation (the so-called J-function) may often be computed as the generating function of integrals of certain cohomology classes over different compactifications of the moduli space of maps P 1 → X. For example for maps to flag varies of g = sl n , one can try to use the so called Laumon moduli space flags of sheaves on P 1 . The corresponding generating function was identified by A. Negut with the eigenfunctions of the quantum Calogero-Moser system [40].\n\nAs a rule, sheaf compactifications admit torus action with isolated fixed points, thus expressing J-functions as a certain multivariate hypergeometric series. The spectrum of the operators of quantum multiplication may be deduced from the semiclassical asymptotics of this solution. This asymptotic behavior is determined by a unique maximal term in the hypergeometric series. The spectrum is thus determined as a solution of a certain finite-dimensional variational problem. It is one of the cornerstones of Nekrasov-Shatashvili theory that this variational problem coincides with the Yang-Yang variational description of Bethe roots. For flag varieties, this can be seen very explicitly.\n\n1.17. Organization of the paper. In Section 2 we review necessary facts about the graded affine Hecke algebra and the corresponding affine KZ connection as well as introduce the graded affine nil-Hecke algebra and the corresponding connection. In Section 3 we review various well-known facts about the cohomology of B and its cotangent bundle and restate our main result in these terms. In Section 4 we discuss equivariant Gromov-Witten invariants and explain general properties of the reduced virtual fundamental class. Once these generalities are in place, we apply them in Section 5 to give an extremely short proof of Theorem 1.1. In Section 6 we explain the geometric construction of the shift operators for the affine KZ connection. In Sections 7 and 8 we study the t → ∞ limit of the above constructions.\n\nFinally, in Section 9 we prove the generalization of Theorem 1.1 to the varieties S n . Part of this work was done when A.B. was visiting the program on \"Algebraic Lie Theory\" at Isaac Newton Mathematical Institute. He would like to thank the program organizers for the invitation and the institute stuff for its hospitality.\n\n\nHecke algebras, connections and integrable systems\n\nIn this section we recall some standard algebraic background about graded affine Hecke algebras and the affine KZ connection. The geometrically-minded reader can skip this section on a first reading.\n\n2.1. The graded affine Hecke algebra. Consider the graded Hecke algebra H t . By definition, it is generated by elements x λ for λ ∈ t * and w ∈ W and a central element t such that a) x λ depends linearly on λ ∈ t * b) x λ x µ = x µ x λ for any λ, µ ∈ t * c) The w's form the Weyl group inside H t ; d) For any i ∈ I, λ ∈ t * we have\ns i x λ − x s i (λ) s i = t(α ∨ i , λ), where s i is the reflection associated with the simple root α i .\nWe define a grading on H t in such a way that deg x λ = 2, deg w = 0, deg t = 2.\n\n2.2. The affine KZ connection. The Dunkl (or affine KZ) connection is a connection on T ∨ reg with values in H t . In other words, given a module M over H t , we may define a connection ∇ on the trivial bundle over T ∨ reg with fiber M . The connection is defined as follows. Any λ ∈ t * defines a vector field on T ∨ and thus on T ∨ reg ; we shall denote by d λ the derivative in the direction of this vector field. In order to define ∇ it is enough to define ∇ λ for every λ ∈ t * , which is given by the following formula:\n(19) ∇ λ = d λ − t α>0 (λ, α ∨ ) q α ∨ 1 − q α ∨ (s α − 1) − x λ\nBy specifying x λ 's to their values at some point in t we get a family of connections on the trivial bundle with fiber M over T ∨ reg , parametrized by t. This connection is known to have regular singularities; moreover, it is clear that it is W -equivariant (with respect to the natural action of W on T ∨ reg and trivial W -action on M ). For the sake of completeness, let us compare our form of the connection ∇ with the connection of [8], (1.1.41). In loc. cit. the author defines a slightly different connection ∇ ′ given by\n∇ ′ λ = d λ − t α>0 (λ, α ∨ ) s α q α ∨ − 1 − x λ . Let δ = α∈R + (q α ∨ − 1).\nThen it is clear that ∇ = δ −t ∇ ′ δ t . In other words, our connection ∇ is obtained from Cherednik's connection ∇ ′ by a simple gauge transformation. As a byproduct of this remark, we see that ∇ is integrable (since the same is known about ∇ ′ ).\n\n2.3. The graded nil-Hecke algebra and the Toda connection. In this subsection we'll be working with the affine nil-Hecke algebra H nil , defined as follows: it is also generated by x λ for every λ ∈ t * and by elements w for w ∈ W satisfying the following relations:\na')x λ x µ = x λ x µ for every λ, µ ∈ t * b') (20) w 1 w 2 = w 1 w 2 if ℓ(w 1 w 2 ) = ℓ(w 1 ) + ℓ(w 2 ) 0 otherwise c') (21) s i x λ − x s i (λ) s i = (α ∨ i , λ)\n. The algebras H t and H nil are related in the following way: let H t denote the C[t −1 ]subalgebra of H t [t −1 ] generated by all the x λ 's and by the elements w = t −ℓ(w) w. Then it is clear that the fiber of H t at t = ∞ is naturally isomorphic to H nil . In other words we get a P 1 -family H P 1 of associative algebras whose restriction to A 1 is isomorphic to H t and whose fiber at t = ∞ is naturally isomorphic to H nil . Informally we can say that H nil is the limit of H t when t → ∞; under this limit the elements x λ go to themselves and the limit of w is equal to w.\n\nLet now M be an H t -module which is free over\nC[t] and let M be an H t -submodule of M [t −1 ] such that M [t] = M [t −1 ].\nIn other words, M defines an extension of M to a sheaf of modules M P 1 over H P 1 . The fiber of M at t = ∞ is an H nil -module which we shall denote by M . In the future such P 1 -families of H P 1 -modules will be of special interest to us. One example of such family is discussed below.\n\n\nSome modules.\n\nHere we would like to describe explicitly some modules over H t and H nil , which we are going to use in the future.\n\nFirst, we define a module M over H nil . As a vector space we have M = Sym(t * ) = O(t). The action of H nil on Sym(t * ) is described as follows: the action of x λ is just given by the multiplication by λ. The action of s i (for a simple reflection s i ) is given by (22) s\ni (f ) = f − f s i α i , where f s i (a) = f (s i (a)). Similarly, we can define a module M t over H t . Namely, we set M t = Sym(t * )[t] = O(t × C)\nas a vector space. The action of H t is defined as follows: the element x λ ∈ H t as before acts by multiplication by λ; t acts in the obvious way. The action of a simple reflection s i ∈ W is defined by\ns i (f (a, t)) = f (a, t) − (f (a, t) − f (s i (a), t))(1 − t α i ).\nIn other words we have\n(23) (1 − s i )f (a, t) = (f (a, t) − f (s i (a), t))(1 − t α i ).\nThe verification of the relations of H t is straightforward. It is also clear that we if we set s i = t −1 s i then lim t→∞ s i is independent of t and is equal to s i . Hence when t → ∞ the action of w = t −ℓ(w) w becomes independent of t and goes to the the action of w on Sym(t * ). In other words, if we set M P 1 to be the trivial bundle over P 1 with fiber Sym(t * ) then M P 1 becomes a sheaf of modules over H P 1 whose restriction to A 1 is M t and whose fiber at ∞ is M.\n\nNote that the action of Sym(t * ) W commutes with the action of H t on M t and with the action of H nil on M. For any ξ ∈ t/W let us denote by C ξ the corresponding one-dimensional module over Sym(t * ) W . Then we set\nM ξ,t = M t ⊗ Sym(t * ) W C ξ ; M ξ = M ⊗ Sym(t * ) W C ξ ,\nwhich are modules over H t and H nil respectively of dimension #W .\n\nOn the other hand, for each a ∈ t let us denote by C a the one-dimensional Sym(t * )module supported at a. We define\nM a,t = H t ⊗ Sym(t * ) C a .\nThese are often called the principal series representations of H t . It is clear that dim M a = #W .\n\nThe same definitions make sense for H nil instead of H t . Namely, for any a ∈ t we define the principal series representation M a of H nil by\nM a = H nil ⊗ Sym(t * ) C a .\nThe following fact is shown in Theorem 1.2.2 of [8] in the case of the algebra H t ; the same proof as in loc. cit. works for H nil .\n\nProposition 2.1.\n\n(1) There are isomorphisms\nM t ≃ H t ⊗ C[W ] C; M ≃ H nil ⊗ C[W ] C,\nwhere by C[W ] ⊂ H nil we mean the span of all the w.\n\nFor generic (a, t) ∈ t × C one has: (2) The modules M a,t and M a are irreducible.  2.5. The Calogero-Moser system. The trigonometric Calogero-Moser (or CM for short) quantum integrable system is an embedding η CM,t of the commutative algebra Sym(t * ) W into the algebra D(T ∨ reg ) of differential operators on T ∨ reg , which depends on a parameter t ∈ C. This embedding is characterized by the following properties: CM1) For any f ∈ Sym(t * ) W the highest symbol of η CM,t (f ) is equal to f ; CM2) Let us choose a non-degenerate W -invariant quadratic form on t * ; let C be the corresponding element of Sym 2 (t * ) W and let ∆ denote the corresponding Laplacian on T ∨ (this is a W -invariant differential operator of order 2 on T ∨ with constant coefficients). Then\nη CM,t (C) = ∆ − t(t − 1) α∈R + (α ∨ , α ∨ ) (q α ∨ /2 − q −α ∨ /2 ) 2 .\nUsing the map η CM,t we may consider\nD(T ∨ reg )[t] as a D(T ∨ reg ) ⊗ Sym(t * ) W [t]-module: here D(T ∨ reg )\nacts by left multiplication and any f ∈ Sym(t * ) W acts by right multiplication by η(f ). We shall call this the Calogero-Moser D-module and denote it by CM t . For any ξ ∈ t/W we denote by CM ξ,t the specialization of CM t to ξ (i.e.\nM ξ,t = M t ⊗ Sym(t * ) W C ξ ).\nOn the other hand, consider O(T ∨ reg ) ⊗ M t . Since Sym(t * ) W acts on M t by endomorphisms of the H t -module structure, by using the connection ∇ we may view it as a\nD(T ∨ reg ) ⊗ Sym(t * ) W [t]-module.\nAccording to Cherednik (cf. [7] or [8] Theorem 1.2.11) and Matsuo [32] we have the following result:\nProposition 2.2. There exists an isomorphism O(T ∨ reg ) ⊗ M t ≃ CM t of D(T ∨ reg ) ⊗ Sym(t * ) W [t]-modules. In particular, for any ξ ∈ t/W there exists an isomorphism O(T ∨ reg ) ⊗ M ξ,t ≃ CM ξ,t of D(T ∨ reg )-modules.\nRemark. In fact, in [32] Theorem 2.2 is proved for generic (a, t) ∈ t for M a,t instead of M a,t . In [8] Theorem 2.2 is proved for M a,t (for any a) and it is easy to see that the proof \"works in families\" (i.e. for M t itself).\n\n2.6. The classical Calogero-Moser system. The quantum Calogero-Moser system has it quasi-classical analog -the classical Calogero-Moser system. This is a C[t]-linear embedding\nη cl CM,t : Sym(t * ) W [t] = C[g] G ֒→ O(T * (T ∨ reg ) × C) = O(T ∨ reg × t)\n[t] whose image consists of Poisson commuting functions and which satisfies obvious analogs of the conditions CM1, CM2.\n\n2.7. The monodromy. Let now H v denote the \"usual\" affine Hecke algebra; by the definition this is a C[v, v −1 ]-algebra, generated by elements X λ for λ ∈ Λ and T w for w ∈ W subject to the well-known relations. In particular, H v is a quotient of the group algebra of C[ B W ] of the affine braid group B W = π 1 (T ∨ reg /W ) associated with the Weyl group W ; also the subalgebra of H v generated by the X λ 's is just C[Λ] which is the same as the algebra of regular functions on T . The subalgebra of H v generated by all the T w is the finite Hecke algebra H ′ v . It is a deformation of the group algebra C[W ] and we shall denote by 1 the corresponding deformation of the trivial C[W ]-module. For any z ∈ T we shall denote by C z the corresponding 1-dimensional module over C[Λ]. Abusing notation, we shall sometimes think about v as an element of C * rather than as a formal variable. Let us set\nM v = H v ⊗ H ′ v 1.\nThe algebra C[Λ] W = O(T /W ) acts on M v on the right (in fact, this algebra is the center of H v and therefore it acts on every H v -module); for any z ∈ T /W we shall denote by M z,v the specialization of M v at z. This is a finite-dimensional H v -module of dimension #W , which is known to be irreducible for generic z.\n\nLet us denote H t − mod f the category of finite-dimensional H t -modules; similarly, let us denote by H v − mod f the category of finite-dimensional H v -modules. Cherednik (cf. e.g. [8], Theorem 1.2.8) shows the following: In other words, one may say that the functor I is provided by the monodromy of the affine KZ connection.\n\n\nAffine Hecke algebras via the Steinberg variety\n\nIn this section, we recall how the algebras H t and H nil appear geometrically and give a more detailed statement of our main result.  1 and b 2 ). We refer the reader to Section 3.3 of [9] for further details about St.\n\n\n3.2.\n\nBorel-Moore homology and Lusztig's construction. Let H G * (St) denote the G-equivariant Borel-Moore homology of St. According to [9] the space is endowed with a natural structure of an associative algebra. Moreover, this algebra acts naturally on H G (T * B) as well as on H * Zn×C * (S n ). According to [31] we have a natural isomorphism 1\n(24) H G * (St) ≃ H t . Under this isomoprhism t corresponds to the generator of H * C * (pt) (note that H G * (St) is a module over H * G (pt)\n). Similarly, one can define an associative algebra structure on H G * (B × B). In this case one has the isomorphism (25) H G * (B × B) ≃ H nil . The construction of the above isomorphism. Let us just note (cf. [9]) that the algebra H * G (St) acts naturally on H G (T * B) (and more generally on H * Zn×C * ( S n ) for any n ∈ N) and the algebra H G * (B × B) acts on H * G (B).\n\n\n3.3.\n\nExplicit construction: geometry. The isomorphism (24) can be described as follows. Namely, according to [31], Section 4, the element x λ ∈ H t corresponds just to the push-forward of the class D λ under the diagonal embedding T * B ֒→ St. In particular, the action of x λ on H * G (T * B) (or, more generally, on H * Zn×C * ( S n )) is given by multiplication by D λ . The description of the image of W in H G * (St) is more involved; however one can still describe explicitly the image of a simple reflection s i ∈ W (cf. [31], Section 3). Let us recall this construction.\n\nFirst of all, for each vertex i of the Dynkin diagram of G let P i the corresponding sub-minimal 2 parabolic and let P i = G/P i be the variety parametrizing all subgroups of G which are conjugate to P i . We have the natural projection p i :  (1) The operator of quantum multiplication by D λ in H * G (T * B) is equal to\nB → P i which is a locally trivial G-equivariant P 1 -fibration. Let Y i = B × P i B. Then Y i isx λ + t α ∨ ∈R ∨ + (λ, α ∨ ) q α ∨ 1 − q α ∨ (s α − 1),\nwhere the action of H t on H * G (T * B) is the one described above.\n\n(2) The G-equivariant quantum connection of T * B is given by Equation 33. (4) The G-equivariant quantum cohomology ring of T * B is isomorphic to the ring of functions on\nT * (T ∨ reg ) × A 1 = T ∨ reg × t × A 1 , where the embedding H * G (pt) = C[g] G = Sym(t * ) W [t] ֒→ O(T * (T ∨ reg ) × A 1 )\nis given by the classical Calogero-Moser map η cl CM,t . The proof of the first assertion of Theorem 3.2 occupies the next two Sections. Theorem 3.2(2) is just a reformulation of Theorem 3.2(1). Theorem 3.2(3) follows from Theorem 3.2(2) by Proposition 2.2 and Proposition 3.1. Part 3.2(4) was also known to Nekrasov and Shatashvili [41] for G = SL(n); in the general case it follows easily from Theorem 3.2(3).\n\n3.6. Monodromy and derived equivalences. The isomorphism (24) has an analog in K-theory (in fact, historically, it was discovered before (24)). Namely, for a Gscheme Y let us denote by let K G (Y ) = K 0 (Coh G (Y )) ⊗ C the Grothendieck group of the category Coh G (Y ) of G-equivariant coherent sheaves on Y . Then K G (St) has a natural structure of an associative algebra (defined by convolution) which acts on K G (T * B). Then we have: Proposition 3.3. [27,9] (1) There exists a natural isomorphism\nK G (St) ≃ H v . (2) K G (T * B) is isomorphic to M v as a K G (St) = H v -module.\nSince H v is a quotient of the group algebra of the corresponding affine braid group B W , Proposition 3.3 provides an action of B W on K G (St). This action is categorified in [3]. Namely, in loc. cit. the authors construct an action of B W on the derived category D b (Coh G (St)), which descends to the above action of B W on the K-theory. Thus, via Proposition 2.3, Proposition 3.1 and Theorem 3.2(2), we can verify the relation between monodromy of the quantum connection and derived auto-equivalences in our situation, as discussed in section 1.10.\n\n\nPreliminaries on Gromov-Witten invariants\n\nIn this section, we review some definitions from Gromov-Witten theory and sketch the basic properties of the reduced virtual class. The latter is a technical construction responsible for many of the nice qualitative properties discussed in the introduction. Proofs and more detailed discussion of the results here can be found in [42,36] In the above expression, the integrand is the virtual class on the moduli space of n-pointed stable maps to X, which has expected dimension −K X · β + dim X + n − 3 = 2 dim B + n − 3, and the map ev k is the evaluation map associated to the k-th marked point on the domain curve.\n\nThe moduli space of maps is typically noncompact; however there is still a welldefined pushforward morphism H * G,c (M 0,n (X, β)) → H * G (pt) (here H * G,c stands for the corresponding equivariant cohomology with compact support). On the other hand, we have the map H * G,c (M 0,n (X, β)) → H * G (M 0,n (X, β)). This is a map of H * G -modules, which becomes an isomorphism once we tensor everything with the field of fractions of H * G (pt), provided thatthe T-fixed locus is compact. Thus we get a well-defined integration on H * G (M 0,n (X, β) which takes values in the field of fractions of H * G (pt). Explicitly, this integral can be defined using virtual localization.\n\nWe further observe that for β = 0,\nγ 1 , D λ , γ 2 X 0,3,β = (D λ · β) γ 1 , γ 2\nX 0,2,β , by the divisor equation. As a result, in order to understand the non-classical contribution to divisor operators, it suffices to study the two-point invariants of X.\n\n\n4.2.\n\nReduced class. Given a variety V with an everywhere-nondegenerate holomorphic symplectic form ω, it is well-known that the usual non-equivariant virtual fundamental class on M g,n (V, β) vanishes for β = 0. However, one can correct this phenomenon by modifying the standard obstruction theory so that the virtual dimension is increased by 1.\n\nWe explain this modification for the deformation theory of maps from a fixed nodal curve C; applying this construction relative to the moduli stack of nodal curves gives the construction in general. Let M C (V, β) denote the moduli space of maps from C to V with target homology class 0 = β ∈ H 2 (V, Z). The standard obstruction theory for M C (V, β) is defined by the natural morphism (26) Rπ\n* (ev * T V ) ∨ → L M C ,\nwhere L M C denotes the cotangent complex of M C (V, β) and\nev : C × M C (V, β) → V, π : C × M C (V, β) → M C (V, β).\nare the evaluation and projection maps.\n\nLet ω π denote the relative dualizing sheaf. There is a map\nev * (T V ) → ω π ⊗ (Cω) * ,\ninduced by the pairing with the symplectic form and pullback of differentials. This, in turn, yields a map of complexes\nRπ * (ω π ) ∨ ⊗ Cω → Rπ * (ev * (T V ) ∨ )\nand the truncation\nι : τ ≤−1 Rπ * (ω π ) ∨ ⊗ Cω → Rπ * (ev * (T V ) ∨ ).\nThe truncation is a trivial line bundle, although will carry a nontrivial weight in the equivariant setting if the group action acts by a nontrivial character on ω.\n\nThere is an induced map\n(27) C(ι) → L M C\nwhere C(ι) is the mapping cone associated to ι. Moreover, this map (27) satisfies the necessary properties of a perfect obstruction theory. This is known as the reduced obstruction theory and defines the reduced virtual fundamental class associated to V .\n\n\n4.3.\n\nOne-parameter families. Another characterization of reduced virtual classes is given in [36] in terms of one-parameter deformations of the holomorphic symplectic variety V . Suppose we are in the following situation: There is a smooth map π : V → B where B is a smooth curve, such that π is topologically trivial as a fibration and V is equipped with a fiber-wise holomorphic symplectic form. There is a point b ∈ B such that V = V b . Furthermore, assume that we have a class β ∈ H 2 (V, Z) ⊂ H 2 (V, Z) satisfying the following conditions:\n\n• The fiber V is the unique fiber of π for which the class β is represented by an effective curve. • The composition\n(28) T B,b → H 1 (V, T V ) ∼ − → H 1 (V, Ω V ) β∪ − − → C\nis an isomorphism.\n\nIn the above diagram, the first map is the Kodaira-Spencer map, the second map is the isomorphism induced by the holomorphic symplectic form on V , and the last map is given by cup product with the curve class β.\n\nThe following result is proven in Theorem 1 of [36] Proposition 4.1. Given the above hypotheses, the embedding\nM 0,n (V, β) → M 0,n (V, β)\nis an isomorphism of stacks and we have an equality of virtual classes\n[M 0,n (V, β)] red = [M 0,n (V, β)] vir ,\nwhere the right-hand side is just the usual virtual fundamental class associated to V.\n\nThis statement can be easily generalized in many directions. If we have a fiber-wise group action of T on V, then the above equality holds for T -equivariant virtual classes. If there are finitely many points on B for which β is effective and infinitesimally rigid in the sense of equation (28), the statement generalizes in the obvious way where the left-hand side involves a summation over these points.\n\n\nProof of Theorem 1.1\n\nWe now use the results of the last section to give a short proof of Theorem 1.1.\n\n\nLagrangian correspondences.\n\nWe first apply the results of section 4.2 to our situation. Since the holomorphic symplectic form on X has equivariant weight −t with respect to G, the construction there extends to the equivariant setting. In particular, the reduced obstruction theory produces a cycle class\n[M 0,2 (X, β)] red ∈ H BM,G 2 dim X (M 0,2 (X, β) for β = 0 such that [M 0,2 (X, β)] vir = t · [M 0,2 (X, β)] red .\nThis equality explains the factor of t in front of the nonclassical contribution to Theorem 1.1.\n\nRecall the Springer map f : X → N.\n\nSince N is affine, any proper curve on X is contained in a fiber of f , and the evaluation map to X × X factors through the Steinberg variety\nφ : M 0,2 (X, β) → St = X × N X.\nThe resolution X → N is semismall, so the irreducible components Z k of X × N X all have dimension dim X. In particular, we immediately have the following elementary but crucial lemma.\n\nLemma 5.1.\n(29) φ * [M 0,2 (X, β)] red = a k [Z k ] ∈ H BM,G 2 dim X (X × N X), where a k ∈ Q are nonequivariant constants.\nProof. This follows immediately from dimension constraints, since we are working with non-localized coefficients.\n\nSince the correspondence operators defined by [Z k ] give the action of Z[W ] on the cohomology of X, this explains why the non-classical contribution to D λ is expressed in terms of Weyl group operators. To complete the proof of Theorem 1.1, it remains to match the coefficients a k with the predicted answer. Since these coefficients are rational numbers, they are unaffected by specializing to t = 0. Therefore, we only need to compute the left hand side of equation 29 in G-equivariant cohomology.\n\n\nSimultaneous resolution.\n\nWe now apply section 4.3 to rephrase reduced invariants in terms of one-parameter deformations of X; here it is important that we are only working G-equivariantly.\n\nWe obtain such deformations using the Grothendieck resolution of section 1.2:\nφ : X → t * .\nRecall that the fiber over the origin is X and that there is a fiber-preserving G-action which cannot be extended to a fiber-preserving G-action. In general, for z ∈ t * , the monoid of effective curve classes in the fiber φ −1 (z) is given by\nEff(φ −1 (z)) = Span{α ∨ |α ∈ ∆ + , (α ∨ , z) = 0}.\nConsider a generic linear subspace φ 0 : A 1 → t, chosen to intersect each hyperplane transversely exactly once at the origin; via pullback, we have a smooth map V 0 → A 1 whose fiber over the origin is X.  We now deform the variety V 0 and apply deformation invariance, following the approach in [6,33]. Let D = A 1 and consider a family of maps φ t : A 1 → t, t ∈ D, so that for t = 0 we recover φ 0 and for any t = 0 sufficiently near 0, the image of φ t intersects each hyperplane H α transversely at distinct points. We fix t = 0 with this property, and let z α be the distinct intersection points of φ t with H α . The associated smooth family V t will again satisfy the conditions of section 4.3 at each of these intersection points. Vs 0,2,β , for s = 0 and s = t respectively. These are equal by deformation invariance of the standard virtual class construction applied to the family V → D. Although the associated moduli space of maps relative to D M 0,2 (V/D, β) → D is not proper over D, it admits a fiberwise T -action whose fixed loci are proper over D, and the results from [1] can be applied.\n\nThe arguments in these two sections apply without change to the general setting of the introduction, as discussed in section 1.6. In particular, we see that the nonclassical terms of divisor operators lie in the subalgebras associated to primitive coroots. 5.3. Actual calculation. Lemma 5.3 reduces the argument to understanding the codimension one fibers of the simultaneous resolution. These have the following description. Consider a general point z ∈ H α for α ∈ ∆ + and let M z denote its centralizer in G; it is easy to see that M z fits into an exact sequence with its center Z(M z ):\n1 → Z(M z ) → M z → PGL(2) → 1.\nThis sequence induces an action of M z on T * P 1 ; the fiber X z is\nX z = G × Mz T * P 1 ,\nand this identification is compatible with the G-action. This description shows that X z is a fiber bundle over the affine variety A z = G/M z with fiber T * P 1 ; in particular, we see the effective curves are multiples of the zero-section of the fiber, in class α ∨ . Let Y z denote the affinization of X z , which is just the contraction of this class.\n\nAs in the proof of Lemma 5.1, evaluation on the moduli space of maps factors through the Steinberg construction:\nφ : M 0,2 (X z , β) → X z × Yz X z = X z ∪ W z where W z is a P 1 × P 1 -bundle over A z . Lemma 5.4. φ * [M 0,2 (X z , dα ∨ )] red = 1 d [W z ]\nProof. Let M 0,2 (X z /A z , β) denote the moduli space of stable maps to X z relative to A z , parametrizing a point a ∈ A z and a stable map to the fiber over a. Since the map X z → A z is smooth, this moduli space admits a perfect obstruction theory relative to the map to A z . Furthermore, since we have a fiberwise holomorphic symplectic form on X z , we can construct the reduced obstruction theory relative to A z and the associated reduced virtual class [M 0,2 (X z /A z , β)] red . We first claim that\n[M 0,2 (X z , β)] red = [M 0,2 (X z /A z , β)] red .\nThis follows from a comparison of obstruction theories. First, for standard virtual classes, there is a map of obstruction spaces associated to maps from a fixed curve C\nH 1 (C, f * T Xz/Az ) → H 1 (C, f * T Xz ).\nWhen C is a rational curve, this is an isomorphism. For reduced classes, we need this map to be compatible with the one-dimensional quotient arising from the holomorphic symplectic form (fiberwise, in the case of X z /A z ). This follows from the fact that the holomorphic symplectic form on fibers of X z /A z are the restrictions of the form on X z .\n\nAs in Lemma 5.1, dimension constraints imply that\nφ * [M 0,2 (X z , dα ∨ )] red = c 1 [X z ] + c 2 [W z ],\nfor c 1 , c 2 ∈ Q.\n\nWe can calculate the coefficients c 1 , c 2 after restricting to a fiber of X z → A z . More precisely, if we pick a point ι : a → A z ,\nφ * [M 0,2 (T * P 1 , d)] red = φ * ι ! [M 0,2 (X z , dα ∨ )] red = ι ! φ * [M 0,2 (X z , dα ∨ )] red = c 1 [T * P 1 ] + c 2 [P 1 × P 1 ].\nThese coefficients are thus determined from the case G = SL 2 , where Theorem 1.1 has already been established in this case ( [5], [33]). The action of the cycle [P 1 × P 1 ] is the operator s − 1 on H * (T * P 1 , C), so we see that c 1 = 0 and c 2 = 1/d.\n\nThe proof of Theorem 1.1 now follows from the following result at the end of section 3.3.\n\n\nLemma 5.5.\n\n[W z ] = s α − 1\n\n\nShift operators\n\nWe now explain the geometric construction of the shift operators, discussed in section 1.12, that intertwine the monodromy representation of the quantum connection for different values of the equivariant parameters.\n\nLet us choose an integral parameter s ∈ Λ ∨ ⊕ Z. We can associate to s a principal T-bundle over P 1 P (s) = (T × (C 2 \\{0})/C * , where C * acts on T via the 1-parameter subgroup defined by s. Let X(s) = P (s) × T X → P 1 be the associated fibration over P 1 with fiber X. There exists a unique lifting of the C * action on P 1 to an action on X(s) so that the fiber X(s) 0 of 0 ∈ P 1 is fixed pointwise by the action, giving an action of T = T × C * on X(s). Let z denote the equivariant parameter associated to the extra torus factor.\n\nGiven a weight λ ∈ Λ, there is again an associated equivariant line bundle D λ,s on X(s), compatible with restriction to fibers. Given β ∈ H 2 (X(s), Z), we can use these line bundles to assign a natural monomial function q β on the dual torus T ∨ .\n\nWe will only consider curve classes β ∈ H 2 (X(s), Z) such that π * β = [P 1 ], and the corresponding moduli spaces of stable maps M 0,2 (X(s), β).\n\nLet ι 0 , ι ∞ : X ֒→ X(s) denote the inclusions of the fiber over 0 and ∞ respectively. Given γ 1 , γ 2 ∈ H * T (X), the two-pointed Gromov-Witten invariant\nγ 1 , γ 2 X(s) 0,2,β = [M 0,2 (X(s),β)] vir ev * 1 (ι 0, * γ 1 ) ∪ ev * 2 (ι ∞, * γ 2 ) ∈ FracH * T (X).\nIn order to make sense of the above expression, for each fiber over 0 and ∞, we use the identification H * T (X) = H * T (X) ⊗ C[z] to lift γ 1 and γ 2 to T-equivariant cohomology. The corresponding shift operator\nS(s) ∈ End (H * T (X)) ⊗ C[[Λ]]\nis then defined via the pairing\nγ 1 |S(s)|γ 2 = β∈H 2 (X(s),Z) π * β=[P 1 ] q β γ 1 , γ 2 X(s) 0,2,β | z=1 .\nThe intertwiner property of S(s) can be seen as follows. We first describe the contribution of the residues associated to classical multiplication. Given x ∈ X T associated to the Weyl group element w x ∈ W , let φ x = (w x , 0) : t * → t * ⊕ C = (Lie(T)) * denote the associated linear map, which we can view as a multi-valued function on T ∨ , depending on a parameter a ∈ Lie(T). We define the operator q M on H * T (X) which is diagonal in the fixed-point basis, with diagonal entries given by the function φ x .\n\nIn the neighborhood of the base point\nq α ∨ 1 = q α ∨ 2 = · · · = 0,\nthere exists a unique fundamental solution of the quantum differential equation, normalized to have the form\nΨ(q, a) = q M (Id + O(q α ∨ i )).\nHere, we have made explicit the dependence of Ψ on the equivariant parameters a ∈ Lie(T). There exists a geometric expression for Ψ(q, a) in terms of descendent invariants (see, for example, [11]). We also define the operator ∆(s) on H * T (X), so that it is diagonal in the fixed-point basis, with diagonal entries given by the ratio ∆(s) p,p = tangent weights ρ at x∈X Γ(ρ + s(ρ)) Γ(ρ + 1) .\n\nIt follows from equivariant localization with respect to T that S(s) can be factored in terms of the fundamental solution and ∆. From here, we see immediately that the operators S(s) satisfy the following intertwiner and composition identities:\n∇(a) S(s) = S(s) ∇(a + s)(31)S(s 1 + s 2 ) = S(s 1 ) • S(s 2 )| a=a+s 1(32)\nIn order to compare the monodromy representation after integral parameter shifts a → a + s, we use the following proposition. Proof. We will only sketch the proof here. In the case of Hilb(C 2 ) and higher-rank framed sheaves, a version of this argument can be found in [34] and [35]. We refer the reader to these papers for a more detailed exposition. Using the composition identity for S(s), it suffices to prove the proposition for\ns = (δ, 0), (0, 1) ∈ Λ ∨ ⊕ Z,\nwhere δ is a fundamental weight of T ∨ . The virtual dimension of the moduli spaces M 0,0 (X(s), β) are, respectively, 2 dim B and dim B.\n\nIn the first case, if we choose insertions over 0 and ∞ from a basis of Schubert conormal Lagrangians in X, the relevant two-point invariants will be degree 0. Moreover, there exists a choice of basis for which the space of stable maps meeting these cycles is proper. As a consequence, the associated matrix entries are degree 0 equivariant polynomials, thus constant. If we specialize to t = 0, we can deform X(s) so that it has affine fibers, and only sections of π contribute. In particular, the answer can be calculated directly (e.g. using the case of B = P 1 ).\n\nThe second case is more involved. We consider the subspace V of vectors v ∈ H T (X) ⊗ C(T ∨ ) for which S(s)v has rational function entries. We require two claims about V :\n\n• V contains the identity element 1 ∈ H * T (X) • V is closed under application of the differential operators ∇ λ .\n\nThe first claim follows again via equivariant specialization. By construction, M 0,2 (X(s), β) is proper -any section of X(s) → P 1 is forced to lie inside B × P 1 . Therefore, when expressed in a basis of Schubert conormals, every entry in S(s) • 1 is a nonequivariant constant, so the claim can be checked after setting t = 0. If we apply virtual localization, we require the specialization of the fundamental solution of the quantum connection when t = 0, 1. However, it follows from the form of the Calogero-Moser system given in section 2.5 that the connection becomes essentially trivial at these values, yielding the result. The second claim follows immediately from the intertwiner property. Since classical cohomology is generated by divisors, we then conclude from these two claims that V = H T (X) ⊗ C(T ∨ ). Corollary 6.2. For a ∈ Lie(T) away from a discriminant locus (depending on s), the monodromy representation of the quantum differential equation ∇(a) is isomorphic to the monodromy representation for ∇(a + s) Notice that the intertwiners S(s) may have acquire singularities as a function of a, accounting for the discriminant locus in the statement of the corollary. It follows from irreducibility of the monodromy representation that the geometric intertwiners agree with the Opdam shift operators, up to a global equivariant constant.\n\nIf we consider a general equivariant symplectic resolution as in section 1.1, we expect analogous statements to hold; however the arguments given here only partially extend. While the definition of the geometric intertwiner is completely formal, one needs to check that the proof in Proposition 6.1 holds in any given geometry. In particular, the simplification of the quantum connection for t = 1 and the generation of the quantum ring by divisors are the key statements that need to be established.\n\n\nThe limit t → ∞: algebra\n\nThe purpose of the next two sections is to explain how Theorem 1.1 allows us to compute the quantum cohomology of B.\n\n7.1. The connection ∇. Similarly to the affine KZ connection ∇ we can define the Toda connection ∇, which is a connection on T ∨ with values in H nil . More precisely, given a module M over H nil we have a connection on the trivial bundle over T ∨ with fiber M over T ∨ defined as follows. First, let us recall the subset R ′ + of R + defined in section 1.13. Then we define\n(33) ∇ λ = d λ − α∈R ′ + (λ, α ∨ )q α ∨ s α − x λ .\nWe are going to show that ∇ is integrable a little later. We shall refer to ∇ as the Toda connection; the reason for this name is explained in section 7.2. We now claim that under the above circumstances the connection ∇ is \"the limit of ∇ as t → ∞\" in the appropriate sense. More precisely, we have the following\nProposition 7.1. The limit lim t→∞ t 2ρ ∇ t −2ρ\nexists and is equal to ∇ (which is a connection on T ∨ with values in the trivial bundle with fiber M ). In other words, ∇ is the t → ∞-limit of ∇ if we make the change of variables q → t −2ρ q.\n\nRemark. Note that the singularities of the connection ∇ on T ∨ disappear when t → ∞; however one can check that in general the connection ∇ will have irregular singularities at ∞. Also, the W -equivariance of ∇ is lost under the above limit procedure (this has to do with the fact that our change of variables q → t −2ρ q is not W -equivariant).\n\nProof. ¿From equation 19 and from the definition of w we get\nt 2ρ ∇ λ t −2ρ = d λ + α>0 t −(2ρ,α ∨ )+1 q α ∨ 1 − t −(2ρ,α ∨ ) q α ∨ (1 − t ℓ(sα) s α ) + x λ .\nThus, in order to prove Proposition 7.1, it is enough to check the validity of the following Lemma 7.2.\n\n(1) For any α ∈ R + we have\nℓ(s α ) ≤ (2ρ, α ∨ ) − 1.\n(2) The above inequality is an equality if and only if α ∈ R ′ + . Proof. This lemma is essentially proved in Section 1 of [23]. More precisely, it is shown in [23](Lemma 1.3) that ℓ(s α ) ≤ (2ρ, α ∨ )−1 when α is long and that ℓ(s α ) = (2ρ ∨ , α)−1 when α is short. Thus it is enough to show that for any short positive root α we have (34) (\nρ ∨ , α) ≤ (ρ, α ∨ ),\nwhere the equality holds if and only if α ∈ R ′ + . Note that if α is short, then α ∨ is long. Let Π ∨ lg denote the set of simple long coroots and let Π ∨ sh denote the set of simple short coroots. Let\nα ∨ = β ∨ ∈Π ∨ lg a β β ∨ + γ ∨ ∈Π ∨ sh a γ γ ∨ .\nLet us choose a W -invariant inner product on t * satisfying (α, α) = 1 for every short root α and set r = max α∈R + (α, α).\n\nThen we have (ρ, α ∨ ) = a β + a γ and according to Section 1.2 of [23] we have\n(ρ ∨ , α) = β ∨ ∈Π ∨ lg a β + 1 r γ ∨ ∈Π ∨ sh a γ ,\nwhich implies (34).\n\nCorollary 7.3. The connection ∇ is integrable.\n\nProof. This follows immediately from Proposition 7.1 and from the fact that ∇ is integrable.\n\n7.2. The Toda system. Similarly to section 2.5 one can define the quantum Toda integrable system, which is now a map η T : Sym(t * ) W → D(T ∨ ). The map η T is characterized by the following properties:\n\nT1) For any f ∈ Sym(t * ) W the highest symbol of η T (f ) is equal to f ; T2) For any non-degenerate W -invariant quadratic form on t * as above one has\nη T (C) = ∆ − α∈Π (α ∨ , α ∨ )q α ∨ .\nIt is known (cf. Section 7 of [14]) that for any f ∈ Sym(t * ) W one has\n(35) lim t→∞ t 2ρ η CM,t (f )t −2ρ = η T (f ).\nUsing the map η T we may view D(T ∨ ) as a D(T ∨ ) ⊗ Sym(t * ) W -module, which we shall denote by T. We shall call T the Toda D-module.\n\nWe now want to present an analog of Theorem 2.2 in the case when the Calogero-Moser system is replaced by the Toda system. Namely, by using the connection ∇ we may view O(T ∨ ) ⊗ M as a D(T ∨ ) ⊗ Sym(t * ) W -module. We now claim the following analog of the Cherednik-Matsuo theorem for the Toda lattice: \nO(T ∨ ) ⊗ M ≃ T of D(T ∨ ) ⊗ Sym(t * ) W -modules.\nRemark. It is tempting to say that Theorem 7.4 follows from Theorem 2.2 by taking t → ∞ limit and using Proposition 7.1 together with (35). However, a priori it is not clear why the limiting procedure in Proposition 7.1 is the same as in (35). Hence we are going to give an independent proof of Theorem 7.4.\n\nProof. Let us define a map ι :\nT = D(T ∨ ) → O(T ∨ )⊗ M = O(T ∨ )⊗ Sym(t * ) which send every d ∈ D(T ∨ ) to d(1⊗1) (let us recall that the action of D(T ∨ ) on O(T ∨ )⊗Sym(t * ) W is given by ∇).\nLemma 7.5. The map ι is an isomorphism of vector spaces.\n\nProof. The module T = D(T ∨ ) is endowed with a natural filtration by order of a differential operator. Similarly, O(T ∨ ) ⊗ Sym(t * ) is endowed with a filtration coming from the natural filtration on Sym(t * ) (by degree of a polynomial). From the definition of ι it is clear, that it is compatible with the above filtration it defines between the associated graded spaces. This shows that ι is an isomorphism itself.\n\nOn the other hand, it is obvious that ι is a morphism of D(T ∨ )-modules. Hence, in order to prove Theorem 7.4 it is enough to verify that it is a morphism of Sym(t * ) Wmodules. We claim that it is enough to check this for quadratic elements of Sym(t * ) W . Indeed, applying ι −1 to the action of Sym(t * ) W on O(T ∨ ) ⊗ Sym(t * ) we get an action of Sym(t * ) W on T = D(T ∨ ); this action commutes with the left D(T ∨ )-action and thus comes from a homomorphism η ′ : Sym(t * ) W → D(T ∨ ). We need to show that η ′ = η T . However, η ′ obviously satisfies property T1. Thus in order to show property the equality η ′ = η T we need to check that η ′ satisfies T2, which exactly means that ι commutes with quadratic elements in Sym(t * ) W .\n\nThus we are reduced to checking that for any C as in T2 we have\n(36) η(C)(1 ⊗ 1) = 1 ⊗ C.\nLet λ 1 , · · · , λ ℓ be a basis of t * and let µ 1 , · · · , µ ℓ be the dual basis with respect to the quadratic form corresponding to C. Then ∇ λ i (1 ⊗ 1) = −1 ⊗ λ i . Thus\n∆(1 ⊗ 1) = ℓ i=1 ∇ µ i ∇ λ i (1 ⊗ 1) = − ℓ i=1 ∇ µ i (1 ⊗ λ i ) = ℓ i=1 (1 ⊗ µ i λ i + α∈R ′ + (µ i , α ∨ )q α ∨ (1 ⊗ s α (λ i ))) = 1 ⊗ C + α∈R ′ + q α ∨ ℓ i=1 (µ i , α ∨ )(1 ⊗ s α (λ i ))\nNote that s α (λ i ) = 0 if α is not a simple root; for α ∈ Π we have s α (λ i ) = (λ i , α ∨ ). Thus\nα∈R ′ + ℓ i=1 (µ i , α ∨ )(q α ∨ ⊗ s α (λ i )) = α∈Π q α ∨ ℓ i=1 (µ i , α ∨ )(λ i , α ∨ ) = α∈Π (α ∨ , α ∨ )q α ∨ (1 ⊗ 1),\nwhich implies (36).\n\n\nThe limit t → ∞: geometry\n\nIn this section we explain how we can recover the quantum cohomology of B by studying the t → ∞ limit of the quantum cohomology of X = T * B. Using the projection π : X → B, we can identify\nH * T (X, C) = H * T (B, C)[t]\n, and view the divisor operators D X λ as acting on the latter space:\nD X λ (t, q) ∈ End(H * T (B, C))[t][[q β ]]. Let D X λ (t, t −c 1 q) be the operators obtained by the substitution q β → t −c 1 (B)·β q β .\nWe want to compare these operators with the divisor operators D B λ (q) arising from the quantum cohomology of B; since the T-action on B factors through T , there is no t-dependence here.\nProposition 8.1. D B λ (q) = lim t→∞ D X λ (t, t −c 1 q).\nProof. Matrix elements of D X λ are obtained from invariants of the form as stacks, equipped with two different obstruction theories.\nγ 1 · [B], D λ , γ 2 X 0,3,β , where γ 1 , γ 2 ∈ H * T (B\nConsider the universal family\nC f / / π B M 0,3 (B, β) σ 1 I I\nwhere σ 1 is the section associated to the first marked point, with image Σ 1 ⊂ C. We can define a sheaf K on C by the short exact sequence\n0 → K → f * T * B → f * T * B| Σ 1 → 0,\nwhere the second map is the restriction map. It is easy to see that R 0 π * K = 0 and that E = R 1 π * K is a T-equivariant vector bundle on M 0,3 (B, β) with rank c 1 (B) · β.\n\nThe relative obstruction theories are then related by the triangle\nE ∨ [1] → E M (X,p 1 ,β)/M 0,3 → E M (B,β)/M 0,3 , and we have [M 0,3 (X, p 1 , β)] vir = c t (E) ∩ [M 0,3 (B, β)] vir where c t (E) = t rk(E) + c 1 (E)t rk(E)−1 + · · · + c rk(E) (E)\nis the T-equivariant Euler class. This yields\nγ 1 · [B], D λ , γ 2 X 0,3,β = c t (E), γ 1 , D λ , γ 2 B 0,3,β .\nIf we want to recover the term corresponding to the operator D B λ , we can weight this invariant by t −rk(E) = t −c 1 (B)·β and take the limit as t → ∞. This same argument works for all multiplication operators.\n\nLet us now recall that c 1 (B) = −2ρ. Combining this with Proposition 8.1, Proposition 7.1, and Theorem 7.4 we obtain a new proof of the following result:\nTheorem 8.2.\n(1) The operator of quantum multiplication by D λ in H * G (B) is equal to\nx λ + α∈R ′ + (λ, α ∨ )q α ∨ s α .\nHere x λ is the classical multiplication by D λ .\n\n(2) The G-equivariant quantum connection of B is given by Equation 33. These statements are already well-known in the literature The first follows from Theorem 6.4 in [37]. The second statement is of course just a reformulation of the first, and the third statement follows from the main result of [29], although via a different argument.\n\n\nSlodowy slices\n\nIn this section, we prove Theorem 1.3. Given n ∈ N, we can associate an sl 2 -triple (e = n, h, f ) and consider the affine subspace v n = {n + Keradf } ⊂ t. The Slodowy slice resolution S n is a local complete intersection subvariety of X defined by the Cartesian diagram\n(37) S n ι / / g ′ X g v n ι / / t\nLet T ′ ⊂ T be the subtorus which preserves S n . Assume the natural map H 2 ( S n , Z) → H 2 (X, Z) is an isomorphism. Given β ∈ H 2 ( S n , Z), since v n and t are affine, the moduli space of stable maps M 0,2 ( S n , β) fits in the Cartesian diagram\nM 0,2 ( S n , β) ι / / h M 0,2 (X, β) h v n ι / / t\nIn order to prove Theorem 1.3, we will show the following. Proof. As in section 4.2, we will prove the analogous statement for the moduli space M C ( S n , β) of maps from a fixed genus 0 nodal curve C; the full statement will then follow by applying this statement relative to the moduli stack of nodal curves.\n\nIn order to prove the pullback of virtual classes, it is sufficient to prove that the obstruction theories on M C ( S n , β) and M C (X, β) are compatible in the sense of Theorem 5.10 of [1]. To show this, we need to construct a morphism of exact triangles Here, the bottom row is the standard triangle associated to the cotangent complex of a morphism, and the vertical maps are the data of an obstruction theory. The top row will be induced by the short exact sequence (38) 0 → T Sn → ι * T X → g * N vn/t → 0.\nι * E M C (X,β) φ / / E M C ( Sn,β) ψ / / h * L vn/t χ ι * E M C (X,β) [1]\nTo see this, recall that, in the notation of section 4.2, we have\nE M C (V,β) = Rπ * (ev * T V ) ∨\nfor V = X and S n . So if we apply Rπ * (ev * (−) ∨ to the sequence (38) we get the triangle\nι * E M C (X,β) → E M C ( Sn,β) → Rπ * (ev * g * N vn/t ) ∨ [1] → ι * E M C (X,β) [1].\nSince the genus of C is 0, we have Rπ * (ev * g * N vn/t ) ∨ [1] = h * L vn/t , and the maps obviously commute with the vertical maps associated to each obstruction theory.\n\nSince the obstruction theories associated to X and S n are compatible, Theorem 5.10 in [1] then immediately gives an isomorphism of virtual classes after pullback.\n\nWe use this proposition to give a short proof of Theorem 1.3.\n\nProof. As in the proof of Theorem 1.1, the identification of classical multiplication by D λ follows from the definition of the Hecke algebra action on H * T ′ ( S n ). For the nonclassical terms, it suffices to calculate the two-point Gromov-Witten invariants of S n . Consider the Cartesian diagram induced by the evaluation maps to the Steinberg variety:\nM 0,2 ( S n , β) ι / / φ M 0,2 (X, β) φ S n × Sn S n ι / / X × N X\nThe action of the Hecke algebra H t on H * T ′ ( S n ) is induced by the pullback map ι * : H * T ′ (X × N X) → H * T ′ ( S n × Sn S n ). Since Theorem 1.1 identifies the action of the operator given by φ * [M 0,2 (X, β)] vir , the corresponding result for S n follows from the equality φ * [M 0,2 ( S n , β)] vir = φ * ι ! [M 0,2 (X, β)] vir = ι * (φ * [M 0,2 (X, β)] vir ).\n\n\nAppendix: second cohomology of Springer fibers\n\nIn this appendix we would like to prove the following theorem:\n\nTheorem 10.1. Let G be a simply laced semi-simple group and let as before f : T * B → N be the Springer map. Then for any non-regular n ∈ N the restriction map H 2 (B, Z) → H 2 (f −1 (n), Z) is an isomorphism (note that f −1 (n) is embedded in B by the definition of f ).\n\nTheorem 10.1 implies that the restriction map H 2 (T * B, Z) → H 2 ( S n , Z) is an isomorphism as was announced in the remark after Theorem 1.3.\n\nProof. Without loss of generality we may assume that G is almost simple. We shall also write B n instead of f −1 (n). Let O r denote the regular orbit in N (i.e. the unique open orbit) and let O sr ⊂ N denote the subregular nilpotent orbit (i.e. the unique orbit which has codimension 2 in N). Let us first assume that n ∈ O sr . Then it is well known that f −1 (n) is a tree of P 1 's of degrees corresponding to all α ∨ ∈ Π ∨ ⊂ Λ ∨ ; this implies that H 2 (B n , Z) = Λ ∨ and H 2 (B n , Z) = Λ. Since H 2 (B, Z) = Λ the statement of the Theorem follows.\n\nFor general n ∈ N our strategy will be as follows. First we are going to show that the natural map H 2 (B n , Z) → H 2 (B, Z) is surjective. Then we going to show that the natural map H 2 (B n , C) → H 2 (B, C) is an isomorphism. On the other hand, it is shown in [12] that H * (B n , Z) has no torsion, which implies the statement of Theorem 10.1.\n\nTo prove the surjectivity of the map H 2 (B n , Z) → H 2 (B, Z) we are going to show that for every simple coroot α ∨ ∈ Π ∨ there exists an embedding P 1 → B n , which has degree α ∨ in B. The required surjectivity follows since H 2 (B, Z) = Λ ∨ is generated by simple coroots. To show the existence of such a P 1 let us denote by P α the moduli space of subminimal parabolics corresponding to α. Then all the P 1 's of degree α ∨ in B are fibers of the projection p α : B → P α . Since n is not regular, it lies in the closure of O sr . Thus there exists a curve C with a point c ∈ C and a map η : C → N such that η(x) ∈ O sr if x = c and η(c) = n. For any x = c the Springer fiber B η(x) contains unique P 1 of degree α ∨ . In other words, we get a map φ : C\\{c} → P α such p −1 α (φ(x)) ⊂ B η(x) . Since P α is proper, the map φ extends to the whole of C and we are going to have p −1 α (φ(c)) ⊂ B φ(c) . Since φ(c) = n, we are done. To prove that the map H 2 (B n , C) → H 2 (B, C) is an isomorphism, let us consider the Springer sheaf Spr = f * (C[dim N]) (here f * denotes the derived direct image in the category of constructible sheaves). It is well-known (cf. [9]) that it is perverse and semi-simple. Moreover, its irreducible direct summands are all of the form IC(E) where E is a G-equivariant local system on a G-orbit O ⊂ N and IC(E) stands for its Goresky-Macpherson extension to N. We shall write C O for the constant local system on O with fiber C. Also, for any complex of sheaves F on N we shall denote by F n the fiber of F at n; this is a complex of vector spaces over C.\n\nLet now n ∈ N which is not regular and not subregular and let O be its G-orbit. Then H 2 (B n , C) is the cohomology of the fiber of Spr at n of degree 2 − dim N. Let O ′ ⊂ N be a G-orbit such thatŌ sr ⊃Ō ′ ⊃ O and let E be a local system on O ′ . Then we claim that H 2−dim N (IC(E) n ) is 0 unless O ′ = O sr . Indeed, this follows from the definition of IC-sheaves and from the fact that if O ′ = O sr then dim O ′ < dim N − 2. Thus in order the only contribution to H 2−dim N (IC(E) n ) may come from IC(E) where E is a local system either on O r or O sr . It is well-known that the only E on O r such that IC(E) appears in Spr is the constant local system and in this case IC(E) is constant on N and therefore does not contribute anything to H 2−dim N (IC(E) n ). Also, if E is an irreducible local system on O sr such that IC(E) appears in Spr, then E is constant and Hom(IC(C Osr [dim O sr ]), Spr) = t * 3 . On the other hand, H 2−dim N (IC(C Osr )) = CŌ sr . 4 Thus H 2−dim N (IC(C Osr ) n ) = C and hence H 2−dim N (Spr n ) = t * = H 2 (B, C).\n\n\nFix a Borel subgroup B ⊂ G with a maximal torus T . A weight λ ∈ Hom(B, C * ) defines an equivariant line bundle O(λ) = G × B C λ on B and, by pullback, on X. The map λ → D λ = c 1 (O(Hom(T, C * ) ∼ = H 2 (X, Z)\n\nTheorem 1 . 2 .\n12The operator of quantum multiplication by D B λ on H * G (B) is equal to\n\n1. 18 .\n18Acknowledgments. Numerous discussions with R. Bezrukavnikov, P. Etingof, N. Nekrasov, and S. Shatashvili played a very important role in development of the ideas presented in this paper. We would also like to thank T. Bridgeland, I. Cherednik, D. Kaledin, T. Lam, E. Opdam, R. Pandharipande, and Z. Yun for very helpful conversations and for providing us with references on various subjects. A.B. was partially supported by the NSF grant DMS-0901274. D.M. was partially supported by a Clay Research Fellowship. A.O. was partially supported by the NSF grant DMS-0853560.\n\n( 3 )\n3For any w ∈ W there are isomorphisms M a,t ≃ M w(a),t ; M a ≃ M w(a) .\n\n( 4 )\n4Let ξ be the image of a in t/W . Then there are isomorphisms M a,t ≃ M ξ,t ; M a ≃ M ξ .\n\nProposition 2. 3 .\n3There exists a functor I : H t − mod f → H v − mod f , which depends on a choice of a point q 0 ∈ T ∨ reg /W , satisfying the following conditions:(1) I(M ξ,t ) = M z,v where z = e 2πiξ and v = e 2πit .(2) For any M in H t −mod f let us consider the corresponding affine KZ connection, as a connection over T ∨ reg /W on the trivial bundle with fiber M . Then the monodromy representation of C[π 1 (T ∨ reg /W, q 0 )] on M factors through H v and the resulting H v -module is I(M ).\n\n3. 1 .\n1The Steinberg variety. Recall that we have the natural proper (Springer) map f : T * B → N. The Steinberg variety St is defined as follows: St = T * B × N T * B. Explicitly, St parametrises triples (b 1 , b 2 , x) where b 1 and b 2 are two Borel subalgebras in g and x is a nilpotent element in b 1 ∩b 2 . Alternatively, St can be defined as the union of the conormal bundles to the G-orbits in B × B. In particular, St is equi-dimensional of dimension 2 dim B and its irreducible components are parametrised by elements of W . The variety St is endowed with a natural action of the group G = G × C * where G acts on everything by conjugation and the multiplicative group C * dilates x (and doesn't change b\n\n\na closed subvariety of B × B and its fundamental class [Y i ] ∈ H G * (B × B) is equal to s i . The corresponding operator on H * G (B) is just p * i (p i ) * . Similarly, let us now denote by W i the conormal bundle to B × P i B. This is a smooth closed G-invariant subvariety of St and thus its fundamental class [W i ] is a well defined element of H G * (St) which is equal to s i . In particular, if we view W i as a correspondence from T * B to itself, then its action on G-equivariant cohomology of T * B is equal to the action of s i − 1. 3.4. Explicit construction: algebra. The above actions of H t on H * G (T * B) and of H nil on H * G (B) can be described explicitly in the following sense. First of all, we have the natural isomorphisms H * G (B) ≃ H * B (pt) = H * T (pt) = Sym(t * ) = M. Similarly, by using the pull-back map with respect to the projection T * B → B we may identify H * G (T * B) with H * G (B) = Sym(t * )[t] = M t . Then we have the following Proposition 3.1. The above isomorphism H * G (B) ≃ M is an isomorphism of H nilmodules. Similarly, the above isomorphism H * G (T * B) ≃ M t is an isomorphism of H t -modules. 3.5. Main result revisited. With all this context in place, we are now ready to give a reformulation of the main result of this paper.\n\n( 3 )\n3The G-equivariant quantum D-module of T * B is isomorphic to the Calogero-Moser D-module CM t (this is an isomorphism of D(T ∨ reg )⊗Sym(t * ) W [t]-modules).\n\n. 4 . 1 .\n41Definitions. We first clarify the definitions of the equivariant Gromov-Witten invariants γ 1 , . . .\n\nLemma 5. 2 .\n2The family V 0 → A 1 satisfies the conditions listed in section 4.3.Proof. On the set-theoretic level, this is obvious. The infinitesimal statement follows from the transverse assumption, since the cup product pairing in equation 28 can be identified with the pairing of the root lattice with t.\n\n\nwhere the right-hand side again denotes invariants defined via the standard virtual class.\n\nLemma 5 . 3 .\n53For t = 0, we have the equality of G-equivariant reduced Gromov-Witten invariants γ 1 The left and right sides of the statement can be identified with γ 1 , γ 2\n\n( 30 )\n30S(s) = Ψ(q, a) • ∆(s) • Ψ −1 (q, a + s).\n\nProposition 6 . 1 .\n61The matrix entries of S(s) are rational functions on C(T ∨ ): S(s) ∈ End (H * T (X)) ⊗ C(T ∨ ).\n\nTheorem 7 . 4 .\n74There exists an isomorphism\n\n\n, C) and[B]  denotes the class of the zero-section. Define the moduli space of mapsM 0,3 (X, p 1 , β) = {(C, f ) ∈ M 0,3 (X, β)|f (p 1 ) ∈ B ⊂ X}.It is a standard fact that M 0,3 (X, p, β) admits a T-equivariant virtual class for which ι * [M 0,3 (X, p 1 , β)] vir = ev * 1 [B] · [M 0,3 (X, β)] vir . Moreover, since T B is nef, f (p 1 ) ∈ B implies that f factors through B, and we have M 0,3 (X, p 1 , β) = M 0,3 (B, β)\n\n( 3 )\n3The G-equivariant quantum D-module of B is isomorphic to the Toda D-module T (as a D(T ∨ ) ⊗ Sym(t * ) W -module).\n\nProposition 9 . 1 .\n91There is an equality of T ′ -equivariant virtual classesι ! [M 0,2 ( S n , β)] vir = [M 0,2 (X, β)] vir\n\nL\nM C (X,β) / / L M C ( Sn,β) / / L M C ( Sn,β)/M C (X,β) / / L M C (X,β) [1]\nIn fact, in[31] this isomorphism is constructed in a much more general situation\nHere and and in the sequel the word \"subminimal\" means that the semi-simple rank of the corresponding Levi is equal to 1\n\nThe intrinsic normal cone. K Behrend, B Fantechi, Invent. Math. 128K. Behrend and B. Fantechi, The intrinsic normal cone, Invent. Math. 128 (1997), 45-88.\n\nNoncommutative counterparts of the Springer resolution. R Bezrukavnikov, International Congress of Mathematicians. IIEur. Math. Soc.R. Bezrukavnikov, Noncommutative counterparts of the Springer resolution, International Congress of Mathematicians. Vol. II, 1119-1144, Eur. Math. Soc., Zürich, 2006.\n\n. R Bezrukavnikov, S Riche, in preparationR. Bezrukavnikov and S. Riche, in preparation.\n\nMonodromy of the quantum differential equation for the Hilbert scheme of points. R Bezrukavnikov, A Okounkov, in preparationR. Bezrukavnikov and A. Okounkov, Monodromy of the quantum differential equation for the Hilbert scheme of points, in preparation.\n\nJ Bryan, A Gholampour, arXiv:0707.1337Root systems and the quantum cohomology of ADE-resolutions. J. Bryan and A. Gholampour, Root systems and the quantum cohomology of ADE-resolutions, arXiv:0707.1337.\n\nMultiple covers and the integrality conjecture for rational curves in Calabi-Yau threefolds. J Bryan, S Katz, N C Leung, J. Algebraic Geom. 10J. Bryan, S. Katz, N.C. Leung, Multiple covers and the integrality conjecture for rational curves in Calabi-Yau threefolds, J. Algebraic Geom. 10, (2001), 549-568.\n\nQuantum Knizhnik-Zamolodchikov equations and affine root systems. I Cherednik, Commun. Math. Phys. 150I. Cherednik, Quantum Knizhnik-Zamolodchikov equations and affine root systems, Commun. Math. Phys. 150 1992, 109-136.\n\nDouble affine Hecke algebras. I Cherednik, London Mathematical Society Lecture Note Series. 319Cambridge University PressI. Cherednik, Double affine Hecke algebras, London Mathematical Society Lecture Note Series, 319; Cambridge University Press, Cambridge, 2005\n\nHere H 2−dim N stands for the corresponding cohomology sheaf with respect to the usual (not perverse) t-structure. Here H 2−dim N stands for the corresponding cohomology sheaf with respect to the usual (not per- verse) t-structure\n\nRepresentation Theory and Complex Geometry. N Chriss, V Ginzburg, Birkhäuser. N. Chriss, and V. Ginzburg, Representation Theory and Complex Geometry, Birkhäuser, Boston, 1997.\n\nOn quantum cohomology rings of partial flag varieties. I Ciocan-Fontanine, Duke Math. J. 3I. Ciocan-Fontanine, On quantum cohomology rings of partial flag varieties, Duke Math. J. (3) (1999) 485-523.\n\nMirror Symmetry and Algebraic Geometry. D Cox, S Katz, AMSD. Cox and S. Katz, Mirror Symmetry and Algebraic Geometry, AMS, 1999\n\nHomology of the zero-set of a nilpotent vector field on a flag manifold. C De Concini, G Lusztig, C Procesi, J. Amer. Math. Soc. 11C. De Concini, G. Lusztig and C. Procesi, Homology of the zero-set of a nilpotent vector field on a flag manifold, J. Amer. Math. Soc. 1 (1988), no. 1, 15-34.\n\nD.-E Diaconescu, arXiv:0801.0820Moduli of ADHM Sheaves and Local Donaldson-Thomas Theory. D.-E. Diaconescu, Moduli of ADHM Sheaves and Local Donaldson-Thomas Theory, arXiv:0801.0820\n\nP Etingof, Differential topology, infinite-dimensional Lie algebras, and applications. Providence, RIAmer. Math. Soc2Whittaker functions on quantum groups and q-deformed Toda operatorsP. Etingof, Whittaker functions on quantum groups and q-deformed Toda operators, in: Differential topology, infinite-dimensional Lie algebras, and applications, 9-25, Amer. Math. Soc. Transl. Ser. 2, 194, Amer. Math. Soc., Providence, RI, 1999\n\nShift operators for the quantum Calogero-Sutherland problems via Knizhnik-Zamolodchikov equation. G Felder, A Veselov, Comm. Math. Phys. 1602G. Felder, A. Veselov, Shift operators for the quantum Calogero-Sutherland problems via Knizhnik- Zamolodchikov equation Comm. Math. Phys. 160 (1994), no. 2, 259-273.\n\nV Ginzburg, Geometric methods in the representation theory of Hecke algebras and quantum groups. DordrechtKluwer Acad. Publ514Representation theories and algebraic geometryV. Ginzburg, Geometric methods in the representation theory of Hecke algebras and quantum groups (notes by V. Baranovsky), NATO Adv. Sci. Inst. Ser. C Math. Phys. Sci., 514, Representation theories and algebraic geometry (Montreal, PQ, 1997), 127-183, Kluwer Acad. Publ., Dordrecht, 1998.\n\nV Ginzburg, arXiv:0905.0686Lectures on Nakajima's Quiver Varieties. V. Ginzburg, Lectures on Nakajima's Quiver Varieties, arXiv:0905.0686\n\nQuantum cohomology of flag manifolds and Toda lattices. A Givental, B Kim, Comm. Math. Phys. 168A. Givental, B. Kim, Quantum cohomology of flag manifolds and Toda lattices, Comm. Math. Phys. 168 (1995) 609-641.\n\nM Gross, Calabi-Yau manifolds and related geometries. Nordfjordeid; BerlinSpringerUniversitextCalabi-Yau manifolds and mirror symmetryM. Gross, Calabi-Yau manifolds and mirror symmetry, Calabi-Yau manifolds and related geome- tries (Nordfjordeid, 2001), 69-159, Universitext, Springer, Berlin, 2003.\n\nAn elementary approach to the hypergeometric shift operators of Opdam. G Heckman, Invent. Math. 103G. Heckman, An elementary approach to the hypergeometric shift operators of Opdam, Invent. Math., 103, (1991), 341-350.\n\nK Hori, S Katz, A Klemm, R Pandharipande, R Thomas, C Vafa, R Vakil, E Zaslow, Mirror symmetry. Providence, RIAmerican Mathematical Society1K. Hori, S. Katz, A. Klemm, R. Pandharipande, R. Thomas, C. Vafa, R. Vakil, E. Zaslow, Mirror symmetry, Clay Mathematics Monographs, 1. American Mathematical Society, Providence, RI;\n\nR Horja, arXiv:math/9912109Hypergeometric functions and mirror symmetry in toric varieties. R. Horja, Hypergeometric functions and mirror symmetry in toric varieties, arXiv:math/9912109\n\nD Juteau, arXiv:0704.3417Cohomology of the minimal nilpotent orbit. D. Juteau, Cohomology of the minimal nilpotent orbit, arXiv:0704.3417\n\nSymplectic singularities from the Poisson point of view. D Kaledin, J. Reine Angew. Math. 600D. Kaledin, Symplectic singularities from the Poisson point of view, J. Reine Angew. Math. 600 (2006), 135-156.\n\nDerived equivalences by quantization. D Kaledin, Geom. Funct. Anal. 176D. Kaledin, Derived equivalences by quantization, Geom. Funct. Anal. 17 (2008), no. 6, 1968-2004.\n\nGeometry and topology of symplectic resolutions, Algebraic geometry-Seattle. D Kaledin, Proc. Sympos. Pure Math. 22Amer. Math. SocD Kaledin, Geometry and topology of symplectic resolutions, Algebraic geometry-Seattle 2005. Part 2, 595-628, Proc. Sympos. Pure Math., 80, Part 2, Amer. Math. Soc., Providence, RI, 2009.\n\nProof of the Deligne-Langlands conjecture for Hecke algebras. D Kazhdan, G Lusztig, Invent. Math. 871D. Kazhdan and G. Lusztig, Proof of the Deligne-Langlands conjecture for Hecke algebras, Invent. Math. 87 (1987), no. 1, 153-215.\n\nBraid cobordisms, triangulated categories, and flag varieties, Homology. M Khovanov, R Thomas, Homotopy Appl. 92M. Khovanov and R. Thomas, Braid cobordisms, triangulated categories, and flag varieties, Ho- mology, Homotopy Appl. 9 (2007), no. 2, 19-94.\n\nQuantum cohomology of flag manifolds G/P and quantum Toda lattices. B Kim, Annals of Math. 149B. Kim, Quantum cohomology of flag manifolds G/P and quantum Toda lattices, Annals of Math. 149 (1999), 129-148.\n\nAffine Hecke algebras and their graded version. G Lusztig, J. of the AMS. 2G. Lusztig, Affine Hecke algebras and their graded version, J. of the AMS 2:3 1989, 599-685.\n\nCuspidal local systems and graded Hecke algebras, I. G Lusztig, Publ. Math. I.H.E.S. 67G. Lusztig, Cuspidal local systems and graded Hecke algebras, I, Publ. Math. I.H.E.S. 67 (1988), 145-202\n\nIntegrable connections related to zonal spherical functions. A Matsuo, Invent. Math. 110A. Matsuo, Integrable connections related to zonal spherical functions, Invent. Math. 110 1992, 96-121.\n\nGromov-Witten theory of ADE-resolutions, Geometry and Topology. D Maulik, to appearD. Maulik, Gromov-Witten theory of ADE-resolutions, Geometry and Topology, to appear.\n\nD Maulik, A Oblomkov, A Okounkov, R Pandharipande, arXiv:math/0809.3976Gromov-Witten/Donaldson-Thomas correspondence for toric 3-folds. D. Maulik, A. Oblomkov, A. Okounkov, and R. Pandharipande, Gromov-Witten/Donaldson- Thomas correspondence for toric 3-folds, arXiv:math/0809.3976.\n\nQuantum cohomology of moduli of framed sheaves. D Maulik, A Okounkov, in preparationD. Maulik and A. Okounkov, Quantum cohomology of moduli of framed sheaves, in preparation.\n\nD Maulik, R Pandharipande, arXiv:math/0705.1653Gromov-Witten theory and Noether-Lefschetz theory. D. Maulik and R. Pandharipande, Gromov-Witten theory and Noether-Lefschetz the- ory,arXiv:math/0705.1653.\n\nL C Mihalcea, arXiv:math/0501213Equivariant quantum cohomology of homogeneous spaces. L. C. Mihalcea, Equivariant quantum cohomology of homogeneous spaces, arXiv:math/0501213.\n\nCasimir Operators and Monodromy Representations of Generalised Braid Groups. J J Millson, V Toledano Laredo, Tranformation Groups. 10J. J. Millson and V. Toledano Laredo, Casimir Operators and Monodromy Representations of Generalised Braid Groups, Tranformation Groups 10 (2005), 217-254.\n\nOn deformations of Q-factorial symplectic varieties. Y Namikawa, J. Reine Angew. Math. 599Y. Namikawa, On deformations of Q-factorial symplectic varieties, J. Reine Angew. Math. 599 (2006), 97-110.\n\nA Negut, arXiv:0811.4454Laumon Spaces and the Calogero-Sutherland Integrable System. A. Negut, Laumon Spaces and the Calogero-Sutherland Integrable System, arXiv:0811.4454.\n\nN Nekrasov, S Shatashvili, arXiv:0908.4052Quantization of Integrable Systems and Four Dimensional Gauge Theories. N. Nekrasov and S. Shatashvili, Quantization of Integrable Systems and Four Dimensional Gauge Theories, arXiv:0908.4052\n\nQuantum cohomology of the Hilbert scheme of points on the plane. A Okounkov, R Pandharipande, math.AG/0411210A. Okounkov and R. Pandharipande, Quantum cohomology of the Hilbert scheme of points on the plane, math.AG/0411210.\n\nSome applications of hypergeometric shift operators. E Opdam, Invent. Math. 98E. Opdam, Some applications of hypergeometric shift operators, Invent. Math. 98 (1989), 1-18.\n\nHarmonic analysis for certain representations of graded Hecke algebras. E Opdam, Acta Math. 175E. Opdam, Harmonic analysis for certain representations of graded Hecke algebras, Acta Math., 175 (1995), 75-121.\n\nA mirror symmetric construction of qH * T (G/P ) (q). K Rietsch, Adv. Math. 2176K. Rietsch, A mirror symmetric construction of qH * T (G/P ) (q) , Adv. Math. 217 (2008), no. 6, 2401-2442.\n\nA Kohno-Drinfeld Theorem for Quantum Weyl Groups. V Toledano-Laredo, Duke Mathematical Journal. 112V. Toledano-Laredo, A Kohno-Drinfeld Theorem for Quantum Weyl Groups, Duke Mathematical Journal, 112 (2002), 421-451.\n\nThe trigonometric Casimir connection. V Toledano-Laredo, in preparationV. Toledano-Laredo, The trigonometric Casimir connection, in preparation.\n\nQuiver varieties and Yangians. M Varagnolo, Lett. Math. Phys. 534M. Varagnolo, Quiver varieties and Yangians, Lett. Math. Phys. 53 (2000), no. 4, 273-283.\n", "annotations": {"author": "[{\"end\":85,\"start\":59},{\"end\":102,\"start\":86}]", "publisher": null, "author_last_name": "[{\"end\":84,\"start\":75},{\"end\":101,\"start\":93}]", "author_first_name": "[{\"end\":74,\"start\":65},{\"end\":92,\"start\":86}]", "author_affiliation": null, "title": "[{\"end\":46,\"start\":1},{\"end\":148,\"start\":103}]", "venue": null, "abstract": "[{\"end\":623,\"start\":160}]", "bib_ref": "[{\"attributes\":{\"ref_id\":\"b26\"},\"end\":987,\"start\":983},{\"attributes\":{\"ref_id\":\"b0\"},\"end\":1133,\"start\":1130},{\"attributes\":{\"ref_id\":\"b26\"},\"end\":1424,\"start\":1420},{\"attributes\":{\"ref_id\":\"b2\"},\"end\":1555,\"start\":1552},{\"attributes\":{\"ref_id\":\"b6\"},\"end\":2533,\"start\":2530},{\"end\":2605,\"start\":2602},{\"attributes\":{\"ref_id\":\"b24\"},\"end\":3738,\"start\":3734},{\"attributes\":{\"ref_id\":\"b17\"},\"end\":4393,\"start\":4389},{\"attributes\":{\"ref_id\":\"b11\"},\"end\":4746,\"start\":4742},{\"attributes\":{\"ref_id\":\"b19\"},\"end\":4749,\"start\":4746},{\"attributes\":{\"ref_id\":\"b21\"},\"end\":4752,\"start\":4749},{\"attributes\":{\"ref_id\":\"b41\"},\"end\":5159,\"start\":5155},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":5661,\"start\":5658},{\"attributes\":{\"ref_id\":\"b11\"},\"end\":6027,\"start\":6023},{\"attributes\":{\"ref_id\":\"b7\"},\"end\":6096,\"start\":6093},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":6801,\"start\":6797},{\"attributes\":{\"ref_id\":\"b17\"},\"end\":6939,\"start\":6935},{\"attributes\":{\"ref_id\":\"b11\"},\"end\":7429,\"start\":7425},{\"attributes\":{\"ref_id\":\"b12\"},\"end\":8070,\"start\":8066},{\"attributes\":{\"ref_id\":\"b48\"},\"end\":8652,\"start\":8648},{\"attributes\":{\"ref_id\":\"b31\"},\"end\":9517,\"start\":9513},{\"attributes\":{\"ref_id\":\"b13\"},\"end\":10079,\"start\":10075},{\"attributes\":{\"ref_id\":\"b11\"},\"end\":10581,\"start\":10577},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":10660,\"start\":10656},{\"attributes\":{\"ref_id\":\"b7\"},\"end\":10715,\"start\":10712},{\"attributes\":{\"ref_id\":\"b32\"},\"end\":10728,\"start\":10724},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":10753,\"start\":10749},{\"attributes\":{\"ref_id\":\"b40\"},\"end\":11858,\"start\":11854},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":12000,\"start\":11996},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":12493,\"start\":12489},{\"attributes\":{\"ref_id\":\"b16\"},\"end\":13206,\"start\":13202},{\"attributes\":{\"ref_id\":\"b22\"},\"end\":13470,\"start\":13466},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":13584,\"start\":13580},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":13758,\"start\":13755},{\"attributes\":{\"ref_id\":\"b2\"},\"end\":13760,\"start\":13758},{\"attributes\":{\"ref_id\":\"b28\"},\"end\":13807,\"start\":13803},{\"attributes\":{\"ref_id\":\"b27\"},\"end\":13966,\"start\":13962},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":13983,\"start\":13980},{\"attributes\":{\"ref_id\":\"b7\"},\"end\":14079,\"start\":14076},{\"end\":14191,\"start\":14188},{\"attributes\":{\"ref_id\":\"b18\"},\"end\":15268,\"start\":15264},{\"attributes\":{\"ref_id\":\"b18\"},\"end\":15555,\"start\":15551},{\"end\":16044,\"start\":16033},{\"attributes\":{\"ref_id\":\"b20\"},\"end\":16047,\"start\":16044},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":17288,\"start\":17284},{\"attributes\":{\"ref_id\":\"b18\"},\"end\":17291,\"start\":17288},{\"attributes\":{\"ref_id\":\"b29\"},\"end\":17294,\"start\":17291},{\"attributes\":{\"ref_id\":\"b37\"},\"end\":17297,\"start\":17294},{\"attributes\":{\"ref_id\":\"b45\"},\"end\":17300,\"start\":17297},{\"attributes\":{\"ref_id\":\"b37\"},\"end\":17420,\"start\":17416},{\"attributes\":{\"ref_id\":\"b31\"},\"end\":18038,\"start\":18034},{\"attributes\":{\"ref_id\":\"b16\"},\"end\":18047,\"start\":18043},{\"attributes\":{\"ref_id\":\"b24\"},\"end\":18977,\"start\":18973},{\"attributes\":{\"ref_id\":\"b12\"},\"end\":19250,\"start\":19246},{\"attributes\":{\"ref_id\":\"b24\"},\"end\":19443,\"start\":19439},{\"attributes\":{\"ref_id\":\"b46\"},\"end\":20507,\"start\":20503},{\"attributes\":{\"ref_id\":\"b47\"},\"end\":20510,\"start\":20507},{\"attributes\":{\"ref_id\":\"b35\"},\"end\":20704,\"start\":20700},{\"attributes\":{\"ref_id\":\"b41\"},\"end\":21358,\"start\":21354},{\"attributes\":{\"ref_id\":\"b40\"},\"end\":22335,\"start\":22331},{\"attributes\":{\"ref_id\":\"b7\"},\"end\":25978,\"start\":25975},{\"attributes\":{\"ref_id\":\"b22\"},\"end\":28234,\"start\":28230},{\"attributes\":{\"ref_id\":\"b7\"},\"end\":30053,\"start\":30050},{\"attributes\":{\"ref_id\":\"b6\"},\"end\":31748,\"start\":31745},{\"attributes\":{\"ref_id\":\"b7\"},\"end\":31755,\"start\":31752},{\"attributes\":{\"ref_id\":\"b32\"},\"end\":31787,\"start\":31783},{\"attributes\":{\"ref_id\":\"b32\"},\"end\":32066,\"start\":32062},{\"attributes\":{\"ref_id\":\"b7\"},\"end\":32147,\"start\":32144},{\"attributes\":{\"ref_id\":\"b7\"},\"end\":34090,\"start\":34087},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":34473,\"start\":34470},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":34645,\"start\":34642},{\"attributes\":{\"ref_id\":\"b31\"},\"end\":34822,\"start\":34818},{\"attributes\":{\"ref_id\":\"b25\"},\"end\":35120,\"start\":35116},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":35213,\"start\":35210},{\"attributes\":{\"ref_id\":\"b24\"},\"end\":35440,\"start\":35436},{\"attributes\":{\"ref_id\":\"b31\"},\"end\":35495,\"start\":35491},{\"attributes\":{\"ref_id\":\"b31\"},\"end\":35914,\"start\":35910},{\"end\":36581,\"start\":36570},{\"attributes\":{\"ref_id\":\"b41\"},\"end\":37146,\"start\":37142},{\"attributes\":{\"ref_id\":\"b27\"},\"end\":37685,\"start\":37681},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":37687,\"start\":37685},{\"attributes\":{\"ref_id\":\"b2\"},\"end\":37990,\"start\":37987},{\"attributes\":{\"ref_id\":\"b42\"},\"end\":38744,\"start\":38740},{\"attributes\":{\"ref_id\":\"b36\"},\"end\":38747,\"start\":38744},{\"attributes\":{\"ref_id\":\"b26\"},\"end\":40709,\"start\":40705},{\"attributes\":{\"ref_id\":\"b36\"},\"end\":41787,\"start\":41783},{\"attributes\":{\"ref_id\":\"b36\"},\"end\":42698,\"start\":42694},{\"attributes\":{\"ref_id\":\"b28\"},\"end\":43281,\"start\":43277},{\"attributes\":{\"ref_id\":\"b5\"},\"end\":46038,\"start\":46035},{\"attributes\":{\"ref_id\":\"b33\"},\"end\":46041,\"start\":46038},{\"attributes\":{\"ref_id\":\"b0\"},\"end\":46830,\"start\":46827},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":49845,\"start\":49842},{\"attributes\":{\"ref_id\":\"b33\"},\"end\":49851,\"start\":49847},{\"attributes\":{\"ref_id\":\"b11\"},\"end\":52812,\"start\":52808},{\"attributes\":{\"ref_id\":\"b34\"},\"end\":53607,\"start\":53603},{\"attributes\":{\"ref_id\":\"b35\"},\"end\":53616,\"start\":53612},{\"attributes\":{\"ref_id\":\"b23\"},\"end\":58579,\"start\":58575},{\"attributes\":{\"ref_id\":\"b23\"},\"end\":58616,\"start\":58612},{\"attributes\":{\"ref_id\":\"b34\"},\"end\":58793,\"start\":58789},{\"attributes\":{\"ref_id\":\"b23\"},\"end\":59268,\"start\":59264},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":59923,\"start\":59919},{\"attributes\":{\"ref_id\":\"b35\"},\"end\":60642,\"start\":60638},{\"attributes\":{\"ref_id\":\"b35\"},\"end\":60746,\"start\":60742},{\"end\":65232,\"start\":65221},{\"attributes\":{\"ref_id\":\"b37\"},\"end\":65334,\"start\":65330},{\"attributes\":{\"ref_id\":\"b29\"},\"end\":65465,\"start\":65461},{\"attributes\":{\"ref_id\":\"b0\"},\"end\":66636,\"start\":66633},{\"attributes\":{\"ref_id\":\"b38\"},\"end\":66921,\"start\":66917},{\"attributes\":{\"ref_id\":\"b0\"},\"end\":67577,\"start\":67574},{\"attributes\":{\"ref_id\":\"b12\"},\"end\":69875,\"start\":69871},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":71129,\"start\":71126},{\"end\":72520,\"start\":72519},{\"attributes\":{\"ref_id\":\"b31\"},\"end\":78028,\"start\":78024}]", "figure": "[{\"attributes\":{\"id\":\"fig_0\"},\"end\":72818,\"start\":72605},{\"attributes\":{\"id\":\"fig_1\"},\"end\":72910,\"start\":72819},{\"attributes\":{\"id\":\"fig_2\"},\"end\":73491,\"start\":72911},{\"attributes\":{\"id\":\"fig_3\"},\"end\":73570,\"start\":73492},{\"attributes\":{\"id\":\"fig_4\"},\"end\":73667,\"start\":73571},{\"attributes\":{\"id\":\"fig_5\"},\"end\":74171,\"start\":73668},{\"attributes\":{\"id\":\"fig_6\"},\"end\":74888,\"start\":74172},{\"attributes\":{\"id\":\"fig_7\"},\"end\":76178,\"start\":74889},{\"attributes\":{\"id\":\"fig_9\"},\"end\":76345,\"start\":76179},{\"attributes\":{\"id\":\"fig_10\"},\"end\":76460,\"start\":76346},{\"attributes\":{\"id\":\"fig_11\"},\"end\":76771,\"start\":76461},{\"attributes\":{\"id\":\"fig_12\"},\"end\":76864,\"start\":76772},{\"attributes\":{\"id\":\"fig_13\"},\"end\":77042,\"start\":76865},{\"attributes\":{\"id\":\"fig_14\"},\"end\":77093,\"start\":77043},{\"attributes\":{\"id\":\"fig_15\"},\"end\":77212,\"start\":77094},{\"attributes\":{\"id\":\"fig_16\"},\"end\":77259,\"start\":77213},{\"attributes\":{\"id\":\"fig_17\"},\"end\":77683,\"start\":77260},{\"attributes\":{\"id\":\"fig_18\"},\"end\":77806,\"start\":77684},{\"attributes\":{\"id\":\"fig_19\"},\"end\":77933,\"start\":77807},{\"attributes\":{\"id\":\"fig_20\"},\"end\":78012,\"start\":77934}]", "paragraph": "[{\"end\":1161,\"start\":639},{\"end\":1353,\"start\":1163},{\"end\":1713,\"start\":1387},{\"end\":1933,\"start\":1715},{\"end\":1985,\"start\":1974},{\"end\":2076,\"start\":2024},{\"end\":2176,\"start\":2078},{\"end\":2271,\"start\":2200},{\"end\":2789,\"start\":2298},{\"end\":2869,\"start\":2812},{\"end\":3080,\"start\":2911},{\"end\":3420,\"start\":3120},{\"end\":3512,\"start\":3422},{\"end\":3547,\"start\":3514},{\"end\":3812,\"start\":3549},{\"end\":3860,\"start\":3814},{\"end\":4491,\"start\":3873},{\"end\":4911,\"start\":4500},{\"end\":5160,\"start\":4913},{\"end\":5522,\"start\":5162},{\"end\":5692,\"start\":5524},{\"end\":6314,\"start\":5720},{\"end\":6524,\"start\":6316},{\"end\":6718,\"start\":6526},{\"end\":6821,\"start\":6720},{\"end\":7645,\"start\":6823},{\"end\":7779,\"start\":7647},{\"end\":8382,\"start\":7855},{\"end\":9095,\"start\":8384},{\"end\":9236,\"start\":9132},{\"end\":9429,\"start\":9238},{\"end\":9828,\"start\":9461},{\"end\":10125,\"start\":9898},{\"end\":10160,\"start\":10127},{\"end\":10345,\"start\":10210},{\"end\":10582,\"start\":10428},{\"end\":10765,\"start\":10584},{\"end\":11367,\"start\":10767},{\"end\":11870,\"start\":11369},{\"end\":12224,\"start\":11872},{\"end\":12402,\"start\":12257},{\"end\":12495,\"start\":12404},{\"end\":12849,\"start\":12524},{\"end\":13071,\"start\":12851},{\"end\":13210,\"start\":13100},{\"end\":13414,\"start\":13238},{\"end\":14128,\"start\":13448},{\"end\":14261,\"start\":14130},{\"end\":14445,\"start\":14263},{\"end\":14520,\"start\":14447},{\"end\":14753,\"start\":14609},{\"end\":14857,\"start\":14780},{\"end\":14957,\"start\":14885},{\"end\":15576,\"start\":14959},{\"end\":15778,\"start\":15578},{\"end\":15998,\"start\":15851},{\"end\":16137,\"start\":16000},{\"end\":16397,\"start\":16139},{\"end\":16648,\"start\":16399},{\"end\":16922,\"start\":16650},{\"end\":17009,\"start\":16924},{\"end\":17154,\"start\":17011},{\"end\":17421,\"start\":17190},{\"end\":18019,\"start\":17423},{\"end\":18416,\"start\":18021},{\"end\":18618,\"start\":18418},{\"end\":18830,\"start\":18620},{\"end\":19341,\"start\":18832},{\"end\":19735,\"start\":19343},{\"end\":20106,\"start\":19737},{\"end\":20705,\"start\":20108},{\"end\":21791,\"start\":20707},{\"end\":22336,\"start\":21793},{\"end\":23027,\"start\":22338},{\"end\":23840,\"start\":23029},{\"end\":24167,\"start\":23842},{\"end\":24421,\"start\":24222},{\"end\":24756,\"start\":24423},{\"end\":24943,\"start\":24863},{\"end\":25470,\"start\":24945},{\"end\":26066,\"start\":25536},{\"end\":26394,\"start\":26146},{\"end\":26662,\"start\":26396},{\"end\":27409,\"start\":26826},{\"end\":27457,\"start\":27411},{\"end\":27826,\"start\":27536},{\"end\":27960,\"start\":27844},{\"end\":28236,\"start\":27962},{\"end\":28590,\"start\":28387},{\"end\":28682,\"start\":28660},{\"end\":29230,\"start\":28750},{\"end\":29450,\"start\":29232},{\"end\":29578,\"start\":29511},{\"end\":29696,\"start\":29580},{\"end\":29827,\"start\":29727},{\"end\":29971,\"start\":29829},{\"end\":30135,\"start\":30002},{\"end\":30153,\"start\":30137},{\"end\":30181,\"start\":30155},{\"end\":30277,\"start\":30224},{\"end\":31053,\"start\":30279},{\"end\":31163,\"start\":31127},{\"end\":31474,\"start\":31239},{\"end\":31678,\"start\":31508},{\"end\":31817,\"start\":31717},{\"end\":32271,\"start\":32042},{\"end\":32448,\"start\":32273},{\"end\":32647,\"start\":32528},{\"end\":33555,\"start\":32649},{\"end\":33901,\"start\":33577},{\"end\":34232,\"start\":33903},{\"end\":34503,\"start\":34284},{\"end\":34854,\"start\":34512},{\"end\":35378,\"start\":34999},{\"end\":35960,\"start\":35387},{\"end\":36284,\"start\":35962},{\"end\":36506,\"start\":36438},{\"end\":36679,\"start\":36508},{\"end\":37220,\"start\":36809},{\"end\":37726,\"start\":37222},{\"end\":38364,\"start\":37810},{\"end\":39027,\"start\":38410},{\"end\":39708,\"start\":39029},{\"end\":39744,\"start\":39710},{\"end\":39966,\"start\":39791},{\"end\":40316,\"start\":39975},{\"end\":40712,\"start\":40318},{\"end\":40798,\"start\":40739},{\"end\":40896,\"start\":40857},{\"end\":40957,\"start\":40898},{\"end\":41106,\"start\":40987},{\"end\":41168,\"start\":41150},{\"end\":41387,\"start\":41223},{\"end\":41412,\"start\":41389},{\"end\":41686,\"start\":41431},{\"end\":42236,\"start\":41695},{\"end\":42354,\"start\":42238},{\"end\":42431,\"start\":42413},{\"end\":42645,\"start\":42433},{\"end\":42757,\"start\":42647},{\"end\":42856,\"start\":42786},{\"end\":42985,\"start\":42899},{\"end\":43392,\"start\":42987},{\"end\":43497,\"start\":43417},{\"end\":43804,\"start\":43529},{\"end\":44017,\"start\":43921},{\"end\":44053,\"start\":44019},{\"end\":44196,\"start\":44055},{\"end\":44414,\"start\":44230},{\"end\":44426,\"start\":44416},{\"end\":44653,\"start\":44540},{\"end\":45156,\"start\":44655},{\"end\":45348,\"start\":45185},{\"end\":45427,\"start\":45350},{\"end\":45685,\"start\":45442},{\"end\":46846,\"start\":45738},{\"end\":47440,\"start\":46848},{\"end\":47541,\"start\":47473},{\"end\":47920,\"start\":47565},{\"end\":48034,\"start\":47922},{\"end\":48691,\"start\":48180},{\"end\":48914,\"start\":48745},{\"end\":49311,\"start\":48959},{\"end\":49362,\"start\":49313},{\"end\":49438,\"start\":49420},{\"end\":49576,\"start\":49440},{\"end\":49972,\"start\":49716},{\"end\":50063,\"start\":49974},{\"end\":50094,\"start\":50078},{\"end\":50329,\"start\":50114},{\"end\":50868,\"start\":50331},{\"end\":51119,\"start\":50870},{\"end\":51268,\"start\":51121},{\"end\":51426,\"start\":51270},{\"end\":51745,\"start\":51532},{\"end\":51809,\"start\":51778},{\"end\":52403,\"start\":51887},{\"end\":52442,\"start\":52405},{\"end\":52582,\"start\":52474},{\"end\":53010,\"start\":52617},{\"end\":53256,\"start\":53012},{\"end\":53767,\"start\":53333},{\"end\":53935,\"start\":53798},{\"end\":54504,\"start\":53937},{\"end\":54678,\"start\":54506},{\"end\":54795,\"start\":54680},{\"end\":56153,\"start\":54797},{\"end\":56655,\"start\":56155},{\"end\":56800,\"start\":56684},{\"end\":57176,\"start\":56802},{\"end\":57542,\"start\":57229},{\"end\":57785,\"start\":57591},{\"end\":58132,\"start\":57787},{\"end\":58194,\"start\":58134},{\"end\":58396,\"start\":58293},{\"end\":58425,\"start\":58398},{\"end\":58795,\"start\":58452},{\"end\":59020,\"start\":58818},{\"end\":59195,\"start\":59071},{\"end\":59276,\"start\":59197},{\"end\":59348,\"start\":59329},{\"end\":59396,\"start\":59350},{\"end\":59490,\"start\":59398},{\"end\":59695,\"start\":59492},{\"end\":59850,\"start\":59697},{\"end\":59961,\"start\":59889},{\"end\":60145,\"start\":60009},{\"end\":60452,\"start\":60147},{\"end\":60811,\"start\":60504},{\"end\":60843,\"start\":60813},{\"end\":61066,\"start\":61010},{\"end\":61487,\"start\":61068},{\"end\":62234,\"start\":61489},{\"end\":62299,\"start\":62236},{\"end\":62501,\"start\":62326},{\"end\":62793,\"start\":62692},{\"end\":62936,\"start\":62917},{\"end\":63155,\"start\":62966},{\"end\":63256,\"start\":63187},{\"end\":63585,\"start\":63397},{\"end\":63777,\"start\":63644},{\"end\":63865,\"start\":63836},{\"end\":64038,\"start\":63899},{\"end\":64255,\"start\":64079},{\"end\":64323,\"start\":64257},{\"end\":64553,\"start\":64508},{\"end\":64832,\"start\":64620},{\"end\":64988,\"start\":64834},{\"end\":65076,\"start\":65002},{\"end\":65161,\"start\":65112},{\"end\":65501,\"start\":65163},{\"end\":65792,\"start\":65520},{\"end\":66080,\"start\":65828},{\"end\":66444,\"start\":66133},{\"end\":66958,\"start\":66446},{\"end\":67099,\"start\":67034},{\"end\":67225,\"start\":67133},{\"end\":67485,\"start\":67313},{\"end\":67650,\"start\":67487},{\"end\":67713,\"start\":67652},{\"end\":68072,\"start\":67715},{\"end\":68515,\"start\":68140},{\"end\":68628,\"start\":68566},{\"end\":68901,\"start\":68630},{\"end\":69048,\"start\":68903},{\"end\":69605,\"start\":69050},{\"end\":69955,\"start\":69607},{\"end\":71549,\"start\":69957},{\"end\":72604,\"start\":71551}]", "formula": "[{\"attributes\":{\"id\":\"formula_0\"},\"end\":1386,\"start\":1354},{\"attributes\":{\"id\":\"formula_1\"},\"end\":1973,\"start\":1934},{\"attributes\":{\"id\":\"formula_2\"},\"end\":2023,\"start\":1986},{\"attributes\":{\"id\":\"formula_3\"},\"end\":2199,\"start\":2177},{\"attributes\":{\"id\":\"formula_4\"},\"end\":2297,\"start\":2272},{\"attributes\":{\"id\":\"formula_5\"},\"end\":2811,\"start\":2790},{\"attributes\":{\"id\":\"formula_6\"},\"end\":2910,\"start\":2870},{\"attributes\":{\"id\":\"formula_7\"},\"end\":3872,\"start\":3861},{\"attributes\":{\"id\":\"formula_8\"},\"end\":5719,\"start\":5693},{\"attributes\":{\"id\":\"formula_9\"},\"end\":7854,\"start\":7780},{\"attributes\":{\"id\":\"formula_10\"},\"end\":9131,\"start\":9096},{\"attributes\":{\"id\":\"formula_11\"},\"end\":9460,\"start\":9430},{\"attributes\":{\"id\":\"formula_12\"},\"end\":9897,\"start\":9829},{\"attributes\":{\"id\":\"formula_13\"},\"end\":10209,\"start\":10161},{\"attributes\":{\"id\":\"formula_14\"},\"end\":10427,\"start\":10346},{\"attributes\":{\"id\":\"formula_15\"},\"end\":12256,\"start\":12225},{\"attributes\":{\"id\":\"formula_16\"},\"end\":12523,\"start\":12496},{\"attributes\":{\"id\":\"formula_17\"},\"end\":13099,\"start\":13072},{\"attributes\":{\"id\":\"formula_18\"},\"end\":13237,\"start\":13211},{\"attributes\":{\"id\":\"formula_19\"},\"end\":13447,\"start\":13415},{\"attributes\":{\"id\":\"formula_20\"},\"end\":14608,\"start\":14521},{\"attributes\":{\"id\":\"formula_21\"},\"end\":14779,\"start\":14754},{\"attributes\":{\"id\":\"formula_22\"},\"end\":14884,\"start\":14858},{\"attributes\":{\"id\":\"formula_23\"},\"end\":15850,\"start\":15779},{\"attributes\":{\"id\":\"formula_24\"},\"end\":17189,\"start\":17155},{\"attributes\":{\"id\":\"formula_25\"},\"end\":24862,\"start\":24757},{\"attributes\":{\"id\":\"formula_26\"},\"end\":25535,\"start\":25471},{\"attributes\":{\"id\":\"formula_27\"},\"end\":26145,\"start\":26067},{\"attributes\":{\"id\":\"formula_28\"},\"end\":26825,\"start\":26663},{\"attributes\":{\"id\":\"formula_29\"},\"end\":27535,\"start\":27458},{\"attributes\":{\"id\":\"formula_30\"},\"end\":28386,\"start\":28237},{\"attributes\":{\"id\":\"formula_31\"},\"end\":28659,\"start\":28591},{\"attributes\":{\"id\":\"formula_32\"},\"end\":28749,\"start\":28683},{\"attributes\":{\"id\":\"formula_33\"},\"end\":29510,\"start\":29451},{\"attributes\":{\"id\":\"formula_34\"},\"end\":29726,\"start\":29697},{\"attributes\":{\"id\":\"formula_35\"},\"end\":30001,\"start\":29972},{\"attributes\":{\"id\":\"formula_36\"},\"end\":30223,\"start\":30182},{\"attributes\":{\"id\":\"formula_37\"},\"end\":31126,\"start\":31054},{\"attributes\":{\"id\":\"formula_38\"},\"end\":31238,\"start\":31164},{\"attributes\":{\"id\":\"formula_39\"},\"end\":31507,\"start\":31475},{\"attributes\":{\"id\":\"formula_40\"},\"end\":31716,\"start\":31679},{\"attributes\":{\"id\":\"formula_41\"},\"end\":32041,\"start\":31818},{\"attributes\":{\"id\":\"formula_42\"},\"end\":32527,\"start\":32449},{\"attributes\":{\"id\":\"formula_43\"},\"end\":33576,\"start\":33556},{\"attributes\":{\"id\":\"formula_44\"},\"end\":34998,\"start\":34855},{\"attributes\":{\"id\":\"formula_45\"},\"end\":36382,\"start\":36285},{\"attributes\":{\"id\":\"formula_46\"},\"end\":36437,\"start\":36382},{\"attributes\":{\"id\":\"formula_47\"},\"end\":36808,\"start\":36680},{\"attributes\":{\"id\":\"formula_48\"},\"end\":37809,\"start\":37727},{\"attributes\":{\"id\":\"formula_49\"},\"end\":39790,\"start\":39745},{\"attributes\":{\"id\":\"formula_50\"},\"end\":40738,\"start\":40713},{\"attributes\":{\"id\":\"formula_51\"},\"end\":40856,\"start\":40799},{\"attributes\":{\"id\":\"formula_52\"},\"end\":40986,\"start\":40958},{\"attributes\":{\"id\":\"formula_53\"},\"end\":41149,\"start\":41107},{\"attributes\":{\"id\":\"formula_54\"},\"end\":41222,\"start\":41169},{\"attributes\":{\"id\":\"formula_55\"},\"end\":41430,\"start\":41413},{\"attributes\":{\"id\":\"formula_56\"},\"end\":42412,\"start\":42355},{\"attributes\":{\"id\":\"formula_57\"},\"end\":42785,\"start\":42758},{\"attributes\":{\"id\":\"formula_58\"},\"end\":42898,\"start\":42857},{\"attributes\":{\"id\":\"formula_59\"},\"end\":43920,\"start\":43805},{\"attributes\":{\"id\":\"formula_60\"},\"end\":44229,\"start\":44197},{\"attributes\":{\"id\":\"formula_61\"},\"end\":44539,\"start\":44427},{\"attributes\":{\"id\":\"formula_62\"},\"end\":45441,\"start\":45428},{\"attributes\":{\"id\":\"formula_63\"},\"end\":45737,\"start\":45686},{\"attributes\":{\"id\":\"formula_64\"},\"end\":47472,\"start\":47441},{\"attributes\":{\"id\":\"formula_65\"},\"end\":47564,\"start\":47542},{\"attributes\":{\"id\":\"formula_66\"},\"end\":48179,\"start\":48035},{\"attributes\":{\"id\":\"formula_67\"},\"end\":48744,\"start\":48692},{\"attributes\":{\"id\":\"formula_68\"},\"end\":48958,\"start\":48915},{\"attributes\":{\"id\":\"formula_69\"},\"end\":49419,\"start\":49363},{\"attributes\":{\"id\":\"formula_70\"},\"end\":49715,\"start\":49577},{\"attributes\":{\"id\":\"formula_71\"},\"end\":51531,\"start\":51427},{\"attributes\":{\"id\":\"formula_72\"},\"end\":51777,\"start\":51746},{\"attributes\":{\"id\":\"formula_73\"},\"end\":51886,\"start\":51810},{\"attributes\":{\"id\":\"formula_74\"},\"end\":52473,\"start\":52443},{\"attributes\":{\"id\":\"formula_75\"},\"end\":52616,\"start\":52583},{\"attributes\":{\"id\":\"formula_76\"},\"end\":53286,\"start\":53257},{\"attributes\":{\"id\":\"formula_77\"},\"end\":53332,\"start\":53286},{\"attributes\":{\"id\":\"formula_78\"},\"end\":53797,\"start\":53768},{\"attributes\":{\"id\":\"formula_79\"},\"end\":57228,\"start\":57177},{\"attributes\":{\"id\":\"formula_80\"},\"end\":57590,\"start\":57543},{\"attributes\":{\"id\":\"formula_81\"},\"end\":58292,\"start\":58195},{\"attributes\":{\"id\":\"formula_82\"},\"end\":58451,\"start\":58426},{\"attributes\":{\"id\":\"formula_83\"},\"end\":58817,\"start\":58796},{\"attributes\":{\"id\":\"formula_84\"},\"end\":59070,\"start\":59021},{\"attributes\":{\"id\":\"formula_85\"},\"end\":59328,\"start\":59277},{\"attributes\":{\"id\":\"formula_86\"},\"end\":59888,\"start\":59851},{\"attributes\":{\"id\":\"formula_87\"},\"end\":60008,\"start\":59962},{\"attributes\":{\"id\":\"formula_88\"},\"end\":60503,\"start\":60453},{\"attributes\":{\"id\":\"formula_89\"},\"end\":61009,\"start\":60844},{\"attributes\":{\"id\":\"formula_90\"},\"end\":62325,\"start\":62300},{\"attributes\":{\"id\":\"formula_91\"},\"end\":62691,\"start\":62502},{\"attributes\":{\"id\":\"formula_92\"},\"end\":62916,\"start\":62794},{\"attributes\":{\"id\":\"formula_93\"},\"end\":63186,\"start\":63156},{\"attributes\":{\"id\":\"formula_94\"},\"end\":63396,\"start\":63257},{\"attributes\":{\"id\":\"formula_95\"},\"end\":63643,\"start\":63586},{\"attributes\":{\"id\":\"formula_96\"},\"end\":63835,\"start\":63778},{\"attributes\":{\"id\":\"formula_97\"},\"end\":63898,\"start\":63866},{\"attributes\":{\"id\":\"formula_98\"},\"end\":64078,\"start\":64039},{\"attributes\":{\"id\":\"formula_99\"},\"end\":64507,\"start\":64324},{\"attributes\":{\"id\":\"formula_100\"},\"end\":64619,\"start\":64554},{\"attributes\":{\"id\":\"formula_101\"},\"end\":65001,\"start\":64989},{\"attributes\":{\"id\":\"formula_102\"},\"end\":65111,\"start\":65077},{\"attributes\":{\"id\":\"formula_103\"},\"end\":65827,\"start\":65793},{\"attributes\":{\"id\":\"formula_104\"},\"end\":66132,\"start\":66081},{\"attributes\":{\"id\":\"formula_105\"},\"end\":67033,\"start\":66959},{\"attributes\":{\"id\":\"formula_106\"},\"end\":67132,\"start\":67100},{\"attributes\":{\"id\":\"formula_107\"},\"end\":67312,\"start\":67226},{\"attributes\":{\"id\":\"formula_108\"},\"end\":68139,\"start\":68073}]", "table_ref": null, "section_header": "[{\"attributes\":{\"n\":\"1.\"},\"end\":637,\"start\":625},{\"attributes\":{\"n\":\"1.3.\"},\"end\":3118,\"start\":3083},{\"end\":4498,\"start\":4494},{\"attributes\":{\"n\":\"2.\"},\"end\":24220,\"start\":24170},{\"attributes\":{\"n\":\"2.4.\"},\"end\":27842,\"start\":27829},{\"attributes\":{\"n\":\"3.\"},\"end\":34282,\"start\":34235},{\"end\":34510,\"start\":34506},{\"end\":35385,\"start\":35381},{\"attributes\":{\"n\":\"4.\"},\"end\":38408,\"start\":38367},{\"end\":39973,\"start\":39969},{\"end\":41693,\"start\":41689},{\"attributes\":{\"n\":\"5.\"},\"end\":43415,\"start\":43395},{\"attributes\":{\"n\":\"5.1.\"},\"end\":43527,\"start\":43500},{\"attributes\":{\"n\":\"5.2.\"},\"end\":45183,\"start\":45159},{\"end\":50076,\"start\":50066},{\"attributes\":{\"n\":\"6.\"},\"end\":50112,\"start\":50097},{\"attributes\":{\"n\":\"7.\"},\"end\":56682,\"start\":56658},{\"attributes\":{\"n\":\"8.\"},\"end\":62964,\"start\":62939},{\"attributes\":{\"n\":\"9.\"},\"end\":65518,\"start\":65504},{\"attributes\":{\"n\":\"10.\"},\"end\":68564,\"start\":68518},{\"end\":72835,\"start\":72820},{\"end\":72919,\"start\":72912},{\"end\":73498,\"start\":73493},{\"end\":73577,\"start\":73572},{\"end\":73687,\"start\":73669},{\"end\":74179,\"start\":74173},{\"end\":76185,\"start\":76180},{\"end\":76356,\"start\":76347},{\"end\":76474,\"start\":76462},{\"end\":76879,\"start\":76866},{\"end\":77050,\"start\":77044},{\"end\":77114,\"start\":77095},{\"end\":77229,\"start\":77214},{\"end\":77690,\"start\":77685},{\"end\":77827,\"start\":77808},{\"end\":77936,\"start\":77935}]", "table": null, "figure_caption": "[{\"end\":72818,\"start\":72607},{\"end\":72910,\"start\":72838},{\"end\":73491,\"start\":72922},{\"end\":73570,\"start\":73500},{\"end\":73667,\"start\":73579},{\"end\":74171,\"start\":73689},{\"end\":74888,\"start\":74181},{\"end\":76178,\"start\":74891},{\"end\":76345,\"start\":76187},{\"end\":76460,\"start\":76359},{\"end\":76771,\"start\":76476},{\"end\":76864,\"start\":76774},{\"end\":77042,\"start\":76882},{\"end\":77093,\"start\":77053},{\"end\":77212,\"start\":77117},{\"end\":77259,\"start\":77232},{\"end\":77683,\"start\":77262},{\"end\":77806,\"start\":77692},{\"end\":77933,\"start\":77830},{\"end\":78012,\"start\":77937}]", "figure_ref": "[{\"attributes\":{\"ref_id\":\"fig_6\"},\"end\":34430,\"start\":34419},{\"end\":35077,\"start\":35070},{\"end\":35359,\"start\":35352}]", "bib_author_first_name": "[{\"end\":78244,\"start\":78243},{\"end\":78255,\"start\":78254},{\"end\":78429,\"start\":78428},{\"end\":78675,\"start\":78674},{\"end\":78692,\"start\":78691},{\"end\":78844,\"start\":78843},{\"end\":78861,\"start\":78860},{\"end\":79019,\"start\":79018},{\"end\":79028,\"start\":79027},{\"end\":79316,\"start\":79315},{\"end\":79325,\"start\":79324},{\"end\":79333,\"start\":79332},{\"end\":79335,\"start\":79334},{\"end\":79596,\"start\":79595},{\"end\":79782,\"start\":79781},{\"end\":80292,\"start\":80291},{\"end\":80302,\"start\":80301},{\"end\":80480,\"start\":80479},{\"end\":80666,\"start\":80665},{\"end\":80673,\"start\":80672},{\"end\":80828,\"start\":80827},{\"end\":80842,\"start\":80841},{\"end\":80853,\"start\":80852},{\"end\":81049,\"start\":81045},{\"end\":81229,\"start\":81228},{\"end\":81756,\"start\":81755},{\"end\":81766,\"start\":81765},{\"end\":81967,\"start\":81966},{\"end\":82429,\"start\":82428},{\"end\":82624,\"start\":82623},{\"end\":82636,\"start\":82635},{\"end\":82780,\"start\":82779},{\"end\":83152,\"start\":83151},{\"end\":83301,\"start\":83300},{\"end\":83309,\"start\":83308},{\"end\":83317,\"start\":83316},{\"end\":83326,\"start\":83325},{\"end\":83343,\"start\":83342},{\"end\":83353,\"start\":83352},{\"end\":83361,\"start\":83360},{\"end\":83370,\"start\":83369},{\"end\":83625,\"start\":83624},{\"end\":83812,\"start\":83811},{\"end\":84008,\"start\":84007},{\"end\":84195,\"start\":84194},{\"end\":84404,\"start\":84403},{\"end\":84708,\"start\":84707},{\"end\":84719,\"start\":84718},{\"end\":84951,\"start\":84950},{\"end\":84963,\"start\":84962},{\"end\":85200,\"start\":85199},{\"end\":85388,\"start\":85387},{\"end\":85562,\"start\":85561},{\"end\":85763,\"start\":85762},{\"end\":85959,\"start\":85958},{\"end\":86065,\"start\":86064},{\"end\":86075,\"start\":86074},{\"end\":86087,\"start\":86086},{\"end\":86099,\"start\":86098},{\"end\":86397,\"start\":86396},{\"end\":86407,\"start\":86406},{\"end\":86525,\"start\":86524},{\"end\":86535,\"start\":86534},{\"end\":86730,\"start\":86729},{\"end\":86732,\"start\":86731},{\"end\":86984,\"start\":86983},{\"end\":86986,\"start\":86985},{\"end\":86997,\"start\":86996},{\"end\":87006,\"start\":86998},{\"end\":87250,\"start\":87249},{\"end\":87396,\"start\":87395},{\"end\":87570,\"start\":87569},{\"end\":87582,\"start\":87581},{\"end\":87870,\"start\":87869},{\"end\":87882,\"start\":87881},{\"end\":88084,\"start\":88083},{\"end\":88276,\"start\":88275},{\"end\":88468,\"start\":88467},{\"end\":88653,\"start\":88652},{\"end\":88859,\"start\":88858},{\"end\":88998,\"start\":88997}]", "bib_author_last_name": "[{\"end\":78252,\"start\":78245},{\"end\":78264,\"start\":78256},{\"end\":78443,\"start\":78430},{\"end\":78689,\"start\":78676},{\"end\":78698,\"start\":78693},{\"end\":78858,\"start\":78845},{\"end\":78870,\"start\":78862},{\"end\":79025,\"start\":79020},{\"end\":79039,\"start\":79029},{\"end\":79322,\"start\":79317},{\"end\":79330,\"start\":79326},{\"end\":79341,\"start\":79336},{\"end\":79606,\"start\":79597},{\"end\":79792,\"start\":79783},{\"end\":80299,\"start\":80293},{\"end\":80311,\"start\":80303},{\"end\":80497,\"start\":80481},{\"end\":80670,\"start\":80667},{\"end\":80678,\"start\":80674},{\"end\":80839,\"start\":80829},{\"end\":80850,\"start\":80843},{\"end\":80861,\"start\":80854},{\"end\":81060,\"start\":81050},{\"end\":81237,\"start\":81230},{\"end\":81763,\"start\":81757},{\"end\":81774,\"start\":81767},{\"end\":81976,\"start\":81968},{\"end\":82438,\"start\":82430},{\"end\":82633,\"start\":82625},{\"end\":82640,\"start\":82637},{\"end\":82786,\"start\":82781},{\"end\":83160,\"start\":83153},{\"end\":83306,\"start\":83302},{\"end\":83314,\"start\":83310},{\"end\":83323,\"start\":83318},{\"end\":83340,\"start\":83327},{\"end\":83350,\"start\":83344},{\"end\":83358,\"start\":83354},{\"end\":83367,\"start\":83362},{\"end\":83377,\"start\":83371},{\"end\":83631,\"start\":83626},{\"end\":83819,\"start\":83813},{\"end\":84016,\"start\":84009},{\"end\":84203,\"start\":84196},{\"end\":84412,\"start\":84405},{\"end\":84716,\"start\":84709},{\"end\":84727,\"start\":84720},{\"end\":84960,\"start\":84952},{\"end\":84970,\"start\":84964},{\"end\":85204,\"start\":85201},{\"end\":85396,\"start\":85389},{\"end\":85570,\"start\":85563},{\"end\":85770,\"start\":85764},{\"end\":85966,\"start\":85960},{\"end\":86072,\"start\":86066},{\"end\":86084,\"start\":86076},{\"end\":86096,\"start\":86088},{\"end\":86113,\"start\":86100},{\"end\":86404,\"start\":86398},{\"end\":86416,\"start\":86408},{\"end\":86532,\"start\":86526},{\"end\":86549,\"start\":86536},{\"end\":86741,\"start\":86733},{\"end\":86994,\"start\":86987},{\"end\":87013,\"start\":87007},{\"end\":87259,\"start\":87251},{\"end\":87402,\"start\":87397},{\"end\":87579,\"start\":87571},{\"end\":87594,\"start\":87583},{\"end\":87879,\"start\":87871},{\"end\":87896,\"start\":87883},{\"end\":88090,\"start\":88085},{\"end\":88282,\"start\":88277},{\"end\":88476,\"start\":88469},{\"end\":88669,\"start\":88654},{\"end\":88875,\"start\":88860},{\"end\":89008,\"start\":88999}]", "bib_entry": "[{\"attributes\":{\"id\":\"b0\",\"matched_paper_id\":18533009},\"end\":78370,\"start\":78216},{\"attributes\":{\"id\":\"b1\",\"matched_paper_id\":16849548},\"end\":78670,\"start\":78372},{\"attributes\":{\"id\":\"b2\"},\"end\":78760,\"start\":78672},{\"attributes\":{\"id\":\"b3\"},\"end\":79016,\"start\":78762},{\"attributes\":{\"doi\":\"arXiv:0707.1337\",\"id\":\"b4\"},\"end\":79220,\"start\":79018},{\"attributes\":{\"id\":\"b5\",\"matched_paper_id\":825593},\"end\":79527,\"start\":79222},{\"attributes\":{\"id\":\"b6\",\"matched_paper_id\":121736154},\"end\":79749,\"start\":79529},{\"attributes\":{\"id\":\"b7\",\"matched_paper_id\":115993033},\"end\":80013,\"start\":79751},{\"attributes\":{\"id\":\"b8\"},\"end\":80245,\"start\":80015},{\"attributes\":{\"id\":\"b9\",\"matched_paper_id\":14890248},\"end\":80422,\"start\":80247},{\"attributes\":{\"id\":\"b10\",\"matched_paper_id\":2770458},\"end\":80623,\"start\":80424},{\"attributes\":{\"id\":\"b11\"},\"end\":80752,\"start\":80625},{\"attributes\":{\"id\":\"b12\",\"matched_paper_id\":15329396},\"end\":81043,\"start\":80754},{\"attributes\":{\"doi\":\"arXiv:0801.0820\",\"id\":\"b13\"},\"end\":81226,\"start\":81045},{\"attributes\":{\"id\":\"b14\"},\"end\":81655,\"start\":81228},{\"attributes\":{\"id\":\"b15\",\"matched_paper_id\":123648880},\"end\":81964,\"start\":81657},{\"attributes\":{\"id\":\"b16\"},\"end\":82426,\"start\":81966},{\"attributes\":{\"doi\":\"arXiv:0905.0686\",\"id\":\"b17\"},\"end\":82565,\"start\":82428},{\"attributes\":{\"id\":\"b18\",\"matched_paper_id\":18551430},\"end\":82777,\"start\":82567},{\"attributes\":{\"id\":\"b19\"},\"end\":83078,\"start\":82779},{\"attributes\":{\"id\":\"b20\",\"matched_paper_id\":43668013},\"end\":83298,\"start\":83080},{\"attributes\":{\"id\":\"b21\"},\"end\":83622,\"start\":83300},{\"attributes\":{\"doi\":\"arXiv:math/9912109\",\"id\":\"b22\"},\"end\":83809,\"start\":83624},{\"attributes\":{\"doi\":\"arXiv:0704.3417\",\"id\":\"b23\"},\"end\":83948,\"start\":83811},{\"attributes\":{\"id\":\"b24\",\"matched_paper_id\":1490519},\"end\":84154,\"start\":83950},{\"attributes\":{\"id\":\"b25\",\"matched_paper_id\":2490080},\"end\":84324,\"start\":84156},{\"attributes\":{\"id\":\"b26\"},\"end\":84643,\"start\":84326},{\"attributes\":{\"id\":\"b27\",\"matched_paper_id\":122648418},\"end\":84875,\"start\":84645},{\"attributes\":{\"id\":\"b28\",\"matched_paper_id\":14850346},\"end\":85129,\"start\":84877},{\"attributes\":{\"id\":\"b29\",\"matched_paper_id\":13994125},\"end\":85337,\"start\":85131},{\"attributes\":{\"id\":\"b30\",\"matched_paper_id\":121133856},\"end\":85506,\"start\":85339},{\"attributes\":{\"id\":\"b31\",\"matched_paper_id\":15026232},\"end\":85699,\"start\":85508},{\"attributes\":{\"id\":\"b32\",\"matched_paper_id\":120869695},\"end\":85892,\"start\":85701},{\"attributes\":{\"id\":\"b33\"},\"end\":86062,\"start\":85894},{\"attributes\":{\"doi\":\"arXiv:math/0809.3976\",\"id\":\"b34\"},\"end\":86346,\"start\":86064},{\"attributes\":{\"id\":\"b35\"},\"end\":86522,\"start\":86348},{\"attributes\":{\"doi\":\"arXiv:math/0705.1653\",\"id\":\"b36\"},\"end\":86727,\"start\":86524},{\"attributes\":{\"doi\":\"arXiv:math/0501213\",\"id\":\"b37\"},\"end\":86904,\"start\":86729},{\"attributes\":{\"id\":\"b38\",\"matched_paper_id\":12284829},\"end\":87194,\"start\":86906},{\"attributes\":{\"id\":\"b39\",\"matched_paper_id\":14127476},\"end\":87393,\"start\":87196},{\"attributes\":{\"doi\":\"arXiv:0811.4454\",\"id\":\"b40\"},\"end\":87567,\"start\":87395},{\"attributes\":{\"doi\":\"arXiv:0908.4052\",\"id\":\"b41\"},\"end\":87802,\"start\":87569},{\"attributes\":{\"doi\":\"math.AG/0411210\",\"id\":\"b42\"},\"end\":88028,\"start\":87804},{\"attributes\":{\"id\":\"b43\",\"matched_paper_id\":54571505},\"end\":88201,\"start\":88030},{\"attributes\":{\"id\":\"b44\",\"matched_paper_id\":122383435},\"end\":88411,\"start\":88203},{\"attributes\":{\"id\":\"b45\",\"matched_paper_id\":16901581},\"end\":88600,\"start\":88413},{\"attributes\":{\"id\":\"b46\",\"matched_paper_id\":11291485},\"end\":88818,\"start\":88602},{\"attributes\":{\"id\":\"b47\"},\"end\":88964,\"start\":88820},{\"attributes\":{\"id\":\"b48\",\"matched_paper_id\":119595057},\"end\":89120,\"start\":88966}]", "bib_title": "[{\"end\":78241,\"start\":78216},{\"end\":78426,\"start\":78372},{\"end\":79313,\"start\":79222},{\"end\":79593,\"start\":79529},{\"end\":79779,\"start\":79751},{\"end\":80289,\"start\":80247},{\"end\":80477,\"start\":80424},{\"end\":80825,\"start\":80754},{\"end\":81753,\"start\":81657},{\"end\":82621,\"start\":82567},{\"end\":83149,\"start\":83080},{\"end\":84005,\"start\":83950},{\"end\":84192,\"start\":84156},{\"end\":84401,\"start\":84326},{\"end\":84705,\"start\":84645},{\"end\":84948,\"start\":84877},{\"end\":85197,\"start\":85131},{\"end\":85385,\"start\":85339},{\"end\":85559,\"start\":85508},{\"end\":85760,\"start\":85701},{\"end\":86981,\"start\":86906},{\"end\":87247,\"start\":87196},{\"end\":88081,\"start\":88030},{\"end\":88273,\"start\":88203},{\"end\":88465,\"start\":88413},{\"end\":88650,\"start\":88602},{\"end\":88995,\"start\":88966}]", "bib_author": "[{\"end\":78254,\"start\":78243},{\"end\":78266,\"start\":78254},{\"end\":78445,\"start\":78428},{\"end\":78691,\"start\":78674},{\"end\":78700,\"start\":78691},{\"end\":78860,\"start\":78843},{\"end\":78872,\"start\":78860},{\"end\":79027,\"start\":79018},{\"end\":79041,\"start\":79027},{\"end\":79324,\"start\":79315},{\"end\":79332,\"start\":79324},{\"end\":79343,\"start\":79332},{\"end\":79608,\"start\":79595},{\"end\":79794,\"start\":79781},{\"end\":80301,\"start\":80291},{\"end\":80313,\"start\":80301},{\"end\":80499,\"start\":80479},{\"end\":80672,\"start\":80665},{\"end\":80680,\"start\":80672},{\"end\":80841,\"start\":80827},{\"end\":80852,\"start\":80841},{\"end\":80863,\"start\":80852},{\"end\":81062,\"start\":81045},{\"end\":81239,\"start\":81228},{\"end\":81765,\"start\":81755},{\"end\":81776,\"start\":81765},{\"end\":81978,\"start\":81966},{\"end\":82440,\"start\":82428},{\"end\":82635,\"start\":82623},{\"end\":82642,\"start\":82635},{\"end\":82788,\"start\":82779},{\"end\":83162,\"start\":83151},{\"end\":83308,\"start\":83300},{\"end\":83316,\"start\":83308},{\"end\":83325,\"start\":83316},{\"end\":83342,\"start\":83325},{\"end\":83352,\"start\":83342},{\"end\":83360,\"start\":83352},{\"end\":83369,\"start\":83360},{\"end\":83379,\"start\":83369},{\"end\":83633,\"start\":83624},{\"end\":83821,\"start\":83811},{\"end\":84018,\"start\":84007},{\"end\":84205,\"start\":84194},{\"end\":84414,\"start\":84403},{\"end\":84718,\"start\":84707},{\"end\":84729,\"start\":84718},{\"end\":84962,\"start\":84950},{\"end\":84972,\"start\":84962},{\"end\":85206,\"start\":85199},{\"end\":85398,\"start\":85387},{\"end\":85572,\"start\":85561},{\"end\":85772,\"start\":85762},{\"end\":85968,\"start\":85958},{\"end\":86074,\"start\":86064},{\"end\":86086,\"start\":86074},{\"end\":86098,\"start\":86086},{\"end\":86115,\"start\":86098},{\"end\":86406,\"start\":86396},{\"end\":86418,\"start\":86406},{\"end\":86534,\"start\":86524},{\"end\":86551,\"start\":86534},{\"end\":86743,\"start\":86729},{\"end\":86996,\"start\":86983},{\"end\":87015,\"start\":86996},{\"end\":87261,\"start\":87249},{\"end\":87404,\"start\":87395},{\"end\":87581,\"start\":87569},{\"end\":87596,\"start\":87581},{\"end\":87881,\"start\":87869},{\"end\":87898,\"start\":87881},{\"end\":88092,\"start\":88083},{\"end\":88284,\"start\":88275},{\"end\":88478,\"start\":88467},{\"end\":88671,\"start\":88652},{\"end\":88877,\"start\":88858},{\"end\":89010,\"start\":88997}]", "bib_venue": "[{\"end\":78278,\"start\":78266},{\"end\":78485,\"start\":78445},{\"end\":78841,\"start\":78762},{\"end\":79114,\"start\":79056},{\"end\":79360,\"start\":79343},{\"end\":79626,\"start\":79608},{\"end\":79841,\"start\":79794},{\"end\":80128,\"start\":80015},{\"end\":80323,\"start\":80313},{\"end\":80511,\"start\":80499},{\"end\":80663,\"start\":80625},{\"end\":80881,\"start\":80863},{\"end\":81133,\"start\":81077},{\"end\":81313,\"start\":81239},{\"end\":81792,\"start\":81776},{\"end\":82061,\"start\":81978},{\"end\":82494,\"start\":82455},{\"end\":82658,\"start\":82642},{\"end\":82831,\"start\":82788},{\"end\":83174,\"start\":83162},{\"end\":83394,\"start\":83379},{\"end\":83714,\"start\":83651},{\"end\":83877,\"start\":83836},{\"end\":84038,\"start\":84018},{\"end\":84222,\"start\":84205},{\"end\":84437,\"start\":84414},{\"end\":84741,\"start\":84729},{\"end\":84985,\"start\":84972},{\"end\":85220,\"start\":85206},{\"end\":85411,\"start\":85398},{\"end\":85591,\"start\":85572},{\"end\":85784,\"start\":85772},{\"end\":85956,\"start\":85894},{\"end\":86198,\"start\":86135},{\"end\":86394,\"start\":86348},{\"end\":86620,\"start\":86571},{\"end\":86813,\"start\":86761},{\"end\":87035,\"start\":87015},{\"end\":87281,\"start\":87261},{\"end\":87478,\"start\":87419},{\"end\":87681,\"start\":87611},{\"end\":87867,\"start\":87804},{\"end\":88104,\"start\":88092},{\"end\":88293,\"start\":88284},{\"end\":88487,\"start\":88478},{\"end\":88696,\"start\":88671},{\"end\":88856,\"start\":88820},{\"end\":89026,\"start\":89010},{\"end\":81329,\"start\":81315},{\"end\":82072,\"start\":82063},{\"end\":82853,\"start\":82833},{\"end\":83410,\"start\":83396}]"}}}, "year": 2023, "month": 12, "day": 17}