{"id": 7684883, "updated": "2023-09-29 03:59:04.915", "metadata": {"title": "ScanNet: Richly-annotated 3D Reconstructions of Indoor Scenes", "authors": "[{\"first\":\"Angela\",\"last\":\"Dai\",\"middle\":[]},{\"first\":\"Angel\",\"last\":\"Chang\",\"middle\":[\"X.\"]},{\"first\":\"Manolis\",\"last\":\"Savva\",\"middle\":[]},{\"first\":\"Maciej\",\"last\":\"Halber\",\"middle\":[]},{\"first\":\"Thomas\",\"last\":\"Funkhouser\",\"middle\":[]},{\"first\":\"Matthias\",\"last\":\"Niessner\",\"middle\":[]}]", "venue": "2017 IEEE Conference on Computer Vision and Pattern Recognition (CVPR)", "journal": "2017 IEEE Conference on Computer Vision and Pattern Recognition (CVPR)", "publication_date": {"year": 2017, "month": 2, "day": 14}, "abstract": "A key requirement for leveraging supervised deep learning methods is the availability of large, labeled datasets. Unfortunately, in the context of RGB-D scene understanding, very little data is available -- current datasets cover a small range of scene views and have limited semantic annotations. To address this issue, we introduce ScanNet, an RGB-D video dataset containing 2.5M views in 1513 scenes annotated with 3D camera poses, surface reconstructions, and semantic segmentations. To collect this data, we designed an easy-to-use and scalable RGB-D capture system that includes automated surface reconstruction and crowdsourced semantic annotation. We show that using this data helps achieve state-of-the-art performance on several 3D scene understanding tasks, including 3D object classification, semantic voxel labeling, and CAD model retrieval. The dataset is freely available at http://www.scan-net.org.", "fields_of_study": "[\"Computer Science\"]", "external_ids": {"arxiv": "1702.04405", "mag": "2950493473", "acl": null, "pubmed": null, "pubmedcentral": null, "dblp": "journals/corr/DaiCSHFN17", "doi": "10.1109/cvpr.2017.261"}}, "content": {"source": {"pdf_hash": "478261574ddc6cf297611000735aa9808f8f0030", "pdf_src": "Arxiv", "pdf_uri": "[\"https://arxiv.org/pdf/1702.04405v1.pdf\"]", "oa_url_match": true, "oa_info": {"license": null, "open_access_url": "http://arxiv.org/pdf/1702.04405", "status": "GREEN"}}, "grobid": {"id": "faf07240b9287a8482f082bd99a974860ad861c5", "type": "plain-text", "url": "s3://ai2-s2-pdf-extraction-prod/parse-results/s2orc_worker/478261574ddc6cf297611000735aa9808f8f0030.txt", "contents": "\nScanNet: Richly-annotated 3D Reconstructions of Indoor Scenes\n\n\nAngela Dai \nStanford University\n\n\nAngel X Chang \nPrinceton University\n\n\nManolis Savva \nPrinceton University\n\n\nMaciej Halber \nPrinceton University\n\n\nThomas Funkhouser \nPrinceton University\n\n\nMatthias Nießner \nStanford University\n\n\nScanNet: Richly-annotated 3D Reconstructions of Indoor Scenes\n\nA key requirement for leveraging supervised deep learning methods is the availability of large, labeled datasets. Unfortunately, in the context of RGB-D scene understanding, very little data is available -current datasets cover a small range of scene views and have limited semantic annotations. To address this issue, we introduce Scan-Net, an RGB-D video dataset containing 2.5M views in 1513 scenes annotated with 3D camera poses, surface reconstructions, and semantic segmentations. To collect this data, we designed an easy-to-use and scalable RGB-D capture system that includes automated surface reconstruction and crowdsourced semantic annotation.We show that using this data helps achieve state-of-the-art performance on several 3D scene understanding tasks, including 3D object classification, semantic voxel labeling, and CAD model retrieval. The dataset is freely available at http://www. scan-net.org.\n\nIntroduction\n\nSince the introduction of commodity RGB-D sensors, such as the Microsoft Kinect, the field of 3D geometry capture has gained significant attention and opened up a wide range of new applications. Although there has been significant effort on 3D reconstruction algorithms, general 3D scene understanding with RGB-D data has only very recently started to become popular. Research along semantic understanding is also heavily facilitated by the rapid progress of modern machine learning methods, such as neural models. One key to successfully applying theses approaches is the availability of large, labeled datasets. While much effort has been made on 2D datasets [17,42,45], where images can be downloaded from the web and directly annotated, the situation for 3D data is more challenging. Thus, many of the current RGB-D datasets [71,89,74,30] are orders of magnitude smaller than their 2D counterparts. Typically, 3D deep learning methods use synthetic data to mitigate this lack of real-world data [88,6]. One of the reasons that current 3D datasets are small is because their capture requires much more effort, and efficiently providing (dense) annotations in 3D is non-trivial. Thus, existing work on 3D datasets often fall back to polygon or bounding box annotations on 2.5D RGB-D images [71,89,74], rather than directly annotating in 3D. In the latter case, labels are added manually by expert users (typically by the paper authors) [30,68] which limits their overall size and scalability.\n\nIn this paper, we introduce ScanNet, a dataset of richlyannotated RGB-D scans of real-world environments containing 2.5M RGB-D images in 1513 scans acquired in 707 distinct spaces. The sheer magnitude of this dataset is larger than any other [55,78,89,72,3,68,30]. However, what makes it particularly valuable for research in scene understanding is its annotation with estimated calibration parameters, camera poses, 3D surface reconstructions, textured meshes, dense object-level semantic segmentations, and aligned CAD models (see Fig. 2). The semantic segmentations are more than an order of magnitude larger than any previous RGB-D dataset.\n\n\nDataset\n\n\nSize\n\nLabels Annotation Tool Reconstruction CAD Models NYU v2 [55] 464 scans 1449 frames 2D LabelMe-style [66] none some [25] TUM [78] 47 scans none -aligned poses (Vicon) no SUN 3D [89] 415 scans 8 scans 2D polygons aligned poses [89] no SUN RGB-D [72] 10k frames 10k frames 2D polygons + bounding boxes aligned poses [89] no BuildingParser [3] 265 rooms 265 rooms CloudCompare [24] point cloud no PiGraphs [68] 26 scans 26 scans dense 3D, by the authors [68] dense 3D [59] no SceneNN [30] 100 scans 100 scans dense 3D, by the authors [57] dense 3D [9] no ScanNet (ours) 1513 scans 1513 scans dense 3D, crowd-sourced MTurk dense 3D [12] yes 2.5M frames labels also proj. to 2D frames Table 1. Overview of RGB-D datasets for 3D reconstruction and semantic scene understanding. Note that in addition to the 1513 scans in ScanNet, we also provided dense 3D reconstruction and annotations on all NYU v2 sequences.\n\nIn the collection of this dataset, we have considered two main research questions: 1) how can we design a framework that allows many people to collect and annotate large amounts of RGB-D data, and 2) can we use the rich annotations and data quantity provided in ScanNet to learn better 3D models for scene understanding?\n\nTo investigate the first question, we built a capture pipeline to help novices acquire semantically-labeled 3D models of scenes. A person uses an app on an iPad mounted with a depth camera to acquire RGB-D video, and then we processes the data off-line and return a complete semantically-labeled 3D reconstruction of the scene. The challenges in developing such a framework are numerous, including how to perform 3D surface reconstruction robustly in a scalable pipeline and how to crowdsource semantic labeling. The paper discusses our study of these issues and documents our experience with scaling up RGB-D scan collection (20 people) and annotation (500 crowd workers).\n\nTo investigate the second question, we trained 3D deep networks with the data provided by ScanNet and tested their performance on several scene understanding tasks, including 3D object classification, semantic voxel labeling, and CAD model retrieval. For the semantic voxel labeling task, we introduce a new volumetric CNN architecture.\n\nOverall, the contributions of this paper are:\n\n• A large 3D dataset containing 1513 RGB-D scans of over 707 unique indoor environments with estimated camera parameters, surface reconstructions, textured meshes, semantic segmentations. We also provide CAD model placements for a subset of the scans. • A design for efficient 3D data capture and annotation suitable for novice users. • New RGB-D benchmarks and improved results for state-of-the art machine learning methods on 3D object classification, semantic voxel labeling, and CAD model retrieval.\n\n• A complete open source acquisition and annotation framework for dense RGB-D reconstructions.\n\n\nPrevious Work\n\nA large number of RGB-D datasets have been captured and made publicly available for training and benchmarking [53,32,48,62,76,80,71,4,55,78,15,52,1,65,29,49,21,46,41,89,77,58,69,90,34,16,33,54,38,28,67,50,43,92,72,9,31,82,68,30,3,10,75,2]. 1 These datasets have been used to train models for many 3D scene understanding tasks, including semantic segmentation [64,55,26,83], 3D object detection [70,44,27,73,74], 3D object classification [88,51,63], and others [91,22,23].\n\nMost RGB-D datasets contain scans of individual objects. For example, the Redwood dataset [10] contains over 10,000 scans of objects annotated with class labels, 1,781 of which are reconstructed with KinectFusion [56]. Since the objects are scanned in isolation without scene context, the dataset's focus is mainly on evaluating surface reconstruction quality rather than semantic understanding of complete scenes.\n\nOne of the earliest and most popular datasets for RGB-D scene understanding is NYU v2 [71]. It is composed of 464 short RGB-D sequences, from which 1449 frames have been annotated with 2D polygons denoting semantic segmentations, as in LabelMe [66]. SUN RGB-D [72] follows up on this work by collecting 10,335 RGB-D frames annotated with polygons in 2D and bounding boxes in 3D. These datasets have scene diversity comparable to ours, but include only a limited range of viewpoints, and do not provide complete 3D surface reconstructions, dense 3D semantic segmentations, or a large set of CAD model alignments.\n\nOne of the first RGB-D datasets focused on long RGB-D sequences in indoor environments is SUN3D. It contains a set of 415 Kinect v1 sequences of 254 unique spaces. Although some objects were annotated manually with 2D polygons, and 8 scans have estimated camera poses based\n\n\nRGB-D Scanning\n\n\n3D Reconstruction\n\n\nUpload\n\n\nSegmentation\n\nSemantic Labeling Retrieval + Alignment 3D Reconstruction Segmentation Crowdsourcing Semantic Labeling Retrieval + Alignment Figure 2. Overview of our RGB-D reconstruction and semantic annotation framework. Left: a novice user uses a handheld RGB-D device with our scanning interface to scan an environment. Mid: RGB-D sequences are uploaded to a processing server which produces 3D surface mesh reconstructions and their surface segmentations. Right: Semantic annotation tasks are issued for crowdsourcing to obtain instance-level object category annotations and 3D CAD model alignments to the reconstruction.\n\non user input, the bulk of the dataset does not include camera poses, 3D reconstructions, or semantic annotations. Recently, Armeni et al. [3,2] introduced an indoor dataset containing 3D meshes for 265 rooms captured with a custom Matterport camera and manually labeled with semantic annotations. The dataset is high-quality, but the capture pipeline is based on expensive and less portable hardware. Furthermore, only a fused point cloud is provided as output. Due to the lack of raw color and depth data, its applicability to research on reconstruction and scene understanding from raw RGB-D input is limited.\n\nThe datasets most similar to ours are SceneNN [30] and PiGraphs [68], which are composed of 100 and 26 densely reconstructed and labeled scenes respectively. The annotations are done directly in 3D [57,68]. However, both scanning and labeling are performed only by expert users (i.e. the authors), limiting the scalability of the system and the size of the dataset. In contrast, we design our RGB-D acquisition framework specifically for ease-of-use by untrained users and for scalable processing through crowdsourcing. This allows us to acquire a significantly larger dataset with more annotations (currently, 1513 sequences are reconstructed and labeled).\n\n\nDataset Acquisition Framework\n\nIn this section, we focus on the design of the framework used to acquire the ScanNet dataset (Fig. 2). We discuss design trade-offs in building the framework and relay findings on which methods were found to work best for large-scale RGB-D data collection and processing.\n\nOur main goal driving the design of our framework was to allow untrained users to capture semantically labeled surfaces of indoor scenes with commodity hardware. This design goal has broad implications on the choices made at every step of the process. The RGB-D scanning system must be trivial to use, the data processing must be robust and automatic, the semantic annotations must be crowdsourced, and the flow of data through the system must be handled by a tracking server. We discuss our approach to each of these issues in the following subsections.\n\n\nRGB-D Scanning\n\nHardware. There is a spectrum of choices for RGB-D sensor hardware. Our requirement for deployment to large groups of inexperienced users necessitates a portable and low-cost RGB-D sensor setup. We use the Structure sensor [60], a commodity RGB-D sensor with design similar to the Microsoft Kinect v1. We attach this sensor to a handheld device such as an iPhone or iPad (see Fig. 2 left)results in this paper were collected using iPad Air2 devices. The iPad RGB camera data is temporally synchronized with the depth sensor via hardware, thus providing synchronized depth and color capture at 30 Hz. Depth frames are captured at a resolution of 640 × 480 and color at 1296 × 968 pixels. We enable auto-white balance and auto-exposure by default. The sensor unit is calibrated once by the user to ensure accurate, registered color and depth data, as described in the following section.\n\nCalibration. Our use of commodity RGB-D sensors necessitates unwarping of depth data and alignment of depth and color data. Prior work has dealt with camera calibration in controlled lab conditions where more accurate equipment such as LIDAR scanners can be used to obtain undistortion data for commodity RGB-D sensors (e.g., Wang et al. [84]). However, for our procedure to be practical for novice users it needs to be based only on the portable commodity sensor setup. Therefore, the user only needs to print a checkerboard pattern on paper, place it on a large and flat surface, and capture an RGB-D sequence viewing the flat surface from close by to far away. This sequence, as well as a set of infrared and color frame pairs viewing the checkerboard from a variety of views, are uploaded by the user as input to the calibration. Our system then runs a calibration procedure based on [81,14] to obtain intrinsic parameters for both depth and color sensors, and an extrinsic transformation of depth to color. This process computes a depth undistortion lookup table f (x, y, d) which provides a depth correction for each image x, y coordinate at measured depth d. We find that this calibration procedure is easy for users and results in improved data and consequently enhanced reconstruction quality (see Fig. 3). User Interface. To make the capture process simple for untrained users, we designed an iOS app with a simple live RGB-D video capture UI (see Fig. 2 left). The user provides a name and scene type for the current scan and proceeds to record a sequence. During scanning, a log-scale RGB feature detector point metric is shown as a \"featurefulness\" bar to provide a rough measure of tracking robustness and reconstruction quality in different regions being scanned. This feature was critical for providing intuition to users who are not familiar with the constraints and limitations of 3D reconstruction algorithms.\n\nStorage. We store scans as compressed RGB-D data on the device flash memory so that a stable internet connection is not required during scanning. The user can upload scans to the processing server when convenient by pressing an \"upload\" button. Our sensor units used 128 GB iPad Air2 devices which allowed for several hours of recorded RGB-D video. In practice, the bottleneck was battery life rather than storage space. Depth is recorded as 16-bit unsigned short values and stored using standard zLib compression. RGB data is encoded with the H.264 codec with a high bitrate of 15 Mbps to prevent encoding artifacts. In addition to the RGB-D frames, we also record Inertial Measurement Unit (IMU) data, including acceleration, and angular velocities, using the Apple SDK. Timestamps are recorded for IMU, color, and depth images.\n\n\nSurface Reconstruction\n\nOnce data has been uploaded from the iPad to our server, the first processing step is to estimate a denselyreconstructed 3D surface mesh and 6-DoF camera poses for all RGB-D frames. To conform with the goal for an automated and scalable framework, we choose methods that favor robustness and processing speed such that uploaded recordings can be processed at near real-time rates with little supervision.\n\nDense Reconstruction. We use volumetric fusion [11] to perform the dense reconstruction, since this approach is widely used in the context of commodity RGB-D data. There is a large variety of algorithms targeting this scenario [56,85,7,59,35,86,40,9,87,36,12]. We chose the BundleFusion system [12] as it was designed and evaluated for similar sensor setups as ours, and provides real-time speed while being reasonably robust given handheld RGB-D video data.\n\nFor each input scan, we first run BundleFusion [12] at a voxel resolution of 1 cm 3 . BundleFusion produces accurate pose alignments which we then use to perform volumetric integration through VoxelHashing [59] and extract a high resolution surface mesh using the Marching Cubes algorithm on the implicit TSDF (4 mm 3 voxels). The mesh is then automatically cleaned up with a set of filtering steps to merge close vertices, delete duplicate and isolated mesh parts, and finally to downsample the mesh to high, medium, and low resolution versions (each level reducing the number of faces by a factor of two).\n\nOrientation. After the surface mesh is extracted, we automatically align it and all camera poses to a common coordinate frame with the z-axis set to the up vector, and the xy plane aligned with the floor plane. To perform this alignment, we first extract all planar regions of sufficient size, merge regions defined by the same plane, and sort them by normal (we use a normal threshold of 25 • and a planar offset threshold of 5 cm). We then determine a prior for the up vector by projecting the IMU gravity vectors for all frames into the coordinates of the first frame. This allows us to select the floor plane based on the scan bounding box and the normal that is most similar to the IMU up vector direction. Finally, we use a PCA on the mesh vertices to determine the rotation around the z-axis and translate the scan such that its bounds are within the positive octant of the coordinate system.\n\nValidation. This reconstruction process is automatically triggered when a scan is uploaded to the processing server and runs unsupervised. In order to establish a clean snapshot to construct the ScanNet dataset reported in this paper, we automatically discard scan sequences that are short, have high residual reconstruction error, or have low percentage of aligned frames. We then manually check for and discard reconstructions with noticeable misalignments.\n\n\nSemantic Annotation\n\nAfter a reconstruction is produced by the processing server, annotation HITs (Human Intelligence Tasks) are issued on the Amazon Mechanical Turk crowdsourcing market. The two HITs that we crowdsource are: i) instance- level object category labeling of all surfaces in the reconstruction, and ii) 3D CAD model alignment to the reconstruction. These annotations are crowdsourced using webbased interfaces to again maintain the overall scalability of the framework.\n\nInstance-level Semantic Labeling. Our first annotation step is to obtain a set of object instance-level labels directly on each reconstructed 3D surface mesh. This is in contrast to much prior work that uses 2D polygon annotations on RGB or RGB-D images, or 3D bounding box annotations.\n\nWe developed a WebGL interface that takes as input the low-resolution surface mesh of a given reconstruction and a conservative over-segmentation of the mesh using a normalbased graph cut method [19,37]. The crowd worker then selects segments to annotate with instance-level object category labels (see Fig. 4). Each worker is required to annotate at least 25% of the surfaces in a reconstruction, and encouraged to annotate more than 50% before submission. Each scan is annotated by multiple workers (scans in ScanNet are annotated by 2.3 workers on average).\n\nA key challenge in designing this interface is to allow for efficient annotation by workers who have no prior experience with the task, or 3D interfaces in general. Our interface uses a simple painting metaphor where clicking and dragging over surfaces paints segments with a given label and corresponding color. This functions similarly to 2D painting and allows for erasing and modifying existing regions.\n\nAnother design requirement is to allow users to provide freeform text labels to reduce the inherent bias and scalability issues of pre-selected label lists. At the same time, it is desirable to guide users for consistency and coverage of basic object types. To achieve this consistency and improve labeling efficiency, the interface provides autocomplete functionality over all labels previously provided by other workers that pass a frequency threshold (more than five annotations). Workers are always allowed to add arbi- Figure 5. Crowdsourcing interface for aligning CAD models to objects in a reconstruction. Objects can be clicked to initiate an assisted search for CAD models (see list of bookshelves in middle). A suggested model is placed at the position of the clicked object, and the user then refines the position and orientation. A desk, chair, and nightstand have been already placed here.\n\ntrary text labels to ensure coverage and allow expansion of the label set.\n\nSeveral additional design details are important to ensure usability by novice workers. First, a simple distance check for connectedness is used to disallow labeling of disconnected surfaces with the same label. Earlier experiments without this constraint resulted in two undesirable behaviors: cheating by painting many surfaces with a few labels, and labeling of multiple object instances with the same label. Second, 3D camera control is challenging for novice users, and the 3D nature of the data is hard to illustrate from one view. Therefore, we first show a full turntable rotation of each reconstruction and then instruct workers to change the view using a rotating turntable metaphor. Without the turntable rotation animation, many workers only annotated from the initial view and never used camera controls despite the provided instructions.\n\nCAD Model Retrieval and Alignment. In the second annotation task, a crowd worker was given a reconstruction already annotated with object instances and asked to place appropriate 3D CAD models to represent major objects in the scene. The challenge of this task lies in the selection of closely matching 3D models from a large database, and in precisely aligning each model to the 3D position of the corresponding object in the reconstruction.\n\nWe implemented an assisted object retrieval interface where clicking on a previously labeled (and thus painted) object in a reconstruction immediately searched for CAD models with the same category label in the ShapeNet-Core [6] dataset, and placed one example model such that it overlaps with the oriented bounding box of the clicked object (see Fig. 5). The worker then used keyboard and mouse-based controls to adjust the alignment of the model, and was allowed to submit the task once at least three CAD  [30]). ScanNet has an order of magnitude more scans, with 3D surface mesh reconstructions covering more than ten times the floor and surface area, and with more than 36,000 annotated object instances. models were placed.\n\nUsing this interface, we collected sets of CAD models aligned to each ScanNet reconstruction. Preliminary results indicate that despite the challenging nature of this task, workers select semantically appropriate CAD models to match objects in the reconstructions. The main limitation of this interface is due to the mismatch between the corpus of available CAD models and the objects observed in the ScanNet scans. Despite the diversity of the ShapeNet CAD model dataset (55K objects), it is still hard to find exact instance-level matches for chairs, desks and more rare object categories. A promising way to alleviate this limitation is to algorithmically suggest candidate retrieved and aligned CAD models such that workers can perform an easier verification and adjustment task.\n\n\nScanNet Dataset\n\nIn this section, we summarize the data we collected using our framework to establish the ScanNet dataset. This dataset is a snapshot of available data which was achieved in roughly one month of data acquisition by twenty users at locations in several countries. It has annotations by more than 500 crowd workers on the Mechanical Turk platform. Since the presented framework runs in an unsupervised fashion and people are continuously collecting data, this dataset continues to grow organically. Here, we report some statistics for an initial snapshot of 1513 scans, which are summarized in Table 2. Fig. 6 plots the distribution of scanned scenes over different types of real-world spaces. ScanNet contains a variety of spaces such as offices, apartments, and bathrooms. The dataset contains a diverse set of spaces ranging from small (e.g., bathrooms, closets, utility rooms) to large (e.g., apartments, classrooms, and libraries). Each of the scans has been annotated with instance-level semantic category labels through our crowdsourcing task. In total, we deployed 3,391 annotation tasks to annotate all 1513 scans.\n\nAll the text labels used by crowd workers to annotate object instances are mapped to the object category sets of NYU v2 [55], ModelNet [88], ShapeNet [6], and corre-  sponding WordNet [18] synsets. This mapping is made more robust by a preprocess that collapses the initial text labels through synonym and misspelling detection. Each labeled object instance has a corresponding oriented bounding box computed as part of the annotation process. We use these bounding boxes to detect outlier annotations for manual verification.\n\nIn addition to reconstructing and annotating the 1513 ScanNet scans, we have processed all the NYU v2 RGB-D sequences with our framework. The result is a set of dense reconstructions of the NYU v2 spaces with instance-level object annotations in 3D that are complementary in nature to the existing image-based annotations.\n\nWe also deployed the CAD model alignment crowdsourcing task to collect a total of 107 virtual scene interpretations consisting of aligned ShapeNet models placed on a subset of 52 ScanNet scans by 106 workers. See Fig. 7 for several examples visualized by overlaying the CAD models on the 3D surface mesh reconstruction. There were a total of 681 CAD model instances (of 296 unique models) retrieved and placed on the reconstructions, with an average of 6.4 CAD model instances per annotated scan.  Table 3. Train/Test split for object classification and dense voxel prediction tasks. Note that the number of instances does not include the rotation augmentation.\n\nFor more detailed statistics on this first ScanNet dataset snapshot, please see the appendix.\n\n\nTasks and Benchmarks\n\nIn this section, we describe the three tasks that we developed as benchmarks for demonstrating the value of ScanNet data.\n\nTrain/Test split statistics. Table 3 shows the test and training splits of ScanNet in the context of the object classification and dense voxel prediction benchmarks. Note that our data is significantly larger than any existing comparable dataset. We use these tasks to demonstrate that Scan-Net enables the use of deep learning methods for 3D scene understanding tasks with supervised training, and compare performance to that using data from other existing datasets.\n\n\n3D Object Classification\n\nWith the availability of large-scale synthetic 3D datasets such as [88,6] and recent advances in 3D deep learning, research has developed approaches to classify objects using only geometric data with volumetric deep nets [88,79,50,13,63]. All of these methods train on purely synthetic data and focus on isolated objects. Although they show limited evaluation on real-world data, a larger evaluation on realistic scanning data is largely missing. When training data is synthetic and test is performed on real data, there is also a significant discrepancy of test performance, as data characteristics, such as noise and occlusions patterns, are inherently different.\n\nWith ScanNet, we close this gap as we have captured a sufficiently large amount of 3D data to use real-world RGB-D input for both training and test sets. For this task, we use the bounding boxes around annotated objects in Scan-Net, and isolate the contained geometry. As a result, we obtain local volumes around each object instance for which we know the annotated category. The goal of the task is to classify the object represented by a set of scanned points within a given bounding box. For this benchmark, we use 17 categories, for which we use 9, 677 instances in the training set, and 2, 606 instances in the test set.\n\nNetwork and training. For object classification, we follow the network architecture of the 3D Network-in-Network of [63], without the multi-orientation pooling step. In order to classify partial data, we add a second channel to the 30 3 occupancy grid input, indicating known and unknown regions (with 1 and 0, respectively) according to the camera scanning trajectory. As in Qi et al. [63], we use an SGD solver with learning rate 0.01 and momentum 0.9, decaying the learning rate by half every 20 epochs, and training the model for 200 epochs. We augment training samples with 12 instances of different rotations (including both elevation and tilt), resulting in a total training set of 111, 660 samples.\n\nBenchmark performance. As a baseline evaluation, we run the 3D CNN approach of Qi et al. [63]. Table 4 shows the performance of 3D shape classification with different train and test sets. The first two columns show results on synthetic test data from ShapeNet [6] including both complete and partial data. Naturally, training with the corresponding synthetic counterparts of ShapeNet provides the best performance, as data characteristics are shared. However, the more interesting case is testing on real-world data (last two columns on the right); here, we show results on the test sets of SceneNN [30] and ScanNet. First, we see that training on synthetic data allows only for limited knowledge transfer (first two rows). Second, although the relatively small SceneNN dataset is able to learn within its own dataset to a reasonable degree, it does not generalize to the larger variety of environments found in ScanNet. On the other hand, training on ScanNet translates well to testing on SceneNN; as a result, the test results on SceneNN are significantly improved by using the training data from ScanNet. Interestingly enough, these results can be slightly improved when mixing training data of ScanNet with partial scans of ShapeNet (last row).  Table 4. 3D object classification benchmark performance. Percentages give the classification accuracy over all models in each test set (average instance accuracy).\n\n\nSemantic Voxel Labeling\n\nA common task on RGB data is semantic segmentation (i.e. labeling pixels with semantic classes) [47]. With our data, we can extend this task to 3D, where the goal is to predict the semantic object label on a per-voxel basis. This task of predicting a semantic class for each visible 3D voxel has been addressed by some prior work, but using handcrafted features to predict a small number of classes [39,83], or focusing on outdoor environments [8,5].\n\nData Generation. We first voxelize a scene and obtain a dense voxel grid with a voxel size of 2cm 3 , where every object stores the underlying object class annotation (empty space and unlabeled surface points have their own respective class). We now extract subvolumes of the scene volume, where each of these volumes has a dimension of 21 × 21 × 42 and a spatial extent of 1m × 1m × 2m; i.e., as voxel size of approx. 4.8cm 3 . These sample volumes are always aligned with the xy-ground plane, and they only differ in their xy-coordinates (the subvolumes are centered around xy samples). For ground truth data generation, voxel labels are propagated from the scene voxelization to these sample volumes. The samples are chosen that at least 2% of the voxels are occupied (i.e., on the surface), and among the voxels on the surface at least 80% are required to have valid annotations; samples not meeting these criteria are discarded. Across ScanNet, we generate 80, 554 subvolume examples for training which are augmented by 8 rotations each (i.e., we have 644, 432 training samples) from 1205 training scenes. In addition, we extract 21, 300 sample volumes for the test data set which are also augmented by 8 rotations each (i.e., a total of 170, 400 test samples) from 312 test scenes (test and training scenes are different). We have 20 object class labels plus 1 class for free space.\n\nNetwork and training. For the semantic voxel labeling task, we propose a network which predicts class labels for a column of voxels in a scene according to the occupancy characteristics of the voxels' neighborhood. In order to infer labels for an entire scene, we use the network to predict a label for every voxel column at test time (i.e., every xy position that has voxels on the surface). The network takes as input a 21×21×42 volume and uses a series of fully convolutional layers to simultaneously predict class scores for the center column of 42 voxels (see Fig. 8). We use ReLU and batch normalization for all layers (except the last) in the network. We augment training samples with 8 instances of different rotations. Since we randomly sample real-world scenes for the training and test data, the training data is unbalanced (particularly with regard to floors and walls), so we weight the cross entropy measure with the inverse log of the histogram of the train data.\n\nWe use an SGD solver with learning rate 0.005 and momentum 0.9, decaying the learning rate by half every 20 epochs, and training the model for 100 epochs.\n\nQuantitative Results. The goal of this task is to predict semantic labels for all visible surface voxels in a given 3D scene; i.e., every voxel on a visible surface receives one of the 20 object class labels. We use NYU2 labels, and list voxel classification results on ScanNet in Table 5. Sample scans with voxel label predictions are visualized in Fig. 9. We achieve an voxel classification accuracy of 78.9%, which is based purely on the geometric input (no color is used).\n\nNote that we do not explicitly enforce consistency predictions between neighboring voxel columns when the test volume is slid across the xy plane. This could be enforced with a volumetric CRF [61] which is used in [83]; however, our goal in this task to focus exclusively on the per-voxel classification accuracy.\n\n\n3D Object Retrieval\n\nAnother important task is retrieval of similar CAD models given (potentially partial) RGB-D scans. To this end, one wants to learn a shape embedding where a feature descriptor defines geometric similarity between shapes. The core idea is to train a network on a shape classification task where a shape embedding can be learned as byproduct of the classification task. For instance, Wu et al. [88] and Qi et al. [63] use this technique to perform shape retrieval queries within the ShapeNet database.\n\nWith ScanNet, we have established category-level correspondences between real-world objects and ShapeNet models. This allows us to train on a classification problem where both real and synthetic data are mixed inside of each category using real and synthetic data within shared class labels. Thus, we can learn an embedding between real and synthetic data in order to perform model retrieval for RGB-D scans. To this end, we use the volumetric shape classification network by Qi et al. [63], we use the same training  procedure as in Sec. 5.1. Nearest neighbors are retrieved based on the 2 distance between the extracted feature descriptors, and measured against the ground truth provided by the CAD model retrieval task. In Table 6, we show object retrieval results using objects from ScanNet to query for nearest neighbor models from ShapeNetCore. Note that training on ShapeNet and ScanNet independently results in poor retrieval performance, as neither are able to bridge the gap between the differing characteristics of synthetic and real-world data. Training on both ShapeNet and ScanNet together is able to find an embedding of shape similarities between both data modalities, resulting in much higher retrieval accuracy.\n\n\nConclusion\n\nThis paper introduces ScanNet: a large-scale RGB-D dataset of 1513 scans with surface reconstructions, instance-level object category annotations, and 3D CAD model placements. To make the collection of this data possible, we designed a scalable RGB-D acquisition and semantic annotation framework that we provide for the benefit of the community. We demonstrated that the richly-annotated scan data collected so far in ScanNet is useful in achieving state-of-the-art performance on several 3D scene understanding tasks; we hope that ScanNet will inspire future work on many other tasks.\n\n\nA. Dataset Statistics and Comparisons\n\nIn this section, we provide thorough statistics on the construction and composition of ScanNet dataset, and also compare it to the most similar datasets from prior work. Fig. 10 shows six example annotated reconstructions for a variety of spaces. For each reconstruction, the surface mesh with colors is shown, as well as a visualization with category labels for each object collected using our crowdsourced annotation interface. Category labels are consistent between spaces and are mapped to WordNet [18] synsets. In addition to the category label, separate object instance labels are also available to indicate multiple instances of a given category, such as distinct chairs around a conference table in the fourth row of Fig. 10. Fig. 11 shows a larger set of reconstructed spaces in ScanNet to illustrate the variety of spaces that are part of the dataset. The scans range from small spaces with just a few objects (e.g., toilets), to large areas with dozens of objects (e.g., classrooms and studio apartments).   wall  6226  chair  4279  floor  3212  table  2223  door  1181  couch  1048  cabinet  937  desk  733  shelf  732  bed  699  office chair  669  trashcan  561  pillow  490  sink  470  window  398  toilet  397  picture  351  bookshelf  328  monitor  308  curtain  280  computer  274  armchair  264  bathtub  253  coffee table  239  box  231  dining chair  230  refrigerator  226  book  221  lamp  218  towel  216  kitchen cabinet  203  drawer  202  tv  187  nightstand  182  counter  179  dresser  177  clothes  164  countertop  163  stool  130  plant  130  cushion  116  ceiling  114  bedframe  111  keyboard  107  end table  105  toilet paper  104  bag  104  backpack  100  blanket  94  dining table  94 SceneNN [30] Category Count   chair  194  table  53  floor  44  seat  41  desk  39  monitor  31  sofa  25  cabinet  25  door  24  box  23  keyboard  23  trash bin  21  wall  20  pillow  19  fridge  18  stand  18  bag  17  bed  16  window  14  sink  13  printer  12  computer  12  chair01  12  desk1  11  monitor01  10  shelves  10  shelf  10  chair1  10  chair02  10  fan  9  basket  9  desk2  9  laptop  9  trashbin  9  kettle  9  microwave  9  monitor1  8  stove  8  chair2  8  bike  7  blanket  7  drawer  7  lamp  7  wall02  7  wall01  7  wall04  7  backpack  7  cup  7  chair3  7  whiteboard  7   Table 7. Total counts of annotated object instances of the 50 largest categories in ScanNet (left), and in SceneNN [30] (right), the most similar annotated RGB-D reconstruction dataset. ScanNet contains far more annotated object instances, and the annotated labels are processed for consistency to remove duplicates such as \"chair01\" in SceneNN.\n\n\nA.1. Example Annotated Reconstructions\n\n\nA.2. Dataset Construction Statistics\n\nThe construction of ScanNet was carried out with the RGB-D acquisition and annotation framework described in the main paper. In order to provide an intuition of the scalability of our framework, we report timing statistics for both the reconstruction and annotation steps. The median reconstruction processing time (including data conversion, dense voxel fusion, surface mesh extraction, alignment, cleanup, and preview thumbnail image rendering) is 11.3 min for each scene. A few outliers exist with significantly higher processing times (on the order of hours), due to unplanned processing server downtime during our data collection (mainly software updates), resulting in a higher mean reconstruction time of 14.9 min.\n\nAfter reconstruction is complete, each scan is annotated by several crowd workers on Amazon Mechanical Turk (2.3 workers on average per scan). The median annotation time per crowd worker is 12.0 min (mean time is 17.3 min, again due to a few outlier workers who take significantly longer). Aggregating the time taken across workers for annotating each of the 1513 scans in ScanNet, the median time per scan is 16.8 min, and the mean time per scan is 22.3 min.\n\n\nA.3. Dataset Composition Statistics\n\nThe construction of the ScanNet dataset is motivated by the lack of large, annotated, densely reconstructed RGB-D dataset of 3D scenes that are publicly available in the academic community. Existing RGB-D datasets either have full scene-level annotations only for a subset of RGB-D frames (e.g., NYU v2 depth [55]), or they focus on annotating decontextualized objects and not scenes (e.g., Choi et al. [10]). The two datasets that do annotate densely reconstructed RGB-D spaces at the scene level are the SceneNN dataset by Hua et al. [30] and the smaller PiGraphs dataset by Savva et al. [68].\n\nSceneNN consists of 94 RGB-D scans captured using Asus Xtion Pro devices and reconstructed with the method of Choi et al. [9]. The resulting densely-fused surface meshes are fully segmented at the level of meaningful objects. However, only a small set of segments are annotated with semantic labels. On the other hand, the PiGraphs [68] dataset consists of 26 RGB-D scans captured with Kinect v1 devices and reconstructed with the VoxelHashing approach of Nießner et al. [59]. This dataset has more complete and clean semantic labels, including object parts and object instances. However, it contains very few scenes and is limited in the variety of environments, consisting mostly of offices and conference rooms. To illustrate the large gap in quantity of annotated semantic labels between these two datasets and ScanNet, Fig. 12 plots histograms of the total number of labeled object instances and the total numbers of unique semantic labels for each scan.\n\nIn order to demonstrate how our category labels map to other data, we plot the distribution of annotated object labels corresponded to the ShapeNetCore 3D CAD model categories in Fig. 13. This mapping is leveraged during   [68], SceneNN [30] and our dataset (ScanNet). The histograms show that ScanNet has many annotated objects over a larger number of scans, ranging in complexity with regards to the total number of objets per scan. Figure 13. Top 25 most frequent annotation labels in ScanNet scans mapped to ShapeNetCore classes. ScanNet has thousands of 3D reconstructed instances of common objects such as chairs, tables, and cabinets.\n\nour CAD model alignment and retrieval task to automatically suggest instances of CAD models from ShapeNet that match the label of a given object category in the reconstruction.\n\nWe can also obtain 2D annotations on the input RGB-D sequences by projecting our 3D annotations into each frame using the corresponding camera pose. This way, we obtain an average of 76% annotation coverage of all pixels per scene by using the previously obtained 3D annotations.\n\n\nA.4. NYUv2 Reconstruction and Comparison\n\nHere, we discuss how ScanNet relates to NYUv2, one of the most popular RGB-D dataset with annotations. In order to compare the data in ScanNet with the data in NYUv2, we reconstructed and annotated all the RGB-D sequences in NYUv2 using our framework. (Note that for 9 sequences of the NYUv2 dataset, our framework did not obtain valid camera poses for > 50% of the frames, so we did not compute reconstructions and annotations for these sequences.) Moreover, we created a set of surface mesh semantic annotations for the NYUv2 reconstructions by projecting every pixel of the annotated RGB-D frames with valid depth and label into world space using our computed camera poses, and assigning the corresponding object label to the closest surface mesh vertices (within 0.04cm, using a kd-tree lookup).\n\nWe then compare the total surface area of the reconstructed meshes that was annotated using projection from the annotated NYUv2 frames, and using our annotation pipeline. Fig. 14 plots the percentage of reconstructed surfaces in NYUv2 that were annotated with each approach, as well as the percentage distribution for the ScanNet reconstructions for comparison. Note that we exclude the 9 sequences for which we do not have enough valid camera poses.\n\nA noticeable difference between the RGB-D sequences in NYUv2 and those in ScanNet is that overall, the ScanNet sequences are more complete surface reconstructions of the real-world spaces. Most importantly, the NYUv2 original frames in general do not cover a sufficient number of viewpoints of the space to ensure full reconstruction of semantically meaningful complete objects. Fig. 15 shows a comparison of several reconstructed scenes from NYUv2 RGB-D sequences vs comparable reconstructions from ScanNet. As shown in the top-down views, the NYU reconstructions are much more sparse than the ScanNet reconstructions. This disparity makes a more direct comparison with ScanNet reconstructions hard to quantify. However, we can conclude that projecting the annotated NYUv2 RGB-D frames to reconstructions is not sufficient to semantically annotate the spaces, as is clear from the far lower surface coverage distribution for NYUv2 in Fig. 14.\n\n\nB. Dataset Acquisition Framework\n\nThis section provides more details for specific steps in our RGB-D data acquisition framework which was described in the main paper. To enable scalable dataset acquisition, we designed our data acquisition framework for 1) ease of use during capture, 2) robust reconstruction, 3) rapid crowdsourcing, 4) visibility into the collected data and its metadata. For 1) we developed an iPad app (see Appendix B.1) with an easy-to-use interface, reasonable scanning presets, and minimalistic user controls. To ensure good reconstruction with minimal user interaction during scanning, we tested different exposure time settings and enabled auto white balancing (see Appendix B.1). We also estab- lished a simple calibration process that novice users could carry out (see Appendix B.2), and offloaded RGB-D reconstruction to the cloud (see Appendix B.3). Finally, we developed web-based UIs for crowdsourcing semantic annotation tasks as described in Appendix B.4, and for managing the collected data as described in Appendix B.6. Fig. 16 shows our RGB-D recording app on the iPad. We designed an iPad app with a simple camera-based UI and a minimalistic set of controls. Before scanning, the user enters a user name, a scene name, and selects the type of room being scanned. The user then presses a single button to start and stop a scan recording. The interface can be toggled between visualizing the color stream and the depth stream overlaid on the color.\n\n\nB.1. RGB-D Acquisition UI\n\nWe found that the most challenging part of scanning for novice users was acquiring an intuition as to what regions during scanning are likely to result in poor tracking and failed reconstruction. To alleviate this, we added a \"progress bar\"-style visualization during active scanning which indicates the featurefulness of the region being scanned. The bar ranges from full green, indicating high feature count, to near-empty black, indicating low feature count and high likelihood of tracking loss. This UI element was helpful for quickly familiarizing users with the scanning process. After scanning, the user can view a list of scans on the device and select to upload the scan data to a processing server. During upload, a progress bar is shown and scanning is disabled. Upon completion of the upload, the checksums of scan data on the server are verified against local data and the scans are automatically deleted to provide more memory for scanning. Auto white balancing and Exposure Settings Another challenge towards performing reconstruction in uncontrolled scenarios is the wide variety of illumination conditions. Since our scanning app was designed for novice users, we opted to provide a reasonable set of presets and allow for manual override only when deemed necessary. By default, we enabled continuous automatic whitepoint balancing as implemented by the iOS SDK. We also enabled dynamic exposure selection again as implemented by the iOS SDK, but instructed users that they could manually adjust exposure if necessary to make overly dark locations brighter, or overly bright locations darker. The exposure setting can have a significant impact on the amount of motion blur during scanning. However, we found that inexperienced users preferred to rely on dynamic exposure, and typically moved relatively slowly during scanning, making motion blur less of an issue. The average exposure time during scans with dynamic exposure was close to 30 ms.\n\n\nB.2. Sensor Calibration\n\nSensor calibration is a critical, yet often overlooked part of RGB-D data acquisition. Our experiments showed that depth-to-color calibration is an important step in acquiring good 3D reconstructions from RGB-D sequences.\n\nDepth To Color Calibration To align a depth image D to color image C, we need to estimate intrinsic parameters of both sensors, the infrared camera K D and color camera K C , as well as extrinsic transformation T D→C . In our experiments we have found that using the set of intrinsic parameters of focal length, center of projection, and two barrel distortion coefficients models worked well for the used cameras. To obtain calibration parameters K D and K C we capture a series of color-infrared pairs showing an asymmetric checkerboard grid. We then estimate calibration parameters for each camera with Matlab's CameraCalibrator application. During this procedure we additionally obtain the world positions of calibration grid corners, and use them to estimate the transformation T D→C .\n\nDepth Distortion Calibration Previous work suggests that for consumer-level depth cameras there exists depthdependent distortion that increases as camera moves away from the surface. Thus, we decided to augment our set of intrinsic parameters for depth cameras with a undistortion lookup table, as first suggested in Teichman et al. [81]. This look up table is a function f (x, y, d), of spatial coordinates x, y and observed depth d, returning a multiplication factor m used to obtain undistorted depth d = md. The table is computed from training pairs of observed and ground truth depths d and d t . However, unlike Teichman's unsupervised approach, which produces training pairs using carefully taken 'calibration sequences', we decided to design a supervised approach similar to that of Di Cicco [14]. However, we found that at large distances the depth distortion becomes so severe that approaches based on fitting planes to depth data are bound to fail. Thus to obtain training pairs {d, d t }, we capture a color-depth video sequence of a large flat wall with a calibration target at the center, as the user moves away and towards the wall. To ensure successfull calibration process user needs to ensure that the viewed wall is the only observed surface and that it covers the entire field of view. With the captured color-depth sequence and previously estimated K D , K C , T D→C we can recover the the world positions of the calibration grid corners, effectively obtaining the ground truth plane locations for each of the captured depth images. For each pixel x, y with depth d, we then shoot a ray through x, y to intersect with the related plane. d t can be recovered from the point of intersection. The rest of our undistortion pipeline follows closely the that of Teichman et al. [81]. We found that undistorting depth images obtained by a Structure sensor leads to significantly improved tracking.\n\n\nB.3. Surface Reconstruction\n\nGiven a calibrated RGB-D sequence as input, a fused 3D surface reconstruction is obtained using the BundleFusion framework [12], as described in the main paper. The reconstruction is then cleaned by merging vertices within 1 mm of each other, and removing connected components with fewer than 7500 triangles. Following this cleanup step, two quadric edge collapse decimation steps are performed to produce lower triangle count versions of each surface mesh. Each decimation halves the number of triangles in the surface mesh, reducing the size of the original meshes from an average of 146 MB to 5.82 MB for the low resolution mesh. The mesh decimation step is important for reducing data transfer requirements and improving loading times during the crowdsourced annotation using our webbased UI.\n\n\nB.4. Crowdsourced Annotation UI\n\nWe deployed our semantic annotation task to crowd workers on the Amazon Mechanical Turk platform. Each annotation task began with an introduction (see Fig. 17) providing a basic overview of the task. The worker was then shown a reconstruction and asked to paint all object instances with a color and corresponding label. The worker was required to annotate at least 25% of the surface area of the reconstruction, and encouraged to cover at least 50%. Once the worker was done, they could submit by pressing a button. Workers were compensated with $0.50 for each annotation task performed.\n\nThe CAD model retrieval and alignment task began with a view of an already semantically annotated reconstruction and asked workers to click on objects to retrieve and place appropriate CAD models. Fig. 18 shows the initial instructions for an example reconstruction with several chairs. Workers for this task were required to place at least three objects before submitting. Once the worker was done, they were compensated with $1.00 for each completed task. Figure 17. Instructions provided to crowd workers for our semantic annotation task. Top: instructions before the beginning of the task. Bottom: interface instructions during annotation. Figure 18. Instructions provided to crowd workers for our CAD model alignment task. The worker clicks on colored objects to retrieve and place CAD models.\n\n\nB.5. Label cleaning and propagation\n\nLabeling is performed on the surface mesh reconstruction, with several workers labeling each scan. To ensure that labels are consistent across workers, we use standard NLP techniques to clean up the labels. First, we use a manually curated list of good labels and their synonyms to compute a map to a single canonical label for each set, also including common misspellings by a small edit distance threshold of the given label. Labels with less than 5 counts are deemed unreliable and ignored in all statistics. Labels with more than 20 counts are manually examined and added to the list of good labels or collapsed as a synonym of a good label. The list of these frequent collapsed labels is also mapped to WordNet [18] synsets when possible, and to other common label sets that are commonly used for RGB-D and 3D CAD data (NYUv2 [55], ModelNet [88], and ShapeNetCore [6]).\n\nUsing the cleaned labels, we then compute an aggregated consensus labeling of each scene, since any individual crowdsourced annotation of a scene may not cover the entire scene, or may contain some errors. For each segment in the over-segmentation of a scene mesh, we first take the majority vote label. This groups together instances of the same class of objects, so we also compute a labeling purely based on geometric overlap; that is, we greedily take the unions of annotations which have ≥ 50% overlap of segments. We then take the maximal intersections between these two labelings to obtain the final consensus.\n\nAfter we have obtained the aggregated consensus semantic annotation for a scene, we then propagate these labels to Figure 19. Our web-based data management UI for ScanNet scan data.\n\nthe high-resolution mesh as well as to the 2D frames of the input RGB-D sequence. To propagate the labels to the high resolution mesh, we compute a kd-tree over the mesh vertices of the labeled coarse mesh, and we label each vertex of the high resolution mesh according to a nearest neighbor lookup in the kd-tree. We project the 3D semantic annotations to the input 2D frames by rendering the labeled mesh from the camera poses of each frame, and follow this with a joint dilation filter with the original RGB image and joint erosion filter with the original RGB image.\n\n\nB.6. Management UI\n\nTo enable scalability of our RGB-D acquisition and annotation, and continual transparency into the progress of scans throughout our framework, we created a web-based management UI to track and organize all data (see Fig. 19). When a user is finished scanning and presses the upload button on an iPad device, their scan data is automatically uploaded to our processing server, placed into a reconstruction queue, and immediately made visible in the management UI. As the reconstruction proceeds through the various stages of data conversion, calibration, pose optimization and RGB-D fusion, alignment, cleanup, decimation, and segmentation, progress is visualized in the management UI. Thumbnail renderings of the generated surface reconstruction, and statistics such as total number of frames, reconstructed floor area etc. are automatically computed and can be used for filtering and sorting of the reconstructions. Similarly, during crowdsourced annotation, worker progress and aggregated annotated surface area statistics are visible and usable for sorting and filtering of the scan database.\n\nFigure 1 .\n1Example reconstructed spaces in ScanNet annotated with instance-level object category labels through our crowdsourced annotation framework.\n\nFigure 3 .\n3Comparison of calibration results. In the top row, we show results of calibration on a flat wall. As the distance increases the distortion becomes quite severe, motivating the need for depth distortion calibration. In the bottom row, we show results of frameto-frame tracking on raw and calibrated data.\n\nFigure 4 .\n4Our web-based crowdsourcing interface for annotating a scene with instance-level object category labels. The right panel lists object instances already annotated in the scene with matching painted colors. This annotation is in progress at around ≈ 35% with gray regions indicating unannotated surfaces.\n\nFigure 6 .\n6Distribution of the scans in ScanNet organized by type.\n\nFigure 7 .\n7ShapeNetCore[6] CAD models retrieved and placed on ScanNet scans by crowd workers (scan mesh is transparent and CAD models are opaque). From top left clockwise: a classroom, bedroom, bathroom, and lounge scan.\n\nFigure 8 .\n8Network architecture for our semantic voxel label predictions.\n\nFigure 9 .\n9Semantic voxel labeling of 3D scans in ScanNet using our 3D CNN architecture. Voxel colors indicate predicted or ground truth category.\n\nFigure 10 .\n10Example annotated scans in ScanNet. Left: reconstructed surface mesh with original colors. Middle: color indicates category label consistently across all scans. Right: each object instance shown with a different randomly assigned color.\n\nFigure 11 .\n11A variety of example annotated scans in ScanNet. Colors indicate category consistently across all scans.\n\nFigure 12 .\n12Histograms of the total number of objects labeled per scan (top) and total number of unique labels per scan (bottom) in the PiGraphs\n\nFigure 15 .\n15Comparison of reconstructed Bathroom (top), Bedroom (middle), and Kitchen (bottom) from NYUv2 RGB-D frames (left), and a comparable reconstruction from ScanNet (right). For each NYU scene, we show an example color frame, the rough corresponding region of the view in the reconstructed scene (light blue box), and a top down view of the reconstruction. While NYUv2 reconstruction look complete from some viewpoints, much of the scene is left uncovered (see top down views). In constrast, ScanNet reconstruction have a much more complete coverage of the space and allow for denser annotation.\n\nFigure 14 .\n14Histograms of the percentage of total reconstruction surface area per scan that is semantically labeled for: NYU v2 reconstructions using projection of RGB-D annotated frames (left), for NYU v2 reconstructions using our 3D annotation interface (middle), and for ScanNet reconstructions similarly annotated with our interface (right).\n\nFigure 16 .\n16Our RGB-D recording app on an iPad Air2 with attached Structure sensor (showing color stream at the top and depth stream at the bottom). The app allows novice users to record RGB-D videos and upload to a server for reconstruction and annotation.\n\n\n. Summary statistics for ScanNet compared to the most similar existing dataset (SceneNNStatistic \n\nSceneNN [30] \nScanNet \n\n# of scans \n100 \n1513 \n# of RGB-D frames \n2,475,905 \n2,492,518 \nfloor area (avg / sum m 2 ) \n22.6 / 2,124 22.6 / 34,453 \nsurface area (avg / sum m 2 ) \n75.3 / 7,078 51.6 / 78,595 \nlabeled objects (avg / sum) \n15.8 / 1482 24.1 / 36,213 \nTable 2\nA comprehensive and detailed overview of publicly-accessible RGB-D datasets is given by[20] at http://www0.cs.ucl.ac.uk/ staff/M.Firman/RGBDdatasets/, which is updated on a regular basis.\nAcknowledgmentsThis project is funded by Google Tango, Intel, NSF (IIS-1251217 and VEC 1539014/1539099), and a Stanford Graduate fellowship. We also thank Occipital for donating structure sensors and Nvidia for hardware donations, as well as support by the Max-Planck Center for Visual Computing and the Stanford CURIS program. Further, we thank Toan Vuong, Joseph Chang, and Helen Jiang for help on the mobile scanning app and the scanning process, and Hope Casey-Allen and Duc Nugyen for early prototypes of the annotation interfaces. Last but not least, we would like to thank all people for help with scanning and getting us access to scanning spaces.\nA global hypotheses verification method for 3D object recognition. A Aldoma, F Tombari, L Di Stefano, M Vincze, European Conference on Computer Vision. SpringerA. Aldoma, F. Tombari, L. Di Stefano, and M. Vincze. A global hypotheses verification method for 3D object recog- nition. In European Conference on Computer Vision, pages 511-524. Springer, 2012. 2\n\nJoint 2d-3d-semantic data for indoor scene understanding. I Armeni, S Sax, A R Zamir, S Savarese, arXiv:1702.0110523arXiv preprintI. Armeni, S. Sax, A. R. Zamir, and S. Savarese. Joint 2d-3d- semantic data for indoor scene understanding. arXiv preprint arXiv:1702.01105, 2017. 2, 3\n\n3D semantic parsing of largescale indoor spaces. I Armeni, O Sener, A R Zamir, H Jiang, I Brilakis, M Fischer, S Savarese, CVPR. 13I. Armeni, O. Sener, A. R. Zamir, H. Jiang, I. Brilakis, M. Fischer, and S. Savarese. 3D semantic parsing of large- scale indoor spaces. CVPR, 2016. 1, 2, 3\n\nRe-identification with RGB-D sensors. I B Barbosa, M Cristani, A Bue, L Bazzani, V Murino, European Conference on Computer Vision. I. B. Barbosa, M. Cristani, A. Del Bue, L. Bazzani, and V. Murino. Re-identification with RGB-D sensors. In Eu- ropean Conference on Computer Vision, pages 433-442.\n\n. Springer, Springer, 2012. 2\n\nLarge-scale semantic 3d reconstruction: an adaptive multi-resolution model for multi-class volumetric labeling. M Blaha, C Vogel, A Richard, J D Wegner, T Pock, K Schindler, Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. the IEEE Conference on Computer Vision and Pattern RecognitionM. Blaha, C. Vogel, A. Richard, J. D. Wegner, T. Pock, and K. Schindler. Large-scale semantic 3d reconstruction: an adaptive multi-resolution model for multi-class volumetric labeling. In Proceedings of the IEEE Conference on Com- puter Vision and Pattern Recognition, pages 3176-3184, 2016. 8\n\nA X Chang, T Funkhouser, L Guibas, P Hanrahan, Q Huang, Z Li, S Savarese, M Savva, S Song, H Su, arXiv:1512.03012An information-rich 3D model repository. arXiv preprintA. X. Chang, T. Funkhouser, L. Guibas, P. Hanrahan, Q. Huang, Z. Li, S. Savarese, M. Savva, S. Song, H. Su, et al. ShapeNet: An information-rich 3D model repository. arXiv preprint arXiv:1512.03012, 2015. 1, 5, 6, 7, 21\n\nScalable real-time volumetric surface reconstruction. J Chen, D Bautembach, S Izadi, ACM Transactions on Graphics (TOG). 324113J. Chen, D. Bautembach, and S. Izadi. Scalable real-time volumetric surface reconstruction. ACM Transactions on Graphics (TOG), 32(4):113, 2013. 4\n\nMulti-label semantic 3d reconstruction using voxel blocks. I Cherabier, C Häne, M R Oswald, M Pollefeys, 3D Vision (3DV), 2016 Fourth International Conference on. IEEEI. Cherabier, C. Häne, M. R. Oswald, and M. Pollefeys. Multi-label semantic 3d reconstruction using voxel blocks. In 3D Vision (3DV), 2016 Fourth International Conference on, pages 601-610. IEEE, 2016. 8\n\nRobust reconstruction of indoor scenes. S Choi, Q.-Y Zhou, V Koltun, 2015 IEEE Conference on Computer Vision and Pattern Recognition (CVPR). 16S. Choi, Q.-Y. Zhou, and V. Koltun. Robust reconstruction of indoor scenes. In 2015 IEEE Conference on Computer Vision and Pattern Recognition (CVPR), pages 5556-5565. IEEE, 2015. 2, 4, 16\n\nS Choi, Q.-Y Zhou, S Miller, V Koltun, arXiv:1602.02481A large dataset of object scans. 216S. Choi, Q.-Y. Zhou, S. Miller, and V. Koltun. A large dataset of object scans. arXiv:1602.02481, 2016. 2, 16\n\nA volumetric method for building complex models from range images. B Curless, M Levoy, Proceedings of the 23rd annual conference on Computer graphics and interactive techniques. the 23rd annual conference on Computer graphics and interactive techniquesACMB. Curless and M. Levoy. A volumetric method for building complex models from range images. In Proceedings of the 23rd annual conference on Computer graphics and interac- tive techniques, pages 303-312. ACM, 1996. 4\n\nBundleFusion: Real-time globally consistent 3D reconstruction using on-the-fly surface re-integration. A Dai, M Nießner, M Zollöfer, S Izadi, C Theobalt, arXiv:1604.01093arXiv preprintA. Dai, M. Nießner, M. Zollöfer, S. Izadi, and C. Theobalt. BundleFusion: Real-time globally consistent 3D reconstruc- tion using on-the-fly surface re-integration. arXiv preprint arXiv:1604.01093, 2016. 2, 4, 20\n\nShape completion using 3d-encoder-predictor cnns and shape synthesis. A Dai, C R Qi, M Nießner, arXiv:1612.00101arXiv preprintA. Dai, C. R. Qi, and M. Nießner. Shape completion us- ing 3d-encoder-predictor cnns and shape synthesis. arXiv preprint arXiv:1612.00101, 2016. 7\n\nNon-parametric calibration for depth sensors. Robotics and Autonomous Systems. M Di Cicco, L Iocchi, G Grisetti, 7420M. Di Cicco, L. Iocchi, and G. Grisetti. Non-parametric cal- ibration for depth sensors. Robotics and Autonomous Sys- tems, 74:309-317, 2015. 3, 20\n\nAn evaluation of the RGB-D SLAM system. F Endres, J Hess, N Engelhard, J Sturm, D Cremers, W Burgard, Robotics and Automation (ICRA), 2012 IEEE International Conference on. F. Endres, J. Hess, N. Engelhard, J. Sturm, D. Cremers, and W. Burgard. An evaluation of the RGB-D SLAM system. In Robotics and Automation (ICRA), 2012 IEEE International Conference on, pages 1691-1696. IEEE, 2012. 2\n\nSpoofing in 2D face recognition with 3D masks and anti-spoofing with Kinect. N Erdogmus, S Marcel, Biometrics: Theory, Applications and Systems (BTAS), 2013 IEEE Sixth International Conference on. N. Erdogmus and S. Marcel. Spoofing in 2D face recognition with 3D masks and anti-spoofing with Kinect. In Biometrics: Theory, Applications and Systems (BTAS), 2013 IEEE Sixth International Conference on, pages 1-6. IEEE, 2013. 2\n\nThe PASCAL visual object classes (VOC) challenge. M Everingham, L Van Gool, C K Williams, J Winn, A Zisserman, International journal of computer vision. 8821M. Everingham, L. Van Gool, C. K. Williams, J. Winn, and A. Zisserman. The PASCAL visual object classes (VOC) challenge. International journal of computer vision, 88(2):303-338, 2010. 1\n\n. C Fellbaum, Wordnet, Wiley Online Library1321C. Fellbaum. WordNet. Wiley Online Library, 1998. 6, 13, 21\n\nEfficient graphbased image segmentation. P F Felzenszwalb, D P Huttenlocher, International Journal of Computer Vision. 592P. F. Felzenszwalb and D. P. Huttenlocher. Efficient graph- based image segmentation. International Journal of Com- puter Vision, 59(2):167-181, 2004. 5\n\nRGBD datasets: Past, present and future. M Firman, CVPR Workshop on Large Scale 3D Data: Acquisition, Modelling and Analysis. M. Firman. RGBD datasets: Past, present and future. In CVPR Workshop on Large Scale 3D Data: Acquisition, Mod- elling and Analysis, 2016. 2\n\nInstructing people for training gestural interactive systems. S Fothergill, H Mentis, P Kohli, S Nowozin, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. the SIGCHI Conference on Human Factors in Computing SystemsACMS. Fothergill, H. Mentis, P. Kohli, and S. Nowozin. Instruct- ing people for training gestural interactive systems. In Pro- ceedings of the SIGCHI Conference on Human Factors in Computing Systems, pages 1737-1746. ACM, 2012. 2\n\nData-driven 3D primitives for single image understanding. D F Fouhey, A Gupta, M Hebert, Proceedings of the IEEE International Conference on Computer Vision. the IEEE International Conference on Computer VisionD. F. Fouhey, A. Gupta, and M. Hebert. Data-driven 3D primitives for single image understanding. In Proceedings of the IEEE International Conference on Computer Vision, pages 3392-3399, 2013. 2\n\nUnfolding an indoor origami world. D F Fouhey, A Gupta, M Hebert, European Conference on Computer Vision. SpringerD. F. Fouhey, A. Gupta, and M. Hebert. Unfolding an indoor origami world. In European Conference on Computer Vision, pages 687-702. Springer, 2014. 2\n\nCloudCompare3D point cloud and mesh processing software. D Girardeau-Montaut, OpenSource ProjectD. Girardeau-Montaut. CloudCompare3D point cloud and mesh processing software. OpenSource Project, 2011. 2\n\nSupport surface prediction in indoor scenes. R Guo, D Hoiem, Proceedings of the IEEE International Conference on Computer Vision. the IEEE International Conference on Computer VisionR. Guo and D. Hoiem. Support surface prediction in indoor scenes. In Proceedings of the IEEE International Conference on Computer Vision, pages 2144-2151, 2013. 2\n\nPerceptual organization and recognition of indoor scenes from RGB-D images. S Gupta, P Arbelaez, J Malik, Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. the IEEE Conference on Computer Vision and Pattern RecognitionS. Gupta, P. Arbelaez, and J. Malik. Perceptual organiza- tion and recognition of indoor scenes from RGB-D images. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition, pages 564-571, 2013. 2\n\nLearning rich features from RGB-D images for object detection and segmentation. S Gupta, R Girshick, P Arbeláez, J Malik, European Conference on Computer Vision. SpringerS. Gupta, R. Girshick, P. Arbeláez, and J. Malik. Learning rich features from RGB-D images for object detection and segmentation. In European Conference on Computer Vision, pages 345-360. Springer, 2014. 2\n\nA benchmark for RGB-D visual odometry, 3D reconstruction and SLAM. A Handa, T Whelan, J Mcdonald, A J Davison, 2014 IEEE International Conference on Robotics and Automation (ICRA). A. Handa, T. Whelan, J. McDonald, and A. J. Davison. A benchmark for RGB-D visual odometry, 3D reconstruction and SLAM. In 2014 IEEE International Conference on Robotics and Automation (ICRA), pages 1524-1531. IEEE, 2014. 2\n\nRecovering free space of indoor scenes from a single image. V Hedau, D Hoiem, D Forsyth, Computer Vision and Pattern Recognition (CVPR), 2012 IEEE Conference on. V. Hedau, D. Hoiem, and D. Forsyth. Recovering free space of indoor scenes from a single image. In Computer Vision and Pattern Recognition (CVPR), 2012 IEEE Conference on, pages 2807-2814. IEEE, 2012. 2\n\nSceneNN: A scene meshes dataset with annotations. B.-S Hua, Q.-H Pham, D T Nguyen, M.-K Tran, L.-F Yu, S.-K Yeung, International Conference on 3D Vision (3DV). 117B.-S. Hua, Q.-H. Pham, D. T. Nguyen, M.-K. Tran, L.-F. Yu, and S.-K. Yeung. SceneNN: A scene meshes dataset with annotations. In International Conference on 3D Vision (3DV), volume 1, 2016. 1, 2, 3, 6, 7, 16, 17\n\nM Innmann, M Zollhöfer, M Nießner, C Theobalt, M Stamminger, Volumedeform, arXiv:1603.08161Real-time volumetric non-rigid reconstruction. arXiv preprintM. Innmann, M. Zollhöfer, M. Nießner, C. Theobalt, and M. Stamminger. VolumeDeform: Real-time volumetric non-rigid reconstruction. arXiv preprint arXiv:1603.08161, 2016. 2\n\nLatent structured models for human pose estimation. C Ionescu, F Li, C Sminchisescu, 2011 International Conference on Computer Vision. C. Ionescu, F. Li, and C. Sminchisescu. Latent structured models for human pose estimation. In 2011 International Conference on Computer Vision, pages 2220-2227. IEEE, 2011. 2\n\n6M: Large scale datasets and predictive methods for 3D human sensing in natural environments. C Ionescu, D Papava, V Olaru, C Sminchisescu, Human3, IEEE transactions on pattern analysis and machine intelligence. 36C. Ionescu, D. Papava, V. Olaru, and C. Sminchisescu. Human3.6M: Large scale datasets and predictive methods for 3D human sensing in natural environments. IEEE transactions on pattern analysis and machine intelligence, 36(7):1325-1339, 2014. 2\n\nA category-level 3D object dataset: Putting the Kinect to work. A Janoch, S Karayev, Y Jia, J T Barron, M Fritz, K Saenko, T Darrell, Consumer Depth Cameras for Computer Vision. SpringerA. Janoch, S. Karayev, Y. Jia, J. T. Barron, M. Fritz, K. Saenko, and T. Darrell. A category-level 3D object dataset: Putting the Kinect to work. In Consumer Depth Cameras for Computer Vision, pages 141-165. Springer, 2013. 2\n\nVery high frame rate volumetric integration of depth images on mobile devices. O Kahler, V Prisacariu, C Yuheng Ren, X Sun, P Torr, D Murray, IEEE Transactions on Visualization and Computer Graphics. 2111O. Kahler, V. Adrian Prisacariu, C. Yuheng Ren, X. Sun, P. Torr, and D. Murray. Very high frame rate vol- umetric integration of depth images on mobile devices. IEEE Transactions on Visualization and Computer Graph- ics, 21(11):1241-1250, 2015. 4\n\nReal-time large-scale dense 3D reconstruction with loop closure. O Kähler, V A Prisacariu, D W Murray, European Conference on Computer Vision. SpringerO. Kähler, V. A. Prisacariu, and D. W. Murray. Real-time large-scale dense 3D reconstruction with loop closure. In European Conference on Computer Vision, pages 500-516. Springer, 2016. 4\n\nObject discovery in 3D scenes via shape analysis. A Karpathy, S Miller, L Fei-Fei, Robotics and Automation (ICRA), 2013 IEEE International Conference on. IEEEA. Karpathy, S. Miller, and L. Fei-Fei. Object discovery in 3D scenes via shape analysis. In Robotics and Automa- tion (ICRA), 2013 IEEE International Conference on, pages 2088-2095. IEEE, 2013. 5\n\nFall detection using ceilingmounted 3D depth camera. M Kepski, B Kwolek, Computer Vision Theory and Applications (VISAPP), 2014 International Conference on. 2M. Kepski and B. Kwolek. Fall detection using ceiling- mounted 3D depth camera. In Computer Vision Theory and Applications (VISAPP), 2014 International Conference on, volume 2, pages 640-647. IEEE, 2014. 2\n\n3d scene understanding by voxel-crf. B Kim, P Kohli, S Savarese, Proceedings of the IEEE International Conference on Computer Vision. the IEEE International Conference on Computer VisionB.-s. Kim, P. Kohli, and S. Savarese. 3d scene understand- ing by voxel-crf. In Proceedings of the IEEE International Conference on Computer Vision, pages 1425-1432, 2013. 8\n\nChisel: Real time large scale 3D reconstruction onboard a mobile device using spatially hashed signed distance fields. M Klingensmith, I Dryanovski, S Srinivasa, J Xiao, Robotics: Science and Systems. M. Klingensmith, I. Dryanovski, S. Srinivasa, and J. Xiao. Chisel: Real time large scale 3D reconstruction onboard a mobile device using spatially hashed signed distance fields. In Robotics: Science and Systems, 2015. 4\n\nLearning human activities and object affordances from RGB-D videos. H S Koppula, R Gupta, A Saxena, The International Journal of Robotics Research. 328H. S. Koppula, R. Gupta, and A. Saxena. Learning human activities and object affordances from RGB-D videos. The International Journal of Robotics Research, 32(8):951-970, 2013. 2\n\nImageNet classification with deep convolutional neural networks. A Krizhevsky, I Sutskever, G E Hinton, Advances in neural information processing systems. A. Krizhevsky, I. Sutskever, and G. E. Hinton. ImageNet classification with deep convolutional neural networks. In Advances in neural information processing systems, pages 1097-1105, 2012. 1\n\nDatabase-assisted object retrieval for real-time 3D reconstruction. Y Li, A Dai, L Guibas, M Nießner, Computer Graphics Forum. Wiley Online Library34Y. Li, A. Dai, L. Guibas, and M. Nießner. Database-assisted object retrieval for real-time 3D reconstruction. In Computer Graphics Forum, volume 34, pages 435-446. Wiley Online Library, 2015. 2\n\nHolistic scene understanding for 3D object detection with RGBD cameras. D Lin, S Fidler, R Urtasun, Proceedings of the IEEE International Conference on Computer Vision. the IEEE International Conference on Computer VisionD. Lin, S. Fidler, and R. Urtasun. Holistic scene understand- ing for 3D object detection with RGBD cameras. In Pro- ceedings of the IEEE International Conference on Computer Vision, pages 1417-1424, 2013. 2\n\nMicrosoft COCO: Common objects in context. T.-Y Lin, M Maire, S Belongie, J Hays, P Perona, D Ramanan, P Dollár, C L Zitnick, European Conference on Computer Vision. SpringerT.-Y. Lin, M. Maire, S. Belongie, J. Hays, P. Perona, D. Ra- manan, P. Dollár, and C. L. Zitnick. Microsoft COCO: Com- mon objects in context. In European Conference on Com- puter Vision, pages 740-755. Springer, 2014. 1\n\nLearning discriminative representations from RGB-D video data. L Liu, L Shao, IJCAI. 13L. Liu and L. Shao. Learning discriminative representations from RGB-D video data. In IJCAI, volume 1, page 3, 2013. 2\n\nFully convolutional networks for semantic segmentation. J Long, E Shelhamer, T Darrell, Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. the IEEE Conference on Computer Vision and Pattern RecognitionJ. Long, E. Shelhamer, and T. Darrell. Fully convolutional networks for semantic segmentation. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recogni- tion, pages 3431-3440, 2015. 7\n\nPeople tracking in RGB-D data with on-line boosted target models. M Luber, L Spinello, K O Arras, M. Luber, L. Spinello, and K. O. Arras. People tracking in RGB-D data with on-line boosted target models. In 2011\n\nIEEE/RSJ International Conference on Intelligent Robots and Systems. IEEE/RSJ International Conference on Intelligent Robots and Systems, pages 3844-3849. IEEE, 2011. 2\n\nObject disappearance for object discovery. J Mason, B Marthi, R Parr, 2012 IEEE/RSJ International Conference on Intelligent Robots and Systems. J. Mason, B. Marthi, and R. Parr. Object disappearance for object discovery. In 2012 IEEE/RSJ International Confer- ence on Intelligent Robots and Systems, pages 2836-2843. IEEE, 2012. 2\n\nObject detection and classification from large-scale cluttered indoor scans. O Mattausch, D Panozzo, C Mura, O Sorkine-Hornung, R Pajarola, Computer Graphics Forum. Wiley Online Library337O. Mattausch, D. Panozzo, C. Mura, O. Sorkine-Hornung, and R. Pajarola. Object detection and classification from large-scale cluttered indoor scans. In Computer Graphics Fo- rum, volume 33, pages 11-21. Wiley Online Library, 2014. 2, 7\n\nVoxNet: A 3D convolutional neural network for real-time object recognition. D Maturana, S Scherer, Intelligent Robots and Systems (IROS), 2015 IEEE/RSJ International Conference on. D. Maturana and S. Scherer. VoxNet: A 3D convolutional neural network for real-time object recognition. In Intelligent Robots and Systems (IROS), 2015 IEEE/RSJ International Conference on, pages 922-928. IEEE, 2015. 2\n\nWhen can we use KinectFusion for ground truth acquisition. S Meister, S Izadi, P Kohli, M Hämmerle, C Rother, D Kondermann, Workshop on Color-Depth Camera Fusion in Robotics, IROS. 2S. Meister, S. Izadi, P. Kohli, M. Hämmerle, C. Rother, and D. Kondermann. When can we use KinectFusion for ground truth acquisition. In Workshop on Color-Depth Camera Fu- sion in Robotics, IROS, volume 2, 2012. 2\n\nOn the repeatability and quality of keypoints for local feature-based 3D object retrieval from cluttered scenes. A Mian, M Bennamoun, R Owens, International Journal of Computer Vision. 892-3A. Mian, M. Bennamoun, and R. Owens. On the repeatabil- ity and quality of keypoints for local feature-based 3D ob- ject retrieval from cluttered scenes. International Journal of Computer Vision, 89(2-3):348-361, 2010. 2\n\nKinectFaceDB: A Kinect database for face recognition. R Min, N Kose, J.-L Dugelay, IEEE Transactions on Systems, Man, and Cybernetics: Systems. 4411R. Min, N. Kose, and J.-L. Dugelay. KinectFaceDB: A Kinect database for face recognition. IEEE Transactions on Systems, Man, and Cybernetics: Systems, 44(11):1534- 1548, 2014. 2\n\nIndoor segmentation and support inference from RGBD images. P K Nathan Silberman, Derek Hoiem, R Fergus, ECCV. 1621P. K. Nathan Silberman, Derek Hoiem and R. Fergus. Indoor segmentation and support inference from RGBD images. In ECCV, 2012. 1, 2, 6, 16, 21\n\nKinectFusion: Real-time dense surface mapping and tracking. R A Newcombe, S Izadi, O Hilliges, D Molyneaux, D Kim, A J Davison, P Kohi, J Shotton, S Hodges, A Fitzgibbon, 10th IEEE international symposium on. Mixed and augmented reality (ISMAR)R. A. Newcombe, S. Izadi, O. Hilliges, D. Molyneaux, D. Kim, A. J. Davison, P. Kohi, J. Shotton, S. Hodges, and A. Fitzgibbon. KinectFusion: Real-time dense surface map- ping and tracking. In Mixed and augmented reality (ISMAR), 2011 10th IEEE international symposium on, pages 127- 136. IEEE, 2011. 2, 4\n\nA robust 3D-2D interactive tool for scene segmentation and annotation. D T Nguyen, B.-S Hua, L.-F Yu, S.-K Yeung, arXiv:1610.0588323arXiv preprintD. T. Nguyen, B.-S. Hua, L.-F. Yu, and S.-K. Yeung. A ro- bust 3D-2D interactive tool for scene segmentation and an- notation. arXiv preprint arXiv:1610.05883, 2016. 2, 3\n\nRGBD-HuDaAct: A colordepth video database for human daily activity recognition. B Ni, G Wang, P Moulin, Consumer Depth Cameras for Computer Vision. SpringerB. Ni, G. Wang, and P. Moulin. RGBD-HuDaAct: A color- depth video database for human daily activity recognition. In Consumer Depth Cameras for Computer Vision, pages 193- 208. Springer, 2013. 2\n\nReal-time 3D reconstruction at scale using voxel hashing. M Nießner, M Zollhöfer, S Izadi, M Stamminger, ACM Transactions on Graphics (TOG). 32616M. Nießner, M. Zollhöfer, S. Izadi, and M. Stamminger. Real-time 3D reconstruction at scale using voxel hashing. ACM Transactions on Graphics (TOG), 32(6):169, 2013. 2, 4, 16\n\nThe structure sensor. Occipital, Occipital. Occipital: The structure sensor, 2016. 3\n\nEfficient inference in fully connected crfs with gaussian edge potentials. K Phillip, V Koltun, Adv. Neural Inf. Process. Syst. 8K. Phillip and V. Koltun. Efficient inference in fully con- nected crfs with gaussian edge potentials. Adv. Neural Inf. Process. Syst, 2011. 8\n\nTracking a depth camera: Parameter exploration for fast ICP. F Pomerleau, S Magnenat, F Colas, M Liu, R Siegwart, IEEE/RSJ International Conference on Intelligent Robots and Systems. F. Pomerleau, S. Magnenat, F. Colas, M. Liu, and R. Sieg- wart. Tracking a depth camera: Parameter exploration for fast ICP. In 2011 IEEE/RSJ International Conference on In- telligent Robots and Systems, pages 3824-3829. IEEE, 2011. 2\n\nVolumetric and multi-view CNNs for object classification on 3D data. C R Qi, H Su, M Niessner, A Dai, M Yan, L J Guibas, arXiv:1604.032657arXiv preprintC. R. Qi, H. Su, M. Niessner, A. Dai, M. Yan, and L. J. Guibas. Volumetric and multi-view CNNs for object classi- fication on 3D data. arXiv preprint arXiv:1604.03265, 2016. 2, 7, 8\n\nRGB-(D) scene labeling: Features and algorithms. X Ren, L Bo, D Fox, Computer Vision and Pattern Recognition (CVPR), 2012 IEEE Conference on. X. Ren, L. Bo, and D. Fox. RGB-(D) scene labeling: Fea- tures and algorithms. In Computer Vision and Pattern Recog- nition (CVPR), 2012 IEEE Conference on, pages 2759-2766. IEEE, 2012. 2\n\nSegmentation of unknown objects in indoor environments. A Richtsfeld, T Mörwald, J Prankl, M Zillich, M Vincze, 2012 IEEE/RSJ International Conference on Intelligent Robots and Systems. A. Richtsfeld, T. Mörwald, J. Prankl, M. Zillich, and M. Vincze. Segmentation of unknown objects in indoor en- vironments. In 2012 IEEE/RSJ International Conference on Intelligent Robots and Systems, pages 4791-4796. IEEE, 2012. 2\n\nLabelMe: a database and web-based tool for image annotation. B C Russell, A Torralba, K P Murphy, W T Freeman, International journal of computer vision. 771-3B. C. Russell, A. Torralba, K. P. Murphy, and W. T. Free- man. LabelMe: a database and web-based tool for image annotation. International journal of computer vision, 77(1- 3):157-173, 2008. 2\n\nSceneGrok: Inferring action maps in 3D environments. M Savva, A X Chang, P Hanrahan, M Fisher, M Nießner, ACM Transactions on Graphics (TOG). 336212M. Savva, A. X. Chang, P. Hanrahan, M. Fisher, and M. Nießner. SceneGrok: Inferring action maps in 3D environments. ACM Transactions on Graphics (TOG), 33(6):212, 2014. 2\n\nPiGraphs: Learning interaction snapshots from observations. M Savva, A X Chang, P Hanrahan, M Fisher, M Nießner, ACM Transactions on Graphics (TOG). 35417M. Savva, A. X. Chang, P. Hanrahan, M. Fisher, and M. Nießner. PiGraphs: Learning interaction snapshots from observations. ACM Transactions on Graphics (TOG), 35(4), 2016. 1, 2, 3, 16, 17\n\nScene coordinate regression forests for camera relocalization in RGB-D images. J Shotton, B Glocker, C Zach, S Izadi, A Criminisi, A Fitzgibbon, Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. the IEEE Conference on Computer Vision and Pattern RecognitionJ. Shotton, B. Glocker, C. Zach, S. Izadi, A. Criminisi, and A. Fitzgibbon. Scene coordinate regression forests for cam- era relocalization in RGB-D images. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recogni- tion, pages 2930-2937, 2013. 2\n\nBuilding part-based object detectors via 3D geometry. A Shrivastava, A Gupta, Proceedings of the IEEE International Conference on Computer Vision. the IEEE International Conference on Computer VisionA. Shrivastava and A. Gupta. Building part-based object de- tectors via 3D geometry. In Proceedings of the IEEE Inter- national Conference on Computer Vision, pages 1745-1752, 2013. 2\n\nIndoor scene segmentation using a structured light sensor. N Silberman, R Fergus, Proceedings of the International Conference on Computer Vision -Workshop on 3D Representation and Recognition. the International Conference on Computer Vision -Workshop on 3D Representation and Recognition1N. Silberman and R. Fergus. Indoor scene segmentation us- ing a structured light sensor. In Proceedings of the Inter- national Conference on Computer Vision -Workshop on 3D Representation and Recognition, 2011. 1, 2\n\nSUN RGB-D: A RGB-D scene understanding benchmark suite. S Song, S P Lichtenberg, J Xiao, Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. the IEEE Conference on Computer Vision and Pattern Recognition1S. Song, S. P. Lichtenberg, and J. Xiao. SUN RGB-D: A RGB-D scene understanding benchmark suite. In Proceed- ings of the IEEE Conference on Computer Vision and Pattern Recognition, pages 567-576, 2015. 1, 2\n\nSliding shapes for 3D object detection in depth images. S Song, J Xiao, European Conference on Computer Vision. SpringerS. Song and J. Xiao. Sliding shapes for 3D object detection in depth images. In European Conference on Computer Vision, pages 634-651. Springer, 2014. 2\n\nDeep sliding shapes for amodal 3D object detection in RGB-D images. S Song, J Xiao, arXiv:1511.023001arXiv preprintS. Song and J. Xiao. Deep sliding shapes for amodal 3D object detection in RGB-D images. arXiv preprint arXiv:1511.02300, 2015. 1, 2\n\nSemantic scene completion from a single depth image. S Song, F Yu, A Zeng, A X Chang, M Savva, T Funkhouser, arXiv:1611.08974arXiv preprintS. Song, F. Yu, A. Zeng, A. X. Chang, M. Savva, and T. Funkhouser. Semantic scene completion from a single depth image. arXiv preprint arXiv:1611.08974, 2016. 2\n\nPeople detection in RGB-D data. L Spinello, K O Arras, IEEE/RSJ International Conference on Intelligent Robots and Systems. L. Spinello and K. O. Arras. People detection in RGB-D data. In 2011 IEEE/RSJ International Conference on Intel- ligent Robots and Systems, pages 3838-3843. IEEE, 2011. 2\n\nCombining embedded accelerometers with computer vision for recognizing food preparation activities. S Stein, S J Mckenna, Proceedings of the 2013 ACM international joint conference on Pervasive and ubiquitous computing. the 2013 ACM international joint conference on Pervasive and ubiquitous computingACMS. Stein and S. J. McKenna. Combining embedded ac- celerometers with computer vision for recognizing food preparation activities. In Proceedings of the 2013 ACM inter- national joint conference on Pervasive and ubiquitous com- puting, pages 729-738. ACM, 2013. 2\n\nA benchmark for the evaluation of RGB-D SLAM systems. J Sturm, N Engelhard, F Endres, W Burgard, D Cremers, 2012 IEEE/RSJ International Conference on Intelligent Robots and Systems. IEEE1J. Sturm, N. Engelhard, F. Endres, W. Burgard, and D. Cre- mers. A benchmark for the evaluation of RGB-D SLAM systems. In 2012 IEEE/RSJ International Conference on In- telligent Robots and Systems, pages 573-580. IEEE, 2012. 1, 2\n\nLearned-Miller. Multi-view convolutional neural networks for 3D shape recognition. H Su, S Maji, E Kalogerakis, E , Proc. ICCV. ICCVH. Su, S. Maji, E. Kalogerakis, and E. G. Learned-Miller. Multi-view convolutional neural networks for 3D shape recognition. In Proc. ICCV, 2015. 7\n\nHuman activity detection from RGBD images. plan, activity, and intent recognition. J Sung, C Ponce, B Selman, A Saxena, 64J. Sung, C. Ponce, B. Selman, and A. Saxena. Human activ- ity detection from RGBD images. plan, activity, and intent recognition, 64, 2011. 2\n\nUnsupervised intrinsic calibration of depth sensors via SLAM. A Teichman, S Miller, S Thrun, Robotics: Science and Systems. 24820A. Teichman, S. Miller, and S. Thrun. Unsupervised intrinsic calibration of depth sensors via SLAM. In Robotics: Science and Systems, volume 248, 2013. 3, 20\n\nLearning to navigate the energy landscape. J Valentin, A Dai, M Nießner, P Kohli, P Torr, S Izadi, C Keskin, arXiv:1603.05772arXiv preprintJ. Valentin, A. Dai, M. Nießner, P. Kohli, P. Torr, S. Izadi, and C. Keskin. Learning to navigate the energy landscape. arXiv preprint arXiv:1603.05772, 2016. 2\n\nSe-manticPaint: Interactive 3D labeling and learning at your fingertips. J Valentin, V Vineet, M.-M Cheng, D Kim, J Shotton, P Kohli, M Nießner, A Criminisi, S Izadi, P Torr, ACM Transactions on Graphics (TOG). 345154J. Valentin, V. Vineet, M.-M. Cheng, D. Kim, J. Shotton, P. Kohli, M. Nießner, A. Criminisi, S. Izadi, and P. Torr. Se- manticPaint: Interactive 3D labeling and learning at your fin- gertips. ACM Transactions on Graphics (TOG), 34(5):154, 2015. 2, 8\n\nOnline reconstruction of indoor scenes from RGB-D streams. H Wang, J Wang, W Liang, Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. the IEEE Conference on Computer Vision and Pattern RecognitionH. Wang, J. Wang, and W. Liang. Online reconstruction of indoor scenes from RGB-D streams. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recogni- tion, pages 3271-3279, 2016. 3\n\nKintinuous: Spatially extended KinectFusion. T Whelan, M Kaess, M Fallon, H Johannsson, J Leonard, J Mcdonald, 4T. Whelan, M. Kaess, M. Fallon, H. Johannsson, J. Leonard, and J. McDonald. Kintinuous: Spatially extended KinectFu- sion. 2012. 4\n\nElasticFusion: Dense SLAM without a pose graph. T Whelan, S Leutenegger, R F Salas-Moreno, B Glocker, A J Davison, Proc. Robotics: Science and Systems. Robotics: Science and SystemsRome, ItalyT. Whelan, S. Leutenegger, R. F. Salas-Moreno, B. Glocker, and A. J. Davison. ElasticFusion: Dense SLAM without a pose graph. Proc. Robotics: Science and Systems, Rome, Italy, 2015. 4\n\nElasticFusion: Real-time dense SLAM and light source estimation. T Whelan, R F Salas-Moreno, B Glocker, A J Davison, S Leutenegger, The International Journal of Robotics Research. 40278364916669237T. Whelan, R. F. Salas-Moreno, B. Glocker, A. J. Davison, and S. Leutenegger. ElasticFusion: Real-time dense SLAM and light source estimation. The International Journal of Robotics Research, page 0278364916669237, 2016. 4\n\n3D ShapeNets: A deep representation for volumetric shapes. Z Wu, S Song, A Khosla, F Yu, L Zhang, X Tang, J Xiao, Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. the IEEE Conference on Computer Vision and Pattern RecognitionZ. Wu, S. Song, A. Khosla, F. Yu, L. Zhang, X. Tang, and J. Xiao. 3D ShapeNets: A deep representation for volumetric shapes. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition, pages 1912-1920, 2015. 1, 2, 6, 7, 8, 21\n\nSUN3D: A database of big spaces reconstructed using sfm and object labels. J Xiao, A Owens, A Torralba, Computer Vision (ICCV). IEEE1J. Xiao, A. Owens, and A. Torralba. SUN3D: A database of big spaces reconstructed using sfm and object labels. In Computer Vision (ICCV), 2013 IEEE International Confer- ence on, pages 1625-1632. IEEE, 2013. 1, 2\n\nAutomatic registration of RGB-D scans via salient directions. B Zeisl, K Koser, M Pollefeys, Proceedings of the IEEE international conference on computer vision. the IEEE international conference on computer visionB. Zeisl, K. Koser, and M. Pollefeys. Automatic registration of RGB-D scans via salient directions. In Proceedings of the IEEE international conference on computer vision, pages 2808-2815, 2013. 2\n\nEstimating the 3D layout of indoor scenes and its clutter from depth sensors. J Zhang, C Kan, A G Schwing, R Urtasun, Proceedings of the IEEE International Conference on Computer Vision. the IEEE International Conference on Computer VisionJ. Zhang, C. Kan, A. G. Schwing, and R. Urtasun. Estimating the 3D layout of indoor scenes and its clutter from depth sen- sors. In Proceedings of the IEEE International Conference on Computer Vision, pages 1273-1280, 2013. 2\n\nShading-based refinement on volumetric signed distance functions. M Zollhöfer, A Dai, M Innmann, C Wu, M Stamminger, C Theobalt, M Nießner, ACM Transactions on Graphics (TOG). 34496M. Zollhöfer, A. Dai, M. Innmann, C. Wu, M. Stamminger, C. Theobalt, and M. Nießner. Shading-based refinement on volumetric signed distance functions. ACM Transactions on Graphics (TOG), 34(4):96, 2015. 2\n", "annotations": {"author": "[{\"end\":98,\"start\":65},{\"end\":136,\"start\":99},{\"end\":174,\"start\":137},{\"end\":212,\"start\":175},{\"end\":254,\"start\":213},{\"end\":294,\"start\":255}]", "publisher": null, "author_last_name": "[{\"end\":75,\"start\":72},{\"end\":112,\"start\":107},{\"end\":150,\"start\":145},{\"end\":188,\"start\":182},{\"end\":230,\"start\":220},{\"end\":271,\"start\":264}]", "author_first_name": "[{\"end\":71,\"start\":65},{\"end\":104,\"start\":99},{\"end\":106,\"start\":105},{\"end\":144,\"start\":137},{\"end\":181,\"start\":175},{\"end\":219,\"start\":213},{\"end\":263,\"start\":255}]", "author_affiliation": "[{\"end\":97,\"start\":77},{\"end\":135,\"start\":114},{\"end\":173,\"start\":152},{\"end\":211,\"start\":190},{\"end\":253,\"start\":232},{\"end\":293,\"start\":273}]", "title": "[{\"end\":62,\"start\":1},{\"end\":356,\"start\":295}]", "venue": null, "abstract": "[{\"end\":1271,\"start\":358}]", "bib_ref": "[{\"attributes\":{\"ref_id\":\"b17\"},\"end\":1952,\"start\":1948},{\"attributes\":{\"ref_id\":\"b42\"},\"end\":1955,\"start\":1952},{\"attributes\":{\"ref_id\":\"b45\"},\"end\":1958,\"start\":1955},{\"attributes\":{\"ref_id\":\"b72\"},\"end\":2120,\"start\":2116},{\"attributes\":{\"ref_id\":\"b90\"},\"end\":2123,\"start\":2120},{\"attributes\":{\"ref_id\":\"b75\"},\"end\":2126,\"start\":2123},{\"attributes\":{\"ref_id\":\"b30\"},\"end\":2129,\"start\":2126},{\"attributes\":{\"ref_id\":\"b89\"},\"end\":2290,\"start\":2286},{\"attributes\":{\"ref_id\":\"b6\"},\"end\":2292,\"start\":2290},{\"attributes\":{\"ref_id\":\"b72\"},\"end\":2583,\"start\":2579},{\"attributes\":{\"ref_id\":\"b90\"},\"end\":2586,\"start\":2583},{\"attributes\":{\"ref_id\":\"b75\"},\"end\":2589,\"start\":2586},{\"attributes\":{\"ref_id\":\"b30\"},\"end\":2729,\"start\":2725},{\"attributes\":{\"ref_id\":\"b69\"},\"end\":2732,\"start\":2729},{\"attributes\":{\"ref_id\":\"b56\"},\"end\":3029,\"start\":3025},{\"attributes\":{\"ref_id\":\"b79\"},\"end\":3032,\"start\":3029},{\"attributes\":{\"ref_id\":\"b90\"},\"end\":3035,\"start\":3032},{\"attributes\":{\"ref_id\":\"b73\"},\"end\":3038,\"start\":3035},{\"attributes\":{\"ref_id\":\"b2\"},\"end\":3040,\"start\":3038},{\"attributes\":{\"ref_id\":\"b69\"},\"end\":3043,\"start\":3040},{\"attributes\":{\"ref_id\":\"b30\"},\"end\":3046,\"start\":3043},{\"attributes\":{\"ref_id\":\"b56\"},\"end\":3506,\"start\":3502},{\"attributes\":{\"ref_id\":\"b67\"},\"end\":3550,\"start\":3546},{\"attributes\":{\"ref_id\":\"b25\"},\"end\":3565,\"start\":3561},{\"attributes\":{\"ref_id\":\"b79\"},\"end\":3574,\"start\":3570},{\"attributes\":{\"ref_id\":\"b90\"},\"end\":3626,\"start\":3622},{\"attributes\":{\"ref_id\":\"b90\"},\"end\":3675,\"start\":3671},{\"attributes\":{\"ref_id\":\"b73\"},\"end\":3693,\"start\":3689},{\"attributes\":{\"ref_id\":\"b90\"},\"end\":3763,\"start\":3759},{\"attributes\":{\"ref_id\":\"b2\"},\"end\":3785,\"start\":3782},{\"attributes\":{\"ref_id\":\"b24\"},\"end\":3823,\"start\":3819},{\"attributes\":{\"ref_id\":\"b69\"},\"end\":3852,\"start\":3848},{\"attributes\":{\"ref_id\":\"b69\"},\"end\":3900,\"start\":3896},{\"attributes\":{\"ref_id\":\"b60\"},\"end\":3914,\"start\":3910},{\"attributes\":{\"ref_id\":\"b30\"},\"end\":3930,\"start\":3926},{\"attributes\":{\"ref_id\":\"b58\"},\"end\":3980,\"start\":3976},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":3993,\"start\":3990},{\"attributes\":{\"ref_id\":\"b12\"},\"end\":4077,\"start\":4073},{\"attributes\":{\"ref_id\":\"b54\"},\"end\":6465,\"start\":6461},{\"attributes\":{\"ref_id\":\"b32\"},\"end\":6468,\"start\":6465},{\"attributes\":{\"ref_id\":\"b48\"},\"end\":6471,\"start\":6468},{\"attributes\":{\"ref_id\":\"b63\"},\"end\":6474,\"start\":6471},{\"attributes\":{\"ref_id\":\"b77\"},\"end\":6477,\"start\":6474},{\"attributes\":{\"ref_id\":\"b81\"},\"end\":6480,\"start\":6477},{\"attributes\":{\"ref_id\":\"b72\"},\"end\":6483,\"start\":6480},{\"attributes\":{\"ref_id\":\"b3\"},\"end\":6485,\"start\":6483},{\"attributes\":{\"ref_id\":\"b56\"},\"end\":6488,\"start\":6485},{\"attributes\":{\"ref_id\":\"b79\"},\"end\":6491,\"start\":6488},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":6494,\"start\":6491},{\"attributes\":{\"ref_id\":\"b53\"},\"end\":6497,\"start\":6494},{\"attributes\":{\"ref_id\":\"b0\"},\"end\":6499,\"start\":6497},{\"attributes\":{\"ref_id\":\"b66\"},\"end\":6502,\"start\":6499},{\"attributes\":{\"ref_id\":\"b29\"},\"end\":6505,\"start\":6502},{\"attributes\":{\"ref_id\":\"b50\"},\"end\":6508,\"start\":6505},{\"attributes\":{\"ref_id\":\"b21\"},\"end\":6511,\"start\":6508},{\"attributes\":{\"ref_id\":\"b46\"},\"end\":6514,\"start\":6511},{\"attributes\":{\"ref_id\":\"b41\"},\"end\":6517,\"start\":6514},{\"attributes\":{\"ref_id\":\"b90\"},\"end\":6520,\"start\":6517},{\"attributes\":{\"ref_id\":\"b78\"},\"end\":6523,\"start\":6520},{\"attributes\":{\"ref_id\":\"b59\"},\"end\":6526,\"start\":6523},{\"attributes\":{\"ref_id\":\"b70\"},\"end\":6529,\"start\":6526},{\"attributes\":{\"ref_id\":\"b91\"},\"end\":6532,\"start\":6529},{\"attributes\":{\"ref_id\":\"b34\"},\"end\":6535,\"start\":6532},{\"attributes\":{\"ref_id\":\"b16\"},\"end\":6538,\"start\":6535},{\"attributes\":{\"ref_id\":\"b33\"},\"end\":6541,\"start\":6538},{\"attributes\":{\"ref_id\":\"b55\"},\"end\":6544,\"start\":6541},{\"attributes\":{\"ref_id\":\"b38\"},\"end\":6547,\"start\":6544},{\"attributes\":{\"ref_id\":\"b28\"},\"end\":6550,\"start\":6547},{\"attributes\":{\"ref_id\":\"b68\"},\"end\":6553,\"start\":6550},{\"attributes\":{\"ref_id\":\"b51\"},\"end\":6556,\"start\":6553},{\"attributes\":{\"ref_id\":\"b43\"},\"end\":6559,\"start\":6556},{\"attributes\":{\"ref_id\":\"b93\"},\"end\":6562,\"start\":6559},{\"attributes\":{\"ref_id\":\"b73\"},\"end\":6565,\"start\":6562},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":6567,\"start\":6565},{\"attributes\":{\"ref_id\":\"b31\"},\"end\":6570,\"start\":6567},{\"attributes\":{\"ref_id\":\"b83\"},\"end\":6573,\"start\":6570},{\"attributes\":{\"ref_id\":\"b69\"},\"end\":6576,\"start\":6573},{\"attributes\":{\"ref_id\":\"b30\"},\"end\":6579,\"start\":6576},{\"attributes\":{\"ref_id\":\"b2\"},\"end\":6581,\"start\":6579},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":6584,\"start\":6581},{\"attributes\":{\"ref_id\":\"b76\"},\"end\":6587,\"start\":6584},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":6589,\"start\":6587},{\"attributes\":{\"ref_id\":\"b0\"},\"end\":6592,\"start\":6591},{\"attributes\":{\"ref_id\":\"b65\"},\"end\":6714,\"start\":6710},{\"attributes\":{\"ref_id\":\"b56\"},\"end\":6717,\"start\":6714},{\"attributes\":{\"ref_id\":\"b26\"},\"end\":6720,\"start\":6717},{\"attributes\":{\"ref_id\":\"b84\"},\"end\":6723,\"start\":6720},{\"attributes\":{\"ref_id\":\"b71\"},\"end\":6749,\"start\":6745},{\"attributes\":{\"ref_id\":\"b44\"},\"end\":6752,\"start\":6749},{\"attributes\":{\"ref_id\":\"b27\"},\"end\":6755,\"start\":6752},{\"attributes\":{\"ref_id\":\"b74\"},\"end\":6758,\"start\":6755},{\"attributes\":{\"ref_id\":\"b75\"},\"end\":6761,\"start\":6758},{\"attributes\":{\"ref_id\":\"b89\"},\"end\":6792,\"start\":6788},{\"attributes\":{\"ref_id\":\"b52\"},\"end\":6795,\"start\":6792},{\"attributes\":{\"ref_id\":\"b64\"},\"end\":6798,\"start\":6795},{\"attributes\":{\"ref_id\":\"b92\"},\"end\":6815,\"start\":6811},{\"attributes\":{\"ref_id\":\"b22\"},\"end\":6818,\"start\":6815},{\"attributes\":{\"ref_id\":\"b23\"},\"end\":6821,\"start\":6818},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":6918,\"start\":6914},{\"attributes\":{\"ref_id\":\"b57\"},\"end\":7041,\"start\":7037},{\"attributes\":{\"ref_id\":\"b72\"},\"end\":7330,\"start\":7326},{\"attributes\":{\"ref_id\":\"b67\"},\"end\":7488,\"start\":7484},{\"attributes\":{\"ref_id\":\"b73\"},\"end\":7504,\"start\":7500},{\"end\":8273,\"start\":8260},{\"attributes\":{\"ref_id\":\"b2\"},\"end\":8943,\"start\":8940},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":8945,\"start\":8943},{\"attributes\":{\"ref_id\":\"b30\"},\"end\":9465,\"start\":9461},{\"attributes\":{\"ref_id\":\"b69\"},\"end\":9483,\"start\":9479},{\"attributes\":{\"ref_id\":\"b58\"},\"end\":9617,\"start\":9613},{\"attributes\":{\"ref_id\":\"b69\"},\"end\":9620,\"start\":9617},{\"attributes\":{\"ref_id\":\"b61\"},\"end\":11179,\"start\":11175},{\"attributes\":{\"ref_id\":\"b85\"},\"end\":12180,\"start\":12176},{\"attributes\":{\"ref_id\":\"b82\"},\"end\":12730,\"start\":12726},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":12733,\"start\":12730},{\"attributes\":{\"ref_id\":\"b11\"},\"end\":15082,\"start\":15078},{\"attributes\":{\"ref_id\":\"b57\"},\"end\":15262,\"start\":15258},{\"attributes\":{\"ref_id\":\"b86\"},\"end\":15265,\"start\":15262},{\"attributes\":{\"ref_id\":\"b7\"},\"end\":15267,\"start\":15265},{\"attributes\":{\"ref_id\":\"b60\"},\"end\":15270,\"start\":15267},{\"attributes\":{\"ref_id\":\"b35\"},\"end\":15273,\"start\":15270},{\"attributes\":{\"ref_id\":\"b87\"},\"end\":15276,\"start\":15273},{\"attributes\":{\"ref_id\":\"b40\"},\"end\":15279,\"start\":15276},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":15281,\"start\":15279},{\"attributes\":{\"ref_id\":\"b88\"},\"end\":15284,\"start\":15281},{\"attributes\":{\"ref_id\":\"b36\"},\"end\":15287,\"start\":15284},{\"attributes\":{\"ref_id\":\"b12\"},\"end\":15290,\"start\":15287},{\"attributes\":{\"ref_id\":\"b12\"},\"end\":15329,\"start\":15325},{\"attributes\":{\"ref_id\":\"b12\"},\"end\":15542,\"start\":15538},{\"attributes\":{\"ref_id\":\"b60\"},\"end\":15701,\"start\":15697},{\"attributes\":{\"ref_id\":\"b19\"},\"end\":18435,\"start\":18431},{\"attributes\":{\"ref_id\":\"b37\"},\"end\":18438,\"start\":18435},{\"attributes\":{\"ref_id\":\"b6\"},\"end\":21712,\"start\":21709},{\"attributes\":{\"ref_id\":\"b30\"},\"end\":21997,\"start\":21993},{\"attributes\":{\"ref_id\":\"b56\"},\"end\":24264,\"start\":24260},{\"attributes\":{\"ref_id\":\"b89\"},\"end\":24279,\"start\":24275},{\"attributes\":{\"ref_id\":\"b6\"},\"end\":24293,\"start\":24290},{\"attributes\":{\"ref_id\":\"b18\"},\"end\":24328,\"start\":24324},{\"attributes\":{\"ref_id\":\"b89\"},\"end\":26463,\"start\":26459},{\"attributes\":{\"ref_id\":\"b6\"},\"end\":26465,\"start\":26463},{\"attributes\":{\"ref_id\":\"b89\"},\"end\":26617,\"start\":26613},{\"attributes\":{\"ref_id\":\"b80\"},\"end\":26620,\"start\":26617},{\"attributes\":{\"ref_id\":\"b51\"},\"end\":26623,\"start\":26620},{\"attributes\":{\"ref_id\":\"b13\"},\"end\":26626,\"start\":26623},{\"attributes\":{\"ref_id\":\"b64\"},\"end\":26629,\"start\":26626},{\"attributes\":{\"ref_id\":\"b64\"},\"end\":27806,\"start\":27802},{\"attributes\":{\"ref_id\":\"b64\"},\"end\":28076,\"start\":28072},{\"attributes\":{\"ref_id\":\"b64\"},\"end\":28487,\"start\":28483},{\"attributes\":{\"ref_id\":\"b6\"},\"end\":28657,\"start\":28654},{\"attributes\":{\"ref_id\":\"b30\"},\"end\":28997,\"start\":28993},{\"attributes\":{\"ref_id\":\"b47\"},\"end\":29935,\"start\":29931},{\"attributes\":{\"ref_id\":\"b39\"},\"end\":30238,\"start\":30234},{\"attributes\":{\"ref_id\":\"b84\"},\"end\":30241,\"start\":30238},{\"attributes\":{\"ref_id\":\"b8\"},\"end\":30282,\"start\":30279},{\"attributes\":{\"ref_id\":\"b5\"},\"end\":30284,\"start\":30282},{\"attributes\":{\"ref_id\":\"b62\"},\"end\":33487,\"start\":33483},{\"attributes\":{\"ref_id\":\"b84\"},\"end\":33509,\"start\":33505},{\"attributes\":{\"ref_id\":\"b89\"},\"end\":34024,\"start\":34020},{\"attributes\":{\"ref_id\":\"b64\"},\"end\":34043,\"start\":34039},{\"attributes\":{\"ref_id\":\"b64\"},\"end\":34619,\"start\":34615},{\"attributes\":{\"ref_id\":\"b18\"},\"end\":36507,\"start\":36503},{\"attributes\":{\"ref_id\":\"b30\"},\"end\":37734,\"start\":37730},{\"attributes\":{\"ref_id\":\"b30\"},\"end\":38443,\"start\":38439},{\"attributes\":{\"ref_id\":\"b56\"},\"end\":40286,\"start\":40282},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":40380,\"start\":40376},{\"attributes\":{\"ref_id\":\"b30\"},\"end\":40513,\"start\":40509},{\"attributes\":{\"ref_id\":\"b69\"},\"end\":40567,\"start\":40563},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":40695,\"start\":40692},{\"attributes\":{\"ref_id\":\"b69\"},\"end\":40906,\"start\":40902},{\"attributes\":{\"ref_id\":\"b60\"},\"end\":41045,\"start\":41041},{\"attributes\":{\"ref_id\":\"b69\"},\"end\":41758,\"start\":41754},{\"attributes\":{\"ref_id\":\"b30\"},\"end\":41772,\"start\":41768},{\"attributes\":{\"ref_id\":\"b82\"},\"end\":49729,\"start\":49725},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":50196,\"start\":50192},{\"attributes\":{\"ref_id\":\"b82\"},\"end\":51189,\"start\":51185},{\"attributes\":{\"ref_id\":\"b12\"},\"end\":51462,\"start\":51458},{\"attributes\":{\"ref_id\":\"b18\"},\"end\":54315,\"start\":54311},{\"attributes\":{\"ref_id\":\"b56\"},\"end\":54430,\"start\":54426},{\"attributes\":{\"ref_id\":\"b89\"},\"end\":54445,\"start\":54441},{\"attributes\":{\"ref_id\":\"b6\"},\"end\":54467,\"start\":54464},{\"end\":55214,\"start\":55205},{\"attributes\":{\"ref_id\":\"b6\"},\"end\":57845,\"start\":57842},{\"attributes\":{\"ref_id\":\"b20\"},\"end\":60461,\"start\":60457}]", "figure": "[{\"attributes\":{\"id\":\"fig_0\"},\"end\":57114,\"start\":56962},{\"attributes\":{\"id\":\"fig_1\"},\"end\":57431,\"start\":57115},{\"attributes\":{\"id\":\"fig_2\"},\"end\":57747,\"start\":57432},{\"attributes\":{\"id\":\"fig_3\"},\"end\":57816,\"start\":57748},{\"attributes\":{\"id\":\"fig_4\"},\"end\":58039,\"start\":57817},{\"attributes\":{\"id\":\"fig_5\"},\"end\":58115,\"start\":58040},{\"attributes\":{\"id\":\"fig_6\"},\"end\":58264,\"start\":58116},{\"attributes\":{\"id\":\"fig_7\"},\"end\":58516,\"start\":58265},{\"attributes\":{\"id\":\"fig_8\"},\"end\":58636,\"start\":58517},{\"attributes\":{\"id\":\"fig_10\"},\"end\":58784,\"start\":58637},{\"attributes\":{\"id\":\"fig_11\"},\"end\":59390,\"start\":58785},{\"attributes\":{\"id\":\"fig_12\"},\"end\":59739,\"start\":59391},{\"attributes\":{\"id\":\"fig_13\"},\"end\":60000,\"start\":59740},{\"attributes\":{\"id\":\"tab_0\",\"type\":\"table\"},\"end\":60369,\"start\":60001}]", "paragraph": "[{\"end\":2781,\"start\":1287},{\"end\":3427,\"start\":2783},{\"end\":4350,\"start\":3446},{\"end\":4672,\"start\":4352},{\"end\":5347,\"start\":4674},{\"end\":5685,\"start\":5349},{\"end\":5732,\"start\":5687},{\"end\":6237,\"start\":5734},{\"end\":6333,\"start\":6239},{\"end\":6822,\"start\":6351},{\"end\":7238,\"start\":6824},{\"end\":7851,\"start\":7240},{\"end\":8126,\"start\":7853},{\"end\":8799,\"start\":8189},{\"end\":9413,\"start\":8801},{\"end\":10072,\"start\":9415},{\"end\":10377,\"start\":10106},{\"end\":10933,\"start\":10379},{\"end\":11836,\"start\":10952},{\"end\":13766,\"start\":11838},{\"end\":14598,\"start\":13768},{\"end\":15029,\"start\":14625},{\"end\":15489,\"start\":15031},{\"end\":16098,\"start\":15491},{\"end\":16999,\"start\":16100},{\"end\":17460,\"start\":17001},{\"end\":17946,\"start\":17484},{\"end\":18234,\"start\":17948},{\"end\":18796,\"start\":18236},{\"end\":19205,\"start\":18798},{\"end\":20110,\"start\":19207},{\"end\":20186,\"start\":20112},{\"end\":21038,\"start\":20188},{\"end\":21482,\"start\":21040},{\"end\":22213,\"start\":21484},{\"end\":22998,\"start\":22215},{\"end\":24138,\"start\":23018},{\"end\":24666,\"start\":24140},{\"end\":24990,\"start\":24668},{\"end\":25653,\"start\":24992},{\"end\":25748,\"start\":25655},{\"end\":25894,\"start\":25773},{\"end\":26363,\"start\":25896},{\"end\":27057,\"start\":26392},{\"end\":27684,\"start\":27059},{\"end\":28392,\"start\":27686},{\"end\":29807,\"start\":28394},{\"end\":30285,\"start\":29835},{\"end\":31675,\"start\":30287},{\"end\":32655,\"start\":31677},{\"end\":32811,\"start\":32657},{\"end\":33289,\"start\":32813},{\"end\":33604,\"start\":33291},{\"end\":34127,\"start\":33628},{\"end\":35358,\"start\":34129},{\"end\":35959,\"start\":35373},{\"end\":38669,\"start\":36001},{\"end\":39472,\"start\":38751},{\"end\":39933,\"start\":39474},{\"end\":40568,\"start\":39973},{\"end\":41529,\"start\":40570},{\"end\":42172,\"start\":41531},{\"end\":42350,\"start\":42174},{\"end\":42631,\"start\":42352},{\"end\":43475,\"start\":42676},{\"end\":43927,\"start\":43477},{\"end\":44872,\"start\":43929},{\"end\":46359,\"start\":44909},{\"end\":48350,\"start\":46389},{\"end\":48599,\"start\":48378},{\"end\":49390,\"start\":48601},{\"end\":51303,\"start\":49392},{\"end\":52131,\"start\":51335},{\"end\":52755,\"start\":52167},{\"end\":53555,\"start\":52757},{\"end\":54469,\"start\":53595},{\"end\":55088,\"start\":54471},{\"end\":55271,\"start\":55090},{\"end\":55843,\"start\":55273},{\"end\":56961,\"start\":55866}]", "formula": null, "table_ref": "[{\"end\":4132,\"start\":4125},{\"end\":23616,\"start\":23609},{\"end\":25497,\"start\":25490},{\"end\":25932,\"start\":25925},{\"end\":28496,\"start\":28489},{\"end\":29651,\"start\":29644},{\"end\":33101,\"start\":33094},{\"end\":34862,\"start\":34855},{\"end\":37721,\"start\":37020},{\"end\":38331,\"start\":37744}]", "section_header": "[{\"attributes\":{\"n\":\"1.\"},\"end\":1285,\"start\":1273},{\"end\":3437,\"start\":3430},{\"end\":3444,\"start\":3440},{\"attributes\":{\"n\":\"2.\"},\"end\":6349,\"start\":6336},{\"end\":8143,\"start\":8129},{\"end\":8163,\"start\":8146},{\"end\":8172,\"start\":8166},{\"end\":8187,\"start\":8175},{\"attributes\":{\"n\":\"3.\"},\"end\":10104,\"start\":10075},{\"attributes\":{\"n\":\"3.1.\"},\"end\":10950,\"start\":10936},{\"attributes\":{\"n\":\"3.2.\"},\"end\":14623,\"start\":14601},{\"attributes\":{\"n\":\"3.3.\"},\"end\":17482,\"start\":17463},{\"attributes\":{\"n\":\"4.\"},\"end\":23016,\"start\":23001},{\"attributes\":{\"n\":\"5.\"},\"end\":25771,\"start\":25751},{\"attributes\":{\"n\":\"5.1.\"},\"end\":26390,\"start\":26366},{\"attributes\":{\"n\":\"5.2.\"},\"end\":29833,\"start\":29810},{\"attributes\":{\"n\":\"5.3.\"},\"end\":33626,\"start\":33607},{\"attributes\":{\"n\":\"6.\"},\"end\":35371,\"start\":35361},{\"end\":35999,\"start\":35962},{\"end\":38710,\"start\":38672},{\"end\":38749,\"start\":38713},{\"end\":39971,\"start\":39936},{\"end\":42674,\"start\":42634},{\"end\":44907,\"start\":44875},{\"end\":46387,\"start\":46362},{\"end\":48376,\"start\":48353},{\"end\":51333,\"start\":51306},{\"end\":52165,\"start\":52134},{\"end\":53593,\"start\":53558},{\"end\":55864,\"start\":55846},{\"end\":56973,\"start\":56963},{\"end\":57126,\"start\":57116},{\"end\":57443,\"start\":57433},{\"end\":57759,\"start\":57749},{\"end\":57828,\"start\":57818},{\"end\":58051,\"start\":58041},{\"end\":58127,\"start\":58117},{\"end\":58277,\"start\":58266},{\"end\":58529,\"start\":58518},{\"end\":58649,\"start\":58638},{\"end\":58797,\"start\":58786},{\"end\":59403,\"start\":59392},{\"end\":59752,\"start\":59741}]", "table": "[{\"end\":60369,\"start\":60090}]", "figure_caption": "[{\"end\":57114,\"start\":56975},{\"end\":57431,\"start\":57128},{\"end\":57747,\"start\":57445},{\"end\":57816,\"start\":57761},{\"end\":58039,\"start\":57830},{\"end\":58115,\"start\":58053},{\"end\":58264,\"start\":58129},{\"end\":58516,\"start\":58280},{\"end\":58636,\"start\":58532},{\"end\":58784,\"start\":58652},{\"end\":59390,\"start\":58800},{\"end\":59739,\"start\":59406},{\"end\":60000,\"start\":59755},{\"end\":60090,\"start\":60003}]", "figure_ref": "[{\"end\":3322,\"start\":3316},{\"end\":8322,\"start\":8314},{\"end\":10207,\"start\":10199},{\"end\":11334,\"start\":11328},{\"attributes\":{\"ref_id\":\"fig_1\"},\"end\":13151,\"start\":13145},{\"end\":13308,\"start\":13296},{\"attributes\":{\"ref_id\":\"fig_2\"},\"end\":18545,\"start\":18539},{\"end\":19739,\"start\":19731},{\"end\":21837,\"start\":21831},{\"attributes\":{\"ref_id\":\"fig_3\"},\"end\":23624,\"start\":23618},{\"attributes\":{\"ref_id\":\"fig_4\"},\"end\":25211,\"start\":25205},{\"attributes\":{\"ref_id\":\"fig_5\"},\"end\":32248,\"start\":32242},{\"attributes\":{\"ref_id\":\"fig_6\"},\"end\":33169,\"start\":33163},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":36178,\"start\":36171},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":36733,\"start\":36726},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":36742,\"start\":36735},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":41401,\"start\":41394},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":41717,\"start\":41710},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":41975,\"start\":41966},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":43655,\"start\":43648},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":44315,\"start\":44308},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":44871,\"start\":44864},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":45938,\"start\":45931},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":52325,\"start\":52318},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":52961,\"start\":52954},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":53224,\"start\":53215},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":53410,\"start\":53401},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":56089,\"start\":56082}]", "bib_author_first_name": "[{\"end\":61282,\"start\":61281},{\"end\":61292,\"start\":61291},{\"end\":61303,\"start\":61302},{\"end\":61306,\"start\":61304},{\"end\":61317,\"start\":61316},{\"end\":61632,\"start\":61631},{\"end\":61642,\"start\":61641},{\"end\":61649,\"start\":61648},{\"end\":61651,\"start\":61650},{\"end\":61660,\"start\":61659},{\"end\":61906,\"start\":61905},{\"end\":61916,\"start\":61915},{\"end\":61925,\"start\":61924},{\"end\":61927,\"start\":61926},{\"end\":61936,\"start\":61935},{\"end\":61945,\"start\":61944},{\"end\":61957,\"start\":61956},{\"end\":61968,\"start\":61967},{\"end\":62184,\"start\":62183},{\"end\":62186,\"start\":62185},{\"end\":62197,\"start\":62196},{\"end\":62209,\"start\":62208},{\"end\":62216,\"start\":62215},{\"end\":62227,\"start\":62226},{\"end\":62586,\"start\":62585},{\"end\":62595,\"start\":62594},{\"end\":62604,\"start\":62603},{\"end\":62615,\"start\":62614},{\"end\":62617,\"start\":62616},{\"end\":62627,\"start\":62626},{\"end\":62635,\"start\":62634},{\"end\":63084,\"start\":63083},{\"end\":63086,\"start\":63085},{\"end\":63095,\"start\":63094},{\"end\":63109,\"start\":63108},{\"end\":63119,\"start\":63118},{\"end\":63131,\"start\":63130},{\"end\":63140,\"start\":63139},{\"end\":63146,\"start\":63145},{\"end\":63158,\"start\":63157},{\"end\":63167,\"start\":63166},{\"end\":63175,\"start\":63174},{\"end\":63527,\"start\":63526},{\"end\":63535,\"start\":63534},{\"end\":63549,\"start\":63548},{\"end\":63807,\"start\":63806},{\"end\":63820,\"start\":63819},{\"end\":63828,\"start\":63827},{\"end\":63830,\"start\":63829},{\"end\":63840,\"start\":63839},{\"end\":64160,\"start\":64159},{\"end\":64171,\"start\":64167},{\"end\":64179,\"start\":64178},{\"end\":64453,\"start\":64452},{\"end\":64464,\"start\":64460},{\"end\":64472,\"start\":64471},{\"end\":64482,\"start\":64481},{\"end\":64722,\"start\":64721},{\"end\":64733,\"start\":64732},{\"end\":65230,\"start\":65229},{\"end\":65237,\"start\":65236},{\"end\":65248,\"start\":65247},{\"end\":65260,\"start\":65259},{\"end\":65269,\"start\":65268},{\"end\":65595,\"start\":65594},{\"end\":65602,\"start\":65601},{\"end\":65604,\"start\":65603},{\"end\":65610,\"start\":65609},{\"end\":65878,\"start\":65877},{\"end\":65881,\"start\":65879},{\"end\":65890,\"start\":65889},{\"end\":65900,\"start\":65899},{\"end\":66105,\"start\":66104},{\"end\":66115,\"start\":66114},{\"end\":66123,\"start\":66122},{\"end\":66136,\"start\":66135},{\"end\":66145,\"start\":66144},{\"end\":66156,\"start\":66155},{\"end\":66533,\"start\":66532},{\"end\":66545,\"start\":66544},{\"end\":66934,\"start\":66933},{\"end\":66948,\"start\":66947},{\"end\":66960,\"start\":66959},{\"end\":66962,\"start\":66961},{\"end\":66974,\"start\":66973},{\"end\":66982,\"start\":66981},{\"end\":67230,\"start\":67229},{\"end\":67377,\"start\":67376},{\"end\":67379,\"start\":67378},{\"end\":67395,\"start\":67394},{\"end\":67397,\"start\":67396},{\"end\":67653,\"start\":67652},{\"end\":67941,\"start\":67940},{\"end\":67955,\"start\":67954},{\"end\":67965,\"start\":67964},{\"end\":67974,\"start\":67973},{\"end\":68409,\"start\":68408},{\"end\":68411,\"start\":68410},{\"end\":68421,\"start\":68420},{\"end\":68430,\"start\":68429},{\"end\":68791,\"start\":68790},{\"end\":68793,\"start\":68792},{\"end\":68803,\"start\":68802},{\"end\":68812,\"start\":68811},{\"end\":69078,\"start\":69077},{\"end\":69270,\"start\":69269},{\"end\":69277,\"start\":69276},{\"end\":69647,\"start\":69646},{\"end\":69656,\"start\":69655},{\"end\":69668,\"start\":69667},{\"end\":70119,\"start\":70118},{\"end\":70128,\"start\":70127},{\"end\":70140,\"start\":70139},{\"end\":70152,\"start\":70151},{\"end\":70483,\"start\":70482},{\"end\":70492,\"start\":70491},{\"end\":70502,\"start\":70501},{\"end\":70514,\"start\":70513},{\"end\":70516,\"start\":70515},{\"end\":70882,\"start\":70881},{\"end\":70891,\"start\":70890},{\"end\":70900,\"start\":70899},{\"end\":71241,\"start\":71237},{\"end\":71251,\"start\":71247},{\"end\":71259,\"start\":71258},{\"end\":71261,\"start\":71260},{\"end\":71274,\"start\":71270},{\"end\":71285,\"start\":71281},{\"end\":71294,\"start\":71290},{\"end\":71564,\"start\":71563},{\"end\":71575,\"start\":71574},{\"end\":71588,\"start\":71587},{\"end\":71599,\"start\":71598},{\"end\":71611,\"start\":71610},{\"end\":71941,\"start\":71940},{\"end\":71952,\"start\":71951},{\"end\":71958,\"start\":71957},{\"end\":72295,\"start\":72294},{\"end\":72306,\"start\":72305},{\"end\":72316,\"start\":72315},{\"end\":72325,\"start\":72324},{\"end\":72724,\"start\":72723},{\"end\":72734,\"start\":72733},{\"end\":72745,\"start\":72744},{\"end\":72752,\"start\":72751},{\"end\":72754,\"start\":72753},{\"end\":72764,\"start\":72763},{\"end\":72773,\"start\":72772},{\"end\":72783,\"start\":72782},{\"end\":73152,\"start\":73151},{\"end\":73162,\"start\":73161},{\"end\":73176,\"start\":73175},{\"end\":73190,\"start\":73189},{\"end\":73197,\"start\":73196},{\"end\":73205,\"start\":73204},{\"end\":73590,\"start\":73589},{\"end\":73600,\"start\":73599},{\"end\":73602,\"start\":73601},{\"end\":73616,\"start\":73615},{\"end\":73618,\"start\":73617},{\"end\":73915,\"start\":73914},{\"end\":73927,\"start\":73926},{\"end\":73937,\"start\":73936},{\"end\":74274,\"start\":74273},{\"end\":74284,\"start\":74283},{\"end\":74623,\"start\":74622},{\"end\":74630,\"start\":74629},{\"end\":74639,\"start\":74638},{\"end\":75066,\"start\":75065},{\"end\":75082,\"start\":75081},{\"end\":75096,\"start\":75095},{\"end\":75109,\"start\":75108},{\"end\":75437,\"start\":75436},{\"end\":75439,\"start\":75438},{\"end\":75450,\"start\":75449},{\"end\":75459,\"start\":75458},{\"end\":75765,\"start\":75764},{\"end\":75779,\"start\":75778},{\"end\":75792,\"start\":75791},{\"end\":75794,\"start\":75793},{\"end\":76115,\"start\":76114},{\"end\":76121,\"start\":76120},{\"end\":76128,\"start\":76127},{\"end\":76138,\"start\":76137},{\"end\":76463,\"start\":76462},{\"end\":76470,\"start\":76469},{\"end\":76480,\"start\":76479},{\"end\":76867,\"start\":76863},{\"end\":76874,\"start\":76873},{\"end\":76883,\"start\":76882},{\"end\":76895,\"start\":76894},{\"end\":76903,\"start\":76902},{\"end\":76913,\"start\":76912},{\"end\":76924,\"start\":76923},{\"end\":76934,\"start\":76933},{\"end\":76936,\"start\":76935},{\"end\":77280,\"start\":77279},{\"end\":77287,\"start\":77286},{\"end\":77480,\"start\":77479},{\"end\":77488,\"start\":77487},{\"end\":77501,\"start\":77500},{\"end\":77924,\"start\":77923},{\"end\":77933,\"start\":77932},{\"end\":77945,\"start\":77944},{\"end\":77947,\"start\":77946},{\"end\":78284,\"start\":78283},{\"end\":78293,\"start\":78292},{\"end\":78303,\"start\":78302},{\"end\":78650,\"start\":78649},{\"end\":78663,\"start\":78662},{\"end\":78674,\"start\":78673},{\"end\":78682,\"start\":78681},{\"end\":78701,\"start\":78700},{\"end\":79074,\"start\":79073},{\"end\":79086,\"start\":79085},{\"end\":79457,\"start\":79456},{\"end\":79468,\"start\":79467},{\"end\":79477,\"start\":79476},{\"end\":79486,\"start\":79485},{\"end\":79498,\"start\":79497},{\"end\":79508,\"start\":79507},{\"end\":79908,\"start\":79907},{\"end\":79916,\"start\":79915},{\"end\":79929,\"start\":79928},{\"end\":80261,\"start\":80260},{\"end\":80268,\"start\":80267},{\"end\":80279,\"start\":80275},{\"end\":80594,\"start\":80593},{\"end\":80596,\"start\":80595},{\"end\":80620,\"start\":80615},{\"end\":80629,\"start\":80628},{\"end\":80852,\"start\":80851},{\"end\":80854,\"start\":80853},{\"end\":80866,\"start\":80865},{\"end\":80875,\"start\":80874},{\"end\":80887,\"start\":80886},{\"end\":80900,\"start\":80899},{\"end\":80907,\"start\":80906},{\"end\":80909,\"start\":80908},{\"end\":80920,\"start\":80919},{\"end\":80928,\"start\":80927},{\"end\":80939,\"start\":80938},{\"end\":80949,\"start\":80948},{\"end\":81413,\"start\":81412},{\"end\":81415,\"start\":81414},{\"end\":81428,\"start\":81424},{\"end\":81438,\"start\":81434},{\"end\":81447,\"start\":81443},{\"end\":81740,\"start\":81739},{\"end\":81746,\"start\":81745},{\"end\":81754,\"start\":81753},{\"end\":82069,\"start\":82068},{\"end\":82080,\"start\":82079},{\"end\":82093,\"start\":82092},{\"end\":82102,\"start\":82101},{\"end\":82494,\"start\":82493},{\"end\":82505,\"start\":82504},{\"end\":82753,\"start\":82752},{\"end\":82766,\"start\":82765},{\"end\":82778,\"start\":82777},{\"end\":82787,\"start\":82786},{\"end\":82794,\"start\":82793},{\"end\":83180,\"start\":83179},{\"end\":83182,\"start\":83181},{\"end\":83188,\"start\":83187},{\"end\":83194,\"start\":83193},{\"end\":83206,\"start\":83205},{\"end\":83213,\"start\":83212},{\"end\":83220,\"start\":83219},{\"end\":83222,\"start\":83221},{\"end\":83495,\"start\":83494},{\"end\":83502,\"start\":83501},{\"end\":83508,\"start\":83507},{\"end\":83832,\"start\":83831},{\"end\":83846,\"start\":83845},{\"end\":83857,\"start\":83856},{\"end\":83867,\"start\":83866},{\"end\":83878,\"start\":83877},{\"end\":84255,\"start\":84254},{\"end\":84257,\"start\":84256},{\"end\":84268,\"start\":84267},{\"end\":84280,\"start\":84279},{\"end\":84282,\"start\":84281},{\"end\":84292,\"start\":84291},{\"end\":84294,\"start\":84293},{\"end\":84598,\"start\":84597},{\"end\":84607,\"start\":84606},{\"end\":84609,\"start\":84608},{\"end\":84618,\"start\":84617},{\"end\":84630,\"start\":84629},{\"end\":84640,\"start\":84639},{\"end\":84925,\"start\":84924},{\"end\":84934,\"start\":84933},{\"end\":84936,\"start\":84935},{\"end\":84945,\"start\":84944},{\"end\":84957,\"start\":84956},{\"end\":84967,\"start\":84966},{\"end\":85287,\"start\":85286},{\"end\":85298,\"start\":85297},{\"end\":85309,\"start\":85308},{\"end\":85317,\"start\":85316},{\"end\":85326,\"start\":85325},{\"end\":85339,\"start\":85338},{\"end\":85815,\"start\":85814},{\"end\":85830,\"start\":85829},{\"end\":86204,\"start\":86203},{\"end\":86217,\"start\":86216},{\"end\":86706,\"start\":86705},{\"end\":86714,\"start\":86713},{\"end\":86716,\"start\":86715},{\"end\":86731,\"start\":86730},{\"end\":87145,\"start\":87144},{\"end\":87153,\"start\":87152},{\"end\":87431,\"start\":87430},{\"end\":87439,\"start\":87438},{\"end\":87665,\"start\":87664},{\"end\":87673,\"start\":87672},{\"end\":87679,\"start\":87678},{\"end\":87687,\"start\":87686},{\"end\":87689,\"start\":87688},{\"end\":87698,\"start\":87697},{\"end\":87707,\"start\":87706},{\"end\":87945,\"start\":87944},{\"end\":87957,\"start\":87956},{\"end\":87959,\"start\":87958},{\"end\":88309,\"start\":88308},{\"end\":88318,\"start\":88317},{\"end\":88320,\"start\":88319},{\"end\":88831,\"start\":88830},{\"end\":88840,\"start\":88839},{\"end\":88853,\"start\":88852},{\"end\":88863,\"start\":88862},{\"end\":88874,\"start\":88873},{\"end\":89278,\"start\":89277},{\"end\":89284,\"start\":89283},{\"end\":89292,\"start\":89291},{\"end\":89307,\"start\":89306},{\"end\":89559,\"start\":89558},{\"end\":89567,\"start\":89566},{\"end\":89576,\"start\":89575},{\"end\":89586,\"start\":89585},{\"end\":89803,\"start\":89802},{\"end\":89815,\"start\":89814},{\"end\":89825,\"start\":89824},{\"end\":90072,\"start\":90071},{\"end\":90084,\"start\":90083},{\"end\":90091,\"start\":90090},{\"end\":90102,\"start\":90101},{\"end\":90111,\"start\":90110},{\"end\":90119,\"start\":90118},{\"end\":90128,\"start\":90127},{\"end\":90403,\"start\":90402},{\"end\":90415,\"start\":90414},{\"end\":90428,\"start\":90424},{\"end\":90437,\"start\":90436},{\"end\":90444,\"start\":90443},{\"end\":90455,\"start\":90454},{\"end\":90464,\"start\":90463},{\"end\":90475,\"start\":90474},{\"end\":90488,\"start\":90487},{\"end\":90497,\"start\":90496},{\"end\":90857,\"start\":90856},{\"end\":90865,\"start\":90864},{\"end\":90873,\"start\":90872},{\"end\":91269,\"start\":91268},{\"end\":91279,\"start\":91278},{\"end\":91288,\"start\":91287},{\"end\":91298,\"start\":91297},{\"end\":91312,\"start\":91311},{\"end\":91323,\"start\":91322},{\"end\":91516,\"start\":91515},{\"end\":91526,\"start\":91525},{\"end\":91541,\"start\":91540},{\"end\":91543,\"start\":91542},{\"end\":91559,\"start\":91558},{\"end\":91570,\"start\":91569},{\"end\":91572,\"start\":91571},{\"end\":91910,\"start\":91909},{\"end\":91920,\"start\":91919},{\"end\":91922,\"start\":91921},{\"end\":91938,\"start\":91937},{\"end\":91949,\"start\":91948},{\"end\":91951,\"start\":91950},{\"end\":91962,\"start\":91961},{\"end\":92324,\"start\":92323},{\"end\":92330,\"start\":92329},{\"end\":92338,\"start\":92337},{\"end\":92348,\"start\":92347},{\"end\":92354,\"start\":92353},{\"end\":92363,\"start\":92362},{\"end\":92371,\"start\":92370},{\"end\":92844,\"start\":92843},{\"end\":92852,\"start\":92851},{\"end\":92861,\"start\":92860},{\"end\":93178,\"start\":93177},{\"end\":93187,\"start\":93186},{\"end\":93196,\"start\":93195},{\"end\":93606,\"start\":93605},{\"end\":93615,\"start\":93614},{\"end\":93622,\"start\":93621},{\"end\":93624,\"start\":93623},{\"end\":93635,\"start\":93634},{\"end\":94060,\"start\":94059},{\"end\":94073,\"start\":94072},{\"end\":94080,\"start\":94079},{\"end\":94091,\"start\":94090},{\"end\":94097,\"start\":94096},{\"end\":94111,\"start\":94110},{\"end\":94123,\"start\":94122}]", "bib_author_last_name": "[{\"end\":61289,\"start\":61283},{\"end\":61300,\"start\":61293},{\"end\":61314,\"start\":61307},{\"end\":61324,\"start\":61318},{\"end\":61639,\"start\":61633},{\"end\":61646,\"start\":61643},{\"end\":61657,\"start\":61652},{\"end\":61669,\"start\":61661},{\"end\":61913,\"start\":61907},{\"end\":61922,\"start\":61917},{\"end\":61933,\"start\":61928},{\"end\":61942,\"start\":61937},{\"end\":61954,\"start\":61946},{\"end\":61965,\"start\":61958},{\"end\":61977,\"start\":61969},{\"end\":62194,\"start\":62187},{\"end\":62206,\"start\":62198},{\"end\":62213,\"start\":62210},{\"end\":62224,\"start\":62217},{\"end\":62234,\"start\":62228},{\"end\":62452,\"start\":62444},{\"end\":62592,\"start\":62587},{\"end\":62601,\"start\":62596},{\"end\":62612,\"start\":62605},{\"end\":62624,\"start\":62618},{\"end\":62632,\"start\":62628},{\"end\":62645,\"start\":62636},{\"end\":63092,\"start\":63087},{\"end\":63106,\"start\":63096},{\"end\":63116,\"start\":63110},{\"end\":63128,\"start\":63120},{\"end\":63137,\"start\":63132},{\"end\":63143,\"start\":63141},{\"end\":63155,\"start\":63147},{\"end\":63164,\"start\":63159},{\"end\":63172,\"start\":63168},{\"end\":63178,\"start\":63176},{\"end\":63532,\"start\":63528},{\"end\":63546,\"start\":63536},{\"end\":63555,\"start\":63550},{\"end\":63817,\"start\":63808},{\"end\":63825,\"start\":63821},{\"end\":63837,\"start\":63831},{\"end\":63850,\"start\":63841},{\"end\":64165,\"start\":64161},{\"end\":64176,\"start\":64172},{\"end\":64186,\"start\":64180},{\"end\":64458,\"start\":64454},{\"end\":64469,\"start\":64465},{\"end\":64479,\"start\":64473},{\"end\":64489,\"start\":64483},{\"end\":64730,\"start\":64723},{\"end\":64739,\"start\":64734},{\"end\":65234,\"start\":65231},{\"end\":65245,\"start\":65238},{\"end\":65257,\"start\":65249},{\"end\":65266,\"start\":65261},{\"end\":65278,\"start\":65270},{\"end\":65599,\"start\":65596},{\"end\":65607,\"start\":65605},{\"end\":65618,\"start\":65611},{\"end\":65887,\"start\":65882},{\"end\":65897,\"start\":65891},{\"end\":65909,\"start\":65901},{\"end\":66112,\"start\":66106},{\"end\":66120,\"start\":66116},{\"end\":66133,\"start\":66124},{\"end\":66142,\"start\":66137},{\"end\":66153,\"start\":66146},{\"end\":66164,\"start\":66157},{\"end\":66542,\"start\":66534},{\"end\":66552,\"start\":66546},{\"end\":66945,\"start\":66935},{\"end\":66957,\"start\":66949},{\"end\":66971,\"start\":66963},{\"end\":66979,\"start\":66975},{\"end\":66992,\"start\":66983},{\"end\":67239,\"start\":67231},{\"end\":67248,\"start\":67241},{\"end\":67392,\"start\":67380},{\"end\":67410,\"start\":67398},{\"end\":67660,\"start\":67654},{\"end\":67952,\"start\":67942},{\"end\":67962,\"start\":67956},{\"end\":67971,\"start\":67966},{\"end\":67982,\"start\":67975},{\"end\":68418,\"start\":68412},{\"end\":68427,\"start\":68422},{\"end\":68437,\"start\":68431},{\"end\":68800,\"start\":68794},{\"end\":68809,\"start\":68804},{\"end\":68819,\"start\":68813},{\"end\":69096,\"start\":69079},{\"end\":69274,\"start\":69271},{\"end\":69283,\"start\":69278},{\"end\":69653,\"start\":69648},{\"end\":69665,\"start\":69657},{\"end\":69674,\"start\":69669},{\"end\":70125,\"start\":70120},{\"end\":70137,\"start\":70129},{\"end\":70149,\"start\":70141},{\"end\":70158,\"start\":70153},{\"end\":70489,\"start\":70484},{\"end\":70499,\"start\":70493},{\"end\":70511,\"start\":70503},{\"end\":70524,\"start\":70517},{\"end\":70888,\"start\":70883},{\"end\":70897,\"start\":70892},{\"end\":70908,\"start\":70901},{\"end\":71245,\"start\":71242},{\"end\":71256,\"start\":71252},{\"end\":71268,\"start\":71262},{\"end\":71279,\"start\":71275},{\"end\":71288,\"start\":71286},{\"end\":71300,\"start\":71295},{\"end\":71572,\"start\":71565},{\"end\":71585,\"start\":71576},{\"end\":71596,\"start\":71589},{\"end\":71608,\"start\":71600},{\"end\":71622,\"start\":71612},{\"end\":71636,\"start\":71624},{\"end\":71949,\"start\":71942},{\"end\":71955,\"start\":71953},{\"end\":71971,\"start\":71959},{\"end\":72303,\"start\":72296},{\"end\":72313,\"start\":72307},{\"end\":72322,\"start\":72317},{\"end\":72338,\"start\":72326},{\"end\":72346,\"start\":72340},{\"end\":72731,\"start\":72725},{\"end\":72742,\"start\":72735},{\"end\":72749,\"start\":72746},{\"end\":72761,\"start\":72755},{\"end\":72770,\"start\":72765},{\"end\":72780,\"start\":72774},{\"end\":72791,\"start\":72784},{\"end\":73159,\"start\":73153},{\"end\":73173,\"start\":73163},{\"end\":73187,\"start\":73177},{\"end\":73194,\"start\":73191},{\"end\":73202,\"start\":73198},{\"end\":73212,\"start\":73206},{\"end\":73597,\"start\":73591},{\"end\":73613,\"start\":73603},{\"end\":73625,\"start\":73619},{\"end\":73924,\"start\":73916},{\"end\":73934,\"start\":73928},{\"end\":73945,\"start\":73938},{\"end\":74281,\"start\":74275},{\"end\":74291,\"start\":74285},{\"end\":74627,\"start\":74624},{\"end\":74636,\"start\":74631},{\"end\":74648,\"start\":74640},{\"end\":75079,\"start\":75067},{\"end\":75093,\"start\":75083},{\"end\":75106,\"start\":75097},{\"end\":75114,\"start\":75110},{\"end\":75447,\"start\":75440},{\"end\":75456,\"start\":75451},{\"end\":75466,\"start\":75460},{\"end\":75776,\"start\":75766},{\"end\":75789,\"start\":75780},{\"end\":75801,\"start\":75795},{\"end\":76118,\"start\":76116},{\"end\":76125,\"start\":76122},{\"end\":76135,\"start\":76129},{\"end\":76146,\"start\":76139},{\"end\":76467,\"start\":76464},{\"end\":76477,\"start\":76471},{\"end\":76488,\"start\":76481},{\"end\":76871,\"start\":76868},{\"end\":76880,\"start\":76875},{\"end\":76892,\"start\":76884},{\"end\":76900,\"start\":76896},{\"end\":76910,\"start\":76904},{\"end\":76921,\"start\":76914},{\"end\":76931,\"start\":76925},{\"end\":76944,\"start\":76937},{\"end\":77284,\"start\":77281},{\"end\":77292,\"start\":77288},{\"end\":77485,\"start\":77481},{\"end\":77498,\"start\":77489},{\"end\":77509,\"start\":77502},{\"end\":77930,\"start\":77925},{\"end\":77942,\"start\":77934},{\"end\":77953,\"start\":77948},{\"end\":78290,\"start\":78285},{\"end\":78300,\"start\":78294},{\"end\":78308,\"start\":78304},{\"end\":78660,\"start\":78651},{\"end\":78671,\"start\":78664},{\"end\":78679,\"start\":78675},{\"end\":78698,\"start\":78683},{\"end\":78710,\"start\":78702},{\"end\":79083,\"start\":79075},{\"end\":79094,\"start\":79087},{\"end\":79465,\"start\":79458},{\"end\":79474,\"start\":79469},{\"end\":79483,\"start\":79478},{\"end\":79495,\"start\":79487},{\"end\":79505,\"start\":79499},{\"end\":79519,\"start\":79509},{\"end\":79913,\"start\":79909},{\"end\":79926,\"start\":79917},{\"end\":79935,\"start\":79930},{\"end\":80265,\"start\":80262},{\"end\":80273,\"start\":80269},{\"end\":80287,\"start\":80280},{\"end\":80613,\"start\":80597},{\"end\":80626,\"start\":80621},{\"end\":80636,\"start\":80630},{\"end\":80863,\"start\":80855},{\"end\":80872,\"start\":80867},{\"end\":80884,\"start\":80876},{\"end\":80897,\"start\":80888},{\"end\":80904,\"start\":80901},{\"end\":80917,\"start\":80910},{\"end\":80925,\"start\":80921},{\"end\":80936,\"start\":80929},{\"end\":80946,\"start\":80940},{\"end\":80960,\"start\":80950},{\"end\":81422,\"start\":81416},{\"end\":81432,\"start\":81429},{\"end\":81441,\"start\":81439},{\"end\":81453,\"start\":81448},{\"end\":81743,\"start\":81741},{\"end\":81751,\"start\":81747},{\"end\":81761,\"start\":81755},{\"end\":82077,\"start\":82070},{\"end\":82090,\"start\":82081},{\"end\":82099,\"start\":82094},{\"end\":82113,\"start\":82103},{\"end\":82363,\"start\":82354},{\"end\":82502,\"start\":82495},{\"end\":82512,\"start\":82506},{\"end\":82763,\"start\":82754},{\"end\":82775,\"start\":82767},{\"end\":82784,\"start\":82779},{\"end\":82791,\"start\":82788},{\"end\":82803,\"start\":82795},{\"end\":83185,\"start\":83183},{\"end\":83191,\"start\":83189},{\"end\":83203,\"start\":83195},{\"end\":83210,\"start\":83207},{\"end\":83217,\"start\":83214},{\"end\":83229,\"start\":83223},{\"end\":83499,\"start\":83496},{\"end\":83505,\"start\":83503},{\"end\":83512,\"start\":83509},{\"end\":83843,\"start\":83833},{\"end\":83854,\"start\":83847},{\"end\":83864,\"start\":83858},{\"end\":83875,\"start\":83868},{\"end\":83885,\"start\":83879},{\"end\":84265,\"start\":84258},{\"end\":84277,\"start\":84269},{\"end\":84289,\"start\":84283},{\"end\":84302,\"start\":84295},{\"end\":84604,\"start\":84599},{\"end\":84615,\"start\":84610},{\"end\":84627,\"start\":84619},{\"end\":84637,\"start\":84631},{\"end\":84648,\"start\":84641},{\"end\":84931,\"start\":84926},{\"end\":84942,\"start\":84937},{\"end\":84954,\"start\":84946},{\"end\":84964,\"start\":84958},{\"end\":84975,\"start\":84968},{\"end\":85295,\"start\":85288},{\"end\":85306,\"start\":85299},{\"end\":85314,\"start\":85310},{\"end\":85323,\"start\":85318},{\"end\":85336,\"start\":85327},{\"end\":85350,\"start\":85340},{\"end\":85827,\"start\":85816},{\"end\":85836,\"start\":85831},{\"end\":86214,\"start\":86205},{\"end\":86224,\"start\":86218},{\"end\":86711,\"start\":86707},{\"end\":86728,\"start\":86717},{\"end\":86736,\"start\":86732},{\"end\":87150,\"start\":87146},{\"end\":87158,\"start\":87154},{\"end\":87436,\"start\":87432},{\"end\":87444,\"start\":87440},{\"end\":87670,\"start\":87666},{\"end\":87676,\"start\":87674},{\"end\":87684,\"start\":87680},{\"end\":87695,\"start\":87690},{\"end\":87704,\"start\":87699},{\"end\":87718,\"start\":87708},{\"end\":87954,\"start\":87946},{\"end\":87965,\"start\":87960},{\"end\":88315,\"start\":88310},{\"end\":88328,\"start\":88321},{\"end\":88837,\"start\":88832},{\"end\":88850,\"start\":88841},{\"end\":88860,\"start\":88854},{\"end\":88871,\"start\":88864},{\"end\":88882,\"start\":88875},{\"end\":89281,\"start\":89279},{\"end\":89289,\"start\":89285},{\"end\":89304,\"start\":89293},{\"end\":89564,\"start\":89560},{\"end\":89573,\"start\":89568},{\"end\":89583,\"start\":89577},{\"end\":89593,\"start\":89587},{\"end\":89812,\"start\":89804},{\"end\":89822,\"start\":89816},{\"end\":89831,\"start\":89826},{\"end\":90081,\"start\":90073},{\"end\":90088,\"start\":90085},{\"end\":90099,\"start\":90092},{\"end\":90108,\"start\":90103},{\"end\":90116,\"start\":90112},{\"end\":90125,\"start\":90120},{\"end\":90135,\"start\":90129},{\"end\":90412,\"start\":90404},{\"end\":90422,\"start\":90416},{\"end\":90434,\"start\":90429},{\"end\":90441,\"start\":90438},{\"end\":90452,\"start\":90445},{\"end\":90461,\"start\":90456},{\"end\":90472,\"start\":90465},{\"end\":90485,\"start\":90476},{\"end\":90494,\"start\":90489},{\"end\":90502,\"start\":90498},{\"end\":90862,\"start\":90858},{\"end\":90870,\"start\":90866},{\"end\":90879,\"start\":90874},{\"end\":91276,\"start\":91270},{\"end\":91285,\"start\":91280},{\"end\":91295,\"start\":91289},{\"end\":91309,\"start\":91299},{\"end\":91320,\"start\":91313},{\"end\":91332,\"start\":91324},{\"end\":91523,\"start\":91517},{\"end\":91538,\"start\":91527},{\"end\":91556,\"start\":91544},{\"end\":91567,\"start\":91560},{\"end\":91580,\"start\":91573},{\"end\":91917,\"start\":91911},{\"end\":91935,\"start\":91923},{\"end\":91946,\"start\":91939},{\"end\":91959,\"start\":91952},{\"end\":91974,\"start\":91963},{\"end\":92327,\"start\":92325},{\"end\":92335,\"start\":92331},{\"end\":92345,\"start\":92339},{\"end\":92351,\"start\":92349},{\"end\":92360,\"start\":92355},{\"end\":92368,\"start\":92364},{\"end\":92376,\"start\":92372},{\"end\":92849,\"start\":92845},{\"end\":92858,\"start\":92853},{\"end\":92870,\"start\":92862},{\"end\":93184,\"start\":93179},{\"end\":93193,\"start\":93188},{\"end\":93206,\"start\":93197},{\"end\":93612,\"start\":93607},{\"end\":93619,\"start\":93616},{\"end\":93632,\"start\":93625},{\"end\":93643,\"start\":93636},{\"end\":94070,\"start\":94061},{\"end\":94077,\"start\":94074},{\"end\":94088,\"start\":94081},{\"end\":94094,\"start\":94092},{\"end\":94108,\"start\":94098},{\"end\":94120,\"start\":94112},{\"end\":94131,\"start\":94124}]", "bib_entry": "[{\"attributes\":{\"id\":\"b0\",\"matched_paper_id\":15810778},\"end\":61571,\"start\":61214},{\"attributes\":{\"doi\":\"arXiv:1702.01105\",\"id\":\"b1\"},\"end\":61854,\"start\":61573},{\"attributes\":{\"id\":\"b2\",\"matched_paper_id\":9649070},\"end\":62143,\"start\":61856},{\"attributes\":{\"id\":\"b3\",\"matched_paper_id\":13558466},\"end\":62440,\"start\":62145},{\"attributes\":{\"id\":\"b4\"},\"end\":62471,\"start\":62442},{\"attributes\":{\"id\":\"b5\",\"matched_paper_id\":6163234},\"end\":63081,\"start\":62473},{\"attributes\":{\"doi\":\"arXiv:1512.03012\",\"id\":\"b6\"},\"end\":63470,\"start\":63083},{\"attributes\":{\"id\":\"b7\",\"matched_paper_id\":207202577},\"end\":63745,\"start\":63472},{\"attributes\":{\"id\":\"b8\",\"matched_paper_id\":22155964},\"end\":64117,\"start\":63747},{\"attributes\":{\"id\":\"b9\",\"matched_paper_id\":771247},\"end\":64450,\"start\":64119},{\"attributes\":{\"doi\":\"arXiv:1602.02481\",\"id\":\"b10\"},\"end\":64652,\"start\":64452},{\"attributes\":{\"id\":\"b11\",\"matched_paper_id\":12358833},\"end\":65124,\"start\":64654},{\"attributes\":{\"doi\":\"arXiv:1604.01093\",\"id\":\"b12\"},\"end\":65522,\"start\":65126},{\"attributes\":{\"doi\":\"arXiv:1612.00101\",\"id\":\"b13\"},\"end\":65796,\"start\":65524},{\"attributes\":{\"id\":\"b14\"},\"end\":66062,\"start\":65798},{\"attributes\":{\"id\":\"b15\",\"matched_paper_id\":6966507},\"end\":66453,\"start\":66064},{\"attributes\":{\"id\":\"b16\",\"matched_paper_id\":5686768},\"end\":66881,\"start\":66455},{\"attributes\":{\"id\":\"b17\",\"matched_paper_id\":4246903},\"end\":67225,\"start\":66883},{\"attributes\":{\"id\":\"b18\"},\"end\":67333,\"start\":67227},{\"attributes\":{\"id\":\"b19\"},\"end\":67609,\"start\":67335},{\"attributes\":{\"id\":\"b20\",\"matched_paper_id\":18238681},\"end\":67876,\"start\":67611},{\"attributes\":{\"id\":\"b21\",\"matched_paper_id\":10270124},\"end\":68348,\"start\":67878},{\"attributes\":{\"id\":\"b22\",\"matched_paper_id\":598952},\"end\":68753,\"start\":68350},{\"attributes\":{\"id\":\"b23\",\"matched_paper_id\":9407131},\"end\":69018,\"start\":68755},{\"attributes\":{\"id\":\"b24\"},\"end\":69222,\"start\":69020},{\"attributes\":{\"id\":\"b25\",\"matched_paper_id\":8654072},\"end\":69568,\"start\":69224},{\"attributes\":{\"id\":\"b26\",\"matched_paper_id\":12061055},\"end\":70036,\"start\":69570},{\"attributes\":{\"id\":\"b27\",\"matched_paper_id\":13259596},\"end\":70413,\"start\":70038},{\"attributes\":{\"id\":\"b28\",\"matched_paper_id\":206850587},\"end\":70819,\"start\":70415},{\"attributes\":{\"id\":\"b29\",\"matched_paper_id\":1398237},\"end\":71185,\"start\":70821},{\"attributes\":{\"id\":\"b30\",\"matched_paper_id\":11245438},\"end\":71561,\"start\":71187},{\"attributes\":{\"doi\":\"arXiv:1603.08161\",\"id\":\"b31\"},\"end\":71886,\"start\":71563},{\"attributes\":{\"id\":\"b32\",\"matched_paper_id\":8421376},\"end\":72198,\"start\":71888},{\"attributes\":{\"id\":\"b33\",\"matched_paper_id\":4244548},\"end\":72657,\"start\":72200},{\"attributes\":{\"id\":\"b34\",\"matched_paper_id\":5206691},\"end\":73070,\"start\":72659},{\"attributes\":{\"id\":\"b35\",\"matched_paper_id\":10809456},\"end\":73522,\"start\":73072},{\"attributes\":{\"id\":\"b36\",\"matched_paper_id\":5690361},\"end\":73862,\"start\":73524},{\"attributes\":{\"id\":\"b37\",\"matched_paper_id\":1758445},\"end\":74218,\"start\":73864},{\"attributes\":{\"id\":\"b38\",\"matched_paper_id\":10742665},\"end\":74583,\"start\":74220},{\"attributes\":{\"id\":\"b39\",\"matched_paper_id\":5973965},\"end\":74944,\"start\":74585},{\"attributes\":{\"id\":\"b40\",\"matched_paper_id\":1709561},\"end\":75366,\"start\":74946},{\"attributes\":{\"id\":\"b41\",\"matched_paper_id\":17004045},\"end\":75697,\"start\":75368},{\"attributes\":{\"id\":\"b42\",\"matched_paper_id\":195908774},\"end\":76044,\"start\":75699},{\"attributes\":{\"id\":\"b43\",\"matched_paper_id\":3145626},\"end\":76388,\"start\":76046},{\"attributes\":{\"id\":\"b44\",\"matched_paper_id\":7188439},\"end\":76818,\"start\":76390},{\"attributes\":{\"id\":\"b45\",\"matched_paper_id\":14113767},\"end\":77214,\"start\":76820},{\"attributes\":{\"id\":\"b46\",\"matched_paper_id\":4238941},\"end\":77421,\"start\":77216},{\"attributes\":{\"id\":\"b47\",\"matched_paper_id\":1629541},\"end\":77855,\"start\":77423},{\"attributes\":{\"id\":\"b48\"},\"end\":78068,\"start\":77857},{\"attributes\":{\"id\":\"b49\"},\"end\":78238,\"start\":78070},{\"attributes\":{\"id\":\"b50\",\"matched_paper_id\":7643914},\"end\":78570,\"start\":78240},{\"attributes\":{\"id\":\"b51\",\"matched_paper_id\":13498599},\"end\":78995,\"start\":78572},{\"attributes\":{\"id\":\"b52\",\"matched_paper_id\":14620252},\"end\":79395,\"start\":78997},{\"attributes\":{\"id\":\"b53\",\"matched_paper_id\":4497387},\"end\":79792,\"start\":79397},{\"attributes\":{\"id\":\"b54\",\"matched_paper_id\":3353517},\"end\":80204,\"start\":79794},{\"attributes\":{\"id\":\"b55\",\"matched_paper_id\":206789826},\"end\":80531,\"start\":80206},{\"attributes\":{\"id\":\"b56\",\"matched_paper_id\":545361},\"end\":80789,\"start\":80533},{\"attributes\":{\"id\":\"b57\",\"matched_paper_id\":11830123},\"end\":81339,\"start\":80791},{\"attributes\":{\"doi\":\"arXiv:1610.05883\",\"id\":\"b58\"},\"end\":81657,\"start\":81341},{\"attributes\":{\"id\":\"b59\",\"matched_paper_id\":12186966},\"end\":82008,\"start\":81659},{\"attributes\":{\"id\":\"b60\",\"matched_paper_id\":207207064},\"end\":82330,\"start\":82010},{\"attributes\":{\"id\":\"b61\"},\"end\":82416,\"start\":82332},{\"attributes\":{\"id\":\"b62\",\"matched_paper_id\":5574079},\"end\":82689,\"start\":82418},{\"attributes\":{\"id\":\"b63\",\"matched_paper_id\":17366636},\"end\":83108,\"start\":82691},{\"attributes\":{\"doi\":\"arXiv:1604.03265\",\"id\":\"b64\"},\"end\":83443,\"start\":83110},{\"attributes\":{\"id\":\"b65\",\"matched_paper_id\":15174950},\"end\":83773,\"start\":83445},{\"attributes\":{\"id\":\"b66\",\"matched_paper_id\":2078900},\"end\":84191,\"start\":83775},{\"attributes\":{\"id\":\"b67\",\"matched_paper_id\":1900911},\"end\":84542,\"start\":84193},{\"attributes\":{\"id\":\"b68\",\"matched_paper_id\":1618650},\"end\":84862,\"start\":84544},{\"attributes\":{\"id\":\"b69\",\"matched_paper_id\":7509088},\"end\":85205,\"start\":84864},{\"attributes\":{\"id\":\"b70\",\"matched_paper_id\":8632684},\"end\":85758,\"start\":85207},{\"attributes\":{\"id\":\"b71\",\"matched_paper_id\":6183017},\"end\":86142,\"start\":85760},{\"attributes\":{\"id\":\"b72\",\"matched_paper_id\":13993169},\"end\":86647,\"start\":86144},{\"attributes\":{\"id\":\"b73\",\"matched_paper_id\":6242669},\"end\":87086,\"start\":86649},{\"attributes\":{\"id\":\"b74\",\"matched_paper_id\":206685792},\"end\":87360,\"start\":87088},{\"attributes\":{\"doi\":\"arXiv:1511.02300\",\"id\":\"b75\"},\"end\":87609,\"start\":87362},{\"attributes\":{\"doi\":\"arXiv:1611.08974\",\"id\":\"b76\"},\"end\":87910,\"start\":87611},{\"attributes\":{\"id\":\"b77\",\"matched_paper_id\":9394474},\"end\":88206,\"start\":87912},{\"attributes\":{\"id\":\"b78\",\"matched_paper_id\":2333743},\"end\":88774,\"start\":88208},{\"attributes\":{\"id\":\"b79\",\"matched_paper_id\":206942855},\"end\":89192,\"start\":88776},{\"attributes\":{\"id\":\"b80\",\"matched_paper_id\":2407217},\"end\":89473,\"start\":89194},{\"attributes\":{\"id\":\"b81\"},\"end\":89738,\"start\":89475},{\"attributes\":{\"id\":\"b82\",\"matched_paper_id\":9472858},\"end\":90026,\"start\":89740},{\"attributes\":{\"doi\":\"arXiv:1603.05772\",\"id\":\"b83\"},\"end\":90327,\"start\":90028},{\"attributes\":{\"id\":\"b84\",\"matched_paper_id\":9568132},\"end\":90795,\"start\":90329},{\"attributes\":{\"id\":\"b85\",\"matched_paper_id\":14562151},\"end\":91221,\"start\":90797},{\"attributes\":{\"id\":\"b86\"},\"end\":91465,\"start\":91223},{\"attributes\":{\"id\":\"b87\",\"matched_paper_id\":16413702},\"end\":91842,\"start\":91467},{\"attributes\":{\"id\":\"b88\",\"matched_paper_id\":21124365},\"end\":92262,\"start\":91844},{\"attributes\":{\"id\":\"b89\",\"matched_paper_id\":206592833},\"end\":92766,\"start\":92264},{\"attributes\":{\"id\":\"b90\",\"matched_paper_id\":6033252},\"end\":93113,\"start\":92768},{\"attributes\":{\"id\":\"b91\",\"matched_paper_id\":17460556},\"end\":93525,\"start\":93115},{\"attributes\":{\"id\":\"b92\",\"matched_paper_id\":8190353},\"end\":93991,\"start\":93527},{\"attributes\":{\"id\":\"b93\",\"matched_paper_id\":14670870},\"end\":94378,\"start\":93993}]", "bib_title": "[{\"end\":61279,\"start\":61214},{\"end\":61903,\"start\":61856},{\"end\":62181,\"start\":62145},{\"end\":62583,\"start\":62473},{\"end\":63524,\"start\":63472},{\"end\":63804,\"start\":63747},{\"end\":64157,\"start\":64119},{\"end\":64719,\"start\":64654},{\"end\":66102,\"start\":66064},{\"end\":66530,\"start\":66455},{\"end\":66931,\"start\":66883},{\"end\":67374,\"start\":67335},{\"end\":67650,\"start\":67611},{\"end\":67938,\"start\":67878},{\"end\":68406,\"start\":68350},{\"end\":68788,\"start\":68755},{\"end\":69267,\"start\":69224},{\"end\":69644,\"start\":69570},{\"end\":70116,\"start\":70038},{\"end\":70480,\"start\":70415},{\"end\":70879,\"start\":70821},{\"end\":71235,\"start\":71187},{\"end\":71938,\"start\":71888},{\"end\":72292,\"start\":72200},{\"end\":72721,\"start\":72659},{\"end\":73149,\"start\":73072},{\"end\":73587,\"start\":73524},{\"end\":73912,\"start\":73864},{\"end\":74271,\"start\":74220},{\"end\":74620,\"start\":74585},{\"end\":75063,\"start\":74946},{\"end\":75434,\"start\":75368},{\"end\":75762,\"start\":75699},{\"end\":76112,\"start\":76046},{\"end\":76460,\"start\":76390},{\"end\":76861,\"start\":76820},{\"end\":77277,\"start\":77216},{\"end\":77477,\"start\":77423},{\"end\":78281,\"start\":78240},{\"end\":78647,\"start\":78572},{\"end\":79071,\"start\":78997},{\"end\":79454,\"start\":79397},{\"end\":79905,\"start\":79794},{\"end\":80258,\"start\":80206},{\"end\":80591,\"start\":80533},{\"end\":80849,\"start\":80791},{\"end\":81737,\"start\":81659},{\"end\":82066,\"start\":82010},{\"end\":82491,\"start\":82418},{\"end\":82750,\"start\":82691},{\"end\":83492,\"start\":83445},{\"end\":83829,\"start\":83775},{\"end\":84252,\"start\":84193},{\"end\":84595,\"start\":84544},{\"end\":84922,\"start\":84864},{\"end\":85284,\"start\":85207},{\"end\":85812,\"start\":85760},{\"end\":86201,\"start\":86144},{\"end\":86703,\"start\":86649},{\"end\":87142,\"start\":87088},{\"end\":87942,\"start\":87912},{\"end\":88306,\"start\":88208},{\"end\":88828,\"start\":88776},{\"end\":89275,\"start\":89194},{\"end\":89800,\"start\":89740},{\"end\":90400,\"start\":90329},{\"end\":90854,\"start\":90797},{\"end\":91513,\"start\":91467},{\"end\":91907,\"start\":91844},{\"end\":92321,\"start\":92264},{\"end\":92841,\"start\":92768},{\"end\":93175,\"start\":93115},{\"end\":93603,\"start\":93527},{\"end\":94057,\"start\":93993}]", "bib_author": "[{\"end\":61291,\"start\":61281},{\"end\":61302,\"start\":61291},{\"end\":61316,\"start\":61302},{\"end\":61326,\"start\":61316},{\"end\":61641,\"start\":61631},{\"end\":61648,\"start\":61641},{\"end\":61659,\"start\":61648},{\"end\":61671,\"start\":61659},{\"end\":61915,\"start\":61905},{\"end\":61924,\"start\":61915},{\"end\":61935,\"start\":61924},{\"end\":61944,\"start\":61935},{\"end\":61956,\"start\":61944},{\"end\":61967,\"start\":61956},{\"end\":61979,\"start\":61967},{\"end\":62196,\"start\":62183},{\"end\":62208,\"start\":62196},{\"end\":62215,\"start\":62208},{\"end\":62226,\"start\":62215},{\"end\":62236,\"start\":62226},{\"end\":62454,\"start\":62444},{\"end\":62594,\"start\":62585},{\"end\":62603,\"start\":62594},{\"end\":62614,\"start\":62603},{\"end\":62626,\"start\":62614},{\"end\":62634,\"start\":62626},{\"end\":62647,\"start\":62634},{\"end\":63094,\"start\":63083},{\"end\":63108,\"start\":63094},{\"end\":63118,\"start\":63108},{\"end\":63130,\"start\":63118},{\"end\":63139,\"start\":63130},{\"end\":63145,\"start\":63139},{\"end\":63157,\"start\":63145},{\"end\":63166,\"start\":63157},{\"end\":63174,\"start\":63166},{\"end\":63180,\"start\":63174},{\"end\":63534,\"start\":63526},{\"end\":63548,\"start\":63534},{\"end\":63557,\"start\":63548},{\"end\":63819,\"start\":63806},{\"end\":63827,\"start\":63819},{\"end\":63839,\"start\":63827},{\"end\":63852,\"start\":63839},{\"end\":64167,\"start\":64159},{\"end\":64178,\"start\":64167},{\"end\":64188,\"start\":64178},{\"end\":64460,\"start\":64452},{\"end\":64471,\"start\":64460},{\"end\":64481,\"start\":64471},{\"end\":64491,\"start\":64481},{\"end\":64732,\"start\":64721},{\"end\":64741,\"start\":64732},{\"end\":65236,\"start\":65229},{\"end\":65247,\"start\":65236},{\"end\":65259,\"start\":65247},{\"end\":65268,\"start\":65259},{\"end\":65280,\"start\":65268},{\"end\":65601,\"start\":65594},{\"end\":65609,\"start\":65601},{\"end\":65620,\"start\":65609},{\"end\":65889,\"start\":65877},{\"end\":65899,\"start\":65889},{\"end\":65911,\"start\":65899},{\"end\":66114,\"start\":66104},{\"end\":66122,\"start\":66114},{\"end\":66135,\"start\":66122},{\"end\":66144,\"start\":66135},{\"end\":66155,\"start\":66144},{\"end\":66166,\"start\":66155},{\"end\":66544,\"start\":66532},{\"end\":66554,\"start\":66544},{\"end\":66947,\"start\":66933},{\"end\":66959,\"start\":66947},{\"end\":66973,\"start\":66959},{\"end\":66981,\"start\":66973},{\"end\":66994,\"start\":66981},{\"end\":67241,\"start\":67229},{\"end\":67250,\"start\":67241},{\"end\":67394,\"start\":67376},{\"end\":67412,\"start\":67394},{\"end\":67662,\"start\":67652},{\"end\":67954,\"start\":67940},{\"end\":67964,\"start\":67954},{\"end\":67973,\"start\":67964},{\"end\":67984,\"start\":67973},{\"end\":68420,\"start\":68408},{\"end\":68429,\"start\":68420},{\"end\":68439,\"start\":68429},{\"end\":68802,\"start\":68790},{\"end\":68811,\"start\":68802},{\"end\":68821,\"start\":68811},{\"end\":69098,\"start\":69077},{\"end\":69276,\"start\":69269},{\"end\":69285,\"start\":69276},{\"end\":69655,\"start\":69646},{\"end\":69667,\"start\":69655},{\"end\":69676,\"start\":69667},{\"end\":70127,\"start\":70118},{\"end\":70139,\"start\":70127},{\"end\":70151,\"start\":70139},{\"end\":70160,\"start\":70151},{\"end\":70491,\"start\":70482},{\"end\":70501,\"start\":70491},{\"end\":70513,\"start\":70501},{\"end\":70526,\"start\":70513},{\"end\":70890,\"start\":70881},{\"end\":70899,\"start\":70890},{\"end\":70910,\"start\":70899},{\"end\":71247,\"start\":71237},{\"end\":71258,\"start\":71247},{\"end\":71270,\"start\":71258},{\"end\":71281,\"start\":71270},{\"end\":71290,\"start\":71281},{\"end\":71302,\"start\":71290},{\"end\":71574,\"start\":71563},{\"end\":71587,\"start\":71574},{\"end\":71598,\"start\":71587},{\"end\":71610,\"start\":71598},{\"end\":71624,\"start\":71610},{\"end\":71638,\"start\":71624},{\"end\":71951,\"start\":71940},{\"end\":71957,\"start\":71951},{\"end\":71973,\"start\":71957},{\"end\":72305,\"start\":72294},{\"end\":72315,\"start\":72305},{\"end\":72324,\"start\":72315},{\"end\":72340,\"start\":72324},{\"end\":72348,\"start\":72340},{\"end\":72733,\"start\":72723},{\"end\":72744,\"start\":72733},{\"end\":72751,\"start\":72744},{\"end\":72763,\"start\":72751},{\"end\":72772,\"start\":72763},{\"end\":72782,\"start\":72772},{\"end\":72793,\"start\":72782},{\"end\":73161,\"start\":73151},{\"end\":73175,\"start\":73161},{\"end\":73189,\"start\":73175},{\"end\":73196,\"start\":73189},{\"end\":73204,\"start\":73196},{\"end\":73214,\"start\":73204},{\"end\":73599,\"start\":73589},{\"end\":73615,\"start\":73599},{\"end\":73627,\"start\":73615},{\"end\":73926,\"start\":73914},{\"end\":73936,\"start\":73926},{\"end\":73947,\"start\":73936},{\"end\":74283,\"start\":74273},{\"end\":74293,\"start\":74283},{\"end\":74629,\"start\":74622},{\"end\":74638,\"start\":74629},{\"end\":74650,\"start\":74638},{\"end\":75081,\"start\":75065},{\"end\":75095,\"start\":75081},{\"end\":75108,\"start\":75095},{\"end\":75116,\"start\":75108},{\"end\":75449,\"start\":75436},{\"end\":75458,\"start\":75449},{\"end\":75468,\"start\":75458},{\"end\":75778,\"start\":75764},{\"end\":75791,\"start\":75778},{\"end\":75803,\"start\":75791},{\"end\":76120,\"start\":76114},{\"end\":76127,\"start\":76120},{\"end\":76137,\"start\":76127},{\"end\":76148,\"start\":76137},{\"end\":76469,\"start\":76462},{\"end\":76479,\"start\":76469},{\"end\":76490,\"start\":76479},{\"end\":76873,\"start\":76863},{\"end\":76882,\"start\":76873},{\"end\":76894,\"start\":76882},{\"end\":76902,\"start\":76894},{\"end\":76912,\"start\":76902},{\"end\":76923,\"start\":76912},{\"end\":76933,\"start\":76923},{\"end\":76946,\"start\":76933},{\"end\":77286,\"start\":77279},{\"end\":77294,\"start\":77286},{\"end\":77487,\"start\":77479},{\"end\":77500,\"start\":77487},{\"end\":77511,\"start\":77500},{\"end\":77932,\"start\":77923},{\"end\":77944,\"start\":77932},{\"end\":77955,\"start\":77944},{\"end\":78292,\"start\":78283},{\"end\":78302,\"start\":78292},{\"end\":78310,\"start\":78302},{\"end\":78662,\"start\":78649},{\"end\":78673,\"start\":78662},{\"end\":78681,\"start\":78673},{\"end\":78700,\"start\":78681},{\"end\":78712,\"start\":78700},{\"end\":79085,\"start\":79073},{\"end\":79096,\"start\":79085},{\"end\":79467,\"start\":79456},{\"end\":79476,\"start\":79467},{\"end\":79485,\"start\":79476},{\"end\":79497,\"start\":79485},{\"end\":79507,\"start\":79497},{\"end\":79521,\"start\":79507},{\"end\":79915,\"start\":79907},{\"end\":79928,\"start\":79915},{\"end\":79937,\"start\":79928},{\"end\":80267,\"start\":80260},{\"end\":80275,\"start\":80267},{\"end\":80289,\"start\":80275},{\"end\":80615,\"start\":80593},{\"end\":80628,\"start\":80615},{\"end\":80638,\"start\":80628},{\"end\":80865,\"start\":80851},{\"end\":80874,\"start\":80865},{\"end\":80886,\"start\":80874},{\"end\":80899,\"start\":80886},{\"end\":80906,\"start\":80899},{\"end\":80919,\"start\":80906},{\"end\":80927,\"start\":80919},{\"end\":80938,\"start\":80927},{\"end\":80948,\"start\":80938},{\"end\":80962,\"start\":80948},{\"end\":81424,\"start\":81412},{\"end\":81434,\"start\":81424},{\"end\":81443,\"start\":81434},{\"end\":81455,\"start\":81443},{\"end\":81745,\"start\":81739},{\"end\":81753,\"start\":81745},{\"end\":81763,\"start\":81753},{\"end\":82079,\"start\":82068},{\"end\":82092,\"start\":82079},{\"end\":82101,\"start\":82092},{\"end\":82115,\"start\":82101},{\"end\":82365,\"start\":82354},{\"end\":82504,\"start\":82493},{\"end\":82514,\"start\":82504},{\"end\":82765,\"start\":82752},{\"end\":82777,\"start\":82765},{\"end\":82786,\"start\":82777},{\"end\":82793,\"start\":82786},{\"end\":82805,\"start\":82793},{\"end\":83187,\"start\":83179},{\"end\":83193,\"start\":83187},{\"end\":83205,\"start\":83193},{\"end\":83212,\"start\":83205},{\"end\":83219,\"start\":83212},{\"end\":83231,\"start\":83219},{\"end\":83501,\"start\":83494},{\"end\":83507,\"start\":83501},{\"end\":83514,\"start\":83507},{\"end\":83845,\"start\":83831},{\"end\":83856,\"start\":83845},{\"end\":83866,\"start\":83856},{\"end\":83877,\"start\":83866},{\"end\":83887,\"start\":83877},{\"end\":84267,\"start\":84254},{\"end\":84279,\"start\":84267},{\"end\":84291,\"start\":84279},{\"end\":84304,\"start\":84291},{\"end\":84606,\"start\":84597},{\"end\":84617,\"start\":84606},{\"end\":84629,\"start\":84617},{\"end\":84639,\"start\":84629},{\"end\":84650,\"start\":84639},{\"end\":84933,\"start\":84924},{\"end\":84944,\"start\":84933},{\"end\":84956,\"start\":84944},{\"end\":84966,\"start\":84956},{\"end\":84977,\"start\":84966},{\"end\":85297,\"start\":85286},{\"end\":85308,\"start\":85297},{\"end\":85316,\"start\":85308},{\"end\":85325,\"start\":85316},{\"end\":85338,\"start\":85325},{\"end\":85352,\"start\":85338},{\"end\":85829,\"start\":85814},{\"end\":85838,\"start\":85829},{\"end\":86216,\"start\":86203},{\"end\":86226,\"start\":86216},{\"end\":86713,\"start\":86705},{\"end\":86730,\"start\":86713},{\"end\":86738,\"start\":86730},{\"end\":87152,\"start\":87144},{\"end\":87160,\"start\":87152},{\"end\":87438,\"start\":87430},{\"end\":87446,\"start\":87438},{\"end\":87672,\"start\":87664},{\"end\":87678,\"start\":87672},{\"end\":87686,\"start\":87678},{\"end\":87697,\"start\":87686},{\"end\":87706,\"start\":87697},{\"end\":87720,\"start\":87706},{\"end\":87956,\"start\":87944},{\"end\":87967,\"start\":87956},{\"end\":88317,\"start\":88308},{\"end\":88330,\"start\":88317},{\"end\":88839,\"start\":88830},{\"end\":88852,\"start\":88839},{\"end\":88862,\"start\":88852},{\"end\":88873,\"start\":88862},{\"end\":88884,\"start\":88873},{\"end\":89283,\"start\":89277},{\"end\":89291,\"start\":89283},{\"end\":89306,\"start\":89291},{\"end\":89310,\"start\":89306},{\"end\":89566,\"start\":89558},{\"end\":89575,\"start\":89566},{\"end\":89585,\"start\":89575},{\"end\":89595,\"start\":89585},{\"end\":89814,\"start\":89802},{\"end\":89824,\"start\":89814},{\"end\":89833,\"start\":89824},{\"end\":90083,\"start\":90071},{\"end\":90090,\"start\":90083},{\"end\":90101,\"start\":90090},{\"end\":90110,\"start\":90101},{\"end\":90118,\"start\":90110},{\"end\":90127,\"start\":90118},{\"end\":90137,\"start\":90127},{\"end\":90414,\"start\":90402},{\"end\":90424,\"start\":90414},{\"end\":90436,\"start\":90424},{\"end\":90443,\"start\":90436},{\"end\":90454,\"start\":90443},{\"end\":90463,\"start\":90454},{\"end\":90474,\"start\":90463},{\"end\":90487,\"start\":90474},{\"end\":90496,\"start\":90487},{\"end\":90504,\"start\":90496},{\"end\":90864,\"start\":90856},{\"end\":90872,\"start\":90864},{\"end\":90881,\"start\":90872},{\"end\":91278,\"start\":91268},{\"end\":91287,\"start\":91278},{\"end\":91297,\"start\":91287},{\"end\":91311,\"start\":91297},{\"end\":91322,\"start\":91311},{\"end\":91334,\"start\":91322},{\"end\":91525,\"start\":91515},{\"end\":91540,\"start\":91525},{\"end\":91558,\"start\":91540},{\"end\":91569,\"start\":91558},{\"end\":91582,\"start\":91569},{\"end\":91919,\"start\":91909},{\"end\":91937,\"start\":91919},{\"end\":91948,\"start\":91937},{\"end\":91961,\"start\":91948},{\"end\":91976,\"start\":91961},{\"end\":92329,\"start\":92323},{\"end\":92337,\"start\":92329},{\"end\":92347,\"start\":92337},{\"end\":92353,\"start\":92347},{\"end\":92362,\"start\":92353},{\"end\":92370,\"start\":92362},{\"end\":92378,\"start\":92370},{\"end\":92851,\"start\":92843},{\"end\":92860,\"start\":92851},{\"end\":92872,\"start\":92860},{\"end\":93186,\"start\":93177},{\"end\":93195,\"start\":93186},{\"end\":93208,\"start\":93195},{\"end\":93614,\"start\":93605},{\"end\":93621,\"start\":93614},{\"end\":93634,\"start\":93621},{\"end\":93645,\"start\":93634},{\"end\":94072,\"start\":94059},{\"end\":94079,\"start\":94072},{\"end\":94090,\"start\":94079},{\"end\":94096,\"start\":94090},{\"end\":94110,\"start\":94096},{\"end\":94122,\"start\":94110},{\"end\":94133,\"start\":94122}]", "bib_venue": "[{\"end\":62788,\"start\":62726},{\"end\":64906,\"start\":64832},{\"end\":68119,\"start\":68060},{\"end\":68560,\"start\":68508},{\"end\":69406,\"start\":69354},{\"end\":69817,\"start\":69755},{\"end\":74771,\"start\":74719},{\"end\":76611,\"start\":76559},{\"end\":77652,\"start\":77590},{\"end\":85493,\"start\":85431},{\"end\":85959,\"start\":85907},{\"end\":86431,\"start\":86337},{\"end\":86879,\"start\":86817},{\"end\":88509,\"start\":88428},{\"end\":89326,\"start\":89322},{\"end\":91022,\"start\":90960},{\"end\":91659,\"start\":91619},{\"end\":92519,\"start\":92457},{\"end\":93329,\"start\":93277},{\"end\":93766,\"start\":93714},{\"end\":61364,\"start\":61326},{\"end\":61629,\"start\":61573},{\"end\":61983,\"start\":61979},{\"end\":62274,\"start\":62236},{\"end\":62724,\"start\":62647},{\"end\":63235,\"start\":63196},{\"end\":63591,\"start\":63557},{\"end\":63908,\"start\":63852},{\"end\":64258,\"start\":64188},{\"end\":64538,\"start\":64507},{\"end\":64830,\"start\":64741},{\"end\":65227,\"start\":65126},{\"end\":65592,\"start\":65524},{\"end\":65875,\"start\":65798},{\"end\":66235,\"start\":66166},{\"end\":66650,\"start\":66554},{\"end\":67034,\"start\":66994},{\"end\":67452,\"start\":67412},{\"end\":67735,\"start\":67662},{\"end\":68058,\"start\":67984},{\"end\":68506,\"start\":68439},{\"end\":68859,\"start\":68821},{\"end\":69075,\"start\":69020},{\"end\":69352,\"start\":69285},{\"end\":69753,\"start\":69676},{\"end\":70198,\"start\":70160},{\"end\":70594,\"start\":70526},{\"end\":70981,\"start\":70910},{\"end\":71345,\"start\":71302},{\"end\":71699,\"start\":71654},{\"end\":72021,\"start\":71973},{\"end\":72410,\"start\":72348},{\"end\":72835,\"start\":72793},{\"end\":73270,\"start\":73214},{\"end\":73665,\"start\":73627},{\"end\":74016,\"start\":73947},{\"end\":74375,\"start\":74293},{\"end\":74717,\"start\":74650},{\"end\":75145,\"start\":75116},{\"end\":75514,\"start\":75468},{\"end\":75852,\"start\":75803},{\"end\":76171,\"start\":76148},{\"end\":76557,\"start\":76490},{\"end\":76984,\"start\":76946},{\"end\":77299,\"start\":77294},{\"end\":77588,\"start\":77511},{\"end\":77921,\"start\":77857},{\"end\":78137,\"start\":78070},{\"end\":78382,\"start\":78310},{\"end\":78735,\"start\":78712},{\"end\":79176,\"start\":79096},{\"end\":79576,\"start\":79521},{\"end\":79977,\"start\":79937},{\"end\":80348,\"start\":80289},{\"end\":80642,\"start\":80638},{\"end\":80998,\"start\":80962},{\"end\":81410,\"start\":81341},{\"end\":81805,\"start\":81763},{\"end\":82149,\"start\":82115},{\"end\":82352,\"start\":82332},{\"end\":82544,\"start\":82514},{\"end\":82872,\"start\":82805},{\"end\":83177,\"start\":83110},{\"end\":83585,\"start\":83514},{\"end\":83959,\"start\":83887},{\"end\":84344,\"start\":84304},{\"end\":84684,\"start\":84650},{\"end\":85011,\"start\":84977},{\"end\":85429,\"start\":85352},{\"end\":85905,\"start\":85838},{\"end\":86335,\"start\":86226},{\"end\":86815,\"start\":86738},{\"end\":87198,\"start\":87160},{\"end\":87428,\"start\":87362},{\"end\":87662,\"start\":87611},{\"end\":88034,\"start\":87967},{\"end\":88426,\"start\":88330},{\"end\":88956,\"start\":88884},{\"end\":89320,\"start\":89310},{\"end\":89556,\"start\":89475},{\"end\":89862,\"start\":89833},{\"end\":90069,\"start\":90028},{\"end\":90538,\"start\":90504},{\"end\":90958,\"start\":90881},{\"end\":91266,\"start\":91223},{\"end\":91617,\"start\":91582},{\"end\":92022,\"start\":91976},{\"end\":92455,\"start\":92378},{\"end\":92894,\"start\":92872},{\"end\":93275,\"start\":93208},{\"end\":93712,\"start\":93645},{\"end\":94167,\"start\":94133}]"}}}, "year": 2023, "month": 12, "day": 17}