{"id": 7906648, "updated": "2023-11-08 02:30:41.575", "metadata": {"title": "DNA-inspired online behavioral modeling and its application to spambot detection", "authors": "[{\"first\":\"Stefano\",\"last\":\"Cresci\",\"middle\":[]},{\"first\":\"Roberto\",\"last\":\"Pietro\",\"middle\":[\"Di\"]},{\"first\":\"Marinella\",\"last\":\"Petrocchi\",\"middle\":[]},{\"first\":\"Angelo\",\"last\":\"Spognardi\",\"middle\":[]},{\"first\":\"Maurizio\",\"last\":\"Tesconi\",\"middle\":[]}]", "venue": "IEEE Intell. Syst.", "journal": "IEEE Intell. Syst.", "publication_date": {"year": 2016, "month": 1, "day": 30}, "abstract": "We propose a strikingly novel, simple, and effective approach to model online user behavior: we extract and analyze digital DNA sequences from user online actions and we use Twitter as a benchmark to test our proposal. We obtain an incisive and compact DNA-inspired characterization of user actions. Then, we apply standard DNA analysis techniques to discriminate between genuine and spambot accounts on Twitter. An experimental campaign supports our proposal, showing its effectiveness and viability. To the best of our knowledge, we are the first ones to identify and adapt DNA-inspired techniques to online user behavioral modeling. While Twitter spambot detection is a specific use case on a specific social media, our proposed methodology is platform and technology agnostic, hence paving the way for diverse behavioral characterization tasks.", "fields_of_study": "[\"Computer Science\"]", "external_ids": {"arxiv": "1602.00110", "mag": "2963342853", "acl": null, "pubmed": null, "pubmedcentral": null, "dblp": "journals/corr/CresciPPST16", "doi": "10.1109/mis.2016.29"}}, "content": {"source": {"pdf_hash": "1410b30ae1ac289ef8ae8297acb55551be3be075", "pdf_src": "Arxiv", "pdf_uri": "[\"https://arxiv.org/pdf/1602.00110v1.pdf\"]", "oa_url_match": true, "oa_info": {"license": null, "open_access_url": "http://arxiv.org/pdf/1602.00110", "status": "GREEN"}}, "grobid": {"id": "ec6fc7074fe7b5632841bf1818b1b9faafc27522", "type": "plain-text", "url": "s3://ai2-s2-pdf-extraction-prod/parse-results/s2orc_worker/1410b30ae1ac289ef8ae8297acb55551be3be075.txt", "contents": "\nIEEE INTELLIGENT SYSTEMS 1 DNA-inspired online behavioral modeling and its application to spambot detection\n30 Jan 2016\n\nStefano Cresci \nRoberto Di \nPietro \nMarinella Petrocchi \nAngelo Spognardi \nMaurizio Tesconi \n\nof Informatics and Telematics\nIIT-CNR\nItaly. R\n\n\nDi Pietro is with Bell Labs\nNokia, Paris-France\n\n\nMaths Dept\nInstitute of Informatics and Telematics\nUniversity of Padua\nItaly\n\n\nIIT-CNR\nItaly. A\n\n\nInstitute of Informatics and Telematics\nSpognardi is with DTU Compute\nTechnical University of Denmark\nDenmark\n\n\nIIT-CNR\nItaly\n\nIEEE INTELLIGENT SYSTEMS 1 DNA-inspired online behavioral modeling and its application to spambot detection\n30 Jan 2016\nWe propose a strikingly novel, simple, and effective approach to model online user behavior: we extract and analyze digital DNA sequences from user online actions and we use Twitter as a benchmark to test our proposal. We obtain an incisive and compact DNA-inspired characterization of user actions. Then, we apply standard DNA analysis techniques to discriminate between genuine and spambot accounts on Twitter. An experimental campaign supports our proposal, showing its effectiveness and viability. To the best of our knowledge, we are the first ones to identify and adapt DNA-inspired techniques to online user behavioral modeling. While Twitter spambot detection is a specific use case on a specific social media, our proposed methodology is platform and technology agnostic, hence paving the way for diverse behavioral characterization tasks.\n\nI. ONLINE INTERACTIONS: THE MIRROR OF THE SOUL\n\nSocial media provide internet users with the opportunity to interact for a myriads of goals, which range from planning social events to engaging in commercial transactions.\n\nModeling and analyzing online user behaviors deserves attention for a variety of reasons. One is to mine substantial information regarding events of public interest [1]. In addition, linking behaviors to a ground truth in the past leads to predict what will likely happen in the future when similar behaviors take place [2]. Furthermore, online behavioral analysis helps in detecting fictitious and deceitful accounts that may distribute spam or lead to a bias in the public opinion [3].\n\nCurrent research on online behaviors exploits different techniques, relying, e.g., on social and interaction graphs [4], [5], textual content [1], [6], and other complex data representations [2]. The definition of a unifying approach is an open challenge. Thus, we introduce the novel notion of digital DNA sequences to characterize online user behaviors on social media. We believe that the high flexibility that is a feature of digital DNA sequences, makes this original modeling technique well suited for different scenarios, with the potential to open up new directions for research. By drawing a parallel with biological DNA, it also opens up the possibility to draw upon decades of research and development in bioinformatics.\n\nS. Cresci, M. Petrocchi, and M. Tesconi are is with the Institute of Informatics and Telematics, IIT-CNR, Italy.\n\nR. Di Pietro is with Bell Labs, Nokia, Paris-France; University of Padua, Maths Dept., Italy; and the Institute of Informatics and Telematics, IIT-CNR, Italy.\n\nA. Spognardi is with DTU Compute, Technical University of Denmark, Denmark; and the Institute of Informatics and Telematics, IIT-CNR, Italy.\n\nWe envisage digital DNA sequences to embrace different applications, among which:\n\n• letting behavioral patterns emerge from the crowd [2], [5], by making use of standard DNA sequence alignment tools. This automated approach has the reassuring outcome of avoiding the often frustrating intervention of humans, who may not have the means to discriminate patterns by simply inspecting them on an \"account-byaccount\" basis; • defining a behavioral-based taxonomy of online interactions. For social media, this might mean classifying users as compulsive, curious, lazy, inactive. Such information could then be exploited to launch ad-hoc marketing campaigns and to convey specific messages to those accounts that are more likely to accept such suggestions.\n\n\nII. CONCEPT AND INSTANCES OF DIGITAL DNA\n\n\nA. Biological DNA\n\nThe human genome is the complete set of genetic information on humans (Homo sapiens), encoded as nucleic acid (DNA) sequences. DNA sequences are successions of characters (i.e., strings), indicating the order of nucleotides within DNA molecules. The possible characters are A, C, G, and T, representing the four nucleotide bases of a DNA strand: adenine, cytosine, guanine, thymine. Biological DNA stores the information directing functions and characteristics of a living organism. DNA sequences are analyzed by means of bioinformatics techniques. Sequence alignment and motif elicitation are among the most well-known analysis techniques to find sequence commonalities and repetitions. Via an analysis of common sub-sequences, it is possible to predict specific characteristics of the individual and to uncover relationships between different individuals.\n\n\nB. Digital DNA as a proxy of user online behavior\n\nInspired by biological DNA, we propose to model online user behaviors with strings of characters representing the sequence of a user's online actions. Each action type (e.g., posting new content, following or replying to a user) can be encoded with a different character, similarly to DNA sequences, where characters encode nucleotide bases. According to this paradigm, online user actions represent the bases of their digital DNA.\n\nDifferent kinds of user behaviors can be observed on the Internet [6] and digital DNA is a flexible and compact way of modeling such behaviors. Its flexibility lies in the possibility arXiv:1602.00110v1 [cs.SI] 30 Jan 2016 to choose which actions will form the sequence. For example, digital DNA sequences on Facebook could include a different base for each user-to-user interaction type: comments (C), likes (L), shares (S) and mentions (M). Then, interactions are encoded as strings formed by such characters, according to the sequence of actions users perform. Similarly, user-to-item interactions on an e-commerce platform could be modeled using a base for every product category. User purchasing behaviors could be encoded as a sequence of characters, according to the category of products they buy. To this regard, digital DNA shows a major difference to biological DNA, where the four nucleotide bases are fixed. In digital DNA, both the number and the meaning of the bases can change according to the behavior/interaction to be modeled. Similarly to its biological predecessor, digital DNA is a compact representation of information. For example, the timeline of a Twitter user could be encoded as a single string of 3,200 characters (one character per tweet). There is a vast number of algorithms and techniques to draw upon for the analysis of digital DNA sequences. Indeed, many of the techniques developed in the field of bioinformatics for the analysis of biological DNA can be carried over to study the characteristics of digital DNA as well.\n\nIn the following, we show the usefulness of our approach with a possible application to the detection of Twitter spambots, namely computer programs that control social accounts with the goal to mimic real users and send these users unsolicited messages [6]. Starting from two Twitter datasets where genuine and spambot accounts are a priori known, we leverage DNA sequence characterization to let recurrent patterns emerge. We show how groups of spambots share common patterns, as opposed to groups of genuine accounts. As a concrete application of this outcome, we demonstrate how to apply the methodology to tell apart spambots from genuine accounts, within an unknown set of accounts.\n\n\nIII. INTRODUCING DIGITAL DNA FINGERPRINTING\n\nBiological DNA fingerprinting is a technique employed by forensic scientists to identify suspects from their DNA. Similarly to forensic analysis, we describe a digital DNA fingerprinting technique for spambots detection on social media. While this is just one of the possible applications for digital DNA, it contributes to understand how our methodology can help in practice.\n\nAcademics and platform administrators are constantly struggling to keep pace with evolving spambots. New waves of malicious accounts present different and advanced features, making their detection with existing systems extremely challenging [4], [6]. This is the case with the new family of spambots that emerged on Twitter during the last Mayoral election in Rome, 2014. One of the runners-up made use of almost 1,000 automated accounts for his electoral campaign in order to pubblicize his policies. Surprisingly, these automated accounts were extremely hard to distinguish from genuine ones. Each profile contained detailed personal information and had thousands of genuine followers and friends. Furthermore, they showed a tweeting behavior apparently similar to that of genuine accounts, with a few tweets posted every day -mainly quotes from popular people. However, every time the political candidate posted a new tweet from his official account, all the spambots retweeted it in a time span of just a few minutes. Thus, the candidate was able to reach many more accounts than his own direct followers and managed to alter Twitter engagement metrics during the electoral campaign. We found similar phenomena to be widespread also outside Italy. Specifically, here we consider two groups of social spambots: (i) bot retweeters of the Italian candidate (Bot1), and (ii) bot accounts spamming URLs pointing to several products on sale on the Amazon.com e-commerce platform (Bot2).\n\nIn contrast with classification and supervised approaches, we devise an unsupervised way to detect spambots, by comparing their behavior with the aim of finding similarities between automated accounts. We model the behavior of the two groups of spambots via their digital DNA and we compare it to that of a sample of genuine accounts. We exploit digital DNA to study the behavior of groups of users following the intuition that, because of their automated nature, spambots are likely to present higher similarities in their digital DNA with respect to the more heterogeneous genuine users.\n\n\nA. Mining groups of digital DNA sequences\n\nThe basic assumption of the digital DNA fingerprinting technique is to consider behaviors as sequences of actions and to characterize and detect social spambots by grouping similar sequences. Our approach thus falls within the broad field of sequential data mining, yet it presents differences from the tasks commonly performed when working with sequential data. Sequences are ordered lists of symbols from an alphabet B, namely s = {s 1 , s 2 , . . . , s n }, with s i ∈ B and are used in information retrieval, part-of-speech tagging, genomics, timeseries analysis -to name but a few. Tasks commonly performed with such sequences are those of sequential supervised learning, time-series prediction, sequence classification. For instance, in sequential supervised learning, given a sequence s = {s 1 , s 2 , . . . , s n }, the goal is to find a sequence of labels l = {l 1 , l 2 , . . . , l n }, where each label is associated to an element of the original sequence. Well-known techniques to perform this task are conditional random fields and hidden Markov models. Instead, in time series prediction, the goal is to find the element s t+1 , given a starting sequence s = {s 1 , s 2 , . . . , s t }. For instance, this goal could be achieved by employing a model taken from the broad family of statistical (auto-)regressive techniques. Finally, sequence classification is concerned with assigning a single label l to a whole sequence s = {s 1 , s 2 , . . . , s n }, following a supervised approach. Instead, here our goal is to analyze a set of unlabeled sequences, in order to find commonalities and differences between them, by exploiting the sequential information related to user actions, which is captured within digital DNA sequences. To this regard, our task resembles that of unsupervised sequence clustering. However, it further differs from traditional machine learning clustering since we exploit sequential data. Indeed, our sequences are ordered data representations, while feature vectors exploited in traditional clustering are unordered (i.e., features are not ordered in feature vectors and the ordering is not exploited in the analysis). Moreover, our sequences are variable-length vectors of symbols drawn from a limited alphabet (i.e., strings), rather than fixed-length numeric vectors. Thus, traditional distance/similarity metrics for numeric vectors (such as those typically used in clustering) are not applicable in our case. Working with ordered and variablelength data representations also marks a difference with other techniques recently employed for the behavioral analysis of groups of users, such as those based on hashing [7] and graph mining [5].\n\n\nIV. DIGITAL DNA FINGERPRINTING FOR SPAMBOT DETECTION\n\n\nA. Characterizing spambot behavior\n\nThe process of digital DNA fingerprinting has four main steps: (i) acquisition of behavioral data; (ii) extraction of DNA sequences; (iii) comparison of DNA sequences; (iv) evaluation.\n\nIn order to perform a rigorous evaluation of our detection technique, we created datasets of verified spambots and genuine Twitter accounts. All the accounts of our datasets have undergone manual verification. Specifically, 50.05% (991 accounts) of Bot1 accounts and 89.29% (464 accounts) of Bot2 accounts were certified as spambots. Then, we built a dataset of human accounts by randomly contacting Twitter users and by asking them simple questions in natural language. All the 3,474 accounts that answered were certified as human. For all the 4,929 accounts of our datasets we then collected behavioral data, by crawling the content of their Twitter timelines.\n\nThe second step is the extraction of the digital DNA of the accounts -that is, associating each account to a string that encodes its behavioral information. Digital DNA sequences can be extracted in different ways, according to the kind of information to be modeled. Similarly to feature engineering in machine learning, catching the right granularity for modeling behaviors might lead to better detection results. For the sake of experimentation, we modeled the accounts' behavior in two ways and we evaluated which one better captures the nature of automated accounts. In the first experiment, we considered the types of tweets shared (tweet type DNA). Every tweet in the account's timeline is encoded with a different character: A for a simple tweet, T for a reply and C for a retweet. In the second experiment, we considered the content of tweets (tweet content DNA). We designed the base A for tweets with URLs, T for tweets with hashtags, C for tweets with mentions, G for tweets with media (pictures, videos), X for tweets with a combination of the previous entities, and N for tweets with none of them (plain-text). Since each Twitter timeline is made up of at most 3,200 tweets, we obtained digital DNA sequences counting up to 3,200 characters.\n\nAs a third step, we study similarities among the DNA of our accounts. We consider similarity as a proxy for automation and, thus, an exceptionally high level of similarity among a large group of accounts serves as a red flag for anomalous behaviors. We quantify similarity by looking at the Longest Common Substring (LCS) among digital DNA sequences. We rely on a linear time algorithm [10] that is based on the generalized suffix tree. Given m strings, the algorithm is able to find, for all 2 ≤ k ≤ m, the longest substring in common to at least k strings. Then, given m DNA sequences and the length of the longest substring common to k of them, we can derive which accounts have such longest substring in common (i.e., which are those k accounts). As the number k of accounts grows, the length of the longest substring common to all of them (LCS) shortens. Thus, it is likely to find a long LCS among a few accounts rather than among large groups. Thus, the rationale behind our analysis is that if the LCS is long when k grows, then the accounts that share that LCS have a suspiciously similar behavior.\n\nTo verify our claim, we computed the LCS in the datasets of certified spambots and genuine accounts for every k. To be statistically sound, we compared groups of the same size by randomly undersampling genuine accounts to match the number of spambots. Figures 1(a) and 1(b) show results of the comparison of tweet type DNA sequences, while figures 1(c) and 1(d) show the results for tweet content DNA sequences. All plots of Figure 1 show the length of LCS for all the possible group sizes: for example, in Figure 1(a) there exists a group of 400 accounts in Bot1 with a substring of length 774 in common. From figures 1(a) and 1(b) it is clear that the LCS of both the groups of spambots are rather long even when the number of accounts grows. This is strikingly evident for Bot2 (spammers of Amazon.com products), see Figure 1(b). In contrast, genuine accounts show little to no similarity. For both the spambot groups we observe a sudden drop in LCS length when k gets close to the group size. Instead, the human group has an exponential decay and it rapidly reaches the smallest values of the LCS length. Figures 1(c) and 1(d) are related to tweet content DNA sequences and results are noticeably different from those obtained with tweet type DNA. All the LCS curves have much lower values, however the biggest difference between tweet content DNA and tweet type DNA is shown for Bot2. While tweet type DNA models almost perfectly the high similarity of Bot2 accounts, tweet content DNA is unable to show a significative difference between genuine and bot accounts. These results suggest that modeling the behavior of Twitter accounts according to the type of tweets, rather than to their content, is more effective for discriminating Bot2 spambots.\n\n\nB. Uncovering novel Twitter spambots\n\nAs shown before, properly extracted digital DNA sequences provide evidence of similar activities in large groups. In turn, this can lead to suspect a high degree of automation for those accounts behaving in a similar way. Building on the promising results obtained with tweet type DNA, in the following we exploit the characteristics of LCS curves to effectively detect groups of Twitter spambots. Our detection technique can be applied to a group of unlabeled accounts to check whether accounts with a suspiciously similar behavior are present. In a group with mixed bot and genuine accounts, almost only bot accounts will have long DNA substrings in common. Thus, by (a) Tweet type DNA similarity between retweeters of the political candidate and genuine accounts.\n\n(b) Tweet type DNA similarity between spammers of Amazon.com products and genuine accounts.\n\n(c) Tweet content DNA similarity between retweeters of the political candidate and genuine accounts.\n\n(d) Tweet content DNA similarity between spammers of Amazon.com products and genuine accounts. identifying the group of accounts that share a long LCS, we can obtain a set of suspicious accounts.\n\nHenceforth, Test-set1 and Test-set2 refer to unlabeled groups where genuine accounts have been mixed with the ones from Bot1 and Bot2 respectively.\n\nThe plots in figures 2(a) and 2(b) show the length of LCS for all the possible values of k accounts in Test-set1 and Test-set2. In these plots, we looked for the points where the LCS curves exhibit a sudden drop to very low values, since those points might represent thresholds between groups of similar accounts. Observing Figure 2(a), we can see that there is a continuous decrease in the LCS length as the number of accounts grows, and a sudden drop occurs just before reaching the 1,000 accounts. The drop is even more evident in Figure 2(b) where there is a steep fall of the curve just before 400 accounts. LCS curves in both plots keep approaching to 1 as the number of accounts grows. The steep drops of LCS curves highlight areas where the length of the LCS remains practically unchanged even for significantly different numbers of accounts considered. In fact, such plateaux in LCS curves are strictly related to homogeneous groups of highly similar accounts. Note that it is possible to observe multiple plateaux in a single LCS curve, as in the case of Figure 2(a). This represents a situation where multiple (sub-)groups exist among the whole set of considered accounts. Furthermore, the steeper and the more pronounced the drop in the LCS curve, the more different are the two groups of accounts split by that drop.\n\nBuilding on these interesting characteristics, we devised a methodology to exploit drops in LCS curves in order to identify groups of similar accounts. Specifically, we exploit the derivative of LCS curves ∆ LCS ∆ accounts to highlight the points corresponding to the steepest drops. Such points, appearing as negative peaks in the derivative plot, represent good candidate splitting points to detect groups of dissimilar accounts. Note that it is possible to obtain several candidate splitting points, which might also be ranked according to the derivative value (i.e., how steep is the corresponding drop). Then, a hierarchical top-down (i.e., divisive) approach may be applied by repeatedly splitting the set of accounts based on the ranked candidate points, leading to a dendrogram-like structure. For instance, this approach can be exploited in situations where the LCS curve exhibits multiple plateaux and steep drops.\n\nThus, analyzing the LCS curves of figures 2(a) and 2(b), we identified the best splitting points and we assumed that the suspiciously similar accounts are the ones that share the longest LCS just before such splitting points, namely the 983 accounts with LCS around 400 for Test-set1 and the 400 accounts with LCS of around 1750 for Test-set2. Finally, we evaluated the effectiveness of the DNA-based detection technique by considering the following evaluation (a) DNA similarity of a mixed group of genuine accounts and retweeters of the political candidate (Test-set1).\n\n(b) DNA similarity of a mixed group of genuine accounts and spammers of Amazon.com products (Test-set2  metrics: Precision, Recall, Specificity, Accuracy, F-Measure, and Matthews Correlation Coefficient (MCC). To thoroughly evaluate the DNA fingerprinting technique we compared our detection results with those obtained by several different stateof-the-art approaches, namely the supervised one by Yang et al. [4] and the unsupervised approaches by Miller et al. [8] and by Ahmed et al. [9]. The work presented in [4] provides a machine learning classifier that infers whether a Twitter account is genuine or spambot by relying on account's relationships, tweeting timing and level of automation. We have reproduced such classifier since the authors kindly provided us their training set. Instead, works in [8] and [9] define a set of machine learning features and apply clustering algorithms. Specifically, in [8] the authors propose modified versions of the DenStream and StreamKM++ algorithms (respectively based on DBSCAN and k-means) and apply them for the detection of spambots over the Twitter stream. Ahmed et al. [9] exploit the Euclidean distance between feature vectors to build a similarity graph of the accounts. Graph clustering and community detection algorithms are then applied to identify groups of similar accounts in the graph.\n\nTables 2(c) and 2(d) show the results of this comparison. Notably, the DNA fingerprinting detection technique outperforms all other approaches, achieving MCC = 0.952 for Test-set1 and MCC = 0.867 for Test-set2. Specifically, there is a clear performance gap between the approaches of [4] and [8] with respect to our proposed approach and that of [9]. The supervised approach by Yang et al. [4] proved unable to accurately distinguish spambots from genuine accounts, as demonstrated by the considerable number of false negatives (FN) and the resulting very low Recall. This result supports our initial claim that this new wave of bots is surprisingly similar to genuine accounts: they are exceptionally hard to detect if considered one by one. Moreover, also the unsupervised approach in [8] provided unsatisfactory results. Among the 126 features proposed in [8], 95 are based on the textual content of tweets. However, novel social spambots tweet contents similar to that of genuine accounts (e.g., retweets of genuine tweets and famous quotes). Instead, the approach in [9] proved effective in detecting our considered spambots, showing an MCC = 0.886 for Test-set1 and MCC = 0.847 for Test-set2. Employing only 7 features, [9] focuses on retweets, hashtags, mentions, and URLs, thus analyzing the accounts along the dimensions exploited by these spammers. However, although achieving an overall good performance for the considered spambots, the approach in [9] might lack reusability across other groups of spambots with different behaviors, such as those perpetrating a follower fraud [5], [11]. Instead, our DNA-inspired technique is flexible enough to highlight suspicious similarities among groups of accounts without focusing on specific characteristics.\n\nFinally, it is worth noting that some of the state-of-theart approaches for spambots detection require a large number of data-demanding features. For instance, approaches that are based on graph mining have been proved to be more demanding in terms of data that is needed in order to perform the detection [11]. Instead, the DNA fingerprinting technique only exploits Twitter timeline data to perform spambots detection. Furthermore, it does not require a training phase and can be employed pretty much like a clustering algorithm, in an unsupervised fashion.\n\nWe also envision the possibility to exploit results of our DNA-inspired technique as a feature in a more complex detection system. Indeed, different types of DNA (such as the tweet type DNA and the tweet content DNA) can be exploited to model user behaviors along different directions. Then, results of these models could be used simultaneously in an ensemble or voting system. To this regard, the already interesting results achieved by exploiting only one type of digital DNA, namely tweet type DNA, might represent promising ground for further experimentation and research.\n\n\nV. CONCLUSION\n\nIn this paper we have introduced a novel methodology to characterize and study online user behaviors. The novelty of our proposal relies in modeling behaviors in a DNA-inspired fashion. Hence, we enable analysts to leverage a powerful set of tools -that have been developed over decades for DNA analysis -to validate their working hypotheses on online user behaviors. To show the viability of our proposal, we have performed an extensive experimental campaign using Twitter as a benchmark and targeting spambots detection. Results show that our proposal outperforms best-of-breed algorithms that are commonly employed for this task. Finally, we also argue that the proposed methodology could be used in other contexts as well, hence paving the way for further research.\n\nFig. 1 .\n1Comparison between the LCS lengths of the digital DNA of different groups of Twitter accounts.\n\nFig. 2 .\n2DNA similarity of the two test-sets and evaluation of spambot detection results.\n\n\n).detection results \nevaluation metrics \n\ndetection system \nTP \nTN \nFP FN \nPrecision Recall Specificity Accuracy F-Measure MCC \n\nYang et al. [4] \n169 811 131 822 \n0.563 \n0.170 \n0.860 \n0.506 \n0.261 0.043 \n\nMiller et al. [8] \n355 657 285 636 \n0.555 \n0.358 \n0.698 \n0.526 \n0.435 0.059 \n\nAhmed et al. [9] \n935 888 \n54 \n56 \n0.945 \n0.944 \n0.945 \n0.943 \n0.944 0.886 \n\nDNA fingerprinting \n963 924 \n18 \n28 \n0.982 \n0.972 \n0.981 \n0.976 \n0.977 0.952 \n\n(c) Evaluation of spambot detection results for a mixed group of genuine accounts and retweeters of the political candidate (Test-set1). \n\ndetection results \nevaluation metrics \n\ndetection system \nTP \nTN \nFP FN \nPrecision Recall Specificity Accuracy F-Measure \nMCC \n\nYang et al. [4] \n190 397 \n71 274 \n0.727 \n0.409 \n0.848 \n0.629 \n0.524 \n0.287 \n\nMiller et al. [8] \n142 306 162 322 \n0.467 \n0.306 \n0.654 \n0.481 \n0.370 -0.043 \n\nAhmed et al. [9] \n428 427 \n41 \n30 \n0.913 \n0.935 \n0.912 \n0.923 \n0.923 \n0.847 \n\nDNA fingerprinting \n398 468 \n0 \n66 \n1.000 \n0.858 \n1.000 \n0.929 \n0.923 \n0.867 \n\n(d) Evaluation of spambot detection results for a mixed group of genuine accounts and spammers of Amazon.com products (Test-set2). \n: With regards to the feature set of [9], a few accounts had null values for all the features thus resulting in the impossibility to apply the \nclustering algorithm to such accounts. \n\n\n\nPredicting elections for multiple countries using twitter and polls. A Tsakalidis, S Papadopoulos, A Cristea, Y Kompatsiaris, Intelligent Systems, IEEE. 302A. Tsakalidis, S. Papadopoulos, A. Cristea, and Y. Kompatsiaris, \"Predicting elections for multiple countries using twitter and polls,\" Intelligent Systems, IEEE, vol. 30, no. 2, pp. 10-17, Mar 2015.\n\nPrediction of human activity by discovering temporal sequence patterns. K Li, Y Fu, IEEE Transactions on. 368Pattern Analysis and Machine IntelligenceK. Li and Y. Fu, \"Prediction of human activity by discovering temporal sequence patterns,\" Pattern Analysis and Machine Intelligence, IEEE Transactions on, vol. 36, no. 8, pp. 1644-1657, Aug 2014.\n\nUncovering deception in social media. H Liu, J Han, H Motoda, Social Netw. Analys. Mining. 41162H. Liu, J. Han, and H. Motoda, \"Uncovering deception in social media,\" Social Netw. Analys. Mining, vol. 4, no. 1, p. 162, 2014.\n\nEmpirical evaluation and new design for fighting evolving twitter spammers. C Yang, R Harkreader, G Gu, IEEE Transactions on. 88Information Forensics and SecurityC. Yang, R. Harkreader, and G. Gu, \"Empirical evaluation and new design for fighting evolving twitter spammers,\" Information Forensics and Security, IEEE Transactions on, vol. 8, no. 8, pp. 1280-1293, 2013.\n\nCatching synchronized behaviors in large networks: A graph mining approach. M Jiang, P Cui, A Beutel, C Faloutsos, S Yang, ACM Transactions on Knowledge Discovery from Data (TKDD). to appearM. Jiang, P. Cui, A. Beutel, C. Faloutsos, and S. Yang, \"Catching synchronized behaviors in large networks: A graph mining approach,\" ACM Transactions on Knowledge Discovery from Data (TKDD), 2016 (to appear).\n\nOnline social spammer detection. X Hu, J Tang, H Liu, AAAI Conference on Artificial Intelligence. X. Hu, J. Tang, and H. Liu, \"Online social spammer detection,\" in AAAI Conference on Artificial Intelligence, 2014, pp. 59-65.\n\nProbabilistic attributed hashing. M Ou, P Cui, J Wang, F Wang, W Zhu, AAAI Conference on Artificial Intelligence. M. Ou, P. Cui, J. Wang, F. Wang, and W. Zhu, \"Probabilistic attributed hashing,\" in AAAI Conference on Artificial Intelligence, 2015, pp. 2894- 2900.\n\nTwitter spammer detection using data stream clustering. Z Miller, B Dickinson, W Deitrick, W Hu, A H Wang, Information Sciences. 260Z. Miller, B. Dickinson, W. Deitrick, W. Hu, and A. H. Wang, \"Twitter spammer detection using data stream clustering,\" Information Sciences, vol. 260, pp. 64-73, 2014.\n\nA generic statistical approach for spam detection in online social networks. F Ahmed, M Abulaish, Computer Communications. 3610F. Ahmed and M. Abulaish, \"A generic statistical approach for spam detection in online social networks,\" Computer Communications, vol. 36, no. 10, pp. 1120-1129, 2013.\n\nLinear time algorithms for generalizations of the longest common substring problem. M Arnold, E Ohlebusch, Algorithmica. 604M. Arnold and E. Ohlebusch, \"Linear time algorithms for generalizations of the longest common substring problem,\" Algorithmica, vol. 60, no. 4, pp. 806-818, 2011.\n\nFame for sale: Efficient detection of fake Twitter followers. S Cresci, R Di Pietro, M Petrocchi, A Spognardi, M Tesconi, Decision Support Systems. 80S. Cresci, R. Di Pietro, M. Petrocchi, A. Spognardi, and M. Tesconi, \"Fame for sale: Efficient detection of fake Twitter followers,\" Decision Support Systems, vol. 80, pp. 56-71, 2015.\n\nHis research interests include social media mining and knowledge discovery. IIT-CNR in. Pisa, ItalyStefano Cresci is a Ph.D. student at University of Pisa, Information Engineering DeptStefano Cresci is a Ph.D. student at University of Pisa, Information Engi- neering Dept., and a research fellow at IIT-CNR in Pisa, Italy. His research interests include social media mining and knowledge discovery. Email: s.cresci@iit.cnr.it\n\nHis research interests include security, privacy, distributed systems, computer forensics, and analytics. He is also affiliated with University of Padua. Dr, Roberto, Maths Dept., and IIT-CNR. Di Pietro is with the Nokia Bell LabsDr. Roberto Di Pietro is with the Nokia Bell Labs, Paris, France. His research interests include security, privacy, distributed systems, computer forensics, and analytics. He is also affiliated with University of Padua, Maths Dept., and IIT- CNR, Pisa, Italy. Email: roberto.di_pietro@nokia.com\n", "annotations": {"author": "[{\"end\":137,\"start\":122},{\"end\":149,\"start\":138},{\"end\":157,\"start\":150},{\"end\":178,\"start\":158},{\"end\":196,\"start\":179},{\"end\":214,\"start\":197},{\"end\":263,\"start\":215},{\"end\":313,\"start\":264},{\"end\":392,\"start\":314},{\"end\":411,\"start\":393},{\"end\":523,\"start\":412},{\"end\":539,\"start\":524}]", "publisher": null, "author_last_name": "[{\"end\":136,\"start\":130},{\"end\":148,\"start\":146},{\"end\":177,\"start\":168},{\"end\":195,\"start\":186},{\"end\":213,\"start\":206}]", "author_first_name": "[{\"end\":129,\"start\":122},{\"end\":145,\"start\":138},{\"end\":156,\"start\":150},{\"end\":167,\"start\":158},{\"end\":185,\"start\":179},{\"end\":205,\"start\":197}]", "author_affiliation": "[{\"end\":262,\"start\":216},{\"end\":312,\"start\":265},{\"end\":391,\"start\":315},{\"end\":410,\"start\":394},{\"end\":522,\"start\":413},{\"end\":538,\"start\":525}]", "title": "[{\"end\":108,\"start\":1},{\"end\":647,\"start\":540}]", "venue": null, "abstract": "[{\"end\":1508,\"start\":660}]", "bib_ref": "[{\"attributes\":{\"ref_id\":\"b0\"},\"end\":1900,\"start\":1897},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":2055,\"start\":2052},{\"attributes\":{\"ref_id\":\"b2\"},\"end\":2218,\"start\":2215},{\"attributes\":{\"ref_id\":\"b3\"},\"end\":2340,\"start\":2337},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":2345,\"start\":2342},{\"attributes\":{\"ref_id\":\"b0\"},\"end\":2366,\"start\":2363},{\"attributes\":{\"ref_id\":\"b5\"},\"end\":2371,\"start\":2368},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":2415,\"start\":2412},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":3508,\"start\":3505},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":3513,\"start\":3510},{\"attributes\":{\"ref_id\":\"b5\"},\"end\":5600,\"start\":5597},{\"attributes\":{\"ref_id\":\"b5\"},\"end\":7345,\"start\":7342},{\"attributes\":{\"ref_id\":\"b3\"},\"end\":8446,\"start\":8443},{\"attributes\":{\"ref_id\":\"b5\"},\"end\":8451,\"start\":8448},{\"attributes\":{\"ref_id\":\"b6\"},\"end\":12982,\"start\":12979},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":13003,\"start\":13000},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":15594,\"start\":15590},{\"attributes\":{\"ref_id\":\"b3\"},\"end\":22659,\"start\":22656},{\"attributes\":{\"ref_id\":\"b7\"},\"end\":22712,\"start\":22709},{\"attributes\":{\"ref_id\":\"b8\"},\"end\":22736,\"start\":22733},{\"attributes\":{\"ref_id\":\"b3\"},\"end\":22763,\"start\":22760},{\"attributes\":{\"ref_id\":\"b7\"},\"end\":23056,\"start\":23053},{\"attributes\":{\"ref_id\":\"b8\"},\"end\":23064,\"start\":23061},{\"attributes\":{\"ref_id\":\"b7\"},\"end\":23160,\"start\":23157},{\"attributes\":{\"ref_id\":\"b8\"},\"end\":23371,\"start\":23368},{\"attributes\":{\"ref_id\":\"b3\"},\"end\":23882,\"start\":23879},{\"attributes\":{\"ref_id\":\"b7\"},\"end\":23890,\"start\":23887},{\"attributes\":{\"ref_id\":\"b8\"},\"end\":23944,\"start\":23941},{\"attributes\":{\"ref_id\":\"b3\"},\"end\":23988,\"start\":23985},{\"attributes\":{\"ref_id\":\"b7\"},\"end\":24385,\"start\":24382},{\"attributes\":{\"ref_id\":\"b7\"},\"end\":24457,\"start\":24454},{\"attributes\":{\"ref_id\":\"b8\"},\"end\":24670,\"start\":24667},{\"attributes\":{\"ref_id\":\"b8\"},\"end\":24824,\"start\":24821},{\"attributes\":{\"ref_id\":\"b8\"},\"end\":25058,\"start\":25055},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":25187,\"start\":25184},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":25193,\"start\":25189},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":25669,\"start\":25665}]", "figure": "[{\"attributes\":{\"id\":\"fig_0\"},\"end\":27389,\"start\":27284},{\"attributes\":{\"id\":\"fig_1\"},\"end\":27481,\"start\":27390},{\"attributes\":{\"id\":\"tab_0\",\"type\":\"table\"},\"end\":28820,\"start\":27482}]", "paragraph": "[{\"end\":1730,\"start\":1558},{\"end\":2219,\"start\":1732},{\"end\":2952,\"start\":2221},{\"end\":3066,\"start\":2954},{\"end\":3226,\"start\":3068},{\"end\":3368,\"start\":3228},{\"end\":3451,\"start\":3370},{\"end\":4122,\"start\":3453},{\"end\":5044,\"start\":4187},{\"end\":5529,\"start\":5098},{\"end\":7087,\"start\":5531},{\"end\":7776,\"start\":7089},{\"end\":8200,\"start\":7824},{\"end\":9686,\"start\":8202},{\"end\":10277,\"start\":9688},{\"end\":13004,\"start\":10323},{\"end\":13282,\"start\":13098},{\"end\":13946,\"start\":13284},{\"end\":15202,\"start\":13948},{\"end\":16311,\"start\":15204},{\"end\":18066,\"start\":16313},{\"end\":18873,\"start\":18107},{\"end\":18966,\"start\":18875},{\"end\":19068,\"start\":18968},{\"end\":19265,\"start\":19070},{\"end\":19414,\"start\":19267},{\"end\":20745,\"start\":19416},{\"end\":21671,\"start\":20747},{\"end\":22244,\"start\":21673},{\"end\":23593,\"start\":22246},{\"end\":25357,\"start\":23595},{\"end\":25918,\"start\":25359},{\"end\":26496,\"start\":25920},{\"end\":27283,\"start\":26514}]", "formula": null, "table_ref": null, "section_header": "[{\"end\":1556,\"start\":1510},{\"end\":4165,\"start\":4125},{\"end\":4185,\"start\":4168},{\"end\":5096,\"start\":5047},{\"end\":7822,\"start\":7779},{\"end\":10321,\"start\":10280},{\"end\":13059,\"start\":13007},{\"end\":13096,\"start\":13062},{\"end\":18105,\"start\":18069},{\"end\":26512,\"start\":26499},{\"end\":27293,\"start\":27285},{\"end\":27399,\"start\":27391}]", "table": "[{\"end\":28820,\"start\":27486}]", "figure_caption": "[{\"end\":27389,\"start\":27295},{\"end\":27481,\"start\":27401},{\"end\":27486,\"start\":27484}]", "figure_ref": "[{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":16586,\"start\":16565},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":16746,\"start\":16738},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":16828,\"start\":16820},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":17141,\"start\":17133},{\"attributes\":{\"ref_id\":\"fig_0\"},\"end\":17434,\"start\":17422},{\"attributes\":{\"ref_id\":\"fig_1\"},\"end\":19748,\"start\":19740},{\"attributes\":{\"ref_id\":\"fig_1\"},\"end\":19958,\"start\":19950},{\"attributes\":{\"ref_id\":\"fig_1\"},\"end\":20492,\"start\":20481}]", "bib_author_first_name": "[{\"end\":28892,\"start\":28891},{\"end\":28906,\"start\":28905},{\"end\":28922,\"start\":28921},{\"end\":28933,\"start\":28932},{\"end\":29252,\"start\":29251},{\"end\":29258,\"start\":29257},{\"end\":29566,\"start\":29565},{\"end\":29573,\"start\":29572},{\"end\":29580,\"start\":29579},{\"end\":29830,\"start\":29829},{\"end\":29838,\"start\":29837},{\"end\":29852,\"start\":29851},{\"end\":30200,\"start\":30199},{\"end\":30209,\"start\":30208},{\"end\":30216,\"start\":30215},{\"end\":30226,\"start\":30225},{\"end\":30239,\"start\":30238},{\"end\":30558,\"start\":30557},{\"end\":30564,\"start\":30563},{\"end\":30572,\"start\":30571},{\"end\":30785,\"start\":30784},{\"end\":30791,\"start\":30790},{\"end\":30798,\"start\":30797},{\"end\":30806,\"start\":30805},{\"end\":30814,\"start\":30813},{\"end\":31072,\"start\":31071},{\"end\":31082,\"start\":31081},{\"end\":31095,\"start\":31094},{\"end\":31107,\"start\":31106},{\"end\":31113,\"start\":31112},{\"end\":31115,\"start\":31114},{\"end\":31394,\"start\":31393},{\"end\":31403,\"start\":31402},{\"end\":31697,\"start\":31696},{\"end\":31707,\"start\":31706},{\"end\":31963,\"start\":31962},{\"end\":31973,\"start\":31972},{\"end\":31976,\"start\":31974},{\"end\":31986,\"start\":31985},{\"end\":31999,\"start\":31998},{\"end\":32012,\"start\":32011}]", "bib_author_last_name": "[{\"end\":28903,\"start\":28893},{\"end\":28919,\"start\":28907},{\"end\":28930,\"start\":28923},{\"end\":28946,\"start\":28934},{\"end\":29255,\"start\":29253},{\"end\":29261,\"start\":29259},{\"end\":29570,\"start\":29567},{\"end\":29577,\"start\":29574},{\"end\":29587,\"start\":29581},{\"end\":29835,\"start\":29831},{\"end\":29849,\"start\":29839},{\"end\":29855,\"start\":29853},{\"end\":30206,\"start\":30201},{\"end\":30213,\"start\":30210},{\"end\":30223,\"start\":30217},{\"end\":30236,\"start\":30227},{\"end\":30244,\"start\":30240},{\"end\":30561,\"start\":30559},{\"end\":30569,\"start\":30565},{\"end\":30576,\"start\":30573},{\"end\":30788,\"start\":30786},{\"end\":30795,\"start\":30792},{\"end\":30803,\"start\":30799},{\"end\":30811,\"start\":30807},{\"end\":30818,\"start\":30815},{\"end\":31079,\"start\":31073},{\"end\":31092,\"start\":31083},{\"end\":31104,\"start\":31096},{\"end\":31110,\"start\":31108},{\"end\":31120,\"start\":31116},{\"end\":31400,\"start\":31395},{\"end\":31412,\"start\":31404},{\"end\":31704,\"start\":31698},{\"end\":31717,\"start\":31708},{\"end\":31970,\"start\":31964},{\"end\":31983,\"start\":31977},{\"end\":31996,\"start\":31987},{\"end\":32009,\"start\":32000},{\"end\":32020,\"start\":32013},{\"end\":32819,\"start\":32817},{\"end\":32828,\"start\":32821}]", "bib_entry": "[{\"attributes\":{\"id\":\"b0\",\"matched_paper_id\":10476292},\"end\":29177,\"start\":28822},{\"attributes\":{\"id\":\"b1\",\"matched_paper_id\":18000737},\"end\":29525,\"start\":29179},{\"attributes\":{\"id\":\"b2\",\"matched_paper_id\":7849749},\"end\":29751,\"start\":29527},{\"attributes\":{\"id\":\"b3\",\"matched_paper_id\":573894},\"end\":30121,\"start\":29753},{\"attributes\":{\"id\":\"b4\",\"matched_paper_id\":18801049},\"end\":30522,\"start\":30123},{\"attributes\":{\"id\":\"b5\",\"matched_paper_id\":7038871},\"end\":30748,\"start\":30524},{\"attributes\":{\"id\":\"b6\",\"matched_paper_id\":865622},\"end\":31013,\"start\":30750},{\"attributes\":{\"id\":\"b7\",\"matched_paper_id\":3423386},\"end\":31314,\"start\":31015},{\"attributes\":{\"id\":\"b8\",\"matched_paper_id\":29362917},\"end\":31610,\"start\":31316},{\"attributes\":{\"id\":\"b9\",\"matched_paper_id\":25063297},\"end\":31898,\"start\":31612},{\"attributes\":{\"id\":\"b10\",\"matched_paper_id\":17931639},\"end\":32234,\"start\":31900},{\"attributes\":{\"id\":\"b11\"},\"end\":32661,\"start\":32236},{\"attributes\":{\"id\":\"b12\"},\"end\":33187,\"start\":32663}]", "bib_title": "[{\"end\":28889,\"start\":28822},{\"end\":29249,\"start\":29179},{\"end\":29563,\"start\":29527},{\"end\":29827,\"start\":29753},{\"end\":30197,\"start\":30123},{\"end\":30555,\"start\":30524},{\"end\":30782,\"start\":30750},{\"end\":31069,\"start\":31015},{\"end\":31391,\"start\":31316},{\"end\":31694,\"start\":31612},{\"end\":31960,\"start\":31900},{\"end\":32310,\"start\":32236},{\"end\":32815,\"start\":32663}]", "bib_author": "[{\"end\":28905,\"start\":28891},{\"end\":28921,\"start\":28905},{\"end\":28932,\"start\":28921},{\"end\":28948,\"start\":28932},{\"end\":29257,\"start\":29251},{\"end\":29263,\"start\":29257},{\"end\":29572,\"start\":29565},{\"end\":29579,\"start\":29572},{\"end\":29589,\"start\":29579},{\"end\":29837,\"start\":29829},{\"end\":29851,\"start\":29837},{\"end\":29857,\"start\":29851},{\"end\":30208,\"start\":30199},{\"end\":30215,\"start\":30208},{\"end\":30225,\"start\":30215},{\"end\":30238,\"start\":30225},{\"end\":30246,\"start\":30238},{\"end\":30563,\"start\":30557},{\"end\":30571,\"start\":30563},{\"end\":30578,\"start\":30571},{\"end\":30790,\"start\":30784},{\"end\":30797,\"start\":30790},{\"end\":30805,\"start\":30797},{\"end\":30813,\"start\":30805},{\"end\":30820,\"start\":30813},{\"end\":31081,\"start\":31071},{\"end\":31094,\"start\":31081},{\"end\":31106,\"start\":31094},{\"end\":31112,\"start\":31106},{\"end\":31122,\"start\":31112},{\"end\":31402,\"start\":31393},{\"end\":31414,\"start\":31402},{\"end\":31706,\"start\":31696},{\"end\":31719,\"start\":31706},{\"end\":31972,\"start\":31962},{\"end\":31985,\"start\":31972},{\"end\":31998,\"start\":31985},{\"end\":32011,\"start\":31998},{\"end\":32022,\"start\":32011},{\"end\":32821,\"start\":32817},{\"end\":32830,\"start\":32821}]", "bib_venue": "[{\"end\":28973,\"start\":28948},{\"end\":29283,\"start\":29263},{\"end\":29616,\"start\":29589},{\"end\":29877,\"start\":29857},{\"end\":30302,\"start\":30246},{\"end\":30620,\"start\":30578},{\"end\":30862,\"start\":30820},{\"end\":31142,\"start\":31122},{\"end\":31437,\"start\":31414},{\"end\":31731,\"start\":31719},{\"end\":32046,\"start\":32022},{\"end\":32322,\"start\":32312},{\"end\":32854,\"start\":32830},{\"end\":32335,\"start\":32324}]"}}}, "year": 2023, "month": 12, "day": 17}