{"id": 8529258, "updated": "2023-10-17 13:32:06.715", "metadata": {"title": "Fairness Constraints: Mechanisms for Fair Classiﬁcation", "authors": "[{\"first\":\"Muhammad\",\"last\":\"Zafar\",\"middle\":[\"Bilal\"]},{\"first\":\"Isabel\",\"last\":\"Valera\",\"middle\":[]},{\"first\":\"Manuel\",\"last\":\"Gomez-Rodriguez\",\"middle\":[]},{\"first\":\"Krishna\",\"last\":\"Gummadi\",\"middle\":[\"P.\"]}]", "venue": "AISTATS", "journal": "962-970", "publication_date": {"year": 2017, "month": null, "day": null}, "abstract": "Algorithmic decision making systems are ubiquitous across a wide variety of online as well as oﬄine services. These systems rely on complex learning methods and vast amounts of data to optimize the service functionality, satisfaction of the end user and proﬁtabil-ity. However, there is a growing concern that these automated decisions can lead, even in the absence of intent, to a lack of fairness, i.e. , their outcomes can disproportionately hurt (or, beneﬁt) particular groups of people sharing one or more sensitive attributes ( e.g. , race, sex). In this paper, we introduce a ﬂexible mechanism to design fair classiﬁers by leveraging a novel intuitive measure of decision boundary (un)fairness. We instantiate this mechanism with two well-known classi-ﬁers, logistic regression and support vector machines, and show on real-world data that our mechanism allows for a ﬁne-grained con-trol on the degree of fairness, often at a small cost in terms of accuracy. A Python implementation of our mechanism is available at fate-computing", "fields_of_study": "[\"Computer Science\"]", "external_ids": {"arxiv": null, "mag": "3023309920", "acl": null, "pubmed": null, "pubmedcentral": null, "dblp": "conf/aistats/ZafarVGG17", "doi": null}}, "content": {"source": {"pdf_hash": "b6aa5765226c623108232856b74c7034738b64d2", "pdf_src": "MergedPDFExtraction", "pdf_uri": null, "oa_url_match": false, "oa_info": null}, "grobid": {"id": "0d85550a5e350553a4bc7452217810d7c623cff4", "type": "plain-text", "url": "s3://ai2-s2-pdf-extraction-prod/parse-results/s2orc_worker/b6aa5765226c623108232856b74c7034738b64d2.txt", "contents": "\nFairness Constraints: Mechanisms for Fair Classification\n\n\nMuhammad Bilal Zafar \nMax Planck Institute for Software Systems (MPI-SWS)\nGermany\n\nIsabel Valera \nMax Planck Institute for Software Systems (MPI-SWS)\nGermany\n\nManuel Gomez Rodriguez \nMax Planck Institute for Software Systems (MPI-SWS)\nGermany\n\nKrishna P Gummadi \nMax Planck Institute for Software Systems (MPI-SWS)\nGermany\n\nFairness Constraints: Mechanisms for Fair Classification\n\nAlgorithmic decision making systems are ubiquitous across a wide variety of online as well as offline services. These systems rely on complex learning methods and vast amounts of data to optimize the service functionality, satisfaction of the end user and profitability. However, there is a growing concern that these automated decisions can lead, even in the absence of intent, to a lack of fairness, i.e., their outcomes can disproportionately hurt (or, benefit) particular groups of people sharing one or more sensitive attributes (e.g., race, sex). In this paper, we introduce a flexible mechanism to design fair classifiers by leveraging a novel intuitive measure of decision boundary (un)fairness. We instantiate this mechanism with two well-known classifiers, logistic regression and support vector machines, and show on real-world data that our mechanism allows for a fine-grained control on the degree of fairness, often at a small cost in terms of accuracy. A Python implementation of our mechanism is available at fate-computing.mpi-sws.org\n\nINTRODUCTION\n\nAlgorithmic decision making processes are increasingly becoming automated and data-driven in both online (e.g., spam filtering, product personalization) as well as offline (e.g., pretrial risk assessment, mortgage approvals) settings. However, as automated data analysis replaces human supervision in decision making, and the scale of the analyzed data becomes \"big\", there are growing concerns from civil organizations [Bhandari, 2016], governments [Podesta et al., 2014, Muñoz et al., 2016, and researchers [Sweeney, 2013] about potential loss of transparency, accountability and fairness.\n\nAnti-discrimination laws in many countries prohibit unfair treatment of people based on certain attributes, also called sensitive attributes, such as gender or race [Civil Rights Act, 1964]. These laws typically evaluate the fairness of a decision making process by means of two distinct notions [Barocas and Selbst, 2016]: disparate treatment and disparate impact. A decision making process suffers from disparate treatment if its decisions are (partly) based on the subject's sensitive attribute information, and it has disparate impact if its outcomes disproportionately hurt (or, benefit) people with certain sensitive attribute values (e.g., females, blacks).\n\nWhile it is desirable to design decision making systems free of disparate treatment as well as disparate impact, controlling for both forms of unfairness simultaneously is challenging. One could avoid disparate treatment by ensuring that the decision making process does not have access to sensitive attribute information (and hence cannot make use of it). However, ignoring the sensitive attribute information may still lead to disparate impact in outcomes: since automated decision-making systems are often trained on historical data, if a group with a certain sensitive attribute value was unfairly treated in the past, 1 this unfairness may persist in future predictions through indirect discrimination [Pedreschi et al., 2008], leading to disparate impact. Similarly, avoiding disparate impact in outcomes by using sensitive attribute information while making decisions would constitute disparate treatment, and may also lead to reverse discrimination [Ricci vs. DeStefano, 2009].\n\nIn this work, our goal is to design classifiersspecifically, convex margin-based classifiers like logistic regression and support vector machines (SVMs)-that avoid both disparate treatment and disparate impact, and can additionally accommodate the \"business necessity\" clause of disparate impact doctrine. Accord-1 Like earlier studies on fairness aware-learning, we assume that while historical class labels may be biased against group(s) with certain sensitive attribute value(s), they still contain some degree of information on the true (unbiased) labels. Assuming the class labels to be completely biased and having no information on the true labels would render a learning task on such a dataset pointless. arXiv:1507.05259v5 [stat.ML] 23 Mar 2017 ing to the business necessity clause, an employer can justify a certain degree of disparate impact in order to meet certain performance-related constraints [Barocas and Selbst, 2016]. However, the employer needs to ensure that the current decision making incurs the least possible disparate impact under the given constraints. To the best of our knowledge, this clause has not been addressed by any prior study on fairness-aware learning.\n\nWhile there is no specific numerical formula laid out by anti-discrimination laws to quantify disparate impact, here we leverage a specific instantiation supported by the U.S. Equal Employment Opportunity Commission: the \"80%-rule\" (or more generally, the p%rule) [Biddle, 2005]. The p%-rule states that the ratio between the percentage of subjects having a certain sensitive attribute value assigned the positive decision outcome and the percentage of subjects not having that value also assigned the positive outcome should be no less than p:100. Since it is very challenging to directly incorporate this rule in the formulation of convex margin-based classifiers, we introduce a novel intuitive measure of decision boundary (un)fairness as a tractable proxy to the rule: the covariance between the sensitive attributes and the (signed) distance between the subjects' feature vectors and the decision boundary of the classifier.\n\nOur measure of fairness allows us to derive two complementary formulations for training fair classifiers: one that maximizes accuracy subject to fairness constraints, and enables compliance with disparate impact doctrine in its basic form (i.e., the p%-rule); and another that maximizes fairness subject to accuracy constraints, and ensures fulfilling the business necessity clause of disparate impact. Remarkably, both formulations also avoid disparate treatment, since they do not make use of sensitive attribute information while making decisions. Our measure additionally satisfies several desirable properties: (i) for a wide variety of convex margin-based (linear and non-linear) classifiers, it is convex and can be readily incorporated in their formulation without increasing their complexity; (ii) it allows for clear mechanism to trade-off fairness and accuracy; and, (iii) it can be used to ensure fairness with respect to several sensitive attributes. Experiments with two well-known classifiers, logistic regression and support vector machines, using both synthetic and real-world data show that our fairness measure allows for a fine-grained control of the level of fairness, often at a small cost in terms of accuracy, and provides more flexibility than the state-of-the-art (see Table 1).\n\nRelated Work. A number of prior studies have focused on controlling disparate impact and/or disparate treatment-based discrimination in the context of bi-nary classification [Romei and Ruggieri, 2014]. These studies have typically adopted one of the two following strategies:\n\nThe first strategy consists of pre-processing the training data [Dwork et al., 2012, Feldman et al., 2015, Kamiran and Calders, 2009. This typically involves (i) changing the value of the sensitive attributes or class labels of individual items in the training data, or (ii) mapping the training data to a transformed space where the dependencies between sensitive attributes and class labels disappear. However, these approaches treat the learning algorithm as a black box and, as a consequence, the pre-processing can lead to unpredictable losses in accuracy.\n\nThe second strategy consists of modifying existing classifiers to limit discrimination [Calders and Verwer, 2010, Kamishima et al., 2011, Goh et al., 2016. Among them, the work by Kamishima et al. [Kamishima et al., 2011] is the most closely related to ours: it introduces a regularization term to penalize discrimination in the formulation of the logistic regression classifier.\n\nRecently, Zemel et al. [2013], building on Dwork et al. [2012], combined both strategies by jointly learning a fair representation of the data and the classifier parameters. This approach has two main limitations: i) it leads to a non-convex optimization problem and does not guarantee optimality, and ii) the accuracy of the classifier depends on the dimension of the fair representation, which needs to be chosen rather arbitrarily.\n\nMany of the prior studies suffer from one or more of the following limitations: (i) they are restricted to a narrow range of classifiers, (ii) they only accommodate a single, binary sensitive attribute, and (iii) they cannot eliminate disparate treatment and disparate impact simultaneously. Table 1 compares the capabilities of different methods while achieving fairness.\n\nFinally, as discussed earlier, disparate impact is particularly well suited as a fairness criterion when historical decisions used during the training phase are biased against certain social groups. In such contexts, proportionality in outcomes (e.g., p%-rule) may help mitigate these historical biases. However, in cases where the (unbiased) ground-truth is available for the training phase, i.e., one can tell whether a historical decision was right or wrong, disproportionality in outcomes can be explained by the means of the ground-truth. In those cases, disparate impact may be a rather misleading notion of fairness, and other recently proposed criteria like \"disparate mistreatment\" by Zafar et al. [2017], may be better suited notions of fairness. For more discussion into this alternative notion, we point the reader to our companion paper [Zafar et al., 2017].  \n\n\nRange of classifiers Our method\n\nAny convex margin-based Kamiran and Calders [2010] Any score-based Calders and Verwer [2010] Naive Bayes Luong et al. [2011] Any score-based Kamishima et al. [2011] Logistic Regression Zemel et al. [2013] Log loss Feldman et al. [2015] Any (only numerical non-sens. attrs.) Goh et al. [2016] Ramp loss Table 1: Capabilities of different methods in eliminating disparate impact and/or disparate treatment. None of the prior methods addresses disparate impact's business necessity clause. Many of the methods do not generalize to multiple (e.g., gender and race) or polyvalent sensitive attributes (e.g., race, that has more than two values).\n\n\nFAIRNESS IN CLASSIFICATION\n\nFor simplicity, we consider binary classification tasks in this work. However, our ideas can be easily extended to m-ary classification.\n\nIn a binary classification task, one needs to find a mapping function f (x) between user feature vectors x ∈ R d and class labels y ∈ {−1, 1}. This task is achieved by utilizing a training set, {(x i , y i )} N i=1 , to construct a mapping that works well on an unseen test set. For margin-based classifiers, finding this mapping usually reduces to building a decision boundary in feature space that separates users in the training set according to their class labels. One typically looks for a decision boundary, defined by a set of parameters θ * , that achieves the greatest classification accuracy in a test set, by minimizing a loss function over a training set L(θ), i.e., θ * = argmin θ L(θ). Then, given an unseen feature vector x i from the test set, the classifier predicts f θ (x i ) = 1 if d θ * (x i ) ≥ 0 and f θ (x i ) = −1 otherwise, where d θ * (x) denotes the signed distance from the feature vector x to the decision boundary.\n\nIf class labels in the training set are correlated with one or more sensitive attributes {z i } N i=1 (e.g., gender, race), the percentage of users with a certain sensitive attribute having d θ * (x i ) ≥ 0 may differ dramatically from the percentage of users without this sensitive attribute value having d θ * (x i ) ≥ 0 (i.e., the classifier may suffer from disparate impact). Note that this may happen even if sensitive attributes are not used to construct the decision boundary but are correlated with one or more of user features, through indirect discrimination [Pedreschi et al., 2008].\n\n\nFairness Definition\n\nFirst, to comply with disparate treatment criterion we specify that sensitive attributes are not used in decision making, i.e., {x i } N i=1 and {z i } N i=1 consist of disjoint feature sets.\n\nNext, as discussed in Section 1, our definition of disparate impact leverages the \"80%-rule\" [Biddle, 2005]. A decision boundary satisfies the \"80%-rule\" (or more generally the \"p%-rule\"), if the ratio between the percentage of users with a particular sensitive attribute value having d θ (x) ≥ 0 and the percentage of users without that value having d θ (x) ≥ 0 is no less than 80:100 (p:100). For a given binary sensitive attribute z ∈ {0, 1}, one can write the p%-rule as:\nmin P (d θ (x)≥0|z=1) P (d θ (x)≥0|z=0) , P (d θ (x)≥0|z=0) P (d θ (x)≥0|z=1) ≥ p 100 .\n(1)\n\nUnfortunately, it is very challenging to directly incorporate the p%-rule in the formulation of convex margin-based classifiers, since it is a non-convex function of the classifier parameters θ and, therefore, it would lead to non-convex formulations, which are difficult to solve efficiently. Secondly, as long as the user feature vectors lie on the same side of the decision boundary, the p%-rule is invariant to changes in the decision boundary. In other words, the p%-rule is a function having saddle points. The presence of saddle points furthers complicate the procedure for solving non-convex optimization problems [Dauphin et al., 2014]. To overcome these challenges, we next introduce a novel measure of decision boundary (un)fairness which can be used as a proxy to efficiently design classifiers satisfying a given p%-rule.\n\n\nOUR APPROACH\n\nIn this section, we first introduce our measure of decision boundary (un)fairness, the decision boundary covariance. We then derive two complementary formulations. The first formulation ensures compliance with disparate impact doctrine in its basic form (ensure a given p%-rule) by maximizing accuracy subject to fairness constraints. The second formulation guarantees fulfilling disparate impact's \"business necessity\" clause by maximizing fairness subject to accuracy constraints.\n\nFor conciseness, we append a constant 1 to all feature vectors (x i ) so that the linear classifier decision boundary equation\nθ T x + b = 0 reduces to θ T x = 0.\n\nDecision Boundary Covariance\n\nOur measure of decision boundary (un)fairness is defined as the covariance between the users' sensitive attributes, {z i } N i=1 , and the signed distance from the users' feature vectors to the decision boundary,\n{d θ (x i )} N i=1 , i.e.: Cov(z, d θ (x)) = E[(z −z)d θ (x)] − E[(z −z)]d θ (x) ≈ 1 N N i=1 (z i −z) d θ (x i ),(2)\nwhere\nE[(z −z)]d θ (x) cancels out since E[(z −z)] = 0.\nSince in linear models for classification, such as logistic regression or linear SVMs, the decision boundary is simply the hyperplane defined by\nθ T x = 0, Eq. (2) reduces to 1 N N i=1 (z i −z) θ T x i .\nIn contrast with the p%-rule (Eq. 1), the decision boundary covariance (Eq. 2) is a convex function with respect to the decision boundary parameters θ, since d θ (x i ) is convex with respect to θ for all linear, convex margin-based classifiers. 2 Hence, it can be easily included in the formulation of these classifiers without increasing the complexity of their training.\n\nMoreover, note that, if a decision boundary satisfies the \"100%-rule\", i.e.,\nP (d θ (x) ≥ 0|z = 0) = P (d θ (x) ≥ 0|z = 1),(3)\nthen the (empirical) covariance will be approximately zero for a sufficiently large training set.\n\n\nMaximizing Accuracy Under Fairness Constraints\n\nIn this section, we design classifiers that maximize accuracy subject to fairness constraints (e.g., a specific p%-rule), and thus may be used to ensure compliance with the disparate impact doctrine in its basic form.\n\nTo this end, we find the decision boundary parameters θ by minimizing the corresponding loss function over the training set under fairness constraints, i.e.:\nminimize L(θ) subject to 1 N N i=1 (z i −z) d θ (x i ) ≤ c, 1 N N i=1 (z i −z) d θ (x i ) ≥ −c,(4)\nwhere c is the covariance threshold, which specifies an upper bound on the covariance between each sensitive attribute and the signed distance from the feature vectors to the decision boundary. In this formulation, c trades off fairness and accuracy, such that as we decrease c towards zero, the resulting classifier will satisfy a larger p%-rule but will potentially suffer from a larger loss in accuracy. Note that since the above optimization problem is convex, our scheme ensures that the trade-off between the classifier loss function and decision boundary covariance is Pareto optimal.\n\nRemarks. It is important to note that the distance to the margin, d θ (x), only depends on the non-sensitive features x and, therefore, the sensitive features z are not needed while making decisions. In other words, we account for disparate treatment, by removing the sensitive features from the decision making process and, for disparate impact, by adding fairness constraints during the training process of the classifier. Additionally, the constrained optimization problem (4), can also be written as a regularized optimization problem by making use of its dual form, in which the fairness constraints are moved to the objective and the corresponding Lagrange multipliers act as regularizers.\n\nNext, we specialize problem (4) for logistic regression classifiers.\n\nLogistic Regression. In logistic regression classifiers, one maps the feature vectors x i to the class labels y i by means of a probability distribution:\np(y i = 1|x i , θ) = 1 1 + e −θ T xi ,(5)\nwhere θ is obtained by solving a maximum likelihood problem over the training set, i.e., θ * = argmin θ − N i=1 log p(y i |x i , θ). Thus, the corresponding loss function is given by − N i=1 log p(y i |x i , θ), and problem (4) adopts the form:\nminimize − N i=1 log p(y i |x i , θ) subject to 1 N N i=1 (z i −z) θ T x i ≤ c, 1 N N i=1 (z i −z) θ T x i ≥ −c,(6)\nAppendix A presents the specialization of our formulation for both linear and non-linear SVM classifiers.\n\n\nMaximizing Fairness Under Accuracy\n\nConstraints In the previous section, we designed classifiers that maximize accuracy subject to fairness constraints. However, if the underlying correlation between the class labels and the sensitive attributes in the training set is very high, enforcing fairness constraints may results in underwhelming performance (accuracy) and thus be unacceptable in terms of business objectives. Disparate impact's \"business necessity\" clause accounts for such scenarios by allowing some degree of disparate impact in order to meet performance constraints. However, the employer needs to ensure that the decision making causes least possible disparate impact under the given performance (accuracy) constraints [Barocas and Selbst, 2016]. To accommodate such scenarios, we now propose an alternative formulation that maximizes fairness (minimizes disparate impact) subject to accuracy constraints.\n\nTo this aim, we find the decision boundary parameters θ by minimizing the corresponding (absolute) decision boundary covariance over the training set under constraints on the classifier loss function, i.e.:\nminimize | 1 N N i=1 (z i −z) d θ (x i )| subject to L(θ) ≤ (1 + γ)L(θ * ),(7)\nwhere L(θ * ) denotes the optimal loss over the training set provided by the unconstrained classifier and γ ≥ 0 specifies the maximum additional loss with respect to the loss provided by the unconstrained classifier. Here, we can ensure maximum fairness with no loss in accuracy by setting γ = 0. As in Section 3.2, it is possible to specialize problem (7) for the same classifiers and show that the formulation remains convex.\n\nFine-Grained Accuracy Constraints. In many classifiers, including logistic regression and SVMs, the loss function (or the dual of the loss function) is additive over the points in the training set, i.e.,\nL(θ) = N i=1 L i (θ), where L i (θ)\nis the individual loss associated with the i-th point in the training set. Moreover, the individual loss L i (θ) typically tells us how close the predicted label f (x i ) is to the true label y i , by means of the signed distance to the decision boundary. Therefore, one may think of incorporating loss constraints for a certain set of users, and consequently, prevent individual users originally classified as positive (by the unconstrained classifier) from being classified as negative by the constrained classifier. To do so, we find the decision boundary parameters θ as:\nminimize | 1 N N i=1 (z i −z) θ T x i | subject to L i (θ) ≤ (1 + γ i )L i (θ * ) ∀i ∈ {1, . . . , N },(8)\nwhere L i (θ * ) is the individual loss associated to the i-th user in the training set provided by the unconstrained classifier and γ i ≥ 0 is her allowed additional loss. For example, in the case of logistic regression classifier, θ * = argmin θ N i=1 − log p(y i |x i , θ) and the losses for individual points are L i (θ) = − log p(y i |x i , θ). Now, if we set γ i = 0, we are enforcing that the probability of the i-th user to be mapped in the positive class to be equal or higher than in the original (unconstrained) classifier.\n\n\nEVALUATION\n\nWe evaluate our framework on several synthetic and real-world datasets. We first experiment with our first formulation and show that it allows for fine-grained fairness control, often at a minimal loss in accuracy. Then, we validate our second formulation, which allows maximizing fairness under accuracy constraints, and also provides guarantees on avoiding negative classification of certain individual users or group of users.\n\nHere, we adopt the p%-rule [Biddle, 2005] as our true measure of fairness. However, as shown in Appendix B.2, we obtain similar results if we consider another measure of fairness used by some of the previous studies in this area.\n\n\nExperiments on Synthetic Data\n\nFairness constraints vs accuracy constraints. To simulate different degrees of disparate impact in classification outcomes, we generate two synthetic datasets with different levels of correlation between a single, binary sensitive attribute and class labels. We then train two types of logistic regression classifiers: one type maximizes accuracy subject to fairness constraints (Section 3.2), and the other maximizes fairness under fine-grained accuracy constraints (Section 3.3).\n\nSpecifically, we generate 4,000 binary class labels uniformly at random and assign a 2-dimensional user feature vector per label by drawing samples from two different Gaussian distributions: p(x|y=1) = N ([2; 2], [5, 1; 1, 5]) and p(x|y=−1) = N ([−2; −2], [10, 1; 1, 3]). Then, we draw each user's sensitive attribute z from a Bernoulli distribution: p(z = 1) = p(x |y = 1)/(p(x |y = 1) + p(x |y = −1)), where x = [cos(φ), − sin(φ); sin(φ), cos(φ)]x is simply a rotated version of the feature vector, x.\n\nWe generate datasets with two values for the parameter φ, which controls the correlation between the sensitive attribute and the class labels (and hence, the resulting disparate impact). Here, the closer φ is to zero, the higher the correlation. Finally, we trained both types of constrained classifiers on each dataset. Fig. 1a shows the decision boundaries provided by the classifiers that maximize accuracy under fairness constraints for two different correlation values and two (successively decreasing) covariance thresholds, c. We compare these boundaries against the unconstrained decision boundary (solid line). As expected, given the data generation process, fairness constraints map into a rotation of the decision boundary (dashed lines), which is greater as we decrease threshold value c or increase the correlation in the original data (from φ = π/4 to φ = π/8). This movement of the decision boundaries shows that our fairness constraints are successfully undoing (albeit in a highly controlled setting) the rotations we used to induce disparate impact in the dataset. Moreover, a smaller covariance threshold (a larger rotation) leads to a more fair solution, although, it comes at a larger cost in accuracy. Fig. 1b shows the decision boundaries provided by the classifiers that maximize fairness under fine-grained accuracy constraints. Here, the fine-grained accuracy Acc=0.87; p%-rule=45% Acc=0.82; p%-rule=70% Acc=0.74; p%-rule=98% Acc=0.87; p%-rule=24% Acc=0.71; p%-rule=62% Acc=0.60; p%-rule=99% φ = π/4 φ = π/8 (a) Maximizing accuracy under fairness constraints Acc=0.87; p%-rule=45% Acc=0.78; p%-rule=76% Acc=0.64; p%-rule=93%\n\nAcc=0.87; p%-rule=24% Acc=0.78; p%-rule=54% Acc=0.53; p%-rule=99% φ = π/4 φ = π/8 (b) Maximizing fairness under accuracy constraints Each column corresponds to a dataset, with different correlation value between sensitive attribute values (crosses vs circles) and class labels (red vs green).\n\nconstraints ensure that the users with z = 1 classified as positive by the unconstrained classifier (circles above the solid line) are not labeled as negative by the fair classifier. The decision boundaries provided by this formulation, in contrast to the previous one, are rotated and shifted versions of the unconstrained boundary. Such shifts enable the constrained classifiers to avoid negatively classifying users specified in the constraints.\n\nWe also illustrate how the decision boundary of a nonlinear classifier, a SVM with RBF kernel, changes under fairness constraints in Appendix B.1.\n\n\nExperiments on Real Data\n\nExperimental Setup. We experiment with two realworld datasets: The Adult income dataset [Adult data, 1996] and the Bank marketing dataset [Bank data, 2014]. The Adult dataset contains a total of 45,222 subjects, each with 14 features (e.g., age, educational level) and a binary label, which indicates whether a subject's incomes is above (positive class) or below (negative class) 50K USD. For this dataset, we consider gender and race, respectively, as binary and non-binary (polyvalent) sensitive attributes. The Bank dataset contains a total of 41,188 subjects, each with 20 attributes (e.g., marital status) and a binary label, which indicates whether the client has subscribed (positive class) or not (negative class) to a term deposit. In this case, we consider age as (binary) sensitive attribute, which is discretized to indicate whether the client's age is between 25 and 60 years. For detailed statistics about the distribution of different sensitive attributes in positive class in these datasets, we refer the reader to Appendix B.2.\n\nFor the sake of conciseness, while presenting the results for binary sensitive attributes, we refer to females and males, respectively, as protected and non-protected groups in Adult data. Similarly, in Bank data, we refer to users between age 25 and 60 as protected and rest of the users as non-protected group. In our experiments, to obtain more reliable estimates of accuracy and fairness, we repeatedly split each dataset into a train (70%) and test (30%) set 5 times and report the average statistics for accuracy and fairness.\n\nMaximizing accuracy under fairness constraints. First, we experiment with a single binary sensitive attribute, gender and age, for respectively, the Adult and Bank data. For each dataset, we train several logistic regression and SVM classifiers (denoted by 'C-LR' and 'C-SVM', respectively), each subject to fairness constraints with different values of covariance threshold c (Section 3.2), and then empirically investigate the trade-off between accuracy and fairness. Fig. 2a shows the (empirical) decision boundary covariance against the relative loss incurred by the classifier. The 'relative loss' is normalized between the loss incurred by an unconstrained classifier and by the classifier with a covariance threshold of 0. Here, each pair of (covariance, loss) values is guaranteed to be Pareto optimal, since our problem formulation is convex. Additionally, Fig. 2b investigates the correspondence between decision boundary covariance and p%-rule computed on the training set, showing that, as desired: i) the lower the covariance, the higher the p%rule the classifiers satisfy and (ii) a 100%-rule maps to zero covariance.\n\nThen, we compare our approach to a well-known competing method from each of the two categories discussed in Section 1: preferential sampling approach [Kamiran and Calders, 2010], applied to logistic regression ('PS-LR') and SVM ('PS-SVM'), as an example of data pre-processing, and the regularized logistic regression ('R-LR') [Kamishima et al., 2011], as an example of modifying a classifier to limit unfairness. erage accuracy and the bottom panel the percentage of protected (dashed lines) and non-protected (solid lines) users in positive class against the average p%rule, as computed on test sets. We observe that: i) the performance of our classifiers (C-LR, C-SVM) and regularized logistic regression (R-LR) is comparable, ours are slightly better for Adult data (left column) while slightly worse for Bank data (right column). However, R-LR uses sensitive attribute values from the test set to make predictions, failing the disparate treatment test and potentially allowing for reverse discrimination [Ricci vs. DeStefano, 2009]; ii) the preferential sampling presents the worst performance and always achieves p%-rules under 80%; and, (iii) in the Adult data, all classifiers move non-protected users (males) to the negative class and protected users (females) to the positive class to achieve fairness, in contrast, in the Bank data, they only move non-protected (young and old) users originally labeled as positive to the negative class since it provides a smaller accuracy loss. However, the latter can be problematic: from a business perspective, a bank may be interested in finding potential subscribers rather than losing existing customers. This last observation motivates our second formulation (Section 3.3), which we experiment with later in this section.\n\nFinally, we experiment with non-binary (race) and several (gender and race) sensitive attributes in Adult dataset. We do not compare with competing methods since they cannot handle non-binary or several sensitive attributes. Fig. 3 summarizes the results by showing the accuracy and the percentage of subjects sharing each sensitive attribute value classified as positive against a multiplicative covariance factor a ∈ [0, 1] such that c = ac * , where c * is the unconstrained classifier covariance 3 (note that p%-rule is only defined for γ-LR (Acc) γ-LR (p%-rule) Fine-γ-LR (Acc) Fine-γ-LR (p%-rule) a binary sensitive feature). As expected, as the value of c decreases, the percentage of subjects in the positive class from sensitive attribute value groups become nearly equal 4 while the loss in accuracy is modest.\n\nMaximizing fairness under accuracy constraints. Next, we demonstrate that our second formulation (Section 3.3) can maximize fairness while precisely controlling loss in accuracy. To this end, we first train several logistic regression classifiers (denoted by 'γ-LR'), which minimize the decision boundary covariance subject to accuracy constraints over the entire dataset by solving problem (7) with increasing values of γ. Then, we train logistic regression classifiers (denoted by 'Fine-γ-LR') that minimize the decision boundary covariance subject to fine-grained accuracy constraints by solving problem (8). Here, we prevent the non-protected users that were classified as positive by the unconstrained logistic regression classifier from being classified as negative by constraining that their distance from decision boundary stays positive while learning the fair boundary. We then increase γ i = γ for the remaining users. In both cases, we increased the value of γ until we reach a 100%-rule during training. Fig. 4 summarizes the results for both datasets, by showing (a) the average accuracy (solid curves) and p%-rule (dashed curves) against γ, and (b) the percentage of non-protected (N-P, solid curves) and protected (P, dashed curves) users in the positive class against γ. We observe that, as we increase γ, the classifiers that constrain the overall training loss (γ-LR) remove non-protected users from the positive class and add protected users to the positive class, in contrast, the classifiers that prevent the non-protected users that were classified as positive in the unconstrained classifier from being classified as negative (Fine-γ-LR) add both protected and non-protected users to the poscompute the covariance threshold separately for each sensitive feature as ac * k . 4 The scarce representation of the race value 'Other' (only 0.8% of the data) hinders an accurate estimation of the decision boundary covariance and, as a result, the classifier does not reach perfect fairness with respect to this sensitive attribute value.\n\nitive class. As a consequence, the latter achieves lower accuracy for the same p%-rule.\n\n\nDISCUSSION & FUTURE WORK\n\nIn this paper, we introduced a novel measure of decision boundary fairness, which enables us to ensure fairness with respect to one or more sensitive attributes, in terms of both disparate treatment and disparate impact. We leverage this measure to derive two complementary formulations: one that maximizes accuracy subject to fairness constraints, and helps ensure compliance with a non-discrimination policy or law (e.g., a given p%-rule); and another one that maximizes fairness subject to accuracy constraints, and ensures fulfilling certain business needs (e.g., disparate impact's business necessity clause).\n\nOur framework opens many avenues for future work. For example, one could include fairness constraints in other supervised (e.g., regression, recommendation) as well as unsupervised (e.g., set selection, ranking) learning tasks. Further, while we note that a decreasing covariance threshold corresponds to an increasing (more fair) p%-rule, the relation between the two is only empirically observed. A precise mapping between covariance and p%-rule is quite challenging to derive analytically since it depends on the specific classifier and the dataset being used. Such a theoretical analysis would be an interesting future direction. Finally, in this paper we consider disparate impact as our notion of fairness with the assumption that the historical training data may contain biases against certain group(s). Since the actual proportions in positive class from different groups (e.g., males, females) in the ground-truth dataset are not available (we only have access to a biased dataset), ensuring equal proportions from each group in the positive class (removing disparate impact) serves as an attractive notion of fairness. However, in cases where the historical ground truth decisions are available, disparate impact can be explained by the means of the ground truth, and alternative notions of fairness, e.g., disparate mistreatment [Zafar et al., 2017], might be more suitable.\n\n\nA Particularizing the Fairness Constraints for SVM\n\nOne can specialize our fair classifier formulation proposed in (4) as:\n\nLinear SVM. A linear SVM distinguishes among classes using a linear hyperplane θ T x = 0. In this case, the parameter vector θ of the fair linear SVM can be found by solving the following quadratic program:\nminimize θ 2 + C n i=1 ξ i subject to y i θ T x i ≥ 1 − ξ i , ∀i ∈ {1, . . . , n} ξ i ≥ 0, ∀i ∈ {1, . . . , n}, 1 N N i=1 (z i −z) θ T x i ≤ c, 1 N N i=1 (z i −z) θ T x i ≥ −c,(9)\nwhere θ and ξ are the variables, θ 2 corresponds to the margin between the support vectors assigned to different classes, and C n i=1 ξ i penalizes the number of data points falling inside the margin. Nonlinear SVM. In a nonlinear SVM, the decision boundary takes the form θ T Φ(x) = 0, where Φ(·) is a nonlinear transformation that maps every feature vector x into a higher dimensional transformed feature space. Similarly as in the case of a linear SVM, one may think of finding the parameter vector θ by solving a constrained quadratic program similar to the one defined by Eq. (9). However, the dimensionality of the transformed feature space can be large, or even infinite, making the corresponding optimization problem difficult to solve. Fortunately, we can leverage the kernel trick [Schölkopf and Smola, 2002] both in the original optimization problem and the fairness inequalities, and resort instead to the dual form of the problem, which can be solved efficiently. In particular, the dual form is given by:\nminimize N i=1 α i + N i=1 α i y i (g α (x i ) + h α (x i )) subject to α i ≥ 0, ∀i ∈ {1, . . . , N }, N i=1 α i y i = 0, 1 N N i=1 (z i −z) g α (x i ) ≤ c, 1 N N i=1 (z i −z) g α (x i ) ≥ −c,(10)\nwhere α are the dual variables, g α (x i ) = N j=1 α j y j k(x i , x j ) can still be interpreted as a signed distance to the decision boundary in the transformed feature space, and h α (x i ) = N j=1 α j y j 1 C δ ij , where δ ij = 1 if i = j and δ ij = 0, otherwise. Here, k(x i , x j ) = φ(x i ), φ(x j ) denotes the inner product between a pair of transformed feature vectors and is often called the kernel function.\n\n\nB Additional Experiments\n\n\nB.1 Experiments on Non-linear Synthetic Data\n\nHere, we illustrate how the decision boundary of an non-linear classifier, a SVM with radial basis function (RBF) kernel, changes under fairness constraints. To this end, we generate 4,000 user binary class labels uniformly at random and assign a 2-dimensional user feature vector per label by drawing samples from p(x|y = 1, β) = Then, we generate each user's sensitive attribute z by applying the same rotation as detailed in Section 4.1. Figure 5 shows the decision boundaries provided by the SVM that maximizes accuracy under fairness constraints with c = 0 for two different correlation values, set by φ = π/4 and φ = π/8, in comparison with the unconstrained SVM. We observe that, in this case, the decision boundaries provided by the constrained SVMs are very different to the decision boundary provided by the unconstrained SVM, not simple shifts or rotations of the latter, and successfully reverse engineer the mechanism we used to generate the class labels and sensitive attributes.\n\n\nB.2 Experiments on Real Data\n\nAdditional Data Statistics. In this section, we show the distribution of sensitive features and class labels in our real-world datasets.\n\nAcc=0.94; p% rule=42%(π/4),12%(π/8) (a) Unconstrained Acc=0.83; p% rule=95%\n(b) φ = π/4\nAcc=0.60; p% rule=97% (c) φ = π/8 Figure 5: Decision boundaries for SVM classifier with RBF Kernel trained without fairness constraints (left) and with fairness constraints (c = 0) on two synthetic datasets with different correlation value between sensitive attribute values (crosses vs circles) and class labels (red vs green).  CV score as fairness measure. While evaluating the performance of our method in Section 4, we used p%-rule as the true measure of fairness, since it is a generalization of the 80%-rule advocated by US Equal Employment Opportunity Commission [Biddle, 2005] to quantify disparate impact. We would like to remark that this measure is closely related to another measure of fairness used by some of the previous works [Kamiran and Calders, 2009, Kamishima et al., 2011, Zemel et al., 2013 in this area, referred to as Calder-Verwer (CV) score by Kamishima et al. [2011]. In particular, the CV score is defined as the (absolute value of the) difference between the percentage of users sharing a particular sensitive attribute value that lie on one side of the decision boundary and the percentage of users not sharing that value lying on the same side, i.e., P (d θ (x) ≥ 0|z = 0)−P (d θ (x) ≥ 0|z = 1) .\n\nIn this section, we show that using CV score (instead of p%-rule) as a measure of fairness would yield similar results.\n\nFirst, we show that constraining the covariance between users' sensitive attributes ( Fig. 6a and Figure 6b), and the signed distance from the decision boundary, corresponds to an increasing relative loss and decreasing CV  score (a more fair decision boundary).\n\nNext, we show the performance of different methods based on the CV score (Fig, 6c and 7). The results in Fig.6c and 7 correspond to the ones shown in Fig. 2c and 4, where we took p%-rule as the measure of fairness. It can be seen that both measures of fairness (p%-rule and CV score) provide very similar trades-off in terms of fairness and accuracy.\n\nNotice that according to the definitions provided in Section 2.1, a decreasing CV score corresponds to an increasing p%-rule (and hence, a more fair decision boundary).\n\n\nProceedings of the 20 th International Conference on Artificial Intelligence and Statistics (AISTATS) 2017, Fort Lauderdale, Florida, USA. JMLR: W&CP volume 54. Copyright 2017 by the author(s).\n\nFigure 1 :\n1The solid light blue lines show the decision boundaries for logistic regressors without fairness constraints. The dashed lines show the decision boundaries for fair logistic regressors trained (a) to maximize accuracy under fairness constraints and (b) to maximize fairness under fine-grained accuracy constraints, which prevents users with z = 1 (circles) labeled as positive by the unconstrained classifier from being moved to the negative class.\n\nFigure 2 :Figure 3 :\n23Fig. 2csummarizes the results: the top panel shows av-[Maximizing accuracy under fairness constraints: single, binary sensitive attribute] Panels in (a) show the trade-off between the empirical covariance in Eq. 2 and the relative loss (with respect to the unconstrained classifier), for the Adult (top) and Bank (bottom) datasets. Here each pair of (covariance, loss) values is guaranteed to be Pareto optimal by construction. Panels in (b) show the correspondence between the empirical covariance and the p%-rule for classifiers trained under fairness constraints. Panels in (c) show the accuracy against p%-rule value (top) and the percentage of protected (dashed) and non-protected (solid) users in the positive class against the p%-rule value (bottom). [Maximizing accuracy under fairness constraints: non-binary and several sensitive attributes] The figure shows accuracy (top) and percentage of users in positive class (bottom) against a multiplicative factor a ∈ [0, 1] such that c = ac * , where c * denotes the unconstrained classifier covariance.\n\nFigure 4 :\n4[Maximizing fairness under accuracy constraints] Panels in (a) show accuracy (solid) and p%-rule value (dashed) against γ. Panels in (b) show the percentage of protected (P, dashed) and non-protected (N-P, solid) users in the positive class against γ.\n\n\n) + (1 − β)N ([−2; −2], [10 1; 1 3]) if y = 1, and p(x|y = −1, β) = βN ([4; −4], otherwise, where β ∈ {0, 1} is sampled from Bernoulli(0.5).\n\nFigure 7 :\n7[Maximizing fairness under accuracy constraints] Panels in (a) show the accuracy (solid) and CV score value (dashed) against γ. Panels in (b) show the percentage of protected (P, dashed) and non-protected (N-P, solid) users in the positive class against γ.\n\nFigure 6 :\n6[Maximizing accuracy under fairness constraints: single, binary sensitive attribute] Panels in (a) show the trade-off between the empirical covariance and the relative loss in accuracy (with respect to the unconstrained classifier), where each pair of (covariance, loss) values is guaranteed to be Pareto optimal by construction. Panels in (b) show the correspondence between the empirical covariance in Eq. 2 and the CV score for classifiers trained under fairness constraints for the Adult (top) and Bank (bottom) datasets. Panels in (c) show the accuracy against CV score value (top) and the percentage of protected (dashed) and non-protected (solid) users in the positive class against the CV score value (bottom).\n\nTable 2 :\n2Datasets details (binary sensitive attributes: gender and age).Sensitive Attribute y ≤ 50K > 50K \nTotal \nMales \n20,988 \n9,539 \n30,527 \nFemales \n13,026 \n1,669 \n14, 695 \nTotal \n34,014 \n11,208 \n45,222 \n\n(a) Adult dataset \n\nSensitive Attribute \nNo \nYes \nTotal \n25 ≤ age ≤ 60 \n35,240 3,970 39,210 \nage < 25 or age > 60 \n1,308 \n670 \n1,978 \nTotal \n36,548 4,640 41,188 \n\n(b) Bank dataset \n\n\n\nTable 3 :\n3Adult dataset (Non-binary sensitive attribute: race)Sensitive Attribute \ny ≤ 50K > 50K \nTotal \nAmerican-Indian/Eskimo \n382 \n53 \n435 \nAsian/Pacific-Islander \n934 \n369 \n1,303 \nWhite \n28,696 \n10,207 38, 903 \nBlack \n3,694 \n534 \n4, 228 \nOther \n308 \n45 \n353 \nTotal \n34,014 \n11,208 \n45,222 \n\nC-LR \nC-SVM \n\n\nFor non-linear convex margin-based classifiers like nonlinear SVM, equivalent of d θ (xi) is still convex in the transformed kernel space. See Appendix A for details.\nFor several sensitive features, we compute the initial covariance c * k for each of the sensitive feature k, and then\n\nAdult data. Adult data. http://tinyurl.com/UCI-Adult, 1996. Bank data. http://tinyurl.com/UCI-Bank, 2014.\n\nBig Data's Disparate Impact. S Barocas, A D Selbst, California Law Review. S. Barocas and A. D. Selbst. Big Data's Disparate Impact. California Law Review, 2016.\n\nBig Data Can Be Used To Violate Civil Rights Laws, and the FTC Agrees. E Bhandari, E. Bhandari. Big Data Can Be Used To Vio- late Civil Rights Laws, and the FTC Agrees. https://www.aclu.org/blog/free-future/big-data- can-be-used-violate-civil-rights-laws-and-ftc-agrees, 2016.\n\nAdverse Impact and Test Validation: A Practitioner's Guide to Valid and Defensible Employment Testing. D Biddle, GowerD. Biddle. Adverse Impact and Test Validation: A Practitioner's Guide to Valid and Defensible Em- ployment Testing. Gower, 2005.\n\nThree Naive Bayes Approaches for Discrimination-Free Classification. T Calders, S Verwer, Data Mining and Knowledge Discovery. T. Calders and S. Verwer. Three Naive Bayes Approaches for Discrimination-Free Classification. Data Mining and Knowledge Discovery, 2010.\n\nCivil Rights Act. Civil Rights Act of 1964, Title VII, Equal Employment Opportunities. Civil Rights Act. Civil Rights Act of 1964, Title VII, Equal Employment Opportunities, 1964.\n\nIdentifying and Attacking the Saddle Point Problem in High-dimensional Non-convex Optimization. Y N Dauphin, R Pascanu, C Gulcehre, K Cho, S Ganguli, Y Bengio, NIPS. Y. N. Dauphin, R. Pascanu, C. Gulcehre, K. Cho, S. Ganguli, and Y. Bengio. Identifying and Attack- ing the Saddle Point Problem in High-dimensional Non-convex Optimization. In NIPS, 2014.\n\nFairness Through Awareness. C Dwork, M Hardt, T Pitassi, O Reingold, ITCSC. C. Dwork, M. Hardt, T. Pitassi, and O. Reingold. Fair- ness Through Awareness. In ITCSC, 2012.\n\nCertifying and removing disparate impact. M Feldman, S A Friedler, J Moeller, C Scheidegger, S Venkatasubramanian, KDD. M. Feldman, S. A. Friedler, J. Moeller, C. Scheidegger, and S. Venkatasubramanian. Certifying and remov- ing disparate impact. In KDD, 2015.\n\nSatisfying Real-world Goals with Dataset Constraints. G Goh, A Cotter, M Gupta, M Friedlander, NIPS. G. Goh, A. Cotter, M. Gupta, and M. Friedlan- der. Satisfying Real-world Goals with Dataset Con- straints. In NIPS, 2016.\n\nClassifying without Discriminating. F Kamiran, T Calders, IC4. F. Kamiran and T. Calders. Classifying without Dis- criminating. In IC4, 2009.\n\nClassification with No Discrimination by Preferential Sampling. F Kamiran, T Calders, BENE-LEARN. F. Kamiran and T. Calders. Classification with No Discrimination by Preferential Sampling. In BENE- LEARN, 2010.\n\nFairness-aware Classifier with Prejudice Remover Regularizer. T Kamishima, S Akaho, H Asoh, J Sakuma, PADM. T. Kamishima, S. Akaho, H. Asoh, and J. Sakuma. Fairness-aware Classifier with Prejudice Remover Regularizer. In PADM, 2011.\n\nkNN as an Implementation of Situation Testing for Discrimination Discovery and Prevention. B T Luong, S Ruggieri, F Turini, KDD. B. T. Luong, S. Ruggieri, and F. Turini. kNN as an Implementation of Situation Testing for Discrimina- tion Discovery and Prevention. In KDD, 2011.\n\nBig Data: A Report on Algorithmic Systems, Opportunity, and Civil Rights. Executive Office of the President. The White House. C Muñoz, M Smith, D Patil, C. Muñoz, M. Smith, and D. Patil. Big Data: A Report on Algorithmic Systems, Opportunity, and Civil Rights. Executive Office of the President. The White House., 2016.\n\nDiscrimination-aware Data Mining. D Pedreschi, S Ruggieri, F Turini, KDD. D. Pedreschi, S. Ruggieri, and F. Turini. Discrimination-aware Data Mining. In KDD, 2008.\n\nBig Data: Seizing Opportunities, Preserving Values. Executive Office of the President. The White House. J Podesta, P Pritzker, E Moniz, J Holdren, J Zients, J. Podesta, P. Pritzker, E. Moniz, J. Holdren, and J. Zients. Big Data: Seizing Opportunities, Pre- serving Values. Executive Office of the President. The White House., 2014.\n\n. Ricci Vs, Destefano, U.S. Supreme CourtRicci vs. DeStefano. U.S. Supreme Court, 2009.\n\nA Multidisciplinary Survey on Discrimination Analysis. A Romei, S Ruggieri, KERA. Romei and S. Ruggieri. A Multidisciplinary Survey on Discrimination Analysis. KER, 2014.\n\nLearning with Kernels: Support Vector Machines, Regularization, Optimization, and Beyond. B Schölkopf, A J Smola, MIT pressB. Schölkopf and A. J. Smola. Learning with Kernels: Support Vector Machines, Regularization, Optimiza- tion, and Beyond. MIT press, 2002.\n\nDiscrimination in Online Ad Delivery. L Sweeney, ACM Queue. L. Sweeney. Discrimination in Online Ad Delivery. ACM Queue, 2013.\n\nFairness Beyond Disparate Treatment & Disparate Impact: Learning Classification without Disparate Mistreatment. M B Zafar, I Valera, M G Rodriguez, K P Gummadi, WWWM. B. Zafar, I. Valera, M. G. Rodriguez, and K. P. Gummadi. Fairness Beyond Disparate Treatment & Disparate Impact: Learning Classification without Disparate Mistreatment. In WWW, 2017.\n\nLearning Fair Representations. R Zemel, Y Wu, K Swersky, T Pitassi, C Dwork, ICML. R. Zemel, Y. Wu, K. Swersky, T. Pitassi, and C. Dwork. Learning Fair Representations. In ICML, 2013.\n", "annotations": {"author": "[{\"end\":142,\"start\":60},{\"end\":218,\"start\":143},{\"end\":303,\"start\":219},{\"end\":383,\"start\":304}]", "publisher": null, "author_last_name": "[{\"end\":80,\"start\":69},{\"end\":156,\"start\":150},{\"end\":241,\"start\":226},{\"end\":321,\"start\":314}]", "author_first_name": "[{\"end\":68,\"start\":60},{\"end\":149,\"start\":143},{\"end\":225,\"start\":219},{\"end\":311,\"start\":304},{\"end\":313,\"start\":312}]", "author_affiliation": "[{\"end\":141,\"start\":82},{\"end\":217,\"start\":158},{\"end\":302,\"start\":243},{\"end\":382,\"start\":323}]", "title": "[{\"end\":57,\"start\":1},{\"end\":440,\"start\":384}]", "venue": null, "abstract": "[{\"end\":1493,\"start\":442}]", "bib_ref": "[{\"attributes\":{\"ref_id\":\"b2\"},\"end\":1945,\"start\":1929},{\"attributes\":{\"ref_id\":\"b16\"},\"end\":1980,\"start\":1959},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":2000,\"start\":1980},{\"attributes\":{\"ref_id\":\"b20\"},\"end\":2033,\"start\":2018},{\"end\":2291,\"start\":2267},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":2424,\"start\":2398},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":3499,\"start\":3475},{\"attributes\":{\"ref_id\":\"b17\"},\"end\":3752,\"start\":3725},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":4691,\"start\":4665},{\"attributes\":{\"ref_id\":\"b3\"},\"end\":5227,\"start\":5213},{\"attributes\":{\"ref_id\":\"b18\"},\"end\":7387,\"start\":7361},{\"attributes\":{\"ref_id\":\"b7\"},\"end\":7547,\"start\":7528},{\"attributes\":{\"ref_id\":\"b8\"},\"end\":7569,\"start\":7547},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":7596,\"start\":7569},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":8139,\"start\":8114},{\"attributes\":{\"ref_id\":\"b12\"},\"end\":8163,\"start\":8139},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":8181,\"start\":8163},{\"attributes\":{\"ref_id\":\"b12\"},\"end\":8248,\"start\":8207},{\"attributes\":{\"ref_id\":\"b22\"},\"end\":8437,\"start\":8418},{\"attributes\":{\"ref_id\":\"b7\"},\"end\":8470,\"start\":8451},{\"attributes\":{\"ref_id\":\"b21\"},\"end\":9931,\"start\":9912},{\"attributes\":{\"ref_id\":\"b21\"},\"end\":10088,\"start\":10068},{\"attributes\":{\"ref_id\":\"b11\"},\"end\":10177,\"start\":10151},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":10219,\"start\":10194},{\"attributes\":{\"ref_id\":\"b13\"},\"end\":10251,\"start\":10232},{\"attributes\":{\"ref_id\":\"b12\"},\"end\":10291,\"start\":10268},{\"attributes\":{\"ref_id\":\"b22\"},\"end\":10331,\"start\":10312},{\"attributes\":{\"ref_id\":\"b8\"},\"end\":10362,\"start\":10341},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":10418,\"start\":10401},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":12476,\"start\":12452},{\"attributes\":{\"ref_id\":\"b3\"},\"end\":12801,\"start\":12787},{\"attributes\":{\"ref_id\":\"b6\"},\"end\":13907,\"start\":13885},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":19294,\"start\":19268},{\"attributes\":{\"ref_id\":\"b3\"},\"end\":22115,\"start\":22101},{\"end\":26002,\"start\":25984},{\"attributes\":{\"ref_id\":\"b11\"},\"end\":28787,\"start\":28760},{\"attributes\":{\"ref_id\":\"b12\"},\"end\":28961,\"start\":28937},{\"attributes\":{\"ref_id\":\"b17\"},\"end\":29646,\"start\":29619},{\"attributes\":{\"ref_id\":\"b21\"},\"end\":35357,\"start\":35337},{\"attributes\":{\"ref_id\":\"b19\"},\"end\":36714,\"start\":36687},{\"attributes\":{\"ref_id\":\"b3\"},\"end\":39445,\"start\":39431},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":39629,\"start\":39603},{\"attributes\":{\"ref_id\":\"b12\"},\"end\":39653,\"start\":39629},{\"attributes\":{\"ref_id\":\"b22\"},\"end\":39673,\"start\":39653},{\"attributes\":{\"ref_id\":\"b12\"},\"end\":39754,\"start\":39731}]", "figure": "[{\"attributes\":{\"id\":\"fig_0\"},\"end\":41191,\"start\":40996},{\"attributes\":{\"id\":\"fig_2\"},\"end\":41653,\"start\":41192},{\"attributes\":{\"id\":\"fig_3\"},\"end\":42735,\"start\":41654},{\"attributes\":{\"id\":\"fig_4\"},\"end\":43000,\"start\":42736},{\"attributes\":{\"id\":\"fig_5\"},\"end\":43143,\"start\":43001},{\"attributes\":{\"id\":\"fig_6\"},\"end\":43413,\"start\":43144},{\"attributes\":{\"id\":\"fig_7\"},\"end\":44145,\"start\":43414},{\"attributes\":{\"id\":\"tab_1\",\"type\":\"table\"},\"end\":44540,\"start\":44146},{\"attributes\":{\"id\":\"tab_2\",\"type\":\"table\"},\"end\":44852,\"start\":44541}]", "paragraph": "[{\"end\":2100,\"start\":1509},{\"end\":2766,\"start\":2102},{\"end\":3753,\"start\":2768},{\"end\":4947,\"start\":3755},{\"end\":5879,\"start\":4949},{\"end\":7185,\"start\":5881},{\"end\":7462,\"start\":7187},{\"end\":8025,\"start\":7464},{\"end\":8406,\"start\":8027},{\"end\":8842,\"start\":8408},{\"end\":9216,\"start\":8844},{\"end\":10091,\"start\":9218},{\"end\":10767,\"start\":10127},{\"end\":10934,\"start\":10798},{\"end\":11881,\"start\":10936},{\"end\":12477,\"start\":11883},{\"end\":12692,\"start\":12501},{\"end\":13169,\"start\":12694},{\"end\":13261,\"start\":13258},{\"end\":14097,\"start\":13263},{\"end\":14596,\"start\":14114},{\"end\":14724,\"start\":14598},{\"end\":15004,\"start\":14792},{\"end\":15127,\"start\":15122},{\"end\":15322,\"start\":15178},{\"end\":15755,\"start\":15382},{\"end\":15833,\"start\":15757},{\"end\":15981,\"start\":15884},{\"end\":16249,\"start\":16032},{\"end\":16408,\"start\":16251},{\"end\":17099,\"start\":16508},{\"end\":17796,\"start\":17101},{\"end\":17866,\"start\":17798},{\"end\":18021,\"start\":17868},{\"end\":18308,\"start\":18064},{\"end\":18530,\"start\":18425},{\"end\":19454,\"start\":18569},{\"end\":19662,\"start\":19456},{\"end\":20169,\"start\":19742},{\"end\":20374,\"start\":20171},{\"end\":20986,\"start\":20411},{\"end\":21628,\"start\":21094},{\"end\":22072,\"start\":21643},{\"end\":22303,\"start\":22074},{\"end\":22818,\"start\":22337},{\"end\":23323,\"start\":22820},{\"end\":24975,\"start\":23325},{\"end\":25269,\"start\":24977},{\"end\":25719,\"start\":25271},{\"end\":25867,\"start\":25721},{\"end\":26941,\"start\":25896},{\"end\":27475,\"start\":26943},{\"end\":28608,\"start\":27477},{\"end\":30384,\"start\":28610},{\"end\":31206,\"start\":30386},{\"end\":33263,\"start\":31208},{\"end\":33352,\"start\":33265},{\"end\":33995,\"start\":33381},{\"end\":35382,\"start\":33997},{\"end\":35507,\"start\":35437},{\"end\":35715,\"start\":35509},{\"end\":36914,\"start\":35896},{\"end\":37532,\"start\":37112},{\"end\":38601,\"start\":37608},{\"end\":38770,\"start\":38634},{\"end\":38847,\"start\":38772},{\"end\":40088,\"start\":38860},{\"end\":40209,\"start\":40090},{\"end\":40473,\"start\":40211},{\"end\":40825,\"start\":40475},{\"end\":40995,\"start\":40827}]", "formula": "[{\"attributes\":{\"id\":\"formula_0\"},\"end\":13257,\"start\":13170},{\"attributes\":{\"id\":\"formula_1\"},\"end\":14760,\"start\":14725},{\"attributes\":{\"id\":\"formula_2\"},\"end\":15121,\"start\":15005},{\"attributes\":{\"id\":\"formula_3\"},\"end\":15177,\"start\":15128},{\"attributes\":{\"id\":\"formula_4\"},\"end\":15381,\"start\":15323},{\"attributes\":{\"id\":\"formula_5\"},\"end\":15883,\"start\":15834},{\"attributes\":{\"id\":\"formula_6\"},\"end\":16507,\"start\":16409},{\"attributes\":{\"id\":\"formula_7\"},\"end\":18063,\"start\":18022},{\"attributes\":{\"id\":\"formula_8\"},\"end\":18424,\"start\":18309},{\"attributes\":{\"id\":\"formula_9\"},\"end\":19741,\"start\":19663},{\"attributes\":{\"id\":\"formula_10\"},\"end\":20410,\"start\":20375},{\"attributes\":{\"id\":\"formula_11\"},\"end\":21093,\"start\":20987},{\"attributes\":{\"id\":\"formula_12\"},\"end\":35895,\"start\":35716},{\"attributes\":{\"id\":\"formula_13\"},\"end\":37111,\"start\":36915},{\"attributes\":{\"id\":\"formula_14\"},\"end\":38859,\"start\":38848}]", "table_ref": "[{\"end\":7183,\"start\":7176},{\"end\":9143,\"start\":9136},{\"end\":10436,\"start\":10429}]", "section_header": "[{\"attributes\":{\"n\":\"1\"},\"end\":1507,\"start\":1495},{\"end\":10125,\"start\":10094},{\"attributes\":{\"n\":\"2\"},\"end\":10796,\"start\":10770},{\"attributes\":{\"n\":\"2.1\"},\"end\":12499,\"start\":12480},{\"attributes\":{\"n\":\"3\"},\"end\":14112,\"start\":14100},{\"attributes\":{\"n\":\"3.1\"},\"end\":14790,\"start\":14762},{\"attributes\":{\"n\":\"3.2\"},\"end\":16030,\"start\":15984},{\"attributes\":{\"n\":\"3.3\"},\"end\":18567,\"start\":18533},{\"attributes\":{\"n\":\"4\"},\"end\":21641,\"start\":21631},{\"attributes\":{\"n\":\"4.1\"},\"end\":22335,\"start\":22306},{\"attributes\":{\"n\":\"4.2\"},\"end\":25894,\"start\":25870},{\"attributes\":{\"n\":\"5\"},\"end\":33379,\"start\":33355},{\"end\":35435,\"start\":35385},{\"end\":37559,\"start\":37535},{\"end\":37606,\"start\":37562},{\"end\":38632,\"start\":38604},{\"end\":41203,\"start\":41193},{\"end\":41675,\"start\":41655},{\"end\":42747,\"start\":42737},{\"end\":43155,\"start\":43145},{\"end\":43425,\"start\":43415},{\"end\":44156,\"start\":44147},{\"end\":44551,\"start\":44542}]", "table": "[{\"end\":44540,\"start\":44221},{\"end\":44852,\"start\":44605}]", "figure_caption": "[{\"end\":41191,\"start\":40998},{\"end\":41653,\"start\":41205},{\"end\":42735,\"start\":41678},{\"end\":43000,\"start\":42749},{\"end\":43143,\"start\":43003},{\"end\":43413,\"start\":43157},{\"end\":44145,\"start\":43427},{\"end\":44221,\"start\":44158},{\"end\":44605,\"start\":44553}]", "figure_ref": "[{\"attributes\":{\"ref_id\":\"fig_2\"},\"end\":23653,\"start\":23646},{\"attributes\":{\"ref_id\":\"fig_2\"},\"end\":24556,\"start\":24549},{\"end\":27954,\"start\":27947},{\"end\":28350,\"start\":28343},{\"end\":30617,\"start\":30611},{\"attributes\":{\"ref_id\":\"fig_4\"},\"end\":32231,\"start\":32225},{\"end\":38057,\"start\":38049},{\"end\":38902,\"start\":38894},{\"attributes\":{\"ref_id\":\"fig_7\"},\"end\":40318,\"start\":40297},{\"attributes\":{\"ref_id\":\"fig_6\"},\"end\":40563,\"start\":40548},{\"attributes\":{\"ref_id\":\"fig_7\"},\"end\":40586,\"start\":40580},{\"end\":40632,\"start\":40625}]", "bib_author_first_name": "[{\"end\":45276,\"start\":45275},{\"end\":45287,\"start\":45286},{\"end\":45289,\"start\":45288},{\"end\":45481,\"start\":45480},{\"end\":45791,\"start\":45790},{\"end\":46005,\"start\":46004},{\"end\":46016,\"start\":46015},{\"end\":46479,\"start\":46478},{\"end\":46481,\"start\":46480},{\"end\":46492,\"start\":46491},{\"end\":46503,\"start\":46502},{\"end\":46515,\"start\":46514},{\"end\":46522,\"start\":46521},{\"end\":46533,\"start\":46532},{\"end\":46766,\"start\":46765},{\"end\":46775,\"start\":46774},{\"end\":46784,\"start\":46783},{\"end\":46795,\"start\":46794},{\"end\":46952,\"start\":46951},{\"end\":46963,\"start\":46962},{\"end\":46965,\"start\":46964},{\"end\":46977,\"start\":46976},{\"end\":46988,\"start\":46987},{\"end\":47003,\"start\":47002},{\"end\":47226,\"start\":47225},{\"end\":47233,\"start\":47232},{\"end\":47243,\"start\":47242},{\"end\":47252,\"start\":47251},{\"end\":47432,\"start\":47431},{\"end\":47443,\"start\":47442},{\"end\":47603,\"start\":47602},{\"end\":47614,\"start\":47613},{\"end\":47813,\"start\":47812},{\"end\":47826,\"start\":47825},{\"end\":47835,\"start\":47834},{\"end\":47843,\"start\":47842},{\"end\":48076,\"start\":48075},{\"end\":48078,\"start\":48077},{\"end\":48087,\"start\":48086},{\"end\":48099,\"start\":48098},{\"end\":48389,\"start\":48388},{\"end\":48398,\"start\":48397},{\"end\":48407,\"start\":48406},{\"end\":48618,\"start\":48617},{\"end\":48631,\"start\":48630},{\"end\":48643,\"start\":48642},{\"end\":48853,\"start\":48852},{\"end\":48864,\"start\":48863},{\"end\":48876,\"start\":48875},{\"end\":48885,\"start\":48884},{\"end\":48896,\"start\":48895},{\"end\":49226,\"start\":49225},{\"end\":49235,\"start\":49234},{\"end\":49433,\"start\":49432},{\"end\":49446,\"start\":49445},{\"end\":49448,\"start\":49447},{\"end\":49644,\"start\":49643},{\"end\":49846,\"start\":49845},{\"end\":49848,\"start\":49847},{\"end\":49857,\"start\":49856},{\"end\":49867,\"start\":49866},{\"end\":49869,\"start\":49868},{\"end\":49882,\"start\":49881},{\"end\":49884,\"start\":49883},{\"end\":50116,\"start\":50115},{\"end\":50125,\"start\":50124},{\"end\":50131,\"start\":50130},{\"end\":50142,\"start\":50141},{\"end\":50153,\"start\":50152}]", "bib_author_last_name": "[{\"end\":45284,\"start\":45277},{\"end\":45296,\"start\":45290},{\"end\":45490,\"start\":45482},{\"end\":45798,\"start\":45792},{\"end\":46013,\"start\":46006},{\"end\":46023,\"start\":46017},{\"end\":46489,\"start\":46482},{\"end\":46500,\"start\":46493},{\"end\":46512,\"start\":46504},{\"end\":46519,\"start\":46516},{\"end\":46530,\"start\":46523},{\"end\":46540,\"start\":46534},{\"end\":46772,\"start\":46767},{\"end\":46781,\"start\":46776},{\"end\":46792,\"start\":46785},{\"end\":46804,\"start\":46796},{\"end\":46960,\"start\":46953},{\"end\":46974,\"start\":46966},{\"end\":46985,\"start\":46978},{\"end\":47000,\"start\":46989},{\"end\":47022,\"start\":47004},{\"end\":47230,\"start\":47227},{\"end\":47240,\"start\":47234},{\"end\":47249,\"start\":47244},{\"end\":47264,\"start\":47253},{\"end\":47440,\"start\":47433},{\"end\":47451,\"start\":47444},{\"end\":47611,\"start\":47604},{\"end\":47622,\"start\":47615},{\"end\":47823,\"start\":47814},{\"end\":47832,\"start\":47827},{\"end\":47840,\"start\":47836},{\"end\":47850,\"start\":47844},{\"end\":48084,\"start\":48079},{\"end\":48096,\"start\":48088},{\"end\":48106,\"start\":48100},{\"end\":48395,\"start\":48390},{\"end\":48404,\"start\":48399},{\"end\":48413,\"start\":48408},{\"end\":48628,\"start\":48619},{\"end\":48640,\"start\":48632},{\"end\":48650,\"start\":48644},{\"end\":48861,\"start\":48854},{\"end\":48873,\"start\":48865},{\"end\":48882,\"start\":48877},{\"end\":48893,\"start\":48886},{\"end\":48903,\"start\":48897},{\"end\":49091,\"start\":49083},{\"end\":49102,\"start\":49093},{\"end\":49232,\"start\":49227},{\"end\":49244,\"start\":49236},{\"end\":49443,\"start\":49434},{\"end\":49454,\"start\":49449},{\"end\":49652,\"start\":49645},{\"end\":49854,\"start\":49849},{\"end\":49864,\"start\":49858},{\"end\":49879,\"start\":49870},{\"end\":49892,\"start\":49885},{\"end\":50122,\"start\":50117},{\"end\":50128,\"start\":50126},{\"end\":50139,\"start\":50132},{\"end\":50150,\"start\":50143},{\"end\":50159,\"start\":50154}]", "bib_entry": "[{\"attributes\":{\"id\":\"b0\"},\"end\":45244,\"start\":45139},{\"attributes\":{\"id\":\"b1\",\"matched_paper_id\":143133374},\"end\":45407,\"start\":45246},{\"attributes\":{\"id\":\"b2\"},\"end\":45685,\"start\":45409},{\"attributes\":{\"id\":\"b3\"},\"end\":45933,\"start\":45687},{\"attributes\":{\"id\":\"b4\",\"matched_paper_id\":12856537},\"end\":46199,\"start\":45935},{\"attributes\":{\"id\":\"b5\"},\"end\":46380,\"start\":46201},{\"attributes\":{\"id\":\"b6\",\"matched_paper_id\":11657534},\"end\":46735,\"start\":46382},{\"attributes\":{\"id\":\"b7\",\"matched_paper_id\":13496699},\"end\":46907,\"start\":46737},{\"attributes\":{\"id\":\"b8\",\"matched_paper_id\":2077168},\"end\":47169,\"start\":46909},{\"attributes\":{\"id\":\"b9\",\"matched_paper_id\":3115038},\"end\":47393,\"start\":47171},{\"attributes\":{\"id\":\"b10\",\"matched_paper_id\":1102398},\"end\":47536,\"start\":47395},{\"attributes\":{\"id\":\"b11\",\"matched_paper_id\":1003474},\"end\":47748,\"start\":47538},{\"attributes\":{\"id\":\"b12\",\"matched_paper_id\":10352172},\"end\":47982,\"start\":47750},{\"attributes\":{\"id\":\"b13\",\"matched_paper_id\":10494441},\"end\":48260,\"start\":47984},{\"attributes\":{\"id\":\"b14\"},\"end\":48581,\"start\":48262},{\"attributes\":{\"id\":\"b15\",\"matched_paper_id\":1430128},\"end\":48746,\"start\":48583},{\"attributes\":{\"id\":\"b16\"},\"end\":49079,\"start\":48748},{\"attributes\":{\"id\":\"b17\"},\"end\":49168,\"start\":49081},{\"attributes\":{\"id\":\"b18\"},\"end\":49340,\"start\":49170},{\"attributes\":{\"id\":\"b19\"},\"end\":49603,\"start\":49342},{\"attributes\":{\"id\":\"b20\",\"matched_paper_id\":23044927},\"end\":49731,\"start\":49605},{\"attributes\":{\"id\":\"b21\"},\"end\":50082,\"start\":49733},{\"attributes\":{\"id\":\"b22\",\"matched_paper_id\":490669},\"end\":50267,\"start\":50084}]", "bib_title": "[{\"end\":45273,\"start\":45246},{\"end\":46002,\"start\":45935},{\"end\":46476,\"start\":46382},{\"end\":46763,\"start\":46737},{\"end\":46949,\"start\":46909},{\"end\":47223,\"start\":47171},{\"end\":47429,\"start\":47395},{\"end\":47600,\"start\":47538},{\"end\":47810,\"start\":47750},{\"end\":48073,\"start\":47984},{\"end\":48615,\"start\":48583},{\"end\":49641,\"start\":49605},{\"end\":50113,\"start\":50084}]", "bib_author": "[{\"end\":45286,\"start\":45275},{\"end\":45298,\"start\":45286},{\"end\":45492,\"start\":45480},{\"end\":45800,\"start\":45790},{\"end\":46015,\"start\":46004},{\"end\":46025,\"start\":46015},{\"end\":46491,\"start\":46478},{\"end\":46502,\"start\":46491},{\"end\":46514,\"start\":46502},{\"end\":46521,\"start\":46514},{\"end\":46532,\"start\":46521},{\"end\":46542,\"start\":46532},{\"end\":46774,\"start\":46765},{\"end\":46783,\"start\":46774},{\"end\":46794,\"start\":46783},{\"end\":46806,\"start\":46794},{\"end\":46962,\"start\":46951},{\"end\":46976,\"start\":46962},{\"end\":46987,\"start\":46976},{\"end\":47002,\"start\":46987},{\"end\":47024,\"start\":47002},{\"end\":47232,\"start\":47225},{\"end\":47242,\"start\":47232},{\"end\":47251,\"start\":47242},{\"end\":47266,\"start\":47251},{\"end\":47442,\"start\":47431},{\"end\":47453,\"start\":47442},{\"end\":47613,\"start\":47602},{\"end\":47624,\"start\":47613},{\"end\":47825,\"start\":47812},{\"end\":47834,\"start\":47825},{\"end\":47842,\"start\":47834},{\"end\":47852,\"start\":47842},{\"end\":48086,\"start\":48075},{\"end\":48098,\"start\":48086},{\"end\":48108,\"start\":48098},{\"end\":48397,\"start\":48388},{\"end\":48406,\"start\":48397},{\"end\":48415,\"start\":48406},{\"end\":48630,\"start\":48617},{\"end\":48642,\"start\":48630},{\"end\":48652,\"start\":48642},{\"end\":48863,\"start\":48852},{\"end\":48875,\"start\":48863},{\"end\":48884,\"start\":48875},{\"end\":48895,\"start\":48884},{\"end\":48905,\"start\":48895},{\"end\":49093,\"start\":49083},{\"end\":49104,\"start\":49093},{\"end\":49234,\"start\":49225},{\"end\":49246,\"start\":49234},{\"end\":49445,\"start\":49432},{\"end\":49456,\"start\":49445},{\"end\":49654,\"start\":49643},{\"end\":49856,\"start\":49845},{\"end\":49866,\"start\":49856},{\"end\":49881,\"start\":49866},{\"end\":49894,\"start\":49881},{\"end\":50124,\"start\":50115},{\"end\":50130,\"start\":50124},{\"end\":50141,\"start\":50130},{\"end\":50152,\"start\":50141},{\"end\":50161,\"start\":50152}]", "bib_venue": "[{\"end\":45149,\"start\":45139},{\"end\":45319,\"start\":45298},{\"end\":45478,\"start\":45409},{\"end\":45788,\"start\":45687},{\"end\":46060,\"start\":46025},{\"end\":46286,\"start\":46201},{\"end\":46546,\"start\":46542},{\"end\":46811,\"start\":46806},{\"end\":47027,\"start\":47024},{\"end\":47270,\"start\":47266},{\"end\":47456,\"start\":47453},{\"end\":47634,\"start\":47624},{\"end\":47856,\"start\":47852},{\"end\":48111,\"start\":48108},{\"end\":48386,\"start\":48262},{\"end\":48655,\"start\":48652},{\"end\":48850,\"start\":48748},{\"end\":49223,\"start\":49170},{\"end\":49430,\"start\":49342},{\"end\":49663,\"start\":49654},{\"end\":49843,\"start\":49733},{\"end\":50165,\"start\":50161}]"}}}, "year": 2023, "month": 12, "day": 17}