{"id": 88520753, "updated": "2023-09-28 07:37:59.007", "metadata": {"title": "Quantifying Distributional Model Risk via Optimal Transport", "authors": "[{\"first\":\"Jose\",\"last\":\"Blanchet\",\"middle\":[]},{\"first\":\"Karthyek\",\"last\":\"Murthy\",\"middle\":[\"R.\",\"A.\"]}]", "venue": null, "journal": "Risk Management eJournal", "publication_date": {"year": 2016, "month": null, "day": null}, "abstract": "This paper deals with the problem of quantifying the impact of model misspecification when computing general expected values of interest. The methodology that we propose is applicable in great generality, in particular, we provide examples involving path dependent expectations of stochastic processes. Our approach consists in computing bounds for the expectation of interest regardless of the probability measure used, as long as the measure lies within a prescribed tolerance measured in terms of a flexible class of distances from a suitable baseline model. These distances, based on optimal transportation between probability measures, include Wasserstein's distances as particular cases. The proposed methodology is well-suited for risk analysis, as we demonstrate with a number of applications. We also discuss how to estimate the tolerance region non-parametrically using Skorokhod-type embeddings in some of these applications.", "fields_of_study": "[\"Mathematics\"]", "external_ids": {"arxiv": "1604.01446", "mag": "2963897698", "acl": null, "pubmed": null, "pubmedcentral": null, "dblp": "journals/mor/BlanchetM19", "doi": "10.2139/ssrn.2759640"}}, "content": {"source": {"pdf_hash": "e1182a2c17c55ffd2cb6d5622332a1e12ef4cf7f", "pdf_src": "ElsevierPush", "pdf_uri": null, "oa_url_match": false, "oa_info": {"license": null, "open_access_url": "http://arxiv.org/pdf/1604.01446", "status": "GREEN"}}, "grobid": {"id": "50a3196760ab529274c6575e094b43ad0d9a460a", "type": "plain-text", "url": "s3://ai2-s2-pdf-extraction-prod/parse-results/s2orc_worker/e1182a2c17c55ffd2cb6d5622332a1e12ef4cf7f.txt", "contents": "\nQUANTIFYING DISTRIBUTIONAL MODEL RISK VIA OPTIMAL TRANSPORT\n\n\nJose Blanchet \nColumbia University\n\n\nKarthyek Murthy \nColumbia University\n\n\nQUANTIFYING DISTRIBUTIONAL MODEL RISK VIA OPTIMAL TRANSPORT\nElectronic copy available at: MSC 60G07, 60F99, and 62P05.Model riskdistributional robustnesstransport metricWasserstein distancesdualityKullback-Liebler divergencesruin probabilitiesdiffusion approximations\nThis paper deals with the problem of quantifying the impact of model misspecification when computing general expected values of interest. The methodology that we propose is applicable in great generality, in particular, we provide examples involving path-dependent expectations of stochastic processes. Our approach consists in computing bounds for the expectation of interest regardless of the probability measure used, as long as the measure lies within a prescribed tolerance measured in terms of a flexible class of distances from a suitable baseline model. These distances, based on optimal transportation between probability measures, include Wasserstein's distances as particular cases. The proposed methodology is well-suited for risk analysis, as we demonstrate with a number of applications. We also discuss how to estimate the tolerance region non-parametrically using Skorokhod-type embeddings in some of these applications.\n\nIntroduction\n\nOne of the most ubiquitous applications of probability is the evaluation of performance or risk by means of computations such as Ef (X) = f dP for a given probability measure P , a function f , and a random element X. In classical applications, such as in finance, insurance, or queueing analysis, X is a stochastic process and f is a path dependent functional.\n\nThe work of the modeler is to choose a probability model P which is both descriptive and, yet, tractable. However, a substantial challenge, which arises virtually always, is that the model used, P , will in general be subject to misspecification; either because of lack of data or by the choice of specific parametric distributions.\n\nThe goal of this paper is to assess the impact of model misspecification when computing Ef (X).\n\nThe importance of constructing systematic methods that provide performance estimates which are robust to model misspecification is emphasized in the academic response to the Basel Accord 3.5: \"In its broadest sense, robustness has to do with (in)sensitivity to underlying model deviations and/or data changes. Furthermore, here, a whole new field of research is opening up; at the moment, it is difficult to point to the right approach.\"\n\nThe results of this paper allow the modeler to provide a bound for the expectation of interest regardless of the probability measure used as long as such measure remains within a prescribed tolerance of a suitable baseline model.\n\nThe bounds that we obtain are applicable in great generality, allowing us to use our results in settings which include continuous-time stochastic processes and path dependent expectations in various domains of applications, including insurance and queueing.\n\nLet us describe the approach that we consider more precisely. Our starting point is a technique that has been actively pursued in the literature (to be reviewed momentarily), which involves considering a family of plausible models P, and computing distributionally robust bounds as the solution to the optimization problem (1) sup\nP ∈P f dP,\nover all probability measures in P. The motivation, as mentioned earlier, is to measure the highest possible risk regardless of the probability measure in P used. A canonical object that appears naturally in specifying the family P is the neighborhood {P : d(P, µ) ≤ δ}, where µ is a chosen baseline model and δ is a non-negative tolerance level. Here, d is a metric that measures discrepancy between probability measures, and the tolerance δ interpolates between no ambiguity (δ = 0) and high levels of model uncertainty (δ large). The family of plausible models, P, can then be specified as a single neighborhood (or) a collection of such plausible neighborhoods. In this paper, we choose d in terms of a transport metric (defined precisely in Section 2), and analyze the solvability of (1) and discuss various implications.\n\nBeing a flexible class of distances that include the popular Wasserstein distances as a special case, transport metrics allow easy interpretation in terms of minimum cost associated with transporting mass between probability measures, and have been widely used in probability theory and its applications (see, for example, [43,44,53,2] for a massive collection of classical applications and [7,25,40,54,21,15,50,51,22] for a sample of growing list of new applications).\n\nRelative entropy (or) Kullback-Liebler (KL) divergence, despite not being a proper metric, has been the most popular choice for d, thanks to the tractability of (1) when d is chosen as relative entropy or other likelihood based metrics (see [14,36,23,4] for the use in robust performance analysis, and [26,32,41,38,33,9,55,34,29,8] and references therein for applications to distributionally robust optimization). Our study in this paper is directly motivated to address the shortcoming that many of these earlier works acknowledge: the absolute continuity requirement of relative entropy; there can be two probability measures µ and ν that produce the same samples with high probability, despite having the relative entropy between µ and ν as infinite. Such absolute continuity requirements could be very limiting, particularly so when the models of interest are stochastic processes defined over time. For instance, Brownian motion, because of its tractability in computing path-dependent expectations, is used as approximation of piecewise linear or piecewise constant processes (such as random walk). However, the use of the relative entropy would not be appropriate to accommodate these settings because the likelihood ratio between Brownian motion and any piecewise differentiable process is not well defined.\n\nAnother instance which shows the limitations of the KL divergence arises when using an Itô diffusion as a baseline model. In such case, the region P contains only Itô diffusions with the same volatility parameter as the underlying baseline model, thus failing to model volatility uncertainty.\n\nThe use of a distance d based on a transport metric (or) Wasserstein's distance, as we do here, also allows to incorporate the use of tractable surrogate models such as Brownian motion. For instance, consider a classical insurance risk problem in which the modeler has sufficient information on claim sizes (for example, in car insurance) to build a non-parametric reserve model. But the modeler is interested in path-dependent calculations of the reserve process (such as ruin probabilities), so she might decide to use Brownian motion based approximation as a tractable surrogate model which allows to compute Ef (X) easily. A key feature of the Wasserstein's distances, is that it is computed in terms of a so-called optimal coupling. So, the modeler can use any good coupling to provide a valid bound for the tolerance parameter δ.\n\nThe use of tractable surrogate models, such as Brownian motion, diffusions, and reflected Brownian motion, etc., has enabled the analysis of otherwise intractable complex stochastic systems. As we shall illustrate, the bounds that we obtain have the benefit of being computable directly in terms of the underlying tractable surrogate model. In addition, the calibration of the tolerance parameter takes advantage of well studied coupling techniques (such as Skorokhod embedding). So, we believe that the approach we propose naturally builds on the knowledge that has been developed by the applied probability community.\n\nWe summarize our main contributions in this paper below: a) Assuming that X takes values in a Polish space, and using a wide range of transport metrics (that include the popular Wasserstein's distances as special cases) we arrive at a dual formulation for the optimization problem in (1), and prove strong duality -see Theorem 1. b) Despite the infinite dimensional nature of the optimization problem in (1), we show that the dual problem admits a one dimensional reformulation which is easy to work with. Using the result in a), for an importance class of functions f , we show how to characterize an optimizer P * in terms of a coupling involving µ and the chosen transport metric -see Remark 2 and Section 2.3.1. c) We apply our results to various problems such as robust evaluation of ruin probabilities using Brownian motion as a tractable surrogate (see Section 3), general multidimensional firstpassage time probabilities (see Section 5.1), and optimal decision making in the presence of model ambiguity (see Section 5.2). d) We discuss a non-parametric method, based on a Skorokhod-type embedding, which allows to choose δ (these are particularly useful in tractable surrogate settings discussed earlier). The specific discussion of the Skorokhod embedding for calibration is given in Appendix A. We also discuss how δ can be chosen in a model misspecification context, see the discussion at the end of Section 5.1.\n\nIn a recent paper, [20], the authors also consider distributionally robust optimization using a very specific Wasserstein's distance. Similar formulations using Wasserstein distance based ambiguity sets have been considered in [42] and [58] as well. The form of the optimization problem that we consider here is basically the same as that considered in [20], but there are important differences that are worth highlighting. In [20], the authors concentrate on the specific case of baseline measure being empirical distribution of samples obtained from a distribution supported in R d , and the function f possessing a special structure. In contrast, we allow the baseline measure µ to be supported on general Polish spaces and study a wide class of functions f (upper semicontinuous and integrable with respect to µ). The use of the Skorokhod embeddings that we consider here, for calibration of the feasible region, is also novel and not studied in the present literature.\n\nIn Section 2 we shall introduce our assumptions and discuss our main result, whose proof is given in Section 4. The proof is technical due to the level of generality that is considered. More precisely, it is the fact that the random elements that we consider need not take values in a locally compact space (like R d ) which introduces technical complications, including issues like measurability of a key functional appearing in the dual formulation. In preparation to the proof, and to help the reader gain some intuition of the result, we present a one dimensional example first, in Section 3, and then, after providing the proof of our main result, we discuss additional examples in Section 5.\n\n\nOur Main Result\n\nIn order to state our main result, we need to introduce some notation and assumptions. 2.1. Notation and Assumptions. Underlying our discussion we have a Polish space S, which is the space where the random elements of the probabilistic model under consideration takes values. We use B(S) to denote the associated Borel σ-algebra. Let us write P (S) and M (S), respectively, to denote the set of all probability measures and finite signed measures on (S, B(S)).\n\nWe shall use C b (S) to denote the space of bounded continuous functions from S to R. For any µ ∈ P (S) and p ≥ 1, L p (dµ) denotes the collection of measurable real-valued functions h such that |h| p dµ < ∞.\n\nThroughout the paper we assume that µ ∈ P (S) is a given reference probability measure. In applied settings, µ is the probability measure chosen by the modeler as the baseline distribution that is used to evaluate performance measures of interest. We assume that f ∈ L 1 (dµ) is upper semicontinuous. The function f ∈ L 1 (dµ) corresponds to a risk functional (or) performance measure of interest, for example, expected losses, probability of ruin, etc.\n\nFor any two probability measures P 1 and P 2 in P (S), let Π(P 1 , P 2 ) denote the set of all joint distributions with µ and ν as marginals. In other words, the set Π(P 1 , P 2 ) represents the set of all couplings (also called transport plans) between P 1 and P 2 . Next, we assume that we are provided with a lower semicontinuous cost function c : S × S → R + satisfying c(x, x) = 0 for all x ∈ S. Intuitively, in our formulation, the quantity c(x, y) specifies the cost of transporting unit mass from x in S to another element y of S.\n\nGiven a lower semicontinuous cost function c(x, y) and a coupling π ∈ Π(P 1 , P 2 ), the integral cdπ represents the expected cost associated with the coupling (or transport plan) π. Then, one can attempt to identify a coupling between P 1 and P 2 with the lowest cost, as below:\nd c (P 1 , P 2 ) := inf cdπ : π ∈ Π(P 1 , P 2 ) , P 1 , P 2 ∈ P (S).\nIf the cost function c is symmetric (that is, c(y, x) = c(x, y) for all x, y), and satisfies triangle inequality, then one can show that the minimum transportation cost d c : P (S) × P (S) → R + defines a metric on the space of probability measures P (S). For example, if S is a Polish space equipped with metric d, then taking the cost function to be c(x, y) = d(x, y), renders the metric d c (µ, ν) to be simply the Wasserstein distance of first order between µ and ν. In general, we refer d c to be the transport metric associated with the cost function c.\n\nUnlike Kullback-Liebler divergence (or) other likelihood based divergence measures, Wasserstein distance is a true metric on the space of probability measures, and more importantly, does not restrict all the probability measures in the neighborhoods such as {ν ∈ P (S) : d c (µ, ν) ≤ δ} to have the same support as the baseline measure µ. In addition, under appropriate moment assumptions, Wasserstein distances metrize weak convergence of probability measures (see, for example, Chapter 6 in [53] for properties of Wasserstein distances).\n\n2.2. Primal Problem. Given δ > 0, the objective, as mentioned in the Introduction, is to evaluate\nsup f dν : d c (µ, ν) ≤ δ .\nThe value of this optimization problem provides a bound to the expectation of f, regardless of the probability measure used, as long as the measure lies within δ distance (measured in terms of d c ) from the baseline probability measure µ. From the definition of the metric d c , we rewrite the quantity of interest as below:\nI := sup f dν : d c (µ, ν) ≤ δ = sup f (y)dπ(x, y) : π ∈ Π(µ, ν), cdπ ≤ δ ,\nwhich, in turn, is an optimization problem with linear objective function and linear constraints. If we let I(π) := f (y)dπ(x, y) and Φ µ,δ := {π ∈ Π(µ, ν) : cdπ ≤ δ} for brevity, then\n(2) I = sup {I(π) : π ∈ Φ µ,δ }\nis the quantity of interest. For every such (λ, φ) ∈ Λ c,f consider J(λ, φ) := λδ + φdµ.\n\nThe integral in the above definition is well-defined because, φ(x) ≥ f (x), whenever φ(x) satisfies (3). As f dµ is finite, the above definition of J(λ, φ) avoids ambiguities such as ∞ − ∞.\n\nNext, for any π ∈ Φ µ,δ and (λ, φ) ∈ Λ c,f , see that\nJ(λ, φ) = λδ + φ(x)dπ(x, y) ≥ λδ + f (y) − λc(x, y) dπ(x, y) = f (y)dπ(x, y) + λ δ − c(x, y)dπ(x, y) ≥ f (y)dπ(x, y) = I(π).\nConsequently, we have\n(4) J := inf J(λ, φ) : (λ, φ) ∈ Λ c,f ≥ I.\nFollowing the tradition in optimization theory, we refer to the above infimum problem that solves for J in (4) as the dual to the problem that solves for I in (2), which we address as the primal problem.\n\nOur objective in the next section is to identify whether the primal and the dual problems have same value (that is, do we have that I = J?).\n\n\n2.3.\n\nMain Result: Strong Duality Holds. Recall that the feasible sets for the primal and dual problems, respectively, are:\nΦ µ,δ := π ∈ Π(µ, ν) : ν ∈ P (S),\ncdπ ≤ δ and (5a)\nΛ c,f := (λ, φ) : λ ≥ 0, φ measurable, φ(x) + λc(x, y) ≥ f (y), for all x, y ∈ S . (5b)\nThe corresponding primal and dual problems are\nI := sup f (y)dπ(x, y) : π ∈ Φ µ,δ and J := inf λδ + φdµ : (λ, δ) ∈ Λ c,f .\nFor brevity, we have identified the primal and dual objective functions as I(π) and J(λ, φ) respectively. As the identified primal and dual problems are infinite dimensional, it is not immediate whether they have same value (that is, is I = J?). The objective of the following theorem is to verify that, for a broad class of performance measures f and baseline probability measures µ, indeed I equals J. Refer Section 2.1 for a review of assumptions under which the conclusions of Theorem 1 hold.\n\nTheorem 1. The dual optimizer exists, and is of form (λ, φ λ ), µ-almost surely, for some λ ≥ 0. In addition, any feasible π * ∈ Φ µ,δ and (λ * , φ λ * ) ∈ Λ c,f are primal and dual optimizers if and only if\nf (y) − λ * c(x, y) = sup z∈S f (z) − λ * c(x, z) , π * a.s., and (7a) λ * c(x, y)dπ * (x, y) − δ = 0. (7b)\nAs the measurability of the function φ λ is not immediate, we establish it in Section 4, where the proof of Theorem 1 is also presented. For now, we are content discussing the insights that can be obtained from Theorem 1.\n\n\nRemark 1.\n\nFirst, we point out the following useful characterization of the optimal value, I, as a consequence of Theorem 1:\n(8) I = inf λ≥0 λδ + E µ sup y∈S f (X) − λc(X, y) ,\nwhere the right hand side 1 is simply a univariate reformulation of the dual problem. This characterization of I follows from the strong duality in Theorem 1 and the observation that J(λ, φ λ ) is smaller than J(λ, φ), for every (λ, φ) ∈ Λ c,f . The significance of this observation lies in the fact that the only probability measure involved in the right-hand side of (8) is the baseline measure µ, which is completely characterized, and is usually chosen in a way that it is easy to work with (or) draw samples from. In effect, the result indicates that the infinite dimensional optimization problem in (2) is easily solved by working on the univariate optimization problem in the right hand side of (8).\n\nRemark 2. It is evident from the characterisation of an optimal measure π * in Theorem 1(b) that the support of π * is concentrated on the the set\n(x, y) ∈ S × S : f (y) − λ * c(x, y) = sup z∈S f (z) − λ * c(x, z) .\nThus, a worst-case probability measure π * in the neighborhood of the baseline measure µ gets identified by any transport plan 2 that transports mass from x to the solution(s) of the local optimization problem sup z∈S f (z) − λ * c(x, z) . According to (7b), such a transport plan costs c(x, y)dπ * (x, y) = δ if λ * > 0. Alternatively, if a primal optimal transport plan π * does not exist, one can consider a family of transport plans (π : > 0) such that sup >0 I(π ) = I. In particular, for any > 0, one can consider an -optimal solution that is supported, for example, on the set\n(x, y) ∈ S × S : f (y) − λ * c(x, y) > sup z∈S f (z) − λ * c(x, z) − 2 ,\nand satisfying cdπ ≥ δ − /2λ * . Such an -optimal transport plan can be shown to satisfy I(π ) ≥ I − . This is indeed the content of Corollary 1 in Section 4.\n\nWe next discuss an important special case of Theorem 1, namely, computing worst case probabilities.\n\n\n2.3.1.\n\nComputing Worst-case Probabilities . Recall that (S, S) represents a measurable space and assume that we are interested in computing\n(9) I = sup{P (A) : d c (P, µ) ≤ δ},\nwhere A is a closed set. We shall see applications of precisely this problem in the context of ruin probabilities, other applications are discussed in [20], in the context of data-driven distributionally robust optimization. Since A is closed, it follows that f (x) = I (x ∈ A) is upper semicontinuous and therefore we can apply Theorem 1 to address (9).\n\nFirst, we observe that\nsup y∈S {1 A (x) − λc(x, y)} = 1 − λc(x, A) + ,\nwhere c(x, A) := inf{c(x, y) : y ∈ A} is the lowest cost possible in transporting unit mass from x to some y in set A, and a + denotes the positive part of the real number a. Consequently, Theorem 1 guarantees that the quantity of interest, I, in (9), can be computed by instead solving\nI = inf λ≥0 λδ + E µ 1 − λc(X, A) + .\nAs we turn our attention to the structure of an optimal transport plan, we first assume that P roj A (x) := {y ∈ A : c(x, y) = c(x, A)} is not empty for µ-almost every x. Then we develop an alternative view that\nsup y∈S 1 A (x) − λ * c(x, y) =      1, if x ∈ A, 1 − λ * c(x, y), if c(x, A) ≤ 1 λ * , y ∈ P roj A (x) 0,\nelsewhere.\n\n. Consequently, as in Remark 2, any optimal solution π * is supported on\n(x, y) : c(x, A) ≤ 1 λ * , y ∈ P roj A (x) ∪ (x, x) : c(x, A) > 1 λ * .\nIn addition, one can rewrite the quantity of interest as\n(10) sup {P (A) : d c (P, µ) ≤ δ} = π * {(x, y) : y ∈ A} = µ x : c(x, A) ≤ 1 λ * . Moreover, if P roj A (x) := {y ∈ A : c(x, y) = c(x, A)}\nis not empty for µ-almost every x, then an optimal π * can be described as follows. First, sample X with distribution µ and let χ : S → A be any measurable map so that χ (x) ∈ P roj A (x), µ-almost surely. We then write\nY * = χ (X) · I c(X, A) ≤ 1 λ * + X · I c(X, A) > 1 λ * ,\nwhere the level λ * > 0 is such that\nE [c (X, Y * )] = E c (X, A) · I c(X, A) ≤ 1 λ * = δ.\nSuch a universally measurable map χ (·) always exists, assuming that c (·) is lower semicontinuous and that P roj A (x) is not empty for µ-almost every x; these issues are discussed in Section 4 more generally for the function φ λ (x) = sup y∈S {f (y) − λc(x, y)}.\n\nAs an example, if we take the cost function c as a distance metric d (as in Wasserstein distances), then (10) provides an interpretation that the worst-case probability P (A) in the neighborhood of µ is the same as µ(A 1/λ * ), where\nA := y ∈ S : d(x, y) ≤ for some x ∈ A\ndenotes the -neighborhood of the set A. Thus, the problem of finding a probability measure with worst-case probability P (A) in the neighborhood of measure µ amounts to simply searching for a suitably inflated neighborhood of the set A itself. For example, if S = R, c(x, y) = |x − y|, then for any µ ∈ B(R),\nsup P [x, ∞) : d c (P, µ) ≤ δ = µ x − 1 λ * , ∞ .\nIn the above discussion, if the optimal transport plan π * does not exist, perhaps because P roj x (A) = ∅ for a collection of x that has positive probability under measure µ, one can create -optimal plans π , as discussed in Remark 2, such that π (S × A) differs from the right hand side of (10) only by , for any arbitrary > 0.\n\n\nComputing ruin probabilities: A first example\n\nIn this section, we consider an example with the objective of computing a worst-case estimate of ruin probabilities in a ruin model whose underlying probability measure is not completely specified. As mentioned in the Introduction, such a scenario can arise for various reasons, including the lack of data necessary to pin down a satisfactory model. A useful example to keep in mind would be the problem of pricing an exotic insurance contract (for example, a contract covering extreme climate events) in a way the probability of ruin is kept below a tolerance level.\n\nExample 1. In this example, we consider the celebrated Cramer-Lundberg model, where a compound Poisson process is used to calculate ruin probabilities of an insurance risk/reserve process. The model is specified by 4 primitives: initial reserve u, safety loading η > 0, the rate ν at which claims arrive, and the distribution of claim sizes F with first and second moments m 1 and m 2 respectively. Then the stochastic process\nR(t) = u + (1 + η)νm 1 t − Nt i=1 X i ,\nspecifies a model for the reserve available at time t. Here, X n denotes the size of the n-th claim, and the collection {X 1 , X 2 , . . .} is assumed to be independent samples from the distribution F. Further, p := (1 + η)νµ 1 is the rate at which premium is received, and N t is taken to be a Poisson process with rate λ. Then one of the important problems in risk theory is to calculate the probability ψ(u, T ) := Pr R(t) ≤ 0 for some t ≤ T that the insurance firm runs into bankruptcy before a specified duration T.\n\nDespite the simplicity of the model, existing results in the literature do not admit simple methods for the computation of ψ(u, T ) (see [3], [17], [45] and references therein for a comprehensive collection of results). In addition, if the historical data is not adequately available to choose an appropriate distribution for claim sizes, as is typically the case in an exotic insurance situation, it is not uncommon to use a diffusion approximation\nR B (t) := u + (1 + η)νm 1 t − (νm 1 t + √ νm 2 B(t)) = u + ηνm 1 t − √ νm 2 B(t)\nthat depends only on first and second moments of the claim size distribution F. Here, the stochastic process (B(t) : 0 ≤ t ≤ T ) denotes the standard Brownian motion. See the seminal works of Iglehart [31] and Harrison [27] for a justification and some early applications of diffusion approximations in computing insurance ruin. Such diffusion approximations have helped in approximate computations of similar path-dependent quantities, which may be otherwise intractable. On the other hand, as it is difficult to verify the the accuracy of the Brownian approximation of ruin probabilities,\nψ B (u, T ) := Pr {R B (t) ≤ 0 for some t ≤ T } = Pr sup t∈[0,T ] √ νm 2 B(t) − ηνm 1 t > u ,\nas a substitute for ruin probabilities ψ(u, T ), in this example, we use the framework developed in Section 2 to compute worst-case estimates of ruin probabilities over all probability measures in a neighborhood around the baseline Brownian motion B(t) driving the ruin model R B (t).\n\nFor this purpose, we identify the Polish space where the stochastic processes of our interest live as the Skorokhod space S = D([0, T ], R) equipped with the J 1 topology. In other words, S = D([0, T ], R) is simply the space of real-valued right-continuous functions with left limits (rcll) defined on the interval [0, T ], equipped with the J 1 -metric d J 1 . Please refer Lemma 7 in Appendix B for an expression of d J 1 and Chapter 3 of [56] for an excellent exposition on the space D([0, T ], R). Next, we take the transportation cost (corresponding to p-th order Wasserstein distance) as\nc(x, y) = d J 1 (x, y) p x, y ∈ S,\nfor some p ≥ 1, and the baseline measure µ as the probability measure induced in the path space by the Brownian motion B(t). In addition, if we let\nA u := x ∈ S : sup t∈[0,T ] √ νm 2 x(t) − νm 1 t ≥ u ,\nthen the following observations are in order: First, the Brownian approximation for ruin probability ψ B (u, T ) equals µ(A u ). Next, the set A u is closed (verified in Lemma 6 in Appendix B), and hence the function I(x ∈ A u ) is upper semicontinuous. Therefore, for any given δ > 0, it follows from (10) in Section 2.3.1 that\nψ rob (u, T ) := sup{P (A u ) : d c (P, µ) ≤ δ} = µ x ∈ S : c(x, A u ) ≤ 1 λ * ,(11)\nwhere, c(x, A u ) := inf{c(x, y) : y ∈ A u } and the Lagrange multiplier λ * , if positive, solves\nc(x, A u )1 {c(x,Au)≤ 1 λ * } (x)dµ(x) = δ\n. Therefore, the only task remaining in the characterization of worst-case estimates ψ rob (u, T ) is to compute the minimum cost c(x, A u ), for x / ∈ A u . In Lemma 7 in Appendix B, we indeed identify that\nc(x, A u ) = u − sup t∈[0,T ] √ νm 2 x(t) − ηνm 1 t p , for x / ∈ A u .(12)\nAs c(x, A u ) admits a simple form, following (11), the problem of computing ψ rob (u, T ) becomes as elementary as\nψ rob (u, T ) = Pr sup t∈[0,T ] √ νm 2 B t − ηνm 1 t > u − 1 λ * 1/p = ψ B (ũ, T ),(13)\nwithũ := u − (λ * ) −1/p . Thus, the computation of worst-case ruin probability remains the problem of evaluating the probability that a Brownian motion with negative drift crosses a positive level,ũ, smaller than the original level u. In other words, the presence of model ambiguity has manifested itself only in reducing the initial capital to a new levelũ.\n\nNumerical illustration: To make the discussion concrete, we consider a numerical example where T = 100, ν = 1, p = 2, and the safety loading η = 0.1. The claim sizes are taken from a distribution F that is not known to the entire estimation procedure. Our objective is to compute the Brownian approximation to the ruin probability ψ B (u, T ) = µ(A u ), and its worst-case upper bound ψ rob (u, T ) := sup P (A u ) : d c (P, µ) ≤ δ . The estimation methodology is data-driven in the following sense: we derive the estimates of moments m 1 , m 2 and δ from the observed realizations {X 1 , . . . , X N } of claim sizes. While obtaining estimates for moments m 1 and m 2 are straightforward, to compute δ, we use the claim size samples {X 1 , . . . , X N } to embed realizations of compound Poisson risk process in a Brownian motion, as in [35]. Specific details of the algorithm that estimates δ can be found in Appendix A. The estimate of δ obtained is such that the compensated compound Poisson process of interest that models risk in our setup lies within the δ-neighborhood {P : d c (P, µ) ≤ δ} with high probability. Next, given the knowledge of Lagrange multiplier λ * , the evaluation of ψ B (u, T ) and ψ rob (u, T ) = ψ B (ũ, T ) (withũ = u−1/λ * ) are straightforward, because of the closed-form expressions for level crossing probabilities of Brownian motion. Computation of λ * is also elementary, and can be accomplished in multiple ways. We resort to an elementary sample average approximation scheme that solves for λ * . The estimates of Brownian approximation to ruin probability ψ B (u, T ) and the worst-case ruin probability ψ rob (u, T ), for various values of u, are plotted in Table 1. To facilitate comparison, we have used a large deviation approximation of the ruin probabilities ψ LD (u, T ) that satisfy ψ LD (u, T ) ∼ ψ(u, T ), as u → ∞, as a common denominator to compare magnitudes of the Brownian estimate ψ B (u, T ) and the worst-case bound ψ rob (u, T ). In particular, we have drawn samples of claim sizes from the Pareto\ndistribution 1 − F (x) = 1 ∧ x −2.2 .\nWhile the Brownian approximation ψ B (u, T ) remarkably underestimates the ruin probability ψ(u, T ), the worst-case upper bound ψ rob (u, T ) appears to yield estimates that are conservative, yet in the correct order of magnitude. Table 1. Comparison of ruin probability estimate ψ B (u, T ) and the worst-case For further discussion on this toy example, let us say that an insurer paying for the claims distributed according to X i has a modest objective of keeping the probability of ruin before time T at a level below 0.01. The various combinations of initial capital u and safety loading factors η that achieve this objective are shown in Figure 1. While the (η, u) combinations that work for the Brownian approximation model is drawn in red, the corresponding (η, u) combinations that keep ψ rob (u, T ) ≤ 0.01 is shown in blue.\nupper bound ψ rob (u, T ): Example 1. The denominator ψ LD (u, T ) is such that ψ LD (u, t)/ψ(u, T ) → 1, as u → ∞. u ψ B (u, T )ũ ψ rob (u, T ) ψ B (u,T ) ψ LD (u,T ) ψ rob (u,T ) ψ LD (u,T )\nA discussion on regulatory capital requirement. For the safety loading η = 0.1 we have considered, the Brownian approximation model R B (t) requires that the initial capital u be at least 60 to achieve ψ B (u, T ) ≤ 0.01. On the other hand, to keep the robust ruin probability estimates ψ rob (u, T ) below 0.01, it is required that u ≈ 200, roughly 3 times more than the capital requirement of the Brownian model. From the insurer's point of view, due to the model uncertainty the contract is faced with, it is not uncommon to increase the premium income (or) initial capital by a factor of 3 or 4 (referred as \"hysteria factor\", see [18], [37]). This increase in premium can be thought of as a guess for the price for statistical uncertainty. Choosing higher premium and capital (larger η and u), along the blue curve in Figure 1, as dictated by the robust estimates of ruin probabilities ψ rob (u, T ), instead provides a mathematically sound way of doing the same. Unlike the Brownian approximation model, the blue curve demonstrates that one cannot decrease the probability of ruin by arbitrarily increasing the premium alone, the initial capital also has to be sufficiently large. This prescription is consistent with the behaviour of markets with heavy-tailed claims where, in the absence of initial capital, a few initial large claims that occur before enough premium income gets accrued are enough to cause ruin. The minimum capital requirement u prescribed according to the worst-case estimates ψ rob (u, T ) can be thought of as the regulatory minimum capital requirement. Remark 3. Defining the candidate set of ambiguous probability measures via KL-divergence (or) other likelihood based divergence has been the most common approach while studying distributional robustness (see, for example, [26,9,14]). This would not have been useful in this setup, as the compensated Poisson process that models risk is not absolutely continuous with respect to Brownian motion. In general, it is normal to run into absolute continuity issues when we deal with continuous time stochastic processes. In such instances, as demonstrated in Example 1, modeling via transport metrics (or) Wasserstein distances not only offer a tractable alternative, but also yields insightful equivalent reformulations. Proposition 2. Let S be a compact Polish space. If f ∈ L 1 (dµ) is upper semicontinuous and c : S × S → R + is continuous, then I = J. In addition, a primal optimizer π * ∈ Φ µ,δ satisfying I(π * ) = I exists.\n\nProposition 3. Let S be a compact Polish space. If f ∈ L 1 (dµ) is upper semicontinuous and c : S × S → R + is lower semicontinuous, then I = J. In addition, a primal optimizer π * ∈ Φ µ,δ satisfying I(π * ) = I exists.\n\nAs in the proof of the standard Kantorovich duality in compact spaces in [52], we use Fenchel duality theorem (see Theorem 1 in Chapter 7, [39]) to prove Proposition 2. However, the similarity stops there, owing to the reason that the set of primal feasible measures Φ µ,δ is not tight when S is non-compact (contrast this with Kantorovich duality, where the collection of feasible measures Π(µ, ν), the set of all joint distributions between any two probability measures µ and ν, is tight).\n\nProof of Proposition 2. As a preparation for applying Fenchel duality theorem, we first let X = C b (S × S), and identify X * = M (S × S) as its topological dual. Here, the spaces X and X * , representing the vector space of bounded continuous functions and finite Borel measures on S × S, respectively, are equipped with the supremum and total variation norms. The fact that X * is the dual space of X is a consequence of Riesz representation theorem (see, for example, [46]). Next, let C be the collection of all functions g in X that are of the form g(x, y) = φ(x) + λc(x, y), for all x, y, for some φ ∈ C b (S) and λ ≥ 0. In addition, let D denote the collection of all functions g in X that satisfy g(x, y) ≥ f (y), for every x, y. Every g in the convex subset C is defined by the pair (λ, φ), which, in turn, can be uniquely identifed by,\nφ(x) = g(x, x) and λ = g(x, y) − φ(x) c(x, y) ,\nfor some x, y in S such that c(x, y) = 0. Keeping this invertible relationship in mind, define the functionals Φ : C → R and Γ : D → R as below:\n\nΦ(g) := λδ + φdµ and Γ(g) := 0.\n\nEvidently, the functional Φ is convex, Γ is concave, and we are interested in\ninf g∈C∩D Φ(g) − Γ(g) = inf{J(λ, φ) : λ ≥ 0, φ ∈ C b (S)} = J.\nThe next task is to identify the conjugate functionals Φ * , Γ * and their respective domains C * , D * as below:\nC * = π ∈ X * : sup g∈C gdπ − Φ(g) < ∞ and D * = π ∈ X * : inf g∈D gdπ > −∞ .\nThe conjugate functionals Φ * : C * → R and Γ * : D * → R are defined accordingly as, Φ * (π) := sup g∈C gdπ − Φ(g) and Γ * (π) := inf g∈D gdπ.\n\nConsequently,\nΦ * (π) = sup (λ,φ) ∈ R + ×C b (S) φ(x) + λc(x, y) dπ(x, y) − λδ + φ(x)dµ(x) = sup (λ,φ) ∈ R + ×C b (S) λ c(x, y)dπ(x, y) − δ + φ(x) dπ(x, y) − dµ(x) ,\nand as continuous functions with compact support are dense in L 1 -norm (see Theorem 31.11 in [1]), Γ * (π) = inf g(x, y)dπ(x, y) : g(x, y) ≥ f (y) for all x, y = f (y)dπ(x, y).\n\nIf the measure π is not non-negative, then one can easily find a sequence of functions g n (x, y) ≥ f (y) such that g n (x, y)dπ(x, y) → −∞, as n → ∞. For example, if A ∈ B(S × S) is such that π(A) < 0, then, for g n (x, y) := f (y) + n1 A (x, y), we have that g n dπ → −∞, as n → ∞. Thus,\nD * = M + (S × S).\nIn addition, from the above expressions for Φ * and Γ * , one can easily verify that\nC * = π ∈ M (S × S) : cdπ ≤ δ, π(A × S) = µ(A) for all A ∈ B(S) ,\nΦ * (π) = 0 and Γ * (π) = f (y)dπ(x, y).\n\nConsequently, C * ∩ D * = Φ µ,δ , and sup Γ * (π) − Φ * (π) : π ∈ C * ∩ D * = sup I(π) : π ∈ Φ µ,δ = I.\n\nAs f is upper-semicontinuous and S is compact, ||f || ∞ < ∞. As a result, the set C ∩ D contains points in the relative interiors of C and D (consider, for example, the candidate h(x, y) = ||f || ∞ + c(x, y).) Further, the epigraph of the function Γ has non-empty interior. Thus, as a consequence of Fenchel's duality theorem (see Theorem 1 in Chapter 7, [39]), we obtain\ninf g∈C∩D Φ(g) − Γ(g) = sup Γ * (π) − Φ * (π) : π ∈ C * ∩ D * ,\nwhere the supremum in the right is achieved by some π * ∈ Φ µ,δ . In other words,\ninf J(λ, φ) : λ ≥ 0, φ ∈ C b (S) = max I(π) : π ∈ Φ µ,δ ,\nThis completes the proof of Proposition 2. Here, the feasible sets Φ n µ,δ and Λ n c,f are obtained by suitably modifying the cost function in sets Φ µ,δ and Λ c,f (defined in (5a) and (5b)) as below: Φ n µ,δ := π ∈ Π(µ, ν) : ν ∈ P (S), c n dπ ≤ δ and Λ cn,f := (λ, φ) : λ > 0, φ measurable, φ(x) + λc n (x, y) ≥ f (y), for all x, y ∈ S .\n\nAs the cost functions c n are continuous, due to Proposition 2, there exists a sequence of measures (π n : n ≥ 1) such that I(π n ) = I n = J n .\n\nAs S is compact, the set (π n : n ≥ 1) is automatically tight, and due to Prokhorov's theorem, there exists a subsequence π n k weakly converging to some π * ∈ P (S × S). First, we check that π * is feasible:\ncdπ * = lim n c n dπ * = lim n c n dπ * = lim n lim k c n dπ n k ,\nwhere the second and third equalities, respectively, are consequences of monotone convergence and weak convergence. In addition, since c n is nondecreasing,\nlim k c n dπ n k ≤ lim k c n k dπ n k ≤ δ.\nTherefore, cdπ * ≤ δ. Again as a simple consequence of weak convergence, we have π * (A×S) = µ(A) for all Borel-measurable A. Therefore, π * ∈ Φ µ,δ , and is indeed feasible. Next, as f is upper semicontinuous and S is compact, f is bounded. Then, due to the weak convergence that π n k ⇒ π * , the objective function I(π * ) satisfies\nI(π * ) = f dπ * ≥ lim k f dπ n k = lim k I(π n k ) = lim k J n k ,\nbecause I(π n k ) = J n k as in (14). Further, as c n ≤ c, it follows that Λ c n ,f is a subset of Λ c,f and hence J n ≥ J, for all n. As a result, we obtain,\nI(π * ) ≥ lim k J n k ≥ J.\nSince I never exceeds J (see (4)), it follows that I(π * ) = I = J.\n\n\n4.2.\n\nA note on additional notations and measurability. Given that we have established duality in compact spaces, the next step is to establish the same when S is not compact. For this purpose, we need the following additional notations. For any probability measure π ∈ M (S ×S), let\nS π := Spt(π X ) ∪ Spt(π Y ),\nwhere Spt(π X ) and Spt(π Y ) denote the respective supports of marginals π X (·) := π( ·, S) and π Y (·) := π(S, · ). In addition, for any K ⊆ S × S, let Λ(K) := (λ, φ) : λ ≥ 0, φ measurable, φ(x) + λc(x, y) ≥ f (y), for all x, y ∈ K .\n\nWith this notation, the dual feasible set Λ c,f is nothing but Λ(S × S). The next issue we address is the measurability of functions of form φ λ (x) = sup y∈S f (y) − λc(x, y) . For any u ∈ R,\nφ λ (x) > u = Proj X ({(x, y) ∈ S × S : f (y) − λc(x, y) > u}) ,\nwhich is analytic, because projections Proj X (A) := {x : (x, y) ∈ A} of any Borel measurable set A is analytic. As analytic subsets of S are universally measurable, the function φ λ (x) is universally measurable, and offers an almost sure modification to be able to integrate with any Borel probability measure µ (refer Chapter 7 of [11] for an introduction to universal measurability and analytic sets).\n\n\n4.3.\n\nExtension of duality to non-compact spaces. Proposition 4, presented below in this section, is a big step towards completing the proof of the duality theorem. J(λ, φ) ≤ I Proof of Proposition 4. As any Borel probability measure on a Polish space is concentrated on a σ-compact set (see Theorem 1.3 of [13]), we can write S π × S π as the union of increasing sequence of compact subsets (S n × S n : n ≥ 1) that satisfy\np n := π(S n × S n ) ≥ 1 − 1 n , c(x, y)1(S n × S n ) c dπ(x, y) ≤ δ n and |f |(y)1(S n × S n ) c dπ(x, y) ≤ 1 n .\nChoosing such subsets is always possible because 1) Support of measure π is σ-compact as discussed above, 2) cdπ < ∞, and 3) Integrability of f is equivalent to that of |f |. Next, for n ≥ 1, define a joint probability measure π n ∈ P (S n × S n ) and its corresponding marginal µ n ∈ P (S n ) as below:\n\nπ n (·) = π · ∩ (S n × S n ) p n and µ n (·) = π n ( · × S n ).\n\nAlso let δ n := δ(1 − 1/n). These new definitions can be used to define \"restricted\" primal and dual optimization problems I n and J n supported on the compact set S n × S n :\n\nI n := sup f dγ : γ ∈ Π(µ n , ν) for some ν ∈ P (S n ), cdγ ≤ δ n and (16) J n := inf λδ n + φdµ n : (λ, φ) ∈ Λ(S n × S n ) .\n\nTo comprehend (17), refer the definition of Λ(·) in (15). As S n is compact, due to the duality result in Proposition 3, we know that there exists a γ * n ∈ P (S n × S n ) that is feasible for optimization of I n and satisfies f dγ * n = I n = J n .\n\nUsing this optimal measure γ * n , one can, in turn, construct a measureπ ∈ P (S × S) by stitching it with the residual portion of π as below: π(·) = p n γ * n (·) + π · ∩ (S n × S n ) c . Having tailored a candidate measureπ ∈ P (S × S), next we check its feasibility here: Since γ * n has µ n as its marginal for the first component, it is easy to check thatπ has µ as its marginal for the first component.\nπ( · × S) = p n π(( · ∩ S n ) × S n ) p n + π( · ∩ S c n ) = µ(·).\nAs γ * n is a feasible solution for the optimization problem in (16),\ncdπ = p n Sn×Sn cdγ * n + (Sn×Sn) c cdπ ≤ δ n + δ n ,\nwhich does not exceed δ. To see this, recall that δ n := δ(1−1/n). Therefore, the stitched measurẽ π is primal feasible, that isπ ∈ Φ µ,δ . Consequently,\nI ≥ I(π) = f dπ = p n f dγ * n + f 1(S n × S n ) c dπ.\nAs S n is chosen such that f integrates to a quantity smaller than 1/n on (S n × S n ) c , we have I ≥ p n I n − n −1 . Therefore, it is immediate from (18) that\nJ n ≤ 1 − 1 n −1 I + 1 n ,(19)\nwhich, if I < ∞, is a useful upper bound for all of J n , n ≥ 1. See that the statement of Proposition 4 already holds when I equals ∞. Therefore, let us take I to be finite. Next, given n ≥ 1 and > 0, take an -optimal solution (λ n , φ n ) for J n : that is, (λ n , φ n ) ∈ Λ(S n × S n ) and λ n δ n + φ n dµ n ≤ J n + .\n\nFor any pair (λ n , φ) that belongs to Λ(S n × S n ), we have from the definition of Λ(S n × S n ) that φ(x) is larger than sup y∈Sn {f (y) − λ n c(x, y)}, for every x ∈ S n . As a result,\nλ n δ n + sup y∈Sn f (y) − λ n c(x, y) dµ n (x) ≤ J n + .\nCombining this with (19), we obtain lim n λ n δ n + sup\ny∈Sn f (y) − λ n c(x, y) 1 Sn (x) dµ(x) p n ≤ I + .(20)\nSince c(x, x) = 0, the function inside the integral admits a lower bound f (x) on S n . In addition, as f ∈ L 1 (dµ), the integrand in (20) admits a common integrable lower bound for all n ≥ 1. This has two consequences: 1) Because of the upper bound in (20), the collection {λ n : n ≥ 1} is uniformly bounded and admits a cluster point λ * , and 2) One can apply Fatou's lemma (see, for example, Theorem 2 of Chapter II.6 in [48]) to take the liminf inside the integral, thus yielding\nλ * δ + sup ∪nSn f (y) − λ * c(x, y) dµ(x) ≤ I + .\nHere, we have used that δ n → δ, as n → ∞. Further correctness of the above limiting argument is verified in Lemma 10 in Appendix B. Recall that S π = ∪ n S n . If we let φ * (x) = sup Sπ f (y) − λ * c(x, y) , then the pair (λ * , φ * ) belongs to the feasible set Λ(S π ×S π ). Further, as is arbitrary, we have J(λ * , φ * ) ≤ I. This completes the proof.\n\nProof of Theorem 1(a). If I = ∞, then as I never exceeds J, J equals ∞ as well, and there is nothing to prove. Next, consider the case where I is finite: that is, I ∈ [ f dµ, ∞). Let E denote the convex set of probability measures π ∈ P (S × S) that satisfy conditions (a)-(c) of Proposition 4. Then, due to Proposition 4, for every π ∈ E,\nI ≥ inf (λ,φ)∈Λ Sπ×Sπ λδ + φ(x)dµ(x) ≥ inf λ≥0 λδ + sup y∈Sπ f (y) − λc(x, y) dµ(x) .\nFor any π ∈ E and λ ≥ 0, define T (λ, π) = λδ + sup y∈Sπ f (y) − λc(x, y) dµ(x).\n\nAs c(x, x) = 0, it is easy to see that T (λ, π) ≥ λδ + f dµ. Subsequently, T (λ, π) increases to infinity as λ → ∞, uniformly in π. As a result, one can restrict attention to a compact subset [0, λ max ] such that\nI ≥ inf λ∈[0,λmax] T (λ, π).(21)\nBeing a pointwise supremum of a family of affine functions, sup y∈Sπ {f (y) − λc(x, y)} is a lower semicontinuous with respect to the variable λ. Further, recall that T (λ, π) ≥ λδ + f dµ. Thus, for any λ n → λ, due to Fatou's lemma,\nlim n→∞ T (λ n , π) ≥ λδ + lim n sup y∈Sπ {f (y) − λ n c(x, y)} dµ(x) ≥ λδ + sup y∈Sπ {f (y) − λc(x, y)} dµ(x) = T (λ, π),\nwhich means that T (λ, π) is lower semicontinuous in λ. Along with this lower semicontinuity, for every fixed π, T (λ, π) is also convex in λ. In addition, for any α ∈ (0, 1) and π 1 , π 2 ∈ E,\nT (λ, απ 1 + (1 − α)π 2 ) = λδ + sup y∈S απ 1 +(1−α)π 2 f (y) − λc(x, y) dµ(x) ≥ max i=1,2 λδ + sup y∈Sπ i f (y) − λc(x, y) dµ(x) .\nTherefore, T (λ, π) is a concave function in π for every fixed λ. One can apply a standard minimax theorem (see, for example, [49]) to conclude\nsup π∈E inf λ∈[0,λmax] T (λ, π) = inf λ∈[0,λmax] sup π∈E T (λ, π).\nThis observation, in conjunction with (21), yields\nI ≥ sup π∈E inf λ∈[0,λmax] T (λ, π) = inf λ∈[0,λmax] λδ + sup π∈E sup y∈Sπ f (y) − λc(x, y) dµ(x)\nThe following lemma is the last piece of technicality that completes the proof of Part (a) of Theorem 1. \n\n\nIf Lemma 5 holds, then it is automatic that\nI ≥ inf λ∈[0,λmax] λδ + sup y∈S f (y) − λc(x, y) dµ(x) ≥ J,\nwhich will complete the proof of Part (a) of Theorem 1.\n\nProof of Lemma 5. For brevity, let g(x, y) := f (y) − λc(x, y) and φ λ (x) := sup y∈S g(x, y). For any n ≥ 1 and k ≤ n 2 , define the sets,\nA k,n := {(x, y) ∈ S × S : (k − 1)/n ≤ g(x, y) ≤ k/n} , B k,n := Proj X (A k,n ) \\ ∪ j>k Proj X (A j,n )\nHere, recall that for any A ⊂ S × S, Proj X (A) = {x : (x, y) ∈ A}. The sequence (B k,n : k ≤ n 2 ) also admits the following equivalent backward recursive definition, B n 2 ,n = Proj X (A k,n ) , and B k,n = Proj X (A k,n ) \\ ∪ j>k B j,n for k < n 2 , that renders the collection (B k,n : k ≤ n 2 ) disjoint. As the function g is upper semicontinuous, it is immediate that the sets A k,n are Borel measurable and their corresponding projections B k,n are analytic subsets of S. Then, due to Jankov-von Neumann selection theorem 4 , there exists, for each k ≤ n 2 , an universally measurable function γ k (x) : Proj X (A k,n ) → S such that (x, γ k (x)) ∈ A k,n , or, in other words,\nk − 1 n ≤ g(x, γ k (x)) ≤ k n .(22)\nNext, let us define the function Γ n : S → S as below:\nΓ n (x) = γ k (x), if x ∈ B k,n for some k ≤ n 2 x, otherwise .\nThis definition is possible because B k,n ⊆ Proj X (A k,n ), and the collection (B k,n : k ≤ n 2 ) is disjoint. As each γ k is universally measurable, the composite function Γ n (x) is universally measurable as well, and satisfies that\nsup {g(x, y) : g(x, y) ≤ n} − 1 n ≤ g(x, Γ n (x)) ≤ f (x) ∨ n.\nBoth sides of the inequality above can be inferred from (22) after recalling that g(x, x) = f (x) − λc(x, x) = f (x). Letting n → ∞, we see that\nφ λ (x) := sup{g(x, y) : y ∈ S} ≤ lim n g(x, Γ n (x)) ≤ ∞.(23)\nNext, define the family of probability measures (π n : n ≥ 1) as below:\ndπ n (x, y) := dµ(x) × dδ Γn(x) (y).\nAs g(x, y) ≤ f (x)∨n, π n almost surely, we have that the functions c(x, y) and f (y) are integrable with respect to π n . This means that π n ∈ E (here, recall that E is the set of probability measures satisfying conditions (a)-(c) in the statement of Proposition 4). Further, as S πn ⊇ Spt(µ),\nsup y∈Sπ n g(x, y) = sup y∈Sπ n f (y) − λc(x, y) ≥ f (x) − λc(x, x) = f (x), for all x, µ a.s.,\nwhich is a integrable with respect to the measure µ. Therefore, due to Fatou's lemma,\nlim n→∞ sup y∈Sπ n g(x, y)dµ(x) ≥ lim n→∞ sup y∈Sπ n g(x, y)dµ(x) ≥ lim n→∞ g(x, Γ n (x))dµ(x) ≥ φ λ (x)dµ(x),\nwhere the last inequality follows from (23). Since π n is a member of set E, for every n, it is then immediate that\nsup π∈E sup y∈Sπ g(x, y)dµ(x) ≥ lim n→∞ sup y∈Sπ n g(x, y)dµ(x) ≥ φ λ (x)dµ(x).\nThus, sup\nπ∈E sup y∈Sπ f (y) − λc(x, y) dµ(x) ≥ sup y∈S f (y) − λc(x, y) dµ(x).\nAs S π ⊆ S, for every π ∈ E, the inequality in the reverse direction is trivially true. This completes the proof of Lemma 5.\n\nProof of Theorem 1(b). To summarize, in the proof of Part (a) of Theorem 1, we established that\nI = inf λ≥0 λδ + φ λ (x)dµ(x) ,\nwhere φ λ (x) := sup y∈S {f (y) − λc(x, y)} is lower-semicontinuous in λ, and is bounded by f (x) from below. Recall that f dµ is finite. If we let g(λ) := λδ + φ λ (x)dµ(x), then due to a routine application of Fatou's lemma, we have that lim n→∞ g(λ n ) ≥ g(λ), whenever λ n → λ. In other words, g(·) is lower semicontinuous. In addition, as g(λ) ≥ λδ+ f (x)dµ(x), we have that g(λ) → ∞ if λ → ∞. This means that the level sets {λ : g(λ) ≤ u} are compact for every u, and therefore, g(·) attains its infimum. In other words, there exists a λ * ≥ 0 such that\nI = λ * δ + φ λ * (x)dµ(x).\nThus, we conclude that a dual optimizer of form (λ * , φ λ * ) always exists. Next, if the primal optimizer π * satisfying I = I(π * ) also exist, then f (y)dπ * (x, y) = λ * δ + φ λ * (x)dµ(x), which gives us complementary slackness conditions (7a) and (7b), as a consequence of equality getting enforced in the following series of inequalities:\nf (y)dπ * (x, y) = f (y) − λ * c(x, y) dπ * (x, y) + λ * c(x, y)dπ * (x, y) ≤ φ λ * (x)dπ * (x, y) + λ * c(x, y)dπ * (x, y) ≤ φ λ * (x)dµ(x) + λ * δ.\nThis completes the proof of Theorem 1.\n\nIn the above proof of Theorem 1(b), we proved that a primal optimal transport plan π * , if it exists, satisfies the complementary slackness conditions (7a) and (7b). On the other hand, if a primal optimal transport plan π * satisfying I = I(π * ) does not exist, one can obtain similar characterizations for -optimal transport plans as demonstrated in the following result, which follows simply as a corollary of the proof procedure of Theorem 1.\nCorollary 1. Let λ * > 0 and φ λ * (x) = sup y∈S {f (y) − λ * c(x, y)} be such that I = J(λ * , φ λ * ).\nIn other words, (λ * , φ λ * ) is dual-optimal. Then, given > 0, a probability measure π ∈ Φ µ,δ is -optimal (that is, I(π ) ≥ I − ), if and only if,\nφ λ * (x) − f (y) + λ * c(x, y) dπ (x, y) + λ * δ − cdπ ≤(24)\nThus, according to Corollary 1, a probability measure π ∈ Φ µ,δ that satisfies, for example,\nSpt(π) ⊆ (x, y) ∈ S × S : f (y) − λ * c(x, y) ≥ φ λ * (x) − 2 ,\nand cdπ > δ − 2λ * , is -optimal.\n\nProof of Corollary 1. First, we observe that I = J(λ * , φ λ * ) = λ * δ + φ λ * (x)dπ (x, y), and\nI(π ) = f (y)dπ (x, y) = f (y) − λ * c(x, y) dπ (x, y) + λ * c(x, y)dπ(x, y).\nFrom the above two expressions for I and I(π ), it is immediate that I − I(π ) ≤ if and only if (24) holds.\n\n\nA few more examples\n\n5.1. Applications to computing general first passage probabilities. Computing probabilities of first passage of a stochastic process into a target set of interest has been one of the central problems in applied probability. The objective of this section is to demonstrate that, similar to the one dimensional level crossing example in Section 3, one can compute general worst-case probabilities of first passage into a target set B by simply computing the probability of first passage of the baseline stochastic process into a suitably inflated neighborhood of set B.\n\nThe goal of such a demonstration is to show that the worst-case first passage probabilities can be computed at no significantly extra effort.\n\nExample 2. Let R(t) = (R 1 (t), R 2 (t)) ∈ R 2 model the financial reserve, at time t, of an insurance firm with two lines of business. Ruin occurs if the reserve process R t hits a certain ruin set B within time T > 0. In the univariate case, the ruin set is usually an interval of form (−∞, 0) or its translations (as in Example 1). However, in multivariate cases, the ruin set B can take a variety of shapes based on rules of capital transfers between the different lines of businesses. For example, if capital can be transferred between the two lines without any restrictions, a natural choice is to declare ruin when the total reserve R 1 (t) + R 2 (t) becomes negative. On the other hand, if no capital transfer is allowed between the two lines, ruin is declared immediately when either R 1 (t) or R 2 (t) becomes negative. In this example, let us consider the case where the regulatory requirements allow only β ∈ [0, 1] fraction of reserve, if positive, to be transferred from one line of business to the other. Such a restriction will result in a ruin set of form\nB := (x 1 , x 2 ) ∈ R 2 : βx 1 + x 2 ≤ 0 ∪ (x 1 , x 2 ) ∈ R 2 : βx 2 + x 1 ≤ 0 .\nIt is immediately clear that capital transfer is completely unrestricted when β = 1 and altogether prohibited when β = 0. The intermediate values of β ∈ (0, 1) softly interpolates between these two corner cases. Of course, one can take the fraction of capital transfer allowed from line 1 to line 2 to be different from that allowed from line 2 to line 1, and various other modifications. However, to keep the discussion simple we focus on the model described above, and refer the readers to [30] for a general specification of ruin models allowing different rules of capital transfers between d lines of businesses. |λ(t) − t| , x, y ∈ S is continuous. Here, ||x|| p = (|x 1 | 2 + |x 2 | 2 |) 1/2 is the standard Euclidean norm for x = (x 1 , x 2 ) in R 2 , and Λ is the set of all strictly increasing functions λ : [0, T ] → [0, T ] such that both λ and λ −1 are continuous. Let µ ∈ P(S) denote a baseline probability measure that models the reserve process R(t) in the path space. Given δ > 0, our objective is to characterize the worst-case first passage probability,\nsup P {τ B ≤ T } : d c (P, µ) ≤ δ ,\nwhere τ C := inf{t ∈ [0, T ] : R(t) ∈ C} denotes the first time the reserve process R(t) hits any Borel measurable set C ⊂ R 2 . If we let A = {τ B ≤ T }, then, due to (10), we have that\nsup P {τ B ≤ T } : d c (P, µ) ≤ δ = µ x ∈ S : c(x, A) ≤ 1 λ * ,\nwhere λ * is such that E µ [c(X, A); c(X, A) ≤ 1/λ * ] = δ. For any real number c, if we let It is worked out in Lemma 9 in Appendix B that\nB (c) := (x 1 , x 2 ) ∈ R 2 : βx 1 + x 2 ≤ c ∪ (x 1 , x 2 ) ∈ R 2 : βx 2 + x 1 ≤ c ,c(x, A) = inf t∈[0,T ] βx 1 (t) + x 2 (t) 2 ∧ inf t∈[0,T ] βx 2 (t) + x 1 (t) 2 .\nAs a result,\nx ∈ S : c(x, A) ≤ 1 λ * = x ∈ S : βx 1 (t) + x 2 (t) ≤ 1 √ λ * for some t ∈ [0, T ] ∪ x ∈ S : x 1 (t) + βx 2 (t) ≤ 1 √ λ * for some t ∈ [0, T ] ,\nthus rendering  Next, we take the reserve process satisfying the following dynamics as our baseline model:\n(26) sup P τ B (0) ≤ T : d c (P, µ) ≤ δ = µ τ B (1/ √ λ * ) ≤ T ,dR(t) = ub + µdt + ΣdB(t),\nwhere µ ∈ R 2 − is the drift vector with negative components, Σ is a 2 × 2 positive definite covariance matrix, and (B(t) : 0 ≤ t ≤ T ) a 2-dimensional standard Brownian motion. The real number u denotes the total initial capital and the vector b = (b 1 , b 2 ) ∈ R 2 + such that b 1 + b 2 = 1 denotes the proportion of initial capital set aside for the two different lines of businesses. The probability measure induced in the path space by the process R(t) is taken as the baseline measure µ. Further, for purposes of numerical illustration, we take µ = [−0.1, −0.1], b = [0.5, 0.5] and Σ = I 2 , the 2 × 2 identity matrix. Our aim is to find total initial capital u such that\nsup P τ B (0) ≤ T : d c (P, µ) ≤ δ ≤ 0.01.\nThis is indeed possible due to the equivalent characterization in (26), and the resulting capital requirement for various values of δ are displayed in Figure 2.  As a final remark, if the modeler believes that model ambiguity is more prevalent in one line of business over other, she can perhaps quantify that effect by instead choosing ||x|| 2 = (|x 1 | 2 + α|x 2 | 2 ) 1/2 , for x = (x 1 , x 2 ) ∈ R 2 in the cost function c(x, y) defined in (25). This would penalise moving probability mass in one direction more than the other and result in the ruin set being inflated asymmetrically along different directions. We identify studying the effects of various choices of cost functions, the corresponding δ and the appropriateness of the resulting inflated ruin set for real world ruin problems as an important direction towards applying the proposed framework in quantitative risk management. For example, suppose that the regulator has interacted with the insurance company, and both the company and the regulator have negotiated a certain level of capital requirement multiple times in the past. Then the insurance company can calibrate δ from these previous interactions with the regulator. That is, find the value of δ which implies that the negotiated capital requirement in a given past interaction is necessary for the bound on ruin probability to be lesser than a fixed (regulatory driven) acceptance level (for instance, we use 0.01 as the acceptance level for ruin probability in our earlier numerical illustration in this example). An appropriate quantile of these 'implied' δ values may be used to choose δ based on risk preference.\n\n\n5.2.\n\nApplications to ambiguity-averse decision making. In this section, we consider a stochastic optimization problem in the presence of model uncertainty. It has been of immense interest recently to search for distributionally robust optimal decisions, that is, to find a decision variable b that solves\nOPT = inf b∈B sup P ∈P E [f (X, b)] .\nHere, f is a performance/risk measure that depends on a random element X and a decision variable b that can be chosen from an action space B. The solution to the above problem minimizes worst-case risk over a family of ambiguous probability measures P. Such an ambiguity-averse optimal choice is also referred as a distributionally robust choice, because the performance of the chosen decision variable is guaranteed to be larger than OPT irrespective of the model picked from the family P.\n\nThere has been a broad range of ambiguity sets P that has been considered: For examples, refer [16,24,57] for moment-based uncertainty sets, [26,32,41,38,33,9,55,34,29,8] for KL-divergence and other likelihood based uncertainty sets, [42,58,20] for Wasserstein distance based neighborhoods, [19] for neighborhoods based on Prokhorov metric, [6,5] for uncertainty sets based on statistical tests and [10,12] for a general overview. As most of the works mentioned above assume the random element X to be R d -valued, it is of our interest in the following example to demonstrate the usefulness of our framework in formulating and solving distributionally robust optimization problems that involve stochastic processes taking values in general Polish spaces as well.\n\nExample 3. We continue with the insurance toy example considered in Section 3. In practice, as the risk left to the first-line insurer is too large, reinsurance is usually adopted. In proportional reinsurance, one of the popular forms of reinsurance, the insurer pays only for a proportion b of the incoming claims, and a reinsurer pays for the remaining 1 − b fraction of all the claims received. In turn, the reinsurer receives a premium at rate p r = (1 + θ)(1 − b)νcm 1 from the insurer. Here, θ > η, otherwise, the insurer could make riskless profit by reinsuring the whole portfolio. The problem we consider here is to find the reinsurance proportion b that minimises the expected maximum loss that happens within duration T. In the extensive line of research that studies optimal reinsurance proportion, diffusion models have been particularly recommended for tractability reasons (see, for example [28,47]). As in Example 1, if we take √ νm 2 B(t) + νm 1 t to be the diffusion process that approximates the arrival of claims, then\nL b (t) := p r t + b √ νm 2 B(t) + νm 1 t − pt = b √ νm 2 B(t) − bθ − (θ − η) νm 1 t\nis a suitable model for losses made by the firm. Here, p r = (1+θ)(1−b)νm 1 is the rate of payout for the reinsurance contract, and p = (1+η)νm 1 is the rate at which premium income is received by the insurance firm. The quantity of interest is to determine the reinsurance proportion b that minimises the maximum losses,\n(27) L := inf b∈[0,1] E max t∈[0,T ] L b (t) .\nHowever, as we saw in Example 1, conclusions based on diffusion approximations can be misleading. Following the practice advocated by the rich literature of robust optimization, we instead find a reinsurance proportion b that performs good against the family of models specified by P := {P : d c (P, µ) ≤ δ}. In other words, we attempt to solve for\nL := inf b∈[0,1] sup P ∈P E P sup t∈[0,T ] a 2 (b)X(t) − a 1 (b)t ,\nwhere X is a random element in space D[0, T ] following measure P, a 2 (b) := b √ νm 2 and  \na 2 (b)B(t) − a 1 (b)t + a 2 (b) √ δ.\nAs a result,\nL = inf b∈[0,1] E sup t∈[0,T ] a 2 (b)B(t) − a 1 (b)t + a 2 (b) √ δ ,(28)\nwhich is an optimization problem that involves the same effective computational effort as the non-robust counterpart in (27). For the specific numerical values employed in Example 1, if we additionally take the new parameter θ = 0.3, the Brownian approximation model evaluates to the optimal choice b = 0.66 and the corresponding loss L = 17.63, whereas the robust counterpart in (28) evaluates to worst-case L = 28.86 for the ambiguity-averse optimal choice b = 0.42.\n\n'closely' coupled with the Brownian motion B(t). Figure 3 below shows a typical coupled path output by Algorithm 1. Several independent replications of such coupled paths are used to simulate the coupled risk processes R(t) and R B (t) in Example 1, and δ is chosen as prescribed by the confidence intervals (obtained due to a straightforward application of central limit theorem) for the empirical average cost of the simulated coupling.  x(t) + , which, in turn, is smaller than u because of the way is chosen. Thus, {y ∈ S : d J 1 (x, y) < } is a subset of S \\ A u , and hence S \\ A u is open. This automatically means that the set A u is closed. x(t) + .\n\nNext, let Λ be the set of strictly increasing functions λ mapping the interval [0, T ] onto itself, such that both λ and λ −1 are continuous. Also, let e be the identity map, that is, e(t) = t, for all t in [0, T ]. Then,\nd J 1 (x, y) := inf λ∈Λ ||x − y • λ|| ∞ + ||λ − e|| ∞ ,\nwhere ||z|| ∞ = sup t∈[0,T ] |z(t)|, for any z in S. Since c(x, y) = d J 1 (x, y), we have\nc(x, A u ) = inf y∈Au inf λ∈Λ ||x − y • λ|| ∞ + ||λ − e|| ∞ .\nNext, as y • λ ∈ A u for any y ∈ A u , it is immediate that one can restrict to λ = e without loss of generality, and subsequently, the inner infimum is not necessary. In other words, x(t), the observation, which when combined with (29), is enough to arrive at the statement of Lemma 7.  As the function a 2 b − λb 2 is maximized at b = a 2 /2λ, the above lower bound simplifies to\nφ λ (x) ≥ f (x) + a 2 2 4λ .(30)\nTo obtain an upper bound, we first observe from the definition of the metric d J 1 that\nφ λ (x) = sup y∈S inf ν∈Λ f (y) − λ ||x − y • ν|| ∞ + ||ν − e|| ∞ 2 ,\nwhere the quantities Λ and e are defined as in the proof of Lemma 7. Again, as y • ν lies in S, for every time change ν ∈ Λ, one can take ν = e without loss of generality. Consequently,\nφ λ (x) = sup y∈S f (y) − λ||x − y|| 2 ∞ = sup z∈S f (x + z) − λ||z|| 2 ∞ ,\nwhere we have also changed the variable from y − x to z. In particular,  which, in turn, is maximized for ||z|| = a 2 /2λ. Combining this upper bound with the lower bound in (30), we obtain that φ λ (x) = f (x) + a 2 2 4λ 2 . Next, it is a straightforward exercise in calculus to verify that the function λδ + φ λ dµ is minimized at λ * = a 2 /2 √ δ, and subsequently, inf λ≥0 λδ + φ λ dµ = f dµ + a 2 √ δ.\n\nThis completes the proof. Proof. Let us write B 1 and B 2 to denote the half-spaces\n\n{(x 1 , x 2 ) ∈ R 2 : βx 1 + x 2 ≤ 0} and {(x 1 , x 2 ) ∈ R 2 : βx 2 + x 1 ≤ 0} respectively. Further, let A i = x ∈ S : x t ∈ B i for some t ∈ [0, T ] , i = 1, 2. Then A = A 1 ∪A 2 . For z ∈ R 2 , if we let g(z) = inf y∈B 1 ||z − y|| 2 2 , then c(x, A 1 ) ≥ inf y∈A 1 sup t:y(t)∈B 1 g(x(t)).\n\nNext, for z = (z 1 , z 2 ) / ∈ B 1 , observe that g(z) = (βz 1 + z 2 ) 2 , and consequently, c(x, A 1 ) ≥ inf (βx 1 (t) + x 2 (t)) 2 .\n\n2. 2 . 1 .\n21The Dual Problem and Weak Duality. Define Λ c,f to be the collection of all pairs (λ, φ) such that λ is a non-negative real number, φ : S → R is measurable, and(3) φ(x) + λc(x, y) ≥ f (y), for all x, y.\n\n\n(a) I = J. In other words, sup I(π) : π ∈ Φ µ,δ = inf J(λ, φ) : (λ, φ) ∈ Λ c,f . (b) For any λ ≥ 0, define φ λ : S → R ∪ {∞} as follows: φ λ (x) := sup y∈S f (y) − λc(x, y)\n\n\n.26 × 10 −4 50.78 4.88 × 10 −2 1.07 × 10 −1 12.28 150 4.36 × 10 −7 62.76 1.84 × 10 −2 2.52 × 10 −4 10.65 200 5.05 × 10 −11 69.40 1.02 × 10 −2 5.35 × 10 −8 10.80 250 6.75 × 10 −16 74.29 6.50 × 10 −3 1.15 × 10 −12 10.98\n\nFigure 1 .\n1Safety loading vs capital requirement for the Brownian model R B (t) (in red) and its robust counterpart (in blue) in Example 1. The objective is to keep the probability of ruin below 0.01.\n\n4 .\n4Proof of the duality theorem 4.1. Duality in compact spaces. We prove Theorem 1 by first proving the following progressively strong duality results in Polish spaces S that are compact. Proofs of all the technicalities that are not central to the argument are relegated to Appendix B.\n\nProof of Proposition 3 .\n3First, observe that c is a nonnegative lower semicontinuous function defined on the Polish space S × S. Therefore, we can write c = sup n c n , where (c n : n ≥ 1) is a nondecreasing sequence of continuous cost functions c n : S × S → R + .3 With c n as cost function, define the corresponding primal and dual problems,\n\nProposition 4 .\n4Let π ∈ P (S × S) be a probability measure satisfying (a) c(x, y)dπ(x, y) < ∞,(b) f (y)dπ(x, y) ∈ (−∞, ∞), and (c) π(A × S) = µ(A) for every A ∈ B(S). Then inf (λ,φ)∈Λ(Sπ×Sπ)\n\nLemma 5 .\n5For any λ ≥ 0, sup π∈E sup y∈Sπ f (y) − λc(x, y) dµ(x) = sup y∈S f (y) − λc(x, y) dµ(x).\n\n\nAs in Example 1, we take the space in which the reserve process (R(t) : 0 ≤ t ≤ T ) takes values to be S = D([0, T ], R 2 ), the set of all R 2 -valued right continuous functions with left limits defined on the interval [0, T ]. The space S, again, as in Example 1, is equipped with the standard J 1 -metric (see Chapter 3 of [56]), and consequently,\n\n\nthen one can see the ruin set B = B (0) as a special case of the parameterized family (B (c) : c ∈ R).\n\n\na conclusion similar to (13). The original ruin set B = B (0) and the suitably inflated ruin set B (1/λ * ) are respectively shown in the Figures 2(a) and (b).\n\n\nComputation of worst-case ruin using the baseline measure\n\nFigure 2 .\n2Capital requirement for various values of δ. The capital requirement is calculated to keep the worst-case probability of ruin under 0.01\n\na 1 2 .\n12(b) := (bθ − (θ − η))νm 1 . Here, as in Section 2.3.1, we have taken S = D[0, T ] andc(x, y) = d J 1 (x, y) For x ∈ D[0, T ], if we take f (x, b) := sup t∈[0,T ] a 2 (b)x(t) −a 1 (b)t and φ λ,b (x) := sup y∈S {f (y, b) − λc(x, y)} , then due to the application of Theorem 1, we obtain L = inf b∈[0,1] sup {E P [f (X, b)] : d c (P, µ) ≤ δ} = inf b∈(η,1)[0,1] inf λ≥0 λδ + φ λ,b (x)dµ(x) ,\n\nFigure 3 .\n3A\n\n\nAppendix B. Some technical proofs Lemma 6. Let S = D([0, T ], R) be equipped with the J 1 -topology. For any u > 0, the set defined by A u := {x ∈ D[0, T ] : sup t∈[0,T ] x(t) ≥ u} is closed. Proof. Pick any x / ∈ A u , and let := (u − sup t∈[0,T ] x(t))/2. As sup t∈[0,T ] x(t) < u, is strictly positive. Then, for every y ∈ S such that d J 1 (x, y) < , we have that sup t∈[0,T ] y(t) ≤ sup t∈[0,T ] x(t) + d J 1 (x, y) ≤ sup t∈[0,T ]\n\nLemma 7 .\n7Let S = D([0, T ], R). Let c(x, y) = d J 1 (x, y), for x, y in S. Next, for any u > 0, define A u := {x ∈ S : sup t∈[0,T ] x(t) ≥ u}. Then c(x, A u ) := inf{c(x, y) : y ∈ A u } is given by c(x, A u ) = u − sup t∈[0,T ] x(t), for every x / ∈ A u . Proof. For any > 0, let z(t) := x(t) + inf t∈[0,T ] (u − x(t)) + , for all t ∈ [0, T ]. As z ∈ A u , it is immediate from the definition of c(x, A u ) that c(x, A u ) ≤ d J 1 (x, z) ≤ sup t∈[0,T ] |z(t) − x(t)| = inf(u − x(t)) + = u − sup t∈[0,T ]\n\nLemma 8 .\n8Let S = D([0, T ], R) and c(x, y) = d 2 J 1(x, y). Given nonnegative constants a 1 , a 2 and λ, define the functions,f (x) = sup t∈[0,T ] a 2 x(t) − a 1 t and φ λ (x) = sup y∈S {f (y) − λc(x, y)} ,for every x ∈ S. Then, for any δ > 0,inf λ≥0 λδ + φ λ (x)dµ(x) = f (x)dµ(x) + a 2 √ δ.Proof. Fix any x ∈ S and λ > 0. For any positive constant b, as y(t) = x(t) + b is also a member of S, it follows from the definition of φ λ (x) that φ λ (x) ≥ sup y(t) − a 1 t − λd J 1 (x, y)\n\na 2\n2(x(t) + b) − a 1 t − λb 2 .\n\nLemma 9 .\n9Let S = D([0, T ], R 2 ) and c(x, y) be defined as in(25).For β ∈ [0, 1], let B = {(x 1 , x 2 ) ∈ R 2 : βx 1 + x 2 ≤ 0} ∪ {(x 1 , x 2 ) ∈ R 2 : βx 1 + x 2 ≤ 0} and A = {x ∈ S : x t ∈ B for some t ∈ [0, T ]} Then, for x ∈ S \\ A,\n\n\nFirst, see thatx (t) := x(t) − (b + )u, with b := inf t∈[0,T ] (βx 1 (t) + x 2 (t)) and u is the unit vector along the direction [β, 1], hits the half-space B 1 for some t ≤ T. As a result, c(x, A 1 ) ≤ c(x,x same line of reasoning as in the proof of Lemma 7, one can restrict to time changes λ(t) = t in the computation of lower bound. Then,\n\n\ny(t)∈B 1 (βx 1 (t) + x 2 (t)) 2 = inf t∈[0,T ]\n\n\nTo keep this discussion terse, it is verified in Lemma 8 in Appendix B that the inner infimum evaluates simply toE sup \n\nt∈[0,T ] \n\n\nAs φ λ (x) ≥ f (x), there is no ambiguity, such as the form ∞ − ∞, in the definition of integral φ λ (x)dµ(x)2 In the literature of optimal transportation of probability measures, it is common to refer joint probability measures alternatively as transport plans, and the integral cdπ as the cost of transport plan π. We follow this convention to allow easy interpretations.\nFor instance, one can choose cn(x, y) = infx,ỹ∈S {c(x,ỹ) + nd((x, y), (x,ỹ))} , where the function d metrizes the Polish space S × S.\nSee, for example, Chapter 7 of[11] for an introduction to analytic subsets and Jankov-von Neumann measurable selection theorem\nE-mail address: {jose.blanchet, karthyek.murthy}@columbia.edu\nThe authors gratefully acknowledge support from Norges Bank Investment Management and NSF grant CMMI 1436700.Acknowledgements: The authors would like to thank Garud Iyengar and David Goldberg for helpful discussions. The authors gratefully acknowledge support from Norges Bank Investment Management and NSF grant CMMI 1436700.Appendix A. Brownian embeddings for the estimation of δ in Example 1Recall that the definition of transport metric, denoted by d c (µ, ν), between two probability measures µ and ν involves computing the minimum expected cost over all possible couplings between µ and ν (see Section 2.1 for a definition). Though it may not always be possible to identify the optimal coupling (with the lowest expected cost) between µ and ν, one can perhaps employ a 'good' coupling to derive an upper bound on d c (µ, ν). In this section, we describe one such coupling, popularly referred as Skorokhod embedding, between the risk process R(t) and its Brownian motion based diffusion approximation R B (t) in Example 1. More specifically, we 'embed' the compensated compound Poisson processin a Brownian motion B(t) to obtain a coupling between the risk processes R(t) and R B (t) in order to choose a δ in Example 1. Here, the symbols m 1 and m 2 denote the first and second moments of claim sizes X i , and N t is a unit rate Poisson process. Please refer Example 1 in Section 3 for a thorough review of notations. The procedure is data-driven in the sense that we do not assume the knowledge of the distribution of claim sizes X i . Instead, we simply assume access to an oracle that provides independent realizations of claim sizes {X 1 , X 2 , . . .}. Given this access to claim size information, Algorithm 1 below specifies the coupling that embeds the process Z(t) in Brownian motion B(t).Define the auxiliary processesLet A(t) :=Ñ (t) +S(t), and identify the time change σ(t) := inf{s : A(s) = m 1 t}. Next, take the time changed version Z(t) :=S(σ(t)).Replace Z(t) by −Z(t) and B(t) by −B(t).Algorithm 1 is a brief description of the coupling developed in[35], where it is also proved that the process Z(t) output by the construction is indeed the desired compound Poisson process As is arbitrary in(31), combining the upper bound in (31) with the above lower bound results inSimilarly, one can show that, which proves the result.\nPrinciples of Real Analysis. C D Aliprantis, O Burkinshaw, Gulf Professional PublishingC. D. Aliprantis and O. Burkinshaw. Principles of Real Analysis. Gulf Professional Publishing, 1998.\n\nOptimal transportation and applications: Lectures given at the CIME summer school. L Ambrosio, L A Caffarelli, Springer Science & Business MediaL. Ambrosio and L. A. Caffarelli. Optimal transportation and applications: Lectures given at the CIME summer school 2001. Springer Science & Business Media, 2003.\n\nRuin probabilities. S Asmussen, H Albrecher, World Scientific Publishing Co. Pvt. LtdS. Asmussen and H. Albrecher. Ruin probabilities. World Scientific Publishing Co. Pvt. Ltd., 2010.\n\nRobust bounds on risk-sensitive functionals via Rényi divergence. R Atar, K Chowdhary, P Dupuis, SIAM/ASA J. Uncertain. Quantif. 31R. Atar, K. Chowdhary, and P. Dupuis. Robust bounds on risk-sensitive functionals via Rényi divergence. SIAM/ASA J. Uncertain. Quantif., 3(1):18-33, 2015.\n\nRobust option pricing. C Bandi, D Bertsimas, European J. Oper. Res. 2393C. Bandi and D. Bertsimas. Robust option pricing. European J. Oper. Res., 239(3):842-853, 2014.\n\nRobust queueing theory. C Bandi, D Bertsimas, N Youssef, Operations Research. 633C. Bandi, D. Bertsimas, and N. Youssef. Robust queueing theory. Operations Research, 63(3):676-700, 2015.\n\nOn Stein's factors for poisson approximation in wasserstein distance. A D Barbour, A Xia, Bernoulli. 126A. D. Barbour and A. Xia. On Stein's factors for poisson approximation in wasserstein distance. Bernoulli, 12(6):943-954, 2006.\n\nData-driven stochastic programming using phi-divergences. The Operations Research Revolution. G Bayraksan, D K Love, G. Bayraksan and D. K. Love. Data-driven stochastic programming using phi-divergences. The Operations Research Revolution, pages 1-19, 2015.\n\nRobust solutions of optimization problems affected by uncertain probabilities. A Ben-Tal, D Hertog, A D Waegenaere, B Melenberg, G Rennen, Management Science. 592A. Ben-Tal, D. den Hertog, A. D. Waegenaere, B. Melenberg, and G. Rennen. Robust solutions of optimiza- tion problems affected by uncertain probabilities. Management Science, 59(2):341-357, 2013.\n\nA Ben-Tal, L El Ghaoui, A Nemirovski, Robust optimization. Princeton Series in Applied Mathematics. Princeton University PressA. Ben-Tal, L. El Ghaoui, and A. Nemirovski. Robust optimization. Princeton Series in Applied Mathematics. Princeton University Press, 2009.\n\nStochastic optimal control: The discrete time case. D P Bertsekas, S E Shreve, Academic PressNew YorkD. P. Bertsekas and S. E. Shreve. Stochastic optimal control: The discrete time case. Academic Press New York, 1978.\n\nThe price of robustness. D Bertsimas, M Sim, Oper. Res. 521D. Bertsimas and M. Sim. The price of robustness. Oper. Res., 52(1):35-53, 2004.\n\nConvergence of probability measures. P Billingsley, John Wiley & SonsP. Billingsley. Convergence of probability measures. John Wiley & Sons, 1999.\n\nMeasuring distribution model risk. T Breuer, I Csiszár, Mathematical Finance. T. Breuer and I. Csiszár. Measuring distribution model risk. Mathematical Finance, 2013.\n\nLearning probability measures with respect to optimal transport metrics. G Canas, L Rosasco, Advances in Neural Information Processing Systems. G. Canas and L. Rosasco. Learning probability measures with respect to optimal transport metrics. In Advances in Neural Information Processing Systems, pages 2492-2500, 2012.\n\nDistributionally robust optimization under moment uncertainty with application to data-driven problems. E Delage, Y Ye, Oper. Res. 583E. Delage and Y. Ye. Distributionally robust optimization under moment uncertainty with application to data-driven problems. Oper. Res., 58(3):595-612, 2010.\n\nModelling extremal events. P Embrechts, C Klüppelberg, T Mikosch, Springer-VerlagNew YorkP. Embrechts, C. Klüppelberg, and T. Mikosch. Modelling extremal events. Springer-Verlag, New York, 1997.\n\nLiving on the edge. P Embrechts, S Resnick, G Samorodnitsky, Risk. 111P. Embrechts, S. Resnick, and G. Samorodnitsky. Living on the edge. Risk, 11(1):96-100, 1998.\n\nAmbiguous chance constrained problems and robust optimization. E Erdogan, G Iyengar, Math. Program. 1071-2E. Erdogan and G. Iyengar. Ambiguous chance constrained problems and robust optimization. Math. Pro- gram., 107(1-2, Ser. B):37-61, 2006.\n\nData-driven distributionally robust optimization using the Wasserstein metric: Performance guarantees and tractable reformulations. P M Esfahani, D Kuhn, arXiv:1505.05116arXiv preprintP. M. Esfahani and D. Kuhn. Data-driven distributionally robust optimization using the Wasserstein metric: Performance guarantees and tractable reformulations. arXiv preprint arXiv:1505.05116, 2015.\n\nOn the rate of convergence in Wasserstein distance of the empirical measure. N Fournier, A Guillin, Probability Theory and Related Fields. 162N. Fournier and A. Guillin. On the rate of convergence in Wasserstein distance of the empirical measure. Probability Theory and Related Fields, 162(3):707-738, 2014.\n\nLearning with a Wasserstein loss. C Frogner, C Zhang, H Mobahi, M Araya-Polo, T A Poggio, Advances in Neural Information Processing Systems (NIPS). 28C. Frogner, C. Zhang, H. Mobahi, M. Araya-Polo, and T. A. Poggio. Learning with a Wasserstein loss. In Advances in Neural Information Processing Systems (NIPS) 28, 2015.\n\nRobust risk measurement and model risk. P Glasserman, X Xu, Quantitative Finance. 141P. Glasserman and X. Xu. Robust risk measurement and model risk. Quantitative Finance, 14(1):29-58, 2014.\n\nDistributionally robust optimization and its tractable approximations. J Goh, M Sim, Oper. Res. 584J. Goh and M. Sim. Distributionally robust optimization and its tractable approximations. Oper. Res., 58(4, part 1):902-917, 2010.\n\nN Gozlan, C Leonard, Transport inequalities. A survey. Markov Processes and Related Fields. 16N. Gozlan and C. Leonard. Transport inequalities. A survey. Markov Processes and Related Fields, 16(4):707- 738, 2016.\n\nRobust control and model uncertainty. L P Hansen, T J Sargent, The American Economic Review. 912L. P. Hansen and T. J. Sargent. Robust control and model uncertainty. The American Economic Review, 91(2):pp. 60-66, 2001.\n\nRuin problems with compounding assets. J Harrison, Stochastic Processes and their Applications. 5J. Harrison. Ruin problems with compounding assets. Stochastic Processes and their Applications, 5(1):67 - 79, 1977.\n\nOptimal proportional reinsurance policies for diffusion models. B Hojgaard, M Taksar, Scandinavian Actuarial Journal. 2B. Hojgaard and M. Taksar. Optimal proportional reinsurance policies for diffusion models. Scandinavian Actuarial Journal, 1998(2):166-180, 1998.\n\nKullback-leibler divergence constrained distributionally robust optimization. Available on optimization online. Z Hu, L J Hong, Z. Hu and L. J. Hong. Kullback-leibler divergence constrained distributionally robust optimization. Available on optimization online, 2012.\n\nHeavy-tailed insurance portfolios: buffer capital and ruin probabilities. H Hult, F Lindskog, Cornell UniversityTechnical reportH. Hult and F. Lindskog. Heavy-tailed insurance portfolios: buffer capital and ruin probabilities. Technical report, Cornell University, 2006.\n\nDiffusion approximations in collective risk theory. D L Iglehart, Journal of Applied Probability. 62D. L. Iglehart. Diffusion approximations in collective risk theory. Journal of Applied Probability, 6(2):285- 292, 1969.\n\nRobust dynamic programming. G N Iyengar, Mathematics of Operations Research. 302G. N. Iyengar. Robust dynamic programming. Mathematics of Operations Research, 30(2):257-280, 2005.\n\nOn the optimality of threshold control in queues with model uncertainty. A Jain, A E B Lim, J G Shanthikumar, Queueing Systems. 652A. Jain, A. E. B. Lim, and J. G. Shanthikumar. On the optimality of threshold control in queues with model uncertainty. Queueing Systems, 65(2):157-174, 2010.\n\nData-driven chance constrained stochastic program. R Jiang, Y Guan, Mathematical Programming. R. Jiang and Y. Guan. Data-driven chance constrained stochastic program. Mathematical Programming, pages 1-37, 2015.\n\nAn embedding of compensated compound poisson processes with applications to local times. D Khoshnevisan, Ann. Probab. 211D. Khoshnevisan. An embedding of compensated compound poisson processes with applications to local times. Ann. Probab., 21(1):340-361, 01 1993.\n\nRobust sensitivity analysis for stochastic systems. H Lam, arXiv:1303.0326arXiv preprintH. Lam. Robust sensitivity analysis for stochastic systems. arXiv preprint arXiv:1303.0326, 2013.\n\nIn nature's casino. The New York Times Magazine. M Lewis, 626M. Lewis. In nature's casino. The New York Times Magazine, page 626, Aug 2007.\n\nRelative entropy, exponential utility, and robust dynamic pricing. A E Lim, J G Shanthikumar, Operations Research. 552A. E. Lim and J. G. Shanthikumar. Relative entropy, exponential utility, and robust dynamic pricing. Operations Research, 55(2):198-214, 2007.\n\nOptimization by vector space methods. D G Luenberger, John Wiley & SonsD. G. Luenberger. Optimization by vector space methods. John Wiley & Sons, 1997.\n\nConvergence of latent mixing measures in finite and infinite mixture models. X Nguyen, Ann. Statist. 4112013X. Nguyen. Convergence of latent mixing measures in finite and infinite mixture models. Ann. Statist., 41(1):370-400, 02 2013.\n\nRobust control of Markov decision processes with uncertain transition matrices. A Nilim, L El Ghaoui, Oper. Res. 535A. Nilim and L. El Ghaoui. Robust control of Markov decision processes with uncertain transition matrices. Oper. Res., 53(5):780-798, 2005.\n\nAmbiguity in portfolio selection. G Pflug, D , Quant. Finance. 74G. Pflug and D. Wozabal. Ambiguity in portfolio selection. Quant. Finance, 7(4):435-442, 2007.\n\n. S T Rachev, L Rüschendorf, Mass Transportation Problems. I: TheorySpringer Science & Business MediaS. T. Rachev and L. Rüschendorf. Mass Transportation Problems. Volume I: Theory. Springer Science & Business Media, 1998.\n\n. S T Rachev, L Rüschendorf, Mass Transportation Problems. IISpringer Science & Business MediaS. T. Rachev and L. Rüschendorf. Mass Transportation Problems. Volume II: Applications. Springer Science & Business Media, 1998.\n\nStochastic processes for insurance and finance. T Rolski, H Schmidli, V Schmidt, J Teugels, John Wiley & Sons, LtdT. Rolski, H. Schmidli, V. Schmidt, and J. Teugels. Stochastic processes for insurance and finance. John Wiley & Sons, Ltd., 1999.\n\nReal and complex analysis (3rd). W Rudin, McGraw-Hill IncW. Rudin. Real and complex analysis (3rd). McGraw-Hill Inc, 1986.\n\nOptimal proportional reinsurance policies in a dynamic setting. H Schmidli, Scandinavian Actuarial Journal. 1H. Schmidli. Optimal proportional reinsurance policies in a dynamic setting. Scandinavian Actuarial Journal, 2001(1):55-68, 2001.\n\n. A N Shiryaev, Probability, Springer-VerlagNew YorkTranslated from the first. Russian edition by R. P. BoasA. N. Shiryaev. Probability. Springer-Verlag, New York, 1996. Translated from the first (1980) Russian edition by R. P. Boas.\n\nOn general minimax theorems. M Sion, Pacific J. Math. 81M. Sion. On general minimax theorems. Pacific J. Math., 8(1):171-176, 1958.\n\nWasserstein propagation for semi-supervised learning. J Solomon, R Rustamov, L Guibas, A Butscher, Proceedings of The 31st International Conference on Machine Learning. The 31st International Conference on Machine LearningJ. Solomon, R. Rustamov, L. Guibas, and A. Butscher. Wasserstein propagation for semi-supervised learning. In Proceedings of The 31st International Conference on Machine Learning, pages 306-314, 2014.\n\nWASP: Scalable bayes via barycenters of subset posteriors. S Srivastava, V Cevher, Q Tran-Dinh, D B Dunson, AISTATS. S. Srivastava, V. Cevher, Q. Tran-Dinh, and D. B. Dunson. WASP: Scalable bayes via barycenters of subset posteriors. In AISTATS, 2015.\n\nTopics in optimal transportation. C Villani, American Mathematical SocC. Villani. Topics in optimal transportation. American Mathematical Soc., 2003.\n\nOptimal transport: old and new. C Villani, Springer Science & Business MediaC. Villani. Optimal transport: old and new. Springer Science & Business Media, 2008.\n\nSupervised earth movers distance learning and its computer vision applications. F Wang, L J Guibas, Computer Vision-ECCV 2012. SpringerF. Wang and L. J. Guibas. Supervised earth movers distance learning and its computer vision applications. In Computer Vision-ECCV 2012, pages 442-455. Springer, 2012.\n\nLikelihood robust optimization for data-driven problems. Z Wang, P W Glynn, Y Ye, Computational Management Science. Z. Wang, P. W. Glynn, and Y. Ye. Likelihood robust optimization for data-driven problems. Computational Management Science, pages 1-21, 2015.\n\nStochastic process limits. W Whitt, Springer-VerlagNew YorkW. Whitt. Stochastic process limits. Springer-Verlag, New York, 2002.\n\nDistributionally robust convex optimization. W Wiesemann, D Kuhn, M Sim, Oper. Res. 626W. Wiesemann, D. Kuhn, and M. Sim. Distributionally robust convex optimization. Oper. Res., 62(6):1358- 1376, 2014.\n\nA framework for optimization under ambiguity. D , Ann. Oper. Res. 193D. Wozabal. A framework for optimization under ambiguity. Ann. Oper. Res., 193:21-47, 2012.\n", "annotations": {"author": "[{\"end\":99,\"start\":63},{\"end\":138,\"start\":100}]", "publisher": null, "author_last_name": "[{\"end\":76,\"start\":68},{\"end\":115,\"start\":109}]", "author_first_name": "[{\"end\":67,\"start\":63},{\"end\":108,\"start\":100}]", "author_affiliation": "[{\"end\":98,\"start\":78},{\"end\":137,\"start\":117}]", "title": "[{\"end\":60,\"start\":1},{\"end\":198,\"start\":139}]", "venue": null, "abstract": "[{\"end\":1343,\"start\":407}]", "bib_ref": "[{\"attributes\":{\"ref_id\":\"b0\"},\"end\":3408,\"start\":3405},{\"attributes\":{\"ref_id\":\"b42\"},\"end\":4579,\"start\":4575},{\"attributes\":{\"ref_id\":\"b43\"},\"end\":4582,\"start\":4579},{\"attributes\":{\"ref_id\":\"b52\"},\"end\":4585,\"start\":4582},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":4587,\"start\":4585},{\"attributes\":{\"ref_id\":\"b6\"},\"end\":4646,\"start\":4643},{\"attributes\":{\"ref_id\":\"b24\"},\"end\":4649,\"start\":4646},{\"attributes\":{\"ref_id\":\"b39\"},\"end\":4652,\"start\":4649},{\"attributes\":{\"ref_id\":\"b53\"},\"end\":4655,\"start\":4652},{\"attributes\":{\"ref_id\":\"b20\"},\"end\":4658,\"start\":4655},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":4661,\"start\":4658},{\"attributes\":{\"ref_id\":\"b49\"},\"end\":4664,\"start\":4661},{\"attributes\":{\"ref_id\":\"b50\"},\"end\":4667,\"start\":4664},{\"attributes\":{\"ref_id\":\"b21\"},\"end\":4670,\"start\":4667},{\"attributes\":{\"ref_id\":\"b13\"},\"end\":4968,\"start\":4964},{\"attributes\":{\"ref_id\":\"b35\"},\"end\":4971,\"start\":4968},{\"attributes\":{\"ref_id\":\"b22\"},\"end\":4974,\"start\":4971},{\"attributes\":{\"ref_id\":\"b3\"},\"end\":4976,\"start\":4974},{\"attributes\":{\"ref_id\":\"b25\"},\"end\":5029,\"start\":5025},{\"attributes\":{\"ref_id\":\"b31\"},\"end\":5032,\"start\":5029},{\"attributes\":{\"ref_id\":\"b40\"},\"end\":5035,\"start\":5032},{\"attributes\":{\"ref_id\":\"b37\"},\"end\":5038,\"start\":5035},{\"attributes\":{\"ref_id\":\"b32\"},\"end\":5041,\"start\":5038},{\"attributes\":{\"ref_id\":\"b8\"},\"end\":5043,\"start\":5041},{\"attributes\":{\"ref_id\":\"b54\"},\"end\":5046,\"start\":5043},{\"attributes\":{\"ref_id\":\"b33\"},\"end\":5049,\"start\":5046},{\"attributes\":{\"ref_id\":\"b28\"},\"end\":5052,\"start\":5049},{\"attributes\":{\"ref_id\":\"b7\"},\"end\":5054,\"start\":5052},{\"attributes\":{\"ref_id\":\"b19\"},\"end\":9240,\"start\":9236},{\"attributes\":{\"ref_id\":\"b41\"},\"end\":9448,\"start\":9444},{\"attributes\":{\"ref_id\":\"b57\"},\"end\":9457,\"start\":9453},{\"attributes\":{\"ref_id\":\"b19\"},\"end\":9574,\"start\":9570},{\"attributes\":{\"ref_id\":\"b19\"},\"end\":9648,\"start\":9644},{\"attributes\":{\"ref_id\":\"b52\"},\"end\":13983,\"start\":13979},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":15459,\"start\":15456},{\"attributes\":{\"ref_id\":\"b19\"},\"end\":19422,\"start\":19418},{\"attributes\":{\"ref_id\":\"b8\"},\"end\":19620,\"start\":19617},{\"attributes\":{\"ref_id\":\"b2\"},\"end\":24039,\"start\":24036},{\"attributes\":{\"ref_id\":\"b16\"},\"end\":24045,\"start\":24041},{\"attributes\":{\"ref_id\":\"b44\"},\"end\":24051,\"start\":24047},{\"attributes\":{\"ref_id\":\"b30\"},\"end\":24636,\"start\":24632},{\"attributes\":{\"ref_id\":\"b26\"},\"end\":24654,\"start\":24650},{\"attributes\":{\"ref_id\":\"b55\"},\"end\":25848,\"start\":25844},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":27125,\"start\":27121},{\"attributes\":{\"ref_id\":\"b34\"},\"end\":28482,\"start\":28478},{\"attributes\":{\"ref_id\":\"b17\"},\"end\":31403,\"start\":31399},{\"attributes\":{\"ref_id\":\"b36\"},\"end\":31409,\"start\":31405},{\"attributes\":{\"ref_id\":\"b25\"},\"end\":32574,\"start\":32570},{\"attributes\":{\"ref_id\":\"b8\"},\"end\":32576,\"start\":32574},{\"attributes\":{\"ref_id\":\"b13\"},\"end\":32579,\"start\":32576},{\"attributes\":{\"ref_id\":\"b51\"},\"end\":33573,\"start\":33569},{\"attributes\":{\"ref_id\":\"b38\"},\"end\":33639,\"start\":33635},{\"attributes\":{\"ref_id\":\"b45\"},\"end\":34464,\"start\":34460},{\"attributes\":{\"ref_id\":\"b0\"},\"end\":35802,\"start\":35799},{\"attributes\":{\"ref_id\":\"b38\"},\"end\":36850,\"start\":36846},{\"attributes\":{\"ref_id\":\"b13\"},\"end\":38470,\"start\":38466},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":39838,\"start\":39834},{\"attributes\":{\"ref_id\":\"b12\"},\"end\":40219,\"start\":40215},{\"attributes\":{\"ref_id\":\"b16\"},\"end\":41140,\"start\":41136},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":41178,\"start\":41174},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":41917,\"start\":41913},{\"attributes\":{\"ref_id\":\"b18\"},\"end\":42969,\"start\":42965},{\"attributes\":{\"ref_id\":\"b19\"},\"end\":43315,\"start\":43311},{\"attributes\":{\"ref_id\":\"b47\"},\"end\":43487,\"start\":43483},{\"attributes\":{\"ref_id\":\"b48\"},\"end\":45521,\"start\":45517},{\"attributes\":{\"ref_id\":\"b20\"},\"end\":45644,\"start\":45640},{\"attributes\":{\"ref_id\":\"b21\"},\"end\":47463,\"start\":47459},{\"attributes\":{\"ref_id\":\"b22\"},\"end\":48352,\"start\":48348},{\"attributes\":{\"ref_id\":\"b29\"},\"end\":53591,\"start\":53587},{\"attributes\":{\"ref_id\":\"b25\"},\"end\":55910,\"start\":55906},{\"attributes\":{\"ref_id\":\"b24\"},\"end\":56288,\"start\":56284},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":58423,\"start\":58419},{\"attributes\":{\"ref_id\":\"b23\"},\"end\":58426,\"start\":58423},{\"attributes\":{\"ref_id\":\"b56\"},\"end\":58429,\"start\":58426},{\"attributes\":{\"ref_id\":\"b25\"},\"end\":58469,\"start\":58465},{\"attributes\":{\"ref_id\":\"b31\"},\"end\":58472,\"start\":58469},{\"attributes\":{\"ref_id\":\"b40\"},\"end\":58475,\"start\":58472},{\"attributes\":{\"ref_id\":\"b37\"},\"end\":58478,\"start\":58475},{\"attributes\":{\"ref_id\":\"b32\"},\"end\":58481,\"start\":58478},{\"attributes\":{\"ref_id\":\"b8\"},\"end\":58483,\"start\":58481},{\"attributes\":{\"ref_id\":\"b54\"},\"end\":58486,\"start\":58483},{\"attributes\":{\"ref_id\":\"b33\"},\"end\":58489,\"start\":58486},{\"attributes\":{\"ref_id\":\"b28\"},\"end\":58492,\"start\":58489},{\"attributes\":{\"ref_id\":\"b7\"},\"end\":58494,\"start\":58492},{\"attributes\":{\"ref_id\":\"b41\"},\"end\":58562,\"start\":58558},{\"attributes\":{\"ref_id\":\"b57\"},\"end\":58565,\"start\":58562},{\"attributes\":{\"ref_id\":\"b19\"},\"end\":58568,\"start\":58565},{\"attributes\":{\"ref_id\":\"b18\"},\"end\":58619,\"start\":58615},{\"attributes\":{\"ref_id\":\"b5\"},\"end\":58668,\"start\":58665},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":58670,\"start\":58668},{\"attributes\":{\"ref_id\":\"b9\"},\"end\":58727,\"start\":58723},{\"attributes\":{\"ref_id\":\"b11\"},\"end\":58730,\"start\":58727},{\"attributes\":{\"ref_id\":\"b27\"},\"end\":59999,\"start\":59995},{\"attributes\":{\"ref_id\":\"b46\"},\"end\":60002,\"start\":59999},{\"attributes\":{\"ref_id\":\"b26\"},\"end\":61341,\"start\":61337},{\"attributes\":{\"ref_id\":\"b27\"},\"end\":61601,\"start\":61597},{\"attributes\":{\"ref_id\":\"b28\"},\"end\":63014,\"start\":63010},{\"attributes\":{\"ref_id\":\"b2\"},\"end\":64712,\"start\":64709},{\"attributes\":{\"ref_id\":\"b2\"},\"end\":65908,\"start\":65907},{\"attributes\":{\"ref_id\":\"b24\"},\"end\":69061,\"start\":69057},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":69871,\"start\":69870},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":70303,\"start\":70299}]", "figure": "[{\"attributes\":{\"id\":\"fig_0\"},\"end\":64751,\"start\":64535},{\"attributes\":{\"id\":\"fig_1\"},\"end\":64926,\"start\":64752},{\"attributes\":{\"id\":\"fig_2\"},\"end\":65146,\"start\":64927},{\"attributes\":{\"id\":\"fig_3\"},\"end\":65349,\"start\":65147},{\"attributes\":{\"id\":\"fig_4\"},\"end\":65639,\"start\":65350},{\"attributes\":{\"id\":\"fig_5\"},\"end\":65986,\"start\":65640},{\"attributes\":{\"id\":\"fig_6\"},\"end\":66179,\"start\":65987},{\"attributes\":{\"id\":\"fig_7\"},\"end\":66280,\"start\":66180},{\"attributes\":{\"id\":\"fig_8\"},\"end\":66633,\"start\":66281},{\"attributes\":{\"id\":\"fig_9\"},\"end\":66738,\"start\":66634},{\"attributes\":{\"id\":\"fig_10\"},\"end\":66900,\"start\":66739},{\"attributes\":{\"id\":\"fig_11\"},\"end\":66960,\"start\":66901},{\"attributes\":{\"id\":\"fig_13\"},\"end\":67110,\"start\":66961},{\"attributes\":{\"id\":\"fig_14\"},\"end\":67509,\"start\":67111},{\"attributes\":{\"id\":\"fig_15\"},\"end\":67524,\"start\":67510},{\"attributes\":{\"id\":\"fig_16\"},\"end\":67962,\"start\":67525},{\"attributes\":{\"id\":\"fig_17\"},\"end\":68469,\"start\":67963},{\"attributes\":{\"id\":\"fig_19\"},\"end\":68957,\"start\":68470},{\"attributes\":{\"id\":\"fig_20\"},\"end\":68991,\"start\":68958},{\"attributes\":{\"id\":\"fig_23\"},\"end\":69231,\"start\":68992},{\"attributes\":{\"id\":\"fig_24\"},\"end\":69576,\"start\":69232},{\"attributes\":{\"id\":\"fig_25\"},\"end\":69625,\"start\":69577},{\"attributes\":{\"id\":\"tab_0\",\"type\":\"table\"},\"end\":69760,\"start\":69626}]", "paragraph": "[{\"end\":1720,\"start\":1359},{\"end\":2054,\"start\":1722},{\"end\":2151,\"start\":2056},{\"end\":2590,\"start\":2153},{\"end\":2821,\"start\":2592},{\"end\":3080,\"start\":2823},{\"end\":3412,\"start\":3082},{\"end\":4250,\"start\":3424},{\"end\":4721,\"start\":4252},{\"end\":6038,\"start\":4723},{\"end\":6332,\"start\":6040},{\"end\":7169,\"start\":6334},{\"end\":7790,\"start\":7171},{\"end\":9215,\"start\":7792},{\"end\":10190,\"start\":9217},{\"end\":10889,\"start\":10192},{\"end\":11369,\"start\":10909},{\"end\":11579,\"start\":11371},{\"end\":12034,\"start\":11581},{\"end\":12574,\"start\":12036},{\"end\":12855,\"start\":12576},{\"end\":13484,\"start\":12925},{\"end\":14025,\"start\":13486},{\"end\":14124,\"start\":14027},{\"end\":14478,\"start\":14153},{\"end\":14739,\"start\":14555},{\"end\":14860,\"start\":14772},{\"end\":15051,\"start\":14862},{\"end\":15106,\"start\":15053},{\"end\":15253,\"start\":15232},{\"end\":15500,\"start\":15297},{\"end\":15642,\"start\":15502},{\"end\":15768,\"start\":15651},{\"end\":15819,\"start\":15803},{\"end\":15954,\"start\":15908},{\"end\":16527,\"start\":16031},{\"end\":16736,\"start\":16529},{\"end\":17066,\"start\":16845},{\"end\":17193,\"start\":17080},{\"end\":17952,\"start\":17246},{\"end\":18100,\"start\":17954},{\"end\":18753,\"start\":18170},{\"end\":18985,\"start\":18827},{\"end\":19086,\"start\":18987},{\"end\":19229,\"start\":19097},{\"end\":19621,\"start\":19267},{\"end\":19645,\"start\":19623},{\"end\":19980,\"start\":19694},{\"end\":20230,\"start\":20019},{\"end\":20353,\"start\":20343},{\"end\":20427,\"start\":20355},{\"end\":20556,\"start\":20500},{\"end\":20915,\"start\":20696},{\"end\":21010,\"start\":20974},{\"end\":21329,\"start\":21065},{\"end\":21564,\"start\":21331},{\"end\":21911,\"start\":21603},{\"end\":22291,\"start\":21962},{\"end\":22908,\"start\":22341},{\"end\":23336,\"start\":22910},{\"end\":23897,\"start\":23377},{\"end\":24348,\"start\":23899},{\"end\":25021,\"start\":24431},{\"end\":25400,\"start\":25116},{\"end\":25996,\"start\":25402},{\"end\":26179,\"start\":26032},{\"end\":26563,\"start\":26235},{\"end\":26747,\"start\":26649},{\"end\":26998,\"start\":26791},{\"end\":27190,\"start\":27075},{\"end\":27638,\"start\":27279},{\"end\":29696,\"start\":27640},{\"end\":30570,\"start\":29735},{\"end\":33273,\"start\":30764},{\"end\":33494,\"start\":33275},{\"end\":33987,\"start\":33496},{\"end\":34833,\"start\":33989},{\"end\":35026,\"start\":34882},{\"end\":35059,\"start\":35028},{\"end\":35138,\"start\":35061},{\"end\":35315,\"start\":35202},{\"end\":35537,\"start\":35394},{\"end\":35552,\"start\":35539},{\"end\":35882,\"start\":35705},{\"end\":36173,\"start\":35884},{\"end\":36277,\"start\":36193},{\"end\":36384,\"start\":36344},{\"end\":36489,\"start\":36386},{\"end\":36862,\"start\":36491},{\"end\":37008,\"start\":36927},{\"end\":37405,\"start\":37067},{\"end\":37552,\"start\":37407},{\"end\":37762,\"start\":37554},{\"end\":37986,\"start\":37830},{\"end\":38365,\"start\":38030},{\"end\":38592,\"start\":38434},{\"end\":38687,\"start\":38620},{\"end\":38973,\"start\":38696},{\"end\":39240,\"start\":39004},{\"end\":39434,\"start\":39242},{\"end\":39905,\"start\":39500},{\"end\":40332,\"start\":39914},{\"end\":40751,\"start\":40448},{\"end\":40816,\"start\":40753},{\"end\":40993,\"start\":40818},{\"end\":41120,\"start\":40995},{\"end\":41371,\"start\":41122},{\"end\":41781,\"start\":41373},{\"end\":41918,\"start\":41849},{\"end\":42126,\"start\":41973},{\"end\":42343,\"start\":42182},{\"end\":42696,\"start\":42375},{\"end\":42886,\"start\":42698},{\"end\":43000,\"start\":42945},{\"end\":43542,\"start\":43057},{\"end\":43951,\"start\":43594},{\"end\":44292,\"start\":43953},{\"end\":44459,\"start\":44379},{\"end\":44674,\"start\":44461},{\"end\":44941,\"start\":44708},{\"end\":45258,\"start\":45065},{\"end\":45534,\"start\":45391},{\"end\":45652,\"start\":45602},{\"end\":45856,\"start\":45751},{\"end\":46018,\"start\":45963},{\"end\":46159,\"start\":46020},{\"end\":46948,\"start\":46265},{\"end\":47039,\"start\":46985},{\"end\":47339,\"start\":47104},{\"end\":47547,\"start\":47403},{\"end\":47682,\"start\":47611},{\"end\":48015,\"start\":47720},{\"end\":48197,\"start\":48112},{\"end\":48424,\"start\":48309},{\"end\":48514,\"start\":48505},{\"end\":48709,\"start\":48585},{\"end\":48806,\"start\":48711},{\"end\":49398,\"start\":48839},{\"end\":49773,\"start\":49427},{\"end\":49962,\"start\":49924},{\"end\":50411,\"start\":49964},{\"end\":50666,\"start\":50517},{\"end\":50821,\"start\":50729},{\"end\":50919,\"start\":50886},{\"end\":51019,\"start\":50921},{\"end\":51205,\"start\":51098},{\"end\":51796,\"start\":51229},{\"end\":51939,\"start\":51798},{\"end\":53013,\"start\":51941},{\"end\":54166,\"start\":53095},{\"end\":54389,\"start\":54203},{\"end\":54593,\"start\":54454},{\"end\":54772,\"start\":54760},{\"end\":55025,\"start\":54919},{\"end\":55796,\"start\":55118},{\"end\":57485,\"start\":55840},{\"end\":57793,\"start\":57494},{\"end\":58322,\"start\":57832},{\"end\":59087,\"start\":58324},{\"end\":60127,\"start\":59089},{\"end\":60534,\"start\":60213},{\"end\":60930,\"start\":60582},{\"end\":61091,\"start\":60999},{\"end\":61142,\"start\":61130},{\"end\":61685,\"start\":61217},{\"end\":62345,\"start\":61687},{\"end\":62568,\"start\":62347},{\"end\":62715,\"start\":62625},{\"end\":63159,\"start\":62778},{\"end\":63280,\"start\":63193},{\"end\":63536,\"start\":63351},{\"end\":64019,\"start\":63613},{\"end\":64104,\"start\":64021},{\"end\":64398,\"start\":64106},{\"end\":64534,\"start\":64400}]", "formula": "[{\"attributes\":{\"id\":\"formula_0\"},\"end\":3423,\"start\":3413},{\"attributes\":{\"id\":\"formula_1\"},\"end\":12924,\"start\":12856},{\"attributes\":{\"id\":\"formula_2\"},\"end\":14152,\"start\":14125},{\"attributes\":{\"id\":\"formula_3\"},\"end\":14554,\"start\":14479},{\"attributes\":{\"id\":\"formula_4\"},\"end\":14771,\"start\":14740},{\"attributes\":{\"id\":\"formula_5\"},\"end\":15231,\"start\":15107},{\"attributes\":{\"id\":\"formula_6\"},\"end\":15296,\"start\":15254},{\"attributes\":{\"id\":\"formula_7\"},\"end\":15802,\"start\":15769},{\"attributes\":{\"id\":\"formula_8\"},\"end\":15907,\"start\":15820},{\"attributes\":{\"id\":\"formula_9\"},\"end\":16030,\"start\":15955},{\"attributes\":{\"id\":\"formula_10\"},\"end\":16844,\"start\":16737},{\"attributes\":{\"id\":\"formula_11\"},\"end\":17245,\"start\":17194},{\"attributes\":{\"id\":\"formula_12\"},\"end\":18169,\"start\":18101},{\"attributes\":{\"id\":\"formula_13\"},\"end\":18826,\"start\":18754},{\"attributes\":{\"id\":\"formula_14\"},\"end\":19266,\"start\":19230},{\"attributes\":{\"id\":\"formula_15\"},\"end\":19693,\"start\":19646},{\"attributes\":{\"id\":\"formula_16\"},\"end\":20018,\"start\":19981},{\"attributes\":{\"id\":\"formula_17\"},\"end\":20342,\"start\":20231},{\"attributes\":{\"id\":\"formula_18\"},\"end\":20499,\"start\":20428},{\"attributes\":{\"id\":\"formula_19\"},\"end\":20695,\"start\":20557},{\"attributes\":{\"id\":\"formula_20\"},\"end\":20973,\"start\":20916},{\"attributes\":{\"id\":\"formula_21\"},\"end\":21064,\"start\":21011},{\"attributes\":{\"id\":\"formula_22\"},\"end\":21602,\"start\":21565},{\"attributes\":{\"id\":\"formula_23\"},\"end\":21961,\"start\":21912},{\"attributes\":{\"id\":\"formula_24\"},\"end\":23376,\"start\":23337},{\"attributes\":{\"id\":\"formula_25\"},\"end\":24430,\"start\":24349},{\"attributes\":{\"id\":\"formula_26\"},\"end\":25115,\"start\":25022},{\"attributes\":{\"id\":\"formula_27\"},\"end\":26031,\"start\":25997},{\"attributes\":{\"id\":\"formula_28\"},\"end\":26234,\"start\":26180},{\"attributes\":{\"id\":\"formula_29\"},\"end\":26648,\"start\":26564},{\"attributes\":{\"id\":\"formula_30\"},\"end\":26790,\"start\":26748},{\"attributes\":{\"id\":\"formula_31\"},\"end\":27074,\"start\":26999},{\"attributes\":{\"id\":\"formula_32\"},\"end\":27278,\"start\":27191},{\"attributes\":{\"id\":\"formula_33\"},\"end\":29734,\"start\":29697},{\"attributes\":{\"id\":\"formula_34\"},\"end\":30763,\"start\":30571},{\"attributes\":{\"id\":\"formula_35\"},\"end\":34881,\"start\":34834},{\"attributes\":{\"id\":\"formula_36\"},\"end\":35201,\"start\":35139},{\"attributes\":{\"id\":\"formula_37\"},\"end\":35393,\"start\":35316},{\"attributes\":{\"id\":\"formula_38\"},\"end\":35704,\"start\":35553},{\"attributes\":{\"id\":\"formula_39\"},\"end\":36192,\"start\":36174},{\"attributes\":{\"id\":\"formula_40\"},\"end\":36343,\"start\":36278},{\"attributes\":{\"id\":\"formula_41\"},\"end\":36926,\"start\":36863},{\"attributes\":{\"id\":\"formula_42\"},\"end\":37066,\"start\":37009},{\"attributes\":{\"id\":\"formula_44\"},\"end\":37829,\"start\":37763},{\"attributes\":{\"id\":\"formula_45\"},\"end\":38029,\"start\":37987},{\"attributes\":{\"id\":\"formula_46\"},\"end\":38433,\"start\":38366},{\"attributes\":{\"id\":\"formula_47\"},\"end\":38619,\"start\":38593},{\"attributes\":{\"id\":\"formula_48\"},\"end\":39003,\"start\":38974},{\"attributes\":{\"id\":\"formula_50\"},\"end\":39499,\"start\":39435},{\"attributes\":{\"id\":\"formula_51\"},\"end\":40447,\"start\":40333},{\"attributes\":{\"id\":\"formula_54\"},\"end\":41848,\"start\":41782},{\"attributes\":{\"id\":\"formula_55\"},\"end\":41972,\"start\":41919},{\"attributes\":{\"id\":\"formula_56\"},\"end\":42181,\"start\":42127},{\"attributes\":{\"id\":\"formula_57\"},\"end\":42374,\"start\":42344},{\"attributes\":{\"id\":\"formula_58\"},\"end\":42944,\"start\":42887},{\"attributes\":{\"id\":\"formula_59\"},\"end\":43056,\"start\":43001},{\"attributes\":{\"id\":\"formula_60\"},\"end\":43593,\"start\":43543},{\"attributes\":{\"id\":\"formula_61\"},\"end\":44378,\"start\":44293},{\"attributes\":{\"id\":\"formula_62\"},\"end\":44707,\"start\":44675},{\"attributes\":{\"id\":\"formula_63\"},\"end\":45064,\"start\":44942},{\"attributes\":{\"id\":\"formula_64\"},\"end\":45390,\"start\":45259},{\"attributes\":{\"id\":\"formula_65\"},\"end\":45601,\"start\":45535},{\"attributes\":{\"id\":\"formula_66\"},\"end\":45750,\"start\":45653},{\"attributes\":{\"id\":\"formula_67\"},\"end\":45962,\"start\":45903},{\"attributes\":{\"id\":\"formula_68\"},\"end\":46264,\"start\":46160},{\"attributes\":{\"id\":\"formula_69\"},\"end\":46984,\"start\":46949},{\"attributes\":{\"id\":\"formula_70\"},\"end\":47103,\"start\":47040},{\"attributes\":{\"id\":\"formula_71\"},\"end\":47402,\"start\":47340},{\"attributes\":{\"id\":\"formula_72\"},\"end\":47610,\"start\":47548},{\"attributes\":{\"id\":\"formula_73\"},\"end\":47719,\"start\":47683},{\"attributes\":{\"id\":\"formula_74\"},\"end\":48111,\"start\":48016},{\"attributes\":{\"id\":\"formula_75\"},\"end\":48308,\"start\":48198},{\"attributes\":{\"id\":\"formula_76\"},\"end\":48504,\"start\":48425},{\"attributes\":{\"id\":\"formula_77\"},\"end\":48584,\"start\":48515},{\"attributes\":{\"id\":\"formula_78\"},\"end\":48838,\"start\":48807},{\"attributes\":{\"id\":\"formula_79\"},\"end\":49426,\"start\":49399},{\"attributes\":{\"id\":\"formula_80\"},\"end\":49923,\"start\":49774},{\"attributes\":{\"id\":\"formula_81\"},\"end\":50516,\"start\":50412},{\"attributes\":{\"id\":\"formula_82\"},\"end\":50728,\"start\":50667},{\"attributes\":{\"id\":\"formula_83\"},\"end\":50885,\"start\":50822},{\"attributes\":{\"id\":\"formula_84\"},\"end\":51097,\"start\":51020},{\"attributes\":{\"id\":\"formula_85\"},\"end\":53094,\"start\":53014},{\"attributes\":{\"id\":\"formula_86\"},\"end\":54202,\"start\":54167},{\"attributes\":{\"id\":\"formula_87\"},\"end\":54453,\"start\":54390},{\"attributes\":{\"id\":\"formula_88\"},\"end\":54678,\"start\":54594},{\"attributes\":{\"id\":\"formula_89\"},\"end\":54759,\"start\":54678},{\"attributes\":{\"id\":\"formula_90\"},\"end\":54918,\"start\":54773},{\"attributes\":{\"id\":\"formula_91\"},\"end\":55091,\"start\":55026},{\"attributes\":{\"id\":\"formula_92\"},\"end\":55117,\"start\":55091},{\"attributes\":{\"id\":\"formula_93\"},\"end\":55839,\"start\":55797},{\"attributes\":{\"id\":\"formula_94\"},\"end\":57831,\"start\":57794},{\"attributes\":{\"id\":\"formula_95\"},\"end\":60212,\"start\":60128},{\"attributes\":{\"id\":\"formula_96\"},\"end\":60581,\"start\":60535},{\"attributes\":{\"id\":\"formula_97\"},\"end\":60998,\"start\":60931},{\"attributes\":{\"id\":\"formula_98\"},\"end\":61129,\"start\":61092},{\"attributes\":{\"id\":\"formula_99\"},\"end\":61216,\"start\":61143},{\"attributes\":{\"id\":\"formula_101\"},\"end\":62624,\"start\":62569},{\"attributes\":{\"id\":\"formula_102\"},\"end\":62777,\"start\":62716},{\"attributes\":{\"id\":\"formula_103\"},\"end\":63192,\"start\":63160},{\"attributes\":{\"id\":\"formula_104\"},\"end\":63350,\"start\":63281},{\"attributes\":{\"id\":\"formula_105\"},\"end\":63612,\"start\":63537}]", "table_ref": "[{\"end\":29346,\"start\":29339},{\"end\":29974,\"start\":29967}]", "section_header": "[{\"attributes\":{\"n\":\"1.\"},\"end\":1357,\"start\":1345},{\"attributes\":{\"n\":\"2.\"},\"end\":10907,\"start\":10892},{\"end\":15649,\"start\":15645},{\"end\":17078,\"start\":17069},{\"end\":19095,\"start\":19089},{\"attributes\":{\"n\":\"3.\"},\"end\":22339,\"start\":22294},{\"end\":38694,\"start\":38690},{\"end\":39912,\"start\":39908},{\"end\":45902,\"start\":45859},{\"attributes\":{\"n\":\"5.\"},\"end\":51227,\"start\":51208},{\"end\":57492,\"start\":57488},{\"end\":64546,\"start\":64536},{\"end\":65158,\"start\":65148},{\"end\":65354,\"start\":65351},{\"end\":65665,\"start\":65641},{\"end\":66003,\"start\":65988},{\"end\":66190,\"start\":66181},{\"end\":66972,\"start\":66962},{\"end\":67119,\"start\":67112},{\"end\":67521,\"start\":67511},{\"end\":67973,\"start\":67964},{\"end\":68480,\"start\":68471},{\"end\":68962,\"start\":68959},{\"end\":69002,\"start\":68993}]", "table": "[{\"end\":69760,\"start\":69741}]", "figure_caption": "[{\"end\":64751,\"start\":64549},{\"end\":64926,\"start\":64754},{\"end\":65146,\"start\":64929},{\"end\":65349,\"start\":65160},{\"end\":65639,\"start\":65356},{\"end\":65986,\"start\":65667},{\"end\":66179,\"start\":66005},{\"end\":66280,\"start\":66192},{\"end\":66633,\"start\":66283},{\"end\":66738,\"start\":66636},{\"end\":66900,\"start\":66741},{\"end\":66960,\"start\":66903},{\"end\":67110,\"start\":66974},{\"end\":67509,\"start\":67122},{\"end\":67524,\"start\":67523},{\"end\":67962,\"start\":67527},{\"end\":68469,\"start\":67975},{\"end\":68957,\"start\":68482},{\"end\":68991,\"start\":68964},{\"end\":69231,\"start\":69004},{\"end\":69576,\"start\":69234},{\"end\":69625,\"start\":69579},{\"end\":69741,\"start\":69628}]", "figure_ref": "[{\"attributes\":{\"ref_id\":\"fig_3\"},\"end\":30388,\"start\":30380},{\"attributes\":{\"ref_id\":\"fig_3\"},\"end\":31595,\"start\":31587},{\"attributes\":{\"ref_id\":\"fig_13\"},\"end\":55999,\"start\":55991},{\"attributes\":{\"ref_id\":\"fig_5\"},\"end\":61744,\"start\":61736}]", "bib_author_first_name": "[{\"end\":72836,\"start\":72835},{\"end\":72838,\"start\":72837},{\"end\":72852,\"start\":72851},{\"end\":73079,\"start\":73078},{\"end\":73091,\"start\":73090},{\"end\":73093,\"start\":73092},{\"end\":73324,\"start\":73323},{\"end\":73336,\"start\":73335},{\"end\":73555,\"start\":73554},{\"end\":73563,\"start\":73562},{\"end\":73576,\"start\":73575},{\"end\":73799,\"start\":73798},{\"end\":73808,\"start\":73807},{\"end\":73969,\"start\":73968},{\"end\":73978,\"start\":73977},{\"end\":73991,\"start\":73990},{\"end\":74203,\"start\":74202},{\"end\":74205,\"start\":74204},{\"end\":74216,\"start\":74215},{\"end\":74460,\"start\":74459},{\"end\":74473,\"start\":74472},{\"end\":74475,\"start\":74474},{\"end\":74704,\"start\":74703},{\"end\":74715,\"start\":74714},{\"end\":74725,\"start\":74724},{\"end\":74727,\"start\":74726},{\"end\":74741,\"start\":74740},{\"end\":74754,\"start\":74753},{\"end\":74984,\"start\":74983},{\"end\":74995,\"start\":74994},{\"end\":74998,\"start\":74996},{\"end\":75008,\"start\":75007},{\"end\":75304,\"start\":75303},{\"end\":75306,\"start\":75305},{\"end\":75319,\"start\":75318},{\"end\":75321,\"start\":75320},{\"end\":75496,\"start\":75495},{\"end\":75509,\"start\":75508},{\"end\":75649,\"start\":75648},{\"end\":75795,\"start\":75794},{\"end\":75805,\"start\":75804},{\"end\":76001,\"start\":76000},{\"end\":76010,\"start\":76009},{\"end\":76352,\"start\":76351},{\"end\":76362,\"start\":76361},{\"end\":76568,\"start\":76567},{\"end\":76581,\"start\":76580},{\"end\":76596,\"start\":76595},{\"end\":76757,\"start\":76756},{\"end\":76770,\"start\":76769},{\"end\":76781,\"start\":76780},{\"end\":76965,\"start\":76964},{\"end\":76976,\"start\":76975},{\"end\":77279,\"start\":77278},{\"end\":77281,\"start\":77280},{\"end\":77293,\"start\":77292},{\"end\":77608,\"start\":77607},{\"end\":77620,\"start\":77619},{\"end\":77874,\"start\":77873},{\"end\":77885,\"start\":77884},{\"end\":77894,\"start\":77893},{\"end\":77904,\"start\":77903},{\"end\":77918,\"start\":77917},{\"end\":77920,\"start\":77919},{\"end\":78201,\"start\":78200},{\"end\":78215,\"start\":78214},{\"end\":78424,\"start\":78423},{\"end\":78431,\"start\":78430},{\"end\":78584,\"start\":78583},{\"end\":78594,\"start\":78593},{\"end\":78836,\"start\":78835},{\"end\":78838,\"start\":78837},{\"end\":78848,\"start\":78847},{\"end\":78850,\"start\":78849},{\"end\":79057,\"start\":79056},{\"end\":79297,\"start\":79296},{\"end\":79309,\"start\":79308},{\"end\":79611,\"start\":79610},{\"end\":79617,\"start\":79616},{\"end\":79619,\"start\":79618},{\"end\":79842,\"start\":79841},{\"end\":79850,\"start\":79849},{\"end\":80092,\"start\":80091},{\"end\":80094,\"start\":80093},{\"end\":80290,\"start\":80289},{\"end\":80292,\"start\":80291},{\"end\":80516,\"start\":80515},{\"end\":80524,\"start\":80523},{\"end\":80528,\"start\":80525},{\"end\":80535,\"start\":80534},{\"end\":80537,\"start\":80536},{\"end\":80785,\"start\":80784},{\"end\":80794,\"start\":80793},{\"end\":81035,\"start\":81034},{\"end\":81264,\"start\":81263},{\"end\":81448,\"start\":81447},{\"end\":81607,\"start\":81606},{\"end\":81609,\"start\":81608},{\"end\":81616,\"start\":81615},{\"end\":81618,\"start\":81617},{\"end\":81840,\"start\":81839},{\"end\":81842,\"start\":81841},{\"end\":82032,\"start\":82031},{\"end\":82271,\"start\":82270},{\"end\":82280,\"start\":82279},{\"end\":82283,\"start\":82281},{\"end\":82482,\"start\":82481},{\"end\":82491,\"start\":82490},{\"end\":82611,\"start\":82610},{\"end\":82613,\"start\":82612},{\"end\":82623,\"start\":82622},{\"end\":82835,\"start\":82834},{\"end\":82837,\"start\":82836},{\"end\":82847,\"start\":82846},{\"end\":83105,\"start\":83104},{\"end\":83115,\"start\":83114},{\"end\":83127,\"start\":83126},{\"end\":83138,\"start\":83137},{\"end\":83336,\"start\":83335},{\"end\":83491,\"start\":83490},{\"end\":83669,\"start\":83668},{\"end\":83671,\"start\":83670},{\"end\":83931,\"start\":83930},{\"end\":84089,\"start\":84088},{\"end\":84100,\"start\":84099},{\"end\":84112,\"start\":84111},{\"end\":84122,\"start\":84121},{\"end\":84518,\"start\":84517},{\"end\":84532,\"start\":84531},{\"end\":84542,\"start\":84541},{\"end\":84555,\"start\":84554},{\"end\":84557,\"start\":84556},{\"end\":84746,\"start\":84745},{\"end\":84895,\"start\":84894},{\"end\":85105,\"start\":85104},{\"end\":85113,\"start\":85112},{\"end\":85115,\"start\":85114},{\"end\":85385,\"start\":85384},{\"end\":85393,\"start\":85392},{\"end\":85395,\"start\":85394},{\"end\":85404,\"start\":85403},{\"end\":85614,\"start\":85613},{\"end\":85762,\"start\":85761},{\"end\":85775,\"start\":85774},{\"end\":85783,\"start\":85782},{\"end\":85967,\"start\":85966}]", "bib_author_last_name": "[{\"end\":72849,\"start\":72839},{\"end\":72863,\"start\":72853},{\"end\":73088,\"start\":73080},{\"end\":73104,\"start\":73094},{\"end\":73333,\"start\":73325},{\"end\":73346,\"start\":73337},{\"end\":73560,\"start\":73556},{\"end\":73573,\"start\":73564},{\"end\":73583,\"start\":73577},{\"end\":73805,\"start\":73800},{\"end\":73818,\"start\":73809},{\"end\":73975,\"start\":73970},{\"end\":73988,\"start\":73979},{\"end\":73999,\"start\":73992},{\"end\":74213,\"start\":74206},{\"end\":74220,\"start\":74217},{\"end\":74470,\"start\":74461},{\"end\":74480,\"start\":74476},{\"end\":74712,\"start\":74705},{\"end\":74722,\"start\":74716},{\"end\":74738,\"start\":74728},{\"end\":74751,\"start\":74742},{\"end\":74761,\"start\":74755},{\"end\":74992,\"start\":74985},{\"end\":75005,\"start\":74999},{\"end\":75019,\"start\":75009},{\"end\":75316,\"start\":75307},{\"end\":75328,\"start\":75322},{\"end\":75506,\"start\":75497},{\"end\":75513,\"start\":75510},{\"end\":75661,\"start\":75650},{\"end\":75802,\"start\":75796},{\"end\":75813,\"start\":75806},{\"end\":76007,\"start\":76002},{\"end\":76018,\"start\":76011},{\"end\":76359,\"start\":76353},{\"end\":76365,\"start\":76363},{\"end\":76578,\"start\":76569},{\"end\":76593,\"start\":76582},{\"end\":76604,\"start\":76597},{\"end\":76767,\"start\":76758},{\"end\":76778,\"start\":76771},{\"end\":76795,\"start\":76782},{\"end\":76973,\"start\":76966},{\"end\":76984,\"start\":76977},{\"end\":77290,\"start\":77282},{\"end\":77298,\"start\":77294},{\"end\":77617,\"start\":77609},{\"end\":77628,\"start\":77621},{\"end\":77882,\"start\":77875},{\"end\":77891,\"start\":77886},{\"end\":77901,\"start\":77895},{\"end\":77915,\"start\":77905},{\"end\":77927,\"start\":77921},{\"end\":78212,\"start\":78202},{\"end\":78218,\"start\":78216},{\"end\":78428,\"start\":78425},{\"end\":78435,\"start\":78432},{\"end\":78591,\"start\":78585},{\"end\":78602,\"start\":78595},{\"end\":78845,\"start\":78839},{\"end\":78858,\"start\":78851},{\"end\":79066,\"start\":79058},{\"end\":79306,\"start\":79298},{\"end\":79316,\"start\":79310},{\"end\":79614,\"start\":79612},{\"end\":79624,\"start\":79620},{\"end\":79847,\"start\":79843},{\"end\":79859,\"start\":79851},{\"end\":80103,\"start\":80095},{\"end\":80300,\"start\":80293},{\"end\":80521,\"start\":80517},{\"end\":80532,\"start\":80529},{\"end\":80550,\"start\":80538},{\"end\":80791,\"start\":80786},{\"end\":80799,\"start\":80795},{\"end\":81048,\"start\":81036},{\"end\":81268,\"start\":81265},{\"end\":81454,\"start\":81449},{\"end\":81613,\"start\":81610},{\"end\":81631,\"start\":81619},{\"end\":81853,\"start\":81843},{\"end\":82039,\"start\":82033},{\"end\":82277,\"start\":82272},{\"end\":82290,\"start\":82284},{\"end\":82488,\"start\":82483},{\"end\":82620,\"start\":82614},{\"end\":82635,\"start\":82624},{\"end\":82844,\"start\":82838},{\"end\":82859,\"start\":82848},{\"end\":83112,\"start\":83106},{\"end\":83124,\"start\":83116},{\"end\":83135,\"start\":83128},{\"end\":83146,\"start\":83139},{\"end\":83342,\"start\":83337},{\"end\":83500,\"start\":83492},{\"end\":83680,\"start\":83672},{\"end\":83693,\"start\":83682},{\"end\":83936,\"start\":83932},{\"end\":84097,\"start\":84090},{\"end\":84109,\"start\":84101},{\"end\":84119,\"start\":84113},{\"end\":84131,\"start\":84123},{\"end\":84529,\"start\":84519},{\"end\":84539,\"start\":84533},{\"end\":84552,\"start\":84543},{\"end\":84564,\"start\":84558},{\"end\":84754,\"start\":84747},{\"end\":84903,\"start\":84896},{\"end\":85110,\"start\":85106},{\"end\":85122,\"start\":85116},{\"end\":85390,\"start\":85386},{\"end\":85401,\"start\":85396},{\"end\":85407,\"start\":85405},{\"end\":85620,\"start\":85615},{\"end\":85772,\"start\":85763},{\"end\":85780,\"start\":85776},{\"end\":85787,\"start\":85784}]", "bib_entry": "[{\"attributes\":{\"id\":\"b0\"},\"end\":72993,\"start\":72806},{\"attributes\":{\"id\":\"b1\"},\"end\":73301,\"start\":72995},{\"attributes\":{\"id\":\"b2\"},\"end\":73486,\"start\":73303},{\"attributes\":{\"id\":\"b3\",\"matched_paper_id\":7939568},\"end\":73773,\"start\":73488},{\"attributes\":{\"id\":\"b4\",\"matched_paper_id\":207611968},\"end\":73942,\"start\":73775},{\"attributes\":{\"id\":\"b5\",\"matched_paper_id\":16822749},\"end\":74130,\"start\":73944},{\"attributes\":{\"id\":\"b6\",\"matched_paper_id\":16764988},\"end\":74363,\"start\":74132},{\"attributes\":{\"id\":\"b7\"},\"end\":74622,\"start\":74365},{\"attributes\":{\"id\":\"b8\",\"matched_paper_id\":761793},\"end\":74981,\"start\":74624},{\"attributes\":{\"id\":\"b9\"},\"end\":75249,\"start\":74983},{\"attributes\":{\"id\":\"b10\"},\"end\":75468,\"start\":75251},{\"attributes\":{\"id\":\"b11\",\"matched_paper_id\":8946639},\"end\":75609,\"start\":75470},{\"attributes\":{\"id\":\"b12\"},\"end\":75757,\"start\":75611},{\"attributes\":{\"id\":\"b13\",\"matched_paper_id\":18548159},\"end\":75925,\"start\":75759},{\"attributes\":{\"id\":\"b14\",\"matched_paper_id\":9796093},\"end\":76245,\"start\":75927},{\"attributes\":{\"id\":\"b15\",\"matched_paper_id\":2396924},\"end\":76538,\"start\":76247},{\"attributes\":{\"id\":\"b16\"},\"end\":76734,\"start\":76540},{\"attributes\":{\"id\":\"b17\",\"matched_paper_id\":155443},\"end\":76899,\"start\":76736},{\"attributes\":{\"id\":\"b18\",\"matched_paper_id\":17811244},\"end\":77144,\"start\":76901},{\"attributes\":{\"doi\":\"arXiv:1505.05116\",\"id\":\"b19\"},\"end\":77528,\"start\":77146},{\"attributes\":{\"id\":\"b20\",\"matched_paper_id\":12056186},\"end\":77837,\"start\":77530},{\"attributes\":{\"id\":\"b21\",\"matched_paper_id\":8649027},\"end\":78158,\"start\":77839},{\"attributes\":{\"id\":\"b22\",\"matched_paper_id\":33425861},\"end\":78350,\"start\":78160},{\"attributes\":{\"id\":\"b23\",\"matched_paper_id\":3026915},\"end\":78581,\"start\":78352},{\"attributes\":{\"id\":\"b24\"},\"end\":78795,\"start\":78583},{\"attributes\":{\"id\":\"b25\",\"matched_paper_id\":2480559},\"end\":79015,\"start\":78797},{\"attributes\":{\"id\":\"b26\",\"matched_paper_id\":122528030},\"end\":79230,\"start\":79017},{\"attributes\":{\"id\":\"b27\",\"matched_paper_id\":122037809},\"end\":79496,\"start\":79232},{\"attributes\":{\"id\":\"b28\"},\"end\":79765,\"start\":79498},{\"attributes\":{\"id\":\"b29\"},\"end\":80037,\"start\":79767},{\"attributes\":{\"id\":\"b30\",\"matched_paper_id\":123996932},\"end\":80259,\"start\":80039},{\"attributes\":{\"id\":\"b31\",\"matched_paper_id\":6626684},\"end\":80440,\"start\":80261},{\"attributes\":{\"id\":\"b32\",\"matched_paper_id\":7278762},\"end\":80731,\"start\":80442},{\"attributes\":{\"id\":\"b33\",\"matched_paper_id\":9067785},\"end\":80943,\"start\":80733},{\"attributes\":{\"id\":\"b34\",\"matched_paper_id\":121525470},\"end\":81209,\"start\":80945},{\"attributes\":{\"doi\":\"arXiv:1303.0326\",\"id\":\"b35\"},\"end\":81396,\"start\":81211},{\"attributes\":{\"id\":\"b36\"},\"end\":81537,\"start\":81398},{\"attributes\":{\"id\":\"b37\",\"matched_paper_id\":8277923},\"end\":81799,\"start\":81539},{\"attributes\":{\"id\":\"b38\"},\"end\":81952,\"start\":81801},{\"attributes\":{\"id\":\"b39\",\"matched_paper_id\":12946957},\"end\":82188,\"start\":81954},{\"attributes\":{\"id\":\"b40\",\"matched_paper_id\":1537485},\"end\":82445,\"start\":82190},{\"attributes\":{\"id\":\"b41\",\"matched_paper_id\":11363949},\"end\":82606,\"start\":82447},{\"attributes\":{\"id\":\"b42\"},\"end\":82830,\"start\":82608},{\"attributes\":{\"id\":\"b43\"},\"end\":83054,\"start\":82832},{\"attributes\":{\"id\":\"b44\"},\"end\":83300,\"start\":83056},{\"attributes\":{\"id\":\"b45\"},\"end\":83424,\"start\":83302},{\"attributes\":{\"id\":\"b46\",\"matched_paper_id\":124874839},\"end\":83664,\"start\":83426},{\"attributes\":{\"id\":\"b47\"},\"end\":83899,\"start\":83666},{\"attributes\":{\"id\":\"b48\",\"matched_paper_id\":120295759},\"end\":84032,\"start\":83901},{\"attributes\":{\"id\":\"b49\",\"matched_paper_id\":15087216},\"end\":84456,\"start\":84034},{\"attributes\":{\"id\":\"b50\",\"matched_paper_id\":437040},\"end\":84709,\"start\":84458},{\"attributes\":{\"id\":\"b51\"},\"end\":84860,\"start\":84711},{\"attributes\":{\"id\":\"b52\"},\"end\":85022,\"start\":84862},{\"attributes\":{\"id\":\"b53\"},\"end\":85325,\"start\":85024},{\"attributes\":{\"id\":\"b54\",\"matched_paper_id\":454034},\"end\":85584,\"start\":85327},{\"attributes\":{\"id\":\"b55\"},\"end\":85714,\"start\":85586},{\"attributes\":{\"id\":\"b56\",\"matched_paper_id\":16625241},\"end\":85918,\"start\":85716},{\"attributes\":{\"id\":\"b57\",\"matched_paper_id\":18376058},\"end\":86080,\"start\":85920}]", "bib_title": "[{\"end\":73552,\"start\":73488},{\"end\":73796,\"start\":73775},{\"end\":73966,\"start\":73944},{\"end\":74200,\"start\":74132},{\"end\":74701,\"start\":74624},{\"end\":75493,\"start\":75470},{\"end\":75792,\"start\":75759},{\"end\":75998,\"start\":75927},{\"end\":76349,\"start\":76247},{\"end\":76754,\"start\":76736},{\"end\":76962,\"start\":76901},{\"end\":77605,\"start\":77530},{\"end\":77871,\"start\":77839},{\"end\":78198,\"start\":78160},{\"end\":78421,\"start\":78352},{\"end\":78833,\"start\":78797},{\"end\":79054,\"start\":79017},{\"end\":79294,\"start\":79232},{\"end\":80089,\"start\":80039},{\"end\":80287,\"start\":80261},{\"end\":80513,\"start\":80442},{\"end\":80782,\"start\":80733},{\"end\":81032,\"start\":80945},{\"end\":81604,\"start\":81539},{\"end\":82029,\"start\":81954},{\"end\":82268,\"start\":82190},{\"end\":82479,\"start\":82447},{\"end\":83488,\"start\":83426},{\"end\":83928,\"start\":83901},{\"end\":84086,\"start\":84034},{\"end\":84515,\"start\":84458},{\"end\":85102,\"start\":85024},{\"end\":85382,\"start\":85327},{\"end\":85759,\"start\":85716},{\"end\":85964,\"start\":85920}]", "bib_author": "[{\"end\":72851,\"start\":72835},{\"end\":72865,\"start\":72851},{\"end\":73090,\"start\":73078},{\"end\":73106,\"start\":73090},{\"end\":73335,\"start\":73323},{\"end\":73348,\"start\":73335},{\"end\":73562,\"start\":73554},{\"end\":73575,\"start\":73562},{\"end\":73585,\"start\":73575},{\"end\":73807,\"start\":73798},{\"end\":73820,\"start\":73807},{\"end\":73977,\"start\":73968},{\"end\":73990,\"start\":73977},{\"end\":74001,\"start\":73990},{\"end\":74215,\"start\":74202},{\"end\":74222,\"start\":74215},{\"end\":74472,\"start\":74459},{\"end\":74482,\"start\":74472},{\"end\":74714,\"start\":74703},{\"end\":74724,\"start\":74714},{\"end\":74740,\"start\":74724},{\"end\":74753,\"start\":74740},{\"end\":74763,\"start\":74753},{\"end\":74994,\"start\":74983},{\"end\":75007,\"start\":74994},{\"end\":75021,\"start\":75007},{\"end\":75318,\"start\":75303},{\"end\":75330,\"start\":75318},{\"end\":75508,\"start\":75495},{\"end\":75515,\"start\":75508},{\"end\":75663,\"start\":75648},{\"end\":75804,\"start\":75794},{\"end\":75815,\"start\":75804},{\"end\":76009,\"start\":76000},{\"end\":76020,\"start\":76009},{\"end\":76361,\"start\":76351},{\"end\":76367,\"start\":76361},{\"end\":76580,\"start\":76567},{\"end\":76595,\"start\":76580},{\"end\":76606,\"start\":76595},{\"end\":76769,\"start\":76756},{\"end\":76780,\"start\":76769},{\"end\":76797,\"start\":76780},{\"end\":76975,\"start\":76964},{\"end\":76986,\"start\":76975},{\"end\":77292,\"start\":77278},{\"end\":77300,\"start\":77292},{\"end\":77619,\"start\":77607},{\"end\":77630,\"start\":77619},{\"end\":77884,\"start\":77873},{\"end\":77893,\"start\":77884},{\"end\":77903,\"start\":77893},{\"end\":77917,\"start\":77903},{\"end\":77929,\"start\":77917},{\"end\":78214,\"start\":78200},{\"end\":78220,\"start\":78214},{\"end\":78430,\"start\":78423},{\"end\":78437,\"start\":78430},{\"end\":78593,\"start\":78583},{\"end\":78604,\"start\":78593},{\"end\":78847,\"start\":78835},{\"end\":78860,\"start\":78847},{\"end\":79068,\"start\":79056},{\"end\":79308,\"start\":79296},{\"end\":79318,\"start\":79308},{\"end\":79616,\"start\":79610},{\"end\":79626,\"start\":79616},{\"end\":79849,\"start\":79841},{\"end\":79861,\"start\":79849},{\"end\":80105,\"start\":80091},{\"end\":80302,\"start\":80289},{\"end\":80523,\"start\":80515},{\"end\":80534,\"start\":80523},{\"end\":80552,\"start\":80534},{\"end\":80793,\"start\":80784},{\"end\":80801,\"start\":80793},{\"end\":81050,\"start\":81034},{\"end\":81270,\"start\":81263},{\"end\":81456,\"start\":81447},{\"end\":81615,\"start\":81606},{\"end\":81633,\"start\":81615},{\"end\":81855,\"start\":81839},{\"end\":82041,\"start\":82031},{\"end\":82279,\"start\":82270},{\"end\":82292,\"start\":82279},{\"end\":82490,\"start\":82481},{\"end\":82494,\"start\":82490},{\"end\":82622,\"start\":82610},{\"end\":82637,\"start\":82622},{\"end\":82846,\"start\":82834},{\"end\":82861,\"start\":82846},{\"end\":83114,\"start\":83104},{\"end\":83126,\"start\":83114},{\"end\":83137,\"start\":83126},{\"end\":83148,\"start\":83137},{\"end\":83344,\"start\":83335},{\"end\":83502,\"start\":83490},{\"end\":83682,\"start\":83668},{\"end\":83695,\"start\":83682},{\"end\":83938,\"start\":83930},{\"end\":84099,\"start\":84088},{\"end\":84111,\"start\":84099},{\"end\":84121,\"start\":84111},{\"end\":84133,\"start\":84121},{\"end\":84531,\"start\":84517},{\"end\":84541,\"start\":84531},{\"end\":84554,\"start\":84541},{\"end\":84566,\"start\":84554},{\"end\":84756,\"start\":84745},{\"end\":84905,\"start\":84894},{\"end\":85112,\"start\":85104},{\"end\":85124,\"start\":85112},{\"end\":85392,\"start\":85384},{\"end\":85403,\"start\":85392},{\"end\":85409,\"start\":85403},{\"end\":85622,\"start\":85613},{\"end\":85774,\"start\":85761},{\"end\":85782,\"start\":85774},{\"end\":85789,\"start\":85782},{\"end\":85970,\"start\":85966}]", "bib_venue": "[{\"end\":84256,\"start\":84203},{\"end\":72833,\"start\":72806},{\"end\":73076,\"start\":72995},{\"end\":73321,\"start\":73303},{\"end\":73615,\"start\":73585},{\"end\":73841,\"start\":73820},{\"end\":74020,\"start\":74001},{\"end\":74231,\"start\":74222},{\"end\":74457,\"start\":74365},{\"end\":74781,\"start\":74763},{\"end\":75081,\"start\":75021},{\"end\":75301,\"start\":75251},{\"end\":75524,\"start\":75515},{\"end\":75646,\"start\":75611},{\"end\":75835,\"start\":75815},{\"end\":76069,\"start\":76020},{\"end\":76376,\"start\":76367},{\"end\":76565,\"start\":76540},{\"end\":76801,\"start\":76797},{\"end\":76999,\"start\":76986},{\"end\":77276,\"start\":77146},{\"end\":77667,\"start\":77630},{\"end\":77985,\"start\":77929},{\"end\":78240,\"start\":78220},{\"end\":78446,\"start\":78437},{\"end\":78673,\"start\":78604},{\"end\":78888,\"start\":78860},{\"end\":79111,\"start\":79068},{\"end\":79348,\"start\":79318},{\"end\":79608,\"start\":79498},{\"end\":79839,\"start\":79767},{\"end\":80135,\"start\":80105},{\"end\":80336,\"start\":80302},{\"end\":80568,\"start\":80552},{\"end\":80825,\"start\":80801},{\"end\":81061,\"start\":81050},{\"end\":81261,\"start\":81211},{\"end\":81445,\"start\":81398},{\"end\":81652,\"start\":81633},{\"end\":81837,\"start\":81801},{\"end\":82053,\"start\":82041},{\"end\":82301,\"start\":82292},{\"end\":82508,\"start\":82494},{\"end\":82665,\"start\":82637},{\"end\":82889,\"start\":82861},{\"end\":83102,\"start\":83056},{\"end\":83333,\"start\":83302},{\"end\":83532,\"start\":83502},{\"end\":83953,\"start\":83938},{\"end\":84201,\"start\":84133},{\"end\":84573,\"start\":84566},{\"end\":84743,\"start\":84711},{\"end\":84892,\"start\":84862},{\"end\":85149,\"start\":85124},{\"end\":85441,\"start\":85409},{\"end\":85611,\"start\":85586},{\"end\":85798,\"start\":85789},{\"end\":85984,\"start\":85970}]"}}}, "year": 2023, "month": 12, "day": 17}