{
    "id": 990233,
    "updated": "2023-07-19 15:23:19.286",
    "metadata": {
        "title": "Recursive Deep Models for Semantic Compositionality Over a Sentiment Treebank",
        "authors": "[{\"first\":\"Richard\",\"last\":\"Socher\",\"middle\":[]},{\"first\":\"Alex\",\"last\":\"Perelygin\",\"middle\":[]},{\"first\":\"Jean\",\"last\":\"Wu\",\"middle\":[]},{\"first\":\"Jason\",\"last\":\"Chuang\",\"middle\":[]},{\"first\":\"Christopher\",\"last\":\"Manning\",\"middle\":[\"D.\"]},{\"first\":\"Andrew\",\"last\":\"Ng\",\"middle\":[\"Y.\"]},{\"first\":\"Christopher\",\"last\":\"Potts\",\"middle\":[]}]",
        "venue": "EMNLP",
        "journal": "1631-1642",
        "publication_date": {
            "year": 2013,
            "month": null,
            "day": null
        },
        "abstract": "Semantic word spaces have been very use-ful but cannot express the meaning of longer phrases in a principled way. Further progress towards understanding compositionality in tasks such as sentiment detection requires richer supervised training and evaluation resources and more powerful models of composition. To remedy this, we introduce a Sentiment Treebank. It includes ﬁne grained sentiment labels for 215,154 phrases in the parse trees of 11,855 sentences and presents new challenges for sentiment compositionality. To address them, we introduce the Recursive Neural Tensor Network. When trained on the new treebank, this model out-performs all previous methods on several metrics. It pushes the state of the art in single sentence positive/negative classiﬁcation from 80% up to 85.4%. The accuracy of predicting ﬁne-grained sentiment labels for all phrases reaches 80.7%, an improvement of 9.7% over bag of features baselines. Lastly, it is the only model that can accurately capture the effects of negation and its scope at various tree levels for both positive and negative phrases.",
        "fields_of_study": "[\"Computer Science\"]",
        "external_ids": {
            "arxiv": null,
            "mag": "2251939518",
            "acl": "D13-1170",
            "pubmed": null,
            "pubmedcentral": null,
            "dblp": "conf/emnlp/SocherPWCMNP13",
            "doi": null
        }
    },
    "content": {
        "source": {
            "pdf_hash": "96101b58b0211823974bf5a5ac6b6c5ae80581c6",
            "pdf_src": "ACL",
            "pdf_uri": null,
            "oa_url_match": false,
            "oa_info": null
        },
        "grobid": {
            "id": "c929754f940a68da64be86e506c5e2dac53d38c7",
            "type": "plain-text",
            "url": "s3://ai2-s2-pdf-extraction-prod/parse-results/s2orc_worker/96101b58b0211823974bf5a5ac6b6c5ae80581c6.txt",
            "contents": "\nRecursive Deep Models for Semantic Compositionality Over a Sentiment Treebank\nAssociation for Computational LinguisticsCopyright Association for Computational Linguistics18-21 October 2013. 2013\n\nRichard Socher richard@socher.org \nStanford University\n94305StanfordCAUSA\n\nAlex Perelygin \nStanford University\n94305StanfordCAUSA\n\nJean Y Wu \nStanford University\n94305StanfordCAUSA\n\nJason Chuang \nStanford University\n94305StanfordCAUSA\n\nChristopher D Manning manning@stanford.edu \nStanford University\n94305StanfordCAUSA\n\nAndrew Y Ng \nStanford University\n94305StanfordCAUSA\n\nChristopher Potts cgpotts@stanford.edu \nStanford University\n94305StanfordCAUSA\n\nRecursive Deep Models for Semantic Compositionality Over a Sentiment Treebank\n\nProceedings of the 2013 Conference on Empirical Methods in Natural Language Processing\nthe 2013 Conference on Empirical Methods in Natural Language ProcessingSeattle, Washington, USAAssociation for Computational Linguistics18-21 October 2013. 2013\nSemantic word spaces have been very useful but cannot express the meaning of longer phrases in a principled way. Further progress towards understanding compositionality in tasks such as sentiment detection requires richer supervised training and evaluation resources and more powerful models of composition. To remedy this, we introduce a Sentiment Treebank. It includes fine grained sentiment labels for 215,154 phrases in the parse trees of 11,855 sentences and presents new challenges for sentiment compositionality. To address them, we introduce the Recursive Neural Tensor Network. When trained on the new treebank, this model outperforms all previous methods on several metrics. It pushes the state of the art in single sentence positive/negative classification from 80% up to 85.4%. The accuracy of predicting fine-grained sentiment labels for all phrases reaches 80.7%, an improvement of 9.7% over bag of features baselines. Lastly, it is the only model that can accurately capture the effects of negation and its scope at various tree levels for both positive and negative phrases.\n\nIntroduction\n\nSemantic vector spaces for single words have been widely used as features (Turney and Pantel, 2010). Because they cannot capture the meaning of longer phrases properly, compositionality in semantic vector spaces has recently received a lot of attention (Mitchell and Lapata, 2010;Socher et al., 2010;Zanzotto et al., 2010;Yessenalina and Cardie, 2011;Grefenstette et al., 2013). However, progress is held back by the current lack of large and labeled compositionality resources and  Figure 1: Example of the Recursive Neural Tensor Network accurately predicting 5 sentiment classes, very negative to very positive (--, -, 0, +, + +), at every node of a parse tree and capturing the negation and its scope in this sentence. models to accurately capture the underlying phenomena presented in such data. To address this need, we introduce the Stanford Sentiment Treebank and a powerful Recursive Neural Tensor Network that can accurately predict the compositional semantic effects present in this new corpus.\n\nThe Stanford Sentiment Treebank is the first corpus with fully labeled parse trees that allows for a complete analysis of the compositional effects of sentiment in language. The corpus is based on the dataset introduced by Pang and Lee (2005) and consists of 11,855 single sentences extracted from movie reviews. It was parsed with the Stanford parser (Klein and Manning, 2003) and includes a total of 215,154 unique phrases from those parse trees, each annotated by 3 human judges. This new dataset allows us to analyze the intricacies of sentiment and to capture complex linguistic phenomena. Fig. 1 shows one of the many examples with clear compositional structure. The granularity and size of this dataset will enable the community to train compositional models that are based on supervised and structured machine learning techniques. While there are several datasets with document and chunk labels available, there is a need to better capture sentiment from short comments, such as Twitter data, which provide less overall signal per document.\n\nIn order to capture the compositional effects with higher accuracy, we propose a new model called the Recursive Neural Tensor Network (RNTN). Recursive Neural Tensor Networks take as input phrases of any length. They represent a phrase through word vectors and a parse tree and then compute vectors for higher nodes in the tree using the same tensor-based composition function. We compare to several supervised, compositional models such as standard recursive neural networks (RNN) (Socher et al., 2011b), matrix-vector RNNs , and baselines such as neural networks that ignore word order, Naive Bayes (NB), bi-gram NB and SVM. All models get a significant boost when trained with the new dataset but the RNTN obtains the highest performance with 80.7% accuracy when predicting finegrained sentiment for all nodes. Lastly, we use a test set of positive and negative sentences and their respective negations to show that, unlike bag of words models, the RNTN accurately captures the sentiment change and scope of negation. RNTNs also learn that sentiment of phrases following the contrastive conjunction 'but' dominates.\n\nThe complete training and testing code, a live demo and the Stanford Sentiment Treebank dataset are available at http://nlp.stanford.edu/ sentiment.\n\n\nRelated Work\n\nThis work is connected to five different areas of NLP research, each with their own large amount of related work to which we cannot do full justice given space constraints.\n\n\nSemantic Vector Spaces.\n\nThe dominant approach in semantic vector spaces uses distributional similarities of single words. Often, co-occurrence statistics of a word and its context are used to describe each word (Turney and Pantel, 2010;Baroni and Lenci, 2010), such as tf-idf. Variants of this idea use more complex frequencies such as how often a word appears in a certain syntactic context (Pado and Lapata, 2007;Erk and Padó, 2008). However, distributional vectors often do not properly capture the differences in antonyms since those often have similar contexts. One possibility to remedy this is to use neural word vectors (Bengio et al., 2003). These vectors can be trained in an unsupervised fashion to capture distributional similarities (Collobert and Weston, 2008;Huang et al., 2012) but then also be fine-tuned and trained to specific tasks such as sentiment detection (Socher et al., 2011b). The models in this paper can use purely supervised word representations learned entirely on the new corpus.\n\n\nCompositionality in Vector Spaces.\n\nMost of the compositionality algorithms and related datasets capture two word compositions. Mitchell and Lapata (2010) use e.g. two-word phrases and analyze similarities computed by vector addition, multiplication and others. Some related models such as holographic reduced representations (Plate, 1995), quantum logic (Widdows, 2008), discrete-continuous models (Clark and Pulman, 2007) and the recent compositional matrix space model (Rudolph and Giesbrecht, 2010) have not been experimentally validated on larger corpora. Yessenalina and Cardie (2011) compute matrix representations for longer phrases and define composition as matrix multiplication, and also evaluate on sentiment. Grefenstette and Sadrzadeh (2011) analyze subject-verbobject triplets and find a matrix-based categorical model to correlate well with human judgments. We compare to the recent line of work on supervised compositional models. In particular we will describe and experimentally compare our new RNTN model to recursive neural networks (RNN) (Socher et al., 2011b) and matrix-vector RNNs  both of which have been applied to bag of words sentiment corpora.\n\n\nLogical Form.\n\nA related field that tackles compositionality from a very different angle is that of trying to map sentences to logical form (Zettlemoyer and Collins, 2005). While these models are highly interesting and work well in closed domains and on discrete sets, they could only capture sentiment distributions using separate mechanisms beyond the currently used logical forms.\n\nDeep Learning. Apart from the above mentioned work on RNNs, several compositionality ideas related to neural networks have been discussed by Bottou (2011) and Hinton (1990) and first models such as Recursive Auto-associative memories been experimented with by Pollack (1990). The idea to relate inputs through three way interactions, parameterized by a tensor have been proposed for relation classification (Sutskever et al., 2009;Jenatton et al., 2012), extending Restricted Boltzmann machines (Ranzato and Hinton, 2010) and as a special layer for speech recognition (Yu et al., 2012).\n\n\nSentiment Analysis.\n\nApart from the abovementioned work, most approaches in sentiment analysis use bag of words representations (Pang and Lee, 2008). Snyder and Barzilay (2007) analyzed larger reviews in more detail by analyzing the sentiment of multiple aspects of restaurants, such as food or atmosphere. Several works have explored sentiment compositionality through careful engineering of features or polarity shifting rules on syntactic structures (Polanyi and Zaenen, 2006;Moilanen and Pulman, 2007;Rentoumi et al., 2010;Nakagawa et al., 2010).\n\n\nStanford Sentiment Treebank\n\nBag of words classifiers can work well in longer documents by relying on a few words with strong sentiment like 'awesome' or 'exhilarating.' However, sentiment accuracies even for binary positive/negative classification for single sentences has not exceeded 80% for several years. For the more difficult multiclass case including a neutral class, accuracy is often below 60% for short messages on Twitter (Wang et al., 2012). From a linguistic or cognitive standpoint, ignoring word order in the treatment of a semantic task is not plausible, and, as we will show, it cannot accurately classify hard examples of negation. Correctly predicting these hard cases is necessary to further improve performance.\n\nIn this section we will introduce and provide some analyses for the new Sentiment Treebank which includes labels for every syntactically plausible phrase in thousands of sentences, allowing us to train and evaluate compositional models.\n\nWe consider the corpus of movie review excerpts from the rottentomatoes.com website originally collected and published by Pang and Lee (2005). The original dataset includes 10,662 sen-  Figure 3: The labeling interface. Random phrases were shown and annotators had a slider for selecting the sentiment and its degree. tences, half of which were considered positive and the other half negative. Each label is extracted from a longer movie review and reflects the writer's overall intention for this review. The normalized, lowercased text is first used to recover, from the original website, the text with capitalization. Remaining HTML tags and sentences that are not in English are deleted. The Stanford Parser (Klein and Manning, 2003) is used to parses all 10,662 sentences. In approximately 1,100 cases it splits the snippet into multiple sentences. We then used Amazon Mechanical Turk to label the resulting 215,154 phrases. Fig. 3 shows the interface annotators saw. The slider has 25 different values and is initially set to neutral. The phrases in each hit are randomly sampled from the set of all phrases in order to prevent labels being influenced by what follows. For more details on the dataset collection, see supplementary material. Fig. 2 shows the normalized label distributions at each n-gram length. Starting at length 20, the majority are full sentences. One of the findings from labeling sentences based on reader's perception is that many of them could be considered neutral. We also notice that stronger sentiment often builds up in longer phrases and the majority of the shorter phrases are neutral. Another observation is that most annotators moved the slider to one of the five positions: negative, somewhat negative, neutral, positive or somewhat positive. The extreme values were rarely used and the slider was not often left in between the ticks. Hence, even a 5-class classification into these categories captures the main variability of the labels. We will name this fine-grained sentiment classification and our main experiment will be to recover these five labels for phrases of all lengths.  \n\n\nRecursive Neural Models\n\nThe models in this section compute compositional vector representations for phrases of variable length and syntactic type. These representations will then be used as features to classify each phrase. Fig. 4 displays this approach. When an n-gram is given to the compositional models, it is parsed into a binary tree and each leaf node, corresponding to a word, is represented as a vector. Recursive neural models will then compute parent vectors in a bottom up fashion using different types of compositionality functions g. The parent vectors are again given as features to a classifier. For ease of exposition, we will use the tri-gram in this figure to explain all models.\n\nWe first describe the operations that the below recursive neural models have in common: word vector representations and classification. This is followed by descriptions of two previous RNN models and our RNTN.\n\nEach word is represented as a d-dimensional vector. We initialize all word vectors by randomly sampling each value from a uniform distribution: U(−r, r), where r = 0.0001. All the word vectors are stacked in the word embedding matrix L ∈ R d×|V | , where |V | is the size of the vocabulary. Initially the word vectors will be random but the L matrix is seen as a parameter that is trained jointly with the compositionality models.\n\nWe can use the word vectors immediately as parameters to optimize and as feature inputs to a softmax classifier. For classification into five classes, we compute the posterior probability over labels given the word vector via:\ny a = softmax(W s a),(1)\nwhere W s ∈ R 5×d is the sentiment classification matrix. For the given tri-gram, this is repeated for vectors b and c. The main task of and difference between the models will be to compute the hidden vectors p i ∈ R d in a bottom up fashion.\n\n\nRNN: Recursive Neural Network\n\nThe simplest member of this family of neural network models is the standard recursive neural network (Goller and Küchler, 1996;Socher et al., 2011a). First, it is determined which parent already has all its children computed. In the above tree example, p 1 has its two children's vectors since both are words. RNNs use the following equations to compute the parent vectors:\np 1 = f W b c , p 2 = f W a p 1 ,\nwhere f = tanh is a standard element-wise nonlinearity, W ∈ R d×2d is the main parameter to learn and we omit the bias for simplicity. The bias can be added as an extra column to W if an additional 1 is added to the concatenation of the input vectors. The parent vectors must be of the same dimensionality to be recursively compatible and be used as input to the next composition. Each parent vector p i , is given to the same softmax classifier of Eq. 1 to compute its label probabilities. This model uses the same compositionality function as the recursive autoencoder (Socher et al., 2011b) and recursive auto-associate memories (Pollack, 1990). The only difference to the former model is that we fix the tree structures and ignore the reconstruction loss. In initial experiments, we found that with the additional amount of training data, the reconstruction loss at each node is not necessary to obtain high performance.\n\n\nMV-RNN: Matrix-Vector RNN\n\nThe MV-RNN is linguistically motivated in that most of the parameters are associated with words and each composition function that computes vectors for longer phrases depends on the actual words being combined. The main idea of the MV-RNN  is to represent every word and longer phrase in a parse tree as both a vector and a matrix. When two constituents are combined the matrix of one is multiplied with the vector of the other and vice versa. Hence, the compositional function is parameterized by the words that participate in it.\n\nEach word's matrix is initialized as a d×d identity matrix, plus a small amount of Gaussian noise. Similar to the random word vectors, the parameters of these matrices will be trained to minimize the classification error at each node. For this model, each ngram is represented as a list of (vector,matrix) pairs, together with the parse tree. For the tree with (vector,matrix) nodes:\n\n(p 2 ,P 2 ) (a,A) (p 1 ,P 1 ) (b,B) (c,C) the MV-RNN computes the first parent vector and its matrix via two equations:\np 1 = f W Cb Bc , P 1 = f W M B C ,\nwhere W M ∈ R d×2d and the result is again a d × d matrix. Similarly, the second parent node is computed using the previously computed (vector,matrix) pair (p 1 , P 1 ) as well as (a, A). The vectors are used for classifying each phrase using the same softmax classifier as in Eq. 1.\n\n\nRNTN:Recursive Neural Tensor Network\n\nOne problem with the MV-RNN is that the number of parameters becomes very large and depends on the size of the vocabulary. It would be cognitively more plausible if there was a single powerful composition function with a fixed number of parameters. The standard RNN is a good candidate for such a function. However, in the standard RNN, the input vectors only implicitly interact through the nonlinearity (squashing) function. A more direct, possibly multiplicative, interaction would allow the model to have greater interactions between the input vectors. Motivated by these ideas we ask the question: Can a single, more powerful composition function perform better and compose aggregate meaning from smaller constituents more accurately than many input specific ones? In order to answer this question, we propose a new model called the Recursive Neural Tensor Network (RNTN). The main idea is to use the same, tensor-based composition function for all nodes. Fig. 5 shows a single tensor layer. We define the output of a tensor product h ∈ R d via the following vectorized notation and the equivalent but more detailed notation for each slice V\n[i] ∈ R d×d : h = b c T V [1:d] b c ; h i = b c T V [i] b c .\nwhere V [1:d] ∈ R 2d×2d×d is the tensor that defines multiple bilinear forms. The RNTN uses this definition for computing p 1 :\np 1 = f b c T V [1:d] b c + W b c ,\nwhere W is as defined in the previous models. The next parent vector p 2 in the tri-gram will be computed with the same weights:\np 2 = f a p 1 T V [1:d] a p 1 + W a p 1 .\nThe main advantage over the previous RNN model, which is a special case of the RNTN when V is set to 0, is that the tensor can directly relate input vectors. Intuitively, we can interpret each slice of the tensor as capturing a specific type of composition.\n\nAn alternative to RNTNs would be to make the compositional function more powerful by adding a second neural network layer. However, initial experiments showed that it is hard to optimize this model and vector interactions are still more implicit than in the RNTN.\n\n\nTensor Backprop through Structure\n\nWe describe in this section how to train the RNTN model. As mentioned above, each node has a softmax classifier trained on its vector representation to predict a given ground truth or target vector t. We assume the target distribution vector at each node has a 0-1 encoding. If there are C classes, then it has length C and a 1 at the correct label. All other entries are 0.\n\nWe want to maximize the probability of the correct prediction, or minimize the cross-entropy error between the predicted distribution y i ∈ R C×1 at node i and the target distribution t i ∈ R C×1 at that node. This is equivalent (up to a constant) to minimizing the KL-divergence between the two distributions. The error as a function of the RNTN parameters θ = (V, W, W s , L) for a sentence is:\nE(θ) = i j t i j log y i j + λ θ 2(2)\nThe derivative for the weights of the softmax classifier are standard and simply sum up from each node's error. We define x i to be the vector at node i (in the example trigram, the x i ∈ R d×1 's are (a, b, c, p 1 , p 2 )). We skip the standard derivative for W s . Each node backpropagates its error through to the recursively used weights V, W . Let δ i,s ∈ R d×1 be the softmax error vector at node i:\nδ i,s = W T s (y i − t i ) ⊗ f (x i ),\nwhere ⊗ is the Hadamard product between the two vectors and f is the element-wise derivative of f which in the standard case of using f = tanh can be computed using only f (x i ).\n\nThe remaining derivatives can only be computed in a top-down fashion from the top node through the tree and into the leaf nodes. The full derivative for V and W is the sum of the derivatives at each of the nodes. We define the complete incoming error messages for a node i as δ i,com . The top node, in our case p 2 , only received errors from the top node's softmax. Hence, δ p 2 ,com = δ p 2 ,s which we can use to obtain the standard backprop derivative for W (Goller and Küchler, 1996;Socher et al., 2010). For the derivative of each slice k = 1, . . . , d, we get:\n∂E p 2 ∂V [k] = δ p 2 ,com k a p 1 a p 1 T ,\nwhere δ p 2 ,com k is just the k'th element of this vector. Now, we can compute the error message for the two children of p 2 :\nδ p 2 ,down = W T δ p 2 ,com + S ⊗ f a p 1 , where we define S = d k=1 δ p 2 ,com k V [k] + V [k] T a p 1\nThe children of p 2 , will then each take half of this vector and add their own softmax error message for the complete δ. In particular, we have\nδ p 1 ,com = δ p 1 ,s + δ p 2 ,down [d + 1 : 2d],\nwhere δ p 2 ,down [d + 1 : 2d] indicates that p 1 is the right child of p 2 and hence takes the 2nd half of the error, for the final word vector derivative for a, it will be δ p 2 ,down [1 : d].\n\nThe full derivative for slice V [k] for this trigram tree then is the sum at each node:\n∂E ∂V [k] = E p 2 ∂V [k] + δ p 1 ,com k b c b c T ,\nand similarly for W . For this nonconvex optimization we use AdaGrad (Duchi et al., 2011) which converges in less than 3 hours to a local optimum.\n\n\nExperiments\n\nWe include two types of analyses. The first type includes several large quantitative evaluations on the test set. The second type focuses on two linguistic phenomena that are important in sentiment.\n\nFor all models, we use the dev set and crossvalidate over regularization of the weights, word vector size as well as learning rate and minibatch size for AdaGrad. Optimal performance for all models was achieved at word vector sizes between 25 and 35 dimensions and batch sizes between 20 and 30. Performance decreased at larger or smaller vector and batch sizes. This indicates that the RNTN does not outperform the standard RNN due to simply having more parameters. The MV-RNN has orders of magnitudes more parameters than any other model due to the word matrices. The RNTN would usually achieve its best performance on the dev set after training for 3 -5 hours. Initial experiments showed that the recursive models worked significantly worse (over 5% drop in accuracy) when no nonlinearity was used. We use f = tanh in all experiments. We compare to commonly used methods that use bag of words features with Naive Bayes and SVMs, as well as Naive Bayes with bag of bigram features. We abbreviate these with NB, SVM and biNB. We also compare to a model that averages neural word vectors and ignores word order (VecAvg).\n\nThe sentences in the treebank were split into a train (8544), dev (1101) and test splits (2210) and these splits are made available with the data release. We also analyze performance on only positive and negative sentences, ignoring the neutral class. This filters about 20% of the data with the three sets having 6920/872/1821 sentences.\n\n\nFine-grained Sentiment For All Phrases\n\nThe main novel experiment and evaluation metric analyze the accuracy of fine-grained sentiment classification for all phrases. Fig. 2 showed that a fine grained classification into 5 classes is a reasonable approximation to capture most of the data variation. Fig. 6 shows the result on this new corpus. The RNTN gets the highest performance, followed by the MV-RNN and RNN. The recursive models work very well on shorter phrases, where negation and composition are important, while bag of features baselines perform well only with longer sentences. The RNTN accuracy upper bounds other models at most n-gram lengths.\n\nTable 1 (left) shows the overall accuracy numbers for fine grained prediction at all phrase lengths and full sentences. \n\n\nFull Sentence Binary Sentiment\n\nThis setup is comparable to previous work on the original rotten tomatoes dataset which only used full sentence labels and binary classification of positive/negative. Hence, these experiments show the improvement even baseline methods can achieve with the sentiment treebank. Table 1 shows results of this binary classification for both all phrases and for only full sentences. The previous state of the art was below 80% . With the coarse bag of words annotation for training, many of the more complex phenomena could not be captured, even by more powerful models. The combination of the new sentiment treebank and the RNTN pushes the state of the art on short phrases up to 85.4%.\n\n\nModel Analysis: Contrastive Conjunction\n\nIn this section, we use a subset of the test set which includes only sentences with an 'X but Y ' structure: A phrase X being followed by but which is followed by a phrase Y . The conjunction is interpreted as an argument for the second conjunct, with the first functioning concessively (Lakoff, 1971;Blakemore, 1989;Merin, 1999). Fig. 7 contains an example. We analyze a strict setting, where X and Y are phrases of different sentiment (including neutral). The example is counted as correct, if the classifications for both phrases X and Y are correct. Furthermore, the lowest node that dominates both of the word but and the node that spans Y also have to have the same correct sentiment. For the resulting 131 cases, the RNTN obtains an accuracy of 41% compared to MV-RNN (37), RNN (36) and biNB (27).\n\n\nModel Analysis: High Level Negation\n\nWe investigate two types of negation. For each type, we use a separate dataset for evaluation. Set 1: Negating Positive Sentences. The first set contains positive sentences and their negation. In this set, the negation changes the overall sentiment of a sentence from positive to negative. Hence, we compute accuracy in terms of correct sentiment reversal from positive to negative. Fig. 9 shows two examples of positive negation the RNTN correctly classified, even if negation is less obvious in the case of 'least'. Table 2 (left) gives the accuracies over 21 positive sentences and their negation for all models. The RNTN has the highest reversal accuracy, showing its ability to structurally learn negation of positive sentences. But what if the model simply makes phrases very negative when negation is in the sentence? The next experiments show that the model captures more than such a simplistic negation rule.\n\nSet 2: Negating Negative Sentences.\n\nThe second set contains negative sentences and their negation. When negative sentences are negated, the sentiment treebank shows that overall sentiment should become less negative, but not necessarily positive. For instance, 'The movie was terrible' is negative but the 'The movie was not terrible' says only that it was less bad than a terrible one, not that it was good (Horn, 1989;Israel, 2001). Hence, we evaluate ac-   curacy in terms of how often each model was able to increase non-negative activation in the sentiment of the sentence. Table 2 (right) shows the accuracy. In over 81% of cases, the RNTN correctly increases the positive activations. Fig. 9 (bottom right) shows a typical case in which sentiment was made more positive by switching the main class from negative to neutral even though both not and dull were negative. Fig. 8 shows the changes in activation for both sets. Negative values indicate a decrease in aver- age positive activation (for set 1) and positive values mean an increase in average positive activation (set 2). The RNTN has the largest shifts in the correct directions. Therefore we can conclude that the RNTN is best able to identify the effect of negations upon both positive and negative sentiment sentences.\n\nn Most positive n-grams Most negative n-grams 1 engaging; best; powerful; love; beautiful bad; dull; boring; fails; worst; stupid; painfully 2 excellent performances; A masterpiece; masterful film; wonderful movie; marvelous performances worst movie; very bad; shapeless mess; worst thing; instantly forgettable; complete failure 3 an amazing performance; wonderful all-ages triumph; a wonderful movie; most visually stunning for worst movie; A lousy movie; a complete failure; most painfully marginal; very bad sign 5 nicely acted and beautifully shot; gorgeous imagery, effective performances; the best of the year; a terrific American sports movie; refreshingly honest and ultimately touching silliest and most incoherent movie; completely crass and forgettable movie; just another bad movie. A cumbersome and cliche-ridden movie; a humorless, disjointed mess 8 one of the best films of the year; A love for films shines through each frame; created a masterful piece of artistry right here; A masterful film from a master filmmaker, A trashy, exploitative, thoroughly unpleasant experience ; this sloppy drama is an empty vessel.; quickly drags on becoming boring and predictable.; be the worst special-effects creation of the year Table 3: Examples of n-grams for which the RNTN predicted the most positive and most negative responses. \n\n\nModel Analysis: Most Positive and Negative Phrases\n\nWe queried the model for its predictions on what the most positive or negative n-grams are, measured as the highest activation of the most negative and most positive classes. Table 3 shows some phrases from the dev set which the RNTN selected for their strongest sentiment.\n\nDue to lack of space we cannot compare top phrases of the other models but Fig. 10 shows that the RNTN selects more strongly positive phrases at most n-gram lengths compared to other models.\n\nFor this and the previous experiment, please find additional examples and descriptions in the supplementary material.\n\n\nConclusion\n\nWe introduced Recursive Neural Tensor Networks and the Stanford Sentiment Treebank. The combination of new model and data results in a system for single sentence sentiment detection that pushes state of the art by 5.4% for positive/negative sentence classification. Apart from this standard setting, the dataset also poses important new challenges and allows for new evaluation metrics. For instance, the RNTN obtains 80.7% accuracy on fine-grained sentiment prediction across all phrases and captures negation of different sentiments and scope more accurately than previous models.\n\nFigure 2 :\n2Normalized histogram of sentiment annotations at each n-gram length. Many shorter n-grams are neutral; longer phrases are well distributed. Few annotators used slider positions between ticks or the extreme values. Hence the two strongest labels and intermediate tick positions are merged into 5 classes.\n\nFigure 4 :\n4Approach of Recursive Neural Network models for sentiment: Compute parent vectors in a bottom up fashion using a compositionality function g and use node vectors as features for a classifier at that node. This function varies for the different models.\n\nFigure 5 :\n5A single layer of the Recursive Neural Tensor Network. Each dashed box represents one of d-many slices and can capture a type of influence a child can have on its parent.\n\nFigure 6 :\n6Accuracy curves for fine grained sentiment classification at each n-gram lengths. Left: Accuracy separately for each set of n-grams. Right: Cumulative accuracy of all ≤ n-grams.\n\nFigure 7 :\n7Example of correct prediction for contrastive conjunction X but Y .\n\nFigure 9 :\n9RNTN prediction of positive and negative (bottom right) sentences and their negation.\n\nFigure 8 :\n8Change in activations for negations. Only the RNTN correctly captures both types. It decreases positive sentiment more when it is negated and learns that negating negative phrases (such as not terrible) should increase neutral and positive activations.\n\nFigure 10 :\n10Average ground truth sentiment of top 10 most positive n-grams at various n. The RNTN correctly picks the more negative and positive examples.\n\nTable 2 :\n2Accuracy of negation detection. Negated positive is measured as correct sentiment inversions. Negated negative is measured as increases in positive activations.\nAcknowledgmentsWe thank Rukmani Ravisundaram and Tayyab Tariq for the first version of the online demo.\nDistributional memory: A general framework for corpus-based semantics. M Baroni, A Lenci, Computational Linguistics. 364M. Baroni and A. Lenci. 2010. Distributional mem- ory: A general framework for corpus-based semantics. Computational Linguistics, 36(4):673-721.\n\nA neural probabilistic language model. Y Bengio, R Ducharme, P Vincent, C Janvin, J. Mach. Learn. Res. 3Y. Bengio, R. Ducharme, P. Vincent, and C. Janvin. 2003. A neural probabilistic language model. J. Mach. Learn. Res., 3, March.\n\nDenial and contrast: A relevance theoretic analysis of 'but'. Linguistics and Philosophy. D Blakemore, 12D. Blakemore. 1989. Denial and contrast: A relevance theoretic analysis of 'but'. Linguistics and Philoso- phy, 12:15-37.\n\nFrom machine learning to machine reasoning. L Bottou, abs/1102.1808CoRRL. Bottou. 2011. From machine learning to machine reasoning. CoRR, abs/1102.1808.\n\nCombining symbolic and distributional models of meaning. S Clark, S Pulman, Proceedings of the AAAI Spring Symposium on Quantum Interaction. the AAAI Spring Symposium on Quantum InteractionS. Clark and S. Pulman. 2007. Combining symbolic and distributional models of meaning. In Proceedings of the AAAI Spring Symposium on Quantum Interaction, pages 52-55.\n\nA unified architecture for natural language processing: deep neural networks with multitask learning. R Collobert, J Weston, ICML. R. Collobert and J. Weston. 2008. A unified architecture for natural language processing: deep neural networks with multitask learning. In ICML.\n\nAdaptive subgradient methods for online learning and stochastic optimization. J Duchi, E Hazan, Y Singer, JMLR. 12J. Duchi, E. Hazan, and Y. Singer. 2011. Adaptive sub- gradient methods for online learning and stochastic op- timization. JMLR, 12, July.\n\nA structured vector space model for word meaning in context. K Erk, S Padó, EMNLP. K. Erk and S. Padó. 2008. A structured vector space model for word meaning in context. In EMNLP.\n\nLearning taskdependent distributed representations by backpropagation through structure. C Goller, A Küchler, Proceedings of the International Conference on Neural Networks (ICNN-96). the International Conference on Neural Networks (ICNN-96)C. Goller and A. Küchler. 1996. Learning task- dependent distributed representations by backpropaga- tion through structure. In Proceedings of the Interna- tional Conference on Neural Networks (ICNN-96).\n\nExperimental support for a categorical compositional distributional model of meaning. E Grefenstette, M Sadrzadeh, EMNLP. E. Grefenstette and M. Sadrzadeh. 2011. Experimental support for a categorical compositional distributional model of meaning. In EMNLP.\n\nMulti-step regression learning for compositional distributional semantics. G Grefenstette, Y.-Z Dinu, M Zhang, M Sadrzadeh, Baroni, IWCS. Grefenstette, G. Dinu, Y.-Z. Zhang, M. Sadrzadeh, and M. Baroni. 2013. Multi-step regression learning for compositional distributional semantics. In IWCS.\n\nMapping part-whole hierarchies into connectionist networks. G E Hinton, Artificial Intelligence. 46G. E. Hinton. 1990. Mapping part-whole hierarchies into connectionist networks. Artificial Intelligence, 46(1- 2).\n\nA natural history of negation. L R Horn, University of Chicago Press Chicago960L. R. Horn. 1989. A natural history of negation, volume 960. University of Chicago Press Chicago.\n\nImproving Word Representations via Global Context and Multiple Word Prototypes. E H Huang, R Socher, C D Manning, A Y Ng, ACL. E. H. Huang, R. Socher, C. D. Manning, and A. Y. Ng. 2012. Improving Word Representations via Global Context and Multiple Word Prototypes. In ACL.\n\nMinimizers, maximizers, and the rhetoric of scalar reasoning. M Israel, Journal of Semantics. 184M. Israel. 2001. Minimizers, maximizers, and the rhetoric of scalar reasoning. Journal of Semantics, 18(4):297-331.\n\nA latent factor model for highly multi-relational data. R Jenatton, N Le Roux, A Bordes, G Obozinski, NIPS. R. Jenatton, N. Le Roux, A. Bordes, and G. Obozinski. 2012. A latent factor model for highly multi-relational data. In NIPS.\n\nAccurate unlexicalized parsing. D Klein, C D Manning, ACL. D. Klein and C. D. Manning. 2003. Accurate unlexical- ized parsing. In ACL.\n\nIf's, and's, and but's about conjunction. R Lakoff, Studies in Linguistic Semantics. Charles J. Fillmore and D. Terence LangendoenR. Lakoff. 1971. If's, and's, and but's about conjunction. In Charles J. Fillmore and D. Terence Langendoen, ed- itors, Studies in Linguistic Semantics, pages 114-149.\n\n. Rinehart Holt, Winston , New YorkHolt, Rinehart, and Winston, New York.\n\nInformation, relevance, and social decisionmaking: Some principles and results of decisiontheoretic semantics. A Merin, Logic, Language, and Information. Lawrence S. Moss, Jonathan Ginzburg, and Maarten de RijkeStanford, CA2A. Merin. 1999. Information, relevance, and social deci- sionmaking: Some principles and results of decision- theoretic semantics. In Lawrence S. Moss, Jonathan Ginzburg, and Maarten de Rijke, editors, Logic, Lan- guage, and Information, volume 2. CSLI, Stanford, CA.\n\nComposition in distributional models of semantics. J Mitchell, M Lapata, Cognitive Science. 348J. Mitchell and M. Lapata. 2010. Composition in dis- tributional models of semantics. Cognitive Science, 34(8):1388-1429.\n\nSentiment composition. K Moilanen, S Pulman, Proceedings of Recent Advances in Natural Language Processing. Recent Advances in Natural Language ProcessingK. Moilanen and S. Pulman. 2007. Sentiment composi- tion. In In Proceedings of Recent Advances in Natural Language Processing.\n\nDependency tree-based sentiment classification using CRFs with hidden variables. T Nakagawa, K Inui, S Kurohashi, NAACL, HLTT. Nakagawa, K. Inui, and S. Kurohashi. 2010. Depen- dency tree-based sentiment classification using CRFs with hidden variables. In NAACL, HLT.\n\nDependency-based construction of semantic space models. S Pado, M Lapata, Computational Linguistics. 332S. Pado and M. Lapata. 2007. Dependency-based con- struction of semantic space models. Computational Linguistics, 33(2):161-199.\n\nSeeing stars: Exploiting class relationships for sentiment categorization with respect to rating scales. B Pang, L Lee, ACL. B. Pang and L. Lee. 2005. Seeing stars: Exploiting class relationships for sentiment categorization with respect to rating scales. In ACL, pages 115-124.\n\nOpinion mining and sentiment analysis. Foundations and Trends in Information Retrieval. B Pang, L Lee, 2B. Pang and L. Lee. 2008. Opinion mining and senti- ment analysis. Foundations and Trends in Information Retrieval, 2(1-2):1-135.\n\nHolographic reduced representations. T A Plate, IEEE Transactions on Neural Networks. 63T. A. Plate. 1995. Holographic reduced representations. IEEE Transactions on Neural Networks, 6(3):623- 641.\n\nContextual valence shifters. L Polanyi, A Zaenen, Computing Attitude and Affect in Text: Theory and Applications. W. Bruce Croft, James Shanahan, Yan Qu, and Janyce Wiebe20chapter 1L. Polanyi and A. Zaenen. 2006. Contextual valence shifters. In W. Bruce Croft, James Shanahan, Yan Qu, and Janyce Wiebe, editors, Computing Attitude and Af- fect in Text: Theory and Applications, volume 20 of The Information Retrieval Series, chapter 1.\n\nRecursive distributed representations. J B Pollack, Artificial Intelligence. 46J. B. Pollack. 1990. Recursive distributed representa- tions. Artificial Intelligence, 46, November.\n\nFactored 3-Way Restricted Boltzmann Machines For Modeling Natural Images. M Ranzato, A Krizhevsky, G E Hinton, AISTATSM. Ranzato and A. Krizhevsky G. E. Hinton. 2010. Factored 3-Way Restricted Boltzmann Machines For Modeling Natural Images. AISTATS.\n\nUnited we stand: Improving sentiment analysis by joining machine learning and rule based methods. V Rentoumi, S Petrakis, M Klenner, G A Vouros, V Karkaletsis, Proceedings of the Seventh conference on International Language Resources and Evaluation (LREC'10). the Seventh conference on International Language Resources and Evaluation (LREC'10)Valletta, MaltaV. Rentoumi, S. Petrakis, M. Klenner, G. A. Vouros, and V. Karkaletsis. 2010. United we stand: Improving sentiment analysis by joining machine learning and rule based methods. In Proceedings of the Seventh conference on International Language Resources and Evaluation (LREC'10), Valletta, Malta.\n\nCompositional matrix-space models of language. S Rudolph, E Giesbrecht, ACL. S. Rudolph and E. Giesbrecht. 2010. Compositional matrix-space models of language. In ACL.\n\nMultiple aspect ranking using the Good Grief algorithm. B Snyder, R Barzilay, HLT-NAACL. B. Snyder and R. Barzilay. 2007. Multiple aspect rank- ing using the Good Grief algorithm. In HLT-NAACL.\n\nLearning continuous phrase representations and syntactic parsing with recursive neural networks. R Socher, C D Manning, A Y Ng, Proceedings of the NIPS-2010 Deep Learning and Unsupervised Feature Learning Workshop. the NIPS-2010 Deep Learning and Unsupervised Feature Learning WorkshopR. Socher, C. D. Manning, and A. Y. Ng. 2010. Learning continuous phrase representations and syntactic pars- ing with recursive neural networks. In Proceedings of the NIPS-2010 Deep Learning and Unsupervised Fea- ture Learning Workshop.\n\nParsing Natural Scenes and Natural Language with Recursive Neural Networks. R Socher, C Lin, A Y Ng, C D Manning, ICML. R. Socher, C. Lin, A. Y. Ng, and C.D. Manning. 2011a. Parsing Natural Scenes and Natural Language with Recursive Neural Networks. In ICML.\n\nSemi-Supervised Recursive Autoencoders for Predicting Sentiment Distributions. R Socher, J Pennington, E H Huang, A Y Ng, C D Manning, EMNLP. R. Socher, J. Pennington, E. H. Huang, A. Y. Ng, and C. D. Manning. 2011b. Semi-Supervised Recursive Autoencoders for Predicting Sentiment Distributions. In EMNLP.\n\nSemantic compositionality through recursive matrixvector spaces. R Socher, B Huval, C D Manning, A Y Ng, EMNLP. R. Socher, B. Huval, C. D. Manning, and A. Y. Ng. 2012. Semantic compositionality through recursive matrix- vector spaces. In EMNLP.\n\nModelling relational data using Bayesian clustered tensor factorization. I Sutskever, R Salakhutdinov, J B Tenenbaum, NIPS. I. Sutskever, R. Salakhutdinov, and J. B. Tenenbaum. 2009. Modelling relational data using Bayesian clus- tered tensor factorization. In NIPS.\n\nFrom frequency to meaning: Vector space models of semantics. P D Turney, P Pantel, Journal of Artificial Intelligence Research. 37P. D. Turney and P. Pantel. 2010. From frequency to meaning: Vector space models of semantics. Journal of Artificial Intelligence Research, 37:141-188.\n\nA system for real-time twitter sentiment analysis of 2012 u.s. presidential election cycle. H Wang, D Can, A Kazemzadeh, F Bar, S Narayanan, Proceedings of the ACL 2012 System Demonstrations. the ACL 2012 System DemonstrationsH. Wang, D. Can, A. Kazemzadeh, F. Bar, and S. Narayanan. 2012. A system for real-time twit- ter sentiment analysis of 2012 u.s. presidential elec- tion cycle. In Proceedings of the ACL 2012 System Demonstrations.\n\nSemantic vector products: Some initial investigations. D Widdows, Proceedings of the Second AAAI Symposium on Quantum Interaction. the Second AAAI Symposium on Quantum InteractionD. Widdows. 2008. Semantic vector products: Some ini- tial investigations. In Proceedings of the Second AAAI Symposium on Quantum Interaction.\n\nCompositional matrix-space models for sentiment analysis. A Yessenalina, C Cardie, EMNLP. A. Yessenalina and C. Cardie. 2011. Composi- tional matrix-space models for sentiment analysis. In EMNLP.\n\nLarge vocabulary speech recognition using deep tensor neural networks. D Yu, L Deng, F Seide, INTERSPEECH. D. Yu, L. Deng, and F. Seide. 2012. Large vocabulary speech recognition using deep tensor neural networks. In INTERSPEECH.\n\nEstimating linear models for compositional distributional semantics. M Zanzotto, I Korkontzelos, F Fallucchi, S Manandhar, COLING. M. Zanzotto, I. Korkontzelos, F. Fallucchi, and S. Man- andhar. 2010. Estimating linear models for composi- tional distributional semantics. In COLING.\n\nLearning to map sentences to logical form: Structured classification with probabilistic categorial grammars. L Zettlemoyer, M Collins, UAI. L. Zettlemoyer and M. Collins. 2005. Learning to map sentences to logical form: Structured classifica- tion with probabilistic categorial grammars. In UAI.\n",
            "annotations": {
                "author": "[{\"end\":271,\"start\":197},{\"end\":327,\"start\":272},{\"end\":378,\"start\":328},{\"end\":432,\"start\":379},{\"end\":516,\"start\":433},{\"end\":569,\"start\":517},{\"end\":649,\"start\":570}]",
                "publisher": "[{\"end\":120,\"start\":79},{\"end\":952,\"start\":911}]",
                "author_last_name": "[{\"end\":211,\"start\":205},{\"end\":286,\"start\":277},{\"end\":337,\"start\":335},{\"end\":391,\"start\":385},{\"end\":454,\"start\":447},{\"end\":528,\"start\":526},{\"end\":587,\"start\":582}]",
                "author_first_name": "[{\"end\":204,\"start\":197},{\"end\":276,\"start\":272},{\"end\":332,\"start\":328},{\"end\":334,\"start\":333},{\"end\":384,\"start\":379},{\"end\":444,\"start\":433},{\"end\":446,\"start\":445},{\"end\":523,\"start\":517},{\"end\":525,\"start\":524},{\"end\":581,\"start\":570}]",
                "author_affiliation": "[{\"end\":270,\"start\":232},{\"end\":326,\"start\":288},{\"end\":377,\"start\":339},{\"end\":431,\"start\":393},{\"end\":515,\"start\":477},{\"end\":568,\"start\":530},{\"end\":648,\"start\":610}]",
                "title": "[{\"end\":78,\"start\":1},{\"end\":727,\"start\":650}]",
                "venue": "[{\"end\":815,\"start\":729}]",
                "abstract": "[{\"end\":2067,\"start\":977}]",
                "bib_ref": "[{\"attributes\":{\"ref_id\":\"b38\"},\"end\":2182,\"start\":2157},{\"attributes\":{\"ref_id\":\"b20\"},\"end\":2363,\"start\":2336},{\"attributes\":{\"ref_id\":\"b33\"},\"end\":2383,\"start\":2363},{\"attributes\":{\"ref_id\":\"b43\"},\"end\":2405,\"start\":2383},{\"attributes\":{\"ref_id\":\"b41\"},\"end\":2434,\"start\":2405},{\"attributes\":{\"ref_id\":\"b10\"},\"end\":2460,\"start\":2434},{\"attributes\":{\"ref_id\":\"b24\"},\"end\":3332,\"start\":3313},{\"attributes\":{\"ref_id\":\"b16\"},\"end\":3467,\"start\":3442},{\"attributes\":{\"ref_id\":\"b35\"},\"end\":4644,\"start\":4622},{\"attributes\":{\"ref_id\":\"b38\"},\"end\":5837,\"start\":5812},{\"attributes\":{\"ref_id\":\"b0\"},\"end\":5860,\"start\":5837},{\"attributes\":{\"ref_id\":\"b23\"},\"end\":6016,\"start\":5993},{\"attributes\":{\"ref_id\":\"b7\"},\"end\":6035,\"start\":6016},{\"attributes\":{\"ref_id\":\"b1\"},\"end\":6250,\"start\":6229},{\"attributes\":{\"ref_id\":\"b5\"},\"end\":6375,\"start\":6347},{\"attributes\":{\"ref_id\":\"b13\"},\"end\":6394,\"start\":6375},{\"attributes\":{\"ref_id\":\"b35\"},\"end\":6503,\"start\":6481},{\"attributes\":{\"ref_id\":\"b26\"},\"end\":6954,\"start\":6941},{\"attributes\":{\"ref_id\":\"b40\"},\"end\":6985,\"start\":6970},{\"attributes\":{\"ref_id\":\"b4\"},\"end\":7038,\"start\":7014},{\"attributes\":{\"ref_id\":\"b31\"},\"end\":7117,\"start\":7087},{\"attributes\":{\"ref_id\":\"b41\"},\"end\":7205,\"start\":7176},{\"attributes\":{\"ref_id\":\"b35\"},\"end\":7697,\"start\":7675},{\"attributes\":{\"ref_id\":\"b44\"},\"end\":7962,\"start\":7931},{\"attributes\":{\"ref_id\":\"b3\"},\"end\":8330,\"start\":8317},{\"attributes\":{\"ref_id\":\"b11\"},\"end\":8348,\"start\":8335},{\"attributes\":{\"ref_id\":\"b28\"},\"end\":8450,\"start\":8436},{\"attributes\":{\"ref_id\":\"b37\"},\"end\":8607,\"start\":8583},{\"attributes\":{\"ref_id\":\"b15\"},\"end\":8629,\"start\":8607},{\"attributes\":{\"ref_id\":\"b29\"},\"end\":8697,\"start\":8671},{\"attributes\":{\"ref_id\":\"b42\"},\"end\":8761,\"start\":8744},{\"attributes\":{\"ref_id\":\"b25\"},\"end\":8913,\"start\":8893},{\"attributes\":{\"ref_id\":\"b32\"},\"end\":8941,\"start\":8915},{\"attributes\":{\"ref_id\":\"b27\"},\"end\":9244,\"start\":9218},{\"attributes\":{\"ref_id\":\"b21\"},\"end\":9270,\"start\":9244},{\"attributes\":{\"ref_id\":\"b30\"},\"end\":9292,\"start\":9270},{\"attributes\":{\"ref_id\":\"b22\"},\"end\":9314,\"start\":9292},{\"attributes\":{\"ref_id\":\"b39\"},\"end\":9771,\"start\":9752},{\"attributes\":{\"ref_id\":\"b24\"},\"end\":10432,\"start\":10413},{\"attributes\":{\"ref_id\":\"b16\"},\"end\":11027,\"start\":11003},{\"attributes\":{\"ref_id\":\"b8\"},\"end\":14418,\"start\":14392},{\"attributes\":{\"ref_id\":\"b34\"},\"end\":14439,\"start\":14418},{\"attributes\":{\"ref_id\":\"b35\"},\"end\":15292,\"start\":15270},{\"attributes\":{\"ref_id\":\"b28\"},\"end\":15345,\"start\":15331},{\"attributes\":{\"ref_id\":\"b8\"},\"end\":21081,\"start\":21055},{\"attributes\":{\"ref_id\":\"b33\"},\"end\":21101,\"start\":21081},{\"end\":21867,\"start\":21864},{\"attributes\":{\"ref_id\":\"b6\"},\"end\":22061,\"start\":22041},{\"attributes\":{\"ref_id\":\"b17\"},\"end\":25638,\"start\":25624},{\"attributes\":{\"ref_id\":\"b2\"},\"end\":25654,\"start\":25638},{\"attributes\":{\"ref_id\":\"b19\"},\"end\":25666,\"start\":25654},{\"attributes\":{\"ref_id\":\"b12\"},\"end\":27521,\"start\":27509},{\"attributes\":{\"ref_id\":\"b14\"},\"end\":27534,\"start\":27521}]",
                "figure": "[{\"attributes\":{\"id\":\"fig_2\"},\"end\":31283,\"start\":30967},{\"attributes\":{\"id\":\"fig_3\"},\"end\":31548,\"start\":31284},{\"attributes\":{\"id\":\"fig_4\"},\"end\":31732,\"start\":31549},{\"attributes\":{\"id\":\"fig_5\"},\"end\":31923,\"start\":31733},{\"attributes\":{\"id\":\"fig_6\"},\"end\":32004,\"start\":31924},{\"attributes\":{\"id\":\"fig_7\"},\"end\":32103,\"start\":32005},{\"attributes\":{\"id\":\"fig_8\"},\"end\":32369,\"start\":32104},{\"attributes\":{\"id\":\"fig_9\"},\"end\":32527,\"start\":32370},{\"attributes\":{\"id\":\"tab_3\",\"type\":\"table\"},\"end\":32700,\"start\":32528}]",
                "paragraph": "[{\"end\":3088,\"start\":2083},{\"end\":4138,\"start\":3090},{\"end\":5258,\"start\":4140},{\"end\":5408,\"start\":5260},{\"end\":5597,\"start\":5425},{\"end\":6612,\"start\":5625},{\"end\":7788,\"start\":6651},{\"end\":8174,\"start\":7806},{\"end\":8762,\"start\":8176},{\"end\":9315,\"start\":8786},{\"end\":10051,\"start\":9347},{\"end\":10289,\"start\":10053},{\"end\":12416,\"start\":10291},{\"end\":13118,\"start\":12444},{\"end\":13329,\"start\":13120},{\"end\":13761,\"start\":13331},{\"end\":13989,\"start\":13763},{\"end\":14257,\"start\":14015},{\"end\":14664,\"start\":14291},{\"end\":15623,\"start\":14699},{\"end\":16184,\"start\":15653},{\"end\":16569,\"start\":16186},{\"end\":16690,\"start\":16571},{\"end\":17010,\"start\":16727},{\"end\":18197,\"start\":17051},{\"end\":18387,\"start\":18260},{\"end\":18552,\"start\":18424},{\"end\":18852,\"start\":18595},{\"end\":19117,\"start\":18854},{\"end\":19529,\"start\":19155},{\"end\":19927,\"start\":19531},{\"end\":20371,\"start\":19966},{\"end\":20590,\"start\":20411},{\"end\":21161,\"start\":20592},{\"end\":21334,\"start\":21207},{\"end\":21585,\"start\":21441},{\"end\":21830,\"start\":21636},{\"end\":21919,\"start\":21832},{\"end\":22118,\"start\":21972},{\"end\":22332,\"start\":22134},{\"end\":23454,\"start\":22334},{\"end\":23794,\"start\":23456},{\"end\":24454,\"start\":23837},{\"end\":24576,\"start\":24456},{\"end\":25293,\"start\":24611},{\"end\":26141,\"start\":25337},{\"end\":27098,\"start\":26181},{\"end\":27135,\"start\":27100},{\"end\":28388,\"start\":27137},{\"end\":29730,\"start\":28390},{\"end\":30058,\"start\":29785},{\"end\":30250,\"start\":30060},{\"end\":30369,\"start\":30252},{\"end\":30966,\"start\":30384}]",
                "formula": "[{\"attributes\":{\"id\":\"formula_0\"},\"end\":14014,\"start\":13990},{\"attributes\":{\"id\":\"formula_1\"},\"end\":14698,\"start\":14665},{\"attributes\":{\"id\":\"formula_2\"},\"end\":16726,\"start\":16691},{\"attributes\":{\"id\":\"formula_3\"},\"end\":18259,\"start\":18198},{\"attributes\":{\"id\":\"formula_4\"},\"end\":18423,\"start\":18388},{\"attributes\":{\"id\":\"formula_5\"},\"end\":18594,\"start\":18553},{\"attributes\":{\"id\":\"formula_6\"},\"end\":19965,\"start\":19928},{\"attributes\":{\"id\":\"formula_7\"},\"end\":20410,\"start\":20372},{\"attributes\":{\"id\":\"formula_8\"},\"end\":21206,\"start\":21162},{\"attributes\":{\"id\":\"formula_9\"},\"end\":21440,\"start\":21335},{\"attributes\":{\"id\":\"formula_10\"},\"end\":21635,\"start\":21586},{\"attributes\":{\"id\":\"formula_11\"},\"end\":21971,\"start\":21920}]",
                "table_ref": "[{\"end\":24894,\"start\":24887},{\"attributes\":{\"ref_id\":\"tab_3\"},\"end\":26706,\"start\":26699},{\"attributes\":{\"ref_id\":\"tab_3\"},\"end\":27687,\"start\":27680},{\"end\":29632,\"start\":29625},{\"end\":29967,\"start\":29960}]",
                "section_header": "[{\"attributes\":{\"n\":\"1\"},\"end\":2081,\"start\":2069},{\"attributes\":{\"n\":\"2\"},\"end\":5423,\"start\":5411},{\"end\":5623,\"start\":5600},{\"end\":6649,\"start\":6615},{\"end\":7804,\"start\":7791},{\"end\":8784,\"start\":8765},{\"attributes\":{\"n\":\"3\"},\"end\":9345,\"start\":9318},{\"attributes\":{\"n\":\"4\"},\"end\":12442,\"start\":12419},{\"attributes\":{\"n\":\"4.1\"},\"end\":14289,\"start\":14260},{\"attributes\":{\"n\":\"4.2\"},\"end\":15651,\"start\":15626},{\"attributes\":{\"n\":\"4.3\"},\"end\":17049,\"start\":17013},{\"attributes\":{\"n\":\"4.4\"},\"end\":19153,\"start\":19120},{\"attributes\":{\"n\":\"5\"},\"end\":22132,\"start\":22121},{\"attributes\":{\"n\":\"5.1\"},\"end\":23835,\"start\":23797},{\"attributes\":{\"n\":\"5.2\"},\"end\":24609,\"start\":24579},{\"attributes\":{\"n\":\"5.3\"},\"end\":25335,\"start\":25296},{\"attributes\":{\"n\":\"5.4\"},\"end\":26179,\"start\":26144},{\"attributes\":{\"n\":\"5.5\"},\"end\":29783,\"start\":29733},{\"attributes\":{\"n\":\"6\"},\"end\":30382,\"start\":30372},{\"end\":30978,\"start\":30968},{\"end\":31295,\"start\":31285},{\"end\":31560,\"start\":31550},{\"end\":31744,\"start\":31734},{\"end\":31935,\"start\":31925},{\"end\":32016,\"start\":32006},{\"end\":32115,\"start\":32105},{\"end\":32382,\"start\":32371},{\"end\":32538,\"start\":32529}]",
                "table": null,
                "figure_caption": "[{\"end\":31283,\"start\":30980},{\"end\":31548,\"start\":31297},{\"end\":31732,\"start\":31562},{\"end\":31923,\"start\":31746},{\"end\":32004,\"start\":31937},{\"end\":32103,\"start\":32018},{\"end\":32369,\"start\":32117},{\"end\":32527,\"start\":32385},{\"end\":32700,\"start\":32540}]",
                "figure_ref": "[{\"end\":2574,\"start\":2566},{\"end\":3691,\"start\":3685},{\"end\":10485,\"start\":10477},{\"end\":11227,\"start\":11221},{\"attributes\":{\"ref_id\":\"fig_2\"},\"end\":11544,\"start\":11538},{\"attributes\":{\"ref_id\":\"fig_3\"},\"end\":12650,\"start\":12644},{\"attributes\":{\"ref_id\":\"fig_4\"},\"end\":18018,\"start\":18012},{\"attributes\":{\"ref_id\":\"fig_2\"},\"end\":23970,\"start\":23964},{\"attributes\":{\"ref_id\":\"fig_5\"},\"end\":24103,\"start\":24097},{\"attributes\":{\"ref_id\":\"fig_6\"},\"end\":25674,\"start\":25668},{\"attributes\":{\"ref_id\":\"fig_7\"},\"end\":26570,\"start\":26564},{\"attributes\":{\"ref_id\":\"fig_7\"},\"end\":27799,\"start\":27793},{\"attributes\":{\"ref_id\":\"fig_8\"},\"end\":27982,\"start\":27976},{\"attributes\":{\"ref_id\":\"fig_9\"},\"end\":30142,\"start\":30135}]",
                "bib_author_first_name": "[{\"end\":32877,\"start\":32876},{\"end\":32887,\"start\":32886},{\"end\":33111,\"start\":33110},{\"end\":33121,\"start\":33120},{\"end\":33133,\"start\":33132},{\"end\":33144,\"start\":33143},{\"end\":33395,\"start\":33394},{\"end\":33577,\"start\":33576},{\"end\":33744,\"start\":33743},{\"end\":33753,\"start\":33752},{\"end\":34147,\"start\":34146},{\"end\":34160,\"start\":34159},{\"end\":34400,\"start\":34399},{\"end\":34409,\"start\":34408},{\"end\":34418,\"start\":34417},{\"end\":34637,\"start\":34636},{\"end\":34644,\"start\":34643},{\"end\":34846,\"start\":34845},{\"end\":34856,\"start\":34855},{\"end\":35289,\"start\":35288},{\"end\":35305,\"start\":35304},{\"end\":35537,\"start\":35536},{\"end\":35556,\"start\":35552},{\"end\":35564,\"start\":35563},{\"end\":35573,\"start\":35572},{\"end\":35816,\"start\":35815},{\"end\":35818,\"start\":35817},{\"end\":36002,\"start\":36001},{\"end\":36004,\"start\":36003},{\"end\":36229,\"start\":36228},{\"end\":36231,\"start\":36230},{\"end\":36240,\"start\":36239},{\"end\":36250,\"start\":36249},{\"end\":36252,\"start\":36251},{\"end\":36263,\"start\":36262},{\"end\":36265,\"start\":36264},{\"end\":36486,\"start\":36485},{\"end\":36694,\"start\":36693},{\"end\":36706,\"start\":36705},{\"end\":36709,\"start\":36707},{\"end\":36717,\"start\":36716},{\"end\":36727,\"start\":36726},{\"end\":36904,\"start\":36903},{\"end\":36913,\"start\":36912},{\"end\":36915,\"start\":36914},{\"end\":37050,\"start\":37049},{\"end\":37316,\"start\":37308},{\"end\":37330,\"start\":37323},{\"end\":37493,\"start\":37492},{\"end\":37926,\"start\":37925},{\"end\":37938,\"start\":37937},{\"end\":38116,\"start\":38115},{\"end\":38128,\"start\":38127},{\"end\":38456,\"start\":38455},{\"end\":38468,\"start\":38467},{\"end\":38476,\"start\":38475},{\"end\":38700,\"start\":38699},{\"end\":38708,\"start\":38707},{\"end\":38983,\"start\":38982},{\"end\":38991,\"start\":38990},{\"end\":39246,\"start\":39245},{\"end\":39254,\"start\":39253},{\"end\":39430,\"start\":39429},{\"end\":39432,\"start\":39431},{\"end\":39620,\"start\":39619},{\"end\":39631,\"start\":39630},{\"end\":40067,\"start\":40066},{\"end\":40069,\"start\":40068},{\"end\":40283,\"start\":40282},{\"end\":40294,\"start\":40293},{\"end\":40308,\"start\":40307},{\"end\":40310,\"start\":40309},{\"end\":40558,\"start\":40557},{\"end\":40570,\"start\":40569},{\"end\":40582,\"start\":40581},{\"end\":40593,\"start\":40592},{\"end\":40595,\"start\":40594},{\"end\":40605,\"start\":40604},{\"end\":41162,\"start\":41161},{\"end\":41173,\"start\":41172},{\"end\":41340,\"start\":41339},{\"end\":41350,\"start\":41349},{\"end\":41576,\"start\":41575},{\"end\":41586,\"start\":41585},{\"end\":41588,\"start\":41587},{\"end\":41599,\"start\":41598},{\"end\":41601,\"start\":41600},{\"end\":42078,\"start\":42077},{\"end\":42088,\"start\":42087},{\"end\":42095,\"start\":42094},{\"end\":42097,\"start\":42096},{\"end\":42103,\"start\":42102},{\"end\":42105,\"start\":42104},{\"end\":42341,\"start\":42340},{\"end\":42351,\"start\":42350},{\"end\":42365,\"start\":42364},{\"end\":42367,\"start\":42366},{\"end\":42376,\"start\":42375},{\"end\":42378,\"start\":42377},{\"end\":42384,\"start\":42383},{\"end\":42386,\"start\":42385},{\"end\":42634,\"start\":42633},{\"end\":42644,\"start\":42643},{\"end\":42653,\"start\":42652},{\"end\":42655,\"start\":42654},{\"end\":42666,\"start\":42665},{\"end\":42668,\"start\":42667},{\"end\":42888,\"start\":42887},{\"end\":42901,\"start\":42900},{\"end\":42918,\"start\":42917},{\"end\":42920,\"start\":42919},{\"end\":43144,\"start\":43143},{\"end\":43146,\"start\":43145},{\"end\":43156,\"start\":43155},{\"end\":43458,\"start\":43457},{\"end\":43466,\"start\":43465},{\"end\":43473,\"start\":43472},{\"end\":43487,\"start\":43486},{\"end\":43494,\"start\":43493},{\"end\":43862,\"start\":43861},{\"end\":44188,\"start\":44187},{\"end\":44203,\"start\":44202},{\"end\":44398,\"start\":44397},{\"end\":44404,\"start\":44403},{\"end\":44412,\"start\":44411},{\"end\":44627,\"start\":44626},{\"end\":44639,\"start\":44638},{\"end\":44655,\"start\":44654},{\"end\":44668,\"start\":44667},{\"end\":44951,\"start\":44950},{\"end\":44966,\"start\":44965}]",
                "bib_author_last_name": "[{\"end\":32884,\"start\":32878},{\"end\":32893,\"start\":32888},{\"end\":33118,\"start\":33112},{\"end\":33130,\"start\":33122},{\"end\":33141,\"start\":33134},{\"end\":33151,\"start\":33145},{\"end\":33405,\"start\":33396},{\"end\":33584,\"start\":33578},{\"end\":33750,\"start\":33745},{\"end\":33760,\"start\":33754},{\"end\":34157,\"start\":34148},{\"end\":34167,\"start\":34161},{\"end\":34406,\"start\":34401},{\"end\":34415,\"start\":34410},{\"end\":34425,\"start\":34419},{\"end\":34641,\"start\":34638},{\"end\":34649,\"start\":34645},{\"end\":34853,\"start\":34847},{\"end\":34864,\"start\":34857},{\"end\":35302,\"start\":35290},{\"end\":35315,\"start\":35306},{\"end\":35550,\"start\":35538},{\"end\":35561,\"start\":35557},{\"end\":35570,\"start\":35565},{\"end\":35583,\"start\":35574},{\"end\":35591,\"start\":35585},{\"end\":35825,\"start\":35819},{\"end\":36009,\"start\":36005},{\"end\":36237,\"start\":36232},{\"end\":36247,\"start\":36241},{\"end\":36260,\"start\":36253},{\"end\":36268,\"start\":36266},{\"end\":36493,\"start\":36487},{\"end\":36703,\"start\":36695},{\"end\":36714,\"start\":36710},{\"end\":36724,\"start\":36718},{\"end\":36737,\"start\":36728},{\"end\":36910,\"start\":36905},{\"end\":36923,\"start\":36916},{\"end\":37057,\"start\":37051},{\"end\":37321,\"start\":37317},{\"end\":37499,\"start\":37494},{\"end\":37935,\"start\":37927},{\"end\":37945,\"start\":37939},{\"end\":38125,\"start\":38117},{\"end\":38135,\"start\":38129},{\"end\":38465,\"start\":38457},{\"end\":38473,\"start\":38469},{\"end\":38486,\"start\":38477},{\"end\":38705,\"start\":38701},{\"end\":38715,\"start\":38709},{\"end\":38988,\"start\":38984},{\"end\":38995,\"start\":38992},{\"end\":39251,\"start\":39247},{\"end\":39258,\"start\":39255},{\"end\":39438,\"start\":39433},{\"end\":39628,\"start\":39621},{\"end\":39638,\"start\":39632},{\"end\":40077,\"start\":40070},{\"end\":40291,\"start\":40284},{\"end\":40305,\"start\":40295},{\"end\":40317,\"start\":40311},{\"end\":40567,\"start\":40559},{\"end\":40579,\"start\":40571},{\"end\":40590,\"start\":40583},{\"end\":40602,\"start\":40596},{\"end\":40617,\"start\":40606},{\"end\":41170,\"start\":41163},{\"end\":41184,\"start\":41174},{\"end\":41347,\"start\":41341},{\"end\":41359,\"start\":41351},{\"end\":41583,\"start\":41577},{\"end\":41596,\"start\":41589},{\"end\":41604,\"start\":41602},{\"end\":42085,\"start\":42079},{\"end\":42092,\"start\":42089},{\"end\":42100,\"start\":42098},{\"end\":42113,\"start\":42106},{\"end\":42348,\"start\":42342},{\"end\":42362,\"start\":42352},{\"end\":42373,\"start\":42368},{\"end\":42381,\"start\":42379},{\"end\":42394,\"start\":42387},{\"end\":42641,\"start\":42635},{\"end\":42650,\"start\":42645},{\"end\":42663,\"start\":42656},{\"end\":42671,\"start\":42669},{\"end\":42898,\"start\":42889},{\"end\":42915,\"start\":42902},{\"end\":42930,\"start\":42921},{\"end\":43153,\"start\":43147},{\"end\":43163,\"start\":43157},{\"end\":43463,\"start\":43459},{\"end\":43470,\"start\":43467},{\"end\":43484,\"start\":43474},{\"end\":43491,\"start\":43488},{\"end\":43504,\"start\":43495},{\"end\":43870,\"start\":43863},{\"end\":44200,\"start\":44189},{\"end\":44210,\"start\":44204},{\"end\":44401,\"start\":44399},{\"end\":44409,\"start\":44405},{\"end\":44418,\"start\":44413},{\"end\":44636,\"start\":44628},{\"end\":44652,\"start\":44640},{\"end\":44665,\"start\":44656},{\"end\":44678,\"start\":44669},{\"end\":44963,\"start\":44952},{\"end\":44974,\"start\":44967}]",
                "bib_entry": "[{\"attributes\":{\"id\":\"b0\",\"matched_paper_id\":5584134},\"end\":33069,\"start\":32805},{\"attributes\":{\"id\":\"b1\",\"matched_paper_id\":221275765},\"end\":33302,\"start\":33071},{\"attributes\":{\"id\":\"b2\"},\"end\":33530,\"start\":33304},{\"attributes\":{\"doi\":\"abs/1102.1808\",\"id\":\"b3\"},\"end\":33684,\"start\":33532},{\"attributes\":{\"id\":\"b4\",\"matched_paper_id\":2280191},\"end\":34042,\"start\":33686},{\"attributes\":{\"id\":\"b5\",\"matched_paper_id\":2617020},\"end\":34319,\"start\":34044},{\"attributes\":{\"id\":\"b6\",\"matched_paper_id\":538820},\"end\":34573,\"start\":34321},{\"attributes\":{\"id\":\"b7\",\"matched_paper_id\":1588782},\"end\":34754,\"start\":34575},{\"attributes\":{\"id\":\"b8\",\"matched_paper_id\":6536466},\"end\":35200,\"start\":34756},{\"attributes\":{\"id\":\"b9\",\"matched_paper_id\":326903},\"end\":35459,\"start\":35202},{\"attributes\":{\"id\":\"b10\",\"matched_paper_id\":15659560},\"end\":35753,\"start\":35461},{\"attributes\":{\"id\":\"b11\",\"matched_paper_id\":7544770},\"end\":35968,\"start\":35755},{\"attributes\":{\"id\":\"b12\"},\"end\":36146,\"start\":35970},{\"attributes\":{\"id\":\"b13\",\"matched_paper_id\":372093},\"end\":36421,\"start\":36148},{\"attributes\":{\"id\":\"b14\",\"matched_paper_id\":18053023},\"end\":36635,\"start\":36423},{\"attributes\":{\"id\":\"b15\",\"matched_paper_id\":10854724},\"end\":36869,\"start\":36637},{\"attributes\":{\"id\":\"b16\",\"matched_paper_id\":11495042},\"end\":37005,\"start\":36871},{\"attributes\":{\"id\":\"b17\"},\"end\":37304,\"start\":37007},{\"attributes\":{\"id\":\"b18\"},\"end\":37379,\"start\":37306},{\"attributes\":{\"id\":\"b19\",\"matched_paper_id\":16856475},\"end\":37872,\"start\":37381},{\"attributes\":{\"id\":\"b20\",\"matched_paper_id\":26901423},\"end\":38090,\"start\":37874},{\"attributes\":{\"id\":\"b21\",\"matched_paper_id\":32599709},\"end\":38372,\"start\":38092},{\"attributes\":{\"id\":\"b22\"},\"end\":38641,\"start\":38374},{\"attributes\":{\"id\":\"b23\",\"matched_paper_id\":7747235},\"end\":38875,\"start\":38643},{\"attributes\":{\"id\":\"b24\",\"matched_paper_id\":3264224},\"end\":39155,\"start\":38877},{\"attributes\":{\"id\":\"b25\"},\"end\":39390,\"start\":39157},{\"attributes\":{\"id\":\"b26\",\"matched_paper_id\":2352281},\"end\":39588,\"start\":39392},{\"attributes\":{\"id\":\"b27\",\"matched_paper_id\":8975187},\"end\":40025,\"start\":39590},{\"attributes\":{\"id\":\"b28\",\"matched_paper_id\":770011},\"end\":40206,\"start\":40027},{\"attributes\":{\"id\":\"b29\"},\"end\":40457,\"start\":40208},{\"attributes\":{\"id\":\"b30\",\"matched_paper_id\":14805740},\"end\":41112,\"start\":40459},{\"attributes\":{\"id\":\"b31\",\"matched_paper_id\":2678583},\"end\":41281,\"start\":41114},{\"attributes\":{\"id\":\"b32\",\"matched_paper_id\":2279432},\"end\":41476,\"start\":41283},{\"attributes\":{\"id\":\"b33\",\"matched_paper_id\":9923502},\"end\":41999,\"start\":41478},{\"attributes\":{\"id\":\"b34\",\"matched_paper_id\":18690358},\"end\":42259,\"start\":42001},{\"attributes\":{\"id\":\"b35\",\"matched_paper_id\":3116311},\"end\":42566,\"start\":42261},{\"attributes\":{\"id\":\"b36\",\"matched_paper_id\":806709},\"end\":42812,\"start\":42568},{\"attributes\":{\"id\":\"b37\",\"matched_paper_id\":14474967},\"end\":43080,\"start\":42814},{\"attributes\":{\"id\":\"b38\",\"matched_paper_id\":1500900},\"end\":43363,\"start\":43082},{\"attributes\":{\"id\":\"b39\",\"matched_paper_id\":2091504},\"end\":43804,\"start\":43365},{\"attributes\":{\"id\":\"b40\",\"matched_paper_id\":12044606},\"end\":44127,\"start\":43806},{\"attributes\":{\"id\":\"b41\",\"matched_paper_id\":6721431},\"end\":44324,\"start\":44129},{\"attributes\":{\"id\":\"b42\",\"matched_paper_id\":1762679},\"end\":44555,\"start\":44326},{\"attributes\":{\"id\":\"b43\",\"matched_paper_id\":15616495},\"end\":44839,\"start\":44557},{\"attributes\":{\"id\":\"b44\",\"matched_paper_id\":449252},\"end\":45136,\"start\":44841}]",
                "bib_title": "[{\"end\":32874,\"start\":32805},{\"end\":33108,\"start\":33071},{\"end\":33741,\"start\":33686},{\"end\":34144,\"start\":34044},{\"end\":34397,\"start\":34321},{\"end\":34634,\"start\":34575},{\"end\":34843,\"start\":34756},{\"end\":35286,\"start\":35202},{\"end\":35534,\"start\":35461},{\"end\":35813,\"start\":35755},{\"end\":36226,\"start\":36148},{\"end\":36483,\"start\":36423},{\"end\":36691,\"start\":36637},{\"end\":36901,\"start\":36871},{\"end\":37047,\"start\":37007},{\"end\":37490,\"start\":37381},{\"end\":37923,\"start\":37874},{\"end\":38113,\"start\":38092},{\"end\":38697,\"start\":38643},{\"end\":38980,\"start\":38877},{\"end\":39427,\"start\":39392},{\"end\":39617,\"start\":39590},{\"end\":40064,\"start\":40027},{\"end\":40555,\"start\":40459},{\"end\":41159,\"start\":41114},{\"end\":41337,\"start\":41283},{\"end\":41573,\"start\":41478},{\"end\":42075,\"start\":42001},{\"end\":42338,\"start\":42261},{\"end\":42631,\"start\":42568},{\"end\":42885,\"start\":42814},{\"end\":43141,\"start\":43082},{\"end\":43455,\"start\":43365},{\"end\":43859,\"start\":43806},{\"end\":44185,\"start\":44129},{\"end\":44395,\"start\":44326},{\"end\":44624,\"start\":44557},{\"end\":44948,\"start\":44841}]",
                "bib_author": "[{\"end\":32886,\"start\":32876},{\"end\":32895,\"start\":32886},{\"end\":33120,\"start\":33110},{\"end\":33132,\"start\":33120},{\"end\":33143,\"start\":33132},{\"end\":33153,\"start\":33143},{\"end\":33407,\"start\":33394},{\"end\":33586,\"start\":33576},{\"end\":33752,\"start\":33743},{\"end\":33762,\"start\":33752},{\"end\":34159,\"start\":34146},{\"end\":34169,\"start\":34159},{\"end\":34408,\"start\":34399},{\"end\":34417,\"start\":34408},{\"end\":34427,\"start\":34417},{\"end\":34643,\"start\":34636},{\"end\":34651,\"start\":34643},{\"end\":34855,\"start\":34845},{\"end\":34866,\"start\":34855},{\"end\":35304,\"start\":35288},{\"end\":35317,\"start\":35304},{\"end\":35552,\"start\":35536},{\"end\":35563,\"start\":35552},{\"end\":35572,\"start\":35563},{\"end\":35585,\"start\":35572},{\"end\":35593,\"start\":35585},{\"end\":35827,\"start\":35815},{\"end\":36011,\"start\":36001},{\"end\":36239,\"start\":36228},{\"end\":36249,\"start\":36239},{\"end\":36262,\"start\":36249},{\"end\":36270,\"start\":36262},{\"end\":36495,\"start\":36485},{\"end\":36705,\"start\":36693},{\"end\":36716,\"start\":36705},{\"end\":36726,\"start\":36716},{\"end\":36739,\"start\":36726},{\"end\":36912,\"start\":36903},{\"end\":36925,\"start\":36912},{\"end\":37059,\"start\":37049},{\"end\":37323,\"start\":37308},{\"end\":37333,\"start\":37323},{\"end\":37501,\"start\":37492},{\"end\":37937,\"start\":37925},{\"end\":37947,\"start\":37937},{\"end\":38127,\"start\":38115},{\"end\":38137,\"start\":38127},{\"end\":38467,\"start\":38455},{\"end\":38475,\"start\":38467},{\"end\":38488,\"start\":38475},{\"end\":38707,\"start\":38699},{\"end\":38717,\"start\":38707},{\"end\":38990,\"start\":38982},{\"end\":38997,\"start\":38990},{\"end\":39253,\"start\":39245},{\"end\":39260,\"start\":39253},{\"end\":39440,\"start\":39429},{\"end\":39630,\"start\":39619},{\"end\":39640,\"start\":39630},{\"end\":40079,\"start\":40066},{\"end\":40293,\"start\":40282},{\"end\":40307,\"start\":40293},{\"end\":40319,\"start\":40307},{\"end\":40569,\"start\":40557},{\"end\":40581,\"start\":40569},{\"end\":40592,\"start\":40581},{\"end\":40604,\"start\":40592},{\"end\":40619,\"start\":40604},{\"end\":41172,\"start\":41161},{\"end\":41186,\"start\":41172},{\"end\":41349,\"start\":41339},{\"end\":41361,\"start\":41349},{\"end\":41585,\"start\":41575},{\"end\":41598,\"start\":41585},{\"end\":41606,\"start\":41598},{\"end\":42087,\"start\":42077},{\"end\":42094,\"start\":42087},{\"end\":42102,\"start\":42094},{\"end\":42115,\"start\":42102},{\"end\":42350,\"start\":42340},{\"end\":42364,\"start\":42350},{\"end\":42375,\"start\":42364},{\"end\":42383,\"start\":42375},{\"end\":42396,\"start\":42383},{\"end\":42643,\"start\":42633},{\"end\":42652,\"start\":42643},{\"end\":42665,\"start\":42652},{\"end\":42673,\"start\":42665},{\"end\":42900,\"start\":42887},{\"end\":42917,\"start\":42900},{\"end\":42932,\"start\":42917},{\"end\":43155,\"start\":43143},{\"end\":43165,\"start\":43155},{\"end\":43465,\"start\":43457},{\"end\":43472,\"start\":43465},{\"end\":43486,\"start\":43472},{\"end\":43493,\"start\":43486},{\"end\":43506,\"start\":43493},{\"end\":43872,\"start\":43861},{\"end\":44202,\"start\":44187},{\"end\":44212,\"start\":44202},{\"end\":44403,\"start\":44397},{\"end\":44411,\"start\":44403},{\"end\":44420,\"start\":44411},{\"end\":44638,\"start\":44626},{\"end\":44654,\"start\":44638},{\"end\":44667,\"start\":44654},{\"end\":44680,\"start\":44667},{\"end\":44965,\"start\":44950},{\"end\":44976,\"start\":44965}]",
                "bib_venue": "[{\"end\":33875,\"start\":33827},{\"end\":34997,\"start\":34940},{\"end\":37604,\"start\":37592},{\"end\":38246,\"start\":38200},{\"end\":40817,\"start\":40719},{\"end\":41763,\"start\":41693},{\"end\":43591,\"start\":43557},{\"end\":43985,\"start\":43937},{\"end\":32920,\"start\":32895},{\"end\":33172,\"start\":33153},{\"end\":33392,\"start\":33304},{\"end\":33574,\"start\":33532},{\"end\":33825,\"start\":33762},{\"end\":34173,\"start\":34169},{\"end\":34431,\"start\":34427},{\"end\":34656,\"start\":34651},{\"end\":34938,\"start\":34866},{\"end\":35322,\"start\":35317},{\"end\":35597,\"start\":35593},{\"end\":35850,\"start\":35827},{\"end\":35999,\"start\":35970},{\"end\":36273,\"start\":36270},{\"end\":36515,\"start\":36495},{\"end\":36743,\"start\":36739},{\"end\":36928,\"start\":36925},{\"end\":37090,\"start\":37059},{\"end\":37533,\"start\":37501},{\"end\":37964,\"start\":37947},{\"end\":38198,\"start\":38137},{\"end\":38453,\"start\":38374},{\"end\":38742,\"start\":38717},{\"end\":39000,\"start\":38997},{\"end\":39243,\"start\":39157},{\"end\":39476,\"start\":39440},{\"end\":39702,\"start\":39640},{\"end\":40102,\"start\":40079},{\"end\":40280,\"start\":40208},{\"end\":40717,\"start\":40619},{\"end\":41189,\"start\":41186},{\"end\":41370,\"start\":41361},{\"end\":41691,\"start\":41606},{\"end\":42119,\"start\":42115},{\"end\":42401,\"start\":42396},{\"end\":42678,\"start\":42673},{\"end\":42936,\"start\":42932},{\"end\":43208,\"start\":43165},{\"end\":43555,\"start\":43506},{\"end\":43935,\"start\":43872},{\"end\":44217,\"start\":44212},{\"end\":44431,\"start\":44420},{\"end\":44686,\"start\":44680},{\"end\":44979,\"start\":44976}]"
            }
        }
    },
    "year": 2023,
    "month": 12,
    "day": 17
}